{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "animal_models"}, {"score": 0.004750440867604888, "phrase": "human_biology"}, {"score": 0.004655285779819366, "phrase": "sbv_improver_species_translation_challenge"}, {"score": 0.0045160988337296605, "phrase": "external_cues"}, {"score": 0.004336939968686303, "phrase": "essential_question"}, {"score": 0.003959288961559545, "phrase": "reasonable_alternative"}, {"score": 0.0035900807334877218, "phrase": "systematic_assessments"}, {"score": 0.0035062280202127136, "phrase": "sbv_improver"}, {"score": 0.0034359094594153304, "phrase": "industrial_methodology"}, {"score": 0.003412783661090541, "phrase": "process_verification"}, {"score": 0.0031898890682164212, "phrase": "collaborative_crowd-sourcing_initiative"}, {"score": 0.003063180586734181, "phrase": "multilayer_systems_biology_dataset"}, {"score": 0.0029915976131073825, "phrase": "cytokine_data"}, {"score": 0.0029614320534324104, "phrase": "normal_human_and_rat_bronchial_epithelial_cells"}, {"score": 0.002892219926795975, "phrase": "identical_conditions"}, {"score": 0.0027492917990724467, "phrase": "different_levels"}, {"score": 0.0027307746993761035, "phrase": "biological_organization"}, {"score": 0.0026579417954765137, "phrase": "secreted_factors"}, {"score": 0.0025958041241829254, "phrase": "participating_teams"}, {"score": 0.0024343522820859578, "phrase": "similar_computational_methods"}, {"score": 0.002321834168782981, "phrase": "single_method"}, {"score": 0.0022906498741695094, "phrase": "clear_winner"}, {"score": 0.0022370795358896784, "phrase": "computational_methods"}, {"score": 0.0021847592782091923, "phrase": "specific_stimuli"}, {"score": 0.0021700361584578633, "phrase": "biological_processes"}, {"score": 0.002148136905808445, "phrase": "lung_epithelial_system"}, {"score": 0.0021192805640815795, "phrase": "dna_synthesis"}], "paper_keywords": [""], "paper_abstract": "Motivation: Inferring how humans respond to external cues such as drugs, chemicals, viruses or hormones is an essential question in biomedicine. Very often, however, this question cannot be addressed because it is not possible to perform experiments in humans. A reasonable alternative consists of generating responses in animal models and 'translating' those results to humans. The limitations of such translation, however, are far from clear, and systematic assessments of its actual potential are urgently needed. sbv IMPROVER (systems biology verification for Industrial Methodology for PROcess VErification in Research) was designed as a series of challenges to address translatability between humans and rodents. This collaborative crowd-sourcing initiative invited scientists from around the world to apply their own computational methodologies on a multilayer systems biology dataset composed of phosphoproteomics, transcriptomics and cytokine data derived from normal human and rat bronchial epithelial cells exposed in parallel to 52 different stimuli under identical conditions. Our aim was to understand the limits of species-to-species translatability at different levels of biological organization: signaling, transcriptional and release of secreted factors (such as cytokines). Participating teams submitted 49 different solutions across the sub-challenges, two-thirds of which were statistically significantly better than random. Additionally, similar computational methods were found to range widely in their performance within the same challenge, and no single method emerged as a clear winner across all sub-challenges. Finally, computational methods were able to effectively translate some specific stimuli and biological processes in the lung epithelial system, such as DNA synthesis, cytoskeleton and extracellular matrix, translation, immune/inflammation and growth factor/proliferation pathways, better than the expected response similarity between species.", "paper_title": "Understanding the limits of animal models as predictors of human biology: lessons learned from the sbv IMPROVER Species Translation Challenge", "paper_id": "WOS:000350059600004"}