{"auto_keywords": [{"score": 0.04639713146708781, "phrase": "self-nested_trees"}, {"score": 0.04128527282542329, "phrase": "self-nested_tree"}, {"score": 0.00481495049065317, "phrase": "structural_analysis"}, {"score": 0.004476399615305783, "phrase": "particular_self-nested_structure"}, {"score": 0.004176033420846065, "phrase": "remarkable_compression_properties"}, {"score": 0.004132743580000062, "phrase": "high_compression_rates"}, {"score": 0.0034376160364306637, "phrase": "original_tree"}, {"score": 0.0033317342432676385, "phrase": "initial_tree"}, {"score": 0.0032067276476968032, "phrase": "polynomial_time"}, {"score": 0.0031624392548836654, "phrase": "corresponding_algorithm"}, {"score": 0.0030971473486283664, "phrase": "nearest_embedding_self-nested_tree"}, {"score": 0.0030017207229983385, "phrase": "compression_coefficients"}, {"score": 0.002685558057339722, "phrase": "simulated_theoretical_plants"}, {"score": 0.002657677633954843, "phrase": "different_levels"}, {"score": 0.002436289099444074, "phrase": "whole_approach"}, {"score": 0.0023611760395203106, "phrase": "real_plant"}, {"score": 0.0021795515361987144, "phrase": "biological_terms"}, {"score": 0.002127092664485508, "phrase": "important_aspects"}, {"score": 0.0021049977753042253, "phrase": "plant_growth"}], "paper_keywords": ["Tree reduction", " self-similarity", " tree compression", " tree-to-tree edit distance", " plant architecture", " branching structures", " meristem", " differentiation state"], "paper_abstract": "In this paper, we are interested in the problem of approximating trees by trees with a particular self-nested structure. Self-nested trees are such that all their subtrees of a given height are isomorphic. We show that these trees present remarkable compression properties, with high compression rates. In order to measure how far a tree is from being a self-nested tree, we then study how to quantify the degree of self-nestedness of any tree. For this, we define a measure of the self-nestedness of a tree by constructing a self-nested tree that minimizes the distance of the original tree to the set of self-nested trees that embed the initial tree. We show that this measure can be computed in polynomial time and depict the corresponding algorithm. The distance to this nearest embedding self-nested tree (NEST) is then used to define compression coefficients that reflect the compressibility of a tree. To illustrate this approach, we then apply these notions to the analysis of plant branching structures. Based on a database of simulated theoretical plants in which different levels of noise have been introduced, we evaluate the method and show that the NESTs of such branching structures restore partly or completely the original, noiseless, branching structures. The whole approach is then applied to the analysis of a real plant (a rice panicle) whose topological structure was completely measured. We show that the NEST of this plant may be interpreted in biological terms and may be used to reveal important aspects of the plant growth.", "paper_title": "Quantifying the Degree of Self-Nestedness of Trees: Application to the Structural Analysis of Plants", "paper_id": "WOS:000283559100013"}