{"auto_keywords": [{"score": 0.04707046420780691, "phrase": "network_throughput"}, {"score": 0.0450678547644915, "phrase": "network_resources"}, {"score": 0.015719716506582538, "phrase": "wdm_networks"}, {"score": 0.01561929399941961, "phrase": "shared_light_splitter_bank"}, {"score": 0.009927011123945709, "phrase": "wavelength_converters"}, {"score": 0.006914983752271393, "phrase": "proposed_algorithms"}, {"score": 0.004440277230269978, "phrase": "blocking_probability"}, {"score": 0.004340671055146398, "phrase": "dynamic_requesting"}, {"score": 0.004284755353695709, "phrase": "online_multicast_requests"}, {"score": 0.003912925129722523, "phrase": "economic_multicast_tree"}, {"score": 0.0037150687722055727, "phrase": "sufficient_resources"}, {"score": 0.003493021648360933, "phrase": "multicast_request"}, {"score": 0.003305584108847751, "phrase": "individual_request"}, {"score": 0.00327356326590461, "phrase": "optical_light_splitting"}, {"score": 0.003210446135114967, "phrase": "optical_networks"}, {"score": 0.0026337482179592422, "phrase": "cost_model"}, {"score": 0.002599763359352916, "phrase": "online_multicast_request"}, {"score": 0.002566215899764419, "phrase": "limited_light_splitters"}, {"score": 0.0024283900925346257, "phrase": "light_splitting"}, {"score": 0.0024126686412257407, "phrase": "wavelength_conversion_ability"}, {"score": 0.00233557144141627, "phrase": "cost-optimal_multicast_tree"}, {"score": 0.0022830706430588482, "phrase": "proposed_cost_model"}, {"score": 0.002268750583780571, "phrase": "np"}, {"score": 0.0022029383047842627, "phrase": "heuristic_algorithms"}], "paper_keywords": ["Multicast", " Multicast routing and wavelength assignment", " Shared light splitter bank", " Optimal multicast trees", " WDM networks", " Approximation algorithms", " Heuristic algorithms"], "paper_abstract": "We study online multicasting in WDM networks with shared light splitter bank. Our objective is either to maximize the network throughput or to minimize the blocking probability. Due to the nature of dynamic requesting for network resources by online multicast requests, the network usually is unable to allocate the resources needed for each request in advance. Instead, it either accepts the request by building an economic multicast tree for the request, in terms of the utilization of the network resources if it has sufficient resources available, or rejects the request, otherwise. It is desirable that the cost of realizing each multicast request be minimized, and the network throughput will be maximized ultimately through the cost saving on each individual request. Since optical light splitting and wavelength conversion switching in optical networks is cost expensive and its fabrication is difficult, it is assumed that only a limited number of light splitters and wavelength converters are installed at a node, which will be shared by all the incoming signals at the node. In addition, it is further assumed that only a fraction of nodes in the network are installed with such optical switches. In this article we first propose a cost model for realizing an online multicast request under such network environments with limited light splitters and wavelength converters, which models the cost of utilization of network resources, particularly in modeling the light splitting and wavelength conversion ability at nodes. We then show that finding a cost-optimal multicast tree for a multicast request under the proposed cost model is NP-complete, and instead devise approximation and heuristic algorithms for it. We finally conduct experiments to evaluate the performance of the proposed algorithms. The results show that the proposed algorithms are efficient and effective in terms of network throughput.", "paper_title": "Online multicasting in WDM networks with shared light splitter bank", "paper_id": "WOS:000261607100001"}