{"auto_keywords": [{"score": 0.03660170261865089, "phrase": "minimum_separation_requirement"}, {"score": 0.008195929624484585, "phrase": "ilp-based_optimal_solution"}, {"score": 0.00481495049065317, "phrase": "minimum_separation_requirements"}, {"score": 0.004779406424192843, "phrase": "ubiquitous_computing_environments"}, {"score": 0.004588531238691602, "phrase": "asset_location_monitoring"}, {"score": 0.004554650954322244, "phrase": "visual_surveillance"}, {"score": 0.00450429688285697, "phrase": "human_motion_tracking"}, {"score": 0.004229249483672165, "phrase": "target_area"}, {"score": 0.003840598580753804, "phrase": "meaningful_information"}, {"score": 0.003756086959071893, "phrase": "multiple_sensors"}, {"score": 0.003579280847524597, "phrase": "other-minimum_separation_requirement"}, {"score": 0.0033981387193790353, "phrase": "kim_et_al"}, {"score": 0.0032381300322622654, "phrase": "tre"}, {"score": 0.002995361424576051, "phrase": "mathematical_analysis"}, {"score": 0.0028862231180242053, "phrase": "tre-based_method"}, {"score": 0.002822652835367827, "phrase": "overlaying_method"}, {"score": 0.0023184226291364097, "phrase": "optimal_solution"}, {"score": 0.00222561197623787, "phrase": "proposed_methods"}, {"score": 0.0022091400304857043, "phrase": "real-deployed_systems"}, {"score": 0.0021049977753042253, "phrase": "first_work"}], "paper_keywords": ["sensor placement", " 3-coverage", " minimum separation requirement", " ubiquitous computing"], "paper_abstract": "Sensors have been increasingly used for many ubiquitous computing applications such as asset location monitoring, visual surveillance, and human motion tracking. In such applications, it is important to place sensors such that every point of the target area can be sensed by more than one sensor. Especially, many practical applications require 3-coverage for triangulation, 3D hull building, and etc. Also, in order to extract meaningful information from the data sensed by multiple sensors, those sensors need to be placed not too close to each other-minimum separation requirement. To address the 3-coverage problem with the minimum separation requirement, our recent work (Kim et al. 2008) proposes two heuristic methods, so called, overlaying method and TRE-based method, which complement each other depending on the minimum separation requirement. For these two methods, we also provide mathematical analysis that can clearly guide us when to use the TRE-based method and when to use the overlaying method and also how many sensors are required. To make it self-contained, in this paper, we first revisit the two heuristic methods. Then, as an extension, we present an ILP-based optimal solution targeting for grid coverage. With this ILP-based optimal solution, we investigate how much close the two heuristic methods are to the optimal solution. Finally, this paper discusses the impacts of the proposed methods on real-deployed systems using two example sensor systems. To the best of our knowledge, this is the first work that systematically addresses the 3-coverage problem with the minimum separation requirement.", "paper_title": "Optimal 3-Coverage with Minimum Separation Requirements for Ubiquitous Computing Environments", "paper_id": "WOS:000269534300002"}