{"auto_keywords": [{"score": 0.04613998105509961, "phrase": "pairwise_preference_labels"}, {"score": 0.00481495049065317, "phrase": "pairwise_preferences"}, {"score": 0.004742730438544081, "phrase": "almost_optimal_query_complexity"}, {"score": 0.00464811139983244, "phrase": "set_v"}, {"score": 0.004601508848655033, "phrase": "n_elements"}, {"score": 0.004160319763461951, "phrase": "arbitrary_noise"}, {"score": 0.0031366648074858555, "phrase": "optimal_loss"}, {"score": 0.002709589081384597, "phrase": "open_problem"}, {"score": 0.0025761937402886954, "phrase": "pairwise_information"}, {"score": 0.0024617483174454134, "phrase": "provably_correct_way"}, {"score": 0.0024247382451294255, "phrase": "preference_labels"}, {"score": 0.0022478501955483007, "phrase": "typical_test_case"}, {"score": 0.002202894673025544, "phrase": "large_margin_linear_relaxation"}, {"score": 0.0021263705039915198, "phrase": "simpler_learning_problems"}], "paper_keywords": ["statistical learning theory", " active learning", " ranking", " pairwise ranking", " preferences"], "paper_abstract": "Given a set V of n elements we wish to linearly order them given pairwise preference labels which may be non-transitive (due to irrationality or arbitrary noise). The goal is to linearly order the elements while disagreeing with as few pairwise preference labels as possible. Our performance is measured by two parameters: The number of disagreements (loss) and the query complexity (number of pairwise preference labels). Our algorithm adaptively queries at most O(epsilon(-6)nlog(5)n) preference labels for a regret of e times the optimal loss. As a function of n, this is asymptotically better than standard (non-adaptive) learning bounds achievable for the same problem. Our main result takes us a step closer toward settling an open problem posed by learning-to-rank (from pairwise information) theoreticians and practitioners: What is a provably correct way to sample preference labels? To further show the power and practicality of our solution, we analyze a typical test case in which a large margin linear relaxation is used for efficiently solving the simpler learning problems in our decomposition.", "paper_title": "An Active Learning Algorithm for Ranking from Pairwise Preferences with an Almost Optimal Query Complexity", "paper_id": "WOS:000303045100005"}