{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "exact-match_overlap_graphs"}, {"score": 0.037505133803593146, "phrase": "data_structure"}, {"score": 0.03520388128940442, "phrase": "exact-match_overlap_graph"}, {"score": 0.014671255905163758, "phrase": "length_l"}, {"score": 0.013428079924811539, "phrase": "huge_amount"}, {"score": 0.012887778827698138, "phrase": "overlap_graph"}, {"score": 0.004773150125312769, "phrase": "next-generation_dna_assembly"}, {"score": 0.004639777226195807, "phrase": "dna_assembly"}, {"score": 0.0046095294777639155, "phrase": "shortest_super_string_problem"}, {"score": 0.0043840587461353615, "phrase": "dna_sequencing_technologies"}, {"score": 0.004327068440620642, "phrase": "overlap_graphs"}, {"score": 0.0041423753796657565, "phrase": "dna_assemblers"}, {"score": 0.004052994336120435, "phrase": "next-generation_sequencing_technologies"}, {"score": 0.0036499928957985264, "phrase": "novel_data_structure"}, {"score": 0.003426127602550306, "phrase": "input_strings"}, {"score": 0.003174094403249091, "phrase": "corresponding_reads_overlap"}, {"score": 0.00314649387796333, "phrase": "formal_description"}, {"score": 0.0031191326036930146, "phrase": "maximal_exact-match_overlap"}, {"score": 0.003005468761958771, "phrase": "longest_string"}, {"score": 0.0028644831805171773, "phrase": "edge-weighted_graph"}, {"score": 0.002490746086957026, "phrase": "compact_data_structure"}, {"score": 0.002379041290984059, "phrase": "basic_operation"}, {"score": 0.0021942515654600225, "phrase": "extra_memory"}, {"score": 0.002179911831152078, "phrase": "second_one"}, {"score": 0.0021049977753042253, "phrase": "simulated_data"}], "paper_keywords": [""], "paper_abstract": "Motivation: Exact-match overlap graphs have been broadly used in the context of DNA assembly and the shortest super string problem where the number of strings n ranges from thousands to billions. The length l of the strings is from 25 to 1000, depending on the DNA sequencing technologies. However, many DNA assemblers using overlap graphs suffer from the need for too much time and space in constructing the graphs. It is nearly impossible for these DNA assemblers to handle the huge amount of data produced by the next-generation sequencing technologies where the number n of strings could be several billions. If the overlap graph is explicitly stored, it would require Omega(n(2)) memory, which could be prohibitive in practice when n is greater than a hundred million. In this article, we propose a novel data structure using which the overlap graph can be compactly stored. This data structure requires only linear time to construct and and linear memory to store. Results: For a given set of input strings (also called reads), we can informally define an exact-match overlap graph as follows. Each read is represented as a node in the graph and there is an edge between two nodes if the corresponding reads overlap sufficiently. A formal description follows. The maximal exact-match overlap of two strings x and y, denoted by ov(max)(x, y), is the longest string which is a suffix of x and a prefix of y. The exact-match overlap graph of n given strings of length l is an edge-weighted graph in which each vertex is associated with a string and there is an edge (x, y) of weight omega=l-vertical bar ov(max)(x, y)vertical bar if and only if omega <lambda, where vertical bar ov(max)(x, y)vertical bar is the length of ov(max)(x, y) and lambda is a given threshold. In this article, we show that the exact-match overlap graphs can be represented by a compact data structure that can be stored using at most (2 lambda-1)(2<inverted right perpendicular>lognr+<inverted right perpendicular>log lambda r)n bits with a guarantee that the basic operation of accessing an edge takes O(log lambda) time. We also propose two algorithms for constructing the data structure for the exact-match overlap graph. The first algorithm runs in O(lambda lnlogn) worse-case time and requires O(lambda) extra memory. The second one runs in O(lambda ln) time and requires O(n) extra memory. Our experimental results on a huge amount of simulated data from sequence assembly show that the data structure can be constructed efficiently in time and memory.", "paper_title": "A memory-efficient data structure representing exact-match overlap graphs with application for next-generation DNA assembly", "paper_id": "WOS:000292554900004"}