{"auto_keywords": [{"score": 0.040394741791277736, "phrase": "discourse_markers"}, {"score": 0.008458376585105227, "phrase": "slovenian_language"}, {"score": 0.00481495049065317, "phrase": "spontaneous_speech_corpora"}, {"score": 0.0045357787854931894, "phrase": "speech_translation_technology"}, {"score": 0.004251500979153001, "phrase": "discourse_marker_attribute"}, {"score": 0.0038102613924627647, "phrase": "speech_corpora"}, {"score": 0.0031061129850110994, "phrase": "discourse_marker_category"}, {"score": 0.0023609780669713288, "phrase": "telephone_conversations"}, {"score": 0.0023259039577313294, "phrase": "tourism_domain"}, {"score": 0.002223770196464436, "phrase": "additional_arguments"}], "paper_keywords": ["discourse markers", " speech corpora", " annotating", " conversation", " discourse analysis", " speech-to-speech translation", " spontaneous speech", " Slovenian language"], "paper_abstract": "Speech-to-speech translation technology has difficulties processing elements of spontaneity in conversation. We propose a discourse marker attribute in speech corpora to help overcome some of these problems. There have already been some attempts to annotate discourse markers in speech corpora. However, as there is no consistency on what expressions count as discourse markers, we have to reconsider how to set a framework for annotating, and, in order to better understand what we gain by introducing a discourse marker category, we have to analyse their characteristics and functions in discourse. This is especially important for languages such as Slovenian where no or little research on the topic of discourse markers has been carried out. The aims of this paper are to present a scheme for annotating discourse markers based on the analysis of a corpus of telephone conversations in the tourism domain in the Slovenian language, and to give some additional arguments based on the characteristics and functions of discourse markers that confirm their special status in conversation.", "paper_title": "Annotating discourse markers in spontaneous speech corpora on an example for the Slovenian language", "paper_id": "WOS:000250722300003"}