{"auto_keywords": [{"score": 0.049725544371589304, "phrase": "wireless_mesh_networks"}, {"score": 0.03013731577351118, "phrase": "optimal_strategy"}, {"score": 0.024075534265940248, "phrase": "incompletely_cooperative_game"}, {"score": 0.00481495049065317, "phrase": "incompletely_cooperotive_game_theory"}, {"score": 0.0047090997998449095, "phrase": "game_theory"}, {"score": 0.004639822587124109, "phrase": "useful_and_powerful_tool"}, {"score": 0.004421601997620278, "phrase": "novel_concept"}, {"score": 0.0043889488321824785, "phrase": "incompletely_cooperative_game_theory"}, {"score": 0.004244955499652296, "phrase": "mac_protocols"}, {"score": 0.00403026082093352, "phrase": "current_game_state"}, {"score": 0.003927004211021119, "phrase": "competing_nodes"}, {"score": 0.0036193316508938795, "phrase": "estimated_game_state"}, {"score": 0.003448940584469061, "phrase": "optimal_performance"}, {"score": 0.0028862231180242053, "phrase": "game_state"}, {"score": 0.0024330980793680337, "phrase": "variable_game_state"}, {"score": 0.002353120949568249, "phrase": "simplified_game-theoretic_mac_protocol"}, {"score": 0.0022927343007881846, "phrase": "auto_degressive_backoff_mechanism"}, {"score": 0.0021927897271015657, "phrase": "mesh_nodes"}, {"score": 0.0021604504765314497, "phrase": "simulation_results"}, {"score": 0.0021049977753042253, "phrase": "system_throughput"}], "paper_keywords": [""], "paper_abstract": "Recently, game theory has become a useful and powerful tool in research on wireless mesh networks. In this article the authors present a novel concept of incompletely cooperative game theory and use it to improve the performance of MAC protocols in WMNs. In this game, first, each node estimates the current game state (e.g., the number of competing nodes). Second, the node adjusts its equilibrium strategy by tuning its local contention parameters (e.g., the minimum contention window) to the estimated game state. Finally, the game is repeated several times to get the optimal performance. To use the game effectively in WMNs, the authors present a hybrid CSMA/CA protocol by integrating a proposed virtual CSMA/CA and the standard CSMA/CA protocol. When a node has no packet to send, it contends for the channel in virtual CSMA/CA mode. In this way the node can estimate the game state and obtain the optimal strategy. When a node has packets to send, it contends for the channel in standard CSMA/CA mode with the optimal strategy obtained in virtual CSMA/CA mode, switching smoothly from virtual to standard CSMA/CA mode. At the same time, the node keeps adjusting its strategy to the variable game state. In addition, the authors propose a simplified game-theoretic MAC protocol (G-CSMA/CA) by designing an auto degressive backoff mechanism based on the incompletely cooperative game. G-CSMA/CA can easily be implemented in mesh nodes. Finally, simulation results show that the incompletely cooperative game can increase system throughput, decrease delay, jitter, and packet loss rate, and support the game effectively.", "paper_title": "Using incompletely cooperotive game theory in wireless mesh networks", "paper_id": "WOS:000252577200008"}