{"auto_keywords": [{"score": 0.044819398997809554, "phrase": "clustering_task"}, {"score": 0.028370635137538187, "phrase": "additional_information"}, {"score": 0.015077660962421769, "phrase": "class_s"}, {"score": 0.014890129499398023, "phrase": "hypothesis_space"}, {"score": 0.00481495049065317, "phrase": "positive_data"}, {"score": 0.004784603769908918, "phrase": "present_work_studies"}, {"score": 0.004744437370338926, "phrase": "abstract_point"}, {"score": 0.004645483552103057, "phrase": "inductive_inference"}, {"score": 0.004260800171269249, "phrase": "finite_and_nonempty_set"}, {"score": 0.004242868712089958, "phrase": "r._e._indices"}, {"score": 0.0042250123967577284, "phrase": "pairwise_disjoint"}, {"score": 0.003875011856161857, "phrase": "finite_set"}, {"score": 0.0038343546245999285, "phrase": "pairwise_disjoint_clusters"}, {"score": 0.0035389348527719404, "phrase": "last_condition"}, {"score": 0.003357062328890972, "phrase": "natural_topological_properties"}, {"score": 0.003314817563355729, "phrase": "topological_properties"}, {"score": 0.0032938942910948096, "phrase": "sufficient_or_necessary_conditions"}, {"score": 0.0031245753751284614, "phrase": "well-chosen_numbering"}, {"score": 0.002889778121878728, "phrase": "naturally_geometrically_defined_classes"}, {"score": 0.002758597251689795, "phrase": "convex_hulls"}, {"score": 0.0027469703311742647, "phrase": "finitely_many_points"}, {"score": 0.00272962151901982, "phrase": "rational_vector_space"}, {"score": 0.002551231163230566, "phrase": "overall_number"}, {"score": 0.0023003498123420237, "phrase": "computationally_intractable_clustering_tasks"}, {"score": 0.0022238834225283594, "phrase": "oracle_e"}, {"score": 0.002121191805735799, "phrase": "k"}], "paper_keywords": ["inductive inference", " clustering", " hypothesis space", " numbering", " Turing degree", " topological and geometric properties of clusterable classes"], "paper_abstract": "The present work studies clustering from an abstract point of view and investigates its properties in the framework of inductive inference. Any class S considered is given by a hypothesis space, i.e., numbering, A(0), A(1),... of nonempty recursively enumerable (r. e.) subsets of N or Q(k). A clustering task is a finite and nonempty set of r. e. indices of pairwise disjoint such sets. The class S is said to be clusterable if there is an algorithm which, for every clustering task I, converges in the limit on any text for boolean OR(i is an element of I) A(i) to a finite set J of indices of pairwise disjoint clusters such that boolean OR(j is an element of J) A(j) = boolean OR(i is an element of I) A(i). A class is called semiclusterable if there is such an algorithm which finds a J with the last condition relaxed to boolean OR(j is an element of J) A(j) superset of boolean OR(i is an element of I) A(i). The relationship between natural topological properties and clusterability is investigated. Topological properties can provide sufficient or necessary conditions for clusterability, but they cannot characterize it. On the one hand, many interesting conditions make use of both the topological structure of the class and a well-chosen numbering. On the other hand, the clusterability of a class does not depend on which numbering of the class is used as a hypothesis space for the clusterer. These ideas are demonstrated in the context of naturally geometrically defined classes. Besides the text for the clustering task, clustering of many of these classes requires the following additional information: the class of convex hulls of finitely many points in a rational vector space can be clustered with the number of clusters as additional information. Interestingly, the class of polygons ( together with their interiors) is clusterable if the number of clusters and the overall number of vertices of these clusters is given to the clusterer as additional information. Intriguingly, this additional information is not sufficient for classes including figures with holes. While some classes are unclusterable due to their topological structure, others are only computationally intractable. An oracle might permit clustering all computationally intractable clustering tasks but fail on some classes which are topologically difficult. It is shown that an oracle E permits clustering all computationally difficult classes iff E >=(T) K boolean AND E' >= (T) K ''. Furthermore, no 1- generic oracle below K and no 2-generic oracle permits clustering any class which is not clusterable without an oracle.", "paper_title": "Identifying clusters from positive data", "paper_id": "WOS:000238324600003"}