{"auto_keywords": [{"score": 0.03551729080589432, "phrase": "sbs"}, {"score": 0.02865872484805259, "phrase": "crimon"}, {"score": 0.014616426166440133, "phrase": "component_services"}, {"score": 0.012766681640294743, "phrase": "monitoring_strategies"}, {"score": 0.012546902987554134, "phrase": "critical_path"}, {"score": 0.011663917508654123, "phrase": "cost-effective_monitoring"}, {"score": 0.011462902533101374, "phrase": "response_time"}, {"score": 0.00481495049065317, "phrase": "cost-effective_monitoring_strategies"}, {"score": 0.004781357546476652, "phrase": "service-based_systems"}, {"score": 0.004698392162272106, "phrase": "volatile_environments"}, {"score": 0.004350040802144489, "phrase": "timely_and_successful_delivery"}, {"score": 0.004259582098193949, "phrase": "user_requests"}, {"score": 0.00379452936798156, "phrase": "composite_sbs"}, {"score": 0.0036767202303156854, "phrase": "service_composition"}, {"score": 0.0036382660173943393, "phrase": "maximum_execution_time"}, {"score": 0.003587616378156851, "phrase": "particular_importance"}, {"score": 0.0034640450599342488, "phrase": "entire_sbs."}, {"score": 0.0034398445347109396, "phrase": "volatile_operating_environments"}, {"score": 0.00329813918116714, "phrase": "execution_path"}, {"score": 0.0030319482153908037, "phrase": "different_execution_paths"}, {"score": 0.0025175684590726796, "phrase": "execution_paths"}, {"score": 0.002371783323468861, "phrase": "optimal_monitoring_strategy"}, {"score": 0.0022187920251626257, "phrase": "in-lab_experimental_results"}, {"score": 0.0021049977753042253, "phrase": "crimon-based_monitoring"}], "paper_keywords": ["Service-based system", " web service", " QoS", " response time", " monitoring", " criticality", " cost of monitoring", " value of monitoring"], "paper_abstract": "When operating in volatile environments, service-based systems (SBSs) that are dynamically composed from component services must be monitored in order to guarantee timely and successful delivery of outcomes in response to user requests. However, monitoring consumes resources and very often impacts on the quality of the SBSs being monitored. Such resource and system costs need to be considered in formulating monitoring strategies for SBSs. The critical path of a composite SBS, i.e., the execution path in the service composition with the maximum execution time, is of particular importance in cost-effective monitoring as it determines the response time of the entire SBS. In volatile operating environments, the critical path of an SBS is probabilistic, as every execution path can be critical with a certain probability, i.e., its criticality. As such, it is important to estimate the criticalities of different execution paths when deciding which parts of the SBS to monitor. Furthermore, cost-effective monitoring also requires management of the trade-off between the benefit and cost of monitoring. In this paper, we propose CriMon, a novel approach to formulating and evaluating monitoring strategies for SBSs. CriMon first calculates the criticalities of the execution paths and the component services of an SBS and then, based on those criticalities, generates the optimal monitoring strategy considering both the benefit and cost of monitoring. CriMon has two monitoring strategy formulation methods, namely local optimisation and global optimisation. In-lab experimental results demonstrate that the response time of an SBS can be managed cost-effectively through CriMon-based monitoring. The effectiveness and efficiency of the two monitoring strategy formulation methods are also evaluated and compared.", "paper_title": "Formulating Cost-Effective Monitoring Strategies for Service-Based Systems", "paper_id": "WOS:000337950500003"}