{"auto_keywords": [{"score": 0.03481487178682438, "phrase": "linear_number"}, {"score": 0.00481495049065317, "phrase": "communication_network"}, {"score": 0.004360412703519539, "phrase": "minimum_total_number"}, {"score": 0.0033943947596098583, "phrase": "source_information"}, {"score": 0.003102752392819577, "phrase": "minimum_size"}, {"score": 0.002917736974519881, "phrase": "n-node_network"}, {"score": 0.0025316905609748135, "phrase": "latter_size"}, {"score": 0.0022492129111567824, "phrase": "efficient_wakeup"}, {"score": 0.0022280223816618736, "phrase": "strictly_more_information"}, {"score": 0.0021656385587456952, "phrase": "efficient_broadcast"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Algorithm", " Broadcasting", " Wakeup", " Size of advice", " Message complexity", " Network", " Graph"], "paper_abstract": "We study the amount of knowledge about a communication network that must be given to its nodes in order to efficiently disseminate information. Our approach is quantitative: we investigate the minimum total number of bits of information (minimum size of advice) that has to be available to nodes, regardless of the type of information provided We compare the size of advice needed to perform broadcast and wakeup (the latter is a broadcast in which nodes can transmit only after getting the source information), both using a linear number of messages (which is optimal). We show that the minimum size of advice permitting the wakeup with a linear number of messages in an n-node network, is Theta(n log n), while the broadcast with a linear number of messages can be achieved with advice of size 0(n). We also show that the latter size of advice is almost optimal, no advice of size o(n) can permit to broadcast with a linear number of messages. Thus an efficient wakeup requires strictly more information about the network than an efficient broadcast. (C) 2009 Elsevier Inc. All rights reserved", "paper_title": "Communication algorithms with advice", "paper_id": "WOS:000276825100003"}