{"auto_keywords": [{"score": 0.04932722333571149, "phrase": "automotive_industry"}, {"score": 0.04505268686899412, "phrase": "gm"}, {"score": 0.03372356675093034, "phrase": "autosar"}, {"score": 0.02833188136581836, "phrase": "case_study"}, {"score": 0.00481495049065317, "phrase": "legacy_deployment_models"}, {"score": 0.004544127927346964, "phrase": "model-driven_development"}, {"score": 0.004402854153653114, "phrase": "major_automotive_company"}, {"score": 0.004356741449157895, "phrase": "general_motors"}, {"score": 0.003799275066001196, "phrase": "automotive_open_system_architecture"}, {"score": 0.003437387719239532, "phrase": "different_suppliers"}, {"score": 0.0032954888655173666, "phrase": "growing_demand"}, {"score": 0.0030130446986008277, "phrase": "automotive_software_development"}, {"score": 0.0029346624184926305, "phrase": "model_transformations"}, {"score": 0.0025586903829811296, "phrase": "model_transformation"}, {"score": 0.002518525107994039, "phrase": "mdworkbench_tool"}, {"score": 0.0021957487795963666, "phrase": "similar_types"}], "paper_keywords": ["Model-driven development (MDD)", " Model transformations", " AUTOSAR", " Transformation languages and tools", " Automotive control software", " Black-box testing"], "paper_abstract": "Many companies in the automotive industry have adopted model-driven development in their vehicle software development. As a major automotive company, General Motors (GM) has been using a custom-built, domain-specific modeling language, implemented as an internal proprietary metamodel, to meet the modeling needs in its control software development. Since AUTomotive Open System ARchitecture (AUTOSAR) has been developed as a standard to ease the process of integrating components provided by different suppliers and manufacturers, there has been a growing demand to migrate these GM-specific, legacy models to AUTOSAR models. Given that AUTOSAR defines its own metamodel for various system artifacts in automotive software development, we explore applying model transformations to address the challenges in migrating GM-specific, legacy models to their AUTOSAR equivalents. As a case study, we have built and validated a model transformation using the MDWorkbench tool, the Atlas Transformation Language, and the Metamodel Coverage Checker tool. This paper reports on the case study, makes observations based on our experience to assist in the development of similar types of transformations, and provides recommendations for further research.", "paper_title": "Model transformations for migrating legacy deployment models in the automotive industry", "paper_id": "WOS:000349026100022"}