{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "distributed_ontologies"}, {"score": 0.02277507754776635, "phrase": "redundant_relations"}, {"score": 0.009184909729127033, "phrase": "formal_method"}, {"score": 0.008027632419608103, "phrase": "concept_pairs"}, {"score": 0.00794790065994654, "phrase": "inclusion_relations"}, {"score": 0.004377921202912336, "phrase": "web_system"}, {"score": 0.004101886428528311, "phrase": "concept_lattices"}, {"score": 0.0035648266669315943, "phrase": "descartes'_set"}, {"score": 0.0033735490732324713, "phrase": "concept_lattice"}, {"score": 0.0030823667846259836, "phrase": "integrated_ontology"}, {"score": 0.0029169007179202164, "phrase": "proposed_method"}, {"score": 0.0028163423436499305, "phrase": "nir"}, {"score": 0.002398464540102246, "phrase": "different_concepts"}, {"score": 0.0023864566654035924, "phrase": "practical_implications"}, {"score": 0.00223570488212345, "phrase": "existing_methods"}, {"score": 0.0021049977753042253, "phrase": "human_intervening"}], "paper_keywords": ["Cybernetics", " Integration", " Programming and algorithm theory", " Semantics"], "paper_abstract": "Purpose - The purpose of this paper is to integrate distribut\\ed ontologies on the web system and clarify the structure of the integrated one Design/methodology/approach - A formal method based on concept lattices is introduced as a mechanism to form more general semantic level. By checking the extension and the intension of concept, this method extracts the concept pairs satisfying inclusion relations from descartes' set of concepts in distributed ontologies first, and then constructs a concept lattice according to these concept pairs An algorithm to reduce redundant relations is also proposed to clarify the structure of integrated ontology. Findings - The experiments demonstrate the effectiveness of the proposed method to reduce redundant relations, and the Nir-to-Ner ratio inclines to 1 05 from 3 13. Research limitations/implications - Instances of certain concept are not given completely on the web, so it is difficult to check extension of different concepts Practical implications - A very useful method of integrating distributed ontologies on the web Originality/value Compared with existing methods, this formal method can be performed by program automatically without any human intervening, and can extract the inclusion relations between concepts from distributed ontologies completely.", "paper_title": "A formal method for integrating distributed ontologies and reducing the redundant relations", "paper_id": "WOS:000272687500028"}