{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "gender_differences"}, {"score": 0.04962396550254856, "phrase": "higher_education"}, {"score": 0.004212157020917929, "phrase": "scientific_literature"}, {"score": 0.003902085339580381, "phrase": "co-word_analysis"}, {"score": 0.003791763445590174, "phrase": "main_concepts"}, {"score": 0.0037199473428123175, "phrase": "research_field"}, {"score": 0.0036845490951857617, "phrase": "hierarchical_cluster_analysis"}, {"score": 0.003529364798514874, "phrase": "strategic_diagram"}, {"score": 0.003161740194257218, "phrase": "thomson_reuters_web"}, {"score": 0.0024185182010749273, "phrase": "specific_research_disciplines"}, {"score": 0.0023840346303791032, "phrase": "important_research-field-specific_variations"}, {"score": 0.0022725931637071852, "phrase": "major_research_topics"}], "paper_keywords": ["Gender differences", " Higher education", " Science", " Co-word analysis", " Strategic diagram"], "paper_abstract": "The aim of this study is to map and analyze the structure and evolution of the scientific literature on gender differences in higher education and science, focusing on factors related to differences between 1991 and 2012. Co-word analysis was applied to identify the main concepts addressed in this research field. Hierarchical cluster analysis was used to cluster the keywords and a strategic diagram was created to analyze trends. The data set comprised a corpus containing 652 articles and reviews published between 1991 and 2012, extracted from the Thomson Reuters Web of Science database. In order to see how the results changed over time, documents were grouped into three different periods: 1991-2001, 2002-2007, and 2008-2012. The results showed that the number of themes has increased significantly over the years and that gender differences in higher education and science have been considered by specific research disciplines, suggesting important research-field-specific variations. Overall, the study helps to identify the major research topics in this domain, as well as highlighting issues to be addressed or strengthened in further work.", "paper_title": "Research trends in gender differences in higher education and science: a co-word analysis", "paper_id": "WOS:000342228300013"}