{"auto_keywords": [{"score": 0.04518911541985609, "phrase": "scopus"}, {"score": 0.003939033374807842, "phrase": "citation_rankings"}, {"score": 0.003689628075766217, "phrase": "health_sciences_of_the_university_of_navarra"}, {"score": 0.0036553923815446933, "phrase": "spain"}, {"score": 0.0034398445347109396, "phrase": "total_number"}, {"score": 0.003407839062159497, "phrase": "published_works"}, {"score": 0.0028265633629346617, "phrase": "wos."}, {"score": 0.002684819249720834, "phrase": "clinical_ones"}, {"score": 0.00263505298504827, "phrase": "basic_ones"}, {"score": 0.002422249273477746, "phrase": "similar_results"}, {"score": 0.002388487669097511, "phrase": "spearman_and_kendall-tau_coefficients"}, {"score": 0.0021050040450833873, "phrase": "wos"}], "paper_keywords": [""], "paper_abstract": "In this work, we compare the difference in the number of citations compiled with Scopus as opposed to the Web of Science (WoS) with the aim of analysing the agreement among the citation rankings generated by these databases. For this, we analysed the area of Health Sciences of the University of Navarra (Spain), composed of a total of 50 departments and 864 researchers. The total number of published works reflected in the WoS during the period 1999-2005 was 2299. For each work, the number of citations in both databases was recorded. The results indicate that the works received 14.7% more citations in Scopus than in WoS. In the departments, the difference was greater in the clinical ones than in the basic ones. In the case of the rankings of citations, it was found that both databases generate similar results. The Spearman and Kendall-Tau coefficients were higher than 0.9. It was concluded that the difference in the number of citations found did not correspond to the difference of coverage of WoS and Scopus.", "paper_title": "Ranking of departments and researchers within a university using two different databases: Web of Science versus Scopus", "paper_id": "WOS:000268881700014"}