{"auto_keywords": [{"score": 0.02246846748295755, "phrase": "elsevier"}, {"score": 0.00481495049065317, "phrase": "participatory_contextual_architecture"}, {"score": 0.004762202897268383, "phrase": "mobile_phones"}, {"score": 0.0046328364646343375, "phrase": "modern_architecture"}, {"score": 0.004058951880810154, "phrase": "future_inhabitants"}, {"score": 0.003675517796014622, "phrase": "mobile_phone_technology"}, {"score": 0.0034975571855450343, "phrase": "architecture_process"}, {"score": 0.0033837135367113004, "phrase": "building_site"}, {"score": 0.00327356326590461, "phrase": "archilens"}, {"score": 0.003030247482854539, "phrase": "field_study"}, {"score": 0.0026986685585382347, "phrase": "people's_imagination"}, {"score": 0.002363806685815014, "phrase": "design_process"}, {"score": 0.0022741894748181243, "phrase": "design_alternatives"}], "paper_keywords": ["Context", " Architecture", " Mobile devices", " Field study"], "paper_abstract": "Some movements within modern architecture particularly emphasise the importance of matching buildings to their surroundings. However, practicing such \"contextual architecture\" is highly challenging and typically not something the future inhabitants of a building are well equipped for participating in. This paper explores the potentials of using mobile phone technology for facilitating such client participation in the parts of an architecture process that take place on the building site. For this we introduce ArchiLens, a mobile system for interactive on-site 3D visualisation of houses, and findings from a field study with 40 participants in the process of building or modifying their home. The study showed that using the system helped evoke people's imagination of the look and feel of their future house, and envision it in context. This enabled them to participate more closely in the design process on-site by iteratively reviewing design alternatives and exploring, for example, other placements and materials. (C) 2012 Elsevier B. V. All rights reserved.", "paper_title": "Designing on-site: Facilitating participatory contextual architecture with mobile phones", "paper_id": "WOS:000316681200004"}