{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "fieldwork_studies"}, {"score": 0.00438955582974973, "phrase": "system_development"}, {"score": 0.003976978140059542, "phrase": "design_recommendations"}, {"score": 0.003832423454781517, "phrase": "recurrent_issue"}, {"score": 0.0036703791815812328, "phrase": "computer-supported_cooperative_work"}, {"score": 0.0034720284451902083, "phrase": "particular_system_development_project"}, {"score": 0.0031845067058084613, "phrase": "technology-image_recognition_systems"}, {"score": 0.0030876784650745973, "phrase": "organizational_settings"}, {"score": 0.0029753513692467315, "phrase": "question-surveillance_centers"}, {"score": 0.0026953359825383624, "phrase": "field_studies"}, {"score": 0.002471973283582411, "phrase": "workplace_studies"}, {"score": 0.002367315484467406, "phrase": "key_concepts"}, {"score": 0.0021049977753042253, "phrase": "everyday_environments"}], "paper_keywords": [""], "paper_abstract": "Alongside the emergence of the use of fieldwork studies for design there has been a discussion on how best these studies can inform system development. Concerns have been expressed as to whether their most appropriate contribution is a list of requirements or design recommendations. This article explores a recurrent issue that has emerged from fieldwork studies in Computer-Supported Cooperative Work, awareness, and with respect to a particular system development project discusses some of the implications for the development and deployment of one particular kind of technology-image recognition systems-in particular, organizational settings. In the setting in question-surveillance centers or operations rooms-staff utilize a range of practices to maintain awareness. Rather than extending field studies so that they can better assist design, it may be considered how workplace studies can contribute to a respecification of key concepts, like awareness, that are critical to an understanding of how technologies are used and deployed in everyday environments.", "paper_title": "Discriminating conduct: Deploying systems to support awareness in organizations", "paper_id": "WOS:000255956100004"}