{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "intuitionistic_fuzzy_aggregation_operators"}, {"score": 0.003515162360861593, "phrase": "i-ifha_operator"}, {"score": 0.0033664873319204027, "phrase": "multi-attribute_group_decision-making"}, {"score": 0.002814454488050123, "phrase": "intuitionistic_fuzzy_numbers"}, {"score": 0.0026458370516131255, "phrase": "i-iifha_operator"}, {"score": 0.0026133424923929227, "phrase": "interval-valued_intuitionistic_fuzzy_wa_operator"}, {"score": 0.002471973283582411, "phrase": "attribute_values"}, {"score": 0.0023819914954155905, "phrase": "interval-valued_ifns"}, {"score": 0.002323826502178581, "phrase": "induced_intuitionistic_fuzzy_hybrid_geometric_operator"}, {"score": 0.002295277579105179, "phrase": "induced_interval-valued_intuitionistic_fuzzy_hybrid_geometric_operator"}, {"score": 0.0021049977753042253, "phrase": "developed_approaches"}], "paper_keywords": ["induced intuitionistic fuzzy aggregation operators", " induced interval-valued intuitionistic fuzzy aggregation operators", " intuitionistic fuzzy numbers", " interval-valued intuitionistic fuzzy numbers", " multi-attribute group decision making"], "paper_abstract": "In this paper, we define various induced intuitionistic fuzzy aggregation operators, including induced intuitionistic fuzzy ordered weighted averaging (OWA) operator, induced intuitionistic fuzzy hybrid averaging (I-IFHA) operator, induced interval-valued intuitionistic fuzzy OWA operator, and induced interval-valued intuitionistic fuzzy hybrid averaging (I-IIFHA) operator. We also establish various properties of these operators. And then, an approach based on I-IFHA operator and intuitionistic fuzzy weighted averaging (WA) operator is developed to solve multi-attribute group decision-making (MAGDM) problems. In such problems, attribute weights and the decision makers' (DMs') weights are real numbers and attribute values provided by the DMs are intuitionistic fuzzy numbers (IFNs), and an approach based on I-IIFHA operator and interval-valued intuitionistic fuzzy WA operator is developed to solve MAGDM problems where the attribute values provided by the DMs are interval-valued IFNs. Furthermore, induced intuitionistic fuzzy hybrid geometric operator and induced interval-valued intuitionistic fuzzy hybrid geometric operator are proposed. Finally, a numerical example is presented to illustrate the developed approaches.", "paper_title": "Some induced intuitionistic fuzzy aggregation operators applied to multi-attribute group decision making", "paper_id": "WOS:000296721800003"}