{"auto_keywords": [{"score": 0.042596668738898086, "phrase": "color_information"}, {"score": 0.015257760143699207, "phrase": "color_and_depth_cues"}, {"score": 0.004818731170736711, "phrase": "background"}, {"score": 0.004242085112539693, "phrase": "static_camera"}, {"score": 0.003922011960904278, "phrase": "wrong_estimations"}, {"score": 0.0038516336597530614, "phrase": "perspective_and_illumination_issues"}, {"score": 0.003626000977962191, "phrase": "integrated_use"}, {"score": 0.003213489259323924, "phrase": "foreground_objects"}, {"score": 0.0026326249204932733, "phrase": "well-known_background_subtraction_technique"}, {"score": 0.0024632912250657636, "phrase": "post-processing_mask_fusion_stage"}, {"score": 0.002222717552124615, "phrase": "well-defined_dataset_and_different_disparity_estimation_algorithms"}, {"score": 0.0021049977753042253, "phrase": "fusion_color"}], "paper_keywords": ["Background subtraction", " Stereo", " Disparity", " Computer vision", " Video surveillance"], "paper_abstract": "Background subtraction consists of segmenting objects in movement in a video captured by a static camera. This is typically performed using color information, but it leads to wrong estimations due to perspective and illumination issues. We show that multimodal approaches based on the integrated use of color and depth cues produce more accurate and robust results than using either data source independently. Depth is less affected by issues such as shadows or foreground objects similar to background. However, objects close to the background may not be detected when using only range information, being color information complementary in those cases. We propose an extension of a well-known background subtraction technique which fuses range and color information, as well as a post-processing mask fusion stage to get the best of each feature. We have evaluated the method proposed using a well-defined dataset and different disparity estimation algorithms, showing the benefits of our method for fusion color and depth cues.", "paper_title": "Background subtraction model based on color and depth cues", "paper_id": "WOS:000337091200009"}