{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "multivariate_time_series"}, {"score": 0.04165826455732132, "phrase": "symbolic_time_intervals"}, {"score": 0.00478701880312723, "phrase": "biomedical_data"}, {"score": 0.0047454233418063015, "phrase": "particular_electronic_medical_records"}, {"score": 0.004676895436217523, "phrase": "large_number"}, {"score": 0.004609352548073816, "phrase": "irregular_fashion"}, {"score": 0.004542780650208743, "phrase": "time_point"}, {"score": 0.004336115760817672, "phrase": "multivariate_time_series_data"}, {"score": 0.0042984213731950115, "phrase": "challenging_task"}, {"score": 0.004211731831120046, "phrase": "medical_care"}, {"score": 0.004138813595009761, "phrase": "temporal_abstraction"}, {"score": 0.004055329874540865, "phrase": "raw-data_time_points"}, {"score": 0.003781629193080687, "phrase": "novel_supervised_discretization_method"}, {"score": 0.0037161295884407626, "phrase": "classification_accuracy"}, {"score": 0.0034551632687788857, "phrase": "multivariate_time_series_analysis"}, {"score": 0.003336468343971626, "phrase": "temporal-abstraction_process"}, {"score": 0.0032786537599187125, "phrase": "raw_time-stamped_data_points"}, {"score": 0.0030750809317435304, "phrase": "time_intervals"}, {"score": 0.003048315312818542, "phrase": "frequent_temporal-interval_relation_patterns"}, {"score": 0.0026119782818898193, "phrase": "different_symbolic-state_distribution-distance_measure"}, {"score": 0.0024856733811053243, "phrase": "intensive_care"}, {"score": 0.0024640253074497114, "phrase": "infectious_hepatitis"}, {"score": 0.002414241727802253, "phrase": "better_classification_performance"}, {"score": 0.0023932142697579506, "phrase": "allen's_seven_relations"}, {"score": 0.0023041863978014113, "phrase": "horizontal_support"}, {"score": 0.002264218639227785, "phrase": "tirps_feature_representation"}, {"score": 0.0021991369769963545, "phrase": "classification_performance"}], "paper_keywords": ["Temporal knowledge discovery", " Temporal data mining", " Temporal abstraction", " Time intervals mining", " Frequent pattern mining", " Classification", " Discretization"], "paper_abstract": "Biomedical data, in particular electronic medical records data, include a large number of variables sampled in irregular fashion, often including both time point and time intervals, thus providing several challenges for analysis and data mining. Classification of multivariate time series data is a challenging task, but is often necessary for medical care or research. Increasingly, temporal abstraction, in which a series of raw-data time points is abstracted into a set of symbolic time intervals, is being used for classification of multivariate time series. In this paper, we introduce a novel supervised discretization method, geared towards enhancement of classification accuracy, which determines the cutoffs that will best discriminate among classes through the distribution of their states. We present a framework for classification of multivariate time series analysis, which implements three phases: (1) application of a temporal-abstraction process that transforms a series of raw time-stamped data points into a series of symbolic time intervals (based on either unsupervised or supervised temporal abstraction); (2) mining these time intervals to discover frequent temporal-interval relation patterns (TIRPs), using versions of Allen's 13 temporal relations; (3) using the patterns as features to induce a classifier. We evaluated the framework, focusing on the comparison of three versions of the new, supervised, temporal discretization for classification (TD4C) method, each relying on a different symbolic-state distribution-distance measure among outcome classes, to several commonly used unsupervised methods, on real datasets in the domains of diabetes, intensive care, and infectious hepatitis. Using only three abstract temporal relations resulted in a better classification performance than using Allen's seven relations, especially when using three symbolic states per variable. Similarly when using the horizontal support and mean duration as the TIRPs feature representation, rather than a binary (existence) representation. The classification performance when using the three versions of TD4C was superior to the performance when using the unsupervised (EWD, SAX, and KB) discretization methods.", "paper_title": "Classification-driven temporal discretization of multivariate time series", "paper_id": "WOS:000355753900002"}