{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "temporal_coherence"}, {"score": 0.04966447721457641, "phrase": "stylized_animations"}, {"score": 0.015122790085564091, "phrase": "npr"}, {"score": 0.008153674335490902, "phrase": "existing_methods"}, {"score": 0.004318881178805575, "phrase": "line_drawing"}, {"score": 0.004189337956225294, "phrase": "oil_painting"}, {"score": 0.004063664475797303, "phrase": "greater_flexibility"}, {"score": 0.003958937342925219, "phrase": "traditional_drawing"}, {"score": 0.0038737214010638745, "phrase": "significant_progress"}, {"score": 0.0036288825833675127, "phrase": "active_area"}, {"score": 0.0035507457285983268, "phrase": "main_challenge"}, {"score": 0.0035199624440843892, "phrase": "computer-generated_stylized_animations"}, {"score": 0.0034143003168921114, "phrase": "traditional_drawings"}, {"score": 0.003340768341189764, "phrase": "distracting_flickering"}, {"score": 0.003254610516477302, "phrase": "hand-drawn_animations"}, {"score": 0.002831158147480665, "phrase": "growing_number"}, {"score": 0.0026986685585382347, "phrase": "comprehensive_analysis"}, {"score": 0.0023886641270884973, "phrase": "line_and_region_stylization_methods"}, {"score": 0.002237477619351199, "phrase": "uninformed_readers"}], "paper_keywords": ["non-photorealistic rendering", " temporal coherence", " stylization"], "paper_abstract": "Non-photorealistic rendering (NPR) algorithms allow the creation of images in a variety of styles, ranging from line drawing and pen-and-ink to oil painting and watercolour. These algorithms provide greater flexibility, control and automation over traditional drawing and painting. Despite significant progress over the past 15 years, the application of NPR to the generation of stylized animations remains an active area of research. The main challenge of computer-generated stylized animations is to reproduce the look of traditional drawings and paintings while minimizing distracting flickering and sliding artefacts present in hand-drawn animations. These goals are inherently conflicting and any attempt to address the temporal coherence of stylized animations is a trade-off. This state-of-the-art report is motivated by the growing number of methods proposed in recent years and the need for a comprehensive analysis of the trade-offs they propose. We formalize the problem of temporal coherence in terms of goals and compare existing methods accordingly. We propose an analysis for both line and region stylization methods and discuss initial steps towards their perceptual evaluation. The goal of our report is to help uninformed readers to choose the method that best suits their needs, as well as motivate further research to address the limitations of existing methods.", "paper_title": "State-of-the-Art Report on Temporal Coherence for Stylized Animations", "paper_id": "WOS:000297317200018"}