{"auto_keywords": [{"score": 0.03511913456910414, "phrase": "transmission_costs"}, {"score": 0.019441142551694813, "phrase": "two-tier_hpns"}, {"score": 0.007922696582576334, "phrase": "traditional_facility_location_problem"}, {"score": 0.007789018839094863, "phrase": "incurred_costs"}, {"score": 0.006157480802291549, "phrase": "selected_facilities"}, {"score": 0.00481495049065317, "phrase": "transmission-cost_minimization"}, {"score": 0.00478218760286811, "phrase": "high-performance_communication_applications"}, {"score": 0.004733458808453602, "phrase": "two-tier_high-performance_networks"}, {"score": 0.004543436145505023, "phrase": "powerful_supercomputing_environment"}, {"score": 0.004466519142879166, "phrase": "server_load"}, {"score": 0.004157374465795314, "phrase": "proper_way"}, {"score": 0.0038300786263543835, "phrase": "facility_location_problem"}, {"score": 0.0037395458116642306, "phrase": "optimal_subset"}, {"score": 0.0030879936732269293, "phrase": "application_servicing"}, {"score": 0.002324657548285756, "phrase": "simple_heuristic_algorithm"}, {"score": 0.0022774088820755366, "phrase": "feasible_solution"}, {"score": 0.0021782980803068505, "phrase": "large-scale_problems"}, {"score": 0.0021049977753042253, "phrase": "john_wiley"}], "paper_keywords": ["high-performance network", " two-tier", " facility location problem", " integer programming"], "paper_abstract": "In two-tier high-performance networks (HPNs), some facilities are constructed to form a powerful supercomputing environment, and to alleviate server load. Then, the applications are provided by them in co-operated, parallel and distributed manners. A proper way to select facilities is crucial to the performance of two-tier HPNs The problem of selecting facilities can be regarded as a kind of the facility location problem, which is to determine an optimal subset of facilities that will be open to serve users. The traditional facility location problem aims to minimize the incurred costs between the users/servers and their assigned facilities. In two-tier HPNs, the incurred costs can be regarded as the transmission costs, e.g. transmission latency, bandwidth overhead. We observe that most of the packets are transmitted among the facilities for application servicing and framework maintaining. In this paper, we address the problem of selecting facilities in two-tier HPNs by minimizing the transmission costs from servers to users by passing through the selected facilities. Our problem is different from the traditional facility location problem, which only considers the transmission costs between the users/servers and their assigned facilities. In our problem, the transmission costs between the selected facilities are further considered. The problem is formulated as a 0/1 integer non-linear programming (0/1 INLP) and 0/1 integer linear programming (0/1 ILP). Further, a simple heuristic algorithm is proposed for obtaining a feasible solution when the network sizes increase, since solving INLPs and ILPs for large-scale problems takes long time. Copyright (c) 2010 John Wiley & Sons, Ltd.", "paper_title": "A two-tier framework for transmission-cost minimization of high-performance communication applications", "paper_id": "WOS:000300690900005"}