{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "data_mining"}, {"score": 0.004579780586951551, "phrase": "top_ten_data_mining_mistakes"}, {"score": 0.004403054828362479, "phrase": "data_mining_target"}, {"score": 0.0041580507929967645, "phrase": "real-life_projects"}, {"score": 0.0035648266669315943, "phrase": "synthetic_competitions"}, {"score": 0.0035393874762182486, "phrase": "real-life_data_mining_projects"}, {"score": 0.0028041618337853, "phrase": "modeling_goals"}, {"score": 0.002764252199256058, "phrase": "broader_framework"}, {"score": 0.002734692147497601, "phrase": "data_mining_problem"}, {"score": 0.0027054473441439422, "phrase": "resulting_definition"}, {"score": 0.0026573974912563014, "phrase": "general_methodology"}, {"score": 0.00249135867469492, "phrase": "simple_specific_approach"}, {"score": 0.002473560912156024, "phrase": "data_management"}, {"score": 0.002174041708084857, "phrase": "alternative_point"}, {"score": 0.0021049977753042253, "phrase": "causal_graph_modeling_concepts"}], "paper_keywords": ["Data mining", " leakage", " predictive modeling"], "paper_abstract": "Deemed \"one of the top ten data mining mistakes\", leakage is the introduction of information about the data mining target that should not be legitimately available to mine from. In addition to our own industry experience with real-life projects, controversies around several major public data mining competitions held recently such as the INFORMS 2010 Data Mining Challenge and the IJCNN 2011 Social Network Challenge are evidence that this issue is as relevant today as it has ever been. While acknowledging the importance and prevalence of leakage in both synthetic competitions and real-life data mining projects, existing literature has largely left this idea unexplored. What little has been said turns out not to be broad enough to cover more complex cases of leakage, such as those where the classical independently and identically distributed (i.i.d.) assumption is violated, that have been recently documented. In our new approach, these cases and others are explained by explicitly defining modeling goals and analyzing the broader framework of the data mining problem. The resulting definition enables us to derive general methodology for dealing with the issue. We show that it is possible to avoid leakage with a simple specific approach to data management followed by what we call a learn-predict separation, and present several ways of detecting leakage when the modeler has no control over how the data have been collected. We also offer an alternative point of view on leakage that is based on causal graph modeling concepts.", "paper_title": "Leakage in Data Mining: Formulation, Detection, and Avoidance", "paper_id": "WOS:000312924700002"}