{"auto_keywords": [{"score": 0.046360253595169286, "phrase": "temporal_starvation"}, {"score": 0.015719716506582538, "phrase": "csma_wireless_networks"}, {"score": 0.010041213554724985, "phrase": "equilibrium_starvation"}, {"score": 0.006242631958578134, "phrase": "zero_or_little_throughputs"}, {"score": 0.00555501628746681, "phrase": "trap_theory"}, {"score": 0.005269221872192472, "phrase": "csma_networks"}, {"score": 0.004618166136069052, "phrase": "prior_works"}, {"score": 0.004343940916975968, "phrase": "good_equilibrium_throughputs"}, {"score": 0.004085932261574055, "phrase": "real-time_applications"}, {"score": 0.004051957174711638, "phrase": "voip"}, {"score": 0.004029455922180569, "phrase": "video_streaming"}, {"score": 0.0038112201846057445, "phrase": "\"trap_theory"}, {"score": 0.003769006950727621, "phrase": "temporal_throughput_fluctuations"}, {"score": 0.0036248955128033084, "phrase": "new_mathematical_results"}, {"score": 0.0035648266669315943, "phrase": "transient_behavior"}, {"score": 0.003279039724748895, "phrase": "transmission_time"}, {"score": 0.0031712256091350316, "phrase": "csma_protocol"}, {"score": 0.0029826617970403536, "phrase": "probability_distributions"}, {"score": 0.002957829935033334, "phrase": "backoff_countdown_time"}, {"score": 0.0028367287190243355, "phrase": "analytical_tools"}, {"score": 0.0027434176644073878, "phrase": "network_design"}, {"score": 0.002690406375639144, "phrase": "csma_network"}, {"score": 0.0023534152110103487, "phrase": "existing_remedies"}, {"score": 0.0021345589634924633, "phrase": "important_first_step"}, {"score": 0.0021049977753042253, "phrase": "effective_remedies"}], "paper_keywords": ["Starvation", " Wi-Fi", " CSMA", " IEEE 802.11", " ergodic sojourn time"], "paper_abstract": "It is well known that links in CSMA wireless networks are prone to starvation. Prior works focused almost exclusively on equilibrium starvation. Links in CSMA wireless networks are also susceptible to temporal starvation. Specifically, although some links have good equilibrium throughputs and do not suffer from equilibrium starvation, they can still have zero or little throughputs for extended periods from time to time. For real-time applications such as VoIP and video streaming, it is desirable to understand and characterize temporal starvation in CSMA wireless networks. To this end, we develop a \"trap theory\" to analyze temporal throughput fluctuations. The trap theory serves two functions. First, it allows us to derive new mathematical results that shed light on the transient behavior of CSMA networks. For example, we show that the duration of a trap, during which some links receive zero or little throughputs, is insensitive to the distributions of the transmission time (packet duration) and the backoff countdown time in the CSMA protocol given their respective means. This implies that the phenomenon of temporal starvation is fundamental and cannot be solved by simply manipulating the probability distributions of the backoff countdown time and transmission time alone. Second, with the trap theory, we can develop analytical tools for computing the \"degrees of starvation\" for CSMA networks to aid network design. For example, given a CSMA network, we can determine whether it suffers from starvation, and if so, which links will starve. Furthermore, the likelihood and durations of temporal starvation, if any, can also be computed. To further motivate the study of temporal starvation, we show that the existing remedies designed to solve equilibrium starvation may not work well as far as temporal starvation is considered. We believe that the ability to identify and characterize temporal starvation as established in this paper will serve as an important first step toward the design of effective remedies for it.", "paper_title": "Temporal Starvation in CSMA Wireless Networks", "paper_id": "WOS:000357656200015"}