{"auto_keywords": [{"score": 0.004462892860919036, "phrase": "system_design_processes"}, {"score": 0.0044231966846655394, "phrase": "project_planning_ones"}, {"score": 0.004364310576600359, "phrase": "industrial_benchmark_analysis"}, {"score": 0.0037658881407605445, "phrase": "different_entities"}, {"score": 0.0036826452656927877, "phrase": "one-to-one_relationship"}, {"score": 0.003293142761521425, "phrase": "account_design_activities"}, {"score": 0.0030656984915295275, "phrase": "existing_project"}, {"score": 0.00303839203670705, "phrase": "design_standards"}, {"score": 0.0028667159745494933, "phrase": "project_management"}, {"score": 0.002716844480081738, "phrase": "structural_interaction"}, {"score": 0.0025518429503461736, "phrase": "behavioral_interaction"}, {"score": 0.0023333173799963795, "phrase": "verification_criteria"}], "paper_keywords": ["System design", " project planning", " aiding decisions", " knowledge based systems"], "paper_abstract": "This article proposes a model and rules dealing with the management of the interaction between system design processes and project planning ones. An industrial benchmark analysis has reinforced our belief that the interaction between the two processes has to be supported by models, processes and relevant tools. Firstly, after presenting the results of the analysis, the different entities are defined and the one-to-one relationship or bijection between the structure of the system and the structure of the project is made. Then, a model, taking into account design activities and planning activities as well as management of interactions, is proposed in compliance with existing project and design standards. A process of interaction is presented to carry out design and project management. Two interaction modes have been proposed. On the one hand, the structural interaction establishes links between entities of the two domains. On the other hand, the behavioral interaction (subject of this paper) is based on the definition of states for each entity following feasibility and verification criteria, and can thus manage the changes between states. Some rules are defined (precedence and synchronous rules) to forbid certain changes when they are inconsistent and to synchronize them.", "paper_title": "System design and project planning: Model and rules to manage their interactions", "paper_id": "WOS:000360929800002"}