{"auto_keywords": [{"score": 0.004544629724830453, "phrase": "network_content_security_applications"}, {"score": 0.004440780432053927, "phrase": "intrusion_detection_systems"}, {"score": 0.004389745162172933, "phrase": "anti-virus_systems"}, {"score": 0.004314285113050873, "phrase": "web_content_filters"}, {"score": 0.004191377834552202, "phrase": "typical_algorithms"}, {"score": 0.0033644530302903513, "phrase": "fast_verification_method"}, {"score": 0.0030847461428168614, "phrase": "signature_characteristics"}, {"score": 0.002795671770303977, "phrase": "real_and_synthetic_sample_data"}, {"score": 0.0026691455928407022, "phrase": "open_source"}, {"score": 0.002391067964886602, "phrase": "comprehensive_profiling_results"}, {"score": 0.002363532907211947, "phrase": "typical_string"}, {"score": 0.0022565201625076876, "phrase": "network_content_security"}, {"score": 0.002129527338875116, "phrase": "proper_algorithm"}, {"score": 0.0021049977753042253, "phrase": "practical_design"}], "paper_keywords": [""], "paper_abstract": "The efficiency of string matching algorithms is essential for network content security applications, such as intrusion detection systems, anti-virus systems, and Web content filters. This work reviews typical algorithms and profiles their performance under various situations to study the influence of the number, the length, and the character distribution of the signatures on performance. This profiling can reveal the most efficient algorithm in each situation. A fast verification method for some string matching algorithms is also proposed. This work then analyzes the signature characteristics of three content security applications and replaces their original algorithms with the most efficient ones in the profiling. The improvement for both real and synthetic sample data is observed. For example, an open source anti-virus package, ClamAV, is five times faster after the revision. This work features comprehensive profiling results of typical string matching algorithms and observations of their application on network content security. The results can enlighten the choice of a proper algorithm in practical design.", "paper_title": "PROFILING AND ACCELERATING STRING MATCHING ALGORITHMS IN THREE NETWORK CONTENT SECURITY APPLICATIONS", "paper_id": "WOS:000208213300002"}