{"auto_keywords": [{"score": 0.03566028947551064, "phrase": "first_questionnaire"}, {"score": 0.022915292559542427, "phrase": "epr-related_education"}, {"score": 0.00481495049065317, "phrase": "electronic_patient_record-related_education"}, {"score": 0.004644247838681628, "phrase": "electronic_patient_record"}, {"score": 0.004201033616196156, "phrase": "possibly_relevant_subjects"}, {"score": 0.003635790924434452, "phrase": "current_teaching"}, {"score": 0.0035778632599436024, "phrase": "response_rate"}, {"score": 0.003549245218355768, "phrase": "low_a_second_questionnaire"}, {"score": 0.0033283624928018177, "phrase": "larger_group"}, {"score": 0.003034633345146293, "phrase": "basic_medical_education"}, {"score": 0.003010347277067459, "phrase": "medical_specializations"}, {"score": 0.0028342734482926677, "phrase": "nine_subjects"}, {"score": 0.002711714675297321, "phrase": "low_response"}, {"score": 0.002615381301695394, "phrase": "individual_disciplines"}, {"score": 0.0025326211341475903, "phrase": "second_questionnaire"}, {"score": 0.002384422461262006, "phrase": "second_questionnaire_differences"}, {"score": 0.0021049977753042253, "phrase": "different_opinions"}], "paper_keywords": ["electronic patient records", " education", " medical informatics", " curriculum"], "paper_abstract": "Objective: To determine whether educators consider electronic patient record (EPR)-related education necessary and if so, what subjects have to be taught more extensively in the future. Methods: A list of possibly relevant subjects was determined from the literature. A questionnaire was designed which contained those subjects and the respondents were asked to indicate, for each subject, its competency level and required competency level, in current teaching. Since the response rate was low a second questionnaire was developed to have the results of the analysis of the first questionnaire validated by a larger group of educators. Results. In total 45 learning goals were identified from the literature. The questionnaire was sent to representatives of several disciplines: basic medical education, medical specializations, pharmacy, dentistry and nursing. The analysis of the first questionnaire resulted in nine subjects that needed more attention in the future. Because of the low response the needs could not be specified for the individual disciplines. This insight was obtained from a second questionnaire. The response to this questionnaire was high. From the analysis of the second questionnaire differences between views of educators involved in the training of GPs and educators involved in the training of other specializations were observed. Conclusion: Educators find EPR-related education important. There are different opinions about the phase in which EPR-related education should be given.", "paper_title": "EGOOZ: Specifying the components of electronic patient record-related education", "paper_id": "WOS:000237672800012"}