{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "assistance_environment"}, {"score": 0.04862717445897776, "phrase": "co-adaptive_design_approach"}, {"score": 0.03355526432097249, "phrase": "users'_needs"}, {"score": 0.003861175855298779, "phrase": "educational_contexts"}, {"score": 0.0030640804704319255, "phrase": "computing_functionalities"}, {"score": 0.0026945086500597304, "phrase": "users'_activities"}, {"score": 0.0024062532032402533, "phrase": "stable_typology"}, {"score": 0.002250601866422547, "phrase": "computer_environment"}, {"score": 0.002159852420283463, "phrase": "iterative_and_co-adaptive_approach"}, {"score": 0.0021049977753042253, "phrase": "te-cap"}], "paper_keywords": ["co-adaptive design approach", " assistance system for tutors", " communities of practice", " experiences sharing", " knowledge management", " needs analysis"], "paper_abstract": "In this article, we present a co-adaptive design approach named TE-Cap (Tutoring Experience Capitalisation) that we applied for the development of an assistance environment for tutors. Since tasks assigned to tutors in educational contexts are not well defined, we are developing an environment which responds to needs which are not precisely identified or not expressed by these users. Our approach rests on three development cycles which aim at gradually clarifying and refining users' needs and expectations which we translate into computing functionalities. Each cycle is composed of three steps that allow the use of prototypes developed with regard, on the one hand, to theories of users' activities and, on the other hand, to the needs that we have identified to be observed. We finally obtain a stable typology of users' needs and expectations upon which we base the development of the computer environment. We illustrate the two first cycles of this iterative and co-adaptive approach during the development of TE-Cap. We then discuss the difficulties raised by this type of approach.", "paper_title": "Development of an assistance environment for tutors based on a co-adaptive design approach", "paper_id": "WOS:000300239200003"}