{"auto_keywords": [{"score": 0.03097982060329348, "phrase": "proposed_scoring_function"}, {"score": 0.00481495049065317, "phrase": "cellular_phones"}, {"score": 0.004748832495727873, "phrase": "e-commerce_auctions"}, {"score": 0.004078562617505643, "phrase": "bidder's_cellular_phone"}, {"score": 0.003967235882351874, "phrase": "bidder's_offer"}, {"score": 0.003805895710941199, "phrase": "requested_service"}, {"score": 0.0036891952845575036, "phrase": "distance_auctions"}, {"score": 0.0035884582625234297, "phrase": "distance_auction"}, {"score": 0.0035637052288771706, "phrase": "multiple_auctions"}, {"score": 0.003113637673848439, "phrase": "bad_strategies"}, {"score": 0.0030814613175385672, "phrase": "dishonest_bidder"}, {"score": 0.0030076664326204013, "phrase": "honest_bidders"}, {"score": 0.002875261849352716, "phrase": "different_bids"}, {"score": 0.0028161281608563267, "phrase": "good_bidders"}, {"score": 0.0027677775883341556, "phrase": "bad_bidders"}, {"score": 0.00258251424573557, "phrase": "different_types"}, {"score": 0.0025119200240696824, "phrase": "greedy_bidders"}, {"score": 0.0024859463164240603, "phrase": "low_prices"}, {"score": 0.002217326282120832, "phrase": "mobile_commerce"}, {"score": 0.0021943920257952174, "phrase": "public_auctions"}, {"score": 0.002164180792169302, "phrase": "new_practical_applications"}, {"score": 0.002149231173009159, "phrase": "research_possibilities"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b._v."}], "paper_keywords": ["Auctions", " Cellular", " Electronic commerce", " Multi-attribute", " Distance", " Strategies", " Simulation"], "paper_abstract": "We consider e-commerce auctions via cellular phones in which the winner is selected based on two factors: the requested price and the promise to provide a service on time. The auctioneer can verify that the bidder intends to provide the service by tracking her current location using the bidder's cellular phone. Apart from the price, the bidder's offer includes a set of checkpoints to verify her intention to provide the requested service on time. We present the concept of distance auctions and study some of their strategic aspects. A distance auction includes multiple auctions executed in parallel and involve several auctioneers and bidders such that each bidder can place several bids simultaneously possibly winning several auctions. We focus on the possibility that in spite of the checkpoints established by each bidder, there are bad strategies where a dishonest bidder can win many auctions by blocking the honest bidders. We prove via simulations that the proposed scoring function used to evaluate the different bids increases the profits of the good bidders over those of the bad bidders, thus verifying that the proposed scoring function is suitable for such auctions. We evaluate this premise in various settings that cover different types of bidders and auctioneers, such as greedy bidders who prefer low prices over more checkpoints. We also study the effect of adaptiveness where bidders and auctioneers can learn from the past and modify their decisions accordingly. This work extends the range of applications in mobile commerce to include public auctions, thus promoting new practical applications and research possibilities. (C) 2010 Elsevier B. V. All rights reserved.", "paper_title": "Auctions by price and distance via cellular phones", "paper_id": "WOS:000289718000005"}