{"auto_keywords": [{"score": 0.049496721057450455, "phrase": "customer_information_contribution_behavior"}, {"score": 0.022675757295475173, "phrase": "online_social_shopping_communities"}, {"score": 0.015599909503646066, "phrase": "observational_learning"}, {"score": 0.010612387000973441, "phrase": "online_social_interactions"}, {"score": 0.0073173674975443, "phrase": "customer_reputation"}, {"score": 0.003958299299658418, "phrase": "customer_participation"}, {"score": 0.0038154673253945003, "phrase": "important_but_underexplored_research_area"}, {"score": 0.0033548062793973144, "phrase": "moderating_role"}, {"score": 0.0030043508031729277, "phrase": "panel_data"}, {"score": 0.002913650880082273, "phrase": "online_social_fashion_platform"}, {"score": 0.002825681384008326, "phrase": "significant_factors"}, {"score": 0.002673957615079041, "phrase": "stronger_effect"}, {"score": 0.0024842242921857705, "phrase": "significant_negative_moderating_effect"}, {"score": 0.0023798115577749225, "phrase": "customer_information_contribution"}, {"score": 0.0022382002476510573, "phrase": "information_contribution_behavior"}, {"score": 0.002157302200451323, "phrase": "online_social_shopping_community_administrators"}], "paper_keywords": ["virtual communities", " customers", " social networking"], "paper_abstract": "Online social shopping communities are transforming the way customers communicate and exchange product information with others. To date, the issue of customer participation in online social shopping communities has become an important but underexplored research area in the academic literature. In this study, we examined how online social interactions affect customer information contribution behavior. We also explored the moderating role of customer reputation in the relationship between observational learning and reinforcement learning as well as customer information contribution behavior. Analyses of panel data from 6,121 customers in an online social fashion platform revealed that they are significant factors affecting customer information contribution behavior and that reinforcement learning exhibits a stronger effect than observational learning. The results also showed that customer reputation has a significant negative moderating effect on the relationship between observational learning and customer information contribution behavior. This study not only enriched our theoretical understanding of information contribution behavior but also provided guidelines for online social shopping community administrators to better design their community features.", "paper_title": "How online social interactions influence customer information contribution behavior in online social shopping communities: A social learning theory perspective", "paper_id": "WOS:000368338400009"}