{"auto_keywords": [{"score": 0.04224645421279868, "phrase": "online_comments"}, {"score": 0.02409266939234133, "phrase": "hotel_service_quality"}, {"score": 0.00481495049065317, "phrase": "online_comment"}, {"score": 0.004709333998298903, "phrase": "popular_and_efficient_way"}, {"score": 0.004333406378146173, "phrase": "key_issues"}, {"score": 0.00370981613076245, "phrase": "quality_defects"}, {"score": 0.0031933617014256676, "phrase": "fuzzy_comprehensive_evaluation"}, {"score": 0.003088702479841264, "phrase": "trustworthy_degree"}, {"score": 0.002987463078971627, "phrase": "automatic_hotel_service_quality_assessment_method"}, {"score": 0.002921815585510946, "phrase": "fce"}, {"score": 0.002779318608820933, "phrase": "large_amount"}, {"score": 0.0026732973536990373, "phrase": "causal_relations"}, {"score": 0.002643753276264565, "phrase": "evaluation_indexes"}, {"score": 0.0025287979714720423, "phrase": "fuzzy_cognitive_map"}, {"score": 0.0023788319661581696, "phrase": "problematic_areas"}, {"score": 0.0022502133699402018, "phrase": "service_quality"}, {"score": 0.0021049977753042253, "phrase": "proposed_methods"}], "paper_keywords": ["Causal relation mining", " fuzzy cognitive map (FCM)", " fuzzy comprehensive evaluation (FCE)", " hotel service quality assessment (HQA)", " online comment mining"], "paper_abstract": "Online comment has become a popular and efficient way for sellers to acquire feedback from customers and improve their service quality. However, some key issues need to be solved about evaluating and improving the hotel service quality based on online comments automatically, such as how to use the less trustworthy online comments, how to discover the quality defects from online comments, and how to recommend more feasible or economical evaluation indexes to improve the service quality based on online comments. To solve the above problems, this paper first improves fuzzy comprehensive evaluation (FCE) by importing trustworthy degree to it and proposes an automatic hotel service quality assessment method using the improved FCE, which can automatically get more trustworthy evaluation from a large amount of less trustworthy online comments. Then, the causal relations among evaluation indexes are mined from online comments to build the fuzzy cognitive map for the hotel service quality, which is useful to unfold the problematic areas of hotel service quality, and recommend more economical solutions to improving the service quality. Finally, both case studies and experiments are conducted to demonstrate that the proposed methods are effective in evaluating and improving the hotel service quality using online comments.", "paper_title": "Online Comment-Based Hotel Quality Automatic Assessment Using Improved Fuzzy Comprehensive Evaluation and Fuzzy Cognitive Map", "paper_id": "WOS:000349418100007"}