{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "usability"}, {"score": 0.03597973762859244, "phrase": "australia"}, {"score": 0.004507760907425495, "phrase": "human_factors_study"}, {"score": 0.004448705308279165, "phrase": "petro-chemical_manufacturing_plant"}, {"score": 0.004092168350316413, "phrase": "training_course"}, {"score": 0.004056334733843591, "phrase": "plant_operators"}, {"score": 0.003985602342418578, "phrase": "low-level_usability-related_software_issues"}, {"score": 0.0038647641000798135, "phrase": "system_implementation"}, {"score": 0.00376409764683147, "phrase": "eight_managers"}, {"score": 0.00355485940716082, "phrase": "old_system"}, {"score": 0.0034018288705284427, "phrase": "user-based_quasi-walkthrough"}, {"score": 0.00307431840409833, "phrase": "interactive_version"}, {"score": 0.002994178996584381, "phrase": "static_screens"}, {"score": 0.002890557197908352, "phrase": "user_performance_data"}, {"score": 0.0025217065652145443, "phrase": "control_room"}, {"score": 0.0024776677004255104, "phrase": "system_cutover"}, {"score": 0.002381365139274329, "phrase": "required_product_quality"}, {"score": 0.0021901485584955487, "phrase": "perceived_technology_usefulness"}, {"score": 0.0021049977753042253, "phrase": "mandatory_settings"}], "paper_keywords": [""], "paper_abstract": "This article describes one part of a human factors study conducted over 3 months in a petro-chemical manufacturing plant in Australia. The project had two purposes, namely, to identify issues to be included in a training course for plant operators and to identify low-level usability-related software issues that might be rectifiable prior to system implementation. After interviewing 28 operators and eight managers, the operators were observed on the job while interacting with the old system. Finally, the 3-part usability assessment comprising 2 expert inspections and a user-based quasi-walkthrough was conducted. As the study took place shortly before a new, off-the-shelf automated manufacturing system was implemented, it was not possible to test an interactive version, relying instead exclusively on static screens. This made it impossible to provide user performance data, which could have helped to convince management of the seriousness of certain problems. One of these proved so severe that an engineer had to be present 24/7 in the control room for 6 months following system cutover because the operators were unable to achieve the required product quality. Based on the data, suggestions are made for expanding the usability construct to include assessment of perceived technology usefulness and to refine the concept of attitude in mandatory settings.", "paper_title": "Challenges to Assessing Usability in the Wild: A Case Study", "paper_id": "WOS:000360637100006"}