{"auto_keywords": [{"score": 0.04523828542897125, "phrase": "conceptual_models"}, {"score": 0.015719716506582538, "phrase": "conceptual_modelling"}, {"score": 0.004253618550301311, "phrase": "fundamental_issue"}, {"score": 0.004081385289516914, "phrase": "object-role_modelling"}, {"score": 0.003500313767208306, "phrase": "ambiguous_guidelines"}, {"score": 0.0031845067058084583, "phrase": "ontological_theory"}, {"score": 0.00314708280192844, "phrase": "cognition_theory"}, {"score": 0.002455009746748708, "phrase": "cognitive_processing_study"}, {"score": 0.002273292707863821, "phrase": "general_impacts"}, {"score": 0.002246553137021003, "phrase": "cognitive_behaviours"}, {"score": 0.0021049977753042253, "phrase": "ontologically_sound_representations"}], "paper_keywords": ["Conceptual Modelling", " Entity", " Information Systems Development", " Object-Role Model", " Ontology", " Normalization", " Property"], "paper_abstract": "How classes of things and properties in general should be represented in conceptual models is a fundamental issue. For example, proponents of object-role modelling argue that no distinction should be made between the two constructs, whereas proponents of entity-relationship modelling argue the distinction is important but provide ambiguous guidelines about how the distinction should be made. In this paper, the authors use ontological theory and cognition theory to provide guidelines about how classification should be represented in conceptual models. The authors experimented to test whether clearly distinguishing between classes of things and properties in general enabled users of conceptual models to better understand a domain. They describe a cognitive processing study that examined whether clearly distinguishing between classes of things and properties in general impacts the cognitive behaviours of the users. The results support the use of ontologically sound representations of classes of things and properties in conceptual modelling.", "paper_title": "Representing Classes of Things and Properties in General in Conceptual Modelling: An Empirical Evaluation", "paper_id": "WOS:000277146100001"}