{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "electrical_stimulation"}, {"score": 0.021224162750544607, "phrase": "neural_networks"}, {"score": 0.009834960206917199, "phrase": "neuronal_migration"}, {"score": 0.004227653047394939, "phrase": "microelectrode_arrays"}, {"score": 0.004163427731140163, "phrase": "immunocytochemistry_data"}, {"score": 0.003208999546225013, "phrase": "neuronal_cell_bodies"}, {"score": 0.0029722900280316216, "phrase": "neural_necrosis"}, {"score": 0.0029270797740550973, "phrase": "neuron-only_cultures"}, {"score": 0.0027955219242123013, "phrase": "stimulation-induced_migration"}, {"score": 0.002690406375639144, "phrase": "action_potentials"}, {"score": 0.0025892330566358503, "phrase": "voltage-gated_sodium_channel_blocker"}, {"score": 0.002416589459425828, "phrase": "precisely_the_neuronal_migration"}, {"score": 0.0021705796895687864, "phrase": "cell_bodies"}, {"score": 0.0021049977753042253, "phrase": "neuronal_activity"}], "paper_keywords": ["Electrical stimulation", " Neuronal migration", " Microelectrode array", " Astrocyte", " Neuronal activity"], "paper_abstract": "Recently, we found that electrical stimulation can induce neuronal migration in neural networks cultured for more than 3 weeks on microelectrode arrays. Immunocytochemistry data showed that the aggregation of neurons was related to the emergence of astrocytes in culture. In this study, when neurons were cocultured with astrocytes, electrical stimulation could induce the migration of neuronal cell bodies after only 1 week in culture, while the same stimulation paradigm caused neural necrosis in neuron-only cultures. In addition, the stimulation-induced migration was inhibited by blocking action potentials in neural networks using the voltage-gated sodium channel blocker, tetrodotoxin. Immunocytochemistry was performed to monitor precisely the neuronal migration and count the number of neurons. These results indicate that neuronal migration of cell bodies is dependent on neuronal activity evoked by electrical stimulation and can be enhanced by coculturing with astrocytes. We believe this method can be employed as a means for modifying neural networks and improving the interface between electrodes and neurons.", "paper_title": "Activity-dependent neuronal cell migration induced by electrical stimulation", "paper_id": "WOS:000262483600012"}