{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "normality_mining"}, {"score": 0.0047804843375940835, "phrase": "privacy_implications_of_behavioral_profiles_drawn"}, {"score": 0.0047292449487169345, "phrase": "enabled_mobile_phones"}, {"score": 0.004661775069083667, "phrase": "growing_interest"}, {"score": 0.00441718685609235, "phrase": "new_applications"}, {"score": 0.004354149483556514, "phrase": "recent_advances"}, {"score": 0.004322967486451877, "phrase": "mobile_technologies"}, {"score": 0.004155399041702324, "phrase": "location_data"}, {"score": 0.003637822529522622, "phrase": "persistent_tracking"}, {"score": 0.0035346515636097533, "phrase": "customized_information"}, {"score": 0.0028586409810976367, "phrase": "third_parties"}, {"score": 0.0026889720516076205, "phrase": "short_case_study"}, {"score": 0.002584576723303367, "phrase": "mobile_handsets"}, {"score": 0.0025568135952982345, "phrase": "gps_locations"}, {"score": 0.0024223970976460173, "phrase": "simple_profiles"}, {"score": 0.002362105010110277, "phrase": "profiling_activity"}, {"score": 0.0023199580436336163, "phrase": "special_cases"}, {"score": 0.0021587414711262904, "phrase": "european_legislation"}, {"score": 0.0021278653331014614, "phrase": "privacy_implications"}, {"score": 0.0021049977753042253, "phrase": "emerging_technology"}], "paper_keywords": ["Behavioral profiling", " location-based services", " mobile", " normality mining", " privacy"], "paper_abstract": "There is growing interest in the ways in which the location of a person can be utilized by new applications and services. Recent advances in mobile technologies have meant that the technical capability to record and transmit location data for processing is appearing in off-the-shelf handsets. This opens possibilities to profile people based on the places they visit, people they associate with, or other aspects of their complex routines determined through persistent tracking. It is possible that services offering customized information based on the results of such behavioral profiling could become commonplace. However, it may not be immediately apparent to the user that a wealth of information about them, potentially unrelated to the service, can be revealed. Further issues occur if the user agreed, while subscribing to the service, for data to be passed to third parties where it may be used to their detriment. Here, we report in detail on a short case study tracking four people, in three European member states, persistently for six weeks using mobile handsets. The GPS locations of these people have been mined to reveal places of interest and to create simple profiles. The information drawn from the profiling activity ranges from intuitive through special cases to insightful. In this paper, these results and further extensions to the technology are considered in light of European legislation to assess the privacy implications of this emerging technology.", "paper_title": "Normality Mining: Privacy Implications of Behavioral Profiles Drawn From GPS Enabled Mobile Phones", "paper_id": "WOS:000287652800009"}