{"auto_keywords": [{"score": 0.03712654330339069, "phrase": "reservation_price"}, {"score": 0.014162880039492365, "phrase": "incomplete_information"}, {"score": 0.00481495049065317, "phrase": "available_information"}, {"score": 0.004791945687452136, "phrase": "negotiation_results"}, {"score": 0.0046118021635786315, "phrase": "different_parties"}, {"score": 0.003899707399478865, "phrase": "negotiation_process"}, {"score": 0.003798231095121328, "phrase": "automated_negotiators"}, {"score": 0.0034261709570264785, "phrase": "maximum_price"}, {"score": 0.00326572165784246, "phrase": "minimum_price"}, {"score": 0.0031202382851537973, "phrase": "cramton's_symmetrical_protocol"}, {"score": 0.0030609320300175953, "phrase": "stable_and_symmetric_strategies"}, {"score": 0.002945669860541221, "phrase": "cramton's_model"}, {"score": 0.0028009305709806634, "phrase": "nash_equilibrium"}, {"score": 0.002701908470457014, "phrase": "theoretical_background"}, {"score": 0.002362105010110277, "phrase": "one-side_method"}, {"score": 0.0022676472947686516, "phrase": "joint_information_acquisition"}, {"score": 0.0022138542785562444, "phrase": "one-sided_information_purchasing"}, {"score": 0.0021769585865500114, "phrase": "acquisition_activity"}, {"score": 0.0021049977753042253, "phrase": "informed_agent"}], "paper_keywords": ["Electronic commerce", " Bilateral negotiation", " Value of information", " Signalling"], "paper_abstract": "Negotiation is the most famous tool for reaching an agreement between parties. Usually, the different parties can be modeled as a buyer and a seller, who negotiate about the price of a given item. In most cases, the parties have incomplete information about one another, but they can invest money and efforts in order to acquire information about each other. This leads to the question of how much each party will be willing to invest on information about its opponent, prior to the negotiation process. In this paper, we consider the profitability of automated negotiators acquiring information on their opponents. In our model, a buyer and a seller negotiate on the price of a given item. Time is costly, and incomplete information exists about the reservation price of both parties. The reservation price of the buyer is the maximum price it is willing to pay for an item or service, and the reservation price of the seller is the minimum price it is willing to receive in order to sell the item or service. Our research is based on Cramton's symmetrical protocol of negotiation that provides the agents with stable and symmetric strategies, and involves a delay in proposing an offer for signaling. The parties in Cramton's model delay their offers in order to signal their strength, and then an agreement is reached after one or two offers. We determine the Nash equilibrium for agents that prefer to purchase information. Then, in addition to the theoretical background, we used simulations to check which type of equilibrium will actually be obtained. We found that in most of the cases, each agent will prefer to purchase information only if its opponent does. The reason for these results lies in the fact that an agent that prefers to purchase information according to a one-side method, signals its weakness and thereby reduces its position in the negotiation. Our results demonstrate the efficiency of joint information acquisition by both agents, but they also show that one-sided information purchasing may be inefficient, if the acquisition activity is revealed by the opponent, which causes it to infer that the informed agent is relatively weak.", "paper_title": "The impact of available information on negotiation results", "paper_id": "WOS:000293630700004"}