{"auto_keywords": [{"score": 0.02776740266305969, "phrase": "molecular_hydrogen"}, {"score": 0.00481495049065317, "phrase": "formic_acid_decomposition"}, {"score": 0.004011366422179016, "phrase": "common_intermediate"}, {"score": 0.0037322713756404295, "phrase": "high_pressure_nmr_experiments"}, {"score": 0.003643607569483598, "phrase": "observed_increase"}, {"score": 0.0033094525227603012, "phrase": "second_proposed_cycle"}, {"score": 0.0029343925814926787, "phrase": "reaction_mechanism"}, {"score": 0.0028923335491735564, "phrase": "detailed_investigation"}, {"score": 0.0027431953780099826, "phrase": "energy_profiles"}, {"score": 0.002716915166374506, "phrase": "different_accurate_computational_protocols"}, {"score": 0.002432152706473349, "phrase": "larger_amount"}, {"score": 0.0021876814398268775, "phrase": "reaction_rate"}], "paper_keywords": ["DFT", " Formic acid dehydrogenation", " Homogeneous catalysis", " Hydrogen production", " Ruthenium"], "paper_abstract": "A density functional theory (DFT) study of formic acid decomposition, catalyzed by a model of the trans-[Ru(TPPTS)(2)(H2O)(4)](2+) complex, has been performed. A mechanism comprising two competitive catalytic cycles, which have as a common intermediate a monohydride ruthenium complex, has been hypothesized in literature on the basis of high pressure NMR experiments. To explain the observed increase in H-2 production rate during the process, it has been suggested by the same authors that the reaction occurs entering the second proposed cycle (Cycle 2), although none of the complexes assumed to be formed have been experimentally observed. To gain more insights into the reaction mechanism, a detailed investigation of both the proposed catalytic cycles has been carried out. To describe the energy profiles, different accurate computational protocols have been employed. Our computations reveal that molecular hydrogen cannot be produced more rapidly following cycle 2, since it requires a larger amount of energy to occur. Moreover, the release of molecular hydrogen has been found to be the step that limits the reaction rate in both cycles, instead of the CO2 dissociation as hypothesized by the authors.", "paper_title": "Theoretical mechanistic study of the formic acid decomposition assisted by a Ru(II)-phosphine catalyst", "paper_id": "WOS:000336306200001"}