{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "expression_ratio_evaluation"}, {"score": 0.004765788394931875, "phrase": "two-colour_microarray_experiments"}, {"score": 0.004621279527317074, "phrase": "image_misalignment"}, {"score": 0.004527371799277529, "phrase": "two-colour_microarrays"}, {"score": 0.004023120753104693, "phrase": "microarray_slide"}, {"score": 0.0036303546926971966, "phrase": "fluorescent_emission_intensities"}, {"score": 0.003343841875107018, "phrase": "systematic_correction"}, {"score": 0.0033096502887394233, "phrase": "image_shift"}, {"score": 0.0028076592725295646, "phrase": "registered_image"}, {"score": 0.0026806884201358515, "phrase": "image_shifts"}, {"score": 0.0026532596852754525, "phrase": "spot_quality"}, {"score": 0.002468938912850425, "phrase": "systematic_image_registration"}, {"score": 0.0022973933270056743, "phrase": "data_extraction"}, {"score": 0.0021049977753042253, "phrase": "gene_expression"}], "paper_keywords": [""], "paper_abstract": "Motivation: Two-colour microarrays are widely used to perform transcriptome analysis. In most cases, it appears that the `red' and `green' images resulting from the scan of a microarray slide are slightly shifted one with respect to the other. To increase the robustness of the measurement of the fluorescent emission intensities, multiple acquisitions with the same or different PMT gains can be used. In these cases, a systematic correction of image shift is required. Results: To accurately detect this shift, we first developed an approach using cross-correlation. Second, we evaluated the most appropriate interpolation method to be used to derive the registered image. Then, we quantified the effects of image shifts on spot quality, using two different quality estimators. Finally, we measured the benefits associated with a systematic image registration. In this study, we demonstrate that registering the two images prior to data extraction provides a more reliable estimate of the two colours' ratio and thus increases the accuracy of measurements of variations in gene expression.", "paper_title": "Expression ratio evaluation in two-colour microarray experiments is significantly improved by correcting image misalignment", "paper_id": "WOS:000250673900006"}