{"auto_keywords": [{"score": 0.0486293934284276, "phrase": "almost_every_activity"}, {"score": 0.04704669903835095, "phrase": "undesired_outcomes"}, {"score": 0.00481495049065317, "phrase": "risk_measurement"}, {"score": 0.003750260412839128, "phrase": "information_systems"}, {"score": 0.0034993519231560637, "phrase": "financial_losses"}, {"score": 0.0034725269588525534, "phrase": "human_casualties"}, {"score": 0.003445906915464945, "phrase": "business_destruction"}, {"score": 0.0034194902384248006, "phrase": "environmental_damages"}, {"score": 0.003093893243443715, "phrase": "literature_risk"}, {"score": 0.0028867712833776046, "phrase": "social_life"}, {"score": 0.002820850247525606, "phrase": "systematic_study"}, {"score": 0.0027777389949155975, "phrase": "decentralized_business_transactions"}, {"score": 0.0027143009946473937, "phrase": "computer_networks"}, {"score": 0.0026934777251033776, "phrase": "service_oriented_environments"}, {"score": 0.0026117657828249137, "phrase": "particular_attention"}, {"score": 0.002493810638588771, "phrase": "peer-to-peer_business_transactions"}, {"score": 0.0023178219772486868, "phrase": "risk_indicator_scale"}, {"score": 0.0021294699637639564, "phrase": "risk_indicator"}, {"score": 0.0021049977753042253, "phrase": "early_warning"}], "paper_keywords": ["criterion", " interaction", " peer-to-peer e-business transactions", " Risk", " Riskiness"], "paper_abstract": "Risk is present in almost every activity. Alternately speaking, almost every activity may have some undesired outcomes which the person doing the activity hopes that they do not occur when it undertakes that particular activity. The quantification of those undesired outcomes can be termed as Risk. Risk is associated with trust, security and privacy. Risk is also associated with transactions, businesses, information systems, environments, networks, partnerships, etc. Generally speaking, risk signifies the likelihood of financial losses, human casualties, business destruction and environmental damages. It is important to define Risk according to the context of the transaction in order to understand and analyze it better. In the literature Risk has been defined and discussed in areas such as security, health, finance, environment and social life, but there is no systematic study of risk in decentralized business transactions, which involves e-business, computer networks and service oriented environments. Hence in this paper, a particular attention is given to define and analyze Risk in the area of Peer-to-Peer business transactions, where Risk is every individual and organization's concern. Also in this paper we develop a risk indicator scale and develop a methodology by which the Riskiness of the peer can be rated according to its behavior in an interaction. Risk indicator gives an early warning to the party involved and helps avoid disasters.", "paper_title": "A methodology for Risk measurement in e-transactions", "paper_id": "WOS:000237232900003"}