{"auto_keywords": [{"score": 0.047152382274471626, "phrase": "mirror_system"}, {"score": 0.015719716506582538, "phrase": "mirror_neuron_system_model"}, {"score": 0.014933372989335362, "phrase": "mirror_neurons"}, {"score": 0.003970930401776528, "phrase": "possible_roles"}, {"score": 0.003941592232278979, "phrase": "mirror_systems"}, {"score": 0.0036462799422150834, "phrase": "companion_article"}, {"score": 0.003323330859027428, "phrase": "monkey_mirror_system"}, {"score": 0.0032622464094096463, "phrase": "external_appearance"}, {"score": 0.0030856268625708695, "phrase": "similar_actions"}, {"score": 0.002929394386754424, "phrase": "novel_hypotheses"}, {"score": 0.0026996706283276407, "phrase": "one's_own_apparent_actions"}, {"score": 0.002630414143385786, "phrase": "one's_intended_actions"}, {"score": 0.002572463625403536, "phrase": "computational_demonstration"}, {"score": 0.0025251455169484557, "phrase": "action_sequencing"}, {"score": 0.0024421501497321027, "phrase": "action_choice"}, {"score": 0.002379484250348599, "phrase": "executable_actions"}, {"score": 0.0021206948586186903, "phrase": "rapid_reorganization"}, {"score": 0.0021049977753042253, "phrase": "motor_programs"}], "paper_keywords": ["Action selection", " Mirror system", " Reinforcement learning", " Unintended actions", " Motor reorganization", " Competitive queuing"], "paper_abstract": "A mirror system is active both when an animal executes a class of actions (self-actions) and when it sees another execute an action of that class. Much attention has been given to the possible roles of mirror systems in responding to the actions of others but there has been little attention paid to their role in self-actions. In the companion article (Bonaiuto et al. Biol Cybern 96:9-38, 2007) we presented MNS2, an extension of the Mirror Neuron System model of the monkey mirror system trained to recognize the external appearance of its own actions as a basis for recognizing the actions of other animals when they perform similar actions. Here we further extend the study of the mirror system by introducing the novel hypotheses that a mirror system may additionally help in monitoring the success of a self-action and may also be activated by recognition of one's own apparent actions as well as efference copy from one's intended actions. The framework for this computational demonstration is a model of action sequencing, called augmented competitive queuing, in which action choice is based on the desirability of executable actions. We show how this \"what did I just do?\" function of mirror neurons can contribute to the learning of both executability and desirability which in certain cases supports rapid reorganization of motor programs in the face of disruptions.", "paper_title": "Extending the mirror neuron system model, II: what did I just do? A new role for mirror neurons", "paper_id": "WOS:000276344100005"}