{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "cooperative_transmissions"}, {"score": 0.006069033986368768, "phrase": "siso"}, {"score": 0.005255865158643725, "phrase": "intermediate_node"}, {"score": 0.005148909713419808, "phrase": "larger_distance"}, {"score": 0.0047820521205253035, "phrase": "sensor_networks"}, {"score": 0.0047007816199415905, "phrase": "recent_attention"}, {"score": 0.004668659654386976, "phrase": "research_papers"}, {"score": 0.004589307360976108, "phrase": "wireless_networks"}, {"score": 0.004270429323002124, "phrase": "single_transmitter"}, {"score": 0.004212240534862585, "phrase": "single_receiver"}, {"score": 0.003973619384183145, "phrase": "multiple_nodes"}, {"score": 0.003919459003028067, "phrase": "virtual_antenna_elements"}, {"score": 0.0038793218280304825, "phrase": "diversity_gain"}, {"score": 0.003852791434660505, "phrase": "range_improvement"}, {"score": 0.003826441783705964, "phrase": "space-time_coding"}, {"score": 0.0037742798298349145, "phrase": "multi-hop_ad_hoc"}, {"score": 0.00369736218441293, "phrase": "source_node"}, {"score": 0.0035118324133358706, "phrase": "greater_reliability"}, {"score": 0.0033241495608238884, "phrase": "similar_manner"}, {"score": 0.0032403798931910127, "phrase": "siso_transmissions"}, {"score": 0.00281900316527787, "phrase": "malicious_or_compromised_nodes"}, {"score": 0.002390436017272046, "phrase": "success_probabilities"}, {"score": 0.0021341390503944358, "phrase": "additional_parameters"}, {"score": 0.0021049977753042253, "phrase": "path-loss_exponent"}], "paper_keywords": ["cooperative communications", " security", " reliability"], "paper_abstract": "Cooperative transmissions have received recent attention and research papers have demonstrated their benefits for wireless networks. Such benefits include improving the reliability of links through diversity and/or increasing the reach of a link compared to a single transmitter transmitting to a single receiver (single-input single-output or SISO). In one form of cooperative transmissions, multiple nodes can act as virtual antenna elements and provide diversity gain or range improvement using space-time coding. In a multi-hop ad hoc or sensor network, a source node can make use of its neighbors as relays with itself to reach an intermediate node with greater reliability or at a larger distance than otherwise possible. The intermediate node will use its neighbors in a similar manner and this process continues till the destination is reached. Thus, for the same reliability of a link as SISO, the number of hops between a source and destination may be reduced using cooperative transmissions as each hop spans a larger distance. However, the presence of malicious or compromised nodes in the network impacts the benefits obtained with cooperative transmissions. Using more relays can increase the reach of a link, but if one or more relays are malicious, the transmission may fail. However, the relationships between the number of relays, the number of hops, and success probabilities are not trivial to determine. In this paper, we analyze this problem to understand the conditions under which cooperative transmissions fare better or worse than SISO transmissions. We take into consideration additional parameters such as the path-loss exponent and provide a framework that allows us to evaluate the conditions when cooperative transmissions are better than SISO transmissions. This analysis provides insights that can be employed before resorting to simulations or experimentation.", "paper_title": "On Security and Reliability Using Cooperative Transmissions in Sensor Networks", "paper_id": "WOS:000306175200009"}