{"auto_keywords": [{"score": 0.04379011383419586, "phrase": "cts"}, {"score": 0.011570135834507675, "phrase": "honest_cts"}, {"score": 0.008185190464262899, "phrase": "system_cooperation"}, {"score": 0.0053032354833776356, "phrase": "exploiting_strategy"}, {"score": 0.0052017801635602405, "phrase": "expl"}, {"score": 0.00481495049065317, "phrase": "iterated_prisoner's_dilemma_game"}, {"score": 0.004543666707871344, "phrase": "positive-reporting_behaviour"}, {"score": 0.004413846562278824, "phrase": "multi-agent_iterated_prisoner's_dilemma_game"}, {"score": 0.0037995094162272, "phrase": "cts."}, {"score": 0.0037267132967205136, "phrase": "cooperation_frequency"}, {"score": 0.002707829887747594, "phrase": "numerical_simulations"}], "paper_keywords": ["combined trust strategy", " game", " cooperation frequency", " misreporting behaviour"], "paper_abstract": "Effects of agents' misreporting behaviour on system cooperation are studied in a multi-agent iterated prisoner's dilemma game. Agents, adopting combined trust strategy (denoted by CTS) are classified into three groups, i.e., honest CTS, positive-reporting CTS and negative-reporting CTS. The differences of cooperation frequency and pay-off under three different systems, i.e., system only with honest CTS, system with honest CTS and positive-reporting CTS and system with honest CTS and negative-reporting CTS, are compared. Furthermore, we also investigate the effects of misreporting behaviour on an exploiter who adopts an exploiting strategy (denoted by EXPL) in a system with two CTSs and one EXPL. At last, numerical simulations are performed for understanding the effects of misreporting behaviour on CTS. The results reveal that positive-reporting behaviour can strengthen system cooperation, while negative-reporting behaviour cannot. When EXPL exists in a system, positive-reporting behaviour helps the exploiter in reducing its exploiting cost and encourages agents to adopt exploiting strategy, but hurts other agents' interests.", "paper_title": "Misreporting behaviour in iterated prisoner's dilemma game with combined trust strategy", "paper_id": "WOS:000344245000003"}