{"auto_keywords": [{"score": 0.049651030276363126, "phrase": "performance_measures"}, {"score": 0.049226991195811136, "phrase": "genetics-based_machine_learning"}, {"score": 0.04776974719693073, "phrase": "experimental_analysis"}, {"score": 0.043265073684849525, "phrase": "statistical_analysis"}, {"score": 0.00481495049065317, "phrase": "statistical_techniques"}, {"score": 0.004461051281091779, "phrase": "proposed_method"}, {"score": 0.004401342842183475, "phrase": "crucial_and_necessary_task"}, {"score": 0.003677280504320639, "phrase": "rigorous_comparison"}, {"score": 0.0035473867669654174, "phrase": "successful_classification_models"}, {"score": 0.0034841647157189985, "phrase": "multi-class_problems"}, {"score": 0.0033612913896033285, "phrase": "cohen"}, {"score": 0.002936849401568391, "phrase": "genetics-based_classifiers"}, {"score": 0.0028076592725295646, "phrase": "necessary_conditions"}, {"score": 0.0027206133859493725, "phrase": "parametrical_tests"}, {"score": 0.0024421008630165046, "phrase": "non-parametric_statistics"}, {"score": 0.0023557346035701096, "phrase": "non-parametric_tests"}, {"score": 0.002282667669149476, "phrase": "generic_classifiers"}, {"score": 0.0022318655527987846, "phrase": "performance_measure"}], "paper_keywords": ["Genetics-based machine learning", " Genetic algorithms", " Statistical tests", " Non-parametric tests", " Cohen's kappa", " Interpretability", " Classification"], "paper_abstract": "The experimental analysis on the performance of a proposed method is a crucial and necessary task to carry out in a research. This paper is focused on the statistical analysis of the results in the field of genetics-based machine Learning. It presents a study involving a set of techniques which can be used for doing a rigorous comparison among algorithms, in terms of obtaining successful classification models. Two accuracy measures for multi-class problems have been employed: classification rate and Cohen's kappa. Furthermore, two interpretability measures have been employed: size of the rule set and number of antecedents. We have studied whether the samples of results obtained by genetics-based classifiers, using the performance measures cited above, check the necessary conditions for being analysed by means of parametrical tests. The results obtained state that the fulfillment of these conditions are problem-dependent and indefinite, which supports the use of non-parametric statistics in the experimental analysis. In addition, non-parametric tests can be satisfactorily employed for comparing generic classifiers over various data-sets considering any performance measure. According to these facts, we propose the use of the most powerful non-parametric statistical tests to carry out multiple comparisons. However, the statistical analysis conducted on interpretability must be carefully considered.", "paper_title": "A study of statistical techniques and performance measures for genetics-based machine learning: accuracy and interpretability", "paper_id": "WOS:000264874700004"}