{"auto_keywords": [{"score": 0.04186018237198313, "phrase": "acgg"}, {"score": 0.04133762036949356, "phrase": "spatial_information"}, {"score": 0.00481495049065317, "phrase": "atomic_congestion_games_on_graphs"}, {"score": 0.004337710093279712, "phrase": "atomic_congestion_games"}, {"score": 0.004099183062034004, "phrase": "classical_congestion_games"}, {"score": 0.0038234714417849495, "phrase": "classical_congestion_game"}, {"score": 0.003384695931421288, "phrase": "player's_payoff"}, {"score": 0.0029443683459283955, "phrase": "fundamental_properties"}, {"score": 0.0028065957753430713, "phrase": "pure_strategy_nash_equilibrium"}, {"score": 0.002722288966917744, "phrase": "finite_improvement_property"}, {"score": 0.002572363468030405, "phrase": "pne."}, {"score": 0.0023068049914566975, "phrase": "regular_bipartite_networks"}, {"score": 0.0022768546333528836, "phrase": "fip"}, {"score": 0.0022472527731744974, "phrase": "important_special_cases"}, {"score": 0.0021892345747666977, "phrase": "identical_payoff_functions"}], "paper_keywords": ["Congestion games", " convergence", " game theory", " graph theory", " Nash equilibrium", " wireless networks"], "paper_abstract": "In this paper, we introduce and analyze the properties of a class of games, the atomic congestion games on graphs (ACGGs), which is a generalization of the classical congestion games. In particular, an ACGG captures the spatial information that is often ignored in a classical congestion game. This is useful in many networking problems, e.g., wireless networks where interference among the users heavily depends on the spatial information. In an ACGG, a player's payoff for using a resource is a function of the number of players who interact with it and use the same resource. Such spatial information can be captured by a graph. We study fundamental properties of the ACGGs: under what conditions these games possess a pure strategy Nash equilibrium (PNE), or the finite improvement property (FIP), which is sufficient for the existence of a PNE. We show that a PNE may not exist in general, but that it does exist in many important special cases including tree, loop, or regular bipartite networks. The FIP holds for important special cases including systems with two resources or identical payoff functions for each resource. Finally, we present two wireless network applications of ACGGs: power control and channel contention under IEEE 802.11.", "paper_title": "Atomic Congestion Games on Graphs and Their Applications in Networking", "paper_id": "WOS:000310141400017"}