{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "gmpr"}, {"score": 0.004594443767709888, "phrase": "key_importance"}, {"score": 0.00454090611248773, "phrase": "software_engineering"}, {"score": 0.004461761855323898, "phrase": "real-time_applications"}, {"score": 0.003698442219929622, "phrase": "physical_platform"}, {"score": 0.003487721546598799, "phrase": "computing_capacity"}, {"score": 0.0033473779327638322, "phrase": "multiprocessor_platforms"}, {"score": 0.0025854347094662247, "phrase": "generalized_multiprocessor_periodic_resource_model"}, {"score": 0.0024379730432321656, "phrase": "mpr_model"}, {"score": 0.002206290313627494, "phrase": "application_specification"}, {"score": 0.0021049977753042253, "phrase": "matlab_routines"}], "paper_keywords": ["Real-time scheduling", " Compositional scheduling", " Multiprocessors", " Real-time interfaces"], "paper_abstract": "Composition is a practice of key importance in software engineering. When real-time applications are composed, it is necessary that their timing properties (such as meeting the deadlines) are guaranteed. The composition is performed by establishing an interface between the application and the physical platform. Such an interface typically contains information about the amount of computing capacity needed by the application. For multiprocessor platforms, the interface should also present information about the degree of parallelism. Several interface proposals have recently been put forward in various research works. However, those interfaces are either too complex to be handled or too pessimistic. In this paper we propose the generalized multiprocessor periodic resource model (GMPR) that is strictly superior to the MPR model without requiring a too detailed description. We then derive a method to compute the interface from the application specification. This method has been implemented in Matlab routines that are publicly available.", "paper_title": "Compositional multiprocessor scheduling: the GMPR interface", "paper_id": "WOS:000334195100003"}