{"auto_keywords": [{"score": 0.05007852962010534, "phrase": "journal_impact_factors"}, {"score": 0.00460125407969429, "phrase": "citation-based_journal_impact_factor"}, {"score": 0.004370457120206237, "phrase": "critical_examination"}, {"score": 0.004138637076221288, "phrase": "empirical_analysis"}, {"score": 0.004088807948906792, "phrase": "referencing_practices"}, {"score": 0.004039576329942698, "phrase": "journal_editors"}, {"score": 0.0038953958723049287, "phrase": "numerical_values"}, {"score": 0.0037336520904376687, "phrase": "large_samples"}, {"score": 0.003546218640291191, "phrase": "oil_a_large_scale"}, {"score": 0.003492897128445075, "phrase": "case_studies"}, {"score": 0.0034717929086014636, "phrase": "particular_science_journals"}, {"score": 0.003378385493203297, "phrase": "ill_individual_cases"}, {"score": 0.003287482882222731, "phrase": "commonly_used_journal_impact_factor_call"}, {"score": 0.003160466312198169, "phrase": "strategic_editorial_behaviour"}, {"score": 0.003010834638993771, "phrase": "particular_editorial_strategies"}, {"score": 0.0024349853033241663, "phrase": "occurrence_increases"}, {"score": 0.0023479408542211875, "phrase": "impact_factors"}, {"score": 0.0021830553825770097, "phrase": "\"informal\"_or_even_anecdotal_evidences"}, {"score": 0.002117811223107415, "phrase": "ill_thorough_empirical_research"}, {"score": 0.0021049977753042253, "phrase": "large_data_samples"}], "paper_keywords": ["information retrieval", " electronic journals", " user studies"], "paper_abstract": "Purpose - The purpose of this paper is to examine the effects of the use of the citation-based journal impact factor for evaluative purposes upon the behaviour of authors and editors. It seeks to give a critical examination of a number of claims as regards the manipulability of this indicator on the basis of all empirical analysis of publication and referencing practices of authors and journal editors. Design/methodology/approach - The paper describes mechanisms that may affect the numerical values of journal impact factors. It also analyses general, \"macro\" patterns in large samples of journals ill order to obtain indications of the extent to which such mechanisms are actually applied oil a large scale. Finally it presents case studies of particular science journals ill order to illustrate what their effects may be ill individual cases. Findings - The paper shows that the commonly used journal impact factor call to some extent be relatively easily manipulated. It discusses several types of strategic editorial behaviour, and presents Cases ill which journal impact factors were - intentionally or otherwise - affected by particular editorial strategies. These findings lead to the conclusion that one must be most careful in interpreting and using journal impact factors, and that authors, editors mid policy makers must be aware of their potential manipulability. They also show that some mechanisms occur as of yet rather infrequently while for others it is most difficult if not impossible to assess empirically how often they are actually applied. If their frequency of occurrence increases, one should come to the conclusion that the impact of impact factors is decreasing. Originality/value - The paper systematically describes a number of claims about the manipulability of journal impact factors that are often based on \"informal\" or even anecdotal evidences and illustrates how these claims call he further examined ill thorough empirical research of large data samples.", "paper_title": "Is the impact of journal impact factors decreasing?", "paper_id": "WOS:000258733800002"}