{"auto_keywords": [{"score": 0.03005210930552318, "phrase": "carbon_cage"}, {"score": 0.003818326867123525, "phrase": "dft_semi"}, {"score": 0.0037731618765688584, "phrase": "pseudospot_approximation"}, {"score": 0.0032709661258673206, "phrase": "structural_criteria"}, {"score": 0.003232254571848865, "phrase": "energetic_criteria"}, {"score": 0.0031750418391373035, "phrase": "reactivity_criteria"}, {"score": 0.002921114512115261, "phrase": "holmium_atom"}, {"score": 0.002768674345336861, "phrase": "endohedral_fullerenes'_reactive_activity"}, {"score": 0.0023018188296933923, "phrase": "similar_aim"}, {"score": 0.0022610379771517966, "phrase": "holmium_endohedral_fullerenes"}, {"score": 0.0021049977753042253, "phrase": "holmium_cation"}], "paper_keywords": ["Aromaticity", " Endohedral", " Fullerene", " Holmium"], "paper_abstract": "Density functional theory BLYP/DNP was employed to optimize a series of fullerenes and their holmium endohedral compounds, including C-20, Ho@C-20, Ho3+@C-20, C-60, Ho@C-60, Ho3+@C-60,C-70, Ho@C-70, Ho3+@C-70 C-78, Ho@C-78, Ho3+@C-78, C-82,Ho@C-82 and Ho3+@C-82. DFT semi core pseudospot approximation was taken into consideration in the calculations of the element holmium because of its particular electronic structure. Fullerenes and their holmium endohedral compounds' aromaticity were studied in terms of structural criteria, energetic criteria, and reactivity criteria. The results indicate that the aromaticity of fullerenes was reduced when a holmium atom was introduced into the carbon cage, and the endohedral fullerenes' reactive activity enhance; but the aromaticity of the carbon cage increased when a Ho3+ cation was encapsulated into a fullerene. Calculations of aromaticity and stability indicate that two paths can lead to the similar aim of preparing holmium endohedral fullerenes; that is, they can form from either a holmium atom or a holmium cation (Ho3+) reacting with fullerenes, respectively, and the latter is more favorable.", "paper_title": "The studies on the aromaticity of fullerenes and their holmium endohedral compounds", "paper_id": "WOS:000286667800008"}