{"auto_keywords": [{"score": 0.03581216971673249, "phrase": "one-time_encryption-key_technique"}, {"score": 0.01161275661625304, "phrase": "new_perspective"}, {"score": 0.00481495049065317, "phrase": "traditional_dl-based_encryption_scheme"}, {"score": 0.004712463245074863, "phrase": "modern_cryptosystem"}, {"score": 0.004398872331144531, "phrase": "public_keys"}, {"score": 0.004035946043145475, "phrase": "bellare_et_al"}, {"score": 0.0037348894128879082, "phrase": "public-key_encryption_schemes"}, {"score": 0.0031166151196841308, "phrase": "random_one-time_encryption-key"}, {"score": 0.00295950473406239, "phrase": "original_public-key"}, {"score": 0.0027982016314450717, "phrase": "generated_one-time_encryption-key"}, {"score": 0.0026342827320931937, "phrase": "formal_proof"}, {"score": 0.002427035025924384, "phrase": "chosen_ciphertext_attack"}, {"score": 0.002255440007549068, "phrase": "hayashi"}, {"score": 0.002236071274092379, "phrase": "tanaka"}, {"score": 0.0021049977753042253, "phrase": "provable_anonymity"}], "paper_keywords": ["Anonymity", " Indistinguishability", " Public-key encryption", " Discrete-logarithm-based encryption", " Chosen ciphertext attack"], "paper_abstract": "In modern cryptosystem, Anonymity means that in some sense any adversary cannot tell which one of public keys has been used for encrypting a plaintext, and was first formally defined as the indistinguishability of keys by Bellare et al. in 2001. Recently, several well-known techniques have been proposed in order to achieve the anonymity of public-key encryption schemes. In this paper, anonymity is considered first from a new perspective. And then basing on this new perspective, a one-time encryption-key technique is proposed to achieve the anonymity of traditional discrete-logarithm-based (DL-based) encryption scheme. In this new technique, for each encryption, a random one-time encryption-key will be generated to encrypt the plaintext, instead of the original public-key. Consequently, in roughly speaking, by the randomness of the generated one-time encryption-key, this new technique should achieve the anonymity. Furthermore, in the formal proof of anonymity, only based on several weaker conditions, the one-time encryption-key technique efficiently achieves the provable indistinguishability of keys under chosen ciphertext attack (IK-CCA anonymity). As a result, compared with the work of Hayashi and Tanaka in 2006, the one-time encryption-key technique presented here has fewer requirements for achieving the provable anonymity. (C) 2010 Elsevier Inc. All rights reserved.", "paper_title": "One-time encryption-key technique for the traditional DL-based encryption scheme with anonymity", "paper_id": "WOS:000282405000012"}