{"auto_keywords": [{"score": 0.03340305748453232, "phrase": "loading"}, {"score": 0.009443731691615402, "phrase": "dw"}, {"score": 0.00481495049065317, "phrase": "user_requirements"}, {"score": 0.004768649568826951, "phrase": "data_warehouses"}, {"score": 0.004329331617724, "phrase": "widely_accepted_approach"}, {"score": 0.00393032656248792, "phrase": "new_dw_model"}, {"score": 0.0038737214010638745, "phrase": "main_problem"}, {"score": 0.0033182152378613767, "phrase": "requirements_validation_capability"}, {"score": 0.0030121159909273897, "phrase": "novel_trace_metamodel"}, {"score": 0.002855934865505357, "phrase": "md_conceptual_models"}, {"score": 0.002655894070657161, "phrase": "automatic_way"}, {"score": 0.0025673856614952854, "phrase": "md_conceptual_model"}, {"score": 0.0024578987081792405, "phrase": "trace_model"}, {"score": 0.0023079225317714815, "phrase": "md_elements"}, {"score": 0.002263639474937039, "phrase": "user_satisfaction"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Data warehouse", " Business Intelligence", " Traceability", " User requirements", " MDA"], "paper_abstract": "The complexity of the data warehouse (DW) development process requires to follow a methodological approach in order to be successful. A widely accepted approach for this development is the hybrid one, in which requirements and data sources must be accommodated to a new DW model. The main problem is that we lose the relationships between requirements, elements in the multidimensional (MD) conceptual models and data sources in the process, since no traceability is explicitly specified. Therefore, this hurts requirements validation capability and increases the complexity of Extraction. Transformation and Loading processes. In this paper, we propose a novel trace metamodel for DWs and focus on the relationships between requirements and MD conceptual models. We propose a set of Query/View/Transformation rules to include traceability in DWs in an automatic way, allowing us to obtain a MD conceptual model of the DW, as well as a trace model. Therefore, we are able to trace every requirement to the MD elements, further increasing user satisfaction. Finally, we show the implementation in our Lucentia BI tool. (C) 2012 Elsevier Ltd. All rights reserved.", "paper_title": "A trace metamodel proposal based on the model driven architecture framework for the traceability of user requirements in data warehouses", "paper_id": "WOS:000305727800004"}