{"auto_keywords": [{"score": 0.04360247103779728, "phrase": "personalized_advice"}, {"score": 0.0406718782151503, "phrase": "work_habits"}, {"score": 0.00481495049065317, "phrase": "support_learners"}, {"score": 0.004320055598195391, "phrase": "higher_education_degrees"}, {"score": 0.003835972725191194, "phrase": "self-learning_skills"}, {"score": 0.0037188360359702182, "phrase": "first_obstacle"}, {"score": 0.003336225354214798, "phrase": "mobile_application"}, {"score": 0.002977419551510206, "phrase": "practical_examples"}, {"score": 0.0027982016314450717, "phrase": "mooc_participants"}, {"score": 0.002755104031926742, "phrase": "personalized_planning"}, {"score": 0.0025361866386341796, "phrase": "learners'_profiles"}, {"score": 0.0024586427394152196, "phrase": "previous_performance"}, {"score": 0.0021049977753042253, "phrase": "study_skills"}], "paper_keywords": ["MOOCs", " planning", " mentoring", " study skills", " work habits"], "paper_abstract": "MOOCs have brought a revolution to education. However, their impact is mainly benefiting people with Higher Education degrees. The lack of support and personalized advice in MOOCs is causing that many of the learners that have not developed work habits and self-learning skills give them up at the first obstacle, and do not see MOOCs as an alternative for their education and training. My Learning Mentor (MLM) is a mobile application that addresses the lack of support and personalized advice for learners in MOOCs. This paper presents the architecture of MLM and practical examples of use. The architecture of MLM is designed to provide MOOC participants with a personalized planning that facilitates them following up the MOOCs they enroll. This planning is adapted to learners' profiles, preferences, priorities and previous performance (measured in time devoted to each task). The architecture of MLM is also designed to provide tips and hints aimed at helping learners develop work habits and study skills, and eventually become self-learners.", "paper_title": "My Learning Mentor: A Mobile App to Support Learners Participating in MOOCs", "paper_id": "WOS:000358988400006"}