{"auto_keywords": [{"score": 0.0442367062743104, "phrase": "user_behavior"}, {"score": 0.015719716506582538, "phrase": "commercial_web_sites"}, {"score": 0.014833257252423201, "phrase": "link-structure_personalization"}, {"score": 0.012889262822425786, "phrase": "link-structure_personalization_system"}, {"score": 0.004710183931170507, "phrase": "design_evaluation"}, {"score": 0.004641603150887887, "phrase": "customers'_site_navigation_behavior"}, {"score": 0.004420099311599503, "phrase": "corporate_web_sites"}, {"score": 0.004366387782457736, "phrase": "top_indian_companies"}, {"score": 0.004345085569121329, "phrase": "statistical_analysis"}, {"score": 0.004260906498835763, "phrase": "principal_methodological_approach"}, {"score": 0.004209121247582621, "phrase": "user's_interest"}, {"score": 0.004097389262726735, "phrase": "markov_decision_process"}, {"score": 0.004037694641919865, "phrase": "overall_framework"}, {"score": 0.004008172944779366, "phrase": "semi-markov_model"}, {"score": 0.003724527573901348, "phrase": "non-functional_features"}, {"score": 0.0036792371574197826, "phrase": "over-stressed_or_under-stressed_features"}, {"score": 0.003652347356274881, "phrase": "indian"}, {"score": 0.0035553221885904467, "phrase": "user_behavior_model"}, {"score": 0.0035120820636355458, "phrase": "real_life_user_behavior"}, {"score": 0.0034355662264234864, "phrase": "link-structure_personalization_algorithms"}, {"score": 0.003279445150771808, "phrase": "optimal_policy"}, {"score": 0.002988101395789399, "phrase": "semi-markov_process"}, {"score": 0.002709265357215381, "phrase": "adequate_pre-processing_and_appropriate_normalization_practical_implications"}, {"score": 0.002592406350456334, "phrase": "low_site_evaluation_index"}, {"score": 0.0025420959370630997, "phrase": "high_weight"}, {"score": 0.002517307133542312, "phrase": "product_offering"}, {"score": 0.002414616656410503, "phrase": "link-structure_personalization_algorithm"}, {"score": 0.0023677483882740317, "phrase": "site_navigability"}, {"score": 0.002356173823922118, "phrase": "user_behavior_data"}, {"score": 0.0022434880661725493, "phrase": "ecommerce_site"}, {"score": 0.0021999341184897217, "phrase": "commercial_web_site_design"}, {"score": 0.0021049977753042253, "phrase": "commercial_web_site"}], "paper_keywords": ["design", " benchmarking", " world wide web"], "paper_abstract": "Purpose - To create a benchmark for design evaluation of commercial web sites, to model customers' site navigation behavior, and to develop and implement algorithms for link-structure personalization. Design/methodology/approach - The principal methodology used for design benchmarking is a survey of corporate web sites of some US Fortune 500 companies and top Indian companies and statistical analysis of the data so collected. The principal methodological approach for modeling user behavior, user's interest and algorithms for link-structure personalization, is the development of a Markov decision process (MDP) in the overall framework of a semi-Markov model and implementing the same in a link-structure personalization system. Findings - It is observed that the functional web site features significantly differ for the sites dealing with various product categories whereas the non-functional features do not. The over-stressed or under-stressed features in the Indian web sites are found. The statistics generated from the user behavior model are validated against the real life user behavior and found satisfactory. The appropriateness of the link-structure personalization algorithms is established by comparing the set of links generated by the algorithm with the links generated by the optimal policy of the underlying MDP. Research limitations/implications - The corporate that have been considered are conglomerates offering a number of products and services. But we categorize these sites based on their major product offering. Our approach of modeling the user behavior as a semi-Markov process is possible because of our advanced implementation infrastructure. Undesirable network effects like delays, bandwidth, etc. may not make such a model that attractive in a very traditional type of environment. But the data collected in such environment can still be mined after adequate pre-processing and appropriate normalization Practical implications - Using the benchmark proposed in this model a webmaster can evaluate his web site. The sites with low site evaluation index can be improved by adding features with high weight depending on the product offering of the company. Webmaster can design the three level information architecture described in the paper and subsequently implement link-structure personalization algorithm to improve site navigability. Besides improving site navigability the user behavior data collected thereon can be mined to generate other valuable information. Originality/value - To assess and enhance the usability of an ecommerce site our work proposes: a benchmark to evaluate commercial web site design; a stochastic model to study and understand user behavior; an algorithm to personalize link-structure of a commercial web site, and a general framework to implement a link-structure personalization system.", "paper_title": "Design benchmarking, user behavior analysis and link-structure personalization in commercial web sites", "paper_id": "WOS:000241266700003"}