{"auto_keywords": [{"score": 0.04962396550254858, "phrase": "vanets"}, {"score": 0.0059660874577438456, "phrase": "simple_voting"}, {"score": 0.00481495049065317, "phrase": "trust_management"}, {"score": 0.004252602474733162, "phrase": "distinct_characters"}, {"score": 0.00386496062825374, "phrase": "current_trust_management_schemes"}, {"score": 0.0035125292519354724, "phrase": "ephemeral_nature"}, {"score": 0.0033969001271637934, "phrase": "practical_situations"}, {"score": 0.003131637033429892, "phrase": "social_networks"}, {"score": 0.00305762327908599, "phrase": "trust_management_schemes"}, {"score": 0.0025861368747446324, "phrase": "incorrect_results"}, {"score": 0.0024417832296664698, "phrase": "novel_voting_scheme"}, {"score": 0.002350041573006264, "phrase": "different_voting_weight"}, {"score": 0.0021560018573288666, "phrase": "higher_weight"}], "paper_keywords": ["Reputation system", " Vehicular networks", " Security", " Information cascading", " Information oversampling", " P2P networks"], "paper_abstract": "In the past few years, vehicular ad hoc networks(VANETs) was studied extensively by researchers. VANETs is a type of P2P network, though it has some distinct characters (fast moving, short lived connection etc.). In this paper, we present several limitations of current trust management schemes in VANETs and propose ways to counter them. We first review several trust management techniques in VANETs and argue that the ephemeral nature of VANETs render them useless in practical situations. We identify that the problem of information cascading and oversampling, which commonly arise in social networks, also adversely affects trust management schemes in VANETs. To the best of our knowledge, we are the first to introduce information cascading and oversampling to VANETs. We show that simple voting for decision making leads to oversampling and gives incorrect results in VANETs. To overcome this problem, we propose a novel voting scheme. In our scheme, each vehicle has different voting weight according to its distance from the event. The vehicle which is more closer to the event possesses higher weight. Simulations show that our proposed algorithm performs better than simple voting, increasing the correctness of voting.", "paper_title": "A social network approach to trust management in VANETs", "paper_id": "WOS:000333209900003"}