{"auto_keywords": [{"score": 0.04358136766574205, "phrase": "wrs_problem"}, {"score": 0.0345051862046611, "phrase": "rsrc_problem"}, {"score": 0.00481495049065317, "phrase": "rectangle_stabbing"}, {"score": 0.004776297980616768, "phrase": "related_problems"}, {"score": 0.00464343008299973, "phrase": "constant_approximation_algorithms"}, {"score": 0.004496080495247288, "phrase": "weighted_rectangle_stabbing"}, {"score": 0.004459996817155436, "phrase": "wrs"}, {"score": 0.004266501496765747, "phrase": "rsrc"}, {"score": 0.0040978781692373005, "phrase": "axis-aligned_rectangles"}, {"score": 0.003935892934907777, "phrase": "positive_weight"}, {"score": 0.0034452601929727752, "phrase": "total_cost"}, {"score": 0.0033492947290751996, "phrase": "stabbing_lines"}, {"score": 0.0031780859997873803, "phrase": "additional_positive_rejecting_cost"}, {"score": 0.0030523478413779686, "phrase": "stabbing_line"}, {"score": 0.0028155572612699976, "phrase": "natural_logarithmic_base"}, {"score": 0.0027150658583211746, "phrase": "interesting_techniques"}, {"score": 0.002628747284714371, "phrase": "lower_bounding"}, {"score": 0.002494279207996077, "phrase": "simple_but_powerful_lp"}, {"score": 0.0024345529783611703, "phrase": "to-be-rejected_rectangles"}, {"score": 0.002263799931018574, "phrase": "stochastic_rectangle_stabbing_problem_and_polygon_stabbing_problem"}, {"score": 0.0021049977753042253, "phrase": "practical_purpose"}], "paper_keywords": [""], "paper_abstract": "In this paper we present constant approximation algorithms for two NP-hard rectangle stabbing problems, called the weighted rectangle stabbing (WRS) problem and the rectangle stabbing with rejecting cost (RSRC) problem. In the WRS problem a set of axis-aligned rectangles is given, with each rectangle associated with a positive weight, and a set of weighted horizontal and/or vertical stabbing lines is sought so that each rectangle is intersected by at least one stabbing line with a weight (called cost) no less than that of the rectangle and the total cost (or weight) of all stabbing lines is minimized. In the RSRC problem each rectangle is associated with an additional positive rejecting cost and is required to be either stabbed by a stabbing line or rejected by paying its rejecting cost. For the WRS problem, we present a polynomial time 2e-approximation algorithm, where e is the natural logarithmic base. Our algorithm is based on a number of interesting techniques such as rounding, randomization, and lower bounding. For the RSRC problem, we give a 3e-approximation algorithm by using a simple but powerful LP rounding technique to identify those to-be-rejected rectangles. Our techniques are quite general and can be easily applied to several related problems, such as the stochastic rectangle stabbing problem and polygon stabbing problem from fixed directions. Algorithms obtained by our techniques are relatively simple and can be easily implemented for practical purpose.", "paper_title": "Constant approximation algorithms for rectangle stabbing and related problems", "paper_id": "WOS:000243383600004"}