{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "obdd_compilation"}, {"score": 0.004618342952383313, "phrase": "model-based_diagnosis"}, {"score": 0.004531637625717547, "phrase": "potentially_exponential_size"}, {"score": 0.004480394224548146, "phrase": "search_space"}, {"score": 0.004106225442735525, "phrase": "domain_model"}, {"score": 0.0039986494357811715, "phrase": "present_paper"}, {"score": 0.0038498211283780484, "phrase": "diagnostic_problem"}, {"score": 0.00373474182086791, "phrase": "normal_and_faulty_behavior"}, {"score": 0.003435643372146385, "phrase": "static_models"}, {"score": 0.0032951702142329357, "phrase": "important_example"}, {"score": 0.0031724417545242315, "phrase": "combinatorial_digital_circuits"}, {"score": 0.002951673109860487, "phrase": "minimum_cardinality_diagnoses"}, {"score": 0.002777689934513217, "phrase": "obdd_encoding"}, {"score": 0.002643888053328987, "phrase": "system_observability"}, {"score": 0.0024319378563138223, "phrase": "additional_observations"}, {"score": 0.002386181960126766, "phrase": "test_vector"}, {"score": 0.0022711961447468114, "phrase": "latter_case"}, {"score": 0.0022369407711124775, "phrase": "formal_guarantee"}, {"score": 0.002169968849836984, "phrase": "polynomial_time"}, {"score": 0.0021049977753042253, "phrase": "compiled_domain_model"}], "paper_keywords": [""], "paper_abstract": "Since it is known that Model-Based Diagnosis may suffer from a potentially exponential size of the search space, a number of techniques have been proposed for alleviating the problem. Among them, some forms of compilation of the domain model have been investigated. In the present paper we address the problem of evaluating the complexity of diagnostic problem solving when Ordered Binary Decision Diagrams are adopted for representing the normal and faulty behavior of the system to be diagnosed and the solution space. In particular we analyze the case of the diagnosis of static models that exhibit a directionality from inputs to outputs (an important example of this type of models is the class of combinatorial digital circuits). We show that the problem of determining the set of all diagnoses and of determining the minimum cardinality diagnoses can be solved in time and space polynomial with respect to the size of the OBDD encoding the domain model. These results hold regardless of the degree of system observability including whether observations are precise or uncertain. We then analyze the complexity of refining the set of diagnoses by making additional observations and by using a test vector for troubleshooting the system. In particular we show that in the latter case we lose the formal guarantee that the diagnosis can be performed in polynomial time with respect to the size of the compiled domain model.", "paper_title": "Model-based diagnosis through OBDD compilation: A complexity analysis", "paper_id": "WOS:000241529700016"}