{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "spherical_inverted_pendulum"}, {"score": 0.022218053620468872, "phrase": "regulator_equations"}, {"score": 0.007112322459298158, "phrase": "output_regulation_problem"}, {"score": 0.004760765880314089, "phrase": "neural_network_control"}, {"score": 0.003648411055689428, "phrase": "nonlinear_partial_differential_equations"}, {"score": 0.0035666632046674153, "phrase": "exact_solution"}, {"score": 0.003078028357912228, "phrase": "polynomial_approximation"}, {"score": 0.0025965853546625352, "phrase": "approximate_solution"}, {"score": 0.0024673738215365104, "phrase": "neural_network_approximation_approach"}, {"score": 0.002190280748985751, "phrase": "crown_copyright"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Output regulation", " Multivariable nonlinear systems", " Spherical inverted pendulum", " Neural network control"], "paper_abstract": "The spherical inverted pendulum is a two-input, two-output non-minimum phase nonlinear system. Recently, the output regulation problem of the spherical inverted pendulum was studied in [21]. It is known that the solvability of the output regulation problem depends on the solvability of the regulator equations which are a set of nonlinear partial differential equations. Since the exact solution of the regulator equations associated with the spherical inverted pendulum is not available due to the complexity of the equations, the paper [21] tried a polynomial approximation of the solution of the regulator equations. In this paper, we first show that the solution of the regulator equations associated with the spherical inverted pendulum exist and then find an approximate solution to the output regulation problem of the spherical inverted pendulum via a neural network approximation approach. We also make some comparison between the method in this paper and the method in [21]. Crown Copyright (c) 2012 Published by Elsevier B.V. All rights reserved.", "paper_title": "Approximate output regulation of spherical inverted pendulum by neural network control", "paper_id": "WOS:000302972300006"}