{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "clinical_guidelines"}, {"score": 0.04274518365190484, "phrase": "health_care_organizations"}, {"score": 0.03090007892100674, "phrase": "health_care_professionals"}, {"score": 0.004769702911065878, "phrase": "special_types"}, {"score": 0.004658426838467567, "phrase": "collective_agents"}, {"score": 0.004549734943142138, "phrase": "ontological_theory"}, {"score": 0.003820144626025562, "phrase": "formal_terms"}, {"score": 0.0034428776029411974, "phrase": "different_levels"}, {"score": 0.002890266318361907, "phrase": "standard_guideline-based_management_systems"}, {"score": 0.0027307746993761035, "phrase": "health_care_organization"}, {"score": 0.002580061425699194, "phrase": "different_occasions"}, {"score": 0.002449208093757498, "phrase": "well_justified_reasons"}, {"score": 0.0022706045233150795, "phrase": "clinical_context"}, {"score": 0.002196609505859369, "phrase": "inference_tools"}, {"score": 0.002155412043665635, "phrase": "robust_ontology"}], "paper_keywords": ["clinical workflow", " ontology", " clinical guidelines", " reference partitions", " guideline conformance"], "paper_abstract": "Objective: Clinical guidelines are special types of plans realized by collective agents. We provide an ontological theory of such plans that is designed to support the construction of a framework in which guideline-based information systems can be employed in the management of workflow in health care organizations. Method: The framework we propose allows us to represent, in formal terms, how clinical guidelines are realized through the actions of individuals or ganized into teams. We provide various levels of implementation representing different levels of conformity on the part of health care organizations. Result. Implementations built in conformity with our framework are marked by two dimensions of flexibility that are designed to make them more likely to be accepted by health care professionals than standard guideline-based management systems. They do justice to the fact 1) that responsibilities within a health care organization are widely shared, and 2) that health care professionals may on different occasions be non-compliant with guidelines for a variety of well justified reasons. Conclusion: The advantage of the framework lies in its built-in flexibility, its sensitivity to clinical context, and its ability to use inference tools based on a robust ontology. One disadvantage lies in its complicated implementation.", "paper_title": "Clinical guidelines as plans - An ontological theory", "paper_id": "WOS:000236051700014"}