{"auto_keywords": [{"score": 0.04358406117033228, "phrase": "multiple_applications"}, {"score": 0.00481495049065317, "phrase": "multi-application_multiprocessor_systems"}, {"score": 0.004507760907425495, "phrase": "large_number"}, {"score": 0.004257360656055417, "phrase": "huge_number"}, {"score": 0.004220086640742953, "phrase": "possible_combinations"}, {"score": 0.003682207422331339, "phrase": "modern_embedded_systems"}, {"score": 0.003492840830999027, "phrase": "complete_design-time_analysis"}, {"score": 0.003342471131048328, "phrase": "new_technique"}, {"score": 0.0031845067058084613, "phrase": "multiprocessor_platform"}, {"score": 0.0031565959573536194, "phrase": "iterative_probabilistic_analysis"}, {"score": 0.0026585629592360085, "phrase": "earlier_techniques"}, {"score": 0.002381365139274329, "phrase": "ten_applications"}, {"score": 0.0022687189700002254, "phrase": "varying_execution_times"}, {"score": 0.002142426911242168, "phrase": "real_applications"}, {"score": 0.0021049977753042253, "phrase": "field-programmable_gate_array_multiprocessor_platform"}], "paper_keywords": ["Heterogeneous multiprocessor", " multiple applications", " non-preemption", " performance prediction", " synchronous data flow graphs"], "paper_abstract": "Modern embedded devices are increasingly becoming multiprocessor with the need to support a large number of applications to satisfy the demands of users. Due to a huge number of possible combinations of these multiple applications, it becomes a challenge to predict their performance. This becomes even more important when applications may be dynamically started and stopped in the system. Since modern embedded systems allow users to download and add applications at run-time, a complete design-time analysis is not always possible. This paper presents a new technique to accurately predict the performance of multiple applications mapped on a multiprocessor platform. Iterative probabilistic analysis is used to estimate the time spent by tasks during their contention phase, and thereby predicting the performance of applications. The approach is scalable with the number of applications and processors in the system. As compared to earlier techniques, this approach is much faster and scalable, while still improving the accuracy. The analysis takes 300 mu s on a 500 MHz processor for ten applications. Since multimedia applications are increasingly becoming more dynamic, results of a case-study with applications with varying execution times are also presented. In addition, results of a case-study with real applications executing on a field-programmable gate array multiprocessor platform are shown.", "paper_title": "Iterative Probabilistic Performance Prediction for Multi-Application Multiprocessor Systems", "paper_id": "WOS:000275851700003"}