{"auto_keywords": [{"score": 0.04040574756011805, "phrase": "serialists"}, {"score": 0.021100277941485467, "phrase": "traditional_statistics"}, {"score": 0.012685908056769337, "phrase": "holists"}, {"score": 0.008713768692145006, "phrase": "electronic_journals"}, {"score": 0.008620331680762755, "phrase": "mobile_context"}, {"score": 0.007851060142583993, "phrase": "search_mechanisms"}, {"score": 0.006441055045901285, "phrase": "data_mining"}, {"score": 0.006303347206394104, "phrase": "multiple_searches"}, {"score": 0.004479726755921316, "phrase": "mobile_devices"}, {"score": 0.004078439401031372, "phrase": "horizontal_screens"}, {"score": 0.003976656675903324, "phrase": "negative_emotions"}, {"score": 0.003933813742509612, "phrase": "-_participants'_cognitive_styles"}, {"score": 0.0038218004095195183, "phrase": "ford's_study_preference_questionnaire"}, {"score": 0.0036862418860907978, "phrase": "sciencedirect"}, {"score": 0.003529880686744397, "phrase": "findings_-_holists"}, {"score": 0.003367939885018247, "phrase": "complex_search_mechanism"}, {"score": 0.0027708353425467927, "phrase": "single_approach"}, {"score": 0.0027113815712365924, "phrase": "major_results"}, {"score": 0.002643625373073316, "phrase": "vilar"}, {"score": 0.002624577999455744, "phrase": "z._umer"}, {"score": 0.0023042157412517333, "phrase": "integrative_approach"}, {"score": 0.002158979137177815, "phrase": "mobile_electronic_journals"}, {"score": 0.0021049977753042253, "phrase": "different_cognitive_style_groups"}], "paper_keywords": ["Electronic journals", " Cognitive styles", " Mobile devices", " Search behaviour"], "paper_abstract": "Purpose - The purpose of this paper is to examine how different cognitive style groups use electronic journals via mobile devices, with an emphasis on the use of search mechanisms, the approaches to judge the relevance and to refine the results, the use of horizontal screens, and on the influence of negative emotions. Design/methodology/approach - Participants' cognitive styles were identified as Holists and Serialists with Ford's Study Preference Questionnaire. The behaviour of the participants interacting with the ScienceDirect was observed and was analysed with both traditional statistics and data mining. Findings - Holists prefer to use multiple searches when undertaking the Expert Search only, which is a complex search mechanism. Conversely, Serialists have a tendency to use multiple searches, irrespective of the complexity of search mechanisms. Additionally, the Expert Search may be helpful for Serialists while the Basic Search seems beneficial to Holists. Regarding the judgement of relevance, Holists tend to use a variety of approaches while Serialists prefer to use a single approach. In general, the major results of this study confirm those of Vilar and Z. umer (2008). Originality/value - The novelty of this study covers two aspects. One is to examine the behaviour of Holists and Serialists in the mobile context of electronic journals and the other is to analyse data with an integrative approach that combines both traditional statistics and data mining. The former contributes to the understandings of how to design mobile electronic journals that can accommodate the needs of different cognitive style groups. The latter can not only strengthen the reliability of the results obtained from traditional statistics, but also discover findings neglected by traditional statistics.", "paper_title": "Cognitive styles and the use of electronic journals in a mobile context", "paper_id": "WOS:000345148600004"}