{"auto_keywords": [{"score": 0.03951174577430349, "phrase": "mission-oriented_mobile_wsns"}, {"score": 0.033163216850818134, "phrase": "k-coverage_problem"}, {"score": 0.011868923114750412, "phrase": "sensor_placement_problem"}, {"score": 0.011224370794575908, "phrase": "small_number"}, {"score": 0.00481495049065317, "phrase": "mission-oriented_mobile_wireless_sensor_networks"}, {"score": 0.004485422068678908, "phrase": "energy-efficient_wireless_sensor_networks"}, {"score": 0.004377077848734575, "phrase": "mission-oriented_wsns"}, {"score": 0.004077394032903726, "phrase": "multiple_missions"}, {"score": 0.004047583252380616, "phrase": "monitoring_tasks"}, {"score": 0.003949772956223261, "phrase": "different_requirements"}, {"score": 0.003385480888810982, "phrase": "sensor_selection_problem"}, {"score": 0.0033117140765604207, "phrase": "above-computed_locations"}, {"score": 0.0032554492909625653, "phrase": "total_energy_consumption"}, {"score": 0.0032316284407550647, "phrase": "sensor_mobility"}, {"score": 0.003168952160907741, "phrase": "centralized_and_distributed_approaches"}, {"score": 0.0030472117009926777, "phrase": "helly's_theorem"}, {"score": 0.003024909947609294, "phrase": "geometric_analysis"}, {"score": 0.0030027709233714276, "phrase": "reuleaux_triangle"}, {"score": 0.002880333728285514, "phrase": "sensing_range"}, {"score": 0.0027225697292481165, "phrase": "probabilistic_sensing_model"}, {"score": 0.002682850814881611, "phrase": "stochastic_nature"}, {"score": 0.0024383967028975616, "phrase": "good_match"}, {"score": 0.002414616656410503, "phrase": "analytical_results"}, {"score": 0.0023852166782390265, "phrase": "simulation_results"}, {"score": 0.002141421723174112, "phrase": "correct_operation"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Mission-oriented k-coverage", " Deterministic sensing model", " Stochastic sensing model", " Sensor placement", " Sensor selection", " Sensor mobility"], "paper_abstract": "The problem of sensor deployment to achieve k-coverage of a field, where every point is covered by at least k sensors, is very critical in the design of energy-efficient wireless sensor networks (WSNs). It becomes more challenging in mission-oriented WSNs, where sensors have to move in order to k-cover a region of interest in the field. In this type of network, there are multiple missions (or monitoring tasks) to be accomplished, each of which has different requirements, particularly, in terms of coverage. In this paper, we consider the problem of k-coverage in mission-oriented mobile WSNs which we divide into two sub-problems, namely sensor placement and sensor selection. The sensor placement problem is to identify a subset of sensors and their locations in a region of interest so it is k-covered with a small number of sensors. The sensor selection problem is to determine which sensors should move to the above-computed locations in the region while minimizing the total energy consumption due to sensor mobility and communication. Specifically, we propose centralized and distributed approaches to solve the k-coverage problem in mission-oriented mobile WSNs. Our solution to the sensor placement problem is based on Helly's Theorem and the geometric analysis of the Reuleaux triangle. First, we consider a deterministic (or disk) sensing model, where the sensing range is modeled as a disk Then, based on the above analysis, we address the k-coverage problem using a more realistic sensing model, known as probabilistic sensing model. The latter reflects the stochastic nature of the characteristics of the sensors, namely sensing and communication ranges. Our centralized and distributed protocols enable the sensors to move toward a region of interest and k-cover it with a small number of sensors. Our experiments show a good match between simulation and analytical results. In particular, simulation results show that our solution to the k-coverage problem in mission-oriented mobile WSNs outperforms an existing one in terms of the number of sensors needed to k-cover a region of interest in the field and their total energy consumption due to communication, sensing, and mobility for the correct operation of the protocol. Published by Elsevier B.V.", "paper_title": "On the problem of k-coverage in mission-oriented mobile wireless sensor networks", "paper_id": "WOS:000303290000005"}