{"auto_keywords": [{"score": 0.04227911419583832, "phrase": "embedding_method"}, {"score": 0.01887702799805815, "phrase": "bow_model"}, {"score": 0.00481495049065317, "phrase": "effective_and_efficient_image_search"}, {"score": 0.0044967055264893184, "phrase": "large-scale_image_search"}, {"score": 0.0043953478557600565, "phrase": "recent_work"}, {"score": 0.003966667994579941, "phrase": "different_variants"}, {"score": 0.003419943984098415, "phrase": "image_search_performance_variation"}, {"score": 0.0030337085953063125, "phrase": "image_search_performance"}, {"score": 0.0028328599839713866, "phrase": "descriptor_matching"}, {"score": 0.002706383680762465, "phrase": "real_image_search"}, {"score": 0.0026302120935562568, "phrase": "effective_and_efficient_image_search_scheme"}, {"score": 0.002153653728048424, "phrase": "image_search_algorithm"}, {"score": 0.0021049977753042253, "phrase": "proposed_image_search_scheme"}], "paper_keywords": ["Bag-of-words (BoW)", " embedding method", " high effectiveness", " high efficiency", " large scale image search"], "paper_abstract": "The bag-of-words (BoW) model has been known as an effective method for large-scale image search and indexing. Recent work shows that the performance of the model can be further improved by using the embedding method. While different variants of the BoW model and embedding method have been developed, less effort has been made to discover their underlying working mechanism. In this paper, we systematically investigate the image search performance variation with respect to a few factors of the BoW model, and study how to employ the embedding method to further improve the image search performance. Subsequently, we summarize several observations based on the experiments on descriptor matching. To validate these observations in a real image search, we propose an effective and efficient image search scheme, in which the BoW model and embedding method are jointly optimized in terms of effectiveness and efficiency by following these observations. Our comprehensive experiments demonstrate that it is beneficial to employ these observations to develop an image search algorithm, and the proposed image search scheme outperforms state-of-the-art methods in both effectiveness and efficiency.", "paper_title": "Joint Optimization Toward Effective and Efficient Image Search", "paper_id": "WOS:000327647500058"}