{"auto_keywords": [{"score": 0.044010507984638604, "phrase": "new_sub-dmus"}, {"score": 0.014269546183230362, "phrase": "parallel_network_system"}, {"score": 0.0070033568332228775, "phrase": "famous_topic"}, {"score": 0.006956387511561103, "phrase": "management_science"}, {"score": 0.006726192266465406, "phrase": "data_envelopment_analysis"}, {"score": 0.0065474966053668355, "phrase": "resource_allocation"}, {"score": 0.00481495049065317, "phrase": "fuzzy_network_systems"}, {"score": 0.004782587436296574, "phrase": "purpose_-_the_purpose"}, {"score": 0.004546666837896004, "phrase": "parallel_network_systems"}, {"score": 0.004485735417293941, "phrase": "new_sub-decision_making_units"}, {"score": 0.0042500322609733574, "phrase": "new_fuzzy_inputs"}, {"score": 0.003266201217790818, "phrase": "real_application"}, {"score": 0.0030220695120265974, "phrase": "fuzzy_efficiency"}, {"score": 0.0030017207229983385, "phrase": "parallel_systems"}, {"score": 0.0029815085406590426, "phrase": "common_set"}, {"score": 0.0028246207858247732, "phrase": "fuzzy_inputs"}, {"score": 0.0027492917990724467, "phrase": "new_fuzzy_outputs"}, {"score": 0.0022145052062614514, "phrase": "first_time"}, {"score": 0.0021049977753042253, "phrase": "fuzzy_numbers"}], "paper_keywords": ["Fuzzy logic", " Mathematical modelling"], "paper_abstract": "Purpose - The purpose of this paper is to consider the following problem; if the manager of the parallel network systems wants to add new sub-decision making units (sub-DMUs) to each parallel network system, he/she wants to know how much new fuzzy inputs allocate to new sub-DMUs and how much outputs these new sub-DMUs produce such that the efficiency of each parallel network system improve or preserve. Design/methodology/approach - Resource allocation and target setting is a famous topic in management science, therefore many managers attention to this field. Data envelopment analysis is one approach to apply the resource. Resource allocation and target setting is a famous topic in management science, therefore many managers attention to this field. Data envelopment analysis is one approach to apply the resource allocation and target setting. In real application the structure of many DMUs are network and the data of them are imprecise. In this work first the authors calculate the fuzzy efficiency of parallel systems by common set of weights method, after that the authors propose an approach to find how much fuzzy inputs allocate to new sub-DMUs, and how much new fuzzy outputs produce, where the efficiency of each parallel network system improve or preserve. Findings - It is found the value of inputs and outputs of new sub-DMUs, where the efficiency of each system not worse than before. Practical implications - The method can be used in many organizations such as banks, chain stores, car factory, etc. Originality/value - For the first time the authors allocate new sub-DMUs to each system, and the data of paper are fuzzy numbers.", "paper_title": "The allocation of sub-decision making units to parallel fuzzy network systems", "paper_id": "WOS:000341938400009"}