{"auto_keywords": [{"score": 0.04612486299870855, "phrase": "shop_owners"}, {"score": 0.009814432242153446, "phrase": "customer_shopping"}, {"score": 0.00481495049065317, "phrase": "cellular_learning_automata_for_mining_customer_behaviour"}, {"score": 0.004779085953614184, "phrase": "shopping_activity._customer"}, {"score": 0.00403885675788806, "phrase": "latter_group"}, {"score": 0.0038184296585478724, "phrase": "good_order"}, {"score": 0.0033747739383101095, "phrase": "suitable_arrangements"}, {"score": 0.0033121909731471787, "phrase": "sequence_mining"}, {"score": 0.0031195948946937378, "phrase": "annual_profit"}, {"score": 0.0030275252142439213, "phrase": "sequences_mining"}, {"score": 0.002916238693326477, "phrase": "dataset_scanning"}, {"score": 0.00276725708403607, "phrase": "shorter_running_time"}, {"score": 0.0025965187247488876, "phrase": "higher_sequences"}, {"score": 0.0025771355599741915, "phrase": "cellular_learning_automata"}, {"score": 0.0023466842270226888, "phrase": "total_scan"}, {"score": 0.002260367486652148, "phrase": "online_basket_data"}, {"score": 0.0022434880661725493, "phrase": "costumer_shopping"}, {"score": 0.002226734412397011, "phrase": "uci_machine_learning"}], "paper_keywords": ["Customer activity", " Data mining", " Cellular learning automata", " Shopping activity", " Sequence pattern mining"], "paper_abstract": "Customer behavior mining in shopping activates is important from two perspectives namely, the perspective supplier of goods and the perspective of shop owners. Both groups want to know that their customers' interest in which goods and identify which sequence of the goods that are most popular. The latter group will even change the manner of arrangements of goods in their shops, manner of good order, and manner of warehousing and marketing. Through the information about the fact that customers have bought which products in sequence, suppliers of goods and shop owners could gain profits by providing suitable arrangements in the shelves. Sequence mining is essential for suppliers of goods and shop owners and will lead to an increase in annual profit. This research provides a way in sequences mining of the customer shopping. The research demonstrates that when dataset scanning is repeated several times, it could obtain sequences of the customer shopping in shorter running time. In addition to this, the research also provides a method of finding two-members and higher sequences by Cellular Learning Automata. Its cost is lower than the Apriori, FP-growth and FP-tree based on array, because of the number of total scan on the dataset. Test was done on an online basket data of costumer shopping from UCI Machine Learning and it is clear that the results of this research are much better than other works.", "paper_title": "CELLULAR LEARNING AUTOMATA FOR MINING CUSTOMER BEHAVIOUR IN SHOPPING ACTIVITY", "paper_id": "WOS:000302664400005"}