{"auto_keywords": [{"score": 0.03478167905660463, "phrase": "rfr"}, {"score": 0.00481495049065317, "phrase": "classical_flow_restoration_problem"}, {"score": 0.004692227830462433, "phrase": "classical_optimization_problem"}, {"score": 0.004638688538861392, "phrase": "survivable_multicommodity_flow_networks"}, {"score": 0.004494570360108983, "phrase": "flow_restoration"}, {"score": 0.004417848254181138, "phrase": "so-called_stub_release"}, {"score": 0.004243862930012258, "phrase": "known_noncompact_lp_formulations"}, {"score": 0.004042566360785431, "phrase": "np"}, {"score": 0.0035416325863738326, "phrase": "admissible_paths"}, {"score": 0.0033439015405773093, "phrase": "rfr."}, {"score": 0.00307657476125683, "phrase": "interesting_special_case"}, {"score": 0.003058944053868522, "phrase": "rfrthe_case"}, {"score": 0.003015306714891983, "phrase": "natural_noncompact_lp_formulation"}, {"score": 0.0029722900280316216, "phrase": "general_rfr_formulation"}, {"score": 0.0029467742734417255, "phrase": "np-hard_dual_separation"}, {"score": 0.00290473242917264, "phrase": "special_case"}, {"score": 0.0028468767420392945, "phrase": "constructed_example"}, {"score": 0.002822434555587263, "phrase": "polynomial_multicommodity_flow_problem"}, {"score": 0.002806256131739047, "phrase": "difficult_dual_separation"}, {"score": 0.0026041635822373265, "phrase": "second_special_case"}, {"score": 0.0023145690608400425, "phrase": "new_result"}, {"score": 0.002294686545883412, "phrase": "second_contribution"}, {"score": 0.0021049977753042253, "phrase": "wiley_periodicals"}], "paper_keywords": ["linear programming", " equivalence of separation and optimization", " multicommodity flow networks", " path generation", " survivable network design", " NP-hardness"], "paper_abstract": "In this article, we revisit a classical optimization problem occurring in designing survivable multicommodity flow networks. The problem, referred to as FR, assumes flow restoration that takes advantage of the so-called stub release. As no compact linear programming (LP) formulation of FR is known and at the same time all known noncompact LP formulations of FR exhibit NP-hard dual separation, the problem itself is believed to be NP-hard, although without a proof. In this article, we study a restriction of FR (RFR) that assumes only elementary (cycle-free) admissible pathsan important case virtually not considered in the literature. The two problems have the same noncompact LP formulations as they differ only in the definition of admissible paths: all paths (also those including cycles) are allowed in FR, while only elementary paths are allowed in RFR. Because of that, RFR is in general computationally more complex than FR. The purpose of this article, is three-fold. First, the article reveals an interesting special case of RFRthe case with only one failing linkfor which a natural noncompact LP formulation obtained by reducing the general RFR formulation still exhibits NP-hard dual separation, but nevertheless this special case of RFR is polynomial. The constructed example of a polynomial multicommodity flow problem with difficult dual separation is of interest since, to our knowledge, no example of this kind has been known. In this article, we also examine a second special case of RFR, this time assuming two failing links instead of one, which turns out to be NP-hard. This implies that problem RFR is NP-hard in general (more precisely, for two or more failure states). This new result is the second contribution of the article. Finally, we discuss the complexity of FR in the light of our new findings, emphasizing the differences between RFR and FR. (c) 2013 Wiley Periodicals, Inc.", "paper_title": "Complexity of a classical flow restoration problem", "paper_id": "WOS:000322920500007"}