{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "decision_tree"}, {"score": 0.049623091759094504, "phrase": "requirements_maturation_types"}, {"score": 0.03859683110806724, "phrase": "requirements_maturation"}, {"score": 0.004431673309295777, "phrase": "scheduled_requirements_elicitation_process"}, {"score": 0.004306205029641728, "phrase": "problematic_situation"}, {"score": 0.004001402461081236, "phrase": "observation_targets"}, {"score": 0.0036243109044803924, "phrase": "physical_and_logical_ots"}, {"score": 0.0035555237584957455, "phrase": "logical_viewpoint"}, {"score": 0.0034109154088832376, "phrase": "physical_ots"}, {"score": 0.0032826392745833872, "phrase": "functional_and_non-functional_requirements"}, {"score": 0.003169281681417552, "phrase": "developers'_technical_changes"}, {"score": 0.0030991854367616737, "phrase": "requirements_maturation_period"}, {"score": 0.002954140458190344, "phrase": "ots'_requirements"}, {"score": 0.0028795712616923462, "phrase": "actual_past_projects"}, {"score": 0.0026499429068956686, "phrase": "actual_cases"}, {"score": 0.0026079240853929555, "phrase": "essential_factors"}, {"score": 0.0025178072071268534, "phrase": "project_managers"}, {"score": 0.002485816629771474, "phrase": "weka"}, {"score": 0.002346786090713685, "phrase": "prince_model"}, {"score": 0.0023095631438900728, "phrase": "logical_ots"}, {"score": 0.00221551716210208, "phrase": "maturation_type"}, {"score": 0.002125292598116514, "phrase": "real_projects"}], "paper_keywords": ["requirements elicitation", " requirements process", " requirements changes", " requirements maturation", " project management"], "paper_abstract": "Requirements are elicited step by step during the requirements engineering (RE) process. However, some types of requirements are elicited completely after the scheduled requirements elicitation process. is finished. Such a situation is regarded as problematic situation. In our study, the difficulties of eliciting various kinds of requirements is observed by components. We refer to the components as observation targets (OTs) and introduce the word \"Requirements maturation.\" It means when and how requirements are elicited completely in the project. The requirements maturation is discussed on physical and logical OTs. OTs Viewed from a logical viewpoint are called logical OTs, e.g. quality requirements. The requirements of physical OTs, e.g., modules, components, subsystems, etc., includes functional and non-functional requirements. They are influenced by their requesters' environmental changes, as well as developers' technical changes. In order to infer the requirements maturation period of each OT, we need to know how much these factors influence the OTs' requirements maturation. According to the observation of actual past projects, we defined the PRINCE (Pre Requirements Intelligence Net Consideration and Evaluation) model. It aims to guide developers in their observation of the requirements maturation of OTs. We quantitatively analyzed the actual cases with their requirements elicitation process and extracted essential factors that influence the requirements maturation. The results of interviews of project managers are analyzed by WEKA, a data mining system, from which the decision tree was derived. This paper introduces the PRINCE model and the category of logical OTs to be observed. The decision tree that helps developers infer the maturation type of an OT is also described. We evaluate the tree through real projects and discuss its ability to infer the requirements maturation types.", "paper_title": "Toward the Decision Tree for Inferring Requirements Maturation Types", "paper_id": "WOS:000302834400012"}