{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "hydraulic"}, {"score": 0.0047689174754929195, "phrase": "polyester-based_micro_adaptive_mirror"}, {"score": 0.004352876088312741, "phrase": "adaptive_optics"}, {"score": 0.004208881856146758, "phrase": "reflective_polyester_sheet"}, {"score": 0.0038415095105632157, "phrase": "electrical_circuits"}, {"score": 0.0038047474331318974, "phrase": "labview_interfaces"}, {"score": 0.0033737457695128233, "phrase": "electromagnetic_plunge_actuator"}, {"score": 0.0030642636185693054, "phrase": "micro-mirror_ranges"}, {"score": 0.0027965187255008647, "phrase": "mems_mirrors"}, {"score": 0.0026395715432958665, "phrase": "maximum_observable_frequency"}, {"score": 0.0025767987652419054, "phrase": "micro-mirror_center_depth_movement"}, {"score": 0.00247944491239733, "phrase": "focal_length_increment"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["micro devices", " electro-mechanical systems", " hydraulic control", " polyester reflective film", " micro-mirror", " adaptive optics", " piezoelectric", " electromagnetic actuation and image focusing"], "paper_abstract": "Currently micro-electromechanical systems (MEMS) technology is creating micro-mirrors for applications such as scanning and adaptive optics. A 0.5 mu m thin, reflective polyester sheet is used to create a 950 mu m diameter flexible mirror that is capable of changing its concavity. A system that consists of electrical circuits and LabVIEW interfaces were used to control the mirror. This paper presents a micro-mirror that is fabricated from a 0.5 pm thin, reflective polyester sheet clamped with aluminum disks. An electromagnetic plunge actuator controls the pressure beneath the mirror to change the curvature of the mirror. The focal point of the micro-mirror ranges from approximately infinity to 3.5 turn. This range is much wider than the ranges that are typical of MEMS mirrors. The curvature of the micro-mirror can be altered at a maximum observable frequency of about 15 Hz. The micro-mirror center depth movement is at increments of approximately 2 mu m and the focal length increment of change is approximately 5 mm. The mirror is capable of dynamically focusing on objects at a distance of 6 cm to longer than 7 m away from the mirror. (c) 2007 Elsevier Ltd. All rights reserved.", "paper_title": "Hydraulic controlled polyester-based micro adaptive mirror with adjustable focal length", "paper_id": "WOS:000253892700001"}