{"auto_keywords": [{"score": 0.04306145662998196, "phrase": "current_sources"}, {"score": 0.03918347337434733, "phrase": "divergence_preservation"}, {"score": 0.00481495049065317, "phrase": "adi_algorithms"}, {"score": 0.004633888966463624, "phrase": "direct_implicit"}, {"score": 0.004575053987970206, "phrase": "important_new_capability"}, {"score": 0.004516962628112147, "phrase": "domain_plasma_simulations"}, {"score": 0.004402973626416765, "phrase": "numerical_stability_limits"}, {"score": 0.004347057700479576, "phrase": "time_step"}, {"score": 0.0034828730516958807, "phrase": "accurate_and_robust_empic_simulation"}, {"score": 0.003394891095032025, "phrase": "complete_study"}, {"score": 0.0033517342967390065, "phrase": "adi_methods"}, {"score": 0.0028259493298659288, "phrase": "charged_particles"}, {"score": 0.002801935384649699, "phrase": "computational_verification"}, {"score": 0.0022828795331819025, "phrase": "similarity_transformation"}, {"score": 0.002159623311924437, "phrase": "finite-difference_energy_quantity"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["ADI (alternating direction implicit)", " PIC (particle-in-cell)", " FDTD (finite-difference time domain)", " Electromagnetic", " Simulation", " Exact charge conservation", " Self-consistent", " Divergence", " Curl", " VORPAL"], "paper_abstract": "The recent advances in alternating direct implicit (ADI) methods promise important new capability for time domain plasma simulations, namely the elimination of numerical stability limits on the time step. But the utility of these methods in simulations with charge and current sources, such as in electromagnetic particle-in-cell (EMPIC) computations, has been uncertain, as the methods introduced so far do not have the property of divergence preservation. This property is related to charge conservation and self-consistency, and is critical for accurate and robust EMPIC simulation. This paper contains a complete study of these ADI methods in the presence of charge and current sources. It is shown that there are four significantly distinct cases, with four more related by duality. Of those, only one preserves divergence and, thus, is guaranteed to be stable in the presence of moving charged particles. Computational verification of this property is accomplished by implementation in existing 3D-EMPIC simulation software. of the other three cases, two are verified unstable, as expected, and one remains stable, despite the lack of divergence preservation. This other stable algorithm is shown to be related to the divergence preserving case by a similarity transformation, effectively providing the complement of the divergence preserving field in the finite-difference energy quantity. (C) 2009 Elsevier Inc. All rights reserved.", "paper_title": "Divergence preservation in the ADI algorithms for electromagnetics", "paper_id": "WOS:000269582300010"}