{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "p-type_dbr"}, {"score": 0.040940350360074255, "phrase": "graded_region"}, {"score": 0.008828517536185986, "phrase": "uniformity_doping_concentration"}, {"score": 0.008070129440774041, "phrase": "dbr"}, {"score": 0.004616859702338596, "phrase": "electrical_characteristics"}, {"score": 0.004552648949390462, "phrase": "optical_reflection"}, {"score": 0.004274527415193801, "phrase": "energy_band_structure"}, {"score": 0.003768028741967194, "phrase": "comparative_study"}, {"score": 0.0033919477901198716, "phrase": "high_and_low_refractive_index_material"}, {"score": 0.003321346328671863, "phrase": "dbr."}, {"score": 0.0025087506382067536, "phrase": "n-type_dbr"}, {"score": 0.0021649437083408425, "phrase": "i-v_curve"}, {"score": 0.0021049977753042253, "phrase": "series_resistance"}], "paper_keywords": ["VCSEL", " DBR", " component graded", " series resistance", " reflectivity"], "paper_abstract": "According to the theory of DBR, with the P-type DBR as an example, the electrical characteristics and optical reflection of the DBR are analyzed by studying the energy band structure with various graded region widths and doping densities. The width and doping density of graded region are decided through a comparative study. The P-type DBR of 980 nm VCSELs is designed with Al(0.9)Ga(0.1)As and Al(0.1)Ga(0.9)As selected as the high and low refractive index material for the DBR. The 980 nm bottom VCSELs, which consists of 30 pairs P-type DBR and 28 pairs N-type DBR, are then fabricated. In P-type DBR, the width of graded region is 0.02 mu m and the uniformity doping concentration is 2.5x10(18)cm(-3). Its reflectivity is 99.9%. In N-type DBR, the width of graded region is also 0.02 mu m and the uniformity doping concentration is 2x10(18)cm(-3). Its reflectivity is 99.3%. The I-V curve shows that the series resistance of the device is about 0.05 Omega. According to the theory of DBR, with the P-type DBR as an example, the electrical characteristics and optical reflection of the DBR are analyzed by studying the energy band structure with various graded region widths and doping densities. The width and doping density of graded region are decided through a comparative study. The P-type DBR of 980 nm VCSELs is designed, with Al(0.9)Ga(0.1)As and Al(0.1)Ga(0.9)As selected as the high and low refractive index material for the DBR. The 980 nm bottom VCSELs, which consist of 30 pairs P-type DBR and 28 pairs N-type DBR, are then fabricated. In P-type DBR, the width of graded region is 0.02 mu m and the uniformity doping concentration is 2.5x1018cm(-3). Its reflectivity is 99.9%. In N-type DBR, the width of graded region is also 0.02 mu m and the uniformity doping concentration is 2x1018cm(-3). Its reflectivity is 99.3%. The I-V curve shows that the series resistance of the device is about 0.05 Omega.", "paper_title": "Design and optimization of DBR in 980 nm bottom-emitting VCSEL", "paper_id": "WOS:000268192800019"}