{"auto_keywords": [{"score": 0.047192298071640104, "phrase": "rational_secret_sharing"}, {"score": 0.011555486372251587, "phrase": "actual_utility_values"}, {"score": 0.00481495049065317, "phrase": "cryptographic_computations"}, {"score": 0.0047761092701293474, "phrase": "participating_parties"}, {"score": 0.004712065638657606, "phrase": "game-theoretic_sense"}, {"score": 0.0041728113383304125, "phrase": "reconstruction_phase"}, {"score": 0.003900274063541383, "phrase": "halpern"}, {"score": 0.0038792351200534025, "phrase": "teague"}, {"score": 0.0037656130751127182, "phrase": "beautiful_ideas"}, {"score": 0.003289534854212415, "phrase": "public_knowledge"}, {"score": 0.003016836238226147, "phrase": "positive_side"}, {"score": 0.0029602552900111407, "phrase": "multiparty_case"}, {"score": 0.00290473242917264, "phrase": "single_mechanism"}, {"score": 0.0028195727965553367, "phrase": "expected_number"}, {"score": 0.0026423134393535265, "phrase": "known_protocols"}, {"score": 0.002592738422127661, "phrase": "simultaneous_channels"}, {"score": 0.0024694784565650945, "phrase": "incorrect_value"}, {"score": 0.0024035447266815913, "phrase": "higher_utility"}, {"score": 0.0021922308351126746, "phrase": "non-simultaneous_channels_model"}, {"score": 0.002168622015687779, "phrase": "actual_values"}, {"score": 0.0021510820434023207, "phrase": "parties'_utilities"}], "paper_keywords": ["Rational secret sharing", " Game theory and cryptography"], "paper_abstract": "The problem of carrying out cryptographic computations when the participating parties are rational in a game-theoretic sense has recently gained much attention. One problem that has been studied considerably is that of rational secret sharing. In this setting, the aim is to construct a mechanism (protocol) so that parties behaving rationally have incentive to cooperate and provide their shares in the reconstruction phase, even if each party prefers to be the only one to learn the secret. Although this question was only recently asked by Halpern and Teague (STOC 2004), a number of works with beautiful ideas have been presented to solve this problem. However, they all have the property that the protocols constructed need to know the actual utility values of the parties (or at least a bound on them). This assumption is very problematic because the utilities of parties are not public knowledge. We ask whether this dependence on the actual utility values is really necessary and prove that in the case of two parties, rational secret sharing cannot be achieved without it. On the positive side, we show that in the multiparty case it is possible to construct a single mechanism that works for all (polynomial) utility functions. Our protocol has an expected number of rounds that is constant, and is optimally resilient to coalitions. In addition to the above, we observe that the known protocols for rational secret sharing that do not assume simultaneous channels all suffer from the problem that one of the parties can cause the others to output an incorrect value. (This problem arises when a party gains higher utility by having another output an incorrect value than by learning the secret itself; we argue that such a scenario needs to be considered.) We show that this problem is inherent in the non-simultaneous channels model, unless the actual values of the parties' utilities from this attack are known, in which case it is possible to prevent this from happening.", "paper_title": "Utility Dependence in Correct and Fair Rational Secret Sharing", "paper_id": "WOS:000286005400006"}