{"auto_keywords": [{"score": 0.0496586067150974, "phrase": "security_features"}, {"score": 0.00481495049065317, "phrase": "distributed_systems"}, {"score": 0.0042429960722503305, "phrase": "security_engineering"}, {"score": 0.004071790119305426, "phrase": "development_life-cycle"}, {"score": 0.00396538027397194, "phrase": "security_methodologies"}, {"score": 0.0037941508352767462, "phrase": "recent_survey"}, {"score": 0.003727739723753632, "phrase": "industry-adoption_viewpoint"}, {"score": 0.003566735116775593, "phrase": "security_patterns"}, {"score": 0.0034227226677308337, "phrase": "highly_specific_system_applicability"}, {"score": 0.0031891990067601295, "phrase": "mixed_specific_applicability"}, {"score": 0.0031241294019967226, "phrase": "peer-to-peer_distributed_systems"}, {"score": 0.0028938199455860836, "phrase": "previously_devised_approach"}, {"score": 0.0028768215428376185, "phrase": "engineering_security_methodologies"}, {"score": 0.002834759855989069, "phrase": "general_distributed_systems"}, {"score": 0.0027282473656358784, "phrase": "peer-to-peer_systems"}, {"score": 0.002519612567209806, "phrase": "security_solution_frames"}, {"score": 0.002354489734007631, "phrase": "presented_methodology"}, {"score": 0.002320047233050843, "phrase": "realistic_example"}, {"score": 0.0023132192903270233, "phrase": "-_the_development"}, {"score": 0.0022928555178098947, "phrase": "distributed_system"}, {"score": 0.002279379132030189, "phrase": "file_sharing"}, {"score": 0.002265981774560307, "phrase": "collaborative_editing"}, {"score": 0.002174374647551399, "phrase": "early_life-cycle_phases"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Secure software engineering", " Security methodologies", " Distributed systems security", " Security patterns", " Security solution frames"], "paper_abstract": "Incorporating security features is one of the most important and challenging tasks in designing distributed systems. Over the last decade, researchers and practitioners have come to recognize that the incorporation of security features should proceed by means of a structured, systematic approach, combining principles from both software and security engineering. Such systematic approaches, particularly those implying some sort of process aligned with the development life-cycle, are termed security methodologies. There area number of security methodologies in the literature, of which the most flexible and, according to a recent survey, most satisfactory from an industry-adoption viewpoint are methodologies that encapsulate their security solutions in some fashion, especially via the use of security patterns. While the literature does present several mature pattern-driven security methodologies with either a general or a highly specific system applicability, there are currently no (pattern-driven) security methodologies specifically designed for general distributed systems. Going further, there are also currently no methodologies with mixed specific applicability, e.g. for both general and peer-to-peer distributed systems. In this paper we aim to fill these gaps by presenting a comprehensive pattern-driven security methodology - arrived at by applying a previously devised approach to engineering security methodologies - specifically designed for general distributed systems, which is also capable of taking into account the specifics of peer-to-peer systems as needed. Our methodology takes the principle of encapsulation several steps further, by employing patterns not only for the incorporation of security features (via security solution frames), but also for the modeling of threats, and even as part of its process. We illustrate and evaluate the presented methodology in detail via a realistic example - the development of a distributed system for file sharing and collaborative editing. In both the presentation of the methodology and example our focus is on the early life-cycle phases (analysis and design). (C) 2015 Elsevier B.V. All rights reserved.", "paper_title": "ASE: A comprehensive pattern-driven security methodology for distributed systems", "paper_id": "WOS:000356207900012"}