{"auto_keywords": [{"score": 0.035581377548100174, "phrase": "glide_scoring"}, {"score": 0.012108390972094674, "phrase": "lie_methods"}, {"score": 0.004087910779160781, "phrase": "continuum_lie"}, {"score": 0.004039221742250308, "phrase": "glide_score_methods"}, {"score": 0.003975200317233532, "phrase": "trypsin_challenge"}, {"score": 0.003789137457228946, "phrase": "experimental_results"}, {"score": 0.0035687137873965684, "phrase": "mean_absolute_deviations"}, {"score": 0.0034841647157189985, "phrase": "null_hypothesis"}, {"score": 0.0033343197163482694, "phrase": "kendall"}, {"score": 0.0028758391869611374, "phrase": "experimental_affinity_difference"}, {"score": 0.0026022112631368223, "phrase": "trypsin_ligands"}, {"score": 0.0025405019456703325, "phrase": "binding_assay"}, {"score": 0.0024604876113911173, "phrase": "inactive_ligands"}, {"score": 0.0024311346712789553, "phrase": "active_ones"}, {"score": 0.0023925401023682717, "phrase": "random_guess"}, {"score": 0.0022712795176156536, "phrase": "receiver-operating-characteristic_curve"}, {"score": 0.0021049977753042253, "phrase": "first_host"}], "paper_keywords": ["Binding affinity", " MM/GBSA", " MM/PBSA", " Linear interaction energy", " Docking", " Glide"], "paper_abstract": "We have estimated affinities for the binding of 34 ligands to trypsin and nine guest molecules to three different hosts in the SAMPL3 blind challenge, using the MM/PBSA, MM/GBSA, LIE, continuum LIE, and Glide score methods. For the trypsin challenge, none of the methods were able to accurately predict the experimental results. For the MM/GB(PB)SA and LIE methods, the rankings were essentially random and the mean absolute deviations were much worse than a null hypothesis giving the same affinity to all ligand. Glide scoring gave a Kendall's tau index better than random, but the ranking is still only mediocre, tau = 0.2. However, the range of affinities is small and most of the pairs of ligands have an experimental affinity difference that is not statistically significant. Removing those pairs improves the ranking metric to 0.4-1.0 for all methods except CLIE. Half of the trypsin ligands were non-binders according to the binding assay. The LIE methods could not separate the inactive ligands from the active ones better than a random guess, whereas MM/GBSA and MM/PBSA were slightly better than random (area under the receiver-operating-characteristic curve, AUC = 0.65-0.68), and Glide scoring was even better (AUC = 0.79). For the first host, MM/GBSA and MM/PBSA reproduce the experimental ranking fairly good, with tau = 0.6 and 0.5, respectively, whereas the Glide scoring was considerably worse, with a tau = 0.4, highlighting that the success of the methods is system-dependent.", "paper_title": "Binding affinities in the SAMPL3 trypsin and host-guest blind tests estimated with the MM/PBSA and LIE methods", "paper_id": "WOS:000305684900007"}