{"auto_keywords": [{"score": 0.03602492811107984, "phrase": "redistributor_tracing"}, {"score": 0.00481495049065317, "phrase": "-aware_peer-to-peer_content_distribution"}, {"score": 0.004462105963334103, "phrase": "content-based_electronic_commerce"}, {"score": 0.004342430078306461, "phrase": "exactly_the_same_copy"}, {"score": 0.004157561334726201, "phrase": "unlawful_redistributors"}, {"score": 0.004024072318264299, "phrase": "unicast_distribution"}, {"score": 0.0036288825833675127, "phrase": "different_serial_number"}, {"score": 0.002887210021573995, "phrase": "unicast_connections"}, {"score": 0.0025611773887867255, "phrase": "proper_fingerprinting_mechanism"}, {"score": 0.00230932021677234, "phrase": "novel_fingerprinting_mechanism"}, {"score": 0.002128067018576581, "phrase": "collusion_resistance"}, {"score": 0.0021049977753042253, "phrase": "buyer_frameproofness"}], "paper_keywords": ["Peer-to-peer content distribution", " Anonymous fingerprinting", " Collusion-resistant fingerprinting", " Buyer frameproofness", " Recombination fingerprinting"], "paper_abstract": "Multicast distribution of content is not suited to content-based electronic commerce because all buyers obtain exactly the same copy of the content, in such a way that unlawful redistributors cannot be traced. Unicast distribution has the shortcoming of requiring one connection with each buyer, but it allows the merchant to embed a different serial number in the copy obtained by each buyer, which enables redistributor tracing. Peer-to-peer (P2P) distribution is a third option which may combine some of the advantages of multicast and unicast: on the one hand, the merchant only needs unicast connections with a few seed buyers, who take over the task of further spreading the content; on the other hand, if a proper fingerprinting mechanism is used, unlawful redistributors of the P2P-distributed content can still be traced. In this paper, we propose a novel fingerprinting mechanism for P2P content distribution which allows redistributor tracing, while preserving the privacy of most honest buyers and offering collusion resistance and buyer frameproofness.", "paper_title": "Privacy-aware peer-to-peer content distribution using automatically recombined fingerprints", "paper_id": "WOS:000331642600002"}