{"auto_keywords": [{"score": 0.049226991195811136, "phrase": "pharmacological_substances"}, {"score": 0.015364719553104375, "phrase": "drug-drug_interactions"}, {"score": 0.010435409021063343, "phrase": "annotation_guidelines"}, {"score": 0.009350636197241323, "phrase": "ddi_corpus"}, {"score": 0.00481496193272062, "phrase": "ddi"}, {"score": 0.004574085781766281, "phrase": "critical_issue"}, {"score": 0.004527371799277529, "phrase": "overwhelming_amount"}, {"score": 0.004401342842183475, "phrase": "interesting_way"}, {"score": 0.004322967486451877, "phrase": "healthcare_professionals"}, {"score": 0.004289804897675199, "phrase": "biomedical_literature"}, {"score": 0.0042459818200777846, "phrase": "nlp_techniques"}, {"score": 0.004159668541479049, "phrase": "annotated_corpora"}, {"score": 0.004085579055228594, "phrase": "biological_entities"}, {"score": 0.003602486089862719, "phrase": "manually_annotated_corpus"}, {"score": 0.0035382855372646164, "phrase": "drugbank_database"}, {"score": 0.003493127223058947, "phrase": "fined-grained_corpus"}, {"score": 0.003250651390184808, "phrase": "annotation_process"}, {"score": 0.003103709446145337, "phrase": "inter-annotator_agreement"}, {"score": 0.002895620643297197, "phrase": "medline_database"}, {"score": 0.0027860884734700595, "phrase": "gold_standard"}, {"score": 0.0027505037762786087, "phrase": "information_extraction_techniques"}, {"score": 0.0026600905156986317, "phrase": "biomedical_texts"}, {"score": 0.0026193670580850125, "phrase": "wide_attention"}, {"score": 0.00250732953434891, "phrase": "pharmacological_names"}, {"score": 0.002488060363760654, "phrase": "best_system"}, {"score": 0.0023755083111584815, "phrase": "best_result"}, {"score": 0.0022680361841334105, "phrase": "training_and_testing_nlp_techniques"}, {"score": 0.002233301598303904, "phrase": "pharmacovigilance"}, {"score": 0.0021654157292186967, "phrase": "academic_research"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Biomedical corpora", " Drug interaction", " Information extraction"], "paper_abstract": "The management of drug-drug interactions (DDIs) is a critical issue resulting from the overwhelming amount of information available on them. Natural Language Processing (NLP) techniques can provide an interesting way to reduce the time spent by healthcare professionals on reviewing biomedical literature. However, NLP techniques rely mostly on the availability of the annotated corpora. While there are several annotated corpora with biological entities and their relationships, there is a lack of corpora annotated with pharmacological substances and DDIs. Moreover, other works in this field have focused in pharmacokinetic (PK) DDIs only, but not in pharmacodynamic (PD) DDIs. To address this problem, we have created a manually annotated corpus consisting of 792 texts selected from the DrugBank database and other 233 Medline abstracts. This fined-grained corpus has been annotated with a total of 18,502 pharmacological substances and 5028 DDIs, including both PK as well as PD interactions. The quality and consistency of the annotation process has been ensured through the creation of annotation guidelines and has been evaluated by the measurement of the inter-annotator agreement between two annotators. The agreement was almost perfect (Kappa up to 0.96 and generally over 0.80), except for the DDIs in the MedLine database (0.55-0.72). The DDI corpus has been used in the SemEvaI 2013 DDIExtraction challenge as a gold standard for the evaluation of information extraction techniques applied to the recognition of pharmacological substances and the detection of DDIs from biomedical texts. DDIExtraction 2013 has attracted wide attention with a total of 14 teams from 7 different countries. For the task of recognition and classification of pharmacological names, the best system achieved an F1 of 71.5%, while, for the detection and classification of DDIs, the best result was F1 of 65.1%. These results show that the corpus has enough quality to be used for training and testing NLP techniques applied to the field of Pharmacovigilance. The DDI corpus and the annotation guidelines are free for use for academic research and are available at http://labda.inf.uc3m.es/ddicorpus. (C) 2013 Elsevier Inc. All rights reserved.", "paper_title": "The DDI corpus: An annotated corpus with pharmacological substances and drug-drug interactions", "paper_id": "WOS:000324848600017"}