{"auto_keywords": [{"score": 0.029744559549788507, "phrase": "metroweb"}, {"score": 0.01526751765740687, "phrase": "professional_web_designers"}, {"score": 0.00481495049065317, "phrase": "knowledge-based_system"}, {"score": 0.004774530554776604, "phrase": "designers'_cognitive_activities"}, {"score": 0.004463096299091981, "phrase": "user_interface_designers"}, {"score": 0.004425616928975799, "phrase": "usability_knowledge"}, {"score": 0.004084829853870028, "phrase": "design_process"}, {"score": 0.003932654396285872, "phrase": "user_interface"}, {"score": 0.0036759314172445934, "phrase": "resulting_user_interface"}, {"score": 0.003584025547693836, "phrase": "virtually_no_systems"}, {"score": 0.0032800186243040663, "phrase": "experimental_study"}, {"score": 0.003117986133774198, "phrase": "knowledge-based_system-metroweb"}, {"score": 0.002889778121878728, "phrase": "professional_web_designers'_cognitive_activity"}, {"score": 0.002723862897844177, "phrase": "user-centred_design"}, {"score": 0.0026445028886931837, "phrase": "web_designers"}, {"score": 0.0023694065215394593, "phrase": "user-centred_activity"}, {"score": 0.002195866991284673, "phrase": "future_possible_ways"}, {"score": 0.0021049977753042253, "phrase": "user-centred_approach"}], "paper_keywords": ["web design", " knowledge-based system", " constraints", " usability"], "paper_abstract": "Over the last few decades, several usability knowledge-based systems have been developed to provide user interface designers with usability knowledge (e.g. heuristics, usability guidelines, standards). Such systems are intended to assist designers during the design process, and to improve the usability of the user interface being designed. However, the assumption that such systems actually improve the usability of the resulting user interface remains to be demonstrated: virtually no systems have been empirically tested by designers who create products. In order to confirm this assumption, we conducted an experimental study in which professional web designers had to create webpages, either using a knowledge-based system-MetroWeb-or without it. This study was intended to determine the influence of MetroWeb on the professional web designers' cognitive activity, and to find out whether MetroWeb actually assists them to develop a user-centred design. The results show that the web designers did not very often use MetroWeb while designing webpages; however, rather surprisingly, the designers who did use MetroWeb more often exhibited a user-centred activity than those working without MetroWeb. We conclude this paper by discussing these findings, and suggesting future possible ways of research intended to assist designers to adopt a user-centred approach to their activity.", "paper_title": "The influence of a knowledge-based system on designers' cognitive activities: a study involving professional web designers", "paper_id": "WOS:000262637900005"}