{"auto_keywords": [{"score": 0.048231156244864744, "phrase": "two-dimensional_relationships"}, {"score": 0.041469740173514034, "phrase": "two-dimensional_parallel_coordinates"}, {"score": 0.018701117466111136, "phrase": "three-dimensional_parallel_coordinates"}, {"score": 0.010612387000973441, "phrase": "three-dimensional_display"}, {"score": 0.004415675459182871, "phrase": "well-known_technique"}, {"score": 0.00409748471133883, "phrase": "three-dimensional_parallel"}, {"score": 0.003802135020791801, "phrase": "parallel_planes"}, {"score": 0.003757480190200645, "phrase": "parallel_axes"}, {"score": 0.003626626504149897, "phrase": "information_visualization_community"}, {"score": 0.003472845095323694, "phrase": "formal_evaluation"}, {"score": 0.0034185505275141077, "phrase": "different_tasks"}, {"score": 0.003247868216333148, "phrase": "first_step"}, {"score": 0.002943147037670826, "phrase": "standard_two-dimensional_parallel_coordinates"}, {"score": 0.002851790448644913, "phrase": "multivariate_data"}, {"score": 0.0026252106881752067, "phrase": "multi-relational_three-dimensional_parallel_coordinates"}, {"score": 0.002464709648714996, "phrase": "three-dimensional_extensions"}, {"score": 0.002407078478216306, "phrase": "response_time"}, {"score": 0.0023694065215394593, "phrase": "subjective_opinions"}, {"score": 0.0022509878391826867, "phrase": "much-needed_body"}, {"score": 0.0021896891011033105, "phrase": "three-dimensional_representations"}, {"score": 0.0021049977753042253, "phrase": "proposed_method"}], "paper_keywords": ["Information visualization", " evaluation", " usability", " parallel coordinates", " 3D parallel coordinates"], "paper_abstract": "In recent years, several different attempts have been made to extend the well-known technique of parallel coordinates using a three-dimensional display. This article presents an evaluation that investigates the performance of the three-dimensional parallel coordinates technique and compares it with standard, two-dimensional parallel coordinates for analysis of two-dimensional relationships. Three-dimensional parallel coordinates, based on parallel planes instead of parallel axes, have been used for many years within the information visualization community for a variety of applications. Despite its quite common use, no formal evaluation detailing its usefulness for different tasks has been conducted. The evaluation presented in this article is the first step towards determining the usefulness of this type of three-dimensional parallel coordinates. The study compared three-dimensional parallel coordinates, using two different axis configurations commonly seen in the literature, with standard two-dimensional parallel coordinates for identification of two-dimensional relationships between variables in multivariate data. This type of task and the relationships to be judged are known to be well supported by two-dimensional parallel coordinates and multi-relational three-dimensional parallel coordinates. The results show that for identification of two-dimensional relationships, two-dimensional parallel coordinates are superior to the three-dimensional extensions, in terms of both response time and accuracy. Subjective opinions were also in favour of two-dimensional parallel coordinates. This study adds to the much-needed body of work examining the usability of three-dimensional representations in information visualization and for what tasks and data a proposed method is or is not appropriate.", "paper_title": "On the usability of three-dimensional display in parallel coordinates: Evaluating the efficiency of identifying two-dimensional relationships", "paper_id": "WOS:000331375900003"}