{"auto_keywords": [{"score": 0.04167518006179969, "phrase": "combined_approach"}, {"score": 0.004757643419056999, "phrase": "control_proxy_functions"}, {"score": 0.004617328272121826, "phrase": "'smart'_product"}, {"score": 0.003789137457228946, "phrase": "optimal_solutions"}, {"score": 0.0035051129798529, "phrase": "natural_decomposition"}, {"score": 0.0034016119212097826, "phrase": "smaller_design_and_control_sub-problems"}, {"score": 0.0032423089921154503, "phrase": "modeling_and_solution_practicality_viewpoint"}, {"score": 0.0030353401945270755, "phrase": "modified_sequential_approach"}, {"score": 0.002981216610222911, "phrase": "control_proxy_function"}, {"score": 0.00255068452076921, "phrase": "gramrnian"}, {"score": 0.0023033100935570755, "phrase": "positioning_gantry_example"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Co-design", " Design optimization", " Controller design", " Active suspension", " Control proxy function"], "paper_abstract": "Optimization of a 'smart' product requires optimizing the design of both the physical system, or artifact, and its controller. If the artifact and control optimization are coupled, then a combined approach is typically used in order to produce optimal solutions. The combined approach presents certain disadvantages, however. This combined approach obviates a natural decomposition of the problem into smaller design and control sub-problems that can be a disadvantage from a modeling and solution practicality viewpoint. In this paper, it is shown that a modified sequential approach utilizing a Control Proxy Function (CPF) can be used to produce optimal, or near-optimal, solutions while allowing this decomposition. Two physical bases for CPFs are presented, natural frequency and the controllability Gramrnian matrix, and their range of applicability is discussed. These concepts are demonstrated, for a positioning gantry example and on an active/passive automotive suspension, to be quite effective. (C) 2013 Elsevier Ltd. All rights reserved.", "paper_title": "Sequential co-design of an artifact and its controller via control proxy functions", "paper_id": "WOS:000320427900002"}