{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "global_virtual_teams"}, {"score": 0.03919769031169631, "phrase": "virtual_teams"}, {"score": 0.004756805752518494, "phrase": "social_network_perspective"}, {"score": 0.004386637056030611, "phrase": "information_systems"}, {"score": 0.004263972370406983, "phrase": "precisely_how_communication_and_trust_influence"}, {"score": 0.00386876598761639, "phrase": "theoretical_linkages"}, {"score": 0.003760527969356061, "phrase": "member_performance"}, {"score": 0.0029126002350975634, "phrase": "social_network_approach"}, {"score": 0.0028425481299483254, "phrase": "attribute-based_approaches"}, {"score": 0.0027741761880779535, "phrase": "prior_research"}, {"score": 0.002707444334463544, "phrase": "\"mediating\"_model"}, {"score": 0.0024963543716522087, "phrase": "existing_body"}, {"score": 0.00241658945942583, "phrase": "conflicting_views"}, {"score": 0.0023680327896318915, "phrase": "key_constructs"}, {"score": 0.0022371907579775796, "phrase": "social_network_analysis_approach"}, {"score": 0.0021307975800397816, "phrase": "network_approaches"}, {"score": 0.0021049977753042253, "phrase": "new_organizational_forms"}], "paper_keywords": ["communication", " distributed teams", " global virtual teams", " hybrid teams", " individual performance", " mediation", " networked individualism", " social network analysis", " trust"], "paper_abstract": "The importance of communication and trust in the context of global virtual teams has been noted and reiterated in the information systems (IS) literature. Yet precisely how communication and trust influence certain outcomes within virtual teams remains unresolved. In this study, we seek to contribute some clarity to the understanding of the theoretical linkages among trust, communication, and member performance in virtual teams. To this end, we identify and test three proposed models (additive, interaction, and mediation) describing the role of trust in its relationship with communication to explain performance. In testing the relationships, we note that the concepts of communication and trust are inherently relational and not properties of individuals. Thus, we argue that a social network approach is potentially more appropriate than attribute-based approaches that have been utilized in prior research. Our results indicate that the \"mediating\" model best explains how communication and trust work together to influence performance. Overall, the study contributes to the existing body of knowledge on virtual teams by empirically reconciling conflicting views regarding the interrelationships between key constructs in the literature. Further, the study, through its adoption of the social network analysis approach, provides awareness within the IS research community of the strengths of applying network approaches in examining new organizational forms.", "paper_title": "The Role of Communication and Trust in Global Virtual Teams: A Social Network Perspective", "paper_id": "WOS:000294319600010"}