{"auto_keywords": [{"score": 0.011754257150268017, "phrase": "low_systemwide_overhead"}, {"score": 0.009084561557670059, "phrase": "system_size"}, {"score": 0.00481495049065317, "phrase": "quality_guarantees"}, {"score": 0.004198839649063847, "phrase": "partial_states"}, {"score": 0.003978866233891427, "phrase": "fast_communication"}, {"score": 0.0038261310307416475, "phrase": "communication_latency"}, {"score": 0.0034187896011435245, "phrase": "functional_correctness"}, {"score": 0.002498873893632726, "phrase": "physical_network"}, {"score": 0.0024624103660827695, "phrase": "power-law_latency_expansion_property"}, {"score": 0.0021784745589727246, "phrase": "rigorous_performance_analysis"}, {"score": 0.0021049977753042253, "phrase": "extensive_simulations"}], "paper_keywords": ["peer-to-peer systems", " tree-based networks", " multicast", " performance analysis"], "paper_abstract": "Peer-to-peer (P2P) networks often demand scalability, low communication latency among nodes, and low systemwide overhead. For scalability, a node maintains partial states of a P2P network and connects to a few nodes. For fast communication, a P2P network intends to reduce the communication latency between any two nodes as much as possible. With regard to a low systemwide overhead, a P2P network minimizes its traffic in maintaining its performance efficiency and functional correctness. In this paper, we present a novel tree-based P2P network with low communication delay and low systemwide overhead. The merits of our tree-based network include 1) a tree-shaped P2P network, which guarantees that the degree of a node is constant in probability, regardless of the system size (the network diameter in our tree-based network increases logarithmically with an increase in the system size, and in particular, given a physical network with a power-law latency expansion property, we show that the diameter of our tree network is constant), and 2) provable performance guarantees. We evaluate our proposal by a rigorous performance analysis, and we validate this by extensive simulations.", "paper_title": "A tree-based peer-to-peer network with quality guarantees", "paper_id": "WOS:000257018400008"}