{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "cultural_change"}, {"score": 0.026820135128321876, "phrase": "tqm"}, {"score": 0.013498703327271239, "phrase": "tqm_practices"}, {"score": 0.00818629096981352, "phrase": "incremental_and_radical_innovation"}, {"score": 0.006558906238566658, "phrase": "radical_innovation"}, {"score": 0.004600389726895716, "phrase": "total_quality_management"}, {"score": 0.004445739135694758, "phrase": "diverse_cultural_change"}, {"score": 0.004333157713284926, "phrase": "ever-increasing_competitive_pressure"}, {"score": 0.004187452827599427, "phrase": "previous_research"}, {"score": 0.003789763907758991, "phrase": "asian_companies"}, {"score": 0.0035390378585554547, "phrase": "significant_and_positive_relationship"}, {"score": 0.0034004869983267085, "phrase": "mediating_factor"}, {"score": 0.003371508176308189, "phrase": "model's_goodness"}, {"score": 0.002898291237210567, "phrase": "longitudinal_study"}, {"score": 0.002881793492919646, "phrase": "practical_implications"}, {"score": 0.002776817142154944, "phrase": "paradoxical_cultural_context"}, {"score": 0.002570817338292482, "phrase": "social_impact"}, {"score": 0.0024984517279573906, "phrase": "current_environment"}, {"score": 0.0024842242921857705, "phrase": "economic_crisis"}, {"score": 0.002339629270626007, "phrase": "multidimensional_analysis"}, {"score": 0.0023064582783867667, "phrase": "broad_perspective"}, {"score": 0.0022479284902217006, "phrase": "original_definition"}, {"score": 0.002123113864239041, "phrase": "mediating_variable"}, {"score": 0.0021049977753042253, "phrase": "tqm-innovation_model"}], "paper_keywords": ["Total quality management", " Cultural change", " Incremental innovation", " Radical innovation", " Multidimensionality"], "paper_abstract": "Purpose - The purpose of this paper is to better understand the influence of total quality management (TQM) practices on incremental and radical innovation, examining the role of diverse cultural change as a mediator, particularly in firms where ever-increasing competitive pressure demands a combination of quality and innovation. Design/methodology/approach - From previous research on the influence of TQM practices on innovation, the paper proposes a model which is tested through a survey carried out on a sample of 72 Spanish firms that have been drastically hit by competition from Asian companies, achieving a 51.42 percent valid return rate. Findings - None of the sets of TQM practices directly affects radical innovation, while all of them have a significant and positive relationship with incremental innovation. However, when the paper introduces cultural change as a mediating factor, the model's goodness of fit improves substantially, and all the relations are significant. Research limitations/implications - The results reveal the power of cultural change to connect the diversity of the TQM practices and incremental and radical innovation. Further research is needed for a more comprehensive understanding of the role of cultural change in these relationships and to test the model in a longitudinal study. Practical implications - Managers can use the potential inherent in TQM to stimulate a paradoxical cultural context that favours innovation. This is especially relevant for enhancing radical innovation. Social implications - Given the extent to which TQM has been applied over the last 20 years, the social impact of this study is relevant, particularly in the current environment of economic crisis which calls for an increase in efficiency and innovation, adaptation and change. Originality/value - The paper introduces a multidimensional analysis of TQM and a broad perspective of innovation. The paper also develops an original definition of cultural change made up of apparently contradicting values, including exploitation and exploration, and introduces it as a mediating variable in the TQM-innovation model.", "paper_title": "TQM, innovation and the role of cultural change", "paper_id": "WOS:000324660400004"}