{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "ring_exploration"}, {"score": 0.004556901872357751, "phrase": "anonymous_unoriented_ring"}, {"score": 0.004186534737631288, "phrase": "weak_scenario"}, {"score": 0.004098725744818192, "phrase": "spatial_universe"}, {"score": 0.0039620308501590795, "phrase": "two-dimensional_plane"}, {"score": 0.003624429617337833, "phrase": "weak_capabilities"}, {"score": 0.0030071857666598193, "phrase": "initial_placements"}, {"score": 0.0026475981474045414, "phrase": "ka_parts"}, {"score": 0.002570064617803693, "phrase": "exploration_algorithm"}, {"score": 0.0024947959375982614, "phrase": "arbitrary_initial_configurations"}, {"score": 0.0023210293050850276, "phrase": "size_n."}, {"score": 0.0021049977753042253, "phrase": "infinitely_many_n."}], "paper_keywords": ["Mobile robots", " Asynchronous", " Oblivious", " Exploration", " Ring"], "paper_abstract": "We consider the problem of exploring an anonymous unoriented ring by a team of k identical, oblivious, asynchronous mobile robots that can view the environment but cannot communicate. This weak scenario is standard when the spatial universe in which the robots operate is the two-dimensional plane, but (with one exception) has not been investigated before for networks. Our results imply that, although these weak capabilities of robots render the problem considerably more difficult, ring exploration by a small team of robots is still possible. We first show that, when k and n are not co-prime, the problem is not solvable in general, e.g., if k divides n there are initial placements of the robots for which gathering is impossible. We then prove that the problem is always solvable provided that n and k are co-prime, for ka parts per thousand yen17, by giving an exploration algorithm that always terminates, starting from arbitrary initial configurations. Finally, we consider the minimum number rho(n) of robots that can explore a ring of size n. As a consequence of our positive result we show that rho(n) is O(logn). We additionally prove that Omega(logn) robots are necessary for infinitely many n.", "paper_title": "Computing Without Communicating: Ring Exploration by Asynchronous Oblivious Robots", "paper_id": "WOS:000314359200005"}