{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "markov-miml"}, {"score": 0.03666833546437711, "phrase": "class_label"}, {"score": 0.02968613115765037, "phrase": "high_rank"}, {"score": 0.02758780244069733, "phrase": "proposed_algorithm"}, {"score": 0.004759515659639985, "phrase": "markov"}, {"score": 0.00450198136261303, "phrase": "main_aim"}, {"score": 0.004361792415184563, "phrase": "efficient_and_novel_markov_chain-based_multi-instance_multi-label"}, {"score": 0.004046020290832207, "phrase": "multiple_instances"}, {"score": 0.0030791137853734152, "phrase": "similar_objects"}, {"score": 0.0027668603377225564, "phrase": "particular_class_label"}, {"score": 0.002669959049383929, "phrase": "experimental_results"}, {"score": 0.002648889316519512, "phrase": "benchmark_data"}, {"score": 0.0024960634897058394, "phrase": "miml_data"}, {"score": 0.0023990982005125763, "phrase": "classification_performance"}, {"score": 0.002370748155770563, "phrase": "markov-miml_algorithm"}, {"score": 0.0022606512324475584, "phrase": "support_vector_machine"}, {"score": 0.0021987994275190314, "phrase": "computational_time"}], "paper_keywords": ["Multi-instance multi-label data", " Label ranking", " Markov chain", " Transition probability matrix", " Stationary probability distribution"], "paper_abstract": "The main aim of this paper is to propose an efficient and novel Markov chain-based multi-instance multi-label (Markov-Miml) learning algorithm to evaluate the importance of a set of labels associated with objects of multiple instances. The algorithm computes ranking of labels to indicate the importance of a set of labels to an object. Our approach is to exploit the relationships between instances and labels of objects. The rank of a class label to an object depends on (i) the affinity metric between the bag of instances of this object and the bag of instances of the other objects, and (ii) the rank of a class label of similar objects. An object, which contains a bag of instances that are highly similar to bags of instances of the other objects with a high rank of a particular class label, receives a high rank of this class label. Experimental results on benchmark data have shown that the proposed algorithm is computationally efficient and effective in label ranking for MIML data. In the comparison, we find that the classification performance of the Markov-Miml algorithm is competitive with those of the three popular MIML algorithms based on boosting, support vector machine, and regularization, but the computational time required by the proposed algorithm is less than those by the other three algorithms.", "paper_title": "Markov-MIML: A Markov chain-based multi-instance multi-label learning algorithm", "paper_id": "WOS:000324652900004"}