{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "web_recommender_systems"}, {"score": 0.03529624542703246, "phrase": "visited_pages"}, {"score": 0.03449747819738694, "phrase": "web_resources"}, {"score": 0.0046364836476864325, "phrase": "on-line_users"}, {"score": 0.004159241394996858, "phrase": "web_access_logs"}, {"score": 0.004100712177044264, "phrase": "users'_navigational_models"}, {"score": 0.0040049806975968145, "phrase": "web_recommender_system"}, {"score": 0.003948613642680196, "phrase": "popular_approach"}, {"score": 0.0035925056609681194, "phrase": "accurate_recommendation_prediction"}, {"score": 0.003459191419478298, "phrase": "additional_available_information_channels"}, {"score": 0.0032223742018434856, "phrase": "better_model_user_navigational_behavior"}, {"score": 0.0031174595932694036, "phrase": "users'_concurrent_information"}, {"score": 0.00297346171320082, "phrase": "novel_hybrid_web_recommender_system"}, {"score": 0.002917736974519881, "phrase": "access_history"}, {"score": 0.0026922926476971453, "phrase": "web_site"}, {"score": 0.0026543514413663893, "phrase": "model_users'_concurrent_information_needs"}, {"score": 0.002391938519840648, "phrase": "web_site_recommendation"}, {"score": 0.0023139986108451967, "phrase": "additional_channel"}], "paper_keywords": [""], "paper_abstract": "Web recommender systems anticipate the information needs of on-line users and provide them with recommendations to facilitate and personalize their navigation. There are many approaches to building such systems. Among them, using web access logs to generate users' navigational models capable of building a web recommender system is a popular approach, given its non-intrusiveness. However, using only one information channel, namely the web access history, is often insufficient for accurate recommendation prediction. We therefore advocate the use of additional available information channels, such as the content of visited pages and the connectivity between web resources, to better model user navigational behavior. This helps in better modeling users' concurrent information needs. In this chapter, we investigate a novel hybrid web recommender system, which combines access history and the content, of visited pages, as well as the connectivity between web resources in a web site, to model users' concurrent information needs and generate navigational patterns. Our experiments show that the combination of the three channels used in our system significantly improves the quality of web site recommendation and, further, that each additional channel used contributes to this improvement. In addition, we discuss cases on how to reach a compromise when not all channels are available.", "paper_title": "Mission-based navigational behaviour modeling for web recommender systems", "paper_id": "WOS:000243032800003"}