{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "university_research"}, {"score": 0.004556901872357751, "phrase": "research_performance"}, {"score": 0.004501453956464956, "phrase": "multi-disciplinary_institutions"}, {"score": 0.00405646687267772, "phrase": "performance_measures"}, {"score": 0.0033139366449568565, "phrase": "appropriate_choice"}, {"score": 0.0032336801561165113, "phrase": "evaluation_context"}, {"score": 0.003116913644889395, "phrase": "particular_measure"}, {"score": 0.002690406375639144, "phrase": "entire_research_staff"}, {"score": 0.0026252106881752067, "phrase": "hard_sciences"}, {"score": 0.00259320616168125, "phrase": "italian_universities"}, {"score": 0.002183938718432764, "phrase": "evaluation_objectives"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Research evaluation", " Productivity", " Bibliometrics", " Italy"], "paper_abstract": "Assessing the research performance of multi-disciplinary institutions, where scientists belong to many fields, requires that the evaluators plan how to aggregate the performance measures of the various fields. Two methods of aggregation are possible. These are based on: (a) the performance of the individual scientists or (b) the performance of the scientific fields present in the institution. The appropriate choice depends on the evaluation context and the objectives for the particular measure. The two methods bring about differences in both the performance scores and rankings. We quantify these differences through observation of the 2008-2012 scientific production of the entire research staff employed in the hard sciences in Italian universities (over 35,000 professors). Evaluators preparing an exercise must comprehend the differences illustrated, in order to correctly select the methodologies that will achieve the evaluation objectives. (C) 2015 Elsevier Ltd. All rights reserved.", "paper_title": "Evaluating university research: Same performance indicator, different rankings", "paper_id": "WOS:000360907400009"}