{"auto_keywords": [{"score": 0.03438275554507544, "phrase": "reversed_magnetic_domains"}, {"score": 0.010409464155581137, "phrase": "room_temperature"}, {"score": 0.00878720033243064, "phrase": "reversed_domains"}, {"score": 0.00481495049065317, "phrase": "magnetized_dy-doped_nd-fe-b_permanent_magnets"}, {"score": 0.004579780586951551, "phrase": "photoemission_electron_microscopy"}, {"score": 0.004466519142879166, "phrase": "fully_magnetized_ferromagnetic_bulk_samples"}, {"score": 0.004312622975366672, "phrase": "dy-doped_nd-fe-b_permanent_magnets"}, {"score": 0.003785836059995376, "phrase": "stray_magnetic_field"}, {"score": 0.0036370297611938796, "phrase": "well-focused_peem_images"}, {"score": 0.003441891354624516, "phrase": "dy-rich_and_dy-poor_areas"}, {"score": 0.003339886795391701, "phrase": "x-ray_magnetic_circular_dichroism"}, {"score": 0.003036333273800443, "phrase": "dy-doped_sample"}, {"score": 0.002830410693265704, "phrase": "magnetization_easy_axis"}, {"score": 0.0025473475682739784, "phrase": "easy_axis"}, {"score": 0.002224510044064184, "phrase": "dy-poor_regions"}, {"score": 0.0021369416775353124, "phrase": "chemical_distribution"}, {"score": 0.0021049977753042253, "phrase": "magnetic_domain_structure"}], "paper_keywords": [""], "paper_abstract": "We have succeeded in developing a method for photoemission electron microscopy (PEEM) on fully magnetized ferromagnetic bulk samples and have applied this technique to Dy-doped Nd-Fe-B permanent magnets. Remanence magnetization of the sample was approximately 1.2 T, and its dimension was 3 x 3 x 3 mm(3). By utilizing a yoke as an absorber of the stray magnetic field from the sample, we can obtain well-focused PEEM images of magnetized samples. We have observed not only chemical distributions to visualize Dy-rich and Dy-poor areas but also magnetic domains by x-ray magnetic circular dichroism. The formation of reversed magnetic domains is strongly suppressed at room temperature by Dy-doping. As the temperature of the Dy-doped sample is raised, starting from room temperature, the reversed magnetic domains first grow along the magnetization easy axis. Next, above approximately 80 degrees C, the shapes of reversed domains start to expand in the direction perpendicular to the easy axis. Above approximately 85 degrees C, the reversed domains cover more than half of the field of view of 30 mu m. More importantly, the reversed magnetic domains tend to nucleate or extend in Dy-poor regions. We discuss the relationship between the chemical distribution and the magnetic domain structure.", "paper_title": "An XMCD-PEEM study on magnetized Dy-doped Nd-Fe-B permanent magnets", "paper_id": "WOS:000301500600007"}