{"auto_keywords": [{"score": 0.049481323529186536, "phrase": "internet-based_master-worker_computations"}, {"score": 0.04256473394973715, "phrase": "malicious_workers"}, {"score": 0.00481495049065317, "phrase": "algorithmic_mechanisms_for_reliable_master-worker_internet-based_computing"}, {"score": 0.004564544414530739, "phrase": "computational_task"}, {"score": 0.004493393608763752, "phrase": "untrusted_worker_processors"}, {"score": 0.004299999054804997, "phrase": "seti."}, {"score": 0.004180061441294476, "phrase": "altruistic_workers"}, {"score": 0.004127834058321831, "phrase": "correct_result"}, {"score": 0.004012686357543403, "phrase": "incorrect_result"}, {"score": 0.0038641177943540502, "phrase": "massive_computation_platform"}, {"score": 0.003013890317967077, "phrase": "game-theoretic_and_classical_distributed_computing_approaches"}, {"score": 0.0029482236540308952, "phrase": "reliable_internet-based_computing"}, {"score": 0.00281227375628713, "phrase": "appropriate_incentives"}, {"score": 0.0027946258636360245, "phrase": "rational_workers"}, {"score": 0.002733723435814484, "phrase": "malicious_workers'_actions"}, {"score": 0.0025750071068101356, "phrase": "rational_players"}, {"score": 0.002213793650525558, "phrase": "amazon's_mechanical_turk"}, {"score": 0.0021049977753042253, "phrase": "different_system_parameters"}], "paper_keywords": ["Algorithmic mechanism design", " Internet-based computing", " reliability and fault-tolerance", " untrusted workers", " unreliable communication"], "paper_abstract": "We consider Internet-based master-worker computations, where a master processor assigns, across the Internet, a computational task to a set of untrusted worker processors, and collects their responses. Examples of such computations are the \"@home\" projects such as SETI. In this work, various worker behaviors are considered. Altruistic workers always return the correct result of the task, malicious workers always return an incorrect result, and rational workers act based on their self-interest. In a massive computation platform, such as the Internet, it is expected that all three type of workers coexist. Therefore, in this work, we study Internet-based master-worker computations in the presence of malicious, altruistic, and rational workers. A stochastic distribution of the workers over the three types is assumed. In addition, we consider the possibility that the communication between the master and the workers is not reliable, and that workers could be unavailable. Considering all the three types of workers renders a combination of game-theoretic and classical distributed computing approaches to the design of mechanisms for reliable Internet-based computing. Indeed, in this work, we design and analyze two algorithmic mechanisms to provide appropriate incentives to rational workers to act correctly, despite the malicious workers' actions and the unreliability of the communication. Only when necessary, the incentives are used to force the rational players to a certain equilibrium (which forces the workers to be truthful) that overcomes the attempt of the malicious workers to deceive the master. Finally, the mechanisms are analyzed in two realistic Internet-based master-worker settings, a SETI-like one and a contractor-based one, such as Amazon's mechanical turk. We also present plots that illustrate the tradeoffs between reliability and cost, under different system parameters.", "paper_title": "Algorithmic Mechanisms for Reliable Master-Worker Internet-Based Computing", "paper_id": "WOS:000328643100016"}