{"auto_keywords": [{"score": 0.03346417924469899, "phrase": "robostage"}, {"score": 0.00481495049065317, "phrase": "authentic_learning_experience"}, {"score": 0.004662427600500598, "phrase": "mixed-reality_environment"}, {"score": 0.0045879792359519375, "phrase": "main_aim"}, {"score": 0.004514714250357749, "phrase": "modern_popular_teaching_method"}, {"score": 0.004278807087784626, "phrase": "everyday-life_challenges"}, {"score": 0.004055176557424983, "phrase": "different_situations"}, {"score": 0.0038846843242954935, "phrase": "authentic_environment"}, {"score": 0.0038431888954930083, "phrase": "pedagogical_purpose"}, {"score": 0.0031167895790050405, "phrase": "authentic_scenes"}, {"score": 0.003066945490483524, "phrase": "mixed-reality_technology"}, {"score": 0.002681315076008658, "phrase": "real_interactive_characters"}, {"score": 0.0022574539115388054, "phrase": "learning_motivation"}, {"score": 0.002233301265743633, "phrase": "learning_performance"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Authentic learning", " Mixed reality", " Learning environments", " Educational robots"], "paper_abstract": "The main aim of the modern popular teaching method of authentic learning has been to provide students with everyday-life challenges that develop knowledge and skills through problem solving in different situations. Many emerging information technologies have been used to present authentic environment in pedagogical purpose. However, there are few studies that have been discussed the sense of authenticity and characters in scene and how students interact with the characters involved in the task. We designed a system, RoboStage, with authentic scenes by using mixed-reality technology and robot to investigate the difference in learning with either physical or virtual characters and learning behaviors and performance through the system. Robots were designed to play real interactive characters in the task. The experiment of the study conducted with 36 junior high students. The results indicated that RoboStage significantly improved the sense of authenticity of the task and also positively affected learning motivation. Learning performance was conditionally affected by RoboStage. (C) 2010 Elsevier Ltd. All rights reserved.", "paper_title": "Improving the authentic learning experience by integrating robots into the mixed-reality environment", "paper_id": "WOS:000282349200015"}