{"auto_keywords": [{"score": 0.04951738916270167, "phrase": "trust_chain"}, {"score": 0.037074354377624366, "phrase": "estimate_scheme"}, {"score": 0.00481495049065317, "phrase": "estimate_scheme_based"}, {"score": 0.0047026237903774895, "phrase": "mobile_social_network"}, {"score": 0.004647442352794694, "phrase": "user_sentiment_analysis"}, {"score": 0.004539005582217309, "phrase": "flourishing_frontier"}, {"score": 0.004485735417293941, "phrase": "data_mining_mobile_social_network_platform"}, {"score": 0.004278807087784626, "phrase": "significant_role"}, {"score": 0.004228577663320847, "phrase": "users'_daily_communication"}, {"score": 0.00384731849108269, "phrase": "users'_trustworthy_relationships"}, {"score": 0.0030195184114140063, "phrase": "trust_chain_model"}, {"score": 0.0023976048394496446, "phrase": "estimate_schemes"}, {"score": 0.0023139986108451967, "phrase": "sentiment_modeling_method"}], "paper_keywords": [""], "paper_abstract": "User sentiment analysis has become a flourishing frontier in data mining mobile social network platform since the mobile social network plays a significant role in users' daily communication and sentiment interaction. This study studies the scheme of sentiment estimate by using the users' trustworthy relationships for evaluating sentiment delivering. First, we address an overview of sentiment delivering estimate scheme and propose its related definitions, that is, trust chain among users, sentiment semantics, and sentiment ontology. Second, this study proposes the trust chain model and its evaluation method, which is composed of evaluation of atomic, serial, parallel, and combined trust chains. Then, we propose sentiment modeling method by presenting its modeling rules. Further, we propose the sentiment delivering estimate scheme from two aspects: explicit and implicit sentiment delivering estimate schemes, based on trust chain and sentiment modeling method. Finally, examinations and results are given to further explain effectiveness and feasibility of our scheme.", "paper_title": "A Sentiment Delivering Estimate Scheme Based on Trust Chain in Mobile Social Network", "paper_id": "WOS:000364098100001"}