{"auto_keywords": [{"score": 0.044375144742625765, "phrase": "canada"}, {"score": 0.004829864465263276, "phrase": "quebec"}, {"score": 0.00481495049065317, "phrase": "research_funding"}, {"score": 0.004592214823540993, "phrase": "quebec_university_professors"}, {"score": 0.004496542293425754, "phrase": "entire_population"}, {"score": 0.003839510177926892, "phrase": "important_factor"}, {"score": 0.0037397086147485897, "phrase": "population_pyramids"}, {"score": 0.002783945062714816, "phrase": "slight_disadvantage"}, {"score": 0.002711506442590442, "phrase": "scientific_impact"}, {"score": 0.0023640560785711923, "phrase": "accompanying_division"}, {"score": 0.002219040041886641, "phrase": "scientific_community"}, {"score": 0.0021049977753042253, "phrase": "research_topics"}], "paper_keywords": ["Sex", " Research funding", " Research productivity", " Research impact", " Collaboration", " Age", " Universities", " Quebec", " Canada"], "paper_abstract": "Using the entire population of professors at universities in the province of Quebec (Canada), this article analyzes the relationship between sex and research funding, publication rates, and scientific impact. Since age is an important factor in research and the population pyramids of men and women are different, the role of age is also analyzed. The article shows that, after they have passed the age of about 38, women receive, on average, less funding for research than men, are generally less productive in terms of publications, and are at a slight disadvantage in terms of the scientific impact (measured by citations) of their publications. Various explanations for these differences are suggested, such as the more restricted collaboration networks of women, motherhood and the accompanying division of labour, women's rank within the hierarchy of the scientific community and access to resources as well as their choice of research topics and level of specialization.", "paper_title": "Sex differences in research funding, productivity and impact: an analysis of Quebec university professors", "paper_id": "WOS:000289792600004"}