{"auto_keywords": [{"score": 0.04891621500316524, "phrase": "gene_ontology"}, {"score": 0.00481495049065317, "phrase": "molecular_biology_development"}, {"score": 0.004073359218158693, "phrase": "molecular_biology_databases"}, {"score": 0.004013662619667083, "phrase": "particular_reference"}, {"score": 0.003896871009090446, "phrase": "theoretical_basis"}, {"score": 0.003548905904860611, "phrase": "bibliometric_analysis"}, {"score": 0.0035141291835319682, "phrase": "content_analysis"}, {"score": 0.003479692058963528, "phrase": "discourse_analysis"}, {"score": 0.002843372121209168, "phrase": "objective_realist_epistemology"}, {"score": 0.0027334673433027086, "phrase": "social_factors"}, {"score": 0.002146926767291475, "phrase": "formal_ontology"}], "paper_keywords": ["Content analysis", " Bibliometrics", " Classification", " Discourse analysis", " Molecular biology", " Ontologies"], "paper_abstract": "Purpose - The purpose of this article is to evaluate the development and use of the gene ontology (GO), a scientific vocabulary widely used in molecular biology databases, with particular reference to the relation between the theoretical basis of the GO, and the pragmatics of its application. Design/methodology/approach - The study uses a combination of bibliometric analysis, content analysis and discourse analysis. These analyses focus on details of the ways in which the terms of the ontology are amended and deleted, and in which they are applied by users. Findings - Although the GO is explicitly based on an objective realist epistemology, a considerable extent of subjectivity and social factors are evident in its development and use. It is concluded that bio-ontologies could beneficially be extended to be pluralist, while remaining objective, taking a view of concepts closer to that of more traditional controlled vocabularies. Originality/value - This is one of very few studies which evaluate the development of a formal ontology in relation to its conceptual foundations, and the first to consider the GO in this way.", "paper_title": "Ontological realism, concepts and classification in molecular biology Development and application of the gene ontology", "paper_id": "WOS:000329769200010"}