{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "unroutable_placement_recognition"}, {"score": 0.0046739596755881185, "phrase": "unroutable_placement_solutions"}, {"score": 0.004249825947483216, "phrase": "routability_optimization"}, {"score": 0.004100851549096203, "phrase": "global_router"}, {"score": 0.004028326293950714, "phrase": "hard-to-route_placement_solutions"}, {"score": 0.0034922880300145283, "phrase": "unroutable_placement_recognizer"}, {"score": 0.0034101316738399203, "phrase": "window-based_unroutable_region_recognition_algorithm"}, {"score": 0.0033497809969621267, "phrase": "length-bounded_unroutable_panel_recognition"}, {"score": 0.002991524908432975, "phrase": "hard-to-route_placements"}, {"score": 0.0026241684260044414, "phrase": "total_overflow"}, {"score": 0.002532035301903554, "phrase": "experimental_results"}, {"score": 0.002472412920623605, "phrase": "unroutable_region_recognition_algorithm"}, {"score": 0.002168664249034287, "phrase": "upr_algorithm"}], "paper_keywords": ["Global routing", " placement", " routability"], "paper_abstract": "To avoid producing unroutable placement solutions, many state-of-the-art routability-driven placers iteratively invoke global routers to evaluate their placement solutions, and then perform routability optimization. However, using a global router to evaluate hard-to-route placement solutions may spend considerable runtime and it cannot guarantee that a placement is truly unroutable to any router. This paper presents an unroutable placement recognizer based on a window-based unroutable region recognition algorithm and a length-bounded unroutable panel recognition (UPR) algorithm, which can confirm some placements that are exactly unroutable among a set of hard-to-route placements. In addition, if a placement is recognized to be unroutable, the recognizer can report a lower bound of total overflow for the placement. The experimental results reveal that the unroutable region recognition algorithm can find out 16 placements that are definitely unroutable among 23 widely used hard-to-route global routing benchmarks. Moreover, when a scenic constraint is considered, the UPR algorithm can find out a few more placements that are also unroutable.", "paper_title": "Region-Based and Panel-Based Algorithms for Unroutable Placement Recognition", "paper_id": "WOS:000351765000002"}