{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "enterprise_systems"}, {"score": 0.00429715240295033, "phrase": "driving_reasons"}, {"score": 0.003789137457228946, "phrase": "enterprise_goals"}, {"score": 0.003633464433320317, "phrase": "enterprise_integration_project"}, {"score": 0.0031845067058084583, "phrase": "modeling_and_measurement_formalism"}, {"score": 0.0028245516301681713, "phrase": "relational_measurement_theory"}, {"score": 0.002708399936381754, "phrase": "empirical_findings"}, {"score": 0.002628362641980801, "phrase": "case_study"}, {"score": 0.0025660347613972573, "phrase": "current_conceptualizations"}, {"score": 0.00240213106042981, "phrase": "primary_contribution"}, {"score": 0.0023592715993204796, "phrase": "formal_model"}, {"score": 0.0021049977753042253, "phrase": "enterprise_integration_projects"}], "paper_keywords": ["enterprise systems", " modeling", " measurement"], "paper_abstract": "Interdependence between the subsystems of an enterprise is one of the driving reasons for integrating the enterprise. Integration attempts to manage those interdependencies so all subsystems work harmoniously together to achieve the enterprise goals. Prior to embarking on an enterprise integration project the interdependencies need to be analyzed. Unfortunately, interdependence between subsystems is still poorly conceptualized. This paper develops a modeling and measurement formalism to analyze interdependence in the enterprise. The model defines interdependence and characterizes the strength of the interdependence through relational measurement theory. The model is supported by empirical findings and illustrated through a case study. Limitations of current conceptualizations of interdependence are discussed and remedies are proposed. The primary contribution is a formal model to define and analyze interdependence in an enterprise, an activity that should occur as part of all enterprise integration projects.", "paper_title": "Understanding interdependence in enterprise systems: A model and measurement formalism", "paper_id": "WOS:000241427500022"}