{"auto_keywords": [{"score": 0.044698494795874434, "phrase": "energy_efficiency"}, {"score": 0.04044700798588366, "phrase": "sleep_mode"}, {"score": 0.004605258779434384, "phrase": "new_problem"}, {"score": 0.00419195822011581, "phrase": "multicast_services"}, {"score": 0.004109770306454165, "phrase": "similar_mobile_networks"}, {"score": 0.003989487818395848, "phrase": "mobile_host"}, {"score": 0.0036133077234252633, "phrase": "unicast_applications"}, {"score": 0.0033379819706003885, "phrase": "mobile_hosts"}, {"score": 0.0029490571526071016, "phrase": "base_station"}, {"score": 0.002737745536992088, "phrase": "channel_throughput"}, {"score": 0.0026839922027139967, "phrase": "energy_consumption"}, {"score": 0.0025924443774713473, "phrase": "similar_data_items"}, {"score": 0.0024306105794630246, "phrase": "optimization_problem"}, {"score": 0.002234092591045251, "phrase": "cross-layer_optimization"}], "paper_keywords": ["mobile communication", " scheduling", " multicast channels", " energy management"], "paper_abstract": "In this paper, we define a new problem that has not been addressed in the past: the trade-off between energy efficiency and throughput for multicast services in 802.16e or similar mobile networks. In such networks, the mobile host can reduce its energy consumption by entering the sleep mode when it is not supposed to receive or transmit information. For unicast applications, the trade-off between delay and energy efficiency has been extensively researched. However, for mobile hosts running multicast (usually push-based) applications, it is much more difficult to determine when data should be transmitted by the base station and when each host should enter the sleep mode. In order to maximize the channel throughput while limiting the energy consumption, a group of hosts needing similar data items should be active during the same time intervals. We define this as an optimization problem and present several algorithms for it. We show that the most efficient solution is the one that employs cross-layer optimization by dividing the hosts into groups according to the quality of their downlink physical (PHY) channels.", "paper_title": "On the trade-off between energy and multicast efficiency in 802.16e-like mobile networks", "paper_id": "WOS:000252371000005"}