{"auto_keywords": [{"score": 0.04522885915367596, "phrase": "intuitionistic_linguistic_numbers"}, {"score": 0.010621093422672373, "phrase": "ilowa_operator"}, {"score": 0.009847632108933418, "phrase": "ilha_operator"}, {"score": 0.00481495049065317, "phrase": "intuitionistic_linguistic_aggregation_operators"}, {"score": 0.004553822674247401, "phrase": "intuitionistic_linguistic_information"}, {"score": 0.0044398358177815305, "phrase": "new_score_function"}, {"score": 0.00437281181878921, "phrase": "new_accuracy_function"}, {"score": 0.004220314322073171, "phrase": "simple_approach"}, {"score": 0.004011603024990615, "phrase": "intuitionistic_linguistic_weighted_arithmetic"}, {"score": 0.0031926001871260524, "phrase": "ordered_positions"}, {"score": 0.002540377258232509, "phrase": "ilwaa_operator"}, {"score": 0.0024766636161181544, "phrase": "multi-criteria_group_decision"}, {"score": 0.0023183698048498797, "phrase": "criteria_weight_information"}, {"score": 0.0021049977753042253, "phrase": "developed_method"}], "paper_keywords": ["Multi-criteria group decision making", " intuitionistic linguistic number", " intuitionistic linguistic ordered weighted averaging (ILOWA) operator", " intuitionistic linguistic hybrid aggregation (ILHA) operator"], "paper_abstract": "For multi-criteria group decision making problems with intuitionistic linguistic information, we define a new score function and a new accuracy function of intuitionistic linguistic numbers, and propose a simple approach for the comparison between two intuitionistic linguistic numbers. Based on the intuitionistic linguistic weighted arithmetic averaging (ILWAA) operator, we define two new intuitionistic linguistic aggregation operators, such as the intuitionistic linguistic ordered weighted averaging (ILOWA) operator and the intuitionistic linguistic hybrid aggregation (ILHA) operator, and establish various properties of these operators. The ILOWA operator weights the ordered positions of the intuitionistic linguistic numbers instead of weighting the arguments themselves. The ILHA operator generalizes both the ILWAA operator and the ILOWA operator at the same time, and reflects the importance degrees of both the given intuitionistic linguistic numbers and the ordered positions of these arguments. Furthermore, based on the ILHA operator and the ILWAA operator, we develop a multi-criteria group decision making approach, in which the criteria values are intuitionistic linguistic numbers and the criteria weight information is known completely. Finally, an example is given to illustrate the feasibility and effectiveness of the developed method.", "paper_title": "Multi-criteria group decision making method based on intuitionistic linguistic aggregation operators", "paper_id": "WOS:000328936600011"}