{"auto_keywords": [{"score": 0.03289365921889542, "phrase": "redesign_proposals"}, {"score": 0.028048543728099447, "phrase": "usability_problems"}, {"score": 0.00481495049065317, "phrase": "usability_feedback_formats"}, {"score": 0.004636594774238505, "phrase": "usability_evaluations"}, {"score": 0.004122699822340296, "phrase": "explorative_study"}, {"score": 0.004003348169928476, "phrase": "five_feedback_formats"}, {"score": 0.003790751492305239, "phrase": "multiple_purposes"}, {"score": 0.0034729178063350507, "phrase": "feedback"}, {"score": 0.0030857431184193765, "phrase": "multimedia_reports"}, {"score": 0.002586513876943306, "phrase": "significant_differences"}, {"score": 0.0025541050375256992, "phrase": "developers'_ratings"}, {"score": 0.0024904974828343033, "phrase": "different_formats"}, {"score": 0.0023284972218506157, "phrase": "later_stages"}, {"score": 0.0021953959824690316, "phrase": "annotated_screen"}, {"score": 0.002149722786728988, "phrase": "initial_feedback_goals"}, {"score": 0.0021049977753042253, "phrase": "usability_problem"}], "paper_keywords": [""], "paper_abstract": "The format used to present feedback from usability evaluations to developers affects whether problems are understood, accepted, and fixed. Yet, little research has investigated which formats are the most effective. We describe an explorative study where three developers assess 40 usability findings presented using five feedback formats. Our usability findings comprise 35 problems and 5 positive comments. Data suggest that feedback serves multiple purposes. Initially, feedback must convince developers about the relevance of a problem and convey an understanding of this. Feedback must next be easy to use and finally serve as a reminder of the problem. Prior to working with the feedback, developers rated redesign proposals, multimedia reports, and annotated screen dumps as more valuable than lists of problems, all of which were rated as more valuable than scenarios. After having spent some time working with the feedback to address the usability problems, there were no significant differences among the developers' ratings of the value of the different formats. This suggests that all of the formats may serve equally well as reminders in later stages of working with usability problems, but that redesign proposals, multimedia reports, and annotated screen dumps best address the initial feedback goals convincing developers that a usability problem exists and of conveying an understanding of the problem.", "paper_title": "Exploring the Value of Usability Feedback Formats", "paper_id": "WOS:000262473100003"}