{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "silent_data_corruptions"}, {"score": 0.012997937031646046, "phrase": "data_reconstruction"}, {"score": 0.008923679463560225, "phrase": "erasure-coded_storage_systems"}, {"score": 0.004168349927332055, "phrase": "new_technique"}, {"score": 0.0038567860860362745, "phrase": "data_reconstruction_method"}, {"score": 0.0035486713647627246, "phrase": "strip_group"}, {"score": 0.003319939715683536, "phrase": "strip_groups"}, {"score": 0.003105905142768581, "phrase": "efficient_adaptive_data_reconstruction_method"}, {"score": 0.002905629026254221, "phrase": "performance_analysis"}, {"score": 0.002779318608820933, "phrase": "probabilistic_method"}, {"score": 0.0026881926384093088, "phrase": "overall_performance_impact"}, {"score": 0.0026000466400112974, "phrase": "practical_systems"}, {"score": 0.0022377394845878268, "phrase": "better_choice"}, {"score": 0.002164331818029166, "phrase": "periodic_validation"}, {"score": 0.0021049977753042253, "phrase": "erasure-coded_storage_system"}], "paper_keywords": ["Data reconstruction", " erasure code", " silent data corruption", " storage system"], "paper_abstract": "One recent technical challenge facing the designers of erasure-coded storage systems is how to prevent silent data corruptions from propagating during data reconstruction. This paper proposes a new technique of exploiting erasure-coded storage systems to cope with silent data corruptions during data reconstruction. To develop a data reconstruction method that can prevent silent data corruptions from propagating, we first define the consistency of a strip group and then study the impact of silent data corruptions on the consistency of strip groups. Based on the conclusions obtained from the study, an efficient adaptive data reconstruction method is developed for data reconstruction in the presence of silent data corruptions. A performance analysis of our new data reconstruction method is then made using a probabilistic method. Our results show that the overall performance impact of our data reconstruction method is negligible in practical systems. A comparison of techniques for coping with silent data corruptions in erasure-coded storage systems is also made. The comparison shows that the technique based on our data reconstruction method is a better choice to cope with silent data corruptions when periodic validation is used in an erasure-coded storage system.", "paper_title": "Preventing Silent Data Corruptions from Propagating During Data Reconstruction", "paper_id": "WOS:000283718100003"}