{"auto_keywords": [{"score": 0.04945866963669641, "phrase": "lmer_function"}, {"score": 0.00481495049065317, "phrase": "item_response_models"}, {"score": 0.004318881178805575, "phrase": "item_response"}, {"score": 0.004099183062034004, "phrase": "irt_framework"}, {"score": 0.004010960493946656, "phrase": "generalized_linear"}, {"score": 0.002818850283787242, "phrase": "item_covariate_models"}, {"score": 0.0027943943921568456, "phrase": "person_covariate_models"}, {"score": 0.0027581067089091434, "phrase": "person-by-item_covariate_models"}, {"score": 0.0025279105573394727, "phrase": "associated_lmer_code"}, {"score": 0.0024306740161601625, "phrase": "linear_logistic_test_model"}, {"score": 0.0023990982005125763, "phrase": "error_term"}, {"score": 0.0023782753249846794, "phrase": "differential_item_functioning_models"}, {"score": 0.002347378595930709, "phrase": "local_item_dependency_models"}, {"score": 0.0022768346311104735, "phrase": "univariate_generalized_linear_mixed_models"}, {"score": 0.0021049977753042253, "phrase": "polytomous_response_data"}], "paper_keywords": ["generalized linear mixed models", " item response models", " multidimensional IRT", " item covariates", " person covariates"], "paper_abstract": "In this paper we elaborate on the potential of the lmer function from the l m e 4 package in R for item response (IRT) modeling. In line with the package, an IRT framework is described based on generalized linear mixed modeling. The aspects of the framework refer to (a) the kind of covariates - their mode (person, item, person-by-item), and their being external vs. internal to responses, and (b) the kind of effects the covariates have - fixed vs. random, and if random, the mode across which the effects are random (persons, items). Based on this framework, three broad categories of models are described: Item covariate models, person covariate models, and person-by-item covariate models, and within each category three types of more specific models are discussed. The models in question are explained and the associated lmer code is given. Examples of models are the linear logistic test model with an error term, differential item functioning models, and local item dependency models. Because the l m e 4 package is for univariate generalized linear mixed models, neither the two-parameter, and three-parameter models, nor the item response models for polytomous response data, can be estimated with the lmer function.", "paper_title": "The Estimation of Item Response Models with the lmer Function from the lme4 Package in R", "paper_id": "WOS:000288206200001"}