{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "scientific_disciplines"}, {"score": 0.04203771349565812, "phrase": "knowledge-flow_network"}, {"score": 0.0407636886667594, "phrase": "journal_citation_reports"}, {"score": 0.03401369508819546, "phrase": "social_science_domains"}, {"score": 0.029904348099669978, "phrase": "science_domains"}, {"score": 0.004663533386096864, "phrase": "knowledge_dissemination"}, {"score": 0.004179480763003705, "phrase": "effective_proxy"}, {"score": 0.004122604238556912, "phrase": "disciplinary_knowledge_flow"}, {"score": 0.003867206750827, "phrase": "subject_category"}, {"score": 0.0035945701438887282, "phrase": "shortest_path"}, {"score": 0.0033410898465226417, "phrase": "subject_categories"}, {"score": 0.0027073229284666294, "phrase": "physics-related_domains"}, {"score": 0.002370955769074803, "phrase": "knowledge_paths"}, {"score": 0.0021049977753042253, "phrase": "empirical_analysis"}], "paper_keywords": ["informetrics"], "paper_abstract": "This paper uncovers patterns of knowledge dissemination among scientific disciplines. Although the transfer of knowledge is largely unobservable, citations from one discipline to another have been proven to be an effective proxy to study disciplinary knowledge flow. This study constructs a knowledge-flow network in which a node represents a Journal Citation Reports subject category and a link denotes the citations from one subject category to another. Using the concept of shortest path, several quantitative measurements are proposed and applied to a knowledge-flow network. Based on an examination of subject categories in Journal Citation Reports, this study indicates that social science domains tend to be more self-contained, so it is more difficult for knowledge from other domains to flow into them; at the same time, knowledge from science domains, such as biomedicine-, chemistry-, and physics-related domains, can access and be accessed by other domains more easily. This study also shows that social science domains are more disunified than science domains, because three fifths of the knowledge paths from one social science domain to another require at least one science domain to serve as an intermediate. This work contributes to discussions on disciplinarity and interdisciplinarity by providing empirical analysis.", "paper_title": "Finding Knowledge Paths Among Scientific Disciplines", "paper_id": "WOS:000344225200013"}