{"auto_keywords": [{"score": 0.038888527349518906, "phrase": "javascript"}, {"score": 0.007519649542405903, "phrase": "javascript_lexer"}, {"score": 0.004765482708043842, "phrase": "hygienic_macros"}, {"score": 0.004622738186892454, "phrase": "scheme"}, {"score": 0.0037965243835456214, "phrase": "expressive_hygienic_macro_systems"}, {"score": 0.003623949225126944, "phrase": "unique_challenges"}, {"score": 0.0035866734383189366, "phrase": "macro_systems"}, {"score": 0.0034771228725942846, "phrase": "lexing_stage"}, {"score": 0.0031845067058084583, "phrase": "novel_solution"}, {"score": 0.0031354779851351287, "phrase": "lexing_ambiguity"}, {"score": 0.0023225701080913388, "phrase": "general_technique"}, {"score": 0.0022399174232611853, "phrase": "ambiguous_grammars"}, {"score": 0.0021049977753042253, "phrase": "expressive_hygienic_macro_system"}], "paper_keywords": ["Macros", " JavaScript", " Hygiene"], "paper_abstract": "Lisp and Scheme have demonstrated the power of macros to enable programmers to evolve and craft languages. In languages with more complex syntax, macros have had less success. In part, this has been due to the difficulty in building expressive hygienic macro systems for such languages. JavaScript in particular presents unique challenges for macro systems due to ambiguities in the lexing stage that force the JavaScript lexer and parser to be intertwined. In this paper we present a novel solution to the lexing ambiguity of JavaScript that enables us to cleanly separate the JavaScript lexer and parser by recording enough history during lexing to resolve ambiguities. We give an algorithm for this solution along with a proof that it does in fact correctly resolve ambiguities in the language. Though the algorithm and proof we present is specific to JavaScript, the general technique can be applied to other languages with ambiguous grammars. With lexer and parser separated, we then implement an expressive hygienic macro system for JavaScript called sweet.js.", "paper_title": "Sweeten Your JavaScript: Hygienic Macros for ES5", "paper_id": "WOS:000357123600005"}