{"auto_keywords": [{"score": 0.0451128146367674, "phrase": "ps"}, {"score": 0.00481495049065317, "phrase": "participatory_sensing_systems"}, {"score": 0.004594951819987416, "phrase": "data_interpolation_techniques"}, {"score": 0.004402088928254543, "phrase": "traditional_environmental_monitoring_systems"}, {"score": 0.003870541730075597, "phrase": "multivariate_time_series"}, {"score": 0.003693533648584145, "phrase": "multivariate_time-space_series"}, {"score": 0.0035108659422301985, "phrase": "markov_random_fields"}, {"score": 0.0032094634756436595, "phrase": "one-variable_data_interpolation"}, {"score": 0.0030986716686217768, "phrase": "multivariate_interpolation"}, {"score": 0.0030506626796257077, "phrase": "principal_component_analysis"}, {"score": 0.0030269369940823902, "phrase": "independent_component_analysis"}, {"score": 0.002865929543375884, "phrase": "alternative_approach"}, {"score": 0.0026923527275481804, "phrase": "ps_systems"}, {"score": 0.002311933249234786, "phrase": "ps_system"}, {"score": 0.0022760856906838814, "phrase": "traditional_measuring_system"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["MRF", " Gibbs sampler", " Kriging", " PCA", " ICA"], "paper_abstract": "In this paper, we study the problem of applying data interpolation techniques in Participatory Sensing (PS) systems using an air quality/pollution monitoring application as an example. While traditional environmental monitoring systems consist of very few static measuring stations, PS systems rely on the participation of many mobile stations. As a result, the structure of the data provided by each system is different and instead of a multivariate time series with a few gaps in the same space, now we have a multivariate time-space series with many gaps in time and space. First, two data interpolation techniques, Markov Random Fields and kriging, are analyzed. After showing the trade-offs and superiority of kriging, this technique is used to perform a one-variable data interpolation. Then, the problems of cokriging for multivariate interpolation are introduced and Principal Component Analysis and Independent Component Analysis are utilized along with kriging to overcome these problems. Finally, an alternative approach to interpolate data in time and space is proposed, which is really useful for PS systems. The results indicate that the accuracy of the estimates improves with the amount of data, i.e., one variable, multiple variables, and space and time data. Also, the results clearly show the advantage of a PS system compared with a traditional measuring system in terms of the precision and granularity of the information provided to the users. (c) 2012 Elsevier B.V. All rights reserved.", "paper_title": "Data interpolation for participatory sensing systems", "paper_id": "WOS:000314805600010"}