{"auto_keywords": [{"score": 0.03824236520910253, "phrase": "document_retrieval"}, {"score": 0.00481495049065317, "phrase": "procedural_questions"}, {"score": 0.004262643556463569, "phrase": "search_engine"}, {"score": 0.003813669883040509, "phrase": "natural_language"}, {"score": 0.0037336520904376687, "phrase": "vast_majority"}, {"score": 0.0034299649219748513, "phrase": "boolean_queries"}, {"score": 0.0032184697893776052, "phrase": "natural_language_questions"}, {"score": 0.002687235334499192, "phrase": "non-content_features"}, {"score": 0.0023408288327263316, "phrase": "document_retrieval_results"}, {"score": 0.0021049977753042253, "phrase": "significant_improvement"}], "paper_keywords": ["procedural questions", " question classification", " document structure", " document clustering", " document retrieval", " reranking"], "paper_abstract": "People use questions to elicit information from other people in their everyday lives and yet the most common method of obtaining information from a search engine is by posing keywords. There has been research that suggests users are better at expressing their information needs in natural language, however the vast majority of work to improve document retrieval has focused on queries posed as sets of keywords or Boolean queries. This paper focuses on improving document retrieval for the subset of natural language questions asking about how something is done. We classify questions as asking either for a description of a process or asking for a statement of fact, with better than 90% accuracy. Further we identify non-content features of documents relevant to questions asking about a process. Finally we demonstrate that we can use these features to significantly improve the precision of document retrieval results for questions asking about a process. Our approach, based on exploiting the structure of documents, shows a significant improvement in precision at rank one for questions asking about how something is done. (c) 2006 Elsevier Ltd. All rights reserved.", "paper_title": "Identifying and improving retrieval for procedural questions", "paper_id": "WOS:000241539500013"}