{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "mental_health_epidemic"}, {"score": 0.004773904938276846, "phrase": "university_students"}, {"score": 0.004252707756312684, "phrase": "mental_disorders"}, {"score": 0.003920295222165263, "phrase": "active_role"}, {"score": 0.003788196352457501, "phrase": "web-based_self-screening"}, {"score": 0.0037078961288626185, "phrase": "secure_communication_system"}, {"score": 0.003477029725200912, "phrase": "study_period"}, {"score": 0.00296698375549856, "phrase": "mental_health_concerns"}, {"score": 0.0027702126237754625, "phrase": "professional_assistance"}, {"score": 0.002586457551025025, "phrase": "system_use"}, {"score": 0.0024356742694508662, "phrase": "referral_managers"}, {"score": 0.002404522326122611, "phrase": "care_providers"}, {"score": 0.0023035249767734286, "phrase": "daily_clinical_use"}, {"score": 0.002244969789802093, "phrase": "web-based_system"}, {"score": 0.0021414489155042885, "phrase": "growing_epidemic"}, {"score": 0.0021231452870210965, "phrase": "mental_health_problems"}, {"score": 0.0021049977753042253, "phrase": "college_and_university_students"}], "paper_keywords": ["College", " Internet", " mental health", " referral", " screening", " university", " World Wide Web"], "paper_abstract": "The prevalence and severity of mental health problems in college and university communities are alarming. However, the majority of students with mental disorders do not seek help from professionals. To help students assess their mental conditions and encourage them to take an active role in seeking care, we developed a web-based self-screening, referral, and secure communication system and evaluated it at the University of Washington for 17 months. The system handled more than 1000 screenings during the study period. Of the subjects who used the system, 75% noted that the system helped them to make a decision to receive help from professionals. The system was able to provide outreach to students with mental health concerns effectively, allow them to self-screen their conditions, and encourage them to receive professional assistance. The system provided students with 24/7 web-based access to the clinic, and more than 50% of the system use was made during off-hours. The system was well received by patients, referral managers, and care providers, and it was transferred to the clinic for daily clinical use. We believe that a web-based system like ours could be used as one way to tackle the growing epidemic of mental health problems among college and university students.", "paper_title": "Addressing Mental Health Epidemic Among University Students via Web-based, Self-Screening, and Referral System: A Preliminary Study", "paper_id": "WOS:000288082200015"}