{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "data_complexity_measures"}, {"score": 0.004768739216860887, "phrase": "constant_appearance"}, {"score": 0.0046776367107079315, "phrase": "data_mining"}, {"score": 0.0040866404150657005, "phrase": "learning_algorithm"}, {"score": 0.0036868116297599255, "phrase": "automatic_extraction_method"}, {"score": 0.0032102434609532888, "phrase": "geometrical_structures"}, {"score": 0.002961938159281582, "phrase": "data_complexity"}, {"score": 0.0029240263074648792, "phrase": "large_benchmark"}, {"score": 0.002849648027963056, "phrase": "behavior_patterns"}, {"score": 0.0027593227272966186, "phrase": "good_or_bad_performance"}, {"score": 0.0025871486424767173, "phrase": "k-nn."}, {"score": 0.0025132071574192672, "phrase": "good_or_bad_behaviors"}, {"score": 0.0023946267004932736, "phrase": "response_quality"}, {"score": 0.0023487724551034227, "phrase": "dataset's_complexity"}, {"score": 0.0022889932805175406, "phrase": "fresh_problems"}], "paper_keywords": ["Classification", " Data complexity", " Domains of competence", " C4.5", " Support vector machines", " K-nearest neighbor"], "paper_abstract": "The constant appearance of algorithms and problems in data mining makes impossible to know in advance whether the model will perform well or poorly until it is applied, which can be costly. It would be useful to have a procedure that indicates, prior to the application of the learning algorithm and without needing a comparison with other methods, whether the outcome will be good or bad using the information available in the data. In this work, we present an automatic extraction method to determine the domains of competence of a classifier using a set of data complexity measures proposed for the task of classification. These domains codify the characteristics of the problems that are suitable or not for it, relating the concepts of data geometrical structures that may be difficult and the final accuracy obtained by any classifier. In order to do so, this proposal uses 12 metrics of data complexity acting over a large benchmark of datasets in order to analyze the behavior patterns of the method, obtaining intervals of data complexity measures with good or bad performance. As a representative for classifiers to analyze the proposal, three classical but different algorithms are used: C4.5, SVM and K-NN. From these intervals, two simple rules that describe the good or bad behaviors of the classifiers mentioned each are obtained, allowing the user to characterize the response quality of the methods from a dataset's complexity. These two rules have been validated using fresh problems, showing that they are general and accurate. Thus, it can be established when the classifier will perform well or poorly prior to its application.", "paper_title": "An automatic extraction method of the domains of competence for learning classifiers using data complexity measures", "paper_id": "WOS:000347286900007"}