{"auto_keywords": [{"score": 0.04235866539811936, "phrase": "standard_peers"}, {"score": 0.04029185245649539, "phrase": "mobile_devices"}, {"score": 0.02364353524510349, "phrase": "proposed_system"}, {"score": 0.004769702911065878, "phrase": "end-device_control"}, {"score": 0.004360412703519539, "phrase": "wide-area_network"}, {"score": 0.004278807087784626, "phrase": "network_security_policy"}, {"score": 0.0041987222897385676, "phrase": "current_research_work"}, {"score": 0.0038746849003761024, "phrase": "connections_capabilities"}, {"score": 0.0037133478610481994, "phrase": "increasing_interest"}, {"score": 0.0033308077968426937, "phrase": "jxta-overlay"}, {"score": 0.003015950477134494, "phrase": "smart_box"}, {"score": 0.00266693888510356, "phrase": "mobile_car"}, {"score": 0.0025436978068459565, "phrase": "wireless_environment"}, {"score": 0.002507845411496512, "phrase": "proposed_approach"}, {"score": 0.002426137929553722, "phrase": "jxta_protocols"}, {"score": 0.0022706045233150795, "phrase": "network_security_policies"}, {"score": 0.0021049977753042253, "phrase": "good_performance"}], "paper_keywords": ["JXTA", " P2P systems", " e-learning", " Java applications", " End-device control", " Mobile device SmartBox"], "paper_abstract": "This work is motivated by the need to develop decentralized P2P approaches for controlling end-devices in a wide-area network without changing the network security policy. Much of current research work on P2P systems is devoted to P2P networks of standard peers such as PCs. Due to improvements of connections capabilities of mobile devices and end-devices, there is an increasing interest to design, implement and deploy full featured P2P networks that integrate standard peers, mobile devices and end-devices. In this paper, we use the JXTA-Overlay for the control of end-devices and e-learning in a P2P network. We considered as end-devices the smart box (which is used for stimulating the learners in our implemented P2P e-learning system), robot, and room lightening. We also considered the control of a mobile car in order to prove the applicability of our approach in wireless environment. The proposed approach, due to the capabilities of JXTA protocols to overcome firewalls and NATs, is able to control devices without changing network security policies. We evaluate the proposed system by many experiments and have shown that the proposed system has a good performance and can be used successfully for the control of end-devices and in e-learning.", "paper_title": "Application of a JXTA-overlay P2P system for end-device control and e-learning", "paper_id": "WOS:000289739800003"}