{"auto_keywords": [{"score": 0.04539932504094415, "phrase": "compound_identification"}, {"score": 0.028962429851037672, "phrase": "developed_method"}, {"score": 0.02620183499662011, "phrase": "conventional_approach"}, {"score": 0.014373586096401509, "phrase": "widely_used_approach"}, {"score": 0.013950627873892838, "phrase": "chromatography-mass_spectrometry-based_metabolomics"}, {"score": 0.010218665742973638, "phrase": "false_identification_rate"}, {"score": 0.009681572910071271, "phrase": "first_and_second_highest_spectral_similarity_scores"}, {"score": 0.009339138510237453, "phrase": "model-based_approach"}, {"score": 0.009117542257845567, "phrase": "desired_true_positive_rate"}, {"score": 0.007388073048180531, "phrase": "positive_predictive_value"}, {"score": 0.00481495049065317, "phrase": "false_identification"}, {"score": 0.004757227624616643, "phrase": "similarity_difference"}, {"score": 0.004700193486903964, "phrase": "gc-ms-based_metabolomics"}, {"score": 0.004533142516832776, "phrase": "critical_process"}, {"score": 0.00406663414150229, "phrase": "mass_spectral_similarity"}, {"score": 0.00399367108161192, "phrase": "experimental_mass_spectrum"}, {"score": 0.003922011960904278, "phrase": "mass_spectrum"}, {"score": 0.0038516336597530614, "phrase": "reference_library"}, {"score": 0.0035824802350703376, "phrase": "overall_accuracy"}, {"score": 0.003352256019007896, "phrase": "false_discovery_rate"}, {"score": 0.0021049977753042253, "phrase": "john_wiley"}], "paper_keywords": ["compound identification", " gas chromatography-mass spectrometry (GC-MS)", " metabolomics", " similarity", " true positive rate"], "paper_abstract": "Compound identification is a critical process in metabolomics. The widely used approach for compound identification in gas chromatography-mass spectrometry-based metabolomics is spectrum matching, in which the mass spectral similarity between an experimental mass spectrum and each mass spectrum in a reference library is calculated. While various similarity measures have been developed to improve the overall accuracy of compound identification, little attention has been paid to reducing the false discovery rate. We, therefore, develop an approach for controlling the false identification rate using the distribution of the difference between the first and second highest spectral similarity scores. We further propose a model-based approach to achieving a desired true positive rate. The developed method is applied to the National Institute of Standards and Technology mass spectral library, and its performance is compared with that of the conventional approach that uses only the maximum spectral similarity score. The results show that the developed method achieves a significantly higher F1 score and positive predictive value than did the conventional approach. Copyright (c) 2014 John Wiley & Sons, Ltd. The widely used approach for compound identification in gas chromatography-mass spectrometry-based metabolomics is spectrum matching. We develop an approach for controlling the false identification rate using the distribution of the difference between the first and second highest spectral similarity scores. We further propose a model-based approach to achieving a desired true positive rate. The results show that the developed method achieves a significantly higher F1 score and positive predictive value than did the conventional approach.", "paper_title": "Discovery of false identification using similarity difference in GC-MS-based metabolomics", "paper_id": "WOS:000350144700002"}