{"auto_keywords": [{"score": 0.04497074066422271, "phrase": "flow-based_methods"}, {"score": 0.00481495049065317, "phrase": "flow-based_method_using_grey_relational_analysis"}, {"score": 0.0045262653692203815, "phrase": "outranking_relation_theory"}, {"score": 0.004400804926266097, "phrase": "multiple_criteria"}, {"score": 0.004207230913063179, "phrase": "overall_preference_index"}, {"score": 0.003823584649521733, "phrase": "traditional_flow"}, {"score": 0.003738502710504415, "phrase": "pairwise_comparison"}, {"score": 0.003018668521745676, "phrase": "traditional_flows"}, {"score": 0.0029681091946289757, "phrase": "relationship-based_flow"}, {"score": 0.002853396755102163, "phrase": "grey_relational_analysis"}, {"score": 0.0024926348205500715, "phrase": "genetic_algorithm-based_learning_algorithm"}, {"score": 0.0024097920845706795, "phrase": "relative_weights"}, {"score": 0.0023827927890399357, "phrase": "respective_criteria"}, {"score": 0.0023296961971785357, "phrase": "overall_relationship_index"}], "paper_keywords": ["Grey relational analysis", " multiple criteria decision aid", " classification problems", " genetic algorithm", " outranking relation"], "paper_abstract": "Flow-based methods based on the outranking relation theory are extensively used in multiple criteria classification problems. Flow-based methods usually employed an overall preference index representing the flow to measure the intensity of preference for one pattern over another pattern. A traditional flow obtained by the pairwise comparison may not be complete since it does not globally consider the differences on each criterion between all the other patterns and the latter. That is, a traditional flow merely locally considers the difference on each criterion between two patterns. In contrast with traditional flows, the relationship-based flow is newly proposed by employing the grey relational analysis to assess the flow from one pattern to another pattern by considering the differences on each criterion between all the other patterns and the latter. A genetic algorithm-based learning algorithm is designed to determine the relative weights of respective criteria to derive the overall relationship index of a pattern. Our method is tested on several real-world data sets. Its performance is comparable to that of other well-known classifiers and flow-based methods.", "paper_title": "A NOVEL FLOW-BASED METHOD USING GREY RELATIONAL ANALYSIS FOR PATTERN CLASSIFICATION", "paper_id": "WOS:000317849700004"}