{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "archetype_approach"}, {"score": 0.04040504713301419, "phrase": "existing_archetypes"}, {"score": 0.03971569370720237, "phrase": "new_archetypes"}, {"score": 0.015592211976571613, "phrase": "biobank_information_management_system"}, {"score": 0.010140573842652784, "phrase": "pcrc_bims_database"}, {"score": 0.008421115642078108, "phrase": "clinical_practice"}, {"score": 0.004665337276660748, "phrase": "openehr_archetype_approach"}, {"score": 0.00460173993032026, "phrase": "existing_proprietary_biobank_information_management_system"}, {"score": 0.004545240514015278, "phrase": "sample_donor_and_sample_related_information"}, {"score": 0.004483272938890684, "phrase": "donor's_electronic_health_record"}, {"score": 0.004416079619543104, "phrase": "openehr_archetypes"}, {"score": 0.0043558652552334355, "phrase": "interoperable_ehr"}, {"score": 0.004296468385823454, "phrase": "new_set"}, {"score": 0.0042495320879288615, "phrase": "ultimate_goal"}, {"score": 0.004197338787696244, "phrase": "interoperable_electronic_biomedical_research_record"}, {"score": 0.004162898387323015, "phrase": "biomedical_knowledge_discovery"}, {"score": 0.0041174152262981505, "phrase": "prostate_cancer_biobank"}, {"score": 0.004100486922887424, "phrase": "irish_prostate_cancer_research_consortium"}, {"score": 0.004044558263255225, "phrase": "novel_biomarkers"}, {"score": 0.0040334640350288, "phrase": "prostate_cancer"}, {"score": 0.003983913892907531, "phrase": "modelling_effort"}, {"score": 0.0039620866640334386, "phrase": "database_schema"}, {"score": 0.003913409930477798, "phrase": "archetype-friendly_concepts"}, {"score": 0.0038919674721676592, "phrase": "archetype_repositories"}, {"score": 0.0037297085404352347, "phrase": "biobank_database_schema"}, {"score": 0.0035988294152570154, "phrase": "pcrc_biobank"}, {"score": 0.0032374685744565607, "phrase": "immature_modelling_support_tools"}, {"score": 0.003215295260684715, "phrase": "high-quality_archetypes"}, {"score": 0.0031932733246765573, "phrase": "overlapping_archetypes"}, {"score": 0.0031583505324496285, "phrase": "suitable_existing_archetypes"}, {"score": 0.0030265836903931604, "phrase": "data-level_modelling"}, {"score": 0.002924323543873284, "phrase": "current_way"}, {"score": 0.0029082846904666714, "phrase": "sample_entity"}, {"score": 0.002876469643111867, "phrase": "sample-centric_activity"}, {"score": 0.002845001641952116, "phrase": "promising_approach"}, {"score": 0.0028293966058473476, "phrase": "shareable_ebmrr"}, {"score": 0.0027792673085882806, "phrase": "ehr_domain"}, {"score": 0.002745082207478357, "phrase": "sample_information"}, {"score": 0.002733780613223783, "phrase": "biobank_context"}, {"score": 0.0026706091815588435, "phrase": "biomedical_research"}, {"score": 0.0026523079380037706, "phrase": "suitable_archetypes"}, {"score": 0.0026268961477241026, "phrase": "exact_mapping"}, {"score": 0.0024862754099732546, "phrase": "information_documentation"}, {"score": 0.002442210408593024, "phrase": "better_support_tools"}, {"score": 0.0024355006743908927, "phrase": "modelling_guidelines"}, {"score": 0.002428809329644027, "phrase": "best_practice_rules"}, {"score": 0.0024088451312725924, "phrase": "better_domain_knowledge_governance"}, {"score": 0.0023694065215394593, "phrase": "independent_sample_record"}, {"score": 0.00235316449990244, "phrase": "record_subject"}, {"score": 0.0022673579319079833, "phrase": "single_biobank_instance"}, {"score": 0.0022179901564261975, "phrase": "particular_database"}, {"score": 0.0021726824107282054, "phrase": "archetype_modelling_landscape"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ireland_ltd."}], "paper_keywords": ["Biological Specimen Banks", " Biobanks", " Electronic Health Record", " openEHR archetypes and templates", " Biobank information management system"], "paper_abstract": "Purpose: The purpose of this study is to investigate the feasibility of applying the openEHR archetype approach to modelling the data in the database of an existing proprietary biobank information management system. A biobank information management system stores the clinical/phenotypic data of the sample donor and sample related information. The clinical/phenotypic data is potentially sourced from the donor's electronic health record (EHR). The study evaluates the reuse of openEHR archetypes that have been developed for the creation of an interoperable EHR in the context of biobanking, and proposes a new set of archetypes specifically for biobanks. The ultimate goal of the research is the development of an interoperable electronic biomedical research record (eBMRR) to support biomedical knowledge discovery. Methods: The database of the prostate cancer biobank of the Irish Prostate Cancer Research Consortium (PCRC), which supports the identification of novel biomarkers for prostate cancer, was taken as the basis for the modelling effort. First the database schema of the biobank was analyzed and reorganized into archetype-friendly concepts. Then, archetype repositories were searched for matching archetypes. Some existing archetypes were reused without change, some were modified or specialized, and new archetypes were developed where needed. The fields of the biobank database schema were then mapped to the elements in the archetypes. Finally, the archetypes were arranged into templates specifically to meet the requirements of the PCRC biobank. Results: A set of 47 archetypes was found to cover all the concepts used in the biobank. Of these, 29 (62%) were reused without change, 6 were modified and/or extended, 1 was specialized, and 11 were newly defined. These archetypes were arranged into 8 templates specifically required for this biobank. A number of issues were encountered in this research. Some arose from the immaturity of the archetype approach, such as immature modelling support tools, difficulties in defining high-quality archetypes and the problem of overlapping archetypes. In addition, the identification of suitable existing archetypes was time-consuming and many semantic conflicts were encountered during the process of mapping the PCRC BIMS database to existing archetypes. These include differences in the granularity of documentation, in metadata-level versus data-level modelling, in terminologies and vocabularies used, and in the amount of structure imposed on the information to be recorded. Furthermore, the current way of modelling the sample entity was found to be cumbersome in the sample-centric activity of biobanking. The archetype approach is a promising approach to create a shareable eBMRR based on the study participant/donor for biobanks. Many archetypes originally developed for the EHR domain can be reused to model the clinical/phenotypic and sample information in the biobank context, which validates the genericity of these archetypes and their potential for reuse in the context of biomedical research. However, finding suitable archetypes in the repositories and establishing an exact mapping between the fields in the PCRC BIMS database and the elements of existing archetypes that have been designed for clinical practice can be challenging and time-consuming and involves resolving many common system integration conflicts. These may be attributable to differences in the requirements for information documentation between clinical practice and biobanking. This research also recognized the need for better support tools, modelling guidelines and best practice rules and reconfirmed the need for better domain knowledge governance. Furthermore, the authors propose that the establishment of an independent sample record with the sample as record subject should be investigated. The research presented in this paper is limited by the fact that the new archetypes developed during this research are based on a single biobank instance. These new archetypes may not be complete, representing only those subsets of items required by this particular database. Nevertheless, this exercise exposes some of the gaps that exist in the archetype modelling landscape and highlights the concepts that need to be modelled with archetypes to enable the development of an eBMRR. (C) 2010 Elsevier Ireland Ltd. All rights reserved.", "paper_title": "Applying the archetype approach to the database of a biobank information management system", "paper_id": "WOS:000287231900006"}