{"auto_keywords": [{"score": 0.035520266109269276, "phrase": "proposed_model"}, {"score": 0.00481495049065317, "phrase": "bayesian_compressive_sensing_using_laplace_priors"}, {"score": 0.004260134699483774, "phrase": "model_parameters"}, {"score": 0.004089725258435817, "phrase": "bayesian_framework"}, {"score": 0.003986684503518077, "phrase": "hierarchical_form"}, {"score": 0.003926607257776264, "phrase": "laplace"}, {"score": 0.003769006950727621, "phrase": "unknown_signal"}, {"score": 0.003581412258960711, "phrase": "sparsity_priors"}, {"score": 0.0031360786664165093, "phrase": "existing_models"}, {"score": 0.0031042018721479385, "phrase": "special_cases"}, {"score": 0.002831462722290752, "phrase": "practical_settings"}, {"score": 0.00235560370536971, "phrase": "proposed_algorithm"}, {"score": 0.0022154296909169826, "phrase": "experimental_results"}, {"score": 0.0021049977753042253, "phrase": "state-of-the-art_cs_reconstruction_algorithms"}], "paper_keywords": ["Bayesian methods", " compressive sensing", " inverse problems", " relevance vector machine (RVM)", " sparse Bayesian learning"], "paper_abstract": "In this paper, we model the components of the compressive sensing ( CS) problem, i.e., the signal acquisition process, the unknown signal coefficients and the model parameters for the signal and noise using the Bayesian framework. We utilize a hierarchical form of the Laplace prior to model the sparsity of the unknown signal. We describe the relationship among a number of sparsity priors proposed in the literature, and show the advantages of the proposed model including its high degree of sparsity. Moreover, we show that some of the existing models are special cases of the proposed model. Using our model, we develop a constructive ( greedy) algorithm designed for fast reconstruction useful in practical settings. Unlike most existing CS reconstruction methods, the proposed algorithm is fully automated, i.e., the unknown signal coefficients and all necessary parameters are estimated solely from the observation, and, therefore, no user-intervention is needed. Additionally, the proposed algorithm provides estimates of the uncertainty of the reconstructions. We provide experimental results with synthetic 1-D signals and images, and compare with the state-of-the-art CS reconstruction algorithms demonstrating the superior performance of the proposed approach.", "paper_title": "Bayesian Compressive Sensing Using Laplace Priors", "paper_id": "WOS:000272844000005"}