{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "company_revenue_relations"}, {"score": 0.004583205112737672, "phrase": "online_business_news"}, {"score": 0.00428257928723, "phrase": "news_story"}, {"score": 0.0039281997063335735, "phrase": "intercompany_network"}, {"score": 0.0038561471948364723, "phrase": "social_network_analysis_techniques"}, {"score": 0.0036477941360224435, "phrase": "network_structure"}, {"score": 0.0034935290662899488, "phrase": "machine_learning_methods"}, {"score": 0.0034083145672246067, "phrase": "company_revenue_relation"}, {"score": 0.0030309961956273028, "phrase": "network_structural_attributes"}, {"score": 0.0022670785913397637, "phrase": "private_and_foreign_companies"}, {"score": 0.002225426912273257, "phrase": "financial_data"}], "paper_keywords": ["Web mining", " Revenue comparison", " Social network analysis", " Business news", " Intercompany network"], "paper_abstract": "Large volumes of online business news provide an opportunity to explore various aspects of companies. A news story pertaining to a company often cites other companies. Using such company citations we construct an intercompany network. employ social network analysis techniques to identify a set of attributes from the network structure, and feed the attributes to machine learning methods to predict the company revenue relation (CRR) that is based on two companies' relative quantitative financial data. Hence, we seek to understand the power of network structural attributes in predicting CRRs that are not described in the news or known at the time the news was published. The network attributes produce close to 80% precision, recall, and accuracy for all 87,340 company pairs in the network. This approach is scalable and can be extended to private and foreign companies for which financial data is unavailable or hard to procure. (C) 2009 Elsevier B.V. All rights reserved.", "paper_title": "Discovering company revenue relations from news: A network approach", "paper_id": "WOS:000271549600014"}