{"auto_keywords": [{"score": 0.03696580568183748, "phrase": "large_company"}, {"score": 0.00481495049065317, "phrase": "decision_outcome"}, {"score": 0.004784331242964228, "phrase": "lead_time"}, {"score": 0.00475390577915698, "phrase": "large-scale_requirements_engineering"}, {"score": 0.00437546648278148, "phrase": "important_aspect"}, {"score": 0.004306205029641728, "phrase": "market-driven_requirements_engineering"}, {"score": 0.0042245308336121635, "phrase": "software_companies"}, {"score": 0.004027031316965272, "phrase": "quickly_changing_software_market"}, {"score": 0.00396326346313272, "phrase": "low_decision_lead_time"}, {"score": 0.003925486550801027, "phrase": "resulting_high_decision_efficiency"}, {"score": 0.0038880683136866268, "phrase": "better_understanding"}, {"score": 0.003802135020791801, "phrase": "decision_lead_time"}, {"score": 0.0037062400890170064, "phrase": "possible_factors"}, {"score": 0.0036475333460338397, "phrase": "exploratory_two-stage_case_study"}, {"score": 0.003566897271386661, "phrase": "seven_possible_relationships"}, {"score": 0.003544186382527181, "phrase": "decision_characteristics"}, {"score": 0.0034547746986065345, "phrase": "industry_participants"}, {"score": 0.002954140458190344, "phrase": "change_request"}, {"score": 0.002916618252808186, "phrase": "important_customer"}, {"score": 0.0025830324526904427, "phrase": "valuable_insights"}, {"score": 0.002485813299166851, "phrase": "decision-making_processes"}, {"score": 0.0022013916728990564, "phrase": "potential_change"}, {"score": 0.0021526564019119466, "phrase": "software_components"}, {"score": 0.0021049977753042253, "phrase": "john_wiley"}], "paper_keywords": ["requirements engineering", " decision making", " market-driven requirements engineering", " software product lines"], "paper_abstract": "Lead time, defined as the duration between the moment a request was filed and the moment the decision was made, is an important aspect of decision making in market-driven requirements engineering. Minimizing lead time allows software companies to focus their resources on the most profitable functionality and enables them to remain competitive within the quickly changing software market. Achieving and sustaining low decision lead time and the resulting high decision efficiency require a better understanding of factors that may affect both decision lead time and outcome. In order to identify possible factors, we conducted an exploratory two-stage case study that combines the statistical analysis of seven possible relationships among decision characteristics at a large company with a survey of industry participants. Our results show that the number of products affected by a decision increases the time needed to make a decision. Practitioners should take this aspect into consideration when planning for efficient decision making and possibly reducing the complexity of decisions. Our results also show that when a change request originates from an important customer, the request is more often accepted. The results provide input into the discussion of whether a large company should focus on only a few of its large customers and disregard its significantly larger group of small customers. The results provide valuable insights for researchers, who can use them to plan research of decision-making processes and methods, and for practitioners, who can use them to optimize their decision-making processes. In future work, we plan to investigate other decision characteristics, such as the number of stakeholders involved in the discussion about the potential change or the number of dependencies between software components. Copyright (C) 2015 John Wiley & Sons, Ltd.", "paper_title": "Exploring factors affecting decision outcome and lead time in large-scale requirements engineering", "paper_id": "WOS:000362500800003"}