{"auto_keywords": [{"score": 0.04541485776191827, "phrase": "probabilistic_rough_fuzzy_set"}, {"score": 0.008458210313227152, "phrase": "decision-theoretic_rough_fuzzy_set"}, {"score": 0.0048149513488170165, "phrase": "decision-theoretic"}, {"score": 0.004565007074039171, "phrase": "rough_approximation"}, {"score": 0.00450456611645112, "phrase": "fuzzy_concept"}, {"score": 0.004444921827311577, "phrase": "probabilistic_approximation_space"}, {"score": 0.004270665568018583, "phrase": "conditional_probability"}, {"score": 0.00421410521089045, "phrase": "fuzzy_event"}, {"score": 0.0037043953071235155, "phrase": "precision_probabilistic"}, {"score": 0.0036231402600938323, "phrase": "bayesian"}, {"score": 0.003434662174045939, "phrase": "systematic_method"}, {"score": 0.0031562971707460802, "phrase": "non-parametric_definition"}, {"score": 0.002874726518572154, "phrase": "credit_card_applicant_decision-making_problem"}, {"score": 0.0026771333996253783, "phrase": "main_contribution"}, {"score": 0.002537880772794665, "phrase": "probabilistic_rough_set"}, {"score": 0.002515384834484012, "phrase": "fuzzy_environment"}, {"score": 0.0022806798371116698, "phrase": "probabilistic_rough_fuzzy_set_modeling"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Rough set", " Probabilistic rough fuzzy set", " Decision-theoretic rough fuzzy set"], "paper_abstract": "This article investigates the rough approximation of a fuzzy concept on a probabilistic approximation space. We propose the probabilistic rough fuzzy set by defining the conditional probability of a fuzzy event. Then we establish the model of probabilistic rough fuzzy set and discuss several properties in detail. Furthermore, three generalizations of probabilistic rough fuzzy set, namely, 0.5-probabilistic rough fuzzy set, variable precision probabilistic rough fuzzy set and Bayesian rough fuzzy set are reported. In order to give a systematic method of selecting parameters for the probabilistic rough fuzzy set, we propose a decision-theoretic rough fuzzy set. That is, we formulate a non-parametric definition of the probabilistic rough fuzzy set. Moreover, we illustrate the motivation and verify the validity of the decision-theoretic rough fuzzy set by using a credit card applicant decision-making problem. Furthermore, the interrelationship between the decision-theoretic rough fuzzy set and the probabilistic rough fuzzy set is explained. The main contribution of this paper is twofold. One is to extend the probabilistic rough set to fuzzy environment, i.e., the probabilistic rough fuzzy set model. Another is to present an approach to select parameters needed in probabilistic rough fuzzy set modeling by using the process of decision-making under conditions of risk. (C) 2014 Elsevier Inc. All rights reserved.", "paper_title": "Decision-theoretic rough fuzzy set model and application", "paper_id": "WOS:000341548200013"}