{"auto_keywords": [{"score": 0.037703509080803325, "phrase": "complete_data"}, {"score": 0.015719716506582538, "phrase": "incomplete_information"}, {"score": 0.015131854129309933, "phrase": "test_sample"}, {"score": 0.0099367969738952, "phrase": "incomplete_data"}, {"score": 0.008970945810776097, "phrase": "reliability_threshold"}, {"score": 0.003988055287053139, "phrase": "distributed_sensor_network"}, {"score": 0.0037558704408683905, "phrase": "additional_time"}, {"score": 0.00350696416714684, "phrase": "practical_goal"}, {"score": 0.003432604816716035, "phrase": "class_label"}, {"score": 0.003288567185099276, "phrase": "good_decision"}, {"score": 0.0026199603775129516, "phrase": "random_variable"}, {"score": 0.002553382046204689, "phrase": "current_incomplete_data"}, {"score": 0.0024566655761509276, "phrase": "standard_imputation_strategies"}, {"score": 0.0023434058350520763, "phrase": "classification_decision"}, {"score": 0.0022257833099336858, "phrase": "useful_reliability_estimates"}, {"score": 0.0021692000054033956, "phrase": "imputed_class_labels"}, {"score": 0.0021049977753042253, "phrase": "time-series_data_sets"}], "paper_keywords": ["classification", " sensor networks", " signals", " reliability"], "paper_abstract": "We consider the problem of classifying a test sample given incomplete information. This problem arises naturally when data about a test sample is collected over time, or when costs must be incurred to compute the classification features. For example, in a distributed sensor network only a fraction of the sensors may have reported measurements at a certain time, and additional time, power, and bandwidth is needed to collect the complete data to classify. A practical goal is to assign a class label as soon as enough data is available to make a good decision. We formalize this goal through the notion of reliability-the probability that a label assigned given incomplete data would be the same as the label assigned given the complete data, and we propose a method to classify incomplete data only if some reliability threshold is met. Our approach models the complete data as a random variable whose distribution is dependent on the current incomplete data and the (complete) training data. The method differs from standard imputation strategies in that our focus is on determining the reliability of the classification decision, rather than just the class label. We show that the method provides useful reliability estimates of the correctness of the imputed class labels on a set of experiments on time-series data sets, where the goal is to classify the time-series as early as possible while still guaranteeing that the reliability threshold is met.", "paper_title": "Classifying With Confidence From Incomplete Information", "paper_id": "WOS:000335457100003"}