{"auto_keywords": [{"score": 0.041996689288621714, "phrase": "virtual_words"}, {"score": 0.03768809919116057, "phrase": "time_lines"}, {"score": 0.009785184062741703, "phrase": "temporal_relationships"}, {"score": 0.00703268184016045, "phrase": "feature_points"}, {"score": 0.005592495380698625, "phrase": "different_data_visualization"}, {"score": 0.005535788896969133, "phrase": "analysis_purposes"}, {"score": 0.004598933498016774, "phrase": "time_line_visualization_approach"}, {"score": 0.004260134699483774, "phrase": "different_shapes"}, {"score": 0.003509006038574667, "phrase": "sampled_time_steps"}, {"score": 0.003438058620195309, "phrase": "temporal_sequence"}, {"score": 0.0031360786664165093, "phrase": "feature_descriptors"}, {"score": 0.0030414140732789186, "phrase": "data_properties"}, {"score": 0.002934566917795928, "phrase": "representative_vectors"}, {"score": 0.0022267859286766553, "phrase": "overall_temporal_relationships"}], "paper_keywords": ["Time line", " Virtual words", " Feature description", " Time-varying data visualization"], "paper_abstract": "This paper presents a time line visualization approach, which allows users to study temporal relationships through encoding their interested data properties to time lines with different shapes and locations. Specifically, our approach extracts key data features as virtual words and uses them to encode various data properties. The distributions of virtual words across time are further applied to study various temporal relationships by generating time lines, which renders sampled time steps as points and temporal sequence as a line. Our approach consists of the three following components. First, we select feature points and collect feature descriptors to build a space of data properties, where virtual words are extracted as representative vectors. Second, the virtual words are applied to characterize feature points and their distribution statistics are used to measure temporal relationships. Third, we demonstrate several methods to visualize time lines flexibly for different data visualization and analysis purposes. We present several case studies to visualize time lines for different data visualization and analysis purposes. Our time line visualization can be used for both summarization and exploration of overall temporal relationships. We demonstrate with examples that time lines can serve as effective exploration, comparison, and visualization tools to study time-varying datasets. (C) 2013 Elsevier Ltd. All rights reserved.", "paper_title": "Visualization and analysis of 3D time-varying simulations with time lines", "paper_id": "WOS:000326430700007"}