{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "balloon_drawing"}, {"score": 0.007694754508317115, "phrase": "rooted_trees"}, {"score": 0.0061786236658427866, "phrase": "internal_node"}, {"score": 0.004076533120753605, "phrase": "tree_drawings"}, {"score": 0.003957078581524691, "phrase": "desirable_feature"}, {"score": 0.003921926812074958, "phrase": "tree_structures"}, {"score": 0.0038870860864224656, "phrase": "rather_balanced_fashion"}, {"score": 0.002608583927848071, "phrase": "comprehensive_complexity_analysis"}, {"score": 0.0025853800975668946, "phrase": "balloon_drawings"}, {"score": 0.0025395882359574005, "phrase": "angular_resolution"}, {"score": 0.002524504774013978, "phrase": "aspect_ratio"}, {"score": 0.002509510672395393, "phrase": "standard_deviation"}, {"score": 0.0024213933464338885, "phrase": "even_or_uneven_sub-wedge_type"}, {"score": 0.002281523632532762, "phrase": "np"}, {"score": 0.0022209780222461587, "phrase": "polynomial_time"}, {"score": 0.002188136252410142, "phrase": "approximation_algorithms"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Tree drawing", " Graph drawing", " Graph algorithms"], "paper_abstract": "In a balloon drawing of a tree, all the children under the same parent are placed on the circumference of the circle centered at their parent, and the radius of the circle centered at each node along any path from the root reflects the number of descendants associated with the node. Among various styles of tree drawings reported in the literature, the balloon drawing enjoys a desirable feature of displaying tree structures in a rather balanced fashion. For each internal node in a balloon drawing, the ray from the node to each of its children divides the wedge accommodating the subtree rooted at the child into two sub-wedges. Depending on whether the two sub-wedge angles are required to be identical or not, a balloon drawing can further be divided into two types: even sub-wedge and uneven sub-wedge types. In the most general case, for any internal node in the tree there are two dimensions of freedom that affect the quality of a balloon drawing: (1) altering the order in which the children of the node appear in the drawing, and (2) for the subtree rooted at each child of the node, flipping the two sub-wedges of the subtree. In this paper, we give a comprehensive complexity analysis for optimizing balloon drawings of rooted trees with respect to angular resolution, aspect ratio and standard deviation of angles under various drawing cases depending on whether the tree is of even or uneven sub-wedge type and whether (1) and (2) above are allowed. It turns out that some are NP-complete while others can be solved in polynomial time. We also derive approximation algorithms for those that are intractable in general. (c) 2010 Elsevier B.V. All rights reserved.", "paper_title": "Complexity analysis of balloon drawing for rooted trees", "paper_id": "WOS:000286862100015"}