{"auto_keywords": [{"score": 0.049750469707859776, "phrase": "shared_outcomes"}, {"score": 0.03767880802723059, "phrase": "workgroup_outcomes"}, {"score": 0.029718087428758862, "phrase": "shared_workgroup_outcomes"}, {"score": 0.00481495049065317, "phrase": "workgroups"}, {"score": 0.004749106104067268, "phrase": "dea._workgroups_consist"}, {"score": 0.0045726187330434025, "phrase": "common_goals"}, {"score": 0.004463723624910583, "phrase": "marketing_units"}, {"score": 0.00443308765153716, "phrase": "production_cells"}, {"score": 0.0044026610128451256, "phrase": "factory_floors"}, {"score": 0.0036553070575015344, "phrase": "research_publications"}, {"score": 0.003435426082776884, "phrase": "university's_reputation"}, {"score": 0.0029214769181390653, "phrase": "data_envelopment_analysis"}, {"score": 0.002901412733792239, "phrase": "dea"}, {"score": 0.0028321862184182913, "phrase": "credit_portions"}, {"score": 0.002467140591777737, "phrase": "higher_priority"}, {"score": 0.002302619021497886, "phrase": "shared_outcome_credit"}, {"score": 0.0021864526544323184, "phrase": "cooperation_motivation"}, {"score": 0.0021639307835832136, "phrase": "numerical_example"}, {"score": 0.0021049977753042253, "phrase": "proposed_models"}], "paper_keywords": ["DEA", " workgroup", " shared outcome", " cooperation motivation"], "paper_abstract": "Workgroups consist of employees who are interdependent and work together to achieve common goals. For example, employees in marketing units, production cells on factory floors, and schools/departments in universities are often expected to collaborate with each other, and share knowledge, skills, and experiences to enhance the productivity and performance of the workgroups. While a workgroup's outcomes/outputs can be a sum of each individual or employee's output/outcome (for example, the number of research publications), there are shared workgroup outcomes that are a result of many individuals' performance, for example, an University's reputation. In other words, the outputs of a workgroup can be classified into two categories: individual workgroup outputs and shared workgroup outcomes. The objective of this paper is to study how shared workgroup' outcomes/outputs can be accounted when we evaluate the performance of individuals in the workgroup. Using data envelopment analysis (DEA), we propose several models to credit portions of the shared workgroup outcomes to the individuals based upon (i) outcome linkage where the outcome of one employee's task is influenced by that of another, and (ii) priority information, where an employee (e.g., workgroup leader) has a higher priority to get the credits from the shared workgroup outcomes. We examine how the efficiencies of employees are affected by the shared outcome credit. We discuss how the credit of shared outcomes affects the efficiencies of employees and cooperation motivation. A numerical example is provided to illustrate and justify the proposed models.", "paper_title": "Performance Evaluation of Individuals in Workgroups with Shared Outcomes Using DEA", "paper_id": "WOS:000371048800003"}