{"auto_keywords": [{"score": 0.0482117522215884, "phrase": "bdb"}, {"score": 0.009247253256844546, "phrase": "binary_and_multiple_stars"}, {"score": 0.004814985887072914, "phrase": "vo"}, {"score": 0.0046683172874085015, "phrase": "binary_star_database"}, {"score": 0.004407690586271672, "phrase": "binary_and_multiple_systems"}, {"score": 0.0043496334756644535, "phrase": "observational_types"}, {"score": 0.004124920849728372, "phrase": "physical_and_positional_parameters"}, {"score": 0.0035648266669315943, "phrase": "heterogeneous_sources"}, {"score": 0.0035178323426661626, "phrase": "astronomical_catalogues"}, {"score": 0.0033805214040814233, "phrase": "effective_managing"}, {"score": 0.003306559295382181, "phrase": "binary_stars"}, {"score": 0.003163439005885435, "phrase": "careful_cross-identification"}, {"score": 0.0030264946886983833, "phrase": "star_identifier"}, {"score": 0.002733539375462443, "phrase": "single_stars"}, {"score": 0.0023724065150232897, "phrase": "identification_list_of_binaries"}, {"score": 0.0022396694076443446, "phrase": "bdb_request_processing"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Astronomical databases", " Binary stars", " Virtual observatory"], "paper_abstract": "Description of the Binary star DataBase (BDB, http://bdb.inasansu), the world's principal database of binary and multiple systems of all observational types, is presented in the paper. BDB contains data on physical and positional parameters of 240,000 components of 110,000 systems of multiplicity 2 and more, belonging to various observational types: visual, spectroscopic, eclipsing, etc. Information on these types of binaries is obtained from heterogeneous sources of data astronomical catalogues and surveys. BDB provides a tool for effective managing of the catalogues of binary stars into the IVO. Organization of the information is based on the careful cross-identification of the objects. BDB can be queried by star identifier, coordinates, and other parameters. To solve the problem of cross-identification which for binary and multiple stars is much more complicated than for single stars, a new consistent scheme for identification of objects in binary and multiple stars, BSDB (Binary Star DataBase), is developed and implemented. The list of all binary and multiple stars cross-identifiers (preliminarily named Identification List of Binaries, ILB) is being created and will be used to improve BDB request processing. IVO standards implementation into BDB is discussed. (C) 2015 Elsevier B.V. All rights reserved.", "paper_title": "Binary star DataBase BDB development: Structure, algorithms, and VO standards implementation", "paper_id": "WOS:000356546900007"}