{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "virtual_architecture"}, {"score": 0.004263972370406983, "phrase": "continuous_and_open_process"}, {"score": 0.003614044704141927, "phrase": "design_process"}, {"score": 0.003392507399258166, "phrase": "finished_architectural_product"}, {"score": 0.0030778231027679434, "phrase": "findings_-_a_set"}, {"score": 0.002778682854371595, "phrase": "cyberarchitecture's_embryonic_feasibility"}, {"score": 0.00259554612218815, "phrase": "finished_products"}, {"score": 0.002424450174817922, "phrase": "usual_cybernetics_approach"}, {"score": 0.0022101055924375725, "phrase": "architecture's_intrinsic_value"}, {"score": 0.0021049977753042253, "phrase": "process-based_system"}], "paper_keywords": ["design process", " virtual", " user autonomy", " interface", " anarchy", " process-oriented design"], "paper_abstract": "Purpose - This paper aims to discuss the possibility of joining cybernetics and architecture as a continuous and open process, bridging design, construction and use, in that which is called cyberarchitecture. Design/methodology/approach - It develops the hypothesis that cyberarchitecture can benefit from taking the virtual into account in the design process, so that the architect is no longer the author of a finished architectural product, but of a set of instruments with which users can design, build and use their own environments simultaneously. Findings - A set of design principles is systematised and examined in three practical realms of design: urban, building, and relational, showing cyberarchitecture's embryonic feasibility. Practical implications - Cyberarchitecture implies that architects are no longer authors of finished products and users, becoming designers of their own spaces. Originality/value - Cyberarchitecture avoids the usual cybernetics approach based on control-system, indicating a less predictive and, ultimately, anarchic path for architects and users. It focuses on architecture's intrinsic value as an event, indicating the possibility of a process-based system, which only exists (or is organised) in present-time, when users and instruments (or structures) interact.", "paper_title": "Towards a virtual architecture: pushing cybernetics from government to anarchy", "paper_id": "WOS:000251883500006"}