{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "intra-cochlear_anatomy"}, {"score": 0.01975547178446448, "phrase": "post-implantation_ct"}, {"score": 0.011538561472370975, "phrase": "electrode_array"}, {"score": 0.005701427147846399, "phrase": "pre-implantation_ct"}, {"score": 0.004755723591767513, "phrase": "unilateral_cochlear_implant_recipients"}, {"score": 0.004711779740073973, "phrase": "cochlear_implant"}, {"score": 0.00468276979272935, "phrase": "ci"}, {"score": 0.004625100791402994, "phrase": "neural_prosthetic_device"}, {"score": 0.0045119929871912405, "phrase": "auditory_nerve"}, {"score": 0.004347473906950474, "phrase": "cl_surgery"}, {"score": 0.00411182818527434, "phrase": "internal_structures"}, {"score": 0.0039864558878074064, "phrase": "final_position"}, {"score": 0.0037586442197443375, "phrase": "electrode_array_position"}, {"score": 0.0036553070575015344, "phrase": "post-implantation_ct."}, {"score": 0.0033828748627992193, "phrase": "relative_electrode_array_position_information"}, {"score": 0.0032593915869553714, "phrase": "ci_programming_technique"}, {"score": 0.0032292292848296617, "phrase": "patient-specific_spatial_information"}, {"score": 0.003199345207727474, "phrase": "patient-customized_sound_processing_strategies"}, {"score": 0.0028704174214048937, "phrase": "automatic_segmentation"}, {"score": 0.002748491671688731, "phrase": "pre-implantation_cts"}, {"score": 0.0026317312518257803, "phrase": "implanted_ear"}, {"score": 0.0025832180231667853, "phrase": "normal_contralateral_ear"}, {"score": 0.0025434724309942986, "phrase": "intra-subject_symmetry"}, {"score": 0.002303154778441723, "phrase": "maximum_segmentation_errors"}, {"score": 0.002178074693316872, "phrase": "patient-customized_ci_sound_processing_strategies"}], "paper_keywords": ["Cochlear implant", " Cochlear implant programming", " Image registration", " Surface-to-image registration", " Statistical shape model"], "paper_abstract": "A cochlear implant (CI) is a neural prosthetic device that restores hearing by directly stimulating the auditory nerve using an electrode array that is implanted in the cochlea. In Cl surgery, the surgeon accesses the cochlea and makes an opening where he/she inserts the electrode array blind to internal structures of the cochlea. Because of this, the final position of the electrode array relative to intra-cochlear anatomy is generally unknown. We have recently developed an approach for determining electrode array position relative to intra-cochlear anatomy using a pre- and a post-implantation CT. The approach is to segment the intra-cochlear anatomy in the pre-implantation CT, localize the electrodes in the post-implantation CT, and register the two CTs to determine relative electrode array position information. Currently, we are using this approach to develop a CI programming technique that uses patient-specific spatial information to create patient-customized sound processing strategies. However, this technique cannot be used for many CI users because it requires a pre-implantation CT that is not always acquired prior to implantation. In this study, we propose a method for automatic segmentation of intra-cochlear anatomy in post-implantation CT of unilateral recipients, thus eliminating the need for pre-implantation CTs in this population. The method is to segment the intra-cochlear anatomy in the implanted ear using information extracted from the normal contralateral ear and to exploit the intra-subject symmetry in cochlear anatomy across ears. To validate our method, we performed experiments on 30 ears for which both a pre- and a post-implantation CT are available. The mean and the maximum segmentation errors are 0.224 and 0.734 mm, respectively. These results indicate that our automatic segmentation method is accurate enough for developing patient-customized CI sound processing strategies for unilateral Cl recipients using a post-implantation CT alone. (C) 2014 Elsevier B.V. All rights reserved.", "paper_title": "Automatic segmentation of intra-cochlear anatomy in post-implantation CT of unilateral cochlear implant recipients", "paper_id": "WOS:000335101300014"}