{"auto_keywords": [{"score": 0.04674469131400006, "phrase": "mobile_nodes"}, {"score": 0.015719716506582538, "phrase": "urban_districts"}, {"score": 0.014158587719513087, "phrase": "upl"}, {"score": 0.013564905806393577, "phrase": "location_landmarks"}, {"score": 0.012273483938206427, "phrase": "mobile_node"}, {"score": 0.0047006879240764935, "phrase": "opportunistic_ad_hoc_localization_algorithm"}, {"score": 0.0043738432231020885, "phrase": "design_principles"}, {"score": 0.004030695216899165, "phrase": "deployment-cost_constraints"}, {"score": 0.0036611708297251645, "phrase": "location_information"}, {"score": 0.0026523079380037706, "phrase": "movable_areas"}, {"score": 0.0023743009016047424, "phrase": "node's_area"}, {"score": 0.0023178219772486868, "phrase": "experimental_results"}, {"score": 0.0021356322417874106, "phrase": "radio_range"}], "paper_keywords": ["Mobile ad hoc networks", " range-free localization", " urban pedestrians"], "paper_abstract": "We propose an opportunistic ad hoc localization algorithm called Urban Pedestrians Localization (UPL), for estimating locations of mobile nodes in urban districts. The design principles of UPL are twofold. First, we assume that location landmarks are deployed sparsely due to deployment-cost constraints. Thus, most mobile nodes cannot expect to meet these location landmarks frequently. Each mobile node in UPL relies on location information received from its neighboring mobile nodes instead in order to estimate its area of presence in which the node is expected to exist. Although the area of presence of each mobile node becomes inexact as it moves, it can be used to reduce the areas of presence of the others. Second, we employ information about obstacles such as walls, and present an algorithm to calculate the movable areas of mobile nodes considering obstacles for predicting the area of presence of mobile nodes accurately under mobility. This also helps to reduce each node's area of presence. The experimental results have shown that UPL could be limited to 0.7r positioning error in average, where r denotes the radio range by the above two ideas.", "paper_title": "UPL: Opportunistic Localization in Urban Districts", "paper_id": "WOS:000319407200016"}