{"auto_keywords": [{"score": 0.04986550127472946, "phrase": "csr"}, {"score": 0.006802417701484643, "phrase": "systems_theory"}, {"score": 0.005158911043302819, "phrase": "human_personality"}, {"score": 0.0049007207904581155, "phrase": "csr_concept"}, {"score": 0.00481495049065317, "phrase": "corporate_social_responsibility"}, {"score": 0.004750873844061641, "phrase": "essential_topic"}, {"score": 0.004344855841195913, "phrase": "modern_diversity"}, {"score": 0.004325487452170154, "phrase": "systems_theories"}, {"score": 0.004127237939923825, "phrase": "dialectical_systems_theory"}, {"score": 0.004009074013302036, "phrase": "seven_principal_groups"}, {"score": 0.0038424081174977115, "phrase": "requisite_holism"}, {"score": 0.003601235776892337, "phrase": "indirect_field"}, {"score": 0.0035137550804411302, "phrase": "rather_soft_topic"}, {"score": 0.003474694300991964, "phrase": "holistic_treatment"}, {"score": 0.0032638170723261507, "phrase": "systems-oriented_perspective"}, {"score": 0.0032420012763830874, "phrase": "dst"}, {"score": 0.002977835845437357, "phrase": "social_aspects"}, {"score": 0.002797028039132224, "phrase": "narrow_habit"}, {"score": 0.002722930209707764, "phrase": "hard-systemic_and_soft-systemic_versions"}, {"score": 0.0024456085562162676, "phrase": "requisitely_holistic_performance"}, {"score": 0.0024075916292945715, "phrase": "diversified_needs"}, {"score": 0.0023281003994670714, "phrase": "research_findings"}, {"score": 0.002241171326888997, "phrase": "different_stakeholders"}, {"score": 0.0022311596751824416, "phrase": "broader_public_audience"}, {"score": 0.0022162258057129513, "phrase": "governmental_institutions"}, {"score": 0.002162316557411786, "phrase": "theoretical_foundation"}, {"score": 0.002138246854055732, "phrase": "socially_responsible_activities"}, {"score": 0.0021191837349881517, "phrase": "maturing_management_philosophy"}], "paper_keywords": ["social responsibility", " cybernetics", " systems theory"], "paper_abstract": "Purpose - The corporate social responsibility (CSR) is an essential topic of both life and sociocybernetics. It requires businesspersons and other decision makers to be broad and hence to apply inter-disciplinarity incorporating many, mutually partly different and therefore interdependent, viewpoints for requisite holism. To do so, they should use systems thinking. But the modern diversity of systems theories, including cybernetics, opens the issue: which systems theory and/or cybernetic should one use? Aims to discuss the dialectical systems theory (DST), its definition of holism and its definition of the seven principal groups of notions making systems thinking possible, when applied in a synergy. This may lead to a requisite holism, and hence to efficiency and effectiveness of the work on and of the CSR; it has often been done so in the 30 years of DST. Design/methodology/approach - Desk research and indirect field research were used. The concept of CSR is a rather soft topic. It demands a holistic treatment and hence a plural theoretical foundation following recent trends in economics (business and environmental), management as well as systems thinking. The problem was investigated empirically from the systems-oriented perspective supported by DST, because it tackles human personality and impacts over it and by it, rather than offers tools for people to use for whatever purposes. Findings - The CSR concept belongs in sociocyberbetics; linking cybernetics, systems theory and social aspects of the reality. The definition of CSR requires humans to think, decide, and act on a very broad basis rather than to reduce their horizons to the narrow habit of businesses to find profit only essential. CSR links the hard-systemic and soft-systemic versions of modem systems theories. It could be seen as an attribute of human personality and as a process between humans and organisations. Research limitations/implications - As CSR has many dimensions (economic, environmental and social ones, at least), the research focused on the requisitely holistic performance of an organisation being aware of diversified needs of multi-stakeholders (including its own employees, as well). Practical implications - The research findings and conclusions can support endeavors to implement the CSR concept in practice: in organisations, among different stakeholders and broader public audience (including governmental institutions and communities). Originality/value - The paper provides the theoretical foundation to raise and improve socially responsible activities by supporting a maturing management philosophy approaching the viable, balanced organisation.", "paper_title": "Corporate social responsibility from the viewpoint of systems thinking", "paper_id": "WOS:000238081100014"}