{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "algebraic_immunity"}, {"score": 0.010148094243968278, "phrase": "boolean_function"}, {"score": 0.004276306563103443, "phrase": "nonconstant_boolean_function"}, {"score": 0.004224130367280183, "phrase": "low_algebraic_degree"}, {"score": 0.0041555469216463855, "phrase": "lower_bounds"}, {"score": 0.003956379470617348, "phrase": "inversion_operation"}, {"score": 0.0037667216301666196, "phrase": "larger_classes"}, {"score": 0.003470543198694293, "phrase": "tr-n"}, {"score": 0.0031714880645482496, "phrase": "close_enough_to_the_previously_obtained_upper_bound_left_perpendicular_root"}, {"score": 0.0030317376771013703, "phrase": "perpendicular_root"}, {"score": 0.0028744731986533076, "phrase": "polynomial_algorithm"}, {"score": 0.0028161764476743257, "phrase": "trace_form"}, {"score": 0.002202123699556382, "phrase": "generating_set"}, {"score": 0.0021049977753042253, "phrase": "boolean_variables"}], "paper_keywords": [""], "paper_abstract": "The algebraic immunity of a Boolean function is a parameter that characterizes the possibility to bound this function from above or below by a nonconstant Boolean function of a low algebraic degree. We obtain lower bounds on the algebraic immunity for a class of functions expressed through the inversion operation in the field GF(2(n)), as well as for larger classes of functions defined by their trace forms. In particular, for n >= 5, the algebraic immunity of the function Tr-n (x(-1)) has a lower bound left perpendicular 2 root n + 4 right perpendicular - 4, which is close enough to the previously obtained upper bound left perpendicular root n right perpendicular + inverted right perpendicular root n/ left perpendicular root n right perpendicular inverted left perpendicular - 2. We obtain a polynomial algorithm which, give a trace form of a Boolean function f, computes generating sets of functions of degree <= d for the following pair of spaces. Each function of the first (linear) space bounds f from below, and each function of the second (affine) space bounds f from above. Moreover, at the output of the algorithm, each function of a generating set is represented both as its trace form and as a polynomial of Boolean variables.", "paper_title": "Some Lower Bounds on the Algebraic Immunity of Functions Given by Their Trace Forms", "paper_id": "WOS:000260150400007"}