{"auto_keywords": [{"score": 0.015570195150470633, "phrase": "collision_detection"}, {"score": 0.011187926385670075, "phrase": "rotating_cutter"}, {"score": 0.00481495049065317, "phrase": "single_camera"}, {"score": 0.004722791767189843, "phrase": "machining_simulation"}, {"score": 0.004610058444728656, "phrase": "rotating_cutters"}, {"score": 0.004165105357908494, "phrase": "new_method"}, {"score": 0.0035336109352157763, "phrase": "machine_tool"}, {"score": 0.003070996252787868, "phrase": "imaged_cutter"}, {"score": 0.002869793011316547, "phrase": "circular_cross-sections"}, {"score": 0.002814759530655965, "phrase": "complete_generating_function"}, {"score": 0.00249386680748172, "phrase": "generating_function"}, {"score": 0.0024578987081792405, "phrase": "spindle_axis"}, {"score": 0.0023644936731468252, "phrase": "proposed_method"}], "paper_keywords": ["Cutting tools", " Surface of revolution", " Single view reconstruction"], "paper_abstract": "Collision detection by machining simulation requires the 3D models of rotating cutters. However, the 3D models of a cutter and holder are not always available. In this paper, a new method is proposed to design an automatic vision-based 3D modeling system, which is able to quickly reconstruct the 3D model of a cutter and holder when they are installed onto the spindle. Only a single camera is mounted on the machine tool to capture the image of the rotating cutter and holder. By viewing the rotating cutter and holder as an object of surface of revolution, the contour of the imaged cutter and holder can be used to reconstruct the 3D model as a stack of circular cross-sections. Then the complete generating function of the cutter and holder can be recovered from the cross-sections. Finally, the 3D model of the cutter is built by rotating the generating function around the spindle axis. The effectiveness and accuracy of the proposed method are verified by experiments on-machine using 12 kinds of cutters and holders, which can satisfy the requirement of collision detection. (c) 2010 Elsevier B.V. All rights reserved.", "paper_title": "Automatic 3D model reconstruction of cutting tools from a single camera", "paper_id": "WOS:000280907900010"}