{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "social_goals"}, {"score": 0.006129116137234741, "phrase": "social_learning"}, {"score": 0.004581162468419365, "phrase": "organizational_goals"}, {"score": 0.004446349752828045, "phrase": "open_and_transparent_manner"}, {"score": 0.004337028108577593, "phrase": "social_objects"}, {"score": 0.004251500979153001, "phrase": "formal_and_informal_collaboration"}, {"score": 0.0034146585649631692, "phrase": "different_presentations"}, {"score": 0.003044785536429499, "phrase": "stated_objective"}, {"score": 0.0027557911038816256, "phrase": "goal_comprehension"}, {"score": 0.0026745503978347143, "phrase": "examined_presentations"}, {"score": 0.0024693979425773993, "phrase": "overall_comprehension"}, {"score": 0.0024327171018928458, "phrase": "organization's_goals"}, {"score": 0.00239657981537094, "phrase": "positive_effect"}], "paper_keywords": ["Goal management", " organizational goals", " social goals", " social learning in organization", " visualization of goals"], "paper_abstract": "The concept of social goals refers to organizational goals that are defined in an open and transparent manner; they serve as social objects that incite both formal and informal collaboration around shared interests/objectives. Our objective is to facilitate the comprehension of social goals and examine the role of social goals as scaffolds of social learning in an organization. To this end, we followed an approach based on the visualization of social goals and explored how different presentations of goals, specifically, faceted goal browsing, graph-based visualization, and timeline-based visualization, contribute to the realization of the stated objective. To assess this approach, we conducted a between subjects study where each participant performed a set of goal comprehension tasks with one of the examined presentations of goals. The study demonstrated that our visualizations of goals increase the accuracy of the overall comprehension of an organization's goals; this positive effect is also present when the comprehension of relationships-either explicit or implicit ties-among social goals is needed. The results also confirmed that our graph-based visualization of social goals could serve as a facilitator of social learning in an organization.", "paper_title": "Comprehension and Learning of Social Goals Through Visualization", "paper_id": "WOS:000358301800007"}