{"auto_keywords": [{"score": 0.04650334340899582, "phrase": "geopolitical_boundaries"}, {"score": 0.00656473751677862, "phrase": "physical_discontinuities"}, {"score": 0.00481495049065317, "phrase": "dynamic_boundaries"}, {"score": 0.004773692073488661, "phrase": "geopolitical_entities"}, {"score": 0.004692227830462433, "phrase": "dolce."}, {"score": 0.004213519983188574, "phrase": "semantic_web"}, {"score": 0.0041773934798743405, "phrase": "previous_work"}, {"score": 0.004001335931796133, "phrase": "bona_fide"}, {"score": 0.003933000051147382, "phrase": "dynamic_categories"}, {"score": 0.003799796252156605, "phrase": "bona_fide_geopolitical_boundaries"}, {"score": 0.003546722347907148, "phrase": "maritime_territorial_claims"}, {"score": 0.003310447652300423, "phrase": "necessary_ontological_distinction"}, {"score": 0.0029214769181390653, "phrase": "descriptive_ontology"}, {"score": 0.0028963961037320805, "phrase": "linguistic_and_cognitive_engineering"}, {"score": 0.0028346295900142367, "phrase": "dolce"}, {"score": 0.0027982016314450717, "phrase": "cognitive_bias"}, {"score": 0.002680114113899346, "phrase": "mind-dependent_geopolitical_entities"}, {"score": 0.002437525632451029, "phrase": "direct_spatial_qualities"}, {"score": 0.0021049977753042253, "phrase": "\"common_sense"}], "paper_keywords": ["State", " boundary", " territory", " DOLCE", " nation"], "paper_abstract": "The purpose of this article is to reexamine the ontology of geopolitical boundaries so that they can be better represented in ontologies designed for the semantic web. Previous work on this subject has divided geopolitical boundaries into fiat, bona fide, and force dynamic categories. This article challenges the existence of bona fide geopolitical boundaries on the basis that many of them lie skew to physical discontinuities on the earth, maritime territorial claims do not follow physical discontinuities, and geopolitical boundaries are three-dimensional, not two-dimensional objects. This also allows for a necessary ontological distinction to be made between the geopolitical boundaries and their physical markers. This analysis is used to determine the placement of geopolitical boundaries, territory, states, and nations in the Descriptive Ontology for Linguistic and Cognitive Engineering (DOLCE). DOLCE has a cognitive bias making it particularly suitable for formulating an ontology of mind-dependent geopolitical entities. However, rather than distinguishing between the physical and nonphysical based on whether or not the entity in question has direct spatial qualities, this article puts forward that a distinction needs to be made based on whether or not an entity in question is made of matter. A material/immaterial distinction may be more intuitive for an ontology of \"common sense\".", "paper_title": "Reexamining fiat, bona fide and force dynamic boundaries for geopolitical entities and their placement in DOLCE", "paper_id": "WOS:000300103400003"}