{"auto_keywords": [{"score": 0.04073959057822079, "phrase": "minimum_number"}, {"score": 0.030953917782008802, "phrase": "fpt"}, {"score": 0.030224280626492118, "phrase": "solution_size"}, {"score": 0.00481495049065317, "phrase": "minimum_label_problems"}, {"score": 0.0046986841646790315, "phrase": "parameterized_complexity"}, {"score": 0.004474468584252318, "phrase": "undirected_graph"}, {"score": 0.004037694641919865, "phrase": "property_pi"}, {"score": 0.003385480888810982, "phrase": "used_labels"}, {"score": 0.003130396338031522, "phrase": "small_constant"}, {"score": 0.0030696773722514105, "phrase": "positive_side"}, {"score": 0.002729246328390722, "phrase": "sought_edge"}, {"score": 0.0025860636370864084, "phrase": "maximum_matching"}, {"score": 0.002232519579957707, "phrase": "interesting_algorithmic_methods"}, {"score": 0.0021050078068387433, "phrase": "elsevier"}], "paper_keywords": ["Edge labeled graphs", " W-hardness", " Fixed-parameter tractability"], "paper_abstract": "We study the parameterized complexity of several minimum label graph problems, in which we are given an undirected graph whose edges are labeled, and a property Pi, and we are asked to find a subset of edges satisfying property Pi with respect to G that uses the minimum number of labels. These problems have a lot of applications in networking. We show that all the problems under consideration are W[2]-hard when parameterized by the number of used labels, and that they remain W[2]-hard even on graphs whose pathwidth is bounded above by a small constant. On the positive side, we prove that most of these problems are FPT when parameterized by the solution size, that is, the size of the sought edge set. For example, we show that computing a maximum matching or an edge dominating set that uses the minimum number of labels, is FPT when parameterized by the solution size. Proving that some of these problems are FPT requires interesting algorithmic methods that we develop in this paper. (C) 2010 Elsevier inc. All rights reserved.", "paper_title": "The parameterized complexity of some minimum label problems", "paper_id": "WOS:000281501900003"}