{"auto_keywords": [{"score": 0.04227643432381138, "phrase": "disordered_proteins"}, {"score": 0.00481495049065317, "phrase": "protein_disorder_over_large_datasets."}, {"score": 0.004132411680987228, "phrase": "systematic_overestimation"}, {"score": 0.003580355398511932, "phrase": "low_precision"}, {"score": 0.0033806943112103397, "phrase": "genome-wide_surveys"}, {"score": 0.0033166379485150507, "phrase": "different_predictors"}, {"score": 0.0032074366230426727, "phrase": "individual_proteins"}, {"score": 0.0030140547908298404, "phrase": "simple_procedure"}, {"score": 0.002928765962664163, "phrase": "precision-recall_curves"}, {"score": 0.00283229915062791, "phrase": "discriminative_thresholds"}, {"score": 0.002661474607275484, "phrase": "cured_dataset"}, {"score": 0.0023613185213421173, "phrase": "dedicated_study"}, {"score": 0.002327648608736437, "phrase": "human_proteome"}, {"score": 0.0022725931637071852, "phrase": "cancer-related_human_proteins"}, {"score": 0.00220823903315848, "phrase": "simple_quantitative_estimates"}, {"score": 0.0021252533072727707, "phrase": "cancer-related_proteins"}], "paper_keywords": ["Intrinsically disordered proteins", " disorder predictors", " precision recall curves"], "paper_abstract": "This is a study on the precision of four known protein disorder predictors, ranked among the best-performing ones: DISOPRED2, PONDR VSL2B, IUPred and ESpritz. We address here the problem of a systematic overestimation of the number of disordered proteins recognized through the use of these predictors, considered as a standard. Some of these predictors, used with their default setting, have a low precision, implying a tendency to overestimate the occurrence of disordered proteins in genome-wide surveys. Moreover, different predictors often disagree on the evaluation of individual proteins. To cope with this problem and in order to propose a simple procedure that enhances precision based on precision-recall curves, we re-tuned the discriminative thresholds of the predictors by training and cross-validating their performance on a cured dataset. After re-tuning, both the disagreement among predictors and the tendency to overestimate the occurrence of disordered proteins are reduced. This is shown in a dedicated study over the human proteome and a set of cancer-related human proteins, with no a priori disorder annotation. Simple quantitative estimates suggest that the occurrence of disorder among cancer-related proteins and other similar large-scale surveys has been overestimated in the past.", "paper_title": "TUNING THE PRECISION OF PREDICTORS TO REDUCE OVERESTIMATION OF PROTEIN DISORDER OVER LARGE DATASETS", "paper_id": "WOS:000321005100010"}