{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "close_contact"}, {"score": 0.04966447721457641, "phrase": "human_motion_indexing"}, {"score": 0.040311165065088146, "phrase": "multiple_characters"}, {"score": 0.004225950334493496, "phrase": "previous_researches"}, {"score": 0.004099183062034004, "phrase": "euclidean_distance"}, {"score": 0.004063664475797303, "phrase": "joint_angles"}, {"score": 0.004028452405970376, "phrase": "joint_positions"}, {"score": 0.003399466007862412, "phrase": "topology-based_approach"}, {"score": 0.003062091606343783, "phrase": "rational_tangles"}, {"score": 0.0030223381739019894, "phrase": "encoded_relationships"}, {"score": 0.0029443683459283955, "phrase": "tanglelist"}, {"score": 0.0023990982005125763, "phrase": "motion_database"}, {"score": 0.0023168823213024856, "phrase": "motion_graph_structures"}, {"score": 0.0021987994275190314, "phrase": "topologically_similar_postures"}, {"score": 0.0021797112385590913, "phrase": "motion_clips"}, {"score": 0.0021049977753042253, "phrase": "computer_animation"}], "paper_keywords": ["Content-based retrieval", " character animation", " human motion"], "paper_abstract": "Human motion indexing and retrieval is important for animators due to the need to search the databases for motions which can suitably be blended and concatenated. Most of the previous researches of human motion indexing and retrieval compute the Euclidean distance of joint angles or joint positions. Such approaches are difficult to apply for cases in which multiple characters are closely interacting with each other, as the relationships of the characters are not encoded in the representation. In this research, we propose a topology-based approach to index the motions of two human characters in close contact. We compute and encode how the two bodies are tangled based on the concept of rational tangles. The encoded relationships, which we define as TangleList, are used to determine the similarity of the pairs of postures. Using our method, we can index and retrieve motions such as one person piggy backing another, one person assisting another in walking, and two persons dancing/wrestling. Our method is useful to manage a motion database of multiple characters. We can also produce motion graph structures of two characters closely interacting with each other by interpolating and concatenating topologically similar postures and motion clips, which are applicable to 3D computer games and computer animation.", "paper_title": "Indexing and Retrieving Motions of Characters in Close Contact", "paper_id": "WOS:000263911600011"}