{"auto_keywords": [{"score": 0.04872267695171359, "phrase": "malicious_ases"}, {"score": 0.008442022747542466, "phrase": "ases"}, {"score": 0.00481495049065317, "phrase": "expose_bulletproof_hosting_ases"}, {"score": 0.004746263721902201, "phrase": "autonomous_systems"}, {"score": 0.004322967486451877, "phrase": "wide_range"}, {"score": 0.0042920078348374375, "phrase": "illegal_content"}, {"score": 0.004155399041702324, "phrase": "new_ases"}, {"score": 0.0038950367927745267, "phrase": "natural_approach"}, {"score": 0.003757480190200645, "phrase": "reputation_system"}, {"score": 0.0036509280916606937, "phrase": "law_enforcement"}, {"score": 0.0034097787109430384, "phrase": "current_as_reputation_systems"}, {"score": 0.003361069456060196, "phrase": "data-plane_monitoring"}, {"score": 0.0033011569787033297, "phrase": "ip_addresses"}, {"score": 0.0030609320300175953, "phrase": "malicious_and_legitimate_but_abused_ases"}, {"score": 0.002889672003089062, "phrase": "fundamentally_different_approach"}, {"score": 0.0026220625042810706, "phrase": "aswatch's_design"}, {"score": 0.0025021765811679446, "phrase": "possible_detection"}, {"score": 0.0024842242921857705, "phrase": "remediation_efforts"}, {"score": 0.002262209824105154, "phrase": "known_malicious_ases"}, {"score": 0.0021049977753042253, "phrase": "existing_defense_systems"}], "paper_keywords": ["AS Reputation", " Bulletproof Hosting", " Malicious Networks"], "paper_abstract": "Bulletproof hosting Autonomous Systems (ASes) malicious ASes fully dedicated to supporting cybercrime provide freedom and resources for a cyber-criminal to operate. Their services include hosting a wide range of illegal content, botnet C&C servers, and other malicious resources. Thousands of new ASes are registered every year, many of which are often used exclusively to facilitate cybercrime. A natural approach to squelching bulletproof hosting ASes is to develop a reputation system that can identify them for takedown by law enforcement and as input to other attack detection systems (e.g., spam filters, botnet detection systems). Unfortunately, current AS reputation systems rely primarily on data-plane monitoring of malicious activity from IP addresses (and thus can only detect malicious ASes after attacks are underway), and are not able to distinguish between malicious and legitimate but abused ASes. As a complement to these systems, in this paper, we explore a fundamentally different approach to establishing AS reputation. We present ASwatch, a system that identifies malicious ASes using exclusively the control-plane (i.e., routing) behavior of ASes. ASwatch's design is based on the intuition that, in an attempt to evade possible detection and remediation efforts, malicious ASes exhibit \"agile\" control plane behavior (e.g., short-lived routes, aggressive re-wiring). We evaluate our system on known malicious ASes; our results show that ASwatch detects up to 93% of malicious ASes with a 5% false positive rate, which is reasonable to effectively complement existing defense systems.", "paper_title": "ASwatch: An AS Reputation System to Expose Bulletproof Hosting ASes", "paper_id": "WOS:000370556200086"}