{"auto_keywords": [{"score": 0.011949900881654044, "phrase": "thesaurus_relationships"}, {"score": 0.00481495049065317, "phrase": "thesauri_structure_concepts"}, {"score": 0.0035245918797629804, "phrase": "latest_version"}, {"score": 0.0034162643819889054, "phrase": "formally_well-defined_ontological_relationships"}, {"score": 0.003015143226706584, "phrase": "reasonable_matching"}, {"score": 0.0029916929549256297, "phrase": "formal_ontological_relationships"}, {"score": 0.0029338597685088603, "phrase": "hierarchical_relationships"}, {"score": 0.0028436364707396613, "phrase": "is-a_relationship"}, {"score": 0.002821516317503421, "phrase": "specific_mereological_relationships"}, {"score": 0.0027886573969044042, "phrase": "fundamental_relationships"}, {"score": 0.0026095369186867707, "phrase": "domain-specific_cases"}, {"score": 0.002499798127196099, "phrase": "necessary_and_sufficient_conditions"}, {"score": 0.0024514505056251316, "phrase": "ontology_-_a_function"}, {"score": 0.0023029188952824685, "phrase": "structural_and_definitional_reengineering"}, {"score": 0.002163367190715979, "phrase": "international_standard"}, {"score": 0.0021215125099937663, "phrase": "good_base"}], "paper_keywords": ["Ontologies", " terminologies", " thesauri"], "paper_abstract": "Ontologies and thesauri structure concepts and, from the perspective of a practitioner, do not appear to be very different. Nevertheless, experts acknowledge that ontologies are different from thesauri in several respects. In this paper we aim to clarify some of the similarities and differences by systematically comparing the structure of each: the relations and their relata in ontologies and the relationships and their relata in thesauri. In particular, we analyze thesaurus relationships and their relata as they are defined in the latest version of the international (ISO) thesaurus standard against formally well-defined ontological relationships and relata from ontology literature - more specifically ontology literature based in realism. We have found that the relata as well as the relationships in thesauri need to be classified further before any reasonable matching to formal ontological relationships is possible. Isolated hierarchical relationships in thesauri then may correspond to the is-a relationship, specific mereological relationships, or fundamental relationships such as the instantiation between universals and individuals in ontologies. Determining how such correspondences apply in domain-specific cases depends on whether the thesaurus relationships contribute to the specifications of necessary and sufficient conditions for their respective relata in the ontology - a function that relationships do not have in thesauri. Our findings make it clear that thesauri require structural and definitional reengineering in order to be reused or treated as ontologies, but that adherence to the international standard for thesauri provides a good base for such reengineering.", "paper_title": "Relationships and relata in ontologies and thesauri: Differences and similarities", "paper_id": "WOS:000312382000003"}