{"auto_keywords": [{"score": 0.03739263574324257, "phrase": "bajraktarevic"}, {"score": 0.007513879601962359, "phrase": "quasi-arithmetic_mean"}, {"score": 0.007418261090838295, "phrase": "owa_operator"}, {"score": 0.006094716414646713, "phrase": "quasi-owa_operator"}, {"score": 0.004672808182229058, "phrase": "orness_measures"}, {"score": 0.004573842508130535, "phrase": "averaging_operators"}, {"score": 0.0038702288460744274, "phrase": "aggregation_properties"}, {"score": 0.003837205620832367, "phrase": "operator_determination_methods"}, {"score": 0.0037719988989298983, "phrase": "quasi-arithmetic_mean-based_compound_aggregation_operators"}, {"score": 0.003177687211289478, "phrase": "weighted_function_average_operator"}, {"score": 0.002842428606954139, "phrase": "orness_indexes"}, {"score": 0.0027940789980683, "phrase": "or-like_level"}, {"score": 0.0026538960171433963, "phrase": "function_techniques"}, {"score": 0.0024566655761509276, "phrase": "orness_definitions"}, {"score": 0.0023636038312749245, "phrase": "parameterized_quasi-owa_operator"}, {"score": 0.0023134312557290043, "phrase": "exponential_and_power_function_generators"}], "paper_keywords": ["Aggregation operators", " Orness", " Quasi-arithmetic mean", " Quasi-OWA operator", " Bajraktarevic mean"], "paper_abstract": "The paper first summarizes the orness measures and their common characteristics of some averaging operators: the quasi-arithmetic mean, the ordered weighted averaging (OWA) operator, the regular increasing monotone (RIM) quantifier and the weighted function average operator, respectively. Then it focuses on the aggregation properties and operator determination methods for two kinds of quasi-arithmetic mean-based compound aggregation operators: the quasi-OWA (ordered weighted averaging) operator and the Bajraktarevic mean. The former is the combination of the quasi-arithmetic mean and the OWA operator, while the latter is the combination of the quasi-arithmetic mean and the weighted function average operator. Two quasi-OWA operator forms are given. where the OWA operator is assigned directly or generated from a RIM (regular increasing monotone) quantifier indirectly. The orness indexes to reflect the or-like level of the quasi-OWA operator and Bajraktarevic mean are proposed. With generating function techniques, the properties of the quasi-OWA operator and Bajraktarevic mean are discussed to show the rationality of these orness definitions. Based on these properties, two families of parameterized quasi-OWA operator and Bajraktarevic mean with exponential and power function generators are proposed and compared. It shows that the method of this paper can also be applied to other function-based aggregation operators. (C)2009 Elsevier Inc. All rights reserved.", "paper_title": "The orness measures for two compound quasi-arithmetic mean aggregation operators", "paper_id": "WOS:000275610600003"}