{"auto_keywords": [{"score": 0.04093796918366913, "phrase": "burst_number"}, {"score": 0.015719716506582538, "phrase": "arithmetic_encoder"}, {"score": 0.01533713287687686, "phrase": "ae"}, {"score": 0.008803080677239691, "phrase": "two-byte_emission"}, {"score": 0.008027331682312157, "phrase": "proposed_architecture"}, {"score": 0.004629977311316031, "phrase": "throughput_bottleneck"}, {"score": 0.004296264970612285, "phrase": "high-throughput_ae"}, {"score": 0.004058180509184539, "phrase": "sequential_pairs"}, {"score": 0.0037924666577694222, "phrase": "index_value"}, {"score": 0.0033119237381809617, "phrase": "\"index-arbiter\"_method"}, {"score": 0.0031393948330209224, "phrase": "different_adjusting_manners"}, {"score": 0.002790723338582723, "phrase": "renormalization_procedure"}, {"score": 0.0027413748388534025, "phrase": "total_number"}, {"score": 0.0027121844541913367, "phrase": "max_burst_number"}, {"score": 0.0025892330566358503, "phrase": "fifo_size"}, {"score": 0.0023936956017015696, "phrase": "arm_company"}, {"score": 0.0023681985426916366, "phrase": "implementation_result"}, {"score": 0.002173756949699897, "phrase": "park"}, {"score": 0.0021049977753042253, "phrase": "video_technology"}], "paper_keywords": ["VLSI", " JPEG2000", " Arithmetic encoder", " MQ-encoder"], "paper_abstract": "The Arithmetic encoder (AE) is a throughput bottleneck of the entire JPEG2000 encoding system. But its sequential nature leads to a difficulty to improve its throughput. To overcome this bottleneck, a high-throughput AE capable of encoding one symbol per clock is proposed. First, the correlations between the sequential pairs of context and its decision are analyzed. Moreover, the burst number of CX and the burst number of the index value are studied. Due to these analyses, a conclusion is drawn in order to prevent the AE from stalling when the burst number of the context is larger than one. Based on this conclusion, an \"index-arbiter\" method is introduced, which increased the throughput greatly. Furthermore, the probabilities of different adjusting manners for the interval register A and code register C before renormalization are given. On the basis of these data, a detector of leading-zero is proposed to simplify the renormalization procedure. Finally, the total number and the max burst number of the two-byte emission are given. According to these results, a FIFO size of 43*4 is introduced to prevent the pipeline from pause when two-byte emission occurs. The proposed architecture is synthesized with TSMC0.18 mu m HS technology library of ARM Company. The implementation result shows that the throughput of the proposed architecture is 547Msymbols/s with an area of 79,012.84 mu m(2). Compared with the paper Rhu and Park (IEEE Transactions on Circuits and Systems for Video Technology, 20(3),446-451, 2010), the throughput has been increased by 37 %.", "paper_title": "A High-Throughput VLSI Architecture Design of Arithmetic Encoder in JPEG2000", "paper_id": "WOS:000358336200006"}