{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "facebook"}, {"score": 0.0046069985410261746, "phrase": "location-based_media"}, {"score": 0.003984665807155269, "phrase": "physical_and_informational_mobility"}, {"score": 0.0038608730929994696, "phrase": "individual_activities"}, {"score": 0.0036707250689857348, "phrase": "personality_traits"}, {"score": 0.003174464741377186, "phrase": "survey_data"}, {"score": 0.002999018180596906, "phrase": "taiwan"}, {"score": 0.0025285834281312705, "phrase": "indirect_effects"}, {"score": 0.0023438664524018634, "phrase": "complete_path"}, {"score": 0.0021589195238286233, "phrase": "theoretical_implications"}, {"score": 0.0021317885325570604, "phrase": "human_mobility"}, {"score": 0.0021049977753042253, "phrase": "selective_self-presentation"}], "paper_keywords": ["Facebook", " LBS", " smartphone", " extraversion", " narcissism", " self-disclosure", " exhibitionism", " location check-in"], "paper_abstract": "Mobile and location-based media refer to technologies that can openly and dynamically portray the characteristics of the users and their mundane life. Facebook check-ins highlights physical and informational mobility of the users relating individual activities into spaces. This study explored how personality traits like extraversion and narcissism function to influence self-disclosure that, in turn, impacts the intensity of check-ins on Facebook. Using survey data collected through Facebook check-in users in Taiwan (N = 523), the results demonstrated that although extraversion and narcissism might not directly impact check-in intensity on Facebook, the indirect effects of self-disclosure and exhibitionism were particularly salient. Moreover, a complete path from extraversion to Facebook check-in through self-disclosure and exhibitionism was discovered. Theoretical implications on human mobility and selective self-presentation are also discussed.", "paper_title": "Showing Off? Human Mobility and the Interplay of Traits, Self-Disclosure, and Facebook Check-Ins", "paper_id": "WOS:000320986100004"}