{"auto_keywords": [{"score": 0.03461617249114157, "phrase": "ran"}, {"score": 0.00481495049065317, "phrase": "discrete_model"}, {"score": 0.004767826806287385, "phrase": "autodiagnosis_systems"}, {"score": 0.004721162131188487, "phrase": "wireless_networks"}, {"score": 0.0036194914688460656, "phrase": "high_complexity"}, {"score": 0.0032319109979344184, "phrase": "wireless_systems"}, {"score": 0.003016544840824688, "phrase": "hardware_fault"}, {"score": 0.002843372121209168, "phrase": "bad_configuration"}, {"score": 0.0028016507334576216, "phrase": "proposed_system"}, {"score": 0.002706659627293686, "phrase": "key_performance_indicators"}, {"score": 0.002551231163230566, "phrase": "network_malfunction"}, {"score": 0.0022665781920241245, "phrase": "experimental_results"}, {"score": 0.0021789194955896102, "phrase": "theoretical_concepts"}, {"score": 0.0021049977753042253, "phrase": "live_network"}], "paper_keywords": ["network operations", " wireless communication", " probabilistic algorithms", " decision support", " mobile communication systems", " automation"], "paper_abstract": "In the near future, several radio access technologies will coexist in Beyond 3G mobile networks ( B3G), and they will be eventually transformed into one seamless global communication infrastructure. Self-managing systems (i.e., those that self-configure, self-protect, self-heal, and self-optimize) are the solution to tackle the high complexity inherent to these networks. In this context, this paper proposes a system for autodiagnosis in the Radio Access Network ( RAN) of wireless systems. The malfunction of the RAN may be due not only to a hardware fault but also ( and more difficult to identify) to a bad configuration. The proposed system is based on the analysis of Key Performance Indicators ( KPIs) in order to isolate the cause of the network malfunction. In this paper, two alternative probabilistic systems are compared, which differ on how KPIs are modeled ( continuous or discrete variables). Experimental results are examined in order to support the theoretical concepts, based on data from a live network. The drawbacks and benefits of both systems are studied, and some conclusions on the scenarios under which each model should be used are presented.", "paper_title": "Continuous versus discrete model in autodiagnosis systems for wireless networks", "paper_id": "WOS:000255012900001"}