{"auto_keywords": [{"score": 0.041712156789843864, "phrase": "tiny_video_camera"}, {"score": 0.03749217845182573, "phrase": "focus_frames"}, {"score": 0.03497248057786193, "phrase": "in-focus_frames"}, {"score": 0.025245583690202477, "phrase": "specular_reflection_detection_technique"}, {"score": 0.00481495049065317, "phrase": "endoscopy_video"}, {"score": 0.004762027452336851, "phrase": "video_technology"}, {"score": 0.004606706983515934, "phrase": "human_body"}, {"score": 0.0045309482598142395, "phrase": "flexible_endoscopes"}, {"score": 0.004407429986799784, "phrase": "small_bowel"}, {"score": 0.004311033701151224, "phrase": "rigid_endoscopes"}, {"score": 0.004228410660931297, "phrase": "minimal_invasive_surgeries"}, {"score": 0.0039025843913901154, "phrase": "endoscopic_procedure"}, {"score": 0.003838360529834522, "phrase": "video_signal"}, {"score": 0.0037751895787179173, "phrase": "human_organ"}, {"score": 0.0036823699601344962, "phrase": "real-time_analysis"}, {"score": 0.003522936431140836, "phrase": "endoscopy_videos"}, {"score": 0.003503497128638099, "phrase": "current_endoscopes"}, {"score": 0.0033425203275530193, "phrase": "out-of-focus_frames"}, {"score": 0.0029511109584668, "phrase": "cad_system"}, {"score": 0.002910545717767559, "phrase": "out-of-focus_frame"}, {"score": 0.00254128377909922, "phrase": "video_frames"}, {"score": 0.00244463852203525, "phrase": "intensive_specular_reflections"}, {"score": 0.0023386685733717038, "phrase": "detected_specular_reflection_information"}, {"score": 0.0023001222556899327, "phrase": "informative_frame_classification"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["endoscopy", " colonoscopy", " clustering", " texture", " frame classification", " specular reflection detection"], "paper_abstract": "Advances in video technology allow inspection, diagnosis and treatment of the inside of the human body without or with very small scars. Flexible endoscopes are used to inspect the esophagus, stomach, small bowel, colon, and airways, whereas rigid endoscopes are used for a variety of minimal invasive surgeries (i.e., laparoscopy, arthroscopy, endoscopic neurosurgery). These endoscopes come in various sizes, but all have a tiny video camera at the tip. During an endoscopic procedure, the tiny video camera generates a video signal of the interior of the human organ, which is displayed on a monitor for real-time analysis by the physician. However, many out-of-focus frames are present in endoscopy videos because current endoscopes are equipped with a single, wide-angle lens that cannot be focused. We need to distinguish the out-of-focus frames from the in-focus frames to utilize the information of the out-of-focus and/or the in-focus frames for further automatic or semi-automatic computer-aided diagnosis (CAD). This classification can reduce the number of images to be viewed by a physician and to be analyzed by a CAD system. We call an out-of-focus frame a non-informative frame and an in-focus frame an informative frame. The out-of-focus frames have characteristics that are different from those of in-focus frames. In this paper, we propose two new techniques (edge-based and clustering-based) to classify video frames into two classes, informative and non-informative frames. However, because intensive specular reflections reduce the accuracy of the classification we also propose a specular reflection detection technique, and use the detected specular reflection information to increase the accuracy of informative frame classification. Our experimental studies indicate that precision, sensitivity, specificity, and accuracy for the specular reflection detection technique and the two informative frame classification techniques are greater than 90% and 95%, respectively. (c) 2006 Elsevier B.V. All rights reserved.", "paper_title": "Informative frame classification for endoscopy video", "paper_id": "WOS:000245596200002"}