{"auto_keywords": [{"score": 0.04764245501005146, "phrase": "challenges"}, {"score": 0.00481495049065317, "phrase": "survey_on"}, {"score": 0.003924629168434799, "phrase": "intelligent_devices"}, {"score": 0.003613119346373748, "phrase": "computer_networks"}, {"score": 0.0035199624440843892, "phrase": "ip-based_internet"}, {"score": 0.0034742854447532678, "phrase": "largest_network"}, {"score": 0.003340768341189764, "phrase": "great_strides"}, {"score": 0.0032095274367812186, "phrase": "ietf"}, {"score": 0.003048782877550259, "phrase": "open_standards"}, {"score": 0.002957222630196853, "phrase": "wireless_resource"}, {"score": 0.0029443683459283955, "phrase": "constrained_networks"}, {"score": 0.002806595775343074, "phrase": "complex_deployment_characteristics"}, {"score": 0.0027461155463816772, "phrase": "stringent_requirements"}, {"score": 0.002286781334850213, "phrase": "research_community"}, {"score": 0.002237477619351199, "phrase": "iot_field"}, {"score": 0.00212343307513777, "phrase": "current_standards"}, {"score": 0.0021049977753042253, "phrase": "research_activities"}], "paper_keywords": [""], "paper_abstract": "Technologies to support the Internet of Things are becoming more important as the need to better understand our environments and make them smart increases. As a result it is predicted that intelligent devices and networks, such as WSNs, will not be isolated, but connected and integrated, composing computer networks. So far, the IP-based Internet is the largest network in the world; therefore, there are great strides to connect WSNs with the Internet. To this end, the IETF has developed a suite of protocols and open standards for accessing applications and services for wireless resource constrained networks. However, many open challenges remain, mostly due to the complex deployment characteristics of such systems and the stringent requirements imposed by various services wishing to make use of such complex systems. Thus, it becomes critically important to study how the current approaches to standardization in this area can be improved, and at the same time better understand the opportunities for the research community to contribute to the IoT field. To this end, this article presents an overview of current standards and research activities in both industry and academia.", "paper_title": "A SURVEY ON THE IETF PROTOCOL SUITE FOR THE INTERNET OF THINGS: STANDARDS, CHALLENGES, AND OPPORTUNITIES", "paper_id": "WOS:000330229100012"}