{"auto_keywords": [{"score": 0.040615957123971876, "phrase": "esm"}, {"score": 0.010934694282988724, "phrase": "fluid_resuscitation"}, {"score": 0.00481495049065317, "phrase": "multi-exponential_curve"}, {"score": 0.00475070135279933, "phrase": "oxygen-quenched_phosphorescence_decay"}, {"score": 0.004687305496643216, "phrase": "microvascular_oxygen_tension_histograms"}, {"score": 0.004563028873351776, "phrase": "oxygen-quenched_phosphorescence_decay_traces"}, {"score": 0.004471978831302331, "phrase": "exponential_series_method"}, {"score": 0.003767599364361092, "phrase": "phosphorescence_decay"}, {"score": 0.003594369823549604, "phrase": "different_signal-to-noise_ratios"}, {"score": 0.003417565253539315, "phrase": "rat_kidney"}, {"score": 0.003360578019762703, "phrase": "endotoxemic_shock"}, {"score": 0.003282383509542342, "phrase": "mean_microvascular_oxygen_tension"}, {"score": 0.002927626967420519, "phrase": "hypoxic_peak"}, {"score": 0.0021335427588412077, "phrase": "new_insights"}, {"score": 0.0021192223086507946, "phrase": "complex_disease_states"}, {"score": 0.0021049977753042253, "phrase": "treatment_strategies"}], "paper_keywords": ["Phosphorimetry", " Exponential series method", " Heterogeneity", " Distribution", " Hypoxia", " Microcirculation", " Endotoxemia", " Rat", " Kidney"], "paper_abstract": "Although it is generally accepted that oxygen-quenched phosphorescence decay traces can be analyzed using the exponential series method (ESM), its application until now has been limited to a few (patho)physiological studies, probably because the reliability of the recovered oxygen tension (pO(2)) histograms has never been extensively evaluated and lacks documentation. The aim of this study was, therefore, to evaluate the use of the ESM to adequately determine pO(2) histograms from phosphorescence decay traces. For this purpose we simulated decay traces corresponding to uni- and bimodal pO(2) distributions and recovered the pO(2) histograms at different signal-to-noise ratios (SNRs). Ultimately, we recovered microvascular pO(2) histograms measured in the rat kidney in a model of endotoxemic shock and fluid resuscitation and showed that the mean microvascular oxygen tension, aOE (c) pO(2)>, decreased after induction of endotoxemia and that after 2 h of fluid resuscitation, aOE (c) pO(2)> remained low, but the hypoxic peak that had arisen during endotoxemia was reduced. This finding illustrates the importance of recovering pO(2) histograms under (patho)physiological conditions. In conclusion, this study has characterized how noise affects the recovery of pO(2) histograms using the ESM and documented the reliability of the ESM for recovering both low- and high-pO(2) distributions for SNRs typically found in experiments. This study might therefore serve as a frame of reference for investigations focused on oxygen (re)distribution during health and disease and encourage researchers to (re-)analyze data obtained in (earlier) studies possibly revealing new insights into complex disease states and treatment strategies.", "paper_title": "Evaluation of multi-exponential curve fitting analysis of oxygen-quenched phosphorescence decay traces for recovering microvascular oxygen tension histograms", "paper_id": "WOS:000284781400008"}