{"auto_keywords": [{"score": 0.004722038375317162, "phrase": "growing_need"}, {"score": 0.004667149874736771, "phrase": "footwear_sector"}, {"score": 0.004471270242168067, "phrase": "specific_footwear_style"}, {"score": 0.004283576270012874, "phrase": "user_comfort"}, {"score": 0.004250302819248558, "phrase": "health_reasons"}, {"score": 0.004103728794623367, "phrase": "suitable_shoe"}, {"score": 0.003900853871728297, "phrase": "user_foot"}, {"score": 0.003483573659272443, "phrase": "traditional_customised_footwear_manufacturing_techniques"}, {"score": 0.0034296217420566304, "phrase": "purely_artisanal_procedures"}, {"score": 0.0032599633778910516, "phrase": "geometric_models"}, {"score": 0.0032220148724914867, "phrase": "different_authors"}, {"score": 0.0031107911390188055, "phrase": "industrial_environment"}, {"score": 0.0030865992688177005, "phrase": "limited_resources"}, {"score": 0.002311933249234786, "phrase": "satisfactory_results"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Deformation techniques", " Customised footwear", " Footwear production"], "paper_abstract": "There is a growing need within the footwear sector to customise the design of the last from which a specific footwear style is to be produced. This customisation is necessary for user comfort and health reasons, as the user needs to wear a suitable shoe. For this purpose, a relationship must be established between the user foot and the last with which the style will be made; up until now, no model has existed that integrates both elements. On the one hand, traditional customised footwear manufacturing techniques are based on purely artisanal procedures which make the process arduous and complex; on the other hand, geometric models proposed by different authors present the impossibility of implementing them in an industrial environment with limited resources for the acquisition of morphometric and structural data for the foot, apart from the fact that they do not prove to be sufficiently accurate given the non-similarity of the foot and last. In this paper, two interrelated geometric models are defined, the first, a bio-deformable foot model and the second, a deformable last model. The experiments completed show the goodness of the model, with it obtaining satisfactory results in terms of comfort, efficiency and precision, which make it viable for use in the sector. (C) 2013 Elsevier Ltd. All rights reserved.", "paper_title": "Footwear bio-modelling: An industrial approach", "paper_id": "WOS:000326365400008"}