{"auto_keywords": [{"score": 0.03363896917055258, "phrase": "graph-theoretic_game"}, {"score": 0.02933067779342666, "phrase": "matching_nash_equilibria"}, {"score": 0.023673003038917333, "phrase": "bipartite_graph"}, {"score": 0.00481495049065317, "phrase": "information_network"}, {"score": 0.004666598697538815, "phrase": "probability_distribution"}, {"score": 0.004424768776701965, "phrase": "protector_entity"}, {"score": 0.0038191874409949423, "phrase": "conflicting_objective"}, {"score": 0.0037246656582642272, "phrase": "expected_number"}, {"score": 0.003621111838638197, "phrase": "network_security_scenario"}, {"score": 0.003587235362628753, "phrase": "non-cooperative_strategic_game"}, {"score": 0.003454858296390957, "phrase": "network_entity"}, {"score": 0.003306559295382181, "phrase": "algebraic_characterization"}, {"score": 0.003154701855951328, "phrase": "pure_nash_equilibrium"}, {"score": 0.0031056437850836326, "phrase": "immediate_consequence"}, {"score": 0.00307657476125683, "phrase": "covering_properties"}, {"score": 0.0028895932204402986, "phrase": "natural_subclass"}, {"score": 0.0028715299874549245, "phrase": "mixed_nash_equilibria"}, {"score": 0.0028268629720802772, "phrase": "matching_nash"}, {"score": 0.0027139447110929586, "phrase": "necessary_covering_properties"}, {"score": 0.002671722386856879, "phrase": "additional_conditions"}, {"score": 0.0026055251533586804, "phrase": "independent_sets"}, {"score": 0.0024857831949206166, "phrase": "expanding_independent_set"}, {"score": 0.0024015788765081327, "phrase": "nash"}, {"score": 0.0023566987138026285, "phrase": "bipartite_graphs"}, {"score": 0.0022696277881969896, "phrase": "polynomial_time_algorithm"}, {"score": 0.0022413233627905696, "phrase": "maximum_matching"}, {"score": 0.0021049977753042253, "phrase": "matching_nash_equilibrium"}], "paper_keywords": ["game theory", " graph theory", " security", " Nash equilibria", " attacks and defenses"], "paper_abstract": "Consider an information network with threats called attackers; each attacker uses a probability distribution to choose a node of the network to damage. Opponent to the attackers is a protector entity called defender; the defender scans and cleans from attacks some part of the network (in particular, a link), which it chooses independently using its own probability distribution. Each attacker wishes to maximize the probability of escaping its cleaning by the defender; towards a conflicting objective, the defender aims at maximizing the expected number of attackers it catches. We model this network security scenario as a non-cooperative strategic game on graphs. We are interested in its associated Nash equilibria, where no network entity can unilaterally increase its local objective. We obtain the following results: We obtain an algebraic characterization of (mixed) Nash equilibria. No (non-trivial) instance of the graph-theoretic game has a pure Nash equilibrium. This is an immediate consequence of some covering properties we prove for the supports of the players in all (mixed) Nash equilibria. We coin a natural subclass of mixed Nash equilibria, which we call Matching Nash equilibria, for this graph-theoretic game. Matching Nash equilibria are defined by enriching the necessary covering properties we proved with some additional conditions involving other structural parameters of graphs, such as Independent Sets. We derive a characterization of graphs admitting Matching Nash equilibria. All such graphs have an Expanding Independent Set. The characterization enables a non-deterministic, polynomial time algorithm to compute a Matching Nash equilibrium for any such graph. Bipartite graphs are shown to satisfy the characterization. So, using a polynomial time algorithm to compute a Maximum Matching for a bipartite graph, we obtain, as our main result, a deterministic, polynomial time algorithm to compute a Matching Nash equilibrium for any instance of the game with a bipartite graph.", "paper_title": "A network game with attackers and a defender", "paper_id": "WOS:000255874200006"}