{"auto_keywords": [{"score": 0.043516383088423274, "phrase": "syntax-based_approach"}, {"score": 0.04048126372530425, "phrase": "machine-learning-based_approach"}, {"score": 0.014854402252249344, "phrase": "different_approaches"}, {"score": 0.014135854376310262, "phrase": "negation_detection"}, {"score": 0.013986395475240136, "phrase": "lexicon-based_approach"}, {"score": 0.013838494626931153, "phrase": "rule-based_method"}, {"score": 0.00481495049065317, "phrase": "narrative_pathology_reports"}, {"score": 0.004679134285953932, "phrase": "medical_entities"}, {"score": 0.004202931484732134, "phrase": "relying_on_trigger_terms_and_termination_clues"}, {"score": 0.004011867299107537, "phrase": "negation_patterns"}, {"score": 0.003940706575253453, "phrase": "dependency_output"}, {"score": 0.0038986150699604504, "phrase": "stanford_parser"}, {"score": 0.0032947371184395237, "phrase": "micro-averaged_f-score"}, {"score": 0.003111211706454155, "phrase": "overall_average_precision"}, {"score": 0.002927371124061966, "phrase": "negation_tagger"}, {"score": 0.002896071795090179, "phrase": "similar_approach"}, {"score": 0.0025822818714499795, "phrase": "poor_parsing_results"}, {"score": 0.002464709648714996, "phrase": "abnormal_grammatical_structures"}, {"score": 0.0022696277881969896, "phrase": "overall_performance"}, {"score": 0.002229300966775032, "phrase": "possible_solutions"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Negation detection", " Lexicon-based approach", " Syntax-based approach", " Machine-learning-based approach", " Pathology reports"], "paper_abstract": "Objective: To detect negations of medical entities in free-text pathology reports with different approaches, and evaluate their performances. Methods and material: Three different approaches were applied for negation detection: the lexicon-based approach was a rule-based method, relying on trigger terms and termination clues; the syntax-based approach was also a rule-based method, where the rules and negation patterns were designed using the dependency output from the Stanford parser; the machine-learning-based approach used a support vector machine as a classifier to build models with a number of features. A total of 284 English pathology reports of lymphoma were used for the study. Results: The machine-learning-based approach had the best overall performance on the test set with micro-averaged F-score of 82.56%, while the syntax-based approach performed worst with 78.62% Fscore. The lexicon-based approach attained an overall average precision of 89.74% and recall of 76.09%, which were significantly better than the results achieved by Negation Tagger with a similar approach. Discussion: The lexicon-based approach benefitted from being customized to the corpus more than the other two methods. The errors in negation detection with the syntax-based approach producing poorest performance were mainly due to the poor parsing results, and the errors with the other methods were probably because of the abnormal grammatical structures. Conclusions: A machine-learning-based approach has potential advantages for negation detection, and may be preferable for the task. To improve the overall performance, one of the possible solutions is to apply different approaches to each section in the reports. (C) 2015 Elsevier B.V. All rights reserved.", "paper_title": "Automatic negation detection in narrative pathology reports", "paper_id": "WOS:000356553800004"}