{"auto_keywords": [{"score": 0.030020927416541717, "phrase": "mcd"}, {"score": 0.026664733862021492, "phrase": "polynomial_time"}, {"score": 0.00481495049065317, "phrase": "minimum_certificate_dispersal"}, {"score": 0.004786519708868553, "phrase": "tree_structures"}, {"score": 0.004730158389701481, "phrase": "n-vertex_graph"}, {"score": 0.003971616493886099, "phrase": "edge_sets"}, {"score": 0.003434662174045939, "phrase": "secure_communications"}, {"score": 0.003404244237372396, "phrase": "distributed_computing"}, {"score": 0.0029437707610254255, "phrase": "tree_structure"}, {"score": 0.0028832679581901176, "phrase": "efficient_communication_network"}, {"score": 0.0026220963356862153, "phrase": "maximum_degree"}, {"score": 0.0025605773834404253, "phrase": "tree_request"}, {"score": 0.002537880772794665, "phrase": "constant_delta"}, {"score": 0.0024719669765234545, "phrase": "delta"}, {"score": 0.002142832962924139, "phrase": "arbitrarily_small_positive_constant_number"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Minimum certificate dispersal problem", " Tree structure", " Approximability"], "paper_abstract": "Given an n-vertex graph G = (V, E) and a set R subset of {{x, y} vertical bar x, y is an element of V} of requests, we consider to assign a set of edges to each vertex in G so that for every request {u, v} in R the union of the edge sets assigned to u and v contains a path from u to v. The Minimum Certificate Dispersal Problem (MCD) is defined as one to find an assignment that minimizes the sum of the cardinality of the edge set assigned to each vertex, which is originally motivated by the design of secure communications in a distributed computing. This problem has been shown to be LOGAPX-hard for general directed topologies of G and R. In this paper, we consider the complexity of MCD for more practical topologies of G and R, that is, when G or R forms an (undirected) tree; a tree structure is frequently adopted to construct an efficient communication network. We first show that MCD is still APX-hard when R is a tree, even a star. We then explore the problem from the viewpoint of the maximum degree Delta of the tree: MCD for tree request set with constant Delta is solvable in polynomial time, while that with Delta = Omega(n) is 2.78-approximable in polynomial time but hard to approximate within 1.01 unless P = NP. As for the structure of G itself, we show that if G is a tree, the problem can be solved in O (n(1+epsilon) vertical bar R vertical bar, where epsilon is an arbitrarily small positive constant number. (C) 2015 Elsevier B.V. All rights reserved.", "paper_title": "Approximability of minimum certificate dispersal with tree structures", "paper_id": "WOS:000358627600003"}