{"auto_keywords": [{"score": 0.049734762741514144, "phrase": "multiple_alignment_likelihood"}, {"score": 0.04771869171148843, "phrase": "homologous_sequences"}, {"score": 0.00481495049065317, "phrase": "network_topology"}, {"score": 0.004495922204117959, "phrase": "common_ancestor"}, {"score": 0.004305364955542171, "phrase": "useful_information"}, {"score": 0.004063741692442559, "phrase": "highly_divergent_homologous_sequences"}, {"score": 0.003976656675903324, "phrase": "partial_homology"}, {"score": 0.0039055075176836263, "phrase": "protein_domain_rearrangements"}, {"score": 0.003877404180794398, "phrase": "existing_clustering_methods"}, {"score": 0.0036597104126905437, "phrase": "evolution_pattern"}, {"score": 0.003504470784139224, "phrase": "gene_families"}, {"score": 0.0031558679589831287, "phrase": "gene_family"}, {"score": 0.00296781730323553, "phrase": "pairwise_similarity_criteria"}, {"score": 0.0029358111718032704, "phrase": "permissive_parameters"}, {"score": 0.00283158908387463, "phrase": "homogeneous_clusters"}, {"score": 0.002750874355974879, "phrase": "similarity_network"}, {"score": 0.00260566789186855, "phrase": "multiple_alignments"}, {"score": 0.002549749054599413, "phrase": "model_selection_technique"}, {"score": 0.00251313643823856, "phrase": "optimal_tradeoff"}, {"score": 0.0023462618437394616, "phrase": "simulated_sequences"}, {"score": 0.0022063469115990715, "phrase": "sequence_divergence"}], "paper_keywords": [""], "paper_abstract": "Motivation: Proteins can be naturally classified into families of homologous sequences that derive from a common ancestor. The comparison of homologous sequences and the analysis of their phylogenetic relationships provide useful information regarding the function and evolution of genes. One important difficulty of clustering methods is to distinguish highly divergent homologous sequences from sequences that only share partial homology due to evolution by protein domain rearrangements. Existing clustering methods require parameters that have to be set a priori. Given the variability in the evolution pattern among proteins, these parameters cannot be optimal for all gene families. Results: We propose a strategy that aims at clustering sequences homologous over their entire length, and that takes into account the pattern of substitution specific to each gene family. Sequences are first all compared with each other and clustered into pre-families, based on pairwise similarity criteria, with permissive parameters to optimize sensitivity. Pre-families are then divided into homogeneous clusters, based on the topology of the similarity network. Finally, clusters are progressively merged into families, for which we compute multiple alignments, and we use a model selection technique to find the optimal tradeoff between the number of families and multiple alignment likelihood. To evaluate this method, called HiFiX, we analyzed simulated sequences and manually curated datasets. These tests showed that HiFiX is the only method robust to both sequence divergence and domain rearrangements. HiFiX is fast enough to be used on very large datasets.", "paper_title": "High-quality sequence clustering guided by network topology and multiple alignment likelihood", "paper_id": "WOS:000302806900005"}