{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "secondary_school_science"}, {"score": 0.004681413843223496, "phrase": "iterative_designs"}, {"score": 0.0045355866228818514, "phrase": "student-contributed_work"}, {"score": 0.004487989502479992, "phrase": "collaborative_problem"}, {"score": 0.004317682099870507, "phrase": "new_technologies"}, {"score": 0.004197878397604354, "phrase": "shared_knowledge_base"}, {"score": 0.003982098149664708, "phrase": "specialized_\"smart_classroom\"_environment"}, {"score": 0.003912655174107315, "phrase": "student_data"}, {"score": 0.00371148138781691, "phrase": "next_day's_lesson"}, {"score": 0.0035705347414368696, "phrase": "class_activities"}, {"score": 0.003434922209075514, "phrase": "research_tradition"}, {"score": 0.003410822685334396, "phrase": "knowledge_communities"}, {"score": 0.0032582312803728724, "phrase": "productive_collaborative_interactions"}, {"score": 0.0031455000569352454, "phrase": "recent_literature"}, {"score": 0.0030689098754563982, "phrase": "curricular_activities"}, {"score": 0.0030153435879168634, "phrase": "school_environments"}, {"score": 0.0029731625157696845, "phrase": "digital_platform"}, {"score": 0.0029109914689364465, "phrase": "structured_collaborations"}, {"score": 0.00284009509859163, "phrase": "design-based_research_program"}, {"score": 0.0027514668612638074, "phrase": "technology_platform"}, {"score": 0.0027129670661026964, "phrase": "successive_cycles"}, {"score": 0.002234988641498543, "phrase": "next_iteration"}], "paper_keywords": ["Future Classrooms", " Science Education", " Physics", " Collaborative Inquiry"], "paper_abstract": "This paper introduces a series of iterative designs that investigate how the aggregation and visualization of student-contributed work can support collaborative problem solving in the domain of physics. We investigate how new technologies can enable students to contribute to a shared knowledge base, working across contexts: in class, at home, and in a specialized \"smart classroom\" environment. We explore how student data can be provided to the teacher before class, in support of planning the next day's lesson, and during class, to help the teacher orchestrate class activities and respond to student needs. Our work builds upon the research tradition of knowledge communities and inquiry learning to inform its design of materials and activities that support productive collaborative interactions for learners. We are also guided by the recent literature on scripting and orchestration to define curricular activities that bridge home and school environments, leveraging a digital platform that includes Web 2.0 features to guide structured collaborations. This paper reports on a design-based research program in which the development of the curriculum and technology platform is informed by successive cycles of design, enactment, analysis, and re-design. The paper will review our efforts through three successive design cycles, exploring the evolution of our own \"smart classroom curriculum\" for high school physics. For each iteration, we present our design goals, the resulting curriculum and technology, the student learning outcomes, and our evaluation that informs the next iteration. We end with a description of our current design, and discuss the goals and directions of our future efforts.", "paper_title": "Co-Designing Collaborative Smart Classroom Curriculum for Secondary School Science", "paper_id": "WOS:000303599700003"}