{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "automatic_generation_of_an_aspect"}, {"score": 0.00477190623242136, "phrase": "domain_sensitive_sentiment_lexicon"}, {"score": 0.0047292449487169345, "phrase": "sentiment_lexicon"}, {"score": 0.0046659637258752535, "phrase": "important_role"}, {"score": 0.004421156723819163, "phrase": "important_component"}, {"score": 0.00438161736774803, "phrase": "sentiment_analysis_applications"}, {"score": 0.004284302478991387, "phrase": "sentiment_lexicons"}, {"score": 0.004226949670141375, "phrase": "fixed_polarity"}, {"score": 0.0032423089921154503, "phrase": "fully_automatic_method"}, {"score": 0.003141830113006653, "phrase": "sensitive_sentiment_lexicon"}, {"score": 0.0029236680654022664, "phrase": "experimental_results"}, {"score": 0.002387758958649797, "phrase": "research_community"}, {"score": 0.0023033100935570755, "phrase": "long_tail_distribution_behavior"}, {"score": 0.0021049977753042253, "phrase": "sentiment_words"}], "paper_keywords": ["Sentiment analysis", " opinion mining", " sentiment lexicon", " lexicon induction", " aspect ranking"], "paper_abstract": "Sentiment lexicon plays an important role in determining the polarity of words and proves to be an important component in sentiment analysis applications. Most of these sentiment lexicons assign a fixed polarity to each word. However, it has been noted that the polarity of words depends on how they are used and so these lexicons are unable to accurately classify the polarity of the sentiments. By considering the aspect and domain of a word will allow us to more accurately classify sentiments. This paper presents a fully automatic method to build an aspect and domain sensitive sentiment lexicon which assigns a polarity to a word depending on both the aspect and the domain. The experimental results show that our lexicon significantly outperforms other commonly used sentiment lexicons / state-of-the-art approaches. To the best of our knowledge, such a lexicon is not publicly available. As such, we also make this lexicon publicly available as we believe it will benefit the research community. In addition, we observe the long tail distribution behavior of product aspects and propose the possibility of aspect ranking by comparing the number of domains and number of sentiment words present for an aspect.", "paper_title": "Automatic Generation of an Aspect and Domain Sensitive Sentiment Lexicon", "paper_id": "WOS:000341299700012"}