{"auto_keywords": [{"score": 0.0452817950290464, "phrase": "media_choice"}, {"score": 0.00481495049065317, "phrase": "media_selection_as"}, {"score": 0.004523865550323285, "phrase": "particular_type"}, {"score": 0.004436545340717729, "phrase": "media_choice_literature"}, {"score": 0.004384960761826366, "phrase": "myriad_contextual_factors"}, {"score": 0.004233762728640565, "phrase": "communication_partners"}, {"score": 0.004071846628708832, "phrase": "time_pressure"}, {"score": 0.003870541730075597, "phrase": "contingency-based_theory"}, {"score": 0.0037516215763875225, "phrase": "alternative_approach"}, {"score": 0.0036791522245326514, "phrase": "communication_strategies"}, {"score": 0.0036505565334886227, "phrase": "media_characteristics"}, {"score": 0.003389704997952315, "phrase": "organizational_communication"}, {"score": 0.0032599633778910516, "phrase": "media_synchronicity_theory"}, {"score": 0.0032094634756436595, "phrase": "scenario-based_methodology"}, {"score": 0.0030745737579268876, "phrase": "deceptive_communication_task"}, {"score": 0.0026609940110902666, "phrase": "differing_levels"}, {"score": 0.0026402908398883832, "phrase": "communication_granularity"}, {"score": 0.002422890839801611, "phrase": "prior_contingency-based_explanations"}], "paper_keywords": ["Computer-mediated communication", " deceptive communication", " media synchronicity theory"], "paper_abstract": "Why do people select the media they choose for a particular type of communication? The media choice literature has considered myriad contextual factors that influence media choice, from proximity of the communication partners, to the urgency of the situation, to time pressure, and so on. From this body of work, a contingency-based theory of media choice has emerged. An alternative approach is to investigate how communication strategies and media characteristics affect choice. We identified two approaches for investigating these issues: Te'eni's (2001) model of organizational communication and Dennis et al.'s (2008) media synchronicity theory. Using a scenario-based methodology, we asked respondents which medium they would use for a deceptive communication task and why they made that choice. We analyzed the data from the perspective of both the Te'eni and MST frameworks, enabling us to compare the extent to which each was able to explain our respondents' media choices. Both frameworks, at differing levels of communication granularity, suggest that the intent of the communication drives a strategy that ultimately informs media choice. The results suggest that the prior contingency-based explanations of media choice could be improved by not only understanding the intent of the communication, but also the strategy used by an individual to execute this communication. Additionally, we found that the more finely grained view of communication contained in MST explained more of the outcomes and was more parsimonious as well.", "paper_title": "MEDIA SELECTION AS A STRATEGIC COMPONENT OF COMMUNICATION", "paper_id": "WOS:000329756800012"}