{"auto_keywords": [{"score": 0.05007852962010534, "phrase": "animated_interface_agents"}, {"score": 0.009391563961402083, "phrase": "everyday_work_applications"}, {"score": 0.005681936595454221, "phrase": "theoretical_model"}, {"score": 0.004677372885331908, "phrase": "potential_contribution"}, {"score": 0.004632388761885302, "phrase": "interactive_software_agents"}, {"score": 0.004435230698216773, "phrase": "end-user_adoption"}, {"score": 0.004308462899096798, "phrase": "microsoft"}, {"score": 0.00393032656248792, "phrase": "end-user's_choice"}, {"score": 0.0037087324991876727, "phrase": "survey_instrument"}, {"score": 0.0034491650585057754, "phrase": "partial_least_squares"}, {"score": 0.003131023880006021, "phrase": "person's_choice"}, {"score": 0.002883718207958817, "phrase": "important_influencing_factors"}, {"score": 0.0027876387169652717, "phrase": "high_scores"}, {"score": 0.0027341763737751467, "phrase": "information_technology"}, {"score": 0.002592369213499121, "phrase": "high_animation_predisposition_scores"}], "paper_keywords": ["interface agents", " end user adoption", " computer interfaces", " PLS"], "paper_abstract": "Recognizing the potential contribution that interactive software agents bring to everyday work applications, this paper reports on end-user adoption of animated interface agents in one particular work application environment: Microsoft (R) Office. The paper develops and empirically tests a theoretical model of the factors affecting an end-user's choice to adopt and utilize such interface agents. From this theoretical model, a survey instrument was adapted and administered to 261 participants, familiar with animated interface agents. Results from a partial least squares ( PLS) analysis indicates that a variety of factors are at play, which inhibit or foster a person's choice to utilize and adopt animated interface agents. Of significance is that: ( a) both perceived usefulness and perceived enjoyment are important influencing factors; ( b) users with high scores in innovativeness toward information technology are less likely to find animated interface agents enjoyable; ( c) individuals with high animation predisposition scores perceive animated interface agents to be more enjoyable; and ( d) users who perceive animated interface agents to be more enjoyable also perceive them to be more useful. Such insights can be used to leverage the introduction and rollout of animated interface agents in everyday work applications in ways that promote their avid adoption and use.", "paper_title": "End-user adoption of animated interface agents in everyday work applications", "paper_id": "WOS:000246517700004"}