{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "communication_skills"}, {"score": 0.04265646828469802, "phrase": "picture_cards"}, {"score": 0.004512814529823301, "phrase": "conventional_pedagogical_approach"}, {"score": 0.004161553532799662, "phrase": "approach's_great_effectiveness"}, {"score": 0.003964007795174772, "phrase": "paper-based_approach's_effectiveness"}, {"score": 0.00385832528624328, "phrase": "time-consuming_and_complex_preparation_process"}, {"score": 0.003298441494378465, "phrase": "successful_aspects"}, {"score": 0.003245359940011418, "phrase": "traditional_pecs_approach"}, {"score": 0.003193129886123359, "phrase": "advantageous_features"}, {"score": 0.0029126002350975634, "phrase": "image-capturing_capabilities"}, {"score": 0.0028195727965553367, "phrase": "content_creation"}, {"score": 0.002714779217561487, "phrase": "children_participants"}, {"score": 0.0023712394008737958, "phrase": "content-preparation_time"}, {"score": 0.002270745003370529, "phrase": "autism's_willingness"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Assistive technology", " Autism", " Child-computer interaction", " Tablet applications", " Picture exchange communication system"], "paper_abstract": "The Picture Exchange Communication System (PECS) is the conventional pedagogical approach for developing the communication skills of children with autism, and research has supported the approach's great effectiveness in its communicative utilization of picture cards. Unfortunately, the paper-based approach's effectiveness is hampered by the time-consuming and complex preparation process of manually creating and managing these picture cards for use between the children and their caregivers. This paper presents iCAN, a tablet-based system that adopts the successful aspects of the traditional PECS approach while incorporating advantageous features such as support for digital, visualization, and voice capabilities, improved portability due to its smaller form factor on a tablet, and image-capturing capabilities for expanding the flexibility of content creation. We deployed our system onto eleven children participants - whom are diagnosed with moderate to severe autism - and their primary caregivers over a span of four weeks, and our results demonstrated that iCAN reduced content-preparation time by over 70% while also enhancing children with autism's willingness to learn and interact with others. (C) 2014 Published by Elsevier Ltd.", "paper_title": "iCAN: A tablet-based pedagogical system for improving communication skills of children with autism", "paper_id": "WOS:000345479200008"}