{"auto_keywords": [{"score": 0.04572738731303177, "phrase": "generic_questions"}, {"score": 0.0058414999611605236, "phrase": "short_quizzes"}, {"score": 0.00481495049065317, "phrase": "short_formative_diagnostic_web"}, {"score": 0.004755650013733963, "phrase": "minimal_feedback"}, {"score": 0.004601045179623499, "phrase": "basic_concepts"}, {"score": 0.0045443671106012405, "phrase": "good_study_habits"}, {"score": 0.004324521292490181, "phrase": "crucial_first_few_weeks"}, {"score": 0.003773049633656302, "phrase": "students'_learning"}, {"score": 0.00354612982432807, "phrase": "sweden"}, {"score": 0.0034735460620039203, "phrase": "usa."}, {"score": 0.003444912629614206, "phrase": "students'_views"}, {"score": 0.0034024277222012597, "phrase": "quizzes'_effect"}, {"score": 0.003264547032549398, "phrase": "almost_all_students"}, {"score": 0.0025361866386341796, "phrase": "positive_effects"}, {"score": 0.0023346234464901978, "phrase": "automatic_formative_assessment"}, {"score": 0.0021579641460002523, "phrase": "automatic_feedback"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Improving classroom teaching", " Interactive learning environments", " Distance education and telelearning", " Post-secondary education"], "paper_abstract": "To help students gauge their understanding of basic concepts and encourage good study habits, we administered short online quizzes that use generic questions in the crucial first few weeks of a course. The purpose of the study was to investigate whether the combination of these web quizzes with generic questions with only binary feedback (right or wrong) would be beneficial for students' learning. We implemented these quizzes in three classes in two different subjects at two different universities, one in Sweden and one in the USA. The students' views on the quizzes' effect on their learning was investigated with surveys and interviews. Almost all students appreciated having these quizzes and 38% of them changed their view on how much they knew of the material covered in the course. Furthermore, over 20% of the students reported altering their study habits as a consequence, in particular studying harder or earlier. In conclusion, this study indicated that short quizzes using generic questions with limited correct/incorrect feedback on each question, have positive effects when administered early in courses. The combination of generic questions and short quizzes could be of value for those contemplating automatic formative assessment, particularly if there is some hesitation with respect to the resources needed for constructing and validating the automatic feedback. (C) 2012 Elsevier Ltd. All rights reserved.", "paper_title": "The effect of short formative diagnostic web quizzes with minimal feedback", "paper_id": "WOS:000312231900021"}