{"auto_keywords": [{"score": 0.04166278199109337, "phrase": "reusing_times"}, {"score": 0.0093442988087738, "phrase": "data-reusing_scheme"}, {"score": 0.007596273237607055, "phrase": "convergence_rate"}, {"score": 0.0064075249234117225, "phrase": "fdrnlms"}, {"score": 0.005791179214405852, "phrase": "nlms"}, {"score": 0.00481495049065317, "phrase": "convergence_performance_analyses"}, {"score": 0.004763895422211728, "phrase": "fast_data-reusing_normalized_least_mean"}, {"score": 0.004374385639298755, "phrase": "high_convergence_rate"}, {"score": 0.003931798194574009, "phrase": "input_signal_vector's_variance"}, {"score": 0.0037474693720823643, "phrase": "adaptive_filter"}, {"score": 0.0035908627899097407, "phrase": "large_number"}, {"score": 0.0032969458013463807, "phrase": "high_variance"}, {"score": 0.003244567402785763, "phrase": "input_vector"}, {"score": 0.0030595112110658675, "phrase": "computational_complexity"}, {"score": 0.002824005136794786, "phrase": "proposed_fdrnlms"}, {"score": 0.002794001681064862, "phrase": "minimal_computation"}, {"score": 0.00256514094268541, "phrase": "filter_output"}, {"score": 0.002497531381123025, "phrase": "computation_complexity"}, {"score": 0.0021049977753042253, "phrase": "conventional_data-reusing_schemes"}], "paper_keywords": [""], "paper_abstract": "As hardware platforms increase in computation capability, multiple filter coefficient adaptations between two neighboring input signals can be realized to achieve a high convergence rate. This study explores the data-reusing scheme based on the Normalized Least Mean Squared (NLMS) algorithm. Moreover, the impacts of the reusing times and input signal vector's variance to the convergence rate and misadjustment of an adaptive filter are theoretically derived and analyzed. A large number of reusing times was found to raise the convergence rate but also increase misadjustament, while a high variance of an input vector was found to lower misadjustment and expedite the convergence rate. To reduce computational complexity of the data-reusing scheme, this study develops the Fast Data-Reusing NLMS (FDRNLMS) algorithm. The proposed FDRNLMS requires minimal computation for the adaptation scaling factor, and only requires two more multiplication operations than NLMS in calculating each filter output. Additionally, the computation complexity of this FDRNLMS is independent of the number of reusing times. Therefore, the FDRNLMS proposed herein is superior to the NLMS and Least Mean Squared (LMS) algorithms using conventional data-reusing schemes which have computation complexity proportional to the number of reusing times.", "paper_title": "Convergence performance analyses of fast data-reusing Normalized Least Mean Squared algorithm", "paper_id": "WOS:000243703300028"}