{"auto_keywords": [{"score": 0.04899714673960484, "phrase": "dual_model-based_architecture"}, {"score": 0.032024358052468976, "phrase": "modeling_errors"}, {"score": 0.0044957939485759995, "phrase": "err_domain_knowledge"}, {"score": 0.004294813202198633, "phrase": "fundamental_role"}, {"score": 0.004225223692701494, "phrase": "semantic_interoperability"}, {"score": 0.004143196873246147, "phrase": "formal_methods"}, {"score": 0.0039579160185689325, "phrase": "increasing_interest"}, {"score": 0.003906510969606783, "phrase": "semantic_web_technologies"}, {"score": 0.0033831234599419435, "phrase": "owl_ontologies"}, {"score": 0.0031482594269532254, "phrase": "owl_format"}, {"score": 0.0031175178621644464, "phrase": "validation_method"}, {"score": 0.0029877254536170017, "phrase": "incorrect_restrictions"}, {"score": 0.002958546790146313, "phrase": "reference_model"}, {"score": 0.002744085965194991, "phrase": "nhs"}, {"score": 0.0025368092524479615, "phrase": "software_tool"}, {"score": 0.00245512454195783, "phrase": "archetype_specializations"}, {"score": 0.0023682987863242427, "phrase": "coded_terms"}, {"score": 0.002352844633115289, "phrase": "terminological_bindings"}, {"score": 0.0022845366011378238, "phrase": "different_patterns"}, {"score": 0.002167949230651206, "phrase": "serious_efforts"}, {"score": 0.0021467594103960585, "phrase": "archetype_design_processes"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Electronic healthcare records", " Archetypes", " Ontologies", " OWL"], "paper_abstract": "Some modern Electronic Healthcare Record (EHR) architectures and standards are based on the dual model-based architecture, which defines two conceptual levels: reference model and archetype model. Such architectures represent ERR domain knowledge by means of archetypes, which are considered by many researchers to play a fundamental role for the achievement of semantic interoperability in healthcare. Consequently, formal methods for validating archetypes are necessary. In recent years, there has been an increasing interest in exploring how semantic web technologies in general, and ontologies in particular, can facilitate the representation and management of archetypes, including binding to terminologies, but no solution based on such technologies has been provided to date to validate archetypes. Our approach represents archetypes by means of OWL ontologies. This permits to combine the two levels of the dual model-based architecture in one modeling framework which can also integrate terminologies available in OWL format. The validation method consists of reasoning on those ontologies to find modeling errors in archetypes: incorrect restrictions over the reference model, non-conformant archetype specializations and inconsistent terminological bindings. The archetypes available in the repositories supported by the openEHR Foundation and the NHS Connecting for Health Program, which are the two largest publicly available ones, have been analyzed with our validation method. For such purpose, we have implemented a software tool called Archeck. Our results show that around 1/5 of archetype specializations contain modeling errors, the most common mistakes being related to coded terms and terminological bindings. The analysis of each repository reveals that different patterns of errors are found in both repositories. This result reinforces the need for making serious efforts in improving archetype design processes. (c) 2012 Elsevier Inc. All rights reserved.", "paper_title": "OWL-based reasoning methods for validating archetypes", "paper_id": "WOS:000317322500011"}