{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "tricyclic_graphs"}, {"score": 0.01053620114577033, "phrase": "maximal_energy"}, {"score": 0.007397731169459769, "phrase": "single_edge"}, {"score": 0.004660453113061494, "phrase": "simple_graph"}, {"score": 0.004646988348405876, "phrase": "g"}, {"score": 0.0045108906244892165, "phrase": "absolute_values"}, {"score": 0.004318881178805575, "phrase": "i._gutman"}, {"score": 0.003059869469624301, "phrase": "li_et_al"}, {"score": 0.0030267296900520217, "phrase": "x._li"}, {"score": 0.0030048355421601705, "phrase": "y._shi"}, {"score": 0.0029830992938695007, "phrase": "m._wei"}, {"score": 0.002961519813246521, "phrase": "j._li"}, {"score": 0.0023817332409567403, "phrase": "connected_bipartite_tricyclic_graphs"}, {"score": 0.0022718774783143203, "phrase": "c-k"}], "paper_keywords": [""], "paper_abstract": "The energy epsilon(G) of a simple graph G is defined as the sum of the absolute values of all eigenvalues of its adjacency matrix. This concept was introduced by I. Gutman in 1977. Recently, Aouchiche et al. proposed a conjecture about tricyclic graphs: If G is a tricyclic graphs on n vertices with n = 20 or n >= 22, then epsilon(G) <= epsilon(P-n(6,6,6)) with equality if and only if G congruent to P-n(6,6,6) where P-n(6,6,6) denotes the graph with n >= 20 vertices obtained from three copies of C-6 and a path Pn-18 by adding a single edge between each of two copies of C-6 to one endpoint of the path and a single edge from the third C-6 to the other endpoint of the Pn-18. Li et al. [X. Li, Y. Shi, M. Wei, J. Li, On a conjecture about tricyclic graphs with maximal energy, MATCH Commun. Math. Comput. Chem. 72 (2014) 183-214] proved that the conjecture is true for graphs in the graph class g(n; a, b, k), where g(n; a, 5, k) denotes the set of all connected bipartite tricyclic graphs on n >= 20 vertices with three vertex-disjoint cycles C-a, C-b and C-k, apart from 9 subclasses of such graphs. In this paper, we improve the above result and prove that apart from 7 smaller subclasses of such graphs the conjecture is true for graphs in the graph class g(n; a, b, k).", "paper_title": "More on a Conjecture about Tricyclic Graphs with Maximal Energy", "paper_id": "WOS:000350704500002"}