{"auto_keywords": [{"score": 0.02600370179822085, "phrase": "average_delay"}, {"score": 0.007400630310683644, "phrase": "prior_scheme"}, {"score": 0.00481495049065317, "phrase": "vehicular_ad_hoc_network"}, {"score": 0.004783874158934273, "phrase": "vanet"}, {"score": 0.004722254884093624, "phrase": "emerging_type"}, {"score": 0.00436890075128947, "phrase": "valid_vehicles"}, {"score": 0.004312622975366672, "phrase": "malevolent_vehicles"}, {"score": 0.004121275290411653, "phrase": "effective_message_verification_scheme"}, {"score": 0.004055005811039783, "phrase": "public_key_infrastructure"}, {"score": 0.003788069044402032, "phrase": "known_vehicles"}, {"score": 0.0036790959367543337, "phrase": "group_communication"}, {"score": 0.003493021648360933, "phrase": "use_pairing_operation"}, {"score": 0.0032418515965728775, "phrase": "secure_schemes"}, {"score": 0.0032208807810825933, "phrase": "hash-based_message_authentication_code"}, {"score": 0.003038125530190128, "phrase": "pairing_operation"}, {"score": 0.0024048460326284416, "phrase": "nearly_thousands"}, {"score": 0.002366110899738696, "phrase": "prior_schemes"}], "paper_keywords": ["Secure vehicular sensor network", " Authentication", " Group communication", " HMAC", " Symmetric cryptography"], "paper_abstract": "Vehicular Ad Hoc Network (VANET) is an emerging type of network which facilitates vehicles on roads to communicate for driving safety. It requires a mechanism to help authenticate messages, identify valid vehicles, and remove malevolent vehicles which do not obey the rules. Most existing solutions either do not have an effective message verification scheme, or use the public key infrastructure (PKI). In this network, vehicles are able to broadcast messages to other vehicles and a group of known vehicles can also communicate securely among themselves. So group communication is necessary for the network. However, most existing solutions either do not consider this or use pairing operation to realize this. They are either not secure or not effective. In this paper, we provide a more comprehensive set of secure schemes with Hash-based Message Authentication Code (HMAC) in VANETs to overcome their shortcomings. Of course, we still need to use Pairing operation in some place. Our scheme is composed of three schemes: (1) Communications between Vehicles and Road-Side Units (RSUs), (2) One to One Communications within a Group, (3) One to One Communications without a Group. Based on our simulation study, we show that our schemes are effective and the delay caused is much lower. The average delay caused by our first scheme is nearly thousands of times lower than prior schemes. The average delay caused by our second scheme is 0.312 ms, while the delay caused by prior scheme is 12.3 ms. Meanwhile the average delay caused by our third scheme is 0.312 ms, and the delay caused by prior scheme is about 9 s. (c) 2012 Elsevier B.V. All rights reserved.", "paper_title": "Efficient HMAC-based secure communication for VANETs", "paper_id": "WOS:000305367900005"}