{"auto_keywords": [{"score": 0.04962656673317322, "phrase": "bacterial_nanonetworks"}, {"score": 0.015139960890240665, "phrase": "molecular_communication"}, {"score": 0.01346063765393457, "phrase": "biological_properties"}, {"score": 0.00481495049065317, "phrase": "social_behavior"}, {"score": 0.004255639740735269, "phrase": "new_possible_applications"}, {"score": 0.003962899903266524, "phrase": "possible_information_carrier"}, {"score": 0.0038515000499988673, "phrase": "corresponding_communication_networks"}, {"score": 0.0034526191487098093, "phrase": "deoxyribonucleic_acid_molecules"}, {"score": 0.0032922964156452696, "phrase": "complex_social_properties"}, {"score": 0.003199687131875466, "phrase": "social_characteristics"}, {"score": 0.003022186855664124, "phrase": "non-cooperative_behaviors"}, {"score": 0.002895535087931938, "phrase": "different_types"}, {"score": 0.002868116925014397, "phrase": "cooperative_and_non-cooperative_social_behavior"}, {"score": 0.00241658945942583, "phrase": "simulation_results"}, {"score": 0.002359759876402679, "phrase": "bacterial_cooperative_social_behavior"}, {"score": 0.0022393843660697484, "phrase": "single-link_bacterial_nanonetwork"}, {"score": 0.0021352776064254195, "phrase": "potential_future_research_opportunities"}, {"score": 0.0021049977753042253, "phrase": "emerging_field"}], "paper_keywords": [""], "paper_abstract": "Molecular communication holds the promise to enable communication between nanomachines with a view to increasing their functionalities and opening up new possible applications. Due to some of the biological properties, bacteria have been proposed as a possible information carrier for molecular communication, and the corresponding communication networks are known as bacterial nanonetworks. The biological properties include the ability for bacteria to mobilize between locations and carry the information encoded in deoxyribonucleic acid molecules. However, similar to most organisms, bacteria have complex social properties that govern their colony. These social characteristics enable the bacteria to evolve through various fluctuating environmental conditions by utilizing cooperative and non-cooperative behaviors. This article provides an overview of the different types of cooperative and non-cooperative social behavior of bacteria. The challenges (due to non-cooperation) and the opportunities (due to cooperation) these behaviors can bring to the reliability of communication in bacterial nanonetworks are also discussed. Finally, simulation results on the impact of bacterial cooperative social behavior on the end-to-end reliability of a single-link bacterial nanonetwork are presented. The article concludes by highlighting the potential future research opportunities in this emerging field.", "paper_title": "Social Behavior in Bacterial Nanonetworks: Challenges and Opportunities", "paper_id": "WOS:000348385700004"}