{"auto_keywords": [{"score": 0.04849559522610525, "phrase": "pervasive_games"}, {"score": 0.039037622932117474, "phrase": "double_reading"}, {"score": 0.00481495049065317, "phrase": "pervasive_applications"}, {"score": 0.004589124394375718, "phrase": "virtual_layer"}, {"score": 0.003878625406105021, "phrase": "virtual_level"}, {"score": 0.0038047474331318974, "phrase": "semiotic_process"}, {"score": 0.003325410433297401, "phrase": "\"uncanny_mode"}, {"score": 0.0029343925814926787, "phrase": "hidden_layers"}, {"score": 0.0025034338848015166, "phrase": "different_types"}, {"score": 0.00242047093248845, "phrase": "mimetic_narrative_strategies"}, {"score": 0.0021049977753042253, "phrase": "specific_play"}], "paper_keywords": ["Pervasive game", " Mobility", " Uncanny", " Game design", " Narrative", " Storytelling", " Semiotics", " Fantastic"], "paper_abstract": "In pervasive games, a virtual layer with its own logic is added to the everyday, common meaning of objects, places, and people. The departure of the signifier (\"things\") from the signified (what they mean on the virtual level) is the semiotic process that allows for a double reading of the environment. Such a divorce has been explored in other cultural products (books, movies). It has been qualified as the \"uncanny mode\". This article analyzes how pervasive games use their own brand of uncanny. In particular, it shows how mobility becomes the way to uncover the hidden layers of the environment and serves as a tool to experience and eventually reduce or augment the uncanny. Finally, we can point to a typology of four main types of storytelling related to different types of mobility: games that use mimetic narrative strategies veering towards \"realism\"; games based on the \"absurd\"; \"aloof\" games that remain independent from places; games that present a specific play on this double reading of the world and develop the \"Uncanny\" as a genre.", "paper_title": "The game mechanics of pervasive applications: visiting the uncanny", "paper_id": "WOS:000302440500006"}