{"auto_keywords": [{"score": 0.04566265099632426, "phrase": "final_event"}, {"score": 0.02965191064180418, "phrase": "new_fitting_method"}, {"score": 0.00481495049065317, "phrase": "relative_survival_analysis"}, {"score": 0.004742904841489477, "phrase": "survival_analysis"}, {"score": 0.0039576799833721315, "phrase": "cause-specific_deaths"}, {"score": 0.0037034335789757514, "phrase": "different_causes"}, {"score": 0.003539479990299223, "phrase": "terminal_cancer_patients"}, {"score": 0.003507567662772987, "phrase": "typical_example"}, {"score": 0.0034550163444256386, "phrase": "standard_survival_techniques"}, {"score": 0.003252542052430779, "phrase": "relative_survival_techniques"}, {"score": 0.003213489259323921, "phrase": "survival_experience"}, {"score": 0.0031845067058084613, "phrase": "study_cohort"}, {"score": 0.003099113156350047, "phrase": "background_population_mortality_rates"}, {"score": 0.0028391824655912617, "phrase": "relative_survival"}, {"score": 0.0027713837460773974, "phrase": "additive_model"}, {"score": 0.0026889014020738578, "phrase": "parameter_estimation"}, {"score": 0.002640591917408814, "phrase": "baseline_excess_hazard"}, {"score": 0.002593148116433219, "phrase": "reader's_attention"}, {"score": 0.0025312097004307013, "phrase": "easy_and_flexible_fitting"}, {"score": 0.002297867835438532, "phrase": "population_mortality_data"}, {"score": 0.002202651051682622, "phrase": "data_sets"}, {"score": 0.0021827653135510225, "phrase": "powerful_informational_tool"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["relative survival", " R software", " regression", " population tables"], "paper_abstract": "In survival analysis we are interested in time from the beginning of an observation until certain event (death, relapse, etc.). We assume that the final event is well defined, so that we are never in doubt whether the final event has occurred or not. In practice this is not always true. If we are interested in cause-specific deaths, then it may sometimes be difficult or even impossible to establish the cause of death, or there may be different causes of death, making it impossible to assign death to just one cause. Suicides of terminal cancer patients are a typical example. In such cases, standard survival techniques cannot be used for estimation of mortality due to a certain cause. The cure to the problem are relative survival techniques which compare the survival experience in a study cohort to the one expected should they follow the background population mortality rates. This enables the estimation of the proportion of deaths due to a certain cause. In this paper, we briefly review some of the techniques to model relative survival, and outline a new fitting method for the additive model, which solves the problem of dependency of the parameter estimation on the assumption about the baseline excess hazard. We then direct the reader's attention to our R package relsurv that provides functions for easy and flexible fitting of all the commonly used relative survival regression models. The basic features of the package have been described in detail elsewhere, but here we additionally explain the usage of the new fitting method and the interface for using population mortality data freely available on the Internet. The combination of the package and the data sets provides a powerful informational tool in the hands of a skilled statistician/informatician. (c) 2007 Elsevier Ltd. All rights reserved.", "paper_title": "Making relative survival analysis relatively easy", "paper_id": "WOS:000251476100008"}