{"auto_keywords": [{"score": 0.04740170155072888, "phrase": "communication_energy"}, {"score": 0.030504201814265684, "phrase": "proposed_approach"}, {"score": 0.00481495049065317, "phrase": "reconfigurable_noc_architectures"}, {"score": 0.004695389394526107, "phrase": "efficient_application_mapping_approach"}, {"score": 0.004307459965946991, "phrase": "corep"}, {"score": 0.004215571179806372, "phrase": "overall_cost"}, {"score": 0.0038810583785936505, "phrase": "energy_latency_product"}, {"score": 0.0037846021510510824, "phrase": "elp"}, {"score": 0.0036640806940633373, "phrase": "weight_parameter"}, {"score": 0.003611751858608048, "phrase": "optimization_priority"}, {"score": 0.0035729944980593324, "phrase": "transient_and_intermittent_errors"}, {"score": 0.003547403120679893, "phrase": "noc"}, {"score": 0.003161674440750158, "phrase": "best_mapping"}, {"score": 0.0030830390264125923, "phrase": "search_tree"}, {"score": 0.003038983069081333, "phrase": "branch_node_priority_recognition"}, {"score": 0.0030171910207671205, "phrase": "partial_cost_ratio_utilization"}, {"score": 0.002942138511829811, "phrase": "search_efficiency"}, {"score": 0.0029210388852074208, "phrase": "experimental_results"}, {"score": 0.0028586409810976367, "phrase": "significant_improvements"}, {"score": 0.0023199580436336163, "phrase": "unified_cost_model"}, {"score": 0.0023033100935570755, "phrase": "general_context"}, {"score": 0.002174346780014853, "phrase": "prbb"}, {"score": 0.0021509807762081145, "phrase": "competitive_processing_speed"}], "paper_keywords": ["Energy", " latency", " mapping algorithm", " network-on-chip (NoC)", " reliability"], "paper_abstract": "In this paper, an efficient application mapping approach is proposed for the co-optimization of reliability, communication energy, and performance (CoREP) in network-on-chip (NoC)-based reconfigurable architectures. A cost model for the CoREP is developed to evaluate the overall cost of a mapping. In this model, communication energy and latency (as a measure of performance) are first considered in energy latency product (ELP), and then ELP is co-optimized with reliability by a weight parameter that defines the optimization priority. Both transient and intermittent errors in NoC are modeled in CoREP. Based on CoREP, a mapping approach, referred to as priority and ratio oriented branch and bound (PRBB), is proposed to derive the best mapping by enumerating all the candidate mappings organized in a search tree. Two techniques, branch node priority recognition and partial cost ratio utilization, are adopted to improve the search efficiency. Experimental results show that the proposed approach achieves significant improvements in reliability, energy, and performance. Compared with the state-of-the-art methods in the same scope, the proposed approach has the following distinctive advantages: 1) CoREP is highly flexible to address various NoC topologies and routing algorithms while others are limited to some specific topologies and/or routing algorithms; 2) general quantitative evaluation for reliability, energy, and performance are made, respectively, before being integrated into unified cost model in general context while other similar models only touch upon two of them; and 3) CoREP-based PRBB attains a competitive processing speed, which is faster than other mapping approaches.", "paper_title": "An Efficient Application Mapping Approach for the Co-Optimization of Reliability, Energy, and Performance in Reconfigurable NoC Architectures", "paper_id": "WOS:000358620700005"}