{"auto_keywords": [{"score": 0.04378244379633523, "phrase": "secret_messages"}, {"score": 0.02712650942783671, "phrase": "meaningless_shares"}, {"score": 0.004453874101119545, "phrase": "n_participants"}, {"score": 0.004317109072311102, "phrase": "secret_message"}, {"score": 0.003850464100878052, "phrase": "human_eye"}, {"score": 0.0032430426853131346, "phrase": "pixel_expansion"}, {"score": 0.0031107911390188055, "phrase": "chen_et_al."}, {"score": 0.0027311809666295565, "phrase": "used_shares"}, {"score": 0.0024103044278902916, "phrase": "difficult_encryption_management"}], "paper_keywords": ["visual secret sharing", " image encryption", " random grids", " pixel expansion"], "paper_abstract": "In (k,n)-threshold visual secret sharing (VSS) schemes, the secret holder can base a group of n participants with n shares to reconstruct secret message by stacking shares. The secret messages are identified directly without any computation with only k(k <= n) or more shares using the human eye. Recently, many researchers have devoted themselves to studying how more secret images can be encrypted into the same quantity of shares. An extended random-grid VSS scheme that can embed four secret images without pixel expansion under the (2,2)-visual secret-sharing scheme was proposed by Chen et al. The secrets can be recovered by directly stacking and rotating one of the two shares at 90 degrees, 180 degrees and 270 degrees, respectively. However, the used shares are meaningless, causing the attacker to become doubtful by looking at meaningless shares and trying to steal secret messages. The meaningless shares lead to difficult encryption management. This paper proposes an improved black-and-white (2,2)-visual secret sharing scheme that adapts square shares to embed three secret images via two camouflaged images. Compared with other related VSS schemes, this technique has more flexibility, efficiency and security.", "paper_title": "Meaningful Share Generation for (2,2)-Multiple Visual Secret Sharing Scheme Without Pixel Expansion", "paper_id": "WOS:000359141100007"}