{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "sealed-offer_simultaneous_bargaining_protocol"}, {"score": 0.004738078275822989, "phrase": "-offer_bargaining_protocol"}, {"score": 0.0045879792359519375, "phrase": "bilateral_bargaining_problem"}, {"score": 0.004324985524216987, "phrase": "low_efficiency"}, {"score": 0.003603327452846714, "phrase": "agent-based_sealed-offer"}, {"score": 0.003470358620464986, "phrase": "nonbiased_mediator"}, {"score": 0.0030834712590249863, "phrase": "mediate_agent"}, {"score": 0.002769209760453212, "phrase": "effectively_control"}, {"score": 0.0025137856138000014, "phrase": "available_information"}, {"score": 0.0023694065215394593, "phrase": "optimal_offers"}, {"score": 0.002209406458446019, "phrase": "automated_experiments"}, {"score": 0.0021049977753042253, "phrase": "proposed_automated_negotiation_procedure"}], "paper_keywords": ["automated negotiation", " bargaining", " sealed-bid", " optimal strategy"], "paper_abstract": "Alternating-offer bargaining protocol is the most predominant way for solving bilateral bargaining problem. However, alternating-offer may consume much time and cause a low efficiency in some cases. Especially, a deadlock in which both negotiators are unwilling to concede or refuse to disclose more information may arise. Then mediation is required. This paper presents an agent-based sealed-offer simultaneous bargaining protocol by introducing a nonbiased mediator. The information of both agents is considered completely private. In our agent-based model, both agents simultaneously submit their respective offers to the mediate agent. The offers of each agent are not revealed to the opponent. This design can discourage counter-speculation and effectively control fraud and misrepresentation in a certain extent. Further, we analyze how an agent can exploit the available information in selecting a strategy that maximizes its expected utility and give the optimal offers of each agent at each stage of the negotiation. Four groups of automated experiments are conducted to evaluate the performance of the proposed automated negotiation procedure.", "paper_title": "Optimality strategy of a sealed-offer simultaneous bargaining protocol", "paper_id": "WOS:000286497800008"}