{"auto_keywords": [{"score": 0.04977793821547788, "phrase": "data_breach"}, {"score": 0.049181877671157906, "phrase": "data_breach_incidents"}, {"score": 0.04644191721505327, "phrase": "opportunity_theory"}, {"score": 0.008713768692145006, "phrase": "contextual_risk"}, {"score": 0.007929909983328575, "phrase": "institutional_anomie_theory"}, {"score": 0.00785548011945575, "phrase": "institutional_theory"}, {"score": 0.004578030096508602, "phrase": "severe_financial_and_legal_implications"}, {"score": 0.004009894739765119, "phrase": "organization's_physical_location"}, {"score": 0.0033814348757887232, "phrase": "primary_industry"}, {"score": 0.002702081704660048, "phrase": "possible_explanation"}, {"score": 0.002576988153314685, "phrase": "right_kind"}, {"score": 0.002560751416355291, "phrase": "data_security_controls"}, {"score": 0.002449915958738505, "phrase": "theoretical_and_practical_implications"}, {"score": 0.002373690110881497, "phrase": "risk_factors"}, {"score": 0.0022002633747977593, "phrase": "risk_environment"}, {"score": 0.0021521046447238964, "phrase": "data_breaches"}, {"score": 0.0021183508914633478, "phrase": "firm's_location"}], "paper_keywords": ["computer crime", " computer security", " data breach", " data theft", " information security", " IT security risks"], "paper_abstract": "Data breach incidents are on the rise, and have resulted in severe financial and legal implications for the affected organizations. We apply the opportunity theory of crime, the institutional anomie theory, and institutional theory to identify factors that could increase or decrease the contextual risk of data breach. We investigate the risk of data breach in the context of an organization's physical location, its primary industry, and the type of data breach that it may have suffered in the past. Given the location of an organization, the study finds support for application of the opportunity theory of crime and the institutional anomie theory in estimating the risk of data breach incidents within a state. In the context of the primary industry in which an organization operates, we find support for the institutional theory and the opportunity theory of crime in estimating risk of data breach incidents within an industry. Interestingly though, support for the opportunity theory of crime is partial. We find that investment in information technology (IT) security corresponds to a higher risk of data breach incidents within both a state and an industry, a result contrary to the one predicted by the opportunity theory of crime. A possible explanation for the contradiction is that investments in IT security are not being spent on the right kind of data security controls, a fact supported by evidence from the industry. The work has theoretical and practical implications. Theories from criminology are used to identify the risk factors of data breach incidents and the magnitude of their impact on the risk of data breach. Insights from the study can help IT security practitioners to assess the risk environment of their firm (in terms of data breaches) based on the firm's location, its industry sector, and the kind of breaches that the firm may typically be prone to.", "paper_title": "Estimating the Contextual Risk of Data Breach: An Empirical Approach", "paper_id": "WOS:000360594200012"}