{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "smart_devices"}, {"score": 0.004741575909417311, "phrase": "powerful_sensing"}, {"score": 0.0047125386314695455, "phrase": "computing_and_networking_capabilities"}, {"score": 0.004612294931699583, "phrase": "popular_smartphones"}, {"score": 0.004555968736680118, "phrase": "internet_appliances"}, {"score": 0.004528062940497773, "phrase": "smart_tvs"}, {"score": 0.004180403355909392, "phrase": "third-party_apps"}, {"score": 0.004066360459825868, "phrase": "strong_security"}, {"score": 0.003979807104455635, "phrase": "infrastructure_operators"}, {"score": 0.0037310040297385346, "phrase": "sensory_data"}, {"score": 0.0037081324077511482, "phrase": "personal_information"}, {"score": 0.0036628073805800377, "phrase": "current_smart_devices"}, {"score": 0.0034977005973838306, "phrase": "sophisticated_techniques"}, {"score": 0.0034443299902626834, "phrase": "security_architectures"}, {"score": 0.003350299880802315, "phrase": "important_advances"}, {"score": 0.0032991709808491147, "phrase": "malware_detection"}, {"score": 0.003278937848591921, "phrase": "traditional_personal_computers"}, {"score": 0.003150403848652526, "phrase": "challenging_problem"}, {"score": 0.003102316064687607, "phrase": "power_consumption"}, {"score": 0.0030268930660241563, "phrase": "traditional_detection_engines"}, {"score": 0.0027855826070576403, "phrase": "recent_progress"}, {"score": 0.002759983642011259, "phrase": "detection_techniques"}, {"score": 0.002709487386923251, "phrase": "detailed_analysis"}, {"score": 0.0025952171827648665, "phrase": "exhibited_behaviors"}, {"score": 0.0024857542101349808, "phrase": "numerous_examples"}, {"score": 0.0024704972295365164, "phrase": "case_studies"}, {"score": 0.0021641529087429797, "phrase": "constructive_discussion"}, {"score": 0.0021508655858525683, "phrase": "open_research_problems"}], "paper_keywords": ["smart devices", " malware", " grayware", " smartphones", " security", " privacy"], "paper_abstract": "Smart devices equipped with powerful sensing, computing and networking capabilities have proliferated lately, ranging from popular smartphones and tablets to Internet appliances, smart TVs, and others that will soon appear (e.g., watches, glasses, and clothes). One key feature of such devices is their ability to incorporate third-party apps from a variety of markets. This poses strong security and privacy issues to users and infrastructure operators, particularly through software of malicious (or dubious) nature that can easily get access to the services provided by the device and collect sensory data and personal information. Malware in current smart devices -mostly smartphones and tablets- have rocketed in the last few years, in some cases supported by sophisticated techniques purposely designed to overcome security architectures currently in use by such devices. Even though important advances have been made on malware detection in traditional personal computers during the last decades, adopting and adapting those techniques to smart devices is a challenging problem. For example, power consumption is one major constraint that makes unaffordable to run traditional detection engines on the device, while externalized (i.e., cloud-based) techniques rise many privacy concerns. This article examines the problem of malware in smart devices and recent progress made in detection techniques. We first present a detailed analysis on how malware has evolved over the last years for the most popular platforms. We identify exhibited behaviors, pursued goals, infection and distribution strategies, etc. and provide numerous examples through case studies of the most relevant specimens. We next survey, classify and discuss efforts made on detecting both malware and other suspicious software (grayware), concentrating on the 20 most relevant techniques proposed between 2010 and 2013. Based on the conclusions extracted from this study, we finally provide constructive discussion on open research problems and areas where we believe that more work is needed.", "paper_title": "Evolution, Detection and Analysis of Malware for Smart Devices", "paper_id": "WOS:000339727700019"}