{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "domain_knowledge"}, {"score": 0.014838324958692202, "phrase": "coreference_resolution"}, {"score": 0.008519118076468966, "phrase": "clinical_narratives"}, {"score": 0.004783852487938866, "phrase": "domain-inspired_discourse_model"}, {"score": 0.004601417929493065, "phrase": "coreference_resolution_system"}, {"score": 0.004425909662226326, "phrase": "single_document"}, {"score": 0.004397313229350093, "phrase": "coherent_entities"}, {"score": 0.004312622975366672, "phrase": "knowledge-intensive_approach"}, {"score": 0.00397688190820577, "phrase": "mention_parsing"}, {"score": 0.0038876302202924644, "phrase": "surface_form"}, {"score": 0.0037635782112965662, "phrase": "higher-level_representation"}, {"score": 0.003691048155818806, "phrase": "mention's_semantic_representation"}, {"score": 0.0035616743422949766, "phrase": "standard_form"}, {"score": 0.003515758094739175, "phrase": "better_support"}, {"score": 0.0034479873922329323, "phrase": "existing_coreference_resolution_systems"}, {"score": 0.0034035317633176352, "phrase": "discourse_aspects"}, {"score": 0.003348764681887211, "phrase": "lexical_and_structural_cues"}, {"score": 0.003200045185608395, "phrase": "discourse_model"}, {"score": 0.0031793439438669176, "phrase": "\"person\"_type_mentions"}, {"score": 0.002837938282751276, "phrase": "muc"}, {"score": 0.0028195727965553367, "phrase": "ceaf"}, {"score": 0.0026768530320943063, "phrase": "different_mention_types"}, {"score": 0.0026423134393535265, "phrase": "discussion_error_analysis"}, {"score": 0.002591335708291347, "phrase": "recall_errors"}, {"score": 0.0024761702541879213, "phrase": "precision_errors"}, {"score": 0.0022904980438110613, "phrase": "robust_coreference_system"}, {"score": 0.0022101055924375725, "phrase": "extensive_use"}, {"score": 0.0021049977753042253, "phrase": "knowledge_sources"}], "paper_keywords": [""], "paper_abstract": "Objective This paper presents a coreference resolution system for clinical narratives. Coreference resolution aims at clustering all mentions in a single document to coherent entities. Materials and methods A knowledge-intensive approach for coreference resolution is employed. The domain knowledge used includes several domain-specific lists, a knowledge intensive mention parsing, and task informed discourse model. Mention parsing allows us to abstract over the surface form of the mention and represent each mention using a higher-level representation, which we call the mention's semantic representation (SR). SR reduces the mention to a standard form and hence provides better support for comparing and matching. Existing coreference resolution systems tend to ignore discourse aspects and rely heavily on lexical and structural cues in the text. The authors break from this tradition and present a discourse model for \"person\" type mentions in clinical narratives, which greatly simplifies the coreference resolution. Results This system was evaluated on four different datasets which were made available in the 2011 i2b2/VA coreference challenge. The unweighted average of F1 scores (over B-cubed, MUC and CEAF) varied from 84.2% to 88.1%. These experiments show that domain knowledge is effective for different mention types for all the datasets. Discussion Error analysis shows that most of the recall errors made by the system can be handled by further addition of domain knowledge. The precision errors, on the other hand, are more subtle and indicate the need to understand the relations in which mentions participate for building a robust coreference system. Conclusion This paper presents an approach that makes an extensive use of domain knowledge to significantly improve coreference resolution. The authors state that their system and the knowledge sources developed will be made publicly available.", "paper_title": "Using domain knowledge and domain-inspired discourse model for coreference resolution for clinical narratives", "paper_id": "WOS:000314875100022"}