{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "optimal_price-rebate_schemes"}, {"score": 0.00462919213721188, "phrase": "cash_mail"}, {"score": 0.004278807087784626, "phrase": "consumer_perception"}, {"score": 0.003993958025223994, "phrase": "seller's_optimal_rebate_strategy"}, {"score": 0.003896871009090446, "phrase": "agent-based_modeling_approach"}, {"score": 0.003820896867623235, "phrase": "optimal_price"}, {"score": 0.0037834649508375544, "phrase": "rebate_value"}, {"score": 0.0033617891884360606, "phrase": "traditional_mathematical_modeling"}, {"score": 0.0028154895878702633, "phrase": "consumers'_memory"}, {"score": 0.002551231163230566, "phrase": "agent-based_modeling"}, {"score": 0.0025014259919355453, "phrase": "alternative_method"}, {"score": 0.0022777800735119405, "phrase": "regulating_agencies"}, {"score": 0.0022005118194652704, "phrase": "overall_behavior"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["agent-based modeling", " mail-in cash rebates", " pricing"], "paper_abstract": "Delayed incentives in the form of cash mail-in rebates have become very popular. While some research has been conducted on consumer perception and behavior toward rebates, little research has been undertaken with respect to a seller's optimal rebate strategy. We use an agent-based modeling approach for jointly determining optimal price and rebate value. This approach has been previously applied to pricing and can capture some aspects of the problem which are difficult to analyze using traditional mathematical modeling. The model indicates that rebates are much more profitable when their values are jointly determined with price. In addition, the profitability of rebates at a given time depends on past consumers' experience with rebates and that consumers' memory of their past rebate redemption behavior plays an important role in determining the profitability of rebates. Also, the analysis shows that agent-based modeling may provide an alternative method for analyzing problems in which interactions between participants in the systems, i.e. consumers, sellers, and regulating agencies, are important in determining the overall behavior of the system. (c) 2007 Elsevier B.V. All rights reserved.", "paper_title": "An agent based modeling approach for determining optimal price-rebate schemes", "paper_id": "WOS:000253327200008"}