{"auto_keywords": [{"score": 0.0496463517482477, "phrase": "multiple_agents"}, {"score": 0.04098894483094121, "phrase": "single_agent"}, {"score": 0.00481495049065317, "phrase": "unknown_graphs"}, {"score": 0.004664352260912174, "phrase": "distributed_version"}, {"score": 0.00460125407969429, "phrase": "graph_exploration_and_mapping_problem"}, {"score": 0.003503497128638099, "phrase": "small_public_bulletin_boards"}, {"score": 0.0032725712584012953, "phrase": "identically_labelled_map"}, {"score": 0.0026307897899760383, "phrase": "deterministic_algorithms"}, {"score": 0.0022640009579466924, "phrase": "labelled_map_construction"}, {"score": 0.002203016940021265, "phrase": "leader_election"}, {"score": 0.002105007807034302, "phrase": "elsevier"}], "paper_keywords": ["labelled map construction", " graph exploration", " leader election", " rendezvous", " anonymous mobile agents"], "paper_abstract": "We consider a distributed version of the graph exploration and mapping problem where a mobile agent has to traverse the edges of an unlabelled (i.e., anonymous) graph and return to its starting point, building a map of the graph in the process. In our case, instead of a single agent, there are k identical (i.e., mutually indistinguishable) agents initially dispersed among the n nodes of the graph. The agents can communicate by writing to the small public bulletin boards available at each node. The objective is for each agent to build an identically labelled map of the graph; we call this the Labelled Map Construction problem. This problem is much more difficult than exploration by a single agent, because it involves achieving cooperation among multiple agents. In fact, this problem is deterministically unsolvable in some cases. We present deterministic algorithms that successfully and efficiently solve the problem under the condition that the values of n and k are co-prime with each other. We also show how the problem of Labelled Map Construction is related to other problems like leader election and rendezvous of agents. (c) 2007 Elsevier B.V All rights reserved.", "paper_title": "Map construction of unknown graphs by multiple agents", "paper_id": "WOS:000250417300003"}