{"auto_keywords": [{"score": 0.04500759592957068, "phrase": "non-systematic_identifiers"}, {"score": 0.00481495049065317, "phrase": "non-systematic_chemical_identifiers"}, {"score": 0.00474827840031692, "phrase": "small-molecule_databases"}, {"score": 0.0046176782475198085, "phrase": "chemical_compound_databases"}, {"score": 0.004537875262684779, "phrase": "pharmaceutical_research"}, {"score": 0.004475022550508119, "phrase": "compound_information"}, {"score": 0.004404001523051213, "phrase": "chemical_structure_standardization"}, {"score": 0.0043367547691560175, "phrase": "chemical_databases"}, {"score": 0.004246947739596565, "phrase": "source-dependent_identifiers"}, {"score": 0.0037456980766939836, "phrase": "associated_structure"}, {"score": 0.0032236602306747637, "phrase": "eight_widely_used_chemical_databases"}, {"score": 0.0027936239349923464, "phrase": "small_extent"}, {"score": 0.0027452574218375593, "phrase": "wide_range"}, {"score": 0.002542174767860791, "phrase": "stereochemistry_information"}, {"score": 0.0025156683465194967, "phrase": "largest_reduction"}, {"score": 0.0021571346514418226, "phrase": "limited_extent"}, {"score": 0.0021049977753042253, "phrase": "database_integration"}], "paper_keywords": ["Molecular structure", " Chemical databases", " Non-systematic chemical identifiers", " Chemical name ambiguity", " Quality control"], "paper_abstract": "Background: A wide range of chemical compound databases are currently available for pharmaceutical research. To retrieve compound information, including structures, researchers can query these chemical databases using non-systematic identifiers. These are source-dependent identifiers (e.g., brand names, generic names), which are usually assigned to the compound at the point of registration. The correctness of non-systematic identifiers (i.e., whether an identifier matches the associated structure) can only be assessed manually, which is cumbersome, but it is possible to automatically check their ambiguity (i.e., whether an identifier matches more than one structure). In this study we have quantified the ambiguity of non-systematic identifiers within and between eight widely used chemical databases. We also studied the effect of chemical structure standardization on reducing the ambiguity of non-systematic identifiers. Results: The ambiguity of non-systematic identifiers within databases varied from 0.1 to 15.2 % (median 2.5 %). Standardization reduced the ambiguity only to a small extent for most databases. A wide range of ambiguity existed for non-systematic identifiers that are shared between databases (17.7-60.2 %, median of 40.3 %). Removing stereochemistry information provided the largest reduction in ambiguity across databases (median reduction 13.7 percentage points). Conclusions: Ambiguity of non-systematic identifiers within chemical databases is generally low, but ambiguity of non-systematic identifiers that are shared between databases, is high. Chemical structure standardization reduces the ambiguity to a limited extent. Our findings can help to improve database integration, curation, and maintenance.", "paper_title": "Ambiguity of non-systematic chemical identifiers within and between small-molecule databases", "paper_id": "WOS:000364629700001"}