{"auto_keywords": [{"score": 0.028468920438729128, "phrase": "chemical_space"}, {"score": 0.00481495049065317, "phrase": "chemical_database"}, {"score": 0.004648609688625397, "phrase": "chemical_cliches"}, {"score": 0.004527619017250708, "phrase": "different_compounds"}, {"score": 0.00439041997682389, "phrase": "electronic_databases"}, {"score": 0.004238682850598745, "phrase": "valuable_insights"}, {"score": 0.0039333604469462356, "phrase": "public_database"}, {"score": 0.002753891109273246, "phrase": "fragment_data"}, {"score": 0.0024776677004255104, "phrase": "novel_chemical_compounds"}, {"score": 0.002258745901862197, "phrase": "easily_accessible_repository"}, {"score": 0.0022389308000757037, "phrase": "rarer_fragments"}, {"score": 0.0022095328812245852, "phrase": "lead_compound_optimization"}], "paper_keywords": [""], "paper_abstract": "Nowadays millions of different compounds are known, their structures stored in electronic databases. Analysis of these data could yield valuable insights into the laws of chemistry and the habits of chemists. We have therefore explored the public database of the National Cancer Institute (> 250 000 compounds) by pattern searching. We split the molecules of this database into fragments to find out which fragments exist, how frequent they are, and whether the occurrence of one fragment in a molecule is related to the occurrence of another, nonoverlapping fragment. It turns out that some fragments and combinations of fragments are so frequent that they can be called \"chemical cliches\". We believe that the fragment data can give insight into the chemical space explored so far by synthesis. The lists of fragments and their (co-)occurrences can help create novel chemical compounds by (i) systematically listing the most popular and therefore most easily used substituents and ring systems for synthesizing new compounds, (ii) being an easily accessible repository for rarer fragments Suitable for lead compound optimization, and (iii) pointing out some of the yet unexplored parts of chemical space.", "paper_title": "Mining a chemical database for fragment co-occurrence: Discovery of \"chemical cliches\"", "paper_id": "WOS:000236522800013"}