{"auto_keywords": [{"score": 0.0356396696612328, "phrase": "maximal_lifetime"}, {"score": 0.0124621299526849, "phrase": "surveillance_system"}, {"score": 0.01159084937434577, "phrase": "optimal_solution"}, {"score": 0.009502460721973357, "phrase": "workload_matrix"}, {"score": 0.008972546681420196, "phrase": "schedule_matrices"}, {"score": 0.004705206179790976, "phrase": "maximal_lifetime_scheduling"}, {"score": 0.004458722048888919, "phrase": "euclidean_plane"}, {"score": 0.004176640648520877, "phrase": "k_sensors"}, {"score": 0.0033158265075584796, "phrase": "first_time"}, {"score": 0.003240139593712436, "phrase": "scheduling_problem"}, {"score": 0.003215295260684715, "phrase": "sensor_surveillance_systems"}, {"score": 0.002864628676257225, "phrase": "linear_programming_techniques"}, {"score": 0.0026934777251033776, "phrase": "hall's_theory"}, {"score": 0.0024556852466581527, "phrase": "time_complexity"}, {"score": 0.0021876814398268775, "phrase": "numeric_example"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["energy efficiency", " lifetime", " scheduling", " sensor network", " surveillance system"], "paper_abstract": "This paper addresses the maximal lifetime scheduling for k to I sensor-target surveillance networks. Given a set of sensors and targets in Euclidean plane, a sensor can watch only one target at a time and a target should be watched by k sensors (k >= 2) at anytime. Our task is to schedule sensors to watch targets, such that the lifetime of the surveillance system is maximized, where the lifetime is the duration that all targets are watched. We propose an optimal solution to find the target watching schedule for sensors that achieves the maximal lifetime. This is the first time in the literature that this scheduling problem of sensor surveillance systems has been formulated and the optimal solution has been found. Our solution consists of three steps: (1) computing the maximal lifetime of the surveillance system and a workload matrix by using linear programming techniques; (2) decomposing the workload matrix into a sequence of schedule matrices by extending the Hall's theory, to achieve the maximal lifetime; (3) obtaining a target watching timetable for each sensor based on the schedule matrices. The time complexity of our optimal method is O(m(2)n(3)), where m, n are the number of targets and the number of sensors, respectively. We illustrate our optimal method by a numeric example and experiments in the end. (c) 2005 Elsevier B.V. All rights reserved.", "paper_title": "Maximal lifetime scheduling for K to 1 sensor-target surveillance networks", "paper_id": "WOS:000240084900014"}