{"auto_keywords": [{"score": 0.02898452830624612, "phrase": "lda"}, {"score": 0.00481495049065317, "phrase": "nine_iranian_wheat_seed_varieties"}, {"score": 0.0046937237797352515, "phrase": "image_processing"}, {"score": 0.004622450915803531, "phrase": "machine_vision_techniques"}, {"score": 0.004552255360140208, "phrase": "wheat_seeds"}, {"score": 0.0044150318724093226, "phrase": "objective_method"}, {"score": 0.004195418010131832, "phrase": "real_applications"}, {"score": 0.0038271712887391015, "phrase": "nine_common_iranian_wheat_seed_varieties"}, {"score": 0.0036740168936985314, "phrase": "bulk_wheat_seeds"}, {"score": 0.0034556603183020437, "phrase": "stable_illumination_condition"}, {"score": 0.0025694584194998335, "phrase": "top_selected_features"}, {"score": 0.002530359917257626, "phrase": "average_classification_accuracy"}, {"score": 0.00240426758768164, "phrase": "selected_features"}, {"score": 0.0021705796895687864, "phrase": "classification_accuracy"}, {"score": 0.0021375377706211686, "phrase": "previous_studies"}], "paper_keywords": ["Wheat seed", " Classification", " Textural feature", " LDA"], "paper_abstract": "Applying machine vision techniques to classify wheat seeds based on their varieties is an objective method which can increase the accuracy of this process in real applications. In this study, several textural feature groups of seeds images were examined to evaluate their efficacy in identification of nine common Iranian wheat seed varieties. On the whole, 1080 gray scale images of bulk wheat seeds (120 images of each variety) were acquired at a stable illumination condition (florescent ring light). Totally, 131 textural features were extracted from gray level, GLCM (gray level cooccurrence matrix), GLRM (gray level run-length matrix), LBP (local binary patterns), LSP (local similarity patterns) and LSN (local similarity numbers) matrices. The so-called stepwise discrimination method was employed to select and rank the most significant textural features of each matrix individually as well as features of all matrices simultaneously. LDA (linear discriminate analysis) classifier was employed for classification using top selected features. The average classification accuracy of 98.15% was obtained when top 50 of all selected features were used in the classifier. The results confirmed that LSP, LSN and LBP features had a significant influence on the improvement of classification accuracy compared to previous studies. (c) 2012 Elsevier B.V. All rights reserved.", "paper_title": "Identification of nine Iranian wheat seed varieties by textural analysis with image processing", "paper_id": "WOS:000303220900012"}