{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "tacit_communication_game"}, {"score": 0.004522796947899013, "phrase": "others'_beliefs"}, {"score": 0.0038271712887391015, "phrase": "evolutionary_origins"}, {"score": 0.0037795163893761027, "phrase": "cognitively_demanding_ability"}, {"score": 0.003701401653850141, "phrase": "vygotskian_intelligence_hypothesis"}, {"score": 0.0036553070575015344, "phrase": "higher-order_theory"}, {"score": 0.0032246835734680377, "phrase": "novel_communication"}, {"score": 0.0031712256091350316, "phrase": "sender_agent"}, {"score": 0.003092690568543981, "phrase": "receiver_agent"}, {"score": 0.002941389980674657, "phrase": "mind_abilities"}, {"score": 0.0028209599545587745, "phrase": "help_agents"}, {"score": 0.0026941587813581252, "phrase": "second-order_theory"}, {"score": 0.0024883835349005863, "phrase": "higher_orders"}, {"score": 0.002194929830604162, "phrase": "lower_orders"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Theory of mind", " Depth of reasoning", " Learning", " Cognitive hierarchy", " Communication", " Simulation"], "paper_abstract": "To understand and predict the behavior of others, people regularly reason about others' beliefs, goals, and intentions. People can even use this theory of mind recursively, and form beliefs about the way others in turn reason about the beliefs, goals, and intentions of others. Although the evolutionary origins of this cognitively demanding ability are unknown, the Vygotskian intelligence hypothesis suggests that higher-order theory of mind allows individuals to cooperate more effectively. In this paper, we investigate this hypothesis through the Tacit Communication Game. In this game, two agents cooperate to set up novel communication in which a Sender agent communicates the goal to the Receiver agent. By simulating interactions between agents that differ in their theory of mind abilities, we determine to what extent higher orders of theory of mind help agents to set up communication. Our results show that first-order and second-order theory of mind can allow agents to set up communication more quickly, but also that the effectiveness of higher orders of theory of mind depends on the role of the agent. Additionally, we find that in some cases, agents cooperate more effectively if they reason at lower orders of theory of mind. (C) 2014 Elsevier B.V. All rights reserved.", "paper_title": "Higher-order theory of mind in the Tacit Communication Game", "paper_id": "WOS:000352744600002"}