{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "public_exhibitions"}, {"score": 0.00477190623242136, "phrase": "computer_technologies"}, {"score": 0.0043619799095455415, "phrase": "natural_interactions"}, {"score": 0.004303591748086452, "phrase": "unimaginable_exploration_tools"}, {"score": 0.003987126862293129, "phrase": "different_technologies"}, {"score": 0.003677280504320636, "phrase": "single_approach"}, {"score": 0.003406713877432236, "phrase": "separate_techniques"}, {"score": 0.0030171910207671205, "phrase": "unifying_methodology"}, {"score": 0.002936849401568391, "phrase": "abovementioned_services"}, {"score": 0.0025545134727682716, "phrase": "minimal_hardware_resources"}, {"score": 0.0025202582748972122, "phrase": "significant_evidence"}, {"score": 0.0024641814990854463, "phrase": "experimental_results"}, {"score": 0.0024093494406195386, "phrase": "mercator_atlas_robot"}, {"score": 0.0023557346035701096, "phrase": "tortellino_x"}, {"score": 0.0022826775259971307, "phrase": "shanghai"}, {"score": 0.0022019274077124795, "phrase": "presented_approach"}], "paper_keywords": ["Digital technologies for museums", " Intangible interfaces", " Gestural interfaces", " Design interaction", " Image processing", " Immersive environments"], "paper_abstract": "Computer technologies have been adopted in many different venues, including public exhibitions and museums, as they can easily support the exchange of natural interactions and provide unimaginable exploration tools of masterpieces and exhibits. This has led many to design and implement a plethora of different technologies for the detection, tracking and action recognition of visitors within a museum. Nonetheless, no single approach has been firmly accepted so far, as it typically suffers from the limitation of adopting separate techniques for detecting, tracking and recognizing the actions of visitors. The contribution of this paper is that of filling this gap: we propose a unifying methodology through which all of the abovementioned services can be handled within a museum. Furthermore, such methodology results being: (a) simple to implement, (b) non-invasive and (c) requiring minimal hardware resources. As significant evidence, we present the experimental results drawn from two relevant implementations: Mercator Atlas Robot exhibited at the Poggi Palace Museum of Bologna and Tortellino X-Perience at the World Expo held in Shanghai. Finally, we indicate how the presented approach can be extended to efficiently support any interaction with several visitors simultaneously.", "paper_title": "Day and night at the museum: intangible computer interfaces for public exhibitions", "paper_id": "WOS:000333209300025"}