{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "harvest"}, {"score": 0.004342430078306461, "phrase": "formative_evaluation_study"}, {"score": 0.004224418476742716, "phrase": "iterative_improvements"}, {"score": 0.0037834649508375544, "phrase": "multiple_care_settings"}, {"score": 0.003757480190200645, "phrase": "clinical_usability"}, {"score": 0.0037060428445111694, "phrase": "physician_participants"}, {"score": 0.003435426082776884, "phrase": "results_harvest_displays"}, {"score": 0.0033304797419738182, "phrase": "problem_cloud"}, {"score": 0.0032176163279340206, "phrase": "clinical_documentation"}, {"score": 0.0030872017736888113, "phrase": "task-based_evaluation"}, {"score": 0.003044912038752554, "phrase": "time-to-task_completion"}, {"score": 0.0030031998605136788, "phrase": "patient_review_scenarios"}, {"score": 0.0027361626349903744, "phrase": "discussion_harvest"}, {"score": 0.0026986685585382347, "phrase": "wide_deployment"}, {"score": 0.002643386043540555, "phrase": "informative_feedback"}, {"score": 0.0026071599759743833, "phrase": "future_improvements"}, {"score": 0.0025892330566358503, "phrase": "conclusions_harvest"}, {"score": 0.0025361866386341796, "phrase": "unmet_need"}, {"score": 0.0024333239726872604, "phrase": "essential_patient_information"}, {"score": 0.0023346234464901978, "phrase": "patient_record_summarization"}, {"score": 0.002310578855290687, "phrase": "informatics_intervention"}, {"score": 0.002286781334850213, "phrase": "real-world_setting"}, {"score": 0.002163930783583212, "phrase": "informed_interface"}, {"score": 0.0021049977753042253, "phrase": "patient_care"}], "paper_keywords": ["electronic health record", " summarization", " natural language processing", " visualization"], "paper_abstract": "Objective To describe HARVEST, a novel point-of-care patient summarization and visualization tool, and to conduct a formative evaluation study to assess its effectiveness and gather feedback for iterative improvements. Materials and methods HARVEST is a problem-based, interactive, temporal visualization of longitudinal patient records. Using scalable, distributed natural language processing and problem salience computation, the system extracts content from the patient notes and aggregates and presents information from multiple care settings. Clinical usability was assessed with physician participants using a timed, task-based chart review and questionnaire, with performance differences recorded between conditions (standard data review system and HARVEST). Results HARVEST displays patient information longitudinally using a timeline, a problem cloud as extracted from notes, and focused access to clinical documentation. Despite lack of familiarity with HARVEST, when using a task-based evaluation, performance and time-to-task completion was maintained in patient review scenarios using HARVEST alone or the standard clinical information system at our institution. Subjects reported very high satisfaction with HARVEST and interest in using the system in their daily practice. Discussion HARVEST is available for wide deployment at our institution. Evaluation provided informative feedback and directions for future improvements. Conclusions HARVEST was designed to address the unmet need for clinicians at the point of care, facilitating review of essential patient information. The deployment of HARVEST in our institution allows us to study patient record summarization as an informatics intervention in a real-world setting. It also provides an opportunity to learn how clinicians use the summarizer, enabling informed interface and content iteration and optimization to improve patient care.", "paper_title": "HARVEST, a longitudinal patient record summarizer", "paper_id": "WOS:000352771500003"}