{"auto_keywords": [{"score": 0.04527362352183229, "phrase": "coordinated_players"}, {"score": 0.042279114195838303, "phrase": "congestion_games"}, {"score": 0.04204790475185292, "phrase": "parallel_links"}, {"score": 0.015412671792604525, "phrase": "stackelberg_strategies"}, {"score": 0.015326034218383421, "phrase": "atomic_congestion_games"}, {"score": 0.013309430928866741, "phrase": "arbitrary_strategies"}, {"score": 0.008340973741042715, "phrase": "non-atomic_games"}, {"score": 0.00481495049065317, "phrase": "stackelberg_strategies_for_atomic_congestion_games"}, {"score": 0.004666397248938625, "phrase": "unsplittable_demands"}, {"score": 0.004407892112070471, "phrase": "predetermined_strategy"}, {"score": 0.0043703658695579085, "phrase": "stackelberg_strategy"}, {"score": 0.004259684990957109, "phrase": "performance_degradation"}, {"score": 0.004211393664694384, "phrase": "selfish_players"}, {"score": 0.004093037185145671, "phrase": "affine_latency_functions"}, {"score": 0.003989351600022163, "phrase": "arbitrary_non-decreasing_latency_functions"}, {"score": 0.0039105194554402475, "phrase": "pure_nash_equilibria"}, {"score": 0.003877211065759289, "phrase": "strong_upper_and_lower_bounds"}, {"score": 0.003757480190200645, "phrase": "different_stackelberg_strategies"}, {"score": 0.003725470458263889, "phrase": "affine_congestion_games"}, {"score": 0.003459191419478298, "phrase": "new_stackelberg_strategy"}, {"score": 0.002600352550571973, "phrase": "poa"}, {"score": 0.0025561788724870974, "phrase": "best_known_bounds"}, {"score": 0.0022672718785099666, "phrase": "arbitrary_latency_functions"}, {"score": 0.0021971473452127126, "phrase": "latency_functions"}, {"score": 0.00218463192980675, "phrase": "class_d"}, {"score": 0.0021049977753042253, "phrase": "latter_bound"}], "paper_keywords": ["Congestion games", " Stackelberg routing", " Price of anarchy"], "paper_abstract": "We investigate the effectiveness of Stackelberg strategies for atomic congestion games with unsplittable demands. In our setting, only a fraction of the players are selfish, while the rest are willing to follow a predetermined strategy. A Stackelberg strategy assigns the coordinated players to appropriately selected strategies trying to minimize the performance degradation due to the selfish players. We consider two orthogonal cases, namely congestion games with affine latency functions and arbitrary strategies, and congestion games on parallel links with arbitrary non-decreasing latency functions. We restrict our attention to pure Nash equilibria and derive strong upper and lower bounds on the pure Price of Anarchy (PoA) under different Stackelberg strategies. For affine congestion games, we consider the Stackelberg strategies LLF and Scale introduced by Roughgarden (SIAM J. Comput. 33(2): 332-350, 2004), and propose a new Stackelberg strategy called Cover. We establish an upper and a lower bound on the PoA of LLF that are quite close to each other, a nearly linear upper bound on the PoA of Scale, and a lower bound on the PoA of any (even randomized) Stackelberg strategy that assigns the coordinated players to their optimal strategies. Cover is suited for the case where the fraction of coordinated players is small but their number is larger than the number of resources. If the number of players is sufficiently larger than the number of resources, combining Cover with either LLF or Scale gives very strong upper bounds on the PoA, quite close to the best known bounds for non-atomic games with affine latencies. For congestion games on parallel links, we prove that the PoA of LLF matches that for non-atomic games on parallel links. In particular, we show that the PoA of LLF is at most 1/alpha for arbitrary latency functions, and at most alpha + (1 - alpha)rho(D) for latency functions in class D, where alpha denotes the fraction of coordinated players. To establish the latter bound, we need to show that the PoA of atomic congestion games on parallel links is at most rho(D), i.e. it is bounded by the PoA of non-atomic congestion games with arbitrary strategies.", "paper_title": "Stackelberg Strategies for Atomic Congestion Games", "paper_id": "WOS:000276746800011"}