{"auto_keywords": [{"score": 0.03220622087721257, "phrase": "pre-emr_period"}, {"score": 0.031284017462435504, "phrase": "post-emr_period"}, {"score": 0.007576355322487795, "phrase": "infection_rate"}, {"score": 0.007526385320753713, "phrase": "mortality_rate"}, {"score": 0.00481495049065317, "phrase": "electronic_medical_record"}, {"score": 0.004767261858417823, "phrase": "chinese_hospital"}, {"score": 0.004505771917193237, "phrase": "care_quality"}, {"score": 0.00430118556814906, "phrase": "chinese_hospitals"}, {"score": 0.004230382915464492, "phrase": "inpatient_emr_system"}, {"score": 0.004160740888748725, "phrase": "large_chinese_hospital"}, {"score": 0.00397175830521626, "phrase": "emr_system"}, {"score": 0.003854809457075099, "phrase": "inpatient_care"}, {"score": 0.003667468902144262, "phrase": "monthly_data"}, {"score": 0.003547642961654828, "phrase": "hospital's_central_database"}, {"score": 0.003319569552937513, "phrase": "interrupted_time_series_analysis"}, {"score": 0.0031898025329389376, "phrase": "outcome_variable"}, {"score": 0.0023028145029652335, "phrase": "emr"}, {"score": 0.0022648286660146314, "phrase": "declining_patterns"}, {"score": 0.0021617722702730407, "phrase": "positive_effect"}, {"score": 0.0021474369836979048, "phrase": "patient_costs"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ireland_ltd."}], "paper_keywords": ["Electronic medical record", " Length of stay", " Mortality rate", " Infection rate", " Patient cost", " Interrupted time series"], "paper_abstract": "Background: Electronic medical record (EMR) systems have potential to improve care quality and efficiency. Yet little is known about the effects of EMR in Chinese hospitals. Objective: An inpatient EMR system was implemented in a large Chinese hospital. The objective of this research was to evaluate the impact of the EMR system on efficiency, quality, and cost of inpatient care in the hospital. Methods: A five-year (2005-2009) longitudinal dataset with monthly data involving 251 physicians and 298,760 patient visits was created by querying the hospital's central database. Four key outcomes were examined: length of stay, infection rate, mortality rate, and cost per patient stay. Interrupted time series analysis was used to evaluate changes in level and slope for each outcome variable. Results: Length of stay grew at 0.027 bed-days per month in the pre-EMR period and declined at 0.043 bed-days per month in the post-EMR period. Infection rate rose at 0.036 infections per 100 patients per month in the pre-EMR period and declined at 0.062 infections per 100 patients per month in the post-EMR period. Mortality rate grew at 0.048 deaths per 1000 patients per month in the pre-EMR period and decreased at 0.005 deaths per 1000 patients per month in the post-EMR period. Cost per patient stay declined at 33 RMB per month in the pre-EMR period and increased at 16 RMB per month in the post-EMR period. Conclusions: The EMR was associated with the declining patterns of length of stay, infection rate, and mortality rate. It had no positive effect on patient costs. (C) 2012 Elsevier Ireland Ltd. All rights reserved.", "paper_title": "Effects of electronic medical record in a Chinese hospital: A time series study", "paper_id": "WOS:000308976000015"}