{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "transition_organizations"}, {"score": 0.007348330809631422, "phrase": "transition_economies"}, {"score": 0.00582570362623593, "phrase": "market_orientation"}, {"score": 0.005042971080886976, "phrase": "structural_equation_modeling"}, {"score": 0.004117579919425373, "phrase": "oldest_market-based_economies"}, {"score": 0.0038614646772981848, "phrase": "recently_published_works"}, {"score": 0.003769567397860168, "phrase": "different_theoretical_findings"}, {"score": 0.003739421738326676, "phrase": "best_practice"}, {"score": 0.0037095162593960727, "phrase": "innovative_economies"}, {"score": 0.0036798490617699227, "phrase": "organizational_culture"}, {"score": 0.0035350218469335573, "phrase": "organizational_innovation_intensity"}, {"score": 0.0034926916198124484, "phrase": "competitive_advantage"}, {"score": 0.00321019328631004, "phrase": "innovation_intensity"}, {"score": 0.0029034358982402346, "phrase": "innovation_models"}, {"score": 0.0028229071631385634, "phrase": "innovative_organizations"}, {"score": 0.0027008385562908425, "phrase": "innovative_organizational_culture"}, {"score": 0.0025224615049571427, "phrase": "sustained_competitive_advantage"}, {"score": 0.002403672324588402, "phrase": "slovenia"}, {"score": 0.002384422461262006, "phrase": "practical_implications"}, {"score": 0.0021049977753042253, "phrase": "main_obstacles"}], "paper_keywords": ["cybernetics", " innovation", " competitive advantage", " transition management"], "paper_abstract": "Purpose - Innovativeness is probably the most effective way for organizations in the transition economies to improve their competitiveness. The purpose of this research is to find those factors, which significantly contribute to the innovativeness of organizations in the oldest market-based economies but they have not been developed in the transition organizations. Design/methodology/approach - A range of recently published works, which aimed to provide different theoretical findings and best practice of innovative economies highlighted organizational culture, entrepreneurship and market orientation as the most important factors influencing the organizational innovation intensity and sustained competitive advantage. These factors and their relationships together with the characteristics of the transition economies were applied to put hypotheses about their impact on innovation intensity in the transition organizations. The structural equation modeling was used to test these hypotheses on the sample of 214 Slovenian organizations. Findings - The comparison of both innovation models, i.e. one significant for the innovative organizations, and the other found for the transition organizations showed that innovative organizational culture and market orientation have been the most important missing factors preventing the transition organizations from being innovative and thus achieving the sustained competitive advantage. Research limitations/implications - Data collection was limited to one country, i.e. Slovenia. Practical implications; - The results obtained show that organizations cannot be innovative if all the most important factors influencing the innovation capability are not equally developed. Originality/value - The missing factors and relations which have been the main obstacles for the transition organizations to be more innovative are found by benchmarking based on the structural equation modeling.", "paper_title": "What do transition organizations lack to be innovative?", "paper_id": "WOS:000241260500006"}