{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "technology-mediated_learning"}, {"score": 0.004138813595009761, "phrase": "underlying_learning_process"}, {"score": 0.003792657064634775, "phrase": "structural_model"}, {"score": 0.003415137969569376, "phrase": "associated_hypotheses"}, {"score": 0.0032786537599187125, "phrase": "adobe_photoshop"}, {"score": 0.002884111441153185, "phrase": "preprogrammed_video_contents"}, {"score": 0.0028341130433482565, "phrase": "learning_materials"}, {"score": 0.00278497898719426, "phrase": "learning_engagement"}, {"score": 0.002492931483018372, "phrase": "significant_effects"}, {"score": 0.0021927323694667694, "phrase": "crown_copyright"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Technology-mediated learning", " Learning effectiveness", " Learning satisfaction", " Learning engagement"], "paper_abstract": "We examine students' learning effectiveness and satisfaction in technology-mediated learning by analyzing how it influences the underlying learning process, with a focus on the role of learning engagement. We propose a structural model that explains students' learning effectiveness and satisfaction, and then empirically test that model and the associated hypotheses with an experiment involving 212 university students learning Adobe Photoshop. Our experimental data show that the effects of technology-mediated learning are mostly mediated by learning engagement. In particular, the use of preprogrammed video contents to deliver learning materials negatively affects learning engagement, which in turn reduces perceived learning effectiveness and satisfaction. However, technology-mediated learning appears to have no significant effects, direct or moderating, on learning effectiveness or satisfaction. These findings have several important implications for technology-mediated learning research and practice. Crown Copyright (C) 2012 Published by Elsevier B.V. All rights reserved.", "paper_title": "Examining the role of learning engagement in technology-mediated learning and its effects on learning effectiveness and satisfaction", "paper_id": "WOS:000309037300014"}