{"auto_keywords": [{"score": 0.03764218679820011, "phrase": "multi-character_interactions"}, {"score": 0.00481495049065317, "phrase": "diverse_multi-character_interactions"}, {"score": 0.004617949594931096, "phrase": "pre-visualizing_movie_sequences"}, {"score": 0.003943481134959376, "phrase": "creative_process"}, {"score": 0.003644001325962353, "phrase": "final_scene"}, {"score": 0.003610292749660581, "phrase": "animating_scenes"}, {"score": 0.0035110198699787013, "phrase": "particularly_complex_process"}, {"score": 0.003068242064611088, "phrase": "data-driven_multi-character_interaction_scenes"}, {"score": 0.002942495422585405, "phrase": "simple_clauses"}, {"score": 0.0028350413546400703, "phrase": "captured_motions"}, {"score": 0.002744234034162797, "phrase": "plausible_candidate_scenes"}, {"score": 0.0022571810910697013, "phrase": "specific_interactions"}], "paper_keywords": ["Multi-Character Interaction", " Animation Authoring"], "paper_abstract": "In many application areas, such as animation for pre-visualizing movie sequences and choreography for dance or other types of performance, only a high-level description of the desired scene is provided as input, either written or verbal. Such sparsity, however, lends itself well to the creative process, as the choreographer, animator or director can be given more choice and control of the final scene. Animating scenes with multi-character interactions can be a particularly complex process, as there are many different constraints to enforce and actions to synchronize. Our novel 'generate-and-rank' approach rapidly and semi-automatically generates data-driven multi-character interaction scenes from high-level graphical descriptions composed of simple clauses and phrases. From a database of captured motions, we generate a multitude of plausible candidate scenes. We then efficiently and intelligently rank these scenes in order to recommend a small but high-quality and diverse selection to the user. This set can then be refined by re-ranking or by generating alternatives to specific interactions. While our approach is applicable to any scenes that depict multi-character interactions, we demonstrate its efficacy for choreographing fighting scenes and evaluate it in terms of performance and the diversity and coverage of the results.", "paper_title": "Generating and Ranking Diverse Multi-Character Interactions", "paper_id": "WOS:000345855600048"}