{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "adaptive_vision_algorithms"}, {"score": 0.03395416915055737, "phrase": "communication-centric_architecture_template"}, {"score": 0.0046781613377273774, "phrase": "embedded_realisation"}, {"score": 0.00433200902751133, "phrase": "frequently_used_adaptive_vision_kernel"}, {"score": 0.004208881856146758, "phrase": "surveillance_applications"}, {"score": 0.0041287394089001405, "phrase": "massive_computation"}, {"score": 0.0039729853486821995, "phrase": "software_approach"}, {"score": 0.003696550794743764, "phrase": "systematic_system-level_design_approach"}, {"score": 0.0034892684482068347, "phrase": "bandwidth_reduction"}, {"score": 0.0034063576796640603, "phrase": "customised_system-level_specification"}, {"score": 0.003325410433297401, "phrase": "system-level_exploration"}, {"score": 0.003154012038613403, "phrase": "embedded_adaptive_vision_algorithms"}, {"score": 0.003093893243443715, "phrase": "high_efficiency"}, {"score": 0.002977061391551628, "phrase": "algorithm-intrinsic_traffic"}, {"score": 0.0028923335491735564, "phrase": "traffic_handling"}, {"score": 0.002716915166374506, "phrase": "multiple_heterogeneous_nodes"}, {"score": 0.0026142814606853037, "phrase": "traffic_separation"}, {"score": 0.0023857603808363527, "phrase": "mog_processing_kernel"}, {"score": 0.0022845800828325555, "phrase": "authors'_solution"}], "paper_keywords": [""], "paper_abstract": "This study focuses on embedded realisation of adaptive vision algorithms, and illustrates the challenges using mixture of Gaussian (MoG) background subtraction. MoG is a frequently used adaptive vision kernel, for example, for surveillance applications. It involves massive computation and communication demands, which renders a software approach infeasible considering a 1 W power budget. To address these challenges, the authors employ a systematic system-level design approach and first analyse the demands at high-level, explore opportunities for bandwidth reduction, and derive a customised system-level specification. Based on the system-level exploration, this study then proposes a communication-centric architecture template that simplifies implementing embedded adaptive vision algorithms. To achieve high efficiency, they propose to separate steaming and algorithm-intrinsic traffic. This allows customising the traffic handling based on role of the data, as well as simplifying interconnecting multiple heterogeneous nodes. The authors demonstrate the benefits of traffic separation and the communication-centric architecture template based on MoG. They realise MoG on the Zynq-7000 SoC processing 1080p 30 Hz stream in real-time. The MoG processing kernel consists of 77 pipeline stages operating at 148.5 MHz. The authors' solution is more than 600 x faster than an ARM Cortex-A9 with 666 MHz. It only consumes 151 mW of on-chip power operating in real-time.", "paper_title": "Power-efficient real-time solution for adaptive vision algorithms", "paper_id": "WOS:000347714500003"}