{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "boundary_conforming_voronoi_regions"}, {"score": 0.004627944735913613, "phrase": "spatial_distribution"}, {"score": 0.004498812433096501, "phrase": "voronoi_region"}, {"score": 0.0035869274480340727, "phrase": "anisotropic_boundary-conforming_voronoi_regions"}, {"score": 0.0032575241721857343, "phrase": "evolving_fronts"}, {"score": 0.0031845067058084583, "phrase": "level_set_method"}, {"score": 0.0025965853546625352, "phrase": "anisotropic_voronoi_regions"}, {"score": 0.0025383451160985488, "phrase": "user-prescribed_riemannian_metric"}, {"score": 0.0024257447861185813, "phrase": "metric_tensor"}, {"score": 0.0021655683497137234, "phrase": "better_means"}, {"score": 0.002129020447793464, "phrase": "metric_fields"}, {"score": 0.0021049977753042253, "phrase": "mesh_generation"}], "paper_keywords": [""], "paper_abstract": "A Voronoi region can be interpreted as the shape achieved by a crystal that grows from a seed and stops growing when it reaches either the domain boundary or another crystal. This analogy is exploited here to devise a method for the generation of anisotropic boundary-conforming Voronoi regions for a set of points. This is achieved by simulating the propagation of crystals as evolving fronts modeled by a level set method. The techniques to detect the collision of fronts (crystals), formation of interfaces between seeds, and treatment of boundaries as additional (inner or outer) restricting seeds are described in detail. The generation of anisotropic Voronoi regions consistent with a user-prescribed Riemannian metric is achieved by re-interpreting the metric tensor in terms of the speed of propagation normal to the boundary of the crystal. This re-interpretation offers a better means of restricting metric fields for mesh generation.", "paper_title": "A Level Set Method for the Construction of Boundary Conforming Voronoi Regions and Delaunay Triangulations Governed by a Spatial Distribution of Metrics", "paper_id": "WOS:000340616900007"}