{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "human_resource"}, {"score": 0.008446485462253262, "phrase": "immediate_output"}, {"score": 0.004647442352794694, "phrase": "hrst"}, {"score": 0.0045122922461952805, "phrase": "integrated_fuzzy_ahp_and_fuzzy_dematel_approach"}, {"score": 0.0038246668286544016, "phrase": "ahp"}, {"score": 0.003584025547693836, "phrase": "dematel_method"}, {"score": 0.0035210572541244664, "phrase": "contextual_relationships"}, {"score": 0.0030554300179552415, "phrase": "science_and_technology_performance"}, {"score": 0.002846175473457555, "phrase": "improving_infrastructure"}, {"score": 0.0027796495180095657, "phrase": "better_choice"}, {"score": 0.0027307746993761035, "phrase": "long_period"}, {"score": 0.002498961351132696, "phrase": "labor_market"}, {"score": 0.00246957392654378, "phrase": "human_capital_and_intermediate"}], "paper_keywords": ["Fuzzy set", " AHP", " DEMATEL", " Human resource"], "paper_abstract": "This study intends to use a combination of fuzzy Analytic Hierarchy Process (AHP) and fuzzy Decision-making Trial and Evaluation Laboratory (DEMATEL) method in human resource for science and technology (HRST). Specifically, this study first uses AHP to evaluate the weighting for each criterion and then use DEMATEL method to establish contextual relationships among those criteria. We find out Infrastructure might be more critical since it is a cause and will directly influence human resource for science and technology performance. For human resource for science and technology (HRST), improving Infrastructure might be a better choice for the long period of time. Moreover, Education, R&D Expenses and Immediate output are more important second-tier criteria than Value, Cooperation, Labor Market, Human Capital and Intermediate output. Therefore, the improvement should be started with Infrastructure, particularly on identification of the Education, R&D Expenses and Immediate output. (C) 2011 Elsevier B. V. All rights reserved.", "paper_title": "Evaluating the criteria for human resource for science and technology (HRST) based on an integrated fuzzy AHP and fuzzy DEMATEL approach", "paper_id": "WOS:000296986100006"}