{"auto_keywords": [{"score": 0.02753336158944218, "phrase": "proposed_approach"}, {"score": 0.00481495049065317, "phrase": "evogenesys"}, {"score": 0.004689462599037994, "phrase": "graph_generation"}, {"score": 0.004550029253278477, "phrase": "complex_and_structured_information"}, {"score": 0.004348580182733617, "phrase": "graph_representations"}, {"score": 0.004283423748543866, "phrase": "special_interest"}, {"score": 0.0037249853525936428, "phrase": "problem_solution"}, {"score": 0.0035734052458933547, "phrase": "effective_methods"}, {"score": 0.0035198224928307854, "phrase": "single_graphs"}, {"score": 0.003415047118340286, "phrase": "problem_solutions"}, {"score": 0.003363830908814182, "phrase": "key_issue"}, {"score": 0.003325921766364862, "phrase": "new_evolutionary_computation-based_approach"}, {"score": 0.003142668996712078, "phrase": "special_data_structure"}, {"score": 0.002870173628745123, "phrase": "graph_encoding"}, {"score": 0.0027532820796396713, "phrase": "mutation_operators"}, {"score": 0.0026611838252683507, "phrase": "genetic_operators"}, {"score": 0.002514464610980629, "phrase": "problem_specific_knowledge"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b._v."}], "paper_keywords": ["Evolutionary algorithm", " Evolutionary graph generation", " Genetic operators", " Graph encoding"], "paper_abstract": "Graphs are widely used to represent complex and structured information of interest in various fields of science and engineering. When using graph representations, problems of special interest often imply searching. For example, searching for the prototypes representing a dataset of graphs or for the graph that optimizes a set of parameters. In any case, it is necessary that the problem solution be expressed in terms of graphs. Therefore, defining effective methods for automatically generating single graphs, or sets of graphs, representing problem solutions, is a key issue. A new evolutionary computation-based approach specifically devised for generating graphs is presented. The method is based on a special data structure, called multilist, which allows the encoding of any type of graph, directed or undirected, with or without attributes. Graph encoding by multilists makes it possible to define effective crossover and mutation operators, overcoming the problems normally encountered when implementing genetic operators on graphs. Further advantages of the proposed approach are that it does not require any problem specific knowledge and it is able to search for graphs whose number of nodes is not known a priori. Three sets of experiments were performed to test the proposed approach and the solutions found were compared with those obtained by other approaches proposed in the literature. (C) 2013 Elsevier B. V. All rights reserved.", "paper_title": "EvoGeneSys, a new evolutionary approach to graph generation", "paper_id": "WOS:000316767100032"}