{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "performance_indicators"}, {"score": 0.04880364979195164, "phrase": "agrometeorological_models"}, {"score": 0.02911205213260275, "phrase": "root_mean"}, {"score": 0.028806905038962178, "phrase": "relative_error"}, {"score": 0.00436890075128947, "phrase": "model_performance"}, {"score": 0.004321952227344232, "phrase": "correlated_metrics"}, {"score": 0.0035005841368145525, "phrase": "entire_set"}, {"score": 0.0033163269450817716, "phrase": "\"stable_correlation"}, {"score": 0.003107935254560724, "phrase": "large_sets"}, {"score": 0.003074495313651187, "phrase": "simulated_and_observed_data"}, {"score": 0.0028968858148006823, "phrase": "daily_solar_radiation"}, {"score": 0.0025857324180891526, "phrase": "modified_modelling_efficiency"}, {"score": 0.0021745003291048356, "phrase": "standardized_evaluation_tools"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Model evaluation", " Performance indicators", " Stable correlation"], "paper_abstract": "The use of a variety of metrics is advocated to assess model performance but correlated metrics may convey the same information, thus leading to redundancy. Starting from this assumption, a method was developed for selecting, from among a collection of performance indicators, one or more subsets providing the same information as the entire set. The method, based on the definition of \"stable correlation\", was applied to 23 performance indicators of agrometeorological models, calculated on large sets of simulated and observed data of four agronomic and meteorological variables: above-ground biomass, leaf area index, hourly air relative humidity and daily solar radiation. Two subsets were determined: {Squared Bias, Root Mean Squared Relative Error, Coefficient of Determination, Pattern Index, Modified Modelling Efficiency}, {Persistence Model Efficiency, Root Mean Squared Relative Error, Coefficient of Determination, Pattern Index}. The method needs corroboration but is statistically founded and can support the implementation of standardized evaluation tools. (C) 2015 Elsevier Ltd. All rights reserved.", "paper_title": "A new method for analysing the interrelationship between performance indicators with an application to agrometeorological models", "paper_id": "WOS:000361906900024"}