{"auto_keywords": [{"score": 0.04701209021022985, "phrase": "phylogenetic_trees"}, {"score": 0.015719716506582538, "phrase": "phylogenetic_networks"}, {"score": 0.008387115771821926, "phrase": "cass"}, {"score": 0.004549734943142138, "phrase": "conflicting_clusters"}, {"score": 0.004178935413340453, "phrase": "phylogenetic_tree"}, {"score": 0.0038382392088338784, "phrase": "common_ancestor"}, {"score": 0.003643807817480753, "phrase": "different_genes"}, {"score": 0.0032529910932231924, "phrase": "single_phylogenetic_tree"}, {"score": 0.0030017207229983385, "phrase": "reticulate_events"}, {"score": 0.002890266318361907, "phrase": "horizontal_gene_transfers"}, {"score": 0.0027961342030212353, "phrase": "new_cass_algorithm"}, {"score": 0.00266693888510356, "phrase": "phylogenetic_network"}, {"score": 0.0021049977753042253, "phrase": "freely_available_dendroscope_software"}], "paper_keywords": [""], "paper_abstract": "Phylogenetic trees are widely used to display estimates of how groups of species are evolved. Each phylogenetic tree can be seen as a collection of clusters, subgroups of the species that evolved from a common ancestor. When phylogenetic trees are obtained for several datasets (e.g. for different genes), then their clusters are often contradicting. Consequently, the set of all clusters of such a dataset cannot be combined into a single phylogenetic tree. Phylogenetic networks are a generalization of phylogenetic trees that can be used to display more complex evolutionary histories, including reticulate events, such as hybridizations, recombinations and horizontal gene transfers. Here, we present the new CASS algorithm that can combine any set of clusters into a phylogenetic network. We show that the networks constructed by CASS are usually simpler than networks constructed by other available methods. Moreover, we show that CASS is guaranteed to produce a network with at most two reticulations per biconnected component, whenever such a network exists. We have implemented CASS and integrated it into the freely available Dendroscope software.", "paper_title": "Phylogenetic networks do not need to be complex: using fewer reticulations to represent conflicting clusters", "paper_id": "WOS:000278689000016"}