{"auto_keywords": [{"score": 0.03119020372907525, "phrase": "unit_ball_graphs"}, {"score": 0.015719716506582538, "phrase": "guaranteed_delivery"}, {"score": 0.009836277632325209, "phrase": "k-local_routing_algorithm"}, {"score": 0.007575517382490352, "phrase": "thin_slabs"}, {"score": 0.004785682967399109, "phrase": "three-dimensional_ad_hoc_wireless_networks"}, {"score": 0.004656154865460475, "phrase": "three-dimensional_ad_hoc_networks"}, {"score": 0.004367333454187657, "phrase": "intermediate_node_vs_routing_decision"}, {"score": 0.004210374961392525, "phrase": "destination_nodes"}, {"score": 0.003842122928042844, "phrase": "three-dimensional_ad_hoc_network"}, {"score": 0.003703969862557761, "phrase": "three-dimensional_space"}, {"score": 0.003484627161645746, "phrase": "unit-radius_ball"}, {"score": 0.0033695566513755096, "phrase": "simple_local_routing_algorithm"}, {"score": 0.0032983098564490208, "phrase": "ball_graphs"}, {"score": 0.003055896595255606, "phrase": "fixed_k"}, {"score": 0.002866053420470349, "phrase": "two-dimensional_case"}, {"score": 0.0027798314737488314, "phrase": "guarantee_delivery"}, {"score": 0.0026391496115478388, "phrase": "unit_ball_graph_ire"}, {"score": 0.002437603221807513, "phrase": "thicker_slabs"}, {"score": 0.002230864807344675, "phrase": "quasi_unit_disc_graphs"}], "paper_keywords": ["Ad hoc networks", " Unit ball graph", " Routing", " Distributed algorithms", " Quasi unit disc graph"], "paper_abstract": "We Study the problem of routing in three-dimensional ad hoc networks. We ire interested in routing algorithms that guarantee delivery and are k-local, i e., each intermediate node Vs routing decision only depends oil knowledge of the labels of the Source and destination nodes, of the subgraph induced by nodes within distance k of v, and of the neighbour of v from which the message was received. We model a three-dimensional ad hoc network by a unit ball graph, where nodes are points in three-dimensional space, and for each node v. there is all edge between v and every node it contained in the unit-radius ball centred at v. The question of whether there is a simple local routing algorithm that guarantees delivery in Win. ball graphs has been open for some time. in this paper, we answer this question in the negative: we show that for any fixed k, there call be no k-local routing algorithm that guarantees delivery oil all unit ball graphs. This result is in contrast with file two-dimensional case, where I-local routing algorithms; that guarantee delivery are known. Specifically. we show that guaranteed delivery is possible if the nodes of the unit ball graph ire contained in a slab of thickness 1/root 2. However, there is no k-local routing algorithm that guarantees delivery for the class of unit ball graphs contained in thicker slabs, i.e., slabs of thickness 1/root 2+epsilon for some epsilon > 0. The algorithm for routing in thin slabs derives from a transformation of unit ball graphs contained in thin slabs into quasi unit disc graphs, which yields a 2-local routing algorithm. We also show several results that further elaborate oil the relationship between these two classes of graphs.", "paper_title": "routing with guaranteed delivery in three-dimensional ad hoc wireless networks", "paper_id": "WOS:000274214700017"}