{"auto_keywords": [{"score": 0.04265347421798511, "phrase": "finite_word"}, {"score": 0.02322730111336097, "phrase": "rich_words"}, {"score": 0.010495245158238842, "phrase": "word_w"}, {"score": 0.010264786212723856, "phrase": "vertical_bar"}, {"score": 0.005797151020915754, "phrase": "infinite_defect"}, {"score": 0.0041488110506566825, "phrase": "n_ways"}, {"score": 0.0034824716857663114, "phrase": "rich_word"}, {"score": 0.003405472159599445, "phrase": "periodic_and_aperiodic_infinite_rich_words"}, {"score": 0.002944715025443487, "phrase": "new_concept"}, {"score": 0.0027433143290371293, "phrase": "vertical_bar_z"}, {"score": 0.002712794864739074, "phrase": "infinite_word"}, {"score": 0.0025272158996086378, "phrase": "upper_bounds"}, {"score": 0.002251227801482381, "phrase": "new_class"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Combinatorics on words", " Palindromes", " Rich words", " Sturmian words", " Defect", " Two-dimensional words"], "paper_abstract": "A word w is rich if it has vertical bar w vertical bar + 1 many distinct palindromic factors, including the empty word. This article contains several results about rich words, particularly related to extending them. A word w can be eventually extended richly in n ways if there exists a finite word u and n distinct letters a E Alph(w) such that wua is rich. We will prove that every (non-unary) rich word can be eventually extended richly in at least two different ways, but not always in three or more ways. We will also prove that every rich word can be extended to both periodic and aperiodic infinite rich words. The defect of a finite word w is defined by D(w) = vertical bar w + 1 - vertical bar Pal(w)vertical bar. This concept has been studied in various papers. Here, we will define a new concept, infinite defect. For a finite word w the definition is D-infinity(w) = min{D(z) vertical bar z is an infinite word which has factor w}. We will show that the infinite defect of a finite word is always finite and give some upper bounds for it. The difference between defect and infinite defect is also investigated. We will also give an upper and a lower bound for the number of rich words. A new class of words, two-dimensional rich words, is also introduced. (C) 2014 Elsevier B.V. All rights reserved.", "paper_title": "Extensions of rich words", "paper_id": "WOS:000340987900002"}