{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "shared_representations"}, {"score": 0.04287858727323994, "phrase": "mutual_engagement"}, {"score": 0.004488505301335364, "phrase": "creative_activities"}, {"score": 0.004392565073466714, "phrase": "collaborative_music"}, {"score": 0.004206767038617782, "phrase": "user_interface_features"}, {"score": 0.003985487777785535, "phrase": "shared_awareness_mechanisms"}, {"score": 0.0037554497046697432, "phrase": "empirical_study"}, {"score": 0.0035771121569391916, "phrase": "shared_pointers"}, {"score": 0.003210446135114967, "phrase": "free-form_annotation"}, {"score": 0.003124790943886441, "phrase": "shared_representations_mediates_interaction"}, {"score": 0.0027001292153471202, "phrase": "key_contribution"}, {"score": 0.0025167026017217926, "phrase": "participant_interaction"}, {"score": 0.002222102813520549, "phrase": "design_guidelines"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Mutual engagement", " Collaboration", " Music making", " Design", " Evaluation", " Creativity"], "paper_abstract": "In this paper we explore the use of shared representations to support creative activities, focussing on collaborative music making. We examine the effect that user interface features of shared representations have on mutual engagement and show that providing shared awareness mechanisms increases mutual engagement. In particular, we show through an empirical study of 78 participants that providing cues to identity and shared pointers increases mutual engagement between participants, but together these features can overwhelm users. We also demonstrate that support for free-form annotation and spatial interaction with shared representations mediates interaction and helps participants to manage their collaborative activity effectively. In this paper we develop several measures mutual engagement and demonstrate their use to assess the design of shared representations. A key contribution of this paper is the development of a measure of collocation of participant interaction which indicates mutual engagement. The findings of the study have implications beyond the domain of collaborative music making and we outline some design guidelines for mutually engaging shared representations. (C) 2012 Elsevier Ltd. All rights reserved.", "paper_title": "Mutual engagement and collocation with shared representations", "paper_id": "WOS:000313476200006"}