{"auto_keywords": [{"score": 0.028165728208505752, "phrase": "spatial_reasoning"}, {"score": 0.015719716506582538, "phrase": "virtual_reality"}, {"score": 0.015547084727554774, "phrase": "human_body"}, {"score": 0.004486212539464774, "phrase": "urban_planning"}, {"score": 0.004179824713643488, "phrase": "urban_planning_process"}, {"score": 0.004133390261297075, "phrase": "complicated_navigation_interfaces"}, {"score": 0.004012061349250865, "phrase": "gaming_environments"}, {"score": 0.003865376734263166, "phrase": "vr_visualization"}, {"score": 0.003779943062894615, "phrase": "controlling_devices"}, {"score": 0.0034695189961509625, "phrase": "virtual_environment"}, {"score": 0.003405472159599445, "phrase": "interaction_interface"}, {"score": 0.0031490944606172152, "phrase": "quantitative_and_qualitative_methods"}, {"score": 0.002815864555488112, "phrase": "implemented_interface"}, {"score": 0.0027535633837592597, "phrase": "different_architecture_proposals"}, {"score": 0.002722930209707764, "phrase": "urban_plan"}, {"score": 0.00269263690712392, "phrase": "switching_positively_affected_learning"}, {"score": 0.0023368112390565387, "phrase": "vr"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Virtual Reality", " Natural User Interface", " Navigation", " Interaction", " Urban planning"], "paper_abstract": "The use of Virtual Reality (VR) and interactive real-time rendering in urban planning and building design is becoming more and more common. However, the integration of desktop-VR in the urban planning process suffers from complicated navigation interfaces. In particular, people unfamiliar to gaming environments and computers are less prone to interact with a VR visualization using keyboard and mouse as controlling devices. This paper addresses this issue by presenting an implementation of the XBOX 360 Kinect sensor system, which uses the human body to interact with the virtual environment. This type of interaction interface enables a more natural and user-friendly way of interacting with the virtual environment. The validation of the system was conducted with 60 participants using quantitative and qualitative methods. The result showed that participants perceived the interface as non-demanding and easy to use and the interface was perceived better in relation to mouse/keyboard interaction. The implemented interface supported users to switch between different architecture proposals of an urban plan and the switching positively affected learning, understanding and spatial reasoning of the participants. The study also shows that females perceived the system as less demanding than males. Furthermore, the users associated and related their body (human interaction interface) to VR, which could indicate that they used their body during spatial reasoning. This type of spatial reasoning has been argued to enhance the spatial-perception. (C) 2013 Elsevier Ltd. All rights reserved.", "paper_title": "Interactive navigation interface for Virtual Reality using the human body", "paper_id": "WOS:000328307300005"}