{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "wireless_ad_hoc"}, {"score": 0.04925194419954486, "phrase": "mutual_network_synchronization"}, {"score": 0.004682525167261325, "phrase": "distributed_method"}, {"score": 0.004633805690244912, "phrase": "geographically_separated_clocks"}, {"score": 0.004443921948822114, "phrase": "master_clocks"}, {"score": 0.004058668702112495, "phrase": "specific_nodes"}, {"score": 0.004030449969901066, "phrase": "reference_clocks"}, {"score": 0.004002426645789667, "phrase": "existing_mutual_network_synchronization_methods"}, {"score": 0.003905864553426306, "phrase": "physical_and_medium_access_control_layers"}, {"score": 0.0037456980766939836, "phrase": "clock_sampling_mutual_network_synchronization"}, {"score": 0.0035920758080335655, "phrase": "microsecond_networkwide_synchronization_accuracy"}, {"score": 0.0035670895401691536, "phrase": "single-hop_or_multiple-hop_network_topologies"}, {"score": 0.003456777366713296, "phrase": "sensor_networks"}, {"score": 0.0034088473318056537, "phrase": "existing_mutual_network_synchronization_approaches"}, {"score": 0.0032919001003538758, "phrase": "periodic_time_stamp_packets"}, {"score": 0.0030062165552187086, "phrase": "cs-mns_the_first_mutual_network_synchronization_method"}, {"score": 0.00292339061443511, "phrase": "cs-mns_node"}, {"score": 0.0028132076314202606, "phrase": "time_domain"}, {"score": 0.0026696020591118344, "phrase": "newly_received_time_stamp"}, {"score": 0.002651015392318126, "phrase": "sufficient_stability_conditions"}, {"score": 0.0026051114364288126, "phrase": "discrete_lyapunov_direct_method"}, {"score": 0.00256895975568914, "phrase": "cs-mns"}, {"score": 0.0024807547991927137, "phrase": "thorough_numerical_results"}, {"score": 0.002412371116984224, "phrase": "magnitude_improvement"}, {"score": 0.002249527353528286, "phrase": "better_accuracy"}, {"score": 0.0021051128127738154, "phrase": "ieee"}], "paper_keywords": ["network time synchronization", " wireless ad hoc and sensor networks"], "paper_abstract": "Mutual network synchronization is a distributed method in which geographically separated clocks align their times to one another without the need of reference or master clocks. Mutual network synchronization is attractive for wireless ad hoc and sensor networks, because there is no overhead associated with the discovery, management, and tracking of specific nodes with reference clocks. Existing mutual network synchronization methods, however, make use of physical and medium access control layers that are proprietary and not widely available. This paper presents Clock Sampling Mutual Network Synchronization (CS-MNS). CS-MNS is able to achieve microsecond networkwide synchronization accuracy for single-hop or multiple-hop network topologies in mobile or static wireless ad hoc and sensor networks. Different from existing mutual network synchronization approaches, the timing information is exchanged explicitly by using periodic time stamp packets. These packets can be, for instance, the same beacons used in the IEEE 802.11 or IEEE 802.15.4 Standards, which, to the best of our knowledge, makes CS-MNS the first mutual network synchronization method compatible to these popular standards. A CS-MNS node adjusts the time and frequency of its clock recursively in the time domain by multiplying the time of its clock by a factor that is updated with any newly received time stamp. Sufficient stability conditions are derived via the discrete Lyapunov direct method. Additionally, CS-MNS enables several beacon medium access approaches, which are discussed and analyzed. Thorough numerical results are presented, which demonstrate at least one and two orders of magnitude improvement in scalability and accuracy, respectively, relative to the IEEE 802.11 Timing Synchronization Function (TSF). CS-MNS also shows better accuracy than the multihop ad hoc TSF (MATSF) and the automatic self-time-correcting procedure (ASP) methods under similar scenarios. The latter is achieved with less complexity and with fully compatible IEEE 802.11 beacons.", "paper_title": "A mutual network synchronization method for wireless ad hoc and sensor networks", "paper_id": "WOS:000253983100009"}