{"auto_keywords": [{"score": 0.026897811453592893, "phrase": "role-based_taxonomy"}, {"score": 0.00481495049065317, "phrase": "previous_research_studies"}, {"score": 0.004608121749000898, "phrase": "negative_impact_interruptions"}, {"score": 0.004553265070135597, "phrase": "task_performance"}, {"score": 0.004305740330804528, "phrase": "design_strategies"}, {"score": 0.004153739859461064, "phrase": "possible_negatives_consequences"}, {"score": 0.003758981686762617, "phrase": "instrumental_case_study"}, {"score": 0.003714195746979591, "phrase": "shadowing_method"}, {"score": 0.003669941438286456, "phrase": "convenience_sample"}, {"score": 0.003611751858608048, "phrase": "trauma_mds"}, {"score": 0.003583002730249742, "phrase": "eight_rns"}, {"score": 0.0034152340901585374, "phrase": "trauma_section"}, {"score": 0.0033745298175222056, "phrase": "level_one_trauma_center"}, {"score": 0.0031402604946939743, "phrase": "major_roles"}, {"score": 0.003053598205821532, "phrase": "medical_doctors"}, {"score": 0.0027742550423664213, "phrase": "mds"}, {"score": 0.0024604876113911173, "phrase": "recorded_notes"}, {"score": 0.0021049977753042253, "phrase": "future_studies"}], "paper_keywords": ["Interruption", " Workflow", " Emergency medicine", " Taxonomy"], "paper_abstract": "Background: Previous research studies have focused on the recipients of interruptions because of the negative impact interruptions have on task performance. It is equally important to understand the initiators of interruptions to help design strategies to lessen the number of interruptions and the possible negatives consequences. The purpose of this study was to examine MDs and RNs as initiators and recipients of interruptions. Methods: This was an instrumental case study using the shadowing method. A convenience sample of five attending trauma MDs and eight RNs were observed during the 07:00-15:00 and 15:00-21:00 shifts in the trauma section of a level one trauma center. Result: Seventy hours of observations were recorded. Initiator and recipient of an interruption emerged as major roles during categorization of the notes. Medical doctors and RNs were found to be the recipient of an interruption more frequently than the initiator. Findings from this study indicate that MDs and RNs initiate interruptions most often through face-to-face interactions and use of the telephone. Conclusions: A role-based taxonomy of interruptions was derived from the recorded notes. Strategies to successfully manage interruptions must consider both the role of initiator as well as the recipient when an interruption occurs. It is suggested that the role-based taxonomy presented in this paper be used to classify interruptions in future studies. (C) 2008 Elsevier Ireland Ltd. All rights reserved.", "paper_title": "The roles of MDs and RNs as initiators and recipients of interruptions in workflow", "paper_id": "WOS:000278192800012"}