{"auto_keywords": [{"score": 0.03966763833982911, "phrase": "differentiation_hierarchy"}, {"score": 0.012908152879256056, "phrase": "cell_types"}, {"score": 0.012779276117537474, "phrase": "gene_expression"}, {"score": 0.010176228402154918, "phrase": "linear_constraints"}, {"score": 0.00481495049065317, "phrase": "stem_cell_differentiation_trees"}, {"score": 0.004608422081389008, "phrase": "transcriptional_regulators"}, {"score": 0.0043663006236597975, "phrase": "cell_cycle_genes"}, {"score": 0.004293267161763508, "phrase": "metabolic_genes"}, {"score": 0.004150829420202823, "phrase": "understanding_gene_expression_patterns"}, {"score": 0.004053932711987671, "phrase": "principal_components_analysis"}, {"score": 0.003751143724152193, "phrase": "hierarchical_clustering"}, {"score": 0.0033330581836898032, "phrase": "weighted_euclidean_distance"}, {"score": 0.0032772504899699416, "phrase": "minimum_spanning_tree"}, {"score": 0.003032295420569351, "phrase": "desired_construction"}, {"score": 0.0030017207229983385, "phrase": "linear_programming_approach"}, {"score": 0.002971453391894977, "phrase": "sparse_sets"}, {"score": 0.002843772431469196, "phrase": "different_parts"}, {"score": 0.0027307746993761035, "phrase": "gene_expression_data"}, {"score": 0.002685024286204446, "phrase": "hematopoiesis_hierarchy"}, {"score": 0.002648974977491828, "phrase": "weighted_euclidean_metric"}, {"score": 0.002426137929553722, "phrase": "random-forest_training"}, {"score": 0.002361410799860054, "phrase": "random_subsets"}, {"score": 0.002222004614440872, "phrase": "selected_genes"}, {"score": 0.0021700361584578633, "phrase": "new_way"}, {"score": 0.0021192805640815795, "phrase": "important_roles"}, {"score": 0.0021049977753042253, "phrase": "stem_cell_differentiation"}], "paper_keywords": [""], "paper_abstract": "Motivation: Stem cell differentiation is largely guided by master transcriptional regulators, but it also depends on the expression of other types of genes, such as cell cycle genes, signaling genes, metabolic genes, trafficking genes, etc. Traditional approaches to understanding gene expression patterns across multiple conditions, such as principal components analysis or K-means clustering, can group cell types based on gene expression, but they do so without knowledge of the differentiation hierarchy. Hierarchical clustering can organize cell types into a tree, but in general this tree is different from the differentiation hierarchy itself. Methods: Given the differentiation hierarchy and gene expression data at each node, we construct a weighted Euclidean distance metric such that the minimum spanning tree with respect to that metric is precisely the given differentiation hierarchy. We provide a set of linear constraints that are provably sufficient for the desired construction and a linear programming approach to identify sparse sets of weights, effectively identifying genes that are most relevant for discriminating different parts of the tree. Results: We apply our method to microarray gene expression data describing 38 cell types in the hematopoiesis hierarchy, constructing a weighted Euclidean metric that uses just 175 genes. However, we find that there are many alternative sets of weights that satisfy the linear constraints. Thus, in the style of random-forest training, we also construct metrics based on random subsets of the genes and compare them to the metric of 175 genes. We then report on the selected genes and their biological functions. Our approach offers a new way to identify genes that may have important roles in stem cell differentiation.", "paper_title": "Gene selection for the reconstruction of stem cell differentiation trees: a linear programming approach", "paper_id": "WOS:000359666600011"}