{"auto_keywords": [{"score": 0.046273829908275735, "phrase": "social_tagging"}, {"score": 0.004814950729032418, "phrase": "peircean"}, {"score": 0.004610058444728656, "phrase": "recent_web_developments"}, {"score": 0.004394688617163029, "phrase": "user_participation"}, {"score": 0.00417115038996633, "phrase": "traditional_online_communication_process"}, {"score": 0.003958937342925219, "phrase": "new_problems"}, {"score": 0.003924629168434799, "phrase": "essential_questions"}, {"score": 0.0038234714417849495, "phrase": "online_communications"}, {"score": 0.0031984060035955292, "phrase": "complex_issue"}, {"score": 0.0031431690368229443, "phrase": "deep_reflection"}, {"score": 0.0029830992938695007, "phrase": "potential_problems"}, {"score": 0.002880927789104712, "phrase": "c._s._peirce's_semiotics"}, {"score": 0.002818850283787242, "phrase": "general_phenomena"}, {"score": 0.0024095777415804346, "phrase": "peircean_semiotics"}, {"score": 0.002218054404179068, "phrase": "categorization_schema"}, {"score": 0.002123433075137768, "phrase": "information_systems"}, {"score": 0.0021049977753042253, "phrase": "web_applications"}], "paper_keywords": ["categorization", " C. S. Peirce", " interpretant", " online communication", " semiotics", " social tagging", " 10 classes of signs", " triadic sign"], "paper_abstract": "One of the recent web developments has focused on the opportunities it presents for social tagging through user participation and collaboration. As a result, social tagging has changed the traditional online communication process. The interpretation of tagging between humans and machines may create new problems if essential questions about how social tagging corresponds to online communications, what objects the tags refer to, who the interpreters are, and why they are engaged are not explored systematically. Since such reasoning is an interpretation of social tagging among humans, tags and machines, it is a complex issue that calls for deep reflection. In this paper, we investigate the relevance of the potential problems raised by social tagging through the framework of C. S. Peirce's semiotics. We find that general phenomena of social tagging can be well classified by Peirce's 10 classes of signs for reasoning. This suggests that regarding social tagging as a sign and systematically analyzing the interpretation are positively associated with the 10 classes of signs. Peircean semiotics can be used to examine the dynamics and determinants of tagging; hence, the various uses of this categorization schema may have implications for the design and development of information systems and web applications.", "paper_title": "Social tagging, online communication, and Peircean semiotics: a conceptual framework", "paper_id": "WOS:000265919000005"}