{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "consumers'_perception"}, {"score": 0.010536861293622598, "phrase": "electronic_payment"}, {"score": 0.00503751973410482, "phrase": "e-payment_acceptance"}, {"score": 0.004578783486828809, "phrase": "promising_growth"}, {"score": 0.004513457140125224, "phrase": "malaysia"}, {"score": 0.0042004472903194616, "phrase": "malaysian_consumers'_perspective"}, {"score": 0.0038119123317396954, "phrase": "self-reporting_questionnaire"}, {"score": 0.0035473867669654174, "phrase": "multiple_linear_regression_results"}, {"score": 0.003397535839387366, "phrase": "significant_influences"}, {"score": 0.0032893028281789287, "phrase": "insignificant_results"}, {"score": 0.003105305189036267, "phrase": "five_factors"}, {"score": 0.002995554770117301, "phrase": "different_economies"}, {"score": 0.002942138511829811, "phrase": "small_sample_size"}, {"score": 0.0026505322540093783, "phrase": "great_potential"}, {"score": 0.0026315183701883437, "phrase": "future_expansion"}, {"score": 0.0025021765811679446, "phrase": "consumers'_expectations"}, {"score": 0.0022950308685133224, "phrase": "current_state"}, {"score": 0.0022298571016688335, "phrase": "malaysians"}, {"score": 0.0022058958906038466, "phrase": "significant_factors"}, {"score": 0.0021587414711262904, "phrase": "policy_maker"}, {"score": 0.002143247921132179, "phrase": "banking_institutions"}, {"score": 0.0021278653331014592, "phrase": "online_transaction_facilities_providers"}, {"score": 0.0021049977753042253, "phrase": "software_developers"}], "paper_keywords": ["Electronic payment", " Customers' perception", " Benefits", " Trust", " Self-efficacy", " Ease of use", " Security", " Malaysia", " Payments", " Customers"], "paper_abstract": "Purpose-In view of the promising growth of e-payment in Malaysia, this study aims to discover the factors influencing perception towards electronic payment (e-payment) from the Malaysian consumers' perspective. Design/methodology/approach-Literature indicates that factors such as benefits, trust, self-fficacy, ease of use, and security influence consumers' perception towards e-payment. A self-reporting questionnaire was developed and disseminated to 200 respondents, out of which 183 valid responses were considered for further statistical analysis. Findings-The multiple linear regression results reveal that benefits, self-efficacy, and ease of use exert significant influences on consumers' perception towards e-payment. However, the insignificant results obtained for trust and security warrant further investigation. Research limitations/implications-This study proposes five factors for measuring consumers' perception towards e-payment which is replicable across different economies. However, the small sample size raises the issue of generalizability which future studies should seek to address. Practical implications-The use of e-payment by the majority of respondents confirms that there is a great potential for future expansion of such payment devices. The challenge is to ensure that it continues to meet consumers' expectations which will subsequently lead to its increased adoption and use. Originality/value-This study has advanced knowledge for it has provided information on the current state of e-payment acceptance and use, particularly among Malaysians. The significant factors identified are beneficial to the policy maker, banking institutions, online transaction facilities providers, and software developers as they develop strategies directed at increasing e-payment acceptance and use.", "paper_title": "Factors affecting consumers' perception of electronic payment: an empirical analysis", "paper_id": "WOS:000323293500004"}