{"auto_keywords": [{"score": 0.03363896917055258, "phrase": "querying_agent"}, {"score": 0.028290720011665136, "phrase": "pre-query_stage"}, {"score": 0.00481495049065317, "phrase": "secrecy-preserving_reasoning"}, {"score": 0.00471071771178029, "phrase": "knowledge_bases"}, {"score": 0.004646715814266713, "phrase": "confidential_or_private_information"}, {"score": 0.004484332781147261, "phrase": "secret_information"}, {"score": 0.00441130431691048, "phrase": "user_queries"}, {"score": 0.004268780663872836, "phrase": "unauthorized_users"}, {"score": 0.004176321608449849, "phrase": "openworld_assumption"}, {"score": 0.003942995906058182, "phrase": "kb_kappa"}, {"score": 0.003722689182221084, "phrase": "kb"}, {"score": 0.003692197919230072, "phrase": "prespecified_set"}, {"score": 0.0035338939519719784, "phrase": "querying_agents"}, {"score": 0.003485824905231454, "phrase": "communication_graph"}, {"score": 0.003382354267177914, "phrase": "general_framework"}, {"score": 0.003327211815476358, "phrase": "secrecy-preserving_query_answering"}, {"score": 0.0032819448594643853, "phrase": "complete_proof_systems"}, {"score": 0.0032107911131811057, "phrase": "truthful_answer"}, {"score": 0.002925152152270343, "phrase": "owa"}, {"score": 0.00268838515133912, "phrase": "k."}, {"score": 0.002557484218266225, "phrase": "finite_subset"}, {"score": 0.0024611721532928742, "phrase": "s-i_subset"}, {"score": 0.0024210112323786374, "phrase": "query_alpha"}, {"score": 0.0024011766029754006, "phrase": "agent_m-i"}], "paper_keywords": ["Algorithm", " Security", " Theory", " Multiagents", " secrecy-preserving reasoning"], "paper_abstract": "In many applications, Knowledge Bases (KBs) contain confidential or private information (secrets). The KB should be able to use this secret information in its reasoning process but in answering user queries care must be exercised so that secrets are not revealed to unauthorized users. We consider this problem under the OpenWorld Assumption (OWA) in a setting with multiple querying agents M-1,..., M-m that can pose queries against the KB kappa and selectively share answers that they receive from kappa with one or more other querying agents. We assume that for each M-i, the KB has a prespecified set of secrets S-i that need to be protected from M-i. Communication between querying agents is modeled by a communication graph, a directed graph with self-loops. We introduce a general framework and propose an approach to secrecy-preserving query answering based on sound and complete proof systems. The idea is to hide the truthful answer from a querying agent M-i by feigning ignorance without lying (i.e., to provide the answer 'Unknown' to a query q if it needs to be protected. Under the OWA, a querying agent cannot distinguish between the case that q is being protected (for reasons of secrecy) and the case that it cannot be inferred from K. In the pre-query stage we compute a set of envelopes E-1,..., E-m (restricted to a finite subset of the set of formulae that are entailed by kappa) so that S-i subset of E-i, and a query alpha posed by agent M-i can be answered truthfully whenever alpha is an element of is not an element of E-i and -alpha is not an element of E-i. After the pre-query stage, the envelope is updated as needed. We illustrate this approach with two simple cases: the Propositional Horn KBs and the Description Logic ALKBs.", "paper_title": "A Conceptual Framework for Secrecy-preserving Reasoning in Knowledge Bases", "paper_id": "WOS:000352220100003"}