{"auto_keywords": [{"score": 0.040990872765445975, "phrase": "sparsely_labeled_text_classification"}, {"score": 0.015719716506582538, "phrase": "data_editing"}, {"score": 0.014587905816090627, "phrase": "semi-supervised_learning"}, {"score": 0.012896320753473219, "phrase": "training_data"}, {"score": 0.009723203093398908, "phrase": "data_editing_technique"}, {"score": 0.008667159966156154, "phrase": "active_learning"}, {"score": 0.008074650482520354, "phrase": "assde"}, {"score": 0.004667541072056214, "phrase": "insufficient_training_data_problem"}, {"score": 0.00450456611645112, "phrase": "self-labeled_training_data"}, {"score": 0.004327981760540394, "phrase": "insufficient_training_data"}, {"score": 0.00408501512749186, "phrase": "generalization_ability"}, {"score": 0.0040309035566691645, "phrase": "final_hypothesis"}, {"score": 0.003574929398913029, "phrase": "active_semi-supervised_algorithms"}, {"score": 0.003299880298525127, "phrase": "existing_active_semi-supervised_algorithms"}, {"score": 0.0031703706626348507, "phrase": "active_semi-supervised_framework"}, {"score": 0.0023739321566540682, "phrase": "distribution_bias"}, {"score": 0.0021910825909008946, "phrase": "extensive_experimental_study"}, {"score": 0.0021049977753042253, "phrase": "proposed_framework"}], "paper_keywords": ["sparsely labeled text classification", " active learning", " semi-supervised learning", " data editing"], "paper_abstract": "In order to address the insufficient training data problem, many active semi-supervised algorithms have been proposed. The self-labeled training data in semi-supervised learning may contain much noise due to the insufficient training data. Such noise may snowball themselves in the following learning process and thus hurt the generalization ability of the final hypothesis. Extremely few labeled training data in sparsely labeled text classification aggravate such situation. If such noise could be identified and removed by some strategy, the performance of the active semi-supervised algorithms should be improved. However, such useful techniques of identifying and removing noise have been seldom explored in existing active semi-supervised algorithms. In this paper, we propose an active semi-supervised framework with data editing (we call it ASSDE) to improve sparsely labeled text classification. A data editing technique is used to identify and remove noise introduced by semi-supervised labeling. We carry out the data editing technique by fully utilizing the advantage of active learning, which is novel according to our knowledge. The fusion of active learning with data editing makes ASSDE more robust to the sparsity and the distribution bias of the training data. It further simplifies the design of semi-supervised learning which makes ASSDE more efficient. Extensive experimental study on several real-world text data sets shows the encouraging results of the proposed framework for sparsely labeled text classification, compared with several state-of-the-art methods.", "paper_title": "Active Semi-supervised Framework with Data Editing", "paper_id": "WOS:000314392000009"}