{"auto_keywords": [{"score": 0.03765601177300984, "phrase": "voice_recognition_application"}, {"score": 0.011891201529222186, "phrase": "audio_format"}, {"score": 0.00481495049065317, "phrase": "construction-integration_model"}, {"score": 0.004551199992546761, "phrase": "previous_article"}, {"score": 0.004383406949799696, "phrase": "psycholinguistically_motivated_mechanism"}, {"score": 0.00419016653753787, "phrase": "call_classifiers"}, {"score": 0.004112175423546628, "phrase": "latent_semantic_analysis"}, {"score": 0.0038431888954930083, "phrase": "call_transcriptions"}, {"score": 0.002920561105784389, "phrase": "complete_system"}, {"score": 0.0027706987570488084, "phrase": "stochastic_language_model"}, {"score": 0.00266837303806956, "phrase": "lsa_model"}, {"score": 0.002560162916190598, "phrase": "c-i_model"}, {"score": 0.0025124343366192954, "phrase": "different_parameters"}, {"score": 0.0024563302149829, "phrase": "automatic_router's_rate"}], "paper_keywords": ["call routing", " call steering", " natural language", " latent semantic analysis", " construction-integration framework", " psycholinguistically motivated algorithms"], "paper_abstract": "This study stems from a previous article [1] in which we found that a psycholinguistically motivated mechanism based on the Construction-Integration (C-I) model [2,3] could be used for call classifiers in systems based on Latent Semantic Analysis (LSA). In it we showed that with this model more robust results were obtained when categorizing call transcriptions. However, this method was not tested in a context of calls in audio format, where a voice recognition application would be involved. The most direct implication of a voice recognition application is that the text to be categorized may be impoverished and is subject to noise. This impoverishment normally translates into deletions and insertions which are semantically arbitrary but phonetically similar. The aim of this study is to describe the behavior of a complete system, with calls in audio format that are transcribed by a voice recognition application using a Stochastic Language Model (SLM), and then categorized with an LSA model. This process optionally includes a mechanism based on the C-I model. In this study different parameters were analyzed to assess the automatic router's rate of correct choices. The results show that once again the model based on C-I is significantly better, but the benefits are more remarkable when the utterances are long. The paper describes the system and examines both the full results and the interactions in some scenarios. The economy of resources and flexibility of the system are also discussed.", "paper_title": "Call Routing Based on a Combination of the Construction-Integration Model and Latent Semantic Analysis: A Full System", "paper_id": "WOS:000362399600002"}