{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "virtual_reality"}, {"score": 0.004712988631183401, "phrase": "longitudinal_data"}, {"score": 0.0045348429403481464, "phrase": "walking_metaphor"}, {"score": 0.00409188863874203, "phrase": "vr._three_metrics"}, {"score": 0.0036448787596988423, "phrase": "asymptotic_performance"}, {"score": 0.003316884515934182, "phrase": "tight_turns"}, {"score": 0.0028302635493019867, "phrase": "speed_profile"}, {"score": 0.0027114323601885666, "phrase": "notable_percentage"}, {"score": 0.002553382046204689, "phrase": "computer_games"}, {"score": 0.0024884913795612707, "phrase": "speed_profiles"}, {"score": 0.002414861891567233, "phrase": "participants'_proficiency"}, {"score": 0.0023942269247089277, "phrase": "travel_interfaces"}, {"score": 0.002274059352027922, "phrase": "specific_weaknesses"}, {"score": 0.0021973099304606076, "phrase": "-stop_movement"}], "paper_keywords": ["Experimentation", " Human Factors", " Performance", " Virtual reality interfaces", " navigation", " travel", " metrics"], "paper_abstract": "This article provides longitudinal data for when participants learned to travel with a walking metaphor through virtual reality (VR) worlds, using interfaces that ranged from joystick-only, to linear and omnidirectional treadmills, and actual walking in VR. Three metrics were used: travel time, collisions (a measure of accuracy), and the speed profile. The time that participants required to reach asymptotic performance for traveling, and what that asymptote was, varied considerably between interfaces. In particular, when a world had tight turns (0.75 m corridors), participants who walked were more proficient than those who used a joystick to locomote and turned either physically or with a joystick, even after 10 minutes of training. The speed profile showed that this was caused by participants spending a notable percentage of the time stationary, irrespective of whether or not they frequently played computer games. The study shows how speed profiles can be used to help evaluate participants' proficiency with travel interfaces, highlights the need for training to be structured to addresses specific weaknesses in proficiency (e. g., start-stop movement), and for studies to measure and report that proficiency.", "paper_title": "Learning to Walk in Virtual Reality", "paper_id": "WOS:000324114800005"}