{"auto_keywords": [{"score": 0.03302410636663472, "phrase": "germany"}, {"score": 0.007037782083649544, "phrase": "u.s."}, {"score": 0.00481495049065317, "phrase": "people's_associations"}, {"score": 0.0045052562941109734, "phrase": "communication_technologies"}, {"score": 0.004296264970612285, "phrase": "cell_phones"}, {"score": 0.00402639007121927, "phrase": "singapore"}, {"score": 0.0035189057079817285, "phrase": "cultural_differences"}, {"score": 0.003419943984098415, "phrase": "current_study"}, {"score": 0.003371508176308189, "phrase": "galileo_system"}, {"score": 0.0033395980635636644, "phrase": "multidimensional_scaling"}, {"score": 0.003261133560558666, "phrase": "extensional_associations"}, {"score": 0.0032302647179383915, "phrase": "nine_personal_communication_technologies"}, {"score": 0.00241658945942583, "phrase": "extensional_association"}, {"score": 0.0021454671611847507, "phrase": "stronger_influence"}, {"score": 0.0021251363422701446, "phrase": "cultural_norms"}, {"score": 0.0021049977753042253, "phrase": "personal-technology_choice"}], "paper_keywords": [""], "paper_abstract": "Increasingly, individuals use communication technologies such as e-mail, IMs, blogs, and cell phones to locate, learn about, and communicate with one another. Not much, however, is known about how individuals relate to various personal technologies, their preferences for each, or their extensional associations with them. Even less is known about the cultural differences in these preferences. The current study used the Galileo system of multidimensional scaling to systematically map the extensional associations with nine personal communication technologies across three cultures: U.S., Germany, and Singapore. Across the three cultures, the technologies closest to the self were similar, suggesting a universality of associations with certain technologies. In contrast, the technologies farther from the self were significantly different across cultures. Moreover, the magnitude of associations with each technology differed based on the extensional association or distance from the self. Also, and more importantly, the antecedents to these associations differed significantly across cultures, suggesting a stronger influence of cultural norms on personal-technology choice.", "paper_title": "Personal communication technologies as an extension of the self: A cross-cultural comparison of people's associations with technology and their symbolic proximity with others", "paper_id": "WOS:000258582600006"}