{"auto_keywords": [{"score": 0.049613254104042076, "phrase": "incomplete_information"}, {"score": 0.015719716506582538, "phrase": "rough_sets"}, {"score": 0.013398922669130616, "phrase": "indiscernibility_relation"}, {"score": 0.011868923114750412, "phrase": "rough_set_theory"}, {"score": 0.0046986841646790315, "phrase": "classical_rough_set_theory"}, {"score": 0.004630270043271386, "phrase": "complete_information_systems"}, {"score": 0.004323886831151445, "phrase": "available_information"}, {"score": 0.003998380230709541, "phrase": "different_equivalent_classes"}, {"score": 0.0037519679864796906, "phrase": "real_world"}, {"score": 0.0034020946201397057, "phrase": "tolerance_relations"}, {"score": 0.003319830880774088, "phrase": "kryszkiewicz"}, {"score": 0.0032237268289353983, "phrase": "tolerance_relation"}, {"score": 0.0026762874092443197, "phrase": "constrained_dissymmetrical_similarity_relation"}, {"score": 0.0026115277372906805, "phrase": "new_extension"}, {"score": 0.0024624103660827695, "phrase": "constrained_similarity_relation"}, {"score": 0.002265586601922693, "phrase": "extended_relations"}, {"score": 0.0021049977753042253, "phrase": "rational_object_classification"}], "paper_keywords": ["rough sets", " incomplete information", " constrained dissymmetrical similarity relation"], "paper_abstract": "The classical rough set theory based on complete information systems stems from the observation that objects with the same characteristics are indiscernible according to available information. With respect to upper-approximation and lower-approximation defined on an indiscernibility relation it classifies objects into different equivalent classes. But in some cases such a rigid indiscernibility relation is far from applications in the real world. Therefore, several generalizations of the rough set theory have been proposed some of which extend the indiscernibility relation using more general similarity or tolerance relations. For example, Kryszkiewicz [4] studied a tolerance relation, and Stefanowski [7] explored a non-symmetric, similarity relation and valued tolerance relation. Unfortunately, All the extensions mentioned above have their inherent limitations. In this paper, after discussing several extension models based on rough sets for incomplete information, a concept of constrained dissymmetrical similarity relation is introduced as a new extension of the rough set theory, the upper-approximation and the lower-approximation defined on constrained similarity relation are proposed as well. Furthermore, we present the comparison between the performance of these extended relations. Analysis of results shows that this relation works effectively in incomplete information and generates rational object classification.", "paper_title": "A new extension model of rough sets under incomplete information", "paper_id": "WOS:000239623500021"}