{"auto_keywords": [{"score": 0.04956371902218427, "phrase": "smrt"}, {"score": 0.04922326105909147, "phrase": "ncor"}, {"score": 0.04888507696109158, "phrase": "bcor"}, {"score": 0.004577777897335174, "phrase": "consensus_dynamic_pharmacophore"}, {"score": 0.0044635893862404385, "phrase": "promising_therapeutic_strategy"}, {"score": 0.004383766516923386, "phrase": "b_cell_lymphomas"}, {"score": 0.004228359613476549, "phrase": "drug_candidates"}, {"score": 0.0039623243082901214, "phrase": "thorough_comparative_analysis"}, {"score": 0.0035171528695692213, "phrase": "molecular_dynamics"}, {"score": 0.0034541965053691307, "phrase": "theoretical_structure"}, {"score": 0.0030438576446554138, "phrase": "main_role"}, {"score": 0.003011033940247791, "phrase": "protein-corepressor_interactions"}, {"score": 0.0029252191241632888, "phrase": "high_relevance"}, {"score": 0.0028832306043717637, "phrase": "specific_bonds"}, {"score": 0.0023462618437394616, "phrase": "hydrogen_donor_pharmacophoric_point"}, {"score": 0.002238500096284007, "phrase": "present_work"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["BCL6", " Molecular dynamics", " Pharmacophore", " Drug design", " DLBCL"], "paper_abstract": "Targeting the BCL6 protein is a promising therapeutic strategy for the treatment of B cell lymphomas. One approach to treat these diseases consists of finding drug candidates able to disrupt the interactions established between BCL6 and its corepressors. Thus, this work presents a thorough comparative analysis of the interactions between the BCL6 BTB (bric-a-brac tramtrack broad complex) protein domain and its SMRT, NcoR and BCOR corepressor BBDs (BCL6 binding domain) through molecular dynamics. Moreover, a theoretical structure is presented and checked for the BCL6(BTB)-NC0R(BBD) complex. Considering the BBDs to be composed of 17 amino acids, our analyses show the region involving residues 4-15 of these 17 to play a main role in the protein-corepressor interactions. Particularly SER11 seems to have a high relevance as it establishes specific bonds with BCL6(BTB) and is one of the only two residues sequence equivalent for the three studied corepressors. From this study, 14 pharmacophoric points have been proposed divided in two groups which coincide with residues 4-11 and 11-15, being SER11 a hinge point. This finding suggests the possibility of searching for 2 small molecule inhibitors, mimicking 8 and 7 pharmacophoric points, respectively, which could incorporate a hydrogen donor pharmacophoric point mimicking SER11 in any or both molecules. In short, the present work aims to contribute further knowledge in the modeling of drugs mimicking BCL6(BTB)-corepressor complexes. (C) 2014 Elsevier Inc. All rights reserved.", "paper_title": "Molecular dynamics analysis of the interaction between the human BCL6 BTB domain and its SMRT, NcoR and BCOR corepressors: The quest for a consensus dynamic pharmacophore", "paper_id": "WOS:000336875600015"}