{"auto_keywords": [{"score": 0.04954033184026157, "phrase": "designer_drugs"}, {"score": 0.015719716506582538, "phrase": "cross_reactivity"}, {"score": 0.012468423799986366, "phrase": "synthetic_cannabinoids"}, {"score": 0.010260727710311413, "phrase": "virtual_library"}, {"score": 0.004584495834677719, "phrase": "abuse_testing"}, {"score": 0.004348580182733617, "phrase": "existing_clinical_drug_classes"}, {"score": 0.004203343568960231, "phrase": "abuse_screening_immunoassays"}, {"score": 0.004062937864702115, "phrase": "small_subset"}, {"score": 0.0040323765107766335, "phrase": "designer_amphetamine-like_drugs"}, {"score": 0.003927203683176278, "phrase": "tetrahydrocannabinol_metabolites"}, {"score": 0.0037674258625824113, "phrase": "classic_cannabinoid_chemical_backbone"}, {"score": 0.0034279721355412285, "phrase": "clinical_care"}, {"score": 0.003325921766364862, "phrase": "designer_amphetamine-like_and_synthetic_cannabinoid_drugs"}, {"score": 0.0032147302611408835, "phrase": "virtual_chemical_libraries"}, {"score": 0.0031905286720361145, "phrase": "molecular_similarity_analysis"}, {"score": 0.0031072444973406586, "phrase": "synthetic_cannabinoid_analysis"}, {"score": 0.0029807267909921628, "phrase": "amphetamine-type_stimulants"}, {"score": 0.0028271058251633815, "phrase": "target_molecule"}, {"score": 0.002795228413298423, "phrase": "immunoassay_undergoing_analysis"}, {"score": 0.0027119634978446895, "phrase": "cross-reactive_and_non-cross-reactive_compounds"}, {"score": 0.002458061764297103, "phrase": "designer_amphetamine-type_stimulants"}, {"score": 0.0024120247307686084, "phrase": "similarity_calculations"}, {"score": 0.002279011030331704, "phrase": "cross-reactivity_studies"}, {"score": 0.0021049977753042253, "phrase": "broader_array"}], "paper_keywords": ["Amphetamines", " Cannabinoids", " Molecular models", " Similarity", " Toxicology"], "paper_abstract": "Background: A challenge for drug of abuse testing is presented by 'designer drugs', compounds typically discovered by modifications of existing clinical drug classes such as amphetamines and cannabinoids. Drug of abuse screening immunoassays directed at amphetamine or methamphetamine only detect a small subset of designer amphetamine-like drugs, and those immunoassays designed for tetrahydrocannabinol metabolites generally do not cross-react with synthetic cannabinoids lacking the classic cannabinoid chemical backbone. This suggests complexity in understanding how to detect and identify whether a patient has taken a molecule of one class or another, impacting clinical care. Methods: Cross-reactivity data from immunoassays specifically targeting designer amphetamine-like and synthetic cannabinoid drugs was collected from multiple published sources, and virtual chemical libraries for molecular similarity analysis were built. The virtual library for synthetic cannabinoid analysis contained a total of 169 structures, while the virtual library for amphetamine-type stimulants contained 288 compounds. Two-dimensional (2D) similarity for each test compound was compared to the target molecule of the immunoassay undergoing analysis. Results: 2D similarity differentiated between cross-reactive and non-cross-reactive compounds for immunoassays targeting mephedrone/methcathinone, 3,4-methylenedioxypyrovalerone, benzylpiperazine, mephentermine, and synthetic cannabinoids. Conclusions: In this study, we applied 2D molecular similarity analysis to the designer amphetamine-type stimulants and synthetic cannabinoids. Similarity calculations can be used to more efficiently decide which drugs and metabolites should be tested in cross-reactivity studies, as well as to design experiments and potentially predict antigens that would lead to immunoassays with cross reactivity for a broader array of designer drugs.", "paper_title": "Using cheminformatics to predict cross reactivity of \"designer drugs\" to their currently available immunoassays", "paper_id": "WOS:000336989800001"}