{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "entrepreneurship_orientation"}, {"score": 0.004434910775034831, "phrase": "widely_accepted_way"}, {"score": 0.0039040344230094164, "phrase": "multiple_items"}, {"score": 0.003793206550770237, "phrase": "entrepreneurial_firms"}, {"score": 0.0037159680715717056, "phrase": "venture_capitalists"}, {"score": 0.0036855132234738736, "phrase": "business_angels"}, {"score": 0.0036553070575015344, "phrase": "investment_banks"}, {"score": 0.0034506596895901003, "phrase": "simple_approach"}, {"score": 0.003394314924677555, "phrase": "overall_level"}, {"score": 0.0033665073609807005, "phrase": "eo"}, {"score": 0.0033251716926666437, "phrase": "item_scores"}, {"score": 0.0029876282026237207, "phrase": "fuzzy_analytic_hierarchy_process"}, {"score": 0.0027741770138337567, "phrase": "eo."}, {"score": 0.002629539710839523, "phrase": "pairwise_comparisons"}, {"score": 0.002239225269052105, "phrase": "considerable_differences"}, {"score": 0.0021050078070343043, "phrase": "elsevier"}], "paper_keywords": ["Entrepreneurship orientation (EO)", " Small to medium-sized enterprises (SMEs)", " Multi-criteria decision-making (MCDM)", " Fuzzy preference programming", " Fuzzy analytic hierarchy process (AHP)", " Model validation"], "paper_abstract": "This paper describes an approach to measuring the entrepreneurship orientation (EO) of firms. EO is a widely accepted way to measure the degree in which a firm is entrepreneurial. The scale has three dimensions - innovativeness, risk-taking and proactiveness - each of which is assessed using multiple items. Measuring EO is important for entrepreneurial firms and for organizations like venture capitalists, business angels, investment banks and governments investing in these firms. Both the traditional statistical and the simple approach of assessing the overall level of EO (adding item scores) have their disadvantages. The aim of this article is to discuss these disadvantages and describe how some of them can be removed by using fuzzy analytic hierarchy process (AHP), which is a multi-criteria decision-making (MCDM) method that is particularly suited to tackle multi-dimensional, fuzzy, and perception-based constructs such as EO. We first improve a fuzzy AHP and then apply it using the pairwise comparisons of three experts to evaluate the EO of 59 small to medium-sized enterprises (SMEs) and rank the firms based on their EO score. The results indicate that proactiveness is by far the most important dimension, followed by innovativeness. Furthermore, there are considerable differences when it comes to the weights of the items. (C) 2012 Elsevier B. V. All rights reserved.", "paper_title": "An improved fuzzy preference programming to evaluate entrepreneurship orientation", "paper_id": "WOS:000319205200047"}