{"auto_keywords": [{"score": 0.04955691910341986, "phrase": "service_time_distribution"}, {"score": 0.010612387000973441, "phrase": "server_farms"}, {"score": 0.007537191680484452, "phrase": "adapt-policy"}, {"score": 0.006055414844994288, "phrase": "task_assignment_policy"}, {"score": 0.004524801966077539, "phrase": "static_web_content"}, {"score": 0.003937649447496154, "phrase": "particular_distribution"}, {"score": 0.0034516024325468653, "phrase": "adaptive_task_assignment_policy"}, {"score": 0.003303259489028193, "phrase": "multiple_static-based_task_assignment_policies"}, {"score": 0.0031039212233596415, "phrase": "specific_properties"}, {"score": 0.002948798472453167, "phrase": "different_performance_characteristics"}, {"score": 0.002927278301452369, "phrase": "different_workload_conditions"}, {"score": 0.002710557619357275, "phrase": "best_performance"}, {"score": 0.002632272952905936, "phrase": "least_expected_waiting_time"}, {"score": 0.0025098414374397308, "phrase": "traffic_conditions"}, {"score": 0.0024284249875593253, "phrase": "best_task_assignment"}, {"score": 0.002175594509651082, "phrase": "experimental_results"}, {"score": 0.002120485727210402, "phrase": "significant_performance_improvements"}], "paper_keywords": ["Adaptive task assignment", " locality aware task assignment policies", " non-parametric density estimation", " on-line density estimation", " performance optimisation"], "paper_abstract": "Service time distribution of certain computing workloads such as static web content is well known. However, for many other computing workloads (e. g., dynamic web content, scientific workloads) the service time distribution is not well understood and it is not correct to assume that these tasks follow a particular distribution. In this paper, we consider task assignment in server farms when both the service time distribution of tasks and (actual) sizes of tasks are not known a priori. We propose an adaptive task assignment policy, called ADAPT-POLICY, which is based on the concept of multiple static-based task assignment policies. ADAPT-POLICY defines a set of policies for a given system taking into account the specific properties of the system. These policies are selected in such a way that they have different performance characteristics under different workload conditions (i.e., service time distributions, etc.). The objective is to use the task assignment policy with the best performance (i.e., the one with the least expected waiting time) to assign tasks. Which task assignment policy performs the best depends on the traffic conditions that vary over time. ADAPT-POLICY determines the best task assignment using the service time distribution of tasks (and various other traffic properties), which is estimated on-line and then it adaptively changes the task assignment policy to suit the most recent traffic conditions. The experimental results show that ADAPT-POLICY can result in significant performance improvements over both static and dynamic task assignment policies.", "paper_title": "ADAPT-POLICY: Task Assignment in Server Farms when the Service Time Distribution of Tasks is Not Known A Priori", "paper_id": "WOS:000334672900003"}