{"auto_keywords": [{"score": 0.015719716506582538, "phrase": "institutional_clinical_data_warehouse"}, {"score": 0.015440512770253309, "phrase": "adverse_drug_reactions"}, {"score": 0.008776827802314353, "phrase": "pediatric_inpatients"}, {"score": 0.004165105357908494, "phrase": "specific_example"}, {"score": 0.003987755561492638, "phrase": "retrospective_cohort_design"}, {"score": 0.003944768214972836, "phrase": "cdw"}, {"score": 0.0037903327482565097, "phrase": "drug_x"}, {"score": 0.0036953083157220384, "phrase": "adr"}, {"score": 0.0036157418067192136, "phrase": "laboratory_measurement_z"}, {"score": 0.0034118234596993836, "phrase": "defined_criteria"}, {"score": 0.0030267296900520217, "phrase": "patient_characteristics"}, {"score": 0.0027842669893795766, "phrase": "study_period"}, {"score": 0.002469830206270585, "phrase": "increased_risk"}, {"score": 0.002263639474937039, "phrase": "cephalosporin-associated_nephrotoxicity"}, {"score": 0.0021049977753042253, "phrase": "institutional_cow"}], "paper_keywords": ["clinical data warehouse", " relational database", " retrospective cohort study", " adverse drug reactions"], "paper_abstract": "Objectives. To apply an institutional clinical data warehouse (CDW) to the assessment of adverse drug reactions (ADRs) and demonstrate its utility through a specific example. Methods. We modeled the process for assessing ADRs through retrospective cohort design by using CDW at the Osaka University Hospital as follows: 1) We defined a drug X, an adverse drug reaction (ADR) Y, and a laboratory measurement Z to assess Y during a given study period; 2) we excluded those whose Z value exceeded the defined criteria or were not available at the inception of the cohort; 3) we divided the patients into two groups based on exposure or non-exposure to X; 4) we matched the patient characteristics between the two groups through stratification and randomization. and 5) we compared the frequency of patients who presented Y during the study period between the two groups. Aminoglycoside and Cephalosporin associated nephrotoxicity in pediatric inpatients was used as an example to demonstrate the usefulness of this approach. Results: Our evaluation indicates that there is an increased risk of nephrotoxicity for pediatric inpatients who were prescribed cepholosporin either alone or in combination with aminoglycoside; further, aminoglycoside tends to increase the cephalosporin-associated nephrotoxicity. Conclusions. Our findings are consistent with those drawn from other studies, indicating that the method of applying an institutional COW is useful for assessing ADRs.", "paper_title": "The application of an institutional clinical data warehouse to the assessment of adverse drug reactions (ADRs) - Evaluation of aminoglycoside and cephalosporin associated nephrotoxicity", "paper_id": "WOS:000250337000003"}