{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "visual_quality_inspection"}, {"score": 0.01315509605711092, "phrase": "multiple_human_operators"}, {"score": 0.004761132425263795, "phrase": "multiple_humans"}, {"score": 0.004655285779819366, "phrase": "machine_learning_technology"}, {"score": 0.004603244077348199, "phrase": "real-world_applications"}, {"score": 0.0032296377835432533, "phrase": "trained_ensembles"}, {"score": 0.003104849179057156, "phrase": "applicable_ensemble_techniques"}, {"score": 0.0028373742057129126, "phrase": "novel_ensemble_framework"}, {"score": 0.0027123819773059127, "phrase": "grading_ensemble_technique-called_active_grading"}, {"score": 0.0025208755851561368, "phrase": "real-world_industrial_system"}, {"score": 0.0021651504858015364, "phrase": "standard_grading_algorithm"}], "paper_keywords": ["Multiple classifier systems", " Classifier fusion", " Active grading ensemble", " Visual quality inspection", " Learning from multiple humans"], "paper_abstract": "When applying machine learning technology to real-world applications, such as visual quality inspection, several practical issues need to be taken care of. One problem is posed by the reality that usually there are multiple human operators doing the inspection, who will inevitably contradict each other for some of the products to be inspected. In this paper an architecture for learning visual quality inspection is proposed which can be trained by multiple human operators, based on trained ensembles of classifiers. Most of the applicable ensemble techniques have however difficulties learning in these circumstances. In order to effectively train the system a novel ensemble framework is proposed as an enhancement of the grading ensemble technique-called active grading. The active grading algorithms are evaluated on data obtained from a real-world industrial system for visual quality inspection of the printing of labels on CDs, which was labelled independently by four different human operators and their supervisor, and compared to the standard grading algorithm and a range of other ensemble (classifier fusion) techniques.", "paper_title": "The active grading ensemble framework for learning visual quality inspection from multiple humans", "paper_id": "WOS:000317740600007"}