{"auto_keywords": [{"score": 0.013815283247925164, "phrase": "clinical_vignettes"}, {"score": 0.009231569792944257, "phrase": "information_use"}, {"score": 0.00481495049065317, "phrase": "primary_health_care"}, {"score": 0.004780183091824403, "phrase": "primary_health_care_practitioners"}, {"score": 0.004677372885331908, "phrase": "electronic_knowledge_resources"}, {"score": 0.004060718465754644, "phrase": "mixed_methods_study"}, {"score": 0.004016782710006123, "phrase": "quantitative_longitudinal_study"}, {"score": 0.003973320429450603, "phrase": "qualitative_multiple_case_study"}, {"score": 0.0037493114715625784, "phrase": "online_resource"}, {"score": 0.003668591097652231, "phrase": "treatment_recommendations"}, {"score": 0.0034491650585057754, "phrase": "rated_searches"}, {"score": 0.003362660648932247, "phrase": "log_reports"}, {"score": 0.0033262524445013303, "phrase": "think-aloud_protocol"}, {"score": 0.0032546105164772995, "phrase": "clearly_described_searches"}, {"score": 0.0032310733124059536, "phrase": "clinical_information"}, {"score": 0.003172969962401266, "phrase": "specific_patient"}, {"score": 0.0030267296900520217, "phrase": "quantitative_and_qualitative_data"}, {"score": 0.0028352726653271187, "phrase": "clinical_situations"}, {"score": 0.0026175952455594277, "phrase": "health_deterioration"}, {"score": 0.0024788167298469455, "phrase": "patient_satisfaction"}, {"score": 0.0023644936731468252, "phrase": "perceived_benefits"}], "paper_keywords": ["information use", " lifelong learning"], "paper_abstract": "Primary health care practitioners routinely search for information within electronic knowledge resources. We proposed four levels of outcomes of informationseeking: situational relevance, cognitive impact, information use, and patient health outcomes. Our objective was to produce clinical vignettes for describing and testing these levels. We conducted a mixed methods study combining a quantitative longitudinal study and a qualitative multiple case study. Participants were 10 nurses, 10 medical residents, and 10 pharmacists. They had access to an online resource, and did 793 searches for treatment recommendations. Using the Information Assessment Method (IAM), participants rated their searches for each of the four levels. Rated searches were examined in interviews guided by log reports and a think-aloud protocol. Cases were defined as clearly described searches where clinical information was used for a specific patient. For each case, interviewees described the four levels of outcomes. Quantitative and qualitative data were merged into clinical vignettes. We produced 130 clinical vignettes. Specifically, 46 vignettes (35.4%) corresponded to clinical situations where information use was associated with one or more than one type of positive patient health outcome: increased patient knowledge (n = 28), avoidance of unnecessary or inappropriate intervention (n = 25), prevention of disease or health deterioration (n = 9), health improvement (n = 6), and increased patient satisfaction (n = 3). Results suggested information use was associated with perceived benefits for patients. This may encourage clinicians to search for information more often when they feel the need. Results supported the four proposed levels of outcomes, which can be transferable to other information-seeking contexts.", "paper_title": "Four levels of outcomes of information-seeking: A mixed methods study in primary health care", "paper_id": "WOS:000323384600009"}