{"auto_keywords": [{"score": 0.04409969247376604, "phrase": "static_monitoring_nodes"}, {"score": 0.04246301635594336, "phrase": "surveillance_sensor_network"}, {"score": 0.007872462260861602, "phrase": "static_monitoring_node"}, {"score": 0.00481495049065317, "phrase": "lifetime_optimization_of"}, {"score": 0.004767826806287385, "phrase": "indoor_surveillance_sensor_network"}, {"score": 0.004721162131188487, "phrase": "adaptive_energy-efficient_transmission"}, {"score": 0.004652016085325825, "phrase": "indoor_surveillance_system"}, {"score": 0.004406994912939125, "phrase": "surveillance_system"}, {"score": 0.004321118442104989, "phrase": "home_server"}, {"score": 0.003709693561373117, "phrase": "pyroelectric_infrared_sensor"}, {"score": 0.0036373553416391823, "phrase": "abnormal_event"}, {"score": 0.003462599815177726, "phrase": "alert_messages"}, {"score": 0.0034118234596993836, "phrase": "adaptive_energy-efficient_transmission_method"}, {"score": 0.0027741761880779535, "phrase": "experimental_results"}, {"score": 0.0027200305495826797, "phrase": "transmission_power"}, {"score": 0.002464709648714996, "phrase": "energy_consumption"}, {"score": 0.002404706573379854, "phrase": "transmission_security_mechanism"}, {"score": 0.0022005118194652704, "phrase": "lowest_transmission_power"}, {"score": 0.0021049977753042253, "phrase": "node_loss"}], "paper_keywords": [""], "paper_abstract": "An indoor surveillance system is proposed and carried out in this paper. The surveillance system consists of a home server, omnirobots, and static monitoring nodes. The omnirobots and static monitoring nodes form a surveillance sensor network which comprises several star-like wireless sensor networks. The static monitoring nodes sleep periodically and can be woken up by the pyroelectric infrared sensor. If an abnormal event happens, the static monitoring node will capture images and produce alert messages. An adaptive energy-efficient transmission method is proposed to prolong and balance the lifetime of each static monitoring node. The static monitoring nodes can adjust their transmission power according to the distance to the omnirobots. Meanwhile, the omnirobots can also adjust their positions to extend the lifetime of the surveillance sensor network. Experimental results demonstrate that the transmission power of the static monitoring nodes is minimized sufficiently. A 160 x 120 image can be transmitted within 2.1 s in the surveillance sensor network. The energy consumption of transmitting images without transmission security mechanism reduces by 21%. And it saves 11.7% of energy that an image is transmitted with the lowest transmission power. The surveillance sensor network can be conscious of the node loss and self-recovers timely.", "paper_title": "Lifetime Optimization of an Indoor Surveillance Sensor Network Using Adaptive Energy-Efficient Transmission", "paper_id": "WOS:000351385300001"}