{"auto_keywords": [{"score": 0.04954033184026155, "phrase": "visual_representation"}, {"score": 0.00481495049065317, "phrase": "data_sketching"}, {"score": 0.004373267443572639, "phrase": "visual_representations"}, {"score": 0.00399449659126893, "phrase": "faster_and_more_expressive_ways"}, {"score": 0.0033893426032054366, "phrase": "qualitative_study"}, {"score": 0.0032760377953971248, "phrase": "varying_degrees"}, {"score": 0.003239114833599948, "phrase": "visualization_expertise"}, {"score": 0.0025965853546625352, "phrase": "data_sketching_representation_continuum"}, {"score": 0.002495521662819317, "phrase": "data_report_spectrum"}, {"score": 0.0024673738215365104, "phrase": "individual_data_items"}, {"score": 0.0024395426929046415, "phrase": "speculative_data_hypothesis"}, {"score": 0.0023313149689465386, "phrase": "representation_types"}, {"score": 0.0022919762167777427, "phrase": "data_reports"}, {"score": 0.002153316680437517, "phrase": "participants'_representations"}], "paper_keywords": [""], "paper_abstract": "Hand-drawn sketching on napkins or whiteboards is a common, accessible method for generating visual representations. This practice is shared by experts and non-experts and is probably one of the faster and more expressive ways to draft a visual representation of data. In order to better understand the types of and variations in what people produce when sketching data, we conducted a qualitative study. We asked people with varying degrees of visualization expertise, from novices to experts, to manually sketch representations of a small, easily understandable dataset using pencils and paper and to report on what they learned or found interesting about the data. From this study, we extract a data sketching representation continuum from numeracy to abstraction; a data report spectrum from individual data items to speculative data hypothesis; and show the correspondence between the representation types and the data reports from our results set. From these observations we discuss the participants' representations in relation to their data reports, indicating implications for design and potentially fruitful directions for research.", "paper_title": "An Exploratory Study of Data Sketching for Visual Representation", "paper_id": "WOS:000358328200026"}