{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "directed_transfer_function"}, {"score": 0.038589809821624695, "phrase": "brain's_flow"}, {"score": 0.035009495540742695, "phrase": "eeg_data"}, {"score": 0.004785682967399109, "phrase": "mvdr_coherence_methods"}, {"score": 0.004698938469311569, "phrase": "electroencephalogram_functional_connectivity"}, {"score": 0.004516323676817212, "phrase": "selected_brain_regions"}, {"score": 0.004327555970055785, "phrase": "functional_connectivity"}, {"score": 0.003973267259774664, "phrase": "higher_spectral_resolution"}, {"score": 0.0039370647208387234, "phrase": "welch's_periodogram-based_approach"}, {"score": 0.0036926830072270076, "phrase": "effective_connectivity"}, {"score": 0.0036256778700153227, "phrase": "different_regions"}, {"score": 0.0035707703437904367, "phrase": "dtf"}, {"score": 0.003516684084316783, "phrase": "main_brain_areas"}, {"score": 0.0034423371331039464, "phrase": "spatial_distribution"}, {"score": 0.003169954314343514, "phrase": "six_main_electrodes"}, {"score": 0.0028748209350107743, "phrase": "specific_condition"}, {"score": 0.0027968664019097393, "phrase": "statistical_analysis"}, {"score": 0.0027293449981640105, "phrase": "post_hoc_tests"}, {"score": 0.0027127202051739608, "phrase": "bonferroni_alpha_correction"}, {"score": 0.0025833067045287874, "phrase": "marked_difference"}, {"score": 0.002482706594054615, "phrase": "dtf_analyses"}, {"score": 0.002393317277328894, "phrase": "delta_frequency_band"}, {"score": 0.002349834016814399, "phrase": "meditation_condition"}, {"score": 0.0021374167789011246, "phrase": "brain's_information_flow"}], "paper_keywords": ["Directed transfer function", " Coherence", " EEG", " Meditation", " Drowsiness"], "paper_abstract": "This study examined the electroencephalogram functional connectivity (coherence) and effective connectivity (flow of information) of selected brain regions during three different attentive states: awake, meditation and drowsiness. For the estimation of functional connectivity (coherence), Welch and minimum variance distortionless response (MVDR) methods were compared. The MVDR coherence was found to be more suitable since it is both data and frequency dependent and enables higher spectral resolution, while Welch's periodogram-based approach is both data and frequency independent. The directed transfer function (DTF) method was applied in order to estimate the effective connectivity or brain's flow of information between different regions during each state. DTF enables to identify the main brain areas that initiate EEG activity and the spatial distribution of these activities with time. Analysis was conducted using the EEG data of 30 subjects (ten awake, ten drowsy and ten meditating) focusing on six main electrodes (F3, F4, C3, C4, P3, P4, O1 and O2). For each subject, EEG data were recorded during 5-min baseline and 15 min of a specific condition (awake, meditation or drowsiness). Statistical analysis included the Kruskal-Wallis (KW) nonparametric analysis of variance followed by post hoc tests with Bonferroni alpha correction. The results reveal that both states of drowsiness and meditation states lead to a marked difference in the brain's flow of information (effective connectivity) as shown by DTF analyses. In specific, a significant increase in the flow of information in the delta frequency band was found only in the meditation condition and was further found to originate from frontal (F3, F4), parietal (P3, P4) and occipital (O1, O2) regions. Altogether, these results suggest that a change in attentiveness leads to significant changes in the spectral profile of the brain's information flow as well as in its functional connectivity and that these changes can be captured using coherence and DTF analyses.", "paper_title": "Comparison between human awake, meditation and drowsiness EEG activities based on directed transfer function and MVDR coherence methods", "paper_id": "WOS:000354638900003"}