{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "bayesian_nonparametric_methods"}, {"score": 0.00477190623242136, "phrase": "partially-observable_reinforcement_learning"}, {"score": 0.004645057834614705, "phrase": "incomplete_information"}, {"score": 0.004342430078306461, "phrase": "imperfect_sensors"}, {"score": 0.004284302478991387, "phrase": "speech-based_interfaces"}, {"score": 0.004208002469225673, "phrase": "user's_needs"}, {"score": 0.0041703614123283165, "phrase": "noisy_microphone_inputs"}, {"score": 0.0038985392250620483, "phrase": "natural_representation"}, {"score": 0.003595552309967789, "phrase": "domain's_properties"}, {"score": 0.0031559919178954644, "phrase": "new_data"}, {"score": 0.003044455555031339, "phrase": "stochastic_systems"}, {"score": 0.0030171910207671205, "phrase": "bayesian_nonparametric_statistics"}, {"score": 0.0027328817607818207, "phrase": "careful_empirical_evaluation"}, {"score": 0.0024641814990854463, "phrase": "bayesian_aspects"}, {"score": 0.002272415777234064, "phrase": "relatively_few_samples"}, {"score": 0.0022318655527987846, "phrase": "nonparametric_aspects"}, {"score": 0.0021049977753042253, "phrase": "different_techniques"}], "paper_keywords": ["Artificial intelligence", " machine learning", " reinforcement learning", " partially-observable Markov decision process", " hierarchial Dirichlet process hidden Markov model"], "paper_abstract": "Making intelligent decisions from incomplete information is critical in many applications: for example, robots must choose actions based on imperfect sensors, and speech-based interfaces must infer a user's needs from noisy microphone inputs. What makes these tasks hard is that often we do not have a natural representation with which to model the domain and use for choosing actions; we must learn about the domain's properties while simultaneously performing the task. Learning a representation also involves trade-offs between modeling the data that we have seen previously and being able to make predictions about new data. This article explores learning representations of stochastic systems using Bayesian nonparametric statistics. Bayesian nonparametric methods allow the sophistication of a representation to scale gracefully with the complexity in the data. Our main contribution is a careful empirical evaluation of how representations learned using Bayesian nonparametric methods compare to other standard learning approaches, especially in support of planning and control. We show that the Bayesian aspects of the methods result in achieving state-of-the-art performance in decision making with relatively few samples, while the nonparametric aspects often result in fewer computations. These results hold across a variety of different techniques for choosing actions given a representation.", "paper_title": "Bayesian Nonparametric Methods for Partially-Observable Reinforcement Learning", "paper_id": "WOS:000349625500015"}