{"auto_keywords": [{"score": 0.04845849110410783, "phrase": "user-centred_design_principles"}, {"score": 0.014775725567914871, "phrase": "task_efficiency"}, {"score": 0.011279224819789416, "phrase": "cpoe_test"}, {"score": 0.010338444427368393, "phrase": "cpoe_test_format"}, {"score": 0.008958642173963647, "phrase": "ucd_format"}, {"score": 0.00481495049065317, "phrase": "user-centred_design"}, {"score": 0.004622986791421418, "phrase": "computerized_provider_order_entry"}, {"score": 0.004594138149905221, "phrase": "cpoe"}, {"score": 0.004397151276300207, "phrase": "limited_evaluative_research"}, {"score": 0.004342430078306461, "phrase": "cpoe_systems"}, {"score": 0.003831169445079928, "phrase": "existing_pre-printed_paper_order_sets"}, {"score": 0.0037130155038449554, "phrase": "medical_students"}, {"score": 0.0036782824183282823, "phrase": "sunnybrook_health_sciences_centre"}, {"score": 0.0036097921936903998, "phrase": "toronto"}, {"score": 0.0035872940369572966, "phrase": "canada"}, {"score": 0.0035648266669315943, "phrase": "methods_participants"}, {"score": 0.003265365666305185, "phrase": "order_set_formats"}, {"score": 0.0031845067058084583, "phrase": "individual_training"}, {"score": 0.002944465517142163, "phrase": "submitted_orders"}, {"score": 0.00285357934700279, "phrase": "mean_task_times"}, {"score": 0.0028268629720802772, "phrase": "user_centred_design_format"}, {"score": 0.002548945980967458, "phrase": "cpoe_test_format_tasks"}, {"score": 0.00241658945942583, "phrase": "significant_differences"}, {"score": 0.0021049977753042253, "phrase": "successful_implementation"}], "paper_keywords": [""], "paper_abstract": "Background Application of user-centred design principles to Computerized provider order entry (CPOE) systems may improve task efficiency, usability or safety, but there is limited evaluative research of its impact on CPOE systems. Objective We evaluated the task efficiency, usability, and safety of three order set formats: our hospital's planned CPOE order sets (CPOE Test), computer order sets based on user-centred design principles (User Centred Design), and existing pre-printed paper order sets (Paper). Participants 27staff physicians, residents and medical students. Setting Sunnybrook Health Sciences Centre, an academic hospital in Toronto, Canada. Methods Participants completed four simulated order set tasks with three order set formats (two CPOE Test tasks, one User Centred Design, and one Paper). Order of presentation of order set formats and tasks was randomized. Users received individual training for the CPOE Test format only. Main Measures Completion time (efficiency), requests for assistance (usability), and errors in the submitted orders (safety). Results 27 study participants completed 108 order sets. Mean task times were: User Centred Design format 273 s, Paper format 293 s (p=0.73 compared to UCD format), and CPOE Test format 637 s (p<0.0001 compared to UCD format). Users requested assistance in 31% of the CPOE Test format tasks, whereas no assistance was needed for the other formats (p<0.01). There were no significant differences in number of errors between formats. Conclusions The User Centred Design format was more efficient and usable than the CPOE Test format even though training was provided for the latter. We conclude that application of user-centred design principles can enhance task efficiency and usability, increasing the likelihood of successful implementation.", "paper_title": "Does user-centred design affect the efficiency, usability and safety of CPOE order sets?", "paper_id": "WOS:000289960600011"}