{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "virtual_learning_communities"}, {"score": 0.01534087068966474, "phrase": "multiple_organizations"}, {"score": 0.013970131674390733, "phrase": "cooperative_cloud"}, {"score": 0.011486917131986976, "phrase": "lms"}, {"score": 0.004583205112737672, "phrase": "collaborative_learning_activities"}, {"score": 0.00445318311339027, "phrase": "technological_platforms"}, {"score": 0.004135458387200662, "phrase": "present_paper"}, {"score": 0.0035515148917169173, "phrase": "ho_hypothesis"}, {"score": 0.0032979090806670493, "phrase": "main_objective"}, {"score": 0.003257432325797907, "phrase": "present_work"}, {"score": 0.0027741761880779535, "phrase": "current_lms"}, {"score": 0.00245168871716047, "phrase": "cooperative_learning_tasks"}, {"score": 0.002314271047073691, "phrase": "functional_requirements"}], "paper_keywords": ["Architectures for educational technology system", " Cooperative/collaborative learning", " Distributed learning environments", " Learning communities"], "paper_abstract": "Virtual learning communities are defined as groups where multiple organizations share learning resources and make collaborative learning activities. The Learning Management Systems (LMS) are technological platforms that allow the realization of these spaces in a cooperative cloud of e-learning. In the present paper it is highlighted that despite the fact that organizations agree to cooperate with each other, to develop virtual learning communities, the generation of these spaces are not common, for this reason the paper raises the Ho hypothesis: The LMS present inability to cooperating to generate virtual learning communities that are developed among multiple organizations. The main objective in the present work is to corroborate the hypothesis raised, for which the problem is described and also to review the state of the art is made, noticing that it appears recurrently. Besides, the degree of fitness in current LMS is valued, verifying if they possess functionalities in their architectures to enable communities in a cooperative cloud of e-learning. This paper is useful for organizations that want to develop cooperative learning tasks for their members (students, teachers, directors) given that it identifies functional requirements that LMS must attend in order to make such communities possible. In this paper the problem is divided in variables that facilitate its comprehension and allow validating the hypothesis raised.", "paper_title": "Virtual learning communities: unsolved troubles", "paper_id": "WOS:000360564600017"}