{"auto_keywords": [{"score": 0.04961049691122095, "phrase": "unit_testability"}, {"score": 0.011771991509955906, "phrase": "structural_properties"}, {"score": 0.006268110555297751, "phrase": "mlr"}, {"score": 0.00481495049065317, "phrase": "structural_metrics"}, {"score": 0.004721162131188487, "phrase": "object-oriented_systems"}, {"score": 0.004606479650820579, "phrase": "common_belief"}, {"score": 0.00447251540886613, "phrase": "important_factors"}, {"score": 0.004174824849669107, "phrase": "actual_impact"}, {"score": 0.003935420482629049, "phrase": "multiple_linear_regression"}, {"score": 0.0038397509389856625, "phrase": "partial_least_square_regression"}, {"score": 0.003479692058963528, "phrase": "investigated_structural_metrics"}, {"score": 0.003445591238183763, "phrase": "five_property_dimensions"}, {"score": 0.0031845067058084613, "phrase": "open-source_software_systems"}, {"score": 0.0029576827451501956, "phrase": "expected_direction"}, {"score": 0.0021049977753042253, "phrase": "unit_testing_effort"}], "paper_keywords": ["testability", " metrics", " object-oriented", " testing effort", " unit testing", " prediction"], "paper_abstract": "There is a common belief that structural properties of classes are important factors to determine their unit testability. However, few empirical studies have been conducted to examine the actual impact of structural properties of classes. In this paper, we employ multiple linear regression (MLR) and partial least square regression (PLSR) to investigate the relationships between the metrics measuring structural properties and unit testability of a class. The investigated structural metrics cover five property dimensions, including size, cohesion, coupling, inheritance, and complexity. Our results from open-source software systems show that: (1) most structural metrics are statistically related to unit testability in an expected direction, among which size, complexity, and coupling metrics are the most important predictors; that (2) multivariate regression models based on structural metrics cannot accurately predict unit testability of classes, although they are better able to rank unit testability of classes; that (3) the transition from MLR to PLSR could significantly improve the ability to rank unit testability of classes but cannot improve the ability to predict the unit testing effort of classes.", "paper_title": "An in-depth investigation into the relationships between structural metrics and unit testability in object-oriented systems", "paper_id": "WOS:000312884300010"}