{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "earth's_short-scale_gravity_field"}, {"score": 0.009770225187703277, "phrase": "terrain_roughness"}, {"score": 0.004380265418103948, "phrase": "established_residual_terrain"}, {"score": 0.00431171604706364, "phrase": "advanced_computational_resources"}, {"score": 0.004284596323560538, "phrase": "massive_parallelisation"}, {"score": 0.004204252026468792, "phrase": "srtm"}, {"score": 0.0041384457437123635, "phrase": "bathymetric_information"}, {"score": 0.004112411350177274, "phrase": "coastal_zones"}, {"score": 0.00406083086983316, "phrase": "short-scale_gravity_effects"}, {"score": 0.003848706522241214, "phrase": "spatial_scales"}, {"score": 0.0038124354878360032, "phrase": "spherical-harmonic_coefficients"}, {"score": 0.0036132394176383582, "phrase": "ggmplus_gravity_maps"}, {"score": 0.003338992028053874, "phrase": "maximum_values"}, {"score": 0.0030757650386969903, "phrase": "himalaya_mountains"}, {"score": 0.002952015316359441, "phrase": "good_approximation"}, {"score": 0.002933422608537915, "phrase": "linear_relationship"}, {"score": 0.0025047222344966678, "phrase": "omitted_gravity_signals"}, {"score": 0.0022637650216685906, "phrase": "future_ultra-high_resolution_gravity_models"}, {"score": 0.0022072304165576405, "phrase": "localised_or_global_power_spectra"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Gravity field", " Forward-modelling", " Gravity", " Quasi/geoid", " Vertical deflection", " Supercomputing"], "paper_abstract": "This paper describes the computation and analysis of the Earth's short-scale gravity field through high-resolution gravity forward modelling using the Shuttle Radar Topography Mission (SRTM) global topography model. We use the established residual terrain modelling technique along with advanced computational resources and massive parallelisation to convert the high-pass filtered SRTM topography - complemented with bathymetric information in coastal zones - to implied short-scale gravity effects. The result is the ERTM2160 model (Earth Residual Terrain Modelled-gravity field with the spatial scales equivalent to spherical-harmonic coefficients up to degree 2160 removed). ERTM2160, used successfully for the construction of the GGMplus gravity maps, approximates the short-scale (i.e., similar to 10 km down to similar to 250 m) gravity field in terms of gravity disturbances, quasi/geoid heights and vertical deflections at similar to 3 billion gridded points within +/- 60 degrees latitude. ERTM2160 reaches maximum values for the quasi/geoid height of similar to 30 cm, gravity disturbance in excess of 100 mGal, and vertical deflections of similar to 30 '' over the Himalaya mountains. Analysis of the ERTM2160 field as a function of terrain roughness shows in good approximation a linear relationship between terrain roughness and gravity effects, with values of similar to 1.7 cm (quasi/geoid heights), similar to 11 mGal (gravity disturbances) and 1.5 '' (vertical deflections) signal strength per 100 m standard deviation of the terrain. These statistics can be used to assess the magnitude of omitted gravity signals over various types of terrain when using degree-2160 gravity models such as EGM2008. Applications for ERTM2160 are outlined including its use in gravity smoothing procedures, augmentation of EGM2008, fill-in for future ultra-high resolution gravity models in spherical harmonics, or calculation of localised or global power spectra of Earth's short-scale gravity field. ERTM2160 is freely available via http://ddfe.curtin.edu.au/gravitymodels/ERTM2160. (C) 2014 Elsevier Ltd. All rights reserved.", "paper_title": "Study of the Earth's short-scale gravity field using the ERTM2160 gravity model", "paper_id": "WOS:000345729600008"}