{"auto_keywords": [{"score": 0.004764859786310636, "phrase": "non-visual_access"}, {"score": 0.004682525167261325, "phrase": "haptic_technologies"}, {"score": 0.004537875262684779, "phrase": "structural_content"}, {"score": 0.00450633982324153, "phrase": "graphical_user_interfaces"}, {"score": 0.004428452434981208, "phrase": "interaction_process"}, {"score": 0.0043976740574978085, "phrase": "blind_users"}, {"score": 0.004351905364003354, "phrase": "haptic_design_guidelines"}, {"score": 0.004321656690200878, "phrase": "valuable_assistance"}, {"score": 0.0042766757473077024, "phrase": "non-visual_interfaces"}, {"score": 0.0037196472104696157, "phrase": "commercially_available_products"}, {"score": 0.0036046342610557497, "phrase": "first_and_secondhand_markets"}, {"score": 0.003542276457435362, "phrase": "exploratory_study"}, {"score": 0.0034088473318056537, "phrase": "non-visual_web_interaction"}, {"score": 0.00290304212971385, "phrase": "first_task"}, {"score": 0.0027645030021576926, "phrase": "force-feedback_mouse"}, {"score": 0.0025510720021028107, "phrase": "non-visual_browsing_process"}, {"score": 0.0023540798554571724, "phrase": "web_designers"}, {"score": 0.002329530057661417, "phrase": "appropriate_haptic_feedback"}, {"score": 0.0021951623041245897, "phrase": "universally_accessible_sites"}, {"score": 0.00217987162651941, "phrase": "online_applications"}, {"score": 0.0021346343252001488, "phrase": "british_informatics_society_limited"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Haptic", " Multimodal", " Input devices"], "paper_abstract": "Haptic technologies are often used to improve access to the structural content of graphical user interfaces, thereby augmenting the interaction process for blind users. While haptic design guidelines offer valuable assistance when developing non-visual interfaces, the recommendations presented are often tailored to the feedback produced via one particular haptic input/output device. A blind user is therefore restricted to interacting with a device which may be unfamiliar to him/her, rather than selecting from the range of commercially available products. This paper reviews devices available on the first and secondhand markets, and describes an exploratory study undertaken with 12 blindfolded sighted participants to determine the effectiveness of three devices for non-visual web interaction. The force-feedback devices chosen for the study, ranged in the number of translations and rotations that the user was able to perform when interacting with them. Results have indicated that the Novint Falcon could be used to target items faster in the first task presented, compared with the other devices. However, participants agreed that the force-feedback mouse was most comfortable to use when interacting with the interface. Findings have highlighted the benefits which low cost haptic input/output devices can offer to the non-visual browsing process, and any changes which may need to be made to accommodate their deficiencies. The study has also highlighted the need for web designers to integrate appropriate haptic feedback on their web sites to cater for the strengths and weaknesses of various devices, in order to provide universally accessible sites and online applications. (C) 2011 British Informatics Society Limited. Published by Elsevier B.V. All rights reserved.", "paper_title": "Identifying the effectiveness of using three different haptic devices for providing non-visual access to the web", "paper_id": "WOS:000298211000001"}