{"auto_keywords": [{"score": 0.04884791636929343, "phrase": "interval_variables"}, {"score": 0.011719259328908323, "phrase": "worst_combination"}, {"score": 0.011252309064852993, "phrase": "probabilistic_constraints"}, {"score": 0.008484629681507158, "phrase": "proposed_method"}, {"score": 0.006709629481711323, "phrase": "design_optimization"}, {"score": 0.005613413606538979, "phrase": "random_variables"}, {"score": 0.00481495049065317, "phrase": "-based_approach"}, {"score": 0.004553510708976456, "phrase": "sampling-based_design_optimization"}, {"score": 0.004387117409226736, "phrase": "accurate_surrogate_model"}, {"score": 0.004326243835100231, "phrase": "worst_case"}, {"score": 0.003641713874009232, "phrase": "performance_function"}, {"score": 0.003160854709666311, "phrase": "sampling-based_method"}, {"score": 0.0030225753906647935, "phrase": "dirac_delta_function"}, {"score": 0.002977835845437357, "phrase": "monte_carlo_simulation"}, {"score": 0.002722930209707764, "phrase": "mcs-based_approach"}, {"score": 0.002603758927691463, "phrase": "performance_functions"}, {"score": 0.0025272158996086378, "phrase": "reliability_analysis"}, {"score": 0.0023719332915829268, "phrase": "numerical_results"}, {"score": 0.0021526564019119466, "phrase": "random_and_interval_variables"}, {"score": 0.0021207658298095845, "phrase": "worst_case_probability"}, {"score": 0.0021049977753042253, "phrase": "failure_search"}], "paper_keywords": ["Interval variables", " Sampling-based method", " Dirac delta function", " Monte Carlo simulation", " Surrogate model"], "paper_abstract": "This paper proposes a methodology for sampling-based design optimization in the presence of interval variables. Assuming that an accurate surrogate model is available, the proposed method first searches the worst combination of interval variables for constraints when only interval variables are present or for probabilistic constraints when both interval and random variables are present. Due to the fact that the worst combination of interval variables for probability of failure does not always coincide with that for a performance function, the proposed method directly uses the probability of failure to obtain the worst combination of interval variables when both interval and random variables are present. To calculate sensitivities of the constraints and probabilistic constraints with respect to interval variables by the sampling-based method, behavior of interval variables at the worst case is defined by the Dirac delta function. Then, Monte Carlo simulation is applied to calculate the constraints and probabilistic constraints with the worst combination of interval variables, and their sensitivities. A merit of using an MCS-based approach in the X-space is that it does not require gradients of performance functions and transformation from X-space to U-space for reliability analysis, thus there is no approximation or restriction in calculating sensitivities of constraints or probabilistic constraints. Numerical results indicate that the proposed method can search the worst case probability of failure with both efficiency and accuracy and that it can perform design optimization with mixture of random and interval variables by utilizing the worst case probability of failure search.", "paper_title": "Sampling-based approach for design optimization in the presence of interval variables", "paper_id": "WOS:000331047600006"}