{"auto_keywords": [{"score": 0.049171581461506304, "phrase": "content_distribution"}, {"score": 0.010485505779532204, "phrase": "bcg"}, {"score": 0.0072993901368947345, "phrase": "proposed_scheme"}, {"score": 0.00481495049065317, "phrase": "bayesian_coalition_game"}, {"score": 0.0046046429665581555, "phrase": "latest_developments"}, {"score": 0.004575354958479747, "phrase": "cloud_computing"}, {"score": 0.00437546648278148, "phrase": "efficient_next_generation_infrastructure"}, {"score": 0.004104902932459142, "phrase": "intelligent_sensors"}, {"score": 0.004052823656906696, "phrase": "home_appliances"}, {"score": 0.004027031316965272, "phrase": "high-computing_servers"}, {"score": 0.003802135020791801, "phrase": "source_provider"}, {"score": 0.003532885029484907, "phrase": "challenging_task"}, {"score": 0.0034880375790382586, "phrase": "tight_constraints"}, {"score": 0.003220315882881027, "phrase": "new_bayesian_coalition_game"}, {"score": 0.0028614069155163823, "phrase": "la"}, {"score": 0.002485813299166851, "phrase": "markov_decision_process"}, {"score": 0.0021049977753042253, "phrase": "next_generation_iov_environment"}], "paper_keywords": ["Bayesian coalition game (BCG)", " learning automata (LA)", " smart city", " vehicular cloud"], "paper_abstract": "With the latest developments in cloud computing and Internet of Vehicles (IoV), now it is possible to construct an efficient next generation infrastructure, which may act as an interface for the connection of a number of objects such as vehicles, intelligent sensors, actuators, home appliances, high-computing servers, and computers to the Internet. In such an environment, vehicles on the road may act as source provider or consumer to facilitate various users connected to the Internet. Content distribution to all these objects especially to the vehicles in this environment is a challenging task due to the tight constraints of maintaining connectivity, coverage, and topology of the vehicles. To address these issues, in this paper, we proposed a new Bayesian coalition game (BCG) as-a-service for content distribution among these objects using support from cloud. We have addressed the problem of content distribution to vehicles from the perspective of BCG and learning automata (LA). Content are assumed to be located at the cloud, which is accessed by the vehicles through Internet even on-the-fly. Vehicles are assumed to be the players in the game and form a coalition among themselves using Markov decision process (MDP). For each action taken by an automaton, it may get a reward or a penalty from the environment according to which it updates its action probability vector. The performance of the proposed scheme is evaluated be selecting various parameters. The results obtained show that proposed scheme is effective in building next generation IoV environment.", "paper_title": "Bayesian Coalition Game as-a-Service for Content Distribution in Internet of Vehicles", "paper_id": "WOS:000209672800004"}