{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "cinema_marketing"}, {"score": 0.004476399615305783, "phrase": "common_risk-mitigation_strategy"}, {"score": 0.00436890075128947, "phrase": "anecdotal_evidence"}, {"score": 0.004061584718427419, "phrase": "deeper_study"}, {"score": 0.003964007795174772, "phrase": "potential_audience"}, {"score": 0.003640516896245813, "phrase": "potential_factors"}, {"score": 0.003370565320453525, "phrase": "machine_learning_techniques"}, {"score": 0.003171615440419782, "phrase": "traditional_classification"}, {"score": 0.0031459887611258765, "phrase": "regression_task"}, {"score": 0.002984373546099842, "phrase": "graded_scale"}, {"score": 0.0027854565462509095, "phrase": "support_vector_ordinal_regression"}, {"score": 0.002685558057339722, "phrase": "exhaustive_experiments"}, {"score": 0.0024963543716522087, "phrase": "powerful_traditional_classifiers"}, {"score": 0.002456148932305311, "phrase": "worse_performance"}, {"score": 0.002255431275670053, "phrase": "superstar_persuasion"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Ordinal classification", " Ordinal regression", " Machine learning", " Cinema marketing"], "paper_abstract": "This paper studies the influence of superstars on spectators in cinema marketing. Casting superstars is a common risk-mitigation strategy in the cinema industry. Anecdotal evidence suggests that the presence of superstars is not always a guarantee of success and hence, a deeper study is required to analyze the potential audience of a movie. In this sense, knowledge, attitudes and emotions of spectators towards stars are analyzed as potential factors of influencing the intention of seeing a movie with stars in its cast. This analysis is performed through machine learning techniques. In particular, the problem is stated as an ordinal classification/regression task rather than a traditional classification or regression task, since the intention of watching a movie is measured in a graded scale, hence, its values exhibit an order. Several methods are discussed for this purpose, but Support Vector Ordinal Regression shows its superiority over other ordinal classification/regression techniques. Moreover, exhaustive experiments carried out confirm that the formulation of the problem as an ordinal classification/regression is a success, since powerful traditional classifiers and regressors show worse performance. The study also confirms that talent and popularity expressed by means of knowledge, attitude and emotions satisfactorily explain superstar persuasion. Finally, the impact of these three components is also checked. (C) 2014 Elsevier Ltd. All rights reserved.", "paper_title": "Ordinal classification/regression for analyzing the influence of superstars on spectators in cinema marketing", "paper_id": "WOS:000342250300007"}