{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "user_reviews"}, {"score": 0.004712463245074863, "phrase": "agent-based_approach"}, {"score": 0.0045726187330434025, "phrase": "global_market_place"}, {"score": 0.004379977556546879, "phrase": "different_providers"}, {"score": 0.003949974260471287, "phrase": "real_life"}, {"score": 0.0035620354052144656, "phrase": "consumers'_experiences"}, {"score": 0.003310447652300423, "phrase": "natural_language"}, {"score": 0.0031166151196841308, "phrase": "current_technologies"}, {"score": 0.002822434555587263, "phrase": "existing_information"}, {"score": 0.002738523189244011, "phrase": "possible_candidates"}, {"score": 0.0026456667695073043, "phrase": "consumers'_reviews"}, {"score": 0.0026116610153271943, "phrase": "processable_structures"}, {"score": 0.0025449518236394103, "phrase": "layered_multiagent_framework"}, {"score": 0.0024799423362011582, "phrase": "satisfactory_service_providers"}, {"score": 0.0023046064114537503, "phrase": "deceptive_reviewers"}, {"score": 0.0021695394558562927, "phrase": "different_algorithms"}, {"score": 0.0021049977753042253, "phrase": "different_circumstances"}], "paper_keywords": ["e-commerce", " service selection", " ontologies", " trust"], "paper_abstract": "The Web is becoming a global market place, where the same services and products are offered by different providers. When obtaining a service, consumers have to select one provider among many alternatives to receive a service or buy a product. In real life, when obtaining a service, many consumers depend on the user reviews. User reviews-presumably written by other consumers-provide details on the consumers' experiences and thus are more informative than ratings. The down side is that such user reviews are written in natural language, making it extremely difficult to be interpreted by computers. Therefore, current technologies do not allow automation of user reviews and require too much human effort for tasks such as writing and reading reviews for the providers, aggregating existing information, and finally choosing among the possible candidates. In this paper, we represent consumers' reviews as machine processable structures using ontologies and develop a layered multiagent framework to enable consumers to find satisfactory service providers for their needs automatically. The framework can still function successfully when consumers evolve their language and when deceptive reviewers enter the system. We show the flexibility of the framework by employing different algorithms for various tasks and evaluate them for different circumstances.", "paper_title": "Automating user reviews using ontologies: an agent-based approach", "paper_id": "WOS:000300584800003"}