{"auto_keywords": [{"score": 0.04291971448885598, "phrase": "competing_stations"}, {"score": 0.00894705310850456, "phrase": "minimum_scaling_factor"}, {"score": 0.004815081699328733, "phrase": "ieee"}, {"score": 0.004734038956773703, "phrase": "scalable_wireless_networks"}, {"score": 0.004615202066192795, "phrase": "widespread_popularity"}, {"score": 0.0038789122930433305, "phrase": "explosive_growth"}, {"score": 0.0038461532860146535, "phrase": "wlans'_usage"}, {"score": 0.0037021153060910164, "phrase": "user's_perceived_performance"}, {"score": 0.0036553070575015344, "phrase": "large_number"}, {"score": 0.003533347967582184, "phrase": "important_and_challenging_open_research_problem"}, {"score": 0.0031643005824589917, "phrase": "concrete_answers"}, {"score": 0.002833689453299307, "phrase": "individual_user's_perceived_performance"}, {"score": 0.0026929458952693465, "phrase": "theoretical_analysis"}, {"score": 0.002658863179011018, "phrase": "extensive_simulations"}, {"score": 0.0022530375696567136, "phrase": "future_versions"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["IEEE 802.11", " Wireless local area networks (WLANs)", " Scaling properties", " Sustaining user performance"], "paper_abstract": "The IEEE 802.11 MAC protocol has gained widespread popularity and has been adopted as the de-facto layer 2 protocol for wireless local area networks (WLANs). However, it is well known that as the number of competing stations increases, the performance of the protocol degrades dramatically. Given the explosive growth in WLANs' usage, the question of how to sustain each user's perceived performance when a large number of competing stations are present, is an important and challenging open research problem. Motivated by this, in this paper we analyze the behavior of 802.11-based WLANs as the number of competing stations increases, and attempt to provide concrete answers to the following fundamental questions: (i) is there a set of system and protocol parameters that we can scale in order to sustain each individual user's perceived performance, and (ii) what is the minimum scaling factor? Using theoretical analysis coupled with extensive simulations we show that such a set of parameters exists, and that the minimum scaling factor is equal to the factor by which the number of users increases. Our results reveal several important scaling properties that exist in today's 802.11-based wireless networks, and set guidelines for designing future versions of such networks that can efficiently support a very large number of users. (C) 2010 Elsevier B.V. All rights reserved.", "paper_title": "On scaling the IEEE 802.11 to facilitate scalable wireless networks", "paper_id": "WOS:000280258300005"}