{"auto_keywords": [{"score": 0.03529083600825501, "phrase": "different_information_content"}, {"score": 0.03255859068357465, "phrase": "slovenian_language"}, {"score": 0.00481495049065317, "phrase": "scholarly_abstracts"}, {"score": 0.004126840854872329, "phrase": "basic_content"}, {"score": 0.0037828412206668206, "phrase": "computerized_searching"}, {"score": 0.003738200814271716, "phrase": "iso_standard"}, {"score": 0.003399466007862412, "phrase": "different_disciplines"}, {"score": 0.0029830992938695007, "phrase": "international_and_slovenian_scientific_periodicals"}, {"score": 0.002788865808981643, "phrase": "international_periodicals"}, {"score": 0.0027341763737751467, "phrase": "international_and_slovenian_abstracts"}, {"score": 0.0025359354516609795, "phrase": "identified_differences"}, {"score": 0.0023990982005125763, "phrase": "different_role"}, {"score": 0.0023334673218688437, "phrase": "professional_society"}, {"score": 0.0021049977753042253, "phrase": "international_journals"}], "paper_keywords": [""], "paper_abstract": "The international standard ISO 214:1976 defines an abstract as \"an abbreviated, accurate representation of the contents of a document\" (p. 1) that should \"enable readers to identify the basic content of a document quickly and accurately to determine relevance\" (p. 1). It also should be useful in computerized searching. The ISO standard suggests including the following elements: purpose, methods, results, and conclusions. Researchers have often challenged this structure and found that different disciplines and cultures prefer different information content. These claims are partially supported by the findings of our research into the structure of pharmacology, sociology, and Slovenian language and literature abstracts of papers published in international and Slovenian scientific periodicals. The three disciplines have different information content. Slovenian pharmacology abstracts differ in content from those in international periodicals while the differences between international and Slovenian abstracts are small in sociology. In the field of Slovenian language and literature, only domestic abstracts were studied. The identified differences can in part be attributed to the disciplines, but also to the different role of journals and papers in the professional society and to differences in perception of the role of abstracts. The findings raise questions about the structure of abstracts required by some publishers of international journals.", "paper_title": "Components of abstracts: Logical structure of scholarly abstracts in pharmacology, sociology, and linguistics and literature", "paper_id": "WOS:000257168200005"}