{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "collaborative_exploration"}, {"score": 0.004638195656547484, "phrase": "growing_popularity"}, {"score": 0.004606759374526927, "phrase": "location-based_social_networks"}, {"score": 0.00457553517865013, "phrase": "numerous_location_visiting_records"}, {"score": 0.004216880725292, "phrase": "users'_mobility_patterns"}, {"score": 0.004007083686875716, "phrase": "personality_trait"}, {"score": 0.0038467574225322086, "phrase": "human_mobility"}, {"score": 0.003769006950727621, "phrase": "unvisited_but_tailored_locations"}, {"score": 0.0036428866026996707, "phrase": "existing_prediction_algorithms"}, {"score": 0.003581412258960711, "phrase": "regular_mobility_patterns"}, {"score": 0.003545024951402818, "phrase": "severe_challenges"}, {"score": 0.003222687723450745, "phrase": "novelty-seeking_tendency"}, {"score": 0.0031360786664165093, "phrase": "unvisited_candidate_locations"}, {"score": 0.0029096837584084182, "phrase": "novel_problem"}, {"score": 0.002889928791032578, "phrase": "exploration_prediction"}, {"score": 0.002783643041818689, "phrase": "unvisited_locations"}, {"score": 0.0026457018895836783, "phrase": "markov"}, {"score": 0.0023000698178350415, "phrase": "evaluation_results"}, {"score": 0.0022767861692778364, "phrase": "ep"}, {"score": 0.002163193271881447, "phrase": "cepr"}, {"score": 0.0021049977753042253, "phrase": "traditional_location_prediction_algorithms"}], "paper_keywords": ["Algorithms", " Design", " Experimentation", " Location-based services", " Exploration Prediction", " social network", " location prediction", " location recommendation"], "paper_abstract": "With the growing popularity of location-based social networks, numerous location visiting records (e.g., checkins) continue to accumulate over time. The more these records are collected, the better we can understand users' mobility patterns and the more accurately we can predict their future locations. However, due to the personality trait of neophilia, people also show propensities of novelty seeking in human mobility, that is, exploring unvisited but tailored locations for them to visit. As such, the existing prediction algorithms, mainly relying on regular mobility patterns, face severe challenges because such behavior is beyond the reach of regularity. As a matter of fact, the prediction of this behavior not only relies on the forecast of novelty-seeking tendency but also depends on how to determine unvisited candidate locations. To this end, we put forward a Collaborative Exploration and Periodically Returning model (CEPR), based on a novel problem, Exploration Prediction (EP), which forecasts whether people will seek unvisited locations to visit, in the following. When people are predicted to do exploration, a state-of-the-art recommendation algorithm, armed with collaborative social knowledge and assisted by geographical influence, will be applied for seeking the suitable candidates; otherwise, a traditional prediction algorithm, incorporating both regularity and the Markov model, will be put into use for figuring out the most possible locations to visit. We then perform case studies on check-ins and evaluate them on two large-scale check-in datasets with 6M and 36M records, respectively. The evaluation results show that EP achieves a roughly 20% classification error rate on both datasets, greatly outperforming the baselines, and that CEPR improves performances by as much as 30% compared to the traditional location prediction algorithms.", "paper_title": "CEPR: A Collaborative Exploration and Periodically Returning Model for Location Prediction", "paper_id": "WOS:000353638800008"}