{"auto_keywords": [{"score": 0.04760688643890386, "phrase": "repetitive_vectors"}, {"score": 0.012744249505029052, "phrase": "repetitive_vector"}, {"score": 0.005610189274676414, "phrase": "transition-split_net"}, {"score": 0.00481495049065317, "phrase": "incidence_matrix_based_methods_for_computing_repetitive_vectors"}, {"score": 0.004747429622531595, "phrase": "petri_net"}, {"score": 0.004470823343432748, "phrase": "new_methods"}, {"score": 0.004270178957872099, "phrase": "transition-added_net"}, {"score": 0.00385431710959668, "phrase": "original_net"}, {"score": 0.003346119094502001, "phrase": "linear_combination"}, {"score": 0.003287482882222731, "phrase": "nonnegative_rational_coefficients"}, {"score": 0.003195787852087248, "phrase": "new_method"}, {"score": 0.0028740705307540317, "phrase": "associated_transition-split_net"}, {"score": 0.0027546167254869493, "phrase": "exactly_the_support"}, {"score": 0.0026307897899760383, "phrase": "computing_siphons"}, {"score": 0.0025846562485378247, "phrase": "computing_repetitive_vectors"}, {"score": 0.0023826206937008257, "phrase": "minimal_siphons"}, {"score": 0.002127472359795555, "phrase": "linear_transformation"}, {"score": 0.0021049977753042253, "phrase": "incidence_matrix"}], "paper_keywords": ["Petri net", " repetitive vector", " siphon", " T-invariant", " trap", " incidence matrix", " FM algorithm", " dual net"], "paper_abstract": "In this paper, the relations among T-invariants, repetitive vectors and siphons are investigated and new methods for computing repetitive vectors and siphons are suggested based on them. The transition-added net of a net is defined and a relation is shown that there always exists a T-invariant of the transition-added net corresponding to a repetitive vector of the original net, and vice versa. Based on this relation, an algorithm that can compute a set of repetitive vectors of a net is presented. It is proved that any repetitive vector of a net can be expressed as a linear combination of these repetitive vectors with nonnegative rational coefficients. Next, this paper presents a new method for generating siphons based on repetitive vectors. The transition-split net of a net is defined. It can be proved that all siphons of a net are siphons of the associated transition-split net, and vice versa. Any siphon of the transition-split net is exactly the support of a repetitive vector of its dual net, and vice versa. Therefore, computing siphons can be converted into computing repetitive vectors. Finally this paper presents an algorithm that can generate a set of siphons of a net. These siphons contain all minimal siphons and any siphon of the net can be expressed as a union of them. These algorithms, which like FM algorithm computing T-invariants, can be carried out through the linear transformation of the incidence matrix.", "paper_title": "Incidence Matrix Based Methods for Computing Repetitive Vectors and Siphons of Petri Net", "paper_id": "WOS:000262732000007"}