{"auto_keywords": [{"score": 0.004669845451682529, "phrase": "industrial_perspective"}, {"score": 0.0044150318724093226, "phrase": "multi-tenant_style"}, {"score": 0.0033173234105492895, "phrase": "research_community"}, {"score": 0.002889928791032578, "phrase": "research_agendas"}, {"score": 0.002788388542538351, "phrase": "systematic_mapping_study"}, {"score": 0.0025826247025542213, "phrase": "industrial_and_academic_perspective"}, {"score": 0.002466510117718297, "phrase": "complete_overview"}, {"score": 0.00235560370536971, "phrase": "comprehensive_overview"}, {"score": 0.002272794656458419, "phrase": "research_agenda"}, {"score": 0.0021705796895687864, "phrase": "future_research_efforts"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Multi-tenancy", " Systematic mapping study", " Definition"], "paper_abstract": "Software as a service is frequently offered in a multi-tenant style, where customers of the application and their end-users share resources such as software and hardware among all users, without necessarily sharing data. It is surprising that, with such a popular paradigm, little agreement exists with regard to the definition, domain, and challenges of multi-tenancy. This absence is detrimental to the research community and the industry, as it hampers progress in the domain of multi-tenancy and enables organizations and academics to wield their own definitions to further their commercial or research agendas. In this article, a systematic mapping study on multi-tenancy is described in which 761 academic papers and 371 industrial blogs are analysed. Both the industrial and academic perspective are assessed, in order to get a complete overview. The definition and topic maps provide a comprehensive overview of the domain, while the research agenda, listing four important research topics, provides a roadmap for future research efforts. (C) 2014 Elsevier Inc. All rights reserved.", "paper_title": "Defining multi-tenancy: A systematic mapping study on the academic and the industrial perspective", "paper_id": "WOS:000347739200012"}