{"auto_keywords": [{"score": 0.015719716506582538, "phrase": "required_number"}, {"score": 0.013334515178123934, "phrase": "preliminary_phase"}, {"score": 0.012078652472609214, "phrase": "finals_phase"}, {"score": 0.01104348273247463, "phrase": "least_timeslots"}, {"score": 0.010634327006646158, "phrase": "diagonal_symmetric_matrix"}, {"score": 0.0046797114400479135, "phrase": "minimum_timeslots"}, {"score": 0.004275904315753662, "phrase": "non-professional_sports"}, {"score": 0.0031244995579170435, "phrase": "schedule_games"}, {"score": 0.002683304054823427, "phrase": "total_number"}, {"score": 0.002371018116266096, "phrase": "constraint_programming_model"}, {"score": 0.002186712881521657, "phrase": "appropriate_competition_format"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Sports scheduling", " Round robin tournament", " Single elimination", " Double elimination"], "paper_abstract": "We studied a two-phase, preliminary and finals, tournament, which commonly adopted for non-professional sports. The round robin tournament in divisions is played in the preliminary phase, followed by one of the three variants, namely single elimination, double elimination, and round robin in the finals phase. The objective is to determine the required number of venues (tables or courts) subject to the least timeslots under the given format. We used a diagonal symmetric matrix to pair teams to games and to schedule games in timeslots for the round robin tournament. For the preliminary phase, we proposed a procedure to find the number of divisions and the number of teams in each division that minimize the total number of games and timeslots accordingly. For the finals phase, we determined the number of venues required in the least timeslots. We then formulated a constraint programming model based on the diagonal symmetric matrix for the round robin tournament. Finally, we provided suggestions for choosing the appropriate competition format. (c) 2013 Published by Elsevier Ltd.", "paper_title": "Sports tournament scheduling to determine the required number of venues subject to the minimum timeslots under given formats", "paper_id": "WOS:000319098000005"}