{"auto_keywords": [{"score": 0.031423702192932314, "phrase": "competitive_advantage"}, {"score": 0.007908918772754184, "phrase": "strategic_it_flexibility"}, {"score": 0.0078479930460578, "phrase": "business-it_partnership"}, {"score": 0.00775747645872398, "phrase": "business-it_alignment"}, {"score": 0.007533926320946817, "phrase": "china"}, {"score": 0.0071089884406478265, "phrase": "organizational_capabilities"}, {"score": 0.0047224703862074665, "phrase": "exploratory_study"}, {"score": 0.00447282529270722, "phrase": "information_systems"}, {"score": 0.004352974291381376, "phrase": "information_technologies"}, {"score": 0.004059266990094632, "phrase": "state-of-the-art_information_technologies"}, {"score": 0.003950453462399077, "phrase": "implemented_information_technologies"}, {"score": 0.0037414662674652805, "phrase": "acquired_information_technologies"}, {"score": 0.0036695284042874395, "phrase": "businesses_strategies"}, {"score": 0.0036411406244705557, "phrase": "value_chain_activities"}, {"score": 0.0034618794528555063, "phrase": "company's_information_system"}, {"score": 0.0034217766191752628, "phrase": "new_it_components"}, {"score": 0.0033559647822437298, "phrase": "existing_information_systems"}, {"score": 0.0032786537599187125, "phrase": "whole_information_system"}, {"score": 0.002952146666681891, "phrase": "resource-based_view"}, {"score": 0.0027741761880779535, "phrase": "research_model"}, {"score": 0.0025172781808293827, "phrase": "indirect_impact"}, {"score": 0.0021214346747442363, "phrase": "business_value"}], "paper_keywords": ["Information systems", " Resource-based view", " IT deployment capabilities", " Competitive advantage", " Strategic IT flexibility", " Business-IT partnership", " Business-IT alignment"], "paper_abstract": "As more and more companies are deploying, or plan to deploy, information systems, the organizational capabilities to effectively deploy information technologies to support and shape businesses become increasingly important. While many studies have focused on how to acquire state-of-the-art information technologies and on how to effectively utilize implemented information technologies, more studies are still needed to investigate how a company can successfully deploy acquired information technologies to support and shape businesses strategies and value chain activities. IT deployment capabilities are defined as the organizational capabilities to configure and reconfigure a company's information system by adding new IT components or by adapting the existing information systems in order to make the whole information system available to support and shape businesses. This study identifies and investigates the three building blocks of IT deployment capabilities: strategic IT flexibility, business-IT partnership, and business-IT alignment. Using the resource-based view, we propose a framework to explain the relationship between IT deployment capabilities and competitive advantage. The research model is tested on data collected in China. Results show that strategic IT flexibility and business-IT partnership have direct impacts on competitive advantage, while business-IT alignment has an indirect impact on competitive advantage. The effect of business-IT alignment on competitive advantage is fully mediated by strategic IT flexibility and business-IT partnership. The results provide support for the relationship between IT deployment capabilities and competitive advantage. The study presents implications for how to develop IT deployment capabilities and how to generate business value from IT investment.", "paper_title": "From IT deployment capabilities to competitive advantage: An exploratory study in China", "paper_id": "WOS:000278179800002"}