{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "project_leaders"}, {"score": 0.02293930731851316, "phrase": "design_process"}, {"score": 0.010399966581662968, "phrase": "virtual_reality-based_software"}, {"score": 0.004541479350889989, "phrase": "positive_and_a_necessary_element"}, {"score": 0.00445002931309096, "phrase": "users'_involvement"}, {"score": 0.004382646976850872, "phrase": "user-centered_design"}, {"score": 0.004349337717774096, "phrase": "participatory_design"}, {"score": 0.004218602458288531, "phrase": "vice_versa"}, {"score": 0.00410220263036908, "phrase": "virtual_reality"}, {"score": 0.0036491106734356797, "phrase": "real_design_project"}, {"score": 0.003132236287543072, "phrase": "collective_design"}, {"score": 0.0030379738368892096, "phrase": "possible_action"}, {"score": 0.0027021079763086394, "phrase": "elicited_needs"}, {"score": 0.0025875844752587815, "phrase": "strong_contribution"}, {"score": 0.002528927696484301, "phrase": "others_stakeholders"}, {"score": 0.0021319959284827896, "phrase": "effectively_users"}, {"score": 0.0021049977753042253, "phrase": "emerging_technologies"}], "paper_keywords": ["Ergonomics", " Design process", " Emerging technologies", " Needs"], "paper_abstract": "Context: The participation of users in the design process is recognized as a positive and a necessary element as artifacts suit their needs. Two complementary approaches of users' involvement co-exist: the user-centered design and the participatory design. These approaches involve learning process from users to designers and vice versa. However, there has no research in design of virtual reality (VR)-based software dealing with how the elaboration of needs is actually distributed in time and among users, designers and project leaders, as well as how it is actually supported by tools and methods. Objective: This paper aims to observe, in a real design project of a virtual reality-based software, how the various stakeholders (users, designers, project leaders) actually participate by sharing and pulling pieces of information from the process of needs elaboration, and how these contributions evolve throughout the decisions made in the course of the project. Method: Our method, based on the observation of the practices in collective design, allows us to collect and analyze the relationship between each possible action (e.g., elicitation), each stakeholder who initiates these actions (e.g., users) and each phase of the design process (e.g., evaluation phase), and the dynamics of the construction of needs. Results: Our results detail how the elicited needs are dealt with by designers, users and/or project leaders: (1) we show a strong contribution of users in the design, compared to others stakeholders, (2) among the needs elicited by users, most have been validated by the designers, (3) some elicited needs could have been firstly rejected and finally validated and implemented. Conclusion: We identify the reasons which justify and explain our results confronting them to the literature. We underline the conditions have been satisfied in our study in order to involve effectively users in the design of emerging technologies. (C) 2014 Elsevier B.V. All rights reserved.", "paper_title": "Needs' elaboration between users, designers and project leaders: Analysis of a design process of a virtual reality-based software", "paper_id": "WOS:000337261800013"}