{"auto_keywords": [{"score": 0.04410293038185961, "phrase": "perceived_interactivity"}, {"score": 0.00481495049065317, "phrase": "cognitive-affective_user_responses"}, {"score": 0.0045543011700929096, "phrase": "online_users"}, {"score": 0.00440093312826378, "phrase": "different_web-poll_interfaces"}, {"score": 0.003837205620832367, "phrase": "cognitive-affective_element"}, {"score": 0.0037398106866046972, "phrase": "affective_element"}, {"score": 0.003432604816716035, "phrase": "user_control"}, {"score": 0.0034033029171804106, "phrase": "user_connectedness"}, {"score": 0.003316884515934182, "phrase": "web-poll_application"}, {"score": 0.002904040426340639, "phrase": "user_behavioral_intentions"}, {"score": 0.0027114323601885666, "phrase": "qualitative_comments"}, {"score": 0.0026538960171433985, "phrase": "additional_insights"}, {"score": 0.0026199603775129516, "phrase": "five_web-poll_treatments"}, {"score": 0.0022936610196951962, "phrase": "theoretical_advancements"}, {"score": 0.0022257833099336858, "phrase": "web_designers"}, {"score": 0.0022067604433257814, "phrase": "online_marketers"}, {"score": 0.0021599099979586946, "phrase": "interactive_online_web_applications"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Perceived interactivity", " e-loyalty", " Web-poll design"], "paper_abstract": "Novel applications of website interactivity are important to attract and retain online users. In this empirical study five designs for interactivity are examined using different web-poll interfaces. The goal of the investigation is to examine perceived interactivity in a model which includes most commonly tested cognitive elements such as efficiency and effectiveness, but augments this model with the inclusion of a cognitive-affective element for trust, and an affective element of enjoyment. More specifically, a model is created to validate the relationship of perceived interactivity (comprised of user control, user connectedness, and responsiveness of the web-poll application) to efficiency, effectiveness, trust and enjoyment, of the website. In turn, efficiency, effectiveness, trust, and enjoyment are tested for their influence on user behavioral intentions for e-loyalty. All relationships in the model are supported. In addition, exploratory evaluation of qualitative comments is conducted to investigate additional insights between the five web-poll treatments in this investigation. The research confirms the complexity of a model in which cognitive, cognitive-affective and affective elements are present, and advances knowledge on the consequences of perceived interactivity. In additional to theoretical advancements, the research has merit for web designers and online marketers regarding how to enhance interactive online web applications. (C) 2009 Elsevier Ltd. All rights reserved.", "paper_title": "Perceived interactivity leading to e-loyalty: Development of a model for cognitive-affective user responses", "paper_id": "WOS:000271354600003"}