{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "iterated_local_search"}, {"score": 0.004562362497952548, "phrase": "image_registration"}, {"score": 0.004284302478991387, "phrase": "image_processing"}, {"score": 0.004059438255358923, "phrase": "parameter_estimation_problem"}, {"score": 0.004005083535629333, "phrase": "combinatorial_optimization_problem"}, {"score": 0.0038810583785936505, "phrase": "image-specific_information"}, {"score": 0.0037104876694493815, "phrase": "heuristic_function"}, {"score": 0.0031277316566463978, "phrase": "latter_technique"}, {"score": 0.003085813569061001, "phrase": "simulated_annealing_approach"}, {"score": 0.0028330357751826934, "phrase": "search_scheme"}, {"score": 0.0027206133859493725, "phrase": "real_coded_genetic_algorithm"}, {"score": 0.0026362590493392785, "phrase": "experimental_study"}, {"score": 0.0022218413146898887, "phrase": "search_process"}, {"score": 0.0021049977753042253, "phrase": "algorithms_outer-inner_loops"}], "paper_keywords": ["image registration", " iterated local search", " multi start local search", " genetic algorithms", " metaheuristics", " iterative closest point"], "paper_abstract": "This contribution is devoted to the application of iterated local search to image registration, a very complex, real-world problem in the field of image processing. To do so, we first re-define this parameter estimation problem as a combinatorial optimization problem, then analyze the use of image-specific information to guide the search in the form of an heuristic function, and finally propose its solution by iterated local search. Our algorithm is tested by comparing its performance to that of two different baseline algorithms: iterative closest point, a well-known, image registration technique, a hybrid algorithm including the latter technique within a simulated annealing approach, a multi-start local search procedure, that allows us to check the influence of the search scheme considered in the problem solving, and a real coded genetic algorithm. Four different problem instances are tackled in the experimental study, resulting from two images and two transformations applied on them. Three parameter settings are analyzed in our approach in order to check three heuristic information scenarios where the heuristic is not used at all, is partially used or almost completely guides the search process, as well as two different number of iterations in the algorithms outer-inner loops.", "paper_title": "Image registration with iterated local search", "paper_id": "WOS:000235308100005"}