{"auto_keywords": [{"score": 0.04384687625411682, "phrase": "clark"}, {"score": 0.03270972559816493, "phrase": "first-order_network"}, {"score": 0.031905025331937203, "phrase": "second-order_network"}, {"score": 0.00481495049065317, "phrase": "n._block"}, {"score": 0.004794437032071519, "phrase": "o._flanagan"}, {"score": 0.004613746609145139, "phrase": "cambridge"}, {"score": 0.004574449773348889, "phrase": "mit_press"}, {"score": 0.004281419007850678, "phrase": "computational_mechanisms"}, {"score": 0.00417307350828343, "phrase": "karmiloff-smith's"}, {"score": 0.0037743802306714545, "phrase": "connectionist_network"}, {"score": 0.0036241912752875307, "phrase": "connectionist_networks"}, {"score": 0.0032707648829756603, "phrase": "causal_pathways"}, {"score": 0.002958021635132416, "phrase": "categorization_task"}, {"score": 0.0028402243529525423, "phrase": "first_case"}, {"score": 0.0027682483006210338, "phrase": "second_case"}, {"score": 0.002692325559491278, "phrase": "secondary_task"}, {"score": 0.002663680622904326, "phrase": "limited_form"}, {"score": 0.002612883563655357, "phrase": "second-order_network's_internal_representations"}, {"score": 0.0025740436877518817, "phrase": "first-order_network's_internal_states"}, {"score": 0.0025087961290544024, "phrase": "computational_mechanism"}, {"score": 0.0024874156497091994, "phrase": "mental_attitudes"}, {"score": 0.0024399717841513354, "phrase": "cognitive_system"}, {"score": 0.00220177373403577, "phrase": "agent's_attributing_value"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["consciousness", " representation", " higher-order thought", " neural networks"], "paper_abstract": "When one is conscious of something, one is also conscious that one is conscious. Higher-Order Thought Theory [Rosenthal, D. (1997). A theory of consciousness. In N. Block, O. Flanagan, & G. Guzeldere (Eds.), The nature of consciousness: Philosophical debates. Cambridge, MA: MIT Press] takes it that it is in virtue of the fact that one is conscious of being conscious, that one is conscious. Here, we ask what the computational mechanisms may be that implement this intuition. Our starting point is Clark and Karmiloff-Smith's [Clark, A., & Karmiloff-Smith, A. (1993). The cognizer's innards: A psychological and philosophical perspective on the development of thought. Mind and Language, 8, 487-519] point that knowledge acquired by a connectionist network always remains \"knowledge in the network rather than knowledge for the network\". That is, while connectionist networks may become exquisitely sensitive to regularities contained in their input-output environment, they never exhibit the ability to access and manipulate this knowledge as knowledge: The knowledge can only be expressed through performing the task upon which the network was trained; it remains forever embedded in the causal pathways that developed as a result of training. To address this issue, we present simulations in which two networks interact. The states of a first-order network trained to perform a simple categorization task become input to a second-order network trained either as an encoder or on another categorization task. Thus, the second-order network \"observes\" the states of the first-order network and has, in the first case, to reproduce these states on its output units, and in the second case, to use the states as cues in order to solve the secondary task. This implements a limited form of metarepresentation, to the extent that the second-order network's internal representations become re-representations of the first-order network's internal states. We conclude that this mechanism provides the beginnings of a computational mechanism to account for mental attitudes, that is, an understanding by a cognitive system of the manner in which its first-order knowledge is held (belief, hope, fear, etc.). Consciousness, in this light, thus involves knowledge of the geography of one own's internal representations - a geography that is itself learned over time as a result of an agent's attributing value to the various experiences it enjoys through interaction with itself, the world, and others. (c) 2007 Elsevier Ltd. All rights reserved.", "paper_title": "Consciousness and metarepresentation: A computational sketch", "paper_id": "WOS:000251570900011"}