{"auto_keywords": [{"score": 0.04811643643051334, "phrase": "system_administrators"}, {"score": 0.015539065939679771, "phrase": "visualization_techniques"}, {"score": 0.01053908437081008, "phrase": "network_traffic_monitoring"}, {"score": 0.010250850107217371, "phrase": "computer_networks"}, {"score": 0.00481495049065317, "phrase": "scalable_visualization_system"}, {"score": 0.0043367547691560175, "phrase": "monitoring_task"}, {"score": 0.0038116231917604054, "phrase": "global_rise"}, {"score": 0.0037719307016238998, "phrase": "available_network_bandwidth"}, {"score": 0.0036680857629458816, "phrase": "automated_tools"}, {"score": 0.003456777366713296, "phrase": "limited_support"}, {"score": 0.0033498651263935194, "phrase": "highly_skilled_operators"}, {"score": 0.0032919001003538758, "phrase": "research_teams"}, {"score": 0.0031458272260508637, "phrase": "network_traffic_data"}, {"score": 0.003080606033950419, "phrase": "original_approach"}, {"score": 0.0029852932802967224, "phrase": "large_amount"}, {"score": 0.0024807547991927137, "phrase": "resulting_tool"}, {"score": 0.0024377918036784336, "phrase": "network_traffic"}], "paper_keywords": ["visualization", " interactivity", " network", " monitoring", " security"], "paper_abstract": "With the multiplication of attacks against computer networks, system administrators are required to monitor carefully the traffic exchanged by the networks they manage. However, that monitoring task is increasingly laborious because of the augmentation of the amount of data to analyze. And that trend is going to intensify with the explosion of the number of devices connected to computer networks along with the global rise of the available network bandwidth. So system administrators now heavily rely on automated tools to assist them and simplify the analysis of the data. Yet, these tools provide limited support and, most of the time, require highly skilled operators. Recently, some research teams have started to study the application of visualization techniques to the analysis of network traffic data. We believe that this original approach can also allow system administrators to deal with the large amount of data they have to process. in this paper, we introduce a tool for network traffic monitoring using visualization techniques that we developed in order to assist the system administrators of our corporate network. We explain how we designed the tool and some of the choices we made regarding the visualization techniques to use. The resulting tool proposes two linked representations of the network traffic and activity, one in 2D and the other in 3D. As 2D and 3D visualization techniques have different assets, we resulted in combining them in our tool to take advantage of their complementarity. We finally tested our tool in order to evaluate the accuracy of our approach.", "paper_title": "Toward a scalable visualization system for network traffic monitoring", "paper_id": "WOS:000256860900010"}