{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "ratio_scales"}, {"score": 0.004760394308239882, "phrase": "arbitrary_units"}, {"score": 0.004271843728776305, "phrase": "ratio_scale"}, {"score": 0.003944112858235306, "phrase": "dimensionless_number"}, {"score": 0.0031754329320561317, "phrase": "inhomogeneous_objects"}, {"score": 0.002982203248352076, "phrase": "analytic_network_process"}, {"score": 0.002784755056588371, "phrase": "direct_measurement"}, {"score": 0.0027218799769229596, "phrase": "utility_approach"}, {"score": 0.0024842242921857705, "phrase": "judgment_process"}, {"score": 0.002386869729952315, "phrase": "numerical_outcomes"}, {"score": 0.0022672718785099666, "phrase": "conventional_methods"}, {"score": 0.0021049977753042253, "phrase": "informed_people"}], "paper_keywords": ["Intangibles", " measurement", " analytic hierarchy process", " forecasting"], "paper_abstract": "Tangibles have measurements generally on ratio scales with arbitrary units that are always interpreted by using judgments as to what particular purpose the measurements serve. How two measurements on a ratio scale are related with respect to dominance leads to forming their ratio which is a dimensionless number. The judgment of an expert can be used to estimate this ratio when the objects are homogeneous. The process of using judgments to make comparisons is then extended by clustering and using pivots to measure inhomogeneous objects or criteria. The paper shows the generality of the analytic network process (AHP) as a method of measurement comparing it with direct measurement and with the utility approach through an example. It is also shown with an application from economics that the judgment process can be sufficiently accurate to produce numerical outcomes that are close to what one obtains by conventional methods, thus serving to validate its use in the measurement of intangibles when informed people are involved.", "paper_title": "EXTENDING THE MEASUREMENT OF TANGIBLES TO INTANGIBLES", "paper_id": "WOS:000265208600002"}