{"auto_keywords": [{"score": 0.048929739366992464, "phrase": "intuitionistic_fuzzy_numbers"}, {"score": 0.04423467024884345, "phrase": "attribute_values"}, {"score": 0.03610310423475189, "phrase": "simple_additive_weighting_method"}, {"score": 0.00481495049065317, "phrase": "nonlinear_optimization_models_for_multiple_attribute_group"}, {"score": 0.004737579882204798, "phrase": "intuitionistic_fuzzy_information"}, {"score": 0.004298666679374568, "phrase": "group_decision-making_problems"}, {"score": 0.003964007795174772, "phrase": "membership_degree"}, {"score": 0.003916098498242888, "phrase": "nonmembership_degree"}, {"score": 0.00386876598761639, "phrase": "hesitancy_degree"}, {"score": 0.003806541299696042, "phrase": "weight_information"}, {"score": 0.0035965032173588753, "phrase": "different_types"}, {"score": 0.0034817084307034955, "phrase": "interattribute_comparisons"}, {"score": 0.003158776195052182, "phrase": "individual_opinion"}, {"score": 0.002984373546099842, "phrase": "individual_opinions"}, {"score": 0.0027295084882654917, "phrase": "group_consensus"}, {"score": 0.002674681176379472, "phrase": "nonlinear_optimization_model"}, {"score": 0.0023970487263732737, "phrase": "accuracy_function"}, {"score": 0.0022371907579775796, "phrase": "intuitionistic_fuzzy_situations"}, {"score": 0.00218334762335187, "phrase": "developed_models"}, {"score": 0.0021569129153653777, "phrase": "air-condition_system_selection_problem"}, {"score": 0.0021049977753042253, "phrase": "wiley_periodicals"}], "paper_keywords": [""], "paper_abstract": "Intuitionistic fuzzy numbers are very useful for experts to depict in depth their fuzzy preference information over objects. In this work, we investigate multiple attribute group decision-making problems in which the attribute values provided by experts are expressed in intuitionistic fuzzy numbers, each of which is composed of a membership degree, a nonmembership degree and a hesitancy degree, and the weight information about both the experts and the attributes is to be determined. We first make different types of attribute values uniform so as to facilitate interattribute comparisons and employ the simple additive weighting method to fuse all the individual opinions into the group one. We then develop two nonlinear optimization models, one minimizing the divergence between each individual opinion and the group one, and the other minimizing the divergence among the individual opinions, from which two exact formulae can be obtained to derive the weights of experts. Similarly, from the viewpoint of maximizing group consensus, we establish a nonlinear optimization model based on all the individual intuitionistic fuzzy decision matrices to determine the weights of attributes. The simple additive weighting method is used to aggregate all the intuitionistic fuzzy attribute values corresponding to each alternative, and then the score function and the accuracy function are employed to rank and select the given alternatives. Moreover, we extend all the above results to interval intuitionistic fuzzy situations, and finally apply the developed models to an air-condition system selection problem. (C) 2010 Wiley Periodicals, Inc.", "paper_title": "Nonlinear Optimization Models for Multiple Attribute Group Decision Making with Intuitionistic Fuzzy Information", "paper_id": "WOS:000277550100001"}