{"auto_keywords": [{"score": 0.035861129654360134, "phrase": "reciprocal_preference_relations"}, {"score": 0.00481495049065317, "phrase": "common_criticism"}, {"score": 0.004748556604045108, "phrase": "simple_majority_voting_rule"}, {"score": 0.00465067040500426, "phrase": "slight_support"}, {"score": 0.004249188865832993, "phrase": "distinct_majority_rules"}, {"score": 0.0028000270988465486, "phrase": "necessary_and_sufficient_conditions"}, {"score": 0.002742196991950893, "phrase": "transitive_collective_decisions"}, {"score": 0.0025225467103906314, "phrase": "individual_reciprocal_preference_relations"}, {"score": 0.0023529740798601015, "phrase": "individual_rationality_assumptions"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Reciprocal preference relations", " Voting systems", " Majorities based on difference in support", " Transitivity"], "paper_abstract": "A common criticism to simple majority voting rule is the slight support that such rule demands to declare an alternative as a winner. Among the distinct majority rules used for diminishing this handicap, we focus on majorities based on difference in support. With these majorities, voters are allowed to show intensities of preference among alternatives through reciprocal preference relations. These majorities also take into account the difference in support between alternatives in order to select the winner. In this paper we have provided some necessary and sufficient conditions for ensuring transitive collective decisions generated by majorities based on difference in support for all the profiles of individual reciprocal preference relations. These conditions involve both the thresholds of support and some individual rationality assumptions that are related to transitivity in the framework of reciprocal preference relations. (C) 2012 Elsevier B.V. All rights reserved.", "paper_title": "Collective transitivity in majorities based on difference in support", "paper_id": "WOS:000316594500002"}