{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "search_engines_results"}, {"score": 0.004767451673469903, "phrase": "user_intervention"}, {"score": 0.004704844560325455, "phrase": "modern_search_engines"}, {"score": 0.004643055780443262, "phrase": "users'_queries"}, {"score": 0.0045820747375409435, "phrase": "top_results"}, {"score": 0.004317378385832431, "phrase": "considerable_efforts"}, {"score": 0.004260656420599919, "phrase": "search_engines"}, {"score": 0.004122077038067119, "phrase": "query_results"}, {"score": 0.0039096275435779124, "phrase": "search_engine"}, {"score": 0.0032591491777773035, "phrase": "semantic_entities"}, {"score": 0.0031845067058084583, "phrase": "semantic_relation"}, {"score": 0.0031426214970263137, "phrase": "text_coverage"}, {"score": 0.003091036449708673, "phrase": "main_tool"}, {"score": 0.003050376875258722, "phrase": "optimized_ranking"}, {"score": 0.002912222095383313, "phrase": "new_meta_search_application"}, {"score": 0.002789528662623221, "phrase": "google_results"}, {"score": 0.002671990515821213, "phrase": "user_clicks"}, {"score": 0.002256677005409071, "phrase": "web_application"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Search engines", " Post-ranking", " Semantic matching", " Personalization Relevant feedback", " Dynamic refinement"], "paper_abstract": "Nowadays, modern search engines quite satisfactorily answer users' queries, but the top results returned are not always relevant to the data the user is actually looking for. Hence, considerable efforts are made by search engines in order to rank the most relevant to the query results at the top. This work addresses the above problem and improves the performance of a search engine, especially when it comes to queries which have for example twofold meanings. The matter which the user is interested in is identified based on the results that he/she chooses, and then the most relevant ones are ranked higher. In addition, the results are recognized not only as text but also as semantic entities, which contain various semantic features. The semantic relation between results and text coverage are used as the main tool to achieve an optimized ranking, as opposed to other research papers so far. As a result, a new meta search application is developed, which, given a set of terms, combines Google results and then reorganizes (re-ranks) them based on the disambiguation offered by user clicks. In particular, after a ranking is achieved, the user makes a choice (click), the ranking is updated and the process is repeated. In order to prove our claims, apart from the description of the algorithm for refining the ranking of results, a web application has been developed, which was used to test the effectiveness of the system proposed. (c) 2012 Elsevier Inc. All rights reserved.", "paper_title": "Dynamic refinement of search engines results utilizing the user intervention", "paper_id": "WOS:000304722300010"}