{"auto_keywords": [{"score": 0.04933401710855325, "phrase": "multiple_social_networks"}, {"score": 0.04599637796965514, "phrase": "exact-_and_near-duplicate_media_items"}, {"score": 0.00481495049065317, "phrase": "media_items"}, {"score": 0.003926359151817743, "phrase": "entirely_ad_hoc_manner"}, {"score": 0.003610929883213109, "phrase": "event-related_media_items"}, {"score": 0.0033910448175165004, "phrase": "attended_events"}, {"score": 0.0029284999172756103, "phrase": "media_galleries"}, {"score": 0.002750056254309311, "phrase": "social-network-specific_reasons"}, {"score": 0.002678944072162297, "phrase": "near-duplicate_media_items"}, {"score": 0.0023254633298356894, "phrase": "algorithm's_strengths"}, {"score": 0.002218299213266519, "phrase": "state-of-the-art_feature_detection_algorithms_sift"}, {"score": 0.002195162631018237, "phrase": "asift"}, {"score": 0.002172285273673156, "phrase": "surf"}], "paper_keywords": ["clustering", " deduplication", " social networks", " media items", " event summarization", " media galleries"], "paper_abstract": "We have created and evaluated an algorithm capable of deduplicating and clustering exact- and near-duplicate media items of type photo and video that get shared on multiple social networks in the context of events. This algorithm works in an entirely ad hoc manner without requiring any pre-calculation. When people attend events, they more and more share event-related media items publicly on social networks to let their social network contacts relive and witness the attended events. In the past, we have worked on methods to accumulate such public user-generated multimedia content in order to summarize events visually, for example, in the form of media galleries or slideshows. In this paper, first, we introduce social-network-specific reasons and challenges that cause near-duplicate media items. Second, we detail an algorithm for the task of deduplicating and clustering exact- and near-duplicate media items stemming from multiple social networks. Finally, we evaluate the algorithm's strengths and weaknesses and thoroughly compare its performance with the state-of-the-art feature detection algorithms SIFT, ASIFT and SURF and show that for the given use case it performs almost equally well accuracy-wise, but strongly outperforms speed-wise.", "paper_title": "Clustering Media Items Stemming from Multiple Social Networks", "paper_id": "WOS:000361469800002"}