{"auto_keywords": [{"score": 0.04878455414226702, "phrase": "video_storyboard"}, {"score": 0.015538136317658486, "phrase": "case_study"}, {"score": 0.015418231335134047, "phrase": "snooker_video_visualization"}, {"score": 0.00481495049065317, "phrase": "video_storyboards"}, {"score": 0.004558091785667046, "phrase": "video_visualization"}, {"score": 0.004487241576747549, "phrase": "major_events"}, {"score": 0.0044002186469797476, "phrase": "illustrative_visualization"}, {"score": 0.0038969619124903884, "phrase": "significant_amount"}, {"score": 0.0038665369393234713, "phrase": "application-specific_semantics"}, {"score": 0.0033840673522948592, "phrase": "hierarchical_event_representation"}, {"score": 0.0029966788947444535, "phrase": "whole_video"}, {"score": 0.0029500270981001058, "phrase": "individual_illustration"}, {"score": 0.0028143720888311537, "phrase": "smaller_time_window"}, {"score": 0.002472552537325604, "phrase": "concrete_and_agreeable_set"}, {"score": 0.0023680783509308525, "phrase": "existing_techniques"}, {"score": 0.002349561762300369, "phrase": "event_detection"}, {"score": 0.0023038997972591193, "phrase": "reliable_manner"}], "paper_keywords": ["Multimedia visualization", " Time series data", " Illustrative visualization"], "paper_abstract": "Video storyboard, which is a form of video visualization, summarizes the major events in a video using illustrative visualization. There are three main technical challenges in creating a video storyboard, (a) event classification, (b) event selection and (c) event illustration. Among these challenges, (a) is highly application-dependent and requires a significant amount of application-specific semantics to be encoded in a system or manually specified by users. This paper focuses on challenges (b) and (c). In particular, we present a framework for hierarchical event representation, and an importance-based selection algorithm for supporting the creation of a video storyboard from a video. We consider the storyboard to be an event summarization for the whole video, whilst each individual illustration on the board is also an event summarization but for a smaller time window. We utilized a 3D visualization template for depicting and annotating events in illustrations. To demonstrate the concepts and algorithms developed, we use Snooker video visualization as a case study, because it has a concrete and agreeable set of semantic definitions for events and can make use of existing techniques of event detection and 3D reconstruction in a reliable manner. Nevertheless, most of our concepts and algorithms developed for challenges (b) and (c) can be applied to other application areas.", "paper_title": "Hierarchical Event Selection for Video Storyboards with a Case Study on Snooker Video Visualization", "paper_id": "WOS:000296241900003"}