{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "brain_dynamics"}, {"score": 0.03279538488952694, "phrase": "seizure_frequency"}, {"score": 0.013883262708757713, "phrase": "deep_brain_stimulation"}, {"score": 0.010273892489424678, "phrase": "significant_reduction"}, {"score": 0.0047152877145889656, "phrase": "epileptic_seizures"}, {"score": 0.004180809918117248, "phrase": "centromedial_thalamic_nuclei"}, {"score": 0.004137288854115515, "phrase": "epileptic_rats"}, {"score": 0.004030449969901066, "phrase": "periodic_stimulation"}, {"score": 0.00396767023935381, "phrase": "identical_stimulation_parameters"}, {"score": 0.002897977113538355, "phrase": "significant_improvement"}, {"score": 0.002808298910480358, "phrase": "periodic_control_scheme"}, {"score": 0.002387214876538434, "phrase": "successful_seizure_control"}, {"score": 0.002241679436497571, "phrase": "initial_evidence"}, {"score": 0.002183684303511462, "phrase": "closed-loop_feedback_control_systems"}, {"score": 0.0021049977753042253, "phrase": "seizure_prediction"}], "paper_keywords": ["Seizure", " prediction", " deep brain stimulation", " nonlinear, control"], "paper_abstract": "We have designed and implemented an automated, just-in-time stimulation, seizure control method using a seizure prediction method from nonlinear dynamics coupled with deep brain stimulation in the centromedial thalamic nuclei in epileptic rats. A comparison to periodic stimulation, with identical stimulation parameters, was also performed. The two schemes were compared in terms of their efficacy in control of seizures, as well as their effect on synchronization of brain dynamics. The automated just-in-time (JIT) stimulation showed reduction of seizure frequency and duration in 5 of the 6 rats, with significant reduction of seizure frequency (>50%) in 33% of the rats. This constituted a significant improvement over the efficacy of the periodic control scheme in the same animals. Actually, periodicstimulation showed an increase of seizure frequency in 50% of the rats, reduction of seizure frequency in 3 rats and significant reduction in 1 rat. Importantly, successful seizure control was highly correlated with desynchronization of brain dynamics. This study provides initial evidence for the use of closed-loop feedback control systems in epileptic seizures combining methods from seizure prediction and deep brain stimulation.", "paper_title": "CONTROL OF SYNCHRONIZATION OF BRAIN DYNAMICS LEADS TO CONTROL OF EPILEPTIC SEIZURES IN RODENTS", "paper_id": "WOS:000267701800005"}