{"auto_keywords": [{"score": 0.04914293238940666, "phrase": "postural_sway"}, {"score": 0.04236786578702065, "phrase": "still_images"}, {"score": 0.02669776137209096, "phrase": "motion_images"}, {"score": 0.011417686938007644, "phrase": "vims"}, {"score": 0.006152825305245757, "phrase": "sway_path_length"}, {"score": 0.00481495049065317, "phrase": "motion_sickness_symptoms"}, {"score": 0.0044933373574179624, "phrase": "increased_postural_sway"}, {"score": 0.0044199701363984495, "phrase": "visually_induced_motion_sickness"}, {"score": 0.0038743931383378558, "phrase": "separate_sessions"}, {"score": 0.0037985575652591985, "phrase": "video_clips"}, {"score": 0.003748823861741978, "phrase": "first_person_shooter_game"}, {"score": 0.003373616465890001, "phrase": "standard_deviation"}, {"score": 0.003147972261878234, "phrase": "vims_scores"}, {"score": 0.0028514769721161063, "phrase": "anteroposterior_direction"}, {"score": 0.002795607293713107, "phrase": "mediolateral_and_anteroposterior_direction"}, {"score": 0.002660662813907647, "phrase": "experiment_motion-"}, {"score": 0.0026171408377811687, "phrase": "different_levels"}, {"score": 0.002574328937802055, "phrase": "comparable_increases"}, {"score": 0.0024662589776071864, "phrase": "visual_and_vestibular_motion_cues"}, {"score": 0.002354932118789557, "phrase": "visual_effects"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Visually induced motion sickness", " Postural sway", " Detrended fluctuation analysis", " Motion images", " Sensory conflict", " Vection"], "paper_abstract": "Objective: It is generally assumed that motion in motion images is responsible for increased postural sway as well as for visually induced motion sickness (VIMS). However, this has not yet been tested. To that end, we studied postural sway and VIMS induced by motion and still images. Method: 15 Participants were exposed to motion- and still images in separate sessions. Motion images consisted of video clips taken from a first person shooter game. Still images consisted of stills taken every 10 s from these same clips. Before, during, and after exposure, VIMS was rated and postural sway was measured. Sway path length, standard deviation and short- and long-term scaling components of the centre of pressure were calculated as measures of postural sway. Results: VIMS scores obtained during and after exposure to motion images were significantly higher compared to scores obtained before, and directly after exposure to still images. The sway path length, standard deviation in anteroposterior direction and short-term scaling components in mediolateral and anteroposterior direction increased significantly during exposure to motion and still images. Conclusion: In this experiment motion- and still images caused different levels of VIMS, but comparable increases in postural sway. We assume VIMS was caused by a mismatch between visual and vestibular motion cues. The increase in sway during exposure to still images can be explained by visual effects present in still images. The lack of vection in the motion images may explain why sway was not larger when viewing these motion images as compared to viewing the still images. (C) 2015 Elsevier B.V. All rights reserved.", "paper_title": "Motion in images is essential to cause motion sickness symptoms, but not to increase postural sway", "paper_id": "WOS:000356208900008"}