{"auto_keywords": [{"score": 0.044852578701491924, "phrase": "digital_archive"}, {"score": 0.010254070005127684, "phrase": "subject_access"}, {"score": 0.009711073028201825, "phrase": "networked_information_production"}, {"score": 0.008438640646197518, "phrase": "subject_scheme"}, {"score": 0.004815055596927209, "phrase": "digital"}, {"score": 0.0047735489327932114, "phrase": "information_production"}, {"score": 0.004340867148018378, "phrase": "different_stages"}, {"score": 0.004217630522974106, "phrase": "different_actors"}, {"score": 0.004016072233242585, "phrase": "electronic_artwork_rider"}, {"score": 0.0037694092144768174, "phrase": "consistent_yet_relevant_access"}, {"score": 0.0034472469397869433, "phrase": "voluntary_exercise"}, {"score": 0.002817181909556205, "phrase": "subsequent_content_analysis"}, {"score": 0.002776844761182965, "phrase": "subject_language"}, {"score": 0.002682370021834353, "phrase": "particular_single_electronic_artwork"}, {"score": 0.0026211746739675927, "phrase": "illustrative_examples"}, {"score": 0.002531982746907987, "phrase": "prior_work"}, {"score": 0.002282166507956957, "phrase": "digital_archiving"}, {"score": 0.0021666388559669035, "phrase": "faceted_scheme"}, {"score": 0.0021171843749653477, "phrase": "electronic_artwork"}, {"score": 0.0021049977753042253, "phrase": "rider_spoke"}], "paper_keywords": ["Archives", " Classification schemes", " Electronic media", " Digital archives", " Information production", " Electronic arts", " Mixed reality", " Subject access"], "paper_abstract": "Purpose - This article aims to develop a framework that considers digital archiving as a form of networked information production, in which the different stages of producing a digital archive are modularized and distributed across different actors. The framework is applied and developed within the context of designing a digital archive for the electronic artwork Rider Spoke. More specifically the framework is applied and developed within the context of designing a subject scheme that provides its users with consistent yet relevant access to the content of the archive. Design/methodology/approach - A total of 74 postgraduate students from the Information School at the University of Sheffield were invited to tag four videos from the Riders Have Spoken archive as a voluntary exercise. Students were evenly distributed across the four videos and each participant was invited to generate up to ten tags; with each tag or annotation representing a point of interest in the content of the video for viewer. The time was also noted. In total, 46 students completed the exercise and this generated 356 user tags. As a collection these tags and annotations represent the terms and vocabulary on which a subsequent content analysis was conducted and a subject language developed. Findings - The development of a subject scheme for a particular single electronic artwork with seven facets, sub-facets, and illustrative examples is presented. The design of the scheme and its relations to prior work in classification is discussed. Research limitations/implications - Implications of the research for the design of a digital archive and the methods used to construct them are discussed Originality/value - The originality of the article lies in its characterization of digital archiving as a form of networked information production; and the application of the framework to the design of a faceted scheme enabling subject access to the digital archive of an electronic artwork called Rider Spoke.", "paper_title": "Digital archiving as information production Using experts and learners in the design of subject access", "paper_id": "WOS:000326315100003"}