{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "nonparametric_methods"}, {"score": 0.04964156968469261, "phrase": "nonlinear_mixed_effects_models"}, {"score": 0.004684157900507474, "phrase": "drug_development"}, {"score": 0.004494570360108983, "phrase": "drug's_pharmacokinetics"}, {"score": 0.004352411290383643, "phrase": "random_effects"}, {"score": 0.0042928648367867835, "phrase": "special_interest"}, {"score": 0.00410017409033388, "phrase": "drug's_kinetics"}, {"score": 0.003916098498242888, "phrase": "parametric_models"}, {"score": 0.0037402558657576124, "phrase": "normality_assumption"}, {"score": 0.003459191419478298, "phrase": "empirical_distribution"}, {"score": 0.003427540517249369, "phrase": "random_effects'_empirical_bayes_estimates"}, {"score": 0.0032287289440915187, "phrase": "iii_clinical_trials"}, {"score": 0.0030554300179552415, "phrase": "nonparametric_estimators"}, {"score": 0.0030135741897058844, "phrase": "random_effects_distribution"}, {"score": 0.0024956789310376635, "phrase": "usual_parametric_method"}, {"score": 0.0024501740852758505, "phrase": "statistical_and_computational_features"}, {"score": 0.002405496949144104, "phrase": "practical_performances"}, {"score": 0.002361632539339945, "phrase": "simulation_studies"}, {"score": 0.0023400004981080818, "phrase": "real_pharmacokinetic_analyses"}, {"score": 0.002194011800331242, "phrase": "simple_pharmacokinetic_model"}], "paper_keywords": [""], "paper_abstract": "During the drug development, nonlinear mixed effects models are routinely used to study the drug's pharmacokinetics and pharmacodynamics. The distribution of random effects is of special interest because it allows to describe the heterogeneity of the drug's kinetics or dynamics in the population of individuals studied. Parametric models are widely used, but they rely on a normality assumption which may be too restrictive. In practice, this assumption is often checked using the empirical distribution of random effects' empirical Bayes estimates. Unfortunately, when data are sparse ( like in patients phase III clinical trials), this method is unreliable. In this context, nonparametric estimators of the random effects distribution are attractive. Several nonparametric methods ( estimators and their associated computation algorithms) have been proposed but their use is limited. Indeed, their practical and theoretical properties are unclear and they have a reputation for being computationally expensive. Four nonparametric methods in comparison with the usual parametric method are evaluated. Statistical and computational features are reviewed and practical performances are compared in simulation studies mimicking real pharmacokinetic analyses. The nonparametric methods seemed very useful when data are sparse. On a simple pharmacokinetic model, all the nonparametric methods performed roughly equivalently. On a more challenging pharmacokinetic model, differences between the methods were clearer. (C) 2008 Elsevier B. V. All rights reserved.", "paper_title": "Comparison of nonparametric methods in nonlinear mixed effects models", "paper_id": "WOS:000263837100008"}