{"auto_keywords": [{"score": 0.04856216099390577, "phrase": "new_approach"}, {"score": 0.043367051214551706, "phrase": "objective_function"}, {"score": 0.00481495049065317, "phrase": "pattern_recognition"}, {"score": 0.003584025547693836, "phrase": "credibility_concept"}, {"score": 0.0027102997281261733, "phrase": "credibility_degrees"}, {"score": 0.0025962029048520324, "phrase": "different_sources"}, {"score": 0.0025003054002226944, "phrase": "new_validity_index"}, {"score": 0.002382182688788248, "phrase": "proposed_approach"}, {"score": 0.002306543826130521, "phrase": "choquet_integrals"}, {"score": 0.0022213218042340735, "phrase": "paper_contributions"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Credibilistic clustering", " Interval type-2 fuzzy clustering", " Fuzzy integral", " Validity index", " Compactness", " Separation"], "paper_abstract": "This paper presents a new approach to interval type-2 fuzzy clustering. In order to consider compactness within the clusters and separation of them simultaneously, the objective function of this paper is designed such that it generates both degrees of membership and non-membership of each data in each cluster, and integrates them using credibility concept. Also, a new approach to separation of clusters is proposed and utilized in designing the objective function. In this approach, the borders of clusters and therefore their compactness contribute in attaining their separation. So, the separation of clusters is not assessed only by the distance of their centers. The credibility degrees are transformed to interval type-2 form to handle different sources of uncertainty. Finally, a new validity index to characterize the number of clusters based on proposed approach to separation of clusters and Choquet integrals are proposed. The advantages of paper contributions are illustrated using several examples. (C) 2015 Elsevier Ltd. All rights reserved.", "paper_title": "Interval type-2 credibilistic clustering for pattern recognition", "paper_id": "WOS:000359028900030"}