{"auto_keywords": [{"score": 0.043213838306217146, "phrase": "experimental_hydration_free_energies"}, {"score": 0.015469842941326471, "phrase": "natural_and_unnatural_amino_acids"}, {"score": 0.013282921873763238, "phrase": "corresponding_side-chain_analogs"}, {"score": 0.004298666679374568, "phrase": "calculated_hydration_free_energies"}, {"score": 0.0038375280115736958, "phrase": "explicit_water_thermodynamic_integration_calculations"}, {"score": 0.0032629585038738856, "phrase": "expected_accuracy_levels"}, {"score": 0.0031845067058084583, "phrase": "charge_model"}, {"score": 0.002246292543825748, "phrase": "water_models"}, {"score": 0.0021049977753042253, "phrase": "natural_and_modified_amino_acids"}], "paper_keywords": ["Unnatural amino acids", " Water", " Thermodynamic integration", " AMBER ff03", " Hydration free energies", " Solvation"], "paper_abstract": "In this work, we assess calculated hydration free energies of natural and unnatural amino acids compared to experimental hydration free energies of corresponding side-chain analogs using the ff03 charge model. Fine-grid, explicit water thermodynamic integration calculations using two widely used explicit water models (TIP3P and TIP4P-Ew) were performed on 19 natural amino acids and compared with experimental hydration free energies of corresponding side-chain analogs to establish expected accuracy levels for this charge model. Next, parameters previously derived for 17 unnatural amino acids and several new parameters optimized in this work were assessed using the same methodology. We found that the ff03 charge model is correlated with experimental hydration free energies but underestimates the solubilities of several polar natural and unnatural amino acids. Comparisons are presented with other forcefields and water models recently presented in the literature for both natural and modified amino acids. (C) 2014 Elsevier Ltd. All rights reserved.", "paper_title": "Hydration free energies calculated using the AMBER ff03 charge model for natural and unnatural amino acids and multiple water models", "paper_id": "WOS:000346070100059"}