{"auto_keywords": [{"score": 0.048970045726729895, "phrase": "web_services"}, {"score": 0.011223404249869758, "phrase": "grid_systems"}, {"score": 0.004814962290280519, "phrase": "metamodel"}, {"score": 0.004648609688625397, "phrase": "distributed_communication"}, {"score": 0.004567596860086148, "phrase": "platform_independent_way"}, {"score": 0.003968112038249246, "phrase": "ws-policy_standard_family"}, {"score": 0.00304737045343781, "phrase": "different_products"}, {"score": 0.002890557197908352, "phrase": "platform_independent_metamodel"}, {"score": 0.00284009509859163, "phrase": "distributed_systems"}, {"score": 0.002646880721119838, "phrase": "full_metamodel"}, {"score": 0.002570296816631395, "phrase": "corresponding_programming_language"}, {"score": 0.002339771435910601, "phrase": "real-life_examples"}, {"score": 0.0022323643840655646, "phrase": "product_specific_configuration_files"}, {"score": 0.002142426911242168, "phrase": "directly_interoperable_applications"}, {"score": 0.0021049977753042253, "phrase": "different_soa_products"}], "paper_keywords": ["Web services", " WS-*standards", " WS-Policy", " Metamodeling"], "paper_abstract": "Web services provide distributed communication in a platform independent way. The WS-* standards define how middleware aspects (security, reliability, transactions, etc.) can be realized through web services. Although the WS-Policy standard family can be used to configure the various WS-* protocols, they are very hard to construct and to maintain manually. In addition, most SOA products and Grid systems implementing these standards provide their own methods for configuring these protocols, making it very difficult to match the various configuration options of different products. This fact inspired us to propose a platform independent metamodel for describing distributed systems of web services including the most important WS-* standards. The present article defines the full metamodel, it specifies the corresponding programming language formally, and it shows the productivity of the framework built around the metamodel through real-life examples. The framework is capable of generating product specific configuration files and source codes, resulting in directly interoperable applications even between different SOA products. The framework could also promote interoperability with Grid systems built on WS-* protocols.", "paper_title": "A Metamodel for the Web Services Standards", "paper_id": "WOS:000326838800007"}