{"auto_keywords": [{"score": 0.050078487022614894, "phrase": "capital_requirements"}, {"score": 0.035070781268736036, "phrase": "concentration_risk"}, {"score": 0.03157954267642417, "phrase": "sectorial_concentration"}, {"score": 0.030645413248418775, "phrase": "hhi"}, {"score": 0.004741265240837054, "phrase": "basel_ii"}, {"score": 0.004699664386595411, "phrase": "common_framework"}, {"score": 0.0045871258962202665, "phrase": "credit_risk"}, {"score": 0.0044970472468014505, "phrase": "asymptotic_single_risk_factor"}, {"score": 0.004144857881034622, "phrase": "bank_portfolios"}, {"score": 0.004072397146507847, "phrase": "single_debtor's_behaviour"}, {"score": 0.0040366412779632085, "phrase": "significant_impact"}, {"score": 0.004010029719693173, "phrase": "portfolio_value"}, {"score": 0.0038370302515998516, "phrase": "defaulting_borrowers"}, {"score": 0.0035441561977338346, "phrase": "model_estimates"}, {"score": 0.003513021953498657, "phrase": "cumulative_distribution_function"}, {"score": 0.0034898502600578495, "phrase": "gaussian_distribution"}, {"score": 0.0033911868693238894, "phrase": "asrf_model"}, {"score": 0.003376256617671467, "phrase": "actual_capital_requirements"}, {"score": 0.003118442540589662, "phrase": "supervisory_authorities"}, {"score": 0.003050376875258722, "phrase": "banking_solvency_rules"}, {"score": 0.0030303890409257845, "phrase": "spain"}, {"score": 0.003010250522930773, "phrase": "spanish_central_bank"}, {"score": 0.0029641011108505785, "phrase": "herfindahl-hirschman_index"}, {"score": 0.0028298427596685134, "phrase": "alternative_index"}, {"score": 0.0028175613881424155, "phrase": "ci"}, {"score": 0.002660218191146914, "phrase": "hhi_framework"}, {"score": 0.0026484975955468897, "phrase": "sectorial_relationship"}, {"score": 0.0025906626745331, "phrase": "adjusted_variance-covariance_matrix"}, {"score": 0.0025678829712650437, "phrase": "negative_covariances"}, {"score": 0.0024952197355510262, "phrase": "particular_case"}, {"score": 0.002408597721998433, "phrase": "proposed_index"}, {"score": 0.0022741894748181243, "phrase": "bank_risk_management_models"}, {"score": 0.0022492129111567824, "phrase": "bank_estimations"}, {"score": 0.002209818454703905, "phrase": "supervisory_model"}, {"score": 0.0021855473050107644, "phrase": "banking_rules"}, {"score": 0.002142527604899271, "phrase": "capital_surcharge"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Concentration risk", " Credit risk", " Concentration index", " Capital requirements"], "paper_abstract": "The 2004 Basel Committee on Banking Supervision Accord (known as Basel II) provides a common framework for banks to determine their minimum capital requirements for solvency purposes. For credit risk (the most important one for banking) Basel II uses an asymptotic single risk factor (ASRF) model and, as we demonstrate in the paper, assumes two fundamental hypotheses: Firstly, that there is only one risk factor common to all banks; and secondly, that the number of debtors in bank portfolios is high enough to ensure that no single debtor's behaviour can have a significant impact on the portfolio value as a whole. This allows capital requirements to be estimated by using a model based on the percentage of defaulting borrowers (x). The model only requires values for two variables: the probability of default and loss if default occurs. Using a 99% likelihood and assuming that all sectors are equally correlated, the model estimates x through the cumulative distribution function for the Gaussian distribution. But many bank portfolios do not fit these hypotheses, and therefore the ASRF model underestimates actual capital requirements. Thus, a surcharge for concentration risk is required. There are two kinds of concentration risk (sector and name concentration risk), each one corresponding to the violation of one of the above mentioned hypotheses. Supervisory authorities are currently developing models to incorporate this surcharge into banking solvency rules. In Spain, the Spanish Central Bank bases its surcharge proposal for sectorial concentration on the Herfindahl-Hirschman Index (HHI). In this paper we show that HHI treats all sectors as equally risky and propose an alternative index (CI) in which sectors are weighted according to risk. Moreover, our index also incorporates the relations between each pair of sectors (in the HHI framework no sectorial relationship is considered). Our proposal is based on an adjusted variance-covariance matrix, in which negative covariances have been equalled to 0. We demonstrate the HHI is a particular case of our proposed index, by means of simplifying hypotheses. As we will show, the proposed index has two fundamental properties: it is lower and upper bounded; and it decreases as concentration and/or risk decreases. These properties allow the index to be incorporated into bank risk management models. In this way bank estimations can improve upon those based on the supervisory model and, according to banking rules, can also be used for determining the capital surcharge for sectorial concentration. (C) 2010 Elsevier Ltd. All rights reserved.", "paper_title": "Sector concentration risk: A model for estimating capital requirements", "paper_id": "WOS:000293269200023"}