{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "online_auctions"}, {"score": 0.005053649487800692, "phrase": "density_reputation_measure"}, {"score": 0.004606479650820579, "phrase": "leading_branches"}, {"score": 0.004450568197899267, "phrase": "popular_and_powerful_retail_channel"}, {"score": 0.0041136473765874815, "phrase": "main_weapons"}, {"score": 0.003993958025223994, "phrase": "reputation_systems"}, {"score": 0.003916098498242888, "phrase": "popular_online_auction_sites"}, {"score": 0.0036553070575015344, "phrase": "organized_fraud"}, {"score": 0.0035141291835319682, "phrase": "new_reputation_measure"}, {"score": 0.0031845067058084613, "phrase": "online_auction_sellers"}, {"score": 0.0031223774204093713, "phrase": "indirect_information"}, {"score": 0.002899965889623787, "phrase": "unearned_reputation"}, {"score": 0.0027334673433027086, "phrase": "natural_clusters"}, {"score": 0.0026538282523433684, "phrase": "auction_data"}, {"score": 0.0025262061502713683, "phrase": "description_independent_recommendations"}, {"score": 0.0022777800735119405, "phrase": "trustworthy_sellers"}, {"score": 0.0021682027434117095, "phrase": "large_body"}, {"score": 0.0021049977753042253, "phrase": "leading_polish_provider"}], "paper_keywords": [""], "paper_abstract": "Online auctions are quickly becoming one of the leading branches of e-commerce. Unfortunately, this popular and powerful retail channel is exposed to various types of fraud, some of which are very sophisticated. The main weapons against scam in online auctions are reputation systems. Unfortunately, popular online auction sites use only simple reputation systems that are easy to deceive, thus offering users little protection against organized fraud. in this paper we present a new reputation measure that is both robust and resistant to fraud. Our measure is based on the notion of the density of online auction sellers. It uses indirect information about the performance of sellers, making it extremely difficult for fraudsters to gain unearned reputation. Furthermore, the design of the density reputation measure allows to unearth natural clusters of sellers appearing in the auction data. Based on these clusters, fully automated and description independent recommendations can be generated. Density reputation measure uses the topology of connections between sellers and buyers of online auctions to derive knowledge about trustworthy sellers. To evaluate our proposal we perform experiments on a large body of data acquired from a leading Polish provider of online auctions.", "paper_title": "Cluster-based analysis and recommendation of sellers in online auctions", "paper_id": "WOS:000252749100005"}