{"auto_keywords": [{"score": 0.04506785476449152, "phrase": "online_services"}, {"score": 0.03683519254224083, "phrase": "public_administrations"}, {"score": 0.00481495049065317, "phrase": "peer-to-peer_semantically-driven_environment"}, {"score": 0.0045318666714939905, "phrase": "modern_administration"}, {"score": 0.004360412703519539, "phrase": "comprehensive_portfolio"}, {"score": 0.004172360444377281, "phrase": "on-time_information"}, {"score": 0.003841263262252044, "phrase": "reasonable_level"}, {"score": 0.00327356326590461, "phrase": "target_user_base"}, {"score": 0.003030247482854539, "phrase": "service_providers"}, {"score": 0.002669042572650594, "phrase": "semantic-web_functionalities"}, {"score": 0.002175913488493802, "phrase": "scalable_and_cost-effective_solutions"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["P2P networks", " Semantics", " eGovernment", " Digital contents"], "paper_abstract": "Any modern administration must provide to the citizen a comprehensive portfolio of online services, together with updated and on-time information about them. However, the deployment of eAdministration or eGovernment services requires a reasonable level of availability and accessibility, as citizens have to perceive that online services indeed improve their relations with Public Administrations. This poses some challenges due to the size of the target user base, i.e. the entire population; and the wide variety of services, service providers, and associated documents. We discuss a proposal to easily locate, distribute and download documents generated by Public Administrations that integrates semantic-web functionalities for document discovery and classification, and peer-to-peer solutions to facilitate access and download. The combination of these technologies has several advantages in so far document distribution is concerned, and enables the development of scalable and cost-effective solutions. (c) 2012 Elsevier Ltd. All rights reserved.", "paper_title": "A peer-to-peer semantically-driven environment to distribute contents applied to the digital administration", "paper_id": "WOS:000308449300025"}