{"auto_keywords": [{"score": 0.049324540543845156, "phrase": "data_noise"}, {"score": 0.031380336937743794, "phrase": "systematic_deviations"}, {"score": 0.00481495049065317, "phrase": "multi-pinhole_spect_calibration"}, {"score": 0.004701556483912018, "phrase": "systematic_orbit_deviations"}, {"score": 0.004590820632326585, "phrase": "single_pinhole_spect_system"}, {"score": 0.004042635935882651, "phrase": "multi-pinhole_spect_system"}, {"score": 0.0033668870709083884, "phrase": "detector_heads"}, {"score": 0.003287482882222731, "phrase": "circular_orbit"}, {"score": 0.0032227404824789626, "phrase": "non-negligible_bias"}, {"score": 0.0031845067058084583, "phrase": "estimated_parameters"}, {"score": 0.0031342307827666675, "phrase": "reconstructed_image"}, {"score": 0.003097043800165555, "phrase": "analytical_linear_model"}, {"score": 0.0028487656293168795, "phrase": "image_quality"}, {"score": 0.0026518169452004465, "phrase": "reconstruction_error"}, {"score": 0.0024006068621542642, "phrase": "point_sources"}, {"score": 0.0022614266476954467, "phrase": "pinhole_apertures"}, {"score": 0.0022434880661725493, "phrase": "multi-pinhole_calibration"}, {"score": 0.002130298466581199, "phrase": "reconstruction_images"}, {"score": 0.0021049977753042253, "phrase": "jaszczak-type_phantom_scan"}], "paper_keywords": ["Calibration", " pinhole", " single photon emission computed tomography (SPECT)"], "paper_abstract": "The geometry of a single pinhole SPECT system with circular orbit can be uniquely determined from a measurement of three point sources, provided that at least two inter-point distances are known. In contrast, it has been shown mathematically that, for a multi-pinhole SPECT system with circular orbit, only two point sources are needed, and the knowledge of the distance between them is not required. In this paper, we report that this conclusion only holds if the motion of the camera is perfectly circular. In reality, the detector heads systematically slightly deviate from the circular orbit, which may introduce non-negligible bias in the estimated parameters and degrade the reconstructed image. An analytical linear model was extended to estimate the influence of both data noise and systematic deviations on the accuracy of the calibration and on the image quality of the reconstruction. It turns out that applying the knowledge of the distances greatly reduces the reconstruction error, especially in the presence of systematic deviations. In addition, we propose that instead of using the information about the distances between the point sources, it is more straightforward to use the knowledge about the distances between the pinhole apertures during multi-pinhole calibration. The two distance-fixing approaches yield similar reconstruction accuracy. Our theoretical results are supported by reconstruction images of a Jaszczak-type phantom scan.", "paper_title": "Multi-Pinhole SPECT Calibration: Influence of Data Noise and Systematic Orbit Deviations", "paper_id": "WOS:000295511400007"}