{"auto_keywords": [{"score": 0.047632785792958286, "phrase": "xcsf"}, {"score": 0.009622628852671287, "phrase": "classifier_weights"}, {"score": 0.00481495049065317, "phrase": "xcsf_classifier_system"}, {"score": 0.00418134346679498, "phrase": "input_range"}, {"score": 0.004032302251481604, "phrase": "theoretical_analysis"}, {"score": 0.0038573081851680656, "phrase": "broader_issue"}, {"score": 0.003734810936407523, "phrase": "mathematical_properties"}, {"score": 0.0036898803847106023, "phrase": "widrow-hoff_update"}, {"score": 0.003427608331646497, "phrase": "linear_least_squares"}, {"score": 0.003403801095792972, "phrase": "autocorrelation_matrix"}, {"score": 0.003269162006886173, "phrase": "major_consequence"}, {"score": 0.003229815147800001, "phrase": "system's_accuracy_pressure"}, {"score": 0.003040050100579337, "phrase": "constant_approximations"}, {"score": 0.0027150658583211746, "phrase": "generalization_capabilities"}, {"score": 0.002628747284714371, "phrase": "condition-based_normalization"}, {"score": 0.0024742098091226203, "phrase": "recursive_version"}, {"score": 0.0022914054720704546, "phrase": "least_squares"}, {"score": 0.0021049977753042253, "phrase": "polynomial_approximations"}], "paper_keywords": ["learning classifier systems", " computed prediction", " XCS"], "paper_abstract": "We analyze generalization in XCSF and introduce three improvements. We begin by showing that the types of generalizations evolved by XCSF can be influenced by the input range. To explain these results we present a theoretical analysis of the convergence of classifier weights in XCSF which highlights a broader issue. In XCSF, because of the mathematical properties of the Widrow-Hoff update, the convergence of classifier weights in a given subspace can be slow when the spread of the eigenvalues of the autocorrelation matrix associated with each classifier is large. As a major consequence, the system's accuracy pressure may act before classifier weights are adequately updated, so that XCSF may evolve piecewise constant approximations, instead of the intended, and more efficient, piecewise linear ones. We propose three different ways to update classifier weights in XCSF so as to increase the generalization capabilities of XCSF: one based on a condition-based normalization of the inputs, one based on linear least squares, and one based on the recursive version of linear least squares. Through a series of experiments we show that while all three approaches significantly improve XCSF, least squares approaches appear to be best performing and most robust. Finally we show how XCSF can be extended to include polynomial approximations.", "paper_title": "Generalization in the XCSF classifier system: Analysis, improvement, and extension", "paper_id": "WOS:000246897100002"}