{"auto_keywords": [{"score": 0.04485460355872508, "phrase": "sdl"}, {"score": 0.04380523908606129, "phrase": "kmc"}, {"score": 0.03828620693621281, "phrase": "taiwan"}, {"score": 0.014491409134982994, "phrase": "conceptual_structural_equation_model"}, {"score": 0.013358177477584271, "phrase": "op"}, {"score": 0.00481495049065317, "phrase": "organizational_performance"}, {"score": 0.004678384952779725, "phrase": "knowledge_management"}, {"score": 0.004326833704481825, "phrase": "self-directed_learning"}, {"score": 0.004238775572746022, "phrase": "organizational_learning"}, {"score": 0.003985166330358716, "phrase": "direct_and_indirect_effect"}, {"score": 0.0035956327252723483, "phrase": "collected_survey_data"}, {"score": 0.0034083145672246067, "phrase": "proposed_structural_equation_model"}, {"score": 0.003257432325797907, "phrase": "direct_and_significant_impact"}, {"score": 0.003204232566468624, "phrase": "kmc._sdl"}, {"score": 0.003113209068744678, "phrase": "kmc."}, {"score": 0.0030123335878664064, "phrase": "direct_and_significant_influences"}, {"score": 0.002629539710839523, "phrase": "managers'_reference"}, {"score": 0.002323826502178581, "phrase": "appropriate_sdl"}], "paper_keywords": ["Self-managed learning", " Workplace training", " Knowledge management", " Organizational performance"], "paper_abstract": "Purpose - The purpose of this paper is to propose a conceptual structural equation model to investigate the relationships among self-directed learning (SDL), organizational learning (OL), knowledge management capability (KMC) and organizational performance (OP) and to demonstrate the direct and indirect effect of SDL on OP from the perspectives of KMC and OL. Design/methodology/approach - An empirical study is conducted in 21 technological companies (N = 236) in Taiwan and the collected survey data are used to test the relationships among the four dimensions expressed in the proposed structural equation model. Findings - The results show that SDL has a direct and significant impact on OL and KMC. SDL influences OP indirectly through OL and KMC. In addition, OL and KMC have direct and significant influences on OP. Research limitations/implications - The source of data collected is Taiwan, hence, the results may not be easily generalized to other areas or countries. However, the findings are valuable for managers' reference, especially for those whose circumstances are similar to those in Taiwan. Practical implications - The conceptual structural equation model provides useful information for managers to enhance OP through the adoption of appropriate SDL, OL and KMC strategies. Originality/value - The study demonstrates how SDL indirectly impacts OP and illustrates the paths of influence through either OL or KMC.", "paper_title": "What affects organizational performance? The linking of learning and knowledge management", "paper_id": "WOS:000261792500006"}