{"auto_keywords": [{"score": 0.029552309858554726, "phrase": "knowledge_risk_management"}, {"score": 0.00481495049065317, "phrase": "organizational_networks"}, {"score": 0.004641351004344458, "phrase": "networked_environment"}, {"score": 0.004273196830970426, "phrase": "global_objectives"}, {"score": 0.004214729542986473, "phrase": "collaborative_innovation"}, {"score": 0.0033190180867511605, "phrase": "knowledge_sharing"}, {"score": 0.003213920601037463, "phrase": "conspicuous_absence"}, {"score": 0.0029586543333524904, "phrase": "exploratory_framework"}, {"score": 0.0029181203386806683, "phrase": "knowledge-sharing_risks"}, {"score": 0.0028127163745564777, "phrase": "structured_approach"}, {"score": 0.0027361626349903744, "phrase": "practice-based_approach"}, {"score": 0.0025420267431501367, "phrase": "knowledge_risks"}, {"score": 0.0023079225317714815, "phrase": "knowledge_risk_impacts"}], "paper_keywords": ["Organizational networks", " Knowledge", " Knowledge sharing", " Risk management", " Management frameworks", " Transaction cost economics"], "paper_abstract": "In a networked environment, it is essential for organizations to share knowledge among themselves if they want to achieve the global objectives such as collaborative innovation and increased effectiveness and efficiency of operations. However, sharing knowledge is not risk-free. An organization might lose its competitive edge if it shares too much or certain key knowledge. In addition, an organization might suffer if its intellectual property is improperly handled by its business partners. While the literature has touted the value of knowledge sharing within networks, there is a conspicuous absence of studies examining the risks of sharing knowledge. To address this gap, we develop an exploratory framework that categorizes knowledge-sharing risks across multiple dimensions. Such a framework is a structured approach to knowledge risk management and complements the practice-based approach to knowledge risk management that is presented in (Marabelli and Newell, this issue). Our framework outlines the various kinds of knowledge risks that organizations are facing. We use a combination of knowledge-based and transaction cost theories to show how knowledge risk impacts knowledge transfer among entities in the network, the whole network, and the risk mitigation options. (C) 2011 Elsevier B.V. All rights reserved.", "paper_title": "Knowledge risks in organizational networks: An exploratory framework", "paper_id": "WOS:000302926000001"}