{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "distributed_intrusion_detection_systems"}, {"score": 0.007697316650035437, "phrase": "distributed_detection_systems"}, {"score": 0.004575854901681043, "phrase": "information_sharing_model"}, {"score": 0.004448169552315403, "phrase": "typical_challenges"}, {"score": 0.003927203683176278, "phrase": "cumulative_sum_algorithm"}, {"score": 0.0037959868107895053, "phrase": "local_system"}, {"score": 0.0034279721355412285, "phrase": "lire"}, {"score": 0.003239114833599948, "phrase": "simple_but_robust_scheme"}, {"score": 0.0031308163228919773, "phrase": "local_statistics"}, {"score": 0.003009022147559257, "phrase": "learning_algorithm"}, {"score": 0.002763709443278514, "phrase": "detection_delay"}, {"score": 0.0025819015229390663, "phrase": "specific_distributed_intrusion_detection_scenario"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["distributed intrusion detection", " denial of service attack", " reflector attack", " information sharing", " anomaly detection"], "paper_abstract": "In this paper, we present an information sharing model for distributed intrusion detection systems. The typical challenges faced by distributed intrusion detection systems is what information to share and how to share information. We address these problems by using the Cumulative Sum algorithm to collect statistics at each local system, and use a machine learning approach to coordinate the information sharing among the distributed detection systems. Our major contributions Lire two-fold. First, we propose a simple but robust scheme to monitor changes in the local statistics. Second, we present a learning algorithm to decide when to share information so that both the communication overhead among the distributed detection systems and the detection delay are minimized. We demonstrate the application of our information sharing model to a specific distributed intrusion detection scenario. We show that our approach is able to optimize the trade-off between the time required to detect an attack, and the volume of communication between the distributed intrusion detection systems. (C) 2005 Published by Elsevier Ltd.", "paper_title": "Information sharing for distributed intrusion detection systems", "paper_id": "WOS:000247723300005"}