{"auto_keywords": [{"score": 0.02666664503291797, "phrase": "wbs_networks"}, {"score": 0.010612387000973441, "phrase": "waveband_switching"}, {"score": 0.010528904161239997, "phrase": "multigranular_optical_networks"}, {"score": 0.008078452567551195, "phrase": "wbs"}, {"score": 0.0043080553835735825, "phrase": "advanced_wdm"}, {"score": 0.004223299391912042, "phrase": "available_bandwidth"}, {"score": 0.004189863767755212, "phrase": "backbone_networks"}, {"score": 0.0037485269508155516, "phrase": "optical_cross"}, {"score": 0.003503497128638099, "phrase": "single_entity"}, {"score": 0.003313741359811683, "phrase": "port_count"}, {"score": 0.003222740482478965, "phrase": "j._opt"}, {"score": 0.0031972011104983954, "phrase": "netw"}, {"score": 0.002826181226538412, "phrase": "waveband_switching_networks"}, {"score": 0.0027704982687041147, "phrase": "traditional_wavelength_routing_networks"}, {"score": 0.002419798694301991, "phrase": "waveband_conversion"}, {"score": 0.0023532890136269986, "phrase": "reconfigurable_multigranular_optical_cross_connects"}, {"score": 0.0022886031992739126, "phrase": "waveband_grouping"}, {"score": 0.002270449532546444, "phrase": "wavelength_convertible_networks"}, {"score": 0.0021049977753042253, "phrase": "wavelength_conversion"}], "paper_keywords": [""], "paper_abstract": "We consider multigranular optical networks using waveband switching (WBS) technology. The use of advanced WDM has significantly increased the available bandwidth in backbone networks by increasing the number of wavelengths. As the number of wavelengths in a fiber is increased, the number of ports or the size of the optical cross connects increases rapidly. Using WBS, wavelengths are grouped into bands and switched as a single entity thus reducing the cost and control complexity of switching nodes by minimizing the port count. Part I of our study [J. Opt. Netw. 5, 1043 - 1055 ( 2006)] compared the various cross-connect architectures for WBS including the three-layer and single-layer multigranular cross connects. It also discussed various issues relating to waveband switching networks that are different from traditional wavelength routing networks (WRNs), for example, traffic grooming, and it showed why techniques developed for WRNs cannot be simply applied to WBS networks. We study the effect of wavelength and waveband conversion on the performance of WBS networks with reconfigurable multigranular optical cross connects. We present an algorithm for waveband grouping in wavelength convertible networks and evaluate its performance with full, limited, and intraband wavelength conversion. We then focus on survivability in WBS networks and show how waveband and wavelength conversion can be used effectively to recover from failures in WBS networks. (C) 2006 Optical Society of America.", "paper_title": "Framework for waveband switching in multigranular optical networks: part II - wavelength/waveband conversion and survivability [Invited]", "paper_id": "WOS:000243337300005"}