{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "similar_interests"}, {"score": 0.010042068153047062, "phrase": "person_representation_method"}, {"score": 0.008211836739334948, "phrase": "proposed_algorithm"}, {"score": 0.004510184935928004, "phrase": "limited_ways"}, {"score": 0.004224627834741731, "phrase": "current_methods"}, {"score": 0.0038640303886081444, "phrase": "new_approach"}, {"score": 0.002991524908432975, "phrase": "person's_website"}, {"score": 0.002852356597632014, "phrase": "matching_process"}, {"score": 0.0028185852354729026, "phrase": "person_representation"}, {"score": 0.002472412920623605, "phrase": "textual_content"}, {"score": 0.0024431289979171505, "phrase": "hyperlink_information"}, {"score": 0.002357337046408753, "phrase": "personal_website"}, {"score": 0.0021049977753042253, "phrase": "experimental_results"}], "paper_keywords": [""], "paper_abstract": "On the Web, there are limited ways of finding people sharing similar interests with a given person. The current methods are either ineffective or time consuming. In this paper, we present a new approach for searching people sharing similar interests from the Web. Given a person, to find similar people from the Web, there are two major research issues: person representation and matching persons. In this study, we propose a person representation method which uses a person's website to represent this person. Our design of matching process takes person representation into consideration to allow the same representation to be used when composing the query. Under this person representation method, the proposed algorithm integrates textual content and hyperlink information of all the pages belonging to a personal website to represent a person and match persons. Other algorithms are also explored and compared to the proposed algorithm. Experimental results are presented.", "paper_title": "People search: Searching people sharing similar interests from the Web", "paper_id": "WOS:000252423000011"}