{"auto_keywords": [{"score": 0.03746094921310433, "phrase": "kbdock"}, {"score": 0.004772367030970874, "phrase": "protein_domains"}, {"score": 0.004605748839642513, "phrase": "public_databases"}, {"score": 0.004270665568018583, "phrase": "general_rules"}, {"score": 0.004232875294230749, "phrase": "interaction_patterns"}, {"score": 0.004195418010131832, "phrase": "structural_protein-protein_interactions"}, {"score": 0.0040309035566691645, "phrase": "structural_interaction_patterns"}, {"score": 0.0038728151007982378, "phrase": "known_protein_interactome"}, {"score": 0.003754140294151593, "phrase": "docking-based_predictions"}, {"score": 0.0036715973701254823, "phrase": "unsolved_protein_complexes"}, {"score": 0.003449972561293443, "phrase": "spatially_clustering_protein_binding_sites"}, {"score": 0.0032129675521135616, "phrase": "pfam_protein_domain_family_classification"}, {"score": 0.003005539334280134, "phrase": "hetero_domain-domain_interactions"}, {"score": 0.002900426826591769, "phrase": "pfam_family"}, {"score": 0.0027131212233443137, "phrase": "domain_families"}, {"score": 0.0025950024597986366, "phrase": "template-based_docking"}, {"score": 0.0023845255359681143, "phrase": "direct_homology"}, {"score": 0.0023633857274905977, "phrase": "existing_domain_interfaces"}, {"score": 0.00233202607446404, "phrase": "key_binding_site_information"}, {"score": 0.0021620042653528846, "phrase": "useful_information"}, {"score": 0.0021049977753042253, "phrase": "unknown_protein_complexes"}], "paper_keywords": [""], "paper_abstract": "Motivation: In recent years, much structural information on protein domains and their pair-wise interactions has been made available in public databases. However, it is not yet clear how best to use this information to discover general rules or interaction patterns about structural protein-protein interactions. Improving our ability to detect and exploit structural interaction patterns will help to provide a better 3D picture of the known protein interactome, and will help to guide docking-based predictions of the 3D structures of unsolved protein complexes. Results: This article presents KBDOCK, a 3D database approach for spatially clustering protein binding sites and for performing template-based (knowledge-based) protein docking. KBDOCK combines residue contact information from the 3DID database with the Pfam protein domain family classification together with coordinate data from the Protein Data Bank. This allows the 3D configurations of all known hetero domain-domain interactions to be superposed and clustered for each Pfam family. We find that most Pfam domain families have up to four hetero binding sites, and over 60% of all domain families have just one hetero binding site. The utility of this approach for template-based docking is demonstrated using 73 complexes from the Protein Docking Benchmark. Overall, up to 45 out of 73 complexes may be modelled by direct homology to existing domain interfaces, and key binding site information is found for 24 of the 28 remaining complexes. These results show that KBDOCK can often provide useful information for predicting the structures of unknown protein complexes.", "paper_title": "Spatial clustering of protein binding sites for template based protein docking", "paper_id": "WOS:000295680600007"}