{"auto_keywords": [{"score": 0.048241894792168345, "phrase": "wireless_sensor_networks"}, {"score": 0.015270155357250511, "phrase": "dual-radio_wireless_sensor_networks"}, {"score": 0.012160445279871238, "phrase": "network_lifetime"}, {"score": 0.011528199241875753, "phrase": "virtual_backbones"}, {"score": 0.00481495049065317, "phrase": "virtual_backbone_scheduling"}, {"score": 0.004722758637537872, "phrase": "lifetime"}, {"score": 0.004474468584252318, "phrase": "environmental_conditions"}, {"score": 0.004017989546119125, "phrase": "long_time"}, {"score": 0.003901754272977278, "phrase": "major_challenge"}, {"score": 0.0034020946201397057, "phrase": "different_time_periods"}, {"score": 0.002743207784252161, "phrase": "np"}, {"score": 0.0025860636370864084, "phrase": "centralized_algorithm"}, {"score": 0.002321787726770895, "phrase": "wide_range"}, {"score": 0.0022216045996270996, "phrase": "new_one"}, {"score": 0.0021784745589727246, "phrase": "simulation_results"}, {"score": 0.0021361800485636823, "phrase": "proposed_algorithm"}, {"score": 0.0021049977753042253, "phrase": "existing_algorithms"}], "paper_keywords": [""], "paper_abstract": "Wireless sensor networks have often been used to monitor environmental conditions, such as temperature, sound, and pressure. Because the sensors are expected to work on batteries for a long time without charging their batteries, the major challenge in the design of wireless sensor networks is to enhance the network lifetime. Recently, many researchers have studied the problem of constructing virtual backbones, which are backbones used for different time periods, to prolong the network lifetime. In this paper, we study the problem of constructing virtual backbones in dual-radio wireless sensor networks to maximize the network lifetime, called the Maximum Lifetime Backbone Scheduling for Dual-Radio Wireless Sensor Network problem, where each sensor is equipped with two radio interfaces. The problem is shown to be NP-complete here. In addition, rather than proposing a centralized algorithm, a distributed algorithm, called a Dominating-Set-Based Algorithm (DSBA), is proposed for a wide range of wireless sensor networks to find a backbone when a new one is required. Simulation results show that the proposed algorithm outperforms some existing algorithms.", "paper_title": "An Efficient Algorithm of Constructing Virtual Backbone Scheduling for Maximizing the Lifetime of Dual-Radio Wireless Sensor Networks", "paper_id": "WOS:000364071300001"}