{"auto_keywords": [{"score": 0.004694092086199672, "phrase": "gene_expression_data_clustering"}, {"score": 0.004576253356889219, "phrase": "widespread_pattern_recognition_technique"}, {"score": 0.0037336520904376687, "phrase": "new_clustering_method"}, {"score": 0.003245900020944865, "phrase": "robust_and_accurate_similarity_measure"}, {"score": 0.0030847461428168614, "phrase": "developed_similarity_measure"}, {"score": 0.0028397103530211415, "phrase": "optimal_number"}, {"score": 0.0025646139644088803, "phrase": "proposed_approaches"}, {"score": 0.0024527767211457046, "phrase": "artificial_datasets"}, {"score": 0.002421726275597666, "phrase": "also_real_gene_expression_datasets"}, {"score": 0.0022722584151582616, "phrase": "proposed_approach"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["General type-2 fuzzy sets", " General type-2 fuzzy c-means", " Similarity measure", " Cluster validity index", " Gene expression clustering"], "paper_abstract": "As a widespread pattern recognition technique, clustering has been widely used in various disciplines including: science, engineering, medicine, etc. One the latest progresses in this field is introduction of general type-2 fuzzy sets and the new clustering method represented on its basis called general type-2 fuzzy c-means. In this paper, the aim is to develop a robust and accurate similarity measure between general type-2 fuzzy sets. Utilizing philosophy behind this developed similarity measure, the first exclusively developed general type-2 fuzzy cluster validity index will be proposed to be used for finding the optimal number of clusters through using general type-2 fuzzy c-means. To verify quality of the proposed approaches, several heavy computations have been conducted on artificial datasets and also real gene expression datasets. Numerical comparisons reveal robustness and quality of the proposed approach compared to several similar approaches in the literature. (C) 2014 Elsevier B.V. All rights reserved.", "paper_title": "A new cluster validity measure based on general type-2 fuzzy sets: Application in gene expression data clustering", "paper_id": "WOS:000337555100008"}