{"auto_keywords": [{"score": 0.039791619450959166, "phrase": "welding_distortion"}, {"score": 0.039439392117362825, "phrase": "non-nominal_components"}, {"score": 0.03862911967721914, "phrase": "welding_process"}, {"score": 0.0348119091134936, "phrase": "variation_simulation"}, {"score": 0.03460512484726119, "phrase": "welding_simulation"}, {"score": 0.00481495049065317, "phrase": "welding_simulation_of_non-nominal_structures"}, {"score": 0.0047270350800814286, "phrase": "industrial_assembly_process"}, {"score": 0.004528062940497773, "phrase": "manufacturing_process"}, {"score": 0.004486522962052524, "phrase": "component_variation"}, {"score": 0.004404577716425371, "phrase": "fixture_variation"}, {"score": 0.004324122679561784, "phrase": "joining_process"}, {"score": 0.004258195773502909, "phrase": "final_product"}, {"score": 0.003919109076818856, "phrase": "final_variation"}, {"score": 0.0034762541706024755, "phrase": "weld-induced_distortion"}, {"score": 0.0033813554890743665, "phrase": "geometric_variation"}, {"score": 0.003319528548591761, "phrase": "weld_joints"}, {"score": 0.0031992346303888397, "phrase": "previous_research"}, {"score": 0.002971528026470718, "phrase": "rigid_bodies"}, {"score": 0.0029532983066856994, "phrase": "non-nominal_positions"}, {"score": 0.0023735785441690097, "phrase": "weld_joint"}, {"score": 0.0023301353812204607, "phrase": "stress_field"}, {"score": 0.0022456145616178346, "phrase": "additional_distortion"}, {"score": 0.0021842376228111537, "phrase": "t-weld_joint"}, {"score": 0.0021641529087429797, "phrase": "butt-weld_joint"}, {"score": 0.0021049977753042253, "phrase": "fixture_error"}], "paper_keywords": ["variation simulation", " welding simulation", " clamping"], "paper_abstract": "In any industrial assembly process, there are a number of sources of variation. Variation in the manufacturing process leads to component variation, which, together with fixture variation and variation stemming from the joining process, propagates to the final product. In order to analyze and diminish the effect of variation, it is important to identify and be able to simulate the phenomena contributing to final variation. In this paper, the focus is variation in welding distortion arising from non-nominal components that are joined. In the welding process, it has been shown that variation in components and in fixtures influences the size and distribution of weld-induced distortion. Hence, in order to accurately simulate geometric variation of an assembly joined by weld joints, variation simulation and welding simulation need to be performed in combination. Previous research that focused on the combination of variation simulation and welding simulation has not considered components that are clamped. Instead the components were treated as rigid bodies at non-nominal positions prior to welding. In many industrial applications, clamps are used when assemblies are welded, and it is therefore important to quantify the influence that clamping has on welding of non-nominal components. In this paper, we simulate the combination of variation in components and fixtures with welding, considering that the components are clamped prior to welding. Although clamps will force the components closer to their nominal positions along the weld joint, they also introduce a stress field in the structure, which together with the welding process may cause additional distortion. Two case studies are performed and analyzed: a T-weld joint and a butt-weld joint. The results show that welding distortion depends on fixture error even in the presence of clamps.", "paper_title": "Welding Simulation of Non-Nominal Structures With Clamps", "paper_id": "WOS:000352819000005"}