{"auto_keywords": [{"score": 0.049387839337984435, "phrase": "effective_atomic_descriptors"}, {"score": 0.01475510885196895, "phrase": "empirical_model"}, {"score": 0.01168075123045122, "phrase": "aliphatic_hydroxylation"}, {"score": 0.011120806047705385, "phrase": "aromatic_hydroxylation"}, {"score": 0.00481495049065317, "phrase": "activation_energy_prediction_of"}, {"score": 0.00464976086880886, "phrase": "drug_design"}, {"score": 0.004438250823243621, "phrase": "activation_energies"}, {"score": 0.004162978902905443, "phrase": "metabolism_reactions"}, {"score": 0.003630551710200058, "phrase": "diverse_chemical_structures"}, {"score": 0.0032786537599187125, "phrase": "empirical_equations"}, {"score": 0.0032596049901888724, "phrase": "quantitative_structure_activity_relationship"}, {"score": 0.003175241510860455, "phrase": "effective_atomic_charge"}, {"score": 0.0029349892964423197, "phrase": "correlation_coefficient"}, {"score": 0.0028757179268195255, "phrase": "rmse."}, {"score": 0.0026503306888150426, "phrase": "physical_origin"}, {"score": 0.002414241727802253, "phrase": "experimental_parameters"}, {"score": 0.0024002030430771044, "phrase": "time-consuming_qm_calculation"}, {"score": 0.002224942603922241, "phrase": "early_stage_pk_predictions"}, {"score": 0.002212002242551553, "phrase": "rational_drug_design"}, {"score": 0.0021359219875300957, "phrase": "e-a_prediction_model"}, {"score": 0.0021049977753042253, "phrase": "chemical_reactions"}], "paper_keywords": [""], "paper_abstract": "In an effort to improve drug design and predictions for pharmacokinetics (PK), an empirical model was developed to predict the activation energies (E-a) of cytochrome P450 (CYP450) mediated metabolism. The model, E(a)MEAD (Activation energy of Metabolism reactions with Effective Atomic Descriptors), predicts the E-a of four major metabolic reactions of the CYP450 enzyme: aliphatic hydroxylation, N-dealkylation, O-dealkylation, and aromatic hydroxylation. To build and validate the empirical model, the E-a values of the substrates with diverse chemical structures (394 metabolic sites for aliphatic hydroxylation, 27 metabolic sites for N-dealkylation, 9 metabolic sites for O-dealkylation, and 85 metabolic sites for aromatic hydroxylation) were calculated by AM1 molecular orbital (MO). Empirical equations, Quantitative Structure Activity Relationship (QSAR) models, were derived using effective atomic charge, effective atomic polarizability, and bond dipole moments of the substrates as descriptors. E(a)MEAD is shown to accurately predict E-a with a correlation coefficient (R) of 0.94 and root-mean-square error (RMSE. unit is kcal/mol) of 0.70 for aliphatic hydroxylation, N-dealkylation, and O-dealkylation, and R of 0.83 and RMSE of 0.80 for aromatic hydroxylation, respectively. Physical origin and the role of the effective atomic descriptors of the models are presented in detail. With this model, the E-a of the metabolism can be rapidly predicted without any experimental parameters or time-consuming QM calculation. Regioselectivity prediction with our model is presented in the case of CYP3A4 metabolism. The reliability and ease of use of this model will greatly facilitate early stage PK predictions and rational drug design. Moreover, the model can be applied to develop the E-a prediction model of various types of chemical reactions.", "paper_title": "E(a)MEAD: Activation Energy Prediction of Cytochrome P450 Mediated Metabolism with Effective Atomic Descriptors", "paper_id": "WOS:000268138900003"}