{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "structured_peer-to-peer_overlays"}, {"score": 0.015305436709209775, "phrase": "distributed_network_applications"}, {"score": 0.004636340567075841, "phrase": "mobile_ad_hoc_networks"}, {"score": 0.004586531354697466, "phrase": "structured_peer-to-peer_overlay_networks"}, {"score": 0.004206767038617782, "phrase": "large-scale_distributed_network_applications"}, {"score": 0.0037554497046697432, "phrase": "larger_and_more_complex_mobile_ad_hoc_networks"}, {"score": 0.0029602552900111407, "phrase": "conventional_internet-based_structured_peer-to-peer_overlays"}, {"score": 0.0026710653215026685, "phrase": "design_requirements"}, {"score": 0.002436289099444074, "phrase": "case_study"}, {"score": 0.0023970487263732737, "phrase": "structured_peer-to-peer_overlay"}, {"score": 0.002295463032589125, "phrase": "straight-forward_porting"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["DHTs", " MANETs", " key-based routing", " structured overlays"], "paper_abstract": "Structured peer-to-peer overlay networks have been used as a platform in the domain of the Internet to efficiently build large-scale distributed network applications such as distributed storage systems or distributed messaging systems - to mention but a few. With the advent of larger and more complex Mobile Ad Hoc Networks (MANETs), it is becoming increasingly interesting to build those distributed network applications from the Internet for MANETs as well. Of course, it would be intuitive to also use structured peer-to-peer overlays in MANETs as a platform for such networks applications. Unfortunately, the conventional Internet-based structured peer-to-peer overlays are not well-suited for the direct deployment on top of MANETs. This article analyzes the design requirements for structured peer-to-peer overlays that are to run on top of MANETs. It will further provide a case study of a structured peer-to-peer overlay explicitly designed for MANETs that enables the straight-forward porting of many of the above mentioned distributed network application for the use in MANETs. (c) 2007 Elsevier B.V. All rights reserved.", "paper_title": "Designing structured peer-to-peer overlays as a platform for distributed network applications in mobile ad hoc networks", "paper_id": "WOS:000258464100017"}