{"auto_keywords": [{"score": 0.03432968248566245, "phrase": "sciwfm"}, {"score": 0.004670504053818028, "phrase": "scientific_workflow_management_systems"}, {"score": 0.004361077072629878, "phrase": "production-style_environment"}, {"score": 0.004230188765513944, "phrase": "life_sciences"}, {"score": 0.004134596278123439, "phrase": "considerable_attention"}, {"score": 0.004041155193307942, "phrase": "climate_research"}, {"score": 0.003919830848124645, "phrase": "growing_availability"}, {"score": 0.0038900709793274484, "phrase": "analytical_tools"}, {"score": 0.0037020429480068653, "phrase": "end_users"}, {"score": 0.0034963129868796033, "phrase": "easier_integration"}, {"score": 0.0034697573205392887, "phrase": "custom_workflows"}, {"score": 0.003391290302481397, "phrase": "analysis_pipelines"}, {"score": 0.003190584226787897, "phrase": "widespread_acceptance"}, {"score": 0.003047865053078826, "phrase": "wider_adoption"}, {"score": 0.002718301574682098, "phrase": "existing_workflows"}, {"score": 0.002547583216040341, "phrase": "scientific_analysis"}, {"score": 0.002360381056508366, "phrase": "community-wide_workflow_repositories"}, {"score": 0.0022120914337992034, "phrase": "vision_paper"}, {"score": 0.0021049977753042253, "phrase": "new_research_questions"}], "paper_keywords": ["Scientific Workflow Systems", " Workflow Management", " Scientific data", " Data Analysis"], "paper_abstract": "Over the last years, a number of scientific workflow management systems (SciWFM) have been brought to a state of maturity that should permit their usage in a production-style environment. This is especially true for the Life Sciences, but SciWFM also attract considerable attention in fields like geophysics or climate research. These developments, accompanied by the growing availability of analytical tools wrapped as (web) services, were driven by a series of very interesting promises: End users will be empowered to develop their own pipelines; reuse of services will be enhanced by easier integration into custom workflows; time necessary for developing analysis pipelines will decrease; etc. But despite all efforts, SciWFM have not yet found widespread acceptance in their intended audience. In this paper, we argue that a wider adoption of SciWFM will only be achieved if the focus of research and development is shifted from methods for developing and running workflows to searching, adapting, and reusing existing workflows. Only by this shift can SciWFM outreach to the mass of domain scientists actually performing scientific analysis - and with little interest in developing them themselves. To this end, SciWFM need to be combined with community-wide workflow repositories allowing users to find solutions for their scientific needs (coded as a workflow). In this vision paper, we show how and where such developments have already started and highlight new research questions arising.", "paper_title": "Search, Adapt, and Reuse: The Future of Scientific Workflows", "paper_id": "WOS:000297688100001"}