{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "touchscreen_gestures"}, {"score": 0.009719203687573442, "phrase": "visual_impairments"}, {"score": 0.004766090327062509, "phrase": "sighted_users"}, {"score": 0.004544521651302002, "phrase": "video_tutorials"}, {"score": 0.004245667843980468, "phrase": "visual_feedback"}, {"score": 0.0038598702839340794, "phrase": "finger_touches"}, {"score": 0.003807684498435389, "phrase": "audio_representation"}, {"score": 0.0036305081978734127, "phrase": "automatic_analysis"}, {"score": 0.003593623872399777, "phrase": "user's_drawn_gesture"}, {"score": 0.003391556348707911, "phrase": "first_study"}, {"score": 0.003255777265493076, "phrase": "eyes-free_scenario"}, {"score": 0.0031682817605340028, "phrase": "best_combination"}, {"score": 0.0031254169757175257, "phrase": "second_study"}, {"score": 0.003104201872147936, "phrase": "ten_blind_and_low-vision_participants"}, {"score": 0.0029900592229516187, "phrase": "multitouch_gestures"}, {"score": 0.0029596622424171264, "phrase": "gesture_sonification_feedback"}, {"score": 0.0029096837584084182, "phrase": "multistroke_gestures"}, {"score": 0.0026995881394357504, "phrase": "third_study"}, {"score": 0.002681255756642227, "phrase": "six_blind_and_low-vision_participants"}, {"score": 0.0025131738347596586, "phrase": "complementary_advantages"}, {"score": 0.002487612781045517, "phrase": "verbal_feedback"}, {"score": 0.0023879358679564527, "phrase": "almost_all_participants"}, {"score": 0.0021049977753042253, "phrase": "nonvisual_training_systems"}], "paper_keywords": ["Blindness", " visual impairments", " sonification", " touchscreen", " gestures"], "paper_abstract": "While sighted users may learn to perform touchscreen gestures through observation (e.g., of other users or video tutorials), such mechanisms are inaccessible for users with visual impairments. As a result, learning to perform gestures without visual feedback can be challenging. We propose and evaluate two techniques to teach touchscreen gestures to users with visual impairments: (1) gesture sonification to generate sound based on finger touches, creating an audio representation of a gesture; and (2) corrective verbal feedback that combined automatic analysis of the user's drawn gesture with speech feedback. To refine and evaluate the techniques, we conducted three controlled laboratory studies. The first study, with 12 sighted participants, compared parameters for sonifying gestures in an eyes-free scenario. We identified pitch+stereo panning as the best combination. In the second study, ten blind and low-vision participants completed gesture replication tasks for single-stroke, multistroke, and multitouch gestures using the gesture sonification feedback. We found that multistroke gestures were more difficult to understand in sonification, but that playing each finger sound serially may improve understanding. In the third study, six blind and low-vision participants completed gesture replication tasks with both the sonification and corrective verbal feedback techniques. Subjective data and preliminary performance findings indicated that the techniques offer complementary advantages: although verbal feedback was preferred overall primarily due to the precision of its instructions, almost all participants appreciated the sonification for certain situations (e.g., to convey speed). This article extends our previous publication on gesture sonification by extending these techniques to multistroke and multitouch gestures. These findings provide a foundation for nonvisual training systems for touchscreen gestures.", "paper_title": "Audio-Based Feedback Techniques for Teaching Touchscreen Gestures", "paper_id": "WOS:000367988400002"}