{"auto_keywords": [{"score": 0.04415146428515108, "phrase": "input_query"}, {"score": 0.040715740506827254, "phrase": "search_space"}, {"score": 0.00481495049065317, "phrase": "access_patterns"}, {"score": 0.00468991337957911, "phrase": "traditional_query_processing"}, {"score": 0.004472935829694716, "phrase": "algebraic_operators"}, {"score": 0.0037793152987497286, "phrase": "access_restrictions"}, {"score": 0.003226744277130179, "phrase": "integrity_constraints"}, {"score": 0.00291923164591297, "phrase": "user_query"}, {"score": 0.002798662730881037, "phrase": "first_optimization_approach"}, {"score": 0.002711506442590442, "phrase": "single_framework"}, {"score": 0.002613239644974825, "phrase": "classical_cost-based_join_optimization"}, {"score": 0.0021385822825864425, "phrase": "direct_correspondence"}, {"score": 0.0021049977753042253, "phrase": "query_plan"}], "paper_keywords": [""], "paper_abstract": "Traditional query processing involves a search for plans formed by applying algebraic operators on top of primitives representing access to relations in the input query. But many querying scenarios involve two interacting issues that complicate the search. On the one hand, the search space may be limited by access restrictions associated with the interfaces to datasources, which require certain parameters to be given as inputs. On the other hand, the search space may be extended through the presence of integrity constraints that relate sources to each other, allowing for plans that do not match the structure of the user query. In this paper we present the first optimization approach that attacks both these difficulties within a single framework, presenting a system in which classical cost-based join optimization is extended to support both access-restrictions and constraints. Instead of iteratively exploring subqueries of the input query, our optimizer explores a space of proofs that witness the answering of the query, where each proof has a direct correspondence with a query plan.", "paper_title": "Querying with Access Patterns and Integrity Constraints", "paper_id": "WOS:000362280800006"}