{"auto_keywords": [{"score": 0.049604883316905636, "phrase": "symptom_classification"}, {"score": 0.04913548507380236, "phrase": "chinese_traditional_medicine"}, {"score": 0.015719716506582538, "phrase": "high_dimension_data"}, {"score": 0.004424268136268051, "phrase": "practical_applications"}, {"score": 0.004105850229681625, "phrase": "novel_computing_model"}, {"score": 0.003716520760680603, "phrase": "data_attributes"}, {"score": 0.00367967106192446, "phrase": "basic_vectors"}, {"score": 0.0035358770665604657, "phrase": "sum_vector"}, {"score": 0.0034146585649631692, "phrase": "transcendental_concept_similarity"}, {"score": 0.003281186608301359, "phrase": "novel_distance_algorithm"}, {"score": 0.0032164136388931805, "phrase": "similarity_distance"}, {"score": 0.002444883254621769, "phrase": "novel_classification_algorithm"}, {"score": 0.00239657981537094, "phrase": "similarity_computing_model"}, {"score": 0.002168975681697056, "phrase": "extensive_experiments"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Similarity computing", " Symptom classification", " Chinese traditional medicine", " Data mining", " Vector space"], "paper_abstract": "In recent years, researchers have paid more and more attention on data mining of practical applications. Aimed to the problem of symptom classification of Chinese traditional medicine, this paper proposes a novel computing model based on the similarities among attributes of high dimension data to compute the similarity between any tuples. This model assumes data attributes as basic vectors of m dimensions and each tuple as a sum vector of all the attribute-vectors. Based on the transcendental concept similarity information among attributes, it suggests a novel distance algorithm to compute the similarity distance of any pair of attribute-vectors. In this method, the computing of similarity between any tuples are turned to the formulas of attribute-vectors and their projections of each other, and the similarity between any pair of tuples can be worked out by computing these vectors and formulas. This paper also presents a novel classification algorithm based on the similarity computing model and successfully applies the algorithm into the symptom classification of Chinese traditional medicine. The efficiency of the algorithm is proved by extensive experiments. (C) 2008 Elsevier B.V. All rights reserved.", "paper_title": "Similarity computing model of high dimension data for symptom classification of Chinese traditional medicine", "paper_id": "WOS:000260152400023"}