{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "stack_overflow"}, {"score": 0.004667149874736771, "phrase": "community_question"}, {"score": 0.004430784015995566, "phrase": "single_answer"}, {"score": 0.004317109072311102, "phrase": "growing_volumes"}, {"score": 0.004272456401437226, "phrase": "unanswered_questions"}, {"score": 0.003870541730075597, "phrase": "conceptual_framework"}, {"score": 0.0030946423142739813, "phrase": "quest-for-answer_framework"}, {"score": 0.0027172436339437094, "phrase": "quest"}, {"score": 0.002619748321217153, "phrase": "generally_promising_results"}, {"score": 0.0025259712348798323, "phrase": "asker's_popularity"}, {"score": 0.0021049977753042253, "phrase": "socio-emotional_value"}], "paper_keywords": ["Answerability", " community question answering", " Stack Overflow", " unanswered questions"], "paper_abstract": "Some questions posted in community question answering sites (CQAs) fail to attract a single answer. To address the growing volumes of unanswered questions in CQAs, the objective of this paper is two-fold. First, it aims to develop a conceptual framework known as the Quest-for-Answer to explain why some questions in CQAs draw answers while others remain ignored. The framework suggests that the answerability of questions depends on both metadata and content. Second, the paper attempts to empirically validate the Quest-for-Answer framework through a case study of Stack Overflow. A total of 3000 questions divided equally between those answered and unanswered were used for analysis. The Quest-for-Answer framework yielded generally promising results. With respect to metadata, asker's popularity, participation and asking time of questions were found to be significant in predicting if answers would be forthcoming. With respect to content, level of details, specificity, clarity and the socio-emotional value of questions were significant in enhancing or impeding responses.", "paper_title": "Answers or no answers: Studying question answerability in Stack Overflow", "paper_id": "WOS:000361762300012"}