{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "encrypted_images"}, {"score": 0.004598933498016774, "phrase": "encrypted_media"}, {"score": 0.004337900700685262, "phrase": "traditional_compression_algorithms"}, {"score": 0.004143196873246147, "phrase": "distributed_source_coding"}, {"score": 0.0040238512275833265, "phrase": "prior_work"}, {"score": 0.003990385737207714, "phrase": "encrypted_data"}, {"score": 0.00390792986752692, "phrase": "unencrypted_data"}, {"score": 0.0037480753312398754, "phrase": "theoretical_results"}, {"score": 0.0035648266669315943, "phrase": "underlying_statistical_structure"}, {"score": 0.003028727936200845, "phrase": "statistical_models"}, {"score": 0.0027395968397212053, "phrase": "state-of-the-art_motion-compensated_lossless_video_encoder"}, {"score": 0.0025730425700096365, "phrase": "\"foreman\"_test_sequence"}, {"score": 0.00227914162528171, "phrase": "adaptive_protocol"}, {"score": 0.0022601535748259785, "phrase": "universal_compression"}, {"score": 0.0021857667493036786, "phrase": "entropy_rate"}, {"score": 0.00212268510072928, "phrase": "complete_implementation"}, {"score": 0.0021049977753042253, "phrase": "encrypted_video"}], "paper_keywords": ["Data compression", " data security", " image coding", " message passing", " source coding", " video coding"], "paper_abstract": "We present a framework for compressing encrypted media, such as images and videos. Encryption masks the source, rendering traditional compression algorithms ineffective. By conceiving of the problem as one of distributed source coding, it has been shown in prior work that encrypted data are as compressible as unencrypted data. However, there are two major challenges to realize these theoretical results. The first is the development of models that capture the underlying statistical structure and are compatible with our framework. The second is that since the source is masked by encryption, the compressor does not know what rate to target. We tackle these issues in this paper. We first develop statistical models for images before extending it to videos, where our techniques really gain traction. As an illustration, we compare our results to a state-of-the-art motion-compensated lossless video encoder that requires unencrypted video input. The latter compresses each unencrypted frame of the \"Foreman\" test sequence by 59% on average. In comparison, our proof-of-concept implementation, working on encrypted data, compresses the same sequence by 33%. Next, we develop and present an adaptive protocol for universal compression and show that it converges to the entropy rate. Finally, we demonstrate a complete implementation for encrypted video.", "paper_title": "Toward Compression of Encrypted Images and Video Sequences", "paper_id": "WOS:000261310400015"}