{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "internet_references"}, {"score": 0.006689909476977201, "phrase": "leading_general_medical_journals"}, {"score": 0.004250302819248558, "phrase": "original_contributions"}, {"score": 0.004184526032558792, "phrase": "five_leading_peer-reviewed_traditional_general_medical_journals"}, {"score": 0.0037003824615413367, "phrase": "ci"}, {"score": 0.002435542816459651, "phrase": "methods_section"}, {"score": 0.0021049977753042253, "phrase": "follow-up_period"}], "paper_keywords": ["Internet references", " Medical journals", " Accessibility"], "paper_abstract": "This study prospectively evaluates the accessibility of Internet references in leading general medical journals and explores the impact of their lost accessibility. We identified all original contributions published in five leading peer-reviewed traditional general medical journals and one leading on-line journal that were published at two time points (January 2005 and January 2008). We followed the sample prospectively for 5 years and determined the number of Internet references that remained accessible. Our sample of 165 original contributions contained 154 Internet references. Accessibility to Internet references declined from 51 % after 4 years to 37 % after 8 years in the articles published in January 2005, and decreased from 78 % after 1 year to 44 % after 5 years in the articles published in January 2008. Among those Internet references published in the most highly-cited articles, only 19 % (95 % CI 10-35 %) remained accessible in March 2013. Among the Internet references cited in the Methods section of the articles, only 30 % (95 % CI 20-43 %) remained accessible. Of the 91 Internet references which were no longer accessible at the end of the follow-up period, 39 (43 %) were assigned a rating of either 'important' or 'very important'. Accessibility of Internet references declines substantially over time most often because the information is updated or the sites become unavailable. Accessibility remains poor even among those Internet references that are most important.", "paper_title": "Prospective evaluation of the accessibility of Internet references in leading general medical journals", "paper_id": "WOS:000348324000014"}