{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "symbolic_features"}, {"score": 0.0483359539447573, "phrase": "intrusion_detection_problem"}, {"score": 0.004494570360108983, "phrase": "intrusion_detection_system"}, {"score": 0.004217708394188058, "phrase": "significant_features"}, {"score": 0.003936910716320182, "phrase": "network_traffic_data_stream"}, {"score": 0.0038748022659578865, "phrase": "machine_learning_methods"}, {"score": 0.0038339398365449507, "phrase": "potential_solutions"}, {"score": 0.003773449694108617, "phrase": "ids_problem"}, {"score": 0.003466536738232506, "phrase": "symbolic_attributes"}, {"score": 0.003287482882222731, "phrase": "conversion_-_indicator_variables"}, {"score": 0.0030847461428168614, "phrase": "arbitrary_conversion_method"}, {"score": 0.002328434471939886, "phrase": "prediction_ability"}, {"score": 0.002208035721125305, "phrase": "arbitrary_and_commonly_used_assignment"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Symbolic features", " Intrusion detection systems", " Machine learning", " Anomaly detection"], "paper_abstract": "The success of any Intrusion Detection System (IDS) lies in the selection of a set of significant features, that can be quantitative or qualitative, taken out from a network traffic data stream. The machine learning methods provide potential solutions for the IDS problem. However, most of these methods used for classification are not able to handle symbolic attributes directly. In this paper, three methods for symbolic features conversion - indicator variables, conditional probabilities and the Separability Split Value method - are contrasted with the arbitrary conversion method, all of them applied to an intrusion detection problem, the KDD Cup 99 data set. In particular, three classification methods were subsequently applied to the dataset: a one-layer feedforward neural network, a support vector machine and a multilayer feedforward neural network. The results obtained demonstrate that the three conversion methods improve the prediction ability of the classifiers utilized, with respect to the arbitrary and commonly used assignment of numerical values. (C) 2009 Elsevier Ltd. All rights reserved.", "paper_title": "Conversion methods for symbolic features: A comparison applied to an intrusion detection problem", "paper_id": "WOS:000266851000047"}