{"auto_keywords": [{"score": 0.04548812433856781, "phrase": "permutation_list"}, {"score": 0.010612387000973441, "phrase": "open_shop_scheduling"}, {"score": 0.010379382787834018, "phrase": "open_shops"}, {"score": 0.004673709383305897, "phrase": "makespan_minimization"}, {"score": 0.0046390482426405324, "phrase": "encoding_scheme"}, {"score": 0.004587535692463736, "phrase": "pivotal_role"}, {"score": 0.004419904580451831, "phrase": "scheduling_problem"}, {"score": 0.004258372598568333, "phrase": "high_adaptability"}, {"score": 0.004179824713643488, "phrase": "conceptual_simplicity"}, {"score": 0.004012061349250865, "phrase": "notorious_inherent_drawback"}, {"score": 0.003923398381490749, "phrase": "serious_drawback"}, {"score": 0.0036281710561308377, "phrase": "rank_matrix_encoding_scheme"}, {"score": 0.0030679850425428053, "phrase": "critical_disadvantage"}, {"score": 0.002847540262784593, "phrase": "alternative_possibility"}, {"score": 0.0027535633837592597, "phrase": "solution_space"}, {"score": 0.002652768049567487, "phrase": "search_space"}, {"score": 0.0025844090835070986, "phrase": "excellent_solution"}, {"score": 0.0025652026679268713, "phrase": "reasonable_computational_time"}, {"score": 0.00247128526955136, "phrase": "reinsertion_operators"}, {"score": 0.0024256208351516027, "phrase": "simple_applications"}, {"score": 0.0021526564019119466, "phrase": "constructive_heuristics"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Scheduling", " Open shop", " Constructive heuristic", " Encoding scheme", " Permutation", " Redundancy", " Insertion and reinsertion operators"], "paper_abstract": "This paper deals with open shops under makespan minimization. Encoding scheme plays a pivotal role in the success of any algorithm to solve a scheduling problem. Although the permutation list has many advantages (such as high adaptability to any operators, conceptual simplicity and ease of implementation), it suffers from a notorious inherent drawback, called redundancy. This serious drawback has made many researchers conclude that permutation list is ineffective for open shop scheduling. Therefore, they have turned toward the utilization of rank matrix encoding scheme to overcome this shortcoming at the expense of losing other advantages of permutation list. In this paper, we first pinpoint the origin of redundancy in the permutation list. We then analyze circumstances in which the redundancy occurs and afterwards present four efficient theorems to avoid this critical disadvantage. Regarding the theorems, we understand that redundancy is quite identifiable and also controllable. By introducing an alternative possibility to rank matrices of excluding redundancy. the solution space of open shops is significantly reduced. By reducing the search space, the probability of finding an excellent solution in reasonable computational time outstandingly soars. Finally, based on insertion and reinsertion operators we propose four constructive heuristics incorporating simple applications of the theorems. We evaluate the effectiveness and efficiency of our proposed algorithms on three well-known benchmarks and against some other existing heuristics. All the results and analyses illustrate the authenticity and superiority of our theorems and proposed constructive heuristics. (C) 2009 Elsevier Ltd. All rights reserved.", "paper_title": "A contribution and new heuristics for open shop scheduling", "paper_id": "WOS:000270630100021"}