{"auto_keywords": [{"score": 0.04953663923501101, "phrase": "explorative_game_behavior"}, {"score": 0.03373214653721467, "phrase": "explicit_messages"}, {"score": 0.011853041655189774, "phrase": "endogenous_educational_game"}, {"score": 0.00481495049065317, "phrase": "in-game_explanations"}, {"score": 0.004548253531664032, "phrase": "subject_matter"}, {"score": 0.004445739135694758, "phrase": "educational_games"}, {"score": 0.004199406257273994, "phrase": "full_learning_potential"}, {"score": 0.0034988876789164235, "phrase": "educational_content"}, {"score": 0.002706383680762465, "phrase": "explicit_purpose"}, {"score": 0.0024842242921857705, "phrase": "factual_knowledge"}, {"score": 0.0023463203637929466, "phrase": "particular_deep_comprehension"}, {"score": 0.0022034318550547866, "phrase": "endogenous_games"}, {"score": 0.0021049977753042253, "phrase": "coral_reefs"}], "paper_keywords": ["Educational games", " Endogenous games", " Exogenous games", " Game design", " Game experience"], "paper_abstract": "Often, the way subject matter is included in educational games does not fully utilize or sometimes even inhibits the full learning potential of games. This paper argues that in order to optimally use the potential of games for learning, games should be endogenous. An endogenous educational game is a game where the educational content is integrated in the game play mechanics themselves, rather than bolted-on using explicit messages. This research examines the relation between explicit messages, explorative game behavior, and comprehension by developing two versions of an endogenous educational game about overfishing, one with and one without an explicit purpose. The game was tested with 13 children aged 8 to 11. The results indicate that factual knowledge and comprehension is increased with explicit messages, and in particular deep comprehension is fostered by explorative game behavior. This confirms the plea for endogenous games to teach about bombs, fish, coral reefs, and more.", "paper_title": "Bombs, fish, and coral reefs The role of in-game explanations and explorative game behavior on comprehension", "paper_id": "WOS:000313654700002"}