{"auto_keywords": [{"score": 0.048245021750267576, "phrase": "erp_use"}, {"score": 0.04088564723557893, "phrase": "simultaneous_use"}, {"score": 0.037562452888349473, "phrase": "erp"}, {"score": 0.027290022173667976, "phrase": "erp_systems"}, {"score": 0.004570759604335229, "phrase": "alternative_software_packages"}, {"score": 0.003960972732123083, "phrase": "erp_related_factors"}, {"score": 0.003935267970727093, "phrase": "erp_adoption"}, {"score": 0.0038717306726380233, "phrase": "alternative_software_solutions"}, {"score": 0.0038466028116681023, "phrase": "findings_-_erp_adoption"}, {"score": 0.0037844916274672544, "phrase": "erp_complexity"}, {"score": 0.003443454339200118, "phrase": "erp_adopters"}, {"score": 0.0028228178454284825, "phrase": "qualitative_research"}, {"score": 0.0027862576750944277, "phrase": "deeper_insights"}, {"score": 0.0027681550491613603, "phrase": "actual_decision_processes"}, {"score": 0.002644678812707061, "phrase": "influence_sellers"}, {"score": 0.002543224008253855, "phrase": "flexibility_problems"}, {"score": 0.0023672002840029517, "phrase": "internal_it_competence"}, {"score": 0.002328921198521778, "phrase": "right_decisions"}, {"score": 0.002313783044225099, "phrase": "i.e._balance"}, {"score": 0.0021961592899628615, "phrase": "first_paper"}, {"score": 0.002153605290802688, "phrase": "exclusive_use"}, {"score": 0.0021049977753042253, "phrase": "alternative_packages"}], "paper_keywords": ["manufacturing resource planning", " computer software", " innovation", " competences", " communication technologies", " The Netherlands"], "paper_abstract": "Purpose - The purpose of this paper is to provide insight into the antecedents of ERP use and use of alternative software packages simultaneously. Design/methodology/approach - An exploratory model was composed based on literature on adoption and diffusion of innovations in general and ERP in specific. The model was tested using a sample of 486 Dutch midsized enterprises of the electrical, engineering and metal industries. Using two regression analyses we identify the effect of ERP related factors on ERP adoption and the simultaneous use of alternative software solutions. Findings - ERP adoption is significantly related to ERP complexity (positive), ERP compatibility (negative), IT competence (negative), and ERP sellers' marketing efforts (positive). For the ERP adopters that also use other software packages the following relationships were significant: ERP's additional flexibility, ERP compatibility (positive), IT competence (positive), ERP sellers' marketing efforts (negative), and company size. Research limitations/implications - As any sample, ours is limited and the findings may be validated among other populations. In-depth qualitative research may help gaining deeper insights into actual decision processes. Practical implications - Companies considering investing in ERP are aware of the influence sellers might have, companies should consider alternatives to ERP systems to overcome flexibility problems emanating from ERP use. This will most likely help to maintain their competitive advantage in the. marketplace. It will require some internal IT competence to help make the right decisions, i.e. balance need for integration of software and product/service differentiation towards customers. Originality/value - This is the first paper on the issue of the exclusive use of ERP systems versus the simultaneous use of alternative packages.", "paper_title": "ERP use: exclusive or complemented?", "paper_id": "WOS:000239331700012"}