{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "virtual_car_racing_games"}, {"score": 0.004757643419056999, "phrase": "autopia"}, {"score": 0.004626553103375699, "phrase": "driving_system"}, {"score": 0.004571478018964363, "phrase": "virtual_racing_situations"}, {"score": 0.004445494322321316, "phrase": "complete_modular_architecture"}, {"score": 0.004104269996872886, "phrase": "intuitive_modules"}, {"score": 0.003959353513286997, "phrase": "basic_aspect"}, {"score": 0.003927848423072668, "phrase": "car_driving"}, {"score": 0.0035544816252832375, "phrase": "particular_features"}, {"score": 0.003526186748088922, "phrase": "particular_situations"}, {"score": 0.0034702685641070283, "phrase": "present_work"}, {"score": 0.003321008590273796, "phrase": "hand-designed_driving_heuristics"}, {"score": 0.0031152526492532785, "phrase": "track's_shape"}, {"score": 0.002945669860541221, "phrase": "genetic_algorithm"}, {"score": 0.0027964537059186893, "phrase": "best_controller"}, {"score": 0.0027631038845413393, "phrase": "large_number"}, {"score": 0.0021049977753042253, "phrase": "wiley_periodicals"}], "paper_keywords": [""], "paper_abstract": "This work presents a driving system designed for virtual racing situations. It is based on a complete modular architecture capable of automatically driving a car along a track with or without opponents. The architecture is composed of intuitive modules, with each one being responsible for a basic aspect of car driving. Moreover, this modularity of the architecture will allow us to replace or add modules in the future as a way to enhance particular features of particular situations. In the present work, some of the modules are implemented by means of hand-designed driving heuristics, whereas modules responsible for adapting the speed and direction of the vehicle to the track's shape, both critical aspects of driving a vehicle, are optimized by means of a genetic algorithm that evaluates the performance of the controller in four different tracks to obtain the best controller in a large number of situations; the algorithm also penalizes controllers that go out of the track, lose control, or get damaged. The evaluation of the performance is done in two ways. First, in runs with and without adversaries over several tracks. And second, the architecture was submitted as a participant to the 2010 Simulated Car Racing Competition, which in end won laurels. (C) 2012 Wiley Periodicals, Inc.", "paper_title": "An evolutionary tuned driving system for virtual car racing games: The AUTOPIA driver", "paper_id": "WOS:000299334800002"}