{"auto_keywords": [{"score": 0.03355202817847117, "phrase": "thermal-aware_floorplanner"}, {"score": 0.01138856541644731, "phrase": "entire_system"}, {"score": 0.00481495049065317, "phrase": "vlsi_circuits"}, {"score": 0.0047385702897315436, "phrase": "new_solution"}, {"score": 0.004638602678192715, "phrase": "gate-level_netlists"}, {"score": 0.004540734419151103, "phrase": "timing_constraints"}, {"score": 0.00450456611645112, "phrase": "temperature_reduction"}, {"score": 0.004468684611798047, "phrase": "overall_temperature"}, {"score": 0.004304963945457799, "phrase": "thermal_analysis"}, {"score": 0.004247951281217312, "phrase": "logic_netlists"}, {"score": 0.004081385289516914, "phrase": "larger_system"}, {"score": 0.003984584679856016, "phrase": "new_technique"}, {"score": 0.003777581820724243, "phrase": "isothermal_logic_clusters"}, {"score": 0.003687960013746783, "phrase": "logic_clusters"}, {"score": 0.003658559348800592, "phrase": "maximum_allowed_temperature"}, {"score": 0.0035812942842883607, "phrase": "contact_point"}, {"score": 0.003413341320961615, "phrase": "temperature-aware_floorplanner"}, {"score": 0.003261934055562238, "phrase": "thermal-aware_design_flow"}, {"score": 0.0029868743007990333, "phrase": "partitioned_units"}, {"score": 0.00292375291694002, "phrase": "tight_timing_budget"}, {"score": 0.002801472611575172, "phrase": "thermal-aware_replacement"}, {"score": 0.002771707885755579, "phrase": "loose_timing_budget"}, {"score": 0.0026771333996253783, "phrase": "benchmark_designs"}, {"score": 0.0025243592424524764, "phrase": "peak_temperature"}, {"score": 0.0024643961527350032, "phrase": "tight_and_loose_timing"}, {"score": 0.0024122895441506895, "phrase": "conventional_thermal-aware_floorplanner"}, {"score": 0.002317533977770783, "phrase": "field-programmable_gate_arrays"}, {"score": 0.0021049977753042253, "phrase": "loose_and_tight_timing_constraints"}], "paper_keywords": ["Hotspots", " leakage power", " temperature flattening", " temperature reduction"], "paper_abstract": "This paper proposes a new solution to the problem of eliminating hotspots from gate-level netlists as well as examines the effects of timing constraints on the temperature reduction and the overall temperature flattening on the chip. Our core technique consists of three steps. First, a thermal analysis is carried out for logic netlists. (The netlists are assumed to be either isolated or embedded in a larger system with macro-cells.) We then apply a new technique, called isothermal logic partitioning technique (LP-temp), to the netlists, which essentially builds isothermal logic clusters for the netlists and splits each of the logic clusters exceeding the maximum allowed temperature through its hottest point. This will enlarge a contact point for the hotspot to cool down. Finally, the entire system is replaced using a custom designed temperature-aware floorplanner so that the temperature across the entire system is reduced and flattened. We have developed a thermal-aware design flow, integrating our thermal-aware logic partitioning technique with a timing and thermal-aware floorplanner. Two cases were analyzed: (tight timing) LP-temp combined with the timing and thermal-aware floorplanner, where the partitioned units by LP-temp are replaced locally considering a tight timing budget (5% timing degradation); (loose timing) LP-temp combined with thermal-aware replacement, considering a loose timing budget (10% timing degradation). From experimentations using a set of benchmark designs, it is confirmed that our temperature reduction technique is effective, generating designs with an average of 5.54% and 9.9% more reduction of peak temperature (on average) for the cases of tight and loose timing than that of the designs by a conventional thermal-aware floorplanner without using LP-temp, respectively. We also analyzed the effect of our proposed technique on field-programmable gate arrays (FPGAs) in order to contrast its effectiveness on systems with hotspots on hardmacros. Results show that our technique can reduce the temperature in these systems on average 3.40% and 6.61 % for the case of loose and tight timing constraints respectively compared to the thermal-aware floorplanner without using LP-temp.", "paper_title": "Hotspots Elimination and Temperature Flattening in VLSI Circuits", "paper_id": "WOS:000260864300005"}