{"auto_keywords": [{"score": 0.049831523159419674, "phrase": "sequential_releases"}, {"score": 0.026634191252943393, "phrase": "privacy_evaluation"}, {"score": 0.025640715963852433, "phrase": "cell_generalization_model"}, {"score": 0.00481495049065317, "phrase": "sensitive_data"}, {"score": 0.0047407085958145806, "phrase": "privacy_preserving_data_publishing"}, {"score": 0.004667606070383657, "phrase": "research_field"}, {"score": 0.004318586703426523, "phrase": "sequential_release"}, {"score": 0.004262997588841983, "phrase": "data_publishing"}, {"score": 0.004240961958923296, "phrase": "multiple_releases"}, {"score": 0.0038431888954930083, "phrase": "different_releases"}, {"score": 0.0035648266669315943, "phrase": "sensitive_values"}, {"score": 0.0033758830345501246, "phrase": "greater_number"}, {"score": 0.0032218966066768022, "phrase": "global_recoding_model"}, {"score": 0.0032052251526888697, "phrase": "\"cut_generalization"}, {"score": 0.00318067660112974, "phrase": "ref"}, {"score": 0.0030274185919322506, "phrase": "underlying_table"}, {"score": 0.00275742870367532, "phrase": "match_join"}, {"score": 0.0026728783066296813, "phrase": "extended_framework"}, {"score": 0.0025976472770944804, "phrase": "published_releases"}, {"score": 0.002447101794397243, "phrase": "top-down_algorithm"}, {"score": 0.0023112538304098434, "phrase": "staggering_improvement"}, {"score": 0.002154772490492128, "phrase": "kernel_match_joins"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Privacy Preserving Data Publishing", " Sequential release", " Continuous Data Publishing", " Multipartite graphs", " Matching"], "paper_abstract": "Privacy Preserving Data Publishing (PPDP) is a research field that deals with the development of methods to enable publishing of data while minimizing distortion, for maintaining usability on one hand, and respecting privacy on the other hand. Sequential release is a scenario of data publishing where multiple releases of the same underlying table are published over a period of time. A violation of privacy, in this case, may emerge from any one of the releases, or as a result of joining information from different releases. Similarly to [37], our privacy definitions limit the ability of an adversary who combines information from all releases, to link values of the quasi-identifiers to sensitive values. We extend the framework that was considered in Ref. [37] in three ways: We allow a greater number of releases, we consider the more flexible local recoding model of \"cell generalization\" (as opposed to the global recoding model of \"cut generalization\" in Ref. [37]), and we include the case where records may be added to the underlying table from time to time. Our extension of the framework requires also to modify the manner in which privacy is evaluated. We show that while [37] based their privacy evaluation on the notion of the Match Join between the releases, it is no longer suitable for the extended framework considered here. We define more restrictive types of join between the published releases (the Full Match Join and the Kernel Match Join) that are more suitable for privacy evaluation in this context. We then present a top-down algorithm for anonymizing sequential releases in the cell generalization model, that is based on our modified privacy evaluations. Our theoretical study is followed by experimentation that demonstrates a staggering improvement in terms of utility due to the adoption of the cell generalization model, and exemplifies the correction in the privacy evaluation as offered by using the Full or Kernel Match Joins instead of the Match Join. (C) 2012 Elsevier Inc. All rights reserved.", "paper_title": "Limiting disclosure of sensitive data in sequential releases of databases", "paper_id": "WOS:000302510400009"}