{"auto_keywords": [{"score": 0.042907225459955275, "phrase": "shot_similarity"}, {"score": 0.00481495049065317, "phrase": "shot_clustering"}, {"score": 0.004721162131188487, "phrase": "video_indexing"}, {"score": 0.004665764181113345, "phrase": "efficient_segmentation"}, {"score": 0.0038624981944755813, "phrase": "prior_knowledge"}, {"score": 0.003817137134650275, "phrase": "scene_duration"}, {"score": 0.0033651019362620866, "phrase": "sequence_alignment_algorithm"}, {"score": 0.003247868216333148, "phrase": "shot_labels"}, {"score": 0.0031845067058084583, "phrase": "final_scene_segmentation_result"}, {"score": 0.0030494153169181334, "phrase": "visual_features"}, {"score": 0.00292003791296245, "phrase": "sequence_alignment"}, {"score": 0.0027961342030212353, "phrase": "improved_spectral_clustering_method"}, {"score": 0.0026774738852854427, "phrase": "fast_global_k-means_algorithm"}, {"score": 0.0026045914281028473, "phrase": "eigenvector_computation"}, {"score": 0.002573965014439041, "phrase": "similarity_matrix"}, {"score": 0.0024357240356443653, "phrase": "numerical_experiments"}, {"score": 0.0021896891011033105, "phrase": "proposed_scene_detection_method"}, {"score": 0.0021384748235753425, "phrase": "scene_boundaries"}, {"score": 0.0021049977753042253, "phrase": "good_tradeoff"}], "paper_keywords": ["Global k-means", " key-frames", " scene detection", " sequence alignment"], "paper_abstract": "Video indexing requires the efficient segmentation of video into scenes. The video is first segmented into shots and a set of key-frames is extracted for each shot. Typical scene detection algorithms incorporate time distance in a shot similarity metric. In the method we propose, to overcome the difficulty of having prior knowledge of the scene duration, the shots are clustered into groups based only on their visual similarity and a label is assigned to each shot according to the group that it belongs to. Then, a sequence alignment algorithm is applied to detect when the pattern of shot labels changes, providing the final scene segmentation result. In this way shot similarity is computed based only on visual features, while ordering of shots is taken into account during sequence alignment. To cluster the shots into groups we propose an improved spectral clustering method that both estimates the number of clusters and employs the fast global k-means algorithm in the clustering stage after the eigenvector computation of the similarity matrix. The same spectral clustering method is applied to extract the key-frames of each shot and numerical experiments indicate that the content of each shot is efficiently summarized using the method we propose herein. Experiments on TV-series and movies also indicate that the proposed scene detection method accurately detects most of the scene boundaries while preserving a good tradeoff between recall and precision.", "paper_title": "Scene Detection in Videos Using Shot Clustering and Sequence Alignment", "paper_id": "WOS:000262714700008"}