{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "vehicular_networks"}, {"score": 0.009227597314387088, "phrase": "mobility_management"}, {"score": 0.004339459955098738, "phrase": "intelligent_transportation_system"}, {"score": 0.004176321608449849, "phrase": "traditional_mobility_management_schemes"}, {"score": 0.004085856939524333, "phrase": "mobile_ad_hoc_network"}, {"score": 0.003661987063211563, "phrase": "unique_characteristics"}, {"score": 0.003429001377800258, "phrase": "mobility_management_solutions"}, {"score": 0.0031932442564773468, "phrase": "comprehensive_survey"}, {"score": 0.0023749823753904204, "phrase": "network-based_mobility_management"}, {"score": 0.0021049977753042253, "phrase": "john_wiley"}], "paper_keywords": ["mobility management", " vehicular networks", " host mobility", " network mobility"], "paper_abstract": "Mobility management is one of the most challenging research issues for vehicular networks to support a variety of intelligent transportation system (ITS) applications. The traditional mobility management schemes for Internet and mobile ad hoc network (MANET) cannot meet the requirements of vehicular networks, and the performance degrades severely due to the unique characteristics of vehicular networks (e.g., high mobility). Therefore, mobility management solutions developed specifically for vehicular networks would be required. This paper presents a comprehensive survey on mobility management for vehicular networks. First, the requirements of mobility management for vehicular networks are identified. Then, classified based on two communication scenarios in vehicular networks, namely, vehicle-to-vehicle (V2V) and vehicle-to-infrastructure (V2I) communications, the existing mobility management schemes are reviewed. The differences between host-based and network-based mobility management are discussed. To this end, several open research issues in mobility management for vehicular networks are outlined. Copyright (C) 2009 John Wiley & Sons, Ltd.", "paper_title": "Mobility and handoff management in vehicular networks: a survey", "paper_id": "WOS:000289372200003"}