{"auto_keywords": [{"score": 0.04201891621603315, "phrase": "basque"}, {"score": 0.03711362874746577, "phrase": "morphological_query_expansion"}, {"score": 0.011429070132052672, "phrase": "language-filtering_words"}, {"score": 0.00481495049065317, "phrase": "basque_web_retrieval"}, {"score": 0.004628101576367193, "phrase": "major_search_engines"}, {"score": 0.004448471107649881, "phrase": "basque_language"}, {"score": 0.004212759658511567, "phrase": "exact_matches"}, {"score": 0.0040491842732233154, "phrase": "agglutinative_language"}, {"score": 0.003834548373258131, "phrase": "search_engine"}, {"score": 0.003371220210416809, "phrase": "search_engines"}, {"score": 0.0032724821705972357, "phrase": "appropriate_web_search_services"}, {"score": 0.003192406091820197, "phrase": "implementation_details"}, {"score": 0.0027650234530228897, "phrase": "corpora-based_studies"}, {"score": 0.0025289662786567896, "phrase": "real_web_searches"}, {"score": 0.0021902063413831545, "phrase": "proposed_methodology"}, {"score": 0.0021049977753042253, "phrase": "basque_search_service"}], "paper_keywords": ["Search engines", " Web-as-corpus", " Basque", " NLP", " Morphological query expansion", " Language-filtering words"], "paper_abstract": "The experience of a user of major search engines or other web information retrieval services looking for information in the Basque language is far from satisfactory: they only return pages with exact matches but no inflections (necessary for an agglutinative language like Basque), many results in other languages (no search engine gives the option to restrict its results to Basque), etc. This paper proposes using morphological query expansion and language-filtering words in combination with the APIs of search engines as a very cost-effective solution to build appropriate web search services for Basque. The implementation details of the methodology (choosing the most appropriate language-filtering words, the number of them, the most frequent inflections for the morphological query expansion, etc.) have been specified by corpora-based studies. The improvements produced have been measured in terms of precision and recall both over corpora and real web searches. Morphological query expansion can improve recall up to 47 % and language-filtering words can raise precision from 15 % to around 90 %, although with a loss in recall of about 30-35 %. The proposed methodology has already been successfully used in the Basque search service Elebila (http://www.elebila.eu) and the web-as-corpus tool CorpEus (http://www.corpeus.org), and the approach could be applied to other morphologically rich or under-resourced languages as well.", "paper_title": "Morphological query expansion and language-filtering words for improving Basque web retrieval", "paper_id": "WOS:000319776500006"}