{"auto_keywords": [{"score": 0.04349837475550595, "phrase": "dynamic_query_space"}, {"score": 0.005150757606942925, "phrase": "query_time_interval"}, {"score": 0.00481495049065317, "phrase": "moving_objects"}, {"score": 0.00471193241675062, "phrase": "continuously_moving_objects"}, {"score": 0.004651177631663439, "phrase": "unique_challenges"}, {"score": 0.004102639724186862, "phrase": "threshold_value"}, {"score": 0.0032896745636186824, "phrase": "point_objects"}, {"score": 0.003029722317983915, "phrase": "time_intervals"}, {"score": 0.0028267701593809877, "phrase": "total_length"}, {"score": 0.0025920406425973368, "phrase": "disjoint_time_intervals"}, {"score": 0.0024078737745407614, "phrase": "average_length"}, {"score": 0.0022758994740331258, "phrase": "operators_separate_algorithms"}, {"score": 0.002188784900536406, "phrase": "experimental_results"}, {"score": 0.0021325650133686516, "phrase": "estimation_algorithms"}], "paper_keywords": ["Moving point objects", " Spatiotemporal data", " Aggregation operator", " MaxCount", " ThresholdCount", " CountRange"], "paper_abstract": "Calculating operators of continuously moving objects presents some unique challenges, especially when the operators involve aggregation or the concept of congestion, which happens when the number of moving objects in a changing or dynamic query space exceeds some threshold value. This paper presents the following six d-dimensional moving object operators: (1) MaxCount (or MinCount), which finds the Maximum (or Minimum) number of moving objects simultaneously present in the dynamic query space at any time during the query time interval. (2) CountRange, which finds a count of point objects whose trajectories intersect the dynamic query space during the query time interval. (3) ThresholdRange, which finds the set of time intervals during which the dynamic query space is congested. (4) ThresholdSum, which finds the total length of all the time intervals during which the dynamic query space is congested. (5) ThresholdCount, which finds the number of disjoint time intervals during which the dynamic query space is congested. And (6) ThresholdAverage, which finds the average length of time of all the time intervals when the dynamic query space is congested. For these operators separate algorithms are given to find only estimate or only precise values. Experimental results from more than 7,500 queries indicate that the estimation algorithms produce fast, efficient results with error under 5%.", "paper_title": "Efficient MaxCount and threshold operators of moving objects", "paper_id": "WOS:000268902100001"}