{"auto_keywords": [{"score": 0.039748006326436616, "phrase": "cad"}, {"score": 0.0047527118741586055, "phrase": "metal_alloy_microstructures"}, {"score": 0.00466085208934021, "phrase": "heterogeneous_computer"}, {"score": 0.0042550030421781605, "phrase": "volume_fraction_vector"}, {"score": 0.003569050665799723, "phrase": "specific_metal_alloys"}, {"score": 0.0033878306639271963, "phrase": "material_model"}, {"score": 0.0033222630615013763, "phrase": "probabilistic_model"}, {"score": 0.0032792555200980783, "phrase": "grain_characteristics"}, {"score": 0.003194898129853895, "phrase": "cumulative_distribution_functions"}, {"score": 0.0029933487820771217, "phrase": "different_alloy_grain_structures"}, {"score": 0.0027323009127771525, "phrase": "desired_size_scale"}, {"score": 0.0026619761089539595, "phrase": "multiscale_capability"}, {"score": 0.0023672002840029517, "phrase": "heterogeneous_cad_representation"}, {"score": 0.0021049977753042253, "phrase": "probabilistic_grain_models"}], "paper_keywords": [""], "paper_abstract": "Most heterogeneous computer aided design (CAD) representations in the literature represent materials using a volume fraction vector, which may not by physically realizable or meaningful. In contrast, the multiscale, heterogeneous CAD representation presented here models materials using their microstructure. For the specific metal alloys of interest in this work, the material model is a probabilistic model of grain characteristics, represented as cumulative distribution functions (CDFs). Several microstructure reconstruction algorithms are presented that enable different alloy grain structures to be reconstructed in a part model. Reconstructions can be performed at any desired size scale, illustrating the multiscale capability of the representation. A part rendering algorithm is presented for displaying parts with their material microstructures. The multiscale, heterogeneous CAD representation is demonstrated on two Inconel alloys and is shown to be capable of faithfully reconstructing part representations consistent with the probabilistic grain models.", "paper_title": "Multiscale, Heterogeneous Computer Aided Design Representation for Metal Alloy Microstructures", "paper_id": "WOS:000344473500003"}