{"auto_keywords": [{"score": 0.034257698941854084, "phrase": "proposed_iir-based_implicit_evolution_scheme"}, {"score": 0.013904858211766518, "phrase": "proposed_scheme"}, {"score": 0.00481495049065317, "phrase": "active_contours"}, {"score": 0.004725385523804256, "phrase": "iir_filtering"}, {"score": 0.00450020161335541, "phrase": "implicit_scheme"}, {"score": 0.004449772140968921, "phrase": "numerical_solution"}, {"score": 0.004399905285945236, "phrase": "partial_differential_equation"}, {"score": 0.004127657126534723, "phrase": "traditional_active_contour"}, {"score": 0.00396050388346298, "phrase": "image-based_force_field"}, {"score": 0.003828770052266183, "phrase": "active_surfaces"}, {"score": 0.003743381699791, "phrase": "proposed_approach"}, {"score": 0.003673675864705682, "phrase": "infinite_impulse_response"}, {"score": 0.002976019715894587, "phrase": "significantly_fewer_iterations"}, {"score": 0.002942619810718864, "phrase": "explicit_evolution_scheme"}, {"score": 0.0028769371032728733, "phrase": "separability_property"}, {"score": 0.002729307099580315, "phrase": "deformable_surfaces"}, {"score": 0.0026384167183586015, "phrase": "large_sparse_matrices"}, {"score": 0.0024842242921857705, "phrase": "synthetic_and_clinical_volumetric_data"}, {"score": 0.0021775526153883355, "phrase": "explicit_scheme"}, {"score": 0.0021530945641993152, "phrase": "considerably_less_computation_time"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Active contour", " Active surface", " 3D segmentation", " Implicit evolution"], "paper_abstract": "In this work, we present an approach for implementing an implicit scheme for the numerical solution of the partial differential equation of the evolution of an active contour/surface. The proposed scheme is applicable to any variant of the traditional active contour (AC), irrespectively of the calculation of the image-based force field and it is readily applicable to explicitly parameterized active surfaces (AS). The proposed approach is formulated as an infinite impulse response (IIR) filtering of the coordinates of the contour/surface points. The poles of the filter are determined by the parameters controlling the shape of the active contour/surface. We show that the proposed IIR-based implicit evolution scheme has very low complexity. Furthermore, the proposed scheme is numerically stable, thus it allows the convergence of the AC/AS with significantly fewer iterations than the explicit evolution scheme. It also possesses the separability property along the two parameters of the AS, thus it may be applied to deformable surfaces, without the need to store and invert large sparse matrices. We implemented the proposed IIR-based implicit evolution scheme in the Vector Field Convolution (VFC) AC/AS using synthetic and clinical volumetric data. We compared the segmentation results with those of the explicit AC/AS evolution, in terms of accuracy and efficiency. Results show that the VFC AC/AS with the proposed IIR-based implicit evolution scheme achieves the same segmentation results with the explicit scheme, with considerably less computation time. (C) 2014 Elsevier Ltd. All rights reserved.", "paper_title": "An implicit evolution scheme for active contours and surfaces based on IIR filtering", "paper_id": "WOS:000336115800005"}