{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "software_product_lines"}, {"score": 0.004609175313390942, "phrase": "important_role"}, {"score": 0.0045591142048535165, "phrase": "quality_assurance_process"}, {"score": 0.004269913167716059, "phrase": "testing_activities"}, {"score": 0.003898307690037192, "phrase": "testing_strategies"}, {"score": 0.0036775717816768133, "phrase": "available_research"}, {"score": 0.0036508702548731383, "phrase": "spl_testing_strategies"}, {"score": 0.0035589270056254605, "phrase": "higher_defect_detection_rates"}, {"score": 0.003533083861130305, "phrase": "reduced_quality_assurance_effort"}, {"score": 0.0034440966820590024, "phrase": "literature_review"}, {"score": 0.003132693064568434, "phrase": "detailed_analyses"}, {"score": 0.0030986183831544487, "phrase": "core_set"}, {"score": 0.002987682397171167, "phrase": "reported_strategies"}, {"score": 0.0029444248503861167, "phrase": "software_product_line_testing"}, {"score": 0.002707541142254756, "phrase": "large_number"}, {"score": 0.0025447584328314754, "phrase": "realistic_industrial_experiences"}, {"score": 0.002374351263279043, "phrase": "leveraged_strategies"}, {"score": 0.002247900207250435, "phrase": "future_research"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Software product lines", " Software testing", " Software quality", " Systematic literature review"], "paper_abstract": "Context: Testing plays an important role in the quality assurance process for software product line engineering. There are many opportunities for economies of scope and scale in the testing activities, but techniques that can take advantage of these opportunities are still needed. Objective: The objective of this study is to identify testing strategies that have the potential to achieve these economies, and to provide a synthesis of available research on SPL testing strategies, to be applied towards reaching higher defect detection rates and reduced quality assurance effort. Method: We performed a literature review of two hundred seventy-six studies published from the year 1998 up to the 1st semester of 2013. We used several filters to focus the review on the most relevant studies and we give detailed analyses of the core set of studies. Results: The analysis of the reported strategies comprised two fundamental aspects for software product line testing: the selection of products for testing, and the actual test of products. Our findings indicate that the literature offers a large number of techniques to cope with such aspects. However, there is a lack of reports on realistic industrial experiences, which limits the inferences that can be drawn. Conclusion: This study showed a number of leveraged strategies that can support both the selection of products, and the actual testing of products. Future research should also benefit from the problems and advantages identified in this study. (C) 2014 Elsevier B.V. All rights reserved.", "paper_title": "On strategies for testing software product lines: A systematic literature review", "paper_id": "WOS:000340850700002"}