{"auto_keywords": [{"score": 0.042241979623561146, "phrase": "dual_hesitant_fuzzy_information"}, {"score": 0.03903463041639035, "phrase": "choquet"}, {"score": 0.00481495049065317, "phrase": "multiple_attribute_decision_making"}, {"score": 0.004653339900995785, "phrase": "multiple_attribute_decision"}, {"score": 0.00417160036938041, "phrase": "dual_hesitant_fuzzy_elements"}, {"score": 0.0040869663676860535, "phrase": "new_madm_method"}, {"score": 0.003613899384402803, "phrase": "new_aggregation_operators"}, {"score": 0.003352088714126572, "phrase": "dual_hesitant_fuzzy_choquet"}, {"score": 0.0028446460307503343, "phrase": "desirable_properties"}, {"score": 0.002532284627202572, "phrase": "dhfcoa_operator"}, {"score": 0.002447103615977124, "phrase": "madm"}, {"score": 0.0023810183846557486, "phrase": "dual_hesitant_fuzzy_environment"}, {"score": 0.002300912218086077, "phrase": "numerical_example"}, {"score": 0.0021634370496463793, "phrase": "proposed_method"}], "paper_keywords": ["Dual hesitant fuzzy set", " Choquet integral", " dual hesitant fuzzy Choquet integral aggregation operators", " generalized dual hesitant fuzzy Choquet integral aggregation operators"], "paper_abstract": "With respect to multiple attribute decision making (MADM) problems in which the attributes are inter-dependent and take the form of dual hesitant fuzzy elements, a new MADM method with dual hesitant fuzzy information is investigated in this paper. Firstly, by using the Choquet integral, some new aggregation operators are developed for aggregating the dual hesitant fuzzy information, such as the dual hesitant fuzzy Choquet ordered average (DHFCOA) operator, the dual hesitant fuzzy Choquet ordered geometric (DHFCOG) operator, the generalized dual hesitant fuzzy Choquet ordered average (GDHFCOA) operator and the generalized dual hesitant fuzzy Choquet ordered geometric (GDHFCOG) operator. Then, some special cases, desirable properties of these operators and the relationships between them are discussed. Furthermore, based on the DHFCOA operator, an approach to MADM is proposed under dual hesitant fuzzy environment. Finally, a numerical example is given to illustrate the application of the proposed method and to demonstrate its practicality and effectiveness.", "paper_title": "Some new dual hesitant fuzzy aggregation operators based on Choquet integral and their applications to multiple attribute decision making", "paper_id": "WOS:000345981600014"}