{"auto_keywords": [{"score": 0.0480509643781592, "phrase": "exact_real_number_computation"}, {"score": 0.044411550678130796, "phrase": "interval_domain_model"}, {"score": 0.00481495049065317, "phrase": "sequential_real_number_computation"}, {"score": 0.004752873752686246, "phrase": "di_gianantonio"}, {"score": 0.004415857432588371, "phrase": "data_abstraction"}, {"score": 0.00403221710768334, "phrase": "maximum_data_abstraction"}, {"score": 0.0033909518548844047, "phrase": "sequential_computation"}, {"score": 0.0033039560332995136, "phrase": "farjudian"}, {"score": 0.0031230216871739776, "phrase": "limited_power"}, {"score": 0.0029519664912853938, "phrase": "previous_argument"}, {"score": 0.0026259694526633037, "phrase": "partial_real_numbers"}, {"score": 0.0025808284847319528, "phrase": "exactly_what"}, {"score": 0.0025145641652082164, "phrase": "shrad"}, {"score": 0.0021982976170703884, "phrase": "multi_-valuednes"}, {"score": 0.002169882514603539, "phrase": "total_real_numbers"}], "paper_keywords": [""], "paper_abstract": "Since Di Gianantonio [1993] introduced his semantics for exact real number computation, there has always been a struggle to maintain data abstraction and efficiency as much as possible. The interval domain model-or its variationscan be regarded as the standard setting to obtain maximum data abstraction. As for efficiency there has been much focus on sequentiality to the extent that these two terms have become almost synonymous. Escardo et al. [1998, 2004] demonstrated that there is not much one can get by sequential computation in the interval domain model. In Farjudian [2004a, 2003] we reinforced this result by exposing the limited power of (some extensions of) the sequential fragment of Real-PCF. The previous argument suggests some sort of compromise in the beauty of the model in order to keep efficiency. One way forward is to try to sacrifice singlevaluedness over partial real numbers. This is exactly what we will see in designing SHRAD, (1) where we succeed in presenting a framework for exact real number computation which satisfies the following all at the same time: 1. It is sequential. 2. Multi -valuednes s over total real numbers is carefully avoided. 3. All the computable first-order functions are defined in the language (expressivity).", "paper_title": "SHRAD: A language for sequential real number computation", "paper_id": "WOS:000246522600004"}