{"auto_keywords": [{"score": 0.04179546919304622, "phrase": "tpl"}, {"score": 0.03933774739584528, "phrase": "supply_chain_network"}, {"score": 0.015719693992243013, "phrase": "closed-loop_supply_chain_network"}, {"score": 0.010576090565929093, "phrase": "retail_price"}, {"score": 0.004521566043596533, "phrase": "complicated_supply_chain"}, {"score": 0.004303591748086452, "phrase": "single_supplier"}, {"score": 0.0042650992966174065, "phrase": "multiple_demand_markets"}, {"score": 0.0034841647157189985, "phrase": "market's_demand_scale"}, {"score": 0.003071965703296204, "phrase": "buyback_contract"}, {"score": 0.002910545717767559, "phrase": "remaining_products"}, {"score": 0.0028586409810976367, "phrase": "local_market"}, {"score": 0.0025202582748972122, "phrase": "current_products"}, {"score": 0.0024421008630165046, "phrase": "increased_demand"}, {"score": 0.0023770362063833903, "phrase": "quantity_discount_policy"}, {"score": 0.0022318655527987846, "phrase": "disrupted_market"}], "paper_keywords": ["Closed-loop supply chain", " Quantity discount", " Buy-back contract", " Disruption coordination"], "paper_abstract": "To investigate how to coordinate the complicated supply chain, a closed-loop supply chain network is studied, which consists of a single supplier and multiple demand markets. Further detailed, in every market, there exist many retailers and one third party logistics (TPL) entity. Three kinds of situations are considered, theoretically, when the supply chain network is disrupted by sudden, disruptive events. Firstly, in the case of the deviation of a market's demand scale being negative and great, it has been proved not optimal for the supply chain network that the retail price be raised blindly to reduce the demand, so the buyback contract is feasible for coordination so that the TPL can buy the remaining products back from the local market and then sell these products to the supplier. Secondly, while the deviation is positive and also great, that is to say the quantity of current products in sales cannot satisfy the increased demand, then, with a quantity discount policy, more products should be replenished by the TPL from the supplier to the disrupted market. And finally, when the deviation is smaller and smaller, neither the buy-back contract nor the quantity discount policy is necessary, but it would be possible to coordinate the supply chain network so that the retail price could be altered appropriately.", "paper_title": "DISRUPTION COORDINATION OF CLOSED-LOOP SUPPLY CHAIN NETWORK (I) - MODELS AND THEOREMS", "paper_id": "WOS:000260923100017"}