{"auto_keywords": [{"score": 0.04056439022745188, "phrase": "implicit_shyness"}, {"score": 0.015239332329390252, "phrase": "test-retest_reliability"}, {"score": 0.015004589343456685, "phrase": "criterion-related_validity"}, {"score": 0.012515776067387126, "phrase": "implicit_self-esteem"}, {"score": 0.0061120005137038115, "phrase": "one-week_interval"}, {"score": 0.004246947739596565, "phrase": "japanese_people"}, {"score": 0.004180810073454326, "phrase": "iat"}, {"score": 0.004051595625804513, "phrase": "implicit_stereotypes"}, {"score": 0.0031348622158167195, "phrase": "shyness_iats"}, {"score": 0.0027790254309734428, "phrase": "sufficient_positive_correlation_coefficient"}, {"score": 0.002476424729269258, "phrase": "strong_negative_correlation_coefficient"}, {"score": 0.0021496083700137305, "phrase": "japanese_version"}, {"score": 0.0021050005183470915, "phrase": "tat"}], "paper_keywords": ["implicit shyness", " implicit association test", " reliability", " validity"], "paper_abstract": "This study investigated the test-retest reliability and the criterion-related validity of the Implicit Association Test (IAT [I]) that was developed for measuring shyness among Japanese people. The IAT has been used to measure implicit stereotypes, as well as self-concepts, such as implicit shyness and implicit self-esteem. We administered the shyness IAT and the self-esteem TAT to participants (N = 59) on two occasions over a one-week interval (Time 1 and Time 2) and examined the test-retest reliability by correlating shyness IATs between the two time points. We also assessed the criterion-related validity by calculating the correlation between implicit shyness and implicit self-esteem. The results indicated a sufficient positive correlation coefficient between the scores of implicit shyness over the one-week interval (r = .67, p < .01). Moreover, a strong negative correlation coefficient was indicated between implicit shyness and implicit self-esteem (r = .72, p < .01). These results confirmed the test-retest reliability and the criterion-related validity of the Japanese version of the shyness TAT, which is indicative of the validity of the test for assessing implicit shyness.", "paper_title": "Test-Retest Reliability and Criterion-Related Validity of the Implicit Association Test for Measuring Shyness", "paper_id": "WOS:000323236400011"}