{"auto_keywords": [{"score": 0.04972395969484309, "phrase": "saudi_arabian_web_servers"}, {"score": 0.00481495049065317, "phrase": "different_security_aspects"}, {"score": 0.00470862827326028, "phrase": "web_servers"}, {"score": 0.004673709383305897, "phrase": "country_level"}, {"score": 0.004621813738791474, "phrase": "overall_sense"}, {"score": 0.004553510708976456, "phrase": "secure_businesses"}, {"score": 0.004403480614319231, "phrase": "research_paper"}, {"score": 0.004290201740122912, "phrase": "possible_vulnerabilities"}, {"score": 0.004102719715406821, "phrase": "open_source_tools"}, {"score": 0.003997159878458409, "phrase": "financial"}, {"score": 0.003923398381490749, "phrase": "commercial_organizations"}, {"score": 0.0037518852820756323, "phrase": "appropriate_tool"}, {"score": 0.003724034990158436, "phrase": "proper_assessment"}, {"score": 0.0034437574674180365, "phrase": "first_security"}, {"score": 0.003405472159599445, "phrase": "burning_issue"}, {"score": 0.0031490944606172152, "phrase": "saudi_arabian_national_goals"}, {"score": 0.0028053842615436706, "phrase": "high_importance"}, {"score": 0.0027433143290371293, "phrase": "different_tools"}, {"score": 0.002276566401216226, "phrase": "\"_relationship"}, {"score": 0.0022013916728990564, "phrase": "vulnerable_organization_server"}], "paper_keywords": ["Vulnerability", " Assessment", " web server", " Saudi Arabia"], "paper_abstract": "Assessment of web servers on country level shows the overall sense of security for secure businesses, official and educational activities. In this research paper we decided to find out all possible vulnerabilities in Saudi Arabian web servers. To assess these vulnerabilities we selected number of open source tools and tested about 169 most popular web servers of government, Financial, Academic, and commercial organizations. The challenge of this work was the selection of an appropriate tool and proper assessment of the most popular web servers in every sector of the country. This assessment seemed to us interesting because of two reasons, first security is a burning issue of the world and it can be minimized by finding them out. Secondly it is in the interest of Saudi Arabian national goals. This way many unknown vulnerabilities can be known to the programmers easily. This problem was not addressed before for Saudi Arabian web servers according to our literature review, so that's why it carries high importance. The purpose of using different tools is to avoid false positive and false negative. We will analyze and enlist all the vulnerabilities found out by the tools with respect to their organizations. The vulnerabilities will be shown anonymously and with the level of severity. These will be followed by graphs showing the \"organization vs. vulnerabilities\" relationship. A graph on \"recommended patches vs. vulnerable organization server\" is also included for those organizations that are conscious about their Organization privacy and confidentiality.", "paper_title": "A Critical Survey of different Security aspects in Saudi Arabian Web Servers", "paper_id": "WOS:000360794500001"}