{"auto_keywords": [{"score": 0.04872654495804916, "phrase": "homology_computation"}, {"score": 0.013512371188249167, "phrase": "generalized_maps"}, {"score": 0.012705606671785984, "phrase": "simplicial_analog"}, {"score": 0.008731900990141022, "phrase": "boundary_operator"}, {"score": 0.00481495049065317, "phrase": "cellular_structures_allowing_multi-incidence"}, {"score": 0.004634459424542272, "phrase": "'cellular'_structures"}, {"score": 0.004397230847865867, "phrase": "combinatorial_maps"}, {"score": 0.003939565240409143, "phrase": "simplicial_homology"}, {"score": 0.003176899769744057, "phrase": "cellular_structure"}, {"score": 0.003043031131345537, "phrase": "incidence_numbers"}, {"score": 0.0022944576894161485, "phrase": "specific_conditions"}, {"score": 0.0022294857939412073, "phrase": "combinatorial_map"}], "paper_keywords": ["Homology computation", " Boundary operator", " Combinatorial maps"], "paper_abstract": "This paper focuses on homology computation over 'cellular' structures that allow multi-incidence between cells. We deal here with combinatorial maps, more precisely chains of maps and subclasses such as maps and generalized maps. Homology computation on such structures is usually achieved by computing simplicial homology on a simplicial analog. But such an approach is computationally expensive because it requires computing this simplicial analog and performing the homology computation on a structure containing many more cells (simplices) than the initial one. Our work aims at providing a way to compute homologies directly on a cellular structure. This is done through the computation of incidence numbers. Roughly speaking, if two cells are incident, then their incidence number characterizes how they are attached. Having these numbers naturally leads to the definition of a boundary operator, which induces a homology. Hence, we propose a boundary operator for chains of maps and provide optimization for maps and generalized maps. It is proved that, under specific conditions, the homology of a combinatorial map as defined in the paper is equivalent to the homology of its simplicial analogue.", "paper_title": "Homology of Cellular Structures Allowing Multi-incidence", "paper_id": "WOS:000355340300004"}