{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "transition_time"}, {"score": 0.02303293023404507, "phrase": "cmmi_levels"}, {"score": 0.00473320761888448, "phrase": "geographical_region_perspective"}, {"score": 0.004593467306126913, "phrase": "software_industry"}, {"score": 0.004476963405985556, "phrase": "software_process_improvement"}, {"score": 0.0044388150065567955, "phrase": "spi"}, {"score": 0.004382127278148236, "phrase": "numerous_studies"}, {"score": 0.004252707756312684, "phrase": "spi_standards"}, {"score": 0.004074397977869244, "phrase": "spi_success"}, {"score": 0.0038044630943383497, "phrase": "geographical_region"}, {"score": 0.0037238193456845124, "phrase": "capability_maturity_model_integration"}, {"score": 0.0035676056286816915, "phrase": "obvious_differences"}, {"score": 0.003522027550662857, "phrase": "organizations'_transition_time"}, {"score": 0.0034919658481055876, "phrase": "cmmi"}, {"score": 0.003316884515934182, "phrase": "geographical_region_impact"}, {"score": 0.0025099367332615794, "phrase": "five-point_scale"}, {"score": 0.002244969789802093, "phrase": "data_sets"}], "paper_keywords": ["SPI", " CMMI", " factors", " transition time", " empirical study"], "paper_abstract": "A software industry has been more concerned about Software Process Improvement (SPI). Numerous studies have been made in development of SPI standards and models, or to identify factors that affect SPI success. However, these studies did not provide answers to questions about the effect of Geographical Region on the transition time between Capability Maturity Model Integration (CMMI) levels. And why there are obvious differences in the organizations' transition time between CMMI levels. The objective of this research is to identify the geographical region impact on factors that can affect the transition time between CMMI levels. We conducted 18 interviews in 15 different software companies to extract the factors and compare these factors with what are in the literature to avoid redundancy, based on that we designed a questionnaire. We sent out of 236 requests to participants, 92 responded from 30 companies. We asked the participants to rank each factor on a five-point scale (high, medium, low, zero and not sure) to determine the effect of each factor. We identified 11 factors from both data sets that are considered effective factors for the transition time between CMMI levels. And also identified one new factor (turn over of staff) which was not identified in the literature.", "paper_title": "Identification of Factors that Affect the Transition Time between CMMI Levels from Geographical Region Perspective: An Empirical Study", "paper_id": "WOS:000316841900008"}