{"auto_keywords": [{"score": 0.0482620528308253, "phrase": "conjunctive_queries"}, {"score": 0.00812515614156614, "phrase": "sum_operator"}, {"score": 0.00481495049065317, "phrase": "conjunctive_aggregate_queries"}, {"score": 0.004747714939490445, "phrase": "aggregate_queries"}, {"score": 0.004551563730037998, "phrase": "aggregate_operators"}, {"score": 0.004272361887713488, "phrase": "unnested_sql_queries"}, {"score": 0.0038444185258456245, "phrase": "dense_order"}, {"score": 0.003724566354526513, "phrase": "discrete_order"}, {"score": 0.0033749889869455407, "phrase": "dominance_mappings"}, {"score": 0.0032582312803728698, "phrase": "containment_mappings"}, {"score": 0.0031901183059524804, "phrase": "count-distinct_operator"}, {"score": 0.0031565959573536194, "phrase": "sufficient_condition"}, {"score": 0.0030259817489390302, "phrase": "set_semantics"}, {"score": 0.002983652306921617, "phrase": "special_cases"}, {"score": 0.002761176640988626, "phrase": "bag-set_semantics"}, {"score": 0.002582400033640049, "phrase": "count_operator"}, {"score": 0.0023480317852018133, "phrase": "general_case"}, {"score": 0.0021049977753042253, "phrase": "polynomial_space"}], "paper_keywords": ["languages", " theory", " aggregation", " query equivalence", " datalog", " bag-set semantics"], "paper_abstract": "Equivalence of aggregate queries is investigated for the class of conjunctive queries with comparisons and the aggregate operators count, count-distinct, min, max, and sum. Essentially, this class contains unnested SQL queries with the above aggregate operators, with a where clause consisting of a conjunction of comparisons, and without a having clause. The comparisons are either interpreted over a domain with a dense order (like the rationals) or with a discrete order (like the integers). Characterizations of equivalence differ for the two cases. For queries with either max or min, equivalence is characterized in terms of dominance mappings, which can be viewed as a generalization of containment mappings. For queries with the count-distinct operator, a sufficient condition for equivalence is given in terms of equivalence of conjunctive queries under set semantics. For some special cases, it is shown that this condition is also necessary. For conjunctive queries with comparisons but without aggregation, equivalence under bag-set semantics is characterized in terms of isomorphism. This characterization essentially remains the same also for queries with the count operator. Moreover, this characterization also applies to queries with the sum operator if the queries have either constants or comparisons, but not both. In the general case (i.e., both comparisons andconstants), the characterization of the equivalence of queries with the sum operator is more elaborate. All the characterizations given in the paper are decidable in polynomial space.", "paper_title": "Deciding equivalences among conjunctive aggregate queries", "paper_id": "WOS:000245893400001"}