{"auto_keywords": [{"score": 0.048734215142491676, "phrase": "case_study"}, {"score": 0.015719716506582538, "phrase": "service_delivery"}, {"score": 0.004760394308239882, "phrase": "integrated_quality_initiatives"}, {"score": 0.004574247691703376, "phrase": "highly_reliable_information_technology"}, {"score": 0.0043703658695579085, "phrase": "multiple_service_delivery_quality_standards"}, {"score": 0.0036207206487324506, "phrase": "business_context"}, {"score": 0.003559284776569813, "phrase": "service_provider"}, {"score": 0.0033619033669956317, "phrase": "multiple_standards"}, {"score": 0.002784755056588371, "phrase": "evidentiary_data"}, {"score": 0.0024281181691350085, "phrase": "service_providers_standard"}, {"score": 0.002373276186210053, "phrase": "unique_value"}, {"score": 0.002216054733102974, "phrase": "initial_examples"}], "paper_keywords": [""], "paper_abstract": "Providers of highly reliable information technology (IT) services have historically adopted multiple service delivery quality standards and have obtained certificates of registration or certification associated with these standards. In this paper, we present a case study involving a provider of IT infrastructure services and solutions. We describe the business context of the service provider, its approach to the analysis of the requirements of multiple standards, process integration efforts (both local and global), and the reuse of documentation and other evidentiary data in the context of obtaining certificates of registration or certifications. We compare the evidentiary data (e.g., documentation, observations, and interviews) used in the diagnostics of the International Standards Organization 9001:2000 standard and the eSourcing Capability Model for Service Providers standard to evaluate the unique value that each standard contributes to IT service delivery. The case study also provides initial examples of measures resulting from the adoption of these two quality standards that may be used to improve service delivery.", "paper_title": "Improving service delivery through integrated quality initiatives: A case study", "paper_id": "WOS:000253658800015"}