{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "price_discrimination"}, {"score": 0.004635008910530911, "phrase": "standard_economic_practice"}, {"score": 0.00454090611248773, "phrase": "pricing_effectiveness"}, {"score": 0.004501160823792861, "phrase": "diverse_population"}, {"score": 0.004474856549909555, "phrase": "prospective_buyers"}, {"score": 0.004371160978838441, "phrase": "different_buyers"}, {"score": 0.004345613093011898, "phrase": "different_prices"}, {"score": 0.004207734323806386, "phrase": "pareto_efficiency"}, {"score": 0.0038196965522221626, "phrase": "open_process"}, {"score": 0.0037862398004482253, "phrase": "internet_commerce"}, {"score": 0.003367077034382727, "phrase": "relatively_low_price"}, {"score": 0.0032889671598112023, "phrase": "perfect_price_discrimination_markets"}, {"score": 0.003147346669933341, "phrase": "standard_cryptographic_techniques"}, {"score": 0.0030924155541434957, "phrase": "\"fair_solution"}, {"score": 0.0030206579994328975, "phrase": "efficient_cryptographic_protocols"}, {"score": 0.002967931416941965, "phrase": "secure_function_evaluation_protocols"}, {"score": 0.0027741761880779535, "phrase": "total_revenue"}, {"score": 0.002623669616798891, "phrase": "\"fair\"_discount"}, {"score": 0.0025778546800417808, "phrase": "accumulated_suggested_payments"}, {"score": 0.002540285736232122, "phrase": "seller's_expected_revenue"}, {"score": 0.0023192471808039746, "phrase": "potential_future_use"}, {"score": 0.002232364384065567, "phrase": "current_e-market_instance"}, {"score": 0.0021613897794439227, "phrase": "\"robust_distributed_summation"}, {"score": 0.0021236300589450143, "phrase": "independent_interest"}, {"score": 0.0021049977753042253, "phrase": "protocol_construction"}], "paper_keywords": [""], "paper_abstract": "Perfect (or \"first degree\") Price Discrimination is a standard economic practice that is used to increase the pricing effectiveness over a diverse population of prospective buyers. It is done by selling to different buyers at different prices based on their respective willingness to pay. While the strategy achieves Pareto efficiency, there are a number of problems in realizing and giving incentive to buyers to participate (and stay) in a market with price discrimination. This is especially true in an open process (like Internet commerce), where parties may learn about their price's individual standing (within the group of buyers) and may withdraw due to being relatively \"over-charged\" or may \"resell\" due to getting the goods at a relatively low price. We investigate the difficulties of realizing perfect price discrimination markets when full information is available to the participants even under the assumption of using standard cryptographic techniques. We then propose a \"fair solution\" for price discrimination in e-markets: using efficient cryptographic protocols (much more efficient than secure function evaluation protocols) we give incentives to users to stay in a market that utilizes price discrimination. Our protocols assure that the seller obtains the total revenue it expects and no buyer learns the price of other buyers. In addition, each buyer gets a \"fair\" discount off the surplus (the accumulated suggested payments by buyers minus the seller's expected revenue) when applicable and the seller may get part of the surplus as well. Further, the seller gets to learn the market \"willingness to pay\" (for potential future use), while this knowledge does not affect the pricing of the current e-market instance. Along the way we investigate the cryptographic primitive of \"robust distributed summation\" that may be of independent interest as a protocol construction.", "paper_title": "Efficient cryptographic protocols realizing e-markets with price discrimination", "paper_id": "WOS:000241687500025"}