{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "location-aware_mobile_museum_guide"}, {"score": 0.029981902077373668, "phrase": "content_items"}, {"score": 0.004613825044585923, "phrase": "research_attention"}, {"score": 0.00447282529270722, "phrase": "novel_mobile_technologies"}, {"score": 0.00436989807912238, "phrase": "main_benefit"}, {"score": 0.004319322238010043, "phrase": "novel_technologies"}, {"score": 0.003996727479807572, "phrase": "fundamental_issue"}, {"score": 0.0037125240439927114, "phrase": "user_requests"}, {"score": 0.003488874535154583, "phrase": "mobile_visitors'_guides"}, {"score": 0.0033952989364738353, "phrase": "better_service"}, {"score": 0.003228101865545105, "phrase": "user's_hand"}, {"score": 0.003093054709625219, "phrase": "key_issue"}, {"score": 0.003045355729156972, "phrase": "vast_amount"}, {"score": 0.002440192402613492, "phrase": "visitor_behavior"}, {"score": 0.0023471384232499016, "phrase": "controlled_user_study"}, {"score": 0.002319918823705175, "phrase": "actual_museum_visitors"}, {"score": 0.00227525089435209, "phrase": "behavior_patterns"}, {"score": 0.002137999646917136, "phrase": "british_informatics_society_limited"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Amount of information", " Choice", " Context-aware computing", " Cultural heritage", " Mobile guide", " Proactiveness"], "paper_abstract": "Cultural heritage is an area that has recently drawn research attention, especially for exploring ways to harness novel mobile technologies for supporting visitors. The main benefit of these novel technologies is their ability to provide personalized, context-aware information services to their users. However, the use of context-awareness is connected to a fundamental issue of proactiveness - should the system keep the user in control all the time and only respond to user requests, or should the system take initiative and propose its services when needed? Proactiveness of mobile visitors' guides brings with it a possibility for better service to the user at the cost of taking control out of the user's hand. The amount of choice given to visitors is another key issue. With the vast amount of information available for each exhibit, adaptation of the amount of information by limiting the number of content items, could be warranted to filter the information according to the visitors needs. However, it is not clear how reducing choice in terms of the number of content items that are presented to the visitor affects visitor behavior and satisfaction. We examined these issues in a controlled user study conducted with actual museum visitors: comparing usage, behavior patterns, and attitudes of visitors using three versions of a location-aware mobile museum guide. (C) 2011 British Informatics Society Limited. Published by Elsevier B.V. All rights reserved.", "paper_title": "Examining proactiveness and choice in a location-aware mobile museum guide", "paper_id": "WOS:000297871400015"}