{"auto_keywords": [{"score": 0.03596176205294267, "phrase": "interworking_function"}, {"score": 0.00481495049065317, "phrase": "converged_voip_network"}, {"score": 0.004753194996637899, "phrase": "traditional_circuit-switched_telecommunication_network"}, {"score": 0.004692227830462433, "phrase": "packet-switched_data_network"}, {"score": 0.004592340708764929, "phrase": "single_packet-switched_network"}, {"score": 0.004456044928556639, "phrase": "converged_network"}, {"score": 0.004417848254181138, "phrase": "telephony_communications"}, {"score": 0.004088436819609392, "phrase": "sip"}, {"score": 0.004053363044398712, "phrase": "mgcp"}, {"score": 0.003933000051147382, "phrase": "voip_communications"}, {"score": 0.0038326698261576023, "phrase": "different_voip_protocols"}, {"score": 0.003296212583539166, "phrase": "half-call_model"}, {"score": 0.0027150087516999047, "phrase": "callee_fsm"}, {"score": 0.002680114113899346, "phrase": "voip_protocol"}, {"score": 0.0026456667695073043, "phrase": "development_effort"}, {"score": 0.0022848092812445533, "phrase": "integrated_call_agent"}, {"score": 0.0022168460543913787, "phrase": "half-call_fsms"}, {"score": 0.0021049977753042253, "phrase": "voip_protocols"}], "paper_keywords": ["SIP", " IN", " H.323", " MGCP", " inter-operation", " VoIP"], "paper_abstract": "The traditional circuit-switched telecommunication network and the packet-switched data network are converging to a single packet-switched network. One important application of the converged network is telephony communications, also referred to as VoIP (Voice over IP). Call signaling protocols, such as H.323, SIP and MGCP, have been developed to support VoIP communications. To enable devices using different VoIP protocols to communicate, gateways are needed to translate messages of one protocol to messages of another. In this paper, we present a simple, flexible framework for this interworking function. The framework is based on a half-call model where a call is controlled by two half-call finite state machines (FSMs), one representing the state of the caller and the other representing the state of the callee. The interworking function has been implemented such that the caller FSM of one VoIP protocol can interact with the callee FSM of any VoIP protocol. The development effort of the interworking function is minimized since only two half-call FSMs for each VoIP protocol are needed and they can be developed independently as long as the design conforms to the same interface specification. We have developed an integrated call agent (ICA) that contains the half-call FSMs of H.323, SIP and MGCP. Calls between devices using these VoIP protocols can be set up, maintained and terminated by the ICAs.", "paper_title": "An integrated call agent of the converged VoIP network", "paper_id": "WOS:000246776000009"}