{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "complex_vascular_structures"}, {"score": 0.004759507166427077, "phrase": "non-parametric_vessel_detection_method"}, {"score": 0.004650519511749445, "phrase": "vascular_structures"}, {"score": 0.004388796812234033, "phrase": "recent_work"}, {"score": 0.0042552618754756934, "phrase": "vessel_detection"}, {"score": 0.004190019394361629, "phrase": "intensity_profile"}, {"score": 0.004094018760244776, "phrase": "angiographic_image"}, {"score": 0.0036318365746264127, "phrase": "branch_points"}, {"score": 0.003548579306515579, "phrase": "standard_hessian_based_techniques"}, {"score": 0.003427246079774314, "phrase": "long_cylindrical_structures"}, {"score": 0.002802941205762953, "phrase": "visualization_techniques"}, {"score": 0.0027706013216537042, "phrase": "shape_cues"}, {"score": 0.002728059572916527, "phrase": "depth_cues"}, {"score": 0.0024574537875026634, "phrase": "clinical_neurovascular_x-ray"}, {"score": 0.0024479627964740748, "phrase": "computed_tomography_based_angiography_images"}, {"score": 0.0023368833197343953, "phrase": "formal_user_evaluation"}, {"score": 0.002171202123281881, "phrase": "distance_color_blending"}, {"score": 0.0021049977753042253, "phrase": "standard_visualization_techniques"}], "paper_keywords": ["Vessel identification", " Vessel visualization", " Evaluation of visualization techniques"], "paper_abstract": "The effective visualization of vascular structures is critical for diagnosis, surgical planning as well as treatment evaluation. In recent work, we have developed an algorithm for vessel detection that examines the intensity profile around each voxel in an angiographic image and determines the likelihood that any given voxel belongs to a vessel; we term this the \"vesselness coefficient\" of the voxel. Our results show that our algorithm works particularly well for visualizing branch points in vessels. Compared to standard Hessian based techniques, which are fine-tuned to identify long cylindrical structures, our technique identifies branches and connections with other vessels. Using our computed vesselness coefficient, we explore a set of techniques for visualizing vasculature. Visualizing vessels is particularly challenging because not only is their position in space important for clinicians but it is also important to be able to resolve their spatial relationship. We applied visualization techniques that provide shape cues as well as depth cues to allow the viewer to differentiate between vessels that are closer from those that are farther. We use our computed vesselness coefficient to effectively visualize vasculature in both clinical neurovascular x-ray computed tomography based angiography images, as well as images from three different animal studies. We conducted a formal user evaluation of our visualization techniques with the help of radiologists, surgeons, and other expert users. Results indicate that experts preferred distance color blending and tone shading for conveying depth over standard visualization techniques.", "paper_title": "Effective Visualization of Complex Vascular Structures Using a Non-Parametric Vessel Detection Method", "paper_id": "WOS:000260384700061"}