{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "statistical_queries"}, {"score": 0.009352228395342818, "phrase": "privacy-preserving_data_analysis"}, {"score": 0.004684157900507474, "phrase": "small_error"}, {"score": 0.0044483793824152944, "phrase": "trivial_solution"}, {"score": 0.004327826229670384, "phrase": "c."}, {"score": 0.004095468830028361, "phrase": "naive_approach"}, {"score": 0.003757480190200645, "phrase": "agnostic_learning_complexity"}, {"score": 0.0033767221949228834, "phrase": "arbitrary_error"}, {"score": 0.0033419808453225516, "phrase": "small_fraction"}, {"score": 0.0031845067058084583, "phrase": "submodular_function"}, {"score": 0.003097865379563127, "phrase": "graph_cuts"}, {"score": 0.00307657476125683, "phrase": "boolean_disjunctions"}, {"score": 0.0029518598926717332, "phrase": "learning_theoretic_point"}, {"score": 0.00271735110571002, "phrase": "differentially_private_answers"}, {"score": 0.0026893753781434618, "phrase": "boolean_conjunctions"}, {"score": 0.0026342827320931937, "phrase": "significant_progress"}, {"score": 0.0026071599759743833, "phrase": "key_open_problem"}, {"score": 0.002492810341589618, "phrase": "unconditional_lower_bounds"}, {"score": 0.002467140591777737, "phrase": "differentially_private_algorithm"}, {"score": 0.0022476609946536345, "phrase": "lower_bounds"}, {"score": 0.0021864526544323163, "phrase": "agnostic_learning"}, {"score": 0.002163930783583212, "phrase": "sq_model"}, {"score": 0.0021416404045850224, "phrase": "new_barrier"}, {"score": 0.0021049977753042253, "phrase": "differentially_private_algorithms"}], "paper_keywords": ["differential privacy", " agnostic learning", " SQ learning"], "paper_abstract": "Suppose we would like to know all answers to a set of statistical queries C on a data set up to small error, but we can access the data itself only by using statistical queries. A trivial solution is to exhaustively ask all queries in C. In this paper, we investigate how and when we can do better than this naive approach. We show that the number of statistical queries necessary and sufficient for this task is-up to polynomial factors-equal to the agnostic learning complexity of C in Kearns' statistical query (SQ) model. This gives a complete answer to the question when run-time is not a concern. We then show that the problem can be solved efficiently (allowing arbitrary error on a small fraction of queries) whenever the answers to C can be described by a submodular function. This includes many natural concept classes, such as graph cuts and Boolean disjunctions and conjunctions. These results are interesting not only from a learning theoretic point of view, but also from the perspective of privacy-preserving data analysis. In this context, our second result leads to an algorithm that efficiently releases differentially private answers to all Boolean conjunctions with 1% average error. This presents significant progress on a key open problem in privacy-preserving data analysis. Our first result, on the other hand, gives unconditional lower bounds on any differentially private algorithm that admits a (potentially non-privacy-preserving) implementation using only statistical queries. Not only our algorithms but also most known private algorithms can be implemented using only statistical queries and hence are constrained by these lower bounds. Our result therefore isolates the complexity of agnostic learning in the SQ model as a new barrier in the design of differentially private algorithms.", "paper_title": "PRIVATELY RELEASING CONJUNCTIONS AND THE STATISTICAL QUERY BARRIER", "paper_id": "WOS:000323889100003"}