{"auto_keywords": [{"score": 0.0441801944248355, "phrase": "annotation_process"}, {"score": 0.015719716506582538, "phrase": "tag_recommendation_system"}, {"score": 0.015404932087209616, "phrase": "collaborative_tagging_systems"}, {"score": 0.009503180373774445, "phrase": "tag_recommendation"}, {"score": 0.004756233569671719, "phrase": "real-world_folksonomy"}, {"score": 0.004621984064678252, "phrase": "successful_solution"}, {"score": 0.004509919457793852, "phrase": "online_sharing_platforms"}, {"score": 0.003908091457759849, "phrase": "annotation_quality"}, {"score": 0.003400198866111204, "phrase": "empirical_and_quantitative_result"}, {"score": 0.0031199418866663543, "phrase": "freesound"}, {"score": 0.0028627183712016894, "phrase": "vocabulary_sharing"}, {"score": 0.002573362191631126, "phrase": "partial_increase"}, {"score": 0.0022111720236287547, "phrase": "tag_recommendation_systems"}, {"score": 0.0021751997984619585, "phrase": "future_directions"}], "paper_keywords": ["Measurement", " Experimentation", " Verification", " Folksonomy", " Freesound", " tag recommendation", " tagging systems"], "paper_abstract": "Collaborative tagging systems have emerged as a successful solution for annotating contributed resources to online sharing platforms, facilitating searching, browsing, and organizing their contents. To aid users in the annotation process, several tag recommendation methods have been proposed. It has been repeatedly hypothesized that these methods should contribute to improving annotation quality and reducing the cost of the annotation process. It has been also hypothesized that these methods should contribute to the consolidation of the vocabulary of collaborative tagging systems. However, to date, no empirical and quantitative result supports these hypotheses. In this work, we deeply analyze the impact of a tag recommendation system in the folksonomy of Freesound, a real-world and large-scale online sound sharing platform. Our results suggest that tag recommendation effectively increases vocabulary sharing among users of the platform. In addition, tag recommendation is shown to contribute to the convergence of the vocabulary as well as to a partial increase in the quality of annotations. However, according to our analysis, the cost of the annotation process does not seem to be effectively reduced. Our work is relevant to increase our understanding about the nature of tag recommendation systems and points to future directions for the further development of those systems and their analysis.", "paper_title": "Analysis of the Impact of a Tag Recommendation System in a Real-World Folksonomy", "paper_id": "WOS:000363900100006"}