{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "individual_differences"}, {"score": 0.0038927410798100916, "phrase": "creative_environment"}, {"score": 0.0034906177145305403, "phrase": "thesis_work"}, {"score": 0.00342622379167706, "phrase": "web-based_questionnaire"}, {"score": 0.003398990087799058, "phrase": "six_scales"}, {"score": 0.0033097596691947593, "phrase": "principal_components_analysis"}, {"score": 0.0031718222834860492, "phrase": "digital_environments"}, {"score": 0.002920667101566582, "phrase": "selected_characteristics"}, {"score": 0.0027109088385695646, "phrase": "perceived_level"}, {"score": 0.0026750651386622964, "phrase": "work_environments"}, {"score": 0.002597864079479344, "phrase": "extraverted_people"}, {"score": 0.0024631476037838937, "phrase": "external_locus"}, {"score": 0.002298381568771641, "phrase": "person's_likelihood"}, {"score": 0.002161818518113509, "phrase": "fertile_environment"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Serendipity", " Scale development", " Digital environments", " Individual differences"], "paper_abstract": "Under what conditions is serendipity most likely to occur? How much is serendipity influenced by what a person brings to the process, and how much by the environment in which the person is immersed? This study assessed (a) selected human characteristics that may influence the ability to experience serendipity (openness to experience, extraversion, and locus of control) and (b) selected perceptions of the environment in which people are immersed, including the creative environment, and selected characteristics (trigger rich, highlights triggers, enables connections, and leads to the unexpected). Finally, the study examined the relationships among these internal people-based and external, environmental, variables. Professionals, academics, and students engaged in thesis work (N=289) responded to a web-based questionnaire that integrated six scales to measure these variables. Results were analysed using principal components analysis, multivariate analysis of variance, and multiple regression. We found some types of digital environments, (e.g., websites, databases, search engines, intranets, social media sites) may be more conducive to serendipity than others, while environments that manifest selected characteristics (trigger-rich, enable connections, and lead to the unexpected) are perceived more likely to foster serendipity than others. However, the perceived level of creativity expected in work environments was not associated with serendipity. In addition, while extraverted people may be more likely to experience serendipity in general, those who are open to experience or have an external locus of control are no more likely to experience serendipity than their counterparts. Notable from our findings was a failure in identifying individual differences that may influence a person's likelihood to experience serendipity, in contrast with our success in identifying how the environment in which the user is immersed may create a fertile environment for serendipity to occur. (C) 2015 Elsevier Ltd. All rights reserved.", "paper_title": "Examination of relationships among serendipity, the environment, and individual differences", "paper_id": "WOS:000357240200005"}