{"auto_keywords": [{"score": 0.040305554680080104, "phrase": "temperature-dependent_solubility"}, {"score": 0.03990773469805954, "phrase": "unseeded_crystallization"}, {"score": 0.039123356853520606, "phrase": "comprehensive_kinetic_model"}, {"score": 0.03784882514794953, "phrase": "situ_attenuated_total_reflectance_ultraviolet-visible_spectroscopy"}, {"score": 0.032700089433105095, "phrase": "dissolved_and_undissolved_components"}, {"score": 0.029485976368366532, "phrase": "offline_high-performance_liquid_chromatography_measurements"}, {"score": 0.00481495049065317, "phrase": "kinetic_modeling"}, {"score": 0.0047820521205253035, "phrase": "batch_reactions"}, {"score": 0.004716924994370903, "phrase": "situ_spectroscopy"}, {"score": 0.004605069682942661, "phrase": "helpful_method"}, {"score": 0.004542341892683877, "phrase": "complete_understanding"}, {"score": 0.004511297689862029, "phrase": "reaction_systems"}, {"score": 0.004241235563017201, "phrase": "crystallization_processes"}, {"score": 0.0036469533983843755, "phrase": "slurry_reaction"}, {"score": 0.003463944293093155, "phrase": "dissolved_fraction"}, {"score": 0.0033701115914053083, "phrase": "partial_molar_volume"}, {"score": 0.003335581163845351, "phrase": "dissolved_species"}, {"score": 0.0032563753253986912, "phrase": "reagent_addition"}, {"score": 0.0031464653712924436, "phrase": "comprehensive_model"}, {"score": 0.0031142192800817396, "phrase": "concentration_profiles"}, {"score": 0.0027144744718498102, "phrase": "john_wiley"}, {"score": 0.0025959133277517824, "phrase": "batch_reaction_process"}, {"score": 0.002390436017272046, "phrase": "cooling_step"}, {"score": 0.0023416540209862803, "phrase": "time-dependent_concentration_profiles"}], "paper_keywords": ["batch process monitoring", " batch process modeling", " slurries", " kinetic modeling", " crystallization and dissolution"], "paper_abstract": "Kinetic modeling of batch reactions monitored by in situ spectroscopy has been shown to be a helpful method for developing a complete understanding of reaction systems. Much work has been carried out to demonstrate the ability to model dissolution, reaction, and crystallization processes separately; however, little has been performed in terms of combining all of these into one comprehensive kinetic model. This paper demonstrates the integration of models of dissolution, temperature-dependent solubility, and unseeded crystallization driven by cooling into a comprehensive kinetic model describing the evolution of a slurry reaction monitored by in situ attenuated total reflectance ultraviolet-visible spectroscopy. The model estimates changes in the volume of the dissolved fraction of the slurry by use of the partial molar volume of the dissolved species that change during the course of reagent addition, dissolution, reaction, and crystallization. The comprehensive model accurately estimates concentration profiles of dissolved and undissolved components of the slurry and, thereby, the degree of undersaturation and supersaturation necessary for estimation of the rates of dissolution and crystallization. Results were validated across two subsequent batches via offline high-performance liquid chromatography measurements. Copyright (c) 2014 John Wiley & Sons, Ltd. This paper demonstrates a comprehensive kinetic model for monitoring a batch reaction process in a slurry by in situ attenuated total reflectance ultraviolet-visible spectroscopy. The model includes rates of reaction, dissolution, temperature-dependent solubility, and unseeded crystallization driven by a cooling step. The model accurately estimates time-dependent concentration profiles of dissolved and undissolved components in the slurry and, thereby, the degree of undersaturation and supersaturation necessary for estimation of the rates of dissolution and crystallization. Results were validated across two batches and offline high-performance liquid chromatography measurements.", "paper_title": "Comprehensive kinetic model for the dissolution, reaction, and crystallization processes involved in the synthesis of aspirin", "paper_id": "WOS:000335520900010"}