{"auto_keywords": [{"score": 0.04451121157644393, "phrase": "compliant_mechanisms"}, {"score": 0.015719716506582538, "phrase": "electro-thermal_compliant_mechanisms"}, {"score": 0.004762550320451225, "phrase": "evolutionary_topology_optimization_method"}, {"score": 0.0046340196745259694, "phrase": "evolutionary_topology_optimization_procedure"}, {"score": 0.004571055044692412, "phrase": "compliant_electro-thermal_mechanisms"}, {"score": 0.004508942069742167, "phrase": "adopted_methodology"}, {"score": 0.004447669334871974, "phrase": "evolutionary_structural_optimization"}, {"score": 0.004222299135545249, "phrase": "directly_applied_input_loads"}, {"score": 0.004199247711875386, "phrase": "simple_thermal_loads"}, {"score": 0.004041359131062721, "phrase": "additive_version"}, {"score": 0.0039322149318145845, "phrase": "electro-thermal_actuators"}, {"score": 0.003868142906199082, "phrase": "joule's_resistive_heating"}, {"score": 0.0038470175104007524, "phrase": "findings_-_examples"}, {"score": 0.003373101013123386, "phrase": "electro-thermal_actuation"}, {"score": 0.0032372917632693403, "phrase": "evolutionary_method"}, {"score": 0.0030730639262332698, "phrase": "classic_element_rejection"}, {"score": 0.002989991779830814, "phrase": "improved_bi-directional_algorithm"}, {"score": 0.002877438939246423, "phrase": "future_works"}, {"score": 0.002861708609922034, "phrase": "practical_implications"}, {"score": 0.002853875630172469, "phrase": "-_electro-thermal_actuators"}, {"score": 0.0028150302583265655, "phrase": "microelectromechanical_systems_applications"}, {"score": 0.0027389142053945246, "phrase": "typical_assembly_processes"}, {"score": 0.0026942333853202556, "phrase": "crucial_role"}, {"score": 0.0026575551838540676, "phrase": "proposed_methodology"}, {"score": 0.0026070408483940535, "phrase": "complex_and_efficient_actuators"}, {"score": 0.002564505790176378, "phrase": "topology_optimization_procedure"}, {"score": 0.002522662955545598, "phrase": "systematic_design"}, {"score": 0.0024410093024417527, "phrase": "manufacturing_time"}, {"score": 0.0024011766029754006, "phrase": "eso_method"}, {"score": 0.002273025527678093, "phrase": "electro-thermal_actuators_design"}], "paper_keywords": ["Topology", " Optimization", " Evolutionary method", " Electro-thermal actuator", " Compliant mechanisms", " Optimization techniques"], "paper_abstract": "Purpose - This paper aims to show an evolutionary topology optimization procedure for the design of compliant electro-thermal mechanisms. Design/methodology/approach - The adopted methodology is based in the evolutionary structural optimization (ESO) method. This approach has been successfully applied by this group for compliant mechanisms optimization under directly applied input loads and simple thermal loads. This work proposes an extension of this procedure, based on an additive version of the method, to solve the more complicated case of electro-thermal actuators optimum design, based on Joule's resistive heating. Findings - Examples solved for the design of plane compliant mechanisms are presented to check the validity of this technique. The designs obtained are compared favorably with results obtained by other authors to illustrate and validate the method, showing the viability of this technique for the optimization of compliant mechanisms under electro-thermal actuation. Research limitations/implications - This investigation is based on and additive version of the evolutionary method. Since this approach does not have the capability to remove material it could be combined with the classic element rejection evolutionary method to overcome these deficiencies, developing an improved bi-directional algorithm, which should be analyzed and applied for these types of designs in future works. Practical implications - Electro-thermal actuators have widespread use in MicroElectroMechanical Systems applications. Since these elements cannot be manufactured using typical assembly processes compliant mechanisms optimization play a crucial role for their successful design. The proposed methodology could help engineers to rapidly conceive complex and efficient actuators. Social implications - The topology optimization procedure developed in this paper enables systematic design of these devices, which can result in a save of manufacturing time and cost Originality/value - Most applications of the ESO method have considered maximum stiffness structure design, and even if it has been successfully applied to some other optimum material distribution problems, electro-thermal actuators design has not been considered yet. This paper shows that this methodology could be useful also in the design of electro-thermal compliant mechanisms, and provides engineers with a very simple and practical alternative design tool.", "paper_title": "Electro-thermal compliant mechanisms design by an evolutionary topology optimization method", "paper_id": "WOS:000325954000005"}