{"auto_keywords": [{"score": 0.05007852962010534, "phrase": "grounded_theory"}, {"score": 0.008647009132216384, "phrase": "phd_research"}, {"score": 0.006020812639666058, "phrase": "research_design"}, {"score": 0.004741167616693272, "phrase": "knowledge_management_a_model_four-stage_research_design"}, {"score": 0.004491678520807451, "phrase": "grounded_theory_principles"}, {"score": 0.0035899674590142653, "phrase": "typically_time-limited_phd_research_project"}, {"score": 0.003284550970221379, "phrase": "ongoing_phd_research"}, {"score": 0.0032341432727280707, "phrase": "main_guiding_principles"}, {"score": 0.00317221667574882, "phrase": "simplified_four-stage_model"}, {"score": 0.003075583447856341, "phrase": "proposed_model_four-stage_research_design"}, {"score": 0.00297037471252423, "phrase": "primary_focus"}, {"score": 0.0028576796380512157, "phrase": "core_categories"}, {"score": 0.0026551731045904854, "phrase": "grey_areas"}, {"score": 0.002624533657819515, "phrase": "emerging_theory"}, {"score": 0.002364172626241202, "phrase": "new_phd_researchers"}, {"score": 0.00230098581403254, "phrase": "clear_understanding"}, {"score": 0.0021049977753042253, "phrase": "iterative_and_non-linear_nature"}], "paper_keywords": ["Quality research", " Knowledge management", " Research"], "paper_abstract": "Purpose - New PhD researchers sometimes face challenges when attempting to follow Grounded Theory principles to conduct their studies. These challenges may lead them to change its features or even prevent them from using the approach at all. This paper seeks to argue that, although challenging to implement, Grounded Theory is congruent with the nature of PhD research. It aims to provide an example of the application of Grounded Theory in a typically time-limited PhD research project without the need to change any of its key features and principles. Design/methodology/approach - The paper presents and discusses the research design adopted in ongoing PhD research which integrates the main guiding principles of Grounded Theory in a simplified four-stage model of theory development. Findings - The proposed model four-stage research design includes: an uncertainty stage, where the primary focus is formed; an emergence stage, where the core categories, which are the foundations of the theory, emerge; an ambiguity resolution stage, where the grey areas in the emerging theory are clarified; and a maturity stage, when relationships between categories are defined and the theory is refined. Originality/value - This research design can help new PhD researchers unfamiliar with Grounded Theory to develop a clear understanding of the process by simplifying and clarifying its main guiding principles, as well as guiding them to a clear, phased approach that takes into account the iterative and non-linear nature of this methodology. It also places boundaries on the issues that should be dealt with within each of the phases of research adopting this methodology.", "paper_title": "The use of Grounded Theory in PhD research in knowledge management A model four-stage research design", "paper_id": "WOS:000291912000005"}