{"auto_keywords": [{"score": 0.03966491746115421, "phrase": "half-_duplex_capabilities"}, {"score": 0.028627712897038016, "phrase": "hda"}, {"score": 0.009997281970952744, "phrase": "sufficient_conditions"}, {"score": 0.00481495049065317, "phrase": "half-duplex_stations"}, {"score": 0.004771565380401739, "phrase": "ieee"}, {"score": 0.0047283116134926645, "phrase": "recent_ieee_standard"}, {"score": 0.004706895428234964, "phrase": "broadband_wireless_access_networks"}, {"score": 0.004387027668937774, "phrase": "subscriber_stations"}, {"score": 0.0041167628526081424, "phrase": "negotiated_qos_guarantees"}, {"score": 0.003845570815312373, "phrase": "separate_frequency_channels"}, {"score": 0.0036914757355166966, "phrase": "single_radio_transceiver"}, {"score": 0.003608541793018122, "phrase": "uplink_direction"}, {"score": 0.003559675269411366, "phrase": "downlink_direction"}, {"score": 0.0033099773890926643, "phrase": "bandwidth_grants"}, {"score": 0.0032503301334579717, "phrase": "qos_requirements"}, {"score": 0.003015401937358271, "phrase": "scheduled_grants"}, {"score": 0.002947611960613497, "phrase": "half-_duplex_ss"}, {"score": 0.002855251306715901, "phrase": "grant_allocation_algorithm"}, {"score": 0.0027469703311742647, "phrase": "feasible_grant_allocation"}, {"score": 0.0026790983342162887, "phrase": "computation_complexity"}, {"score": 0.002468450551616404, "phrase": "pipeline_approach"}, {"score": 0.0023108417343022537, "phrase": "extensive_simulations"}, {"score": 0.0022333012657436307, "phrase": "real-_time"}, {"score": 0.0022231606165229235, "phrase": "non-_real-_time"}, {"score": 0.0021682027434117095, "phrase": "full-_duplex_sss"}, {"score": 0.002148555958471822, "phrase": "alternative_approach"}, {"score": 0.002124247104243502, "phrase": "static_partitioning"}, {"score": 0.0021146005828352934, "phrase": "half-_duplex_sss"}, {"score": 0.0021049977753042253, "phrase": "separate_groups"}], "paper_keywords": ["IEEE 802.16", " broadband wireless access", " quality of service", " bandwidth allocation", " half-duplex transmission"], "paper_abstract": "IEEE 802.16 is a recent IEEE standard for broadband wireless access networks. In IEEE 802.16 networks, the Medium Access Control ( MAC) protocol is centralized and explicitly supports quality of service ( QoS). That is to say, access to the medium by a number of Subscriber Stations ( SSs) is centrally controlled by one Base Station ( BS), which is responsible for allocating bandwidth to several MAC connections in order to provide them with the negotiated QoS guarantees. However, although the network can be operated in Frequency Division Duplex ( FDD) mode ( that is, transmissions from the BS ( downlink) and SSs ( uplink) occur on separate frequency channels), the standard supports SSs with half- duplex capabilities. This means that they are equipped with a single radio transceiver which can be used either to transmit in the uplink direction or to receive in the downlink direction. This may severely hamper the capacity to support QoS. Therefore, in order to allocate bandwidth, an IEEE 802.16 BS has to solve two related issues: 1) how it can schedule bandwidth grants to SSs in order to meet the QoS requirements of their connections and 2) how it can coordinate the uplink and downlink scheduled grants so as to support half- duplex capabilities. In this paper, we derive sufficient conditions for a set of scheduled grants to be allocated so that the transmission of each half- duplex SS does not overlap with its reception. Based on this, we propose a grant allocation algorithm, namely, the Half- Duplex Allocation ( HDA) algorithm, which always produces a feasible grant allocation provided that the sufficient conditions are met. HDA has a computation complexity of O(n), where n is the number of grants to be allocated. Finally, we show that the definition of HDA allows us to address the two issues mentioned above by following a pipeline approach. This is when scheduling and allocation are implemented by separate and independently running algorithms, which are just loosely coupled with each other. We show via extensive simulations that the performance of SSs with half- duplex capabilities, in terms of the delay of real- time and non- real- time interactive traffic, using HDA almost perfectly matches that of full- duplex SSs, whereas an alternative approach, based on the static partitioning of half- duplex SSs into separate groups, which are allocated alternately, is shown to degrade the performance.", "paper_title": "Bandwidth allocation with half-duplex stations in IEEE 802.16 wireless networks", "paper_id": "WOS:000250147400007"}