{"auto_keywords": [{"score": 0.04885404858896302, "phrase": "real_motion_platform"}, {"score": 0.015619293999419625, "phrase": "real_motion_platforms"}, {"score": 0.014141158058763008, "phrase": "motion_platform"}, {"score": 0.01185041234360913, "phrase": "virtual_motion_platform"}, {"score": 0.011147561936067456, "phrase": "real_platform"}, {"score": 0.010864127687410182, "phrase": "vmp"}, {"score": 0.00481495049065317, "phrase": "extensible_simulator"}, {"score": 0.004483659121004398, "phrase": "late_identification"}, {"score": 0.004215868268050613, "phrase": "important_and_significant_economic_costs"}, {"score": 0.004068174255942041, "phrase": "original_design"}, {"score": 0.0037635782112965662, "phrase": "main_contribution"}, {"score": 0.003515758094739175, "phrase": "computer-based_simulation"}, {"score": 0.0031485421129798996, "phrase": "real_system"}, {"score": 0.0030878280304339587, "phrase": "human_injuries"}, {"score": 0.002922069655177295, "phrase": "different_kinds"}, {"score": 0.0028013259314454407, "phrase": "real_system_implementation"}, {"score": 0.0025578967205807843, "phrase": "extensive_empirical_tests"}, {"score": 0.0024761722816790477, "phrase": "vpm"}, {"score": 0.00235843888868088, "phrase": "really_reasonable_result"}, {"score": 0.002160419006055386, "phrase": "batch_simulations"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Motion platform", " Simulation", " Real-time", " Immersion", " Virtual motion platform"], "paper_abstract": "The limitations of a real motion platform will not normally be discovered until it is completely built and tested. Late identification of its limitations imposes the necessity of a redesign of the motion platform. This, in turn, incurs important and significant economic costs for the manufacturer. Note that any change in the original design of the motion platform requires an investment in resources, money and time in order to perform the redesign of the platform. The main contribution of this paper is to address this problem by creating a virtual motion platform (VMP). This virtual motion platform is a computer-based simulation of a real motion platform which produces the same outputs as the real platform when it receives the same inputs. The VMP has been designed to easily replace the real platform in order to avoid damage to the real system, avoid the potential for human injuries and reduce costs, among other advantages. The model is extensible, enabling the simulation of different kinds of real motion platforms in real-time. The VMP has been validated against a real system implementation. This prototype has been validated against two real motion platforms that we have in our labs: a T3R3 (6DoF) and a T1R2 (3DoF) platform. Extensive empirical tests have been performed and the results show that the VPM exhibits a deviation of less than 3% with respect to the real motion platform, which is a really reasonable result considering the complexity of the simulation. We have also demonstrated that our simulation is capable of running faster than real-time being able to perform batch simulations on many different design iterations. (C) 2014 Elsevier B.V. All rights reserved.", "paper_title": "Towards an extensible simulator of real motion platforms", "paper_id": "WOS:000337999600004"}