{"auto_keywords": [{"score": 0.03295633871036615, "phrase": "poisson"}, {"score": 0.00481495049065317, "phrase": "spike_trains"}, {"score": 0.004700193486903964, "phrase": "short_time_window"}, {"score": 0.004505881071218599, "phrase": "statistical_moments"}, {"score": 0.004451846834142146, "phrase": "interspike_intervals"}, {"score": 0.004319566932528865, "phrase": "spike_counts"}, {"score": 0.00399367108161192, "phrase": "target_neuron"}, {"score": 0.0036700484729006136, "phrase": "short_time_interval"}, {"score": 0.003539479990299223, "phrase": "estimation_procedures"}, {"score": 0.0033725614574134396, "phrase": "neuronal_activity"}, {"score": 0.0032920678776655783, "phrase": "stationary_point_processes"}, {"score": 0.0030069062905274976, "phrase": "maximum_likelihood_estimators"}, {"score": 0.0026326249204932733, "phrase": "numerical_studies"}, {"score": 0.0025235718883452564, "phrase": "interspike_interval"}, {"score": 0.0022633993976138387, "phrase": "increasing_mean_interspike_interval"}], "paper_keywords": [""], "paper_abstract": "We study the estimation of statistical moments of interspike intervals based on observation of spike counts in many independent short time windows. This scenario corresponds to the situation in which a target neuron occurs. It receives information from many neurons and has to respond within a short time interval. The precision of the estimation procedures is examined. As the model for neuronal activity, two examples of stationary point processes are considered: renewal process and doubly stochastic Poisson process. Both moment and maximum likelihood estimators are investigated. Not only the mean but also the coefficient of variation is estimated. In accordance with our expectations, numerical studies confirm that the estimation of mean interspike interval is more reliable than the estimation of coefficient of variation. The error of estimation increases with increasing mean interspike interval, which is equivalent to decreasing the size of window (less events are observed in a window) and with decreasing the number of neurons (lower number of windows).", "paper_title": "Parameters of spike trains observed in a short time window", "paper_id": "WOS:000255002900008"}