{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "geometric_constraint_decomposition"}, {"score": 0.004627244470096107, "phrase": "assembly_pathways"}, {"score": 0.0044272138900038095, "phrase": "poorly_understood_process"}, {"score": 0.003911771812701971, "phrase": "static_geometric_and_tensegrity_constraints"}, {"score": 0.003709595902020469, "phrase": "viral_shell"}, {"score": 0.003502305158321511, "phrase": "focused_questions"}, {"score": 0.003456132182564149, "phrase": "structural_properties"}, {"score": 0.003410565849262162, "phrase": "successful_assembly_pathway"}, {"score": 0.0032485526269852606, "phrase": "computational_algebra"}, {"score": 0.0029602552900111407, "phrase": "expensive_dynamics"}, {"score": 0.0028572658971252616, "phrase": "provably_tractable_and_accurate_computational_simulation"}, {"score": 0.0027456676902333304, "phrase": "known_information"}, {"score": 0.002721464488351771, "phrase": "viral_shell_assembly"}, {"score": 0.0026736945502820303, "phrase": "mathematical_and_biochemical_assumptions"}, {"score": 0.002289821830549781, "phrase": "macromolecular_assembly"}, {"score": 0.0021906130276146325, "phrase": "established_as_well_as_novel_concepts"}, {"score": 0.0021049977753042253, "phrase": "algebraic_complexity"}], "paper_keywords": ["self-assembly", " geometric constraints nanoscience", " viral pathway", " tractable modeling"], "paper_abstract": "We develop a model for elucidating the assembly pathways by which an icosahedral viral shell forms from 60 identical constituent protein monomers. This poorly understood process a remarkable example of macromolecular self-assembly occuring in nature and possesses many features that are desirable while engineering self-assembly at the nanoscale. The model uses static geometric and tensegrity constraints to represent the driving (weak) forces that cause a viral shell to assemble and hold it together. The goal is to answer focused questions about the structural properties of a successful assembly pathway. Pathways and their properties are:carefully defined and computed using computational algebra and geometry, specifically state-of-art concepts in geometric constraint decomposition. The model is analyzable and refinable and avoids expensive dynamics. We show that it has a provably tractable and accurate computational simulation and that its predictions are roughly consistent with known information about viral shell assembly. Justifications for mathematical and biochemical assumptions are provided, and comparisons are drawn with other virus assembly models. A method for more conclusive experimental validation involving specific viruses is sketched. Overall, the paper indicates a strong and direct, mutually beneficial interplay between (a) the concepts underlying macromolecular assembly; and (b) a wide variety of established as well as novel concepts from combinatorial and computational algebra, geometry and algebraic complexity.", "paper_title": "Modeling virus self-assembly pathways: Avoiding dynamics using geometric constraint decomposition", "paper_id": "WOS:000240091600007"}