{"auto_keywords": [{"score": 0.03660680770923649, "phrase": "significant_overall_difference"}, {"score": 0.00481495049065317, "phrase": "personal_usability"}, {"score": 0.004684157900507474, "phrase": "usability_across_nationalities"}, {"score": 0.004273196830970426, "phrase": "personal_usability_constructs"}, {"score": 0.0039341294012600085, "phrase": "international_development"}, {"score": 0.0037922677363572527, "phrase": "chinese"}, {"score": 0.0037574880115557683, "phrase": "danish"}, {"score": 0.0037060847232869365, "phrase": "indian"}, {"score": 0.003349670229755675, "phrase": "conventional_usability_aspects"}, {"score": 0.0031845067058084583, "phrase": "chinese_and_danish_but_not_indian_participants"}, {"score": 0.0030695103543472908, "phrase": "leisure-related_communication"}, {"score": 0.0030135741897058844, "phrase": "chinese_and_indian_but_not_danish_participants"}, {"score": 0.002224510044064184, "phrase": "construing_usability"}, {"score": 0.0021049977753042253, "phrase": "prevailing_usability_definitions"}], "paper_keywords": [""], "paper_abstract": "Whereas the concept of usability is predominantly defined analytically, people relate to systems through personal usability constructs. Based on 48 repertory-grid interviews, this study investigates how such personal constructs are affected by two factors crucial to the international development and uptake of systems: nationality (Chinese, Danish, or Indian) and stakeholder group (developer or user). We find no significant overall difference across nationalities, but further analyses suggest that conventional usability aspects such as ease of use and simplicity are prominent for Chinese and Danish but not Indian participants and that a distinction between work and leisure-related communication is central to Chinese and Indian but not Danish participants. For stakeholder groups, we find a significant overall difference between developers and users. Unlike developers, users associate ease of use with leisure and, conversely, difficulty in use with work-relatedness. Further, users perceive usefulness as related to frustration and separate from ease of use, whereas developers construe usefulness, fun, and ease of use as related. In construing usability, participants make use of several constructs that are not part of prevailing usability definitions, including usefulness, fun, and security.", "paper_title": "Personal Usability Constructs: How People Construe Usability Across Nationalities and Stakeholder Groups", "paper_id": "WOS:000299771600003"}