{"auto_keywords": [{"score": 0.04463376604921258, "phrase": "slot_wedges"}, {"score": 0.02819827616624647, "phrase": "magnetic_slot_wedges"}, {"score": 0.005987119881690944, "phrase": "intrinsic_effects"}, {"score": 0.004777744121315302, "phrase": "induction_machines"}, {"score": 0.004740823885631586, "phrase": "purpose_-_magnetic_slot_wedges"}, {"score": 0.00464976086880886, "phrase": "open_slot_high-voltage_induction_machines"}, {"score": 0.004507667881645218, "phrase": "magnetization_current"}, {"score": 0.004154908228936342, "phrase": "decreasing_maintenance_interval"}, {"score": 0.004027876348834879, "phrase": "unknown_effects"}, {"score": 0.00354349559754076, "phrase": "slots_wedges"}, {"score": 0.003178326919668771, "phrase": "current_and_torque_values"}, {"score": 0.003141498438356646, "phrase": "data_sheet"}, {"score": 0.0031050953733360825, "phrase": "affected_machine"}, {"score": 0.002850682396853918, "phrase": "direct_forces"}, {"score": 0.0026477564788515984, "phrase": "slot_number_relationship"}, {"score": 0.0025967927629150715, "phrase": "rotor_slots"}, {"score": 0.0023380300046435187, "phrase": "induction_machine"}, {"score": 0.00224013518726087, "phrase": "network_models"}, {"score": 0.0021799789348982534, "phrase": "hand_deals"}], "paper_keywords": ["Magnetic fields", " Finite element analysis", " Induction motor", " Slot harmonics"], "paper_abstract": "Purpose - Magnetic slot wedges are usually installed in open slot high-voltage induction machines. They reduce the no load losses and the magnetization current. Additionally, the leakage inductance increases. However, machines and the slot wedges are getting frequently damaged with a decreasing maintenance interval. The usage of magnetic slot wedges leads to unknown effects. It is possible, that direct magnetic forces or indirect forces, caused by the deformation of the stator or stator teeth during operation, results in the damage of the slots wedges. The purpose of this paper is to fully understand the influence of the magnetic slot wedges and the intrinsic effects. Design/methodology/approach - A finite element model of the affected machine is verified with current and torque values from the data sheet of the affected machine. Three types of forces, which are working on the slot wedges, are considered and compared. Findings - There are direct forces working on the slot wedges. The origin of this forces and a coherence between this forces and the slot number relationship, between stator and rotor slots is shown as well as reasons for the damage to the slot wedges. Originality/value - There are investigations about the influence of the behaviour of an induction machine by magnetic slot wedges. This investigations consider the influence on the network models of such machines. The paper at hand deals with the intrinsic effects caused by the slot wedges and its consequences.", "paper_title": "Damages to magnetic slot wedges in induction machines", "paper_id": "WOS:000356434800022"}