{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "covering-based_rough_sets"}, {"score": 0.014954288245645759, "phrase": "formal_concept_analysis"}, {"score": 0.013702142208420615, "phrase": "approximation_operators"}, {"score": 0.0046361494357125355, "phrase": "-based_rough_sets"}, {"score": 0.004463958296056236, "phrase": "data_analysis"}, {"score": 0.00408654006336477, "phrase": "knowledge_reduction"}, {"score": 0.003075765038696993, "phrase": "approximation_spaces"}, {"score": 0.002999012736727594, "phrase": "concept_lattices"}, {"score": 0.002780025943393764, "phrase": "high-level_approximation_operators"}, {"score": 0.002285335999629823, "phrase": "formal_context"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Covering-based rough sets", " Formal concept analysis", " Approximation operator", " Concept lattice", " Knowledge reduction", " Algorithm"], "paper_abstract": "Covering-based rough sets and formal concept analysis are two complementary tools for data analysis. This study systematically explores their connections in terms of approximation operators, structures and knowledge reduction. First, we show that three pairs of approximation operators-element-based, granule-based and subsystem-based, in covering-based rough sets, are accordant with the approximation operators in formal concept analysis. On this basis, one can easily conclude that the approximation spaces of coverings and concept lattices are related and that their reducts are coincident. Second, the high-level approximation operators of formal concept analysis are introduced into covering-based rough sets. In the end, we construct several reduction algorithms for a covering that could also be used to compute the reducts of a formal context. Experiments are conducted to assess their efficiencies. (C) 2014 Elsevier Inc. All rights reserved.", "paper_title": "Connections between covering-based rough sets and concept lattices", "paper_id": "WOS:000347593900003"}