{"auto_keywords": [{"score": 0.03357447059839475, "phrase": "ssp_algorithm"}, {"score": 0.00481495049065317, "phrase": "smoothed_analysis_of_the_successive"}, {"score": 0.004795955374639942, "phrase": "shortest_path_algorithm."}, {"score": 0.004758188582347737, "phrase": "minimum-cost_flow_problem"}, {"score": 0.004646654984830476, "phrase": "combinatorial_optimization"}, {"score": 0.003935513160201076, "phrase": "empirical_studies"}, {"score": 0.003828012660311739, "phrase": "worst-case_analysis"}, {"score": 0.0033328427701162368, "phrase": "strongly_polynomial_minimum-mean_cycle"}, {"score": 0.003115908199991072, "phrase": "smoothed_analysis"}, {"score": 0.002913052619634697, "phrase": "smoothed_running_time"}, {"score": 0.002566255769251419, "phrase": "random_noise"}, {"score": 0.0025159206854716274, "phrase": "worst-case_instances"}, {"score": 0.0021049977753042253, "phrase": "upper_bound"}], "paper_keywords": ["minimum-cost flows", " successive shortest path algorithm", " smoothed analysis"], "paper_abstract": "The minimum-cost flow problem is a classic problem in combinatorial optimization with various applications. Several pseudopolynomial, polynomial, and strongly polynomial algorithms have been developed in the past decades, and it seems that both the problem and the algorithms are well understood. However, some of the algorithms' running times observed in empirical studies contrast the running times obtained by worst-case analysis not only in the order of magnitude but also in the ranking when compared to each other. For example, the successive shortest path (SSP) algorithm, which has an exponential worst-case running time, seems to outperform the strongly polynomial minimum-mean cycle canceling algorithm. To explain this discrepancy, we study the SSP algorithm in the framework of smoothed analysis and establish a bound of O(mn phi) for the number of iterations, which implies a smoothed running time of O(mn phi(m+n log n)), where n and m denote the number of nodes and edges, respectively, and phi is a measure for the amount of random noise. This shows that worst-case instances for the SSP algorithm are not robust and unlikely to be encountered in practice. Furthermore, we prove a smoothed lower bound of Omega(m . min{n, phi} . phi) for the number of iterations of the SSP algorithm, showing that the upper bound cannot be improved for phi = Omega(n).", "paper_title": "SMOOTHED ANALYSIS OF THE SUCCESSIVE SHORTEST PATH ALGORITHM", "paper_id": "WOS:000367020300009"}