{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "theoretical_models"}, {"score": 0.015613917306866312, "phrase": "health_information"}, {"score": 0.01109268156271149, "phrase": "analytical_methods"}, {"score": 0.004605917942709477, "phrase": "theory-driven_survey_studies"}, {"score": 0.004405919996432158, "phrase": "informal_assessment"}, {"score": 0.0043610084347896596, "phrase": "theoretical_foundations"}, {"score": 0.004331320910631647, "phrase": "research_methods"}, {"score": 0.004214569581360156, "phrase": "information_behavior"}, {"score": 0.0038695436922618876, "phrase": "theoretical_framework"}, {"score": 0.003516417950483685, "phrase": "hypothesis_testing"}, {"score": 0.0034924598001567944, "phrase": "model_testing"}, {"score": 0.0032616462517547477, "phrase": "future_researchers"}, {"score": 0.003066945490483524, "phrase": "multidisciplinary_frameworks"}, {"score": 0.002994396880146532, "phrase": "online_health_information_behavior"}, {"score": 0.0029436264166293317, "phrase": "theoretical_frameworks"}, {"score": 0.002647458797373923, "phrase": "theoretical_perspectives"}, {"score": 0.002620424858132324, "phrase": "health_sciences"}, {"score": 0.002602555367635598, "phrase": "social_psychology"}, {"score": 0.0025848074189353397, "phrase": "communication_research"}, {"score": 0.0025584115892805384, "phrase": "information_science"}, {"score": 0.0024055884143050037, "phrase": "conceptual_models"}, {"score": 0.002300912218086077, "phrase": "large_effect_sizes"}, {"score": 0.0021634370496463793, "phrase": "dependent_variables"}, {"score": 0.0021049977753042253, "phrase": "first_attempt"}], "paper_keywords": ["Health information seeking", " Theoretical models", " Internet", " Review", " Health", " Information searches"], "paper_abstract": "Purpose - By selectively reviewing theory-driven survey studies on internet health information seeking, the paper aims to provide an informal assessment of the theoretical foundations and research methods that have been used to study this information behavior. Design/methodology/approach - After a review of the literature, four theory-driven quantitative survey studies are analyzed in detail. Each study is examined in terms of: theoretical framework; research variables that form the focus of the study; research design (sampling, data collection and analysis); and findings and results of hypothesis testing and model testing. The authors then discuss the theoretical models and analytical methods adopted, and identify suggestions that could be helpful to future researchers. Findings - Taken as a whole, the studies reviewed point strongly to the need for multidisciplinary frameworks that can capture the complexity of online health information behavior. The studies developed theoretical frameworks by drawing from many sources - theory of planned behavior, technology acceptance model, uses and gratifications, health belief model, and information seeking models - demonstrating that an integration of theoretical perspectives from the health sciences, social psychology, communication research, and information science, is required to fully understand this behavior. The results of these studies suggest that the conceptual models and analytical methods they adopted are viable and promising. Many relationships tested showed large effect sizes, and the models evaluated were able to account for between 23 and 50 percent of the variance in the dependent variables. Originality/value - The paper represents a first attempt to compare, evaluate, and to a degree synthesize the work that has been done to develop and test theoretical models of health information seeking on the web.", "paper_title": "A review of theoretical models of health information seeking on the web", "paper_id": "WOS:000304576700005"}