{"auto_keywords": [{"score": 0.04971245563968756, "phrase": "gene_expression"}, {"score": 0.00481495049065317, "phrase": "quantitative_behavioral_traits"}, {"score": 0.004527804152066942, "phrase": "phenotypic_functionality"}, {"score": 0.004081385289516914, "phrase": "exploratory_behavior"}, {"score": 0.003988293689448734, "phrase": "brain_regions"}, {"score": 0.0037072310568610723, "phrase": "potential_discoveries"}, {"score": 0.0035263833746562788, "phrase": "multiple_testing"}, {"score": 0.0033672608231654897, "phrase": "related_hypotheses"}, {"score": 0.0029656626382109806, "phrase": "fdr"}, {"score": 0.0028100102841877835, "phrase": "data_aggregation"}, {"score": 0.0027458373015999916, "phrase": "quantitative_traits"}, {"score": 0.0026728137770370176, "phrase": "gene_expression_measurements"}, {"score": 0.0022046030435199796, "phrase": "complex_microarray_study"}, {"score": 0.0021376902861998865, "phrase": "supplementary_data"}, {"score": 0.0021050447939584722, "phrase": "bioinformatics"}], "paper_keywords": [""], "paper_abstract": "Gene expression and phenotypic functionality can best be associated when they are measured quantitatively within the same experiment. The analysis of such a complex experiment is presented, searching for associations between measures of exploratory behavior in mice and gene expression in brain regions. The analysis of such experiments raises several methodological problems. First and foremost, the size of the pool of potential discoveries being screened is enormous yet only few biologically relevant findings are expected, making the problem of multiple testing especially severe. We present solutions based on screening by testing related hypotheses, then testing the hypotheses of interest. In one variant the subset is selected directly, in the other one a tree of hypotheses is tested hierarchical; both variants control the False Discovery Rate (FDR). Other problems in such experiments are in the fact that the level of data aggregation may be different for the quantitative traits ( one per animal) and gene expression measurements (pooled across animals); in that the association may not be linear; and in the resolution of interest only few replications exist. We offer solutions to these problems as well. The hierarchical FDR testing strategies presented here can serve beyond the structure of our motivating example study to any complex microarray study. Contact: ybenja@post.tau.ac.il Supplementary information: Supplementary data are available at Bioinformatics online.", "paper_title": "Associating quantitative behavioral traits with gene expression in the brain: searching for diamonds in the hay", "paper_id": "WOS:000249818500006"}