{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "web_resources"}, {"score": 0.004769444094319619, "phrase": "semantic_markups"}, {"score": 0.004635477242873163, "phrase": "primary_way"}, {"score": 0.004483909657713567, "phrase": "semantic_web"}, {"score": 0.004357927940322685, "phrase": "shared_and_machine_understandable_semantics"}, {"score": 0.004116440453049531, "phrase": "top-down_approach"}, {"score": 0.0038515000499988673, "phrase": "existing_web_resources"}, {"score": 0.003603549914861701, "phrase": "high_barrier"}, {"score": 0.003307988966112615, "phrase": "bottom-up_approach"}, {"score": 0.002868116925014397, "phrase": "pre-existing_global_semantic_model"}, {"score": 0.0028006988338192375, "phrase": "informal_social_categories"}, {"score": 0.0026705669656375197, "phrase": "global_semantics"}, {"score": 0.002486589906779091, "phrase": "global_semantic_model"}, {"score": 0.002416589459425828, "phrase": "group_synonymous_tags"}, {"score": 0.0022933216359142736, "phrase": "hierarchical_relations"}, {"score": 0.0022608057001451414, "phrase": "emerged_concepts"}], "paper_keywords": [""], "paper_abstract": "Defining and using ontology to annotate web resources with semantic markups is generally perceived as the primary way to implement the vision of the Semantic Web. The ontology provides a shared and machine understandable semantics for web resources that agents and applications can utilize. This top-down approach (in the sense that an ontology is defined first on top of existing web resources and then used later to markup them), however, has a high barrier to entry and is difficult to scale up. In this paper, we investigate using a bottom-up approach for semantically annotating web resources as supported by the now widely popular social bookmarks services on the web where users can annotate and categorize web resources using \"tags\" freely choosen by the user without any pre-existing global semantic model. This kind of informal social categories is coined as \"folksonomies\". We show how global semantics can be statistically inferred from the folksonomies to semantically annotate the web resources. The global semantic model also disambiguate the tags and group synonymous tags together. Finally, we show that there indeed are hierarchical relations among the emerged concepts in the folksonomy and it is plausible to further identify them if we use more advanced probabilistic models.", "paper_title": "Emergent semantics from folksonomies: A quantitative study", "paper_id": "WOS:000240496900008"}