{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "epistemic_uncertainty"}, {"score": 0.010602855113320264, "phrase": "encapsulation_problem"}, {"score": 0.004723322467153553, "phrase": "uncertainty_quantification"}, {"score": 0.004218571768509895, "phrase": "new_method"}, {"score": 0.0041287394089001405, "phrase": "existing_stochastic_tools"}, {"score": 0.004037158739422644, "phrase": "probability_distributions"}, {"score": 0.003750260412839128, "phrase": "recent_work"}, {"score": 0.0036670439738769505, "phrase": "m._eldred"}, {"score": 0.003643607569483598, "phrase": "d._xiu"}, {"score": 0.0035399770257915466, "phrase": "j._comput"}, {"score": 0.0033737457695128233, "phrase": "numerical_treatment"}, {"score": 0.003253861748270523, "phrase": "new_approach"}, {"score": 0.0031845067058084583, "phrase": "probability_information"}, {"score": 0.003103833117910855, "phrase": "unknown_epistemic_probability_space"}, {"score": 0.0030446678645538942, "phrase": "epistemic_variables"}, {"score": 0.002977061391551631, "phrase": "solution_statistics"}, {"score": 0.0029203055813347874, "phrase": "post-process_steps"}, {"score": 0.0027830917623582903, "phrase": "jakeman_et_al"}, {"score": 0.0025767987652419054, "phrase": "bounded_domain"}, {"score": 0.002378114613631841, "phrase": "current_formulation"}, {"score": 0.0023178219772486868, "phrase": "unbounded_domain"}, {"score": 0.0022374020089160084, "phrase": "lp_norm"}, {"score": 0.002145942273032774, "phrase": "practical_implementation"}, {"score": 0.002118558580538763, "phrase": "mathematical_framework"}, {"score": 0.0021049977753042253, "phrase": "numerical_analysis"}], "paper_keywords": ["Uncertainty quantification", " Epistemic uncertainty", " Generalized polynomial chaos", " Encapsulation problem"], "paper_abstract": "In the field of uncertainty quantification (UQ), epistemic uncertainty often refers to the kind of uncertainty whose complete probabilistic description is not available, largely due to our lack of knowledge about the uncertainty. Quantification of the impacts of epistemic uncertainty is naturally difficult, because most of the existing stochastic tools rely on the specification of the probability distributions and thus do not readily apply to epistemic uncertainty. And there have been few studies and methods to deal with epistemic uncertainty. A recent work can be found in [J. Jakeman, M. Eldred, D. Xiu, Numerical approach for quantification of epistemic uncertainty, J. Comput. Phys. 229 (2010) 4648-4663], where a framework for numerical treatment of epistemic uncertainty was proposed. The method is based on solving an encapsulation problem, without using any probability information, in a hypercube that encapsulates the unknown epistemic probability space. If more probabilistic information about the epistemic variables is known a posteriori, the solution statistics can then be evaluated at post-process steps. In this paper, we present a new method, similar to that of Jakeman et al. but significantly extending its capabilities. Most notably, the new method (1) does not require the encapsulation problem to be in a bounded domain such as a hypercube; (2) does not require the solution of the encapsulation problem to converge point-wise. In the current formulation, the encapsulation problem could reside in an unbounded domain, and more importantly, its numerical approximation could be sought in Lp norm. These features thus make the new approach more flexible and amicable to practical implementation. Both the mathematical framework and numerical analysis are presented to demonstrate the effectiveness of the new approach. (C) 2013 Elsevier Inc. All rights reserved.", "paper_title": "A flexible numerical approach for quantification of epistemic uncertainty", "paper_id": "WOS:000316735700013"}