{"auto_keywords": [{"score": 0.03430158767591974, "phrase": "dictated_notes"}, {"score": 0.010402453562645499, "phrase": "kidney_cancer_surgery"}, {"score": 0.004814976472848285, "phrase": "structured"}, {"score": 0.004533216418441893, "phrase": "structured_reporting_tool"}, {"score": 0.004513012166348191, "phrase": "operative_note_generation"}, {"score": 0.004393655414215643, "phrase": "ekidney_template-generated_nephrectomy_or"}, {"score": 0.004277441756078997, "phrase": "academic_uro-oncologists"}, {"score": 0.00418293874903495, "phrase": "electronic_online"}, {"score": 0.004118026552723285, "phrase": "clinical_documentation_tool"}, {"score": 0.004045068727683462, "phrase": "kidney_cancer_patient_care"}, {"score": 0.004018042673843149, "phrase": "optimal_components"}, {"score": 0.0039822874870125095, "phrase": "operative_note_templates"}, {"score": 0.0038855864345030563, "phrase": "expert_consensus"}, {"score": 0.0038424081174977115, "phrase": "clinician_nephrectomy"}, {"score": 0.003740720352169084, "phrase": "ekidney"}, {"score": 0.003724034990158436, "phrase": "conventionally_dictated_notes"}, {"score": 0.0036908863817736925, "phrase": "missing_information"}, {"score": 0.003561205990687285, "phrase": "completion_and_transcription_dates"}, {"score": 0.0035216195857272403, "phrase": "time_intervals"}, {"score": 0.0033376244286643176, "phrase": "generation_modalities"}, {"score": 0.0033079039414389833, "phrase": "mean_completion_rate"}, {"score": 0.003177392642813126, "phrase": "significant_difference"}, {"score": 0.003163212007747804, "phrase": "completion_rates"}, {"score": 0.002778380980752089, "phrase": "epr"}, {"score": 0.0023490384046188067, "phrase": "structured_reporting"}, {"score": 0.0022311596751824416, "phrase": "important_details"}, {"score": 0.0021964690109169357, "phrase": "future_studies"}, {"score": 0.002181766829493483, "phrase": "user_satisfaction"}, {"score": 0.002157481084671366, "phrase": "educational_potential"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ireland_ltd."}], "paper_keywords": ["Structured reporting", " Quality control", " Kidney neoplasms", " Medical informatics"], "paper_abstract": "Purpose: The purpose of this study was to evaluate the functionality of eKidney as a structured reporting tool in operative note generation. To do this, we compared completeness and timeliness of eKidney template-generated nephrectomy OR notes with standard narrative dictation. Methods: A group of academic uro-oncologists and medical informaticians at the University Health Network designed and adopted an electronic online, point-of-care clinical documentation tool, eCancerCare(Kidney) (eKidney) for kidney cancer patient care. The optimal components of clinic and operative note templates, including those for nephrectomy, were agreed upon by expert consensus of the uro-oncologists. Clinician nephrectomy OR reports were analyzed for completeness, comparing those generated in eKidney with conventionally dictated notes. Patterns of missing information from both dictated and eKidney-generated reports were analyzed. The procedure, note completion and transcription dates were recorded which generated time intervals between these events. The records of 189 procedures were included in the analysis. Results: Comparison of clinicians who used both note generation modalities, revealed a mean completion rate of 92% for eKidney/structured notes and 68% for dictated notes (p < 0.0001). There was no significant difference in completion rates between attending staff and trainees (residents and fellows) (p = 0.131). Most notes were dictated/entered on the day of surgery. Dictated notes were transcribed to EPR a median of 2 days after dictation, however roughly 30% of dictated notes took 5 days or more to get transcribed. All notes generated using eKidney were uploaded to the EPR immediately. Our study has three significant limitations. Firstly, our study was not randomized: physicians could elect to dictate or use eKidney. Secondly, we did not identify data from dictated notes that were not captured by eKidney. Third, we did not compare the time it took physicians to complete the fields in eKidney with the time it takes to dictate a note. Conclusions: We have demonstrated that the use of structured reporting improves the completeness and timeliness of documentation in kidney cancer surgery. eKidney is an example of the power of templates in ensuring that important details of a procedure are recorded. Future studies looking at user satisfaction, and research and educational potential of eKidney would be valuable. (C) 2011 Elsevier Ireland Ltd. All rights reserved.", "paper_title": "Structured electronic operative reporting: Comparison with dictation in kidney cancer surgery", "paper_id": "WOS:000300613600005"}