{"auto_keywords": [{"score": 0.04325921986975117, "phrase": "perceived_quality"}, {"score": 0.015639390706145104, "phrase": "touch-feedback_simultaneity"}, {"score": 0.010262175889246418, "phrase": "feedback_modality"}, {"score": 0.004643488753834639, "phrase": "virtual_button"}, {"score": 0.004595625593103957, "phrase": "major_interaction_method"}, {"score": 0.0045718784881879915, "phrase": "touchscreen_mobile_phones"}, {"score": 0.004443436195282021, "phrase": "operating_system_software"}, {"score": 0.004111109853964732, "phrase": "touchscreen_buttons"}, {"score": 0.0037643052781898066, "phrase": "simultaneity_perception"}, {"score": 0.003687034798751446, "phrase": "modality_condition"}, {"score": 0.0036395453437040215, "phrase": "gaussian_model"}, {"score": 0.003601992968088131, "phrase": "maximum_likelihood_estimation_method"}, {"score": 0.003491636564620199, "phrase": "subjective_simultaneity"}, {"score": 0.003473589723879074, "phrase": "pss"}, {"score": 0.0033497184946413754, "phrase": "visual_feedback"}, {"score": 0.0032470659868712895, "phrase": "different_latency_conditions"}, {"score": 0.003188639687888399, "phrase": "latency_conditions"}, {"score": 0.002942238084470189, "phrase": "feedback_modalities"}, {"score": 0.0027862007429965193, "phrase": "long_latency"}, {"score": 0.0026521478551545497, "phrase": "quality_ratings"}, {"score": 0.002570817338292482, "phrase": "recommended_latency_range"}, {"score": 0.0025114562778824003, "phrase": "tactile_feedback_latency"}, {"score": 0.002421822997121759, "phrase": "visual_feedback_latency"}, {"score": 0.002305260942304735, "phrase": "finger's_touch"}, {"score": 0.0022345441935094023, "phrase": "reduced_quality"}, {"score": 0.002177269919428687, "phrase": "touchscreen_interactions"}, {"score": 0.0021325070275668295, "phrase": "user_preference"}], "paper_keywords": ["Human Factors", " Temporal perception", " simultaneity", " touch", " feedback", " mobile device", " touchscreen", " tactile", " audio"], "paper_abstract": "Pressing a virtual button is still the major interaction method in touchscreen mobile phones. Although phones are becoming more and more powerful, operating system software is getting more and more complex, causing latency in interaction. We were interested in gaining insight into touch-feedback simultaneity and the effects of latency on the perceived quality of touchscreen buttons. In an experiment, we varied the latency between touch and feedback between 0 and 300 ms for tactile, audio, and visual feedback modalities. We modelled the proportion of simultaneity perception as a function of latency for each modality condition. We used a Gaussian model fitted with the maximum likelihood estimation method to the observations. These models showed that the point of subjective simultaneity (PSS) was 5ms for tactile, 19ms for audio, and 32ms for visual feedback. Our study included the scoring of perceived quality for all of the different latency conditions. The perceived quality dropped significantly between latency conditions 70 and 100 ms when the feedback modality was tactile or audio, and between 100 and 150 ms when the feedback modality was visual. When the latency was 300ms for all feedback modalities, the quality of the buttons was rated significantly lower than in all of the other latency conditions, suggesting that a long latency between a touch on the screen and feedback is problematic for users. Together with PSS and these quality ratings, a 75% threshold was established to define a guideline for the recommended latency range between touch and feedback. Our guideline suggests that tactile feedback latency should be between 5 and 50 ms, audio feedback latency between 20 and 70 ms, and visual feedback latency between 30 and 85 ms. Using these values will ensure that users will perceive the feedback as simultaneous with the finger's touch. These values also ensure that the users do not perceive reduced quality. These results will guide engineers and designers of touchscreen interactions by showing the trade-offs between latency and user preference and the effects that their choices might have on the quality of the interactions and feedback they design.", "paper_title": "Towards the Temporally Perfect Virtual Button: Touch-Feedback Simultaneity and Perceived Quality in Mobile Touchscreen Press Interactions", "paper_id": "WOS:000341241100005"}