{"auto_keywords": [{"score": 0.043891862951523725, "phrase": "andarwin"}, {"score": 0.006271642744127412, "phrase": "similar_apps"}, {"score": 0.004662705558154439, "phrase": "long-term_health"}, {"score": 0.004494570360108983, "phrase": "scalable_approach"}, {"score": 0.00443308765153716, "phrase": "similar_android_apps"}, {"score": 0.004007083686875716, "phrase": "google_play"}, {"score": 0.003970439654470374, "phrase": "numerous_third-party_markets"}, {"score": 0.0038802832668554457, "phrase": "earlier_approaches"}, {"score": 0.00338060449446278, "phrase": "app's_market"}, {"score": 0.003140888248194296, "phrase": "full_and_partial_app_similarity"}, {"score": 0.0030414140732789186, "phrase": "library_code"}, {"score": 0.0029586543333524904, "phrase": "similarity_analysis"}, {"score": 0.0028127163745564777, "phrase": "different_developers"}, {"score": 0.0023507916951658455, "phrase": "similar_code"}, {"score": 0.0021739117830106365, "phrase": "andarwin's_ability"}, {"score": 0.0021049977753042253, "phrase": "large_scale"}], "paper_keywords": ["Program analysis", " clustering", " plagiarism detection", " mobile applications"], "paper_abstract": "Smartphones rely on their vibrant application markets; however, plagiarism threatens the long-term health of these markets. We present a scalable approach to detecting similar Android apps based on their semantic information. We implement our approach in a tool called AnDarwin and evaluate it on 265,359 apps collected from 17 markets including Google Play and numerous third-party markets. In contrast to earlier approaches, AnDarwin has four advantages: it avoids comparing apps pairwise, thus greatly improving its scalability; it analyzes only the app code and does not rely on other information-such as the app's market, signature, or description-thus greatly increasing its reliability; it can detect both full and partial app similarity; and it can automatically detect library code and remove it from the similarity analysis. We present two use cases for AnDarwin: finding similar apps by different developers (\"clones\") and similar apps from the same developer (\"rebranded\"). In 10 hours, AnDarwin detected at least 4,295 apps that are the victims of cloning and 36,106 rebranded apps. Additionally, AnDarwin detects similar code that is injected into many apps, which may indicate the spread of malware. Our evaluation demonstrates AnDarwin's ability to accurately detect similar apps on a large scale.", "paper_title": "AnDarwin: Scalable Detection of Android Application Clones Based on Semantics", "paper_id": "WOS:000360744700003"}