{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "minimum-phase_characteristics"}, {"score": 0.015538563141441393, "phrase": "measured_head-related_transfer_functions"}, {"score": 0.009589712736960151, "phrase": "sound_source_responses"}, {"score": 0.004282391936827106, "phrase": "sound_source"}, {"score": 0.004014923642015515, "phrase": "testing_system"}, {"score": 0.0038309141193444015, "phrase": "sound_source_response"}, {"score": 0.0035082436540296406, "phrase": "corresponding_testing_systems"}, {"score": 0.002890557197908352, "phrase": "measured_hrtfs"}, {"score": 0.00284009509859163, "phrase": "usual_equalization_method"}, {"score": 0.002725740264152553, "phrase": "similarity_scores"}, {"score": 0.002693919110230191, "phrase": "minimum-phase_approximations"}, {"score": 0.002326068563512387, "phrase": "ipsilateral_region"}, {"score": 0.0022854384756395116, "phrase": "sound_sources"}, {"score": 0.002193367454830741, "phrase": "received_ear"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": [""], "paper_abstract": "The minimum-phase characteristics of measured head-related transfer functions (HRTFs) are inevitably influenced by sound source (even source signal) and other playback equipments of testing system. All the factors can be contained in the sound source response measured in the same testing system of HRTFs. Firstly, four sound source responses measured, respectively in corresponding testing systems of HRTFs are approximated by their minimum-phase functions. The results reveal that the errors caused by their minimum-phase approximations are obvious for most of them. In order to evaluate the effects of sound source responses on measured HRTFs, the usual equalization method is adopted. The phase-errors and similarity scores of minimum-phase approximations show that the minimum-phase characteristics of measured HRTFs can be improved after they are equalized by using the sound source responses, which is obvious in the ipsilateral region (the sound sources locate in the same side of the received ear). (C) 2011 Elsevier Ltd. All rights reserved.", "paper_title": "Analysis on minimum-phase characteristics of measured head-related transfer functions affected by sound source responses", "paper_id": "WOS:000301700700006"}