{"auto_keywords": [{"score": 0.04964635174824772, "phrase": "vertex_cover_number"}, {"score": 0.033886966068857355, "phrase": "critical_graphs"}, {"score": 0.00481495049065317, "phrase": "vertex_cover"}, {"score": 0.004685575787741084, "phrase": "minimum_number"}, {"score": 0.004410331572207815, "phrase": "connected_subgraph"}, {"score": 0.004370457120206237, "phrase": "corresponding_number"}, {"score": 0.004126123386192962, "phrase": "connected_vertex_covers"}, {"score": 0.003942877273973905, "phrase": "natural_question"}, {"score": 0.003546218640291191, "phrase": "arbitrary_graphs"}, {"score": 0.003492897128445075, "phrase": "graph_classes"}, {"score": 0.0033989238477802864, "phrase": "induced_subgraph"}, {"score": 0.00334780964309978, "phrase": "real_number_t."}, {"score": 0.0033175095965171674, "phrase": "forbidden_induced_subgraph_characterizations"}, {"score": 0.003287482882222731, "phrase": "real_value_t"}, {"score": 0.00303834224800506, "phrase": "proper_induced_subgraph"}, {"score": 0.002938688858078236, "phrase": "forbidden_subgraph_characterization"}, {"score": 0.0029120808249746533, "phrase": "hereditary_property"}, {"score": 0.0025560719383290356, "phrase": "decision_version"}, {"score": 0.0025186278425734726, "phrase": "np"}, {"score": 0.0023196214633527264, "phrase": "decision_problems"}, {"score": 0.0022777800735119405, "phrase": "polynomial_time"}, {"score": 0.0021632743048552536, "phrase": "thorough_investigation"}, {"score": 0.0021049977753042253, "phrase": "graph_invariants"}], "paper_keywords": ["vertex cover", " connected vertex cover", " computational complexity", " forbidden induced subgraphs"], "paper_abstract": "The vertex cover number of a graph is the minimum number of vertices that are needed to cover all edges. When those vertices are further required to induce a connected subgraph, the corresponding number is called the connected vertex cover number, and is always greater or equal to the vertex cover number. Connected vertex covers are found in many applications, and the relationship between those two graph invariants is therefore a natural question to investigate. For that purpose, we introduce the Price of Connectivity, defined as the ratio between the two vertex cover numbers. We prove that the price of connectivity is at most 2 for arbitrary graphs. We further consider graph classes in which the price of connectivity of every induced subgraph is bounded by some real number t. We obtain forbidden induced subgraph characterizations for every real value t <= 3/2. We also investigate critical graphs for this property, namely, graphs whose price of connectivity is strictly greater than that of any proper induced subgraph. Those are the only graphs that can appear in a forbidden subgraph characterization for the hereditary property of having a price of connectivity at most t. In particular, we completely characterize the critical graphs that are also chordal. Finally, we also consider the question of computing the price of connectivity of a given graph. Unsurprisingly, the decision version of this question is NP-hard. In fact, we show that it is even complete for the class Phi(P)(2) = P-NP[log], the class of decision problems that can be solved in polynomial time, provided we can make O(log n) queries to an NP-oracle. This paves the way for a thorough investigation of the complexity of problems involving ratios of graph invariants.", "paper_title": "The Price of Connectivity for Vertex Cover", "paper_id": "WOS:000342623000013"}