{"auto_keywords": [{"score": 0.040288497206115007, "phrase": "flow_concept"}, {"score": 0.00481495049065317, "phrase": "psychological_construct"}, {"score": 0.004601508848655033, "phrase": "optimal_experience"}, {"score": 0.004419703921314433, "phrase": "user_experience_studies"}, {"score": 0.004266501496765747, "phrase": "technology_acceptance"}, {"score": 0.004223708778943785, "phrase": "video_gaming"}, {"score": 0.004139401327448803, "phrase": "web_marketing"}, {"score": 0.0036491673002304326, "phrase": "ad_hoc_manner"}, {"score": 0.003558294449586273, "phrase": "overall_agreement"}, {"score": 0.0033832583769880576, "phrase": "often_different_studies"}, {"score": 0.0031208772639433145, "phrase": "careful_consideration"}, {"score": 0.003073988343893906, "phrase": "original_concept"}, {"score": 0.002907992115184249, "phrase": "conceptual_misunderstanding"}, {"score": 0.0025374674652885354, "phrase": "new_studies"}], "paper_keywords": ["interaction paradigms", " HCI theory", " concepts and models"], "paper_abstract": "Flow is a psychological construct that has been used to describe states of optimal experience. It has been remarkably influential in user experience studies in areas of computing such as technology acceptance, video gaming, e-shopping, web marketing and e-learning, among others. Frequently, however, the interpretation of the flow concept as well as its major characteristics have been made in an ad hoc manner; there is no overall agreement on how the flow concept should be conceptualized; and often different studies conceptualize flow in very different ways. We claim that those interpretations have been made without a careful consideration of the original concept and that, frequently, they are the product of conceptual misunderstanding. We propose a view that might help researchers interested in flow in computing to understand the source of those discrepancies as well as to design new studies of flow. The view is based on notions of phenomenology and embodied interaction and provides a framework to analyse and situate work on flow in computing. We conclude by pointing out some areas of further research associated with this view.", "paper_title": "An Embodied View of Flow", "paper_id": "WOS:000344604900001"}