{"auto_keywords": [{"score": 0.045823130012453465, "phrase": "mesh_term"}, {"score": 0.045417031794566444, "phrase": "medical_records_systems"}, {"score": 0.00481495049065317, "phrase": "electronic_medical_records_revisited"}, {"score": 0.004682708592184678, "phrase": "short_review"}, {"score": 0.0044495916002190855, "phrase": "medline"}, {"score": 0.004073809704022463, "phrase": "english_articles"}, {"score": 0.0039252131044337215, "phrase": "pubmed"}, {"score": 0.0033986345279488476, "phrase": "impact_factor"}, {"score": 0.0032898346872897383, "phrase": "yearly_publications"}, {"score": 0.003054009753601139, "phrase": "cluster_analysis"}, {"score": 0.0026687115458522326, "phrase": "constant_yearly_production"}, {"score": 0.0026195184143518713, "phrase": "electronic_medical_records"}, {"score": 0.0025592969422491476, "phrase": "current_inventory"}, {"score": 0.002267708463966758, "phrase": "organizational_issues"}, {"score": 0.0022155569675462333, "phrase": "order_entry"}, {"score": 0.0021049977753042253, "phrase": "technical_issues"}], "paper_keywords": ["Computerized medical records systems", " MedLine", " review"], "paper_abstract": "Objectives: In this short review we provide an update of our earlier inventories of publications indexed in Medline with the MeSH term 'Medical Records Systems, Computerized'. Methods: We retrieved and analyzed all references to English articles published before January 1, 2008, and indexed in PubMed with the MeSH term 'Medical Records Systems, Computerized'. Results: We retrieved a total of 11,924 publications, of which 3937 (33%) appeared in a journal with an impact factor. Since 2002 the number of yearly publications, and the number of journals in which those publications appeared, increased. A cluster analysis revealed three clusters: an organizational issues cluster, a technically oriented cluster and a cluster about order-entry and research. Conclusions: Although our previous inventory in 2003 suggested a constant yearly production of publications on electronic medical records since 1998, the current inventory shows another rise in production since 2002. In addition, many new journals and countries have shown interest during the last five years. In the last 15 years, interest in organizational issues remained fairly constant, order entry and research with systems gained attention, while interest in technical issues relatively decreased.", "paper_title": "An Inventory of Publications on Electronic Medical Records Revisited", "paper_id": "WOS:000271410700010"}