{"auto_keywords": [{"score": 0.04296486508114674, "phrase": "tam"}, {"score": 0.010612364714890753, "phrase": "technology_acceptance_model"}, {"score": 0.010334851702691245, "phrase": "second_life"}, {"score": 0.00463507149599759, "phrase": "healthcare_education"}, {"score": 0.004530371221172796, "phrase": "good_reasons"}, {"score": 0.00377326532920359, "phrase": "virtual_environment"}, {"score": 0.0035908627899097407, "phrase": "rapid_sequence_intubation"}, {"score": 0.0035230748451028577, "phrase": "rsi"}, {"score": 0.00348300993356662, "phrase": "increasingly_frequently_used_method"}, {"score": 0.003456554957885269, "phrase": "acute_airway_management"}, {"score": 0.0034303002275695446, "phrase": "healthcare_settings"}, {"score": 0.003190584226787897, "phrase": "computer_self-efficacy"}, {"score": 0.0031422859551159506, "phrase": "external_variable"}, {"score": 0.002499438189264537, "phrase": "students'_self-confidence"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Technology acceptance model", " 3D learning environment", " Second Life", " Virtual ward", " lntubation", " Airway management"], "paper_abstract": "Learners need to have good reasons to engage and accept e-learning. They need to understand that unless they do, the outcomes will be less favourable. The technology acceptance model (TAM) is the most widely recognized model addressing why users accept or reject technology. This study describes the development and evaluation of a virtual environment, the online 3D world Second Life (SL), for learning rapid sequence intubation (RSI). RSI is an increasingly frequently used method of acute airway management in healthcare settings. The intention of learners to use the system was explored based on the TAM, with the computer self-efficacy construct as an external variable. Two hundred and six nursing students participated in this study. The findings suggest that the system was perceived as useful, and that the students felt confident working with computers and intended to review RSI in SL as often as needed. However, they remained neutral regarding the ease of use of the system. Strategies were suggested for boosting the students' self-confidence in using the system. Overall use of the TAM in this context was successful, indicating the robustness of the model. The limitations of the study were discussed and further areas of research on the TAM were proposed. (C) 2012 Elsevier Ltd. All rights reserved.", "paper_title": "Extending the technology acceptance model to explore the intention to use Second Life for enhancing healthcare education", "paper_id": "WOS:000309307300006"}