{"auto_keywords": [{"score": 0.046806984950472454, "phrase": "j._j._gibson"}, {"score": 0.00481495049065317, "phrase": "new_formalization"}, {"score": 0.0047113960612140335, "phrase": "affordance-based_robot_control"}, {"score": 0.0038948525410795517, "phrase": "action_possibilities"}, {"score": 0.0034554281349858836, "phrase": "human-computer_interaction"}, {"score": 0.002966900048034132, "phrase": "different_fields"}, {"score": 0.002918826667294298, "phrase": "particular_emphasis"}, {"score": 0.002855934865505357, "phrase": "autonomous_robotics"}, {"score": 0.002719325177422626, "phrase": "major_formalization_proposals"}, {"score": 0.002675252546913683, "phrase": "affordance_term"}, {"score": 0.002235040467016128, "phrase": "new_formalism"}, {"score": 0.002151388538895855, "phrase": "autonomous_robot_control"}, {"score": 0.0021049977753042253, "phrase": "preliminary_results"}], "paper_keywords": ["affordance", " autonomous robots", " control architecture", " formalization", " perception"], "paper_abstract": "The concept of affordances was introduced by J. J. Gibson to explain how inherent \"values\" and \"meanings\" of things in the environment can be directly perceived and how this information can be linked to the action possibilities offered to the organism by the environment. Although introduced in psychology, the concept influenced studies in other fields ranging from human-computer interaction to autonomous robotics. In this article, we first introduce the concept of affordances as conceived by J. J. Gibson and review the use of the term in different fields, with particular emphasis on its use in autonomous robotics. Then, we summarize four of the major formalization proposals for the affordance term. We point out that there are three, not one, perspectives from which to view affordances and that much of the confusion regarding discussions on the concept has arisen from this. We propose a new formalism for affordances and discuss its implications for autonomous robot control. We report preliminary results obtained with robots and link them with these implications.", "paper_title": "To afford or not to afford: A new formalization of affordances toward affordance-based robot control", "paper_id": "WOS:000251368600005"}