{"auto_keywords": [{"score": 0.02714978140601789, "phrase": "system_quality"}, {"score": 0.00481495049065317, "phrase": "application_success"}, {"score": 0.004612662942073808, "phrase": "user_participation"}, {"score": 0.00441883624011048, "phrase": "system_success"}, {"score": 0.003947765701573287, "phrase": "experimental_study"}, {"score": 0.003741371936431574, "phrase": "different_forms"}, {"score": 0.003701401653850141, "phrase": "information_systems_success"}, {"score": 0.003451766520526601, "phrase": "development_process"}, {"score": 0.0032888418378433037, "phrase": "greater_success"}, {"score": 0.002233301265743633, "phrase": "perceived_system_quality"}, {"score": 0.002209406458446019, "phrase": "user_satisfaction"}], "paper_keywords": ["participation", " involvement", " information systems success", " user developed applications"], "paper_abstract": "User participation and involvement have long been associated with system success. This paper reports on a study to investigate the role of involvement in user developed application success. The experimental study explored the chain of influences between involvement and the different forms of information systems success and clarified how these influences differ for participants and non-participants in the development process. While participation was shown to result in greater success on all the measures included in the study, the effect of participation is mediated by involvement. In this study, involvement was derived from one of two sources, depending on participation: for participants in development, involvement was derived from their participation but was unaffected by system quality, while for non-participants, involvement was derived partially from system quality. Involvement also acted differently: involvement derived from system quality directly affected both perceived system quality and user satisfaction, while involvement derived from participation directly affected only perceived system quality.", "paper_title": "User developed application success: sources and effects of involvement", "paper_id": "WOS:000259086400006"}