{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "rational_selfish_agents"}, {"score": 0.028068654296818766, "phrase": "pure_nash_equilibria"}, {"score": 0.023877351602378805, "phrase": "synchronous_game"}, {"score": 0.0045443671106012405, "phrase": "strategic_games"}, {"score": 0.004378469469879815, "phrase": "possible_actions"}, {"score": 0.003264547032549398, "phrase": "worst-case_payoff"}, {"score": 0.0032242793143795454, "phrase": "adversary's_decisions"}, {"score": 0.0031064226956732497, "phrase": "arbitrary_two-person_strategic_games"}, {"score": 0.0029928611380840757, "phrase": "asynchronous_adversary"}, {"score": 0.002546708483171714, "phrase": "rational_behavior"}, {"score": 0.002473959963690124, "phrase": "decision_process"}, {"score": 0.0023540387251475615, "phrase": "asynchronous_version"}, {"score": 0.002175913488493802, "phrase": "mere_threat"}, {"score": 0.0021049977753042253, "phrase": "social_optimum_a_rational_choice"}], "paper_keywords": ["selfish agent", " Nash equilibrium", " asynchronous game"], "paper_abstract": "The behavior of rational selfish agents has been classically studied in the framework of strategic games in which each player has a set of possible actions, players choose actions simultaneously and the payoff for each player is determined by the matrix of the game. However, in many applications, players choose actions asynchronously, and simultaneity of this process is not guaranteed: it is possible that a player learns the action of another player before making its choice. Delays of choices are controled by the adversary and each player can only secure the worst-case payoff over the adversary's decisions. In this paper we consider such asynchronous versions of arbitrary two-person strategic games and we study how the presence of the asynchronous adversary influences the behavior of the players, assumed to be selfish but rational. We concentrate on deterministic ( pure) strategies, and in particular, on the existence and characteristics of pure Nash equilibria in such games. It turns out that the rational behavior of players changes significantly if the decision process is asynchronous. We show that pure Nash equilibria often exist in the asynchronous version of the game even if there were no such equilibria in the synchronous game. We also show that a mere threat of asynchrony in the game may make social optimum a rational choice while it was not rational in the synchronous game.", "paper_title": "Impact of asynchrony on the Behavior of rational selfish agents", "paper_id": "WOS:000252980000008"}