{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "procedural_modelling"}, {"score": 0.015534647929790276, "phrase": "virtual_worlds"}, {"score": 0.011614914458774588, "phrase": "procedural_methods"}, {"score": 0.004096082254543022, "phrase": "large_variety"}, {"score": 0.004047296286849109, "phrase": "detailed_content"}, {"score": 0.003999089046152065, "phrase": "reduced_human_intervention"}, {"score": 0.0038119123317396954, "phrase": "virtual_environments"}, {"score": 0.0031277316566463978, "phrase": "entire_cities"}, {"score": 0.0028931405607654495, "phrase": "intuitive_control"}, {"score": 0.0027741761880779535, "phrase": "procedural_method"}, {"score": 0.0022758279600841014, "phrase": "widespread_acceptance"}], "paper_keywords": ["procedural modeling methods", " procedural content generation", " virtual worlds"], "paper_abstract": "Procedural modelling deals with (semi-)automatic content generation by means of a program or procedure. Among other advantages, its data compression and the potential to generate a large variety of detailed content with reduced human intervention, have made procedural modelling attractive for creating virtual environments increasingly used in movies, games and simulations. We survey procedural methods that are useful to generate features of virtual worlds, including terrains, vegetation, rivers, roads, buildings and entire cities. In this survey, we focus particularly on the degree of intuitive control and of interactivity offered by each procedural method, because these properties are instrumental for their typical users: designers and artists. We identify the most promising research results that have been recently achieved, but we also realize that there is far from widespread acceptance of procedural methods among non-technical, creative professionals. We conclude by discussing some of the most important challenges of procedural modelling.", "paper_title": "A Survey on Procedural Modelling for Virtual Worlds", "paper_id": "WOS:000342802200003"}