{"auto_keywords": [{"score": 0.049442018015062324, "phrase": "voronoi"}, {"score": 0.013104195230273489, "phrase": "delaunay"}, {"score": 0.00481495049065317, "phrase": "three-dimensional_geoscientific_fields"}, {"score": 0.003732368382223596, "phrase": "highly_anisotropic_distributions"}, {"score": 0.0036335821512795026, "phrase": "geographical_information_system"}, {"score": 0.0030113280682863234, "phrase": "new_spatial_model"}, {"score": 0.002957919048133256, "phrase": "voronoi_diagram"}, {"score": 0.0026330549554033876, "phrase": "main_properties"}, {"score": 0.0025632898741546556, "phrase": "gis_operations"}, {"score": 0.0023021895404322767, "phrase": "map_algebra_framework"}, {"score": 0.0021720199689914464, "phrase": "voronoi-based_spatial_model"}, {"score": 0.0021049977753042253, "phrase": "potential_applications"}], "paper_keywords": ["three-dimensional GIS", " fields", " spatial modelling", " voronoi diagram", " delaunay triangulation"], "paper_abstract": "Fields as found in the geosciences have properties that are not usually found in other disciplines: the phenomena studied are often three-dimensional (3D), they tend to change continuously over time, and the collection of samples to study the phenomena is problematic, which often results in highly anisotropic distributions of samples. In the geographical information system (GIS) community, raster structures (voxels or octrees) are the most popular solutions, but, as we show in this paper, they have shortcomings for modelling and analysing 3D geoscientific fields. As an alternative to using rasters, we propose a new spatial model based on the Voronoi diagram (VD) and its dual the Delaunay tetrahedralisation (DT), and argue that they have many advantages over other tessellations. We discuss the main properties of the 3D VD/DT, present some GIS operations that are greatly simplified when the VD/DT is used, and, to analyse two or more fields, we also present a variant of the map algebra framework where all the operations are performed directly on VDs. The usefulness of this Voronoi-based spatial model is demonstrated with a series of potential applications.", "paper_title": "Modelling three-dimensional geoscientific fields with the Voronoi diagram and its dual", "paper_id": "WOS:000254345900004"}