{"auto_keywords": [{"score": 0.04702000392375611, "phrase": "environmental_impact"}, {"score": 0.04038855568473317, "phrase": "spatial_network"}, {"score": 0.00481495049065317, "phrase": "vehicular_environmental_models"}, {"score": 0.004772818068176176, "phrase": "actual_vehicle_fuel_consumption_data"}, {"score": 0.0047310525657970615, "phrase": "eco-routing"}, {"score": 0.0043138910491265815, "phrase": "ghg"}, {"score": 0.004220086640742953, "phrase": "vehicular_transportation"}, {"score": 0.003714748329627737, "phrase": "road_segments"}, {"score": 0.003539252646181146, "phrase": "ecomark"}, {"score": 0.003477505397536663, "phrase": "general_framework"}, {"score": 0.003447035529485425, "phrase": "eco-weight_assignment"}, {"score": 0.003298631258267805, "phrase": "six_instantaneous_and_five_aggregated_models"}, {"score": 0.0031151864044353245, "phrase": "travel_information"}, {"score": 0.00307431840409833, "phrase": "gps_trajectories"}, {"score": 0.0027905114793984084, "phrase": "actual_fuel_consumption"}, {"score": 0.0027660443371695024, "phrase": "impact_model_calibration"}, {"score": 0.002646880721119838, "phrase": "impact_models"}, {"score": 0.0023294867572824147, "phrase": "varying_circumstances"}], "paper_keywords": ["CAN bus", " Eco-routing", " Eco-weights", " GPS Trajectories", " Vehicular environmental impact"], "paper_abstract": "Eco-routing is a simple yet effective approach to substantially reducing the environmental impact, e.g., fuel consumption and greenhouse gas (GHG) emissions, of vehicular transportation. Eco-routing relies on the ability to reliably quantify the environmental impact of vehicles as they travel in a spatial network. The procedure of quantifying such vehicular impact for road segments of a spatial network is called eco-weight assignment. EcoMark 2.0 proposes a general framework for eco-weight assignment to enable eco-routing. It studies the abilities of six instantaneous and five aggregated models to estimating vehicular environmental impact. In doing so, it utilizes travel information derived from GPS trajectories (i.e., velocities and accelerations) and actual fuel consumption data obtained from vehicles. The framework covers analyses of actual fuel consumption, impact model calibration, and experiments for assessing the utility of the impact models in assigning eco-weights. The application of EcoMark 2.0 indicates that the instantaneous model EMIT and the aggregated model SIDRA-Running are suitable for assigning eco-weights under varying circumstances. In contrast, other instantaneous models should not be used for assigning eco-weights, and other aggregated models can be used for assigning eco-weights under certain circumstances.", "paper_title": "EcoMark 2.0: empowering eco-routing with vehicular environmental models and actual vehicle fuel consumption data", "paper_id": "WOS:000353294800005"}