{"auto_keywords": [{"score": 0.03857701375589246, "phrase": "research_model"}, {"score": 0.03363896917055258, "phrase": "consumer_satisfaction"}, {"score": 0.030840627566015025, "phrase": "continuance_intention"}, {"score": 0.00481495049065317, "phrase": "expectation_confirmation_model"}, {"score": 0.00477924690801092, "phrase": "purpose_-_sustainable_success"}, {"score": 0.004743806810821005, "phrase": "group-buying_web_sites"}, {"score": 0.004290201740122912, "phrase": "expectation-confirmation_model"}, {"score": 0.004027031316965272, "phrase": "group-buying_web_sites_continuance"}, {"score": 0.003808209866576388, "phrase": "leading_group-buying_web_site"}, {"score": 0.003780174009815072, "phrase": "china"}, {"score": 0.0037518852820756323, "phrase": "structural_equation_modeling"}, {"score": 0.0035479614996805383, "phrase": "continued_use_behavior"}, {"score": 0.003293142761521425, "phrase": "perceived_web_site_quality"}, {"score": 0.0032565264119071772, "phrase": "price_advantage"}, {"score": 0.0032083351151314405, "phrase": "important_determinants"}, {"score": 0.0030225753906647935, "phrase": "consumers'_continuance_intention"}, {"score": 0.002847540262784593, "phrase": "best-fitting_model"}, {"score": 0.002815864555488112, "phrase": "competing_models"}, {"score": 0.0022936173659750766, "phrase": "ecm."}, {"score": 0.0021769145378792445, "phrase": "ecm"}, {"score": 0.0021446391766277817, "phrase": "better_explanation"}, {"score": 0.002128694000627911, "phrase": "consumers'_post-purchase_behavior"}, {"score": 0.0021049977753042253, "phrase": "online_group-buying_context"}], "paper_keywords": ["China", " Continuance intention", " Satisfaction", " Social influence", " Expectation-confirmation model", " Online group buying"], "paper_abstract": "Purpose - Sustainable success of group-buying web sites implies that consumers not only accept them initially but also use them continuously. Most group-buying web sites, however, are unable to achieve such sustainable success. Drawing on expectation-confirmation model (ECM), the purpose of this paper is to examine the factors that influence group-buying web sites continuance. Design/methodology/approach - In total, 605 valid responses were collected via a survey of a leading group-buying web site in China. Structural equation modeling was used to test the research model. This study also compared the three competing models of continued use behavior, namely, ECM, the research model and the integrated model. Findings - The results show that perceived web site quality, perceived price advantage and confirmation are important determinants of consumer satisfaction, while perceived web site quality, perceived reputation, satisfaction and perceived critical mass significantly influence consumers' continuance intention. The research model accounts for more variance in satisfaction and continuance intention than ECM and is the best-fitting model among the competing models. Originality/value - Drawing on ECM, this research proposes a model by incorporating three online group-buying characteristics (perceived price advantage, perceived reputation and perceived web site quality) and two social influence factors (subjective norm and perceived critical mass). Specially, this study uses these three online group-buying characteristics to represent perceived usefulness in ECM. These constructs are found to influence consumer satisfaction and continuance intention. This study extends ECM and provides a better explanation of consumers' post-purchase behavior in the online group-buying context.", "paper_title": "Understanding group-buying websites continuance An extension of expectation confirmation model", "paper_id": "WOS:000369699600004"}