{"auto_keywords": [{"score": 0.024140763417019928, "phrase": "va"}, {"score": 0.004533427352547707, "phrase": "transportation_network"}, {"score": 0.004323776691055635, "phrase": "directed_arcs"}, {"score": 0.004195418010131832, "phrase": "associated_label"}, {"score": 0.003799796252156605, "phrase": "tail_node"}, {"score": 0.003546722347907148, "phrase": "label_constraint"}, {"score": 0.0034562118159899772, "phrase": "admissible_sequence"}, {"score": 0.003426556090707852, "phrase": "transportation_modes"}, {"score": 0.0033680032592969633, "phrase": "approach-dependent_travel-time_feature_models_turn-penalties"}, {"score": 0.003130077012135034, "phrase": "next_link"}, {"score": 0.0029467742734417255, "phrase": "right_turn"}, {"score": 0.0028591768694918, "phrase": "left_turn"}, {"score": 0.002680114113899346, "phrase": "present_related_theoretical_complexity_results"}, {"score": 0.00241658945942583, "phrase": "computational_effort"}, {"score": 0.0023859776100986834, "phrase": "blacksburg"}, {"score": 0.0023650305205893353, "phrase": "extensive_empirical_results"}, {"score": 0.0023447155524245655, "phrase": "available_data"}, {"score": 0.0022457226013538343, "phrase": "transportation_networks"}, {"score": 0.0021601997088758957, "phrase": "developed_procedures"}, {"score": 0.0021049977753042253, "phrase": "wiley_periodicals"}], "paper_keywords": ["shortest path problems", " approach dependent", " time dependent", " label constraints", " TRANSIMS"], "paper_abstract": "In this article, we consider an approach-dependent, time-dependent, label-constrained shortest path problem. This is a variant of the shortest path problem defined on a transportation network comprised of a set of nodes and a set of directed arcs such that each arc has an associated label designating a mode of transportation, and an associated travel-time function that depends on the time of arrival at the tail node, as well as on the link via which this node was approached. A label constraint is specified that controls the admissible sequence of transportation modes, and the approach-dependent travel-time feature models turn-penalties and prohibitions in transportation networks, whereby the time spent at an intersection before entering the next link depends on whether we travel straight through the intersection, or make a right turn at it, or make a left turn at it, as permissible. We propose two effective algorithms to solve this problem and present related theoretical complexity results. In addition, we also explore various heuristic delay estimation and network curtailment schemes that can be used to confine the search to only the more promising subsets of the network to reduce computational effort while preserving near-optimality. Extensive empirical results using available data for the Portland, OR, and Blacksburg, VA, transportation networks are presented to demonstrate the efficacy of the developed procedures. (C) 2006 Wiley Periodicals, Inc.", "paper_title": "The approach-dependent, time-dependent, label-constrained shortest path problem", "paper_id": "WOS:000239533400001"}