{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "kepler"}, {"score": 0.0045820747375409435, "phrase": "new_scientific_knowledge"}, {"score": 0.00443308765153716, "phrase": "data_analysis_and_knowledge_discovery_'pipelines"}, {"score": 0.004149429072483132, "phrase": "computational_services"}, {"score": 0.004014452814186653, "phrase": "distributed_data"}, {"score": 0.0039813976794342, "phrase": "computational_community_infrastructure"}, {"score": 0.003884254616616269, "phrase": "grid"}, {"score": 0.0032109670662222416, "phrase": "analytical_steps"}, {"score": 0.003042812778470762, "phrase": "data_analysis"}, {"score": 0.0029437270961011077, "phrase": "computationally_intensive_jobs"}, {"score": 0.0029194625087935345, "phrase": "high-performance_cluster_computers"}, {"score": 0.002778006389296707, "phrase": "scientific_workflows"}, {"score": 0.002473959963690124, "phrase": "scientific_data_management_projects"}, {"score": 0.0024232694434408093, "phrase": "key_features"}, {"score": 0.002305799666781492, "phrase": "future_research"}, {"score": 0.002203117204010397, "phrase": "related_projects"}, {"score": 0.002184943946549964, "phrase": "new_contributors"}, {"score": 0.0021049977753042253, "phrase": "john_wiley"}], "paper_keywords": ["scientific workflows", " Grid workflows", " scientific data management", " problem-solving environments", " dataflow networks"], "paper_abstract": "Many scientific disciplines are now data and information driven, and new scientific knowledge is often gained by scientists putting together data analysis and knowledge discovery 'pipelines'. A related trend is that more and more scientific communities realize the benefits of sharing their data and computational services, and are thus contributing to a distributed data and computational community infrastructure (a.k.a. 'the Grid'). However, this infrastructure is only a means to an end and ideally scientists should not be too concerned with its existence. The goal is for scientists to focus on development and use of what we call scientific workflows. These are networks of analytical steps that may involve, e.g., database access and querying steps, data analysis and mining steps, and many other steps including computationally intensive jobs on high-performance cluster computers. In this paper we describe characteristics of and requirements for scientific workflows as identified in a number of our application projects. We then elaborate on Kepler, a particular scientific workflow system, currently under development across a number of scientific data management projects. We describe some key features of Kepler and its underlying Ptolemy II system, planned extensions, and areas of future research. Kepler is a community-driven, open source project, and we always welcome related projects and new contributors to join. Copyright (c) 2005 John Wiley & Sons, Ltd.", "paper_title": "Scientific workflow management and the Kepler system", "paper_id": "WOS:000239804900003"}