{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "feature_models"}, {"score": 0.012431653322787955, "phrase": "automated_analysis"}, {"score": 0.00830115020624223, "phrase": "oracle_problem"}, {"score": 0.008060608776111972, "phrase": "metamorphic_testing"}, {"score": 0.004662427600500598, "phrase": "valid_combinations"}, {"score": 0.004563427013973105, "phrase": "automated_extraction"}, {"score": 0.004514723417095106, "phrase": "fms"}, {"score": 0.004478519688578345, "phrase": "complex_task"}, {"score": 0.0044426140044122545, "phrase": "numerous_analysis_operations"}, {"score": 0.004371660146981191, "phrase": "current_testing_methods"}, {"score": 0.0038638811223100184, "phrase": "combinatorial_complexity"}, {"score": 0.0035936635879882813, "phrase": "test_data"}, {"score": 0.003574413263452281, "phrase": "feature_model_analysis_tools"}, {"score": 0.003517276620998936, "phrase": "automated_test_data_generator"}, {"score": 0.0032624429135093237, "phrase": "input_fms"}, {"score": 0.002937879003671346, "phrase": "multiple_analyses"}, {"score": 0.0029221312451219203, "phrase": "complex_fms"}, {"score": 0.002761776738647737, "phrase": "mutation_testing"}, {"score": 0.0027469703311742647, "phrase": "real_faults"}, {"score": 0.00263841815834997, "phrase": "fama"}, {"score": 0.002603191724274985, "phrase": "splot"}, {"score": 0.002473560912156024, "phrase": "related_manual_suite"}, {"score": 0.0023694065215394593, "phrase": "automated_generation"}, {"score": 0.0023566987138026285, "phrase": "test_cases"}, {"score": 0.0023440589015485077, "phrase": "important_gains"}, {"score": 0.0021392418081444798, "phrase": "human_oracle"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v._all_rights"}], "paper_keywords": ["Metamorphic testing", " Test data generation", " Mutation testing", " Feature models", " Automated analysis", " Product lines"], "paper_abstract": "Context: A feature model (FM) represents the valid combinations of features in a domain. The automated extraction of information from FMs is a complex task that involves numerous analysis operations, techniques and tools. Current testing methods in this context are manual and rely on the ability of the tester to decide whether the output of an analysis is correct. However, this is acknowledged to be time-consuming, error-prone and in most cases infeasible due to the combinatorial complexity of the analyses, this is known as the oracle problem. Objective: In this paper, we propose using metamorphic testing to automate the generation of test data for feature model analysis tools overcoming the oracle problem. An automated test data generator is presented and evaluated to show the feasibility of our approach. Method: We present a set of relations (so-called metamorphic relations) between input FMs and the set of products they represent. Based on these relations and given a FM and its known set of products, a set of neighbouring FMs together with their corresponding set of products are automatically generated and used for testing multiple analyses. Complex FMs representing millions of products can be efficiently created by applying this process iteratively. Results: Our evaluation results using mutation testing and real faults reveal that most faults can be automatically detected within a few seconds. Two defects were found in FaMa and another two in SPLOT, two real tools for the automated analysis of feature models. Also, we show how our generator outperforms a related manual suite for the automated analysis of feature models and how this suite can be used to guide the automated generation of test cases obtaining important gains in efficiency. Conclusion: Our results show that the application of metamorphic testing in the domain of automated analysis of feature models is efficient and effective in detecting most faults in a few seconds without the need for a human oracle. (C) 2010 Elsevier B.V. All rights reserved.", "paper_title": "Automated metamorphic testing on the analyses of feature models", "paper_id": "WOS:000288348500006"}