{"auto_keywords": [{"score": 0.044393160349518686, "phrase": "spmcloud"}, {"score": 0.026884439428863368, "phrase": "best_competitor"}, {"score": 0.005666870197879582, "phrase": "execution_time"}, {"score": 0.00481495049065317, "phrase": "single-chip_embedded_scratchpad_memory-based_storage_cloud"}, {"score": 0.004652459760165587, "phrase": "aggressive_move"}, {"score": 0.004631210802518759, "phrase": "many-core_platforms"}, {"score": 0.004599518354749796, "phrase": "rapid_adoption"}, {"score": 0.004423963064490547, "phrase": "large-scale_distributed_on-chip_shared_memories"}, {"score": 0.004046020290832207, "phrase": "future-generation_many-core_platforms"}, {"score": 0.0038208447685745515, "phrase": "network_attached_storage"}, {"score": 0.0037686871759908254, "phrase": "storage_area_network"}, {"score": 0.0036664904243925967, "phrase": "memory_virtualization"}, {"score": 0.0036247277319384876, "phrase": "embedded_raids"}, {"score": 0.0035588910818525987, "phrase": "spmcloud's_fully_distributed_reliable_memory_subsystems"}, {"score": 0.0034942460422902753, "phrase": "latency_reduction"}, {"score": 0.0034623636688751367, "phrase": "state-of-the-art_noc_memory_reliability_techniques"}, {"score": 0.0033530412117986253, "phrase": "traditional_spm_allocation_policies"}, {"score": 0.0033300663114870883, "phrase": "spmcloud's_dynamic_allocator"}, {"score": 0.003307248311857645, "phrase": "best_competition"}, {"score": 0.0029423438208689913, "phrase": "best_competitors"}, {"score": 0.0028625088030324922, "phrase": "spm"}, {"score": 0.0027593719700696453, "phrase": "spmcloud's_priority-driven_dynamic_allocation_policy"}, {"score": 0.002678321986031892, "phrase": "closest_allocation_policy"}, {"score": 0.0024435322199851876, "phrase": "energy_savings"}, {"score": 0.002302046794342723, "phrase": "heavier_e-raid_levels"}, {"score": 0.002260179764607094, "phrase": "secded"}, {"score": 0.002168735848715569, "phrase": "secded."}], "paper_keywords": ["Algorithms", " Management", " Performance", " Design", " Reliability", " Experimentation", " Network-on-chip", " distributed memories", " reliability", " virtualization", " many-core platforms"], "paper_abstract": "The era of cloud computing on-a-chip is enabled by the aggressive move towards many-core platforms and the rapid adoption of Network-on-Chips. As a result, there is a need for large-scale distributed on-chip shared memories that are reliable, low power, and seamlessly manageable. In this work, we propose SPMCloud, a novel scratchpad-memory-based cloud-inspired volatile storage subsystem designed to meet the needs of future-generation many-core platforms. SPMCloud is composed of several concepts, including: (1) a highly scalable data-center-like memory subsystem that exploits two enterprise-network-inspired memory configurations, namely, embedded Network Attached Storage (eNAS) and embedded Storage Area Network (eSAN), and (2) on-demand allocation of reliable memory space through memory virtualization and the use of embedded RAIDs. Our experimental results on Mediabench/CHStone benchmarks show that the SPMCloud's fully distributed reliable memory subsystems can achieve 48% energy savings and 70% latency reduction on average over state-of-the-art NoC memory reliability techniques. We then evaluate the scalability of the SPMCloud and compare it with traditional SPM allocation policies. The SPMCloud's dynamic allocator outperforms the best competition by an average 60% (eNAS) and 46% (eSAN) when the platform runs at 250 MHz and by an average 80% (eNAS) and 40% when running at 1 GHz. Moreover, the SPMCloud achieves an average 83% energy savings across all configurations (number of cores) with respect to the best competitors when running at 250 MHz and 1 GHz. We then studied the SPM hit ratio across the various allocation policies discussed in this article and showed that on average the SPMCloud's priority-driven dynamic allocation policy achieves 93.5% SPM hit ratio, 0.6% higher hit ratio than the closest allocation policy. We then showed that the eNAS and eSAN achieve an average of 67.9% and 29% reduction in execution time, respectively, over the best competitor. Similarly, the eNAS and eSAN achieve an average of 82.7% and 82.3% energy savings, respectively, over the best competitor. Furthermore, we evaluated the scalability of the SPMCloud and its performance/energy efficiency when providing support for some of the heavier E-RAID levels, and showed that the eNAS/eSAN configurations with SECDED achieve an average of 51.5% and 34.9% reduction in execution time, respectively, over the best competitor with SECDED. Similarly, the eNAS/eSAN configurations with E-RAID Level 1+ SECDED achieve an average of 82.3% and 75.6% energy savings, respectively, over the best competitor.", "paper_title": "SPMCloud: Towards the Single-Chip Embedded ScratchPad Memory-Based Storage Cloud", "paper_id": "WOS:000337808000001"}