{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "quantified_membership_queries"}, {"score": 0.004771435352180973, "phrase": "membership_queries"}, {"score": 0.0047283116134926645, "phrase": "basic_predicate_operations"}, {"score": 0.004518442937844318, "phrase": "global_properties"}, {"score": 0.004417012437860011, "phrase": "subset_inclusion"}, {"score": 0.004278807087784626, "phrase": "basic_tools"}, {"score": 0.004240116703465252, "phrase": "set-theoretic_data-mining_procedures"}, {"score": 0.0037848978618663684, "phrase": "privacy-preserving_fashion"}, {"score": 0.0036998728605395384, "phrase": "syntax-driven_compiler"}, {"score": 0.0034403745992576808, "phrase": "basic_set_operation_predicates"}, {"score": 0.002753224894944965, "phrase": "new_light"}, {"score": 0.0026913130726432645, "phrase": "privacy-preserving_evaluation"}, {"score": 0.0025716240685409513, "phrase": "substantial_complexity_improvements"}, {"score": 0.002536763634539386, "phrase": "previous_works"}, {"score": 0.0024460897937643032, "phrase": "communication_complexity"}], "paper_keywords": [""], "paper_abstract": "Membership queries are basic predicate operations that apply to datasets. Quantifications of such queries express global properties between datasets, including subset inclusion and disjointness. These operations are basic tools in set-theoretic data-mining procedures such as frequent-itemset-mining. In this work we formalize a family of such queries syntactically and we consider how they can be evaluated in a privacy-preserving fashion. We present a syntax-driven compiler that produces a protocol for each query and we show that semantically such queries correspond to basic set operation predicates between datasets. Using our compiler and based on the fact that it is syntax-driven, two parties can generate various privacy-preserving protocols with different complexity behavior that allow them to efficiently and securely evaluate the predicate of interest without sharing information about the datasets they possess. Our compiler sheds new light on the complexity of privacy-preserving evaluation of predicates such as disjointness and subset-inclusion and achieves substantial complexity improvements compared to previous works in terms of round as well as communication complexity. In particular, among others, we present protocols for both predicates that require one-round of interaction and have communication less than the size of the universe, while previously the only one round protocols known had communication proportional to the size of the universe.", "paper_title": "Syntax-driven private evaluation of quantified membership queries", "paper_id": "WOS:000238570400033"}