{"auto_keywords": [{"score": 0.0046593017130868, "phrase": "distributed_identity"}, {"score": 0.004551199992546761, "phrase": "cloud_computing"}, {"score": 0.004487541157100498, "phrase": "multi-platform_digital_environment"}, {"score": 0.004362870617347183, "phrase": "new_phase"}, {"score": 0.003581620064675766, "phrase": "human_identity"}, {"score": 0.003095923814666088, "phrase": "interdisciplinary_collaboration"}, {"score": 0.002912331664922248, "phrase": "distributed_forms"}, {"score": 0.0027916287357898544, "phrase": "large_database"}, {"score": 0.002752513434446804, "phrase": "identity_maps"}, {"score": 0.002726740692380339, "phrase": "-_computerized_graphical_representations"}, {"score": 0.002196077907454079, "phrase": "gender_and_age_differences"}, {"score": 0.0021249064184347658, "phrase": "initial_database"}, {"score": 0.0021049977753042253, "phrase": "distributed_identity_profiles"}], "paper_keywords": ["Identity", " Online Identity", " Distributed Self", " Cloud Computing", " Computer Visualization"], "paper_abstract": "The advent of cloud computing and a multi-platform digital environment is giving rise to a new phase of human identity called(15) \"The Distributed Self.\" In this conception, aspects of the self are distributed into a variety of 2D and 3D digital personas with the capacity to reflect any number of combinations of now malleable personality traits. In this way, the source of human identity remains internal and embodied, but the expression or enactment of the self becomes increasingly external, disembodied, and distributed on demand. The Identity Mapping Project ( IMP) is an interdisciplinary collaboration between psychology and computer Science designed to empirically investigate the development of distributed forms of identity. Methodologically, it collects a large database of \"identity maps\" - computerized graphical representations of how active someone is online and how their identity is expressed and distributed across 7 core digital domains: email, blogs/personal websites, social networks, online forums, online dating sites, character based digital games, and virtual worlds. The current paper reports on gender and age differences in online identity based on an initial database of distributed identity profiles.", "paper_title": "The Identity Mapping Project: Demographic differences in patterns of distributed identity", "paper_id": "WOS:000375005900017"}