{"auto_keywords": [{"score": 0.04889532068804289, "phrase": "complex_issues"}, {"score": 0.015719716506582538, "phrase": "organizational_cybernetics"}, {"score": 0.011527351183372421, "phrase": "similar_backgrounds"}, {"score": 0.011244211908581842, "phrase": "deliberation_process"}, {"score": 0.004735254735115024, "phrase": "collective_discussion"}, {"score": 0.004283913685201902, "phrase": "information_and_communication_technologies"}, {"score": 0.00417793854311445, "phrase": "group_discussions"}, {"score": 0.004007083686875716, "phrase": "real_case"}, {"score": 0.003924310678899515, "phrase": "oc"}, {"score": 0.00389164348807591, "phrase": "team_syntegrity_concepts"}, {"score": 0.0030414140732789186, "phrase": "qualitative_and_quantitative_information"}, {"score": 0.0027974705482714884, "phrase": "ict_support"}, {"score": 0.0027510752634224726, "phrase": "better_output"}, {"score": 0.002616464539214516, "phrase": "ict"}, {"score": 0.0025623050508233078, "phrase": "higher_degree"}, {"score": 0.002519800066326798, "phrase": "practically_all_indicators"}, {"score": 0.0024883835349005863, "phrase": "second_group"}, {"score": 0.0024573577356299765, "phrase": "-the_authors"}, {"score": 0.0022133711375320244, "phrase": "different_contexts"}, {"score": 0.0021049977753042253, "phrase": "first_phases"}], "paper_keywords": ["ICT", " Organizational cybernetics", " Debates organizer", " Deliberation", " Variety"], "paper_abstract": "Purpose - The purpose of this paper is to expose how organizational cybernetics (OC)-related concepts could be used in combination with information and communication technologies (ICT) to facilitate group discussions on complex issues, and to show its impact in a real case. Design/methodology/approach - A software inspired by OC and team syntegrity concepts has been developed with the aim of helping groups of people to deliberate around complex issues through the internet. Two groups of persons with similar backgrounds were chosen to pursue a deliberation process around the same issue. One had the support of ICT while the other did not. The authors used the same questionnaires with both groups, aimed at getting qualitative and quantitative information about the results obtained in each case. Findings - The results obtained show that the group working with ICT support did produce a better output (quality and quantity) than the group not supported with ICT as well as a higher degree of satisfaction in practically all indicators than the second group. Research limitations/implications -The authors are dealing with only one experiment and therefore cannot make a generalization. It would be desirable to repeat the experiment with various groups and in different contexts. Originality/value - An internet-based software inspired by OC concepts was created to facilitate the first phases (generation and aggregation of ideas) of a deliberation process and the authors measured, in an experiment with two groups of people with similar backgrounds, the impact of using it on the quality and quantity of information produced through the process.", "paper_title": "The application of organizational cybernetics and ICT to collective discussion of complex issues", "paper_id": "WOS:000363420500022"}