{"auto_keywords": [{"score": 0.04895692824063781, "phrase": "transcriptional_bursts"}, {"score": 0.011266312804110876, "phrase": "external_noise"}, {"score": 0.009895982039810472, "phrase": "noise_properties"}, {"score": 0.00481495049065317, "phrase": "drosophila_bicoid_morphogen_gradient_system"}, {"score": 0.004573748810476845, "phrase": "statistical_model"}, {"score": 0.004413846562278824, "phrase": "developmental_system"}, {"score": 0.004110549138321181, "phrase": "native_gene"}, {"score": 0.003536720212056521, "phrase": "internal_noise"}, {"score": 0.0034949740315415043, "phrase": "stochastic_nature"}, {"score": 0.0032675209435107273, "phrase": "activator_concentration"}, {"score": 0.002947868524740683, "phrase": "simplified_gene_regulatory_model"}, {"score": 0.002788865808981643, "phrase": "hb_transcription"}, {"score": 0.002546002312015341, "phrase": "bcd_target_gene"}, {"score": 0.002456816881853114, "phrase": "otd_transcription"}, {"score": 0.002418185868191525, "phrase": "additional_external_fluctuations"}, {"score": 0.002380184758803213, "phrase": "bcd"}, {"score": 0.0022696277881969896, "phrase": "output_noise"}, {"score": 0.0022428042503686053, "phrase": "important_insights"}, {"score": 0.002207530926563892, "phrase": "morphogen_gradient_system"}, {"score": 0.0021049977753042253, "phrase": "fundamental_level"}], "paper_keywords": [""], "paper_abstract": "Motivation: We describe a statistical model to dissect the noise in transcriptional bursts in a developmental system. Results: We assume that, at any given moment of time, each copy of a native gene inside a cell can exist in either a bursting (active) or non-bursting (inactive) state. The experimentally measured total noise in the transcriptional states of a gene in a population of cells can be mathematically dissected into two contributing components: internal and external. While internal noise quantifies the stochastic nature of transcriptional bursts, external noise is caused by cell-to-cell differences including fluctuations in activator concentration. We use our developed methods to analyze the Drosophila Bicoid (Bcd) morphogen gradient system. For its target gene hunchback (hb), the noise properties can be recapitulated by a simplified gene regulatory model in which Bcd acts as the only input, suggesting that the external noise in hb transcription is primarily derived from fluctuations in the Bcd activator input. However, such a simplified gene regulatory model is insufficient to predict the noise properties of another Bcd target gene, orthodenticle (otd), suggesting that otd transcription is sensitive to additional external fluctuations beyond those in Bcd. Our results show that analysis of the relationship between input and output noise can reveal important insights into how a morphogen gradient system works. Our study also advances the knowledge about transcription at a fundamental level.", "paper_title": "Evaluating the Drosophila Bicoid morphogen gradient system through dissecting the noise in transcriptional bursts", "paper_id": "WOS:000302298900009"}