{"auto_keywords": [{"score": 0.004258563634666145, "phrase": "minimum_cardinality"}, {"score": 0.004232105688270601, "phrase": "np"}, {"score": 0.004133204817078675, "phrase": "faster_exact_exponential_time_algorithm"}, {"score": 0.003854809457075099, "phrase": "enumeration_approach"}, {"score": 0.0037662262006579023, "phrase": "input_graph"}, {"score": 0.0034431390653713173, "phrase": "slower_algorithm"}, {"score": 0.0033306180744375616, "phrase": "refinement_steps"}, {"score": 0.0031898025329389376, "phrase": "current_algorithm"}, {"score": 0.0031372369299648203, "phrase": "new_branching_strategy"}, {"score": 0.003065092702656417, "phrase": "worst_cases"}, {"score": 0.0028966970007550824, "phrase": "previous_one"}, {"score": 0.002510801832283111, "phrase": "minimum_maximal_matching"}, {"score": 0.0024941578231560055, "phrase": "minimum_weight_maximal"}, {"score": 0.0022348937352254343, "phrase": "set_problem"}, {"score": 0.002133196554995389, "phrase": "nxm_matrices"}, {"score": 0.0021049977753042253, "phrase": "parametrised_minimum_weight"}], "paper_keywords": ["Edge dominating set", " Minimum maximal matching", " Exact algorithms", " Exponential time algorithms", " Measure and conquer"], "paper_abstract": "An edge dominating set in a graph G=(V,E) is a subset of the edges DaS dagger E such that every edge in E is adjacent or equal to some edge in D. The problem of finding an edge dominating set of minimum cardinality is NP-hard. We present a faster exact exponential time algorithm for this problem. Our algorithm uses O(1.3226 (n) ) time and polynomial space. The algorithm combines an enumeration approach of minimal vertex covers in the input graph with the branch and reduce paradigm. Its time bound is obtained using the measure and conquer technique. The algorithm is obtained by starting with a slower algorithm which is refined stepwisely. In each of these refinement steps, the worst cases in the measure and conquer analysis of the current algorithm are reconsidered and a new branching strategy is proposed on one of these worst cases. In this way a series of algorithms appears, each one slightly faster than the previous one, ending in the O(1.3226 (n) ) time algorithm. For each algorithm in the series, we also give a lower bound on its running time. We also show that the related problems: minimum weight edge dominating set, minimum maximal matching and minimum weight maximal matching can be solved in O(1.3226 (n) ) time and polynomial space using modifications of the algorithm for edge dominating set. In addition, we consider the matrix dominating set problem which we solve in O(1.3226 (n+m) ) time and polynomial space for nxm matrices, and the parametrised minimum weight maximal matching problem for which we obtain an O (au)(2.4179 (k) ) time and space algorithm.", "paper_title": "Exact Algorithms for Edge Domination", "paper_id": "WOS:000310222000001"}