{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "webcasting_systems"}, {"score": 0.036760020611178404, "phrase": "webcasting_system"}, {"score": 0.004697308822154191, "phrase": "remote_access"}, {"score": 0.004404658750724105, "phrase": "additional_requirement"}, {"score": 0.004296998284839309, "phrase": "\"second_life"}, {"score": 0.00419195822011581, "phrase": "archival_information_objects"}, {"score": 0.0033379819706003885, "phrase": "archived_events"}, {"score": 0.0032724821705972357, "phrase": "experimental_design"}, {"score": 0.0030081030319492343, "phrase": "information_tasks"}, {"score": 0.0028911669203979156, "phrase": "specific_information"}, {"score": 0.0026973310437053573, "phrase": "user_actions"}, {"score": 0.002670719148310961, "phrase": "user_perceptions"}, {"score": 0.00263129148531588, "phrase": "user_explanations"}, {"score": 0.0023710856920150574, "phrase": "distinctive_system-use_patterns"}, {"score": 0.0021049977753042253, "phrase": "information_objects"}], "paper_keywords": [""], "paper_abstract": "Webcasting systems were developed to provide remote access in real-time to live events. Today, these systems have an additional requirement: to accommodate the \"second life\" of webcasts as archival information objects. Research to date has focused on facilitating the production and storage of webcasts as well as the development of more interactive and collaborative multimedia tools to support the event, but research has not examined how people interact with a webcasting system to access and use the contents of those archived events. Using an experimental design, this study examined how 16 typical users interact with a webcasting system to respond to a set of information tasks: selecting a webcast, searching for specific information, and making a gist of a webcast. Using several data sources that included user actions, user perceptions, and user explanations of their actions and decisions, the study also examined the strategies employed to complete the tasks. The results revealed distinctive system-use patterns for each task and provided insights into the types of tools needed to make webcasting systems better suited for also using the webcasts as information objects.", "paper_title": "Understanding How Webcasts Are Used as Sources of Information", "paper_id": "WOS:000286687300010"}