{"auto_keywords": [{"score": 0.04166062208214632, "phrase": "key_size"}, {"score": 0.00481495049065317, "phrase": "multivariate_pkc"}, {"score": 0.004774937143916685, "phrase": "low-resource_embedded_systems"}, {"score": 0.004522796947899013, "phrase": "large_algebraic_structures"}, {"score": 0.004447989240253565, "phrase": "rsa"}, {"score": 0.004410971932401545, "phrase": "ecc"}, {"score": 0.004248294537944227, "phrase": "traditional_pkcs"}, {"score": 0.004040688646993605, "phrase": "embedded_systems"}, {"score": 0.0038431888954930083, "phrase": "stringent_resource_constraints"}, {"score": 0.003795335309109018, "phrase": "low-cost_smart_cards"}, {"score": 0.003686051719238182, "phrase": "berkeley"}, {"score": 0.003197843245296877, "phrase": "tame_transformation_signatures"}, {"score": 0.0028327783069076883, "phrase": "die_space"}, {"score": 0.0026164433143193015, "phrase": "key_shortening"}, {"score": 0.0025838249689625775, "phrase": "current_consumption"}, {"score": 0.002562322214742117, "phrase": "tts"}, {"score": 0.0021315842986705485, "phrase": "future-proofing_investment"}, {"score": 0.0021049977753042253, "phrase": "emerging_quantum_computers"}], "paper_keywords": ["multivariate public-key cryptosystem", " efficient implementation", " digital signature schemes", " embedded system", " sensor networks", " motes"], "paper_abstract": "Multivariate (or M Q) public-key cryptosystems (PKC) are alternatives to traditional PKCs based on large algebraic structures (e.g., RSA and ECC): they usually execute much faster than traditional PKCs on the same hardware. However, one major challenge in implementing multivariates in embedded systems is that the key size can be prohibitively large for applications with stringent resource constraints such as low-cost smart cards. sensor networks (e.g.. Berkeley motes), and radio-frequency identification (RFID). In this paper, we investigate strategies for shortening the key of a multivariate PKC. We apply these strategies to the Tame Transformation Signatures (TTS) as an example and quantify the improvement in key size and running speed, both theoretically and via implementation. We also investigate ways to save die space and energy consumption in hardware, reporting on our ASIC implementation of TTS on a TSMC 0.25 mu m process. Even without any key shortening, the current consumption of TTS is only 21 mu A for computing a signature, using 22,000 gate equivalents and 16,000 100-kHz cycles (160 ms). With circulant-matrix key shortening, the numbers go down to 17,000 gates and 4,400 cycles (44 ms). We therefore conclude: besides representing a future-proofing investment against the emerging quantum computers, multivariates can be immediately useful in niches.", "paper_title": "Implementing minimized multivariate PKC on low-resource embedded systems", "paper_id": "WOS:000238185800007"}