{"auto_keywords": [{"score": 0.04841653735477415, "phrase": "practical_constraints"}, {"score": 0.04804050199975018, "phrase": "off-line_signature_verification_problem"}, {"score": 0.04317179544664411, "phrase": "test_signature"}, {"score": 0.00481495049065317, "phrase": "automatic_off-line_signature_verification_problem"}, {"score": 0.0047370749839861165, "phrase": "adapted_fuzzy_snake_approach"}, {"score": 0.004425862476945326, "phrase": "shape-memory_alloys"}, {"score": 0.004342430078306461, "phrase": "high-temperature_conditions"}, {"score": 0.004101413211256104, "phrase": "off-line_signature_verification"}, {"score": 0.003937459891461576, "phrase": "reference_signature"}, {"score": 0.0035701213515857227, "phrase": "complex_verification_problem"}, {"score": 0.003219368413618912, "phrase": "fuzzy_snake_framework"}, {"score": 0.003201890266327127, "phrase": "signature_verification"}, {"score": 0.0030905652689424924, "phrase": "bank_checks"}, {"score": 0.0029108902891803144, "phrase": "considered_signature_verification_problem"}, {"score": 0.002887210021573995, "phrase": "double_direction"}, {"score": 0.0028249975318149468, "phrase": "shape-memory_snake"}, {"score": 0.002771659191307672, "phrase": "training_signature"}, {"score": 0.002741632276146748, "phrase": "considered_test_signature"}, {"score": 0.0026898636962522505, "phrase": "similarity_degree"}, {"score": 0.0026033756286033285, "phrase": "verification_task"}, {"score": 0.002575167114383286, "phrase": "takagi-sugeno_fuzzy_inference_system"}, {"score": 0.002353782218079617, "phrase": "snake_energy"}, {"score": 0.002210814150677161, "phrase": "biometric_classification_errors"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Off-line signature verification", " Fuzzy snake", " Takagi-Sugeno system", " Biometric errors"], "paper_abstract": "This paper introduces an adapted fuzzy snake approach for efficiently solving some of the practical constraints in the off-line signature verification problem. Our method is called fuzzy shape-memory snakes due to its resemblance to shape-memory alloys, which are metals that in high-temperature conditions can remember their original shape. In our approach, the snake also \"remembers\" its geometry during its iterative adjustment to a test signature. Off-line signature verification aims to establish the degree of genuineness of a given test signature when compared to a reference signature. Due to the shape and size variability in signatures of the same subject, a system with tolerance to imprecision and also with some \"memory\" of its initial configured shape, would be very useful for this complex verification problem. To our knowledge, snakes and other active contour models have not been previosly applied to the off-line signature verification problem. We consider that they could be properly adapted to be useful for this task. Consequently, we have developed a fuzzy snake framework for signature verification which takes into account some practical constraints of this problem when applied to bank checks. Over other signature verification systems, our approach has the advantage of using only one training signature per person. We introduce the fuzziness for the considered signature verification problem in a double direction. First, when iteratively adjusting a shape-memory snake (which is obtained from the training signature) to a considered test signature. Second, when measuring the similarity degree between the snake and the test signature after the adjustment (or verification task) using a Takagi-Sugeno fuzzy inference system. which is trained with three signature features (coincidence, distance and energy) provided by the adjustment. Some advantages of our approach are that: some involved parameters in the internal (shape) snake energy are now eliminated, and a more efficient and natural snake adjustment to the test signature is achieved. This paper also provides a study of the biometric classification errors when comparing our off-line signature verification approach to other non-fuzzy ones using the same signature database. (C) 2008 Elsevier B.V. All rights reserved.", "paper_title": "Fuzzy shape-memory snakes for the automatic off-line signature verification problem", "paper_id": "WOS:000261354100005"}