{"auto_keywords": [{"score": 0.025703886111299465, "phrase": "sa_algorithm"}, {"score": 0.00481495049065317, "phrase": "new_mathematical_model"}, {"score": 0.004771115666493521, "phrase": "multi-criteria_cell_formation_problem"}, {"score": 0.0045717473871437425, "phrase": "cellular_manufacturing_system"}, {"score": 0.004502572578226444, "phrase": "manufacturing_cells"}, {"score": 0.00407143648409885, "phrase": "general_or_common_cells"}, {"score": 0.0039975862967816765, "phrase": "different_kinds"}, {"score": 0.003865642389848873, "phrase": "specific_type"}, {"score": 0.003715291088032481, "phrase": "capital_constraints"}, {"score": 0.003379859206640552, "phrase": "corresponding_commodities"}, {"score": 0.0032582736131450316, "phrase": "assigned_commodities"}, {"score": 0.0032089088224564913, "phrase": "different_and_various_criteria"}, {"score": 0.002805422862625723, "phrase": "common_and_specific_cells"}, {"score": 0.002704445718144686, "phrase": "unused_capital"}, {"score": 0.0026715987201787286, "phrase": "cell_formation_problem"}, {"score": 0.0026002006627630614, "phrase": "np"}, {"score": 0.002520927983744567, "phrase": "art_effective_algorithm"}, {"score": 0.002176977873507044, "phrase": "good_ability"}, {"score": 0.0021049977753042253, "phrase": "large-sized_problems"}], "paper_keywords": ["Mathematical model", " Multi-criteria cell formation model", " Simulated annealing"], "paper_abstract": "One of the most important stages in the establishment of a cellular manufacturing system is the formation of manufacturing cells in order to find out which machines dedicated to each cell and part families corresponding to these machines. In this paper, two kinds of cells are being considered: (1) general or common cells which are able to manufacture different kinds of products and (2) specific cells which are able to manufacture a specific type of product, To set up cells for manufacturing, two kinds of capital constraints are observed: (1) capital constraints for construction and formation of cells and (2) capital availability constraints for the provision of tools and equipment to manufacture corresponding commodities. To find cells and to specify the family of the assigned commodities to each cell, different and various criteria exist. in this paper, three criteria are taken into consideration simultaneously in order to minimize the sum of: (1) costs of the delay in delivering a product to costumers by the above two cells in each period, (2) costs of the common and specific cells to remain idle in each period and (3) the unused capital. Since the cell formation problem is mostly time consuming, i.e. these are NP-hard, then to solve the problem, art effective algorithm of simulated annealing (SA) method is utilized. To verify and validate the efficiency of the SA algorithm. from the standpoint of the quality of the solution obtained and time of calculations, the results obtained are compared with those of the Lingo 6 software. Results suggest that the SA algorithm have good ability of solving the problem, especially in the case of large-sized problems for which Lingo 6 cannot produce solutions. (C) 2008 Elsevier Ltd. All rights reserved.", "paper_title": "A simulated annealing method for solving a new mathematical model of a multi-criteria cell formation problem with capital constraints", "paper_id": "WOS:000262738800005"}