{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "adverse_effects"}, {"score": 0.0401644439914554, "phrase": "paper_titles"}, {"score": 0.0047804843375940835, "phrase": "work_interruptions"}, {"score": 0.00467855218490191, "phrase": "highly_interruptive_hospital_environment"}, {"score": 0.004481132747216135, "phrase": "critical_care"}, {"score": 0.0042459818200777846, "phrase": "adverse_events"}, {"score": 0.0041703614123283165, "phrase": "literature_search"}, {"score": 0.00411083864539615, "phrase": "medline"}, {"score": 0.003923145411543204, "phrase": "embase"}, {"score": 0.0038671299350540554, "phrase": "isi_web_of_science_and_ergonomics_abstracts"}, {"score": 0.0037038224217016817, "phrase": "initial_search"}, {"score": 0.003105305189036267, "phrase": "complex_and_varied_domain"}, {"score": 0.003071965703296204, "phrase": "inadequate_conceptualizations"}, {"score": 0.0030499378654797143, "phrase": "accident_aetiology"}, {"score": 0.0029210388852074208, "phrase": "medical_errors"}, {"score": 0.002797572252783356, "phrase": "causal_evidence"}, {"score": 0.002669683153809812, "phrase": "healthcare_settings"}, {"score": 0.002584576723303367, "phrase": "prospective_memory_research"}, {"score": 0.0025660347613972573, "phrase": "distributed_cognition"}, {"score": 0.0025293479382942257, "phrase": "theoretical_background"}, {"score": 0.0024136908511423875, "phrase": "future_empirical_research"}, {"score": 0.0021202154023229123, "phrase": "positive_and_adverse_effects"}], "paper_keywords": ["Interruptions", " Distractions", " Prospective memory", " Healthcare", " Communication", " Patient safety", " Error theory", " Accident model", " Medication dispensing", " Distributed cognition"], "paper_abstract": "Background: Researchers in healthcare have begun to investigate interruptions extensively, given evidence for the adverse effects of work interruptions in other domains and given the highly interruptive hospital environment. In this paper, we reviewed literature on interruptions in critical care and medication dispensing settings in search of evidence for a relationship between interruptions and adverse events. Methods: The literature search included the databases MEDLINE, CINAHL+ Pre CINHAL, Health Sources: Nursing Academic Edition, EMBASE, PsycINFO, ISI Web of Science and Ergonomics Abstracts. The paper titles and abstracts were subsequently reviewed. After the initial search, we reviewed paper titles and abstracts to define the subset for review. Results: We currently lack evidence in healthcare of the extent to which interruptions lead to adverse effects. The lack of evidence may be due to the descriptive rather than causal nature of most studies, the lack of theory motivating investigations of the relationship, the fact that healthcare is a complex and varied domain, and inadequate conceptualizations of accident aetiology. We identify two recent accident theories in which the relationship between activity and medical errors is complex, indicating that even when it is sought, causal evidence is hard to find. Discussion: Future research on interruptions in healthcare settings should focus on the following. First, prospective memory research and distributed cognition can provide a theoretical background for understanding the impact of interruptions and so could provide guidance for future empirical research on interruptions and the planning of actions in healthcare. Second, studying how interruptions are successfully rather than unsuccessfully overcome may better help us understand their effects. Third, because interruptions almost always have positive and adverse effects, more appropriate dependent variables could be chosen. (C) 2008 Elsevier Ireland Ltd. All rights reserved.", "paper_title": "Interruptions in healthcare: Theoretical views", "paper_id": "WOS:000265542400001"}