{"auto_keywords": [{"score": 0.010020173409443478, "phrase": "mutual_information"}, {"score": 0.00481495049065317, "phrase": "accurate_multi-modal_brain_image"}, {"score": 0.004667541072056214, "phrase": "new_non-uniform_sampling_method"}, {"score": 0.00450456611645112, "phrase": "multi-modal_brain_image_rigid_registration"}, {"score": 0.004347256848088215, "phrase": "mutual_information_computation"}, {"score": 0.003977505904363489, "phrase": "sampled_voxels'_interdependency"}, {"score": 0.003574929398913029, "phrase": "main_advantages"}, {"score": 0.003329368827624161, "phrase": "image_statistics"}, {"score": 0.003114449258490062, "phrase": "anatomical_structures_shapes"}, {"score": 0.0027989800906333784, "phrase": "clinical_mri_images"}, {"score": 0.0027495914857929584, "phrase": "brain_ct_images"}, {"score": 0.0027252240573281163, "phrase": "proton_density"}, {"score": 0.002701139251717454, "phrase": "pd"}, {"score": 0.00260657976055413, "phrase": "public_rire_database"}, {"score": 0.0024930878032164757, "phrase": "lowest_mean_registration_errors"}, {"score": 0.002438203996977464, "phrase": "ct-mr_image_registration"}, {"score": 0.002405853977978678, "phrase": "rire_website"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Multi-modal image registration", " Mutual information", " Non-uniform sampling", " Curvelet transform"], "paper_abstract": "We present a new non-uniform sampling method for the accurate estimation of mutual information in multi-modal brain image rigid registration. Most existing density estimators used for mutual information computation incorrectly assume that the intensity of each voxel is independent from its neighborhood. Our method uses the 3D Fast Discrete Curvelet Transform to reduce the sampled voxels' interdependency by sampling voxels that are less dependent on their neighborhood, and thus provide a more accurate estimation of the mutual information and a more accurate registration. The main advantages of our method over other non-uniform sampling schemes are that: (1) it provides more accurate estimation of the image statistics with fewer samples; (2) it is less sensitive to the variability of anatomical structures shapes, orientations, and sizes, and; (3) it yields more accurate registration results. Extensive evaluation on 1000 synthetic registrations between T1 and T2-weighted clinical MRI images and 20 real clinical registrations of brain CT images to Proton Density (PD) and T1 and T2-weighted MRI images from the public RIRE database show the effectiveness of our method. Our method has the lowest mean registration errors recorded to date for CT-MR image registration in the RIRE website for methods tested on more than five datasets. These results indicate that our sampling scheme can be used to achieve more accurate multi-modal registration required for image guided therapy and surgery. (C) 2010 Elsevier B.V. All rights reserved.", "paper_title": "A curvelet-based patient-specific prior for accurate multi-modal brain image rigid registration", "paper_id": "WOS:000285233600011"}