{"auto_keywords": [{"score": 0.04930231023249969, "phrase": "bittorrent"}, {"score": 0.00481495049065317, "phrase": "content_availability"}, {"score": 0.004775726266706856, "phrase": "fast_distribution"}, {"score": 0.004329124434198367, "phrase": "multiple_related_files"}, {"score": 0.004224130367280183, "phrase": "single_larger_swarm"}, {"score": 0.003924121879214595, "phrase": "subjective_and_manual_manner"}, {"score": 0.0036008372531664726, "phrase": "bittorrent_swarming_system"}, {"score": 0.0033176589215021353, "phrase": "better_performance"}, {"score": 0.003277140908834426, "phrase": "swarming_system"}, {"score": 0.003056682083784002, "phrase": "nine_bundling_strategies"}, {"score": 0.0028161764476743257, "phrase": "time-varying_swarm_dynamics"}, {"score": 0.002659142621852998, "phrase": "tracker-based_bundling_system"}, {"score": 0.0025315126622525424, "phrase": "real_bittorrent"}, {"score": 0.0024398167078355224, "phrase": "-bundling_case"}, {"score": 0.002370794661629904, "phrase": "file_download_time"}, {"score": 0.002202123699556382, "phrase": "title-_and_tag-similarity_based_bundling_strategies"}, {"score": 0.0021049977753042253, "phrase": "based_bundling_strategies"}], "paper_keywords": ["Peer-to-peer", " BitTorrent", " Content bundling"], "paper_abstract": "BitTorrent, the immensely successful file swarming system, supports content bundling: a common strategy by which publishers package multiple related files and disseminate them via a single larger swarm. It has been reported that bundling in BitTorrent is wide-spread, currently being done in a subjective and manual manner by individual publishers. This paper is motivated by the following questions: What if bundling is automatically supported by the BitTorrent swarming system (e.g., at a tracker)? By what criteria and how can files be automatically bundled, for better performance of the swarming system? How much performance improvement could be obtained with such an automatic bundling system? To answer the questions, we first suggest nine bundling strategies based on (i) the attributes of the torrents such as title or tags and (ii) time-varying swarm dynamics such as torrent popularity or availability. We then propose and develop a tracker-based bundling system, where all the proposed bundling strategies are implemented and evaluated with a set of real BitTorrent traces. We show that all the proposed bundling strategies outperform no-bundling case in terms of the availability and file download time. The bundling strategy that bundles more popular/available torrents with less popular/available ones outperforms others in most cases. We find that title- and tag-similarity based bundling strategies also provide performance improvement comparable to those of the popularity/availability based bundling strategies. (C) 2014 Elsevier B.V. All rights reserved.", "paper_title": "Strategic bundling for content availability and fast distribution in BitTorrent", "paper_id": "WOS:000335612900006"}