{"auto_keywords": [{"score": 0.03610310423475187, "phrase": "single_type"}, {"score": 0.025638362630862357, "phrase": "dendritic_ones"}, {"score": 0.00481495049065317, "phrase": "gabaergic_interneurons"}, {"score": 0.00479698486626825, "phrase": "semi-supervised_projected_model-based_clustering"}, {"score": 0.004752362132726821, "phrase": "recently_introduced_pragmatic_scheme"}, {"score": 0.004708152527097594, "phrase": "useful_catalog"}, {"score": 0.004690583510896564, "phrase": "interneuron_names"}, {"score": 0.004629604248268786, "phrase": "digitally_reconstructed_interneuronal_morphologies"}, {"score": 0.00452689865483779, "phrase": "possible_subtypes"}, {"score": 0.004459691536881611, "phrase": "automatic_classification"}, {"score": 0.004240116703465252, "phrase": "common_basket"}, {"score": 0.004031308954378293, "phrase": "world's_leading_neuroscientists"}, {"score": 0.004001257964488576, "phrase": "five_simple_morphometric_properties"}, {"score": 0.0037828750857381937, "phrase": "class_information"}, {"score": 0.0037266725183182927, "phrase": "semi-supervised_clustering"}, {"score": 0.0036781781340563748, "phrase": "others'_cluster_membership"}, {"score": 0.003576368430933921, "phrase": "new_groups"}, {"score": 0.0034449771070543186, "phrase": "half_the_cells"}, {"score": 0.003387431241133385, "phrase": "clustering_model"}, {"score": 0.0033684629734643374, "phrase": "finite_mixture"}, {"score": 0.0031904741237384106, "phrase": "type_membership"}, {"score": 0.0029602552900111407, "phrase": "ht_cells"}, {"score": 0.0029053368919259985, "phrase": "cb_and"}, {"score": 0.002899962514018804, "phrase": "lb"}, {"score": 0.0027933643066932116, "phrase": "cb"}, {"score": 0.00252930673503721, "phrase": "formed_cluster_solutions"}, {"score": 0.0024317288573593135, "phrase": "axonal_morphometric_properties"}, {"score": 0.002391067964886602, "phrase": "axonal_polar_histogram_length"}, {"score": 0.002333530083198615, "phrase": "applied_semi-supervised_clustering_method"}, {"score": 0.002264607102799332, "phrase": "neuronal_classification"}, {"score": 0.0022434880661725493, "phrase": "potential_subtypes"}, {"score": 0.002177218756653181, "phrase": "axonal_variables"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Semi-supervised projected clustering", " Gaussian mixture models", " Automatic neuron classification", " Cerebral cortex"], "paper_abstract": "Objectives: A recently introduced pragmatic scheme promises to be a useful catalog of interneuron names. We sought to automatically classify digitally reconstructed interneuronal morphologies according to this scheme. Simultaneously, we sought to discover possible subtypes of these types that might emerge during automatic classification (clustering). We also investigated which morphometric properties were most relevant for this classification. Materials and methods: A set of 118 digitally reconstructed interneuronal morphologies classified into the common basket (CB), horse-tail (HT), large basket (LB), and Martinotti (MA) interneuron types by 42 of the world's leading neuroscientists, quantified by five simple morphometric properties of the axon and four of the dendrites. We labeled each neuron with the type most commonly assigned to it by the experts. We then removed this class information for each type separately, and applied semi-supervised clustering to those cells (keeping the others' cluster membership fixed), to assess separation from other types and look for the formation of new groups (subtypes). We performed this same experiment unlabeling the cells of two types at a time, and of half the cells of a single type at a time. The clustering model is a finite mixture of Gaussians which we adapted for the estimation of local (per-cluster) feature relevance. We performed the described experiments on three different subsets of the data, formed according to how many experts agreed on type membership: at least 18 experts (the full data set), at least 21 (73 neurons), and at least 26 (47 neurons). Results: Interneurons with more reliable type labels were classified more accurately. We classified HT cells with 100% accuracy, MA cells with 73% accuracy, and CB and LB cells with 56% and 58% accuracy, respectively. We identified three subtypes of the MA type, one subtype of CB and LB types each, and no subtypes of HT (it was a single, homogeneous type). We got maximum (adapted) Silhouette width and ARI values of 1, 0.83, 0.79, and 0.42, when unlabeling the HT, CB, LB, and MA types, respectively, confirming the quality of the formed cluster solutions. The subtypes identified when unlabeling a single type also emerged when unlabeling two types at a time, confirming their validity. Axonal morphometric properties were more relevant that dendritic ones, with the axonal polar histogram length in the [pi, 2 pi) angle interval being particularly useful. Conclusions: The applied semi-supervised clustering method can accurately discriminate among CB, HT, LB, and MA interneuron types while discovering potential subtypes, and is therefore useful for neuronal classification. The discovery of potential subtypes suggests that some of these types are more heterogeneous that previously thought. Finally, axonal variables seem to be more relevant than dendritic ones for distinguishing among the CB, HT, LB, and MA interneuron types. (C) 2015 Elsevier B.V. All rights reserved.", "paper_title": "Classifying GABAergic interneurons with semi-supervised projected model-based clustering", "paper_id": "WOS:000362140700006"}