{"auto_keywords": [{"score": 0.049483572884790016, "phrase": "wireless_full-duplex_bidirectional_links"}, {"score": 0.04889532068804289, "phrase": "wireless_full-duplex_transmission"}, {"score": 0.04577680896363523, "phrase": "conventional_half-duplex_transmission"}, {"score": 0.025093859497887887, "phrase": "wireless_bidirectional_links"}, {"score": 0.00481495049065317, "phrase": "power_allocations"}, {"score": 0.004494570360108983, "phrase": "system_throughput"}, {"score": 0.004248294537944227, "phrase": "maximum_potential_system_throughput"}, {"score": 0.004066076430818046, "phrase": "account_quality"}, {"score": 0.0036097844103129073, "phrase": "qos_driven_power_allocation_schemes"}, {"score": 0.0033905067962602515, "phrase": "statistical_qos_principle"}, {"score": 0.0025892330566358503, "phrase": "optimal_power_allocation_schemes"}, {"score": 0.002327310963701377, "phrase": "full-duplex_transmission"}, {"score": 0.002255431275670053, "phrase": "numerical_results"}, {"score": 0.002158505888557746, "phrase": "diverse_qos_requirements"}], "paper_keywords": ["full-duplex", " quality-of-service (QoS)", " power allocation", " self-interference", " wireless bidirectional links", " convex optimization"], "paper_abstract": "Wireless full-duplex transmission has the potential to double the system throughput compared with the conventional half-duplex transmission. To achieve the maximum potential system throughput, optimal power allocation taking into account quality-of-service (QoS) is urgently needed. In this paper, we propose the QoS driven power allocation schemes for wireless full-duplex bidirectional links. By integrating information theory with the statistical QoS principle, we build two models - local transmit power related self-interference (LTPRS) model and local transmit power unrelated self-interference (LTPUS) model to analyze the wireless full-duplex transmission. For both of these two models, we derive the optimal power allocation schemes, which aim at maximizing the system throughput subject to the given delay-QoS constraint, over wireless bidirectional links with full-duplex transmission. The analyses and numerical results verify that our proposed power allocation scheme can efficiently support diverse QoS requirements over wireless bidirectional links. Our proposed full-duplex QoS driven power allocation schemes can obtain larger effective capacity compared with the conventional half-duplex transmission over wireless bidirectional links.", "paper_title": "Quality-of-service driven power allocations for wireless full-duplex bidirectional links", "paper_id": "WOS:000333614700017"}