{"auto_keywords": [{"score": 0.04881990207677595, "phrase": "threshold_gradient"}, {"score": 0.007152368807539886, "phrase": "one-dimensional_consolidation"}, {"score": 0.005554767255692819, "phrase": "loading_period"}, {"score": 0.004646852519870358, "phrase": "general_approximate_analytical_solutions"}, {"score": 0.004405596416783185, "phrase": "time-dependent_loading"}, {"score": 0.004251728624599691, "phrase": "present_solution"}, {"score": 0.004195418010131832, "phrase": "available_numerical_solutions"}, {"score": 0.004139850082354509, "phrase": "particular_case"}, {"score": 0.003527550673371394, "phrase": "moving_boundary"}, {"score": 0.003314591878914152, "phrase": "slower_the_boundary_moves"}, {"score": 0.0032706520949775065, "phrase": "excess_pore_pressure"}, {"score": 0.003005539334280134, "phrase": "residual_excess_pore_pressure"}, {"score": 0.002952516738708181, "phrase": "average_degree"}, {"score": 0.002761856557698856, "phrase": "pore_pressure"}, {"score": 0.0021910825909008946, "phrase": "greater_the_average_degree"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Threshold gradient", " One dimensional consolidation", " Analytical solution", " Non-Darcy flow"], "paper_abstract": "General approximate analytical solutions are developed for one-dimensional consolidation with consideration of the threshold gradient under a time-dependent loading. A comparison is made between the present solution and some available numerical solutions for a particular case, and the results show that the approach employed in this article is reasonable. The influence of the threshold gradient and the loading period on consolidation behaviour is investigated, and the results show that the moving boundary of seepage moves downward gradually. The greater the threshold gradient is, the slower the boundary moves. The excess pore pressure will not be completely dissipated at the end of consolidation, and the larger the threshold gradient is, the greater the residual excess pore pressure is. The average degree of consolidation considering the threshold gradient defined by settlement is different from that defined by pore pressure. Moreover, the greater the threshold gradient is, the larger the average degree of consolidation in terms of strain, whereas the smaller the average degree of consolidation in terms of stress. It is also shown that the longer the loading period is, the longer the time moving boundary takes to reach the bottom of the layer, and the greater the average degree of consolidation is. (C) 2010 Elsevier Ltd. All rights reserved.", "paper_title": "Analytical solution for one-dimensional consolidation of clayey soils with a threshold gradient", "paper_id": "WOS:000278720300007"}