{"auto_keywords": [{"score": 0.04280931884725773, "phrase": "present_metaphor"}, {"score": 0.00481495049065317, "phrase": "timelypresent"}, {"score": 0.004777569299319633, "phrase": "single_purpose_information_appliance"}, {"score": 0.004703671193348433, "phrase": "three-generation_families"}, {"score": 0.004594951819987416, "phrase": "large_distances"}, {"score": 0.004559270778306828, "phrase": "different_time_zones"}, {"score": 0.004523865550323285, "phrase": "touch_screen_devices"}, {"score": 0.004407813106104401, "phrase": "family_members"}, {"score": 0.00430590253132963, "phrase": "short_video_clip"}, {"score": 0.004239268958511757, "phrase": "gift-wrapped_present"}, {"score": 0.004141238989360548, "phrase": "family_member"}, {"score": 0.004034962424068988, "phrase": "common_assumptions"}, {"score": 0.004003612361315299, "phrase": "electronic_devices"}, {"score": 0.003761390995418115, "phrase": "local_time"}, {"score": 0.0035707323534329835, "phrase": "qualitative_data"}, {"score": 0.0034971932704828197, "phrase": "open-ended_probe_study"}, {"score": 0.0032599633778910516, "phrase": "main_part"}, {"score": 0.0027311809666295565, "phrase": "'backward'_facing_cameras"}, {"score": 0.002654075026802161, "phrase": "forward_facing_camera"}, {"score": 0.0022760856906838814, "phrase": "social_needs"}, {"score": 0.0022583704173318123, "phrase": "previous_work"}, {"score": 0.0021661866204989336, "phrase": "playful_use"}, {"score": 0.0021493248730171132, "phrase": "subsequent_conversations"}, {"score": 0.0021381565332182773, "phrase": "synchronous_media"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Media gifts", " Asynchronous communication", " Family"], "paper_abstract": "TimelyPresent is a single purpose information appliance for asynchronous messaging to connect three-generation families whose members need to keep in touch across large distances and in different time zones. The touch screen devices are used in pairs situated in the homes of family members. A user at one end can create a short video clip that is represented as a gift-wrapped present to be sent to the home of another family member. To reinforce the present metaphor the design deliberately confounds common assumptions made about electronic devices in that the present having been sent is no longer accessible to the sender and is delayed so that it arrives at the local time that it was recorded. The paper first describes the process by which this design was derived from the qualitative data in the form of quotes from an open-ended probe study. This process served to preserve the richness of the information in the quotes, while at the same time providing 'requirements' for design. The main part of the paper describes the results from a 2-month, four-family field study of the device. Logs recording the behaviour of users of TimelyPresent, transcripts of 15 interviews, and 133 presents created by the participants were analysed. Analysis of the logs showed that the families needed to preview presents before sending them and repeatedly revisit them after receipt. The analysis of the content of the presents demonstrated the need for the 'forward' and 'backward' facing cameras, now commonly provided in tablets and phones. A forward facing camera is needed because 70% of the presents featured a recording of someone doing something. Other categories of topic were simple \"I am thinking of you\" messages (15%), \"things I've done\" (8%), and requests for action (7%). Analysis of the interviews confirmed many of the social needs identified in previous work in this area as well as the value of the present metaphor and its ability to support playful use that enhances subsequent conversations using synchronous media. (C) 2013 Elsevier Ltd. All rights reserved.", "paper_title": "TimelyPresent: Connecting families across continents", "paper_id": "WOS:000324353000007"}