{"auto_keywords": [{"score": 0.048743305268586584, "phrase": "tjsi"}, {"score": 0.008007114138258775, "phrase": "medline"}, {"score": 0.00481495049065317, "phrase": "analgesic_drug"}, {"score": 0.004747314816584038, "phrase": "bibliometric_indicator"}, {"score": 0.004641059497825104, "phrase": "kissin"}, {"score": 0.0037109446302945903, "phrase": "distinguishing_features"}, {"score": 0.0032575241721857343, "phrase": "controlled_trials"}, {"score": 0.0031219560710193106, "phrase": "\"me-too\"_drugs"}, {"score": 0.002941558420246247, "phrase": "drug_classes"}, {"score": 0.0028191026474004093, "phrase": "eight_classes"}, {"score": 0.0027480831196871093, "phrase": "five_specific_indicators"}, {"score": 0.0027094017157764027, "phrase": "drug's_distinguishing_pharmacological_properties"}, {"score": 0.00261876742054173, "phrase": "follow-on_drugs"}, {"score": 0.002460386486765124, "phrase": "negative_correlation"}, {"score": 0.002253299769886694, "phrase": "drug's_market_entry"}, {"score": 0.0021594338450797485, "phrase": "multiple_market_entrants"}, {"score": 0.0021229892538028937, "phrase": "new_addition"}, {"score": 0.0021049977753042253, "phrase": "questionable_value"}], "paper_keywords": ["Bibliometrics", " Biomedical journals", " Follow-on drugs", " First-in-class drug", " Pharmaceutical market", " Food and Drug Administration"], "paper_abstract": "To assess the probability of success of an analgesic drug we have proposed a bibliometric indicator, the Top Journals Selectivity Index (TJSI) (Kissin 2011). It represents the ratio (as %) between the number of all types of articles on a particular drug in the top 20 biomedical journals and the number of articles on that drug in all (> 5,000) journals covered by Medline over the first 5 years after that drug's introduction. The aim of this study was to demonstrate that TJSI may be used for the assessment of follow-on drugs (those that follow a first-in-class drug). The study tested two hypotheses. First, TJSI can detect the difference (in the same class) between drugs with distinguishing features and drugs without them (\"me-too\" drugs) better than other publication indices, i.e., the number of all types of articles on a drug in journals presented by Medline (AJI), and the number of articles covering only randomized controlled trials (RCT). Second, there is a relationship between the TJSI of \"me-too\" drugs and the order (sequential number) in which those drugs reached the market. The study was based on drug classes approved for marketing between the 1960's and the early 2000's. The eight classes that had 4 or more drugs were included for analysis. Five specific indicators were used to determine drug's distinguishing pharmacological properties. It was found that TJSI can detect the difference between follow-on drugs with distinguishing features and those without them better than the other publication indices (AJI or RCT). Our analysis also demonstrated a negative correlation (r = -0.372, p = 0.014) between the TJSI of drugs without distinguishing features (\"me-too\" drugs) and the order of the drug's market entry. This implies that TJSI could be useful for the assessment of situations with multiple market entrants in the same class when a new addition has a questionable value.", "paper_title": "Top journals selectivity index and \"me-too\" drugs", "paper_id": "WOS:000301188500009"}