{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "deterministic_part"}, {"score": 0.004670896353428476, "phrase": "general_reasoning_mechanisms"}, {"score": 0.0045726187330434025, "phrase": "appropriate_benchmarks"}, {"score": 0.004462819565604272, "phrase": "possible_applications"}, {"score": 0.004422325007817267, "phrase": "developed_technology"}, {"score": 0.004382196270563035, "phrase": "ai_planning"}, {"score": 0.0042252744467257885, "phrase": "benchmark_collections"}, {"score": 0.003916098498242888, "phrase": "significant_effort"}, {"score": 0.00386876598761639, "phrase": "useful_set"}, {"score": 0.003640516896245813, "phrase": "pipeline_networks"}, {"score": 0.0034994058470625986, "phrase": "umts"}, {"score": 0.0034570912464036234, "phrase": "adapting"}, {"score": 0.003343347953759631, "phrase": "ipc"}, {"score": 0.003223494720348768, "phrase": "careful_choice"}, {"score": 0.0031555744873774686, "phrase": "domain_encodings"}, {"score": 0.003117405395602633, "phrase": "first_time"}, {"score": 0.0030239842475439814, "phrase": "complex_domain_features"}, {"score": 0.0030056376712621793, "phrase": "simple_languages"}, {"score": 0.002978401006082176, "phrase": "strips"}, {"score": 0.0028890603352364273, "phrase": "simpler_language_subsets"}, {"score": 0.0028195727965553367, "phrase": "five_application_domains"}, {"score": 0.0027685531038981847, "phrase": "pddl_test_suites"}, {"score": 0.0027101925966844117, "phrase": "known_theoretical_results"}, {"score": 0.0026937446571204653, "phrase": "structural_properties"}, {"score": 0.002628942455803398, "phrase": "provable_properties"}, {"score": 0.002519257735651759, "phrase": "relaxed_plan"}, {"score": 0.002285389120812562, "phrase": "propositional_representations"}, {"score": 0.0022715134070706174, "phrase": "instance_size"}, {"score": 0.0021307975800397816, "phrase": "best_results"}, {"score": 0.0021049977753042253, "phrase": "different_kinds"}], "paper_keywords": [""], "paper_abstract": "In a field of research about general reasoning mechanisms, it is essential to have appropriate benchmarks. Ideally, the benchmarks should reflect possible applications of the developed technology. In AI Planning, researchers more and more tend to draw their testing examples from the benchmark collections used in the International Planning Competition (IPC). In the organization of ( the deterministic part of) the fourth IPC, IPC-4, the authors therefore invested significant effort to create a useful set of benchmarks. They come from five different ( potential) real-world applications of planning: airport ground traffic control, oil derivative transportation in pipeline networks, model-checking safety properties, power supply restoration, and UMTS call setup. Adapting and preparing such an application for use as a benchmark in the IPC involves, at the time, inevitable ( often drastic) simplifications, as well as careful choice between, and engineering of, domain encodings. For the first time in the IPC, we used compilations to formulate complex domain features in simple languages such as STRIPS, rather than just dropping the more interesting problem constraints in the simpler language subsets. The article explains and discusses the five application domains and their adaptation to form the PDDL test suites used in IPC-4. We summarize known theoretical results on structural properties of the domains, regarding their computational complexity and provable properties of their topology under the h(+) function ( an idealized version of the relaxed plan heuristic). We present new ( empirical) results illuminating properties such as the quality of the most wide-spread heuristic functions ( planning graph, serial planning graph, and relaxed plan), the growth of propositional representations over instance size, and the number of actions available to achieve each fact; we discuss these data in conjunction with the best results achieved by the different kinds of planners participating in IPC-4.", "paper_title": "Engineering benchmarks for planning: the domains used in the deterministic part of IPC-4", "paper_id": "WOS:000240204600001"}