{"auto_keywords": [{"score": 0.0496213341565463, "phrase": "attribute_reduction"}, {"score": 0.013036223252690876, "phrase": "fuzzy_rough_sets"}, {"score": 0.00948232313583489, "phrase": "fuzzy_approximation_operators"}, {"score": 0.004480196733208298, "phrase": "general_triangular_norm"}, {"score": 0.004270003565426343, "phrase": "different_types"}, {"score": 0.004050116768809519, "phrase": "different_fuzzy_approximation_operators"}, {"score": 0.0037322713756404295, "phrase": "theoretical_viewpoint"}, {"score": 0.0032416339126765743, "phrase": "fuzzy_lower_approximation_operator"}, {"score": 0.0030938932434437178, "phrase": "positive_region"}, {"score": 0.0030642636185693054, "phrase": "dependency_degree"}, {"score": 0.0026523079380037706, "phrase": "experimental_simulation_results"}, {"score": 0.0025398521156505425, "phrase": "theoretical_contributions"}, {"score": 0.0021771713131746636, "phrase": "crown_copyright"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["fuzzy rough sets", " fuzzy approximation operator", " attribute reduction", " triangular norm (t-norm)", " residual implicator"], "paper_abstract": "Generally speaking, there are four fuzzy approximation operators defined on a general triangular norm (t-norm) framework in fuzzy rough sets. Different types of t-norms specify various approximation operators. One issue whether and how the different fuzzy approximation operators affect the result of attribute reduction is then arisen. This paper addresses this issue from the theoretical viewpoint by reviewing attribute reduction with fuzzy rough sets and then describing and proving some theorems which demonstrate the effects of the fuzzy approximation operators on the results of attribute reduction. First, we review some notions of attribute reduction with fuzzy rough sets, such as positive region, dependency degree and attribute reduction. We then present and prove some theorems which describe how and to what degree fuzzy approximation operators impact the performance of attribute reduction. Finally, we report some experimental simulation results which demonstrate the effectiveness and correctness of the theoretical contributions. One main contribution in this paper is that we have described and proven that each attribute reduction obtained using one type of fuzzy lower approximation operator always contains one reduction obtained using the other type of fuzzy lower approximation operator. Crown Copyright (c) 2008 Published by Elsevier Inc. All rights reserved.", "paper_title": "On fuzzy approximation operators in attribute reduction with fuzzy rough sets", "paper_id": "WOS:000258052400002"}