{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "active_worms"}, {"score": 0.004780633011300165, "phrase": "major_security_threats"}, {"score": 0.00449859196755507, "phrase": "automated_fashion"}, {"score": 0.004202931484732134, "phrase": "great_challenges"}, {"score": 0.004011867299107537, "phrase": "new_class"}, {"score": 0.003708033700676924, "phrase": "traditional_worms"}, {"score": 0.00347657813672945, "phrase": "existing_worm_detection_systems"}, {"score": 0.0034148795808317555, "phrase": "propagation_traffic"}, {"score": 0.003247868216333148, "phrase": "comprehensive_comparison"}, {"score": 0.0029909851863915283, "phrase": "time_domain"}, {"score": 0.002896071795090179, "phrase": "frequency_domain"}, {"score": 0.0028446460307503343, "phrase": "recurring_manipulative_nature"}, {"score": 0.002724909017963099, "phrase": "novel_spectrum-based_scheme"}, {"score": 0.002686124293881678, "phrase": "c-worm"}, {"score": 0.0025822818714499795, "phrase": "scan_traffic_volume"}, {"score": 0.0025455220351023465, "phrase": "spectral_flatness_measure"}, {"score": 0.0025273434626077456, "phrase": "sfm"}, {"score": 0.002482443883144136, "phrase": "c-worm_traffic"}, {"score": 0.0024209250169088575, "phrase": "comprehensive_set"}, {"score": 0.0024036292057373803, "phrase": "detection_metrics"}, {"score": 0.0023609270767241215, "phrase": "background_traffic"}, {"score": 0.002327310963701377, "phrase": "extensive_performance_evaluations"}, {"score": 0.0022054488653549175, "phrase": "c-worm_propagation"}], "paper_keywords": ["Worm", " camouflage", " anomaly detection"], "paper_abstract": "Active worms pose major security threats to the Internet. This is due to the ability of active worms to propagate in an automated fashion as they continuously compromise computers on the Internet. Active worms evolve during their propagation, and thus, pose great challenges to defend against them. In this paper, we investigate a new class of active worms, referred to as Camouflaging Worm (C-Worm in short). The C-Worm is different from traditional worms because of its ability to intelligently manipulate its scan traffic volume over time. Thereby, the C-Worm camouflages its propagation from existing worm detection systems based on analyzing the propagation traffic generated by worms. We analyze characteristics of the C-Worm and conduct a comprehensive comparison between its traffic and nonworm traffic (background traffic). We observe that these two types of traffic are barely distinguishable in the time domain. However, their distinction is clear in the frequency domain, due to the recurring manipulative nature of the C-Worm. Motivated by our observations, we design a novel spectrum-based scheme to detect the C-Worm. Our scheme uses the Power Spectral Density (PSD) distribution of the scan traffic volume and its corresponding Spectral Flatness Measure (SFM) to distinguish the C-Worm traffic from background traffic. Using a comprehensive set of detection metrics and real-world traces as background traffic, we conduct extensive performance evaluations on our proposed spectrum-based detection scheme. The performance data clearly demonstrates that our scheme can effectively detect the C-Worm propagation. Furthermore, we show the generality of our spectrum-based scheme in effectively detecting not only the C-Worm, but traditional worms as well.", "paper_title": "Modeling and Detection of Camouflaging Worm", "paper_id": "WOS:000288453700004"}