{"auto_keywords": [{"score": 0.042519307045481215, "phrase": "ssdr_model"}, {"score": 0.015719716506582538, "phrase": "rigid_bones"}, {"score": 0.005522219259713384, "phrase": "weight_map"}, {"score": 0.004658426838467567, "phrase": "smooth_skinning_decomposition"}, {"score": 0.00433645229352341, "phrase": "linear_blend"}, {"score": 0.003948613642680196, "phrase": "skin_deformation"}, {"score": 0.0039053194919285725, "phrase": "nearly_articulated_models"}, {"score": 0.003820144626025562, "phrase": "highly_deformable_models"}, {"score": 0.003757480190200645, "phrase": "low_number"}, {"score": 0.003459191419478298, "phrase": "least_squared_error"}, {"score": 0.0034024277222012597, "phrase": "reconstructed_vertices"}, {"score": 0.003365105314790612, "phrase": "lbs"}, {"score": 0.003132236287543072, "phrase": "descent-based_algorithm"}, {"score": 0.002996992362027833, "phrase": "bone_transformations"}, {"score": 0.002883439044844259, "phrase": "convex_constraints"}, {"score": 0.002713604305939145, "phrase": "traditional_skinning_decomposition_tasks"}, {"score": 0.002669042572650594, "phrase": "animation_compression"}, {"score": 0.002639740960006001, "phrase": "hardware-accelerated_rendering"}, {"score": 0.002539689093411356, "phrase": "orthogonal_constraints"}, {"score": 0.002497976173193543, "phrase": "bone_rotation_matrices"}, {"score": 0.0023249757987087033, "phrase": "motion_editing"}, {"score": 0.0022994427535192492, "phrase": "skeleton_extraction"}, {"score": 0.002261666793030715, "phrase": "collision_detection_tasks"}, {"score": 0.002224510044064184, "phrase": "qualitative_and_quantitative_evaluations"}, {"score": 0.0021049977753042253, "phrase": "state-of-the-art_skinning_decomposition_schemes"}], "paper_keywords": ["Skinning Decomposition", " Linear Blend Skinning", " Geometric Deformation", " Block Coordinate Descent"], "paper_abstract": "This paper introduces the Smooth Skinning Decomposition with Rigid Bones (SSDR), an automated algorithm to extract the linear blend skinning (LBS) from a set of example poses. The SSDR model can effectively approximate the skin deformation of nearly articulated models as well as highly deformable models by a low number of rigid bones and a sparse, convex bone-vertex weight map. Formulated as a constrained optimization problem where the least squared error of the reconstructed vertices by LBS is minimized, the SSDR model can be solved by a block coordinate descent-based algorithm to iteratively update the weight map and the bone transformations. By employing the sparseness and convex constraints on the weight map, the SSDR model can be used for traditional skinning decomposition tasks such as animation compression and hardware-accelerated rendering. Moreover, by imposing the orthogonal constraints on the bone rotation matrices (rigid bones), the SSDR model can also be applied in motion editing, skeleton extraction, and collision detection tasks. Through qualitative and quantitative evaluations, we show the SSDR model can measurably outperform the state-of-the-art skinning decomposition schemes in terms of accuracy and applicability.", "paper_title": "Smooth Skinning Decomposition with Rigid Bones", "paper_id": "WOS:000311298900073"}