{"auto_keywords": [{"score": 0.01563488108349265, "phrase": "facial_features"}, {"score": 0.005215614738618046, "phrase": "existing_approaches"}, {"score": 0.00481495049065317, "phrase": "automatic_alteration"}, {"score": 0.0046340196745259694, "phrase": "modern_society"}, {"score": 0.004571055044692412, "phrase": "celebrity_community"}, {"score": 0.004435514622798228, "phrase": "drastic_procedures"}, {"score": 0.0042804804366777865, "phrase": "desired_beauty"}, {"score": 0.004187769037438816, "phrase": "cosmetic_plastic_surgeries"}, {"score": 0.004063547375196532, "phrase": "accidental_burns"}, {"score": 0.0039000478602699267, "phrase": "related_surgeries"}, {"score": 0.003602302241898501, "phrase": "facial_appearance"}, {"score": 0.0034102660898135155, "phrase": "associated_individual_facial_feature"}, {"score": 0.003382354267177914, "phrase": "automatic_and_user-friendly_manner"}, {"score": 0.0032107911131811057, "phrase": "previewing_functionality"}, {"score": 0.0031069334778456633, "phrase": "desired_results"}, {"score": 0.0030229485340586473, "phrase": "facial_cosmetic_surgeries"}, {"score": 0.0029573932605287947, "phrase": "overall_look"}, {"score": 0.0027389142053945246, "phrase": "higher_face"}, {"score": 0.002679501909303057, "phrase": "existing_tools"}, {"score": 0.0026575551838540676, "phrase": "manual_effort"}, {"score": 0.002564505790176378, "phrase": "active_shape_model"}, {"score": 0.002488314616747901, "phrase": "automatic_feature_extraction"}, {"score": 0.002434325036513103, "phrase": "user_assistance"}, {"score": 0.002323446065342625, "phrase": "facial_feature_alteration_process"}, {"score": 0.0021458053922984725, "phrase": "user_study"}], "paper_keywords": ["Poisson image editing", " Feature extraction", " Active shape model", " Facial feature alteration"], "paper_abstract": "Pursuing or maintaining beautifulness nowadays has become a trend in modern society, especially among the celebrity community. In some cases, one may choose to adopt drastic procedures to alter his or her facial or body features to achieve the desired beauty, thus the blossom of industry on cosmetic plastic surgeries. In addition, people whose faces got damaged due to accidental burns or wounds may also find these surgeries necessary. However, as performing the related surgeries are still considered intrusive and costly, it is better to \"preview\" the result before a surgery is actually carried out. As many believe that facial appearance matters most, we have developed a system that allows a user to input a photo and changes the associated individual facial feature in an automatic and user-friendly manner. Overall speaking, our system makes contributions in the following four aspects. First, our system not only offers the previewing functionality, but also allows users to interactively fine-tune the desired results, thus making it a useful companion tool for facial cosmetic surgeries. Second, instead of exchanging the overall look of a face, as being done by some existing approaches, our system offers much finer granularity by allowing each and every facial feature to be changed individually and independently, thus achieving higher face-off flexibility. Third, while existing tools generally entail manual effort to locate or align facial features, our system, through the help of Active Shape Model or ASM for short, characterized by a scheme of automatic feature extraction, eliminates most of the needs of user assistance. Finally, for convenience, we have constructed a database of facial features to facilitate the facial feature alteration process. To justify our claims, we have rendered results and compared them with those from existing approaches to demonstrate the effectiveness of our system. We have also conducted a user study to further confirm the usefulness of such a system.", "paper_title": "Face-off: automatic alteration of facial features", "paper_id": "WOS:000300189700009"}