{"auto_keywords": [{"score": 0.0263277198586727, "phrase": "osnl"}, {"score": 0.00481495049065317, "phrase": "learners'_cognitive_states"}, {"score": 0.004761921624054327, "phrase": "information_literacy_teaching_intervention"}, {"score": 0.004348448186047243, "phrase": "learning_intervention"}, {"score": 0.004272039593833004, "phrase": "higher_order_information_literacy"}, {"score": 0.004196967952791991, "phrase": "theoretical_perspective"}, {"score": 0.003918269434468073, "phrase": "information_literacies"}, {"score": 0.003900935454519472, "phrase": "first-year_undergraduates"}, {"score": 0.003883696334494951, "phrase": "sport"}, {"score": 0.0038493904877353463, "phrase": "staffordshire_university"}, {"score": 0.0037985240125264163, "phrase": "il._interventions"}, {"score": 0.0037733424351498843, "phrase": "blended_approach"}, {"score": 0.0036987911993764597, "phrase": "online_social_network"}, {"score": 0.0035304960572823544, "phrase": "information_literacy"}, {"score": 0.0034838287678944234, "phrase": "source_material"}, {"score": 0.0033998628713384966, "phrase": "online_discussion"}, {"score": 0.003090542713252636, "phrase": "cognitive_data"}, {"score": 0.0029827509332958973, "phrase": "osnl._findings"}, {"score": 0.002976139783294199, "phrase": "-_the_changing_cognitive_states"}, {"score": 0.0029108265450218953, "phrase": "evident_key_cognitive_states"}, {"score": 0.0028406315598594294, "phrase": "diagrammatic_and_mathematical_notation"}, {"score": 0.002784456710464582, "phrase": "information_behaviours"}, {"score": 0.002628320365640851, "phrase": "il_intervention"}, {"score": 0.0024210646274091213, "phrase": "undergraduate_students"}, {"score": 0.002383757789481936, "phrase": "il"}, {"score": 0.002367903927957999, "phrase": "additional_long-term_data"}, {"score": 0.0023210557338548946, "phrase": "lasting_impact"}, {"score": 0.0022954297194677604, "phrase": "practical_implications"}, {"score": 0.002205491268488704, "phrase": "peer-to-peer_assessment"}, {"score": 0.0021763000883965725, "phrase": "deeper_learning"}], "paper_keywords": ["Behaviour", " Electronic resources", " Social networks", " Learning", " Cognition", " Critical thinking"], "paper_abstract": "Purpose - This paper seeks to identify the changes in cognition associated with becoming information-literate, specifically, in relation to the evaluation of information. Additionally, it puts forward a model for a teaching and learning intervention that engages the learner and leads to higher order information literacy (IL) thinking. From a theoretical perspective the research integrates ideas from the fields of IL, teaching and learning, e-learning and information behaviour (IB). Design/methodology/approach - Three interventions were designed to develop the information literacies of first-year undergraduates studying Sport and Exercise at Staffordshire University, to teach and test IL. Interventions took a blended approach and combined face-to-face and online social network learning (OSNL) - also referred to as social media learning (SML) - and focused on one aspect of information literacy: the ability to evaluate source material. Data were captured via interviews, focus groups and from the online discussion that was analysed thematically and categorised using task, behaviour, cognitive states, affective states, cognitive states and knowledge. This helped to evaluate the efficacy of the interventions and provided data for further analysis. This paper focuses on the cognitive data and their transitions during the interventions and, in particular, among those respondents who experienced OSNL. Findings - The changing cognitive states, associated with IL learning were modelled and made evident key cognitive states and transitions. This is represented in the paper in diagrammatic and mathematical notation. The findings indicate the complexity of the information behaviours associated with IL including the cognitive, behavioural, cognitive and affective elements. Although the cognitive transitions are the focus of this paper, an insight is also given into an IL intervention that fosters the capability to interact critically and reflectively with information. The pedagogy that underpins these changes is indicated. The intervention, which incorporated OSNL, proved the most successful. Research limitations/implications - Undergraduate students' IB can be changed and IL developed. Additional long-term data would have indicated whether this intervention had a lasting impact on the undergraduates. Practical implications - IL practitioners should consider incorporating OSNL and assessment in their interventions. Incorporating discussion, reflection and peer-to-peer assessment is likely to lead to deeper learning when teaching IL. Originality/value - The research adds detail to the understanding of the cognitive, behavioural, affective and cognitive states associated with IL and makes explicit how these may change, as the learner becomes information-literate.", "paper_title": "A longitudinal study of changes in learners' cognitive states during and following an information literacy teaching intervention", "paper_id": "WOS:000291373700005"}