{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "weighted_voting_games"}, {"score": 0.03661423204176572, "phrase": "player's_power"}, {"score": 0.004733123544564746, "phrase": "simple_model"}, {"score": 0.004636756166068091, "phrase": "human_societies"}, {"score": 0.004605069682942661, "phrase": "multi-agent_systems"}, {"score": 0.004374192072307276, "phrase": "players'_weights"}, {"score": 0.004112303664150895, "phrase": "total_weight"}, {"score": 0.003892655187180623, "phrase": "weighted_voting_game"}, {"score": 0.0036846952802928, "phrase": "player's_marginal_contribution"}, {"score": 0.00365949103351756, "phrase": "different_coalition_formation_scenarios"}, {"score": 0.0033014033657620375, "phrase": "tight_bounds"}, {"score": 0.0032340913850061764, "phrase": "individual_player's_power"}, {"score": 0.003082302636409597, "phrase": "efficient_algorithm"}, {"score": 0.00265909739882579, "phrase": "relative_power"}, {"score": 0.0025604827895852646, "phrase": "one's_choice"}, {"score": 0.002374063735432571, "phrase": "complexity_class_pp"}, {"score": 0.0022163699144426155, "phrase": "even_small_changes"}, {"score": 0.0021711323811863963, "phrase": "significant_effect"}, {"score": 0.002105007807034302, "phrase": "elsevier"}], "paper_keywords": ["Weighted voting games", " Manipulation", " Complexity"], "paper_abstract": "Weighted voting games provide a simple model of decision-making in human societies and multi-agent systems. Such games are described by a set of players, a list of players' weights, and a quota; a coalition of the players is said to be winning if the total weight of its members meets or exceeds the quota. The power of a player in a weighted voting game is traditionally identified with her Shapley-Shubik index or her Banzhaf index, two classic power measures that reflect the player's marginal contribution under different coalition formation scenarios. In this paper, we investigate by how much one can change a player's power, as measured by these indices, by modifying the quota. We give tight bounds on the changes in the individual player's power that can result from a change in quota. We then describe an efficient algorithm for determining whether there is a value of the quota that makes a given player a dummy, i.e., reduces her power (as measured by both indices) to 0. We also study how the choice of quota can affect the relative power of the players. Finally, we investigate scenarios where one's choice in setting the quota is constrained. We show that optimally choosing between two values of the quota is complete for the complexity class PP, which is believed to be significantly more powerful than NP. On the other hand, we empirically demonstrate that even small changes in quota can have a significant effect on a player's power. (C) 2012 Elsevier By. All rights reserved.", "paper_title": "Manipulating the quota in weighted voting games", "paper_id": "WOS:000301694000001"}