{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "requisite_personal_holism"}, {"score": 0.004582423717777699, "phrase": "professional_entities"}, {"score": 0.0039049226745413224, "phrase": "specialized_professionals"}, {"score": 0.0035908627899097407, "phrase": "interdisciplinary_cooperation"}, {"score": 0.00348300993356662, "phrase": "high_level"}, {"score": 0.0032519989404960073, "phrase": "psychic_well-being"}, {"score": 0.003106541164572609, "phrase": "individual_techniques"}, {"score": 0.0030595112110658675, "phrase": "special_strategies"}, {"score": 0.0029450186031370245, "phrase": "human_resource_management"}, {"score": 0.0028025465173190348, "phrase": "hrm"}, {"score": 0.00266693888510356, "phrase": "special_programs"}, {"score": 0.0022719915771356354, "phrase": "most-often_applied_programs"}, {"score": 0.0021049977753042253, "phrase": "personal_growth"}], "paper_keywords": ["individuals", " organization", " human resource management", " well-being management", " requisite holism"], "paper_abstract": "Organizations should look at humans as multilayered, not only as professional entities. In synergy, not only individually, we define humans as: (1) physical, (2) mental, (3) social, (4) spiritual, and (5) economic entities, marked by requisitely holistic patterns of relatively permanent characteristics, due to which individuals differ from each other; they differ also as specialized professionals. All these and other attributes form synergies. On this basis, the behavior of individuals who are willing to practice interdisciplinary cooperation becomes socially responsible and they have a high level of well-being. Individuals as well as organizations seek requisite personal holism (RPH) on the one hand and psychic well-being (PWB) on the other hand. Thus, individuals implement individual techniques and organizations implement special strategies, programs, and actions in the frame of human resource management (HRM). That is how organizations in the frame of HRM, more specifically in the frame of management well-being, are developing special programs for managing PWB. These programs are based on their RPH and organizations might help employees to feel respected and valued in their work settings, without regard to their culture, religion, ethnicity, gender, age, disability, or other individual differences. The most-often applied programs of the kind include: (1) stress management programs, (2) diversity management programs, (3) wellness programs, (4) employee assistance programs, and (5) programs for personal growth.", "paper_title": "The Conceptual Model of Well-Being Management Based on Achieving Requisite Personal Holism", "paper_id": "WOS:000354122300003"}