{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "exploring_user"}, {"score": 0.004745665541429529, "phrase": "social_computing_systems"}, {"score": 0.004287680323820891, "phrase": "online_social_computing_systems"}, {"score": 0.004150030918669128, "phrase": "user_factors"}, {"score": 0.004060718465754644, "phrase": "prior_research"}, {"score": 0.003973320429450603, "phrase": "conceptual_model"}, {"score": 0.0034995881411519925, "phrase": "web-based_survey"}, {"score": 0.003424225677958491, "phrase": "flickr_online_photo_sharing_community"}, {"score": 0.003362660648932247, "phrase": "empirical_results"}, {"score": 0.0033262524445013303, "phrase": "hypothesized_inverse_relationship"}, {"score": 0.0031845067058084583, "phrase": "user's_tenure"}, {"score": 0.003059869469624301, "phrase": "user's_quantity"}, {"score": 0.0029722900280316216, "phrase": "intrinsic_motivation"}, {"score": 0.0028045585284215044, "phrase": "extrinsic_motivation"}, {"score": 0.002754103864198219, "phrase": "users'_social_embeddedness"}, {"score": 0.0026366753045215558, "phrase": "social_ties"}, {"score": 0.002416589459425828, "phrase": "online_communities"}, {"score": 0.0023817332409567403, "phrase": "sustained_contributions"}, {"score": 0.0023644936731468252, "phrase": "individual_users"}, {"score": 0.002230984431056064, "phrase": "online_information"}, {"score": 0.0021987994275190314, "phrase": "inverse_relationship"}, {"score": 0.0021049977753042253, "phrase": "different_user_factors"}], "paper_keywords": ["Quality", " Motivations", " Social computing", " Online communities", " Quantity", " User contributed information"], "paper_abstract": "Purpose - The objective of this paper is to explore empirically the relationship between quantity and quality of user contributed information in online social computing systems, and how these two performance outcomes are associated with user factors. Design/methodology/approach - Drawing from prior research, the paper presents a conceptual model hypothesizing a tradeoff between quality and quantity of user contributed information. In addition quality and quantity are associated with a set of motivational, cognitive, and social factors. The model was tested using data obtained through a web-based survey of 345 users of the Flickr online photo sharing community. Findings - The empirical results support the hypothesized inverse relationship between quantity and quality of user contributed information, moderated by user's tenure in the community. The findings also suggest that a user's quantity of contribution is positively associated with the intrinsic motivation of commitment to the community, whereas quality of contribution is positively associated with the extrinsic motivation of self-development. While users' social embeddedness is associated with quality and quantity of contribution, virtualness of social ties is only associated with quality of contribution. Practical implications - The findings of this study can inform the design and management of online communities, and promote sustained contributions from individual users. Originality/value - This study extends our knowledge of the quality and quantity of user contributed online information by demonstrating the inverse relationship between these two performance outcomes, and that they could be motivated by different user factors.", "paper_title": "Exploring user contributed information in social computing systems: quantity versus quality", "paper_id": "WOS:000326132600005"}