{"auto_keywords": [{"score": 0.045564769581910566, "phrase": "discrete-event_simulation"}, {"score": 0.02671620394877005, "phrase": "user_interaction"}, {"score": 0.00481495049065317, "phrase": "runtime_user_interaction"}, {"score": 0.004765173195920904, "phrase": "concurrent_simulation-animations_of_construction_operations"}, {"score": 0.004453874101119545, "phrase": "accurate_modeling"}, {"score": 0.004407813106104401, "phrase": "complex_construction_operations"}, {"score": 0.0038304902197108643, "phrase": "remaining_course"}, {"score": 0.0037321585095070483, "phrase": "next_logical_step"}, {"score": 0.0036363418376496484, "phrase": "simulation_modeling"}, {"score": 0.0031762308449055305, "phrase": "course_events"}, {"score": 0.0029994894380575604, "phrase": "virtual_environments"}, {"score": 0.0028325548627901004, "phrase": "user_interaction_architecture"}, {"score": 0.0022879728308318205, "phrase": "model_developers"}], "paper_keywords": [""], "paper_abstract": "Current state-of-the-art tools allow for the accurate modeling of complex construction operations using discrete-event simulation and their realistic postprocessed three-dimensional animation. Due to the postprocessed nature of these animations it is not possible to interact with them so as to affect the remaining course of actions. The next logical step in the evolution of simulation modeling and visualization in construction is for simulations and animations to run concurrently and in a manner that allows interaction with the animation to affect the course events in the simulation. This effectively enables the creation of virtual environments with logic based on discrete-event simulation. This paper presents the user interaction architecture that accomplishes this. In particular, the paper presents: (a) the conceptualization developed to design the components for user interaction and (b) the design of the components with a focus on (i) empowering model developers to enable user interaction in their models and (ii) extensibility to enable the development of more advanced user interaction techniques.", "paper_title": "Runtime User Interaction in Concurrent Simulation-Animations of Construction Operations", "paper_id": "WOS:000270913900009"}