{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "object-oriented_software"}, {"score": 0.00849549152904311, "phrase": "large-scale_object-oriented_applications"}, {"score": 0.004608879242346434, "phrase": "crucial_attribute"}, {"score": 0.004498213310668266, "phrase": "performance_analysis"}, {"score": 0.004263972370406983, "phrase": "modern_applications"}, {"score": 0.0040027552011993005, "phrase": "real-world_software_development_struggle"}, {"score": 0.0036671822784770463, "phrase": "software_performance"}, {"score": 0.00323134923196813, "phrase": "systematic_mapping_study"}, {"score": 0.003200045185608395, "phrase": "empirical_performance_analysis"}, {"score": 0.0030628762739398855, "phrase": "keyword_searches"}, {"score": 0.0030331993611107328, "phrase": "leading_software_engineering_research_databases"}, {"score": 0.0029602552900111433, "phrase": "relevant_venues"}, {"score": 0.0026986685585382347, "phrase": "ten_facets"}, {"score": 0.0024601402359002056, "phrase": "main_contributions"}, {"score": 0.002424450174817922, "phrase": "existing_literature"}, {"score": 0.0023431692392929353, "phrase": "interesting_opportunities"}, {"score": 0.002135995282374723, "phrase": "significant_challenges"}, {"score": 0.0021049977753042253, "phrase": "actionable_feedback"}], "paper_keywords": ["Systematic review", " survey", " performance", " object-oriented"], "paper_abstract": "Performance is a crucial attribute for most software, making performance analysis an important software engineering task. The difficulty is that modern applications are challenging to analyse for performance. Many profiling techniques used in real-world software development struggle to provide useful results when applied to large-scale object-oriented applications. There is a substantial body of research into software performance generally but currently there exists no survey of this research that would help identify approaches useful for object-oriented software. To provide such a review we performed a systematic mapping study of empirical performance analysis approaches that are applicable to object-oriented software. Using keyword searches against leading software engineering research databases and manual searches of relevant venues we identified over 5,000 related articles published since January 2000. From these we systematically selected 253 applicable articles and categorised them according to ten facets that capture the intent, implementation and evaluation of the approaches. Our mapping study results allow us to highlight the main contributions of the existing literature and identify areas where there are interesting opportunities. We also find that, despite the research including approaches specifically aimed at object-oriented software, there are significant challenges in providing actionable feedback on the performance of large-scale object-oriented applications.", "paper_title": "Performance Analysis for Object-Oriented Software: A Systematic Mapping", "paper_id": "WOS:000358247100004"}