{"auto_keywords": [{"score": 0.0463029146299098, "phrase": "functional_status"}, {"score": 0.02895364011542305, "phrase": "time_trend"}, {"score": 0.007984930644685341, "phrase": "simulation_studies"}, {"score": 0.00481495049065317, "phrase": "dichotomized_functional_outcome"}, {"score": 0.0047057084749407485, "phrase": "northern_manhattan_study"}, {"score": 0.004509334110321336, "phrase": "nomas"}, {"score": 0.004406994912939125, "phrase": "stroke_survivors"}, {"score": 0.0042928648367867835, "phrase": "generalized_estimating_equation_models"}, {"score": 0.004264795176205885, "phrase": "previous_parametric_analysis"}, {"score": 0.0040467190009206445, "phrase": "insurance_status"}, {"score": 0.0036673238814279286, "phrase": "nonparametric_time_trend"}, {"score": 0.003400640983719424, "phrase": "semiparametric_model"}, {"score": 0.0032908057622663732, "phrase": "interaction_term"}, {"score": 0.0032054891061528896, "phrase": "parametric_model"}, {"score": 0.0031532895341013297, "phrase": "model_misspecification"}, {"score": 0.0030314419455512013, "phrase": "misspecified_parametric_models"}, {"score": 0.002962543869356265, "phrase": "adjusted_covariates"}, {"score": 0.0028762499230524812, "phrase": "link_function"}, {"score": 0.0025892330566358503, "phrase": "misspecified_parametric_estimators"}, {"score": 0.002377206033025253, "phrase": "adjusted_covariate"}, {"score": 0.002255431275670053, "phrase": "significant_gain"}, {"score": 0.002218668420806254, "phrase": "semiparametric_model-based_estimators"}, {"score": 0.0021896891011033105, "phrase": "parametric_model-based_estimators"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Generalized estimating equation", " Kernel method", " Regression splines", " Semiparametric longitudinal data analysis"], "paper_abstract": "The Northern Manhattan Study (NOMAS) is a prospective, population-based study. One of the goals of NOMAS is to characterize the functional status of stroke survivors over time after stroke. Based on generalized estimating equation models, previous parametric analysis showed that functional status declines over time and the trajectories of decline are different depending on insurance status. The two trends of functional status may not be linear, which motivates our semiparametric modeling. In this paper, we model the time trend nonparametrically, the associated covariates parametrically and an interaction term between the nonparametric time trend and a covariate. We consider both kernel weighted local polynomial-based and regression spline-based approaches for solving the semiparametric model, and propose a statistic to test for the interaction term. To evaluate the performance of the parametric model in the case of model misspecification, we study the bias and efficiency of the estimators from misspecified parametric models. We find that when the adjusted covariates are independent of the time, and the link function is identity, the estimators for those covariates are asymptotically unbiased, even if the time trend is misspecified. In general, however, under other conditions and nonidentity link, the misspecified parametric estimators are biased and less efficient even when they are unbiased. We compute the ARE and also conduct simulation studies and compare power for testing the adjusted covariate when the time trend is modeled parametrically versus nonparametrically. In the simulation studies, we observe significant gain in power of those semiparametric model-based estimators compared to the parametric model-based estimators in the cases when the time trend is nonlinear. Published by Elsevier B.V.", "paper_title": "Semiparametric model for the dichotomized functional outcome after stroke: The Northern Manhattan Study", "paper_id": "WOS:000303035000018"}