{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "sensor_networks"}, {"score": 0.02841516498670768, "phrase": "implicit_communication"}, {"score": 0.0047872135686404275, "phrase": "sequential_detection"}, {"score": 0.004759635663291431, "phrase": "sequential_detection_problems"}, {"score": 0.004664352260912174, "phrase": "true_state"}, {"score": 0.0045709675813472884, "phrase": "binary_random_variable_h"}, {"score": 0.004544629724830453, "phrase": "known_prior_distribution"}, {"score": 0.004492406361795448, "phrase": "n_sensors"}, {"score": 0.004466519142879166, "phrase": "noisy_observations"}, {"score": 0.0041074234667687875, "phrase": "subset_p-i_subset"}, {"score": 0.003978866233891427, "phrase": "subset_c-i_subset"}, {"score": 0.003955926499405168, "phrase": "n._each"}, {"score": 0.003887894704361635, "phrase": "stopping_problem"}, {"score": 0.003523822585025555, "phrase": "binary_decision"}, {"score": 0.0034732277874585968, "phrase": "c-i"}, {"score": 0.0033353809745319857, "phrase": "i's_binary_decision"}, {"score": 0.0032309093154028663, "phrase": "operational_costs"}, {"score": 0.003166132209407694, "phrase": "communication_costs"}, {"score": 0.0030141556259370675, "phrase": "terminal_cost"}, {"score": 0.0029708567739251254, "phrase": "true_hypothesis_h"}, {"score": 0.002820052889643225, "phrase": "decision_strategies"}, {"score": 0.0027634902834910184, "phrase": "total_expected_cost"}, {"score": 0.0022176487309947266, "phrase": "sufficient_statistic"}, {"score": 0.0022048406330100697, "phrase": "decision_making"}, {"score": 0.0021794454466797382, "phrase": "signaling_possibilities"}, {"score": 0.0021049977753042253, "phrase": "received_messages"}], "paper_keywords": ["Decentralized detection", " optimal stopping rules", " signaling"], "paper_abstract": "Sequential detection problems in sensor networks are considered. The true state of nature/true hypothesis is modeled as a binary random variable H with known prior distribution. There are N sensors making noisy observations about the hypothesis; N = {1, 2,..., N} denotes the set of sensors. Sensor i can receive messages from a subset P-i subset of N of sensors and send a message to a subset C-i subset of N. Each sensor is faced with a stopping problem. At each time t, based on the observations, it has taken so far and the messages it may have received, sensor i can decide to stop and communicate a binary decision to the sensors in C-i, or it can continue taking observations and receiving messages. After sensor i's binary decision has been sent, it becomes inactive. Sensors incur operational costs (cost of taking observations, communication costs, etc.) while they are active. In addition, the system incurs a terminal cost that depends on the true hypothesis H, the sensors' binary decisions, and their stopping times. The objective is to determine decision strategies for all sensors to minimize the total expected cost. Even though sensors only communicate their final decisions, there is implicit communication every time a sensor decides not to stop. This implicit communication through decisions is referred to as signaling. The general communication structure results in complex signaling opportunities in our problem. Despite the generality of our model and the complexity of signaling involved, it is shown that the a sensor's posterior belief on the hypothesis ( conditioned on its observations and received messages) and its received messages constitute a sufficient statistic for decision making and that all signaling possibilities are effectively captured by a 4-threshold decision rule where the thresholds depend on received messages.", "paper_title": "Signaling in Sensor Networks for Sequential Detection", "paper_id": "WOS:000365084700004"}