{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "information_systems"}, {"score": 0.00789661995736144, "phrase": "maximal_consistent_extensions"}, {"score": 0.004552981066668676, "phrase": "different_sets"}, {"score": 0.003899269293218826, "phrase": "subjective_view"}, {"score": 0.003799796252156605, "phrase": "information_system"}, {"score": 0.0036710872046569532, "phrase": "different_problems"}, {"score": 0.0034562118159899772, "phrase": "concurrent_processes"}, {"score": 0.003310447652300423, "phrase": "maximal_consistent_extension"}, {"score": 0.0026116610153271943, "phrase": "true_and_realizable_inhibitory_rules"}, {"score": 0.0024586427394152196, "phrase": "algorithmic_problems"}, {"score": 0.0023447155524245655, "phrase": "obtained_results"}, {"score": 0.0022651818270925704, "phrase": "new_sets"}, {"score": 0.002197801146305747, "phrase": "inhibitory_rules"}, {"score": 0.0021601997088758957, "phrase": "higher_quality"}, {"score": 0.0021049977753042253, "phrase": "deterministic_rules"}], "paper_keywords": ["knowledge representation", " rough sets", " information systems", " maximal consistent extensions"], "paper_abstract": "Knowledge encoded in information systems can be represented by different sets of rules generated by these systems. One can consider sets of deterministic, nondeterministic or probabilistic rules. Such sets of rules can be treated as theories of information systems. Any such a theory generated from a given information system corresponds to a subjective view on knowledge encoded in this information system. Such theories can be used for solving different problems. For example, the maximal consistent extensions of information systems were studied for synthesis of concurrent processes specified by information systems. In this approach, the maximal consistent extension of a given information system consists of all objects perceived by means of attributes which are consistent with the theory including all the so called true and realizable deterministic rules extracted from the original information system. In this paper, we report results on the maximal consistent extensions of information systems relative to some other theories of information systems, e.g., theories consisting of rules such as true and realizable inhibitory rules, true inhibitory rules, and true deterministic rules. We also discuss algorithmic problems related to the maximal consistent extensions. In particular, from the obtained results it follows that solutions based on these new sets of rules, e.g., on inhibitory rules can be of higher quality than in the case of deterministic rules. (C) 2008 Elsevier Inc. All rights reserved.", "paper_title": "Maximal consistent extensions of information systems relative to their theories", "paper_id": "WOS:000256289100008"}