{"auto_keywords": [{"score": 0.048512039224227546, "phrase": "conceptual_framework"}, {"score": 0.004761850836420121, "phrase": "workflow_research"}, {"score": 0.004606023493393774, "phrase": "workflow_terminology"}, {"score": 0.004530023871441992, "phrase": "systematic_literature_review"}, {"score": 0.003628352506247126, "phrase": "final_corpus"}, {"score": 0.0034324073240680213, "phrase": "researcher_perspective"}, {"score": 0.0030715948036518603, "phrase": "workflow_and_dependent_variables"}, {"score": 0.002905629026254221, "phrase": "long_study_durations"}, {"score": 0.002857605453835429, "phrase": "large_time_commitment"}, {"score": 0.002810373366887749, "phrase": "descriptive_workflow_research"}, {"score": 0.0026881926384093088, "phrase": "study_results"}, {"score": 0.0023788319661581696, "phrase": "research_areas"}, {"score": 0.0023525345110929326, "phrase": "researcher_perspectives"}, {"score": 0.0022502133699402018, "phrase": "workflow-related_terminology"}, {"score": 0.0022007302738063566, "phrase": "future_research"}], "paper_keywords": [""], "paper_abstract": "The objective of this review was to describe methods used to study and model workflow. The authors included studies set in a variety of industries using qualitative, quantitative and mixed methods. Of the 6221 matching abstracts, 127 articles were included in the final corpus. The authors collected data from each article on researcher perspective, study type, methods type, specific methods, approaches to evaluating quality of results, definition of workflow and dependent variables. Ethnographic observation and interviews were the most frequently used methods. Long study durations revealed the large time commitment required for descriptive workflow research. The most frequently discussed technique for evaluating quality of study results was triangulation. The definition of the term \"workflow\" and choice of methods for studying workflow varied widely across research areas and researcher perspectives. The authors developed a conceptual framework of workflow-related terminology for use in future research and present this model for use by other researchers.", "paper_title": "Traversing the many paths of workflow research: developing a conceptual framework of workflow terminology through a systematic literature review", "paper_id": "WOS:000277580700005"}