{"auto_keywords": [{"score": 0.012157861349687066, "phrase": "remote_system"}, {"score": 0.007893271538855131, "phrase": "lee_et_al"}, {"score": 0.00481495049065317, "phrase": "smart_cards"}, {"score": 0.004643839937761046, "phrase": "fingerprint-based_remote_user_authentication_scheme"}, {"score": 0.004140924670517666, "phrase": "practical_pitfalls"}, {"score": 0.0038054151244558123, "phrase": "mutual_authentication"}, {"score": 0.0030069062905274976, "phrase": "long_pseudorandom_numbers"}, {"score": 0.0027133856739937133, "phrase": "efficient_and_practical_fingerprint-based_remote_user_authentication_scheme"}, {"score": 0.0025697460140513932, "phrase": "one-way_collision_free_hash_functions"}, {"score": 0.0023755529073496394, "phrase": "'s_scheme"}, {"score": 0.0022909325048608054, "phrase": "secure_and_user-friendly_fingerprint-based_remote_user_authentication"}, {"score": 0.0021049977753042253, "phrase": "proposed_scheme"}], "paper_keywords": [""], "paper_abstract": "Recently, Lee et al. proposed a fingerprint-based remote user authentication scheme using smart cards. We demonstrate that their scheme is vulnerable and susceptible to the attack and has some practical pitfalls. Their scheme performs only unilateral authentication (only client authentication) and there is no mutual authentication between user and remote system, so their scheme suscepts from the server spoofing attack. Furthermore, in their scheme, remote system generates and assigns the passwords, and users cannot choose and change their passwords. Moreover, passwords are long pseudorandom numbers and difficult to remember for a user. To solve these problems, we propose an efficient and practical fingerprint-based remote user authentication scheme using smart cards, which is based on one-way collision free hash functions. Proposed scheme not only overcomes all the drawbacks and problems of Lee et al.'s scheme, but also provides a secure and user-friendly fingerprint-based remote user authentication over insecure network. In addition, computational costs and efficiency of the proposed scheme are better than Lee et al.'s scheme.", "paper_title": "An efficient and practical fingerprint-based remote user authentication scheme with smart cards", "paper_id": "WOS:000237227700024"}