{"auto_keywords": [{"score": 0.04098894483094121, "phrase": "semantic_information"}, {"score": 0.015719716506582538, "phrase": "elemental_parts"}, {"score": 0.004706895428234964, "phrase": "conditional_random_fields_model"}, {"score": 0.0032725712584012953, "phrase": "projected_outline"}, {"score": 0.0030707512751243214, "phrase": "elemental_part"}, {"score": 0.0030291453183733897, "phrase": "conditional_random_fields"}, {"score": 0.002934237411711622, "phrase": "classification_technique"}, {"score": 0.002778385486855157, "phrase": "heuristic_rules"}, {"score": 0.0027035833504191233, "phrase": "crfs_model"}, {"score": 0.002536763634539386, "phrase": "parameters_template_method"}, {"score": 0.002401972657236928, "phrase": "geometrical_information"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["3D reconstruction", " Shafts", " Semantic information", " Conditional random fields (CRFs) model"], "paper_abstract": "Semantic information is very important for understanding 2D engineering drawings. However, this kind of information is implicit so that it is hard to be extracted and understood by computers. In this paper, we aim to identify the semantic information of shafts from their 2D drawings, and then reconstruct the 3D models. The 2D representations of shafts are diverse. By analyzing the characteristics of 2D drawings of shafts, we find that there is always a view which represents the projected outline of the shaft, and each loop in this view corresponds to an elemental part. The conditional random fields (CRFs) model is a classification technique which can automatically integrate various features, rather than manually organizing of heuristic rules. We first use a CRFs model to identify elemental parts with semantic information. The 3D elemental parts are then constructed by a parameters template method. Compared with the existing 3D reconstruction methods, our approach can obtain both geometrical information and semantic information of each part of shafts from 2D drawings. Several examples are provided to demonstrate that our algorithm can accurately handle diverse 2D drawings of shafts. (C) 2014 Elsevier Ltd. All rights reserved.", "paper_title": "Identifying and constructing elemental parts of shafts based on conditional random fields model", "paper_id": "WOS:000350942400003"}