{"auto_keywords": [{"score": 0.044294032470466274, "phrase": "computing_technology"}, {"score": 0.00481495049065317, "phrase": "attributional_judgments"}, {"score": 0.004657542074154025, "phrase": "microsoft_windows_pc_user_perceptions"}, {"score": 0.004613850168996581, "phrase": "windows"}, {"score": 0.004275904315753662, "phrase": "user_acceptance"}, {"score": 0.004019797503157808, "phrase": "user's_decision"}, {"score": 0.0036379729015583975, "phrase": "current_paper"}, {"score": 0.003436242862104006, "phrase": "ultimate_influence"}, {"score": 0.00332375606483146, "phrase": "mouth_communication"}, {"score": 0.003199687131875466, "phrase": "research_point"}, {"score": 0.0031244995579170465, "phrase": "ego_enhancement"}, {"score": 0.0030656196752517836, "phrase": "users'_reactions"}, {"score": 0.002937153116494391, "phrase": "competing_technologies"}, {"score": 0.002787406053363446, "phrase": "mass_media"}, {"score": 0.0027610089418453614, "phrase": "experienced_users"}, {"score": 0.0026077803487003, "phrase": "biased_optimism"}], "paper_keywords": ["optimistic bias", " third-person effects", " diffusion of innovations", " user acceptance", " marketing", " computing technology failure"], "paper_abstract": "The bulk of research to date on diffusion of innovations and the user acceptance of computing technology has focused on modelling the factors that lead to a user's decision to adopt and use a technology, instead of how individuals use technology and experience it after adoption. The current paper explores how users rationalise failures in their adopted innovations; their biases in the assessment of competing technologies; and the ultimate influence of these attributions on their interpersonal word of mouth communication with other users. The findings of the research point to the mechanisms of ego enhancement and innovativeness influencing users' reactions to the failure of their adopted computing technology. Biases regarding competing technologies are, however, influenced by information presented in the mass media. Experienced users and users who are technologically innovative are more likely to exhibit biased optimism towards the technology they have adopted. When such users hear about the failure of the computing technology they have adopted, they are far more likely to blame other users for it. In contrast, less innovative, later adopters of a technology are far more likely to blame their adopted technology and consider it to be inferior.", "paper_title": "The role of attributional judgments when adopted computing technology fails: a comparison of Microsoft Windows PC user perceptions of Windows and Macs", "paper_id": "WOS:000326350700007"}