{"auto_keywords": [{"score": 0.041882654269095175, "phrase": "ipc"}, {"score": 0.00481495049065317, "phrase": "planning_systems"}, {"score": 0.004734038956773703, "phrase": "automated_planning"}, {"score": 0.004576253356889219, "phrase": "empirical_evaluation"}, {"score": 0.0043678116213858, "phrase": "solid_evaluations"}, {"score": 0.004204320052179726, "phrase": "planning_community"}, {"score": 0.0037178503842258087, "phrase": "icaps"}, {"score": 0.003624429617337833, "phrase": "standard_metrics"}, {"score": 0.0034738975998176323, "phrase": "sixth_edition"}, {"score": 0.003097865379563127, "phrase": "large_extent"}, {"score": 0.0030071857666598193, "phrase": "seventh_edition"}, {"score": 0.0028457440091791252, "phrase": "planning_experiments"}, {"score": 0.0024423826953133844, "phrase": "new_experiments"}, {"score": 0.002421726275597666, "phrase": "private_sets"}, {"score": 0.0023013968622710847, "phrase": "gentle_introduction"}, {"score": 0.0022339789476489877, "phrase": "main_difficulties"}, {"score": 0.0021870332034407817, "phrase": "scientific_and_engineering_point"}, {"score": 0.0021049977753042253, "phrase": "automated_planners"}], "paper_keywords": ["Automated planning", " evaluation", " competition"], "paper_abstract": "Research in automated planning is getting more and more focused on empirical evaluation. Likewise the need for methodologies and benchmarks to build solid evaluations of planners is increasing. In 1998 the planning community made a move to address this need and initiated the International Planning Competition - or IPC for short. This competition has typically been conducted every two years in the context of the International Conference on Automated Planning and Scheduling (ICAPS) and tries to define standard metrics and benchmarks to reliably evaluate planners. In the sixth edition of the competition, IPC 2008, there was an attempt to automate the evaluation of all entries in the competition which was imitated to a large extent and extended in several ways in the seventh edition, IPC 2011. As a result, a software for automatically running planning experiments and inspecting the results is available, encouraging researchers to use it for their own research interests. The software allows researchers to reproduce and inspect the results of IPC 2011, but also to generate and analyze new experiments with private sets of planners and problems. In this paper we provide a gentle introduction to this software and examine the main difficulties, both from a scientific and engineering point of view, in assessing the performance of automated planners.", "paper_title": "Automating the evaluation of planning systems", "paper_id": "WOS:000324551500001"}