{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "merge_model"}, {"score": 0.01052336179709876, "phrase": "multilingual_information_retrieval"}, {"score": 0.010260695853251059, "phrase": "learning_approach"}, {"score": 0.010131806506455981, "phrase": "merging_process"}, {"score": 0.007445596476098666, "phrase": "mlir"}, {"score": 0.004186534737631288, "phrase": "mlir_merging_process"}, {"score": 0.0038624981944755813, "phrase": "feature_extraction"}, {"score": 0.0037654565082218595, "phrase": "frank_ranking_algorithm"}, {"score": 0.0035183910023550246, "phrase": "first_attempt"}, {"score": 0.003459191419478298, "phrase": "learning-based_ranking_algorithm"}, {"score": 0.0031912706211861324, "phrase": "crosslingual_information_retrieval"}, {"score": 0.002785978280998868, "phrase": "traditional_merging_methods"}, {"score": 0.002704403349815203, "phrase": "merging_method"}, {"score": 0.0026701760128830573, "phrase": "logistic_regression"}, {"score": 0.0026363807171515255, "phrase": "experimental_results"}, {"score": 0.002311192286067765, "phrase": "key_factors"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Learning to merge", " Merge model", " MLIR"], "paper_abstract": "This paper proposes a learning approach for the merging process in multilingual information retrieval (MLIR). To conduct the learning approach, we present a number of features that may influence the MLIR merging process. These features are mainly extracted from three levels: query, document, and translation. After the feature extraction, we then use the FRank ranking algorithm to construct a merge model. To the best of our knowledge, this practice is the first attempt to use a learning-based ranking algorithm to construct a merge model for MLIR merging. In our experiments, three test collections for the task of crosslingual information retrieval (CLIR) in NTCIR3, 4, and 5 are employed to assess the performance of our proposed method. Moreover, several merging methods are also carried out for a comparison, including traditional merging methods, the 2-step merging strategy, and the merging method based on logistic regression. The experimental results show that our proposed method can significantly improve merging quality on two different types of datasets. In addition to the effectiveness, through the merge model generated by FRank, our method can further identify key factors that influence the merging process. This information might provide us more insight and understanding into MLIR merging. (C) 2009 Elsevier Ltd. All rights reserved.", "paper_title": "Learning a merge model for multilingual information retrieval", "paper_id": "WOS:000294087400003"}