{"auto_keywords": [{"score": 0.04844170546569224, "phrase": "ab_initio_calculations"}, {"score": 0.0047113960612140335, "phrase": "homology_modeling"}, {"score": 0.004590052784169268, "phrase": "three-dimensional_homology_model"}, {"score": 0.004413846562278824, "phrase": "binding_mode"}, {"score": 0.003993544228876303, "phrase": "mutagenesis_studies"}, {"score": 0.0038568987435766014, "phrase": "rhodopsin-based_homology_model"}, {"score": 0.0037087324991876727, "phrase": "binding_pocket"}, {"score": 0.003613119346373748, "phrase": "ballesteros-weinstein"}, {"score": 0.0032263862712733934, "phrase": "point_mutations"}, {"score": 0.003115908199991072, "phrase": "binding_affinity"}, {"score": 0.0029443683459283955, "phrase": "sharp_contrast"}, {"score": 0.0027822459052173113, "phrase": "histamine-like_ligands"}, {"score": 0.0025723630851105304, "phrase": "proposed_model"}, {"score": 0.0024095777415804346, "phrase": "observed_differences"}, {"score": 0.0022967713922705, "phrase": "molecular_understanding"}], "paper_keywords": [""], "paper_abstract": "A three-dimensional homology model of the human histamine H-4 receptor was developed to investigate the binding mode of a series of structurally diverse H-4-agonists, i.e. histamine, clozapine, and the recently described selective, nonimidazole agonist VUF 8430. Mutagenesis studies and docking of these ligands in a rhodopsin-based homology model revealed two essential points of interactions in the binding pocket, i.e. Asp3.32 and Glu5.46 (Ballesteros-Weinstein numbering system). It is postulated that Asp3.32 interacts in its anionic state, whereas Glu5.46 interacts in its neutral form. The hypothesis was tested with the point mutations D3.32N and E5.46Q. For the D3.32N no binding affinity toward any of the ligands could be detected. This is in sharp contrast to the E5.46Q mutant, which discriminates between various ligands. The affinity of histamine-like ligands was decreased approximately a 1000-fold, whereas the affinity of all other ligands remained virtually unchanged. The proposed model for agonist binding as well as ab initio calculations for histamine and VUF 8430 explain the observed differences in binding to the H4R mutants. These studies provide a molecular understanding for the action of a variety of H-4 receptor-ligands. The resulting H-4 receptor model will be the basis for the development of new H-4 receptor-ligands.", "paper_title": "Delineation of agonist binding to the human histamine H-4 receptor using mutational analysis, homology modeling, and ab initio calculations", "paper_id": "WOS:000258004300016"}