{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "meme"}, {"score": 0.01043713982565651, "phrase": "two-tiered_significance_analysis"}, {"score": 0.004187614134377688, "phrase": "statistical_significance"}, {"score": 0.003960101604693806, "phrase": "motif_finder"}, {"score": 0.003703282519292336, "phrase": "blast_result"}, {"score": 0.0034630606658026595, "phrase": "blast's_e-value"}, {"score": 0.003405472159599442, "phrase": "motif-finding_context"}, {"score": 0.0032383707002544755, "phrase": "meme's_current_significance_evaluation"}, {"score": 0.0031140747752837826, "phrase": "practical_substitute"}, {"score": 0.002847540262784593, "phrase": "competing_candidate_motifs"}, {"score": 0.0025892330566358503, "phrase": "best_candidate_motif"}, {"score": 0.0024075916292945715, "phrase": "meme's_motif-finding_performance"}, {"score": 0.0022893422054387235, "phrase": "reliable_significance_analysis"}, {"score": 0.0022137465420508785, "phrase": "large_input_sets"}, {"score": 0.0021049977753042253, "phrase": "currently_implemented_e-value_analysis"}], "paper_keywords": [""], "paper_abstract": "Motivation: With over 9000 unique users recorded in the first half of 2013, MEME is one of the most popular motif-finding tools available. Reliable estimates of the statistical significance of motifs can greatly increase the usefulness of any motif finder. By analogy, it is difficult to imagine evaluating a BLAST result without its accompanying E-value. Currently MEME evaluates its EM-generated candidate motifs using an extension of BLAST's E-value to the motif-finding context. Although we previously indicated the drawbacks of MEME's current significance evaluation, we did not offer a practical substitute suited for its needs, especially because MEME also relies on the E-value internally to rank competing candidate motifs. Results: Here we offer a two-tiered significance analysis that can replace the E-value in selecting the best candidate motif and in evaluating its overall statistical significance. We show that our new approach could substantially improve MEME's motif-finding performance and would also provide the user with a reliable significance analysis. In addition, for large input sets, our new approach is in fact faster than the currently implemented E-value analysis.", "paper_title": "Improving MEME via a two-tiered significance analysis", "paper_id": "WOS:000339814300004"}