{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "end-user_code"}, {"score": 0.030778376141194518, "phrase": "collaborative_filtering"}, {"score": 0.00449183202322304, "phrase": "prior_work"}, {"score": 0.004442824994700736, "phrase": "user-extensible_data_model"}, {"score": 0.0043305354943056875, "phrase": "supporting_visual_programming_language"}, {"score": 0.004039792863335641, "phrase": "functional_gap_results"}, {"score": 0.004010342699414496, "phrase": "wasteful_duplication"}, {"score": 0.003713736138854327, "phrase": "new_repository_system"}, {"score": 0.003489714006817602, "phrase": "traditional_keyword-based_search"}, {"score": 0.003291188255149539, "phrase": "first_method"}, {"score": 0.002927278301452369, "phrase": "second_method"}, {"score": 0.00284275228258112, "phrase": "vital_role"}, {"score": 0.0028014064098604093, "phrase": "non-code_artifacts"}, {"score": 0.002780958897911242, "phrase": "repository's_search_functionality"}, {"score": 0.002720505061804933, "phrase": "prototype_repository_implementation"}, {"score": 0.0026613618933208467, "phrase": "real_user_spreadsheets"}, {"score": 0.002455266773537278, "phrase": "traditional_keyword-based_approach"}, {"score": 0.002265095354846931, "phrase": "useful_approaches"}, {"score": 0.002175594509651082, "phrase": "visual_programs"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["End-user programming", " End-user software engineering", " Data", " Reuse", " Spreadsheets"], "paper_abstract": "To help users with automatically reformatting and validating spreadsheets and other datasets, prior work introduced a user-extensible data model called \"topes\" and a supporting visual programming language. However, no support has existed to date for users to exchange and reuse topes. This functional gap results in wasteful duplication of work as users implement topes that other people have already created. In this paper, a design for a new repository system is presented that supports sharing and finding of topes for reuse. This repository tightly integrates traditional keyword-based search with two additional search methods whose usefulness in repositories of end-user code has gone unexplored to date. The first method is \"search-by-match\", where a user specifies examples of data, and the repository retrieves topes that can reformat and validate that data. The second method is collaborative filtering, which has played a vital role in repositories of non-code artifacts The repository's search functionality was empirically tested on a prototype repository implementation by simulating queries generated from real user spreadsheets. This experiment reveals that search-by-match and collaborative filtering greatly improve the accuracy of search over the traditional keyword-based approach, to a recall as high as 95%. These results show that search-by-match and collaborative filtering are useful approaches for helping users to publish, find, and reuse visual programs similar to topes. (C) 2010 Elsevier Ltd. All rights reserved.", "paper_title": "Sharing, finding and reusing end-user code for reformatting and validating data", "paper_id": "WOS:000281294100004"}