{"auto_keywords": [{"score": 0.02672590261963155, "phrase": "complexity_reduction"}, {"score": 0.003935420482629049, "phrase": "trellis_code"}, {"score": 0.003820896867623235, "phrase": "conventional_manner"}, {"score": 0.0036914757355166966, "phrase": "corresponding_decoder"}, {"score": 0.0036373553416391823, "phrase": "long_critical_path"}, {"score": 0.0034118234596993836, "phrase": "critical_path_requirements"}, {"score": 0.0031377955308198634, "phrase": "inherent_decoding_speed_requirements"}, {"score": 0.002943147037670826, "phrase": "intersymbol_interference"}, {"score": 0.0028574164693918433, "phrase": "branch_metric_units"}, {"score": 0.002640781900605126, "phrase": "conventional_decoder"}, {"score": 0.0023117182131967523, "phrase": "error-rate_performances"}, {"score": 0.0021896891011033105, "phrase": "conventional_scheme"}, {"score": 0.0021049977753042253, "phrase": "performance_loss"}], "paper_keywords": ["interleaving", " trellis coded modulation", " 10 Gigabit Ethernet", " high speed", " complexity reduction"], "paper_abstract": "There were several modulation and coding proposals for 10GBASE-T (10 Gigabit Ethernet over copper) systems. One of these is based on a 10-level pulse amplitude modulation (PAM-10) combined with a 4D (four-dimensional) 8-state trellis code similar to the one in 1000BASE-T (1000 Megabit Ethernet over copper). The trellis code can be used in a conventional manner as in 1000BASE-T, but the corresponding decoder with a long critical path needs to operate at 833 MHz. It is difficult to meet the critical path requirements of such a decoder. To solve the problem, two interleaved trellis coded modulation schemes are proposed in this paper. The inherent decoding speed requirements can be relaxed by factors of 4 and 2, respectively. Due to intersymbol interference (ISI), the branch metric units in the decoders corresponding to the two interleaved modulation schemes are much more complicated than those in the conventional decoder. Thus this paper also considers the problem of complexity reduction of the decoders for the two proposed interleaved modulation schemes, and presents two novel complexity reduction schemes. Simulation results show that the error-rate performances of the two proposed interleaved schemes are quite close to that of the conventional scheme. It is also shown that the performance loss due to complexity reduction is negligible.", "paper_title": "Interleaved trellis coded modulation and decoder optimizations for 10 Gigabit Ethernet over copper", "paper_id": "WOS:000237327100001"}