{"auto_keywords": [{"score": 0.032978995256044516, "phrase": "energy_consumption"}, {"score": 0.00481495049065317, "phrase": "twenty-first_century"}, {"score": 0.004741845603430361, "phrase": "major_technological_changes"}, {"score": 0.0042819270655224916, "phrase": "major_technology_enablers"}, {"score": 0.004195418010131832, "phrase": "remarkable_transformation"}, {"score": 0.003886292704175874, "phrase": "ict"}, {"score": 0.003025915966640355, "phrase": "ict_equipment"}, {"score": 0.0027459678326877744, "phrase": "policy_makers"}, {"score": 0.0025433263646920364, "phrase": "energy-efficient_communications"}, {"score": 0.0024289743270061157, "phrase": "recent_techniques"}, {"score": 0.0022961534630650347, "phrase": "communication_devices"}, {"score": 0.0022267859286766553, "phrase": "end-user_systems"}, {"score": 0.0021928902836049384, "phrase": "data_centers"}], "paper_keywords": ["Cellular", " Efficiency", " Energy", " Green networking", " Performance", " Protocols", " Wireless"], "paper_abstract": "The twenty-first century has witnessed major technological changes that have transformed the way we live, work, and interact with one another. One of the major technology enablers responsible for this remarkable transformation in our global society is the deployment and use of Information and Communication Technology (ICT) equipment. In fact, today ICT has become highly integrated in our society that includes the dependence on ICT of various sectors, such as business, transportation, education, and the economy to the point that we now almost completely depend on it. Over the last few years, the energy consumption resulting from the usage of ICT equipment and its impact on the environment have fueled a lot of interests among researchers, designers, manufacturers, policy makers, and educators. We present some of the motivations driving the need for energy-efficient communications. We describe and discuss some of the recent techniques and solutions that have been proposed to minimize energy consumption by communication devices, protocols, networks, end-user systems, and data centers. In addition, we highlight a few emerging trends and we also identify some challenges that need to be addressed to enable novel, scalable, cost-effective energy-efficient communications in the future.", "paper_title": "Energy-efficient networking: past, present, and future", "paper_id": "WOS:000310428700002"}