{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "cognitive_vision"}, {"score": 0.004208881856146758, "phrase": "unequivocal_consensus"}, {"score": 0.004160612392068268, "phrase": "right_approach"}, {"score": 0.0039729853486821995, "phrase": "definitive_universally-accepted_scientific_theory"}, {"score": 0.0036788184374592706, "phrase": "clearly_competing_viewpoints"}, {"score": 0.0031906408161077792, "phrase": "artificial_intelligence"}, {"score": 0.003166174817955658, "phrase": "image_processing"}, {"score": 0.0031178024467857215, "phrase": "developmental_psychology"}, {"score": 0.003093893243443715, "phrase": "cognitive_neuroscience"}, {"score": 0.0030232568024943455, "phrase": "cognitive_robotics"}, {"score": 0.003000070450638434, "phrase": "autonomous_systems"}, {"score": 0.0028317319086202217, "phrase": "complete_domain"}, {"score": 0.0025917270871556475, "phrase": "common_concerns"}, {"score": 0.0025521085778978042, "phrase": "fundamental_differences"}, {"score": 0.002381169982803105, "phrase": "particular_community"}, {"score": 0.0022474806085983536, "phrase": "possible_strengths"}], "paper_keywords": [""], "paper_abstract": "Cognitive vision is an area that is not yet well-defined, in the sense that one can unambiguously state what issues fall under its purview and what considerations do not. Neither is there unequivocal consensus on the right approach to take in addressing these issues - there isn't a definitive universally-accepted scientific theory with 'gaps in understanding' that merely need to be plugged. On the contrary, there are clearly competing viewpoints and many poorly-understood issues (such as the point where vision stops and cognition starts). Depending on how you choose to view or define cognitive vision, there are many points of departure, some based squarely in artificial intelligence and image processing, others in developmental psychology and cognitive neuroscience, and others yet in cognitive robotics and autonomous systems theory. This paper is an attempt to sketch a framework within which the complete domain of cognitive vision can be set, a framework that embraces all of the possible approaches that can be taken and that highlights common concerns as well as fundamental differences between the approaches. Our goal here is to define cognitive vision in a way that avoids alienating any particular community and to state what the options are. While we will note in passing possible strengths and weaknesses of the various approaches, this paper will not attempt to argue in favour of one approach over another.", "paper_title": "The space of cognitive vision", "paper_id": "WOS:000239148600002"}