{"auto_keywords": [{"score": 0.030525322155516763, "phrase": "edit_distance"}, {"score": 0.00481495049065317, "phrase": "soft_constraint"}, {"score": 0.004278807087784626, "phrase": "soft_constraints"}, {"score": 0.0038368442918503072, "phrase": "softregular"}, {"score": 0.003683097597914604, "phrase": "propagation_algorithm"}, {"score": 0.0032577270508271305, "phrase": "based_softregular_constraint"}, {"score": 0.0031845067058084583, "phrase": "quadratic-time_propagation_algorithm"}, {"score": 0.00297454367746853, "phrase": "improved_propagation_algorithm"}, {"score": 0.0026913130726432645, "phrase": "dynamic_programming"}, {"score": 0.0026548344763838213, "phrase": "asymptotic_time_complexity"}, {"score": 0.0023586493263143553, "phrase": "domain_consistency"}, {"score": 0.002326669201839705, "phrase": "problem_variables"}, {"score": 0.0022640009579466924, "phrase": "cost_variable"}, {"score": 0.0021731423856364003, "phrase": "violation_measure"}, {"score": 0.002124247104243502, "phrase": "regular_constraint"}, {"score": 0.0021049977753042253, "phrase": "constraint-based_local_search"}], "paper_keywords": ["Constraint programming", " Soft regular constraint", " Edit distance", " Network flows", " Dynamic programming"], "paper_abstract": "Many real-life problems are over-constrained, so that no solution satisfying all their constraints exists. Soft constraints, with costs denoting how much the constraints are violated, are used to solve these problems. We use the edit-distance based SoftRegular constraint as an example to show that a propagation algorithm that sometimes underestimates the cost may guide the search to incorrect (non-optimal) solutions to an over-constrained problem. To compute correctly the cost for the edit-distance based SoftRegular constraint, we present a quadratic-time propagation algorithm based on dynamic programming and a proof of its correctness. We also give an improved propagation algorithm using an idea of computing the edit distance between two strings, which may also be applied to other constraints with propagators based on dynamic programming. The asymptotic time complexity of our improved propagator is always at least as good as the one of our quadratic-time propagator, but significantly better when the edit distance is small. Our propagators achieve domain consistency on the problem variables and bounds consistency on the cost variable. Our method can also be adapted for the violation measure of the edit-distance based Regular constraint for constraint-based local search.", "paper_title": "Underestimating the cost of a soft constraint is dangerous: revisiting the edit-distance based soft regular constraint", "paper_id": "WOS:000325021400001"}