{"auto_keywords": [{"score": 0.04692152734728487, "phrase": "wireless_node"}, {"score": 0.04471066885820101, "phrase": "wireless_nodes"}, {"score": 0.032826460404324895, "phrase": "access_point"}, {"score": 0.023952014150282027, "phrase": "truthful_mechanism"}, {"score": 0.00481495049065317, "phrase": "selfish_and_rational_wireless_ad_hoc_networks"}, {"score": 0.004688321299229397, "phrase": "wireless_networks"}, {"score": 0.004646852519870358, "phrase": "common_assumption"}, {"score": 0.004444921827311577, "phrase": "prescribed_protocol"}, {"score": 0.00407896718224832, "phrase": "routing_protocols"}, {"score": 0.003959863717046575, "phrase": "selfish_nodes"}, {"score": 0.0038556354709511818, "phrase": "unicast_routing_protocol"}, {"score": 0.003743028652756066, "phrase": "networking_nodes"}, {"score": 0.0034550911223507064, "phrase": "privately_known_cost"}, {"score": 0.0030504492628487413, "phrase": "least_cost_path"}, {"score": 0.0028832679581901176, "phrase": "pricing_mechanism"}, {"score": 0.002824005136794786, "phrase": "relay_node"}, {"score": 0.002717149533691728, "phrase": "optimal_method"}, {"score": 0.0026612920049803473, "phrase": "centralized_manner"}, {"score": 0.0025758208205978825, "phrase": "routing_protocol"}, {"score": 0.00255298944002721, "phrase": "distributed_manner"}, {"score": 0.002522861292947622, "phrase": "extensive_simulations"}, {"score": 0.002470987929071079, "phrase": "total_payment"}, {"score": 0.0024490834773668153, "phrase": "total_cost"}, {"score": 0.0024201785622872847, "phrase": "relay_nodes"}], "paper_keywords": ["noncooperative computing", " unicast", " game theory", " wireless ad hoc networks"], "paper_abstract": "Numerous routing protocols have been proposed for wireless networks. A common assumption made by the majority of these protocols is that each wireless node will follow the prescribed protocol without any deviation. This may not be true in practice since wireless nodes could be owned by users who perform in their own interests. We then have to design routing protocols that still work properly even for networks composed of selfish nodes. In this paper, we propose a unicast routing protocol to address this issue under the assumption that all networking nodes are rational. Here, a node is rational if it always chooses a strategy that maximizes its benefit. We assume that each node has a privately known cost of relaying a unit of data for other nodes. In our protocol, each wireless node has to declare a cost for forwarding a unit of data. When a node wants to send data to the access point, it first computes the least cost path to the access point and then computes a payment to each node on this path. We present a pricing mechanism such that the profit of each relay node is maximized when it declares its true cost. We also give a time optimal method to compute the payment in a centralized manner. We then discuss in detail how to implement the routing protocol in the distributed manner. We conduct extensive simulations to study the ratio of the total payment over the total cost incurred by all relay nodes. We find that this ratio is small in practice. Our protocol works when the wireless nodes will not collude and we show that no truthful mechanism can avoid the collusion of any pair of two nodes. We also give a truthful mechanism when a node only colludes with its neighbors.", "paper_title": "Low-cost routing in selfish and rational wireless ad hoc networks", "paper_id": "WOS:000235953800013"}