{"auto_keywords": [{"score": 0.04586846484671967, "phrase": "nearness_relation"}, {"score": 0.014664841853641745, "phrase": "approximation_space"}, {"score": 0.00481495049065317, "phrase": "approximation_space_model"}, {"score": 0.004345363360869553, "phrase": "approximation_spaces"}, {"score": 0.004252469672259375, "phrase": "zdzislaw_pawlak"}, {"score": 0.003964009562938196, "phrase": "pawlak"}, {"score": 0.0035965032173588753, "phrase": "indiscernibility_relation"}, {"score": 0.00342568771304873, "phrase": "feature_values"}, {"score": 0.002530359917257626, "phrase": "nearness_relations"}, {"score": 0.002222102813520549, "phrase": "pawlak's_model"}, {"score": 0.0021049977753042253, "phrase": "generalized_approximations_spaces"}], "paper_keywords": ["rough sets", " approximation", " approximation space", " classification", " feature", " nearness relation", " neighbourhood", " proximity space"], "paper_abstract": "The problem considered in this paper is the extension of an approximation space to include a nearness relation. Approximation spaces were introduced by Zdzislaw Pawlak during the early 1980s as frameworks for classifying objects by means of attributes. Pawlak introduced approximations as a means of approximating one set of objects with another set of objects using an indiscernibility relation that is based on a comparison between the feature values of objects. Until now, the focus has been on the overlap between sets. It is possible to introduce a nearness relation that can be used to determine the \"nearness\" of sets of objects that are possibly disjoint and, yet, qualitatively near to each other. Several members of a family of nearness relations are introduced in this article. The contribution of this article is the introduction of a nearness relation that makes it possible to extend Pawlak's model for an approximation space and to consider the extension of generalized approximations spaces.", "paper_title": "Nearness of objects: Extension of approximation space model", "paper_id": "WOS:000250413700018"}