{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "certificateless_cryptography"}, {"score": 0.04834469683626629, "phrase": "partial_key"}, {"score": 0.043788298932667113, "phrase": "cryptographic_operation"}, {"score": 0.042412816998429005, "phrase": "third_party"}, {"score": 0.037984575058489865, "phrase": "key_replacement_attack"}, {"score": 0.004761968711051715, "phrase": "key_generation_center"}, {"score": 0.004374594556187611, "phrase": "kgc"}, {"score": 0.0035445401296650535, "phrase": "yum"}, {"score": 0.003518736999989731, "phrase": "lee"}, {"score": 0.003479692058963528, "phrase": "generic_construction"}, {"score": 0.0034540850937966336, "phrase": "digital_signature_schemes"}, {"score": 0.0031377955308198634, "phrase": "concrete_examples"}, {"score": 0.003080365929916083, "phrase": "security_requirements"}, {"score": 0.0030464123943266673, "phrase": "building_blocks"}, {"score": 0.0027982016314450717, "phrase": "new_and_simplified_security_model"}, {"score": 0.002726740692380339, "phrase": "adversarial_model"}, {"score": 0.0024768883044869023, "phrase": "independent_interest"}, {"score": 0.0024495702960480076, "phrase": "conventional_certificateless_signature_scheme"}, {"score": 0.0023519508354777215, "phrase": "conventional_signature_scheme"}, {"score": 0.0023346234464901978, "phrase": "public_key_infrastructure"}, {"score": 0.0022498783454674254, "phrase": "certificateless_signature_scheme"}, {"score": 0.0022168460543913787, "phrase": "additional_security_model"}, {"score": 0.0021049977753042253, "phrase": "appropriate_and_simple_modification"}], "paper_keywords": ["certificateless cryptography", " certificateless signature"], "paper_abstract": "Certificateless cryptography involves a Key Generation Center (KGC) which issues a partial key to a user and the user also independently generates an additional public/secret key pair in such a way that the KGC who knows only the partial key but not the additional secret key is not able to do any cryptographic operation on behalf of the user; and a third party who replaces the public/secret key pair but does not know the partial key cannot do any cryptographic operation as the user either. We call this attack launched by the third party as the key replacement attack. In ACISP 2004, Yum and Lee proposed a generic construction of digital signature schemes under the framework of certificateless cryptography. In this paper, we show that their generic construction is insecure against key replacement attack. In particular, we give some concrete examples to show that the security requirements of some building blocks they specified are insufficient to support some of their security claims. We then propose a modification of their scheme and show its security in a new and simplified security model. We show that our simplified definition and adversarial model not only capture all the distinct features of certificateless signature but are also more versatile when compared with all the comparable ones. We believe that the model itself is of independent interest. A conventional certificateless signature scheme only achieves Girault's Level 2 security. For achieving Level 3 security, that a conventional signature scheme in Public Key Infrastructure does, we propose an extension to our definition of certificateless signature scheme and introduce an additional security model for this extension. We show that our generic construction satisfies Level 3 security after some appropriate and simple modification.", "paper_title": "Certificateless signature: a new security model and an improved generic construction", "paper_id": "WOS:000243881100001"}