{"auto_keywords": [{"score": 0.04520816487989676, "phrase": "search_space"}, {"score": 0.015569319767201502, "phrase": "particle_swarm_optimization_algorithm"}, {"score": 0.015321799627194918, "phrase": "earlier_methods"}, {"score": 0.004556901872357751, "phrase": "theoretical_and_experimental_points"}, {"score": 0.004134658048970194, "phrase": "swarm_size"}, {"score": 0.0034817084307034955, "phrase": "particle_swarm_optimizers"}, {"score": 0.003200045185608395, "phrase": "new_general_form"}, {"score": 0.0031793439438669176, "phrase": "velocity_update_rule"}, {"score": 0.003107935254560724, "phrase": "user-definable_function"}, {"score": 0.0027383842769094354, "phrase": "input_vector"}, {"score": 0.0025167026017217926, "phrase": "affine_transformation"}, {"score": 0.002320449502337321, "phrase": "proposed_algorithm"}, {"score": 0.0022904980438110613, "phrase": "appropriate_function"}, {"score": 0.0021464286727045623, "phrase": "overall_ability"}, {"score": 0.002125612498781805, "phrase": "proposed_method"}, {"score": 0.0021049977753042253, "phrase": "benchmark_functions"}], "paper_keywords": ["Particle swarm optimizer", " Local convergence", " Rotation invariance", " Stagnation"], "paper_abstract": "Several well-studied issues in the particle swarm optimization algorithm are outlined and some earlier methods that address these issues are investigated from the theoretical and experimental points of view. These issues are the: stagnation of particles in some points in the search space, inability to change the value of one or more decision variables, poor performance when the swarm size is small, lack of guarantee to converge even to a local optimum (local optimizer), poor performance when the number of dimensions grows, and sensitivity of the algorithm to the rotation of the search space. The significance of each of these issues is discussed and it is argued that none of the particle swarm optimizers we are aware of can address all of these issues at the same time. To address all of these issues at the same time, a new general form of velocity update rule for the particle swarm optimization algorithm that contains a user-definable function is proposed. It is proven that the proposed velocity update rule guarantees to address all of these issues if the function satisfies the following two conditions: (i) the function is designed in such a way that for any input vector in the search space, there exists a region which contains and can be located anywhere in , and (ii) is invariant under any affine transformation. An example of function is provided that satisfies these conditions and its performance is examined through some experiments. The experiments confirm that the proposed algorithm (with an appropriate function can effectively address all of these issues at the same time. Also, comparisons with earlier methods show that the overall ability of the proposed method for solving benchmark functions is significantly better.", "paper_title": "A locally convergent rotationally invariant particle swarm optimization algorithm", "paper_id": "WOS:000342123500001"}