{"auto_keywords": [{"score": 0.004537938301016805, "phrase": "root_r"}, {"score": 0.0044933373574179624, "phrase": "n-node_graph"}, {"score": 0.00390000531646629, "phrase": "integral_multiples"}, {"score": 0.0038616499489536123, "phrase": "base_capacity"}, {"score": 0.003675437054650504, "phrase": "inverted_right_perpendicular_k"}, {"score": 0.0034981720122414153, "phrase": "minimum-cost_feasible_solution"}, {"score": 0.003373616465890001, "phrase": "bandwidth_allocation"}, {"score": 0.0033294278310493524, "phrase": "side_constraints"}, {"score": 0.00291806687851358, "phrase": "general_network_design_framework"}, {"score": 0.002795607293713107, "phrase": "np_subset"}, {"score": 0.002777227714581881, "phrase": "dtime"}, {"score": 0.0025828350676150354, "phrase": "inapproximability_threshold"}, {"score": 0.002523875743494305, "phrase": "priority-steiner_tree_problem"}, {"score": 0.002308768837799101, "phrase": "even_more_fundamental_problem"}, {"score": 0.002161313898853851, "phrase": "network_design_problems"}, {"score": 0.002125942645854997, "phrase": "first_nonconstant_hardness_results"}], "paper_keywords": ["Hardness of approximation", " network design", " priority Steiner tree", " fixed charge network flow", " cost-distance"], "paper_abstract": "Consider the following classical network design problem: a set of terminals T = {t(i)}wishes to send traffic to a root r in an n-node graph G = (V, E). Each terminal t(i) sends d(i) units of traffic and enough bandwidth has to be allocated on the edges to permit this. However, bandwidth on an edge e can only be allocated in integral multiples of some base capacity u(e), and hence provisioning k x u(e) bandwidth on edge e incurs a cost of inverted right perpendicular k inverted left perpendicular times the cost of that edge. The objective is a minimum-cost feasible solution. This is one of many network design problems widely studied where the bandwidth allocation is governed by side constraints: edges can only allow a subset of cables to be purchased on them or certain quality-of-service requirements may have to be met. In this work, we show that this problem and, in fact, several basic problems in this general network design framework cannot be approximated better than Omega( log log n) unless NP subset of DTIME (n(O(log log log n))), where vertical bar V vertical bar = n. In particular, we show that this inapproximability threshold holds for (i) the Priority-Steiner Tree problem, (ii) the (single-sink) Cost-Distance problem, and (iii) the single-sink version of an even more fundamental problem, Fixed Charge Network Flow. Our results provide a further breakthrough in the understanding of the level of complexity of network design problems. These are the first nonconstant hardness results known for all these problems.", "paper_title": "On the Approximability of Some Network Design Problems", "paper_id": "WOS:000265882000008"}