{"auto_keywords": [{"score": 0.03363896917055258, "phrase": "facebook_data"}, {"score": 0.010612684701512321, "phrase": "facebook"}, {"score": 0.010101963653873657, "phrase": "social_networks"}, {"score": 0.008605187724162616, "phrase": "recommendation_process"}, {"score": 0.006556692299687046, "phrase": "user_ratings"}, {"score": 0.004677711903652145, "phrase": "recommendation_systems"}, {"score": 0.004525629293824217, "phrase": "vast_amount"}, {"score": 0.004271234971981848, "phrase": "personal_information"}, {"score": 0.004201202199968683, "phrase": "recommender_systems"}, {"score": 0.0039813976794342, "phrase": "existing_available_data"}, {"score": 0.00371115485111022, "phrase": "explicit_user_ratings"}, {"score": 0.0036352070472201086, "phrase": "facebook_content"}, {"score": 0.0032780806856932423, "phrase": "cross-domain_recommendation"}, {"score": 0.003005271873916767, "phrase": "traditional_collaborative_filtering"}, {"score": 0.0029194625087935345, "phrase": "field_study"}, {"score": 0.0025678829712650437, "phrase": "new_user"}, {"score": 0.0023540387251475615, "phrase": "experimental_study"}, {"score": 0.002305799666781492, "phrase": "sparse_rating_data"}, {"score": 0.0021490449563443025, "phrase": "cross_domain_facebook_data"}, {"score": 0.0021049977753042253, "phrase": "recommendation_performance"}], "paper_keywords": ["Recommender systems", " Facebook", " Collaborative filtering", " Cross-Domain recommendations", " Evaluation"], "paper_abstract": "The emergence of social networks and the vast amount of data that they contain about their users make them a valuable source for personal information about users for recommender systems. In this paper we investigate the feasibility and effectiveness of utilizing existing available data from social networks for the recommendation process, specifically from Facebook. The data may replace or enrich explicit user ratings. We extract from Facebook content published by users on their personal pages about their favorite items and preferences in the domain of recommendation, and data about preferences related to other domains to allow cross-domain recommendation. We study several methods for integrating Facebook data with the recommendation process and compare the performance of these methods with that of traditional collaborative filtering that utilizes user ratings. In a field study that we conducted, recommendations obtained using Facebook data were tested and compared for 95 subjects and their crawled Facebook friends. Encouraging results show that when data is sparse or not available for a new user, recommendation results relying solely on Facebook data are at least equally as accurate as results obtained from user ratings. The experimental study also indicates that enriching sparse rating data by adding Facebook data can significantly improve results. Moreover, our findings highlight the benefits of utilizing cross domain Facebook data to achieve improvement in recommendation performance.", "paper_title": "Facebook single and cross domain data for recommendation systems", "paper_id": "WOS:000314504800005"}