{"auto_keywords": [{"score": 0.037399466595618665, "phrase": "higlob"}, {"score": 0.004815075979860361, "phrase": "histogram"}, {"score": 0.0046803650677267146, "phrase": "structured_peer"}, {"score": 0.004605147081797856, "phrase": "peer_systems"}, {"score": 0.004333642054036135, "phrase": "dominant_means"}, {"score": 0.004298666679374568, "phrase": "sharing_resources"}, {"score": 0.004195418010131832, "phrase": "load_balancing"}, {"score": 0.004144723510171449, "phrase": "key_challenge"}, {"score": 0.0035819501337406596, "phrase": "general_framework"}, {"score": 0.003289534854212415, "phrase": "histogram_manager"}, {"score": 0.0031974502006267163, "phrase": "global_view"}, {"score": 0.0027854565462509095, "phrase": "routing_metadata"}, {"score": 0.0027184540871935284, "phrase": "nonoverlapping_regions"}, {"score": 0.002674681176379472, "phrase": "histogram_buckets"}, {"score": 0.0023776656246300063, "phrase": "load_imbalance"}], "paper_keywords": ["Peer-to-peer", " framework", " load balancing", " histogram", " DHT", " overlay network"], "paper_abstract": "Over the past few years, peer-to-peer (P2P) systems have rapidly grown in popularity and have become a dominant means for sharing resources. In these systems, load balancing is a key challenge because nodes are often heterogeneous. While several load-balancing schemes have been proposed in the literature, these solutions are typically ad hoc, heuristic based, and localized. In this paper, we present a general framework, HiGLOB, for global load balancing in structured P2P systems. Each node in HiGLOB has two key components: 1) a histogram manager maintains a histogram that reflects a global view of the distribution of the load in the system, and 2) a load-balancing manager that redistributes the load whenever the node becomes overloaded or underloaded. We exploit the routing metadata to partition the P2P network into nonoverlapping regions corresponding to the histogram buckets. We propose mechanisms to keep the cost of constructing and maintaining the histograms low. We further show that our scheme can control and bound the amount of load imbalance across the system. Finally, we demonstrate the effectiveness of HiGLOB by instantiating it over three existing structured P2P systems: Skip Graph, BATON, and Chord. Our experimental results indicate that our approach works well in practice.", "paper_title": "Histogram-Based Global Load Balancing in Structured Peer-to-Peer Systems", "paper_id": "WOS:000263394400010"}