{"auto_keywords": [{"score": 0.044411550678130796, "phrase": "brute_facts"}, {"score": 0.015719716506582538, "phrase": "normative_multiagent_systems"}, {"score": 0.013647994989452888, "phrase": "institutional_facts"}, {"score": 0.010235364351683136, "phrase": "institutional_fact"}, {"score": 0.009931702694633388, "phrase": "normative_system"}, {"score": 0.004284100953217494, "phrase": "abstract_interpretation"}, {"score": 0.00374610869916551, "phrase": "normative_systems"}, {"score": 0.0028267701593809877, "phrase": "institutional_empowerment"}, {"score": 0.002179313258573377, "phrase": "new_definition"}, {"score": 0.0021325650133686516, "phrase": "existing_ones"}, {"score": 0.0021049977753042253, "phrase": "different_levels"}], "paper_keywords": [""], "paper_abstract": "In this paper we reconsider the definition of counts-as relations in normative multiagent systems: counts-as relations do not always provide directly an abstract interpretation of brute facts in terms of institutional facts. We argue that in many cases the inference of institutional facts from brute facts is the result of actions of agents acting on behalf of the normative systems and who are in charge of recognizing which institutional facts follow from brute facts. We call this relation delegation of power: it is composed of a counts-as relation specifying that the effect of an action of an agent is an institutional fact and by a goal of the normative system that the fact is considered as an institutional fact. This relation is more complex than institutional empowerment, where an action of an agent counts-as an action of the normative system but no goal is involved, and than delegation of goals, where a goal is delegated to an agent without giving it any power. With two case studies we show the importance of the delegation of power. Finally, we show how the new definition can be related with existing ones by using different levels of abstraction.", "paper_title": "Delegation of power in normative multiagent systems", "paper_id": "WOS:000239626400006"}