{"auto_keywords": [{"score": 0.04980594858796438, "phrase": "threshold_circuits"}, {"score": 0.022968048238243166, "phrase": "sparse_activity"}, {"score": 0.009968983822510892, "phrase": "neural_circuits"}, {"score": 0.006576648684394585, "phrase": "circuit_states"}, {"score": 0.005833581706312055, "phrase": "polynomial_size_threshold_circuit"}, {"score": 0.00481495049065317, "phrase": "computational_power"}, {"score": 0.004692647062494403, "phrase": "threshold_gates"}, {"score": 0.004547356716604537, "phrase": "simplified_models"}, {"score": 0.004245717817867575, "phrase": "specific_computational_task"}, {"score": 0.0040096320322921715, "phrase": "second_threshold_gate_fires"}, {"score": 0.0036171490978544607, "phrase": "neuronal_circuits"}, {"score": 0.0035657543501993443, "phrase": "particular_complexity_measures"}, {"score": 0.0034355080345982755, "phrase": "previous_threshold_circuit_constructions"}, {"score": 0.003348125618527277, "phrase": "new_complexity_measure"}, {"score": 0.0033100034226848443, "phrase": "energy_complexity"}, {"score": 0.0031527521377717185, "phrase": "polynomial_size"}, {"score": 0.0029098209390578255, "phrase": "novel_circuit_complexity_measure"}, {"score": 0.0027874519404992673, "phrase": "circuit_complexity"}, {"score": 0.0023404848520465543, "phrase": "previously_considered_complexity_measures"}, {"score": 0.0022613643303996383, "phrase": "nervous_system"}, {"score": 0.002229190333606617, "phrase": "different_pathways"}, {"score": 0.0021849126349043654, "phrase": "different_classes"}, {"score": 0.0021049977753042253, "phrase": "surprisingly_large_computational_power"}], "paper_keywords": [""], "paper_abstract": "Circuits composed of threshold gates (McCulloch-Pitts neurons, or perceptrons) are simplified models of neural circuits with the advantage that they are theoretically more tractable than their biological counterparts. However, when such threshold circuits are designed to perform a specific computational task, they usually differ in one important respect from computations in the brain: they require very high activity. On average every second threshold gate fires (sets a 1 as output) during a computation. By contrast, the activity of neurons in the brain is much sparser, with only about 1% of neurons firing. This mismatch between threshold and neuronal circuits is due to the particular complexity measures (circuit size and circuit depth) that have been minimized in previous threshold circuit constructions. In this letter, we investigate a new complexity measure for threshold circuits, energy complexity, whose minimization yields computations with sparse activity. We prove that all computations by threshold circuits of polynomial size with entropy O(log n) can be restructured so that their energy complexity is reduced to a level near the entropy of circuit states. This entropy of circuit states is a novel circuit complexity measure, which is of interest not only in the context of threshold circuits but for circuit complexity in general. As an example of how this measure can be applied, we show that any polynomial size threshold circuit with entropy O(log n) can be simulated by a polynomial size threshold circuit of depth 3. Our results demonstrate that the structure of circuits that result from a minimization of their energy complexity is quite different from the structure that results from a minimization of previously considered complexity measures, and potentially closer to the structure of neural circuits in the nervous system. In particular, different pathways are activated in these circuits for different classes of inputs. This letter shows that such circuits with sparse activity have a surprisingly large computational power.", "paper_title": "On the computational power of threshold circuits with sparse activity", "paper_id": "WOS:000241799100008"}