{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "primary_care"}, {"score": 0.041947888026124834, "phrase": "e-consultation_use"}, {"score": 0.015551603673996278, "phrase": "online_survey"}, {"score": 0.014423369262963812, "phrase": "e-consultation_experience"}, {"score": 0.011183141288086094, "phrase": "gp"}, {"score": 0.004244375827831527, "phrase": "online_banners"}, {"score": 0.00420760449108585, "phrase": "patient_organizations"}, {"score": 0.004180234323211199, "phrase": "primary_care_patients"}, {"score": 0.004162086114221198, "phrase": "chronic_complaints"}, {"score": 0.004072515283467792, "phrase": "regression_analysis"}, {"score": 0.0040196969737538385, "phrase": "main_drivers"}, {"score": 0.0037903327482565097, "phrase": "prior_e-consultation_experience"}, {"score": 0.0035276332436138987, "phrase": "gp._patients"}, {"score": 0.003333502518010729, "phrase": "additional_questions"}, {"score": 0.003247531467016919, "phrase": "web-based_triage_application"}, {"score": 0.003233419377435801, "phrase": "computer-generated_advice"}, {"score": 0.0030888830649190282, "phrase": "patients'_motivations"}, {"score": 0.002996122158460243, "phrase": "quick_response"}, {"score": 0.0029636707388579976, "phrase": "socio-demographic_and_health-related_characteristics"}, {"score": 0.0027461155463816772, "phrase": "e-consultation_services"}, {"score": 0.0026927954624132422, "phrase": "less-educated_patients"}, {"score": 0.0026175952455594277, "phrase": "highly_educated_patients"}, {"score": 0.00245730364490796, "phrase": "tailored_education"}, {"score": 0.002404332275287924, "phrase": "patient_profiles"}, {"score": 0.0023730978395564116, "phrase": "special_attention"}, {"score": 0.002286781334850213, "phrase": "greatest_chance"}, {"score": 0.0022423598816179325, "phrase": "health_care"}, {"score": 0.0021892345747666977, "phrase": "patient_expectations"}, {"score": 0.0021607883988873492, "phrase": "major_force"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ireland_ltd."}], "paper_keywords": ["Internet", " E-mail", " Consultation", " Patient-provider communication", " Primary care"], "paper_abstract": "Objective: To identify factors that can enhance the use of e-consultation in primary care. We investigated the barriers, demands and motivations regarding e-consultation among patients with no e-consultation experience (non-users). Methods: We used an online survey to gather data. Via online banners on 26 different websites of patient organizations we recruited primary care patients with chronic complaints, an important target group for e-consultation. A regression analysis was performed to identify the main drivers for e-consultation use among patients with no e-consultation experience. Results: In total, 1706 patients started to fill out the survey Of these patients 90% had no prior e-consultation experience. The most prominent reasons for non-use of e-consultation use were: not being aware of the existence of the service, the preference to see a doctor and e-consultation not being provided by a GP. Patients were motivated to use e-consultation, because e-consultation makes it possible to contact a GP at any time and because it enabled patients to ask additional questions after a visit to the doctor. The use of a web-based triage application for computer-generated advice was popular among patients desiring to determine the need to see a doctor and for purposes of self-care. The patients' motivations to use e-consultation strongly depended on demands being satisfied such as getting a quick response. When looking at socio-demographic and health-related characteristics it turned out that certain patient groups - the elderly, the less-educated individuals, the chronic medication users and the frequent GP visitors - were more motivated than other patient groups to use e-consultation services, but were also more demanding. The less-educated patients, for example, more strongly demanded instructions regarding e-consultation use than the highly educated patients. Conclusion: In order to foster the use of e-consultation in primary care both GPs and non-users must be informed about the possibilities and consequences of e-consultation through tailored education and instruction. We must also take into account patient profiles and their specific demands regarding e-consultation. Special attention should be paid to patients who can benefit the most from e-consultation while also facing the greatest chance of being excluded from the service. As health care continues to evolve towards a more patient-centred approach, we expect that patient expectations and demands will be a major force in driving the adoption of e-consultation. (C) 2009 Elsevier Ireland Ltd. All rights reserved.", "paper_title": "Increasing the use of e-consultation in primary care: Results of an online survey among non-users of e-consultation", "paper_id": "WOS:000270079200006"}