{"auto_keywords": [{"score": 0.0435901678868039, "phrase": "cross-company_models"}, {"score": 0.007530163027320049, "phrase": "-company_models"}, {"score": 0.007157399515688665, "phrase": "formal_meta-analysis"}, {"score": 0.004816126411422772, "phrase": "cross"}, {"score": 0.004740126725341152, "phrase": "estimation_studies"}, {"score": 0.004504850679320975, "phrase": "individual_organizations"}, {"score": 0.004383016741930174, "phrase": "cross-company-based_estimation_models"}, {"score": 0.003989675045520656, "phrase": "project_data"}, {"score": 0.003958529104387973, "phrase": "ten_papers"}, {"score": 0.0038817197332605647, "phrase": "-company_estimation_models"}, {"score": 0.0037915057447460133, "phrase": "independent_results"}, {"score": 0.0035750047462243836, "phrase": "within-company_models"}, {"score": 0.0033840673522948592, "phrase": "experimental_procedures"}, {"score": 0.0031658283119347396, "phrase": "main_trend"}, {"score": 0.003141093559655865, "phrase": "study_results"}, {"score": 0.002915514089373717, "phrase": "one-out_cross_validation"}, {"score": 0.0028588847851995533, "phrase": "within-company_model"}, {"score": 0.0027597018725736165, "phrase": "cross-company_model"}, {"score": 0.002340357706078868, "phrase": "different_data_bases"}], "paper_keywords": ["cost estimation", " management", " systematic review", " software engineering"], "paper_abstract": "The objective of this paper is to determine under what circumstances individual organizations would be able to rely on cross-company-based estimation models. We performed a systematic review of studies that compared predictions from cross-company models with predictions from within-company models based on analysis of project data. Ten papers compared cross-company and within-company estimation models; however, only seven presented independent results. Of those seven, three found that cross-company models were not significantly different from within-company models, and four found that cross-company models were significantly worse than within-company models. Experimental procedures used by the studies differed making it impossible to undertake formal meta-analysis of the results. The main trend distinguishing study results was that studies with small within-company data sets (i.e., < 20 projects) that used leave-one-out cross validation all found that the within-company model was significantly different ( better) from the cross-company model. The results of this review are inconclusive. It is clear that some organizations would be ill-served by cross-company models whereas others would benefit. Further studies are needed, but they must be independent (i.e., based on different data bases or at least different single company data sets) and should address specific hypotheses concerning the conditions that would favor cross-company or within-company models. In addition, experimenters need to standardize their experimental procedures to enable formal meta-analysis, and recommendations are made in Section 3.", "paper_title": "Cross versus within-company cost estimation studies: A systematic review", "paper_id": "WOS:000245303400004"}