{"auto_keywords": [{"score": 0.049465088868450455, "phrase": "network_coordinate_system"}, {"score": 0.00481495049065317, "phrase": "secure_network_coordinate_systems"}, {"score": 0.004713665777294533, "phrase": "euclidean"}, {"score": 0.004456044928556639, "phrase": "easy_estimation"}, {"score": 0.004417848254181138, "phrase": "network_latency"}, {"score": 0.003933000051147382, "phrase": "vuze_bittorrent"}, {"score": 0.0038492126993451337, "phrase": "nita-rotaru"}, {"score": 0.003310447652300423, "phrase": "outlier_detection"}, {"score": 0.0032538723984338615, "phrase": "adversarial_inputs"}, {"score": 0.002934098412396701, "phrase": "sherr"}, {"score": 0.0028591768694918, "phrase": "usenix_atc"}, {"score": 0.002668582249630492, "phrase": "frog-boiling"}, {"score": 0.002544951823639408, "phrase": "even_a_system"}, {"score": 0.0025230952890994236, "phrase": "trusted_entities"}, {"score": 0.002226430168622392, "phrase": "frog-boiling_attack"}, {"score": 0.0021695394558562927, "phrase": "previously_known_attacks"}, {"score": 0.0021049977753042253, "phrase": "\"bad\"_inputs"}], "paper_keywords": ["Security", " Measurement", " Network coordinate", " attack", " secure"], "paper_abstract": "A network coordinate system assigns Euclidean \"virtual\" coordinates to every node in a network to allow easy estimation of network latency between pairs of nodes that have never contacted each other. These systems have been implemented in a variety of applications, most notably the popular Vuze BitTorrent client. Zage and Nita-Rotaru (at CCS 2007) and independently, Kaafar et al. (at SIGCOMM 2007), demonstrated that several widely-cited network coordinate systems are prone to simple attacks, and proposed mechanisms to defeat these attacks using outlier detection to filter out adversarial inputs. Kaafar et al. goes a step further and requires that a fraction of the network is trusted. More recently, Sherr et al. (at USENIX ATC 2009) proposed Veracity, a distributed reputation system to secure network coordinate systems. We describe a new attack on network coordinate systems, Frog-Boiling, that defeats all of these defenses. Thus, even a system with trusted entities is still vulnerable to attacks. Moreover, having witnesses vouch for your coordinates as in Veracity does not prevent our attack. Finally, we demonstrate empirically that the Frog-Boiling attack is more disruptive than the previously known attacks: systems that attempt to reject \"bad\" inputs by statistical means or reputation cannot be used to secure a network coordinate system.", "paper_title": "The Frog-Boiling Attack: Limitations of Secure Network Coordinate Systems", "paper_id": "WOS:000297682600006"}