{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "service_automation"}, {"score": 0.004766683200410046, "phrase": "service-oriented_architecture"}, {"score": 0.004695183699894267, "phrase": "emerging_paradigm"}, {"score": 0.004578382275810468, "phrase": "business-oriented_as_well_as_technical_infrastructure_processes"}, {"score": 0.004288059466938456, "phrase": "paramount_importance"}, {"score": 0.00363080961099728, "phrase": "software_architecture"}, {"score": 0.003576286811853861, "phrase": "service-based_applications"}, {"score": 0.003058515297281172, "phrase": "architectural_decisions"}, {"score": 0.0027929100418926725, "phrase": "specific_data"}, {"score": 0.0024742098091226203, "phrase": "technical_and_non-technical_stakeholders"}, {"score": 0.0021697677572213086, "phrase": "promising_reusability"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Architecture viewpoint", " Service-oriented architecture", " Automation"], "paper_abstract": "Service-oriented architecture is an emerging paradigm for the execution of business-oriented as well as technical infrastructure processes by means of services. Automating the execution of services is of paramount importance in order to fulfill the needs of companies. However we have found that automation - although important - is seldom addressed explicitly as a concern when stating requirements or designing the software architecture of the service-based applications (SBAs). In this paper we define three architectural viewpoints framing the concerns about service automation. These three viewpoints, called 3D (Decisions, Degree, Data), respectively: express architectural decisions about automation; help identifying the level (degree) of automation required, and represent the specific data required to support automation in services. They have been applied to three industrial case studies and one academic experiment. Results show that they successfully support both technical and non-technical stakeholders in understanding how, and communicating upon, their concerns related to service automation have been addressed. The application of the 3D service automation viewpoints to different domains exhibits promising reusability. (c) 2012 Elsevier Inc. All rights reserved.", "paper_title": "3D architecture viewpoints on service automation", "paper_id": "WOS:000317322400011"}