{"auto_keywords": [{"score": 0.04286666008487537, "phrase": "concept_drift"}, {"score": 0.012240848402994785, "phrase": "frequent_patterns"}, {"score": 0.007740489563401459, "phrase": "support_approximation"}, {"score": 0.0075530207214230755, "phrase": "concept-drifting_data_streams"}, {"score": 0.005997094896448248, "phrase": "mining_accuracy"}, {"score": 0.004516733575701128, "phrase": "online_data_stream"}, {"score": 0.0038397509389856625, "phrase": "data_stream_mining_method"}, {"score": 0.003479692058963528, "phrase": "transactional_data_streams"}, {"score": 0.0033288399506044763, "phrase": "important_issue"}, {"score": 0.0032800186243040663, "phrase": "accuracy_preservation"}, {"score": 0.003200230621987751, "phrase": "frequent-pattern_mining"}, {"score": 0.00266693888510356, "phrase": "different_patterns"}, {"score": 0.0024405312482831646, "phrase": "frequency_relationship_modeling"}, {"score": 0.0023928819778638055, "phrase": "concept_learning"}, {"score": 0.0022113879114507577, "phrase": "experimental_results"}, {"score": 0.0021049977753042253, "phrase": "proposed_method"}], "paper_keywords": ["Data stream mining", " Frequent pattern", " Concept drift", " Support approximation", " Concept learning"], "paper_abstract": "In an online data stream, the composition and distribution of the data may change over time, which is a phenomenon known as concept drift. The occurrence of concept drift can affect considerably the performance of a data stream mining method, especially in relation to mining accuracy. In this paper, we study the problem of mining frequent patterns from transactional data streams in the presence of concept drift, considering the important issue of mining accuracy preservation. In terms of frequent-pattern mining, we give the definitions of concept and concept drift with respect to streaming data; moreover, we present a categorization for concept drift. The concept of streaming data is considered the relationships of frequency between different patterns. Accordingly, we devise approaches to describe the concept concretely and to learn the concept through frequency relationship modeling. Based on concept learning, we propose a method of support approximation for discovering data stream frequent patterns. Our analyses and experimental results have shown that in several studied cases of concept drift, the proposed method not only performs efficiently in terms of time and memory but also preserves mining accuracy well on concept-drifting data streams.", "paper_title": "An approach of support approximation to discover frequent patterns from concept-drifting data streams based on concept learning", "paper_id": "WOS:000340616300007"}