{"auto_keywords": [{"score": 0.04586846484671967, "phrase": "acoustic_piano"}, {"score": 0.03588915745850245, "phrase": "continuous_control"}, {"score": 0.00481495049065317, "phrase": "continuous-control_keyboard_instruments"}, {"score": 0.004337900700685262, "phrase": "electronic_keyboards"}, {"score": 0.004195418010131832, "phrase": "essential_feature"}, {"score": 0.0033622909109253616, "phrase": "early_mechanical_origins"}, {"score": 0.0033204052817782464, "phrase": "latest_digital_controllers"}, {"score": 0.003292770855568091, "phrase": "augmented_instruments"}, {"score": 0.0032246835734680377, "phrase": "author's_own_contributions"}, {"score": 0.0030414140732789186, "phrase": "continuous_key_angle"}, {"score": 0.002953711377604328, "phrase": "touchkeys"}, {"score": 0.0027741761880779535, "phrase": "key_surfaces"}, {"score": 0.002627407106087633, "phrase": "existing_keyboards"}, {"score": 0.0026055251533586804, "phrase": "fully_continuous_controllers"}, {"score": 0.002477998427152547, "phrase": "sustaining_note"}, {"score": 0.0024065032567542107, "phrase": "keyboardist_new_dimensions"}, {"score": 0.0023665766694993535, "phrase": "key_velocity"}, {"score": 0.002298288831092204, "phrase": "new_and_imaginative_musical_interfaces"}, {"score": 0.0021857667493036786, "phrase": "foreseeable_future"}, {"score": 0.0021049977753042253, "phrase": "new_levels"}], "paper_keywords": [""], "paper_abstract": "The keyboard is one of the most popular and enduring musical interfaces ever created. Today, the keyboard is most closely associated with the acoustic piano and the electronic keyboards inspired by it, which share the essential feature of being discrete: Notes are defined temporally by their onset and release only, with little control over each note beyond velocity and timing. Many keyboard instruments have been invented, however, that let the player continuously shape each note. This article provides a review of keyboards whose keys allow continuous control, from early mechanical origins to the latest digital controllers and augmented instruments. Two of the author's own contributions will be described in detail: a portable optical scanner that can measure continuous key angle on any acoustic piano, and the TouchKeys capacitive multi-touch sensors, which measure the position of fingers on the key surfaces. These two instrument technologies share the trait that they transform the keys of existing keyboards into fully continuous controllers. In addition to their ability to shape the sound of a sustaining note, both technologies also give the keyboardist new dimensions of articulation beyond key velocity. Even in an era of new and imaginative musical interfaces, the keyboard is likely to remain with us for the foreseeable future, and the incorporation of continuous control can bring new levels of richness and nuance to a performance.", "paper_title": "Buttons, Handles, and Keys: Advances in Continuous-Control Keyboard Instruments", "paper_id": "WOS:000355321900002"}