{"auto_keywords": [{"score": 0.04804050199975018, "phrase": "handheld_devices"}, {"score": 0.004650330504968421, "phrase": "current_applications"}, {"score": 0.0044718206943536514, "phrase": "full_use"}, {"score": 0.004413846562278824, "phrase": "unique_attributes"}, {"score": 0.004225950334493496, "phrase": "pedagogically_sensible_manner"}, {"score": 0.004010960493946656, "phrase": "functional_framework"}, {"score": 0.003958937342925219, "phrase": "handheld_application"}, {"score": 0.003806866174028117, "phrase": "pedagogical_underpinning"}, {"score": 0.0035974243349266894, "phrase": "seven_distinct_categories"}, {"score": 0.002473420909291381, "phrase": "new_learning_opportunities"}, {"score": 0.0022768346311104735, "phrase": "learning_scenarios"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["collaboration", " constructionism", " contextualisation", " constructivism", " handheld devices", " categorisation", " framework"], "paper_abstract": "This paper explores current applications for handheld devices and questions which of these make full use of the unique attributes of handheld devices in order to facilitate learning in a pedagogically sensible manner. In order to do so, the paper presents a functional framework which analyses handheld application in relation to their use as well as the pedagogical underpinning, if any, that informs their development. Our framework currently consists of seven distinct categories of application, which we term: administrative, referential, interactive, microworld, data collection, location aware and collaborative. We argue that three categories, namely data collection, location aware and collaborative, are particularly suited to learning with handheld devices when they are informed by collaborative, contextual and constructionist learning theories. Furthermore, we contend that applications of the type just outlined deserve further research since they are not attempting to replicate, or even augment, existing learning scenarios but rather they try to create new learning opportunities which would not be possible without (mobile) technology. Finally, the authors introduce a number of applications and learning scenarios that they have developed for handheld devices and explain their position within the framework. (c) 2005 Elsevier Ltd. All rights reserved.", "paper_title": "Designing collaborative, constructionist and contextual applications for handheld devices", "paper_id": "WOS:000235501800007"}