{"auto_keywords": [{"score": 0.04359354986608515, "phrase": "lettering_techniques"}, {"score": 0.015457069351653625, "phrase": "ancient_inscriptions"}, {"score": 0.0044786435725543685, "phrase": "manual_analysis"}, {"score": 0.004291848822287492, "phrase": "geographical_and_chronological_classification"}, {"score": 0.00402610372759447, "phrase": "novel_framework"}, {"score": 0.0039077616208517026, "phrase": "statistical_analysis"}, {"score": 0.0038253590626087237, "phrase": "proposed_framework"}, {"score": 0.0037128955884188773, "phrase": "shading_technique"}, {"score": 0.0035731269727067496, "phrase": "inscribed_surfaces"}, {"score": 0.003527712410706358, "phrase": "obtained_surfaces"}, {"score": 0.003468053168607071, "phrase": "smaller_box-shaped_regions"}, {"score": 0.0029871209444889716, "phrase": "functional_minimization_method"}, {"score": 0.0028745946327439656, "phrase": "unknown_average_surface"}, {"score": 0.002754516260621121, "phrase": "estimated_atlases"}, {"score": 0.0027194778713860715, "phrase": "automated_analysis"}, {"score": 0.00268488398249084, "phrase": "inscribed_letters"}, {"score": 0.002342110338541984, "phrase": "five_ancient_greek_inscriptions"}], "paper_keywords": ["Epigraphy", " Squeeze digitization", " Shape from shading", " Atlas construction", " Agglomerative hierarchical clustering"], "paper_abstract": "Studying ancient inscriptions is based up to date mostly on observation and manual analysis by means of which epigraphists attempt to establish a geographical and chronological classification as well as to analyze the lettering techniques. In this paper we propose a novel framework for efficient 3D reconstruction of inscriptions and for statistical analysis of their reconstructed surfaces. The proposed framework employs a shape-from-shading technique to reconstruct in 3D the shape of the inscribed surfaces. The obtained surfaces are segmented into smaller box-shaped regions containing single letters. These letters are classified into groups of same characters or symbols and then an atlas (average) letter shape is created for each character. For the construction of those atlases we employ a functional minimization method that registers the surfaces of same letters to the unknown average surface, which is also estimated simultaneously. Using the estimated atlases, an automated analysis of the inscribed letters is performed. This framework can be effectively used for the study of the variations of the lettering techniques within an inscription or a set of inscriptions. We applied our framework to five ancient Greek inscriptions. Our results are reported in detail and the variations found in lettering techniques are commented on by archaeologists who also validate the accuracy of our proposed method.", "paper_title": "A novel framework for 3D reconstruction and analysis of ancient inscriptions", "paper_id": "WOS:000282095900015"}