{"auto_keywords": [{"score": 0.039853922732353365, "phrase": "data_aggregation"}, {"score": 0.015719716506582538, "phrase": "time-constrained_wireless_sensor_networks"}, {"score": 0.0092400987905815, "phrase": "aggregation_gain"}, {"score": 0.004536862734384202, "phrase": "wireless_sensor_networks"}, {"score": 0.004163172790791119, "phrase": "limited_and_non-exchangeable_energy_supply"}, {"score": 0.002931569771634119, "phrase": "best_performance"}, {"score": 0.0028549396580672417, "phrase": "energy_saving"}, {"score": 0.0027803070408286158, "phrase": "packet_delivery_accuracy"}, {"score": 0.0025340874787959195, "phrase": "structure-based_data_gathering"}, {"score": 0.00234043119560776, "phrase": "hybrid_method"}, {"score": 0.002294369814584028, "phrase": "multi-level_structure-based_approaches"}, {"score": 0.0021049977753042253, "phrase": "energy_consumption"}], "paper_keywords": ["Wireless sensor networks", " Real-time", " Data aggregation"], "paper_abstract": "A fundamental challenge in the design of wireless sensor networks (WSNs) is to maximize their lifetime especially because they have a limited and non-exchangeable energy supply. One of the most important methods to prolong the lifetime of a WSN is data aggregation. Indeed, data aggregation reduces the number of broadcasts, hence collisions and energy consumption. Many methods has been proposed in the literatures to organize the network for data aggregation like clustering which has been proved to provide the best performance in term of energy saving, aggregation gain and packet delivery accuracy, or structure free which has been proved to perform better than a structure-based data gathering. To benefit all the advantages of these two approaches, we propose a hybrid method that combines multi-level structure-based approaches for time-constrained wireless sensor networks. Simulation results show that our proposed method can improve aggregation gain and energy consumption.", "paper_title": "New data aggregation approach for time-constrained wireless sensor networks", "paper_id": "WOS:000353786700006"}