{"auto_keywords": [{"score": 0.0403633960777679, "phrase": "user_activities"}, {"score": 0.028085311031344838, "phrase": "message_urgency"}, {"score": 0.015719716506582538, "phrase": "living-room_laboratory"}, {"score": 0.014847250376977403, "phrase": "urgent_messages"}, {"score": 0.014537985400380735, "phrase": "non-urgent_messages"}, {"score": 0.013606756916570652, "phrase": "presentation_mode"}, {"score": 0.00478579024367007, "phrase": "recent_field_experiments"}, {"score": 0.004329254684453746, "phrase": "possible_way"}, {"score": 0.004061584718427419, "phrase": "message_content"}, {"score": 0.0037988336463795963, "phrase": "best_time"}, {"score": 0.003563841266960747, "phrase": "controlled_home_setting"}, {"score": 0.0034570879043633114, "phrase": "user_study"}, {"score": 0.003353521531649663, "phrase": "everyday_home_activities"}, {"score": 0.0033029038236817372, "phrase": "rate_factors"}, {"score": 0.0030424424705823455, "phrase": "questionnaire_data"}, {"score": 0.0030056376712621793, "phrase": "cluster_analysis"}, {"score": 0.0029512611306191194, "phrase": "semantic_model"}, {"score": 0.0028367868542874763, "phrase": "key_findings"}, {"score": 0.0028110048684383167, "phrase": "present_study"}, {"score": 0.002370437342182879, "phrase": "predefined_presentation_threshold"}, {"score": 0.0021438155673297377, "phrase": "future_home_notification_systems"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Notification systems", " Considerate home environments", " Ubiquitous computing", " User attention", " Ambient displays", " User engagement"], "paper_abstract": "Recent field experiments on acceptability of notifications in the home showed that people generally want to be informed of urgent messages as soon as possible, whereas non-urgent messages should not be presented at all. A possible way to improve the acceptability of a notification might be to adjust the presentation mode and the timing of notifications to the message content and to the state of the user. For example, acceptability might be improved by considering user activities when selecting the best time to present the message. The relation between acceptability, presentation mode and timing has not been formally studied in a controlled home setting before. This paper presents the results of a user study, in which 10 participant couples were asked to engage in everyday home activities, and to subjectively rate factors that were expected to influence acceptability. The study was situated in a living-room laboratory in which the user activities and the timing of notifications were controlled. Questionnaire data was evaluated using cluster analysis in order to construct a semantic model that describes the relationship between user, system and environment. The key findings in the present study are: (1) acceptability could be improved by adjusting the level of intrusiveness of the presentation to message urgency: urgent messages should be presented intrusively, medium-urgent messages unobtrusively, and (2) non-urgent messages should be postponed until the message urgency has increased, or skipped if the message urgency never exceeds the predefined presentation threshold. Surprisingly, the user activities at the time of notification were not found to influence acceptability. These findings have resulted in a model of acceptability of notifications for the design of future home notification systems. (C) 2009 Elsevier Ltd. All rights reserved.", "paper_title": "Considerate home notification systems: A user study of acceptability of notifications in a living-room laboratory", "paper_id": "WOS:000269430300008"}