{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "homeless_young_people"}, {"score": 0.01837887945306354, "phrase": "information_resources"}, {"score": 0.004274766964161756, "phrase": "particular_\"place"}, {"score": 0.0041357305373417455, "phrase": "particular_purpose"}, {"score": 0.0039096275435779124, "phrase": "participatory-design_research_approach"}, {"score": 0.003820144626025562, "phrase": "nine_service_agencies"}, {"score": 0.003482160257566501, "phrase": "ad_hoc_organizational_schemes"}, {"score": 0.003368816076401138, "phrase": "key_values"}, {"score": 0.0032916702592724217, "phrase": "human_welfare"}, {"score": 0.003153041030690117, "phrase": "information_delivery"}, {"score": 0.0031012854824177772, "phrase": "common_values"}, {"score": 0.003050376875258722, "phrase": "two-step_design_process"}, {"score": 0.0029805015010906013, "phrase": "card-sorting_activity"}, {"score": 0.002931569771634119, "phrase": "new_organizational_scheme"}, {"score": 0.0028267211555015295, "phrase": "rolling_case"}, {"score": 0.002789528662623221, "phrase": "slat_wall"}, {"score": 0.0027619548979328154, "phrase": "infold"}, {"score": 0.002256677005409071, "phrase": "organizational_schemes"}, {"score": 0.002241773449372999, "phrase": "novel_presentations"}, {"score": 0.002161542155696987, "phrase": "grassroots_service_agencies"}], "paper_keywords": [""], "paper_abstract": "In this paper we examine how information-particularly, its organization and presentation-and \"space\" (i.e., a physical location) can be combined to create a particular \"place\" (i.e., a location adapted to a particular purpose) for engaging and stabilizing homeless young people, aged 13-25. Over 10 months, we used a participatory-design research approach to investigate how an alliance of nine service agencies used information resources to support homeless young people. We collected 250 information resources and analyzed how these materials were organized and presented at four service agencies. In general, the agencies used ad hoc organizational schemes and presentations that were not in keeping with the key values of the alliance, which include human welfare, respect, trust, autonomy, and sustainability. To improve information delivery and the projection of common values, we followed a two-step design process. First, based on a card-sorting activity, we developed a new organizational scheme. Second, we developed four interrelated prototypes for presenting information resources: Rolling Case, InfoBike, Slat Wall, and Infold. To convey the use of these prototypes, three short video scenarios were created to demonstrate how the prototypes would be used by stakeholders, including homeless young people, staff, and volunteers. Feedback from stakeholders suggested that these prototypes, when sufficiently refined, could be useful and operationally viable. By investigating the concept of \"place,\" reconstituted through organizational schemes and novel presentations of information resources, this work creates possibilities that may allow grassroots service agencies to give more efficient access to information while expressing their values.", "paper_title": "Stabilizing Homeless Young People with Information and Place", "paper_id": "WOS:000271199600010"}