{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "fuzzy_information_retrieval_systems"}, {"score": 0.04565922187614429, "phrase": "weighted_queries"}, {"score": 0.013619530235806065, "phrase": "teacher's_activity"}, {"score": 0.004662427600500598, "phrase": "computer-supported_learning_system"}, {"score": 0.00409895142748329, "phrase": "degree_course_information_retrieval_systems_based"}, {"score": 0.004055176557424983, "phrase": "artificial_intelligence"}, {"score": 0.003470358620464986, "phrase": "different_semantics"}, {"score": 0.0032189132350239013, "phrase": "query_evaluation"}, {"score": 0.0030834712590249863, "phrase": "computer-supported_education_system"}, {"score": 0.002695768552609587, "phrase": "self-learning_processes"}, {"score": 0.002473560912156024, "phrase": "learning_process"}, {"score": 0.0024209250169088575, "phrase": "students'_perceptions"}, {"score": 0.0023440589015485077, "phrase": "course's_exams"}, {"score": 0.0022453451864218477, "phrase": "software_tool"}, {"score": 0.0021392418081444798, "phrase": "weighted_query_languages"}], "paper_keywords": ["Teaching", " Education", " Weighted queries", " Fuzzy connectives", " Fuzzy Information Retrieval"], "paper_abstract": "This paper describes a computer-supported learning system to teach students the principles and concepts of Fuzzy Information Retrieval Systems based on weighted queries. This tool is used to support the teacher's activity in the degree course Information Retrieval Systems Based on Artificial Intelligence at the Faculty of Library and Information Sciences at the University of Granada. Learning of languages of weighted queries in Fuzzy Information Retrieval Systems is complex because it is very difficult to understand the different semantics that could be associated to the weights of queries together with their respective strategies of query evaluation. We have developed and implemented this computer-supported education system because it allows to support the teacher's activity in the classroom to teach the use of weighted queries in FIRSs and it helps students to develop self-learning processes on the use of such queries. We have evaluated the performance of its use in the learning process according to the students' perceptions and their results obtained in the course's exams. We have observed that using this software tool the students learn better the management of the weighted query languages and then their performance in the exams is improved.", "paper_title": "A computer-supported learning system to help teachers to teach Fuzzy Information Retrieval Systems", "paper_id": "WOS:000263672600006"}