{"auto_keywords": [{"score": 0.042096713408207954, "phrase": "high_accuracy"}, {"score": 0.026337156871224118, "phrase": "measure_errors"}, {"score": 0.00481495049065317, "phrase": "wireless_sensor_networks"}, {"score": 0.00454725669814484, "phrase": "sensor_networks"}, {"score": 0.003953639783762917, "phrase": "limited_number"}, {"score": 0.0038420778359143917, "phrase": "different_technologies"}, {"score": 0.003817715315140651, "phrase": "signal_and_angle_measurements"}, {"score": 0.003663067281537946, "phrase": "network_environment"}, {"score": 0.0036282750398991485, "phrase": "position_inaccuracies"}, {"score": 0.002750721367040336, "phrase": "sensor_node"}, {"score": 0.0026224255640133758, "phrase": "others_nodes"}, {"score": 0.002556459595882617, "phrase": "wrong_information"}, {"score": 0.002508073621696602, "phrase": "last_property"}, {"score": 0.002444977075259825, "phrase": "main_drawback"}, {"score": 0.002429451930463481, "phrase": "measure-based_methods"}, {"score": 0.0024063484128685367, "phrase": "at-dist_and_at-angle_techniques"}, {"score": 0.0023458049872325214, "phrase": "error_rate"}, {"score": 0.002286781334850213, "phrase": "good_performances"}, {"score": 0.0022434880661725493, "phrase": "localized_nodes"}, {"score": 0.002166230024967046, "phrase": "low_number"}, {"score": 0.0021049977753042253, "phrase": "john_wiley"}], "paper_keywords": ["wireless Sensor networks", " localization", " distributed algorithms"], "paper_abstract": "This paper addresses the problem of localization in sensor networks where, initially, a certain number of sensors are aware of their positions (either by using GPS or by being hand-placed) and are referred to as anchors. Our goal is to localize all sensors with high accuracy, while using a limited number of anchors. Sensors can be equipped with different technologies for signal and angle measurements. These measures can be altered by some errors because of the network environment that induces position inaccuracies. In this paper, we propose a family (AT-Family) of three new distributed localization techniques in wireless sensor networks: free-measurement (AT-Free) where sensors have no capability of measure, signal-measurement (AT-Dist) where sensors can calculate distances, and angle-measurement (AT-Angle) where sensors can calculate angles. These methods determine the position of each sensor while indicating the accuracy of its position. They have two important properties: first, a sensor node can deduce if its estimated position is close to its real position and contribute to the positioning of others nodes; second, a sensor can eliminate wrong information received about its position. This last property allows to manage measure errors that are the main drawback of measure-based methods such as AT-Dist and AT-Angle techniques. By varying the density and the error rate, simulations show that the three proposed techniques achieve good performances in term of high accuracy of localized nodes and less energy consuming while assuming presence of measure errors and considering low number of anchors. Copyright (c) 2012 John Wiley & Sons, Ltd.", "paper_title": "Cooperative localization techniques for wireless sensor networks: free, signal and angle based techniques", "paper_id": "WOS:000343798000004"}