{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "schema_mappings"}, {"score": 0.025013933262657325, "phrase": "data_examples"}, {"score": 0.01557387362092176, "phrase": "schema_mapping"}, {"score": 0.015144289235115514, "phrase": "source_schema"}, {"score": 0.0055140205454140105, "phrase": "gav_schema_mappings"}, {"score": 0.004971286920563053, "phrase": "efficient_algorithm"}, {"score": 0.004725048156646577, "phrase": "high-level_specification"}, {"score": 0.004593317752310294, "phrase": "target_schema"}, {"score": 0.004481732700334695, "phrase": "unary_relations"}, {"score": 0.0041408296624638125, "phrase": "source_instance"}, {"score": 0.004012686357543403, "phrase": "precise_sense"}, {"score": 0.003571968614903263, "phrase": "computational_learning_theory"}, {"score": 0.003354180941665089, "phrase": "rich_body"}, {"score": 0.0028749210987951677, "phrase": "gav_constraints"}, {"score": 0.002699518198352191, "phrase": "angluin's_model"}, {"score": 0.002534789666280057, "phrase": "equivalence_queries"}, {"score": 0.0022774386034977168, "phrase": "gav"}, {"score": 0.0021249824741421306, "phrase": "shortest_gav_schema_mapping"}], "paper_keywords": ["Languages", " Algorithms", " Theory", " Schema mappings", " data exchange", " computational learning theory"], "paper_abstract": "A schema mapping is a high-level specification of the relationship between a source schema and a target schema. Recently, a line of research has emerged that aims at deriving schema mappings automatically or semi-automatically with the help of data examples, that is, pairs consisting of a source instance and a target instance that depict, in some precise sense, the intended behavior of the schema mapping. Several different uses of data examples for deriving, refining, or illustrating a schema mapping have already been proposed and studied. In this article, we use the lens of computational learning theory to systematically investigate the problem of obtaining algorithmically a schema mapping from data examples. Our aim is to leverage the rich body of work on learning theory in order to develop a framework for exploring the power and the limitations of the various algorithmic methods for obtaining schema mappings from data examples. We focus on GAV schema mappings, that is, schema mappings specified by GAV (Global-As-View) constraints. GAV constraints are the most basic and the most widely supported language for specifying schema mappings. We present an efficient algorithm for learning GAV schema mappings using Angluin's model of exact learning with membership and equivalence queries. This is optimal, since we show that neither membership queries nor equivalence queries suffice, unless the source schema consists of unary relations only. We also obtain results concerning the learnability of schema mappings in the context of Valiant's well-known PAC (Probably-Approximately-Correct) learning model, and concerning the learnability of restricted classes of GAV schema mappings. Finally, as a byproduct of our work, we show that there is no efficient algorithm for approximating the shortest GAV schema mapping fitting a given set of examples, unless the source schema consists of unary relations only.", "paper_title": "Learning Schema Mappings", "paper_id": "WOS:000329123100009"}