{"auto_keywords": [{"score": 0.03379263292841378, "phrase": "content_analysis_system"}, {"score": 0.00481495049065317, "phrase": "index_components"}, {"score": 0.004747620102130588, "phrase": "contents_analysis"}, {"score": 0.00470325458481566, "phrase": "journal's_scanned_cover_page"}, {"score": 0.00422177384286051, "phrase": "input_paper_information"}, {"score": 0.004182301599359094, "phrase": "constructing_index"}, {"score": 0.003990385737207714, "phrase": "different_features"}, {"score": 0.003916098498242888, "phrase": "general_documents"}, {"score": 0.003807242767474929, "phrase": "principal_elements"}, {"score": 0.003095923814666088, "phrase": "suggested_modeling_method"}, {"score": 0.002967634471075658, "phrase": "suggested_method"}, {"score": 0.0026384167183586015, "phrase": "efficient_projection_method"}, {"score": 0.0024128022009415476, "phrase": "index_information"}, {"score": 0.0023346234464901978, "phrase": "characters_region"}, {"score": 0.002280333649167796, "phrase": "experimental_result"}], "paper_keywords": [""], "paper_abstract": "In this paper, a method for automatically indexing the contents to reduce the effort that used to be required for input paper information and constructing index is sought. Various contents formats for journals, which have different features from those for general documents, are described. The principal elements that we want to represent are titles, authors, and pages for each paper. Thus, the three principal elements are modeled according to the order of their arrangement, and then their features are generalized. The content analysis system is then implemented based on the suggested modeling method. The content analysis system, implemented for verifying the suggested method, gets its input in the form containing more than 300 dpi gray scale image and analyze structural features of the contents. It classifies titles, authors and pages using efficient projection method. The definition of each item is classified according to regions, and then is extracted automatically as index information. It also helps to recognize characters region by region. The experimental result is obtained by applying to some of the suggested 6 models, and the system shows 97.3 % success rate for various journals.", "paper_title": "Extraction of index components based on contents analysis of journal's scanned cover page", "paper_id": "WOS:000240036000014"}