{"auto_keywords": [{"score": 0.03550786355456071, "phrase": "sensorart_platform"}, {"score": 0.02878977184865156, "phrase": "sdss"}, {"score": 0.00481495049065317, "phrase": "decision_support_system"}, {"score": 0.00470396687329822, "phrase": "ventricular_assist_device_support"}, {"score": 0.004386063799793622, "phrase": "impaired_ventricular_performance"}, {"score": 0.004242291530697285, "phrase": "significant_advancements"}, {"score": 0.00421410521089045, "phrase": "drug_therapy"}, {"score": 0.00406238127438793, "phrase": "heart_transplant"}, {"score": 0.004021954624114115, "phrase": "gold_standard_treatment"}, {"score": 0.003995226376780718, "phrase": "end-stage_hf"}, {"score": 0.003877121909026298, "phrase": "ventricular_assist_devices"}, {"score": 0.003737485125097945, "phrase": "circulatory_support"}, {"score": 0.0036390887584943723, "phrase": "waiting_time"}, {"score": 0.0033035520810722886, "phrase": "remote_treatment"}, {"score": 0.0030189426536422577, "phrase": "patients'_treatment"}, {"score": 0.00285242509099472, "phrase": "specialist's_decision_support_system"}, {"score": 0.002686085475479125, "phrase": "web-based_tool"}, {"score": 0.0026240423738883704, "phrase": "therapy_plan"}, {"score": 0.002572001496778222, "phrase": "vad_implantation"}, {"score": 0.002546368390189036, "phrase": "patients'_data"}, {"score": 0.002520990102833368, "phrase": "new_knowledge"}, {"score": 0.0024875444192203485, "phrase": "informative_decisions"}, {"score": 0.002421975107313603, "phrase": "medical_and_vad_experts"}, {"score": 0.002397833600728684, "phrase": "different_phases"}, {"score": 0.002381872778203302, "phrase": "vad_therapy"}, {"score": 0.0023346234464901978, "phrase": "related_fields"}], "paper_keywords": ["Heart failure", " ventricular assist devices", " decision support system"], "paper_abstract": "Background: Heart failure (HF) is affecting millions of people every year and it is characterized by impaired ventricular performance, exercise intolerance and shortened life expectancy. Despite significant advancements in drug therapy, mortality of the disease remains excessively high, as heart transplant remains the gold standard treatment for end-stage HF when no contraindications subsist. Traditionally, implanted Ventricular Assist Devices (VADs) have been employed in order to provide circulatory support to patients who cannot survive the waiting time to transplantation, reducing the workload imposed on the heart. In many cases that process could recover its contractility performance. Objectives: The SensorART platform focuses on the management and remote treatment of patients suffering from HE It provides an interoperable, extendable and VAD-independent solution, which incorporates various hardware and software components in a holistic approach, in order to improve the quality of the patients' treatment and the workflow of the specialists. This paper focuses on the description and analysis of Specialist's Decision Support System (SDSS), an innovative component of the SensorART platform. Methods: The SDSS is a Web-based tool that assists specialists on designing the therapy plan for their patients before and after VAD implantation, analyzing patients' data, extracting new knowledge, and making informative decisions. Results: SDSS offers support to medical and VAD experts through the different phases of VAD therapy, incorporating several tools covering all related fields; Statistics, Association Rules, Monitoring, Treatment, Weaning, Speed and Suction Detection. Conclusions: SDSS and its modules have been tested in a number of patients and the, results are encouraging.", "paper_title": "A Decision Support System for the Treatment of Patients with Ventricular Assist Device Support", "paper_id": "WOS:000333499900010"}