{"auto_keywords": [{"score": 0.04881318091486499, "phrase": "humor_detection"}, {"score": 0.014453615342238258, "phrase": "computational_humor"}, {"score": 0.00481495049065317, "phrase": "natural_language"}, {"score": 0.004563691742821759, "phrase": "computational_detection"}, {"score": 0.004364310576600359, "phrase": "useful_task"}, {"score": 0.0039380388343479384, "phrase": "perfect_test_platform"}, {"score": 0.0038855864345030563, "phrase": "advanced_level"}, {"score": 0.0038510053729959074, "phrase": "language_understanding"}, {"score": 0.0036335821512795026, "phrase": "ontological_semantic_approach"}, {"score": 0.0034902664176377943, "phrase": "direct_and_comprehensive_access"}, {"score": 0.0033227310662785293, "phrase": "statistical-cum-syntactical_keyword_methods"}, {"score": 0.0031210475158175432, "phrase": "humor_detection_model"}, {"score": 0.0028795712616923462, "phrase": "full_text_comprehension"}, {"score": 0.0027535633837592597, "phrase": "comprehensive_meaning_access_technology"}, {"score": 0.00269263690712392, "phrase": "unstructured_natural_language_text"}, {"score": 0.0026095920086044145, "phrase": "ontologically_defined_text"}, {"score": 0.0021915573326125428, "phrase": "ontological_semantic_text_analyzer"}, {"score": 0.0021526564019119466, "phrase": "english_sentence"}], "paper_keywords": ["Natural language", " Ontologies", " Semantics", " Humor detection", " Analyzer", " Text meaning representation"], "paper_abstract": "This paper deals with computational detection of humor. It assumes that computational humor is an useful task for any number of reasons and in many applications. Besides these applications, it also shows that recognition of humor is a perfect test platform for an advanced level of language understanding by a computer. It discusses the computational linguistic/semantic preconditions for computational humor and an ontological semantic approach to the task of humor detection, based on direct and comprehensive access to meaning rather than on trying to guess it with statistical-cum-syntactical keyword methods. The paper is informed by the experience of designing and implementing a humor detection model, whose decent success rate confirmed some of the assumptions while its flaws made other ideas prominent, including the necessity of full text comprehension. The bulk of the paper explains how the comprehensive meaning access technology makes it possible for unstructured natural language text to be automatically translated into the ontologically defined text meaning representations that can be used then to detect humor in them, if any, automatically. This part is informed by the experience, subsequent to humor detection, of designing, implementing, and testing an ontological semantic text analyzer that takes an English sentence as input and outputs its text meaning representation (TMR). Every procedure mentioned in the paper has either been implemented or proven to be implementable within the approach.", "paper_title": "Ontology-based view of natural language meaning: the case of humor detection", "paper_id": "WOS:000209325300006"}