{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "spectra_analysis"}, {"score": 0.03774847234753957, "phrase": "data_set"}, {"score": 0.032870506629902825, "phrase": "fundamental_question"}, {"score": 0.004671452420073219, "phrase": "k-means"}, {"score": 0.00457138247462329, "phrase": "clope"}, {"score": 0.003894963476923956, "phrase": "different_data_characteristics"}, {"score": 0.0038613835226952117, "phrase": "analysis_contexts"}, {"score": 0.003480230347985338, "phrase": "text_collections"}, {"score": 0.0034353020860809404, "phrase": "web_documents"}, {"score": 0.003361702510958392, "phrase": "biological_data"}, {"score": 0.0028762004595878714, "phrase": "efficient_method"}, {"score": 0.0025036862991477437, "phrase": "theoretical_and_experimental_results"}, {"score": 0.0022957232752482196, "phrase": "different_analysis_contexts"}, {"score": 0.0021233361369222344, "phrase": "clustering_process"}, {"score": 0.0021049977753042253, "phrase": "large_text_collections"}], "paper_keywords": ["clustering", " spectral methods", " eigenvalues", " eigenvectors"], "paper_abstract": "For many clustering algorithms, such as K-Means, Em, and CLOPE, there is usually a requirement to set some parameters. Often, these parameters directly or indirectly control the number of clusters, that is, k, to return. In the presence of different data characteristics and analysis contexts, it is often difficult for the user to estimate the number of clusters in the data set. This is especially true in text collections such as Web documents, images, or biological data. In an effort to improve the effectiveness of clustering, we seek the answer to a fundamental question: How can we effectively estimate the number of clusters in a given data set? We propose an efficient method based on spectra analysis of eigenvalues (not eigenvectors) of the data set as the solution to the above. We first present the relationship between a data set and its underlying spectra with theoretical and experimental results. We then show how our method is capable of suggesting a range of k that is well suited to different analysis contexts. Finally, we conclude with further empirical results to show how the answer to this fundamental question enhances the clustering process for large text collections.", "paper_title": "Enhancing the effectiveness of clustering with spectra analysis", "paper_id": "WOS:000247177500002"}