{"auto_keywords": [{"score": 0.05007834503226343, "phrase": "communication_journals"}, {"score": 0.026580781455701547, "phrase": "leydesdorff"}, {"score": 0.004453874101119545, "phrase": "network_analysis"}, {"score": 0.004250302819248558, "phrase": "academic_disciplines"}, {"score": 0.0036174746598098863, "phrase": "social_science"}, {"score": 0.0035063024767122684, "phrase": "citation_network"}, {"score": 0.0034162643819889054, "phrase": "cluster_analysis"}, {"score": 0.0033633514001658086, "phrase": "cited_disciplines"}, {"score": 0.002983916676307492, "phrase": "two-mode_network_analysis"}, {"score": 0.0028178463431115562, "phrase": "peripheral_journals"}, {"score": 0.00234834406550549, "phrase": "macro_cluster"}, {"score": 0.0022524959504997303, "phrase": "micro_cluster"}, {"score": 0.0021946189796487776, "phrase": "park"}, {"score": 0.0021049977753042253, "phrase": "discipline's_primary_influence"}], "paper_keywords": ["Citation analysis", " Network analysis", " Communication"], "paper_abstract": "This article describes the results of a network analysis based on the citation among Communication journals and those academic disciplines that are cited by those journals labeled as \"Communication\" by the Web of Science. The results indicate that the journals indexed solely as Communication rather than those also tagged as another social science are more central in the citation network. Further, a cluster analysis of the cited disciplines revealed three groupings, a micro psychological cluster, a macro socio-political group and a woman's studies clique. A two-mode network analysis found that the most central Communication journals cited multiple clusters, while the peripheral journals cited only one, suggesting that the structure of influence on the field of Communication is more complex than suggested by Park and Leydesdorff (Scientometrics 81(1):157-175, 2009). Also, the results indicate that the macro cluster is about twice as influential as the micro cluster, rather than as Park and Leydesdorff suggest that Psychology is the discipline's primary influence.", "paper_title": "Citations among communication journals and other disciplines: a network analysis", "paper_id": "WOS:000292210400008"}