{"auto_keywords": [{"score": 0.03407694553852572, "phrase": "promise_problems"}, {"score": 0.015719716506582538, "phrase": "quantum_finite_automata"}, {"score": 0.004772367030970874, "phrase": "exact_acceptance"}, {"score": 0.004646852519870358, "phrase": "exact_quantum_information_processing"}, {"score": 0.004386063799793622, "phrase": "quantum_tools"}, {"score": 0.00408501512749186, "phrase": "exact_quantum_computation"}, {"score": 0.003005539334280134, "phrase": "particular_classes"}, {"score": 0.002572001496778222, "phrase": "deterministic_finite_automata"}, {"score": 0.002352886041381761, "phrase": "component_languages"}], "paper_keywords": ["Exact quantum computing", " quantum finite automata", " promise problems", " state succinctness"], "paper_abstract": "The potential of the exact quantum information processing is an interesting, important and intriguing issue. For examples, it has been believed that quantum tools can provide significant, that is larger than polynomial, advantages in the case of exact quantum computation only, or mainly, for problems with very special structures. We will show that this is not the case. In this paper the potential of quantum finite automata producing outcomes not only with a (high) probability, but with certainty (so called exactly) is explored in the context of their uses for solving promise problems and with respect to the size of automata. It is shown that for solving particular classes {A(n)}(n=1)(infinity) of promise problems, even those without some very special structure, that succinctness of the exact quantum finite automata under consideration, with respect to the number of (basis) states, can be very small (and constant) though, it grows proportional to 17, in the case deterministic finite automata (DFAs) of the same power are used. This is here demonstrated also for the case that the component languages of the promise problems solvable by DFAs are non-regular. The method used can be applied in finding more exact quantum finite automata or quantum algorithms for other promise problems.", "paper_title": "Potential of Quantum Finite Automata with Exact Acceptance", "paper_id": "WOS:000370870100005"}