{"auto_keywords": [{"score": 0.049584128839210984, "phrase": "model_checking"}, {"score": 0.03843856552198327, "phrase": "design_process"}, {"score": 0.03546730795101328, "phrase": "problematic_human-automation_interaction"}, {"score": 0.028684005782997804, "phrase": "automation_surprise"}, {"score": 0.00481495049065317, "phrase": "complementary_use"}, {"score": 0.004618893461411858, "phrase": "aircraft_automation_designers"}, {"score": 0.003771185758226876, "phrase": "potential_problems"}, {"score": 0.003143341238802547, "phrase": "particular_problem"}, {"score": 0.003078577062864183, "phrase": "automation_surprises"}, {"score": 0.0027741761880779535, "phrase": "former_airbus_automatic_speed_protection_logic"}, {"score": 0.002619748321217153, "phrase": "common_case_study"}, {"score": 0.0025524176761139413, "phrase": "case_study"}, {"score": 0.002324007171619245, "phrase": "additional_automation_surprises"}, {"score": 0.0022760856906838814, "phrase": "flight_logic"}, {"score": 0.0021049977753042253, "phrase": "joint_method"}], "paper_keywords": ["Automation surprise", " formal methods", " mental model", " model checking", " simulation"], "paper_abstract": "Aircraft automation designers are faced with the challenge to develop and improve automation such that it is transparent to the pilots using it. To identify problems that may arise between pilots and automation, methods are needed that can uncover potential problems with automation early in the design process. In this paper, simulation and model checking are combined and their respective advantages leveraged to find problematic human-automation interaction using methods that would be available early in the design process. A particular problem of interest is automation surprises, which describe events when pilots are surprised by the actions of the automation. The Tarom flight 381 incident involving the former Airbus automatic speed protection logic, leading to an automation surprise, is used as a common case study. Results of this case study indicate that both methods identified the automation surprise found in the Tarom flight 381 incident, and that the simulation identified additional automation surprises associated with that flight logic. The work shows that the methods can be symbiotically combined, and the joint method is suitable to identify problematic human-automation interaction such as automation surprise.", "paper_title": "Example of a Complementary Use of Model Checking and Human Performance Simulation", "paper_id": "WOS:000342229500002"}