{"auto_keywords": [{"score": 0.04779402660657814, "phrase": "positive_solution"}, {"score": 0.004524624065803229, "phrase": "newly_developed_five-strut_parallel_machine"}, {"score": 0.004251728624599691, "phrase": "mechanic_principle"}, {"score": 0.003907403442285109, "phrase": "single_line"}, {"score": 0.003821503621554738, "phrase": "axis_line"}, {"score": 0.003770869401884267, "phrase": "principal_axis"}, {"score": 0.003574929398913029, "phrase": "mathematical_geometric_model"}, {"score": 0.003198705576491802, "phrase": "early_developed_ones"}, {"score": 0.003114449258490062, "phrase": "non-linear_equation"}, {"score": 0.002965684305115369, "phrase": "one-to-one_correspondent_relation"}, {"score": 0.0025605773834404253, "phrase": "parallel_machine"}, {"score": 0.002537880772794665, "phrase": "joint_rings"}, {"score": 0.0024930878032164757, "phrase": "different_degrees"}, {"score": 0.002142832962924139, "phrase": "common_reference"}, {"score": 0.0021049977753042253, "phrase": "parallel_machines"}], "paper_keywords": ["Parallel structure", " Positive solution", " Attitude", " Tool on spindle", " Active platform"], "paper_abstract": "This article proposes a method of positive solution of a newly developed five-strut parallel machine with joint rings. The key of this method is to find a mechanic principle contained in the structure. That is, the panels in which each strut locates intersect in a single line, which is the axis line of the principal axis (active platform). According to this principle, a mathematical geometric model is set up and an equation of positive solution is got through the principle of two panels intersecting in one line. This method is different from early developed ones which are based on a non-linear equation set. In this article, we set up a one-to-one correspondent relation among the structure parameters, the attitudes of strut and the attitudes of spindle in space. Thus we get a unique, simple, accurate and temporarily effective positive solution. This positive solution is also usable to other structures of parallel machine with joint rings, which have different degrees of freedom. In this paper, the information of the attitudes of stretching struts is utilized during the process of positive solution in order to prevent multi-solution. This methodology could be a common reference for other positive solutions of parallel machines.", "paper_title": "The Positive Solution of a 5-Strut Parallel Machine Tool with Joint Rings", "paper_id": "WOS:000303588600003"}