{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "richly_recorded_conversational_interaction"}, {"score": 0.004638462976078815, "phrase": "substantial_debate"}, {"score": 0.0040890178236849825, "phrase": "multi-modal_corpora"}, {"score": 0.003957477564354679, "phrase": "audio_domain"}, {"score": 0.0036382660173943393, "phrase": "natural_coupling"}, {"score": 0.0031328221096543823, "phrase": "illustrative_examples"}, {"score": 0.0029757667083164627, "phrase": "dynamic_interaction"}, {"score": 0.002893434697072309, "phrase": "multimodal_corpus"}, {"score": 0.0027100527874262446, "phrase": "total_five_participants"}, {"score": 0.002514625755809045, "phrase": "seven_video_cameras"}, {"score": 0.0023662411481713682, "phrase": "optitrack_motion_capture_kit"}, {"score": 0.0022161977759646693, "phrase": "conversational_involvement"}, {"score": 0.002195552442011313, "phrase": "speech_activity"}, {"score": 0.0021049977753042253, "phrase": "average_degree"}], "paper_keywords": ["Multimodality corpus", " Conversational involvement", " Spontaneous speech"], "paper_abstract": "In recent years there has been a substantial debate about the need for increasingly spontaneous, conversational corpora of spoken interaction that are not controlled or task directed. In parallel the need has arisen for the recording of multi-modal corpora which are not restricted to the audio domain alone. With a corpus that would fulfill both needs, it would be possible to investigate the natural coupling, not only in turn-taking and voice, but also in the movement of participants. In the following paper we describe the design and recording of such a corpus and we provide some illustrative examples of how such a corpus might be exploited in the study of dynamic interaction. The D64 corpus is a multimodal corpus recorded over two successive days. Each day resulted in approximately 4 h of recordings. In total five participants took part in the recordings of whom two participants were female and three were male. Seven video cameras were used of which at least one was trained on each participant. The Optitrack motion capture kit was used in order to enrich information. The D64 corpus comprises annotations on conversational involvement, speech activity and pauses as well as information of the average degree of change in the movement of participants.", "paper_title": "D64: a corpus of richly recorded conversational interaction", "paper_id": "WOS:000316062300003"}