{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "long-range_cis-regulatory_regions"}, {"score": 0.009773160572164059, "phrase": "functional_interaction"}, {"score": 0.004448705308279165, "phrase": "transcription_initiation"}, {"score": 0.003586278948128509, "phrase": "proper_characterization"}, {"score": 0.00355485940716082, "phrase": "functional_interactions"}, {"score": 0.0033572130837348623, "phrase": "novel_method"}, {"score": 0.00304737045343781, "phrase": "genome_rearrangements"}, {"score": 0.002941913249957503, "phrase": "cis-regulatory_region"}, {"score": 0.002434396049547248, "phrase": "genome-wide_map"}, {"score": 0.0023294867572824147, "phrase": "candidate_regions"}, {"score": 0.002288797099841088, "phrase": "vivo_experimental_characterization"}, {"score": 0.002258745901862197, "phrase": "better_characterization"}, {"score": 0.002238930800075706, "phrase": "regulatory_regions"}, {"score": 0.0022095328812245852, "phrase": "position_effect_diseases"}, {"score": 0.0021709339252206825, "phrase": "improved_understanding"}, {"score": 0.0021049977753042253, "phrase": "long-range_regulation"}], "paper_keywords": ["evolution", " genomic rearrangements", " genomics", " multiple alignment", " phylogenetic analyses", " regulatory regions"], "paper_abstract": "In chordates, long-range cis-regulatory regions are involved in the control of transcription initiation (either as repressors or enhancers). Their main characteristics are that (i) they can be located as far as 1 Mb away from the transcription start site of the target gene, (ii) they can regulate more than one gene, and (iii) they are usually orientation-independent. Therefore, proper characterization of functional interactions between long-range cis-regulatory regions and their target genes remains problematic. We present a novel method to predict such interactions based on the analysis of rearrangements between the human and 16 other vertebrate genomes. Our method is based on the assumption that genome rearrangements that would disrupt the functional interaction between a cis-regulatory region and its target gene are likely to be deleterious. Therefore, conservation of synteny through evolution would be an indication of a functional interaction. We use our algorithm to predict the association between a set of 123,905 human candidate regulatory regions to their target gene(s). This genome-wide map of interactions has many potential applications, including the selection of candidate regions prior to in vivo experimental characterization, a better characterization of regulatory regions involved in position effect diseases, and an improved understanding of the mechanisms and importance of long-range regulation. Supplementary Material is available online at www.liebertonline.com/cmb.", "paper_title": "Mapping Association between Long-Range cis-Regulatory Regions and Their Target Genes Using Synteny", "paper_id": "WOS:000294813000008"}