{"auto_keywords": [{"score": 0.02986011396177124, "phrase": "mutual_information"}, {"score": 0.029499848741529312, "phrase": "ssi"}, {"score": 0.028443637140616027, "phrase": "fisher_information"}, {"score": 0.00481495049065317, "phrase": "shannon_information"}, {"score": 0.00477513738640734, "phrase": "finite_neural_populations"}, {"score": 0.004657653216262924, "phrase": "neural_code"}, {"score": 0.004524220016675624, "phrase": "statistical_measures"}, {"score": 0.004269097660688745, "phrase": "fisher"}, {"score": 0.004198323646273642, "phrase": "large_populations"}, {"score": 0.004146327465630697, "phrase": "statistical_tools"}, {"score": 0.003928321515373316, "phrase": "experimental_research_groups"}, {"score": 0.003847546889061499, "phrase": "empirical_data"}, {"score": 0.003721735062704032, "phrase": "fisher-based_measures"}, {"score": 0.003645192746918234, "phrase": "infinite_populations"}, {"score": 0.003482276061796395, "phrase": "finite-size_populations"}, {"score": 0.0029857124153761187, "phrase": "chosen_measure"}, {"score": 0.0029121251930855664, "phrase": "monte_carlo"}, {"score": 0.0028521858876446654, "phrase": "stimulus-specific_decomposition"}, {"score": 0.002424984362388813, "phrase": "biologically_realistic_variability"}, {"score": 0.002404885278896803, "phrase": "noise_correlations"}, {"score": 0.0021492686054379755, "phrase": "neuron's_tuning_curve"}], "paper_keywords": [""], "paper_abstract": "The precision of the neural code is commonly investigated using two families of statistical measures: Shannon mutual information and derived quantities when investigating very small populations of neurons and Fisher information when studying large populations. These statistical tools are no longer the preserve of theorists and are being applied by experimental research groups in the analysis of empirical data. Although the relationship between information-theoretic and Fisher-based measures in the limit of infinite populations is relatively well understood, how these measures compare in finite-size populations has not yet been systematically explored. We aim to close this gap. We are particularly interested in understanding which stimuli are best encoded by a given neuron within a population and how this depends on the chosen measure. We use a novel Monte Carlo approach to compute a stimulus-specific decomposition of the mutual information (the SSI) for populations of up to 256 neurons and show that Fisher information can be used to accurately estimate both mutual information and SSI for populations of the order of 100 neurons, even in the presence of biologically realistic variability, noise correlations, and experimentally relevant integration times. According to both measures, the stimuli that are best encoded are those falling at the flanks of the neuron's tuning curve. In populations of fewer than around 50 neurons, however, Fisher information can be misleading.", "paper_title": "Fisher and Shannon Information in Finite Neural Populations", "paper_id": "WOS:000304677500005"}