{"auto_keywords": [{"score": 0.044308460471387805, "phrase": "similar_affinity"}, {"score": 0.03316040453697972, "phrase": "binding_interactions"}, {"score": 0.004815069196485055, "phrase": "ligand"}, {"score": 0.004721162131188487, "phrase": "molecular_modeling"}, {"score": 0.004676705290839187, "phrase": "synthesis"}, {"score": 0.003896871009090446, "phrase": "experimental_results"}, {"score": 0.003820896867623235, "phrase": "molecular_modeling_study"}, {"score": 0.0037463983616303786, "phrase": "structurally_related_compounds"}, {"score": 0.0036733470451885465, "phrase": "molecular_dynamics_simulations"}, {"score": 0.0031845067058084613, "phrase": "clear_picture"}, {"score": 0.0030464123943266673, "phrase": "structural_and_energetic_view_points"}, {"score": 0.002943147037670826, "phrase": "binding_pocket"}, {"score": 0.002706659627293686, "phrase": "detailed_electronic_analysis"}, {"score": 0.002655978030711987, "phrase": "molecules"}, {"score": 0.002576503437739865, "phrase": "molecular_aspects"}, {"score": 0.0023928819778638055, "phrase": "good_correlation"}, {"score": 0.002357755095722877, "phrase": "relative_binding_energies"}, {"score": 0.002323142666222693, "phrase": "theoretical_calculations"}, {"score": 0.002146926767291475, "phrase": "significant_affinity"}], "paper_keywords": ["3-Chlorotyramine", " MD simulations", " QTAIM analysis", " D-2 dopamine receptor"], "paper_abstract": "We synthesized and tested 3-chlorotyramine as a ligand of the D2 dopamine receptor. This compound displayed a similar affinity by this receptor to that previously reported for dopamine. In order to understand further the experimental results we performed a molecular modeling study of 3-chlorotyramine and structurally related compounds. By combining molecular dynamics simulations with semiempirical (PM6), ab initio and density functional theory calculations, a simple and generally applicable procedure to evaluate the binding energies of these ligands interacting with the D-2 dopamine receptors is reported here. These results provided a clear picture of the binding interactions of these compounds from both structural and energetic view points. A reduced model for the binding pocket was used. This approach allowed us to perform more accurate quantum mechanical calculations as well as to obtain a detailed electronic analysis using the Quantum Theory of Atoms in Molecules (QTAIM) technique. Molecular aspects of the binding interactions between ligands and the D-2 dopamine receptor are discussed in detail. A good correlation between the relative binding energies obtained from theoretical calculations and experimental IC50 values was obtained. These results allowed us to predict that 3-chlorotyramine possesses a significant affinity by the D-2-DR. Our theoretical predictions were experimentally corroborated when we synthesized and tested 3-chlorotyramine which displayed a similar affinity by the D-2-DR to that reported for DA.", "paper_title": "3-Chlorotyramine Acting as Ligand of the D-2 Dopamine Receptor. Molecular Modeling, Synthesis and D-2 Receptor Affinity", "paper_id": "WOS:000347839900004"}