{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "global_warming"}, {"score": 0.03182320197985332, "phrase": "wildpedia"}, {"score": 0.029808225765253462, "phrase": "surrounding_text"}, {"score": 0.02431777675002257, "phrase": "enishi"}, {"score": 0.00475070135279933, "phrase": "agriculture_influence"}, {"score": 0.003935892934907777, "phrase": "strong_demands"}, {"score": 0.0036066248258559033, "phrase": "wikipedia"}, {"score": 0.002907992115184249, "phrase": "new_method"}, {"score": 0.002628747284714371, "phrase": "experimental_results"}, {"score": 0.0023287359930308864, "phrase": "relationship_search_system"}, {"score": 0.002206606452557159, "phrase": "proposed_new_method"}, {"score": 0.0021049977753042253, "phrase": "diverse_knowledge"}], "paper_keywords": ["knowledge retrieval", " Wikipedia mining", " content-based image retrieval", " relationships between objects"], "paper_abstract": "How do global warming and agriculture influence each other? It is possible to answer the question by searching knowledge about the relationship between global warming and agriculture. As exemplified by this question, strong demands exist for searching relationships between objects. Mining knowledge about relationships on Wikipedia has been studied. However, it is desired to search more diverse knowledge about relationships on the Web. By utilizing the objects constituting relationships mined from Wildpedia, we propose a new method to search images with surrounding text that include knowledge about relationships on the Web. Experimental results show that our method is effective and applicable in searching knowledge about relationships. We also construct a relationship search system named \"Enishi\" based on the proposed new method. Enishi supplies a wealth of diverse knowledge including images with surrounding text to help users to understand relationships deeply, by complementarily utilizing knowledge from Wildpedia and the Web.", "paper_title": "Mining Knowledge on Relationships between Objects from the Web", "paper_id": "WOS:000330553700008"}