{"auto_keywords": [{"score": 0.04863439404498002, "phrase": "genetic_algorithms"}, {"score": 0.030182252637371537, "phrase": "pso"}, {"score": 0.00481495049065317, "phrase": "portfolio_management_using_value"}, {"score": 0.004297560964892607, "phrase": "particle_swarm_optimization"}, {"score": 0.004223032986655664, "phrase": "portfolio_management"}, {"score": 0.004149792080414689, "phrase": "constrained_portfolio_optimization_problem"}, {"score": 0.004095692768056685, "phrase": "short_sales"}, {"score": 0.004007083686875716, "phrase": "objective_function"}, {"score": 0.003818807671883534, "phrase": "historical_simulation"}, {"score": 0.0033197446406648626, "phrase": "good_solutions"}, {"score": 0.003247868216333148, "phrase": "best_solution"}, {"score": 0.003191485583025302, "phrase": "reasonable_amount"}, {"score": 0.0027623788003216317, "phrase": "ga"}, {"score": 0.0026091594819333654, "phrase": "total_running_time"}, {"score": 0.002464709648714996, "phrase": "initial_position"}, {"score": 0.0021049977753042253, "phrase": "wiley_periodicals"}], "paper_keywords": [""], "paper_abstract": "In this paper, it is shown a comparison of the application of particle swarm optimization and genetic algorithms to portfolio management, in a constrained portfolio optimization problem where no short sales are allowed. The objective function to be minimized is the value at risk calculated using historical simulation where several strategies for handling the constraints of the problem were implemented. The results of the experiments performed show that, generally speaking, the methods are capable of consistently finding good solutions quite close to the best solution found in a reasonable amount of time. In addition, it is demonstrated statistically that the algorithms, on average, do not all consistently achieve the same best solution. PSO turned out to be faster than GA, both in terms of number of iterations and in terms of total running time. However, PSO appears to be much more sensitive to the initial position of the particles than GA. Tests were also made regarding the number of particles needed to solve the problem, and 50 particles/chromosomes seem to be enough for problems up to 20 assets. (C) 2009 Wiley Periodicals, Inc.", "paper_title": "Portfolio Management Using Value at Risk: A Comparison between Genetic Algorithms and Particle Swarm Optimization", "paper_id": "WOS:000266796000004"}