{"auto_keywords": [{"score": 0.04933474398779934, "phrase": "drug-intolerance_issues"}, {"score": 0.04681506931074826, "phrase": "spl"}, {"score": 0.00481495049065317, "phrase": "structured_product_labeling"}, {"score": 0.0041653916552844535, "phrase": "computerized_provider_order_entry"}, {"score": 0.004021065055449586, "phrase": "drug-intolerance_issue_detection_system"}, {"score": 0.0038363485899400285, "phrase": "existing_spl_label_content"}, {"score": 0.0037915057447460133, "phrase": "knowledge_sources"}, {"score": 0.00371792732770152, "phrase": "ndf"}, {"score": 0.003561017335579207, "phrase": "large_set"}, {"score": 0.0034510635632071978, "phrase": "drug_orders"}, {"score": 0.0034107088717109857, "phrase": "medication_dispensing_records"}, {"score": 0.003020279889535487, "phrase": "distinct_drugs"}, {"score": 0.0029616217177058602, "phrase": "distinct_intolerances"}, {"score": 0.0026535183547537655, "phrase": "new_approach"}, {"score": 0.002531463482341473, "phrase": "spl-based_approach"}, {"score": 0.002453221048083196, "phrase": "local_dictionaries"}, {"score": 0.002331189621118592, "phrase": "spl_content"}, {"score": 0.002250272652754455, "phrase": "specificity_problems"}, {"score": 0.0021049977753042253, "phrase": "drug_intolerances"}], "paper_keywords": [""], "paper_abstract": "Objectives: This study sought to assess the value of the Health Level 7/U.S. Food and Drug Administration Structured Product Labeling (SPL) drug knowledge representation standard and its associated terminology sources for drug-intolerance (allergy) decision support in computerized provider order entry (CPOE) systems. Design: The Regenstrief Institute CPOE drug-intolerance issue detection system and its knowledge base was compared with a method based on existing SPL label content enriched with knowledge sources used with SPL (NDF-RT/MeSH). Both methods were applied to a large set of drug-intolerance (allergy) records, drug orders, and medication dispensing records covering >50,000 patients over 30 years. Measurements: The number of drug-intolerance issues detected by both methods was counted, as well as the number of patients with issues, number of distinct drugs, and number of distinct intolerances. The difference between drug-intolerance issues detected or missed by either method was qualitatively analyzed. Results: Although <70% of terms were mapped to SPL, the new approach detected four times as many drug-intolerance issues on twice as many patients. Conclusion: The SPL-based approach is more sensitive and suggests that mapping local dictionaries to SPL, and enhancing the depth and breadth of coverage of SPL content are worth accelerating. The study also highlights specificity problems known to trouble drug-intolerance decision support and suggests how terminology and methods of recording drug intolerances could be improved.", "paper_title": "Structured Product Labeling Improves Detection of Drug-intolerance Issues", "paper_id": "WOS:000264499500010"}