{"auto_keywords": [{"score": 0.04885877600670675, "phrase": "internet_environment"}, {"score": 0.010612387000973441, "phrase": "moral_judgment"}, {"score": 0.008736427325688488, "phrase": "moral_dilemmas"}, {"score": 0.004744437370338926, "phrase": "israeli_adolescents"}, {"score": 0.004539005582217309, "phrase": "adolescents'_behavioral_characteristics"}, {"score": 0.004216112320418982, "phrase": "six_different_schools"}, {"score": 0.004048378919038729, "phrase": "personal_data"}, {"score": 0.003989046949801574, "phrase": "internet_interaction_patterns"}, {"score": 0.003930581102447622, "phrase": "daily_life"}, {"score": 0.003844478919573134, "phrase": "virtual_environment"}, {"score": 0.003705130724701598, "phrase": "age_usage"}, {"score": 0.0035184576341236317, "phrase": "internet_use"}, {"score": 0.003292156638306418, "phrase": "internet_cafes"}, {"score": 0.003035177667751495, "phrase": "internet_games"}, {"score": 0.0029796206196589115, "phrase": "gender_differences"}, {"score": 0.002935905915691203, "phrase": "immoral_behavior"}, {"score": 0.002495268931035983, "phrase": "relatively_little_\"humane_judgment"}, {"score": 0.002404706573379854, "phrase": "\"humane_judgment"}, {"score": 0.002258212866482022, "phrase": "judgment\"_evaluations"}, {"score": 0.0021522261505574035, "phrase": "normative_judgment"}, {"score": 0.0021049977753042253, "phrase": "peer-group_conventions"}], "paper_keywords": [""], "paper_abstract": "This study explored differences between genders regarding adolescents' behavioral characteristics and moral judgment in the Internet environment. A questionnaire was administered to 1,048 students in the 7th to 11th grades in six different schools, one class in each grade. The questionnaire included personal data, characteristics of Internet interaction patterns, moral dilemmas in daily life, and moral dilemmas in the virtual environment. No significant differences were found between the genders regarding the age usage of the Internet began, Internet experience, and average daily hours of Internet use. We found that boys prefer, more than girls, to surf at school and in Internet cafes. Girls tend to use the Internet more for doing homework and blogs than boys, whereas boys tend to play Internet games more than girls. Gender differences were found regarding immoral behavior. Boys were involved more frequently than girls in behaviors such as cyberbullying, plagiarism, impersonation, and downloading music and movies illegally from the Internet. A correlation was found between gender and moral judgment. Although both boys and girls made relatively little \"humane judgment\" in the Internet environment, girls tended to make \"humane judgment\" more frequently than boys. In the Internet environment, boys tended to make \"absence of judgment\" evaluations more than girls. Girls tended, relatively more, toward \"normative judgment\" that reflects adherence to peer-group conventions with minimal reflexivity.", "paper_title": "Gender Differences in the Moral Judgment and Behavior of Israeli Adolescents in the Internet Environment", "paper_id": "WOS:000335582300009"}