{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "pressure_fluctuation"}, {"score": 0.019673421855496188, "phrase": "prototype_kaplan_turbine"}, {"score": 0.01947262347831628, "phrase": "model_turbine"}, {"score": 0.011394097603643424, "phrase": "draft_tube"}, {"score": 0.009689568907691392, "phrase": "prototype_turbine"}, {"score": 0.005214181263882697, "phrase": "low_frequency"}, {"score": 0.004602537373658625, "phrase": "reynolds"}, {"score": 0.004570634647887452, "phrase": "navier-stokes_equations"}, {"score": 0.004507594400447103, "phrase": "rng_k-epsilon_turbulence_model"}, {"score": 0.004414653335578912, "phrase": "unsteady_turbulent_flow"}, {"score": 0.00436890075128947, "phrase": "whole_flow_passage"}, {"score": 0.0037889466472096284, "phrase": "main_pressure_fluctuation"}, {"score": 0.003054367741379269, "phrase": "reynolds_number"}, {"score": 0.0029193609786176632, "phrase": "simulation_results"}, {"score": 0.0026762323224804197, "phrase": "relative_pressure_fluctuation"}, {"score": 0.0025578967205807843, "phrase": "frequency_domain"}, {"score": 0.0025137856138000014, "phrase": "pressure_fluctuation_frequency"}, {"score": 0.002336655334451466, "phrase": "resonance_nature"}, {"score": 0.002312388685547026, "phrase": "water_body_system"}, {"score": 0.0022101055924375725, "phrase": "on-cam_and_non_on-cam_operation_conditions"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Prototype Kaplan turbine", " Similarity", " Pressure fluctuation", " Frequency", " Unsteady flow simulation"], "paper_abstract": "In this paper, the Reynolds averaged Navier-Stokes equations coupled with the RNG k-epsilon turbulence model are employed to simulate the unsteady turbulent flow throughout the whole flow passage of a prototype Kaplan turbine. The behavior of the pressure fluctuation in the prototype Kaplan turbine, which includes the amplitude and frequency, is predicted and analyzed at several survey points in the turbine. Then, the mechanisms of generation and transmission of the main pressure fluctuation in the prototype turbine are discussed. After that, the frequency and amplitude of pressure fluctuation in the prototype turbine are compared with those of the model turbine. It is found that there is a similarity of pressure fluctuation between the prototype Kaplan turbine and the model turbine except at low frequency. At low frequency, the similarity of the pressure fluctuation fails due to the difference of the Reynolds number between the prototype turbine and the model turbine. It is observed from the simulation results that the pressure difference between the maximum and the minimum of pressure on each section of the draft tube can be utilized to estimate the relative pressure fluctuation in the draft tube for both the model and prototype turbines. It is also found in the frequency domain that there is a pressure fluctuation frequency at which the pressure suddenly rises in the draft tube. It is possible that this phenomenon is induced by the resonance nature of the water body system in the draft tube. At last, the comparison of pressure fluctuation at on-cam and non on-cam operation conditions of the prototype turbine is also carried out. (C) 2011 Elsevier Ltd. All rights reserved.", "paper_title": "Numerical prediction and similarity study of pressure fluctuation in a prototype Kaplan turbine and the model turbine", "paper_id": "WOS:000301617400011"}