{"auto_keywords": [{"score": 0.032573902925676836, "phrase": "switched_topology"}, {"score": 0.011558232289992053, "phrase": "first-order_kinematics"}, {"score": 0.010973132480055955, "phrase": "obstacle_information"}, {"score": 0.009258587037290012, "phrase": "finite_time"}, {"score": 0.00481495049065317, "phrase": "reduced_interaction"}, {"score": 0.004666228956744244, "phrase": "coordinated_obstacle_avoidance_algorithm"}, {"score": 0.004633805690244912, "phrase": "multi-agent_systems"}, {"score": 0.004537875262684779, "phrase": "obstacle_dynamic_information"}, {"score": 0.004443921948822114, "phrase": "local_interaction"}, {"score": 0.004351905364003354, "phrase": "partial_measuring_states_information"}, {"score": 0.0042617859335771615, "phrase": "coordinated_obstacle_avoidance"}, {"score": 0.0037456980766939836, "phrase": "initial_relative_position"}, {"score": 0.0035920758080335655, "phrase": "collective_obstacle_avoidance_algorithms"}, {"score": 0.003480993634130542, "phrase": "second-order_dynamics"}, {"score": 0.0032462487283717546, "phrase": "collective_obstacle_avoidance_algorithm"}, {"score": 0.0027838831266525773, "phrase": "agents'_topology_graph"}, {"score": 0.0025779504911297236, "phrase": "second-order_kinematics"}, {"score": 0.0024721021985994115, "phrase": "varying_velocity"}, {"score": 0.0024548872075607687, "phrase": "constant_velocity"}, {"score": 0.0021496083700137305, "phrase": "proposed_algorithms"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Obstacle avoidance", " Consensus", " Reduced interaction", " Circular motion", " Multi-agents"], "paper_abstract": "In this paper, we study the coordinated obstacle avoidance algorithm of multi-agent systems when only a subset of agents has obstacle dynamic information, or every agent has local interaction. Each agent can get partial measuring states information from its neighboring agent and obstacle. Coordinated obstacle avoidance here represents not only the agents moving without collision with an obstacle, but also the agents bypassing and assembling at the opposite side of the obstacle collectively, where the opposite side is defined according to the initial relative position of the agents to the obstacle. We focus on the collective obstacle avoidance algorithms for both agents with first-order kinematics and agents with second-order dynamics. In the situation where only a fixed fraction of agents can sense obstacle information for agents with first-order kinematics, we propose a collective obstacle avoidance algorithm without velocity measurements. And then we extend the algorithm to the case in switched topology. We show that all agents can bypass an obstacle and converge together, and then assemble at the opposite side of the obstacle in finite time, if the agents' topology graph is connected and at least one agent can sense the obstacle. In the case where obstacle information is available to only a fixed fraction of agents with second-order kinematics, we propose two collective obstacle avoidance algorithms without measuring acceleration when the obstacle has varying velocity and constant velocity. The switched topology is considered and extended next. We show that agents can bypass the obstacle with their positions and velocities approaching consensus in finite time if the connectivity of switched topology is continuously maintained. Several simulation examples demonstrate the proposed algorithms. (C) 2014 Elsevier B.V. All rights reserved.", "paper_title": "Coordinated obstacle avoidance with reduced interaction", "paper_id": "WOS:000337661800023"}