{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "perceptual_and_behavioral_learning"}, {"score": 0.004749824776508639, "phrase": "correlative_subspace_learning_rule"}, {"score": 0.004477595431209663, "phrase": "twofold_task"}, {"score": 0.004278807087784626, "phrase": "adequate_actions"}, {"score": 0.003907212558276185, "phrase": "adequate_action"}, {"score": 0.00334780964309978, "phrase": "theoretical_work"}, {"score": 0.0030707512751243214, "phrase": "subspace_learning_algorithm"}, {"score": 0.003015401937358271, "phrase": "formal_analysis"}, {"score": 0.00297454367746853, "phrase": "numerical_simulations"}, {"score": 0.0029076695661972114, "phrase": "proposed_subspace_learning_algorithm"}, {"score": 0.0027407299369891502, "phrase": "perceptual_learning"}, {"score": 0.0027035833504191233, "phrase": "behavioral_learning"}, {"score": 0.0025833500717948343, "phrase": "open_area_foraging_task"}, {"score": 0.002305589818994465, "phrase": "fundamental_argument"}, {"score": 0.0021632743048552536, "phrase": "biological_systems"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Perceptual and behavioral learning", " Correlative learning", " Distributed adaptive control", " Robot", " Model", " Classical conditioning"], "paper_abstract": "For an animal to survive it has to excel in a twofold task: It has to perceive the world and execute adequate actions. These skills are acquired and adapted through perceptual and behavioral learning, respectively. Perceptual and behavioral learning are tightly interwoven, choosing the adequate action is only possible in the presence off accurate perceptions. Learning to perceive accurately does, however, happen while acting in the world. The nature of this interaction is not well understood as theoretical work does mostly investigate the two forms of learning separately. To overcome this limitation we combine perceptual and behavioral learning in a subspace learning algorithm. In a formal analysis and in numerical simulations we show that the proposed subspace learning algorithm allows us to integrate both learning systems and to smoothly change form perceptual learning only to behavioral learning only. Further we show that in a robot open area foraging task an active adaptation of the balance between perceptual and behavioral learning is necessary in order to stabilize the performance of the robot. This alludes to a fundamental argument for the necessity of a task dependent modulation of perceptual and behavioral learning as found in biological systems. (C) 2010 Elsevier B.V. All rights reserved.", "paper_title": "Unifying perceptual and behavioral learning with a correlative subspace learning rule", "paper_id": "WOS:000279134100032"}