{"auto_keywords": [{"score": 0.012530702296602305, "phrase": "bayesian_networks"}, {"score": 0.00481495049065317, "phrase": "weighted_model"}, {"score": 0.0047881480263782675, "phrase": "counting_approaches"}, {"score": 0.004734987730139094, "phrase": "probabilistic_inference"}, {"score": 0.004682414867878963, "phrase": "previous_studies"}, {"score": 0.004528156929805637, "phrase": "bayesian_network"}, {"score": 0.00445293569103488, "phrase": "sat_formula"}, {"score": 0.004354572391793908, "phrase": "weighted_model_counting"}, {"score": 0.00428222231579898, "phrase": "backtracking_search_algorithm"}, {"score": 0.004187614134377688, "phrase": "effective_method"}, {"score": 0.004141093507753515, "phrase": "exact_inference"}, {"score": 0.0037869901077566526, "phrase": "noisy-or_and_noisy-max_relations"}, {"score": 0.0028635111041882956, "phrase": "space_efficiency"}, {"score": 0.0023151088048303705, "phrase": "best_previous_approaches"}, {"score": 0.0022013916728990564, "phrase": "larger_networks"}, {"score": 0.0021049977753042253, "phrase": "weighted_model_counting_approach"}], "paper_keywords": [""], "paper_abstract": "Previous studies have demonstrated that encoding a Bayesian network into a SAT formula and then performing weighted model counting using a backtracking search algorithm can be an effective method for exact inference. In this paper, we present techniques for improving this approach for Bayesian networks with noisy-OR and noisy-MAX relations-two relations that are widely used in practice as they can dramatically reduce the number of probabilities one needs to specify. In particular, we present two SAT encodings for noisy-OR and two encodings for noisy-MAX that exploit the structure or semantics of the relations to improve both time and space efficiency, and we prove the correctness of the encodings. We experimentally evaluated our techniques on large-scale real and randomly generated Bayesian networks. On these benchmarks, our techniques gave speedups of up to two orders of magnitude over the best previous approaches for networks with noisy-OR/MAX relations and scaled up to larger networks. As well, our techniques extend the weighted model counting approach for exact inference to networks that were previously intractable for the approach.", "paper_title": "Exploiting Structure in Weighted Model Counting Approaches to Probabilistic Inference", "paper_id": "WOS:000289666300001"}