{"auto_keywords": [{"score": 0.03666655951729527, "phrase": "system_lifetime"}, {"score": 0.0048150023351840356, "phrase": "manets"}, {"score": 0.004740009255053372, "phrase": "mobile_ad_hoc_networks"}, {"score": 0.003946960862020283, "phrase": "neighboring_nodes"}, {"score": 0.0037261429556468217, "phrase": "dense_networks"}, {"score": 0.003629882559085245, "phrase": "good_energy-efficient_relay_scheme"}, {"score": 0.003118486096035156, "phrase": "higher_performance"}, {"score": 0.0028828348726682965, "phrase": "energy-based_heuristic_method"}, {"score": 0.002808298910480358, "phrase": "appropriate_rebroadcast_probability"}, {"score": 0.0025555322596460036, "phrase": "self-contained_local_operation"}, {"score": 0.0023254633298356894, "phrase": "rebroadcast_probability"}, {"score": 0.002289180040240783, "phrase": "node_mobility"}, {"score": 0.002253461585851626, "phrase": "simulation_results"}, {"score": 0.002183684303511462, "phrase": "related_scheme"}, {"score": 0.002127186380459509, "phrase": "broadcast_messages"}, {"score": 0.0021049977753042253, "phrase": "broadcast_reachability"}], "paper_keywords": [""], "paper_abstract": "In Mobile Ad Hoc Networks (MANETs), broadcasting is widely used to support many applications. Several adaptive broadcast schemes have been proposed to reduce the number of rebroadcasting, and can consequently reduce the chance of contention and collision among neighboring nodes. In practice, broadcasting is power intensive especially in dense networks. Thus, a good energy-efficient relay scheme should be able to further maximize the system lifetime without sacrificing the reachability of broadcasting. In this paper, we propose two Scalable Energy Efficient Relay (SEER) schemes that use probabilistic approaches to achieve higher performance and to prolong the system lifetime. In the schemes, each node uses some energy-based heuristic method to independently determine an appropriate rebroadcast probability. Nodes with more residual energy are responsible for forwarding more broadcast messages. One important feature is that such heuristic knowledge is obtained by self-contained local operation. To further improve the effectiveness of broadcasting, we also study how to dynamically adjust the rebroadcast probability according to node mobility. The simulation results show that our proposed approach outperforms the related scheme when the number of broadcast messages, broadcast reachability, and system lifetime are taken into consideration altogether.", "paper_title": "SEER: Scalable energy efficient relay schemes in MANETs", "paper_id": "WOS:000241469500083"}