{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "temporal_constraints"}, {"score": 0.015569319767201488, "phrase": "temporal_abstraction"}, {"score": 0.004631335513513859, "phrase": "high_level_descriptions"}, {"score": 0.003964007795174772, "phrase": "high_level_representation"}, {"score": 0.0038876302202924644, "phrase": "temporal_data"}, {"score": 0.0035965032173588753, "phrase": "generic_knowledge"}, {"score": 0.0031383410838018953, "phrase": "liable_model"}, {"score": 0.0030778231027679464, "phrase": "temporal_imprecision"}, {"score": 0.003048001809453513, "phrase": "missing_data"}, {"score": 0.002751751956416832, "phrase": "subjective_observations"}, {"score": 0.0023431692392929353, "phrase": "first_place"}, {"score": 0.002286781334850213, "phrase": "fuzzy_temporal_constraint_network"}, {"score": 0.002220900173110114, "phrase": "temporal_information"}, {"score": 0.0021049977753042253, "phrase": "state_representation"}], "paper_keywords": ["Temporal abstraction", " Temporal reasoning", " CSP", " Fuzzy temporal constraint network"], "paper_abstract": "The need to provide high level descriptions of the evolution of data is evident in fields like medicine. For being able to perform task such as diagnostic or monitoring, it is very important to facilitate a high level representation and management of temporal data. With this representation two main benefits are obtained: it becomes easier to compare data with generic knowledge, and the volume of data can be reduced. Several models have been proposed for time representation and management. Temporal constraints have been extensively used as a liable model in problems where temporal imprecision or missing data exist. The imprecision is usually present when data are manually collected, or when the data are based on subjective observations. The aim of this paper is to demonstrate how temporal constraints can be used as a formalism in which temporal abstraction of concepts can be performed. To this end, in the first place, we introduce the fuzzy temporal constraint network as the formalism for representing temporal information. Then, we present an algorithm for obtaining a state representation from a sequence of observations. We show the complexity and applicability of the approach.", "paper_title": "Using temporal constraints for temporal abstraction", "paper_id": "WOS:000273788300003"}