{"auto_keywords": [{"score": 0.03158987378303451, "phrase": "second_group"}, {"score": 0.016017939826855062, "phrase": "secrecy_capacity_region"}, {"score": 0.00881238250747048, "phrase": "first_scenario"}, {"score": 0.008563719069034558, "phrase": "confidential_message"}, {"score": 0.008322013380255545, "phrase": "different_confidential_message"}, {"score": 0.007211327394819845, "phrase": "discrete_memoryless_channel_model"}, {"score": 0.007134219906920833, "phrase": "parallel_channel_model"}, {"score": 0.00481495049065317, "phrase": "degraded_compound"}, {"score": 0.004645057834614705, "phrase": "dcmrwc"}, {"score": 0.004354149483556514, "phrase": "arbitrary_user"}, {"score": 0.004230749292148046, "phrase": "arbitrary_eavesdropper"}, {"score": 0.0031845067058084583, "phrase": "gaussian_parallel_channel_model"}, {"score": 0.002942138511829811, "phrase": "second_scenario"}, {"score": 0.0028076592725295646, "phrase": "first_group"}, {"score": 0.0021592774565041824, "phrase": "gaussian"}, {"score": 0.0021049977753042253, "phrase": "channel_model"}], "paper_keywords": ["Compound wiretap channels", " Gaussian multiple-input multiple-output (MIMO) compound wiretap channels", " secrecy capacity region"], "paper_abstract": "We study the degraded compound multi-receiver wiretap channel (DCMRWC). DCMRWC consists of two groups of users and a group of eavesdroppers, where, if we pick an arbitrary user from each group of users and an arbitrary eavesdropper, they satisfy a certain Markov chain. We study two different communication scenarios for this channel. In the first scenario, the transmitter wants to send a confidential message to users in the first (stronger) group and a different confidential message to users in the second (weaker) group, where both messages need to be kept confidential from the eavesdroppers. For this scenario, we assume that there is only one eavesdropper. We obtain the secrecy capacity region for the discrete memoryless channel model, the parallel channel model, and the Gaussian parallel channel model. For the Gaussian multiple-input multiple-output (MIMO) channel model, we obtain the secrecy capacity region when there is only one user in the second group. In the second scenario we study, the transmitter sends a confidential message to users in the first group which needs to be kept confidential from the second group of users and the eavesdroppers. Moreover, the transmitter sends a different confidential message to users in the second group which needs to be kept confidential only from the eavesdroppers. For this scenario, we do not put any restriction on the number of eavesdroppers. As in the first scenario, we obtain the secrecy capacity region for the discrete memoryless channel model, the parallel channel model, and the Gaussian parallel channel model. For the Gaussian MIMO channel model, we establish the secrecy capacity region when there is only one user in the second group.", "paper_title": "Degraded Compound Multi-Receiver Wiretap Channels", "paper_id": "WOS:000307892800004"}