{"auto_keywords": [{"score": 0.04942981937458461, "phrase": "wireless_sensor_networks"}, {"score": 0.044374218223558116, "phrase": "collaborative_false_data_injection_attacks"}, {"score": 0.038650435991271374, "phrase": "data_report"}, {"score": 0.029257520104779673, "phrase": "absolute_positions"}, {"score": 0.00481495049065317, "phrase": "collaborative_false_data"}, {"score": 0.004717325943509345, "phrase": "false_data_filtering"}, {"score": 0.004669254965563445, "phrase": "important_issue"}, {"score": 0.004497129150551236, "phrase": "new_type"}, {"score": 0.004466519142879166, "phrase": "false_data_injection_attacks"}, {"score": 0.004129067429043414, "phrase": "fake_report"}, {"score": 0.00388278852285898, "phrase": "existing_approaches"}, {"score": 0.0037910145286595386, "phrase": "fixed_number"}, {"score": 0.0037651925588909783, "phrase": "message_authentication_codes"}, {"score": 0.0035648266669315943, "phrase": "different_geographical_areas"}, {"score": 0.003386645324034521, "phrase": "sensor_nodes"}, {"score": 0.002567180189640976, "phrase": "relative_positions"}, {"score": 0.002447101794397243, "phrase": "filtering_probability"}, {"score": 0.0023728841359713106, "phrase": "extensive_simulations"}, {"score": 0.0023566987138026285, "phrase": "simulation_results"}, {"score": 0.002300912218086077, "phrase": "totally_ten_nodes"}, {"score": 0.002246443296542436, "phrase": "detection_probability"}, {"score": 0.0021857670748012476, "phrase": "gffs"}, {"score": 0.002170854875902186, "phrase": "nffs"}, {"score": 0.002126725585391261, "phrase": "traditional_false_data_filtering_approaches"}], "paper_keywords": ["Wireless sensor network", " Compromised node", " False data injection", " Location information", " Relative position"], "paper_abstract": "False data filtering is an important issue in wireless sensor networks. In this paper, we consider a new type of false data injection attacks called collaborative false data injection, and propose two schemes to defend such attacks. In collaborative false data injection attacks, multiple compromised nodes collaboratively forge a fake report and inject the report into the network. This type of attacks is hard to defend with existing approaches, because they only verify a fixed number of message authentication codes (MACs) carried in the data report but the adversary can easily obtain enough compromised nodes from different geographical areas of the network to break their security. Our novel solution is to bind the keys of sensor nodes to their geographical locations, and verify the legitimacy of a data report by checking whether the locations of the sensors endorsing the report are logical (e.g., the sensors should be close enough to each other to sense the same event). We propose two filtering schemes: The geographical information based false data filtering scheme (GFFS) which utilizes the absolute positions of sensors in the verification, and the neighbor information based false data filtering scheme (NFFS) which utilizes relative positions of sensors when absolute positions cannot be obtained. We theoretically analyze the filtering probability of the two proposed schemes, and evaluate their performance through extensive simulations. Simulation results show that, when there are totally ten nodes compromised in a 400 nodes network, the detection probability of collaborative false data injection attacks is higher than 97% in GFFS and NFFS, but is less than 7% in traditional false data filtering approaches such as SEF. (C) 2013 Elsevier Inc. All rights reserved.", "paper_title": "Defending collaborative false data injection attacks in wireless sensor networks", "paper_id": "WOS:000326210400003"}