{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "cognitive_vision_systems"}, {"score": 0.003951453722517865, "phrase": "large_number"}, {"score": 0.003406713877432236, "phrase": "cognitive_vision_functionalities"}, {"score": 0.0028076592725295646, "phrase": "service_principle"}, {"score": 0.00277001889871322, "phrase": "\"yellow_pages\"_directory"}, {"score": 0.0025892330566358503, "phrase": "hierarchy_principle_orders_components"}, {"score": 0.0025089420019955232, "phrase": "symbolic_levels"}, {"score": 0.0024641814990854463, "phrase": "system_response"}, {"score": 0.0022118619998034742, "phrase": "spatial_-temporal_object_relationships"}, {"score": 0.0021529183360603434, "phrase": "symbolic_description"}], "paper_keywords": [""], "paper_abstract": "Cognitive Vision Systems (CVS) attempt to provide solutions for tasks such as exploring the environment, making robots act autonomously or understanding actions of people. What these systems have in common is the use of a large number of models and techniques, e.g., perception-action mapping, recognition and categorisation, prediction, reaction and symbolic interpretation, and communication to humans. Within this contribution these cognitive vision functionalities of a CVS are encapsulated in components. To arrive at the level of building a system from these functionalities it is considered essential to provide a framework that coordinates the components. Two principles organise the components: (1) the service principle uses a \"yellow pages\" directory to announce its capabilities and to select other components, and (2) the hierarchy principle orders components along data abstraction from signal to symbolic levels and ascertains that system response is reactive. ActIPret shows the interpretation of a person handling tools involving functionalities such as tracking, object and gesture recognition, spatial -temporal object relationships and reasoning to extract the symbolic description. To move towards other multi-task CVS we invite researchers to exchange components and framework.", "paper_title": "A framework for cognitive vision systems or identifying obstacles to integration", "paper_id": "WOS:000239148600016"}