{"auto_keywords": [{"score": 0.03804712672731131, "phrase": "ecp"}, {"score": 0.00481495049065317, "phrase": "exclusive_closest_pairs"}, {"score": 0.004518442937844318, "phrase": "one-to-one_assignment"}, {"score": 0.0043080553835735825, "phrase": "closest_pair"}, {"score": 0.004010624853427534, "phrase": "remaining_pairs"}, {"score": 0.0036893794227117194, "phrase": "next_closest_pair"}, {"score": 0.0036456298076415652, "phrase": "real_application"}, {"score": 0.0031718628581265266, "phrase": "dynamic_version"}, {"score": 0.0029060170624404242, "phrase": "joined_data_sets"}, {"score": 0.0027815466400771768, "phrase": "extended_form"}, {"score": 0.002558495760339272, "phrase": "capacity_constraint"}, {"score": 0.002488183412451029, "phrase": "multiple_objects"}, {"score": 0.0022434880661725493, "phrase": "previous_solution"}, {"score": 0.0021992603252793995, "phrase": "experimental_results"}, {"score": 0.0021731423856364003, "phrase": "system_prototype"}, {"score": 0.0021049977753042253, "phrase": "proposed_algorithms"}], "paper_keywords": ["Query processing", " spatial databases"], "paper_abstract": "Given two data sets A and B, their exclusive closest pairs (ECP) join is a one-to-one assignment of objects from the two data sets, such that 1) the closest pair (a, b) in A x B is in the result and 2) the remaining pairs are determined by removing objects a, b from A, B, respectively, and recursively searching for the next closest pair. A real application of ECP is the computation of (car and parking slot) assignments. This paper introduces the problem and proposes several solutions that solve it in main-memory, exploiting space partitioning. In addition, we define a dynamic version of the problem, where the objective is to continuously monitor the ECP join solution, in an environment where the joined data sets change positions and content. Finally, we study an extended form of the query, where objects in one of the two joined sets (e. g., parking slots) have a capacity constraint, allowing them to match with multiple objects from the other set (e. g., cars). We show how our techniques can be extended for this variant and compare them with a previous solution to this problem. Experimental results on a system prototype demonstrate the efficiency and applicability of the proposed algorithms.", "paper_title": "Computation and Monitoring of Exclusive Closest Pairs", "paper_id": "WOS:000260057800006"}