{"auto_keywords": [{"score": 0.04672583002462709, "phrase": "force_platforms"}, {"score": 0.00481495049065317, "phrase": "insole_pressure_distribution_system"}, {"score": 0.004654826737377134, "phrase": "pressure_measurements"}, {"score": 0.004610058444728656, "phrase": "insole_pressure_systems"}, {"score": 0.004435230698216773, "phrase": "analysing_center"}, {"score": 0.003637669525737665, "phrase": "present_paper"}, {"score": 0.0035852640843794252, "phrase": "direct_method"}, {"score": 0.0034826993555190765, "phrase": "force_platform"}, {"score": 0.0034159525504642656, "phrase": "insole_pressure_system"}, {"score": 0.0030858947334838145, "phrase": "global_coordinate_system"}, {"score": 0.0028421434495262796, "phrase": "static_single_limb_stance"}, {"score": 0.002655894070657161, "phrase": "cop_trajectories"}, {"score": 0.0025673856614952854, "phrase": "similar_measurements"}, {"score": 0.0023079452119107446, "phrase": "cops"}, {"score": 0.0021670777282518424, "phrase": "proposed_method"}, {"score": 0.0021049977753042253, "phrase": "new_experiments"}], "paper_keywords": ["Center of pressure", " Foot pressure", " Gait analysis", " Pressure insoles", " 3D analysis"], "paper_abstract": "Insole pressure systems are often more appropriate than force platforms for analysing center of pressure (CoP) as they are more flexible in use and indicate the position of the CoP that characterizes the contact foot/shoe during gait with shoes. However, these systems are typically not synchronized with 3D motion analysis systems. The present paper proposes a direct method that does not require a force platform for synchronizing an insole pressure system with a 3D motion analysis system. The distance separating 24 different CoPs measured optically and their equivalents measured by the insoles and transformed in the global coordinate system did not exceed 2 mm, confirming the suitability of the method proposed. Additionally, during static single limb stance, distances smaller than 7 mm and correlations higher than 0.94 were found between CoP trajectories measured with insoles and force platforms. Similar measurements were performed during gait to illustrate the characteristics of the CoP measured with each system. The distance separating the two CoPs was below 19 mm and the coefficient of correlation above 0.86. The proposed method offers the possibility to conduct new experiments, such as the investigation of proprioception in climbing stairs or in the presence of obstacles.", "paper_title": "Spatial synchronization of an insole pressure distribution system with a 3D motion analysis system for center of pressure measurements", "paper_id": "WOS:000262483600011"}