{"auto_keywords": [{"score": 0.04873962029593552, "phrase": "robust_principal_component_analysis"}, {"score": 0.03584870981475542, "phrase": "rpca"}, {"score": 0.026000712254902122, "phrase": "proposed_rpca-based_framework"}, {"score": 0.00481495120578938, "phrase": "rpca-kfe"}, {"score": 0.004647206916983993, "phrase": "key_frame_extraction_algorithms"}, {"score": 0.004298367681427065, "phrase": "video_summarization"}, {"score": 0.004090083576606688, "phrase": "extracted_key_frames"}, {"score": 0.003905689096176873, "phrase": "algorithms_work"}, {"score": 0.0038506359988314787, "phrase": "input_video_data"}, {"score": 0.00376950244909, "phrase": "underlying_low-rank_structure"}, {"score": 0.003650984439966844, "phrase": "low-rank_component"}, {"score": 0.00346164863873186, "phrase": "novel_key_frame_extraction_framework"}, {"score": 0.0032820992275066274, "phrase": "challenging_application"}, {"score": 0.003247319029344241, "phrase": "key_frames"}, {"score": 0.003224336566887827, "phrase": "unstructured_consumer_videos"}, {"score": 0.0031901665168365357, "phrase": "proposed_framework"}, {"score": 0.0030679359570782595, "phrase": "input_data"}, {"score": 0.002837305633114947, "phrase": "sparse_components"}, {"score": 0.0027873491386063913, "phrase": "distinct_information"}, {"score": 0.0025055037815033725, "phrase": "novel_iterative_algorithm"}, {"score": 0.0024701382170046462, "phrase": "optimization_problem"}, {"score": 0.002317055705600351, "phrase": "underlying_video"}, {"score": 0.0021049977753042253, "phrase": "ground_truth"}], "paper_keywords": ["Video summarization", " robust principal component analysis", " consumer video"], "paper_abstract": "Key frame extraction algorithms consider the problem of selecting a subset of the most informative frames from a video to summarize its content. Several applications, such as video summarization, search, indexing, and prints from video, can benefit from extracted key frames of the video under consideration. Most approaches in this class of algorithms work directly with the input video data set, without considering the underlying low-rank structure of the data set. Other algorithms exploit the low-rank component only, ignoring the other key information in the video. In this paper, a novel key frame extraction framework based on robust principal component analysis (RPCA) is proposed. Furthermore, we target the challenging application of extracting key frames from unstructured consumer videos. The proposed framework is motivated by the observation that the RPCA decomposes an input data into: 1) a low-rank component that reveals the systematic information across the elements of the data set and 2) a set of sparse components each of which containing distinct information about each element in the same data set. The two information types are combined into a single l(1)-norm-based non-convex optimization problem to extract the desired number of key frames. Moreover, we develop a novel iterative algorithm to solve this optimization problem. The proposed RPCA-based framework does not require shot(s) detection, segmentation, or semantic understanding of the underlying video. Finally, experiments are performed on a variety of consumer and other types of videos. A comparison of the results obtained by our method with the ground truth and with related state-of-the-art algorithms clearly illustrates the viability of the proposed RPCA-based framework.", "paper_title": "RPCA-KFE: Key Frame Extraction for Video Using Robust Principal Component Analysis", "paper_id": "WOS:000358615500006"}