{"auto_keywords": [{"score": 0.022579911552119088, "phrase": "rough_mereology"}, {"score": 0.0048149540663384284, "phrase": "mereology"}, {"score": 0.004790756351382389, "phrase": "rough_mereology_points_of_view"}, {"score": 0.0045324756541157574, "phrase": "mereological_structures"}, {"score": 0.004386420328440248, "phrase": "practical_spatial_reasoning"}, {"score": 0.004320599949140603, "phrase": "geographical_information_systems"}, {"score": 0.0039657716008010485, "phrase": "reasoning_schemes"}, {"score": 0.003916098498242888, "phrase": "spatial_objects"}, {"score": 0.0038475956342813936, "phrase": "spatial_locutions"}, {"score": 0.003658380794655729, "phrase": "mereological_universa"}, {"score": 0.0034960285521942994, "phrase": "computer_scientists"}, {"score": 0.003208699724971268, "phrase": "existing_things"}, {"score": 0.0030895394261534776, "phrase": "mereological_universe"}, {"score": 0.0028933521924166287, "phrase": "topological_nature"}, {"score": 0.0025892330566358503, "phrase": "boundary_points"}, {"score": 0.002543881282993268, "phrase": "first_calls"}, {"score": 0.002524688179363081, "phrase": "first_type"}, {"score": 0.0023762535034673017, "phrase": "rough_mereology_notions"}, {"score": 0.0022592313766072658, "phrase": "model_rom"}, {"score": 0.0021049977753042253, "phrase": "granular_computing"}], "paper_keywords": ["spatial reasoning", " mereotopology", " boundary", " mereology", " rough mereology", " granular computing"], "paper_abstract": "The notion of a boundary belongs in the canon of the most important notions of mereotopology, the topological theory induced by mereological structures; the importance of this notion rests not only in its applications to practical spatial reasoning, e. g., in geographical information systems, where it is usually couched under the term of a contour and applied in systems related to economy, welfare, climate, wildlife etc., but also in its impact on reasoning schemes elaborated for reasoning about spatial objects, represented as regions, about spatial locutions etc. The difficulty with this notion lies primarily in the fact that boundaries are things not belonging in mereological universa of things of which they are boundaries. Various authors, from philosophers through mathematicians to logicians and computer scientists proposed schemes for defining and treating boundaries. We propose two approaches to boundaries; the first aims at defining boundaries as things possibly in the universe in question, i.e., composed of existing things, whereas the second defines them as things in a meta-space built over the mereological universe in question, i.e., we assume a priori that boundaries are in a sense 'things at infinity', in an agreement with the topological nature of boundaries. Of the two equivalent topological definitions of a boundary, the first, global, defining the boundary as the difference between the closure and the interior of the set, and the second, local, defining it as the set of boundary points whose all neighborhoods transect the set, the first calls for the first type of the boundary and the second is best fitted for the meta-boundary. In the text that follows, we discuss mereology and rough mereology notions (sects. 2, 3), the topological approach to the notion of a boundary and the model ROM with which we illustrate our discussion (sect. 4), the mereology approach (sect. 5), and the approach based on rough mereology and granular computing in the framework of rough mereology (sect. 6).", "paper_title": "On the Problem of Boundaries from Mereology and Rough Mereology Points of View", "paper_id": "WOS:000343008800011"}