{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "dem_quality"}, {"score": 0.004755054742217193, "phrase": "shannon-weaver_information_statistic"}, {"score": 0.004637478829869904, "phrase": "useful_measure"}, {"score": 0.004522796947899013, "phrase": "digital_elevation_model"}, {"score": 0.003763763153640936, "phrase": "better_understanding"}, {"score": 0.0034476484413811987, "phrase": "previous_work"}, {"score": 0.00300351371036355, "phrase": "dem_products"}, {"score": 0.002978508766388785, "phrase": "varying_quality"}, {"score": 0.0029169007179202164, "phrase": "theoretical_and_practical_tests"}, {"score": 0.002616506403879428, "phrase": "dem"}, {"score": 0.0025623050508233078, "phrase": "coarser_scale"}, {"score": 0.00246765655376112, "phrase": "systematic_way"}, {"score": 0.00241658945942583, "phrase": "consistent_relationship"}, {"score": 0.0022507188208913394, "phrase": "quality_measure"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Error", " Information theory", " Elevation", " Shannon-Weaver statistic"], "paper_abstract": "The Shannon-Weaver Information statistic has been proposed as a useful measure of the quality of a Digital Elevation Model. However the statistic, usually referred to as entropy, is based purely on the range of values in a dataset and their relative proportion and is not directly related to the accuracy of those values or their spatial arrangement. These properties suggest that a better understanding is needed of how entropy behaves with respect to DEMs and that is what this paper seeks to provide. Previous work has suggested two uses for entropy: firstly as a measure of the loss of information caused by smoothing and aggregation of a DEM and secondly as a means of comparing DEMs and DEM products of varying quality. A series of theoretical and practical tests were used to test these ideas. It was found that entropy may well be useful as a measure of the information lost when a DEM is aggregated to a coarser scale but is not related to smoothing in any systematic way. There was no consistent relationship between entropy and the measures of DEM quality tested. Although it may have uses as a quality measure in some instances further work would be needed to establish its reliability. (C) 2012 Elsevier Ltd. All rights reserved.", "paper_title": "Information entropy as a measure of DEM quality", "paper_id": "WOS:000309785200013"}