{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "crossing-based_target_selection_technique"}, {"score": 0.004569905085027681, "phrase": "touch_devices"}, {"score": 0.00452670409375785, "phrase": "daily_lives"}, {"score": 0.004337276328199398, "phrase": "real_world"}, {"score": 0.003906804492585634, "phrase": "mobile_navigation_scenarios"}, {"score": 0.0038515000499988673, "phrase": "changing_target_movement_pattern"}, {"score": 0.0034526191487098093, "phrase": "attachedshock"}, {"score": 0.0033875770020590796, "phrase": "target_selection_tasks"}, {"score": 0.003355515315708125, "phrase": "augmented_reality_devices"}, {"score": 0.0032922964156452696, "phrase": "naturally_expanding_wave_pattern"}, {"score": 0.0030656196752517836, "phrase": "comparative_studies"}, {"score": 0.0028409576481842457, "phrase": "identified_factors"}, {"score": 0.0027479040199262393, "phrase": "proposed_technique"}, {"score": 0.0026202187680903063, "phrase": "error_rate"}, {"score": 0.0022287497627555895, "phrase": "acceptable_distractions"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Target acquisition", " Moving target selection"], "paper_abstract": "The prevalence of touch devices in daily lives offers increasing opportunities for users to navigate the real world. However, as users move, on-screen targets move unpredictably, and eventually disappear from the screen in mobile navigation scenarios. The changing target movement pattern creates difficulties in selecting targets in time before targets escape from the screen. This study proposes a novel selecting technique, AttachedShock, for easing target selection tasks on augmented reality devices by crossing a naturally expanding wave pattern attached to targets. We evaluated the effectiveness of our technique by conducting three sets of comparative studies on measuring the performance of four techniques under various mobile navigation scenarios, i.e., various combinations of the identified factors. The results indicate that the proposed technique assists users in selecting moving targets to improve the error rate substantially, by a minimum of 76.51%, 61.75%, and 72.77% in Experiment-I, -II, and -III relative to state-of-the-art techniques, and incurs acceptable distractions to users, compared to other techniques. (C) 2014 Elsevier Ltd. All rights reserved.", "paper_title": "AttachedShock: Design of a crossing-based target selection technique on augmented reality devices and its implications", "paper_id": "WOS:000336777500003"}