{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "distance_learning"}, {"score": 0.047727054184086584, "phrase": "technical_disciplines"}, {"score": 0.0147713245164933, "phrase": "mechanical"}, {"score": 0.010766868495394946, "phrase": "physical_system"}, {"score": 0.007709479429961696, "phrase": "virtual_laboratory"}, {"score": 0.004335603324413586, "phrase": "grown_practice"}, {"score": 0.004299374036140852, "phrase": "narrative_disciplines"}, {"score": 0.003903789851015775, "phrase": "laboratory_exercises"}, {"score": 0.003743310268453678, "phrase": "potential_e-learning_system"}, {"score": 0.003665552439863732, "phrase": "new_specific_knowledge"}, {"score": 0.003398714712611042, "phrase": "software-based_laboratory_exercises"}, {"score": 0.00325893016361821, "phrase": "laboratory_equipment"}, {"score": 0.0031512402798625056, "phrase": "mathematical_model"}, {"score": 0.0030857431184193765, "phrase": "differential_equations"}, {"score": 0.0025541050375256992, "phrase": "complex_technical_field"}, {"score": 0.0025327246751203126, "phrase": "mechatronics"}, {"score": 0.0024489727828322693, "phrase": "perfect_symbiosis"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Robot", " Virtual laboratory", " Laboratory exercise"], "paper_abstract": "The implementation of the distance learning and e-learning in technical disciplines (like Mechanical and Electrical Engineering) is still far behind the grown practice in narrative disciplines (like Economy, management, etc.). This comes out from the fact that education in technical disciplines inevitably involves laboratory exercises and this fact drastically increases the complexity of a potential e-learning system. New approach and new specific knowledge are needed to develop such a system. We expect to meet the requirements of distance learning by developing the software-based laboratory exercises, i.e., a virtual laboratory. To fully substitute a physical system like laboratory equipment, one must emulate its full dynamics. The mathematical model in the form of differential equations will be applied to calculate dynamics and provide the data that would otherwise be measured on a physical system this means simulation. To prove the feasibility of the concept and make a step towards full e-learning in technical disciplines, we consider a complex technical field, Mechatronics and more precisely, Robotics being a perfect symbiosis of Mechanical and Electrical Engineering. We present the Virtual Laboratory for Robotics (VLR). It possesses all the necessary features of a virtual laboratory: user interface, simulator, and visualization. (C) 2010 Elsevier Ltd. All rights reserved.", "paper_title": "Virtual Mechatronic/Robotic laboratory - A step further in distance learning", "paper_id": "WOS:000279137800004"}