{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "random_relations"}, {"score": 0.04933866662045337, "phrase": "random_sets"}, {"score": 0.03428126090036414, "phrase": "non-consistent_marginals"}, {"score": 0.03130260918869616, "phrase": "consistent_marginals"}, {"score": 0.029123628301335917, "phrase": "optimisation_problems"}, {"score": 0.004667149874736771, "phrase": "two-dimensional_space"}, {"score": 0.004402088928254543, "phrase": "random_relation"}, {"score": 0.004168240841388958, "phrase": "multi-valued_mapping"}, {"score": 0.004040211152784802, "phrase": "joint_random_variables"}, {"score": 0.003900853871728297, "phrase": "consistent_and_non-consistent_marginals"}, {"score": 0.0038106195546165574, "phrase": "epistemic_independence"}, {"score": 0.003389704997952315, "phrase": "entire_random_relation"}, {"score": 0.0032094634756436595, "phrase": "correlation_bounds"}, {"score": 0.002865929543375884, "phrase": "probability_bounds"}, {"score": 0.0028436364707396613, "phrase": "unknown_interaction"}, {"score": 0.002821516317503421, "phrase": "strong_independence"}, {"score": 0.002366763442497185, "phrase": "complete_loss"}, {"score": 0.00228499525153, "phrase": "correlation_interval"}], "paper_keywords": ["correlation", " random sets", " interval analysis", " imprecise probabilities", " measurable selections", " optimisation"], "paper_abstract": "Random relations are random sets defined on a two-dimensional space (or higher). After defining the correlation for two variables constrained by a random relation as an interval, the effect of imprecision was studied by using a multi-valued mapping, whose domain is a space of joint random variables. This perspective led to the notions of consistent and non-consistent marginals, which parallel those of epistemic independence, and unknown interaction and epistemic independence for random sets, respectively. The calculation of the correlation bounds entails solving two optimisation problems that are NP-hard. When the entire random relation is available, it is shown that the hypothesis of non-consistent marginals leads to correlation bounds that are much larger (four orders of magnitude in some cases) than those obtained under the hypothesis of consistent marginals; this hierarchy parallels the hierarchy between probability bounds for unknown interaction and strong independence, respectively. Solutions of the optimisation problems were found at the extremes of their feasible intervals in 80-100% of the cases when non-consistent marginals were assumed, but this range became 75-84% when consistent marginals were assumed. When only the marginals are available, there is a complete loss of knowledge in the correlation, and the correlation interval is nearly vacuous or vacuous (i.e. [-1,1]) even if the measurements are sufficiently accurate in which their narrowed intervals do not overlap. Solutions to the optimisation problems were found at the extremes of their feasible intervals 50% or less of the times.", "paper_title": "Toward a definition and understanding of correlation for variables constrained by random relations", "paper_id": "WOS:000279618000001"}