{"auto_keywords": [{"score": 0.0420960249176514, "phrase": "phase_transition"}, {"score": 0.03299560344947681, "phrase": "unique_solution"}, {"score": 0.00481495049065317, "phrase": "multivariate_polynomial_systems"}, {"score": 0.0047515546458205046, "phrase": "random_multivariate_polynomial_system"}, {"score": 0.004198510172614725, "phrase": "high_probability"}, {"score": 0.0036445446531633368, "phrase": "limiting_probability"}, {"score": 0.003456132182564149, "phrase": "prime_field"}, {"score": 0.0033212215487678854, "phrase": "exactly_s_solutions"}, {"score": 0.0026501241093379786, "phrase": "large_multivariate_polynomial_systems"}, {"score": 0.0025692477422626678, "phrase": "finite_field"}, {"score": 0.0023307492812556204, "phrase": "exactly_one_solution"}, {"score": 0.0022396694076443446, "phrase": "cryptographic_systems"}, {"score": 0.0021049977753042253, "phrase": "random_systems"}], "paper_keywords": [""], "paper_abstract": "A random multivariate polynomial system with more equations than variables is likely to be unsolvable. On the other hand, if there are more variables than equations, the system has at least one Solution with high probability. In this paper we study in detail the phase transition between these two regimes, which Occurs when the number of equations equals the number of variables. In particular, the limiting probability for no solution is 1/e at the phase transition, over a prime field. We also study the probability of having exactly s solutions, with s >= 1. In particular, the probability of a unique solution is asymptotically 1/e if the number of equations equals the number of variables. The probability decreases very rapidly if the number of equations increases or decreases. Our motivation is that many cryptographic systems can be expressed as large multivariate polynomial systems (usually quadratic) over a finite field. Since decoding is unique, the Solution of the system must also be unique. Knowing the probability of having exactly one solution may help us to understand more about these cryptographic systems. For example, whether attacks should be evaluated by trying them against random systems depends very much on the likelihood of a unique solution.", "paper_title": "Phase transition of multivariate polynomial systems", "paper_id": "WOS:000264418400003"}