{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "free-form_steel_space-frame_roof_structures"}, {"score": 0.004564401713056939, "phrase": "two-phase_genetic_algorithm"}, {"score": 0.004527292576242738, "phrase": "ga"}, {"score": 0.004471530397729526, "phrase": "minimum_weight_design"}, {"score": 0.004380540407926982, "phrase": "discrete_commercially_available_rectangular_hollow_structural_sections"}, {"score": 0.004034649282040889, "phrase": "new_methodology"}, {"score": 0.004001593118269276, "phrase": "simultaneous_sizing"}, {"score": 0.0035079364710988627, "phrase": "roof_structures"}, {"score": 0.003479180627368156, "phrase": "relatively_regular_geometries"}, {"score": 0.0032979090806670493, "phrase": "additional_structural_efficiencies"}, {"score": 0.003204232566468624, "phrase": "roof_structure"}, {"score": 0.00313894917464766, "phrase": "roof_member"}, {"score": 0.0031004173389196387, "phrase": "cross-sectional_dimensions"}, {"score": 0.0030623570435946977, "phrase": "roof_topology"}, {"score": 0.002999955539996569, "phrase": "significant_consideration"}, {"score": 0.002797121441432477, "phrase": "general_form"}, {"score": 0.0026953359825383646, "phrase": "proposed_shape_optimization_algorithm"}, {"score": 0.0025865679621853667, "phrase": "drastic_or_undesirable_changes"}, {"score": 0.0023142713916631872, "phrase": "ottawa"}, {"score": 0.002295315170308252, "phrase": "canada"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Genetic algorithm", " Optimization", " Shape optimization", " Structure", " Roof structure"], "paper_abstract": "Recently the authors presented a two-phase genetic algorithm (GA) for minimum weight design of free-form steel space-frame roof structures consisting of discrete commercially available rectangular hollow structural sections (HSS). Subsequently the algorithm was extended to topology optimization of structures. This article presents a new methodology for simultaneous sizing, topology, and shape optimization of free-form steel space-frame roof structures with complex geometries using evolutionary computing. Two methods of altering the geometry of the structure are presented, one a simple method to be used for roof structures with relatively regular geometries, and the other for more complicated geometries. The goal is to achieve additional structural efficiencies by altering the geometry of the roof structure while simultaneously optimizing the roof member and column cross-sectional dimensions and the roof topology. Esthetics is a significant consideration in the structures of the type considered in this research. As such, preserving the general form created by the architect is considered in the proposed shape optimization algorithm. To achieve this, heuristic limits are imposed to avoid drastic or undesirable changes in their architectural form. The methodology is applied to two real-life free-form steel space-frame roof structures. They are two of the thirteen train stations making up the Ottawa Light Rail Transit (OLRT) system to be completed in Ottawa, Canada, in 2018. Efficiencies in the range of 10-16% are reported for the two examples. (C) 2014 Elsevier Ltd. All rights reserved.", "paper_title": "Shape optimization of free-form steel space-frame roof structures with complex geometries using evolutionary computing", "paper_id": "WOS:000348748200015"}