{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "variation_simulation_of_stresses"}, {"score": 0.004617187934074393, "phrase": "manufacturing_situation"}, {"score": 0.004559451202070545, "phrase": "geometric_deviations"}, {"score": 0.004408976280483648, "phrase": "manufactured_products"}, {"score": 0.003838791650587681, "phrase": "geometric_quality"}, {"score": 0.003559387846675818, "phrase": "rigid-or_sheet_metal_components"}, {"score": 0.0034418037573506837, "phrase": "increasingly_popular_material"}, {"score": 0.003072807453368781, "phrase": "geometry_assurance"}, {"score": 0.002885135695263876, "phrase": "non-nominal_assembly"}, {"score": 0.002813307389456184, "phrase": "critical_limits"}, {"score": 0.002586513876943306, "phrase": "influence_coefficients"}, {"score": 0.0024904974828343033, "phrase": "von_mises"}, {"score": 0.002459288755782293, "phrase": "assembled_components"}, {"score": 0.0022514836269627186, "phrase": "large_number"}, {"score": 0.002204646157481869, "phrase": "statistical_inference"}, {"score": 0.0021049977753042253, "phrase": "proposed_method"}], "paper_keywords": ["variation simulation", " von Mises stress", " method of influence coefficients"], "paper_abstract": "In every manufacturing situation there are geometric deviations leading to variation in properties of the manufactured products. Variation affects the manufacturability, functions and aesthetics of the products. Therefore, a number of methods and tools have been developed during the last 20 yr in order to assure the geometric quality and to minimize the effect of variability. These methods and tools have mainly been developed for rigid-or sheet metal components. Plastics or composites have been an increasingly popular material due to their flexible mechanical properties and their relative ease in manufacturing. However, their mechanical properties are introducing challenges that have not often been addressed in the process of geometry assurance. One challenge is to assure that the stresses introduced, as a consequence of non-nominal assembly, are kept well below critical limits during the conditions of use. In this paper, we are proposing the use of the method of influence coefficients (MIC) to simulate the distribution of von Mises stresses in assembled components. This method will be compared to the more flexible but computationally much heavier direct Monte Carlo (DMC) method, which is not suitable for variation simulation due to the large number of runs required for statistical inference. Two industrial case studies are presented to elicit the need of the proposed method.", "paper_title": "Variation Simulation of Stresses Using the Method of Influence Coefficients", "paper_id": "WOS:000331145500001"}