{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "regional_innovative_performance"}, {"score": 0.004548253531664032, "phrase": "considerable_amount"}, {"score": 0.003962899903266524, "phrase": "sfinno"}, {"score": 0.0036379729015583975, "phrase": "individual_proxy_indicators"}, {"score": 0.003569451476205552, "phrase": "research_and_development_statistics"}, {"score": 0.0033875770020590796, "phrase": "principal_component_analysis"}, {"score": 0.0032922964156452696, "phrase": "local_administrative_units"}, {"score": 0.0032611427775970144, "phrase": "finland"}, {"score": 0.003199687131875466, "phrase": "regional_units"}, {"score": 0.003036595866130997, "phrase": "complex_phenomenon"}, {"score": 0.002881793492919646, "phrase": "proxy_statistics"}, {"score": 0.0024984517279573906, "phrase": "different_innovation_measures"}, {"score": 0.0024747842618794255, "phrase": "highly_divergent_rankings"}, {"score": 0.002326304140277375, "phrase": "produced_innovation_indexes"}, {"score": 0.0021049977753042253, "phrase": "single_measure"}], "paper_keywords": ["Innovation", " Composite indicators", " Patents", " R&D", " Regional innovative performance"], "paper_abstract": "There is a considerable amount of discussion, but still no consensus, about which indicator should be used to measure innovation. To participate in this debate, a unique innovation database, SFINNO, is introduced. Innovation counts from the database are used as the baseline, to which individual proxy indicators (patent- and research and development statistics) of innovation and innovation indexes, constructed here with principal component analysis, are compared. The local administrative units of Finland serve as the regional units benchmarked. The study results show that innovation is a complex phenomenon which cannot be entirely explained through the use of proxy statistics, as the linkages between innovation input- and output-indicators are fuzzy. We also show that the strength of these linkages varies by field of technology. Furthermore, different innovation measures produce highly divergent rankings when they are used as benchmarking tools of regional innovative performance. Although the produced innovation indexes perform slightly better, their superiority is marginal. Therefore, caution should be taken before drawing too drastic policy conclusions depending on a single measure of regional innovative performance.", "paper_title": "Benchmarking regional innovative performance: composite measures and direct innovation counts", "paper_id": "WOS:000313016300014"}