{"auto_keywords": [{"score": 0.010612387000973441, "phrase": "multiple_transformation_property"}, {"score": 0.006998094148653465, "phrase": "grey_models"}, {"score": 0.0064414006773244326, "phrase": "multiple_transformation"}, {"score": 0.005826077352579128, "phrase": "grey_model"}, {"score": 0.004669845451682529, "phrase": "purpose_-_the_purpose"}, {"score": 0.00450933377534525, "phrase": "parameters'_properties"}, {"score": 0.0031498398446368025, "phrase": "parameters'_value"}, {"score": 0.0030951536886513567, "phrase": "multiple_transformation_value"}, {"score": 0.0028857130140890787, "phrase": "main_variable"}, {"score": 0.0021516366862117707, "phrase": "common_model"}, {"score": 0.0021049977753042253, "phrase": "parameters'_multiple_transformation"}], "paper_keywords": ["Cybernetics", " Transforms", " Systems and control theory"], "paper_abstract": "Purpose - The purpose of this paper is to study the parameters' properties of GM(n, h) model on the basis of multiple transformation and the relationship of GM(n, h) model and other grey models. Design/methodology/approach - Multiple transformation property of parameters is important to construct a grey model. However, there is no research on the property of GM(n, h) model, therefore it is meaningful to study the relationship between GM(n. 11) model and other grey models. Findings - The multiple transformation property of parameters of GM(n, h) model is recognized The parameters' value is dependent on multiple transformation value. The values of simulative and predicative are only dependent to the multiple transformation of the main variable and independent to other variables. Research limitations/implications - The properties of other grey models could be obtained by analyzing the property of GM(n, h) model. Practical implications - It is a Very useful result for constructing a grey model. Originality/value - This paper discusses multiple transformation property of GM(n, h) model and the relationship between the GM(n, h) model and other grey models These grey models are put into a common model and the affections that parameters' multiple transformation caused to the model are studied.", "paper_title": "Research on the multiple transformation property of a series of grey models", "paper_id": "WOS:000272687500009"}