{"auto_keywords": [{"score": 0.04238173017198957, "phrase": "oc"}, {"score": 0.037271574211870474, "phrase": "controlled_self-organization"}, {"score": 0.00481495049065317, "phrase": "organic_computing_systems"}, {"score": 0.00478218760286811, "phrase": "organic_computing"}, {"score": 0.004669254965563445, "phrase": "autonomic_computing"}, {"score": 0.004637478829869904, "phrase": "proactive_computing"}, {"score": 0.004512512374933493, "phrase": "life-like_properties"}, {"score": 0.00388278852285898, "phrase": "increasingly_complex_networked_application_systems"}, {"score": 0.0038300786263543835, "phrase": "self-x_properties"}, {"score": 0.0037395458116642306, "phrase": "trustworthy_and_adaptive_response"}, {"score": 0.003688773272422118, "phrase": "system_objectives"}, {"score": 0.003663645143713398, "phrase": "control_actions"}, {"score": 0.0034924598001567944, "phrase": "terms_self-organization"}, {"score": 0.003352088714126572, "phrase": "clear_definition"}, {"score": 0.00325051332556486, "phrase": "technically_motivated_background"}, {"score": 0.0029135770621039926, "phrase": "main_objectives"}, {"score": 0.002883833572486452, "phrase": "oc_initiative"}, {"score": 0.0028349323966217386, "phrase": "system_classification"}, {"score": 0.0025759787655463212, "phrase": "external_control"}, {"score": 0.002463906556781983, "phrase": "internal_control"}, {"score": 0.0022696277881969896, "phrase": "quantitative_degree"}, {"score": 0.0021049977753042253, "phrase": "organic_systems"}], "paper_keywords": ["Design", " Theory", " Adaptation", " adaptivity", " observer/controller architecture", " organic computing", " robustness", " self-organization", " system classification"], "paper_abstract": "Organic Computing (OC) and other research initiatives like Autonomic Computing or Proactive Computing have developed the vision of systems possessing life-like properties: they self-organize, adapt to their dynamically changing environments, and establish other so-called self-x properties, like self-healing, self-configuration, self-optimization, etc. What we are searching for in OC are methodologies and concepts for systems that allow to cope with increasingly complex networked application systems by introduction of self-x properties and at the same time guarantee a trustworthy and adaptive response to externally provided system objectives and control actions. Therefore, in OC, we talk about controlled self-organization. Although the terms self-organization and adaptivity have been discussed for years, we miss a clear definition of self-organization in most publications, which have a technically motivated background. In this article, we briefly summarize the state of the art and suggest a characterization of (controlled) self-organization and adaptivity that is motivated by the main objectives of the OC initiative. We present a system classification of robust, adaptable, and adaptive systems and define a degree of autonomy to be able to quantify how autonomously a system is working. The degree of autonomy distinguishes and measures external control that is exerted directly by the user (no autonomy) from internal control of a system which might be fully controlled by an observer/controller architecture that is part of the system (full autonomy). The quantitative degree of autonomy provides the basis for characterizing the notion of controlled self-organization. Furthermore, we discuss several alternatives for the design of organic systems.", "paper_title": "Adaptivity and Self-Organization in Organic Computing Systems", "paper_id": "WOS:000282764300002"}