{"auto_keywords": [{"score": 0.03603992735265682, "phrase": "floss_projects"}, {"score": 0.015719716506582538, "phrase": "open_source_projects"}, {"score": 0.011724306063600871, "phrase": "floss_project"}, {"score": 0.0038674532861321864, "phrase": "vivid_projects"}, {"score": 0.0036788184374592706, "phrase": "survival_analysis_techniques"}, {"score": 0.003622642432563435, "phrase": "future_development"}, {"score": 0.003445906915464945, "phrase": "duration_data"}, {"score": 0.0030232568024943455, "phrase": "survival_analysis_methods"}, {"score": 0.002474674704809152, "phrase": "prediction_model"}, {"score": 0.0024181413029825205, "phrase": "project_future"}, {"score": 0.0022648637058989463, "phrase": "analysis_results"}, {"score": 0.002213112756450354, "phrase": "proposed_framework"}, {"score": 0.0021792693001152896, "phrase": "survival_probability"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Open source software", " Survival analysis", " Prediction"], "paper_abstract": "Context: Open source (FLOSS) project survivability is an important piece of information for many open source stakeholders. Coordinators of open source projects would like to know the chances for the survival of the projects they coordinate. Companies are also interested in knowing how viable a project is in order to either participate or invest in it, and volunteers want to contribute to vivid projects. Objective: The purpose of this article is the application of survival analysis techniques for estimating the future development of a FLOSS project. Method: In order to apply such approach, duration data regarding FLOSS projects from the FLOSSMETRICS (This work was partially supported by the European Community's Sixth Framework Program under the Contract FP6-033982) database were collected. Such database contains metadata for thousands of FLOSS projects, derived from various forges. Subsequently, survival analysis methods were employed to predict the survivability of the projects, i.e. their probability of continuation in the future, by examining their duration, combined with other project characteristics such as their application domain and number of committers. Results: It was shown how probability of termination or continuation may be calculated and how a prediction model may be built to upraise project future. In addition, the benefit of adding more committers to FLOSS projects was quantified. Conclusion: Analysis results demonstrate the usefulness of the proposed framework for assessing the survival probability of a FLOSS project. (C) 2010 Elsevier B.V. All rights reserved.", "paper_title": "Survival analysis on the duration of open source projects", "paper_id": "WOS:000280214700003"}