{"auto_keywords": [{"score": 0.011261004675746988, "phrase": "novel_spot_detection"}, {"score": 0.009992963739495356, "phrase": "proposed_methodology"}, {"score": 0.00481495049065317, "phrase": "regional_intensity_information"}, {"score": 0.004575195715264118, "phrase": "wide_variety"}, {"score": 0.004547782274166457, "phrase": "biological_problems"}, {"score": 0.004360412703519539, "phrase": "complex_protein_mixtures"}, {"score": 0.004269630481719451, "phrase": "fundamental_components"}, {"score": 0.0041183611532727375, "phrase": "academic_approaches"}, {"score": 0.003913155833767365, "phrase": "different_level"}, {"score": 0.003729335910488339, "phrase": "available_methods"}, {"score": 0.0036847412633483788, "phrase": "user_intervention"}, {"score": 0.00362974436427641, "phrase": "optimal_results"}, {"score": 0.003543445557071389, "phrase": "subjective_and_non-reproducible_results"}, {"score": 0.0034178160236983226, "phrase": "segmentation_methodology"}, {"score": 0.0032966258317691354, "phrase": "spot_segmentation_methodology"}, {"score": 0.0032376465741070274, "phrase": "multi-thresholding_scheme"}, {"score": 0.0032085525502105836, "phrase": "overlapping_regions"}, {"score": 0.0031511440119092447, "phrase": "custom_grow-cut_algorithm"}, {"score": 0.003122824878906245, "phrase": "region_growing_scheme"}, {"score": 0.003104086547947925, "phrase": "morphological_operators"}, {"score": 0.002702733794508487, "phrase": "experimental_results"}, {"score": 0.0026543514413663893, "phrase": "state-of-the-art_software_packages"}, {"score": 0.0025371413754846474, "phrase": "proposed_method"}, {"score": 0.0025143263276317935, "phrase": "highest_f-measure"}, {"score": 0.002476755123108715, "phrase": "spot_detection"}, {"score": 0.0024544817577464816, "phrase": "lowest_volumetric_overlap_error"}, {"score": 0.0024105326885334962, "phrase": "segmentation_process"}, {"score": 0.002262802370005939, "phrase": "scimo"}, {"score": 0.0022289812518790824, "phrase": "proposed_approach"}, {"score": 0.0021563397322290445, "phrase": "advantageous_and_reliable_solution"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ireland_ltd."}], "paper_keywords": ["Segmentation", " Proteomicss", " 2D-gel electrophoresis"], "paper_abstract": "Background: Proteomics, the study of proteomes, has been increasingly utilized in a wide variety of biological problems. The Two-Dimensional Gel Electrophoresis (2D-PAGE) technique is a powerful proteomics technique aiming at separation of the complex protein mixtures. Spot detection and segmentation are fundamental components of 2D-gel image analysis but remain arduous and difficult tasks. Several software packages and academic approaches are available for 2D-gel image spot detection and segmentation. Each one has its respective advantages and disadvantages and achieves a different level of success in dealing with the challenges of 2D-gel image analysis. A common characteristic of the available methods is their dependency on user intervention in order to achieve optimal results, a process that can lead to subjective and non-reproducible results. In this work, the authors propose a novel spot detection and segmentation methodology for 2D-gel images. Methods: This work introduces a novel spot detection and spot segmentation methodology that is based on a multi-thresholding scheme applied on overlapping regions of the image, a custom grow-cut algorithm, a region growing scheme and morphological operators. The performance of the proposed methodology is evaluated on real as well as synthetic 2D-gel images using well established statistical measures, including precision, sensitivity, and their weighted measure, F-measure, as well as volumetric overlap, volumetric error and volumetric overlap error. Results: Experimental results show that the proposed methodology outperforms state-of-the-art software packages and methods proposed in the literature and results in more plausible spot boundaries and more accurate segmentation. The proposed method achieved the highest F-measure (94.8%) for spot detection and the lowest volumetric overlap error (8.3%) for the segmentation process. Conclusions: Evaluation against state-of-the-art 2D-gel image analysis software packages and techniques proposed in the literature, including Melanie 7, Delta2D, PDQuest and Scimo, demonstrates that the proposed approach outperforms the other methods evaluated in this work and constitutes an advantageous and reliable solution for 2D-gel image analysis. (C) 2015 Elsevier Ireland Ltd. All rights reserved.", "paper_title": "2D-gel spot detection and segmentation based on modified image-aware grow-cut and regional intensity information", "paper_id": "WOS:000360110100003"}