{"auto_keywords": [{"score": 0.04966735134001231, "phrase": "semantic_grid_environment"}, {"score": 0.02322730111336099, "phrase": "ontology_update"}, {"score": 0.010283466796298497, "phrase": "domain_knowledge"}, {"score": 0.010079427721735201, "phrase": "distributed_environment"}, {"score": 0.004705332186103205, "phrase": "formal_representation"}, {"score": 0.0046114557978424245, "phrase": "important_role"}, {"score": 0.004545544875014869, "phrase": "semantic_interoperability"}, {"score": 0.004506449323192937, "phrase": "major_factor"}, {"score": 0.0043659413776311485, "phrase": "distributed_ontology_framework"}, {"score": 0.004328383851864678, "phrase": "semantic_grid_resources"}, {"score": 0.00429114801805935, "phrase": "semantic_representation"}, {"score": 0.0042542311446793725, "phrase": "machine-understandable_format"}, {"score": 0.0040860907835759954, "phrase": "different_user_nodes"}, {"score": 0.0034771855131805235, "phrase": "rather_static_ontology"}, {"score": 0.0033396533935201316, "phrase": "whereby_sections"}, {"score": 0.0031983089354509667, "phrase": "first_phase"}, {"score": 0.00308064351528802, "phrase": "second_phase"}, {"score": 0.0028663584600000023, "phrase": "valid_ontology"}, {"score": 0.0028416641115201974, "phrase": "semantic_completeness_checking"}, {"score": 0.002721338551347818, "phrase": "case_study"}, {"score": 0.00266693888510356, "phrase": "medical_informatics_domain"}, {"score": 0.002383120224166142, "phrase": "shared_resources"}, {"score": 0.002295376442690866, "phrase": "web_services"}, {"score": 0.0022755900116918923, "phrase": "complexity_evaluation_measure"}, {"score": 0.0021981315377404245, "phrase": "semantic_grid"}, {"score": 0.0021791815390109744, "phrase": "viable_solution"}, {"score": 0.0021049977753042253, "phrase": "john_wiley"}], "paper_keywords": ["distributed ontology framework", " semantic grid", " subontology distribution and maintenance", " service oriented architecture"], "paper_abstract": "Ontology as a formal representation of a domain knowledge has played an important role in a distributed environment whereby semantic interoperability is a major factor. In this paper, we particularly focus on a distributed ontology framework that utilizes Semantic Grid resources. The semantic representation in a machine-understandable format (i.e., an ontology) is the backbone that enables interoperability between different user nodes in a semantic grid environment. However, the domain knowledge represented within an ontology is not static. From time to time, its concepts, properties and relationships need to be replaced or updated. Although many existing work have been focusing on how to utilize an ontology to support interoperability within a distributed environment, they often assume a rather static ontology. This paper focuses on formalizing and validating the process of ontology update, whereby sections of one ontology O-2 are replaced by a subset extracted from another ontology O-1. In the first phase, a subset S-1 is extracted from ontology O-1. Then in the second phase, the concepts in ontology O-2 are replaced by S-1. At the end of the process, the resulting ontology O-2 must still be a valid ontology. A semantic completeness checking also needs to be conducted so that the updated ontology O-2 is complete. A case study based on the Unified Medical Language System ontology from the medical informatics domain is presented. We use a semantic grid environment to build a framework for reusing, extracting and updating an ontology using a SOA. These allow the subset extracted from one ontology, to replace sections of another ontology, using shared resources in the semantic grid environment. A prototype of the framework is built using Web Services and a complexity evaluation measure is presented. The results of several simulations show ontology update in the semantic grid is a viable solution and can be further optimized. Copyright (c) 2012 John Wiley & Sons, Ltd.", "paper_title": "A methodology for ontology update in the semantic grid environment", "paper_id": "WOS:000350293900003"}