{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "numerical_and_computational_aspects"}, {"score": 0.004606023493393774, "phrase": "railway_vehicle_dynamics"}, {"score": 0.004333406378146173, "phrase": "numerical_analyses"}, {"score": 0.004285594361623147, "phrase": "railway_vehicle_dynamical_systems"}, {"score": 0.003668859054928118, "phrase": "numerical_methods"}, {"score": 0.003451517638449501, "phrase": "dynamical_problems"}, {"score": 0.0033384259516301223, "phrase": "ordinary_differential-algebraic_equations"}, {"score": 0.003265090934183249, "phrase": "geometric_constraints"}, {"score": 0.0030376623293574905, "phrase": "dynamical_systems"}, {"score": 0.0027031706928674092, "phrase": "resulting_solutions"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Railway vehicle dynamics", " Stiff systems", " Nonlinear dynamics", " Non-smoothness"], "paper_abstract": "The paper contains a report of the experiences with numerical analyses of railway vehicle dynamical systems, which all are nonlinear, non-smooth and stiff high-dimensional systems. Some results are shown, but the emphasis is on the numerical methods of solution and lessons learned. But for two examples the dynamical problems are formulated as systems of ordinary differential-algebraic equations due to the geometric constraints. The non-smoothnesses have been neglected, smoothened or entered into the dynamical systems as switching boundaries with relations, which govern the continuation of the solutions across these boundaries. We compare the resulting solutions that are found with the three different strategies of handling the non-smoothnesses. Several integrators - both explicit and implicit ones - have been tested and their performances are evaluated and compared with respect to accuracy, and computation time. (C) 2012 IMACS. Published by Elsevier B.V. All rights reserved.", "paper_title": "On the numerical and computational aspects of non-smoothnesses that occur in railway vehicle dynamics", "paper_id": "WOS:000328297300008"}