{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "proving_confluence"}, {"score": 0.004161553532799662, "phrase": "rewrite_rules"}, {"score": 0.0032431667821391044, "phrase": "usual_critical_pairs"}, {"score": 0.0031459887611258765, "phrase": "work_seven_if_the_system_is_not_terminating_modulo_e._we_first_present_confluence_criteria"}, {"score": 0.0029066973917258655, "phrase": "terminating_part"}, {"score": 0.0028541057064952876, "phrase": "possibly_non-terminating_part"}, {"score": 0.002751751956416832, "phrase": "reduction-preserving_completion_procedure"}, {"score": 0.002511600086227215, "phrase": "well-known_knuth-bendix_completion_procedure"}, {"score": 0.002320449502337321, "phrase": "reduction_relation"}, {"score": 0.0021966859554037174, "phrase": "original_system"}, {"score": 0.0021049977753042253, "phrase": "completed_system"}], "paper_keywords": [""], "paper_abstract": "We give a method to prove confluence of term rewriting systems that contain non-terminating rewrite rules such as commutativity and associativity. Usually, confluence of term rewriting systems containing such rules is proved by treating them as equational term rewriting systems and considering E-criticalpairs and/or termination modulo E. In contrast, our method is based solely on usual critical pairs and it also(partially) work seven if the system is not terminating modulo E. We first present confluence criteria for term rewriting systems whose rewrite rules can be partitioned into a terminating part and a possibly non-terminating part. We then give a reduction-preserving completion procedure so that the applicability of the criteria is enhanced. In contrast to the well-known Knuth-Bendix completion procedure which preserves the equivalence relation of the system, our completion procedure preserves the reduction relation of the system, by which confluence of the original system is inferred from that of the completed system.", "paper_title": "A REDUCTION-PRESERVING COMPLETION FOR PROVING CONFLUENCE OF NON-TERMINATING TERM REWRITING SYSTEMS", "paper_id": "WOS:000302505000031"}