{"auto_keywords": [{"score": 0.0430550452141455, "phrase": "ots_scheme"}, {"score": 0.01243516020010475, "phrase": "ordinary_threshold_signature_scheme"}, {"score": 0.011584818962938285, "phrase": "simulation_approach"}, {"score": 0.009720468804605115, "phrase": "simulation_theorem"}, {"score": 0.004534136929881113, "phrase": "distributed_cryptosystem"}, {"score": 0.004035630066743877, "phrase": "large-scaled_distributed_data_storage_systems"}, {"score": 0.003916098498242888, "phrase": "writing_files"}, {"score": 0.0034332736827447654, "phrase": "threshold_signature_scheme"}, {"score": 0.003113441660343867, "phrase": "security_reduction"}, {"score": 0.0027499252661633525, "phrase": "partial_signature_exposure_problems"}, {"score": 0.0022273034991008326, "phrase": "concrete_ots_scheme"}, {"score": 0.0021049977753042253, "phrase": "john_wiley"}], "paper_keywords": ["signature schemes", " threshold signature schemes", " on-line/off-line"], "paper_abstract": "An on-line/off-line threshold signature (OTS) scheme is a distributed cryptosystem in which a group of players jointly generate a signature for a message and use the on-line/off-line technique to improve the efficiency of signing. An OTS scheme can be applied to large-scaled distributed data storage systems and can highly improve the efficiency of writing files. There are two approaches to construct an ordinary threshold signature scheme: the direct approach and the simulation approach. Owing to its simplicity, people tend to use the simulation approach, in which the security of a threshold signature scheme is reduced to the security of its underlying (and simpler) signature scheme. The security proof in this approach is based on a theorem that guarantees the validity of the security reduction-we call this theorem the simulation theorem. However, the simulation theorem (and thus the simulation approach) for an ordinary threshold signature scheme cannot be applied to the on-line/off-line cases, because partial signature exposure problems might occur in these cases. This paper presents a simulation theorem for the on-line/off-line cases, where the security of an OTS scheme is reduced to the security of a so-called divisible on-line/off-line signature scheme. This provides a theoretical basis for constructing an OTS scheme through the simulation approach. Furthermore, through this approach, we present a concrete OTS scheme, which is efficient and its security proof is simple. Copyright (c) 2009 John Wiley & Sons, Ltd.", "paper_title": "How to construct efficient on-line/off-line threshold signature schemes through the simulation approach", "paper_id": "WOS:000268304000006"}