{"auto_keywords": [{"score": 0.04120864339770267, "phrase": "affiliation_information"}, {"score": 0.03136108721143252, "phrase": "name_ambiguation"}, {"score": 0.029420333683948783, "phrase": "name_disambiguation"}, {"score": 0.00481495049065317, "phrase": "scientific_collaboration_and_mobility_cases"}, {"score": 0.00465964893087681, "phrase": "scientific_collaborations"}, {"score": 0.004306968571854912, "phrase": "scientific_mobility"}, {"score": 0.004140726362519362, "phrase": "recursive_reinforced_name"}, {"score": 0.003777261911983744, "phrase": "scientific_collaboration"}, {"score": 0.0036553070575015344, "phrase": "proposed_method"}, {"score": 0.0026148807877309417, "phrase": "evaluation_experiments"}, {"score": 0.002464709648714996, "phrase": "better_performance"}, {"score": 0.0021049977753042253, "phrase": "higher_extent"}], "paper_keywords": ["Author disambiguation", " Scientific collaboration", " Scientific mobility", " Coauthorship", " Affiliation"], "paper_abstract": "Scientists generally do scientific collaborations with one another and sometimes change their affiliations, which leads to scientific mobility. This paper proposes a recursive reinforced name disambiguation method that integrates both coauthorship and affiliation information, especially in cases of scientific collaboration and mobility. The proposed method is evaluated using the dataset from the Thomson Reuters Scientific \"Web of Science\". The probability of recall and precision of the algorithm are then analyzed. To understand the effect of the name ambiguation on the h-index and g-index before and after the name disambiguation, calculations of their distribution are also presented. Evaluation experiments show that using only the affiliation information in the name disambiguation achieves better performance than that using only the coauthorship information; however, our proposed method that integrates both the coauthorship and affiliation information can control the bias in the name ambiguation to a higher extent.", "paper_title": "Author name disambiguation in scientific collaboration and mobility cases", "paper_id": "WOS:000323437400003"}