{"auto_keywords": [{"score": 0.04341289130284682, "phrase": "information_object"}, {"score": 0.00464343008299973, "phrase": "improved_conceptual_framework"}, {"score": 0.004370973501074594, "phrase": "situational_factors"}, {"score": 0.004338457758686519, "phrase": "relevance"}, {"score": 0.0039052752659513652, "phrase": "topic"}, {"score": 0.0038751827491426824, "phrase": "user"}, {"score": 0.003675023529026644, "phrase": "relevance-as-"}, {"score": 0.003487222504700868, "phrase": "agent_a"}, {"score": 0.0032038465090068646, "phrase": "information_need"}, {"score": 0.0030523478413779686, "phrase": "weak_relevance"}, {"score": 0.0029792984108210525, "phrase": "retrieval_tests"}, {"score": 0.0028846035375024014, "phrase": "different_agents"}, {"score": 0.0027816546451972725, "phrase": "conceptualizing_relevance"}, {"score": 0.002504374718975704, "phrase": "relational_nature"}, {"score": 0.0023381630439887184, "phrase": "relationshipfocused_approach"}, {"score": 0.0023099954987126, "phrase": "higher_priority"}], "paper_keywords": ["relevance", " aboutness"], "paper_abstract": "Synthesizing and building on many ideas from the literature, this article presents an improved conceptual framework that clarifies the notion of relevance with its many elements, variables, criteria, and situational factors. Relevance is defined as a Relationship (R) between an Information Object (I) and an Information Need (N) (which consists of Topic, User, Problem/Task, and Situation/ Context) with focus on R. This defines Relevance-as-is (conceptual relevance, strong relevance). To determine relevance, an Agent A (a person or system) operates on a representation I of the information object and a representation N of the information need, resulting in relevance-as-determined (operational measure of relevance, weak relevance, an approximation). Retrieval tests compare relevance-as-determined by different agents. This article discusses and compares two major approaches to conceptualizing relevance: the entityfocused approach (focus on elaborating the entities involved in relevance) and the relationship-focused approach (focus on explicating the relational nature of relevance). The article argues that because relevance is fundamentally a relational construct the relationshipfocused approach deserves a higher priority and more attention than it has received. The article further elaborates on the elements of the framework with a focus on clarifying several critical issues on the discourse on relevance.", "paper_title": "Relevance: An improved framework for explicating the notion", "paper_id": "WOS:000323384600003"}