{"auto_keywords": [{"score": 0.004404994123834589, "phrase": "traditional_production_methods"}, {"score": 0.00416882434439484, "phrase": "remaining_costs"}, {"score": 0.003639835714755229, "phrase": "analysis_and_editing_tasks"}, {"score": 0.003400984514637656, "phrase": "presented_method"}, {"score": 0.003315499339103866, "phrase": "optimization_problem"}, {"score": 0.0031375577552605533, "phrase": "dense_materials"}, {"score": 0.0029067881142952664, "phrase": "significantly_different_densities"}, {"score": 0.002704403349815203, "phrase": "model_balance"}, {"score": 0.0024012441367538455, "phrase": "user_input"}, {"score": 0.0023111922860677672, "phrase": "manufacturing_constraints"}, {"score": 0.0021593396036472777, "phrase": "fused_deposition_modeling_printers"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Rationalization", " 3D printing", " Shape and topology optimization", " Deformable Simplicial Complex method"], "paper_abstract": "3D printing technologies allow for more diverse shapes than are possible with molds and the cost of making just one single object is negligible compared to traditional production methods. However, not all shapes are suitable for 3D print. One of the remaining costs is therefore human time spent on analyzing and editing a shape in order to ensure that it is fit for production. In this paper, we seek to automate one of these analysis and editing tasks, namely improving the balance of a model to ensure that it stands. The presented method is based on solving an optimization problem. This problem is solved by creating cavities of air and distributing dense materials inside the model. Consequently, the surface is not deformed. However, printing materials with significantly different densities is often not possible and adding cavities of air is often not enough to make the model balance. Consequently, in these cases, we will apply a rotation of the object which only deforms the shape a little near the base. No user input is required but it is possible to specify manufacturing constraints related to specific 3D print technologies. Several models have successfully been balanced and printed using both polyjet and fused deposition modeling printers. (C) 2014 Elsevier Ltd. All rights reserved.", "paper_title": "Automatic balancing of 3D models", "paper_id": "WOS:000343625400027"}