{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "user_influence"}, {"score": 0.049734762741514116, "phrase": "user_responsibility"}, {"score": 0.009529243350376474, "phrase": "user_participation"}, {"score": 0.005558321087315275, "phrase": "project_performance"}, {"score": 0.005006440519328348, "phrase": "project_success"}, {"score": 0.004811676833270583, "phrase": "project_managers"}, {"score": 0.004745965928357563, "phrase": "information_system_development_processes"}, {"score": 0.004577777897335174, "phrase": "information_system"}, {"score": 0.004399616575575586, "phrase": "prior_empirical_research"}, {"score": 0.004380784728583447, "phrase": "organizational_technology_learning"}, {"score": 0.004349276314377199, "phrase": "project_control"}, {"score": 0.00425609850797044, "phrase": "project_management_performance"}, {"score": 0.004152725837204292, "phrase": "previous_studies"}, {"score": 0.004063741692442559, "phrase": "particular_components"}, {"score": 0.003392363211686023, "phrase": "direct_positive_influence"}, {"score": 0.003077038060542514, "phrase": "regression_analysis"}, {"score": 0.0029041492019217033, "phrase": "user-developer_interaction"}, {"score": 0.0027310567737368033, "phrase": "positive_effect"}, {"score": 0.0024151333926491878, "phrase": "important_role"}, {"score": 0.0022063469115990715, "phrase": "processes_performance"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["User influence", " User responsibility", " Organizational technology learning", " Project control", " User-developer interaction", " Project performance"], "paper_abstract": "Context: User participation in information system (IS) development has received much research attention. However, prior empirical research regarding the effect of user participation on IS success is inconclusive. This might be because previous studies overlook the effect of the particular components of user participation and other possible mediating factors. Objective: The objective of this study is to empirically examine how user influence and user responsibility affect IS project performance. We inspect whether user influence and user responsibility improve the quality of the IS development process and in turn leads to project success, or if they have a direct positive influence on project success. Method: We conducted a survey of 151 IS project managers in order to understand the impact of user influence and user responsibility on IS project performance. Regression analysis was conducted to assess the relationship among user influence, user responsibility, organizational technology learning, project control, user-developer interaction, and IS project management performance. Results: This study shows that user responsibility and user influence have a positive effect on project performance through the promotion of IS development processes as mediators, including organizational technology learning, project control, and user-IS interaction. Conclusion: Our results suggest that user responsibility and user influence respectively play an important role in indirectly and directly impacting project management performance. Results of the analysis imply that organizations and project managers should use both user participation and user influence to improve processes performance, and in turn, increase project success. (C) 2010 Elsevier B.V. All rights reserved.", "paper_title": "Discriminative effect of user influence and user responsibility on information system development processes and project management", "paper_id": "WOS:000285812700003"}