{"auto_keywords": [{"score": 0.04296486508114672, "phrase": "european_countries"}, {"score": 0.00481495049065317, "phrase": "european_wood_manufacturing_industries"}, {"score": 0.004565007074039171, "phrase": "twofold_purpose"}, {"score": 0.004327981760540394, "phrase": "european_wood_manufacturing_industry"}, {"score": 0.0036100762867678415, "phrase": "diverse_nature"}, {"score": 0.003332332086930163, "phrase": "composite_or_synthetic_index"}, {"score": 0.0032272929113113203, "phrase": "binary_goal_programming_model"}, {"score": 0.002994859407965545, "phrase": "wood_manufacturing_industry"}, {"score": 0.0028543298631502107, "phrase": "second_step"}, {"score": 0.0024842242921857705, "phrase": "composite_indexes"}, {"score": 0.002431699464104896, "phrase": "endogenous_variables"}, {"score": 0.002256435842862802, "phrase": "endogenous_and_exogenous_variables"}, {"score": 0.0021735890994119757, "phrase": "econometric_models"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Goal programming", " Indicators", " Wood manufacturing industry", " Sustainability", " Econometric models"], "paper_abstract": "This paper has a twofold purpose. First, to characterize the sustainability of the European wood manufacturing industry. In this way, a ranking of the European countries analyzed in terms of sustainability is established. To undertake this task the sustainability of each country is defined by using several indicators of diverse nature (economic, environmental and social). These indicators are aggregated into a composite or synthetic index with the help of a binary goal programming model. In this way, a ranking according to the sustainability of the wood manufacturing industry in the European countries studied is obtained. The second step in the research consists of explaining the causes behind the level of sustainability of each country. This task is carried out by taking the composite indexes of sustainability as endogenous variables and a tentative set of economic, environmental and social variables as explanatory variables. The link between endogenous and exogenous variables is made with the help of econometric models. (C) 2012 Elsevier Ltd. All rights reserved.", "paper_title": "Characterization and explanation of the sustainability of the European wood manufacturing industries: A quantitative approach", "paper_id": "WOS:000301025300034"}