{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "functional_data"}, {"score": 0.038829551287483235, "phrase": "k-nearest-neighbor_approach"}, {"score": 0.03783178578266394, "phrase": "feature_selection"}, {"score": 0.00477190623242136, "phrase": "interpretable_feature_selection"}, {"score": 0.004421156723819163, "phrase": "functional_regression"}, {"score": 0.004322967486451877, "phrase": "chemometric_data"}, {"score": 0.00415166680936294, "phrase": "ensemble_method"}, {"score": 0.004041238873048836, "phrase": "automatic_and_interpretable_feature_selection"}, {"score": 0.0033459905006404207, "phrase": "particular_semi-metric"}, {"score": 0.0033011569787033297, "phrase": "specific_curve_feature"}, {"score": 0.003256922225995089, "phrase": "ensemble_member"}, {"score": 0.0031277316566463978, "phrase": "unknown_coefficient"}, {"score": 0.0030171910207671205, "phrase": "proper_scoring_rule"}, {"score": 0.0029901699209266435, "phrase": "implicit_lasso-type_penalty"}, {"score": 0.0024311346712789553, "phrase": "simulation_studies"}, {"score": 0.0023770362063833903, "phrase": "cell_chip"}, {"score": 0.0022218413146898887, "phrase": "especially_the_feature_selection"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Functional classification", " Ensemble method", " Variable selection", " Functional data analysis", " Nearest neighbor method", " Cell chip data"], "paper_abstract": "Functional data becomes increasingly common in many fields of application. Although much research has been done on functional regression and clustering approaches for chemometric data, so far few classification methods exist. This paper introduces an ensemble method for classification that inherently provides automatic and interpretable feature selection. It is designed for single as well as multiple functional (and non-functional) covariates. The ensemble members are posterior probability estimates that are based on a k-nearest-neighbor approach. The ensemble allows for feature selection by including members that are calculated from various semi-metrics used in the k-nearest-neighbor approach, where a particular semi-metric represents a specific curve feature. Each ensemble member, and thus each curve feature, is weighted by an unknown coefficient. These coefficients are estimated using a proper scoring rule with implicit Lasso-type penalty, such that some coefficients can be estimated to be exactly zero. Thus, the ensemble automatically provides feature selection, and also, in the case of multiple functional (and non-functional) covariates, variable selection. The selection performance and the interpretability of the coefficients are investigated in simulation studies. Data of a cell chip used for water quality monitoring experiments is examined. Here, the relevance of especially the feature selection aspect of the ensemble is illustrated. (C) 2015 Elsevier B.V. All rights reserved.", "paper_title": "Nearest neighbor ensembles for functional data with interpretable feature selection", "paper_id": "WOS:000360595100021"}