{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "adaptive_computer_assistant"}, {"score": 0.049146612112995945, "phrase": "health_literacy"}, {"score": 0.022607720169009127, "phrase": "older_adults"}, {"score": 0.018270791466149582, "phrase": "computer_assistant"}, {"score": 0.007088106975995736, "phrase": "normal_and_health-critical_situations"}, {"score": 0.006450695661943525, "phrase": "subjects'_personal_characteristics"}, {"score": 0.004468117364177126, "phrase": "diabetics'_self-care"}, {"score": 0.004312622975366676, "phrase": "acute_treatment"}, {"score": 0.004178935413340453, "phrase": "self-care_activities"}, {"score": 0.0041136473765874815, "phrase": "patient's_electronic_diary"}, {"score": 0.0040176151419992956, "phrase": "context-aware_feedback"}, {"score": 0.003445591238183763, "phrase": "laboratory_experiment"}, {"score": 0.003338690782620756, "phrase": "usability_evaluation"}, {"score": 0.0030374213037172803, "phrase": "educational_value"}, {"score": 0.0029547698888028697, "phrase": "moderating_effects"}, {"score": 0.0027307746993761035, "phrase": "subjects'_knowledge"}, {"score": 0.0026774738852854427, "phrase": "adaptive_assistant"}, {"score": 0.002224510044064184, "phrase": "positive_effect"}, {"score": 0.0021049977753042253, "phrase": "older_diabetics'_self_care"}], "paper_keywords": ["adaptive computer assistance", " self-care", " older adults", " diabetes", " usability evaluation", " smart homes"], "paper_abstract": "Objectives: We developed an adaptive computer assistant for the supervision of diabetics' self-care, to support limiting illness and need for acute treatment and improve health literacy. This assistant monitors self-care activities logged in the patient's electronic diary. Accordingly, it provides context-aware feedback. The objective was to evaluate whether older adults in general can make use of the computer assistant and to compare on adaptive computer assistant with a fixed one, concerning its usability and contribution to health literacy. Methods: We conducted a laboratory experiment in the Georgia Tech Aware Home wherein 28 older adults participated in a usability evaluation of the computer assistant, while engaged in scenarios reflecting normal and health-critical situations. We evaluated the assistant on effectiveness, efficiency, satisfaction, and educational value. Finally, we studied the moderating effects of the subjects' personal characteristics. Results: Logging self-care tasks and receiving feedback from the computer assistant enhanced the subjects' knowledge of diabetes. The adaptive assistant was more effective in dealing with normal and health-critical situations, and, generally, it led to more time efficiency. Subjects' personal characteristics had substantial effects on the effectiveness and efficiency of the two computer assistants. Conclusions: Older adults were able to use the adaptive computer assistant. In addition, it had a positive effect on the development of health literacy. The assistant has the potential to support older diabetics' self care while maintaining quality of life.", "paper_title": "Usability of an adaptive computer assistant that improves self-care and health literacy of older adults", "paper_id": "WOS:000252710800013"}