{"auto_keywords": [{"score": 0.03917269004419755, "phrase": "faulty_shares"}, {"score": 0.013661710726273237, "phrase": "symmetric_polynomial"}, {"score": 0.012800398312291588, "phrase": "common_secret_key"}, {"score": 0.00481495049065317, "phrase": "symmetric_polynomial-based_key_distribution_schemes"}, {"score": 0.004540126719762935, "phrase": "key_distribution"}, {"score": 0.0038323244983352587, "phrase": "secure_communication_channel"}, {"score": 0.0036384794303356413, "phrase": "uncertain_factors"}, {"score": 0.0036008989464331835, "phrase": "communication_environment"}, {"score": 0.003551392586900308, "phrase": "software_failures"}, {"score": 0.0035268943257252224, "phrase": "transmission_errors"}, {"score": 0.003360057874429478, "phrase": "common_secret_keys"}, {"score": 0.0027773810175217273, "phrase": "communication_channels"}, {"score": 0.0025558124513934584, "phrase": "secure_communication_channels"}, {"score": 0.0023356349192255074, "phrase": "valid_shares"}, {"score": 0.0021566930572796935, "phrase": "complicated_cryptographic_operation"}, {"score": 0.0021049977753042253, "phrase": "john_wiley"}], "paper_keywords": ["symmetric polynomial", " key distribution", " verifiable", " identification"], "paper_abstract": "<title content-type=\"main\">ABSTRACT Symmetric polynomial-based key distribution scheme has been widely adopted in various communication applications. This type of key distribution consists of a server and a set of users, where the server is responsible to distribute shares for each user via a symmetric polynomial. Based on the property of symmetry of this polynomial, each pair of users can compute a common secret key using their shares for establishing a secure communication channel. However, some users may receive faulty shares from the server because of some uncertain factors in the communication environment, such as software failures and transmission errors. As a result, the users who receive faulty shares cannot share common secret keys with other users. To solve this problem, in this paper, we propose two individual verifiable key distribution schemes on the basis of a symmetric polynomial based key distribution. In both our proposed schemes, the server adopts the same approach to distribute shares for users; the users are able to verify the validity of their shares without revealing them before establishing communication channels. If all shares are verified valid, users can ensure that each pair of them possesses a common secret key, they can establish secure communication channels when needed; otherwise, all users can collaborate to identify those users who possess faulty shares and require the server to distribute a set of valid shares for those users. Furthermore, both our proposed schemes are efficient, because the procedures of verification and identification do not involve any complicated cryptographic operation. Copyright (c) 2012 John Wiley & Sons, Ltd.", "paper_title": "Verifiable symmetric polynomial-based key distribution schemes", "paper_id": "WOS:000321548600013"}