{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "multidimensional_constructs"}, {"score": 0.005391486854612824, "phrase": "information_systems"}, {"score": 0.004498213310668266, "phrase": "empirical_methods"}, {"score": 0.004326624385772596, "phrase": "substantial_challenges"}, {"score": 0.0035443861412929006, "phrase": "single_set"}, {"score": 0.0033433365160336842, "phrase": "theoretical_reasons"}, {"score": 0.003278878522165815, "phrase": "specific_multidimensional_form"}, {"score": 0.0030628762739398855, "phrase": "research_methods_literature"}, {"score": 0.002751751956416832, "phrase": "structural_models"}, {"score": 0.002545468362709126, "phrase": "increasingly_sophisticated_theoretical_models"}, {"score": 0.002389276641014013, "phrase": "specific_forms"}, {"score": 0.002320449502337321, "phrase": "greater_conceptual_clarity"}, {"score": 0.0021674482571326283, "phrase": "future_research"}, {"score": 0.002125612498781805, "phrase": "empirical_analysis"}, {"score": 0.0021049977753042253, "phrase": "european_journal"}], "paper_keywords": ["aggregate", " multidimensional", " superordinate", " dimension sets"], "paper_abstract": "While information on multidimensional constructs and empirical methods has become more accessible, there remain substantial challenges to theorizing about their form and implications. There are at least two ostensible reasons for such difficulties. First is the issue of terminology; many different terms are currently used to represent the same structural concept, and there is no evidence of standardization taking place around a single set of terms. Second, many studies do not clearly explain the theoretical reasons for choosing the specific multidimensional form of their constructs. To address these deficiencies, we use concepts from the research methods literature, and illustrations from the information systems (IS) literature, to review definitions and issues related to conceptualizing and operationalizing structural models that include multidimensional constructs. Such advice is necessary if we are going to develop and test increasingly sophisticated theoretical models in IS research. We also offer guidelines about how to conceptualize specific forms of multidimensional constructs. By lending greater conceptual clarity to the literature, we believe that this paper provides a foundation for future research incorporating multidimensional constructs in empirical analysis. European Journal of Information Systems (2012) 21, 22-48. doi:10.1057/ejis.2011.10; published online 19 April 2011; corrected online 8 November 2011", "paper_title": "Conceptualizing models using multidimensional constructs: a review and guidelines for their use", "paper_id": "WOS:000298743100003"}