{"auto_keywords": [{"score": 0.049303832954618126, "phrase": "distance_measure"}, {"score": 0.036931545625709446, "phrase": "geneshift"}, {"score": 0.033162283092619864, "phrase": "batch_effect_removal_methods"}, {"score": 0.00481495049065317, "phrase": "microarray_gene_expression_data_based"}, {"score": 0.004584769330512473, "phrase": "microarray_gene_expression"}, {"score": 0.0045549232172858965, "phrase": "mage"}, {"score": 0.004408537640504066, "phrase": "limited_number"}, {"score": 0.004351305527177264, "phrase": "individual_studies"}, {"score": 0.004197703302809062, "phrase": "data_sets"}, {"score": 0.004156757045329242, "phrase": "independent_mage_experiments"}, {"score": 0.003932129823796712, "phrase": "batch_effects"}, {"score": 0.0038181472934630347, "phrase": "random_data_distortion"}, {"score": 0.0037808893362191887, "phrase": "numerical_transformations"}, {"score": 0.0036832960694422765, "phrase": "different_data_sets"}, {"score": 0.0031585736196310726, "phrase": "new_validation_index"}, {"score": 0.0029877254536170017, "phrase": "similar_probability_density_functions"}, {"score": 0.0029200834042804333, "phrase": "geneshift_method"}, {"score": 0.0028076592725295646, "phrase": "batch_effect_removal"}, {"score": 0.002735270929369906, "phrase": "bayes"}, {"score": 0.002587115505155995, "phrase": "complementary_information"}, {"score": 0.002247446386787241, "phrase": "validation_indices"}, {"score": 0.002160862869106241, "phrase": "robust_performances"}, {"score": 0.0021049977753042253, "phrase": "average_ranks"}], "paper_keywords": ["Batch effects", " microarray data integration", " distance measures between probability density functions", " inner product", " density estimation", " integrative analysis of gene expression microarrays", " nonparametric methods"], "paper_abstract": "The potential of microarray gene expression (MAGE) data is only partially explored due to the limited number of samples in individual studies. This limitation can be surmounted by merging or integrating data sets originating from independent MAGE experiments, which are designed to study the same biological problem. However, this process is hindered by batch effects that are study-dependent and result in random data distortion; therefore numerical transformations are needed to render the integration of different data sets accurate and meaningful. Our contribution in this paper is two-fold. First we propose GENESHIFT, a new nonparametric batch effect removal method based on two key elements from statistics: empirical density estimation and the inner product as a distance measure between two probability density functions; second we introduce a new validation index of batch effect removal methods based on the observation that samples from two independent studies drawn from a same population should exhibit similar probability density functions. We evaluated and compared the GENESHIFT method with four other state-of-the-art methods for batch effect removal: Batch-mean centering, empirical Bayes or COMBAT, distance-weighted discrimination, and cross-platform normalization. Several validation indices providing complementary information about the efficiency of batch effect removal methods have been employed in our validation framework. The results show that none of the methods clearly outperforms the others. More than that, most of the methods used for comparison perform very well with respect to some validation indices while performing very poor with respect to others. GENESHIFT exhibits robust performances and its average rank is the highest among the average ranks of all methods used for comparison.", "paper_title": "GENESHIFT: A Nonparametric Approach for Integrating Microarray Gene Expression Data Based on the Inner Product as a Distance Measure between the Distributions of Genes", "paper_id": "WOS:000323504100012"}