{"auto_keywords": [{"score": 0.04507745953588764, "phrase": "cas-peal_face_database"}, {"score": 0.00481507920716798, "phrase": "chinese"}, {"score": 0.0045196012587080114, "phrase": "large-scale_chinese_face_database"}, {"score": 0.004186105377259855, "phrase": "worldwide_researchers"}, {"score": 0.004116913661033223, "phrase": "different_sources"}, {"score": 0.003725042075410585, "phrase": "state-of-the-art_face_recognition_technologies"}, {"score": 0.0036028592508983402, "phrase": "-shelf_imaging_equipment"}, {"score": 0.003555111690239916, "phrase": "normal_face_variations"}, {"score": 0.003438483411236772, "phrase": "large-scale_face_database"}, {"score": 0.003415619374740772, "phrase": "mongolian"}, {"score": 0.003173898798475791, "phrase": "nine_cameras"}, {"score": 0.0031109870010753663, "phrase": "arc_arm"}, {"score": 0.003049318402401662, "phrase": "different_poses"}, {"score": 0.002842920225545139, "phrase": "five_facial_expressions"}, {"score": 0.002824005136794786, "phrase": "six_accessories"}, {"score": 0.0025042115651986332, "phrase": "evaluation_protocol"}, {"score": 0.0022730758011263318, "phrase": "face_recognition_algorithms"}, {"score": 0.0021049977753042253, "phrase": "commonly_used_algorithms"}], "paper_keywords": ["accessory", " evaluation protocol", " expression", " face databases", " face recognition", " lighting", " pose"], "paper_abstract": "In this paper, we describe the acquisition and contents of a large-scale Chinese face database: the CAS-PEAL face database. The goals of creating the CAS-PEAL face database include the following: 1) providing the worldwide researchers of face recognition with different sources of variations, particularly pose, expression, accessories, and lighting (PEAL), and exhaustive ground-truth information in one uniform database; 2) advancing the state-of-the-art face recognition technologies aiming at practical applications by using off-the-shelf imaging equipment and by designing normal face variations in the database; and 3) providing a large-scale face database of Mongolian. Currently, the CAS-PEAL face database contains 99594 images of 1040 individuals (595 males and 445 females). A total of nine cameras are mounted horizontally on an arc arm to simultaneously capture images across different poses. Each subject is asked to look straight ahead, up, and down to obtain 27 images in three shots. Five facial expressions, six accessories, and 15 lighting changes are also included in the database. A selected subset of the database (CAS-PEAL-RI, containing 30863 images of the 1040 subjects) is available to other researchers now. We discuss the evaluation protocol based on the CAS-PEAL-R1 database and present the performance of four algorithms as a baseline to do the following: 1) elementarily assess the difficulty of the database for face recognition algorithms; 2) preference evaluation results for researchers using the database; and 3) identify the strengths and weaknesses of the commonly used algorithms.", "paper_title": "The CAS-PEAL large-scale Chinese face database and baseline evaluations", "paper_id": "WOS:000251974500014"}