{"auto_keywords": [{"score": 0.04927872927155838, "phrase": "low-duty-cycle_networks"}, {"score": 0.00481495049065317, "phrase": "low-duty-cycle_wireless_sensor_networks"}, {"score": 0.004160177106153782, "phrase": "network_lifetime"}, {"score": 0.004090577229368418, "phrase": "excessive_challenges"}, {"score": 0.003845154818609644, "phrase": "short_delay"}, {"score": 0.0036144035798673967, "phrase": "initial_success"}, {"score": 0.003140004304719746, "phrase": "floodin_behaviors"}, {"score": 0.0029681091946289757, "phrase": "low-duty-cycle_sensor_network"}, {"score": 0.0028373742057129126, "phrase": "duty_cycle_length"}, {"score": 0.0027741761880779535, "phrase": "link_loss"}, {"score": 0.002727700630869639, "phrase": "floodin_delay"}, {"score": 0.0026370661343466354, "phrase": "performance_deterioration"}, {"score": 0.002264982416465872, "phrase": "low-duty-cycle_sensor_networks"}, {"score": 0.0021529842700733974, "phrase": "floodin_protocols"}, {"score": 0.0021049977753042253, "phrase": "excellent_performance"}], "paper_keywords": ["Flooding", " low-duty-cycle", " wireless sensor networks"], "paper_abstract": "In low-duty-cycle networks, sensors stay dormant most of time to save their energy and wake up based on their needs. Such a technique, while prolonging the network lifetime, sets excessive challenges for efficien floodin within the network. Tailored for obtaining short delay in low-duty-cycle networks, recently proposed floodin protocols have achieved some initial success. Many fundamental problems of floodin in low-duty-cycle networks, however, are still not well understood. In this paper, we thoroughly investigate how the floodin behaviors are fundamentally affected from theory to practice in a low-duty-cycle sensor network. We study how practical factors like duty cycle length, topology and link loss affect the floodin delay. We mathematically quantify the performance deterioration caused by those factors and present initial learning in achieving efficien floodin against them. Our theoretical analysis brings us not only an in-depth understanding of several fundamental trade-offs in low-duty-cycle sensor networks, but also insights on the design of floodin protocols that can approach excellent performance.", "paper_title": "Understanding the Flooding in Low-Duty-Cycle Wireless Sensor Networks", "paper_id": "WOS:000348010200003"}