{"auto_keywords": [{"score": 0.030094085269933755, "phrase": "implementation_guide"}, {"score": 0.013034635446609485, "phrase": "electronic_laboratory_interfaces"}, {"score": 0.004650086856905758, "phrase": "ambulatory_electronic_health_record_systems"}, {"score": 0.004402295697276237, "phrase": "ambulatory_electronic_health_record"}, {"score": 0.004251500979153001, "phrase": "laboratory_result_data"}, {"score": 0.0041469500929423595, "phrase": "computable_form"}, {"score": 0.0038869467872381957, "phrase": "messaging_standards"}, {"score": 0.0035891316580885665, "phrase": "laboratory_interfaces"}, {"score": 0.0035358770665604657, "phrase": "extensive_optionality"}, {"score": 0.002955050521440921, "phrase": "outpatient_laboratory_results"}, {"score": 0.0029111767710750117, "phrase": "work_group"}, {"score": 0.0028822890425197582, "phrase": "heterogeneous_stakeholders"}, {"score": 0.0027557911038816256, "phrase": "design_principles"}, {"score": 0.002687922713487696, "phrase": "practical_requirements"}, {"score": 0.0026480044868438875, "phrase": "near-term_adoption"}, {"score": 0.0026086775334428617, "phrase": "resulting_implementation_guide"}, {"score": 0.002420611343093316, "phrase": "initial_testing_phase"}, {"score": 0.0022799458141165587, "phrase": "outpatient_laboratory_reporting"}, {"score": 0.0021798257311714665, "phrase": "widespread_adoption"}, {"score": 0.0021049977753042253, "phrase": "ehr_systems"}], "paper_keywords": [""], "paper_abstract": "Electronic laboratory interfaces can significantly increase the value of ambulatory electronic health record (EHR) systems by providing laboratory result data automatically and in a computable form. However, many ambulatory EHRs cannot implement electronic laboratory interfaces despite the existence of messaging standards, Such as Health Level 7, version 2 (HL7). Among several barriers to implementing laboratory interfaces is the extensive optionality,within the HL7 message standard. This paper describes the rationale for and development of an HL7 implementation guide that seeks to eliminate most of the optionality inherent in HL7,7, but retain the information content required for reporting Outpatient laboratory results. A work group Of heterogeneous stakeholders developed the implementation guide based on a set of design principles that emphasized parsimony, practical requirements, and near-term adoption. The resulting implementation guide contains 93% fewer optional data elements than HL7. This guide was successfully implemented by 15 organizations during an initial testing phase and has been approved by the HL7 standards body is an implementation guide for outpatient laboratory reporting. Further testing is required to determine whether widespread adoption of the implementation guide by laboratories and EHR systems can facilitate the implementation of electronic laboratory interfaces. J Am Med Inform Assoc. 2009;16:285-290. DOI 10.1197/jamia.M2610", "paper_title": "The Development of a Highly Constrained Health Level 7 Implementation Guide to Facilitate Electronic Laboratory Reporting to Ambulatory Electronic Health Record Systems", "paper_id": "WOS:000266172600007"}