{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "linear_programming_problems"}, {"score": 0.015435256974963694, "phrase": "randomness_environment"}, {"score": 0.015294933297733172, "phrase": "attainment_values"}, {"score": 0.01467886410743076, "phrase": "hop's_paper"}, {"score": 0.004472146692254812, "phrase": "inn._hop"}, {"score": 0.0042506731642425275, "phrase": "information_sciences"}, {"score": 0.0040215052006051235, "phrase": "fuzziness_and_randomness_environments"}, {"score": 0.003984588086223188, "phrase": "hop"}, {"score": 0.003929689573550262, "phrase": "new_characterization"}, {"score": 0.003358368814209542, "phrase": "hop's_analytical_work"}, {"score": 0.0031625006830124512, "phrase": "hop's_analysis"}, {"score": 0.0030617935728586006, "phrase": "solution-finding_mechanism"}, {"score": 0.0028698706191651155, "phrase": "superior_performance"}, {"score": 0.0027528751037412128, "phrase": "relevant_and_inevitable_theoretical_essentials"}, {"score": 0.002164264600379492, "phrase": "correct_optimal_solutions"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Fuzzy linear programming", " Fuzzy stochastic linear programming", " Fuzzy number", " Attainment values", " Attainment index"], "paper_abstract": "This paper is an amendment to Hop's paper INN. Hop, Solving linear programming problems under fuzziness and randomness environment using attainment values, Information Sciences 177 (2007) 2971-2984], in solving linear programming problems under fuzziness and randomness environments. Hop introduced a new characterization of relationship, attainment values, to enable the conversion of fuzzy (stochastic) linear programming models into corresponding deterministic linear programming models. The purpose of this paper is to provide a correction and an improvement of Hop's analytical work through rationalization and simplification. More importantly, it is shown that Hop's analysis does not support his demonstration or the solution-finding mechanism; the attainment values approach as he had proposed does not result in superior performance as compared to other existing approaches because it neglects some relevant and inevitable theoretical essentials. Two numerical examples from Hop's paper are also employed to show that his approach, in the conversion of fuzzy (stochastic) linear programming problems to corresponding problems, is questionable and can neither find the maximum nor the minimum in the examples. The models of the examples are subsequently amended in order to derive the correct optimal solutions. (C) 2009 Elsevier Inc. All rights reserved.", "paper_title": "A note on \"Solving linear programming problems under fuzziness and randomness environment using attainment values\"", "paper_id": "WOS:000271353900010"}