{"auto_keywords": [{"score": 0.03736237179323398, "phrase": "eeg_data"}, {"score": 0.03345953020235005, "phrase": "single-trial_classification"}, {"score": 0.00481495049065317, "phrase": "single-trial_eeg_classification_of_artifacts"}, {"score": 0.004344424495876066, "phrase": "perceptual_quality"}, {"score": 0.004172360444377281, "phrase": "emerging_interest"}, {"score": 0.004081385289516914, "phrase": "image_quality_assessment"}, {"score": 0.004007083686875716, "phrase": "main_impediments"}, {"score": 0.0037231102027070724, "phrase": "neural_responses"}, {"score": 0.0036418947847496365, "phrase": "event-related_potentials"}, {"score": 0.0033961782274326948, "phrase": "large_number"}, {"score": 0.003309877074892399, "phrase": "meaningful_data"}, {"score": 0.003109280367693954, "phrase": "novel_wavelet-based_approach"}, {"score": 0.003075251627365809, "phrase": "eeg"}, {"score": 0.002985988377995789, "phrase": "perceived_image_quality"}, {"score": 0.0023507916951658455, "phrase": "exact_type"}, {"score": 0.00224094835951312, "phrase": "human_visual_system"}, {"score": 0.002216336059488137, "phrase": "different_types"}, {"score": 0.0021049977753042253, "phrase": "typical_image-based_rendering_artifacts"}], "paper_keywords": ["Human Factors", " Perception", " rendering", " perception of rendering artifacts", " EEG", " SVM", " wavelets", " human visual system"], "paper_abstract": "In this article we use an ElectroEncephaloGraph (EEG) to explore the perception of artifacts that typically appear during rendering and determine the perceptual quality of a sequence of images. Although there is an emerging interest in using an EEG for image quality assessment, one of the main impediments to the use of an EEG is the very low Signal-to-Noise Ratio (SNR) which makes it exceedingly difficult to distinguish neural responses from noise. Traditionally, event-related potentials have been used for analysis of EEG data. However, they rely on averaging and so require a large number of participants and trials to get meaningful data. Also, due the the low SNR ERP's are not suited for single-trial classification. We propose a novel wavelet-based approach for evaluating EEG signals which allows us to predict the perceived image quality from only a single trial. Our wavelet-based algorithm is able to filter the EEG data and remove noise, eliminating the need for many participants or many trials. With this approach it is possible to use data from only 10 electrode channels for single-trial classification and predict the presence of an artifact with an accuracy of 85%. We also show that it is possible to differentiate and classify a trial based on the exact type of artifact viewed. Our work is particularly useful for understanding how the human visual system responds to different types of degradations in images and videos. An understanding of the perception of typical image-based rendering artifacts forms the basis for the optimization of rendering and masking algorithms.", "paper_title": "Single-Trial EEG Classification of Artifacts in Videos", "paper_id": "WOS:000307171700003"}