{"auto_keywords": [{"score": 0.0366784386253254, "phrase": "tasc"}, {"score": 0.00481495049065317, "phrase": "multimodal_video_copy_detection"}, {"score": 0.00461246494886034, "phrase": "complicated_audiovisual_transformations"}, {"score": 0.004566954456805558, "phrase": "large-scale_video_database"}, {"score": 0.004176961840039024, "phrase": "query_videos"}, {"score": 0.004027751272984522, "phrase": "transformation-aware_chain"}, {"score": 0.003948613642680196, "phrase": "cascade_structure"}, {"score": 0.003871024872459116, "phrase": "efficient_but_simple_detectors"}, {"score": 0.0037699306119313154, "phrase": "effective_but_complex_detectors"}, {"score": 0.0035402494307399733, "phrase": "copy-units_mechanism"}, {"score": 0.0034024277222012597, "phrase": "copy_detection"}, {"score": 0.003091036449708673, "phrase": "cu_search_algorithm"}, {"score": 0.0029805015010906013, "phrase": "cu-based_localization_algorithm"}, {"score": 0.0029412916164128925, "phrase": "precise_locations"}, {"score": 0.0028739078688746374, "phrase": "asserted_cus"}, {"score": 0.002671990515821213, "phrase": "feature_space"}, {"score": 0.0026107601878587816, "phrase": "flexible_strategy"}, {"score": 0.0025257081555100556, "phrase": "single_threshold_strategy"}, {"score": 0.002387415084371473, "phrase": "easy-to-judge_copies"}, {"score": 0.0023019834179097607, "phrase": "nonlinear_classifier"}, {"score": 0.0022122603123901114, "phrase": "extensive_experiments"}, {"score": 0.002147265537489893, "phrase": "excellent_copy_detection_accuracy"}], "paper_keywords": ["Algorithms", " Experimentation", " Security", " Video copy detection", " multimodal features", " transformation-aware soft cascading", " copy units", " soft decision boundary"], "paper_abstract": "How to precisely and efficiently detect near-duplicate copies with complicated audiovisual transformations from a large-scale video database is a challenging task. To cope with this challenge, this article proposes a transformation-aware soft cascading (TASC) approach for multimodal video copy detection. Basically, our approach divides query videos into some categories and then for each category designs a transformation-aware chain to organize several detectors in a cascade structure. In each chain, efficient but simple detectors are placed in the forepart, whereas effective but complex detectors are located in the rear. To judge whether two videos are near-duplicates, a Detection-on-Copy-Units mechanism is introduced in the TASC, which makes the decision of copy detection depending on the similarity between their most similar fractions, called copy units (CUs), rather than the video-level similarity. Following this, we propose a CU search algorithm to find a pair of CUs from two videos and a CU-based localization algorithm to find the precise locations of their copy segments that are with the asserted CUs as the center. Moreover, to address the problem that the copies and noncopies are possibly linearly inseparable in the feature space, the TASC also introduces a flexible strategy, called soft decision boundary, to replace the single threshold strategy for each detector. Its basic idea is to automatically learn two thresholds for each detector to examine the easy-to-judge copies and noncopies, respectively, and meanwhile to train a nonlinear classifier to further check those hard-to-judge ones. Extensive experiments on three benchmark datasets showed that the TASC can achieve excellent copy detection accuracy and localization precision with a very high processing efficiency.", "paper_title": "TASC: A Transformation-Aware Soft Cascading Approach for Multimodal Video Copy Detection", "paper_id": "WOS:000351440200003"}