{"auto_keywords": [{"score": 0.0463113554314393, "phrase": "business_cybernetics"}, {"score": 0.00833666519523461, "phrase": "business_practice"}, {"score": 0.008060241035745255, "phrase": "qualitative_analysis"}, {"score": 0.00481495049065317, "phrase": "holistical_perception"}, {"score": 0.004747544039399003, "phrase": "business_ethics"}, {"score": 0.004576650486542461, "phrase": "new_requisitely_holistic_definition"}, {"score": 0.0044619403653966645, "phrase": "crucial_component"}, {"score": 0.004374704085463403, "phrase": "present_contribution"}, {"score": 0.004337838898735768, "phrase": "basic_problem"}, {"score": 0.00407678138571414, "phrase": "requisite_holism"}, {"score": 0.003985781820570781, "phrase": "business_reality"}, {"score": 0.003490586026139388, "phrase": "dialectical_systems_theory"}, {"score": 0.003431952055664272, "phrase": "findings_-_ethics"}, {"score": 0.003403004190606271, "phrase": "crucial_emotional_part"}, {"score": 0.0033838409302249842, "phrase": "human_attributes"}, {"score": 0.0033082574030101467, "phrase": "subjective_part"}, {"score": 0.0032803494445914944, "phrase": "starting_points"}, {"score": 0.003135422638024283, "phrase": "crucial_role"}, {"score": 0.0024590770730682377, "phrase": "desk_research"}, {"score": 0.0024452162861064524, "phrase": "practical_experience"}, {"score": 0.002323924542900662, "phrase": "requisitely_holistic_approach"}, {"score": 0.0023043010697170246, "phrase": "requisite_wholeness"}, {"score": 0.00221488852092224, "phrase": "business_systems"}, {"score": 0.0021229275892217583, "phrase": "main-stream_literature"}, {"score": 0.0021049977753042253, "phrase": "new_perception"}], "paper_keywords": ["Ethics", " Business ethics", " Qualitative research"], "paper_abstract": "Purpose - The purpose of this paper is to offer a new requisitely holistic definition of business ethics (BE) as a crucial component of business cybernetics and practice. The present contribution considers a basic problem: how humans use BE to influence their business processes. Therefore, business is/should be investigated from the viewpoint of ethics. Requisite holism of understanding and consideration of BE in business reality is unavoidable; it can (and must) result from findings and considerations of the interdependence between business practice, ethics, and BE. Design/methodology/approach - In this paper, qualitative analysis is applied on the basis of the cybernetics (e.g. especially business cybernetics), dialectical systems theory, and ethics theory. Findings - Ethics is a crucial emotional part of human attributes. They can be viewed as the subjective part of the starting points of any human acting/behavior process, including business. Thus, ethics (may) have/has a crucial role in business cybernetics and practice as BE. Tc clarify and beneficially use BE, one must understand relations between business cybernetics and BE, between business practice and BE, and understand the diversity of content of BE in literature, etc. On this base offered here is an understanding of BE, a definition of the content of BE as a specific type/part of ethics, and a view at source of BE content. Research limitations/implications - Content of BE. Research is limited to hypothesis and qualitative analysis in desk research. Practical experience is considered implicitly. Practical implications - This is a step toward development of business cybernetics with a requisitely holistic approach founded on requisite wholeness of insight. A more specifically created and target-oriented approach to cybernetic understanding and research of BE of business systems is encouraged. Originality/value - This paper presents a very new approach, rarely found in main-stream literature; a new perception and definition of content of BE.", "paper_title": "Toward a holistical perception of the content of business ethics", "paper_id": "WOS:000267416500035"}