{"auto_keywords": [{"score": 0.028457034251906058, "phrase": "xpot"}, {"score": 0.008815452801988548, "phrase": "eni"}, {"score": 0.006419605881759983, "phrase": "nuclear_state"}, {"score": 0.006372917848825885, "phrase": "cytoplasmic_state"}, {"score": 0.006234868462873753, "phrase": "predicted_pathway"}, {"score": 0.00481495049065317, "phrase": "elastic_network_model"}, {"score": 0.004779876533667754, "phrase": "nucleocytoplasmic_transport"}, {"score": 0.004745056850725867, "phrase": "eukaryotic_cells"}, {"score": 0.004574709094672837, "phrase": "active_area"}, {"score": 0.004459101239560164, "phrase": "precise_mechanism"}, {"score": 0.004039792863335641, "phrase": "elastic_network"}, {"score": 0.0036731870109004993, "phrase": "good_agreement"}, {"score": 0.0035934073774126856, "phrase": "molecular_dynamics_simulation"}, {"score": 0.0033890026927890058, "phrase": "ring_closure"}, {"score": 0.0031728680535262083, "phrase": "largest_values_of_root_mean_square_deviation"}, {"score": 0.002613056713968863, "phrase": "transporting_mechanism"}, {"score": 0.002565626044684815, "phrase": "dominant_mode"}, {"score": 0.002315452777999619, "phrase": "flexible_regions"}, {"score": 0.0022734117274137468, "phrase": "time-efficient_computational_approach"}, {"score": 0.0021597049163247476, "phrase": "tested_exportins"}, {"score": 0.0021049977753042253, "phrase": "biological_function"}], "paper_keywords": ["Elastic network model", " Exportin", " Karyopherin", " Nucleocytoplasmic transport"], "paper_abstract": "Nucleocytoplasmic transport in eukaryotic cells involves many interactions between macromolecules, and has been an active area for many researchers. However, the precise mechanism still evades us and more efforts are needed to better understand it. In this study, the authors investigated exportins (Cse1p and Xpot) by elastic network interpolation (ENI) and elastic network based normal mode analysis (EN-NMA). Results of the study on Cse1p were in good agreement with the results obtained by molecular dynamics simulation in another study but with the benefit of time-efficiency. First, a formation of ring closure obtained by ENI was observed. Second, HEAT 1 to 3 and HEAT 14 to 17 had the largest values of root mean square deviation (RMSD) which indicated the flexibility of Cse1p during the transition. In the case of Xpot, a possible pathway from nuclear state to cytoplasmic state was shown, and the predicted pathway was also quantitatively analyzed in terms of RMSD. The results suggested two flexible regions of Xpot that might be important to the transporting mechanism. Moreover, the dominant mode of Xpot in the nuclear state obtained by EN-NMA not only showed the tendency to match the predicted pathway to the cytoplasmic state of Xpot, but also displayed the flexible regions of Xpot. A time-efficient computational approach was presented in this paper and the results indicated that the flexibility of tested exportins might be required to perform the biological function of transporting cargos.", "paper_title": "Flexibility of the exportins Cse1p and Xpot depicted by elastic network model", "paper_id": "WOS:000292290600020"}