{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "protein_function"}, {"score": 0.004122351497440992, "phrase": "protein_engineering"}, {"score": 0.004076858589744185, "phrase": "drug_development"}, {"score": 0.004031865694174726, "phrase": "protein_design"}, {"score": 0.003987367359722647, "phrase": "genome_sequence_analysis"}, {"score": 0.0038998328617557013, "phrase": "high-throughput_sequencing"}, {"score": 0.003751228706861377, "phrase": "protein_activity"}, {"score": 0.003628352506247126, "phrase": "large_numbers"}, {"score": 0.003265090934183249, "phrase": "unique_variants"}, {"score": 0.003123203316511694, "phrase": "high-throughput_sequencing_datasets"}, {"score": 0.0030376623293574905, "phrase": "sequencing_errors"}, {"score": 0.0026881926384093088, "phrase": "enrichment_ratio"}, {"score": 0.00251478366610296, "phrase": "interactive_interface"}, {"score": 0.002418829014435841, "phrase": "user-accessible_output"}, {"score": 0.0021049977753042253, "phrase": "sequence-function_relationships"}], "paper_keywords": [""], "paper_abstract": "Measuring the consequences of mutation in proteins is critical to understanding their function. These measurements are essential in such applications as protein engineering, drug development, protein design and genome sequence analysis. Recently, high-throughput sequencing has been coupled to assays of protein activity, enabling the analysis of large numbers of mutations in parallel. We present Enrich, a tool for analyzing such deep mutational scanning data. Enrich identifies all unique variants ( mutants) of a protein in high-throughput sequencing datasets and can correct for sequencing errors using overlapping paired-end reads. Enrich uses the frequency of each variant before and after selection to calculate an enrichment ratio, which is used to estimate fitness. Enrich provides an interactive interface to guide users. It generates user-accessible output for downstream analyses as well as several visualizations of the effects of mutation on function, thereby allowing the user to rapidly quantify and comprehend sequence-function relationships.", "paper_title": "Enrich: software for analysis of protein function by enrichment and depletion of variants", "paper_id": "WOS:000297860000017"}