{"auto_keywords": [{"score": 0.039842104713714015, "phrase": "ts"}, {"score": 0.012750166376937702, "phrase": "semantic_qa"}, {"score": 0.00481495049065317, "phrase": "text_summarization_contribution"}, {"score": 0.00451043437607004, "phrase": "efficient_tools"}, {"score": 0.0037072310568610723, "phrase": "web-based_semantic_qa_system"}, {"score": 0.003636605792981828, "phrase": "main_goal"}, {"score": 0.003485913728272778, "phrase": "semantic_qa_approaches"}, {"score": 0.0033932753847910366, "phrase": "search_engine_snippets"}, {"score": 0.002977061391551628, "phrase": "qa_task"}, {"score": 0.002875678729214611, "phrase": "short_and_long_summaries"}, {"score": 0.0025130941721410558, "phrase": "qf_summarization"}, {"score": 0.002446245096967702, "phrase": "short_summaries"}, {"score": 0.0021049977753042253, "phrase": "wiley_periodicals"}], "paper_keywords": [""], "paper_abstract": "As the Internet grows, it becomes essential to find efficient tools to deal with all the available information. Question answering (QA) and text summarization (TS) research fields focus on presenting the information requested by users in a more concise way. In this paper, the appropriateness and benefits of using summaries in semantic QA are analyzed. For this purpose, a combined approach where a TS component is integrated into a Web-based semantic QA system is developed. The main goal of this paper is to determine to what extent TS can help semantic QA approaches, when using summaries instead of search engine snippets as the corpus for answering questions. In particular, three issues are analyzed: (i) the appropriateness of query-focused (QF) summarization rather than generic summarization for the QA task, (ii) the suitable length comparing short and long summaries, and (iii) the benefits of using TS instead of snippets for finding the answers, tested within two semantic QA approaches (named entities and semantic roles). The results obtained show that QF summarization is better than generic (58% improvement), short summaries are better than long (6.3% improvement), and the use of TS within semantic QA improves the performance for both named-entity-based (10%) and, especially, semantic-role-based QA (47.5%). (C) 2011 Wiley Periodicals, Inc.", "paper_title": "Text Summarization Contribution to Semantic Question Answering: New Approaches for Finding Answers on the Web", "paper_id": "WOS:000296706900001"}