{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "goal_direction"}, {"score": 0.008630784547633413, "phrase": "cooperative_transport"}, {"score": 0.004501774379030109, "phrase": "heavy_object"}, {"score": 0.0041287394089001405, "phrase": "partial_and_noisy_knowledge"}, {"score": 0.0030642636185693054, "phrase": "bio-inspired_mechanism"}, {"score": 0.0025521085778978042, "phrase": "efficient_coordination"}, {"score": 0.0023066880707738736, "phrase": "significant_noise"}, {"score": 0.002273605493468005, "phrase": "robots'_communication"}, {"score": 0.0022302306304023602, "phrase": "effective_cooperative_transport"}, {"score": 0.0021049977753042253, "phrase": "interesting_properties"}], "paper_keywords": [""], "paper_abstract": "In this paper, we study the cooperative transport of a heavy object by a group of robots towards a goal. We investigate the case in which robots have partial and noisy knowledge of the goal direction and can not perceive the goal itself. The robots have to coordinate their motion to apply enough force on the object to move it. Furthermore, the robots should share knowledge in order to collectively improve their estimate of the goal direction and transport the object as fast and as accurately as possible towards the goal. We propose a bio-inspired mechanism of negotiation of direction that is fully distributed. Four different strategies are implemented and their performances are compared on a group of four real robots, varying the goal direction and the level of noise. We identify a strategy that enables efficient coordination of motion of the robots. Moreover, this strategy lets the robots improve their knowledge of the goal direction. Despite significant noise in the robots' communication, we achieve effective cooperative transport towards the goal and observe that the negotiation of direction entails interesting properties of robustness.", "paper_title": "Negotiation of goal direction for cooperative transport", "paper_id": "WOS:000241466100017"}