{"auto_keywords": [{"score": 0.04925795561529137, "phrase": "p_systems"}, {"score": 0.034280582196135646, "phrase": "deterministic_version"}, {"score": 0.03356839835745583, "phrase": "nondeterministic_version"}, {"score": 0.008447388378535746, "phrase": "next_configuration"}, {"score": 0.00481495049065317, "phrase": "deterministic_p_systems"}, {"score": 0.004492950096237056, "phrase": "standard_semantics"}, {"score": 0.004396790930873782, "phrase": "evolution_step"}, {"score": 0.004228839109569368, "phrase": "maximally_parallel_manner"}, {"score": 0.004102639724186862, "phrase": "maximal_multiset"}, {"score": 0.003894963476923956, "phrase": "current_configuration"}, {"score": 0.0034204548167213545, "phrase": "unique_maximally_parallel_multiset"}, {"score": 0.00308269056870936, "phrase": "interesting_and_fundamental_research_issue"}, {"score": 0.0027422968723193057, "phrase": "recent_results"}, {"score": 0.0026951616152303373, "phrase": "open_problems"}, {"score": 0.002169882514603539, "phrase": "long-standing_open_problem"}, {"score": 0.0021418339161425994, "phrase": "deterministic_linear-bounded_automata"}, {"score": 0.0021049977753042253, "phrase": "nondeterministic_linear-bounded_automata"}], "paper_keywords": [""], "paper_abstract": "We consider P systems that are used as acceptors (recognizers). In the standard semantics of P systems, each evolution step is a result of applying all the rules in a maximally parallel manner: at each step, a maximal multiset of rules are nondeterministically selected and applied in parallel to the current configuration to derive the next configuration (thus, the next configuration is not unique, in general). The system is deterministic if at each step, there is a UNIQUE maximally parallel multiset of rules applicable. The question of whether or not the deterministic version is weaker than the nondeterministic version for various models of P systems is an interesting and fundamental research issue in membrane computing. Here, we look at three popular models of P systems - catalytic systems, symport/antiport systems, and communicating P systems. We report on recent results that answer some open problems in the field. The results are of the following forms: 1. The deterministic version is weaker than the nondeterministic version. 2. The deterministic version is as powerful as the nondeterministic version. 3. The question of whether the deterministic version is weaker than the nondeterministic version is equivalent to the long-standing open problem of whether deterministic linear-bounded automata are weaker than nondeterministic linear-bounded automata.", "paper_title": "Some recent results concerning deterministic P systems", "paper_id": "WOS:000235807300003"}