{"auto_keywords": [{"score": 0.03540894775235876, "phrase": "atm_core_network"}, {"score": 0.00481495049065317, "phrase": "fast_setup"}, {"score": 0.00423118169200579, "phrase": "intelligent_core_networks"}, {"score": 0.003821342577980031, "phrase": "increasing_internet_traffic_demands"}, {"score": 0.003776674472150248, "phrase": "current_context"}, {"score": 0.003589046900483573, "phrase": "required_quality_of_service"}, {"score": 0.0033183768001722245, "phrase": "mpls"}, {"score": 0.003241203549050267, "phrase": "traffic_engineering"}, {"score": 0.003203294948113915, "phrase": "ip_networks"}, {"score": 0.003153438637547112, "phrase": "pnni"}, {"score": 0.0030680392468327147, "phrase": "core_network"}, {"score": 0.0026327757304477665, "phrase": "fast_end"}, {"score": 0.0025215486544004134, "phrase": "network_backbone_control_plane"}, {"score": 0.002424506147893058, "phrase": "qos_network_state_information"}, {"score": 0.0022769287097263564, "phrase": "source_routing"}, {"score": 0.002197891020396052, "phrase": "existing_methods"}, {"score": 0.0021551702945512494, "phrase": "blocking_probability"}, {"score": 0.0021049977753042253, "phrase": "available_resource_information"}], "paper_keywords": ["IP/MPLS", " ATM", " PNNI"], "paper_abstract": "Transport networks are currently being moved towards a model of high performance Internet Protocol/Multiprotocol Label Switching (IP/MPLS) routers interconnected through intelligent core networks. Currently, Asynchronous Transfer Mode (ATM) technology has been widely deployed in several network backbones along with the Private Network-to-Network Interface (PNNI) protocols as the control plane. In order to cope with the increasing Internet traffic demands in the current context, fast setup of end-to-end paths with the required Quality of Service (QoS) is necessary. This paper analyzes the case of two IP/MPLS networks interconnected through an ATM core network, assuming MPLS as the mechanism to provide Traffic Engineering in the IP networks, and a PNNI-based control plane in the core network. This paper aims to define a mechanism needed to set up a fast end-to-end QoS Label Switched Path (LSP) between two Label Switched Routers (LSRs) belonging to different lP/MPLS domains. First, the fast end-to-end setup is achieved by modifying the network backbone control plane. Second, two different aggregation schemes are proposed to summarize the QoS network state information to be transported through the ATM core network. Therefore, both the efficient aggregation schemes and the fast mechanism allow source routing to set up a path faster than the existing methods and to reduce the blocking probability using a summary of the available resource information. (c) 2006 Elsevier B.V. All rights reserved.", "paper_title": "Fast setup of end-to-end paths for bandwidth constrained applications in an IP/MPLS-ATM integrated environment", "paper_id": "WOS:000243156000018"}