{"auto_keywords": [{"score": 0.0407769748728513, "phrase": "tam"}, {"score": 0.015097810012204718, "phrase": "health_care"}, {"score": 0.011725369243388479, "phrase": "health_it"}, {"score": 0.00457553517865013, "phrase": "increasing_interest"}, {"score": 0.004529093447865156, "phrase": "end_users'_reactions"}, {"score": 0.004483120978156604, "phrase": "health_information_technology"}, {"score": 0.004174064076143015, "phrase": "health_it_acceptance"}, {"score": 0.003545024951402821, "phrase": "patient_care"}, {"score": 0.0033685408148574846, "phrase": "health_its"}, {"score": 0.0028170314398963704, "phrase": "substantial_portion"}, {"score": 0.0025174594088331853, "phrase": "improved_study_quality"}, {"score": 0.0022041312401435346, "phrase": "health_care_context"}, {"score": 0.0021705796895687864, "phrase": "beliefs_elicitation_methods"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Technology use", " Behavior", " Health information technology", " Technology Acceptance Model"], "paper_abstract": "Increasing interest in end users' reactions to health information technology (IT) has elevated the importance of theories that predict and explain health IT acceptance and use. This paper reviews the application of one such theory, the Technology Acceptance Model (TAM), to health care. We reviewed 16 data sets analyzed in over 20 studies of clinicians using health IT for patient care. Studies differed greatly in samples and settings, health ITs studied, research models, relationships tested, and construct operationalization. Certain TAM relationships were consistently found to be significant, whereas others were inconsistent. Several key relationships were infrequently assessed. Findings show that TAM predicts a substantial portion of the use or acceptance of health IT, but that the theory may benefit from several additions and modifications. Aside from improved study quality, standardization, and theoretically motivated additions to the model, an important future direction for TAM is to adapt the model specifically to the health care context, using beliefs elicitation methods. (C) 2009 Elsevier Inc. All rights reserved.", "paper_title": "The Technology Acceptance Model: Its past and its future in health care", "paper_id": "WOS:000274309800017"}