{"auto_keywords": [{"score": 0.031021899607623825, "phrase": "business_rules"}, {"score": 0.01430626884996604, "phrase": "business_process"}, {"score": 0.010959531083007817, "phrase": "event-driven_programming"}, {"score": 0.008192733434715365, "phrase": "cep"}, {"score": 0.004333208536635007, "phrase": "companies_operations"}, {"score": 0.004231249907249981, "phrase": "explicit_specification"}, {"score": 0.0042025601346464365, "phrase": "tasks'_execution_flow"}, {"score": 0.004075834722188658, "phrase": "tasks'_execution"}, {"score": 0.004007083686875716, "phrase": "great_deal"}, {"score": 0.003939487754302632, "phrase": "process_execution"}, {"score": 0.003807684498435389, "phrase": "execution_flow"}, {"score": 0.0032668821950788502, "phrase": "program_control-flow"}, {"score": 0.003010496595090984, "phrase": "event-driven_paradigm"}, {"score": 0.002755338691613447, "phrase": "ad-hoc_and_unstructured_manner"}, {"score": 0.0026002844796442818, "phrase": "natural_language"}, {"score": 0.0025738397248551217, "phrase": "concrete_implementation"}, {"score": 0.0025131738347596586, "phrase": "complex_event_processing"}, {"score": 0.002292243761395491, "phrase": "active_participation"}, {"score": 0.0022766712610014484, "phrase": "business_people"}, {"score": 0.002230584233627327, "phrase": "refinement_process"}], "paper_keywords": ["Business rules", " complex event processing", " business process", " event driven"], "paper_abstract": "According to the Object Management Group, a rule is a proposition that is a claim of obligation or of necessity. The concept of rule is usually employed in the context of business process to manage companies operations. While a work-flow is an explicit specification of tasks' execution flow, business rules only impose restrictions on the tasks' execution. This provides a great deal of flexibility for the process execution, since the stakeholders are free to choose an execution flow which does not violate the rules. The execution of a task in a process can be seen as the occurrence of an event, which may enable/disable the execution of some other tasks in the process. Event-driven programming is a paradigm in which the program control-flow is determined by the occurrence of events. The capacity to handle processes that are unpredictably non-linear and dynamic makes the event-driven paradigm an effective solution for the implementation of business rules. However, the connection between the business rules and their implementation through event-driven programming has been made in an ad-hoc and unstructured manner. This paper proposes a methodology to tackle such a problem by systematically moving from business rules described in natural language toward a concrete implementation of a business process. We use complex event processing (CEP) to implement the process. CEP relies on the event driven paradigm for monitoring and processing events. The methodology allows for the active participation of business people at all stages of the refinement process. Throughout the paper, we show how our methodology was employed to implement the operations of the World Bank.", "paper_title": "REDUCING THE GAP BETWEEN BUSINESS AND INFORMATION SYSTEMS THROUGH COMPLEX EVENT PROCESSING", "paper_id": "WOS:000319490600001"}