{"auto_keywords": [{"score": 0.046166196857162826, "phrase": "embedding_order_list"}, {"score": 0.04372141121427532, "phrase": "order_pair"}, {"score": 0.040442279730797476, "phrase": "message_embedding"}, {"score": 0.004718431349852634, "phrase": "effective_message"}, {"score": 0.004549524321051407, "phrase": "unit_length"}, {"score": 0.00436890075128947, "phrase": "embedding_index_list"}, {"score": 0.004012500850311087, "phrase": "secret_message"}, {"score": 0.003964007795174772, "phrase": "index_pair"}, {"score": 0.003495855671790616, "phrase": "slight_perturbation"}, {"score": 0.003223494720348768, "phrase": "high_embedding_capacity"}, {"score": 0.003120568497402472, "phrase": "point_cloud_models"}, {"score": 0.0029482691362918423, "phrase": "black-and-white_image"}, {"score": 0.002831037222426215, "phrase": "covert_communication"}, {"score": 0.002796782643988021, "phrase": "capacity_magnitude"}, {"score": 0.0025892330566358503, "phrase": "model_distortion"}, {"score": 0.0021745003291048356, "phrase": "original_point_cloud_model"}], "paper_keywords": ["Message embedding", " 3D models", " quantization", " information hiding", " steganography"], "paper_abstract": "We present an effective message embedding scheme for 3D models. We propose the unit length as the quantizer to generate an embedding order list and an embedding index list. Our scheme considers every two elements in the embedding order list as the order pair, and we embed 3 bits of 0 or 1 secret message into the index pair associated with the order pair. The message embedding is effective requiring, at most, adding 1 to, or subtracting 1 from, the index pair. This reflects a slight perturbation of a points coordinates where the magnitude of the perturbation is no greater than one unit length. Our algorithm achieves a high embedding capacity, being 4.5 times the number of points in the point cloud models. This amount of capacity allows us to convey a 502x502 resolution of the black-and-white image into a point cloud model consisting of 56,194 points for covert communication. The capacity magnitude is 50%-75% higher than that of the current state-of-the-art algorithms, yet the model distortion due to the message embedding is smaller than that of our counterparts. Our algorithm is robust against translation, rotation, and uniformly scaling operations. It is fast, simple to implement, and the message can be extracted without referring to the original point cloud model. We believe our scheme is appropriate for most point cloud models.", "paper_title": "An Effective Message Embedding Scheme for 3D Models", "paper_id": "WOS:000273197900004"}