{"auto_keywords": [{"score": 0.04070629305155005, "phrase": "consistent_learning"}, {"score": 0.03517083259120442, "phrase": "coherent_learning"}, {"score": 0.00481495049065317, "phrase": "consistent_learner"}, {"score": 0.004072573194988867, "phrase": "learning_problem"}, {"score": 0.00394264312173188, "phrase": "present_paper"}, {"score": 0.003675120438902734, "phrase": "so-called_delta-delay"}, {"score": 0.0035005841368145525, "phrase": "last_delta_data"}, {"score": 0.003057910095857785, "phrase": "n_-_delta"}, {"score": 0.0025857324180891526, "phrase": "strict_hierarchies"}, {"score": 0.0025440911575156755, "phrase": "consistent_learning_models"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Inductive inference", " Consistency", " Coherence", " Characterizations", " Recursion theory"], "paper_abstract": "A consistent learner is required to correctly and completely reflect in its actual hypothesis all data received so far. Though this demand sounds quite plausible, it may lead to the unsolvability of the learning problem. Therefore, in the present paper several variations of consistent learning are introduced and studied. These variations allow a so-called delta-delay relaxing the consistency demand to all but the last delta data. Additionally, we introduce the notion of coherent learning (again with delta-delay) requiring the learner to correctly reflect only the last datum (only the n - delta th datum) seen. Our results are manyfold. First, we provide characterizations for consistent learning with delta-delay in terms of complexity and computable numberings. Second, we establish strict hierarchies for all consistent learning models with delta-delay in dependence on delta. Finally, it is shown that all models of coherent learning with delta-delay are exactly as powerful as their corresponding consistent learning models with delta-delay. (c) 2008 Elsevier Inc. All rights reserved", "paper_title": "Consistent and coherent learning with delta-delay", "paper_id": "WOS:000260754400010"}