{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "taxonomy_of_botnet_research"}, {"score": 0.004702092660370367, "phrase": "current_threats"}, {"score": 0.004276390289178831, "phrase": "research_community"}, {"score": 0.003935513160201076, "phrase": "botnet_research"}, {"score": 0.0037679023889496885, "phrase": "comprehensive_overview"}, {"score": 0.0035789632444741056, "phrase": "clear_perspective"}, {"score": 0.003306559295382181, "phrase": "botnet's_life-cycle"}, {"score": 0.002913052619634697, "phrase": "global_perspective"}, {"score": 0.002855934865505357, "phrase": "key_difference"}, {"score": 0.0027450280220853137, "phrase": "novel_taxonomy"}, {"score": 0.0025059724686541263, "phrase": "sustained_hindering"}, {"score": 0.0023896108055582615, "phrase": "botnet's_progress"}, {"score": 0.0022967713922705, "phrase": "potential_capabilities"}, {"score": 0.0022162970216404927, "phrase": "current_botnet_research"}, {"score": 0.0021049977753042253, "phrase": "different_contributions"}], "paper_keywords": ["Security", " Attack", " botnet", " defense", " detection", " survey", " taxonomy"], "paper_abstract": "Of all current threats to cybersecurity, botnets are at the top of the list. In consequence, interest in this problem is increasing rapidly among the research community and the number of publications on the question has grown exponentially in recent years. This article proposes a taxonomy of botnet research and presents a survey of the field to provide a comprehensive overview of all these contributions. Furthermore, we hope to provide researchers with a clear perspective of the gaps that remain to be filled in our defenses against botnets. The taxonomy is based upon the botnet's life-cycle, defined as the sequence of stages a botnet needs to pass through in order to reach its goal. This approach allows us to consider the problem of botnets from a global perspective, which constitutes a key difference from other taxonomies that have been proposed. Under this novel taxonomy, we conclude that all attempts to defeat botnets should be focused on one or more stages of this life-cycle. In fact, the sustained hindering of any of the stages makes it possible to thwart a botnet's progress and thus render it useless. We test the potential capabilities of our taxonomy by means of a survey of current botnet research, and find it genuinely useful in understanding the focus of the different contributions in this field.", "paper_title": "Survey and Taxonomy of Botnet Research through Life-Cycle", "paper_id": "WOS:000327934000005"}