{"auto_keywords": [{"score": 0.048877326221094704, "phrase": "economic_efficiency"}, {"score": 0.00481495049065317, "phrase": "truthful_mechanisms"}, {"score": 0.004605434064238641, "phrase": "unit-demand_auctions"}, {"score": 0.00454725669814484, "phrase": "unit-demand_auction"}, {"score": 0.004377077848734575, "phrase": "n_consumers"}, {"score": 0.0043080553835735825, "phrase": "consumer_bids"}, {"score": 0.004042635935882651, "phrase": "randomized_truthful_mechanisms"}, {"score": 0.003966233032752466, "phrase": "new_variant"}, {"score": 0.0037935219162654114, "phrase": "vcg"}, {"score": 0.003437248394635138, "phrase": "interesting_trade-off"}, {"score": 0.0032355864829403413, "phrase": "unit-demand_auctions_problem"}, {"score": 0.0032150572968898923, "phrase": "guruswami_et"}, {"score": 0.0028397103530211415, "phrase": "maximum_efficiency"}, {"score": 0.0027771220289115675, "phrase": "optimal_efficiency"}, {"score": 0.0027419768837926885, "phrase": "vcg_mechanism"}, {"score": 0.00247632489362785, "phrase": "truthful_mechanism"}, {"score": 0.0023532890136269986, "phrase": "revenue-oriented_mechanism"}, {"score": 0.0021049977753042253, "phrase": "bid_distributions"}], "paper_keywords": [""], "paper_abstract": "This work obtains truthful mechanisms that aim at maximizing both the revenue and the economic efficiency (social welfare) of unit-demand auctions. In a unit-demand auction a set of k items is auctioned to a set of n consumers, and although each consumer bids on all items, no consumer can purchase more than one item. We present a framework for devising polynomial-time randomized truthful mechanisms that are based on a new variant of the Vickrey-Clarke-Groves (VCG) mechanism. Instead of using reserve prices, this variant of VCG uses the number of objects that we wish to sell as a parameter. Our mechanisms differ in their selection of the number of items to be sold, and allow an interesting trade-off between revenue and economic efficiency, while improving upon the state-of-the-art results for the Unit-Demand Auctions problem (Guruswami et. al.[SODA 2005]). Our probabilistic results depend on what we call the competitiveness of the auction, i.e., the minimum number of items that need to be sold in order to obtain a certain fraction of the maximum efficiency. We denote by T the optimal efficiency achieved by the VCG mechanism. Our efficiency-oriented mechanism achieves S?(T) efficiency and Omega(T,ln(min{k, n}) revenue with probability that grows with the competitiveness of the auction. We also show that no truthful mechanism can obtain an omega(T/ln(min{k,n}) expected revenue on every set of bids. In fact, the revenue-oriented mechanism we present achieves Omega(T/ln(min{k,n}) efficiency and Omega(T/ln(min{k,n}) revenue, but the revenue can actually be much higher, even as large as Q(T) for some bid distributions.", "paper_title": "On behalf of the seller and society: Bicriteria mechanisms for unit-demand auctions", "paper_id": "WOS:000236886100023"}