{"auto_keywords": [{"score": 0.03998275230530839, "phrase": "detour_attack"}, {"score": 0.00481495049065317, "phrase": "improved_modonions_protocol-tagging_approach"}, {"score": 0.004598933498016774, "phrase": "new_class"}, {"score": 0.004483120978156604, "phrase": "anonymous_communication_protocol"}, {"score": 0.004174064076143015, "phrase": "improved_version"}, {"score": 0.0040481944502103505, "phrase": "universal_re-encryption"}, {"score": 0.003946195919158241, "phrase": "replay_attacks"}, {"score": 0.003866443402315402, "phrase": "modonions"}, {"score": 0.0037307208089736835, "phrase": "danezis"}, {"score": 0.0036740168936985314, "phrase": "-route_modonions"}, {"score": 0.003545024951402821, "phrase": "entire_path"}, {"score": 0.003025915966640355, "phrase": "modonion_construction"}, {"score": 0.0027600360731762997, "phrase": "detailed_probing"}, {"score": 0.002556359086441866, "phrase": "full_onion_path"}, {"score": 0.00235560370536971, "phrase": "modonion_protocol"}], "paper_keywords": ["Onion routing", " tagged encryption", " universal re-encryption", " replay attack"], "paper_abstract": "In this paper, we present a new class of attacks against an anonymous communication protocol, originally presented in ACNS 2008. The protocol itself was proposed as an improved version of ModOnions, which exploits universal re-encryption in order to avoid replay attacks. However, ModOnions allowed the detour attack, introduced by Danezis to re-route ModOnions to attackers in such a way that the entire path is revealed. The ACNS 2008 proposal addressed this by using a more complicated key management scheme. The revised protocol is immune to detour attacks. We show, however, that the ModOnion construction is highly malleable and this property can be exploited in order to redirect ModOnions. Our attacks require detailed probing and are less efficient than the detour attack, but they can nevertheless recover the full onion path while avoiding detection and investigation. Motivated by this, we present modifications to the ModOnion protocol that dramatically reduce the malleability of the encryption primitive. It addresses the class of attacks we present and it makes other attacks difficult to formulate.", "paper_title": "Attacking and Repairing the Improved ModOnions Protocol-Tagging Approach", "paper_id": "WOS:000279378500011"}