{"auto_keywords": [{"score": 0.046795482763257526, "phrase": "service_facilities"}, {"score": 0.00481495049065317, "phrase": "distributed_server_migration"}, {"score": 0.004780926543714981, "phrase": "scalable_internet_service_deployment"}, {"score": 0.004647206916983993, "phrase": "large-scale_networks"}, {"score": 0.004207840198934805, "phrase": "uncapacitated_k-median"}, {"score": 0.0041780882724537, "phrase": "ukm"}, {"score": 0.004090083576606688, "phrase": "requested_number"}, {"score": 0.0038918591179630535, "phrase": "ufl"}, {"score": 0.003400736815046841, "phrase": "large_networks"}, {"score": 0.0033647036658823798, "phrase": "key_question"}, {"score": 0.0031563574387360465, "phrase": "distributed_and_scalable_manner"}, {"score": 0.0028881548838751684, "phrase": "iterative_reoptimization"}, {"score": 0.0027873491386063913, "phrase": "network_neighborhoods"}, {"score": 0.0027382698136572785, "phrase": "innovative_approach"}, {"score": 0.002642681666526916, "phrase": "limited-scope_network_neighborhoods"}, {"score": 0.0025055037815033725, "phrase": "limited_information"}, {"score": 0.0024789326485851666, "phrase": "network_topology"}, {"score": 0.0022520931135078404, "phrase": "demand_information"}, {"score": 0.0021734395455430167, "phrase": "volatile_demand"}, {"score": 0.0021427510493208864, "phrase": "recent_advances"}, {"score": 0.0021275693314553143, "phrase": "virtualization_technology"}, {"score": 0.0021049977753042253, "phrase": "automated_placement"}], "paper_keywords": ["Content delivery", " facility location", " server migration", " service deployment"], "paper_abstract": "The effectiveness of service provisioning in large-scale networks is highly dependent on the number and location of service facilities deployed at various hosts. The classical, centralized approach to determining the latter would amount to formulating and solving the uncapacitated k-median (UKM) problem (if the requested number of facilities is fixed-k) or the uncapacitated facility location (UFL) problem (if the number of facilities is also to be optimized). Clearly, such centralized approaches require knowledge of global topological and demand information, and thus do not scale and are not practical for large networks. The key question posed and answered in this paper is the following: \"How can we determine in a distributed and scalable manner the number and location of service facilities?\" In this paper, we develop a scalable and distributed approach that answers our key question through an iterative reoptimization of the location and the number of facilities within network neighborhoods. We propose an innovative approach to migrate, add, or remove servers within limited-scope network neighborhoods by utilizing only local information about the topology and demand. We show that even with limited information about the network topology and demand, within one or two hops, our distributed approach achieves performance, under various synthetic and real Internet topologies and workloads, that is comparable to that of optimal, centralized approaches requiring full topology and demand information. We also show that it is responsive to volatile demand. Our approach leverages recent advances in virtualization technology toward an automated placement of services on the Internet.", "paper_title": "Distributed Server Migration for Scalable Internet Service Deployment", "paper_id": "WOS:000338124100018"}