{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "simultaneous_pick-up"}, {"score": 0.004292212137716459, "phrase": "waste_collection"}, {"score": 0.004199247711875386, "phrase": "precedence_constraints"}, {"score": 0.0037226570791514184, "phrase": "heuristic_algorithms"}, {"score": 0.0035630518377071916, "phrase": "small_amount"}, {"score": 0.003524227590204673, "phrase": "computing_time"}, {"score": 0.0034102660898135155, "phrase": "constructive_algorithms"}, {"score": 0.003373101013123386, "phrase": "local_search_algorithms"}, {"score": 0.0033363396054797044, "phrase": "tabu_search_algorithms"}, {"score": 0.0030064251340251196, "phrase": "tabu_search_paradigm"}, {"score": 0.002925149105307855, "phrase": "complex_and_variable_neighborhoods"}, {"score": 0.0028150302583265655, "phrase": "arc-exchange-based_and_node-exchange-based_neighborhoods"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["vehicle routing", " distribution logistics", " heuristics"], "paper_abstract": "The vehicle routing problem with simultaneous pick-up and delivery is the problem of optimally integrating goods distribution and waste collection, when no precedence constraints are imposed on the order in which the operations must be performed. The purpose of this paper is to present heuristic algorithms to solve this problem approximately in a small amount of computing time. We present and compare constructive algorithms, local search algorithms and tabu search algorithms, reporting on our computational experience with all of them. In particular we address the issue of applying the tabu search paradigm to algorithms based on complex and variable neighborhoods. For this purpose we combine arc-exchange-based and node-exchange-based neighborhoods, employing different and interacting tabu lists. All the algorithms presented in this paper are applicable to problems in which each customer may have either a pick-up demand or a delivery demand as well as to problems in which each customer may require both kinds of operation. (c) 2005 Published by Elsevier Ltd.", "paper_title": "Heuristic algorithms for the vehicle routing problem with simultaneous pick-up and delivery", "paper_id": "WOS:000241086900014"}