{"auto_keywords": [{"score": 0.048013867577183116, "phrase": "distributive_justice"}, {"score": 0.04726065589742192, "phrase": "legitimate_claims"}, {"score": 0.014250494960700067, "phrase": "local_environment"}, {"score": 0.01394285045063946, "phrase": "allocation_method"}, {"score": 0.00481495049065317, "phrase": "self-organised_common-pool_resource_management"}, {"score": 0.00471003041684707, "phrase": "elinor_ostrom's_institutional_design_principles"}, {"score": 0.004671274735676484, "phrase": "common-pool_resource_management"}, {"score": 0.004645614113246736, "phrase": "nicholas_rescher's"}, {"score": 0.004482206282876944, "phrase": "ostrom's_principles"}, {"score": 0.00443308765153716, "phrase": "resource_allocation_method"}, {"score": 0.003809629004475893, "phrase": "rescher"}, {"score": 0.003757480190200645, "phrase": "different_mechanisms"}, {"score": 0.003516898780234098, "phrase": "multiple_claims"}, {"score": 0.0033373756615875517, "phrase": "logical_axiomatisation"}, {"score": 0.0031582637043009562, "phrase": "voting_function"}, {"score": 0.0031064226956732497, "phrase": "rank_order"}, {"score": 0.0029722900280316216, "phrase": "scoring_functions"}, {"score": 0.0027437235598539904, "phrase": "collective_choice"}, {"score": 0.0025820967615278073, "phrase": "relative_claims"}, {"score": 0.002504880563070155, "phrase": "linear_public_good_game"}, {"score": 0.0024773766973282805, "phrase": "pluralistic_self-organising_approach"}, {"score": 0.002312174113289583, "phrase": "fixed_approaches"}, {"score": 0.0022492129111567824, "phrase": "ostensibly_unfair_individual_allocations"}, {"score": 0.0021401625519713577, "phrase": "free-rider_phenomenon"}, {"score": 0.0021049977753042253, "phrase": "common-pool_resources"}], "paper_keywords": ["Design", " Algorithms", " Performance", " Self-organising systems", " common-pool resource allocation", " electronic institutions", " distributive justice"], "paper_abstract": "In this article, we complement Elinor Ostrom's institutional design principles for enduring common-pool resource management with Nicholas Rescher's theory of distributive justice based on the canon of legitimate claims. Two of Ostrom's principles are that the resource allocation method should be congruent with the local environment, and that those affected by the allocation method (the appropriators) should participate in its selection. However, these principles do not say anything explicitly about the fairness of the allocation method or the outcomes it produces: for this, we need a mechanism for distributive justice. Rescher identified a number of different mechanisms, each of which had both its merits and demerits, and instead maintained that distributive justice consisted in identifying the legitimate claims in context, accommodating multiple claims in case of plurality, and reconciling them in case of conflict. Accordingly, we specify a logical axiomatisation of the principles with the canon of legitimate claims, whereby a set of claims is each represented as a voting function, which collectively determine the rank order in which resources are allocated. The appropriators vote on the weight attached to the scoring functions, and so self-organise the allocation method, taking into account both the plurality of and conflict between the claims. Therefore, the appropriators exercise collective choice over the method, and the method itself is congruent with the local environment, taking into account both the resources available and the relative claims of the appropriators. Experiments with a variant of the linear public good game show that this pluralistic self-organising approach produces a better balance of utility and fairness (for agents that comply with the rules of the game) compared to monistic or fixed approaches, provide \"fairness over time\" (a series of ostensibly unfair individual allocations is revealed to be cumulatively fair), and offer an intuition of how to resolve the free-rider phenomenon in provision and appropriation of common-pool resources.", "paper_title": "Distributive Justice for Self-Organised Common-Pool Resource Management", "paper_id": "WOS:000343978600003"}