{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "new_questions"}, {"score": 0.010488590114420257, "phrase": "community_question"}, {"score": 0.00874284842844615, "phrase": "appropriate_answerers"}, {"score": 0.003541923233726252, "phrase": "ranking_problem"}, {"score": 0.003459191419478298, "phrase": "potential_answerers"}, {"score": 0.003165739628969694, "phrase": "tensor_model"}, {"score": 0.0031285355811105945, "phrase": "topic_model"}, {"score": 0.0030554300179552415, "phrase": "latent_semantic_relations"}, {"score": 0.0028293966058473476, "phrase": "learning_procedure"}, {"score": 0.0027146742941153443, "phrase": "optimal_ranking"}, {"score": 0.0024842242921857705, "phrase": "experimental_results"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Answerer ranking", " Learn to rank", " Tensor model", " AUC", " Community question answering"], "paper_abstract": "Community question answering (CQA) services that enable users to ask and answer questions have become popular on the internet However, lots of new questions usually cannot be resolved by appropriate answerers effectively. To address this question routing task, in this paper, we treat it as a ranking problem and rank the potential answerers by the probability that they are able to solve the given new question. We utilize tensor model and topic model simultaneously to extract latent semantic relations among asker, question and answerer. Then, we propose a learning procedure based on the above models to get optimal ranking of answerers for new questions by optimizing the multi-class AUC (Area Under the ROC Curve). Experimental results on two real-world CQA datasets show that the proposed method is able to predict appropriate answerers for new questions and outperforms other state-of-the-art approaches. (C) 2014 Elsevier Ltd. All rights reserved.", "paper_title": "Optimal answerer ranking for new questions in community question answering", "paper_id": "WOS:000345491900009"}