{"auto_keywords": [{"score": 0.04324409553509611, "phrase": "facebook"}, {"score": 0.015719223001355736, "phrase": "scientific_journals"}, {"score": 0.01487640501132267, "phrase": "social_media_tools"}, {"score": 0.014605479372243506, "phrase": "attention_data"}, {"score": 0.013384729254395324, "phrase": "twitter"}, {"score": 0.009427121650410965, "phrase": "scientific_communication"}, {"score": 0.009340418234668618, "phrase": "social_media"}, {"score": 0.004770461993586338, "phrase": "social_web_tools"}, {"score": 0.004367707617503722, "phrase": "seventy-eight_scientific_journals"}, {"score": 0.004287359380190878, "phrase": "rss"}, {"score": 0.004169519409162853, "phrase": "interactive_social_media_tools"}, {"score": 0.0034947408949397127, "phrase": "youtube_entry"}, {"score": 0.003336031521101184, "phrase": "blog_sites"}, {"score": 0.0032593915869553714, "phrase": "varying_roles"}, {"score": 0.0026317312518257803, "phrase": "clear_demand"}, {"score": 0.002375714262344562, "phrase": "attention_economy"}, {"score": 0.0023427844897844093, "phrase": "fruitful_viewpoint"}, {"score": 0.002278284823857861, "phrase": "relevant_and_useful_concepts"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Attention", " Scientific publishing", " Social media", " Facebook", " Twitter"], "paper_abstract": "One hundred scientific and scholarly journal web sites were investigated to find out their use of social media tools and to examine attention data revealed by them. Seventy-eight scientific journals used social media tools, RSS being the most common. Interactive social media tools - Facebook, Twitter and blogs - were present on 19 journal web sites. Attention data were operationalised as liking, commenting or sharing postings on Facebook, Twitter or blog texts or linking to articles, liking a YouTube entry or following a journal on Twitter. Facebook and blog sites of the journals had varying roles with respect to content generated by readers and the journal, and the amount of attention data received by the journals' Facebook, Twitter and blog sites also showed great variation. In scientific communication, social media have a role of their own, complementing that of scientific journals, and their active use indicates the clear demand for them. Attention is difficult to measure also by social media, but their interactive features obviously indicate one part of it, and attention economy presents a fruitful viewpoint for studying scientific communication by providing relevant and useful concepts that describe its characteristics and factors that influence the attention it receives. (C) 2012 Elsevier Ltd. All rights reserved.", "paper_title": "Everything is plentiful-Except attention. Attention data of scientific journals on social web tools", "paper_id": "WOS:000308581700025"}