{"auto_keywords": [{"score": 0.049452114640627876, "phrase": "starting_salary"}, {"score": 0.03632066591054605, "phrase": "starting_salaries"}, {"score": 0.004689650818647484, "phrase": "fresh_graduate"}, {"score": 0.004547564208690591, "phrase": "career_advancement"}, {"score": 0.00431388720289049, "phrase": "information_technology"}, {"score": 0.00416478405812793, "phrase": "existing_studies"}, {"score": 0.0034168317227203206, "phrase": "fresh_it_graduates"}, {"score": 0.003298631258267805, "phrase": "annual_surveys"}, {"score": 0.0032697235411641695, "phrase": "undergraduate_students"}, {"score": 0.0031845067058084583, "phrase": "large_public_university"}, {"score": 0.0031566166200072444, "phrase": "singapore"}, {"score": 0.002941913249957503, "phrase": "fresh_graduates'_entry"}, {"score": 0.0028778584739756786, "phrase": "non_it_job"}, {"score": 0.0025106241866273897, "phrase": "gender_difference"}, {"score": 0.0024236964502593254, "phrase": "female_it_majors"}, {"score": 0.002258745901862197, "phrase": "foreign_it_graduates"}, {"score": 0.0021049977753042253, "phrase": "local_graduates"}], "paper_keywords": ["Starting Salary", " IT Job Entry", " Gender", " Foreigner Status", " Fresh IT Graduate"], "paper_abstract": "The starting salary of a fresh graduate is considered a potential indicator of career advancement. Yet few studies have examined the determinants of starting salaries of information technology (IT) graduates. Further, existing studies have focused on how demographics affect either the salary or the kind of job the graduate enters into, but rarely both. In this paper, we explore both and examine if entry into an IT job mediates the effects of demographics on the starting salaries of fresh IT graduates. Our model is tested using data from annual surveys of undergraduate students majoring in IT at a large public university in Singapore over a 5-year period. We find that gender and foreigner status influence both starting salary and fresh graduates' entry into an IT vs. non IT job. Further, the effect of gender on the starting salaries of IT graduates is partially mediated by their entry into an IT job. In other words, part of the reason for a gender difference in starting salary could be attributed to female IT majors being less likely to enter IT jobs upon graduation than their male counterparts. On the other hand, foreign IT graduates are more likely to enter IT jobs, yet their starting salaries are found to be lower than local graduates. The implications of the results for research and practice are discussed.", "paper_title": "Investigating the Determinants of Starting Salary of IT Graduates", "paper_id": "WOS:000364851200001"}