{"auto_keywords": [{"score": 0.04935669810434815, "phrase": "biophysical_characteristics"}, {"score": 0.015719716506582538, "phrase": "predictive_tools"}, {"score": 0.004395040468458808, "phrase": "predictive_ability"}, {"score": 0.0043506951029334984, "phrase": "theoretical_methods"}, {"score": 0.004241771072194993, "phrase": "related_biology"}, {"score": 0.0039310261964323545, "phrase": "effective_collaboration"}, {"score": 0.003793876828939456, "phrase": "computational_tools"}, {"score": 0.003445174898115646, "phrase": "wider_community"}, {"score": 0.0033588449972778004, "phrase": "prototype_collaborative_environment"}, {"score": 0.0028697077879305064, "phrase": "remote_access"}, {"score": 0.002797757576619329, "phrase": "peatdb"}, {"score": 0.0026863605504566924, "phrase": "experimental_data"}, {"score": 0.0026457367614424756, "phrase": "biophysical_characterisation_studies"}, {"score": 0.0025533148412439166, "phrase": "peatsa"}, {"score": 0.002283298119790413, "phrase": "resulting_environment_aids_method_development"}, {"score": 0.0022487566311825227, "phrase": "potapov"}, {"score": 0.0021049977753042253, "phrase": "protein_stability_prediction_algorithms"}], "paper_keywords": ["Protein stability", " Prediction", " Protein design", " Data analysis", " Data integration", " Molecular modelling"], "paper_abstract": "The exchange of information between experimentalists and theoreticians is crucial to improving the predictive ability of theoretical methods and hence our understanding of the related biology. However many barriers exist which prevent the flow of information between the two disciplines. Enabling effective collaboration requires that experimentalists can easily apply computational tools to their data, share their data with theoreticians, and that both the experimental data and computational results are accessible to the wider community. We present a prototype collaborative environment for developing and validating predictive tools for protein biophysical characteristics. The environment is built on two central components; a new python-based integration module which allows theoreticians to provide and manage remote access to their programs; and PEATDB, a program for storing and sharing experimental data from protein biophysical characterisation studies. We demonstrate our approach by integrating PEATSA, a web-based service for predicting changes in protein biophysical characteristics, into PEATDB. Furthermore, we illustrate how the resulting environment aids method development using the Potapov dataset of experimentally measured Delta Delta G(fold) values, previously employed to validate and train protein stability prediction algorithms.", "paper_title": "A collaborative environment for developing and validating predictive tools for protein biophysical characteristics", "paper_id": "WOS:000303882200002"}