{"auto_keywords": [{"score": 0.027191527959281918, "phrase": "root_problems"}, {"score": 0.013444908989550159, "phrase": "solution's_future_fitness"}, {"score": 0.010856157401117932, "phrase": "root"}, {"score": 0.010517629310366294, "phrase": "benchmark_problems"}, {"score": 0.008094026827218026, "phrase": "experimental_results"}, {"score": 0.004764542405129454, "phrase": "evolutionary_dynamic_optimization"}, {"score": 0.00447293882024487, "phrase": "tmo"}, {"score": 0.00433386573276633, "phrase": "real-world_dynamic_optimization_problems"}, {"score": 0.0037594599958631404, "phrase": "robust_solutions"}, {"score": 0.0035853745478488254, "phrase": "robust_optimization"}, {"score": 0.0029038817737006405, "phrase": "existing_dop_benchmarks"}, {"score": 0.0025858215477025117, "phrase": "better_understanding"}, {"score": 0.002326938965568362, "phrase": "different_methods"}, {"score": 0.002266364679369248, "phrase": "different_dynamics"}, {"score": 0.0021957487795963666, "phrase": "real_challenges"}, {"score": 0.0021049977753042253, "phrase": "first_time"}], "paper_keywords": ["Benchmarking", " dynamic optimization problems (DOPs)", " evolutionary algorithms (EAs)", " robust optimization over time (ROOT)"], "paper_abstract": "The focus of most research in evolutionary dynamic optimization has been tracking moving optimum (TMO). Yet, TMO does not capture all the characteristics of real-world dynamic optimization problems (DOPs), especially in situations where a solution's future fitness has to be considered. To account for a solution's future fitness explicitly, we propose to find robust solutions to DOPs, which are formulated as the robust optimization over time (ROOT) problem. In this paper we analyze two robustness definitions in ROOT and then develop two types of benchmark problems for the two robustness definitions in ROOT, respectively. The two types of benchmark problems are motivated by the inappropriateness of existing DOP benchmarks for the study of ROOT. Additionally, we evaluate four representative methods from the literature on our proposed ROOT benchmarks, in order to gain a better understanding of ROOT problems and their relationship to more popular TMO problems. The experimental results are analyzed, which show the strengths and weaknesses of different methods in solving ROOT problems with different dynamics. In particular, the real challenges of ROOT problems have been revealed for the first time by the experimental results on our proposed ROOT benchmarks.", "paper_title": "Robust Optimization Over Time: Problem Difficulties and Benchmark Problems", "paper_id": "WOS:000362358600008"}