{"auto_keywords": [{"score": 0.04049871558392555, "phrase": "smart_homes_domain"}, {"score": 0.021425462189423677, "phrase": "iris"}, {"score": 0.015719716506582524, "phrase": "semi-formal_methods"}, {"score": 0.004726970265271088, "phrase": "smart_homes_policies"}, {"score": 0.004692227830462433, "phrase": "feature_interaction"}, {"score": 0.004555781299332848, "phrase": "telecommunications_domain"}, {"score": 0.004439634831927606, "phrase": "telephony_features"}, {"score": 0.00424734451992536, "phrase": "feature_interaction_problem"}, {"score": 0.004200582085706493, "phrase": "traditional_telecommunications_domain"}, {"score": 0.0036778708850237814, "phrase": "six_step_semi-formal_approach"}, {"score": 0.0036105923401756126, "phrase": "identifying_requirements_interactions"}, {"score": 0.0034540850937966306, "phrase": "major_component"}, {"score": 0.003365930631436696, "phrase": "interaction_taxonomy"}, {"score": 0.0031727643282003976, "phrase": "feature_interactions"}, {"score": 0.0031494088980556934, "phrase": "telecommunication_features"}, {"score": 0.002850385670169814, "phrase": "case_study"}, {"score": 0.0027673496368158545, "phrase": "complete_description"}, {"score": 0.0024677487011556427, "phrase": "human_expert"}, {"score": 0.0023781827711414107, "phrase": "paper's_main_claim"}, {"score": 0.002317423416027688, "phrase": "semiformal_approach"}], "paper_keywords": ["feature interaction", " policies", " semi-formal methods", " smart homes"], "paper_abstract": "Feature Interaction is a problem mostly considered in the telecommunications domain. Many solutions for detecting interactions between telephony features have been reported. In this paper, we investigate the feature interaction problem beyond the traditional telecommunications domain and look at interactions between policies in other domains. We propose the use of semi-formal methods for detecting interactions between policies in the smart homes domain. The novelty of this research is threefold: firstly, a six step semi-formal approach, called IRIS (Identifying Requirements Interactions using Semi-formal methods), for detecting interactions is presented. A major component within IRIS, which is an interaction taxonomy, is also presented. Secondly, we extend the scope of the problem of feature interactions beyond telecommunication features and investigate interactions between policies in the smart homes domain. Thirdly, in order to show how IRIS is used to detect interactions between policies, a case study of the smart homes domain is conducted. A complete description of the results obtained is also provided. Our approach was successfully applied to the smart homes domain and was able to discover 83 interactions among 35 user policies using only 525 pairwise comparisons as opposed to 630 a human expert would have to do. These results support the paper's main claim of being able to use the semiformal approach IRIS to detect interactions between policies. Furthermore, these results are to date the most complete publication of interactions between policies in the smart homes domain. (c) 2007 Elsevier B.V. All rights reserved.", "paper_title": "Using semi-formal methods for detecting interactions among smart homes policies", "paper_id": "WOS:000248174100001"}