{"auto_keywords": [{"score": 0.04755154299589268, "phrase": "bayes"}, {"score": 0.014504449997306606, "phrase": "renyi_entropy"}, {"score": 0.008856788677619083, "phrase": "marginal_bayes_error"}, {"score": 0.008429326441052353, "phrase": "wnb_classifiers"}, {"score": 0.00481495049065317, "phrase": "relationship_between_renyi_entropy_and_marginal_bayes_error"}, {"score": 0.004300951511110487, "phrase": "wnb_classifier"}, {"score": 0.004167086373747367, "phrase": "large-scale_classification_problems"}, {"score": 0.003738847528809348, "phrase": "prediction_performance"}, {"score": 0.0034937647771945803, "phrase": "shannon_entropy"}, {"score": 0.003309278541665552, "phrase": "classification_performance"}, {"score": 0.003148709618042979, "phrase": "different_weighting_methods"}, {"score": 0.0030505976034245234, "phrase": "feature_selection"}, {"score": 0.0028505007899807446, "phrase": "parametric_cx-renyi_entropy"}, {"score": 0.0027993885490232677, "phrase": "first_clue"}, {"score": 0.0021049977753042253, "phrase": "tree-structured_correlation"}], "paper_keywords": ["Naive Bayes classifier", " Renyi entropy", " marginal Bayes error", " tree augmented naive Bayes classifier"], "paper_abstract": "A weighted naive Bayes (WNB) classifier using Renyi entropy is discussed with its tree augmented extension. A WNB classifier is one solution for gaining efficiency against large-scale classification problems with an enormous amount of data and a lot of features. Such a WNB classifier has been studied so far, aiming at improving the prediction performance or at reducing the number of features. Among those studies, weighting with Shannon entropy has succeeded in reducing the number of features while keeping the classification performance. However, it has not been fully revealed how different weighting methods affect the performance of classification and feature selection. In this paper, it is analyzed by changing the weights using a parametric cx-Renyi entropy. As the first clue, the relationship between Renyi entropy and the marginal Bayes error is analyzed in detail. It was revealed that the WNB classifiers becomes the regular (without weight) naive Bayes classifier in one end (alpha = 0.0) and naive Bayes classifier weighted by the marginal Bayes error in the other end (alpha = infinity). In addition, an extension of WNB classifiers to incorporate tree-structured correlation between features is discussed.", "paper_title": "ANALYSIS OF RELATIONSHIP BETWEEN RENYI ENTROPY AND MARGINAL BAYES ERROR AND ITS APPLICATION TO WEIGHTED NAIVE BAYES CLASSIFIERS", "paper_id": "WOS:000343996900006"}