{"auto_keywords": [{"score": 0.044340662163821175, "phrase": "imc"}, {"score": 0.01783030285643251, "phrase": "maximum_principle"}, {"score": 0.015771174418041666, "phrase": "ite_imc"}, {"score": 0.006638679041315016, "phrase": "time_step"}, {"score": 0.005847398363008471, "phrase": "ite_imc_method"}, {"score": 0.0055674379293941135, "phrase": "traditional_imc."}, {"score": 0.004732215871738028, "phrase": "challenging_problems"}, {"score": 0.0047049532961375, "phrase": "thermal_radiative_transfer"}, {"score": 0.0044536312768349, "phrase": "high_degree"}, {"score": 0.003990385737207714, "phrase": "statistical_noise"}, {"score": 0.003955926499405168, "phrase": "material_and_radiation_temperatures"}, {"score": 0.003876669922047053, "phrase": "multiphysics_simulations"}, {"score": 0.0036482665232275583, "phrase": "imc-calculated_temperatures"}, {"score": 0.0035855066449812273, "phrase": "maximum_temperature"}, {"score": 0.0033257460346754687, "phrase": "reduced_parameter_space"}, {"score": 0.0030936850548131923, "phrase": "imc_photon_histories"}, {"score": 0.003031650815900696, "phrase": "step_material_temperature"}, {"score": 0.0029794666460666646, "phrase": "better_estimate"}, {"score": 0.002936664639276662, "phrase": "time_step_material_temperature"}, {"score": 0.00282822695516646, "phrase": "fleck_factor"}, {"score": 0.0027080733297108524, "phrase": "planckian"}, {"score": 0.002608040688794517, "phrase": "analytic_solutions"}, {"score": 0.0024899850926034567, "phrase": "infinite_medium_stability_analysis"}, {"score": 0.002370386872018425, "phrase": "significantly_larger_time_steps"}, {"score": 0.0022696277881969896, "phrase": "non-linear_material_properties"}, {"score": 0.002211235429059514, "phrase": "larger_variance"}, {"score": 0.0021731423856364003, "phrase": "different_fleck_factor"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Thermal radiative transfer", " Implicit Monte Carlo"], "paper_abstract": "For over 40 years, the Implicit Monte Carlo (IMC) method has been used to solve challenging problems in thermal radiative transfer. These problems typically contain regions that are optically thick and diffusive, as a consequence of the high degree of \"pseudo-scattering\" introduced to model the absorption and reemission of photons from a tightly-coupled, radiating material. IMC has several well-known features that could be improved: a) it can be prohibitively computationally expensive, b) it introduces statistical noise into the material and radiation temperatures, which may be problematic in multiphysics simulations, and c) under certain conditions, solutions can be nonphysical, in that they violate a maximum principle, where IMC-calculated temperatures can be greater than the maximum temperature used to drive the problem. We have developed a variant of IMC called iterative thermal emission IMC, which is designed to have a reduced parameter space in which the maximum principle is violated. ITE IMC is a more implicit version of IMC in that it uses the information obtained from a series of IMC photon histories to improve the estimate for the end of time step material temperature during a time step. A better estimate of the end of time step material temperature allows for a more implicit estimate of other temperature-dependent quantities: opacity, heat capacity, Fleck factor (probability that a photon absorbed during a time step is not reemitted) and the Planckian emission source. We have verified the ITE IMC method against 0-D and 1-D analytic solutions and problems from the literature. These results are compared with traditional IMC. We perform an infinite medium stability analysis of ITE IMC and show that it is slightly more numerically stable than traditional IMC. We find that significantly larger time steps can be used with ITE IMC without violating the maximum principle, especially in problems with non-linear material properties. The ITE IMC method does however yield solutions with larger variance because each sub-step uses a different Fleck factor (even at equilibrium). (C) 2014 Elsevier Inc. All rights reserved.", "paper_title": "The iterative thermal emission method: A more implicit modification of IMC", "paper_id": "WOS:000341311000011"}