{"auto_keywords": [{"score": 0.04497042027454695, "phrase": "cross_sections"}, {"score": 0.02124948925621451, "phrase": "ecpssr_theory"}, {"score": 0.020652610331235458, "phrase": "coulomb"}, {"score": 0.01954151409667108, "phrase": "projectile_ions"}, {"score": 0.017100727346033386, "phrase": "windows"}, {"score": 0.010452394758136203, "phrase": "atomic_electrons"}, {"score": 0.010283817777844692, "phrase": "fortran"}, {"score": 0.009921758039032256, "phrase": "input_file"}, {"score": 0.009562112809138228, "phrase": "selective_inclusion"}, {"score": 0.009520659640983089, "phrase": "individual_contributions"}, {"score": 0.009438286512289349, "phrase": "projectile_energy_loss"}, {"score": 0.009336312165537387, "phrase": "electron's_stationary_state"}, {"score": 0.00905655421958242, "phrase": "control_application"}, {"score": 0.00895866693303841, "phrase": "inverse_kinematics"}, {"score": 0.008890770376850127, "phrase": "target_atoms"}, {"score": 0.008503210666419615, "phrase": "distributed_program"}, {"score": 0.0084755193208089, "phrase": "test_data"}, {"score": 0.008167865069280219, "phrase": "text_editor"}, {"score": 0.008000791570782198, "phrase": "operating_system"}, {"score": 0.007317781260511878, "phrase": "ecpssr"}, {"score": 0.006810340596537945, "phrase": "target_electron"}, {"score": 0.006780735095816318, "phrase": "non-radiative_electron_capture"}, {"score": 0.006421277370564261, "phrase": "direct_ionization"}, {"score": 0.005035273899603163, "phrase": "relativistic_light_projectiles"}, {"score": 0.00481495049065317, "phrase": "fortran_program"}, {"score": 0.004793977359859698, "phrase": "windows_graphics_user_interface"}, {"score": 0.004695589935046956, "phrase": "atomic_electron_removal_cross_sections"}, {"score": 0.004594194795531362, "phrase": "large_community"}, {"score": 0.004000058102850469, "phrase": "program"}, {"score": 0.0039343203933083016, "phrase": "cpc_program_library"}, {"score": 0.003925734887614178, "phrase": "queen's_university"}, {"score": 0.00391716823770714, "phrase": "belfast"}, {"score": 0.003908619821024662, "phrase": "n._ireland"}, {"score": 0.0038915790796448715, "phrase": "standard_cpc"}, {"score": 0.003741504648537586, "phrase": "tar.gz_programming_language"}, {"score": 0.0036566385588887368, "phrase": "double_precision"}, {"score": 0.0036367166808364817, "phrase": "\"operating_system"}, {"score": 0.0036129531248174957, "phrase": "main_program"}, {"score": 0.0035658891722746776, "phrase": "fortran_compiler"}, {"score": 0.00353496450353184, "phrase": "dos"}, {"score": 0.0035155923719134875, "phrase": "supplied_graphics_user_interface_control_application"}, {"score": 0.0034926175093515912, "phrase": "windows_operating_system"}, {"score": 0.0033615486267101276, "phrase": "notepad"}, {"score": 0.0032996670043221148, "phrase": "typical_tag_word"}, {"score": 0.003270940404902371, "phrase": "standard_plane_wave_born_approximation"}, {"score": 0.003182766665708972, "phrase": "energy_loss"}, {"score": 0.003120752448438053, "phrase": "perturbed_stationary_state"}, {"score": 0.0031139460325373134, "phrase": "pss"}, {"score": 0.003103741057945653, "phrase": "relativistic_nature"}, {"score": 0.0030465908211506423, "phrase": "oppenheimer-brinkman-kramers_approximation"}, {"score": 0.003000314555440258, "phrase": "r._pss"}, {"score": 0.0029806970291336326, "phrase": "increased_target"}, {"score": 0.0029226084686759988, "phrase": "target_nucleus"}, {"score": 0.002887666990456251, "phrase": "target_electron_cloud"}, {"score": 0.0028593885623843717, "phrase": "electron's_shell_radius"}, {"score": 0.0027731651256470698, "phrase": "tag_word"}, {"score": 0.0027520174942477207, "phrase": "ecusr"}, {"score": 0.002746004906714212, "phrase": "recpsshsr"}, {"score": 0.002728045631619707, "phrase": "cross_section"}, {"score": 0.002671987898644374, "phrase": "di"}, {"score": 0.0026631913659579095, "phrase": "electron_capture"}, {"score": 0.002657406209037884, "phrase": "ec"}, {"score": 0.0023126969730651596, "phrase": "projectile_energies"}, {"score": 0.0022725644185058835, "phrase": "radiative_electron_capture"}, {"score": 0.002233126730975819, "phrase": "collision_regimes"}, {"score": 0.002194371932976229, "phrase": "fortran_code"}, {"score": 0.0021728680295959747, "phrase": "specific_corrections"}, {"score": 0.002123506454028692, "phrase": "input_data"}], "paper_keywords": ["Ionization", " Electron capture", " Electron transfer", " PWBA", " OBK", " ECPSSR"], "paper_abstract": "ERCS08 is a program for computing the atomic electron removal cross sections. It is written in FORTRAN in order to make it more portable and easier to customize by a large community of physicists, but it also comes with a separate windows graphics user interface control application ERCS08w that makes it easy to quickly prepare the input file, run the program, as well as view and analyze the output. The calculations are based on the ECPSSR theory for direct (Coulomb) ionization and non-radiative electron capture. With versatility in mind, the program allows for selective inclusion or exclusion of individual contributions to the cross sections from effects such as projectile energy loss, Coulomb deflection of the projectile, perturbation of electron's stationary state (polarization and binding), as well as relativity. This makes it straightforward to assess the importance of each effect in a given collision regime. The control application also makes it easy to setup for calculations in inverse kinematics (i.e. ionization of projectile ions by target atoms or ions). Program summary Program title: ERCS08 Catalogue identifier: ASCU_v1_0 Program summary URL: http://cpc.cs.qub.ac.uk/summaries/AECU_v1_0.html Program obtainable from: CPC Program Library, Queen's University, Belfast, N. Ireland Licensing provisions: Standard CPC licence, http://cpc.cs.qub.ac.trk/licence/licence.html No. of lines in distributed program, including test data, etc.: 12 832 No. of bytes in distributed program, including test data, etc.: 318420 Distribution format: tar.gz Programming language: Once the input file is prepared (using a text editor or ERCS08w), all the calculations are done in FORTRAN using double precision. Computer: see \"Operating system\" below Operating system: The main program (ERCS08) can run on any computer equipped with a FORTRAN compiler. Its pre-compiled executable file (supplied) runs under DOS or Windows. The supplied graphics user interface control application (ERCS08w) requires a Windows operating system. ERCS08w is designed to be used along with a text editor. Any editor can be used, including the one that conies with the operating system (for example, Edit for DOS or Notepad for Windows). Classification: 16.7, 16.8 Nature of problem: ECPSSR has become a typical tag word for a theory that goes beyond the standard plane wave Born approximation (PWBA) in order to predict the cross sections for direct (Coulomb) ionization of atomic electrons by projectile ions, taking into account the energy loss (E) and Coulomb deflection (C) of the projectile, as well as the perturbed stationary state (PSS) and relativistic nature (R) of the target electron. Its treatment of non-radiative electron capture to the projectile goes beyond the Oppenheimer-Brinkman-Kramers approximation (OBK) to include the effects of C, PSS, and R. PSS is described in terms of increased target electron binding (B) due to the presence of the projectile in the vicinity of the target nucleus, and (for direct ionization only) polarization of the target electron cloud (P) while projectile is outside the electron's shell radius. Several modifications of the theory have been recently suggested or endorsed by one of its authors (Lapicki). These modifications are sometimes explicit in the tag word (for example, eCPSSR, eCUSR, ReCPSShsR, etc.) A cross section for the ionization of a target electron is assumed to equal the sum of the cross sections for direct ionization (DI) and electron capture (EC). Solution method: The calculations are based on the ECPSSR theory for direct (Coulomb) ionization and non-radiative electron capture. With versatility in mind, the program allows for selective inclusion or exclusion of individual contributions to the cross sections from effects such as projectile energy loss, Coulomb deflection of the projectile, perturbation of electron's stationary state (polarization and binding). as well as relativity. This makes it straightforward to assess the importance of each effect in a given collision regime. The control application also makes it easy to setup for calculations in inverse kinematics (i.e. ionization of projectile ions by target atoms or ions). Restrictions: The program is restricted to the ionization of K, L, and M electrons. The theory is non-relativistic, which effectively limits its applicability to projectile energies up to about 50 MeV/amu. However, the theory is extended to apply to relativistic light projectiles. Radiative electron capture is not taken into account, since its contribution is found to be negligible in the collision regimes covered by the ECPSSR theory. Unusual features: Windows graphics user interface along with a FORTRAN code for calculations, selective inclusion or exclusion of specific corrections, inclusion of the extension to relativistic light projectiles, inclusion of non-radiative electron capture. Running time: Running the program using the input data provided with the distribution only takes a few seconds. (C) 2008 Elsevier B.V. All rights reserved.", "paper_title": "ERCS08: A FORTRAN program equipped with a Windows graphics user interface that calculates ECPSSR cross sections for the removal of atomic electrons", "paper_id": "WOS:000266660400019"}