{"auto_keywords": [{"score": 0.04565922187614431, "phrase": "hie"}, {"score": 0.015719713042815758, "phrase": "health_information_exchange"}, {"score": 0.0045879792359519375, "phrase": "behavioral_health_providers'_beliefs"}, {"score": 0.004301834610818624, "phrase": "methods_survey"}, {"score": 0.004121015016128205, "phrase": "midwestern_state"}, {"score": 0.0038431888954930083, "phrase": "open-ended_beliefs_elicitation_interviews"}, {"score": 0.0034332736827447654, "phrase": "time_burdens"}, {"score": 0.0030834712590249863, "phrase": "regression_model"}, {"score": 0.002953711377604328, "phrase": "hie._providers"}, {"score": 0.002382182688788248, "phrase": "discussion_most_behavioral_health_providers"}, {"score": 0.0021392418081444798, "phrase": "medical_providers"}, {"score": 0.0021049977753042253, "phrase": "perceived_cost"}], "paper_keywords": [""], "paper_abstract": "Objective To assess behavioral health providers' beliefs about the benefits and barriers of health information exchange (HIE). Methods Survey of a total of 2010 behavioral health providers in a Midwestern state (33% response rate), with questions based on previously reported open-ended beliefs elicitation interviews. Results Factor analysis resulted in four groupings: beliefs that HIE would improve care and communication, add cost and time burdens, present access and vulnerability concerns, and impact workflow and control (positively and negatively). A regression model including all four factors parsimoniously predicted attitudes toward HIE. Providers clustered into two groups based on their beliefs: a majority (67%) were positive about the impact of HIE, and the remainder (33%) were negative. There were some professional/demographic differences between the two clusters of providers. Discussion Most behavioral health providers are supportive of HIE; however, their adoption and use of it may continue to lag behind that of medical providers due to perceived cost and time burdens and concerns about access to and vulnerability of information.", "paper_title": "Behavioral health providers' beliefs about health information exchange: a statewide survey", "paper_id": "WOS:000306024100014"}