{"auto_keywords": [{"score": 0.04950097558699653, "phrase": "mathematical_tools"}, {"score": 0.00481495049065317, "phrase": "statistical_thermodynamics_concepts"}, {"score": 0.004670896353428476, "phrase": "multi-agent_ecosystem"}, {"score": 0.00436890075128947, "phrase": "mathematical_problem"}, {"score": 0.004087024949214594, "phrase": "boltzmann"}, {"score": 0.00386876598761639, "phrase": "statistical_mechanics"}, {"score": 0.0033433365160336842, "phrase": "artificial_ecosystems"}, {"score": 0.003223494720348768, "phrase": "ecological_or_economic_systems"}, {"score": 0.002636956926079255, "phrase": "incorrect_interpretation"}, {"score": 0.0025892330566358503, "phrase": "method's_concepts"}, {"score": 0.0021438155673297377, "phrase": "global_behavior"}, {"score": 0.0021049977753042253, "phrase": "artificial_multi-agent_ecosystem"}], "paper_keywords": ["Thermodynamics", " statistical mechanics", " entropy", " multi-agent system", " ecosystems"], "paper_abstract": "Finding the distribution of systems over their possible states is a mathematical problem. One possible solution is the method of the most probable distribution developed by Boltzmann. This method has been instrumental in developing statistical mechanics and explaining the origin of many thermodynamics concepts, like entropy or temperature, but is also applicable in many other fields like ecology or economics. Artificial ecosystems have many features in common with ecological or economic systems, but surprisingly the method does not appear to have been very successful in this field of application. The hypothesis of this article is that this failure is due to the incorrect interpretation of the method's concepts and mathematical tools. We propose to review and reinterpret the method so that it can be correctly applied and all its potential exploited in order to study and characterize the global behavior of an artificial multi-agent ecosystem.", "paper_title": "Statistical Thermodynamics Concepts and Mathematical Tools for a Multi-Agent Ecosystem", "paper_id": "WOS:000333760200004"}