{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "laminated_core"}, {"score": 0.012143446306995579, "phrase": "contact_resistance"}, {"score": 0.007912861612133922, "phrase": "eddy_current_loss"}, {"score": 0.004519736937243476, "phrase": "electrical_steel_sheet"}, {"score": 0.004338390136272005, "phrase": "raw_steel_sheets"}, {"score": 0.004211069233133584, "phrase": "small_core"}, {"score": 0.004179824713643488, "phrase": "electrical_machines"}, {"score": 0.0041488110506566825, "phrase": "electronic_equipments"}, {"score": 0.0040571383470418085, "phrase": "iron_core"}, {"score": 0.0039822874870125095, "phrase": "cheap_steel_sheets"}, {"score": 0.0032808923086505037, "phrase": "spcc"}, {"score": 0.0031845067058084583, "phrase": "different_widths"}, {"score": 0.0030451958332949735, "phrase": "finite_element_method"}, {"score": 0.0029447150254434842, "phrase": "equivalent_circuit"}, {"score": 0.002847540262784593, "phrase": "experimental_investigation"}, {"score": 0.0025940660106162404, "phrase": "eddy_current"}, {"score": 0.0022013916728990564, "phrase": "similar_tendency"}, {"score": 0.002176887956041267, "phrase": "measured_value"}, {"score": 0.0021049977753042253, "phrase": "modeling_method"}], "paper_keywords": ["Finite element method", " Eddy current", " Contact resistance", " Insulation"], "paper_abstract": "Purpose - In the laminated core of transformer, motor, etc. each electrical steel sheet is usually insulated in order to reduce the eddy current loss. Raw steel sheets without insulation are sometimes used in a small core of electrical machines and electronic equipments, because the cost of iron core can be reduced if cheap steel sheets without insulation are used in the core. The purpose of the paper is to show how the contact resistance between sheets of laminated core affects the interlaminar eddy current and to show the criterion for judgment of the necessity of insulation. Design/methodology/approach - The eddy current losses of core made of SPCC (cold rolled steel sheets) of different widths with and without insulation under various conditions are analyzed by using the finite element method (FEM) considering the contact resistance. The equivalent circuit for such a laminated core without insulation is shown. The experimental investigation is also carried out. Findings - A criterion for the judgment of insulation is examined. It is shown that the increase of eddy current is affected by the ratio (this corresponds to the criterion) of the resistance of steel and the contact resistance. Originality/value - The paper clarifies a criterion for the necessity of insulation between sheets of laminated core. It is shown that a similar tendency to the measured value of eddy current loss can be obtained by utilizing the modeling method of laminated core.", "paper_title": "Examination of eddy current in laminated core without insulation", "paper_id": "WOS:000332135500010"}