{"auto_keywords": [{"score": 0.03986188747994713, "phrase": "five_psychosocial_variables"}, {"score": 0.014899867481178006, "phrase": "online_health_consultation_service"}, {"score": 0.014830598952653108, "phrase": "low-income_breast_cancer_patients"}, {"score": 0.013796640607185466, "phrase": "breast_cancer_patients"}, {"score": 0.01283382861671995, "phrase": "use_activity"}, {"score": 0.012276818231041936, "phrase": "social_support"}, {"score": 0.012105931206721644, "phrase": "health_care"}, {"score": 0.012021370890938313, "phrase": "doctor-patient_relationship"}, {"score": 0.008168989840204335, "phrase": "online_health_consultation"}, {"score": 0.00481495049065317, "phrase": "health_consultation"}, {"score": 0.004747429622531595, "phrase": "interactive_cancer_communication_tool"}, {"score": 0.004725132736474305, "phrase": "low-income_women"}, {"score": 0.004615202066192795, "phrase": "psychosocial_variables"}, {"score": 0.004382234207023988, "phrase": "retrospective_study"}, {"score": 0.004240116703465252, "phrase": "federal_poverty_level"}, {"score": 0.004190480544028343, "phrase": "free_computer"}, {"score": 0.004064117897000019, "phrase": "expert'_service"}, {"score": 0.003997680750288098, "phrase": "chess"}, {"score": 0.003950846696972114, "phrase": "breast_cancer\"_program"}, {"score": 0.0037336520904376687, "phrase": "health_self_efficacy"}, {"score": 0.0034299649219748513, "phrase": "multiple_regression_model"}, {"score": 0.003326458781648332, "phrase": "consultation_service"}, {"score": 0.0031732652552570644, "phrase": "patients'_use_activities"}, {"score": 0.0030847461428168614, "phrase": "significant_negative_relationships"}, {"score": 0.0030702341640329546, "phrase": "pre-test_scores"}, {"score": 0.0030271053282807637, "phrase": "regression_models"}, {"score": 0.003012863697277089, "phrase": "significant_positive_main_effects"}, {"score": 0.002867300723785917, "phrase": "online_consultation_service"}, {"score": 0.0028403801288224544, "phrase": "significant_relationships"}, {"score": 0.0028203552122952266, "phrase": "dependent_variables"}, {"score": 0.0027159094186967247, "phrase": "online_cancer_information_expert"}, {"score": 0.00262768883064664, "phrase": "greater_use"}, {"score": 0.0025724908378377135, "phrase": "patients'_perception"}, {"score": 0.0025603825400732786, "phrase": "health_self-efficacy"}, {"score": 0.0023188396972186396, "phrase": "effective_complement"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ireland_ltd."}], "paper_keywords": ["Consultation", " Decision support", " Communication", " Breast cancer", " Internet"], "paper_abstract": "Purpose: To examine how psychosocial variables predicted use of an online health consultation service among low-income breast cancer patients and in turn how using this service affected these same psychosocial outcomes. Method: This retrospective study included 231 recently diagnosed, low-income (at or below 250% of the federal poverty level) breast cancer patients provided a free computer with 16 weeks of access to the Internet-based 'Ask an Expert' service offered as part of the Comprehensive Health Enhancement Support System (CHESS) \"Living with Breast Cancer\" program. The use activity included a total of 502 messages submitted to the online health consultation service. The data included five psychosocial variables: information seeking, social support, health self efficacy, participation in health care, and doctor-patient relationship, were collected at both the pre-test and 16-week post-test after using the service. Correlation tests were conducted to examine the relationship between pre- and post-test, and use activity. A multiple regression model was formed for each of five psychosocial variables to examine how use activity of the consultation service was associated with various psychosocial measurements. Results: In total, 865 distinct consulting queries from 502 messages were identified as measurement of patients' use activities (3.74 consulting queries per participant). Use activity had significant negative relationships with pre-test scores across all five psychosocial variables. The regression models found significant positive main effects (use activity) associated with three of these psychosocial variables: health self efficacy, participation in health care and doctor-patient relationship. Use activity of the online consultation service did not have significant relationships with the dependent variables of information seeking and perceived social support. Conclusion: Low-income breast cancer patients sought out information from an online cancer information expert. Patients with more negative perceptions at pre-test tended to use the service more. Greater use of the service was associated with improvement in patients' perception of health self-efficacy, participation in health care and doctor-patient relationship. Moreover, use of online health consultation appears to level the differences, narrowing the gaps between those who were worse and better off at pre-test. These findings suggest that online health consultation can serve as an effective complement to other resources, which help low-income, breast cancer patients feel more confident to participate more actively in their health care, become more actively involved in making decisions about their treatments and enhance the relationship with their doctors. (C) 2011 Elsevier Ireland Ltd. All rights reserved.", "paper_title": "Online health consultation: Examining uses of an interactive cancer communication tool by low-income women with breast cancer", "paper_id": "WOS:000291047400006"}