{"auto_keywords": [{"score": 0.04640845917719622, "phrase": "new_system"}, {"score": 0.007152368807539886, "phrase": "paper-based_clinical_pathways"}, {"score": 0.005852862426636756, "phrase": "clinical_pathways"}, {"score": 0.004635881163634672, "phrase": "new_approach"}, {"score": 0.004248782702870078, "phrase": "existing_network"}, {"score": 0.004153207234462926, "phrase": "paper-based_clinical_pathway_management_system"}, {"score": 0.0039684322717435045, "phrase": "management_efficiency"}, {"score": 0.0034096661914349577, "phrase": "free_access"}, {"score": 0.0032951702142329357, "phrase": "development_costs"}, {"score": 0.0029629009627331355, "phrase": "management_system"}, {"score": 0.0026945722090537397, "phrase": "original_paper-based_system"}, {"score": 0.00265394824073552, "phrase": "open_access"}, {"score": 0.0026040262154057607, "phrase": "free_software"}, {"score": 0.0024505140126859894, "phrase": "japan"}, {"score": 0.002314752262613559, "phrase": "expensive_new_systems"}, {"score": 0.0022972306948217548, "phrase": "systematic_management"}, {"score": 0.0022454559805729717, "phrase": "electronic_medical_records"}, {"score": 0.0021782296784218923, "phrase": "system_management"}], "paper_keywords": ["critical pathways", " computer systems", " software", " information management", " economics", " numerical analysis"], "paper_abstract": "The present study was performed to explore a new approach to systematization of the management of paper-based clinical pathways by developing a new system requiring little capital investment. A new system was developed and incorporated into an existing network at a hospital with a paper-based clinical pathway management system. The effectiveness of this new system was examined by comparing the management efficiency of clinical pathways before and after its introduction, and by comparison of the new system with other such systems currently in place at other medical institutions with regard to efficiency. in addition, the acceptability of the system for other medical institutions was examined by providing free access to the software on the Internet. The development costs of the new system were low. Although the new system has been in place for more than 3 years, no problems have yet been encountered in either the existing network system or in the management system itself. The new system allows the processing of statistics and analysis of circulation or variance automatically, neither of which were possible in the original paper-based system. We provided open access to the system as free software on the Internet, and it has since been downloaded by many medical institutions and enterprises in Japan. This system is very useful for institutions where it is difficult to introduce expensive new systems for systematic management of clinical pathways, such as electronic medical records, because of problems regarding capital or system management, and it may also be useful in other countries. (c) 2006 Elsevier Ireland Ltd. All rights reserved.", "paper_title": "A new approach to systematization of the management of paper-based clinical pathways", "paper_id": "WOS:000237906800009"}