{"auto_keywords": [{"score": 0.032381893275175655, "phrase": "trace_dependencies"}, {"score": 0.00481495049065317, "phrase": "process-driven_soas"}, {"score": 0.004345706062641742, "phrase": "important_factors"}, {"score": 0.003898411343926653, "phrase": "explicit_links"}, {"score": 0.0038516336597530614, "phrase": "process_design"}, {"score": 0.0033725614574134396, "phrase": "second_factor"}, {"score": 0.003252542052430779, "phrase": "tangled_process_concerns"}, {"score": 0.002899861600151726, "phrase": "adequate_tool_support"}, {"score": 0.0027630232270330402, "phrase": "process_designs"}, {"score": 0.0023755529073496394, "phrase": "process_development_artifacts"}, {"score": 0.0023470051993423483, "phrase": "different_levels"}, {"score": 0.0022497569011987587, "phrase": "proof-of-concept_tool_support"}, {"score": 0.0021049977753042253, "phrase": "industrial_case_study"}], "paper_keywords": ["Software traceability", " View-based", " Model-driven", " Process-driven SOA", " Tool support"], "paper_abstract": "In process-driven, service-oriented architectures, there are a number of important factors that hinder the traceability between design and implementation artifacts. First of all, there are no explicit links between process design and implementation languages not only due to the differences of syntax and semantics but also the differences of granularity. The second factor is the complexity caused by tangled process concerns that multiplies the difficulty of analyzing and understanding the trace dependencies. Finally, there is a lack of adequate tool support for establishing and maintaining the trace dependencies between process designs and implementations. We present in this article a view-based, model-driven traceability approach that tackles these challenges. Our approach supports (semi-)automatically eliciting and (semi-)formalizing trace dependencies among process development artifacts at different levels of granularity and abstraction. A proof-of-concept tool support has been realized, and its functionality is illustrated via an industrial case study.", "paper_title": "VbTrace: using view-based and model-driven development to support traceability in process-driven SOAs", "paper_id": "WOS:000286612400002"}