{"auto_keywords": [{"score": 0.040624635173270626, "phrase": "decision_information"}, {"score": 0.02322730111336099, "phrase": "experts'_weights"}, {"score": 0.010480471215573757, "phrase": "consistency_maximization"}, {"score": 0.006536001680745498, "phrase": "individual_decision"}, {"score": 0.006454426270426851, "phrase": "ideal_decision"}, {"score": 0.004408976280483648, "phrase": "multi-attribute_group_decision-making"}, {"score": 0.004192484908247302, "phrase": "interesting_research_topic"}, {"score": 0.003727628340195049, "phrase": "novel_approach"}, {"score": 0.0033420978105332686, "phrase": "main_contributions"}, {"score": 0.0027203027216256013, "phrase": "group_assessment_consistency"}, {"score": 0.002358050109031317, "phrase": "final_results"}, {"score": 0.002338306897057454, "phrase": "magdm_problem"}, {"score": 0.002270495425498003, "phrase": "common_will"}, {"score": 0.0022139352210982398, "phrase": "greatest_extent"}, {"score": 0.002131720106846481, "phrase": "parametric_linear_programming_model"}, {"score": 0.0021049977753042253, "phrase": "weight_average_approach"}], "paper_keywords": ["Multi-attribute group decision-making", " intuitionistic fuzzy information", " consistency", " experts' weights"], "paper_abstract": "In general, weights of experts play a very important role in multi-attribute group decision-making (MAGDM), how to objectively determine experts' weights is an interesting research topic. Recently, many corresponding methods have been proposed to derive experts' weights, but none of them simultaneously capture the decision information from both the ranking and magnitude two aspects. This paper presents a novel approach for determining weights of experts in intuitionistic fuzzy group decision making based on consistency maximization by simultaneously considering the ranking and magnitude of decision information. The main contributions of this paper are threefold: (1) from the perspective of the ranking of decision information, the group ranking consistency (GRC) index is defined to measure the consistency between each individual decision and the ideal decision of group; (2) from the perspective of the magnitude of decision information, the group assessment consistency (GAC) index is also defined for measuring the consistency between each individual decision and the ideal decision of group; (3) a bi-objective linear programming model to determine the experts' weights is constructed on basis of the idea that the final results of MAGDM problem should be consistent and reflect the common will of the group to the greatest extent, which is solved by transforming into a parametric linear programming model using the weight average approach.", "paper_title": "Deriving experts' weights based on consistency maximization in intuitionistic fuzzy group decision making", "paper_id": "WOS:000340435700019"}