{"auto_keywords": [{"score": 0.035092275355708184, "phrase": "kdetrees"}, {"score": 0.00481495049065317, "phrase": "phylogenetic_tree_distributions"}, {"score": 0.004657653216262924, "phrase": "gene_histories"}, {"score": 0.004394592555435104, "phrase": "common_process"}, {"score": 0.004322186889256224, "phrase": "coalescent_process"}, {"score": 0.004180919839686364, "phrase": "numerous_other_coexisting_processes"}, {"score": 0.0034678302347682694, "phrase": "important_problem"}, {"score": 0.003177892611195514, "phrase": "phylogenetic_trees"}, {"score": 0.00284034646798833, "phrase": "similar_recently_published_method"}, {"score": 0.0027473784878300133, "phrase": "computational_complexity"}, {"score": 0.002602734354498382, "phrase": "simulation_studies"}, {"score": 0.0024554476124885806, "phrase": "apicomplexa_genes"}, {"score": 0.0023948981440134478, "phrase": "previous_detection"}, {"score": 0.0022877332844249065, "phrase": "possible_case"}, {"score": 0.002268769196700254, "phrase": "horizontal_gene_transfer"}, {"score": 0.0021944684609599245, "phrase": "epichloe_genes"}, {"score": 0.0021049977753042253, "phrase": "contrived_instance"}], "paper_keywords": [""], "paper_abstract": "Motivation: Although the majority of gene histories found in a clade of organisms are expected to be generated by a common process (e.g. the coalescent process), it is well known that numerous other coexisting processes (e.g. horizontal gene transfers, gene duplication and subsequent neofunctionalization) will cause some genes to exhibit a history distinct from those of the majority of genes. Such 'outlying' gene trees are considered to be biologically interesting, and identifying these genes has become an important problem in phylogenetics. Results: We propose and implement KDETREES, a non-parametric method for estimating distributions of phylogenetic trees, with the goal of identifying trees that are significantly different from the rest of the trees in the sample. Our method compares favorably with a similar recently published method, featuring an improvement of one polynomial order of computational complexity (to quadratic in the number of trees analyzed), with simulation studies suggesting only a small penalty to classification accuracy. Application of KDETREES to a set of Apicomplexa genes identified several unreliable sequence alignments that had escaped previous detection, as well as a gene independently reported as a possible case of horizontal gene transfer. We also analyze a set of Epichloe genes, fungi symbiotic with grasses, successfully identifying a contrived instance of paralogy.", "paper_title": "KDETREES: non-parametric estimation of phylogenetic tree distributions", "paper_id": "WOS:000342746000006"}