{"auto_keywords": [{"score": 0.0496729815270419, "phrase": "decision_making"}, {"score": 0.010612387000973441, "phrase": "incomplete_preference_relations"}, {"score": 0.004008981656795115, "phrase": "precise_or_sufficient_level"}, {"score": 0.0039244530915794025, "phrase": "whole_problem"}, {"score": 0.003394891095032025, "phrase": "large_number"}, {"score": 0.0029744042270542655, "phrase": "missing_values"}, {"score": 0.002924074850256874, "phrase": "incomplete_information"}, {"score": 0.0028623555849897632, "phrase": "low_quality_information"}, {"score": 0.002754516260621121, "phrase": "biased_or_even_bad_solutions"}, {"score": 0.0026058621464926826, "phrase": "decision_process"}, {"score": 0.002561752783323717, "phrase": "alternative_approaches"}, {"score": 0.0024863459251358217, "phrase": "missing_information"}, {"score": 0.0022442249871042026, "phrase": "missing_preferences"}, {"score": 0.002159623311924437, "phrase": "future_research"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Group decision making", " Uncertainty", " Incomplete information", " Fuzzy preference relation", " Consistency"], "paper_abstract": "In decision making, situations where all experts are able to efficiently express their preferences over all the available options are the exception rather than the rule. Indeed, the above scenario requires all experts to possess a precise or sufficient level of knowledge of the whole problem to tackle, including the ability to discriminate the degree up to which some options are better than others. These assumptions can be seen unrealistic in many decision making situations, especially those involving a large number of alternatives to choose from and/or conflicting and dynamic sources of information. Some methodologies widely adopted in these situations are to discard or to rate more negatively those experts that provide preferences with missing values. However, incomplete information is not equivalent to low quality information, and consequently these methodologies could lead to biased or even bad solutions since useful information might not being taken properly into account in the decision process. Therefore, alternative approaches to manage incomplete preference relations that estimates the missing information in decision making are desirable and possible. This paper presents and analyses methods and processes developed on this area towards the estimation of missing preferences in decision making, and highlights some areas for future research. (C) 2015 Elsevier Inc. All rights reserved.", "paper_title": "Managing incomplete preference relations in decision making: A review and future trends", "paper_id": "WOS:000350924000002"}