{"auto_keywords": [{"score": 0.04932930879059259, "phrase": "practical_querying"}, {"score": 0.00481495049065317, "phrase": "relational_closure_rules"}, {"score": 0.004496542293425754, "phrase": "life_sciences"}, {"score": 0.004426092397211699, "phrase": "large_amounts"}, {"score": 0.00392125815948488, "phrase": "considerable_value"}, {"score": 0.0037397086147485897, "phrase": "semi-automated_process"}, {"score": 0.0035477930970463432, "phrase": "logic-based_representation_language"}, {"score": 0.0034193226278107346, "phrase": "consistent_ontology"}, {"score": 0.002858313353461727, "phrase": "biogateway"}, {"score": 0.0026270572353632297, "phrase": "manual_curation_effort"}, {"score": 0.0025994945418484935, "phrase": "metarel"}, {"score": 0.002518525107994039, "phrase": "relation_semantics"}, {"score": 0.0023891283748647416, "phrase": "large_scale"}, {"score": 0.0021957487795963666, "phrase": "prospective_queries"}, {"score": 0.0021385822825864425, "phrase": "new_hypotheses"}, {"score": 0.0021049977753042253, "phrase": "instance_gene_products"}], "paper_keywords": [""], "paper_abstract": "Motivation: Ontologies have become indispensable in the Life Sciences for managing large amounts of knowledge. The use of logics in ontologies ranges from sound modelling to practical querying of that knowledge, thus adding a considerable value. We conceive reasoning on bio-ontologies as a semi-automated process in three steps: (i) defining a logic-based representation language; (ii) building a consistent ontology using that language; and (iii) exploiting the ontology through querying. Results: Here, we report on how we have implemented this approach to reasoning on the OBO Foundry ontologies within BioGateway, a biological Resource Description Framework knowledge base. By separating the three steps in a manual curation effort on Metarel, a vocabulary that specifies relation semantics, we were able to apply reasoning on a large scale. Starting from an initial 401 million triples, we inferred about 158 million knowledge statements that allow for a myriad of prospective queries, potentially leading to new hypotheses about for instance gene products, processes, interactions or diseases.", "paper_title": "Reasoning with bio-ontologies: using relational closure rules to enable practical querying", "paper_id": "WOS:000291062400016"}