{"auto_keywords": [{"score": 0.048153996910559355, "phrase": "feedback_type_oscillator"}, {"score": 0.012608217541173758, "phrase": "microstrip_resonator"}, {"score": 0.010405054369311566, "phrase": "phase_noise_levels"}, {"score": 0.006621372724282567, "phrase": "negative_resistance_oscillator"}, {"score": 0.006355737293005852, "phrase": "lumped_element_resonator"}, {"score": 0.0048551701870592255, "phrase": "offset_frequencies"}, {"score": 0.00481495049065317, "phrase": "mmic_oscillators"}, {"score": 0.004714994480036599, "phrase": "oscillation_frequency"}, {"score": 0.004487989502479992, "phrase": "microwave_oscillators"}, {"score": 0.004257360656055417, "phrase": "relatively_symmetric_resonator"}, {"score": 0.0040622852274783275, "phrase": "first_negative_resistance_oscillator"}, {"score": 0.003991449490087454, "phrase": "simple_lumped_element_resonator"}, {"score": 0.0037862398004482253, "phrase": "second_oscillator"}, {"score": 0.002142426911242168, "phrase": "phase_noise"}, {"score": 0.0021049977753042253, "phrase": "negative_resistance_oscillators"}], "paper_keywords": ["Microwave oscillator", " Feedback type", " Negative resistance", " Resonator", " Advanced design system software"], "paper_abstract": "We propose a feedback type oscillator and two negative resistance oscillators. These microwave oscillators have been designed in the S band frequency. A relatively symmetric resonator is used in the feedback type oscillator. The first negative resistance oscillator uses a simple lumped element resonator which is substituted by a microstrip resonator in the second oscillator to improve results. The negative resistance oscillator produces 4.207 dBm and 7.124 dBm output power with the lumped element resonator and microstrip resonator respectively, and the feedback type oscillator produces -10.707 dBm output power. The feedback type oscillator operates at 3 GHz with phase noise levels at -83.30 dBc/Hz and -103.3 dBc/Hz at 100 kHz and 1 MHz offset frequencies respectively. The phase noise levels of the negative resistance oscillator with the lumped element resonator are -94.64 dBc/Hz and -116 dBc/Hz at 100 kHz and 1 MHz offset frequencies respectively, at an oscillation frequency of 3.053 GHz. With the microstrip resonator the phase noise levels are -99.49 dBc/Hz and -119.641 dBc/Hz at 100 kHz and 1 MHz offset frequencies respectively, at an oscillation frequency of 3.072 GHz. The results showed that both the output power and the phase noise of the negative resistance oscillators were better than those of the feedback type oscillator.", "paper_title": "Design of MMIC oscillators using GaAs 0.2 mu m PHEMT technology", "paper_id": "WOS:000309721700007"}