{"auto_keywords": [{"score": 0.04278172255856689, "phrase": "neuronal_types"}, {"score": 0.00481495049065317, "phrase": "neuronal_morphology"}, {"score": 0.004709193603747991, "phrase": "brain_regions"}, {"score": 0.00450456611645112, "phrase": "intense_debate"}, {"score": 0.004425215632459868, "phrase": "gabaergic_cortical_interneurons"}, {"score": 0.004158290806404304, "phrase": "morphological_properties"}, {"score": 0.003737485125097945, "phrase": "main_features"}, {"score": 0.003198705576491802, "phrase": "bayesian_networks"}, {"score": 0.003128336741911927, "phrase": "similar_behaviors"}, {"score": 0.0030595112110658675, "phrase": "bayesian_network"}, {"score": 0.0028492532869274743, "phrase": "consensus_bayesian_multinet"}, {"score": 0.002761856557698856, "phrase": "whole_group"}, {"score": 0.0026771333996253783, "phrase": "thorough_analysis"}, {"score": 0.002641621667026613, "phrase": "consensus_model"}, {"score": 0.0026182085765020548, "phrase": "different_behaviors"}, {"score": 0.002438203996977464, "phrase": "morphological_traits"}, {"score": 0.002321665383971456, "phrase": "bayesian_multinet"}, {"score": 0.0021620042653528846, "phrase": "neuron_morphology"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Bayesian networks", " Bayesian multinets", " Expert consensus", " Neuron classification"], "paper_abstract": "Neuronal morphology is hugely variable across brain regions and species, and their classification strategies are a matter of intense debate in neuroscience. GABAergic cortical interneurons have been a challenge because it is difficult to find a set of morphological properties which clearly define neuronal types. A group of 48 neuroscience experts around the world were asked to classify a set of 320 cortical GABAergic interneurons according to the main features of their three-dimensional morphological reconstructions. A methodology for building a model which captures the opinions of all the experts was proposed. First, one Bayesian network was learned for each expert, and we proposed an algorithm for clustering Bayesian networks corresponding to experts with similar behaviors. Then, a Bayesian network which represents the opinions of each group of experts was induced. Finally, a consensus Bayesian multinet which models the opinions of the whole group of experts was built. A thorough analysis of the consensus model identified different behaviors between the experts when classifying the interneurons in the experiment. A set of characterizing morphological traits for the neuronal types was defined by performing inference in the Bayesian multinet. These findings were used to validate the model and to gain some insights into neuron morphology. (C) 2013 Elsevier Inc. All rights reserved.", "paper_title": "Bayesian network modeling of the consensus between experts: An application to neuron classification", "paper_id": "WOS:000329012800002"}