{"auto_keywords": [{"score": 0.02278995382909513, "phrase": "linear_non-increasing_deterioration"}, {"score": 0.005909686181881459, "phrase": "maximum_earliness_cost"}, {"score": 0.004456044928556639, "phrase": "scheduling_environment"}, {"score": 0.0040708542958968605, "phrase": "actual_processing_time"}, {"score": 0.003767203575060969, "phrase": "non-increasing_linear_function"}, {"score": 0.0034636656250083744, "phrase": "common_single_machine"}, {"score": 0.0030435998319355883, "phrase": "combined_schedule"}, {"score": 0.002639968630788011, "phrase": "total_earliness_cost"}, {"score": 0.0026060359255636444, "phrase": "total_weighted_earliness_cost"}, {"score": 0.0023958326775913165, "phrase": "fixed_level"}, {"score": 0.002260301305523054, "phrase": "complexity_results"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Scheduling", " Single-machine", " Two agents", " Deterioration"], "paper_abstract": "We consider a scheduling environment with two agents and a linear non-increasing deterioration. By the linear non-increasing deterioration we mean that the actual processing time of a job belonging to the two agents is defined as a non-increasing linear function of its starting time. Two agents compete to perform their respective jobs on a common single machine and each agent has his own criterion to be optimized. The goal is to schedule the jobs such that the combined schedule performs well with respect to the measures of both agents. Three different objective functions are considered for one agent, including the maximum earliness cost, total earliness cost and total weighted earliness cost, while keeping the maximum earliness cost of the other agent below or at a fixed level U. We propose the optimal (nondominated) properties and present the complexity results for the problems addressed here. (C) 2011 Elsevier Inc. All rights reserved.", "paper_title": "Scheduling problems with two agents and a linear non-increasing deterioration to minimize earliness penalties", "paper_id": "WOS:000300201800018"}