{"auto_keywords": [{"score": 0.04152691671834336, "phrase": "mst_verification_algorithm"}, {"score": 0.0409303070249204, "phrase": "simultaneously_messages"}, {"score": 0.00481495049065317, "phrase": "distributed_minimum-weight_spanning_tree_verification"}, {"score": 0.004625881588444304, "phrase": "distributed_verification"}, {"score": 0.003441891354624516, "phrase": "g's_diameter"}, {"score": 0.0031448288291084, "phrase": "worst_case"}, {"score": 0.0028446460307503343, "phrase": "mst_construction"}, {"score": 0.0028021527740710508, "phrase": "lower_bounds"}, {"score": 0.0026120705848349055, "phrase": "known_distributed_algorithm"}, {"score": 0.0024348510123716424, "phrase": "best_known_time-optimal_algorithm"}, {"score": 0.0022582634725291225, "phrase": "best_known_message-optimal_algorithm"}], "paper_keywords": ["Distributed algorithms", " Distributed verification", " Labeling schemes", " Minimum-weight spanning tree"], "paper_abstract": "This paper introduces the notion of distributed verification without preprocessing. It focuses on the Minimum-weight Spanning Tree (MST) verification problem and establishes tight upper and lower bounds for the time and message complexities of this problem. Specifically, we provide an MST verification algorithm that achieves simultaneously messages and time, where m is the number of edges in the given graph G, n is the number of nodes, and D is G's diameter. On the other hand, we show that any MST verification algorithm must send messages and incur time in worst case. Our upper bound result appears to indicate that the verification of an MST may be easier than its construction, since for MST construction, both lower bounds of messages and time hold, but at the moment there is no known distributed algorithm that constructs an MST and achieves simultaneously messages and time. Specifically, the best known time-optimal algorithm (using time) requires O(m+n (3/2)) messages, and the best known message-optimal algorithm (using messages) requires O(n) time. On the other hand, our lower bound results indicate that the verification of an MST is not significantly easier than its construction.", "paper_title": "Tight Bounds for Distributed Minimum-Weight Spanning Tree Verification", "paper_id": "WOS:000320040400009"}