{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "signed_majority_function"}, {"score": 0.014035056440916441, "phrase": "linear_threshold_functions"}, {"score": 0.010795048484879, "phrase": "non-adaptive_algorithm"}, {"score": 0.004364696693320128, "phrase": "highly_symmetrical_subclass"}, {"score": 0.004032677973387083, "phrase": "query_complexity"}, {"score": 0.003635405516451343, "phrase": "broader_class"}, {"score": 0.0034048439594299715, "phrase": "signed_majority_functions"}, {"score": 0.003180161250635426, "phrase": "non-adaptive_algorithms"}, {"score": 0.0030860426028530646, "phrase": "combinatorial_optimization"}, {"score": 0.002751530840450719, "phrase": "testing_problem"}, {"score": 0.002633832886254408, "phrase": "signed_majorities"}, {"score": 0.0026194782016875275, "phrase": "constant_accuracy"}, {"score": 0.002534974041090166, "phrase": "lower_bound"}, {"score": 0.0024869414272688218, "phrase": "adaptive_algorithm"}, {"score": 0.00241989408309933, "phrase": "consistency_checks"}, {"score": 0.0023870497011682676, "phrase": "successive_restriction"}, {"score": 0.002266246304762945, "phrase": "original_n-variable_testing_problem"}, {"score": 0.0021811543597119116, "phrase": "simple_direct_method"}, {"score": 0.002116539101048158, "phrase": "important_role"}], "paper_keywords": ["Property testing", " Majority function", " Linear threshold function"], "paper_abstract": "A signed majority function is a linear threshold function f:{+1,-1} (n) -> {+1,-1} of the form f(x) = sign(Sigma(n)(i=1) sigma(i)x(i)) where each sigma(i) is an element of a{+1, -1}. Signed majority functions are a highly symmetrical subclass of the class of all linear threshold functions, which are functions of the form sign(Sigma(n)(i=1) w(i)x(i) - theta) for arbitrary real w(i) ,theta. We study the query complexity of testing whether an unknown f:{+1, -1}(n) -> {+1, -1} is a signed majority function versus epsilon-far from every signed majority function. While it is known (SIAM J. Comput. 39(5):2004-2047, 2010) that the broader class of all linear threshold functions is testable with poly(1/epsilon) queries (independent of n), prior to our work the best upper bound for signed majority functions was O(root n) . poly(1/epsilon) queries (via a non-adaptive algorithm), and the best lower bound was Omega(logn) queries for non-adaptive algorithms (Proceedings of the 13th International Workshop on Approximation, Randomization and Combinatorial Optimization (RANDOM), pp. 646-657, 2009). As our main results we exponentially improve both these prior bounds for testing signed majority functions: (Upper bound) We give a poly(log n, 1/epsilon)-query adaptive algorithm (which is computationally efficient) for this testing problem; (Lower bound) We show that any non-adaptive algorithm for testing the class of signed majorities to constant accuracy must make n(Omega(1)) queries. This directly implies a lower bound of Omega(logn) queries for any adaptive algorithm. Our testing algorithm performs a sequence of restrictions together with consistency checks to ensure that each successive restriction is \"compatible\" with the function prior to restriction. This approach is used to transform the original n-variable testing problem into a testing problem over poly(log n, 1/epsilon) variables where a simple direct method can be applied. Analysis of the degree-1 Fourier coefficients plays an important role in our proofs.", "paper_title": "Exponentially Improved Algorithms and Lower Bounds for Testing Signed Majorities", "paper_id": "WOS:000354066300004"}