{"auto_keywords": [{"score": 0.0494217274100556, "phrase": "conceptual_spaces"}, {"score": 0.00481495049065317, "phrase": "propositional_theories"}, {"score": 0.004781777766309739, "phrase": "qualitative_knowledge"}, {"score": 0.004587464246981363, "phrase": "non-trivial_conclusions"}, {"score": 0.004416257191177784, "phrase": "classical_deduction"}, {"score": 0.004135387221172467, "phrase": "crucial_importance"}, {"score": 0.004022515690178811, "phrase": "symbolic_settings"}, {"score": 0.003899199029692063, "phrase": "propositional_categorization_rules"}, {"score": 0.003663749926218976, "phrase": "conceptual_relations"}, {"score": 0.0036133826040506798, "phrase": "spatial_relations"}, {"score": 0.0035637068187629505, "phrase": "gardenfors"}, {"score": 0.0034305738274625634, "phrase": "categorization_rules"}, {"score": 0.0027870176748502045, "phrase": "interpolative_and_extrapolative_reasoning"}, {"score": 0.002564682311144514, "phrase": "semantic_level"}, {"score": 0.002503232182798796, "phrase": "inference_rules"}, {"score": 0.002426378123762607, "phrase": "syntactic_level"}, {"score": 0.0022717738872652013, "phrase": "considered_inference_problems"}, {"score": 0.002256119841032938, "phrase": "pspace"}, {"score": 0.0021867999937268084, "phrase": "polynomial_time"}, {"score": 0.002149231173009159, "phrase": "relatively_mild_assumptions"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Commonsense reasoning", " Conceptual spaces", " Interpolative reasoning", " Analogical reasoning"], "paper_abstract": "Many logical theories are incomplete, in the sense that non-trivial conclusions about particular situations cannot be derived from them using classical deduction. In this paper, we show how the ideas of interpolation and extrapolation, which are of crucial importance in many numerical domains, can be applied in symbolic settings to alleviate this issue in the case of propositional categorization rules. Our method is based on (mainly) qualitative descriptions of how different properties are conceptually related, where we identify conceptual relations between properties with spatial relations between regions in Gardenfors conceptual spaces. The approach is centred around the view that categorization rules can often be seen as approximations of linear (or at least monotonic) mappings between conceptual spaces. We use this assumption to justify that whenever the antecedents of a number of rules stand in a relationship that is invariant under linear (or monotonic) transformations, their consequents should also stand in that relationship. A form of interpolative and extrapolative reasoning can then be obtained by applying this idea to the relations of betweenness and parallelism respectively. After discussing these ideas at the semantic level, we introduce a number of inference rules to characterize interpolative and extrapolative reasoning at the syntactic level, and show their soundness and completeness w.r.t. the proposed semantics. Finally, we show that the considered inference problems are PSPACE-hard in general, while implementations in polynomial time are possible under some relatively mild assumptions. (C) 2013 Elsevier B.V. All rights reserved.", "paper_title": "Interpolative and extrapolative reasoning in propositional theories using qualitative knowledge about conceptual spaces", "paper_id": "WOS:000324354700004"}