{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "smart_building_applications"}, {"score": 0.04756494355891956, "phrase": "context_information"}, {"score": 0.046114804435266145, "phrase": "sba_developers"}, {"score": 0.03773337458833724, "phrase": "context_simulator"}, {"score": 0.02814259643228829, "phrase": "simcon_model"}, {"score": 0.004449045430179066, "phrase": "smart_building"}, {"score": 0.004185377431624781, "phrase": "sensing_technology"}, {"score": 0.004155399041702324, "phrase": "potentially_complex_interactions"}, {"score": 0.004110831924517065, "phrase": "sensed_phenomenon"}, {"score": 0.004023120753104693, "phrase": "physical_environment"}, {"score": 0.003923144245133288, "phrase": "context_simulators"}, {"score": 0.0038810583785936505, "phrase": "simulated_context_information"}, {"score": 0.0037710151976096985, "phrase": "key_challenges"}, {"score": 0.0034097787109430384, "phrase": "different_mixes"}, {"score": 0.00326572165784246, "phrase": "evaluation_task"}, {"score": 0.0030499419496128276, "phrase": "sba"}, {"score": 0.002708399936381754, "phrase": "sba_behaviour"}, {"score": 0.002538470301402269, "phrase": "particular_location_context"}, {"score": 0.0025112011945912327, "phrase": "configurable_levels"}, {"score": 0.0023367260405565814, "phrase": "visualisation_tool"}], "paper_keywords": ["Context simulation", " Uncertainty in context", " Smart building application evaluation", " Usability evaluation"], "paper_abstract": "Smart Building Applications (SBAs) adapt their behaviour in response to context information generated by sensors present in the smart building. SBA developers must account for uncertainty in the accuracy of context information resulting from imperfection in the sensing technology and potentially complex interactions between the sensed phenomenon, the sensor and the physical environment. To address this challenge, context simulators which generate simulated context information have been developed. A number of key challenges must be addressed before such a simulation-based SBA prototyping approach can become widely used. First, any context simulator must be flexible in its approach to simulating context so that it supports evaluating different mixes of SBAs using a selection of methods most suitable to the evaluation task at hand. Second, the context simulator must support simulating uncertainty in context as uncertainty can cause an SBA to function incorrectly. Finally, the process of setting up a simulation should be efficient in use, satisfying to the developer and also, be effective in correctly evaluating the SBA behaviour. This paper presents the SimCon model which addresses these challenges by supporting simulation of context, in particular location context, with configurable levels of uncertainty for evaluating SBAs using visualisation. The SimCon model has been implemented in a simulation, configuration and visualisation tool set which has undergone a number of evaluations with SBA developers to determine and improve its level of usability, the most recent of which is presented here. (c) 2013 Elsevier B.V. All rights reserved.", "paper_title": "SimCon: A context simulator for supporting evaluation of smart building applications when faced with uncertainty", "paper_id": "WOS:000336519700010"}