{"auto_keywords": [{"score": 0.044882628188835344, "phrase": "snomed_ct"}, {"score": 0.004858905530520969, "phrase": "scientific_literature"}, {"score": 0.00481495049065317, "phrase": "snomed_ct_use"}, {"score": 0.004780633011300165, "phrase": "objective_the_aim"}, {"score": 0.004579780586951551, "phrase": "systematised_nomenclature"}, {"score": 0.0045471315699087385, "phrase": "medicine_clinical_terms"}, {"score": 0.004387329529902255, "phrase": "published_papers"}, {"score": 0.004172960637092235, "phrase": "pubmed"}, {"score": 0.004143197283767023, "phrase": "embase"}, {"score": 0.004084307764140389, "phrase": "keywords_'systematised_nomenclature"}, {"score": 0.0023609270767241215, "phrase": "content_coverage"}, {"score": 0.0023440589015485077, "phrase": "local_terms"}, {"score": 0.0022777800735119405, "phrase": "first_steps"}, {"score": 0.0021049977753042253, "phrase": "snomed_ct_implementations"}], "paper_keywords": [""], "paper_abstract": "Objective The aim of this paper is to report on the use of the systematised nomenclature of medicine clinical terms (SNOMED CT) by providing an overview of published papers. Methods Published papers on SNOMED CT between 2001 and 2012 were identified using PubMed and Embase databases using the keywords 'systematised nomenclature of medicine' and 'SNOMED CT'. For each paper the following characteristics were retrieved: SNOMED CT focus category (ie, indeterminate, theoretical, pre-development/design, implementation and evaluation/commodity), usage category (eg, prospective content coverage, used to classify or code in a study), medical domain and country. Results Our search strategy identified 488 papers. A comparison between the papers published between 2001-6 and 2007-12 showed an increase in every SNOMED CT focus category. The number of papers classified as 'theoretical' increased from 46 to 78, 'pre-development/design' increased from 61 to 173 and 'implementation' increased from 10 to 34. Papers classified as 'evaluation/commodity' only started to appear from 2010. Conclusions The majority of studies focused on 'theoretical' and 'pre-development/design'. This is still encouraging as SNOMED CT is being harmonized with other standardized terminologies and is being evaluated to determine the content coverage of local terms, which is usually one of the first steps towards adoption. Most implementations are not published in the scientific literature, requiring a look beyond the scientific literature to gain insights into SNOMED CT implementations.", "paper_title": "Literature review of SNOMED CT use", "paper_id": "WOS:000337672800004"}