{"auto_keywords": [{"score": 0.04653732944101599, "phrase": "r-d_models"}, {"score": 0.007273357513672805, "phrase": "time_complexity"}, {"score": 0.00481495049065317, "phrase": "rate-distortion_models"}, {"score": 0.004781498797706604, "phrase": "fine-grained_scalable_video_sequences"}, {"score": 0.004569630374630379, "phrase": "expected_level"}, {"score": 0.0044906540097516545, "phrase": "reconstructed_video_stream"}, {"score": 0.004382364826200616, "phrase": "received_video_quality"}, {"score": 0.004351905364003354, "phrase": "different_network_conditions"}, {"score": 0.004232160987948483, "phrase": "increasingly_popular_fine-grained_scalable_video_sequences"}, {"score": 0.0041589926969138585, "phrase": "models'_relative_performance"}, {"score": 0.0037587915908689497, "phrase": "valid_results"}, {"score": 0.0036937768530367647, "phrase": "quantitative_performance_analysis"}, {"score": 0.003542276457435362, "phrase": "target_streaming_system"}, {"score": 0.0033265580369717996, "phrase": "fgs_coders"}, {"score": 0.0026142283623653405, "phrase": "diverse_set"}, {"score": 0.0025960262223338293, "phrase": "video_sequences"}, {"score": 0.0025156683465194967, "phrase": "diverse_channel_conditions"}, {"score": 0.0024807547991927137, "phrase": "different_frame_types"}, {"score": 0.0023133055945761235, "phrase": "clear_systematic_ways"}, {"score": 0.0021646872269755067, "phrase": "justified_list"}, {"score": 0.002119764367112061, "phrase": "best_r-d_models"}], "paper_keywords": ["performance", " multimedia streaming", " fine-grained scalable coding", " rate-distortion models"], "paper_abstract": "Rate-distortion ( R-D) models are functions that describe the relationship between the bitrate and expected level of distortion in the reconstructed video stream. R-D models enable optimization of the received video quality in different network conditions. Several R-D models have been proposed for the increasingly popular fine-grained scalable video sequences. However, the models' relative performance has not been thoroughly analyzed. Moreover, the time complexity of each model is not known, nor is the range of bitrates in which the model produces valid results. This lack of quantitative performance analysis makes it difficult to select the model that best suits a target streaming system. In this article, we classify, analyze, and rigorously evaluate all R-D models proposed for FGS coders in the literature. We classify R-D models into three categories: analytic, empirical, and semi-analytic. We describe the characteristics of each category. We analyze the R-D models by following their mathematical derivations, scrutinizing the assumptions made, and explaining when the assumptions fail and why. In addition, we implement all R-D models, a total of eight, and evaluate them using a diverse set of video sequences. In our evaluation, we consider various source characteristics, diverse channel conditions, different encoding/decoding parameters, different frame types, and several performance metrics including accuracy, range of applicability, and time complexity of each model. We also present clear systematic ways ( pseudo codes) for constructing various R-D models from a given video sequence. Based on our experimental results, we present a justified list of recommendations on selecting the best R-D models for video-on-demand, video conferencing, real-time, and peer-to-peer streaming systems.", "paper_title": "On the accuracy and complexity of rate-distortion models for fine-grained scalable video sequences", "paper_id": "WOS:000256264900007"}