{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "electronic_commerce"}, {"score": 0.004749646583168342, "phrase": "recommender_systems"}, {"score": 0.0042579795015449005, "phrase": "current_recommender_systems"}, {"score": 0.003540539868937462, "phrase": "commercial_interests"}, {"score": 0.0032616462517547477, "phrase": "accurate_recommendations"}, {"score": 0.003195414285736136, "phrase": "legitimately_compiled_valuable_information"}, {"score": 0.003025277245730244, "phrase": "theoretical_approach"}, {"score": 0.0029235593748707495, "phrase": "alambic"}, {"score": 0.002767856819656175, "phrase": "hybrid_recommender_system"}, {"score": 0.002497862210672172, "phrase": "semi-trusted_third_party"}, {"score": 0.0023810183846557486, "phrase": "sensitive_information"}], "paper_keywords": ["privacy protection", " recommender system", " secure two-party computation", " semi-trusted third party", " web personalization"], "paper_abstract": "Recommender systems enable merchants to assist customers in finding products that best satisfy their needs. Unfortunately, current recommender systems suffer from various privacy-protection vulnerabilities. Customers should be able to keep private their personal information, including their buying preferences, and they should not be tracked against their will. The commercial interests of merchants should also be protected by allowing them to make accurate recommendations without revealing legitimately compiled valuable information to third parties. We introduce a theoretical approach for a system called Alambic, which achieves the above privacy-protection objectives in a hybrid recommender system that combines content-based, demographic and collaborative filtering techniques. Our system splits customer data between the merchant and a semi-trusted third party, so that neither can derive sensitive information from their share alone. Therefore, the system could only be subverted by a coalition between these two parties.", "paper_title": "ALAMBIC: a privacy-preserving recommender system for electronic commerce", "paper_id": "WOS:000259671500001"}