{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "elite_population"}, {"score": 0.00842341616687341, "phrase": "nnca"}, {"score": 0.005798842803688727, "phrase": "'search_stagnation'_situation"}, {"score": 0.004745260932479212, "phrase": "nondominated_neighbor"}, {"score": 0.004564291332315995, "phrase": "novel_coevolutionary_mechanism"}, {"score": 0.004476399615305783, "phrase": "multiobjective_optimization"}, {"score": 0.004411588377842043, "phrase": "elite_individuals"}, {"score": 0.0040027552011993005, "phrase": "common_population"}, {"score": 0.0038127186374325582, "phrase": "less-crowded_region"}, {"score": 0.00303319936111073, "phrase": "size_guarantee_mechanism"}, {"score": 0.002875027551180213, "phrase": "dominated_individuals"}, {"score": 0.002765186974035098, "phrase": "sgm"}, {"score": 0.002659527314613792, "phrase": "limited_nondominated_individuals"}, {"score": 0.00247215300812495, "phrase": "mutation_operator"}, {"score": 0.002331781764406665, "phrase": "diversity_property"}, {"score": 0.002220900173110114, "phrase": "five_dtlz_problems"}, {"score": 0.0021049977753042253, "phrase": "seven_the_state-of-the-art_multiobjective_optimization_algorithms"}], "paper_keywords": ["Multiple objective programming", " Evolutionary computations", " Coevolutionary algorithm", " Elite population"], "paper_abstract": "A nondominated neighbor coevolutionary algorithm (NNCA) with a novel coevolutionary mechanism is proposed for multiobjective optimization, where elite individuals are used to guide the search. All the nondominated individuals are divided into two subpopulations, namely, the elite population and the common population according to their crowding-distance values. The elite individual located in less-crowded region will have more chances to select more team members for its own team and thus this region can be explored more sufficiently. Therefore, the elite population will guide the search to the more promising and less-crowded region. Secondly, to avoid the 'search stagnation' situation which means that algorithms fail to find enough nondominated solutions, a size guarantee mechanism (SGM) is proposed for elite population by emigrating some dominated individuals to the elite population when necessary. The SGM can prevent the algorithm from searching around limited nondominated individuals and being trapped into the 'search stagnation' situation. In addition, several different kinds of crossover and mutation operator are used to generate offspring, which are benefits for the diversity property. Tests on 20 multiobjective optimization benchmark problems including five ZDT problems, five DTLZ problems and ten unconstrained CEC09 test problems show that NNCA is very competitive compared with seven the state-of-the-art multiobjective optimization algorithms.", "paper_title": "Multiobjective nondominated neighbor coevolutionary algorithm with elite population", "paper_id": "WOS:000351472300015"}