{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "state-based_squeak"}, {"score": 0.015153647200097197, "phrase": "robot_programming_education"}, {"score": 0.004590820632326585, "phrase": "robot_programming"}, {"score": 0.004518442937844318, "phrase": "students'_interest"}, {"score": 0.0041074234667687875, "phrase": "robot_movements"}, {"score": 0.004042635935882651, "phrase": "essential_requirements"}, {"score": 0.003813669883040509, "phrase": "new_programming_language"}, {"score": 0.0036942726653704213, "phrase": "novice_students"}, {"score": 0.0034118234596993836, "phrase": "new_language"}, {"score": 0.0030847461428168614, "phrase": "students'_understanding"}, {"score": 0.0027741761880779535, "phrase": "higher_completion_ratio"}, {"score": 0.0025348408238837655, "phrase": "robot_programming_language"}, {"score": 0.002328434471939886, "phrase": "middle_school_students"}, {"score": 0.0021049977753042253, "phrase": "professional_programmers"}], "paper_keywords": ["Robot programming", " programming paradigm", " state control"], "paper_abstract": "Robot programming often sparks students' interest in programming, but it is not easy for them to program both procedure and reactivity of robot movements that are essential requirements. In this study, we reviewed in detail a new programming language, State-Based Squeak. It allows novice students to implement both procedure and reactivity of robots easily. The effect of this new language on robot programming education was also examined using a group of 28 middle school students. According to the results of analyzing the students' understanding of programming, reading and programming abilities the group that used State-Based Squeak (the experimental group) showed a higher completion ratio than the other (control) group. The significance of this study is that a robot programming language has been developed that addresses the concepts of both procedure and reactivity in such a way that middle school students can more easily learn how to program robots, something that is often difficult to attempt even for professional programmers.", "paper_title": "Development of State-Based Squeak and an Examination of Its Effect on Robot Programming Education", "paper_id": "WOS:000313526300008"}