{"auto_keywords": [{"score": 0.034987181656428126, "phrase": "spatial_configurations"}, {"score": 0.00481495049065317, "phrase": "spatially_aggregated_responses"}, {"score": 0.004527462929045081, "phrase": "aggregated_spatial_scales"}, {"score": 0.004107935669507044, "phrase": "arbitrary_subdivision"}, {"score": 0.0038624981944755813, "phrase": "rigorous_analysis"}, {"score": 0.0037635782112965662, "phrase": "quantitative_changes"}, {"score": 0.003643470150731877, "phrase": "analytical_and_empirical_models"}, {"score": 0.003515758094739175, "phrase": "sensitivity_measures"}, {"score": 0.003348764681887211, "phrase": "vector_space"}, {"score": 0.0031281730014429666, "phrase": "sensitivity_analytical_framework"}, {"score": 0.0030878280304339587, "phrase": "different_dimensions"}, {"score": 0.0029506624896613446, "phrase": "clear_ranking"}, {"score": 0.0028471655497661528, "phrase": "reporting_regions"}, {"score": 0.0028195727965553367, "phrase": "existing_environmental_reporting_application"}, {"score": 0.002566215899764419, "phrase": "spatial_framework"}, {"score": 0.0024923044614470137, "phrase": "hierarchical_way"}, {"score": 0.002436289099444074, "phrase": "integrative_response"}, {"score": 0.0022756672722130424, "phrase": "spatial_configuration"}, {"score": 0.002231747358665628, "phrase": "spatial_sensitivity_framework"}, {"score": 0.0021049977753042253, "phrase": "geographic_maps"}], "paper_keywords": ["spatial sensitivity analysis", " natural-resource management", " sensitivity hierarchy", " spatial configuration"], "paper_abstract": "We often need to report on environmental, economic and social indicators, and properties at aggregated spatial scales, e.g. average income per suburb. To do this, we invariably create reporting polygons that are somewhat arbitrary. The question arises: how much does this arbitrary subdivision of space affect the outcome? In this paper, we develop a new, gradient-based framework for carrying out a rigorous analysis of the sensitivity of integrating functions to quantitative changes in their spatial configuration. This approach is applied to both analytical and empirical models, and it allows the reporting of a hierarchy of sensitivity measures (from global to local). We found that the concepts of a vector space representing the spatial configurations and the response (hyper-)surface on which gradients indicate the sensitivities to be helpful in developing the sensitivity analytical framework of spatial configurations in different dimensions. This approach works well with both analytical and empirical integrating functions. This approach resulted in a clear ranking of the sensitivities of the responses to changes in the reporting regions in an existing environmental reporting application. The approach also allowed us to find which vertices, and the directions of change of those vertices, influenced the outcome most. The application of the spatial framework allows the results to be reported in a hierarchical way, from the sensitivities of an integrative response to changes in a whole reserve/reporting system, down to the sensitivity along each of the dimensions of the vertices in the spatial configuration. The results of the spatial sensitivity framework that we developed in this paper can be readily visualized by plotting the sensitivities as vectors on geographic maps. This simplifies the presentation and facilitates the uptake of the results in the situations where the spatial configurations are complicated.", "paper_title": "Sensitivity analysis of spatially aggregated responses: A gradient-based method", "paper_id": "WOS:000254345900005"}