{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "quantitative_structure-activity_relationship"}, {"score": 0.004656647251517823, "phrase": "wide_distribution"}, {"score": 0.004460703838987562, "phrase": "public_health_concern"}, {"score": 0.004418287966422041, "phrase": "previous_work"}, {"score": 0.004192078165260057, "phrase": "standard_molecular_descriptors"}, {"score": 0.0036845490951857617, "phrase": "two-dimensional_electrophoresis_gels"}, {"score": 0.0036147562669032957, "phrase": "expressed_proteome"}, {"score": 0.0035632774896594524, "phrase": "resulting_spot_abundances"}, {"score": 0.003529364798514874, "phrase": "additional_biological_information"}, {"score": 0.003429544382524185, "phrase": "toxicity_prediction"}, {"score": 0.0033969001271637934, "phrase": "qsar_models"}, {"score": 0.003332537728389913, "phrase": "ridge_regression"}, {"score": 0.0032850648549389025, "phrase": "eight_dependent_toxicity_measures"}, {"score": 0.002699960312990493, "phrase": "better_results"}, {"score": 0.002176747110119268, "phrase": "underlying_methodologies"}, {"score": 0.0021560018573288666, "phrase": "broad_applicability"}, {"score": 0.0021049977753042253, "phrase": "chemical_and_biological_descriptors"}], "paper_keywords": [""], "paper_abstract": "In view of the wide distribution of halocarbons in our world, their toxicity is a public health concern. Previous work has shown that various measures of toxicity can be predicted with standard molecular descriptors. In our work, biodescriptors of the effect of halocarbons on the liver were obtained by exposing hepatocytes to 14 halocarbons and a control and by producing two-dimensional electrophoresis gels to assess the expressed proteome. The resulting spot abundances provide additional biological information that might be used in toxicity prediction. QSAR models were fitted via ridge regression to predict eight dependent toxicity measures: d37, arr, EC50MTT, EC50LDH, EC20SH, LECLP, LECROS, and LECCAT. Three predictor sets were used for each-the chemodescriptors alone, the biodescriptors alone, and the combined set of both chemo- and biodescriptors. The results differed somewhat from one dependent to another, but overall it was shown that better results could be obtained by using both chemo- and biodescriptors in the model than by using either chemo- or biodescriptors alone. The library of compounds used was small and quite homogeneous, so our immediate conclusions are correspondingly limited in scope, but we believe the underlying methodologies have broad applicability at the interface of chemical and biological descriptors.", "paper_title": "Combining chemodescriptors and biodescriptors in quantitative structure-activity relationship modeling", "paper_id": "WOS:000235021200003"}