{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "identical_twins"}, {"score": 0.02053037995946433, "phrase": "talking_profile"}, {"score": 0.009937282172928032, "phrase": "facial_motion"}, {"score": 0.00987215622171619, "phrase": "identity_signatures"}, {"score": 0.004736045157669388, "phrase": "great_challenge"}, {"score": 0.004643055780443262, "phrase": "high_similarities"}, {"score": 0.004536862734384202, "phrase": "psychological_findings"}, {"score": 0.003922580121023413, "phrase": "multiple_types"}, {"score": 0.003896717568943166, "phrase": "usual_face_motions"}, {"score": 0.003368816076401138, "phrase": "higher_weights"}, {"score": 0.003216285378512588, "phrase": "exceptional_motion_reporting_model"}, {"score": 0.0030808211830129304, "phrase": "realistic_facial_motion"}, {"score": 0.003060491505805715, "phrase": "human_subjects"}, {"score": 0.0029608318458226755, "phrase": "video_frame_rate"}, {"score": 0.002883439044844259, "phrase": "video_database"}, {"score": 0.0028173769301594745, "phrase": "experimental_results"}, {"score": 0.0027256122357680393, "phrase": "talking_profiles"}, {"score": 0.0026986685585382347, "phrase": "traditional_appearance"}, {"score": 0.0026194209399161184, "phrase": "non-twin_youtube_dataset"}, {"score": 0.002476009439388887, "phrase": "potential_biometric"}, {"score": 0.002147265537489893, "phrase": "aging_process"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Talking profile", " Identical twins", " Abnormal motions", " EMRM"], "paper_abstract": "Identical twins pose a great challenge to face recognition due to high similarities in their appearances. Motivated by the psychological findings that facial motion contains identity signatures and the observation that twins may look alike but behave differently, we develop a talking profile to use the identity signatures in the facial motion to distinguish between identical twins. The talking profile for a subject is defined as a collection of multiple types of usual face motions from the video. Given two talking profiles, we compute the similarities of the same type of face motion in both profiles and then perform the classification based on those similarities. To compute the similarity of each type of face motion, we give higher weights to more abnormal motions which are assumed to carry more identity signature information. Our approach, named Exceptional Motion Reporting Model (EMRM), is unrelated with appearance, and can handle realistic facial motion in human subjects, with no restrictions of speed of motion or video frame rate. We first conduct our experiments on a video database containing 39 pairs of twins. The experimental results demonstrate that identical twins can be distinguished better by the talking profiles over the traditional appearance based approach. Moreover, we collected a non-twin YouTube dataset with 99 subjects. The results on this dataset verified that the talking profile can be the potential biometric. We further conducted an experiment to test the robustness of talking profile to the time. Videos from 10 subjects which span across years or even decades in their lives are collected. The results indicated the robustness of talking profile to the aging process. (C) 2013 Elsevier B.V. All rights reserved.", "paper_title": "A talking profile to distinguish identical twins", "paper_id": "WOS:000342256700014"}