{"auto_keywords": [{"score": 0.04973021453803807, "phrase": "glore"}, {"score": 0.006055519035760792, "phrase": "lr"}, {"score": 0.00481495049065317, "phrase": "grid_binary_logistic_regression"}, {"score": 0.004710489616113198, "phrase": "shared_models"}, {"score": 0.004625164125506718, "phrase": "objective_the_classification"}, {"score": 0.004591466267316524, "phrase": "complex_or_rare_patterns"}, {"score": 0.004558012799538011, "phrase": "clinical_and_genomic_data"}, {"score": 0.0043147264956783565, "phrase": "centralized_data_sources"}, {"score": 0.00406945841245389, "phrase": "binary_logistic_regression"}, {"score": 0.003937649447496154, "phrase": "distributed_manner"}, {"score": 0.0037961770933599135, "phrase": "patient_data"}, {"score": 0.003646399625591736, "phrase": "central_repository"}, {"score": 0.003476963781647026, "phrase": "decomposable_partial_elements"}, {"score": 0.0034516024325468653, "phrase": "non-privacy_sensitive_prediction_values"}, {"score": 0.0032433414042726356, "phrase": "fit_test_statistic"}, {"score": 0.003161271802988128, "phrase": "receiver_operating_characteristic"}, {"score": 0.0031382180323654605, "phrase": "roc"}, {"score": 0.0029813748433158032, "phrase": "computational_costs"}, {"score": 0.002905914725757534, "phrase": "traditional_lr_model"}, {"score": 0.002863652837038965, "phrase": "combined_data"}, {"score": 0.00253758084385033, "phrase": "coefficient_gradients"}, {"score": 0.0024915167458844914, "phrase": "different_sites"}, {"score": 0.0022817585639886883, "phrase": "data_sets"}], "paper_keywords": [""], "paper_abstract": "Objective The classification of complex or rare patterns in clinical and genomic data requires the availability of a large, labeled patient set. While methods that operate on large, centralized data sources have been extensively used, little attention has been paid to understanding whether models such as binary logistic regression (LR) can be developed in a distributed manner, allowing researchers to share models without necessarily sharing patient data. Material and methods Instead of bringing data to a central repository for computation, we bring computation to the data. The Grid Binary LOgistic REgression (GLORE) model integrates decomposable partial elements or non-privacy sensitive prediction values to obtain model coefficients, the variance-covariance matrix, the goodness-of-fit test statistic, and the area under the receiver operating characteristic (ROC) curve. Results We conducted experiments on both simulated and clinically relevant data, and compared the computational costs of GLORE with those of a traditional LR model estimated using the combined data. We showed that our results are the same as those of LR to a 10(-15) precision. In addition, GLORE is computationally efficient. Limitation In GLORE, the calculation of coefficient gradients must be synchronized at different sites, which involves some effort to ensure the integrity of communication. Ensuring that the predictors have the same format and meaning across the data sets is necessary. Conclusion The results suggest that GLORE performs as well as LR and allows data to remain protected at their original sites.", "paper_title": "Grid Binary LOgistic REgression (GLORE): building shared models without sharing data", "paper_id": "WOS:000307934600011"}