{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "natural_language_tools"}, {"score": 0.004650330504968421, "phrase": "pipeline_architecture"}, {"score": 0.004530552828603269, "phrase": "nlp_tools"}, {"score": 0.004337710093279712, "phrase": "successive_transformations"}, {"score": 0.003941746077126688, "phrase": "information_losses"}, {"score": 0.0032404677650217407, "phrase": "nlp_systems"}, {"score": 0.0031023662967184216, "phrase": "client_server_architecture"}, {"score": 0.0027943943921568456, "phrase": "conceptual_model"}, {"score": 0.0027461155463816772, "phrase": "client_tools"}, {"score": 0.002652039172817654, "phrase": "broad_range"}, {"score": 0.002629026692001082, "phrase": "linguistic_information"}, {"score": 0.002516917671182532, "phrase": "generic_api"}, {"score": 0.0024519545383399773, "phrase": "new_data"}, {"score": 0.0022472527731744974, "phrase": "communication_protocol_details"}, {"score": 0.0021049977753042253, "phrase": "server_use"}], "paper_keywords": [""], "paper_abstract": "Natural Language processing (NLP) systems are typically characterized by a pipeline architecture in which several independently developed NLP tools, connected as a chain of filters, apply successive transformations to the data that flows through the system. Hence when integrating such tools, one may face problems that lead to information losses, such as: (i) tools discard information from their input which will be required by other tools further along the pipeline; (ii) each tool has its own input/output format. This work proposes a solution that solves these problems. We offer a framework for NLP systems. The systems built using this framework use a client server architecture, in which the server acts as a blackboard where all tools add/consult data. Data is kept in the server under a conceptual model independent of the client tools, thus allowing the representation of a broad range of linguistic information. The tools interact with the server through a generic API which allows the creation of new data and the navigation through all the existing data. Moreover, we provide libraries implemented in several programming language that abstract the connection and communication protocol details between the tools and the server, and provide several levels of functionality that simplify server use.", "paper_title": "A framework for integrating natural language tools", "paper_id": "WOS:000237665800012"}