{"auto_keywords": [{"score": 0.03323248941990375, "phrase": "relative_motion"}, {"score": 0.00481495049065317, "phrase": "parallel_kinematic_machines"}, {"score": 0.004598933498016774, "phrase": "\"five-axis_machines"}, {"score": 0.004283913685201902, "phrase": "output_motion"}, {"score": 0.004125934074896249, "phrase": "output_motion_pattern"}, {"score": 0.004040688646993605, "phrase": "different_structural_topologies"}, {"score": 0.003701401653850141, "phrase": "rotational_and_translational_dof"}, {"score": 0.0035947360742084253, "phrase": "good_stiffness"}, {"score": 0.0032517953640748163, "phrase": "cnc"}, {"score": 0.002966084234963723, "phrase": "kinematic_relations"}, {"score": 0.0028209599545587745, "phrase": "motion_pattern"}, {"score": 0.0027741761880779535, "phrase": "direct_and_inverse_kinematics"}, {"score": 0.002509284173541882, "phrase": "parallel_module"}, {"score": 0.002436888552432559, "phrase": "working_table"}, {"score": 0.0023864566654035924, "phrase": "serial_module"}, {"score": 0.0023079225317714815, "phrase": "hermes_parallel_manipulator"}, {"score": 0.0022696277881969896, "phrase": "rotary_and_linear_tables"}, {"score": 0.0021049977753042253, "phrase": "new_machine"}], "paper_keywords": ["Parallel manipulators", " Co-operation", " Rotary table", " Motion pattern", " Relative motion"], "paper_abstract": "This paper looks at the \"five-axis machines\" for machining operations. These machines have five (or six at maximum) degrees of freedom (dof). The output motion must have at least three translational and two rotational dof. This output motion pattern can be obtained with different structural topologies: serial, parallel, hybrid and with serial and/or parallel manipulators working in co-operation. The latter allows higher motion ranges in rotational and translational dof. Moreover, it provides a good stiffness, a highly valued requisite in applications like machining. Manipulators of this type are characterized by their kinematics to be integrated in the CNC, which requires the study of the relative motion between their modules. This motion is usually complex, and in certain cases presents kinematic relations not evident. This work presents a methodology to solve the motion pattern out of the direct and inverse kinematics of the relative motion between the modules of which the manipulator is composed. On the one hand, the spindle is mounted on a parallel module. On the other hand, the working table is mounted on a serial module. This methodology was applied to the Hermes parallel manipulator in combination with rotary and linear tables. As a result, a series of considerations regarding other possible combinations between modules was made and a new machine is proposed. (c) 2008 Elsevier Ltd. All rights reserved.", "paper_title": "Motion pattern analysis of parallel kinematic machines: A case study", "paper_id": "WOS:000262147700016"}