{"auto_keywords": [{"score": 0.049226991195811136, "phrase": "dynamic_agent_composition"}, {"score": 0.00481495049065317, "phrase": "large-scale_agent-based_models"}, {"score": 0.004633153497593343, "phrase": "flexible_and_extensible_large-scale_agent-based_models"}, {"score": 0.004390067952425289, "phrase": "abm"}, {"score": 0.004356385318931493, "phrase": "underlying_networked_structure"}, {"score": 0.0040438338011467845, "phrase": "dynamic_agent_composition_approach"}, {"score": 0.003931211989641077, "phrase": "atomic_units"}, {"score": 0.0038413947966606118, "phrase": "complex_system_representation"}, {"score": 0.0037152558756361606, "phrase": "fine_level"}, {"score": 0.003658438093694035, "phrase": "vast_range"}, {"score": 0.0033697163894687602, "phrase": "modam"}, {"score": 0.0033337759789823776, "phrase": "model"}, {"score": 0.0032009160232892046, "phrase": "electricity_distribution_network"}, {"score": 0.0029180369943736517, "phrase": "networked_structure"}, {"score": 0.0028881867479589045, "phrase": "water_or_gas_networks"}, {"score": 0.002800450565219743, "phrase": "agent-based_models"}, {"score": 0.0026945086500597304, "phrase": "agent-based_modelling"}, {"score": 0.002673804838281251, "phrase": "scientific_approach"}, {"score": 0.0025792654256039187, "phrase": "previously_written_code"}, {"score": 0.0023694065215394593, "phrase": "large-scales_abms"}, {"score": 0.0022390533383717715, "phrase": "natural_simulation_space"}, {"score": 0.0022104400388951654, "phrase": "networked_structures"}, {"score": 0.0021049977753042253, "phrase": "alternative_simulations"}], "paper_keywords": ["Agent-based model", " Dynamic composition", " Large-scale", " Electricity distribution network"], "paper_abstract": "Purpose: This paper describes dynamic agent composition, used to support the development of flexible and extensible large-scale agent-based models (ABMs). This approach was motivated by a need to extend and modify, with ease, an ABM with an underlying networked structure as more information becomes available. Flexibility was also sought after so that simulations are set up with ease, without the need to program. Methods: The dynamic agent composition approach consists in having agents, whose implementation has been broken into atomic units, come together at runtime to form the complex system representation on which simulations are run. These components capture information at a fine level of detail and provide a vast range of combinations and options for a modeller to create ABMs. Results: A description of the dynamic agent composition is given in this paper, as well as details about its implementation within MODAM (MODular Agent-based Model), a software framework which is applied to the planning of the electricity distribution network. Illustrations of the implementation of the dynamic agent composition are consequently given for that domain throughout the paper. It is however expected that this approach will be beneficial to other problem domains, especially those with a networked structure, such as water or gas networks. Conclusions: Dynamic agent composition has many advantages over the way agent-based models are traditionally built for the users, the developers, as well as for agent-based modelling as a scientific approach. Developers can extend the model without the need to access or modify previously written code; they can develop groups of entities independently and add them to those already defined to extend the model. Users can mix-and-match already implemented components to form large-scales ABMs, allowing them to quickly setup simulations and easily compare scenarios without the need to program. The dynamic agent composition provides a natural simulation space over which ABMs of networked structures are represented, facilitating their implementation; and verification and validation of models is facilitated by quickly setting up alternative simulations.", "paper_title": "Dynamic agent composition for large-scale agent-based models", "paper_id": "WOS:000355627800001"}