{"auto_keywords": [{"score": 0.04372905839133178, "phrase": "delta"}, {"score": 0.008612680084704808, "phrase": "bounded_neighborhood_independence"}, {"score": 0.0048149961516170065, "phrase": "distributed"}, {"score": 0.004704495156558224, "phrase": "edge-coloring_problem"}, {"score": 0.00467185299669322, "phrase": "message-passing_model"}, {"score": 0.004267468074128779, "phrase": "distrib_comput"}, {"score": 0.004208520344198998, "phrase": "thousand_currency_sign"}, {"score": 0.00415019999222481, "phrase": "maximum_degree"}, {"score": 0.004121387886044864, "phrase": "input_graph"}, {"score": 0.004083281377007922, "phrase": "recent_results"}, {"score": 0.004064360214082812, "phrase": "barenboim"}, {"score": 0.004045526747889849, "phrase": "elkin"}, {"score": 0.0036694883795778854, "phrase": "significantly_faster_deterministic_edge-coloring_algorithm"}, {"score": 0.003422411319890915, "phrase": "state-of-the-art_running_time"}, {"score": 0.00332828739329299, "phrase": "almost_the_entire_range"}, {"score": 0.00322173228196031, "phrase": "wide_range"}, {"score": 0.0030398432591176357, "phrase": "small_values"}, {"score": 0.002956209594959227, "phrase": "fixed_delta"}, {"score": 0.0027570267191549774, "phrase": "entire_range"}, {"score": 0.0026317312518257803, "phrase": "vertex-coloring_problem"}, {"score": 0.0025772169270836015, "phrase": "large_family"}, {"score": 0.0025355968118803956, "phrase": "line_graphs"}, {"score": 0.0023923518995800303, "phrase": "bounded_growth"}, {"score": 0.0023537101705489957, "phrase": "vertex-coloring_graphs"}, {"score": 0.0022729905063809766, "phrase": "general_graphs"}, {"score": 0.0021148168777274964, "phrase": "previous_efficient_distributed_routines"}, {"score": 0.0021049977753042253, "phrase": "m-defective_p-coloring_the_product_m_center_dot_p"}], "paper_keywords": ["Defective-coloring", " Legal-coloring", " Line-graphs"], "paper_abstract": "We study the edge-coloring problem in the message-passing model of distributed computing. This is one of the most fundamental problems in this area. Currently, the best-known deterministic algorithms for (2 Delta -1)-edge-coloring requires O(Delta) + log* n time (Panconesi and Rizzi in Distrib Comput 14(2):97-100, 2001), where Delta is the maximum degree of the input graph. Also, recent results of Barenboim and Elkin (2010) for vertex-coloring imply that one can get an O(Delta)-edge-coloring in time, and an -edge-coloring in O(log Delta log n) time, for an arbitrarily small constant . In this paper we devise a significantly faster deterministic edge-coloring algorithm. Specifically, our algorithm computes an O(Delta)-edge-coloring in time, and an -edge-coloring in O(log Delta) + log* n time. This result improves the state-of-the-art running time for deterministic edge-coloring with this number of colors in almost the entire range of maximum degree Delta. Moreover, it improves it exponentially in a wide range of Delta, specifically, for 2 (Omega(log*n)) a parts per thousand currency sign Delta a parts per thousand currency sign polylog(n). In addition, for small values of Delta (up to log(1 - delta) n, for some fixed delta > 0) our deterministic algorithm outperforms all the existing randomized algorithms for this problem. Also, our algorithm is the first O(Delta)-edge-coloring algorithm that has running time o(Delta) + log* n, for the entire range of Delta. All previous (deterministic and randomized) O(Delta)-edge-coloring algorithms require time. On our way to these results we study the vertex-coloring problem on graphs with bounded neighborhood independence. This is a large family of graphs, which strictly includes line graphs of r-hypergraphs (i.e., hypergraphs in which each hyperedge contains r or less vertices) for r = O(1), and graphs of bounded growth. We devise a very fast deterministic algorithm for vertex-coloring graphs with bounded neighborhood independence. This algorithm directly gives rise to our edge-coloring algorithms, which apply to general graphs. Our main technical contribution is a subroutine that computes an O(Delta/p)-defective p-vertex coloring of graphs with bounded neighborhood independence in O(p (2)) + log* n time, for a parameter p, 1 a parts per thousand currency sign p a parts per thousand currency sign Delta. In all previous efficient distributed routines for m-defective p-coloring the product m center dot p is super-linear in Delta. In our routine this product is linear in Delta, and this enables us to speed up the algorithm drastically.", "paper_title": "Distributed deterministic edge coloring using bounded neighborhood independence", "paper_id": "WOS:000325816000002"}