{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "isotopy_invariants"}, {"score": 0.004641890423057823, "phrase": "automatic_construction"}, {"score": 0.004593591780245872, "phrase": "isomorphic_classification_theorems"}, {"score": 0.004545793387330536, "phrase": "algebraic_domains"}, {"score": 0.004451676867747938, "phrase": "isotopy_equivalence_relation"}, {"score": 0.0037066895459425824, "phrase": "loop_theory"}, {"score": 0.003554661425339528, "phrase": "isotopic_invariants"}, {"score": 0.0034267429854665035, "phrase": "universal_identities"}, {"score": 0.0029593432468318745, "phrase": "isotopy_class"}, {"score": 0.002693018258362651, "phrase": "intricate_interplay"}, {"score": 0.0026649432435828842, "phrase": "computer_algebra"}, {"score": 0.002637160140011997, "phrase": "model_generation"}, {"score": 0.0026096659285441384, "phrase": "theorem_proving"}, {"score": 0.002387214876538434, "phrase": "isotopic_classification_theorem"}, {"score": 0.0022653055209664284, "phrase": "previously_known_result"}, {"score": 0.0021049977753042253, "phrase": "automated_reasoning_techniques"}], "paper_keywords": [""], "paper_abstract": "We extend our previous study of the automatic construction of isomorphic classification theorems for algebraic domains by considering the isotopy equivalence relation, which is of more importance than isomorphism in certain domains. This extension was not straightforward, and we had to solve two major technical problems, namely generating and verifying isotopy invariants. Concentrating on the domain of loop theory, we have developed three novel techniques for generating isotopic invariants, by using the notion of universal identities and by using constructions based on substructures. In addition, given the complexity of the theorems which verify that a conjunction of the invariants form an isotopy class, we have developed ways of simplifying the problem of proving these theorems. Our techniques employ an intricate interplay of computer algebra, model generation, theorem proving and satisfiability solving methods. To demonstrate the power of the approach, we generate an isotopic classification theorem for loops of size 6, which extends the previously known result that there are 22. This result was previously beyond the capabilities of automated reasoning techniques.", "paper_title": "Automatic construction and verification of isotopy invariants", "paper_id": "WOS:000240085600005"}