{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "paillier_encryption"}, {"score": 0.04861823021267307, "phrase": "voting_system"}, {"score": 0.02469693564196082, "phrase": "ballot_forms"}, {"score": 0.0037704502704526996, "phrase": "election_results"}, {"score": 0.0036052633308076933, "phrase": "new_requirement"}, {"score": 0.0033883824438527316, "phrase": "ballot_secrecy"}, {"score": 0.0032287289440915187, "phrase": "particular_voting_protocol"}, {"score": 0.0030872017736888113, "phrase": "new_version"}, {"score": 0.0030135741897058844, "phrase": "special_features"}, {"score": 0.002982557900944478, "phrase": "paillier_encryption_algorithm"}, {"score": 0.002841971477743441, "phrase": "previous_versions"}, {"score": 0.002736162634990377, "phrase": "secret_key_holder"}, {"score": 0.0026161698049580804, "phrase": "simplified_auditing"}, {"score": 0.0025892330566358503, "phrase": "ballot_receipts"}, {"score": 0.002527451565708784, "phrase": "zero-knowledge_proofs"}, {"score": 0.0024842242921857705, "phrase": "verified_random_functions"}, {"score": 0.0023834640793589435, "phrase": "secrecy_requirements"}, {"score": 0.0023426936553484546, "phrase": "new_construction"}, {"score": 0.0022710523337245337, "phrase": "voter_protocol"}, {"score": 0.0022015970225369975, "phrase": "full_permutations"}, {"score": 0.0021564750534280863, "phrase": "simple_cyclic_shifts"}, {"score": 0.0021049977753042253, "phrase": "mix_versions"}], "paper_keywords": ["verifiable voting", " high assurance elections"], "paper_abstract": "It is immensely challenging to devise a voting system that guarantees both the correct reflection of the will of the voters and the secrecy of the ballots, based solely on compelling, objective evidence. In response to this challenge, various voting protocols have been proposed, typically using cryptography, that seek to base the assurance of accuracy on transparency and auditability. This approach is neatly captured by the maxim \"verify the election results, not the voting system!''. Such protocols strive to achieve a new requirement, that of voter-verifiability: voters are able to confirm that their vote is accurately counted while maintaining ballot secrecy. This paper describes the concept of voter-verifiability, and it outlines a particular voting protocol, the Pret a Voter protocol, for achieving voter-verifiability. A new version of the protocol that exploits some special features of the Paillier encryption algorithm is presented. This gives a more elegant and robust implementation of Pret a Voter than the previous versions. In particular, the fact that Paillier encryption allows the secret key holder to recover the randomisation as well as the plaintext, enables a simplified auditing of the ballot receipts and avoids the need to provide Zero-Knowledge Proofs. The use of Verified Random Functions is proposed as a way to prevent any manipulation undermining the secrecy requirements. Finally, a new construction of the ballot forms used in the Pret a Voter protocol is presented that allows the ballot forms to carry full permutations of the candidates rather than simple cyclic shifts of earlier, re-encryption mix versions of this protocol. (c) 2008 Elsevier Ltd. All rights reserved.", "paper_title": "Pret a Voter with Paillier encryption", "paper_id": "WOS:000259637500028"}