{"auto_keywords": [{"score": 0.048193365666829406, "phrase": "stahel-donoho_estimator"}, {"score": 0.010372983229429906, "phrase": "huberized_outlyingness"}, {"score": 0.007195553501874664, "phrase": "actual_outlyingness"}, {"score": 0.00481495049065317, "phrase": "stahel-donoho"}, {"score": 0.004494570360108983, "phrase": "weighted_mean"}, {"score": 0.004053362743156545, "phrase": "high_dimensions"}, {"score": 0.0038271712887391015, "phrase": "outlying_measurements"}, {"score": 0.0032028587883593702, "phrase": "contaminated_observations"}, {"score": 0.0026041635822373265, "phrase": "non-contaminated_observations"}, {"score": 0.002530359917257626, "phrase": "resulting_adapted_stahel-donoho_estimator"}, {"score": 0.002472822097373027, "phrase": "large_numbers"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Robust multivariate estimators", " Outlier identification", " Outlyingness", " Huberization"], "paper_abstract": "The Stahel-Donoho estimator is defined as a weighted mean and covariance, where the weight of each observation depends on a measure of its outlyingness. In high dimensions, it can easily happen that a number of outlying measurements are present in such a way that the majority of observations are contaminated in at least one of their components. In these situations, the Stahel-Donoho estimator has difficulties in identifying the actual outlyingness of the contaminated observations. An adaptation of the Stahel-Donoho estimator is presented in which the data are huberized before the outlyingness is computed. It is shown that the huberized outlyingness better reflects the actual outlyingness of each observation towards the non-contaminated observations. Therefore, the resulting adapted Stahel-Donoho estimator can better withstand large numbers of outliers. It is demonstrated that the Stahel-Donoho estimator based on huberized outlyingness works especially well when the data are heavily contaminated. (C) 2011 Elsevier B.V. All rights reserved.", "paper_title": "A Stahel-Donoho estimator based on huberized outlyingness", "paper_id": "WOS:000298122600008"}