{"auto_keywords": [{"score": 0.0496463517482477, "phrase": "large_lectures"}, {"score": 0.013737006137961208, "phrase": "formative_feedback_practice"}, {"score": 0.00481495049065317, "phrase": "formative_feedback_spaces"}, {"score": 0.004664352260912174, "phrase": "predominant_way"}, {"score": 0.00460125407969429, "phrase": "first-year_students"}, {"score": 0.004518456027983714, "phrase": "norway"}, {"score": 0.004088807948906792, "phrase": "sequential_mixed_methods_study"}, {"score": 0.003942877273973905, "phrase": "student-response_system"}, {"score": 0.0037506567448470163, "phrase": "students'_ability"}, {"score": 0.0036167509502276294, "phrase": "supply_insight"}, {"score": 0.0032135959043774085, "phrase": "qualitative_method_course"}, {"score": 0.0031845067058084583, "phrase": "first-year_psychology_students"}, {"score": 0.0030017207229983385, "phrase": "positive_correlation"}, {"score": 0.0024129269611844794, "phrase": "greater_extent"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Feedback", " Plenary lectures", " Higher education", " Formative assessment", " Interactive learning environments"], "paper_abstract": "Large lectures are the predominant way of teaching first-year students at universities in Norway. However, this forum for education is seldom discussed as a context for a formative feedback practice. The purpose of this sequential mixed methods study was to address whether and how a student-response system can open for a formative feedback practice in lectures and thereby support students' ability to monitor their own learning, as well as supply insight into how students engage with the feedback in their course work. The context for the study was large lectures (150-200 students) in a qualitative method course for first-year psychology students. Findings from the survey (n = 149) showed a positive correlation between the extent to which students report that they use clickers to monitor their own learning, and the extent to which they report that they used the feedback in their own course work. However, findings indicate that students valued the process of monitoring their own learning during the lectures to a greater extent than they actually used the feedback in their course work. Findings from interviews (n = 6) illustrated various ways students applied feedback in their course work. (C) 2015 Elsevier Ltd. All rights reserved.", "paper_title": "Creating formative feedback spaces in large lectures", "paper_id": "WOS:000363818800005"}