{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "ambient_intelligence"}, {"score": 0.00367658459781873, "phrase": "software_point"}, {"score": 0.0030888830649190282, "phrase": "available_hardware"}, {"score": 0.0027943943921568456, "phrase": "system_interoperability"}, {"score": 0.0025500402081330394, "phrase": "different_platforms"}, {"score": 0.0024095777415804346, "phrase": "destination_platform"}, {"score": 0.0023886641270884973, "phrase": "physical_environment"}, {"score": 0.0022472527731744974, "phrase": "general-purpose_middleware"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Ambient intelligence", " Ubiquitous computing", " Mobility", " Service collaboration", " Smartphone"], "paper_abstract": "Ambient Intelligence (AmI) systems need to be as transparent as possible, that is, their users should perceive only the effects of the features presented to them and, in some cases, some kind of interface. They should not be conscious of how these features are implemented, from a hardware or from a software point of view. In order to obtain such a high degree of transparency, it is necessary for the system to be able to provide its services regardless of location, adapting to the environment and the context in general and to the available hardware more specifically. This is known as ubiquity, and to achieve it requires considering many aspects, from security and privacy to system interoperability. This paper is mainly focused on the development of two elements related to ubiquity: physical migration of components between different platforms together with their associated runtime state, and the adaptation of those components to the destination platform and physical environment. These solutions are being addressed within our efforts for the development of a general-purpose middleware for Ambient Intelligence in the framework of the HI3 project. (C) 2012 Elsevier B.V. All rights reserved.", "paper_title": "Towards ubiquity in ambient intelligence: User-guided component mobility in the HI3 architecture", "paper_id": "WOS:000323086300013"}