{"auto_keywords": [{"score": 0.040366363919436855, "phrase": "cumulative_regret"}, {"score": 0.03193213759246904, "phrase": "simple_regret"}, {"score": 0.008047623658029588, "phrase": "probability_distributions"}, {"score": 0.00481495049065317, "phrase": "finitely-armed_and_continuous-armed_bandits"}, {"score": 0.004699837689671504, "phrase": "stochastic_multi-armed_bandit_problems"}, {"score": 0.0045088388224419, "phrase": "on-line_exploration"}, {"score": 0.004064478393319772, "phrase": "available_rounds"}, {"score": 0.0036133826040506798, "phrase": "performance_criterion"}, {"score": 0.003190024306903021, "phrase": "main_results"}, {"score": 0.003124437382827821, "phrase": "finite_number"}, {"score": 0.002739165532192527, "phrase": "upper_bounds"}, {"score": 0.0025914765323897604, "phrase": "continuous-armed_bandit_problems"}, {"score": 0.002248277737254846, "phrase": "separable_metric_spaces"}, {"score": 0.0022327484973125936, "phrase": "exactly_the_metric_spaces"}, {"score": 0.0021049977753042253, "phrase": "continuous_mean-payoff_functions"}], "paper_keywords": ["Multi-armed bandits", " Continuous-armed bandits", " Simple regret", " Efficient exploration"], "paper_abstract": "We consider the framework of stochastic multi-armed bandit problems and study the possibilities and limitations of forecasters that perform an on-line exploration of the arms. These forecasters are assessed in terms of their simple regret, a regret notion that captures the fact that exploration is only constrained by the number of available rounds (not necessarily known in advance), in contrast to the case when the cumulative regret is considered and when exploitation needs to be performed at the same time. We believe that this performance criterion is suited to situations when the cost of pulling an arm is expressed in terms of resources rather than rewards. We discuss the links between the simple and the cumulative regret. One of the main results in the case of a finite number of arms is a general lower bound on the simple regret of a forecaster in terms of its cumulative regret: the smaller the latter, the larger the former. Keeping this result in mind, we then exhibit upper bounds on the simple regret of some forecasters. The paper ends with a study devoted to continuous-armed bandit problems; we show that the simple regret can be minimized with respect to a family of probability distributions if and only if the cumulative regret can be minimized for it. Based on this equivalence, we are able to prove that the separable metric spaces are exactly the metric spaces on which these regrets can be minimized with respect to the family of all probability distributions with continuous mean-payoff functions. (C) 2010 Elsevier B.V. All rights reserved.", "paper_title": "Pure exploration in finitely-armed and continuous-armed bandits", "paper_id": "WOS:000289578000008"}