{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "haptic_glance"}, {"score": 0.004751889650408546, "phrase": "initial_finger_contacts"}, {"score": 0.004567596860086148, "phrase": "current_study"}, {"score": 0.00439041997682389, "phrase": "fundamental_topic"}, {"score": 0.00431388720289049, "phrase": "surprisingly_little_attention"}, {"score": 0.00427612041204006, "phrase": "touch_scientists"}, {"score": 0.003916098498242888, "phrase": "haptic_processing"}, {"score": 0.0038309141193444015, "phrase": "natural_scenes"}, {"score": 0.003780692127133743, "phrase": "sensory_inputs"}, {"score": 0.003747575730190958, "phrase": "first_contact"}, {"score": 0.0028276174348291923, "phrase": "tripartite_factor_classification_scheme"}, {"score": 0.0023192471808039746, "phrase": "single_haptic_glance"}, {"score": 0.002288797099841088, "phrase": "reasonable_degree"}, {"score": 0.0021901485584955487, "phrase": "estimated_likelihood"}], "paper_keywords": ["Human haptics", " perception and psychophysics"], "paper_abstract": "The current study addresses the well-known \"figure/ground\" problem in human perception, a fundamental topic that has received surprisingly little attention from touch scientists to date. Our approach is grounded in, and directly guided by, current knowledge concerning the nature of haptic processing. Given inherent figure/ground ambiguity in natural scenes and limited sensory inputs from first contact (a \"haptic glance\"), we consider first whether people are even capable of differentiating figure from ground (Experiments 1 and 2). Participants were required to estimate the strength of their subjective impression that they were feeling an object (i.e., figure) as opposed to just the supporting structure (i.e., ground). Second, we propose a tripartite factor classification scheme to further assess the influence of kinetic, geometric (Experiments 1 and 2), and material (Experiment 2) factors on haptic figure/ground segmentation, complemented by more open-ended subjective responses obtained at the end of the experiment. Collectively, the results indicate that under certain conditions it is possible to segment figure from ground via a single haptic glance with a reasonable degree of certainty, and that all three factor classes influence the estimated likelihood that brief, spatially distributed fingertip contacts represent contact with an object and/or its background supporting structure.", "paper_title": "Figure/Ground Segmentation via a Haptic Glance: Attributing Initial Finger Contacts to Objects or Their Supporting Surfaces", "paper_id": "WOS:000289473300002"}