{"auto_keywords": [{"score": 0.047936900215165286, "phrase": "organizational_identification"}, {"score": 0.012625887605722884, "phrase": "knowledge_sharing"}, {"score": 0.006721194510474611, "phrase": "social_support_climate"}, {"score": 0.0059279444011681795, "phrase": "supportive_climate"}, {"score": 0.005790508497714514, "phrase": "task_characteristics"}, {"score": 0.00481495049065317, "phrase": "work_context"}, {"score": 0.004547356716604537, "phrase": "work_characteristics"}, {"score": 0.004495641511172577, "phrase": "hierarchical_linear_modeling_analysis"}, {"score": 0.004257878852754296, "phrase": "cross-level_effects"}, {"score": 0.004161553532799662, "phrase": "job_design"}, {"score": 0.003986754910294139, "phrase": "timely_responses"}, {"score": 0.003918900658052011, "phrase": "cross-level_study"}, {"score": 0.0038854061518545204, "phrase": "authors'_findings"}, {"score": 0.0038830218152714644, "phrase": "social_support"}, {"score": 0.003637913064193312, "phrase": "confirmatory_factor_analysis"}, {"score": 0.003515087275495129, "phrase": "authors'_instrument"}, {"score": 0.003348125618527277, "phrase": "library-level_constructs"}, {"score": 0.003281695962914803, "phrase": "hierarchical_linear_modeling"}, {"score": 0.0032165800743224645, "phrase": "research_hypotheses"}, {"score": 0.0031347485922104223, "phrase": "nested_data"}, {"score": 0.0030462566137964267, "phrase": "different_levels"}, {"score": 0.0029857983525658307, "phrase": "empirical_insights"}, {"score": 0.002884925971272727, "phrase": "sufficient_autonomy"}, {"score": 0.0026549598458192633, "phrase": "sample_libraries"}, {"score": 0.002617203977205073, "phrase": "taiwan"}, {"score": 0.0025948026124758394, "phrase": "research_results"}, {"score": 0.0024785363812738384, "phrase": "multiple_cultures"}, {"score": 0.0022808906900615342, "phrase": "cross-level_analysis"}, {"score": 0.0021049977753042253, "phrase": "partial_meso-mediator"}], "paper_keywords": ["Hierarchical linear modeling", " Organizational identification", " Social support climate", " Work context", " Work design", " Libraries"], "paper_abstract": "Purpose - The paper aims to clarify the relationship between organizational identification, knowledge sharing and work characteristics. It proposes hierarchical linear modeling analysis of work context and social support climate with regard to organizational identification. The study aims to understand and prescribe the cross-level effects of a supportive climate and the effect of job design on organizational identification and knowledge sharing. Librarians need to share knowledge with their colleagues to provide timely responses for readers. Through a cross-level study, the authors' findings provide insights for both practice and academia. Design/methodology/approach - Analysis approach in this paper consisted of the following steps. First, this study applied confirmatory factor analysis (CFA) to assess the validity and reliability of the authors' instrument. Second, this study checked the viability of aggregating the responses of the librarians to library-level constructs. Third, this study adapted hierarchical linear modeling (FILM) to examine the research hypotheses. HLM could be utilized to explain the nested data and simultaneously estimate the influence of factors from the different levels. Findings - The paper provides empirical insights to support the relationship between task characteristics and organizational identification. Tasks with sufficient autonomy, variety, and feedback can improve the perception of organizational identification. Task characteristics and social support can reinforce knowledge sharing through shaping organizational identification. Research limitations/implications - As the sample libraries were all located in Taiwan, the research results may lack generalizability. Therefore, researchers are encouraged to further test the propositions in multiple cultures. Practical implications - The paper includes implications for task characteristics and social support can reinforce knowledge sharing through shaping the organizational identification in libraries. Originality/value - The results of cross-level analysis in this paper suggested that the variance of a supportive climate among libraries may exert an influence on knowledge sharing. This paper also confirmed organizational identification is also a partial meso-mediator for social support and knowledge sharing.", "paper_title": "Multilevel analysis of work context and social support climate in libraries", "paper_id": "WOS:000327047700005"}