{"auto_keywords": [{"score": 0.03610310423475189, "phrase": "mac"}, {"score": 0.01649081824721572, "phrase": "lmac"}, {"score": 0.007071906437025973, "phrase": "s-mac"}, {"score": 0.00481495049065317, "phrase": "energy-efficient_link-layer"}, {"score": 0.00474348728309194, "phrase": "wireless_sensor_network_mac_protocols"}, {"score": 0.004690583510896564, "phrase": "typical_wireless_sensor_node"}, {"score": 0.0046037124365759215, "phrase": "radio_jamming"}, {"score": 0.00448477700778838, "phrase": "energy-efficient_jamming"}, {"score": 0.0043363441738461335, "phrase": "data_link_layer"}, {"score": 0.003964007795174772, "phrase": "temporal_arrangement"}, {"score": 0.003503497128638099, "phrase": "packet_interarrival_times"}, {"score": 0.0030617295196636173, "phrase": "jamming_attacks"}, {"score": 0.0030162086479223506, "phrase": "realistic_assumptions"}, {"score": 0.002655544981260646, "phrase": "actual_implementation"}, {"score": 0.002463830258460528, "phrase": "careful_analysis"}, {"score": 0.0024090550572099688, "phrase": "respective_categories"}, {"score": 0.0021448202319775634, "phrase": "new_insights"}, {"score": 0.0021208374456760447, "phrase": "security_considerations"}, {"score": 0.0021049977753042253, "phrase": "mac_protocols"}], "paper_keywords": ["Security", " Algorithms", " MAC protocols", " denial-of-service attacks", " jamming", " clustering", " expectation maximization"], "paper_abstract": "A typical wireless sensor node has little protection against radio jamming. The situation becomes worse if energy-efficient jamming can be achieved by exploiting knowledge of the data link layer. Encrypting the packets may help to prevent the jammer from taking actions based on the content of the packets, but the temporal arrangement of the packets induced by the nature of the protocol might unravel patterns that the jammer can take advantage of, even when the packets are encrypted. By looking at the packet interarrival times in three representative MAC protocols, S-MAC, LMAC, and B-MAC, we derive several jamming attacks that allow the jammer to jam S-MAC, LMAC, and B-MAC energy efficiently. The jamming attacks are based on realistic assumptions. The algorithms are described in detail and simulated. The effectiveness and efficiency of the attacks are examined. In addition, we validate our simulation model by comparing its results with measurements obtained from actual implementation on our sensor node prototypes. We show that it takes little effort to implement such effective jammers, making them a realistic threat. Careful analysis of other protocols belonging to the respective categories of S-MAC, LMAC, and B-MAC reveals that those protocols are, to some extent, also susceptible to our attacks. The result of this investigation provides new insights into the security considerations of MAC protocols.", "paper_title": "Energy-Efficient Link-Layer Jamming Attacks against Wireless Sensor Network MAC Protocols", "paper_id": "WOS:000264682700006"}