{"auto_keywords": [{"score": 0.04249733146818192, "phrase": "lcvqe"}, {"score": 0.008801112089413293, "phrase": "mpck-means"}, {"score": 0.00696233851790854, "phrase": "cvqe"}, {"score": 0.00481495049065317, "phrase": "k-means-based_algorithms"}, {"score": 0.004782718554230406, "phrase": "constrained_clustering"}, {"score": 0.004624751696958501, "phrase": "considerable_attention"}, {"score": 0.004237925318473508, "phrase": "k-means-based_clustering"}, {"score": 0.00415333528095237, "phrase": "vector_quantization_error"}, {"score": 0.0038573081851680656, "phrase": "adjusted_rand_index"}, {"score": 0.0038314621564116192, "phrase": "normalized_mutual_information"}, {"score": 0.0037549546301384336, "phrase": "violated_constraints"}, {"score": 0.0033946556965877873, "phrase": "obtained_results"}, {"score": 0.0033492947290751996, "phrase": "statistical_tests"}, {"score": 0.0029873281676201565, "phrase": "better_accuracy"}, {"score": 0.002888488567436329, "phrase": "distance_metrics"}, {"score": 0.002764856305713066, "phrase": "particular_distance"}, {"score": 0.00267335773670308, "phrase": "better_results"}, {"score": 0.002637609579129844, "phrase": "single_metric"}, {"score": 0.002524688179363081, "phrase": "noisy_constraints"}, {"score": 0.0023923066544220277, "phrase": "better_performance"}, {"score": 0.0023131084326717755, "phrase": "computational_complexities"}, {"score": 0.0021697677572213086, "phrase": "paper_-_e.g."}, {"score": 0.0021049977753042253, "phrase": "better_data_partitions"}], "paper_keywords": ["Constrained clustering", " K-means", " semi-supervised clustering"], "paper_abstract": "The problem of clustering with constraints has received considerable attention in the last decade. Indeed, several algorithms have been proposed, but only a few studies have (partially) compared their performances. In this work, three well-known algorithms for k-means-based clustering with soft constraints - Constrained Vector Quantization Error (CVQE), its variant named LCVQE, and the Metric Pairwise Constrained K-Means (MPCK-Means) - are systematically compared according to three criteria: Adjusted Rand Index, Normalized Mutual Information, and the number of violated constraints. Experiments were performed on 20 datasets, and for each of them 800 sets of constraints were generated. In order to provide some reassurance about the non-randomness of the obtained results, outcomes of statistical tests of significance are presented. In terms of accuracy, LCVQE has shown to be competitive with CVQE, while violating less constraints. In most of the datasets, both CVQE and LCVQE presented better accuracy compared to MPCK-Means, which is capable of learning distance metrics. In this sense, it was also observed that learning a particular distance metric for each cluster does not necessarily lead to better results than learning a single metric for all clusters. The robustness of the algorithms with respect to noisy constraints was also analyzed. From this perspective, the most interesting conclusion is that CVQE has shown better performance than LCVQE in most of the experiments. The computational complexities of the algorithms are also presented. Finally, a variety of (more specific) new experimental findings are discussed in the paper - e.g., deduced constraints usually do not help finding better data partitions.", "paper_title": "A study of K-Means-based algorithms for constrained clustering", "paper_id": "WOS:000319345400008"}