{"auto_keywords": [{"score": 0.027028346841622704, "phrase": "ethics_policy"}, {"score": 0.00481495049065317, "phrase": "ethical_and_societal_issues"}, {"score": 0.004404296965915598, "phrase": "national_policy"}, {"score": 0.004241235563017201, "phrase": "ethical_and_societal_considerations"}, {"score": 0.004098221047046135, "phrase": "early_anticipation"}, {"score": 0.004070199735165926, "phrase": "societal_dimensions"}, {"score": 0.004000978459274141, "phrase": "collaborative_socio-technical_integration"}, {"score": 0.003973619384183145, "phrase": "research_and_development_activities"}, {"score": 0.003839594092937135, "phrase": "considerable_challenges"}, {"score": 0.003800271653332246, "phrase": "societal_and_technical_researchers"}, {"score": 0.0037228262889889402, "phrase": "early_integration"}, {"score": 0.0035972293900260414, "phrase": "continued_efforts"}, {"score": 0.003463944293093158, "phrase": "brief_history"}, {"score": 0.0032900885091898184, "phrase": "policy_makers"}, {"score": 0.0032009501549788576, "phrase": "growing_body"}, {"score": 0.0030402538087882015, "phrase": "similar_emphasis"}, {"score": 0.003019444345150991, "phrase": "early_and_collaborative_anticipation"}, {"score": 0.002988496107817795, "phrase": "ethical_and_societal_implications"}, {"score": 0.0028678338651577056, "phrase": "fundamental_tasks"}, {"score": 0.002723815159181826, "phrase": "social_and_technical_researchers"}, {"score": 0.0026774300859545826, "phrase": "socio-technical_integration"}, {"score": 0.0025959133277517824, "phrase": "nanoscale_science"}, {"score": 0.0023416540209862803, "phrase": "socio-technical_collaborations"}, {"score": 0.0023017619208704067, "phrase": "key_statements"}, {"score": 0.002278152865899792, "phrase": "congressional_witnesses"}, {"score": 0.0021341390503944336, "phrase": "conceptual_considerations"}, {"score": 0.0021049977753042253, "phrase": "diverse_contexts"}], "paper_keywords": [""], "paper_abstract": "This chapter reviews the role ethical and societal issues associated with nanotechnology have played in the development of national, and particularly US nanotechnology policies. The prominence of nanotechnology as a matter of national policy is significant, as is the attention being afforded to ethical and societal considerations. Notably, there is an emphasis on the early anticipation of societal dimensions of nanotechnology and of collaborative socio-technical integration during research and development activities. While these policies ate fairly unprecedented and pose considerable challenges to the societal and technical researchers to whom the tasks of early integration may fall, there is reason to believe that continued efforts aimed at their implementation are likely. The chapter provides a brief history and explanation of the US nanotechnology \"ethics policy\" in reference to the discourse and concerns motivating policy makers. It then surveys some of the growing body of literature emerging around what has been termed nanoethics. This literature includes a similar emphasis on early and collaborative anticipation of the ethical and societal implications surrounding nanotechnology. Finally, the chapter identifies a list of fundamental tasks that would be necessary to address for the sake of developing the capacity of social and technical researchers to effectively engage in socio-technical integration. These tasks include defining the scope of nanoscale science and engineering subject to the ethics policy, and the interactions, responsibility, participation, and regulation envisioned or implied by the ethics policy under consideration. A few emerging cases of socio-technical collaborations are noted, and key statements made by congressional witnesses and others are cited. Throughout the chapter, an attempt is made to frame the statements within conceptual considerations drawn from the diverse contexts of nanotechnology, policy, and ethics.", "paper_title": "The convergence of nanotechnology, policy, and ethics", "paper_id": "WOS:000248300600006"}