{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "wastewater_treatment_modelling"}, {"score": 0.004770211811866158, "phrase": "activated_sludge_systems"}, {"score": 0.004324723240308028, "phrase": "activated_sludge_processes"}, {"score": 0.004264558080356621, "phrase": "main_aim"}, {"score": 0.004146716743362567, "phrase": "better_understanding"}, {"score": 0.0036553070575015344, "phrase": "current_paper"}, {"score": 0.0035542408902458677, "phrase": "historical_developments"}, {"score": 0.003407839062159497, "phrase": "activated_sludge"}, {"score": 0.0031475032122226, "phrase": "activated_sludge_models"}, {"score": 0.0029206231857112305, "phrase": "novel_theoretical_concepts"}, {"score": 0.0028664985822266344, "phrase": "new_fields"}, {"score": 0.002722758109991685, "phrase": "practical_projects"}, {"score": 0.002598333022293788, "phrase": "ideal_model"}, {"score": 0.002344201345813952, "phrase": "new_developments"}, {"score": 0.0022686625017583387, "phrase": "plant-wide_modelling"}, {"score": 0.0021750990136123367, "phrase": "organizational_and_computational_infrastructure"}], "paper_keywords": ["activated sludge", " application", " kinetic", " modelling", " stoichiometry", " wastewater treatment"], "paper_abstract": "Activated sludge systems have been applied for 100 years now. Over the course of the years, researchers have developed various models to describe activated sludge processes. The main aim has been to gain a better understanding of the conditions that favour the conversions of carbon, nitrogen and phosphorus present in wastewater, and associated oxygen consumption and sludge production. The current paper presents a reflection on the historical developments, state-of-the-art of activated sludge modelling and future trends. Over the years, many wastewater research groups have benefitted greatly from the development of activated sludge models (ASMs). On one hand, modelling has been expanded through the development of novel theoretical concepts and their application in new fields. On the other hand, models have been used for practical projects. Although, scientists are still searching for the ideal model, one can say that ASMs are developed to the extent that they can be applied in practice with confidence. New developments are expected to be seen regarding plant-wide modelling, integration with other models at the (urban) system level, organizational and computational infrastructure, and interface and communication with various stakeholders and users.", "paper_title": "Twenty-five years of ASM1: past, present and future of wastewater treatment modelling", "paper_id": "WOS:000360377000001"}