{"auto_keywords": [{"score": 0.036981144867374645, "phrase": "multineuronal_vectorizing_procedure"}, {"score": 0.014846770381303984, "phrase": "inferior_temporal_cortex"}, {"score": 0.011248723658716686, "phrase": "response_vector"}, {"score": 0.010763008397286349, "phrase": "time-segmental_vectorizing_procedure"}, {"score": 0.00938536583236124, "phrase": "visual_stimuli"}, {"score": 0.00481495049065317, "phrase": "multineuronal_vectorization"}, {"score": 0.004709193603747991, "phrase": "time-segmental_vectorization"}, {"score": 0.004605748839642513, "phrase": "neuronal_activities"}, {"score": 0.004347256848088215, "phrase": "assistive_devices"}, {"score": 0.004270665568018583, "phrase": "multineuronal_spike_trains"}, {"score": 0.004048860957751714, "phrase": "prosthetic_control_signals"}, {"score": 0.004013025478863664, "phrase": "portable_real-time_applications"}, {"score": 0.0036229421570951807, "phrase": "spike_trains"}, {"score": 0.003374094774912924, "phrase": "spike_counts"}, {"score": 0.0031422859551159506, "phrase": "neuron's_spike"}, {"score": 0.0030459283281463953, "phrase": "response_period"}, {"score": 0.0021620042653528846, "phrase": "neuronal_signals"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Information theory", " Temporal coding", " Population coding", " Decoding", " Single-unit recording", " Vision", " Inferior temporal cortex", " Brain-machine interface"], "paper_abstract": "In order for patients with disabilities to control assistive devices with their own neural activity, multineuronal spike trains must be efficiently decoded because only limited computational resources can be used to generate prosthetic control signals in portable real-time applications. In this study, we compare the abilities of two vectorizing procedures (multineuronal and time-segmental) to extract information from spike trains during the same total neuron-seconds. In the multineuronal vectorizing procedure, we defined a response vector whose components represented the spike counts of one to five neurons. In the time-segmental vectorizing procedure, a response vector consisted of components representing a neuron's spike counts for one to five time-segment(s) of a response period of 1 s. Spike trains were recorded from neurons in the inferior temporal cortex of monkeys presented with visual stimuli. We examined whether the amount of information of the visual stimuli carried by these neurons differed between the two vectorizing procedures. The amount of information calculated with the multineuronal vectorizing procedure, but not the time-segmental vectorizing procedure, significantly increased with the dimensions of the response vector. We conclude that the multineuronal vectorizing procedure is superior to the time-segmental vectorizing procedure in efficiently extracting information from neuronal signals. (C) 2010 Elsevier Ltd. All rights reserved.", "paper_title": "Multineuronal vectorization is more efficient than time-segmental vectorization for information extraction from neuronal activities in the inferior temporal cortex", "paper_id": "WOS:000280024900009"}