{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "engineering_systems"}, {"score": 0.043509584640630976, "phrase": "technical_constraints"}, {"score": 0.004749646583168342, "phrase": "technical_and_business_constraints"}, {"score": 0.004590217765551337, "phrase": "cost_savings"}, {"score": 0.004543436145505023, "phrase": "increased_commonality"}, {"score": 0.00448179813172021, "phrase": "higher_variety"}, {"score": 0.0044209926093642235, "phrase": "full_modularity"}, {"score": 0.003990385737207714, "phrase": "rather_integral_architectures"}, {"score": 0.0037523473563976246, "phrase": "binary_design_structure_matrix"}, {"score": 0.0036015684625793775, "phrase": "non-zero_fraction"}, {"score": 0.003375087185182269, "phrase": "singular_value_modularity_index"}, {"score": 0.003284026247389735, "phrase": "internal_coupling"}, {"score": 0.0031305230217636495, "phrase": "idealized_canonical_architectures"}, {"score": 0.00293357578778008, "phrase": "empirical_evidence"}, {"score": 0.0028838335724864547, "phrase": "lightweight_variant"}, {"score": 0.0027584046728703297, "phrase": "higher_mass_efficiency"}, {"score": 0.002463906556781983, "phrase": "control_population"}, {"score": 0.002447101794397243, "phrase": "randomly_generated_architectures"}, {"score": 0.0024304113675154017, "phrase": "equivalent_size"}, {"score": 0.0022618732192713235, "phrase": "technological_factors"}, {"score": 0.002238767763626708, "phrase": "main_advantage"}, {"score": 0.0021049977753042253, "phrase": "subjective_module_choices"}], "paper_keywords": ["complexity", " modularity", " system engineering"], "paper_abstract": "There is consensus that modularity has many benefits from cost savings due to increased commonality to enabling a higher variety of products. Full modularity is, however, not always achievable. How engineering systems and products whose design is heavily influenced by technical constraints, such as weight or size limitations, tend to exhibit rather integral architectures is shown in this study. For this, two metrics are defined on the basis of a binary design structure matrix (DSM) representation of a system or product. The non-zero fraction (NZF) captures the sparsity of the interrelationships between components between zero and one, while the singular value modularity index (SMI) captures the degree of internal coupling, also between zero and one. These metrics are first developed using idealized canonical architectures and are then applied to two different product pairs that are functionally equivalent, but different in terms of technical constraints. Empirical evidence is presented that the lightweight variant of the same product tends to be more integral, presumably to achieve higher mass efficiency. These observations are strengthened by comparing the results to another, previously published, modularity metric as well as by comparing sparsity and modularity of a set of 15 products against a control population of randomly generated architectures of equivalent size and density. The results suggest that, indeed, some products are inherently less modular than others due to technological factors. The main advantage of SMI is that it enables analysis of the degree of modularity of any architecture independent of subjective module choices.", "paper_title": "Degree of modularity in engineering systems and products with technical and business constraints", "paper_id": "WOS:000247402200003"}