{"auto_keywords": [{"score": 0.004398872331144531, "phrase": "stationary_gaussian_random_fields"}, {"score": 0.004342430078306461, "phrase": "latter_property"}, {"score": 0.0040186038781533946, "phrase": "discrete_textures"}, {"score": 0.003751011827704279, "phrase": "novel_concept"}, {"score": 0.002934098412396701, "phrase": "kullback-leibler_divergence"}, {"score": 0.0028591768694918, "phrase": "rotated_texture_data"}, {"score": 0.002680114113899346, "phrase": "haar_measure"}], "paper_keywords": ["Gaussian Markov random fields (GMRF)", " isotropic multiresolution analysis (IMRA)", " Kullback-Leibler (KL) divergence", " rigid-motion invariance", " volumetric textures", " 3-D texture classification"], "paper_abstract": "This paper studies the problem of 3-D rigid-motion-invariant texture discrimination for discrete 3-D textures that are spatially homogeneous by modeling them as stationary Gaussian random fields. The latter property and our formulation of a 3-D rigid motion of a texture reduce the problem to the study of 3-D rotations of discrete textures. We formally develop the concept of 3-D texture rotations in the 3-D digital domain. We use this novel concept to define a \"distance\" between 3-D textures that remains invariant under all 3-D rigid motions of the texture. This concept of \"distance\" can be used for a monoscale or a multiscale 3-D rigid-motion-invariant testing of the statistical similarity of the 3-D textures. To compute the \"distance\" between any two rotations R-1 and R-2 of two given 3-D textures, we use the Kullback-Leibler divergence between 3-D Gaussian Markov random fields fitted to the rotated texture data. Then, the 3-D rigid-motion-invariant texture distance is the integral average, with respect to the Haar measure of the group SO(3), of all of these divergences when rotations and R-2 vary throughout SO(3). We also present an algorithm enabling the computation of the proposed 3-D rigid-motion-invariant texture distance as well as rules for 3-D rigid-motion-invariant texture discrimination/classification and experimental results demonstrating the capabilities of the proposed 3-D rigid-motion texture discrimination rules when applied in a multiscale setting, even on very general 3-D texture models.", "paper_title": "Rigid-Motion-Invariant Classification of 3-D Textures", "paper_id": "WOS:000304160800008"}