{"auto_keywords": [{"score": 0.045428111966313175, "phrase": "ga"}, {"score": 0.010853515622602988, "phrase": "bispectrum-related_features"}, {"score": 0.00765341940299866, "phrase": "heart_rate_variability"}, {"score": 0.006914028488879492, "phrase": "feature_selection"}, {"score": 0.005000261912716241, "phrase": "proposed_method"}, {"score": 0.00481495049065317, "phrase": "congestive_heart_failure_recognition"}, {"score": 0.004516024014029046, "phrase": "feature_selector"}, {"score": 0.004464989524476272, "phrase": "hrv"}, {"score": 0.004448369914246323, "phrase": "recognition_accuracy"}, {"score": 0.004381527499253281, "phrase": "genetic_algorithm"}, {"score": 0.004156012879026324, "phrase": "ga_feature_selector"}, {"score": 0.0040323765107766335, "phrase": "subband_regions"}, {"score": 0.0039869632444468036, "phrase": "hrv_bispectrum"}, {"score": 0.0037532257703888315, "phrase": "support_vector_machine"}, {"score": 0.0037250319763650454, "phrase": "svm"}, {"score": 0.003546513036085932, "phrase": "genetic_algorithm_proceeds"}, {"score": 0.0032884384364324395, "phrase": "discrimination_power"}, {"score": 0.0029807267909921628, "phrase": "high_accuracy"}, {"score": 0.0026611839044848925, "phrase": "isler"}, {"score": 0.0026411384812121503, "phrase": "kuntalp's_impressive_results"}, {"score": 0.0022963142779850562, "phrase": "chf_classification_system"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Congestive heart failure", " Heart rate variability", " Bispectrum", " Genetic algorithm", " Electrocardiogram"], "paper_abstract": "This paper proposes a congestive heart failure (CHF) recognition method that includes features calculated from the bispectrum of heart rate variability (HRV) diagrams and a genetic algorithm (GA) for feature selection. The roles of the bispectrum-related features and the GA feature selector are investigated. Features calculated from the subband regions of the HRV bispectrum are added into a feature set containing only regular time-domain and frequency-domain features. A support vector machine (SVM) is employed as the classifier. A feature selector based on genetic algorithm proceeds to select the most effective features for the classifier. The results confirm the effectiveness of including bispectrum-related features for promoting the discrimination power of the classifier. When compared with the other two methods in the literature, the proposed method (without GA) outperforms both of them with a high accuracy of 96.38%. More than 3.14% surpluses in accuracies are observed. The application of GA as a feature selector further elevates the recognition accuracy from 96.38% to 98.79%. When compared to the Isler and Kuntalp's impressive results recently published in the literature that also uses GA for feature selection, the proposed method (with GA) outperforms them with more than 2.4% surpass in the recognition accuracy. These results confirm the significance of recruiting bispectrum-related features in a CHF classification system. Moreover, the application of GA as feature selector can further improve the performance of the classifier. (C) 2012 Elsevier Ltd. All rights reserved.", "paper_title": "Bispectral analysis and genetic algorithm for congestive heart failure recognition based on heart rate variability", "paper_id": "WOS:000307428100004"}