{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "bayesian_formulation"}, {"score": 0.004783232571029632, "phrase": "image_patch_matching"}, {"score": 0.0046738485441681485, "phrase": "classical_solution"}, {"score": 0.004551883842967241, "phrase": "cross-correlation_coefficient"}, {"score": 0.003845500924733243, "phrase": "confident_matches"}, {"score": 0.003493701605117701, "phrase": "different_lighting_conditions"}, {"score": 0.0034706569037527774, "phrase": "different_noise_realisations"}, {"score": 0.0033355353594739707, "phrase": "patch_matching_problem"}, {"score": 0.0032269483581856737, "phrase": "binary_classification_problem"}, {"score": 0.003010250522930773, "phrase": "noise_level"}, {"score": 0.002921879966280267, "phrase": "signal_level"}, {"score": 0.002707620139970122, "phrase": "common_application"}, {"score": 0.0026543514413663893, "phrase": "feature_point_matching"}, {"score": 0.002636828502928141, "phrase": "different_images"}, {"score": 0.0025257081555100556, "phrase": "latter_application"}, {"score": 0.0023249757987087055, "phrase": "motion-jpeg_stream"}, {"score": 0.002161542155696987, "phrase": "recursive_quantile_estimation"}, {"score": 0.0021330830123432614, "phrase": "background_model"}], "paper_keywords": ["Patch-matching", " Lighting variations", " Background/Foreground-segmentation", " Bayesian classification"], "paper_abstract": "A classical solution for matching two image patches is to use the cross-correlation coefficient. This works well if there is a lot of structure within the patches, but not so well if the patches are close to uniform. This means that some patches are matched with more confidence than others. By estimating this uncertainty, more weight can be put on the confident matches than those that are more uncertain. To enable this two distribution functions for two different cases are used: (i) the correlation between two patches showing the same object but with different lighting conditions and different noise realisations and (ii) the correlation between two unrelated patches. Using these two distributions the patch matching problem is, in this paper, formulated as a binary classification problem. The probability of two patches matching is derived. The model depends on the signal to noise ratio. The noise level is reasonably invariant over time, while the signal level, represented by the amount of structure in the patch or its spatial variance, has to be measured for every frame. A common application where this is useful is feature point matching between different images. Another application is background/foreground segmentation. This paper will concentrate on the latter application. It is shown how the theory can be used to implement a very fast background/foreground segmentation algorithm by transforming the calculations to the DCT-domain and processing a motion-JPEG stream without uncompressing it. This allows the algorithm to be embedded on a 150 MHz ARM based network camera. It is also suggested to use recursive quantile estimation to estimate the background model. This gives very accurate background models even if there is a lot of foreground present during the initialisation of the model.", "paper_title": "Bayesian Formulation of Image Patch Matching Using Cross-correlation", "paper_id": "WOS:000302346000006"}