{"auto_keywords": [{"score": 0.04598947580092755, "phrase": "consultation_records"}, {"score": 0.010612387000973441, "phrase": "scenario-based_representation"}, {"score": 0.010508507912403852, "phrase": "multilevel_mixture_model"}, {"score": 0.0056449548642802825, "phrase": "experimental_results"}, {"score": 0.003649277504586372, "phrase": "health_professionals"}, {"score": 0.003176626803985225, "phrase": "depressive_symptoms"}, {"score": 0.003053159610975692, "phrase": "temporal_relations"}, {"score": 0.0030081030319492343, "phrase": "understanding_users'_queries"}, {"score": 0.002862648127577722, "phrase": "semantic_mining"}, {"score": 0.002579622880371082, "phrase": "structural_information"}, {"score": 0.002504011301105577, "phrase": "proposed_approach"}, {"score": 0.0024793019587009035, "phrase": "higher_precision"}, {"score": 0.0024306105794630246, "phrase": "term-based_flat_representation"}, {"score": 0.0022901862321082407, "phrase": "error_propagation"}, {"score": 0.0022563636435096457, "phrase": "incorrect_identification"}, {"score": 0.002147180332779021, "phrase": "different_approaches"}, {"score": 0.0021049977753042253, "phrase": "retrieval_robustness"}], "paper_keywords": ["information retrieval (IR)", " multilevel mixture model (MMM)", " natural language processing", " scenario-based representation", " text mining"], "paper_abstract": "Psychiatric consultation record retrieval attempts to help people to efficiently and effectively locate the consultation records relevant to their depressive problems. Consultation records can also make people aware that they are not alone, because many individuals have suffered from the same or similar problems. Additionally, people can understand how to alleviate their depressive symptoms according to recommendations from health professionals. To achieve this goal, this paper proposes the use of a scenario-based representation, i.e., a symptom-based structural representation, to capture the depressive symptoms and their semantic relations, such as cause-effect and temporal relations, for understanding users' queries clearly. The symptoms and relations are identified from semantic mining and analysis of consultation records. The multilevel mixture model is adopted to estimate the relevance of queries and consultation records based on the structural information. Experimental results show that the proposed approach achieves higher precision than does a term-based flat representation. An experiment is also conducted to examine the effect of error propagation resulting from incorrect identification of symptoms and relations. Experimental results demonstrate that combining different approaches can improve the retrieval robustness.", "paper_title": "Psychiatric consultation record retrieval using scenario-based representation and multilevel mixture model", "paper_id": "WOS:000247889100007"}