{"auto_keywords": [{"score": 0.04212755136497285, "phrase": "time_series"}, {"score": 0.011919334495702772, "phrase": "spectral_density_function"}, {"score": 0.010375212782101219, "phrase": "normalized_periodogram"}, {"score": 0.00481495049065317, "phrase": "frequency_domain"}, {"score": 0.00475924837336259, "phrase": "traditional_and_fuzzy_cluster_analyses"}, {"score": 0.004361428012479218, "phrase": "time_series_data"}, {"score": 0.003375574760845742, "phrase": "cluster_analysis"}, {"score": 0.00278497898719426, "phrase": "fuzzy_clustering_approach"}, {"score": 0.0026736111900632934, "phrase": "estimated_cepstrum"}, {"score": 0.0023792975669318615, "phrase": "typical_generating_processes"}, {"score": 0.0022974765563692776, "phrase": "fuzzy_clustering"}, {"score": 0.002244494905883452, "phrase": "cepstral_coefficients"}], "paper_keywords": ["Time series", " Frequency domain", " Normalized periodogram", " Log normalized periodogram", " Cepstral coefficients", " Fuzzy clustering"], "paper_abstract": "Traditional and fuzzy cluster analyses are applicable to variables whose values are uncorrelated. Hence, in order to cluster time series data which are usually serially correlated, one needs to extract features from the time series, the values of which are uncorrelated. The periodogram which is an estimator of the spectral density function of a time series is a feature that can be used in the cluster analysis of time series because its ordinates are uncorrelated. Additionally, the normalized periodogram and the logarithm of the normalized periodogram are also features that can be used. In this paper, we consider a fuzzy clustering approach for time series based on the estimated cepstrum. The cepstrum is the spectrum of the logarithm of the spectral density function. We show in our simulation studies for the typical generating processes that have been considered, fuzzy clustering based on the cepstral coefficients performs very well compared to when it is based on other features. (C) 2010 Elsevier Inc. All rights reserved.", "paper_title": "Fuzzy clustering of time series in the frequency domain", "paper_id": "WOS:000287269600001"}