{"auto_keywords": [{"score": 0.03280109928432293, "phrase": "particular_algorithm"}, {"score": 0.004360412703519539, "phrase": "five_such_methods"}, {"score": 0.003967314311312148, "phrase": "computational_efficiency"}, {"score": 0.0039114753002009485, "phrase": "efficiency_index"}, {"score": 0.0032376465741070274, "phrase": "function_evaluations"}, {"score": 0.0031619994642255846, "phrase": "cpu_time"}, {"score": 0.0029594318330247614, "phrase": "different_solution"}, {"score": 0.0027567336518542858, "phrase": "primary_flaw"}, {"score": 0.002641823250595624, "phrase": "starting_point"}, {"score": 0.002580061425699194, "phrase": "infinite_number"}, {"score": 0.002460825108719896, "phrase": "attraction_idea"}, {"score": 0.002414684268765849, "phrase": "best_fourth_order_method"}, {"score": 0.002145233716114996, "phrase": "elsevier_b.v."}, {"score": 0.0021049980887993046, "phrase": "imacs."}], "paper_keywords": ["Iterative methods", " Order of convergence", " Rational maps", " Basin of attraction", " Julia sets", " Conjugacy classes"], "paper_abstract": "There are very few optimal fourth order methods for solving nonlinear algebraic equations having roots of multiplicity m. Here we compare five such methods, two of which require the evaluation of the (m - 1)st root. The methods are usually compared by evaluating the computational efficiency and the efficiency index. In this paper all the methods have the same efficiency, since they are of the same order and use the same information. Frequently, comparisons of the various schemes are based on the number of iterations required for convergence, number of function evaluations, and/or amount of CPU time. If a particular algorithm does not converge or if it converges to a different solution, then that particular algorithm is thought to be inferior to the others. The primary flaw in this type of comparison is that the starting point represents only one of an infinite number of other choices. Here we use the basin of attraction idea to recommend the best fourth order method. The basin of attraction is a method to visually comprehend how an algorithm behaves as a function of the various starting points. Published by Elsevier B.V. on behalf of IMACS.", "paper_title": "Basins of attraction for several optimal fourth order methods for multiple roots", "paper_id": "WOS:000337771600004"}