{"auto_keywords": [{"score": 0.03666106118361921, "phrase": "completion_times"}, {"score": 0.015530559745360033, "phrase": "positional_penalties"}, {"score": 0.013347074786027204, "phrase": "scheduling_problem"}, {"score": 0.012334308281182859, "phrase": "accepted_jobs"}, {"score": 0.007765316432477715, "phrase": "polynomial_time"}, {"score": 0.00481495049065317, "phrase": "single_machine"}, {"score": 0.00478557489890886, "phrase": "job_rejection"}, {"score": 0.0047273577269638725, "phrase": "single_machine_scheduling_problems"}, {"score": 0.004157058883925715, "phrase": "rejection_cost"}, {"score": 0.0038624981944755813, "phrase": "rejected_jobs"}, {"score": 0.0030695103543472908, "phrase": "robust_unified_bicriteria_analysis"}, {"score": 0.0030414140732789186, "phrase": "large_set"}, {"score": 0.003022825806274343, "phrase": "single_machine_problems"}, {"score": 0.0029951555610569225, "phrase": "common_property"}, {"score": 0.0028430608076324727, "phrase": "scheduling_criterion"}, {"score": 0.0025459275963373496, "phrase": "due_dates"}, {"score": 0.002301323246183348, "phrase": "np"}, {"score": 0.002258893331333988, "phrase": "hard_problems"}, {"score": 0.0022313446699940534, "phrase": "pseudo_polynomial_time_algorithm"}, {"score": 0.002183938718432764, "phrase": "approximate_efficient_schedule"}, {"score": 0.0021049977753042253, "phrase": "interesting_special_cases"}], "paper_keywords": ["Scheduling with job rejection", " Positional penalties", " Bicriteria optimization", " NP-hard", " Pseudo-polynomial time algorithm", " FPTAS"], "paper_abstract": "Single machine scheduling problems have been extensively studied in the literature under the assumption that all jobs have to be processed. However, in many practical cases, one may wish to reject the processing of some jobs in the shop, which results in a rejection cost. A solution for a scheduling problem with rejection is given by partitioning the jobs into a set of accepted and a set of rejected jobs, and by scheduling the set of accepted jobs among the machines. The quality of a solution is measured by two criteria: a scheduling criterion, F1, which is dependent on the completion times of the accepted jobs, and the total rejection cost, F2. Problems of scheduling with rejection have been previously studied, but usually within a narrow framework-focusing on one scheduling criterion at a time. This paper provides a robust unified bicriteria analysis of a large set of single machine problems sharing a common property, namely, all problems can be represented by or reduced to a scheduling problem with a scheduling criterion which includes positional penalties. Among these problems are the minimization of the makespan, the sum of completion times, the sum and variation of completion times, and the total earliness plus tardiness costs where the due dates are assignable. Four different problem variations for dealing with the two criteria are studied. The variation of minimizing F1+F2 is shown to be solvable in polynomial time, while all other three variations are shown to be NP-hard. For those hard problems we provide a pseudo polynomial time algorithm. An FPTAS for obtaining an approximate efficient schedule is provided as well. In addition, we present some interesting special cases which are solvable in polynomial time.", "paper_title": "A bicriteria approach to scheduling a single machine with job rejection and positional penalties", "paper_id": "WOS:000302381300001"}