{"auto_keywords": [{"score": 0.003986103192038901, "phrase": "important_mathematical_features"}, {"score": 0.003916098498242888, "phrase": "cholera_model"}, {"score": 0.0036697319652557363, "phrase": "basic_reproductive_number"}, {"score": 0.0033584796908285894, "phrase": "disease-free_equilibrium"}, {"score": 0.0031845067058084583, "phrase": "local_stability"}, {"score": 0.0031285355811105945, "phrase": "endemic_equilibrium"}, {"score": 0.0030554300179552415, "phrase": "centre_manifold_theory"}, {"score": 0.002897109710213723, "phrase": "suitable_lyapunov_function"}, {"score": 0.0028630535573013686, "phrase": "numerical_simulations"}, {"score": 0.0025436978068459565, "phrase": "cholera_infected_individuals"}, {"score": 0.0024118292918742967, "phrase": "nutritional_issues"}, {"score": 0.0023415390666563177, "phrase": "impoverished_communities"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Cholera model", " Malnutrition", " Susceptibility", " Reproduction number", " Equilibria", " Stability"], "paper_abstract": "Although cholera has existed for ages, it has continued to plague many parts of the world. In this study, a deterministic model for cholera in a community is presented and rigorously analysed in order to determine the effects of malnutrition in the spread of the disease. The important mathematical features of the cholera model are thoroughly investigated. The epidemic threshold known as the basic reproductive number and equilibria for the model are determined, and stabilities are investigated. The disease-free equilibrium is shown to be globally asymptotically stable. Local stability of the endemic equilibrium is determined using centre manifold theory and conditions for its global stability are derived using a suitable Lyapunov function. Numerical simulations suggest that an increase in susceptibility to cholera due to malnutrition results in an increase in the number of cholera infected individuals in a community. The results suggest that nutritional issues should be addressed in impoverished communities affected by cholera in order to reduce the burden of the disease. (C) 2010 Elsevier Ltd. All rights reserved.", "paper_title": "Modelling and analysis of the effects of malnutrition in the spread of cholera", "paper_id": "WOS:000287729700001"}