{"auto_keywords": [{"score": 0.04734651634881102, "phrase": "affective_domain_teaching_goals"}, {"score": 0.022819174507643772, "phrase": "elementary_school_students"}, {"score": 0.010612387000973441, "phrase": "reinforcement_mechanism"}, {"score": 0.008067795309504043, "phrase": "younger_students"}, {"score": 0.007959614772851708, "phrase": "distance_education"}, {"score": 0.004602395776895036, "phrase": "responding_stages"}, {"score": 0.00447937340641839, "phrase": "class_period"}, {"score": 0.004439097815805505, "phrase": "distance_education_courses"}, {"score": 0.004055652445791872, "phrase": "cognitive_aspects"}, {"score": 0.003929391999210588, "phrase": "course's_effect"}, {"score": 0.003191714656606822, "phrase": "synchronous_discussion_procedure"}, {"score": 0.0030644247579222333, "phrase": "affective_aspects"}, {"score": 0.0028764048059439205, "phrase": "students'_attitudes"}, {"score": 0.0027993885490232677, "phrase": "instant_feedback"}, {"score": 0.002455168454109375, "phrase": "comparative_assessments"}, {"score": 0.0021925226977381244, "phrase": "response_stage"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Distance education and telelearning", " Interactive learning environment", " Computer-mediated-communication", " Teaching strategies"], "paper_abstract": "Distance education courses must cope with the difficulties imposed by delivering a class at a distance. As most courses only emphasize the cognitive aspects of the class and neglect the course's effect on the students, this gives no help for reaching the affective domain teaching goals. Especially for younger students, in distance education, when younger students are out of the sight of teachers, they could easily be distracted by the environment around them. This research outlines a synchronous discussion procedure with reinforcement mechanism designed for elementary school students to integrate the affective aspects of teaching into distance education within a class period. The mechanism allows teachers to understand students' attitudes within the class and provides instant feedback to the teacher. Learners can also get information about their attitudes and help to reach the affective domain teaching goals of the courses. This mechanism was implemented and investigated. Comparative assessments were made by administering interviews and questionnaires to elementary school students. The results show that the procedure can supervise learners and help them reach the response stage of the affective domain teaching goals. (C) 2008 Elsevier Ltd. All rights reserved.", "paper_title": "A synchronous distance discussion procedure with reinforcement mechanism: Designed for elementary school students to achieve the attending and responding stages of the affective domain teaching goals within a class period", "paper_id": "WOS:000259945200010"}