{"auto_keywords": [{"score": 0.04942443830451117, "phrase": "level-set_method"}, {"score": 0.03683519254224082, "phrase": "macklin"}, {"score": 0.015634315593084976, "phrase": "normal_vector"}, {"score": 0.0120638586212121, "phrase": "normal_vectors"}, {"score": 0.011174507097433865, "phrase": "present_scheme"}, {"score": 0.006301683445563956, "phrase": "lowengrub"}, {"score": 0.00575490367601669, "phrase": "lowengrub's_scheme"}, {"score": 0.00481495049065317, "phrase": "interface_curvature"}, {"score": 0.004668531587208179, "phrase": "direction_difference_scheme"}, {"score": 0.004504321290755568, "phrase": "present_discretization_scheme"}, {"score": 0.004253618550301311, "phrase": "level-set_function"}, {"score": 0.004103942174451674, "phrase": "topological_changes"}, {"score": 0.004070153192617142, "phrase": "standard_discretization_techniques"}, {"score": 0.003820144626025562, "phrase": "signed-distance_function"}, {"score": 0.003555902292752528, "phrase": "discretization_scheme"}, {"score": 0.003516898780234098, "phrase": "geometry-aware_curvature_discretization"}, {"score": 0.0033651019362620866, "phrase": "ghost-fluid_method"}, {"score": 0.0032287289440915187, "phrase": "existing_level-set_code"}, {"score": 0.0030808211830129304, "phrase": "second-order_central-difference_scheme"}, {"score": 0.0027665315772006575, "phrase": "axisymmetric_flow"}, {"score": 0.002713604305939145, "phrase": "navier-stokes_equations"}, {"score": 0.0026986685585382347, "phrase": "incompressible_two-phase_flow"}, {"score": 0.0023834640793589414, "phrase": "second-order_central_difference_scheme"}, {"score": 0.0022804767338275023, "phrase": "lowengrub's_method"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Level-set method", " Curvature discretization", " Normal-vector discretization", " Curve-fitting discretization scheme", " Finite differences", " Ghost-fluid method"], "paper_abstract": "This article addresses the use of the level-set method for capturing the interface between two fluids. One of the advantages of the level-set method is that the curvature and the normal vector of the interface can be readily calculated from the level-set function. However, in cases where the level-set method is used to capture topological changes, the standard discretization techniques for the curvature and the normal vector do not work properly. This is because they are affected by the discontinuities of the signed-distance function half-way between two interfaces. This article addresses the calculation of normal vectors and curvatures with the level-set method for such cases. It presents a discretization scheme based on the geometry-aware curvature discretization by Macklin and Lowengrub [1]. As the present scheme is independent of the ghost-fluid method, it becomes more generally applicable, and it can be implemented into an existing level-set code more easily than Macklin and Lowengrub's scheme [1]. The present scheme is compared with the second-order central-difference scheme and with Macklin and Lowengrub's scheme [1], first for a case with no flow, then for a case where two drops collide in a 20 shear flow, and finally for a case where two drops collide in an axisymmetric flow. In the latter two cases, the Navier-Stokes equations for incompressible two-phase flow are solved. The article also gives a comparison of the calculation of normal vectors with the direction difference scheme presented by Macklin and Lowengrub in [2] and with the present discretization scheme. The results show that the present discretization scheme yields more robust calculations of the curvature than the second-order central difference scheme in areas where topological changes are imminent. The present scheme compares well to Macklin and Lowengrub's method [1]. The results also demonstrate that the direction difference scheme [2] is not always sufficient to accurately calculate the normal vectors. (C) 2013 Elsevier Ltd. All rights reserved.", "paper_title": "Calculation of the interface curvature and normal vector with the level-set method", "paper_id": "WOS:000323464300018"}