{"auto_keywords": [{"score": 0.03979933391791906, "phrase": "manual_data_collection"}, {"score": 0.00481495049065317, "phrase": "manual_data"}, {"score": 0.004759572725240754, "phrase": "java"}, {"score": 0.004632597963417253, "phrase": "data_collection"}, {"score": 0.004405779372462873, "phrase": "empirical_studies"}, {"score": 0.004271729935895193, "phrase": "software_informs"}, {"score": 0.00415777266387528, "phrase": "wider_issues"}, {"score": 0.0039085400187964196, "phrase": "automatic_data_collection"}, {"score": 0.0038189638340666936, "phrase": "numerous_occasions"}, {"score": 0.003427246079774314, "phrase": "java_software"}, {"score": 0.0032216622984027558, "phrase": "automated_and_manual_data_collection"}, {"score": 0.00282470997972535, "phrase": "key_indicators"}, {"score": 0.002728059572916527, "phrase": "poor_developer_coding_style"}, {"score": 0.002665465323614577, "phrase": "oo_coding_principles"}, {"score": 0.0026043035241045394, "phrase": "relatively_large_classes"}, {"score": 0.0025445415633818472, "phrase": "interesting_results"}, {"score": 0.0024669814850296146, "phrase": "public_class_features"}, {"score": 0.002283243905993669, "phrase": "typical_problems"}, {"score": 0.0021544587602892466, "phrase": "poorly_written_systems"}, {"score": 0.0021049977753042253, "phrase": "visually_extracted_data"}], "paper_keywords": ["data collection", " Java", " software metrics", " empirical investigation"], "paper_abstract": "Data collection, both automatic and manual, lies at the heart of all empirical studies. The quality of data collected from software informs decisions on maintenance, testing and wider issues such as the need for system re-engineering. While of the two types stated, automatic data collection is preferable, there are numerous occasions when manual data collection is unavoidable. Yet, very little evidence exists to assess the error-proneness of the latter. Herein, we investigate the extent to which manual data collection for Java software compared with its automatic counterpart for the same data. We investigate three hypotheses relating to the difference between automated and manual data collection. Five Java systems were used to support our investigation. Results showed that, as expected, manual data collection was error-prone, but nowhere near the extent we had initially envisaged. Key indicators of mistakes in manual data collection were found to be poor developer coding style, poor adherence to sound OO coding principles, and the existence of relatively large classes in some systems. Some interesting results were found relating to the collection of public class features and the types of error made during manual data collection. The study thus offers an insight into some of the typical problems associated with collecting data manually; more significantly, it highlights the problems that poorly written systems have on the quality of visually extracted data.", "paper_title": "Quality of manual data collection in Java software: an empirical investigation", "paper_id": "WOS:000246521000003"}