{"auto_keywords": [{"score": 0.04458003012492911, "phrase": "ivoa"}, {"score": 0.00481495049065317, "phrase": "multi-tiered_virtual_observatory"}, {"score": 0.004652691027172206, "phrase": "spase"}, {"score": 0.004608879242346434, "phrase": "wide_range"}, {"score": 0.004202223763361474, "phrase": "planetary_data_system"}, {"score": 0.003925633992809873, "phrase": "metadata_standards"}, {"score": 0.003775803846431323, "phrase": "information_resources"}, {"score": 0.0036671822784770463, "phrase": "virtual_observatories"}, {"score": 0.003614044704141927, "phrase": "resource_sharing_environment"}, {"score": 0.0035443861412929006, "phrase": "available_resources"}, {"score": 0.0035100601949451028, "phrase": "help_users"}, {"score": 0.0030628762739398855, "phrase": "resource_providers"}, {"score": 0.002917331114260319, "phrase": "information_exchange"}, {"score": 0.002331781764406665, "phrase": "management_overhead"}, {"score": 0.0021049977753042253, "phrase": "comprehensive_solution"}], "paper_keywords": ["Harvesting", " Search registry", " Topology", " Virtual observatory"], "paper_abstract": "Virtual observatories are being established in a wide range a disciplines, supported by a variety of agencies. Groups such as the International Virtual Observatory Alliance (IVOA), Planetary Data System (PDS) and the Space Physics Archive Search and Extract (SPASE) consortium are defining metadata standards to aid in archiving and sharing of information resources. The role of the virtual observatories in this resource sharing environment is to locate available resources and help users find the resources they need and then gain access to those resources. There are many different existing resource providers from which virtual observatories must collect descriptions of their resources. These resource providers may have associations with other providers so the topology of information exchange can be complicated. We explore the variety of topologies that can exist and discuss methods of collecting (harvesting) information from providers such as scheduled and on-demand harvesting. We compare the benefits of each approach and look at the issues of management overhead, adaptability and timeliness. We also explore the benefits of combining searching and harvesting services as part of a comprehensive solution.", "paper_title": "The architecture of a multi-tiered virtual observatory", "paper_id": "WOS:000207785300005"}