{"auto_keywords": [{"score": 0.03463278121144341, "phrase": "sensed_data"}, {"score": 0.015719716506582538, "phrase": "multiple_applications"}, {"score": 0.01557684768947525, "phrase": "mobile_cloud_computing"}, {"score": 0.010128672351753696, "phrase": "mobile_handsets"}, {"score": 0.0047268728636719725, "phrase": "modern_mobile_handsets"}, {"score": 0.004619027561771169, "phrase": "wearable_devices"}, {"score": 0.004492841495994535, "phrase": "wide_range"}, {"score": 0.004211594861013822, "phrase": "novel_applications"}, {"score": 0.004153647187175639, "phrase": "collaborative_sensing"}, {"score": 0.004077616905584829, "phrase": "application_logic"}, {"score": 0.004002972723329302, "phrase": "sensor_input"}, {"score": 0.0038046452381676967, "phrase": "defined_physical_area"}, {"score": 0.0035828427627676075, "phrase": "raw_or_pre-processed_sensed_data"}, {"score": 0.0027275289970185015, "phrase": "particular_physical_area"}, {"score": 0.0023305762840188145, "phrase": "better_overall_performance"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Mobile cloud", " Collaborative sensing", " Information aggregation", " Frequent pattern mining", " Optimization", " Human mobility"], "paper_abstract": "Modern mobile handsets and the myriad of wearable devices connected to them offer a wide range of sensing capabilities. The ubiquity of such sensing devices offers the potential to realise novel applications based on collaborative sensing, in which application logic makes use of sensor input from a number of handsets, typically distributed across a defined physical area. Such applications will be enabled by mobile cloud computing, with the devices transferring raw or pre-processed sensed data to application logic hosted in the cloud. This results in a trade-off between the quality of the sensed data received by applications and the energy required to transfer data from the mobile handsets. We address this tradeoff by considering a scheme in which a collaborative sensing middleware mediates between multiple applications requiring sensed data and the mobile handsets located within a particular physical area. We present and evaluate an algorithm which seeks to maximise the degree to which sensed data transferred from a given mobile device can be served to more than one application. We show that this algorithm leads to better overall performance in terms of energy used than an algorithm which does not aggregate sensed information between applications. (C) 2015 Elsevier Inc. All rights reserved.", "paper_title": "Energy-aware collaborative sensing for multiple applications in mobile cloud computing", "paper_id": "WOS:000368605400009"}