{"auto_keywords": [{"score": 0.04243918585673839, "phrase": "missing_data"}, {"score": 0.00481495049065317, "phrase": "situational_predictors"}, {"score": 0.004725886853744007, "phrase": "experience_sampling_research"}, {"score": 0.00466016686289196, "phrase": "sampling_research_measures"}, {"score": 0.00436530211426514, "phrase": "brief_questionnaires"}, {"score": 0.004166129325245761, "phrase": "daily_life"}, {"score": 0.0040890178236849825, "phrase": "vexing_source"}, {"score": 0.003994624397219346, "phrase": "present_research"}, {"score": 0.003407839062159497, "phrase": "person_level"}, {"score": 0.0032219438233946312, "phrase": "positive_schizotypy"}, {"score": 0.0031919592786945126, "phrase": "depressive_symptoms"}, {"score": 0.0030891871245908665, "phrase": "day_level"}, {"score": 0.002839812512030847, "phrase": "signal_level"}, {"score": 0.002722758109991685, "phrase": "lagged_signal-level_analyses"}, {"score": 0.002622755848331379, "phrase": "prior_signal"}, {"score": 0.0025264171945423254, "phrase": "next_signal"}, {"score": 0.002300734266971646, "phrase": "major_sources"}], "paper_keywords": ["experience sampling method", " ecological daily assessment", " missing data", " response rates", " compliance"], "paper_abstract": "Experience sampling research measures people's thoughts, feelings, and actions in their everyday lives by repeatedly administering brief questionnaires throughout the day. Nonresponsefailing to respond to these daily life questionnaireshas been a vexing source of missing data. The present research examined person-level, day-level, and signal-level predictors of nonresponse. We analyzed data from a sample of 450 young adults who were signaled 8 times a day for 7 days. At the person level, nonresponse was higher for men and for people high in positive schizotypy, depressive symptoms, and hypomania. At the day level, nonresponse increased over the first few days of the study and then declined toward the end. At the signal level, time of day strongly predicted nonresponse. Lagged signal-level analyses examined how emotions and experiences at a prior signal prospectively predicted the likelihood of ignoring the next signal. Only one variablefeelings of enthusiasmhad a significant lagged effect, which suggests that within-day experiences are not major sources of nonresponse. For the most part, the day of the study and the time of day had the most salient effects. Understanding the predictors of missing data allows researchers to implement methods to increase compliance and to handle missing data more effectively by including predictors of nonresponse.", "paper_title": "Missed Beeps and Missing Data: Dispositional and Situational Predictors of Nonresponse in Experience Sampling Research", "paper_id": "WOS:000320986100006"}