{"auto_keywords": [{"score": 0.040779733194402555, "phrase": "first_study"}, {"score": 0.027732480784099168, "phrase": "stuttering_frequency"}, {"score": 0.011995371005433398, "phrase": "second_study"}, {"score": 0.010979847889061048, "phrase": "experimental_conditions"}, {"score": 0.007282470187781493, "phrase": "silent_reading"}, {"score": 0.00695944817593351, "phrase": "oral_reading"}, {"score": 0.00686794230421525, "phrase": "initial_syllable"}, {"score": 0.00481495049065317, "phrase": "single_syllable"}, {"score": 0.00475150649724598, "phrase": "varied_syllable_positions"}, {"score": 0.004715627046920263, "phrase": "utterance_productions"}, {"score": 0.004653485665080485, "phrase": "overt_speech_disorder"}, {"score": 0.004583464412234181, "phrase": "phrase_and_sentence_initiations"}, {"score": 0.004480394224548146, "phrase": "neuromotor_processes"}, {"score": 0.004454989257075287, "phrase": "motor_speech_movements"}, {"score": 0.004404608754616713, "phrase": "motor_initiation"}, {"score": 0.004281125387210667, "phrase": "silent_articulations"}, {"score": 0.0041610894116810935, "phrase": "neuromotor_planning"}, {"score": 0.004145339925970421, "phrase": "speech_actions"}, {"score": 0.00412964980396265, "phrase": "disfluent_behaviors"}, {"score": 0.00396091358532325, "phrase": "audibly_produced_utterance"}, {"score": 0.0036162231979805105, "phrase": "unique_set"}, {"score": 0.0035415392642831616, "phrase": "single_syllable_productions"}, {"score": 0.0034948153971535107, "phrase": "final_syllable_positions"}, {"score": 0.003178468523849934, "phrase": "audibly_produced_utterances"}, {"score": 0.0030892533800837463, "phrase": "single_syllables"}, {"score": 0.0026945722090537397, "phrase": "statistical_significance"}, {"score": 0.0026489133838301427, "phrase": "second_experiment"}, {"score": 0.002638872231303218, "phrase": "post_hoc_comparisons"}, {"score": 0.002608975977315032, "phrase": "initial_position"}, {"score": 0.002455142972880156, "phrase": "current_studies"}, {"score": 0.002399817810984723, "phrase": "sr_and_p_strategies"}, {"score": 0.0023591417077156555, "phrase": "greatest_reduction"}, {"score": 0.002336841834522163, "phrase": "silent_motor_plans"}, {"score": 0.002279841453843241, "phrase": "p_conditions"}, {"score": 0.0022625835448873495, "phrase": "current_feed-forward_models"}, {"score": 0.002215793441202354, "phrase": "initial_syllable_positions"}, {"score": 0.0021865218861454256, "phrase": "behavioral_strategies"}, {"score": 0.002165850165758528, "phrase": "p_speech"}, {"score": 0.0021576361843452826, "phrase": "predictive_neuromotor_planning"}, {"score": 0.0021494532873322547, "phrase": "feedback_mechanisms"}, {"score": 0.002137236968970666, "phrase": "output_gain"}, {"score": 0.0021291312714904957, "phrase": "neuromotor_planning_regions"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Stutter", " Fluency", " Pantomime", " Silent reading", " Models of speech", " Feed-forward"], "paper_abstract": "Background. Stuttering is an overt speech disorder with the majority of disruptions occurring during phrase and sentence initiations. Recent theories and models of stuttering often describe deficits in neuromotor processes for planning motor speech movements, especially those involved during motor initiation. Interestingly, stuttering-like behaviors are reduced by approximately by nearly 100% during silent articulations (i.e., pantomime speech). If stuttering is primarily a deficit in neuromotor planning for speech actions, disfluent behaviors should. be significantly reduced throughout an utterance when people who stutter employ silent reading or pantomime strategies on one syllable of an audibly produced utterance. Aims and scope: The aim of the first study was to examine stuttering frequency during oral reading as participants who stutter producdd the initial syllable under silent reading (SR), pantomime (P), and redacted (R) speech conditions. Similarly, the second study examined stuttering frequency during oral reading as a unique set of participants who stutter employed SR or P strategies on single syllable productions in initial, middle, and final syllable positions of an utterance. Methods and procedures: Two unique sets of participants who stutter audibly read sentences under baseline and experimental conditions. Experimental conditions for the first study consisted of (1) SR, (2) P, and (3) R on the initial syllable of audibly produced utterances. Experimental conditions for the second study consisted of participants performing SR and P on single syllables in initial, middle, and final syllable positions throughout an audibly produced utterance. Results: Stuttering was significantly reduced during all experimental conditions in the first study. All experimental conditions differed from all others in the first study with P, SR, and R progressing from most to least effective. Results from the second study revealed differences from both SR and P to baseline and differences in both the initial and final syllable positions to baseline, but not the middle position to others, which approached statistical significance (p = 0.1). In the second experiment, post hoc comparisons revealed that P in the initial position was the most effective and that P was significantly more effective than SR in both the initial and final positions, which supports the findings from the first study. Conclusions and implications: Results from the current studies demonstrate a reduction of stuttering throughout an utterance when participants employed SR and P strategies on single syllables within an utterance. The greatest reduction in stuttering frequency occurred when silent motor plans were enacted and not just read or omitted (i.e., during P conditions). Supporting current feed-forward models of stuttering, strategies were most effective when employed in initial syllable positions. It can be hypothesized that behavioral strategies such as SR and P speech alter predictive neuromotor planning via feedback mechanisms or enhancing output gain of neuromotor planning regions. (C) 2015 Elsevier B.V. All rights reserved.", "paper_title": "The effect of single syllable silent reading and pantomime speech in varied syllable positions on stuttering frequency throughout utterance productions", "paper_id": "WOS:000366226800006"}