{"auto_keywords": [{"score": 0.02806136552690869, "phrase": "participant-defined_scripting"}, {"score": 0.015719716506582538, "phrase": "tabletop_brainstorming"}, {"score": 0.0076890301600071815, "phrase": "fixed_scripting"}, {"score": 0.004730338746443662, "phrase": "widely_used_method"}, {"score": 0.004647206916983993, "phrase": "interactive_tabletops"}, {"score": 0.0043443560029027195, "phrase": "natural_round-table_discussions"}, {"score": 0.004298367681427065, "phrase": "shared_digital_space"}, {"score": 0.0039195744361570075, "phrase": "scripted_collaboration"}, {"score": 0.0037163618245226755, "phrase": "scriptstorm"}, {"score": 0.0035613768414594262, "phrase": "set_script"}, {"score": 0.0035236476185949565, "phrase": "brainstorming_participants"}, {"score": 0.003400736815046841, "phrase": "human_facilitator"}, {"score": 0.003212906206685004, "phrase": "script_settings"}, {"score": 0.0031340167205149787, "phrase": "additional_interface_complexity"}, {"score": 0.0030354183220734038, "phrase": "learning_time"}, {"score": 0.0029087480993530796, "phrase": "effective_brainstorming"}, {"score": 0.0024877583128884457, "phrase": "user_study"}, {"score": 0.0023586032632567796, "phrase": "relative_benefits"}, {"score": 0.0021734395455430167, "phrase": "potential_benefits"}, {"score": 0.0021049977753042253, "phrase": "collaborative_tabletop_activities"}], "paper_keywords": ["CSCL scripts", " Brainstorming", " Interactive surfaces", " Tabletops", " Design"], "paper_abstract": "Brainstorming is a widely used method for enhancing creativity. Interactive tabletops offer promise for making brainstorming more effective. This is because tabletops should help collocated people collaborate in natural round-table discussions at a shared digital space. However, tabletops have not been found in and of themselves to improve collaboration. This paper explores how to adapt an approach called scripted collaboration to enhance the effectiveness of tabletop brainstorming. We describe the design and implementation of ScriptStorm in two forms: fixed scripting, where the table enforces a set script that the brainstorming participants cannot alter, in the spirit of a human facilitator; and participant-defined scripting, where the interface gives participants control over the script settings. We hypothesised that: the additional interface complexity of the scripting is acceptable in terms of learning time and usability (H1-usability); both forms of scripting support effective brainstorming (H2-effectiveness); people consider that both forms of scripting help them learn about how to brainstorm (H3-learning); and people would prefer participant-defined scripting for the control it gave them over the script (H4-control). We conducted a user study to evaluate these hypotheses. Our results give support to all four hypotheses, although the relative benefits of fixed scripting and participant-defined scripting are nuanced. Our key contributions are insights into two ways that scripted collaboration can support brainstorming, pointing to the potential benefits of fixed scripting and participant-defined scripting for other classes of collaborative tabletop activities.", "paper_title": "ScriptStorm: scripting to enhance tabletop brainstorming", "paper_id": "WOS:000339891900015"}