{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "error_estimates"}, {"score": 0.004770211811866158, "phrase": "discontinuous_signals"}, {"score": 0.004616859702338596, "phrase": "classical_sampling_theorem"}, {"score": 0.004510336430422002, "phrase": "real_life_signal_processing"}, {"score": 0.00428451995524549, "phrase": "fast_and_efficient_computation"}, {"score": 0.003741712498615481, "phrase": "finite_sum"}, {"score": 0.003672427620845944, "phrase": "truncation_error"}, {"score": 0.0034884152484429207, "phrase": "first_drawback"}, {"score": 0.0033761303704612734, "phrase": "definite_restriction"}, {"score": 0.0032370412139943808, "phrase": "time-limited_signals"}, {"score": 0.0030891871245908665, "phrase": "entire_past"}, {"score": 0.0030461580449080553, "phrase": "full_future"}, {"score": 0.0026722904884984348, "phrase": "shifted_b-splines"}, {"score": 0.0025264171945423254, "phrase": "deterministic_approach"}], "paper_keywords": ["Averaged moduli of smoothness", " discrete operators", " error estimates", " generalized sampling series", " order of approximation", " prediction", " splines"], "paper_abstract": "There are several reasons why the classical sampling theorem is rather impractical for real life signal processing. First, the sinc-kernel is not very suitable for fast and efficient computation; it decays much too slowly. Second, in practice only a finite number of sampled values are available, so that the representation of a signal f by the finite sum would entail a truncation error which decreases rather slowly for N -> infinity, due to the first drawback. Third, band-limitation is a definite restriction, due to the nonconformity of band and time-limited signals. Further, the samples needed extend from the entire past to the full future, relative to some time t = t(0). This paper presents an approach to overcome these difficulties. The sinc-function is replaced by certain simple linear combinations of shifted B-splines, only a finite number of samples from the past need be available. This deterministic approach can be used to process arbitrary, not necessarily bandlimited nor differentiable signals, and even not necessarily continuous signals. Best possible error estimates in terms of an L(p)-average modulus of smoothness are presented. Several typical examples exhibiting the various problems involved are worked out in detail.", "paper_title": "Prediction by Samples From the Past With Error Estimates Covering Discontinuous Signals", "paper_id": "WOS:000273134100044"}