{"auto_keywords": [{"score": 0.04770073889647974, "phrase": "medical_imaging_data"}, {"score": 0.02426319493463218, "phrase": "user_study"}, {"score": 0.004777392826700429, "phrase": "slice-based_visualizations"}, {"score": 0.004504850679320975, "phrase": "numerous_examples"}, {"score": 0.004331811712726697, "phrase": "slice-based_visualization"}, {"score": 0.0038817197332605647, "phrase": "detailed_analyses"}, {"score": 0.003806395038279074, "phrase": "general_interest"}, {"score": 0.0034646205853140558, "phrase": "specialized_techniques"}, {"score": 0.0032158817866929563, "phrase": "new_volume_picking_technique"}, {"score": 0.0031907572162427978, "phrase": "wysiwyp"}, {"score": 0.0029849474387154827, "phrase": "previous_work"}, {"score": 0.002926973459215349, "phrase": "pre-segmented_data"}, {"score": 0.0026639507068734907, "phrase": "transfer_function"}, {"score": 0.0026019646284747024, "phrase": "volumetric_rendering"}, {"score": 0.002472552537325606, "phrase": "proposed_method"}, {"score": 0.0024150092189446424, "phrase": "automated_positioning"}, {"score": 0.0023773911659018825, "phrase": "volumetric_scalar_fields"}, {"score": 0.0021636476333109144, "phrase": "wysiwyp."}, {"score": 0.0021049977753042253, "phrase": "resulting_positions"}], "paper_keywords": ["Picking", " volume rendering", " WYSIWYG"], "paper_abstract": "Scientists, engineers and physicians are used to analyze 3D data with slice-based visualizations. Radiologists for example are trained to read slices of medical imaging data. Despite the numerous examples of sophisticated 3D rendering techniques, domain experts, who still prefer slice-based visualization do not consider these to be very useful. Since 3D renderings have the advantage of providing an overview at a glance, while 2D depictions better serve detailed analyses, it is of general interest to better combine these methods. Recently there have been attempts to bridge this gap between 2D and 3D renderings. These attempts include specialized techniques for volume picking in medical imaging data that result in repositioning slices. In this paper, we present a new volume picking technique called WYSIWYP (\"what you see is what you pick\") that, in contrast to previous work, does not require pre-segmented data or metadata and thus is more generally applicable. The positions picked by our method are solely based on the data itself, the transfer function, and the way the volumetric rendering is perceived by the user. To demonstrate the utility of the proposed method, we apply it to automated positioning of slices in volumetric scalar fields from various application areas. Finally, we present results of a user study in which 3D locations selected by users are compared to those resulting from WYSIWYP. The user study confirms our claim that the resulting positions correlate well with those perceived by the user.", "paper_title": "WYSIWYP: What You See Is What You Pick", "paper_id": "WOS:000310143100027"}