{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "railway_interlockings"}, {"score": 0.004761494044422926, "phrase": "train_lengths"}, {"score": 0.00470862827326028, "phrase": "safety_analysis"}, {"score": 0.004673709383305897, "phrase": "interlocking_railway_systems"}, {"score": 0.004354572391793908, "phrase": "wrongly-set_points"}, {"score": 0.00389427992231721, "phrase": "track_segments"}, {"score": 0.003601235776892337, "phrase": "modelling_methodologies"}, {"score": 0.003418186564522323, "phrase": "arbitrarily_many_trains"}, {"score": 0.003392804886610623, "phrase": "arbitrary_length"}, {"score": 0.0031490944606172152, "phrase": "safety_conditions"}, {"score": 0.0030679850425428053, "phrase": "safety_violation"}, {"score": 0.0030225753906647935, "phrase": "original_model"}, {"score": 0.002826383890518307, "phrase": "simpler_model"}, {"score": 0.002652768049567487, "phrase": "railway_engineers"}, {"score": 0.0025366596616434793, "phrase": "verification_conditions"}, {"score": 0.0024620842899061614, "phrase": "design_errors"}, {"score": 0.0024346858809238766, "phrase": "comprehensible_feedback"}, {"score": 0.0023807981747706376, "phrase": "abstraction_techniques"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Railway verification", " CSP parallel to B", " Modelling and analysis"], "paper_abstract": "The safety analysis of interlocking railway systems involves verifying freedom from collision, derailment and run-through (that is, trains rolling over wrongly-set points). Typically, various unrealistic assumptions are made when modelling trains within networks in order to facilitate their analyses. In particular, trains are invariably assumed to be shorter than track segments; and generally only a very few trains are allowed to be introduced into the network under consideration. In this paper we propose modelling methodologies which elegantly dismiss these assumptions. We first provide a framework for modelling arbitrarily many trains of arbitrary length in a network; and then we demonstrate that it is enough with our modelling approach to consider only two trains when verifying safety conditions. That is, if a safety violation appears in the original model with any number of trains of any and varying lengths, then a violation will be exposed in the simpler model with only two trains. Importantly, our modelling framework has been developed alongside - and in conjunction with - railway engineers. It is vital that they can validate the models and verification conditions, and - in the case of design errors - obtain comprehensible feedback. We demonstrate our modelling and abstraction techniques on two simple interlocking systems proposed by our industrial partner. As our formalization is, by design, near to their way of thinking, they are comfortable with it and trust it. (C) 2014 Elsevier B.V. All rights reserved.", "paper_title": "On modelling and verifying railway interlockings: Tracking train lengths", "paper_id": "WOS:000345181100004"}