{"auto_keywords": [{"score": 0.046273829908275735, "phrase": "technology-based_services"}, {"score": 0.012690798578611617, "phrase": "healthcare_industry"}, {"score": 0.009551506297153955, "phrase": "patient_satisfaction"}, {"score": 0.009371969428690565, "phrase": "patient_loyalty"}, {"score": 0.00481495049065317, "phrase": "self-service_technologies"}, {"score": 0.004349337717774093, "phrase": "overall_service_efficiency"}, {"score": 0.003829877278269543, "phrase": "hospital_image"}, {"score": 0.0036864465771943933, "phrase": "crucial_factor"}, {"score": 0.003639835714755229, "phrase": "patients'_choice"}, {"score": 0.0026475981474045414, "phrase": "survey_data"}, {"score": 0.0025160740422447837, "phrase": "online_appointment_system"}, {"score": 0.002468450551616404, "phrase": "research_results"}, {"score": 0.0021049977753042253, "phrase": "future_work"}], "paper_keywords": [""], "paper_abstract": "Although there have been studies discussing the influence of technology-based services on the overall service efficiency and quality of organizations in various industries, very little effort has been devoted to investigating this issue in the healthcare industry. Hospital image is considered to be a crucial factor influencing patients' choice of hospitals, but few studies specifically examine its association with technology-based services. By consulting the model of the European Customer Satisfaction Index, a research model for evaluating the impact of the use of technology-based services on hospital image, patient satisfaction, and patient loyalty in the healthcare industry is developed and examined in this study using survey data collected from 738 patients at two medical centers with an online appointment system. The research results confirm the importance of providing quality, technology-based services in enhancing hospital image, patient satisfaction, and patient loyalty. The implications of this research and suggestions for future work are also discussed.", "paper_title": "Technology-Based Service Encounters Using Self-Service Technologies in the Healthcare Industry", "paper_id": "WOS:000314164400001"}