{"auto_keywords": [{"score": 0.048339607507904336, "phrase": "pavement_distress"}, {"score": 0.025976641870447997, "phrase": "accuracy_rates"}, {"score": 0.00481495049065317, "phrase": "multi-resolution_methods"}, {"score": 0.004230068512904886, "phrase": "automated_imaging_system"}, {"score": 0.004178198896815672, "phrase": "distress_detection"}, {"score": 0.004076352180903171, "phrase": "asphalt_pavement_distress"}, {"score": 0.004001593118269276, "phrase": "pavement_image_acquisition_system"}, {"score": 0.003738973626996355, "phrase": "discriminating_power"}, {"score": 0.0035369291417564606, "phrase": "curvelet-based_texture_descriptors"}, {"score": 0.0025812459787060097, "phrase": "curvelet-based_signatures"}, {"score": 0.0023527296826339225, "phrase": "let-based_signatures"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Pavement distress", " Wavelets", " Ridgelets", " Curvelets", " Cracking distress", " Pothole distress"], "paper_abstract": "The research presented in this article is aimed at the development of an automated imaging system for distress detection and isolation in asphalt pavement distress obtained from pavement image acquisition system (PIAS). This article focuses on comparing the discriminating power of several multi-resolution texture analysis techniques using wavelet, ridgelet, and curvelet-based texture descriptors. The approach consists of four steps: Image collection, segmentation of regions of interest (ROI), extraction of the most discriminative texture features, creation of a classifier that automatically identifies the pavement distress, and storage. Tests comparing the wavelet, ridgelet, and curvelet texture features indicated that curvelet-based signatures outperform all other multi-resolution techniques for pothole distress, yielding accuracy rates in the 97.9%. Ridge let-based signatures outperform all other multi-resolution techniques for cracking distress, yielding accuracy rates in the 93.6-96.4% rate. (C) 2010 Elsevier Ltd. All rights reserved.", "paper_title": "A comparison of multi-resolution methods for detection and isolation of pavement distress", "paper_id": "WOS:000284863200169"}