{"auto_keywords": [{"score": 0.038323814569956004, "phrase": "reliable_edges"}, {"score": 0.02322730111336097, "phrase": "hop-constrained_survivable_network_design_problem"}, {"score": 0.004367707617503722, "phrase": "non-negative_edge_costs"}, {"score": 0.00415019999222481, "phrase": "minimum_cost_set"}, {"score": 0.004036141321779216, "phrase": "induced_subgraph"}, {"score": 0.0038174032488954147, "phrase": "q."}, {"score": 0.0031113369425402287, "phrase": "reliable_status"}, {"score": 0.0029152572346224253, "phrase": "botton"}, {"score": 0.0028882701690741467, "phrase": "fortz"}, {"score": 0.002861533346297513, "phrase": "gouveia"}, {"score": 0.002607362103727335, "phrase": "benders_decomposition"}, {"score": 0.0025592969422491476, "phrase": "solving_process"}, {"score": 0.002375714262344562, "phrase": "original_problem"}, {"score": 0.002267708463966758, "phrase": "economical_analysis"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Network design", " Survivability", " Hop constraints", " Benders decomposition", " Branch-and-cut algorithms"], "paper_abstract": "In this paper, we study the hop-constrained survivable network design problem with reliable edges. Given a graph with non-negative edge costs and node pairs Q the hop-constrained survivable network design problem consists of constructing a minimum cost set of edges so that the induced subgraph contains at least K edge-disjoint paths containing at most L edges between each pair in Q. In addition, we consider here a subset of reliable edges that are not subject to failure. We study two variants: a static problem where the reliability of edges is given, and an upgrading problem where edges can be upgraded to the reliable status at a given cost We adapt for the two variants an extended formulation proposed in Botton, Fortz, Gouveia, Poss (2011) [1] for the case without reliable edges. As before, we use Benders decomposition to accelerate the solving process. Our computational results indicate that these two variants appear to be more difficult to solve than the original problem (without reliable edges). We conclude with an economical analysis which evaluates the incentive of using reliable edges in the network. (C) 2015 Elsevier Ltd. All rights reserved.", "paper_title": "On the hop-constrained survivable network design problem with reliable edges", "paper_id": "WOS:000360513300013"}