{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "learning_disabilities"}, {"score": 0.014598908252943061, "phrase": "feature_selection"}, {"score": 0.010725059502701372, "phrase": "rotation_forest"}, {"score": 0.010641500172970966, "phrase": "input_decimated_ensemble"}, {"score": 0.009957850944026219, "phrase": "pca"}, {"score": 0.00462919213721188, "phrase": "extensive_study"}, {"score": 0.004592905436175987, "phrase": "artificial_intelligence"}, {"score": 0.004295681900150244, "phrase": "experimental_results"}, {"score": 0.003757480190200645, "phrase": "junior_high_school"}, {"score": 0.0036553070575015344, "phrase": "\"elementary_school\"_students"}, {"score": 0.0035981701736904495, "phrase": "\"junior_high_school\"_samples"}, {"score": 0.0034185505275141077, "phrase": "\"elementary_school\"_dataset"}, {"score": 0.00314708280192844, "phrase": "feature_set"}, {"score": 0.0030614565460256897, "phrase": "principal_component_analysis"}, {"score": 0.0026355812883224203, "phrase": "whole_dataset"}, {"score": 0.002533687835358909, "phrase": "transformed_patterns"}, {"score": 0.0023139986108451946, "phrase": "empirical_comparison"}, {"score": 0.0022070310530794097, "phrase": "clustering_method"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Learning disabilities", " Classifier ensembles", " Feature selection"], "paper_abstract": "In this paper, we have made an extensive study of artificial intelligence (AI) techniques like ensemble of classifiers and feature selection for the identification of students with learning disabilities. The experimental results show that our best method, which combines both ensemble of classifiers and feature selection, can correctly identify up to 50% of the learning disabilities (LD) students with 100% confidence. Also when predicting samples in \"junior high school\" using model built on the \"elementary school\" students and when the \"junior high school\" samples are used to build the model we predict the samples in the \"elementary school\" dataset. In particular. we propose variants of two recent Feature Transform-based ensemble methods (Rotation Forest and Input Decimated Ensemble). In the Rotation Forest, the feature set is randomly split into subsets and Principal Component Analysis (PCA) is used to transform the features that belong to a subset. The Input Decimated Ensemble first singles out a given class i and runs PCA on this data only. This transformation is applied to the whole dataset and a classifier D(i) is trained using these transformed patterns. This choice limits the size of the ensemble to the number of classes. In this paper, we perform an empirical comparison varying the Feature Transform method used in the Rotation Forest technique and we propose a clustering method to overcome the drawback of the Input Decimated Ensemble. (C) 2008 Elsevier Ltd. All rights reserved.", "paper_title": "Ensemble generation and feature selection for the identification of students with learning disabilities", "paper_id": "WOS:000262178100136"}