{"auto_keywords": [{"score": 0.034058776392146516, "phrase": "additive_term"}, {"score": 0.00481495049065317, "phrase": "improved_approximability"}, {"score": 0.00478768880281476, "phrase": "non-approximability_results"}, {"score": 0.004421770937919324, "phrase": "resulting_diameter"}, {"score": 0.0034059440658420004, "phrase": "np"}, {"score": 0.0032997289721682505, "phrase": "log_d"}, {"score": 0.003099627849370732, "phrase": "long-standing_approximation_ratios"}, {"score": 0.0028623555849897632, "phrase": "asymptotic_sense"}, {"score": 0.0027979528910467705, "phrase": "mcbd"}, {"score": 0.002413153346716919, "phrase": "multiplicative_factor"}, {"score": 0.002345445530251524, "phrase": "positive_side"}, {"score": 0.0022796331061797916, "phrase": "minimal_number"}, {"score": 0.0022666933944714986, "phrase": "additional_edges"}, {"score": 0.0022093656223897322, "phrase": "required_diameter"}, {"score": 0.002159623311924437, "phrase": "edge-weighted_version"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Approximation algorithms", " Graphs", " Edge addition", " Diameter"], "paper_abstract": "In this paper, we study two variants of the problem of adding edges to a graph so as to reduce the resulting diameter. More precisely, given a graph G = (V, E), and two positive integers D and B, the Minimum-Cardinality Bounded-Diameter Edge Addition (MCBD) problem is to find a minimum-cardinality set F of edges to be added to Gin such a way that the diameter of G + F is less than or equal to D, while the Bounded-Cardinality Minimum-Diameter Edge Addition (BCMD) problem is to find a set F of B edges to be added to G in such a way that the diameter of G + F is minimized. Both problems are well known to be NP-hard, as well as approximable within O(log n log D) and 4 (up to an additive term of 2), respectively. In this paper, we improve these long-standing approximation ratios to O(log n) and to 2 (up to an additive term of 2), respectively. As a consequence, we close, in an asymptotic sense, the gap on the approximability of MCBD, which was known to be nor approximable within c log n, for some constant c > 0, unless P = NP. Remarkably, as we further show in the paper, our approximation ratio remains asymptotically tight even if we allow for a solution whose diameter is optimal up to a multiplicative factor approaching 5/3. On the other hand, on the positive side, we show that at most twice of the minimal number of additional edges suffices to get at most twice of the required diameter. Some of our results extend to the edge-weighted version of the problems. (C) 2011 Elsevier B.V. All rights reserved.", "paper_title": "Improved approximability and non-approximability results for graph diameter decreasing problems", "paper_id": "WOS:000300650000003"}