{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "partial_occlusion"}, {"score": 0.022967152995647815, "phrase": "illumination_variation"}, {"score": 0.010372983229429906, "phrase": "limited_training_data"}, {"score": 0.010255293209378213, "phrase": "optimal_feature_selection"}, {"score": 0.007976051895833168, "phrase": "pum"}, {"score": 0.005131597536642362, "phrase": "new_methods"}, {"score": 0.004243862930012258, "phrase": "prior_information"}, {"score": 0.0037617986040878342, "phrase": "new_method"}, {"score": 0.003471135453226184, "phrase": "optimal_local_image_features"}, {"score": 0.003058944053868522, "phrase": "probability-based_formulation"}, {"score": 0.003006654007926993, "phrase": "similarity-based_formulation"}, {"score": 0.002680114113899346, "phrase": "new_formulation"}, {"score": 0.002530359917257626, "phrase": "combined_illumination_variation"}, {"score": 0.002444544487772349, "phrase": "novel_combination"}, {"score": 0.002416589459425828, "phrase": "multicondition_relighting"}, {"score": 0.0021049977753042253, "phrase": "improved_robustness"}], "paper_keywords": [""], "paper_abstract": "This study investigates face recognition with partial occlusion, illumination variation and their combination, assuming no prior information about the mismatch, and limited training data for each person. The authors extend their previous posterior union model (PUM) to give a new method capable of dealing with all these problems. PUM is an approach for selecting the optimal local image features for recognition to improve robustness to partial occlusion. The extension is in two stages. First, authors extend PUM from a probability-based formulation to a similarity-based formulation, so that it operates with as little as one single training sample to offer robustness to partial occlusion. Second, they extend this new formulation to make it robust to illumination variation, and to combined illumination variation and partial occlusion, by a novel combination of multicondition relighting and optimal feature selection. To evaluate the new methods, a number of databases with various simulated and realistic occlusion/illumination mismatches have been used. The results have demonstrated the improved robustness of the new methods.", "paper_title": "Robust face recognition with partial occlusion, illumination variation and limited training data by optimal feature selection", "paper_id": "WOS:000285920900003"}