{"auto_keywords": [{"score": 0.04647921782187239, "phrase": "pervasive_learning_environments"}, {"score": 0.007947010528338155, "phrase": "recommendation_mechanisms"}, {"score": 0.00481495049065317, "phrase": "pervasive_learning"}, {"score": 0.00461075951152053, "phrase": "massive_education_resources"}, {"score": 0.0045709675813472884, "phrase": "traditional_keyword_searching_method"}, {"score": 0.004531517501420676, "phrase": "context-aware_based_resource_recommendation_service"}, {"score": 0.004326771493322954, "phrase": "e-commerce_field"}, {"score": 0.004289419884432487, "phrase": "content-based_or_collaborative-based_filter_strategies"}, {"score": 0.004167218012926657, "phrase": "existing_recommendation_mechanisms"}, {"score": 0.0041312380622750555, "phrase": "dynamic_interests"}, {"score": 0.004048483412089098, "phrase": "access_pattern"}, {"score": 0.0037444643255115265, "phrase": "learners'_actual_preference"}, {"score": 0.0035855066449812273, "phrase": "context-aware_resource_recommendation_model"}, {"score": 0.0034134687245359376, "phrase": "relevant_contextual_information"}, {"score": 0.0033644530302903513, "phrase": "relevant_degree"}, {"score": 0.0031478633984287235, "phrase": "rrd."}, {"score": 0.003120657021758196, "phrase": "first_part"}, {"score": 0.0029794666460666646, "phrase": "individual_preference_tree"}, {"score": 0.002962274793606941, "phrase": "ipt"}, {"score": 0.002886110744751351, "phrase": "multi-dimensional_attributes"}, {"score": 0.002787591531872224, "phrase": "access_preference"}, {"score": 0.0027475383418803724, "phrase": "learners'_historical_sequential_patterns"}, {"score": 0.0026156018381676407, "phrase": "second_part"}, {"score": 0.002526293222350046, "phrase": "connecting_type_relevance"}, {"score": 0.0025117070259621376, "phrase": "time_satisfaction_degree"}, {"score": 0.0024400265512135397, "phrase": "candidate_resources"}, {"score": 0.0022499947003073654, "phrase": "traditional_and_newly_presented_metrics"}, {"score": 0.0021605907787994446, "phrase": "prototype_system"}, {"score": 0.0021049977753042253, "phrase": "relevant_recommendation_process"}], "paper_keywords": ["Pervasive learning", " Recommendation", " Dynamic preference weight", " Individual preference tree", " Logic-based RRD", " Situation-based RRD"], "paper_abstract": "As it is difficult for learners to discover and obtain the most appropriate resources from massive education resources according to traditional keyword searching method, the context-aware based resource recommendation service becomes a significant part of pervasive learning environments. At present, recommendation mechanisms are widely used in e-commerce field, where content-based or collaborative-based filter strategies are usually considered separately. However, in these existing recommendation mechanisms, the dynamic interests and preference of learners, the access pattern and the other attributes of pervasive learning environments (such as multi-modes connecting and resources distribution) are always neglected. Thus, these mechanisms can not effectively reflect learners' actual preference and can not adapt to pervasive learning environments perfectly. To address these problems, a context-aware resource recommendation model and relevant recommendation algorithm for pervasive learning environments are proposed. Therein, with taking into account the relevant contextual information, the calculation of relevant degree between learners and resources can be divided into two main parts: logic-based RRD (resource relevant degree) and situation-based RRD. In the first part, content-based and collaborative-based recommendation mechanisms are combined together, where the individual preference tree (IPT) is introduced to take into account the multi-dimensional attributes of resources, learners' rating matrix and the energy of access preference. Meanwhile, the learners' historical sequential patterns of resource accessing are also considered to further improve the accuracy of recommendation. In the second part, in order to enhance the validation of recommendation, the connecting type relevance and time satisfaction degree are calculated according to other relevant contexts. Then, the candidate resources can be filtered and sorted via combining these two parts to generate (Top-N) recommendation results. The simulations show that our newly proposed method outperforms other state of-the-art algorithms on traditional and newly presented metrics and it may also be more suitable for pervasive learning environments. Finally, a prototype system is implemented based on SEU-ESP to demonstrate the relevant recommendation process further.", "paper_title": "A context-aware personalized resource recommendation for pervasive learning", "paper_id": "WOS:000277283300009"}