{"auto_keywords": [{"score": 0.004640398886726948, "phrase": "mobile_service"}, {"score": 0.004513639677516171, "phrase": "helsinki"}, {"score": 0.004472146692254812, "phrase": "hong_kong"}, {"score": 0.004410629943506433, "phrase": "las_vegas"}, {"score": 0.004290112502811656, "phrase": "current_prioritization_techniques"}, {"score": 0.0041154571996523505, "phrase": "cultural_effects"}, {"score": 0.003839962121679795, "phrase": "users'_values"}, {"score": 0.0033274664434575136, "phrase": "value-based_approach"}, {"score": 0.002991823455621222, "phrase": "prioritization_techniques"}, {"score": 0.002936997013291548, "phrase": "multicultural_settings"}, {"score": 0.002883172383460653, "phrase": "information_systems"}, {"score": 0.0028303313661029597, "phrase": "development_projects"}, {"score": 0.00274017282519193, "phrase": "adolescent_users"}, {"score": 0.0026899455459275575, "phrase": "specific_organizations"}, {"score": 0.0025802660239538353, "phrase": "powerful_way"}, {"score": 0.0022563011263787847, "phrase": "proposed_value-based_requirements_prioritization_approach"}, {"score": 0.0021049977753042253, "phrase": "development_method"}], "paper_keywords": ["culture", " value typology", " requirements prioritization", " laddering interviews", " mobile service"], "paper_abstract": "This paper examines how culture affects requirements and their prioritization. We analyze the requirements of a mobile service, which were collected from Helsinki, Hong Kong, and Las Vegas. We argue that the current prioritization techniques for requirements do not sufficiently account for the cultural effects, nor does the literature offer information on ways of prioritizing such requirements according to users' values. We see this as problematic because the literature suggests that culture should be viewed as a set of values. Our findings support the argument that we should use a value-based approach in prioritizing requirements. Furthermore, by focusing on the links between needs and values, we should be able to develop prioritization techniques not only for multicultural settings but also for information systems (IS) development projects that involve subcultures, such as adolescent users or members of specific organizations. Our findings show that this can be a powerful way of understanding the differences between various subcultures of IS users. In addition, we demonstrate how the laddering interviewing technique can be used to support this work. The proposed value-based requirements prioritization approach is also ready for industry applications and it is agnostic to the underlying IS development method used by developers.", "paper_title": "The effect of culture on requirements: a value-based view of prioritization", "paper_id": "WOS:000354420800006"}