{"auto_keywords": [{"score": 0.04493195088559337, "phrase": "preference_function"}, {"score": 0.04235866539811938, "phrase": "new_agent"}, {"score": 0.03611281583635047, "phrase": "preference_functions"}, {"score": 0.00481495049065317, "phrase": "decision_strategies"}, {"score": 0.004769702911065878, "phrase": "mediated_multiagent_negotiations"}, {"score": 0.0038564191670589884, "phrase": "mediation_step"}, {"score": 0.0037486121194392564, "phrase": "individual_preferences"}, {"score": 0.003643807817480753, "phrase": "group-preference_function"}, {"score": 0.003378385493203297, "phrase": "former_agents"}, {"score": 0.003207173639414978, "phrase": "mediation_process"}, {"score": 0.0028093921138602606, "phrase": "biggest_group_support"}, {"score": 0.0026293540353514075, "phrase": "nonlinear_optimization_problem"}, {"score": 0.002426137929553722, "phrase": "extensive_simulations"}, {"score": 0.0021049977753042253, "phrase": "mediation_process_rewarding_openness"}], "paper_keywords": ["Group decision making", " mediation rule", " nonlinear optimization"], "paper_abstract": "We consider a problem of mediated group decision making where a number of agents provide a preference function over a set of alternatives. Then, using such information, a new agent provides its own preferences, and, after that, a mediation step is applied to aggregate the individual preferences in order to obtain a group-preference function. Finally, the most supported alternative is selected. Two key aspects are that the preference functions of the former agents may or may not have uncertainty, and that the mediation process rewards those agents that are open to other alternatives besides their most preferred ones. The question for the new agent is how to score its alternatives in such a way that its most preferred one gets the biggest group support. We propose to define such scoring or preference function as the solution of a nonlinear optimization problem. The model also takes into account that imprecision could exist in the preference functions. Through extensive simulations (varying the number of agents, alternatives, etc.), we conclude that the proposal is feasible and effective. Additionally, the usefulness of the mediation process rewarding openness is empirically confirmed.", "paper_title": "Decision Strategies in Mediated Multiagent Negotiations: An Optimization Approach", "paper_id": "WOS:000276683900017"}