{"auto_keywords": [{"score": 0.04987536501224343, "phrase": "relational_databases"}, {"score": 0.0041835168653521, "phrase": "legal_requirements"}, {"score": 0.004148014765950199, "phrase": "institutional_policies"}, {"score": 0.0036813725040313002, "phrase": "long_term"}, {"score": 0.003557924423642353, "phrase": "operating_system"}, {"score": 0.0033232673019931206, "phrase": "contextual_information"}, {"score": 0.002850168497994985, "phrase": "relational_database"}, {"score": 0.0028139168128067343, "phrase": "dimensional_model"}, {"score": 0.0026620655619396263, "phrase": "practical_transformation_rules"}, {"score": 0.0025947642929906407, "phrase": "multiple_case_studies"}, {"score": 0.002539978170928796, "phrase": "case_studies"}, {"score": 0.0024863459251358217, "phrase": "running_example"}, {"score": 0.002433843373780471, "phrase": "systematic_implementation"}, {"score": 0.0022828795331819025, "phrase": "unwanted_details"}, {"score": 0.0021688641066186817, "phrase": "open_format"}, {"score": 0.0021049977753042253, "phrase": "database_management_system"}], "paper_keywords": ["Database Preservation", " Transformation Rules"], "paper_abstract": "In many institutions relational databases are used as a tool for managing information related to day to day activities. Institutions may be required to keep the information stored in relational databases accessible because of many reasons including legal requirements and institutional policies. However, the evolution in technology and change in users with the passage of time put the information stored in relational databases in danger. In the long term the information may become inaccessible when the operating system, database management system or the application software is not available any more or the contextual information not stored in the database may be lost thus affecting the authenticity and understandability of the information. This paper presents an approach for preserving relational databases for the long-term. The proposal involves migrating a relational database to a dimensional model which is simple to understand and easy to write queries against. Practical transformation rules are developed by carrying out multiple case studies. One of the case studies is presented as a running example in the paper. Systematic implementation of the rules ensures no loss of information in the process except for the unwanted details. The database preserved using the approach is converted to an open format but may be reloaded to a database management system in the long-term.", "paper_title": "Database Preservation: The DBPreserve Approach", "paper_id": "WOS:000369852000036"}