{"auto_keywords": [{"score": 0.0488723232582957, "phrase": "ledbat"}, {"score": 0.011928641852583827, "phrase": "vegas"}, {"score": 0.00481495049065317, "phrase": "bittorrent_swarm_perspectives"}, {"score": 0.004543523306465106, "phrase": "additional_delay"}, {"score": 0.004418703015695758, "phrase": "user_traffic"}, {"score": 0.004208427318712072, "phrase": "available_link_capacity"}, {"score": 0.00415019999222481, "phrase": "good_bittorrent_performance"}, {"score": 0.0038798827077529715, "phrase": "classic_congestion_control_studies"}, {"score": 0.00379961236486522, "phrase": "peer-to-peer_users_quality_of_experience"}, {"score": 0.003712362078915926, "phrase": "congestion_control_literature"}, {"score": 0.003601914263864262, "phrase": "nice_sharing_similarities"}, {"score": 0.00332828739329299, "phrase": "deep_understanding"}, {"score": 0.0033051623473192814, "phrase": "novel_protocol"}, {"score": 0.0031550351923674337, "phrase": "lowest_priority"}, {"score": 0.003046918298232183, "phrase": "queuing_delay"}, {"score": 0.0030257422786589723, "phrase": "bottleneck_link"}, {"score": 0.003004712988422899, "phrase": "maximum_target_value"}, {"score": 0.0028615323526689582, "phrase": "higher_target"}, {"score": 0.0028350413546400703, "phrase": "unfair_advantage"}, {"score": 0.0027188259793109264, "phrase": "smaller_targets"}, {"score": 0.0026749251174479805, "phrase": "bittorrent_users"}, {"score": 0.002613433209477611, "phrase": "larger_delay_targets"}, {"score": 0.0025952620596908773, "phrase": "bittorrent_signaling_task"}, {"score": 0.0025772169270836015, "phrase": "possibly_negative_effect"}, {"score": 0.0025592969422491476, "phrase": "swarming_protocol_efficiency"}, {"score": 0.002488851299416018, "phrase": "heterogeneous_swarms"}, {"score": 0.0024715442187037582, "phrase": "delay-based_protocol"}, {"score": 0.002381247276014029, "phrase": "competitive_qoe_advantage"}, {"score": 0.0023701940745188017, "phrase": "loss-based_tcp."}, {"score": 0.002278284823857861, "phrase": "safe_ledbat_operational_point"}, {"score": 0.0021296312949018736, "phrase": "nice."}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Bit Torrent", " Congestion control", " Lower-than best effort congestion control", " LEDBAT", " TCP-LP", " NICE"], "paper_abstract": "BitTorrent, one of the most widespread file-sharing P2P applications, recently introduced LEDBAT, a novel congestion control protocol aiming at (i) limiting the additional delay due to queuing, to reduce interference with the rest of user traffic (e.g., Web, VoIP and gaming) sharing the same access bottleneck, and (ii) efficiently using the available link capacity, to provide users with good BitTorrent performance at the same time. In this work, we adopt two complementary perspectives: namely, a flow viewpoint to assess the Quality of Service (QoS) as in classic congestion control studies, and a BitTorrent swarm viewpoint to assess peer-to-peer users Quality of Experience (QoE). We additionally point out that congestion control literature is rich of protocols, such as VEGAS, LP, and NICE sharing similarities with LEDBAT, that is therefore mandatory to consider in the analysis. Hence, adopting the above viewpoints we both (i) contrast LEDBAT to the other protocols and (ii) provide deep understanding of the novel protocol and its implication on QoS and QoE. Our simulation based investigation yields several insights. At flow-level, we gather LEDBAT to be lowest priority among all protocols, which follows from its design that strives to explicitly bound the queuing delay at the bottleneck link to a maximum target value. At the same time, we see that this very same protocol parameter can be exploited by adversaries, that can set a higher target to gain an unfair advantage over competitors. Interestingly, swarm-level performance exhibit an opposite trade-off, with smaller targets being more advantageous for QoE of BitTorrent users. This can be explained with the fact that larger delay targets slow down BitTorrent signaling task, with possibly negative effect on the swarming protocol efficiency. Additionally, we see that for the above reason, in heterogeneous swarms, any delay-based protocol (i.e., not only LEDBAT but also VEGAS or NICE) can yield a competitive QoE advantage over loss-based TCP. Overall this tension between swarm and flow-levels suggests that, at least in current ADSL/cable access bottleneck scenarios, a safe LEDBAT operational point may be used in practice. At the same time, our results also point out that benefits similar to LEDBAT can also be gathered with other delay-based protocols such as VEGAS or NICE. (C) 2013 Elsevier B.V. All rights reserved.", "paper_title": "Delay-based congestion control: Flow vs. BitTorrent swarm perspectives", "paper_id": "WOS:000332430700009"}