{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "costas_arrays"}, {"score": 0.02269772653706183, "phrase": "permutation_array"}, {"score": 0.01773494097138835, "phrase": "permutation_arrays"}, {"score": 0.009817238612660316, "phrase": "toroidal_vectors"}, {"score": 0.007074012775973013, "phrase": "minimum_value"}, {"score": 0.0066193891025618, "phrase": "welch_costas_arrays"}, {"score": 0.006242423315824284, "phrase": "golomb-rickard_costas_arrays"}, {"score": 0.0047587234712024775, "phrase": "costas_array"}, {"score": 0.003703380599999214, "phrase": "smallest_deficiency"}, {"score": 0.0025917743904900576, "phrase": "computational_experiments"}, {"score": 0.002551409948440577, "phrase": "deficiency_distribution"}, {"score": 0.0022414566728770767, "phrase": "exceptionally_small_deficiency"}, {"score": 0.0021049977753042253, "phrase": "new_algebraic_construction"}], "paper_keywords": ["Costas array", " deficiency", " permutation", " sonar", " radar"], "paper_abstract": "A Costas array is a permutation array in which the vectors joining pairs of 1s are all distinct. The toroidal vectors of a permutation array are the vectors occurring when the array is written on a torus, and the deficiency of a permutation array of order n is the number of toroidal vectors, out of the (n - 1)(2) possible, which are missing from the array. The smallest deficiency among all permutation arrays of order q - 1, where q is a power of a prime other than 3, is known, and it is of interest to find examples of permutation arrays attaining this minimum value. The deficiency of Costas arrays is studied computationally and theoretically. It is shown that all Welch Costas arrays of a given order have the same deficiency. It is shown that the deficiency of Golomb-Rickard Costas arrays of order q - 1 attains the minimum value over all permutation arrays when q is a power of a prime other than 3. Computational experiments show that the deficiency distribution of Costas arrays of a given order acts as a filter that highlights the Welch Costas arrays, isolates the Golomb-Rickard Costas arrays, and gives further insights into the structure of other Costas arrays. In particular, four Costas arrays with exceptionally small deficiency are recognised, and it is asked if they could be used to identify a new algebraic construction for Costas arrays.", "paper_title": "The Deficiency of Costas Arrays", "paper_id": "WOS:000345511400035"}