{"auto_keywords": [{"score": 0.03227078104988101, "phrase": "general_automated_negotiators"}, {"score": 0.00481495049065317, "phrase": "generic_automated_negotiators."}, {"score": 0.004724365740062236, "phrase": "automated_negotiators"}, {"score": 0.00459165923324494, "phrase": "abundant_research"}, {"score": 0.004337276328199398, "phrase": "generalized_agents"}, {"score": 0.004175533280178052, "phrase": "human_counterparts"}, {"score": 0.0035525230119401153, "phrase": "negotiators'_diverse_preferences"}, {"score": 0.0030802351224657673, "phrase": "design_process"}, {"score": 0.003022211137777282, "phrase": "genius"}, {"score": 0.002909342017421165, "phrase": "intelligent_multi-purpose_usage_simulation"}, {"score": 0.0028140548269469934, "phrase": "new_domains"}, {"score": 0.002708960273193547, "phrase": "automated_negotiations"}, {"score": 0.002683304054823427, "phrase": "generic_automated_negotiators"}, {"score": 0.0025343769150179764, "phrase": "specific_domain"}, {"score": 0.0024513404432665153, "phrase": "automated_agents"}, {"score": 0.002416589459425828, "phrase": "human_subjects"}, {"score": 0.0023485549678832628, "phrase": "quantitative_and_qualitative_results"}, {"score": 0.0022287497627555895, "phrase": "recent_automated_bilateral_negotiators_competition"}, {"score": 0.0021049977753042253, "phrase": "underlying_benefits"}], "paper_keywords": ["agents competition", " automated negotiation", " human", " computer interaction", " bilateral negotiation"], "paper_abstract": "The design of automated negotiators has been the focus of abundant research in recent years. However, due to difficulties involved in creating generalized agents that can negotiate in several domains and against human counterparts, many automated negotiators are domain specific and their behavior cannot be generalized for other domains. Some of these difficulties arise from the differences inherent within the domains, the need to understand and learn negotiators' diverse preferences concerning issues of the domain, and the different strategies negotiators can undertake. In this paper we present a system that enables alleviation of the difficulties in the design process of general automated negotiators termed Genius, a General Environment for Negotiation with Intelligent multi-purpose Usage Simulation. With the constant introduction of new domains, e-commerce and other applications, which require automated negotiations, generic automated negotiators encompass many benefits and advantages over agents that are designed for a specific domain. Based on experiments conducted with automated agents designed by human subjects using Genius we provide both quantitative and qualitative results to illustrate its efficacy. Finally, we also analyze a recent automated bilateral negotiators competition that was based on Genius. Our results show the advantages and underlying benefits of using Genius and how it can facilitate the design of general automated negotiators.", "paper_title": "GENIUS: AN INTEGRATED ENVIRONMENT FOR SUPPORTING THE DESIGN OF GENERIC AUTOMATED NEGOTIATORS", "paper_id": "WOS:000331244400003"}