{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "supply_chain_network"}, {"score": 0.004456872931482395, "phrase": "new_model"}, {"score": 0.004326321719714357, "phrase": "integrated_problem"}, {"score": 0.004100851549096203, "phrase": "demand_uncertainty"}, {"score": 0.0034304883989739804, "phrase": "final_products"}, {"score": 0.0029561107046138136, "phrase": "assembly_lines"}, {"score": 0.0027358910467781155, "phrase": "mixed_integer_nonlinear_programming_formulation"}, {"score": 0.002428617044669043, "phrase": "outer_approximation"}, {"score": 0.0022476051902301187, "phrase": "computational_results"}, {"score": 0.002181626277903721, "phrase": "proposed_oa_method"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Supply chain network designing", " Assembly line balancing", " Outer approximation", " Two stage stochastic programming"], "paper_abstract": "In this paper a new model is proposed for the integrated problem of supply chain network designing and assembly line balancing under demand uncertainty. In this problem there are three types of entities: manufacturers, assemblers and customers. Manufacturers provide assemblers with components and assemblers use these components to produce the final products and satisfy the demand of the customers. This problem involves determining the location of manufacturers and assemblers in the network, balancing the assembly lines, and transportation of materials and products throughout the network. A mixed integer nonlinear programming formulation based on two stage stochastic programming method is developed to solve this problem to optimality. Moreover, an outer approximation (OA) method is proposed to efficiently solve this problem. The computational results show efficiency of the proposed OA method. (c) 2015 Elsevier Ltd. All rights reserved.", "paper_title": "An outer approximation method for an integration of supply chain network designing and assembly line balancing under uncertainty", "paper_id": "WOS:000353746800025"}