{"auto_keywords": [{"score": 0.04894852287716921, "phrase": "oral_information"}, {"score": 0.011951811495067006, "phrase": "dysfunctional_allocation"}, {"score": 0.008282280365030925, "phrase": "cognitive_overload"}, {"score": 0.007923918373863758, "phrase": "concise_slides"}, {"score": 0.00481495049065317, "phrase": "speech_suppressors"}, {"score": 0.0038431888954930083, "phrase": "redundancy_effect"}, {"score": 0.003803991592917943, "phrase": "excessive_cognitive_load"}, {"score": 0.0037651925588909783, "phrase": "simultaneous_presentation"}, {"score": 0.0037395458116642306, "phrase": "oral_and_written_information"}, {"score": 0.0034924598001567944, "phrase": "high_subjective_importance"}, {"score": 0.0034332736827447654, "phrase": "hypothesized_effect"}, {"score": 0.0033982429092938764, "phrase": "potential_explanations"}, {"score": 0.0033406481167452436, "phrase": "experimental_study"}, {"score": 0.003284026247389735, "phrase": "literature_search"}, {"score": 0.0031198362555601377, "phrase": "regular_or_concise_powerpoint_slides"}, {"score": 0.0028446460307503343, "phrase": "cognitive_load"}, {"score": 0.002825251837733693, "phrase": "subjective_importance"}, {"score": 0.002720916895509682, "phrase": "\"speech_suppression_effect"}, {"score": 0.002693134880651768, "phrase": "regular_slides"}, {"score": 0.002364777610365689, "phrase": "theoretical_approaches"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Improving classroom teaching", " Media in education", " Post-secondary education", " Teaching/learning strategies"], "paper_abstract": "The objective of this study was to test whether information presented on slides during presentations is retained at the expense of information presented only orally, and to investigate part of the conditions under which this effect occurs, and how it can be avoided. Such an effect could be expected and explained either as a kind of redundancy effect due to excessive cognitive load caused by simultaneous presentation of oral and written information, or as a consequence of dysfunctional allocation of attention at the expense of oral information occurring in learners with a high subjective importance of slides. The hypothesized effect and these potential explanations were tested in an experimental study. In courses about literature search and access, 209 university students received a presentation accompanied either by no slides or by regular or concise PowerPoint slides. The retention of information presented orally and of information presented orally and on slides was measured separately in each condition and standardized for comparability. Cognitive load and subjective importance of slides were also measured. The results indicate a \"speech suppression effect\" of regular slides at the expense of oral information (within and across conditions), which cannot be explained by cognitive overload but rather by dysfunctional allocation of attention, and can be avoided by concise slides. It is concluded that theoretical approaches should account for the allocation of attention below the threshold of cognitive overload and its role for learning, and that a culture of presentations with concise slides should be established. (C) 2012 Elsevier Ltd. All rights reserved.", "paper_title": "Slide presentations as speech suppressors: When and why learners miss oral information", "paper_id": "WOS:000305036400010"}