{"auto_keywords": [{"score": 0.015719716506582538, "phrase": "novel_mac_layer_handoff_protocol"}, {"score": 0.010246026778676177, "phrase": "real-time_applications"}, {"score": 0.008529762692524229, "phrase": "access_points"}, {"score": 0.004356741449157895, "phrase": "wireless_communications_industry"}, {"score": 0.0037005154613244363, "phrase": "wireless_terminal"}, {"score": 0.003492155652400838, "phrase": "access_point"}, {"score": 0.0034193226278107346, "phrase": "active_connection"}, {"score": 0.0032954888655173666, "phrase": "mac_layer_handoff_process"}, {"score": 0.0032610577483336055, "phrase": "mac"}, {"score": 0.003226744277130179, "phrase": "handoff_latency"}, {"score": 0.003061072337623773, "phrase": "mobile_devices"}, {"score": 0.002813457986293993, "phrase": "advertisement_messages"}, {"score": 0.002711506442590442, "phrase": "wireless_terminals"}, {"score": 0.0025318431634446426, "phrase": "mobile_node"}, {"score": 0.0023516185395256505, "phrase": "probe_process"}, {"score": 0.0023146962503449186, "phrase": "experimental_results"}, {"score": 0.002242577809454225, "phrase": "mac_layer_handoff_latency"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Handoff", " IEEE 802.11", " MAC layer"], "paper_abstract": "In recent years, the IEEE 802.11 wireless network family has become one of the most important set of standards in the wireless communications industry. IEEE 802.11 compliant devices are inexpensive and easier to configure and deploy than other wireless technologies. In an IEEE 802.11 wireless network, wireless terminals can move freely. As a result, when the wireless terminal moves away from its current access point, it must switch to another access point to maintain the active connection. This is known as the MAC layer handoff process. MAC layer handoff latency should be minimized to support real-time applications and to provide mobile devices with seamless roaming in IEEE 802.11 wireless networks. This paper proposes a novel MAC layer handoff protocol over IEEE 802.11 wireless networks by introducing advertisement messages sent from other mobile nodes and from which wireless terminals are able to receive the information of access points in their neighborhood. A mobile node can try to associate with access points based on the prediction before starting the probe process. The experimental results demonstrate that our solution can reduce MAC layer handoff latency to meet the requirements of real-time applications. (C) 2010 Elsevier Inc. All rights reserved.", "paper_title": "Design and evaluation of a novel MAC layer handoff protocol for IEEE 802.11 wireless networks", "paper_id": "WOS:000279365400009"}