{"auto_keywords": [{"score": 0.0341532596630476, "phrase": "soft-state_approaches"}, {"score": 0.03131352182619875, "phrase": "state_inconsistency"}, {"score": 0.025400041920749714, "phrase": "soft-state_approach"}, {"score": 0.00481495049065317, "phrase": "hard-state_and_soft-state_signaling_protocols"}, {"score": 0.0046046429665581555, "phrase": "telecommunication_networks"}, {"score": 0.004502943680955863, "phrase": "telephone_network"}, {"score": 0.004462892860919036, "phrase": "vc-oriented_data_networks"}, {"score": 0.004173603566828364, "phrase": "so-called_hard-state_and_soft-state_approaches"}, {"score": 0.0032638170723261538, "phrase": "\"pure\"_soft_state"}, {"score": 0.003191636645925296, "phrase": "explicit_state_removal"}, {"score": 0.0031632120077478066, "phrase": "reliable_signaling"}, {"score": 0.003107117564014497, "phrase": "\"pure\"_hard_state_approach"}, {"score": 0.00303839203670705, "phrase": "analytic_model"}, {"score": 0.002931569771634119, "phrase": "single-_and_multiple-hop_signaling_scenarios"}, {"score": 0.002741269087816162, "phrase": "application-specific_costs"}, {"score": 0.002354302193867031, "phrase": "explicit_removal"}, {"score": 0.002291905937251069, "phrase": "state_consistency"}, {"score": 0.0021049977753042253, "phrase": "hard-state_approach"}], "paper_keywords": ["communication system signaling", " hard-state", " performance evaluation", " soft-state"], "paper_abstract": "One of the key infrastructure components in all telecommunication networks, ranging from the telephone network to VC-oriented data networks to the Internet, is its signaling system. Two broad approaches towards signaling can be identified: so-called hard-state and soft-state approaches. Despite the fundamental importance of signaling, our understanding of these approaches-their pros and cons and the circumstances in which they might best be employed-is mostly anecdotal (and, occasionally, religious). In this paper, we compare and contrast a variety of signaling approaches ranging from \"pure\" soft state to soft-state approaches augmented with explicit state removal and/or reliable signaling, to a \"pure\" hard state approach. We develop an analytic model that allows us to quantify state inconsistency in single- and multiple-hop signaling scenarios, and the \"cost\" (both in terms of signaling overhead and application-specific costs resulting from state inconsistency) associated with a given signaling approach and its parameters (e.g., state refresh and removal timers). Among the class of soft-state approaches, we find that a soft-state approach coupled with explicit removal substantially improves the degree of state consistency while introducing little additional signaling message overhead. The addition of reliable explicit setup/update/removal allows the soft-state approach to achieve comparable (and sometimes better) consistency than that of the hard-state approach.", "paper_title": "A comparison of hard-state and soft-state signaling protocols", "paper_id": "WOS:000245863600003"}