{"auto_keywords": [{"score": 0.0344505369016581, "phrase": "ls"}, {"score": 0.006614121470210838, "phrase": "np-hard"}, {"score": 0.00481495049065317, "phrase": "network_flow_problem"}, {"score": 0.004772137871562584, "phrase": "concave_cost_functions"}, {"score": 0.004543352284098364, "phrase": "hybrid_heuristic"}, {"score": 0.004306205029641728, "phrase": "ant_colony"}, {"score": 0.003732368382223596, "phrase": "aco_algorithm"}, {"score": 0.003601235776892337, "phrase": "local_search"}, {"score": 0.0034902664176377943, "phrase": "core_aco_procedure"}, {"score": 0.0033227310662785293, "phrase": "search_space"}, {"score": 0.0031071175640144943, "phrase": "best_solutions"}, {"score": 0.0028795712616923462, "phrase": "small_and_large_size_problem_instances"}, {"score": 0.0024953686545818587, "phrase": "solution_quality"}, {"score": 0.0024401411219526774, "phrase": "haco_algorithm"}, {"score": 0.002241171326888997, "phrase": "improved_solutions"}, {"score": 0.0021334650920198715, "phrase": "computational_requirements"}, {"score": 0.0021049977753042253, "phrase": "problem_size"}], "paper_keywords": ["Ant colony optimization", " Concave costs", " Hybrid", " Local search", " Network flow"], "paper_abstract": "In this work we address the Single-Source Uncapacitated Minimum Cost Network Flow Problem with concave cost functions. This problem is NP-Hard, therefore we propose a hybrid heuristic to solve it. Our goal is not only to apply an ant colony optimization (ACO) algorithm to such a problem, but also to provide an insight on the behaviour of the parameters in the performance of the algorithm. The performance of the ACO algorithm is improved with the hybridization of a local search (LS) procedure. The core ACO procedure is used to mainly deal with the exploration of the search space, while the LS is incorporated to further cope with the exploitation of the best solutions found. The method we have developed has proven to be very efficient while solving both small and large size problem instances. The problems we have used to test the algorithm were previously solved by other authors using other population based heuristics. Our algorithm was able to improve upon some of their results in terms of solution quality, proving that the HACO algorithm is a very good alternative approach to solve these problems. In addition, our algorithm is substantially faster at achieving these improved solutions. Furthermore, the magnitude of the reduction of the computational requirements grows with problem size.", "paper_title": "Concave minimum cost network flow problems solved with a colony of ants", "paper_id": "WOS:000315623600001"}