{"auto_keywords": [{"score": 0.04899883615751873, "phrase": "hough"}, {"score": 0.009958938450285336, "phrase": "heavy_computations"}, {"score": 0.007898283598764204, "phrase": "gfht"}, {"score": 0.006765596059848259, "phrase": "spurious_voting"}, {"score": 0.006434880988484553, "phrase": "redundant_mapping"}, {"score": 0.00481495049065317, "phrase": "arbitrary_shape_detection."}, {"score": 0.004771196027464407, "phrase": "well-known_arbitrary_shape_detection_technology"}, {"score": 0.003974673997871831, "phrase": "ght"}, {"score": 0.0038849148160362257, "phrase": "fght"}, {"score": 0.003711509635752897, "phrase": "adaptive"}, {"score": 0.0031917943932454314, "phrase": "accumulator_array"}, {"score": 0.0027954035431845344, "phrase": "fast_randomized_generalized_hough_transform"}, {"score": 0.002682669289913153, "phrase": "randomized_waypoint_strategy"}, {"score": 0.0022238315004700607, "phrase": "experimental_results"}, {"score": 0.002203570941628287, "phrase": "frght"}, {"score": 0.0021834945657804193, "phrase": "better_performance"}, {"score": 0.0021049977753042253, "phrase": "voting_efficiency"}], "paper_keywords": ["Generalized Hough transform", " Random waypoint strategy", " Arbitrary shape detection"], "paper_abstract": "The well-known arbitrary shape detection technology, generalized Hough transform (GHT) has the drawbacks of heavy computations (one-to-many or 1-to-n mapping) and storage requirements (voting space end entry number). Some n-to-1 mapping approaches have been proposed for improving the performance of GHT, such as the FGHT (fast generalized Hough transform), ADPHT (Adaptive dual-point Hough transform) and GFHT (generalized fuzzy Hough transform). The n-to-1 mapping approaches use n feature points as one set to produce one increment of the vote in the accumulator array. Although the n-to-1 mapping approaches can efficiently reduce the spurious voting, the improvement for the heavy computations is limited due to redundant mapping. In this study, we propose the fast randomized generalized Hough transform (FRG HT), which uses a randomized waypoint strategy to choose feature line segments randomly and consecutively. With this strategy, not only the required entry number of the table to avoid redundant mapping can be reduced dramatically, but also the relationship between sets can be found to reduce the spurious voting. The experimental results of FRGHT show better performance than the previous modified GHT's (FGHT and GFHT) in voting efficiency, less computation costs and storage requirements (entry number).", "paper_title": "A FAST RANDOMIZED GENERALIZED HOUGH TRANSFORM FOR ARBITRARY SHAPE DETECTION", "paper_id": "WOS:000301026100006"}