{"auto_keywords": [{"score": 0.04063631856968557, "phrase": "design_heuristics"}, {"score": 0.00481495049065317, "phrase": "idea_generation"}, {"score": 0.004651346011959237, "phrase": "cognitive_strategies"}, {"score": 0.004385819169212677, "phrase": "best_solution"}, {"score": 0.004295752645085445, "phrase": "potential_solutions"}, {"score": 0.004236733825313407, "phrase": "simple_cognitive_\"shortcut"}, {"score": 0.0041211075804202905, "phrase": "specific_design_heuristics"}, {"score": 0.004064478393319772, "phrase": "problem_space"}, {"score": 0.004036455094603843, "phrase": "potential_designs"}, {"score": 0.003939880387831148, "phrase": "creative_solutions"}, {"score": 0.0037019839121200508, "phrase": "design_process"}, {"score": 0.0036764506727132253, "phrase": "multiple_levels"}, {"score": 0.0036008989464331835, "phrase": "present_empirical_study"}, {"score": 0.0035147084172295123, "phrase": "six_instructional_heuristics"}, {"score": 0.0034544053534458093, "phrase": "product_concepts"}, {"score": 0.003418719577853084, "phrase": "novice_designers"}, {"score": 0.0033951334049808733, "phrase": "six_hundred_seventy-three_drawings"}, {"score": 0.0030708096989903945, "phrase": "experimental_conditions"}, {"score": 0.002895246938820814, "phrase": "new_problem_space"}, {"score": 0.002701474449898187, "phrase": "simple_demonstration"}, {"score": 0.0025914765323897604, "phrase": "divergent_thinking"}, {"score": 0.0021417950504965997, "phrase": "formal_education"}, {"score": 0.002119640369431708, "phrase": "personal_development"}, {"score": 0.0021049977753042253, "phrase": "design_learning"}], "paper_keywords": ["Cognitive Processes", " Creativity", " Design Heuristics", " Design Pedagogy", " Empirical Studies"], "paper_abstract": "This paper explores the use of heuristics as cognitive strategies invoked during the process of design. Heuristics are reasoning processes that do not guarantee the best solution, but often lead to potential solutions by providing a simple cognitive \"shortcut.\" We propose that designers use specific design heuristics to explore the problem space of potential designs, leading to the generation of creative solutions. We test whether design heuristics can be taught to novices, and suggest their use will facilitate the design process at multiple levels of instruction. In the present empirical study, we evaluate a set of six instructional heuristics and validate their effectiveness with product concepts generated by novice designers. Six hundred seventy-three drawings were created by 120 first-year college students under four instructional conditions. Drawings were coded according to their content, use of heuristics, creativity, and practicality. The most creative concepts emerged from the experimental conditions where heuristics were introduced. Heuristics appeared to help the participants \"jump\" to a new problem space, resulting in more varied designs, and a greater frequency of designs judged as more creative. Our findings suggest that simple demonstration of design heuristics may, at times, be sufficient to stimulate divergent thinking, perhaps because these heuristics are readily grasped and contextual application is not required. Based on these findings, a conceptual model for design education emphasizing the importance of using a variety of heuristics is proposed. This model suggests that learning can be enhanced through exposure to a variety of design heuristics, and can supplement formal education and foster personal development in design learning.", "paper_title": "Cognitive heuristics in design: Instructional strategies to increase creativity in idea generation", "paper_id": "WOS:000280031000006"}