{"auto_keywords": [{"score": 0.0450172065504679, "phrase": "information_security_management"}, {"score": 0.044513698991525526, "phrase": "cloud_computing"}, {"score": 0.00481495049065317, "phrase": "information_security_management_issues"}, {"score": 0.004461761855323898, "phrase": "key_success_factors"}, {"score": 0.004183137595671171, "phrase": "contemporary_literature_reviews"}, {"score": 0.0032697235411641695, "phrase": "fuzzy_analytic_hierarchy_process"}, {"score": 0.0029766550209309127, "phrase": "six_major_kfss"}, {"score": 0.0026624684547385718, "phrase": "previous_perceptions"}, {"score": 0.002326068563512387, "phrase": "service_model"}, {"score": 0.002258745901862197, "phrase": "customer_criteria"}, {"score": 0.0021049977753042253, "phrase": "internet_age"}], "paper_keywords": ["Cloud computing", " fuzzy analytic hierarchy process (Fuzzy AHP)", " information security", " key success factors (KSFs)"], "paper_abstract": "The purpose of this study was to collect key success factors (KSFs) that determine information security management in cloud computing. Through contemporary literature reviews, we emphasized four major aspects: the external dimension, the internal dimension, the technology dimension, and the execution dimension. We used these dimensions to develop a questionnaire for collecting the responses from experts, and then used the fuzzy analytic hierarchy process (Fuzzy AHP) to categorize and analyze these responses. The investigations concluded the six major KFSs: authentication, disclosure prevention, encryption, service model, interface, and customer. Different from previous perceptions, information security management in cloud computing emphasizes factors that are more market-oriented. In addition, we explored several important KSFs, such as service model, interface, and customer criteria. These KSFs differed from the factors commonly regarded in the internet age.", "paper_title": "Fuzzy Modeling for Information Security Management Issues in Cloud Computing", "paper_id": "WOS:000347511300009"}