{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "lexical_patterns"}, {"score": 0.006858846609589755, "phrase": "starting_point"}, {"score": 0.0047306971679760175, "phrase": "biomedical_ontologies"}, {"score": 0.004408106853358092, "phrase": "managing_interoperability"}, {"score": 0.004346266306175988, "phrase": "health_systems"}, {"score": 0.004255121395629569, "phrase": "previous_work"}, {"score": 0.004035500442527029, "phrase": "initial_step"}, {"score": 0.003978866233891427, "phrase": "automatic_ontology_enrichment_methods"}, {"score": 0.00385431710959668, "phrase": "enrichment_methods"}, {"score": 0.003629557750546267, "phrase": "ontology_enrichment"}, {"score": 0.003322540556404882, "phrase": "complex_ontologies"}, {"score": 0.003229870860371533, "phrase": "lexical_pattern"}, {"score": 0.0027741761880779535, "phrase": "gene_ontology"}, {"score": 0.0027546167254869493, "phrase": "snomed_ct."}, {"score": 0.0023325586335885104, "phrase": "analysed_ontologies"}], "paper_keywords": ["Biological ontologies", " ontology enrichment", " quality assurance", " lexical patterns"], "paper_abstract": "Introduction: This article is part of the Focus Theme of Methods of Information in Medicine on \"Managing Interoperability and Complexity in Health Systems\". Objectives: In previous work, we have defined methods for the extraction of lexical patterns from labels as an initial step towards semi-automatic ontology enrichment methods. Our previous findings revealed that many biomedical ontologies could benefit from enrichment methods using lexical patterns as a starting point. Here, we aim to identify which lexical patterns are appropriate for ontology enrichment, driving its analysis by metrics to prioritised the patterns. Methods: We propose metrics for suggesting which lexical regularities should be the starting point to enrich complex ontologies. Our method determines the relevance of a lexical pattern by measuring its locality in the ontology, that is, the distance between the classes associated with the pattern, and the distribution of the pattern in a certain module of the ontology. The methods have been applied to four significant biomedical ontologies including the Gene Ontology and SNOMED CT. Results: The metrics provide information about the engineering of the ontologies and the relevance of the patterns. Our method enables the suggestion of links between classes that are not made explicit in the ontology. We propose a prioritisation of the lexical patterns found in the analysed ontologies. Conclusions: The locality and distribution of lexical patterns offer insights into the further engineering of the ontology. Developers can use this information to improve the axiomatisation of their ontologies.", "paper_title": "Prioritising Lexical Patterns to Increase Axiomatisation in Biomedical Ontologies The Role of Localisation and Modularity", "paper_id": "WOS:000347868300009"}