{"auto_keywords": [{"score": 0.04851462386946882, "phrase": "catalytic_p_systems"}, {"score": 0.04775015696831476, "phrase": "purely_catalytic_p_systems"}, {"score": 0.022945061652570212, "phrase": "computational_completeness"}, {"score": 0.020551193620720026, "phrase": "p_systems"}, {"score": 0.020383928283400403, "phrase": "p_automata"}, {"score": 0.019171240208904882, "phrase": "natural_numbers"}, {"score": 0.00481495049065317, "phrase": "control_mechanisms"}, {"score": 0.004394592555435104, "phrase": "generative_case"}, {"score": 0.004322186889256224, "phrase": "open_problems"}, {"score": 0.0033266163944946185, "phrase": "skin_membrane"}, {"score": 0.003285380677401785, "phrase": "specific_variants"}, {"score": 0.0032581736321024373, "phrase": "additional_control_mechanisms"}, {"score": 0.0031647054743284947, "phrase": "label_selection"}, {"score": 0.0030357976028714557, "phrase": "finite_number"}, {"score": 0.002948689937518561, "phrase": "computation_step"}, {"score": 0.002900037689072025, "phrase": "-varying_p_systems"}, {"score": 0.00284034646798833, "phrase": "available_sets"}, {"score": 0.0026796495639791426, "phrase": "partial_recursive_relations"}, {"score": 0.0022782315534795516, "phrase": "partial_relations"}], "paper_keywords": [""], "paper_abstract": "The questions whether catalytic P systems with only one catalyst and purely catalytic P systems with only two catalysts can already be computationally complete in the generative case, still are open problems. For accepting P systems or P automata, the situation is even more complicated when we consider sets of vectors of natural numbers and not only sets of natural numbers - the number of catalysts increases with the dimension of the vectors. We here establish computational completeness for catalytic P systems and P automata with only one catalyst as well as for purely catalytic P systems and P automata with only two catalysts in the skin membrane by using specific variants of additional control mechanisms: in P systems and P automata with label selection, we only use rules from one set of a finite number of sets of rules in each computation step; in time-varying P systems and P automata the available sets of rules change periodically with time. The same control mechanisms also allow for computing partial recursive relations or functions of (vectors of) natural numbers when being used in catalytic P systems with one catalyst and purely catalytic P systems with two catalysts. Finally, these variants of P systems can also be used to generate or accept strings and to compute partial relations or functions on strings, and again we obtain computational completeness with only one catalyst in the case of catalytic P systems and two catalysts in the case of purely catalytic P systems.", "paper_title": "Catalytic and Purely Catalytic P Systems and P Automata: Control Mechanisms for Obtaining Computational Completeness", "paper_id": "WOS:000349461500003"}