{"auto_keywords": [{"score": 0.04601284855430019, "phrase": "ecological_interface_design"}, {"score": 0.042664382141952804, "phrase": "design_framework"}, {"score": 0.004278807087784626, "phrase": "wide_variety"}, {"score": 0.004236908273106904, "phrase": "man-machine_systems"}, {"score": 0.003993958025223994, "phrase": "gibsonian_ecological_psychology"}, {"score": 0.003858697684681798, "phrase": "jens_rasmussen's_skills"}, {"score": 0.003584025547693836, "phrase": "comprehensive_review"}, {"score": 0.003531474887552889, "phrase": "framework's_applications"}, {"score": 0.002899965889623787, "phrase": "cognitive_work_analysis"}, {"score": 0.0024891269874339553, "phrase": "srk_taxonomy"}, {"score": 0.0023346234464901978, "phrase": "reviewed_applications"}, {"score": 0.002157538586313944, "phrase": "method's_flexibility"}], "paper_keywords": ["Cognitive work analysis (CWA)", " ecological interface design (EID)", " human-computer interaction", " human-machine systems"], "paper_abstract": "Since first receiving attention in the literature almost 25 years ago, ecological interface design has been applied to a wide variety of man-machine systems across a range of domains. The design framework has its theoretical basis in Gibsonian ecological psychology, and its founding principles draw heavily on Jens Rasmussen's skills, rules, and knowledge (SRK) taxonomy. This paper presents a comprehensive review of the framework's applications since Vicente and Rasmussen's 1992 seminal article detailing the theoretical foundations of the method. There is variation in terms of both the use of the two fundamental components of the method as it was first described, and how it has been supplemented with other phases of the cognitive work analysis; this review highlights these variations with regard to how the design framework has been applied and how these applications have been reported in the literature. The importance of the SRK taxonomy to the framework is specifically discussed following the finding that 40% of reviewed applications do not cite this component despite its centrality to ecological interface design. Attention is drawn to the method's flexibility and adaptability, to its contribution to the content and form of an interface, and a point is made about the importance of being clear and consistent when reporting how the method has been applied and, where appropriate, adapted.", "paper_title": "Ecological Interface Design Two Decades On: Whatever Happened to the SRK Taxonomy?", "paper_id": "WOS:000351468500001"}