{"auto_keywords": [{"score": 0.04753799882019955, "phrase": "vehicular_networks"}, {"score": 0.00481495049065317, "phrase": "context-aware_trust-based_information_dissemination_framework_for_vehicular_networks"}, {"score": 0.004417012437860011, "phrase": "highly_mobile_nature"}, {"score": 0.004317848984770719, "phrase": "contact_time"}, {"score": 0.004088807948906792, "phrase": "trusted_communication"}, {"score": 0.003996983218174335, "phrase": "crucial_importance"}, {"score": 0.0035515951985356374, "phrase": "trust-based_framework"}, {"score": 0.003503497128638099, "phrase": "safe_and_reliable_information_dissemination"}, {"score": 0.0034092396400930446, "phrase": "proposed_framework"}, {"score": 0.0030847461428168614, "phrase": "trust_value"}, {"score": 0.0030429511467945525, "phrase": "road_segment"}, {"score": 0.002559951153813876, "phrase": "second_module"}, {"score": 0.0025137856138000014, "phrase": "safe_path"}, {"score": 0.0022951216874671516, "phrase": "traffic_requirements"}, {"score": 0.0022333012657436307, "phrase": "experimental_results"}, {"score": 0.0021049977753042253, "phrase": "trusted_vehicles"}], "paper_keywords": ["Information dissemination", " security", " trust", " vehicular networks (VNets)"], "paper_abstract": "Reliable, secure, private, and fast communication in vehicular networks is extremely challenging due to the highly mobile nature of these networks. Contact time between vehicles is very limited and topology is constantly changing. Trusted communication in vehicular networks is of crucial importance because without trust, all efforts for minimizing the delay or maximizing the reliability could be voided. In this paper, we propose a trust-based framework for a safe and reliable information dissemination in vehicular networks. The proposed framework consists of two modules such that the first one applies three security checks to make sure the message is trusted. It assigns a trust value to each road segment and one to each neighborhood, instead of each car. Thus, it scales up easily and is completely distributed. Once a message is evaluated and considered to be trustworthy, our method then in the second module looks for a safe path through which the message is forwarded. Our frameworks are application-centric; in particular, it is capable of preserving traffic requirements specified by each application. Experimental results demonstrate that this framework outperforms other well-known routing protocols since it routes the messages via trusted vehicles.", "paper_title": "A Context-Aware Trust-Based Information Dissemination Framework for Vehicular Networks", "paper_id": "WOS:000373098400003"}