{"auto_keywords": [{"score": 0.04753799882019955, "phrase": "surface_meshes"}, {"score": 0.00481495049065317, "phrase": "low_distortion_surface_mappings"}, {"score": 0.004397000006837371, "phrase": "coarse_set"}, {"score": 0.004357245559948974, "phrase": "corresponding_pairs"}, {"score": 0.003942877273973905, "phrase": "consistent_manner"}, {"score": 0.0037506567448470163, "phrase": "novel_formulation"}, {"score": 0.0036998728605395384, "phrase": "isometric_distortion"}, {"score": 0.0036497740708342093, "phrase": "local_injectivity"}, {"score": 0.0033937776228549557, "phrase": "unique_continuous_bijection"}, {"score": 0.0030847461428168614, "phrase": "disk-type_surfaces"}, {"score": 0.00297454367746853, "phrase": "consistent_locally_injective_flattenings"}, {"score": 0.0027657766592943844, "phrase": "bijective_surface_mappings"}, {"score": 0.0026913130726432645, "phrase": "locally_injective_flattenings"}, {"score": 0.0024349853033241663, "phrase": "convex_framework"}, {"score": 0.0023694065215394593, "phrase": "wide_baseline"}, {"score": 0.0021632743048552536, "phrase": "high-quality_continuous_bijective_mappings"}, {"score": 0.0021049977753042253, "phrase": "varying_isometric_distortion_levels"}], "paper_keywords": ["surface mesh", " isometeric distortion", " bijective simplicial mappings"], "paper_abstract": "This paper introduces an algorithm for computing low-distortion, bijective mappings between surface meshes. The algorithm recieves as input a coarse set of corresponding pairs of points on the two surfaces, and follows three steps: (i) cutting the two meshes to disks in a consistent manner; (ii) jointly flattening the two disks via a novel formulation for minimizing isometric distortion while guaranteeing local injectivity (the flattenings can overlap, however); and (iii) computing a unique continuous bijection that is consistent with the flattenings. The construction of the algorithm stems from two novel observations: first, bijections between disk-type surfaces can be uniquely and efficiently represented via consistent locally injective flattenings that are allowed to be globally overlapping. This observation reduces the problem of computing bijective surface mappings to the task of computing locally injective flattenings, which is shown to be easier. Second, locally injective flattenings that minimize isometric distortion can be efficiently characterized and optimized in a convex framework. Experiments that map a wide baseline of pairs of surface meshes using the algorithm are provided. They demonstrate the ability of the algorithm to produce high-quality continuous bijective mappings between pairs of surfaces of varying isometric distortion levels.", "paper_title": "Lifted Bijections for Low Distortion Surface Mappings", "paper_id": "WOS:000340000100036"}