{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "unsynchronized_mr_sequential_images"}, {"score": 0.025048869018411527, "phrase": "b-rep_solid_model"}, {"score": 0.0043753813457279404, "phrase": "actual_topic"}, {"score": 0.0042343667228600225, "phrase": "spatio-temporal_images"}, {"score": 0.004160319763461951, "phrase": "electrocardiographic_waves"}, {"score": 0.003985816112027955, "phrase": "lung's_movement"}, {"score": 0.003357753650468499, "phrase": "unsynchronized_mr_images"}, {"score": 0.0033156708990372047, "phrase": "animated_b-repsolid_model"}, {"score": 0.0032249300977069345, "phrase": "lung's_motion"}, {"score": 0.0031845067058084583, "phrase": "mr_images"}, {"score": 0.003160495519296451, "phrase": "proposed_method"}, {"score": 0.0030817541061694096, "phrase": "lung's_silhouettes"}, {"score": 0.0029898418888138364, "phrase": "respiratory_pattern"}, {"score": 0.002907992115184249, "phrase": "lung's_silhouette"}, {"score": 0.0028426887945253373, "phrase": "obscure_edges"}, {"score": 0.0028070431733705735, "phrase": "extracted_lung's_silhouettes"}, {"score": 0.002785870108471127, "phrase": "sagittal_and_coronal_silhouettes"}, {"score": 0.0025761937402886954, "phrase": "wire-frame_model"}, {"score": 0.0025056395203104966, "phrase": "planar_silhouettes"}, {"score": 0.0024742098091226203, "phrase": "silhouette_composition"}, {"score": 0.002406441884512916, "phrase": "observed_sequences"}, {"score": 0.00232286335198363, "phrase": "meshing_algorithm"}, {"score": 0.0022478501955483007, "phrase": "left_lungs"}, {"score": 0.002137137933768807, "phrase": "shaded_model"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["4D MRI", " Animated lung visualization", " Lung's volume in time"], "paper_abstract": "This work discusses a 4D lung reconstruction method from unsynchronized MR sequential images. The lung, differently from the heart, does not have its own muscles, turning impossible to see its real movements. The visualization of the lung in motion is an actual topic of research in medicine. CT (Computerized Tomography) can obtain spatio-temporal images of the heart by synchronizing with electrocardiographic waves. The FOV of the heart is small when compared to the lung's FOV. The lung's movement is not periodic and is susceptible to variations in the degree of respiration. Compared to CT, MR (Magnetic Resonance) imaging involves longer acquisition times and it is not possible to obtain instantaneous 3D images of the lung. For each slice, only one temporal sequence of 2D images can be obtained. However, methods using MR are preferable because they do not involve radiation. In this paper, based on unsynchronized MR images of the lung an animated B-Repsolid model of the lung is created. The 3D animation represents the lung's motion associated to one selected sequence of MR images. The proposed method can be divided in two parts. First, the lung's silhouettes moving in time are extracted by detecting the presence of a respiratory pattern on 2D spatio-temporal MR images. This approach enables us to determine the lung's silhouette for every frame, even on frames with obscure edges. The sequence of extracted lung's silhouettes are unsynchronized sagittal and coronal silhouettes. Using our algorithm it is possible to reconstruct a 3D lung starting from a silhouette of any type (coronal or sagittal) selected from any instant in time. A wire-frame model of the lung is created by composing coronal and sagittal planar silhouettes representing cross-sections. The silhouette composition is severely underconstrained. Many wire-frame models can be created from the observed sequences of silhouettes in time. Finally, a B-Rep solid model is created using a meshing algorithm. Using the B-Rep solid model the volume in time for the right and left lungs were calculated. It was possible to recognize several characteristics of the 3D real right and left lungs in the shaded model. (C) 2007 Elsevier Ltd. All rights reserved.", "paper_title": "Animated solid model of the lung constructed from unsynchronized MR sequential images", "paper_id": "WOS:000268523800004"}