{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "efficient_data"}, {"score": 0.0046970764288494764, "phrase": "resource-constrained_wireless_environments"}, {"score": 0.004620093797504386, "phrase": "decentralised_system"}, {"score": 0.004525629293824217, "phrase": "individual_peers"}, {"score": 0.004378469469879815, "phrase": "mutual_trust"}, {"score": 0.004115267130977749, "phrase": "inherent_resource_constraints"}, {"score": 0.004064548693812535, "phrase": "efficiency_efforts"}, {"score": 0.003835972725191194, "phrase": "novel_trustworthy-based_efficient_broadcast_scheme"}, {"score": 0.0036653985479652854, "phrase": "peer's_reputation"}, {"score": 0.0035755653799043, "phrase": "personalised_view"}, {"score": 0.0031064226956732497, "phrase": "individual_peer"}, {"score": 0.002931569771634119, "phrase": "peer's_credibility"}, {"score": 0.0026986685585382347, "phrase": "malicious_and_collaborative-based_malicious_peers"}, {"score": 0.0025785359740308337, "phrase": "named_trustworthy-based_estafet_multi-point_relays"}, {"score": 0.0024535580495414783, "phrase": "communication_overhead"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Reputation", " Trustworthiness", " Wireless P2P networks", " Efficient data dissemination"], "paper_abstract": "In a decentralised system like P2P where each individual peers are considerably autonomous, the notion of mutual trust between peers is critical. In addition, when the environment is subject to inherent resource constraints, any efficiency efforts are essentially needed. In light of these two issues, we propose a novel trustworthy-based efficient broadcast scheme in a resource-constrained P2P environment. The trustworthiness is associated with the peer's reputation. A peer holds a personalised view of reputation towards other peers in four categories namely SpEed, Correctness, quality, and Risk-freE (SeCuRE). The value of each category constitutes a fraction of the reliability of individual peer. Another factor that contributes to the reliability of a peer is the peer's credibility concerning trustworthiness in providing recommendation about other peers. Our trust management scheme is applied in conjunction with our trust model in order to detect malicious and collaborative-based malicious peers. Knowledge of trustworthiness among peers is used in our proposed broadcast model named trustworthy-based estafet multi-point relays (TEMPR). This model is designed to minimise the communication overhead between peers while considering the trustworthiness of the peers such that only trustworthy peer may relay messages to other peers. With our approach, each peer is able to disseminate messages in the most efficient and reliable manner. (C) 2011 Elsevier Inc. All rights reserved.", "paper_title": "Trustworthy-based efficient data broadcast model for P2P interaction in resource-constrained wireless environments", "paper_id": "WOS:000309296200005"}