{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "probabilistic"}, {"score": 0.005065180798955031, "phrase": "od"}, {"score": 0.0047135086583390585, "phrase": "traffic_random_variables"}, {"score": 0.004497762477097628, "phrase": "probabilistic_and_physical_consistency"}, {"score": 0.004459605573798577, "phrase": "traffic-related_random_variables"}, {"score": 0.0034386016613475335, "phrase": "route_travel_times"}, {"score": 0.0033660587983313536, "phrase": "link_travel_times"}, {"score": 0.0031845067058084613, "phrase": "normal_models"}, {"score": 0.0029998918671747168, "phrase": "normal_distribution"}, {"score": 0.0028992294924613327, "phrase": "minimum_or_maximum_operations"}, {"score": 0.0028139168128067343, "phrase": "dimensional_analysis_point"}, {"score": 0.0024969812322112174, "phrase": "dimensionless_variables"}, {"score": 0.0024234763342790852, "phrase": "proposed_models"}, {"score": 0.0022346638243276717, "phrase": "desired_properties"}, {"score": 0.002215663255682209, "phrase": "alternative_models"}, {"score": 0.0021504218042734677, "phrase": "original_families"}, {"score": 0.0021049977753042253, "phrase": "simple_examples"}], "paper_keywords": [""], "paper_abstract": "In this article we deal with the probabilistic and physical consistency of traffic-related random variables and models. We analyze and discuss the conditions for a model to be consistent from two different points of view: probabilistic and physical (dimensional analysis). The first, leads us to the concept of stability in general and reproductivity in particular because, for example, origin-destination (OD) and link flows are the sum of route flows and route travel times are the sum of link travel times. This implies stability with respect to sums (reproductivity). Normal models are justified because when the number of summands increases the averages approach the normal distribution. Similarly, stability with respect to minimum or maximum operations arises in practice. From the dimensional analysis point of view, some models are demonstrated not to be convenient. In particular, it is shown that some families of distributions are valid only for dimensionless variables. All these and other problems are discussed and some proposed models in the literature are analyzed from these two points of view. When some families fail to satisfy the desired properties, alternative models are provided via extension of the original families. Finally, some simple examples and conclusions are given to summarize the analysis.", "paper_title": "On the Probabilistic and Physical Consistency of Traffic Random Variables and Models", "paper_id": "WOS:000340466600003"}