{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "optimum_oil_production_planning_using_infeasibility_driven_evolutionary_algorithm"}, {"score": 0.004647442352794694, "phrase": "practical_oil_production_planning_optimization_problem"}, {"score": 0.004539005582217305, "phrase": "insufficient_reservoir_pressure"}, {"score": 0.0041625173012740544, "phrase": "total_gas"}, {"score": 0.004065348865695599, "phrase": "oil_extraction"}, {"score": 0.004001828274595483, "phrase": "daily_availability_limits"}, {"score": 0.003802135020791801, "phrase": "nonlinear_function"}, {"score": 0.003527998934981411, "phrase": "optimal_amount"}, {"score": 0.00320970209394799, "phrase": "total_daily_gas_availability"}, {"score": 0.0031100973266506163, "phrase": "practical_interest"}, {"score": 0.003073545175760353, "phrase": "major_oil_exploration_companies"}, {"score": 0.0029781530607129653, "phrase": "large_financial_benefit"}, {"score": 0.00281826552772148, "phrase": "constrained_optimization_problems"}, {"score": 0.002763261749602258, "phrase": "multi-objective_formulation"}, {"score": 0.002455009746748708, "phrase": "modified_single_objective_formulation"}, {"score": 0.0021983430142660373, "phrase": "lesser_amount"}, {"score": 0.0021049977753042253, "phrase": "modified_formulation"}], "paper_keywords": ["Evolutionary algorithms", " integer linear programming", " multi-objective", " oil well", " infeasibility"], "paper_abstract": "In this paper, we discuss a practical oil production planning optimization problem. For oil wells with insufficient reservoir pressure, gas is usually injected to artificially lift oil, a practice commonly referred to as enhanced oil recovery (EOR). The total gas that can be used for oil extraction is constrained by daily availability limits. The oil extracted from each well is known to be a nonlinear function of the gas injected into the well and varies between wells. The problem is to identify the optimal amount of gas that needs to be injected into each well to maximize the amount of oil extracted subject to the constraint on the total daily gas availability. The problem has long been of practical interest to all major oil exploration companies as it has the potential to derive large financial benefit. In this paper, an infeasibility driven evolutionary algorithm is used to solve a 56 well reservoir problem which demonstrates its efficiency in solving constrained optimization problems. Furthermore, a multi-objective formulation of the problem is posed and solved using a number of algorithms, which eliminates the need for solving the (single objective) problem on a regular basis. Lastly, a modified single objective formulation of the problem is also proposed, which aims to maximize the profit instead of the quantity of oil. It is shown that even with a lesser amount of oil extracted, more economic benefits can be achieved through the modified formulation.", "paper_title": "Optimum Oil Production Planning Using Infeasibility Driven Evolutionary Algorithm", "paper_id": "WOS:000316061600003"}