{"auto_keywords": [{"score": 0.04755154299589266, "phrase": "ofa"}, {"score": 0.00481495049065317, "phrase": "robust_optimal_eigenvalue-assignable_output"}, {"score": 0.003850299959557491, "phrase": "robust_optimal_eigenvalue-assignable_output_feedback"}, {"score": 0.003362060602812933, "phrase": "closed-loop_uncertain_multivariable_system"}, {"score": 0.0031629800646754505, "phrase": "nominal_closed-loop_system"}, {"score": 0.0027429789393362703, "phrase": "robust_optimal_eigenvalue-assignable_output_feedback_pid_control_problem"}, {"score": 0.0025284524249379265, "phrase": "robust_optimal_eigenvalue-assignable_static_output_feedback_control_problem"}, {"score": 0.00237861522566195, "phrase": "design_example"}, {"score": 0.002330664671716791, "phrase": "robust_optimal_eigenvalue-assignable_output_feedback_pid_controller"}, {"score": 0.0021049977753042253, "phrase": "proposed_integrative_approach"}], "paper_keywords": ["Optimal control", " Eigenvalue assignability", " Multivariable PID control systems", " Singular systems", " Parameter uncertainties", " Orthogonal-functions approach", " Genetic algorithm"], "paper_abstract": "By complementarily fusing of the robust regional eigenvalue-assignability condition, the orthogonal-functions approach (OFA) and the hybrid Taguchi-genetic algorithm. (HTGA), an integrative method is proposed in this paper to design the robust optimal eigenvalue-assignable Output feedback PID (proportional-integral-derivative) controller such that (i) the eigenvalues of a linear closed-loop uncertain multivariable system can be retained inside the same specified region as the nominal closed-loop system does, and (ii) a quadratic finite-horizon integral performance index for the linear nominal multivariable control system can be minimized. In this paper, the robust optimal eigenvalue-assignable output feedback PID control problem of a linear uncertain multivariable control system is converted to the robust optimal eigenvalue-assignable static output feedback control problem of a linear uncertain singular system. A design example of the robust optimal eigenvalue-assignable output feedback PID controller for an uncertain stirred tank system is given to demonstrate the applicability of the proposed integrative approach.", "paper_title": "DESIGN OF ROBUST OPTIMAL EIGENVALUE-ASSIGNABLE OUTPUT FEEDBACK PID CONTROLLERS FOR LINEAR UNCERTAIN MULTIVARIABLE SYSTEMS VIA ORTHOGONAL-FUNCTIONS APPROACH AND GENETIC ALGORITHM", "paper_id": "WOS:000273648900035"}