{"auto_keywords": [{"score": 0.04943159058562837, "phrase": "qualitative_decision"}, {"score": 0.015719716506582538, "phrase": "possibilistic_logic"}, {"score": 0.009620793675707916, "phrase": "prioritized_preferences"}, {"score": 0.004706895428234964, "phrase": "answer_set"}, {"score": 0.00460125407969429, "phrase": "qualitative_approach"}, {"score": 0.004337502738649814, "phrase": "possibility_theory"}, {"score": 0.0035677736570659813, "phrase": "available_knowledge"}, {"score": 0.0032725712584012953, "phrase": "separate_prioritized_base"}, {"score": 0.0031845067058084583, "phrase": "possibilistic_logic_handling"}, {"score": 0.0030707512751243214, "phrase": "answer_set_programming"}, {"score": 0.0028294260793318873, "phrase": "asp"}, {"score": 0.0027282915297520624, "phrase": "abductive_logic_programming"}, {"score": 0.0025951294037626174, "phrase": "possibilistic_definite_logic_programs"}, {"score": 0.002502374576203785, "phrase": "asp-based_and_possibilistic_asp-based_algorithms"}, {"score": 0.0023802126605244438, "phrase": "possibilistic_decision_criteria"}, {"score": 0.0022434880661725493, "phrase": "different_asp_solvers"}, {"score": 0.0021632743048552536, "phrase": "different_implementations"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Qualitative decision under uncertainty", " Answer set programming", " Possibilistic answer set programming"], "paper_abstract": "A qualitative approach to decision making under uncertainty has been proposed in the setting of possibility theory, which is based on the assumption that levels of certainty and levels of priority (for expressing preferences) are commensurate. In this setting, pessimistic and optimistic decision criteria have been formally justified. This approach has been transposed into possibilistic logic in which the available knowledge is described by formulas which are more or less certainly true and the goals are described in a separate prioritized base. This paper adapts the possibilistic logic handling of qualitative decision making under uncertainty in the Answer Set Programming (ASP) setting. We show how weighted beliefs and prioritized preferences belonging to two separate knowledge bases can be handled in ASP by modeling qualitative decision making in terms of abductive logic programming where (uncertain) knowledge about the world and prioritized preferences are encoded as possibilistic definite logic programs and possibilistic literals respectively. We provide ASP-based and possibilistic ASP-based algorithms for calculating optimal decisions and utility values according to the possibilistic decision criteria. We describe a prototype implementing the algorithms proposed on top of different ASP solvers and we discuss the complexity of the different implementations. (C) 2013 Elsevier Inc. All rights reserved.", "paper_title": "Using possibilistic logic for modeling qualitative decision: Answer Set Programming algorithms", "paper_id": "WOS:000331503500011"}