{"auto_keywords": [{"score": 0.048636009815037934, "phrase": "scoring_and_staging_systems"}, {"score": 0.01191379896638994, "phrase": "cox"}, {"score": 0.007745037446404631, "phrase": "recursive_partitioning"}, {"score": 0.00481495049065317, "phrase": "cox_linear_regression_modeling"}, {"score": 0.004316396683332752, "phrase": "medical_data"}, {"score": 0.004223032986655664, "phrase": "child-turcotte-pugh_scoring"}, {"score": 0.004042295865725559, "phrase": "liver_disease"}, {"score": 0.003920384090110374, "phrase": "physicians'_experience"}, {"score": 0.003498782065781398, "phrase": "censored_survival_data"}, {"score": 0.003378385493203297, "phrase": "target_number"}, {"score": 0.0030951536886513567, "phrase": "local_cox_linear_regression_models"}, {"score": 0.0028731024405707277, "phrase": "superior_predictive_accuracy"}, {"score": 0.00270221723573854, "phrase": "staging_system_construction_algorithms"}, {"score": 0.0026552818091968543, "phrase": "cross-validation_evaluation"}, {"score": 0.0025638362414466278, "phrase": "data-based_cross-validation_comparison"}, {"score": 0.002297831085501592, "phrase": "significant_categorical_predictors"}, {"score": 0.0022678201262721323, "phrase": "proposed_local_cox_linear_recursive_partitioning"}, {"score": 0.0022089663761854657, "phrase": "cox_linear_modeling"}, {"score": 0.0021896891011033105, "phrase": "simple_recursive_partitioning"}, {"score": 0.0021049977753042253, "phrase": "local_linear_modeling"}], "paper_keywords": ["Child-Turcone-Pugh", " tree-structured method", " censored survival data", " local linear model", " cross-validation"], "paper_abstract": "Objectives: Scoring and staging systems are used to determine the order and class of data according to predictors. Systems used for medical data, such as the Child-Turcotte-Pugh scoring and staging systems for ordering and classifying patients with liver disease, are often derived strictly from physicians' experience and intuition. We construct objective and data-based scoring/staging systems using statistical methods. Methods. We consider Cox linear regression modeling and recursive partitioning techniques for censored survival data. In particular, to obtain a target number of stages we propose cross-validation and amalgamation algorithms. We also propose an algorithm for constructing scoring and staging systems by integrating local Cox linear regression models into recursive partitioning, so that we can retain the merits of both methods such as superior predictive accuracy, ease of use, and detection of interactions between predictors. The staging system construction algorithms are compared by cross-validation evaluation of real data. Results. The data-based cross-validation comparison shows that Cox linear regression modeling is somewhat better than recursive partitioning when there are only continuous predictors, while recursive partitioning is better when there are significant categorical predictors. The proposed local Cox linear recursive partitioning has better predictive accuracy than Cox linear modeling and simple recursive partitioning. Conclusions: This study indicates that integrating local linear modeling into recursive partitioning (an significantly improve prediction accuracy in constructing scoring and staging systems.", "paper_title": "Scoring and staging systems using cox linear regression modeling and recursive partitioning", "paper_id": "WOS:000234822900006"}