{"auto_keywords": [{"score": 0.048004834084269796, "phrase": "autogrow"}, {"score": 0.004299910946753963, "phrase": "existing_open-source_software"}, {"score": 0.004216112320418982, "phrase": "candidate_ligands"}, {"score": 0.004174824849669107, "phrase": "predicted_binding_affinity"}, {"score": 0.003993958025223994, "phrase": "medicinal_chemist"}, {"score": 0.0038397509389856625, "phrase": "chemical_intuition"}, {"score": 0.0037834649508375544, "phrase": "automated_optimization_process"}, {"score": 0.0036373553416391823, "phrase": "click_chemistry"}, {"score": 0.003378385493203297, "phrase": "growing_ligand"}, {"score": 0.0032319109979344184, "phrase": "chemically_feasible_druglike_molecules"}, {"score": 0.0030614565460256897, "phrase": "chemist's_efforts"}, {"score": 0.0028293966058473476, "phrase": "predicted_inhibitors"}, {"score": 0.002464709648714996, "phrase": "druglike_molecules"}, {"score": 0.0024405312482831646, "phrase": "high_predicted_binding_affinities"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Drug design", " Click chemistry", " Autogrow", " Computational chemistry"], "paper_abstract": "We here present an improved version of AutoGrow (version 3.0), an evolutionary algorithm that works in conjunction with existing open-source software to automatically optimize candidate ligands for predicted binding affinity and other druglike properties. Though no substitute for the medicinal chemist, AutoGrow 3.0, unlike its predecessors, attempts to introduce some chemical intuition into the automated optimization process. AutoGrow 3.0 uses the rules of click chemistry to guide optimization, greatly enhancing synthesizability. Additionally, the program discards any growing ligand whose physical and chemical properties are not druglike. By carefully crafting chemically feasible druglike molecules, we hope that AutoGrow 3.0 will help supplement the chemist's efforts. To demonstrate the utility of the program, we use AutoGrow 3.0 to generate predicted inhibitors of three important drug targets: Trypanosoma brucei RNA editing ligase 1, peroxisome proliferator-activated receptor gamma, and dihydrofolate reductase. In all cases, AutoGrow generates druglike molecules with high predicted binding affinities. AutoGrow 3.0 is available free of charge (http://autogrow.ucsd.edu) under the terms of the GNU General Public License and has been tested on Linux and Mac OS X. (C) 2013 The Authors. Published by Elsevier Inc. All rights reserved.", "paper_title": "AutoGrow 3.0: An improved algorithm for chemically tractable, semi-automated protein inhibitor design", "paper_id": "WOS:000324965300011"}