{"auto_keywords": [{"score": 0.02390039582713947, "phrase": "photo_stories"}, {"score": 0.00481495049065317, "phrase": "communication_mediators"}, {"score": 0.004450568197899267, "phrase": "media-sharing_web_sites"}, {"score": 0.0042452552248398445, "phrase": "storytelling_activities"}, {"score": 0.003986103192038901, "phrase": "photo-based_narratives"}, {"score": 0.0038930368103015467, "phrase": "young_parents"}, {"score": 0.003432044343307207, "phrase": "malaysian_young_mothers"}, {"score": 0.0033256755562404462, "phrase": "uk"}, {"score": 0.0028857130140890787, "phrase": "parenting_advice"}, {"score": 0.0025841336988141235, "phrase": "sixteen_families"}, {"score": 0.0023694065215394593, "phrase": "web_spaces"}, {"score": 0.0021049977753042253, "phrase": "mediating_system"}], "paper_keywords": ["Photo sharing", " Narratives", " Young mothers", " Computer-mediated communication (CMC)"], "paper_abstract": "Media-sharing Web sites are facilitating modern versions of storytelling activities. This study investigates the use of photo-based narratives to support young parents who are geographically separated from their aging parents to share stories about their young children. The case analyses Malaysian young mothers living in the UK, communicating regularly with their families back home, sharing experiences living in another country, looking for parenting advice, and opening opportunities for sharing the life and development of their young children. Sixteen families participated in the study by providing access to their social networking and web spaces and participating in exercises for creating photo stories. We identified the characteristics of the mediating system serving to establish the contact between grandparents and grandchildren as well as the characteristics of the photo stories and the practices around sharing them.", "paper_title": "Photo-based narratives as communication mediators between grandparents and their children and grandchildren living abroad", "paper_id": "WOS:000300778300007"}