{"auto_keywords": [{"score": 0.04939024695118498, "phrase": "neighborhood_similarity"}, {"score": 0.015348533997859688, "phrase": "video_annotation"}, {"score": 0.00481495049065317, "phrase": "distance_measurement"}, {"score": 0.004392565073466714, "phrase": "machine_learning_techniques"}, {"score": 0.004308455856718928, "phrase": "graph-based_semi-supervised_learning"}, {"score": 0.004046020290832207, "phrase": "crucial_factor"}, {"score": 0.0038924989779389424, "phrase": "pairwise_similarity"}, {"score": 0.0035679633126097115, "phrase": "euclidean_distance"}, {"score": 0.002997572637726648, "phrase": "traditional_distance-based_similarity_measure"}, {"score": 0.002940095976373734, "phrase": "high_classification_error_rates"}, {"score": 0.002760778494680823, "phrase": "novel_neighborhood_similarity_measure"}, {"score": 0.00269475174341129, "phrase": "local_sample"}, {"score": 0.0023303871145705954, "phrase": "surrounding_samples"}, {"score": 0.0021987994275190314, "phrase": "extensive_experiments"}, {"score": 0.0021049977753042253, "phrase": "existing_distance-based_similarity"}], "paper_keywords": ["Neighborhood similarity", " semi-supervised learning", " video annotation"], "paper_abstract": "In the past few years, video annotation has benefited a lot from the progress of machine learning techniques. Recently, graph-based semi-supervised learning has gained much attention in this domain. However, as a crucial factor of these algorithms, the estimation of pairwise similarity has not been sufficiently studied. Generally, the similarity of two samples is estimated based on the Euclidean distance between them. But we will show that the similarity between two samples is not merely related to their distance but also related to the distribution of surrounding samples and labels. It is shown that the traditional distance-based similarity measure may lead to high classification error rates even on several simple datasets. To address this issue, we propose a novel neighborhood similarity measure, which explores the local sample and label distributions. We show that the neighborhood similarity between two samples simultaneously takes into account three characteristics: 1) their distance; 2) the distribution difference of the surrounding samples; and 3) the distribution difference of surrounding labels. Extensive experiments have demonstrated the superiority of neighborhood similarity over the existing distance-based similarity.", "paper_title": "Beyond Distance Measurement: Constructing Neighborhood Similarity for Video Annotation", "paper_id": "WOS:000264632300012"}