{"auto_keywords": [{"score": 0.030041686957073252, "phrase": "proposed_protocol"}, {"score": 0.015719716506582538, "phrase": "mobile_agent"}, {"score": 0.004651057147690674, "phrase": "mobile_agent_paradigm"}, {"score": 0.004515004397496303, "phrase": "e-commerce_applications"}, {"score": 0.004130165601475531, "phrase": "security_consideration"}, {"score": 0.0037222908218253054, "phrase": "set_payment_protocol"}, {"score": 0.0036133077234252633, "phrase": "dispatched_consumer-agent"}, {"score": 0.0033050703534275717, "phrase": "hest_merchant"}, {"score": 0.0030081030319492343, "phrase": "si-nature-share_scheme"}, {"score": 0.0029344771385297137, "phrase": "trusted_third_party"}, {"score": 0.0025924472717154877, "phrase": "set."}, {"score": 0.002442693254693416, "phrase": "double_payment"}, {"score": 0.002336071138145897, "phrase": "security_properties"}], "paper_keywords": ["Mobile agent", " secure payment protocol", " SET and Signature-Share scheme"], "paper_abstract": "The mobile agent paradigm offers flexibility and autonomy to e-commerce applications. But it is challenging, to employ a mobile agent to make a payment due to the security consideration. In this paper, we Propose It new agent-assisted secure payment protocol, which is based on SET payment protocol and aims at enabling the dispatched consumer-agent to autonomously sign contracts and make the payment on behalf of the cardholder after having found the hest merchant, without the possibility of disclosing any secret to any participant. This is realized by adopting the Si-nature-Share scheme, and employing a Trusted Third Party (TTP). In the proposed protocol, the principle that each participant knows what is strictly necessary for his/her role is followed as in SET. In addition. mechanisms have been devised for preventing and detecting double payment, overspending and overpayment attacks. Finally the security properties of the proposed protocol are studied analytically. In comparison with other existing models, the proposed protocol is more efficient and can detect more attacks.", "paper_title": "Employ a mobile agent for making a payment", "paper_id": "WOS:000262996300004"}