{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "collaborative_platform_development"}, {"score": 0.03605294720229584, "phrase": "supplier_integration"}, {"score": 0.032573902925676836, "phrase": "previous_study"}, {"score": 0.028826125805240126, "phrase": "product_owners"}, {"score": 0.0047152877145889656, "phrase": "platform-based_products"}, {"score": 0.004569630374630379, "phrase": "multiple_brands"}, {"score": 0.004475022550508119, "phrase": "growing_need"}, {"score": 0.004443921948822114, "phrase": "system_engineering_processes"}, {"score": 0.004058668702112495, "phrase": "different_backgrounds"}, {"score": 0.003933214459874487, "phrase": "core_strategy"}, {"score": 0.0035670895401691536, "phrase": "development_cycle"}, {"score": 0.0033851312604425516, "phrase": "huge_competitive_advantage"}, {"score": 0.003314965171168532, "phrase": "component_design"}, {"score": 0.0032689949867583633, "phrase": "full_responsibility"}, {"score": 0.003212424802083714, "phrase": "complex_distributed_systems"}, {"score": 0.0031789521764305287, "phrase": "starting_point"}, {"score": 0.002974886152979996, "phrase": "swedish_automotive_company"}, {"score": 0.002862767868795934, "phrase": "communication_barriers"}, {"score": 0.002803398730609738, "phrase": "supplier_interaction"}, {"score": 0.0027838831266525773, "phrase": "information_management"}, {"score": 0.0024894376091589244, "phrase": "orginal_equipment_manufacturers"}, {"score": 0.002281194103324554, "phrase": "collaborative_product_platform_development"}, {"score": 0.0021421082915443887, "phrase": "document_studies"}, {"score": 0.0021049977753042253, "phrase": "swedish_truck_manufacturer"}], "paper_keywords": ["collaboration", " platform development", " supply chain", " communication", " trust", " process management", " sensitive information"], "paper_abstract": "Following the introduction of platform-based products, especially considering that platforms are used for multiple brands, there is certainly a growing need for system engineering processes and techniques. This is further emphasized by the fact that companies faced with collaborative platform development frequently need to harmonize often opposing claims from stakeholders with different backgrounds, beliefs, desires and intentions. A core strategy for using resources ( e. g., work-hours, knowledge, and production systems) better and more flexibly is to involve suppliers earlier in the development cycle. From this perspective, well-designed and efficiently managed supplier integration is a huge competitive advantage. Supplier integration may range from component design and manufacture to full responsibility for the design of complex distributed systems. The starting point for this work is the results from a previous study, made by the authors, in which a Swedish automotive company and one of its sub-suppliers were examined in order to identify communication barriers. This revealed several problems regarding supplier interaction and information management in projects where both suppliers and product owners contribute their unique knowledge. Following the previous study, the questions to answer include: How can platforms be represented to suit suppliers as well as orginal equipment manufacturers? How does one guarantee efficient, accurate and secure information exchange between the parties involved? Consequently, this article pinpoints some of the problems that companies involved with collaborative product platform development, together with their suppliers, must face today. To answer these questions, interviews, and document studies were conducted for a Swedish truck manufacturer. The results are oriented to the interfaces between product owners and their suppliers.", "paper_title": "Supplier integration and communication strategies in collaborative platform development", "paper_id": "WOS:000254129400003"}