{"auto_keywords": [{"score": 0.025391659877494296, "phrase": "depths"}, {"score": 0.00481495049065317, "phrase": "social_semantic_web"}, {"score": 0.004765173195920904, "phrase": "today's_students"}, {"score": 0.0046429592670444945, "phrase": "constant_activity"}, {"score": 0.004453874101119545, "phrase": "high_level"}, {"score": 0.004407813106104401, "phrase": "social_and_creative_engagement"}, {"score": 0.003850464100878052, "phrase": "modern_learning_theories"}, {"score": 0.0036363418376496484, "phrase": "successful_learning_processes"}, {"score": 0.003580032420161922, "phrase": "recent_empirical_studies"}, {"score": 0.0032769720645483102, "phrase": "social_and_semantic_web_technologies"}, {"score": 0.0029224275921964724, "phrase": "today's_learning_environments"}, {"score": 0.002759769970554556, "phrase": "different_tools"}, {"score": 0.0026609940110902666, "phrase": "main_principles"}, {"score": 0.0023656701645734957, "phrase": "ssw"}, {"score": 0.0021049977753042253, "phrase": "software_design_patterns"}], "paper_keywords": ["Semantic Web", " social tools", " ontologies", " Linked Data", " collaborative learning", " project-based learning"], "paper_abstract": "Today's students, being used to constant activity and multitasking in their everyday life, need a high level of social and creative engagement in order to learn; for them, highly interactive learning environments which allow for communication, collaboration, and authoring, are a must. In addition, modern learning theories stress the importance of interactivity and engagement of students for successful learning processes, whereas recent empirical studies provide evidence and confirm this. In this paper, we present how the integration of Social and Semantic Web technologies, often referred to as the Social Semantic Web (SSW), along with the Linked Data paradigm offer potentials for improving the interactivity of today's learning environments, while putting students in control of their learning process spanning across different tools and services. We identify the main principles on which such SSW-supported personal learning environments are based, and illustrate them through the design, implementation, analysis, and evaluation of DEPTHS (DEsign Patterns Teaching Help System) - a SSW-based interactive personal learning environment we have developed for the domain of software design patterns.", "paper_title": "Personal learning environments on the Social Semantic Web", "paper_id": "WOS:000209437000004"}