{"auto_keywords": [{"score": 0.04258747476583746, "phrase": "lower_overall_computational_cost"}, {"score": 0.038533818161098556, "phrase": "optimal_search_order"}, {"score": 0.025732802978647006, "phrase": "proposed_method"}, {"score": 0.00481495049065317, "phrase": "optimal_dynamic_sequential_search"}, {"score": 0.0047415081747150065, "phrase": "real-time_machine_vision"}, {"score": 0.004651271219032404, "phrase": "geometrical_vision"}, {"score": 0.004493130934067195, "phrase": "image_locations"}, {"score": 0.0039729853486821995, "phrase": "global_matchings"}, {"score": 0.0038674532861321864, "phrase": "dynamic_sequential_search"}, {"score": 0.0036366744669511747, "phrase": "dss"}, {"score": 0.0035536228914319354, "phrase": "probabilistic_distribution"}, {"score": 0.0034326732528567826, "phrase": "multivariate_gaussian_model"}, {"score": 0.0033672608231654897, "phrase": "general_formulas"}, {"score": 0.0033030907500120397, "phrase": "predicted_positions"}, {"score": 0.003046621804854539, "phrase": "features'_search-regions"}, {"score": 0.002977061391551628, "phrase": "necessary_and_sufficient_condition"}, {"score": 0.0027458373015999916, "phrase": "suboptimal_search_order"}, {"score": 0.002683125911877974, "phrase": "computational_complexity"}, {"score": 0.002372015603684862, "phrase": "statistical_simulation"}], "paper_keywords": ["Active matching", " dynamic sequential search", " optimal search", " simultaneous localization and mapping", " visual tracking"], "paper_abstract": "In tracking and geometrical vision, there are usually priors available on the image locations of features of interest. In this paper, we use these priors dynamically to guide a feature by feature matching search. Much less image processing and lower overall computational cost can be expected for getting global matchings. First, the concept of dynamic sequential search (DSS) is presented. Then, the problem of determining an optimal search order for DSS is investigated, when the probabilistic distribution of the features can be described by a multivariate Gaussian model. Based upon the general formulas for sequentially updating the predicted positions of the features as well as their innovation covariance, the theoretic lower bound for the sum of the areas of the features' search-regions is derived, and the necessary and sufficient condition for the optimal search order to approach this lower bound is presented. After that, an algorithm for dynamically determining a suboptimal search order is presented, with a computational complexity of O(n(3)), which is two magnitudes lower than those of the state-of-the-art algorithms. The effectiveness of the proposed method is validated by both statistical simulation and real-world experiments with a monocular visual SLAM (simultaneous localization and mapping) system. The results verify that the performance of the proposed method is better than the state-of-the-art algorithms, with both fewer image processing operations and lower overall computational cost.", "paper_title": "On Optimal Dynamic Sequential Search for Matching in Real-Time Machine Vision", "paper_id": "WOS:000283445600018"}