{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "query_suggestions"}, {"score": 0.015416809394805333, "phrase": "query_suggestion"}, {"score": 0.004767826806287385, "phrase": "information_search"}, {"score": 0.004652016085325825, "phrase": "common_feature"}, {"score": 0.003496868378204654, "phrase": "search_expertise"}, {"score": 0.003462599815177726, "phrase": "topic_difficulty"}, {"score": 0.0034118234596993836, "phrase": "temporal_segment"}, {"score": 0.0033617891884360606, "phrase": "search_and_query_suggestion_usage"}, {"score": 0.0031377955308198634, "phrase": "previous_controlled_laboratory_study"}, {"score": 0.00307657476125683, "phrase": "previous_study"}, {"score": 0.0030017207229983385, "phrase": "experimental_search_system"}, {"score": 0.0021789194955896124, "phrase": "specific_times"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Search behavior", " Query suggestion", " Search tactics", " Topic difficulty", " Temporal search segment"], "paper_abstract": "Query suggestion is a common feature of many information search systems. While much research has been conducted about how to generate suggestions, fewer studies have been conducted about how people interact with and use suggestions. The purpose of this paper is to investigate how and when people integrate query suggestions into their searches and the outcome of this usage. The paper further investigates the relationships between search expertise, topic difficulty, and temporal segment of the search and query suggestion usage. A secondary analysis of data was conducted using data collected in a previous controlled laboratory study. In this previous study, 23 undergraduate research participants used an experimental search system with query suggestions to conduct four topic searches. Results showed that participants integrated the suggestions into their searching fairly quickly and that participants with less search expertise used more suggestions and saved more documents. Participants also used more suggestions towards the end of their searches and when searching for more difficult topics. These results show that query suggestion can provide support in situations where people have less search expertise, greater difficulty searching and at specific times during the search. Published by Elsevier Ltd.", "paper_title": "The use of query suggestions during information search", "paper_id": "WOS:000327287500013"}