{"auto_keywords": [{"score": 0.04668260212856778, "phrase": "serious_games"}, {"score": 0.03090402495594091, "phrase": "task_logic"}, {"score": 0.004662705558154439, "phrase": "graphical_narrative_editor"}, {"score": 0.00443308765153716, "phrase": "cognitive_neurorehabilitation"}, {"score": 0.003970439654470374, "phrase": "rehabilitation_tasks"}, {"score": 0.0037060428445111694, "phrase": "virtual_task_environment"}, {"score": 0.0029586543333524904, "phrase": "complete_description"}, {"score": 0.0026494723416072316, "phrase": "task_description"}, {"score": 0.002530359917257626, "phrase": "main_advantage"}, {"score": 0.0021049977753042253, "phrase": "system_testing"}], "paper_keywords": [""], "paper_abstract": "We describe a graphical narrative editor that we have developed for the design of serious games for cognitive neurorehabilitation. The system is addressed to neuropsychologists. It is aimed at providing them an easy, user-friendly, and fast way of specifying the therapeutical contents of the rehabilitation tasks that constitute the serious games. The editor takes as input a description of the virtual task environment and the actions allowed inside. Therapists use it to describe the actions that they expect patients to do in order to fulfill the goals of the task and the behavior of the game if patients do not reach their goals. The output of the system is a complete description of the task logic. We have designed a 3D game platform that provides to the editor a description the 3D virtual environments, and that translates the task description created in the editor into the task logic. The main advantage of the system is that it is fully automatic, it allows therapists to interactively design the tasks and immediately validate them by realizing it virtually. We describe the design of the two applications and present the results of system testing.", "paper_title": "Interactive Graphical Design of 3D Serious Neurorehabilitation Games", "paper_id": "WOS:000304449500006"}