{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "network_externalities"}, {"score": 0.019764207668157525, "phrase": "proprietary_software"}, {"score": 0.009152014168416165, "phrase": "oss"}, {"score": 0.004692980391580608, "phrase": "open_source"}, {"score": 0.004435363840720883, "phrase": "analytical_models"}, {"score": 0.004191829338769843, "phrase": "open_source_software"}, {"score": 0.003982011128052839, "phrase": "competing_oss"}, {"score": 0.003941319912895672, "phrase": "proprietary_software_products"}, {"score": 0.0039010428828989826, "phrase": "comparable_functionalities"}, {"score": 0.003611751858608048, "phrase": "underlying_market"}, {"score": 0.0028659990472580154, "phrase": "proprietary_software_increase"}, {"score": 0.0027789349951704177, "phrase": "decreasing_user_base"}, {"score": 0.00263965046277432, "phrase": "competitive_imbalance"}, {"score": 0.0021049977753042253, "phrase": "oss_community"}], "paper_keywords": ["competition", " network externalities", " open source software", " software compatibility"], "paper_abstract": "In this paper, we build analytical models to examine the impact of network externalities on the competition between open source software (OSS) and proprietary software. We investigate the competing OSS and proprietary software products with comparable functionalities in four different scenarios depending on whether they are compatible with each other and whether the underlying market is fully covered (i.e., all consumers adopt one of the two products). Furthermore, we study which party has the most incentive to make its product compatible with its counterpart. When the market is fully covered, the installed base and the profit of proprietary software increase at the expense of a decreasing user base for OSS in the presence of network externalities. This competitive imbalance becomes more pronounced when OSS and proprietary software are incompatible and the market is partially covered. Finally, we find that in the presence of network externalities, being compatible with its rival is not desirable for the proprietary software, but highly beneficial to the OSS community.", "paper_title": "The Impact of Network Externalities on the Competition Between Open Source and Proprietary Software", "paper_id": "WOS:000290549800008"}