{"auto_keywords": [{"score": 0.03707633276877944, "phrase": "knowledge_management_tools"}, {"score": 0.021286929482032518, "phrase": "knowledge_management_tool_selection"}, {"score": 0.01053123592463406, "phrase": "knowledge_managers"}, {"score": 0.010095759009247649, "phrase": "problem_environment"}, {"score": 0.006951880109704341, "phrase": "knowledge_problems"}, {"score": 0.00481495049065317, "phrase": "quality_knowledge_management"}, {"score": 0.004526503177267299, "phrase": "graphical_tool"}, {"score": 0.0042388570312522, "phrase": "quality_matrix"}, {"score": 0.004173865018011237, "phrase": "quality_function_deployment_methodology"}, {"score": 0.004125773078637226, "phrase": "simple_case_study"}, {"score": 0.003833749901796579, "phrase": "potential_tools"}, {"score": 0.0037749456215035856, "phrase": "knowledge_management_problem"}, {"score": 0.0033877275374263314, "phrase": "existing_classifications"}, {"score": 0.0028687545730861665, "phrase": "ten_subtypes"}, {"score": 0.0026965813247045427, "phrase": "new_classification"}, {"score": 0.0024574537875026634, "phrase": "greater_understanding"}, {"score": 0.002373339527491525, "phrase": "particular_knowledge_problem"}, {"score": 0.002292097733181405, "phrase": "house_tool"}, {"score": 0.0022222152430170254, "phrase": "promising_development"}, {"score": 0.002129584983647679, "phrase": "essential_part"}, {"score": 0.0021049977753042253, "phrase": "manager's_decision-making_toolkit"}], "paper_keywords": ["Knowledge management tools", " Knowledge problems", " Tool selection", " Tool classification"], "paper_abstract": "Knowledge managers need to select which knowledge management tool to use for any given problem and problem environment. A graphical tool, named the \"house of knowledge management tool selection\" is proposed, based on the house of quality matrix used in the quality function deployment methodology. A simple case study is described that acts as a proof of concept to show the house of knowledge management Tool selection can systematically evaluate potential tools to solve a knowledge management problem. To help identify the tools to populate the house, an examination was undertaken of how knowledge management tools had previously been listed and classified, but these existing classifications were found to be of little help. No classification existed that categorised the tools in terms of the knowledge problems they helped resolve, yet this classification would seem more useful for knowledge managers. To meet this need, knowledge problems were divided into ten subtypes and the knowledge management tools were then categorised according to their effectiveness at solving each subtype. This new classification was flexible enough to include all types of knowledge management tools and could also change with each problem environment. It was found to give a greater understanding of the knowledge management tools in the context of a particular knowledge problem, and it could therefore help populate the house tool. The house of knowledge management tool selection is a promising development of a tool that should be able to become an essential part of a manager's decision-making toolkit.", "paper_title": "Classification and selection of tools for quality knowledge management", "paper_id": "WOS:000288552500007"}