{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "multiple_views"}, {"score": 0.048839643896770986, "phrase": "rare_event_detection"}, {"score": 0.009099312787110053, "phrase": "proposed_method"}, {"score": 0.008721194451577373, "phrase": "multiple_videos"}, {"score": 0.008169674232979686, "phrase": "event_summarization"}, {"score": 0.004767826806287385, "phrase": "novel_approach"}, {"score": 0.004614038128321949, "phrase": "conventional_methods"}, {"score": 0.00450933377534525, "phrase": "rare_event"}, {"score": 0.004378182273895574, "phrase": "single_framework"}, {"score": 0.0042928648367867835, "phrase": "graph_editing_problem"}, {"score": 0.0036673238814279286, "phrase": "different_weights"}, {"score": 0.003607630811220324, "phrase": "graph_structure"}, {"score": 0.0032054891061528896, "phrase": "predefined_energy_model"}, {"score": 0.003163801909645747, "phrase": "mcmc"}, {"score": 0.0031121406603482112, "phrase": "energy_model"}, {"score": 0.0029238768315330305, "phrase": "specific_energy_model"}, {"score": 0.0025055391159787134, "phrase": "individual_videos"}, {"score": 0.0024086610445773096, "phrase": "extracted_multiple_graphs"}, {"score": 0.002346160830406661, "phrase": "single_composite_graph"}, {"score": 0.0023079225317714815, "phrase": "rare_events"}, {"score": 0.0022777800735119405, "phrase": "experimental_results"}, {"score": 0.0022480304016499605, "phrase": "proposed_approach"}, {"score": 0.0022041312401435346, "phrase": "fully_unsupervised_manner"}, {"score": 0.0021049977753042253, "phrase": "rare_transition"}], "paper_keywords": ["Event summarization", " rare event detection", " video structure learning", " video structure editing", " video structure matching"], "paper_abstract": "A novel approach for event summarization and rare event detection is proposed. Unlike conventional methods that deal with event summarization and rare event detection independently, our method solves them in a single framework by transforming them into a graph editing problem. In our approach, a video is represented by a graph, each node of which indicates an event obtained by segmenting the video spatially and temporally. The edges between nodes describe the relationship between events. Based on the degree of relations, edges have different weights. After learning the graph structure, our method finds subgraphs that represent event summarization and rare events in the video by editing the graph, that is, merging its subgraphs or pruning its edges. The graph is edited to minimize a predefined energy model with the Markov Chain Monte Carlo (MCMC) method. The energy model consists of several parameters that represent the causality, frequency, and significance of events. We design a specific energy model that uses these parameters to satisfy each objective of event summarization and rare event detection. The proposed method is extended to obtain event summarization and rare event detection results across multiple videos captured from multiple views. For this purpose, the proposed method independently learns and edits each graph of individual videos for event summarization or rare event detection. Then, the method matches the extracted multiple graphs to each other, and constructs a single composite graph that represents event summarization or rare events from multiple views. Experimental results show that the proposed approach accurately summarizes multiple videos in a fully unsupervised manner. Moreover, the experiments demonstrate that the approach is advantageous in detecting rare transition of events.", "paper_title": "A Unified Framework for Event Summarization and Rare Event Detection from Multiple Views", "paper_id": "WOS:000359216600001"}