{"auto_keywords": [{"score": 0.03470635444778384, "phrase": "feature_categories"}, {"score": 0.03277374817475705, "phrase": "ordering_task"}, {"score": 0.03159847863887298, "phrase": "correctness_criteria"}, {"score": 0.00481495049065317, "phrase": "common_method"}, {"score": 0.004371660146981191, "phrase": "system_designer's_ability"}, {"score": 0.004011867299107537, "phrase": "feature_orderings"}, {"score": 0.0033965836912510385, "phrase": "clustering_features"}, {"score": 0.0025137856138000014, "phrase": "case_study"}, {"score": 0.002382182688788248, "phrase": "analytical_arguments"}, {"score": 0.0021975548867457606, "phrase": "corresponding_ordering"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Telecommunication", " Priority", " Feature interaction"], "paper_abstract": "Precedence, whereby features are serialized and execute sequentially in response to an event, is a common method for coordinating features that would otherwise interact. However, the effectiveness of precedence lies in the system designer's ability to order features such that their sequential execution results in desired system behaviour. The task of evaluating feature orderings is expensive: a set of n features means that there are n! feature orderings to consider. This paper shows how the cost of ordering features can be reduced by (1) clustering features into categories and ordering the feature categories - a smaller problem; (2) automating the ordering task by evaluating orders with respect to correctness criteria; and (3) optimizing the ordering task by rejecting outright any ordering that includes a suborder of features that are known to violate correctness criteria. We demonstrate our approach on a case study involving 381 telephony features from both academic and industrial sources. The paper also presents analytical arguments that relate the correctness of an ordering of feature categories to the correctness of a corresponding ordering of features. (C) 2012 Elsevier Inc. All rights reserved.", "paper_title": "Ordering features by category", "paper_id": "WOS:000305109300008"}