{"auto_keywords": [{"score": 0.04921958265040906, "phrase": "random_forest_classifier"}, {"score": 0.03952973699700799, "phrase": "novel_paradigm"}, {"score": 0.02535428599824886, "phrase": "average_time"}, {"score": 0.004527518710548481, "phrase": "bc"}, {"score": 0.00442987501427177, "phrase": "single_character"}, {"score": 0.004381962669035583, "phrase": "character_presentation_paradigm"}, {"score": 0.004150030918669128, "phrase": "whole_word"}, {"score": 0.004060718465754644, "phrase": "smart_dictionary"}, {"score": 0.004002242925856335, "phrase": "candidate_words"}, {"score": 0.0037357362372975327, "phrase": "initial_character"}, {"score": 0.0036953036453370087, "phrase": "word_suggestions"}, {"score": 0.0032783186166708985, "phrase": "mobile_phone"}, {"score": 0.003242820629121494, "phrase": "text_messaging"}, {"score": 0.003172969962401266, "phrase": "initial_characters"}, {"score": 0.003104619199351347, "phrase": "integrated_custom-built_dictionary"}, {"score": 0.0030267296900520217, "phrase": "user_types"}, {"score": 0.0028663222014133813, "phrase": "word_typing"}, {"score": 0.0027242666160349938, "phrase": "multiple_decision_trees"}, {"score": 0.002598652897946253, "phrase": "proposed_bci_system"}, {"score": 0.0025518930446603335, "phrase": "word_typing_time"}, {"score": 0.002469830206270585, "phrase": "complete_words"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Brain computer interface", " BCI", " EEG", " P300 speller", " Word typing paradigm", " Dictionary", " Random forest", " Human-computer interaction"], "paper_abstract": "Background: A typical P300-based spelling brain computer interface (BC!) system types a single character with a character presentation paradigm and a P300 classification system. Lately, a few attempts have been made to type a whole word with the help of a smart dictionary that suggests some candidate words with the input of a few initial characters. Methods: In this paper, we propose a novel paradigm utilizing initial character typing with word suggestions and a novel P300 classifier to increase word typing speed and accuracy. The novel paradigm involves modifying the Text on 9 keys (T9) interface, which is similar to the keypad of a mobile phone used for text messaging. Users can type the initial characters using a 3 x 3 matrix interface and an integrated custom-built dictionary that suggests candidate words as the user types the initials. Then the user can select one of the given suggestions to complete word typing. We have adopted a random forest classifier, which significantly improves P300 classification accuracy by combining multiple decision trees. Results and discussion: We conducted experiments with 10 subjects using the proposed BCI system. Our proposed paradigms significantly reduced word typing time and made word typing more convenient by outputting complete words with only a few initial character inputs. The conventional spelling system required an average time of 3.47 mm per word while typing 10 random words, whereas our proposed system took an average time of 1.67 min per word, a 51.87% improvement, for the same words under the same conditions. (C) 2014 Elsevier Ltd. All rights reserved.", "paper_title": "An efficient word typing P300-BCI system using a modified T9 interface and random forest classifier", "paper_id": "WOS:000348265400004"}