{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "pon"}, {"score": 0.004608730887154718, "phrase": "simple_and_efficient_resilience_capabilities"}, {"score": 0.004459857205489101, "phrase": "two-fiber_self-healing_ring-based_local_access_passive_optical_network"}, {"score": 0.004176321608449849, "phrase": "current_tree-based_pon_architectures"}, {"score": 0.003953806321226277, "phrase": "simple_and_cost-effective_fully_distributed_resilience_capabilities"}, {"score": 0.003622088701900472, "phrase": "simple_self-healing_ethernet_pon_architecture"}, {"score": 0.0035435867326548665, "phrase": "truly_shared_lan_capability"}, {"score": 0.003429001377800258, "phrase": "main_characteristic"}, {"score": 0.003373101013123386, "phrase": "proposed_architecture"}, {"score": 0.003264010423431402, "phrase": "fully_distributed_control_plane"}, {"score": 0.0032107911131811057, "phrase": "optical_network_units"}, {"score": 0.0031240075437664314, "phrase": "onu-to-onu_communication"}, {"score": 0.0030229485340586473, "phrase": "fully_distributed_fault_detection"}, {"score": 0.0028932554846476718, "phrase": "decentralized_dynamic_bandwidth_allocation_scheme"}, {"score": 0.0028305047329728254, "phrase": "optical_line_terminator"}, {"score": 0.002454432810862053, "phrase": "active_participation"}, {"score": 0.002128220632893247, "phrase": "concurrent_double_failures"}, {"score": 0.0021049977753042253, "phrase": "trunk_and_distribution_fiber_breaks"}], "paper_keywords": [""], "paper_abstract": "This work proposes a two-fiber self-healing ring-based local access passive optical network (PON) architecture that addresses some of the limitations of current tree-based PON architectures including supporting private networking capability as well as providing simple and cost-effective fully distributed resilience capabilities against most kinds of networking failures. Specifically, this work proposes and devises a simple self-healing Ethernet PON architecture that supports a truly shared LAN capability among end users. The main characteristic of the proposed architecture is that it supports a fully distributed control plane among the optical network units (ONUs) for ONU-to-ONU communication. The control plane supports fully distributed fault detection and recovery mechanisms as well as a decentralized dynamic bandwidth allocation scheme in which the optical line terminator is excluded from both the bandwidth arbitration and fault detection and recovery processes. The proposed decentralized automatic protection switching technique is capable of protecting against both node (ONU) and fiber failures (distribution and trunk) through active participation of ONUs. This scheme enables the recovery of all network traffic including upstream, downstream, and LAN data. In addition, the proposed protection technique can protect against any combination of concurrent double failures including trunk and distribution fiber breaks and node failures. (C) 2008 Optical Society of America.", "paper_title": "Survivable broadband local access PON architecture: a new direction for supporting simple and efficient resilience capabilities", "paper_id": "WOS:000256470000009"}