{"auto_keywords": [{"score": 0.04843830651479272, "phrase": "jay"}, {"score": 0.00481495049065317, "phrase": "factorisation_calculus"}, {"score": 0.0043976740574978085, "phrase": "minimal_fundamental_model"}, {"score": 0.004367108655796158, "phrase": "intensional_computation"}, {"score": 0.004291617358806677, "phrase": "combinatory_calculus"}, {"score": 0.004246947739596565, "phrase": "special_combinator"}, {"score": 0.004101366149219787, "phrase": "internal_structure"}, {"score": 0.003798346343693706, "phrase": "structural_completeness"}, {"score": 0.0036425727071563965, "phrase": "definable_using_pattern"}, {"score": 0.0036046342610557497, "phrase": "arbitrary_normal_forms"}, {"score": 0.003444732262403694, "phrase": "structural_equality"}, {"score": 0.003048502724695561, "phrase": "converse_direction"}, {"score": 0.002832928222306059, "phrase": "aforementioned_models"}, {"score": 0.0027936239349923464, "phrase": "detailed_study"}, {"score": 0.0025779504911297236, "phrase": "faithful_encoding"}, {"score": 0.002498150733439951, "phrase": "strong_normalisation"}, {"score": 0.0024292886883655693, "phrase": "new_result"}, {"score": 0.002289180040240783, "phrase": "former_model"}, {"score": 0.002127186380459509, "phrase": "previously_defined_frameworks"}, {"score": 0.0021049977753042253, "phrase": "computational_power"}], "paper_keywords": [""], "paper_abstract": "Jay and Given-Wilson have recently introduced the Factorisation (or SF-) calculus as a minimal fundamental model of intensional computation. It is a combinatory calculus containing a special combinator, F, which is able to examine the internal structure of its first argument. The calculus is significant in that as well as being combinatorially complete it also exhibits the property of structural completeness, i.e. it is able to represent any function on terms definable using pattern matching on arbitrary normal forms. In particular, it admits a term that can decide the structural equality of any two arbitrary normal forms. Since SF-calculus is combinatorially complete, it is clearly at least as powerful as the more familiar and paradigmatic Turing-powerful computational models of lambda-calculus and Combinatory Logic. Its relationship to these models in the converse direction is less obvious, however. Jay and Given-Wilson have suggested that SF-calculus is strictly more powerful than the aforementioned models, but a detailed study of the connections between these models is yet to be undertaken. This paper begins to bridge that gap by presenting a faithful encoding of the Factorisation Calculus into the lambda-calculus preserving both reduction and strong normalisation. The existence of such an encoding is a new result. It also suggests that there is, in some sense, an equivalence between the former model and the latter. We discuss to what extent our result constitutes an equivalence by considering it in the context of some previously defined frameworks for comparing computational power and expressiveness.", "paper_title": "Encoding the Factorisation Calculus (Representing the Intensional in the Extensional)", "paper_id": "WOS:000367340100007"}