{"auto_keywords": [{"score": 0.0413051085776003, "phrase": "ehr"}, {"score": 0.010612373768516939, "phrase": "diagnostic_accuracy"}, {"score": 0.010421470602005236, "phrase": "emergency_departments"}, {"score": 0.004455409162867219, "phrase": "electronic_health_records"}, {"score": 0.004237138632255772, "phrase": "medical_staff"}, {"score": 0.004179480763003705, "phrase": "medical_information"}, {"score": 0.003814563533445401, "phrase": "severe_time_constraints"}, {"score": 0.003449718244515019, "phrase": "simulated_ed_environment"}, {"score": 0.00274472767672686, "phrase": "ehr._comparison"}, {"score": 0.002493333098814506, "phrase": "clinical_decisions"}, {"score": 0.0023067494372458427, "phrase": "correct_diagnoses"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Decision-making/makers", " Electronic medical records", " Decision analysis", " Technology assimilation"], "paper_abstract": "It is widely believed that Electronic Health Records (EHR) improve medical decision-making by enabling medical staff to access medical information stored in the system. It remains unclear, however, whether EHR indeed fulfills this claim under the severe time constraints of Emergency Departments (EDs). We assessed whether accessing EHR in an ED actually improves decision-making by clinicians. A simulated ED environment was created at the Israel Center for Medical Simulation (MSR). Four different actors were trained to simulate four specific complaints and behavior and 'consulted' 26 volunteer ED physicians. Each physician treated half of the cases (randomly) with access to EHR, and their medical decisions were compared to those where the physicians had no access to EHR. Comparison of diagnostic accuracy with and without access showed that accessing the EHR led to an increase in the quality of the clinical decisions. Physicians accessing EHR were more highly informed and thus made more accurate decisions. The percentage of correct diagnoses was higher and these physicians were more confident in their diagnoses and made their decisions faster. (C) 2015 Elsevier Inc. All rights reserved.", "paper_title": "Improving diagnostic accuracy using EHR in emergency departments: A simulation-based study", "paper_id": "WOS:000356564700004"}