{"auto_keywords": [{"score": 0.047844536713056565, "phrase": "relational_theory"}, {"score": 0.00481495049065317, "phrase": "principal_advantages"}, {"score": 0.004769182299692333, "phrase": "affordance-based_design"}, {"score": 0.0047013405841819025, "phrase": "gibson's_theory"}, {"score": 0.004439445472040688, "phrase": "relational_biology"}, {"score": 0.004397230847865867, "phrase": "relational_computer_science"}, {"score": 0.003791763445590174, "phrase": "wide_breadth"}, {"score": 0.0037199473428123175, "phrase": "engineering_design"}, {"score": 0.003597514862052876, "phrase": "precise_definition"}, {"score": 0.003176899769744057, "phrase": "charles_peirce's_logic_of_relatives"}, {"score": 0.00305762327908599, "phrase": "peirce's_ideas"}, {"score": 0.002859533151305368, "phrase": "relational_model"}, {"score": 0.002752139271586703, "phrase": "first_attempt"}, {"score": 0.0023954743066925714, "phrase": "appropriate_mathematics"}, {"score": 0.0022617389804167943, "phrase": "implicit_computability"}, {"score": 0.0021049977753042253, "phrase": "computer_science"}], "paper_keywords": ["Affordance", " Computability", " Relations"], "paper_abstract": "One of the principal advantages of affordance-based design is that Gibson's theory of affordances is a relational theory, akin to other relational approaches such as relational biology and relational computer science. The relationships between artifacts and their designers and users are of such primary importance that only a theory that is able to deal with those relationships directly appears to be sufficient for describing the wide breadth of problems in engineering design. However, there is no precise definition for what qualifies as a relational theory. In mathematics, we do find something approaching a theory of relations, dating back at least to Charles Peirce's Logic of Relatives around 1870. While rather general, Peirce's ideas on the subject laid the foundation for advances in the 20th century, including the relational model of databases. This paper is a first attempt at applying the mathematics of relations to affordances, with the aim of more precisely characterizing affordances, which heretofore have been difficult to define and, lacking appropriate mathematics, nearly impossible to subject to computation. Meanwhile, the implicit computability of affordances as relations is demonstrated by examples drawn from engineering, physics, computer science, biology, and architecture.", "paper_title": "On the computability of affordances as relations", "paper_id": "WOS:000360110200004"}