{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "dynamic_random_graph_models"}, {"score": 0.04953663923501098, "phrase": "web-like_networks"}, {"score": 0.03525727816544819, "phrase": "dynamic_random_graphs"}, {"score": 0.0037042817107563785, "phrase": "observed_statistical_properties"}, {"score": 0.003559284776569813, "phrase": "simple_stochastic_rules"}, {"score": 0.0035189057079817285, "phrase": "particular_attention"}, {"score": 0.0033811403330431897, "phrase": "mathematical_definitions"}, {"score": 0.003267342521938321, "phrase": "inductively_defined_probability_spaces"}, {"score": 0.0031037644581516973, "phrase": "recursive_procedures"}, {"score": 0.002585539416877115, "phrase": "degree_distribution"}, {"score": 0.002527150892127982, "phrase": "adjacent_nodes"}, {"score": 0.0024281181691350085, "phrase": "node-pair_distances"}, {"score": 0.002386869729952315, "phrase": "connected-component_size"}, {"score": 0.0022672718785099666, "phrase": "comprehensive_list"}, {"score": 0.0022034318550547866, "phrase": "rapidly-expanding_area"}, {"score": 0.0021049977753042253, "phrase": "wiley_periodicals"}], "paper_keywords": ["scale-free networks", " web graphs", " dynamic random graphs"], "paper_abstract": "Various random graph models have recently been proposed to replicate and explain the topology of large, complex, real-life networks such as the World Wide Web and the Internet. These models are surveyed in this article. Our focus has primarily been on dynamic random graph models that attempt to account for the observed statistical properties of web-like networks through certain dynamic processes guided by simple stochastic rules. Particular attention is paid to the equivalence between mathematical definitions of dynamic random graphs in terms of inductively defined probability spaces and algorithmic definitions of such models in terms of recursive procedures. Several techniques that have been employed for studying dynamic random graphs-both heuristic and analytic-are expounded. Each technique is illustrated through its application in analyzing various graph parameters, such as degree distribution, degree-correlation between adjacent nodes, clustering coefficient, distribution of node-pair distances, and connected-component size. A discussion of the most recent salient work and a comprehensive list of references in this rapidly-expanding area are included. (C) 2007 Wiley Periodicals, Inc.", "paper_title": "Techniques for analyzing dynamic random graph models of web-like networks: An overview", "paper_id": "WOS:000257048800001"}