{"auto_keywords": [{"score": 0.026508267998561822, "phrase": "discop_locality"}, {"score": 0.01376329418276518, "phrase": "market_overlay"}, {"score": 0.01321111341627333, "phrase": "similar_resources"}, {"score": 0.007355926446185722, "phrase": "approximate_searches"}, {"score": 0.003929613937944779, "phrase": "key_feature"}, {"score": 0.003822778117250714, "phrase": "locality_feature"}, {"score": 0.0033883824438527316, "phrase": "essential_challenge"}, {"score": 0.003151736708029235, "phrase": "new_procedure"}, {"score": 0.0030554300179552415, "phrase": "extensive_analysis"}, {"score": 0.0029114187110123105, "phrase": "discop"}, {"score": 0.00271735110571002, "phrase": "hilbert_function"}, {"score": 0.002670884656785558, "phrase": "multi-attribute_markets"}, {"score": 0.002643386043540555, "phrase": "ordered_and_mono-dimensional_space"}, {"score": 0.0025537472239953807, "phrase": "bruijn_graph"}, {"score": 0.002255431275670053, "phrase": "proposed_virtualization_method"}, {"score": 0.002224510044064184, "phrase": "uncompleted_overlays"}, {"score": 0.0022015970225369975, "phrase": "simulation_results"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["P2P computing", " P2P topologies", " Locality"], "paper_abstract": "A characteristic of Peer-to-Peer (P2P) computing networks is their huge number of different computational resources scattered across the Internet. Gathering peers into markets according to their multi-attribute computational resources makes it easier to manage these environments. This solution is known as market overlay. In this context, the closeness of the markets with similar resources, known as locality, is a key feature for ensuring good P2P resource management. Thus, the locality feature over a market overlay allows a lack of resources in a given market to be compensated quickly by any other market with similar resources, whenever these are close to each other. Consequently, locality becomes an essential challenge. This paper addresses the analysis of the locality of P2P market over-lays. According to this, a new procedure for measuring locality is applied together with an extensive analysis of some well-known structured P2P overlays. Based on this analysis, a new P2P computing architecture, named DisCoP, oriented towards optimizing locality is proposed. Our proposal gathers the peers into markets according to their computational resources. A Hilbert function is used to arrange multi-attribute markets in an ordered and mono-dimensional space and the markets are linked by means of a Bruijn graph. In order to maintain the DisCoP locality whenever the overlay is not completed, a solution based on the virtualization of markets is also proposed. Finally, the DisCoP locality is tested together with the proposed virtualization method for approximate searches over uncompleted overlays. The simulation results show that approximate searches exploit the DisCoP locality efficiently. (C) 2013 Elsevier Ltd. All rights reserved.", "paper_title": "Analyzing locality over a P2P computing architecture", "paper_id": "WOS:000328523000021"}