{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "application_contentiousness"}, {"score": 0.036983448496696034, "phrase": "application's_contentiousness"}, {"score": 0.03396640781477962, "phrase": "prior_wisdom"}, {"score": 0.03167586469306628, "phrase": "last_level_cache"}, {"score": 0.0047386923107107645, "phrase": "modern_multicores"}, {"score": 0.004701015188740582, "phrase": "runtime_systems"}, {"score": 0.004645057834614705, "phrase": "memory_resource_contention_problems"}, {"score": 0.004104269996872886, "phrase": "significant_research_effort"}, {"score": 0.00407161650109722, "phrase": "application_contention_characteristics"}, {"score": 0.003758981686762617, "phrase": "thorough_study"}, {"score": 0.003729065012001506, "phrase": "applications'_contention_characteristics"}, {"score": 0.003684634192576662, "phrase": "better_indicators"}, {"score": 0.003640730820018083, "phrase": "contention-aware_runtime_systems"}, {"score": 0.003178147973814818, "phrase": "single_indicator"}, {"score": 0.002910545717767559, "phrase": "best_indicators"}, {"score": 0.0028643622911111942, "phrase": "application's_contention_characteristics"}, {"score": 0.0026547761341670505, "phrase": "prediction_models"}, {"score": 0.00255068452076921, "phrase": "accurate_model"}, {"score": 0.002373472641477602, "phrase": "application_sensitivity"}, {"score": 0.0021049977753042253, "phrase": "real_measured_contentiousness"}], "paper_keywords": [""], "paper_abstract": "Runtime systems to mitigate memory resource contention problems on multicore processors have recently attracted much research attention. One critical component of these runtimes is the indicators to rank and classify applications based on their contention characteristics. However, although there has been significant research effort, application contention characteristics remain not well understood and indicators have not been thoroughly evaluated. In this chapter, we performed a thorough study of applications' contention characteristics to develop better indicators to improve contention-aware runtime systems. The contention characteristics are composed of an application's contentiousness, and its sensitivity to contention. We show that contentiousness and sensitivity are not strongly correlated, and contrary to prior wisdom, a single indicator is not adequate to predict both. Also, while prior wisdom has relied on last level cache miss rate as one of the best indicators to predict an application's contention characteristics, we show that depending on the workloads, it can often be misleading. We then present prediction models that consider contention in various memory resources. Our regression analysis establishes an accurate model to predict application contentiousness. The analysis also demonstrates that performance counters alone may not be sufficient to accurately predict application sensitivity to contention. In this chapter, we also present an evaluation using SPEC CPU2006 benchmarks showing that, when predicting an application's contentiousness, the linear correlation coefficient R-2 of our predictor and the real measured contentiousness is 0.834, as opposed to 0.224 when using last level cache miss rate.", "paper_title": "Understanding Application Contentiousness and Sensitivity on Modern Multicores", "paper_id": "WOS:000323889300003"}