{"auto_keywords": [{"score": 0.04730434739897977, "phrase": "pft_shift"}, {"score": 0.04449434168162259, "phrase": "pft_shifts"}, {"score": 0.033361876960801645, "phrase": "irreducible_sofic_shift"}, {"score": 0.029461089895471013, "phrase": "periodic_forbidden_list"}, {"score": 0.004653667500876187, "phrase": "time-varying_constrained_codes"}, {"score": 0.004594582559945568, "phrase": "digital_magnetic_recording_systems"}, {"score": 0.004440648141548589, "phrase": "finite_list"}, {"score": 0.004402973626416765, "phrase": "periodically_forbidden_words"}, {"score": 0.004008981656795115, "phrase": "almost_finite-type"}, {"score": 0.003974964237298886, "phrase": "aft"}, {"score": 0.003776750773624222, "phrase": "pft_shift_spaces"}, {"score": 0.0031981188104809994, "phrase": "shannon_cover"}, {"score": 0.0030645762940634614, "phrase": "pft"}, {"score": 0.0028745946327439656, "phrase": "periodic_irreducible_presentation"}, {"score": 0.0021412594173592513, "phrase": "corresponding_graph"}, {"score": 0.0021049977753042253, "phrase": "combinatorial_manner"}], "paper_keywords": ["Capacity of constrained system", " constrained code", " finite-type", " periodic constraint", " shift spaces", " sofic system"], "paper_abstract": "We study the class of periodic-finite-type (PFT) shift spaces, which can be used to model time-varying constrained codes used in digital magnetic recording systems. A PFT shift is determined by a finite list of periodically forbidden words. We show that the class of PFT shifts properly contains all finite-type (FT) shifts, and the class of almost finite-type (AFT) shifts properly contains all PFT shifts. We establish several basic properties of PFT shift spaces of a given period, and provide a characterization of such a shift in terms of properties of its Shannon cover (i.e., its unique minimal, deterministic, irreducible graph presentation). We present an algorithm that, given the Shannon cover of an irreducible sofic shift, decides whether or not is PFT in time that is quadratic in the number of states of. From any periodic irreducible presentation of a given period, we define a periodic forbidden list, unique up to conjugacy (a circular permutation) for that period, that satisfies certain minimality properties. We show that an irreducible sofic shift is PFT if and only if the list corresponding to its Shannon cover and its period is finite. Finally, we discuss methods for computing the capacity of a PFT shift from a periodic forbidden list, either by construction of a corresponding graph or in a combinatorial manner directly from the list itself.", "paper_title": "Periodic-Finite-Type Shift Spaces", "paper_id": "WOS:000291003900035"}