{"auto_keywords": [{"score": 0.044056703548264374, "phrase": "additional_information"}, {"score": 0.011097405231198374, "phrase": "relational_database"}, {"score": 0.00481495049065317, "phrase": "context-sensitive_document_ranking"}, {"score": 0.00473509474652851, "phrase": "main_research_issue"}, {"score": 0.0047035227618053965, "phrase": "ir-styled_keyword_search"}, {"score": 0.0044883089984593455, "phrase": "new_keyword_search_problem"}, {"score": 0.0042543303585113965, "phrase": "additional_context"}, {"score": 0.004169754607580288, "phrase": "application_domain"}, {"score": 0.003671663469605366, "phrase": "needed_documents"}, {"score": 0.003503497128638099, "phrase": "multi-attribute_graph"}, {"score": 0.003354223660940168, "phrase": "multi-attribute_nodes"}, {"score": 0.0032764888213402737, "phrase": "primary_key_and_foreign_key_references"}, {"score": 0.003222065787177288, "phrase": "context-sensitive_ranking"}, {"score": 0.002582731586309754, "phrase": "different_data_sources"}, {"score": 0.002514387630447547, "phrase": "similarity_match"}, {"score": 0.0023990982005125763, "phrase": "research_issues"}, {"score": 0.0021477840826122853, "phrase": "extensive_experimental_studies"}, {"score": 0.002133426416881756, "phrase": "real_datasets"}], "paper_keywords": ["document ranking", " uncertain ranking", " structure cost", " similarity"], "paper_abstract": "Ranking is a main research issue in IR-styled keyword search over a set of documents. In this paper, we study a new keyword search problem, called context-sensitive document ranking, which is to rank documents with an additional context that provides additional information about the application domain where the documents are to be searched and ranked. The work is motivated by the fact that additional information associated with the documents can possibly assist users to find more relevant documents when they are unable to find the needed documents from the documents alone. In this paper, a context is a multi-attribute graph, which can represent any information maintained in a relational database, where multi-attribute nodes represent tuples, and edges represent primary key and foreign key references among nodes. The context-sensitive ranking is related to several research issues, how to score documents, how to evaluate the additional information obtained in the context that may contribute to the document ranking, how to rank the documents by combining the scores/costs from the documents and the context. More importantly, the relationships between documents and the information stored in a relational database may be uncertain, because they are from different data sources and the relationships are determined systematically using similarity match which causes uncertainty. In this paper, we concentrate ourselves on these research issues, and provide our solution on how to rank the documents in a context where there exist uncertainty between the documents and the context. We confirm the effectiveness of our approaches by conducting extensive experimental studies using real datasets. We present our findings in this paper.", "paper_title": "Context-Sensitive Document Ranking", "paper_id": "WOS:000277548500006"}