{"auto_keywords": [{"score": 0.0494096760831155, "phrase": "business_process"}, {"score": 0.042591052876542836, "phrase": "business_process_models"}, {"score": 0.015719716506582538, "phrase": "ontology-based_similarity"}, {"score": 0.004424768776701965, "phrase": "existing_information_systems"}, {"score": 0.0038794730876377057, "phrase": "uncontrolled_maintenance"}, {"score": 0.0038431888954930083, "phrase": "reverse_engineering_techniques"}, {"score": 0.003807242767474929, "phrase": "well-designed_business_processes"}, {"score": 0.003666776809252461, "phrase": "harmful_quality_faults"}, {"score": 0.003531474887552889, "phrase": "clustering_techniques"}, {"score": 0.0034171734618737436, "phrase": "quality_faults"}, {"score": 0.0030239842475439814, "phrase": "formal_ontologies"}, {"score": 0.002953711377604328, "phrase": "essential_concepts"}, {"score": 0.002564985233317994, "phrase": "clustering_algorithm"}, {"score": 0.0024241817763927163, "phrase": "legacy_information_systems"}, {"score": 0.0023566987138026285, "phrase": "principal_contribution"}, {"score": 0.0022589720760078274, "phrase": "ontology-based_similarity_function"}, {"score": 0.0021049977753042253, "phrase": "john_wiley"}], "paper_keywords": ["conceptual modeling", " ontologies", " clustering", " classification", " and association rules", " business process", " empirical studies"], "paper_abstract": "Reverse engineering of business process enables business process to be discovered and retrieved from existing information systems, which embed many business rules that are not available anywhere else. These techniques are especially useful when business process models are unavailable, outdated, or misaligned because of uncontrolled maintenance. Reverse engineering techniques obtain well-designed business processes, but these are often retrieved with harmful quality faults as a consequence of the abstraction. Clustering techniques are then applied to reduce these quality faults and improve the understandability and modifiability of business process models. Regrettably, the most challenging concern is how to determine the similarity between two business activities to be clustered. Formal ontologies help to represent the essential concepts and constraints of a universe of discourse and determine the similarity in accordance with the given ontology. This paper shows how to compute and use the ontology-based similarity within a clustering algorithm whose aim is to improve the quality of business process models previously obtained from legacy information systems by reverse engineering. The principal contribution of this paper is the usage of an ontology-based similarity function and its application to 43 business process models retrieved from four real-life information systems. Copyright (c) 2014 John Wiley & Sons, Ltd.", "paper_title": "Ontology-based similarity applied to business process clustering", "paper_id": "WOS:000346649500004"}