{"auto_keywords": [{"score": 0.046427635794678734, "phrase": "large_projects"}, {"score": 0.0365844141589355, "phrase": "small_projects"}, {"score": 0.027260253463655425, "phrase": "small_and_large_projects"}, {"score": 0.0045599093158915326, "phrase": "commercial_company"}, {"score": 0.004212759658511567, "phrase": "investors'_behaviors"}, {"score": 0.004059219816495496, "phrase": "profit_ceilings"}, {"score": 0.0037039021744127783, "phrase": "decision_makers"}, {"score": 0.0034301827665034583, "phrase": "current_trend"}, {"score": 0.0034047882921717913, "phrase": "manufacturing_operations"}, {"score": 0.0033879628186273625, "phrase": "industrialized_nations"}, {"score": 0.0033628798540670927, "phrase": "world_countries"}, {"score": 0.0033050703534275717, "phrase": "foreseeable_future"}, {"score": 0.0032643852908042044, "phrase": "international_transportation_costs"}, {"score": 0.0032241994368246065, "phrase": "global_economic_system"}, {"score": 0.0030988889679192965, "phrase": "higher_the_level"}, {"score": 0.00308357048262018, "phrase": "ceo's_initial_ability"}, {"score": 0.0028911669203979156, "phrase": "ceo's_additional_effort"}, {"score": 0.002834409847642238, "phrase": "non-pecuniary_benefits"}, {"score": 0.0027787638791664663, "phrase": "additional_bargaining_power"}, {"score": 0.002624776882212556, "phrase": "large_project"}, {"score": 0.002605329434787829, "phrase": "glass_ceiling"}, {"score": 0.0022845142096889655, "phrase": "profit_potential"}, {"score": 0.002184781393357245, "phrase": "human_behaviors"}, {"score": 0.0021312639231739175, "phrase": "different_scales"}, {"score": 0.0021049977753042253, "phrase": "theoretically_reliable_distinction"}], "paper_keywords": ["Cybernetics", " Shareholders", " CEO's bargaining power", " Glass ceiling of profit", " Capital market", " Management"], "paper_abstract": "Purpose - This paper seeks to investigate the roles of small and large projects in the development and evolution of a commercial company and why companies with a history of taking on large projects tend to eventually fail with large projects. Design/methodology/approach - In terms of small and large projects, analytic models are established to: describe investors' behaviors; depict the dynamics between CEOs and their boards of directors; and reveal how profit ceilings exist for large projects. Findings - After making the concepts of small and large projects precise, the paper establishes several analytic models for the investigation of the behaviors of various market participants. Then, it develops an explanation for why some decision makers like to take on large projects and why most new startups fail because of a lack of funds. A theory is given to show how investors value small projects more than large projects and why the current trend of moving manufacturing operations from industrialized nations to third world countries does not seem reversible in the foreseeable future, as long as international transportation costs stay low and the global economic system stays open and competitive. Among other results, it is also shown that: the higher the level the CEO's initial ability is, the more likely he would initiate and manage small projects, and the more labor effort he will devote to these projects; the CEO's additional effort spent on the small projects helps him gain non-pecuniary benefits, which he can use to gain additional bargaining power over the board; to realistically maximize his private utility, the CEO would spend more of his time and effort on small projects; each large project has a glass ceiling for its maximum level of profits; companies taking on large projects cannot afford to devote much of their scarce resources to expand their market share and appearance; and to increase their profit potential, these companies have to control their spending so that their profit can be maximized by lowering their unit selling price p(s); for small projects, the profit potential for the company is unlimited. Originality/value - This work is the first to employ models of human behaviors to research the interactions and dynamics between projects of different scales. It provides a theoretically reliable distinction between small and large projects.", "paper_title": "Small and large projects: their dynamics and which ones to take", "paper_id": "WOS:000298127700010"}