{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "vicarious_learning"}, {"score": 0.0047689174754929195, "phrase": "collaborative_lessons_learned_programs"}, {"score": 0.004458722048888919, "phrase": "others'_past_actions"}, {"score": 0.0041287394089001405, "phrase": "increasing_challenge"}, {"score": 0.003878625406105021, "phrase": "good_and_adverse_experiences"}, {"score": 0.0036788184374592706, "phrase": "disconnected_groups"}, {"score": 0.003325410433297401, "phrase": "organizational_effectiveness"}, {"score": 0.0032777653153451265, "phrase": "costly_errors"}, {"score": 0.0030642636185693054, "phrase": "antecedent_learning"}, {"score": 0.0027965187255008647, "phrase": "human_intermediaries"}, {"score": 0.002527654365712841, "phrase": "vicarious_learning_and_collaborative_lessons_learned_programs"}, {"score": 0.00247944491239733, "phrase": "lessons_learned_process_model"}, {"score": 0.00242047093248845, "phrase": "knowledge_creation"}, {"score": 0.0021049977753042253, "phrase": "human_collaboration"}], "paper_keywords": ["case studies", " information sharing", " survey", " vicarious learning"], "paper_abstract": "Vicarious learning allows an observer to improve his decision making and modify his actions through observing others' past actions and resulting consequences. As organizations become larger and more disconnected, it becomes an increasing challenge to meaningfully share lessons learned allowing people to learn vicariously from both good and adverse experiences of others. In an effort to promote vicarious learning across disconnected groups, organizations create lessons learned programs to share information. The goal of a lessons learned program is to improve organizational effectiveness by avoiding costly errors \"before\" reoccurring in other parts of the organization. This type of antecedent learning requires collaboration between the people at the source and those receiving the lesson, as well as any human intermediaries involved with the process, to amplify the benefits of lessons learned. This paper makes explicit the connection between vicarious learning and collaborative lessons learned programs and develops a lessons learned process model using the theory of knowledge creation. The evaluation of four case studies reveals that a lessons learned program operates most effectively when the information is targeted to recipients who would find it useful and when human collaboration is acknowledged and supported by intermediaries.", "paper_title": "Supporting vicarious learning with collaborative lessons learned programs", "paper_id": "WOS:000241438600003"}