{"auto_keywords": [{"score": 0.03983296937316375, "phrase": "residual_norm"}, {"score": 0.017465649025029544, "phrase": "jfnk_method"}, {"score": 0.007887197194299608, "phrase": "standard_solver"}, {"score": 0.00481495049065317, "phrase": "numerical_convergence"}, {"score": 0.00478768880281476, "phrase": "viscous-plastic_sea_ice_models"}, {"score": 0.004747084029482977, "phrase": "jacobian-free_newton-krylov_method"}, {"score": 0.004666899848184808, "phrase": "jacobian-free_newton-krylov"}, {"score": 0.004562080863250721, "phrase": "sea_ice_momentum_equation"}, {"score": 0.004485007756526626, "phrase": "jfnk"}, {"score": 0.0044092305407288064, "phrase": "system_matrix"}, {"score": 0.0043719608155311325, "phrase": "jacobian"}, {"score": 0.0040146809403906495, "phrase": "convergence_rate"}, {"score": 0.0038800995000915434, "phrase": "slow_convergence"}, {"score": 0.0036657110980445416, "phrase": "fast_phase"}, {"score": 0.003634587156159668, "phrase": "computational_gain"}, {"score": 0.003542786326740931, "phrase": "existing_vp_models"}, {"score": 0.003502731108174349, "phrase": "required_drop"}, {"score": 0.003290360233643709, "phrase": "spatial_resolution"}, {"score": 0.003271702219797911, "phrase": "termination_criterion"}, {"score": 0.003207225752446834, "phrase": "preconditioned_generalized_minimum_residual_method"}, {"score": 0.0028139168128067343, "phrase": "increasing_spatial_resolution"}, {"score": 0.002790004829699627, "phrase": "velocity_gradients"}, {"score": 0.0026963662375234124, "phrase": "nonlinear_solvers"}, {"score": 0.0025040966350544135, "phrase": "debatable_problem"}, {"score": 0.002461705602574723, "phrase": "large_required_drops"}, {"score": 0.0022474211029652313, "phrase": "jfnk_solver"}, {"score": 0.002215663255682209, "phrase": "line_search_method"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Sea ice", " Viscous-plastic rheology", " Newton-Krylov method", " Numerical convergence"], "paper_abstract": "We have implemented the Jacobian-free Newton-Krylov (JFNK) method to solve the sea ice momentum equation with a viscous-plastic (VP) formulation. The JFNK method has many advantages: the system matrix (the Jacobian) does not need to be formed and stored, the method is parallelizable and the convergence can be nearly quadratic in the vicinity of the solution. The convergence rate of our JFNK implementation is characterized by two phases: an initial phase with slow convergence and a fast phase for which the residual norm decreases significantly from one Newton iteration to the next. Because of this fast phase, the computational gain of the JFNK method over the standard solver used in existing VP models increases with the required drop in the residual norm (termination criterion). The JFNK method is between 3 and 6.6 times faster (depending on the spatial resolution and termination criterion) than the standard solver using a preconditioned generalized minimum residual method. Resolutions tested in this study are 80, 40, 20 and 10 km. For a large required drop in the residual norm, both JFNK and standard solvers sometimes do not converge. The failure rate for both solvers increases as the grid is refined but stays relatively small (less than 23% of failures). With increasing spatial resolution, the velocity gradients (sea ice deformations) get more and more important. Nonlinear solvers such as the JFNK method tend to have difficulties when there are such sharp structures in the solution. This lack of robustness of both solvers is however a debatable problem as it mostly occurs for large required drops in the residual norm. Furthermore, when it occurs, it usually affects only a few grid cells, i.e., the residual is small for all the velocity components except in very localized regions. Globalization approaches for the JFNK solver, such as the line search method, have not yet proven to be successful. Further investigation is needed. (C) 2009 Elsevier Inc. All rights reserved.", "paper_title": "Improving the numerical convergence of viscous-plastic sea ice models with the Jacobian-free Newton-Krylov method", "paper_id": "WOS:000275966000006"}