{"auto_keywords": [{"score": 0.04930986456658363, "phrase": "chinese"}, {"score": 0.004586531354697466, "phrase": "comprehensive_online_unconstrained_chinese_handwriting_dataset"}, {"score": 0.004144723510171449, "phrase": "larger_vocabularies"}, {"score": 0.003932003833923186, "phrase": "unconstrained_online_chinese_handwriting_recognition"}, {"score": 0.0037150687722055727, "phrase": "different_vocabularies"}, {"score": 0.0026316112429083235, "phrase": "\"the_contemporary_chinese_dictionary"}, {"score": 0.0025892330566358503, "phrase": "pinyin"}, {"score": 0.002387337550919433, "phrase": "smart_phones"}, {"score": 0.0023680327896318915, "phrase": "touch_screens"}, {"score": 0.0022923586577645143, "phrase": "total_number"}, {"score": 0.0022738201751000865, "phrase": "character_samples"}, {"score": 0.0022011501095573747, "phrase": "first_publicly_available_large_vocabulary_online_chinese_handwriting_database"}, {"score": 0.0021049977753042253, "phrase": "evaluation_results"}], "paper_keywords": ["SCUT-COUCH", " Online handwritten character database", " Handwritten Chinese word samples", " Handwritten Pinyin dataset", " Benchmark evaluation"], "paper_abstract": "A comprehensive online unconstrained Chinese handwriting dataset, SCUT-COUCH2009, is introduced in this paper. As a revision of SCUT-COUCH2008 [1], the SCUT-COUCH2009 database consists of more datasets with larger vocabularies and more writers. The database is built to facilitate the research of unconstrained online Chinese handwriting recognition. It is comprehensive in the sense that it consists of 11 datasets of different vocabularies, named GB1, GB2, TradGB1, Big5, Pinyin, Letters, Digit, Symbol, Word8888, Word17366 and Word44208. In particular, the SCUT-COUCH2009 database contains handwritten samples of 6,763 single Chinese characters in the GB2312-80 standard, 5,401 traditional Chinese characters of the Big5 standard, 1,384 traditional Chinese characters corresponding to the level 1 characters of the GB2312-80 standard, 8,888 frequently used Chinese words, 17,366 daily-used Chinese words, 44,208 complete words from the Fourth Edition of \"The Contemporary Chinese Dictionary\", 2,010 Pinyin and 184 daily-used symbols. The samples were collected using PDAs (Personal Digit Assistant) and smart phones with touch screens and were contributed by more than 190 persons. The total number of character samples is over 3.6 million. The SCUT-COUCH2009 database is the first publicly available large vocabulary online Chinese handwriting database containing multi-type character/word samples. We report some evaluation results on the database using state-of-the-art recognizers for benchmarking.", "paper_title": "SCUT-COUCH2009-a comprehensive online unconstrained Chinese handwriting database and benchmark evaluation", "paper_id": "WOS:000287757000007"}