{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "side-channel_attacks"}, {"score": 0.008745343401283684, "phrase": "dfa_attacks"}, {"score": 0.004747714939490445, "phrase": "block_cipher_cryptanalysis"}, {"score": 0.00463229351153731, "phrase": "amplified_side-channel_attacks"}, {"score": 0.0045355866228818514, "phrase": "block_cipher_cryptanalysis_techniques"}, {"score": 0.004287415750101536, "phrase": "special_characteristics"}, {"score": 0.003968112038249246, "phrase": "cipher_cryptanalysis_techniques"}, {"score": 0.0039264465913491356, "phrase": "particular_type"}, {"score": 0.0038989120088094185, "phrase": "side-channel_attack"}, {"score": 0.0038579703525471985, "phrase": "differential_fault_attack"}, {"score": 0.003672500644750565, "phrase": "aes_key_schedule"}, {"score": 0.003633927813203731, "phrase": "intermediate_states"}, {"score": 0.0035957835190358984, "phrase": "aes"}, {"score": 0.0035082436540296406, "phrase": "square_attacks"}, {"score": 0.003483631502938922, "phrase": "impossible_differential_cryptanalysis"}, {"score": 0.003434922209075514, "phrase": "remaining_rounds"}, {"score": 0.00304737045343781, "phrase": "dfa._purther"}, {"score": 0.0030153435879168634, "phrase": "previous_dfa_attacks"}, {"score": 0.002693919110230191, "phrase": "middle_rounds"}, {"score": 0.0026190518142076608, "phrase": "existing_results"}, {"score": 0.002398208426903865, "phrase": "costly_countermeasure"}], "paper_keywords": ["attacks and countermeasures in hardware and software", " side-channel attacks", " cryptanalysis", " fault attacks", " Advanced Encryption Standard"], "paper_abstract": "We introduce the notion of amplified side-channel attacks, i.e. the application of block cipher cryptanalysis techniques to amplify effects exploitable by side-channel attacks. Such an approach is advantageous since it fully exploits the special characteristics of each technique in situations where each thrives the most. As an example, we consider the integration of block cipher cryptanalysis techniques into a particular type of side-channel attack, the differential fault attack (DFA). In more detail, we apply the DFA on the AES key schedule or on intermediate states within the AES and then exploit distinguishers based on Square attacks and impossible differential cryptanalysis to cover the remaining rounds. The use of techniques from conventional differential cryptanalysis in DFAs is not new; however, to the best of our knowledge, more advanced differential-like attack techniques have so far not been applied in collaboration with DFA. Purther, while previous DFA attacks can only be mounted if faults are induced in the last or first (but with more restrictions) few rounds, our attacks alternatively show that even when faults are induced into some middle rounds, the DFA attacks still work, complementing existing results in literature; and thus showing that DFA attacks work regardless of where faults are induced. This is of importance because redundancy is a costly countermeasure against DFA and thus it is vital to study which rounds have to be protected. We hope that this completes the picture on the applicability of DFAs to block ciphers, and motivates thoughts into applying other advanced block cipher cryptanalysis techniques into other types of side-channel attacks.", "paper_title": "Amplifying side-channel attacks with techniques from block cipher cryptanalysis", "paper_id": "WOS:000237245000010"}