{"auto_keywords": [{"score": 0.04419846536070138, "phrase": "pattern_language"}, {"score": 0.00481495049065317, "phrase": "requirements_models"}, {"score": 0.0046676969718111765, "phrase": "software_development"}, {"score": 0.003802135020791801, "phrase": "story_line"}, {"score": 0.003135356056324338, "phrase": "conceptual_model"}, {"score": 0.0029462012558267863, "phrase": "target_model"}, {"score": 0.0027172101552870973, "phrase": "scenario_aspects"}, {"score": 0.002521623057264411, "phrase": "cognitive_science_and_requirements_engineering"}, {"score": 0.0023990982005125763, "phrase": "theoretical_foundation"}, {"score": 0.0022825131641434964, "phrase": "detailed_description"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Multi-perspective scenario modeling", " Scenario metamodel", " Scenario models", " Scenario-to-model transformation", " Patterns", " Pattern languages"], "paper_abstract": "Despite their important role in software development, scenarios suffer from several major drawbacks. To remedy these drawbacks, this paper presents a pattern language as means of connection between scenarios and their target models. The pattern language contains four patterns: Establishing the Story Line, Elaborating Things that Change, Identifying Agents and Their Interactions, and Unraveling the Goal and its Subgoals. Each of these patterns connects one aspect of a given scenario to a conceptual model and offers guidelines for converting this aspect into a target model. Together, these four patterns transform a scenario into four interrelated requirements models. These scenario aspects are identified according to the concepts of scenarios used in both Cognitive Science and Requirements Engineering. This paper first lays out the theoretical foundation of this pattern language and then gives a detailed description, illustration and assessment of this language. (C) 2013 Elsevier Ltd. All rights reserved.", "paper_title": "PLANT: A pattern language for transforming scenarios into requirements models", "paper_id": "WOS:000326210500002"}