{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "circuit_topology"}, {"score": 0.008008734271580432, "phrase": "circuit_c"}, {"score": 0.004775726266706856, "phrase": "unbounded_reverse_engineers"}, {"score": 0.00447316895126645, "phrase": "software_protection"}, {"score": 0.0044005599565517875, "phrase": "negative_results"}, {"score": 0.0043114466990006334, "phrase": "barak_et_al"}, {"score": 0.004206879557938045, "phrase": "universal_obfuscators"}, {"score": 0.003556873173040169, "phrase": "circuit_obfuscation"}, {"score": 0.003513443975425428, "phrase": "weaker_assumption"}, {"score": 0.002970260970134645, "phrase": "resulting_circuit_c"}, {"score": 0.0027253441561528495, "phrase": "reverse_engineer_attempts"}, {"score": 0.002480154140902474, "phrase": "efficient_circuit_topology_obfuscation_algorithms"}, {"score": 0.0021662983565317283, "phrase": "circuit_size"}, {"score": 0.002148604369150115, "phrase": "input_length"}, {"score": 0.002131054594847684, "phrase": "output_length"}, {"score": 0.0021049977753042253, "phrase": "information-theoretic_sense"}], "paper_keywords": [""], "paper_abstract": "Circuit/program obfuscation, if possible, would have a number of applications to cryptography and software protection. Unfortunately, negative results have been given by Barak et al. [1] that universal obfuscators (for circuits or programs) do not exist. In other words, given a circuit, an adversary might obtain more information (e.g. core algorithm) other than its input-output behavior. In this paper, we discuss the problem of circuit obfuscation under a weaker assumption where the adversary knows only partial information regarding the circuit, namely, the circuit topology (i.e., all information regarding the circuit except the functionalities of its gates), then how can C be obfuscated such that the circuit topology of the resulting circuit C ' (denoted by Topo(cl)) discloses nothing substantial? In practice, the scenario corresponds to that a reverse engineer attempts to illegally copy a circuit by passively analyzing how its gates are inter-wired. Our results are quite positive: there exist efficient circuit topology obfuscation algorithms that transform every circuit C with size s to circuit C ' with the same input-output behavior, size s.log(3) s and depth s.log(log s), where Topo(C ') reveals nothing more than circuit size, input length and output length in an information-theoretic sense.", "paper_title": "Hiding circuit topology from unbounded reverse engineers", "paper_id": "WOS:000239474000015"}