{"auto_keywords": [{"score": 0.034134897203946885, "phrase": "tricluster"}, {"score": 0.006483881863871505, "phrase": "new_algorithm"}, {"score": 0.00481495049065317, "phrase": "gene-sample-time_microarray_data"}, {"score": 0.003626000977962191, "phrase": "coherent_clusters"}, {"score": 0.0034342161742428666, "phrase": "useful_phenotypes"}, {"score": 0.0033929894721242367, "phrase": "potential_genes"}, {"score": 0.00313678764831236, "phrase": "cst"}, {"score": 0.0028477727736832283, "phrase": "cst_microarray_data"}, {"score": 0.002222717552124615, "phrase": "experimental_results"}, {"score": 0.0021827653135510225, "phrase": "real-world_microarray_dataset"}, {"score": 0.0021049977753042253, "phrase": "proposed_new_algorithm"}], "paper_keywords": [""], "paper_abstract": "Clustering is an important technique in microarray data analysis, and mining three-dimensional (3D) clusters in gene-sample-time (simply CST) microarray data is emerging as a hot research topic in this area. A 3D cluster consists of a subset of genes that are coherent on a subset of samples along a segment of time series. This kind of coherent clusters may contain information for the users to identify useful phenotypes, potential genes related to these phenotypes and their expression rules. TRICLUSTER is the state-of-the-art 3D clustering algorithm for CST microarray data. In this paper, we propose a new algorithm to mine 3D clusters over CST microarray data. We term the new algorithm gTRICLUSTER because it is based on a more general 3D cluster model than the one that TRICLUSTER is based on. gTRICLUSTER can find more biologically meaningful coherent gene clusters than TRICLUSTER can do. It also outperforms TRICLUSTER in robustness to noise. Experimental results on a real-world microarray dataset validate the effectiveness of the proposed new algorithm.", "paper_title": "gTRICLUSTER: A more general and effective 3D clustering algorithm for gene-sample-time microarray data", "paper_id": "WOS:000237241100006"}