{"auto_keywords": [{"score": 0.028059855130987493, "phrase": "workflow_applications"}, {"score": 0.014505357886954326, "phrase": "grids"}, {"score": 0.00481495049065317, "phrase": "grid_workflow_applications"}, {"score": 0.0046928556063004214, "phrase": "grid_technologies"}, {"score": 0.004573842508130535, "phrase": "large_computing_capability"}, {"score": 0.004515467468684217, "phrase": "large-scale_workflow_applications"}, {"score": 0.004363401436068803, "phrase": "troublesome_problem"}, {"score": 0.0040223714916651845, "phrase": "serious_effect"}, {"score": 0.0037238193456845124, "phrase": "grid_systems"}, {"score": 0.0036448787596988423, "phrase": "first_step"}, {"score": 0.003477029725200912, "phrase": "significant_impact"}, {"score": 0.003316884515934182, "phrase": "current_scheduling_algorithms"}, {"score": 0.002904494666565991, "phrase": "grid"}, {"score": 0.0028302635493019867, "phrase": "traditional_scheduling_algorithms"}, {"score": 0.0023636038312749245, "phrase": "smds_algorithm"}, {"score": 0.00218789980093445, "phrase": "different_schedules"}, {"score": 0.0021599099979586946, "phrase": "different_requirements"}, {"score": 0.0021231452870210965, "phrase": "weight_parameter"}], "paper_keywords": ["grid", " scheduling algorithms", " makespan", " survivability", " scientific workflow"], "paper_abstract": "With the development of Grid technologies, scientists and engineers obtain large computing capability to execute large-scale workflow applications. However the Grids also bring a troublesome problem. In the dynamic, complex and unbounded Grid systems, malicious attacks and hardware faults, which are inevitable, can have a serious effect on the execution of applications. Therefore it is necessary to enhance survivability of the applications in Grid systems. Scheduling is the first step of executing applications on Grids, and can have a significant impact on survivability of the applications. Unfortunately, most of current scheduling algorithms only address the objective of maximizing the performance of applications, but ignore survivability of applications. In this paper, we devise a survivability and makespan driven scheduling (SMDS) algorithm for scientific workflow applications in Grid systems. Different from the traditional scheduling algorithms, this algorithm addresses the objectives of maximizing the survivability and minimizing the makespan of workflow applications at the same time, and can trade off the survivability against the makespan of workflow applications. Many simulation experiments are taken to evaluate the performance of the SMDS algorithm. The results confirm that the algorithm can enhance survivability of the workflow applications, and can produce different schedules to meet different requirements by adjusting the weight parameter in its cost function.", "paper_title": "Survivability and makespan driven scheduling algorithm for grid workflow applications", "paper_id": "WOS:000248237300022"}