{"auto_keywords": [{"score": 0.01527526358446502, "phrase": "knowledge_creation"}, {"score": 0.01051092630300886, "phrase": "knowledge_conversion"}, {"score": 0.0039685202936462815, "phrase": "empirical_analysis"}, {"score": 0.00393032656248792, "phrase": "structural_equation_modelling"}, {"score": 0.003637669525737665, "phrase": "positive_direct_and_indirect_influences"}, {"score": 0.0033830587647810132, "phrase": "company's_performance"}, {"score": 0.00328625950643742, "phrase": "structural_equation_model"}, {"score": 0.0032546105164772995, "phrase": "useful_information"}, {"score": 0.002997572637726648, "phrase": "better_processes"}, {"score": 0.0029117710453690827, "phrase": "organization's_concepts"}, {"score": 0.002855934865505357, "phrase": "flexibility_programs"}, {"score": 0.002814759530655965, "phrase": "functional_and_self-directed_teams"}, {"score": 0.0025181367444581993, "phrase": "changing_environments"}, {"score": 0.0021049977753042253, "phrase": "organizational_performance"}], "paper_keywords": ["Spain", " Knowledge creation", " Knowledge management", " Organizational performance", " Information dissemination", " Flexibility of distribution of information"], "paper_abstract": "Purpose - The purpose of this paper is to increase knowledge about the four modes of knowledge conversion (SECI model: Socialization, Externalization, Combination, Internalization) and their impact on flexibility of distribution of information and performance. Design/methodology/approach - Based on a survey of 284 Spanish firms, the paper performs an empirical analysis using structural equation modelling. Findings - The results of the research confirm that the four modes of knowledge conversion have positive direct and indirect influences on the flexibility of distribution of information in the organization and therefore improve the company's performance. Practical implications - The structural equation model provides useful information for managers and researchers concerning how knowledge creation enhances flexibility and performance of the organization. Through better processes and tools for updating the organization's concepts or methods, flexibility programs, cross functional and self-directed teams, autonomy, participation, cooperation and coordination in the firm improve the flow of information and performance and reduce uncertainty in changing environments. Originality/value - The paper illustrates the effects of the four modes of knowledge creation on flexibility of distribution of information and demonstrates that these four modes of knowledge creation affect flexibility of distribution of information positively, thereby improving organizational performance.", "paper_title": "Knowledge creation and flexibility of distribution of information", "paper_id": "WOS:000302509300009"}