{"auto_keywords": [{"score": 0.012522993096132154, "phrase": "malicious_activities"}, {"score": 0.00481495049065317, "phrase": "new_graph-based_approach"}, {"score": 0.004647911247507267, "phrase": "computer_network"}, {"score": 0.004534428070512318, "phrase": "temporal_co-occurrences"}, {"score": 0.004315670715009727, "phrase": "botnet_architectures"}, {"score": 0.004151188559520802, "phrase": "practically_all_aspects"}, {"score": 0.003978866233891427, "phrase": "online_bot_population"}, {"score": 0.003950846696972114, "phrase": "bot_lifetimes"}, {"score": 0.0035283552859817764, "phrase": "infected_computers"}, {"score": 0.003334309053314909, "phrase": "particular_importance"}, {"score": 0.0032991276152705934, "phrase": "edge_weights"}, {"score": 0.003229870860371533, "phrase": "temporal_co"}, {"score": 0.0030847461428168614, "phrase": "unique_advantage"}, {"score": 0.0029357204796552653, "phrase": "graph-partitioning_algorithms"}, {"score": 0.0028842551358494823, "phrase": "different_botnets"}, {"score": 0.0028137115734915624, "phrase": "multiple_botnets"}, {"score": 0.002658863179011018, "phrase": "simulated_botnets"}, {"score": 0.0025846562485378247, "phrase": "new_unified_temporal_botnet_model"}, {"score": 0.0023079225317714815, "phrase": "real_network"}, {"score": 0.002196342933346204, "phrase": "varying_conditions"}, {"score": 0.0021731423856364003, "phrase": "high_degree"}, {"score": 0.0021049977753042253, "phrase": "john_wiley"}], "paper_keywords": ["botnet detection", " botnet modeling", " network intrusion", " graph partitioning"], "paper_abstract": "We present a new graph-based approach for the detection and isolation of botnets in a computer network. Our approach depends primarily on the temporal co-occurrences of malicious activities across the computers in a network and is independent of botnet architectures and the means used for their command and control. As practically all aspects of how a botnet manifests itself in a networksuch as the online bot population, bot lifetimes, and the duration and the choice of malicious activities ordered by the bot mastercan be expected to vary significantly with time, our approach includes mechanisms that allow the graph representing the infected computers to evolve with time. With regard to how such a graph varies with time, of particular importance are the edge weights that are derived from the temporal co-occurrences of malicious activities at the endpoints of the edges. A unique advantage of our graph-based representation of the infected computers is that it allows us to use graph-partitioning algorithms to separate out the different botnets when a network is infected with multiple botnets at the same time. We have validated our approach by applying it to the isolation of simulated botnets, with the simulations based on a new unified temporal botnet model that incorporates the current best understanding about how botnets behave, about the lifetimes of bots, and about the growth and decay of botnets. We also validate our algorithm on real network traces. Our results indicate that our framework can isolate botnets in a network under varying conditions with a high degree of accuracy. Copyright (c) 2012 John Wiley & Sons, Ltd.", "paper_title": "A graph-theoretic framework for isolating botnets in a network", "paper_id": "WOS:000363086500001"}