{"auto_keywords": [{"score": 0.04371410536469403, "phrase": "olc"}, {"score": 0.014147835727118571, "phrase": "organizational_learning_culture"}, {"score": 0.00481495049065317, "phrase": "south_korean_firms"}, {"score": 0.0044624036486300865, "phrase": "innovativeness_improvement"}, {"score": 0.0036801209922064817, "phrase": "in-depth_approaches"}, {"score": 0.003606178185661875, "phrase": "higher-level_organizational_learning"}, {"score": 0.00349803055484394, "phrase": "organizational_learning_process"}, {"score": 0.003410380718649286, "phrase": "information_acquisition"}, {"score": 0.0033759367489122716, "phrase": "information_interpretation"}, {"score": 0.0033249197885613937, "phrase": "behavioral_and_cognitive_changes"}, {"score": 0.003258090521354736, "phrase": "competing_values"}, {"score": 0.0028697077879305064, "phrase": "innovative_culture"}, {"score": 0.002414544068560716, "phrase": "structural_equation_modeling"}, {"score": 0.002203509076886664, "phrase": "moderate_positive_indirect_impact"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Organizational learning culture", " Competing values framework", " Innovation", " Innovative culture", " Structural equation modeling"], "paper_abstract": "The aim of this paper is to present and test a model of innovativeness improvement based on the impact of organizational learning culture. The concept of organizational learning culture (OLC) is presented and defined as a set of norms and values about the functioning of an organization. They should support systematic, in-depth approaches aimed at achieving higher-level organizational learning. The elements of an organizational learning process that we use are information acquisition, information interpretation, and behavioral and cognitive changes. Within the competing values framework OLC covers some aspects of all four different types of cultures: group, developmental, hierarchical, and rational. Constructs comprising innovativeness are innovative culture and innovations, which are made of technical (product and service) and administrative (process) innovations. We use data from 201 Korean companies employing more than 50 people. The impact of OLC on innovations empirically tested via structural equation modeling (SEM). The results show that OLC has a very strong positive direct effect on innovations as well as moderate positive indirect impact via innovative culture. (C) 2010 Elsevier Ltd. All rights reserved.", "paper_title": "Organizational learning culture, innovative culture and innovations in South Korean firms", "paper_id": "WOS:000278424600033"}