{"auto_keywords": [{"score": 0.02947935668514954, "phrase": "exact_solution"}, {"score": 0.02895225780934217, "phrase": "mpw_problem"}, {"score": 0.0047559432344272, "phrase": "probabilistic_logic_programs"}, {"score": 0.00430907756010007, "phrase": "possible_world"}, {"score": 0.004230068512904886, "phrase": "highest_probability"}, {"score": 0.003880017219275826, "phrase": "exponentially_many_linear_programs"}, {"score": 0.0037159680715717056, "phrase": "exponential_size"}, {"score": 0.0029207251108325006, "phrase": "\"reduced\"_linear_program"}, {"score": 0.002831894638104635, "phrase": "one-one_correspondence"}, {"score": 0.002518227743688769, "phrase": "monte_carlo_sampling_approach"}, {"score": 0.0024116163689723354, "phrase": "quick_approximation"}, {"score": 0.002367315484467406, "phrase": "reduced_linear_program"}], "paper_keywords": ["Probabilistic logic programming", " Imprecise probabilities", " Most probable worlds"], "paper_abstract": "The \"Most Probable World\" (MPW) problem in probabilistic logic programming (PLPs) is that of finding a possible world with the highest probability. Past work has shown that this problem is computationally intractable and involves solving exponentially many linear programs, each of which is of exponential size. In this paper, we study what happens when the user focuses his interest on a set of atoms in such a PLP. We show that we can significantly reduce the number of worlds to be considered by defining a \"reduced\" linear program whose solution is in one-one correspondence with the exact solution to the MPW problem. However, the problem is still intractable. We develop a Monte Carlo sampling approach that enables us to build a quick approximation of the reduced linear program that allows us to estimate (inexactly) the solution to the MPW problem. We show experimentally that our approach works well in practice, scaling well to problems where the exact solution is intractable to compute.", "paper_title": "Focused most probable world computations in probabilistic logic programs", "paper_id": "WOS:000304153500002"}