{"auto_keywords": [{"score": 0.0481292531652488, "phrase": "bci"}, {"score": 0.015719595279557932, "phrase": "large_virtual_environments"}, {"score": 0.013995967868971317, "phrase": "complex_interaction_tasks"}, {"score": 0.009285645654906067, "phrase": "art_method"}, {"score": 0.008996480614698299, "phrase": "low-level_commands"}, {"score": 0.004756463788853192, "phrase": "brain-computer_interface_based"}, {"score": 0.004641603150887887, "phrase": "brain-computer_interfaces"}, {"score": 0.004585212379675535, "phrase": "interaction_devices"}, {"score": 0.004452641437293878, "phrase": "brain_activity"}, {"score": 0.004345085569121329, "phrase": "new_interaction_technique"}, {"score": 0.0041174821422410544, "phrase": "imagined_movements"}, {"score": 0.003988611346253368, "phrase": "high-level_mental_commands"}, {"score": 0.0038827100184187805, "phrase": "complex_and_tedious_details"}, {"score": 0.00385431710959668, "phrase": "interaction_task"}, {"score": 0.0032714270066711835, "phrase": "proposed_technique"}, {"score": 0.0031457622320220364, "phrase": "interaction_technique"}, {"score": 0.003122741472032058, "phrase": "newly-designed_self-paced_bci"}, {"score": 0.0030472117009926777, "phrase": "motor_imagery"}, {"score": 0.002988101395789399, "phrase": "fuzzy_inference_system"}, {"score": 0.002973503319954633, "phrase": "reject_options"}, {"score": 0.0029015726668054575, "phrase": "proposed_interaction_technique"}, {"score": 0.0027969169552385974, "phrase": "virtual_museum_exploration"}, {"score": 0.0027026375053777543, "phrase": "mental_state"}, {"score": 0.0026501935378083663, "phrase": "simple_command"}, {"score": 0.0025420959370631023, "phrase": "high-level_commands"}, {"score": 0.0024563849242113626, "phrase": "necessary_movements"}, {"score": 0.002356173823922118, "phrase": "virtual_museum"}, {"score": 0.0022935154199244688, "phrase": "nearly_half_the_commands"}, {"score": 0.00220533188459562, "phrase": "efficient_use"}, {"score": 0.0021891781017389783, "phrase": "limited_capacity"}, {"score": 0.0021784745589727246, "phrase": "current_motor_imagery-based_bci"}, {"score": 0.0021049977753042253, "phrase": "new_applications"}], "paper_keywords": [""], "paper_abstract": "Brain-computer interfaces (BCI) are interaction devices that enable users to send commands to a computer by using brain activity only. In this paper, we propose a new interaction technique to enable users to perform complex interaction tasks and to navigate within large virtual environments (VE) by using only a BCI based on imagined movements (motor imagery). This technique enables the user to send high-level mental commands, leaving the application in charge of most of the complex and tedious details of the interaction task. More precisely, it is based on points of interest and enables subjects to send only a few commands to the application in order to navigate from one point of interest to the other. Interestingly enough, the points of interest for a given VE can be generated automatically thanks to the processing of this VE geometry. As the navigation between two points of interest is also automatic, the proposed technique can be used to navigate efficiently by thoughts within any VE. The input of this interaction technique is a newly-designed self-paced BCI which enables the user to send three different commands based on motor imagery. This BCI is based on a fuzzy inference system with reject options. In order to evaluate the efficiency of the proposed interaction technique, we compared it with the state of the art method during a task of virtual museum exploration. The state of the art method uses low-level commands, which means that each mental state of the user is associated with a simple command such as turning left or moving forward in the VE. In contrast, our method based on high-level commands enables the user to simply select its destination, leaving the application performing the necessary movements to reach this destination. Our results showed that with our interaction technique, users can navigate within a virtual museum almost twice as fast as with low-level commands, and with nearly half the commands, meaning with less stress and more comfort for the user. This suggests that our technique enables efficient use of the limited capacity of current motor imagery-based BCI in order to perform complex interaction tasks in VE, opening the way to promising new applications.", "paper_title": "Exploring Large Virtual Environments by Thoughts Using a Brain-Computer Interface Based on Motor Imagery and High-Level Commands", "paper_id": "WOS:000277164300006"}