{"auto_keywords": [{"score": 0.0496729815270419, "phrase": "locus-specific_ancestry"}, {"score": 0.008125068956599285, "phrase": "ancestral_populations"}, {"score": 0.0071534710042922495, "phrase": "inference"}, {"score": 0.006854826490981247, "phrase": "genetic_variation"}, {"score": 0.004733625412289433, "phrase": "closely_related_populations"}, {"score": 0.004575053987970206, "phrase": "recently_admixed_populations"}, {"score": 0.004516962628112147, "phrase": "historical_population_events"}, {"score": 0.004347057700479576, "phrase": "single_nucleotide_polymorphisms"}, {"score": 0.004201381218977942, "phrase": "association_studies"}, {"score": 0.0041657281535389615, "phrase": "admixture_mapping"}, {"score": 0.003512702405367876, "phrase": "large_error_rate"}, {"score": 0.0033091402941590495, "phrase": "european"}, {"score": 0.0031440159350875057, "phrase": "previous_methods"}, {"score": 0.0029998918671747168, "phrase": "refined_model"}, {"score": 0.0029744042270542655, "phrase": "recombination_events"}, {"score": 0.0029116257477000617, "phrase": "efficient_dynamic_programming_algorithm"}, {"score": 0.0028623555849897632, "phrase": "locus-specific_ancestries"}, {"score": 0.0027311076665349657, "phrase": "improved_accuracies"}, {"score": 0.0025291601927956765, "phrase": "wide_range"}, {"score": 0.0022251433045184454, "phrase": "imputation_methods"}, {"score": 0.0021049977753042253, "phrase": "admixed_populations"}], "paper_keywords": [""], "paper_abstract": "A characterization of the genetic variation of recently admixed populations may reveal historical population events, and is useful for the detection of single nucleotide polymorphisms (SNPs) associated with diseases through association studies and admixture mapping. Inference of locus-specific ancestry is key to our understanding of the genetic variation of such populations. While a number of methods for the inference of locus-specific ancestry are accurate when the ancestral populations are quite distant (e. g. African Americans), current methods incur a large error rate when inferring the locus-specific ancestry in admixed populations where the ancestral populations are closely related (e. g. Americans of European descent). Results: In this work, we extend previous methods for the inference of locus-specific ancestry by the incorporation of a refined model of recombination events. We present an efficient dynamic programming algorithm to infer the locus-specific ancestries in this model, resulting in a method that attains improved accuracies; the improvement is most significant when the ancestral populations are closely related. An evaluation on a wide range of scenarios, including admixtures of the 52 population groups from the Human Genome Diversity Project demonstrates that locus-specific ancestry can indeed be accurately inferred in these admixtures using our method. Finally, we demonstrate that imputation methods can be improved by the incorporation of locus-specific ancestry, when applied to admixed populations.", "paper_title": "Inference of locus-specific ancestry in closely related populations", "paper_id": "WOS:000266498300027"}