{"auto_keywords": [{"score": 0.04564158107788786, "phrase": "specific_property"}, {"score": 0.024245709660392564, "phrase": "inductive_types"}, {"score": 0.00481495049065317, "phrase": "infinite_reduction_sequences"}, {"score": 0.00475924837336259, "phrase": "common_way"}, {"score": 0.004525190364108967, "phrase": "systems_terminate"}, {"score": 0.0033952989364738353, "phrase": "adequate_form"}, {"score": 0.003117182762459972, "phrase": "reduction_step"}, {"score": 0.002839625463110821, "phrase": "new_properties"}, {"score": 0.002606906626639414, "phrase": "well-known_lemma"}, {"score": 0.002293014162421338, "phrase": "lambda_calculi"}, {"score": 0.002248863090203165, "phrase": "specific_reductions"}, {"score": 0.0021049977753042253, "phrase": "symmetric_groups"}], "paper_keywords": [""], "paper_abstract": "A common way to show the termination of the union of two abstract reduction systems, provided both systems terminate, is to prove that they enjoy a specific property (some sort of 'commutation' for instance). This specific property is actually used to show that, for the union not to terminate, one of the systems must itself be non-terminating, which leads to a contradiction. Unfortunately, the property may be impossible to prove because some of the objects that are reduced do not enjoy an adequate form. Hence the purpose of this paper is threefold. First, it introduces an operator enabling us to insert a reduction step on such an object, and therefore to change its shape, while still preserving the ability to use the property. Of course, some new properties will need to be verified. Second, as an instance of our technique, the operator is applied to relax a well-known lemma stating the termination of the union of two termination abstract reduction systems. Finally, this lemma is applied in a peculiar and then in a more general way to show the termination of some lambda calculi with inductive types augmented with specific reductions dealing with: (i) copies of inductive types; (ii) the representation of symmetric groups.", "paper_title": "An insertion operator preserving infinite reduction sequences", "paper_id": "WOS:000258434500003"}