{"auto_keywords": [{"score": 0.049255390034042286, "phrase": "work_processes"}, {"score": 0.015719716506582538, "phrase": "spatial_data_infrastructures"}, {"score": 0.011493678315087937, "phrase": "sdi_performance"}, {"score": 0.01106583584242048, "phrase": "spatial_data"}, {"score": 0.004399349717218995, "phrase": "periodic_assessments"}, {"score": 0.004234456398783788, "phrase": "future_developments"}, {"score": 0.003815369123984481, "phrase": "network_perspective"}, {"score": 0.0034376160364306637, "phrase": "process_owners"}, {"score": 0.0029193609786176632, "phrase": "particular_case"}, {"score": 0.0028293966058473476, "phrase": "land_use_plans"}, {"score": 0.0028097846725650176, "phrase": "flanders"}, {"score": 0.0025937408242280757, "phrase": "proposed_process-oriented_methodology"}, {"score": 0.0022567398334877847, "phrase": "proposed_indicators"}, {"score": 0.002233301265743633, "phrase": "good_basis"}, {"score": 0.002164432930854161, "phrase": "sdi_components"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Indicator framework", " Performance measurement", " Spatial Data Infrastructure (SDI)", " Work process", " User perspective"], "paper_abstract": "Spatial Data Infrastructures (SDIs) have been developed over the last decades all over the world. They are the subject of periodic assessments in order to give account of past developments, to steer future developments or to better understand their functioning. Most assessment methods are analysing the SDI as a whole which does not allow understanding their internal dynamics. In this research we analyse SDIs from a network perspective and focus on the work processes that take place within these networks. The paper elaborates a series of indicators to assess the SDI performance from the perspective of the process owners and the users of spatial data within those processes. Three indicators are proposed to measure the performance related to the access, use and sharing of spatial data, and three indicators related to the contribution of SDIs to improve the work processes. The methodology is applied to a particular case, i.e. the process of the development of land use plans in Flanders (Belgium). The results show that the methodology and the indicators are applicable in the context of work processes. The proposed process-oriented methodology is complementary to approaches that assess SDIs as a whole. It helps to detect and understand differences in SDI performance between (parts of) organisations that are actively involved in the processes studied. The paper argues that the proposed indicators provide a good basis for analysing the degree to which organisations integrate SDI components in their work processes. (C) 2012 Elsevier Ltd. All rights reserved.", "paper_title": "A methodology to assess the performance of spatial data infrastructures in the context of work processes", "paper_id": "WOS:000315707100006"}