{"auto_keywords": [{"score": 0.0487291113922519, "phrase": "patient_care"}, {"score": 0.026010403742437488, "phrase": "existing_processes"}, {"score": 0.014948544941566052, "phrase": "information_system_components"}, {"score": 0.008658783412311572, "phrase": "smooth_integration"}, {"score": 0.007002903709145091, "phrase": "health_care"}, {"score": 0.004986442768424463, "phrase": "additional_workload"}, {"score": 0.00481495049065317, "phrase": "csi-isc_-_concepts"}, {"score": 0.00475413908468027, "phrase": "health_care_information_system"}, {"score": 0.00470903269511684, "phrase": "established_processes"}, {"score": 0.004504321499883935, "phrase": "csi-isc"}, {"score": 0.004404994123834589, "phrase": "e.g._processes"}, {"score": 0.004133627071344356, "phrase": "end_users"}, {"score": 0.004094383764612506, "phrase": "better_understanding"}, {"score": 0.004068427912211707, "phrase": "human_factors"}, {"score": 0.003916098498242888, "phrase": "successful_introduction"}, {"score": 0.003817715315140651, "phrase": "specialized_methods"}, {"score": 0.003437248394635138, "phrase": "procedure_model"}, {"score": 0.0032150572968898923, "phrase": "social_sciences"}, {"score": 0.0029037051302566942, "phrase": "information_systems"}, {"score": 0.002785978280998868, "phrase": "new_information_system_components"}, {"score": 0.002707275301442925, "phrase": "introduction_process"}, {"score": 0.002564613964408878, "phrase": "human_beings"}, {"score": 0.002548331088496964, "phrase": "information_technology"}, {"score": 0.0024527767211457046, "phrase": "static_part"}, {"score": 0.0021049977753042253, "phrase": "information_system_component"}], "paper_keywords": ["information systems", " information management", " processes of patient care", " systems integration"], "paper_abstract": "Objectives: The introduction of information system components (ISCs) usually leads to a change in existing processes, e.g. processes of patient care. These processes might become even more complex and variable than before. An early participation of end users and a better understanding of human factors during design and introduction of ISCs ore key factors for a successful introduction of ISCs in health care. Nonetheless no specialized methods have been developed until now to systematically support the integration of ISCs in existing processes of patient care while taking into account these requirements. In this paper, therefore, we introduce a procedure model to implement concepts for Smooth Integration of ISCs (CSI-ISC). Methods: Established theories from economics and social sciences have been applied in our model, among them the stress-strain-concept, the contrastive task analysis (KABA), and the phase model for the management of information systems. Results: CSI-ISC is based on the fact that while introducing new information system components, users experience additional workload. One essential aim during the introduction process therefore should be to systematically identify, prioritize and ameliorate workloads that are being imposed on human beings by information technology in health care. To support this, CSI-ISC consists of a static part (workload framework) and a dynamic port (guideline for the introduction of information system components into existing processes of patient care). Conclusions: The application of CSI-ISC offers the potential to minimize additional workload caused by information system components systematically. CSI-ISC rationalizes decisions and supports the integration of the information system component into existing processes of patient care.", "paper_title": "CSI-ISC - Concepts for smooth integration of health care information system components into established processes of patient care", "paper_id": "WOS:000234822900003"}