{"auto_keywords": [{"score": 0.04911945324917725, "phrase": "functional_modules"}, {"score": 0.004586531354697466, "phrase": "protein-protein_interaction_networks"}, {"score": 0.004404445045826858, "phrase": "protein_complexes"}, {"score": 0.00436890075128947, "phrase": "protein_functions"}, {"score": 0.004061584718427419, "phrase": "general_framework"}, {"score": 0.00386876598761639, "phrase": "gene_ontology"}, {"score": 0.003700037700138249, "phrase": "six_diverse_network_clustering_algorithms"}, {"score": 0.0036701685449853877, "phrase": "saccharomyces"}, {"score": 0.0032629585038738856, "phrase": "topological_characteristics"}, {"score": 0.0031459887611258765, "phrase": "specific_task"}, {"score": 0.003120568497402472, "phrase": "function_prediction"}, {"score": 0.003095353227329718, "phrase": "s.cerevisiae"}, {"score": 0.0028541057064952876, "phrase": "widely_used_clustering-based_approaches"}, {"score": 0.0027741761880779535, "phrase": "overrepresented_biological_process"}, {"score": 0.002751751956416832, "phrase": "cellular_component_terms"}, {"score": 0.002506507889886399, "phrase": "annotated_proteins"}, {"score": 0.002406799309495983, "phrase": "functional_analyses"}, {"score": 0.0022830706430588482, "phrase": "physical_interactomes"}, {"score": 0.002183347623351868, "phrase": "biological_networks"}, {"score": 0.0021049977753042253, "phrase": "functional_analysis"}], "paper_keywords": [""], "paper_abstract": "Motivation: Clustering of protein-protein interaction networks is one of the most common approaches for predicting functional modules, protein complexes and protein functions. But, how well does clustering perform at these tasks? Results: We develop a general framework to assess how well computationally derived clusters in physical interactomes overlap functional modules derived via the Gene Ontology (GO). Using this framework, we evaluate six diverse network clustering algorithms using Saccharomyces cerevisiae and show that (i) the performances of these algorithms can differ substantially when run on the same network and (ii) their relative performances change depending upon the topological characteristics of the network under consideration. For the specific task of function prediction in S.cerevisiae, we demonstrate that, surprisingly, a simple non-clustering guilt-by-association approach outperforms widely used clustering-based approaches that annotate a protein with the overrepresented biological process and cellular component terms in its cluster; this is true over the range of clustering algorithms considered. Further analysis parameterizes performance based on the number of annotated proteins, and suggests when clustering approaches should be used for interactome functional analyses. Overall our results suggest a re-examination of when and how clustering approaches should be applied to physical interactomes, and establishes guidelines by which novel clustering approaches for biological networks should be justified and evaluated with respect to functional analysis.", "paper_title": "How and when should interactome-derived clusters be used to predict functional modules and protein function?", "paper_id": "WOS:000272080800015"}