{"auto_keywords": [{"score": 0.03824236520910251, "phrase": "margin-based_criterion"}, {"score": 0.00481495049065317, "phrase": "binary_classification"}, {"score": 0.004764220976404241, "phrase": "active_learning"}, {"score": 0.00468912237497774, "phrase": "important_class"}, {"score": 0.004639712384096822, "phrase": "machine_learning"}, {"score": 0.004262643556463565, "phrase": "new_labeled_data"}, {"score": 0.004085713541752114, "phrase": "high_overhead"}, {"score": 0.0037935066882208235, "phrase": "new_online_active_learning_algorithm"}, {"score": 0.0032184697893776052, "phrase": "iteratively_decreased_threshold"}, {"score": 0.0027594936602962075, "phrase": "queried_instances"}, {"score": 0.0021731423856364003, "phrase": "smaller_computation_overhead"}], "paper_keywords": ["Online active learning", " Binary classification", " Margin-based criterion", " Iteratively decreased threshold"], "paper_abstract": "Active learning is an important class of machine learning where labels are queried when necessary. Most active learning algorithms need to iteratively retrain the classifier when new labeled data are obtained. Such a batch learning process can incur a high overhead in both time and memory. In this paper, we propose a new online active learning algorithm for binary classification. Our algorithm uses the margin-based criterion, which compares the margin of instances with a threshold to decide whether it should be queried. Especially, we propose Iteratively Decreased Threshold (IDT), a new threshold update method for the margin-based criterion. By iteratively decreasing the threshold with IDT, our algorithm can effectively reduce the number of queried instances. In addition, as evaluating the margin-based criterion involves only simple inner productions, our algorithm is also very efficient to evaluate. We compare our algorithm with other state-of-the-art online active learning algorithms on six data sets, demonstrating that it requires less queries to achieve the same classification accuracy, and incurs a smaller computation overhead at the same time. (C) 2015 Elsevier B.V. All rights reserved.", "paper_title": "An efficient online active learning algorithm for binary classification", "paper_id": "WOS:000365181400004"}