{"auto_keywords": [{"score": 0.04966877349162058, "phrase": "genetic_fuzzy_systems"}, {"score": 0.03892086017692259, "phrase": "different_scores"}, {"score": 0.00481495049065317, "phrase": "low_quality_data"}, {"score": 0.004652016085325825, "phrase": "early_childhood"}, {"score": 0.004533427352547707, "phrase": "non-writing_based_graphical_tests"}, {"score": 0.004123781267600542, "phrase": "artificial_intelligence_techniques"}, {"score": 0.004001335931796133, "phrase": "complex_task"}, {"score": 0.003967021436047945, "phrase": "multiple_sources"}, {"score": 0.003751011827704279, "phrase": "different_experts"}, {"score": 0.003050166508545763, "phrase": "interval-valued_score"}, {"score": 0.002762240719058935, "phrase": "uncertain_datasets"}, {"score": 0.002680114113899346, "phrase": "new_challenge"}, {"score": 0.002555950807368337, "phrase": "genetic_cooperative-competitive_algorithm"}, {"score": 0.0021601997088758957, "phrase": "individual_examination"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Genetic fuzzy systems", " Low quality data", " Dyslexia"], "paper_abstract": "For diagnosing dyslexia in early childhood, children have to solve non-writing based graphical tests. Human experts score these tests, and decide whether the children require further consideration on the basis of their marks. Applying artificial intelligence techniques for automating this scoring is a complex task with multiple sources of uncertainty. On the one hand, there are conflicts, as different experts can assign different scores to the same set of answers. On the other hand, sometimes the experts are not completely confident with their decisions and doubt between different scores. The problem is aggravated because certain symptoms are compatible with more than one disorder. In case of doubt, the experts assign an interval-valued score to the test and ask for further information about the child before diagnosing him. Having said that, exploiting the information in uncertain datasets has been recently acknowledged as a new challenge in genetic fuzzy systems. In this paper we propose using a genetic cooperative-competitive algorithm for designing a linguistically understandable, rule-based classifier that can tackle this problem. This algorithm is part of a web-based, automated pre-screening application that can be used by the parents for detecting those symptoms that advise taking the children to a psychologist for an individual examination. (C) 2010 Elsevier Inc. All rights reserved.", "paper_title": "Diagnosis of dyslexia with low quality data with genetic fuzzy systems", "paper_id": "WOS:000282867600011"}