{"auto_keywords": [{"score": 0.03869126832952986, "phrase": "f-s_method"}, {"score": 0.00481495049065317, "phrase": "probabilistic_record_linkage_algorithm"}, {"score": 0.004775918707955445, "phrase": "frequency-based_weight_scaling"}, {"score": 0.004660702714929615, "phrase": "value-based_weight"}, {"score": 0.00434906528856802, "phrase": "healthcare_data"}, {"score": 0.004244102948402086, "phrase": "record_linkage"}, {"score": 0.004192571571622019, "phrase": "key_component"}, {"score": 0.004158563941891469, "phrase": "fully_functional_health_information_exchanges"}, {"score": 0.0038962096720793443, "phrase": "patient_records"}, {"score": 0.003848886045448135, "phrase": "unique_identifiers"}, {"score": 0.003771282384646587, "phrase": "relative_frequency"}, {"score": 0.0037406791638601206, "phrase": "specific_data_elements"}, {"score": 0.003605997900398767, "phrase": "false-positive_or_false-negative_matches"}, {"score": 0.003310236836421397, "phrase": "real-world_clinical_data"}, {"score": 0.0032040376301815544, "phrase": "value-based_weight_scaling_modification"}, {"score": 0.0029652407497456562, "phrase": "indiana"}, {"score": 0.0029531640201737384, "phrase": "statewide_newborn_screening_data"}, {"score": 0.00260246764210499, "phrase": "common_or_uncommon_field-specific_values"}, {"score": 0.0024984517279573906, "phrase": "positive_predictive_value"}, {"score": 0.0024281181691350085, "phrase": "field-specific_values"}, {"score": 0.0023026973099101876, "phrase": "nonweight_scaling"}, {"score": 0.002274684393868218, "phrase": "modified_f-s_algorithm"}, {"score": 0.0021309254505358253, "phrase": "false-positive_matches"}, {"score": 0.0021049977753042253, "phrase": "value-based_weight_modification"}], "paper_keywords": [""], "paper_abstract": "Objective: To incorporate value-based weight scaling into the Fellegi-Sunter (F-S) maximum likelihood linkage algorithm and evaluate the performance of the modified algorithm. Background: Because healthcare data are fragmented across many healthcare systems, record linkage is a key component of fully functional health information exchanges. Probabilistic linkage methods produce more accurate, dynamic, and robust matching results than rule-based approaches, particularly when matching patient records that lack unique identifiers. Theoretically, the relative frequency of specific data elements can enhance the F-S method, including minimizing the false-positive or false-negative matches. However, to our knowledge, no frequency-based weight scaling modification to the F-S method has been implemented and specifically evaluated using real-world clinical data. Methods: The authors implemented a value-based weight scaling modification using an information theoretical model, and formally evaluated the effectiveness of this modification by linking 51,361 records from Indiana statewide newborn screening data to 80,089 HL7 registration messages from the Indiana Network for Patient Care, an operational health information exchange. In addition to applying the weight scaling modification to all fields, we examined the effect of selectively scaling common or uncommon field-specific values. Results: The sensitivity, specificity, and positive predictive value for applying weight scaling to all field-specific values were 95.4, 98.8, and 99.9%, respectively. Compared with nonweight scaling, the modified F-S algorithm demonstrated a 10% increase in specificity with a 3% decrease in sensitivity. Conclusion: By eliminating false-positive matches, the value-based weight modification can enhance the specificity of the F-S method with minimal decrease in sensitivity.", "paper_title": "An Empiric Modification to the Probabilistic Record Linkage Algorithm Using Frequency-Based Weight Scaling", "paper_id": "WOS:000269755500015"}