{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "application_software"}, {"score": 0.004720043307726269, "phrase": "earlier_work"}, {"score": 0.0044169318855693356, "phrase": "similar_approaches"}, {"score": 0.004230382915464492, "phrase": "previous_work"}, {"score": 0.00397175830521626, "phrase": "positive_results"}, {"score": 0.0037913267098534887, "phrase": "developing_processes"}, {"score": 0.0035712919163869176, "phrase": "resource_specification"}, {"score": 0.0034892010527109024, "phrase": "central_issues"}, {"score": 0.003286642683771891, "phrase": "growing_classes"}, {"score": 0.003044785536429499, "phrase": "central_issue"}, {"score": 0.0030246125031350903, "phrase": "virtually_all_creative_activities"}, {"score": 0.002887083738036996, "phrase": "prominent_features"}, {"score": 0.002792683583705368, "phrase": "analogous_need"}, {"score": 0.0026392143749243914, "phrase": "human_creativity"}, {"score": 0.002561401523136952, "phrase": "application_and_process_software_technologies"}, {"score": 0.0023727863021828547, "phrase": "clearer_understanding"}, {"score": 0.0021049977753042253, "phrase": "john_wiley"}], "paper_keywords": ["icssp", " special", " issue"], "paper_abstract": "In earlier work, it has been suggested that processes and applications seem to share many important characteristics and seem to be amenable to similar approaches of modeling, definition, and analysis. In most of this previous work, approaches and technologies for developing applications have been applied to the development of processes, largely with positive results. This paper suggests the opposite, namely that approaches and technologies for developing processes seem likewise to be applicable to developing applications. As an example, this paper notes that resource specification, allocation, and management are central issues in the development of many processes, and suggests that although these capabilities seem to be important for growing classes of application software, the ability to support them seems curiously neglected. The paper also notes that management of rework is a central issue of virtually all creative activities. This is evidenced by the observation that facilities for supporting rework are prominent features in so many creative domains. Accordingly, the paper suggests an analogous need for facilities for supporting rework in application software as well, especially in application software aimed at supporting human creativity. The paper concludes by noting that both application and process software technologies grow through consideration of the relevance of technologies developed for one to the other. This in turn should lead to a clearer understanding of the essence of what they have in common, leading to conjectures about the nature of a more abstract class of entities, that we refer to simply as software. Copyright (c) 2014 John Wiley & Sons, Ltd.", "paper_title": "Learning about application software by studying processes", "paper_id": "WOS:000344148200002"}