{"auto_keywords": [{"score": 0.030809208723928477, "phrase": "analysis_tool"}, {"score": 0.030616142938192436, "phrase": "fesoria"}, {"score": 0.00481495049065317, "phrase": "smart_presentation"}, {"score": 0.004707396263523012, "phrase": "elevated_consumption"}, {"score": 0.0041104856245548285, "phrase": "provider_companies"}, {"score": 0.003979854888950705, "phrase": "specific_tools"}, {"score": 0.0037308696078377944, "phrase": "different_types"}, {"score": 0.003441352119167824, "phrase": "collected_data"}, {"score": 0.0031032109441552287, "phrase": "inaccurate_analyses"}, {"score": 0.0025725382476862305, "phrase": "streaming_servers"}, {"score": 0.002514947446797848, "phrase": "extracted_information"}, {"score": 0.002450702522633428, "phrase": "content_metadata"}, {"score": 0.0024348987477622983, "phrase": "content_distribution_networks_architecture"}, {"score": 0.0023120743774800176, "phrase": "service_performance"}, {"score": 0.0021049977753042253, "phrase": "satisfactory_results"}], "paper_keywords": ["presentation", " management", " analysis", " audio", " video streaming", " system"], "paper_abstract": "Due to the elevated consumption of resources, the high cost of the production of contents and the quality of service required in audio/video streaming services, it is extremely important to optimize all the elements involved in the deployment of these services. With this goal in mind, provider companies have developed their management and presentation tools. At the same time, some specific tools for audio/video streaming analysis have appeared. Data are collected from servers and proxies by analyzing their log files in order to generate different types of reports. In spite of their utility, there is a disconnection between these types of tools. In this way, several important relationships between collected data are lost and the influence of other important aspects such as the behaviour of the users and their relationship with the subject or the length of the contents is not considered. This generates inaccurate analyses and the impossibility to improve the presentation, for example by generating recommendations using the information gathered from the analysis tool. Fesoria is a system which combines both characteristics. It is an analysis tool and, at the same time, a system to manage the whole audio/video service. Fesoria is able to process the logs gathered from the streaming servers and proxies, and combine the extracted information with other types of data, such as content metadata, content distribution networks architecture, user preferences, etc. All this information is analyzed in order to generate reports on service performance, access evolution and users' preferences, and thus to improve the presentation of the services. The system has been used in real audio/video services since 2001 with satisfactory results.", "paper_title": "FESORIA: An integrated system for analysis, management and smart presentation of audio/video streaming services", "paper_id": "WOS:000257771600004"}