{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "textual_and_aural_feedback_modes"}, {"score": 0.004697308822154191, "phrase": "higher_education"}, {"score": 0.004448471107649881, "phrase": "formative_assessment_feedback_commentaries"}, {"score": 0.004404658750724105, "phrase": "textual_and_aural_media"}, {"score": 0.004296998284839309, "phrase": "knowledge_elaboration"}, {"score": 0.0042336638794732255, "phrase": "written_work"}, {"score": 0.003911253966141701, "phrase": "students'_work"}, {"score": 0.0037039021744127783, "phrase": "feedback_medium"}, {"score": 0.003649277504586372, "phrase": "research_outcomes"}, {"score": 0.0034386894664467003, "phrase": "students'_contextual_knowledge_elaboration"}, {"score": 0.0032724821705972357, "phrase": "audio_feedback"}, {"score": 0.003038066486989815, "phrase": "audio_media"}, {"score": 0.0028911669203979156, "phrase": "students'_qualitative_comments"}, {"score": 0.002737745536992088, "phrase": "tutor-student_relationships"}, {"score": 0.002657511557782467, "phrase": "students'_attitudes"}, {"score": 0.00263129148531588, "phrase": "academic_progress"}, {"score": 0.0023828731731474306, "phrase": "students'_knowledge_elaboration"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Feedback", " Textual", " Aural", " Media", " Knowledge elaboration"], "paper_abstract": "This study examines the effects of formative assessment feedback commentaries utilizing textual and aural media on the quality of knowledge elaboration Within the written work of a sample of 104 higher education students. A randomized, mixed methodological approach was adopted that examined changes within the students' work over a period of one academic year as a function of the feedback medium. The research outcomes indicated that whilst there were some improvements in very specific elements of the students' contextual knowledge elaboration that appeared to be related to qualities within the audio feedback, these were not significant and thus further research is required to explore the effects of audio media on elements of elaboration. However, analysis of students' qualitative comments suggests that feedback may serve simultaneously to reinforce and undermine tutor-student relationships as well as influencing the students' attitudes towards academic progress in general. This research assists not only in the furtherance of understanding the place of media in progressing students' knowledge elaboration within their studies, but also in comprehending the relationship between perception and actualization of learning development and progress. (C) 2012 Elsevier Ltd. All rights reserved.", "paper_title": "Richness, redundancy or relational salience? A comparison of the effect of textual and aural feedback modes on knowledge elaboration in higher education students' work", "paper_id": "WOS:000316523100024"}