{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "social_welfare"}, {"score": 0.010361979175839964, "phrase": "cooperative_multiagent_systems"}, {"score": 0.0047689174754929195, "phrase": "limited_communication"}, {"score": 0.003992129945230457, "phrase": "voting_rule"}, {"score": 0.0038415095105632157, "phrase": "communication_burden"}, {"score": 0.0037322713756404295, "phrase": "possible_gap"}, {"score": 0.0036261282565554507, "phrase": "optimal_alternative"}, {"score": 0.002948547333717581, "phrase": "voting_rules"}, {"score": 0.002864628676257225, "phrase": "agent's_utility_function"}, {"score": 0.0028100102841877835, "phrase": "agent's_vote"}, {"score": 0.002677964894127131, "phrase": "randomized_embeddings"}, {"score": 0.00236289633510808, "phrase": "low_communication_costs"}, {"score": 0.002219516542316085, "phrase": "compelling_reason"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Computational social choice"], "paper_abstract": "In cooperative multiagent systems an alternative that maximizes the social welfare the sum of utilities can only be selected if each agent reports its full utility function. This may be infeasible in environments where communication is restricted. Employing a voting rule to choose an alternative greatly reduces the communication burden, but leads to a possible gap between the social welfare of the optimal alternative and the social welfare of the one that is ultimately elected. Procaccia and Rosenschein (2006) [13] have introduced the concept of distortion to quantify this gap. In this paper, we present the notion of embeddings into voting rules: functions that receive an agent's utility function and return the agent's vote. We establish that very low distortion can be obtained using randomized embeddings, especially when the number of agents is large compared to the number of alternatives. We investigate our ideas in the context of three prominent voting rules with low communication costs: Plurality, Approval, and Veto. Our results arguably provide a compelling reason for employing voting in cooperative multiagent systems. (C) 2011 Elsevier B.V. All rights reserved.", "paper_title": "Voting almost maximizes social welfare despite limited communication", "paper_id": "WOS:000292222400009"}