{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "older_users"}, {"score": 0.013347074786027204, "phrase": "barrier_types"}, {"score": 0.010518694394865004, "phrase": "first_experiment"}, {"score": 0.004763895422211728, "phrase": "web_site-evaluation_methodologies"}, {"score": 0.004650982915563737, "phrase": "accessibility_guidelines"}, {"score": 0.004236639288852276, "phrase": "barrier_walkthrough"}, {"score": 0.003995226376780718, "phrase": "different_user_categories"}, {"score": 0.003942299471749811, "phrase": "visual_impairment"}, {"score": 0.003838531755488468, "phrase": "combinatorial_explosion"}, {"score": 0.003737485125097945, "phrase": "multiple_disabilities"}, {"score": 0.003668333531296882, "phrase": "simple_set_theory_operation"}, {"score": 0.0036100762867678415, "phrase": "validation_scheme"}, {"score": 0.0034316082315404926, "phrase": "new_\"older_users"}, {"score": 0.003359119985242403, "phrase": "set_union"}, {"score": 0.0032706520949775065, "phrase": "aggregation_approach"}, {"score": 0.0031845067058084583, "phrase": "aggregated_results"}, {"score": 0.0031506852267042963, "phrase": "quality_attributes"}, {"score": 0.0030513542522336043, "phrase": "original_one"}, {"score": 0.0029394074636168435, "phrase": "older_users_category"}, {"score": 0.0028543298631502107, "phrase": "bw_experiment"}, {"score": 0.002824005136794786, "phrase": "expert_judges"}, {"score": 0.002794001681064862, "phrase": "web_page"}, {"score": 0.0027276510774099485, "phrase": "second_experiment"}, {"score": 0.002662871928330334, "phrase": "significant_difference"}, {"score": 0.002497531381123025, "phrase": "severity_scores"}, {"score": 0.0023802825369325354, "phrase": "viable_alternative"}, {"score": 0.0023675986784123656, "phrase": "expert_evaluation"}, {"score": 0.0021162777949384234, "phrase": "user_testing"}, {"score": 0.0021049977753042253, "phrase": "subjective_assessments"}], "paper_keywords": [""], "paper_abstract": "Web site-evaluation methodologies and validation engines take the view that all accessibility guidelines must be met to gain compliance. Problems exist in this regard, as contradictions within the rule set may arise, and the type of impairment or its severity is not isolated. The Barrier Walkthrough (BW) method goes someway to addressing these issues, by enabling barrier types derived from guidelines to be applied to different user categories such as motor or visual impairment, etc. However, the problem remains of combinatorial explosion of possibilities when one has to consider users with multiple disabilities. In this paper, a simple set theory operation is used to create a validation scheme for older users by aggregating barrier types specific to motor impaired and low-vision users, thereby creating a new \"older users\" category from the results of this set union. To evaluate the feasibility and validity of this aggregation approach, two BW experiments were conducted. The first experiment evaluated the aggregated results by focusing on quality attributes and showed that aggregation generates data whose quality is comparable to the original one. However, this first experiment could not test for validity, as the older users category was not included. To remedy this deficiency, another BW experiment was conducted with expert judges who evaluated a web page in the context of older users. In this second experiment, it was found that there is no significant difference between the aggregated and the manually evaluated (by experts) barrier scores, and that the same barriers are identified using experts and aggregation, even though there are differences in how severity scores are distributed. From these results, it is concluded that the aggregation of barriers is a viable alternative to expert evaluation, when the target of that aggregation could not be evaluated manually or it would not be feasible to do so. It is also argued that aggregation is a technique that can be used in combination with other evaluation methods, like user testing or subjective assessments.", "paper_title": "Web accessibility guideline aggregation for older users and its validation", "paper_id": "WOS:000300161700005"}