{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "efficient_use"}, {"score": 0.004275650416511604, "phrase": "human_beings"}, {"score": 0.004145143433523008, "phrase": "information_processing_framework"}, {"score": 0.004102528738941734, "phrase": "semantic_web_technologies"}, {"score": 0.003936389070602614, "phrase": "semantic_web_services"}, {"score": 0.0038558497470953306, "phrase": "service_sequences"}, {"score": 0.003680587852807675, "phrase": "specific_queries"}, {"score": 0.003531474887552889, "phrase": "effective_management"}, {"score": 0.003405948098114941, "phrase": "mobile_sensors"}, {"score": 0.0030872017736888113, "phrase": "goal_ontology"}, {"score": 0.0026161698049580804, "phrase": "detailed_exploration"}, {"score": 0.0023467391904246834, "phrase": "case_study"}, {"score": 0.002310578855290687, "phrase": "logistics_system"}, {"score": 0.002126907587540404, "phrase": "logistics_system_efficiency"}, {"score": 0.0021049977753042253, "phrase": "lower_operating_costs"}], "paper_keywords": [""], "paper_abstract": "To facilitate the efficient use of information generated from the Internet of Things (IoT) by sensors and automatically drive entities to meet the needs of human beings, this paper presents an information processing framework using semantic web technologies. The framework represents the entities as semantic web services and automatically creates service sequences as transactions by analyzing the information need in specific queries. Moreover, the framework ensures the effective management and control of information collected by mobile sensors during the transaction. The foundation of this framework lies in a set of ontologies we proposed: goal ontology, role ontology, constraint ontology, message ontology, status ontology, space-time ontology, and activity ontology. In addition to their respective definitions, we also present a detailed exploration of the relationships between them. Finally, we validate the effectiveness of the framework and the ontologies with a case study of the logistics system. The evaluation shows that the ontologies support the framework well and our approach increases the logistics system efficiency with lower operating costs.", "paper_title": "Ontologies for the Transactions on IoT", "paper_id": "WOS:000354297700001"}