{"auto_keywords": [{"score": 0.04890879992207316, "phrase": "internet_technologies"}, {"score": 0.007147248066108133, "phrase": "internet_adoption"}, {"score": 0.0068157941723391, "phrase": "organizational_factors"}, {"score": 0.006662163895020995, "phrase": "managerial_capabilities"}, {"score": 0.00481495049065317, "phrase": "internet_technology_adoption"}, {"score": 0.004668167741125828, "phrase": "domain_name"}, {"score": 0.004591156827288206, "phrase": "organizational_factor"}, {"score": 0.004495996972278015, "phrase": "innovation_adoption_theory"}, {"score": 0.004386063799793622, "phrase": "different_stages"}, {"score": 0.004295136518467118, "phrase": "development_stages"}, {"score": 0.0041821205529541045, "phrase": "technology_resources"}, {"score": 0.0041662189933067, "phrase": "organizational_structure"}, {"score": 0.004103212598803194, "phrase": "empirically_different_stages"}, {"score": 0.00407983062815325, "phrase": "internet_adoption_process"}, {"score": 0.004002844915121354, "phrase": "questionnaire-based_data"}, {"score": 0.00373036974937097, "phrase": "literature_suggestions"}, {"score": 0.0034697573205392887, "phrase": "external_advice"}, {"score": 0.0034303002275695446, "phrase": "small_firms"}, {"score": 0.003384831768721326, "phrase": "mean_time"}, {"score": 0.0033399639721674954, "phrase": "larger_firms"}, {"score": 0.0032894118890753805, "phrase": "empirical_research"}, {"score": 0.003071201732948199, "phrase": "study_firms"}, {"score": 0.003036263091666092, "phrase": "spanish_domain_name"}, {"score": 0.002961916180189481, "phrase": "\".org\"_domain_name"}, {"score": 0.0029394074636168435, "phrase": "spanish_firms"}, {"score": 0.0028078921192962575, "phrase": "classification_analysis"}, {"score": 0.002797201072577733, "phrase": "exploratory_purposes"}, {"score": 0.0027079507175554857, "phrase": "longitudinal_study"}, {"score": 0.0025622062956587597, "phrase": "better_description"}, {"score": 0.0024522007854499554, "phrase": "relatively_important_managerial_implications"}, {"score": 0.0023379671661042894, "phrase": "infusion_phase"}, {"score": 0.002267659838548366, "phrase": "so-called_initial_stages"}, {"score": 0.0022547140008848912, "phrase": "internet_technologies_adoption_process"}, {"score": 0.0021952683716334478, "phrase": "strategic_value"}, {"score": 0.0021049977753042253, "phrase": "presumably_more_competitive_pressure"}], "paper_keywords": ["Internet", " innovation", " companies", " communication technologies", " Spain"], "paper_abstract": "Purpose - To explore the factors that affect the implementation of Internet technologies and to what extent the size of the company, as an organizational factor, influences that process. Design/methodology/approach - According to the innovation adoption theory, it was found that Internet adoption in firms is a process with different stages where a company is in one of a number of development stages depending on some variables related to organizational factors, such as the availability of technology resources, organizational structure, and managerial capabilities. The paper identified empirically different stages in the Internet adoption process and linked them with those factors. It analyzed questionnaire-based data from 280 companies, applying factor and clustering analysis. Findings - Four main groups of companies were found according to their stage in the adoption of Internet technologies. The paper established that, contrary to the literature suggestions, the size of the company does not have any effect on the availability of these Internet technologies but it does for managerial capabilities. The smaller the size of the firm, the greater the possibilities of using external advice in adopting Internet technologies, because small firms usually have fewer managerial capabilities. In the mean time, a more sophisticated technology development was identified in larger firms. Research limitations/implications - As in all empirical research, the characteristics of this study limit the applicability of the findings. First, the study concentrated in businesses that already were using Internet technologies, because they have registered their domain name. Consequently, the study firms that did not have a Spanish domain name were omitted; however, firms could have a \".com\" or \".org\" domain name and still be Spanish firms. Also, other companies without any domain name on the Internet were not included in the study. Second, the study applied a classification analysis with exploratory purposes about the characteristics of the business according to the cluster of pertinence. Nevertheless, a longitudinal study could be more useful explaining whether or not these companies follow the process described. Third, a more detailed questionnaire with more specific questions could be more helpful to gain a better description of the phases of a more sophisticated technology adoption (i.e. the acceptance/routinization and infusion stages). Practical implications - This paper has some relatively important managerial implications. First, the fact of having a domain name does not mean that the companies are in the acceptance/routinization phase and even less in the infusion phase. From this, the paper identified how the majority of firms were in the so-called initial stages of the Internet technologies adoption process. Second, it is possible that managers who do not perceive the strategic value of these technologies are managing the majority of these firms. Third, as more businesses implement these technologies in their processes, presumably more competitive pressure will exist to adopt Internet technologies. Originality/value - This paper contributes to the research into the organizational factors that affect Internet adoption.", "paper_title": "Organizational factors affecting Internet technology adoption", "paper_id": "WOS:000236244000007"}