{"auto_keywords": [{"score": 0.028072454317425367, "phrase": "best_use"}, {"score": 0.00481495049065317, "phrase": "strategic_profile"}, {"score": 0.004761850836420121, "phrase": "higher_education_institutions"}, {"score": 0.004145287175409325, "phrase": "new_indicators"}, {"score": 0.004009555045206973, "phrase": "individual_level"}, {"score": 0.0038998328617557013, "phrase": "robust_nonparametric_efficiency_measures"}, {"score": 0.003751228706861377, "phrase": "efficiency_measures"}, {"score": 0.0027486060614330043, "phrase": "strategic_problem"}, {"score": 0.002614534850703364, "phrase": "existing_resources"}, {"score": 0.0025713100093065645, "phrase": "short_run"}, {"score": 0.0024323098907299027, "phrase": "additional_resources"}, {"score": 0.0023920904611571783, "phrase": "long_run"}, {"score": 0.0022880528191813083, "phrase": "resources_universities"}, {"score": 0.0021049977753042253, "phrase": "european_institutional_landscape"}], "paper_keywords": [""], "paper_abstract": "We address the issue of differentiation of the profile of universities and offer a set of new indicators based on microdata at the individual level and the application of robust nonparametric efficiency measures. In particular, we use efficiency measures in order to characterize the way in which universities use their inputs (academic and non academic staff, funding) in the effort to position themselves in the space of output (undergraduate teaching, postgraduate education, fundamental research, contract research, third mission), while keeping efficiency under control. The strategic problem of universities is defined as making best use of existing resources in the short run, while enlarging the scope of autonomy in procuring additional resources in the long run. In order to make best use of resources universities are led to increase their specialization and differentiate their offering profile. This happens even if the European institutional landscape does not encourage universities to differentiate.", "paper_title": "The differentiation of the strategic profile of higher education institutions. New positioning indicators based on microdata", "paper_id": "WOS:000251830300003"}