{"auto_keywords": [{"score": 0.041820332056100244, "phrase": "interesting_situations"}, {"score": 0.00481495049065317, "phrase": "self-motivated_learning_animats"}, {"score": 0.004669845451682529, "phrase": "development_process"}, {"score": 0.004548939310612501, "phrase": "self-exploratory_activities"}, {"score": 0.004470071518923524, "phrase": "playful_interaction"}, {"score": 0.0044118153390803405, "phrase": "surrounding_environment"}, {"score": 0.004278807087784626, "phrase": "novel_situations"}, {"score": 0.003545024951402821, "phrase": "machine_learning"}, {"score": 0.0032764307492734145, "phrase": "artificial_agents"}, {"score": 0.0030414140732789186, "phrase": "iterated_three_phase_process"}, {"score": 0.002962543869356265, "phrase": "random_exploration"}, {"score": 0.0027620516806198354, "phrase": "intrinsic_motivation"}, {"score": 0.0024007585788965655, "phrase": "new_interesting_configurations"}], "paper_keywords": [""], "paper_abstract": "A central role in the development process of children is played by self-exploratory activities. Through a playful interaction with the surrounding environment, they test their own capabilities, explore novel situations, and understand how their actions affect the world. During this kind of exploration, interesting situations may be discovered. By learning to reach these situations, a child incrementally develops more and more complex skills. Inspired by studies from psychology, neuroscience, and machine learning, we designed SMILe (Self-Motivated Incremental Learning), a learning framework that allows artificial agents to autonomously identify and learn a set of abilities useful to face several different tasks, through an iterated three phase process: by means of a random exploration of the environment (babbling phase), the agent identifies interesting situations and generates an intrinsic motivation (motivating phase) aimed at learning how to get into these situations (skill acquisition phase). This process incrementally increases the skills of the agent, so that new interesting configurations can be experienced. We present results on two gridworld environments to show how SMILe makes it possible to learn skills that enable the agent to perform well and robustly in many different tasks.", "paper_title": "Incremental skill acquisition for self-motivated learning animats", "paper_id": "WOS:000242125300030"}