{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "second_life"}, {"score": 0.004732785510739708, "phrase": "collaborative_exploration"}, {"score": 0.0044688500725247726, "phrase": "online_digital_world_second_life"}, {"score": 0.0037834649508375544, "phrase": "collaborative_and_engaging_fashion"}, {"score": 0.0035722806911457545, "phrase": "multiple_remote_participants"}, {"score": 0.003431481042678356, "phrase": "virtual_environment"}, {"score": 0.003277327351139926, "phrase": "likely_candidate"}, {"score": 0.003130077012135034, "phrase": "additional_reasons"}, {"score": 0.0030414140732789186, "phrase": "easy-to-learn_user_interface"}, {"score": 0.002321234686549485, "phrase": "different_types"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Fractal geometry", " Game engine", " Multiplayer", " Immersion", " Second Life"], "paper_abstract": "This paper explores the use of online digital world Second Life as an environment in which one can represent and explore three-dimensional (3D) fractals, and in addition, present them to others in a collaborative and engaging fashion. Second Life at its core provides a means whereby multiple remote participants can engage with 3D geometry within a virtual environment. it has been chosen as a likely candidate for this exploration for a number of additional reasons. These include the easy-to-learn user interface, its relatively widespread uptake compared to the alternatives, the availability of the software for all the major operating systems, its non-aggressive social networking foundation, and its scripting capability. The suitability of Second Life will be evaluated through examples. These examples will attempt to create representations of range of the different types of 3D fractals and a discussion of the outcomes will be presented. (C) 2008 Elsevier Ltd. All rights reserved.", "paper_title": "Evaluating Second Life for the collaborative exploration of 3D fractals", "paper_id": "WOS:000263999800012"}