{"auto_keywords": [{"score": 0.04955691910341986, "phrase": "erp_systems"}, {"score": 0.00481495049065317, "phrase": "erp_implementation_risks"}, {"score": 0.004574709094672837, "phrase": "different_organizations"}, {"score": 0.003995697901740734, "phrase": "iranian_organizations"}, {"score": 0.003646399625591736, "phrase": "above-mentioned_issue"}, {"score": 0.003489714006817602, "phrase": "novel_technology"}, {"score": 0.0033890026927890058, "phrase": "successful_prior_experience"}, {"score": 0.00336428077531883, "phrase": "erp_implementation"}, {"score": 0.0033397385936467204, "phrase": "iranian_automotive_industry"}, {"score": 0.00284275228258112, "phrase": "suitable_and_practical_model"}, {"score": 0.0027911639820564897, "phrase": "precise_steps"}, {"score": 0.002740518882381628, "phrase": "iran"}, {"score": 0.002632272952905936, "phrase": "bahman_motor_company"}, {"score": 0.0026035011274172753, "phrase": "overall_schema"}, {"score": 0.0025562434609873335, "phrase": "also_the_evaluation_results"}, {"score": 0.002528300562452668, "phrase": "aforementioned_company"}, {"score": 0.0023843376332011936, "phrase": "decision-making_risks"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["ERP", " Decision-making model", " Risk management", " ERP selection model"], "paper_abstract": "Although ERP systems were already introduced many years back and were implemented in different organizations, there are still companies who hesitate to decide about establishing ERP systems in their structure. This hesitation will itself result in the projects to go in vain. On the other hand, taking into account the Iranian organizations, the unfamiliarity with these systems is obviously comprehended, something that stems from the lack of information in decision-makers and managers concerning the above-mentioned issue, together with the feeling of fear and inconvenience with this novel technology. Taking into account the lack of successful prior experience of ERP implementation in Iranian automotive industry, these failures have acted as obstacles for the decision-makers to move towards establishment of the system. Bearing in mind all the above, this article, through reviewing the intra- and extra-organizational limitations, has tried to provide a suitable and practical model for decision-makers to take precise steps in implementing ERP systems in Iran. This model has been operationally tested and simulated in Bahman motor company. The overall schema of the model and also the evaluation results in the aforementioned company have been incorporated in the results of this essay with the intention to decrease the decision-making risks and, therefore, success of these types of projects. This would per se lead to further related investigations, and managers and decision-makers in companies can take advantage of the results. (C) 2009 Elsevier B.V. All rights reserved.", "paper_title": "A practical model on controlling the ERP implementation risks", "paper_id": "WOS:000273100000006"}