{"auto_keywords": [{"score": 0.04466418483879831, "phrase": "total_communication_volume"}, {"score": 0.00481495049065317, "phrase": "multiple_communication_cost_metrics"}, {"score": 0.004681413843223496, "phrase": "hypergraph_partitioning-based_methods"}, {"score": 0.004599831967997116, "phrase": "communicating_tasks"}, {"score": 0.004551563730037998, "phrase": "good_partitioning_method"}, {"score": 0.004317682099870507, "phrase": "inter-processor_communication_overhead"}, {"score": 0.004081385289516914, "phrase": "existing_state-of-the-art_hypergraph_partitioners"}, {"score": 0.00395417485449239, "phrase": "total_number"}, {"score": 0.003885216927966404, "phrase": "maximum_amount"}, {"score": 0.0035957586558176932, "phrase": "existing_hypergraph-based_solutions"}, {"score": 0.003410822685334396, "phrase": "different_metric"}, {"score": 0.0032697235411641695, "phrase": "one-phase_approach"}, {"score": 0.0031677308747058187, "phrase": "multi-objective_setting"}, {"score": 0.0030259817489390302, "phrase": "accurate_modeling"}, {"score": 0.002994178996584381, "phrase": "maximum_volume"}, {"score": 0.002810240488642749, "phrase": "directed_hypergraphs"}, {"score": 0.002227125088932002, "phrase": "large_number"}, {"score": 0.0022114807037424944, "phrase": "problem_instances"}, {"score": 0.0021805201234139475, "phrase": "better_partitions"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Hypergraph", " Graph", " Partitioning", " Load balancing"], "paper_abstract": "We investigate hypergraph partitioning-based methods for efficient parallelization of communicating tasks. A good partitioning method should divide the load among the processors as evenly as possible and minimize the inter-processor communication overhead. The total communication volume is the most popular communication overhead metric which is reduced by the existing state-of-the-art hypergraph partitioners. However, other metrics such as the total number of messages, the maximum amount of data transferred by a processor, or a combination of them are equally, if not more, important. Existing hypergraph-based solutions use a two phase approach to minimize such metrics where in each phase, they minimize a different metric, sometimes at the expense of others. We propose a one-phase approach where all the communication cost metrics can be effectively minimized in a multi-objective setting and reductions can be achieved for all metrics together. For an accurate modeling of the maximum volume and the number of messages sent and received by a processor, we propose the use of directed hypergraphs. The directions on hyperedges necessitate revisiting the standard partitioning heuristics. We do so and propose a multi-objective, multi-level hypergraph partitioner called UMPa. The partitioner takes various prioritized communication metrics into account, and optimizes all of them together in the same phase. Compared to the state-of-the-art methods which only minimize the total communication volume, we show on a large number of problem instances that UMPa produces better partitions in terms of several communication metrics. (C) 2014 Elsevier Inc. All rights reserved.", "paper_title": "Hypergraph partitioning for multiple communication cost metrics: Model and methods", "paper_id": "WOS:000351482400006"}