{"auto_keywords": [{"score": 0.046719933070759806, "phrase": "ict_capability"}, {"score": 0.011244211908581842, "phrase": "play_activity"}, {"score": 0.00481495049065317, "phrase": "ict_settings"}, {"score": 0.00476697427418509, "phrase": "mixed_method_approach"}, {"score": 0.004695900553353526, "phrase": "field_notes"}, {"score": 0.00425894920623546, "phrase": "initial_teacher_education_students"}, {"score": 0.00389164348807591, "phrase": "inter-related_issues"}, {"score": 0.0037480753312398754, "phrase": "learners'_self-esteem"}, {"score": 0.0036644799938707552, "phrase": "gender-related_characteristics"}, {"score": 0.003502821629168212, "phrase": "consistently_positive_relationship"}, {"score": 0.003485304124598714, "phrase": "learners'_self-belief"}, {"score": 0.0034679020274530742, "phrase": "ict"}, {"score": 0.0034505305823549024, "phrase": "subsequent_attainment"}, {"score": 0.003265365666305185, "phrase": "specific_ict_self-efficacy"}, {"score": 0.003129096013910623, "phrase": "average_attainment"}, {"score": 0.003036333273800443, "phrase": "significant_differences"}, {"score": 0.0028950342507292615, "phrase": "male_student_teachers"}, {"score": 0.0028805474861014722, "phrase": "significantly_higher_competence_levels"}, {"score": 0.0028375194604006843, "phrase": "higher_initial_skill_levels"}, {"score": 0.002665027876903161, "phrase": "greater_attainment"}, {"score": 0.0024348510123716424, "phrase": "older_children"}, {"score": 0.002327310963701377, "phrase": "important_factors"}, {"score": 0.0021369416775353107, "phrase": "already_disaffected_males"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["teaching/learning strategies", " pedagogical issues", " learning communities", " gender studies"], "paper_abstract": "Using a mixed method approach of questionnaires, observations and field notes, the authors have studied a number of settings during the past two years which have focussed on the development of ICT capability through play. Some of these have involved children identified as disaffected or disadvantaged, whilst others have involved initial teacher education students. In this paper, we consider some of the results obtained from the most recent of these settings, relate these to those obtained from the other settings, and explore further a number of inter-related issues which have arisen from the analysis. We particularly focus on the effect of learners' self-esteem and self-efficacy; the influence of gender-related characteristics; the role of interaction between learners during activity; and the Value of reflection. Our research found a consistently positive relationship between learners' self-belief with ICT and subsequent attainment through play activity, whereas their access to technology at home seems to have little effect on their subsequent learning. Furthermore, it was a specific ICT self-efficacy, rather than a more general self-esteem, which appeared to influence the development of ICT capability. The average attainment of boys and girls was very similar, but there were significant differences in the distributions in that the majority of the very high and very low achievers in terms of competences achieved were boys. Male student teachers attained significantly higher competence levels even after taking account of higher initial skill levels. The degree of interaction between learners varied between groups, and although this was not measured directly, there was some evidence of greater attainment by those who shared ideas together. Our results suggest that play activity can be very successful in developing aspects of ICT capability, and that play may be valuable as a mode of learning with adults and older children as well as the young children with which it is usually associated. However, there are important factors to be considered in order to provide the conditions needed for success, and it will be important that we do not disadvantage further those who are least confident with technology and the already disaffected males. (c) 2005 Elsevier Ltd. All rights reserved.", "paper_title": "Factors influencing learning through play in ICT settings", "paper_id": "WOS:000235501800005"}