{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "web_real-time_communication"}, {"score": 0.04855973119679857, "phrase": "webrtc"}, {"score": 0.0047379542803396915, "phrase": "distributed_hash_table"}, {"score": 0.004606148097788071, "phrase": "browser-to-browser_communications"}, {"score": 0.004318422955036175, "phrase": "signaling_protocol"}, {"score": 0.00421520166010848, "phrase": "session_description_protocol"}, {"score": 0.0036898803847106023, "phrase": "scalable_webrtc"}, {"score": 0.003616189733352126, "phrase": "main_idea"}, {"score": 0.003515479934694842, "phrase": "peer-to-peer_topology"}, {"score": 0.003269162006886173, "phrase": "central_server"}, {"score": 0.0030895394261534776, "phrase": "signaling_process"}, {"score": 0.0029197572138773237, "phrase": "bootstrap_method"}, {"score": 0.002884603537502399, "phrase": "stabilization_scheme"}, {"score": 0.0028498718992429825, "phrase": "peer_lookup"}, {"score": 0.0027370835853738626, "phrase": "webrtc_connections"}, {"score": 0.00266079124891013, "phrase": "churn_condition"}, {"score": 0.0025866199378466754, "phrase": "proposed_protocol"}, {"score": 0.0025658094607383646, "phrase": "pure_javascript"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["WebRTC", " Distributed hash table", " Signaling protocol", " Peer-to-peer"], "paper_abstract": "Web real-time communication (WebRTC) provides browser-to-browser communications without installing any plug-in. In WebRTC, peers have to prepare their communication session through a signaling protocol which coordinates peers and exchanges Session Description Protocol (SDP) message between two peers. The problem is that the most well known signaling method cannot provide the scalability because the method relies on only single server. To overcome the problem, this paper presents a scalable WebRTC signaling protocol. The main idea is that each peer forms a peer-to-peer topology by structuring relevant WebRTC connections with each other and then sends signals across those connections. The central server needs to handle only a few connection establishments for newly joining peers. The rest of the signaling process can be performed by peers. We define and justify such a protocol including a bootstrap method, a stabilization scheme, and peer lookup. The procedures are designed to be suitable for WebRTC connections and to be resilient against the churn condition. Furthermore, we implement the proposed protocol in pure JavaScript to show that it is realizable. The performance of the implementation is practical, with signaling latency averaging 0.5 s when the number of peers is 1000. Each peer still correctly locates the other peers even when the network is very congested. (C) 2015 Elsevier B.V. All rights reserved.", "paper_title": "Scalable signaling protocol for Web real-time communication based on a distributed hash table", "paper_id": "WOS:000364268000003"}