{"auto_keywords": [{"score": 0.049675053299362525, "phrase": "orthogonal_ray_graphs"}, {"score": 0.03735216566870487, "phrase": "strong_edge_coloring_problem"}, {"score": 0.014095845429388937, "phrase": "vertical_ray"}, {"score": 0.011965321767357219, "phrase": "dominating_set_problem"}, {"score": 0.011815275444491263, "phrase": "induced_matching_problem"}, {"score": 0.0083982355186082, "phrase": "weighted_induced_matching_problem"}, {"score": 0.00481495049065317, "phrase": "induced_matchings"}, {"score": 0.004714023408114857, "phrase": "orthogonal_ray_graph"}, {"score": 0.0046544807197808095, "phrase": "intersection_graph"}, {"score": 0.004615202066192795, "phrase": "horizontal_and_vertical_rays"}, {"score": 0.004046923261950549, "phrase": "horizontal_ray"}, {"score": 0.0039119492240482, "phrase": "structural_properties"}, {"score": 0.0037178503842258087, "phrase": "polynomial-time_algorithms"}, {"score": 0.0031777570808834213, "phrase": "weighted_dominating_set_problem"}, {"score": 0.0029191527226078286, "phrase": "fixed_size"}], "paper_keywords": ["boolean-width", " dominating set", " induced matching", " orthogonal ray graphs", " strong edge coloring"], "paper_abstract": "An orthogonal ray graph is an intersection graph of horizontal and vertical rays (closed half-lines) in the plane. Such a graph is 3-directional if every vertical ray has the same direction, and 2-directional if every vertical ray has the same direction and every horizontal ray has the same direction. We derive some structural properties of orthogonal ray graphs, and based on these properties, we introduce polynomial-time algorithms that solve the dominating set problem, the induced matching problem, and the strong edge coloring problem for these graphs. We show that for 2-directional orthogonal ray graphs, the dominating set problem can be solved in O(n(2) log(5) n) time, the weighted dominating set problem can be solved in O(n(4) log n) time, and the number of dominating sets of a fixed size can be computed in O(n(6) log n) time, where n is the number of vertices in the graph. We also show that for 2-directional orthogonal ray graphs, the weighted induced matching problem and the strong edge coloring problem can be solved in O(n(2) + m log n) time, where m is the number of edges in the graph. Moreover, we show that for 3-directional orthogonal ray graphs, the induced matching problem can be solved in O(m(2)) time, the weighted induced matching problem can be solved in O(m(4)) time, and the strong edge coloring problem can be solved in O(m(3)) time. We finally show that the weighted induced matching problem can be solved in O(m(6)) time for orthogonal ray graphs.", "paper_title": "Dominating Sets and Induced Matchings in Orthogonal Ray Graphs", "paper_id": "WOS:000348141600014"}