{"auto_keywords": [{"score": 0.031897346527701494, "phrase": "drug_policy_groups"}, {"score": 0.015719716506582538, "phrase": "conferencing_technologies"}, {"score": 0.004760765880314089, "phrase": "drug_policy_group_knowledge_exchange_processes"}, {"score": 0.004381527499253281, "phrase": "conferencing_technology"}, {"score": 0.004203343568960231, "phrase": "action_case_research_method"}, {"score": 0.00340217066797559, "phrase": "observation_notes"}, {"score": 0.0033385105985286154, "phrase": "meeting_transcripts"}, {"score": 0.003313380246267812, "phrase": "content_analysis"}, {"score": 0.003214730261140886, "phrase": "nivio_qualitative_data_analysis_software"}, {"score": 0.0031308163228919773, "phrase": "six_key_lessons"}, {"score": 0.0030375852871252934, "phrase": "knowledge_exchange"}, {"score": 0.002870173628745123, "phrase": "group_communication"}, {"score": 0.0028271058251633815, "phrase": "web-conferencing_communication"}, {"score": 0.0026511422582578027, "phrase": "group_interactions"}, {"score": 0.0025239898026543964, "phrase": "successful_knowledge_exchange"}, {"score": 0.002305014991156598, "phrase": "distant_knowledge_exchange"}, {"score": 0.00227040825063645, "phrase": "key_lessons"}, {"score": 0.0021778895748464045, "phrase": "successful_knowledge_exchange_activities"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ireland_ltd."}], "paper_keywords": ["Action case", " Health informatics", " Knowledge exchange", " Information and communication technology", " Conferencing technology"], "paper_abstract": "Objectives: To describe experiences, lessons and the implications related to the use of conferencing technology to support three drug policy research groups within a three-year period, using the action case research method. Design: An action case research field study was executed. Three different drug policy groups participated: research, educator, and decision-maker task groups. There were a total of 61 participants in the study. The study was conducted between 2004 and 2007. Each group used audio-teleconferencing, web-conferencing or both to support their knowledge exchange activities. Measurements: Datawere collected over three years and consisted of observation notes, interviews, and meeting transcripts. Content analysis was used to analyze the data using NIVIO qualitative data analysis software. Results: The study found six key lessons regarding the impact of conferencing technologies on knowledge exchange within drug policy groups. We found that 1) groups adapt to technology to facilitate group communication, 2) web-conferencing communication is optimal under certain conditions, 3) audio conferencing is convenient, 4) web-conferencing forces group interactions to be \"within text\", 5) facilitation contributes to successful knowledge exchange, and 6) technology impacts information sharing. Conclusions: This study highlights lessons related to the use of conferencing technologies to support distant knowledge exchange within drug policy groups. Key lessons from this study can be used by drug policy groups to support successful knowledge exchange activities using conferencing technologies. (C) 2010 Elsevier Ireland Ltd. All rights reserved.", "paper_title": "The use of conferencing technologies to support drug policy group knowledge exchange processes: An action case approach", "paper_id": "WOS:000288201100003"}