{"auto_keywords": [{"score": 0.04954397446159371, "phrase": "weighted_constraints"}, {"score": 0.010612387000973441, "phrase": "entity_resolution"}, {"score": 0.00413684709497912, "phrase": "er_tasks"}, {"score": 0.0036553070575015344, "phrase": "natural_choice"}, {"score": 0.002984867789900281, "phrase": "unified_framework"}, {"score": 0.0026820015810254004, "phrase": "er_model"}, {"score": 0.002506715532901322, "phrase": "domain_knowledge"}, {"score": 0.0024097920845706795, "phrase": "efficiently_weighted_constraints"}, {"score": 0.0023166075278110237, "phrase": "er_clustering"}, {"score": 0.0022522565004588113, "phrase": "propagation_order"}, {"score": 0.0022270182923887012, "phrase": "multiple_entity_types"}, {"score": 0.0021049977753042253, "phrase": "improved_er_quality"}], "paper_keywords": ["Constraints", " Data Matching", " Deduplication", " Entity Resolution", " Record Linkage", " Weights"], "paper_abstract": "Constraints ubiquitously exist in many real-life applications for entity resolution. However, it is always challenging to effectively specify and use such constraints for performing ER tasks. In particular, not every constraint is equally robust. Adding weights to express the \"confidence\" on constraints thus becomes a natural choice. In this paper, the authors study entity resolution (ER), the problem of determining which records in one or more databases refer to the same entities, in the presence of weighted constraints. They propose a unified framework that allows us to associate a weight for each constraint, capturing the confidence for its robustness in an ER model. The authors develop an approach to learn weighted constraints based on domain knowledge, and investigate how effectively and efficiently weighted constraints can be used for generating an ER clustering and for determining a propagation order across multiple entity types. Their experimental study shows that using weighted constraints can lead to improved ER quality and scalability.", "paper_title": "Scaling with Confidence: Entity Resolution under Weighted Constraints", "paper_id": "WOS:000384849000005"}