{"auto_keywords": [{"score": 0.04812305996521059, "phrase": "mechanical_behavior"}, {"score": 0.004583464412234181, "phrase": "thin_elastic_shells"}, {"score": 0.004346547997061901, "phrase": "hyperbolic_shells"}, {"score": 0.004297388539539564, "phrase": "principal_curvatures"}, {"score": 0.004168986485488861, "phrase": "koiter_model"}, {"score": 0.004013843843250455, "phrase": "corresponding_system"}, {"score": 0.003923532450854754, "phrase": "relative_thickness_epsilon"}, {"score": 0.0036784938661226104, "phrase": "first_part"}, {"score": 0.0035685175471526823, "phrase": "internal_layers"}, {"score": 0.0035147642199945387, "phrase": "singular_perturbation_process"}, {"score": 0.0032578629307203097, "phrase": "asymptotic_lines"}, {"score": 0.0032209766681045365, "phrase": "middle_surface"}, {"score": 0.002974171397771052, "phrase": "asymptotic_line"}, {"score": 0.002613935123129054, "phrase": "good_description"}, {"score": 0.0024319378563138223, "phrase": "adaptive_mesh_procedure"}, {"score": 0.0023952639120005193, "phrase": "second_part"}, {"score": 0.002350196395175188, "phrase": "numerical_computations"}, {"score": 0.0021049977753042253, "phrase": "remeshing_procedure"}], "paper_keywords": ["shell theory", " singular perturbation", " anisotropic mesh", " internal layers"], "paper_abstract": "This paper is devoted to the study of the mechanical behavior of thin elastic shells when their relative thickness epsilon tends to zero. We focus on the case of hyperbolic shells whose middle surface has principal curvatures of opposite signs everywhere. We use the Koiter model to describe the mechanical behavior of the shell. The corresponding system, which depends on the relative thickness epsilon, is elliptic except at the limit for epsilon=0 where it is hyperbolic. In a first part, we study theoretically the phenomena of internal layers appearing during the singular perturbation process, when the loading is somewhat singular. These layers have very different structures either they are along or across the asymptotic lines of the middle surface of the shell. Moreover, we may have pseudo-reflections when a part of the boundary is not along an asymptotic line of the surface. In any case, the layers become very thin when epsilon tends to zero and the displacements inside the layers tends to infinity. In order to have a good description of the singularities of the displacements inside the layers, we propose here to use an anisotropic and adaptive mesh procedure. In a second part, we will present numerical computations performed with such meshes. They enable us to approach accurately the singularities inside the layers predicted by the theory. Finally, we test the behavior of the remeshing procedure when the shell is non-inhibited.", "paper_title": "Anisotropic adaptive mesh procedure for computing very thin hyperbolic shells", "paper_id": "WOS:000258527500012"}