{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "probability_trees"}, {"score": 0.014542150195867836, "phrase": "pruning_criterion"}, {"score": 0.004707913053935566, "phrase": "decision_trees"}, {"score": 0.00462919213721188, "phrase": "class_probabilities"}, {"score": 0.004327196832280818, "phrase": "probability_tree"}, {"score": 0.003802135020791801, "phrase": "classification_accuracy"}, {"score": 0.003474799999519295, "phrase": "probability_estimates"}, {"score": 0.002743105561254975, "phrase": "extensive_experimental_study"}, {"score": 0.0026971491199975083, "phrase": "relative_performance"}, {"score": 0.002651960559564796, "phrase": "pruning_criteria"}, {"score": 0.002607527117561699, "phrase": "main_conclusion"}, {"score": 0.0024926348205500715, "phrase": "randomization_tests"}, {"score": 0.0023694065215394593, "phrase": "extreme_data_characteristics"}, {"score": 0.002264982416465872, "phrase": "high_number"}], "paper_keywords": ["Decision trees", " Pruning", " Probability estimation", " Randomization tests"], "paper_abstract": "Probability trees are decision trees that predict class probabilities rather than the most likely class. The pruning criterion used to learn a probability tree strongly influences the size of the tree and thereby also the quality of its probability estimates. While the effect of pruning criteria on classification accuracy is well-studied, only recently has there been more interest in the effect on probability estimates. Hence, it is currently unclear which pruning criteria for probability trees are preferable under which circumstances. In this paper we survey six of the most important pruning criteria for probability trees, and discuss their theoretical advantages and disadvantages. We also perform an extensive experimental study of the relative performance of these pruning criteria. The main conclusion is that overall a pruning criterion based on randomization tests performs best because it is most robust to extreme data characteristics (such as class skew or a high number of classes). We also identify and explain several shortcomings of the other pruning criteria.", "paper_title": "A comparison of pruning criteria for probability trees", "paper_id": "WOS:000272849400008"}