{"auto_keywords": [{"score": 0.04967913398382335, "phrase": "two-stage_categorization"}, {"score": 0.04212874885446882, "phrase": "music_segmentation"}, {"score": 0.03145061224443909, "phrase": "music_clip"}, {"score": 0.015719716506582538, "phrase": "self-similarity_matrix"}, {"score": 0.010457188722428457, "phrase": "timbre_feature"}, {"score": 0.004636594774238505, "phrase": "distinct_structure"}, {"score": 0.004192484908247302, "phrase": "music_information_retrieval"}, {"score": 0.003986581218661184, "phrase": "structure_analysis"}, {"score": 0.003712011863784581, "phrase": "significant_variations"}, {"score": 0.0035001037990786727, "phrase": "challenging_task"}, {"score": 0.003370287778450475, "phrase": "novel_method"}, {"score": 0.0031512402798625056, "phrase": "acoustic_music_signal"}, {"score": 0.002885135695263876, "phrase": "candidate_boundaries"}, {"score": 0.002813307389456184, "phrase": "standard_deviation"}, {"score": 0.0023879771786116228, "phrase": "successive_chromagram_features"}], "paper_keywords": ["Music structure", " Music segmentation", " Signal processing", " Self-similarity matrix"], "paper_abstract": "Music tends to have a distinct structure consisting of repetition and variation of components such as verse and chorus. Understanding such a music structure and its pattern has become increasingly important for music information retrieval (MIR). Thus far, many different methods for music segmentation and structure analysis have been proposed; however, each method has its advantages and disadvantages. By considering the significant variations in timbre, articulation and tempo of music, this is still a challenging task. In this paper, we propose a novel method for music segmentation and its structure analysis. For this, we first extract the timbre feature from the acoustic music signal and construct a self-similarity matrix that shows the similarities among the features within the music clip. Further, we determine the candidate boundaries for music segmentation by tracking the standard deviation in the matrix. Furthermore, we perform two-stage categorization: (i) categorization of the segments in a music clip on the basis of the timbre feature and (ii) categorization of segments in the same category on the basis of the successive chromagram features. In this way, each music clip is represented by a sequence of states where each state represents a certain category defined by two-stage categorization. We show the performance of our proposed method through experiments.", "paper_title": "Music structure analysis using self-similarity matrix and two-stage categorization", "paper_id": "WOS:000348356300019"}