{"auto_keywords": [{"score": 0.046295259069903005, "phrase": "discrete_mesh"}, {"score": 0.010066103326633734, "phrase": "dielectric_properties"}, {"score": 0.007688432819112381, "phrase": "basis_functions"}, {"score": 0.006159199675795087, "phrase": "inverse_problem"}, {"score": 0.005126952659199571, "phrase": "original_discrete_mesh"}, {"score": 0.00481495049065317, "phrase": "patient-specific_basis_functions"}, {"score": 0.004700027722284931, "phrase": "microwave_tomography"}, {"score": 0.00450000390667755, "phrase": "patient's_breast"}, {"score": 0.004026505114417176, "phrase": "computational_challenges"}, {"score": 0.00393032656248792, "phrase": "new_approach"}, {"score": 0.0037811784409635023, "phrase": "relatively_small_number"}, {"score": 0.003744780941673966, "phrase": "smooth_basis_functions"}, {"score": 0.003637669525737665, "phrase": "tomography_problem"}, {"score": 0.003115908199991072, "phrase": "breast_surface"}, {"score": 0.002869793011316547, "phrase": "computational_complexity"}, {"score": 0.002828418443899226, "phrase": "reduced_dimension"}, {"score": 0.0024578987081792405, "phrase": "single-frequency_microwave_tomography"}, {"score": 0.0021049977753042253, "phrase": "multiple-frequency_algorithm"}], "paper_keywords": ["Breast cancer", " computation time", " electromagnetic tomography", " finite-difference time-domain (FDTD) methods", " inverse problems", " microwave imaging"], "paper_abstract": "Breast imaging via microwave tomography involves estimating the distribution of dielectric properties within the patient's breast on a discrete mesh. The number of unknowns in the discrete mesh can be very large for 3-D imaging, and this results in computational challenges. We propose a new approach where the discrete mesh is replaced with a relatively small number of smooth basis functions. The dimension of the tomography problem is reduced by estimating the coefficients of the basis functions instead of the dielectric properties at each element in the discrete mesh. The basis functions are constructed using knowledge of the location of the breast surface. The number of functions used in the basis can be varied to balance resolution and computational complexity. The reduced dimension of the inverse problem enables application of a computationally efficient, multiple-frequency inverse scattering algorithm in 3-D. The efficacy of the proposed approach is verified using two 3-D anatomically realistic numerical breast phantoms. It is shown for the case of single-frequency microwave tomography that the imaging accuracy is comparable to that obtained when the original discrete mesh is used, despite the reduction of the dimension of the inverse problem. Results are also shown for a multiple-frequency algorithm where it is computationally challenging to use the original discrete mesh.", "paper_title": "Three-Dimensional Microwave Breast Imaging: Dispersive Dielectric Properties Estimation Using Patient-Specific Basis Functions", "paper_id": "WOS:000267698100001"}