{"auto_keywords": [{"score": 0.04491687458404757, "phrase": "user's_expectations"}, {"score": 0.004814958357143643, "phrase": "minimalist"}, {"score": 0.004149792080414689, "phrase": "virtual_beings"}, {"score": 0.004095692768056685, "phrase": "virtual_being"}, {"score": 0.004007083686875716, "phrase": "simple_smiley"}, {"score": 0.003802135020791801, "phrase": "valence_dimensions"}, {"score": 0.003671338229632309, "phrase": "simple_way"}, {"score": 0.003408091901859624, "phrase": "arousal_value"}, {"score": 0.0033636292024305406, "phrase": "flocking_algorithm"}, {"score": 0.003305243635051068, "phrase": "valence_value"}, {"score": 0.003219553875143356, "phrase": "smileys'_mouth"}, {"score": 0.003108735847242537, "phrase": "user_experiment"}, {"score": 0.002737960968372391, "phrase": "mouth_curvature"}, {"score": 0.0026786469998321084, "phrase": "particular_emotions"}, {"score": 0.0022089663761854657, "phrase": "proposed_model"}, {"score": 0.0021610874773389096, "phrase": "compared_models"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Expression of emotions", " Smileys", " Virtual characters", " Flocking algorithms"], "paper_abstract": "This paper proposes and explores an approach to express emotions which intends to minimize the user's expectations. The approach uses a flock of virtual beings where each virtual being is represented as a simple smiley. Emotions are represented in terms of the arousal and the valence dimensions and they are visually expressed in a simple way through the behaviour and appearance of the individuals in the flock. In particular, the arousal value parameterizes the flocking algorithm, and the valence value determines the curvature of the smileys' mouth. Furthermore, the paper describes a user experiment which investigated whether the arousal and the valence expressed by our model are appropriately perceived by the users or not. The results suggest that combinations of movement and mouth curvature are perceived correctly as particular emotions, that movement and mouth curvature are perceived as arousal and valence respectively and that they are independent of each other. The experiment also compared our approach with both a state-of-the-art virtual character and a minimalist character in terms of user's expectations. The results suggest that the proposed model generates less expectations than the compared models. (C) 2011 Elsevier Ltd. All rights reserved.", "paper_title": "Minimalist approach to show emotions via a flock of smileys", "paper_id": "WOS:000291846700025"}