{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "bibliographic_databases"}, {"score": 0.04833320368251523, "phrase": "university-industry_cooperation"}, {"score": 0.030735314503319948, "phrase": "university-industry_cooperation_research_field"}, {"score": 0.004596561972944185, "phrase": "citespace"}, {"score": 0.004532988904965752, "phrase": "visual_document_analysis_software"}, {"score": 0.004092774981286263, "phrase": "frontier_research"}, {"score": 0.00379961236486522, "phrase": "quantitative_study"}, {"score": 0.0036951530348821116, "phrase": "university-industry_collaboration_studies"}, {"score": 0.003140401552000472, "phrase": "key_elements"}, {"score": 0.0030398432591176357, "phrase": "largest_share"}, {"score": 0.0027827907725673845, "phrase": "frequently_cited_authors"}, {"score": 0.0025474193855847074, "phrase": "special_note"}, {"score": 0.0022467024793003812, "phrase": "case_study"}, {"score": 0.0022052711621931144, "phrase": "quantitative_method"}, {"score": 0.0021746987512551693, "phrase": "new_research_framework"}, {"score": 0.0021049977753042253, "phrase": "research_areas"}], "paper_keywords": ["Bibliometrics", " Visualizing", " Quantitative", " CiteSpace", " University-industry collaboration"], "paper_abstract": "CiteSpace is a visual document analysis software, by which performances and trends of certain disciplines can be displayed for a given period. Moreover, the evolution of a frontier research can be explored by such software as well. This research focuses on the visualization and quantitative study in bibliographic databases by taking the university-industry collaboration studies as an example. Using the Web of Science (WOS), 587 publications and over 30,000 references were selected for analysis, which produced the following results: (1) Our method can clearly reveal the key elements of certain disciplines, such as the largest share of publications, the most frequently cited authors and journals in the university-industry cooperation research field; (2) The relationships among the frequently cited authors, references, journals and keywords can be explained visually in the university-industry cooperation research field; (3) Of special note is that the potential problems and evolutionary trends of certain research fields such as university-industry cooperation can also be ascertained via our method; (4) In general, according to the case study, our visualization and quantitative method evolved a new research framework to evaluate the performance of some research areas. (C) 2014 Elsevier Ltd. All rights reserved.", "paper_title": "Visualization and quantitative study in bibliographic databases: A case in the field of university-industry cooperation", "paper_id": "WOS:000349770500013"}