{"auto_keywords": [{"score": 0.04862717445897774, "phrase": "barge_handling_process"}, {"score": 0.00481495049065317, "phrase": "terminal_cooperativeness"}, {"score": 0.004504193207111593, "phrase": "different_degrees"}, {"score": 0.0038810583785936505, "phrase": "alignment_process"}, {"score": 0.0037632749713937637, "phrase": "different_players"}, {"score": 0.003724810609448597, "phrase": "especially_terminal_operators"}, {"score": 0.0036490529923833884, "phrase": "earlier_study"}, {"score": 0.003574830654211291, "phrase": "multi-agent_system"}, {"score": 0.003275807170434343, "phrase": "reliable_appointments"}, {"score": 0.002851301751761804, "phrase": "experimental_results"}, {"score": 0.0026532596852754525, "phrase": "lowly_cooperative_case"}, {"score": 0.00248167018931442, "phrase": "barge_operators"}, {"score": 0.0024186620196958867, "phrase": "extensive_discussion"}, {"score": 0.0023331227492950422, "phrase": "useful_insights"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Cooperativeness", " Barge handling problem", " Simulation", " Multi-Agent systems"], "paper_abstract": "We study the effect of different degrees of cooperativeness on the efficiency of the barge handling process. The barge handling process is about the alignment of barge and terminal operations in a port. The efficiency of this alignment process depends on the cooperation of different players and especially terminal operators. In an earlier study we developed a Multi-Agent system assuming that terminals are fully cooperative, i.e., they provide insight in their occupation and make reliable appointments. In practice, terminals might decide to be less cooperative. We consider three degrees of cooperativeness: low, partly, and full cooperativeness. Experimental results indicate that there are two reasonable alternatives: full and low cooperativeness. In the lowly cooperative case, the lack of cooperativeness of terminals is compensated by cooperation among barge operators. We provide an extensive discussion on both alternatives. Our results provide useful insights for barge and terminal operators in the options they have to improve the barge handling process. (C) 2010 Elsevier Ltd. All rights reserved.", "paper_title": "Degrees of terminal cooperativeness and the efficiency of the barge handling process", "paper_id": "WOS:000286904600074"}