{"auto_keywords": [{"score": 0.042294571292837035, "phrase": "conficker"}, {"score": 0.009586286913676125, "phrase": "future_malware_defense"}, {"score": 0.0043764594918057915, "phrase": "conficker_infections"}, {"score": 0.004328494656899359, "phrase": "large_scale"}, {"score": 0.003948613642680196, "phrase": "current_and_new_trends"}, {"score": 0.003778253716938922, "phrase": "future_malware_trends"}, {"score": 0.003510439768484619, "phrase": "new_malware_spreading_models"}, {"score": 0.0033712944392793195, "phrase": "potential_power"}, {"score": 0.00322576184471691, "phrase": "malicious_operations"}, {"score": 0.003097865379563127, "phrase": "reputation-based_blacklisting_approach"}, {"score": 0.003030247482854539, "phrase": "new_malware_threats"}, {"score": 0.0028887478408328913, "phrase": "dshield"}, {"score": 0.002867571893308499, "phrase": "fire"}, {"score": 0.0027946649584841754, "phrase": "previous_study"}, {"score": 0.0027437235598539904, "phrase": "blacklist-based_approach"}, {"score": 0.0026838147966444783, "phrase": "reputation-based_approaches"}, {"score": 0.002511803988580901, "phrase": "existing_reputation-based_techniques"}, {"score": 0.0022909940601580675, "phrase": "surprisingly_effective_approach"}, {"score": 0.002175913488493802, "phrase": "neighborhood_networks"}, {"score": 0.002136226584784576, "phrase": "promising_approach"}], "paper_keywords": ["Botnet", " botnet defense", " botnet measurement", " conficker"], "paper_abstract": "Conficker is the most recent widespread, well-known worm/bot. According to several reports, it has infected about 7 million to 15 million hosts and the victims are still increasing even now. In this paper, we analyze Conficker infections at a large scale, about 25 million victims, and study various interesting aspects about this state-of-the-art malware. By analyzing Conficker, we intend to understand current and new trends in malware propagation, which could be very helpful in predicting future malware trends and providing insights for future malware defense. We observe that Conficker has some very different victim distribution patterns compared to many previous generation worms/botnets, suggesting that new malware spreading models and defense strategies are likely needed. We measure the potential power of Conficker to estimate its effects on the networks/hosts when it performs malicious operations. Furthermore, we intend to determine how well a reputation-based blacklisting approach can perform when faced with new malware threats such as Conficker. We cross-check several DNS blacklists and IP/AS reputation data from Dshield and FIRE and our evaluation shows that unlike a previous study which shows that a blacklist-based approach can detect most bots, these reputation-based approaches did relatively poorly for Conficker. This raises a question of how we can improve and complement existing reputation-based techniques to prepare for future malware defense? Based on this, we look into some insights for defenders. We show that neighborhood watch is a surprisingly effective approach in the case of Conficker. This suggests that security alert sharing/correlation (particularly among neighborhood networks) could be a promising approach and play a more important role for future malware defense.", "paper_title": "A Large-Scale Empirical Study of Conficker", "paper_id": "WOS:000301506500028"}