{"auto_keywords": [{"score": 0.0497377294589231, "phrase": "association_analysis"}, {"score": 0.04218988994298027, "phrase": "diagnostic_triads"}, {"score": 0.04020301179820954, "phrase": "chronic_diseases"}, {"score": 0.004679134285953932, "phrase": "clinical_practice"}, {"score": 0.004233119608341877, "phrase": "possible_combinations"}, {"score": 0.004172957742905294, "phrase": "abnormal_exam_findings"}, {"score": 0.00409895142748329, "phrase": "particular_disease"}, {"score": 0.003969018740062018, "phrase": "empirical_observations"}, {"score": 0.003802135020791801, "phrase": "data_mining_procedures"}, {"score": 0.0037213333316218522, "phrase": "combinations'_validity"}, {"score": 0.003552084379143929, "phrase": "examination_findings"}, {"score": 0.003247868216333148, "phrase": "internal_medicine"}, {"score": 0.002937879003671346, "phrase": "abnormal_findings"}, {"score": 0.0028446460307503343, "phrase": "data_mining_technique"}, {"score": 0.002676514445417281, "phrase": "blood_tests"}, {"score": 0.0025364139244227436, "phrase": "commodity_pc."}, {"score": 0.00249135867469492, "phrase": "normal_items"}, {"score": 0.0024122616475793206, "phrase": "total_number"}, {"score": 0.00235247790591897, "phrase": "combinatorial_analysis"}, {"score": 0.0022133711375320244, "phrase": "diagnostic_data"}], "paper_keywords": ["data mining", " association analysis", " medical data", " three clinical findings", " diagnostic triad"], "paper_abstract": "In diagnosing diseases in clinical practice, a combination of three clinical findings is often used to represent each disease. This is largely because it is often difficult or impractical to assess for all possible combinations of symptoms and abnormal exam findings that occur in any particular disease. For most diseases, diagnostic triads are based on empirical observations. In this study, we determined diagnostic triads for chronic diseases using data mining procedures. We also verified the combinations' validity as well as our procedure for determining them. We used symptoms and examination findings from 477 patients with chronic diseases, collected as part of a 35-year longitudinal study begun in 1968. For each patient there were 295 items from examinations in internal medicine, dermatology, ophthalmology, dentistry and blood tests. We judged each item to be either normal or abnormal, and restricted the analysis to the abnormal findings. To analyze such an exhaustive assortment, we used the data mining technique of association analysis. The analysis generated three clinical findings for each disease. Diseases were defined based on blood tests. Searching through all 295 items to find the three most useful clinical findings would be impractical on a commodity PC. However, by excluding normal items, we were able to sufficiently reduce the total number of combinations so as to make combinatorial analysis on a PC feasible. In addition to more accurate diagnoses, we believe our technique can identify those diagnostic data that are more cost effective in terms of time and other resources required for their collection.", "paper_title": "A technique for identifying three diagnostic findings using association analysis", "paper_id": "WOS:000243621200007"}