{"auto_keywords": [{"score": 0.04925653227018551, "phrase": "social_sciences"}, {"score": 0.010525750517378163, "phrase": "ssh"}, {"score": 0.008858271058926582, "phrase": "ssh."}, {"score": 0.008314853722033635, "phrase": "thomson_scientific_databases"}, {"score": 0.00481495049065317, "phrase": "scientific_output"}, {"score": 0.004544629724830453, "phrase": "existing_databases"}, {"score": 0.004215677131963292, "phrase": "linguistic_coverage"}, {"score": 0.0036694287631595995, "phrase": "strong_link"}, {"score": 0.0035648266669315943, "phrase": "thomson_scientific's_database"}, {"score": 0.003138768436081888, "phrase": "natural_sciences"}, {"score": 0.0026691455928407022, "phrase": "methods_section"}, {"score": 0.002489996212974326, "phrase": "nse"}, {"score": 0.002418923027024191, "phrase": "ulrich_extensive_database"}, {"score": 0.0022565201625076876, "phrase": "english-language_journals"}, {"score": 0.0022305310659333864, "phrase": "thomson_scientific's"}, {"score": 0.0021050035748797183, "phrase": "ulrich"}], "paper_keywords": [""], "paper_abstract": "The goal of this paper is to examine the impact of linguistic coverage of databases used by bibliometricians on the capacity to effectively benchmark the work of researchers in social sciences and humanities. We examine the strong link between bibliometrics and the Thomson Scientific's database and review the differences in the production and diffusion of knowledge in the social sciences and humanities (SSH) and the natural sciences and engineering (NSE). This leads to a re-examination of the debate on the coverage of these databases, more specifically in the SSH. The methods section explains how we have compared the coverage of Thomson Scientific databases in the NSE and SSH to the Ulrich extensive database of journals. Our results show that there is a 20 to 25% overrepresentation of English-language journals in Thomson Scientific's databases compared to the list of journals presented in Ulrich. This paper concludes that because of this bias, Thomson Scientific databases cannot be used in isolation to benchmark the output of countries in the SSH.", "paper_title": "Benchmarking scientific output in the social sciences and humanities: The limits of existing databases", "paper_id": "WOS:000239300600002"}