{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "lukasiewicz_games"}, {"score": 0.015163796190289671, "phrase": "boolean_games"}, {"score": 0.010009949122436673, "phrase": "lukasiewicz_logics"}, {"score": 0.00467677555573346, "phrase": "quantitative_strategic_interactions"}, {"score": 0.004316812490871324, "phrase": "individual_goals"}, {"score": 0.004269913167716059, "phrase": "standard_critique"}, {"score": 0.004132237700479874, "phrase": "strictly_dichotomous_nature"}, {"score": 0.0040873354289955605, "phrase": "preference_relations"}, {"score": 0.004042919099733537, "phrase": "boolean_goals"}, {"score": 0.003357343256340741, "phrase": "nonlogical_structures"}, {"score": 0.003296713221268488, "phrase": "nondichotomous_preferences"}, {"score": 0.0028807066376546502, "phrase": "utility_functions"}, {"score": 0.002808104467715375, "phrase": "classical_boolean_logic"}, {"score": 0.002747328139245956, "phrase": "continuous_piecewise_linear_polynomial_function"}, {"score": 0.002391739069644444, "phrase": "detailed_worked_examples"}, {"score": 0.0022315557620621205, "phrase": "logical_characterisation"}, {"score": 0.0021912115487610286, "phrase": "nash_equilibria"}, {"score": 0.0021752783872387173, "phrase": "finite_and_infinite_lukasiewicz_games"}, {"score": 0.0021049977753042253, "phrase": "computational_complexity"}], "paper_keywords": ["Logic", " games", " Lukasiewicz logics", " knowledge representation", " multiagent systems"], "paper_abstract": "Boolean games provide a simple, compact, and theoretically attractive abstract model for studying multiagent interactions in settings where players will act strategically in an attempt to achieve individual goals. A standard critique of Boolean games, however, is that the strictly dichotomous nature of the preference relations induced by Boolean goals inevitably trivialises the nature of such strategic interactions: a player is assumed to be indifferent between all outcomes that satisfy her goal, and indifferent between all outcomes that do not satisfy her goal. While various proposals have been made to overcome this limitation, many of these proposals require the inclusion of nonlogical structures into games to capture nondichotomous preferences. In this article, we introduce Lukasiewicz games, which overcome this limitation by allowing goals to be specified using Lukasiewicz logics. By expressing goals as formulae of Lukasiewicz logics, we can express a much richer class of utility functions for players than is possible using classical Boolean logic: we can express every continuous piecewise linear polynomial function with rational coefficients over [0, 1](n) as well as their finite-valued restrictions over {0, 1/k, ..., (k - 1)/k, 1}(n). We thus obtain a representation of nondichotomous preference structures within a purely logical framework. After introducing the formal framework of Lukasiewicz games, we present a number of detailed worked examples to illustrate the framework, and then investigate some of their theoretical properties. In particular, we present a logical characterisation of the existence of Nash equilibria in finite and infinite Lukasiewicz games. We conclude by briefly discussing issues of computational complexity.", "paper_title": "Lukasiewicz Games: A Logic-Based Approach to Quantitative Strategic Interactions", "paper_id": "WOS:000365216500006"}