{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "mobile_agents"}, {"score": 0.00469678464293492, "phrase": "decontamination_problem"}, {"score": 0.004653220443592979, "phrase": "hypercube_network"}, {"score": 0.004345804626592329, "phrase": "sufficient_number"}, {"score": 0.004239103253656808, "phrase": "mobile_entity"}, {"score": 0.004160792819919432, "phrase": "network_links"}, {"score": 0.004058615475230867, "phrase": "decontaminated_node"}, {"score": 0.003861697777410367, "phrase": "contaminated_neighbor"}, {"score": 0.003584025547693836, "phrase": "local_information"}, {"score": 0.0032445022888094636, "phrase": "alternative_system_requirement"}, {"score": 0.0031549249117721946, "phrase": "decontamination_strategy"}, {"score": 0.0028917056916949744, "phrase": "optimal_number"}, {"score": 0.0025452819305349416, "phrase": "optimal_time_complexity"}, {"score": 0.0025137856138000014, "phrase": "time_steps"}, {"score": 0.0022542611024997474, "phrase": "move_complexity"}, {"score": 0.0021049977753042253, "phrase": "wiley_periodicals"}], "paper_keywords": ["network decontamination", " distributed algorithms", " intruder capture", " graph search", " hypercube", " mobile agents", " inter connection networks"], "paper_abstract": "In this article we consider the decontamination problem in a hypercube network of size n. The nodes of the network are assumed to be contaminated and they have to be decontaminated by a sufficient number of agents. An agent is a mobile entity that asynchronously moves along the network links and decontaminates all the nodes it touches. A decontaminated node that is not occupied by an agent is re-contaminated if it has a contaminated neighbor. We consider some variations of the model based on the capabilities of mobile agents: locality, where the agents can only access local information; visibility, where they can \"see\" the state of their neighbors; and cloning, where they can create copies of themselves. We also consider synchronicity as an alternative system requirement. For each model, we design a decontamination strategy and we make several observations. For agents with locality, our strategy is based on the use of a coordinator that leads the other agents. Our strategy results in an optimal number of agents, Theta(n/root log n), and requires O(n log n) moves and O(n log n) time steps. For agents with visibility, we assume that the agents can move autonomously. In this setting, our decontamination strategy achieves an optimal time complexity (log n time steps), but the number of agents increases to n/2. Finally we show that when the agents have the capability to clone combined with either visibility or synchronicity, we can reduce the move complexity-which becomes optimal-at the expense of an increase in the number of agents. (C) 2008 Wiley Periodicals, Inc.", "paper_title": "Decontamination of hypercubes by mobile agents", "paper_id": "WOS:000259798600008"}