{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "mobile_agents"}, {"score": 0.03483220185213116, "phrase": "mobile_agent_gossip_problem"}, {"score": 0.012972128291440323, "phrase": "information_exchange"}, {"score": 0.012166090619326974, "phrase": "rendezvous_algorithms"}, {"score": 0.0047804843375940835, "phrase": "mobile-agent-based_distributed_systems"}, {"score": 0.0042004472903194616, "phrase": "fundamental_task"}, {"score": 0.0034343965063429447, "phrase": "excessive_cost"}, {"score": 0.0031277316566463978, "phrase": "agent_pi"}, {"score": 0.0026410082462069596, "phrase": "smaller_number"}, {"score": 0.0026220625042810706, "phrase": "agents'_moves"}, {"score": 0.0024399036842105205, "phrase": "total_number"}, {"score": 0.00232832698253493, "phrase": "asymptotically_tight_upper_and_lower_bounds"}, {"score": 0.002190064650401852, "phrase": "node_leader_election_problem"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["mobile agent", " gossip", " leader election", " move complexity", " distributed algorithm"], "paper_abstract": "Mobile-agent-based distributed systems are attracting widespread attention because of their adaptability and flexibility; mobile agents traverse the system and carry out a task at each node. In, mobile-agent-based systems, gossip is a fundamental task in cooperation among mobile agents. It requires one to accomplish all-to-all information exchange over all agents so that each agent can obtain the information each agent initially has. While rendezvous algorithms, which require that all agents rendezvous on a node at the same time, can achieve this requirement, it takes excessive cost for our objective. In this paper, we introduce the mobile agent gossip problem, in which each agent must obtain the information all other agents have. Each agent pi can obtain the information of p(j) (not equal p(i)) by meeting p(j) itself or any agent that already has information of p(j). Thus, the gossip is expected to accomplish the all-to-all information exchange with a smaller number of agents' moves than the rendezvous algorithms. In this paper, we investigate the complexity of the mobile agent gossip problem in terms of the total number of moves performed by agents. For several network topologies, we show the asymptotically tight upper and lower bounds for move complexity. This result is obtained from the fact that the mobile agent gossip problem and the node leader election problem is reducible to each other. (C) 2007 Elsevier B.V. All rights reserved.", "paper_title": "Move-optimal gossiping among mobile agents", "paper_id": "WOS:000254543900008"}