{"auto_keywords": [{"score": 0.043684295709416864, "phrase": "company_size"}, {"score": 0.015719716506582538, "phrase": "critical_information_technology_issues"}, {"score": 0.01416868112512342, "phrase": "critical_issues"}, {"score": 0.010038201097393623, "phrase": "critical_it_issues"}, {"score": 0.004763399180244353, "phrase": "purpose_-_the_purpose"}, {"score": 0.004612018044139003, "phrase": "top_financial_executives"}, {"score": 0.004574927037264451, "phrase": "information_systems"}, {"score": 0.004009482573367826, "phrase": "secondary_data"}, {"score": 0.0037686309317639644, "phrase": "computer_sciences_corporation"}, {"score": 0.003728240083633891, "phrase": "factorial_analysis"}, {"score": 0.003401877633022377, "phrase": "significant_role"}, {"score": 0.0033563469491919777, "phrase": "information_technology"}, {"score": 0.003223366954327026, "phrase": "relative_importance"}, {"score": 0.0029016883956269283, "phrase": "preliminary_model"}, {"score": 0.0027419484454788722, "phrase": "financial_executives"}, {"score": 0.0025979767249757852, "phrase": "management_teams"}, {"score": 0.002522032190962841, "phrase": "critical_importance"}, {"score": 0.002396034649574465, "phrase": "major_issues"}, {"score": 0.0023575658069040885, "phrase": "longitudinal_analysis"}, {"score": 0.002276317421227882, "phrase": "relevant_it_issues"}, {"score": 0.002227713257210598, "phrase": "large_current_sample_set"}, {"score": 0.0021860348299797107, "phrase": "major_corporations"}, {"score": 0.0021049977753042253, "phrase": "longitudinal_and_size_effects"}], "paper_keywords": ["Information systems", " Information technology success variables", " Longitudinal", " Organization size", " Critical", " Important", " Information technology issues", " Critical issues", " Company size", " Longitudinal analysis", " Information technology"], "paper_abstract": "Purpose - The purpose of this paper is to explore and analyze the views of top financial executives on the information systems (IS) in their organizations and to study the critical information technology issues facing organizations. Specifically, it aims to study critical issues over the period 2006 to 2010, as well as the effect of company size on the criticality of issue. Design/methodology/approach - The paper uses an analysis of secondary data obtained from the 2006 and 2010 Financial Executives International (FEI) comprehensive survey-based research on technology issues for financial executives. The study was conducted by the FEI and in conjunction with Computer Sciences Corporation in 2006. Factorial analysis of variance (ANOVA) and other statistical methods are used. Findings - The findings confirm critical issues that are facing organizations today. The study also finds that company size generally does not play a significant role in the criticality of information technology (IT) issues and that generally, there has been variation in the relative importance of issues between 2006 and 2010. Research limitations/implications - The study can be used as a basis for further exploration on critical IT issues, as well as the influences on company size on criticality of issues. It can also serve as a preliminary model to analyze firm IS over time. Limitations of the study include that the only group included in the survey were financial executives and the study is primarily based on US company responses. Practical implications - The findings can be used to guide management teams in emphasizing areas that need attention and, are of critical importance to all organizations. The article is extremely topical and useful for practitioners in understanding what are the major issues facing IT today. The longitudinal analysis and size study are particularly important in confirming the importance of the relevant IT issues. Originality/value - The paper analyzes a large current sample set which empirically reviews a cross-section of major corporations, IS departments and their returns. In addition, it begins to explore longitudinal and size effects on critical IT issues", "paper_title": "An analysis of critical information technology issues facing organizations", "paper_id": "WOS:000308336300007"}