{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "pubmed"}, {"score": 0.012504590064091978, "phrase": "publication_echo"}, {"score": 0.004626255242038005, "phrase": "pubmed_search_forms"}, {"score": 0.004565007074039171, "phrase": "publication_date"}, {"score": 0.00446471538346719, "phrase": "electronic_and_printed_publication"}, {"score": 0.004066898031169742, "phrase": "search_results"}, {"score": 0.0034963129868796033, "phrase": "ambiguous_publication_dates"}, {"score": 0.003404244237372396, "phrase": "trend_analysis"}, {"score": 0.003374094774912924, "phrase": "seasonal_decomposition"}, {"score": 0.0033442114331500407, "phrase": "monthly_publication_data"}, {"score": 0.0032416819339366712, "phrase": "doubled_search_results"}, {"score": 0.0027373807320805084, "phrase": "maximum_delay"}, {"score": 0.0025492038831408715, "phrase": "publication_trends"}, {"score": 0.0022705467477443417, "phrase": "query_formulation"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ireland_ltd."}], "paper_keywords": ["Information retrieval", " Digital libraries", " Databases", " Bibliographic", " PubMed", " Chronology as topic"], "paper_abstract": "Objectives: In PubMed search forms, the publication date refers to both the date of electronic and printed publication. This fact is documented in PubMed, but difficult to anticipate by the users and can provoke misinterpretations of search results. The Technical Note aims at systematically investing the effect (referred to as the publication echo), clarifying onset and extent of the publication echo, and comments on its impact. Methods: Papers with ambiguous publication dates are systematically retrieved and a trend analysis with seasonal decomposition on monthly publication data is performed. Results: First doubled search results were found for 1999, their number since then rapidly increasing. Up to 17.6% of all articles of a year are found to be published electronically and in print, which can be before or afterwards. Maximum delay between the two dates is three years, except for one singular publication, where it is five years. Publication trends are exponential and linear when considering echoed and echo-cleaned data, respectively. Conclusions: As a conclusion, we suggest using a query formulation that unambiguously retrieves literature from PubMed by the date of publication. (C) 2010 Elsevier Ireland Ltd. All rights reserved.", "paper_title": "The publication echo: Effects of retrieving literature in PubMed by year of publication", "paper_id": "WOS:000276191600008"}