{"auto_keywords": [{"score": 0.049348918639928865, "phrase": "self-regulated_learning"}, {"score": 0.03954774368676938, "phrase": "srl-supportive_tools"}, {"score": 0.030581247462502213, "phrase": "shallow_strategy_development"}, {"score": 0.00481495049065317, "phrase": "teachable_agent_environment"}, {"score": 0.0046334396336545226, "phrase": "srl"}, {"score": 0.004208881856146758, "phrase": "diverse_features"}, {"score": 0.0038973170902076707, "phrase": "students'_use"}, {"score": 0.003735862292632131, "phrase": "cbles"}, {"score": 0.003622642432563435, "phrase": "middle_school_students'_feature_use"}, {"score": 0.003512841739654183, "phrase": "teachable_agent_system"}, {"score": 0.003485913728272778, "phrase": "betty's_brain"}, {"score": 0.0034194902384248006, "phrase": "climate_change"}, {"score": 0.0032526334220034326, "phrase": "pretest-posttest_design"}, {"score": 0.003215295260684715, "phrase": "students'_interactions"}, {"score": 0.003011641380351577, "phrase": "learning_outcomes"}, {"score": 0.0029542282776915747, "phrase": "strategy_patterns"}, {"score": 0.002532526438148958, "phrase": "key_avenue"}, {"score": 0.0025130941721410558, "phrase": "future_research"}, {"score": 0.002493810638588771, "phrase": "sri-supportive_cbles"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Self-regulated learning", " Interactive learning environments", " Intelligent tutoring systems", " Teaching/learning strategies", " Human-computer interface"], "paper_abstract": "To support self-regulated learning (SRL), computer-based learning environments (CBLEs) are often designed to be open-ended and multidimensional. These systems incorporate diverse features that allow students to enact and reveal their SRL strategies via the choices they make. However, research shows that students' use of such features is limited; students often neglect SRL-supportive tools in CBLEs. In this study, we examined middle school students' feature use and strategy development over time using a teachable agent system called Betty's Brain. Students learned about climate change and thermoregulation in two units spanning several weeks. Learning was assessed using a pretest-posttest design, and students' interactions with the system were logged. Results indicated that use of SRL-supportive tools was positively correlated with learning outcomes. However, promising strategy patterns weakened over time due to shallow strategy development, which also negatively impacted the efficacy of the system. Although students seemed to acquire one beneficial strategy, they did so at the cost of other beneficial strategies. Understanding this phenomenon may be a key avenue for future research on SRI-supportive CBLEs. We consider two hypotheses for explaining and perhaps reducing shallow strategy development: a student-centered hypothesis related to \"gaming the system,\" and a design-centered hypothesis regarding how students are scaffolded via the system. (C) 2012 Elsevier Ltd. All rights reserved.", "paper_title": "Shallow strategy development in a teachable agent environment designed to support self-regulated learning", "paper_id": "WOS:000316523100027"}