{"auto_keywords": [{"score": 0.04740622885398932, "phrase": "top-hat_based_contrast_operator"}, {"score": 0.007467137106494981, "phrase": "toggle_contrast_operator"}, {"score": 0.006736103194386224, "phrase": "image_regions"}, {"score": 0.005480586663614288, "phrase": "sequential_contrast_operators"}, {"score": 0.0048149535299695685, "phrase": "toggle"}, {"score": 0.004342430078306461, "phrase": "image_contrast_enhancement"}, {"score": 0.0042928648367867835, "phrase": "mathematical_morphology"}, {"score": 0.003531474887552889, "phrase": "efficient_contrast_operators"}, {"score": 0.0034118234596993836, "phrase": "image_region_enhancement"}, {"score": 0.003372844338742438, "phrase": "image_sharpening"}, {"score": 0.00298942278888105, "phrase": "combined_contrast_operators"}, {"score": 0.00290473242917264, "phrase": "multi_scale_extensions"}, {"score": 0.0028550709503536494, "phrase": "morphological_contrast_operators"}, {"score": 0.002416589459425828, "phrase": "composed_operators"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": [""], "paper_abstract": "Top-hat based contrast operator and toggle contrast operator are two important strategies for image contrast enhancement in mathematical morphology. Top-hat based contrast operator enhances image regions and toggle contrast operator sharpens image. However, top-hat based contrast operator could not well sharpen image and toggle contrast operator could not well enhance image regions. Therefore, composing them together may produce efficient contrast operators which are both efficient for image region enhancement and image sharpening. Two ways of composing of top-hat based contrast operator and toggle contrast operator are discussed in this paper, which produce sequential contrast operators and combined contrast operators. Moreover, the multi scale extensions of these morphological contrast operators are discussed. Experiments have verified that, because the efficiencies of top-hat based contrast operator and toggle contrast operator are composed in the sequential contrast operators and combined contrast operators, the composed operators could both enhance image regions and sharpen image, which enhances the contrast of image and makes image clearer. (c) 2011 Elsevier Ltd. All rights reserved.", "paper_title": "Toggle and top-hat based morphological contrast operators", "paper_id": "WOS:000309693900015"}