{"auto_keywords": [{"score": 0.04954713236503223, "phrase": "systems_implementation"}, {"score": 0.03668160968875943, "phrase": "ethics"}, {"score": 0.00481495049065317, "phrase": "ethics_methodology"}, {"score": 0.0046046429665581555, "phrase": "professor_mumford"}, {"score": 0.00445293569103488, "phrase": "information_system"}, {"score": 0.00423465514675998, "phrase": "pioneering_thinking"}, {"score": 0.00409508755819924, "phrase": "integrated_methodology"}, {"score": 0.0038725824361608243, "phrase": "computer_systems"}, {"score": 0.0037449033166879874, "phrase": "job_design"}, {"score": 0.003641713874009232, "phrase": "systems_planning"}, {"score": 0.003601235776892337, "phrase": "implementation_effort"}, {"score": 0.002944806598704532, "phrase": "mumford"}, {"score": 0.002722930209707764, "phrase": "ethics."}], "paper_keywords": ["Information systems implementation", " ETHICS", " participation", " Actor Network Theory", " Social Process Model", " formation of science"], "paper_abstract": "Professor Mumford has contributed significantly to the information system (IS) field. Among her achievements and pioneering thinking is the development of an integrated methodology for systems implementation named Effective Technical and Human Implementation of Computer Systems (ETHICS) that incorporates job design as part of the systems planning and implementation effort. This study questions why ETHICS initially rose in popularity and then declined over the years. To answer this question, we apply Latour's (1999) five-loop framework to describe the formation of science. The findings reveal that Mumford held and aligned many heterogeneous actors and resources that together contributed to the shaping of ETHICS. As the content of ETHICS was shaped by the intertwining of many elements, when some of these elements later changed and undermined their previous alignment, the content of ETHICS was not reshaped, and hence it lost its status and declined. The paper ends by drawing more general lessons for IS research.", "paper_title": "The rise and decline of the ETHICS methodology of systems implementation: lessons for IS research", "paper_id": "WOS:000319666600004"}