{"auto_keywords": [{"score": 0.04954276574546314, "phrase": "emergency_department"}, {"score": 0.00481495049065317, "phrase": "registration_errors"}, {"score": 0.004602773636967002, "phrase": "medical_errors"}, {"score": 0.004005410765048467, "phrase": "clinical_decisions"}, {"score": 0.0039456466422100045, "phrase": "timely_evaluation"}, {"score": 0.003701401653850141, "phrase": "patient_safety"}, {"score": 0.003659890662429693, "phrase": "adult_ed"}, {"score": 0.003591733916159209, "phrase": "ethnographic_observation"}, {"score": 0.003407549468745519, "phrase": "modified_\"grounded_theory"}, {"score": 0.003043957650600757, "phrase": "multiple_medical_record_numbers"}, {"score": 0.003021141590548526, "phrase": "wrong_patient_identification"}, {"score": 0.0027499252661633525, "phrase": "ed_registration"}, {"score": 0.0025219085140220773, "phrase": "intertwined_web"}, {"score": 0.002437907960209364, "phrase": "work_environment"}, {"score": 0.0023214774334744713, "phrase": "significant_role"}, {"score": 0.0022781884538102264, "phrase": "information_technology"}, {"score": 0.0021693692831601745, "phrase": "alternative_policies"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ireland_ltd."}], "paper_keywords": ["ED registration", " medical errors", " misidentification", " workarounds", " shortcuts", " distributed cognition", " emergency care"], "paper_abstract": "Research into the nature and occurrence of medical errors has shown that these often result from a combination of factors that lead to the breakdown of workflow. Nowhere is this more critical than in the emergency department (ED), where the focus of clinical decisions is on the timely evaluation and stabilization of patients. This paper reports on the nature of errors and their implications for patient safety in an adult ED, using methods of ethnographic observation, interviews, and think-aloud protocols. Data were analyzed using modified \"grounded theory,\" which refers to a theory developed inductively from a body of data. Analysis revealed four classes of errors, relating to errors of misidentification, ranging from multiple medical record numbers, wrong patient identification or address, and in one case, switching of one patient's identification information with those of another. Further analysis traced the root of the errors to ED registration. These results indicate that the nature of errors in the emergency department are complex, multi-layered and result from an intertwined web of activity, in which stress in the work environment, high patient volume and the tendency to adopt shortcuts play a significant role. The need for information technology (IT) solutions to these problems as well as the impact of alternative policies is discussed. (C) 2007 Elsevier Ireland Ltd. All rights reserved.", "paper_title": "The nature and occurrence of registration errors in the emergency department", "paper_id": "WOS:000253700800003"}