{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "related_queries"}, {"score": 0.005477363039930256, "phrase": "search_engines"}, {"score": 0.004772367030970874, "phrase": "web_search_engine_query_logs"}, {"score": 0.004709193603747991, "phrase": "improved_association_rule_mining_model"}, {"score": 0.004626255242038005, "phrase": "overwhelming_volume"}, {"score": 0.00446471538346719, "phrase": "relevant_information"}, {"score": 0.004232875294230749, "phrase": "web_search_engines"}, {"score": 0.0038728151007982378, "phrase": "novice_users"}, {"score": 0.003737485125097945, "phrase": "simple_queries"}, {"score": 0.003032405563826263, "phrase": "query_expansion"}, {"score": 0.003005539334280134, "phrase": "file_indexing"}, {"score": 0.0027865506182608263, "phrase": "initial_input_query"}, {"score": 0.002689076130099546, "phrase": "query_log"}, {"score": 0.0026652435674846095, "phrase": "previously_submitted_queries"}, {"score": 0.002641621667026613, "phrase": "human_users"}, {"score": 0.0025492038831408715, "phrase": "enhanced_model"}, {"score": 0.0025266078302900036, "phrase": "association_rules"}, {"score": 0.0024600113832396187, "phrase": "suggested_related_queries"}, {"score": 0.002395166073437286, "phrase": "search_process"}], "paper_keywords": [""], "paper_abstract": "With the overwhelming volume of information, the task of finding relevant information on a given topic on the Web is becoming increasingly difficult. Web search engines hence become one of the most popular solutions available on the Web. However, it has never been easy for novice users to organize and represent their information needs using simple queries. Users have to keep modifying their input queries until they get expected results. Therefore, it is often desirable for search engines to give suggestions on related queries to users. Besides, by identifying those related queries, search engines can potentially perform optimizations on their systems, such as query expansion and file indexing. In this work we propose a method that suggests a list of related queries given an initial input query. The related queries are based in the query log of previously submitted queries by human users, which can be identified using an enhanced model of association rules. Users can utilize the suggested related queries to tune or redirect the search process. Our method not only discovers the related queries, but also ranks them according to the degree of their relatedness. Unlike many other rival techniques, it also performs reasonably well on less frequent input queries.", "paper_title": "Mining related queries from web search engine query logs using an improved association rule mining model", "paper_id": "WOS:000250064500014"}