{"auto_keywords": [{"score": 0.0046544807197808095, "phrase": "today's_networks"}, {"score": 0.00459568664065473, "phrase": "networking_services"}, {"score": 0.004518442937844318, "phrase": "sophisticated_and_very_effective_attacks"}, {"score": 0.004258128672571261, "phrase": "-service_attacks"}, {"score": 0.0038953958723049287, "phrase": "botnets_activities"}, {"score": 0.003639835714755229, "phrase": "mobile_phones"}, {"score": 0.0036090884921108086, "phrase": "smart_dust"}, {"score": 0.003459191419478298, "phrase": "ubiquitous_computing"}, {"score": 0.002603012037901889, "phrase": "security_and_privacy_challenges"}, {"score": 0.0024736973328071026, "phrase": "solutions_space"}, {"score": 0.002421726275597666, "phrase": "emerging_techniques"}, {"score": 0.0021049977753042253, "phrase": "john_wiley"}], "paper_keywords": ["security", " privacy", " networks"], "paper_abstract": "The vision towards the Network of the Future cannot be separated from the fact that today's networks, and networking services are subject to sophisticated and very effective attacks. When these attacks first appeared, spoofing and distributed denial-of-service attacks were treated as apocalypse for networking. Now, they are considered moderate damage, whereas more sophisticated and inconspicuous attacks, such as botnets activities, might have greater and far reaching impact. As the Internet is expanding to mobile phones and smart dust and as its social coverage is liberalized towards the realization of ubiquitous computing (with communication), the concerns on security and privacy have become deeper and the problems more challenging than ever. Re-designing the Internet as the Network of the Future is self-motivating for researchers, and security and privacy cannot be provided again as separate, external, add-on, solutions. In this paper, we discuss the security and privacy challenges of the Network of the Future and try to delimit the solutions space on the basis of emerging techniques. We also review methods that help the quantification of security and privacy in an effort to provide a more systematic and quantitative treatment of the area in the future. Copyright (c) 2011 John Wiley & Sons, Ltd.", "paper_title": "Security and privacy issues for the network of the future", "paper_id": "WOS:000308092800005"}