{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "lego"}, {"score": 0.004798742525503843, "phrase": "mindstorms"}, {"score": 0.004531357177195719, "phrase": "undergraduate_courses"}, {"score": 0.0044706300051082035, "phrase": "roboticsrelated_subjects"}, {"score": 0.004322333439660409, "phrase": "data_acquisition"}, {"score": 0.004193059395895776, "phrase": "difficult_concepts"}, {"score": 0.004081385289516914, "phrase": "good_lab_exercises"}, {"score": 0.004026664041845776, "phrase": "physical_educational_tools"}, {"score": 0.003972673543700013, "phrase": "low_cost"}, {"score": 0.0036635429301869527, "phrase": "single_device"}, {"score": 0.003626626504149897, "phrase": "\"classical\"_solution"}, {"score": 0.0035659209800190847, "phrase": "specific_commercial_kits"}, {"score": 0.0034944094552943, "phrase": "even_topic"}, {"score": 0.003378385493203297, "phrase": "already_existing_alternative"}, {"score": 0.0033330581836898032, "phrase": "lego_mindstorms_nxt_robots"}, {"score": 0.003299460925313939, "phrase": "training_platform"}, {"score": 0.0032006810120751524, "phrase": "commercial_kits"}, {"score": 0.00305285084207725, "phrase": "particular_topic"}, {"score": 0.0024179512279236207, "phrase": "professors'_experiences"}, {"score": 0.002275214783528274, "phrase": "higher_motivational_adequacy"}, {"score": 0.0022446552199168472, "phrase": "complete_robot"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Applications in subject areas", " Improving classroom teaching", " Interactive learning environments", " Post-secondary education", " Teaching/learning strategies"], "paper_abstract": "LEGO Mindstorms NXT robots are being increasingly used in undergraduate courses, mostly in roboticsrelated subjects. But other engineering topics, like the ones found in data acquisition, control and realtime subjects, also have difficult concepts that can be well understood only with good lab exercises. Such exercises require physical educational tools that should be low cost, easy to configure and use, multipurpose and motivational for the students, being all of this hard to achieve with a single device. The \"classical\" solution has been to acquire specific commercial kits for each subject, or even topic, usually proprietary and expensive. Our work extends the already existing alternative of using the LEGO Mindstorms NXT robots as a training platform, but not by imitating the same approach of commercial kits (e.g., to isolate some part of the robot for teaching a particular topic); we rather aim at accomplishing all the mentioned requirements simultaneously. For that purpose, we have used only one out-of-the-box, complete robot configuration, to be shared among different subjects without hardware/software/firmware modifications. This has reduced significantly the effort of a group of professors when preparing exercises, and encouraged the reuse of their work among several topics and subjects. Also, we have collected a number of surveys on students and the professors' experiences. In this paper we describe our approach and present in detail the results, which assess the higher motivational adequacy of using a complete robot in these subjects and also the real fulfillment of the other requirements along several academic years. (c) 2012 Elsevier Ltd. All rights reserved.", "paper_title": "A LEGO Mindstorms NXT approach for teaching at Data Acquisition, Control Systems Engineering and Real-Time Systems undergraduate courses", "paper_id": "WOS:000306582400013"}