{"auto_keywords": [{"score": 0.04866694555848204, "phrase": "tjsi"}, {"score": 0.00481495049065317, "phrase": "analgesic_drug"}, {"score": 0.004743423032820112, "phrase": "bibliometric_indicator"}, {"score": 0.0046311726251433705, "phrase": "kissin"}, {"score": 0.004603530356778359, "phrase": "scientometrics"}, {"score": 0.004335934054730105, "phrase": "medline"}, {"score": 0.004162240160649414, "phrase": "breakthrough_drugs"}, {"score": 0.0033914308417007316, "phrase": "tjsi._second"}, {"score": 0.0033510093127915768, "phrase": "tjsi_indicators"}, {"score": 0.00313712686977853, "phrase": "fda"}, {"score": 0.002936849401568391, "phrase": "first_hypothesis"}, {"score": 0.002228519136218028, "phrase": "breakthrough_drug"}, {"score": 0.0021049977753042253, "phrase": "random_chance"}], "paper_keywords": ["Drugs", " Bibliometrics", " Biomedical journals", " Impact Factor", " Topic-specific publications"], "paper_abstract": "To predict the success of an analgesic drug we have suggested a bibliometric indicator, the Top Journals Selectivity Index (TJSI) (Kissin, Scientometrics, 86:785-795, 2011). It represents the ratio (as %) between the number of all types of articles on a particular drug in the top 20 biomedical journals and the number of articles on that drug in all (> 5,000) journals covered by Medline over the first 5 years after a drug's introduction. For example, the highest TJSI score among analgesics was that of sumatriptan, the most successful drug for the treatment of migraine. The aim of this study was to demonstrate that TJSI may be used not only in the field of analgesics, but also for various other categories of drugs. The study tested two hypotheses. First, the difference between the most successful and less successful drugs in any pharmacological class can be reliably detected by TJSI. Second, drugs with TJSI indicators as high as that of sumatriptan can be found among other pharmacological classes as well. Drugs from various pharmacological classes approved by the Federal Drug Administration (FDA) during the 10-year period, 1980-1989, were used in this study. Two groups of 10 drugs were selected to test the first hypothesis. One group included the most successful (breakthrough) drugs; the other included less successful drugs matched with the breakthrough drugs according to mechanism of action. The difference between the two groups was compared using three publication indices: the TJSI, the number of all types of articles on a drug in journals presented by Medline (AJI), and the number of articles covering only randomized controlled trials (RCT). It was found that TJSI can detect the difference between the two groups of drugs better than the two other indices. TJSI detected the difference between a breakthrough drug and its less successful counterpart at least 69% of the time with 95% confidence. With the other two indices the difference was not distinguishable from random chance. Some of the breakthrough drugs (zidovudine, omeprazole, lovastatin) have TSJIs as high or even higher than that of sumatriptan (19.2 vs. 23.0, 21.4, and 20.6, respectively). In conclusion, TJSI can be useful not only in the field of analgesics, but also with drugs belonging to other pharmacological classes.", "paper_title": "Top Journals Selectivity Index: is it acceptable for drugs beyond the field of analgesia?", "paper_id": "WOS:000292210400017"}