{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "distributed_real-time_embedded_systems"}, {"score": 0.004652016085325825, "phrase": "real-time_applications"}, {"score": 0.00452043800760441, "phrase": "distributed_heterogeneous_architectures"}, {"score": 0.004443276312972159, "phrase": "interconnected_networks"}, {"score": 0.0038936755823756226, "phrase": "communication_protocols"}, {"score": 0.0038492126993451337, "phrase": "scheduling_policies"}, {"score": 0.0034512514926836667, "phrase": "new_adequate_design_methods"}, {"score": 0.003334309053314909, "phrase": "efficient_analysis"}, {"score": 0.0032585499655442404, "phrase": "optimization_techniques"}, {"score": 0.0028715299874549245, "phrase": "schedulability_analysis"}, {"score": 0.00283870598459543, "phrase": "hard_real-time_systems"}, {"score": 0.002711109302199029, "phrase": "heterogeneous_and_distributed_nature"}, {"score": 0.0023480892503414596, "phrase": "communication_channel"}, {"score": 0.0022041312401435346, "phrase": "optimization_heuristics"}, {"score": 0.0021416404045850224, "phrase": "schedulable_system"}], "paper_keywords": ["algorithms", " design", " performance", " theory"], "paper_abstract": "An increasing number of real-time applications are today implemented using distributed heterogeneous architectures composed of interconnected networks of processors. The systems are heterogeneous not only in terms of hardware and software components, but also in terms of communication protocols and scheduling policies. In this context, the task of designing such systems is becoming increasingly difficult. The success of new adequate design methods depends on the availability of efficient analysis as well as optimization techniques. In this article, we present both analysis and optimization approaches for such heterogeneous distributed real-time embedded systems. More specifically, we discuss the schedulability analysis of hard real-time systems, highlighting particular aspects related to the heterogeneous and distributed nature of the applications. We also introduce several design optimization problems characteristic of this class of systems: mapping of functionality, the optimization of access to communication channel, and the assignment of scheduling policies to processes. Optimization heuristics aiming at producing a schedulable system with a given amount of resources are presented.", "paper_title": "Analysis and optimization of distributed real-time embedded systems", "paper_id": "WOS:000239055300004"}