{"auto_keywords": [{"score": 0.037253245357488925, "phrase": "real_numbers"}, {"score": 0.015719716506582538, "phrase": "weak_computability"}, {"score": 0.011901347974392991, "phrase": "general_case"}, {"score": 0.008394065755683971, "phrase": "finite_time"}, {"score": 0.00441635700580562, "phrase": "classical_packing_problems"}, {"score": 0.0030414140732789186, "phrase": "finite_number"}, {"score": 0.0027592065435732955, "phrase": "universal_machine"}, {"score": 0.0026423134393535243, "phrase": "unit_arithmetic"}, {"score": 0.002613870237087035, "phrase": "logical_operation"}, {"score": 0.0024628046987344846, "phrase": "optimal_solutions"}, {"score": 0.0021745003291048356, "phrase": "positive_real_numbers"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Computability", " Exact algorithm", " Scheduling", " Higher dimensional packing", " Real parameters"], "paper_abstract": "This paper proposes a four dimensional orthogonal packing and time scheduling problem. The problem differs from the classical packing problems in that the position and orientation of each item in the container can be changed over time. In this way, the four dimensional space-time problem better uses the container time. Also, we consider a general case that all parameters are real numbers, which makes the problems more difficult to solve. This paper proposes an algorithm and proves that the algorithm could solve the problem optimally by a finite number of operations. We say this problem is weak computational, meaning that if there exists a universal machine that could represent real numbers and could do unit arithmetic or logical operation on real numbers in finite time, then the algorithm could find optimal solutions in finite time. This paper also presents a proof of the weak computability over a general case of the three dimensional orthogonal packing problem where all parameters are positive real numbers. (C) 2013 Elsevier B.V. All rights reserved.", "paper_title": "On the weak computability of a four dimensional orthogonal packing and time scheduling problem", "paper_id": "WOS:000324151600001"}