{"auto_keywords": [{"score": 0.040402819463019685, "phrase": "virtual_game-like_interfaces"}, {"score": 0.00481495049065317, "phrase": "visualized_interface"}, {"score": 0.004765482708043842, "phrase": "digital_library"}, {"score": 0.004067349981835669, "phrase": "structural_equation_modeling"}, {"score": 0.0036553070575015344, "phrase": "assigned_learning_task"}, {"score": 0.0035804980565263024, "phrase": "weight_relationships"}, {"score": 0.00327356326590461, "phrase": "retrieval_interface"}, {"score": 0.0032510690712452147, "phrase": "situated_affordance"}, {"score": 0.0032176163279340206, "phrase": "entertainment-related_information_needs"}, {"score": 0.003108565704097622, "phrase": "specific_problems"}, {"score": 0.0030239842475439814, "phrase": "graphic_icons"}, {"score": 0.002841971477743441, "phrase": "entertainment-related_information"}, {"score": 0.002726740692380339, "phrase": "greater_control"}, {"score": 0.0025981810951165836, "phrase": "assigned_tasks"}, {"score": 0.002492810341589618, "phrase": "game-like_interface"}, {"score": 0.002318566141177149, "phrase": "future_development"}, {"score": 0.002302619021497886, "phrase": "information_search_interfaces"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Information seeking behavior", " Emotional informational navigation", " Human-computer interaction"], "paper_abstract": "The uncertainty children experience when searching for information influences their information seeking behavior by stimulating curiosity or hindering their search efforts. This study explored the interactions and the usability of various search interfaces, and the enjoyment or uncertainty experienced by children when using them. Structural Equation Modeling was used to determine whether children feel uncertainty or a sense of control when using virtual game-like interfaces to search for information associated with entertainment or as a means to satisfy an assigned learning task. We then analyzed the weight relationships among three latent variables (information needs, interface media, and affective state) using statistical (path) analysis. Our results indicate that children prefer using a retrieval interface with situated affordance to satisfy entertainment-related information needs, as opposed to searching for information to solve specific problems. Furthermore, their perceptions of text and graphic icons determined the degree to which they experienced a sense of uncertainty or control. When searching for entertainment-related information, they were better able to deal with uncertainty and sought greater control in their search interface, compared to when they were searching for information related to assigned tasks. According to their information needs, children may regard a game-like interface as a toy or a tool for learning. The results of this study can serve as reference for the future development of information search interfaces aimed at arousing the interest of children. The use of virtual game-like interfaces to guide the IS behavior of children warrants further study. (C) 2015 Elsevier Ltd. All rights reserved.", "paper_title": "Affective surfing in the visualized interface of a digital library for children", "paper_id": "WOS:000357240200004"}