{"auto_keywords": [{"score": 0.004456044928556639, "phrase": "suspicious_events"}, {"score": 0.0037348894128879082, "phrase": "keyed_ids"}, {"score": 0.003623949225126944, "phrase": "dimva"}, {"score": 0.003531474887552889, "phrase": "core_idea"}, {"score": 0.0034118234596993836, "phrase": "cryptographic_primitives"}, {"score": 0.003324743991757282, "phrase": "secret_element"}, {"score": 0.003037047249598515, "phrase": "learned_model"}, {"score": 0.00295950473406239, "phrase": "anomaly_score"}, {"score": 0.002762240719058935, "phrase": "evasion_attacks"}, {"score": 0.002416589459425828, "phrase": "realistic_attacks"}, {"score": 0.002197801146305747, "phrase": "claimed_security_properties"}, {"score": 0.002150900082318562, "phrase": "kids'_central_idea"}, {"score": 0.0021232402128269906, "phrase": "heuristic_arguments"}], "paper_keywords": ["Adversarial classification", " anomaly detection", " intrusion detection systems", " secure machine learning"], "paper_abstract": "Most anomaly detection systems rely on machine learning algorithms to derive a model of normality that is later used to detect suspicious events. Some works conducted over the last years have pointed out that such algorithms are generally susceptible to deception, notably in the form of attacks carefully constructed to evade detection. Various learning schemes have been proposed to overcome this weakness. One such system is Keyed IDS (KIDS), introduced at DIMVA \"10. KIDS\" core idea is akin to the functioning of some cryptographic primitives, namely to introduce a secret element (the key) into the scheme so that some operations are infeasible without knowing it. In KIDS the learned model and the computation of the anomaly score are both key-dependent, a fact which presumably prevents an attacker from creating evasion attacks. In this work we show that recovering the key is extremely simple provided that the attacker can interact with KIDS and get feedback about probing requests. We present realistic attacks for two different adversarial settings and show that recovering the key requires only a small amount of queries, which indicates that KIDS does not meet the claimed security properties. We finally revisit KIDS' central idea and provide heuristic arguments about its suitability and limitations.", "paper_title": "Key-Recovery Attacks on KIDS, a Keyed Anomaly Detection System", "paper_id": "WOS:000354468900005"}