{"auto_keywords": [{"score": 0.04157123421785755, "phrase": "visual_continuity"}, {"score": 0.03247739629898321, "phrase": "relevant_movie"}, {"score": 0.00481495049065317, "phrase": "continuity_cuts"}, {"score": 0.0047784273577245505, "phrase": "edited_movies"}, {"score": 0.00463507149599759, "phrase": "professionally_edited_videos"}, {"score": 0.00459990650330792, "phrase": "frequent_editorial_cuts"}, {"score": 0.004278807087784626, "phrase": "human_eye_movements"}, {"score": 0.0041345962781234435, "phrase": "present_eye-tracking_study"}, {"score": 0.003919830848124645, "phrase": "viewers'_eye_movements"}, {"score": 0.003314591878914152, "phrase": "short_break"}, {"score": 0.0032272929113113203, "phrase": "switched_locations"}, {"score": 0.0029450186031370245, "phrase": "saccadic_eye_movements"}, {"score": 0.0026771333996253783, "phrase": "edited_videos"}, {"score": 0.002636587060621144, "phrase": "faster_re-orientation"}, {"score": 0.0022981559278396845, "phrase": "enhanced_discrimination"}, {"score": 0.002263336340041527, "phrase": "irrelevant_visual_information"}, {"score": 0.0021702728407945976, "phrase": "previous_research"}, {"score": 0.0021537671245615286, "phrase": "eye_movements"}, {"score": 0.0021211305348270413, "phrase": "recognition_processes"}, {"score": 0.0021049977753042253, "phrase": "possible_future_directions"}], "paper_keywords": ["Edited videos", " Continuity", " Color", " Attention", " Eye movements", " Memory"], "paper_abstract": "Professionally edited videos entail frequent editorial cuts - that is, abrupt image changes from one frame to another. The impact of these cuts on human eye movements is currently not well understood. In the present eye-tracking study, we experimentally gauged the degree to which color and visual continuity contributed to viewers' eye movements following cinematic cuts. In our experiment, viewers were presented with two edited action sports movies on the same screen but they were instructed to watch and keep their gaze on only one of these movies. Crucially, the movies were frequently interrupted and continued after a short break either at the same or at switched locations. Hence, viewers needed to rapidly recognize the continuation of the relevant movie and re-orient their gaze toward it. Properties of saccadic eye movements following each interruption probed the recognition of the relevant movie after a cut. Two key findings were that (i) memory co-determines attention after cuts in edited videos, resulting in faster re-orientation toward scene continuations when visual continuity across the interruption is high than when it is low, and (ii) color contributes to the guidance of attention after cuts, but its benefit largely rests upon enhanced discrimination of relevant from irrelevant visual information rather than memory. Results are discussed with regard to previous research on eye movements in movies and recognition processes. Possible future directions of research are outlined.", "paper_title": "The influence of color during continuity cuts in edited movies: an eye-tracking study", "paper_id": "WOS:000364019400018"}