{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "spontaneous_dialog_visualizations"}, {"score": 0.004606148097788071, "phrase": "unstructured_texts"}, {"score": 0.004550783060775205, "phrase": "first_experiment"}, {"score": 0.004477992162329249, "phrase": "unrehearsed_dialog"}, {"score": 0.004249332848326785, "phrase": "overall_performance"}, {"score": 0.004081385289516914, "phrase": "spatialized_layouts"}, {"score": 0.003587125711973247, "phrase": "semantic_structure"}, {"score": 0.003390092184270794, "phrase": "random_list"}, {"score": 0.0032956583072431423, "phrase": "document_type"}, {"score": 0.003216804708106142, "phrase": "butavicius"}, {"score": 0.0029792984108210525, "phrase": "speed-accuracy_trade-off"}, {"score": 0.0027816546451972725, "phrase": "dialog_texts"}, {"score": 0.0024842242921857705, "phrase": "non-structured_list_interface"}, {"score": 0.002263799931018574, "phrase": "neighboring_document_representations"}, {"score": 0.0022006705963260433, "phrase": "real-world_applications"}, {"score": 0.002165388556451298, "phrase": "crown_copyright"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Data visualization", " Multidimensional scaling", " Isomap", " Empirical evaluation", " Human-computer interaction", " Email", " Spontaneous dialog"], "paper_abstract": "Two experiments were conducted examining the effectiveness of visualizations of unstructured texts. The first experiment presented transcriptions of unrehearsed dialog and the second used emails. Both experiments showed an advantage in overall performance for semantically structured two-dimensional (2D) spatialized layouts, such as multidimensional scaling (MDS), over structured and non-structured list displays. The second experiment also demonstrated that this advantage is not simply due to the 2D nature of the display, but the combination of 2D display and the semantic structure underpinning it. Without this structure, performance fell to that of a Random List of documents. The effect of document type in this study and in Butavicius and Lee's (2007) study on visualizations of news articles may be partly described by a change in bias on a speed-accuracy trade-off. At one extreme, users were accurate but slow in answering questions based on the dialog texts while, at the other extreme, users were fast but relatively inaccurate when responding to queries about emails. Similarly, users could respond accurately using the non-structured list interface; however, this was at the cost of very long response times and was associated with a technique whereby participants navigated by clicking on neighboring document representations. Implications of these findings for real-world applications are discussed. Crown Copyright (C) 2012 Published by Elsevier Ltd. All rights reserved.", "paper_title": "An assessment of email and spontaneous dialog visualizations", "paper_id": "WOS:000304230100003"}