{"auto_keywords": [{"score": 0.03308383494589816, "phrase": "ib_model"}, {"score": 0.00481495049065317, "phrase": "acquaintance_network"}, {"score": 0.0047602693158272655, "phrase": "social_structure"}, {"score": 0.004377719094086111, "phrase": "incessant_interactions"}, {"score": 0.004198082549566806, "phrase": "social_network_model"}, {"score": 0.004010477922833839, "phrase": "well-known_sociological_principles"}, {"score": 0.0037589124802364384, "phrase": "continuous_positive_and_negative_interactions"}, {"score": 0.0036183419672924095, "phrase": "future_interactions"}, {"score": 0.003443402656397069, "phrase": "stronger_ties"}, {"score": 0.003327253821888569, "phrase": "social_behavior"}, {"score": 0.0033019779616246356, "phrase": "animal_species"}, {"score": 0.0031784407245606704, "phrase": "model_evaluation"}, {"score": 0.0030017207229983385, "phrase": "small_diameter"}, {"score": 0.0029675701595142656, "phrase": "average_path_length"}, {"score": 0.0028025415122856973, "phrase": "clustering_coefficient"}, {"score": 0.0027079507175554835, "phrase": "larger_networks"}, {"score": 0.0026771333996253783, "phrase": "degree_distributions"}, {"score": 0.0025867643733794724, "phrase": "mature_phase"}, {"score": 0.0023966900120342364, "phrase": "network_properties"}, {"score": 0.0021049977753042253, "phrase": "e-mail_urv_network"}], "paper_keywords": ["social network", " small world", " balance theory", " pheromone infrastructure"], "paper_abstract": "An acquaintance network is a social structure made up of a set of actors and the ties between them. These ties change dynamically as a consequence of incessant interactions between the actors. In this paper we introduce a social network model called the Interaction-Based (IB) model that involves well-known sociological principles. The connections between the actors and the strength of the connections are influenced by the continuous positive and negative interactions between the actors and, vice versa, the future interactions are more likely to happen between the actors that are connected with stronger ties. The model is also inspired by the social behavior of animal species, particularly that of ants in their colony. A model evaluation showed that the IB model turned out to be sparse. The model has a small diameter and an average path length that grows in proportion to the logarithm of the number of vertices. The clustering coefficient is relatively high, and its value stabilizes in larger networks. The degree distributions are slightly right-skewed. In the mature phase of the IB model, i.e., when the number of edges does not change significantly, most of the network properties do not change significantly either. The IB model was found to be the best of all the compared models in simulating the e-mail URV (University Rovira i Virgili of Tarragona) network because the properties of the IB model more closely matched those of the e-mail URV network than the other models.", "paper_title": "MODELING ACQUAINTANCE NETWORKS BASED ON BALANCE THEORY", "paper_id": "WOS:000343105700017"}