{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "older_adults'_text_entry"}, {"score": 0.004648995193787914, "phrase": "display_size"}, {"score": 0.004612896435506914, "phrase": "input_method_on_acceptance_and_performance"}, {"score": 0.004506265705673849, "phrase": "older_adults'_finger-based_text_entry"}, {"score": 0.004402088928254543, "phrase": "thirty-two_older_adults"}, {"score": 0.004367898947304223, "phrase": "chinese_characters"}, {"score": 0.004217286731331736, "phrase": "touch_screens"}, {"score": 0.0036080776793146843, "phrase": "small_displays"}, {"score": 0.0034162643819889054, "phrase": "shorter_task_completion_time"}, {"score": 0.0031474338010045386, "phrase": "large_displays"}, {"score": 0.0029338597685088603, "phrase": "task_completion_time"}, {"score": 0.002911039832825817, "phrase": "perceived_ease"}, {"score": 0.00228499525153, "phrase": "participants'_finger-based_text_entry"}, {"score": 0.0021215125099937663, "phrase": "older_adults'_mental_models"}, {"score": 0.0021049977753042253, "phrase": "designers'_mental_models"}], "paper_keywords": [""], "paper_abstract": "This study focuses on older adults' finger-based text entry on smartphones and tablets. Thirty-two older adults entered Chinese characters with two input methods (typing and handwriting) on touch screens with four display sizes (3.5 in., 5 in., 7 in., 9.7 in.). Their performance, acceptance, preference, and errors were recorded and thus four findings were found. First, on small displays (3.5 in. and 5 in.), handwriting contributed to shorter task completion time, higher perceived ease of use, and higher usage intention than typing, but no difference was observed on large displays (7 in. and 9.7 in.). Second, there is a gap of task completion time and perceived ease of use between 5 in. and 7 in. for typing, whereas there is no gap for handwriting. Third, participants' preference of 9.7 in. was almost the same as that of 7 in., and their preference of 7 in. was 1.5 times as strong as that of 5 in. Fourth, participants' finger-based text entry was prone to 13 types of errors. Many of these errors were caused by the mismatch between older adults' mental models and designers' mental models.", "paper_title": "Older Adults' Text Entry on Smartphones and Tablets: Investigating Effects of Display Size and Input Method on Acceptance and Performance", "paper_id": "WOS:000340173500005"}