{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "high-quality_knowledge"}, {"score": 0.048886391350397976, "phrase": "-functional_software_development_teams"}, {"score": 0.04658243350704789, "phrase": "coopetitive_model"}, {"score": 0.004112411350177274, "phrase": "multiparty_software_development_teams"}, {"score": 0.003788444178071508, "phrase": "social_interdependence_theory"}, {"score": 0.0036476222647061243, "phrase": "high-quality_knowledge_sharing"}, {"score": 0.003194580334752371, "phrase": "simultaneous_cooperative_and_competitive_behaviors"}, {"score": 0.00301801991152303, "phrase": "-functional_team_members"}, {"score": 0.002780025943393764, "phrase": "cooperative_and_competitive_behaviors"}, {"score": 0.002676587673012276, "phrase": "first_study"}, {"score": 0.002186395051086251, "phrase": "system_development_teams"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Knowledge management", " Knowledge transfer", " Knowledge sharing", " Cooperation", " Competition", " Coopetition", " Co-opetition", " Cross-functionality", " Software development teams", " Multi-party software development teams"], "paper_abstract": "We present and empirically validate a Coopetitive Model of Knowledge Sharing that helps understand the forces underlying High-Quality Knowledge Sharing in multiparty software development teams. More specifically, we integrate the Coopetitive Model of Knowledge Sharing and Social Interdependence Theory to explain the forces behind High-Quality Knowledge Sharing in cross-functional software development teams. Based on the analysis of data collected from 115 software development project managers, we explore the mechanisms through which simultaneous cooperative and competitive behaviors drive High-Quality Knowledge Sharing among cross-functional team members. We also show how multiple interdependencies that are simultaneously set in motion engender cooperative and competitive behaviors. This study is the first study that encompasses both the antecedents of simultaneous cooperative and behaviors and the mechanisms through which simultaneous cooperation and competition influence knowledge sharing behaviors. The model adds to the emerging contingency perspective pertaining to the study of cooperation and competition in system development teams. (C) 2012 Elsevier Ltd. All rights reserved.", "paper_title": "Modeling High-Quality Knowledge Sharing in cross-functional software development teams", "paper_id": "WOS:000313466600010"}