{"auto_keywords": [{"score": 0.04913322770523618, "phrase": "noncooperative_mobiles"}, {"score": 0.03242227418105997, "phrase": "signaling_game"}, {"score": 0.00481495049065317, "phrase": "cellular_systems"}, {"score": 0.004663636232080366, "phrase": "central_scheduling_problem"}, {"score": 0.004626553103375699, "phrase": "wireless_communications"}, {"score": 0.004392565073466714, "phrase": "common_radio_channel"}, {"score": 0.004220624516321415, "phrase": "efficient_and_fair_scheduling_schemes"}, {"score": 0.004104269996872886, "phrase": "base_station"}, {"score": 0.003975200317233532, "phrase": "channel_conditions"}, {"score": 0.0034426417353349567, "phrase": "scheduling_problem"}, {"score": 0.0034016119212097826, "phrase": "game-theoretic_perspective"}, {"score": 0.002841545331522694, "phrase": "babbling_type"}, {"score": 0.0025918235228843444, "phrase": "prior_information"}, {"score": 0.002560907803820395, "phrase": "channel_statistics"}, {"score": 0.0024802523752944536, "phrase": "truthful_signaling"}, {"score": 0.0024506642262508735, "phrase": "radio_channel_conditions"}, {"score": 0.0023171750718791713, "phrase": "mobiles'_policies"}, {"score": 0.0022174005294867583, "phrase": "stochastic_approximations_approach"}, {"score": 0.0021049977753042253, "phrase": "non-truthful_signaling"}], "paper_keywords": ["Cellular networks", " game theory", " pricing", " scheduling", " signaling games", " stochastic approximation"], "paper_abstract": "A central scheduling problem in wireless communications is that of allocating resources to one of many mobile stations that have a common radio channel. Much attention has been given to the design of efficient and fair scheduling schemes that are centrally controlled by a base station (BS) whose decisions depend on the channel conditions reported by each mobile. The BS is the only entity taking decisions in this framework. The decisions are based on the reports of mobiles on their radio channel conditions. In this paper, we study the scheduling problem from a game-theoretic perspective in which some of the mobiles may be noncooperative or strategic, and may not necessarily report their true channel conditions. We model this situation as a signaling game and study its equilibria. We demonstrate that the only Perfect Bayesian Equilibria (PBE) of the signaling game are of the babbling type: the noncooperative mobiles send signals independent of their channel states, the BS simply ignores them, and allocates channels based only on the prior information on the channel statistics. We then propose various approaches to enforce truthful signaling of the radio channel conditions: a pricing approach, an approach based on some knowledge of the mobiles' policies, and an approach that replaces this knowledge by a stochastic approximations approach that combines estimation and control. We further identify other equilibria that involve non-truthful signaling.", "paper_title": "Opportunistic Scheduling in Cellular Systems in the Presence of Noncooperative Mobiles", "paper_id": "WOS:000300845900028"}