{"auto_keywords": [{"score": 0.04710047763260583, "phrase": "action_failures"}, {"score": 0.005546837328727174, "phrase": "cwcm"}, {"score": 0.00481495049065317, "phrase": "cooperative_monitoring"}, {"score": 0.0047787596516662, "phrase": "diagnose_multiagent_plans"}, {"score": 0.004654210559456924, "phrase": "multiagent_plan"}, {"score": 0.004620284526361791, "phrase": "map"}, {"score": 0.004315879542755464, "phrase": "current_approaches"}, {"score": 0.004283423748543866, "phrase": "map_diagnosis"}, {"score": 0.0038683363637006902, "phrase": "dynamic_and_partially_observable_environment"}, {"score": 0.00378167947598949, "phrase": "fully_distributed_and_asynchronous_way"}, {"score": 0.0035065523764817143, "phrase": "novel_methodology"}, {"score": 0.003467040410632942, "phrase": "cooperative_weak-committed"}, {"score": 0.0030375852871252934, "phrase": "nondeterministic_action_models"}, {"score": 0.0027532820796396713, "phrase": "recent_past"}, {"score": 0.002572158343938064, "phrase": "exogenous_events"}, {"score": 0.00243033541656411, "phrase": "dependent_failures"}, {"score": 0.002366847878952636, "phrase": "diagnostic_engine"}, {"score": 0.0023313149689465386, "phrase": "primary_and_secondary_action_failures"}, {"score": 0.0022618378709785172, "phrase": "cwcm_methodology"}, {"score": 0.0022194677375148063, "phrase": "proposed_diagnostic_inferences"}, {"score": 0.0021049977753042253, "phrase": "system_observability"}], "paper_keywords": [""], "paper_abstract": "Diagnosing the execution of a Multiagent Plan (MAP) means identifying and explaining action failures (i.e., actions that did not reach their expected effects). Current approaches to MAP diagnosis are substantially centralized, and assume that action failures are independent of each other. In this paper, the diagnosis of MAPs, executed in a dynamic and partially observable environment, is addressed in a fully distributed and asynchronous way; in addition, action failures are no longer assumed as independent of each other. The paper presents a novel methodology, named Cooperative Weak-Committed Monitoring (CWCM) enabling agents to cooperate while monitoring their own actions. Cooperation helps the agents to cope with very scarcely observable environments: what an agent cannot observe directly can be acquired from other agents. CWCM exploits nondeterministic action models to carry out two main tasks: detecting action failures and building trajectory-sets (i.e., structures representing the knowledge an agent has about the environment in the recent past). Relying on trajectory-sets, each agent is able to explain its own action failures in terms of exogenous events that have occurred during the execution of the actions themselves. To cope with dependent failures, CWCM is coupled with a diagnostic engine that distinguishes between primary and secondary action failures. An experimental analysis demonstrates that the CWCM methodology, together with the proposed diagnostic inferences, are effective in identifying and explaining action failures even in scenarios where the system observability is significantly reduced.", "paper_title": "Cooperative Monitoring to Diagnose Multiagent Plans", "paper_id": "WOS:000343088900001"}