{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "automatic_eeg_seizure_detection"}, {"score": 0.004577454055822054, "phrase": "epilepsy"}, {"score": 0.004327196832280818, "phrase": "world_population"}, {"score": 0.0034359094594153304, "phrase": "eeg_database"}, {"score": 0.0033405704229694656, "phrase": "classification_rates"}, {"score": 0.003247868216333148, "phrase": "existing_eeg_seizure_detection_methods"}, {"score": 0.002951444412262927, "phrase": "perfect_classification_rate"}, {"score": 0.002666939282064095, "phrase": "dtcwt"}, {"score": 0.0024370965602952496, "phrase": "dtcwt_decomposition"}, {"score": 0.0023166075278110237, "phrase": "conventional_fft"}, {"score": 0.002264982416465872, "phrase": "sparse_fft"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Electroencephalography (EEG)", " Seizure detection", " Dual-tree complex wavelet transform (DTCWT)", " Fourier transform"], "paper_abstract": "Epilepsy is one of the most common neurological disorders with 0.8% of the world population. The epilepsy is unpredictable and recurrent, so it is very difficult to treat. In this paper, we propose a new Electroencephalography (EEG) seizure detection method by using the dual-tree complex wavelet (DTCWT) - Fourier features. These features achieve perfect classification rates (100%) for the EEG database from the University of Bonn. These classification rates outperform a number of existing EEG seizure detection methods published in the literature. However, it should be mentioned that several recent works also achieved this perfect classification rate (100%). Our proposed method should be as good as these works since our method only performs the DTCWT transform for up to 5 scales and our method only conducts the FFT to the 4th and 5th scales of the DTCWT decomposition. In addition, we could replace the conventional FFT in our method by sparse FFT so that our method could be even faster. (C) 2013 Elsevier Ltd. All rights reserved.", "paper_title": "Automatic EEG seizure detection using dual-tree complex wavelet-Fourier features", "paper_id": "WOS:000330600800028"}