{"auto_keywords": [{"score": 0.04297220633598322, "phrase": "interference_edge"}, {"score": 0.00481495049065317, "phrase": "radio_networks"}, {"score": 0.004788504414069974, "phrase": "long-range_interference"}, {"score": 0.004671274735676484, "phrase": "one-to-all_communication"}, {"score": 0.0046328364646343375, "phrase": "synchronous_radio_networks"}, {"score": 0.0046073860169839305, "phrase": "known_topology"}, {"score": 0.0045194004619162325, "phrase": "interference_range"}, {"score": 0.00428892403807229, "phrase": "transmission_edge"}, {"score": 0.0038518661517315533, "phrase": "smallest_integer"}, {"score": 0.00373682045166829, "phrase": "simple_path"}, {"score": 0.003459191419478298, "phrase": "full_knowledge"}, {"score": 0.0032109670662222416, "phrase": "fast_broadcasting_schedules"}, {"score": 0.0031150035760241705, "phrase": "bounded_number"}, {"score": 0.002907405102646616, "phrase": "transmission_edges"}, {"score": 0.0028596699752849682, "phrase": "maximum_combined_degree"}, {"score": 0.002828281528138126, "phrase": "transmission_and_interference_edges"}, {"score": 0.002669042572650594, "phrase": "interference_distance"}, {"score": 0.0026543514413663893, "phrase": "broadcasting_schedule"}, {"score": 0.0025608053689544475, "phrase": "bipartite_graphs"}, {"score": 0.0024637379406427856, "phrase": "broadcasting_schedules"}, {"score": 0.002409927844969004, "phrase": "main_result"}, {"score": 0.002344311033783139, "phrase": "-shot_broadcasting_schedule"}, {"score": 0.002293103325499786, "phrase": "arbitrary_topology"}, {"score": 0.002163930783583212, "phrase": "broadcast_schedule"}, {"score": 0.0021049977753042253, "phrase": "optimal_solution"}], "paper_keywords": ["Radio networks", " Broadcasting", " Long-range interference", " 1-shot protocols"], "paper_abstract": "We study broadcasting, also known as one-to-all communication, in synchronous radio networks with known topology modeled by undirected (symmetric) graphs, where the interference range of a node is likely exceeding its transmission range. In this model, if two nodes are connected by a transmission edge they can communicate directly. On the other hand, if two nodes are connected by an interference edge they cannot communicate directly and transmission of one node disables recipience of any message at the other node. For a network we term the smallest integer , s.t., for any interference edge there exists a simple path formed of at most transmission edges connecting the endpoints of as its interference distance . In this model the schedule of transmissions is precomputed in advance. It is based on the full knowledge of the size and the topology (including location of transmission and interference edges) of the network. We are interested in the design of fast broadcasting schedules that are energy efficient, i.e., based on a bounded number of transmissions executed at each node. We adopt as the number of nodes, is the diameter of the subnetwork induced by the transmission edges, and refers to the maximum combined degree (formed of transmission and interference edges) of the network. We contribute the following new results: (1) We prove that for networks with the interference distance any broadcasting schedule requires at least rounds. (2) We provide for networks modeled by bipartite graphs an algorithm that computes -shot (each node transmits at most once) broadcasting schedules of length . (3) The main result of the paper is an algorithm that computes a -shot broadcasting schedule of length at most for networks with arbitrary topology. Note that in view of the lower bound from (1) if is poly-logarithmic in this broadcast schedule is a poly-logarithmic factor away from the optimal solution.", "paper_title": "Efficient broadcasting in radio networks with long-range interference", "paper_id": "WOS:000314532300004"}