{"auto_keywords": [{"score": 0.03182516778820416, "phrase": "master_node"}, {"score": 0.00481495049065317, "phrase": "au_nidirectional_ring"}, {"score": 0.00476323161560059, "phrase": "arbitrary_size._self-stabilizing_algorithms"}, {"score": 0.004636340567075841, "phrase": "distributed_algorithms"}, {"score": 0.003921393143378986, "phrase": "constant_space"}, {"score": 0.003675120438902734, "phrase": "unidirectional_ring"}, {"score": 0.0035771121569391916, "phrase": "new_algorithm"}, {"score": 0.0033888405252810927, "phrase": "token-circulation_idea"}, {"score": 0.00333431054099636, "phrase": "afek"}, {"score": 0.00329871272953657, "phrase": "brown"}, {"score": 0.0027295084882654917, "phrase": "lee_et_al"}, {"score": 0.0021049977753042253, "phrase": "master-slave_algorithms"}], "paper_keywords": ["Self-stabilization", " master-slave", " ring", " token circulation"], "paper_abstract": "Self-stabilizing algorithms represent an extension of distributed algorithms in which nodes of the network have neither coordination, synchronization, nor initialization. We consider the model where there is one designated master node and all other nodes are anonymous and have constant space. Recently, Lee et al. obtained such an algorithm for determining the size of a unidirectional ring. We provide a new algorithm that converges much quicker. This algorithm exploits a token-circulation idea due to Afek and Brown. Disregarding the time for stabilization, our algorithm computes the size of the ring at the master node in O(n log n) time compared to O(n(3)) steps used in the algorithm by Lee et al. We have also shown that the master node, after determining the size of the ring, can compute the average of observations made at each node in O(n) rounds or O(n(2)) steps. It seems likely that one should be able to obtain master-slave algorithms for other problems in networks.", "paper_title": "SELF-STABILIZING MASTER-SLAVE TOKEN CIRCULATION AND EFFICIENT SIZE-COMPUTATION IN AU NIDIRECTIONAL RING OF ARBITRARY SIZE", "paper_id": "WOS:000306071800002"}