{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "social_play"}, {"score": 0.0061841097905617716, "phrase": "play_gene"}, {"score": 0.0044231966846655394, "phrase": "commonly_held_hypothesis"}, {"score": 0.004027031316965272, "phrase": "adaptive_benefit"}, {"score": 0.003733021437345604, "phrase": "stag_hunt_game"}, {"score": 0.003601235776892337, "phrase": "predominantly_cooperators"}, {"score": 0.0034902664176377943, "phrase": "costly_strategy"}, {"score": 0.00341309513558946, "phrase": "latter_problem"}, {"score": 0.003293142761521425, "phrase": "subsequent_adult_cooperation"}, {"score": 0.0032492519841546682, "phrase": "agent-based_model"}, {"score": 0.003107117564014497, "phrase": "allelic_social_play_states"}, {"score": 0.0027907771648224273, "phrase": "juvenile_agent"}, {"score": 0.002354302193867031, "phrase": "small_groups"}, {"score": 0.0021334650920198715, "phrase": "novel_mechanism"}, {"score": 0.0021049977753042253, "phrase": "indirect_evolution"}], "paper_keywords": ["Evolution of cooperation", " social play", " learning to cooperate", " evolutionary simulations", " fairness", " population structure"], "paper_abstract": "Social play is common in mammals but its adaptive significance is not well understood. A commonly held hypothesis is that social play allows juveniles to learn skills and rules for cooperation as adults. On this view, the adaptive benefit of social play derives from the benefits of cooperation as adults. However, cooperation is only beneficial if it is used in populations of predominantly cooperators; otherwise, it is a costly strategy. We investigated the latter problem by modeling the link between social play and subsequent adult cooperation using an agent-based model. In our model, agents had a play gene with allelic social play states (i.e., play or not play). Juveniles with a play gene learned to cooperate by successfully engaging in social play with another juvenile agent with a play gene. As adults, agents played the stag hunt game with other adults to obtain resources for reproduction. Those that learned to cooperate by playing as juveniles cooperated in the stag hunt game. When agents aggregated into small groups, we found that social play could evolve by facilitating the learning of cooperation. Our theoretical results also show that social play is a novel mechanism for the indirect evolution of cooperation.", "paper_title": "The evolution of social play by learning to cooperate", "paper_id": "WOS:000366508200003"}