{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "dynamic_features"}, {"score": 0.012648363360137823, "phrase": "tool_support"}, {"score": 0.004773692073488661, "phrase": "programming_languages"}, {"score": 0.004612147352416241, "phrase": "dynamic_and_reflective_features"}, {"score": 0.004513957235071457, "phrase": "powerful_constructs"}, {"score": 0.0036553070575015344, "phrase": "type_systems"}, {"score": 0.003577414339646767, "phrase": "static_analysis_techniques"}, {"score": 0.003324743991757282, "phrase": "empirical_study"}, {"score": 0.0032679254588723707, "phrase": "smalltalk"}, {"score": 0.002622947550220266, "phrase": "qualitative_analysis"}, {"score": 0.0025892330566358503, "phrase": "representative_sample"}, {"score": 0.0023245746777044766, "phrase": "dynamic_feature_usages"}, {"score": 0.002255431275670053, "phrase": "safer_usages"}, {"score": 0.0021789194955896102, "phrase": "informed_decisions"}, {"score": 0.0021049977753042253, "phrase": "language_extensions"}], "paper_keywords": ["Dynamic languages", " Static analysis", " Smalltalk", " Reflection"], "paper_abstract": "The dynamic and reflective features of programming languages are powerful constructs that programmers often mention as extremely useful. However, the ability to modify a program at runtime can be both a boon-in terms of flexibility-, and a curse-in terms of tool support. For instance, usage of these features hampers the design of type systems, the accuracy of static analysis techniques, or the introduction of optimizations by compilers. In this paper, we perform an empirical study of a large Smalltalk codebase-often regarded as the poster-child in terms of availability of these features-, in order to assess how much these features are actually used in practice, whether some are used more than others, and in which kinds of projects. In addition, we performed a qualitative analysis of a representative sample of usages of dynamic features in order to uncover (1) the principal reasons that drive people to use dynamic features, and (2) whether and how these dynamic feature usages can be removed or converted to safer usages. These results are useful to make informed decisions about which features to consider when designing language extensions or tool support.", "paper_title": "How (and why) developers use the dynamic features of programming languages: the case of smalltalk", "paper_id": "WOS:000324229600005"}