{"auto_keywords": [{"score": 0.038948090958912586, "phrase": "agile_supply_chain"}, {"score": 0.00481495049065317, "phrase": "supply_chains"}, {"score": 0.004775726266706856, "phrase": "fuzzy_association_rules_mining"}, {"score": 0.00467905143301368, "phrase": "supply_chain_management"}, {"score": 0.0046409801414169175, "phrase": "scm"}, {"score": 0.004565609517511076, "phrase": "complex_process"}, {"score": 0.004491506786670695, "phrase": "stochastic_and_dynamic_nature"}, {"score": 0.004418601451254075, "phrase": "ever-increasing_complexity"}, {"score": 0.0040052617265655035, "phrase": "generally_accepted_method"}, {"score": 0.003828912548622257, "phrase": "agile_supply_chains"}, {"score": 0.0033176589215021353, "phrase": "new_approach"}, {"score": 0.0031845067058084583, "phrase": "decision_makers"}, {"score": 0.0026810296502682916, "phrase": "fuzzy_classification_rules"}, {"score": 0.002626645763725465, "phrase": "knowledge_acquisition"}, {"score": 0.0023131855385489764, "phrase": "proposed_approach"}, {"score": 0.0022849068677290836, "phrase": "fuzzy_association_rules"}, {"score": 0.002157433262687853, "phrase": "numerical_example"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["supply chain management", " agility", " association rules", " fuzzy logic"], "paper_abstract": "Besides its effectiveness, supply chain management (SCM) is a complex process because of the stochastic and dynamic nature, multi-criterion and ever-increasing complexity of supply chains. Furthermore, companies have realized that agility is essential for their survival and competitiveness. Consequently, there is no generally accepted method by researchers and practitioners for designing, operating and evaluating agile supply chains. Moreover, the ability to build agile supply chain has developed more slowly than anticipated, because technology for managing agile supply chain is still being developed. Therefore, in this paper, we develop a new approach based oil Fuzzy Association Rule Mining to support the decision makers by enhancing the flexibility in making decisions for evaluating agility with both tangibles and intangibles attributes/criteria such as Flexibility, Profitability, Quality, Innovativeness, Pro-activity, Speed of response, Cost and Robustness. Also, by checking the fuzzy classification rules, the goal of knowledge acquisition can be achieved in a framework in which evaluation of agility could be established without constraints, and consequently checked and compared in several details. Efficacy and intricacy of the proposed approach for finding fuzzy association rules from the database for evaluating agility is demonstrated with the help of a numerical example. (C) 2007 Elsevier Ltd. All rights reserved.", "paper_title": "A new approach for evaluating agility in supply chains using Fuzzy Association Rules Mining", "paper_id": "WOS:000256710200007"}