{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "motion_energy_filters"}, {"score": 0.014525739264768599, "phrase": "population_codes"}, {"score": 0.004553265070135597, "phrase": "large_populations"}, {"score": 0.003789137457228946, "phrase": "response_correlations"}, {"score": 0.003714195746979591, "phrase": "actual_cortical_circuits"}, {"score": 0.003669941438286456, "phrase": "neural_coding"}, {"score": 0.003361069456060196, "phrase": "best_models"}, {"score": 0.003334309053314909, "phrase": "motion_selectivity"}, {"score": 0.0033077610063168093, "phrase": "early_visual_areas"}, {"score": 0.0031528393611136704, "phrase": "energy_filters"}, {"score": 0.0031028232755683674, "phrase": "motion-selective_neurons"}, {"score": 0.0030414140732789186, "phrase": "ideal_observer_approach"}, {"score": 0.003005151718290603, "phrase": "filter_responses"}, {"score": 0.0028076592725295646, "phrase": "natural_scenes"}, {"score": 0.0026760974046034854, "phrase": "population_code"}, {"score": 0.0024604876113911173, "phrase": "large_fraction"}, {"score": 0.002382987346529592, "phrase": "total_information"}, {"score": 0.0022803854904010347, "phrase": "considerable_information_loss"}, {"score": 0.0022085455097790537, "phrase": "image_type"}, {"score": 0.0021049977753042253, "phrase": "large_population"}], "paper_keywords": [""], "paper_abstract": "The codes obtained from the responses of large populations of neurons are known as population codes. Several studies have shown that the amount of information conveyed by such codes, and the format of this information, is highly dependent on the pattern of correlations. However, very little is known about the impact of response correlations (as found in actual cortical circuits) on neural coding. To address this problem, we investigated the properties of population codes obtained from motion energy filters, which provide one of the best models for motion selectivity in early visual areas. It is therefore likely that the correlations that arise among energy filters also arise among motion-selective neurons. We adopted an ideal observer approach to analyze filter responses to three sets of images: noisy sine gratings, random dots kinematograms, and images of natural scenes. We report that in our model, the structure of the population code varies with the type of image. We also show that for all sets of images, correlations convey a large fraction of the information: 40% to 90% of the total information. Moreover, ignoring those correlations when decoding leads to considerable information loss-from 50% to 93%, depending on the image type. Finally we show that it is important to consider a large population of motion energy filters in order to see the impact of correlations. Study of pairs of neurons, as is often done experimentally, can underestimate the effect of correlations.", "paper_title": "Population coding with motion energy filters: The impact of correlations", "paper_id": "WOS:000251613500006"}