{"auto_keywords": [{"score": 0.049722360725641276, "phrase": "web_portals"}, {"score": 0.04355159126538614, "phrase": "non-rational_assessment_factors"}, {"score": 0.02322730111336097, "phrase": "intended_use"}, {"score": 0.00773415121036628, "phrase": "technology_acceptance_model"}, {"score": 0.004468037801239238, "phrase": "fierce_competition"}, {"score": 0.004418192459607072, "phrase": "users'_attention"}, {"score": 0.00430402915573404, "phrase": "portal_success"}, {"score": 0.004192803336288522, "phrase": "rational_assessment_factors"}, {"score": 0.003949204622915113, "phrase": "research_participants"}, {"score": 0.003719705944877787, "phrase": "structural_equation_modelling"}, {"score": 0.003637112258469488, "phrase": "research_hypothesis"}, {"score": 0.003387431241133385, "phrase": "mis_research"}, {"score": 0.003299813878412728, "phrase": "assessment_factors"}, {"score": 0.003073216350080926, "phrase": "key_determinant"}, {"score": 0.003050285492466281, "phrase": "user_acceptance"}, {"score": 0.0029053368919259985, "phrase": "portal_context"}, {"score": 0.0027776422068966867, "phrase": "users'_intention"}, {"score": 0.0025198477493173165, "phrase": "web_site_designers"}, {"score": 0.002436289099444074, "phrase": "hedonic_nature"}, {"score": 0.002418099158357658, "phrase": "web_users"}, {"score": 0.0023291617361832157, "phrase": "original_tam"}, {"score": 0.002251911996999611, "phrase": "empirical_model"}, {"score": 0.0021049977753042253, "phrase": "user_behaviour"}], "paper_keywords": ["Electronic commerce", " Portals", " Web site design", " Perception"], "paper_abstract": "Purpose - A lack of differentiation in the function and appearance of web portals has led to fierce competition; attracting users' attention is no doubt the most important factor for portal success. This study aims to combine rational assessment factors and non-rational assessment factors to examine their impact on the intended use of portals. Design/methodology/approach - The research participants were individuals who have experience using web portals. A total of 215 valid questionnaires were collected. Structural equation modelling was used to test the research hypothesis. Findings - This study is based on the technology acceptance model (TAM), a significant model in MIS research. The results show that all assessment factors have an impact on the intended use of web portals. Research limitations/implications - TAM emphasised perceived usefulness as the key determinant of user acceptance of technology. This study finds, however, that in the portal context, non-rational assessment factors such as perceived playfulness and habit have more significant effects on users' intention than perceived usefulness. Practical implications - The paper concludes that non-rational assessment factors are important boundary conditions to the validity of the technology acceptance model. To attract users, web site designers should be more aware of aesthetics and the hedonic nature of web users. Originality/value - This study has contributed to the original TAM by incorporating non-rational assessment factors. It also validates this empirical model. The results of this study can help practitioners create a more successful business model and help researchers better understand user behaviour on the internet.", "paper_title": "Factors influencing the intended use of web portals", "paper_id": "WOS:000291177000004"}