{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "input_sensitive_algorithms"}, {"score": 0.004781498797706604, "phrase": "point_pattern"}, {"score": 0.004682525167261325, "phrase": "hausdorff_metric"}, {"score": 0.004633805690244912, "phrase": "distance_function"}, {"score": 0.004569630374630379, "phrase": "sets_p"}, {"score": 0.004413036532585712, "phrase": "point_pattern_matching"}, {"score": 0.004101366149219787, "phrase": "group_g"}, {"score": 0.004072851768196397, "phrase": "allowed_transformations"}, {"score": 0.003933214459874487, "phrase": "small_subsets"}, {"score": 0.0038116231917604054, "phrase": "small_subset"}, {"score": 0.0036937768530367647, "phrase": "number_k"}, {"score": 0.0033969686698961743, "phrase": "key_observation"}, {"score": 0.0033381913087533457, "phrase": "set_b_subset"}, {"score": 0.0031239353051539347, "phrase": "match_b"}, {"score": 0.0027838831266525773, "phrase": "general_method"}, {"score": 0.002498150733439951, "phrase": "n_log_n_factor"}, {"score": 0.0021951623041245897, "phrase": "big_o_vary"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Geometric pattern matching", " Hausdorff distance", " Approximation", " Randomization"], "paper_abstract": "We study input sensitive algorithms for point pattern matching under various transformations and the Hausdorff metric as a distance function. Given point sets P and Q in the plane, the problem of point pattern matching is to determine whether P is similar to some portion of Q, where P may undergo transformations from a group G of allowed transformations. All algorithms are based on methods for extracting small subsets from Q that can be matched to a small subset of A The runtime is proportional to the number k of these subsets. Let d be the number of points in P that are needed to define a transformation in G. The key observation is that for some set B subset of P of cardinality larger than d, the number of subsets of Q of this cardinality that match B, is practically small, as the problem becomes more constrained. We present methods to extract efficiently all these subsets in Q. We provide algorithms for homothetic, rigid and similarity transformations in the plane and give a general method that works for any dimension and for any group of transformations. The runtime of our algorithms depends roughly linearly on the number of subsets k, in addition to an n log n factor. Thus our approximate matching algorithms run roughly in time O(n log n + km log n), where in and n are the number of points in P and O, respectively. The constants hidden in the big O vary depending on the group of transformations G. (C) 2009 Elsevier Ltd. All rights reserved.", "paper_title": "Approximate input sensitive algorithms for point pattern matching", "paper_id": "WOS:000270261500013"}