{"auto_keywords": [{"score": 0.03454147612846157, "phrase": "equal_weights"}, {"score": 0.012089398624634935, "phrase": "owa_weights"}, {"score": 0.00481495049065317, "phrase": "weighted_averaging_operator_weights"}, {"score": 0.004612897806039655, "phrase": "yager"}, {"score": 0.004200874581076468, "phrase": "owa_operator"}, {"score": 0.004087756756529841, "phrase": "numerous_methods"}, {"score": 0.003916098498242888, "phrase": "maximum_entropy_owa"}, {"score": 0.0035108659422301985, "phrase": "meowa_weights"}, {"score": 0.0034700069041302003, "phrase": "new_method"}, {"score": 0.0031597433845085092, "phrase": "orness_value"}, {"score": 0.002671406231520296, "phrase": "lsowa_method"}, {"score": 0.0026402908398883832, "phrase": "positive_and_negative_portions"}, {"score": 0.0025095811903520274, "phrase": "middle_point"}, {"score": 0.002422890839801611, "phrase": "interval_lsowa_weights"}, {"score": 0.002366763442497185, "phrase": "decision_maker"}, {"score": 0.0022320551224679526, "phrase": "uncertain_interval_lsowa_weights"}, {"score": 0.002154930852763048, "phrase": "multiple_criteria"}, {"score": 0.0021049977753042253, "phrase": "wiley_periodicals"}], "paper_keywords": [""], "paper_abstract": "The ordered weighted averaging (OWA) operator by Yager (IEEE Trans Syst Man Cybern 1988; 18; 183-190) has received much more attention since its appearance. One key point in the OWA operator is to determine its associated weights. Among numerous methods that have appeared in the literature, we notice the maximum entropy OWA (MEOWA) weights that are determined by taking into account two appealing measures characterizing the OWA weights. Instead of maximizing the entropy in the formulation for determining the MEOWA weights, a new method in the paper tries to obtain the OWA weights that are evenly spread out around equal weights as much as possible while strictly satisfying the orness value provided in the program. This consideration leads to the least-squared OWA (LSOWA) weighting method in which the program is to obtain the weights that minimize the sum of deviations from the equal weights since entropy is maximized when all the weights are equal. Above all, the LSOWA method allocates the positive and negative portions to the equal weights that are identical but opposite in sign from the middle point in the number of criteria. Furthermore, interval LSOWA weights can be constructed when a decision maker specifies his or her orness value in uncertain numerical bounds and we present a method, with those uncertain interval LSOWA weights, for prioritizing alternatives that are evaluated by multiple criteria. (c) 2007 Wiley Periodicals, Inc.", "paper_title": "Least-squared ordered weighted averaging operator weights", "paper_id": "WOS:000251850800003"}