{"auto_keywords": [{"score": 0.038237544843764355, "phrase": "web_sites"}, {"score": 0.010800526349017051, "phrase": "digital_dailies"}, {"score": 0.00481495049065317, "phrase": "web_sites'_attributes"}, {"score": 0.004775918707955445, "phrase": "purpose_-_the"}, {"score": 0.00462291551375938, "phrase": "key_factors"}, {"score": 0.004493045859210086, "phrase": "digital_newspapers"}, {"score": 0.004420472010542188, "phrase": "newspaper_web_sites"}, {"score": 0.003848886045448135, "phrase": "structural_equation_model"}, {"score": 0.003725470458263889, "phrase": "intense_effect"}, {"score": 0.003562186600028245, "phrase": "electronic_newspaper"}, {"score": 0.00332375606483146, "phrase": "final_choice"}, {"score": 0.002953164020173741, "phrase": "news_supplier"}, {"score": 0.0028236336891860592, "phrase": "main_aspects"}, {"score": 0.0027893011631269873, "phrase": "digital_newspaper_reading"}, {"score": 0.002623783458189614, "phrase": "newspaper_firms"}, {"score": 0.0022933216359142736, "phrase": "new_medium"}, {"score": 0.00221063611719246, "phrase": "first_studies"}, {"score": 0.0021837406983565098, "phrase": "online_press_reader_behavior"}, {"score": 0.0021049977753042253, "phrase": "main_factors"}], "paper_keywords": ["newspapers", " Internet", " readers"], "paper_abstract": "Purpose - The purpose of this paper is to analyze key factors that could influence the choice of digital newspapers: usability of newspaper web sites, reputation, trust, privacy and familiarity. Design/methodology/approach - A survey on the Internet was applied. The scales were validated and refined, after which the hypotheses were tested by way of a structural equation model. Findings - The results support an intense effect of usability and familiarity with web sites on the choice of electronic newspaper. However, reputation, privacy and trust in the web sites do not influence significantly the final choice of digital dailies. This is due to the readers who do not perceive risk and costs derived by choosing mistakes or giving data, because the change of news supplier is really fast and easy. Research limitations/implications - The main aspects which justify digital newspaper reading should be considered by the management in order to develop its use. Also, newspaper firms should make efforts to improve the levels of usability of their web sites. Moreover, digital dailies should develop strategies in order to ensure the loyalty of readers who could be familiarized with the new medium. Originality/value - This is one of the first studies that analyze online press reader behavior on the Internet. The paper identifies the main factors related to web sites that affect reading newspapers on the Internet.", "paper_title": "Reading newspapers on the Internet: the influence of web sites' attributes", "paper_id": "WOS:000253563100003"}