{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "hard_real-time_systems"}, {"score": 0.011328424034649669, "phrase": "component_model"}, {"score": 0.004543352284098364, "phrase": "safety-critical_systems"}, {"score": 0.0044430006374681285, "phrase": "rapid_pace"}, {"score": 0.004211069233133584, "phrase": "component-based_software_development"}, {"score": 0.004063186599879217, "phrase": "apparent_benefits"}, {"score": 0.004009074013302036, "phrase": "component-based_approach"}, {"score": 0.0033376244286643176, "phrase": "different_types"}, {"score": 0.0033079039414389833, "phrase": "component_interactions"}, {"score": 0.0029978863469038914, "phrase": "corba_component_model"}, {"score": 0.0025404470150468387, "phrase": "modeling_environment"}, {"score": 0.0024292428060702803, "phrase": "component_assemblies"}, {"score": 0.0021049977753042253, "phrase": "john_wiley"}], "paper_keywords": ["ARINC-653", " real-time component model", " hard-real time systems"], "paper_abstract": "The size and complexity of software in safety-critical systems is increasing at a rapid pace. One technology that can be used to mitigate this complexity is component-based software development. However, in spite of the apparent benefits of a component-based approach to development, little work has been done in applying these concepts to hard real-time systems. This paper improves the state of the art by making three contributions: (1) we present a component model for hard real-time systems and define the semantics of different types of component interactions; (2) we present an implementation of a middleware that supports this component model. This middleware combines an open-source CORBA Component Model (CCM) implementation (MICO) with ARINC-653: a state-of-the-art real-time operating systems (RTOS) standard, (3) finally; we describe a modeling environment that enables design, analysis, and deployment of component assemblies. We conclude with a discussion of the lessons learned during this exercise. Our experiences point toward extending both the CCM as well as revising the ARINC-653. Copyright (C) 2011 John Wiley & Sons, Ltd.", "paper_title": "A component model for hard real-time systems: CCM with ARINC-653", "paper_id": "WOS:000296606500007"}