{"auto_keywords": [{"score": 0.028866069900645597, "phrase": "schrodinger_equation"}, {"score": 0.00980991070079966, "phrase": "scalar_test_equation"}, {"score": 0.00481495049065317, "phrase": "runge-kutta_type_tenth_algebraic_order"}, {"score": 0.004745056850725867, "phrase": "vanished_phase-lag"}, {"score": 0.004558012799538011, "phrase": "new_two-step_tenth_algebraic_order_runge-kutta_type_method"}, {"score": 0.004099340908974491, "phrase": "new_obtained_runge-kutta_type_two-step_method"}, {"score": 0.0031961879138783012, "phrase": "developed_method"}, {"score": 0.0030476078950483158, "phrase": "new_obtained_method"}, {"score": 0.002863652837038965, "phrase": "phase-lag_analysis"}, {"score": 0.0027505663559338825, "phrase": "resonance_problem"}, {"score": 0.002680932410366204, "phrase": "coupled_differential_equations"}, {"score": 0.0024915167458844914, "phrase": "approximate_solution"}, {"score": 0.0024462867877027435, "phrase": "related_initial-value"}, {"score": 0.0023582694348219233, "phrase": "oscillating_behavior"}, {"score": 0.002248553559414903, "phrase": "recent_developed_method"}, {"score": 0.0021518035978153878, "phrase": "first_time"}, {"score": 0.0021049977753042253, "phrase": "new_error_estimation"}], "paper_keywords": [""], "paper_abstract": "In this paper we develop a new two-step tenth algebraic order Runge-Kutta type method. The vanishing of its phase-lag and its first, second and third derivatives is required for this method. The impact of the vanishing of the phase-lag and its first, second and third derivatives of the new obtained Runge-Kutta type two-step method on the effectiveness of the method is investigated in this paper. We will study (1) the construction of the method, (2) the its local truncation error (LTE) and the comparison of its LTE with LTE of other similar methods in the literature (comparative local truncation error analysis), (3) the stability (interval of periodicity) of the developed method. We mention that for the investigation of the stability of the new obtained method we will use a scalar test equation with frequency different than the frequency of the scalar test equation used for phase-lag analysis (stability analysis), (4) its efficiency with application on the resonance problem of the Schrodinger equation and on the coupled differential equations arising from the Schrodinger equation. It is will be shown the efficiency of this category of methods on the approximate solution of the Schrodinger equation and related initial-value or boundary-value problems with solutions which have periodical and/or oscillating behavior. We note here that this method is an improvement of the recent developed method in [1]. We also introduce, for the first time in the literature, a new error estimation which is based on the number of derivatives which are vanished in a method.", "paper_title": "Runge-Kutta Type Tenth Algebraic Order Two-Step Method with Vanished Phase-Lag and its First, Second and Third Derivatives", "paper_id": "WOS:000365373800010"}