{"auto_keywords": [{"score": 0.037482702260810276, "phrase": "negative_query_generation"}, {"score": 0.006267759831426196, "phrase": "standard_language_modeling_retrieval_models"}, {"score": 0.00481495049065317, "phrase": "query_likelihood_retrieval_models"}, {"score": 0.004726184966910756, "phrase": "language_modeling_approach"}, {"score": 0.004691136491297242, "phrase": "information_retrieval"}, {"score": 0.004553510708976456, "phrase": "language_modeling_retrieval_models"}, {"score": 0.004370814742381778, "phrase": "query_likelihood_method"}, {"score": 0.004306205029641728, "phrase": "theoretical_perspective"}, {"score": 0.004042056914551798, "phrase": "\"negative_query"}, {"score": 0.0036553070575015344, "phrase": "particular_document"}, {"score": 0.0034695189961509625, "phrase": "basic_query_likelihood_method"}, {"score": 0.0034309482755326016, "phrase": "retrieval_function"}, {"score": 0.0029889584492584073, "phrase": "standard_query_likelihood_function"}, {"score": 0.00295571428544335, "phrase": "potentially_non-optimal_retrieval_function"}, {"score": 0.00269263690712392, "phrase": "general_and_efficient_approach"}, {"score": 0.0026626797255348287, "phrase": "document-dependent_probabilities"}, {"score": 0.0025844090835070986, "phrase": "maximum_entropy"}, {"score": 0.0024897902536499005, "phrase": "negative_query_generation_component"}, {"score": 0.0023719332915829268, "phrase": "query_language_models"}, {"score": 0.0023281003994670714, "phrase": "proposed_query_likelihood"}, {"score": 0.002217880187104576, "phrase": "theoretic_gap"}, {"score": 0.0021049977753042253, "phrase": "retrieval_effectiveness"}], "paper_keywords": ["Negative query generation", " Query likelihood", " Language model", " Relevance", " Probability ranking principle", " Principle of maximum entropy"], "paper_abstract": "The language modeling approach to information retrieval has recently attracted much attention. In the language modeling retrieval models, we can score and rank documents based on the query likelihood method. From the theoretical perspective, however, the justification of the existing (standard) query likelihood method based on the probability ranking principle requires an unrealistic assumption about the generation of a \"negative query\" from a document, which states that the probability that a user who dislikes a document would use a query does not depend on the particular document. This assumption enables ignoring the negative query generation so as to justify using the basic query likelihood method as a retrieval function. In reality, however, this assumption does not hold because a user who dislikes a document would more likely avoid using words in the document when posing a query. This suggests that the standard query likelihood function is a potentially non-optimal retrieval function. In this paper, we attempt to improve the standard language modeling retrieval models by bringing back the component of negative query generation. Specifically, we propose a general and efficient approach to estimate document-dependent probabilities of negative query generation based on the principle of maximum entropy, and derive a more complete query likelihood retrieval function that also contains the negative query generation component. In addition, we further develop a more general probabilistic distance retrieval method to naturally incorporate query language models, which covers the proposed query likelihood with negative query generation as its special case. The proposed approaches not only bridge the theoretic gap between the standard language modeling retrieval models and the notion of relevance, but also improves the retrieval effectiveness with (almost) no additional computational cost.", "paper_title": "Negative query generation: bridging the gap between query likelihood retrieval models and relevance", "paper_id": "WOS:000356775500003"}