{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "non-parametric_regression_lines"}, {"score": 0.008029704938295825, "phrase": "regression_depth"}, {"score": 0.004296264970612285, "phrase": "usual_linear_model"}, {"score": 0.003725470458263889, "phrase": "slight_generalization"}, {"score": 0.0035694525378322647, "phrase": "rousseeuw"}, {"score": 0.003485605409687907, "phrase": "j._am."}, {"score": 0.0034690735529422814, "phrase": "statis"}, {"score": 0.0031693980719538317, "phrase": "hypothesis_testing_strategy"}, {"score": 0.002895535087931938, "phrase": "first_group"}, {"score": 0.0027610089418453614, "phrase": "second_group"}, {"score": 0.002708960273193547, "phrase": "null_hypothesis"}, {"score": 0.0026077803487003, "phrase": "resulting_depths"}, {"score": 0.0021049977753042253, "phrase": "identical_covariate_values"}], "paper_keywords": ["smoothers", " regression depth", " ANCOVA", " percentile bootstrap methods", " strength of association"], "paper_abstract": "This paper deals with the problem of comparing non-parametric regression lines corresponding to two independent groups when there is one predictor. For the usual linear model, the goal reduces to testing the hypothesis that the slopes, as well as the intercepts, are equal. The approach is based in part on a slight generalization of the notion of regression depth as defined by Rousseeuw and Hubert [Regression depth, J. Am. Statis. Assoc. 94 (1999), pp. 388-402]. Roughly, the hypothesis testing strategy begins by fitting two robust non-parametric regression lines to the first group. The first is based on the data from the first group, and the other uses the data from the second group. If the null hypothesis is true, the difference between the resulting depths should be relatively small. The same is true when fitting non-parametric regression lines to the second group. In contrast to most methods for comparing non-parametric regression lines, the focus is on a (conditional) robust measure of location. Moreover, it is not assumed that both groups have identical covariate values, and heteroscedasticity is allowed.", "paper_title": "Comparing non-parametric regression lines via regression depth", "paper_id": "WOS:000276634700002"}