{"auto_keywords": [{"score": 0.02618746839353934, "phrase": "existing_view"}, {"score": 0.012111268378114068, "phrase": "new_view"}, {"score": 0.010336646575818934, "phrase": "plm"}, {"score": 0.009781012194545054, "phrase": "ce"}, {"score": 0.00481495049065317, "phrase": "multiple_views_management_system"}, {"score": 0.004578678036953076, "phrase": "product-related_information"}, {"score": 0.004365498117804683, "phrase": "product_design"}, {"score": 0.004217708394188058, "phrase": "specific_point"}, {"score": 0.0038339398365449507, "phrase": "product_definition"}, {"score": 0.0037435621157530853, "phrase": "multiple_views"}, {"score": 0.0036942726653704213, "phrase": "multiple_disciplines"}, {"score": 0.0036650099009321083, "phrase": "important_issue"}, {"score": 0.003597625122515975, "phrase": "multiple_views_generation_mechanism"}, {"score": 0.003559675269411366, "phrase": "product_feature_evolution_validation"}, {"score": 0.0034942203787603856, "phrase": "pfev_model"}, {"score": 0.003466536738232506, "phrase": "dynamic_workflow"}, {"score": 0.0034299649219748513, "phrase": "information_flow"}, {"score": 0.00338479040742969, "phrase": "product_definition_evolution"}, {"score": 0.0032355864829403413, "phrase": "information_system"}, {"score": 0.0032099453192629976, "phrase": "relevant_pde_information"}, {"score": 0.003192963836435167, "phrase": "appropriate_disciplines"}, {"score": 0.0031342307827666675, "phrase": "specific_views"}, {"score": 0.003109390330476147, "phrase": "current_cad_tool_implementations"}, {"score": 0.003027997655358647, "phrase": "numerical_model"}, {"score": 0.0027015344365793016, "phrase": "views_generation_mechanism"}, {"score": 0.0026518169452004465, "phrase": "not-useful_explicit_information"}, {"score": 0.0026099289298770023, "phrase": "implicit_information"}, {"score": 0.0023346234464901978, "phrase": "data_element"}, {"score": 0.00229164285862567, "phrase": "treatment_parameters"}, {"score": 0.002208035721125305, "phrase": "generated_view"}, {"score": 0.0021616339773325704, "phrase": "views_characterization"}], "paper_keywords": ["multiple views", " concurrent engineering", " collaborative work", " views generation", " PLM", " product design"], "paper_abstract": "Product Lifecycle Management (PLM) is an approach for controlling and exploiting product-related information throughout its lifecycle as needed by various business functions. Concurrent engineering (CE) integrates several disciplines contributing to product design. Both PLM and CE involve information sharing amongst disciplines having a specific point of view regarding the product. While each discipline exerts its own expertise and methods on the definition of the product and its related processes, information must remain consistent for all disciplines and throughout the evolution of the product definition. Therefore, being able to efficiently manage multiple views fulfilling the needs of multiple disciplines is an important issue. This article, proposes a multiple views generation mechanism incorporated in the product feature evolution validation ( PFEV) model. The PFEV model is a dynamic workflow that controls the information flow needed to support a product definition evolution (PDE) while supporting its validation by all the disciplines involved. The model addresses two qualities of an information system: dispatching relevant PDE information to appropriate disciplines and providing this information according to specific views. With current CAD tool implementations, disciplines will not need all the information obtained from the numerical model, which often comes from files characterizing the geometry. Thus, each discipline must interpret the information characterizing the product by performing some filtering or adaptation in order to obtain what is relevant to its function. Two cases are associated with the views generation mechanism that corresponds to the elimination of not-useful explicit information and to the adaptation of implicit information, respectively. To accomplish this, three alternatives are distinguished to generate a view: create a new view, recuperate an existing view and update an existing view. The process used to create a new view is composed of three stages: selection of data element to be treated, selection of treatment parameters to be applied, selection and execution of views generation algorithm. The generated view is then saved in a table of views characterization, which is used to recuperate an existing view. Three reference elements ( treatment parameters, views generation algorithm, and knowledge parameters) are saved when a new view is created. These elements are used for each update required for the existing view.", "paper_title": "A multiple views management system for concurrent engineering and PLM", "paper_id": "WOS:000254129400005"}