{"auto_keywords": [{"score": 0.037167309402965434, "phrase": "brm-k"}, {"score": 0.015719716506582538, "phrase": "rare-event_simulation"}, {"score": 0.01523158788019835, "phrase": "rarity_parameter"}, {"score": 0.012747068859114735, "phrase": "empirical_variance"}, {"score": 0.0047732596509542135, "phrase": "asymptotic_robustness"}, {"score": 0.0044653418703126365, "phrase": "bounded_relative_error"}, {"score": 0.004439520545821, "phrase": "bre"}, {"score": 0.004401065382641793, "phrase": "logarithmic_efficiency"}, {"score": 0.0037195105792632937, "phrase": "bre_and_le_properties"}, {"score": 0.003340768341189764, "phrase": "arbitrary_real_number"}, {"score": 0.003264073180191501, "phrase": "stronger_notion"}, {"score": 0.0030179530101642612, "phrase": "empirical_mean"}, {"score": 0.002880927789104712, "phrase": "state-dependent_importance_sampling"}, {"score": 0.002814759530655965, "phrase": "first-passage_time_probabilities"}, {"score": 0.002655894070657161, "phrase": "convenient_asymptotic_robustness_properties"}, {"score": 0.002587353179212614, "phrase": "light-tailed_and_heavy-tailed_increments"}, {"score": 0.0024987020562103448, "phrase": "robustness_properties"}, {"score": 0.002427145218465736, "phrase": "highly_reliable_markovian_system"}, {"score": 0.0023507916951658455, "phrase": "failure_probability"}, {"score": 0.0022768346311104735, "phrase": "popular_class"}, {"score": 0.002218054404179068, "phrase": "le-k"}, {"score": 0.0021049977753042253, "phrase": "necessary_and_sufficient_condition"}], "paper_keywords": ["Rare-event simulation", " robustness", " bounded relative error", " logarithmic efficiency", " importance sampling", " zero-variance approximation"], "paper_abstract": "The asymptotic robustness of estimators as a function of a rarity parameter, in the context of rare-event simulation, is often qualified by properties such as bounded relative error (BRE) and logarithmic efficiency (LE), also called asymptotic optimality. However, these properties do not suffice to ensure that moments of order higher than one are well estimated. For example, they do not guarantee that the variance of the empirical variance remains under control as a function of the rarity parameter. We study generalizations of the BRE and LE properties that take care of this limitation. They are named bounded relative moment of order k (BRM-k) and logarithmic efficiency of order k (LE-k), where k >= 1 is an arbitrary real number. We also introduce and examine a stronger notion called vanishing relative centered moment of order k, and exhibit examples where it holds. These properties are of interest for various estimators, including the empirical mean and the empirical variance. We develop (sufficient) Lyapunov-type conditions for these properties in a setting where state-dependent importance sampling (IS) is used to estimate first-passage time probabilities. We show how these conditions can guide us in the design of good IS schemes, that enjoy convenient asymptotic robustness properties, in the context of random walks with light-tailed and heavy-tailed increments. As another illustration, we study the hierarchy between these robustness properties (and a few others) for a model of highly reliable Markovian system (HRMS) where the goal is to estimate the failure probability of the system. In this setting, for a popular class of IS schemes, we show that BRM-k and LE-k are equivalent and that these properties become strictly stronger when k increases. We also obtain a necessary and sufficient condition for BRM-k in terms of quantities that can be readily computed from the parameters of the model.", "paper_title": "Asymptotic Robustness of Estimators in Rare-Event Simulation", "paper_id": "WOS:000274379300006"}