{"auto_keywords": [{"score": 0.049390246951185, "phrase": "sustainable_improvements"}, {"score": 0.022682930722375635, "phrase": "competitive_positioning"}, {"score": 0.004413846562278824, "phrase": "business_benefits"}, {"score": 0.004329331617724, "phrase": "particular_sustainable_competitive_advantage"}, {"score": 0.0041051328120736575, "phrase": "resource-based_theory"}, {"score": 0.004007083686875716, "phrase": "effective_deployment"}, {"score": 0.003855034057431947, "phrase": "organization's_competitive_positioning"}, {"score": 0.0036730297909962142, "phrase": "significant_departure"}, {"score": 0.0036201167891046046, "phrase": "enterprise-level_orientation"}, {"score": 0.0031614748814351823, "phrase": "quantitative_and_qualitative_survey"}, {"score": 0.002997572637726648, "phrase": "organization's_ability"}, {"score": 0.002707829887747594, "phrase": "appropriate_portfolio"}, {"score": 0.0024342079318127423, "phrase": "successful_outcome"}, {"score": 0.002285674008055581, "phrase": "spanning'_capabilities"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Resource-based view", " Improved competitive positioning", " Sustainability", " IS capabilities", " Pluralistic research approaches"], "paper_abstract": "It has long been argued that organizations have struggled to achieve business benefits, and in particular sustainable competitive advantage, from their IT investments. In this paper we draw upon resource-based theory to explore how the effective deployment of IS capabilities might deliver sustainable improvements to an organization's competitive positioning. In so doing, this research makes a significant departure from the enterprise-level orientation of prior studies, by focusing upon the role of IS capabilities in leveraging sustainable improvements to competitive positioning from individual IS initiatives. Based upon the responses to a quantitative and qualitative survey of practicing managers, it has been shown that an organization's ability to leverage and sustain improvements in its competitive positioning, from IS initiatives, are directly dependent upon its ability to effectively apply an appropriate portfolio of IS capabilities. Moreover, it has been shown that sustainable improvements in competitive positioning are most likely in circumstances in which the successful outcome of an IS initiative is dependent upon 'outside-in' and spanning' capabilities, which are both lacking in transparency and difficult to replicate. (C) 2009 Elsevier B.V. All rights reserved.", "paper_title": "The role of IS capabilities in delivering sustainable improvements to competitive positioning", "paper_id": "WOS:000269274700004"}