{"auto_keywords": [{"score": 0.04386055666651155, "phrase": "controlled_experiment"}, {"score": 0.029354032023899808, "phrase": "negative_emotions"}, {"score": 0.02404528929305326, "phrase": "pca"}, {"score": 0.00481495049065317, "phrase": "human_speech"}, {"score": 0.004423346952963429, "phrase": "emotional_state"}, {"score": 0.003950121235166406, "phrase": "dutch"}, {"score": 0.003839894670436314, "phrase": "meaningful_speech_units"}, {"score": 0.0032811244238035455, "phrase": "speaker's_emotional_state"}, {"score": 0.0030713353414700295, "phrase": "mean_squared_error"}, {"score": 0.002708029282786675, "phrase": "positive_emotions"}, {"score": 0.002640682934273318, "phrase": "human_and_machine_performance"}, {"score": 0.0026076388058390815, "phrase": "emotional_states"}, {"score": 0.002591271724198251, "phrase": "one's_own_voice"}, {"score": 0.002440805709023898, "phrase": "regression_problems"}, {"score": 0.0023875955141436363, "phrase": "machine_algorithm"}, {"score": 0.002313582249239217, "phrase": "positive_ones"}, {"score": 0.0021998931213841567, "phrase": "dimensional_emotion_theories"}, {"score": 0.0021451564984201364, "phrase": "promising_technique"}, {"score": 0.0021249824741421306, "phrase": "user's_emotional_state"}, {"score": 0.0021049977753042253, "phrase": "envisioned_application"}], "paper_keywords": ["Affective computing", " Vocal expression", " Emotion recognition", " Speech features", " Random forests"], "paper_abstract": "The goals of this research were: (1) to develop a system that will automatically measure changes in the emotional state of a speaker by analyzing his/her voice, (2) to validate this system with a controlled experiment and (3) to visualize the results to the speaker in 2-d space. Natural (non-acted) human speech of 77 (Dutch) speakers was collected and manually divided into meaningful speech units. Three recordings per speaker were collected, in which he/she was in a positive, neutral and negative state. For each recording, the speakers rated 16 emotional states on a 10-point Likert Scale. The Random Forest algorithm was applied to 207 speech features that were extracted from recordings to qualify (classification) and quantify (regression) the changes in speaker's emotional state. Results showed that predicting the direction of change of emotions and predicting the change of intensity, measured by Mean Squared Error, can be done better than the baseline (the most frequent class label and the mean value of change, respectively). Moreover, it turned out that changes in negative emotions are more predictable than changes in positive emotions. A controlled experiment investigated the difference in human and machine performance on judging the emotional states in one's own voice and that of another. Results showed that humans performed worse than the algorithm in the detection and regression problems. Humans, just like the machine algorithm, were better in detecting changing negative emotions rather than positive ones. Finally, results of applying the Principal Component Analysis (PCA) to our data provided a validation of dimensional emotion theories and they suggest that PCA is a promising technique for visualizing user's emotional state in the envisioned application.", "paper_title": "Detecting changing emotions in human speech by machine and humans", "paper_id": "WOS:000326387300002"}