{"auto_keywords": [{"score": 0.047929617715279135, "phrase": "epistemic_uncertainty"}, {"score": 0.00481501413591532, "phrase": "reliable"}, {"score": 0.004529093447865156, "phrase": "proper_representation"}, {"score": 0.004303830426772906, "phrase": "important_prerequisite"}, {"score": 0.004195418010131832, "phrase": "machine_learning"}, {"score": 0.004152818376630929, "phrase": "decision_support_technology"}, {"score": 0.00411064950774695, "phrase": "safety-critical_application_domains"}, {"score": 0.003403122817578447, "phrase": "statistical_variability"}, {"score": 0.002949598537993663, "phrase": "binary_classification"}, {"score": 0.0027600360731762997, "phrase": "query_instance"}, {"score": 0.00240426758768164, "phrase": "fuzzy_preference_relations"}, {"score": 0.002261204313587616, "phrase": "suitable_data"}, {"score": 0.0021705796895687864, "phrase": "chest_pain"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Machine learning", " Classification", " Uncertainty", " Medical decision making", " Medical diagnosis"], "paper_abstract": "A proper representation of the uncertainty involved in a prediction is an important prerequisite for the acceptance of machine learning and decision support technology in safety-critical application domains such as medical diagnosis. Despite the existence of various probabilistic approaches in these fields, there is arguably no method that is able to distinguish between two very different sources of uncertainty: aleatoric uncertainty, which is due to statistical variability and effects that are inherently random, and epistemic uncertainty which is caused by a lack of knowledge. In this paper, we propose a method for binary classification that does not only produce a prediction of the class of a query instance but also a quantification of the two aforementioned sources of uncertainty. Despite being grounded in probability and statistics, the method is formalized within the framework of fuzzy preference relations. The usefulness and reasonableness of our approach is confirmed on a suitable data set with information about patients suffering from chest pain. (C) 2013 Elsevier Inc. All rights reserved.", "paper_title": "Reliable classification: Learning classifiers that distinguish aleatoric and epistemic uncertainty", "paper_id": "WOS:000327001300002"}