{"auto_keywords": [{"score": 0.03275097241605009, "phrase": "e-government_development"}, {"score": 0.00481495049065317, "phrase": "e-government_services"}, {"score": 0.004658426838467567, "phrase": "effective_ict_design"}, {"score": 0.004556901872357751, "phrase": "enid_mumford"}, {"score": 0.003757480190200645, "phrase": "mumford's_ideas"}, {"score": 0.003478321590910367, "phrase": "recent_citizen_engagement_initiatives"}, {"score": 0.002996992362027833, "phrase": "technocentric_approach"}, {"score": 0.0029641011108505785, "phrase": "minimal_engagement"}, {"score": 0.002511803988580901, "phrase": "crucial_enabling_role"}, {"score": 0.0024842242921857705, "phrase": "capacity_building"}, {"score": 0.0023768935613577985, "phrase": "necessary_skills"}, {"score": 0.0022368274529152342, "phrase": "successful_development"}, {"score": 0.0021049977753042253, "phrase": "information_society"}], "paper_keywords": ["socio-technical systems theory", " participatory design", " e-Government : citizen engagement", " capacity building"], "paper_abstract": "Enid Mumford championed an ethical, socio-technical, and participatory approach to the design of ICT systems. In this paper, we focus on the development of e-government as an example of such a system. First, we present an extension of Mumford's ideas about the benefits and process of participation, based on an analysis of recent citizen engagement initiatives. We then examine the extent to which e-government reflects the principles she espoused. The evidence collated indicates that e-government development is currently characterised by a technocentric approach with minimal engagement of citizens. We discuss the implications arising from this analysis, and explore the benefits that governments could achieve from adoption of a sociotechnical, participatory approach to e-government development. The crucial enabling role of capacity building is highlighted. Providing citizens with the necessary skills and capabilities to engage effectively offers the key to the successful development of systems such as e-government which impact our lives in the 21st century Information Society.", "paper_title": "Citizen participation and engagement in the design of e-government services: The missing link in effective ICT design and delivery", "paper_id": "WOS:000251611200004"}