{"auto_keywords": [{"score": 0.030383462681630863, "phrase": "mirror_neurons"}, {"score": 0.004816190477067928, "phrase": "mirror"}, {"score": 0.00443308765153716, "phrase": "individual_mirror_neurons"}, {"score": 0.004312622975366676, "phrase": "brain_imaging"}, {"score": 0.004195418010131832, "phrase": "'mirror_systems"}, {"score": 0.003948613642680196, "phrase": "current_conceptual_models"}, {"score": 0.0039053194919285725, "phrase": "high_level_functions"}, {"score": 0.003841263262252044, "phrase": "action_understanding"}, {"score": 0.0032916702592724217, "phrase": "current_opinions"}, {"score": 0.0031845067058084583, "phrase": "mirror_neuron_function"}, {"score": 0.002996992362027833, "phrase": "current_computational_models"}, {"score": 0.002789528662623221, "phrase": "mirror_systems"}, {"score": 0.0023249757987087055, "phrase": "erroneous_hypothesis"}, {"score": 0.0022492129111567824, "phrase": "imitation_ability"}, {"score": 0.002163930783583212, "phrase": "conceptual_and_computational_models"}, {"score": 0.0021049977753042253, "phrase": "research_effort"}], "paper_keywords": ["mirror neuron", " action understanding", " imitation", " language", " computational model"], "paper_abstract": "Neurophysiology reveals the properties of individual mirror neurons in the macaque while brain imaging reveals the presence of 'mirror systems' (not individual neurons) in the human. Current conceptual models attribute high level functions such as action understanding, imitation, and language to mirror neurons. However, only the first of these three functions is well-developed in monkeys. We thus distinguish current opinions (conceptual models) on mirror neuron function from more detailed computational models. We assess the strengths and weaknesses of current computational models in addressing the data and speculations on mirror neurons (macaque) and mirror systems (human). In particular, our mirror neuron system (MNS), mental state inference (MSI) and modular selection and identification for control (MOSAIC) models are analyzed in more detail. Conceptual models often overlook the computational requirements for posited functions, while too many computational models adopt the erroneous hypothesis that mirror neurons are interchangeable with imitation ability. Our meta-analysis underlines the gap between conceptual and computational models and points out the research effort required from both sides to reduce this gap. (c) 2006 Elsevier Ltd. All rights reserved.", "paper_title": "Mirror neurons and imitation: A computationally guided review", "paper_id": "WOS:000238296600002"}