{"auto_keywords": [{"score": 0.047510470298773616, "phrase": "problematic_social_network_use"}, {"score": 0.006366369339512717, "phrase": "social_network_use"}, {"score": 0.00481495049065317, "phrase": "exploratory_study"}, {"score": 0.004485735417293941, "phrase": "chinese_university_students"}, {"score": 0.003954837422946628, "phrase": "personality_traits"}, {"score": 0.00327356326590461, "phrase": "excessive_time"}, {"score": 0.0032223742018434856, "phrase": "social_networking_sites"}, {"score": 0.0028405715222684183, "phrase": "lower_academic_performance"}, {"score": 0.0027961342030212353, "phrase": "male_students"}, {"score": 0.0027524322170516275, "phrase": "china"}, {"score": 0.0023881683972170422, "phrase": "academic_advisors"}, {"score": 0.002259883463607508, "phrase": "negative_impact"}], "paper_keywords": ["Personality", " Problematic Social Network Use", " Academic Performance", " China"], "paper_abstract": "This paper is an exploratory study of the relationship between personality and problematic social network use among Chinese university students and the impact of problematic social network use on academic performance. Students who scored higher on the personality traits of agreeableness and conscientiousness were less likely to be associated with emotional/physical problems related to social network use. In addition, students who report spending excessive time on social networking sites and those who believe that their academic performance suffers because of social network use are more likely to have lower academic performance. Male students in China who score low on agreeableness are more likely to engage in problematic social network use. The results suggest that academic advisors should consider counseling students on the negative impact of problematic social network use and should plan interventions for students whose academic performance is negatively affected by problematic social network use.", "paper_title": "PERSONALITY, PROBLEMATIC SOCIAL NETWORK USE AND ACADEMIC PERFORMANCE IN CHINA", "paper_id": "WOS:000339143000010"}