{"auto_keywords": [{"score": 0.027718847915881126, "phrase": "optimal_order_quantity"}, {"score": 0.015719716506582538, "phrase": "perfect_quality"}, {"score": 0.004750873844061641, "phrase": "main_purpose"}, {"score": 0.00458412183693466, "phrase": "economic_order_quantity_model"}, {"score": 0.004502943680955863, "phrase": "imperfect_quality"}, {"score": 0.0044231966846655394, "phrase": "defective_items"}, {"score": 0.004154995396099332, "phrase": "single_batch"}, {"score": 0.003973398317120165, "phrase": "previous_studies"}, {"score": 0.003382704886584695, "phrase": "acceptable_defective_part"}, {"score": 0.003278447235176858, "phrase": "remaining_perfect_quality_items"}, {"score": 0.0026567282965815823, "phrase": "annual_profit"}, {"score": 0.002574788013427524, "phrase": "constant_defective_percentage"}, {"score": 0.0024292428060702803, "phrase": "defective_percentage"}, {"score": 0.0023968383387667404, "phrase": "uniform_distribution"}, {"score": 0.002354302193867031, "phrase": "expected_annual_profit"}, {"score": 0.0022311596751824416, "phrase": "corresponding_annual_profit"}, {"score": 0.0021049977753042253, "phrase": "proposed_models"}], "paper_keywords": ["EOQ", " imperfect quality", " acceptable defective part"], "paper_abstract": "The main purpose of this article is to investigate an economic order quantity model for products with imperfect quality, where the defective items are screened out by a 100% inspection process and then can be sold in a single batch by the end of the inspection process. However, differing from the previous studies on the topic, we assume, in this article, that a portion of the defectives (called the acceptable defective part) can be utilised as perfect quality and that the utilisation of the acceptable defective part will reduce the consumption of the remaining perfect quality items after the defectives are sold. In practice, there are a number of goods (e.g. clothes, sporting shoes, purses, porcelain dishes, fruits, vegetables, etc.) with such characteristic. First, we construct the model in terms of annual profit and find the optimal order quantity with a constant defective percentage. Next, we determine the optimal order quantity for the case that the defective percentage follows a uniform distribution by maximising the expected annual profit. For both cases, two properties of the optimal order quantity and the corresponding annual profit are also given. Finally, two numerical examples are provided to illustrate the proposed models.", "paper_title": "EOQ model where a portion of the defectives can be used as perfect quality", "paper_id": "WOS:000306409300011"}