{"auto_keywords": [{"score": 0.036658086388557436, "phrase": "clinical_queries"}, {"score": 0.014975188327500558, "phrase": "pubmed_and_ovid_medline_clinical_queries"}, {"score": 0.013237700781539762, "phrase": "gold_standard_database"}, {"score": 0.009772184992388728, "phrase": "highly_sensitive_search_filters"}, {"score": 0.009554541053180756, "phrase": "highly_specific_search_filters"}, {"score": 0.00481495049065317, "phrase": "medline_clinical_queries"}, {"score": 0.004398094237005956, "phrase": "purpose_categories_therapy"}, {"score": 0.004251210982670317, "phrase": "clinical_prediction"}, {"score": 0.004109212945115815, "phrase": "current_publishing_years"}, {"score": 0.0040171817997972335, "phrase": "recently_published_research_literature"}, {"score": 0.003942059405218598, "phrase": "mcmaster_health_knowledge_refinery"}, {"score": 0.0038392331564122387, "phrase": "mcmaster_plus"}, {"score": 0.003546513036085932, "phrase": "scientific_merit"}, {"score": 0.0035198224928307854, "phrase": "clinical_relevance"}, {"score": 0.002476721068743341, "phrase": "current_database"}, {"score": 0.002402921062033032, "phrase": "modern-day_searchers"}, {"score": 0.002202742267484358, "phrase": "useful_public_resource"}, {"score": 0.002169667676959813, "phrase": "world's_medical_literature"}, {"score": 0.0021049977753042253, "phrase": "clinical_care"}], "paper_keywords": [""], "paper_abstract": "Objective To determine if the PubMed and Ovid MEDLINE clinical queries (which were developed in the publishing year 2000, for the purpose categories therapy, diagnosis, prognosis, etiology, and clinical prediction guides) perform as well when searching in current publishing years. Methods A gold standard database of recently published research literature was created using the McMaster health knowledge refinery (http://hiru.mcmaster.ca/hiru/HIRU_McMaster_HKR.aspx) and its continuously updated database, McMaster PLUS (http://hiru.mcmaster.ca/hiru/HIRU_McMaster_PLUS_projects.aspx). This database contains articles from over 120 clinical journals that are tagged for meeting or not meeting criteria for scientific merit and clinical relevance. The clinical queries sensitive ('broad') and specific ('narrow') search filters were tested in this gold standard database, and sensitivity and specificity were calculated and compared with those originally reported for the clinical queries. Results In all cases, the sensitivity of the highly sensitive search filters and the specificity of the highly specific search filters did not differ substantively when comparing results derived in 2000 with those derived in a more current database. In addition, in all cases, the specificities for the highly sensitive search filters and the sensitivities for the highly specific search filters remained above 50% when testing them in the current database. Discussion These results are reassuring for modern-day searchers. The clinical queries that were derived in the year 2000 perform equally well a decade later. Conclusion The PubMed and Ovid MEDLINE clinical queries have been revalidated and remain a useful public resource for searching the world's medical literature for research that is most relevant to clinical care.", "paper_title": "MEDLINE clinical queries are robust when searching in recent publishing years", "paper_id": "WOS:000314875100023"}