{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "global_software_development"}, {"score": 0.004642105253191792, "phrase": "team_members"}, {"score": 0.004508286991825192, "phrase": "widely_distributed_geographic_locations"}, {"score": 0.003952082333580496, "phrase": "large_software_development_project"}, {"score": 0.003782439611483044, "phrase": "uk"}, {"score": 0.0036198068824262464, "phrase": "international_software_house"}, {"score": 0.003541182515693916, "phrase": "new_zealand"}, {"score": 0.00336428077531883, "phrase": "global_re"}, {"score": 0.003315374849824563, "phrase": "electronic_communication_media"}, {"score": 0.003081272473508291, "phrase": "social_and_cultural_aspects"}, {"score": 0.0028847066125323893, "phrase": "lasting_relationships"}, {"score": 0.0021049977753042253, "phrase": "development_team"}], "paper_keywords": ["global software development", " requirements engineering", " global virtual teams"], "paper_abstract": "Developing software when team members are located in widely distributed geographic locations poses many challenges for developers, particularly during the requirements engineering ( RE) phase. Using a case study of a large software development project with users located in the UK and software developers from an international software house based in New Zealand, the paper argues that while global RE using electronic communication media may be desirable in achieving economy of resources, social and cultural aspects of RE need to be considered so that lasting relationships with clients may be formed, and RE activities achieved. The main impediments to the process of RE during global software development are communication resulting from differences in shared meanings and context associated with the following: distribution of the clients and the development team; distribution of the development team; cultural differences between the clients and the development team; and cultural differences among the development team.", "paper_title": "Impediments to requirements engineering during global software development", "paper_id": "WOS:000251949600013"}