{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "sensor_wireless_networks"}, {"score": 0.004772137871562584, "phrase": "recent_advances"}, {"score": 0.004729704116022601, "phrase": "ad_hoc"}, {"score": 0.0046046429665581555, "phrase": "new_designs"}, {"score": 0.004563691742821759, "phrase": "deployment_orientations"}, {"score": 0.004009074013302036, "phrase": "user_behavior"}, {"score": 0.0037997077863530897, "phrase": "network_performance"}, {"score": 0.003191636645925296, "phrase": "human_relationships"}, {"score": 0.0030248298759040695, "phrase": "existing_technology"}, {"score": 0.002506562885555113, "phrase": "specific_task"}, {"score": 0.002322895056238477, "phrase": "central_server"}, {"score": 0.002271476019266231, "phrase": "wide_range"}, {"score": 0.0021526564019119466, "phrase": "special_issue"}], "paper_keywords": ["User-oriented", " service-oriented", " spontaneous wireless networks", " Ad Hoc networks", " sensor networks"], "paper_abstract": "Recent advances in ad hoc and sensor wireless networks have brought us new designs and deployment orientations. Even more, when the ad hoc (or sensor) wireless network integrate users and services. On one hand, the Quality of Service for each user must be guaranteed. On the other hand, the user behavior and the services offered for the users could affect to the network performance. A spontaneous ad hoc (or sensor) network enables a group of users to communicate and work together collaboratively very close to each other, sharing services, during a period of time. They seek to imitate human relationships in order to work together in groups, running on an existing technology. Devices used for spontaneous ad hoc (or sensor) wireless networks have limited resources, few computing capacity and low energy consumption. User-oriented and service-oriented spontaneous ad hoc and sensor wireless networks can be used to solve a problem, to carry out a specific task, or just to share services and resources between users, with no dependence on a central server. There is a wide range of environments in which these networks can be applied. This special issue tries to collect the most recent research of these types of networks.", "paper_title": "User-Oriented and Service-Oriented Spontaneous Ad Hoc and Sensor Wireless Networks", "paper_id": "WOS:000299194200001"}