{"auto_keywords": [{"score": 0.048013867577183116, "phrase": "wireless_sensor_networks"}, {"score": 0.004816222617400045, "phrase": "laplacian"}, {"score": 0.004384504920139083, "phrase": "new_approach"}, {"score": 0.004149429072483132, "phrase": "laplacian_regularized_least_squares_algorithm"}, {"score": 0.004014452814186653, "phrase": "localization_data"}, {"score": 0.0033837135367113004, "phrase": "alignment_criterion"}, {"score": 0.003309877074892399, "phrase": "appropriate_kernel_function"}, {"score": 0.0031150035760241705, "phrase": "kernel_function"}, {"score": 0.0029805015010906013, "phrase": "pair-wise_sensor_nodes"}, {"score": 0.0028360962841331634, "phrase": "semi-supervised_learning_algorithm"}, {"score": 0.002286781334850213, "phrase": "high_efficiency"}, {"score": 0.0022122603123901114, "phrase": "location_estimation_error"}, {"score": 0.0021879624017959493, "phrase": "crown_copyright"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Localization", " Sensor network", " Semi-supervised Laplacian regularized least squares"], "paper_abstract": "In this paper, we propose a new approach for localization in wireless sensor networks based on semi-supervised Laplacian regularized least squares algorithm. We consider two kinds of localization data: signal strength and pair-wise distance between nodes. When nodes are close within their physical location space, their localization data vectors should be similar. We first propose a solution using the alignment criterion to learn an appropriate kernel function in terms of the similarities between anchors, and the kernel function is used to measure the similarity between pair-wise sensor nodes in the networks. We then propose a semi-supervised learning algorithm based upon manifold regularization to obtain the locations of the non-anchors. We evaluate our algorithm under various network topology, transmission range and signal noise, and analyze its performance. We also compare our approach with several existing approaches, and demonstrate the high efficiency of our proposed algorithm in terms of location estimation error. Crown Copyright (C) 2011 Published by Elsevier B.V. All rights reserved.", "paper_title": "Semi-supervised Laplacian regularized least squares algorithm for localization in wireless sensor networks", "paper_id": "WOS:000292948000008"}