{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "e-health_cardiology_environment"}, {"score": 0.04383265492986195, "phrase": "human_collaboration"}, {"score": 0.004674952036988355, "phrase": "current_knowledge_engineering_systems"}, {"score": 0.004333283735537634, "phrase": "n-tier_system"}, {"score": 0.004050514095922329, "phrase": "prototype_scalable_knowledge_engineering_tactic"}, {"score": 0.003899612025233852, "phrase": "dynamic_information_structure"}, {"score": 0.0038668462001710314, "phrase": "biosignal_data"}, {"score": 0.0035240305920962766, "phrase": "patients'_clinical_management_protocols"}, {"score": 0.002853396755102163, "phrase": "clinically_accepted_normal_limits"}, {"score": 0.0027009493171069763, "phrase": "patients'_risk-levels"}, {"score": 0.002503187934017557, "phrase": "expert-oriented_feedback"}, {"score": 0.002389514188569084, "phrase": "common_time-framework"}, {"score": 0.0023100907305651872, "phrase": "scalable_knowledge_engineering_tactics"}, {"score": 0.0021590588269751816, "phrase": "provided_healthcare_quality"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["scalable knowledge process", " e-Health", " knowledge engineering", " collaborative system"], "paper_abstract": "In an e-health cardiology environment, the current knowledge engineering systems can support two knowledge processes; the knowledge tracing, and the knowledge cataloguing. We have developed an n-tier system capable of supporting these processes by enabling human collaboration in each phase along with, a prototype scalable knowledge engineering tactic. A knowledge graph is used as a dynamic information structure. Biosignal data (values of HR, QRS, and ST variables) from 86 patients were used; two general practitioners defined and updated the patients' clinical management protocols; and feedback was inserted retrospectively. Several calibration tests were also performed. The system succeeded in formulating three knowledge catalogues per patient, namely, the \"patient in life\", the \"patient in time\", and the \"patient in action\". For each patient the clinically accepted normal limits of each variable were predicted with an accuracy of approximately 95%. The patients' risk-levels were identified accurately, and in turn, the errors were reduced. The data and the expert-oriented feedback were also time-stamped correctly and synchronized under a common time-framework. Knowledge processes optimization necessitates human collaboration and scalable knowledge engineering tactics. Experts should be responsible for resenting or rejecting a process if it downgrades the provided healthcare quality. (c) 2007 Elsevier Inc. All rights reserved.", "paper_title": "Tracing and cataloguing knowledge in an e-health cardiology environment", "paper_id": "WOS:000255360000001"}