{"auto_keywords": [{"score": 0.03073815000461229, "phrase": "iot"}, {"score": 0.0066304313340651054, "phrase": "iot_technologies"}, {"score": 0.00481495049065317, "phrase": "recent_development"}, {"score": 0.004774530554776608, "phrase": "communication_devices"}, {"score": 0.004734448316824488, "phrase": "wireless_network_technologies"}, {"score": 0.004635701867952543, "phrase": "new_era"}, {"score": 0.003999578057088828, "phrase": "wireless_networks"}, {"score": 0.0034504423179340738, "phrase": "multiple_research_areas"}, {"score": 0.003407026489727143, "phrase": "body_area_networks"}, {"score": 0.0032938942910948096, "phrase": "unmanned_aerial_vehicle"}, {"score": 0.0032115093493071366, "phrase": "satellite_networks"}, {"score": 0.002655697256976997, "phrase": "different_classifications"}, {"score": 0.002471661547432869, "phrase": "practical_system"}, {"score": 0.0023100907305651872, "phrase": "sensor_terminals"}, {"score": 0.002233301265743633, "phrase": "real-time_simultaneous_utilization"}, {"score": 0.0021049977753042253, "phrase": "next_generation_systems"}], "paper_keywords": ["Internet of Things (IoT)", " tsunami detection", " Body Area Network (BAN)", " satellite", " sensor"], "paper_abstract": "The recent development of communication devices and wireless network technologies continues to advance the new era of the Internet and telecommunications. The various \"things\", which include not only communication devices but also every other physical object on the planet, are also going to be connected to the Internet, and controlled through wireless networks. This concept, which is referred to as the \"Internet of Things (IoT)\", has attracted much attention from many researchers in recent years. The concept of IoT can be associated with multiple research areas such as body area networks, Device-to-Device (D2D) communications networks, home area networks, Unmanned Aerial Vehicle (UAV) networks, satellite networks, and so forth. Also, there are various kinds of applications created by using IoT technologies. Thus, the concept of the IoT is expected to be integrated into our society and support our daily life in the near future. In this paper, we introduce different classifications of IoT with examples of utilizing IoT technologies. In addition, as an example of a practical system using IoT, a tsunami detection system (which is composed of a satellite, sensor terminals, and an active monitoring system for real-time simultaneous utilization of the devices) is introduced. Furthermore, the requirements of the next generation systems with the IoT are delineated in the paper.", "paper_title": "Internet of Things (IoT): Present State and Future Prospects", "paper_id": "WOS:000348141100002"}