{"auto_keywords": [{"score": 0.04043476064430839, "phrase": "eln"}, {"score": 0.015719714774698138, "phrase": "neuroscholar"}, {"score": 0.014605226549086737, "phrase": "published_literature"}, {"score": 0.004316396683332752, "phrase": "essential_and_time-consuming_activity_increases"}, {"score": 0.0036393456309815166, "phrase": "open-source_knowledge_management_system"}, {"score": 0.003468287913322255, "phrase": "scanned_notebook_pages"}, {"score": 0.003393206299636482, "phrase": "data_files"}, {"score": 0.0031360786664165093, "phrase": "similarly_annotated_excerpts"}, {"score": 0.0030017207229983385, "phrase": "knowledge_constructs"}, {"score": 0.002936709606809639, "phrase": "dynamic_node-and-edge_user_interface"}, {"score": 0.0028108690791085536, "phrase": "eln's_utility"}, {"score": 0.0026436755508085223, "phrase": "neuroendocrine_hypothalamic_paraventricular_nucleus"}, {"score": 0.0023487324083283205, "phrase": "pvh_stressor-responsive_neurons"}, {"score": 0.0022480304016499605, "phrase": "reproductive_function"}, {"score": 0.0021516366862117707, "phrase": "open-source_software"}], "paper_keywords": [""], "paper_abstract": "Scientists continually relate information from the published literature to their current research. The challenge of this essential and time-consuming activity increases as the body of scientific literature continues to grow. In an attempt to lessen the challenge, we have developed an Electronic Laboratory Notebook (ELN) application. Our ELN functions as a component of another application we have developed, an open-source knowledge management system for the neuroscientific literature called NeuroScholar (http://www.neuroscholar.org/). Scanned notebook pages, images, and data files are entered into the ELN, where they can be annotated, organized, and linked to similarly annotated excerpts from the published literature within Neuroscholar. Associations between these knowledge constructs are created within a dynamic node-and-edge user interface. To produce an interactive, adaptable knowledge base. We demonstrate the ELN's utility by using it to organize data and literature related to our studies of the neuroendocrine hypothalamic paraventricular nucleus (PVH). We also discuss how the ELN could be applied to model other neuroendocrine systems; as an example we look at the role of PVH stressor-responsive neurons in the context of their involvement in the suppression of reproductive function. We present this application to the community as open-source software and invite contributions to its development.", "paper_title": "NeuroScholar's electronic laboratory notebook and its application to neuroendocrinology", "paper_id": "WOS:000238142100003"}