{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "e-learning_outcomes"}, {"score": 0.0069414693470669295, "phrase": "e-learning_factors"}, {"score": 0.00457696724030363, "phrase": "different_factors"}, {"score": 0.004306795240631196, "phrase": "intervening_role"}, {"score": 0.004073113268289532, "phrase": "conceptual_model"}, {"score": 0.0037555742428544096, "phrase": "readiness_factors"}, {"score": 0.003291336101694653, "phrase": "tehran_high_schools"}, {"score": 0.0032088487124106936, "phrase": "technology-based_educating"}, {"score": 0.00317643367669255, "phrase": "hierarchical_regression_analysis"}, {"score": 0.0030038988468808845, "phrase": "proposed_model"}, {"score": 0.0028990018343924683, "phrase": "moderating_role"}, {"score": 0.002592523232809191, "phrase": "variable's_ranking"}, {"score": 0.0025275050635202878, "phrase": "organizational_readiness_factors"}, {"score": 0.002426842369975213, "phrase": "teachers'_motivation"}, {"score": 0.0023420525732877947, "phrase": "e-learning"}, {"score": 0.00217017119491777, "phrase": "e-learning_systems"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["E-Learning", " Readiness factors", " Outcomes", " Evaluation methodologies", " Iran"], "paper_abstract": "Although many researchers have studied different factors which affect E-Learning outcomes, there is little research on assessment of the intervening role of readiness factors in E-Learning outcomes. This study proposes a conceptual model to determine the role of readiness factors in the relationship between E-Learning factors and E-Learning outcomes. Readiness factors are divided into three main groups including: technical, organizational and social. A questionnaire was completed by 96 respondents. This sample consists of teachers at Tehran high schools who are utilizing a technology-based educating. Hierarchical regression analysis is done and its results strongly support the appropriateness of the proposed model and prove that readiness factors variable plays a moderating role in the relationship between E-Learning factors and outcomes. Also latent moderated structuring (LMS) technique and MPLUS3 software are used to determine each variable's ranking. Results show that organizational readiness factors have the most important effect on E-Learning outcomes. Also teachers' motivation and training is the most important factor in E-Learning. Findings of this research will be helpful for both academics and practitioners of E-Learning systems. (C) 2011 Elsevier Ltd. All rights reserved.", "paper_title": "The role of readiness factors in E-learning outcomes: An empirical study", "paper_id": "WOS:000294099000007"}