{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "cargo_transport"}, {"score": 0.004539005582217309, "phrase": "intracellular_cargos"}, {"score": 0.004223032986655664, "phrase": "mechanistic_understanding"}, {"score": 0.004007083686875716, "phrase": "simple_model_of_cargo_sorting_relies"}, {"score": 0.003631390978147703, "phrase": "mammalian_neurons"}, {"score": 0.003378385493203297, "phrase": "proximal_regions"}, {"score": 0.00329080576226637, "phrase": "mt_polarity"}, {"score": 0.002943147037670826, "phrase": "axons_associate"}, {"score": 0.00290473242917264, "phrase": "kinesin_motors"}, {"score": 0.00268452026617243, "phrase": "dynein_motors"}, {"score": 0.002323142666222693, "phrase": "radiolabelled_cargos"}, {"score": 0.0021753413850499467, "phrase": "model_equations"}, {"score": 0.0021049977753042253, "phrase": "laplace_transform_method"}], "paper_keywords": ["axonal and dendritic cargos", " intracellular transport", " modelling", " neurons"], "paper_abstract": "Explaining how intracellular cargos are sorted between axons and dendrites is important for a mechanistic understanding of what happens in many neurodegenerative disorders. A simple model of cargo sorting relies on differences in microtubule (MT) orientation between axons and dendrites: in mammalian neurons all MTs in axons have their plus ends directed outward while in proximal regions of dendrites the MT polarity is mixed. It can therefore be assumed that cargos that need to be driven into axons associate with kinesin motors while cargos that need to be driven into dendrites associate with dynein motors. This paper develops equations of cargo transport in axons and dendrites based on the above assumptions. Propagation of a pulse of radiolabelled cargos entering an axon and dendrite is simulated. The model equations are solved utilising the Laplace transform method. Differences in cargo transport between axons and dendrites are discussed.", "paper_title": "Sorting of cargos between axons and dendrites: modelling of differences in cargo transport in these two types of neurites", "paper_id": "WOS:000334049900010"}