{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "information_provider_reliability"}, {"score": 0.0047658490795139345, "phrase": "social_media"}, {"score": 0.004490731720620546, "phrase": "conventional_sources"}, {"score": 0.00421410521089045, "phrase": "correct_information"}, {"score": 0.003946345859099774, "phrase": "novel_approach"}, {"score": 0.003914090237817156, "phrase": "user's_characteristics"}, {"score": 0.0038900709793274484, "phrase": "human_cognitive_traits"}, {"score": 0.0036503091562620324, "phrase": "predefined_cognitive_models"}, {"score": 0.003605633331095352, "phrase": "local_assessments"}, {"score": 0.003525137932390881, "phrase": "expertise_consensus"}, {"score": 0.0034819887134406053, "phrase": "social_network"}, {"score": 0.0034323127472317325, "phrase": "aggregation_part"}, {"score": 0.0034112398460330972, "phrase": "subjective_logic"}, {"score": 0.0033419236702649626, "phrase": "first_study"}, {"score": 0.003110188563635517, "phrase": "online_sn"}, {"score": 0.0030407201647895663, "phrase": "distributed_database"}, {"score": 0.0030220441803734577, "phrase": "continuous_data_aggregation"}, {"score": 0.003009657101368068, "phrase": "users_expertise"}, {"score": 0.002704773753419443, "phrase": "small_number"}, {"score": 0.0026552240846100267, "phrase": "latter's_behavior_change"}, {"score": 0.0026280887494927367, "phrase": "cognitive_traits"}, {"score": 0.002569360658936981, "phrase": "consensus_operator"}, {"score": 0.0025431005764264872, "phrase": "multiple_opinions"}, {"score": 0.0025274732036453963, "phrase": "specific_user"}, {"score": 0.002481163483063172, "phrase": "final_assessment"}, {"score": 0.002455802598046507, "phrase": "real_data"}, {"score": 0.0024407343412343376, "phrase": "yahoo"}, {"score": 0.002410802890909515, "phrase": "pairwise_interactions"}, {"score": 0.0024009151997604707, "phrase": "specific_users"}, {"score": 0.002220551141101661, "phrase": "different_behaviors"}], "paper_keywords": ["Q&A social networks", " User reliability", " User expertise", " Subjective logic"], "paper_abstract": "Q&A social media have gained a lot of attention during the recent years. People rely on these sites to obtain information due to a number of advantages they offer as compared to conventional sources of knowledge (e.g., asynchronous and convenient access). However, for the same question one may find highly contradicting answers, causing an ambiguity with respect to the correct information. This can be attributed to the presence of unreliable and/or non-expert users. These two attributes (reliability and expertise) significantly affect the quality of the answer/information provided. We present a novel approach for estimating these user's characteristics relying on human cognitive traits. In brief, we propose each user to monitor the activity of his peers (on the basis of responses to questions asked by him) and observe their compliance with predefined cognitive models. These observations lead to local assessments that can be further fused to obtain a reliability and expertise consensus for every other user in the social network (SN). For the aggregation part we use subjective logic. To the best of our knowledge this is the first study of this kind in the context of Q&A SNs. Our proposed approach is highly distributed; each user can individually estimate the expertise and the reliability of his peers using his direct interactions with them and our framework. The online SN (OSN), which can be considered as a distributed database, performs continuous data aggregation for users expertise and reliability assesment in order to reach a consensus. In our evaluations, we first emulate a Q&A SN to examine various performance aspects of our algorithm (e.g., convergence time, responsiveness etc.). Our evaluations indicate that it can accurately assess the reliability and the expertise of a user with a small number of samples and can successfully react to the latter's behavior change, provided that the cognitive traits hold in practice. Furthermore, the use of the consensus operator for the aggregation of multiple opinions on a specific user, reduces the uncertainty with regards to the final assessment. However, as real data obtained from Yahoo! Answers imply, the pairwise interactions between specific users are limited. Hence, we consider the aggregate set of questions as posted from the system itself and we assess the expertise and realibility of users based on their response behavior. We observe, that users have different behaviors depending on the level at which we are observing them. In particular, while their activity is focused on a few general categories, yielding them reliable, their microscopic (within general category) activity is highly scattered.", "paper_title": "Automatic evaluation of information provider reliability and expertise", "paper_id": "WOS:000348380600003"}