{"auto_keywords": [{"score": 0.018269839746823356, "phrase": "information_model"}, {"score": 0.008944107166946071, "phrase": "web_applications"}, {"score": 0.00481495049065317, "phrase": "managing_resources"}, {"score": 0.004580550308652044, "phrase": "increasingly_complicated_web_applications"}, {"score": 0.004455272634364756, "phrase": "similar_information_models"}, {"score": 0.004309434349688514, "phrase": "sufficiently_generic_information_model"}, {"score": 0.0038998328617557013, "phrase": "namely_the_resource_and_metadata_management_model"}, {"score": 0.00370981613076245, "phrase": "web_architecture"}, {"score": 0.003123203316511694, "phrase": "access_control"}, {"score": 0.002921815042028607, "phrase": "reference_implementation"}, {"score": 0.0028260302580927856, "phrase": "web_application"}, {"score": 0.0026881926384093088, "phrase": "taken_approach"}, {"score": 0.0023394947463129642, "phrase": "resource_annotation"}, {"score": 0.00230080652063411, "phrase": "preliminary_scalability_analysis"}], "paper_keywords": ["Information model", " metadata management", " resource annotation", " linked data", " provenance"], "paper_abstract": "Today information is managed within increasingly complicated Web applications which often rely on similar information models. Finding a reusable and sufficiently generic information model for managing resources and their metadata would greatly simplify development of Web applications. This article presents such an information model, namely the Resource and Metadata Management Model (ReM3). The information model builds upon Web architecture and standards, more specifically the Linked Data principles when managing resources together with their metadata. It allows to express relations between metadata and to keep track of provenance and access control. In addition to this information model, the architecture of the reference implementation is described along with a Web application that builds upon it. To show the taken approach in practice, several real-world examples are presented as showcases. The information model and its reference implementation have been evaluated from several perspectives, such as the suitability for resource annotation, a preliminary scalability analysis and the adoption in a number of projects. This evaluation in various complementary dimensions shows that ReM3 has been successfully applied in practice and can be considered a serious alternative when developing Web applications where resources are managed along with their metadata.", "paper_title": "An information model for managing resources and their metadata", "paper_id": "WOS:000357871400005"}