{"auto_keywords": [{"score": 0.025217926436004658, "phrase": "general_graphs"}, {"score": 0.009880107584254581, "phrase": "np"}, {"score": 0.00481495049065317, "phrase": "bi-objective_network_construction_problems"}, {"score": 0.004619027561771169, "phrase": "host_graph"}, {"score": 0.004534517530868195, "phrase": "edge_weights"}, {"score": 0.004441282284780425, "phrase": "edge_lengths"}, {"score": 0.004175393346343175, "phrase": "e"}, {"score": 0.0038311024026032366, "phrase": "maximum_density_pattern_h"}, {"score": 0.003734979290204709, "phrase": "single_pareto-optimal_solution"}, {"score": 0.0036496814103475174, "phrase": "additional_constraints"}, {"score": 0.003616108223034427, "phrase": "underlying_bi-objective_network_construction_problem"}, {"score": 0.003525360267068501, "phrase": "maximum_density_pattern"}, {"score": 0.0032066653632708965, "phrase": "network_construction_problems"}, {"score": 0.0031625006830124512, "phrase": "limited_budget"}, {"score": 0.0031406462501862254, "phrase": "target_profit"}, {"score": 0.00309023627455429, "phrase": "different_classes"}, {"score": 0.002843450389745497, "phrase": "pseudo-polynomial_linear_time"}, {"score": 0.002689959158343845, "phrase": "fptas"}, {"score": 0.002652878591019016, "phrase": "density_maximization_problem"}, {"score": 0.0025922289692173997, "phrase": "upper_bound"}, {"score": 0.002498053212249228, "phrase": "maximum_density_subgraph_problem"}, {"score": 0.002401728435862681, "phrase": "maximum_density_perfect_matching"}, {"score": 0.0023037734979454746, "phrase": "feasible_solution"}, {"score": 0.0022458849724980904, "phrase": "constant-factor_approximation"}, {"score": 0.0021049977753042253, "phrase": "planar_graphs"}], "paper_keywords": ["Subgraph", " Multi-criteria optimization", " Complexity", " Algorithm"], "paper_abstract": "We consider a framework for bi-objective network construction problems where one objective is to be maximized while the other is to be minimized. Given a host graph G = (V, E) with edge weights w(e) is an element of Z and edge lengths l(e) is an element of N for e is an element of E we define the density of a pattern subgraph H = (V', E') subset of G as the ratio rho(H) = Sigma(e is an element of E') w(e)/Sigma(e is an element of E') l(e). We consider the problem of computing a maximum density pattern H under various additional constraints. In doing so, we compute a single Pareto-optimal solution with the best weight per cost ratio subject to additional constraints further narrowing down feasible solutions for the underlying bi-objective network construction problem. First, we consider the problem of computing a maximum density pattern with weight at least W and length at most L in a host G. We call this problem the bi-constrained density maximization problem. This problem can be interpreted in terms of maximizing the return on investment for network construction problems in the presence of a limited budget and a target profit. We consider this problem for different classes of hosts and patterns. We show that it is NP-hard, even if the host has treewidth 2 and the pattern is a path. However, it can be solved in pseudo-polynomial linear time if the host has bounded treewidth and the pattern is a graph from a given minor-closed family of graphs. Finally, we present an FPTAS for a relaxation of the density maximization problem, in which we are allowed to violate the upper bound on the length at the cost of some penalty. Second, we consider the maximum density subgraph problem under structural constraints on the vertex set that is used by the patterns. While a maximum density perfect matching can be computed efficiently in general graphs, the maximum density Steiner-subgraph problem, which requires a subset of the vertices in any feasible solution, is NP-hard and unlikely to admit a constant-factor approximation. When parameterized by the number of vertices of the pattern, this problem is W[1]-hard in general graphs. On the other hand, it is FPT on planar graphs if there is no constraint on the pattern and on general graphs if the pattern is a path.", "paper_title": "The density maximization problem in graphs", "paper_id": "WOS:000328146100007"}