{"auto_keywords": [{"score": 0.04705607998366274, "phrase": "statistical_properties"}, {"score": 0.031889851447192294, "phrase": "homography_coefficients"}, {"score": 0.015719716506582538, "phrase": "homography_estimation"}, {"score": 0.014444801610990618, "phrase": "estimated_parameters"}, {"score": 0.004775918707955445, "phrase": "first_order_approximation_tools"}, {"score": 0.004366808573435364, "phrase": "basic_tools"}, {"score": 0.004192571571622019, "phrase": "matrix_perturbation_theory"}, {"score": 0.004025258572860201, "phrase": "general_class"}, {"score": 0.00399260264462941, "phrase": "parameter_estimation_problems"}, {"score": 0.0031650944584992726, "phrase": "specific_problem"}, {"score": 0.003051073364818384, "phrase": "derived_statistical_errors"}, {"score": 0.0029773436815290215, "phrase": "improved_approaches"}, {"score": 0.0028935680100446583, "phrase": "constrained_homography_estimation"}, {"score": 0.0028701822586997936, "phrase": "chen"}, {"score": 0.0028467564568456006, "phrase": "suter"}, {"score": 0.0024281181691350085, "phrase": "statistical_simulations"}, {"score": 0.002274684393868218, "phrase": "subspace_based_refinement_stage"}, {"score": 0.0022287497627555895, "phrase": "straightforward_subspace_refinement_approach"}], "paper_keywords": ["Error analysis", " Matrix perturbation theory", " Singular value decomposition", " Low rank matrix approximation", " Homography", " First order approximation", " Mahalanobis distance"], "paper_abstract": "This paper shows how to analytically calculate the statistical properties of the errors in estimated parameters. The basic tools to achieve this aim include first order approximation/perturbation techniques, such as matrix perturbation theory and Taylor Series. This analysis applies for a general class of parameter estimation problems that can be abstracted as a linear (or linearized) homogeneous equation. Of course there may be many reasons why one might which to have such estimates. Here, we concentrate on the situation where one might use the estimated parameters to carry out some further statistical fitting or (optimal) refinement. In order to make the problem concrete, we take homography estimation as a specific problem. In particular, we show how the derived statistical errors in the homography coefficients, allow improved approaches to refining these coefficients through subspace constrained homography estimation (Chen and Suter in Int. J. Comput. Vis. 2008). Indeed, having derived the statistical properties of the errors in the homography coefficients, before subspace constrained refinement, we do two things: we verify the correctness through statistical simulations but we also show how to use the knowledge of the errors to improve the subspace based refinement stage. Comparison with the straightforward subspace refinement approach (without taking into account the statistical properties of the homography coefficients) shows that our statistical characterization of these errors is both correct and useful.", "paper_title": "Error Analysis in Homography Estimation by First Order Approximation Tools: A General Technique", "paper_id": "WOS:000263392200002"}