{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "boundary_aligned"}, {"score": 0.004101281992566145, "phrase": "texture_synthesis"}, {"score": 0.003983334573043943, "phrase": "surface_cross-frame_field"}, {"score": 0.003527181559366122, "phrase": "critical_issue"}, {"score": 0.003409057326528229, "phrase": "spherical_harmonics"}, {"score": 0.003018468582368033, "phrase": "efficient_smoothness_measure"}, {"score": 0.0029747028229638625, "phrase": "cross-frame_field"}, {"score": 0.0025829353063908256, "phrase": "resulting_cross-frame_field"}, {"score": 0.0025207920578878894, "phrase": "boundary_surface"}, {"score": 0.0021464286727045623, "phrase": "high-quality_hexahedralization"}], "paper_keywords": ["hexahedral", " spherical harmonics", " N-RoSy frame field"], "paper_abstract": "In this paper, we present a method for constructing a 3D cross-frame field, a 3D extension of the 2D cross-frame field as applied to surfaces in applications such as quadrangulation and texture synthesis. In contrast to the surface cross-frame field (equivalent to a 4-Way Rotational-Symmetry vector field), symmetry for 3D cross-frame fields cannot be formulated by simple one-parameter 2D rotations in the tangent planes. To address this critical issue, we represent the 3D frames by spherical harmonics, in a manner invariant to combinations of rotations around any axis by multiples of pi/2. With such a representation, we can formulate an efficient smoothness measure of the cross-frame field. Through minimization of this measure under certain boundary conditions, we can construct a smooth 3D cross-frame field that is aligned with the surface normal at the boundary. We visualize the resulting cross-frame field through restrictions to the boundary surface, streamline tracing in the volume, and singularities. We also demonstrate the application of the 3D cross-frame field to producing hexahedron-dominant meshes for given volumes, and discuss its potential in high-quality hexahedralization, much as its 2D counterpart has shown in quadrangulation.", "paper_title": "Boundary Aligned Smooth 3D Cross-Frame Field", "paper_id": "WOS:000297681100021"}