{"auto_keywords": [{"score": 0.044786117849615066, "phrase": "iot"}, {"score": 0.00481495049065317, "phrase": "sensor_networks"}, {"score": 0.004770211811866158, "phrase": "data_analysis"}, {"score": 0.004510336430422002, "phrase": "surrounding_everyday_physical_objects"}, {"score": 0.004108161406159407, "phrase": "wireless_connectivity"}, {"score": 0.004050996777117918, "phrase": "increased_data_storage"}, {"score": 0.0034884152484429207, "phrase": "data-generating_\"things"}, {"score": 0.0032827577713351336, "phrase": "application_and_service_development_methods"}, {"score": 0.0031036643805367487, "phrase": "data_collection"}, {"score": 0.0030461580449080553, "phrase": "data_processing"}, {"score": 0.002948066398723126, "phrase": "advanced_querying"}, {"score": 0.0028664985822266344, "phrase": "sensorhub_framework"}, {"score": 0.0028133741785871867, "phrase": "state-of-the-art_open_source_technologies"}, {"score": 0.0027100527874262446, "phrase": "iot_related_application"}, {"score": 0.002684819249720834, "phrase": "service_development"}, {"score": 0.002562123444678208, "phrase": "iot_related_application_and_service_development"}, {"score": 0.002479579797152119, "phrase": "data_monetization_approach"}, {"score": 0.0023662411481713704, "phrase": "data_views"}, {"score": 0.0023223663501882917, "phrase": "different_data_sources"}], "paper_keywords": [""], "paper_abstract": "The Internet of Things (IoT) is transforming the surrounding everyday physical objects into an ecosystem of information that enriches our everyday life. The IoT represents the convergence of advances in miniaturization, wireless connectivity, and increased data storage and is driven by various sensors. Sensors detect and measure changes in position, temperature, light, and many others; furthermore, they are necessary to turn billions of objects into data-generating \"things\" that can report on their status and often interact with their environment. Application and service development methods and frameworks are required to support the realization of solutions covering data collection, transmission, data processing, analysis, reporting, and advanced querying. This paper introduces the SensorHUB framework that utilizes the state-of-the-art open source technologies and provides a unified tool chain for IoT related application and service development. SensorHUB is both a method and an environment to support IoT related application and service development; furthermore, it supports the data monetization approach, that is, provides a method to define data views on top of different data sources and analyzed data. The framework is available in a Platform as a Service (PaaS) model and has been applied for the vehicle, health, production lines, and smart city domains.", "paper_title": "SensorHUB: An IoT Driver Framework for Supporting Sensor Networks and Data Analysis", "paper_id": "WOS:000359592400001"}