{"auto_keywords": [{"score": 0.04157123421785755, "phrase": "proposed_method"}, {"score": 0.022208280648120308, "phrase": "particular_subject"}, {"score": 0.020299649264967412, "phrase": "blog_community"}, {"score": 0.00481495049065317, "phrase": "latent_blog_community"}, {"score": 0.003130325700934738, "phrase": "small_number"}, {"score": 0.003106541164572609, "phrase": "manually-selected_seed_posts"}, {"score": 0.002900426826591769, "phrase": "seed_posts"}, {"score": 0.0025282151875392817, "phrase": "experimental_results"}, {"score": 0.0024615764782448214, "phrase": "higher_level"}, {"score": 0.002387560868354908, "phrase": "prior_research"}, {"score": 0.0023335099338323974, "phrase": "business_applications"}, {"score": 0.0023069440108381364, "phrase": "extracted_community"}, {"score": 0.0022719915771356354, "phrase": "target_marketing"}, {"score": 0.0022547140008848912, "phrase": "market_monitoring"}, {"score": 0.002229043128610864, "phrase": "search_results"}, {"score": 0.002203663884543687, "phrase": "power_bloggers"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Blog", " Blogosphere", " Online communities", " Online social network", " Latent communities", " Blog communities"], "paper_abstract": "In the blogosphere, there exist posts relevant to a particular subject and blogs that show interest in the subject. In this paper, we define a set of such posts and blogs as a blog community and propose a method for extracting the blog community associated with a particular subject. The proposed method is based on the idea that the blogs who have performed actions (e.g., read, comment, trackback, scrap) to the posts of a particular subject are the ones with interest in the subject, and that the posts that have received actions from such blogs are the ones that contain the subject. The proposed method starts with a small number of manually-selected seed posts containing the subject. Then, the method selects the blogs that have performed actions to the seed posts over some threshold and the posts that have received actions over some threshold. Repeating these two steps gradually expands the blog community. This paper presents various techniques to improve the accuracy of the proposed method. The experimental results show that the proposed method exhibits a higher level of accuracy than the methods proposed in prior research. This paper also discusses business applications of the extracted community, such as target marketing, market monitoring, improving search results, finding power bloggers, and revitalization of the blogosphere. (C) 2011 Elsevier Inc. All rights reserved.", "paper_title": "Subject-based extraction of a latent blog community", "paper_id": "WOS:000297403400013"}