{"auto_keywords": [{"score": 0.04522690430865451, "phrase": "earnings_management"}, {"score": 0.0059343219099081985, "phrase": "neural_network_model"}, {"score": 0.00481495049065317, "phrase": "neural_networks"}, {"score": 0.0047797212183363835, "phrase": "decision_trees"}, {"score": 0.004675565200598801, "phrase": "public_companies"}, {"score": 0.004441236717408874, "phrase": "financial_crisis"}, {"score": 0.0042031320273645065, "phrase": "managers'_purposes"}, {"score": 0.0039341294012600085, "phrase": "related_factors"}, {"score": 0.00322576184471691, "phrase": "financial_crisis_risks"}, {"score": 0.003097865379563127, "phrase": "great_loss"}, {"score": 0.0030638704739988595, "phrase": "stock_market"}, {"score": 0.002878140307340947, "phrase": "tej"}, {"score": 0.0027036380093304747, "phrase": "highest_prediction_rate"}, {"score": 0.0024389277933858054, "phrase": "decision_tree_model"}, {"score": 0.00241214634516517, "phrase": "useful_decision_rules"}, {"score": 0.0023164335087514274, "phrase": "effective_earnings_management_prediction"}, {"score": 0.0022825763382627443, "phrase": "neural_network"}, {"score": 0.00226583335721762, "phrase": "decision_tree_models"}, {"score": 0.002200077887697072, "phrase": "important_decision_rules"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Earnings management", " Neural networks", " Decision trees"], "paper_abstract": "Many financial crisis cases related to the public companies have increased recently, but many investors and creditors are difficult to foresee the financial crisis, especially in the cases with earnings management. Earnings management is Manipulating earnings to fulfill managers' purposes using certain methods or processes. In literature. many studies related to earnings management only focus on identifying some related factors which can significantly affect earnings management. Therefore, we can only figure out the correlation between these factors and earnings management. However, these factors have not been used directly to forecast the level of earnings management in advance (i.e. upward and downward earnings management). In order to decrease the financial crisis risks derived from earnings management and help the investors avoid suffering a great loss in the stock market, we developed a neural network model to predict the level of earnings management. By using the Taiwan Economic Journal (TEJ) dataset and 11 factors which affect earnings management studied in literature, the model provides the highest prediction rate of 81% in the cases of manipulating earnings upwards. In addition, the cases which are correctly predicted by the neural network model are used to construct a decision tree model to generate useful decision rules. Two important rules are identified to allow investors and creditors for effective earnings management prediction. Combining the neural network and decision tree models provide not only higher rate of prediction accuracy but also important decision rules compared with using the neural network model alone. (c) 2008 Elsevier Ltd. All rights reserved.", "paper_title": "Earnings management prediction: A pilot study of combining neural networks and decision trees", "paper_id": "WOS:000263817100175"}