{"auto_keywords": [{"score": 0.03556595312416997, "phrase": "modelz"}, {"score": 0.009605020654945767, "phrase": "power-consumption_history"}, {"score": 0.00936027917378361, "phrase": "power_signature"}, {"score": 0.00481495049065317, "phrase": "analysis_of_energy-greedy_anomalies"}, {"score": 0.004779406424192843, "phrase": "mobile_handsets"}, {"score": 0.004691684576246597, "phrase": "great_importance"}, {"score": 0.00452101969521343, "phrase": "small_mobile_devices"}, {"score": 0.004421601997620278, "phrase": "energy-depletion_attacks"}, {"score": 0.0040904740665330805, "phrase": "medical_emergencies"}, {"score": 0.004060256280654948, "phrase": "disaster_recovery"}, {"score": 0.003927004211021119, "phrase": "traditional_malware_detection_systems"}, {"score": 0.003840598580753804, "phrase": "matching_signatures"}, {"score": 0.0036327808996444904, "phrase": "battery-depletion_attacks"}, {"score": 0.003410768840300913, "phrase": "comprehensive_framework"}, {"score": 0.0033357081777585116, "phrase": "monitors"}, {"score": 0.0032743731084995515, "phrase": "analyzes_energy-greedy_anomalies"}, {"score": 0.0031086137705026483, "phrase": "energy_consumption"}, {"score": 0.002984264956378651, "phrase": "charge_flow_meter"}, {"score": 0.002572463625403536, "phrase": "power_signatures"}, {"score": 0.002469508424323385, "phrase": "false-positive_and_false-negative_detection_rates"}, {"score": 0.002370663905320869, "phrase": "windows_mobile_os"}, {"score": 0.0022009497295481678, "phrase": "suspicious_ones"}, {"score": 0.0021049977753042253, "phrase": "bluetooth_radio"}], "paper_keywords": ["Power-consumption history", " charge flow meter", " power signature", " chi(2)-distance", " moving average filtering"], "paper_abstract": "It is of great importance to protect rapidly-spreading and widely-used small mobile devices like smartphones and PocketPCs from energy-depletion attacks by monitoring software (processes) and hardware (especially, battery) resources. The ability to use these devices for on- and/or off-job functions, and even for medical emergencies or disaster recovery is often dictated by their limited battery capacity. However, traditional malware detection systems and antivirus solutions based on matching signatures are limited to detection of only known malware, and hence, cannot deal with battery-depletion attacks. To meet this challenge, we propose to develop, implement, and evaluate a comprehensive framework, called MODELZ, that MOnitors, DEtects, and anaLyZes energy-greedy anomalies on small mobile devices. MODELZ comprises 1) a charge flow meter that allows infrequent sampling of energy consumption without losing accuracy, 2) a power monitor, in coordination with the charge flow meter, that samples and builds a power-consumption history, and 3) a data analyzer that generates a power signature from the power-consumption history. To generate a power signature, we devise and apply light-weighted, effective noise filtering and data compression, reducing the detection overhead significantly. The similarities between power signatures are measured by the chi(2)-distance and used to lower both false-positive and false-negative detection rates. Our experimental results on an HP iPAQ running the Windows Mobile OS have shown that MODELZ achieves significant (up to 95 percent) storage-savings without losing detection accuracy, and a 99 percent true-positive rate in differentiating legitimate programs from suspicious ones while the monitoring consumes 50 percent less energy than the case of keeping the Bluetooth radio turned on.", "paper_title": "MODELZ: Monitoring, Detection, and Analysis of Energy-Greedy Anomalies in Mobile Handsets", "paper_id": "WOS:000290668400005"}