{"auto_keywords": [{"score": 0.049320924338933134, "phrase": "perfect_matchings"}, {"score": 0.015719716506582538, "phrase": "expressive_power"}, {"score": 0.012156455187259056, "phrase": "permanent_and_hamiltonian_polynomials"}, {"score": 0.01131944442474434, "phrase": "bounded_treewidth"}, {"score": 0.005993510040079616, "phrase": "planar_graphs"}, {"score": 0.0046081311615046375, "phrase": "valiant"}, {"score": 0.004553265070135597, "phrase": "algebraic_model"}, {"score": 0.0041703614123283165, "phrase": "complexity_classes"}, {"score": 0.004120697013789949, "phrase": "vnp"}, {"score": 0.004023120753104693, "phrase": "classical_classes_p"}, {"score": 0.0039911102918360995, "phrase": "np._families"}, {"score": 0.0036553070575015344, "phrase": "previous_paper"}, {"score": 0.003583002730249742, "phrase": "p._koiran"}, {"score": 0.0031152526492532785, "phrase": "arithmetic_formulas"}, {"score": 0.0023079225317714815, "phrase": "exactly_arithmetic_formulas"}, {"score": 0.002147540520631409, "phrase": "bounded_weighted_cliquewidth"}, {"score": 0.002105006474392835, "phrase": "vp"}], "paper_keywords": ["Permanent", " Hamiltonian", " Perfect matching", " Cycle cover", " Algebraic complexity", " Valiant's model", " Topological pathwidth", " Weighted cliquewidth"], "paper_abstract": "Some 25 years ago Valiant introduced an algebraic model of computation in order to study the complexity of evaluating families of polynomials. The theory was introduced along with the complexity classes VP and VNP which are analogues of the classical classes P and NP. Families of polynomials that are difficult to evaluate (that is, VNP-complete) include the permanent and hamiltonian polynomials. In a previous paper the authors together with P. Koiran studied the expressive power of permanent and hamiltonian polynomials of matrices of bounded treewidth, as well as the expressive power of perfect matchings of planar graphs. It was established that the permanent and hamiltonian polynomials of matrices of bounded treewidth are equivalent to arithmetic formulas. Also, the sum of weights of perfect matchings of planar graphs was shown to be equivalent to (weakly) skew circuits. In this paper we continue the research in the direction described above, and study the expressive power of permanents, hamiltonians and perfect matchings of matrices that have bounded pathwidth or bounded cliquewidth. In particular, we prove that permanents, hamiltonians and perfect matchings of matrices that have bounded pathwidth express exactly arithmetic formulas. This is an improvement of our previous result for matrices of bounded treewidth. Also, for matrices of bounded weighted cliquewidth we show membership in VP for these polynomials.", "paper_title": "On the Expressive Power of Permanents and Perfect Matchings of Matrices of Bounded Pathwidth/Cliquewidth", "paper_id": "WOS:000276746700010"}