{"auto_keywords": [{"score": 0.042831808325527417, "phrase": "user's_own_taste"}, {"score": 0.00481495049065317, "phrase": "trust_networks"}, {"score": 0.004764542405129454, "phrase": "collaborative_recommendations"}, {"score": 0.004426092397211699, "phrase": "data_scarcity"}, {"score": 0.0034555479218891638, "phrase": "users'_individual_characteristics"}, {"score": 0.003209782650616367, "phrase": "local_topology-based_ensemble_model"}, {"score": 0.002711506442590442, "phrase": "local_topology-based_parameter"}, {"score": 0.0024272350606639147, "phrase": "item_ratings"}, {"score": 0.0024017638230939514, "phrase": "sentiment_values"}, {"score": 0.002326938965568362, "phrase": "review_contents"}, {"score": 0.0022544399432457164, "phrase": "adaptive_ensemble_model"}, {"score": 0.002207363758847308, "phrase": "comprehensive_experiments"}, {"score": 0.0021049977753042253, "phrase": "existing_ones"}], "paper_keywords": ["Recommender", " Collaborative filtering", " Trust network", " Ensemble", " Cluster coefficient", " Sentiment analysis"], "paper_abstract": "Several existing recommender algorithms combine collaborative filtering and social/trust networks together in order to overcome the problems caused by data scarcity and to produce more effective recommendations for users. In general, those methods fuse a user's own taste and his trusted friends/users' tastes using an ensemble model where a parameter is used to balance these two components. However, this parameter is often set as a constant and with no regard to users' individual characteristics. Aiming at introducing personalization to solve the above problem, we propose a local topology-based ensemble model to adaptively combine a user's own taste and his trusted friends/users' tastes. We take users' clustering coefficients in the social/trust networks as the indicator to measure the consistence of their selecting trusted friends/users and leverage this local topology-based parameter in the ensemble model. To predict the likelihood of users' purchasing actions on items, we also combine item ratings and sentiment values which are reflected in the review contents as the input to the adaptive ensemble model. We conduct comprehensive experiments which demonstrate the superiority of our adaptive algorithms over the existing ones.", "paper_title": "Adaptive ensemble with trust networks and collaborative recommendations", "paper_id": "WOS:000359548100007"}