{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "angiotensin-converting_enzyme"}, {"score": 0.004513517488295745, "phrase": "ace"}, {"score": 0.004385555408850022, "phrase": "important_zinc-dependent_hydrolase"}, {"score": 0.004230749292148046, "phrase": "inactive_angiotensin"}, {"score": 0.004110831924517065, "phrase": "vasoconstrictor_angiotensin_ii"}, {"score": 0.003965684670332574, "phrase": "vasodilator_bradykinin"}, {"score": 0.003798231095121328, "phrase": "binding_mode"}, {"score": 0.0037710151976096985, "phrase": "cif_ace"}, {"score": 0.00333697550984782, "phrase": "ace_michaelis_complex"}, {"score": 0.003038983069081333, "phrase": "human_testis_angiotensin-converting_enzyme"}, {"score": 0.0025021765811679446, "phrase": "x-ray_structures"}, {"score": 0.0022785613865764923, "phrase": "michaelis_complex"}, {"score": 0.0021049977753042253, "phrase": "ace_catalysis"}], "paper_keywords": [""], "paper_abstract": "Angiotensin-converting enzyme (ACE) is an important zinc-dependent hydrolase responsible for converting the inactive angiotensin I to the vasoconstrictor angiotensin II and for inactivating the vasodilator bradykinin. However, the substrate binding mode cif ACE has not been completely understood. In this work, we propose a model for an ACE Michaelis complex based on two known X-ray structures of inhibitor-enzyme complexes. Specifically, the human testis angiotensin-converting enzyme (tACE) complexed with two clinic drugs were first investigated using a combined quantum mechanical and molecular mechanical (QM/MM) approach. The structural parameters obtained from the 550 ps molecular dynamics simulations are in excellent agreement with the X-ray structures, validating the QM/MM approach. Based on these structures, a model for the Michaelis complex was proposed and simulated using the same computational protocol. Implications to ACE catalysis are discussed.", "paper_title": "Inhibitor and Substrate Binding by Angiotensin-Converting Enzyme: Quantum Mechanical/Molecular Mechanical Molecular Dynamics Studies", "paper_id": "WOS:000290747300010"}