{"auto_keywords": [{"score": 0.04623487127047266, "phrase": "soa"}, {"score": 0.00481495049065317, "phrase": "service-oriented_architectures"}, {"score": 0.004772818068176176, "phrase": "service-oriented_architecture"}, {"score": 0.0046079260641779755, "phrase": "software_development"}, {"score": 0.004092168350316413, "phrase": "service_customers"}, {"score": 0.0036499505265403377, "phrase": "soa_application"}, {"score": 0.003298631258267805, "phrase": "soa_system"}, {"score": 0.003226834737003501, "phrase": "petri_nets"}, {"score": 0.0031289290660162145, "phrase": "qos_levels"}, {"score": 0.0028276174348291923, "phrase": "real_system"}, {"score": 0.002717750004930131, "phrase": "design_phase"}, {"score": 0.0025778546800417808, "phrase": "model_findings"}, {"score": 0.0024451427672857458, "phrase": "final_contribution"}, {"score": 0.0021998194157393353, "phrase": "potential_sea_violations"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Petri Nets", " Service-Oriented Architectures", " Service orchestration", " Modeling", " Simulation"], "paper_abstract": "Service-oriented Architecture (SOA) is a paradigm for software development based on the concept of service. In SOA, the Quality of Services (QoS) impacts on the status of a business and on the relationship between service customers and providers. As customers expect to receive services with quality no less than they have paid for, it is usual to stress a SOA application in order to measure its QoS levels, which can be expensive and time consuming. This paper shows that the behavior of a SOA system can be modeled by Petri Nets and, from the model, QoS levels (performance and availability) can be estimated. In this way, the analysis can be conducted without necessarily implementing the real system, which tends to be valuable in the design phase of SOA. Additionally, we present a methodology to implement the model findings, which allows to verify its accuracy in practice. As a final contribution we associate our modeling approach to the Service Level Agreements (SEA) composition, which allows to discover and prevent bottlenecks delaying the system and to anticipate potential SEA violations. Two examples illustrate our results. (C) 2015 Elsevier Ltd. All rights reserved.", "paper_title": "A quality-driven approach for resources planning in Service-Oriented Architectures", "paper_id": "WOS:000353746900027"}