{"auto_keywords": [{"score": 0.032207519814575626, "phrase": "tcad_device_simulations"}, {"score": 0.004781915513030716, "phrase": "finfet_standard_cells"}, {"score": 0.004749106104067268, "phrase": "pvt_variations"}, {"score": 0.004668059458774745, "phrase": "different_multi-gate_transistors"}, {"score": 0.004636027593561925, "phrase": "finfets_and_trigate_fets"}, {"score": 0.004342430078306461, "phrase": "cost-effective_fabrication_process"}, {"score": 0.004253618550301311, "phrase": "optimization_techniques"}, {"score": 0.004123781267600542, "phrase": "multi-gate_transistors"}, {"score": 0.004011687811047391, "phrase": "accurate_leakage"}, {"score": 0.0039026293611597166, "phrase": "spatial_and_environmental_variations"}, {"score": 0.0037965243835456214, "phrase": "circuit_designers"}, {"score": 0.0037445545584005014, "phrase": "accurate_analytical_models"}, {"score": 0.0037188360359702182, "phrase": "central_composite_rotatable_design"}, {"score": 0.003693293499842943, "phrase": "ccrd"}, {"score": 0.0036427316134070007, "phrase": "response_surface_methodology"}, {"score": 0.002841971477743441, "phrase": "cpu_time"}, {"score": 0.0026893753781434618, "phrase": "analytical_leakage"}, {"score": 0.0026525207297080937, "phrase": "different_sizes"}, {"score": 0.0026342827320931937, "phrase": "logic_styles"}, {"score": 0.002358917661465133, "phrase": "analytical_models"}, {"score": 0.0023346234464901978, "phrase": "close_agreement"}, {"score": 0.002255431275670053, "phrase": "monte_carlo_simulations"}, {"score": 0.0021490449563443025, "phrase": "root_mean_square_error"}, {"score": 0.0021342787917767916, "phrase": "rmse"}], "paper_keywords": ["FinFETs", " non-planar devices", " leakage/delay models"], "paper_abstract": "Among different multi-gate transistors, FinFETs and Trigate FETs have set themselves apart as the most promising candidates for the upcoming 22nm technology node and beyond owing to their superior device performance, lower leakage power consumption, and cost-effective fabrication process. Innovative circuit design and optimization techniques will be required to harness the power of multi-gate transistors, which in turn will depend on accurate leakage and timing characterization of these devices under spatial and environmental variations. Hence, in order to aid circuit designers, we present accurate analytical models using central composite rotatable design (CCRD) based on response surface methodology (RSM) to estimate the leakage current and delay of FinFET standard cells under the effect of variations in gate length (L-G), fin thickness (T-SI), gate-oxide thickness (T-OX), gate-workfunction (Phi(G)), supply voltage (V-DD), and temperature (T). To the best of our knowledge, this is the first such attempt to develop analytical models for leakage/delay estimation of FinFET logic gates. To derive these models, we employ TCAD device simulations of adjusted 2D device cross sections that have been shown to track TCAD device simulations of 3D device behavior within a 1-3% error range. This drastically reduces the CPU time of our modeling technique (by several orders of magnitude) without much loss in accuracy. We present analytical leakage and delaymodels for different sizes and logic styles (e. g., shorted-gate (SG) and independent-gate (IG) FinFETs at the 22nm technology node). Both leakage and delay estimates derived from the analytical models are in close agreement with quasi-Monte Carlo (QMC) simulation results (QMC simulations track the accuracy of Monte Carlo simulations, but are several orders of magnitude faster) obtained for different adjusted-2D logic gates with a root mean square error (RMSE) in the 0.23%-5.87% range.", "paper_title": "Accurate Leakage/Delay Estimation for FinFET Standard Cells under PVT Variations using the Response Surface Methodology", "paper_id": "WOS:000345067100012"}