{"auto_keywords": [{"score": 0.04665430102855293, "phrase": "virtual_learning_environments"}, {"score": 0.00481495049065317, "phrase": "primary_school_children's_affective_responses"}, {"score": 0.004247560712327667, "phrase": "learning_experiences"}, {"score": 0.0039216854691927865, "phrase": "purposefully_designed_artifacts"}, {"score": 0.003746779951069909, "phrase": "follow-up_study"}, {"score": 0.003683220696820102, "phrase": "occ"}, {"score": 0.0034988876789164235, "phrase": "learners'_emotional_experiences"}, {"score": 0.0033811403330431897, "phrase": "learning_package"}, {"score": 0.00332375606483146, "phrase": "primary_school_children"}, {"score": 0.0029148831519944358, "phrase": "young_children's_emotional_responses"}, {"score": 0.0028167336373711494, "phrase": "preliminary_findings"}, {"score": 0.002784755056588371, "phrase": "twenty-four_young_children"}, {"score": 0.0026302120935562568, "phrase": "avatars'_expressions"}, {"score": 0.0021049977753042253, "phrase": "appropriate_underlying_pedagogical_considerations"}], "paper_keywords": ["Avatars", " Emotion", " Motivation", " Learning", " Primary school children"], "paper_abstract": "Costly time and resources have been invested to produce virtual learning environments with avatars as companions or tutors to enhance learning experiences. However, there is little research carried out to get feedback on these purposefully designed artifacts for learning. The paper describes a follow-up study applying the OCC, a well-referenced, cognitive theory of emotions, to investigate learners' emotional experiences and motivations while using a learning package designed for primary school children (6-8 years old). Specifically, the study aims to examine whether the expressions of avatars have an influence on these young children's emotional responses and motivation towards learning. Preliminary findings with twenty-four young children participants showed that they loved avatars and influenced by avatars' expressions on their performances. The participants also expressed feelings of satisfaction and fun in their learning interactions with their selected avatars. There was a gender-biased towards the 'gender' of the avatars. The paper concludes that avatars implemented with appropriate underlying pedagogical considerations and purposes can be beneficial to learners in virtual learning environments, especially young children.", "paper_title": "Investigating effects of avatars on primary school children's affective responses to learning", "paper_id": "WOS:000309997800006"}