{"auto_keywords": [{"score": 0.048364759730099696, "phrase": "gait_analyses"}, {"score": 0.03919769031169631, "phrase": "field_studies"}, {"score": 0.03266085703515474, "phrase": "expected_difference"}, {"score": 0.028930494932271376, "phrase": "walking_episodes"}, {"score": 0.00481495049065317, "phrase": "accelerometry-based_gait_parameters"}, {"score": 0.004728015631845441, "phrase": "dementia"}, {"score": 0.0046004861111734185, "phrase": "important_tool"}, {"score": 0.004490020801780961, "phrase": "rehabilitation_process"}, {"score": 0.004136333933790974, "phrase": "clinical_settings"}, {"score": 0.0038805454197432337, "phrase": "patients'_gait"}, {"score": 0.0036074566790283633, "phrase": "gait_parameters"}, {"score": 0.003563841266960747, "phrase": "single_waist-mounted_accelerometer"}, {"score": 0.0032137033371524852, "phrase": "active_older_people"}, {"score": 0.0029783256772952073, "phrase": "accelerometric-based_gait_parameters"}, {"score": 0.002933354468864442, "phrase": "e.g._velocity"}, {"score": 0.00291555613737437, "phrase": "step_frequency"}, {"score": 0.0028978654846251047, "phrase": "compensation_movements"}, {"score": 0.0028454331415283213, "phrase": "accelerometric_signal"}, {"score": 0.0028110048684383167, "phrase": "ten_subjects"}, {"score": 0.002565695161331182, "phrase": "auc_value"}, {"score": 0.0021438155673297377, "phrase": "supervised_clinical_trials"}, {"score": 0.0021049977753042253, "phrase": "high_accuracy"}], "paper_keywords": ["Field study", " dementia", " accelerometer", " gait parameters"], "paper_abstract": "Background: Gait analyses are an important tool to diagnose diseases or to measure the rehabilitation process of patients. In this context, sensor-based systems, and especially accelerometers, gain in importance. They are able to improve objectiveness of gait analyses. In clinical settings, there is usually a supervisor who gives instructions to the patients, but this can have an influence on patients' gait. It is expected that this effect I will be smaller in field studies. Objective: Aim of this study was to capture and evaluate gait parameters measured by a. single waist-mounted accelerometer during everyday life of subjects. Methods: Due to missing ground-truth in, unsupervised conditions, another external criterion had to be chosen. Subjects of two different groups were considered: patients with dementia (DEM) and active older people (ACT). These groups were chosen, because of the expected difference in gait. The idea was to quantify the expected difference of accelerometric-based gait parameters. Gait parameters were e.g. velocity, step frequency, compensation movements, and variance of the accelerometric signal. Results: Ten subjects were measured in each group. The number of walking episodes captured was 1,187 (DEM) vs. 1,809 (ACT). The compensation and variance parameters showed an AUC value (Area Under the Curve) between 0.88 and 0.92. In contrast, velocity and step frequency performed poorly (AUC values of 0.51 and 0.55). It was possible to; classify both groups using these parameters with an accuracy of 89.2%. Conclusion: The results showed a much higher amount of walking episodes in field studies compared to supervised clinical trials. The classification showed a high accuracy in distinguishing between both groups.", "paper_title": "Measurement of Accelerometry-based Gait Parameters in People with and without Dementia in the Field A Technical Feasibility Study", "paper_id": "WOS:000323468700006"}