{"auto_keywords": [{"score": 0.044248716487613034, "phrase": "gprs"}, {"score": 0.004400804926266097, "phrase": "key_radio_access_functions"}, {"score": 0.003999578057088828, "phrase": "random_access_protocols"}, {"score": 0.003932654396285872, "phrase": "cellular_radio_data_networks"}, {"score": 0.003823584649521733, "phrase": "gprs_specification"}, {"score": 0.0034944094552943, "phrase": "respective_systems"}, {"score": 0.0033594249301033604, "phrase": "assigned_multiple_access_protocol"}, {"score": 0.003247868216333148, "phrase": "dynamic_placement"}, {"score": 0.0032115093493071366, "phrase": "control_channels"}, {"score": 0.0031577303835881964, "phrase": "packet_data_channel"}, {"score": 0.0031223774204093713, "phrase": "statistical_multiplexing"}, {"score": 0.00305285084207725, "phrase": "ip_packets"}, {"score": 0.002984867789900281, "phrase": "mobile_stations"}, {"score": 0.0028695095228791724, "phrase": "key_differentiators"}, {"score": 0.0024926348205500715, "phrase": "gprs_radio_interface_protocol"}, {"score": 0.0024234059612683032, "phrase": "etsi_gprs_standard_development"}], "paper_keywords": [""], "paper_abstract": "GPRS, the General Packet Radio Service in GSM was the enabler of the mobile Internet. The origins of key radio access functions employed for packet-switching in GPRS are identified by reviewing state-of-the-art on random access protocols applied in cellular radio data networks existent or proposed before GPRS specification started. A table is provided showing the degree of conformance to GPRS of the respective systems. Besides the type of demand assigned multiple access protocol used in a system, dynamic placement of control channels to the packet data channel and statistical multiplexing of fractions of IP packets of simultaneously transmitting mobile stations to the same packet data channel appear to be key differentiators, besides others. CELLPAC by comparing its functions to that of GPRS is shown to comprise what is called here the Fundaments of the GPRS Radio Interface Protocol. The history of ETSI GPRS standard development is described. Although GPRS is a result of cooperation of many actors which contributions are valued, it appears possible to identify the roots of its radio access protocol and thereby main contributors.", "paper_title": "THE ROOTS OF GPRS: THE FIRST SYSTEM FOR MOBILE PACKET-BASED GLOBAL INTERNET ACCESS", "paper_id": "WOS:000327502000004"}