{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "river_formation_dynamics"}, {"score": 0.004729704116022601, "phrase": "finite_state_machine"}, {"score": 0.004523103062368843, "phrase": "short_interaction_sequences"}, {"score": 0.004287008195370748, "phrase": "typical_goal"}, {"score": 0.003973398317120165, "phrase": "equivalent_states"}, {"score": 0.0030656984915295275, "phrase": "required_parts"}, {"score": 0.0028032928749970026, "phrase": "optimal_sequences"}, {"score": 0.002729029534060092, "phrase": "np-hard_problem"}, {"score": 0.0026686444508167875, "phrase": "heuristic_method"}, {"score": 0.0025632898741546556, "phrase": "evolutionary_computation_approach"}, {"score": 0.0025291018422967083, "phrase": "particular_river_formation_dynamics"}, {"score": 0.0024620842899061614, "phrase": "finite_state_machine_specifications"}, {"score": 0.0023125191783901367, "phrase": "testing_plans"}, {"score": 0.0022613292987262177, "phrase": "experimental_results"}, {"score": 0.0021915573326125428, "phrase": "previously_traversed_states"}, {"score": 0.0021049977753042253, "phrase": "target_configurations"}], "paper_keywords": ["Testing", " Weighted Finite State Machines", " Minimum Load Sequence", " Evolutionary Computation", " River Formation Dynamics"], "paper_abstract": "Given a finite state machine denoting the specification of a system, finding some short interaction sequences capable of reaching some/all states or transitions of this machine is a typical goal in testing methods. If these sequences are applied to an implementation under test, then equivalent states or transitions would be reached and observed in the implementation-provided that the implementation were actually defined as the specification. We study the problem of finding such sequences in the case where configurations previously traversed can be saved and restored (at some cost). In general, this feature enables sequences to reach the required parts of the machine in less time, because some repetitions can be avoided. However, we show that finding optimal sequences in this case is an NP-hard problem. We propose an heuristic method to approximately solve this problem based on an evolutionary computation approach, in particular river formation dynamics (RFD). Given finite state machine specifications and sets of states/transitions to be reached, we apply RFD to construct testing plans reaching these configurations. Experimental results show that being able to load previously traversed states generally reduces the time needed to cover the target configurations.", "paper_title": "Testing restorable systems: formal definition and heuristic solution based on river formation dynamics", "paper_id": "WOS:000323252400004"}