{"auto_keywords": [{"score": 0.03573933092217054, "phrase": "free_lunch"}, {"score": 0.00481495049065317, "phrase": "critical_section_pressure"}, {"score": 0.004746065479362881, "phrase": "free-lunch_profiler"}, {"score": 0.004655827713219637, "phrase": "java"}, {"score": 0.004523455475492876, "phrase": "large_multi-threaded_server-class_applications"}, {"score": 0.004352876088312741, "phrase": "shared_data"}, {"score": 0.0035741900278634616, "phrase": "specific_phases"}, {"score": 0.0032777653153451265, "phrase": "java_application_servers"}, {"score": 0.0025644240336018045, "phrase": "high_csp"}, {"score": 0.002443890721386284, "phrase": "distributed_cassandra_nosql_database"}, {"score": 0.0021049977753042253, "phrase": "in-vivo_use"}], "paper_keywords": ["Performance Analysis", " Locks", " Multicore", " Java"], "paper_abstract": "Today, Java is regularly used to implement large multi-threaded server-class applications that use locks to protect access to shared data. However, understanding the impact of locks on the performance of a system is complex, and thus the use of locks can impede the progress of threads on configurations that were not anticipated by the developer, during specific phases of the execution. In this paper, we propose Free Lunch, a new lock profiler for Java application servers, specifically designed to identify, in-vivo, phases where the progress of the threads is impeded by a lock. Free Lunch is designed around a new metric, critical section pressure (CSP), which directly correlates the progress of the threads to each of the locks. Using Free Lunch, we have identified phases of high CSP, which were hidden with other lock profilers, in the distributed Cassandra NoSQL database and in several applications from the DaCapo 9.12, the SPECjvm-2008 and the SPECjbb2005 benchmark suites. Our evaluation of Free Lunch shows that its overhead is never greater than 6%, making it suitable for in-vivo use.", "paper_title": "Continuously Measuring Critical Section Pressure with the Free-Lunch Profiler", "paper_id": "WOS:000348907400017"}