{"auto_keywords": [{"score": 0.03818527090889823, "phrase": "captcha"}, {"score": 0.011293815901143745, "phrase": "noise_arcs"}, {"score": 0.01046205443806508, "phrase": "baidu_captcha"}, {"score": 0.00481495049065317, "phrase": "connecting_characters_together"}, {"score": 0.004574085781766281, "phrase": "standard_security_technology"}, {"score": 0.004322967486451877, "phrase": "text-based_schemes"}, {"score": 0.003982011128052839, "phrase": "\"connecting_characters"}, {"score": 0.0028659990472580154, "phrase": "early_attacks"}, {"score": 0.002793260314529583, "phrase": "early_works"}, {"score": 0.0025726416100664853, "phrase": "cct_captcha."}, {"score": 0.002468938912850425, "phrase": "recognized_characters"}, {"score": 0.0023816374781457667, "phrase": "yahoo"}], "paper_keywords": ["CAPTCHA", " Yahoo", " Baidu", " ReCAPTCHA", " human interactive proof", " segmentation attack", " recognition attack"], "paper_abstract": "CAPTCHA is now commonly used as standard security technology to tell computers and humans apart. The most widely deployed CAPTCHAs are text-based schemes. In this paper, we document how we have broken such a text-based scheme which uses the \"connecting characters together (CCT)\" principle. CAPTCHAs of this type can be classified into three types: CAPTCHA with overlap but no noise arcs; CAPTCHA with noise arcs but no overlap; and CAPTCHA without noise arcs and overlap. Yahoo!, Baidu CAPTCHA and reCAPTCHA were selected as representatives of the three types. The CCT CAPTCHA is effectively resistant to segmentation and recognition in the early attacks. In contrast to early works that recognized the text after segmentation, we combined recognition with segmentation to break the CCT CAPTCHA. Our method segments the text by extracting the recognized characters. The experiments show that our extraction and segmentation attack on Yahoo! CAPTCHA achieved a success rate of 78% and an overall (individual character recognition with OCR) success rate of 55%. The segmentation and recognition success rate of Baidu CAPTCHA was 34%. On reCAPTCHA we achieved 34% success rate.", "paper_title": "The Robustness of \"Connecting Characters Together\" CAPTCHAs", "paper_id": "WOS:000333657300005"}