{"auto_keywords": [{"score": 0.03981719821100098, "phrase": "soundness_problem"}, {"score": 0.009470270718146333, "phrase": "workflow_systems"}, {"score": 0.008576650919964419, "phrase": "aalst_et_al"}, {"score": 0.004767261858417823, "phrase": "classical_workflow_nets"}, {"score": 0.004720062003355273, "phrase": "wf"}, {"score": 0.0045357787854931894, "phrase": "important_subclass"}, {"score": 0.004490842671590769, "phrase": "petri_nets"}, {"score": 0.004188459638572375, "phrase": "crucial_property"}, {"score": 0.0035891316580885665, "phrase": "free-choice_wf-nets"}, {"score": 0.0028967287526155253, "phrase": "pspace"}, {"score": 0.0028394925080958205, "phrase": "bounded_wf-nets"}, {"score": 0.0027834145465170292, "phrase": "inwf"}, {"score": 0.0025956985623208167, "phrase": "wf-nets"}, {"score": 0.0022799458141165587, "phrase": "asymmetric-choice_wf-nets"}, {"score": 0.0021049977753042253, "phrase": "free-choice_ones"}], "paper_keywords": ["Workflow Nets", " Soundness", " Complexity", " PSPACE-hardness", " co-NP-hardness"], "paper_abstract": "Classical workflow nets (WF-nets for short) are an important subclass of Petri nets that are widely used to model and analyze workflow systems. Soundness is a crucial property of workflow systems and guarantees that these systems are deadlock-free and bounded. Aalst et al. proved that the soundness problem is decidable for WF-nets and can be polynomially solvable for free-choice WF-nets. This paper proves that the soundness problem is PSPACE-hard for WF-nets. Furthermore, it is proven that the soundness problemis PSPACE-complete for boundedWF-nets. Based on the above conclusion, it is derived that the soundness problem is also PSPACE-complete for bounded WF-nets with reset or inhibitor arcs (ReWF-nets and InWF-nets for short, resp.). ReWF- and InWF-nets are two extensions to WF-nets and their soundness problems were proven by Aalst et al. to be undecidable. Additionally, we prove that the soundness problem is co-NP-hard for asymmetric-choice WF-nets that are a larger class and can model more cases of interaction and resource allocation than free-choice ones.", "paper_title": "Complexity of the Soundness Problem of Workflow Nets", "paper_id": "WOS:000333421900005"}