{"auto_keywords": [{"score": 0.038221549515009653, "phrase": "process's_ontology"}, {"score": 0.030489443458718794, "phrase": "proposed_system"}, {"score": 0.00481495049065317, "phrase": "society-independent_agent_system"}, {"score": 0.004772818068176176, "phrase": "cloud_computing"}, {"score": 0.00440976345264104, "phrase": "today's_systems"}, {"score": 0.004257360656055417, "phrase": "society's_knowledge"}, {"score": 0.004201571673071299, "phrase": "process's_knowledge"}, {"score": 0.004128317208406523, "phrase": "societies'_knowledge"}, {"score": 0.00307431840409833, "phrase": "process_patterns"}, {"score": 0.002802825862847951, "phrase": "computing_platform"}, {"score": 0.0025892330566358503, "phrase": "coupling_measures"}, {"score": 0.0024451427672857458, "phrase": "particular_problem"}, {"score": 0.0023090525096074264, "phrase": "seven_processes"}, {"score": 0.0021330078238529443, "phrase": "best_process_patterns"}, {"score": 0.0021049977753042253, "phrase": "parallel_processes"}], "paper_keywords": [""], "paper_abstract": "IT systems are used to help organizations to manage and automate their processes. However, most of today's systems are not reusable because of mixing the society's knowledge with the process's knowledge. Since the societies' knowledge is different to each other, the applications are not reusable. Hence, this paper address the dependency of the applications on the societies by separately defining process's ontology, the agent's knowledge, the society's ontology, and the society's knowledge. This research introduces an ontology-based, process-oriented, and society-independent agent system which allows all the organizations to utilize it by defining and importing their societies' ontology and some process patterns, which can be instantiated from the process's ontology, into the system. The proposed system can be applied to cloud computing platform. The proposed system has been evaluated from two perspectives, the quality by using the cohesion and the coupling measures for measuring the degree to which the system focuses on solving a particular problem and the applicability by evaluating the manageability and the automatability of the seven processes from three different societies. We believe that our proposed system will improve when we apply some methods to find the best process patterns and perform parallel processes.", "paper_title": "Ontology-Based, Process-Oriented, and Society-Independent Agent System for Cloud Computing", "paper_id": "WOS:000333268600001"}