{"auto_keywords": [{"score": 0.049347793578485837, "phrase": "weakly_supervised_joint_topic_model"}, {"score": 0.00481495049065317, "phrase": "rare_and_subtle_behaviors"}, {"score": 0.004574085781766281, "phrase": "automated_video_behavior_analysis"}, {"score": 0.004390060342250211, "phrase": "subtle_behaviors"}, {"score": 0.004278807087784626, "phrase": "practical_value"}, {"score": 0.004235095881928715, "phrase": "dangerous_or_illegal_activities"}, {"score": 0.004127753467337283, "phrase": "possibly_only_one_prior_example"}, {"score": 0.0037057255600764475, "phrase": "contemporary_modeling_approaches"}, {"score": 0.0028659990472580154, "phrase": "multiclass_topic_model"}, {"score": 0.002836679611901583, "phrase": "partially_shared_latent_structure"}, {"score": 0.0027646829399573434, "phrase": "inference_algorithms"}, {"score": 0.0022856052476424344, "phrase": "real_time"}, {"score": 0.0021049977753042253, "phrase": "contemporary_alternatives"}], "paper_keywords": ["Probabilistic model", " behavior analysis", " imbalanced learning", " weakly supervised learning", " classification", " visual surveillance", " topic model", " Gibbs sampling"], "paper_abstract": "One of the most interesting and desired capabilities for automated video behavior analysis is the identification of rarely occurring and subtle behaviors. This is of practical value because dangerous or illegal activities often have few or possibly only one prior example to learn from and are often subtle. Rare and subtle behavior learning is challenging for two reasons: 1) Contemporary modeling approaches require more data and supervision than may be available and 2) the most interesting and potentially critical rare behaviors are often visually subtle-occurring among more obvious typical behaviors or being defined by only small spatio-temporal deviations from typical behaviors. In this paper, we introduce a novel weakly supervised joint topic model which addresses these issues. Specifically, we introduce a multiclass topic model with partially shared latent structure and associated learning and inference algorithms. These contributions will permit modeling of behaviors from as few as one example, even without localization by the user and when occurring in clutter, and subsequent classification and localization of such behaviors online and in real time. We extensively validate our approach on two standard public-space data sets, where it clearly outperforms a batch of contemporary alternatives.", "paper_title": "Identifying Rare and Subtle Behaviors: A Weakly Supervised Joint Topic Model", "paper_id": "WOS:000295980000011"}