{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "latent_semantic_indexing"}, {"score": 0.004536029676655286, "phrase": "semantic_structure"}, {"score": 0.004494570360108983, "phrase": "document_collections"}, {"score": 0.004352411290383643, "phrase": "content-based_text_retrieval"}, {"score": 0.004157094099706243, "phrase": "lsi"}, {"score": 0.0039522429946090174, "phrase": "singular_value_decomposition"}, {"score": 0.0035395987202335223, "phrase": "lsi_method"}, {"score": 0.0032287289440915187, "phrase": "detailed_analysis"}, {"score": 0.002786964045867666, "phrase": "underlying_principle"}, {"score": 0.002673957615079041, "phrase": "linear_algebra_point"}, {"score": 0.0026011706232569316, "phrase": "existing_commonly_used_techniques"}, {"score": 0.0025420267431501367, "phrase": "theoretical_analysis"}, {"score": 0.0024842242921857705, "phrase": "novel_algorithm"}, {"score": 0.002124461969404541, "phrase": "consistent_performance"}, {"score": 0.0021049977753042253, "phrase": "different_document_collections"}], "paper_keywords": [""], "paper_abstract": "Latent Semantic Indexing(LSI) has been proved to be effective to capture the semantic structure of document collections. It is widely used in content-based text retrieval. However, in many real-world applications dealing with very large document collections, LSI suffers from its high computational complexity, which comes from the process of Singular Value Decomposition (SVD). As a result, in practice, the folding in method is widely used as an approximation to the LSI method. However, in practice, the folding-in method is generally implemented \"as is\" and detailed analysis on its effectiveness and performance is left out. Consequentially, the performance of the folding-in method cannot be guaranteed. In this paper, we firstly illustrated the underlying principle of the folding-in method from a linear algebra point of view and analyzed some existing commonly used techniques. Based on the theoretical analysis, we proposed a novel algorithm to guide the implementation of the folding-in method. Our method was justified and evaluated by a series of experiments on various classical IR data sets. The results indicated that our method was effective and had consistent performance over different document collections.", "paper_title": "Understanding and enhancing the folding-in method in Latent Semantic Indexing", "paper_id": "WOS:000241155300011"}