{"auto_keywords": [{"score": 0.03491695658737417, "phrase": "relative_error"}, {"score": 0.020064351992298283, "phrase": "systematic_error"}, {"score": 0.01860100189128672, "phrase": "random_error"}, {"score": 0.010337262272056969, "phrase": "xmt"}, {"score": 0.009261221042026587, "phrase": "measured_volume"}, {"score": 0.00481495049065317, "phrase": "systematic_and_random_errors"}, {"score": 0.004791878972726824, "phrase": "x-ray_micro-tomography_based_volume_measurements"}, {"score": 0.004611224230543916, "phrase": "quantitative_analysis"}, {"score": 0.004089239912167375, "phrase": "actual_and_measured_volume"}, {"score": 0.004040394370661677, "phrase": "different_measurements"}, {"score": 0.0039729853486821995, "phrase": "appropriate_calibration"}, {"score": 0.0038693130775509857, "phrase": "inappropriate_threshold_value"}, {"score": 0.0037864980290391354, "phrase": "systematic_offset"}, {"score": 0.003617419955789572, "phrase": "specific_object"}, {"score": 0.0035827946344090976, "phrase": "voxel_grid"}, {"score": 0.0035229930971258316, "phrase": "repeated_measurements"}, {"score": 0.003422781254306241, "phrase": "strong_function"}, {"score": 0.0033334181243930587, "phrase": "voxel_size"}, {"score": 0.003246380517062771, "phrase": "approximately_a_power_law_relationship"}, {"score": 0.0030276240911865744, "phrase": "small_objects"}, {"score": 0.0029203055813347874, "phrase": "surface_area"}, {"score": 0.002885382384273691, "phrase": "larger_objects"}, {"score": 0.00285774390383697, "phrase": "example_application"}, {"score": 0.0028235667474151714, "phrase": "mineral_grains"}, {"score": 0.0028032564111231885, "phrase": "ore_sample"}, {"score": 0.0024556852466581527, "phrase": "multiple_similar_objects"}, {"score": 0.0022790861974433005, "phrase": "multiple_measurements"}, {"score": 0.0022302306304023602, "phrase": "volume_standards"}, {"score": 0.0021876814398268775, "phrase": "smaller_objects"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Micro-CT", " Grain tracking", " Uncertainty", " Error propagation"], "paper_abstract": "X-ray micro-tomography (XMT) is increasingly used for the quantitative analysis of the volumes of features within the 3D images. As with any measurement, there will be error and uncertainty associated with these measurements. In this paper a method for quantifying both the systematic and random components of this error in the measured volume is presented. The systematic error is the offset between the actual and measured volume which is consistent between different measurements and can therefore be eliminated by appropriate calibration. In XMT measurements this is often caused by an inappropriate threshold value. The random error is not associated with any systematic offset in the measured volume and could be caused, for instance, by variations in the location of the specific object relative to the voxel grid. It can be eliminated by repeated measurements. It was found that both the systematic and random components of the error are a strong function of the size of the object measured relative to the voxel size. The relative error in the volume was found to follow approximately a power law relationship with the volume of the object, but with an exponent that implied, unexpectedly, that the relative error was proportional to the radius of the object for small objects, though the exponent did imply that the relative error was approximately proportional to the surface area of the object for larger objects. In an example application involving the size of mineral grains in an ore sample, the uncertainty associated with the random error in the volume is larger than the object itself for objects smaller than about 8 voxels and is greater than 10% for any object smaller than about 260 voxels. A methodology is presented for reducing the random error by combining the results from either multiple scans of the same object or scans of multiple similar objects, with an uncertainty of less than 5% requiring 12 objects of 100 voxels or 600 objects of 4 voxels. As the systematic error in a measurement cannot be eliminated by combining the results from multiple measurements, this paper introduces a procedure for using volume standards to reduce the systematic error, especially for smaller objects where the relative error is larger. (C) 2015 The Authors. Published by Elsevier Ltd.", "paper_title": "Quantifying and minimising systematic and random errors in X-ray micro-tomography based volume measurements", "paper_id": "WOS:000352745000001"}