{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "continuous_integration"}, {"score": 0.004739056045644449, "phrase": "agile_specification"}, {"score": 0.004615202066192795, "phrase": "main_ideas"}, {"score": 0.004566567411073082, "phrase": "agile_development"}, {"score": 0.003813669883040509, "phrase": "programming_source_code"}, {"score": 0.0036942726653704213, "phrase": "formal_specification_environments"}, {"score": 0.0029409171055888804, "phrase": "manual_changes"}, {"score": 0.002879158342988017, "phrase": "desired_functionality"}, {"score": 0.002508073621696602, "phrase": "whole_process"}, {"score": 0.002468450551616404, "phrase": "integration_analyses"}, {"score": 0.002378408229095287, "phrase": "diagnosed_problems"}, {"score": 0.002279508335630797, "phrase": "agile_specification_environment"}, {"score": 0.002231607958228148, "phrase": "previous_paper"}, {"score": 0.0021049977753042253, "phrase": "creative_efforts"}], "paper_keywords": ["Formal specification", " agile software development", " continuous integration"], "paper_abstract": "One of the main ideas of agile development is to perform continuous integration, in order to detect and resolve conflicts among several modular units of a system as soon as possible. Whereas this feature is well catered for at the level of programming source code, the support available in formal specification environments is still rather unsatisfactory: it is possible to analyze the composition of several modular units automatically, but no assistance is given to help modify them in case of problems. Instead, the stakeholders who build the specifications are forced to attempt manual changes until reaching the desired functionality, in a process that is far from being intuitive. In response to that, this paper presents procedures and algorithms that automate the whole process of doing integration analyses and generating revisions to solve the diagnosed problems. These mechanisms serve to complete an agile specification environment presented in a previous paper, which was designed around the principle of facilitating the creative efforts of the stakeholders.", "paper_title": "PROCEDURES AND ALGORITHMS FOR CONTINUOUS INTEGRATION IN AN AGILE SPECIFICATION ENVIRONMENT", "paper_id": "WOS:000266506900003"}