{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "hess'_generalized_ghs_attack"}, {"score": 0.04591771804491578, "phrase": "discrete_logarithm_problem"}, {"score": 0.04525702858275571, "phrase": "elliptic_curves"}, {"score": 0.04375046794702628, "phrase": "significantly_less_time"}, {"score": 0.042911185020077874, "phrase": "pollard's_rho_method"}, {"score": 0.04208729377636015, "phrase": "hardest_instances"}, {"score": 0.0045324756541157574, "phrase": "elliptic_curve_cryptography"}, {"score": 0.003916098498242888, "phrase": "ghs_weil_descent_attack"}, {"score": 0.003522579870903474, "phrase": "f-qn"}, {"score": 0.003452218803245602, "phrase": "hess'_generalization"}, {"score": 0.0034003686971964707, "phrase": "ghs_attack"}, {"score": 0.0029374939071038146, "phrase": "namely_those_curves"}], "paper_keywords": ["elliptic curve cryptography", " Weil descent", " isogenies"], "paper_abstract": "A finite field K is said to be weak for elliptic curve cryptography if all instances of the discrete logarithm problem for all elliptic curves over K can be solved in significantly less time than it takes Pollard's rho method to solve the hardest instances. By considering the GHS Weil descent attack, it was previously shown that characteristic two finite fields F-q5 are weak. In this paper, we examine characteristic two finite fields F-qn for weakness under Hess' generalization of the GHS attack. We show that the fields F-q7 are potentially partially weak in the sense that any instance of the discrete logarithm problem for half of all elliptic curves over F-q7, namely those curves E for which # E(F-q7) is divisible by 4, can likely be solved in significantly less time than it takes Pollard's rho method to solve the hardest instances. We also show that the fields F-q3 are partially weak, that the fields F-q6 are potentially weak, and that the fields F-q8 are potentially partially weak. Finally, we argue that the other fields F-2N where N is not divisible by 3, 5, 6, 7 or 8, are not weak under Hess' generalized GHS attack.", "paper_title": "Cryptographic implications of Hess' generalized GHS attack", "paper_id": "WOS:000234948600005"}