{"auto_keywords": [{"score": 0.04519174354308181, "phrase": "environmental_conditions"}, {"score": 0.00481495049065317, "phrase": "intelligent_laboratory_environment"}, {"score": 0.004738078275822989, "phrase": "cyber-physical_system"}, {"score": 0.0038846843242954935, "phrase": "people's_performance"}, {"score": 0.003167441161387607, "phrase": "cps_development_framework"}, {"score": 0.0031167895790050405, "phrase": "proposed_cps"}, {"score": 0.002969628818856786, "phrase": "thermal_comfort"}, {"score": 0.0027543636132088332, "phrase": "low-volume_communication"}, {"score": 0.00266693888510356, "phrase": "habit-based_adaptive_control"}, {"score": 0.002568435291444709, "phrase": "on-site_deployment"}, {"score": 0.0024868972942701582, "phrase": "proposed_cps."}, {"score": 0.002233301265743633, "phrase": "human_performance"}, {"score": 0.0021049977753042253, "phrase": "smart_cities"}], "paper_keywords": [""], "paper_abstract": "Activities in laboratories, workshops, and offices can be significantly affected by their ambiance and environmental conditions, such as lighting, humidity, and temperature. This research focuses on laboratories and aims to improve people's performance of activities inside them. To this end, we have developed a cyber-physical system(CPS) for a smart/intelligent laboratory environment which is able to dynamically and automatically interpret and regulate environmental conditions. In this paper, we present the CPS development framework. The proposed CPS can measure, analyze, and regulate the thermal comfort. In order to prolong the lifetime of the system, mechanisms for low-volume communication, distributed computation, and habit-based adaptive control are proposed. Evaluations of an on-site deployment verify the functionality of the proposed CPS. Although our focus is on laboratories, this research can be applied to other similar environments, which are intended to support human performance and productivity, and has implications for the creation of smart cities.", "paper_title": "Building an Intelligent Laboratory Environment via a Cyber-Physical System", "paper_id": "WOS:000329703900001"}