{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "graphics_processing_units"}, {"score": 0.04734378834338076, "phrase": "biochemical_systems"}, {"score": 0.004424953471635011, "phrase": "simulation_algorithms"}, {"score": 0.004021835438784141, "phrase": "single_molecules"}, {"score": 0.0039341294012600085, "phrase": "consideration_localized_fluctuations"}, {"score": 0.0039053194919285725, "phrase": "transportation_phenomena"}, {"score": 0.003820144626025562, "phrase": "common_drawback"}, {"score": 0.0037921662574137535, "phrase": "spatial_models"}, {"score": 0.003459191419478298, "phrase": "systems_behavior"}, {"score": 0.0034212450542713607, "phrase": "reliable_way"}, {"score": 0.0033961782274326948, "phrase": "stochastic_methods"}, {"score": 0.003334309053314909, "phrase": "high_spatial_resolution"}, {"score": 0.003213920601037463, "phrase": "systems_biology"}, {"score": 0.002878140062594849, "phrase": "parallel_simulation_algorithms"}, {"score": 0.0027946649584841754, "phrase": "smoldyn"}, {"score": 0.002723607240517261, "phrase": "stochastic_simulation"}, {"score": 0.0027036380093304747, "phrase": "chemical_reactions"}, {"score": 0.0026838147966444783, "phrase": "spatial_resolution"}, {"score": 0.0026641365405034355, "phrase": "single_molecule_detail"}, {"score": 0.002265833357217618, "phrase": "molecule-surface_interaction"}, {"score": 0.0022328843021632884, "phrase": "gpu"}], "paper_keywords": ["Parallel", " reaction-diffusion", " particles", " Brownian Dynamics", " GPU"], "paper_abstract": "Space is a very important aspect in the simulation of biochemical systems; recently, the need for simulation algorithms able to cope with space is becoming more and more compelling. Complex and detailed models of biochemical systems need to deal with the movement of single molecules and particles, taking into consideration localized fluctuations, transportation phenomena, and diffusion. A common drawback of spatial models lies in their complexity: models can become very large, and their simulation could be time consuming, especially if we want to capture the systems behavior in a reliable way using stochastic methods in conjunction with a high spatial resolution. In order to deliver the promise done by systems biology to be able to understand a system as whole, we need to scale up the size of models we are able to simulate, moving from sequential to parallel simulation algorithms. In this paper, we analyze Smoldyn, a widely diffused algorithm for stochastic simulation of chemical reactions with spatial resolution and single molecule detail, and we propose an alternative, innovative implementation that exploits the parallelism of Graphics Processing Units (GPUs). The implementation executes the most computational demanding steps (computation of diffusion, unimolecular, and bimolecular reaction, as well as the most common cases of molecule-surface interaction) on the GPU, computing them in parallel on each molecule of the system. The implementation offers good speed-ups and real time, high quality graphics output.", "paper_title": "Smoldyn on Graphics Processing Units: Massively Parallel Brownian Dynamics Simulations", "paper_id": "WOS:000301293900003"}