{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "resource_buying_games"}, {"score": 0.004603115982404017, "phrase": "finite_resource"}, {"score": 0.0037091363772959298, "phrase": "cost_functions"}, {"score": 0.0037055370870874484, "phrase": "predefined_family"}, {"score": 0.0034847851398628546, "phrase": "congestion_games"}, {"score": 0.003428164458163043, "phrase": "load-dependent_costs"}, {"score": 0.0030818310926031024, "phrase": "desired_configurations"}, {"score": 0.0030317376771013703, "phrase": "payment_vector"}, {"score": 0.0028744731986533076, "phrase": "chosen_resources"}, {"score": 0.0027477745788313163, "phrase": "computational_complexity"}, {"score": 0.0027253441561528495, "phrase": "pure_nash_equilibria"}, {"score": 0.0027031441241035393, "phrase": "pne"}, {"score": 0.002583931950389087, "phrase": "classical_congestion_games"}, {"score": 0.0023903140267755576, "phrase": "underlying_structure"}, {"score": 0.0021751997984619585, "phrase": "exactly_the_right_structure"}, {"score": 0.0021049977753042253, "phrase": "marginally_non-decreasing_cost_functions"}], "paper_keywords": ["Connection games", " Matroids", " Marginally non-increasing"], "paper_abstract": "In resource buying games a set of players jointly buys a subset of a finite resource set (e.g., machines, edges, or nodes in a digraph). The cost of a resource depends on the number (or load) of players using , and has to be paid completely by the players before it becomes available. Each player needs at least one set of a predefined family to be available. Thus, resource buying games can be seen as a variant of congestion games in which the load-dependent costs of the resources can be shared arbitrarily among the players. A strategy of player in resource buying games is a tuple consisting of one of 's desired configurations together with a payment vector indicating how much is willing to contribute towards the purchase of the chosen resources. In this paper, we study the existence and computational complexity of pure Nash equilibria (PNE, for short) of resource buying games. In contrast to classical congestion games for which equilibria are guaranteed to exist, the existence of equilibria in resource buying games strongly depends on the underlying structure of the families and the behavior of the cost functions. We show that for marginally non-increasing cost functions, matroids are exactly the right structure to consider, and that resource buying games with marginally non-decreasing cost functions always admit a PNE.", "paper_title": "Resource Buying Games", "paper_id": "WOS:000340552300006"}