{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "hierarchical_student_models"}, {"score": 0.0046164478775379105, "phrase": "student_modeling"}, {"score": 0.004402854153653114, "phrase": "probability_distributions"}, {"score": 0.004199101289890982, "phrase": "diagnosis_procedure"}, {"score": 0.004133292222875435, "phrase": "adaptive_testing"}, {"score": 0.00398370478688858, "phrase": "adaptive_tests"}, {"score": 0.003941964605885606, "phrase": "well-founded_and_accurate_diagnosis_thanks"}, {"score": 0.0036424917384748024, "phrase": "dichotomous_models"}, {"score": 0.0032437952431945724, "phrase": "polytomous_model"}, {"score": 0.0030935140058168885, "phrase": "partial_credits"}, {"score": 0.002740253546178098, "phrase": "characteristic_curves"}, {"score": 0.0023146962503449186, "phrase": "preexisting_procedures"}, {"score": 0.002266364679369248, "phrase": "data_requirements"}, {"score": 0.0021049977753042253, "phrase": "controlled_evaluations"}], "paper_keywords": ["ITS", " student diagnosis", " adaptive testing", " item response theory", " statistical kernel smoothing"], "paper_abstract": "This paper presents an approach to student modeling in which knowledge is represented by means of probability distributions associated to a tree of concepts. A diagnosis procedure which uses adaptive testing is part of this approach. Adaptive tests provide well-founded and accurate diagnosis thanks to the underlying probabilistic theory, i.e., the Item Response Theory. Most adaptive testing proposals are based on dichotomous models, where he student answer can only be considered either correct or incorrect. In the work described here, a polytomous model has been used, i.e., answers can be given partial credits. Thus, models are more informative and diagnosis is more efficient. This paper also presents an algorithm for estimating question characteristic curves, which are necessary in order to apply the Item Response Theory to a given domain and hence must be inferred before testing begins. Most prior estimation procedures need huge sets of data. We have modified preexisting procedures in such a way that data requirements are significantly reduced. Finally, this paper presents the results of some controlled evaluations that have been carried out in order to analyze the feasibility and advantages of this approach.", "paper_title": "Adaptive testing for hierarchical student models", "paper_id": "WOS:000244487600006"}