{"auto_keywords": [{"score": 0.0429841867448742, "phrase": "tolerance_analysis"}, {"score": 0.00481495049065317, "phrase": "fundamental_issue"}, {"score": 0.004768649568826951, "phrase": "automatic_geometric_tolerance_analysis"}, {"score": 0.004700027722284931, "phrase": "representation_model"}, {"score": 0.004521803560561489, "phrase": "cad_models"}, {"score": 0.003911367220315185, "phrase": "tolerance_analysis_method"}, {"score": 0.0038737214010638745, "phrase": "common_tolerance_analysis_methods"}, {"score": 0.0034325187732054093, "phrase": "super_constraint-tolerance-feature-graph"}, {"score": 0.003399466007862412, "phrase": "sctf-graph"}, {"score": 0.0032546105164772995, "phrase": "sctf-graph_model"}, {"score": 0.0023079225317714815, "phrase": "cad_model"}, {"score": 0.002241817217376025, "phrase": "b-rep"}, {"score": 0.0021049977753042253, "phrase": "case_studies"}], "paper_keywords": ["GD&T", " tolerance modeling", " data modeling"], "paper_abstract": "The fundamental issue for automatic geometric tolerance analysis is the representation model, which should, in conjunction with CAD models, accurately and completely represent the GD&T specification according to the GD&T standards. Furthermore, such a representation model should facilitate GD&T validation and tolerance analysis. Most GD&T representation models proposed so far are specific to the tolerance analysis method. Common tolerance analysis methods are min/max chart, Monte Carlo simulation and multivariate regions. This paper will propose a semantic GD&T model, which can be used for any of these methods. The model is a super constraint-tolerance-feature-graph (SCTF-Graph). This paper will demonstrate how the SCTF-Graph model can represent all the tolerance types in the standards, and can contain all the information that is needed for tolerance analysis: nominal geometry (i.e. trimmed features in this research), constraints, tolerances, degrees of freedom (DoFs) to be controlled, assembly hierarchy, and their respective inter-relationships. This paper will discuss the content of the model, how it can be automatically created from the CAD model containing GD&T information (e.g. attributed B-Rep model), and the implementation of such a model, along with some case studies.", "paper_title": "Analysis neutral data structure for GD&T", "paper_id": "WOS:000257237700008"}