{"auto_keywords": [{"score": 0.02861660037004141, "phrase": "performance_improvement"}, {"score": 0.00481495049065317, "phrase": "human_identification"}, {"score": 0.004774115617883476, "phrase": "fingerprint_impressions"}, {"score": 0.0045556080393342165, "phrase": "new_advancements"}, {"score": 0.004459605573798577, "phrase": "widely_accepted_representation"}, {"score": 0.0043842558719324526, "phrase": "matching_methodology"}, {"score": 0.003776750773624222, "phrase": "effective_matching_strategy"}, {"score": 0.003394891095032025, "phrase": "high_cost"}, {"score": 0.0032531496610470377, "phrase": "structured_lighting_system"}, {"score": 0.0032255172568437965, "phrase": "multiple_cameras"}, {"score": 0.0024028742248152425, "phrase": "inherent_discriminable_information"}, {"score": 0.00235213013487844, "phrase": "experimental_results"}, {"score": 0.002123051344001408, "phrase": "discriminant_power"}], "paper_keywords": ["Biometrics", " contactless fingerprint identification", " 3d fingerprint matching", " 3d minutiae", " photometric stereo", " 3d fingerprint individuality"], "paper_abstract": "Human identification using fingerprint impressions has been widely studied and employed for more than 2000 years. Despite new advancements in the 3D imaging technologies, widely accepted representation of 3D fingerprint features and matching methodology is yet to emerge. This paper investigates 3D representation of widely employed 2D minutiae features by recovering and incorporating (i) minutiae height z and (ii) its 3D orientation phi information and illustrates an effective matching strategy for matching popular minutiae features extended in 3D space. One of the obstacles of the emerging 3D fingerprint identification systems to replace the conventional 2D fingerprint system lies in their bulk and high cost, which is mainly contributed from the usage of structured lighting system or multiple cameras. This paper attempts to addresses such key limitations of the current 3D fingerprint technologies by developing the single camera-based 3D fingerprint identification system. We develop a generalized 3D minutiae matching model and recover extended 3D fingerprint features from the reconstructed 3D fingerprints. 2D fingerprint images acquired for the 3D fingerprint reconstruction can themselves be employed for the performance improvement and have been illustrated in the work detailed in this paper. This paper also attempts to answer one of the most fundamental questions on the availability of inherent discriminable information from 3D fingerprints. The experimental results are presented on a database of 240 clients 3D fingerprints, which is made publicly available to further research efforts in this area, and illustrate the discriminant power of 3D minutiae representation and matching to achieve performance improvement.", "paper_title": "Towards Contactless, Low-Cost and Accurate 3D Fingerprint Identification", "paper_id": "WOS:000349626200015"}