{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "cross-language_communication"}, {"score": 0.04774633807425784, "phrase": "mobile_devices"}, {"score": 0.030609684579729686, "phrase": "user_interface"}, {"score": 0.0033384259516301223, "phrase": "automatic_translations"}, {"score": 0.00321114539085481, "phrase": "communication_process"}, {"score": 0.003088702479841264, "phrase": "users'_confidence"}, {"score": 0.003004103583782076, "phrase": "language_barriers"}, {"score": 0.002763919794139171, "phrase": "primary_mode"}, {"score": 0.00262910358108176, "phrase": "detailed_meaning"}, {"score": 0.002542890176213921, "phrase": "visual_process"}, {"score": 0.0022502133699402018, "phrase": "apple_ipad_tablet"}, {"score": 0.0021049977753042253, "phrase": "translation_aid"}], "paper_keywords": [""], "paper_abstract": "In this article, we-investigate the possibility of cross-language communication using a synergy of words and pictures on mobile devices. On the one hand, communicating with only pictures is in itself a very powerful strategy, but is limited in expressiveness. On the other hand, words can express everything you could wish to say, but they are cumbersome to work with on mobile devices and need to be translated in order for their meaning to be understood. Automatic translations can contain errors that pervert the communication process, and this may undermine the users' confidence when expressing themselves across language barriers. Our idea is to create a user interface for cross-language communication that uses pictures as the primary mode of input, and words to express the detailed meaning. This interface creates a visual process of communication that occurs on two heterogeneous channels that can support each other. We implemented this user interface as an application on the Apple iPad tablet and performed a set of experiments to determine its usefulness as a translation aid for travellers.", "paper_title": "Speaking Louder than Words with Pictures Across Languages", "paper_id": "WOS:000336891800004"}