{"auto_keywords": [{"score": 0.03351070397865124, "phrase": "low_quality_version"}, {"score": 0.015719716506582538, "phrase": "information_goods"}, {"score": 0.00902830411479923, "phrase": "upgrade_strategy"}, {"score": 0.0045748683993128425, "phrase": "\"search_goods"}, {"score": 0.004329630571352367, "phrase": "\"experience_goods"}, {"score": 0.00409748471133883, "phrase": "\"version-to-upgrade\"_strategy"}, {"score": 0.0035981701736904495, "phrase": "lower_quality_versions"}, {"score": 0.003541923233726252, "phrase": "two-stage_model"}, {"score": 0.003432044343307207, "phrase": "homogeneous_expectations"}, {"score": 0.0033255627814855163, "phrase": "version-to-upgrade_strategy"}, {"score": 0.00320970209394799, "phrase": "first_stage"}, {"score": 0.002943147037670826, "phrase": "heterogeneous_expectations"}, {"score": 0.0023415390666563177, "phrase": "upgrades_increase"}, {"score": 0.0022333012657436307, "phrase": "lowest_quality"}, {"score": 0.002181069180139225, "phrase": "true_quality"}, {"score": 0.002130056082139311, "phrase": "trial_or_demonstration_versions"}], "paper_keywords": ["Information goods", " Experience goods", " Versioning strategies", " Pricing strategies"], "paper_abstract": "In contrast to \"search goods\" whose true quality can be determined before inspection, we examine information goods that are \"experience goods\" goods whose true quality can only be determined through use. We analyze a \"version-to-upgrade\" strategy where a monopolist generates vertically differentiated versions as bridges that lead consumers to experience the goods so that they can assess their true quality, and then provide upgrades to consumers that initially purchase lower quality versions. Adopting a two-stage model, we find that if consumers have homogeneous expectations about quality before experience, then the version-to-upgrade strategy involves upgrading all the consumers that in the first stage purchased the low quality version. In this way, consumers that upgrade effectively pay a tax for learning. When consumers have heterogeneous expectations about quality before experience, if consumers are pessimistic, then the version-to-upgrade strategy still drives all consumers to upgrade. However, if consumers are optimistic, then, the version-to-upgrade strategy may induce only some of the consumers that initially purchased the low quality version to upgrade. As profits from upgrades increase, the monopolist sets the quality of the low quality version to the lowest quality that can feasibly reveal the true quality, justifying the use of trial or demonstration versions. (C) 2012 Elsevier B.V. All rights reserved.", "paper_title": "Experience information goods: \"Version-to-upgrade\"", "paper_id": "WOS:000329005000049"}