{"auto_keywords": [{"score": 0.041448511334832745, "phrase": "in-network_computation"}, {"score": 0.0298504557920069, "phrase": "discrete-time_model"}, {"score": 0.02868204014499694, "phrase": "flow_model"}, {"score": 0.011965321767357219, "phrase": "maximum_achievable_throughput"}, {"score": 0.00851205565653661, "phrase": "upper_bound"}, {"score": 0.00481495049065317, "phrase": "wireless_sensor_network"}, {"score": 0.00470862827326028, "phrase": "statistical_functions"}, {"score": 0.004258372598568333, "phrase": "intermediate_nodes"}, {"score": 0.003865376734263166, "phrase": "asymptotic_results"}, {"score": 0.00383668723824441, "phrase": "large_networks"}, {"score": 0.003779943062894615, "phrase": "current_practice"}, {"score": 0.003508521802236789, "phrase": "first_statistical_moments"}, {"score": 0.0034695189961509625, "phrase": "collected_data"}, {"score": 0.003405472159599445, "phrase": "kth_statistical_moment"}, {"score": 0.0033054391731615618, "phrase": "kth_power"}, {"score": 0.0032444113660668743, "phrase": "flow_models"}, {"score": 0.0031726587374218277, "phrase": "multihop_wireless_networks"}, {"score": 0.0030225753906647935, "phrase": "relatively_large_networks"}, {"score": 0.0028903278985330117, "phrase": "network_computation"}, {"score": 0.002784540221128404, "phrase": "real-time_network_operation"}, {"score": 0.0021687806803474367, "phrase": "excellent_approximation"}], "paper_keywords": ["Flow model", " in-network computation", " sensor networks", " throughput"], "paper_abstract": "Many applications require the sink to compute a function of the data collected by the sensors. Instead of sending all the data to the sink, the intermediate nodes could process the data they receive to significantly reduce the volume of traffic transmitted: this is known as in-network computation. Instead of focusing on asymptotic results for large networks as is the current practice, we are interested in explicitly computing the maximum achievable throughput of a given network when the sink is interested in the first statistical moments of the collected data. Here, the kth statistical moment is defined as the expectation of the kth power of the data. Flow models have been routinely used in multihop wireless networks when there is no in-network computation, and they are typically tractable for relatively large networks. However, deriving such models is not obvious when in-network computation is allowed. We develop a discrete-time model for the real-time network operation and perform two transformations to obtain a flow model that keeps the essence of in-network computation. This gives an upper bound on the maximum achievable throughput. To show its tightness, we derive a numerical lower bound by computing a solution to the discrete-time model based on the solution to the flow model. This lower bound turns out to be close to the upper bound, proving that the flow model is an excellent approximation to the discrete-time model. We then provide several engineering insights on these networks.", "paper_title": "Maximum Achievable Throughput in a Wireless Sensor Network Using In-Network Computation for Statistical Functions", "paper_id": "WOS:000329994300018"}