{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "fault_probability"}, {"score": 0.04869658238235114, "phrase": "optical_network"}, {"score": 0.01553856314144138, "phrase": "distributed_computing_applications"}, {"score": 0.007037336488302867, "phrase": "mfp_algorithm"}, {"score": 0.004567596860086148, "phrase": "integrated_computing_environment"}, {"score": 0.00438399094249306, "phrase": "promising_technology"}, {"score": 0.004307569753106432, "phrase": "large-scale_data-intensive_distributed_computing_applications"}, {"score": 0.0040385352882334235, "phrase": "high-performance_processors"}, {"score": 0.003487721546598799, "phrase": "applications'_finish_times"}, {"score": 0.0033083236588614174, "phrase": "resources'_fault_probability"}, {"score": 0.0030653094605910727, "phrase": "appropriate_resources"}, {"score": 0.0028234703730349916, "phrase": "task-scheduling_problem"}, {"score": 0.0027579362569638945, "phrase": "fault_probability_analysis"}, {"score": 0.0025106241866273897, "phrase": "optical_links"}, {"score": 0.0021049977753042253, "phrase": "simulation_results"}], "paper_keywords": [""], "paper_abstract": "The optical network integrated computing environment has been thought of as a promising technology to support large-scale data-intensive distributed computing applications. For such an environment involving so many heterogeneous resources, such as high-performance processors and optical links, faults seem to be inevitable. The faults will lead to the failure of the applications or highly delay the applications' finish times. Therefore, it is necessary to analyze resources' fault probability and then to better schedule the tasks of the application onto the appropriate resources so as to minimize the fault probability of the application. We address the task-scheduling problem based on the fault probability analysis for distributed computing applications over an optical network. We quantitatively analyze the fault probability of the processors and optical links in a given interval and propose a minimal fault probability (MFP) task-scheduling algorithm to minimize the fault probability of the application. We develop a simulator to evaluate the performance of the MFP algorithm. The simulation results prove the efficiency of the MFP algorithm. (C) 2008 Optical Society of America", "paper_title": "Task scheduling considering fault probability for distributed computing applications over an optical network", "paper_id": "WOS:000260862800005"}