{"auto_keywords": [{"score": 0.03371359419978347, "phrase": "maximum_degree"}, {"score": 0.00481495049065317, "phrase": "preserve_treewidth"}, {"score": 0.004537525607322823, "phrase": "polynomial-time_upper_bounds"}, {"score": 0.004414907432703781, "phrase": "small_treewidth"}, {"score": 0.004256533389293113, "phrase": "maximal_degree"}, {"score": 0.004160435626849478, "phrase": "theoretical_arguments"}, {"score": 0.004103817210338686, "phrase": "practical_concerns"}, {"score": 0.0037454814403672697, "phrase": "original_graph"}, {"score": 0.0028082176224611542, "phrase": "expansion_g"}, {"score": 0.0021049977753042253, "phrase": "g._we"}], "paper_keywords": ["Treewidth", " Graph expansion", " Constant degree", " Sub-cubic graph", " Algorithms"], "paper_abstract": "Many hard algorithmic problems dealing with graphs, circuits, formulas and constraints admit polynomial-time upper bounds if the underlying graph has small treewidth. The same problems often encourage reducing the maximal degree of vertices to simplify theoretical arguments or address practical concerns. Such degree reduction can be performed through a sequence of splittings of vertices, resulting in an expansion of the original graph. We observe that the treewidth of a graph may increase dramatically if the splittings are not performed carefully. In this context we address the following natural question: is it possible to reduce the maximum degree to a constant without substantially increasing the treewidth? We answer the above question affirmatively. We prove that any simple undirected graph G = (V, E) admits an expansion G ' = (V ', E ') with the maximum degree <= 3 and tw(G ') <= tw(G) + 1, where tw(.) is the treewidth of a graph. Furthermore, such an expansion will have no more than 2 vertical bar E vertical bar + vertical bar V vertical bar vertices and 3 vertical bar E vertical bar edges; it can be computed efficiently from a tree-decomposition of G. We also construct a family of examples for which the increase by 1 in treewidth cannot be avoided.", "paper_title": "Constant-Degree Graph Expansions that Preserve Treewidth", "paper_id": "WOS:000287319100001"}