{"auto_keywords": [{"score": 0.048451073513520106, "phrase": "sensor_networks"}, {"score": 0.006576212264160488, "phrase": "debr"}, {"score": 0.004893212373183456, "phrase": "sensor_network"}, {"score": 0.004815072276957652, "phrase": "distributed"}, {"score": 0.004723322467153553, "phrase": "wireless_sensor_networks"}, {"score": 0.004257708925521277, "phrase": "efficient_paths"}, {"score": 0.003808407814695708, "phrase": "random_locations"}, {"score": 0.003764713814123286, "phrase": "non-deterministic_generation_patterns"}, {"score": 0.0034194902384248006, "phrase": "non-functioning_sensors"}, {"score": 0.0033802431627410223, "phrase": "early_power_depiction"}, {"score": 0.003202944392720772, "phrase": "sensors'_remaining_energies"}, {"score": 0.0031418958350109038, "phrase": "energy_efficiency"}, {"score": 0.003011641380351577, "phrase": "distributed_energy"}, {"score": 0.003000070450638437, "phrase": "balanced_routing"}, {"score": 0.002897906501262407, "phrase": "data_traffic"}, {"score": 0.002842655426951218, "phrase": "decentralized_manner"}, {"score": 0.0025521085778978042, "phrase": "event_generation"}, {"score": 0.002474674704809152, "phrase": "proposed_algorithm"}, {"score": 0.002282380944889266, "phrase": "energy_balance"}, {"score": 0.002154226045704907, "phrase": "diverse_event_generation_patterns"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Wireless sensor network", " Distributed control", " Robustness", " Energy adaptive routing", " Energy balancing"], "paper_abstract": "Most routing algorithms for sensor networks focus on finding energy efficient paths to prolong the lifetime of sensor networks. As a result, the power of sensors on efficient paths depletes quickly, and consequently sensor networks become incapable of monitoring events from some parts of their target areas. In many sensor network applications, the events that must be tracked occur at random locations and have non-deterministic generation patterns. Therefore, ideally, routing algorithms should consider not only energy efficiency, but also the amount of energy remaining in each sensor. thus avoiding non-functioning sensors due to early power depiction. This paper introduces a new metric, energy cost, devised to consider a balance of sensors' remaining energies, as well as energy efficiency. This metric gives rise to the design of the distributed energy balanced routing (DEBR) algorithm devised to balance the data traffic of sensor networks in a decentralized manner and consequently prolong the lifetime of the networks. DEBR is scalable in the number of sensors and also robust to the variations in the dynamics of event generation. We demonstrate the effectiveness of the proposed algorithm by comparing three existing routing algorithms: direct Communication approach, minimum transmission energy, and self-organized routing and find that energy balance should be considered to extend lifetime of sensor network and increase robustness of sensor network for diverse event generation patterns. (c) 2009 Elsevier Ltd. All rights reserved.", "paper_title": "Distributed energy balanced routing for wireless sensor networks", "paper_id": "WOS:000267518000013"}