{"auto_keywords": [{"score": 0.04927465911141675, "phrase": "disclosure_risk"}, {"score": 0.03828152818695625, "phrase": "sdc_protection_method"}, {"score": 0.00481495049065317, "phrase": "large_statistical_databases"}, {"score": 0.0044237033788643715, "phrase": "privacy_level"}, {"score": 0.004204320052179726, "phrase": "particular_record_linkage_techniques"}, {"score": 0.003829877278269543, "phrase": "record_linkage_process"}, {"score": 0.0034445472801689046, "phrase": "kd-trees_techniques"}, {"score": 0.003400984514637656, "phrase": "exact_yet_very_efficient_record_linkage"}, {"score": 0.0031375577552605533, "phrase": "better_results"}, {"score": 0.003032820755030689, "phrase": "running_time"}, {"score": 0.002956562077120703, "phrase": "record_linkage"}, {"score": 0.0029067881142952664, "phrase": "sliding_window"}, {"score": 0.002704403349815203, "phrase": "whole_protected_record"}, {"score": 0.002421726275597666, "phrase": "k-neighbor_l-diversity"}, {"score": 0.0024012441367538455, "phrase": "k-neighbor_p-sensitivity"}, {"score": 0.002215081186105616, "phrase": "sdc_protection_methods"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Statistical Disclosure Control", " Real disclosure risk", " Kd-trees", " Attribute disclosure", " Record linkage"], "paper_abstract": "Estimating the disclosure risk of a Statistical Disclosure Control (SDC) protection method by means of (distance-based) record linkage techniques is a very popular approach to analyze the privacy level offered by such a method. When databases are very large, some particular record linkage techniques such as blocking or partitioning are usually applied to make this process reasonably efficient. However, in this case the record linkage process is not exact, which means that the disclosure risk of a SDC protection method may be underestimated. In this paper we propose the use of kd-trees techniques to apply exact yet very efficient record linkage when (protected) datasets are very large. We describe some experiments showing that this approach achieves better results, in terms of both accuracy and running time, than more classical approaches such as record linkage based on a sliding window. We also discuss and experiment on the use of these techniques not to link a whole protected record with its original one, but just to guess the value of some confidential attribute(s) of the record(s). This fact leads to concepts such as k-neighbor l-diversity or k-neighbor p-sensitivity, a generalization (to any SDC protection method) of l-diversity or p-sensitivity, which have been defined for SDC protection methods ensuring k-anonymity, such as microaggregation. (C) 2011 Elsevier B.V. All rights reserved.", "paper_title": "Kd-trees and the real disclosure risks of large statistical databases", "paper_id": "WOS:000305668300005"}