{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "covering-based_rough_sets"}, {"score": 0.03376673258505807, "phrase": "relation-based_rough_sets"}, {"score": 0.004691281982544509, "phrase": "rough"}, {"score": 0.0045411156682300695, "phrase": "important_technique"}, {"score": 0.004310752197635499, "phrase": "information_systems"}, {"score": 0.004227398267369744, "phrase": "rough_set_theory"}, {"score": 0.003935267970727093, "phrase": "classical_rough_sets"}, {"score": 0.003569050665799723, "phrase": "five_types"}, {"score": 0.0028973794653974327, "phrase": "proposed_framework"}, {"score": 0.0025934566395017424, "phrase": "sufficient_and_necessary_conditions"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Binary relation", " Covering", " Covering-based approximation operator", " Covering-based rough set", " Relation-based rough set"], "paper_abstract": "Rough set theory is an important technique to deal with vagueness and granularity in information systems. In rough set theory, relation-based rough sets and covering-based rough sets are two important extensions of the classical rough sets. This paper investigates relationships between relation-based rough sets and covering-based rough sets. Firstly, we unify five types of covering-based rough sets under a framework of a type of relation-based rough sets, and establish the equivalences between four types of covering-based rough sets and the type of relation-based rough sets, respectively. Then, within the proposed framework, conditions required for two different coverings to generate the same approximation operators are investigated. We also present some sufficient and necessary conditions for different types of covering-based rough sets to be equal. Furthermore, two examples are taken to illustrate applications of the discussion about relationships between covering-based rough sets and relation-based rough sets. (C) 2012 Elsevier Inc. All rights reserved.", "paper_title": "Relationships between covering-based rough sets and relation-based rough sets", "paper_id": "WOS:000314084700005"}