{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "informed_consent"}, {"score": 0.04550288640963527, "phrase": "personal_health_information"}, {"score": 0.03629023609882574, "phrase": "information_materials"}, {"score": 0.004784909348794283, "phrase": "online_health_care_systems"}, {"score": 0.004195418010131832, "phrase": "routinised_and_non-routinised_consent_behaviour"}, {"score": 0.004040688646993605, "phrase": "official_danish_health_information_web-portal"}, {"score": 0.003940706575253453, "phrase": "danish_residents"}, {"score": 0.003689823995992878, "phrase": "explicit_consent"}, {"score": 0.003576013525113198, "phrase": "data_protection_policies"}, {"score": 0.003234806486611361, "phrase": "seventy-nine_percent"}, {"score": 0.00307657476125683, "phrase": "main_reasons"}, {"score": 0.002748201169075936, "phrase": "low_risk"}, {"score": 0.002630155206056179, "phrase": "consent_process"}, {"score": 0.002305510336172049, "phrase": "routinised_behaviour"}, {"score": 0.0021789194955896102, "phrase": "health_care_system"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ireland_ltd."}], "paper_keywords": ["Informed consent", " Routinisation", " Online health care systems"], "paper_abstract": "Objectives: To investigate (1) the extent to which informed consent is routinised, i.e., given habitually and without reflection, in relation to the use of web-portals containing personal health information, and (2) the reasons given by users for routinised and non-routinised consent behaviour. Design: Anonymous web-questionnaire among users of the official Danish health information web-portal, Sundhed.dk. Setting: Sundhed.dk allows Danish residents access to their electronic patient records and other personal health information and allows them to update some of this information. Use of the portal requires explicit consent to the terms and conditions of use and the data protection policies of the site. Main outcome measures: Degree to which information materials are read before use of the portal. Reasons given for reading or not reading materials. Result: Seventy-nine percent of respondents read half or less of the information materials before using the portal. The main reasons given for not reading (all) of the materials relate to the length of the materials, the frequency of having to read such things, and the perception that use of the portal is low risk'. The reasons given for reading and not reading indicate that the consent process is routinised. Conclusions: Most users of Sundhed.dk do not provide informed consent before using the portal, since most do not read the information fully. The reasons given for not reading strongly supports the idea that consent has become a routinised behaviour in this context. This finding is important because web-portals offering access to personal health information held by the health care system are becoming ever more frequent. (C) 2015 Elsevier Ireland Ltd. All rights reserved.", "paper_title": "Routinisation of informed consent in online health care systems", "paper_id": "WOS:000349471500002"}