{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "keyword_advertising"}, {"score": 0.02555096836802044, "phrase": "organic_search_results"}, {"score": 0.004334280585565239, "phrase": "online_searchers"}, {"score": 0.004101886428528311, "phrase": "advertising_avoidance"}, {"score": 0.0038431888954930083, "phrase": "computer_program"}, {"score": 0.003785836059995376, "phrase": "eye-tracking_device"}, {"score": 0.0036337256491103744, "phrase": "right-hand_side"}, {"score": 0.0036007478932719417, "phrase": "eye_movements"}, {"score": 0.0031606404966938568, "phrase": "observation_count"}, {"score": 0.002459414063407306, "phrase": "longest_observation_time"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Advertising avoidance", " Empirical research", " Eye tracking", " Keyword advertising", " Organic search", " Search engine results pages (SERPs)", " Sponsored search"], "paper_abstract": "This study examined the behavior of online searchers in relation to keyword advertising according to the theory of advertising avoidance. A total of 451 volunteers were recruited for an experiment. A computer program and an eye-tracking device were used to measure the number of clicks and eye movements. The findings show that the number of clicks for to obtain organic search results is higher than that for keyword advertising. There is no difference in observation count between the area of keyword advertising placed above the organic search results and the area of the organic search results themselves. However, observation counts for the organic search results and keyword advertising placed above the organic search results are higher than for the keyword advertising placed at the right-hand side of the page. Searchers seem to spend the longest observation time on the organic search results, then on the keyword advertising placed above the organic search results, and finally on the keyword advertising placed at the right-hand side of the page. (C) 2014 Elsevier B.V. All rights reserved.", "paper_title": "Keyword advertising is not what you think: Clicking and eye movement behaviors on keyword advertising", "paper_id": "WOS:000340574200001"}