{"auto_keywords": [{"score": 0.035102287004930594, "phrase": "different_feature_sets"}, {"score": 0.033495725113678786, "phrase": "eeg"}, {"score": 0.00481495049065317, "phrase": "recall_paradigm"}, {"score": 0.0045877173513910055, "phrase": "human_emotions"}, {"score": 0.00431388720289049, "phrase": "valence-arousal_emotional_space"}, {"score": 0.003968112038249246, "phrase": "acquisition_protocol"}, {"score": 0.003714748329627737, "phrase": "peripheral_and_eeg_signals"}, {"score": 0.0035082436540296406, "phrase": "valence-arousal_space"}, {"score": 0.003142732162296465, "phrase": "mutual_information"}, {"score": 0.0031153249641025977, "phrase": "mi"}, {"score": 0.0027660443371695024, "phrase": "obtained_accuracy"}, {"score": 0.002682081928174866, "phrase": "eeg_time-frequency_features"}, {"score": 0.0025665261770229757, "phrase": "previous_studies"}, {"score": 0.0025217065652145443, "phrase": "similar_classes"}, {"score": 0.002434396049547248, "phrase": "decision_level"}, {"score": 0.0024024377855956136, "phrase": "summation_rule"}, {"score": 0.002258745901862197, "phrase": "non-confident_samples"}, {"score": 0.0022095328812245852, "phrase": "classification_accuracy"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Emotion assessment and classification", " Affective computing", " Signal processing"], "paper_abstract": "The work presented in this paper aims at assessing human emotions using peripheral as well as electroencephalographic (EEG) physiological signals on short-time periods. Three specific areas of the valence-arousal emotional space are defined, corresponding to negatively excited, positively excited, and calm-neutral states. An acquisition protocol based on the recall of past emotional life episodes has been designed to acquire data from both peripheral and EEG signals. Pattern classification is used to distinguish between the three areas of the valence-arousal space. The performance of several classifiers has been evaluated on 10 participants and different feature sets: peripheral features, EEG time-frequency features, EEG pairwise mutual information (MI) features. Comparison of results obtained using either peripheral or EEG signals confirms the interest of using EEGs to assess valence and arousal in emotion recall conditions. The obtained accuracy for the three emotional classes is 63% using EEG time-frequency features, which is better than the results obtained from previous studies using EEG and similar classes. Fusion of the different feature sets at the decision level using a summation rule also showed to improve accuracy to 70%. Furthermore, the rejection of non-confident samples finally led to a classification accuracy of 80% for the three classes. (C) 2009 Elsevier Ltd. All rights reserved.", "paper_title": "Short-term emotion assessment in a recall paradigm", "paper_id": "WOS:000267732400001"}