{"auto_keywords": [{"score": 0.04240035589136514, "phrase": "url_addresses"}, {"score": 0.00481495049065317, "phrase": "spam-advertised_url_addresses"}, {"score": 0.004402854153653114, "phrase": "world_wide_web_pages"}, {"score": 0.004177049813981273, "phrase": "e-mail_spamming"}, {"score": 0.00398370478688858, "phrase": "massive_scale"}, {"score": 0.00392125815948488, "phrase": "minimum_cost"}, {"score": 0.0036043137580229873, "phrase": "web_sites"}, {"score": 0.003226744277130179, "phrase": "spam_e-mail"}, {"score": 0.0028734230458881903, "phrase": "spam-advertised_urls"}, {"score": 0.0025858215477025117, "phrase": "reputable_url_addresses"}, {"score": 0.002492098272172066, "phrase": "e-mail_users"}, {"score": 0.0023146962503449186, "phrase": "spam_filters"}, {"score": 0.002207363758847308, "phrase": "new_techniques"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Spam e-mail", " Characterization study", " URI"], "paper_abstract": "The main purpose of most spam e-mail messages distributed on Internet today is to entice recipients into visiting World Wide Web pages that are advertised through spam. In essence, e-mail spamming is a campaign that advertises URL addresses at a massive scale and at minimum cost for the advertisers and those advertised. Nevertheless, the characteristics of URL addresses and of web sites advertised through spam have not been studied extensively. In this paper, we investigate the properties of URL-dissemination through spam e-mail, and the characteristics of URL addresses disseminated through spam. We conclude that spammers advertise URL addresses non-repetitively and that spam-advertised URLs are short-lived, elusive, and therefore hard to detect and filter. We also observe that reputable URL addresses are sometimes used as decoys against e-mail users and spam filters. These observations can be valuable for the configuration of spam filters and in order to drive the development of new techniques to fight spam. (c) 2007 Elsevier Ltd. All rights reserved.", "paper_title": "On the properties of spam-advertised URL addresses", "paper_id": "WOS:000262946600032"}