{"auto_keywords": [{"score": 0.040073491575423836, "phrase": "missing_genes"}, {"score": 0.016142939213250256, "phrase": "common_adjacencies"}, {"score": 0.010612387000973441, "phrase": "fixed-parameter_algorithms"}, {"score": 0.007926176288534176, "phrase": "incomplete_genome_b"}, {"score": 0.006239274935852436, "phrase": "resulting_genomes"}, {"score": 0.0050807191823458945, "phrase": "open_problem"}, {"score": 0.004706206193274572, "phrase": "new_sequencing_technologies"}, {"score": 0.004530371221172796, "phrase": "huge_amount"}, {"score": 0.004103212598803194, "phrase": "complete_genome"}, {"score": 0.0039049226745413224, "phrase": "complete_genomes"}, {"score": 0.00377326532920359, "phrase": "first_problem"}, {"score": 0.0035500334260484376, "phrase": "complete_genome_a"}, {"score": 0.0033019779616246356, "phrase": "genomes_b"}, {"score": 0.003118410827789671, "phrase": "second_problem"}, {"score": 0.0021785729703227698, "phrase": "one-sided_scaffold_filling"}, {"score": 0.0021620042653528846, "phrase": "two-sided_scaffold"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Scaffold filling", " Genome comparison", " Computational biology", " Fixed-parameter algorithms"], "paper_abstract": "The new sequencing technologies, called next-generation sequencing, provide a huge amount of data that can be used to reconstruct genomes. However, the methods applied to reconstruct genomes often are not able to reconstruct a complete genome and provide only an incomplete information. Here we consider two combinatorial problems that aim to reconstruct complete genomes by inserting a collection of missing genes. The first problem we consider, called One-sided scaffold filling, given an incomplete genome B and a complete genome A, asks for the insertion of missing genes into an incomplete genome B with the goal of maximizing the common adjacencies between genomes B' (resulting from the insertion of missing genes in B) and A. The second problem, called Two-sided scaffold filling, given two incomplete genomes A, B, asks for the insertion of missing genes into both genomes so that the resulting genomes A' and B' have the same multiset of genes and the number of common adjacencies between A' and B' is maximized. Both problems were proved to be NP-hard, while their parameterized complexity, when the parameter is the number of common adjacencies of the resulting genomes, was left as an open problem. In this paper, we settle this open problem by presenting fixed-parameter algorithms for One-sided scaffold filling and Two-sided scaffold filling. (C) 2014 Elsevier B.V. All rights reserved.", "paper_title": "Fixed-parameter algorithms for scaffold filling", "paper_id": "WOS:000349579800005"}