{"auto_keywords": [{"score": 0.026165689966059516, "phrase": "axmedis_tools"}, {"score": 0.004688894532233354, "phrase": "content_technology"}, {"score": 0.0036645642553325215, "phrase": "axmedis_content_model"}, {"score": 0.003514764742705136, "phrase": "smil"}, {"score": 0.0034882173509619896, "phrase": "html"}, {"score": 0.0034096661914349577, "phrase": "extended_axmedis_format"}, {"score": 0.0033455764382772754, "phrase": "new_features"}, {"score": 0.0031246358910995316, "phrase": "newly_obtained_format"}, {"score": 0.0030658872249549893, "phrase": "newsml"}, {"score": 0.0029741713977710495, "phrase": "news_production"}, {"score": 0.0028095140358025, "phrase": "production_tools"}, {"score": 0.0027048247303526583, "phrase": "intelligent_content_features"}, {"score": 0.0023952639120005193, "phrase": "comparative_analysis"}, {"score": 0.0021948455916770233, "phrase": "axmedis_format"}, {"score": 0.002121056250381627, "phrase": "innovative_applications"}, {"score": 0.0021049977753042253, "phrase": "intelligent_content"}], "paper_keywords": ["Cross media", " intelligent content", " MPEG-21", " NewsML", " repurposing", " automated content management", " DRM"], "paper_abstract": "The content technology needs to attain forms with more intelligence, flexibility and complete features than those being currently on the market or proposed by standards. In this paper, an analysis of the state of the art about intelligent and complex content models is presented. The analysis allowed identifying a number of topics and features which models and formats should evolve according to. The work has been used to extend AXMEDIS content model and format which in turn is grounded on MPEG-21, SMIL, HTML, and other standards. The Extended AXMEDIS format presents a set of new features among them: semantic descriptors, extended annotations, intelligent behavioral and semantic computing capabilities. The newly obtained format has been compared against NewsML which is one of the most widespread formats for news production and distribution. The management of news has some peculiarities such as container, production tools and players, that may take advantage of the intelligent content features and applications. Moreover, news have to be massively processed for ingestion and repurposing, and present relevant requirements on right control. Also these features may be satisfied by AXMEDIS tools. To this end, a comparative analysis of processing and modeling NewsML with AXMEDIS tools and format has been performed and reported to verify the usage. In addition, AXMEDIS format can be profitably used for a range of innovative applications of intelligent content.", "paper_title": "EXPLOITING INTELLIGENT CONTENT VIA AXMEDIS/MPEG-21 FOR MODELLING AND DISTRIBUTING NEWS", "paper_id": "WOS:000293093300002"}