{"auto_keywords": [{"score": 0.047683486556799944, "phrase": "basal_ganglia"}, {"score": 0.015719716506582538, "phrase": "reinforcement_learning"}, {"score": 0.010888256302130165, "phrase": "actor-critic_model"}, {"score": 0.004296264970612285, "phrase": "action_selection"}, {"score": 0.004175533280178052, "phrase": "reinforcement_learning_theories"}, {"score": 0.003641433168173135, "phrase": "sensory_evidence"}, {"score": 0.002999274091205852, "phrase": "statistically_optimal_decision-making_procedure"}, {"score": 0.0029148831519944358, "phrase": "coricostriatal_weights"}, {"score": 0.0028653893877383188, "phrase": "optimal_decision_making"}, {"score": 0.0027374647587075935, "phrase": "standard_reinforcement_learning_models"}, {"score": 0.0025127604406208668, "phrase": "optimal_decision"}, {"score": 0.0023329572140896237, "phrase": "model's_predictions"}, {"score": 0.0023064582783867645, "phrase": "reaction_times"}, {"score": 0.0022802596433757565, "phrase": "neural_responses"}, {"score": 0.0021049977753042253, "phrase": "optimal_decision-making_theories"}], "paper_keywords": [""], "paper_abstract": "This article seeks to integrate two sets of theories describing action selection in the basal ganglia: reinforcement learning theories describing learning which actions to select to maximize reward and decision-making theories proposing that the basal ganglia selects actions on the basis of sensory evidence accumulated in the cortex. In particular, we present a model that integrates the actor-critic model of reinforcement learning and a model assuming that the cortico-basal-ganglia circuit implements a statistically optimal decision-making procedure. The values of coricostriatal weights required for optimal decision making in our model differ from those provided by standard reinforcement learning models. Nevertheless, we show that an actor-critic model converges to the weights required for optimal decision making when biologically realistic limits on synaptic weights are introduced. We also describe the model's predictions concerning reaction times and neural responses during learning, and we discuss directions required for further integration of reinforcement learning and optimal decision-making theories.", "paper_title": "Integration of Reinforcement Learning and Optimal Decision-Making Theories of the Basal Ganglia", "paper_id": "WOS:000287912400001"}