{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "efficient_use"}, {"score": 0.004764220976404241, "phrase": "visualization_tools"}, {"score": 0.004664352260912174, "phrase": "three-dimensional_visualization"}, {"score": 0.004400329132129292, "phrase": "full_benefits"}, {"score": 0.004353948887538618, "phrase": "information_technology"}, {"score": 0.004064117897000019, "phrase": "modeling_techniques"}, {"score": 0.00385431710959668, "phrase": "project_life_cycle"}, {"score": 0.0036942726653704213, "phrase": "visualization_models"}, {"score": 0.003522124318486352, "phrase": "widespread_use"}, {"score": 0.003466536738232506, "phrase": "integrated_systems"}, {"score": 0.0032014433546265694, "phrase": "engineering_curriculum"}, {"score": 0.0029565620771207003, "phrase": "minimum_set"}, {"score": 0.0027015344365793016, "phrase": "new_course_module"}, {"score": 0.002603012037901889, "phrase": "feedback_data"}, {"score": 0.0023532890136269986, "phrase": "inherent_problems"}], "paper_keywords": [""], "paper_abstract": "Three-dimensional visualization is getting increasingly popular. However, for realizing the full benefits of information technology (IT), we need to go beyond visualization and adopt modeling techniques that allow reuse of information for other tasks in the project life cycle. Already it is possible to use visualization models for tasks such as simulation. However, widespread use of these integrated systems is hindered by the lack of education in the fundamentals of IT in the engineering curriculum. This paper analyzes the dependencies between concepts related to visualization and lists a minimum set of topics that should be part of the curriculum. Experiences in teaching these in a new course module related to visualization are described. Feedback data collected shows that most students appreciated the use of IT tools in education. However, comments by many students indicated inherent problems related to IT and visualization. Nevertheless, it is expected that when more universities start teaching fundamentals we should see more IT adoption in the industry.", "paper_title": "Promoting Efficient Use of Visualization Tools through Education", "paper_id": "WOS:000270913900014"}