{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "collaborative_processes"}, {"score": 0.013202602259710775, "phrase": "collaborative_situation"}, {"score": 0.004773404795430319, "phrase": "modem_business_environment"}, {"score": 0.0047049532961375, "phrase": "large_network"}, {"score": 0.004677847043645765, "phrase": "heterogeneous_people"}, {"score": 0.004389745162172933, "phrase": "high_degree"}, {"score": 0.004339293854115301, "phrase": "partner_information_systems"}, {"score": 0.003944506079554075, "phrase": "mediation_information_system"}, {"score": 0.003921792522324475, "phrase": "mis"}, {"score": 0.00385431710959668, "phrase": "collaborative_situations"}, {"score": 0.003575151757072538, "phrase": "existing_systems"}, {"score": 0.0034134687245359376, "phrase": "process_events"}, {"score": 0.0032496585171039797, "phrase": "agility_mechanisms"}, {"score": 0.0031753062090452864, "phrase": "significant_events"}, {"score": 0.003120657021758196, "phrase": "subsequent_evolution"}, {"score": 0.003022890602492506, "phrase": "driven_architecture"}, {"score": 0.0028446460307503343, "phrase": "mis_agility"}, {"score": 0.0026460666839772246, "phrase": "mis."}, {"score": 0.0025336179740814905, "phrase": "relevant_changes"}, {"score": 0.0024400265512135397, "phrase": "expected_way"}, {"score": 0.0021921063460682293, "phrase": "event_driven_architecture_principles"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Complex event processing", " Agility", " Adaptation", " Decision making", " Dynamic change", " Interoperability"], "paper_abstract": "The modem business environment tends to involve a large network of heterogeneous people, devices and organizations that engage in collaborative processes among themselves. Given the nature of this type of collaboration and the high degree of interoperability between partner Information Systems, these processes need to be agile in order to respond to changes in context, which may occur at any time during the collaborative situation. The objective is to build a Mediation Information System (MIS), in support of collaborative situations, whose architecture must be (i) built to be relevant to the collaborative situation under consideration, (ii) more easily integrated into the existing systems, and (iii) sufficiently agile, through its awareness of the environment and of process events, and through the way it reacts to events detected as being relevant. To apply agility mechanisms, it is crucial to detect the significant events that will lead to a subsequent evolution of the situation (detection step). Event-Driven Architecture (EDA) is used to design the structure of the part of the system that is in charge of MIS agility. This architecture takes the events into account, manages them and, if needed, uses them to trigger the adaptation of the MIS. We have defined a means to monitor the evolution of the situation. If relevant changes are detected, and if the situation does not evolve in the expected way, an adaptation is proposed. It is concluded that the principles of detection and adaptation, combined with the responsiveness of the system (provided by the automation of transitions), and based on Event Driven Architecture principles, together provide the agility required for collaborative processes. (C) 2013 Elsevier B.V. All rights reserved.", "paper_title": "Event-driven agility of interoperability during the Run-time of collaborative processes", "paper_id": "WOS:000333778800016"}