{"auto_keywords": [{"score": 0.04410293038185961, "phrase": "source_node"}, {"score": 0.00481495049065317, "phrase": "delay-constrained_capacitated_minimum"}, {"score": 0.004632968695963776, "phrase": "evolutionary_algorithm"}, {"score": 0.004144810537437608, "phrase": "traffic_and_delay_constraints"}, {"score": 0.003837205620832367, "phrase": "optimization_process"}, {"score": 0.0036762529165489644, "phrase": "dandelion_code"}, {"score": 0.0036137713873827374, "phrase": "proposed_evolutionary_algorithm"}, {"score": 0.00350696416714684, "phrase": "effective_way"}, {"score": 0.003477029725200912, "phrase": "encoding_trees"}, {"score": 0.003447349911141396, "phrase": "evolutionary_algorithms"}, {"score": 0.0034179225740833055, "phrase": "good_properties"}, {"score": 0.002929056388593134, "phrase": "main_characteristics"}, {"score": 0.0027702126237754625, "phrase": "dc-cmst_problem"}, {"score": 0.002586457551025025, "phrase": "experimental_section"}, {"score": 0.0024148618915672353, "phrase": "recently_proposed_heuristic"}, {"score": 0.002216251512062482, "phrase": "better_results"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Delay-constrained capacitated minimum spanning tree", " Evolutionary algorithms", " Dandelion encoding", " Heuristics"], "paper_abstract": "This paper proposes an evolutionary algorithm with Dandelion-encoding to tackle the Delay-Constrained Capacitated Minimum Spanning Tree (DC-CMST) problem. This problem has been recently proposed, and consists of finding several broadcast trees from a source node, jointly considering traffic and delay constraints in trees. A version of the problem in which the source node is also included in the optimization process is considered as well in the paper. The Dandelion code used in the proposed evolutionary algorithm has been recently proposed as an effective way of encoding trees in evolutionary algorithms. Good properties of locality has been reported on this encoding, which makes it very effective to solve problems in which the solutions can be expressed in form of trees. In the paper we describe the main characteristics of the algorithm, the implementation of the Dandelion-encoding to tackled the DC-CMST problem and a modification needed to include the source node in the optimization. In the experimental section of this article we compare the results obtained by our evolutionary with that of a recently proposed heuristic for the DC-CMST. the Least Cost (LC) algorithm. We show that our Dandelion-encoded evolutionary algorithm is able to obtain better results that the LC in all the instances tackled. (C) 2008 Elsevier B.V. All rights reserved.", "paper_title": "A dandelion-encoded evolutionary algorithm for the delay-constrained capacitated minimum spanning tree problem", "paper_id": "WOS:000263013800018"}