{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "lotkaian_systems"}, {"score": 0.004757366891541805, "phrase": "general_information_production_processes"}, {"score": 0.004570326517392777, "phrase": "total_number"}, {"score": 0.00440825801245188, "phrase": "seven_possible_definitions"}, {"score": 0.003739421738326676, "phrase": "different_types"}, {"score": 0.0035635256137029592, "phrase": "concrete_cases"}, {"score": 0.0032753168662834516, "phrase": "lotkaian_ipps"}, {"score": 0.0029862549873935496, "phrase": "median_number"}, {"score": 0.002668470532683947, "phrase": "lotkaian_exponent"}, {"score": 0.002244876254113051, "phrase": "increasing_function"}, {"score": 0.0021049977753042253, "phrase": "increasing_relation"}], "paper_keywords": [""], "paper_abstract": "In general information production processes (IPPs), we define productivity as the total number of sources but we present a choice of seven possible definitions of performance: the mean or median number of items per source, the fraction of sources with a certain minimum number of items, the h-, g-, R- and h(w)-index. We give an overview of the literature on different types of IPPs and each time we interpret \"performance\" in these concrete cases. Examples are found in informetrics (including webometrics and scientometrics), linguistics, econometrics and demography. In Lotkaian IPPs we study these interpretations of \"performance\" in function of the productivity in these IPPs. We show that the mean and median number of items per source as well as the fraction of sources with a certain minimum number of items are increasing functions of the productivity if and only if the Lotkaian exponent is decreasing in function of the productivity. We show that this property implies that the g-, R- and h(w)-indices are increasing functions of the productivity and, finally, we show that this property implies that the h-index is an increasing function of productivity. We conclude that the h-index is the indicator which shows best the increasing relation between productivity and performance.", "paper_title": "Performance and its relation with productivity in Lotkaian systems", "paper_id": "WOS:000270979000019"}