{"auto_keywords": [{"score": 0.031518332094430355, "phrase": "time_constraint"}, {"score": 0.015719716506582538, "phrase": "system_reliability"}, {"score": 0.015461469888833061, "phrase": "time-based_capacitated_flow_network"}, {"score": 0.011987445398765194, "phrase": "correlated_failures"}, {"score": 0.004428139418750855, "phrase": "tcfn"}, {"score": 0.004211069233133584, "phrase": "computer_network"}, {"score": 0.003724034990158436, "phrase": "global-scale_events"}, {"score": 0.0036214184763804034, "phrase": "local_and_neighboring_edges"}, {"score": 0.003541357671562449, "phrase": "widespread_damage"}, {"score": 0.0034824716857663114, "phrase": "tcfn_performance"}, {"score": 0.0034245614958572012, "phrase": "simulation_approach"}, {"score": 0.0025604233506352375, "phrase": "practical_computer_network"}, {"score": 0.0023151088048303705, "phrase": "modeling_approach"}, {"score": 0.002276566401216226, "phrase": "design_and_optimization_studies"}], "paper_keywords": ["Correlated failure", " Time-based capacitated flow network (TCFN)", " System reliability", " Simulation"], "paper_abstract": "This paper constructs a time-based capacitated flow network (TCFN) model to analyze the performance of a computer network, considering correlation between the failures of all the physical lines comprising the edges of the network. This model allows us to assess global-scale events, including correlated failures in local and neighboring edges that can cause widespread damage and degrade TCFN performance. A simulation approach is proposed to quantify the probability that a given amount of data can be sent from an origin to destination through this TCFN within a time constraint. This probability that the network satisfies both a specified level of demand and time constraint is referred to as system reliability. The results of several experimental including a practical computer network demonstrate that correlation can positively or negatively impact reliability depending on the demand and time constraint. The modeling approach therefore promotes design and optimization studies to ensure that a network will be highly reliable despite correlated failures. (C) 2013 Elsevier B.V. All rights reserved.", "paper_title": "Simulation approach to estimate the system reliability of a time-based capacitated flow network susceptible to correlated failures", "paper_id": "WOS:000322093000007"}