{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "multi-interface_networks"}, {"score": 0.02798396834120986, "phrase": "unit_cost_interface_case"}, {"score": 0.004750959742844963, "phrase": "cheapest_paths"}, {"score": 0.0044883089984593455, "phrase": "wireless_devices"}, {"score": 0.004326113419290302, "phrase": "multiple_radio_interfaces"}, {"score": 0.004240116703465252, "phrase": "common_interfaces"}, {"score": 0.0040324997782003455, "phrase": "minimum_cost_set"}, {"score": 0.003647156095687574, "phrase": "corresponding_edge_share"}, {"score": 0.003222065787177288, "phrase": "connectivity_problem"}, {"score": 0.00317917686846757, "phrase": "well-known_minimum_spanning_tree_problem"}, {"score": 0.003003157931633302, "phrase": "minimum_cost"}, {"score": 0.0029631742332058087, "phrase": "spanning_tree"}, {"score": 0.0027341763737751467, "phrase": "approximation_algorithms"}, {"score": 0.0024478477463201302, "phrase": "special_graph_classes"}, {"score": 0.0023990982005125763, "phrase": "bounded_degree"}, {"score": 0.0023830645437709604, "phrase": "planar_graphs"}, {"score": 0.0023513172266105982, "phrase": "bounded_treewidth"}, {"score": 0.00227378279992074, "phrase": "well-known_shortest_path_problem"}, {"score": 0.0021191645265024855, "phrase": "simple_dijsktra-based_algorithm"}], "paper_keywords": ["Energy saving", " Wireless network", " Multi-interface network"], "paper_abstract": "Let G = (V,E) be a graph which models a set of wireless devices (nodes V) that can communicate by means of multiple radio interfaces, according to proximity and common interfaces (edges E). The problem of switching on (activating) the minimum cost set of interfaces at the nodes in order to guarantee the coverage of G was recently studied. A connection is covered (activated) when the endpoints of the corresponding edge share at least one active interface. In general, every node holds a subset of all the possible k interfaces. Such networks are known as multi-interface networks. In this setting, we study two basic problems: Connectivity and Cheapest Path. The Connectivity problem corresponds to the well-known Minimum Spanning Tree problem in graph theory. In practice, we need to cover a subgraph of G of minimum cost which contains a spanning tree of G. The problem turns out to be APX-hard in general and for many restricted graph classes, however it is possible to provide approximation algorithms: a 2-approximation in general and a (2 - 1/k)-approximation for the unit cost interface case, i.e. when the cost of activating an interface is unitary for any interface. We also consider the problem in special graph classes, such as graphs of bounded degree, planar graphs, graphs of bounded treewidth, complete graphs. The Cheapest Path problem corresponds to the well-known Shortest Path problem in graph theory. In the multi-interface setting this problem is still polynomially solvable, and we point out a simple Dijsktra-based algorithm with O(k vertical bar E vertical bar + k vertical bar V vertical bar log(k + vertical bar V vertical bar)) runtime in general and O(k(vertical bar E vertical bar + vertical bar V vertical bar)) runtime for the unit cost interface case.", "paper_title": "Exploiting multi-interface networks: Connectivity and Cheapest Paths", "paper_id": "WOS:000277454200013"}