{"auto_keywords": [{"score": 0.050076840055901004, "phrase": "information-seeking_behaviour"}, {"score": 0.04888773122363802, "phrase": "ellis's_model"}, {"score": 0.03525035938531459, "phrase": "ellis"}, {"score": 0.004335603324413586, "phrase": "considerable_scope"}, {"score": 0.003986581218661184, "phrase": "information-seeking_models"}, {"score": 0.003903789851015775, "phrase": "analyse_users'_behaviour"}, {"score": 0.003589404014552974, "phrase": "high_level"}, {"score": 0.0034418037573506837, "phrase": "broad-scoped_design_insights"}, {"score": 0.0031645050772280033, "phrase": "design_suggestions"}, {"score": 0.0029587924529332695, "phrase": "electronic_legal_resources"}, {"score": 0.00284899583294417, "phrase": "similar_information-seeking_behaviours"}, {"score": 0.0027317585060414253, "phrase": "scientific_domains"}, {"score": 0.0026193328696791306, "phrase": "previous_studies"}, {"score": 0.00246964807581858, "phrase": "legal_information-seeking"}, {"score": 0.0021770116505684394, "phrase": "mutually_exclusive_subtypes"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["information-seeking models", " HCI", " legal", " attorney", " digital library", " behaviour", " Ellis"], "paper_abstract": "Information-seeking is important for lawyers, who have access to many dedicated electronic resources. However there is considerable scope for improving the design of these resources to better support information-seeking. One way of informing design is to use information-seeking models as theoretical lenses to analyse users' behaviour with existing systems. However many models, including those informed by studying lawyers, analyse information-seeking at a high level of abstraction and are only likely to lead to broad-scoped design insights. We illustrate that one potentially useful (and lower-level) model is Ellis's - by using it as a lens to analyse and make design suggestions based on the information-seeking behaviour of 27 academic lawyers, who were asked to think aloud whilst using electronic legal resources to find information for their work. We identify similar information-seeking behaviours to those originally found by Ellis and his colleagues in scientific domains, along with several that were not identified in previous studies such as 'updating' (which we believe is particularly pertinent to legal information-seeking). We also present a refinement of Ellis's model based on the identification of several levels that the behaviours were found to operate at and the identification of sets of mutually exclusive subtypes of behaviours. (c) 2007 Elsevier Ltd. All rights reserved.", "paper_title": "Investigating the information-seeking behaviour of academic lawyers: From Ellis's model to design", "paper_id": "WOS:000254813200011"}