{"auto_keywords": [{"score": 0.037069850759310095, "phrase": "coevolutionary_progress"}, {"score": 0.00481495049065317, "phrase": "competitive_coevolution"}, {"score": 0.004648609688625397, "phrase": "arms_race"}, {"score": 0.0045355866228818514, "phrase": "incremental_improvements"}, {"score": 0.0044408896450445125, "phrase": "better_strategies"}, {"score": 0.004394281902031765, "phrase": "coevolutionary_simulation"}, {"score": 0.0039264465913491356, "phrase": "chemical_genetic_programming"}, {"score": 0.0038579703525471985, "phrase": "genotypic_strings"}, {"score": 0.0038309141193444015, "phrase": "phenotypic_trees"}, {"score": 0.003724566354526513, "phrase": "speed_differentials"}, {"score": 0.003698442219929622, "phrase": "environmental_conditions"}, {"score": 0.003672500644750565, "phrase": "designing_experiments"}, {"score": 0.0035957586558176932, "phrase": "emergent_strategies"}, {"score": 0.0035579889785989738, "phrase": "necessary_steps"}, {"score": 0.0033988361874354306, "phrase": "design_pointers"}, {"score": 0.0033044432971036652, "phrase": "deeper_understanding"}, {"score": 0.0029522931151878505, "phrase": "evader's_strategy"}, {"score": 0.002555247330102505, "phrase": "possible_suboptimal_strategies"}, {"score": 0.0024066745849759706, "phrase": "problem_complexity"}, {"score": 0.0022036996784968793, "phrase": "amino-acid_building_blocks"}, {"score": 0.0021805201234139453, "phrase": "chemical_genetic_program"}, {"score": 0.0021273762177807876, "phrase": "significant_complexity"}, {"score": 0.0021049977753042253, "phrase": "short_period"}], "paper_keywords": ["pursuit and evasion", " Chemical Genetic Programming", " competitive coevolution", " game of tag"], "paper_abstract": "The game of tag is frequently used in the study of pursuit and evasion strategies that are discovered through competitive coevolution. The aim of coevolution is to create an arms race where opposing populations cyclically evolve in incremental improvements, driving the system towards better strategies. A coevolutionary simulation of the game of tag involving two populations of agents; pursuers and evaders, is developed to investigate the effects of a boundary and two obstacles. The evolution of strategies through Chemical Genetic Programming optimizes the mapping of genotypic strings to phenotypic trees. Four experiments were conducted, distinguished by speed differentials and environmental conditions. Designing experiments to evaluate the efficacy of emergent strategies often reveal necessary steps needed for coevolutionary progress. The experiments that excluded obstacles and boundaries provided design pointers to ensure coevolutionary progress as well as a deeper understanding of strategies that emerged when obstacles and boundaries were added. In the latter, we found that an awareness of the environment and the pursuer was not critical in an evader's strategy to survive, instead heading to the edge of the boundary or behind an obstacle in a bid to 'throw-off or hide from the pursuer' or simply turn in circles was often sufficient, thereby revealing possible suboptimal strategies that were environment specific. We also observed that a condition for coevolutionary progress was that the problem complexity must be surmountable by at least one population; that is, some pursuer must be able to tag an opponent. Due to the use of amino-acid building blocks in our Chemical Genetic Program, our simulations were able to achieve significant complexity in a short period of time.", "paper_title": "Environmental effects on the coevolution of pursuit and evasion strategies", "paper_id": "WOS:000253571200002"}