{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "clock_matching"}, {"score": 0.033108682369277546, "phrase": "cm-bof_method"}, {"score": 0.0038603905208013482, "phrase": "normalized_object"}, {"score": 0.003751331782523201, "phrase": "depth-buffer_images"}, {"score": 0.0034990853199511982, "phrase": "word_histogram"}, {"score": 0.0034422330919613294, "phrase": "vector_quantization"}, {"score": 0.003400198866111204, "phrase": "image's_salient_local_features"}, {"score": 0.0029100272315053253, "phrase": "canonical_form"}, {"score": 0.002626645763725465, "phrase": "training_data"}, {"score": 0.0025945450101602825, "phrase": "distance_function"}, {"score": 0.002573362191631126, "phrase": "experimental_results"}, {"score": 0.0025523518748506347, "phrase": "five_commonly_used_benchmarks"}, {"score": 0.002370794661629904, "phrase": "time-consuming_clustering"}, {"score": 0.0023131855385489764, "phrase": "codebook_construction"}, {"score": 0.0022849068677290836, "phrase": "cm-bof_approach"}], "paper_keywords": ["3D shape retrieval", " Non-rigid", " Bag-of-Features", " Local feature"], "paper_abstract": "Content-based 3D object retrieval has become an active topic in many research communities. In this paper, we propose a novel visual similarity-based 3D shape retrieval method (CM-BOF) using Clock Matching and Bag-of-Features. Specifically, pose normalization is first applied to each object to generate its canonical pose, and then the normalized object is represented by a set of depth-buffer images captured on the vertices of a given geodesic sphere. Afterwards, each image is described as a word histogram obtained by the vector quantization of the image's salient local features. Finally, an efficient multi-view shape matching scheme (i.e., Clock Matching) is employed to measure the dissimilarity between two models. When applying the CM-BOF method in non-rigid 3D shape retrieval, multidimensional scaling (MDS) should be utilized before pose normalization to calculate the canonical form for each object. This paper also investigates several critical issues for the CM-BOF method, including the influence of the number of views, codebook, training data, and distance function. Experimental results on five commonly used benchmarks demonstrate that: (1) In contrast to the traditional Bag-of-Features, the time-consuming clustering is not necessary for the codebook construction of the CM-BOF approach; (2) Our methods are superior or comparable to the state of the art in applications of both rigid and non-rigid 3D shape retrieval.", "paper_title": "CM-BOF: visual similarity-based 3D shape retrieval using Clock Matching and Bag-of-Features", "paper_id": "WOS:000325699700008"}