{"auto_keywords": [{"score": 0.04804050199975018, "phrase": "inverse_problem"}, {"score": 0.013118875449480108, "phrase": "structural_information"}, {"score": 0.00481495049065317, "phrase": "subsurface_structures"}, {"score": 0.0047732596509542135, "phrase": "electromagnetic_data"}, {"score": 0.004550300345169981, "phrase": "large-scale_subsurface_structures"}, {"score": 0.004491313367627919, "phrase": "controlled_source_electromagnetic_method"}, {"score": 0.004262881313926916, "phrase": "electric_conductivity"}, {"score": 0.003757480190200645, "phrase": "first_approach"}, {"score": 0.0034894451015047875, "phrase": "moderate_number"}, {"score": 0.0033699898113395328, "phrase": "low_number"}, {"score": 0.0029830992938695033, "phrase": "interpreted_seismic_data"}, {"score": 0.0029443683459283955, "phrase": "reduced_conductivity_representation"}, {"score": 0.002868404184756449, "phrase": "structural_prior_information"}, {"score": 0.0027104531025934865, "phrase": "gaussian_distribution"}, {"score": 0.002583597507349819, "phrase": "shape_priors"}, {"score": 0.002473420909291381, "phrase": "kernel_function"}, {"score": 0.002347378595930709, "phrase": "conditionally_positive_definite_kernel"}, {"score": 0.002286781334850213, "phrase": "computational_advantages"}, {"score": 0.002257070536352418, "phrase": "commonly_applied_gaussian_kernel"}, {"score": 0.0022084059770026416, "phrase": "numerical_experiments"}, {"score": 0.0021049977753042253, "phrase": "fairly_complex_subsurface_electric_conductivity_distributions"}], "paper_keywords": ["Inverse problem", " Electric conductivity estimation", " Reduced parameterization", " Shape priors"], "paper_abstract": "We consider the inverse problem of identifying large-scale subsurface structures using the controlled source electromagnetic method. To identify structures in the subsurface where the contrast in electric conductivity can be small, regularization is needed to bias the solution towards preserving structural information. We propose to combine two approaches for regularization of the inverse problem. In the first approach we utilize a model-based, reduced, composite representation of the electric conductivity that is highly flexible, even for a moderate number of degrees of freedom. With a low number of parameters, the inverse problem is efficiently solved using a standard, second-order gradient-based optimization algorithm. Further regularization is obtained using structural prior information, available, e. g., from interpreted seismic data. The reduced conductivity representation is suitable for incorporation of structural prior information. Such prior information cannot, however, be accurately modeled with a gaussian distribution. To alleviate this, we incorporate the structural information using shape priors. The shape prior technique requires the choice of kernel function, which is application dependent. We argue for using the conditionally positive definite kernel which is shown to have computational advantages over the commonly applied gaussian kernel for our problem. Numerical experiments on various test cases show that the methodology is able to identify fairly complex subsurface electric conductivity distributions while preserving structural prior information during the inversion. (C) 2015 Elsevier Inc. All rights reserved.", "paper_title": "Identification of subsurface structures using electromagnetic data and shape priors", "paper_id": "WOS:000348756700025"}