{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "em_response"}, {"score": 0.04974492695968203, "phrase": "dipolar_sources"}, {"score": 0.028078251921359088, "phrase": "published_results"}, {"score": 0.008378579656917509, "phrase": "computed_results"}, {"score": 0.0047314049780079765, "phrase": "non-magnetic_layer_earth_models"}, {"score": 0.004665608609734034, "phrase": "emdpler"}, {"score": 0.004141877689172017, "phrase": "layered_earth_model"}, {"score": 0.003689628075766217, "phrase": "semi-analytical_numerical_approach"}, {"score": 0.0035625556447293804, "phrase": "em_field_components"}, {"score": 0.0034038593017883295, "phrase": "displacement_current_factor"}, {"score": 0.0033682492486884364, "phrase": "arbitrary_position"}, {"score": 0.0029172107428045964, "phrase": "user's_specification"}, {"score": 0.002738723329538679, "phrase": "homogeneous_and_multi-layer_earth_models"}, {"score": 0.002598333022293788, "phrase": "response_curves"}, {"score": 0.002473786357109046, "phrase": "induction_region"}, {"score": 0.0023469450817019, "phrase": "higher_frequency"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["EM response", " Dipolar source", " Layer earth model", " Conduction current", " Displacement current"], "paper_abstract": "A program EMDPLER coded in FORTRAN 77 is presented for modeling the electromagnetic (EM) response of a wide class of dipolar sources (namely, vertical magnetic dipole, horizontal magnetic dipole and horizontal electric dipole) over the layered earth model in induction (f <= 50 kHz) as well as higher frequency (50 kHz <= f <= 1000 kHz) regions. The program is based on a semi-analytical numerical approach for evaluating infinite integrals occurring in the expressions of EM field components. It is capable of computing the EM response with or without the displacement current factor for any arbitrary position of source and/or receiver either in air or on the surface of the model due to all the conventional EM dipole sources where other available algorithms fail due to one or other reasons. The program is well documented, easy to understand and amenable to modification for the user's specification. The validity and accuracy of the program is demonstrated by computing the EM response of dipolar sources over homogeneous and multi-layer earth models, and comparing the computed results with those of published results in the literature. Response curves depict their characteristic variations. The computed results match very well with the published results for the induction region (f <= 50 kHz) and are extension of their characteristic variation in the higher frequency (50 kHz <= f <= 1000 kHz) region. The matching of computed results with the published results illustrates the validity of the program. (C) 2010 Elsevier Ltd. All rights reserved.", "paper_title": "EMDPLER: A F77 program for modeling the EM response of dipolar sources over the non-magnetic layer earth models", "paper_id": "WOS:000276271600003"}