{"auto_keywords": [{"score": 0.04647021928133098, "phrase": "video_abstracts"}, {"score": 0.015719716506582538, "phrase": "sports_videos"}, {"score": 0.013693334401169018, "phrase": "important_scenes"}, {"score": 0.01229276109236834, "phrase": "semantic_content"}, {"score": 0.011412909175738619, "phrase": "play_scene"}, {"score": 0.004749913509007163, "phrase": "video_abstraction"}, {"score": 0.004544521651302002, "phrase": "original_video_streams"}, {"score": 0.004303830426772906, "phrase": "dynamic_video_abstract"}, {"score": 0.004145760434798249, "phrase": "static_video_abstract"}, {"score": 0.0038862297330905836, "phrase": "unified_method"}, {"score": 0.003705412219296983, "phrase": "broadcasted_sports_videos"}, {"score": 0.003593623872399777, "phrase": "proposed_method"}, {"score": 0.003345680943026579, "phrase": "scene_unit"}, {"score": 0.0031790892089501345, "phrase": "play_ranks"}, {"score": 0.0027180455234834993, "phrase": "user's_preferences"}, {"score": 0.002627000223796678, "phrase": "dynamic_video_abstracts"}, {"score": 0.002556359086441866, "phrase": "play_scenes"}, {"score": 0.002530359917257626, "phrase": "highest_significance"}, {"score": 0.0024707163158758307, "phrase": "greedy_criterion"}, {"score": 0.0023879358679564527, "phrase": "static_video_abstracts"}, {"score": 0.002339601774631419, "phrase": "effective_display_style"}, {"score": 0.002284444272376043, "phrase": "target_scenes"}, {"score": 0.0022154296909169826, "phrase": "tree_structures"}, {"score": 0.002200377880796801, "phrase": "sports_games"}, {"score": 0.0021049977753042253, "phrase": "man-made_video_abstracts"}], "paper_keywords": ["Video abstraction", " Metadata", " Dynamic video abstract", " Static video abstract", " Personalization"], "paper_abstract": "Video abstraction is defined as creating a video abstract which includes only important information in the original video streams. There are two general types of video abstracts, namely the dynamic and static ones. The dynamic video abstract is a 3-dimensional representation created by temporally arranging important scenes while the static video abstract is a 2-dimensional representation created by spatially arranging only keyframes of important scenes. In this paper, we propose a unified method of automatically creating these two types of video abstracts considering the semantic content targeting especially on broadcasted sports videos. For both types of video abstracts, the proposed method firstly determines the significance of scenes. A play scene, which corresponds to a play, is considered as a scene unit of sports videos, and the significance of every play scene is determined based on the play ranks, the time the play occurred, and the number of replays. This information is extracted from the metadata, which describes the semantic content of videos and enables us to consider not only the types of plays but also their influence on the game. In addition, user's preferences are considered to personalize the video abstracts. For dynamic video abstracts, we propose three approaches for selecting the play scenes of the highest significance: the basic criterion, the greedy criterion, and the play-cut criterion. For static video abstracts, we also propose an effective display style where a user can easily access target scenes from a list of keyframes by tracing the tree structures of sports games. We experimentally verified the effectiveness of our method by comparing our results with man-made video abstracts as well as by conducting questionnaires.", "paper_title": "Automatic personalized video abstraction for sports videos using metadata", "paper_id": "WOS:000261953400001"}