{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "safety_and_soundness"}, {"score": 0.004773040022691547, "phrase": "priced_resource-constrained_workflow_nets"}, {"score": 0.004669845451682529, "phrase": "petri_nets"}, {"score": 0.004529093447865156, "phrase": "discrete_prices"}, {"score": 0.004042295865725559, "phrase": "soundness_problems"}, {"score": 0.004007083686875716, "phrase": "priced_wf-nets"}, {"score": 0.003954837422946628, "phrase": "priced_wf-net"}, {"score": 0.0037361664435836845, "phrase": "soundness_problem"}, {"score": 0.0034835017385881385, "phrase": "priced_setting"}, {"score": 0.0031223774204093713, "phrase": "resource-constrained_workflow_nets"}, {"score": 0.0029238768315330305, "phrase": "concurrent_executions"}, {"score": 0.002835599469639296, "phrase": "global_resources"}, {"score": 0.00266693888510356, "phrase": "priced_rcwf-nets"}, {"score": 0.0025863988422430797, "phrase": "cost_model"}, {"score": 0.002328238264850759, "phrase": "discounted_sum"}], "paper_keywords": [""], "paper_abstract": "We extend workflow Petri nets (wf-nets) with discrete prices, by associating a price to the execution of a transition and to the storage of tokens. We first define the safety and the soundness problems for priced wf-nets. A priced wf-net is safe if no execution costs more than a given budget. The soundness problem is that of deciding whether the workflow can always terminate properly, where in the priced setting \"properly\" also means that the execution does not cost more than a given threshold. Then, we study safety and soundness of resource-constrained workflow nets (rcwf-nets), an extension of wf-nets for the modeling of concurrent executions of a workflow, sharing some global resources. We develop a framework in which to study safety and soundness for priced rcwf-nets, that is parametric on the cost model. Then, that framework is instantiated, obtaining the cases in which the sum, the maximum, the average and the discounted sum of the prices of all instances are considered. We study the decidability and the complexity of these properties, together with their relation.", "paper_title": "Safety and Soundness for Priced Resource-Constrained Workflow Nets", "paper_id": "WOS:000333421900004"}