{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "panoramic_views"}, {"score": 0.0041316803676012155, "phrase": "object's_surface"}, {"score": 0.003958299299658418, "phrase": "panoramic_view"}, {"score": 0.0037459885494311217, "phrase": "lateral_surface"}, {"score": 0.002985988377995789, "phrase": "global_shape"}, {"score": 0.0027069560455629917, "phrase": "discrete_wavelet_transform"}, {"score": 0.0026091594819333654, "phrase": "retrieval_performance"}, {"score": 0.0023652572260178637, "phrase": "feature_space"}, {"score": 0.002210903392596343, "phrase": "extensive_consistent_evaluation"}, {"score": 0.002183938718432764, "phrase": "standard_benchmarks"}, {"score": 0.0021309898622781124, "phrase": "better_performance"}], "paper_keywords": ["3D object retrieval", " Cylindrical projection", " Panorama", " Local relevance feedback", " Unsupervised"], "paper_abstract": "We present a novel 3D shape descriptor that uses a set of panoramic views of a 3D object which describe the position and orientation of the object's surface in 3D space. We obtain a panoramic view of a 3D object by projecting it to the lateral surface of a cylinder parallel to one of its three principal axes and centered at the centroid of the object. The object is projected to three perpendicular cylinders, each one aligned with one of its principal axes in order to capture the global shape of the object. For each projection we compute the corresponding 2D Discrete Fourier Transform as well as 2D Discrete Wavelet Transform. We further increase the retrieval performance by employing a local (unsupervised) relevance feedback technique that shifts the descriptor of an object closer to its cluster centroid in feature space. The effectiveness of the proposed 3D object retrieval methodology is demonstrated via an extensive consistent evaluation in standard benchmarks that clearly shows better performance against state-of-the-art 3D object retrieval methods.", "paper_title": "PANORAMA: A 3D Shape Descriptor Based on Panoramic Views for Unsupervised 3D Object Retrieval", "paper_id": "WOS:000277547600004"}