{"auto_keywords": [{"score": 0.03521864934012732, "phrase": "model_parameters"}, {"score": 0.03479054435572426, "phrase": "burst_shape"}, {"score": 0.00481495049065317, "phrase": "cortical_culture_growth"}, {"score": 0.004724708238414131, "phrase": "property_dependence"}, {"score": 0.004665483918844599, "phrase": "network_composition"}, {"score": 0.004463958296056236, "phrase": "large-scale_simulations"}, {"score": 0.0043527164193299574, "phrase": "network_formation"}, {"score": 0.004164644263639545, "phrase": "dissociated_cortical_cells"}, {"score": 0.00408654006336477, "phrase": "neuron_model"}, {"score": 0.0038365781437074017, "phrase": "virtual_cultures"}, {"score": 0.0036246643358397272, "phrase": "closed-loop_simulations"}, {"score": 0.0034461093496505127, "phrase": "detailed_analysis"}, {"score": 0.0030371471832258317, "phrase": "gross_network_structure"}, {"score": 0.002780025943393764, "phrase": "excitatory_cells"}], "paper_keywords": ["Cortical cultures", " Bursting", " Network development", " Dynamics"], "paper_abstract": "This paper describes large-scale simulations of growth, network formation, and behavior in cultures of dissociated cortical cells. A neuron model that incorporates synaptic facilitation/depression and neurite outgrowth/retraction was used to construct virtual cultures of 10,000 cells whose spiking behavior and evolution were investigated in closed-loop simulations. This approach allows us to perform detailed analysis of the effects of model parameters on burst shape and timing, their changes, and the interrelationship among these behaviors, gross network structure, and model parameters. We examined the effects of two parameters-network composition (fraction of excitatory cells) and neuron excitability (activity level corresponding to neurite outgrowth equilibrium)-on network structure and behavior. Our results suggest that much of the burst shape and timing observed in vitro can be explained by a model that includes only closed-loop neurite outgrowth and dynamic synapses; features such as LTP/LTD, random connectivity, long-distance connections, and detailed neurite topology are not necessary.", "paper_title": "A simple model of cortical culture growth: burst property dependence on network composition and activity", "paper_id": "WOS:000339719100004"}