{"auto_keywords": [{"score": 0.010612387000973441, "phrase": "wireless_sensor_networks"}, {"score": 0.009022454727557375, "phrase": "tracking_problem"}, {"score": 0.006183474210314704, "phrase": "tracking_time"}, {"score": 0.00468991337957911, "phrase": "promising_opportunity"}, {"score": 0.004449452743965974, "phrase": "important_applications"}, {"score": 0.00398370478688858, "phrase": "particular_type"}, {"score": 0.0028432828877281388, "phrase": "theoretical_upper_bounds"}, {"score": 0.0026689487424251907, "phrase": "sensor_nodes"}, {"score": 0.0025052769325080255, "phrase": "simulation_study"}, {"score": 0.002172701452347454, "phrase": "on-site_tracking_problem"}, {"score": 0.0021049977753042253, "phrase": "path_adaptive_nature"}], "paper_keywords": ["wireless sensor networks", " sensor nodes", " tracking", " on-site tracking", " mobile sink", " tracking time and energy"], "paper_abstract": "Wireless sensor networks present a promising opportunity for realizing many practical applications. Tracking is one of the important applications of these networks. Many approaches have been proposed in the literature to deal with the tracking problem. Recently, a particular type of tracking problem called on-site tracking has been introduced [15], [16]. On-site tracking has been characterized as the tracking in which the sink is eventually required to be present in the vicinity of the target, possibly to perform further actions. In this paper, first we propose two efficient onsite tracking algorithms. Then, we derive theoretical upper bounds for the tracking time and the number of messages generated by the sensor nodes during the tracking for our algorithms. Finally, we present a simulation study that we conducted to evaluate the performance of our algorithms. The results show that our algorithms are efficient as compared to the other existing methods that can solve the on-site tracking problem. In particular, the path adaptive nature of the sink in our algorithms allows the network to conserve the energy and the sink to reduce the tracking time.", "paper_title": "Path-adaptive on-site tracking in wireless sensor networks", "paper_id": "WOS:000235508800018"}