{"auto_keywords": [{"score": 0.046873047041285865, "phrase": "directory_structures"}, {"score": 0.00481495049065317, "phrase": "web_directories"}, {"score": 0.004566805735863274, "phrase": "cognitive_theory"}, {"score": 0.0044025116437190785, "phrase": "information_retrieval"}, {"score": 0.004296264970612285, "phrase": "empirical_results"}, {"score": 0.003817655499320344, "phrase": "card-sorting_method"}, {"score": 0.003771282384646587, "phrase": "enveloping_system"}, {"score": 0.003490343299449249, "phrase": "hierarchical_subject_categories_children"}, {"score": 0.0032833625797814474, "phrase": "twelve_groups"}, {"score": 0.003088617973198433, "phrase": "initial_terminology"}, {"score": 0.0029291801502381513, "phrase": "popular_directories"}, {"score": 0.002688781336915723, "phrase": "additional_cards"}, {"score": 0.002539550974361945, "phrase": "different_groups"}, {"score": 0.0025189177411152645, "phrase": "reasonable_consensus"}, {"score": 0.0024580159789774516, "phrase": "category_names"}, {"score": 0.0024281181691350085, "phrase": "existing_directories"}, {"score": 0.0022378620428620782, "phrase": "design_process"}, {"score": 0.0021049977753042253, "phrase": "content_structure"}], "paper_keywords": [""], "paper_abstract": "Children are increasingly using the Web. Cognitive theory tells us that directory structures are especially suited for information retrieval by children; however, empirical results show that they prefer keyword searching. One of the reasons for these findings could be that the directory structures and terminology are created by grown-ups. Using a card-sorting method and an enveloping system, we simulated the structure of a directory. Our goal was to try to understand what browsable, hierarchical subject categories children create when suggested terms are supplied and they are free to add or delete terms. Twelve groups of four children each (fourth and fifth graders) participated in our exploratory study. The initial terminology presented to the children was based on names of categories used in popular directories, in the sections on Arts, Television, Music, Cinema, and Celebrities. The children were allowed to introduce additional cards and change the terms appearing on the 61 cards. Findings show that the different groups reached reasonable consensus; the majority of the category names used by existing directories were acceptable by them and only a small minority of the terms caused confusion. Our recommendation is to include children in the design process of directories, not only in designing the interface but also in designing the content structure as well.", "paper_title": "Children as architects of web directories: An exploratory study", "paper_id": "WOS:000246379800012"}