{"auto_keywords": [{"score": 0.026700629644145, "phrase": "iso"}, {"score": 0.00481495049065317, "phrase": "enterprise_data_models"}, {"score": 0.004665162327051461, "phrase": "regulatory_requirements"}, {"score": 0.004602395776895036, "phrase": "share_data"}, {"score": 0.004055652445791872, "phrase": "next_generation"}, {"score": 0.0038590090616766434, "phrase": "shared_data"}, {"score": 0.0037052054802048707, "phrase": "automatic_and_accurate_machine_processing"}, {"score": 0.003573626511295813, "phrase": "inter-organizational_business_value"}, {"score": 0.0034780071331554003, "phrase": "ontology-based_enterprise_models"}, {"score": 0.003369669078274226, "phrase": "ontology-based_enterprise_model"}, {"score": 0.003235305151177897, "phrase": "formal_axioms"}, {"score": 0.003148709618042979, "phrase": "enterprise_facts"}, {"score": 0.002846206026920419, "phrase": "sarbanes-oxley"}, {"score": 0.0027616550517346066, "phrase": "model-based_proof"}, {"score": 0.0024440836179156593, "phrase": "quality_management"}, {"score": 0.0022224972632835416, "phrase": "enterprise_models"}, {"score": 0.0021049977753042253, "phrase": "business_analytics_problems"}], "paper_keywords": ["enterprise modeling", " ontologies", " quality management", " ISO 9000", " regulatory requirements"], "paper_abstract": "Sharing data between organizations is challenging because it is difficult to ensure that those consuming the data accurately interpret it. The promise of the next generation WWW, the semantic Web, is that semantics about shared data will be represented in ontologies and available for automatic and accurate machine processing of data. Thus, there is inter-organizational business value in developing applications that have ontology-based enterprise models at their core. In an ontology-based enterprise model, business rules and definitions are represented as formal axioms, which are applied to enterprise facts to automatically infer facts not explicitly represented. If the proposition to be inferred is a requirement from, say, ISO 9000 or Sarbanes-Oxley, inference constitutes a model-based proof of compliance. In this paper, we detail the development and application of the TOVE ISO 9000 Micro-Theory, a model of ISO 9000 developed using ontologies for quality management (measurement, traceability, and quality management system ontologies). In so doing, we demonstrate that when enterprise models are developed using ontologies, they can be leveraged to support business analytics problems - in particular, compliance evaluation - and are sharable.", "paper_title": "How to build enterprise data models to achieve compliance to standards or regulatory requirements (and share data).", "paper_id": "WOS:000246741400003"}