{"auto_keywords": [{"score": 0.005765994249332767, "phrase": "private_data"}, {"score": 0.00481495049065317, "phrase": "extended_static-information-flow_analysis"}, {"score": 0.004655285779819366, "phrase": "private_user_information"}, {"score": 0.004577440795549049, "phrase": "existing_mobile_platforms"}, {"score": 0.004444317282171449, "phrase": "private_user_data"}, {"score": 0.0040334640350288, "phrase": "user-aware-privacy-control_approach"}, {"score": 0.0036450381529042103, "phrase": "tamper_analysis"}, {"score": 0.0034944094552943, "phrase": "output_channels"}, {"score": 0.0034504423179340738, "phrase": "flow_information"}, {"score": 0.003378385493203297, "phrase": "default_settings"}, {"score": 0.0030917675863699925, "phrase": "touchdevelop"}, {"score": 0.002914288956035066, "phrase": "mobile_devices"}, {"score": 0.0025674490885184173, "phrase": "access-granting_choices"}, {"score": 0.002419995316129757, "phrase": "user_survey"}], "paper_keywords": ["Mobile Application", " Privacy Control", " Information Flow Analysis", " Static Analysis"], "paper_abstract": "Applications in mobile marketplaces may leak private user information without notification. Existing mobile platforms provide little information on how applications use private user data, making it difficult for experts to validate applications and for users to grant applications access to their private data. We propose a user-aware-privacy-control approach, which reveals how private information is used inside applications. We compute static information flows and classify them as safe/unsafe based on a tamper analysis that tracks whether private data is obscured before escaping through output channels. This flow information enables platforms to provide default settings that expose private data for only safe flows, thereby preserving privacy and minimizing decisions required from users. We build our approach into TouchDevelop, an application-creation environment that allows users to write scripts on mobile devices and install scripts published by other users. We evaluate our approach by studying 546 scripts published by 194 users, and the results show that our approach effectively reduces the need to make access-granting choices to only 10.1 % (54) of all scripts. We also conduct a user survey that involves 50 TouchDevelop users to assess the effectiveness and usability of our approach. The results show that 90 % of the users consider our approach useful in protecting their privacy, and 54 % prefer our approach over other privacy-control approaches.", "paper_title": "User-aware privacy control via extended static-information-flow analysis", "paper_id": "WOS:000357651200003"}