{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "evaluation_frameworks"}, {"score": 0.049648703742940926, "phrase": "health_information_systems"}, {"score": 0.00418595288276353, "phrase": "healthcare_delivery"}, {"score": 0.0040010534672646775, "phrase": "health_informatics"}, {"score": 0.003965061486705487, "phrase": "information_systems"}, {"score": 0.003638823482920949, "phrase": "critical_appraisal"}, {"score": 0.0036060781902674207, "phrase": "selected_his"}, {"score": 0.003148709618042979, "phrase": "increasing_number"}, {"score": 0.0031203609829058587, "phrase": "evaluation_studies"}, {"score": 0.0029959082125682918, "phrase": "human_and_organizational_issues"}, {"score": 0.0028505007899807446, "phrase": "subjectivist_approach"}, {"score": 0.0027867539356701302, "phrase": "current_evaluation_methods"}, {"score": 0.002687702958515561, "phrase": "different_aspects"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ireland_ltd."}], "paper_keywords": ["information systems", " health information systems", " evaluation", " human factors", " organizational factors"], "paper_abstract": "Background and purpose: Evaluation of health information systems (HIS) enables the assessment of the extent to which HIS are fulfilling their objectives in supporting the services of healthcare delivery. This paper presents an overview of evaluation in health informatics and information systems. Methods: Literature review on discourses, dimensions and methods of HIS and IS evaluation. A critical appraisal of selected HIS and IS evaluation frameworks is undertaken in order to identify HIS evaluation dimensions and measures. The frameworks are compared based on their inclusion of human, organizational and technological factors. Results: We found that an increasing number of evaluation studies deal with two distinct trends of HIS: one considers human and organizational issues and the other is concerned with the employment of a subjectivist approach. Our review indicates that current evaluation methods complement each other in that they evaluate different aspects of HIS and they can be improved upon. Conclusions: Evaluation is complex; it is easy to measure many things but not necessarily the right ones. Nevertheless, it is possible to consider, a HIS evaluation framework with more comprehensive and specific measures that would incorporate technological, human and organizational issues to facilitate HIS evaluation. (C) 2007 Elsevier Ireland Ltd. All rights reserved.", "paper_title": "Investigating evaluation frameworks for health information systems", "paper_id": "WOS:000256178700002"}