{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "hospital-based_nurse_educators"}, {"score": 0.01542604337087929, "phrase": "online_learning_community"}, {"score": 0.00943144051778619, "phrase": "online_community"}, {"score": 0.00454725669814484, "phrase": "prime_position"}, {"score": 0.004489810932879285, "phrase": "mentor_future_nurse_leaders"}, {"score": 0.0040298010803060495, "phrase": "learning_community"}, {"score": 0.003204841443605308, "phrase": "exemplary_leadership_practices"}, {"score": 0.0025810006125483835, "phrase": "leadership_development"}, {"score": 0.0024372021710656585, "phrase": "structured_curriculum"}, {"score": 0.0022722584151582616, "phrase": "leadership_stories"}, {"score": 0.0021049977753042253, "phrase": "model_exemplary_leadership_practices_and_mentor_our_nurse_leaders"}], "paper_keywords": ["Community", " Distance learning", " Health educators", " Leadership", " Teaching"], "paper_abstract": "Hospital-based nurse educators are in a prime position to mentor future nurse leaders; however, they need to first develop their own leadership practices. The goal was to establish a learning community where hospital-based nurse educators could develop their own nursing leadership practices within an online environment that included teaching, cognitive, and social presence. Using a pretest/posttest-only nonexperimental design, 35 nurse educators from three Canadian provinces engaged in a 12-week online learning community via a wiki where they learned about exemplary leadership practices and then shared stories about their own leadership practices. Nurse educators significantly increased their own perceived leadership practices after participation in the online community, and teaching, cognitive, and social presence was determined to be present in the online community. It was concluded that leadership development can be enhanced in an online learning community using a structured curriculum, multimedia presentations, and the sharing and analysis of leadership stories. Educators who participated should now be better equipped to role model exemplary leadership practices and mentor our nurse leaders of the future.", "paper_title": "Developing Leadership Practices in Hospital-Based Nurse Educators in an Online Learning Community", "paper_id": "WOS:000330539500006"}