{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "tri-class_svm."}, {"score": 0.00464811139983244, "phrase": "multi-class_classification_problems"}, {"score": 0.0032989853590079153, "phrase": "decomposition_problem"}, {"score": 0.0030431198971423937, "phrase": "proposed_machine"}, {"score": 0.002952356518921907, "phrase": "third_class"}, {"score": 0.002821247621250663, "phrase": "remaining_training_patterns"}, {"score": 0.0027788478707700274, "phrase": "multi-class_problem"}, {"score": 0.0025119730908615104, "phrase": "precedent_structure"}, {"score": 0.0024247382451294255, "phrase": "multi-classification_problems"}, {"score": 0.0023405257495466352, "phrase": "final_machine"}, {"score": 0.0023053339328456234, "phrase": "ordinal_regression"}, {"score": 0.0022478501955483007, "phrase": "decomposition_procedure"}, {"score": 0.002202894673025544, "phrase": "experimental_results"}, {"score": 0.0021049977753042253, "phrase": "new_tri-class_sv_machine"}], "paper_keywords": ["bi-classifier", " multi-classification", " ordinal regression", " Support Vector Machine"], "paper_abstract": "The standard form for dealing with multi-class classification problems when bi-classifiers are used is to consider a two-phase (decomposition, reconstruction) training scheme. The most popular decomposition procedures are pairwise coupling (one versus one, 1-v-1), which considers a learning machine for each Pair of classes, and the one-versus-all scheme (one versus all, 1-v-r), which takes into consideration each class versus the remaining classes. In this article a 1-v-1 tri-class Support Vector Machine (SVM) is presented. The expansion of the architecture of this machine into three categories specifically addresses the decomposition problem of how to prevent the loss of information which occurs in the usual 1-v-1 training procedure. The proposed machine, by means of a third class, allows all the information to be incorporated into the remaining training patterns when a multi-class problem is considered in the form of a 1-v-1 decomposition. Three general structures are presented where each improves some features from the precedent structure. In order to deal with multi-classification problems, it is demonstrated that the final machine proposed allows ordinal regression as a form of decomposition procedure. Examples and experimental results are presented which illustrate the performance of the new tri-class SV machine.", "paper_title": "Multi-classification by using tri-class SVM", "paper_id": "WOS:000235318300006"}