{"auto_keywords": [{"score": 0.040730746549372226, "phrase": "vector_field"}, {"score": 0.02282825392678525, "phrase": "piecewise_linear_surfaces"}, {"score": 0.010612387000973441, "phrase": "higher-order_singularities"}, {"score": 0.004518442937844318, "phrase": "non-trivial_problem"}, {"score": 0.004346266306175988, "phrase": "complete_interpolation_scheme"}, {"score": 0.004315670715009727, "phrase": "vector_fields"}, {"score": 0.004285289574869884, "phrase": "arbitrary_triangulated_surfaces"}, {"score": 0.0042102651938187114, "phrase": "arbitrary_singularities"}, {"score": 0.004007083686875716, "phrase": "facet-based_\"encoding"}, {"score": 0.003720479367430766, "phrase": "facet_edge"}, {"score": 0.0029670381308395505, "phrase": "facet_graph"}, {"score": 0.0028740705307540317, "phrase": "nielson's_side-vertex_scheme"}, {"score": 0.002793874145713024, "phrase": "entire_surface"}, {"score": 0.0025036399134110822, "phrase": "vertex-based_linear_schemes"}, {"score": 0.0022835460368487233, "phrase": "interpolation_scheme"}, {"score": 0.002259426425685765, "phrase": "gpu-accelerated_algorithm"}, {"score": 0.0022355610034493225, "phrase": "lic-based_visualization"}, {"score": 0.002211947103318718, "phrase": "so-defined_vector_fields"}, {"score": 0.002180848602315088, "phrase": "image_space"}, {"score": 0.0021049977753042253, "phrase": "curved_surfaces"}], "paper_keywords": ["vector field visualization", " higher-order singularities", " line integral convolution", " GPU"], "paper_abstract": "Accurately representing higher-order singularities of vector fields defined on piecewise linear surfaces is a non-trivial problem. In this work, we introduce a concise yet complete interpolation scheme of vector fields on arbitrary triangulated surfaces. The scheme enables arbitrary singularities to be represented at vertices. The representation can be considered as a facet-based \"encoding\" of vector fields on piecewise linear surfaces. The vector field is described in polar coordinates over each facet, with a facet edge being chosen as the reference to define the angle. An integer called the period jump is associated to each edge of the triangulation to remove the ambiguity when interpolating the direction of the vector field between two facets that share an edge. To interpolate the vector field, we first linearly interpolate the angle of rotation of the vectors along the edges of the facet graph. Then, we use a variant of Nielson's side-vertex scheme to interpolate the vector field over the entire surface. With our representation, we remove the bound imposed on the complexity of singularities that a vertex can represent by its connectivity. This bound is a limitation generally exists in vertex-based linear schemes. Furthermore, using our data structure, the index of a vertex of a vector field can be combinatorily determined. We show the simplicity of the interpolation scheme with a GPU-accelerated algorithm for a LIC-based visualization of the so-defined vector fields, operating in image space. We demonstrate the algorithm applied to various vector fields on curved surfaces.", "paper_title": "Representing higher-order singularities in vector fields on piecewise linear surfaces", "paper_id": "WOS:000241383300084"}