{"auto_keywords": [{"score": 0.044710201642630516, "phrase": "ld"}, {"score": 0.023226964040468572, "phrase": "visual-motor_skills"}, {"score": 0.016514674751630404, "phrase": "msa"}, {"score": 0.006968984234874545, "phrase": "ld."}, {"score": 0.006210604592295955, "phrase": "vr_task"}, {"score": 0.004727995968069753, "phrase": "hapto-virtual_reality_tool"}, {"score": 0.0046993598473345395, "phrase": "bender-gestalt"}, {"score": 0.004656729019170898, "phrase": "previous_investigations"}, {"score": 0.004614483128885678, "phrase": "post-secondary_adult_students"}, {"score": 0.004395532072377065, "phrase": "written_expression"}, {"score": 0.004355645393953418, "phrase": "academic_achievement"}, {"score": 0.004329254684453746, "phrase": "intervention_strategies"}, {"score": 0.00425103400920119, "phrase": "assistive_computer-based_technologies"}, {"score": 0.0034887749053459584, "phrase": "present_study"}, {"score": 0.00342568771304873, "phrase": "hapto-visual_virtual_reality_motor_skills_assessment"}, {"score": 0.0033637374697995616, "phrase": "visual-motor_functioning"}, {"score": 0.0032629585038738856, "phrase": "preliminary_step"}, {"score": 0.003194209418929854, "phrase": "impaired_visual-motor_skills"}, {"score": 0.002933354468864442, "phrase": "msa_tool"}, {"score": 0.0025346609543667933, "phrase": "bg"}, {"score": 0.002466139325703204, "phrase": "significant_differences"}, {"score": 0.002421499421848063, "phrase": "bender-gestalt_scores"}, {"score": 0.0023849158959156026, "phrase": "video_game"}, {"score": 0.0022508572821818124, "phrase": "motor_function"}, {"score": 0.0021049977753042253, "phrase": "problem-solving_ability"}], "paper_keywords": ["Virtual reality", " Haptics", " Learning disability", " Visual-motor skills", " Bender-Gestalt test"], "paper_abstract": "Previous investigations conducted on post-secondary adult students with learning disabilities (LD) suggest that deficits in visual-motor skills contribute to difficulties in written expression which impact academic achievement. Intervention strategies for individuals with LD include assistive computer-based technologies (ATs) to compensate for or maximize performance. However, research fails to assess the impact of ATs on performance, learning, and motivation of students with LD. Also, one of the limitations of ATs is that they cannot be used for assessment and training and there are very few methods to assess or train visual-motor skills in this population. The present study explores the usefulness of a hapto-visual virtual reality motor skills assessment (MSA) device for visual-motor functioning in adults with and without LD. This is a preliminary step of developing an intervention to improve impaired visual-motor skills in adults with LD. A sample of 22 male and female university students with and without LD had their visual-motor skills pretested using a standard paper-and-pencil Bender-Gestalt (BG) test and were compared according to their performance on the MSA tool. We hypothesized that our LD participants' performance would be significantly lower than our control participants on the VR task in terms of number of errors and speed. Results showed that participants without LD performed better and more rapidly on the VR task than participants with LD. There were no correlations between the BG and MSA performance. We did not find significant differences between the groups on the Bender-Gestalt scores, previous experience with video game, arousal, and mood. Our results suggest that a novel 3D virtual reality tool such as the MSA can potentially discriminate motor function of people with and without LD; however, the difference between both may also be due to a lack of problem-solving ability in LD.", "paper_title": "Learning disabilities and visual-motor skills; comparing assessment from a hapto-virtual reality tool and Bender-Gestalt test", "paper_id": "WOS:000331652400005"}