{"auto_keywords": [{"score": 0.043345901905100806, "phrase": "large_number"}, {"score": 0.03327620350569449, "phrase": "incentive_mechanisms"}, {"score": 0.00481495049065317, "phrase": "incentive_techniques"}, {"score": 0.004761494044422926, "phrase": "mobile_crowd"}, {"score": 0.003916098498242888, "phrase": "sufficient_samples"}, {"score": 0.003601235776892337, "phrase": "participatory_sensing"}, {"score": 0.0030113280682863234, "phrase": "cs_effort"}, {"score": 0.0028795712616923462, "phrase": "design_constraints"}, {"score": 0.002847540262784593, "phrase": "minimum_requirements"}, {"score": 0.002800158709933889, "phrase": "incentive_mechanism"}, {"score": 0.0027695700368100024, "phrase": "cs"}, {"score": 0.00269263690712392, "phrase": "design_constrains"}, {"score": 0.0023807981747706376, "phrase": "cs_incentive_mechanisms"}, {"score": 0.002164738347530834, "phrase": "new_types"}], "paper_keywords": ["Crowd sensing (CS)", " games", " incentives", " reverse auction"], "paper_abstract": "Crowd sensing (CS) is an approach to collecting many samples of a phenomena of interest by distributing the sampling across a large number of individuals. While any one individual may not provide sufficient samples, aggregating samples across many individuals provides high-quality, high-coverage measurements of the phenomena. Thus, for participatory sensing to be successful, one must motivate a large number of individuals to participate. In this work, we review a variety of incentive mechanisms that motivate people to contribute to a CS effort. We then establish a set of design constraints or minimum requirements that any incentive mechanism for CS must have. These design constrains are then used as metrics to evaluate those approaches and determine their advantages and disadvantages. We also contribute a taxonomy of CS incentive mechanisms and show how current systems fit within this taxonomy. We conclude with the identification of new types of incentive mechanisms that require further investigation.", "paper_title": "A Survey of Incentive Techniques for Mobile Crowd Sensing", "paper_id": "WOS:000373098700003"}