{"auto_keywords": [{"score": 0.04868684268038372, "phrase": "digital_photos"}, {"score": 0.012421384716028864, "phrase": "physical_memorabilia"}, {"score": 0.007617267689809504, "phrase": "collocated_digital_photo-sharing"}, {"score": 0.007475967200400038, "phrase": "print_photos"}, {"score": 0.007128897823958276, "phrase": "souvenirs"}, {"score": 0.005628588658601683, "phrase": "family_members"}, {"score": 0.004087963788286157, "phrase": "e-mail_gift-giving"}, {"score": 0.003969018740062018, "phrase": "web_publishing"}, {"score": 0.003781772207256374, "phrase": "personal_accounts"}, {"score": 0.0037615180375561805, "phrase": "desktop_computers"}, {"score": 0.003731339232636914, "phrase": "home_offices"}, {"score": 0.0035648266669315943, "phrase": "serendipitous_photo-sharing"}, {"score": 0.003470358620464986, "phrase": "photo_collections"}, {"score": 0.003378385493203297, "phrase": "small_screens"}, {"score": 0.0033512702352060356, "phrase": "uncomfortable_viewing_setting"}, {"score": 0.003167441161387607, "phrase": "social_and_collocated_digital_photo-sharing"}, {"score": 0.003100085797251317, "phrase": "contextual_interviews"}, {"score": 0.0028676739670326426, "phrase": "family_events"}, {"score": 0.00266693888510356, "phrase": "social_instrument"}, {"score": 0.0026242699269026204, "phrase": "family_member"}, {"score": 0.0025822818714499795, "phrase": "particular_photo-sets"}, {"score": 0.0025478041555687036, "phrase": "family_member_call"}, {"score": 0.002480220161640831, "phrase": "physical_memento"}, {"score": 0.002363044095528996, "phrase": "home's_large-format_television_screen"}, {"score": 0.002306543826130521, "phrase": "household_reactions"}, {"score": 0.0022880115261460212, "phrase": "early_version"}, {"score": 0.0021857667493036786, "phrase": "real_practices"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Collocated digital photo-sharing", " Physical memorabilia", " Tagging"], "paper_abstract": "The uptake of digital photos vs. print photos has altered the practice of photo-sharing. Print photos are easy to share within the home, but much harder to share outside of it. The opposite is true of digital photos. People easily share digital photos outside the home, e.g., to family and friends by e-mail gift-giving, and to social networks and the broader public by web publishing. Yet within the home, collocated digital photo-sharing is harder, primarily because digital photos are typically stored on personal accounts in desktop computers located in home offices. This leads to several consequences. (1) The invisibility of digital photos implies few opportunities for serendipitous photo-sharing. (2) Access control and navigation issues inhibit family members from retrieving photo collections. (3) Photo viewing is compromised as digital photos are displayed on small screens in an uncomfortable viewing setting. To mitigate some of these difficulties, we explore how physical memorabilia collected by family members can create opportunities that encourage social and collocated digital photo-sharing. First, we studied (via contextual interviews with 20 households) how families currently practice photo-sharing and how they keep memorabilia. We identified classes of memorabilia that can serve as memory triggers to family events, trips, and times when people took photos. Second, we designed SOUVENIRS, a photo-viewing system that exploits memorabilia as a social instrument. Using SOUVENIRS, a family member can meaningfully associate physical memorabilia with particular photo-sets. Later, any family member call begin their story-telling with others through the physical memento, and then enrich the story by displaying its associated photos simply by moving the memento close to the home's large-format television screen. Third, we reexamined our design premises by evoking household reactions to an early version of SOUVENIRS. Based on these interviews, we redesigned SOUVENIRS to better reflect the preferences and real practices of photo and memorabilia use in the home. (C) 2009 Elsevier Ltd. All rights reserved.", "paper_title": "Using physical memorabilia as opportunities to move into collocated digital photo-sharing", "paper_id": "WOS:000272111600008"}