{"auto_keywords": [{"score": 0.046081391722127746, "phrase": "wireless_mesh_networks"}, {"score": 0.043076450441790474, "phrase": "mission_site"}, {"score": 0.00481495049065317, "phrase": "mission_sites"}, {"score": 0.004443482801729777, "phrase": "specialized_content_distribution_application"}, {"score": 0.004355163162038354, "phrase": "new_mission"}, {"score": 0.004240116703465252, "phrase": "fire_alarm"}, {"score": 0.004155822339559211, "phrase": "storage_nodes"}, {"score": 0.003659389341948856, "phrase": "low_latency"}, {"score": 0.0035270425911920595, "phrase": "total_latency_experienced"}, {"score": 0.003445316481824611, "phrase": "push_delay"}, {"score": 0.0032005497177523025, "phrase": "delay_component"}, {"score": 0.0030744279865523036, "phrase": "hop_distance"}, {"score": 0.0026088355715432523, "phrase": "storage_node_assignment"}, {"score": 0.002582731586309754, "phrase": "total_latency-based_cost"}, {"score": 0.0025313026089662165, "phrase": "simple_model"}, {"score": 0.002320938467640111, "phrase": "np"}, {"score": 0.0022359775196858765, "phrase": "efficient_algorithms"}], "paper_keywords": ["Data dissemination", " Mission site", " Wireless mesh networks", " Cache", " Storage node assignment"], "paper_abstract": "In many situations and domains it is important to deliver information to personnel as they work in the field. We consider a specialized content distribution application in wireless mesh networks. When a new mission arrives-for example, when a fire alarm sounds-data is pushed to storage nodes at the mission site where it may be retrieved locally by responding personnel (e.g., police, firefighters, paramedics, government officials, and the media). It is important that information is available at low latency, when requested or pulled by the personnel. The total latency experienced will be a combination of the push delay (if the personnel arrive at the mission site before all the data can be pushed), and the pull delay. Each delay component will in turn be a function of (1) the hop distance traveled by the data when pushed or pulled and (2) any congestion on the links. In this paper, we define algorithms and protocols that trade-off the push and pull latencies depending on the type of application. Our goal is to choose a storage node assignment minimizing the total latency-based cost. We start with a simple model in which cost is a function of distance, and then extend the model, explicitly taking congestion into account. Since the problem is NP-hard even to approximate, our focus is on developing efficient algorithms and distributed protocols that can be easily deployed in wireless mesh networks. In NS2 simulations, we find that our heuristic algorithms achieve, on average, a cost within at most 15% of the optimum.", "paper_title": "Proactive data dissemination to mission sites", "paper_id": "WOS:000308427200002"}