{"auto_keywords": [{"score": 0.04726673405217005, "phrase": "massive_amounts"}, {"score": 0.03781977122883892, "phrase": "database_management_systems"}, {"score": 0.00481495049065317, "phrase": "recursive_queries"}, {"score": 0.004766683200410046, "phrase": "database_and_logic_programming_systems"}, {"score": 0.004309725894724034, "phrase": "existing_proposals"}, {"score": 0.003152531962718477, "phrase": "complex_reasoning_tasks"}, {"score": 0.002878785759716458, "phrase": "new_system"}, {"score": 0.0025892330566358503, "phrase": "thorough_experimental_analysis"}, {"score": 0.0023642842046859274, "phrase": "classical_deductive_problems"}, {"score": 0.002282169906148765, "phrase": "xsb"}, {"score": 0.0022592381048194676, "phrase": "smodels"}, {"score": 0.0021049977753042253, "phrase": "even_the_commercial_database_systems"}], "paper_keywords": ["deductive database systems", " answer set programming/declarative logic programming", " recursive queries", " benchmarks"], "paper_abstract": "This article considers the problem of reasoning on massive amounts of (possibly distributed) data. Presently, existing proposals show some limitations: (i) the quantity of data that can be handled contemporarily is limited, because reasoning is generally carried out in main-memory; (ii) the interaction with external (and independent) Database Management Systems is not trivial and, in several cases, not allowed at all; and (iii) the efficiency of present implementations is still not sufficient for their utilization in complex reasoning tasks involving massive amounts of data. This article provides a contribution in this setting; it presents a new system, called DLV(DB), which aims to solve these problems. Moreover, it reports the results of a thorough experimental analysis we have carried out for comparing our system with several state-of-the-art systems (both logic and databases) on some classical deductive problems; the other tested systems are LDL++, XSB, Smodels, and three top-level commercial Database Management Systems. DLV(DB) significantly outperforms even the commercial database systems on recursive queries.", "paper_title": "Experimenting with recursive queries in database and logic programming systems", "paper_id": "WOS:000254430200001"}