{"auto_keywords": [{"score": 0.04915207774681705, "phrase": "recommender_systems"}, {"score": 0.02813909195181139, "phrase": "offline_experiments"}, {"score": 0.00481495049065317, "phrase": "accuracy_evaluation_metrics"}, {"score": 0.004768104290288521, "phrase": "recommendation_tasks"}, {"score": 0.004518442937844318, "phrase": "research_community"}, {"score": 0.003940122359770492, "phrase": "research_perspective"}, {"score": 0.0038074544783102226, "phrase": "practical_view"}, {"score": 0.0034355662264234864, "phrase": "standard_way"}, {"score": 0.0032714270066711835, "phrase": "algorithms_offline"}, {"score": 0.003054681986032532, "phrase": "recommendation_algorithms"}, {"score": 0.002783250284824728, "phrase": "different_algorithm"}, {"score": 0.0026762874092443197, "phrase": "proper_construction"}, {"score": 0.0024264776194357993, "phrase": "appropriate_well_known_evaluation_metrics"}, {"score": 0.0023104373174118458, "phrase": "improper_evaluation"}, {"score": 0.0022107428653358715, "phrase": "improper_algorithm"}], "paper_keywords": ["recommender systems", " collaborative filtering", " statistical analysis", " comparative studies"], "paper_abstract": "Recommender systems are now popular both commercially and in the research community, where many algorithms have been suggested for providing recommendations. These algorithms typically perform differently in various domains and tasks. Therefore, it is important from the research perspective, as well as from a practical view, to be able to decide on an algorithm that matches the domain and the task of interest. The standard way to make such decisions is by comparing a number of algorithms offline using some evaluation metric. Indeed, many evaluation metrics have been suggested for comparing recommendation algorithms. The decision on the proper evaluation metric is often critical, as each metric may favor a different algorithm. In this paper we review the proper construction of offline experiments for deciding on the most appropriate algorithm. We discuss three important tasks of recommender systems, and classify a set of appropriate well known evaluation metrics for each task. We demonstrate how using an improper evaluation metric can lead to the selection of an improper algorithm for the task of interest. We also discuss other important considerations when designing offline experiments.", "paper_title": "A Survey of Accuracy Evaluation Metrics of Recommendation Tasks", "paper_id": "WOS:000273877300007"}