{"auto_keywords": [{"score": 0.04768967676542323, "phrase": "mobile_node"}, {"score": 0.01872654180268243, "phrase": "macro_mobility_handover"}, {"score": 0.00874971912968442, "phrase": "proposed_scheme"}, {"score": 0.008152053165855853, "phrase": "ip_packet"}, {"score": 0.008025192842110188, "phrase": "handover_latency"}, {"score": 0.004261998281333649, "phrase": "real-time_multimedia_application_service"}, {"score": 0.003832198214757852, "phrase": "different_map_domain"}, {"score": 0.003626626504149897, "phrase": "new_rcoa"}, {"score": 0.0035981701736904495, "phrase": "lcoa"}, {"score": 0.0035141291835319682, "phrase": "new_map"}, {"score": 0.003486552993183168, "phrase": "ha."}, {"score": 0.003445591238183763, "phrase": "address_registration"}, {"score": 0.003419337606071675, "phrase": "map"}, {"score": 0.0033917452684432635, "phrase": "ha"}, {"score": 0.0031100973266506163, "phrase": "handover_latency_and_packet_loss"}, {"score": 0.00292003791296245, "phrase": "seamless_service"}, {"score": 0.0028857130140890787, "phrase": "packet_loss"}, {"score": 0.002752390133272192, "phrase": "fast_handover_technology"}, {"score": 0.0026986685585382347, "phrase": "map's_characteristics"}, {"score": 0.002494039334114861, "phrase": "edge_access_routers"}, {"score": 0.0023415390666563177, "phrase": "macro_mobility"}, {"score": 0.002224510044064184, "phrase": "cost_analysis_comparison"}, {"score": 0.0021049977753042253, "phrase": "total_cost"}], "paper_keywords": [""], "paper_abstract": "MIPv6 provides the L3 connectivity when the IPv6 mobile node moves between subnets. Nevertheless, the mobile node cannot receive IP packet because of the handover latency. The handover latency is not efficient to provide the real-time multimedia application service. Notable protocols of the extensions of MIPv6 are FMIPv6 and HMIPv6. In HMIPv6, if the mobile node moves from one access router to another in the different MAP domain, such a movement is called macro mobility handover, then the mobile node creates a new RCoA and LCoA and performs registration with the new MAP and HA. Until the address registration with MAP and HA complete, the mobile node cannot receive IP packet. Therefore, we need to execute the macro mobility handover efficiently and reduce the handover latency and packet loss. We propose a method to perform the macro mobility handover efficiently in HMIPv6. To provide seamless service and minimize packet loss when the mobile node performs the macro mobility handover, we will adjust the fast handover technology of FMIPv6 to the MAP's characteristics in the proposed scheme. To reduce the handover latency and packet loss, we use a tunnel between the edge access routers and perform the L3 handover earlier before the L2 handover. We compare the procedure of the macro mobility handover of the proposed scheme with the original HMIPv6 by means of using the cost analysis comparison. We observe that the proposed scheme can be reduced the 82% of the total cost of the macro mobility handover of the original HMIPv6.", "paper_title": "A macro mobility handover performance improvement scheme for HMIPv6", "paper_id": "WOS:000237646100043"}