{"auto_keywords": [{"score": 0.04804050199975018, "phrase": "mobile_guide"}, {"score": 0.0045108906244892165, "phrase": "novel_mobile_guides"}, {"score": 0.0038234714417849495, "phrase": "visit_experience"}, {"score": 0.003581797255879607, "phrase": "actual_behavior"}, {"score": 0.003459191419478298, "phrase": "field_study"}, {"score": 0.00321236577162671, "phrase": "mobile_multimedia_location-aware_guide"}, {"score": 0.00303553181618577, "phrase": "electronic_aid"}, {"score": 0.0029701328654852246, "phrase": "visitors'_behavior"}, {"score": 0.0024950747439601863, "phrase": "empirical_evidence"}, {"score": 0.002462664392109308, "phrase": "decoupling_effect"}, {"score": 0.0021049977753042253, "phrase": "negative_social_effect"}], "paper_keywords": ["mobile museum guide", " museum visit behavior", " group behavior"], "paper_abstract": "Many museums offer their visitors the use of a mobile guide to enhance their visit experience. Novel mobile guides have the potential to provide personalized, context-aware, rich content to museum visitors. However, they might also affect the way visitors behave and interact. While many studies have examined novel features that these guides can provide to enhance the visit experience, few have looked into the impact that a mobile guide might have on the actual behavior of the visitors. We describe a field study conducted with 403 actual museum visitors, over a period of 10 months comparing behaviors of visitors who used a mobile multimedia location-aware guide during their visit and that of visitors who did not use any electronic aid. Results indicate that visitors' behavior was altered considerably when using a mobile guide. Visitors using a mobile guide visited the museum longer and were attracted to and spent more time at exhibits where they could get information from the guide. In addition, we provide empirical evidence of the decoupling effect that a mobile guide has on pairs of visitors. Using a mobile guide caused visitors to reduce proximity and to interact less with their fellow group members. Finally, we discuss what may be done to reduce this negative social effect.", "paper_title": "The Influence of a Location-Aware Mobile Guide on Museum Visitors' Behavior", "paper_id": "WOS:000325765200002"}