{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "distance-based_range_search"}, {"score": 0.047728719573080294, "phrase": "query_issuer"}, {"score": 0.004096082254543022, "phrase": "positioning_devices"}, {"score": 0.003853251284913932, "phrase": "real_world"}, {"score": 0.00374399358035391, "phrase": "existing_approaches"}, {"score": 0.0037171648669537287, "phrase": "exact_databases"}, {"score": 0.003611751858608048, "phrase": "uncertain_scenario"}, {"score": 0.0034967186553667715, "phrase": "distance-based_range_query"}, {"score": 0.0034343965063429447, "phrase": "uncertain_databases"}, {"score": 0.0032075033252058835, "phrase": "confidence_guarantees"}, {"score": 0.003150319576043518, "phrase": "topological_relationships"}, {"score": 0.0031277316566463978, "phrase": "uncertain_objects"}, {"score": 0.0030609320300175953, "phrase": "six_cases"}, {"score": 0.0030171910207671205, "phrase": "probability_evaluation"}, {"score": 0.0028792911886505526, "phrase": "monte-carlo_method"}, {"score": 0.0028076592725295646, "phrase": "time_cost"}, {"score": 0.00278752137116301, "phrase": "uniform_uncertainty_distribution"}, {"score": 0.0026505322540093783, "phrase": "gaussian_distribution"}, {"score": 0.0026315183701883437, "phrase": "acceptable_errors"}, {"score": 0.0025660347613972573, "phrase": "pudr_query"}, {"score": 0.0024311346712789553, "phrase": "spatial_pruning"}, {"score": 0.0024136908511423875, "phrase": "probabilistic_pruning_techniques"}, {"score": 0.0023791769068748194, "phrase": "search_space"}, {"score": 0.0022298571016688335, "phrase": "query_results"}, {"score": 0.0022058958906038466, "phrase": "extensive_empirical_study"}], "paper_keywords": ["moving objects", " uncertainty", " distance-based range query"], "paper_abstract": "Distance-based range search is crucial in many real applications. In particular, given a database and a query issuer, a distance-based range search retrieves all the objects in the database whose distances from the query issuer are less than or equal to a given threshold. Often, due to the accuracy of positioning devices, updating protocols or characteristics of applications (for example, location privacy protection), data obtained from real world are imprecise or uncertain. Therefore, existing approaches over exact databases cannot be directly applied to the uncertain scenario. In this paper, we redefine the distance-based range query in the context of uncertain databases, namely the probabilistic uncertain distance-based range (PUDR) queries, which obtain objects with confidence guarantees. We categorize the topological relationships between uncertain objects and uncertain search ranges into six cases and present the probability evaluation in each case. It is verified by experiments that our approach outperform Monte-Carlo method utilized in most existing work in precision and time cost for uniform uncertainty distribution. This approach approximates the probabilities of objects following other practical uncertainty distribution, such as Gaussian distribution with acceptable errors. Since the retrieval of a PUDR query requires accessing all the objects in the databases, which is quite costly, we propose spatial pruning and probabilistic pruning techniques to reduce the search space. Two metrics, false positive rate and false negative rate are introduced to measure the qualities of query results. An extensive empirical study has been conducted to demonstrate the efficiency and effectiveness of our proposed algorithms under various experimental settings.", "paper_title": "Uncertain Distance-Based Range Queries over Uncertain Moving Objects", "paper_id": "WOS:000281918000009"}