{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "adjustment_coefficients"}, {"score": 0.004769182299692333, "phrase": "cointegrated_systems"}, {"score": 0.004418287966422041, "phrase": "cointegrated_vars"}, {"score": 0.004334657104697421, "phrase": "recursive_and_rolling_techniques"}, {"score": 0.004293434614435972, "phrase": "mis-specification_tests"}, {"score": 0.003920780681351006, "phrase": "recursive_eigenvalues"}, {"score": 0.0036845490951857617, "phrase": "recursive_estimation"}, {"score": 0.003429544382524185, "phrase": "rolling_estimation"}, {"score": 0.002778604641920052, "phrase": "ols-based_sequential_test"}, {"score": 0.002648768009464535, "phrase": "different_sample_sizes"}, {"score": 0.002623536040408411, "phrase": "monte_carlo_evidence"}, {"score": 0.002549269480908849, "phrase": "reasonably_good_power"}, {"score": 0.002512926336312949, "phrase": "moderately_sized_samples"}, {"score": 0.002406968743305622, "phrase": "graphical_device"}, {"score": 0.00220823903315848, "phrase": "kalman_filter"}], "paper_keywords": ["adjustment coefficients", " structural break", " sequential test", " Monte Carlo methods"], "paper_abstract": "In this article, we examine several approaches to detecting changes in the adjustment coefficients in cointegrated VARs. We adopt recursive and rolling techniques as mis-specification tests for the detection of non-constancy and the estimation of the breakpoints. We find that inspection of the recursive eigenvalues is not useful to detect a break in the adjustment coefficients, whereas recursive estimation of the coefficients can only indicate non-constancy, but not the exact breakpoint. Rolling estimation is found to perform better in detecting non-constancy in the parameters and their true value after the breakpoint. However, it only detects a region where the break is likely to occur. To overcome the drawbacks of these techniques, we use an OLS-based sequential test. To assess its performance, we derive its critical values for different sample sizes. Monte Carlo evidence shows that the test has reasonably good power even in moderately sized samples and that it can be used as a graphical device, as it shows a kink at the breakpoint. As a benchmark, we use the Kalman filter, of which we analyse the performance on the same data-generating processes.", "paper_title": "A comparison between tests for changes in the adjustment coefficients in cointegrated systems", "paper_id": "WOS:000252455500001"}