{"auto_keywords": [{"score": 0.029420333683948783, "phrase": "idiom"}, {"score": 0.00481495049065317, "phrase": "computational_analogy"}, {"score": 0.004299910946753963, "phrase": "analogical_reasoning_systems"}, {"score": 0.004216112320418982, "phrase": "design_tasks"}, {"score": 0.0037463983616303786, "phrase": "analogical_relationship"}, {"score": 0.0036553070575015344, "phrase": "parallel_interactions"}, {"score": 0.003462599815177726, "phrase": "interpretation-driven_approach"}, {"score": 0.003378385493203297, "phrase": "fundamental_problem"}, {"score": 0.003200230621987751, "phrase": "new_mappings"}, {"score": 0.0031223774204093713, "phrase": "mapping_process"}, {"score": 0.002986969236641105, "phrase": "existing_analogy-making_models"}, {"score": 0.002843372121209168, "phrase": "computational_model"}, {"score": 0.0024405312482831646, "phrase": "visual_analogy"}, {"score": 0.002233301265743633, "phrase": "interpretation-driven_mapping_framework"}, {"score": 0.0021682027434117095, "phrase": "representational_change"}], "paper_keywords": ["Computational Analogy Making", " Interpretation", " Representation"], "paper_abstract": "This paper presents a framework for the interactions between the processes of mapping and rerepresentation within analogy making. Analogical reasoning systems for use in design tasks require representations that are open to being reinterpreted. The framework, interpretation-driven mapping, casts the process of constructing an analogical relationship as requiring iterative, parallel interactions between mapping and interpreting. This paper argues that this interpretation-driven approach focuses research on a fundamental problem in analogy making: how do the representations that make new mappings possible emerge during the mapping process? The framework is useful for both describing existing analogy-making models and designing future ones. The paper presents a computational model informed by the framework Idiom, which learns ways to reinterpret the representations of objects as it maps between them. The results of an implementation in the domain of visual analogy are presented to demonstrate its feasibility. Analogies constructed by the system are presented as examples. The interpretation-driven mapping framework is then used to compare representational change in Idiom to that in three previously published systems.", "paper_title": "Interpretation-driven mapping: A framework for conducting search and rerepresentation in parallel for computational analogy in design", "paper_id": "WOS:000354032400006"}