{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "easily_testable_induced_subgraphs"}, {"score": 0.0047270350800814286, "phrase": "fixed_graph"}, {"score": 0.004698086429418318, "phrase": "h_vertices"}, {"score": 0.004431725879033857, "phrase": "induced_copy"}, {"score": 0.00431085649482107, "phrase": "n_vertices"}, {"score": 0.0036628073805800377, "phrase": "extremely_fast_growing_function"}, {"score": 0.0034022184461070114, "phrase": "one-sided_error"}, {"score": 0.0032588283962316817, "phrase": "first_author"}, {"score": 0.0029806849142611984, "phrase": "equivalent_question"}, {"score": 0.0028992754776056336, "phrase": "one-sided_error_property_tester"}, {"score": 0.0024252844944764695, "phrase": "similar_result"}, {"score": 0.0023735785441690097, "phrase": "directed_graphs"}, {"score": 0.0021842376228111537, "phrase": "two-sided_error_property_testers"}, {"score": 0.0021049977753042253, "phrase": "additive_number_theory"}], "paper_keywords": [""], "paper_abstract": "Let H be a fixed graph on h vertices. We say that a graph G is induced H-free if it does not contain any induced copy of H. Let G be a graph on n vertices and suppose that at least epsilon n(2) edges have to be added to or removed from it in order to make it induced H-free. It was shown in [5] that in this case G contains at least f(epsilon,h)n(h) induced copies of H, where 1/f(epsilon,h) is an extremely fast growing function in 1/epsilon, that is independent of n. As a consequence, it follows that for every H, testing induced H-freeness with one-sided error has query complexity independent of n. A natural question, raised by the first author in [1], is to decide for which graphs H the function 1/f(epsilon,H) can be bounded from above by a polynomial in 1/epsilon. An equivalent question is: For which graphs H can one design a one-sided error property tester for testing induced H-freeness, whose query complexity is polynomial in 1/epsilon? We settle this question almost completely by showing that, quite surprisingly, for any graph other than the paths of lengths 1,2 and 3, the cycle of length 4, and their complements, no such property tester exists. We further show that a similar result also applies to the case of directed graphs, thus answering a question raised by the authors in [9]. We finally show that the same results hold even in the case of two-sided error property testers. The proofs combine combinatorial, graph-theoretic and probabilistic arguments with results from additive number theory.", "paper_title": "A characterization of easily testable induced subgraphs", "paper_id": "WOS:000242320400001"}