{"auto_keywords": [{"score": 0.044027087409931595, "phrase": "berth_allocation_problem"}, {"score": 0.04051211375775462, "phrase": "terminal_operator"}, {"score": 0.00481495049065317, "phrase": "intelligent_techniques"}, {"score": 0.004723322467153553, "phrase": "maritime_terminals"}, {"score": 0.004693167092003573, "phrase": "maritime_container_terminals"}, {"score": 0.004633429997452688, "phrase": "cargo_containers"}, {"score": 0.004501774379030109, "phrase": "land_vehicles"}, {"score": 0.004345909305473054, "phrase": "large_number"}, {"score": 0.0043181530164057135, "phrase": "complex_and_combinatorial_problems"}, {"score": 0.0042495320879288615, "phrase": "container_stacking_problem"}, {"score": 0.0038973170902076707, "phrase": "whole_process"}, {"score": 0.00376230106601654, "phrase": "incoming_vessel"}, {"score": 0.0035286453655992904, "phrase": "prompt_berthing"}, {"score": 0.0033845816848753073, "phrase": "priority_customers"}, {"score": 0.0032777653153451265, "phrase": "arrival_service"}, {"score": 0.003034916887102753, "phrase": "artificial_intelligence"}, {"score": 0.0029203055813347874, "phrase": "planning_technique"}, {"score": 0.0028190406955898822, "phrase": "optimized_allocation_algorithms"}, {"score": 0.0026523079380037706, "phrase": "integrated_way"}, {"score": 0.0025521085778978042, "phrase": "optimized_order"}, {"score": 0.0023857603808363527, "phrase": "appropriate_place"}, {"score": 0.00236289633510808, "phrase": "obtained_ordering"}, {"score": 0.002145942273032774, "phrase": "container_terminals"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Planning", " Heuristics", " Optimization", " Container stacking problem", " Remarshaling", " Berth allocation problem"], "paper_abstract": "Maritime container terminals are facilities where cargo containers are transshipped between ships or between ships and land vehicles (trucks or trains). These terminals involve a large number of complex and combinatorial problems. Two important problems are the container stacking problem and the berth allocation problem. Both problems are generally managed and solved independently but there exist a relationship that must be taken into account to optimize the whole process. The terminal operator normally demands all containers bound for an incoming vessel to be ready in the terminal before its arrival. Similarly, customers (i.e., vessel owners) expect prompt berthing of their vessels upon arrival. This is particularly important for vessels from priority customers who may have been guaranteed berth-on-arrival service in their contract with the terminal operator. To this end, both problems must be interrelated. In this paper, a set of artificial intelligence based-techniques for solving both problems is presented. We develop a planning technique for solving the container stacking problem and a set of optimized allocation algorithms for solving the berth allocation problem independently. Finally we have developed an architecture to solve both problems in an integrated way. Thus, an algorithm for solving the berth allocation problem generates an optimized order of vessels to be served meanwhile our container stacking problem heuristics calculate the minimum number of reshuffles needed to allocate the containers in the appropriate place for the obtained ordering of vessels. Thus combined optimal solutions can be calculated and the terminal operator could decide which solution is more appropriate in each case. These techniques will minimize disruptions and facilitate planning in container terminals. (C) 2010 Elsevier Ltd. All rights reserved.", "paper_title": "Integrated intelligent techniques for remarshaling and berthing in maritime terminals", "paper_id": "WOS:000293678200005"}