{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "label_noise"}, {"score": 0.00475375392920917, "phrase": "survey"}, {"score": 0.004651177631663439, "phrase": "important_issue"}, {"score": 0.004247180402119585, "phrase": "inferred_models"}, {"score": 0.00415625929636759, "phrase": "necessary_training_samples"}, {"score": 0.003618558599449415, "phrase": "comprehensive_survey"}, {"score": 0.003571850980647625, "phrase": "different_types"}, {"score": 0.0029392020223716966, "phrase": "potential_consequences"}, {"score": 0.002802373595203129, "phrase": "label_noise-tolerant_algorithms"}, {"score": 0.0026718978608934077, "phrase": "short_discussion"}, {"score": 0.0021982976170703884, "phrase": "mislabeled_instances"}, {"score": 0.002169882514603539, "phrase": "additional_information"}, {"score": 0.0021049977753042253, "phrase": "e._g._confidences"}], "paper_keywords": ["Class noise", " classification", " label noise", " mislabeling", " robust methods", " survey"], "paper_abstract": "Label noise is an important issue in classification, with many potential negative consequences. For example, the accuracy of predictions may decrease, whereas the complexity of inferred models and the number of necessary training samples may increase. Many works in the literature have been devoted to the study of label noise and the development of techniques to deal with label noise. However, the field lacks a comprehensive survey on the different types of label noise, their consequences and the algorithms that consider label noise. This paper proposes to fill this gap. First, the definitions and sources of label noise are considered and a taxonomy of the types of label noise is proposed. Second, the potential consequences of label noise are discussed. Third, label noise-robust, label noise cleansing, and label noise-tolerant algorithms are reviewed. For each category of approaches, a short discussion is proposed to help the practitioner to choose the most suitable technique in its own particular field of application. Eventually, the design of experiments is also discussed, what may interest the researchers who would like to test their own algorithms. In this paper, label noise consists of mislabeled instances: no additional information is assumed to be available like e. g. confidences on labels.", "paper_title": "Classification in the Presence of Label Noise: a Survey", "paper_id": "WOS:000334738400001"}