{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "streaming_features"}, {"score": 0.008998040169555506, "phrase": "online_step"}, {"score": 0.0045262653692203815, "phrase": "real-world_applications"}, {"score": 0.0038668462001710314, "phrase": "well-known_emerging-pattern-based_classification_models"}, {"score": 0.003303177222901723, "phrase": "emerging-pattern_mining"}, {"score": 0.0031577303835881964, "phrase": "online_feature_selection_step"}, {"score": 0.002951444412262927, "phrase": "effective_features"}, {"score": 0.0029020077365708966, "phrase": "feature_stream"}, {"score": 0.0026370661343466354, "phrase": "emerging_patterns"}, {"score": 0.0025638362414466278, "phrase": "selected_features"}, {"score": 0.0023827927890399357, "phrase": "proposed_method"}, {"score": 0.0023166075278110237, "phrase": "benchmark_datasets"}, {"score": 0.0022020622730208514, "phrase": "mars_crater_detection"}, {"score": 0.0021049977753042253, "phrase": "state-of-art_static_classification_methods"}], "paper_keywords": ["Classifier Design and Evaluation", " Feature Evaluation and Selection", " Emerging patterns", " streaming features", " feature selection", " classification"], "paper_abstract": "Many datasets from real-world applications have very high-dimensional or increasing feature space. It is a new research problem to learn and maintain a classifier to deal with very high dimensionality or streaming features. In this article, we adapt the well-known emerging-pattern-based classification models and propose a semi-streaming approach. For streaming features, it is computationally expensive or even prohibitive to mine long-emerging patterns, and it is nontrivial to integrate emerging-pattern mining with feature selection. We present an online feature selection step, which is capable of selecting and maintaining a pool of effective features from a feature stream. Then, in our offline step, separated from the online step, we periodically compute and update emerging patterns from the pool of selected features from the online step. We evaluate the effectiveness and efficiency of the proposed method using a series of benchmark datasets and a real-world case study on Mars crater detection. Our proposed method yields classification performance comparable to the state-of-art static classification methods. Most important, the proposed method is significantly faster and can efficiently handle datasets with streaming features.", "paper_title": "Classification with Streaming Features: An Emerging-Pattern Mining Approach", "paper_id": "WOS:000355675000005"}