{"auto_keywords": [{"score": 0.043443105745602784, "phrase": "hospitalist_handover_communications"}, {"score": 0.041317453120078465, "phrase": "quality_handovers"}, {"score": 0.0318524882381123, "phrase": "patient_factors"}, {"score": 0.029574147451312, "phrase": "quality_elements"}, {"score": 0.027997284734999038, "phrase": "six_quality_elements"}, {"score": 0.004738325072560588, "phrase": "handover_assessment"}, {"score": 0.004681653551412616, "phrase": "healthcare_system"}, {"score": 0.004355516897622305, "phrase": "team_communication"}, {"score": 0.004117579919425373, "phrase": "shift_change"}, {"score": 0.003368707839819003, "phrase": "conversation_analysis"}, {"score": 0.00328849874768242, "phrase": "hospitalist_handover_utterances"}, {"score": 0.003236086384959101, "phrase": "content_and_language_form_codes"}, {"score": 0.003171740347925348, "phrase": "quality_element_verbalization"}, {"score": 0.0031337465656628132, "phrase": "patient_handovers"}, {"score": 0.002327594516681507, "phrase": "handover_receiver_knowledge"}, {"score": 0.002308953751676031, "phrase": "hospitalist_handovers"}, {"score": 0.002209060366991921, "phrase": "enhanced_electronic_medical_record_systems"}, {"score": 0.0021049977753042253, "phrase": "level_physicians"}], "paper_keywords": ["Communications", " continuity of care transitions", " handover", " human factors", " patient safety", " quality improvement", " shift change", " sign out"], "paper_abstract": "The healthcare system is moving from one primary physician who assumes responsibility for each patient to a more team-based approach. Thus, assessing team communication is critical. This study characterizes and assesses the quality of hospitalist handover communications at shift change using the literature recommended content and language form elements. Quality handovers should contain the following content: patient identifiers, active issues, and care plans. Quality handovers also should include utterances in the following language forms: explanations, rationales, and directives. Interviews, observation, recording, and conversation analysis of hospitalist handover communications were used. Hospitalist handover utterances were assigned both content and language form codes. The proportion of quality element verbalization across all patient handovers was calculated. In addition, the impact of patient factors (new admission, new problem, acuity level) and handover receiver knowledge on the inclusion of quality elements was examined. The 106 individual patient handovers across 16 handover sessions were recorded. 39% contained all six quality elements. While the majority of handovers contained five out of six quality elements, only 48% included directives. There was also no difference in the inclusion of quality elements based on patient factors or handover receiver knowledge. Hospitalist handovers are lacking in directives. Efforts to improve handovers through enhanced electronic medical record systems and training may need to expand to hospitalists and other attending level physicians.", "paper_title": "Considering Factors of and Knowledge About Patients in Handover Assessment", "paper_id": "WOS:000326185600007"}