{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "traffic_information"}, {"score": 0.04975450738666189, "phrase": "hierarchical_routing_reconfiguration"}, {"score": 0.029032640154573953, "phrase": "link_utilization"}, {"score": 0.01411484809013845, "phrase": "node_pairs"}, {"score": 0.01041778517389236, "phrase": "monitored_amount"}, {"score": 0.009037914952227532, "phrase": "upper_bounds"}, {"score": 0.008707493240518732, "phrase": "aggregated_traffic_information"}, {"score": 0.008389049319140755, "phrase": "suitable_routes"}, {"score": 0.007707622420946031, "phrase": "routing_reconfiguration"}, {"score": 0.0046857508651690916, "phrase": "large_and_time-varying_traffic"}, {"score": 0.004560002169647084, "phrase": "traffic_matrix"}, {"score": 0.004034444399739595, "phrase": "large_network"}, {"score": 0.003993472712847928, "phrase": "reconfiguration_methods"}, {"score": 0.003680274684654909, "phrase": "large_calculation_time"}, {"score": 0.003593623872399777, "phrase": "large_networks"}, {"score": 0.003520971639466546, "phrase": "dynamic_routing_reconfiguration_method"}, {"score": 0.003391556348707911, "phrase": "short_period"}, {"score": 0.0030831303297783877, "phrase": "calculation_time"}, {"score": 0.0027180455234834993, "phrase": "route_changes"}, {"score": 0.0026091594819333654, "phrase": "routing_controller"}, {"score": 0.002538996868327339, "phrase": "large_link_utilization"}, {"score": 0.002292243761395491, "phrase": "short_calculation_times"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Traffic engineering", " Routing reconfiguration", " Aggregation", " Link utilization", " Traffic matrix"], "paper_abstract": "One approach to accommodate a large and time-varying traffic is dynamical routing reconfiguration based on the traffic matrix (TM), which is obtained by monitoring the amounts of traffic between all node pairs. However, it is difficult to monitor and collect the amounts of traffic between all node pairs in a large network. Though reconfiguration methods only based on the amount of traffic on each link have been proposed to overcome this problem, these methods, require a large calculation time and cannot be applied to large networks. This paper discusses a dynamic routing reconfiguration method that can adapt routes to changes in traffic within a short period only based on the amount of traffic on each link. We introduce a hierarchical routing reconfiguration based on the monitored amount of traffic on each link to reduce the calculation time. Moreover, we also propose a method of aggregating traffic information that is suitable for hierarchical routing reconfiguration based on the monitored amount of traffic on each link. Our method aggregates traffic information so that the upper bounds of link utilization after route changes can be calculated by using the aggregated traffic information. Thus, the routing controller using the aggregated traffic information calculates the suitable routes without large link utilization by taking into consideration the upper bounds of the link utilization. This paper evaluates our method through simulations, where we demonstrated that the routing reconfiguration of each layer calculated suitable routes with short calculation times. Then, we reduced the link utilization immediately after traffic had changed by combining the routing reconfiguration of each layer. (C) 2014 Elsevier B.V. All rights reserved.", "paper_title": "Aggregation of traffic information for hierarchical routing reconfiguration", "paper_id": "WOS:000348882100016"}