{"auto_keywords": [{"score": 0.04428815049400911, "phrase": "arc-annotated_strings"}, {"score": 0.013571804513184594, "phrase": "arc-preserving_subsequence_problem"}, {"score": 0.011346491737141086, "phrase": "rna_molecules"}, {"score": 0.00481495049065317, "phrase": "arc-annotated_subsequence_matching"}, {"score": 0.004700468701207975, "phrase": "arc-annotated_string"}, {"score": 0.0034926916198124484, "phrase": "natural_model"}, {"score": 0.0033283624928018177, "phrase": "nested_arc-annotated_strings"}, {"score": 0.0031845067058084583, "phrase": "gramm_et_al"}, {"score": 0.002615381301695394, "phrase": "new_algorithm"}, {"score": 0.0024822279007111255, "phrase": "previous_time"}, {"score": 0.0023940274498526213, "phrase": "quadratic_term"}, {"score": 0.002308953751676031, "phrase": "large_rna_molecules"}, {"score": 0.0021219954544970878, "phrase": "independent_interest"}, {"score": 0.0021049977753042253, "phrase": "related_problems"}], "paper_keywords": ["Subsequence matching", " Algorithms", " Arc-annotated strings"], "paper_abstract": "An arc-annotated string is a string of characters, called bases, augmented with a set of pairs, called arcs, each connecting two bases. Given arc-annotated strings P and Q the arc-preserving subsequence problem is to determine if P can be obtained from Q by deleting bases from Q. Whenever a base is deleted any arc with an endpoint in that base is also deleted. Arc-annotated strings where the arcs are \"nested\" are a natural model of RNA molecules that captures both the primary and secondary structure of these. The arc-preserving subsequence problem for nested arc-annotated strings is basic primitive for investigating the function of RNA molecules. Gramm et al. (ACM Trans. Algorithms 2(1): 44-65, 2006) gave an algorithm for this problem using O(nm) time and space, where m and n are the lengths of P and Q, respectively. In this paper we present a new algorithm using O(nm) time and O(n+m) space, thereby matching the previous time bound while significantly reducing the space from a quadratic term to linear. This is essential to process large RNA molecules where the space is likely to be a bottleneck. To obtain our result we introduce several novel ideas which may be of independent interest for related problems on arc-annotated strings.", "paper_title": "Fast Arc-Annotated Subsequence Matching in Linear Space", "paper_id": "WOS:000298388200010"}