{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "virtual_agents"}, {"score": 0.004630150894006861, "phrase": "central_topic"}, {"score": 0.004530552828603269, "phrase": "human_emotion"}, {"score": 0.00443308765153716, "phrase": "crucial_role"}, {"score": 0.004063664475797303, "phrase": "virtual_worlds"}, {"score": 0.0037411604449359794, "phrase": "important_mechanism"}, {"score": 0.003660614912817745, "phrase": "believable_interactions"}, {"score": 0.003581797255879607, "phrase": "empathic_agents"}, {"score": 0.003384695931421288, "phrase": "specific_empathic_behaviors"}, {"score": 0.0033262524445013303, "phrase": "domain-dependent_empirical_models"}, {"score": 0.0031984060035955292, "phrase": "generic_computational_model"}, {"score": 0.0031023662967184216, "phrase": "recent_psychological_theories"}, {"score": 0.00303553181618577, "phrase": "proposed_model"}, {"score": 0.002880927789104712, "phrase": "empathic_response"}, {"score": 0.002675252546913683, "phrase": "empathic_interaction"}, {"score": 0.002516917671182532, "phrase": "empathizer_agent"}, {"score": 0.0023679315987170857, "phrase": "affective_agent_architecture"}, {"score": 0.002132711053003407, "phrase": "social_scenario"}, {"score": 0.0021049977753042253, "phrase": "small_group"}], "paper_keywords": ["intelligent agents", " multi-agent systems", " cognitive science", " user studies"], "paper_abstract": "For more than a century, empathy has been a central topic in the study of human emotion. It plays a crucial role in our everyday social life, having implications for the survival of the species. In the case of agents that inhabit virtual worlds and interact socially among each other and with humans, empathy has also been considered to be an important mechanism to promote engaging and believable interactions. However, creating empathic agents, until recently, has been accomplished mostly through the implementation of specific empathic behaviors or by using domain-dependent empirical models. In this article, we propose a generic computational model of empathy that is grounded on recent psychological theories about empathy. The proposed model treats empathy as a process in which the intensity of the empathic response is modulated by a set of factors that involve the relationship between the agents of the empathic interaction, namely, the similarity and affective link, as well as some characteristics of the empathizer agent, such as mood and personality. This model was implemented into an affective agent architecture, which was then used in an evaluation that had 77 participants. The results indicate that our empathy model, when used to simulate a social scenario with a small group of agents, significantly changed the way that the users perceived and described the interactions between those agents.", "paper_title": "A Process Model of Empathy For Virtual Agents", "paper_id": "WOS:000361835100001"}