{"auto_keywords": [{"score": 0.04987000090452703, "phrase": "northern_ireland"}, {"score": 0.01052054773352599, "phrase": "community_background"}, {"score": 0.006703202450824012, "phrase": "geographically_weighted_statistics"}, {"score": 0.006659477777554402, "phrase": "population_characteristics"}, {"score": 0.00481495049065317, "phrase": "population_spatial_concentrations"}, {"score": 0.004700568452151024, "phrase": "geographically_weighted_spatial_statistics"}, {"score": 0.004598933498016774, "phrase": "different_characteristics"}, {"score": 0.004568871736067739, "phrase": "key_means"}, {"score": 0.004548939310612501, "phrase": "guiding_government_policies"}, {"score": 0.004431149592844886, "phrase": "substantial_academic_interest"}, {"score": 0.003963497774871327, "phrase": "long_history"}, {"score": 0.003928969293303814, "phrase": "residential_segregation"}, {"score": 0.003852371777780562, "phrase": "population_concentration"}, {"score": 0.003703611021999795, "phrase": "housing_tenure"}, {"score": 0.003623453648863547, "phrase": "geographical_variables"}, {"score": 0.0035605741849764187, "phrase": "spatial_statistics"}, {"score": 0.003545024951402821, "phrase": "moran's_i._such_approaches"}, {"score": 0.003393206299636482, "phrase": "standard_aspatial_statistics"}, {"score": 0.0033709993008207485, "phrase": "logical_further_step"}, {"score": 0.0033197446406648626, "phrase": "local_basis"}, {"score": 0.003219553875143356, "phrase": "global_measures"}, {"score": 0.0031775430407770026, "phrase": "population_geography"}, {"score": 0.0031429517477457925, "phrase": "substantive_focus"}, {"score": 0.003088384809415812, "phrase": "relatively_few_studies"}, {"score": 0.0028794008436429596, "phrase": "geographically_weighted_statistical_measures"}, {"score": 0.0027985846558073457, "phrase": "key_objective"}, {"score": 0.002690406375639144, "phrase": "selected_variables"}, {"score": 0.0025750928944698673, "phrase": "similar_socioeconomic_status"}, {"score": 0.0024701149926376026, "phrase": "single_socioeconomic_and_demographic_variables"}, {"score": 0.0024325244760735566, "phrase": "different_spatial_scales"}, {"score": 0.002416589459425828, "phrase": "different_geographical_locations"}, {"score": 0.0023487324083283205, "phrase": "neighbouring_areas"}, {"score": 0.0023384629381463054, "phrase": "large_proportions"}, {"score": 0.0022928018832993387, "phrase": "variable_unemployment_levels"}, {"score": 0.0022628564592874147, "phrase": "first_case"}, {"score": 0.002243109951832684, "phrase": "unemployment_levels"}, {"score": 0.0021896891011033105, "phrase": "geographical_variations"}, {"score": 0.0021188825171510094, "phrase": "local_methods"}, {"score": 0.0021049977753042253, "phrase": "additional_methodological_contribution"}], "paper_keywords": ["spatial autocorrelation", " geographically weighted correlation", " religion", " segregation", " MAUP"], "paper_abstract": "Information on how populations are spatially concentrated by different characteristics is a key means of guiding government policies in a variety of contexts, in addition to being of substantial academic interest. In particular, to reduce inequalities between groups, it is necessary to understand the characteristics of these groups in terms of their composition and their geographical structure. This article explores the degree to which the population of Northern Ireland is spatially concentrated by a range of characteristics. There is a long history of interest in residential segregation by religion in Northern Ireland; this article assesses population concentration not only by community background ('religion or religion brought up in') but also by housing tenure, employment and other socioeconomic and demographic characteristics. The spatial structure of geographical variables can be captured by a range of spatial statistics including Moran's I. Such approaches utilise information on connections between observations or the distances between them. While such approaches are conceptually an improvement on standard aspatial statistics, a logical further step is to compute statistics on a local basis on the grounds that most real-world properties are not spatially homogenous and, therefore, global measures may mask much variation. In population geography, which provides the substantive focus for this article, there are still relatively few studies that assess in depth the application of geographically weighted statistics for exploring population characteristics individually and for exploring relations between variables. This article demonstrates the value of such approaches by using a variety of geographically weighted statistical measures to explore outputs from the 2001 Census of Population of Northern Ireland. A key objective is to assess the degree to which the population is spatially divided, as judged by the selected variables. In other words, do people cluster more strongly with others who share their community background or others who have a similar socioeconomic status in some respect? The analysis demonstrates how geographically weighted statistics can be used to explore the degree to which single socioeconomic and demographic variables and relations between such variables differ at different spatial scales and at different geographical locations. For example, the results show that there are regions comprising neighbouring areas with large proportions of people from the same community background, but with variable unemployment levels, while in other areas the first case holds true but unemployment levels are consistently low. The analysis supports the contention that geographical variations in population characteristics are the norm, and these cannot be captured without using local methods. An additional methodological contribution relates to the treatment of counts expressed as percentages.", "paper_title": "Exploring population spatial concentrations in Northern Ireland by community background and other characteristics: an application of geographically weighted spatial statistics", "paper_id": "WOS:000278856200004"}