{"auto_keywords": [{"score": 0.04094912027989201, "phrase": "general_connecting_functions"}, {"score": 0.017259384192667288, "phrase": "common_boundary"}, {"score": 0.004450568197899267, "phrase": "continuity_conditions"}, {"score": 0.00433531459712787, "phrase": "arbitrary_degrees"}, {"score": 0.004278807087784626, "phrase": "generally_structured_knots"}, {"score": 0.004223032986655664, "phrase": "key_issues"}, {"score": 0.0039808773560878865, "phrase": "b-spline"}, {"score": 0.003703611021999795, "phrase": "intrinsic_conditions"}, {"score": 0.003378385493203297, "phrase": "piecewise_polynomial_functions"}, {"score": 0.0028108690791085536, "phrase": "recent_results"}, {"score": 0.002737960968372391, "phrase": "linear_connecting_functions"}, {"score": 0.00270221723573854, "phrase": "special_cases"}, {"score": 0.002480961181275199, "phrase": "connecting_functions"}, {"score": 0.0024485643104830814, "phrase": "global_linear_functions"}, {"score": 0.002233301265743633, "phrase": "bezier_curve"}], "paper_keywords": [""], "paper_abstract": "This paper addresses some properties of G(1) continuity conditions between two B-spline surfaces with arbitrary degrees and generally structured knots. Key issues addressed in the paper include necessary G(1) continuity conditions between two B-spline surfaces, general connecting functions, continuities of the general connecting functions, and intrinsic conditions of the general connecting functions along the common boundary. In general, one may use piecewise polynomial functions, i.e. B-spline functions, as connecting functions for G(1) connection of two B-spline surfaces. Based on the work reported in this paper, some recent results in literature using linear connecting functions are special cases of the general connecting functions reported in this paper. In case that the connecting functions are global linear functions along the common boundary commonly used in literature, the common boundary degenerates as a Bezier curve for proper G(1) connection. Several examples for connecting two uniform biquadratic B-spline surfaces with G(1) continuity are also presented to demonstrate the results.", "paper_title": "Properties of G1 continuity conditions between two B-spline surfaces", "paper_id": "WOS:000239486600073"}