{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "thin-film_photovoltaic_modules"}, {"score": 0.01529325437613964, "phrase": "performance_ratio"}, {"score": 0.00453643016617164, "phrase": "data_mining"}, {"score": 0.00450052670755585, "phrase": "statistical_techniques"}, {"score": 0.004240116703465252, "phrase": "outdoor_conditions"}, {"score": 0.004123781267600542, "phrase": "air_mass"}, {"score": 0.004091130285858113, "phrase": "solar_spectral_irradiance_distribution"}, {"score": 0.00385431710959668, "phrase": "solar_spectral_irradiance_information"}, {"score": 0.0037634608487353183, "phrase": "photovoltaic_modules"}, {"score": 0.0037040785566765954, "phrase": "five_different_solar_spectral_irradiance_distributions"}, {"score": 0.00361675148805026, "phrase": "malaga"}, {"score": 0.003559675269411366, "phrase": "probability_distribution_functions"}, {"score": 0.00347574024760684, "phrase": "statistical_test"}, {"score": 0.0031217859267564344, "phrase": "k-means_data_mining_technique"}, {"score": 0.0027704982687041147, "phrase": "technique_estimates"}, {"score": 0.00267301171407926, "phrase": "cumulative_probability_distribution_function"}, {"score": 0.0023069016803337365, "phrase": "five_types"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Solar spectral distribution", " Photovoltaic modules", " Performance ratio", " Data mining", " Statistical models"], "paper_abstract": "A method for characterizing the performance ratio of thin-film photovoltaic modules based on the use of data mining and statistical techniques is developed. In general, this parameter changes when modules are working in outdoor conditions depending on irradiance, temperature, air mass and solar spectral irradiance distribution. The problem is that it is usually difficult to know how to include solar spectral irradiance information when estimating the performance of photovoltaic modules. We propose five different solar spectral irradiance distributions that summarize all the different distributions observed in Malaga. Using the probability distribution functions of these curves and a statistical test, we first checked when two spectral distributions measured can be considered to have the same contribution of energy per wavelength. Hence, using this test and the k-means data mining technique, all the measured spectra, more than two hundred and fifty thousand, are clustered in only five different groups. All the spectra in each cluster can be considered as equal and the k-means technique estimates one centroid for each cluster that corresponds to the cumulative probability distribution function that is the most similar to the rest of the samples in the cluster. The results obtained proves that 99.98% of the functions can be considered equal to the centroid of its cluster. With these five types of functions, we have explained the changes in the performance ratio measured for thin-film photovoltaic modules of different technologies. (C) 2013 Elsevier Ltd. All rights reserved.", "paper_title": "Data mining and statistical techniques for characterizing the performance of thin-film photovoltaic modules", "paper_id": "WOS:000326214700046"}