{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "female_authorship"}, {"score": 0.049488021144002546, "phrase": "computing_research"}, {"score": 0.004413846562278824, "phrase": "computer_science_publications"}, {"score": 0.0038978806337961565, "phrase": "computing_conferences"}, {"score": 0.0037087324991876727, "phrase": "digital_bibliography"}, {"score": 0.003662892058072211, "phrase": "library_project_database"}, {"score": 0.0029645930408561086, "phrase": "average_research_life"}, {"score": 0.0027684263985790526, "phrase": "gender_distribution"}, {"score": 0.002700348931172875, "phrase": "journal_authorships"}, {"score": 0.00265038878247831, "phrase": "different_computer_science_topics"}, {"score": 0.0026013505538490223, "phrase": "authors'_behavior"}, {"score": 0.002131383155056741, "phrase": "interesting_conclusions"}], "paper_keywords": ["Gender study", " Research publications", " Computer science", " DBLP database"], "paper_abstract": "In this paper we have conducted a study that covers computer science publications from 1936 to 2010 in order to analyze the evolution of women in computing research. We have considered the computing conferences and journals that are available in the digital bibliography and library project database, which contains more than 1.5 million papers and more than 4 million authorships, corresponding to about 4,000 journals, conferences and workshops. We analyze the participation of women as the authors of publications, productivity and its relationship with the average research life of women in comparison to that of men, the gender distribution of conference and journal authorships depending on different computer science topics, and authors' behavior as regards collaborating with one gender and/or the other. We also detail the method used to obtain and validate the data. The results of our study have led us to some interesting conclusions concerning various aspects of the evolution of female authorship in computing research.", "paper_title": "The evolution of female authorship in computing research", "paper_id": "WOS:000351546100005"}