{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "materialized_methods"}, {"score": 0.04916809664432026, "phrase": "hidden_markov_model"}, {"score": 0.03507995906078705, "phrase": "materialized_value"}, {"score": 0.026000346422893887, "phrase": "prediction_technique"}, {"score": 0.0046781613377273774, "phrase": "method_materialization"}, {"score": 0.004611224230543916, "phrase": "promising_data_access_optimization_technique"}, {"score": 0.004416079619543104, "phrase": "object_programming_languages"}, {"score": 0.003696550794743764, "phrase": "materialized_method"}, {"score": 0.0028100102841877835, "phrase": "strong_impact"}, {"score": 0.0027697290872182477, "phrase": "overall_system_performance"}, {"score": 0.0021876814398268775, "phrase": "immediate_recomputation"}, {"score": 0.002166711569953301, "phrase": "deferred_recomputation"}, {"score": 0.002145942273032774, "phrase": "random_recomputation"}], "paper_keywords": ["method materialization", " hierarchical materialization", " access prediction", " Hidden Markov Model"], "paper_abstract": "Method materialization is a promising data access optimization technique for multiple applications, including, in particular object programming languages with persistence, object data-bases, distributed computing systems, object-relational data warehouses, multimedia data warehouses, and spatial data warehouses. A drawback of this technique is that the value of a materialized method becomes invalid when an object used for computing the value of the method is updated. As a consequence, a materialized value of the method has to be recomputed. The materialized value can be recomputed either immediately after updating the object or just before calling the method. The moment the method is recomputed bears a strong impact on the overall system performance. In this paper we propose a technique of predicting access to materialized methods and objects, for the purpose of selecting the most appropriate recomputation technique. The prediction technique is based on the Hidden Markov Model (HMM). The prediction technique was implemented and evaluated experimentally. Its performance characteristics were compared to: immediate recomputation, deferred recomputation, random recomputation, and to our previous prediction technique, called a PMAP.", "paper_title": "Predicting access to materialized methods by means of hidden Markov model", "paper_id": "WOS:000268920700008"}