{"auto_keywords": [{"score": 0.04925539003404231, "phrase": "assignment_problem"}, {"score": 0.04733190377720633, "phrase": "standard_assignment_problem"}, {"score": 0.04517806343671265, "phrase": "bipartite_graph"}, {"score": 0.015612145170117362, "phrase": "multiple_objectives"}, {"score": 0.00481495049065317, "phrase": "personnel_assignment_problem"}, {"score": 0.004683073921949839, "phrase": "well-known_graph_optimization_problem"}, {"score": 0.004634552430216732, "phrase": "weighted-bipartite_graphs"}, {"score": 0.00436890075128947, "phrase": "matched_edges"}, {"score": 0.0038419751490849133, "phrase": "matching_constraints"}, {"score": 0.003559199464487982, "phrase": "first_constraint"}, {"score": 0.0034376160364306637, "phrase": "hierarchical-ordering_constraints"}, {"score": 0.003378385493203297, "phrase": "level_graph_structures"}, {"score": 0.0031955979242589494, "phrase": "second_constraint"}, {"score": 0.003054367741379269, "phrase": "mutually_exclusive_sets"}, {"score": 0.0030226700832113942, "phrase": "set-restriction_constraint"}, {"score": 0.002657677633954843, "phrase": "np-hard_problem"}, {"score": 0.0026118503041971976, "phrase": "extended_assignment_problem"}, {"score": 0.002566811158487033, "phrase": "np-hard_multi-objective_optimization_problem"}, {"score": 0.0024447807655923947, "phrase": "set-restriction_violations"}, {"score": 0.002312388685547026, "phrase": "genetic_algorithms"}, {"score": 0.002248899833549883, "phrase": "np-hard_multi-objective_optimization_problems"}, {"score": 0.0021795515361987144, "phrase": "genetic_algorithm_solutions"}, {"score": 0.002164432930854161, "phrase": "different_versions"}, {"score": 0.0021049977753042253, "phrase": "hierarchical_and_set_constraints"}], "paper_keywords": ["assignment problem", " bipartite graph", " matching", " hierarchical-ordering constraint", " set constraint", " NP-complete", " multiobjective optimization problem", " genetic algorithm"], "paper_abstract": "The assignment problem is a well-known graph optimization problem defined on weighted-bipartite graphs. The objective of the standard assignment problem is to maximize the summation of the weights of the matched edges of the bipartite graph. In the standard assignment problem, any node in one partition can be matched with any node in the other partition without any restriction. In this paper, variations of the standard assignment problem are defined with matching constraints by introducing structures in the partitions of the bipartite graph, and by defining constraints on these structures. According to the first constraint, the matching between the two partitions should respect the hierarchical-ordering constraints defined by forest and level graph structures produced by using the nodes of the two partitions respectively. In order to define the second constraint, the nodes of the partitions of the bipartite graph are distributed into mutually exclusive sets. The set-restriction constraint enforces the rule that in one of the partitions all the elements of each set should be matched with the elements of a set in the other partition. Even with one of these constraints the assignment problem becomes an NP-hard problem. Therefore, the extended assignment problem with both the hierarchical-ordering and set-restriction constraints becomes an NP-hard multi-objective optimization problem with three conflicting objectives; namely, minimizing the numbers of hierarchical-ordering and set-restriction violations, and maximizing the summation of the weights of the edges of the matching. Genetic algorithms are proven to be very successful for NP-hard multi-objective optimization problems. In this paper, we also propose genetic algorithm solutions for different versions of the assignment problem with multiple objectives based on hierarchical and set constraints, and we empirically show the performance of these solutions. (C) 2006 Elsevier Inc. All rights reserved.", "paper_title": "Genetic algorithm for the personnel assignment problem with multiple objectives", "paper_id": "WOS:000242985400009"}