{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "building_alignments"}, {"score": 0.04973919369807266, "phrase": "generalized_maps"}, {"score": 0.030529977007677542, "phrase": "generalized_datasets"}, {"score": 0.004696407360309416, "phrase": "key_step"}, {"score": 0.004483909657713567, "phrase": "map_generalization"}, {"score": 0.0044047527104545525, "phrase": "pattern_generating_processes"}, {"score": 0.0042809854543795255, "phrase": "smaller_scales"}, {"score": 0.004131135118662576, "phrase": "building_patterns"}, {"score": 0.004101797841848363, "phrase": "topographic_maps"}, {"score": 0.004000741805312148, "phrase": "mid_scales"}, {"score": 0.0036596534390380287, "phrase": "evaluation_range"}, {"score": 0.0036207206487324506, "phrase": "formal_map_requirements"}, {"score": 0.0035567476133074533, "phrase": "missing_automated_evaluation_techniques"}, {"score": 0.003150612723641925, "phrase": "spatial_distribution"}, {"score": 0.003061976628792769, "phrase": "three-step_approach"}, {"score": 0.0025984901976634726, "phrase": "evaluation_results"}, {"score": 0.0025434384320561403, "phrase": "confidence_indicator"}, {"score": 0.0024718415971488627, "phrase": "intended_users"}, {"score": 0.0023766673143502384, "phrase": "evaluation_decisions"}, {"score": 0.0021276671435454656, "phrase": "automated_generalization"}], "paper_keywords": ["automated generalization", " automated evaluation of generalized data", " building alignments", " building pattern recognition", " data matching", " map requirement formalization"], "paper_abstract": "Evaluation is a key step to examine the quality of generalized maps with respect to map requirements. Map generalization facilitates the recognition of pattern generating processes by preserving and highlighting the patterns at smaller scales. This article focuses specifically on the evaluation of building patterns in topographic maps that are generalized from large to mid scales. Currently, there is a lack of knowledge and functionality on automatically evaluating how these patterns are generalized. The issues of the evaluation range from missing formal map requirements on building alignments to missing automated evaluation techniques. This article firstly analyses the requirements (constraints) related to the generalization of building alignments. Then, it focuses on three more specific constraints, i.e. on existence, orientation of alignments and spatial distribution of composing buildings. Later, a three-step approach is proposed to (1) recognize and (2) match alignments from source and generalized datasets and (3) evaluate building alignments in generalized datasets. Besides, many-to-many and partial matching between initial and target alignments is a side effect of generalization, which reduces the reliability of the evaluation results. This article introduces a confidence indicator to document the reliability and to inform intended users (e.g. cartographers) and/or systems about the reliability of evaluation decisions. The effectiveness of our approach is demonstrated by evaluating the alignments in both interactively (manually) generalized maps and automated generalized maps. Finally, we discuss how our approach can be used to control automated generalization and identify further improvements.", "paper_title": "Automated evaluation of building alignments in generalized maps", "paper_id": "WOS:000324614200005"}