{"auto_keywords": [{"score": 0.04840115289905245, "phrase": "intuitionistic_fuzzy_sets"}, {"score": 0.02322730111336099, "phrase": "cut_sets"}, {"score": 0.02269144881872838, "phrase": "representation_theorems"}, {"score": 0.015535971669675044, "phrase": "decomposition_theorems"}, {"score": 0.014821900605368383, "phrase": "fuzzy_sets"}, {"score": 0.005347471567386555, "phrase": "zadeh_fuzzy_sets"}, {"score": 0.004190949039571789, "phrase": "eight_kinds"}, {"score": 0.003957078581524691, "phrase": "new_definitions"}, {"score": 0.003290494847464381, "phrase": "new_cut_sets"}, {"score": 0.0025169965861573185, "phrase": "valued_fuzzy_sets"}, {"score": 0.0021049977753042253, "phrase": "fundamental_theory"}], "paper_keywords": ["intuitionistic fuzzy sets", " interval valued fuzzy sets", " triple valued fuzzy sets", " cut sets", " decomposition theorem", " representation theorem"], "paper_abstract": "In this paper, the cut sets, decomposition theorems and representation theorems of intuitionistic fuzzy sets and interval valued fuzzy sets are researched indail. First, new definitions of four kinds of cut sets on intuitionistic fuzzy sets are introduced, which are generalizations of cut sets on Zadeh fuzzy sets and have the same properties as that of Zadeh fuzzy sets. Second, based on these new cut sets, the decomposition theorems and representation theorems on intuitionistic fuzzy sets are established. Each kind of cut sets corresponds to two kinds of decomposition theorems and representation theorems. Thus eight kinds of decomposition theorems and representation theorems on intuitionistic fuzzy sets are obtained, respectively. At last, new definitions of cut sets on interval valued fuzzy sets are given based on the theory of cut sets on intuitionistic fuzzy sets, and eight kinds of decomposition theorems and representation theorems on interval valued fuzzy sets are also obtained. These results provide a fundamental theory for the research of intuitionistic fuzzy sets and interval valued fuzzy sets.", "paper_title": "The cut sets, decomposition theorems and representation theorems on intuitionistic fuzzy sets and interval valued fuzzy sets", "paper_id": "WOS:000286497800009"}