{"auto_keywords": [{"score": 0.045380871007235306, "phrase": "logic_rules"}, {"score": 0.00963232499177683, "phrase": "recursive_version"}, {"score": 0.008996270640825683, "phrase": "training_data"}, {"score": 0.00481495049065317, "phrase": "probability_theory"}, {"score": 0.004664825860856205, "phrase": "newly_proposed_system_architecture"}, {"score": 0.0044955593691886845, "phrase": "labelling_components"}, {"score": 0.004424901543849507, "phrase": "tok_architecture"}, {"score": 0.004366865376588095, "phrase": "statistical_feature_distributions"}, {"score": 0.004230652134869403, "phrase": "probabilistic_framework"}, {"score": 0.0041972651315217765, "phrase": "maximum_likelihood_method"}, {"score": 0.004175153021444913, "phrase": "label_assignment"}, {"score": 0.003620060845528521, "phrase": "particular_object"}, {"score": 0.0032141094173256247, "phrase": "statistically_based_inference"}, {"score": 0.003197160157009361, "phrase": "possible_labels"}, {"score": 0.0030566420737720367, "phrase": "particular_characteristic"}, {"score": 0.0029611763591093727, "phrase": "specific_action"}, {"score": 0.0028310005209524797, "phrase": "former_types"}, {"score": 0.002713700006599453, "phrase": "multi-view_images"}, {"score": 0.0026358800880512357, "phrase": "standard_techniques"}, {"score": 0.002364932746984067, "phrase": "expandable_bayesian_networks"}, {"score": 0.002178679246985881, "phrase": "pre-programmed_logic_rules"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Scene labelling systems", " Logic and probabilities", " Machine learning", " System architecture"], "paper_abstract": "We explore a newly proposed system architecture, called tower of knowledge (ToK), in the context of labelling components of building scenes. The ToK architecture allows the incorporation of statistical feature distributions and logic rules concerning the definition of a component, within a probabilistic framework. The maximum likelihood method of label assignment is modified by being multiplied with a function, called utility function, that expresses the information coming from the logic rules programmed to the system. The logic rules are designed to define an object/component by answering the questions \"why\" and \"how\", referring to the actions in which a particular object may be observed to participate and the characteristics it should have in order to be able to participate in these actions. Two sets of measurements are assumed to be available: those made initially for all components routinely, and which supply the initial statistically based inference of possible labels of each component, and those that are made in order to confirm or deny a particular characteristic of the component that would allow it to participate in a specific action. A recursive version of the architecture is also proposed, in which the distributions of the former types of measurement may be learnt in the process, having no training data at all. Multi-view images are used as input to the system, which uses standard techniques to build the 3D models of the buildings. The system is tested on labelling the components of 10 3D models of buildings. The components are identified either manually, or fully automatically. The results are compared with those obtained by expandable Bayesian networks. The recursive version of ToK proves to be able to cope very well even without any training data, where it learns the characteristics of the various components by simply applying the pre-programmed logic rules that connect labels, actions and attributes. (C) 2011 Elsevier Inc. All rights reserved.", "paper_title": "3D Scene interpretation by combining probability theory and logic: The tower of knowledge", "paper_id": "WOS:000295424200011"}