{"auto_keywords": [{"score": 0.013156114311198694, "phrase": "spectral_efficiency"}, {"score": 0.00481495049065317, "phrase": "dense_device"}, {"score": 0.004778258911940497, "phrase": "device_network"}, {"score": 0.004276468590041119, "phrase": "close_proximity"}, {"score": 0.0041001740903338834, "phrase": "base_station"}, {"score": 0.003797978200741566, "phrase": "cellular_network"}, {"score": 0.0037259623657693794, "phrase": "spectrum_sharing"}, {"score": 0.003531474887552889, "phrase": "common_wireless_medium"}, {"score": 0.0034911335714333507, "phrase": "co-located_limited_area"}, {"score": 0.003398780792129312, "phrase": "interference_management"}, {"score": 0.0033215617190376565, "phrase": "cellular_networks"}, {"score": 0.00283870598459543, "phrase": "interference_model"}, {"score": 0.0027215202678634517, "phrase": "aggregated_throughput"}, {"score": 0.0025892330566358503, "phrase": "desired_signal_and_interference_signals"}, {"score": 0.002435190484324197, "phrase": "cluster_size"}, {"score": 0.002325689073229477, "phrase": "considered_area"}, {"score": 0.0022990901047984197, "phrase": "network_performance"}, {"score": 0.002272794656458419, "phrase": "analytical_results"}, {"score": 0.0022382002476510573, "phrase": "computer_simulations"}, {"score": 0.0021705796895687864, "phrase": "rough_guideline"}], "paper_keywords": ["Device to Device (D2D)", " cluster", " co-located", " operating condition", " fading", " performance evaluation"], "paper_abstract": "Device-to-Device (D2D) communication is a technology component for long-term evolution-advanced (LTE-A). In D2D communication, users in close proximity to each other can communicate directly without going through a base station; such direct communication can improve spectral efficiency. Although D2D communication brings improvement in spectral efficiency, it also causes interference to the cellular network as a result of spectrum sharing. In particularly, D2D communication can generate interference for each D2D pair when the common wireless medium in a co-located limited area is accessed. Even though the interference management for between the D2D pair and cellular networks has been proposed, the interference reducing methods have still not been fully studied for the D2D pairs. In this paper, we investigate the problem of D2D pair coexistence in which interference is considered between D2D pairs. Using a signal to interference model for a target D2D pair, we provide an analysis of the aggregated throughput of a dense D2D network. For a target D2D pair, we assume that the desired signal and interference signals obey multipath fading and shadow fading. Through analysis, we demonstrate the effect of cluster size such as the number of D2D pairs and the size of the considered area on the network performance. The analytical results are compared with computer simulations. Our work can be used for a rough guideline for controlling the system throughput in a dense D2D network environment.", "paper_title": "Performance Analysis of a Dense Device to Device Network", "paper_id": "WOS:000345333600001"}