{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "model-driven_engineering"}, {"score": 0.01048980421576813, "phrase": "fault-tolerant_systems"}, {"score": 0.0041589926969138585, "phrase": "fault-tolerance_mechanisms"}, {"score": 0.0038049789989278463, "phrase": "software_faults"}, {"score": 0.0035361001070845677, "phrase": "fault_tolerance"}, {"score": 0.0032689949867583633, "phrase": "inherently_high_level"}, {"score": 0.0031513240597392843, "phrase": "research_groups"}, {"score": 0.0029438813080245544, "phrase": "research_field"}, {"score": 0.0028828348726682965, "phrase": "established_fields"}, {"score": 0.0028527866590859967, "phrase": "software_engineering"}, {"score": 0.002823050755743821, "phrase": "system_verification"}, {"score": 0.0025824576209656676, "phrase": "traditional_fields"}, {"score": 0.002476424729269258, "phrase": "good_overview"}, {"score": 0.0023133055945761235, "phrase": "reliable_fault-tolerant_systems"}], "paper_keywords": [""], "paper_abstract": "To improve the reliability of a system, we can add fault-tolerance mechanisms. This, however, leads to a rise of complexity that increases the probability of software faults being introduced. Hence, unless the process is handled carefully, adding fault tolerance may even lead to a less reliable system. As a way to deal with the inherently high level of complexity of fault-tolerant systems, some research groups have turned to the paradigm of model-driven engineering. This results in a research field that crosscuts the established fields of software engineering, system verification, fault-tolerant systems and distributed systems. Many works are presented in the context of one of these traditional fields, making it difficult to get a good overview of what is presently offered. We survey 10 approaches for model-driven engineering of reliable fault-tolerant systems and present 13 characteristics classifying the approaches in a manner useful for both users and developers of such approaches. We further discuss the state of the field and what the future may bring.", "paper_title": "Model-Driven Engineering of Reliable Fault-Tolerant Systems-A State-of-the-Art Survey", "paper_id": "WOS:000323889300005"}