{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "optimal_landmark_sequences"}, {"score": 0.03747974821527598, "phrase": "pedestrian_route_instructions"}, {"score": 0.004757227624616643, "phrase": "pedestrian_navigation_applications"}, {"score": 0.004267757384195032, "phrase": "optimal_approach"}, {"score": 0.0036700484729006136, "phrase": "multiobjective_model"}, {"score": 0.0034342161742428635, "phrase": "general_approach"}, {"score": 0.003352256019007896, "phrase": "diverse_needs"}, {"score": 0.002952900365829518, "phrase": "modified_aco_algorithm"}, {"score": 0.0028823939507764238, "phrase": "whole_study_area"}, {"score": 0.0027298319171606498, "phrase": "optimization_process"}, {"score": 0.002361236012575149, "phrase": "landmark_density"}, {"score": 0.002209319719984651, "phrase": "experimental_results"}, {"score": 0.002143529653780496, "phrase": "proposed_model"}, {"score": 0.0021049977753042253, "phrase": "landmark_sequences"}], "paper_keywords": ["pedestrian navigation", " landmark sequence", " ant colony optimization", " multiple objectives"], "paper_abstract": "Landmarks provide the most predominant navigational cue for pedestrian navigation. The choice and representation of landmarks require an optimal approach to meet the needs of pedestrians, for example, shorter distances, fewer turns, and easy confirmation. This article proposes a multiobjective model to generate optimal landmark sequences for pedestrian route instructions. This model offers a general approach to meet the diverse needs of pedestrians. A modified ant colony optimization (ACO) algorithm is used to implement the proposed model. This research determined the parameters of the modified ACO algorithm by testing the whole study area using various weight combinations. This article also discusses the optimization process for various cases, for example, different origin-destination (OD) pairs, different pedestrian study areas, the influence of landmark density, and the overall performance comparison in achieving four objectives. Experimental results have confirmed that this proposed model can optimize landmark sequences for pedestrian route instructions.", "paper_title": "A multiobjective model for generating optimal landmark sequences in pedestrian navigation applications", "paper_id": "WOS:000295465900005"}