{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "multivariate_network_exploration"}, {"score": 0.004492573860101133, "phrase": "network_data"}, {"score": 0.004059673618719782, "phrase": "topological_structure"}, {"score": 0.003952828685048176, "phrase": "multivariate_data"}, {"score": 0.003727527379253624, "phrase": "exploration_and_analysis_methods"}, {"score": 0.003629392214109574, "phrase": "single_aspect"}, {"score": 0.0032272929113113203, "phrase": "expert_knowledge"}, {"score": 0.0031255543155487234, "phrase": "non-expert_user"}, {"score": 0.0030595112110658675, "phrase": "novel_solution"}, {"score": 0.002931569771634119, "phrase": "structural_and_multivariate_analysis"}, {"score": 0.0028089642985491404, "phrase": "detail"}, {"score": 0.0022806798371116698, "phrase": "example_explorations"}, {"score": 0.002256435842862802, "phrase": "real-world_datasets"}, {"score": 0.0021049977753042253, "phrase": "multivariate_networks"}], "paper_keywords": ["Multivariate Networks", " Selections of Interest", " Interaction", " Direct Manipulation"], "paper_abstract": "Network data is ubiquitous; e-mail traffic between persons, telecommunication. transport and financial networks are some examples. Often these networks are large and multivariate, besides the topological structure of the network, multivariate data on the nodes and links is available. Currently, exploration and analysis methods are focused on a single aspect; the network topology or the multivariate data. In addition, tools and techniques are highly domain specific and require expert knowledge. We focus on the non-expert user and propose a novel solution for multivariate network exploration and analysis that tightly couples structural and multivariate analysis. In short, we go from Detail to Overview via Selections and Aggregations (DOSA): users are enabled to gain insights through the creation of selections of interest (manually or automatically); and producing high-level, infographic-style overviews simultaneously. Finally, we present example explorations on real-world datasets that demonstrate the effectiveness of our method for the exploration and understanding of multivariate networks where presentation of findings comes for free.", "paper_title": "Multivariate Network Exploration and Presentation: From Detail to Overview via Selections and Aggregations", "paper_id": "WOS:000344991700076"}