{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "cds"}, {"score": 0.00792995468338129, "phrase": "si"}, {"score": 0.004606148097788071, "phrase": "wireless_ad_hoc_networks"}, {"score": 0.004550783060775205, "phrase": "existing_cds_protocols"}, {"score": 0.004424160689087029, "phrase": "small_size"}, {"score": 0.0043358695338488445, "phrase": "localized_information"}, {"score": 0.004301046274139699, "phrase": "immediate_neighbors"}, {"score": 0.004231577331448347, "phrase": "analytical_model"}, {"score": 0.004164516065972361, "phrase": "nodal_mobility"}, {"score": 0.0040978781692373005, "phrase": "lengthy_recovery_procedure"}, {"score": 0.0040155212997603626, "phrase": "mi"}, {"score": 0.0038885527668812807, "phrase": "timer-based_cds_protocols"}, {"score": 0.003558294449586273, "phrase": "minimum_localized_information"}, {"score": 0.0033223686422055834, "phrase": "network_topology"}, {"score": 0.00301560261110296, "phrase": "smallest_cds"}, {"score": 0.0029672941061574375, "phrase": "mobility_handling_capability"}, {"score": 0.002715066828152702, "phrase": "si."}, {"score": 0.002545165985686468, "phrase": "simulation_results"}, {"score": 0.0023762535034673017, "phrase": "expected_convergence_time"}], "paper_keywords": ["Connected dominating set", " virtual backbone", " ad hoc networks", " distributed algorithms"], "paper_abstract": "The connected dominating set (CDS) has been extensively used for routing and broadcast in wireless ad hoc networks. While existing CDS protocols are successful in constructing CDS of small size, they either require localized information beyond immediate neighbors, lack the mechanism to properly handle nodal mobility, or involve lengthy recovery procedure when CDS becomes corrupted. In this paper, we introduce the timer-based CDS protocols, which first elect a number of initiators distributively and then utilize timers to construct a CDS from initiators with the minimum localized information. We demonstrate that our CDS protocols are capable of maintaining CDS in the presence of changes of network topology. Depending on the number of initiators, there are two versions of our timer-based CDS protocols. The Single-Initiator (SI) generates the smallest CDS among protocols with mobility handling capability. Built on top of SI, the Multi-Initiator (MI) version removes the single point of failure at single-initiator and possesses most advantages of SI. We evaluate our protocols by both the ns-2 simulation and an analytical model. Compared with the other known CDS protocols, the simulation results demonstrate that both SI and MI produce and maintain CDS of very competitive size. The analytical model shows the expected convergence time and the number of messages required by SI and MI in the construction of CDS, which match closely to our simulation results. This helps to establish the validity of our simulation.", "paper_title": "Timer-Based CDS Construction in Wireless Ad Hoc Networks", "paper_id": "WOS:000293968000003"}