{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "multidimensional_projections"}, {"score": 0.004656871909510407, "phrase": "visualization_techniques"}, {"score": 0.00417793854311445, "phrase": "particular_case"}, {"score": 0.004108742905942481, "phrase": "multidimensional_data_visualization"}, {"score": 0.003859273279966873, "phrase": "growing_number"}, {"score": 0.0035947360742084253, "phrase": "numerical_evaluations"}, {"score": 0.0034332736827447654, "phrase": "visual_properties"}, {"score": 0.003292770855568091, "phrase": "projection_inspector"}, {"score": 0.0030414140732789186, "phrase": "interactive_assessment_method"}, {"score": 0.00290473242917264, "phrase": "known_projection_techniques"}, {"score": 0.002660574167091781, "phrase": "on-the-fly\"_new_projection_techniques"}, {"score": 0.0025409639091476363, "phrase": "projection_space"}, {"score": 0.0024883835349005863, "phrase": "theoretical_foundations"}, {"score": 0.0024573577356299765, "phrase": "projection_exploration_space"}, {"score": 0.002426717832834137, "phrase": "interactive_tool"}, {"score": 0.0022886952510350416, "phrase": "case_studies"}, {"score": 0.00223196703759329, "phrase": "projection_assessment"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Multidimensional projection", " Quality metrics"], "paper_abstract": "As the number and complexity of visualization techniques have grown, it has become progressively more difficult to make a decision as to which technique to employ for any given situation or application. A particular case is that of multidimensional data visualization utilizing projections, which have gained much attention lately and are being utilized in a growing number of applications. With their popularity, many new variations of multidimensional projections have been proposed in the literature. Numerical evaluations are varied and are useful, but do not reflect visual properties of projections accurately. In this paper we present Projection Inspector, an approach that contributes to the problem of understanding the difference amongst projections. It is an interactive assessment method that allows a user to explore a \"space\" of known projection techniques and view their results, as well as to identify the differences between them. In addition, it generates \"on-the-fly\" new projection techniques via interpolations of existing techniques as the user explores the projection space. We present the theoretical foundations of the projection exploration space and an interactive tool that implements a view of this space. We demonstrate the approach with case studies that demonstrate the need for projection assessment and the value of combining projections into new, better suited, projection alternatives. (C) 2014 Elsevier B.V. All rights reserved.", "paper_title": "Projection inspector: Assessment and synthesis of multidimensional projections", "paper_id": "WOS:000346952300025"}