{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "content_sharing"}, {"score": 0.038998282427906275, "phrase": "community_network"}, {"score": 0.015442919463805223, "phrase": "community_networks"}, {"score": 0.004686963264680882, "phrase": "infrastructure_support"}, {"score": 0.00450130420152996, "phrase": "viral_file"}, {"score": 0.004401342842183475, "phrase": "local_community_network"}, {"score": 0.004041238873048836, "phrase": "local_purposes"}, {"score": 0.003916098498242888, "phrase": "community-oriented_nature"}, {"score": 0.003085813569061001, "phrase": "infrastructure_nodes"}, {"score": 0.002820319063320601, "phrase": "content_demand"}, {"score": 0.002708399936381754, "phrase": "demand_prediction_model"}, {"score": 0.0025202582748972122, "phrase": "fluid-flow_model"}, {"score": 0.002453116398642071, "phrase": "helper_provisioning"}, {"score": 0.0023451553255837317, "phrase": "derived_results"}, {"score": 0.002313701040445819, "phrase": "significant_reduction"}, {"score": 0.0022318655527987846, "phrase": "average_content_download_time"}, {"score": 0.002124036931047162, "phrase": "role_helpers"}], "paper_keywords": ["Content sharing", " P2P", " Community networks", " Fluid-flow modelling", " Infrastructure support"], "paper_abstract": "We consider the problem of sharing a viral file between users in a local community network (e. g., college and office campuses). Community computing is computer networking among and between users in a geographically bounded setting for local purposes and activities. Due to the community-oriented nature of such networks, it is likely that users of a community network would like to share content. Peer-to-Peer (P2P) networks have turned out to be one of the most innovative paradigms for sharing content on the Internet. In this paper, we analyze the performance of P2P content sharing in community networks and investigate the role that infrastructure nodes (helpers) can play to enhance the performance of content sharing and distribution. We model the evolution of content demand in a community network. The use of this demand prediction model allows us to design a delicate P2P-with-helpers content distribution system. Our in-sights that we obtain using fluid-flow model increase our understanding of how helper provisioning affects the performance of content sharing and distribution. The derived results show that significant reduction in both the cost of distributing content and the average content download time can be realized when only few infrastructure nodes in the community network play the role helpers and cache P2P objects.", "paper_title": "Modelling and performance analysis of content sharing and distribution in community networks with infrastructure support", "paper_id": "WOS:000339877700021"}