{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "google"}, {"score": 0.006275620626336589, "phrase": "relevant_documents"}, {"score": 0.0051981725504081705, "phrase": "retrieved_results"}, {"score": 0.0047820521205253035, "phrase": "top_ranked_results"}, {"score": 0.0046526806928044485, "phrase": "main_purpose"}, {"score": 0.00438921882244081, "phrase": "system's_assessment"}, {"score": 0.004314595541370065, "phrase": "users'_views"}, {"score": 0.004169117683086526, "phrase": "presumably_objective_relevance_ranking"}, {"score": 0.004084214683045812, "phrase": "pagerank"}, {"score": 0.003987275549870311, "phrase": "users'_subjective_judgments"}, {"score": 0.003852791434660505, "phrase": "relevance_ranking"}, {"score": 0.00369736218441293, "phrase": "real_search_sessions"}, {"score": 0.00365949103351756, "phrase": "results_pages"}, {"score": 0.0033127570056253252, "phrase": "appearance_order"}, {"score": 0.0032900885091898184, "phrase": "retrieved_documents"}, {"score": 0.0028975361811534265, "phrase": "first_pages"}, {"score": 0.002771001596749451, "phrase": "users'_viewpoints"}, {"score": 0.0027144744718498102, "phrase": "fourth_results_pages"}, {"score": 0.0025255346035867564, "phrase": "significant_differences"}, {"score": 0.002333620799300123, "phrase": "search_engines"}, {"score": 0.0021049977753042253, "phrase": "google's_relevance"}], "paper_keywords": ["Search engines", " Google", " Relevance ranking", " PageRank", " Result pages", " User interfaces"], "paper_abstract": "Purpose - The main purpose of this study is to evaluate the effectiveness of relevance ranking on Google by comparing the system's assessment of relevance with the users' views. The research aims to find out whether the presumably objective relevance ranking of Google based on the PageRank and some other factors in fact matches users' subjective judgments of relevance. Design/methodology/approach - This research investigated the relevance ranking of Google's retrieved results using 34 searches conducted by users in real search sessions. The results pages 1-4 (i.e. the first 40 results) were examined by the users to identify relevant documents. Based on these data the frequency of relevant documents according to the appearance order of retrieved documents in the first four results pages was calculated. The four results pages were also compared in terms of precision. Findings - In 50 per cent and 47.06 per cent of the searches the documents ranked 5th and 1st, (i.e. from the first pages of the retrieved results) respectively, were most relevant according to the users' viewpoints. Yet even in the fourth results pages there were three documents that were judged most relevant by the users in more than 40 per cent of the searches. There were no significant differences between the precision of the four results pages except between pages 1 and 3. Practical implications - The results will help users of search engines, especially Google, to decide how many pages of the retrieved results to examine. Originality/value - Search engine design will benefit from the results of this study as it experimentally evaluates the effectiveness of Google's relevance ranking.", "paper_title": "Relevance ranking on Google Are top ranked results really considered more relevant by the users?", "paper_id": "WOS:000295711800005"}