{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "distortion_side_information"}, {"score": 0.015279904083785283, "phrase": "side_information"}, {"score": 0.004598933498016774, "phrase": "distortion_measure"}, {"score": 0.002938317647182056, "phrase": "natural_complement"}, {"score": 0.00283870598459543, "phrase": "source_signal"}, {"score": 0.0027582869614402135, "phrase": "wyner"}, {"score": 0.002726752258492449, "phrase": "ziv"}, {"score": 0.0022424956516376073, "phrase": "encoder-only_distortion_side_information"}, {"score": 0.0022168460543913787, "phrase": "decoder-only_signal_side_information"}, {"score": 0.0021539955106204354, "phrase": "high-resolution_limit"}, {"score": 0.0021049977753042253, "phrase": "rate_penalty"}], "paper_keywords": ["data compression", " distributed source coding", " quantization", " sensor networks", " Wyner-Ziv coding"], "paper_abstract": "The impact of side information about the distortion measure in problems of quantization is analyzed. It is shown that such \"distortion side information\" is not only useful in general, but that in many cases knowing it at only the encoder is as good as knowing it at both encoder and decoder, and knowing it at only the decoder is useless. Moreover, it is shown that the strategy of exploiting distortion side information at the encoder by describing it for the decoder is inefficient. Thus, distortion side information is a natural complement to side information about the source signal, as studied by Wyner and Ziv, which if available only at the decoder is often as good as knowing it at both encoder and decoder. When both types of side information are present, conditions are established under which encoder-only distortion side information and decoder-only signal side information are sufficient in the high-resolution limit, and the rate penalty for deviating from this configuration is characterized.", "paper_title": "Source coding with distortion side information", "paper_id": "WOS:000259407000015"}