{"auto_keywords": [{"score": 0.04954756810706401, "phrase": "accumulating_priority_queue"}, {"score": 0.04630684633148268, "phrase": "performance_targets"}, {"score": 0.014929920035699356, "phrase": "different_classes"}, {"score": 0.0136156164317368, "phrase": "queueing_discipline"}, {"score": 0.012009612980742377, "phrase": "kleinrock"}, {"score": 0.00481495049065317, "phrase": "time_distributions"}, {"score": 0.004502943680955863, "phrase": "service_facility"}, {"score": 0.003779943062894615, "phrase": "mean_waiting_times"}, {"score": 0.003405472159599445, "phrase": "linear_function"}, {"score": 0.0033054391731615618, "phrase": "higher_the_urgency"}, {"score": 0.0032686865485199806, "phrase": "customer's_class"}, {"score": 0.003232341244892437, "phrase": "greater_the_rate"}, {"score": 0.002977835845437357, "phrase": "highest_accumulated_priority"}, {"score": 0.0029447150254434842, "phrase": "time_point"}, {"score": 0.0025366596616434767, "phrase": "healthcare_and_human_services_sectors"}, {"score": 0.0024529174827030787, "phrase": "waiting_time_distributions"}, {"score": 0.0021207658298095845, "phrase": "mathematical_interest"}], "paper_keywords": ["Priority queues", " Time-dependent priority", " Non-preemptive priority", " Accumulating priority"], "paper_abstract": "We are interested in queues in which customers of different classes arrive to a service facility, and where performance targets are specified for each class. The manager of such a queue has the task of implementing a queueing discipline that results in the performance targets for all classes being met simultaneously. For the case where the performance targets are specified in terms of ratios of mean waiting times, as long ago as the 1960s, Kleinrock suggested a queueing discipline to ensure that the targets are achieved. He proposed that customers accumulate priority as a linear function of their time in the queue: the higher the urgency of the customer's class, the greater the rate at which that customer accumulates priority. When the server becomes free, the customer (if any) with the highest accumulated priority at that time point is the one that is selected for service. Kleinrock called such a queue a time-dependent priority queue, but we shall refer to it as the accumulating priority queue. Recognising that the performance of many queues, particularly in the healthcare and human services sectors, is specified in terms of tails of waiting time distributions for customers of different classes, we revisit the accumulating priority queue to derive its waiting time distributions, rather than just the mean waiting times. We believe that some elements of our analysis, particularly the process that we call the maximum priority process, are of mathematical interest in their own right.", "paper_title": "Waiting time distributions in the accumulating priority queue", "paper_id": "WOS:000338649100002"}