{"auto_keywords": [{"score": 0.0431872167057894, "phrase": "proposed_method"}, {"score": 0.040552623246943253, "phrase": "pocs_algorithm"}, {"score": 0.02295784835510541, "phrase": "semantic_image_retrieval"}, {"score": 0.019377733628426323, "phrase": "query_image"}, {"score": 0.009484793558508724, "phrase": "database_images"}, {"score": 0.008992913106489392, "phrase": "unknown_semantic_features"}, {"score": 0.00481495049065317, "phrase": "kernel_pca"}, {"score": 0.004618720776729413, "phrase": "convex_sets"}, {"score": 0.003450966222451681, "phrase": "nonlinear_eigenspace"}, {"score": 0.0034101316738399203, "phrase": "visual_and_semantic_features"}, {"score": 0.003118838635447237, "phrase": "semantic_features"}, {"score": 0.0029561107046138136, "phrase": "least_squares_sense"}, {"score": 0.002655616553414394, "phrase": "optimal_cluster"}, {"score": 0.0022745508619577927, "phrase": "similar_images"}, {"score": 0.00213023743193503, "phrase": "obtained_semantic_features"}, {"score": 0.0021049977753042253, "phrase": "experimental_results"}], "paper_keywords": ["CBIR", " semantic image analysis", " POCS", " KPCA"], "paper_abstract": "A projection onto convex sets (POCS)-based annotation method for semantic image retrieval is presented in this paper. Utilizing database images previously annotated by keywords, the proposed method estimates unknown semantic features of a query image from its known visual features based on a POCS algorithm, which includes two novel approaches. First, the proposed method semantically assigns database images to some clusters and introduces a nonlinear eigenspace of visual and semantic features in each cluster into the constraint of the POCS algorithm. This approach accurately provides semantic features for each cluster by using its visual features in the least squares sense. Furthermore, the proposed method monitors the error converged by the POCS algorithm in order to select the optimal cluster including the query image. By introducing the above two approaches into the POCS algorithm, the unknown semantic features of the query image are successfully estimated from its known visual features. Consequently, similar images can be easily retrieved from the database based on the obtained semantic features. Experimental results verify the effectiveness of the proposed method for semantic image retrieval.", "paper_title": "POCS-based annotation method using kernel PCA for semantic image retrieval", "paper_id": "WOS:000258394300009"}