{"auto_keywords": [{"score": 0.03909673303902588, "phrase": "cbir_systems"}, {"score": 0.00481495049065317, "phrase": "pairwise_recommendation"}, {"score": 0.004232475065285966, "phrase": "returned_images"}, {"score": 0.004134372859330047, "phrase": "first_positions"}, {"score": 0.0038989120088094185, "phrase": "image_content_descriptors"}, {"score": 0.0034268702387746106, "phrase": "similarity_measures"}, {"score": 0.0032697235411641695, "phrase": "rich_information"}, {"score": 0.00304737045343781, "phrase": "novel_re-ranking_approach"}, {"score": 0.002924694271730544, "phrase": "cbir_tasks"}, {"score": 0.0027417911324611917, "phrase": "recommendation-based_strategy"}, {"score": 0.0026624684547385718, "phrase": "clustering_method"}, {"score": 0.002600661525224505, "phrase": "contextual_information"}, {"score": 0.002555247330102505, "phrase": "ranked_lists"}, {"score": 0.0023953929817357882, "phrase": "proposed_method"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Content-based image retrieval", " Re-ranking", " Rank aggregation", " Recommendation"], "paper_abstract": "In Content-based Image Retrieval (CBIR) systems, accurately ranking collection images is of great relevance. Users are interested in the returned images placed at the first positions, which usually are the most relevant ones. Commonly, image content descriptors are used to compute ranked lists in CBIR systems. In general, these systems perform only pairwise image analysis, that is, compute similarity measures considering only pairs of images, ignoring the rich information encoded in the relations among several images. This paper presents a novel re-ranking approach used to improve the effectiveness of CBIR tasks by exploring relations among images. In our approach, a recommendation-based strategy is combined with a clustering method. Both exploit contextual information encoded in ranked lists computed by CBIR systems. We conduct several experiments to evaluate the proposed method. Our experiments consider shape, color, and texture descriptors and comparisons with other post-processing methods. Experimental results demonstrate the effectiveness of our method. (C) 2012 Elsevier Inc. All rights reserved.", "paper_title": "Exploiting pairwise recommendation and clustering strategies for image re-ranking", "paper_id": "WOS:000305727400002"}