{"auto_keywords": [{"score": 0.023974283232871745, "phrase": "planetlab"}, {"score": 0.004755650013733963, "phrase": "peer-to-peer_architecture"}, {"score": 0.004658426838467567, "phrase": "promising_approach"}, {"score": 0.0045820747375409435, "phrase": "ubiquitous_deployment"}, {"score": 0.0045443671106012405, "phrase": "live_video_broadcasting"}, {"score": 0.0039649719120779066, "phrase": "user_dynamics"}, {"score": 0.0036502716977381004, "phrase": "participating_members"}, {"score": 0.0033883824438527316, "phrase": "centralized_server_resources"}, {"score": 0.0032376465741070274, "phrase": "ubiquitous_video_broadcasting"}, {"score": 0.0031193028729331667, "phrase": "alternative_architecture"}, {"score": 0.0029928611380840757, "phrase": "broadcast_event"}, {"score": 0.0027665315772006575, "phrase": "waypoint_community"}, {"score": 0.0022962708568492734, "phrase": "detailed_results"}, {"score": 0.0022773309395419427, "phrase": "trace-driven_experiments"}, {"score": 0.0022122603123901114, "phrase": "emulab"}, {"score": 0.0021579641460002523, "phrase": "waypoint_architecture"}], "paper_keywords": ["P2P", " Video streaming", " Waypoints", " Resource constraint", " Churn"], "paper_abstract": "A peer-to-peer architecture has emerged as a promising approach to enabling the ubiquitous deployment of live video broadcasting on the Internet. However the performance in these architectures is unpredictable and fundamentally constrained by the characteristics of the members participating in the broadcast. By characteristics, we refer to user dynamics, out-going bandwidth connectivity, whether the member is behind NAT/firewall, and the network conditions among participating members. While several researchers have looked at hybrid P2P/CDN approaches to address these issues, such approaches require provisioning of centralized server resources prior to a broadcast, which complicates the goal of ubiquitous video broadcasting. In this paper, we explore an alternative architecture where users are willing to donate their bandwidth resources to a broadcast event, even though they are not a participant in the event. Such users constitute what we term a waypoint community. Any given broadcast event involves constructing overlays only based on participants to the extent possible, however waypoints may be dynamically invoked in an on-demand, performance-driven fashion to improve the performance of a broadcast. We present the design of a system built on this idea. Detailed results from trace-driven experiments over the PlanetLab distributed infrastructure and Emulab demonstrate the potential of the waypoint architecture to improve the performance of purely P2P-based overlays.", "paper_title": "On-demand waypoints for live P2P video broadcasting", "paper_id": "WOS:000284095500004"}