{"auto_keywords": [{"score": 0.04756160675680242, "phrase": "ga"}, {"score": 0.010611832868207167, "phrase": "geographic_atrophy"}, {"score": 0.010470475046957788, "phrase": "age-related_macular_degeneration"}, {"score": 0.00956385981367002, "phrase": "natural_course"}, {"score": 0.008222479613387375, "phrase": "forward_selection_procedure"}, {"score": 0.004455600384922355, "phrase": "amd"}, {"score": 0.00430777589162606, "phrase": "suspected_modifying_factors"}, {"score": 0.0040951809276235495, "phrase": "atrophic_amd."}, {"score": 0.0039061983019451903, "phrase": "fundus_outofluorescence_images"}, {"score": 0.00384083110935486, "phrase": "different_putative_risk_factors"}, {"score": 0.0036759314172445934, "phrase": "likelihood_ratio_test"}, {"score": 0.0036022217019257598, "phrase": "non-significant_results"}, {"score": 0.0034243271052114234, "phrase": "parametric_post-hoc_bootstrap_approach"}, {"score": 0.0033669963955215427, "phrase": "mean_increase"}, {"score": 0.003104849179057156, "phrase": "patient_and_eye-specific_random_effects"}, {"score": 0.003042555825368091, "phrase": "patient-specific_risk_factors"}, {"score": 0.0030220695120265974, "phrase": "ocular-specific_risk_factors"}, {"score": 0.0029614320534324104, "phrase": "ga_growth"}, {"score": 0.002931569771634119, "phrase": "post-hoc_bootstrap_procedure"}, {"score": 0.0027032319980161805, "phrase": "additional_increase"}, {"score": 0.0024926348205500715, "phrase": "linear_mixed_effects_regression_models"}, {"score": 0.0023774292521631093, "phrase": "ga._data"}, {"score": 0.0022370795358896784, "phrase": "ga_growth_process"}], "paper_keywords": ["macular degeneration", " regression analyses", " likelihood ratio test", " risk factors", " natural history"], "paper_abstract": "Objectives. Identifying factors influencing the growth of geographic atrophy (GA) in patients with age-related macular degeneration (AMD). Methods. Data on the natural course and suspected modifying factors were collected as part of the multicenter, longitudinal, observational FAM-study in 178 eyes of 114 patients with atrophic AMD. The endpoint of interest - the size of GA - was measured in fundus outofluorescence images. The influence of different putative risk factors on progression of GA is investigated with a forward selection procedure based on the likelihood ratio test. In order to interpret non-significant results of the forward selection procedure, the power of the tests used was quantified by a parametric post-hoc bootstrap approach. Results: A mean increase in GA of 1.75 mm(2) per year was estimated for the given population (95% Cl: [1.46; 2.02]). Patient and eye-specific random effects could be assessed. Neither patient-specific risk factors nor ocular-specific risk factors show any significant influence on GA growth. The post-hoc bootstrap procedure shows that only very strong effects can be detected on the basis of the given data. For example, the hypercholesteremia which would result in an additional increase of GA by near 4 mm(2) per year can be detected with a power of 80%. Conclusions. The use of linear mixed effects regression models offers a convenient way to explore sources of variation in the natural course of GA. Data from further follow-up examinations and data about other putative risk factors than those investigated will be needed to further investigate of the GA growth process. The procedure described in this article is easily applicable to other putative risk factors-as well as to other fields of application.", "paper_title": "Discovery of factors influencing the growth of geographic atrophy in patients with age-related macular degeneration", "paper_id": "WOS:000249094000009"}