{"auto_keywords": [{"score": 0.0496439738720196, "phrase": "japan"}, {"score": 0.02281370501607229, "phrase": "korea"}, {"score": 0.022610014632120517, "phrase": "taiwan"}, {"score": 0.011144516740176304, "phrase": "core_assignees"}, {"score": 0.00715226826926856, "phrase": "genetic_engineering_research"}, {"score": 0.005174734119613454, "phrase": "bradford's_law"}, {"score": 0.004455409162867219, "phrase": "research_growth"}, {"score": 0.004354841111644036, "phrase": "research_productivity"}, {"score": 0.004103817210338686, "phrase": "patent_bibliometrics"}, {"score": 0.0039928721865882, "phrase": "quantitative_methods"}, {"score": 0.003711409222544974, "phrase": "united_states_patent_and_trademark_office"}, {"score": 0.0035133644847622383, "phrase": "patent_and_citation_count"}, {"score": 0.003371773890338284, "phrase": "genetic_engineering"}, {"score": 0.0033410898465226417, "phrase": "patent_coupling_approach"}, {"score": 0.002163600705898299, "phrase": "japan_based_institutions"}, {"score": 0.0021049977753042253, "phrase": "patent_coupling"}], "paper_keywords": [""], "paper_abstract": "The aim of this study is to reveal the research growth, the distribution of research productivity and impact of genetic engineering research in Japan, Korea and Taiwan by taking patent bibliometrics approach. This study uses quantitative methods adopt from bibliometrics to analyze the patents granted to Japan, Korea and Taiwan by United States Patent and Trademark Office (USPTO) from 1991 to 2002. In addition to patent and citation count, Bradford's Law is applied to identify core assignees in genetic engineering. Patent coupling approach is taken to further analyze the patents granted to the core assignees to enclose the correlations among the core assignees. 13,055 genetic engineering patents were granted during the period of 1991 to 2002. Japan, Korea and Taiwan own 841 patents and Japan owns most of them. 270 assignees shared 841 patents and 16 core assignees are identified by the Bradford's Law. 18,490 patents were cited by the 13,055 patents and 1,146 out of the 18,490 cited patents were granted to Japan, Korea and Taiwan. The results show Japan performs best in productivity and research impact among three countries. The core assignees are also Japan based institutions and four technical clusters are identified by patent coupling.", "paper_title": "Patent analysis of genetic engineering research in Japan, Korea and Taiwan", "paper_id": "WOS:000243471400011"}