{"auto_keywords": [{"score": 0.02424807393702923, "phrase": "higher_ratio"}, {"score": 0.023914587670655157, "phrase": "valuable_product_ideas"}, {"score": 0.00481495049065317, "phrase": "product_ideas"}, {"score": 0.004361644989356558, "phrase": "product_database"}, {"score": 0.00310664242361199, "phrase": "use-scenario_attributes"}, {"score": 0.0029565620771207003, "phrase": "fuzzy_ahp_technique"}, {"score": 0.0028944757265206332, "phrase": "fuzzy_cbr_retrieving_mechanism"}, {"score": 0.0026214978443388653, "phrase": "baseline_product"}, {"score": 0.0024772013657695896, "phrase": "fuzzy_cbr_mechanism"}, {"score": 0.0023742031943872464, "phrase": "retrieved_product_ideas"}, {"score": 0.0021501863832966966, "phrase": "retrieving-and-filtering_mechanism"}, {"score": 0.0021049977753042253, "phrase": "prior_retrieuing-only_mechanism"}], "paper_keywords": ["new product development", " case-based reasoning", " fuzzy CBR", " fuzzy AHP"], "paper_abstract": "This paper presents a fuzzy CBR (case-based reasoning) technique for generating new product ideas from a product database for enhancing the functions of a given product (called the baseline product). In the database, a product is modeled by a 100-attribute vector, 87 of which are used to model the use-scenario and 13 are used to describe the manufacturing/recycling features. Based on the use-scenario attributes and their relative weights - determined by a fuzzy AHP technique, a fuzzy CBR retrieving mechanism is developed to retrieve product-ideas that tend to enhance the functions of the baseline product. Based on the manufacturing/recycling features, a fuzzy CBR mechanism is developed to screen the retrieved product ideas in order to obtain a higher ratio of valuable product ideas. Experiments indicate that the retrieving-and-filtering mechanism outperforms the prior retrieuing-only mechanism in terms of generating a higher ratio of valuable product ideas. (c) 2006 Elsevier Ltd. All rights reserved.", "paper_title": "A fuzzy CBR technique for generating product ideas", "paper_id": "WOS:000250295300053"}