{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "threshold_model"}, {"score": 0.044977331771395686, "phrase": "sign_language"}, {"score": 0.03933785737409739, "phrase": "nonsign_patterns"}, {"score": 0.02950634012562076, "phrase": "continuous_data"}, {"score": 0.028117928061402796, "phrase": "isolated_data"}, {"score": 0.004750527930368202, "phrase": "conditional_random_fields"}, {"score": 0.004708056866527125, "phrase": "sign_language_spotting"}, {"score": 0.004481132747216135, "phrase": "signed_utterance"}, {"score": 0.004401342842183475, "phrase": "set_vocabulary"}, {"score": 0.003933736547198066, "phrase": "continuous_gesture_stream"}, {"score": 0.0038636556112977226, "phrase": "transitional_movements"}, {"score": 0.003677280504320636, "phrase": "out-of-vocabulary_signs"}, {"score": 0.003141830113006653, "phrase": "short-sign_detector"}, {"score": 0.003099723664407622, "phrase": "hand_appearance-based_sign_verification_method"}, {"score": 0.002453116398642071, "phrase": "short-sign_detection"}, {"score": 0.002387758958649797, "phrase": "hand_appearance-based_sign_verification"}, {"score": 0.0021049977753042253, "phrase": "conventional_crfs"}], "paper_keywords": ["Sign language recognition", " sign language spotting", " conditional random field", " threshold model"], "paper_abstract": "Sign language spotting is the task of detecting and recognizing signs in a signed utterance, in a set vocabulary. The difficulty of sign language spotting is that instances of signs vary in both motion and appearance. Moreover, signs appear within a continuous gesture stream, interspersed with transitional movements between signs in a vocabulary and nonsign patterns (which include out-of-vocabulary signs, epentheses, and other movements that do not correspond to signs). In this paper, a novel method for designing threshold models in a conditional random field (CRF) model is proposed which performs an adaptive threshold for distinguishing between signs in a vocabulary and nonsign patterns. A short-sign detector, a hand appearance-based sign verification method, and a subsign reasoning method are included to further improve sign language spotting accuracy. Experiments demonstrate that our system can spot signs from continuous data with an 87.0 percent spotting rate and can recognize signs from isolated data with a 93.5 percent recognition rate versus 73.5 percent and 85.4 percent, respectively, for CRFs without a threshold model, short-sign detection, subsign reasoning, and hand appearance-based sign verification. Our system can also achieve a 15.0 percent sign error rate (SER) from continuous data and a 6.4 percent SER from isolated data versus 76.2 percent and 14.5 percent, respectively, for conventional CRFs.", "paper_title": "Sign Language Spotting with a Threshold Model Based on Conditional Random Fields", "paper_id": "WOS:000266188900010"}