{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "patent_characteristics"}, {"score": 0.04216792154193272, "phrase": "examiner_patent_citations"}, {"score": 0.004635187610736025, "phrase": "patent_citations"}, {"score": 0.004389912080394437, "phrase": "technological_impact"}, {"score": 0.003668591097652231, "phrase": "applicant_citations"}, {"score": 0.003272375502853897, "phrase": "patent_examiners"}, {"score": 0.0031159081999910694, "phrase": "technology_classes"}, {"score": 0.002646267286675984, "phrase": "technology_impact"}, {"score": 0.0024519545383399773, "phrase": "important_caveats"}, {"score": 0.00230932021677234, "phrase": "international_patents"}, {"score": 0.002128067018576581, "phrase": "context-driven_use"}, {"score": 0.0021049977753042253, "phrase": "citation-based_indicators"}], "paper_keywords": [""], "paper_abstract": "Patent citations added by examiners are often used as indicators of technological impact and knowledge flows, despite various criticisms. In this study we analyze the distribution of examiner patent citations according to patent characteristics in order to show their limitations. According to our findings, the number of applicant citations included is dependent on the science-base of the technology. However, this gets masked by the citations added by patent examiners, who smooth the distribution of citations across technology classes and include the same number of citations regardless of whether applicants cite any references. Some researchers have called for the use of applicant rather than examiner patent citations as indicators of technology impact and knowledge flows. Nevertheless, we show that the former also have important caveats, because applicants may increase the number of citations in international patents and when there are coapplicants. The implication is that analysts should consider a context-driven use of citation-based indicators.", "paper_title": "Smoothing the Lies: The Distinctive Effects of Patent Characteristics on Examiner and Applicant Citations", "paper_id": "WOS:000294255200006"}