{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "non-exact_replications"}, {"score": 0.004776853267973129, "phrase": "software_engineering_experiments"}, {"score": 0.004664352260912174, "phrase": "engineering_discipline"}, {"score": 0.004518442937844318, "phrase": "isolated_experiments"}, {"score": 0.004412000844879264, "phrase": "single_experiment"}, {"score": 0.004257000695796238, "phrase": "underlying_reality"}, {"score": 0.004223299391912042, "phrase": "experiment_replication"}, {"score": 0.004010624853427534, "phrase": "multiple_replications"}, {"score": 0.00385431710959668, "phrase": "software_engineering"}, {"score": 0.0036456298076415652, "phrase": "natural_sciences"}, {"score": 0.0034895911869254146, "phrase": "numerous_attempts"}, {"score": 0.0032744315183287024, "phrase": "exact_replications"}, {"score": 0.003097043800165555, "phrase": "software_development_setting"}, {"score": 0.0026099289298770023, "phrase": "new_variables"}, {"score": 0.00252812242767189, "phrase": "experiment_results"}, {"score": 0.0022886031992739126, "phrase": "replication's_contribution"}, {"score": 0.0022168460543913787, "phrase": "proposed_process"}, {"score": 0.002164505365535068, "phrase": "multiple-case_study"}], "paper_keywords": ["Experimentation", " Experiment replication", " Combination of experiment results"], "paper_abstract": "In no science or engineering discipline does it make sense to speak of isolated experiments. The results of a single experiment cannot be viewed as representative of the underlying reality. Experiment replication is the repetition of an experiment to double-check its results. Multiple replications of an experiment increase the confidence in its results. Software engineering has tried its hand at the identical (exact) replication of experiments in the way of the natural sciences (physics, chemistry, etc.). After numerous attempts over the years, apart from experiments replicated by the same researchers at the same site, no exact replications have yet been achieved. One key reason for this is the complexity of the software development setting, which prevents the many experimental conditions from being identically reproduced. This paper reports research into whether non-exact replications can be of any use. We propose a process aimed at researchers running non-exact replications. Researchers enacting this process will be able to identify new variables that are possibly having an effect on experiment results. The process consists of four phases: replication definition and planning, replication operation and analysis, replication interpretation, and analysis of the replication's contribution. To test the effectiveness of the proposed process, we have conducted a multiple-case study, revealing the variables learned from two different replications of an experiment.", "paper_title": "The role of non-exact replications in software engineering experiments", "paper_id": "WOS:000289254600001"}