{"auto_keywords": [{"score": 0.031963387236997626, "phrase": "june"}, {"score": 0.00481495049065317, "phrase": "digital_environment"}, {"score": 0.004488946121663966, "phrase": "deep_log_methods"}, {"score": 0.0043560464825349275, "phrase": "early_findings"}, {"score": 0.004291073117901643, "phrase": "exploratory_deep_log_analysis"}, {"score": 0.004040688646993605, "phrase": "maxdata_project"}, {"score": 0.0038624981944755813, "phrase": "original_\"big_deal"}, {"score": 0.003766908559075843, "phrase": "single_digital_platform"}, {"score": 0.0034940519373446335, "phrase": "raw_logs"}, {"score": 0.003424677513304057, "phrase": "ohiolink"}, {"score": 0.0027327327233891865, "phrase": "methodological_point"}, {"score": 0.0026516890043911836, "phrase": "attractive_platform"}, {"score": 0.0025859868507329634, "phrase": "publication_usage_studies"}, {"score": 0.002496722870659199, "phrase": "oldest_e-journal_libraries"}, {"score": 0.0023864566654035924, "phrase": "stable_platform"}, {"score": 0.0022022878843247257, "phrase": "search_approach"}, {"score": 0.0021262403223013242, "phrase": "journal_item"}], "paper_keywords": [""], "paper_abstract": "The article presents the early findings of an exploratory deep log analysis of journal usage on OhioLINK, conducted as part of the MaxData project, funded by the U.S. Institute of Museum and Library Services. OhioLINK, the original \"Big Deal,\" provides a single digital platform of nearly 6,000 full-text journals for more than 600,000 people; for the purposes of the analysis, the raw logs were obtained from OhioLINK for the period June 2004 to December 2004. During this period approximately 1,215,000 items were viewed on campus in October 2004 and 1,894,000 items viewed off campus between June and December 2004. This article provides an analysis of the age of material that users consulted. From a methodological point of view OhioLINK offered an attractive platform to conduct age of publication usage studies because it is one of the oldest e-journal libraries and thus offered a relatively long archive and stable platform to conduct the studies. The project sought to determine whether the subject, the search approach adopted, and the type of journal item viewed (contents page, abstract, full-text article, etc.) was a factor in regard to the age of articles used.", "paper_title": "Article decay in the digital environment: An analysis of usage of OhioLINK by date of publication, employing deep log methods", "paper_id": "WOS:000241688900013"}