{"auto_keywords": [{"score": 0.028214801741057678, "phrase": "best_solution"}, {"score": 0.025862378771917365, "phrase": "suggestion_protocol"}, {"score": 0.025613089897828317, "phrase": "different_numbers"}, {"score": 0.00481495049065317, "phrase": "multi-agent_negotiations"}, {"score": 0.0033379819706003885, "phrase": "free_time"}, {"score": 0.003023047748772801, "phrase": "average_preference"}, {"score": 0.0027925723953701083, "phrase": "full_information_and_approval_protocols"}, {"score": 0.002579622880371082, "phrase": "voting_protocol"}, {"score": 0.002467038647952607, "phrase": "simulation_results"}, {"score": 0.002301572462091142, "phrase": "different_strategies"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["meeting scheduling", " multi-agent negotiation", " calendar"], "paper_abstract": "This work presents a set of protocols for scheduling a meeting among agents that represent their respective user's interests. Four protocols are discussed: a) the full information protocol when all agents are comfortable with sharing their preference profile and free times; b) the approval protocol when only the preference profile can be shared; c) the voting protocol when only free time can be shared; and d) the suggestion protocol if neither preference nor free time can be shared. We use non-standard metric to evaluate the protocols which aims at maximizing the average preference, but also seeks to reduce the differences in preferences among the agents. The full information and approval protocols are optimal, that is, they achieve the best solution. Results show that the voting protocol achieves the best solution 88% of the time. Simulation results for the suggestion protocol with different numbers of agents, different numbers of solutions, and different strategies are presented. The suggestion protocol is shown to be coalition-free. (C) 2007 Elsevier B.V. All rights reserved.", "paper_title": "Scheduling meetings through multi-agent negotiations", "paper_id": "WOS:000250079300020"}