{"auto_keywords": [{"score": 0.034855248354126823, "phrase": "double-precision_fpa"}, {"score": 0.015719716506582538, "phrase": "floating-point_addition"}, {"score": 0.010381292935001995, "phrase": "critical_path_delay"}, {"score": 0.0047152877145889656, "phrase": "multiple_special_functional_units"}, {"score": 0.004475022550508119, "phrase": "new_functional_unit"}, {"score": 0.004246955944279591, "phrase": "fpa"}, {"score": 0.003905864553426306, "phrase": "step_and_readjustment_step"}, {"score": 0.0037653554368382814, "phrase": "time-consuming_steps"}, {"score": 0.0035733198242955634, "phrase": "fpa_critical_path_delay"}, {"score": 0.003373334961160647, "phrase": "synthesis_results"}, {"score": 0.0028527866590859967, "phrase": "worst_case_delay"}, {"score": 0.002172266188075892, "phrase": "almost_one-third_area"}, {"score": 0.0021049977753042253, "phrase": "individual_cells"}], "paper_keywords": ["Floating-point addition", " rounding", " computer arithmetic", " hardware implementation", " VLSI design"], "paper_abstract": "Most recent microprocessors present multiple special functional units to optimize their performance. In this paper, a new functional unit called the calculation and anticipation (C&A) unit is presented for the IEEE 754 standard floating-point adder (FPA) that is the most important and frequently used calculation part for both modern CPUs and GPUs. C&A unit parallelize rounding step and readjustment step, which are known as the time-consuming steps for floating-point addition with significand addition. Therefore it reduces FPA critical path delay enormously, and even more decreases a little FPA area occupation. The synthesis results show that the double-precision FPA with C&A unit takes about 17.17% improvement in the critical path delay, while saves about 8.32% area than the conventional one. It takes 5.90% advantage in area and 19.58% improvement in the worst case delay than the double-precision FPA from the Open Core module \"fpu-double\" (rev 14 2010-02-13) synthesized in the same 0.13-mu m CMOS bulk. Furthermore, comparing with the two-path double-precision FPA synthesized using LSI Logic's gflxp 0.11-mu m CMOS library, it takes about 4.30% advantage in the critical path delay, and saves almost one-third area in the number of the individual cells.", "paper_title": "The Calculation and Anticipation Unit for Floating-Point Addition", "paper_id": "WOS:000350569300004"}