{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "context-aware_pervasive_systems"}, {"score": 0.004688321299229397, "phrase": "important_emerging_category"}, {"score": 0.00451659023910662, "phrase": "daily_life"}, {"score": 0.004169394481182493, "phrase": "physical_world"}, {"score": 0.0038283058265876713, "phrase": "incremental_approach"}, {"score": 0.003687960013746783, "phrase": "particular_emphasis"}, {"score": 0.002947266048104005, "phrase": "compositional_manner"}, {"score": 0.002884979280317279, "phrase": "multiple_systems"}, {"score": 0.0027495914857929584, "phrase": "formal_way"}, {"score": 0.002537880772794665, "phrase": "scripting_language"}, {"score": 0.0025109095718850376, "phrase": "programming_composite_systems"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Context-aware computing", " Incremental awareness", " Composition", " Software engineering", " Declarative programming languages"], "paper_abstract": "Context-aware pervasive systems are an important emerging category of software, increasingly pervading into daily life, play and work. These systems are characterized by capabilities for sensing the physical world and taking action, autonomously or in cooperation with users. This paper proposes an incremental approach to building context-aware pervasive systems, with a particular emphasis on systematically extending over time the contexts and situations a system can be aware of, and creating a formalism in which these systems can be composed. We present a formalism of operators for building context-aware pervasive systems incrementally and in a compositional manner (by combining multiple systems and subsystems), facilitating reuse in a formal way. The formalism can serve as: (i) a basis for a scripting language for programming composite systems, and (ii) a language for specifying these systems (whether existing or to be built) and then reasoning with specifications of these systems. (C) 2009 Elsevier B.V. All rights reserved.", "paper_title": "Incremental awareness and compositionality: A design philosophy for context-aware pervasive systems", "paper_id": "WOS:000208192700006"}