{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "interactive_devices"}, {"score": 0.004757087682427765, "phrase": "information_resource_constraints"}, {"score": 0.004606148097788071, "phrase": "interactive_system"}, {"score": 0.0041144374213500715, "phrase": "safety-critical_systems"}, {"score": 0.00398380712846857, "phrase": "negative_consequences"}, {"score": 0.0038728990904778678, "phrase": "assessment_use_tasks"}, {"score": 0.0037955672944969287, "phrase": "explicit_representation"}, {"score": 0.0036898803847106023, "phrase": "normative_user_behaviours"}, {"score": 0.0031780859997873803, "phrase": "user_behaviours"}, {"score": 0.0030646951765987414, "phrase": "individual_experience"}, {"score": 0.0029672941061574375, "phrase": "systematic_formal_method"}, {"score": 0.002931569771634119, "phrase": "interactive_systems"}, {"score": 0.0027704444816096484, "phrase": "precise_assumptions"}, {"score": 0.0027370835853738626, "phrase": "information_resources"}, {"score": 0.0023666732429695908, "phrase": "common_use"}, {"score": 0.0022546720211200893, "phrase": "resource_assumptions"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Formal analysis", " Task analysis", " Distributed cognition", " IV infusion pumps"], "paper_abstract": "Analysis of the usability of an interactive system requires both an understanding of how the system is to be used and a means of assessing the system against that understanding. Such analytic assessments are particularly important in safety-critical systems as latent vulnerabilities may exist which have negative consequences only in certain circumstances. Many existing approaches to assessment use tasks or scenarios to provide explicit representation of their understanding of use. These normative user behaviours have the advantage that they clarify assumptions about how the system will be used but have the disadvantage that they may exclude many plausible deviations from these norms. Assessments of how a design fails to support these user behaviours can be a matter of judgement based on individual experience rather than evidence. We present a systematic formal method for analysing interactive systems that is based on constraints rather than prescribed behaviour. These constraints capture precise assumptions about what information resources are used to perform action. These resources may either reside in the system itself or be external to the system. The approach is applied to two different medical device designs, comparing two infusion pumps currently in common use in hospitals. Comparison of the two devices is based on these resource assumptions to assess consistency of interaction within the design of each device. (C) 2013 Elsevier Ltd. All rights reserved.", "paper_title": "Analysing interactive devices based on information resource constraints", "paper_id": "WOS:000331485800002"}