{"auto_keywords": [{"score": 0.049722360725641276, "phrase": "identity_federations"}, {"score": 0.008148351967065, "phrase": "service_providers"}, {"score": 0.00481495049065317, "phrase": "payment_approaches"}, {"score": 0.004690583510896564, "phrase": "saml_technology"}, {"score": 0.00453537012358554, "phrase": "convenient_and_secure_attribute-based_authentication_and_authorization_systems"}, {"score": 0.004385270183517169, "phrase": "academic_sector"}, {"score": 0.0040691889755318155, "phrase": "federated_customers"}, {"score": 0.003964007795174772, "phrase": "commercial_service_providers"}, {"score": 0.003226513431715486, "phrase": "large_commercial_providers"}, {"score": 0.0031312981393997355, "phrase": "payment_support"}, {"score": 0.0030963190575539574, "phrase": "major_disadvantage"}, {"score": 0.002949189427671915, "phrase": "electronic_payment_solutions"}, {"score": 0.0029271812818615042, "phrase": "identity_federation_approaches"}, {"score": 0.0027159094186967247, "phrase": "electronic_payment_approaches"}, {"score": 0.002675516297446243, "phrase": "identity_federation_mechanisms"}, {"score": 0.0025578967205807843, "phrase": "early_stages"}, {"score": 0.0025388011374541546, "phrase": "identity-based_payments"}, {"score": 0.0025198477493173165, "phrase": "final_full_integrated_saml-based_payment_approaches"}, {"score": 0.002427177130359851, "phrase": "powerful_business_solution"}, {"score": 0.002320449502337321, "phrase": "major_concern"}, {"score": 0.0022859244876449396, "phrase": "payment_solutions"}, {"score": 0.0021049977753042253, "phrase": "sufficient_level"}], "paper_keywords": ["Identity Federations", " Electronic Payment Approaches", " Shibboleth", " Liberty Alliance", " SAML-based Payments"], "paper_abstract": "Identity Federations are increasingly being used to establish convenient and secure attribute-based authentication and authorization systems. Whilst this process began mainly in the academic sector, it is assumed that over the next few years more and more commercial Service Providers will join Identity Federations in order to offer their services and products to federated customers. However, the introduction of commercial Service Providers demands a solution for payment, which has not been deployed during the early years of Identity Federations. Thus, Service Providers have to implement not only the federation application, but also additional payment solutions; a problem, by which the federation may appear unattractive for Service Providers, especially semi-commercial or those requiring micropayments. Even for large commercial providers entering a federation, the lack of payment support is a major disadvantage that may lead to either customer or profit loss. Thus, although a combination of electronic Payment solutions and Identity Federation approaches would provide several benefits to its participants, there has not been much investigation of such combinations. Therefore, this paper analyses electronic payment approaches as well as Identity Federation mechanisms and focuses on a solution to bridge these two aspects. Besides early stages of identity-based payments, final full integrated SAML-based payment approaches, which merge payments and Identity Federation into a powerful business solution, are also highlighted. However, since security is a major concern when focusing on payment solutions, several approaches have been investigated, including security and privacy evaluations, and, within this survey, only those solutions providing a sufficient level of security and privacy have been taken into consideration.", "paper_title": "A Survey of Payment Approaches for Identity Federations in Focus of the SAML Technology", "paper_id": "WOS:000327250500021"}