{"auto_keywords": [{"score": 0.004666756595735701, "phrase": "arbitrary_algorithms"}, {"score": 0.004563691742821759, "phrase": "abstract_state_machines"}, {"score": 0.004136469845987887, "phrase": "first_article"}, {"score": 0.002905454531687249, "phrase": "previous_article's_formal_description"}, {"score": 0.0028032928749970026, "phrase": "behavioral_equivalence"}, {"score": 0.0025291018422967083, "phrase": "asm_literature"}, {"score": 0.0024292428060702803, "phrase": "ordinary_algorithms"}, {"score": 0.0022311596751824416, "phrase": "final_article"}, {"score": 0.0021239335561699106, "phrase": "abstract_state_machine_thesis"}], "paper_keywords": ["algorithms", " theory", " sequential algorithms", " interaction", " postulates", " equivalence of algorithms", " abstract state machines"], "paper_abstract": "This is the second in a series of three articles extending the proof of the Abstract State Machine Thesis-that arbitrary algorithms are behaviorally equivalent to abstract state machines-to algorithms that can interact with their environments during a step, rather than only between steps. As in the first article of the series, we are concerned here with ordinary, small-step, interactive algorithms.,This means that the algorithms: (1) proceed in discrete, global steps, (2) perform only a bounded amount of work in each step, (3) use only such information from the environment as can be regarded as answers to queries, and (4) never complete a step until all queries from that step have been answered. After reviewing the previous article's formal description of such algorithms and the definition of behavioral equivalence, we define ordinary, interactive, small-step abstract state machines (ASMs). Except for very minor modifications, these are the machines commonly used in the ASM literature. We define their semantics in the framework of ordinary algorithms and show that they satisfy the postulates for these algorithms. This material lays the groundwork for the final article in the series, in which we shall prove the Abstract State Machine thesis for ordinary, intractive, small-step algorithms: All such algorithms are equivalent to ASMs.", "paper_title": "Ordinary interactive small-step algorithms, II", "paper_id": "WOS:000248577000002"}