{"auto_keywords": [{"score": 0.040014386545052336, "phrase": "np"}, {"score": 0.026143028604662312, "phrase": "clique_graph"}, {"score": 0.008712665283563518, "phrase": "complete_set"}, {"score": 0.008154823303040647, "phrase": "clique_family"}, {"score": 0.007531998406232395, "phrase": "graph_h"}, {"score": 0.005032679116138007, "phrase": "helly_property"}, {"score": 0.004810489462059257, "phrase": "independent_set"}, {"score": 0.004663875663629251, "phrase": "complete_subgraph"}, {"score": 0.0045901169723656194, "phrase": "maximal_complete_set"}, {"score": 0.004329466192376432, "phrase": "intersection_graph"}, {"score": 0.004083555803143928, "phrase": "clique_graph_recognition_problem"}, {"score": 0.0037504923448342447, "phrase": "graph_g"}, {"score": 0.0037305983294576572, "phrase": "maximum_degree"}, {"score": 0.003700954256923024, "phrase": "maximum_clique_size"}, {"score": 0.0035656887183970164, "phrase": "graph_classes"}, {"score": 0.0031319737448161395, "phrase": "k"}, {"score": 0.003063979184187375, "phrase": "stable_set"}, {"score": 0.0029851549163252803, "phrase": "g"}, {"score": 0.0027988999819725303, "phrase": "spanning_family"}, {"score": 0.0022201696253241706, "phrase": "private_neighbor"}, {"score": 0.0021049977753042253, "phrase": "k_vertical_bar"}], "paper_keywords": ["Clique graphs", " Helly property", " NP-complete", " Split graphs"], "paper_abstract": "A complete set of a graph G is a subset of vertices inducing a complete subgraph. A clique is a maximal complete set. Denote by C(G) the clique family of G. The clique graph of G, denoted by K(G), is the intersection graph of C(G). Say that G is a clique graph if there exists a graph H such that G = K(H). The clique graph recognition problem, a long-standing open question posed in 1971, asks whether a given graph is a clique graph and it was recently proved to be NP-complete even for a graph G with maximum degree 14 and maximum clique size 12. Hence, if P not equal NP, the study of graph classes where the problem can be proved to be polynomial, or of more restricted graph classes where the problem remains NP-complete is justified. We present a proof that given a split graph G = (V, E) with partition (K, S) for V, where K is a complete set and S is a stable set, deciding whether there is a graph H such that G is the clique graph of H is NP-complete. As a byproduct, we prove that determining whether a given set family admits a spanning family satisfying the Helly property is NP-complete. Our result is optimum in the sense that each vertex of the independent set of our split instance has degree at most 3, whereas when each vertex of the independent set has degree at most 2 the problem is polynomial, since it is reduced to the problem of checking whether the clique family of the graph satisfies the Helly property. Additionally, we show three split graph subclasses for which the problem is polynomially solvable: the subclass where each vertex of S has a private neighbor, the subclass where vertical bar S vertical bar <= 3, and the subclass where vertical bar K vertical bar <= 4. (C) 2013 Elsevier B.V. All rights reserved.", "paper_title": "Split clique graph complexity", "paper_id": "WOS:000326007400003"}