{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "designs"}, {"score": 0.0034392837410790293, "phrase": "closed_manner"}, {"score": 0.003169222811082848, "phrase": "content_abundance"}, {"score": 0.003138874040786261, "phrase": "server_bandwidth"}, {"score": 0.003034916887102753, "phrase": "fourth_mode"}, {"score": 0.0029627701619228527, "phrase": "generalized_mode"}, {"score": 0.002730023736069673, "phrase": "data_transfer_protocols"}, {"score": 0.0023178219772486868, "phrase": "key_challenging_problems"}, {"score": 0.0022956075241520064, "phrase": "practical_designs"}, {"score": 0.002273605493468005, "phrase": "real-world_performances"}, {"score": 0.0021771713131746636, "phrase": "solid_experiences"}, {"score": 0.0021563019696857768, "phrase": "helpful_heuristics"}, {"score": 0.0021049977753042253, "phrase": "similar_systems"}], "paper_keywords": ["Internet", " content distribution", " server based", " peer-to-peer", " P2SP", " open-P2SP"], "paper_abstract": "Content distribution on today's Internet operates primarily in two modes: server-based and peer-to-peer (P2P). To leverage the advantages of both modes while circumventing their key limitations, a third mode: peer-to-server/peer (P2SP) has emerged in recent years. Although P2SP can provide efficient hybrid server-P2P content distribution, P2SP generally works in a closed manner by only utilizing its private owned servers to accelerate its private organized peer swarms. Consequently, P2SP still has its limitations in both content abundance and server bandwidth. To this end, the fourth mode (or says a generalized mode of P2SP) has appeared as \"open-P2SP\" that integrates various third-party servers, contents, and data transfer protocols all over the Internet into a large, open, and federated P2SP platform. In this paper, based on a large-scale commercial open-P2SP system named \"QQXuanfeng\" [1], we investigate the key challenging problems, practical designs and real-world performances of open-P2SP. Such \"white-box\" study of open-P2SP provides solid experiences and helpful heuristics to the designers of similar systems.", "paper_title": "Challenges, Designs, and Performances of Large-Scale Open-P2SP Content Distribution", "paper_id": "WOS:000325170700007"}