{"auto_keywords": [{"score": 0.04131980053856032, "phrase": "cognitive_wireless_sensor_networks"}, {"score": 0.014192306395463924, "phrase": "security_evaluation"}, {"score": 0.004670896353428476, "phrase": "spectrum_analysis"}, {"score": 0.004586531354697466, "phrase": "artificial_noise_technique"}, {"score": 0.00450368324850566, "phrase": "cwsn_security"}, {"score": 0.004061584718427419, "phrase": "artificial_noise_techniques"}, {"score": 0.003988180913997414, "phrase": "physical-layer_security"}, {"score": 0.003574695610710444, "phrase": "real_information"}, {"score": 0.0029066973917258655, "phrase": "active_period"}, {"score": 0.002669259222649505, "phrase": "eavesdropper_attacks"}, {"score": 0.002466139325703204, "phrase": "low-resource_networks"}, {"score": 0.00218334762335187, "phrase": "simulation_results"}, {"score": 0.0021438155673297377, "phrase": "impact_analysis"}, {"score": 0.0021049977753042253, "phrase": "frequency_spectrum"}], "paper_keywords": [""], "paper_abstract": "This paper presents the security evaluation, energy consumption optimization, and spectrum scarcity analysis of artificial noise techniques to increase physical-layer security in Cognitive Wireless Sensor Networks (CWSNs). These techniques introduce noise into the spectrum in order to hide real information. Nevertheless, they directly affect two important parameters in Cognitive Wireless Sensor Networks (CWSNs), energy consumption and spectrum utilization. Both are affected because the number of packets transmitted by the network and the active period of the nodes increase. Security evaluation demonstrates that these techniques are effective against eavesdropper attacks, but also optimization allows for the implementation of these approaches in low-resource networks such as Cognitive Wireless Sensor Networks. In this work, the scenario is formally modeled and the optimization according to the simulation results and the impact analysis over the frequency spectrum are presented.", "paper_title": "Evaluation, Energy Optimization, and Spectrum Analysis of an Artificial Noise Technique to Improve CWSN Security", "paper_id": "WOS:000321364900001"}