{"auto_keywords": [{"score": 0.04974351188371698, "phrase": "virtual_worlds"}, {"score": 0.02322730111336099, "phrase": "procedural_modeling"}, {"score": 0.004714448392640623, "phrase": "ever_increasing_costs"}, {"score": 0.004681413843223496, "phrase": "manual_content_creation"}, {"score": 0.0043481611772332495, "phrase": "traditional_procedural_content_generation_methods"}, {"score": 0.004153810449519519, "phrase": "generated_results"}, {"score": 0.004052768605308453, "phrase": "complete_and_consistent_virtual_world"}, {"score": 0.003982098149664708, "phrase": "novel_declarative_modeling_approach"}, {"score": 0.003483631502938922, "phrase": "semantics-based_modeling"}, {"score": 0.003459191419478298, "phrase": "manual_and_procedural_approaches"}, {"score": 0.0033044432971036652, "phrase": "interactive_procedural_sketching"}, {"score": 0.0032812562034088646, "phrase": "virtual_world_consistency_maintenance"}, {"score": 0.0030153435879168634, "phrase": "procedural_sketching"}, {"score": 0.002983652306921617, "phrase": "fast_and_more_intuitive_way"}, {"score": 0.002850116748762153, "phrase": "high-level_terrain_features"}, {"score": 0.0027417911324611917, "phrase": "integrated_procedural_methods"}, {"score": 0.0027225413530200505, "phrase": "consistency_maintenance"}, {"score": 0.002600661525224505, "phrase": "modeling_process"}, {"score": 0.00247548600804924, "phrase": "terrain_features"}, {"score": 0.0023897719795915, "phrase": "significant_step"}, {"score": 0.0022114807037424944, "phrase": "virtual_world_modeling"}, {"score": 0.0021652024032375833, "phrase": "increasingly_broad_group"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Virtual worlds", " Declarative modeling", " Semantic modeling", " Consistency maintenance", " Procedural methods", " Procedural sketching"], "paper_abstract": "With the ever increasing costs of manual content creation for virtual worlds, the potential of creating it automatically becomes too attractive to ignore. However, for most designers, traditional procedural content generation methods are complex and unintuitive to use, hard to control, and generated results are not easily integrated into a complete and consistent virtual world. We introduce a novel declarative modeling approach that enables designers to concentrate on stating what they want to create instead of on describing how they should model it. It aims at reducing the complexity of virtual world modeling by combining the strengths of semantics-based modeling with manual and procedural approaches. This article describes two of its main contributions to procedural modeling of virtual worlds: interactive procedural sketching and virtual world consistency maintenance. We discuss how these techniques, integrated in our modeling framework SketchaWorld, build up to enable designers to create a complete 3D virtual world in minutes. Procedural sketching provides a fast and more intuitive way to model virtual worlds, by letting designers interactively sketch their virtual world using high-level terrain features, which are then procedurally expanded using a variety of integrated procedural methods. Consistency maintenance guarantees that the semantics of all terrain features is preserved throughout the modeling process. In particular, it automatically solves conflicts possibly emerging from interactions between terrain features. We believe that these contributions together represent a significant step towards providing more user control and flexibility in procedural modeling of virtual worlds. It can therefore be expected that by further reducing its complexity, virtual world modeling will become accessible to an increasingly broad group of users. (C) 2010 Elsevier Ltd. All rights reserved.", "paper_title": "A declarative approach to procedural modeling of virtual worlds", "paper_id": "WOS:000289395900019"}