{"auto_keywords": [{"score": 0.049299759016574796, "phrase": "e-learning_platform"}, {"score": 0.00481495049065317, "phrase": "bdi_agents"}, {"score": 0.004685015817346209, "phrase": "ines"}, {"score": 0.004484332781147261, "phrase": "operative_prototype"}, {"score": 0.004063547375196532, "phrase": "semantic_management"}, {"score": 0.003868142906199082, "phrase": "conversational_agents"}, {"score": 0.003743102131902864, "phrase": "natural_language"}, {"score": 0.002989991779830814, "phrase": "main_contribution"}, {"score": 0.0028932554846476718, "phrase": "intelligent_tutoring_module"}, {"score": 0.002349073225500705, "phrase": "student_specific_tasks"}, {"score": 0.00221153232497724, "phrase": "existing_learning_paths"}, {"score": 0.002175436093794315, "phrase": "student's_profile"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["BDI", " Intelligent tutors", " E-learning platforms"], "paper_abstract": "INES (INtelligent Educational System) is an operative prototype of an e-learning platform. This platform includes several tools and technologies, such as: (i) semantic management of users and contents; (ii) conversational agents to communicate with students in natural language; (iii) BDI-based (Believes, Desires, Intentions) agents, which shape the tutoring module of the system; (iv) an inference engine; and (v) ontologies, to semantically model the users, their activities, and the learning contents. The main contribution of this paper is the intelligent tutoring module of the system. Briefly, the tasks of this module are to recognize each student (checking his/her system credentials) and to obtain information about his/her learning progress. So, it can be able to suggest to each student specific tasks to achieve his/her particular learning objectives, based on several parameters related to the existing learning paths and the student's profile. (C) 2012 Elsevier Ltd. All rights reserved.", "paper_title": "An intelligent tutoring module controlled by BDI agents for an e-learning platform", "paper_id": "WOS:000302032600088"}