{"auto_keywords": [{"score": 0.04925795561529135, "phrase": "citation_contexts"}, {"score": 0.015719716506582538, "phrase": "latent_topics"}, {"score": 0.014679215292021614, "phrase": "citation_context"}, {"score": 0.010412992160998722, "phrase": "target_reference"}, {"score": 0.003945879572348638, "phrase": "different_parts"}, {"score": 0.003894963476923956, "phrase": "scientific_publication"}, {"score": 0.0037623642073222547, "phrase": "conceptually_broader_terms"}, {"score": 0.0033471722682967046, "phrase": "scientific_publications"}, {"score": 0.0029776614744264724, "phrase": "topical_modeling_techniques"}, {"score": 0.0029519664912853938, "phrase": "full-text_papers"}, {"score": 0.0029264925857346497, "phrase": "eight_biomedicine_journals"}, {"score": 0.002754208576828914, "phrase": "broad-narrow_relationships"}, {"score": 0.0027068691342344545, "phrase": "information_entropy"}, {"score": 0.0025696647013416863, "phrase": "distinct_sets"}, {"score": 0.002525489173110693, "phrase": "moderate_overlaps"}, {"score": 0.0023664730217196252, "phrase": "broader_terms"}, {"score": 0.0021418339161425994, "phrase": "current_methodologies"}, {"score": 0.0021233361369222344, "phrase": "research_evaluation"}, {"score": 0.0021049977753042253, "phrase": "citation_evaluation"}], "paper_keywords": ["citation analysis"], "paper_abstract": "Although it is commonly expected that the citation context of a reference is likely to provide more detailed and direct information about the nature of a citation, few studies in the literature have specifically addressed the extent to which the information in different parts of a scientific publication differs. Do abstracts tend to use conceptually broader terms than sentences in a citation context in the body of a publication? In this article, we propose a method to analyze and compare latent topics in scientific publications, in particular, from abstracts of papers that cited a target reference and from sentences that cited the target reference. We conducted an experiment and applied topical modeling techniques to full-text papers in eight biomedicine journals. Topics derived from the two sources are compared in terms of their similarities and broad-narrow relationships defined based on information entropy. The results show that abstracts and citation contexts are characterized by distinct sets of topics with moderate overlaps. Furthermore, the results confirm that topics from abstracts of citing papers have broader terms than topics from citation contexts formed by citing sentences. The method and the findings could be used to enhance and extend the current methodologies for research evaluation and citation evaluation.", "paper_title": "The differences between latent topics in abstracts and citation contexts of citing papers", "paper_id": "WOS:000323388800015"}