{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "inter-operability_unit"}, {"score": 0.038735251547156714, "phrase": "automotive_industries"}, {"score": 0.0047464608267006395, "phrase": "automobile_network"}, {"score": 0.004073590964805314, "phrase": "high-end_luxury_cars"}, {"score": 0.0037377733149169573, "phrase": "gradually_important_issue"}, {"score": 0.00305762327908599, "phrase": "gps_navigation_system"}, {"score": 0.002791932344920906, "phrase": "multimedia_network"}, {"score": 0.002661474607275484, "phrase": "network_integration"}, {"score": 0.0024301229420875155, "phrase": "control_network"}, {"score": 0.002176747110119268, "phrase": "queueing_model"}, {"score": 0.0021049977753042253, "phrase": "real_can_traffic"}], "paper_keywords": [""], "paper_abstract": "Communication in an automobile is coming to be important and complex little by little, because of hundreds of circuits, sensors, and many other electrical components. For example, some high-end luxury cars contain more than three miles and nearly 200 pounds of wiring. Therefore, the difficulty in connecting these components is gradually important issue for the automotive industries. As a solution to this affair, networking provides a more efficient method for today's complex in-vehicle communications. And then, many automotive buses have emerged in last years. Especially, to connect multimedia devices(eg, audio, GPS navigation system, DVD player, PC), the MOST(media oriented systems transport) is proposed to automotive industries as multimedia network in an automobile. To follow the tendency of network integration, we try to connect CAN(controller area network) to MOST. Indeed, it is that we use MOST as control network instead of CAN. To do this, we explain the characteristic of MOST and CAN. Secondly, the inter-operability unit is analyzed by queueing model. Thirdly, we substitute the real CAN traffic for queueing model.", "paper_title": "Study on inter-operability unit for an automobile network", "paper_id": "WOS:000240083300135"}