{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "euler_diagrams"}, {"score": 0.0045877173513910055, "phrase": "intersecting_data_sets"}, {"score": 0.004146510711518748, "phrase": "data_sets"}, {"score": 0.0038647641000798135, "phrase": "user_comprehension"}, {"score": 0.0036179751816682454, "phrase": "different_diagrams"}, {"score": 0.00352371416065881, "phrase": "different_wellformedness_properties"}, {"score": 0.0030206579994328975, "phrase": "wellformedness_properties"}, {"score": 0.0029289895726382653, "phrase": "abstract_data"}, {"score": 0.0028526276660691525, "phrase": "concrete_data"}, {"score": 0.0028151944356239952, "phrase": "students'_enrollment"}, {"score": 0.002790511479398411, "phrase": "university_modules"}, {"score": 0.0026121403051734744, "phrase": "disconnected_zones"}, {"score": 0.0024130437638400404, "phrase": "brushing_points"}, {"score": 0.0023192471808039746, "phrase": "nonsimple_curves"}, {"score": 0.0021805201234139475, "phrase": "human_diagram_designers"}, {"score": 0.0021330078238529443, "phrase": "automated_drawing_systems"}, {"score": 0.0021049977753042253, "phrase": "best_way"}], "paper_keywords": ["Euler diagrams", " Venn diagrams", " empirical studies", " information visualization"], "paper_abstract": "Euler diagrams are often used to visualize intersecting data sets in applications such as criminology; genetics, medicine, and computer file systems. One interesting aspect of these diagrams is that some data sets cannot be drawn without breaking one or more \"wellformedness properties,\" which are considered to reduce the user comprehension of the diagrams. However, it is possible to draw the same data with different diagrams, each of which breaks different wellformedness properties. Hence, some properties are \"swappable,\" so motivating the study of which of the alternatives would be best to use. This paper reports on the two empirical studies to determine how wellformedness properties affect comprehension. One study was with abstract data, the other was with concrete data that visualized students' enrollment on university modules. We have results from both studies that imply that diagrams with concurrency or disconnected zones perform less well than other some other properties. Further, we have no results that imply that diagrams with brushing points adversely affect performance. Our data also indicate that nonsimple curves are preferred less than diagrams with other properties. These results will inform both human diagram designers and the developers of automated drawing systems on the best way to visualize data using Euler diagrams.", "paper_title": "Wellformedness Properties in Euler Diagrams: Which Should Be Used?", "paper_id": "WOS:000304139000008"}