{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "internet-based_applications"}, {"score": 0.027250201770358615, "phrase": "security_requirements"}, {"score": 0.026879709594970776, "phrase": "security_patterns"}, {"score": 0.004781357546476652, "phrase": "purpose_-_the_purpose"}, {"score": 0.004616859702338596, "phrase": "web_services"}, {"score": 0.004457995891964028, "phrase": "design_level"}, {"score": 0.004380616732302083, "phrase": "systematic_way"}, {"score": 0.004350040802144489, "phrase": "web_services_security_software_architecture"}, {"score": 0.004127394241838696, "phrase": "internet-based_application"}, {"score": 0.00379452936798156, "phrase": "secure_ws-based_applications"}, {"score": 0.003715579364728729, "phrase": "main_security_requirements"}, {"score": 0.0036002125374696237, "phrase": "appropriate_security_patterns"}, {"score": 0.003415812499773905, "phrase": "implicated_security_requirements"}, {"score": 0.0033447157263095223, "phrase": "possible_link"}, {"score": 0.00314015410819199, "phrase": "determined_security_requirement"}, {"score": 0.0031182092708983184, "phrase": "best_security_patterns"}, {"score": 0.003021334228842501, "phrase": "security_properties"}, {"score": 0.0028564621282167685, "phrase": "secure_development"}, {"score": 0.0028068030356445894, "phrase": "security_software_architecture"}, {"score": 0.002691105581191125, "phrase": "patterns_fulfils"}, {"score": 0.002562123444678208, "phrase": "security_solutions"}, {"score": 0.0025352969524471496, "phrase": "reliable_security_services"}, {"score": 0.0025175684590726796, "phrase": "practical_implications"}, {"score": 0.0025087506382067536, "phrase": "-_security_architecture"}, {"score": 0.0024137645015872952, "phrase": "security_requirement_types"}, {"score": 0.002195552442011313, "phrase": "possible_security_patterns"}, {"score": 0.0021049977753042253, "phrase": "secure_system"}], "paper_keywords": ["worldwide web", " security products", " computer applications"], "paper_abstract": "Purpose - The purpose of this paper is that of linking security requirements for web services with security patterns, both at the architectural and the design level, obtaining in a systematic way a web services security software architecture that contains a set of security patterns, thus ensuring that the security requirements of the internet-based application that have been elicited are fulfilled. Additionally, the security patterns are linked with the most appropriate standards for their implementation. Design/methodology/approach - To develop secure WS-based applications, one must know the main security requirements specified that applications have to fulfil and find appropriate security patterns that assure, through combination or relationships between them, the fulfilment of the implicated security requirements. That is why a possible link or connection between requirements and patterns will have to be found, attempting to select for a determined security requirement the best security patterns that solve this requirement, thus guaranteeing the security properties for internet-based applications. Findings - Using security patterns, that drive and guide one towards a secure development as well as towards security software architecture, one can be sure that this design based on these patterns fulfils and guarantees the most important security requirements of the internet-based applications through the design and implementation of security solutions that provide reliable security services. Practical implications - Security architecture for internet-based applications and web services can be designed considering the security requirement types that it must fulfil and using the most appropriate security patterns. Originality/value - This paper proposes a relationship between security requirements that can be specified for internet-based applications and the possible security patterns that can be used in the design and implementation of the secure system based on the internet, guaranteeing that these security requirements are fulfilled.", "paper_title": "Security patterns and requirements for internet-based applications", "paper_id": "WOS:000242421800006"}