{"auto_keywords": [{"score": 0.033185669272804696, "phrase": "transmission_order"}, {"score": 0.00481495049065317, "phrase": "cooperative_transmission_for_wireless_networks_using_mutual-information_accumulation"}, {"score": 0.004682288586254123, "phrase": "wireless_multihop_networks"}, {"score": 0.004626553103375699, "phrase": "communication_reliability"}, {"score": 0.004571478018964363, "phrase": "energy_consumption"}, {"score": 0.004445494322321316, "phrase": "possible_improvements"}, {"score": 0.004322967486451877, "phrase": "mutual_information_accumulation"}, {"score": 0.004187049198138107, "phrase": "resource_allocation"}, {"score": 0.004153739859461064, "phrase": "unicast_and_multicast_transmission"}, {"score": 0.0038348235692738783, "phrase": "end-to-end_transmission_delay"}, {"score": 0.003053598205821532, "phrase": "optimum_resource_allocation"}, {"score": 0.002981216610222911, "phrase": "linear_programming_problem"}, {"score": 0.002741091312632307, "phrase": "linear_program"}, {"score": 0.0026760974046034854, "phrase": "linear_programs"}, {"score": 0.0026336242881032645, "phrase": "locally_optimal_solution"}, {"score": 0.0025405019456703325, "phrase": "proposed_cooperative_routing_solution"}, {"score": 0.0024802523752944536, "phrase": "conventional_shortest_path_multihop_routing"}, {"score": 0.0024214281919523973, "phrase": "energy_expenditures"}, {"score": 0.0021049977753042253, "phrase": "centralized_algorithm"}], "paper_keywords": ["Cooperative communications", " mutual-information accumulation", " networks", " rateless codes", " relaying", " routing", " wireless communications"], "paper_abstract": "Cooperation between the nodes of wireless multihop networks can increase communication reliability, reduce energy consumption, and decrease latency. The possible improvements are even greater when nodes perform mutual information accumulation. In this paper, we investigate resource allocation for unicast and multicast transmission in such networks. Given a network, a source, and a destination, our objective is to minimize end-to-end transmission delay under energy and bandwidth constraints. We provide an algorithm that determines which nodes should participate in forwarding the message and what resources (time, energy, bandwidth) should be allocated to each. Our approach factors into two sub-problems, each of which can be solved efficiently. For any transmission order we show that solving for the optimum resource allocation can be formulated as a linear programming problem. We then show that the transmission order can be improved systematically by swapping nodes based on the solution of the linear program. Solving a sequence of linear programs leads to a locally optimal solution in a very efficient manner. In comparison to the proposed cooperative routing solution, it is observed that conventional shortest path multihop routing typically incurs additional delays and energy expenditures on the order of 70%. Drawing inspiration from this first, centralized, algorithm, we also present two distributed algorithms. These algorithms require only local channel state information. Simulations indicate that they yield solutions about two to five percent less efficient than the centralized algorithm.", "paper_title": "Cooperative Transmission for Wireless Networks Using Mutual-Information Accumulation", "paper_id": "WOS:000295738500019"}