{"auto_keywords": [{"score": 0.03601823488783273, "phrase": "duppredictor"}, {"score": 0.03403496020666931, "phrase": "stack_overflow"}, {"score": 0.014175236722113339, "phrase": "duplicate_questions"}, {"score": 0.005371629860286451, "phrase": "automated_approach"}, {"score": 0.004898005727998699, "phrase": "multiple_factors"}, {"score": 0.00481495049065317, "phrase": "multi-factor_duplicate_question_detection"}, {"score": 0.004733743998574891, "phrase": "popular_on-line_question"}, {"score": 0.004676575291629554, "phrase": "software_developers"}, {"score": 0.004575397892643882, "phrase": "numerous_questions"}, {"score": 0.0043165269402540216, "phrase": "latent_topics"}, {"score": 0.0043161190928529755, "phrase": "stack_overflow_site"}, {"score": 0.0037030390595465673, "phrase": "difficult_work"}, {"score": 0.0035100601949451028, "phrase": "above-mentioned_need"}, {"score": 0.003384262486955773, "phrase": "new_question"}, {"score": 0.0033433365160336842, "phrase": "potential_duplicates"}, {"score": 0.003018468582368033, "phrase": "mandatory_information"}, {"score": 0.0028541057064952876, "phrase": "topic_model"}, {"score": 0.002627342479407787, "phrase": "new_similarity_score"}, {"score": 0.0025024415486497933, "phrase": "stack_overflow_dataset"}, {"score": 0.0023546121947302877, "phrase": "standard_search_engine"}, {"score": 0.0021886732310288128, "phrase": "runeson_et_al"}, {"score": 0.0021307975800397816, "phrase": "bug_reports"}], "paper_keywords": ["software information site", " duplicate question", " Stack Overflow", " DupPredictor"], "paper_abstract": "Stack Overflow is a popular on-line question and answer site for software developers to share their experience and expertise. Among the numerous questions posted in Stack Overflow, two or more of them may express the same point and thus are duplicates of one another. Duplicate questions make Stack Overflow site maintenance harder, waste resources that could have been used to answer other questions, and cause developers to unnecessarily wait for answers that are already available. To reduce the problem of duplicate questions, Stack Overflow allows questions to be manually marked as duplicates of others. Since there are thousands of questions submitted to Stack Overflow every day, manually identifying duplicate questions is a difficult work. Thus, there is a need for an automated approach that can help in detecting these duplicate questions. To address the above-mentioned need, in this paper, we propose an automated approach named DUPPREDICTOR that takes a new question as input and detects potential duplicates of this question by considering multiple factors. DUPPREDICTOR extracts the title and description of a question and also tags that are attached to the question. These pieces of information (title, description, and a few tags) are mandatory information that a user needs to input when posting a question. DUPPREDICTOR then computes the latent topics of each question by using a topic model. Next, for each pair of questions, it computes four similarity scores by comparing their titles, descriptions, latent topics, and tags. These four similarity scores are finally combined together to result in a new similarity score that comprehensively considers the multiple factors. To examine the benefit of DUPPREDICTOR, we perform an experiment on a Stack Overflow dataset which contains a total of more than two million questions. The result shows that DUPPREDICTOR can achieve a recall-rate@20 score of 63.8%. We compare our approach with the standard search engine of Stack Overflow, and DUPPREDICTOR improves its recall-rate@10 score by 40.63%. We also compare our approach with approaches that only use title, description, topic, and tag similarity and Runeson et al.'s approach that has been used to detect duplicate bug reports, and DUPPREDICTOR improves their recall-rate 10 scores by 27.2%, 97.4%, 746.0%, 231.1%, and 16.4% respectively.", "paper_title": "Multi-Factor Duplicate Question Detection in Stack Overflow", "paper_id": "WOS:000361416400006"}