{"auto_keywords": [{"score": 0.029469450411198327, "phrase": "virtual_tem_laboratory"}, {"score": 0.014058331964215059, "phrase": "tem"}, {"score": 0.00481495049065317, "phrase": "educational_virtual_transmission_electron_microscope_laboratory"}, {"score": 0.0043452175611323335, "phrase": "transmission_electron_microscope"}, {"score": 0.004127753467337283, "phrase": "significantly_higher_resolution"}, {"score": 0.004085579055228594, "phrase": "light_microscopes"}, {"score": 0.003782655283668953, "phrase": "single_column"}, {"score": 0.0035021127041237887, "phrase": "scattering_pattern"}, {"score": 0.002585906251354904, "phrase": "different_materials"}, {"score": 0.0024062532032402533, "phrase": "teaching_experiment"}, {"score": 0.0023331227492950422, "phrase": "learning_effectiveness"}, {"score": 0.002262209824105154, "phrase": "educational_applications"}, {"score": 0.0021487685525986094, "phrase": "students'_learning_motivation"}, {"score": 0.0021049977753042253, "phrase": "nanostructure_analysis"}], "paper_keywords": ["Nanostructure", " Transmission electron microscope", " Virtual reality", " Diffraction pattern", " 3D crystal structure"], "paper_abstract": "In recent years, many high-tech instruments have been developed to investigate the nanostructures of materials. For example, the transmission electron microscope (TEM) is capable of imaging at a significantly higher resolution than light microscopes, enabling scientists to examine the very fine detail of materials even as small as a single column of atoms. It can also be used as a diffractometer to obtain the scattering pattern of a material for analysis of its 3D crystal structure. However, the TEM is a very expensive apparatus such that many students do not have a chance to operate it personally, thus causing the difficulty of understanding its principle and operating procedure. In this study, a virtual TEM laboratory has been developed to help students learn how to analyze the 3D crystal structures of different materials such as diamond, graphite, and anatase according to their diffraction patterns. A teaching experiment was conducted to study the learning effectiveness of using the virtual TEM laboratory for educational applications. The results showed that the virtual TEM laboratory could improve students' learning motivation and achievement in nanostructure analysis.", "paper_title": "Development of an educational virtual transmission electron microscope laboratory", "paper_id": "WOS:000349645700003"}