{"auto_keywords": [{"score": 0.03096531205788757, "phrase": "biological_macromolecules"}, {"score": 0.027680225659223377, "phrase": "f-i"}, {"score": 0.025895967595426794, "phrase": "ionizable_compounds"}, {"score": 0.00481495049065317, "phrase": "tetrahymena_pyriformis_toxicity"}, {"score": 0.004594582559945568, "phrase": "class-based_compounds"}, {"score": 0.004201381218977942, "phrase": "tetrahymena"}, {"score": 0.004112812699639956, "phrase": "different_groups"}, {"score": 0.003991932110277654, "phrase": "functional_groups"}, {"score": 0.0038253590626087237, "phrase": "non-polar_hydrophobic_compounds"}, {"score": 0.0037287578312533596, "phrase": "step_analysis"}, {"score": 0.003423969509052361, "phrase": "significant_relationships"}, {"score": 0.0030776686414001964, "phrase": "small_number"}, {"score": 0.002886885861509621, "phrase": "target_sites"}, {"score": 0.0028623555849897632, "phrase": "hydrophobic_parameter_log_p"}, {"score": 0.002838033152426417, "phrase": "bio-uptake_process_compounds"}, {"score": 0.0027311076665349657, "phrase": "hydrophilic_residues"}, {"score": 0.0027078974645805736, "phrase": "polar_chemicals"}, {"score": 0.0023123057299992587, "phrase": "bio-uptake_process"}, {"score": 0.0022634699331607615, "phrase": "successful_single_model"}], "paper_keywords": ["toxic mechanism", " narcosis", " hydrophobicity", " ionization", " polarity"], "paper_abstract": "A toxicity data set containing the toxicities of 970 hydrophobic, polar and ionizable, nitro substituted and alpha,beta-unsaturated compounds to Tetrahymena pyriformis was classified into different groups based on the structure and substituted functional groups. Polar, ionizable and reactive compounds exhibit greater toxicity as compared with the non-polar hydrophobic compounds. Step-by-step analysis was carried out between the toxicity and descriptors representing hydrophobicity, polarity/polarizability, ionization and reactivity of compounds. Significant relationships were developed between the toxicity and these descriptors for the compounds. The models developed are simple, interpretable and transparent, using a small number of descriptors that may reflect the interactions of chemicals with the biological macromolecules at the target sites. Hydrophobic parameter log P reflects bio-uptake process compounds. Polarity/polarizability descriptor S reflects the interaction of hydrophilic residues of polar chemicals with biological macromolecules. The fractions of ionized (F-i) and neutral ( F-0) forms calculated from pK(a) reflect the interactions of ionizable compounds with the macromolecules and effect of ionization of ionizable compounds on the bio-uptake process, respectively. A successful single model was developed by using the descriptors log P, S, F-i and log F-0 for non-polar, polar and ionizable compounds.", "paper_title": "Comparison of Tetrahymena pyriformis toxicity based on hydrophobicity, polarity, ionization and reactivity of class-based compounds", "paper_id": "WOS:000306712600009"}