{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "batch_synchronization"}, {"score": 0.049348918639928865, "phrase": "multiple_asynchronisms"}, {"score": 0.01305029006828205, "phrase": "novel_approach"}, {"score": 0.006859574824493269, "phrase": "different_types"}, {"score": 0.0066268534864764314, "phrase": "warping_information"}, {"score": 0.006426583791357636, "phrase": "batch_trajectories"}, {"score": 0.006328715600618369, "phrase": "appropriate_synchronization_procedures"}, {"score": 0.005771845161309538, "phrase": "abnormality_detection"}, {"score": 0.0056621111321599644, "phrase": "iterative_manner"}, {"score": 0.004527804152066942, "phrase": "variable_trajectories"}, {"score": 0.004493130934067195, "phrase": "uneven_length"}, {"score": 0.004458722048888919, "phrase": "batch_data"}, {"score": 0.004323690117778359, "phrase": "key_process_events"}, {"score": 0.004192730391924712, "phrase": "process_evolution"}, {"score": 0.0040971095888461045, "phrase": "batch_duration"}, {"score": 0.0038973170902076707, "phrase": "single_synchronization_procedure"}, {"score": 0.0034725269588525534, "phrase": "original_trajectories"}, {"score": 0.0034194902384248006, "phrase": "signal-to-noise_ratio"}, {"score": 0.0033672608231654897, "phrase": "subsequent_multivariate_analyses"}, {"score": 0.002522791642460087, "phrase": "realistic_simulations"}, {"score": 0.002493810638588771, "phrase": "fermentation_process"}, {"score": 0.002465161736207254, "phrase": "saccharomyces_cerevisiae_cultivation"}, {"score": 0.002381169982803105, "phrase": "proposed_approach"}, {"score": 0.002273605493468005, "phrase": "john_wiley"}, {"score": 0.002154226045704907, "phrase": "synchronization_pitfalls"}, {"score": 0.0021049977753042253, "phrase": "batch_processes"}], "paper_keywords": ["batch synchronization", " warping information", " asynchronism", " dynamic time warping", " relaxed greedy time warping"], "paper_abstract": "Batch synchronization has been widely misunderstood as being only needed when variable trajectories have uneven length. Batch data are actually considered not synchronized when the key process events do not occur at the same point of process evolution, irrespective of whether the batch duration is the same for all batches or not. Additionally, a single synchronization procedure is usually applied to all batches without taking into account the nature of asynchronism of each batch, and the presence of abnormalities. This strategy may distort the original trajectories and decrease the signal-to-noise ratio, affecting the subsequent multivariate analyses. The approach proposed in this paper, named multisynchro, overcomes these pitfalls in scenarios of multiple asynchronisms. The different types of asynchronisms are effectively detected by using the warping information derived from synchronization. Each set of batch trajectories is synchronized by appropriate synchronization procedures, which are automatically selected based on the nature of asynchronisms present in data. The novel approach also includes a procedure that performs abnormality detection and batch synchronization in an iterative manner. Data from realistic simulations of a fermentation process of the Saccharomyces cerevisiae cultivation are used to illustrate the performance of the proposed approach in a context of multiple asynchronisms.Copyright (c) 2014 John Wiley & Sons, Ltd. A novel approach named multisynchro is proposed to overcome the synchronization pitfalls in scenarios of multiple asynchronisms in batch processes. The different types of asynchronisms are effectively detected by using the warping information derived from synchronization. Each set of batch trajectories is synchronized by appropriate synchronization procedures, which are automatically selected based on the nature of asynchronisms present in data. The novel approach also includes a procedure that performs abnormality detection and batch synchronization in an iterative manner.", "paper_title": "Multisynchro: a novel approach for batch synchronization in scenarios of multiple asynchronisms", "paper_id": "WOS:000335520900014"}