{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "selective_inhibitors"}, {"score": 0.0046621835537196754, "phrase": "random_forest_classification"}, {"score": 0.004550783060775205, "phrase": "matrix_metalloproteinases"}, {"score": 0.0043533862892678864, "phrase": "serious_pathological_disorders"}, {"score": 0.004232232993872917, "phrase": "vigorous_and_selective_mmp_inhibitors"}, {"score": 0.0040485975929323, "phrase": "novel_therapeutic_agents"}, {"score": 0.003719773848735395, "phrase": "prediction_models"}, {"score": 0.0036898803847106023, "phrase": "diversely_structural_selective_inhibitors"}, {"score": 0.003459191419478298, "phrase": "developed_models"}, {"score": 0.003403801095792972, "phrase": "testing_sets"}, {"score": 0.0033764382987428497, "phrase": "external_independent_validation_sets"}, {"score": 0.003335804608791029, "phrase": "satisfactory_performance"}, {"score": 0.0032956583072431423, "phrase": "physicochemical_properties"}, {"score": 0.003114584448820957, "phrase": "feature_selection_methods"}, {"score": 0.0029792984108210525, "phrase": "molecular_features"}, {"score": 0.002907992115184249, "phrase": "molecular_descriptors"}, {"score": 0.0027370835853738626, "phrase": "excellent_analytical_perspective"}, {"score": 0.002504374718975704, "phrase": "scdatabase"}, {"score": 0.0023666732429695908, "phrase": "svm_method"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Matrix metalloproteinase", " Selective inhibitor", " Molecular descriptor", " Random forest", " Modeling", " Virtual screening"], "paper_abstract": "Over-expression of matrix metalloproteinases (MMPs) has been linked to a variety of serious pathological disorders. Methods of predicting and screening vigorous and selective MMP inhibitors are urgently needed for facilitating the design and development of novel therapeutic agents. Two machine learning methods, support vector machine (SVM) and random forest (RE), were explored to develop prediction models for diversely structural selective inhibitors of MMP-3 over MMP-1 and MMP-9 versus MMP-1 in this work, individually. The developed models were validated by testing sets and external independent validation sets, showing satisfactory performance. The physicochemical properties most extensively concerned with MMP-3 and MMP-9 selective inhibition were extracted from a set of 189 descriptors by feature selection methods, which are capable of competently describing most of the molecular features of these inhibitors. The molecular descriptors most relevant to MMP-1 inhibitors were also derived from these 189 features. All those properties provide an excellent analytical perspective to explain the similarities and differences to MMP-1, MMP-3 and MMP-9 inhibitors in structure or function. Finally, the virtual screening of MMP-1, MMP-3 and MMP-9 inhibitors against the SCdatabase were separately performed based on the RE model which is slightly better than the SVM method, resulting in 110 potential hit candidates for MMP-3 over both MMP-1 and MMP-9, 23 hits for MMP-9 versus both MMP-1 and MMP-3, and 80 hits for MMP-3 and MMP-9. (C) 2015 Elsevier B.V. All rights reserved.", "paper_title": "Modeling, predicting and virtual screening of selective inhibitors of MMP-3 and MMP-9 over MMP-1 using random forest classification", "paper_id": "WOS:000362382600003"}