{"auto_keywords": [{"score": 0.025419220123248605, "phrase": "discontinuance_intentions"}, {"score": 0.00481495049065317, "phrase": "habituated_hedonic_information_system"}, {"score": 0.004636594774238505, "phrase": "facebook_users"}, {"score": 0.004483585361583022, "phrase": "early_adoption"}, {"score": 0.004335603324413586, "phrase": "information_systems"}, {"score": 0.00396988421137599, "phrase": "habituated_hedonic_settings"}, {"score": 0.003398714712611042, "phrase": "current_users"}, {"score": 0.00325893016361821, "phrase": "discontinuance_drivers"}, {"score": 0.0032181231788427655, "phrase": "differential_effects"}, {"score": 0.0031778255332904487, "phrase": "respective_behavioral_intentions"}, {"score": 0.0031248767378106663, "phrase": "social_cognitive_theory"}, {"score": 0.0030470980812086247, "phrase": "key_unique_drivers"}, {"score": 0.0030216031606457214, "phrase": "website_discontinuance_intentions"}, {"score": 0.002885135695263876, "phrase": "website-specific_discontinuance_self-efficacy"}, {"score": 0.0028015105858516702, "phrase": "continuance_drivers"}, {"score": 0.002575665611013556, "phrase": "proposed_research_model"}, {"score": 0.002338306897057454, "phrase": "habit_formation"}, {"score": 0.002131720106846481, "phrase": "guilt_feelings"}, {"score": 0.0021049977753042253, "phrase": "one's_self-efficacy"}], "paper_keywords": ["IS discontinuance", " quitting", " guilt", " technology addiction", " social-cognitive theory", " social networking sites"], "paper_abstract": "Much research has been devoted to the early adoption and the continued and habituated use of information systems (IS). Nevertheless, less is known about quitting the use of IS by individuals, especially in habituated hedonic settings, that is, IS discontinuance. This study focuses on this phenomenon, and argues that in hedonic IS use contexts (1) IS continuance and discontinuance can be considered simultaneously yet independently by current users, and that (2) IS continuance and discontinuance drivers can have differential effects on the respective behavioral intentions. Specifically, social cognitive theory is used to point to key unique drivers of website discontinuance intentions: guilt feelings regarding the use of the website and website-specific discontinuance self-efficacy, which counterbalance the effects of continuance drivers: habit and satisfaction. The distinctiveness of continuance and discontinuance intentions and their respective nomological networks, as well as the proposed research model, were then empirically validated in a study of 510 Facebook users. The findings indicate that satisfaction reduces discontinuance intentions directly and indirectly through habit formation. However, habit can also facilitate the development of 'addiction' to the use of the website, which produces guilt feelings and reduces one's self-efficacy to quit using the website. These factors, in turn, drive discontinuance intentions and possibly the quitting of the use of the website.", "paper_title": "Quitting the use of a habituated hedonic information system: a theoretical model and empirical examination of Facebook users", "paper_id": "WOS:000358273400006"}