{"auto_keywords": [{"score": 0.024276322925288474, "phrase": "temporal_support"}, {"score": 0.00481495049065317, "phrase": "temporal_attribute_characteristics"}, {"score": 0.004620093797504386, "phrase": "associated_time_references"}, {"score": 0.004551199992546761, "phrase": "temporal_aspect"}, {"score": 0.0039308449157320815, "phrase": "current_database_management_systems"}, {"score": 0.003901407184706592, "phrase": "preciously_little_built-in_query_language_support"}, {"score": 0.003743381699791, "phrase": "active_temporal_database_research_community"}, {"score": 0.003687512797620773, "phrase": "application_development"}, {"score": 0.0036052633308076933, "phrase": "built-in_temporal_support"}, {"score": 0.0035648266669315943, "phrase": "paper's_contribution"}, {"score": 0.0034722233102219466, "phrase": "existing_temporal_data_models"}, {"score": 0.003148774338287351, "phrase": "time_domain"}, {"score": 0.0027811441123794427, "phrase": "so-called_malleable_and_atomic_temporal_associations"}, {"score": 0.002502995662011305, "phrase": "characteristics-enabled_temporal_algebra"}, {"score": 0.002474891702137105, "phrase": "ceta"}, {"score": 0.0024287485834314027, "phrase": "traditional_relational_operators"}, {"score": 0.0024014759148123736, "phrase": "new_framework"}, {"score": 0.0021049977753042253, "phrase": "practical_applications"}], "paper_keywords": ["temporal databases", " temporal algebra", " attribute characteristics", " malleable attributes", " temporal data semantics"], "paper_abstract": "Most real-world database applications manage temporal data, i.e., data with associated time references that capture a temporal aspect of the data, typically either when the data is valid or when the data is known. Such applications abound in, e.g., the financial, medical, and scientific domains. In contrast to this, current database management systems offer preciously little built-in query language support for temporal data management. This situation persists although an active temporal database research community has demonstrated that application development can be simplified substantially by built-in temporal support. This paper's contribution is motivated by the observation that existing temporal data models and query languages generally make the same rigid assumption about the semantics of the association of data and time, namely that if a subset of the time domain is associated with some data then this implies the association of any further subset with the data. This paper offers a comprehensive, general framework where alternative semantics may co-exist. It supports so-called malleable and atomic temporal associations, in addition to the conventional ones mentioned above, which are termed constant. To demonstrate the utility of the framework, the paper defines a characteristics-enabled temporal algebra, termed CETA, which defines the traditional relational operators in the new framework. This contribution demonstrates that it is possible to provide built-in temporal support while making less rigid assumptions about the data and without jeopardizing the degree of the support. This moves temporal support closer to practical applications.", "paper_title": "An algebraic framework for temporal attribute characteristics", "paper_id": "WOS:000237823300006"}