{"auto_keywords": [{"score": 0.04859537978619132, "phrase": "bzcs"}, {"score": 0.00696810043489858, "phrase": "binding_site"}, {"score": 0.00481495049065317, "phrase": "benzimidazole_resistance"}, {"score": 0.004758457292840376, "phrase": "novel_beta-tubulin_binding_site_model"}, {"score": 0.004468117364177126, "phrase": "helminthic_infections"}, {"score": 0.00438105507792004, "phrase": "microtubule_polymerization_mechanism"}, {"score": 0.004278807087784626, "phrase": "beta-tubulin_subunit"}, {"score": 0.004129873531628877, "phrase": "drug_resistance"}, {"score": 0.0040176151419992956, "phrase": "crystallographic_structures"}, {"score": 0.003338690782620756, "phrase": "homology_models"}, {"score": 0.003073545175760353, "phrase": "mammal_ovis_aries"}, {"score": 0.0030135741897058844, "phrase": "low_susceptible_organism"}, {"score": 0.0028630535573013686, "phrase": "principal_single_point_mutations"}, {"score": 0.0026986685585382347, "phrase": "molecular_docking_and_molecular_dynamics_studies"}, {"score": 0.002573965014439041, "phrase": "ligand-protein_complexes'_behaviors"}, {"score": 0.0025137856138000014, "phrase": "first_attempt"}, {"score": 0.002455009746748708, "phrase": "molecular_level"}, {"score": 0.002332322771009122, "phrase": "possible_resistance_mechanisms"}, {"score": 0.002242127152093798, "phrase": "benzimidazole_derivative_optimization"}], "paper_keywords": ["beta-Tubulin", " Benzimidazole-2-carbamate derivatives", " Resistance/susceptibility", " Homology modeling", " Docking", " Molecular dynamics"], "paper_abstract": "Benzimidazole-2-carbamate derivatives (BzCs) are the most commonly used antiparasitic drugs for the treatment of protozoan and helminthic infections. BzCs inhibit the microtubule polymerization mechanism through binding selectively to the beta-tubulin subunit in which mutations have been identified that lead to drug resistance. Currently, the lack of crystallographic structures of beta-tubulin in parasites has limited the study of the binding site and the analysis of the resistance to BzCs. Recently, our research group has proposed a model to explain the interaction between the BzCs and a binding site in the beta-tubulin. Herein, we report the homology models of two susceptible (Haemonchus contortus and Giardia intestinalis) parasites and one unsusceptible (Entamoeba histolytica) generated using the structure of the mammal Ovis aries, considered as a low susceptible organism, as a template. Additionally, the mechanism by which the principal single point mutations Phe167Tyr, Glu198Ala and Phe200Tyr could lead to resistance to BzCs is analyzed. Molecular docking and molecular dynamics studies were carried out in order to evaluate the models and the ligand-protein complexes' behaviors. This study represents a first attempt towards understanding, at the molecular level, the structural composition of beta-tubulin in all organisms, also suggesting possible resistance mechanisms. Furthermore, these results support the importance of benzimidazole derivative optimization in order to design more potent and selective (less toxic) molecules for the treatment of parasitic diseases. (C) 2013 Elsevier Inc. All, rights reserved.", "paper_title": "Molecular basis for benzimidazole resistance from a novel beta-tubulin binding site model", "paper_id": "WOS:000326849200003"}