{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "visual_attention_allocation"}, {"score": 0.004731638279336065, "phrase": "automated_multiple-task_environment"}, {"score": 0.004542780650208743, "phrase": "computer_environments"}, {"score": 0.004386887374401584, "phrase": "multiple_tasks"}, {"score": 0.004138813595009761, "phrase": "diagnostic_automation"}, {"score": 0.003662410853488772, "phrase": "unique_challenges"}, {"score": 0.003619993477999133, "phrase": "multiple_task_environments"}, {"score": 0.003093054709625219, "phrase": "common_interaction"}, {"score": 0.0030572112793962004, "phrase": "novel_systems"}, {"score": 0.0029009722548088306, "phrase": "multiple-task_environmentwas"}, {"score": 0.0027049694095434905, "phrase": "automation-supported_systems"}, {"score": 0.002351705899181029, "phrase": "higher_reliability_automation"}, {"score": 0.0022841153001549193, "phrase": "strategies_participants"}, {"score": 0.0021049977753042253, "phrase": "automated_systems_training"}], "paper_keywords": [""], "paper_abstract": "Operators and users interacting with computer environments often have to deal with multiple tasks at once, responding to each in series. Diagnostic automation, that is, automation that alerts users when and where to look, has been suggested to support the unique challenges of multiple task environments: activating tasks, switching between tasks, and tasks interfering with each other. Automation is not always reliable, however. Because of the common interaction with novel systems and the importance of training, the Simultaneous Task Environment Platform programa multiple-task environmentwas developed to understand the effects of experience on interaction with these automation-supported systems, as well as what strategies were developed. It was found that participants became more efficient with experience only when they interacted with higher reliability automation. Furthermore, the strategies participants developed focused on the differences between tasks and patterns across those tasks. Automated systems training should be sure to employ these findings.", "paper_title": "The Effects of Experience and Strategy on Visual Attention Allocation in an Automated Multiple-Task Environment", "paper_id": "WOS:000337180300003"}