{"auto_keywords": [{"score": 0.04547624598453916, "phrase": "multi-objective_carp"}, {"score": 0.03983429993807569, "phrase": "convergence_speed"}, {"score": 0.034753367936985, "phrase": "proposed_algorithm"}, {"score": 0.00481495049065317, "phrase": "multi-objective_capacitated_arc_routing_problem"}, {"score": 0.004782718554230406, "phrase": "capacitated_arc_routing"}, {"score": 0.004502126088469323, "phrase": "wide_application"}, {"score": 0.004456980650437417, "phrase": "real_world"}, {"score": 0.004382737590042589, "phrase": "decomposition-based_memetic_algorithm"}, {"score": 0.00418134346679498, "phrase": "competitive_approach"}, {"score": 0.004111672925576111, "phrase": "replacement_mechanism"}, {"score": 0.00407042677958844, "phrase": "assignment_mechanism"}, {"score": 0.00344062888674746, "phrase": "improved_d-maens"}, {"score": 0.0030176323936876317, "phrase": "steady-state_evolutionary_algorithm"}, {"score": 0.002821247621250663, "phrase": "current_best_solution"}, {"score": 0.0027370835853738626, "phrase": "elite_solutions"}, {"score": 0.002709589081384597, "phrase": "helpful_information"}, {"score": 0.0026199146891405975, "phrase": "multi-objective_carp_algorithm"}, {"score": 0.0025761937402886954, "phrase": "large-scale_benchmark_instances"}, {"score": 0.002400373755068185, "phrase": "id-maens"}, {"score": 0.00232090909020124, "phrase": "last_section"}, {"score": 0.002214048743052355, "phrase": "state-of-art_single-objective_carp_algorithms"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Capacitated Arc Routing Problem", " Coevolutionary", " Multi objective optimization", " D-MAENS"], "paper_abstract": "Capacitated Arc Routing Problem (CARP) has attracted the attention of many researchers during the last few years, because it has a wide application in the real world. Recently, a Decomposition-Based Memetic Algorithm for Multi-Objective CARP (D-MAENS) has been demonstrated to be a competitive approach. However, the replacement mechanism and the assignment mechanism of the offspring in D-MAENS remain to be improved. First, the replacement after all the offspring are generated decreases the convergence speed of D-MAENS. Second, the representatives of these sub-problems are reassigned at each generation by only considering one objective function. In response to these issues, this paper presents an improved D-MAENS for Multi-Objective CARP (ID-MAENS). The two improvements of the proposed algorithm are as follows: (1) the replacement of the solutions is immediately done once an offspring is generated, which references to the steady-state evolutionary algorithm. The new offspring will accelerate the convergence speed; (2) elitism is implemented by using an archive to maintain the current best solution in its decomposition direction during the search, and these elite solutions can provide helpful information for solving their neighbor sub-problems by cooperation. Compared with the Multi-Objective CARP algorithm, experimental results on large-scale benchmark instances egl show that the proposed algorithm has performed significantly better than D-MAENS on 23 out of the total 24 instances. Moreover, ID-MAENS find all the best nondominated solutions on 13 egl instances. In the last section of this paper, the ID-MAENS also proves to be competitive to some state-of-art single-objective CARP algorithms in terms of quality of solutions and computational efficiency. (C) 2014 Elsevier B.V. All rights reserved.", "paper_title": "An Improved Decomposition-Based Memetic Algorithm for Multi-Objective Capacitated Arc Routing Problem", "paper_id": "WOS:000334768800031"}