{"auto_keywords": [{"score": 0.015381758567487922, "phrase": "imo"}, {"score": 0.004487989502479992, "phrase": "information_service_framework"}, {"score": 0.003968191956122019, "phrase": "cmds"}, {"score": 0.0037311260623089436, "phrase": "e-navigation_services"}, {"score": 0.00346223706087128, "phrase": "appropriate_information"}, {"score": 0.003284145698220425, "phrase": "electronic_navigation_chart"}, {"score": 0.003198554193075258, "phrase": "bathymetric_data"}, {"score": 0.003170520716404193, "phrase": "tidal_data"}, {"score": 0.003142732162296465, "phrase": "meteorology_data"}, {"score": 0.0031151864044353245, "phrase": "radar-image_data"}, {"score": 0.00307431840409833, "phrase": "automatic_identification_system"}, {"score": 0.0029548937818509656, "phrase": "data_management_systems"}, {"score": 0.002890557197908352, "phrase": "e-navigation_services'_harmonization"}, {"score": 0.002555247330102505, "phrase": "system_enc"}, {"score": 0.0024130437638400404, "phrase": "data_management_system"}], "paper_keywords": ["E-navigation", " S-100", " Data management system", " S-100-based data", " Geographic information"], "paper_abstract": "Currently the International Maritime Organization (IMO) is taking the lead in developing e-navigation as an information service framework. E-navigation supports sharing, harmonization and utilization of various marine and marine-related data both shipboard and onshore. Recently, the IMO adopted the International Hydrographic Organization (IHO)'s S-100 as the basis of the Common Maritime Data Structure (CMDS) of e-navigation. Thus, the various data are to be provided to e-navigation services in formats consistent with the S-100 data model. E-navigation services, in order to provide appropriate information to users, utilize and harmonize many kinds of S-100-based data such as Electronic Navigation Chart (ENC) data, bathymetric data, tidal data, meteorology data, radar-image data, and Automatic Identification System (AIS) data. In e-navigation, data management systems dealing with S-100-based data facilitate e-navigation services' harmonization and utilization of the various S-100-based data. In this paper, we present an S-100 data management system that deals with various S-100-based data. We designed the system by generalization of the System ENC (SENC) kernel that manages S-101 ENC data. For development of a data management system that supports the management of various kinds of S-100-based data, we analyzed the characteristics of the S-100 data model and S-100-based data products. The S-100 data management system is designed to store S-100-based feature-oriented geographic data in the form of < key, value > pairs.", "paper_title": "E-Navigation-supporting data management system for variant S-100-based data", "paper_id": "WOS:000359864700032"}