{"auto_keywords": [{"score": 0.04925856411254274, "phrase": "generalized_tractability"}, {"score": 0.009459042289401429, "phrase": "linear_tensor_product_problems"}, {"score": 0.006843258860014101, "phrase": "unrestricted_domain"}, {"score": 0.00672641341028698, "phrase": "linear_information"}, {"score": 0.005210679771795437, "phrase": "weak_tractability"}, {"score": 0.00481495049065317, "phrase": "multivariate_problems_part_ii"}, {"score": 0.00477350785284438, "phrase": "unrestricted_tractability"}, {"score": 0.0047090997998449095, "phrase": "\"generalized_tractability"}, {"score": 0.004697482516700464, "phrase": "multivariate_problems"}, {"score": 0.004669819133625555, "phrase": "linear"}, {"score": 0.004616956354114161, "phrase": "j._complex"}, {"score": 0.004509864300611684, "phrase": "arbitrary_continuous_linear_functionals"}, {"score": 0.004471035765089235, "phrase": "operator_s-d"}, {"score": 0.0044489976386927945, "phrase": "d-fold_tensor_product"}, {"score": 0.004432540042719034, "phrase": "compact_linear_operator"}, {"score": 0.0043833889928104035, "phrase": "tractability_conditions"}, {"score": 0.004255458429019825, "phrase": "minimal_number"}, {"score": 0.004244955499652296, "phrase": "information_evaluations"}, {"score": 0.004151449562551068, "phrase": "product_form"}, {"score": 0.003917308752832928, "phrase": "tractability_function"}, {"score": 0.003793416509908745, "phrase": "smallest_power"}, {"score": 0.0035352976934624296, "phrase": "proper_subsets"}, {"score": 0.0031512007074790214, "phrase": "singular_values"}, {"score": 0.0031356476727063096, "phrase": "mostly_asymptotic_properties"}, {"score": 0.0031279881100495814, "phrase": "t."}, {"score": 0.0029658618458107034, "phrase": "tractability_functions"}, {"score": 0.002472567042052765, "phrase": "second_singular_eigenvalue"}, {"score": 0.0022338938462817867, "phrase": "tractability_results"}, {"score": 0.0022009497295481678, "phrase": "restricted_domain"}], "paper_keywords": ["Tractability", " Multivariate problem", " Tensor product problem", " Information-based complexity", " Linear information"], "paper_abstract": "We continue the study of generalized tractability initiated in our previous paper \"Generalized tractability for multivariate problems, Part I: Linear tensor product problems and linear information\", J. Complex. 23:262-295, 2007. We study linear tensor product problems for which we can compute linear information which is given by arbitrary continuous linear functionals. We want to approximate an operator S-d given as the d-fold tensor product of a compact linear operator S-1 for d = 1, 2,..., with parallel to S-1 parallel to = 1 and S-1 having at least two positive singular values. Let n(epsilon, S-d) be the minimal number of information evaluations needed to approximate Sd to within epsilon is an element of [0, 1]. We study generalized tractability by verifying when n(epsilon, S-d) can be bounded by a multiple of a power of T(epsilon(-1), d) for all (epsilon(-1), d). Omega subset of [1, infinity) x N. Here, T is a tractability function which is non-decreasing in both variables and grows slower than exponentially to infinity. We study the exponent of tractability which is the smallest power of T(epsilon(-1), d) whose multiple bounds n(epsilon, S-d). We also study weak tractability, i.e., when lim(epsilon-1+d ->infinity), ((epsilon-1, d)is an element of Omega) ln n(epsilon, S-d)/(epsilon(-1) + d) = 0. In our previous paper, we studied generalized tractability for proper subsets Omega of [1, infinity) x N, whereas in this paper we take the unrestricted domain Omega(unr) = [1, infinity) x N. We consider the three cases for which we have only finitely many positive singular values of S-1, or they decay exponentially or polynomially fast. Weak tractability holds for these three cases, and for all linear tensor product problems for which the singular values of S-1 decay slightly faster than logarithmically. We provide necessary and sufficient conditions on the function T such that generalized tractability holds. These conditions are obtained in terms of the singular values of S-1 and mostly asymptotic properties of T. The tractability conditions tell us how fast T must go to infinity. It is known that T must go to infinity faster than polynomially. We show that generalized tractability is obtained for T(x, y) = x(1+ln y). We also study tractability functions T of product form, T(x, y) = f(1)(x)f(2)(x). Assume that a(i) = lim inf(x -> 8)(ln ln f(i)(x))/(ln ln x) is finite for i = 1, 2. Then generalized tractability takes place iff a(i) > 1 and (a(1) - 1)(a(2) - 1) >= 1, and if (a(1) - 1)(a(2) - 1) = 1 then we need to assume one more condition given in the paper. If (a(1) - 1)(a(2) - 1) > 1 then the exponent of tractability is zero, and if (a(1) - 1)(a(2) - 1) = 1 then the exponent of tractability is finite. It is interesting to add that for T being of the product form, the tractability conditions as well as the exponent of tractability depend only on the second singular eigenvalue of S-1 and they do not depend on the rate of their decay. Finally, we compare the results obtained in this paper for the unrestricted domain Omega(unr) with the results from our previous paper obtained for the restricted domain Omega(res) = [1, infinity) x {1, 2, ..., d*}boolean OR[1, epsilon(-1)(0)) x N with d* >= 1 and epsilon(0) is an element of (0, 1). In general, the tractability results are quite different. We may have generalized tractability for the restricted domain and no generalized tractability for the unrestricted domain which is the case, for instance, for polynomial tractability T(x, y) = xy. We may also have generalized tractability for both domains with different or with the same exponents of tractability.", "paper_title": "Generalized Tractability for Multivariate Problems Part II: Linear Tensor Product Problems, Linear Information, and Unrestricted Tractability", "paper_id": "WOS:000267541200002"}