{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "feature_selection"}, {"score": 0.00429558848734449, "phrase": "biomedical_research"}, {"score": 0.00419861271409079, "phrase": "non-deterministic_polynomial-time_hard_characteristic"}, {"score": 0.0037798652680135106, "phrase": "biomedical_problems"}, {"score": 0.003711409222544974, "phrase": "high_dimensionality"}, {"score": 0.0035945701438887282, "phrase": "feature_selection_methods"}, {"score": 0.0033872210664940817, "phrase": "six_meta-heuristics"}, {"score": 0.0028731719610706214, "phrase": "meta-heuristic_community"}, {"score": 0.0023818288346547692, "phrase": "performance_tests"}, {"score": 0.002349357968054711, "phrase": "experimental_results"}, {"score": 0.002244277924422011, "phrase": "ideal_results"}, {"score": 0.0022238315004700607, "phrase": "low-dimensional_feature_selection_problems"}, {"score": 0.0021340985236583017, "phrase": "proper_algorithm"}, {"score": 0.0021049977753042253, "phrase": "high-dimensional_ones"}], "paper_keywords": ["meta-heuristic", " feature selection", " biomedicine"], "paper_abstract": "Feature selection can efficiently improve the accuracy of classification and reduce the measurement, storage and computation demands, and thus it has been applied in biomedical research increasingly. Considering the non-deterministic polynomial-time hard characteristic of feature selection, meta-heuristics are introduced into feature selection in biomedicine on account of their excellent global search ability. However, most of biomedical problems are characterized by high dimensionality, which is a challenge for feature selection methods based on meta-heuristics due to the curse of dimensionality. Thus, six meta-heuristics, that is, a genetic algorithm, particle swarm optimization, ant colony optimization, harmony search, differential evolution, and quantum-inspired evolutionary algorithm, which are widely studied in the meta-heuristic community, are introduced into feature selection in this paper and the performance of the algorithms is analysed and compared with each other for solving feature selection in biomedicine effectively. To evaluate the search ability of the algorithms fairly and exactly, a set of feature selection benchmark problems are designed and yielded for the performance tests. The experimental results show that all the meta-heuristics are powerful enough to achieve the ideal results on low-dimensional feature selection problems, while it is essential to choose a proper algorithm for the high-dimensional ones.", "paper_title": "Feature selection based on meta-heuristics for biomedicine", "paper_id": "WOS:000331336100002"}