{"auto_keywords": [{"score": 0.04685104062438759, "phrase": "planning_system"}, {"score": 0.013761597285463941, "phrase": "holonic_mes"}, {"score": 0.00481495049065317, "phrase": "robust_and_efficient_planning_execution"}, {"score": 0.004673290248999786, "phrase": "holonic_manufacturing_execution_system"}, {"score": 0.0038869467872381957, "phrase": "global_performance"}, {"score": 0.0037724857647796813, "phrase": "specific_manufacturing_case"}, {"score": 0.0033639840192975835, "phrase": "manufacturing_case"}, {"score": 0.0030600037430513274, "phrase": "hems"}, {"score": 0.002984665318717504, "phrase": "planning_systems"}, {"score": 0.002925728709297618, "phrase": "execution_time"}, {"score": 0.0025191653363555193, "phrase": "varying_work_loads"}, {"score": 0.0023846534541336326, "phrase": "new_solutions"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["holon", " HMS", " ant colony engineering", " multi-agent", " planning system"], "paper_abstract": "This paper presents a holonic manufacturing execution system (MES) that cooperates with a planning system. This cooperation allows to combine the robustness and flexibility of the holonic MES with the optimisation performed by the planning system. The paper investigates the effect on the global performance of this cooperation for a specific manufacturing case in a series of experiments. It compares the effect of this cooperation when the planning is optimal with regard to the manufacturing case with situations where the planning system is not optimal. More precisely, it compares the performance of the HEMS in situations where the planning systems systematically misestimates the execution time of a workstation (e.g. a poorly maintained workstation or a partially operational workstation) to situations where this is not the case. The experiments are conducted under varying work loads. Also, the effort the Holonic MES puts in finding new solutions resembling the planning is varied. Finally, the paper reports the results of the experiments and draws conclusions. (C) 2007 Elsevier Ltd. All rights reserved.", "paper_title": "Towards robust and efficient planning execution", "paper_id": "WOS:000256710200002"}