{"auto_keywords": [{"score": 0.00469678464293492, "phrase": "information_technology"}, {"score": 0.004252296935371162, "phrase": "different_goals"}, {"score": 0.0041478818670853115, "phrase": "outsourcing_arrangements"}, {"score": 0.004096635798793164, "phrase": "contractual_governance"}, {"score": 0.003946650265907885, "phrase": "outsourcing_relationship"}, {"score": 0.0038737214010638745, "phrase": "relational_governance"}, {"score": 0.003802135020791801, "phrase": "changing_business_needs"}, {"score": 0.0034851070574149993, "phrase": "appropriate_balance"}, {"score": 0.0028917056916949718, "phrase": "black_box"}, {"score": 0.0028382152567141784, "phrase": "evolutionary_process"}, {"score": 0.002633941112839883, "phrase": "contractual_and_relational_forms"}, {"score": 0.0022967713922705, "phrase": "qualitative_study"}, {"score": 0.0021049977753042253, "phrase": "contractual_and_relational_governance"}], "paper_keywords": ["IT outsourcing", " IT outsourcing governance", " organizational ambidexterity", " outsourcing", " outsourcing governance", " pendulum process"], "paper_abstract": "Two types of information technology (IT) outsourcing governance-contractual and relational-are commonly employed to address different goals in IT service management in outsourcing arrangements. Contractual governance helps improve efficiency in an outsourcing relationship, whereas relational governance facilitates satisfying changing business needs. Past literature argues that both forms of governance are important and that an appropriate balance between them is necessary. This study finds that these two forms of governance often conflict with one another. We contribute to the research on IT outsourcing governance by opening the black box of the evolutionary process of achieving ambidexterity in this context. Organizations shift their focus between contractual and relational forms of governance in an attempt to develop practices that address conflicts between the two forms. We present the findings from a qualitative study of an organization that outsourced its IT services. Our findings reveal how a balance between contractual and relational governance can be achieved through a process we call the ambidexterity pendulum.", "paper_title": "Evolution of Governance: Achieving Ambidexterity in IT Outsourcing", "paper_id": "WOS:000333022200006"}