{"auto_keywords": [{"score": 0.04927872927155838, "phrase": "semantic_distance"}, {"score": 0.03246594998112075, "phrase": "positive_instances"}, {"score": 0.004500891637057374, "phrase": "new_object_recognition_model"}, {"score": 0.0041136473765874815, "phrase": "computer_vision"}, {"score": 0.00378080526397273, "phrase": "special_categories"}, {"score": 0.0036759314172445934, "phrase": "full_advantage"}, {"score": 0.0033594249301033604, "phrase": "main_insight"}, {"score": 0.002805597755796506, "phrase": "closer_semantic_distance"}, {"score": 0.0026971491199975083, "phrase": "farther_semantic_distance"}, {"score": 0.0025928815987676535, "phrase": "regularized_kernel_machine_algorithm"}, {"score": 0.0023962545023307937, "phrase": "existing_object_recognition_methods"}, {"score": 0.0021651504858015364, "phrase": "learning_instances"}, {"score": 0.0021049977753042253, "phrase": "accurate_rate"}], "paper_keywords": ["Semantic distance", " Object recognition", " GIST", " SIFT", " AP value", " AUC value"], "paper_abstract": "In this paper, we present a new object recognition model with few instances based on semantic distance. Learning objects with many instances have been studied in computer vision for many years. However, in many cases, not enough positive instances occur, especially for some special categories. We must take full advantage of all instances, including those that do not belong to the category. The main insight is that, given a few positive instances from one category, we can define some other candidate instances as positive instances based on semantic distance to learn this model. Our model responds more strongly to instances with closer semantic distance to positive instances than to instances with farther semantic distance to positive instances. We use a regularized kernel machine algorithm to train the images from the database. The superiority of our method to existing object recognition methods is demonstrated. Experiments using an image database show that our method not only reduces the number of learning instances but also keeps the accurate rate of recognition.", "paper_title": "Optimized recognition with few instances based on semantic distance", "paper_id": "WOS:000350901600001"}