{"auto_keywords": [{"score": 0.04957786067961377, "phrase": "family_health_history"}, {"score": 0.00481495049065317, "phrase": "electronic_family_health_history_applications"}, {"score": 0.00471465954562773, "phrase": "important_information"}, {"score": 0.004640808212832262, "phrase": "genetic_and_environmental_factors"}, {"score": 0.0036810726176482278, "phrase": "descriptive_analysis"}, {"score": 0.0036043137580229873, "phrase": "family_health_history_interviews"}, {"score": 0.003383475802364289, "phrase": "family_health_history_tools"}, {"score": 0.0031594291695784286, "phrase": "nonbiological_family_members"}, {"score": 0.0029346624184926305, "phrase": "individual_perceptions"}, {"score": 0.002798662730881037, "phrase": "large_biological_families"}, {"score": 0.002518525107994039, "phrase": "important_considerations"}, {"score": 0.002326938965568362, "phrase": "causal_relationships"}, {"score": 0.0021049977753042253, "phrase": "family_health_history_applications"}], "paper_keywords": ["Family health history", " Genomics", " Nursing informatics"], "paper_abstract": "Family health history contains important information about the genetic and environmental factors that contribute to patterns of health and illness in families. Applications for collecting, managing, and analyzing family health history could be improved if their design were informed by an understanding of how consumers think about and report family health history. This article presents a descriptive analysis of themes from family health history interviews that have implications for development, selection, and use of family health history tools. Important themes included ways in which family is defined, including nonbiological family members and pets; ideas about health and disease, including degree of exposure and individual perceptions; and barriers to reporting family health history, including large biological families and uncertainty. Some themes identified (eg, uncertainty) have been recognized previously and continue to be important considerations. Other themes identified, such as perceptions about severity of illness or conditions and causal relationships, are newly recognized and may have implications for nurses and other providers designing, selecting, and using family health history applications.", "paper_title": "Data-Based Considerations for Electronic Family Health History Applications", "paper_id": "WOS:000302481500005"}