{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "neighbor_sensor_networks"}, {"score": 0.00479792330485269, "phrase": "disjoint_partitions"}, {"score": 0.004655924035639928, "phrase": "multiple_wireless_sensor_networks"}, {"score": 0.004502126088469323, "phrase": "different_authorities"}, {"score": 0.004043158538239064, "phrase": "linear_programming_framework"}, {"score": 0.003780286517897356, "phrase": "non-cooperating_networks"}, {"score": 0.0034638476252104706, "phrase": "data_packets"}, {"score": 0.003238517900104576, "phrase": "cooperation_case"}, {"score": 0.002811770047652563, "phrase": "overall_network_lifetime"}, {"score": 0.002558909812664716, "phrase": "limited_transmission_ranges"}, {"score": 0.002524688179363081, "phrase": "sensor_nodes"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Wireless sensor networks", " Linear Programming", " Network lifetime", " Disjoint partition", " Cooperation"], "paper_abstract": "In this paper we consider neighbor sensor networks which are defined as multiple wireless sensor networks under the administration of different authorities but located physically on the same area or close to each other. We construct a Linear Programming framework to characterize the cooperation of neighbor sensor networks in comparison to non-cooperating networks. We show that if neighbor sensor networks cooperate with each other for relaying data packets then this cooperation brings two advantages as compared to no cooperation case. First, lifetime of both networks is prolonged the results of our analysis show that cooperation between neighbor sensor networks can significantly extend the overall network lifetime. Second, cooperation reduces the probability of disjoint partitions arising due to the limited transmission ranges of sensor nodes. When neighbor sensor networks cooperate, eliminating disjoint partitions is possible with sensors having shorter transmission ranges as demonstrated and quantified by our analysis. (C) 2012 Elsevier B.V. All rights reserved.", "paper_title": "Neighbor sensor networks: Increasing lifetime and eliminating partitioning through cooperation", "paper_id": "WOS:000317029700005"}