{"auto_keywords": [{"score": 0.04852911059403898, "phrase": "exame_system"}, {"score": 0.013212310600916816, "phrase": "fixed_tests"}, {"score": 0.008713768692145006, "phrase": "exame_evaluation_system"}, {"score": 0.006095640582749807, "phrase": "cronbach's_alpha"}, {"score": 0.004574709094672837, "phrase": "targeted_knowledge"}, {"score": 0.004426607895888934, "phrase": "new_features"}, {"score": 0.004221072004655573, "phrase": "new_three-layer_architecture"}, {"score": 0.003923269062268688, "phrase": "special_detail"}, {"score": 0.0037684961730030235, "phrase": "theory_background"}, {"score": 0.0034139056533151, "phrase": "educational_tests"}, {"score": 0.0033397385936467204, "phrase": "standardized_item_alpha"}, {"score": 0.003303259489028193, "phrase": "half_coefficient"}, {"score": 0.0028741605025505435, "phrase": "confidence_interval"}, {"score": 0.0026613618933208467, "phrase": "supporting_evaluation_tool"}, {"score": 0.002528300562452668, "phrase": "biomedical_informatics"}, {"score": 0.0025098414374397308, "phrase": "charles_university"}, {"score": 0.002491519527714775, "phrase": "prague"}, {"score": 0.002437339565360659, "phrase": "new_possibilities"}, {"score": 0.002401875938287542, "phrase": "distance_learning"}, {"score": 0.0023496433751182162, "phrase": "electronic_books"}], "paper_keywords": ["education", " evaluation", " Internet", " reliability", " bioinformatics"], "paper_abstract": "Objectives: The ExaMe system for the evaluation of targeted knowledge has been in development since 1998. The new features of the ExaMe system are introduced in this paper. Especially, the new three-layer architecture is described. Besides the system itself, the properties of fixed tests in the ExaMe system are studied. In special detail, the reliability of the fixed tests is discussed. The theory background is explained and some limitations of the reliability are pointed out. Methods for Estimation of the Reliability: Three characteristics used for estimation of reliability of educational tests are discussed: Cronbach's alpha, standardized item alpha and split half coefficient. The relation between these characteristics and reliability and between characteristics themselves is investigated. In more detail, the properties of Cronbach's alpha, the characteristics mostly used for the estimation of reliability, are discussed. A confidence interval is introduced for the characteristics. Results and Conclusions: Since 2000, the serviceability of the ExaMe evaluation system as the supporting evaluation tool has been repeatedly shown at the courses of Ph.D. studies in biomedical informatics at Charles University in Prague. The ExaMe system also opens new possibilities for self-evaluation and distance learning, especially when connected with electronic books on the Internet. The estimation of reliability of tests contains some limitations. Keeping them in mind, we can still get some information about the quality of certain educational tests. Therefore, the estimation of reliability of the fixed tests is implemented in the ExaMe system.", "paper_title": "The new features of the ExaMe evaluation system and reliability of its fixed tests", "paper_id": "WOS:000237672800013"}