{"auto_keywords": [{"score": 0.044322505446268326, "phrase": "search_results"}, {"score": 0.014008364810137371, "phrase": "different_orderings"}, {"score": 0.00481495049065317, "phrase": "presentation_bias"}, {"score": 0.004683292152590589, "phrase": "user_preference"}, {"score": 0.004631637679516574, "phrase": "search_results-a_user_study"}, {"score": 0.004333406378146173, "phrase": "user_preferences"}, {"score": 0.00392153537973826, "phrase": "best_ordering"}, {"score": 0.0033945024593626675, "phrase": "search_engine"}, {"score": 0.0032290277960438855, "phrase": "nine_different_synthetic_orderings"}, {"score": 0.0030715948036518603, "phrase": "slight_overall_preference"}, {"score": 0.0030208364972341096, "phrase": "search_engines'_original_orderings"}, {"score": 0.002873524721802591, "phrase": "users'_choice"}, {"score": 0.0028260302580927856, "phrase": "\"best\"_result"}, {"score": 0.002164331818029166, "phrase": "placement_bias"}, {"score": 0.0021049977753042253, "phrase": "small_bias"}], "paper_keywords": [""], "paper_abstract": "We describe the results of an experiment designed to study user preferences for different orderings of search results from three major search engines. In the experiment, 65 users were asked to choose the best ordering from two different orderings of the same set of search results: Each pair consisted of the search engine's original top-10 ordering and a synthetic ordering created from the same top-10 results retrieved by the search engine. This process was repeated for 12 queries and nine different synthetic orderings. The results show that there is a slight overall preference for the search engines' original orderings, but the preference is rarely significant. Users' choice of the \"best\" result from each of the different orderings indicates that placement on the page (i.e., whether the result appears near the top) is the most important factor used in determining the quality of the result, not the actual content displayed in the top-10 snippets. In addition to the placement bias, we detected a small bias due to the reputation of the sites appearing in the search results.", "paper_title": "Presentation Bias Is Significant in Determining User Preference for Search Results-A User Study", "paper_id": "WOS:000262424900013"}