{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "voronoi_diagrams"}, {"score": 0.04788992596085788, "phrase": "parallel_algorithm"}, {"score": 0.04291641516267786, "phrase": "sub-voronoi_diagrams"}, {"score": 0.015479200759850795, "phrase": "point-set_adaptive_grouping"}, {"score": 0.010516591123153899, "phrase": "boundary_points"}, {"score": 0.004384960761826366, "phrase": "binary_tree_splitting_method"}, {"score": 0.004294724955301414, "phrase": "adaptively_group"}, {"score": 0.0030308784612749647, "phrase": "boundary_site_voronoi_diagrams"}, {"score": 0.0029072537537959374, "phrase": "boundary_point"}, {"score": 0.0028325548627901004, "phrase": "corresponding_boundary_site"}, {"score": 0.0028178868081621795, "phrase": "voronoi"}, {"score": 0.0027311809666295565, "phrase": "desired_voronoi_diagram"}, {"score": 0.0021049977753042253, "phrase": "john_wiley"}], "paper_keywords": ["Voronoi diagrams", " parallel algorithm", " adaptive grouping", " geographical information system", " computational geometry"], "paper_abstract": "This paper presents a parallel algorithm for constructing Voronoi diagrams based on point-set adaptive grouping. The binary tree splitting method is used to adaptively group the point set in the plane and construct sub-Voronoi diagrams for each group. Given that the construction of Voronoi diagrams in each group consumes the majority of time and that construction within one group does not affect that in other groups, the use of a parallel algorithm is suitable.After constructing the sub-Voronoi diagrams, we extracted the boundary points of the four sides of each sub-group and used to construct boundary site Voronoi diagrams. Finally, the sub-Voronoi diagrams containing each boundary point are merged with the corresponding boundary site Voronoi diagrams. This produces the desired Voronoi diagram. Experiments demonstrate the efficiency of this parallel algorithm, and its time complexity is calculated as a function of the size of the point set, the number of processors, the average number of points in each block, and the number of boundary points. Copyright (c) 2013 John Wiley & Sons, Ltd.", "paper_title": "A parallel algorithm for constructing Voronoi diagrams based on point-set adaptive grouping", "paper_id": "WOS:000329764200007"}