{"auto_keywords": [{"score": 0.04511106669370303, "phrase": "aci"}, {"score": 0.019876232111546696, "phrase": "informatics_practice"}, {"score": 0.01203184294542816, "phrase": "mim"}, {"score": 0.008724681635715256, "phrase": "aci_editorial_policies"}, {"score": 0.004564061428630139, "phrase": "scientific_fundamentals"}, {"score": 0.00440093312826378, "phrase": "health_care"}, {"score": 0.004335461950371287, "phrase": "applied_clinical_informatics"}, {"score": 0.00418046991987597, "phrase": "sharing_of_knowledge_between_clinical_medicine_and_health_it_specialists_as_well_as_to_bridge_gaps"}, {"score": 0.004110478237622407, "phrase": "direct_links"}, {"score": 0.00409188863874203, "phrase": "clinical_information_systems"}, {"score": 0.004048301498459184, "phrase": "official_journals"}, {"score": 0.0038289937665255294, "phrase": "mim."}, {"score": 0.0037719988989298983, "phrase": "major_topics"}, {"score": 0.0035676056286816915, "phrase": "aci_publications"}, {"score": 0.003274499008699115, "phrase": "retrospective_observational_study"}, {"score": 0.003205052842427402, "phrase": "calendar_year"}, {"score": 0.003123652729688503, "phrase": "key_words"}, {"score": 0.0030639580614404372, "phrase": "mim_papers"}, {"score": 0.002998963650660305, "phrase": "aci_articles"}, {"score": 0.0027524463528136966, "phrase": "clinical_decision_support"}, {"score": 0.0027406653437581875, "phrase": "clinical_documentation"}, {"score": 0.0027172539732903916, "phrase": "meaningful_use"}, {"score": 0.0026882700311968025, "phrase": "clinical_research_informatics"}, {"score": 0.0026710278770367786, "phrase": "major_themes"}, {"score": 0.0026312238938540787, "phrase": "aci_article"}, {"score": 0.0025424508991051483, "phrase": "mim_theory"}, {"score": 0.0025315664299815537, "phrase": "aci_practice"}, {"score": 0.0024356742694508662, "phrase": "clinical_informatics"}, {"score": 0.0023333715029833007, "phrase": "aci_editors"}, {"score": 0.002288744855588159, "phrase": "informatics_theory-based_papers"}, {"score": 0.002104997963400991, "phrase": "aci."}], "paper_keywords": ["Clinical informatics", " biomedical informatics", " informatics practice", " informatics theory"], "paper_abstract": "Background: In 1962, Methods of Information in Medicine (MIM) began to publish papers on the methodology and scientific fundamentals of organizing, representing, and analyzing data, information, and knowledge in biomedicine and health care. Considered a companion journal, Applied Clinical Informatics (ACI) was launched in 2009 with a mission to establish a platform that allows sharing of knowledge between clinical medicine and health IT specialists as well as to bridge gaps between visionary design and successful and pragmatic deployment of clinical information systems. Both journals are official journals of the International Medical Informatics Association. Objectives: As a follow-up to prior work, we set out to explore congruencies and interdependencies in publications of ACI and MIM. The objectives were to describe the major topics discussed in articles published in ACI in 2014 and to determine if there was evidence that theory in 2014 MIM publications was informed by practice described in ACI publications in any year. We also set out to describe lessons learned in the context of bridging informatics practice and theory and offer opinions on how ACI editorial policies could evolve to foster and improve such bridging. Methods: We conducted a retrospective observational study and reviewed all articles published in ACI during the calendar year 2014 (Volume 5) for their main theme, conclusions, and key words. We then reviewed the citations of all MIM papers from 2014 to determine if there were references to ACI articles from any year. Lessons learned in the context of bridging informatics practice and theory and opinions on ACI editorial policies were developed by consensus among the two authors. Results: A total of 70 articles were published in ACI in 2014. Clinical decision support, clinical documentation, usability, Meaningful Use, health information exchange, patient portals, and clinical research informatics emerged as major themes. Only one MIM article from 2014 cited an ACI article. There are several lessons learned including the possibility that there may not be direct links between MIM theory and ACI practice articles. ACI editorial policies will continue to evolve to reflect the breadth and depth of the practice of clinical informatics and articles received for publication. Efforts to encourage bridging of informatics practice and theory may be considered by the ACI editors. Conclusions: The lack of direct links from informatics theory-based papers published in MIM in 2014 to papers published in ACI continues as was described for papers published during 2012 to 2013 in the two companion journals. Thus, there is little evidence that theory in MIM has been informed by practice in ACI.", "paper_title": "Improving Bridging from Informatics Practice to Theory", "paper_id": "WOS:000366043500009"}