{"auto_keywords": [{"score": 0.032576110574299134, "phrase": "approximate_mappings"}, {"score": 0.02818210954343276, "phrase": "manual_encoding"}, {"score": 0.00481495049065317, "phrase": "primary_care"}, {"score": 0.0046738485441681485, "phrase": "reimbursement_mappings"}, {"score": 0.00461246494886034, "phrase": "general_equivalence"}, {"score": 0.004317378385832431, "phrase": "prospectively_dual-encoded_diagnoses"}, {"score": 0.004176961840039024, "phrase": "clinical_setting"}, {"score": 0.0041084684278314305, "phrase": "professional_coders"}, {"score": 0.0039096275435779124, "phrase": "manual_mappings"}, {"score": 0.0035519826240477444, "phrase": "gems_flags"}, {"score": 0.0034706569037527774, "phrase": "results_manual_encodings"}, {"score": 0.003413705707789296, "phrase": "forward_gems"}, {"score": 0.0033911868693238894, "phrase": "backward_gems"}, {"score": 0.002845502417672334, "phrase": "coder_interpretation"}, {"score": 0.002752824177838148, "phrase": "unknown_reasons"}, {"score": 0.0025257081555100556, "phrase": "one-to-one_gems_entries"}, {"score": 0.0023481972886024347, "phrase": "mismatch_characteristics"}, {"score": 0.0023249757987087055, "phrase": "subtle_differences"}, {"score": 0.0021049977753042253, "phrase": "longitudinal_statistics"}], "paper_keywords": ["ICD-9-CM", " ICD-10-CM", " GEMs", " General Equivalence Mappings", " Reimbursement Mappings", " International Classification of Diseases"], "paper_abstract": "Objective The general equivalence mappings (GEMs) and reimbursement mappings (RMs) facilitate translation between ICD-9-CM and ICD-10-CM. This study compared prospectively dual-encoded diagnoses assigned by professional coders with the GEMs/RMs in a clinical setting. Materials and Methods Professional coders manually encoded diagnoses from 100 primary care notes into both ICD9-CM and ICD-10-CM. The investigators evaluated whether manual mappings were reproducible using the GEMs/RMs. Reproducible mappings with one ICD-9-CM and one ICD-10-CM code (\"one-to-one\") were classified as exact or approximate using GEMs flags. Mismatches were characterized manually. Results Manual encodings were reproducible from the forward GEMs, backward GEMs, and RMs in 85.2%, 90.4%, and 88.1% of diagnoses, respectively. For one-to-one, reproducible mappings, 61% (forward) and 63% (backward) were approximate mappings compared to 85% and 95% in the GEMs as a whole. Mismatches between manual and GEMs encodings were due to differences in coder interpretation (11%-13%), subtle hierarchical differences (52%-55%), or unknown reasons (32%-35%). Discussion This study highlights inconsistencies between manual encoding and using the GEMs/RMs. The number of approximate mappings in our population compared to all one-to-one GEMs entries supports the notion that statistics describing the GEMs as a whole might not represent the most important mappings for each organization. The mismatch characteristics highlight the subtle differences between manual encoding and using the GEMs/RMs. Conclusion These results support the need for organizations to assess the GEMs and RMs in their own environment to avoid changes in reimbursement and longitudinal statistics.", "paper_title": "ICD-10-CM Crosswalks in the primary care setting: assessing reliability of the GEMs and reimbursement mappings", "paper_id": "WOS:000352771500019"}