{"auto_keywords": [{"score": 0.04721825881327069, "phrase": "environmental_conditions"}, {"score": 0.00481495049065317, "phrase": "agricultural_field_experiments"}, {"score": 0.004689650818647484, "phrase": "agricultural_research"}, {"score": 0.004621447740470602, "phrase": "complex_interactions"}, {"score": 0.004554232022653028, "phrase": "wide_range"}, {"score": 0.004501160823792861, "phrase": "crop_management_scenarios"}, {"score": 0.004422706216600923, "phrase": "multiple_sets"}, {"score": 0.004396858397567621, "phrase": "experimental_data"}, {"score": 0.004220086640742953, "phrase": "standard_data_formats"}, {"score": 0.004146510711518748, "phrase": "crop_growth"}, {"score": 0.0035600768845860937, "phrase": "icasa"}, {"score": 0.003518549786513923, "phrase": "considerable_value"}, {"score": 0.0033968425231674262, "phrase": "important_management_practices"}, {"score": 0.0032601438574879666, "phrase": "plant_traits"}, {"score": 0.003212663446866794, "phrase": "nutrient_levels"}, {"score": 0.0031658723398585516, "phrase": "minor_logical_inconsistencies"}, {"score": 0.003138124398958758, "phrase": "icasa_standards"}, {"score": 0.00307431840409833, "phrase": "additional_management_practices"}, {"score": 0.0029854041893236714, "phrase": "greater_emphasis"}, {"score": 0.0028568174308720167, "phrase": "original_plain_text_file_format"}, {"score": 0.00270978310478061, "phrase": "master_list_variables"}, {"score": 0.0026624684547385718, "phrase": "hierarchical_arrangement"}, {"score": 0.002646880721119838, "phrase": "major_separations"}, {"score": 0.002615977783510631, "phrase": "management_practices"}, {"score": 0.0025032629377304584, "phrase": "crop_responses"}, {"score": 0.0024813081174066653, "phrase": "plain_text_implementation"}, {"score": 0.0022323643840655646, "phrase": "pest_damage"}, {"score": 0.0022192891418394514, "phrase": "data_quality"}, {"score": 0.002206290313627494, "phrase": "appropriate_use"}, {"score": 0.0021741246430344607, "phrase": "master_variable_list"}, {"score": 0.002129877319760485, "phrase": "electronic_supplements"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Climate change", " Databases", " Data management", " Crop modeling", " Software"], "paper_abstract": "Agricultural research increasingly seeks to quantify complex interactions of processes for a wide range of environmental conditions and crop management scenarios, leading to investigation where multiple sets of experimental data are examined using tools such as simulation and regression. The use of standard data formats for documenting experiments and modeling crop growth and development can facilitate exchanges of information and software, allowing researchers to focus on research per se rather than on converting and re-formatting data or trying to estimate or otherwise compensate for missing information. The standards developed by the International Benchmark Sites Network for Agrotechnology Transfer (IBSNAT) project and subsequently revised by the International Consortium for Agricultural Systems Applications (ICASA) were of considerable value for describing experiments. However, the resulting ICASA Version 1 standards did not consider important management practices such as tillage and use of mulches, lacked descriptors for certain soil and plant traits (especially related to nutrient levels), and contained minor logical inconsistencies. The ICASA standards have evolved to allow description of additional management practices and traits of soils and plants and to provide greater emphasis on standardizing vocabularies, clarifying relations among variables, and expanding formats beyond the original plain text file format. This paper provides an overview of the ICASA Version 2.0 standards. The foundation of the standards is a master list variables that is organized in a hierarchical arrangement with major separations among descriptions of management practices or treatments, environmental conditions (soil and weather data), and measurements of crop responses. The plain text implementation is described in detail. Implementations in other digital formats (databases, spreadsheets, and data interchange formats) are also reviewed. Areas for further improvement and development are noted, particularly as related to describing pest damage, data quality and appropriate use of datasets. The master variable list and sample files are provided as electronic supplements. Published by Elsevier B.V.", "paper_title": "Integrated description of agricultural field experiments and production: a The ICASA Version 2.0 data standards", "paper_id": "WOS:000323795700001"}