{"auto_keywords": [{"score": 0.04759842145051192, "phrase": "web_pages"}, {"score": 0.006982013177250828, "phrase": "ginis"}, {"score": 0.0035852640843794252, "phrase": "user_response"}, {"score": 0.003270396852243212, "phrase": "client-side_user_behavior"}, {"score": 0.0032232653428491435, "phrase": "customized_web_browser"}, {"score": 0.0030858947334838145, "phrase": "user_behavior"}, {"score": 0.0030414140732789186, "phrase": "user's_natural_interaction"}, {"score": 0.002997572637726648, "phrase": "web_browser"}, {"score": 0.002855934865505357, "phrase": "effective_rules"}, {"score": 0.0026049517737353365, "phrase": "learned_rules"}, {"score": 0.002446024708601971, "phrase": "user_profiling_applications"}, {"score": 0.002285674008055581, "phrase": "web_page"}], "paper_keywords": ["web-human interaction", " browser interface", " navigation", " web usage mining", " user modeling"], "paper_abstract": "This paper describes our efforts to investigate factors in user browsing behavior to automatically evaluate Web pages that the user shows interest in. To evaluate Web pages automatically, we developed a client-side logging/analyzing tool: the GINIS Framework. We do not focus on just clicking, scrolling, navigation, or duration of visit alone, but we propose integrating these patterns of interaction to recognize and evaluate user response to a given Web page. Unlike most previous Web studies analyzing access through proxies or servers, this work focuses primarily on client-side user behavior using a customized Web browser. First, GINIS unobtrusively gathers logs of user behavior through the user's natural interaction with the Web browser. Then, it analyses the logs and extracts effective rules to evaluate Web pages using a C4.5 machine learning system. Eventually, GINIS becomes able to automatically evaluate Web pages using these learned rules, after which the evaluation can be utilized for a variety of user profiling applications. We successfully confirmed, for example, that time spent on a Web page is not the most important factor in predicting interest from behavior, which conflicts with the findings of most previous studies.", "paper_title": "Behavior based web page evaluation", "paper_id": "WOS:000254267800003"}