{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "test_conditions"}, {"score": 0.00525657501903082, "phrase": "effect-interaction_sequence"}, {"score": 0.00467855218490191, "phrase": "run-size_minimization"}, {"score": 0.004628400269774981, "phrase": "exponential_growth"}, {"score": 0.004185377431624781, "phrase": "large_k."}, {"score": 0.003909065355459264, "phrase": "fractional_factorial_design"}, {"score": 0.0038810583785936505, "phrase": "taguchi_method"}, {"score": 0.0034716556902775007, "phrase": "wibowo"}, {"score": 0.0033490008882413103, "phrase": "exactly_m_test_conditions"}, {"score": 0.0032075033252058835, "phrase": "m-unknown_model"}, {"score": 0.0028689475587958917, "phrase": "descending_order"}, {"score": 0.0027575842698911173, "phrase": "simple_algorithm"}, {"score": 0.00247529638625566, "phrase": "exactly_the_first_nt_test_conditions"}, {"score": 0.002448704249007665, "phrase": "corresponding_test-condition_sequence"}, {"score": 0.0022540779997940897, "phrase": "test-condition_sequence"}, {"score": 0.002190064650401852, "phrase": "proposed_method"}], "paper_keywords": ["Run-size efficiency", " Effect-interaction sequence", " Run sequence", " Sequential DOE"], "paper_abstract": "The exponential growth of the number of test conditions (i.e., the \"run size\") of a 2(k) factorial design makes the design prohibitively expensive for a large k. When only m of the 2(k) effects/interact ions are non-zero, only m test conditions are required for their estimation. However, both fractional factorial design and Taguchi method require 2(n) test conditions, for some n <= k, and therefore may require more test conditions than necessary. Given the identities of the m non-zero effects/interactions, Tsao and Wibowo recently developed an algorithm to identify a set of exactly m test conditions but did not suggest how to test the adequacy of the m-unknown model or how to expand the set of test conditions incrementally when more non-zero effects/interactions actually exist. This paper proposes to incrementally and efficiently expand the model by developing an effect-interaction sequence in the descending order of their magnitudes. Given any such sequence, we provide a simple algorithm to sequence the 2 k test conditions so that, for any m, 1 <= m <= 2(k), the first tit effects/interactions in the effect-interaction sequence can be estimated with exactly the first nt test conditions in the corresponding test-condition sequence and no more, if all the other 2(k) - m effects/interact ions are zero. A benefit of this is that experiments can be performed sequentially according to the test-condition sequence until the first insignificant effect/interaction is found. The proposed method can also be used for situations where knowledge about the effects/interact ions is too vague to sort them according to their magnitudes. (C) 2008 Elsevier Ltd. All rights reserved.", "paper_title": "Optimal sequencing of test conditions in 2(k) factorial experimental design for run-size minimization", "paper_id": "WOS:000259898700012"}