{"auto_keywords": [{"score": 0.03062284688869159, "phrase": "geometric_transformation"}, {"score": 0.00481495049065317, "phrase": "copy-move_attack_detection"}, {"score": 0.004659192888931046, "phrase": "principal_problems"}, {"score": 0.0045084510240032535, "phrase": "particular_image"}, {"score": 0.004326833704481825, "phrase": "crucial_task"}, {"score": 0.004221379262804442, "phrase": "basic_evidence"}, {"score": 0.0029509483926257645, "phrase": "image_patch"}, {"score": 0.0029147175927233546, "phrase": "new_context"}, {"score": 0.0027856252557826467, "phrase": "novel_methodology"}, {"score": 0.002565345470805401, "phrase": "copy-move_attack"}, {"score": 0.0024017007954518065, "phrase": "extensive_experimental_results"}, {"score": 0.0022670785913397637, "phrase": "altered_area"}, {"score": 0.0021845387990972543, "phrase": "geometric_transformation_parameters"}, {"score": 0.002166607745253829, "phrase": "high_reliability"}, {"score": 0.0021049977753042253, "phrase": "multiple_cloning"}], "paper_keywords": ["Authenticity verification", " copy-move attack", " digital image forensics", " geometric transformation recovery"], "paper_abstract": "One of the principal problems in image forensics is determining if a particular image is authentic or not. This can be a crucial task when images are used as basic evidence to influence judgment like, for example, in a court of law. To carry out such forensic analysis, various technological instruments have been developed in the literature. In this paper, the problem of detecting if an image has been forged is investigated; in particular, attention has been paid to the case in which an area of an image is copied and then pasted onto another zone to create a duplication or to cancel something that was awkward. Generally, to adapt the image patch to the new context a geometric transformation is needed. To detect such modifications, a novel methodology based on scale invariant features transform (SIFT) is proposed. Such a method allows us to both understand if a copy-move attack has occurred and, furthermore, to recover the geometric transformation used to perform cloning. Extensive experimental results are presented to confirm that the technique is able to precisely individuate the altered area and, in addition, to estimate the geometric transformation parameters with high reliability. The method also deals with multiple cloning.", "paper_title": "A SIFT-Based Forensic Method for Copy-Move Attack Detection and Transformation Recovery", "paper_id": "WOS:000293924700020"}