{"auto_keywords": [{"score": 0.04911477212520224, "phrase": "valve_state_predictor"}, {"score": 0.03383893996367042, "phrase": "closed_valve"}, {"score": 0.00481495049065317, "phrase": "mitral_annulus_segmentation"}, {"score": 0.004775918707955445, "phrase": "four-dimensional_ultrasound"}, {"score": 0.0046797114400479135, "phrase": "constrained_optical_flow"}, {"score": 0.004493045859210086, "phrase": "mitral_valve"}, {"score": 0.004278807087784626, "phrase": "pathology_diagnosis"}, {"score": 0.004244102948402086, "phrase": "mitral_valve_modeling"}, {"score": 0.003960210592458847, "phrase": "extensive_overhead"}, {"score": 0.003680212979775528, "phrase": "annular_shape"}, {"score": 0.0028351712509358997, "phrase": "open_valve"}, {"score": 0.0028006988338192375, "phrase": "constrained_optical_flow_algorithm"}, {"score": 0.002379092507901856, "phrase": "tracking_method"}, {"score": 0.002321563536990284, "phrase": "tracking_results"}, {"score": 0.0023026973099101876, "phrase": "manual_segmentations"}, {"score": 0.00221063611719246, "phrase": "average_rms_difference"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Mitral valve", " Annulus", " Tracking", " Segmentation", " Ultrasound"], "paper_abstract": "Measurement of the shape and motion of the mitral valve annulus has proven useful in a number of applications, including pathology diagnosis and mitral valve modeling. Current methods to delineate the annulus from four-dimensional (4D) ultrasound, however, either require extensive overhead or user-interaction, become inaccurate as they accumulate tracking error, or they do not account for annular shape or motion. This paper presents a new 4D annulus segmentation method to account for these deficiencies. The method builds on a previously published three-dimensional (3D) annulus segmentation algorithm that accurately and robustly segments the mitral annulus in a frame with a closed valve. In the 4D method, a valve state predictor determines when the valve is closed. Subsequently, the 3D annulus segmentation algorithm finds the annulus in those frames. For frames with an open valve, a constrained optical flow algorithm is used to the track the annulus. The only inputs to the algorithm are the selection of one frame with a closed valve and one user-specified point near the valve, neither of which needs to be precise. The accuracy of the tracking method is shown by comparing the tracking results to manual segmentations made by a group of experts, where an average RMS difference of 1.67 +/- 0.63 mm was found across 30 tracked frames. (C) 2011 Elsevier B.V. All rights reserved.", "paper_title": "Mitral annulus segmentation from four-dimensional ultrasound using a valve state predictor and constrained optical flow", "paper_id": "WOS:000300754400011"}