{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "sensor_networks"}, {"score": 0.004760017604908536, "phrase": "wireless_sensor_networks"}, {"score": 0.004409404470207072, "phrase": "energy_conservation"}, {"score": 0.0036413370053909886, "phrase": "typical_clustered_wsn"}, {"score": 0.0035997452281985465, "phrase": "regular_nodes"}, {"score": 0.0032585499655442404, "phrase": "base_station"}, {"score": 0.0030530895634491343, "phrase": "routing_delay"}, {"score": 0.0027424619603260837, "phrase": "clustering_characteristics"}, {"score": 0.002649472341607234, "phrase": "clustering_algorithms"}, {"score": 0.002579326836642461, "phrase": "clustering_objectives"}, {"score": 0.002453934333239467, "phrase": "increased_connectivity"}, {"score": 0.002435190484324197, "phrase": "load_balancing"}, {"score": 0.0024073421672242486, "phrase": "collision_avoidance"}, {"score": 0.0023435920614377306, "phrase": "proposed_approaches"}, {"score": 0.0022990901047984197, "phrase": "classified_manner"}, {"score": 0.002246799280512825, "phrase": "different_metrics"}, {"score": 0.0022041312401435346, "phrase": "cluster_count"}, {"score": 0.0021872912745910127, "phrase": "cluster_size"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Wireless sensor networks", " Hierarchical architecture", " Clustering", " Cluster-head", " Energy-efficiency"], "paper_abstract": "Wireless sensor networks (WSNs) have recently gained the attention of researchers in many challenging aspects. The most important challenge in these networks is energy conservation. One of the most popular solutions in making WSNs energy-efficient is to cluster the networks. In clustering, the nodes are divided into some clusters and then some nodes, called cluster-heads, are selected to be the head of each cluster. In a typical clustered WSN, the regular nodes sense the field and send their data to the cluster-head, then, after gathering and aggregating the data, the cluster-head transmits them to the base station. Clustering the nodes in WSNs has many benefits, including scalability, energy-efficiency, and reducing routing delay. In this paper we present a state-of-the-art and comprehensive survey on clustering approaches. We first begin with the objectives of clustering, clustering characteristics, and then present a classification on the clustering algorithms in WSNs. Some of the clustering objectives considered in this paper include scalability, fault-tolerance, data aggregation/fusion, increased connectivity, load balancing, and collision avoidance. Then, we survey the proposed approaches in the past few years in a classified manner and compare them based on different metrics such as mobility, cluster count, cluster size, and algorithm complexity. (C) 2014 Elsevier Ltd. All rights reserved.", "paper_title": "Clustering in sensor networks: A literature survey", "paper_id": "WOS:000347769900016"}