{"auto_keywords": [{"score": 0.04798786383343483, "phrase": "hamiltonian_cycle_problem"}, {"score": 0.04632105566511859, "phrase": "markov_chains"}, {"score": 0.03316442796246428, "phrase": "doubly_stochastic_policies"}, {"score": 0.031520245156739866, "phrase": "hamiltonian"}, {"score": 0.00481495049065317, "phrase": "hamiltonicity_gap"}, {"score": 0.004231089088705995, "phrase": "stationary_policies"}, {"score": 0.003966162568548304, "phrase": "fundamental_matrices"}, {"score": 0.0036328561748082138, "phrase": "doubly_stochastic_probability_transition_matrices"}, {"score": 0.003517223847512266, "phrase": "\"doubly_stochastic_policies"}, {"score": 0.0030759821501544224, "phrase": "hamiltonian_cycle"}, {"score": 0.0026775328564629577, "phrase": "hamiltonian_case"}, {"score": 0.002225196379204285, "phrase": "first_hitting_time"}, {"score": 0.0021945194903838132, "phrase": "home_node"}, {"score": 0.0021049977753042253, "phrase": "wiley_periodicals"}], "paper_keywords": ["Hamiltonian cycle", " controlled Markov chains", " optimal policy", " singular perturbation"], "paper_abstract": "We consider the Hamiltonian cycle problem embedded in singularly perturbed (controlled) Markov chains. We also consider a functional on the space of stationary policies of the process that consists of the (1, 1)-entry of the fundamental matrices of the Markov chains induced by these policies. We focus on the subset of these policies that induce doubly stochastic probability transition matrices which we refer to as the \"doubly stochastic policies.\" We show that when the perturbation parameter, a, is sufficiently small, the minimum of this functional over the space of the doubly stochastic policies is attained at a Hamiltonian cycle, provided that the graph is Hamiltonian. We also show that when the graph is non-Hamiltonian, the above minimum is strictly greater than that in a Hamiltonian case. We call the size of this difference the \"Hamiltonicity Gap\" and derive a conservative lower bound for this gap. Our results imply that the Hamiltonian cycle problem is equivalent to the problem of minimizing the variance of the first hitting time of the home node, over doubly stochastic policies. (C) 2008 Wiley Periodicals, Inc. Random Struct. Alg., 34, 502-519, 2009", "paper_title": "On the Hamiltonicity Gap and Doubly Stochastic Matrices", "paper_id": "WOS:000266939300004"}