{"auto_keywords": [{"score": 0.04289868233502892, "phrase": "power_laws"}, {"score": 0.012156238094645855, "phrase": "single-particle_tracking"}, {"score": 0.007740646810143365, "phrase": "matlab"}, {"score": 0.007328371282081868, "phrase": "msd"}, {"score": 0.0068383197069089175, "phrase": "power-law_scaling"}, {"score": 0.0067680308085370025, "phrase": "user_defined_cutoffs"}, {"score": 0.006021950549237397, "phrase": "distributed_program"}, {"score": 0.006003299233262474, "phrase": "test_data"}, {"score": 0.005613158162613508, "phrase": "windows"}, {"score": 0.004790091061531074, "phrase": "automated_power_law_analysis"}, {"score": 0.004677372885331908, "phrase": "diffusion_coefficients"}, {"score": 0.0046676969718111765, "phrase": "active_modes"}, {"score": 0.004610058444728656, "phrase": "basic_analysis"}, {"score": 0.004606213937399415, "phrase": "msd."}, {"score": 0.004567294967643222, "phrase": "time-dependent_mean-square_displacement"}, {"score": 0.004506221681527678, "phrase": "similar_motions"}, {"score": 0.004469042910390712, "phrase": "time-dependent_power-law_scaling"}, {"score": 0.004441359373498799, "phrase": "qualitatively_and_quantitatively_comparable_msd"}, {"score": 0.0044184202192273335, "phrase": "ensemble_averaging_trajectories"}, {"score": 0.004400153852462583, "phrase": "different_mechanisms"}, {"score": 0.0043368116278232755, "phrase": "inaccurate_correlations"}, {"score": 0.0042434966122124025, "phrase": "experimentally_measured_single-particle_msd._trajectories"}, {"score": 0.004178069696719025, "phrase": "exponent_values"}, {"score": 0.004156484728482553, "phrase": "power-law_fits"}, {"score": 0.004122179528285764, "phrase": "categorized_groups"}, {"score": 0.004008467832216946, "phrase": "existing_user_codes"}, {"score": 0.00392625615535894, "phrase": "physical_or_biophysical_systems"}, {"score": 0.0039104549766380125, "phrase": "program"}, {"score": 0.0038978806337961565, "phrase": "linsa"}, {"score": 0.0038179283509963695, "phrase": "cpc_program_library"}, {"score": 0.003810023533875932, "phrase": "queen's_university"}, {"score": 0.0038021351338487744, "phrase": "belfast"}, {"score": 0.003794262778374582, "phrase": "n._ireland"}, {"score": 0.003778566972399296, "phrase": "standard_cpc"}, {"score": 0.003617616153730564, "phrase": "mathworks_inc."}, {"score": 0.0035544282277637698, "phrase": "symbolic_math_toolboxes"}, {"score": 0.003452746578188557, "phrase": "matlab."}, {"score": 0.0033539561658412487, "phrase": "temporary_outputs"}, {"score": 0.0032243876726397746, "phrase": "external"}, {"score": 0.0031191411382714422, "phrase": "nan_suite"}, {"score": 0.003074182735978717, "phrase": "executable_pdftk.exe"}, {"score": 0.003033014322177457, "phrase": "time-dependent_power-laws"}, {"score": 0.003023592244196936, "phrase": "time-averaged_meansquare_displacement"}, {"score": 0.0030048355421601705, "phrase": "single_particle"}, {"score": 0.0029523191757061923, "phrase": "underlying_mechanisms"}, {"score": 0.0029400959763737364, "phrase": "accurate_determination"}, {"score": 0.0028917056916949744, "phrase": "single_trajectories"}, {"score": 0.0028857130140890787, "phrase": "ensemble_analysis"}, {"score": 0.0028382152567141784, "phrase": "provided_program"}, {"score": 0.0028235326899286066, "phrase": "time-dependent_power_laws"}, {"score": 0.002803104254950008, "phrase": "group_particles"}, {"score": 0.002782823208502937, "phrase": "time-dependent_trajectories"}, {"score": 0.0026975488895072145, "phrase": "log-log_scale"}, {"score": 0.0026808093423503106, "phrase": "high-curvature_points"}, {"score": 0.002644894875710633, "phrase": "anchor_points"}, {"score": 0.0026013505538490223, "phrase": "error_estimations"}, {"score": 0.002566497847257119, "phrase": "single_trajectory_time-averaged_msds"}, {"score": 0.0023376541009494673, "phrase": "determined_groups"}, {"score": 0.002323142666222693, "phrase": "additional_comments"}, {"score": 0.0023183255207530193, "phrase": "readme"}, {"score": 0.002301543854692731, "phrase": "brief_description"}, {"score": 0.0022777800735119405, "phrase": "clear_instructions"}, {"score": 0.0022472527731744974, "phrase": "distribution_package"}, {"score": 0.0022217410488468456, "phrase": "automated_parts"}, {"score": 0.002207947574093727, "phrase": "data_loading"}, {"score": 0.0022033687635323942, "phrase": "user_input"}, {"score": 0.0021603398586468956, "phrase": "trajectory_length"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Time-dependent mean-square displacemen", " Single-particle trajectory analysis", " Anomalous diffusion", " Particle tracking", " MATLAB program"], "paper_abstract": "In many physical and biophysical studies, single-particle tracking is utilized to reveal interactions, diffusion coefficients, active modes of driving motion, dynamic local structure, micromechanics, and microrheology. The basic analysis applied to those data is to determine the time-dependent mean-square displacement (MSD) of particle trajectories and perform time- and ensemble-averaging of similar motions. The motion of particles typically exhibits time-dependent power-law scaling, and only trajectories with qualitatively and quantitatively comparable MSD should be ensembled. Ensemble averaging trajectories that arise from different mechanisms, e.g., actively driven and diffusive, is incorrect and can result inaccurate correlations between structure, mechanics, and activity. We have developed an algorithm to automatically and accurately determine power-law scaling of experimentally measured single-particle MSD. Trajectories can then categorized and grouped according to user defined cutoffs of time, amplitudes, scaling exponent values, or combinations. Power-law fits are then provided for each trajectory alongside categorized groups of trajectories, histograms of power laws, and the ensemble-averaged MSD of each group. The codes are designed to be easily incorporated into existing user codes. We expect that this algorithm and program will be invaluable to anyone performing single-particle tracking, be it in physical or biophysical systems. Program summary Program title: LINSA (acronym: linear segment analysis) Catalogue identifier: AEMD_v1_0 Program summary URL: http://cpc.cs.qub.ac.uk/summaries/AEMD_v1_0.html Program obtainable from: CPC Program Library, Queen's University, Belfast, N. Ireland Licensing provisions: Standard CPC licence, http://cpc.cs.qub.ac.uk/licence/licence.html No. of lines in distributed program, including test data. etc.: 25 892 No. of bytes in distributed program, including test data, etc.: 5 572 780 Distribution format: tar.gz Programming language: MATLAB (MathWorks Inc.) version 7.11 (2010b) or higher, program should also be backwards compatible. Symbolic Math Toolboxes (5.5) is required. The Curve Fitting Toolbox (3.0) is recommended. Computer: Tested on Windows only, yet should work on any computer running MATLAB. In Windows 7, should be used as administrator, if the user is not the administrator the program may not be able to save outputs and temporary outputs to all locations. Operating system: Any supporting MATLAB (MathWorks Inc.) v7.11 / 2010b or higher. Supplementary material: Sample output files (approx. 30 MBytes) are available. Classification: 12 External routines: Several MATLAB subfunctions (m-files), freely available on the web, were used as part of and included in, this code: count, NaN suite, parseArgs, roundsd, subaxis, wcov, wmean, and the executable pdfTK.exe. Nature of problem: In many physical and biophysical areas employing single-particle tracking, having the time-dependent power-laws governing the time-averaged meansquare displacement (MSD) of a single particle is crucial. Those power laws determine the mode-of-motion and hint at the underlying mechanisms driving motion. Accurate determination of the power laws that describe each trajectory will allow categorization into groups for further analysis of single trajectories or ensemble analysis, e.g. ensemble and time-averaged MSD. Solution method: The algorithm in the provided program automatically analyzes and fits time-dependent power laws to single particle trajectories, then group particles according to user defined cutoffs. It accepts time-dependent trajectories of several particles, each trajectory is run through the program, its time-averaged MSD is calculated, and power laws are determined in regions where the MSD is linear on a log-log scale. Our algorithm searches for high-curvature points in experimental data, here time-dependent MSD. Those serve as anchor points for determining the ranges of the power-law fits. Power-law scaling is then accurately determined and error estimations of the parameters and quality of fit are provided. After all single trajectory time-averaged MSDs are fit, we obtain cutoffs from the user to categorize and segment the power laws into groups: cutoff are either in exponents of the power laws, time of appearance of the fits, or both together. The trajectories are sorted according to the cutoffs and the time- and ensemble-averaged MSD of each group is provided, with histograms of the distributions of the exponents in each group. The program then allows the user to generate new trajectory files with trajectories segmented according to the determined groups, for any further required analysis. Additional comments: README file giving the names and a brief description of all the files that make-up the package and clear instructions on the installation and execution of the program is included in the distribution package. Running time: On an i5 Windows 7 machine with 4 GB RAM the automated parts of the run (excluding data loading and user input) take less than 45 minutes to analyze and save all stages for an 844 trajectory file, including optional PDF save. Trajectory length did not affect run time (tested up to 3600 frames/trajectory), which was on average 3.2 +/- 0.4 seconds per trajectory. (C) 2012 Elsevier B.V. All rights reserved.", "paper_title": "Novel algorithm and MATLAB-based program for automated power law analysis of single particle, time-dependent mean-square displacement", "paper_id": "WOS:000304384500026"}