{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "business_processes"}, {"score": 0.023057468271592156, "phrase": "user_interfaces"}, {"score": 0.021347309277331476, "phrase": "bp"}, {"score": 0.00474348728309194, "phrase": "information_technology"}, {"score": 0.004552360432689039, "phrase": "administrative_support"}, {"score": 0.003934456513187142, "phrase": "software_engineering"}, {"score": 0.003412887952564431, "phrase": "major_aspect"}, {"score": 0.003312195899931542, "phrase": "ui"}, {"score": 0.0032629585038738856, "phrase": "negative_impact"}, {"score": 0.0032024424195797674, "phrase": "functional_aspects"}, {"score": 0.00286213454317036, "phrase": "model-driven_approach"}, {"score": 0.002788066194685293, "phrase": "large_organizations"}, {"score": 0.0025198477493173165, "phrase": "enterprise_systems"}, {"score": 0.0023291617361832157, "phrase": "possible_impacts"}, {"score": 0.0022859244876449396, "phrase": "practical_method"}, {"score": 0.0022434880661725493, "phrase": "organizational_structures"}, {"score": 0.00216907363015155, "phrase": "organizational_goals"}, {"score": 0.002128801826067279, "phrase": "forward_users'_need"}, {"score": 0.0021049977753042253, "phrase": "richer_user_interaction"}], "paper_keywords": ["business process modeling", " model-driven engineering", " user-centered design"], "paper_abstract": "Information Technology (IT) has evolved over time from its traditional use as administrative support towards a more strategic role to enforce business processes (BP). But several organizations that adopt BP modeling as a source to implement enterprise systems struggle to maintain such a link. To solve this problem, most researches are focused on software engineering to specify the association between models from business and IT to support propagating changes. But even though there are several techniques to control the alignment of BP and their systems, there lacks a solution that addresses a major aspect of systems: their User Interfaces (UI). The negative impact of focusing only on functional aspects is that many changes on business processes that affect user interfaces are not carefully considered. Our solution proposes a method for the alignment of business processes with user interfaces of systems by adopting a model-driven approach. Such support is targeted at large organizations in order to enable them to be more capable of managing those links. The method along with the tool guarantees that all the models used to develop enterprise systems are internally mapped and that any attempt to make changes in at least one of them is alerted with warnings about the possible impacts. We propose a practical method, adaptable to specic organizational structures, that enables professionals to focus on achieving organizational goals, and still puts forward users' need for a richer user interaction.", "paper_title": "A Model-Driven Approach to Align Business Processes with User Interfaces", "paper_id": "WOS:000264754600014"}