{"auto_keywords": [{"score": 0.029048911658665657, "phrase": "temporal_gradient"}, {"score": 0.015376319150867715, "phrase": "wireless_sensor_networks"}, {"score": 0.00481495049065317, "phrase": "energy-efficient_reliable"}, {"score": 0.004630423009638876, "phrase": "sensory_data"}, {"score": 0.0034824724626529857, "phrase": "steer"}, {"score": 0.0034245614958572012, "phrase": "data_packet"}, {"score": 0.002800158709933889, "phrase": "next_hop"}, {"score": 0.002618366076489732, "phrase": "channel_access"}, {"score": 0.0024346858809238766, "phrase": "spatial_information"}, {"score": 0.002276566401216226, "phrase": "spatial-temporal_mapping_function"}, {"score": 0.0022261705957258506, "phrase": "comprehensive_simulations"}, {"score": 0.002128694000627911, "phrase": "efficient_and_robust_routing"}, {"score": 0.0021049977753042253, "phrase": "highly_unreliable_wsns"}], "paper_keywords": ["energy efficient", " multipath routing", " reliability", " wireless sensor networks"], "paper_abstract": "Delivering sensory data to the sink reliably in Wireless Sensor Networks (WSNs) calls for a scalable, energy-efficient and error-resilient routing solution. In this paper, a Spatial-Temporal relation-based Energy-Efficient Reliable (STEER) routing protocol is proposed to achieve the above goals. As opposed to the next-hop-selection-first, data-relay-next approach, which is typical in traditional routing protocols in WSNs, STEER reverses these two steps. In STEER, each data packet is relayed by broadcasting, and, among the neighbours (closer to the sink) that receive the data, one next-hop node will be elected. In so doing, eligibility as a next hop is evaluated by temporal gradient, which is similar to backoff for channel access in IEEE 802.11 systems. The value of temporal gradient is determined locally by the spatial information of each neighbour. To quantify the temporal gradient systematically, a spatial-temporal mapping function is proposed. Comprehensive simulations show that STEER performs well to provide efficient and robust routing in highly unreliable WSNs.", "paper_title": "Spatial-Temporal relation-based Energy-Efficient Reliable routing protocol in wireless sensor networks", "paper_id": "WOS:000280104100002"}