{"auto_keywords": [{"score": 0.04775244230872765, "phrase": "steiner_point"}, {"score": 0.008713768692145006, "phrase": "steiner_points"}, {"score": 0.004490842671590769, "phrase": "curvature_center"}, {"score": 0.004251500979153001, "phrase": "unique_invariable_position"}, {"score": 0.004188459638572375, "phrase": "non-symmetric_shape_body"}, {"score": 0.0036250779580069455, "phrase": "investitive_class"}, {"score": 0.0031061129850110994, "phrase": "last_iteration"}, {"score": 0.0030600032877646263, "phrase": "stability_analysis"}, {"score": 0.0027834145465170292, "phrase": "linear_order_complexity"}, {"score": 0.0025317627242523104, "phrase": "first_group"}, {"score": 0.0023259039577313294, "phrase": "proposed_technique"}], "paper_keywords": ["Clustering", " Steiner point", " Convex hull", " 2D data", " Image segmentation"], "paper_abstract": "This approach studies 2D object clustering based on Steiner point which is the curvature center for an object. Steiner point can be used as the unique invariable position of a non-symmetric shape body under growth. In contrast to the well known k-means clustering, this technique focuses on calculating Steiner point of an object (or samples of each investitive class) instead of finding center for each class. During clustering iteration, some samples are relabeled according to the distances to all Steiner points which have been updated in the last iteration. The stability analysis of Steiner point is presented based on a 2D data clustering problem. Also, for 2D data clustering this technique is of linear order complexity in calculating Steiner point with respect to the scale of samples. Two groups of experiments are given. The first group includes two representative 2D data sets, and the second is composed of two simple image segmentation problems. Experimental results show that the proposed technique, comparing with the classical k-means clustering and fuzzy c-means clustering, is feasible for 2D object clustering.", "paper_title": "Clustering based on Steiner points", "paper_id": "WOS:000209203600006"}