{"auto_keywords": [{"score": 0.04450903326587539, "phrase": "facial_direction"}, {"score": 0.00481495049065317, "phrase": "nonverbal_communication"}, {"score": 0.004597622380240611, "phrase": "adaptive_interaction"}, {"score": 0.004367581653370531, "phrase": "automatic_adaptation"}, {"score": 0.004300830853119242, "phrase": "user's_grasp"}, {"score": 0.004002513373645485, "phrase": "first_experiment"}, {"score": 0.0037632749713937637, "phrase": "objective_indicators"}, {"score": 0.0035201528214608914, "phrase": "remote_control"}, {"score": 0.0034485432592912917, "phrase": "intended_use"}, {"score": 0.002940626369102927, "phrase": "available_visual_information"}, {"score": 0.0028807718824400697, "phrase": "second_experiment"}, {"score": 0.0025202582748972122, "phrase": "purely_command-based_game"}, {"score": 0.002393907896783117, "phrase": "adaptive_versions"}], "paper_keywords": ["human computer interaction (HCI)", " adaptation and personalization", " empirical studies in HCI", " ubiquitous computing", " face recognition", " grasp recognition"], "paper_abstract": "We examine the use of automatic adaptation to the user's grasp and facial direction in interaction with a game. Two experimental studies were conducted. The first experiment identified patterns in grasp and facial direction that can be used as objective indicators of intentions and attention. The results indicate that participants grasp a remote control according to the intended use and turn their face towards the object with which they intend to interact. The amount of time during which the participants turned their faces towards the object was influenced by the available visual information. In the second experiment, we used the patterns identified in Experiment 1 to create a game that adapted to grasp and facial direction. We compared two adaptive games with a purely command-based game. The results show that the participants in the adaptive versions of the game were significantly faster and made fewer errors but did not rate their feeling of control as higher, nor did they have a more positive affective experience.", "paper_title": "Playing with Nonverbal Communication: Using Grasp and Facial Direction to Create Adaptive Interaction in a Game", "paper_id": "WOS:000328423800002"}