{"auto_keywords": [{"score": 0.0476409811427769, "phrase": "e-prescribing_users"}, {"score": 0.00481495049065317, "phrase": "standards-based_electronic_prescribing_systems"}, {"score": 0.004756161254039343, "phrase": "outpatient_primary_care"}, {"score": 0.004514173914270395, "phrase": "prescription_safety"}, {"score": 0.003835677927584496, "phrase": "medication_history"}, {"score": 0.003651562636212586, "phrase": "system_usability"}, {"score": 0.0036291762280629115, "phrase": "job_performance_impact"}, {"score": 0.003209090947105003, "phrase": "clinically_important_drug-drug_interactions"}, {"score": 0.002908210365588114, "phrase": "significant_difference"}, {"score": 0.0028726347068397887, "phrase": "drug_coverage_problems"}, {"score": 0.002417829700753522, "phrase": "job_performance"}, {"score": 0.0023517568875393345, "phrase": "poor_usability"}, {"score": 0.002287485527155396, "phrase": "patient_safety_benefits"}, {"score": 0.0022387107945750044, "phrase": "enhanced_benefits"}, {"score": 0.00221130685073215, "phrase": "standardized_medication_history"}, {"score": 0.0021641529087429797, "phrase": "additional_work"}, {"score": 0.0021049977753042253, "phrase": "desired_effects"}], "paper_keywords": [""], "paper_abstract": "Objective: To compare the experiences of e-prescribing users and nonusers regarding prescription safety and workload and to assess the use of information from two e-prescribing standards (for medication history and formulary and benefit information), as they are implemented. Design: Cross-sectional survey of physicians who either had installed or were awaiting installation of one of two commercial e-prescribing systems. Measurements: Perceptions about medication history and formulary and benefit information among all respondents, and among e-prescribing users, experiences with system usability, job performance impact, and amount of e-prescribing. Results: Of 395 eligible physicians, 228 (58%) completed the survey. E-prescribers (n = 139) were more likely than non-e-prescribers (n = 89) to perceive that they could identify clinically important drug-drug interactions (83 versus 67%, p = 0.004) but not that they could identify prescriptions from other providers (65 versus 60%, p = 0.49). They also perceived no significant difference in calls about drug coverage problems (76 versus 71% reported getting 10 or fewer such calls per week; p = 0.43). Most e-prescribers reported high satisfaction with their systems, but 17% had stopped using the system and another 46% said they sometimes reverted to handwriting for prescriptions that they could write electronically. The volume of e-prescribing was correlated with perceptions that it enhanced job performance, whereas quitting was associated with perceptions of poor usability. Conclusions: E-prescribing users reported patient safety benefits but they did not perceive the enhanced benefits expected from using standardized medication history or formulary and benefit information. Additional work is needed for these standards to have the desired effects.", "paper_title": "Perceptions of Standards-based Electronic Prescribing Systems as Implemented in Outpatient Primary Care: A Physician Survey", "paper_id": "WOS:000267995500009"}