{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "alzheimer's_disease"}, {"score": 0.004787595063253874, "phrase": "frontotemporal_dementia"}, {"score": 0.0047468516620285525, "phrase": "perfusion_spect_images"}, {"score": 0.004626680470601208, "phrase": "frontotemporat_dementia"}, {"score": 0.004600393827395513, "phrase": "ftd"}, {"score": 0.004333157713284926, "phrase": "automatic_method"}, {"score": 0.004128192012388041, "phrase": "perfusion_single_photon_emission"}, {"score": 0.003944112858235306, "phrase": "average_activity"}, {"score": 0.00361040845064781, "phrase": "-nearest_neighbours"}, {"score": 0.0034297140422566577, "phrase": "leave-one-out_protocol"}, {"score": 0.0032302647179383915, "phrase": "different_hospitals"}, {"score": 0.0031754329320561317, "phrase": "medical_centre"}, {"score": 0.003051073364818384, "phrase": "best_results"}, {"score": 0.0030164423559955896, "phrase": "support_vector_machine"}, {"score": 0.002999274091205852, "phrase": "partial_least_squares"}, {"score": 0.002965229277927781, "phrase": "k-nearest_neighbours_methods"}, {"score": 0.0028735797685358, "phrase": "overall_accuracy"}, {"score": 0.0027610089418453614, "phrase": "best_method"}, {"score": 0.0027218799769229596, "phrase": "leave-one-out_cross-validation"}, {"score": 0.0023064582783867645, "phrase": "differential_diagnosis"}, {"score": 0.002216054733102974, "phrase": "daily_practice"}, {"score": 0.0021908807203548345, "phrase": "visual_assessment"}, {"score": 0.0021413855297794946, "phrase": "multicentre_data"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Alzheimer's disease", " Frontotemporal dementia", " Brain SPECT", " K-Nearest neighbours", " Computer-aided diagnosis"], "paper_abstract": "Objective: Alzheimer's disease (AD) and frontotemporat dementia (FTD) are among the most frequent neurodegenerative cognitive disorders, but their differential diagnosis is difficult. The aim of this study was to evaluate an automatic method returning the probability that a patient suffers from AD or FTD from the analysis of brain perfusion single photon emission computed tomography images. Methods and materials: A set of 116 descriptors corresponding to the average activity in regions of interest was calculated from the images of 82 AD and 91 FTD patients. A set of linear (logistic regression and linear discriminant analysis) and non-linear (support vector machines, k-nearest neighbours, multilayer perceptron and kernel Logistic PLS) classification methods was subsequently used to ascertain diagnoses. Validation was carried out by means of the Leave-one-out protocol. Diagnoses by the classifier and by four physicians (visual assessment) were compared. Since images were acquired in different hospitals, the impact of the medical centre on the diagnosis of both the classifier and the physicians was investigated. Results: Best results were obtained with support vector machine and partial least squares regression coupled with k-nearest neighbours methods (PLS + K-NN), with an overall accuracy of 88%. PLS + K-NN was however considered as the best method since performances obtained with leave-one-out cross-validation were closer to whole-database learning. The performances of the classifier were higher than those of experts (accuracy ranged from 65 to 72%). Physicians found it more difficult to diagnose the images from centres other than their own, and it affected their performances. Conclusions: The performances obtained by the classifier for the differential diagnosis of AD and FTD were found convincing. It could help physicians in daily practice, particularly when visual assessment is inconclusive, or when dealing with multicentre data. (C) 2009 Elsevier B.V. All rights reserved.", "paper_title": "Differential automatic diagnosis between Alzheimer's disease and frontotemporal dementia based on perfusion SPECT images", "paper_id": "WOS:000270894500005"}