{"auto_keywords": [{"score": 0.04712665802421912, "phrase": "web_services"}, {"score": 0.03261638306028882, "phrase": "service_process"}, {"score": 0.013466616025730956, "phrase": "service_process_model"}, {"score": 0.009443383739687911, "phrase": "integrated_service_process"}, {"score": 0.005972007860414557, "phrase": "refinement_method"}, {"score": 0.00481495049065317, "phrase": "model_refinement"}, {"score": 0.0046986841646790315, "phrase": "limited_functionality"}, {"score": 0.004654779963297256, "phrase": "experiment_results"}, {"score": 0.004630270043271386, "phrase": "single_web_service"}, {"score": 0.004198839649063847, "phrase": "value-added_functions"}, {"score": 0.004097389262726735, "phrase": "key_issues"}, {"score": 0.0037519679864796906, "phrase": "service_quality"}, {"score": 0.003503497128638099, "phrase": "similar_functions"}, {"score": 0.0034693659976716197, "phrase": "different_qualities"}, {"score": 0.002344655708000408, "phrase": "process_structure_tree"}, {"score": 0.002321787726770895, "phrase": "quality_calculation"}, {"score": 0.002276717177453959, "phrase": "genetic_algorithm"}, {"score": 0.0021891781017389783, "phrase": "quality_optimization"}], "paper_keywords": ["Service process", " Quality optimization", " Model refinement", " Generic algorithm"], "paper_abstract": "Due to the limited functionality of a single Web service, a group of Web services often need to be linked together, working as an integrated service process, to provide value-added functions. One of the key issues in modeling such an integrated service process, in addition to the functions it can provide, is the assurance of service quality. As Web services have become increasingly popular, a number of Web services with similar functions but different qualities can be readily found on the Internet. Which services you select to combine into an integrated service process severely impacts the quality of that service process. The quality of a service process is also subject to its structure. In the paper, a refinement method for quality optimization of a service process model is proposed. The refinement method takes into account the selection of Web services and the structure of the service process simultaneously. More specifically, in this method, a service process model is transformed into a process structure tree for quality calculation and then a genetic algorithm is applied to refine the service process model for quality optimization. The method, together with the experiment results, is discussed in detail in the paper. The experiment results show this method can optimize the quality of the service process by applying refinement method according to the requirements.", "paper_title": "A service process optimization method based on model refinement", "paper_id": "WOS:000313166000004"}