{"auto_keywords": [{"score": 0.04418019442483552, "phrase": "np"}, {"score": 0.010865138662616104, "phrase": "entangled-prover_games"}, {"score": 0.009735150114688075, "phrase": "entangled_provers"}, {"score": 0.00481495049065317, "phrase": "first_hardness_results"}, {"score": 0.004640929126263433, "phrase": "one-round_games"}, {"score": 0.0044005599565517875, "phrase": "quantum_entanglement"}, {"score": 0.004104838067758352, "phrase": "inverse_polynomial"}, {"score": 0.004021689117050817, "phrase": "one-round_game"}, {"score": 0.0034990853199511982, "phrase": "mathematical_conjecture"}, {"score": 0.00311999316056015, "phrase": "pspace"}, {"score": 0.0030818310926031024, "phrase": "two-prover_one-round_interactive_proof_system"}, {"score": 0.0028510114763213596, "phrase": "classical_multiprover_games"}, {"score": 0.0026700637696697414, "phrase": "modified_game"}, {"score": 0.002459902948098627, "phrase": "classical_inapproximability_bounds"}, {"score": 0.002266246304762945, "phrase": "semidefinite_programs"}, {"score": 0.002184137736856711, "phrase": "verifier's_system"}], "paper_keywords": ["interactive proofs", " quantum computing", " entanglement", " almost-commuting matrices"], "paper_abstract": "We establish the first hardness results for the problem of computing the value of one-round games played by a verifier and a team of provers who can share quantum entanglement. In particular, we show that it is NP-hard to approximate within an inverse polynomial the value of a one-round game with (i) a quantum verifier and two entangled provers or (ii) a classical verifier and three entangled provers. Previously it was not even known if computing the value exactly is NP-hard. We also describe a mathematical conjecture, which, if true, would imply hardness of approximation of entangled-prover games to within a constant. Using our techniques we also show that every language in PSPACE has a two-prover one-round interactive proof system with perfect completeness and soundness 1 - 1/poly even against entangled provers. We start our proof by describing two ways to modify classical multiprover games to make them resistant to entangled provers. We then show that a strategy for the modified game that uses entanglement can be \"rounded\" to one that does not. The results then follow from classical inapproximability bounds. Our work implies that, unless P = NP, the values of entangled-prover games cannot be computed by semidefinite programs that are polynomial in the size of the verifier's system, a method that has been successful for more restricted quantum games.", "paper_title": "ENTANGLED GAMES ARE HARD TO APPROXIMATE", "paper_id": "WOS:000292108900013"}