{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "predictive_validity"}, {"score": 0.009739824714628318, "phrase": "item_level"}, {"score": 0.009485920280880815, "phrase": "health_it_system"}, {"score": 0.009299804277519657, "phrase": "construct_level"}, {"score": 0.008284059027846909, "phrase": "web-based_communication_system"}, {"score": 0.007329803748659796, "phrase": "cfa"}, {"score": 0.004767261858417823, "phrase": "health-it_usability_evaluation_scale"}, {"score": 0.0047357308775561255, "phrase": "confirmatory_factor_analysis_and_structural_equation_modeling_results"}, {"score": 0.0047068700000017435, "phrase": "background"}, {"score": 0.004105850229681625, "phrase": "internal_consistency_reliability"}, {"score": 0.004078675940346967, "phrase": "exploratory_factor_analysis"}, {"score": 0.0035831752332801674, "phrase": "cross-sectional_study"}, {"score": 0.003547642961654828, "phrase": "users'_perception"}, {"score": 0.0034317185678527672, "phrase": "health-itues's_construct_validity"}, {"score": 0.0032324864013225166, "phrase": "structural_equation_modeling"}, {"score": 0.003014576010931602, "phrase": "general_usability_factor"}, {"score": 0.002887083738036996, "phrase": "explained_variance"}, {"score": 0.0028394925080958205, "phrase": "work_life"}, {"score": 0.0024693979425773993, "phrase": "system_use"}, {"score": 0.0023886223145816376, "phrase": "additional_evidence"}, {"score": 0.0021049977753042253, "phrase": "system_development"}], "paper_keywords": [""], "paper_abstract": "Background In a previous study, we developed the Health Information Technology Usability Evaluation Scale (Health-ITUES), which is designed to support customization at the item level. Such customization matches the specific tasks/expectations of a health IT system while retaining comparability at the construct level, and provides evidence of its factorial validity and internal consistency reliability through exploratory factor analysis. Objective In this study, we advanced the development of Health-ITUES to examine its construct validity and predictive validity. Methods The health IT system studied was a web-based communication system that supported nurse staffing and scheduling. Using Health-ITUES, we conducted a cross-sectional study to evaluate users' perception toward the web-based communication system after system implementation. We examined Health-ITUES's construct validity through first and second order confirmatory factor analysis (CFA), and its predictive validity via structural equation modeling (SEM). Results The sample comprised 541 staff nurses in two healthcare organizations. The CFA (n=165) showed that a general usability factor accounted for 78.1%, 93.4%, 51.0%, and 39.9% of the explained variance in 'Quality of Work Life', 'Perceived Usefulness', 'Perceived Ease of Use', and 'User Control', respectively. The SEM (n=541) supported the predictive validity of Health-ITUES, explaining 64% of the variance in intention for system use. Conclusions The results of CFA and SEM provide additional evidence for the construct and predictive validity of Health-ITUES. The customizability of Health-ITUES has the potential to support comparisons at the construct level, while allowing variation at the item level. We also illustrate application of Health-ITUES across stages of system development.", "paper_title": "Examining construct and predictive validity of the Health-IT Usability Evaluation Scale: confirmatory factor analysis and structural equation modeling results", "paper_id": "WOS:000341858100010"}