{"auto_keywords": [{"score": 0.015719716506582538, "phrase": "user_inputs"}, {"score": 0.004892290216257905, "phrase": "similar_end-users"}, {"score": 0.004684157900507474, "phrase": "service_composition"}, {"score": 0.004372442291178139, "phrase": "re-occurring_activities"}, {"score": 0.0042928648367867835, "phrase": "on-line_shopping"}, {"score": 0.003997377843316597, "phrase": "repetitive_typing"}, {"score": 0.003916098498242888, "phrase": "user_experience"}, {"score": 0.0037747835341722636, "phrase": "re-occurring_information"}, {"score": 0.003334309053314909, "phrase": "similar_input_and_output_parameters"}, {"score": 0.0031845067058084583, "phrase": "input_parameters"}, {"score": 0.002985988377995789, "phrase": "proper_value"}, {"score": 0.002945081009084692, "phrase": "input_parameter"}, {"score": 0.0024389277933858054, "phrase": "empirical_study"}, {"score": 0.0023725232579531273, "phrase": "real_world_services"}, {"score": 0.0023400004981080818, "phrase": "empirical_results"}, {"score": 0.002276283303864666, "phrase": "end-user's_previous_inputs"}, {"score": 0.0021539955106204354, "phrase": "composed_services"}, {"score": 0.0021049977753042253, "phrase": "previous_inputs"}], "paper_keywords": ["Information reuse", " service composition", " input parameter pre-filling", " multi-user"], "paper_abstract": "End-users conduct various on-line activities. Quite often, they re-visit websites and use services to perform re-occurring activities, such as on-line shopping. The end-users are required to enter the same information into various web services to accomplish such re-occurring tasks. It can negatively impact user experience when a user needs to type the re-occurring information repetitively into such web services. In this paper, we propose an approach to prevent end-users from performing such repetitive tasks. Our approach propagates user inputs across services by linking similar input and output parameters. Our approach pre-fills values to the input parameters for an end-user using his or her previous inputs. To increase the chance of identifying a proper value for an input parameter performed by one end-user, our approach also leverages the inputs from other end-users. We identify and link similar end-users to enable the propagation of user inputs among end-users. We have designed and developed a prototype. We also conduct an empirical study to evaluate our approach using the real world services. The empirical results show that our approach using an end-user's previous inputs can reduce on average 41 percent of repetitive typing for the execution of composed services. Furthermore, the previous inputs from the similar end-users can improve our approach in reducing the repetitive typing for an end-user.", "paper_title": "Automatic Reuse of User Inputs to Services among End-Users in Service Composition", "paper_id": "WOS:000356267200002"}