{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "e-science"}, {"score": 0.004765889452740394, "phrase": "classroom_-_towards_viability"}, {"score": 0.004637478829869904, "phrase": "school_science"}, {"score": 0.004527947981009528, "phrase": "research_scientists"}, {"score": 0.0044512920090463105, "phrase": "authentic_scientific_enquiry"}, {"score": 0.004143196873246147, "phrase": "everyday_teaching"}, {"score": 0.0038695436922618876, "phrase": "e-science_experiences"}, {"score": 0.0038300786263543835, "phrase": "particular_educational_context"}, {"score": 0.0033635683594830158, "phrase": "previous_experiences"}, {"score": 0.0033406481167452436, "phrase": "educational_e-science_projects"}, {"score": 0.00325051332556486, "phrase": "'hidden_work"}, {"score": 0.003014948673771347, "phrase": "starting_point"}, {"score": 0.002953711377604328, "phrase": "future_educational_e-science_projects"}, {"score": 0.002777341265639153, "phrase": "technological_infrastructure"}, {"score": 0.0023810183846557486, "phrase": "larger_scale"}, {"score": 0.002148677187261496, "phrase": "appropriate_and_usable_form"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["cooperative/collaborative learning", " distributed learning environments", " improving classroom teaching", " learning communities", " teaching/learning strategies"], "paper_abstract": "E-Science has the potential to transform school science by enabling learners, teachers and research scientists to engage together in authentic scientific enquiry, collaboration and learning. However, if we are to reap the benefits of this potential as part of everyday teaching and learning, we need to explicitly think about and support the work required to set up and run e-Science experiences within any particular educational context. In this paper, we present a framework for identifying and describing the resources, tools and services necessary to move e-Science into the classroom together with examples of these. This framework is derived from previous experiences conducting educational e-Science projects and systematic analysis of the categories of 'hidden work' needed to run these projects. The articulation of resources, tools and services based on these categories provides a starting point for more methodical design and deployment of future educational e-Science projects, reflection on which can also help further develop the framework. It also points to the technological infrastructure from which such tools and services could be built. As such it provides an agenda of work to develop both processes and technologies that would make it practical for teachers to deliver active, and. collaborative e-Science learning experiences on a larger scale within and across schools. Routine school e-Science will only be possible if such support is specified, implemented and made available to teachers within their work contexts in an appropriate and usable form. (C) 2007 Elsevier Ltd. All rights reserved.", "paper_title": "E-Science in the classroom - Towards viability", "paper_id": "WOS:000253669600009"}