{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "precision_mechatronics"}, {"score": 0.004740009255053372, "phrase": "macro-scale_atomic_force_microscope"}, {"score": 0.004291617358806677, "phrase": "novel_electromagnetic_self-sensing_self-actuating_probe"}, {"score": 0.003946960862020283, "phrase": "intermittent_contact"}, {"score": 0.003885953492208468, "phrase": "afm"}, {"score": 0.0038249462699142733, "phrase": "imaging_volume"}, {"score": 0.0030378759123133644, "phrase": "lab_environment"}, {"score": 0.002750056663607514, "phrase": "mechatronics"}, {"score": 0.0026098127457309457, "phrase": "mit"}, {"score": 0.002412371116984224, "phrase": "afm_system"}, {"score": 0.002172266188075892, "phrase": "experimental_results"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Mechatronic", " Education", " Scanning probe microscopy", " Atomic force microscopy", " Self-sensing"], "paper_abstract": "A macro-scale atomic force microscope (macro-AFM) has been designed and used for teaching precision mechatronics. The macro-AFM uses a novel electromagnetic self-sensing self-actuating probe. It operates in frequency-modulation AFM (FM-AFM) mode with intermittent contact. The AFM has an imaging volume of 250 mm x 40 mm x 1 mm with a resolution of about 1 gm at 1 Hz measurement bandwidth. The macro-AFM is simple and relatively inexpensive to build. It is scaled to make motion visible to the eye and is robust for a lab environment, all of which make it an affordable and effective educational tool. The macro-AFM is used in Mechatronics (2.737), a graduate level course at MIT, where in a series of 11 laboratory exercises, the students assembled and programmed the AFM system. This article provides the design and theory used for making and controlling the macro-AFM, as well as experimental results. (C) 2015 Elsevier Ltd. All rights reserved.", "paper_title": "Macro-scale atomic force microscope: An experimental platform for teaching precision mechatronics", "paper_id": "WOS:000367772000026"}