{"auto_keywords": [{"score": 0.02865655367736599, "phrase": "asm"}, {"score": 0.00481495049065317, "phrase": "object-oriented_software_architectures"}, {"score": 0.004240116703465252, "phrase": "cross-architectural_components_communications"}, {"score": 0.003978866233891427, "phrase": "-architectural_components"}, {"score": 0.003755307753574745, "phrase": "object-oriented_development"}, {"score": 0.0036272258853286433, "phrase": "basic_architectural_components"}, {"score": 0.0035855066449812273, "phrase": "large-scale_software_systems"}, {"score": 0.0034233569308012982, "phrase": "architecture_stability_metrics"}, {"score": 0.002861160152640875, "phrase": "new_architectural_stability_metric"}, {"score": 0.0028119023819663472, "phrase": "inter-package_calls"}, {"score": 0.002623184850933423, "phrase": "prominent_mathematical_properties"}], "paper_keywords": [""], "paper_abstract": "Software architectural stability reflects the capability of software to evolve while preserving its architecture. Stability in this context means preserving cross-architectural components communications and structural relationships unchanged. It is recognised that cross-architectural components changes are costly and should be avoided. In object-oriented development, class packages form the basic architectural components of large-scale software systems. There has been a number of architecture stability metrics proposed in the literature. Those metrics mainly measure changes in cross-components structural relationships and not cross-components communication. In this study, the authors' present a new architectural stability metric that measure inter-package calls. The authors' theoretically validated ASM through a set of prominent mathematical properties. The authors' also empirically validated the metric using two open source projects: JHotDraw and abstract window toolkit. Measurements of the ASM were shown to be consistent with the lines of code changes across releases in the two projects.", "paper_title": "Measuring stability of object-oriented software architectures", "paper_id": "WOS:000355918800002"}