{"auto_keywords": [{"score": 0.0496463517482477, "phrase": "unorthodox_two-component_systems"}, {"score": 0.04395571076903231, "phrase": "histidine_kinase"}, {"score": 0.014629560623986121, "phrase": "e._coli"}, {"score": 0.014498638144019728, "phrase": "two-component_systems"}, {"score": 0.010867948581515253, "phrase": "orthodox_two-component_systems"}, {"score": 0.010248678673573708, "phrase": "external_stimuli"}, {"score": 0.00481495049065317, "phrase": "multi-step_phosphorelay_mechanism"}, {"score": 0.004377077848734575, "phrase": "histidine_kinase_proteins"}, {"score": 0.004337502738649814, "phrase": "response_regulator_proteins"}, {"score": 0.003960831041259951, "phrase": "cognate_response_regulators"}, {"score": 0.00385431710959668, "phrase": "orthodox_two-component_system"}, {"score": 0.0036332251283046997, "phrase": "unusual_two-component_systems"}, {"score": 0.00297454367746853, "phrase": "complex_multi-step_phosphorelay_mechanism"}, {"score": 0.0025137856138000014, "phrase": "simplified_mathematical_models"}, {"score": 0.0024797072773840704, "phrase": "orthodox_and_unorthodox_two-component_systems"}, {"score": 0.002401972657236926, "phrase": "extensive_computer_simulations"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["two-component systems", " unorthodox two-component systems", " phosphorelay", " ultrasensitivity", " robustness"], "paper_abstract": "E. coli has two-component systems composed of histidine kinase proteins and response regulator proteins. For a given extracellular stimulus, a histidine kinase senses the stimulus, autophosphorylates and then passes the phosphates to the cognate response regulators. The histidine kinase in an orthodox two-component system has only one histidine domain where the autophosphorylation occurs, but a histidine kinase in some unusual two-component systems (unorthodox two-component systems) has two histidine domains and one aspartate domain. So, the unorthodox two-component systems have more complex phosphorelay mechanisms than orthodox two-component systems. In general, the two-component systems are required to promptly respond to external stimuli for survival of E. coli. In this respect, the complex multi-step phosphorelay mechanism seems to be disadvantageous, but there are several unorthodox two-component systems in E. coli. In this paper, we investigate the reason why such unorthodox two-component systems are present in E. coli. For this purpose, we have developed simplified mathematical models of both orthodox and unorthodox two-component systems and analyzed their dynamical characteristics through extensive computer simulations. We have finally revealed that the unorthodox two-component systems realize ultrasensitive responses to external stimuli and also more robust responses to noises than the orthodox two-component systems. (c) 2006 Elsevier Ltd. All rights reserved.", "paper_title": "The multi-step phosphorelay mechanism of unorthodox two-component systems in E. coli realizes ultrasensitivity to stimuli while maintaining robustness to noises", "paper_id": "WOS:000243091500006"}