{"auto_keywords": [{"score": 0.03050005321114921, "phrase": "randomized_protocol"}, {"score": 0.015629201586672546, "phrase": "radio_networks"}, {"score": 0.009385805712531522, "phrase": "undirected_networks"}, {"score": 0.00867732847061562, "phrase": "deterministic_protocol"}, {"score": 0.00481495049065317, "phrase": "-many_communication"}, {"score": 0.0047313464483758364, "phrase": "wireless_data_communication"}, {"score": 0.004595204969378556, "phrase": "key_restriction"}, {"score": 0.0045418465969859064, "phrase": "mutual_interference"}, {"score": 0.004209739667710983, "phrase": "n_nodes"}, {"score": 0.0038005481380011677, "phrase": "ad-hoc_case"}, {"score": 0.00361634440637273, "phrase": "partially_centralized_case"}, {"score": 0.0033127168183223876, "phrase": "centralized_case"}, {"score": 0.0031063318586138787, "phrase": "deterministic_protocols"}, {"score": 0.003052304299267279, "phrase": "directed_networks"}, {"score": 0.002723253153997129, "phrase": "high_probability"}], "paper_keywords": ["Radio network", " Many-to-many communication", " Broadcast", " Gossiping", " Centralized protocol", " Distributed protocol", " Randomization"], "paper_abstract": "Radio networks model wireless data communication when the bandwidth is limited to one wave frequency. The key restriction of such networks is mutual interference of packets arriving simultaneously at a node. The many-to-many (m2m) communication primitive involves p participant nodes from among n nodes in the network, where the distance between any pair of participants is at most d. The task is to have all the participants get to know all the input messages. We consider three cases of the m2m communication problem. In the ad-hoc case, each participant knows only its name and the values of n, p and d. In the partially centralized case, each participant knows the topology of the network and the values of p and d, but does not know the names of the other participants. In the centralized case, each participant knows the topology of the network and the names of all the participants. For the centralized m2m problem, we give deterministic protocols, for both undirected and directed networks, working in O(d + p) time, which is provably optimal. For the partially centralized m2m problem, we give a randomized protocol for undirected networks working in O(( d + p + log(2) n) log p) time with high probability (whp), and we show that any deterministic protocol requires Omega(d + p logn/logp) time. For the ad-hoc m2m problem, we develop a randomized protocol for undirected networks that works in O((d + log p) log(2) n + p log p) time whp. We show two lower bounds for the ad-hoc m2m problem. One lower bound states that any randomized protocol for the m2m ad hoc problem requires Omega( p + d log n/d) expected time. Another lower bound states that for any deterministic protocol for the m2m ad hoc problem, there is a network on which the protocol requires Omega(n log n/log(n/d)) time when n - p( n) = Omega(n) and d > 1, and that it requires Omega(n) time when n - p( n) = o(n).", "paper_title": "Many-to-Many Communication in Radio Networks", "paper_id": "WOS:000265144400007"}