{"auto_keywords": [{"score": 0.039240547640409205, "phrase": "cost_factors"}, {"score": 0.02270667229096419, "phrase": "organizational_size"}, {"score": 0.009082110609913785, "phrase": "outsourcing_decision"}, {"score": 0.008136866813011248, "phrase": "oltp"}, {"score": 0.003941319912895672, "phrase": "firm's_strategy"}, {"score": 0.003772952730960177, "phrase": "different_supplier"}, {"score": 0.0037057255600764475, "phrase": "outsourcing_online_transaction_processing"}, {"score": 0.003658438093694035, "phrase": "decision_support_systems"}, {"score": 0.0035111212173850426, "phrase": "divergent_decision_factors"}, {"score": 0.0032009160232892046, "phrase": "enterprise_resource_planning_software"}, {"score": 0.0031037094461453395, "phrase": "firm's_competitive_strategies"}, {"score": 0.0030171910207671205, "phrase": "outsourcing_decision_process"}, {"score": 0.002971016979295967, "phrase": "relative_importance"}, {"score": 0.002955782731675529, "phrase": "decision_factors"}, {"score": 0.002814886483566627, "phrase": "outsourcing_object"}, {"score": 0.002793260314529581, "phrase": "strategic_importance"}, {"score": 0.0027575842698911173, "phrase": "closer_attention"}, {"score": 0.002743441412836047, "phrase": "internal_factors"}, {"score": 0.002708399936381754, "phrase": "outsourcing_strategies"}, {"score": 0.0026806884201358515, "phrase": "organizational_strategies"}, {"score": 0.0025792654256039187, "phrase": "low-costs_strategy"}, {"score": 0.0025202582748972122, "phrase": "niche_strategy"}, {"score": 0.0024311499929484063, "phrase": "dss"}, {"score": 0.0024000726315182826, "phrase": "significantly_higher_emphasis"}, {"score": 0.002387758958649797, "phrase": "supplier_factors"}, {"score": 0.0023511948097484662, "phrase": "company_size"}, {"score": 0.0023271295783184698, "phrase": "significant_differences"}, {"score": 0.0022390533383717715, "phrase": "different_sizes"}, {"score": 0.0021990971392741613, "phrase": "smaller_organizations"}, {"score": 0.0021878123182524564, "phrase": "larger_organizations"}, {"score": 0.00211585634148498, "phrase": "european_journal"}, {"score": 0.0021049977753042253, "phrase": "information_systems"}], "paper_keywords": ["Information Systems", " outsourcing", " management"], "paper_abstract": "As IT expenditures have been growing over the last few years, organizations have started to scrutinize them more closely and some are deciding to outsource parts of their Information Systems (IS) operations. Unfortunately, there is a lack of research on the impact that the object of an outsourcing decision may have on the factors considered when making such a decision. The impact of organizational size and the firm's strategy has also not been conclusively established in the literature. This paper examines and compares the different supplier, internal, technology and cost factors considered when outsourcing Online Transaction Processing (OLTP) or Decision Support Systems (DSSs) (the object of a decision). It also examines the divergent decision factors for large, medium and small organizations, and the competitive strategy's impact on the factors that are considered. The paper is based on a study with samples from four large SAP Conferences and includes 1889 individuals working in organizations that use enterprise resource planning software. This research found that the object being outsourced, the firm's competitive strategies, and the organizational size are factors that significantly influence the outsourcing decision process. We found that the relative importance of decision factors for the outsourcing of OLTP is significantly different from those for a DSS and that, where the outsourcing object is of strategic importance, there is a closer attention to internal factors. Our findings confirm that outsourcing strategies are aligned with organizational strategies. For example, cost factors dominate in the outsourcing decision among organizations that employ a low-costs strategy as compared to those following a differentiation or niche strategy. Also, compared to firms pursuing other competitive strategies, for the outsourcing of DSS, differentiators place a significantly higher emphasis on supplier factors. Regarding the role of company size, we found significant differences in the importance given to supplier, internal, technology, and cost factors by organizations of different sizes. For example, compared to smaller organizations, larger organizations gave less importance to supplier and technology factors and more importance to cost factors. European Journal of Information Systems (2009) 18, 235-248. doi: 10.1057/ejis.2009.18", "paper_title": "Factors considered when outsourcing an IS system: an empirical examination of the impacts of organizational size, strategy and the object of a decision", "paper_id": "WOS:000268640700005"}