{"auto_keywords": [{"score": 0.049643973872019624, "phrase": "landscape_changes"}, {"score": 0.010612387000973441, "phrase": "incentive_networks"}, {"score": 0.008228407801492981, "phrase": "land_use_practices"}, {"score": 0.004374772264092067, "phrase": "simple_model"}, {"score": 0.004256533389293113, "phrase": "different_multi-scale_incentive_networks"}, {"score": 0.0038849148160362257, "phrase": "specific_land_uses"}, {"score": 0.003325852346387272, "phrase": "respective_and_combined_influence"}, {"score": 0.00325069754015951, "phrase": "landscape_pattern"}, {"score": 0.0030771609361092164, "phrase": "agronomic_constraints"}, {"score": 0.003021392767766593, "phrase": "crop_successions"}, {"score": 0.00274472767672686, "phrase": "simulated_scenarios"}, {"score": 0.0026220103561723066, "phrase": "landscape_heterogeneity"}, {"score": 0.0024481198073210567, "phrase": "landscape_dynamics"}, {"score": 0.002360132221690264, "phrase": "landscape_complexity"}, {"score": 0.002163600705898299, "phrase": "resulting_landscape_patterns"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Neutral model", " Landscape pattern", " Landscape dynamics", " Simulation", " Emergence", " Socio-ecological system"], "paper_abstract": "The aim of this paper is to implement a simple model for exploring the influence of different multi-scale incentive networks affecting farmer decision on landscape changes. Three scales of networks are considered: a global 'policy' network promoting specific land uses, an intermediate 'social' network where land use practices are shared and promoted collectively and a local 'neighborhood' network where land use practices are influenced by those of their neighbors. We assess the respective and combined influence of these networks on landscape pattern (fragmentation and heterogeneity) and dynamics, taking into account agronomic constraints (assimilated to crop successions). Simulations show that combination of incentive networks does not have linear and/or cumulative influence on landscape changes. Comparison of simulated scenarios highlights that a combination of two networks tends to improve landscape heterogeneity and fragmentation; scenarios combining all networks could lead to two opposite landscape configuration illustrating emergence of landscape dynamics. Finally, this study emphasizes that landscape complexity has also to be understood through the multiplicity of pathways of landscape changes rather than the assessment of the resulting landscape patterns. (c) 2012 Elsevier Ltd. All rights reserved.", "paper_title": "Influence of incentive networks on landscape changes: A simple agent-based simulation approach", "paper_id": "WOS:000320685400006"}