{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "game-based_learning_environment"}, {"score": 0.03986436747617021, "phrase": "gble"}, {"score": 0.02846167170923076, "phrase": "support_control"}, {"score": 0.004365022891478405, "phrase": "learner's_motivation"}, {"score": 0.0039869632444468036, "phrase": "single_computer"}, {"score": 0.0037532257703888315, "phrase": "learning_process"}, {"score": 0.0033385105985286154, "phrase": "educational_control"}, {"score": 0.0031905286720361145, "phrase": "learning_opportunity"}, {"score": 0.0031190082119319272, "phrase": "knowledge_understanding_model"}, {"score": 0.0029807267909921628, "phrase": "design_philosophy"}, {"score": 0.0027532820796396713, "phrase": "game_viewpoint"}, {"score": 0.0026511422582578027, "phrase": "learning_environment"}, {"score": 0.002543148295176345, "phrase": "learning_experiment"}, {"score": 0.0024487847651989128, "phrase": "junior_high_school"}, {"score": 0.0021778895748464045, "phrase": "significant_role"}, {"score": 0.0021451873499061633, "phrase": "learning_relationship"}, {"score": 0.0021049977753042253, "phrase": "new_relationships"}], "paper_keywords": ["game-based learning environment", " interaction among learners", " learning support control", " motivation", " pedagogical agents", " junior high school"], "paper_abstract": "Many studies and systems that incorporate elements such as \"pleasure\" and \"fun\" in the game to improve a learner's motivation have been developed in the field of learning environments. However, few are the studies of situations where many learners gather at a single computer and participate in a game-based learning environment (GBLE), and where the GBLE designs the learning process by controlling the interactions between learners such as competition, collaboration, and learning by teaching. Therefore, the purpose of this study is to propose a framework of educational control that induces and activates interaction between learners intentionally to create a learning opportunity that is based on the knowledge understanding model of each learner. In this paper, we explain the design philosophy and the framework of our GBLE called \"Who becomes the king in the country of mathematics?\" from a game viewpoint and describe the method of learning support control in the learning environment. In addition, we report the results of the learning experiment with our GBLE, which we carried out in a junior high school, and include some comments by a principal and a teacher. Front the results of the experiment and some comments, we noticed that a game may play a significant role in weakening the learning relationship among students and creating new relationships in the world of the game. Furthermore, we discovered that. learning support control of the GBLE has led to activation of the interaction between learners to some extent.", "paper_title": "A Development of Game-Based Learning Environment to Activate Interaction among Learners", "paper_id": "WOS:000302834400002"}