{"auto_keywords": [{"score": 0.04107868567004354, "phrase": "regular_expressions"}, {"score": 0.012388150140522091, "phrase": "containment_proofs"}, {"score": 0.011313192298468142, "phrase": "membership_proof"}, {"score": 0.010089871576535634, "phrase": "computational_interpretation"}, {"score": 0.00481495049065317, "phrase": "new_sound_and_complete_axiomatization"}, {"score": 0.004654642380553263, "phrase": "conventional_axiomatization"}, {"score": 0.004561019117546361, "phrase": "empty_set"}, {"score": 0.004409127897028587, "phrase": "idempotent_semiring"}, {"score": 0.0039427304473829165, "phrase": "natural_computational_interpretation"}, {"score": 0.003837273003552065, "phrase": "parse_trees"}, {"score": 0.003671865026158296, "phrase": "curry-howard-style_constructive_interpretation"}, {"score": 0.00357362651129581, "phrase": "language-theoretic_containment"}, {"score": 0.003294350220187021, "phrase": "regular_expression"}, {"score": 0.0032170707904803125, "phrase": "regular_expression_equivalence_proofs"}, {"score": 0.002895986736522535, "phrase": "coinduction_rule"}, {"score": 0.002866663406866159, "phrase": "hereditarily_total_function"}, {"score": 0.0028472791870440065, "phrase": "hereditary_totality"}, {"score": 0.0027804579695873827, "phrase": "syntactic_side_conditions"}, {"score": 0.0026424892463535717, "phrase": "conventional_side_condition"}, {"score": 0.0023948164534491273, "phrase": "wide-spread_use"}, {"score": 0.0023545181737729065, "phrase": "substring_matching"}, {"score": 0.002330664671716791, "phrase": "classical_automata-theoretic_techniques"}, {"score": 0.002126546582044807, "phrase": "first_investigation"}, {"score": 0.0021049977753042253, "phrase": "general_proof-theoretic_framework"}], "paper_keywords": ["Languages", " Theory", " axiomatization", " coercion", " coinduction", " computational interpretation", " containment", " equivalence", " regular expression", " type"], "paper_abstract": "We present a new sound and complete axiomatization of regular expression containment. It consists of the conventional axiomatization of concatenation, alternation, empty set and (the singleton set containing) the empty string as an idempotent semiring, the fixed-point rule E* = 1 + E x E* for Kleene-star, and a general coinduction rule as the only additional rule. Our axiomatization gives rise to a natural computational interpretation of regular expressions as simple types that represent parse trees, and of containment proofs as coercions. This gives the axiomatization a Curry-Howard-style constructive interpretation: Containment proofs do not only certify a language-theoretic containment, but, under our computational interpretation, constructively transform a membership proof of a string in one regular expression into a membership proof of the same string in another regular expression. We show how to encode regular expression equivalence proofs in Salomaa's, Kozen's and Grabmayer's axiomatizations into our containment system, which equips their axiomatizations with a computational interpretation and implies completeness of our axiomatization. To ensure its soundness, we require that the computational interpretation of the coinduction rule be a hereditarily total function. Hereditary totality can be considered the mother of syntactic side conditions: it \"explains\" their soundness, yet cannot be used as a conventional side condition in its own right since it turns out to be undecidable. We discuss application of regular expressions as types to bit coding of strings and hint at other applications to the wide-spread use of regular expressions for substring matching, where classical automata-theoretic techniques are a priori inapplicable. Neither regular expressions as types nor subtyping interpreted coercively are novel per se. Somewhat surprisingly, this seems to be the first investigation of a general proof-theoretic framework for the latter in the context of the former, however.", "paper_title": "Regular Expression Containment: Coinductive Axiomatization and Computational Interpretation", "paper_id": "WOS:000286472700032"}