{"auto_keywords": [{"score": 0.015719716506582538, "phrase": "conceptual_model"}, {"score": 0.004240116703465252, "phrase": "respectively_agents"}, {"score": 0.0039119492240482, "phrase": "earlier_work"}, {"score": 0.003878932475424688, "phrase": "kochen"}, {"score": 0.0038461570027231986, "phrase": "leydesdorff"}, {"score": 0.003813669883040509, "phrase": "borgman"}, {"score": 0.003670843919846253, "phrase": "interdimensional_relation"}, {"score": 0.0027741761880779535, "phrase": "special_attention"}, {"score": 0.0026815368507715, "phrase": "citation_relation"}, {"score": 0.002391067964886602, "phrase": "conceptual_paper"}, {"score": 0.002360796860462937, "phrase": "first_step"}, {"score": 0.0023408288327263316, "phrase": "multi-relational_networks"}, {"score": 0.0023013968622710847, "phrase": "key_instrument"}, {"score": 0.0021049977753042253, "phrase": "informetric_studies"}], "paper_keywords": ["Informetrics", " Bibliometrics", " Citations", " Entity-relationship model", " Conceptual models", " Information", " Information retrieval"], "paper_abstract": "Purpose - The aim of this paper is to propose a conceptual model of the field of informetrics. Specifically, the paper argues that informetrics comprises the study of entities in three dimensions: the social, documentary and epistemic dimensions containing respectively agents, documents, and concepts or cognitions. Design/methodology/approach - The paper outlines a conceptual model, drawing on earlier work by Kochen, Leydesdorff, Borgman and others. Subsequently, each dimension and interdimensional relation is analyzed and discussed. Findings - It is shown that not every study necessarily involves each of the three dimensions, but that the field as a whole cannot be reduced to one or two of them. Moreover, the dimensions should be kept separate but they are not completely independent. The paper discusses what kinds of relations exist between the dimensions. Special attention is given to the nature of the citation relation within this framework. The paper also considers the place of concepts like mapping, proximity and influence in the model. Research limitations/implications - This conceptual paper is a first step. Multi-relational networks may be a key instrument to further the study of the interplay between the three dimensions. Originality/value - The paper provides a framework to characterise informetric studies and makes the characteristics of the field explicit.", "paper_title": "The three dimensions of informetrics: a conceptual view", "paper_id": "WOS:000317150200007"}