{"auto_keywords": [{"score": 0.05007852962010534, "phrase": "repair_shops"}, {"score": 0.032854255577662896, "phrase": "central_repair_shop"}, {"score": 0.01423221445801892, "phrase": "local_repair_shops"}, {"score": 0.012396151131098869, "phrase": "working_item"}, {"score": 0.004768378525561471, "phrase": "stochastic_environment"}, {"score": 0.004631335513513859, "phrase": "repair_shop_location_problem"}, {"score": 0.004542158659382197, "phrase": "new_repair_shops"}, {"score": 0.004134658048970194, "phrase": "nearest_open_repair_shop"}, {"score": 0.003938383970047866, "phrase": "working_items"}, {"score": 0.0034704317267505035, "phrase": "broken_items"}, {"score": 0.0032842023803256216, "phrase": "broken_item"}, {"score": 0.003210446135114967, "phrase": "local_repair_shop"}, {"score": 0.0027651847105654363, "phrase": "base_stock_levels"}, {"score": 0.002720661389788773, "phrase": "total_expected_cost"}, {"score": 0.0026167007609466724, "phrase": "local_shops"}, {"score": 0.002566215899764421, "phrase": "specified_level"}, {"score": 0.0024521640882380477, "phrase": "repair_capacity"}, {"score": 0.0021886732310288128, "phrase": "local_search_heuristic"}, {"score": 0.002160419006055386, "phrase": "experimental_results"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["stochastic facility location", " repairable items"], "paper_abstract": "In this paper, we consider a repair shop location problem with uncertainties in demand. New repair shops have to be opened at a number of locations. At these local repair shops, customers arrive with broken, but repairable, items. Customers go to the nearest open repair shop. Since they want to leave as soon as possible, an inventory of working items is kept at the repair shops. A customer immediately receives a working item from stock, provided that the stock is not empty. If a stockout occurs, the customer has to wait for a working item. The broken items are repaired in the shop and then put in stock. Sometimes, however, a broken item cannot be fixed at the local repair shop, and it has to be sent to a central repair shop. At the central repair shop the same policy with inventory and repair is used. The problem we focus on, is finding locations for the local repair shops, deciding their capacity, i.e., number of servers and base stock levels, such that the total expected cost is minimized and the fraction of customers that can leave the local shops without waiting is above some specified level. We assume that the central repair shop is already opened, but that the repair capacity still has to be set. The costs we consider are the costs for keeping the repair shops operational, for the transport of items and for the inventory. For this problem, a local search heuristic is proposed and experimental results are presented. (c) 2004 Elsevier Ltd. All rights reserved.", "paper_title": "Locating repair shops in a stochastic environment", "paper_id": "WOS:000234338400005"}