{"auto_keywords": [{"score": 0.04347900416933489, "phrase": "home_network"}, {"score": 0.043069853910456694, "phrase": "vehicular_network_environment"}, {"score": 0.03954948965131843, "phrase": "user_device"}, {"score": 0.004278807087784626, "phrase": "heterogeneous_networks"}, {"score": 0.0040334640350288, "phrase": "ubiquitous_video"}, {"score": 0.003935420482629049, "phrase": "streaming_session"}, {"score": 0.003820896867623235, "phrase": "attached_network"}, {"score": 0.0036373553416391823, "phrase": "ubiquitous_video_streaming_service"}, {"score": 0.003584025547693836, "phrase": "ubiquitous_multimedia_cyberspace"}, {"score": 0.0030464123943266673, "phrase": "users'_authentication"}, {"score": 0.0027334673433027086, "phrase": "xml_technique"}, {"score": 0.0026933542552712033, "phrase": "improved_sip_protocol"}, {"score": 0.0026148807877309417, "phrase": "aforementioned_information"}, {"score": 0.002346160830406661, "phrase": "scalable_video_coding"}, {"score": 0.0023117182131967523, "phrase": "hybrid_qop-decision_rule"}, {"score": 0.0022443390559699974, "phrase": "proper_spatiotemporal_resolution"}, {"score": 0.0022223176391038785, "phrase": "snr_quality"}], "paper_keywords": ["MPEG-21", " SIP", " Session mobility", " Scalable video coding"], "paper_abstract": "In this paper, we develop an MPEG-21 SIP-based session mobility management (M21-SIP) for ubiquitous video streaming over heterogeneous networks, which are over the home network and vehicular network environment in our study. Ubiquitous video streaming means that the streaming session keeps continuity even when the attached network and/or the user device is changed. To realize the ubiquitous video streaming service in a ubiquitous multimedia cyberspace, an MPEG-4 scalable video coder that can support a combined quality-of-presentation (QoP) and adapt to complicated networking situations is firstly proposed. Additionally, in the proposed M21-SIP session mobility management, the corresponding information about users' authentication, the speed of vehicles, the capability of user device, etc., can be described using the MPEG-21 like XML technique. The improved SIP protocol is able to bring the aforementioned information and play a role of session signaling, e.g., session initiation and handoff control. Furthermore, with advances of scalable video coding, a hybrid QoP-decision rule is designed to determine a proper spatiotemporal resolution and SNR quality. In our experiments, we will exhibit the performance of our proposed M21-SIP session mobility management scheme and video quality adaptation scheme over the home network and vehicular network environment.", "paper_title": "An MPEG-21 SIP-Based Session Mobility Management for Ubiquitous Video Streaming over the Home Network and Vehicular Network Environment", "paper_id": "WOS:000280568400009"}