{"auto_keywords": [{"score": 0.03431336294915633, "phrase": "final_solution_step"}, {"score": 0.01006586385092368, "phrase": "students'_perceptions"}, {"score": 0.007915758923887899, "phrase": "problem-solving_steps"}, {"score": 0.007756015901761191, "phrase": "higher_motivation"}, {"score": 0.00481495049065317, "phrase": "linear_algebra"}, {"score": 0.004736820055728928, "phrase": "transfer_performance"}, {"score": 0.0043114466990006334, "phrase": "different_levels"}, {"score": 0.004241451614311598, "phrase": "mathematical_problems"}, {"score": 0.004021689117050817, "phrase": "problem-solving_procedure"}, {"score": 0.0038446194432899183, "phrase": "final_solution"}, {"score": 0.003797690272118125, "phrase": "immediate_feedback"}, {"score": 0.0034847851398628546, "phrase": "better_learning"}, {"score": 0.003414153126809511, "phrase": "final_problem-solving_step"}, {"score": 0.0029824560656987855, "phrase": "solutions_steps"}, {"score": 0.002303720729387236, "phrase": "current_efforts"}, {"score": 0.002275557501858879, "phrase": "step-wise_feedback"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Media in education", " Pedagogical issues", " Teaching/learning strategies"], "paper_abstract": "Two studies investigated the effects on students' perceptions (Study 1) and learning and motivation (Study 2) of different levels of feedback in mathematical problems. In these problems, an error made in one step of the problem-solving procedure will carry over to the following steps and consequently to the final solution. Providing immediate feedback after an error is made could prevent such carry-over effects. Feedback given on all problem-solving steps was hypothesized to yield higher motivation and better learning than feedback on the final problem-solving step. Study 1 investigated students' perceptions of three feedback types: 'on the final solution step': 'on all the solution steps at once'; and 'on all the solution steps successively'. Feedback on all solutions steps was perceived by learners more positively than feedback on the final solution step. Study 2 investigated the learning and motivational effects of two types of feedback, namely, 'feedback on the final solution step' and 'feedback on all the solution steps'. The hypotheses that feedback on all problem-solving steps would lead to more effective learning and higher motivation than feedback on the final solution step were confirmed. Our results support current efforts to implement step-wise feedback. The implications for further research and for the design of feedback are discussed. (C) 2010 Elsevier Ltd. All rights reserved.", "paper_title": "Computer-based feedback in linear algebra: Effects on transfer performance and motivation", "paper_id": "WOS:000279137800023"}