{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "technology_reuse"}, {"score": 0.013436348857154773, "phrase": "reusable_technologies"}, {"score": 0.008870131878711645, "phrase": "reusable_functionalities"}, {"score": 0.004394910907549057, "phrase": "market_drivers"}, {"score": 0.004188702178897384, "phrase": "functional_viewpoint"}, {"score": 0.003878625406105021, "phrase": "abstract_intention"}, {"score": 0.0037322713756404295, "phrase": "technological_standpoint"}, {"score": 0.0036788184374592706, "phrase": "reusable_function"}, {"score": 0.0036261282565554507, "phrase": "core_function"}, {"score": 0.0035060903664150115, "phrase": "functional_model"}, {"score": 0.0033737457695128233, "phrase": "affecting_action"}, {"score": 0.003169222811082848, "phrase": "knowledge_base"}, {"score": 0.0028784478769295204, "phrase": "function-based_search"}, {"score": 0.0028235667474151714, "phrase": "technology_domains"}, {"score": 0.0023515464194592195, "phrase": "ontological_functional_modeling_methodology"}, {"score": 0.002198242191529977, "phrase": "wordnet-based_representation"}, {"score": 0.002166711569953301, "phrase": "ontological_functional_models"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Functional models", " Ontological functional modeling", " Technology reuse"], "paper_abstract": "Technology reuse is important in that it dramatically reduces lead-time, efforts and costs in R&D activities coping with market drivers. In this perspective, understanding technologies from a functional viewpoint helps us search reusable technologies from various technology domains and reuse them. Function is the concept to abstract intention and ways of a technology from a technological standpoint, and reusable function as the core function is representative of the technology. Functional model which formalizes function is represented as an affecting action and one or more affected objects. If technologies and their reusable functional models are stored together in a knowledge base, it is possible to develop a foundation of the environment that allows us to find out reusable technologies by function-based search without regard to technology domains. In this environment, therefore, identifying reusable functionalities from a technology and representing their meanings clearly are the basis to stimulate technology reuse. As a part of constructing the environment for technology reuse, this paper suggests an ontological functional modeling methodology of technology which is composed of a procedure for extracting reusable functionalities and a WordNet-based representation to define ontological functional models. (C) 2011 Elsevier Ltd. All rights reserved.", "paper_title": "Ontological functional modeling of technology for reusability", "paper_id": "WOS:000290237500162"}