{"auto_keywords": [{"score": 0.03875087963810533, "phrase": "telederm"}, {"score": 0.015622339345770467, "phrase": "rural_and_remote_areas"}, {"score": 0.00481495049065317, "phrase": "dermatological_services"}, {"score": 0.004666043394407466, "phrase": "web-based_decision_support_system"}, {"score": 0.0045789085863942825, "phrase": "medical_services"}, {"score": 0.004550225097519697, "phrase": "rural_and_remote_general_practitioners"}, {"score": 0.0044512342099350555, "phrase": "qualitative_results"}, {"score": 0.004259638825837131, "phrase": "goldfields"}, {"score": 0.004232946822003551, "phrase": "western_australia"}, {"score": 0.004063462779895253, "phrase": "medical_practitioners"}, {"score": 0.003937704225837731, "phrase": "decision_support_systems"}, {"score": 0.0038641177943540502, "phrase": "dermatological_problems"}, {"score": 0.00366297866938793, "phrase": "clinical_situations"}, {"score": 0.003549570370358334, "phrase": "system's_characteristics"}, {"score": 0.0029482236540308952, "phrase": "user_interface"}, {"score": 0.0022560232669644954, "phrase": "query_process"}, {"score": 0.0021998931213841567, "phrase": "support_tool"}, {"score": 0.0021519235536763526, "phrase": "crown_copyright"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Teledermatology", " Decision support", " Case-based reasoning", " Adoption of decision support systems"], "paper_abstract": "Objective: This paper describes the Web-based decision support system (TELEDERM) that provides medical services to rural and remote general practitioners (GPs), and presents qualitative results on the usefulness and usability of the system obtained from trials in the GoldFields, Western Australia. Methods: Diagnostic methods and other functions were developed to assist medical practitioners, who may not be familiar with aspects of decision support systems, to diagnose patients with dermatological problems. GPs in rural and remote areas took part in a trial to assess the usefulness of TELEDERM in clinical situations. In evaluating and assessing a number of the system's characteristics, questionnaires, seminars and interviews were used. Results and conclusions: Feedback concerning the usefulness of TELEDERM shows that 67% of the GPs found the system useful or very useful, and 25% found the system somewhat useful. In terms of its usability, 83% found the system easy to use. The responses concerning the user interface and interactivity of TELEDERM are encouraging as 92% of the GPs found the text easy to read, 84% were happy with the appearance of the interface, and 84% found the system easy to navigate. 89% indicated that they are likely to use the system again. An issue with such systems is the reluctance of GPs to use them, even given that the development was quite sensitive to the needs of the GPs and the consultants, e.g. by streamlining the query process and emphasising that the system is a support tool. and not a replacement. Crown Copyright (C) 2008 Published by Elsevier B.V. All rights reserved.", "paper_title": "Evaluation of TELEDERM for dermatological services in rural and remote areas", "paper_id": "WOS:000260167400003"}