{"auto_keywords": [{"score": 0.027822167136755793, "phrase": "literacy_types"}, {"score": 0.006995138914795968, "phrase": "digital_technologies"}, {"score": 0.006895994577200818, "phrase": "relevant_documents"}, {"score": 0.0059568791934045545, "phrase": "literacy_framework"}, {"score": 0.00481495049065317, "phrase": "purpose_-_digital_technologies"}, {"score": 0.0044346739635814135, "phrase": "established_literacies"}, {"score": 0.004403054828362479, "phrase": "computer_literacy"}, {"score": 0.004371660146981191, "phrase": "information_literacy"}, {"score": 0.004340488340181084, "phrase": "digital_literacy"}, {"score": 0.0043095378396174125, "phrase": "media_literacy"}, {"score": 0.004278807087784626, "phrase": "internet_literacy"}, {"score": 0.004233119608341877, "phrase": "newer_conceptions"}, {"score": 0.004143196873246147, "phrase": "multimodal_literacy"}, {"score": 0.0035648266669315943, "phrase": "current_literacy_landscape"}, {"score": 0.003390597717101915, "phrase": "lisa"}, {"score": 0.003342280102112269, "phrase": "education_resources_information_center"}, {"score": 0.003306559295382181, "phrase": "eric"}, {"score": 0.003259522768246318, "phrase": "british_education_index"}, {"score": 0.0030124946762144717, "phrase": "selective_backward_and_forward_citation"}, {"score": 0.0026008598632891837, "phrase": "i.e._a_taxonomy"}, {"score": 0.0021049977753042253, "phrase": "literacy_landscape"}], "paper_keywords": ["Information literacy", " Literacy", " Taxonomy", " Media literacy", " Digital literacies", " New literacies"], "paper_abstract": "Purpose - Digital technologies have transformed what it means to be literate and to experience literacy. Various literacies have been coined to capture this transformation including established literacies like computer literacy, information literacy, digital literacy, media literacy and internet literacy, to newer conceptions like transliteracy, metaliteracy and multimodal literacy. The purpose of this paper is to assimilate the various conceptions of literacy and literacy types is becoming increasingly more complex. There is a need for a taxonomy of literacies that reflects more recent developments, one that more comprehensively captures the current literacy landscape and one that might have affordances in the future. Design/methodology/approach - \"Library and Information Science Abstracts\" (LISA), \"Education Resources Information Center\" (ERIC) and \"British Education Index\" were searched for documents relating to digital technologies and literacy. Relevant documents were retrieved and reviewed. This was followed by selective backward and forward citation searching and a further review of relevant documents. Findings - Based on a review of the literature, two significant dimensions of literacy were identified. These dimensions were used to create a literacy framework to enable the classification of literacies and literacy types, i.e. a taxonomy of literacies. This taxonomy was successfully applied to various prominent literacies and literacy types. Research limitations/implications - The literacy framework was only applied to those literacies and literacy types that are directly or indirectly related to digital technologies. Originality/value - There have been a few attempts to classify some literacy types. When conceived, these classifications comprehensively captured some aspect of the literacy landscape. However, they are now dated and there is a need for a taxonomy of literacies that meets the needs identified above. This paper proposes a taxonomy that meets these criteria.", "paper_title": "Taxonomy of literacies", "paper_id": "WOS:000355922100004"}