{"auto_keywords": [{"score": 0.04954477125105647, "phrase": "multichannel_recordings"}, {"score": 0.04548812433856781, "phrase": "eeg"}, {"score": 0.00481495049065317, "phrase": "eeg_generators"}, {"score": 0.004027031316965272, "phrase": "different_patterns"}, {"score": 0.0035216195857272403, "phrase": "eeg_synchrony"}, {"score": 0.0033301694494391612, "phrase": "different_cortical_regions"}, {"score": 0.0032383707002544755, "phrase": "new_way"}, {"score": 0.002815864555488112, "phrase": "different_inter-group"}, {"score": 0.0025037596405075866, "phrase": "topographic_organization"}, {"score": 0.0023021895404322767, "phrase": "averaging_activity"}, {"score": 0.002276566401216226, "phrase": "increasingly_larger_areas"}, {"score": 0.002104999656224525, "phrase": "ecog"}], "paper_keywords": ["EEG", " ECoG", " Generator populations", " Synchrony", " Generators", " Dynamics"], "paper_abstract": "The voltage recorded over the cortex (ECoG) or over the scalp (EEG) is generated by currents derived from many sources called \"generators\". Different patterns and amplitudes are observed in aroused, sleepy, epileptic or other brain states. Differences in amplitude are generally attributed to differences in synchrony among generators. The degree of EEG synchrony is measured by the correlation between electrodes placed over different cortical regions. We present a new way to quantitatively assess the degree of synchronization of these generators via multichannel recordings. We illustrate how situations where there are several groups of generators with different inter-group and intra-group synchronies can be analyzed. Finally, we present a way to identify the organization of groups exhibiting topographic organization. Although the model presented here is highly simplified, several methods are based on averaging activity over increasingly larger areas. These types of measurements may be applied as well to EEG and ECoG recordings.", "paper_title": "Resolving the dynamics of EEG generators by multichannel recordings", "paper_id": "WOS:000252160000005"}