{"auto_keywords": [{"score": 0.011860864005270649, "phrase": "third_approach"}, {"score": 0.009515819788214934, "phrase": "operational_goals"}, {"score": 0.008064131280946477, "phrase": "filtering_systems"}, {"score": 0.00481495049065317, "phrase": "information_filtering"}, {"score": 0.004599549048984302, "phrase": "theinformation_structure"}, {"score": 0.004468476226790802, "phrase": "main_goal"}, {"score": 0.004351595642056769, "phrase": "different_if_systems"}, {"score": 0.004289130754253059, "phrase": "expected_payoff"}, {"score": 0.004116953672355147, "phrase": "relevance_thresholds"}, {"score": 0.00409715552037496, "phrase": "individual_if_systems"}, {"score": 0.003932654396285872, "phrase": "first_approach"}, {"score": 0.003811313001733041, "phrase": "second_approach"}, {"score": 0.0034944094552943, "phrase": "combined_system"}, {"score": 0.003402920151251144, "phrase": "empirical_evaluation"}, {"score": 0.0032899238557332878, "phrase": "somewhat_different_filtering_algorithms"}, {"score": 0.003274091463556502, "phrase": "tfidf"}, {"score": 0.0029657227799935065, "phrase": "user_profiles"}, {"score": 0.0028810741581197234, "phrase": "global_optimisation"}, {"score": 0.00270584313215159, "phrase": "real_life_systems"}, {"score": 0.002686320771113138, "phrase": "similar_algorithms"}, {"score": 0.002522904952394443, "phrase": "main_practical_implications"}, {"score": 0.002480628451267955, "phrase": "empirical_proof"}, {"score": 0.0024449543719772117, "phrase": "filtering_results"}, {"score": 0.0024097920845706795, "phrase": "optimal_combination_methods"}, {"score": 0.0023924005753533303, "phrase": "different_user_profiles"}, {"score": 0.0021049977753042253, "phrase": "important_conclusions"}], "paper_keywords": ["Information control", " Information modelling", " Information retrieval"], "paper_abstract": "Purpose - The purpose of this paper is to present an extension to a framework based on theinformation structure (IS) model for combining information filtering (IF) results. The main goal of the framework is to combine the results of the different IF systems so as to maximise the expected payoff (EP) to the user. In this paper we compare three different approaches to tuning the relevance thresholds of individual IF systems that are being combined in order to maximise the EP to the user. In the first approach we set the same threshold for each of the IF systems. In the second approach the threshold of each IF system is tuned independently to maximise its own EP (\"local optimisation\"). In the third approach the thresholds of the IF systems are jointly tuned to maximise the EP of the combined system (\"global optimisation\"). Design/methodology/approach - An empirical evaluation is conducted to examine the performance of each approach using two IF systems based on somewhat different filtering algorithms (TFIDF, OKAPI). Experiments are run using the TREC3, TREC6, and TREC7 test collections. Findings - The experiments reveal that, as expected, the third approach always outperforms the first and the second, and that for some user profiles, the difference is significant. However, operational goals argue against global optimisation, and the costs of meeting these operational goals are discussed. Research limitations/implications - One limitation is the assumption of independence of the IF systems: in real life systems usually use similar algorithms, so dependency might occur. The approach also tends to be examined with the assumption of dependency between systems. Practical implications - The main practical implications of this study lie in the empirical proof that combination of filtering systems improves filtering results and the finding about the optimal combination methods for the different user profiles. Many filtering applications exist (e.g. spam filters, news personalisation systems, etc.) that can benefit from these findings. Originality/value - The study presents and compares the contribution of three different combination methods of filtering systems to the improvement of filtering results It empirically shows the benefits of each method and draws important conclusions about the combination of filtering systems.", "paper_title": "A decision theoretic approach to combining information filtering", "paper_id": "WOS:000271922200005"}