{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "wireless_multi-hop_path"}, {"score": 0.022670516577220228, "phrase": "maximum_end-to-end_throughput"}, {"score": 0.021297984145657756, "phrase": "conflict_graph"}, {"score": 0.004300453431933622, "phrase": "multi-hop_path"}, {"score": 0.004021267064832957, "phrase": "associated_links"}, {"score": 0.0038953958723049287, "phrase": "linear_programming_formulations"}, {"score": 0.003681238363808568, "phrase": "simple_scenario"}, {"score": 0.003150900886669123, "phrase": "nearby_nodes"}, {"score": 0.002988101395789399, "phrase": "maximum_end-to-end_throughputs"}, {"score": 0.0028437313714204087, "phrase": "maximum_achievable_end-to-end_throughput"}, {"score": 0.0027063176464371115, "phrase": "maximal_set"}, {"score": 0.002687235334499192, "phrase": "mutually_adjacent_vertices"}, {"score": 0.002658863179011018, "phrase": "associated_conflict_graph"}, {"score": 0.002603012037901889, "phrase": "optimum_scheduling_algorithm"}, {"score": 0.002259426425685765, "phrase": "optimum_scheduling_algorithms"}, {"score": 0.002196342933346204, "phrase": "computationally_efficient_algorithms"}, {"score": 0.0021654633404434623, "phrase": "maximum_throughput"}, {"score": 0.0021049977753042253, "phrase": "scheduling_algorithm"}], "paper_keywords": ["capacity", " wireless path", " conflict graph", " chromatic number"], "paper_abstract": "In this paper, the maximum end-to-end throughput that can be achieved on a wireless multi-hop path is investigated analytically. The problem is modeled using the conflict graph, where each link in the multi-hop path is represented uniquely by a vertex in the conflict graph and two vertices are adjacent if and only if the associated links mutually interfere. Using the conflict graph and the linear programming formulations of the problem, we analyzed the maximum end-to-end throughput of a wireless multi-hop path a) in a simple scenario where nodes are optimally placed and each node can only interfere with the transmission of its adjacent nodes along the path, and b) in a more complicated scenario where nodes are randomly placed and each node can interfere with the transmission of any number of nearby nodes along the path in both a) an error free radio environment and b) an erroneous radio environment. The maximum end-to-end throughputs for each of the above four scenarios are obtained analytically. We show that the maximum achievable end-to-end throughput is determined by the throughput of its bottleneck clique, where a clique is a maximal set of mutually adjacent vertices in the associated conflict graph. Further our analysis suggests the optimum scheduling algorithm that can be used to achieve the maximum end-to-end throughput and that it is convenient to use the (maximal) independent sets as the basic blocks for the design of scheduling algorithms. The findings in this paper lay guidelines for the design of optimum scheduling algorithms. They can be used to design computationally efficient algorithms to determine the maximum throughput of a wireless multi-hop path and to design a scheduling algorithm to achieve that throughput.", "paper_title": "The Maximum Throughput of A Wireless Multi-Hop Path", "paper_id": "WOS:000286615400005"}