{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "process_variation"}, {"score": 0.004763565662615503, "phrase": "nanometer_technology"}, {"score": 0.004662427600500598, "phrase": "important_issue"}, {"score": 0.0045879792359519375, "phrase": "-edge_fpgas"}, {"score": 0.004514714250357749, "phrase": "multimillion_gate_capacity"}, {"score": 0.004210458358142504, "phrase": "gate_oxide_thickness"}, {"score": 0.00409895142748329, "phrase": "closed-form_models"}, {"score": 0.004055176557424983, "phrase": "chip-level_fpga_leakage"}, {"score": 0.0038638811223100184, "phrase": "mean_and_standard_deviation"}, {"score": 0.0036422425344358037, "phrase": "monte_carlo_simulation"}, {"score": 0.0032016639006812826, "phrase": "analytical_yield_models"}, {"score": 0.002937879003671346, "phrase": "fpga_device"}, {"score": 0.002875391177926809, "phrase": "process_variations"}, {"score": 0.0023189818169615135, "phrase": "maximum_leakage_and_timing_combined_yield"}, {"score": 0.002127765807039172, "phrase": "fpga_architecture"}, {"score": 0.0021049977753042253, "phrase": "device_coevaluation"}], "paper_keywords": ["Design", " Timing", " leakage", " yield estimation", " FPGA architecture"], "paper_abstract": "Process variation in nanometer technology is becoming an important issue for cutting-edge FPGAs with a multimillion gate capacity. Considering both die-to-die and within-die variations in effective channel length, threshold voltage, and gate oxide thickness, we first develop closed-form models of chip-level FPGA leakage and timing variations. Experiments show that the mean and standard deviation computed by our models are within 3% from those computed by Monte Carlo simulation. We also observe that the leakage and timing variations can be up to 3X and 1.9X, respectively. We then derive analytical yield models considering both leakage and timing variations, and use such models to evaluate the performance of FPGA device and architecture considering process variations. Compared to the baseline, which uses the VPR architecture and device setup based on the ITRS roadmap, device and architecture tuning improves leakage yield by 10.4%, timing yield by 5.7%, and leakage and timing combined yield by 9.4%. We also observe that LUT size of 4 gives the highest leakage yield, LUT size of 7 gives the highest timing yield, but LUT size of 5 achieves the maximum leakage and timing combined yield. To the best of our knowledge, this is the first in-depth study on FPGA architecture and device coevaluation considering process variation.", "paper_title": "Statistical Timing and Power Optimization of Architecture and Device for FPGAs", "paper_id": "WOS:000305864100003"}