{"auto_keywords": [{"score": 0.04624170386107772, "phrase": "sentiment_analysis"}, {"score": 0.010612387000973441, "phrase": "online_news_text"}, {"score": 0.010385449131060941, "phrase": "appraisal_theory"}, {"score": 0.0078097429373684525, "phrase": "news_text"}, {"score": 0.007397731169459769, "phrase": "political_news_articles"}, {"score": 0.004677372885331908, "phrase": "purpose_-_sentiment_analysis"}, {"score": 0.004576763709613412, "phrase": "increasing_interest"}, {"score": 0.0045108906244892165, "phrase": "computer_and_information_scientists"}, {"score": 0.004462105963334103, "phrase": "automated_methods"}, {"score": 0.004397875849247165, "phrase": "online_text"}, {"score": 0.004241299366498948, "phrase": "sentiment_polarity"}, {"score": 0.004002242925856335, "phrase": "positive_or_negative_sentiment"}, {"score": 0.0037357362372975327, "phrase": "particular_linguistic_framework"}, {"score": 0.003314206196422255, "phrase": "iraq"}, {"score": 0.0032783186166708985, "phrase": "economic_policies"}, {"score": 0.0032546105164772995, "phrase": "george_w._bush"}, {"score": 0.0032310733124059536, "phrase": "mahmoud_ahmadinejad"}, {"score": 0.0025611773887867255, "phrase": "appraisal_phrases"}, {"score": 0.002542642270762272, "phrase": "attitude_categories"}, {"score": 0.002416589459425828, "phrase": "tense_and_timeframe"}, {"score": 0.0023051296931856265, "phrase": "different_types"}, {"score": 0.002135812692862058, "phrase": "future_directions"}, {"score": 0.0021049977753042253, "phrase": "automated_sentiment_analysis"}], "paper_keywords": ["Sentiment analysis", " Appraisal theory", " Content analysis", " Political news", " Linguistics"], "paper_abstract": "Purpose - Sentiment analysis and emotion processing are attracting increasing interest in many fields. Computer and information scientists are developing automated methods for sentiment analysis of online text. Most of the studies have focused on identifying sentiment polarity or orientation whether a document, usually a product or movie review, carries a positive or negative sentiment. It is time for researchers to address more sophisticated kinds of sentiment analysis. This paper aims to evaluate a particular linguistic framework called appraisal theory for adoption in manual as well as automatic sentiment analysis of news text. Design/methodology/approach - The appraisal theory is applied to the analysis of a sample of political news articles reporting on Iraq and the economic policies of George W. Bush and Mahmoud Ahmadinejad to assess its utility and to identify challenges in adopting this framework. Findings - The framework was useful in uncovering various aspects of sentiment that should be useful for researchers, such as the appraisers and object of appraisal, bias of the appraisers and the author, type of attitude and manner of expressing the sentiment. Problems encountered include difficulty in identifying appraisal phrases and attitude categories because of the subtlety of expression in political news articles, lack of treatment of tense and timeframe, lack of a typology of emotions, and need to identify different types of behaviours (political, verbal and material actions) that reflect sentiment. Originality/value - The study has identified future directions for research in automated sentiment analysis as well as sentiment analysis of online news text. It has also demonstrated how sentiment analysis of news text can be carried out.", "paper_title": "Sentiment analysis of online news text: a case study of appraisal theory", "paper_id": "WOS:000313387600006"}