{"auto_keywords": [{"score": 0.04966229511350132, "phrase": "mobile_ad_hoc_networks"}, {"score": 0.00481495049065317, "phrase": "source_routing"}, {"score": 0.004260134699483774, "phrase": "routing_protocol"}, {"score": 0.004007083686875716, "phrase": "ad_hoc_networks"}, {"score": 0.003769006950727621, "phrase": "informal_means"}, {"score": 0.0035761913760242697, "phrase": "ad_hoc_routing_protocols"}, {"score": 0.0033197446406648626, "phrase": "mathematical_framework"}, {"score": 0.0030281251520610604, "phrase": "rigorous_manner"}, {"score": 0.002949598537993663, "phrase": "on-demand_source_routing_protocols"}, {"score": 0.0027140798043053986, "phrase": "simulation_paradigm"}, {"score": 0.0025750928944698673, "phrase": "key_establishment_protocols"}, {"score": 0.0023694065215394593, "phrase": "ad_hoc_routing"}, {"score": 0.002287783663138828, "phrase": "new_on-demand_source_routing_protocol"}], "paper_keywords": ["mobile ad hoc networks", " secure routing", " provable security"], "paper_abstract": "Routing is one of the most basic networking functions in mobile ad hoc networks. Hence, an adversary can easily paralyze the operation of the network by attacking the routing protocol. This has been realized by many researchers and several \"secure\" routing protocols have been proposed for ad hoc networks. However, the security of those protocols has mainly been analyzed by informal means only. In this paper, we argue that flaws in ad hoc routing protocols can be very subtle, and we advocate a more systematic way of analysis. We propose a mathematical framework in which security can be precisely defined and routing protocols for mobile ad hoc networks can be proved to be secure in a rigorous manner. Our framework is tailored for on-demand source routing protocols, but the general principles are applicable to other types of protocols too. Our approach is based on the simulation paradigm, which has already been used extensively for the analysis of key establishment protocols, but, to the best of our knowledge, it has not been applied in the context of ad hoc routing so far. We also propose a new on-demand source routing protocol, called endairA, and we demonstrate the use of our framework by proving that it is secure in our model.", "paper_title": "Provably secure on-demand source routing in mobile ad hoc networks", "paper_id": "WOS:000240544700005"}