{"auto_keywords": [{"score": 0.046833098914935326, "phrase": "online_reviews"}, {"score": 0.04425618028201676, "phrase": "presentation_format"}, {"score": 0.01515648374410006, "phrase": "product_type"}, {"score": 0.014559863694812799, "phrase": "consumer_perceptions"}, {"score": 0.00481495049065317, "phrase": "next_generation"}, {"score": 0.004779564521350969, "phrase": "e-commerce_product_reviews"}, {"score": 0.004169692306713217, "phrase": "video_reviews"}, {"score": 0.003916098498242888, "phrase": "prior_research"}, {"score": 0.003830312347175889, "phrase": "video_presentation"}, {"score": 0.003774164192882704, "phrase": "product_information"}, {"score": 0.003705130724701598, "phrase": "video_presentation_formats"}, {"score": 0.003378385493203297, "phrase": "presentation_formats"}, {"score": 0.0032558762499901727, "phrase": "appropriate_use"}, {"score": 0.0031146967095233586, "phrase": "theoretical_foundations"}, {"score": 0.003080365929916083, "phrase": "elaboration_likelihood_model"}, {"score": 0.0030576885787607796, "phrase": "cognitive_fit_theory"}, {"score": 0.0030017207229983385, "phrase": "laboratory_experiment"}, {"score": 0.0026472970609754095, "phrase": "substantive_and_nuanced_impact"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Online reviews", " Presentation format", " Product type", " Cognitive fit", " Elaboration likelihood model", " Laboratory experiments"], "paper_abstract": "Researchers have systematically investigated the influence of online reviews on consumer perceptions and decisions to purchase products, but hitherto have not attended to the presentation format. Increasingly, video reviews are making their way into various websites, and their impact on consumer perceptions is not yet known. While prior research has investigated the impact of video presentation of vendor supplied product information, the effects of video presentation formats of online reviews posted by consumers, in relation to other commonly used formats such as text, are not known. The conditions of effectiveness of these presentation formats should also to be investigated so that guidelines for appropriate use can be developed. Hence, in this study, using theoretical foundations anchored on elaboration likelihood model and cognitive fit theory, we conducted a laboratory experiment comparing the impact of online reviews displayed in three presentation formats text, image, and video on three products a digital camera, backpack, and videogame. We find that the presentation format of online reviews has a substantive and nuanced impact on consumer perceptions. Product type significantly moderates the effect of presentation format on consumer perceptions. Highlighting the role of presentation format and product type, our findings indicate that more research on presentation format is warranted, and vendors should make efforts to manage the presentation of online reviews. We discuss these findings, and theoretical and practical implications of the study. (C) 2015 Elsevier B.V. All rights reserved.", "paper_title": "Will video be the next generation of e-commerce product reviews? Presentation format and the role of product type", "paper_id": "WOS:000353599200008"}