{"auto_keywords": [{"score": 0.04763743657605743, "phrase": "pneumatic_caisson"}, {"score": 0.009221785316767178, "phrase": "whole_system"}, {"score": 0.00839662046153416, "phrase": "surface_reconstruction"}, {"score": 0.004522080178250592, "phrase": "excavator_operators"}, {"score": 0.003946960862020283, "phrase": "surface_data"}, {"score": 0.0038651944848734133, "phrase": "successive_data"}, {"score": 0.0033910515423928684, "phrase": "hough"}, {"score": 0.0030378759123133644, "phrase": "triangular_meshing"}, {"score": 0.0029905104479072482, "phrase": "new_method"}, {"score": 0.002823050755743821, "phrase": "real-time_pose"}, {"score": 0.0026233771102489394, "phrase": "\"virtual_reality\"_operating_environment"}, {"score": 0.0024250482323322606, "phrase": "underground_project"}, {"score": 0.002387214876538434, "phrase": "shanghai_subway"}, {"score": 0.002127186380459509, "phrase": "estimated_resolution"}], "paper_keywords": [""], "paper_abstract": "In order to build a 3D model environment of a pneumatic caisson for excavator operators and managers, a modeling and measuring 3D surface system of unmanned pneumatic caisson was presented in this paper. The whole system is based on two 3D laser scanners for the pneumatic caisson by acquiring the surface data of pneumatic caisson and successive data processing for surface reconstruction and measurement. Registration and reconstruction are also discussed in this paper. In order to convert two point sets into one common coordinate, Hough transforms were used to extract planes and then by using their parameters to register the two point sets. As for surface reconstruction using triangular meshing, a new method based on curves was presented. When combined with the real-time pose and location of the excavators, the 3D environment can be used as a \"virtual reality\" operating environment for excavation operators. The whole system has been applied in a pneumatic caisson of an underground project in a Shanghai subway, which proved to be working well, with less than 16-s work cycle (period of a single 180 degrees 3D laser scan), at an estimated resolution of less than 20 mm.", "paper_title": "3D Surface Modeling and Measuring System for Pneumatic Caisson", "paper_id": "WOS:000276691400001"}