{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "game-based_learning_environments"}, {"score": 0.008137841023427551, "phrase": "student_engagement"}, {"score": 0.004600596158672458, "phrase": "student_learning"}, {"score": 0.004282787299993434, "phrase": "affective_states"}, {"score": 0.004039094712469991, "phrase": "positive_correlations"}, {"score": 0.003935267970727093, "phrase": "negative_states"}, {"score": 0.0034099718632933027, "phrase": "learning_gains"}, {"score": 0.0033658327434624457, "phrase": "computer-based_learning_environments"}, {"score": 0.0032157824854214313, "phrase": "design_goal"}, {"score": 0.0024297565926197505, "phrase": "in-depth_analysis"}, {"score": 0.0023062508214156123, "phrase": "game-based_learning_environment"}, {"score": 0.0022763657774198184, "phrase": "crystal_island."}, {"score": 0.0021049977753042253, "phrase": "positive_affect"}], "paper_keywords": ["Games and infotainment", " human factors"], "paper_abstract": "The link between affect and student learning has been the subject of increasing attention in recent years. Affective states such as flow and curiosity tend to have positive correlations with learning while negative states such as boredom and frustration have the opposite effect. Student engagement and motivation have also been shown to be critical in improving learning gains with computer-based learning environments. Consequently, it is a design goal of many computer-based learning environments to encourage positive affect and engagement while students are learning. Game-based learning environments offer significant potential for increasing student engagement and motivation. However, it is unclear how affect and engagement interact with learning in game-based learning environments. This work presents an in-depth analysis of how these phenomena occur in the game-based learning environment, CRYSTAL ISLAND. The findings demonstrate that game-based learning environments can simultaneously support learning and promote positive affect and engagement.", "paper_title": "Affect and Engagement in Game-Based Learning Environments", "paper_id": "WOS:000336798700005"}