{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "post-silicon_validation"}, {"score": 0.03490113591144107, "phrase": "new_transaction"}, {"score": 0.03356611196852558, "phrase": "special_messages"}, {"score": 0.004267896572751978, "phrase": "main_idea"}, {"score": 0.004063186599879217, "phrase": "local_partial_orders"}, {"score": 0.004009074013302036, "phrase": "noc_tile"}, {"score": 0.003902992784453769, "phrase": "\"happened-before\"_rules"}, {"score": 0.0035216195857272403, "phrase": "global_time"}, {"score": 0.0031350397225314262, "phrase": "neighboring_tiles"}, {"score": 0.002716844480081738, "phrase": "local_orders"}, {"score": 0.00269263690712392, "phrase": "different_tiles"}, {"score": 0.002506562885555113, "phrase": "communication_delays"}, {"score": 0.002322898169066219, "phrase": "nocs"}, {"score": 0.0023021895404322767, "phrase": "mesh_and_torus_topologies"}, {"score": 0.0021526564019119466, "phrase": "proposed_method"}], "paper_keywords": ["post-silicon validation", " transaction ordering", " network-on-a-chip (NoC)", " system-on-a-chip (SoC)"], "paper_abstract": "In this paper, we have addressed the problem of ordering transactions in network-on-chips (NoCs) for post-silicon validation. The main idea is to extract the order of the transactions from the local partial orders in each NoC tile based on a set of \"happened-before\" rules, assuming transactions do not have a timestamp. The assumption is based on the fact that implementation and usage of a global time as timestamp in such systems may not be practical or efficient. When a new transaction is received in a tile, we send special messages to the neighboring tiles to inform them regarding the new transaction. The process of sending those special messages continues recursively in all the tiles that receive them until another such special message is detected. This way, we relate local orders of different tiles with each other. We show that our method can reconstruct the correct transaction orders when communication delays are deterministic. We have shown the effectiveness of our method by correctly ordering the transaction in NoCs with mesh and torus topologies with different sizes from 5*5 to 9*9. Also, we have implemented the proposed method in hardware to show its feasibility.", "paper_title": "Transaction Ordering in Network-on-Chips for Post-Silicon Validation", "paper_id": "WOS:000313146100027"}