{"auto_keywords": [{"score": 0.03380323385649741, "phrase": "mcv_method"}, {"score": 0.00481495049065317, "phrase": "common_vector_method"}, {"score": 0.004687815426832587, "phrase": "pattern_recognition"}, {"score": 0.004399102320426124, "phrase": "data_sets"}, {"score": 0.004268591456106124, "phrase": "word_recognition"}, {"score": 0.003952316497572257, "phrase": "corresponding_class"}, {"score": 0.003598629227969919, "phrase": "covariance_matrix"}, {"score": 0.0034223147241452547, "phrase": "cv_method"}, {"score": 0.003265531406540679, "phrase": "novel_approach"}, {"score": 0.003168543855125077, "phrase": "nonlinearly_mapped_higher_dimensional_feature_space"}, {"score": 0.003043679504527297, "phrase": "higher_dimensional_feature_space"}, {"score": 0.003013237619840709, "phrase": "kernel_mapping_function"}, {"score": 0.0029041917003677234, "phrase": "mapped_space"}, {"score": 0.002799080959445996, "phrase": "unique_cv"}, {"score": 0.0026887369417065957, "phrase": "training_set_data"}, {"score": 0.002591403838835242, "phrase": "generalization_performance"}, {"score": 0.0025654738267173274, "phrase": "proposed_kernel_method"}, {"score": 0.002522830979240594, "phrase": "generalization_performances"}, {"score": 0.0024478477463201302, "phrase": "kernel-based_nonlinear_subspace_method"}, {"score": 0.002367137788925062, "phrase": "support_vector_machine"}, {"score": 0.0022967713922705, "phrase": "reported_experiments"}, {"score": 0.0022061853706148945, "phrase": "multiclass_svm_classifier"}], "paper_keywords": ["common vector (CV)", " kernel-based subspace method", " pattern recognition", " subspace classifier"], "paper_abstract": "The common vector (CV) method is d linear subspace classifier method which allows one to discriminate between classes of data sets, such as those arising in image and word recognition. This method utilizes subspaces that represent classes during classification. Each subspace is modeled such that common features (if all samples in the corresponding class are extracted. To accomplish this goal, the method eliminates features that are in the direction of the eigenvectors corresponding to the,nonzero eigenvalues; of the covariance matrix of each class. In this paper, we introduce a variation of the CV method, which will be referred to as the modified CV (MCV) method. Then, a novel approach is proposed to apply the MCV method in a nonlinearly mapped higher dimensional feature space. In this approach, all samples are mapped into a higher dimensional feature space using a kernel mapping function, and then, the MCV method is applied in the mapped space. Under certain conditions, each class gives rise to a unique CV, and the method guarantees a 100% recognition rate with respect to the training set data. Moreover, experiments with several test cases also show that the generalization performance of the proposed kernel method is comparable to the generalization performances of other linear subspace classifier methods as well as the kernel-based nonlinear subspace method. While both the MCV method and its kernel counterpart did not outperform the support vector machine (SVM) classifier in most of the reported experiments, the application of our proposed methods is simpler than that of the multiclass SVM classifier. In addition, it is not necessary to adjust any parameters in our approach.", "paper_title": "Kernel common vector method: A Novel nonlinear subspace classifier for pattern recognition", "paper_id": "WOS:000247833000015"}