{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "uk"}, {"score": 0.004792143536555493, "phrase": "scholarly_e-book_usage"}, {"score": 0.004548253531664032, "phrase": "uk_national_e-books_observatory_study"}, {"score": 0.004420472010542188, "phrase": "e-book_usage"}, {"score": 0.0035189057079817285, "phrase": "jisc_collection_texts"}, {"score": 0.00332375606483146, "phrase": "print_material"}, {"score": 0.0031393948330209224, "phrase": "online_survey"}, {"score": 0.0028409576481842457, "phrase": "e-book_penetration"}, {"score": 0.002522344964242888, "phrase": "e-book_revolution"}, {"score": 0.0022715929119140194, "phrase": "biggest_survey"}, {"score": 0.0021763278640166707, "phrase": "huge_advance"}, {"score": 0.0021557052355026048, "phrase": "one's_knowledge"}, {"score": 0.0021352776064254195, "phrase": "e-book_use"}, {"score": 0.0021049977753042253, "phrase": "national_scale"}], "paper_keywords": ["electronic books", " user studies", " libraries", " students"], "paper_abstract": "Purpose - This JISC funded UK National E-Books Observatory study is a benchmarking survey of e-book usage and perceptions in more than 120 participating universities. The paper aims to present the results that investigated: use of e-books in general (methods of obtaining e-books, reasons for using, viewing/reading behaviour in connection with e-books); use of e-books provided by the library; use of JISC collection texts (use and awareness); use of the library and print material in general. Design/methodology/approach - The study is based on an online survey which was conducted between 18 January and I March 2008, over which period 22,437 full or partial responses were received. Findings - The study shows that e-book penetration is very strong (61.8 per cent of all students are already using them in connection with their scholarly work, as teachers or students), so the e-book revolution has already happened but clearly it has some way to go. Originality/value - The paper presents the results of the biggest survey of its kind ever conducted, which represents a huge advance in one's knowledge of e-book use on a national scale.", "paper_title": "UK scholarly e-book usage: a landmark survey", "paper_id": "WOS:000259203400003"}