{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "dynamical_model"}, {"score": 0.0496341948154792, "phrase": "educational_effectiveness"}, {"score": 0.004510336430422002, "phrase": "pure_and_right_function"}, {"score": 0.004344965512058521, "phrase": "theoretical_contribution"}, {"score": 0.0037242701420971062, "phrase": "main_idea"}, {"score": 0.0033447157263095223, "phrase": "separate_theories"}, {"score": 0.003206916619690171, "phrase": "key_characteristics"}, {"score": 0.003162252895465901, "phrase": "learning_game"}, {"score": 0.0030747771905143273, "phrase": "educational_environment_design"}, {"score": 0.003017981332994963, "phrase": "arcs"}, {"score": 0.002598333022293788, "phrase": "sigmoidal_equation"}, {"score": 0.0025382662403716947, "phrase": "gamification"}, {"score": 0.0022475295254231714, "phrase": "traditional_ways"}, {"score": 0.0022058510091498666, "phrase": "specific_setting"}, {"score": 0.0021649437083408425, "phrase": "elapsed_adaptive_time_period"}], "paper_keywords": ["Game", " Gamification", " Game based learning", " GBL", " Learning game"], "paper_abstract": "The purpose of this paper is to hypothesize 'Dynamical model of educational effectiveness for the gamification of learning, and to widely announce a pure and right function of game through our model. For the theoretical contribution of gamification, we propose a dynamical model of game based learning that aims to maximize educational effectiveness that correlates with the four main primary factors (curiosity, challenge, fantasy and control). The main idea of this model is based on the correlations of four factors which originating from learning games which are built on the foundations of separate theories: 1) Game Design Features 2) Key Characteristics of a Learning Game 3) a theory of educational environment design known as the ARCS (attention, relevance, confidence, and satisfaction) and 4) the theoretical background of gamification labeled the MDA(mechanics, dynamics and aesthetics) framework. We created a sigmoidal equation for the educational effectiveness of Gamification by analyzing and correlating these factors. Through this dynamical model we will show that the effectiveness of the gamification of learning is educationally superior to traditional ways of learning in specific setting, after an elapsed adaptive time period with reasonable relationship of the four primary factors.", "paper_title": "Dynamical model for gamification of learning (DMGL)", "paper_id": "WOS:000360564600015"}