{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "non-competent_classifiers"}, {"score": 0.004760017604908536, "phrase": "one-vs-one_strategy"}, {"score": 0.004616560363089716, "phrase": "multi-class_classification_problems"}, {"score": 0.004529093447865156, "phrase": "multi-class_problems"}, {"score": 0.004460309246062286, "phrase": "easier-to-solve_binary_classification_problems"}, {"score": 0.004342430078306461, "phrase": "original_problem"}, {"score": 0.004227653047394939, "phrase": "independent_base_classifiers"}, {"score": 0.004068907083697369, "phrase": "so-called_non-competence"}, {"score": 0.003347105144425849, "phrase": "erroneous_classifications"}, {"score": 0.0032336801561165113, "phrase": "classifiers'_decisions"}, {"score": 0.003160200215473349, "phrase": "aggregation_phase"}, {"score": 0.0030530895634491343, "phrase": "dynamic_classifier_selection_strategy"}, {"score": 0.0025694584194998335, "phrase": "proposed_method"}, {"score": 0.0025014259919355474, "phrase": "thorough_experimental_study"}, {"score": 0.002482320290902079, "phrase": "different_base_classifiers"}, {"score": 0.0021956951486095805, "phrase": "empirical_analysis"}, {"score": 0.0021539955106204337, "phrase": "appropriate_statistical_analysis"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Multi-classification", " Pairwise learning", " One-vs-One", " Decomposition strategies", " Ensembles", " Classifier selection"], "paper_abstract": "The One-vs-One strategy is one of the most commonly used decomposition technique to overcome multi-class classification problems; this way, multi-class problems are divided into easier-to-solve binary classification problems considering pairs of classes from the original problem, which are then learned by independent base classifiers. The way of performing the division produces the so-called non-competence. This problem occurs whenever an instance is classified, since it is submitted to all the base classifiers although the outputs of some of them are not meaningful (they were not trained using the instances from the class of the instance to be classified). This issue may lead to erroneous classifications, because in spite of their incompetence, all classifiers' decisions are usually considered in the aggregation phase. In this paper, we propose a dynamic classifier selection strategy for One-vs-One scheme that tries to avoid the non-competent classifiers when their output is probably not of interest. We consider the neighborhood of each instance to decide whether a classifier may be competent or not. In order to verify the validity of the proposed method, we will carry out a thorough experimental study considering different base classifiers and comparing our proposal with the best performer state-of-the-art aggregation within each base classifier from the five Machine Learning paradigms selected. The findings drawn from the empirical analysis are supported by the appropriate statistical analysis. (C) 2013 Elsevier Ltd. All rights reserved.", "paper_title": "Dynamic classifier selection for One-vs-One strategy: Avoiding non-competent classifiers", "paper_id": "WOS:000323804100021"}