{"auto_keywords": [{"score": 0.047144925784151935, "phrase": "cell_differentiation"}, {"score": 0.009359468431776713, "phrase": "gene_regulatory_network"}, {"score": 0.00481495049065317, "phrase": "gene_regulatory_network_structure"}, {"score": 0.0046164478775379105, "phrase": "transcription_factors"}, {"score": 0.003720060615588018, "phrase": "previously_developed_purely_theoretical_algorithm"}, {"score": 0.0035477930970463432, "phrase": "state_change"}, {"score": 0.0035106041824568618, "phrase": "boolean_gene_regulatory_networks"}, {"score": 0.003278167066287366, "phrase": "theoretical_framework"}, {"score": 0.00291923164591297, "phrase": "specific_features"}, {"score": 0.0028734230458881903, "phrase": "genetic_regulatory_network"}, {"score": 0.002828331235643921, "phrase": "proposed_algorithm"}, {"score": 0.002783945062714816, "phrase": "better_classification"}, {"score": 0.0027547408718334603, "phrase": "simple_network_measures"}, {"score": 0.002697245874076643, "phrase": "nodes_degree"}, {"score": 0.002640947693258573, "phrase": "boolean_networks"}, {"score": 0.002492098272172066, "phrase": "direct_application"}], "paper_keywords": [""], "paper_abstract": "Motivation: Many secondary messengers, receptors and transcription factors are related to cell differentiation. Their role in cell differentiation can be affected by their position in the gene regulatory network. Here, we test whether the properties of the gene regulatory network can highlight which genes and proteins are associated with cell differentiation. We use a previously developed purely theoretical algorithm built to detect nodes that can induce a state change in Boolean gene regulatory networks, and show that most genes predicted to participate in differentiation in the theoretical framework are also experimentally known to be associated with such differentiation. These results show that genes related to differentiation are associated with specific features of the genetic regulatory network. The proposed algorithm produces a better classification than simple network measures such as the nodes degree or centrality. Boolean networks were used in many previous theoretical models. Here, we show a direct application of such networks to the detection of genes and subnetworks related to differentiation. The subnetwork emerging from the genes and edges that are predicted to be associated with differentiation are the most active molecular pathways experimentally described to be involved in cell differentiation.", "paper_title": "Genes related to differentiation are correlated with the gene regulatory network structure", "paper_id": "WOS:000331271100015"}