{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "novel_framework"}, {"score": 0.004767118498560508, "phrase": "negative_impacts"}, {"score": 0.004743380135084562, "phrase": "green_techniques"}, {"score": 0.0047197594186799054, "phrase": "bgp._green_networking_techniques"}, {"score": 0.004661218550675473, "phrase": "least_utilized_links"}, {"score": 0.004614906658519602, "phrase": "off-peaks_hours"}, {"score": 0.004569052789469628, "phrase": "prior_work"}, {"score": 0.004423136987341482, "phrase": "hot-potato_routing_changes"}, {"score": 0.004260556600750507, "phrase": "bgp"}, {"score": 0.004228744236967248, "phrase": "critically"}, {"score": 0.004176252534490617, "phrase": "packet_loss_due_to_slow_bgp_convergence"}, {"score": 0.003962843010801056, "phrase": "ingress_routers"}, {"score": 0.0037791348730306074, "phrase": "egress_routers"}, {"score": 0.0036325950879377913, "phrase": "ir"}, {"score": 0.0034282068751733947, "phrase": "unused_links"}, {"score": 0.003335235224891481, "phrase": "energy_consumption_rate"}, {"score": 0.003220533467925735, "phrase": "key_issues"}, {"score": 0.0029433222698945455, "phrase": "similar_performance"}, {"score": 0.0029067508382150807, "phrase": "employed_method"}, {"score": 0.002683188341295792, "phrase": "path_selection_metrics"}, {"score": 0.0025779232815774807, "phrase": "minimum_number"}, {"score": 0.0025016867452082505, "phrase": "largest_number"}, {"score": 0.00237959104058464, "phrase": "five_topologies"}, {"score": 0.0023558947758923394, "phrase": "shortest_paths"}, {"score": 0.002274796550579261, "phrase": "global_optimal_solution"}, {"score": 0.002224138971975344, "phrase": "robin_manner"}, {"score": 0.0021475664838460137, "phrase": "shortest_path"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Ingress-router", " Bilevel program", " Green IGP-WO", " Hot-potato routing", " BGP-aware", " Energy savings"], "paper_abstract": "Green networking techniques usually shut down the least utilized links and/or routers during off-peaks hours. In a prior work, we showed conclusively that these actions trigger what is known as hot-potato routing changes. These changes are well known to negatively impact the operation of the Border Gateway Protocol (BGP). Critically, they may cause packet loss due to slow BGP convergence and increased congestion. In order to overcome such negative impacts, in this paper, we propose a novel framework that allows Ingress Routers (IRs) to work collaboratively to determine the set of links that should be carrying their respective traffic to Egress Routers (ERs). IRs exchange information about their established paths with each other, and each IR determines whether to shift their existing paths to ERs to optimize a given objective, e.g., energy savings. The IRs repeat the process until convergence. Unused links are then shut down, and thereby, lowering the energy consumption rate of a network. In this framework, we study a number of key issues: first, we study the order in which IRs establish paths, namely (i) most savings, (ii) round robin, and (iii) random order. Our results show that similar performance is achieved regardless of employed method. However, in some cases, IRs that establish paths using round robin took up to 23% more time to converge than IRs that used the most savings method. Second, we study path selection metrics. In particular, IRs select paths according to (i) shortest path, where paths with the minimum number of hops are selected, (ii) longest path, where paths with the largest number of hops are preferred, and (iii) random, where paths are randomly selected. Our experimental results over five topologies show that using shortest paths is the most efficient where IRs use as little as 25% more active links than a global optimal solution. However, IRs establishing paths in a robin manner are able to utilize 5% fewer number of links than when they employ the shortest path to each ER. (C) 2014 Elsevier Ltd. All rights reserved.", "paper_title": "A novel framework to mitigate the negative impacts of green techniques on BGP", "paper_id": "WOS:000348337000003"}