{"auto_keywords": [{"score": 0.028108375850436025, "phrase": "side-chain_reconstruction"}, {"score": 0.00481495049065317, "phrase": "single-point_mutation"}, {"score": 0.004771115666493521, "phrase": "rotamer_library_toolkit"}, {"score": 0.004727678014364335, "phrase": "protein_engineering"}, {"score": 0.004698938469311569, "phrase": "protein_engineers"}, {"score": 0.0045301165808920045, "phrase": "natural_source"}, {"score": 0.004172021058058737, "phrase": "extreme_labor_demands"}, {"score": 0.004146645277287799, "phrase": "exponential_number"}, {"score": 0.004121423202649493, "phrase": "mutation_combinations"}, {"score": 0.004083876271505206, "phrase": "computational_advances"}, {"score": 0.004009801352242071, "phrase": "first_step"}, {"score": 0.0039250703697261595, "phrase": "correct_conformations"}, {"score": 0.0038187460155038383, "phrase": "side_chains"}, {"score": 0.0036702119930393903, "phrase": "molecular_mechanics"}, {"score": 0.0036478772206217282, "phrase": "statistical_data"}, {"score": 0.0035490348652222107, "phrase": "automated_computational_tools"}, {"score": 0.003516684084316783, "phrase": "protein_structural_information"}, {"score": 0.003484627161645746, "phrase": "conformational_libraries"}, {"score": 0.0033185114695278226, "phrase": "necessary_tool"}, {"score": 0.003199125688913676, "phrase": "side-chain_conformation_prediction"}, {"score": 0.003160289566495475, "phrase": "overall_average_root-mean-square_deviations"}, {"score": 0.0029279904732574438, "phrase": "commonly_used_dihedral_angle_differences"}, {"score": 0.0027127202051739608, "phrase": "family-specific_library"}, {"score": 0.002623072765271526, "phrase": "residue-specific_library"}, {"score": 0.0024600517975561127, "phrase": "benchmarked_data"}, {"score": 0.0023426638248794643, "phrase": "pose_prediction_accuracy"}, {"score": 0.0023142106657222604, "phrase": "rmsd"}, {"score": 0.0021505234515372504, "phrase": "general_and_biased_conformation_libraries"}, {"score": 0.0021049977753042253, "phrase": "docking_accuracy"}], "paper_keywords": [""], "paper_abstract": "Protein engineers have long been hard at work to harness biocatalysts as a natural source of regio-, stereo-, and chemoselectivity in order to carry out chemistry (reactions and/or substrates) not previously achieved with these enzymes. The extreme labor demands and exponential number of mutation combinations have induced computational advances in this domain. The first step in our virtual approach is to predict the correct conformations upon mutation of residues (i.e., rebuilding side chains). For this purpose, we opted for a combination of molecular mechanics and statistical data. In this work, we have developed automated computational tools to extract protein structural information and created conformational libraries for each amino acid dependent on a variable number of parameters (e.g., resolution, flexibility, secondary structure). We have also developed the necessary tool to apply the mutation and optimize the conformation accordingly. For side-chain conformation prediction, we obtained overall average root-mean-square deviations (RMSDs) of 0.91 and 1.01 angstrom for the 18 flexible natural amino acids within two distinct sets of over 3000 and 1500 side-chain residues, respectively. The commonly used dihedral angle differences were also evaluated and performed worse than the state of the art. These two metrics are also compared. Furthermore, we generated a family-specific library for kinases that produced an average 2% lower RMSD upon side-chain reconstruction and a residue-specific library that yielded a 17% improvement. Ultimately, since our protein engineering outlook involves using our docking software, FITTED/IMPACTS, we applied our mutation protocol to a benchmarked data set for self- and cross-docking. Our side-chain reconstruction does not hinder our docking software, demonstrating differences in pose prediction accuracy of approximately 2% (RMSD cutoff metric) for a set of over 200 protein/ligand structures. Similarly, when docking to a set of over 100 kinases, side-chain reconstruction (using both general and biased conformation libraries) had minimal detriment to the docking accuracy.", "paper_title": "Single-Point Mutation with a Rotamer Library Toolkit: Toward Protein Engineering", "paper_id": "WOS:000367560200017"}