{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "action_descriptions"}, {"score": 0.004737579882204798, "phrase": "semantic_preferences"}, {"score": 0.004512814529823301, "phrase": "action_domain_descriptions"}, {"score": 0.004345363360869553, "phrase": "transition_diagrams"}, {"score": 0.004050625770007516, "phrase": "possible_states"}, {"score": 0.0035005841368145525, "phrase": "possible_transitions"}, {"score": 0.0034442607586033657, "phrase": "preference_information"}, {"score": 0.0032278559855285975, "phrase": "action_description"}, {"score": 0.002992456421856031, "phrase": "elaboration_tolerant_action_descriptions"}, {"score": 0.0028348690177346448, "phrase": "semantic_approach"}, {"score": 0.002246292543825748, "phrase": "computational_issues"}, {"score": 0.0021510820434023207, "phrase": "computational_complexity"}, {"score": 0.0021049977753042253, "phrase": "semantic_measures"}], "paper_keywords": ["action domain descriptions", " semantic preferences", " transition diagrams"], "paper_abstract": "The focus of this paper is on action domain descriptions whose meaning can be represented by transition diagrams. We introduce several semantic measures to compare such action descriptions, based on preferences over possible states of the world and preferences over some given conditions (observations, assertions, etc.) about the domain, as well as the probabilities of possible transitions. This preference information is used to assemble a weight which is assigned to an action description. As applications of this approach, we study updating action descriptions and identifying elaboration tolerant action descriptions, with respect to some given conditions. With a semantic approach based on preferences, not only, for some problems, we get more plausible solutions, but also, for some problems without any solutions due to too strong conditions, we can identify which conditions to relax to obtain a solution. We further study computational issues, and give a characterization of the computational complexity of computing the semantic measures.", "paper_title": "Comparing action descriptions based on semantic preferences", "paper_id": "WOS:000248940100004"}