{"auto_keywords": [{"score": 0.03371615560306311, "phrase": "separation_property"}, {"score": 0.01051323465207616, "phrase": "omega_s-regular_languages"}, {"score": 0.005621883252197508, "phrase": "profinite_monoid"}, {"score": 0.00481495049065317, "phrase": "omega_b-"}, {"score": 0.004571269461883144, "phrase": "disjoint_languages"}, {"score": 0.004258644418211771, "phrase": "omega-regular_language_l-sep"}, {"score": 0.003102752392819577, "phrase": "descriptive_set_theory"}, {"score": 0.003073545175760353, "phrase": "recursion_theory"}, {"score": 0.00297346171320082, "phrase": "pair_c"}, {"score": 0.0029454695624686078, "phrase": "c-c"}, {"score": 0.0028630535573013686, "phrase": "proof_technique"}, {"score": 0.0027961342030212353, "phrase": "omega-word_languages"}, {"score": 0.0027307746993761035, "phrase": "ramsey's_theorem"}, {"score": 0.002705059527911504, "phrase": "topological_methods"}, {"score": 0.00247249708860822, "phrase": "whole_construction"}, {"score": 0.0022175019341824603, "phrase": "b-and_s-regular_languages"}, {"score": 0.0021049979843008482, "phrase": "torunczyk"}], "paper_keywords": ["omega-regular languages", " counter automata", " profinite monoid", " omega S-regular languages."], "paper_abstract": "In this paper we show that omega B- and omega S-regular languages satisfy the following separation-type theorem If L-1, L-2 are disjoint languages of omega-words both recognised by omega B-(resp. omega S)automata then there exists an omega-regular language L-sep that contains L-1, and whose complement contains L-2. In particular, if a language and its complement are recognised by omega B-(resp. omega S)automata then the language is omega-regular. The result is especially interesting because, as shown by Bojanczyk and Colcombet, omega Bregular languages are complements of omega S-regular languages. Therefore, the above theorem shows that these are two mutually dual classes that both have the separation property. Usually (e.g. in descriptive set theory or recursion theory) exactly one class from a pair C, C-C has the separation property. The proof technique reduces the separation property for omega-word languages to profinite languages using Ramsey's theorem and topological methods. After that reduction, the analysis of the separation property in the profinite monoid is relatively simple. The whole construction is technically not complicated, moreover it seems to be quite extensible. The paper uses a framework for the analysis of B-and S-regular languages in the context of the profinite monoid that was proposed by Torunczyk.", "paper_title": "SEPARATION PROPERTY FOR omega B- AND omega S-REGULAR LANGUAGES", "paper_id": "WOS:000333744700013"}