{"auto_keywords": [{"score": 0.015125814459509963, "phrase": "computing_prominence"}, {"score": 0.014063668203783077, "phrase": "prominent_objects"}, {"score": 0.004814979810366137, "phrase": "hyperedges"}, {"score": 0.00471193241675062, "phrase": "new_algorithm"}, {"score": 0.004551647527068771, "phrase": "social_networks"}, {"score": 0.004358903464536199, "phrase": "prominent_actors"}, {"score": 0.00415625929636759, "phrase": "prominent_clusters"}, {"score": 0.0037138072936226, "phrase": "global_prominence_score"}, {"score": 0.0032471982781283374, "phrase": "\"true\"_hyperedges"}, {"score": 0.0029392020223716966, "phrase": "extensive_experimentation"}, {"score": 0.0027781870000242004, "phrase": "existing_well-known_algorithms"}, {"score": 0.002525489173110693, "phrase": "multiple_measures"}, {"score": 0.0024288443150616056, "phrase": "detailed_study"}, {"score": 0.0023562342764987254, "phrase": "different_data_sets"}, {"score": 0.0023257824499250653, "phrase": "design_choices"}, {"score": 0.0021049977753042253, "phrase": "collaborative_social_networks"}], "paper_keywords": ["Algorithms", " Measurement", " Performance", " Prominence", " collaboration", " social networks"], "paper_abstract": "We present a new algorithm called iHypR for computing prominence of actors in social networks of collaborations. Our algorithm builds on the assumption that prominent actors collaborate on prominent objects, and prominent objects are naturally grouped into prominent clusters or groups (hyperedges in a graph). iHypR makes use of the relationships between actors, objects, and hyperedges to compute a global prominence score for the actors in the network. We do not assume the hyperedges are given in advance. Hyperedges computed by our method can perform as well or even better than \"true\" hyperedges. Our algorithm is customized for networks of collaborations, but it is generally applicable without further tuning. We show, through extensive experimentation with three real-life data sets and multiple external measures of prominence, that our algorithm outperforms existing well-known algorithms. Our work is the first to offer such an extensive evaluation. We show that unlike most existing algorithms, the performance is robust across multiple measures of performance. Further, we give a detailed study of the sensitivity of our algorithm to different data sets and the design choices within the algorithm that a user may wish to change. Our article illustrates the various trade-offs that must be considered in computing prominence in collaborative social networks.", "paper_title": "iHypR: Prominence Ranking in Networks of Collaborations with Hyperedges", "paper_id": "WOS:000329435900001"}