{"auto_keywords": [{"score": 0.03571707355179994, "phrase": "deterministic_generic_solutions"}, {"score": 0.00481495049065317, "phrase": "mobile_agents"}, {"score": 0.004791597035042932, "phrase": "impact"}, {"score": 0.004630626571109149, "phrase": "r_identical_asynchronous_mobile_agents"}, {"score": 0.004570759604335229, "phrase": "arbitrary_anonymous_network"}, {"score": 0.004353040792349733, "phrase": "neighboring_node"}, {"score": 0.003257960296952439, "phrase": "network_topology"}, {"score": 0.003226275635740122, "phrase": "initial_placement"}, {"score": 0.002313783044225099, "phrase": "possibility_proof"}, {"score": 0.0022615684627308283, "phrase": "solution_protocol"}, {"score": 0.0021676977432828373, "phrase": "dynamic_naming_mechanism"}, {"score": 0.0021049977753042253, "phrase": "complete_anonymity"}], "paper_keywords": [""], "paper_abstract": "Consider a collection of r identical asynchronous mobile agents dispersed on an arbitrary anonymous network of size n. The agents all execute the same protocol and move from node to neighboring node. At each node there is a whiteboard where the agents can write and read from. The topology of the network is unknown to the agents. We examine the problems of rendezvous (i.e., having the agents gather in the same node) and election (i.e., selecting a leader among those agents). These two problems are computationally equivalent in the context examined here. We study conditions for the existence of deterministic generic solutions, i.e., algorithms that solve the two problems regardless of the network topology and the initial placement of the agents. In particular, we study the impact of edge-labeling on the existence of such solutions. Rendezvous and election are unsolvable (i.e., there are no deterministic generic solutions) if gcd(r, n) > 1, regardless of whether or not the edge-labeling has sense of direction. On the other hand, if gcd(r, n) = 1 then the initial placement of the robots in the network creates topological asymmetries that could be exploited to solve the problems. We prove that these asymmetries can be exploited if the edge-labeling has sense of direction, but cannot if the edge-labeling is arbitrary. The possibility proof is constructive: we present a solution protocol and prove its correctness. The protocol, among other features, uses a dynamic naming mechanism based on sense of direction to overcome the complete anonymity of the system.", "paper_title": "Rendezvous and election of mobile agents: Impact of sense of direction", "paper_id": "WOS:000243383600002"}