{"auto_keywords": [{"score": 0.04427753278092295, "phrase": "web_map"}, {"score": 0.035415222632963574, "phrase": "eye_movement_data"}, {"score": 0.030010141178800572, "phrase": "decision_process"}, {"score": 0.00481495049065317, "phrase": "internet_consumers'_decision_deliberateness"}, {"score": 0.004768739216860887, "phrase": "-_because_presentation_formats"}, {"score": 0.004707810093520679, "phrase": "shopping_web_sites"}, {"score": 0.004632737164977336, "phrase": "deliberate_consumer_decision_making"}, {"score": 0.004486147558765763, "phrase": "information_presentation"}, {"score": 0.004316323233538682, "phrase": "table_format"}, {"score": 0.004288648163837944, "phrase": "deliberate_decision_making"}, {"score": 0.004047390637093383, "phrase": "decision_orientation"}, {"score": 0.003283414652626541, "phrase": "preferential_choices"}, {"score": 0.0032623406075681315, "phrase": "simple_decision_tasks"}, {"score": 0.002961938159281582, "phrase": "explorative_factor_analysis"}, {"score": 0.0027504487463153532, "phrase": "present_study"}, {"score": 0.0027239972021363863, "phrase": "complex_tasks"}, {"score": 0.0024571577953004546, "phrase": "web_businesses"}, {"score": 0.0023487724551034227, "phrase": "emotional_stimuli"}, {"score": 0.0022742871983734737, "phrase": "first_attempts"}, {"score": 0.0022451572368358476, "phrase": "joint_effects"}, {"score": 0.0022163995544178215, "phrase": "decision_orientations"}, {"score": 0.0022021588353472914, "phrase": "decision_deliberateness"}, {"score": 0.0021809687586808522, "phrase": "internet_domain"}, {"score": 0.0021254512976941644, "phrase": "previous_studies"}], "paper_keywords": ["Information presentations", " Positive emotion", " Decision process", " Web map", " Table", " Eye movements", " Decision making", " Eyes", " Consumer behaviour"], "paper_abstract": "Purpose - Because presentation formats, i.e. table v. graph, in shopping web sites may promote or inhibit deliberate consumer decision making, it is important to understand the effects of information presentation on deliberateness. This paper seeks to empirically test whether the table format enhances deliberate decision making, while the web map weakens the process. In addition, deliberateness can be influenced by the decision orientation, i.e. emotionally charged or accuracy oriented. Thus, the paper further examines the effect of presentations across these two decision orientations. Design/methodology/approach - Objective and detailed description of the decision process is used to examine the effects. A two (decision orientation: positive emotion v. accuracy) by two (presentation: map v. table) eye-tracking experiment is designed. Deliberateness is quantified with the information processing pattern summarized from eye movement data. Participants are required to make preferential choices from simple decision tasks. Findings - The results confirm that the table strengthens while the map weakens deliberateness. In addition, this effect is mostly evident across the two decision orientations. An explorative factor analysis further reveals that there are two major attention distribution functions (global v. local) underlying the decision process. Research limitations/implications - Only simple decision tasks are used in the present study and therefore complex tasks should be introduced to examine the effects in the future. Practical implications For consumers, they should become aware that the table facilitates while the map diminishes deliberateness. For web businesses, they may try to strengthen the impulsivity in a web map filled with emotional stimuli. Originality/value - This research is one of the first attempts to investigate the joint effects of presentations and decision orientations on decision deliberateness in the internet domain. The eye movement data are also valuable because previous studies seldom provided such detailed description of the decision process.", "paper_title": "An eye-tracking investigation of internet consumers' decision deliberateness", "paper_id": "WOS:000297600100003"}