{"auto_keywords": [{"score": 0.04504125061239473, "phrase": "ppi_pairs"}, {"score": 0.00481495049065317, "phrase": "protein-protein_interaction_pair"}, {"score": 0.0047268728636719725, "phrase": "integrated_global_association_score"}, {"score": 0.0046834372388970405, "phrase": "protein-protein_interaction"}, {"score": 0.004597754207658615, "phrase": "database_curation"}, {"score": 0.004555499634179394, "phrase": "text-mining_systems"}, {"score": 0.004431041346291019, "phrase": "interactor_genes"}, {"score": 0.004349955692802962, "phrase": "ranked_list"}, {"score": 0.0038935506745975835, "phrase": "current_ppi_pair"}, {"score": 0.0038046452381676967, "phrase": "association_analysis"}, {"score": 0.0035498822293046884, "phrase": "extracted_ppi_pair"}, {"score": 0.0034528025626422154, "phrase": "paired_genes"}, {"score": 0.0033739270918502285, "phrase": "genes'_global_associations"}, {"score": 0.0030759821501544224, "phrase": "composite_interaction_score"}, {"score": 0.00274017282519193, "phrase": "global_association"}, {"score": 0.0026899455459275575, "phrase": "borda-fuse_models"}, {"score": 0.002225196379204285, "phrase": "global_association_score"}], "paper_keywords": ["Text mining", " bioinformatics databases"], "paper_abstract": "Protein-protein interaction (PPI) database curation requires text-mining systems that can recognize and normalize interactor genes and return a ranked list of PPI pairs for each article. The order of PPI pairs in this list is essential for ease of curation. Most of the current PPI pair ranking approaches rely on association analysis between the two genes in the pair. However, we propose that ranking an extracted PPI pair by considering both the association between the paired genes and each of those genes' global associations with all other genes mentioned in the paper can provide a more reliable ranked list. In this work, we present a composite interaction score that considers not only the association score between two interactors (pair association score) but also their global association scores. We test three representative data fusion algorithms to estimate this global association score-two Borda-Fuse models and one linear combination model (LCM). The three estimation methods are evaluated using the data set of the BioCreative II. 5 Interaction Pair Task (IPT) in terms of area under the interpolated precision/recall curve (AUC iP/R). Our experimental results indicate that using LCM to estimate the global association score can boost the AUC iP/R score from 0.0175 to 0.2396, outperforming the best BioCreative II. 5 IPT system.", "paper_title": "Improving Protein-Protein Interaction Pair Ranking with an Integrated Global Association Score", "paper_id": "WOS:000312558400013"}