{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "normalization_procedures"}, {"score": 0.010502158415990472, "phrase": "different_classification_systems"}, {"score": 0.004616859702338596, "phrase": "novel_methodology"}, {"score": 0.004568617813032014, "phrase": "idcp_measuring_framework"}, {"score": 0.004411406624893529, "phrase": "scientific_disciplines"}, {"score": 0.004156411748278609, "phrase": "numerical_approach"}, {"score": 0.003985305257857655, "phrase": "single_classification_system"}, {"score": 0.003957477564354679, "phrase": "evaluation_purposes"}, {"score": 0.003689628075766217, "phrase": "numerical_approaches"}, {"score": 0.003587616378156851, "phrase": "double_test"}, {"score": 0.003218180455135933, "phrase": "empirical_part"}, {"score": 0.0028664985822266344, "phrase": "systematic_and_a_random_assignment"}, {"score": 0.0024307637980373552, "phrase": "thomson_reuters"}, {"score": 0.0023469450817019, "phrase": "five-year_citation_window"}, {"score": 0.002289993730291136, "phrase": "fractional_approach"}, {"score": 0.0022660100755784057, "phrase": "substantive_results"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Citation practices", " Normalization procedures", " Classification systems", " Citation inequality"], "paper_abstract": "In this paper, we develop a novel methodology within the IDCP measuring framework for comparing normalization procedures based on different classification systems of articles into scientific disciplines. Firstly, we discuss the properties of two rankings, based on a graphical and a numerical approach, for the comparison of any pair of normalization procedures using a single classification system for evaluation purposes. Secondly, when the normalization procedures are based on two different classification systems, we introduce two new rankings following the graphical and the numerical approaches. Each ranking is based on a double test that assesses the two normalization procedures in terms of the two classification systems on which they depend. Thirdly, we also compare the two normalization procedures using a third, independent classification system for evaluation purposes. In the empirical part of the paper we use: (i) a classification system consisting of 219 sub-fields identified with the Web of Science subject-categories; an aggregate classification system consisting of 19 broad fields, as well as a systematic and a random assignment of articles to sub-fields with the aim of maximizing or minimizing differences across sub-fields; (ii) four normalization procedures that use the field or sub-field mean citations of the above four classification systems as normalization factors; and (iii) a large dataset, indexed by Thomson Reuters, in which 4.4 million articles published in 1998-2003 with a five-year citation window are assigned to sub-fields using a fractional approach. The substantive results concerning the comparison of the four normalization procedures indicate that the methodology can be useful in practice. (C) 2013 Elsevier Ltd. All rights reserved.", "paper_title": "The comparison of normalization procedures based on different classification systems", "paper_id": "WOS:000327920400019"}