{"auto_keywords": [{"score": 0.04646138076595222, "phrase": "tourism_organizations"}, {"score": 0.00905235278188069, "phrase": "requisitely_holistic_approach"}, {"score": 0.00481495049065317, "phrase": "socially_responsible_innovations"}, {"score": 0.004786002454145624, "phrase": "social_tourism"}, {"score": 0.004700193486903964, "phrase": "purpose_-_socially"}, {"score": 0.004686041610317898, "phrase": "responsible_innovative_behaviour"}, {"score": 0.004280651472525981, "phrase": "advanced_societies"}, {"score": 0.004078923069461593, "phrase": "dialectical_systems_theory"}, {"score": 0.004017846065981189, "phrase": "relevant_literature"}, {"score": 0.003981637972909267, "phrase": "common_characteristics"}, {"score": 0.003863275399791591, "phrase": "dialectical_systemic_analysis"}, {"score": 0.003444600613447231, "phrase": "travel_agency"}, {"score": 0.0033020239107199876, "phrase": "usual_approach"}, {"score": 0.003262378940806522, "phrase": "special_needs"}, {"score": 0.003099113156350047, "phrase": "existing_literature"}, {"score": 0.0030711589859463814, "phrase": "empirical_analysis"}, {"score": 0.002952900365829518, "phrase": "social_responsibility"}, {"score": 0.0025159570648844555, "phrase": "tourist_activities"}, {"score": 0.0024857262835071337, "phrase": "potentially_significant_share"}, {"score": 0.002304824112812496, "phrase": "available_literature"}, {"score": 0.0022497569011987587, "phrase": "dialectical_systems"}, {"score": 0.0021049977753042253, "phrase": "specific_needs"}], "paper_keywords": ["Management", " Tourism", " Social responsibility", " Systems theory", " Social change", " Dialectical systems theory", " People with disabilities", " Innovation management"], "paper_abstract": "Purpose - Socially responsible innovative behaviour should reduce the incidence of one-sidedness in the behaviour of persons. employed or active in tourism organizations. People with disabilities are often poorly integrated, even in the advanced societies. The paper aims to discuss these issues. Design/methodology/approach - With a requisitely holistic approach in dialectical systems theory and an overview of relevant literature, the common characteristics of tourists with disabilities are briefly described. A dialectical systemic analysis was used to determine whether people with disabilities want to travel and what their requirements are. A questionnaire was used to identify their recent travelling experiences; tourism organizations were interviewed about their experiences, too. A model of a travel agency, specialized for people with disabilities, is presented. Findings - The usual approach to people with special needs is too one-sided. A more requisitely holistic approach to understanding their needs in tourism, based on existing literature and an empirical analysis, is presented. A more innovative management of tourism organizations is proposed, increasing social responsibility (SR). Research limitations/implications - The authors contribute to the integration of people with disabilities in society, focusing on innovation in the management of tourism organizations. Practical implications This new, more systemic and socially responsible innovative management in tourism is widely applicable. Tourists with disabilities, their family members, and their travelling companions could become more included in tourist activities and represent a potentially significant share of the market. A requisitely holistic approach can provide advantages for tourists with disabilities and tourism organizations. Originality/value - The concepts were not found in available literature neither is the selection of viewpoints of dialectical systems thinking and SR in tourism. They support understanding, designing and managing activities in tourism for people with various limitations or specific needs.", "paper_title": "Systemic thinking for socially responsible innovations in social tourism for people with disabilities", "paper_id": "WOS:000334146900021"}