{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "contract_validation"}, {"score": 0.004613516457919661, "phrase": "software_engineering_activities"}, {"score": 0.004357927940322685, "phrase": "fragmented_nature"}, {"score": 0.0037789720824759503, "phrase": "novel_technique"}, {"score": 0.0036207206487324506, "phrase": "behavior_models"}, {"score": 0.003371508176308189, "phrase": "formal_artifacts"}, {"score": 0.0033395980635636644, "phrase": "software_engineering"}, {"score": 0.0027218799769229596, "phrase": "enabledness-preserving_abstractions"}, {"score": 0.0026202187680903063, "phrase": "concrete_states"}, {"score": 0.0024051153560799335, "phrase": "finite_model"}], "paper_keywords": ["Requirements/specifications", " validation", " automated abstraction"], "paper_abstract": "Pre/postcondition-based specifications are commonplace in a variety of software engineering activities that range from requirements through to design and implementation. The fragmented nature of these specifications can hinder validation as it is difficult to understand if the specifications for the various operations fit together well. In this paper, we propose a novel technique for automatically constructing abstractions in the form of behavior models from pre/postcondition-based specifications. Abstraction techniques have been used successfully for addressing the complexity of formal artifacts in software engineering; however, the focus has been, up to now, on abstractions for verification. Our aim is abstraction for validation and hence, different and novel trade-offs between precision and tractability are required. More specifically, in this paper, we define and study enabledness-preserving abstractions, that is, models in which concrete states are grouped according to the set of operations that they enable. The abstraction results in a finite model that is intuitive to validate and which facilitates tracing back to the specification for debugging. The paper also reports on the application of the approach to two industrial strength protocol specifications in which concerns were identified.", "paper_title": "Automated Abstractions for Contract Validation", "paper_id": "WOS:000299472600010"}