{"auto_keywords": [{"score": 0.04845849110410783, "phrase": "fisher_distribution"}, {"score": 0.034927122820173705, "phrase": "mcsdo"}, {"score": 0.013143646055421402, "phrase": "oebeuhp"}, {"score": 0.01264963974936976, "phrase": "fisher"}, {"score": 0.010346490642582458, "phrase": "generated_orientations"}, {"score": 0.00481495049065317, "phrase": "monte_carlo"}, {"score": 0.004053362743156545, "phrase": "upper_hemisphere_projection"}, {"score": 0.003933000051147382, "phrase": "important_influence"}, {"score": 0.003767203575060969, "phrase": "simulation_results"}, {"score": 0.0037188360359702182, "phrase": "detailed_algorithms"}, {"score": 0.003471135453226184, "phrase": "improved_method"}, {"score": 0.0034118234596993836, "phrase": "discontinuity_orientations"}, {"score": 0.0031982609080278643, "phrase": "aforementioned_adjustment"}, {"score": 0.00306334226516593, "phrase": "original_discontinuity"}, {"score": 0.002622947550220266, "phrase": "generated_discontinuities"}, {"score": 0.0023855210798264205, "phrase": "stereographic_projection_maps"}, {"score": 0.0023548511815224098, "phrase": "original_and_generated_discontinuities"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Mean orientation", " Fisher constant K", " Monte Carlo", " Adjustment", " Stereographic projection", " VBA program"], "paper_abstract": "Fisher distribution is the most commonly used probability density function for discontinuity orientations. Based on Fisher distribution, Monte Carlo simulation method for discontinuity orientations was reviewed and improved. Those orientations extending beyond the edge of an upper hemisphere projection (OEBEUHP) often have an important influence on both the mean orientation and Fisher constant K, thus affecting simulation results. The detailed algorithms for identifying and adjusting those OEBEUHP were developed in this paper. Based on the improved method, a program for generating discontinuity orientations and plotting their stereographic projection maps, named as MCSDO, was developed. Due to the aforementioned adjustment, the generated orientations by MCSDO are close to the original discontinuity orientations, which were mapped in field, and satisfactory. Only the original orientations and target number of generated orientations need to be input. By running the program we can directly obtain the follows: orientations of generated discontinuities, mean orientations of both original and generated discontinuities, Fisher constant K of both original and generated discontinuities, and stereographic projection maps of both original and generated discontinuities. MCSDO is a freeware designed for researchers and practicing engineers, and can be easily mastered with a little computer knowledge. (C) 2014 Elsevier Ltd. All rights reserved.", "paper_title": "An improved Monte Carlo simulation method for discontinuity orientations based on Fisher distribution and its program implementation", "paper_id": "WOS:000340305100026"}