{"auto_keywords": [{"score": 0.049648703742940906, "phrase": "pervasive_computing_systems"}, {"score": 0.009646714071050867, "phrase": "systems'_dependability"}, {"score": 0.00481495049065317, "phrase": "dependability_improvement_techniques"}, {"score": 0.0045404698551856125, "phrase": "state-of-the-art_research_results"}, {"score": 0.004359625030298944, "phrase": "dependable_pervasive_computing_systems"}, {"score": 0.00418595288276353, "phrase": "system_dependability"}, {"score": 0.0036553070575015344, "phrase": "future_research"}, {"score": 0.003220709449062307, "phrase": "pervasive_computing_systems'_perceived_environments"}, {"score": 0.00298238929037041, "phrase": "great_impact"}, {"score": 0.0027741761880779535, "phrase": "systems'_internal_computations"}, {"score": 0.002712131567923321, "phrase": "external_environments"}, {"score": 0.0026634937939104177, "phrase": "fault_detection"}, {"score": 0.0026157259734105, "phrase": "important_issue"}], "paper_keywords": ["pervasive computing system", " dependability", " context", " fault detection", " uncertainty"], "paper_abstract": "The goal of this survey is to summarize the state-of-the-art research results and identify research challenges of developing and deploying dependable pervasive computing systems. We discuss the factors that affect the system dependability and the studies conducted to improve it with respect to these factors. These studies were categorized according to their similarities and differences in hope of shedding some insight into future research. There are three categories: context management, fault detection, and uncertainty handling. These three categories of work address the three most difficult problems of pervasive computing systems. First, pervasive computing systems' perceived environments, which are also called their contexts, can vary intensively, and thus have a great impact on the systems' dependability. Second, it is challenging to guarantee the correctness of the systems' internal computations integrated with interactions with external environments for developers. Fault detection is then an important issue for improving dependability for these systems. Last but not least importantly, pervasive computing systems interact with their environments frequently. These interactions can be affected by many uncertainties, which can jeopardize the systems' dependability. After a discussion of these pieces of work, we present an outlook for its future research directions.", "paper_title": "A survey on dependability improvement techniques for pervasive computing systems", "paper_id": "WOS:000353818200010"}