{"auto_keywords": [{"score": 0.049270547314558835, "phrase": "biology_researchers"}, {"score": 0.007152368807539886, "phrase": "online_tools"}, {"score": 0.004774115617883476, "phrase": "scientific_collaboration"}, {"score": 0.004497762477097628, "phrase": "research_practices"}, {"score": 0.004148014765950199, "phrase": "usability_testing"}, {"score": 0.0038253590626087237, "phrase": "large_irish_university"}, {"score": 0.0036813725040313002, "phrase": "user_requirements"}, {"score": 0.0032531496610470377, "phrase": "social_networking_tools"}, {"score": 0.0032255172568437965, "phrase": "e-mail_and_phone_conversations"}, {"score": 0.002790004829699627, "phrase": "current_research_practices"}, {"score": 0.0022634699331607615, "phrase": "research_process"}, {"score": 0.0022062235065459274, "phrase": "online_research_tools"}, {"score": 0.0021504218042734677, "phrase": "important_insight"}, {"score": 0.002123051344001408, "phrase": "information_behaviour"}, {"score": 0.0021049977753042253, "phrase": "life_science_researchers"}], "paper_keywords": ["Web 2.0", " Scientific collaboration", " Information behaviour", " Usability testing", " Online research", " Virtual Research Environment"], "paper_abstract": "Purpose The purpose of this paper is to discover the research practices of biology researchers and to assess the suitability of the OJAX++ Virtual Research Environment (VRE) for these researchers. Design/methodology/approach Usability testing was used to evaluate the usability of OJAX++ in relation to biology researchers. Interviews with biology researchers in a large Irish university were conducted to investigate their research information behaviour, to establish user requirements in their discipline and to evaluate the feasibility of using OJAX++ in their research. Findings The results show that biology researchers used online tools extensively in their research but do not use social networking tools. E-mail and phone conversations are the preferred methods of collaborating with colleagues. The biology researchers found that OJAX++ was easy to use, intuitive and professionally presented but in its present format, OJAX++ does not fit in with current research practices as they do not use Web 2.0 tools that facilitate tagging. A list of requirements of a VRE for biology researchers is presented. Originality/value The findings of the study will assist developers of VREs and other web tools to better understand how researchers, in particular biologists, collaborate during the research process and what they require from online research tools. This study gives an important insight into the information behaviour of life science researchers.", "paper_title": "The potential use of online tools for scientific collaboration by biology researchers", "paper_id": "WOS:000334967100002"}