{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "multi-lingual_question-answering_systems"}, {"score": 0.041562269310917936, "phrase": "linguistic_resources"}, {"score": 0.004673079747693193, "phrase": "information_retrieval"}, {"score": 0.004620957579769604, "phrase": "multi-lingual_tools"}, {"score": 0.004434745755769205, "phrase": "language_barriers"}, {"score": 0.003919763262805793, "phrase": "better_coverage"}, {"score": 0.0038471128411102914, "phrase": "translation_problems"}, {"score": 0.003761700847771486, "phrase": "multi-lingual_information_retrieval"}, {"score": 0.0033747739383101095, "phrase": "users'_queries"}, {"score": 0.0033496005635637316, "phrase": "short_answers"}, {"score": 0.0031195948946937378, "phrase": "main_publications"}, {"score": 0.0030847461428168614, "phrase": "multi-lingual_qa_systems"}, {"score": 0.00286213454317036, "phrase": "real_use"}, {"score": 0.0027261023678401696, "phrase": "new_kind"}, {"score": 0.0025868090345615197, "phrase": "cross-languages_qa_systems"}, {"score": 0.0023031224517224757, "phrase": "widening_gap"}, {"score": 0.002218496283514268, "phrase": "wikipedia"}, {"score": 0.002152874480615438, "phrase": "translation_discipline"}, {"score": 0.0021049977753042253, "phrase": "qa_systems"}], "paper_keywords": ["Information retrieval", " Languages", " Software tools", " Information systems", " Databases", " Dictionaries", " Thesauri"], "paper_abstract": "Purpose - In the field of information retrieval, some multi-lingual tools are being created to help the users to overcome the language barriers. Nevertheless, these tools are not developed completely and it is necessary to investigate more for their improvement and application. One of their main problems is the choice of the linguistic resources to offer better coverage and to solve the translation problems in the context of the multi-lingual information retrieval. This paper aims to address this issue. Design/methodology/approach - This research is focused on the analysis of resources used by the multi-lingual question-answering systems, which respond to users' queries with short answers, rather than just offering a list of documents related to the search. An analysis of the main publications about the multi-lingual QA systems was carried out, with the aim of identifying the typology, the advantages and disadvantages, and the real use and trend of each of the linguistic resources and tools used in this new kind of system. Findings - Five of the resources most used in the cross-languages QA systems were identified and studied: databases, dictionaries, corpora, ontologies and thesauri. The three most popular traditional resources (automatic translators, dictionaries, and corpora) are gradually leaving a widening gap for others such as ontologies and the free encyclopaedia Wikipedia. Originality/value - The perspective offered by the translation discipline can improve the effectiveness of QA systems.", "paper_title": "Language resources used in multi-lingual question-answering systems", "paper_id": "WOS:000295711800002"}