{"auto_keywords": [{"score": 0.033586096803795956, "phrase": "fast_form"}, {"score": 0.008355711211402621, "phrase": "likert"}, {"score": 0.008221913569355477, "phrase": "model's_constructs"}, {"score": 0.0068168984208981315, "phrase": "survey_completion_time"}, {"score": 0.00481495049065317, "phrase": "approach_to_measuring_technology_acceptance_and_other_constructs."}, {"score": 0.00470697922443172, "phrase": "technology_acceptance_model"}, {"score": 0.004676580849017801, "phrase": "tam"}, {"score": 0.004202223763361474, "phrase": "robust_test"}, {"score": 0.0032629585038738856, "phrase": "semantic_differential_scale"}, {"score": 0.0031079353701597926, "phrase": "tam."}, {"score": 0.0028564228386290615, "phrase": "psychometric_evaluation"}, {"score": 0.0022904980438110613, "phrase": "likert_scales"}, {"score": 0.0022101055924375725, "phrase": "strong_evidence"}, {"score": 0.002195794209219447, "phrase": "nomological_validity"}], "paper_keywords": ["Technology acceptance", " semantic differential", " scale development", " item decomposition", " nomological validity"], "paper_abstract": "Nearly all prior studies on the technology acceptance model (TAM) have used Likert scales to measure the model's constructs, but the use of only this type of scale has two short-comings. One is that such use prevents us from exposing the model's constructs to a robust test of their measure and relationships to each other, termed their nomological validity. The other is that such use leaves us unsure about whether or not we have selected an efficient way, in terms of survey completion time, to assess these constructs, Past researchers have used short form scales to address the issue of efficiency, but there are problems that may result from such efforts. In this study, we address both shortcomings by exploring the use of a semantic differential scale, which we refer to as a fast form, to assess the constructs of TAM. In this regard, we do three things. First, we describe how fast form as a scale may be developed. Second, we conduct a psychometric evaluation of the constructs that are measured by the fast form and examine their relationships. Third, we assess the efficiency of the fast form by comparing the time required to complete a survey with it to that which is required to complete a survey with Likert scales. Our results confirm that the constructs that are measured by the fast form are psychometrically equivalent to those that are measured by the Likert scales. The relationship among these constructs was unchanged. providing strong evidence for nomological validity. The fast form also yielded a 40 percent reduction in the survey completion time, proving its superior efficiency. We conclude with a description of the implications of these results for research and practice.", "paper_title": "A FAST FORM APPROACH TO MEASURING TECHNOLOGY ACCEPTANCE AND OTHER CONSTRUCTS", "paper_id": "WOS:000261362500003"}