{"auto_keywords": [{"score": 0.039951996432254715, "phrase": "wps"}, {"score": 0.016119641207364817, "phrase": "sos"}, {"score": 0.005684906611473019, "phrase": "motion_video_data"}, {"score": 0.00481495049065317, "phrase": "sensor_web_environment"}, {"score": 0.004748740786945996, "phrase": "motion-based_video_change"}, {"score": 0.004661868629458321, "phrase": "different_types"}, {"score": 0.004619027561771169, "phrase": "motion_video"}, {"score": 0.004534517530868195, "phrase": "different_change_detection_algorithms"}, {"score": 0.004472146692254812, "phrase": "web_system"}, {"score": 0.0036497171230592406, "phrase": "proposed_approach"}, {"score": 0.002950608985750058, "phrase": "real-time_processing"}, {"score": 0.0028172726995962173, "phrase": "different_motion_video_change_detection_algorithms"}, {"score": 0.0027528751037412128, "phrase": "different_conditions"}, {"score": 0.0025565050791036973, "phrase": "wps_architecture"}, {"score": 0.0022355167967736326, "phrase": "video_change_detection_case"}, {"score": 0.0021945194903838132, "phrase": "road_situation"}, {"score": 0.0021049977753042253, "phrase": "open_geospatial_consortium_web_service_phase"}], "paper_keywords": ["Sensor Observation Service", " Web Processing Service", " video change detection", " Sensor Web"], "paper_abstract": "Detecting motion-based video change, such as different types of motion video or applications using different change detection algorithms in a Web system, is difficult. This paper designs and implements architecture for a real-time or near real-time on-demand motion video change detection system using the Sensor Observation Service (SOS) and the Web Processing Service (WPS) in the Sensor Web environment. Real-time or near real-time includes sensors that obtain motion video data, SOS provides motion video data to WPS and WPS processes this data. Three solution methods are introduced: the GetObservation operation of SOS by transaction, dynamical interaction between SOS and WPS, and WPS real-time or near real-time processing. On-demand means that a developer can choose different motion video change detection algorithms under different applications or different conditions. For this purpose, a flexible, standards-based and service-oriented WPS architecture is designed, which consists of three layers: the WPS interface layer, the field interface layer and the implementation layer. To test the proposed approach, a video change detection case of monitoring a road situation is shown, which was a demonstration for Open Geospatial Consortium Web Service phase 7. The results demonstrate that the proposed approach is feasible.", "paper_title": "Real-Time On-Demand Motion Video Change Detection in the Sensor Web Environment", "paper_id": "WOS:000298386300007"}