{"auto_keywords": [{"score": 0.03148611950364376, "phrase": "haptic_feedback"}, {"score": 0.013871420418645725, "phrase": "graphic_analogies"}, {"score": 0.00481495049065317, "phrase": "atomic_force"}, {"score": 0.004542158659382197, "phrase": "virtual_reality"}, {"score": 0.004411588377842043, "phrase": "nanoscale_applications"}, {"score": 0.004305639197085793, "phrase": "teaching_aid"}, {"score": 0.004061584718427419, "phrase": "non-intuitive_nanoscale_phenomena"}, {"score": 0.003983334573043943, "phrase": "prior_knowledge"}, {"score": 0.003614044704141927, "phrase": "atomic_force_microscope"}, {"score": 0.0035792663071067586, "phrase": "afm"}, {"score": 0.0032629585038738856, "phrase": "\"magnet-spring\"_analogy"}, {"score": 0.002792246704359262, "phrase": "cantilever_stiffness"}, {"score": 0.002725081358527507, "phrase": "analogical_representation"}, {"score": 0.0025085435314540837, "phrase": "mental_model"}, {"score": 0.0024126686412257407, "phrase": "positive_influence"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Haptic I/O", " Analogies", " Education", " Micro/nano technology", " Human factors"], "paper_abstract": "This paper aims to evaluate the benefits of using virtual reality and force-feedback to help teaching nanoscale applications. We propose a teaching aid that combines graphic analogies and haptics intended to improve the grasp of non-intuitive nanoscale phenomena for people without prior knowledge of nanophysics. We look specifically at the most important nanophysical phenomenon, namely, the behavior of the probe of an Atomic Force Microscope (AFM) as it approaches a sample. The results from experiments carried out with 45 students indicate that a \"magnet-spring\" analogy helped beginners to establish the link between the behavior of a probe and its force distance curve. The addition of haptic feedback increased focus about forces and improved the interpretation of the effect of cantilever stiffness. Haptic feedback and the analogical representation were very much appreciated by the subjects and had an impact on the construction of a mental model. Taken together, our results show a positive influence of using haptic feedback and graphic analogies, especially when students are first exposed to the notions that are in effect at the nanoscale. (C) 2013 Elsevier Ltd. All rights reserved.", "paper_title": "Haptics and graphic analogies for the understanding of atomic force microscopy", "paper_id": "WOS:000318382300006"}