{"auto_keywords": [{"score": 0.04916387935172275, "phrase": "commercial_web_sites"}, {"score": 0.011709838638603929, "phrase": "web_features"}, {"score": 0.008320741722933681, "phrase": "assessment_framework"}, {"score": 0.00788438095875011, "phrase": "web-technological_features"}, {"score": 0.004777252147963735, "phrase": "proposed_assessment_framework"}, {"score": 0.0046498719970616866, "phrase": "valuable_insights"}, {"score": 0.00415777266387528, "phrase": "prior_relevant_research"}, {"score": 0.004125773078637226, "phrase": "successful_web_site_design_experiences"}, {"score": 0.0037170399498025215, "phrase": "listed_australian_companies"}, {"score": 0.0034140224493254935, "phrase": "different_companies"}, {"score": 0.003374655868348244, "phrase": "different_web-technological_features"}, {"score": 0.0029589086332593674, "phrase": "different_industries"}, {"score": 0.002846647336160784, "phrase": "australian_companies"}, {"score": 0.00282470997972535, "phrase": "possible_differences"}, {"score": 0.002707033618304716, "phrase": "different_countries"}, {"score": 0.0025643086619242814, "phrase": "previous_studies"}, {"score": 0.0025054621733192283, "phrase": "prior_research"}, {"score": 0.0021049977753042253, "phrase": "commercial_web_site_owners"}], "paper_keywords": ["worldwide web", " commercial services", " Australia"], "paper_abstract": "Purpose - To propose an assessment framework that can be used to categorise and assess commercial web sites from the perspective of web-technological features and functions and to demonstrate its usefulness. Design/methodology/approach - Drawing on prior relevant research and successful web site design experiences of industrial experts in the field, an assessment framework that can be used to categorise and assess web features and functions is proposed, and 252 commercial web sites of listed Australian companies were randomly sampled and assessed to demonstrate the usefulness of the proposed assessment framework. Findings - The proposed assessment framework provides valuable insights. While different companies normally use different web-technological features and functions on their web sites, certain features and functions have been more commonly used in designing commercial web sites than others, and certain differences in the use of web features and functions on commercial web sites exist across different industries. Research limitations/implications - This research studied commercial web sites of Australian companies. Possible differences in the use of web features and functions on commercial web sites across different countries remain to be explored. Originality/value - Although various approaches have been proposed in previous studies to evaluate commercial web sites, no prior research could be found to assess commercial web sites from the perspective of web-technological features and functions. This research proposed an assessment framework that can be used to categorise and assess commercial web sites from the perspective of web-technological features and functions and demonstrated its usefulness. It also provided valuable insights to commercial web site owners and designers.", "paper_title": "Categorizing web features and functions to evaluate commercial web sites", "paper_id": "WOS:000241397100013"}