{"auto_keywords": [{"score": 0.04686833258179154, "phrase": "geographical_objects"}, {"score": 0.012329476338595512, "phrase": "spatial_relations"}, {"score": 0.010407792486748479, "phrase": "vertical_proximity"}, {"score": 0.00997563830077401, "phrase": "horizontal_proximity"}, {"score": 0.003952828685048176, "phrase": "remarkable_buildings"}, {"score": 0.0035527409334589317, "phrase": "geographical_proximity"}, {"score": 0.0033680968918579717, "phrase": "geographical_proximities"}, {"score": 0.002405853977978678, "phrase": "spatial_relational_graph"}, {"score": 0.002185235873435714, "phrase": "inclusive_relations"}, {"score": 0.0021620042653528846, "phrase": "spatial_relational_graphs"}, {"score": 0.0021049977753042253, "phrase": "prototype_system"}], "paper_keywords": [""], "paper_abstract": "When we look for locations, we use the names of geographical objects (e.g., landmarks, rivers, lakes). However, we often memorize the locations by using relations among landmarks like remarkable buildings. For this reason, we focus on spatial relations among geographical objects, and we define spatial relations based on the geographical proximity. In this paper, we manipulate two types of geographical proximities: a vertical proximity and a horizontal proximity. The vertical proximity shows two geographical objects are overlapping, and the horizontal proximity shows two geographical objects are adjacent. In order to represent these proximities, we introduce two spatial relations: \"overlapping\" and \"neighboring\". \"Overlapping\" represents the vertical proximity, and \"neighboring\" represents the horizontal proximity. Furthermore, we propose a spatial relational graph which is generated by connecting geographical objects with these two spatial relations. In addition, we search maps by inclusive relations among spatial relational graphs, and implement the prototype system to find out locations by using a map.", "paper_title": "Spatial relation for geometrical/topological map retrieval", "paper_id": "WOS:000242122600155"}