{"auto_keywords": [{"score": 0.05007852962010534, "phrase": "value_congruence"}, {"score": 0.004431041346291019, "phrase": "trust_and_value_congruence_influence_consumers"}, {"score": 0.004211594861013822, "phrase": "perceived_values"}, {"score": 0.004002972723329302, "phrase": "trusting_beliefs"}, {"score": 0.003966162568548304, "phrase": "e-commerce_consumers"}, {"score": 0.0038577428353448596, "phrase": "private_personal_information"}, {"score": 0.003061793572858598, "phrase": "strong_effect"}, {"score": 0.0029780219173522115, "phrase": "personal_information"}, {"score": 0.0025096359514694523, "phrase": "prior_work"}, {"score": 0.0024750474634399797, "phrase": "structural_equation"}, {"score": 0.002418453525649304, "phrase": "relative_strength"}, {"score": 0.0022772782536385717, "phrase": "overall_trust_level"}, {"score": 0.002204697943520258, "phrase": "behavioral_intentions"}, {"score": 0.002164264600379492, "phrase": "information_sharing"}, {"score": 0.0021049977753042253, "phrase": "profit_organizations"}], "paper_keywords": ["trust", " privacy", " value congruence", " ethics", " information sharing", " knowledge management"], "paper_abstract": "This study explores how value congruence contributes to the formation of trust in e-businesses, and how trust and value congruence influence consumers to share personal information. It is hypothesized that the perceived values of organizations regarding moral, social, environmental and political causes can have an effect on the trusting beliefs of e-commerce consumers and their willingness to disclose private personal information. A total of 775 subjects rated their perceived value congruence with organizations, their trusting beliefs, and the types of information they would be willing to disclose. This study finds that value congruence not only plays a role in mediating the trust of consumers for the organizations, but it also has a strong effect on determining their willingness to disclose personal information. In some cases, the influence of value congruence is greater than that of trust, even though trust has been touted in the literature as one of the most important factors in e-commerce. This research expands prior work by using structural equation modeling to test the relative strength of the effect of value congruence on each dimension of trust and the overall trust level, as well as its direct effect on behavioral intentions in terms of information sharing for non-profit and for-profit organizations.", "paper_title": "Sharing information and building trust through value congruence", "paper_id": "WOS:000250485300007"}