{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "massively_parallel_plasma_turbulence_code"}, {"score": 0.00443638953122199, "phrase": "international_fusion_experiment"}, {"score": 0.004258372598568333, "phrase": "large_degree"}, {"score": 0.0041642891310893, "phrase": "so-called_energy_confinement_time"}, {"score": 0.004042056914551798, "phrase": "underlying_physical_processes"}, {"score": 0.0038224221344037236, "phrase": "five-dimensional_phase_space"}, {"score": 0.0034566143156030426, "phrase": "linearized_equation"}, {"score": 0.003405472159599445, "phrase": "largest_possible_timestep"}, {"score": 0.0028688545415450407, "phrase": "eigenvalue_computations"}, {"score": 0.002836942411239067, "phrase": "new_insight"}, {"score": 0.002784540221128404, "phrase": "plasma_turbulence"}, {"score": 0.0026826140171754675, "phrase": "different_unstable_modes"}, {"score": 0.002652768049567487, "phrase": "dominant_and_subdominant_ones"}, {"score": 0.002499094513009327, "phrase": "numerical_point"}, {"score": 0.002354302193867031, "phrase": "linearized_operator"}, {"score": 0.0023107943665108465, "phrase": "implicit_form"}, {"score": 0.002251227801482381, "phrase": "different_strategies"}, {"score": 0.002193193339812606, "phrase": "matrix-free_spectral_transformation"}, {"score": 0.0021607035327962246, "phrase": "harmonic_projection"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Plasma physics", " Complex non-Hermitian eigenproblem", " Rightmost eigenvalues"], "paper_abstract": "Magnetic fusion aims at providing CO2 free energy for the 21st century and well beyond. However, the success of the international fusion experiment ITER (currently under construction) will depend to a large degree on the value of the so-called energy confinement time. One of the most advanced tools describing the underlying physical processes is the highly scalable (up to at least 32,768 cores) plasma turbulence code GENE. GENE solves a set of nonlinear partial integro-differential equations in five-dimensional phase space by means of the method of lines, with a 4th order explicit Runge-Kutta scheme for time integration. To maximize its efficiency, the code computes the eigenspectrum of the linearized equation to determine the largest possible timestep which maintains the stability of the method. This requires the computation of the largest (in terms of its magnitude) eigenvalue of a complex, non-Hermitian matrix whose size may range from a few millions to even a billion. SLEPc, the Scalable Library for Eigenvalue Problem Computations, is used to effectively compute this part of the spectrum. Additionally, eigenvalue computations can provide new insight into the properties of plasma turbulence. The latter is driven by a number of different unstable modes, including dominant and subdominant ones, that can be determined employing SLEPc. This computation is more challenging from the numerical point of view, since these eigenvalues can be considered interior, and also because the linearized operator is available only in implicit form. We analyze the feasibility of different strategies for computing these modes, including matrix-free spectral transformation as well as harmonic projection methods. (C) 2009 Elsevier B.V. All rights reserved.", "paper_title": "Fast eigenvalue calculations in a massively parallel plasma turbulence code", "paper_id": "WOS:000279086400011"}