{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "arbitrarily_permuted_parallel_channels"}, {"score": 0.038170323568475995, "phrase": "parallel_channels"}, {"score": 0.033285701396816525, "phrase": "input_distributions"}, {"score": 0.003236941658990869, "phrase": "special_case"}, {"score": 0.0028404241985421096, "phrase": "single_channel_code"}, {"score": 0.0027341763737751467, "phrase": "sequential_decoding_method"}, {"score": 0.002646267286675984, "phrase": "rate-matching_code"}, {"score": 0.0023990982005125763, "phrase": "different_capacity"}, {"score": 0.0021049977753042253, "phrase": "sequential_decoding_procedure"}], "paper_keywords": ["capacity", " maximum distance separable (MDS) codes", " parallel channels", " permuted channels", " rate-matching code", " sequential decoding method"], "paper_abstract": "The problem of transmission of information over arbitrarily permuted parallel channels is studied here. The transmitter does not know over which channel a certain code-sequence will actually be transmitted, however the receiver knows how the sequences are permitted. The permutation is arbitrary but constant during the (simultaneous) transmission of the code-sequences via the parallel channels. It is shown first that the sum of the capacities of each channel is achievable for such a communication system in the special case where the capacity achieving input distributions of all channels are identical. More important is that this sum-capacity can also be achieved using a single channel code for all channels combined with a sequential decoding method. The construction of a rate-matching code based on Maximum Distance Separable (MDS) codes turns out to be crucial. Finally, the case where the parallel channels have different capacity-achieving input distributions is investigated. Also for this case the capacity is determined. Again, this capacity is achievable with a sequential decoding procedure.", "paper_title": "Signaling over arbitrarily permuted parallel channels", "paper_id": "WOS:000253602200039"}