{"auto_keywords": [{"score": 0.049707293588616405, "phrase": "group_behavior"}, {"score": 0.008579511417456281, "phrase": "mobile_sensors"}, {"score": 0.006093961289077955, "phrase": "wireless_communication_range"}, {"score": 0.00481495049065317, "phrase": "wireless_communication_failures"}, {"score": 0.004685375117376838, "phrase": "social_groups"}, {"score": 0.004648995193787914, "phrase": "complex_group_behavior"}, {"score": 0.004559270778306828, "phrase": "local_interaction"}, {"score": 0.004523865550323285, "phrase": "simple_individuals"}, {"score": 0.004445015803838691, "phrase": "obtainable_information"}, {"score": 0.004250302819248558, "phrase": "wireless_communication"}, {"score": 0.004071846628708832, "phrase": "accurate_information"}, {"score": 0.00396218934254591, "phrase": "wireless_communication_links"}, {"score": 0.0037957839728524046, "phrase": "consensus_decision-making_model"}, {"score": 0.0036080776793146843, "phrase": "successful_communication"}, {"score": 0.002681859084438076, "phrase": "group_changes"}, {"score": 0.0022495644368875686, "phrase": "wider_area"}, {"score": 0.0021049977753042253, "phrase": "john_wiley"}], "paper_keywords": ["wireless communication", " group behavior", " emergence", " local interaction"], "paper_abstract": "In social groups, complex group behavior often emerges from the local interaction among simple individuals. Throughout this study, we assume that individuals can access information by way of wireless communication. In this case, individuals are able to exchange accurate information with each other as long as wireless communication links between them are allowed. Subsequently, we propose a consensus decision-making model for studying the consistency of group behavior considering both the wireless communication range and the probability of successful communication. Our simulation results show the following conclusions: (i) consistency of the group behavior is absolutely achieved, when the wireless communication range is large enough and the probability of successful communication p=1; (ii) when the wireless communication range is large enough, the consistency of the group behavior is still achieved as long as p is bigger than some small constant; and (iii) the law in (iii) remains applicable when the number of individuals in the group changes. Therefore, one may infer that consistency of group behavior in mobile sensors is much more related to the extent of distribution of obtainable information than the amount of information, where the extent of distribution of obtainable information means that each individual can obtain information from wider area or from those individuals who are not only in its local area. Copyright (c) 2012 John Wiley & Sons, Ltd.", "paper_title": "The effects of wireless communication failures on group behavior of mobile sensors", "paper_id": "WOS:000329788800005"}