{"auto_keywords": [{"score": 0.006315539941120609, "phrase": "evm"}, {"score": 0.00481495049065317, "phrase": "frequency_quadrupler_for_millimeter-wave_multiband"}, {"score": 0.00479338027764693, "phrase": "ofdm_ultrawideband_wireless_signals"}, {"score": 0.004708056866527125, "phrase": "fiber_systems"}, {"score": 0.00438167465490578, "phrase": "mb"}, {"score": 0.0042459818200777846, "phrase": "frequency-quadrupling_technique"}, {"score": 0.003987126862293129, "phrase": "error_vector_magnitude"}, {"score": 0.0038290829316346654, "phrase": "transmission_quality"}, {"score": 0.0037975179434567036, "phrase": "frequency"}, {"score": 0.0035473867669654174, "phrase": "mb-ofdm_uwb_signal"}, {"score": 0.003499864176875713, "phrase": "frequency_quadrupling"}, {"score": 0.003376216637891932, "phrase": "mzm"}, {"score": 0.003085813569061001, "phrase": "mm-wave_generation"}, {"score": 0.0026009105281485888, "phrase": "bias_drift"}, {"score": 0.002543043781904587, "phrase": "extinction_ratio"}, {"score": 0.0022019274077124795, "phrase": "minimum_evm"}, {"score": 0.0021049977753042253, "phrase": "local_oscillator_modulation_index"}], "paper_keywords": ["Multiband OFDM", " Millimeter-wave generation", " Optical upconversion", " Radio over fiber", " Subcarrier modulation", " Ultrawideband wireless communication"], "paper_abstract": "Performance of millimeter-wave (mm-wave) multiband orthogonal frequency division multiplexing (MB-OFDM) ultrawideband (UWB) signal generation using a frequency-quadrupling technique and transmission over fiber is investigated by simulation and experiment, and the error vector magnitude (EVM) is used to evaluate the transmission quality. Frequency hopping within the first three bands of IEEE 802.15.3a has been used in experiments to obtain an MB-OFDM UWB signal. The frequency quadrupling can be achieved by using only one Mach-Zehnder modulator (MZM) and two cascaded MZMs. It is found that using one MZM is better than using two cascaded MZMs in the performance of mm-wave generation. For using one MZM, it is found that transmission through 20 km of fiber degrades the EVM by less than 0.5 dB compared with back-to-back. Also, the EVM is degraded by less than 1 and 0.25 dB for a bias drift of less than 20% and an extinction ratio of more than 10 dB, respectively. Moreover, the EVM of the system using one MZM is improved by more than 2.5 dB compared with the two cascaded MZMs. In addition, it is found that the minimum EVM required of -17 dB can be achieved by using a local oscillator modulation index of similar to 63% and 70% at least for using the one MZM and two cascaded MZMs, respectively.", "paper_title": "Frequency Quadrupler for Millimeter-Wave Multiband OFDM Ultrawideband Wireless Signals and Distribution Over Fiber Systems", "paper_id": "WOS:000270408700007"}