{"auto_keywords": [{"score": 0.04126348007594693, "phrase": "picaa"}, {"score": 0.013520789856589365, "phrase": "learning_process"}, {"score": 0.00481495049065317, "phrase": "ios_devices"}, {"score": 0.004653220443592979, "phrase": "special_education"}, {"score": 0.004581505405526037, "phrase": "cognitive_abilities"}, {"score": 0.004539005582217309, "phrase": "new_knowledge"}, {"score": 0.004278807087784626, "phrase": "customizable_and_adaptable_applications"}, {"score": 0.0040334640350288, "phrase": "mobile_platform"}, {"score": 0.00398362591640497, "phrase": "ipad_and_ipod_touch_devices"}, {"score": 0.003861697777410367, "phrase": "main_phases"}, {"score": 0.0036857412768922827, "phrase": "educational_activities"}, {"score": 0.003367894141916481, "phrase": "student_requirements"}, {"score": 0.0032445022888094636, "phrase": "pre-experimental_study"}, {"score": 0.003115980972774255, "phrase": "spain"}, {"score": 0.002992395566992563, "phrase": "learning_platform"}, {"score": 0.0029462012558267863, "phrase": "positive_effects"}, {"score": 0.0029007179823144357, "phrase": "learning_skills"}, {"score": 0.002855934865505357, "phrase": "special_educational_needs"}, {"score": 0.00281184118901173, "phrase": "basic_skills"}, {"score": 0.0021987994275190314, "phrase": "electronic_devices"}, {"score": 0.0021851480717840484, "phrase": "multimedia_contents"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Authoring tools and methods", " Interactive learning environments", " Computer-mediated communication", " Multimedia/hypermedia systems", " Evaluation of CAL systems"], "paper_abstract": "Students with special education have difficulties to develop cognitive abilities and acquire new knowledge. They could also need to improve their behavior, communication and relationships with their environment. The development of customizable and adaptable applications tailored to them provides many benefits as it helps mold the learning process to different cognitive, sensorial or mobility impairments. We have devised a mobile platform (based on iPad and iPod touch devices), called Picaa and designed to cover the main phases of the learning process: preparation, use and evaluation. It includes four kinds of educational activities (Exploration, Association, Puzzle and Sorting), which can be personalized by educators at content and user interface levels through a design mainly centered on student requirements, whose user profiles can also be adapted. We have performed a pre-experimental study about the use of Picaa by 39 students with special education needs from Spain, including an evaluation based on pre/post testing. The use of the learning platform Picaa is associated with positive effects in the development of learning skills for children who have special educational needs, observing that the basic skills (language, math, environmental awareness, autonomy and social) have been improved. Besides, in many cases they have the opportunity to perform activities that previously were not accessible to them, because of the interface and contents of the activities have been adapted specifically to them. The study also suggests that the repertoire of types of activities provided is suitable for learning purposes with students with impairments. Finally, the use of electronic devices and multimedia contents increases their interest in learning and attention. (C) 2012 Elsevier Ltd. All rights reserved.", "paper_title": "Mobile learning technology based on iOS devices to support students with special education needs", "paper_id": "WOS:000312517900007"}