{"auto_keywords": [{"score": 0.04893803343163639, "phrase": "monte_carlo_cross-validation"}, {"score": 0.042350238980492, "phrase": "mcvs_method"}, {"score": 0.00481495049065317, "phrase": "variable_selection"}, {"score": 0.004757227624616643, "phrase": "qsar_models"}, {"score": 0.0046159158660556985, "phrase": "new_variable_selection_wrapper_method"}, {"score": 0.004533142516832776, "phrase": "monte_carlo_variable_selection"}, {"score": 0.003969640975997097, "phrase": "variable_selection_results"}, {"score": 0.0035609154384221567, "phrase": "clear_and_simple_statistical_interpretation"}, {"score": 0.0028477812496266203, "phrase": "mlr"}, {"score": 0.0027298319171606498, "phrase": "new_approach"}, {"score": 0.002508365161206412, "phrase": "acceptably_low_p-values"}, {"score": 0.0024336917123957387, "phrase": "hia_problems"}, {"score": 0.002361236012575149, "phrase": "new_method"}, {"score": 0.0021049977753042253, "phrase": "academic_use"}], "paper_keywords": [""], "paper_abstract": "A new variable selection wrapper method named the Monte Carlo variable selection (MCVS) method was developed utilizing the framework of the Monte Carlo cross-validation (MCCV) approach. The MCVS method reports the variable selection results in the most conventional and common measure of statistical hypothesis testing, the P-values, thus allowing for a clear and simple statistical interpretation of the results. The MCVS method is equally applicable to the multiple-linear-regression (MLR)-based or non-MLR-based quantitative structure-activity relationship (QSAR) models. The method was applied to blood-brain barrier (BBB) permeation and human intestinal absorption (HIA) QSAR problems using MLR to demonstrate the workings of the new approach. Starting from more than 1600 molecular descriptors, only two (TPSA(NO) and ALOGP) yielded acceptably low P-values for the BBB and HIA problems, respectively. The new method has been implemented in the QSAR-BENCH v2 program, which is freely available (including its Java source code) from www.dmitrykonovalov.org for academic use.", "paper_title": "Statistical confidence for variable selection in QSAR models via Monte Carlo cross-validation", "paper_id": "WOS:000253428400014"}