{"auto_keywords": [{"score": 0.05003965534696677, "phrase": "barrier_coverage"}, {"score": 0.03091937528544297, "phrase": "np"}, {"score": 0.0047823219739028325, "phrase": "relocatable_sensors"}, {"score": 0.004467900288375827, "phrase": "line_segments"}, {"score": 0.0038862297330905836, "phrase": "circular_area"}, {"score": 0.0038598702839340794, "phrase": "fixed_range"}, {"score": 0.003357091486708983, "phrase": "largest_relocation_distance"}, {"score": 0.0031899334050985175, "phrase": "relocation_distances"}, {"score": 0.0030414140732789186, "phrase": "arbitrary_positions"}, {"score": 0.0029798924689472014, "phrase": "minmax_problem"}, {"score": 0.0028605468171961457, "phrase": "arbitrary_ranges"}, {"score": 0.0027366287564324966, "phrase": "perpendicular_movement"}, {"score": 0.002547663224855668, "phrase": "polynomial_time"}, {"score": 0.002479150189700726, "phrase": "even_the_feasibility_problem"}, {"score": 0.0023158019935841235, "phrase": "integer_positions"}, {"score": 0.0021705796895687864, "phrase": "natural_special_case"}, {"score": 0.0021484955960643167, "phrase": "last_problem"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Sensor network", " Mobile sensors", " Barrier coverage", " Algorithmic complexity", " NP-completeness"], "paper_abstract": "We consider several variations of the problems of covering a set of barriers (modeled as line segments) using sensors that can detect any intruder crossing any of the barriers. Sensors are initially located in the plane and they can relocate to the barriers. We assume that each sensor can detect any intruder in a circular area of fixed range centered at the sensor. Given a set of barriers and a set of sensors located in the plane, we study three problems: (i) the feasibility of barrier coverage, (ii) the problem of minimizing the largest relocation distance of a sensor (MinMax), and (iii) the problem of minimizing the sum of relocation distances of sensors (MinSum). When sensors are permitted to move to arbitrary positions on the barrier, the MinMax problem is shown to be strongly NP-complete for sensors with arbitrary ranges. We also study the case when sensors are restricted to use perpendicular movement to one of the barriers. We show that when the barriers are parallel, both the MinMax and MinSum problems can be solved in polynomial time. In contrast, we show that even the feasibility problem is strongly NP-complete if two perpendicular barriers are to be covered, even if the sensors are located at integer positions, and have only two possible sensing ranges. On the other hand, we give an O(n(3/2)) algorithm for a natural special case of this last problem. (C) 2015 Elsevier B.V. All rights reserved.", "paper_title": "Complexity of barrier coverage with relocatable sensors in the plane", "paper_id": "WOS:000353856900004"}