{"auto_keywords": [{"score": 0.04815764369669367, "phrase": "rare_variants"}, {"score": 0.010534149596101248, "phrase": "likelihood_ratio_test"}, {"score": 0.00809777516134842, "phrase": "previous_methods"}, {"score": 0.008037925550629677, "phrase": "prior_information"}, {"score": 0.005994400026359016, "phrase": "lrt"}, {"score": 0.00481495049065317, "phrase": "groupwise_association_test"}, {"score": 0.004743806810821005, "phrase": "sequencing_studies"}, {"score": 0.00465634671242413, "phrase": "numerous_number"}, {"score": 0.00443638953122199, "phrase": "disease_susceptibility"}, {"score": 0.004306205029641728, "phrase": "statistical_power"}, {"score": 0.0033801845720347118, "phrase": "causal_variants"}, {"score": 0.0033426036530090205, "phrase": "observed_data"}, {"score": 0.003220315882881027, "phrase": "control_individuals"}, {"score": 0.00269263690712392, "phrase": "higher_power"}, {"score": 0.0025556529150386168, "phrase": "susceptibility_gene"}, {"score": 0.0025366596616434793, "phrase": "ataxia_telangiectasia"}, {"score": 0.0024346858809238766, "phrase": "real_data"}, {"score": 0.002389696110283506, "phrase": "computational_speed"}, {"score": 0.002234491924392106, "phrase": "efficient_permutation_test"}, {"score": 0.0021446391766277817, "phrase": "lrt_statistic"}, {"score": 0.0021049977753042253, "phrase": "genome-wide_level"}], "paper_keywords": ["rare variants", " association studies", " SNPs", " genetics", " statistics"], "paper_abstract": "Sequencing studies have been discovering a numerous number of rare variants, allowing the identification of the effects of rare variants on disease susceptibility. As a method to increase the statistical power of studies on rare variants, several groupwise association tests that group rare variants in genes and detect associations between genes and diseases have been proposed. One major challenge in these methods is to determine which variants are causal in a group, and to overcome this challenge, previous methods used prior information that specifies how likely each variant is causal. Another source of information that can be used to determine causal variants is the observed data because case individuals are likely to have more causal variants than control individuals. In this article, we introduce a likelihood ratio test (LRT) that uses both data and prior information to infer which variants are causal and uses this finding to determine whether a group of variants is involved in a disease. We demonstrate through simulations that LRT achieves higher power than previous methods. We also evaluate our method on mutation screening data of the susceptibility gene for ataxia telangiectasia, and show that LRT can detect an association in real data. To increase the computational speed of our method, we show how we can decompose the computation of LRT, and propose an efficient permutation test. With this optimization, we can efficiently compute an LRT statistic and its significance at a genome-wide level. The software for our method is publicly available at http://genetics.cs.ucla.edu/rarevariants.", "paper_title": "Increasing Power of Groupwise Association Test with Likelihood Ratio Test", "paper_id": "WOS:000296891100018"}