{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "shortest_paths"}, {"score": 0.004756233569671719, "phrase": "graph_orientation_problem"}, {"score": 0.0044549056501745074, "phrase": "pre-specified_source-target_vertex_pairs"}, {"score": 0.004121672175779706, "phrase": "common_preprocessing_step"}, {"score": 0.004038183610525504, "phrase": "input_graph"}, {"score": 0.003751331782523201, "phrase": "algorithmic_perspective"}, {"score": 0.0035861227263414537, "phrase": "contracted_cycles"}, {"score": 0.0034990853199511982, "phrase": "connecting_source-target_paths"}, {"score": 0.00335867620389808, "phrase": "biological_networks"}, {"score": 0.003290591812800382, "phrase": "vertex_pairs"}, {"score": 0.0030441844088874366, "phrase": "source-target_vertex_pairs"}, {"score": 0.0027488952439025344, "phrase": "np"}, {"score": 0.0026482660253173075, "phrase": "sub-polynomial_factors"}, {"score": 0.002583931950389087, "phrase": "first_polynomial-size_integer_linear_program_formulation"}, {"score": 0.0024700078414481297, "phrase": "current_networks"}, {"score": 0.0024001337476063094, "phrase": "protein-protein_interaction_networks"}, {"score": 0.002202123699556382, "phrase": "previous_approaches"}, {"score": 0.0021662983565317283, "phrase": "considerable_parts"}], "paper_keywords": [""], "paper_abstract": "The graph orientation problem calls for orienting the edges of a graph so as to maximize the number of pre-specified source-target vertex pairs that admit a directed path from the source to the target. Most algorithmic approaches to this problem share a common preprocessing step, in which the input graph is reduced to a tree by repeatedly contracting its cycles. Although this reduction is valid from an algorithmic perspective, the assignment of directions to the edges of the contracted cycles becomes arbitrary, and the connecting source-target paths may be arbitrarily long. In the context of biological networks, the connection of vertex pairs via shortest paths is highly motivated, leading to the following problem variant: given a graph and a collection of source-target vertex pairs, assign directions to the edges so as to maximize the number of pairs that are connected by a shortest (in the original graph) directed path. This problem is NP-complete and hard to approximate to within sub-polynomial factors. Here we provide a first polynomial-size integer linear program formulation for this problem, which allows its exact solution in seconds on current networks. We apply our algorithm to orient protein-protein interaction networks in yeast and compare it with two state-of-the-art algorithms. We find that our algorithm outperforms previous approaches and can orient considerable parts of the network, thus revealing its structure and function.", "paper_title": "Network orientation via shortest paths", "paper_id": "WOS:000336530000015"}