{"auto_keywords": [{"score": 0.04383441248529016, "phrase": "chronic_diseases"}, {"score": 0.0045843245695654875, "phrase": "long-term_ax"}, {"score": 0.004424631631964781, "phrase": "mathematical_models"}, {"score": 0.004352807055792728, "phrase": "ax_prescription"}, {"score": 0.0042472410653913335, "phrase": "continuous_prescription"}, {"score": 0.0040880724328903, "phrase": "electronic_prescriptions_database"}, {"score": 0.0038080694145564836, "phrase": "linear_regression_model"}, {"score": 0.0037258211183784397, "phrase": "defined_daily_doses"}, {"score": 0.003461080809857424, "phrase": "logistic_regression_model"}, {"score": 0.003423487658905686, "phrase": "joint_influence"}, {"score": 0.0033955600883170986, "phrase": "explanatory_variables"}, {"score": 0.0033131323758456978, "phrase": "increasingly_high_ddd"}, {"score": 0.0032950876643710087, "phrase": "ax._results"}, {"score": 0.0032682040993565675, "phrase": "mean_annual_ddd"}, {"score": 0.0031975814700041555, "phrase": "ddd"}, {"score": 0.002970260970134645, "phrase": "age_groups"}, {"score": 0.002929968589372435, "phrase": "older_subjects"}, {"score": 0.002882336475814422, "phrase": "prescribed_ddd"}, {"score": 0.002655512148474086, "phrase": "sporadic_ax_prescriptions"}, {"score": 0.0025910025014681368, "phrase": "continuous_use"}, {"score": 0.002535057055544326, "phrase": "ax"}, {"score": 0.0025142763558123836, "phrase": "general_population"}, {"score": 0.0024937472415523395, "phrase": "primary_health_centres"}, {"score": 0.002480154140902474, "phrase": "castellon"}, {"score": 0.002253890480941792, "phrase": "prescribed_ddd."}, {"score": 0.002229380111189829, "phrase": "potentially_addictive_behaviours"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Anxiolytics", " Prescribed drugs", " Drugs use", " Logistic regression", " Mathematical modelling", " Dependence"], "paper_abstract": "Background: Population-based anxiolytics consumption (AX) is a widely debated subject because long-term AX may lead to tolerance and addiction. This study aims to obtain mathematical models that identify the various behaviours in AX prescription in accordance with gender, age and the continuous prescription of other drugs associated with chronic diseases. Methods: Data were obtained from an electronic prescriptions database (n = 12,211,992) received by patients (n = 504,224) visiting the Primary Health Care Centres in the province of Castellon (East Spain) in 2009. A linear regression model was used to explain the number of defined daily doses (DDD) of AX prescribed in accordance with age, gender and more than 5 prescriptions of any drug associated with chronic diseases other than AX. We used the logistic regression model to quantify the joint influence of the explanatory variables on the likelihood (L) of prescribing increasingly high DDD of AX. Results: The mean annual DDD per patient was 133.13, and the DDD prescribed was 38.06 day/1000 inhabitants. Few differences, although significant, in prescriptions per gender were observed; males received fewer prescriptions than females. Conversely, differences in age groups were substantial; the older subjects become, the higher the prescribed DDD, although these differences disappeared after the age of 65. AX use was also positively associated with the presence of comorbidity: depression, psychosis and epilepsy. Sporadic AX prescriptions were not associated with any factor, except continuous use. Conclusions: The prevalence of prescribing AX in the general population visiting the primary health centres in Castellon is over 16%. Prescriptions and the DDD of AX are barely higher for females than for males, and age is the most influential factor; the older the patient, the higher the number of prescribed DDD. The likelihood of potentially addictive behaviours is higher among the elderly and patients with comorbidity, mainly those patients with other chronic psychiatric conditions. (C) 2010 Elsevier Ltd. All rights reserved.", "paper_title": "Modelling the consumption of anxiolytics and its addictive behaviour", "paper_id": "WOS:000293269200002"}