{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "linguistic_resources"}, {"score": 0.007661686798732148, "phrase": "open_data"}, {"score": 0.005795628270932451, "phrase": "heterogeneous_linguistic_resources"}, {"score": 0.004705037720076602, "phrase": "purpose_-_the_purpose"}, {"score": 0.004609435847048543, "phrase": "literature_review"}, {"score": 0.004574085781766281, "phrase": "principal_formats"}, {"score": 0.004390060342250211, "phrase": "special_attention"}, {"score": 0.004322967486451877, "phrase": "linguistic_linked"}, {"score": 0.004075102678078889, "phrase": "linguistic_information"}, {"score": 0.003992249142431506, "phrase": "specific_schemas"}, {"score": 0.0038810583785936505, "phrase": "linguistic_data"}, {"score": 0.0038119123317396954, "phrase": "offline_approaches"}, {"score": 0.00374399358035391, "phrase": "linked_data"}, {"score": 0.0035201528214608914, "phrase": "linguistic_resource"}, {"score": 0.0034485432592912917, "phrase": "interoperability_approach"}, {"score": 0.003413284742632989, "phrase": "related_projects"}, {"score": 0.003233987934322811, "phrase": "ld_initiative"}, {"score": 0.003151939207323674, "phrase": "structural_and_syntactic_issues"}, {"score": 0.003040545635016655, "phrase": "semantic_web_technologies"}, {"score": 0.0030017207229983385, "phrase": "open_issue"}, {"score": 0.002963390095037466, "phrase": "computational_linguistics"}, {"score": 0.0029255474957478474, "phrase": "knowledge_artefacts"}, {"score": 0.0028586409810976367, "phrase": "different_aspects"}, {"score": 0.0026193670580850125, "phrase": "comprehensive_or_all-inclusive_survey"}, {"score": 0.0024000726315182826, "phrase": "practical_implications"}, {"score": 0.002387758958649797, "phrase": "computational_linguists"}, {"score": 0.0023511948097484662, "phrase": "new_developments"}, {"score": 0.0023391313185913165, "phrase": "natural_language_processing"}, {"score": 0.002309242063033298, "phrase": "multilingual_issues"}, {"score": 0.0022738775158524793, "phrase": "semantic_interoperability"}, {"score": 0.0021049977753042253, "phrase": "linked_data_initiative"}], "paper_keywords": ["Linguistics", " Resources", " Internet", " Open access", " Linguistic resources", " Language resources", " Linked data", " Survey", " Semantic interoperability", " Linguistic formats"], "paper_abstract": "Purpose - The purpose of this paper is to provide a literature review of the principal formats and frameworks that have been used in the last 20 years to exchange linguistic resources It aims to give special attention to the most recent approaches to publishing linguistic linked open data on the Web. Design/methodology/approach - Research papers published since 1990 on the use of various formats, standards, frameworks and methods to exchange linguistic information were divided into two main categories: those proposing specific schemas and syntaxes to suit the requirements of a given type of linguistic data (these are referred to as offline approaches), and those adopting the linked data (LD) initiative and the semantic web technologies to support the interoperability of heterogeneous linguistic resources. For each paper, the type of linguistic resource exchanged, the framework/format used, the interoperability approach taken and the related projects were identified. Findings - The information gathered in the survey reflects an increase in recent years in approaches adopting the LD initiative. This is due to the fact that the structural and syntactic issues which arise when addressing the interoperability of linguistic resources can be solved by applying semantic web technologies. What remains an open issue in the field of computational linguistics is the development of knowledge artefacts and mechanisms to support the alignment of the different aspects of linguistic resources in order to guarantee semantic and conceptual interoperability in the linked open data (LOD) cloud. Ontologies have proved to be of great use in achieving this goal. Research limitations/implications - The research presented here is by no means a comprehensive or all-inclusive survey of all existing approaches to the exchange of linguistic resources. Rather, the aim was to highlight, analyze and categorize the most significant advances in the field. Practical implications - This survey has practical implications for computational linguists and for every application requiring new developments in natural language processing. In addition, multilingual issues can be better addressed when semantic interoperability of heterogeneous linguistic resources is achieved. Originality/value - The paper provides a survey of past and present research and developments addressing the interoperability of linguistic resources, including those where the linked data initiative has been adopted.", "paper_title": "A survey on the exchange of linguistic resources Publishing linguistic linked open data on the Web", "paper_id": "WOS:000323238100003"}