{"auto_keywords": [{"score": 0.03776250779112272, "phrase": "lfsr-based_public_key_cryptosystem"}, {"score": 0.00481495049065317, "phrase": "lfsr_sequences"}, {"score": 0.004749106104067268, "phrase": "verifiable_multi-secret_sharing_schemes"}, {"score": 0.0037921662574137535, "phrase": "scheme-i"}, {"score": 0.003757480190200645, "phrase": "scheme-ii._scheme"}, {"score": 0.0036385493850693983, "phrase": "lagrange_interpolating_polynomial"}, {"score": 0.0035397034554202297, "phrase": "lagrange"}, {"score": 0.0031699007757904026, "phrase": "scheme-ii"}, {"score": 0.003083655376444887, "phrase": "lfsr_sequence"}, {"score": 0.0028127163745564777, "phrase": "attack_resistance"}, {"score": 0.002786964045867666, "phrase": "computation_complexity"}, {"score": 0.0026494723416072316, "phrase": "better_performance"}, {"score": 0.002255431275670053, "phrase": "private_key"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Verifiable multi-secret sharing", " LFSR-based public key cryptosystem", " Threshold scheme", " Cryptography"], "paper_abstract": "In verifiable multi-secret sharing schemes (VMSSs), many secrets can be shared but only one share is kept by each user and this share is verifiable by others. In this paper, we propose two secure, efficient, and verifiable (t, n) multi-secret sharing schemes, namely Scheme-I and Scheme-II. Scheme-I is based on the Lagrange interpolating polynomial and the LFSR-based public key cryptosystem. The Lagrange interpolating polynomial is used to split and reconstruct the secrets and the LFSR-based public key cryptosystem is employed to verify the validity of the data. Scheme-II is designed according to the LFSR sequence and the LFSR-based public key cryptosystem. We compare our schemes with the state-of-the-art in terms of attack resistance, computation complexity, and so on, and conclude that our schemes have better performance and incur less computation overhead. Our schemes can effectively detect a variety of forgery or cheating actions to ensure that the recovery of the secrets is secure and creditable, and the length of the private key is only one third of that of others for the same security level. (C) 2012 Elsevier B.V. All rights reserved.", "paper_title": "Verifiable multi-secret sharing based on LFSR sequences", "paper_id": "WOS:000306257500004"}