{"auto_keywords": [{"score": 0.04959970266439947, "phrase": "smoothed_particle_hydrodynamics"}, {"score": 0.04664065222997442, "phrase": "fractional_differentiation"}, {"score": 0.043236008352619086, "phrase": "sph"}, {"score": 0.04141597913207609, "phrase": "high_number"}, {"score": 0.00481495049065317, "phrase": "colliding_flows"}, {"score": 0.004720606036240263, "phrase": "fractional_derivatives"}, {"score": 0.004605258779434384, "phrase": "new_method"}, {"score": 0.004069280130346136, "phrase": "popular_particle-based_approach"}, {"score": 0.0037967593942595233, "phrase": "high_quality_results"}, {"score": 0.003649277504586372, "phrase": "simulated_particles"}, {"score": 0.003455765987713262, "phrase": "proposed_method"}, {"score": 0.002724207384182295, "phrase": "higher_quality_results"}, {"score": 0.002442693254693416, "phrase": "significant_loss"}, {"score": 0.002278856202878812, "phrase": "current_chosen_resolution"}, {"score": 0.0021049977753042253, "phrase": "john_wiley"}], "paper_keywords": ["fluid simulation", " physically based simulation", " fractional derivatives"], "paper_abstract": "We propose a new method based on the use of fractional differentiation for improving the efficiency and realism of simulations based on smoothed particle hydrodynamics (SPH). SPH represents a popular particle-based approach for fluid simulation and a high number of particles is typically needed for achieving high quality results. However, as the number of simulated particles increase, the speed of computation degrades accordingly. The proposed method employs fractional differentiation to improve the results obtained with SPH in a given resolution. The approach is based on the observation that effects requiring a high number of particles are most often produced from colliding flows, and therefore, when the modeling of this behavior is improved, higher quality results can be achieved without changing the number of particles being simulated. Our method can be employed to reduce the resolution without significant loss of quality, or to improve the quality of the simulation in the current chosen resolution. The advantages of our method are demonstrated with several quantitative evaluations. Copyright (c) 2013 John Wiley & Sons, Ltd.", "paper_title": "Simulating colliding flows in smoothed particle hydrodynamics with fractional derivatives", "paper_id": "WOS:000325976300006"}