{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "distributed_agent"}, {"score": 0.004720792132470776, "phrase": "uncertain_signals"}, {"score": 0.004689815048273592, "phrase": "costly_exploration"}, {"score": 0.00458297991625839, "phrase": "information_broker"}, {"score": 0.00446384610114756, "phrase": "potential_value"}, {"score": 0.00436213603647063, "phrase": "information_signal"}, {"score": 0.004084074821242058, "phrase": "candidate_agents"}, {"score": 0.00390000531646629, "phrase": "true_unknown_utility"}, {"score": 0.003675437054650504, "phrase": "information_brokers"}, {"score": 0.0033625148111740984, "phrase": "noisy_signals"}, {"score": 0.0033184711049370425, "phrase": "true_value"}, {"score": 0.003210861212842534, "phrase": "equilibrium_behavior"}, {"score": 0.00313761080323105, "phrase": "monopolist_expert"}, {"score": 0.0030559337757849634, "phrase": "revenue_maximizing_strategy"}, {"score": 0.0029960701622407924, "phrase": "first_mover"}, {"score": 0.002966578246443101, "phrase": "stackelberg_game"}, {"score": 0.00289888453546698, "phrase": "better_information"}, {"score": 0.0026959995147791188, "phrase": "individual_agents'_utilities"}, {"score": 0.0026782730431380913, "phrase": "overall_social_welfare"}, {"score": 0.002643168068896905, "phrase": "one-sided_search"}, {"score": 0.002324055400492893, "phrase": "equilibrium_outcome"}, {"score": 0.0021049977753042253, "phrase": "market_designers"}], "paper_keywords": ["Multi-agent systems", " Distributed matching", " Information brokers"], "paper_abstract": "In this paper we study distributed agent matching in environments characterized by uncertain signals, costly exploration, and the presence of an information broker. Each agent receives information about the potential value of matching with others. This information signal may, however, be noisy, and the agent incurs some cost in receiving it. If all candidate agents agree to the matching the team is formed and each agent receives the true unknown utility of the matching, and leaves the market. We consider the effect of the presence of information brokers, or experts, on the outcomes of such matching processes. Experts can, upon payment of either a fee or a commission, perform the service of disambiguating noisy signals and revealing the true value of a match to any agent. We analyze equilibrium behavior given the fee set by a monopolist expert and use this analysis to derive the revenue maximizing strategy for the expert as the first mover in a Stackelberg game. Interestingly, we find that better information can hurt: the presence of the expert, even if the use of her services is optional, can degrade both individual agents' utilities and overall social welfare. While in one-sided search the presence of the expert can only help, in two-sided (and general -sided) search the externality imposed by the fact that others are consulting the expert can lead to a situation where the equilibrium outcome is that everyone consults the expert, even though all agents would be better off if the expert were not present. As an antidote, we show how market designers can enhance welfare by compensating the expert to change the price at which she offers her services.", "paper_title": "Two-sided search with experts", "paper_id": "WOS:000352641600002"}