{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "multibubble_nuclei"}, {"score": 0.004637478829869904, "phrase": "molecular_dynamics_codes"}, {"score": 0.004534136929881113, "phrase": "short-range_interaction_potential"}, {"score": 0.004081385289516914, "phrase": "full_domain_decomposition_strategy"}, {"score": 0.0031606404966938568, "phrase": "cavitation_processes"}, {"score": 0.002678433668156676, "phrase": "ostwald-like_ripening"}, {"score": 0.0024842242921857705, "phrase": "direct_simulations"}, {"score": 0.002447101794397243, "phrase": "multiscale_phenomena"}, {"score": 0.0024105326885334962, "phrase": "phase_transitions"}, {"score": 0.0023566987138026285, "phrase": "atomic_scale"}, {"score": 0.002252602622785975, "phrase": "molecular_dynamics_method"}, {"score": 0.0022022878843247257, "phrase": "promising_method"}, {"score": 0.0021049977753042253, "phrase": "petascale_computers"}], "paper_keywords": ["Hybrid MPI plus OpenMP programming", " Molecular dynamics method"], "paper_abstract": "We have developed molecular dynamics codes for a short-range interaction potential that adopt both the flat-MPI and MPI/OpenMP hybrid parallelizations on the basis of a full domain decomposition strategy. Benchmark simulations involving up to 38.4 billion Lennard-Jones particles were performed on Fujitsu PRIMEHPC FX10, consisting of 4800 SPARC64 IXfx 1.848 GHz processors, at the Information Technology Center of the University of Tokyo, and a performance of 193 teraflops was achieved, which corresponds to a 17.0% execution efficiency. Cavitation processes were also simulated on PRIMEHPC FX10 and SGI Altix ICE 8400EX at the Institute of Solid State Physics of the University of Tokyo, which involved 1.45 billion and 22.9 million particles, respectively. Ostwald-like ripening was observed after the multibubble nuclei. Our results demonstrate that direct simulations of multiscale phenomena involving phase transitions from the atomic scale are possible and that the molecular dynamics method is a promising method that can be applied to petascale computers. (C) 2013 ElSevier B.V. All rights reserved.", "paper_title": "Huge-scale molecular dynamics simulation of multibubble nuclei", "paper_id": "WOS:000328725200017"}