{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "extended_subwords"}, {"score": 0.015579192279283836, "phrase": "matrix_register_file"}, {"score": 0.013172180023187808, "phrase": "mrf"}, {"score": 0.012330193047140163, "phrase": "register_file"}, {"score": 0.011199735813423506, "phrase": "matrix_transposition"}, {"score": 0.00823771135542346, "phrase": "sad_instruction"}, {"score": 0.004518442937844318, "phrase": "existing_simd_architectures"}, {"score": 0.004151188559520802, "phrase": "media_register_file"}, {"score": 0.004064117897000019, "phrase": "data-type_conversion_instructions"}, {"score": 0.003990935112773993, "phrase": "register_file_organization"}, {"score": 0.0035894592199604246, "phrase": "corresponding_subwords"}, {"score": 0.0035677736570659813, "phrase": "different_registers"}, {"score": 0.0033579708256295847, "phrase": "multimedia_applications"}, {"score": 0.0029926343123778056, "phrase": "efficient_access"}, {"score": 0.00297454367746853, "phrase": "strided_data"}, {"score": 0.0027995277077618604, "phrase": "special-purpose_instructions"}, {"score": 0.002383825621519496, "phrase": "quarter-pixel_resolution"}, {"score": 0.0023622296334998324, "phrase": "cost_functions"}, {"score": 0.002326669201839705, "phrase": "video_retrieval"}, {"score": 0.0022777800735119405, "phrase": "simplescalar_toolset_show"}, {"score": 0.0022571426190350157, "phrase": "proposed_techniques"}, {"score": 0.002203016940021265, "phrase": "mmx_architecture"}, {"score": 0.0021049977753042253, "phrase": "additional_performance_improvement"}], "paper_keywords": ["design", " performance", " SIMD architectures", " SIMD programming", " multimedia standards"], "paper_abstract": "Extended subwords and the matrix register file (MRF) are two micro architectural techniques that address some of the limitations of existing SIMD architectures. Extended subwords are wider than the data stored in memory. Specifically, for every byte of data stored in memory, there are four extra bits in the media register file. This avoids the need for data-type conversion instructions. The MRF is a register file organization that provides both conventional row-wise, as well as column-wise, access to the register file. In other words, it allows to view the register file as a matrix in which corresponding subwords in different registers corresponds to a column of the matrix. It was introduced to accelerate matrix transposition which is a very common operation in multimedia applications. In this paper, we show that the MRF is very versatile, since it can also be used for other permutations than matrix transposition. Specifically, it is shown how it can be used to provide efficient access to strided data, as is needed in, e. g., color space conversion. Furthermore, it is shown that special-purpose instructions (SPIs), such as the sum-of-absolute differences ( SAD) instruction, have limited usefulness when extended subwords and a few general SIMD instructions that we propose are supported, for the following reasons. First, when extended subwords are supported, the SAD instruction provides only a relatively small performance improvement. Second, the SAD instruction processes 8-bit subwords only, which is not sufficient for quarter-pixel resolution nor for cost functions used in image and video retrieval. Results obtained by extending the SimpleScalar toolset show that the proposed techniques provide a speedup of up to 3.00 over the MMX architecture. The results also show that using, at most, 13 extra media registers yields an additional performance improvement ranging from 1.38 to 1.57.", "paper_title": "Versatility of extended subwords and the matrix register file", "paper_id": "WOS:000256753500005"}