{"auto_keywords": [{"score": 0.04097787873815007, "phrase": "global_state"}, {"score": 0.00481495049065317, "phrase": "asymmetric_memory_fences"}, {"score": 0.004303830426772906, "phrase": "post-fence_accesses"}, {"score": 0.004007083686875716, "phrase": "implementation_difficulties"}, {"score": 0.003807684498435389, "phrase": "paper's_goal"}, {"score": 0.0031682817605340028, "phrase": "concurrent_execution"}, {"score": 0.0031360786664165093, "phrase": "multiple_wfs"}, {"score": 0.0029951555610569225, "phrase": "conventional_fence"}, {"score": 0.0025826247025542213, "phrase": "asymmetric_fence_groups"}, {"score": 0.00235560370536971, "phrase": "higher_average_performance"}, {"score": 0.0022382035805230825, "phrase": "tso"}, {"score": 0.0021049977753042253, "phrase": "conventional_fences"}], "paper_keywords": ["Fences", " Sequential Consistency", " Synchronization", " Parallel Programming", " Shared-Memory Machines"], "paper_abstract": "There have been several recent efforts to improve the performance of fences. The most aggressive designs allow post-fence accesses to retire and complete before the fence completes. Unfortunately, such designs present implementation difficulties due to their reliance on global state and structures. This paper's goal is to optimize both the performance and the implementability of fences. We start-off with a design like the most aggressive ones but without the global state. We call it Weak Fence or wF. Since the concurrent execution of multiple wFs can deadlock, we combine wFs with a conventional fence (i.e., Strong Fence or sF) for the less performance-critical thread(s). We call the result an Asymmetric fence group. We also propose a taxonomy of Asymmetric fence groups under TSO. Compared to past aggressive fences, Asymmetric fence groups both are substantially easier to implement and have higher average performance. The two main designs presented (WS+ and W+) speed-up workloads under TSO by an average of 13% and 21%, respectively, over conventional fences.", "paper_title": "Asymmetric Memory Fences: Optimizing Both Performance and Implementability", "paper_id": "WOS:000370874900037"}