{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "computational_tool"}, {"score": 0.004251728624599691, "phrase": "critical_process"}, {"score": 0.004121490798711703, "phrase": "experimental_methods"}, {"score": 0.0040309035566691645, "phrase": "metabolic_stability"}, {"score": 0.0038900709793274484, "phrase": "higher_throughput_predictive_methods"}, {"score": 0.0036715973701254823, "phrase": "chemical_nature"}, {"score": 0.0035118972210075633, "phrase": "safer_drugs"}, {"score": 0.003449972561293443, "phrase": "modulated_half-lives"}, {"score": 0.0032561349010603734, "phrase": "activated_cytochromes"}, {"score": 0.0031006232333900055, "phrase": "metabolic_enzymes"}, {"score": 0.00258347644721642, "phrase": "experts'_predictions"}, {"score": 0.0025156869352677296, "phrase": "impacts"}, {"score": 0.002482013330276732, "phrase": "experimentally_observed_som"}, {"score": 0.00233202607446404, "phrase": "biotransformation_experts'_prediction"}, {"score": 0.002250415129116109, "phrase": "external_sets"}, {"score": 0.0021716540012278744, "phrase": "eleven_other_methods"}, {"score": 0.0021049977753042253, "phrase": "impacts."}], "paper_keywords": [""], "paper_abstract": "The metabolism of xenobiotics-and more specifically-drugs in the liver is a critical process controlling their half-life. Although there exist experimental methods, which measure the metabolic stability of xenobiotics and identify their metabolites, developing higher throughput predictive methods is an avenue of research. It is expected that predicting the chemical nature of the metabolites would be an asset for designing safer drugs and/or drugs with modulated half-lives. We have developed IMPACTS (In-silico Metabolism Prediction by Activated Cytochromes and Transition States), a computational tool combining docking to metabolic enzymes, transition state modeling, and rule-based substrate reactivity prediction to predict the site of metabolism (SoM) of xenobiotics. Its application to sets of CYP1A2, CYP2C9, CYP2D6, and CYP3A4 substrates and comparison to experts' predictions demonstrates its accuracy and significance. IMPACTS identified an experimentally observed SoM in the top 2 predicted sites for 77% of the substrates, while the accuracy of biotransformation experts' prediction was 65%. Application of IMPACTS to external sets and comparison of its accuracy to those of eleven other methods further validated the method implemented in IMPACTS.", "paper_title": "Development of a Computational Tool to Rival Experts in the Prediction of Sites of Metabolism of Xenobiotics by P450s", "paper_id": "WOS:000308958400015"}