{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "embedded_systems"}, {"score": 0.04597768843054382, "phrase": "concurrency_faults"}, {"score": 0.004645959941491617, "phrase": "frequent_use"}, {"score": 0.004229927464182562, "phrase": "device_drivers"}, {"score": 0.004173603566828364, "phrase": "interrupt_handlers"}, {"score": 0.0036173729405604674, "phrase": "execution_interleavings"}, {"score": 0.003505908076430666, "phrase": "observable_incorrect_output"}, {"score": 0.003149094460617212, "phrase": "test_engineers"}, {"score": 0.002729029534060092, "phrase": "observable_incorrect_outputs"}, {"score": 0.002506562885555113, "phrase": "subtle_and_non-deterministic_concurrency_faults"}, {"score": 0.0023437863565921053, "phrase": "commercial_virtual_platform"}, {"score": 0.0021049977753042253, "phrase": "data_races"}], "paper_keywords": ["Reliability", " Experimentation", " Languages", " Testing", " Concurrency", " Kernels", " Device Drivers"], "paper_abstract": "In software for embedded systems, the frequent use of interrupts for timing, sensing, and I/O processing can cause concurrency faults to occur due to interactions between applications, device drivers, and interrupt handlers. This type of fault is considered by many practitioners to be among the most difficult to detect, isolate, and correct, in part because it can be sensitive to execution interleavings and often occurs without leaving any observable incorrect output. As such, commonly used testing techniques that inspect program outputs to detect failures are often ineffective at detecting them. To test for these concurrency faults, test engineers need to be able to control interleavings so that they are deterministic. Furthermore, they also need to be able to observe faults as they occur instead of relying on observable incorrect outputs. In this paper, we introduce SimTester, a framework that allows engineers to effectively test for subtle and non-deterministic concurrency faults by providing them with greater controllability and observability. We implemented our framework on a commercial virtual platform that is widely used to support hardware/software co-designs to promote ease of adoption. We then evaluated its effectiveness by using it to test for data races and deadlocks. The result shows that our framework can be effective and efficient at detecting these faults.", "paper_title": "SimTester: A Controllable and Observable Testing Framework for Embedded Systems", "paper_id": "WOS:000308657200006"}