{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "nonoriented_shapes"}, {"score": 0.004782587436296574, "phrase": "diffeomorphic_registration"}, {"score": 0.004322333439660409, "phrase": "computational_anatomy"}, {"score": 0.004122911675081472, "phrase": "wide_variety"}, {"score": 0.003932654396285872, "phrase": "fundamental_issue"}, {"score": 0.0036759314172445934, "phrase": "acute_pikes"}, {"score": 0.0034944094552943, "phrase": "fiber_bundles"}, {"score": 0.0034243271052114234, "phrase": "consistent_orientation"}, {"score": 0.003344332868248692, "phrase": "promising_alternative"}, {"score": 0.0032223742018434856, "phrase": "geometric_measure"}, {"score": 0.003189905202734067, "phrase": "almgren"}, {"score": 0.003115354317501177, "phrase": "nonoriented_manifold"}, {"score": 0.002921682548018944, "phrase": "numerically_nonoriented_objects"}, {"score": 0.002853396755102163, "phrase": "continuous_points"}, {"score": 0.002758597251689795, "phrase": "hilbert_space_structure"}, {"score": 0.00257831812581194, "phrase": "currents'_setting"}, {"score": 0.0025180372061991206, "phrase": "shape_volume"}, {"score": 0.0022370795358896784, "phrase": "registration_algorithms"}, {"score": 0.002199582070223336, "phrase": "large_deformation_diffeomorphic_metric_mapping"}, {"score": 0.0021049977753042253, "phrase": "last_part"}], "paper_keywords": ["varifolds", " shape analysis", " large deformation registration", " geometric measure theory", " reproducing kernels"], "paper_abstract": "In this paper, we address the problem of orientation that naturally arises when representing shapes such as curves or surfaces as currents. In the field of computational anatomy, the framework of currents has indeed proved very efficient in modeling a wide variety of shapes. However, in such approaches, orientation of shapes is a fundamental issue that can lead to several drawbacks in treating certain kinds of datasets. More specifically, problems occur with structures like acute pikes because of canceling effects of currents or with data that consists in many disconnected pieces like fiber bundles for which currents require a consistent orientation of all pieces. As a promising alternative to currents, varifolds, introduced in the context of geometric measure theory by Almgren, allow the representation of any nonoriented manifold (more generally any nonoriented rectifiable set). In particular, we explain how varifolds can encode numerically nonoriented objects both from the discrete and the continuous points of view. We show various ways to build a Hilbert space structure on the set of varifolds based on the theory of reproducing kernels. We show that, unlike the currents' setting, these metrics are consistent with shape volume (Theorem 4.1), and we derive a formula for the variation of metrics with respect to the shape (Theorem 4.2). Finally, we propose a generalization to nonoriented shapes of registration algorithms in the context of large deformation diffeomorphic metric mapping (LDDMM), which we detail with a few examples in the last part of the paper.", "paper_title": "The Varifold Representation of Nonoriented Shapes for Diffeomorphic Registration", "paper_id": "WOS:000328890700025"}