{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "particle_level"}, {"score": 0.004795200895225848, "phrase": "set_method"}, {"score": 0.004256243266481051, "phrase": "novel_approach"}, {"score": 0.003824547895167011, "phrase": "differing_viscosities"}, {"score": 0.0037621210719690594, "phrase": "viscoelastic_properties"}, {"score": 0.0035079364710988627, "phrase": "simple_surface_tension_forces"}, {"score": 0.003244050414264445, "phrase": "separate_particle_level"}, {"score": 0.0031132086055691214, "phrase": "novel_projection_algorithm"}, {"score": 0.0030623570435946977, "phrase": "resulting_vector"}, {"score": 0.0030247625535682987, "phrase": "set_values"}, {"score": 0.002890810475014827, "phrase": "standard_single-valued_level"}, {"score": 0.002831894638104635, "phrase": "additional_difficulty"}, {"score": 0.002618730478351454, "phrase": "region_boundaries"}, {"score": 0.0024416087858984644, "phrase": "ghost_values"}, {"score": 0.002323826502178581, "phrase": "new_paradigm"}, {"score": 0.0022670785913397637, "phrase": "physical_jump_conditions"}, {"score": 0.0021311850321045767, "phrase": "multiple_regions"}, {"score": 0.0021049977753042253, "phrase": "triple_points"}], "paper_keywords": ["multiphase fluids", " liquids", " gases", " level sets"], "paper_abstract": "The particle level set method has proven successful for the simulation of two separate regions ( such as water and air, or fuel and products). In this paper, we propose a novel approach to extend this method to the simulation of as many regions as desired. The various regions can be liquids ( or gases) of any type with differing viscosities, densities, viscoelastic properties, etc. We also propose techniques for simulating interactions between materials, whether it be simple surface tension forces or more complex chemical reactions with one material converting to another or two materials combining to form a third. We use a separate particle level set method for each region, and propose a novel projection algorithm that decodes the resulting vector of level set values providing a \"dictionary\" that translates between them and the standard single-valued level set representation. An additional difficulty occurs since discretization stencils ( for interpolation, tracing semi-Lagrangian rays, etc.) cross region boundaries naively combining non-smooth or even discontinuous data. This has recently been addressed via ghost values, e.g. for fire or bubbles. We instead propose a new paradigm that allows one to incorporate physical jump conditions in data \"on the fly,\" which is significantly more efficient for multiple regions especially at triple points or near boundaries with solids.", "paper_title": "Multiple interacting liquids", "paper_id": "WOS:000239817400041"}