{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "high-profile_internet_outages"}, {"score": 0.004655531868142323, "phrase": "bogus_routing_information"}, {"score": 0.004307411440222079, "phrase": "key_protocols"}, {"score": 0.004068711803266216, "phrase": "traffic-attraction_attacks"}, {"score": 0.0034022512471548754, "phrase": "secure_protocol"}, {"score": 0.0033497184946413754, "phrase": "empirically-determined_as-level_topology"}, {"score": 0.0032302647179383915, "phrase": "advanced_security_solution"}, {"score": 0.0031969216992345974, "phrase": "data-plane_verification"}, {"score": 0.003003946660366632, "phrase": "counterintuitive_strategies"}, {"score": 0.0029729327450186945, "phrase": "longer_paths"}, {"score": 0.002911859411750042, "phrase": "bgp_loop-detection"}, {"score": 0.0028594473715753336, "phrase": "even_more_traffic"}, {"score": 0.0027862007429965193, "phrase": "counterintuitive_examples"}, {"score": 0.0026728783066296813, "phrase": "empirical_as-level_topology"}, {"score": 0.0025453016832020247, "phrase": "np"}, {"score": 0.0025114562778824003, "phrase": "traffic-attraction_attack_strategy"}, {"score": 0.0024855143489864976, "phrase": "maximum_volume"}, {"score": 0.00243442966458809, "phrase": "clever_export_policy"}, {"score": 0.0023782103338224696, "phrase": "legitimate_path"}, {"score": 0.002305260942304735, "phrase": "almost_as_much_traffic"}, {"score": 0.0022873751378897364, "phrase": "bogus_path_announcement"}, {"score": 0.0022345441935094023, "phrase": "police_export_policies"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Security", " Interdomain routing", " BGP"], "paper_abstract": "In response to high-profile Internet outages, BGP security variants have been proposed to prevent the propagation of bogus routing information. The objective of this paper is to inform discussions of which variant should be deployed in the Internet. To do this, we quantify the ability of the key protocols (origin authentication, soBGP, S-BGP, and data-plane verification) to limit the impact of traffic-attraction attacks; i.e., when an attacker deliberately draws traffic to its own network, in order to drop, tamper, or eavesdrop on packets. Our results and contributions are as follows: (1) One might expect that an attacker could maximize the volume of traffic it attracts by using the following intuitive strategy: the attacker should announce, to as many of its neighbors as possible, the shortest path that is not flagged as bogus by the secure protocol. Through simulations on an empirically-determined AS-level topology, we show that this strategy is surprisingly effective, even when an advanced security solution like S-BGP or data-plane verification is fully deployed. (2) Next, we show that these results underestimate the severity of attacks. In fact, counterintuitive strategies, like announcing longer paths, announcing to fewer neighbors, or triggering BGP loop-detection, can be used to attract even more traffic than the strategy above. We illustrate this using counterintuitive examples. We also demonstrate that these attacks are not merely hypothetical, by searching the empirical AS-level topology and identifying specific ASes that can launch these attacks. (3) We prove that it is NP hard to find a traffic-attraction attack strategy that attracts the maximum volume of traffic. Our results suggest that a clever export policy (i.e., where the attacker announces a legitimate path to a carefully chosen set of neighbors) an often attract almost as much traffic as a bogus path announcement. Thus, our work implies that mechanisms that police export policies (e.g., prefix filtering) are crucial, even if more advanced cryptographic solutions like S-BGP are fully deployed. (C) 2014 Elsevier B.V. All rights reserved.", "paper_title": "How secure are secure interdomain routing protocols?", "paper_id": "WOS:000340693000017"}