{"auto_keywords": [{"score": 0.04572074988236009, "phrase": "ic_synthesis"}, {"score": 0.01651842138606809, "phrase": "isac"}, {"score": 0.004611108249179507, "phrase": "economical_cooling"}, {"score": 0.004473552224535518, "phrase": "thermal_analysis"}, {"score": 0.0042656009036320585, "phrase": "accurate_three-dimensional_chip-package_heat_flow_analysis"}, {"score": 0.003980191398041843, "phrase": "numerous_repeated_applications"}, {"score": 0.0038781372962808894, "phrase": "thermal_analysis_techniques"}, {"score": 0.0032331613500559764, "phrase": "ic_temperature_variation"}, {"score": 0.0030693625816617044, "phrase": "spatial-_and_temporal-modeling_granularities"}, {"score": 0.002888692115811987, "phrase": "proposed_heterogeneous_spatial-resolution_adaptation"}, {"score": 0.002863762666256937, "phrase": "asynchronous_thermal-element_time-marching_techniques"}, {"score": 0.002387083859537412, "phrase": "inner_loops"}, {"score": 0.0023664730217196252, "phrase": "ic_synthesis_algorithms"}, {"score": 0.0022957232752482196, "phrase": "reliable_commercial_thermal_analysis_tools"}, {"score": 0.0022758994740331258, "phrase": "industrial_and_academic_synthesis_test_cases"}, {"score": 0.002169882514603539, "phrase": "software_package"}, {"score": 0.0021049977753042253, "phrase": "design_flows"}], "paper_keywords": ["circuit simulation", " high-level synthesis", " integrated circuit thermal factors"], "paper_abstract": "Ever-increasing integrated circuit (IC) power densities and peak temperatures threaten reliability, performance, and economical cooling. To address these challenges, thermal analysis must be embedded within IC synthesis. However, this requires accurate three-dimensional chip-package heat flow analysis. This has typically been based on numerical methods that are too computationally intensive for numerous repeated applications during synthesis or design. Thermal analysis techniques must be both accurate and fast for use in IC synthesis. This paper presents a novel accurate incremental spatially and temporally adaptive chip-package thermal analysis technique called ISAC for use in IC synthesis and design. It is common for IC temperature variation to strongly depend on position and time. ISAC dynamically adapts spatial- and temporal-modeling granularities to achieve high efficiency while maintaining accuracy. Both steady-state and dynamic thermal analyses are accelerated by the proposed heterogeneous spatial-resolution adaptation and asynchronous thermal-element time-marching techniques. Each technique enables orders-of-magnitude improvement in performance while preserving accuracy when compared with other state-of-the-art adaptive steady-state and dynamic IC thermal analysis techniques. Experimental results indicate that these improvements are sufficient to make accurate dynamic and steady-state thermal analysis practical within the inner loops of IC synthesis algorithms. ISAC has been validated against reliable commercial thermal analysis tools using industrial and academic synthesis test cases and chip designs. It has been implemented as a software package suitable for integration in IC synthesis and design flows and has been publicly released.", "paper_title": "ISAC: Integrated space-and-time-adaptive chip-package thermal analysis", "paper_id": "WOS:000243280000008"}