{"auto_keywords": [{"score": 0.0500781036531966, "phrase": "quantum_sequential_machines"}, {"score": 0.0410442359566519, "phrase": "gudder"}, {"score": 0.03943465071785182, "phrase": "open_problem"}, {"score": 0.03750811134349466, "phrase": "qiu"}, {"score": 0.004619295212985837, "phrase": "quantum_variant"}, {"score": 0.004587464246981363, "phrase": "stochastic_sequential_machines"}, {"score": 0.004462308985053246, "phrase": "important_quantum_computing_models"}, {"score": 0.004266141613620429, "phrase": "'_states"}, {"score": 0.0032569835069392924, "phrase": "sufficient_and_necessary_conditions"}, {"score": 0.002835703398546821, "phrase": "sufficient_and_necessary_condition"}, {"score": 0.0023034836169432233, "phrase": "basic_result"}, {"score": 0.002217326282120832, "phrase": "strongly_factorizable_qsms"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v._all_rights"}], "paper_keywords": ["quantum computation", " stochastic sequential machines", " quantum sequential machines", " equivalence"], "paper_abstract": "Quantum sequential machines (QSMs) that may be viewed as a quantum variant of stochastic sequential machines (SSMs) are one of the important quantum computing models. A very crucial result on SSMs is that two SSMs with n and n' states, respectively, and the same input and output alphabets are equivalent if and only if they are (n + n' - 1)-equivalent. Therefore, Gudder asked whether or not it holds for QSMs, as an open problem in this direction, since the further study is closely related to this result. Qiu demonstrated that in QSMs this result does not hold, and therefore answered in part the problem. However, as Qiu indicated, the sufficient and necessary conditions for the equivalence between two QSMs are still not discovered. In this paper, we show that if the condition of (n + n' - 1) -equivalence is appropriately relaxed, then we can give a sufficient and necessary condition for justifying the equivalence between two QSMs. More precisely, we show that any two QSMs M and M' are equivalent if and only if they are (n + n')(2)-equivalent, where n and n' are, respectively, the numbers of states in M and M'. We therefore solve the open problem suggested by Gudder, and provide a basic result for further developing QSMs. As well, we discuss strongly factorizable QSMs and present the conditions for the equivalence between two strongly factorizable QSMs. (C) 2006 Elsevier B.V. All rights reserved.", "paper_title": "Determination of equivalence between quantum sequential machines", "paper_id": "WOS:000239748300007"}