{"auto_keywords": [{"score": 0.049264999038697084, "phrase": "clinical_depression"}, {"score": 0.015719716506582538, "phrase": "electronic_medical_records"}, {"score": 0.004508515162768118, "phrase": "large_health_organization"}, {"score": 0.004381413067286347, "phrase": "massachusetts_general_hospital_emr_system"}, {"score": 0.00428230507124341, "phrase": "primary_care_patients"}, {"score": 0.004233591368742499, "phrase": "primary_care_clinic"}, {"score": 0.004055779248961644, "phrase": "emr_database"}, {"score": 0.00397536514777614, "phrase": "medication_list"}, {"score": 0.003863235056582662, "phrase": "primary_care_physician"}, {"score": 0.003786624022366719, "phrase": "written_questionnaire"}, {"score": 0.0036587957867952456, "phrase": "positive_predictive_value"}, {"score": 0.003637913064193312, "phrase": "negative_predictive_value"}, {"score": 0.0035555630508414954, "phrase": "characteristic_curve"}, {"score": 0.0032073835392641627, "phrase": "patients'_diagnosis"}, {"score": 0.0030725394664628475, "phrase": "highest_sensitivity"}, {"score": 0.0030549925653548826, "phrase": "highest_auc"}, {"score": 0.002860243381361729, "phrase": "\"billing_diagnosis"}, {"score": 0.0026778756903447073, "phrase": "moderate_accuracy"}, {"score": 0.002632239585404421, "phrase": "specific_emr_fields"}, {"score": 0.0025725958296777, "phrase": "pcp_assessment"}, {"score": 0.002536004981903211, "phrase": "emr_system"}, {"score": 0.0024856483031965118, "phrase": "physician_response_rate"}, {"score": 0.002367467366291158, "phrase": "administrative_and_clinical_purposes"}, {"score": 0.0023404848520465543, "phrase": "administrative_and_clinical_data"}, {"score": 0.0023271088673899403, "phrase": "mental_health_studies"}, {"score": 0.0022613643303996383, "phrase": "specific_fields"}, {"score": 0.0021415125224387914, "phrase": "clinical_diagnoses"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ireland_ltd."}], "paper_keywords": ["Depression", " Electronic medical records", " Clinical research methods"], "paper_abstract": "Objective: To investigate the validity of using electronic medical records (EMR) database in a large health organization for identifying patients with clinical depression. Method: The Massachusetts General Hospital EMR system was used to generate a sample of primary care patients seen in the primary care clinic in 2007. Using this sample, the validity of using certain fields in the EMR database (i.e., billing diagnosis, problem list, and medication list) to identify patients with clinical depression was compared to primary care physician (PCP) assessment by a written questionnaire. Based on this standard, the sensitivity, specificity, positive predictive value, negative predictive value, and the areas under receiver operating characteristic curve (AUC) of three specific EMR fields - individually and in combination - were calculated to identify which EMR field best predicted PCP classification. Results: The EMR fields \"billing diagnosis\", \"problem list\" and antidepressant in \"medication list\", were all able to identify patients' diagnosis of depression by their PCPs reasonably well. Having one or more \"billing diagnosis\" of depression had the highest sensitivity and highest AUC (77% sensitivity, 76% specificity, AUC 0.77) among any of the fields used alone. Conclusion: The AUC for \"billing diagnosis\" of depression performed the best of the three single fields tested, with an AUC of 0.77, corresponding to a test with moderate accuracy. This analysis demonstrates that specific EMR fields can be used as a proxy for PCP assessment of depression for this EMR system. Limitations to our analysis include the physician response rate to our survey as well as the quality of the data, which is collected primarily for administrative and clinical purposes. When using administrative and clinical data in mental health studies, researchers must first assess the accuracy of choosing specific fields within their EMR system in order to determine the level of accuracy for them to be used as proxies for clinical diagnoses. (C) 2011 Elsevier Ireland Ltd. All rights reserved.", "paper_title": "Using electronic medical records to determine the diagnosis of clinical depression", "paper_id": "WOS:000291047400008"}