{"auto_keywords": [{"score": 0.020546738665129856, "phrase": "fetal_facial_surface"}, {"score": 0.008735510406954975, "phrase": "offline_process"}, {"score": 0.00827835957041244, "phrase": "oral_cavity"}, {"score": 0.005399094560668524, "phrase": "location_accuracy"}, {"score": 0.00481495311281524, "phrase": "airways"}, {"score": 0.004718509350356246, "phrase": "novel_cones'_phantom"}, {"score": 0.004608422081389008, "phrase": "automatic_navigation_system"}, {"score": 0.004577440795549049, "phrase": "fetoscopic_tracheal_occlusion"}, {"score": 0.004013098289856805, "phrase": "proposed_approach"}, {"score": 0.003255189076644247, "phrase": "online_process"}, {"score": 0.0032006810120751524, "phrase": "mother's_body"}, {"score": 0.002509541181962613, "phrase": "mean_tre"}, {"score": 0.0023455000216532802, "phrase": "location_errors"}, {"score": 0.0021049977753042253, "phrase": "feto_surgery"}], "paper_keywords": ["3D location", " fetal oral cavity and airways", " 3D ultrasound calibration", " iterative closest point algorithm", " 3D fetal model", " 3D electromagnetic tracking device"], "paper_abstract": "Toward the actualization of an automatic navigation system for fetoscopic tracheal occlusion (FETO) surgery, this paper proposes a 3D ultrasound (US) calibration-based approach that can locate the fetal facial surface, oral cavity, and airways by a registration between a 3D fetal model and 3D US images. The proposed approach consists of an offline process and online process. The offline process first reconstructs the 3D fetal model with the anatomies of the oral cavity and airways. Then, a point-based 3D US calibration system based on real-time 3D US images, an electromagnetic (EM) tracking device, and a novel cones' phantom, computes the matrix that transforms the 3D US image space into the world coordinate system. In the online process, by scanning the mother's body with a 3D US probe, 3D US images containing the fetus are obtained. The fetal facial surface extracted from the 3D US images is registered to the 3D fetal model using an ICP-based (iterative closest point) algorithm and the calibration matrices, so that the fetal facial surface as well as the oral cavity and airways are located. The results indicate that the 3D US calibration system achieves an FRE (fiducial registration error) of 1.49 +/- 0.44 mm and a TRE (target registration error) of 1.81 +/- 0.56 mm by using 24 fiducial points from two US volumes. A mean TRE of 1.55 +/- 0.46 mm is also achieved for measuring location accuracy of the 3D fetal facial surface extracted from 3D US images by 14 target markers, and mean location errors of 2.51 +/- 0.47 mm and 3.04 +/- 0.59 mm are achieved for indirectly measuring location accuracy of the pharynx and the entrance of the trachea, respectively, which satisfy the requirement of the FETO surgery.", "paper_title": "Locating Fetal Facial Surface, Oral Cavity and Airways by a 3D Ultrasound Calibration Using a Novel Cones' Phantom", "paper_id": "WOS:000342784200032"}