{"auto_keywords": [{"score": 0.047830230696136025, "phrase": "psi"}, {"score": 0.006256492760848037, "phrase": "minimum_information_guidelines"}, {"score": 0.00481495049065317, "phrase": "data_representation_standards"}, {"score": 0.004771750408749566, "phrase": "human_proteome_organization"}, {"score": 0.004399905285945236, "phrase": "data_standards"}, {"score": 0.004231302247688895, "phrase": "psi's_evolution"}, {"score": 0.003511613254403125, "phrase": "frequent_workshops"}, {"score": 0.00349055018979517, "phrase": "ongoing_communication"}, {"score": 0.003459191419478298, "phrase": "working_groups"}, {"score": 0.003438441702164516, "phrase": "official_standards"}, {"score": 0.003387108469185429, "phrase": "rigorous_document_process"}, {"score": 0.0033365390352128065, "phrase": "peer_review"}, {"score": 0.003104086547947925, "phrase": "public_repositories"}, {"score": 0.0030030115662983987, "phrase": "standard_formats"}, {"score": 0.002984990015496695, "phrase": "mass_spectrometer_input"}, {"score": 0.0029670762930358394, "phrase": "mass_spectrometer_output"}, {"score": 0.002931569771634119, "phrase": "informatics_analysis"}, {"score": 0.002836096284133166, "phrase": "molecular_interaction_data"}, {"score": 0.0027519956065269126, "phrase": "controlled_vocabularies"}, {"score": 0.0026384167183586015, "phrase": "extensive_software_development"}, {"score": 0.0026225774038593982, "phrase": "dissemination_efforts"}, {"score": 0.0023745087648471613, "phrase": "data_exchange"}, {"score": 0.0023460767171603054, "phrase": "data_repositories"}, {"score": 0.002262802370005939, "phrase": "new_proteomics_technologies"}, {"score": 0.002124106476971252, "phrase": "clinical_and_biological_phenotypes"}, {"score": 0.0021049977753042253, "phrase": "psi_website"}], "paper_keywords": ["standards", " data standards", " data formats", " guidelines", " proteomics", " standards organization", " HUPO", " proteomics standards initiative"], "paper_abstract": "Objective To describe the goals of the Proteomics Standards Initiative (PSI) of the Human Proteome Organization, the methods that the PSI has employed to create data standards, the resulting output of the PSI, lessons learned from the PSI's evolution, and future directions and synergies for the group. Materials and Methods The PSI has 5 categories of deliverables that have guided the group. These are minimum information guidelines, data formats, controlled vocabularies, resources and software tools, and dissemination activities. These deliverables are produced via the leadership and working group organization of the initiative, driven by frequent workshops and ongoing communication within the working groups. Official standards are subjected to a rigorous document process that includes several levels of peer review prior to release. Results We have produced and published minimum information guidelines describing what information should be provided when making data public, either via public repositories or other means. The PSI has produced a series of standard formats covering mass spectrometer input, mass spectrometer output, results of informatics analysis (both qualitative and quantitative analyses), reports of molecular interaction data, and gel electrophoresis analyses. We have produced controlled vocabularies that ensure that concepts are uniformly annotated in the formats and engaged in extensive software development and dissemination efforts so that the standards can efficiently be used by the community. Conclusion In its first dozen years of operation, the PSI has produced many standards that have accelerated the field of proteomics by facilitating data exchange and deposition to data repositories. We look to the future to continue developing standards for new proteomics technologies and workflows and mechanisms for integration with other omics data types. Our products facilitate the translation of genomics and proteomics findings to clinical and biological phenotypes. The PSI website can be accessed at http://www.psidev.info.", "paper_title": "Development of data representation standards by the human proteome organization proteomics standards initiative", "paper_id": "WOS:000356717100003"}