{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "missing_data"}, {"score": 0.010400611701628041, "phrase": "feature_selection"}, {"score": 0.004766388573192505, "phrase": "mutual_information_estimators"}, {"score": 0.004647105813224402, "phrase": "important_preprocessing_task"}, {"score": 0.003991305899593133, "phrase": "prediction_problems"}, {"score": 0.003717656912608012, "phrase": "well-known_mutual_information_criterion"}, {"score": 0.003291336101694653, "phrase": "traditional_ones"}, {"score": 0.0031603487697867538, "phrase": "probability_density_function"}, {"score": 0.0030811340338342454, "phrase": "mutual_information"}, {"score": 0.0029137604783116065, "phrase": "space_increases"}, {"score": 0.0028551716387011637, "phrase": "artificial_as_well_as_real-world_datasets"}, {"score": 0.002727606388863445, "phrase": "important_features"}, {"score": 0.0026457367614424756, "phrase": "imputation_algorithm"}, {"score": 0.0025275050635202878, "phrase": "random_data"}, {"score": 0.002283298119790413, "phrase": "prediction_models"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Feature selection", " Missing data", " Mutual information"], "paper_abstract": "Feature selection is an important preprocessing task for many machine learning and pattern recognition applications, including regression and classification. Missing data are encountered in many real-world problems and have to be considered in practice. This paper addresses the problem of feature selection in prediction problems where some occurrences of features are missing. To this end, the well-known mutual information criterion is used. More precisely, it is shown how a recently introduced nearest neighbors based mutual information estimator can be extended to handle missing data. This estimator has the advantage over traditional ones that it does not directly estimate any probability density function. Consequently, the mutual information may be reliably estimated even when the dimension of the space increases. Results on artificial as well as real-world datasets indicate that the method is able to select important features without the need for any imputation algorithm, under the assumption of missing completely at random data. Moreover, experiments show that selecting the features before imputing the data generally increases the precision of the prediction models, in particular when the proportion of missing data is high. (C) 2012 Elsevier B.V. All rights reserved.", "paper_title": "Feature selection with missing data using mutual information estimators", "paper_id": "WOS:000304747000002"}