{"auto_keywords": [{"score": 0.05007851542092211, "phrase": "educational_tool"}, {"score": 0.03671877968931593, "phrase": "technical_characteristics"}, {"score": 0.033638959467549384, "phrase": "demographic_variables"}, {"score": 0.03342877268328919, "phrase": "evaluation_values"}, {"score": 0.025988890393764414, "phrase": "bcpp"}, {"score": 0.0047839735747931605, "phrase": "breast_cancer_patients"}, {"score": 0.004528551999851654, "phrase": "internet-based_empowering_patient_education_program"}, {"score": 0.004190904630161064, "phrase": "patient_pathway"}, {"score": 0.003853359519337239, "phrase": "thirty-eight_newly_diagnosed_breast_cancer_patients"}, {"score": 0.0035087260813209593, "phrase": "external_appearance"}, {"score": 0.003452490908017195, "phrase": "web_site"}, {"score": 0.0033971539563683174, "phrase": "evaluating_internet_pages"}, {"score": 0.0033752674784204412, "phrase": "patient_education_instrument"}, {"score": 0.0032259472087775138, "phrase": "friedman's_test"}, {"score": 0.0031233388358844188, "phrase": "pearson_correlation_coefficients"}, {"score": 0.0030732613046470314, "phrase": "mean_value"}, {"score": 0.0030435998319355883, "phrase": "evaluation_criteria"}, {"score": 0.002985130390111069, "phrase": "patients'_evaluations"}, {"score": 0.0029658905122290536, "phrase": "different_subcategories"}, {"score": 0.0025808721879758243, "phrase": "significant_correlations"}, {"score": 0.002319566486828135, "phrase": "future_development"}, {"score": 0.0021462652605453163, "phrase": "internet-based_patient_education"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ireland_ltd."}], "paper_keywords": ["Internet", " Patient education", " Breast cancer", " Breast neoplasm"], "paper_abstract": "Objective: The aim of this paper was to describe the process of developing an Internet-based empowering patient education program for breast cancer patients and to evaluate the quality of the program from the perspective of patients. In this program, the patient pathway was used as an educational tool. Methods: The Breast Cancer Patient Pathway (BCPP) was developed and tested at one Finnish university hospital in 2005-2007. Thirty-eight newly diagnosed breast cancer patients used the program during their treatment process until the end of all treatments (average 9 months) in 2008-2010. After the treatments the patients evaluated the content, language and structure, instructiveness, external appearance and technical characteristics of the web site as subcategories with the Evaluating Internet Pages of Patient Education instrument, which is a 37-item Likert scale (1-4) questionnaire. Comparison between the subcategories was done with Friedman's test. Dependencies between demographic variables and evaluation values were tested with Pearson correlation coefficients. Results: The mean value of all evaluation criteria was 3.40. However, patients' evaluations between different subcategories varied, being the highest in language and structure (mean 3.48) and lowest in content (mean 3.13). Language and structure, external appearance and technical characteristics were significantly better than content, and language and structure better than instructiveness. Significant correlations were not found between demographic variables and evaluation values. Conclusions: Patients evaluated the quality of the BCPP to be best in language and structure and weakest in content. In terms of future development of the BCPP, the most improvement is needed in content and instructiveness. There is also a need for further development and study of Internet-based patient education. (c) 2012 Elsevier Ireland Ltd. All rights reserved.", "paper_title": "Internet based patient pathway as an educational tool for breast cancer patients", "paper_id": "WOS:000301378400005"}