{"auto_keywords": [{"score": 0.049368593327477166, "phrase": "missing_data"}, {"score": 0.03980335877573019, "phrase": "incomplete_data"}, {"score": 0.004655640997424794, "phrase": "real-life_situations"}, {"score": 0.004569414098372132, "phrase": "data_sets"}, {"score": 0.00453537012358554, "phrase": "missing_observations"}, {"score": 0.004501578643090429, "phrase": "statistical_methods"}, {"score": 0.004192803336288522, "phrase": "missing_values"}, {"score": 0.003949204622915113, "phrase": "entire_scope"}, {"score": 0.003503497128638099, "phrase": "posterior_distributions"}, {"score": 0.0034773669221269594, "phrase": "markov_chain_monte_carlo_methods"}, {"score": 0.003362163770566293, "phrase": "missingness_patterns"}, {"score": 0.003299813878412728, "phrase": "categorical_and_continuous_random_variables"}, {"score": 0.002916238693326477, "phrase": "motivating_example"}, {"score": 0.002840774188169279, "phrase": "simulation_study"}, {"score": 0.0025965187247488876, "phrase": "resulting_parameter_estimates"}, {"score": 0.002567498166608835, "phrase": "prescribed_model"}, {"score": 0.0023466842270226888, "phrase": "imputed_values"}, {"score": 0.0022945073938622287, "phrase": "individual_-_an_issue"}, {"score": 0.002260367486652148, "phrase": "relatively_little_attention"}, {"score": 0.0021049977753042253, "phrase": "different_routines"}], "paper_keywords": ["multiple imputation", " missing data", " missing at random", " missing not at random", " random forest"], "paper_abstract": "In real-life situations, we often encounter data sets containing missing observations. Statistical methods that address missingness have been extensively studied in recent years. One of the more popular approaches involves imputation of the missing values prior to the analysis, thereby rendering the data complete. Imputation broadly encompasses an entire scope of techniques that have been developed to make inferences about incomplete data, ranging from very simple strategies (e. g. mean imputation) to more advanced approaches that require estimation, for instance, of posterior distributions using Markov chain Monte Carlo methods. Additional complexity arises when the number of missingness patterns increases and/or when both categorical and continuous random variables are involved. Implementation of routines, procedures, or packages capable of generating imputations for incomplete data are now widely available. We review some of these in the context of a motivating example, as well as in a simulation study, under two missingness mechanisms (missing at random and missing not at random). Thus far, evaluation of existing implementations have frequently centred on the resulting parameter estimates of the prescribed model of interest after imputing the missing data. In some situations, however, interest may very well be on the quality of the imputed values at the level of the individual - an issue that has received relatively little attention. In this paper, we focus on the latter to provide further insight about the performance of the different routines, procedures, and packages in this respect.", "paper_title": "A comparison of various software tools for dealing with missing data via imputation", "paper_id": "WOS:000299726700020"}