{"auto_keywords": [{"score": 0.043443105745602804, "phrase": "multicore_scaling"}, {"score": 0.040841239240267634, "phrase": "device_scaling"}, {"score": 0.04052668746377231, "phrase": "single-core_scaling"}, {"score": 0.038537984845902075, "phrase": "parallel_workloads"}, {"score": 0.00481495049065317, "phrase": "processor_designers"}, {"score": 0.004681883017094419, "phrase": "moore"}, {"score": 0.004515655183335171, "phrase": "single-core_performance"}, {"score": 0.004425979295788883, "phrase": "dennard_scaling"}, {"score": 0.004303404058571052, "phrase": "multicore_parts"}, {"score": 0.003987474771008829, "phrase": "paper_models"}, {"score": 0.003739421738326676, "phrase": "speedup_potential"}, {"score": 0.0036212219870826725, "phrase": "five_technology_generations"}, {"score": 0.003236086384959101, "phrase": "pareto-optimal_frontiers"}, {"score": 0.0030468495296763617, "phrase": "detailed_performance_model"}, {"score": 0.003022465992278672, "phrase": "upper-bound_performance"}, {"score": 0.0029982770062678926, "phrase": "lower-bound_core_power"}, {"score": 0.002615381301695394, "phrase": "computing_community"}, {"score": 0.0024623517958288228, "phrase": "fixed-size_chip"}, {"score": 0.0021049977753042253, "phrase": "doubled_performance"}], "paper_keywords": ["Design", " Measurement", " Performance", " Dark silicon", " modeling", " power", " technology scaling", " multicore"], "paper_abstract": "Since 2004, processor designers have increased core counts to exploit Moore's Law scaling, rather than focusing on single-core performance. The failure of Dennard scaling, to which the shift to multicore parts is partially a response, may soon limit multicore scaling just as single-core scaling has been curtailed. This paper models multicore scaling limits by combining device scaling, single-core scaling, and multicore scaling to measure the speedup potential for a set of parallel workloads for the next five technology generations. For device scaling, we use both the ITRS projections and a set of more conservative device scaling parameters. To model single-core scaling, we combine measurements from over 150 processors to derive Pareto-optimal frontiers for area/performance and power/performance. Finally, to model multicore scaling, we build a detailed performance model of upper-bound performance and lower-bound core power. The multicore designs we study include single-threaded CPU-like and massively threaded GPU-like multicore chip organizations with symmetric, asymmetric, dynamic, and composed topologies. The study shows that regardless of chip organization and topology, multicore scaling is power limited to a degree not widely appreciated by the computing community. Even at 22 nm (just one year from now), 21% of a fixed-size chip must be powered off, and at 8 nm, this number grows to more than 50%. Through 2024, only 7.9x average speedup is possible across commonly used parallel workloads for the topologies we study, leaving a nearly 24-fold gap from a target of doubled performance per generation.", "paper_title": "Power Limitations and Dark Silicon Challenge the Future of Multicore", "paper_id": "WOS:000307998700003"}