{"auto_keywords": [{"score": 0.04886502274223979, "phrase": "stochastic_approaches"}, {"score": 0.04483396309490216, "phrase": "stochastic_algorithms"}, {"score": 0.04112106392023171, "phrase": "statistical_tests"}, {"score": 0.00481495049065317, "phrase": "statistical_test_results"}, {"score": 0.004593467306126913, "phrase": "evolutionary_algorithms"}, {"score": 0.0035523480068927614, "phrase": "larger_numbers"}, {"score": 0.003374250301861101, "phrase": "numerical_and_combinatorial_optimization"}, {"score": 0.0031102878400698143, "phrase": "alternative_way"}, {"score": 0.0029925402963843282, "phrase": "multiple_processes"}, {"score": 0.0028302635493019867, "phrase": "directed_acyclic_graph"}, {"score": 0.0027114323601885666, "phrase": "simplified_hasse_diagram"}, {"score": 0.0023942329846013133, "phrase": "dag."}, {"score": 0.0023434058350520763, "phrase": "brief_communication"}, {"score": 0.0021599099979586946, "phrase": "different_optimization_methods"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Statistical tests", " Directed acyclic graph", " Hasse diagram", " Stochastic algorithms", " Optimization"], "paper_abstract": "Stochastic approaches such as evolutionary algorithms have been widely used in various science and engineering problems. When comparing the performance of a set of stochastic algorithms, it is necessary to statistically evaluate which algorithms are the most suitable for solving a given problem. The outcome of statistical tests comparing N >= 2 processes, where N is the number of algorithms, is often presented in tables. This can become confusing for larger numbers of N. Such a scenario is, however, very common in both numerical and combinatorial optimization as well as in the domain of stochastic algorithms in general. In this letter, we introduce an alternative way of visually presenting the results of statistical tests for multiple processes in a compact and easy-to-read manner using a directed acyclic graph (DAG), in the form of a simplified Hasse diagram. The rationale of doing so is based on the fact that the outcome of the tests is always at least a strict partial order, which can be appropriately presented via a DAG. The goal of this brief communication is to promote the use of this approach as a means for presenting the results of comparisons between different optimization methods. (C) 2014 Elsevier B.V. All rights reserved.", "paper_title": "An alternative way of presenting statistical test results when evaluating the performance of stochastic approaches", "paper_id": "WOS:000343337600020"}