{"auto_keywords": [{"score": 0.049445419527232116, "phrase": "learning_performance"}, {"score": 0.021472815163949038, "phrase": "visual_and_verbal_cognitive_styles"}, {"score": 0.014235572041048788, "phrase": "video-based_multimedia_material"}, {"score": 0.010612387000973441, "phrase": "different_multimedia_materials"}, {"score": 0.00970423359040813, "phrase": "learners'_emotions"}, {"score": 0.005161112465704722, "phrase": "negative_emotion"}, {"score": 0.004719664411221952, "phrase": "visual_and_verbal_style_learners"}, {"score": 0.004688354725381201, "phrase": "multimedia"}, {"score": 0.0045196012587080114, "phrase": "individual_preferences"}, {"score": 0.00448958076531243, "phrase": "multimedia_materials"}, {"score": 0.0035789061301304977, "phrase": "emotion-based_adaptive_multimedia_learning_system"}, {"score": 0.003359124481967084, "phrase": "sop"}, {"score": 0.0032272929113113203, "phrase": "emotion_assessment_instrument_emwave"}, {"score": 0.003163326114997034, "phrase": "heartmath"}, {"score": 0.0030799988391729464, "phrase": "emotional_states"}, {"score": 0.0030189426536422577, "phrase": "learning_processes"}, {"score": 0.0029492339651639734, "phrase": "image-based_multimedia_material"}, {"score": 0.002900426826591769, "phrase": "animated_interactive_multimedia_material"}, {"score": 0.002641621667026613, "phrase": "experimental_results"}, {"score": 0.0025892330566358503, "phrase": "best_learning_performance"}, {"score": 0.002520990102833368, "phrase": "dynamic_multimedia_materials"}, {"score": 0.002430076037416881, "phrase": "static_multimedia_materials"}, {"score": 0.00235813005446246, "phrase": "partial_correlation"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Media in education", " Multimedia/hypermedia systems", " Evaluation methodologies"], "paper_abstract": "Multimedia materials are now increasingly used in curricula. However, individual preferences for multimedia materials based on visual and verbal cognitive styles may affect learners' emotions and performance. Therefore, in-depth studies that investigate how different multimedia materials affect learning performance and the emotions of learners with visual and verbal cognitive styles are needed. Additionally, many education scholars have argued that emotions directly affect learning performance. Therefore, a further study that confirms the relationships between learners' emotions and performance for learners with visual and verbal cognitive styles will provide useful knowledge in terms of designing an emotion-based adaptive multimedia learning system for supporting personalized learning. To investigate these issues, the study applies the Style of Processing (SOP) scale to identify verbalizers and visualizers. Moreover, the emotion assessment instrument emWave, which was developed by HeartMath, is applied to assess variations in emotional states for verbalizers and visualizers during learning processes. Three different multimedia materials, static text and image-based multimedia material, video-based multimedia material, and animated interactive multimedia material, were presented to verbalizers and visualizers to investigate how different multimedia materials affect individual learning performance and emotion, and to identify relationships between learning performance and emotion. Experimental results show that video-based multimedia material generates the best learning performance and most positive emotion for verbalizers. Moreover, dynamic multimedia materials containing video and animation are more appropriate for visualizers than static multimedia materials containing text and image. Finally, a partial correlation exists between negative emotion and learning performance; that is, negative emotion and pretest scores considered together and negative emotion alone can predict learning performance of visualizers who use video-based multimedia material for learning. (C) 2012 Elsevier Ltd. All rights reserved.", "paper_title": "Assessing the effects of different multimedia materials on emotions and learning performance for visual and verbal style learners", "paper_id": "WOS:000309307300019"}