{"auto_keywords": [{"score": 0.03903121445065066, "phrase": "qsar_models"}, {"score": 0.00481495049065317, "phrase": "chemical_diversity"}, {"score": 0.004779876533667754, "phrase": "qsar_analysis"}, {"score": 0.0044104497301196794, "phrase": "combined_clustering"}, {"score": 0.004378309349451268, "phrase": "qsar_modeling_methodology"}, {"score": 0.004205660924155212, "phrase": "structurally_diverse_data_sets"}, {"score": 0.004159763048814389, "phrase": "trial-descriptor_pool"}, {"score": 0.00406945841245389, "phrase": "qsar-model_building"}, {"score": 0.003995697901740734, "phrase": "classic_qsar_descriptors"}, {"score": 0.0035934073774126856, "phrase": "linear-regression_fitting_and_model_optimization"}, {"score": 0.003401431460601017, "phrase": "five_clusters"}, {"score": 0.00336428077531883, "phrase": "corresponding_qsar_models"}, {"score": 0.0032079118323314424, "phrase": "five_qsar_models"}, {"score": 0.0031382058937207413, "phrase": "structurally_diverse_inhibitors"}, {"score": 0.0030700099570048346, "phrase": "common_site"}, {"score": 0.0030032915123993837, "phrase": "common_inhibitor_hydrogen-bond_donor"}, {"score": 0.002959617637433, "phrase": "somewhat_different_alignments"}, {"score": 0.0028220038404484196, "phrase": "particular_alignments"}, {"score": 0.002720505061804933, "phrase": "specific_distributions"}, {"score": 0.0027006464509273806, "phrase": "nonpolar_groups"}, {"score": 0.002482404507958289, "phrase": "less-defined_pharmacophores"}, {"score": 0.002265095354846931, "phrase": "qsar_methodology"}, {"score": 0.002175594509651082, "phrase": "structurally_diverse_compounds"}, {"score": 0.0021518035978153878, "phrase": "common_endpoint"}, {"score": 0.0021049977753042253, "phrase": "statistically_significant_and_pharmacologically_insightful_composite_qsar_models"}], "paper_keywords": [""], "paper_abstract": "A set of 213 compounds across 12 structurally diverse classes of HIV-1 integrase inhibitors was used to develop and evaluate a combined clustering and QSAR modeling methodology to construct significant, reliable, and robust models for structurally diverse data sets. The trial-descriptor pool for both clustering-and QSAR-model building consisted of 4D fingerprints and classic QSAR descriptors. Clustering was carried out using a combination of the partitioning around medoids method and divisive hierarchical clustering. QSAR models were constructed for members of each cluster by linear-regression fitting and model optimization using the genetic function approximation. The 12 structurally diverse classes of integrase inhbitors were partitioned into five clusters from which corresponding QSAR models, overwhelmingly composed of 4D fingerprint descriptors, were constructed. Analysis of the five QSAR models suggests that three models correspond to structurally diverse inhibitors that likely bind at a common site on integrase characterized by a common inhibitor hydrogen-bond donor, but involving somewhat different alignments and/or poses for the inhibitors of each of the three clusters. The particular alignments for the inhibitors of each of the three QSAR models involve specific distributions of nonpolar groups over the inhibitors. The two other clusters, one for coumarins and the other for depsides and depsidones, lead to QSAR models with less-defined pharmacophores, likely representing an inhibitor binding to a site(s) different from that of the other nine classes of inhibitors. Overall, the clustering and QSAR methodology employed in this study suggests that it can meaningfully partition structurally diverse compounds expressing a common endpoint in such a manner that leads to statistically significant and pharmacologically insightful composite QSAR models.", "paper_title": "Treating chemical diversity in QSAR analysis: Modeling diverse HIV-1 integrase inhibitors using 4D fingerprints", "paper_id": "WOS:000249697600022"}