{"auto_keywords": [{"score": 0.02052402168481809, "phrase": "loop_c"}, {"score": 0.01899350892267274, "phrase": "desensitized_state"}, {"score": 0.017712109885377216, "phrase": "binding_site"}, {"score": 0.009635950137062407, "phrase": "resting_state"}, {"score": 0.005088890424737559, "phrase": "hydrogen_bond_interactions"}, {"score": 0.00481495049065317, "phrase": "nicotinic_acetylcholine_receptor_gating"}, {"score": 0.004641351004344458, "phrase": "nicotinic_acetylcholine_receptor"}, {"score": 0.004617064974703469, "phrase": "multiple_conformational_states"}, {"score": 0.00430132154996694, "phrase": "active_and_desensitized_states"}, {"score": 0.0042119653427658025, "phrase": "extracellular_ligand_binding_domain"}, {"score": 0.004157058883925715, "phrase": "homology_modeling"}, {"score": 0.0040706873556360474, "phrase": "torpedo_californica"}, {"score": 0.0038624981944755813, "phrase": "molecular_dynamics"}, {"score": 0.0037822235317605713, "phrase": "extracellular_lbd"}, {"score": 0.003752550907120244, "phrase": "nachr_conformational_state"}, {"score": 0.0036938996194386016, "phrase": "agonist_anabaseine"}, {"score": 0.0032393479516888996, "phrase": "side-chain_interactions"}, {"score": 0.0031970796597571367, "phrase": "hydrogen-bonding_interactions"}, {"score": 0.00314708280192844, "phrase": "ligand_binding_site"}, {"score": 0.0030175357064947494, "phrase": "main_chain_interactions"}, {"score": 0.002752390133272192, "phrase": "md_simulations"}, {"score": 0.0025237171554924128, "phrase": "alpha_gamma_interface"}, {"score": 0.002497319603143104, "phrase": "alpha_delta_interface"}, {"score": 0.0023818980286716826, "phrase": "side_chain_interactions"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["nAChR", " Resting state", " Desensitized state", " alpha gamma interface", " alpha delta interface", " Molecular dynamics"], "paper_abstract": "The nicotinic acetylcholine receptor exhibits multiple conformational states, resting (channel closed), active (channel open) and desensitized (channel closed). The resting state may be distinguished from the active and desensitized states by the orientation of loop C in the extracellular ligand binding domain (LBD). Homology modeling was used to generate structures of the Torpedo californica alpha(2)beta delta gamma nAChR that initially represent the resting state (loop C open) and the desensitized state (loop C closed). Molecular dynamics (MD) simulations were performed on the extracellular LBD on each nAChR conformational state, with and without the agonist anabaseine present in each binding site (the alpha gamma and the alpha delta sites). Three MD simulations of 10 ns each were performed for each of the four conditions. Comparison of dynamics revealed that in the presence of agonist, loop C was drawn inward and attains a more stable conformation. Examination of side-chain interactions revealed that residue alpha Y190 exhibited hydrogen-bonding interactions either with residue alpha Y93 in the ligand binding site or with residue alpha K145 proximal to the binding site. alpha K145 also exhibited side chain (salt bridge) interactions with alpha D200 and main chain interactions with alpha Y93. Residues alpha W149, alpha Y198, gamma Y116/delta T119, gamma L118/delta L121 and gamma L108/delta L111 appear to play the role of stabilizing ligand in the binding site. In MD simulations for the desensitized state, the effect of ligand upon the interactions among alpha K145, alpha Y190, and alpha Y93 as well as ligand-hydrogen-bonding to alpha W149 were more pronounced at the alpha gamma interface than at the alpha delta interface. Differences in affinity for the desensitized state were determined experimentally to be 10-fold. The changes in side chain interactions observed for the two conformations and induced by ligand support a model wherein hydrogen bond interactions between alpha D200 and alpha Y93 are broken and rearrange to form a salt-bridge between alpha K145 and alpha D200 and hydrogen bond interactions between alpha Y93 and alpha Y190 and between alpha K145 and alpha Y190. (C) 2013 Elsevier Inc. All rights reserved.", "paper_title": "Interactions of acetylcholine binding site residues contributing to nicotinic acetylcholine receptor gating: Role of residues Y93, Y190, K145 and D200", "paper_id": "WOS:000324965300016"}