{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "mobile_landmark_recognition"}, {"score": 0.04203986116571504, "phrase": "discriminative_information"}, {"score": 0.004458722048888919, "phrase": "image_patches"}, {"score": 0.004416079619543104, "phrase": "conventional_bow_methods"}, {"score": 0.0038047474331318974, "phrase": "representative_patches"}, {"score": 0.0036261282565554507, "phrase": "binary_hard_selection_approach_results"}, {"score": 0.0034558655164987134, "phrase": "discarded_patches"}, {"score": 0.0033900126423990823, "phrase": "useful_discriminative_information"}, {"score": 0.0032308006242867224, "phrase": "learning_process"}, {"score": 0.0030642636185693054, "phrase": "new_discriminative_soft_bow_approach"}, {"score": 0.0029627701619228527, "phrase": "main_contribution"}, {"score": 0.0026142814606853037, "phrase": "patch_discriminative_information"}, {"score": 0.0024914105981393127, "phrase": "vector_quantization"}, {"score": 0.0024556852466581527, "phrase": "soft_bow_histograms"}, {"score": 0.0023972750359328235, "phrase": "learned_representative_information"}, {"score": 0.002198242191529979, "phrase": "fuzzy_support_vector_machine"}, {"score": 0.0021049977753042253, "phrase": "proposed_method"}], "paper_keywords": ["Bag-of-words (BoW)", " discriminative learning", " fuzzy support vector machine", " mobile landmark recognition"], "paper_abstract": "This paper proposes a new soft bag-of-words (BoW) method for mobile landmark recognition based on discriminative learning of image patches. Conventional BoW methods often consider the patches/regions in the images as equally important for learning. Amongst the few existing works that consider the discriminative information of the patches, they mainly focus on selecting the representative patches for training, and discard the others. This binary hard selection approach results in underutilization of the information available, as some discarded patches may still contain useful discriminative information. Further, not all the selected patches will contribute equally to the learning process. In view of this, this paper presents a new discriminative soft BoW approach for mobile landmark recognition. The main contribution of the method is that the representative and discriminative information of the landmark is learned at three levels: patches, images, and codewords. The patch discriminative information for each landmark is first learned and incorporated through vector quantization to generate soft BoW histograms. Coupled with the learned representative information of the images and codewords, these histograms are used to train an ensemble of classifiers using fuzzy support vector machine. Experimental results on two different datasets show that the proposed method is effective in mobile landmark recognition.", "paper_title": "Discriminative BoW Framework for Mobile Landmark Recognition", "paper_id": "WOS:000334739900011"}