{"auto_keywords": [{"score": 0.04501436275484078, "phrase": "empirical_results"}, {"score": 0.0446150969357642, "phrase": "quantitative_data"}, {"score": 0.04356683019220359, "phrase": "private_enterprise"}, {"score": 0.04317982308633708, "phrase": "indispensable_actor"}, {"score": 0.04292364433951061, "phrase": "scientific_development"}, {"score": 0.02446213026122651, "phrase": "hybrid_indicators"}, {"score": 0.004401639026078196, "phrase": "private_sector_collaboration"}, {"score": 0.00357689487273538, "phrase": "spanish_business"}, {"score": 0.0034785371344994197, "phrase": "internationally_visible_scientific_output"}, {"score": 0.0033515736929172644, "phrase": "business_involvement"}, {"score": 0.0032796556275748842, "phrase": "research_papers"}, {"score": 0.0030634906292640947, "phrase": "systematic_comparison"}, {"score": 0.002997735656669146, "phrase": "resulting_collaboration_network"}, {"score": 0.002960795132939529, "phrase": "-_bibliometric_analyses"}, {"score": 0.002656327554326748, "phrase": "thomson_reuters_databases"}, {"score": 0.002551372449383365, "phrase": "scientific_collaboration"}, {"score": 0.0024965820893532286, "phrase": "core_ideas"}, {"score": 0.0024278584953697597, "phrase": "essential_role"}, {"score": 0.0023904975479186806, "phrase": "scientific_results"}, {"score": 0.002317487599170394, "phrase": "clustering_coefficient"}, {"score": 0.0022052711621931144, "phrase": "institutional_collaboration"}, {"score": 0.0021312837202666687, "phrase": "institutional_aggregates_yields_novel_results"}, {"score": 0.0021049977753042253, "phrase": "preceding_studies"}], "paper_keywords": ["Research and development", " Private sector organizations", " Information science and documentation", " Spain"], "paper_abstract": "Purpose - Although the role of enterprise in R&D is broadly acknowledged, few attempts have been made to gather data for analyzing the nature and scope of private sector collaboration. This study aims to deliver empirical results based on quantitative data to gain insight into the role of private enterprise as an indispensable actor in scientific development and innovation. Design/methodology/approach - The study aimed to deliver empirical results based on quantitative data to gain insight into the role of private enterprise as an indispensable actor in scientific development and innovation. To this end, an analysis was conducted of the contribution made by Spanish business, focusing on the 50 most active companies in terms of internationally visible scientific output, from three perspectives. Findings - The findings provide insight into business involvement in the R&D system based on: research papers published; national, international and sectoral collaboration patterns; structural patterns; and the identification of the most prominent companies from a systematic comparison of their research results and their position in the resulting collaboration network. Research limitations/implications - Bibliometric analyses do not measure all types of publications. Indicators are usually based on data in the Thomson Reuters databases, which are regarded as being representative of peer-reviewed, publicly accessible papers with high international visibility and impact. The Thomson Reuters databases feature a series of advantages that make them indispensable for studies on scientific collaboration. Originality/value - One of the core ideas of this study is the emphasis on the essential role of collaboration in improving scientific results, as borne out by the correlation between the clustering coefficient and the hybrid indicators. The findings also provide proof of the success of strategies for institutional collaboration. The foregoing shows that the application of hybrid indicators to institutional aggregates yields novel results not explored in preceding studies.", "paper_title": "R&D collaboration in 50 major Spanish companies", "paper_id": "WOS:000288570300001"}