{"auto_keywords": [{"score": 0.04046484502680129, "phrase": "firewall_rules"}, {"score": 0.00481495049065317, "phrase": "recent_years"}, {"score": 0.004748556604045108, "phrase": "significant_increase"}, {"score": 0.004308630865024719, "phrase": "important_piece"}, {"score": 0.004263972370406983, "phrase": "overall_architecture"}, {"score": 0.0040899006497687115, "phrase": "security_policy"}, {"score": 0.0038957429132649175, "phrase": "actual_meaning"}, {"score": 0.003775803846431323, "phrase": "formal_logic"}, {"score": 0.0037366473207825234, "phrase": "important_tool"}, {"score": 0.003584025547693836, "phrase": "real-world_situations"}, {"score": 0.003217896008931311, "phrase": "sensible_way"}, {"score": 0.002639251247218711, "phrase": "destination_components"}, {"score": 0.0023776656246300063, "phrase": "filtering_device"}, {"score": 0.002225542510652775, "phrase": "actual_firewall_rules"}, {"score": 0.002105002791198285, "phrase": "cisco"}], "paper_keywords": ["Formal logic", " Internet security", " Fire walls", " Logic programming", " Network modelling"], "paper_abstract": "Recent years have seen a significant increase in the usage of computers and their capabilities to communicate with each other. With this has come the need for more security and firewalls have proved themselves an important piece of the overall architecture, as the body of rules they implement actually realises the security policy of their owners. Unfortunately, there is little help for their administrators to understand the actual meaning of the firewall rules. This work shows that formal logic is an important tool in this respect, because it is particularly apt at modelling real-world situations and its formalism is conductive to reason about such a model. As a consequence, logic may be used to prove the properties of the models it represents and is a sensible way to go in order to create those models on computers to automate such activities. We describe here a prototype which includes a description of a network and the body of firewall rules applied to its components. We were able to detect a number of anomalies within the rule-set: inexistent elements (e.g. hosts or services on destination components), redundancies in rules defining the same action for a network and hosts belonging to it, irrelevance as rules would involve traffic that would not pass through a filtering device, and contradiction in actions applied to elements or to a network and its hosts. The prototype produces actual firewall rules as well, generated from the model and expressed in the syntax of IPChains and Cisco's PIX.", "paper_title": "A formal logic approach to firewall packet filtering analysis and generation", "paper_id": "WOS:000271748200004"}