{"auto_keywords": [{"score": 0.024904078927084728, "phrase": "adaptability_assessment"}, {"score": 0.00481495049065317, "phrase": "supporting_mediated_service_interactions"}, {"score": 0.004598933498016774, "phrase": "suitable_provider_service"}, {"score": 0.004167982855788402, "phrase": "fundamental_promise"}, {"score": 0.0041136473765874815, "phrase": "service_oriented_computing_paradigm"}, {"score": 0.003980875186335867, "phrase": "service_interactions"}, {"score": 0.003537275726870251, "phrase": "novel_adaptability_assessment_technique"}, {"score": 0.003356275163203055, "phrase": "adaptation_degree"}, {"score": 0.0026148807877309417, "phrase": "complementary_criteria"}, {"score": 0.0022041312401435346, "phrase": "mediated_service_interactions"}, {"score": 0.0021049977753042253, "phrase": "walk_computation_technique"}], "paper_keywords": ["Adaptability assessment", " Mediated service interaction", " Walk computation", " Service protocol"], "paper_abstract": "Discovery and selection of a suitable provider service, which can interact with a certain requester service for achieving a certain goal, is a fundamental promise of service oriented computing paradigm. Current techniques analyzing service interactions focus on either compatibility analysis or adapter synthesization. By using our walk computation technique, in this paper we propose a novel adaptability assessment technique, which (i) computes an adaptation degree that specifies to what extent two service protocols are adaptable, and (ii) provides a set of conditions that determine when these two service protocols can interact properly through a certain adapter. The condition set and the adaptation degree are complementary criteria to be applied by the requestor for identifying the most suitable provider service. Indeed, the techniques of adaptability assessment and adapter synthesization complement each other for facilitating mediated service interactions. The adaptability assessment, and the walk computation technique we developed, have been implemented and plugged into ProM as a component.", "paper_title": "Service Protocol Adaptability Assessment for Supporting Mediated Service Interactions", "paper_id": "WOS:000305576900005"}