{"auto_keywords": [{"score": 0.05007799006502165, "phrase": "transmission-constrained_unit_commitment_problem"}, {"score": 0.04086913766954913, "phrase": "transmission_network"}, {"score": 0.034692465572853035, "phrase": "milp"}, {"score": 0.004664352260912174, "phrase": "preprocessing_technique"}, {"score": 0.004353948887538618, "phrase": "transmission_constraints"}, {"score": 0.0036553070575015344, "phrase": "overall_solution"}, {"score": 0.0033402088717816446, "phrase": "linear_programming_relaxation"}, {"score": 0.003101153870424188, "phrase": "illinois's_transmission_network"}, {"score": 0.0029565620771207003, "phrase": "proposed_technique"}, {"score": 0.002658863179011018, "phrase": "significant_decrease"}, {"score": 0.002219790619936024, "phrase": "overall_solution_times"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Unit Commitment", " Transmission network", " Mixed Integer Linear Programming", " Network reduction"], "paper_abstract": "This paper examines a preprocessing technique for a Mixed Integer Linear Programming (MILP) formulation of the Transmission-Constrained Unit Commitment problem (TC-UC). Incorporating transmission constraints into the Unit Commitment problem can significantly increase the size and difficulty of the problem. By examining the structure of the transmission network, variables that have no impact on the quality of the overall solution can be identified and removed. This preprocessing can reduce the time needed to solve the linear programming relaxation of the MILP, and as a result, the MILP itself. Illinois's transmission network was used to test the benefit of the proposed technique. Preprocessing was able to remove 30% of the buses in the transmission network. This reduction led to a significant decrease in the time needed to solve a 24 h TC-UC problem. An added benefit of the preprocessing is that symmetry can be introduced into the problem. Identifying this symmetry and exploiting it can improve overall solution times even further. (C) 2012 Published by Elsevier Ltd.", "paper_title": "Network reduction in the Transmission-Constrained Unit Commitment problem", "paper_id": "WOS:000309631800018"}