{"auto_keywords": [{"score": 0.04013373565369004, "phrase": "fpgas"}, {"score": 0.00481495049065317, "phrase": "reconfigurable_platforms"}, {"score": 0.004763565662615503, "phrase": "memory_accesses"}, {"score": 0.00441883624011048, "phrase": "memory_subsystem"}, {"score": 0.0037615180375561805, "phrase": "proposed_scheme"}, {"score": 0.0032536902910768957, "phrase": "compile_time"}, {"score": 0.003167441161387607, "phrase": "statistical_properties"}, {"score": 0.003050508020268648, "phrase": "sub-cache_contentions"}, {"score": 0.002969628818856786, "phrase": "semaphore-based_system"}, {"score": 0.0029221312451219203, "phrase": "complete_hardware_implementation"}, {"score": 0.0028293966058473476, "phrase": "motion_vector_estimation_benchmark"}, {"score": 0.002695768552609587, "phrase": "cycle_count_reduction"}, {"score": 0.002460295872115956, "phrase": "hardware_resource_usage_and_clock_frequency_penalties"}, {"score": 0.0023314867226678555, "phrase": "cache_size"}, {"score": 0.0022213218042340735, "phrase": "optimum_cache_size"}], "paper_keywords": [""], "paper_abstract": "Memory accesses contribute sunstantially to aggregate system delays. It is critical for designers to ensure that the memory subsystem is designed efficiently, and much work has been done on the exploitation of data re-use for algorithms that exhibit static memory access patterns in FPGAs. The proposed scheme enables the exploitation of data re-use for both static and non-static parallel memory access patterns through the use of a multi-port cache, where parameters can be determined at compile time and matched to the statistical properties of the application, and where sub-cache contentions are arbitrated with a semaphore-based system. A complete hardware implementation demonstrates that, for a motion vector estimation benchmark, the proposed caching scheme results in a cycle count reduction of 51% and execution time reduction of up to 24%, using a Xilinx XC2V6000 FPGA on a Celoxica RC300 board. Hardware resource usage and clock frequency penalties are analyzed while varying the number of ports and cache size. Consequently, it is demonstrated how the optimum cache size and number of ports may be established for a given datapath.", "paper_title": "A flexible multi-port caching scheme for reconfigurable platforms", "paper_id": "WOS:000240036500029"}