{"auto_keywords": [{"score": 0.03728196670339662, "phrase": "antigen_stimulus"}, {"score": 0.015719716506582524, "phrase": "task_allocation"}, {"score": 0.01457003677371027, "phrase": "multi-robot_system"}, {"score": 0.012970108228860317, "phrase": "autonomous_cooperation"}, {"score": 0.010988098660211337, "phrase": "autonomously_cooperative_robots"}, {"score": 0.004665162327051461, "phrase": "autonomously_cooperative_multi-robot_system."}, {"score": 0.0038590090616766434, "phrase": "appropriate_task_allocation_algorithm"}, {"score": 0.0034937647771945803, "phrase": "artificial_immune_system"}, {"score": 0.003400274964240732, "phrase": "immune_based_task_allocation_algorithm"}, {"score": 0.003249966782844541, "phrase": "immune_system"}, {"score": 0.0032061793819537633, "phrase": "immune-based_task_allocation_algorithm"}, {"score": 0.002627587221594597, "phrase": "task_allocation_algorithm"}, {"score": 0.0025804616931593897, "phrase": "self-reinforcement_learning"}, {"score": 0.002389403849342894, "phrase": "allocation_algorithm"}, {"score": 0.0021049977753042253, "phrase": "unknown_difficulty"}], "paper_keywords": ["artificial immune system", " task allocation", " autonomous cooperation", " the multi-robot system"], "paper_abstract": "In many cases, tasks are unknown for the multi-robot system in advance. Therefore, robots are required to work cooperatively during the proceeding of tasks. Such cooperation is called autonomous cooperation. To realize autonomous cooperation in the multi-robot system, an appropriate task allocation algorithm is quite important for the efficiency of the system. Taking advantage of the interactions of antibodies and antigen stimulus of the artificial immune system, this paper proposes an immune based task allocation algorithm for the autonomously cooperative robots. Simulating the mechanism of the immune system, the immune-based task allocation algorithm is designed utilizing the interactions among the antibodies from robots. By considering the antibodies from inter- and intra-robot simultaneously, the algorithm is different from other allocation algorithms which are greedy in task allocation. Besides the interactions among the antibodies, the task allocation algorithm is developed by self-reinforcement learning of the antigen stimulus. The autonomous cooperation among robots is realized by adjusting the antigen stimulus. The allocation algorithm for the autonomously cooperative robots is demonstrated and analyzed in the simulation of box fixing, in which a group of robots must work cooperatively to fix boxes with unknown difficulty in advance.", "paper_title": "TASK ALLOCATION ALGORITHM BASED ON IMMUNE SYSTEM FOR AUTONOMOUSLY COOPERATIVE MULTI-ROBOT SYSTEM", "paper_id": "WOS:000264661000011"}