{"auto_keywords": [{"score": 0.036562079488376455, "phrase": "final_exam_performance"}, {"score": 0.015719716506582538, "phrase": "computer-aided_personalized_system"}, {"score": 0.013741569001236334, "phrase": "unit_tests"}, {"score": 0.004761850836420121, "phrase": "archived_data"}, {"score": 0.004517479191423587, "phrase": "instructional_program"}, {"score": 0.004406121974246201, "phrase": "objectively_rescored_final_exam_grades"}, {"score": 0.004145287175409325, "phrase": "strong_positive_correlation"}, {"score": 0.003889026508070508, "phrase": "peer_reviewers"}, {"score": 0.0036384371764476386, "phrase": "higher_final_exam_scores"}, {"score": 0.0034134024569847264, "phrase": "high_progress_rate"}, {"score": 0.0033570147767493716, "phrase": "low_progress_rate"}, {"score": 0.0032741692702522463, "phrase": "moderate_correlation"}, {"score": 0.003256037687517789, "phrase": "progress_rate"}, {"score": 0.003088702479841264, "phrase": "moderate_positive_correlation"}, {"score": 0.002897569576375012, "phrase": "final_exam"}, {"score": 0.0024939073328022507, "phrase": "good_learning"}, {"score": 0.0024663408903032695, "phrase": "course_related_behaviors"}, {"score": 0.0024255601098027227, "phrase": "peer_reviewing"}, {"score": 0.0023788319661581696, "phrase": "capsi_instructional_program"}, {"score": 0.002359081558986726, "phrase": "good_learning_environment"}, {"score": 0.0022007302738063566, "phrase": "assigned_units"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["computer-aided personalized system of instruction", " self-pacing", " procrastination", " early- vs. late-massed performance", " measure of educational performance", " essay tests", " student peer reviewers", " online instruction", " instructional technology"], "paper_abstract": "Archived data from four courses taught with computer-aided personalized system of instruction (CAPSI) - an online, self-paced, instructional program - were used to explore the relationship between objectively rescored final exam grades, peer reviewing, and progress rate - i.e., the rate at which students completed unit tests. There was a strong positive correlation (r = .68, p < .01) between rate of progress and the amount of peer reviewing students did. This was predictable because peer reviewers had to be further along in the course than the students whose unit tests they reviewed. Students who completed all the units tended to obtain higher final exam scores than those who did not. For students who completed all the units there was little difference between the final exam performance of those who had a high progress rate and those who had a low progress rate. Considering all students together there was a moderate correlation between progress rate and final exam performance (r = .36, p < .01). In addition, there was a moderate positive correlation (r = .33, p < .01) between the amount of peer reviewing students did and their performance on the final exam. This correlation was substantially reduced (r = .13, p < .20) when rate of progress was partialed out. Thus, overall, students who progressed more rapidly through the course did more peer reviewing and learned more as measured by final exam performance. Interestingly, there were students who showed good learning without much participation in course related behaviors such as completing unit tests and peer reviewing. It is concluded that the CAPSI instructional program provides a good learning environment for students who utilize its components but it also accommodates other learning styles. In addition, there may be a distinction between students who complete all assigned units and those who do not regardless of their tendencies to procrastinate. (C) 2007 Elsevier Ltd. All rights reserved.", "paper_title": "Performance measures in courses using computer-aided personalized system of instruction", "paper_id": "WOS:000257013800023"}