{"auto_keywords": [{"score": 0.04395714656892151, "phrase": "curve_styles"}, {"score": 0.04154041880609474, "phrase": "curve_features"}, {"score": 0.00958845624439606, "phrase": "style-content_separation"}, {"score": 0.004711779740073973, "phrase": "general_analysis"}, {"score": 0.004610809404212932, "phrase": "highly_challenging_problem"}, {"score": 0.004540009134349177, "phrase": "open_question"}, {"score": 0.004442703298710073, "phrase": "geometric_shapes"}, {"score": 0.004241126597483046, "phrase": "unsupervised_algorithm"}, {"score": 0.004061214835223812, "phrase": "curve_style"}, {"score": 0.0038055011575934936, "phrase": "previous_attempts"}, {"score": 0.003712362078915926, "phrase": "preconceived_conceptual_characterisations"}, {"score": 0.003644001325962353, "phrase": "specific_shape_descriptors"}, {"score": 0.0032898346872897383, "phrase": "shape_correspondence"}, {"score": 0.003209275810748739, "phrase": "operational_definition"}, {"score": 0.002960795132939529, "phrase": "novel_formulation"}, {"score": 0.002942495422585405, "phrase": "associated_algorithm"}, {"score": 0.0028526747080263757, "phrase": "feature-shape_association_matrix"}, {"score": 0.0026399046763432906, "phrase": "feature_mode"}, {"score": 0.0024354002939660597, "phrase": "fsm._computationally"}, {"score": 0.002397923568994474, "phrase": "row-wise_correlation_analysis"}, {"score": 0.0023757202754476213, "phrase": "fsm"}, {"score": 0.0023537101705489957, "phrase": "heuristic_solution"}, {"score": 0.0023103100997344072, "phrase": "set_cover_problem"}, {"score": 0.002118100058154083, "phrase": "style_transfer"}], "paper_keywords": ["curve style", " style-content separation", " shape synthesis"], "paper_abstract": "The word 'style' can be interpreted in so many different ways in so many different contexts. To provide a general analysis and understanding of styles is a highly challenging problem. We pose the open question 'how to extract styles from geometric shapes?' and address one instance of the problem. Specifically, we present an unsupervised algorithm for identifying curve styles in a set of shapes. In our setting, a curve style is explicitly represented by a mode of curve features appearing along the 2D silhouettes of the shapes in the set. Unlike previous attempts, we do not rely on any preconceived conceptual characterisations, for example, via specific shape descriptors, to define what is or is not a style. Our definition of styles is data-dependent; it depends on the input set but we do not require computing a shape correspondence across the set. We provide an operational definition of curve styles which focuses on separating curve features that represent styles from curve features that are content revealing. To this end, we develop a novel formulation and associated algorithm for style-content separation. The analysis is based on a feature-shape association matrix (FSM) whose rows correspond to modes of curve features, columns to shapes in the set, and each entry expresses the extent a feature mode is present in a shape. We make several assumptions to drive style-content separation which only involve properties of, and relations between, rows of the FSM. Computationally, our algorithm only requires row-wise correlation analysis in the FSM and a heuristic solution of an instance of the set cover problem. Results are demonstrated on several data sets showing the identification of curve styles. We also develop and demonstrate several style-related applications including style exaggeration, removal, blending, and style transfer for 2D shape synthesis.", "paper_title": "Curve Style Analysis in a Set of Shapes", "paper_id": "WOS:000334853000010"}