{"auto_keywords": [{"score": 0.0442410131848582, "phrase": "case_studies"}, {"score": 0.00481495049065317, "phrase": "case_studies_synthesis"}, {"score": 0.004565007074039171, "phrase": "software_engineering_practices"}, {"score": 0.0044111930537670705, "phrase": "data_collection"}, {"score": 0.004295136518467118, "phrase": "qualitative_data"}, {"score": 0.0040720661634333424, "phrase": "individual_cases"}, {"score": 0.003831224748279043, "phrase": "software_engineering"}, {"score": 0.003365529624506815, "phrase": "reported_case_studies"}, {"score": 0.0033399704305248465, "phrase": "se."}, {"score": 0.0032894118890753805, "phrase": "worked_example"}, {"score": 0.0031784407245606704, "phrase": "critical_factors"}, {"score": 0.003130325700934738, "phrase": "outsourced_projects"}, {"score": 0.003106541164572609, "phrase": "thematic_synthesis"}, {"score": 0.0030829367866722825, "phrase": "cross-case_analysis"}, {"score": 0.0029450186031370245, "phrase": "already_published_narrative_synthesis"}, {"score": 0.0028565082986974602, "phrase": "primary_studies"}, {"score": 0.0027079507175554857, "phrase": "case_studies_synthesis_methods"}, {"score": 0.002646665861584495, "phrase": "research_questions"}, {"score": 0.0024615764782448214, "phrase": "raw_data"}], "paper_keywords": ["Evidence-based software engineering", " Systematic reviews", " Research synthesis", " Case study"], "paper_abstract": "Case studies are largely used for investigating software engineering practices. They are characterized by their flexible nature, multiple forms of data collection, and are mostly informed by qualitative data. Synthesis of case studies is necessary to build a body of knowledge from individual cases. There are many methods for such synthesis, but they are yet not well explored in software engineering. The objective of this research is to demonstrate the similarities and differences of the results and conclusions when applying three different methods of synthesis, and to discuss the challenges of synthesizing evidence from reported case studies in SE. We describe a worked example of three such methods where three independent teams synthesized two studies that investigated critical factors of trust in outsourced projects through thematic synthesis and cross-case analysis, and compared these to each other and also to an already published narrative synthesis. In addition, despite that the primary studies were well presented for synthesis, we identified challenges in the use of case studies synthesis methods related to the goals and research questions of the synthesis, the types and number of case studies, variations in context, limited access to raw data, and quality of the case studies. Thus, we recommend that the analysts should be aware of these challenges and try to account for them during the execution of the synthesis. We also recommend that analysts consider using more than one method of synthesis for sake of reliability of the results and conclusions.", "paper_title": "Case studies synthesis: a thematic, cross-case, and narrative synthesis worked example", "paper_id": "WOS:000363032900007"}