{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "online_resources"}, {"score": 0.04968705263604004, "phrase": "informal_learners"}, {"score": 0.040633623956958555, "phrase": "online_resource"}, {"score": 0.004564401713056939, "phrase": "web_technology_development"}, {"score": 0.004489952932659799, "phrase": "new_ways"}, {"score": 0.004362564831572539, "phrase": "new_information"}, {"score": 0.003824547895167011, "phrase": "public_library"}, {"score": 0.0032174507570710835, "phrase": "young_children"}, {"score": 0.0029147175927233546, "phrase": "online_parenting_portal"}, {"score": 0.0028908104750148245, "phrase": "kidzgrow_online"}, {"score": 0.0023527296826339225, "phrase": "significant_differences"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["adult learning", " learning communities", " lifelong learning", " interactive learning environment"], "paper_abstract": "The Internet and Web technology development have opened tip new ways for people to communicate, gain new information and increase their knowledge. One particular area of interest is that of using online resources to empower informal learners to increase their knowledge at their own time and space. One could look at an online resource as a public library being brought to the homes of such informal learners. The goal of the study described in this paper was to present evidence of the impact of online resources on such informal learners. In this study, the informal learners were a group of parents with young children aged between 0 and 6, and the knowledge being learned informally was that of their knowledge of and attitudes to their parenting skills. This study used an online parenting portal, KidzGrow Online, to identify if and how an online resource could impact on the group of parents with regard to the time they spent with their children, their own perceived level of knowledge of their children's development, and the level of their self-confidence in their parenting role. The study showed that after a period of three months, significant differences could be observed between the responses from parents who had access to the online resource and those from parents who did not. (C) 2007 Elsevier Ltd. All rights reserved.", "paper_title": "Impact of online resources on informal learners: Parents' perception of their parenting skills", "paper_id": "WOS:000257103500012"}