{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "approximate_counting"}, {"score": 0.004662427600500598, "phrase": "computational_procedures"}, {"score": 0.004210458358142504, "phrase": "weakest_possible_assumptions"}, {"score": 0.0036227329311981195, "phrase": "poly-size_nondeterministic_circuits"}, {"score": 0.0034148795808317555, "phrase": "poly-size_circuits"}, {"score": 0.0033602844686125375, "phrase": "non-adaptive_np_oracle_queries"}, {"score": 0.0030834712590249863, "phrase": "arthur-merlin_games"}, {"score": 0.0027395968397212053, "phrase": "natural_pseudorandom_objects"}, {"score": 0.002568435291444709, "phrase": "\"boosting\"_theorem"}, {"score": 0.0022574539115388054, "phrase": "cai's_proof"}, {"score": 0.0021049977753042253, "phrase": "bshouty_et_al"}], "paper_keywords": ["derandomization", " pseudorandomness", " Arthur Merlin games", " approximate counting", " nondeterministic circuits"], "paper_abstract": "We study computational procedures that use both randomness and nondeterminism. The goal of this paper is to derandomize such procedures under the weakest possible assumptions. Our main technical contribution allows one to \"boost\" a given hardness assumption: We show that if there is a problem in EXP that cannot be computed by poly-size nondeterministic circuits then there is one which cannot be computed by poly-size circuits that make non-adaptive NP oracle queries. This in particular shows that the various assumptions used over the last few years by several authors to derandomize Arthur-Merlin games (i.e., show AM = NP) are in fact all equivalent. We also define two new primitives that we regard as the natural pseudorandom objects associated with approximate counting and sampling of NP-witnesses. We use the \"boosting\" theorem and hashing techniques to construct these primitives using an assumption that is no stronger than that used to derandomize AM. We observe that Cai's proof that S-2(P) subset of ZPP(NP) and the learning algorithm of Bshouty et al. can be seen as reductions to sampling that are not probabilistic. As a consequence they can be derandomized under an assumption which is weaker than the assumption that was previously known to suffice.", "paper_title": "Pseudorandomness for approximate counting and sampling", "paper_id": "WOS:000246611200002"}