{"auto_keywords": [{"score": 0.04942974457592767, "phrase": "dssp"}, {"score": 0.04910845908100794, "phrase": "stride"}, {"score": 0.010612380732933142, "phrase": "conformationally_irregular_peptides"}, {"score": 0.009649880028678963, "phrase": "dihedral_angles"}, {"score": 0.004685224205630963, "phrase": "kaksi."}, {"score": 0.004669254965563445, "phrase": "secondary_structure_assignment_codes"}, {"score": 0.004512512374933493, "phrase": "periodic_motifs"}, {"score": 0.004331320910631647, "phrase": "hydrogen_bonds"}, {"score": 0.004301834610818624, "phrase": "backbone_atoms"}, {"score": 0.0042725481832853315, "phrase": "precise_structure_assignment"}, {"score": 0.0037910145286595386, "phrase": "well-ordered_structures"}, {"score": 0.0037140731069193896, "phrase": "secondary_structure_assignments"}, {"score": 0.003516417950483685, "phrase": "great_opportunity"}, {"score": 0.003352088714126572, "phrase": "unfolded_proteins"}, {"score": 0.00332924643541238, "phrase": "intrinsically_disordered_proteins"}, {"score": 0.0030985717040741875, "phrase": "molecular_dynamics_simulations"}, {"score": 0.002825251837733693, "phrase": "resulting_conformations"}, {"score": 0.002748984715897838, "phrase": "hydrogen-bond_patterns"}, {"score": 0.0026656357767832245, "phrase": "kaksi"}, {"score": 0.002629405440065951, "phrase": "alpha-carbon_distances"}, {"score": 0.0025584115892805384, "phrase": "structural_assignments"}, {"score": 0.002285216591220303, "phrase": "major_differences"}, {"score": 0.002148677187261496, "phrase": "short_parallel-sheet_segments"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Residual transient secondary structure", " Intrinsically disordered proteins", " gp41", " Asparagine"], "paper_abstract": "Secondary structure assignment codes were built to explore the regularities associated with the periodic motifs of proteins, such as those in backbone dihedral angles or in hydrogen bonds between backbone atoms. Precise structure assignment is challenging because real-life secondary structures are susceptible to bending, twist, fraying and other deformations that can distance them from their geometrical prototypes. Although results from codes such as DSSP and STRIDE converge in well-ordered structures, the agreement between the secondary structure assignments is known to deteriorate as the conformations become more distorted. Conformationally irregular peptides therefore offer a great opportunity to explore the differences between these codes. This is especially important for unfolded proteins and intrinsically disordered proteins, which are known to exhibit residual and/or transient secondary structure whose characterization is challenging. In this work, we have carried out Molecular Dynamics simulations of (relatively) disordered peptides, specifically gp41(659-671) (ELLELDKWASLWN), the homopeptide polyasparagine (N-18), and polyasparagine dimers. We have analyzed the resulting conformations with DSSP and STRIDE, based on hydrogen-bond patterns (and dihedral angles for STRIDE), and KAKSI, based on alpha-Carbon distances; and carefully characterized the differences in structural assignments. The full-sequence Segment Overlap (SOV) scores, that quantify the agreement between two secondary structure assignments, vary from 70% for gp41(659-671) (STRIDE as reference) to 49% for N-18 (DSSP as reference). Major differences are observed in turns, in the distinction between alpha and 3(10) helices, and in short parallel-sheet segments. (C) 2014 Elsevier Inc. All rights reserved.", "paper_title": "Secondary structure assignment for conformationally irregular peptides: Comparison between DSSP, STRIDE and KAKSI", "paper_id": "WOS:000349587100008"}