{"auto_keywords": [{"score": 0.03527393672202497, "phrase": "parameter_reduction"}, {"score": 0.011500980600084773, "phrase": "decision-making_problems"}, {"score": 0.010779277056841473, "phrase": "interval-valued_fuzzy_soft_sets"}, {"score": 0.00456020621016909, "phrase": "rapid_growth"}, {"score": 0.003831801113154043, "phrase": "soft_set_theory"}, {"score": 0.0037903327482565097, "phrase": "interval-valued_fuzzy_set"}, {"score": 0.0028715299874549245, "phrase": "decision_makers"}, {"score": 0.002575167114383286, "phrase": "easy_degree"}, {"score": 0.0024788167298469455, "phrase": "reduction_result"}, {"score": 0.0021396960731214203, "phrase": "redundant_parameters"}], "paper_keywords": ["Interval-valued fuzzy soft set (IVFSS)", " parameter reduction", " soft set"], "paper_abstract": "There has been a rapid growth of interest in developing approaches that are capable of dealing with imprecision and uncertainty. To this end, an interval-valued fuzzy soft set (IVFSS) that combines soft set theory with interval-valued fuzzy set theory has been proposed to handle imprecision and uncertainty in applications such as decision-making problems. However, there has been little focus on parameter reduction of the interval-valued fuzzy soft sets, which is significant in decision-making problems. In this paper, we introduce four different definitions of parameter reduction in interval-valued fuzzy soft sets to satisfy different the needs of decision makers. We propose four heuristic algorithms of parameter reduction. Finally, the algorithms are compared and summarized from the aspects of easy degree of finding reduction, applicability, reduction result, exact level for reduction, multiusability, applied situation, and computational complexity. The results of the experiment show that the methods reduce the redundant parameters while preserving certain decision abilities.", "paper_title": "The Parameter Reduction of the Interval-Valued Fuzzy Soft Sets and Its Related Algorithms", "paper_id": "WOS:000331297300005"}