{"auto_keywords": [{"score": 0.04458427491156137, "phrase": "drug_costs"}, {"score": 0.015719716506582538, "phrase": "dermatologists'_knowledge"}, {"score": 0.014952383337679898, "phrase": "dermatologists'_attitudes"}, {"score": 0.008071878759457607, "phrase": "information_system_technologies"}, {"score": 0.004782587436296574, "phrase": "prescription_medication_costs"}, {"score": 0.004686791459644141, "phrase": "recent_rising_costs"}, {"score": 0.003919404114585274, "phrase": "new_information_system_technologies"}, {"score": 0.003879919492075319, "phrase": "prescription_medication_price_transparency"}, {"score": 0.003751143724152193, "phrase": "novel_solutions"}, {"score": 0.003459191419478298, "phrase": "north_carolina_dermatology_association"}, {"score": 0.003344332868248692, "phrase": "online_survey"}, {"score": 0.0031577303835881964, "phrase": "prescription_medications"}, {"score": 0.0030839447259626215, "phrase": "authoritative_price"}, {"score": 0.0030220695120265974, "phrase": "survey_takers'_price_estimates"}, {"score": 0.0029414903557512663, "phrase": "physicians'_willingness"}, {"score": 0.0028824650336365465, "phrase": "drug_price_transparency"}, {"score": 0.002767934112798688, "phrase": "important_factor"}, {"score": 0.0027492917990724467, "phrase": "patient_care"}, {"score": 0.0027032319980161805, "phrase": "price_information"}, {"score": 0.002640038329840458, "phrase": "higher_quality"}, {"score": 0.0024179512279236207, "phrase": "drug_pricing_information"}, {"score": 0.002361410799860054, "phrase": "unmet_demand"}, {"score": 0.002321834168782981, "phrase": "price_transparency"}, {"score": 0.0022145052062614514, "phrase": "novel_information_systems"}, {"score": 0.002148136905808445, "phrase": "conscious_clinical_decision_making"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ireland_ltd."}], "paper_keywords": ["Dermatology", " Price", " Cost", " Drugs", " Medications", " Knowledge", " Information systems"], "paper_abstract": "Objectives: Despite the recent rising costs of once affordable dermatologic prescription medications, a survey measuring dermatologists' attitudes, beliefs, and knowledge of the cost of drugs they commonly prescribe has not been conducted. Awareness of drug costs is hindered by a lack of access to data about the prices of medicines. No surveys of physicians have addressed this issue by proposing new information system technologies that augment prescription medication price transparency and measuring how receptive physicians are to using these novel solutions in their daily clinical practice. Our research aims to investigate these topics with a survey of physicians in dermatology. Methods: Members of the North Carolina Dermatology Association were contacted through their electronic mailing list and asked to take an online survey. The survey asked several questions about dermatologists' attitudes and beliefs about drug costs. To measure their knowledge of prescription medications, the National Average Drug Acquisition Cost was used as an authoritative price that was compared to the survey takers' price estimates of drugs commonly used in dermatology. Physicians' willingness to use four distinct information system technologies that increase drug price transparency was also assessed. Results: Dermatologists believe drug costs are an important factor in patient care and believe access to price information would allow them to provide a higher quality of care. Dermatologists' knowledge of the costs of medicines they commonly prescribe is poor, but they want to utilize information system technologies that increase access to drug pricing information. Conclusions: There is an unmet demand for information system technologies which increase price transparency of medications in dermatology. Physicians and IT professionals have the opportunity to create novel information systems that can be utilized to help guide cost conscious clinical decision making. (C) 2015 Elsevier Ireland Ltd. All rights reserved.", "paper_title": "Information system technologies' role in augmenting dermatologists' knowledge of prescription medication costs", "paper_id": "WOS:000363858100009"}