{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "molecular_dynamics_simulation"}, {"score": 0.004424441580112395, "phrase": "isoform-specific_selectivity"}, {"score": 0.003960972732123083, "phrase": "protein_flexibility"}, {"score": 0.0036871853429163953, "phrase": "representative_structures"}, {"score": 0.0035923719610602245, "phrase": "clustering_analysis"}, {"score": 0.003477264432055326, "phrase": "explicit_aqueous_solution"}, {"score": 0.00307240091019322, "phrase": "comparative_analysis"}, {"score": 0.0029545864975783023, "phrase": "gamma_docking_experiments"}, {"score": 0.0025934566395017424, "phrase": "solvent-accessible_region_call"}, {"score": 0.002413964586947992, "phrase": "predicted_bound_conformations"}, {"score": 0.002336527289457915, "phrase": "aqueous_solution"}, {"score": 0.0022177498761722773, "phrase": "possible_effective_pharmacophore_model"}, {"score": 0.00214659338413584, "phrase": "dynamic_behaviors"}], "paper_keywords": [""], "paper_abstract": "The combination of docking and molecular dynamics simulation is used to explain the isoform-specific selectivity between PI3K alpha and PI3K gamma, which are two lipid kinases in the class I PI3Ks. The protein flexibility is incorporated ill docking the ligands to the ensemble of representative structures extracted from a clustering analysis of the molecular dynamics simulation in explicit aqueous solution. The reported most potent PI3K alpha inhibitor PIK-75 was Studied, and we predicted three possible PIK-75-bound conformations for PI3K alpha and two for PI3K gamma. Comparative analysis between the PI3K alpha and PI3K gamma docking experiments indicates that the residue Trp780 and Asn782 in PI3K alpha and the corresponding residues Trp812 and GIu814 in PI3K gamma in the solvent-accessible region call confer the PI3K alpha and P13Ky isoforin Specificity. The predicted bound conformations are further Studied in aqueous Solution by molecular dynamics simulation. The work provides a possible effective pharmacophore model for PI3K alpha inhibitor. The dynamic behaviors of the LY294002-bound PI3Ks are Studied too.", "paper_title": "Class I Phospho-inositide-3-kinases (PI3Ks) Isoform-Specific Inhibition Study by the Combination of Docking and Molecular Dynamics Simulation", "paper_id": "WOS:000273794500013"}