{"auto_keywords": [{"score": 0.04067588703944529, "phrase": "complexity_theory"}, {"score": 0.0039402177950179345, "phrase": "non-deterministic_process"}, {"score": 0.003513443975425428, "phrase": "alignment_results"}, {"score": 0.0031845067058084583, "phrase": "organization's_goals"}, {"score": 0.002921975748248106, "phrase": "established_organizations"}, {"score": 0.0027477745788313163, "phrase": "enterprise_architectures"}, {"score": 0.0027141975147496264, "phrase": "development_projects"}, {"score": 0.002510843167476253, "phrase": "prior_research"}, {"score": 0.002266246304762945, "phrase": "complex_adaptive_systems"}, {"score": 0.0021049977753042253, "phrase": "potential_benefits"}], "paper_keywords": ["Complexity Theory Worldview", " Sustainable IS Alignment", " Complex Adaptive Systems", " Co-Evolution", " Self-Organization", " Emergence"], "paper_abstract": "Our research addresses one of the most vexing issues in IS, that of how IS alignment occurs. Even more vexing, and largely unaddressed, is the issue of sustainable IS alignment. We address sustainable IS alignment as a dynamic, multi-faceted, and non-deterministic process based on the complexity theory worldview. The complexity theory worldview conceives of organizations and IS as complex adaptive systems (CAS) that co-evolve over time. Sustainable IS alignment results when an organization's complex adaptive IS adapt to remain in alignment with the constantly-changing (that is, evolving) organization's goals. Our co-evolutionary theory of IS alignment links bottom-up, emergent processes that foster adaptivity with top-down, formal organizational processes essential to established organizations. We illustrate the theory by applying it to the co-evolution and therefore adaptation of enterprise architectures and IS development projects. Our research on the role of co-evolution in sustainable IS alignment contributes to IS research in general and to prior research on IS alignment in particular, and has implications for achieving sustainable IS alignment. We believe that portraying organizations and their IS as complex adaptive systems that co-evolve provides both research and practice with a way to move forward in their endeavors to realize the potential benefits from using IS to enable businesses.", "paper_title": "The Dynamics of Sustainable IS Alignment: The Case for IS Adaptivity", "paper_id": "WOS:000323166600001"}