{"auto_keywords": [{"score": 0.02545876227828735, "phrase": "run_time"}, {"score": 0.014675103340985613, "phrase": "flowplace"}, {"score": 0.00481495049065317, "phrase": "discretized_network_flow_techniques"}, {"score": 0.004614745158543967, "phrase": "white-space_satisfaction"}, {"score": 0.004526503177267299, "phrase": "novel_incremental_placement_methodology"}, {"score": 0.004422827355213055, "phrase": "critical_path_delays"}, {"score": 0.004388796812234033, "phrase": "placed_standard-cell_circuits"}, {"score": 0.004304856672196293, "phrase": "wire_length"}, {"score": 0.003923671536980019, "phrase": "quadratic_objective_functions"}, {"score": 0.0033357416981328577, "phrase": "td-incremental_placement"}, {"score": 0.0031764152417944223, "phrase": "k"}, {"score": 0.003111472132927442, "phrase": "wl-optimized_placements"}, {"score": 0.0030283730114326014, "phrase": "purely_timing-driven_incremental_placement"}, {"score": 0.002846647336160784, "phrase": "circuit_delays"}, {"score": 0.002675797331220082, "phrase": "objective_functions"}, {"score": 0.0026551731045904854, "phrase": "global_and_detailed_placement"}, {"score": 0.002624533657819515, "phrase": "average_wl_increase"}, {"score": 0.0025054621733192283, "phrase": "average_delay_improvement"}, {"score": 0.0022394839933089074, "phrase": "already_timing-optimized_placement"}], "paper_keywords": ["Discretized min-cost network flow", " incremental placement", " probabilistic wire-length cost", " timing optimization", " white space constraint", " wire-length optimization"], "paper_abstract": "We present a novel incremental placement methodology called FlowPlace for significantly reducing critical path delays of placed standard-cell circuits without appreciable increase in wire length (WL). FlowPlace includes: 1) a timing-driven (TD) analytical global placer TAN that uses accurate pre-route delay functions and minimizes a combination of linear and quadratic objective functions; 2) a discretized network-flow-based detailed placer DFP that has new and effective techniques for performing TD/WL-driven incremental placement while satisfying row-width (white space) constraints; 3) new and accurate unrouted net delay models that are suitable for an analytical placer; and 4) an effective probability-based WL-cost function in detailed placement for reducing WL deterioration while performing TD-incremental placement. We ran FlowPlace on three sets of benchmarks with up to 210 K cells. Starting from WL-optimized placements done by Dragon 2.23, and using purely timing-driven incremental placement, we are able to obtain up to 33.4% and an average of 17.3% improvement in circuit delays at an average of 9.0% WL increase. When incorporating both timing and WL costs in the objective functions of global and detailed placement, the average WL increase reduces to 5.8%, a 35% relative reduction, while the average delay improvement is 15.7%, which is only relatively 9% worse. The run time of our incremental placement method is only about 10% of the run time of Dragon 2.23. Furthermore, starting from an already timing-optimized placement done by TD-Dragon, we still obtain up to 10% and an average of 6.5% delay improvement with a 6.1% WL deterioration; the run time is about 6% of TD-Dragon's.", "paper_title": "Discretized Network Flow Techniques for Timing and Wire-Length Driven Incremental Placement With White-Space Satisfaction", "paper_id": "WOS:000292098600014"}