{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "hierarchical_planning"}, {"score": 0.03291545756515268, "phrase": "new_plans"}, {"score": 0.004585433265422727, "phrase": "hierarchically_arranged_predefined_plans"}, {"score": 0.004313793774439379, "phrase": "domain_expert"}, {"score": 0.004261419841494814, "phrase": "semantic_and_structural_knowledge"}, {"score": 0.004091370602573054, "phrase": "incomplete_ill-defined_knowledge"}, {"score": 0.0035189057079817285, "phrase": "appropriate_knowledge"}, {"score": 0.003419943984098415, "phrase": "problem_domain"}, {"score": 0.0033646448121751574, "phrase": "missing_knowledge"}, {"score": 0.0032302647179383915, "phrase": "novel_neural-based_model"}, {"score": 0.0030635374056374016, "phrase": "necessary_knowledge"}, {"score": 0.0028351712509358997, "phrase": "inherent_features"}, {"score": 0.002560352786969071, "phrase": "new_representation_technique"}, {"score": 0.0024984517279573906, "phrase": "so-called_ifalcon_architecture"}, {"score": 0.0024480094603893175, "phrase": "sequential_and_hierarchical_relations"}, {"score": 0.002379092507901856, "phrase": "case_studies"}, {"score": 0.002359759876402679, "phrase": "blocks_world_domain"}, {"score": 0.0023121112251855667, "phrase": "unreal_tournament_video_game"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Hierarchical planning", " Plan learning", " Adaptive resonance theory"], "paper_abstract": "Hierarchical planning is an approach of planning by composing and executing hierarchically arranged predefined plans on the fly to solve some problems. This approach commonly relies on a domain expert providing all semantic and structural knowledge. One challenge is how the system deals with incomplete ill-defined knowledge while the solution can be achieved on the fly. Most symbolic-based hierarchical planners have been devised to allow the knowledge to be described expressively. However, in some cases, it is still difficult to produce the appropriate knowledge due to the complexity of the problem domain especially if the missing knowledge must be acquired online. This paper presents a novel neural-based model of hierarchical planning that can seek and acquire new plans online if the necessary knowledge are lacking. It enables all propositions and descriptions of plans to be computed and learnt simultaneously as inherent features of the model rather than discretely processed like in most symbolic approaches. Using a multi-channel adaptive resonance theory (fusion ART) neural network as the basic building block of the architecture and a new representation technique called gradient encoding, the so-called iFALCON architecture can capture and manipulate sequential and hierarchical relations of plans on the fly. Case studies using blocks world domain and an agent in Unreal Tournament video game demonstrate that the model can be used to execute, plan, and discover new plans through experiences. (C) 2012 Elsevier B.V. All rights reserved.", "paper_title": "iFALCON: A neural architecture for hierarchical planning", "paper_id": "WOS:000303428700012"}