{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "mobile_health"}, {"score": 0.01437928293296659, "phrase": "healthcare_professionals"}, {"score": 0.013619187037999166, "phrase": "mobile_technologies"}, {"score": 0.0053678352816441096, "phrase": "proposed_enhancements"}, {"score": 0.0047587234712024775, "phrase": "rapid_and_wide-scale_introduction"}, {"score": 0.004575977644865379, "phrase": "emerging_area"}, {"score": 0.004469700997700534, "phrase": "major_implications"}, {"score": 0.004331811712726697, "phrase": "infrastructure_providers"}, {"score": 0.004084584884062157, "phrase": "instant_and_ubiquitous_access"}, {"score": 0.00385141330111392, "phrase": "additional_complexity"}, {"score": 0.003128798520531889, "phrase": "conceptual_design"}, {"score": 0.003092200512475624, "phrase": "mobile_health_alert_generation"}, {"score": 0.002881403688962202, "phrase": "analytical_model"}, {"score": 0.002847691227421257, "phrase": "multiple_metrics"}, {"score": 0.002472552537325604, "phrase": "additional_enhancements"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Mobile health", " Context-awareness", " Decisions", " Performance evaluation", " Analytical modeling"], "paper_abstract": "The rapid and wide-scale introduction of mobile technologies in healthcare is resulting in an emerging area of mobile health, m-Health has major implications for patients, healthcare professionals, developers, infrastructure providers and regulators in both developed and developing countries. Mobile technologies can not only support instant and ubiquitous access to information, healthcare professionals and patients, but can also create many interesting challenges, including additional complexity and potential for various errors. In this paper, we address how mobile health can be more effectively supported by mobile technologies. More specifically, we present two sets of enhancements: (a) context-awareness and processing and (b) improved presentation of information to healthcare professionals. These enhancements are then applied in the conceptual design of a mobile health alert generation and processing system. To evaluate the effectiveness of the proposed enhancements, we develop and utilize an analytical model. Using multiple metrics, including the number of alerts generated and probability of error in alert-response, we show that the proposed enhancements can improve the quality of mobile health. We hope that other researchers design, implement and evaluate additional enhancements in mobile technologies for m-health. While we do not present any prototypes of the systems, the work presented in the paper can lead to prototypes and testing of systems in the future for mobile health. (C) 2014 Elsevier B.V. All rights reserved.", "paper_title": "A model for improving quality of decisions in mobile health", "paper_id": "WOS:000336825900007"}