{"auto_keywords": [{"score": 0.04637861632710295, "phrase": "user_inputs"}, {"score": 0.00481495049065317, "phrase": "unified_combinatorial_user_inputs"}, {"score": 0.004680473391946691, "phrase": "existing_interactive_image_segmentation_algorithms"}, {"score": 0.004218602458288531, "phrase": "multiple_intuitive_user_inputs"}, {"score": 0.004120130206000757, "phrase": "user's_intention"}, {"score": 0.0032376465741070274, "phrase": "background_seed_input"}, {"score": 0.0030735451757603555, "phrase": "background_seeds"}, {"score": 0.003030247482854539, "phrase": "soft_constraint_input"}, {"score": 0.002769805263310232, "phrase": "hard_constraint_input"}, {"score": 0.002449208093757498, "phrase": "constrained_random"}, {"score": 0.0022385926290967263, "phrase": "proposed_framework"}, {"score": 0.002125020720324262, "phrase": "wide_variety"}, {"score": 0.0021049977753042253, "phrase": "natural_images"}], "paper_keywords": ["Digital image editing", " interactive image segmentation", " multiple user inputs", " random walks algorithm"], "paper_abstract": "One weakness in the existing interactive image segmentation algorithms is the lack of more intelligent ways to understand the intention of user inputs. In this paper, we advocate the use of multiple intuitive user inputs to better reflect a user's intention. In particular, we propose a constrained random walks algorithm that facilitates the use of three types of user inputs: 1) foreground and background seed input, 2) soft constraint input, and 3) hard constraint input, as well as their combinations. The foreground and background seed input allows a user to draw strokes to specify foreground and background seeds. The soft constraint input allows a user to draw strokes to indicate the region that the boundary should pass through. The hard constraint input allows a user to specify the pixels that the boundary must align with. Our proposed method supports all three types of user inputs in one coherent computational framework consisting of a constrained random walks and a local editing algorithm, which allows more precise contour refinement. Experimental results on two benchmark data sets show that the proposed framework is highly effective and can quickly and accurately segment a wide variety of natural images with ease.", "paper_title": "User-Friendly Interactive Image Segmentation Through Unified Combinatorial User Inputs", "paper_id": "WOS:000283124600020"}