{"auto_keywords": [{"score": 0.026498352208465265, "phrase": "exchange_values"}, {"score": 0.00481495049065317, "phrase": "non-monetary_exchanges"}, {"score": 0.0045464538515249085, "phrase": "cooperative_initiatives"}, {"score": 0.004511799033574768, "phrase": "different_domains"}, {"score": 0.004375789703278455, "phrase": "global_communities"}, {"score": 0.00411589720697736, "phrase": "formal_payment_system"}, {"score": 0.0038418515481939463, "phrase": "recognised_need"}, {"score": 0.0037546039916845947, "phrase": "ad_hoc_approach"}, {"score": 0.003585986761045987, "phrase": "agent-oriented_paradigm"}, {"score": 0.0035045293923775256, "phrase": "natural_way"}, {"score": 0.003296212583539166, "phrase": "agent-oriented_system"}, {"score": 0.0032710562699144814, "phrase": "today's_cooperative_systems"}, {"score": 0.0031240868074933078, "phrase": "non-monetary_incentives"}, {"score": 0.0027635643494432365, "phrase": "key_contribution"}, {"score": 0.002680114113899346, "phrase": "non-monetary_interactions"}, {"score": 0.0026596472456182707, "phrase": "self-interested_agents"}, {"score": 0.002540078552743003, "phrase": "analysing_cooperations"}, {"score": 0.0025110337774260773, "phrase": "piaget's_theory"}, {"score": 0.002444544487772349, "phrase": "computational_model"}, {"score": 0.0021049977753042253, "phrase": "empirical_evaluation"}], "paper_keywords": ["Agent-oriented computing", " cooperative systems", " exchange values"], "paper_abstract": "Today there is an increase in the number of cooperative initiatives in different domains to make tools and data available to global communities free or charge. Such cooperative systems are open, heterogeneous, dynamic, and lack a formal payment system. Incentivising cooperation in these scenarios is essential to maintain their effectiveness. Therefore, there is a recognised need to move away from an ad hoc approach to one in which cooperation is supported and encouraged. The agent-oriented paradigm has been advocated as a natural way to design and implement systems that are distributed and heterogeneous. However, developing an agent-oriented system for today's cooperative systems is challenging. It requires a means not only to provide non-monetary incentives for service providers, but also to consider the level of quality of cooperations, in terms of the quality of provided and received services. In this context, the key contribution of this paper is a framework for non-monetary interactions among self-interested agents, in which the motivation to cooperate and the bases for analysing cooperations come from Piaget's theory of exchange values. Our framework includes a computational model of these values, which defines how exchange values are accumulated and spent by interacting agents. We illustrate how our framework can be used by agents to analyze cooperations and to take decisions about them, and provide an empirical evaluation.", "paper_title": "Effective Cooperations Through Non-Monetary Exchanges: A Computational Framework", "paper_id": "WOS:000341011000003"}