{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "protein-protein_interactions"}, {"score": 0.034474914297590295, "phrase": "physical_interactions"}, {"score": 0.004747771713778112, "phrase": "molecular_details"}, {"score": 0.004438075106846512, "phrase": "principal_element"}, {"score": 0.004363846362238565, "phrase": "cell_architecture"}, {"score": 0.004278807087784626, "phrase": "relevant_role"}, {"score": 0.003954837422946628, "phrase": "precise_targets"}, {"score": 0.0038668462001710314, "phrase": "particular_transcription_factor"}, {"score": 0.00350425549695367, "phrase": "particular_time"}, {"score": 0.003284637361174143, "phrase": "mingled_network"}, {"score": 0.002893848939571513, "phrase": "systemic_and_atomic_level"}, {"score": 0.0026148807877309417, "phrase": "different_levels"}, {"score": 0.0025710670135348198, "phrase": "molecular_structure"}, {"score": 0.002535115422089855, "phrase": "global_topology"}, {"score": 0.002323142666222693, "phrase": "model_network"}, {"score": 0.0022906498741695094, "phrase": "actual_problems"}, {"score": 0.0021408862709571615, "phrase": "current_knowledge"}, {"score": 0.0021168934012668755, "phrase": "modern_network_medicine"}, {"score": 0.0021049977753042253, "phrase": "protein_function_annotation"}], "paper_keywords": ["Protein interactions", " Interactome", " Interface", " Experimental methods", " Computational methods"], "paper_abstract": "Proteins are the bricks and mortar of cells. The work of proteins is structural and functional, as they are the principal element of the organization of the cell architecture, but they also play a relevant role in its metabolism and regulation. To perform all these functions, proteins need to interact with each other and with other bio-molecules, either to form complexes or to recognize precise targets of their action. For instance, a particular transcription factor may activate one gene or another depending on its interactions with other proteins and not only with DNA. Hence, the ability of a protein to interact with other bio-molecules, and the partners they have at each particular time and location can be crucial to characterize the role of a protein. Proteins rarely act alone; they rather constitute a mingled network of physical interactions or other types of relationships (such as metabolic and regulatory) or signaling cascades. In this context, understanding the function of a protein implies to recognize the members of its neighborhood and to grasp how they associate, both at the systemic and atomic level. The network of physical interactions between the proteins of a system, cell or organism, is defined as the interactome. The purpose of this review is to deepen the description of interactomes at different levels of detail: from the molecular structure of complexes to the global topology of the network of interactions. The approaches and techniques applied experimentally and computationally to attain each level are depicted. The limits of each technique and its integration into a model network, the challenges and actual problems of completeness of an interactome, and the reliability of the interactions are reviewed and summarized. Finally, the application of the current knowledge of protein-protein interactions on modern network medicine and protein function annotation is also explored.", "paper_title": "Networks of Protein-Protein Interactions: From Uncertainty to Molecular Details", "paper_id": "WOS:000303857900002"}