{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "multibiometric-based_identification"}, {"score": 0.0047057084749407485, "phrase": "cancellable_biometrics"}, {"score": 0.004515252649226697, "phrase": "privacy_concerns"}, {"score": 0.004412780054037622, "phrase": "biometric_data"}, {"score": 0.004253618550301311, "phrase": "biometric_trait"}, {"score": 0.004195418010131832, "phrase": "new_but_revocable_representation"}, {"score": 0.003970439654470374, "phrase": "new_representation"}, {"score": 0.0039341294012600085, "phrase": "original_biometric_data"}, {"score": 0.0037921662574137535, "phrase": "multi-biometric_systems"}, {"score": 0.0035887342563437935, "phrase": "uni-biometric_systems"}, {"score": 0.00338060449446278, "phrase": "ensemble_systems"}, {"score": 0.003349670229755675, "phrase": "cancellable_transformations"}, {"score": 0.0033037970113095577, "phrase": "multi-biometric_context"}, {"score": 0.002985988377995789, "phrase": "multi-modal_context"}, {"score": 0.0026494723416072316, "phrase": "in-house_database"}, {"score": 0.002530359917257626, "phrase": "proposed_ensemble_systems"}, {"score": 0.002329258721870127, "phrase": "individual_classifiers"}], "paper_keywords": [""], "paper_abstract": "The concept of cancellable biometrics has been introduced as a way to overcome privacy concerns surrounding the management of biometric data. The goal is to transform a biometric trait into a new but revocable representation for enrolment and identification/verification. Thus, if compromised, a new representation of original biometric data can be generated. In addition, multi-biometric systems are increasingly being deployed in various biometric-based applications because of their advantages over uni-biometric systems. In this study, the authors specifically investigate the use of ensemble systems and cancellable transformations for the multi-biometric context, and the authors use as examples two different biometric modalities (fingerprint and handwritten signature) separately and in the multi-modal context (multi-biometric). The datasets to be used in this analysis were FVC2004 (fingerprint verification competition) for fingerprint and an in-house database for signature. To increase the effectiveness of the proposed ensemble systems, two feature selection (FS) methods will be used to distribute the attributes among the individual classifiers of an ensemble, increasing diversity and performance of such systems. As a result of this analysis, they will observe that the use of a cancellable transformation in the multibiometric dataset increased accuracy level for the ensemble systems, mainly when using FS methods.", "paper_title": "Ensemble systems and cancellable transformations for multibiometric-based identification", "paper_id": "WOS:000346562300004"}