{"auto_keywords": [{"score": 0.03739583461571027, "phrase": "physical_properties"}, {"score": 0.00481495049065317, "phrase": "good_molecular_views"}, {"score": 0.004733458808453602, "phrase": "molecular_structures"}, {"score": 0.004637478829869904, "phrase": "graphics_software"}, {"score": 0.004590217765551337, "phrase": "different_representations"}, {"score": 0.004436116555817464, "phrase": "commonly_available_visualization_software"}, {"score": 0.004316552692395911, "phrase": "high_degree"}, {"score": 0.004185874747231179, "phrase": "desired_images"}, {"score": 0.0040869663676860535, "phrase": "interesting_views"}, {"score": 0.0040452928361255445, "phrase": "considerable_time"}, {"score": 0.003990385737207714, "phrase": "nonexperienced_users"}, {"score": 0.0039362209515303795, "phrase": "desired_properties"}, {"score": 0.0034924598001567944, "phrase": "information_theory's_shannon_entropy"}, {"score": 0.0032173412933955117, "phrase": "low_amount"}, {"score": 0.0031091858573262265, "phrase": "first_ones"}, {"score": 0.002567180189640976, "phrase": "graphics_cards"}, {"score": 0.002455489835065937, "phrase": "good_results"}, {"score": 0.0023566987138026285, "phrase": "human_involvement"}, {"score": 0.002332626862738603, "phrase": "highly_complex_compounds"}, {"score": 0.002254145085288829, "phrase": "good_starting_point"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["realtime camera placement", " molecular graphics", " automatic scene exploration"], "paper_abstract": "The investigation of molecular structures often requires the use of graphics software to display different representations of the molecule of interest. Unfortunately, the commonly available visualization software is generally quite complex and requires a high degree of expertise for the user to obtain the desired images. Often, the selection of interesting views implies a considerable time and effort for nonexperienced users. Characterizing the desired properties the users may need is often impossible. In this paper we present a method to automatically determine certain views of molecules that can be used to study their chemical or physical properties. We have used Information Theory's Shannon entropy in order to characterize two kinds of views: views which show most of the structure of a molecule and views which show a low amount of information of an arrangement of molecules. The first ones can be used to study the composition of the molecule, that is to study certain chemical properties. The latter easily show how molecules are ordered in space and therefore are suitable to infer physical properties of compounds, such as resistance. Finally, we also present an adaptive, hardware accelerated algorithm that makes use of the features of graphics cards to make this calculation in realtime. Our method has proven to give good results as in most cases the views generated by our application can completely replace human involvement. For highly complex compounds, they can be either enough, or a good starting point. Often, our application also provides several views that could be missed by the users. (c) 2005 Elsevier Ltd. All rights reserved.", "paper_title": "Realtime automatic selection of good molecular views", "paper_id": "WOS:000235320600014"}