{"auto_keywords": [{"score": 0.04977329136950648, "phrase": "oral_absorption"}, {"score": 0.048718786750838995, "phrase": "molecular_descriptors"}, {"score": 0.0045598218623312675, "phrase": "chemical_compound"}, {"score": 0.004473027089024405, "phrase": "quantitative_structure-activity_relationships"}, {"score": 0.004208881856146758, "phrase": "feature_selection_methods"}, {"score": 0.0037743802306714545, "phrase": "embedded_feature_selection_algorithm"}, {"score": 0.003597181536943779, "phrase": "descriptor_selection"}, {"score": 0.0033737457695128233, "phrase": "feature_selection"}, {"score": 0.0030058503645435455, "phrase": "decision_tree"}, {"score": 0.002747599993498257, "phrase": "prediction_accuracy"}, {"score": 0.002730023736069673, "phrase": "qsar_models"}, {"score": 0.0026523079380037706, "phrase": "misclassification_costs"}, {"score": 0.002635339648135844, "phrase": "model_building"}, {"score": 0.002495411946660959, "phrase": "poorly_absorbed_compounds"}, {"score": 0.0024556852466581527, "phrase": "two-stage_feature_selection"}, {"score": 0.0024399717841513354, "phrase": "pre-processing_approach"}, {"score": 0.0024243586247372087, "phrase": "higher_model_accuracy"}, {"score": 0.0023934306706217797, "phrase": "one-stage_approach"}, {"score": 0.002340250894008014, "phrase": "random_forest_predictor_importance_method"}, {"score": 0.002259054486157494, "phrase": "five_filter_feature_selection_methods"}, {"score": 0.0021528432044086044, "phrase": "filter_pre-processing_feature_selection_methods"}, {"score": 0.0021049977753042253, "phrase": "better_interpretability"}], "paper_keywords": [""], "paper_abstract": "There are currently thousands of molecular descriptors that can be calculated to represent a chemical compound. Utilizing all molecular descriptors in Quantitative Structure-Activity Relationships (QSAR) modeling can result in overfitting, decreased interpretability, and thus reduced model performance. Feature selection methods can overcome some of these problems by drastically reducing the number of molecular descriptors and selecting the molecular descriptors relevant to the property being predicted. In particular, decision trees such as C&RT, although they have an embedded feature selection algorithm, can be inadequate since further down the tree there are fewer compounds available for descriptor selection, and therefore descriptors may be selected which are not optimal. In this work we compare two broad approaches for feature selection: (1) a \"two-stage\" feature selection procedure, where a pre-processing feature selection method selects a subset of descriptors, and then classification and regression trees (C&RT) selects descriptors from this subset to build a decision tree; (2) a \"one-stage\" approach where C&RT is used as the only feature selection technique. These methods were applied in order to improve prediction accuracy of QSAR models for oral absorption. Additionally, this work utilizes misclassification costs in model building to overcome the problem of the biased oral absorption data sets with more highly absorbed than poorly absorbed compounds. In most cases the two-stage feature selection with pre-processing approach had higher model accuracy compared with the one-stage approach. Using the top 20 molecular descriptors from the random forest predictor importance method gave the most accurate C&RT classification model. The molecular descriptors selected by the five filter feature selection methods have been compared in relation to oral absorption. In conclusion, the use of filter pre-processing feature selection methods and misclassification costs produce models with better interpretability and predictability for the prediction of oral absorption.", "paper_title": "Pre-processing Feature Selection for Improved C&RT Models for Oral Absorption", "paper_id": "WOS:000326480000021"}