{"auto_keywords": [{"score": 0.030186872121024486, "phrase": "xdp"}, {"score": 0.008255570578968256, "phrase": "experimental_results"}, {"score": 0.006418764184497612, "phrase": "global_placements"}, {"score": 0.005843665426795139, "phrase": "comparable_wirelength"}, {"score": 0.005359418447780102, "phrase": "legal_placements"}, {"score": 0.005280507842943138, "phrase": "aplace"}, {"score": 0.00477935341074215, "phrase": "rtl-to-gdsii_synthesis_process"}, {"score": 0.0046741260449047976, "phrase": "rapid_increase"}, {"score": 0.004651057147690674, "phrase": "ic_design_complexity"}, {"score": 0.004616666115467725, "phrase": "widespread_use"}, {"score": 0.00459387949974091, "phrase": "intellectual-property_blocks"}, {"score": 0.004548641579564892, "phrase": "so-called_mixed-size_placement"}, {"score": 0.00430764535666245, "phrase": "flexible_and_robust_mixed-size_legalization_scheme"}, {"score": 0.004212759658511567, "phrase": "global_placement"}, {"score": 0.004130165601475531, "phrase": "constraint_graphs"}, {"score": 0.0040996103024637295, "phrase": "longest_paths"}, {"score": 0.004029187256595917, "phrase": "chip_dimension"}, {"score": 0.003999376003434231, "phrase": "macro_coordinates"}, {"score": 0.00393066798511457, "phrase": "linear_programming"}, {"score": 0.0038631357705923124, "phrase": "lp_formulation"}, {"score": 0.0037593414153801394, "phrase": "density_control"}, {"score": 0.003533662113818541, "phrase": "lp-based_macro_assignment"}, {"score": 0.003413232230649291, "phrase": "greedy_alternative"}, {"score": 0.0033545600622020464, "phrase": "legalization_scheme"}, {"score": 0.0033050703534275717, "phrase": "three-step_mixed-size_detailed_placement_algorithm"}, {"score": 0.003192406091820197, "phrase": "standard_cells"}, {"score": 0.003114283314285167, "phrase": "window-based_cell_swapping"}, {"score": 0.002971062708157576, "phrase": "floorist"}, {"score": 0.0029344771385297163, "phrase": "similar_legalization_capability"}, {"score": 0.0027174633648555982, "phrase": "global_placement_results"}, {"score": 0.002624776882212556, "phrase": "native_detailed_placement"}, {"score": 0.002376972261157529, "phrase": "fengshui"}], "paper_keywords": ["optimization", " physical design", " placement"], "paper_abstract": "Placement is one of the most important steps in the RTL-to-GDSII synthesis process as it directly defines the interconnects. The rapid increase in IC design complexity and the widespread use of intellectual-property blocks have made the so-called mixed-size placement a very important topic in recent years. The contributions of this paper include the following: 1) It proposes a flexible and robust mixed-size legalization scheme. Two constraint graphs are constructed from the global placement. Adjustments are iteratively applied to the constraint graphs until the longest paths on both graphs fall within the chip dimension. The macro coordinates are then computed by solving a linear programming (LP) formulation. The LP formulation has also been extended to handle macro spreading for routing density control. Experimental results show that our scheme can effectively legalize macros for all the global placements generated by mPL6 [1] on IBM-MSwPins. Experimental results also show that LP-based macro assignment can significantly reduce the amount of perturbation introduced during legalization compared to a greedy alternative. 2) Starting from the legalization scheme, it further proposes a three-step mixed-size detailed placement algorithm, XDP. An enhanced greedy method is used to remove the overlap between standard cells while preserving the legality of macros. Sliding-window-based cell swapping is applied in the end to further reduce the wirelength. Experiments show that, when compared with Floorist [2] with similar legalization capability, using the global placements generated by mPL6 [3], XDP is seven times faster with 6% shorter wirelength. Experiments also show that, when applied to the set of global placement results generated by APlace 2.0 [4], XDP can produce comparable wirelength to the native detailed placement of APlace 2.0 and 2 % shorter wirelength compared with that with Fengshui 5.0 [5]. When applied to the set of global placements generated by mPL6, XDP is the only detailed placement that successfully produces legal placements for all 18 examples, whereas APlace and Fengshui failed for 3 and 16 of them, respectively. Furthermore, when legal placements can be compared, the wirelength produced by XDP is shorter by 8% on average compared with that with APlace. For scalability, XDP is ten times faster than APlace when applied to circuits with more than two million movable objects with comparable wirelength.", "paper_title": "A robust mixed-size legalization and detailed placement algorithm", "paper_id": "WOS:000258030600001"}