{"auto_keywords": [{"score": 0.027634457883630295, "phrase": "ioc"}, {"score": 0.00481495049065317, "phrase": "dimensionality_reduction"}, {"score": 0.004747620102130588, "phrase": "essential_data_preprocessing_technique"}, {"score": 0.004637478829869904, "phrase": "data_classification_tasks"}, {"score": 0.0039716833701918365, "phrase": "feature_extraction_category"}, {"score": 0.003825173769489887, "phrase": "feature_selection_category"}, {"score": 0.003649585593445665, "phrase": "large-scale_data_sets"}, {"score": 0.003401148484767927, "phrase": "feature_selection_approaches"}, {"score": 0.003322140088192527, "phrase": "greedy_strategies"}, {"score": 0.003125175084962886, "phrase": "optimized_criteria"}, {"score": 0.002953711377604328, "phrase": "popularly_used_feature_extraction"}, {"score": 0.0028715299874549245, "phrase": "unified_framework"}, {"score": 0.0027395968397212053, "phrase": "orthogonal_centroid_algorithm"}, {"score": 0.002626034130205569, "phrase": "incremental_oc"}, {"score": 0.002552946390854313, "phrase": "feature_extraction"}, {"score": 0.0025171669791790438, "phrase": "second_algorithm"}, {"score": 0.0023789822182914877, "phrase": "oc_criterion"}, {"score": 0.0022168460543913787, "phrase": "public_large-scale_text_data_sets"}], "paper_keywords": ["feature extraction", " feature selection", " orthogonal centroid algorithm"], "paper_abstract": "Dimensionality reduction is an essential data preprocessing technique for large-scale and streaming data classification tasks. It can be used to improve both the efficiency and the effectiveness of classifiers. Traditional dimensionality reduction approaches fall into two categories: Feature Extraction and Feature Selection. Techniques in the feature extraction category are typically more effective than those in feature selection category. However, they may break down when processing large-scale data sets or data streams due to their high computational complexities. Similarly, the solutions provided by the feature selection approaches are mostly solved by greedy strategies and, hence, are not ensured to be optimal according to optimized criteria. In this paper, we give an overview of the popularly used feature extraction and selection algorithms under a unified framework. Moreover, we propose two novel dimensionality reduction algorithms based on the Orthogonal Centroid algorithm (OC). The first is an Incremental OC (IOC) algorithm for feature extraction. The second algorithm is an Orthogonal Centroid Feature Selection (OCFS) method which can provide optimal solutions according to the OC criterion. Both are designed under the same optimization criterion. Experiments on Reuters Corpus Volume-1 data set and some public large-scale text data sets indicate that the two algorithms are favorable in terms of their effectiveness and efficiency when compared with other state-of-the-art algorithms.", "paper_title": "Effective and efficient dimensionality reduction for large-scale and streaming data preprocessing", "paper_id": "WOS:000234675800003"}