{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "marker_hiding_methods"}, {"score": 0.0491410816092368, "phrase": "augmented_reality"}, {"score": 0.026753623673073962, "phrase": "augmented_reality_marker"}, {"score": 0.00442651096522781, "phrase": "rectangular_image"}, {"score": 0.004382913938427474, "phrase": "black_and_white_areas"}, {"score": 0.0042336638794732255, "phrase": "overall_view"}, {"score": 0.004150661689086371, "phrase": "markerless_techniques"}, {"score": 0.003911253966141701, "phrase": "valuable_usage"}, {"score": 0.0036673959568781734, "phrase": "main_motivation"}, {"score": 0.0032887360307856635, "phrase": "main_ideas"}, {"score": 0.00320826350799124, "phrase": "future_works"}, {"score": 0.0031609252620168446, "phrase": "well-known_techniques"}, {"score": 0.002993231973906559, "phrase": "main_goal"}, {"score": 0.0028203950416405563, "phrase": "markerless_or_hiding-marker_methods"}, {"score": 0.0025668646315794947, "phrase": "different_methods"}, {"score": 0.002394719113232821, "phrase": "considerable_differences"}, {"score": 0.0022901862321082407, "phrase": "marker_area"}, {"score": 0.0021793698531006197, "phrase": "real_time"}], "paper_keywords": [""], "paper_abstract": "In augmented reality, the markers are noticeable by their simple design of a rectangular image with black and white areas that disturb the reality of the overall view. As the markerless techniques are not usually robust enough, hiding the markers has a valuable usage, which many researchers have focused on. Categorizing the marker hiding methods is the main motivation of this study, which explains each of them in detail and discusses the advantages and shortcomings of each. The main ideas, enhancements, and future works of the well-known techniques are also comprehensively summarized and analyzed in depth. The main goal of this study is to provide researchers who are interested in markerless or hiding-marker methods an easier approach for choosing the method that is best suited to their aims. This work reviews the different methods that hide the augmented reality marker by using information from its surrounding area. These methods have considerable differences in their smooth continuation of the textures that hide the marker area as well as their performance to hide the augmented reality marker in real time. It is also hoped that our analysis helps researchers find solutions to the drawbacks of each method.", "paper_title": "Marker Hiding Methods: Applications in Augmented Reality", "paper_id": "WOS:000349450000001"}