{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "temporal_relation"}, {"score": 0.049852710374338305, "phrase": "discharge_summaries"}, {"score": 0.04721712042183083, "phrase": "event_extraction"}, {"score": 0.04700356567793569, "phrase": "timex_extraction"}, {"score": 0.0359136899114371, "phrase": "f_measure"}, {"score": 0.004680093492185585, "phrase": "end-to-end_system"}, {"score": 0.00447421781395577, "phrase": "temporal_relation_identification"}, {"score": 0.004432037996394987, "phrase": "end-to-end_temporal_relation_system"}, {"score": 0.003729252194525098, "phrase": "markov"}, {"score": 0.003666875558387247, "phrase": "labeled_sequential_pattern_mining"}, {"score": 0.0036151029239622485, "phrase": "parse_trees"}, {"score": 0.0035640586527856634, "phrase": "coordination_classifier"}, {"score": 0.0035472039917651774, "phrase": "micro-averaged_precision"}, {"score": 0.0026310298443229635, "phrase": "end-to-end_temporal_relation"}, {"score": 0.0023036666012881644, "phrase": "seven_teams"}, {"score": 0.0021453501010329297, "phrase": "experiment_result"}], "paper_keywords": ["Context-Free Grammar", " Syntax", " Labeled Sequential Pattern", " Dependency Tree", " Coordination"], "paper_abstract": "Objective To create an end-to-end system to identify temporal relation in discharge summaries for the 2012 i2b2 challenge. The challenge includes event extraction, timex extraction, and temporal relation identification. Design An end-to-end temporal relation system was developed. It includes three subsystems: an event extraction system (conditional random fields (CRF) name entity extraction and their corresponding attribute classifiers), a temporal extraction system (CRF name entity extraction, their corresponding attribute classifiers, and context-free grammar based normalization system), and a temporal relation system (10 multi-support vector machine (SVM) classifiers and a Markov logic networks inference system) using labeled sequential pattern mining, syntactic structures based on parse trees, and results from a coordination classifier. Micro-averaged precision (P), recall (R), averaged P&R (P&R), and F measure (F) were used to evaluate results. Results For event extraction, the system achieved 0.9415 (P), 0.8930 (R), 0.9166 (P&R), and 0.9166 (F). The accuracies of their type, polarity, and modality were 0.8574, 0.8585, and 0.8560, respectively. For timex extraction, the system achieved 0.8818, 0.9489, 0.9141, and 0.9141, respectively. The accuracies of their type, value, and modifier were 0.8929, 0.7170, and 0.8907, respectively. For temporal relation, the system achieved 0.6589, 0.7129, 0.6767, and 0.6849, respectively. For end-to-end temporal relation, it achieved 0.5904, 0.5944, 0.5921, and 0.5924, respectively. With the F measure used for evaluation, we were ranked first out of 14 competing teams (event extraction), first out of 14 teams (timex extraction), third out of 12 teams (temporal relation), and second out of seven teams (end-to-end temporal relation). Conclusions The system achieved encouraging results, demonstrating the feasibility of the tasks defined by the i2b2 organizers. The experiment result demonstrates that both global and local information is useful in the 2012 challenge.", "paper_title": "An end-to-end system to identify temporal relation in discharge summaries: 2012 i2b2 challenge", "paper_id": "WOS:000323168200008"}