{"auto_keywords": [{"score": 0.048313706083567, "phrase": "background_theory"}, {"score": 0.04609482413352379, "phrase": "truth_assignments"}, {"score": 0.00481495049065317, "phrase": "boolean_search"}, {"score": 0.0047049532961375, "phrase": "quantifier-free_formulae"}, {"score": 0.004557779715547673, "phrase": "satisfiability_modulo_theory"}, {"score": 0.004377077848734575, "phrase": "decision_procedure"}, {"score": 0.004036796871316647, "phrase": "theory_combination_schema"}, {"score": 0.004001938457469328, "phrase": "nelson-oppen"}, {"score": 0.003876669922047053, "phrase": "new_approach"}, {"score": 0.003554531289427866, "phrase": "key_idea"}, {"score": 0.0034933782525914682, "phrase": "truth_assignment"}, {"score": 0.0031116404200520614, "phrase": "non-convex_theories"}, {"score": 0.003066945490483524, "phrase": "traditional_nelson-oppen_combinations"}, {"score": 0.0028364246462375614, "phrase": "smt_search_techniques"}, {"score": 0.0028037753646260937, "phrase": "theory_layering"}, {"score": 0.0026846436189970446, "phrase": "thorough_experimental_evidence"}, {"score": 0.0025117070259621376, "phrase": "linear_arithmetic"}, {"score": 0.0024975240785397746, "phrase": "la"}, {"score": 0.0023430894142828155, "phrase": "different_optimizations"}, {"score": 0.002309408211203032, "phrase": "test_cases"}, {"score": 0.0022565201625076876, "phrase": "state-of-the-art_competitor_tools"}, {"score": 0.0021668575137633317, "phrase": "dramatic_gains"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": [""], "paper_abstract": "Many approaches to deciding the satisfiability of quantifier-free formulae with respect to a background theory T-also known as Satisfiability Modulo Theory, or SMT(T)-rely on the integration between an enumerator of truth assignments and a decision procedure for conjunction of literals in T. When the background theory T is the combination T-1 boolean OR T-2 of two simpler theories, the approach is typically instantiated by means of a theory combination schema (e.g. Nelson-Oppen, Shostak). In this paper we propose a new approach to SMT(T-1 boolean OR T-2), where the enumerator of truth assignments is integrated with two decision procedures, one for T-1 and one for T-2, acting independently from each other. The key idea is to search for a truth assignment not only to the atoms occurring in the formula, but also to all the equalities between variables which are shared between the theories. This approach is simple and expressive: for instance, no modification is required to handle non-convex theories (as opposed to traditional Nelson-Oppen combinations which require a mechanism for splitting). Furthermore, it can be made practical by leveraging on state-of-the-art boolean and SMT search techniques, and on theory layering (i.e., cheaper reasoning first, and more often). We provide thorough experimental evidence to support our claims: we instantiate the framework with two decision procedures for the combinations of Equality and Uninterpreted Functions (EUF) and Linear Arithmetic (LA), both for (the convex case of) reals and for (the non-convex case of) integers; we analyze the impact of the different optimizations on a variety of test cases; and we compare the approach with state-of-the-art competitor tools, showing that our implemented tool compares positively with them, sometimes with dramatic gains in performance. (c) 2006 Published by Elsevier Inc.", "paper_title": "Efficient theory combination via boolean search", "paper_id": "WOS:000241024100004"}