{"auto_keywords": [{"score": 0.014232466793675588, "phrase": "optimization_process"}, {"score": 0.013788997843322246, "phrase": "useful_information"}, {"score": 0.013119500501212534, "phrase": "local_minima"}, {"score": 0.00713897736251918, "phrase": "proposed_algorithm"}, {"score": 0.004537525607322823, "phrase": "global_optimization_problems"}, {"score": 0.004141476915000558, "phrase": "descent_directions"}, {"score": 0.00393852508392789, "phrase": "better_minimum"}, {"score": 0.0036776458116294986, "phrase": "auxiliary_function"}, {"score": 0.0035294580355761506, "phrase": "smoothing_function"}, {"score": 0.0028210902750714075, "phrase": "better_local_minimum"}, {"score": 0.0027322025124213566, "phrase": "global_minimum"}, {"score": 0.0025862736445290088, "phrase": "local_search"}, {"score": 0.0023818288346547692, "phrase": "minimum-elimination-escape_memetic_algorithm"}, {"score": 0.002360132221690264, "phrase": "meem"}, {"score": 0.0021049977753042253, "phrase": "well_performed_existing_algorithms"}], "paper_keywords": ["Memetic algorithm", " Minimum elimination", " Smoothing function", " Square search", " Global optimization"], "paper_abstract": "Smoothing function method and filled function method are two of the most efficient methods for global optimization problems. The former can eliminate many local minima during the optimization process, but it often loses some useful information on looking for descent directions. The later can escape from local minima and find a better minimum, but it is usually parameter sensitive. To overcome these shortcomings, an auxiliary function is designed which integrates the advantages of both smoothing function and filled function; that is, it not only can eliminate many local minima and escape from local minima, but also cannot lose the useful information and is not parameter sensitive. By using such a function, many local minima will be eliminated and the algorithm successively goes from one local minimum to another better local minimum during optimization process, and finds the global minimum finally. To enhance the efficiency of the algorithm, a local search called square search is designed and integrated into the algorithm. Based on these techniques, a minimum-elimination-escape memetic algorithm called MEEM is proposed in this paper. The simulations are made on 30 standard benchmark problems and the performance of the proposed algorithm is compared with that of some well performed existing algorithms. The results indicate the performance of the proposed algorithm is more effective.", "paper_title": "A MINIMUM-ELIMINATION-ESCAPE MEMETIC ALGORITHM FOR GLOBAL OPTIMIZATION: MEEM", "paper_id": "WOS:000305169200018"}