{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "general_coupled_matrix_equations"}, {"score": 0.017689731625810928, "phrase": "central_anti-symmetric_matrices"}, {"score": 0.005554451705548127, "phrase": "presented_methods"}, {"score": 0.004390689303780405, "phrase": "central_antisymmetric_matrices"}, {"score": 0.004241370886886689, "phrase": "conjugate_gra_ient"}, {"score": 0.003912335018240945, "phrase": "central_antisyrnmetric_matrices"}, {"score": 0.0037937873032347, "phrase": "matrix_equations"}, {"score": 0.0034194902384248006, "phrase": "nite_iterative_steps"}, {"score": 0.003290403747743492, "phrase": "central_anti-symmetric_solutions"}, {"score": 0.003202944392720772, "phrase": "special_kind"}, {"score": 0.003178384350932106, "phrase": "initial_matrices"}, {"score": 0.0031178024467857215, "phrase": "optimal_approximation"}, {"score": 0.002853620962601042, "phrase": "least_frobenius_norm"}, {"score": 0.0027247727563746694, "phrase": "new_matrix_equations"}, {"score": 0.002662541169311738, "phrase": "numerical_examples"}, {"score": 0.0026218430041123164, "phrase": "theoretical_results"}, {"score": 0.0024556852466581527, "phrase": "projected_generalized_continuous-time"}, {"score": 0.002436927589343787, "phrase": "lyapunov"}, {"score": 0.0021708894366462153, "phrase": "convergence_results"}, {"score": 0.002145942273032774, "phrase": "iterative_algorithms"}], "paper_keywords": ["Iterative methods", " Mathematics", " The general coupled matrix equations", " Generalized centro-symmetric solution group", " Optimal approximation generalized centro-symmetric solution group"], "paper_abstract": "Purpose - The purpose of this paper is to find two iterative methods to solve the general coupled matrix equations over the generalized centro-symmetric and central antisymmetric matrices. Design/methodology/approach - By extending the idea of conjugate gra ient (CG) method, the authors present two iterative methods to solve the general coupled matrix equations over the generalized centro-symmetric and central antisyrnmetric matrices. Findings - When the general coupled matrix equations are consistent over the generalized centro-symmetric and central anti-symmetric matrices, the generalized centro-symmetric and central anti-symmetric solutions can be obtained within nite iterative steps. Also the least Frobenius norm generalized centrosymmetric and central anti-symmetric solutions can be derived by choosing a special kind of initial matrices. Furthermore, the optimal approximation generalized centrosymmetric and central anti-symmetric solutions to given generalized centro-symmetric and central anti-symmetric matrices can be obtained by finding the least Frobenius norm generalized centro-symmetric and central anti-symmetric solutions of new matrix equations. The authors employ some numerical examples to support the theoretical results of this paper. Finally, the application of the presented methods is highlighted for solving the projected generalized continuous-time algebraic Lyapunov equations (GCALE). Originality/value - By the algorithms, the solvability of the general coupled matrix equations over generalized centro-symmetric and central anti-symmetric matrices can be determined automatically. The convergence results of the iterative algorithms are also proposed. Several examples and an application are given to show the efficiency of the presented methods.", "paper_title": "Iterative algorithms for the generalized centro-symmetric and central anti-symmetric solutions of general coupled matrix equations", "paper_id": "WOS:000309328600004"}