{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "emergency_department"}, {"score": 0.04774398175413618, "phrase": "agent-based_modeling_framework"}, {"score": 0.004441616106463486, "phrase": "influenza_virus_infection"}, {"score": 0.004323690117778359, "phrase": "representative_hospital_emergency_department"}, {"score": 0.004290574511414471, "phrase": "winnipeg"}, {"score": 0.004257848114683076, "phrase": "canada"}, {"score": 0.004112894218792621, "phrase": "mathematical_modeling_techniques"}, {"score": 0.004081385289516914, "phrase": "disease_spread"}, {"score": 0.004003660777805554, "phrase": "modeling_applications"}, {"score": 0.003912335018240945, "phrase": "antibiotic-resistant_nosocomial_infections"}, {"score": 0.0038526069752138196, "phrase": "twenty_different_emergency_department_scenarios"}, {"score": 0.0037072310568610723, "phrase": "agent-based_modeling_approach"}, {"score": 0.0031661748179556606, "phrase": "linux_operating_system"}, {"score": 0.0027777389949155996, "phrase": "dependent_variable"}, {"score": 0.0026728137770370176, "phrase": "patient-oriented_infection_control_policies"}, {"score": 0.002601727192945944, "phrase": "symptomatic_patients"}, {"score": 0.002542298702137655, "phrase": "larger_effect"}, {"score": 0.002493810638588771, "phrase": "healthcare_workers"}, {"score": 0.00230003335593664, "phrase": "decision_support_tool"}, {"score": 0.0022302306304023602, "phrase": "relative_impact"}, {"score": 0.002213112756450354, "phrase": "infection_control_strategies"}, {"score": 0.0021049977753042253, "phrase": "counterintuitive_findings"}], "paper_keywords": ["Agent-based modeling (ABM)", " decision support", " simulation"], "paper_abstract": "The objective of this paper was to develop an agent-based modeling framework in order to simulate the spread of influenza virus infection on a layout based on a representative hospital emergency department in Winnipeg, Canada. In doing so, the study complements mathematical modeling techniques for disease spread, as well as modeling applications focused on the spread of antibiotic-resistant nosocomial infections in hospitals. Twenty different emergency department scenarios were simulated, with further simulation of four infection control strategies. The agent-based modeling approach represents systems modeling, in which the emergency department was modeled as a collection of agents (patients and healthcare workers) and their individual characteristics, behaviors, and interactions. The framework was coded in C++ using Qt4 libraries running under the Linux operating system. A simple ordinary least squares (OLS) regression was used to analyze the data, in which the percentage of patients that became infected in one day within the simulation was the dependent variable. The results suggest that within the given instance context, patient-oriented infection control policies (alternate treatment streams, masking symptomatic patients) tend to have a larger effect than policies that target healthcare workers. The agent-based modeling framework is a flexible tool that can be made to reflect any given environment; it is also a decision support tool for practitioners and policymakers to assess the relative impact of infection control strategies. The framework illuminates scenarios worthy of further investigation, as well as counterintuitive findings.", "paper_title": "Agent-Based Modeling of the Spread of Influenza-Like Illness in an Emergency Department: A Simulation Study", "paper_id": "WOS:000297355000010"}