{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "multiple_linear_mappings"}, {"score": 0.004769702911065878, "phrase": "efficient_single_image_super-resolution"}, {"score": 0.004680473391946691, "phrase": "-based_superresolution"}, {"score": 0.0034428776029411974, "phrase": "lr_feature_subspaces"}, {"score": 0.003410479630045025, "phrase": "hr_subspaces"}, {"score": 0.00326840809777013, "phrase": "large_nonlinear_feature_space"}, {"score": 0.00314708280192844, "phrase": "linear_subspaces"}, {"score": 0.0031174595932694036, "phrase": "multiple_lr_subdictionaries"}, {"score": 0.002987557906013826, "phrase": "corresponding_hr_subdictionaries"}, {"score": 0.0027829415827370753, "phrase": "mlm"}, {"score": 0.002679585860537941, "phrase": "desired_hr_outputs"}, {"score": 0.002507845411496512, "phrase": "displeasing_artifacts"}, {"score": 0.002460825108719896, "phrase": "mlm-based_method"}, {"score": 0.00240328454980006, "phrase": "fast_nonlocal_means_algorithm"}, {"score": 0.002125020720324262, "phrase": "relatively_low_time"}, {"score": 0.0021049977753042253, "phrase": "space_complexity"}], "paper_keywords": ["Fast non-local means", " feature subspace", " multiple linear mappings (MLMs)", " single image super-resolution (SR)"], "paper_abstract": "Example learning-based superresolution (SR) algorithms show promise for restoring a high-resolution (HR) image from a single low-resolution (LR) input. The most popular approaches, however, are either time-or space-intensive, which limits their practical applications in many resource-limited settings. In this paper, we propose a novel computationally efficient single image SR method that learns multiple linear mappings (MLM) to directly transform LR feature subspaces into HR subspaces. In particular, we first partition the large nonlinear feature space of LR images into a cluster of linear subspaces. Multiple LR subdictionaries are then learned, followed by inferring the corresponding HR subdictionaries based on the assumption that the LR-HR features share the same representation coefficients. We establish MLM from the input LR features to the desired HR outputs in order to achieve fast yet stable SR recovery. Furthermore, in order to suppress displeasing artifacts generated by the MLM-based method, we apply a fast nonlocal means algorithm to construct a simple yet effective similarity-based regularization term for SR enhancement. Experimental results indicate that our approach is both quantitatively and qualitatively superior to other application-oriented SR methods, while maintaining relatively low time and space complexity.", "paper_title": "Learning Multiple Linear Mappings for Efficient Single Image Super-Resolution", "paper_id": "WOS:000348458000002"}