{"auto_keywords": [{"score": 0.03744759147100103, "phrase": "functional_requirements"}, {"score": 0.00481495049065317, "phrase": "preliminary_design"}, {"score": 0.004785022360244881, "phrase": "concurrent_engineering"}, {"score": 0.004638136142210615, "phrase": "today's_multidimensional_world"}, {"score": 0.004171492822734768, "phrase": "shorter_product-development_time"}, {"score": 0.003786910256691685, "phrase": "first_customer's_wants"}, {"score": 0.003682024039203607, "phrase": "new_product"}, {"score": 0.0035245918797629804, "phrase": "concurrent_development"}, {"score": 0.00343766112727297, "phrase": "descriptive_matrix"}, {"score": 0.0033424156234057494, "phrase": "generative_model"}, {"score": 0.0032498004320510076, "phrase": "function_requirements"}, {"score": 0.0031302806539556145, "phrase": "functionalities_model"}, {"score": 0.0026944563649138713, "phrase": "existing_technical_systems"}, {"score": 0.002579140290642792, "phrase": "mathematical_model"}, {"score": 0.0025630734211267102, "phrase": "predetermined_conditions"}, {"score": 0.0024842242921857705, "phrase": "designer's_intuition"}, {"score": 0.0024380811094377006, "phrase": "main_shortcomings"}, {"score": 0.0023927929565329873, "phrase": "morphological_box"}, {"score": 0.002247807356218318, "phrase": "explanatory_theories"}, {"score": 0.0021381565332182773, "phrase": "functional_requirements_and_functionalities_model"}, {"score": 0.0021049977753042253, "phrase": "concrete_product"}], "paper_keywords": ["Preliminary design", " concurrent engineering processes", " product development", " design theory", " functional matrix", " functionality matrix"], "paper_abstract": "In today's multidimensional world, companies are constantly facing new, increasingly demanding challenges: global business and local operation, the standardization and individualization of products, demanding customers, and fierce competition. These companies want to achieve a shorter product-development time, lower costs, higher quality of the product, and finally, customer satisfaction. In order to achieve these goals, companies have to take into account the first customer's wants and needs during the process of developing a new product. This article presents the concept of solutions for the functional requirements in the concurrent development of a product by means of a descriptive matrix of the functional requirements and functionalities based on the generative model and criteria for describing the products, the function requirements, and the functionalities. The matrix of the functional requirements and functionalities model intends to improve the initial, preliminary design process, where only the most basic, sporadic information (such as functional requirements and functionalities) is presented. The tasks are parallelized and integrated to reduce the time and costs involved. The model was created as a tool in order to connect the functional requirements with existing technical systems. They partially or fully resolve the functional requirements on the basis of a mathematical model and predetermined conditions, and therefore do not depend solely on the designer's intuition. The concept improves the main shortcomings of other known methods such as the morphological box. In order to demonstrate the validity, the benefits of the method, the dynamics, to produce explanatory theories and to develop a method that is relevant to practice, the matrix of the functional requirements and functionalities model is tested against a concrete product.", "paper_title": "Enhancing preliminary design within concurrent engineering using the matrix of functions and functionalities", "paper_id": "WOS:000312548600002"}