{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "user_authority"}, {"score": 0.04928275842421274, "phrase": "expert_finding"}, {"score": 0.038386682929360434, "phrase": "target_category"}, {"score": 0.03612036008402271, "phrase": "relevant_categories"}, {"score": 0.0047747348769918, "phrase": "relevant_knowledge_categories"}, {"score": 0.004502433187097914, "phrase": "special_skills"}, {"score": 0.004408976280483648, "phrase": "particular_knowledge_categories"}, {"score": 0.00396988421137599, "phrase": "social_networks"}, {"score": 0.00330025288273863, "phrase": "authority_ranking"}, {"score": 0.0031248767378106663, "phrase": "expert_finding_framework"}, {"score": 0.003072807453368781, "phrase": "authority_information"}, {"score": 0.002860992017190221, "phrase": "scalable_method"}, {"score": 0.002766415324343602, "phrase": "topic_models"}, {"score": 0.0027203027216256013, "phrase": "consideration_of_both_content_and_user_interaction_based_category_similarities"}, {"score": 0.0026414426081951734, "phrase": "topical_link_analysis_approach"}, {"score": 0.002299313860419974, "phrase": "proposed_expert"}, {"score": 0.002131720106846481, "phrase": "baseline_methods"}, {"score": 0.0021049977753042253, "phrase": "significant_margin"}], "paper_keywords": ["Authority ranking", " Expert finding", " Category relevancy", " Link analysis", " Question answering"], "paper_abstract": "The problem of expert finding targets on identifying experts with special skills or knowledge for some particular knowledge categories, i.e. knowledge domains, by ranking user authority. In recent years, this problem has become increasingly important with the popularity of knowledge sharing social networks. While many previous studies have examined authority ranking for expert finding, they have a focus on leveraging only the information in the target category for expert finding. It is not clear how to exploit the information in the relevant categories of a target category for improving the quality of authority ranking. To that end, in this paper, we propose an expert finding framework based on the authority information in the target category as well as the relevant categories. Along this line, we develop a scalable method for measuring the relevancies between categories through topic models, which takes consideration of both content and user interaction based category similarities. Also, we provide a topical link analysis approach, which is multiple-category-sensitive, for ranking user authority by considering the information in both the target category and the relevant categories. Finally, in terms of validation, we evaluate the proposed expert finding framework in two large-scale real-world data sets collected from two major commercial Question Answering (Q&A) web sites. The results show that the proposed method outperforms the baseline methods with a significant margin.", "paper_title": "Ranking user authority with relevant knowledge categories for expert finding", "paper_id": "WOS:000340684500011"}