{"auto_keywords": [{"score": 0.03556417972834715, "phrase": "content_selection"}, {"score": 0.00481495049065317, "phrase": "news_images"}, {"score": 0.0041001740903338834, "phrase": "pictorial_information"}, {"score": 0.00402245126752142, "phrase": "vast_resource"}, {"score": 0.0037402558657576124, "phrase": "thematically_related_documents"}, {"score": 0.003585986761045987, "phrase": "news_articles"}, {"score": 0.003296212583539166, "phrase": "accompanying_article"}, {"score": 0.0032336801561165113, "phrase": "surface_realization"}, {"score": 0.003160200215473349, "phrase": "chosen_content"}, {"score": 0.00307657476125683, "phrase": "probabilistic_image_annotation_model"}, {"score": 0.002860546817196148, "phrase": "shared_set"}, {"score": 0.00283870598459543, "phrase": "latent_variables"}, {"score": 0.0027424619603260837, "phrase": "weakly_labeled_dataset"}, {"score": 0.0025694584194998356, "phrase": "recent_work"}, {"score": 0.0025110337774260773, "phrase": "extractive_and_abstractive_surface_realization_models"}, {"score": 0.0023525950486853937, "phrase": "specific_content"}, {"score": 0.0021539955106204354, "phrase": "handwritten_captions"}, {"score": 0.0021049977753042253, "phrase": "extractive_methods"}], "paper_keywords": ["Caption generation", " image annotation", " summarization", " topic models"], "paper_abstract": "This paper is concerned with the task of automatically generating captions for images, which is important for many image-related applications. Examples include video and image retrieval as well as the development of tools that aid visually impaired individuals to access pictorial information. Our approach leverages the vast resource of pictures available on the web and the fact that many of them are captioned and colocated with thematically related documents. Our model learns to create captions from a database of news articles, the pictures embedded in them, and their captions, and consists of two stages. Content selection identifies what the image and accompanying article are about, whereas surface realization determines how to verbalize the chosen content. We approximate content selection with a probabilistic image annotation model that suggests keywords for an image. The model postulates that images and their textual descriptions are generated by a shared set of latent variables (topics) and is trained on a weakly labeled dataset (which treats the captions and associated news articles as image labels). Inspired by recent work in summarization, we propose extractive and abstractive surface realization models. Experimental results show that it is viable to generate captions that are pertinent to the specific content of an image and its associated article, while permitting creativity in the description. Indeed, the output of our abstractive model compares favorably to handwritten captions and is often superior to extractive methods.", "paper_title": "Automatic Caption Generation for News Images", "paper_id": "WOS:000314931000003"}