{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "metabolic_networks"}, {"score": 0.004535124351828787, "phrase": "renewed_interest"}, {"score": 0.004401342842183475, "phrase": "computational_biology_community"}, {"score": 0.00414545383888272, "phrase": "methodological_network_analysis"}, {"score": 0.004047296286849109, "phrase": "experimental_and_theoretical_biology"}, {"score": 0.0038119123317396954, "phrase": "initial_guide"}, {"score": 0.0036993855514735746, "phrase": "formal_approaches"}, {"score": 0.0035901685646972585, "phrase": "computer_scientists"}, {"score": 0.0033011569787033297, "phrase": "structural_aspects"}, {"score": 0.0021049977753042253, "phrase": "small_world"}], "paper_keywords": ["Metabolism", " network", " metabolic data", " modeling", " topological analysis", " modularity", " evolution"], "paper_abstract": "There has been a renewed interest for metabolism in the computational biology community, leading to an avalanche of papers coming from methodological network analysis as well as experimental and theoretical biology. This paper is meant to serve as an initial guide for both the biologists interested in formal approaches and the mathematicians or computer scientists wishing to inject more realism into their models. This paper is focused on the structural aspects of metabolism only. The literature is vast enough already, and the thread through it is difficult to follow even for the more experienced worker in the field. We explain methods for acquiring data and reconstructing metabolic networks and review the various models that have been used for their structural analysis. Several concepts such as modularity are introduced, as well as the controversies that have beset the field these past few years, for instance, on whether metabolic networks are small world or scale-free and on which model better explains the evolution of metabolism.", "paper_title": "An Introduction to Metabolic Networks and Their Structural Analysis", "paper_id": "WOS:000260433100012"}