{"auto_keywords": [{"score": 0.04975125289261558, "phrase": "innovation_performance"}, {"score": 0.04846510936631859, "phrase": "taiwan"}, {"score": 0.010326879741233736, "phrase": "high-tech_industry"}, {"score": 0.006738274935213246, "phrase": "technical_reports"}, {"score": 0.004197817125707719, "phrase": "research_framework"}, {"score": 0.004112303664150895, "phrase": "literature_review"}, {"score": 0.004000978459274141, "phrase": "case_studies"}, {"score": 0.003973619384183145, "phrase": "five_high-tech_companies"}, {"score": 0.003906034193833338, "phrase": "adjusted_model"}, {"score": 0.003800271653332246, "phrase": "high-tech_companies"}, {"score": 0.0036220063770882275, "phrase": "upper_management_team"}, {"score": 0.0035118324133358706, "phrase": "main_forces"}, {"score": 0.0034167069467881143, "phrase": "educational_background"}, {"score": 0.0033933295645859015, "phrase": "work_experience"}, {"score": 0.002998776886514782, "phrase": "professional_knowledge"}, {"score": 0.0029376169407844314, "phrase": "office_support"}, {"score": 0.0028876014831335, "phrase": "adequate_resource_support"}, {"score": 0.002838435157502933, "phrase": "better_innovation_performance"}, {"score": 0.002771001596749451, "phrase": "new_products"}, {"score": 0.002569294946452846, "phrase": "regional_limitation"}, {"score": 0.0025255346035867564, "phrase": "single_study"}, {"score": 0.002325615071949044, "phrase": "disciplined_and_sophisticated_practice"}, {"score": 0.0022703369939978185, "phrase": "different_contingencies"}], "paper_keywords": ["innovation", " performance appraisal", " research and development", " technology led strategy"], "paper_abstract": "Purpose - This paper seeks to identify the variables that affect the innovation performance of R&D teams, and to investigate the interactions between these variables. Design/methodology/approach - A research framework is first established through a literature review, and is then adjusted according to case studies of five high-tech companies in Taiwan. The adjusted model is then tested through a survey of high-tech companies in Taiwan. Findings - It is concluded that the style of the upper management team and the leadership of the R&D manager are the main forces that determine R&D management practice, but that the educational background, work experience, and expertise of R&D managers do not distinguish the level of discipline or the sophistication of R&D management practice. Some aspects of R&D management practice, for examples the generation and utilization of technical reports and the cultivation of professional knowledge, can be reinforced by office support and alliance. With adequate resource support more sophisticated R&D management practice does lead to better innovation performance as measured by the number of new products, patents, and technical reports. Research limitations/implications - The findings are derived only from the high-tech industry in Taiwan. This regional limitation is inevitable in a single study. In the future, more regions can be investigated and compared. Practical implications - R&D management practice links closely to innovation performance. Disciplined and sophisticated practice improves innovation performance in many ways under different contingencies. Originality/value - R&D management practice was never a focus of study. This paper approaches the topic of innovation performance from this perspective and confirms its importance in many ways.", "paper_title": "How R&D management practice affects innovation performance - An investigation of the high-tech industry in Taiwan", "paper_id": "WOS:000240903500004"}