{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "duty-cycled_wireless_sensor_networks"}, {"score": 0.04842950119492684, "phrase": "transmission_radius"}, {"score": 0.04616293897139308, "phrase": "dc-wsns"}, {"score": 0.041727629088517196, "phrase": "random_geometric_graphs"}, {"score": 0.004205940624913343, "phrase": "das_et_al"}, {"score": 0.004020492138367616, "phrase": "connectivity_condition"}, {"score": 0.003843233460725919, "phrase": "gupta"}, {"score": 0.0036007478932719417, "phrase": "weakly_sufficient_condition"}, {"score": 0.003424677513304057, "phrase": "stronger_result"}, {"score": 0.003339886795391701, "phrase": "new_vertex-based_random_connection_model"}, {"score": 0.0031925019616678217, "phrase": "proof_technique"}, {"score": 0.0025859868507329634, "phrase": "optimal_condition"}, {"score": 0.002560162916190598, "phrase": "node_transmission_radius"}, {"score": 0.0021802872319258977, "phrase": "random_selection_duty-cycle_schemes"}, {"score": 0.0021049977753042253, "phrase": "minimum-radius_duty-cycling_scheme"}], "paper_keywords": ["Theory", " Model", " Design", " Performance", " Wireless sensor networks", " duty cycled", " connectivity radius"], "paper_abstract": "We investigate the condition on transmission radius needed to achieve connectivity in duty-cycled wireless sensor networks (briefly, DC-WSNs). First, we settle a conjecture of Das et al. [2012] and prove that the connectivity condition on random geometric graphs (RGGs), given by Gupta and Kumar [1989], can be used to derive a weakly sufficient condition to achieve connectivity in DC-WSNs. To find a stronger result, we define a new vertex-based random connection model that is of independent interest. Following a proof technique of Penrose [1991], we prove that when the density of the nodes approaches infinity, then a finite component of size greater than 1 exists with probability 0 in this model. We use this result to obtain an optimal condition on node transmission radius that is both necessary and sufficient to achieve connectivity and is hence optimal. The optimality of such a radius is also tested via simulation for two specific duty-cycle schemes, called the contiguous and the random selection duty-cycle schemes. Finally, we design a minimum-radius duty-cycling scheme that achieves connectivity with a transmission radius arbitrarily close to the one required in random geometric graphs. The overhead in this case is that we have to spend some time computing the schedule.", "paper_title": "Optimal Radius for Connectivity in Duty-Cycled Wireless Sensor Networks", "paper_id": "WOS:000351443600015"}