{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "computational_models"}, {"score": 0.004252864101987588, "phrase": "micawber"}, {"score": 0.0038234000205958547, "phrase": "mathematical_approaches"}, {"score": 0.003796355951305572, "phrase": "core_concepts"}, {"score": 0.0037295765964056255, "phrase": "subjective_experiences"}, {"score": 0.0035236476185949565, "phrase": "informative_modelling"}, {"score": 0.003449379912099073, "phrase": "theoretical_techniques"}, {"score": 0.0033766722372180003, "phrase": "psychiatric_problems"}, {"score": 0.003258871417680268, "phrase": "clinical_concepts"}, {"score": 0.003212906206685004, "phrase": "vice_versa"}, {"score": 0.003100800861459349, "phrase": "psychiatric_practice"}, {"score": 0.0030354183220734038, "phrase": "psychiatric_research"}, {"score": 0.0029399127512711493, "phrase": "better_theories"}, {"score": 0.0024613749081680474, "phrase": "stumbling_blocks"}, {"score": 0.002426630714074822, "phrase": "poor_communication"}, {"score": 0.0024094425220967273, "phrase": "theoretical_and_medical_communities"}, {"score": 0.002228203424338522, "phrase": "social_influences"}, {"score": 0.0021734395455430167, "phrase": "co-morbidity_structure"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Computational psychiatry", " Computational neuroscience", " Psychiatry", " Computational models"], "paper_abstract": "Mathematically rigorous descriptions of key hypotheses and theories are becoming more common in neuroscience and are beginning to be applied to psychiatry. In this article two fictional characters, Dr. Strong and Mr. Micawber, debate the use of such computational models (CMs) in psychiatry. We present four fundamental challenges to the use of CMs in psychiatry: (a) the applicability of mathematical approaches to core concepts in psychiatry such as subjective experiences, conflict and suffering; (b) whether psychiatry is mature enough to allow informative modelling; (c) whether theoretical techniques are powerful enough to approach psychiatric problems; and (d) the issue of communicating clinical concepts to theoreticians and vice versa. We argue that CMs have yet to influence psychiatric practice, but that they help psychiatric research in two fundamental ways: (a) to build better theories integrating psychiatry with neuroscience; and (b) to enforce explicit, global and efficient testing of hypotheses through more powerful analytical methods. CMs allow the complexity of a hypothesis to be rigorously weighed against the complexity of the data. The paper concludes with a discussion of the path ahead. It points to stumbling blocks, like the poor communication between theoretical and medical communities. But it also identifies areas in which the contributions of CMs will likely be pivotal, like an understanding of social influences in psychiatry, and of the co-morbidity structure of psychiatric diseases. (C) 2011 Elsevier Ltd. All rights reserved.", "paper_title": "Are computational models of any use to psychiatry?", "paper_id": "WOS:000292409800005"}