{"auto_keywords": [{"score": 0.04811643643051334, "phrase": "protein-dna_complexes"}, {"score": 0.00481495049065317, "phrase": "function_based_approach"}, {"score": 0.004764859786310636, "phrase": "locating_binding_sites"}, {"score": 0.004569630374630379, "phrase": "protein-dna_recognition"}, {"score": 0.004498490110526062, "phrase": "essential_role"}, {"score": 0.004382364826200616, "phrase": "gene_expression"}, {"score": 0.004291617358806677, "phrase": "recognition_mechanism"}, {"score": 0.004180809918117248, "phrase": "challenging_task"}, {"score": 0.004137288854115515, "phrase": "molecular_and_computational_biology"}, {"score": 0.004007697207097178, "phrase": "protein-rna_complexes"}, {"score": 0.003988487841970088, "phrase": "scoring_function_based_approach"}, {"score": 0.0038450179181069833, "phrase": "binding_sites"}, {"score": 0.0037653554368382814, "phrase": "important_residues"}, {"score": 0.003391075983775994, "phrase": "dna."}, {"score": 0.0029284999172756103, "phrase": "experimental_binding_specificity"}, {"score": 0.002808298910480358, "phrase": "good_agreement"}, {"score": 0.0027071661844502992, "phrase": "protein-rna_and_protein-dna_complexes"}, {"score": 0.0022299587520401747, "phrase": "binding_specificity"}, {"score": 0.0021049977753042253, "phrase": "present_study_and_related_reports"}], "paper_keywords": [""], "paper_abstract": "Protein-DNA recognition plays an essential role in the regulation of gene expression. Understanding the recognition mechanism of protein-DNA complexes is a challenging task in molecular and computational biology. In this work, a scoring function based approach has been developed for identifying the binding sites and delineating the important residues for binding in protein-DNA complexes. This approach considers both the repulsive interactions and the effect of distance between atoms in protein and DNA. The results showed that positively charged, polar, and aromatic residues are important for binding. These residues influence the formation of electrostatic, hydrogen bonding, and stacking interactions. Our observation has been verified with experimental binding specificity of protein-DNA complexes and found to be in good agreement with experiments. The comparison of protein-RNA and protein-DNA complexes reveals that the contribution of phosphate atoms in DNA is twice as large as in protein-RNA complexes. Furthermore, we observed that the positively charged, polar, and aromatic residues serve as hotspot residues in protein-RNA complexes, whereas other residues also altered the binding specificity in protein-DNA complexes. Based on the results obtained in the present study and related reports, a plausible mechanism has been proposed for the recognition of protein-DNA complexes.", "paper_title": "Scoring Function Based Approach for Locating Binding Sites and Understanding Recognition Mechanism of Protein-DNA Complexes", "paper_id": "WOS:000288738000018"}