{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "computer_science_students"}, {"score": 0.02248990281977531, "phrase": "software_piracy"}, {"score": 0.008323433113348266, "phrase": "greece"}, {"score": 0.004551199992546761, "phrase": "global_importance"}, {"score": 0.00444559516711374, "phrase": "future_information"}, {"score": 0.0038431888954930083, "phrase": "corresponding_reasoning"}, {"score": 0.0034332736827447654, "phrase": "intensive_use"}, {"score": 0.003401148484767927, "phrase": "pirated_software"}, {"score": 0.0033377940531761985, "phrase": "main_reason"}, {"score": 0.0032449610741097992, "phrase": "genuine_software"}, {"score": 0.0031695693589575916, "phrase": "academic_environment"}, {"score": 0.002953711377604328, "phrase": "immoral_character"}, {"score": 0.0025171669791790438, "phrase": "software_development_companies"}, {"score": 0.0023678143146455017, "phrase": "software_developer"}, {"score": 0.0022378101636842296, "phrase": "software_copyright_laws"}, {"score": 0.0021249064184347658, "phrase": "intellectual_property_rights"}, {"score": 0.0021049977753042253, "phrase": "mere_digital_products"}], "paper_keywords": ["software piracy", " computer science students"], "paper_abstract": "Today, software piracy is an issue of global importance. Computer science students are the future information and communication technologies professionals and it is important to study the way they approach this issue. In this article, we attempt to study attitudes, behaviours and the corresponding reasoning of computer science students in Greece regarding software piracy. The statements taken in 56 semi-structured interviews with students indicate that computer science students in Greece make intensive use of pirated software, mention as main reason for their practice the cost of genuine software, and blame the academic environment, coincidental stereotypes and their student status for this behaviour. They acknowledge the immoral character of their actions, as well as the fact that others are affected by software piracy, but they pay little attention to this action and they practically don't care. While keeping distance from software development companies, when specifically asked, they easily adopt the role of a software developer and attempt to substantiate their current and eventually future attitude out of hand. They consider software copyright laws to be inapplicable and unrealistic and fail to argue against intellectual property rights for mere digital products, such as software.", "paper_title": "What do computer science students think about software piracy?", "paper_id": "WOS:000277200000006"}