{"auto_keywords": [{"score": 0.04782450280555526, "phrase": "insider_information"}, {"score": 0.01960849957500984, "phrase": "prediction_market_accuracy"}, {"score": 0.007850269335298045, "phrase": "prediction_markets"}, {"score": 0.007740489563401459, "phrase": "social_network_structures"}, {"score": 0.004053362743156545, "phrase": "randomized_laboratory_experiment"}, {"score": 0.003707365055287875, "phrase": "star_networks"}, {"score": 0.0036052633308076933, "phrase": "high_precision"}, {"score": 0.0033190180867511605, "phrase": "financial_markets"}, {"score": 0.0029928611380840757, "phrase": "abnormal_performance"}, {"score": 0.0029114187110123105, "phrase": "experimental_results"}, {"score": 0.002643386043540555, "phrase": "network_structures"}, {"score": 0.0021490449563443025, "phrase": "public_information"}, {"score": 0.0021049977753042253, "phrase": "larger_negative_effect"}], "paper_keywords": ["controlled experiment", " insider information", " prediction markets", " social networks"], "paper_abstract": "This paper examines the effects of social network structures on prediction market accuracy in the presence of insider information through a randomized laboratory experiment. In the experiment, insider information is operationalized as signals on the state of nature with high precision. Motivated by the literature on insider information in the context of financial markets, we test and confirm two characterizations of insider information in the context of prediction markets: abnormal performance and less diffusion. Experimental results suggest that a more balanced social network structure is crucial to the success of prediction markets, whereas network structures akin to star networks are ill suited to prediction markets. As compared with other network structures, insider information has less positive effects on prediction market accuracy in star networks. We also find that the bias of the public information has a larger negative effect on prediction market accuracy in star networks.", "paper_title": "The Impact of Social Network Structures on Prediction Market Accuracy in the Presence of Insider Information", "paper_id": "WOS:000345922700008"}