{"auto_keywords": [{"score": 0.03076620360242571, "phrase": "online_role_play"}, {"score": 0.00481495049065317, "phrase": "internet_safety_awareness"}, {"score": 0.004408106853358092, "phrase": "kidsmart"}, {"score": 0.004285289574869884, "phrase": "school_children"}, {"score": 0.004180622964109706, "phrase": "multiple_method_data_collection"}, {"score": 0.004078502325220629, "phrase": "telephone_inter-views"}, {"score": 0.003923023699005215, "phrase": "summer_term"}, {"score": 0.0036553070575015344, "phrase": "net-detectives_online_role_play"}, {"score": 0.003578600071301459, "phrase": "internet_safety"}, {"score": 0.003334309053314909, "phrase": "ict_skills"}, {"score": 0.002687235334499192, "phrase": "extra_communication"}, {"score": 0.002640114583897493, "phrase": "smooth_running"}, {"score": 0.002603012037901889, "phrase": "play_exercise"}, {"score": 0.002521421793028698, "phrase": "technical_issues"}, {"score": 0.002408052242408488, "phrase": "learner's_comprehension"}, {"score": 0.0023408288327263294, "phrase": "social_interaction"}, {"score": 0.0021501863832966966, "phrase": "school_environment"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["interactive learning environments", " teaching/learning strategies", " secondary education"], "paper_abstract": "This paper reports on an evaluation of Net-Detectives, a creative online role play activity aimed at 9-12 year olds. Net-Detectives forms part of Kidsmart, an Internet awareness programme aimed at school children. It was evaluated through a multiple method data collection using questionnaire surveys, follow up telephone inter-views with teachers and observation in use in three UK schools during the summer term of 2003. All sources of data collected agreed that a number of benefits arise from participation in the Net-Detectives online role play. The pupils learned about Internet safety in a motivating and challenging environment. They empathised with others gaining an understanding of their motivations and practiced the ICT skills being taught. They particularly enjoyed being 'detectives' and interacting with others outside their school. However, the role of the 'hosts' in preparing participants and in moderating their communication is key to the success of the online role play. This preparation needs to be thoroughly planned for both the teachers whose classes are participating and for their pupils as uncertainty leads to extra communication that interferes with the smooth running of the role play exercise. It was very clear that first the technical issues have to be resolved and then, issues to do with the learner's comprehension and expectations of the task, before social interaction online can result in learning. The paper concludes by presenting the recommendations suggested by this study for hosting an online role play in the school environment. (C) 2005 Elsevier Ltd. All rights reserved.", "paper_title": "Using online role play to teach internet safety awareness", "paper_id": "WOS:000243813600008"}