{"auto_keywords": [{"score": 0.04432938903369474, "phrase": "artifact_filters"}, {"score": 0.015719716506582538, "phrase": "reference_standards"}, {"score": 0.015141739422017207, "phrase": "clinical_experts"}, {"score": 0.004781915513030716, "phrase": "artifact_detection"}, {"score": 0.004312622975366676, "phrase": "individual_and_joint_expert_judgments"}, {"score": 0.004011687811047391, "phrase": "consensus_judgment"}, {"score": 0.0036052633308076933, "phrase": "individual_and_joint_judgments"}, {"score": 0.0034472883424839346, "phrase": "resulting_filters"}, {"score": 0.0033883824438527316, "phrase": "interrater_agreement"}, {"score": 0.0033190180867511605, "phrase": "positive_specific_agreement"}, {"score": 0.0032962221445447934, "phrase": "psa"}, {"score": 0.003130077012135034, "phrase": "positive_predictive_value"}, {"score": 0.0029214769181390653, "phrase": "relatively_high_values"}, {"score": 0.0029013950320185573, "phrase": "cvp_data"}, {"score": 0.0028321862184182913, "phrase": "individual_experts"}, {"score": 0.00276462370914216, "phrase": "new_time_series"}, {"score": 0.0026342827320931937, "phrase": "hr_filters"}, {"score": 0.0025361866386341796, "phrase": "cvp_filters"}, {"score": 0.0024756677425317474, "phrase": "higher_performance_value"}, {"score": 0.0023917027133236813, "phrase": "joint_judgments"}, {"score": 0.0023426936553484524, "phrase": "filtering_methods"}, {"score": 0.0021714122348552747, "phrase": "joint_reference_standards"}, {"score": 0.0021490449563443025, "phrase": "multiple_experts"}, {"score": 0.0021049977753042253, "phrase": "automatic_artifact_filters"}], "paper_keywords": [""], "paper_abstract": "Objective: To investigate the agreement among clinical experts in their judgments of monitoring data with respect to artifacts, and to examine the effect of reference standards that consist of individual and joint expert judgments on the performance of artifact filters. Design: Individual judgments of four physicians, a majority vote judgment, and a consensus judgment were obtained for 30 time series of three monitoring variables: mean arterial blood pressure (ABPm), central venous pressure (CVP), and heart rate (HR). The individual and joint judgments were used to tune three existing automated filtering methods and to evaluate the performance of the resulting filters. Measurements: The interrater agreement was calculated in terms of positive specific agreement (PSA). The performance of the artifact filters was quantified in terms of sensitivity and positive predictive value (PPV). Results: PSA values between 0.33 and 0.85 were observed among clinical experts in their selection of artifacts, with relatively high values for CVP data. Artifact filters developed using judgments of individual experts were found to moderately generalize to new time series and other experts; sensitivity values ranged from 0.40 to 0.60 for ABPm and HR filters (PPV: 0.57-0.84), and from 0.63 to 0.80 for CVP filters (PPV: 0.71-0.86). A higher performance value for the filters was found for the three variable types when joint judgments were used for tuning the filtering methods. Conclusion: Given the disagreement among experts in their individual judgment of monitoring data with respect to artifacts, the use of joint reference standards obtained from multiple experts is recommended for development of automatic artifact filters.", "paper_title": "Individual and joint expert judgments as reference standards in artifact detection", "paper_id": "WOS:000253957100014"}