{"auto_keywords": [{"score": 0.004640398886726948, "phrase": "detailed_simulation_study"}, {"score": 0.004513631630494221, "phrase": "network_boundaries"}, {"score": 0.004349955692802962, "phrase": "distinguishing_aspect"}, {"score": 0.004211594861013822, "phrase": "internet-wide_implications"}, {"score": 0.0038046452381676967, "phrase": "detailed_models"}, {"score": 0.0031918759137610523, "phrase": "large-scale_crawl"}, {"score": 0.0027913353347879507, "phrase": "residential_isps"}, {"score": 0.0025802660239538353, "phrase": "increased_profitability"}, {"score": 0.002396179086883187, "phrase": "small_isps"}, {"score": 0.0023091093387071593, "phrase": "client_population"}, {"score": 0.0021843879253500894, "phrase": "alternate_strategies"}, {"score": 0.0021049977753042253, "phrase": "business_relationships"}], "paper_keywords": ["ISP profit", " localization", " peer-to-peer (P2P)"], "paper_abstract": "We conduct a detailed simulation study to examine how localizing P2P traffic within network boundaries impacts the profitability of an ISP. A distinguishing aspect of our work is the focus on Internet-wide implications, i.e., how adoption of localization within an ISP affects both itself and other ISPs. Our simulations are based on detailed models that estimate inter-autonomous-system (AS) P2P traffic and inter-AS routing, localization models that predict the extent to which P2P traffic is reduced, and pricing models that predict the impact of changes in traffic on the profit of an ISP. We evaluate our models by using a large-scale crawl of BitTorrent containing over 138 million users sharing 2.75 million files. Our results show that the benefits of localization must not be taken for granted. Some of our key findings include: 1) residential ISPs can actually lose money when localization is employed, and some of them will not see increased profitability until other ISPs employ localization; 2) the reduction in costs due to localization will be limited for small ISPs and tends to grow only logarithmically with client population; and 3) some ISPs can better increase profitability through alternate strategies to localization by taking advantage of the business relationships they have with other ISPs.", "paper_title": "The Internet-Wide Impact of P2P Traffic Localization on ISP Profitability", "paper_id": "WOS:000313661000018"}