{"auto_keywords": [{"score": 0.04157766927539456, "phrase": "user_performance"}, {"score": 0.014576568411302945, "phrase": "online_information"}, {"score": 0.011666958979053602, "phrase": "user_laterality"}, {"score": 0.011491482746043466, "phrase": "control_variables"}, {"score": 0.010698753535382015, "phrase": "significant_differences"}, {"score": 0.008409093127694415, "phrase": "online_information_systems"}, {"score": 0.00481495049065317, "phrase": "automatic_user_profiling_system"}, {"score": 0.004794004968918942, "phrase": "online_information_sites"}, {"score": 0.004773150125312769, "phrase": "demographic_determining_factors"}, {"score": 0.004752385571061558, "phrase": "purpose_-_the_purpose"}, {"score": 0.0046804150851963025, "phrase": "demographic_differences"}, {"score": 0.0046095294777639155, "phrase": "web_applications"}, {"score": 0.004529825005035055, "phrase": "future_systems"}, {"score": 0.0044321210735357025, "phrase": "user's_specific_needs"}, {"score": 0.00428948530378121, "phrase": "direct_relationship"}, {"score": 0.00389692161731897, "phrase": "five_complex_tasks"}, {"score": 0.0035790006179398583, "phrase": "multivariate_regression_analysis"}, {"score": 0.0034186571308472817, "phrase": "user_classification"}, {"score": 0.0033157591721071295, "phrase": "interaction_pointing"}, {"score": 0.0032941144284239004, "phrase": "goms's_operators"}, {"score": 0.003201936258131082, "phrase": "typing_operators"}, {"score": 0.0031879850338848567, "phrase": "older_users"}, {"score": 0.0031396312104181433, "phrase": "significant_performance_differences"}, {"score": 0.003112329426197808, "phrase": "left_and_right-handed_users"}, {"score": 0.0030186236793119316, "phrase": "artificial_intelligence-based_classification_systems"}, {"score": 0.0029793301484077094, "phrase": "decision_trees"}, {"score": 0.0027181921250521634, "phrase": "specific_preferences"}, {"score": 0.0026420870876262778, "phrase": "new_personalisation_algorithms"}, {"score": 0.002619100508559818, "phrase": "dynamic_adaptation"}, {"score": 0.0026076821268509413, "phrase": "user_interfaces"}, {"score": 0.002523612133025673, "phrase": "previous_research"}, {"score": 0.0024961939602758322, "phrase": "new_approach"}, {"score": 0.0024369154442728156, "phrase": "combined_and_simultaneous_analysis"}, {"score": 0.0023276192076222457, "phrase": "goms_analysis"}, {"score": 0.0022773060560745545, "phrase": "user_interaction"}, {"score": 0.0021704039951320336, "phrase": "previous_works"}, {"score": 0.0021188457619627015, "phrase": "advanced_model"}, {"score": 0.0021049977753042253, "phrase": "quantile_regression"}], "paper_keywords": ["Quantile regression", " Demographic factors", " GOMS", " User interaction", " User profiling"], "paper_abstract": "Purpose - The purpose of this paper is to identify demographic differences based on how users interact with web applications. The research is needed to develop future systems able to adapt the representation of online information to the user's specific needs and preferences improving its usability. The following question guides this quest: is there a direct relationship between age and/or gender and interaction? Design/methodology/approach - GOMS (goals, operators, methods, and selection rules) analysis was used to reduce complex interaction tasks into basic operators like pointing, dragging, typing, etc. An experiment was designed to analyse the user performance in the use of these operators through five complex tasks: point-and-click, drag-and-drop, text selection, text edition and menu selection. The sample comprises 592 individuals which took part in the experiment. The performance was analysed using multivariate regression analysis. User laterality and the the user experience were used as control variables. Findings - The factors studied are significant enough to support user classification. The analysis evidenced that men performed significantly better than women when executing interaction pointing and dragging GOMS's operators, but no significant differences arose with regard to the performance in the typing operators. Older users performed worse in all the interaction tasks. No significant performance differences were detected between left and right-handed users. Research limitations/implications - The study pretends to lay the ground for developing artificial intelligence-based classification systems (e.g. neural networks, decision trees, etc.) able to detect significant differences in user performance, classifying users according to their age, gender and laterality. Practical implications - This user profiling would drive the organisation, selection and representation of the online information according to the specific preferences and needs of each user. This would allow the design of new personalisation algorithms able to perform dynamic adaptation of user interfaces in order to improve the usability of online information systems. Originality/value - This work extends previous research on user performance under a new approach and improved accuracy. First, it relies on the combined and simultaneous analysis of ageing and gender and the use of user laterality and experience as control variables. Second, the use of the GOMS analysis allowed the design of tests that closely resemble the user interaction in online information systems. Third, the size of the sample used in this analysis is much bigger than those used in previous works, allowing a more thorough data analysis which includes the estimation of an advanced model which is quantile regression.", "paper_title": "Towards an automatic user profiling system for online information sites Identifying demographic determining factors", "paper_id": "WOS:000350588600005"}