{"auto_keywords": [{"score": 0.042991405398285394, "phrase": "real-time_vr_feedback"}, {"score": 0.015063017382292753, "phrase": "useful_platform"}, {"score": 0.01491535022450664, "phrase": "real-world_motor_skills"}, {"score": 0.00481495049065317, "phrase": "real-time_virtual_reality_feedback"}, {"score": 0.004688823162073856, "phrase": "virtual_reality"}, {"score": 0.004024863549087511, "phrase": "complex_dance_movement"}, {"score": 0.003998223112665124, "phrase": "novice_participants"}, {"score": 0.0037662262006579023, "phrase": "expert's_movement_demonstration"}, {"score": 0.0036070601923916196, "phrase": "full_feedback"}, {"score": 0.0033639840192975835, "phrase": "expert's_movement"}, {"score": 0.002974760986688745, "phrase": "participants'_kinematic_data"}, {"score": 0.0028584344002749395, "phrase": "motor_learning_session"}, {"score": 0.0028394925080958205, "phrase": "movement_error"}, {"score": 0.0027284410545226306, "phrase": "specific_joints"}, {"score": 0.002701361707441567, "phrase": "learner's_movement"}, {"score": 0.0026304533650262545, "phrase": "principal_component_analysis"}, {"score": 0.0025784931028501375, "phrase": "dimensional_change"}, {"score": 0.0025024660249697408, "phrase": "reduced-fb_condition"}, {"score": 0.002461199256106623, "phrase": "motor_learning"}, {"score": 0.00239657981537094, "phrase": "significantly_greater_reduction"}, {"score": 0.002364907617070299, "phrase": "five_separate_error_measures"}, {"score": 0.0021474369836979048, "phrase": "learner's_attention"}, {"score": 0.002126111716875144, "phrase": "key_anatomical_features"}, {"score": 0.0021049977753042253, "phrase": "to-be-learned_action"}], "paper_keywords": [""], "paper_abstract": "Does virtual reality (VR) represent a useful platform for teaching real-world motor skills? In domains such as sport and dance, this question has not yet been fully explored. The aim of this study was to determine the effects of two variations of real-time VR feedback on the learning of a complex dance movement. Novice participants (n = 30) attempted to learn the action by both observing a video of an expert's movement demonstration and physically practicing under one of three conditions. These conditions were: full feedback (FULL-FB), which presented learners with real-time VR feedback on the difference between 12 of their joint center locations and the expert's movement during learning; reduced feedback (REDUCED-FB), which provided feedback on only four distal joint center locations (end-effectors); and no feedback (NO-FB), which presented no real-time VR feedback during learning. Participants' kinematic data were gathered before, immediately after, and 24 hr after a motor learning session. Movement error was calculated as the difference in the range of movement at specific joints between each learner's movement and the expert's demonstrated movement. Principal component analysis was also used to examine dimensional change across time. The results showed that the REDUCED-FB condition provided an advantage in motor learning over the other conditions: it achieved a significantly greater reduction in error across five separate error measures. These findings indicate that VR can be used to provide a useful platform for teaching real-world motor skills, and that this may be achieved by its ability to direct the learner's attention to the key anatomical features of a to-be-learned action.", "paper_title": "The Short-Term Effects of Real-Time Virtual Reality Feedback on Motor Learning in Dance", "paper_id": "WOS:000289932700006"}