{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "complex_topography"}, {"score": 0.04973325992892519, "phrase": "homogenous_flux_method"}, {"score": 0.041656217336660355, "phrase": "bed_slope_term"}, {"score": 0.004728499903204582, "phrase": "robust_godunov-type_numerical_scheme_solver"}, {"score": 0.004150030918669128, "phrase": "numerical_errors"}, {"score": 0.0037222099716098783, "phrase": "flux_gradient"}, {"score": 0.0035766032751309677, "phrase": "godunov-type_shock-capturing_scheme"}, {"score": 0.0033021988455635403, "phrase": "numerical_experiments"}, {"score": 0.0032310733124059567, "phrase": "discontinuous_or_vertical_bed_topography"}, {"score": 0.002918826667294298, "phrase": "nonlinear_hyperbolic_system"}, {"score": 0.002855934865505357, "phrase": "two-dimensional_hyperbolic_system"}, {"score": 0.0027741761880779535, "phrase": "second-order_total-variation-diminishing_version"}, {"score": 0.002542642270762272, "phrase": "new_flux_gradient_term"}, {"score": 0.002407827985570249, "phrase": "experimental_measurements"}, {"score": 0.002263639474937039, "phrase": "volcano-induced_outburst_flood"}, {"score": 0.002239103860494545, "phrase": "initially_dry_channel"}, {"score": 0.0022228943786652914, "phrase": "complex_irregular_topography"}, {"score": 0.002190825828942124, "phrase": "technique's_capability"}, {"score": 0.0021592189144729775, "phrase": "real_flood"}, {"score": 0.0021049977753042253, "phrase": "john_wiley"}], "paper_keywords": ["shallow water equations", " source terms", " homogenous flux", " wetting", " drying", " irregular topography", " TVD-WAF", " HLLC"], "paper_abstract": "A robust Godunov-type numerical scheme solver is proposed for solving 2D SWEs and is applied to simulate flow over complex topography with wetting and drying. In reality, the topography is usually complex and irregular; therefore, to avoid the numerical errors generated by such features, a Homogenous Flux Method is used to handle the bed slope term in the SWEs. The method treats the bed slope term as a flux to be incorporated into the flux gradient and so maintains the balance between the two in a Godunov-type shock-capturing scheme. The main advantages of the method are: first, it is simple and easy to implement; second, numerical experiments demonstrate that it can handle discontinuous or vertical bed topography without any special treatment and third, it is applicable to both steady and unsteady flows. It is demonstrated how the approach set out here can be applied to the nonlinear hyperbolic system of the SWEs. The two-dimensional hyperbolic system is then solved by use of a second-order total-variation-diminishing version of the weighted average flux method in conjunction with a Harten-Lax-van Leer-Contract approximate Riemann solver incorporating the new flux gradient term. Several benchmark tests are presented to validate the model and the approach is verified against experimental measurements from the European Union Concerted Action on Dam Break Modelling project. These show very good agreement. Finally, the method is applied to a volcano-induced outburst flood over an initially dry channel with complex irregular topography to demonstrate the technique's capability in simulating a real flood. Copyright (c) 2013 John Wiley & Sons, Ltd.", "paper_title": "A robust 2D shallow water model for solving flow over complex topography using homogenous flux method", "paper_id": "WOS:000322832700002"}