{"auto_keywords": [{"score": 0.04912696385107804, "phrase": "description_logics"}, {"score": 0.01882260542678905, "phrase": "atomic_actions"}, {"score": 0.008713768692145006, "phrase": "dynamic_description_logics"}, {"score": 0.008124218315570798, "phrase": "considerable_expressive_power"}, {"score": 0.005969520973554125, "phrase": "description_logic"}, {"score": 0.0057203103945243595, "phrase": "abox_assertions"}, {"score": 0.005359031800369198, "phrase": "complex_actions"}, {"score": 0.004695543202451537, "phrase": "powerful_languages"}, {"score": 0.0046021431217333824, "phrase": "static_application_domains"}, {"score": 0.004567596860086148, "phrase": "main_strength"}, {"score": 0.004443121295775668, "phrase": "propositional_logic"}, {"score": 0.004162168678511426, "phrase": "dynamic_application_domains"}, {"score": 0.003988107217470147, "phrase": "propositional_dynamic_logic"}, {"score": 0.003679893968861111, "phrase": "well-studied_description_logics"}, {"score": 0.0036430753192412397, "phrase": "alco"}, {"score": 0.003615701937510043, "phrase": "alchoiq"}, {"score": 0.003499433771969699, "phrase": "representation_power"}, {"score": 0.0033954191908391147, "phrase": "static_knowledge"}, {"score": 0.003378385493203297, "phrase": "application_domains"}, {"score": 0.00304737045343781, "phrase": "primitive_literals"}, {"score": 0.00292714795976301, "phrase": "regular_program_constructors"}, {"score": 0.002912460026366616, "phrase": "pdl"}, {"score": 0.002536027067134901, "phrase": "modal_operators"}, {"score": 0.0021049977753042253, "phrase": "decidable_reasoning_services"}], "paper_keywords": ["Description logic", " Dynamic description logic", " Action theory", " Satisfiability-checking algorithm", " Reasoning tasks"], "paper_abstract": "Description logics provide powerful languages for representing and reasoning about knowledge of static application domains. The main strength of description logics is that they offer considerable expressive power going far beyond propositional logic, while reasoning is still decidable. There is a demand to bring the power and character of description logics into the description and reasoning of dynamic application domains which are characterized by actions. In this paper, based on a combination of the propositional dynamic logic PDL, a family of description logics and an action formalism constructed over description logics, we propose a family of dynamic description logics DDL(X-@) for representing and reasoning about actions, where represents well-studied description logics ranging from the ALCO to the ALCHOIQ, and X-@ denotes the extension of with the @ constructor. The representation power of DDL(X-@) is reflected in four aspects. Firstly, the static knowledge of application domains is represented as RBoxes and acyclic TBoxes of the description logic . Secondly, the states of the world and the pre-conditions of atomic actions are described by ABox assertions of the description logic X-@, and the post-conditions of atomic actions are described by primitive literals of X-@. Thirdly, starting with atomic actions and ABox assertions of X-@, complex actions are constructed with regular program constructors of PDL, so that various control structures on actions such as the \"Sequence\", \"Choice\", \"Any-Order\", \"Iterate\", \"If-Then-Else\", \"Repeat-While\" and \"Repeat-Until\" can be represented. Finally, both atomic actions and complex actions are used as modal operators for the construction of formulas, so that many properties on actions can be explicitly stated by formulas. A tableau-algorithm is provided for deciding the satisfiability of DDL(X-@)-formulas; based on this algorithm, reasoning tasks such as the realizability, executability and projection of actions can be effectively carried out. As a result, DDL((@)) not only offers considerable expressive power going beyond many action formalisms which are propositional, but also provides decidable reasoning services for actions described by it.", "paper_title": "A Family of Dynamic Description Logics for Representing and Reasoning About Actions", "paper_id": "WOS:000304109100001"}