{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "cloud_computing_environments"}, {"score": 0.029951691258449015, "phrase": "peer-to-peer_routing"}, {"score": 0.004044064541716598, "phrase": "existing_service_management_methods"}, {"score": 0.003809628721278519, "phrase": "highly_unpredictable_conditions"}, {"score": 0.00338060449446278, "phrase": "peer-to-peer_approach"}, {"score": 0.0033037970113095577, "phrase": "large_scale"}, {"score": 0.0031699005399973496, "phrase": "system_components"}, {"score": 0.003126481516783286, "phrase": "virtualized_services"}, {"score": 0.003097865379563127, "phrase": "computing_servers"}, {"score": 0.002931569771634119, "phrase": "peer-to-peer_networking_overlay"}, {"score": 0.002673957615079041, "phrase": "management_bottleneck"}, {"score": 0.0026494723416072316, "phrase": "single_point"}, {"score": 0.0023725232579531273, "phrase": "rigorous_performance_evaluation_study"}, {"score": 0.0023400004981080818, "phrase": "cloud_computing_environment"}, {"score": 0.0021441057555396013, "phrase": "significant_performance_benefits"}, {"score": 0.0021049977753042253, "phrase": "overall_system_reliability"}], "paper_keywords": ["Peer-to-peer", " Service provisioning", " Cloud computing"], "paper_abstract": "This paper aims to advance the management and delivery of services in large, heterogeneous, uncertain, and evolving cloud computing environments. The goal is important because such systems are becoming increasingly popular, yet existing service management methods do not scale well, and nor do they perform well under highly unpredictable conditions. If these problems can be solved, then Information Technology (IT) services can be made to operate in more scalable and reliable manner. In this paper, we present a peer-to-peer approach for managing services in large scale, dynamic, and evolving cloud computing environments. The system components such as virtualized services, computing servers, storage, and databases self-organize themselves using a peer-to-peer networking overlay. Inter-networking system components through peer-to-peer routing and information dissemination structure is essential to avoid the problems of management bottleneck and single point of failure that is predominantly associated with traditional centralized and hierarchical distributed (grids/clouds) system design approaches. We have validated our approach by conducting a set of rigorous performance evaluation study using the Amazon EC2 cloud computing environment. The results prove that managing services based on peer-to-peer routing and information dissemination structure is feasible and offers significant performance benefits as regards to overall system reliability, scalability, and self-management.", "paper_title": "Peer-to-peer service provisioning in cloud computing environments", "paper_id": "WOS:000319942000012"}