{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "geographic_routing"}, {"score": 0.049780208982911994, "phrase": "mobile_ad_hoc"}, {"score": 0.049483572884790016, "phrase": "sensor_networks"}, {"score": 0.03542065657821509, "phrase": "ecldel_graph"}, {"score": 0.004710620078577185, "phrase": "mobile_ad_hoc_and_sensor_networks"}, {"score": 0.004551199992546761, "phrase": "fixed_infrastructure"}, {"score": 0.004480522897810809, "phrase": "routing_protocols"}, {"score": 0.004342430078306461, "phrase": "geographic_routing_protocols"}, {"score": 0.004169226023596022, "phrase": "greedy-face-greedy_routing_protocols"}, {"score": 0.0040916230716372265, "phrase": "planar_graphs"}, {"score": 0.004053362743156545, "phrase": "underlying_graphs"}, {"score": 0.003940706575253453, "phrase": "edge_constrained_localized_delaunay"}, {"score": 0.003831169445079928, "phrase": "underlying_graph"}, {"score": 0.003701401653850141, "phrase": "planar_t-spanner"}, {"score": 0.003454858296390957, "phrase": "path_length"}, {"score": 0.003047776993499616, "phrase": "five_rounds"}, {"score": 0.0027829012437103656, "phrase": "ui"}, {"score": 0.0024547897375637308, "phrase": "communication_cost"}, {"score": 0.00241658945942583, "phrase": "network_bandwidth"}, {"score": 0.0024014759148123736, "phrase": "node_power"}, {"score": 0.002298288831092204, "phrase": "average_number"}, {"score": 0.002262518422441041, "phrase": "average_size"}, {"score": 0.0021049977753042253, "phrase": "pldel"}], "paper_keywords": ["Mobile ad hoc and sensor networks", " geographic routing", " unit-disk graph", " planar", " t-spanner", " Delaunay triangulation"], "paper_abstract": "In mobile ad hoc and sensor networks, since all nodes are mobile and there is no fixed infrastructure, the design of routing protocols becomes one of the most challenging issues. In recent years, geographic routing protocols have been widely used. Most of them, e. g., greedy-face-greedy routing protocols, need nodes to construct planar graphs as the underlying graphs. In this paper, we propose an Edge Constrained Localized Delaunay graph, denoted by ECLDel, as the underlying graph for geographic routing. We prove that the ECLDel is a planar t-spanner of the unit-disk graph. Geographic routing on ECLDel is as efficient as on the previous work of PLDel in terms of path length (hop count). However, the construction of ECLDel graph is far more simple and it converges faster. This is due to the following two reasons: First, we significantly reduce the number of messages broadcast by each node from five rounds (each round may contain several messages) to only two messages; second, we define two new types of edges, the Intersecting Gabriel (IG) edges and the Unaware Intersection (UI) edges, which are constrained in the ECLDel graph. These edges help significantly reduce the size of messages broadcast by each node. The decrease of both the number and the size of messages broadcast by each node reduces the communication cost, and saves the network bandwidth and node power, which are desirable for mobile ad hoc and sensor networks. Our simulation results show that the average number of messages and the average size of messages broadcast by each node are, respectively, 65 and 42 percent less in the construction of ECLDel than that in PLDel.", "paper_title": "An Edge-Constrained Localized Delaunay Graph for Geographic Routing in Mobile Ad Hoc and Sensor Networks", "paper_id": "WOS:000274622800002"}