{"auto_keywords": [{"score": 0.02856436230796959, "phrase": "proposed_algorithm"}, {"score": 0.010966450815782925, "phrase": "final_ranking"}, {"score": 0.00481495049065317, "phrase": "massive_amount"}, {"score": 0.004771435352180973, "phrase": "heterogeneous_information"}, {"score": 0.004664352260912174, "phrase": "insufficient_and_vague_user_queries"}, {"score": 0.004497973025639345, "phrase": "different_users"}, {"score": 0.004457309741979921, "phrase": "different_aims"}, {"score": 0.004397000006837371, "phrase": "information_retrieval_process"}, {"score": 0.004317848984770719, "phrase": "huge_amount"}, {"score": 0.0041074234667687875, "phrase": "efficient_retrieval_function"}, {"score": 0.004070276454809864, "phrase": "ranking_algorithm"}, {"score": 0.0038895008852940323, "phrase": "greatest_importance"}, {"score": 0.003767738552860633, "phrase": "learning_automata-based_ranking_function_discovery_algorithm"}, {"score": 0.0034876091188625535, "phrase": "learning_automaton"}, {"score": 0.003170060683860338, "phrase": "user_feedback"}, {"score": 0.002468450551616404, "phrase": "user_queries"}, {"score": 0.002401972657236926, "phrase": "well-known_data_collections"}, {"score": 0.0022640009579466924, "phrase": "obtained_results"}, {"score": 0.0021049977753042253, "phrase": "average_precision"}], "paper_keywords": ["Information retrieval", " Ranking function", " Search engine", " Learning automata"], "paper_abstract": "Due to the massive amount of heterogeneous information on the web, insufficient and vague user queries, and use of the same query by different users for different aims, the information retrieval process deals with a huge amount of uncertainty and doubt. Under such circumstances, designing an efficient retrieval function and ranking algorithm by which the most relevant results are provided is of the greatest importance. In this paper, a learning automata-based ranking function discovery algorithm in which different sources of information are combined is proposed. In this method, the learning automaton is used to adjust the portion of the final ranking that is assigned to each source of evidence based on the user feedback. All sources of information are first given the same importance. The proportion of a given source increases, if the documents provided by this source are reviewed by the user and decreases otherwise. As the proposed algorithm proceeds, the probability of appearance of each source in the final ranking gets proportional to its relevance to the user queries. Several simulation experiments are conducted on well-known data collections and query types to show the performance of the proposed algorithm. The obtained results demonstrate that the proposed algorithm outperforms several existing methods in terms of precision at position n, mean average precision, and normalized discount cumulative gain.", "paper_title": "An adaptive learning automata-based ranking function discovery algorithm", "paper_id": "WOS:000308954800006"}