{"auto_keywords": [{"score": 0.004701825207431857, "phrase": "great_attention"}, {"score": 0.004028326293950714, "phrase": "information_systems_scholars"}, {"score": 0.003933609372601274, "phrase": "unique_position"}, {"score": 0.0038640303886081444, "phrase": "significant_contributions"}, {"score": 0.003795677450778112, "phrase": "emerging_research_area"}, {"score": 0.0036625643243684827, "phrase": "new_research_frontier"}, {"score": 0.0031374619658664843, "phrase": "critical_examination"}, {"score": 0.002921114512115261, "phrase": "existing_studies"}, {"score": 0.0028693932802982417, "phrase": "theoretical_foundations"}, {"score": 0.0028354207806133153, "phrase": "research_methods"}, {"score": 0.0027852126030055305, "phrase": "research_foci"}, {"score": 0.0021049977753042253, "phrase": "crowdsourcing_systems"}], "paper_keywords": ["Crowdsourcing", " Web 2.0", " Socio-technical systems", " Collective intelligence", " Mass collaboration", " Problem-solving", " Research progress"], "paper_abstract": "Crowdsourcing is one of the emerging Web 2.0 based phenomenon and has attracted great attention from both practitioners and scholars over the years. It can facilitate the connectivity and collaboration of people, organizations, and societies. We believe that Information Systems scholars are in a unique position to make significant contributions to this emerging research area and consider it as a new research frontier. However, so far, few studies have elaborated what have been achieved and what should be done. This paper seeks to present a critical examination of the substrate of crowdsourcing research by surveying the landscape of existing studies, including theoretical foundations, research methods, and research foci, and identifies several important research directions for IS scholars from three perspectives-the participant, organization, and system-and which warrant further study. This research contributes to the IS literature and provides insights for researchers, designers, policy-makers, and managers to better understand various issues in crowdsourcing systems and projects.", "paper_title": "Evaluation on crowdsourcing research: Current status and future direction", "paper_id": "WOS:000338280900007"}