{"auto_keywords": [{"score": 0.04815232083593787, "phrase": "technology_convergence"}, {"score": 0.004106612344123407, "phrase": "objective_explanation"}, {"score": 0.003782655283668953, "phrase": "kipo"}, {"score": 0.0036303546926971966, "phrase": "co-classification_analysis"}, {"score": 0.003574830654211291, "phrase": "entire_technology_domain_level"}, {"score": 0.0033957904376127187, "phrase": "technological_innovation_system"}, {"score": 0.003160049822855747, "phrase": "network_analysis"}, {"score": 0.0031116963435584982, "phrase": "patent_data"}, {"score": 0.002456272788591051, "phrase": "non-convergent_technology"}, {"score": 0.0023451553255837317, "phrase": "strong_consistency"}, {"score": 0.0023211517663846346, "phrase": "converged_domains"}, {"score": 0.0022973933270056743, "phrase": "time_exists"}, {"score": 0.0022275639370573264, "phrase": "numerous_initiatives"}, {"score": 0.0021049977753042253, "phrase": "future_form"}], "paper_keywords": ["Interdisciplinary", " Technological convergence", " Converging technology", " Technology fusion mixture"], "paper_abstract": "Despite the enthusiasm for technology convergence seen over the last decade in society and the broad consensus on its considerable impact, there is neither any substantive evidence that technology convergence occurs overall nor any objective explanation of the domains where it may be found. By using patents filed to the KIPO from 1996 to 2010 and demonstrating trends based on co-classification analysis at the entire technology domain level, we elucidate the extent of technology convergence in a technological innovation system and its change in status over time. Furthermore, our paper uses network analysis based on patent data to identify the occurrence of technology convergence in terms of its technological domains. Our findings are as follows: (1) the diffusion of technology convergence has been ongoing since the early 2000s; (2) technology convergence is evolving into a more complex and heterogeneous form; (3) convergent technology has a wider scope but requires more effort to develop than does non-convergent technology; and (4) evidence for the strong consistency of converged domains over time exists. These results support the numerous initiatives of governments and firms to promote technology convergence and illustrate the future form of technology convergence.", "paper_title": "Technology convergence: What developmental stage are we in?", "paper_id": "WOS:000359143200012"}