{"auto_keywords": [{"score": 0.05007852962010534, "phrase": "social_integration"}, {"score": 0.007462753782687434, "phrase": "relationship_quality"}, {"score": 0.004735414083933722, "phrase": "social_network_sites"}, {"score": 0.004565007074039171, "phrase": "individual_differences"}, {"score": 0.004242291530697285, "phrase": "personal_innovativeness"}, {"score": 0.004116913661033223, "phrase": "social_network_site"}, {"score": 0.0036028592508983402, "phrase": "predictive_power"}, {"score": 0.003370344851760079, "phrase": "members'_personal_innovativeness"}, {"score": 0.003163326114997034, "phrase": "opportunistic_behaviour"}, {"score": 0.002881130228859848, "phrase": "practical_implications"}, {"score": 0.0027221933105416357, "phrase": "enduring_enthusiasm"}, {"score": 0.0026593184154220123, "phrase": "members'_satisfaction"}, {"score": 0.0024958641143547856, "phrase": "perceived_control"}, {"score": 0.002470987929071079, "phrase": "clear_rules"}, {"score": 0.0024545413637350765, "phrase": "management_procedures"}, {"score": 0.002397833600728684, "phrase": "required_legal_aspects"}, {"score": 0.002198412942421744, "phrase": "personal_differences"}, {"score": 0.0021191072118924067, "phrase": "explanatory_power"}, {"score": 0.0021049977753042253, "phrase": "existing_theoretical_frameworks"}], "paper_keywords": ["Satisfaction", " Trust", " Familiarity", " Personal innovativeness", " Social integration", " Social network sites"], "paper_abstract": "Purpose - The purpose of this paper is twofold. First, the study aims to investigate the effects of personal innovativeness and familiarity on social integration in the domain of social network site (SNS) innovation. Second, the study seeks to examine the influences of satisfaction and trust on social integration. Design/methodology/approach - Structural equation modelling is proposed to assess the relationships between the constructs, along with the predictive power of the model. Findings - The results demonstrate that increasing satisfaction, trust, and familiarity and assisting members' personal innovativeness are important initiatives that promote social integration, reduce competition between my SNS and others, and consequently, inhibit opportunistic behaviour. Research limitations/implications - The model does not include all the relevant variables. The sample is not random and thus it is not necessarily representative of the population. Practical implications - Managers must take familiarity and innovativeness into account to customise their social strategies in order to ensure enduring enthusiasm for SNSs. Likewise, fostering members' satisfaction through more gratifying and easier interactions is an effective strategy to promote social integration. Furthermore, SNSs should prioritise their initiatives for enhancing perceived control by making clear rules and management procedures available, as well as the required legal aspects and seals of approval that will increase levels of trust. Originality/value - A review of the literature reveals that very few studies analyse the effects of personal differences and relationship quality on social integration. This work therefore improves the explanatory power of existing theoretical frameworks.", "paper_title": "What drives social integration in the domain of social network sites? Examining the influences of relationship quality and stable and dynamic individual differences", "paper_id": "WOS:000350588600002"}