{"auto_keywords": [{"score": 0.049613254104042076, "phrase": "deniable_authentication"}, {"score": 0.017826418776602997, "phrase": "third_party"}, {"score": 0.016421745974315144, "phrase": "full_deniability"}, {"score": 0.00481495049065317, "phrase": "authentication_schemes"}, {"score": 0.004652963867892925, "phrase": "authentication_protocol"}, {"score": 0.004585212379675535, "phrase": "special_property"}, {"score": 0.004302791070310513, "phrase": "authentication_protocols"}, {"score": 0.003940122359770492, "phrase": "first_type"}, {"score": 0.0037888687452790953, "phrase": "authenticated_message"}, {"score": 0.003319830633865628, "phrase": "second_type"}, {"score": 0.0027832502848247303, "phrase": "particular_message"}, {"score": 0.0026501935378083663, "phrase": "deniability_partial_deniability"}, {"score": 0.002598764579760562, "phrase": "partial_deniability"}, {"score": 0.0021049977753042253, "phrase": "different_scenarios"}], "paper_keywords": ["authentication", " deniability", " bilinear maps"], "paper_abstract": "Deniable authentication is a type of authentication protocol with the special property of deniability. However, there have been several different definitions of deniability in authentication protocols. In this paper, we clarify this issue by defining two types of deniable authentication: In the first type of deniable authentication, the receiver of the authenticated message cannot prove to a third party that the sender has authenticated any message to him. We call this type of deniability full deniability. In the second type of deniable authentication, whilst the receiver can prove to a third party that the sender has authenticated some message to him, but he cannot prove to a third party that the sender has authenticated any particular message to the receiver. We call this type of deniability partial deniability. Note that partial deniability is not implied by full deniability, and that it has applications different from those of full deniability. Consequently, we present two identity-based authentication schemes and prove that one is fully deniable while the other is partially deniable. These two schemes can be useful in different scenarios.", "paper_title": "Full and partial deniability for authentication schemes", "paper_id": "WOS:000292505400011"}