{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "regular_ground_tree"}, {"score": 0.039133422014451295, "phrase": "regular_set_t"}, {"score": 0.004672808182229058, "phrase": "transition_graphs"}, {"score": 0.00445783412174435, "phrase": "vertex_set"}, {"score": 0.004216434794603139, "phrase": "finite_tree_automaton"}, {"score": 0.004127094600862448, "phrase": "regular_set"}, {"score": 0.003971006689166329, "phrase": "backward_closure"}, {"score": 0.00385368199735867, "phrase": "rewriting_relation"}, {"score": 0.003447349911141396, "phrase": "tree_automaton"}, {"score": 0.0034033029171804106, "phrase": "main_contribution"}, {"score": 0.0032465423581390625, "phrase": "recurrence_problem"}, {"score": 0.0027347937102326285, "phrase": "tree_t"}, {"score": 0.0021322775033565805, "phrase": "temporal_logic"}, {"score": 0.0021049977753042253, "phrase": "decidable_model-checking_problem"}], "paper_keywords": [""], "paper_abstract": "We consider the transition graphs of regular ground tree (or term) rewriting systems. The vertex set of such a graph is a (possibly infinite) set of trees. Thus, with a finite tree automaton one can represent a regular set of vertices. It is known that the backward closure of sets of vertices under the rewriting relation preserves regularity, i.e., for a regular set T of vertices the set of vertices from which one can reach T can be accepted by a tree automaton. The main contribution of this paper is to lift this result to the recurrence problem, i.e., we show that the set of vertices from which one can reach infinitely often a regular set T is regular, too. Since this result is effective, it implies that the problem whether, given a tree t and a regular set T, there is a path starting in t that infinitely often reaches T, is decidable. Furthermore, it is shown that the problems whether all paths starting in t eventually (respectively, infinitely often) reach T, are undecidable. Based oil the decidability result we define a fragment of temporal logic with a decidable model-checking problem for the class of regular ground tree rewriting graphs.", "paper_title": "Reachability problems on regular ground tree rewriting graphs", "paper_id": "WOS:000235607700005"}