{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "qsar_models"}, {"score": 0.004435006247087171, "phrase": "drug_design"}, {"score": 0.004396790930873782, "phrase": "activity_prediction"}, {"score": 0.0034204548167213545, "phrase": "comfa"}, {"score": 0.0030166226457616616, "phrase": "molecular_interaction_fields"}, {"score": 0.0029647862293448895, "phrase": "auto_grid"}, {"score": 0.0029264925857346497, "phrase": "r_statistical_environment"}, {"score": 0.002802373595203129, "phrase": "ucsf-chimera"}, {"score": 0.0027781870000242004, "phrase": "auto_dock_tools"}, {"score": 0.0026488343783448273, "phrase": "r_package"}, {"score": 0.002266051712795851, "phrase": "core_engine"}, {"score": 0.0021049977753042253, "phrase": "r-cran_distribution"}], "paper_keywords": [""], "paper_abstract": "Since it first appeared in 1988 3-D QSAR has proved its potential in the field of drug design and activity prediction. Although thousands of citations now exist in 3-D QSAR, its development was rather slow with the majority of new 3-D QSAR applications just extensions of CoMFA. An alternative way to build 3-D QSAR models, based on an evolution of software, has been named 3-D QSAutogrid/R and has been developed to use only software freely available to academics. 3-D QSAutogrid/R covers all the main features of CoMFA and GRID/GOLPE with implementation by multiprobe/multiregion variable selection (MPGRS) that improves the simplification of interpretation of the 3-D QSAR map. The methodology is based on the integration of the molecular interaction fields as calculated by Auto Grid and the R statistical environment that can be easily coupled with many free graphical molecular interfaces such as UCSF-Chimera, Auto Dock Tools, JMol, and others. The description of each R package is reported in detail, and, to assess its validity, 3-D QSAutogrid/R has been applied to three molecular data sets of which either CoMFA or GRLD/GOLPE models were reported in order to compare the results. 3-D QSAutogrid/R has been used as the core engine to prepare more that 240 3-D QSAR models forming the very first 3-D QSAR server (www.3d-qsar.com) with its code freely available through R-Cran distribution.", "paper_title": "3-D QSAutogrid/R: An Alternative Procedure To Build 3-D QSAR Models. Methodologies and Applications", "paper_id": "WOS:000305588100019"}