{"auto_keywords": [{"score": 0.032383891854950435, "phrase": "long_term_time_series_prediction"}, {"score": 0.00481495049065317, "phrase": "long_term_time_series_forecasting"}, {"score": 0.004650330504968421, "phrase": "wide_range"}, {"score": 0.0044718206943536514, "phrase": "different_methodologies"}, {"score": 0.004318881178805575, "phrase": "time_series_prediction"}, {"score": 0.004153041453795458, "phrase": "modified_function_approximation_problem"}, {"score": 0.004010960493946656, "phrase": "input_data"}, {"score": 0.0038568987435766014, "phrase": "previous_steps"}, {"score": 0.0034894451015047875, "phrase": "previous_time_steps"}, {"score": 0.002855934865505357, "phrase": "long_term_prediction"}, {"score": 0.0023168823213024856, "phrase": "advanced_one-step-ahead_models"}, {"score": 0.0022472527731744974, "phrase": "one-step-ahead_model"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["time series prediction", " fuzzy systems", " LS-SVM", " long term time series prediction"], "paper_abstract": "There exists a wide range of paradigms, and a high number of different methodologies that are applied to the problem of time series prediction. Most of them are presented as a modified function approximation problem using input/output data, in which the input data are expanded using values of the series at previous steps. Thus, the model obtained normally predicts the value of the series at a time (t + h) using previous time steps (t - tau(1)), (t - tau(2)),..., (t - tau(n)). Nevertheless, learning a model for long term time series prediction might be seen as a more complicated task, since it might use its own outputs as inputs for long term prediction (recursive prediction). This paper presents the utility of two different methodologies, the TaSe fuzzy TSK model and the least-squares SVMs, to solve the problem of long term time series prediction using recursive prediction. This work also introduces some techniques that upgrade the performance of those advanced one-step-ahead models (and in general of any one-step-ahead model), where they are used recursively for long term time series prediction. (c) 2007 Elsevier B.V. All rights reserved.", "paper_title": "Recursive prediction for long term time series forecasting using advanced models", "paper_id": "WOS:000249908400029"}