{"auto_keywords": [{"score": 0.04405342716642868, "phrase": "academic_library"}, {"score": 0.042619555492085175, "phrase": "information_sources"}, {"score": 0.00481495049065317, "phrase": "academic_library_users'_decision-making_process"}, {"score": 0.004494570360108983, "phrase": "mediating_role"}, {"score": 0.004309323675697185, "phrase": "users'_mental_representation"}, {"score": 0.004147523799581407, "phrase": "particular_interest"}, {"score": 0.004037877545494505, "phrase": "borrowing_decisions"}, {"score": 0.003669330508576073, "phrase": "formative_influence"}, {"score": 0.0036413370053909886, "phrase": "users'_information-seeking_behavior"}, {"score": 0.002983700956478823, "phrase": "borrowing_decision"}, {"score": 0.0029158847555394714, "phrase": "domain_familiarity"}, {"score": 0.0027215202678634517, "phrase": "library_services"}, {"score": 0.0024633601573822114, "phrase": "research_questions"}, {"score": 0.0023981301755351607, "phrase": "decision-making_theory"}, {"score": 0.0022640963589007457, "phrase": "\"cue_validity"}, {"score": 0.002145750895912557, "phrase": "\"accuracy-cost\"_framework"}, {"score": 0.0021049977753042253, "phrase": "human_information-seeking_behavior"}], "paper_keywords": ["Decision making", " Academic libraries", " Bibliographies"], "paper_abstract": "Purpose - The purpose of this paper is to investigate the mediating role different information sources (or cues) play in forming users' mental representation of a work in an academic library setting. Of particular interest is discerning how these information sources influence borrowing decisions. Design/methodology/approach - A large-scale user survey featuring two-part questionnaires was utilized in an academic library setting. The questionnaires were designed to ascertain those information sources exerting a formative influence on users' information-seeking behavior, especially the routes by which users came to know of a title and the sources by which they infer its content. Findings - Evidently users adaptively make use of a variety of cues to help them fulfil their information needs. These cues significantly reduced the uncertainty faced by users making a borrowing decision, even after their sense of domain familiarity was controlled for. The paper concludes with a discussion of the implications of the findings for library services. It is suggested that libraries could provide a more \"cue-rich\" environment that supports users' decision making and facilitates exploration of their collection. Originality/value - The research questions were framed in the language of decision-making theory, which, as the research demonstrates, sheds light on the dynamics between \"cue validity\" and judgment uncertainty. It also demonstrates, the applicability of the \"accuracy-cost\" framework in the study of human information-seeking behavior.", "paper_title": "A study of academic library users' decision-making process: a Lens model approach", "paper_id": "WOS:000273363800005"}