{"auto_keywords": [{"score": 0.04892973936699244, "phrase": "first-past-the-post_game"}, {"score": 0.01423982852375184, "phrase": "first-past-the-post_games"}, {"score": 0.013864000570986598, "phrase": "penney-ante_game"}, {"score": 0.008576651880762558, "phrase": "deterministic_finite-state_machine"}, {"score": 0.00481495049065317, "phrase": "first-past-"}, {"score": 0.00427550604912774, "phrase": "hidden_patterns"}, {"score": 0.004206767038617782, "phrase": "walter_penney"}, {"score": 0.004150325973059156, "phrase": "abstract_notion"}, {"score": 0.004028796143006953, "phrase": "probability_distribution"}, {"score": 0.003725123268391067, "phrase": "incomplete_first-past-the-post_game"}, {"score": 0.003665200409053223, "phrase": "penney-ante"}, {"score": 0.003635600104609725, "phrase": "multi-player_games"}, {"score": 0.0033614670841691507, "phrase": "guibas"}, {"score": 0.0033433437268269054, "phrase": "odlyzko"}, {"score": 0.002944284514509205, "phrase": "expected_length"}, {"score": 0.002482882173094112, "phrase": "aho"}, {"score": 0.0024694784565650945, "phrase": "corasick"}, {"score": 0.002436289099444074, "phrase": "knuth-morris-pratt_pattern-matching_algorithm"}, {"score": 0.0022892584716505218, "phrase": "expected_values"}, {"score": 0.0022523809174081837, "phrase": "finite-state_machine"}, {"score": 0.0022101055924375725, "phrase": "non-linear_equations"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Algorithmic problem solving", " Penney-Ante", " Regular language", " Probabilistic game", " Generating function"], "paper_abstract": "Informally, a first-past-the-post game is a (probabilistic) game where the winner is the person who predicts the event that occurs first among a set of events. Examples of first-past-the-post games include so-called block and hidden patterns and the Penney-Ante game invented by Walter Penney. We formalise the abstract notion of a first-past-the-post game, and the process of extending a probability distribution on symbols of an alphabet to the plays of a game. We establish a number of properties of such games, for example, the property that an incomplete first-past-the-post game is also a first-past-the-post game. Penney-Ante games are multi-player games characterised by a collection of regular, prefix-free languages. Analysis of such games is facilitated by a collection of simultaneous (nonlinear) equations in languages. Essentially, the equations are due to Guibas and Odlyzko. However, they did not formulate them as equations in languages but as equations in generating functions detailing lengths of words. For such games, we show how to use the equations in languages to calculate the probability of winning and how to calculate the expected length of a game for a given outcome. We also exploit the properties of first-past-the-post games to show how to calculate the probability of winning in the course of a play of the game. In this way, we avoid the construction of a deterministic finite-state machine or the use of generating functions, the two methods traditionally used for the task. We observe that Aho and Corasick's generalisation of the Knuth-Morris-Pratt pattern-matching algorithm can be used to construct the deterministic finite-state machine that recognises the language underlying a Penney-Ante game. The two methods of calculating the probabilities and expected values, one based on the finite-state machine and the other based on the non-linear equations in languages, have been implemented and verified to yield the same results. (C) 2013 Elsevier B.V. All rights reserved.", "paper_title": "First-past-the-post games", "paper_id": "WOS:000350618700005"}