{"auto_keywords": [{"score": 0.04924053276910619, "phrase": "einstein_coefficients"}, {"score": 0.04263633024913087, "phrase": "fgh"}, {"score": 0.01372748234838629, "phrase": "co"}, {"score": 0.012574943949252692, "phrase": "hamiltonian_matrix"}, {"score": 0.010927892241838925, "phrase": "vibrational_wave-functions"}, {"score": 0.009370066389343745, "phrase": "radiative_transition_parameters"}, {"score": 0.00481495049065317, "phrase": "fourier_grid_hamiltonian_method"}, {"score": 0.004688989566904871, "phrase": "franck-condon_factors"}, {"score": 0.004330450801016359, "phrase": "radiative_lifetimes"}, {"score": 0.004292337783332826, "phrase": "diatomic_molecules"}, {"score": 0.00344087639309216, "phrase": "tabulated_forms"}, {"score": 0.003410565849262162, "phrase": "experimental_potential_energy_data"}, {"score": 0.0032485526269852606, "phrase": "exited_state"}, {"score": 0.002934166052954463, "phrase": "excited_states"}, {"score": 0.0025466010273077913, "phrase": "franck-condon"}, {"score": 0.002279702500235741, "phrase": "good_agreements"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Einstein coefficients", " Radiative lifetimes", " Hulburt and Hirschfelder (HH) five constant potential function", " Rydberg-Klein-Rees (RKR) potential model", " Average internuclear separations", " Electronic transition dipole moments", " Fourier Grid Hamiltonian (FGH) Method"], "paper_abstract": "The Einstein coefficients and radiative lifetimes for diatomic molecules such as N-2 and CO have been computed using the Fourier Grid Hamiltonian (FGH) method and a comparison with other methods has been made. The Hamiltonian matrix is constructed using the Hulburt and Hirschfelder (HH) potential model and the Rydberg-Klein-Rees (RKR) potential model for diatomic molecules. The FGH method works well for any model of the potential including the tabulated forms of experimental potential energy data. The eigenvalues and vibrational wave-functions for the ground and the exited state of N-2 and CO molecules have been computed by diagonalizing the Hamiltonian matrix. The vibrational wave-functions and eigenvalues for the ground and the excited states are used to calculate the radiative transition parameters such as Einstein coefficients (A(v '' v')), radiative lifetimes, electronic transition dipole moments (R-e(x)), Franck-Condon factors (FCFs), r-Centroids and average internuclear separations for both the models. FGH method work well for both the models. There are good agreements between our computed values of radiative transition parameters for both the models and the values estimated by other methods. (C) 2015 Elsevier B.V. All rights reserved.", "paper_title": "Fourier Grid Hamiltonian Method for calculating the Einstein coefficients, Franck-Condon factors, r-Centroids, average internuclear separations and radiative lifetimes for N-2 and CO molecules", "paper_id": "WOS:000362134900028"}