{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "closed-loop_aerospace_manufacturing_supply_chain"}, {"score": 0.004605434064238641, "phrase": "considerable_amount"}, {"score": 0.004213240903095234, "phrase": "negative_environmental_impacts"}, {"score": 0.004159997145421619, "phrase": "disposal_products"}, {"score": 0.0041074234667687875, "phrase": "different_waste_reduction_options"}, {"score": 0.0040298010803060495, "phrase": "direct_reuse"}, {"score": 0.003525861581971337, "phrase": "integrated_system"}, {"score": 0.00337224813954299, "phrase": "capacitated_facility"}, {"score": 0.0033084729942065142, "phrase": "aerospace_industry"}, {"score": 0.003026391655379905, "phrase": "mixed_integer_linear_programming_model"}, {"score": 0.0025160740422447837, "phrase": "experimental_data"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Remanufacturing", " Closed-loop supply chain", " Aerospace overhaul", " Component transforming"], "paper_abstract": "A considerable amount of work has recently been applied to the development of processes to reduce negative environmental impacts of disposal products. Different waste reduction options such as direct reuse, repair, refurbishing, cannibalization, and remanufacturing were introduced to overcome these shortages. This paper studies an integrated system of manufacturing and remanufacturing using a capacitated facility in the aerospace industry, where products are returned after certain flight hours or cycles for overhaul. A mixed integer linear programming model is developed to maximize profit considering manufacturing, remanufacturing set-up, refurbishing, and inventory carrying costs. The model was tested through a set of experimental data. Further sensitivity analysis was conducted aiming at revealing the effects of certain factors on inventory carrying cost, profit, amount of scrap, and inventory turnover ratio. (C) 2014 Elsevier Ltd. All rights reserved.", "paper_title": "Process planning for closed-loop aerospace manufacturing supply chain and environmental impact reduction", "paper_id": "WOS:000341558800009"}