{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "interactive_functions"}, {"score": 0.01803479363452558, "phrase": "six_cmss"}, {"score": 0.010551607557578491, "phrase": "course-management_systems"}, {"score": 0.009624701028163695, "phrase": "interactivity_dimension"}, {"score": 0.009542052424432694, "phrase": "interaction_type"}, {"score": 0.004264697351852424, "phrase": "related_theories"}, {"score": 0.004095567486538121, "phrase": "six_major_cmss"}, {"score": 0.004071957673937727, "phrase": "taiwan_colleges"}, {"score": 0.003967379852781603, "phrase": "technical_framework"}, {"score": 0.003944506079554075, "phrase": "five_interaction_types"}, {"score": 0.003921763664916815, "phrase": "nine_interactivity_dimensions"}, {"score": 0.0036907133026806327, "phrase": "six_functions"}, {"score": 0.003463196032143783, "phrase": "highest_percentage"}, {"score": 0.00344321906220063, "phrase": "possible_interactive_functions"}, {"score": 0.0034134687245359406, "phrase": "human_interactions"}, {"score": 0.0032496585171039797, "phrase": "learner-interface_interaction"}, {"score": 0.0032309093154028663, "phrase": "learner-self_interaction"}, {"score": 0.0031937337757356526, "phrase": "lowest_percentage"}, {"score": 0.003166132209407694, "phrase": "learner-content_interaction"}, {"score": 0.003031650815900696, "phrase": "learner-centered_design_approach"}, {"score": 0.0030054458139724687, "phrase": "system-centered_one"}, {"score": 0.002945175711537758, "phrase": "user_surveys"}, {"score": 0.0029281780903782284, "phrase": "students'_perceptions"}, {"score": 0.002771500855119101, "phrase": "six_cms_user_groups"}, {"score": 0.00265373679629359, "phrase": "\"assignment_handling"}, {"score": 0.0023295585212850154, "phrase": "regression_results"}, {"score": 0.0022630645070078554, "phrase": "cms_interactivity"}, {"score": 0.0022306552323695977, "phrase": "cms"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Distributed learning environments", " Evaluation of CAL systems", " Interactive learning environments", " Post-secondary education"], "paper_abstract": "This study explores the interactivity of course-management systems (CMSs). First, this study reviews the concepts of interactivity, interactivity dimension, and interaction type on the basis of related theories and studies. Second, this study analyzes the interactive functions attributable to the six major CMSs in Taiwan colleges and universities, and re-constructs a technical framework containing five interaction types, nine interactivity dimensions, and 83 possible interactive functions. This study has found that a total of 21 interactive functions were featured in the six CMSs, while six functions identified from theories and research were not. In terms of interaction type, the results indicate that these six CMSs possessed the highest percentage of possible interactive functions for facilitating human interactions (e.g., learner-learner interaction and learner-instructor interaction), followed by learner-interface interaction and learner-self interaction, with the lowest percentage corresponding to learner-content interaction. In terms of interactivity dimension, these six CMSs seemed more likely to feature a learner-centered design approach than a system-centered one. Also, this study conducted user surveys on students' perceptions, use, and evaluation of these interactive functions. A total of 491 valid sets of data were collected from six CMS user groups. The results indicate that, for their online learning, students considered the function of \"Assignment handling\" to be the most known, frequently used, and useful function. In addition, students were well familiar with, and made use of, any functions that would help them monitor or track their learning process. Students required more content-related interactive functions than were currently available in CMSs. Last, the regression results indicate that the more positively the students perceived the CMS interactivity, the usefulness of CMS for learning, and the interactive functions, the more positively these students perceived their CMSs. (C) 2010 Elsevier Ltd. All rights reserved.", "paper_title": "The technical framework of interactive functions for course-management systems: Students' perceptions, uses, and evaluations", "paper_id": "WOS:000280985600009"}