{"auto_keywords": [{"score": 0.031942637647577585, "phrase": "structural_and_social_dynamics"}, {"score": 0.015719716506582538, "phrase": "structural_dynamics"}, {"score": 0.015605952122804403, "phrase": "social_dynamics"}, {"score": 0.015380848847530482, "phrase": "online_discussion_groups"}, {"score": 0.013058675246885004, "phrase": "message_volume"}, {"score": 0.004641351004344458, "phrase": "increasingly_popular_way"}, {"score": 0.004590496414177077, "phrase": "social_networks"}, {"score": 0.004157058883925715, "phrase": "quantitative_changes"}, {"score": 0.004021835438784141, "phrase": "membership_size"}, {"score": 0.0038483286199081, "phrase": "underlying_qualities"}, {"score": 0.0037094500688222695, "phrase": "mixed-methods_approach"}, {"score": 0.003668768542734106, "phrase": "qualitative_and_empirical_support"}, {"score": 0.0033220706785945815, "phrase": "five_year_period"}, {"score": 0.0031786562062819327, "phrase": "medical_topic"}, {"score": 0.002996992362027833, "phrase": "resource_availability_lead"}, {"score": 0.0029532175351058864, "phrase": "communication_activities"}, {"score": 0.002910080228097109, "phrase": "unexpected_ways"}, {"score": 0.0028675712105299496, "phrase": "significantly_more_message_volume"}, {"score": 0.0026838147966444783, "phrase": "coping_strategies"}, {"score": 0.0023164335087514274, "phrase": "individual_efforts"}, {"score": 0.0021441057555396013, "phrase": "online_discussion_group"}], "paper_keywords": ["social networks", " sustainability", " online discussion groups"], "paper_abstract": "Online discussion groups have become an increasingly popular way to create social networks where individuals congregate electronically to share advice and ideas. In order to better understand sustainability, we propose that research needs to go beyond examining quantitative changes in the structural dynamics of online discussion groups (such as membership size and message volume) and include investigation of the social dynamics characterizing the underlying qualities of the interactions among members. We take a mixed-methods approach to provide qualitative and empirical support for our theory by investigating the dynamics of one successful online discussion group over a five-year period. Our data set includes all 150,267 messages posted to 27,743 threads by 9,042 unique individuals over a five year period in a group that is focused on sharing advice about a medical topic (back pain). We find support for our hypotheses that 1) shifts in the structural and social dynamics underlying resource availability lead to changes in communication activities, but in unexpected ways: Fewer members contributed significantly more message volume. In turn, 2) shifts in the structural and social dynamics underlying communication activities lead to changes in coping strategies: As message volume increased and became more social, members increased their efforts and were less likely to defect. Finally, 3) shifts in the structural and social dynamics underlying coping strategies lead to changes in attraction and retention: as individual efforts increased, more individuals were retained; however, fewer new members were attracted to join the group. Our main thesis is that each online discussion group is a product of its structural and social dynamics in combination, and the influence of these factors on sustainability is best understood when they are examined in relation to each other over time.", "paper_title": "Online discussion group sustainability: Investigating the interplay between structural dynamics and social dynamics over time", "paper_id": "WOS:000275166800003"}