{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "openehr_archetypes"}, {"score": 0.02775906079255983, "phrase": "ubiquitous_computing"}, {"score": 0.024323842167748987, "phrase": "cds"}, {"score": 0.004768739216860887, "phrase": "solid_basis"}, {"score": 0.00447174501210281, "phrase": "clinical_data_sets"}, {"score": 0.004166280750248375, "phrase": "typical_problems"}, {"score": 0.0036046832119756528, "phrase": "application_systems"}, {"score": 0.003412738820791168, "phrase": "existing_cdss"}, {"score": 0.0032728607237892038, "phrase": "paediatric_oncology_cds"}, {"score": 0.003000340083107413, "phrase": "nine_problems"}, {"score": 0.002914624187933378, "phrase": "common_model"}, {"score": 0.002886598310196588, "phrase": "cds._typical_problems"}, {"score": 0.0028680638354014183, "phrase": "incompatible_basic_data_types"}, {"score": 0.002831350132465098, "phrase": "incompatible_definitions"}, {"score": 0.002813169398244266, "phrase": "clinical_content"}, {"score": 0.002654693503799094, "phrase": "integrity_constraints"}, {"score": 0.0024730434312323296, "phrase": "common_basis"}, {"score": 0.0024571577953004546, "phrase": "ubiquitous_presence"}, {"score": 0.0024413739512778136, "phrase": "meaningful_and_computer-processable_knowledge"}, {"score": 0.002371589020876307, "phrase": "basic_requirement"}, {"score": 0.0022596753843232755, "phrase": "semantic_interoperability"}, {"score": 0.0021599821402426013, "phrase": "better_quality"}, {"score": 0.002139197034966045, "phrase": "original_cds."}, {"score": 0.0021049977753042253, "phrase": "elsevier_ireland_ltd."}], "paper_keywords": ["Electronic health records", " Semantic interoperability openEHR", " Archetypes", " Clinical data sets", " Computerized medical record systems"], "paper_abstract": "Purpose: The purpose of this paper is to analyse the feasibility and usefulness of expressing clinical data sets (CDSs) as openEHR archetypes. For this, we present an approach to transform CDS into archetypes, and outline typical problems with CDS and analyse whether some of these problems can be overcome by the use of archetypes. Methods: Literature review and analysis of a selection of existing Australian, German, other European and international CDSs; transfer of a CDS for Paediatric Oncology into openEHR archetypes; implementation of CDSs in application systems. Results: To explore the feasibility of expressing CDS as archetypes an approach to transform existing CDSs into archetypes is presented in this paper. In case of the Paediatric Oncology CDS (which consists of 260 data items) this lead to the definition of 48 openEHR archetypes. To analyse the usefulness of expressing CDS as archetypes, we identified nine problems with CDS that currently remain unsolved without a common model underpinning the CDS. Typical problems include incompatible basic data types and overlapping and incompatible definitions of clinical content. A solution to most of these problems based on openEHR archetypes is motivated. With regard to integrity constraints, further research is required. Conclusions: While openEHR cannot overcome all barriers to Ubiquitous Computing, it can provide the common basis for ubiquitous presence of meaningful and computer-processable knowledge and information, which we believe is a basic requirement for Ubiquitous Computing. Expressing CDSs as openEHR archetypes is feasible and advantageous as it fosters semantic interoperability, supports ubiquitous computing, and helps to develop archetypes that are arguably of better quality than the original CDS. (C) 2007 Elsevier Ireland Ltd. All rights reserved.", "paper_title": "Expressing clinical data sets with openEHR archetypes: A solid basis for ubiquitous computing", "paper_id": "WOS:000207730900003"}