{"auto_keywords": [{"score": 0.04970903037225392, "phrase": "response_behavior"}, {"score": 0.013072746933636697, "phrase": "dependent_variables"}, {"score": 0.012873135267713085, "phrase": "response_quantity"}, {"score": 0.009829696670724999, "phrase": "study_results"}, {"score": 0.0046859752697029355, "phrase": "nonprofit_online_panel"}, {"score": 0.00447282529270722, "phrase": "lottery's_splitting"}, {"score": 0.004438250823243621, "phrase": "multiple_prizes"}, {"score": 0.004352974291381376, "phrase": "no-incentive_control_group"}, {"score": 0.004027876348834879, "phrase": "multiple_smaller_prizes"}, {"score": 0.003770633265791941, "phrase": "response_quality"}, {"score": 0.003627028894710926, "phrase": "panelists'_characteristics"}, {"score": 0.0035297609635321203, "phrase": "lottery_effects"}, {"score": 0.003304224820203298, "phrase": "effect_sizes"}, {"score": 0.0032406665327678616, "phrase": "mildly_decreased_response_quantity"}, {"score": 0.002861782260525497, "phrase": "cash_lottery"}, {"score": 0.002566685388128598, "phrase": "stand-alone_incentive"}, {"score": 0.0024592402228499105, "phrase": "moderating_effects"}], "paper_keywords": ["lottery", " study results", " incentive", " online panel", " response behavior", " quality"], "paper_abstract": "Two incentive experiments on response behavior were conducted in a nonprofit online panel. Experiment 1 examined effects of a lottery and of the lottery's splitting into multiple prizes. Two cash lotteries and a no-incentive control group were compared. One lottery was announced to be paid out in one lump sum, whereas the other lottery was split into multiple smaller prizes. Dependent variables were two facets of response quantity, namely response and retention, and two facets of response quality, namely nondifferentiation and item nonresponse. Moreover, panelists' characteristics were tested whether they moderated the lottery effects. The lottery and its splitting did not significantly affect response behavior; however, in terms of effect sizes, splitting the lottery mildly decreased response quantity. Experiment 2 was in part aimed at replication. In addition, it examined the effect of offering study results. Dependent variables were response, retention, and nondifferentiation. The cash lottery mildly enhanced response quantity and quality, whereas splitting the lottery tended to decrease response quantity. Offering study results had no impact on response behavior, both as a stand-alone incentive and in combination with a lottery. The two experiments revealed moderating effects, but these were not stable across both studies. A share of invitees in Experiment 1 was reinvited in Experiment 2, thus enabling analysis of whether their lottery condition in Experiment 1 influenced their response behavior 5 months later in Experiment 2. No such longitudinal effects were found.", "paper_title": "How Do Lotteries and Study Results Influence Response Behavior in Online Panels?", "paper_id": "WOS:000319120700008"}