{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "missing_data"}, {"score": 0.004760394308239882, "phrase": "host-pathogen_protein_interaction_prediction"}, {"score": 0.004574247691703376, "phrase": "supervised_machine"}, {"score": 0.00447115003744675, "phrase": "protein-protein_interaction"}, {"score": 0.0034789831290103967, "phrase": "missing_values"}, {"score": 0.00332375606483146, "phrase": "machine_learning_algorithms"}, {"score": 0.003193606324727067, "phrase": "specialized_techniques"}, {"score": 0.0031393948330209255, "phrase": "value_imputation"}, {"score": 0.002931569771634119, "phrase": "cross_species_information"}, {"score": 0.0028653893877383188, "phrase": "machine_learning_techniques"}, {"score": 0.0028417825888074006, "phrase": "group"}, {"score": 0.0025416235470290286, "phrase": "salmonella-human_ppi_prediction"}, {"score": 0.002442025065383455, "phrase": "high_prediction_accuracies"}, {"score": 0.0021908807203548345, "phrase": "next_best_technique"}, {"score": 0.0021049977753042253, "phrase": "yersinia-human_ppi_prediction"}], "paper_keywords": [""], "paper_abstract": "Motivation: Approaches that use supervised machine learning techniques for protein-protein interaction (PPI) prediction typically use features obtained by integrating several sources of data. Often certain attributes of the data are not available, resulting in missing values. In particular, our host-pathogen PPI datasets have a large fraction, in the range of 58-85% of missing values, which makes it challenging to apply machine learning algorithms. Results: We show that specialized techniques for missing value imputation can improve the performance of the models significantly. We use cross species information in combination with machine learning techniques like Group lasso with l(1)/l(2) regularization. We demonstrate the benefits of our approach on two PPI prediction problems. In our first example of Salmonella-human PPI prediction, we are able to obtain high prediction accuracies with 77.6% precision and 84% recall. Comparison with various other techniques shows an improvement of 9 in F1 score over the next best technique. We also apply our method to Yersinia-human PPI prediction successfully, demonstrating the generality of our approach.", "paper_title": "Techniques to cope with missing data in host-pathogen protein interaction prediction", "paper_id": "WOS:000308532300024"}