{"auto_keywords": [{"score": 0.049618672169140725, "phrase": "wikipedia"}, {"score": 0.010612193416901682, "phrase": "implicit_relationships"}, {"score": 0.007913727097361985, "phrase": "previously_proposed_methods"}, {"score": 0.0043713857434347254, "phrase": "individual_objects"}, {"score": 0.0041051328120736575, "phrase": "explicit_relationship"}, {"score": 0.004007083686875716, "phrase": "single_link"}, {"score": 0.0038179283509963695, "phrase": "implicit_relationship"}, {"score": 0.0037267132967205136, "phrase": "link_structure"}, {"score": 0.0034995881411519925, "phrase": "cohesion-based_methods"}, {"score": 0.003399466007862412, "phrase": "high_degrees"}, {"score": 0.0027876387169652717, "phrase": "new_method"}, {"score": 0.0027474453262607834, "phrase": "generalized_maximum_flow"}, {"score": 0.0026175952455594277, "phrase": "high_degree"}, {"score": 0.0023417010799384524, "phrase": "remarkable_aspect"}, {"score": 0.002285674008055581, "phrase": "elucidatory_objects"}, {"score": 0.0021461840368981475, "phrase": "mining_elucidatory_objects"}, {"score": 0.0021049977753042253, "phrase": "novel_way"}], "paper_keywords": ["Link analysis", " generalized flow", " Wikipedia mining", " relationship"], "paper_abstract": "We focus on measuring relationships between pairs of objects in Wikipedia whose pages can be regarded as individual objects. Two kinds of relationships between two objects exist: in Wikipedia, an explicit relationship is represented by a single link between the two pages for the objects, and an implicit relationship is represented by a link structure containing the two pages. Some of the previously proposed methods for measuring relationships are cohesion-based methods, which underestimate objects having high degrees, although such objects could be important in constituting relationships in Wikipedia. The other methods are inadequate for measuring implicit relationships because they use only one or two of the following three important factors: distance, connectivity, and cocitation. We propose a new method using a generalized maximum flow which reflects all the three factors and does not underestimate objects having high degree. We confirm through experiments that our method can measure the strength of a relationship more appropriately than these previously proposed methods do. Another remarkable aspect of our method is mining elucidatory objects, that is, objects constituting a relationship. We explain that mining elucidatory objects would open a novel way to deeply understand a relationship.", "paper_title": "A Generalized Flow-Based Method for Analysis of Implicit Relationships on Wikipedia", "paper_id": "WOS:000314188900003"}