{"auto_keywords": [{"score": 0.049465088868450476, "phrase": "software_flexibility"}, {"score": 0.006970487697722081, "phrase": "project_performance"}, {"score": 0.00481495049065317, "phrase": "management_review"}, {"score": 0.0045726187330434025, "phrase": "project_efficiency"}, {"score": 0.004427366754240748, "phrase": "desirable_but_conflicting_goals"}, {"score": 0.003850356909047707, "phrase": "higher_levels"}, {"score": 0.0030435998319355883, "phrase": "control_activities"}, {"score": 0.002985130390111069, "phrase": "system_development_process"}, {"score": 0.002927780883930371, "phrase": "significant_facilitator"}, {"score": 0.0026743419827100225, "phrase": "mediator_role"}, {"score": 0.002555950807368337, "phrase": "management_controls"}, {"score": 0.0022897425998475362, "phrase": "complex_applications"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Software flexibility", " Change control", " Management review", " Software process improvement", " Project management"], "paper_abstract": "Software flexibility and project efficiency are deemed to be desirable but conflicting goals during software development. We considered the link between project performance, software flexibility, and management interventions. Specially, we examined software flexibility as a mediator between two recommended management control mechanisms (management review and change control) and project performance. The model was empirically evaluated using data collected from 212 project managers in the Project Management Institute. Our results confirmed that the level of control activities during the system development process was a significant facilitator of software flexibility, which, in turn, enhanced project success. A mediator role of software flexibility implied that higher levels of management controls could achieve higher levels of software flexibility and that this was beneficial not only to the maintainability of complex applications but also to project performance. (c) 2008 Published by Elsevier B.V.", "paper_title": "The effects of change control and management review on software flexibility and project performance", "paper_id": "WOS:000260289100003"}