{"auto_keywords": [{"score": 0.04900554137256697, "phrase": "asymmetric_flux-barrier"}, {"score": 0.024048941215506596, "phrase": "average_torque"}, {"score": 0.014857627188101078, "phrase": "torque_ripple"}, {"score": 0.00936079635119114, "phrase": "synchronous_reluctance_machines"}, {"score": 0.006498385829591051, "phrase": "synchronous_reluctance_machine"}, {"score": 0.004815059652864781, "phrase": "torque"}, {"score": 0.004676575291629554, "phrase": "purpose_-_the_purpose"}, {"score": 0.003951175193382119, "phrase": "pole_span_angle"}, {"score": 0.003925633992809873, "phrase": "flux-barrier_angle"}, {"score": 0.0037150687722055727, "phrase": "fe_analysis"}, {"score": 0.0036553070575015344, "phrase": "current_angle"}, {"score": 0.003515758094739175, "phrase": "step_laminations"}, {"score": 0.003097865379563127, "phrase": "purely_sinusoidal_currents"}, {"score": 0.0028471655497661528, "phrase": "single-layer_flux-barrier"}, {"score": 0.0026768530320943063, "phrase": "multilayer_flux-barrier"}, {"score": 0.002599763359352916, "phrase": "permanent_magnet"}, {"score": 0.002541338976408689, "phrase": "interior_pm_machine"}, {"score": 0.0024283900925346257, "phrase": "pm_insertion"}, {"score": 0.0023815296953640383, "phrase": "synrm_machines"}, {"score": 0.0021674482571326283, "phrase": "flux-barrier_arrangement"}], "paper_keywords": ["Average torque", " Torque ripple", " Asymmetric flux-barrier", " Current angle", " Synchronous reluctance machines"], "paper_abstract": "Purpose - The purpose of this paper is to reduce the torque ripple but not to decrease the average torque of synchronous reluctance machines by using one step or more than two axially laminated rotors with asymmetric flux-barrier. Design/methodology/approach - A 24-slot four-pole synchronous reluctance machine with overlapping windings and asymmetric flux-barrier in the rotor is, first, described and designed by finite element (FE) method for maximizing average torque. The dimensions of asymmetric flux-barrier including the pole span angle and flux-barrier angle will be optimized to minimize the torque ripple and its influence on the average torque is also investigated by FE analysis. The impact of current angle on the average torque and torque ripple are also analysed. The step laminations together with the asymmetric flux-barrier are employed for further torque ripple reduction which can consider the both rotation directions. Findings - The torque ripple of synchronous reluctance machine can be significantly reduced by employing asymmetric flux-barrier but the average torque is not reduced. Research limitations/implications - The purely sinusoidal currents are applied in this analysis and the effects of harmonics in the current on torque ripple are not considered in this application. The 24-slot/four-pole synchronous reluctance machine with single-layer flux-barrier has been employed in this analysis, but this work can be continued to investigate the synchronous reluctance machine with multilayer flux-barrier. This asymmetric flux-barrier can be easily applied to permanent magnet (PM)- assisted synchronous reluctance machine and the interior PM machine with flux-barrier in the rotor, since the space which is used for PM insertion is the same as the SynRM machines. Originality/value - This paper has analysed the torque ripple and average torque of synchronous reluctance machines with asymmetric flux-barrier and step laminations with asymmetric flux-barrier. The torque ripple can be reduced by this flux-barrier arrangement. The difference of this technique with the other techniques such as stator/rotor skew is that the average torque can be improved.", "paper_title": "Torque ripple reduction of synchronous reluctance machines: using asymmetric flux-barrier", "paper_id": "WOS:000349641700003"}