{"auto_keywords": [{"score": 0.04650334340899582, "phrase": "image_sets"}, {"score": 0.014436314223471193, "phrase": "face_recognition"}, {"score": 0.009620359465586151, "phrase": "mmd"}, {"score": 0.00481495049065317, "phrase": "manifold-manifold_distance"}, {"score": 0.004692227830462433, "phrase": "recognition_with_image_sets"}, {"score": 0.004159446063902181, "phrase": "large_variations"}, {"score": 0.003577414339646767, "phrase": "image_set"}, {"score": 0.0031982609080278643, "phrase": "general_multilevel_mmd_framework"}, {"score": 0.003037047249598515, "phrase": "local_linear_models"}, {"score": 0.002738523189244011, "phrase": "involved_manifolds"}, {"score": 0.0026004229197334875, "phrase": "mmd."}, {"score": 0.0025780912201045555, "phrase": "proposed_method"}, {"score": 0.0023855210798264205, "phrase": "minimum_mmd"}, {"score": 0.002226430168622392, "phrase": "general_set_similarity_measure"}, {"score": 0.0021049977753042253, "phrase": "state-of-the-art_discriminative_methods"}], "paper_keywords": ["Face recognition with image sets", " hierarchical divisive clustering", " manifold-manifold distance (MMD)", " principal angles", " set similarity measure"], "paper_abstract": "In this paper, we address the problem of classifying image sets for face recognition, where each set contains images belonging to the same subject and typically covering large variations. By modeling each image set as a manifold, we formulate the problem as the computation of the distance between two manifolds, called manifold-manifold distance (MMD). Since an image set can come in three pattern levels, point, subspace, and manifold, we systematically study the distance among the three levels and formulate them in a general multilevel MMD framework. Specifically, we express a manifold by a collection of local linear models, each depicted by a subspace. MMD is then converted to integrate the distances between pairs of subspaces from one of the involved manifolds. We theoretically and experimentally study several configurations of the ingredients of MMD. The proposed method is applied to the task of face recognition with image sets, where identification is achieved by seeking the minimum MMD from the probe to the gallery of image sets. Our experiments demonstrate that, as a general set similarity measure, MMD consistently outperforms other competing nondiscriminative methods and is also promisingly comparable to the state-of-the-art discriminative methods.", "paper_title": "Manifold-Manifold Distance and Its Application to Face Recognition With Image Sets", "paper_id": "WOS:000309056700013"}