{"auto_keywords": [{"score": 0.030961125428255173, "phrase": "ocular_normal_subjects"}, {"score": 0.00920844207306724, "phrase": "wfa"}, {"score": 0.009004989811734193, "phrase": "fa"}, {"score": 0.00481495049065317, "phrase": "fractal_analysis"}, {"score": 0.004582897918101983, "phrase": "multiclass_prediction"}, {"score": 0.00415166680936294, "phrase": "normal_subjects"}, {"score": 0.004041238873048836, "phrase": "progressive_and_nonprogressive_glaucoma"}, {"score": 0.0038985392250620483, "phrase": "box-counting_method"}, {"score": 0.00384633057714983, "phrase": "multifractional_brownian_motion_method"}, {"score": 0.0037608593980593035, "phrase": "multiresolution_analyses"}, {"score": 0.0036443694410100507, "phrase": "gaussian_kernel-based_multiclass_classification"}, {"score": 0.003499864176875713, "phrase": "auroc"}, {"score": 0.003406713877432236, "phrase": "fa_features"}, {"score": 0.0026720866990543744, "phrase": "multiclass_classification_rates"}, {"score": 0.0023770362063833903, "phrase": "multiclass_classification"}, {"score": 0.0022218413146898887, "phrase": "novel_fa-based_features"}, {"score": 0.00210499793205176, "phrase": "ffa."}], "paper_keywords": ["Area under receiver operating characteristic curve (AUROC)", " feature-based technique", " fractal analysis (FA)", " glaucoma detection and progression", " multiclass classification"], "paper_abstract": "We investigate the use of fractal analysis (FA) as the basis of a system for multiclass prediction of the progression of glaucoma. FA is applied to pseudo 2-D images converted from 1-D retinal nerve fiber layer data obtained from the eyes of normal subjects, and from subjects with progressive and nonprogressive glaucoma. FA features are obtained using a box-counting method and a multifractional Brownian motion method that incorporates texture and multiresolution analyses. Both features are used for Gaussian kernel-based multiclass classification. Sensitivity, specificity, and area under receiver operating characteristic curve (AUROC) are computed for the FA features and for metrics obtained usingwavelet-Fourier analysis(WFA) and fast-Fourier analysis (FFA). The AUROCs that predict progressors from nonprogressors based on classifiers trained using a dataset comprised of nonprogressors and ocular normal subjects are 0.70, 0.71, and 0.82 for WFA, FFA, and FA, respectively. The correct multiclass classification rates among progressors, nonprogressors, and ocular normal subjects are 0.82, 0.86, and 0.88 for WFA, FFA, and FA, respectively. Simultaneous multiclass classification among progressors, nonprogressors, and ocular normal subjects has not been previously described. The novel FA-based features achieve better performance with fewer features and less computational complexity thanWFA and FFA.", "paper_title": "Novel Fractal Feature-Based Multiclass Glaucoma Detection and Progression Prediction", "paper_id": "WOS:000321144400002"}