{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "structural_similarity"}, {"score": 0.0322082065344101, "phrase": "fragment_spectrum"}, {"score": 0.004402854153653114, "phrase": "specific_need"}, {"score": 0.004265953661191515, "phrase": "resource_combinations"}, {"score": 0.00392125815948488, "phrase": "desirable_resource_combinations"}, {"score": 0.0037793152987497286, "phrase": "corresponding_graph"}, {"score": 0.0036617315529835497, "phrase": "graph_clustering_method"}, {"score": 0.003492155652400838, "phrase": "connected_subgraphs"}, {"score": 0.0034013521529056715, "phrase": "graph-structured_data"}, {"score": 0.0029038817737006405, "phrase": "frequency_distribution"}, {"score": 0.002522231843876692, "phrase": "graphs"}, {"score": 0.0024144659350277954, "phrase": "transformed_spectra"}, {"score": 0.0023640560785711923, "phrase": "standard_clustering_method"}, {"score": 0.0021273284545701896, "phrase": "preliminary_experiments"}, {"score": 0.0021049977753042253, "phrase": "synthesized_data"}], "paper_keywords": [""], "paper_abstract": "Resources available over the Web are often used in combination to meet a specific need of a user. Since resource combinations can be represented as graphs in terms of the relations among the resources, locating desirable resource combinations can be formulated as locating the corresponding graph. This paper describes a graph clustering method based on structural similarity of fragments (currently, connected subgraphs are considered) in graph-structured data. A fragment is characterized based on the connectivity (degree) of a node in the fragment. A fragment spectrum of a graph is created based on the frequency distribution of fragments. Thus, the representation of a graph is transformed into a fragment spectrum in terms of the properties of fragments in the graph. Graphs are then clustered with respect to the transformed spectra by applying a standard clustering method. We also devise a criterion to determine the number of clusters by defining a pseudo-entropy for clusters. Preliminary experiments with synthesized data were conducted and the results are reported.", "paper_title": "Graph clustering based on structural similarity of fragments", "paper_id": "WOS:000236905700006"}