{"auto_keywords": [{"score": 0.035712033789452875, "phrase": "information_privacy"}, {"score": 0.015719716506582538, "phrase": "electronic_health_records"}, {"score": 0.012051068529751442, "phrase": "behavioral_intentions"}, {"score": 0.010694429219715296, "phrase": "attitude_change"}, {"score": 0.004741304218199546, "phrase": "privacy_concerns"}, {"score": 0.004697655699119423, "phrase": "elaboration_likelihood"}, {"score": 0.00459735824483322, "phrase": "emerging_context"}, {"score": 0.004527024978801684, "phrase": "health_care"}, {"score": 0.004416713079266374, "phrase": "significant_technological_advance"}, {"score": 0.004362564831572539, "phrase": "medical_information"}, {"score": 0.004230068512904886, "phrase": "multiple_parties"}, {"score": 0.004191106618363275, "phrase": "health_care_delivery"}, {"score": 0.004088946559031241, "phrase": "anticipated_value_potential"}, {"score": 0.004001593118269276, "phrase": "widespread_concerti"}, {"score": 0.003976978140059542, "phrase": "consumer_privacy_issues"}, {"score": 0.003515162360861593, "phrase": "significant_privacy_concerns"}, {"score": 0.0034083145672246067, "phrase": "individual's_concern"}, {"score": 0.0033251716926666437, "phrase": "elaboration_likelihood_model"}, {"score": 0.0031746892156724006, "phrase": "ehr_system"}, {"score": 0.0025892330566358503, "phrase": "individual's_cfip"}, {"score": 0.002541677703992971, "phrase": "issue_involvement"}, {"score": 0.002404175869425017, "phrase": "ehr_use"}, {"score": 0.0023893635026860727, "phrase": "cfip"}, {"score": 0.0022323154532645187, "phrase": "high_concerns"}], "paper_keywords": ["Privacy", " elaboration likelihood model", " ELM", " electronic health records", " EHR", " concern for information privacy", " CFIP", " attitude"], "paper_abstract": "Within the emerging context of the digitization of health care, electronic health records (EHRs) constitute a significant technological advance in the way medical information is stored, communicated, and processed by the multiple parties involved in health care delivery. However, in spite of the anticipated value potential of this technology, there is widespread concerti that consumer privacy issues may impede its diffusion. In this study, we pose the question: Can individuals be persuaded to change their attitudes and opt-in behavioral intentions toward EHRs, and allow their medical information to be digitized even in the presence of significant privacy concerns? To investigate this question, we integrate an individual's concern for information privacy (CFIP) with the elaboration likelihood model (ELM) to examine attitude change and likelihood of opting-in to an EHR system. We theorize that issue involvement and argument framing interact to influence attitude change, and that concern for information privacy further moderates the effects of these variables. We also propose that likelihood of adoption is driven by concern for information privacy and attitude. We test our predictions using at? experiment with 366 subjects where we manipulate the framing of the arguments supporting EHRs. We find that an individual's CFIP interacts with argument framing and issue involvement to affect attitudes toward the use of EHRs. In addition, results suggest that attitude toward EHR use and CFIP directly influence opt-in behavioral intentions. An important finding for both theory and practice is that even when people have high concerns for privacy, their attitudes can be positively altered with appropriate message framing. These results as well as other theoretical and practical implications are discussed.", "paper_title": "ADOPTION OF ELECTRONIC HEALTH RECORDS IN THE PRESENCE OF PRIVACY CONCERNS: THE ELABORATION LIKELIHOOD MODEL AND INDIVIDUAL PERSUASION", "paper_id": "WOS:000267558500007"}