{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "h_index"}, {"score": 0.029600443367118263, "phrase": "productive_core"}, {"score": 0.004438642216475526, "phrase": "standard_bibliometric_measures"}, {"score": 0.004315324272986853, "phrase": "l._bornmann"}, {"score": 0.004288386935585756, "phrase": "r._mutz"}, {"score": 0.00389164348807591, "phrase": "scientist's_output"}, {"score": 0.0035094132888607134, "phrase": "evaluative_bibliometric_studies"}, {"score": 0.0032756158688245, "phrase": "quantity_dimension"}, {"score": 0.0031646057802503526, "phrase": "impact_dimension"}, {"score": 0.003066945490483524, "phrase": "factor_analysis"}, {"score": 0.0030097975788892896, "phrase": "newly_calculated_analysis"}, {"score": 0.002953711377604328, "phrase": "high_intercorrelation"}, {"score": 0.0026344897278397215, "phrase": "impact"}, {"score": 0.0025811251515543195, "phrase": "high-loading_indices"}, {"score": 0.0025014259919355453, "phrase": "empirical_application"}, {"score": 0.002477998427152547, "phrase": "high_intercorrelations"}, {"score": 0.0024625017739528096, "phrase": "different_indicators"}, {"score": 0.0021926354732269846, "phrase": "researcher's_productive_core"}, {"score": 0.0021315842986705485, "phrase": "core_papers"}, {"score": 0.0021049977753042253, "phrase": "meaningful_approach"}], "paper_keywords": [""], "paper_abstract": "In this study, we investigate whether there is a need for the h index and its variants in addition to standard bibliometric measures (SBMs). Results from our recent study (L. Bornmann, R. Mutz, & H.-D. Daniel, 2008) have indicated that there are two types of indices: One type of indices (e.g., h index) describes the most productive core of a scientist's output and informs about the number of papers in the core. The other type of indices (e.g., a index) depicts the impact of the papers in the core. In evaluative bibliometric studies, the two dimensions quantity and quality of output are usually assessed using the SBMs \"number of publications\" (for the quantity dimension) and \"total citation counts\" (for the impact dimension). We additionally included the SBMs into the factor analysis. The results of the newly calculated analysis indicate that there is a high intercorrelation between \"number of publications\" and the indices that load substantially on the factor Quantity of the Productive Core as well as between \"total citation counts\" and the indices that load substantially on the factor Impact of the Productive Core. The high-loading indices and SBMs within one performance dimension could be called redundant in empirical application, as high intercorrelations between different indicators are a sign for measuring something similar (or the same). Based on our findings, we propose the use of any pair of indicators (one relating to the number of papers in a researcher's productive core and one relating to the impact of these core papers) as a meaningful approach for comparing scientists.", "paper_title": "Do We Need the h Index and Its Variants in Addition to Standard Bibliometric Measures?", "paper_id": "WOS:000266303800018"}