{"auto_keywords": [{"score": 0.049465088868450476, "phrase": "inherent_program_characteristics"}, {"score": 0.04159267344622788, "phrase": "representative_subset"}, {"score": 0.03812022871741232, "phrase": "spec_cpu_benchmark_suites"}, {"score": 0.00481495049065317, "phrase": "benchmark_similarity"}, {"score": 0.003865826699096508, "phrase": "benchmark_suites"}, {"score": 0.003531474887552889, "phrase": "proposed_methodology"}, {"score": 0.003225948168571578, "phrase": "mediabench"}, {"score": 0.003163986348675419, "phrase": "mibench"}, {"score": 0.003004494701922268, "phrase": "representative_programs"}, {"score": 0.0025394700487126414, "phrase": "simulation_time"}, {"score": 0.0021742244283295986, "phrase": "dramatic_increase"}, {"score": 0.002132420504803564, "phrase": "dynamic_instruction_count"}, {"score": 0.0021049977753042253, "phrase": "increasingly_poor_temporal_data_locality"}], "paper_keywords": ["measurement techniques", " modeling techniques", " performance of systems", " performance attributes"], "paper_abstract": "This paper proposes a methodology for measuring the similarity between programs based on their inherent microarchitecture-independent characteristics, and demonstrates two applications for it: 1) finding a representative subset of programs from benchmark suites and 2) studying the evolution of four generations of SPEC CPU benchmark suites. Using the proposed methodology, we find a representative subset of programs from three popular benchmark suites-SPEC CPU2000, MediaBench, and MiBench. We show that this subset of representative programs can be effectively used to estimate the average benchmark suite IPC, L1 data cache miss-rates, and speedup on 11 machines with different ISAs and microarchitectures-this enables one to save simulation time with little loss in accuracy. From our study of the similarity between the four generations of SPEC CPU benchmark suites, we find that, other than a dramatic increase in the dynamic instruction count and increasingly poor temporal data locality, the inherent program characteristics have more or less remained unchanged.", "paper_title": "Measuring benchmark similarity using inherent program characteristics", "paper_id": "WOS:000236929800010"}