{"auto_keywords": [{"score": 0.04164468320956016, "phrase": "bivariate_relationships"}, {"score": 0.02807165003858347, "phrase": "mwk"}, {"score": 0.00481495049065317, "phrase": "diagnostic_tool"}, {"score": 0.004773040022691547, "phrase": "non-stationary_kriging_models"}, {"score": 0.004588891098290524, "phrase": "novel_use"}, {"score": 0.004316396683332752, "phrase": "non-stationary_geostatistical_predictor"}, {"score": 0.004204602964512469, "phrase": "spatial_investigation"}, {"score": 0.003920384090110374, "phrase": "study_data"}, {"score": 0.003752550907120244, "phrase": "key_outputs"}, {"score": 0.003703611021999795, "phrase": "spatial_predictor"}, {"score": 0.0035761913760242697, "phrase": "window_kriging"}, {"score": 0.003453140302583322, "phrase": "local_variogram"}, {"score": 0.003378385493203297, "phrase": "target_location"}, {"score": 0.002936709606809639, "phrase": "better_understanding"}, {"score": 0.002497319603143104, "phrase": "great_britain"}, {"score": 0.0024433223939504876, "phrase": "london"}, {"score": 0.0023487324083283205, "phrase": "data_sets"}, {"score": 0.0023079225317714815, "phrase": "local_anomalies"}, {"score": 0.0021049977753042253, "phrase": "non-robust_counterpart"}], "paper_keywords": ["visualisation", " coplot", " robust", " local variogram", " geographically weighted"], "paper_abstract": "In this study, we demonstrate a novel use of comaps to explore spatially the performance, specification and parameterisation of a non-stationary geostatistical predictor. The comap allows the spatial investigation of the relationship between two geographically referenced variables via conditional distributions. Rather than investigating bivariate relationships in the study data, we use comaps to investigate bivariate relationships in the key outputs of a spatial predictor. In particular, we calibrate moving window kriging (MWK) models, where a local variogram is found at every target location. This predictor has often proved worthy for processes that are heterogeneous, and most standard (global variogram) kriging algorithms can be adapted in this manner. We show that the use of comaps enables a better understanding of our chosen MWK models, which in turn allows a more informed choice when selecting one MWK specification over another. As case studies, we apply four variants of MWK to two heterogeneous example data sets: (i) freshwater acidification critical load data for Great Britain and (ii) London house price data. As both of these data sets are strewn with local anomalies, three of our chosen models are robust (and novel) extensions of MWK, where at least one of which is shown to perform better than a non-robust counterpart.", "paper_title": "The comap as a diagnostic tool for non-stationary kriging models", "paper_id": "WOS:000316655000006"}