{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "non-interactive_instance-dependent_commitment_schemes"}, {"score": 0.0486868426803837, "phrase": "zero-knowledge_protocols"}, {"score": 0.04733190377720633, "phrase": "specific_problems"}, {"score": 0.040845749728847636, "phrase": "wide_variety"}, {"score": 0.004459334186889869, "phrase": "graph-isomorphism."}, {"score": 0.004278807087784626, "phrase": "important_level"}, {"score": 0.004129873531628877, "phrase": "limited_results"}, {"score": 0.003626626504149897, "phrase": "formal_framework"}, {"score": 0.0032414846064621177, "phrase": "nic"}, {"score": 0.0030017207229983385, "phrase": "closure_properties"}, {"score": 0.0025892330566358503, "phrase": "formal_yet_intuitive_tools"}, {"score": 0.002233301265743633, "phrase": "specific_problem"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Cryptography", " Zero knowledge", " Instant-dependent commitment schemes"], "paper_abstract": "Zero-knowledge protocols are often studied through specific problems, like GRAPH-ISOMORPHISM. In many cases this approach prevents an important level of abstraction and leads to limited results, whereas in fact the constructions apply to a wide variety of problems. We propose to address this issue with a formal framework of non-interactive instance-dependent commitment schemes (NIC). We define NIC in the perfect, statistical, and computational settings, and formally characterize problems admitting NIC in all of these settings. We also prove other useful lemmas such as closure properties. Consequently, results that previously applied only to specific problems are now strengthened by our framework to apply to classes of problems. By providing formal yet intuitive tools, our framework facilitates the construction of zero-knowledge protocols for a wide variety of problems, in various settings, without the need to refer to a specific problem. Our results are unconditional. (C) 2015 Elsevier B.V. All rights reserved.", "paper_title": "A framework for non-interactive instance-dependent commitment schemes (NIC)", "paper_id": "WOS:000358624500001"}