{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "evolutionary_robotics"}, {"score": 0.043122440159155305, "phrase": "robot_behaviors"}, {"score": 0.028312317972293805, "phrase": "behavioral_diversity"}, {"score": 0.004670692051162177, "phrase": "er"}, {"score": 0.004295136518467118, "phrase": "er_researchers"}, {"score": 0.004150377643719188, "phrase": "infinite_number"}, {"score": 0.004087609837102023, "phrase": "fitness_functions"}, {"score": 0.0037446140218109895, "phrase": "premature_convergence"}, {"score": 0.003365529624506815, "phrase": "classic_evolutionary_optimization"}, {"score": 0.003047865053078826, "phrase": "new_questions"}, {"score": 0.0028456326741466494, "phrase": "best_way"}, {"score": 0.002687366778212309, "phrase": "main_published_approaches"}, {"score": 0.00260657976055413, "phrase": "common_framework"}, {"score": 0.0024150528983695446, "phrase": "evolutionary_process"}, {"score": 0.002387560868354908, "phrase": "investigated_experiments"}, {"score": 0.0022981559278396845, "phrase": "benchmarked_approaches"}, {"score": 0.0022806798371116698, "phrase": "multi-objective_methods"}, {"score": 0.0022037127773003266, "phrase": "hamming"}, {"score": 0.0021702728407945976, "phrase": "behavioral_distance"}, {"score": 0.0021049977753042253, "phrase": "specific_behavioral_metrics"}], "paper_keywords": ["Evolutionary robotics", " diversity", " multi-objective evolutionary algorithm", " neural networks"], "paper_abstract": "Evolutionary robotics (ER) aims at automatically designing robots or controllers of robots without having to describe their inner workings. To reach this goal, ER researchers primarily employ phenotypes that can lead to an infinite number of robot behaviors and fitness functions that only reward the achievement of the task and not how to achieve it. These choices make ER particularly prone to premature convergence. To tackle this problem, several papers recently proposed to explicitly encourage the diversity of the robot behaviors, rather than the diversity of the genotypes as in classic evolutionary optimization. Such an approach avoids the need to compute distances between structures and the pitfalls of the noninjectivity of the phenotype/behavior relation; however, it also introduces new questions: how to compare behavior? should this comparison be task specific? and what is the best way to encourage diversity in this context? In this paper, we review the main published approaches to behavioral diversity and benchmark them in a common framework. We compare each approach on three different tasks and two different genotypes. The results show that fostering behavioral diversity substantially improves the evolutionary process in the investigated experiments, regardless of genotype or task. Among the benchmarked approaches, multi-objective methods were the most efficient and the generic, Hamming-based, behavioral distance was at least as efficient as task specific behavioral metrics.", "paper_title": "Encouraging Behavioral Diversity in Evolutionary Robotics: An Empirical Study", "paper_id": "WOS:000300484000004"}