{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "soft-tissue_interaction"}, {"score": 0.040850941160709635, "phrase": "needle_insertion"}, {"score": 0.004290112502811656, "phrase": "tissue_motion"}, {"score": 0.004231089088705995, "phrase": "dual_c-arm_fluoroscopy_system"}, {"score": 0.00398452530840582, "phrase": "implanted_fiducials"}, {"score": 0.003929689573550262, "phrase": "soft_tissue"}, {"score": 0.0038222630466021494, "phrase": "necessary_parameters"}, {"score": 0.003787108326100196, "phrase": "accurate_modeling"}, {"score": 0.0037177622939493084, "phrase": "soft-tissue_interactions"}, {"score": 0.003118942369691329, "phrase": "important_parameters"}, {"score": 0.003061793572858598, "phrase": "approximate_cutting_force"}, {"score": 0.0029780219173522115, "phrase": "local_effective_modulus"}, {"score": 0.0026775328564629577, "phrase": "arbitrary_needle_puncture_tasks"}, {"score": 0.0022772782536385717, "phrase": "haptic_device"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v._all_rights"}], "paper_keywords": ["surgical simulation", " soft-tissue modeling", " needle insertion simulation", " local effective modulus", " haptic feedback"], "paper_abstract": "A methodology for modeling the needle and soft-tissue interaction during needle insertion is presented. The approach consists of the measurement of needle and tissue motion using a dual C-arm fluoroscopy system. Our dual Garm fluoroscopy setup allows real time 3-D extraction of the displacement of implanted fiducials in the soft tissue during needle insertion to obtain the necessary parameters for accurate modeling of needle and soft-tissue interactions. The needle and implanted markers in the tissue are tracked during the insertion and withdrawal of the needle at speeds of 1.016 mm/s, 12.7 mm/s and 25.4 mm/s. Both image and force data are utilized to determine important parameters such as the approximate cutting force, puncture force, the local effective modulus (LEM) during puncture, and the relaxation of tissue. We have also validated the LEM computed from our finite element model with arbitrary needle puncture tasks. Based on these measurements, we developed a model for needle insertion and withdrawal that can be used to generate a 1-DOF force versus position profile that can be experienced by a user operating a haptic device. This profile was implemented on a 7-DOf haptic device designed in our laboratory. (C) 2006 Elsevier B.V. All rights reserved.", "paper_title": "A biplanar fluoroscopic approach for the measurement, modeling, and simulation of needle and soft-tissue interaction", "paper_id": "WOS:000244903300005"}