{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "local_shape_difference_boosting"}, {"score": 0.004635477242873163, "phrase": "collective_shape_difference_classifier"}, {"score": 0.00459165923324494, "phrase": "csdc"}, {"score": 0.004483909657713567, "phrase": "practical_application_requirements"}, {"score": 0.004296264970612285, "phrase": "easy_implementation"}, {"score": 0.004175533280178052, "phrase": "fast_posture_alignment_method"}, {"score": 0.003944112858235306, "phrase": "input_face"}, {"score": 0.0037432199549135826, "phrase": "signed_shape_difference_map"}, {"score": 0.0035189057079817285, "phrase": "mediate_representation"}, {"score": 0.0034690732089830045, "phrase": "shape_comparison"}, {"score": 0.0031996871318754685, "phrase": "change_characteristics"}, {"score": 0.0031693980719538317, "phrase": "facial_shapes"}, {"score": 0.0029935730127943496, "phrase": "weak_classifiers"}, {"score": 0.0027741761880779535, "phrase": "different_schemes"}, {"score": 0.002657890175649468, "phrase": "high_performance"}, {"score": 0.0024630345285372958, "phrase": "standard_protocol"}, {"score": 0.0021352776064254195, "phrase": "experimental_results"}], "paper_keywords": ["3D shape matching", " collective shape difference classifier", " face recognition", " signed shape difference map"], "paper_abstract": "This paper proposes a new 3D face recognition approach, Collective Shape Difference Classifier (CSDC), to meet practical application requirements, i.e., high recognition performance, high computational efficiency, and easy implementation. We first present a fast posture alignment method which is self-dependent and avoids the registration between an input face against every face in the gallery. Then, a Signed Shape Difference Map (SSDM) is computed between two aligned 3D faces as a mediate representation for the shape comparison. Based on the SSDMs, three kinds of features are used to encode both the local similarity and the change characteristics between facial shapes. The most discriminative local features are selected optimally by boosting and trained as weak classifiers for assembling three collective strong classifiers, namely, CSDCs with respect to the three kinds of features. Different schemes are designed for verification and identification to pursue high performance in both recognition and computation. The experiments, carried out on FRGC v2 with the standard protocol, yield three verification rates all better than 97.9 percent with the FAR of 0.1 percent and rank-1 recognition rates above 98 percent. Each recognition against a gallery with 1,000 faces only takes about 3.6 seconds. These experimental results demonstrate that our algorithm is not only effective but also time efficient.", "paper_title": "Robust 3D Face Recognition by Local Shape Difference Boosting", "paper_id": "WOS:000281000700011"}