{"auto_keywords": [{"score": 0.033151764504575625, "phrase": "computer_mediated_communication"}, {"score": 0.00481495049065317, "phrase": "construction_industry"}, {"score": 0.004568326972997448, "phrase": "reoccurring_feature"}, {"score": 0.004517137548648729, "phrase": "traditional_way"}, {"score": 0.004174451361776433, "phrase": "remote_collaboration"}, {"score": 0.004143196873246147, "phrase": "computational_technology"}, {"score": 0.003886770770835211, "phrase": "natural_richness"}, {"score": 0.0038576618286586387, "phrase": "human_communication"}, {"score": 0.003591733916159209, "phrase": "technical_nature"}, {"score": 0.0034332736827447654, "phrase": "carefully_controlled_set"}, {"score": 0.003220643255032943, "phrase": "partially_developed_simple_design_task"}, {"score": 0.002953711377604328, "phrase": "similar_design_task"}, {"score": 0.0028769371032728733, "phrase": "principal_objective"}, {"score": 0.0028127163745564777, "phrase": "real_construction_project"}, {"score": 0.002688532127821979, "phrase": "construction_design_nature"}, {"score": 0.0025219085140220773, "phrase": "real_life_construction_design_standard"}, {"score": 0.0022022878843247257, "phrase": "surprising_result"}, {"score": 0.0021693692831601745, "phrase": "communication_lack_rich_and_valuable_non-verbal_aspects"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Collaboration", " Communication", " Team productivity", " Emotions", " Behaviour profile", " Number of exchanges"], "paper_abstract": "In the construction industry, the need for collaboration between people who are geographically remote is a reoccurring feature. The traditional way of handing this is collocation but this is expensive and disruptive and so increasingly, use has been made of remote collaboration using computational technology over networks. This raises a concern that such a form of working may lose some of the natural richness of human communication which, in turn, will impair the ability of the participants to effectively undertake tasks of a technical nature. To assess whether or not this is so, a carefully controlled set of experiments has been undertaken using twenty pairs of people who are required to work on a partially developed simple design task. The work is undertaken using computer mediated communication supported by a 3D CAD package. As a control, the same pairs have also undertaken a similar design task working face to face. The principal objective is not to simulate a real construction project with all its complexities, but to evaluate collaboration using tasks of a construction design nature. The results show that, for the type of task used (which, by real life construction design standard, are rather simplistic in nature), people collaborating using computer mediated communication, at worst are as effective as people working face to face and are probably actually slightly more effective. This is a surprising result since computer mediated communication lack rich and valuable non-verbal aspects of communication. (C) 2012 Elsevier Ltd. All rights reserved.", "paper_title": "Comparing the effectiveness of face to face and computer mediated collaboration", "paper_id": "WOS:000308122400017"}