{"auto_keywords": [{"score": 0.04835978765719222, "phrase": "agents'_behaviors"}, {"score": 0.036110624060568856, "phrase": "behavioral_patterns"}, {"score": 0.00481495049065317, "phrase": "multi-agent_simulations"}, {"score": 0.004762435022350756, "phrase": "individual-centered_simulations"}, {"score": 0.004483661138397267, "phrase": "variety"}, {"score": 0.004159763048814389, "phrase": "users'_feeling"}, {"score": 0.003952082333580496, "phrase": "simultaneous_influence"}, {"score": 0.0037410163380850797, "phrase": "agent-based_simulations"}, {"score": 0.003633079011725194, "phrase": "generic_and_non-intrusive_tool"}, {"score": 0.0032671775301001483, "phrase": "behavioral_archetype"}, {"score": 0.0032433414042726356, "phrase": "agents'_creation"}, {"score": 0.0031728680535262083, "phrase": "compliance_reference"}, {"score": 0.0031039212233596415, "phrase": "deviant_behaviors"}, {"score": 0.0030143100083252516, "phrase": "specific_process"}, {"score": 0.0028116863172018593, "phrase": "behavioral_patterns_configuration"}, {"score": 0.0027911639820564897, "phrase": "real_or_simulated_data"}, {"score": 0.002720505061804933, "phrase": "easy_introduction"}, {"score": 0.0025468951021098717, "phrase": "traffic_simulation"}, {"score": 0.0024915167458844914, "phrase": "driving_styles"}, {"score": 0.0023756164484983874, "phrase": "behavioral_realism"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Agent", " Agent-based simulation", " Behavior", " Variety", " Consistency", " Road traffic"], "paper_abstract": "In individual-centered simulations, the variety and consistency of agents' behaviors reinforce the realism and validity of the simulation. Variety increases the diversity of behaviors that users meet during the simulation. Consistency ensures that these behaviors improve the users' feeling of immersion. In this work, we address the issue of the simultaneous influence of these two elements. We propose a formalization of the construction of populations for agent-based simulations, which provides the basis for a generic and non-intrusive tool allowing an out-of-the-agent design. First, the model uses behavioral patterns to describe standards of behaviors for the agents. They provide a behavioral archetype during agents' creation, and are also a compliance reference, that allows to detect deviant behaviors and address them. Then, a specific process instantiates the agents by using the specification provided by the patterns. Finally, inference enables to automate behavioral patterns configuration from real or simulated data. This formalization allows for the easy introduction of variety in agents' behaviors, while controlling the conformity to specifications. We applied the model to traffic simulation, in order to introduce driving styles specified using behavioral patterns (e.g. cautious or aggressive drivers). The behavioral realism of the traffic was therefore improved, and the experimentations we conducted show how the model contributes to increase the variety and the representativeness of the behaviors. (C) 2012 Elsevier Ltd. All rights reserved.", "paper_title": "Formalizing the construction of populations in multi-agent simulations", "paper_id": "WOS:000313855000017"}