{"auto_keywords": [{"score": 0.03582496840484444, "phrase": "expert_stakeholder_group"}, {"score": 0.00481495049065317, "phrase": "health_it"}, {"score": 0.004674952036988355, "phrase": "fdasia_working_group"}, {"score": 0.004406998187009431, "phrase": "hhs"}, {"score": 0.004253645099068757, "phrase": "fda"}, {"score": 0.004033690030343587, "phrase": "fcc"}, {"score": 0.0039626308903511764, "phrase": "office_of_the_national"}, {"score": 0.0030017207229983385, "phrase": "healthcare_it_systems"}, {"score": 0.0027796495180095657, "phrase": "regulatory_requirements"}, {"score": 0.0025436978068459565, "phrase": "public_deliberations"}, {"score": 0.0025137856138000014, "phrase": "final_public_report"}, {"score": 0.0023976048394496446, "phrase": "key_suggestions"}, {"score": 0.002233301265743633, "phrase": "risk-based_regulatory_framework"}, {"score": 0.002155412043665635, "phrase": "patient_safety"}, {"score": 0.0021049977753042253, "phrase": "regulatory_duplication"}], "paper_keywords": [""], "paper_abstract": "The Secretary of Health and Human Services (HHS) acting through the Food and Drug Administration (FDA), and in collaboration with the Federal Communications Commission (FCC) and Office of the National Coordinator for Health IT (ONC) was tasked with delivering a report on an appropriate, risk-based regulatory framework for health information technology (IT). An expert stakeholder group was established under the auspices of the Health IT Policy Committee to help provide input into the development of this framework, including how healthcare IT systems could be stratified in terms of risk and recommendations about how the regulatory requirements currently in place should be adapted. In this paper, we summarize the public deliberations and final public report of the expert stakeholder group, and conclude with key suggestions intended to address the charge to recommend the features of a risk-based regulatory framework that promote innovation, protect patient safety, and avoid regulatory duplication.", "paper_title": "A risk-based regulatory framework for health IT: recommendations of the FDASIA working group", "paper_id": "WOS:000341858100002"}