{"auto_keywords": [{"score": 0.049550340698458664, "phrase": "spanish"}, {"score": 0.04902896582647278, "phrase": "catalan"}, {"score": 0.00481495049065317, "phrase": "multidisciplinary_prosodic_studies"}, {"score": 0.004657393640152439, "phrase": "literature_review"}, {"score": 0.004430629452265786, "phrase": "prosodic_studies"}, {"score": 0.0034707339811048403, "phrase": "twenty_eight_speakers"}, {"score": 0.0031405975280029913, "phrase": "entire_material"}, {"score": 0.002970914475538276, "phrase": "acoustic_signal"}, {"score": 0.0026584843838039166, "phrase": "wide_coverage"}, {"score": 0.00262910358108176, "phrase": "representative_real-life_communicative_situations"}, {"score": 0.0023788319661581696, "phrase": "research_studies"}, {"score": 0.0022880528191813083, "phrase": "speakers_different_speaking_styles"}], "paper_keywords": ["Prosodic corpus", " Radio news corpus", " Dialogue corpus", " Spanish corpus", " Catalan corpus"], "paper_abstract": "Literature review on prosody reveals the lack of corpora for prosodic studies in Catalan and Spanish. In this paper, we present a corpus intended to fill this gap. The corpus comprises two distinct data-sets, a news subcorpus and a dialogue subcorpus, the latter containing either conversational or task-oriented speech. More than 25 h were recorded by twenty eight speakers per language. Among these speakers, eight were professional (four radio news broadcasters and four advertising actors). The entire material presented here has been transcribed, aligned with the acoustic signal and prosodically annotated. Two major objectives have guided the design of this project: (i) to offer a wide coverage of representative real-life communicative situations which allow for the characterization of prosody in these two languages; and (ii) to conduct research studies which enable us to contrast the speakers different speaking styles and discursive practices. All material contained in the corpus is provided under a Creative Commons Attribution 3.0 Unported License.", "paper_title": "Glissando: a corpus for multidisciplinary prosodic studies in Spanish and Catalan", "paper_id": "WOS:000328213000002"}