{"auto_keywords": [{"score": 0.04707862248234477, "phrase": "candidate_answers"}, {"score": 0.014545315295587561, "phrase": "information_sources"}, {"score": 0.0047051051659828275, "phrase": "redundancy-based_qa_systems"}, {"score": 0.004309968592440261, "phrase": "final_answers"}, {"score": 0.0034368818187904744, "phrase": "different_persons"}, {"score": 0.003281643474564305, "phrase": "suitable_vocabulary"}, {"score": 0.0029642838574678526, "phrase": "direct_retrieval"}, {"score": 0.002843450389745497, "phrase": "present_survey"}, {"score": 0.0027275289970185015, "phrase": "answering_task"}, {"score": 0.002702428091791703, "phrase": "qa"}, {"score": 0.0022355167967736326, "phrase": "research_community_endeavors"}, {"score": 0.0022149235007885826, "phrase": "response_generation"}], "paper_keywords": [""], "paper_abstract": "The answer determines the success of a Question-Answering (QA) system. In redundancy-based QA systems, a common approach is to extract the candidate answers from the information sources and select the most frequent answers as the final answers. However, this strategy has some pitfalls. For instance, if a system is not able to detect equivalences between the candidate answers, their frequencies might be erroneously calculated. Moreover, the user who posed the question should also be taken into account when answering: different persons require different (correct) answers. This can involve the use of suitable vocabulary and/or information details. In these situations, the generation of a response can be a more suitable strategy, instead of the extraction and direct retrieval of the answer from the information sources. The present survey targets the state of the art in the answering task in QA under three different lines of research. First, we present several works that focus on relating candidate answers. Then, we recover the concept of cooperative answer - a correct, useful, and non-misleading answer - and we bring up attempts to address cooperative answering. Finally, we investigate the research community endeavors on response generation. We will also present our perspective on each of these three topics throughout this paper.", "paper_title": "When the answer comes into question in question-answering: survey and open issues", "paper_id": "WOS:000311686300001"}