{"auto_keywords": [{"score": 0.04862271607252209, "phrase": "midlatency_auditory"}, {"score": 0.038343095430468835, "phrase": "entropy_function"}, {"score": 0.0345329343635053, "phrase": "general_anaesthesia"}, {"score": 0.00481495049065317, "phrase": "multiscale_analysis"}, {"score": 0.004422827355213055, "phrase": "methodological_aspects"}, {"score": 0.004355026964936104, "phrase": "heuristic_pattern_recognition"}, {"score": 0.0042552618754756934, "phrase": "evoked_potentials"}, {"score": 0.00406250784433007, "phrase": "nonlinear_transformation"}, {"score": 0.0039694170761766226, "phrase": "wavelet_transform"}, {"score": 0.0037314328720368453, "phrase": "statistical_error_model"}, {"score": 0.003534889186471058, "phrase": "gibbs_function"}, {"score": 0.002205079358459154, "phrase": "defined_statistical_error_model"}], "paper_keywords": ["pattern recognition", " anaesthesia", " MLAEP", " wavelet", " entropy"], "paper_abstract": "This work shows methodological aspects of heuristic pattern recognition in auditory evoked potentials. A linear and a nonlinear transformation based on wavelet transform are presented. They result in a statistical error model and an entropy function related to the Gibbs function and describe changes in midlatency auditory evoked potentials induced by general anaesthesia. The same transformations were calculated using 12 common wavelets. We present a method to compare the two defined parametrizations with respect to their ability to discriminate two defined states which is responsive and unresponsive depending on the wavelet used for the analysis. Auditory evoked potentials of 60 patients undergoing general anaesthesia were analysed. We propose the defined statistical error model and the entropy function as a very robust measure of changes in auditory evoked potentials. The influence of the wavelets suggest that for each parametrization the goodness of the wavelet should be validated.", "paper_title": "The influence of wavelets on multiscale analysis and parametrization of midlatency auditory evoked potentials", "paper_id": "WOS:000239956600001"}