{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "timeline-based_planning_system"}, {"score": 0.04614766352910894, "phrase": "direct_access"}, {"score": 0.00475437061368627, "phrase": "effective_use"}, {"score": 0.004724365740062236, "phrase": "artificial_intelligence_planning"}, {"score": 0.00459165923324494, "phrase": "real_world"}, {"score": 0.004519543557571175, "phrase": "great_importance"}, {"score": 0.004337276328199398, "phrase": "end_users"}, {"score": 0.0037849637558311972, "phrase": "resource_constraints"}, {"score": 0.0037136840686010303, "phrase": "resolution_processes"}, {"score": 0.0036092644587974953, "phrase": "non-trivial_evaluation_functions"}, {"score": 0.003419943984098415, "phrase": "original_system_designers"}, {"score": 0.00322003996276874, "phrase": "users'_trust"}, {"score": 0.0031096747349602344, "phrase": "complementary_technology"}, {"score": 0.0030030808225723266, "phrase": "richer_software_environments"}, {"score": 0.002965229277927781, "phrase": "new_generation"}, {"score": 0.0029464822620763687, "phrase": "robust_problem-solving_applications"}, {"score": 0.002845466319548362, "phrase": "knowledge_engineering_environment"}, {"score": 0.002570817338292482, "phrase": "application_domain"}, {"score": 0.002538400273615248, "phrase": "automated_solver"}, {"score": 0.0024826484631019167, "phrase": "timeline-based_planning_ideas"}, {"score": 0.002435834440131485, "phrase": "different_possibilities"}, {"score": 0.0022860557844373943, "phrase": "specialized_planner"}, {"score": 0.0022715929119140194, "phrase": "mrspock._new_functionalities"}, {"score": 0.0022216880365475418, "phrase": "model_validation"}, {"score": 0.0022076314894741394, "phrase": "plan_verification"}, {"score": 0.0021728771392034462, "phrase": "specific_section"}], "paper_keywords": [""], "paper_abstract": "To foster effective use of artificial intelligence planning and scheduling (P&S) systems in the real world, it is of great importance to both (a) broaden direct access to the technology for the end users and (b) significantly increase their trust in such technology. Automated P&S systems often bring solutions to the users that are neither 'obvious' nor immediately acceptable to them. This is because these tools directly reason on causal, temporal, and resource constraints; moreover, they employ resolution processes designed to optimize the solution with respect to non-trivial evaluation functions. Knowledge engineering environments aim at simplifying direct access to the technology for people other than the original system designers, while the integration of validation and verification (V&V) capabilities in such environments may potentially enhance the users' trust in the technology. Somehow, V&V techniques may represent a complementary technology, with respect to P&S, that contributes to developing richer software environments to synthesize a new generation of robust problem-solving applications. The integration of V&V and P&S techniques in a knowledge engineering environment is the topic of this paper. In particular, it analyzes the use of state-of-the-art V&V technology to support knowledge engineering for a timeline-based planning system called MrSPOCK. The paper presents the application domain for which the automated solver has been developed, introduces the timeline-based planning ideas, and then describes the different possibilities to apply V&V to planning. Hence, it continues by describing the step of adding V&V functionalities around the specialized planner, MrSPOCK. New functionalities have been added to perform both model validation and plan verification. Lastly, a specific section describes the benefits as well as the performance of such functionalities.", "paper_title": "Validation and verification issues in a timeline-based planning system", "paper_id": "WOS:000282113800004"}