{"auto_keywords": [{"score": 0.03651343388824078, "phrase": "system_responses"}, {"score": 0.00481495049065317, "phrase": "observed_aquifer_water_level_fluctuations"}, {"score": 0.004367228576339114, "phrase": "phase_response"}, {"score": 0.00419997182602686, "phrase": "casing_storage_effects"}, {"score": 0.004118751115632515, "phrase": "well_screen_entrance_losses"}, {"score": 0.004025968624066142, "phrase": "piezometric_head_differences"}, {"score": 0.003859146369720225, "phrase": "well_casing_radius"}, {"score": 0.003834099867584972, "phrase": "well_screen_radius"}, {"score": 0.003735522846193052, "phrase": "theoretical_response_functions"}, {"score": 0.0036040894858791793, "phrase": "water_level_fluctuations"}, {"score": 0.0031741489723036255, "phrase": "well_casing_storage_effects"}, {"score": 0.003143276831449432, "phrase": "water_level_perturbations"}, {"score": 0.002813633198636833, "phrase": "sigmoidal_curve_fitting_algorithm_and_observed_frequency_and_phase_response_functions"}, {"score": 0.0027323009127771525, "phrase": "t._this"}, {"score": 0.002670667021775741, "phrase": "lm_procedure"}, {"score": 0.0026274936167233515, "phrase": "optimal_system_parameters"}, {"score": 0.0025266963982350523, "phrase": "lm_scheme"}, {"score": 0.0024939618994290016, "phrase": "unique_estimates"}, {"score": 0.0024536380420452676, "phrase": "smaller_aquifer_parameters"}, {"score": 0.0024376912001213362, "phrase": "traditional_specific_capacity_tests"}, {"score": 0.002313783044225099, "phrase": "slug_and_aquifer_test_comparisons"}, {"score": 0.002210529584311044, "phrase": "conventional_aquifer_test_methods"}, {"score": 0.0021049977753042253, "phrase": "observed_data"}], "paper_keywords": ["Aquifer parameter estimation", " Levenberg-Marquardt optimization", " System identification", " MATLAB"], "paper_abstract": "A mathematical model is presented that describes small, periodic, water level perturbations in a fully screened observation well penetrating a homogeneous, isotropic, confined aquifer system. The analytical solution is formulated in terms of frequency and phase response functions that are controlled by aquifer transmissivity (T) and storage coefficient (S). Well casing storage effects are considered; however, well screen entrance losses associated with turbulence are neglected because piezometric head differences inside and outside the well are small. As the ratio of well casing radius to well screen radius (r(c)/r(w)) changes, these theoretical response functions are systematically altered. When r(c)/r(w) < 1, water level fluctuations are increasingly amplified as (r(c)/r(w)) -> 0 and system responses associated with differences in T and S are accentuated. For (r(c)/r(w)) >= 1, however, distinguishing between system responses is more complicated because well casing storage effects gradually dominate water level perturbations as r(c)/r(w) grows. Finally, in practical applications for any r(c)/r(w), value, obtaining unique estimates for T and S can be difficult in the presence of noise without the improved Levenberg-Marquardt (LM) optimization scheme developed here. Initially, a sigmoidal curve fitting algorithm and observed frequency and phase response functions are used to identify a starting estimate for T. This value is then used in the LM procedure and facilitates convergence to optimal system parameters while minimizing uncertainty. Without this approach, however, the LM scheme will not yield unique estimates. This methodology yields smaller aquifer parameters than traditional specific capacity tests, suggesting either a well bore skin effect or a scaling phenomenon similar to that reported in the literature for slug and aquifer test comparisons. Hence, this technique is probably best suited for monitoring wells where conventional aquifer test methods are impractical. This approach is documented in several MATLAB m-files and illustrated by several examples using observed data. (C) 2012 Elsevier Ltd. All rights reserved.", "paper_title": "Spectral analysis of observed aquifer water level fluctuations", "paper_id": "WOS:000307924200031"}