{"auto_keywords": [{"score": 0.0465247817138105, "phrase": "code_base"}, {"score": 0.04561838947368895, "phrase": "existing_tools"}, {"score": 0.00481495049065317, "phrase": "programming_change_task"}, {"score": 0.004645057834614705, "phrase": "specific_kinds"}, {"score": 0.0036678472439508484, "phrase": "software_system"}, {"score": 0.0030957429853133147, "phrase": "change_tasks"}, {"score": 0.0026532596852754525, "phrase": "first_contribution"}, {"score": 0.00250732953434891, "phrase": "software_evolution_tasks"}, {"score": 0.002468938912850425, "phrase": "second_contribution"}, {"score": 0.002393907896783117, "phrase": "observed_behavior"}, {"score": 0.002309242063033298, "phrase": "third_contribution"}, {"score": 0.0022047613106966723, "phrase": "proposed_tools"}, {"score": 0.0021049977753042253, "phrase": "programmers'_questions"}], "paper_keywords": ["change tasks", " software evolution", " empirical study", " development environments", " programming tools", " program comprehension"], "paper_abstract": "Little is known about the specific kinds of questions programmers ask when evolving a code base and how well existing tools support those questions. To better support the activity of programming, answers are needed to three broad research questions: 1) What does a programmer need to know about a code base when evolving a software system? 2) How does a programmer go about finding that information? 3) How well do existing tools support programmers in answering those questions? We undertook two qualitative studies of programmers performing change tasks to provide answers to these questions. In this paper, we report on an analysis of the data from these two user studies. This paper makes three key contributions. The first contribution is a catalog of 44 types of questions programmers ask during software evolution tasks. The second contribution is a description of the observed behavior around answering those questions. The third contribution is a description of how existing deployed and proposed tools do, and do not, support answering programmers' questions.", "paper_title": "Asking and answering questions during a programming change task", "paper_id": "WOS:000257936500002"}