{"auto_keywords": [{"score": 0.045314884531415765, "phrase": "maximum_level"}, {"score": 0.010512667468117895, "phrase": "production-distribution_system"}, {"score": 0.006187957574409848, "phrase": "ml_policy"}, {"score": 0.00481495049065317, "phrase": "maximum_level_policy"}, {"score": 0.004136044939878838, "phrase": "transportation_policy"}, {"score": 0.004007083686875716, "phrase": "total_system_cost"}, {"score": 0.0039691820377914635, "phrase": "overall_cost"}, {"score": 0.003919201391494096, "phrase": "fixed_and_variable_production_costs"}, {"score": 0.0037610536973798113, "phrase": "routing_costs"}, {"score": 0.00369022262431101, "phrase": "replenishment_policies"}, {"score": 0.0029558409515535525, "phrase": "ou_policy"}, {"score": 0.0027566337241307286, "phrase": "polynomial_time"}, {"score": 0.0027046673104220422, "phrase": "worst-case_performance"}, {"score": 0.00267905164093555, "phrase": "oh_policy"}, {"score": 0.002522344964242888, "phrase": "hybrid_heuristic"}, {"score": 0.0024747842618794255, "phrase": "exact_algorithm"}, {"score": 0.002382329940096419, "phrase": "computational_experiments"}, {"score": 0.0023522840272302507, "phrase": "small_size_instances"}, {"score": 0.002300610527451917, "phrase": "high_quality_solutions"}, {"score": 0.0022216880365475418, "phrase": "large_set"}, {"score": 0.0022076314894741394, "phrase": "randomly_generated_problem_instances"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Logistics", " Production", " Transportation", " Inventory", " Computational complexity", " Exact and hybrid heuristic algorithms"], "paper_abstract": "We consider a production-distribution system, where a facility produces one commodity which is distributed to a set of retailers by a fleet of vehicles. Each retailer defines a maximum level of the inventory. The production policy, the retailers replenishment policies and the transportation policy have to be determined so as to minimize the total system cost. The overall cost is composed by fixed and variable production costs at the facility, inventory costs at both facility and retailers and routing costs. We study two different types of replenishment policies. The well-known order-up to level (OU) policy, where the quantity shipped to each retailer is such that the level of its inventory reaches the maximum level, and the maximum level (ML) policy, where the quantity shipped to each retailer is such that the inventory is not greater than the maximum level. We first show that when the transportation is outsourced, the problem with OU policy is NP-hard, whereas there exists a class of instances where the problem with ML policy can be solved in polynomial time. We also show the worst-case performance of the Oh policy with respect to the more flexible ML policy. Then, we focus on the ML policy and the design of a hybrid heuristic. We also present an exact algorithm for the solution of the problem with one vehicle. Results of computational experiments carried out on small size instances show that the heuristic can produce high quality solutions in a very short amount of time. Results obtained on a large set of randomly generated problem instances are also shown, aimed at comparing the two policies. (C) 2011 Elsevier Ltd. All rights reserved.", "paper_title": "Analysis of the maximum level policy in a production-distribution system", "paper_id": "WOS:000290932100008"}