{"auto_keywords": [{"score": 0.03770688949592304, "phrase": "security_methodologies"}, {"score": 0.015719716506582538, "phrase": "engineering_security_methodologies"}, {"score": 0.00474367934322016, "phrase": "secure_software_systems"}, {"score": 0.004673458200854065, "phrase": "ever-growing_importance"}, {"score": 0.004363536354756615, "phrase": "systematic_approach"}, {"score": 0.0041353355816051126, "phrase": "single_security_methodology"}, {"score": 0.004001771394366594, "phrase": "\"fit-to-purpose\"_methodologies"}, {"score": 0.0038956940500396086, "phrase": "project_specifics"}, {"score": 0.00382653658519243, "phrase": "large_body"}, {"score": 0.0037362254649023225, "phrase": "development_methodologies"}, {"score": 0.0032859724984346966, "phrase": "method_engineering_ideas"}, {"score": 0.003246944366436126, "phrase": "latter_gap"}, {"score": 0.003208378286992936, "phrase": "comprehensive_approach"}, {"score": 0.003067778605343437, "phrase": "interrelated_security_process_patterns"}, {"score": 0.0028811996609231626, "phrase": "latter_artefacts"}, {"score": 0.0028554857218530206, "phrase": "step-wise_fashion"}, {"score": 0.002830000621502133, "phrase": "uml-inspired_notation"}, {"score": 0.002779708854857718, "phrase": "pattern-based_methodology_models"}, {"score": 0.0026341187000055396, "phrase": "distributed-system-specific_project_situation"}, {"score": 0.0025718774980145786, "phrase": "novel_pattern-oriented_approach"}, {"score": 0.002379548054048268, "phrase": "academic_setting"}, {"score": 0.002344240943768209, "phrase": "feature_analysis"}, {"score": 0.0021431085940929783, "phrase": "security_methodology_aspects"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Secure software engineering", " Security methodologies", " Method engineering", " Process patterns", " Software security", " Modeling"], "paper_abstract": "Context: Developing secure software systems is an issue of ever-growing importance. Researchers have generally come to acknowledge that to develop such systems successfully, their security features must be incorporated in the context of a systematic approach: a security methodology. There are a number of such methodologies in the literature, but no single security methodology is adequate for every situation, requiring the construction of \"fit-to-purpose\" methodologies or the tailoring of existing methodologies to the project specifics at hand. While a large body of research exists addressing the same requirement for development methodologies - constituting the field of Method Engineering - there is nothing comparable for security methodologies as such; in fact, the topic has never been studied before in such a context. Objective: In this paper we draw inspiration from a number of Method Engineering ideas and fill the latter gap by proposing a comprehensive approach to engineering security methodologies. Method: Our approach is embodied in three interconnected parts: a framework of interrelated security process patterns; a security-specific meta-model; and a meta-methodology to guide engineers in using the latter artefacts in a step-wise fashion. A UML-inspired notation is used for representing all pattern-based methodology models during design and construction. The approach is illustrated and evaluated by tailoring an existing, real-life security methodology to a distributed-system-specific project situation. Results: The paper proposes a novel pattern-oriented approach to modeling, constructing, tailoring and combining security methodologies, which is the very first and currently sole such approach in the literature. We illustrate and evaluate our approach in an academic setting, and perform a feature analysis to highlight benefits and deficiencies. Conclusion: Using our proposal, developers, architects and researchers can analyze and engineer security methodologies in a structured, systematic fashion, taking into account all security methodology aspects. (C) 2014 Elsevier B.V. All rights reserved.", "paper_title": "A comprehensive pattern-oriented approach to engineering security methodologies", "paper_id": "WOS:000345947500014"}