{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "hypercube_packing"}, {"score": 0.010033105965764804, "phrase": "minimum_number"}, {"score": 0.004621279527317074, "phrase": "d-dimensional_cubes"}, {"score": 0.004458189822972851, "phrase": "unit_cubes"}, {"score": 0.003961613484271729, "phrase": "side_length"}, {"score": 0.0038217146888983576, "phrase": "infinite_number"}, {"score": 0.003143849342926373, "phrase": "packing_process"}, {"score": 0.0028807718824400697, "phrase": "online_manner"}, {"score": 0.0027505037762786087, "phrase": "subsequent_items"}, {"score": 0.0026126405272417783, "phrase": "square_packing"}, {"score": 0.0021049977753042253, "phrase": "first_known_results"}], "paper_keywords": ["hypercube packing", " 2-space bounded", " online algorithm", " asymptotic competitive ratio"], "paper_abstract": "We consider the problem of packing d-dimensional cubes into the minimum number of 2-space bounded unit cubes. Given a sequence of items, each of which is a d-dimensional (d >= 3) hypercube with side length not greater than 1 and an infinite number of d-dimensional (d >= 3) hypercube bins with unit length on each side, we want to pack all of the items in the sequence into the minimum number of bins. The constraint is that only two bins are active at anytime during the packing process. Each item should be orthogonally packed without overlapping other items. Items are given in an online manner without the knowledge of or information about the subsequent items. We extend the technique of brick partitioning for square packing and obtain two results: a three-dimensional box and d-dimensional hyperbox partitioning schemes for cube and hypercube packing, respectively. We design 5.43-competitive and 32/21.2(d)-competitive algorithms for cube and hypercube packing, respectively. To the best of our knowledge these are the first known results on 2-space bounded cube and hypercube packing.", "paper_title": "2-Space Bounded Online Cube and Hypercube Packing", "paper_id": "WOS:000364491600004"}