{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "joint_compression"}, {"score": 0.010251598285732588, "phrase": "wavelet_domain"}, {"score": 0.0047113960612140335, "phrase": "human_perception"}, {"score": 0.004610058444728656, "phrase": "today's_multimedia_applications"}, {"score": 0.0045108906244892165, "phrase": "classification_techniques"}, {"score": 0.004318881178805575, "phrase": "audio-visual_information"}, {"score": 0.00420760449108585, "phrase": "perceptually_based_image_compression_methods"}, {"score": 0.0038737214010638745, "phrase": "human_visual_perception"}, {"score": 0.0038401509546247057, "phrase": "hvp"}, {"score": 0.0036288825833675127, "phrase": "succinct_classification"}, {"score": 0.0035662378173267647, "phrase": "visual_content"}, {"score": 0.003535320700255283, "phrase": "efficient_retrieval"}, {"score": 0.00326881479036966, "phrase": "human_visual_system"}, {"score": 0.0030754582519753474, "phrase": "unexplored_potential"}, {"score": 0.002996122158460243, "phrase": "spatial_frequency_perception"}, {"score": 0.0029701328654852246, "phrase": "spatial_frequency_content"}, {"score": 0.0025611773887867255, "phrase": "spatial_frequency"}, {"score": 0.002347378595930709, "phrase": "phase_coherence"}, {"score": 0.0021987994275190314, "phrase": "human_visual_system-based_method"}], "paper_keywords": ["human vision", " joint compression and classification", " perceptual image compression"], "paper_abstract": "Today's multimedia applications demand sophisticated compression and classification techniques in order to store, transmit, and retrieve audio-visual information efficiently. Over the last decade, perceptually based image compression methods have been gaining importance. These methods take into account the abilities (and the limitations) of human visual perception (HVP) when performing compression. The upcoming MPEG 7 standard also addresses the need for succinct classification and indexing of visual content for efficient retrieval. However, there has been no research that has attempted to exploit the characteristics of the human visual system to perform both compression and classification jointly. One area of HVP that has unexplored potential for joint compression and classification is spatial frequency perception. Spatial frequency content that is perceived by humans can be characterized in terms of three parameters, which are: 1) magnitude; 2) phase, and 3) orientation. While the magnitude of spatial frequency content has been exploited in several existing image compression techniques, the novel contribution of this paper is its focus on the use of phase coherence for joint compression and classification in the wavelet domain. Specifically, this paper describes a human visual system-based method for measuring the degree to which an image contains coherent (perceptible) phase information, and then exploits that information to provide joint compression and classification. Simulation results that demonstrate the efficiency of this method are presented.", "paper_title": "Texture characterization for joint compression and classification based on human perception in the wavelet domain", "paper_id": "WOS:000237850600006"}