{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "threat_models"}, {"score": 0.010333095048648665, "phrase": "virtualized_systems"}, {"score": 0.007539333010412122, "phrase": "new_attacks"}, {"score": 0.007108368916367845, "phrase": "protection_strategies"}, {"score": 0.005646042050847822, "phrase": "trust_assumptions"}, {"score": 0.004637478829869904, "phrase": "virtualization_technology"}, {"score": 0.0045879792359519375, "phrase": "cloud_providers"}, {"score": 0.003802135020791801, "phrase": "new_ways"}, {"score": 0.003584025547693836, "phrase": "research_security_solutions"}, {"score": 0.0025822818714499795, "phrase": "related_security"}, {"score": 0.0024339783012484032, "phrase": "complex_threat_models"}, {"score": 0.0023950275815082297, "phrase": "corresponding_sophistication"}, {"score": 0.0021392418081444798, "phrase": "virtualized_system"}, {"score": 0.0021049977753042253, "phrase": "different_layers"}], "paper_keywords": ["Security", " Algorithms", " Measurement", " Virtualization", " threat models", " Cloud computing", " integrity attacks"], "paper_abstract": "Virtualization technology enables Cloud providers to efficiently use their computing services and resources. Even if the benefits in terms of performance, maintenance, and cost are evident, however, virtualization has also been exploited by attackers to devise new ways to compromise a system. To address these problems, research security solutions have evolved considerably over the years to cope with new attacks and threat models. In this work, we review the protection strategies proposed in the literature and show how some of the solutions have been invalidated by new attacks, or threat models, that were previously not considered. The goal is to show the evolution of the threats, and of the related security and trust assumptions, in virtualized systems that have given rise to complex threat models and the corresponding sophistication of protection strategies to deal with such attacks. We also categorize threat models, security and trust assumptions, and attacks against a virtualized system at the different layers-in particular, hardware, virtualization, OS, and application.", "paper_title": "Evolution of Attacks, Threat Models, and Solutions for Virtualized Systems", "paper_id": "WOS:000373852800014"}