{"auto_keywords": [{"score": 0.03876456772434691, "phrase": "weighting_schemes"}, {"score": 0.008563313829106934, "phrase": "visual_words"}, {"score": 0.00481495049065317, "phrase": "image_retrieval"}, {"score": 0.0044896599221451216, "phrase": "new_possibilities"}, {"score": 0.0044118153390803405, "phrase": "new_research_issues"}, {"score": 0.003852371777780562, "phrase": "classical_problem"}, {"score": 0.003818807671883534, "phrase": "textual_information_retrieval"}, {"score": 0.003423042581201533, "phrase": "visual_word-based_retrieval"}, {"score": 0.002749980017065414, "phrase": "optimal_setting"}, {"score": 0.0026206146061151917, "phrase": "visual_content"}, {"score": 0.002530359917257626, "phrase": "raw_frequency"}, {"score": 0.002443206010337041, "phrase": "complex_datasets"}, {"score": 0.002218668420806254, "phrase": "minkowski_distances"}, {"score": 0.0021993066642488237, "phrase": "similar_effect"}, {"score": 0.002123531043641047, "phrase": "consistent_way"}], "paper_keywords": ["Image retrieval", " visual words", " weighting schemes", " divergence from randomness", " vector space model", " Minkowski distances", " fractional distances"], "paper_abstract": "Bags of visual words are the most studied image description technique in the last years. This representation of images raised new possibilities as well as new research issues. In particular, it is important to automatically determine which visual words are the most relevant to describe the images, and which ones should be ignored. This issue is a classical problem of textual information retrieval, usually addressed by the use of weighting schemes. In this paper, the most common weighting schemes from text retrieval are applied to the case of visual word-based retrieval. New weighting schemes are also proposed, and several Minkowski-like distances are tested. The experiments are performed on four different datasets that correspond to two different retrieval tasks; it allows us to bring to light some properties of visual words and weighting schemes. This study results in several findings. It first shows that the optimal setting for distances and weighting schemes depends on the nature of the visual content of the images considered. Especially, raw frequency can be the most effective weight when dealing with complex datasets; it questions the habit to systematically use the tf . idf weighting scheme. It also shows that weighting schemes and Minkowski distances have similar effect and should be used together in a consistent way. Based on these findings, general guidelines for the choice of distances and weighting schemes are proposed.", "paper_title": "From Text to Images: Weighting Schemes for Image Retrieval", "paper_id": "WOS:000358594400001"}