{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "drug_treatment"}, {"score": 0.030458660700665125, "phrase": "latent_factors"}, {"score": 0.004771694823916337, "phrase": "motivation"}, {"score": 0.0044495843279816075, "phrase": "individual_proteins"}, {"score": 0.00432733352307636, "phrase": "complex_interactions"}, {"score": 0.004247696749118451, "phrase": "genome-wide_expression"}, {"score": 0.004073809704022463, "phrase": "powerful_approach"}, {"score": 0.00399881984083004, "phrase": "global_snapshot"}, {"score": 0.003961842092184655, "phrase": "cellular_response"}, {"score": 0.00379961236486522, "phrase": "drugs'_mechanism"}, {"score": 0.003644001325962353, "phrase": "great_interest"}, {"score": 0.003543804852018315, "phrase": "transcriptomic_profiling_data"}, {"score": 0.003414467360488913, "phrase": "different_drugs"}, {"score": 0.0031412606495731716, "phrase": "bayesian"}, {"score": 0.0029699874949715367, "phrase": "drug_treatments"}, {"score": 0.00290173234777844, "phrase": "biological_pathways"}, {"score": 0.0027698788736535865, "phrase": "drug-induced_gene_expression_alternations"}, {"score": 0.0025832180231667853, "phrase": "connectivity_map_data"}, {"score": 0.0021848422732893926, "phrase": "drug-induced_transcriptional_alternation_data"}], "paper_keywords": [""], "paper_abstract": "Motivation: It is well recognized that the effects of drugs are far beyond targeting individual proteins, but rather influencing the complex interactions among many relevant biological pathways. Genome-wide expression profiling before and after drug treatment has become a powerful approach for capturing a global snapshot of cellular response to drugs, as well as to understand drugs' mechanism of action. Therefore, it is of great interest to analyze this type of transcriptomic profiling data for the identification of pathways responsive to different drugs. However, few computational tools exist for this task. Results: We have developed FacPad, a Bayesian sparse factor model, for the inference of pathways responsive to drug treatments. This model represents biological pathways as latent factors and aims to describe the variation among drug-induced gene expression alternations in terms of a much smaller number of latent factors. We applied this model to the Connectivity Map data set (build 02) and demonstrated that FacPad is able to identify many drug-pathway associations, some of which have been validated in the literature. Although this method was originally designed for the analysis of drug-induced transcriptional alternation data, it can be naturally applied to many other settings beyond polypharmacology.", "paper_title": "FacPad: Bayesian sparse factor modeling for the inference of pathways responsive to drug treatment", "paper_id": "WOS:000309881200014"}