{"auto_keywords": [{"score": 0.03875745258668109, "phrase": "essential_proteins"}, {"score": 0.01556095441719376, "phrase": "protein_complexes"}, {"score": 0.012827688574296564, "phrase": "overlapping_complexes"}, {"score": 0.00481495049065317, "phrase": "essential_modules"}, {"score": 0.004692980391580608, "phrase": "basic_units"}, {"score": 0.004645057834614705, "phrase": "macro-molecular_organizations"}, {"score": 0.004481132747216135, "phrase": "cell's_mechanism"}, {"score": 0.0043452175611323335, "phrase": "yeast_two-hybrid"}, {"score": 0.0038810583785936505, "phrase": "computational_methods"}, {"score": 0.003413284742632989, "phrase": "life's_activities"}, {"score": 0.0031116963435584982, "phrase": "predicted_overlaps"}, {"score": 0.0030017207229983385, "phrase": "evaluation_criterion"}, {"score": 0.0027505037762786087, "phrase": "identified_overlaps"}, {"score": 0.002708399936381754, "phrase": "benchmark_overlap_modules"}, {"score": 0.0026261108615242557, "phrase": "gene_ontology"}, {"score": 0.002393907896783117, "phrase": "comprehensive_comparison"}, {"score": 0.0023694065215394593, "phrase": "serveral_overlapping_complexes"}, {"score": 0.0021049977753042253, "phrase": "experimental_results"}], "paper_keywords": ["Protein-protein interaction network", " Essential protein modules", " Overlap", " Overlap maximum matching ratio"], "paper_abstract": "Protein complexes are the basic units of macro-molecular organizations and help us to understand the cell's mechanism. The development of the yeast two-hybrid, tandem affinity purification, and mass spectrometry high-throughput proteomic techniques supplies a large amount of protein-protein interaction data, which make it possible to predict overlapping complexes through computational methods. Research shows that overlapping complexes can contribute to identifying essential proteins, which are necessary for the organism to survive and reproduce, and for life's activities. Scholars pay more attention to the evaluation of protein complexes. However, few of them focus on predicted overlaps. In this paper, an evaluation criterion called overlap maximum matching ratio (OMMR) is proposed to analyze the similarity between the identified overlaps and the benchmark overlap modules. Comparison of essential proteins and gene ontology (GO) analysis are also used to assess the quality of overlaps. We perform a comprehensive comparison of serveral overlapping complexes prediction approaches, using three yeast protein-protein interaction (PPI) networks. We focus on the analysis of overlaps identified by these algorithms. Experimental results indicate the important of overlaps and reveal the relationship between overlaps and identification of essential proteins.", "paper_title": "Overlap maximum matching ratio (OMMR): a new measure to evaluate overlaps of essential modules", "paper_id": "WOS:000352821000004"}