{"auto_keywords": [{"score": 0.035479698847890914, "phrase": "common_topic"}, {"score": 0.00481495049065317, "phrase": "minimum_topic"}, {"score": 0.0047920120174595555, "phrase": "connected_overlay"}, {"score": 0.004568525347438891, "phrase": "scalable_overlay_network"}, {"score": 0.004439445472040688, "phrase": "minimum_topic-connected_overlay_problem"}, {"score": 0.00401560412621627, "phrase": "n_users"}, {"score": 0.003580355398511932, "phrase": "minimum_number"}, {"score": 0.003072285184441679, "phrase": "polynomial_time"}, {"score": 0.002316532084420729, "phrase": "latter_case"}, {"score": 0.0022617389804167943, "phrase": "first_constant_approximation_algorithm"}, {"score": 0.0021976915360493628, "phrase": "polynomial-time_algorithms"}, {"score": 0.0021560018573288666, "phrase": "min-tco."}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Topic-connected overlay", " Approximation algorithm", " APX", " Hardness"], "paper_abstract": "In the context of designing a scalable overlay network to support decentralized topic-based pub/sub communication, the Minimum Topic-Connected Overlay problem (Min-TCO in short) has been investigated: given a set oft topics and a collection of n users together with the lists of topics they are interested in, the aim is to connect these users to a network by a minimum number of edges such that every graph induced by users interested in a common topic is connected. It is known that min-TCO is NP-hard and approximable within O(log t) in polynomial time. In this paper, we further investigate the problem and some of its special instances. We give various hardness results for instances where the number of topics in which a user is interested in is bounded by a constant, and also for the instances where the number of users interested in a common topic is a constant. For the latter case, we present a first constant approximation algorithm. We also present some polynomial-time algorithms for very restricted instances of Min-TCO. (C) 2011 Elsevier B.V. All rights reserved.", "paper_title": "On the approximability and hardness of minimum topic connected overlay and its special instances", "paper_id": "WOS:000302822300015"}