{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "spatial_interaction_data"}, {"score": 0.035984182640015974, "phrase": "flow_mapping"}, {"score": 0.004777917315737992, "phrase": "spatial_interaction_information"}, {"score": 0.004544016163767266, "phrase": "modern_gis_applications"}, {"score": 0.004141742095830515, "phrase": "spatial_characteristics"}, {"score": 0.0039085400187964196, "phrase": "select_number"}, {"score": 0.003745881316228299, "phrase": "subject_matter"}, {"score": 0.003674192201248236, "phrase": "full_potential"}, {"score": 0.003374655868348244, "phrase": "contemporary_gis"}, {"score": 0.0032592499906265882, "phrase": "decision_support"}, {"score": 0.0031968441980848436, "phrase": "different_spatial_scales"}, {"score": 0.0030283730114326014, "phrase": "large_migration_matrix"}, {"score": 0.00282470997972535, "phrase": "geographical_patterns"}, {"score": 0.002802941205762953, "phrase": "residential_mobility"}, {"score": 0.0027386335451725762, "phrase": "possible_dissemination_methods"}, {"score": 0.0027175263159330523, "phrase": "new_developments"}, {"score": 0.0026965813247045427, "phrase": "web-based_geospatial_technologies"}, {"score": 0.0026551731045904854, "phrase": "general_principles"}, {"score": 0.002624533657819515, "phrase": "future_challenges"}, {"score": 0.0024479627964740748, "phrase": "common_gis_software"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Spatial interaction data", " Flow mapping", " Geovisualisation", " GIS", " Migration"], "paper_abstract": "In modern GIS applications, flow mapping and geodynamics are not particularly well represented. This is somewhat Surprising given the potential of such approaches to shed light on the spatial characteristics associated with the movement of people and goods. Despite the attention of a select number of researchers whose contributions have been significant, however, the subject matter remains underdeveloped and the full potential of spatial interaction data remains largely unrealised. Therefore, this paper represents an attempt to popularise the use of flow mapping within a contemporary GIS, with a view to aiding and enhancing decision support at a range of different spatial scales. It discusses advances in flow mapping, proposes an approach to mapping a large migration matrix from the United Kingdom's 2001 census, and considers the ways in which this can add value to the understanding of geographical patterns of residential mobility. Subsequently, it considers possible dissemination methods via new developments in web-based geospatial technologies before offering some general principles and identifying future challenges. The findings indicate that it is now entirely feasible to map large spatial interaction datasets with common GIS software, that this has the benefit of producing instant, query-led information, and that the knowledge derived from this could be used to inform all kinds of local, regional and national policy formulation and evaluation. (C) 2009 Elsevier Ltd. All rights reserved.", "paper_title": "From spatial interaction data to spatial interaction information? Geovisualisation and spatial structures of migration from the 2001 UK census", "paper_id": "WOS:000266189400001"}