{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "analytical_support"}, {"score": 0.004622783000449884, "phrase": "e-negotiations_-_a"}, {"score": 0.003973523379376352, "phrase": "entire_set"}, {"score": 0.00357806560856829, "phrase": "compact_representation"}, {"score": 0.0035366216368204182, "phrase": "important_behavioral_characteristics"}, {"score": 0.0034753508746887957, "phrase": "negotiation_process"}, {"score": 0.003415137969569376, "phrase": "consistency_measures"}, {"score": 0.0032031180198375283, "phrase": "experimental_study"}, {"score": 0.0030572112793962004, "phrase": "negotiation_processes"}, {"score": 0.0021672995161145276, "phrase": "negotiation_experiments"}, {"score": 0.0021049977753042253, "phrase": "negotiation_support_systems"}], "paper_keywords": ["Negotiation", " utility", " consistency", " preference determination", " analytical support"], "paper_abstract": "This paper explores whether the decisions made by a negotiator during negotiations are consistent with her preferences. By considering the entire set of offers exchanged during a negotiation, the measures of consistency developed in this paper provide a compact representation of important behavioral characteristics throughout the negotiation process. The consistency measures developed in this paper are validated with data from an experimental study in which the impact of two factors on negotiation processes is studied: the availability of analytical support and imposed vs. elicited preferences. We find that negotiators behave more consistently when preferences are assigned to them by the experimenters than when their preferences are elicited. On the other hand, an impact of analytical support is only found when preferences are elicited. These results shed light on both the design of negotiation experiments and the development of negotiation support systems.", "paper_title": "THE IMPACT OF ANALYTICAL SUPPORT AND PREFERENCE DETERMINATION ON CONSISTENCY IN E-NEGOTIATIONS - A NEW METHOD AND PRELIMINARY RESULTS", "paper_id": "WOS:000283740300001"}