{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "annulled_vote"}, {"score": 0.035063062788852184, "phrase": "active_votes"}, {"score": 0.0044747919503484055, "phrase": "two-party_system"}, {"score": 0.004192571571622019, "phrase": "number_core_votes"}, {"score": 0.004058180509184539, "phrase": "annulled_votes"}, {"score": 0.003635503288514593, "phrase": "opinion_network"}, {"score": 0.003605997900398767, "phrase": "uniformly_distributed_nodes"}, {"score": 0.0031910037920846817, "phrase": "specific_feature"}, {"score": 0.0028006988338192375, "phrase": "undecided_voters"}, {"score": 0.0024882810071079797, "phrase": "real_life"}, {"score": 0.0024182330686905256, "phrase": "voters'_immediate_surroundings"}, {"score": 0.002379092507901856, "phrase": "model_dynamics"}, {"score": 0.0021659920594094407, "phrase": "active_voters"}, {"score": 0.0021049977753042253, "phrase": "valid_vote"}], "paper_keywords": ["Opinion networks", " majority rule", " adaptive behavior", " core vote", " valid vote", " inactive vote", " annulled vote", " computational model", " simulation"], "paper_abstract": "Using an agent-model, we conducted an analysis of a two-party system, in order to identify a pattern of behavior in the influence exercised by the number core votes on the proportion of the number of annulled votes, which are cast during an election. In a 2d toroidal grid network, where each node is connected with its four closest neighbors, we introduce the concept of an opinion network with uniformly distributed nodes that can have one of three different states, also known as spin: +1, -1 and 0. Initially, the states +1 and -1 correspond respectively to active votes for candidate A and candidate B, with the specific feature that these are not able to change their state core vote (i.e., that do not change their political preferences). The rest is established as having a state of 0, known as undecided voters, who will try to become active votes in favor of one of the two contending candidates, during the process of interaction with their four closest neighbors (because of their influence, in real life these would be interpreted as the voters' immediate surroundings). The model dynamics tend to a state of equilibrium, in which there are no more voters changing their opinion upon interaction with his four closest neighbors. Finally, active voters who decide become part of the valid vote, while the undecided become part of the annulled vote.", "paper_title": "The core vote effect on the annulled vote: an agent-based model", "paper_id": "WOS:000358262100003"}