{"auto_keywords": [{"score": 0.02927436378146636, "phrase": "threat_vectors"}, {"score": 0.012586519146898782, "phrase": "insider_threats"}, {"score": 0.012087089395834591, "phrase": "data_loss"}, {"score": 0.010757729785824824, "phrase": "healthcare_enterprise_environment"}, {"score": 0.00481495049065317, "phrase": "activity_incident_monitoring"}, {"score": 0.004646088032529303, "phrase": "healthcare_enterprise_environments."}, {"score": 0.004598933498016774, "phrase": "healthcare_data"}, {"score": 0.0044150318724093226, "phrase": "big_concerns"}, {"score": 0.003946195919158241, "phrase": "data_breach"}, {"score": 0.0037307208089736835, "phrase": "major_threat"}, {"score": 0.0033173234105492895, "phrase": "data_loss_prevention_challenges"}, {"score": 0.0032008144731234265, "phrase": "novel_approach"}, {"score": 0.003120099687922751, "phrase": "internal_threat"}, {"score": 0.002731971103291716, "phrase": "potential_data_loss_paths"}, {"score": 0.002556359086441866, "phrase": "data_loss_statistics_data"}, {"score": 0.002392008392892289, "phrase": "data_loss_prevention"}, {"score": 0.00235560370536971, "phrase": "activity_incident_identification"}, {"score": 0.0021595094738887767, "phrase": "evidence_trees"}], "paper_keywords": [""], "paper_abstract": "As healthcare data are pushed online, consumers have raised big concerns on the breach of their personal information. Law and regulations have placed businesses and organizations under obligations to take actions to prevent data breach. Among various threats, insider threats have been identified as a major threat on data loss. Thus, effective mechanisms to control insider threats on data loss are urgently needed. The objective of this research is to address data loss prevention challenges in healthcare enterprise environment. First, a novel approach is provided to model internal threat, specifically inside activities. With inside activities modeling, data loss paths and threat vectors are formally described and identified. Then, threat vectors and potential data loss paths have been investigated in a healthcare enterprise environment. Threat vectors have been enumerated and data loss statistics data for some threat vectors have been collected. After that, issues on data loss prevention and inside activity incident identification, tracking, and reconstruction are discussed. Finally, evidences of inside activities are modeled as evidence trees to provide guidance for inside activity identification, tracking, and reconstruction.", "paper_title": "DATA LOSS PREVENTION AND CONTROL: INSIDE ACTIVITY INCIDENT MONITORING, IDENTIFICATION, AND TRACKING IN HEALTHCARE ENTERPRISE ENVIRONMENTS", "paper_id": "WOS:000359973600003"}