{"auto_keywords": [{"score": 0.04726196056959379, "phrase": "time_integration_scheme"}, {"score": 0.03696700047294347, "phrase": "numerical_simulation"}, {"score": 0.00481495049065317, "phrase": "deformable_bodies"}, {"score": 0.00471193241675062, "phrase": "novel_technique"}, {"score": 0.004492950096237056, "phrase": "one's_choice"}, {"score": 0.004396790930873782, "phrase": "time_integration_methods"}, {"score": 0.0043213410601860985, "phrase": "energy_conservation"}, {"score": 0.003962998498942111, "phrase": "time_step"}, {"score": 0.0035873530542209686, "phrase": "overall_aesthetics"}, {"score": 0.0033909518548844047, "phrase": "high_frequency_oscillations"}, {"score": 0.00327545462323687, "phrase": "discretization_mesh"}, {"score": 0.003205268682789165, "phrase": "alternative_technique"}, {"score": 0.00308269056870936, "phrase": "material_parameter"}, {"score": 0.003029722317983915, "phrase": "desired_look"}, {"score": 0.0028267701593809877, "phrase": "stark_contrast"}, {"score": 0.002802373595203129, "phrase": "previous_methods"}, {"score": 0.002266076681675742, "phrase": "fig"}], "paper_keywords": ["Computer graphics", " physically based modeling"], "paper_abstract": "We propose a novel technique that allows one to conserve energy using the time integration scheme of one's choice. Traditionally, the time integration methods that deal with energy conservation, such as symplectic, geometric, and variational integrators, have aimed to include damping in a manner independent of the size of the time step, stating that this gives more control over the look and feel of the simulation. Generally speaking, damping adds to the overall aesthetics and appeal of a numerical simulation, especially since it damps out the high frequency oscillations that occur on the level of the discretization mesh. We propose an alternative technique that allows one to use damping as a material parameter to obtain the desired look and feel of a numerical simulation, while still exactly conserving the total energy-in stark contrast to previous methods in which adding damping effects necessarily removes energy from the mesh. This allows, for example, a deformable bouncing ball with aesthetically pleasing damping (and even undergoing collision) to collide with the ground and return to its original height exactly conserving energy, as shown in Fig. 2. Furthermore, since our method works with any time integration scheme, the user can choose their favorite time integration method with regards to aesthetics and simply apply our method as a postprocess to conserve all or as much of the energy as desired.", "paper_title": "Energy Conservation for the Simulation of Deformable Bodies", "paper_id": "WOS:000312482200003"}