{"auto_keywords": [{"score": 0.004621447740470602, "phrase": "approximate_consensus"}, {"score": 0.004567596860086148, "phrase": "mobile_ad-hoc_networks"}, {"score": 0.0044356867986444426, "phrase": "byzantine_nodes"}, {"score": 0.004332894955218135, "phrase": "nodes'_mobility"}, {"score": 0.003991449490087454, "phrase": "linear_iteration_method"}, {"score": 0.003633927813203731, "phrase": "progressively_enough_values"}, {"score": 0.0035496495489801667, "phrase": "sufficient_and_necessary_condition"}, {"score": 0.003487721546598799, "phrase": "final_convergence"}, {"score": 0.0030653094605910727, "phrase": "maximum_value"}, {"score": 0.0027417911324611917, "phrase": "nodes'_motion"}, {"score": 0.0025854347094662247, "phrase": "new_concepts"}, {"score": 0.0023953929817357882, "phrase": "particular_mobility_scenarios"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Approximate consensus", " Mobility", " Ad-hoc network"], "paper_abstract": "We consider the problem of approximate consensus in mobile ad-hoc networks in the presence of Byzantine nodes. Due to nodes' mobility, the topology is dynamic. We propose a protocol based on the linear iteration method. The nodes collect information during several consecutive rounds: moving gives them the opportunity to gather progressively enough values. A novel sufficient and necessary condition guarantees the final convergence: from time to time only the correct nodes that own a value equal to (or very close to) either the minimum or the maximum value have to receive enough messages (quantity constraint) with either higher or lower values (quality constraint). Of course, nodes' motion should not prevent this requirement to be fulfilled. New concepts are introduced to prove the correctness of the protocol. Based on particular mobility scenarios, simulations are conducted to analyze the impact of some parameters on three variants of the protocol. (C) 2014 Elsevier Inc. All rights reserved.", "paper_title": "Approximate Byzantine consensus in sparse, mobile ad-hoc networks", "paper_id": "WOS:000339643200007"}