{"auto_keywords": [{"score": 0.039810195539407074, "phrase": "chen"}, {"score": 0.015209570735957866, "phrase": "index_c-pmk"}, {"score": 0.011821670943987962, "phrase": "process_capability_index_c-pmk"}, {"score": 0.00481495049065317, "phrase": "process_capability_index"}, {"score": 0.004771435352180973, "phrase": "fuzzy_data"}, {"score": 0.004615202066192795, "phrase": "well-known_loss-based_process_capability_index"}, {"score": 0.004076444306787255, "phrase": "fuzzy_logic"}, {"score": 0.003907212558276185, "phrase": "different_fuzzy_process_capability_indices"}, {"score": 0.003813678670885406, "phrase": "tsai"}, {"score": 0.0037111645676025187, "phrase": "lin"}, {"score": 0.003503497128638099, "phrase": "membership_function"}, {"score": 0.0033989238477802864, "phrase": "fuzzy_observation"}, {"score": 0.003327579120205541, "phrase": "fuzzy_process_capability_c-pmk_calculator"}, {"score": 0.002509976179108431, "phrase": "fuzzy_process_capability_index"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Process capability indices", " Index C-pmk", " Fuzzy data", " Fuzzy process capability indices"], "paper_abstract": "The index C-pmk is a well-known loss-based process capability index. It can reveal more information about the location of the process mean compared with other classic process capability indices. This index is also more sensitive than other capability indices to any deviations from process mean. When there are some uncertainties in observations, fuzzy logic can be employed to manage these uncertainties. There is some research on different fuzzy process capability indices and this paper is an extension of Tsai and Chen (2006), Chen, Lin, and Chen (2003) for the process capability index C-pmk of fuzzy numbers. In order to find the membership function of process capability index C-pmk, the alpha-cuts of the fuzzy observation were employed. An example of fuzzy process capability C-pmk calculator was illustrated and compared with other classic fuzzy process capability indices (C) over tilde (p),(C) over tilde (pl), (C) over tilde (pu), (C) over tilde (pk) and (C) over tilde (pm). Results showed that fuzzy (C) over tilde (pmk) has the advantages of both (C) over tilde (pk) and (C) over tilde (pm). Since the index C-pmk is a more sensitive index compared with other classic indices, the fuzzy process capability index (C) over tilde (pmk) can be a more sensitive fuzzy index compared with (C) over tilde (p),(C) over tilde (pl), (C) over tilde (pu), (C) over tilde (pk) and (C) over tilde (pm) (c) 2010 Elsevier Ltd. All rights reserved.", "paper_title": "Measuring process capability index C-pmk with fuzzy data and compare it with other fuzzy process capability indices", "paper_id": "WOS:000288343900008"}