{"auto_keywords": [{"score": 0.04972395969484311, "phrase": "noun_compounds"}, {"score": 0.02231216869943987, "phrase": "semantic_space_model"}, {"score": 0.020436149039327098, "phrase": "attributional_similarity"}, {"score": 0.009117713320460455, "phrase": "unfamiliar_noun_compounds"}, {"score": 0.00481495049065317, "phrase": "computational_semantics"}, {"score": 0.0044695432851061525, "phrase": "information_gathering"}, {"score": 0.004419904580451831, "phrase": "heart_disease"}, {"score": 0.004179824713643488, "phrase": "semantic_relatedness"}, {"score": 0.0039380388343479384, "phrase": "noun_compound"}, {"score": 0.0037940502405699765, "phrase": "vector_composition_algorithms"}, {"score": 0.0037658881407605445, "phrase": "six_composition_algorithms"}, {"score": 0.0033426823598920307, "phrase": "english"}, {"score": 0.0033177813460815346, "phrase": "japanese_noun_compounds"}, {"score": 0.002911961514073769, "phrase": "semantic_spaces"}, {"score": 0.0026330549554033876, "phrase": "dilation_algorithm"}, {"score": 0.002499094513009327, "phrase": "multiplication_algorithm"}, {"score": 0.0024346858809238766, "phrase": "positive_pointwise_mutual_information-based_space"}, {"score": 0.0023807981747706376, "phrase": "comparison_algorithm"}, {"score": 0.0021207658298095845, "phrase": "comparison_algorithms"}, {"score": 0.0021049977753042253, "phrase": "sufficient_ability"}], "paper_keywords": [""], "paper_abstract": "This study examines the ability of a semantic space model to represent the meaning of noun compounds such as information gathering' or heart disease.' For a semantic space model to compute the meaning and the attributional similarity (or semantic relatedness) for unfamiliar noun compounds that do not occur in a corpus, the vector for a noun compound must be computed from the vectors of its constituent words using vector composition algorithms. Six composition algorithms (i.e., centroid, multiplication, circular convolution, predication, comparison, and dilation) are compared in terms of the quality of the computation of the attributional similarity for English and Japanese noun compounds. To evaluate the performance of the computation of the similarity, this study uses three tasks (i.e., related word ranking, similarity correlation, and semantic classification), and two types of semantic spaces (i.e., latent semantic analysis-based and positive pointwise mutual information-based spaces). The result of these tasks is that the dilation algorithm is generally most effective in computing the similarity of noun compounds, while the multiplication algorithm is best suited specifically for the positive pointwise mutual information-based space. In addition, the comparison algorithm works better for unfamiliar noun compounds that do not occur in the corpus. These findings indicate that in general a semantic space model, and in particular the dilation, multiplication, and comparison algorithms have sufficient ability to compute the attributional similarity for noun compounds.", "paper_title": "A semantic space approach to the computational semantics of noun compounds", "paper_id": "WOS:000332449200002"}