{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "critical_user_interface_design_features"}, {"score": 0.049483572884790016, "phrase": "computer-assisted_instruction_programs"}, {"score": 0.04773866258910522, "phrase": "learning_disabilities"}, {"score": 0.0103706664870907, "phrase": "usability_testing"}, {"score": 0.00422177384286051, "phrase": "corresponding_implementation_guidelines"}, {"score": 0.003965468669507077, "phrase": "identified_features"}, {"score": 0.0036782824183282823, "phrase": "'math_explorer"}, {"score": 0.0035204268675160257, "phrase": "subtraction_word_problem-solving_instruction"}, {"score": 0.0033482708495261864, "phrase": "early_elementary_level"}, {"score": 0.003047776993499616, "phrase": "math_explorer"}, {"score": 0.0023566987138026285, "phrase": "mathematical_learning"}, {"score": 0.0022133711375320244, "phrase": "future_research"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["User interface design features", " Computer-assisted instruction", " Students with learning disabilities", " Mathematics"], "paper_abstract": "Critical user interface design features of computer-assisted instruction programs in mathematics for students with learning disabilities and corresponding implementation guidelines were identified in this study. Based on the identified features and guidelines, a multimedia computer-assisted instruction program. 'Math Explorer', which delivers addition and subtraction word problem-solving instruction for students with learning disabilities at the early elementary level, was designed and developed. Lastly, usability testing was conducted to assess whether Math Explorer was well-designed in terms of the interface for students with learning disabilities. Given the results of the usability testing, this study corroborated the fact that the critical user interface design features and guidelines in mathematics computer-assisted instruction programs would be essential for facilitating the mathematical learning of students with learning disabilities. Implications for practice and future research were discussed. (C) 2010 Elsevier Ltd. All rights reserved.", "paper_title": "The identification, implementation, and evaluation of critical user interface design features of computer-assisted instruction programs in mathematics for students with learning disabilities", "paper_id": "WOS:000277110400037"}