{"auto_keywords": [{"score": 0.049378038061471535, "phrase": "web_items"}, {"score": 0.015719716506582538, "phrase": "temporal_patterns"}, {"score": 0.005650673657957859, "phrase": "web_search_keywords"}, {"score": 0.004709567162738894, "phrase": "huge_amounts"}, {"score": 0.0040334640350288, "phrase": "important_problem"}, {"score": 0.003774164192882704, "phrase": "web_search_enterprises"}, {"score": 0.0037463983616303786, "phrase": "future_popular_keywords"}, {"score": 0.0036508108698357932, "phrase": "price_decisions"}, {"score": 0.003623949225126944, "phrase": "marketing_search_keywords"}, {"score": 0.003390886284555397, "phrase": "previous_techniques"}, {"score": 0.0032800186243040663, "phrase": "efficient_method"}, {"score": 0.003035177667751495, "phrase": "novel_measure"}, {"score": 0.0028293966058473476, "phrase": "computational_overhead"}, {"score": 0.0025230952890994236, "phrase": "similar_popularity_trends"}, {"score": 0.0024586427394152196, "phrase": "traditional_clustering_approaches"}, {"score": 0.0023260075698364087, "phrase": "gap_measure"}, {"score": 0.0022834017104377525, "phrase": "popularity_trends"}, {"score": 0.002233301265743633, "phrase": "google_trends_web_site"}, {"score": 0.0021682027434117095, "phrase": "proposed_approach"}, {"score": 0.0021522261505574035, "phrase": "real-world_applications"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Web items", " Popularity trends", " Temporal patterns", " Gap measure", " Density-based clustering"], "paper_abstract": "Huge amounts of various web items (e.g., images, keywords, and web pages) are being made available on the Web. The popularity of such web items continuously changes over time, and mining for temporal patterns in the popularity of web items is an important problem that is useful for several Web applications; for example, the temporal patterns in the popularity of web search keywords help web search enterprises predict future popular keywords, thus enabling them to make price decisions when marketing search keywords to advertisers. However, the presence of millions of web items makes it difficult to scale up previous techniques for this problem. This paper proposes an efficient method for mining temporal patterns in the popularity of web items. We treat the popularity of web items as time-series and propose a novel measure, a gap measure, to quantify the dissimilarity between the popularity of two web items. To reduce the computational overhead for this measure, an efficient method using the Discrete Fourier Transform (OFF) is presented. We assume that the popularity of web items is not necessarily periodic. For finding clusters of web items with similar popularity trends, we show the limitations of traditional clustering approaches and propose a scalable, efficient, density-based clustering algorithm using the gap measure. Our experiments using the popularity trends of web search keywords obtained from the Google Trends web site illustrate the scalability and usefulness of the proposed approach in real-world applications. (C) 2011 Elsevier Inc. All rights reserved.", "paper_title": "Mining temporal patterns in popularity of web items", "paper_id": "WOS:000295500300007"}