{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "monte_carlo_search"}, {"score": 0.008743211712209618, "phrase": "training_problems"}, {"score": 0.0047152877145889656, "phrase": "single-player_games"}, {"score": 0.004202741104973709, "phrase": "single_unified_mcs_algorithm"}, {"score": 0.003988487841970088, "phrase": "major_interest"}, {"score": 0.003947019530527114, "phrase": "ai"}, {"score": 0.0034267429854665035, "phrase": "problem-driven_way"}, {"score": 0.0033381913087533457, "phrase": "mcs_algorithm_discovery_scheme"}, {"score": 0.003234934827553253, "phrase": "automatic_and_reproducible_way"}, {"score": 0.003085989256759819, "phrase": "mcs_algorithms"}, {"score": 0.0030062165552187086, "phrase": "rich_space"}, {"score": 0.002974886152979993, "phrase": "candidate_algorithms"}, {"score": 0.0025960262223338293, "phrase": "multiarmed_bandits"}, {"score": 0.0025288869172313674, "phrase": "optimization_problem"}, {"score": 0.0021049977753042253, "phrase": "discovered_algorithms"}], "paper_keywords": ["Algorithm selection", " grammar of algorithms", " Monte Carlo search (MCS)"], "paper_abstract": "Much current research in AI and games is being devoted to Monte Carlo search (MCS) algorithms. While the quest for a single unified MCS algorithm that would perform well on all problems is of major interest for AI, practitioners often know in advance the problem they want to solve, and spend plenty of time exploiting this knowledge to customize their MCS algorithm in a problem-driven way. We propose an MCS algorithm discovery scheme to perform this in an automatic and reproducible way. First, we introduce a grammar over MCS algorithms that enables inducing a rich space of candidate algorithms. Afterwards, we search in this space for the algorithm that performs best on average for a given distribution of training problems. We rely on multiarmed bandits to approximately solve this optimization problem. The experiments, generated on three different domains, show that our approach enables discovering algorithms that outperform several well-known MCS algorithms such as upper confidence bounds applied to trees and nested Monte Carlo search. We also show that the discovered algorithms are generally quite robust with respect to changes in the distribution over the training problems.", "paper_title": "Monte Carlo Search Algorithm Discovery for Single-Player Games", "paper_id": "WOS:000324586300001"}