{"auto_keywords": [{"score": 0.050072695418663875, "phrase": "recommendation_system"}, {"score": 0.04958720442967606, "phrase": "china"}, {"score": 0.04909472437042533, "phrase": "co-word_analysis"}, {"score": 0.0045726187330434025, "phrase": "research_patterns"}, {"score": 0.003936389070602614, "phrase": "cajd"}, {"score": 0.0038359732954582762, "phrase": "cspd"}, {"score": 0.0036052633308076933, "phrase": "extracted_keywords"}, {"score": 0.0035497797026638033, "phrase": "cluster_analysis"}, {"score": 0.003513264130359459, "phrase": "social_network_analysis"}, {"score": 0.0029467742734417255, "phrase": "high_correlation"}, {"score": 0.0029164434911787187, "phrase": "chinese_recsys_research"}, {"score": 0.002643386043540555, "phrase": "research_themes"}, {"score": 0.00257586859792573, "phrase": "considerable_scale"}, {"score": 0.0023711591828229736, "phrase": "great_potential"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Recommendation System in China", " Co-word analysis", " Research patterns", " Research trends"], "paper_abstract": "This paper examines the research patterns and trends of Recommendation System (RecSys) in China during the period of 2004-2013. Data (keywords in articles) was collected from the China Academic Journal Network Publishing Database (CAJD) and the China Science Periodical Database (CSPD). A co-word analysis was conducted to measure correlation among the extracted keywords. The cluster analysis and social network analysis revealed 12 theme-clusters, network characteristics (centrality and density) of the clusters, the strategic diagram, and the correlation network. The study results show that there are several important themes with a high correlation in Chinese RecSys research, which is considered to be relatively focused, mature, and well-developed overall. Some research themes have developed on a considerable scale, while others remain isolated and undeveloped. This study also identified a few emerging themes with great potential for development. It was also determined that studies overall on the applications of RecSys are increasing. (C) 2015 Elsevier Ltd. All rights reserved.", "paper_title": "Research patterns and trends of Recommendation System in China using co-word analysis", "paper_id": "WOS:000357240200001"}