{"auto_keywords": [{"score": 0.03634866103459298, "phrase": "graph_g"}, {"score": 0.00481495049065317, "phrase": "wireless_sensor_network"}, {"score": 0.0047823219739028325, "phrase": "efficient_routing."}, {"score": 0.004717723626157272, "phrase": "wireless_sensor_networks"}, {"score": 0.004653993775422955, "phrase": "tremendous_amount"}, {"score": 0.004452731043379068, "phrase": "health_care"}, {"score": 0.0041598882840506385, "phrase": "limited_processing_and_computing_resources"}, {"score": 0.004089725258435817, "phrase": "network_operations"}, {"score": 0.003966388754366831, "phrase": "improved_dynamic_cluster-based_wireless_sensor_network"}, {"score": 0.003873027670786261, "phrase": "efficient_routing_protocol"}, {"score": 0.0038336889370744662, "phrase": "cluster-based_structure"}, {"score": 0.003403122817578447, "phrase": "previous_routing_protocols"}, {"score": 0.0033004240095380623, "phrase": "similar_cluster-based_structure"}, {"score": 0.0031899334050985175, "phrase": "node-move-in"}, {"score": 0.0031682817605340028, "phrase": "node-move-out"}, {"score": 0.0027459678326877744, "phrase": "sensor_nodes"}, {"score": 0.0026002844796442818, "phrase": "proposed_node-move-in_and_node-move-out_algorithms"}, {"score": 0.0023158019935841235, "phrase": "existing_cluster-based_structure"}, {"score": 0.002222994077182071, "phrase": "leaving_node"}, {"score": 0.002163193271881447, "phrase": "proposed_routing_protocol"}, {"score": 0.0021411841686226297, "phrase": "better_route"}], "paper_keywords": ["WSN", " Routing", " Node-move-in and node-move-out", " Dynamic cluster-based WSN"], "paper_abstract": "In recent years, wireless sensor networks have gained a tremendous amount of attention due to their potential ability in providing solutions in various areas such as health care, environment, defense, surveillance, industry and transport. Typically, the sensors are small, with limited processing and computing resources and thus useful for network operations. In this paper, we present an improved Dynamic Cluster-based Wireless Sensor Network (WSN) that facilitates an efficient routing protocol. The cluster-based structure presented here is self-constructible and reconfigurable and is supported by two atomic operations: node-move-in and node-move-out. Our routing protocol finds routes on graph G, unlike some previous routing protocols that find routes on the structure in a similar cluster-based structure. For the two operations we also propose two algorithms: Node-Move-In and Node-Move-Out. We show that to establish a route on graph G using the structure, it requires O(p) rounds, where p is the number of clusters in the network. Note that, in a scenario where the number of sensor nodes n is enormous, p is much less than n. We also show that the proposed Node-Move-In and Node-Move-Out algorithms require expected O(q) and O(vertical bar T vertical bar) rounds, respectively. Here q is the number of neighbors in G of the node that wish to join to an existing cluster-based structure and T is the sub-tree of the structure whose root is the leaving node. Finally, our simulation results describe that the proposed routing protocol finds a better route with less length and using less computational time.", "paper_title": "A BETTER DYNAMIC CLUSTER-BASED STRUCTURE OF WIRELESS SENSOR NETWORK FOR EFFICIENT ROUTING", "paper_id": "WOS:000310118200016"}