{"auto_keywords": [{"score": 0.04278379952839438, "phrase": "service_type"}, {"score": 0.015719716506582538, "phrase": "machine_interference_problem"}, {"score": 0.004769958800452922, "phrase": "different_service_types"}, {"score": 0.004725385523804256, "phrase": "multiple_operators"}, {"score": 0.004529881123652277, "phrase": "special_case"}, {"score": 0.00375395061615019, "phrase": "expected_interference"}, {"score": 0.00348202932445197, "phrase": "multinomial_distribution"}, {"score": 0.003306559295382181, "phrase": "internal_service_order"}, {"score": 0.0032756158688245, "phrase": "queue_discipline"}, {"score": 0.0031845067058084583, "phrase": "interference_calculations"}, {"score": 0.0027395968397212053, "phrase": "common_work_measurement"}, {"score": 0.002626034130205569, "phrase": "optimal_numbers"}, {"score": 0.0022168460543913787, "phrase": "theoretical_analysis"}, {"score": 0.0021857667493036786, "phrase": "case_study"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Machine interference", " Machine repair models", " Multiple service types", " Multinomial distribution", " Work measurement"], "paper_abstract": "This paper proposes a model for a special case of the machine interference problem (MIP), where each of N identical machines randomly requests several different service types. Each request for a service type is fulfilled by an operator who can provide only one service type. The model allows the calculation of the expected interference (waiting) time in the queue for each service type, according to the multinomial distribution. The uniqueness of the model is that under its assumptions internal service order and queue discipline are not needed for the interference calculations. The model requires as inputs only the machine runtime and the average time of each service type that is needed to produce one unit. These inputs can be obtained by a common work measurement. The model enables practitioners to determine the optimal numbers of operators that are needed for each service type in order to minimize the cost per unit or maximize the profit, or to set other performance measures. To demonstrate the applicability of the model, a theoretical analysis and a case study are presented. (C) 2013 Elsevier Ltd. All rights reserved.", "paper_title": "A multinomial model for the machine interference problem with different service types and multiple operators", "paper_id": "WOS:000324962000007"}