{"auto_keywords": [{"score": 0.049751826735385404, "phrase": "microarray_data"}, {"score": 0.04111262010311418, "phrase": "expression_levels"}, {"score": 0.034260289015078556, "phrase": "correlated_and_negative-correlated_patterns"}, {"score": 0.029094240281202784, "phrase": "up-down_bit_patterns"}, {"score": 0.00481495049065317, "phrase": "gene_clustering"}, {"score": 0.004749388744356778, "phrase": "biclustering"}, {"score": 0.0046846932351254636, "phrase": "simultaneous_clustering"}, {"score": 0.004000978459274141, "phrase": "coregulated_patterns"}, {"score": 0.003852791434660505, "phrase": "found_cluster_rise"}, {"score": 0.0037484651075873933, "phrase": "real_microarray_data"}, {"score": 0.00369736218441293, "phrase": "negative-correlated_patterns"}, {"score": 0.002947723206640026, "phrase": "new_method"}, {"score": 0.0028975361811534265, "phrase": "bit_pattern"}, {"score": 0.002705165729333657, "phrase": "condition_pairs"}, {"score": 0.0025604827895852646, "phrase": "condition_pair_a_and_b"}, {"score": 0.0023578033235964356, "phrase": "heuristic_idea"}, {"score": 0.002254785420533933, "phrase": "time_complexity"}, {"score": 0.002239340134646663, "phrase": "exponential_time"}, {"score": 0.0022240004131756095, "phrase": "polynomial_time"}, {"score": 0.002193634795186667, "phrase": "experimental_results"}, {"score": 0.002148860300945805, "phrase": "udb_method"}, {"score": 0.0021049977753042253, "phrase": "co-gclustering_method"}], "paper_keywords": ["cluster", " coregulation", " microarray", " negative-correlated pattern"], "paper_abstract": "Biclustering, which performs simultaneous clustering of rows (e. g., genes) and columns (e. g., conditions), has been shown to be important for analyzing microarray data. To find biclusters, there have been many methods proposed. Most of these methods can find only clusters with coregulated patterns, which means that the expression levels of genes in a found cluster rise and fall simultaneously. However, for real microarray data, there exist negative-correlated patterns, which means that the tendencies of expression levels of some genes may be completely inverse to those of the other genes under some conditions. Although one method called Co-gclustering was proposed to simultaneously find clusters with correlated and negative-correlated patterns, its time complexity is exponential to the number of conditions, which may not be efficient. Therefore, in this article, we propose a new method, Up-Down Bit pattern (UDB), to efficiently find clusters with correlated and negative-correlated patterns. First, we utilize up-down bit patterns to record those condition pairs where one gene is upregulated or downregulated. One gene is upregulated (or downregulated) under condition pair a and b if its expression level shows an upward (or downward) tendency from condition a to condition b. Then, we apply a heuristic idea on these up-down bit patterns to efficiently find clusters, which will reduce the time complexity from exponential time to polynomial time. From the experimental results, we show that the UDB method is more efficient than the Co-gclustering method.", "paper_title": "An Up-Down Bit Pattern Approach to Coregulated and Negative-Coregulated Gene Clustering of Microarray Data", "paper_id": "WOS:000298137500002"}