{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "multi_cloud_environment"}, {"score": 0.012862800017765944, "phrase": "efficient_and_secured_data"}, {"score": 0.004757643419056999, "phrase": "data_security"}, {"score": 0.004589763483242731, "phrase": "biggest_problem"}, {"score": 0.004535124351828787, "phrase": "cloud_computing"}, {"score": 0.00414545383888272, "phrase": "pure_data"}, {"score": 0.00407161650109722, "phrase": "security_problems"}, {"score": 0.003999089046152065, "phrase": "cloud's_storage_blockage"}, {"score": 0.003677280504320636, "phrase": "secured_data"}, {"score": 0.003321008590273796, "phrase": "security_aspect"}, {"score": 0.002945669860541221, "phrase": "insufficient_efficiency"}, {"score": 0.00241658945942583, "phrase": "extensive_discussion"}, {"score": 0.0022085455097790537, "phrase": "multi_cloud"}, {"score": 0.0021049977753042253, "phrase": "enhanced_technique"}], "paper_keywords": ["cloud computing", " multi cloud", " data security", " data privacy", " data partitioning", " efficient"], "paper_abstract": "Data security and privacy have become the biggest problem in cloud computing and could be solved by adopting data partitioning in the multi cloud environment. Nevertheless, pure data partitioning faces security problems caused by cloud's storage blockage or service outage. Therefore, many researchers have moved and conducted their research on secured data partitioning. However, a little attention is given towards unification of data partitioning process with the security aspect. Most of the researches are more focused on one aspect and have neglected the other one. This leads to insufficient efficiency on data partitioning performance and the security being proposed. Thus, this paper intends to propose efficient and secured data partitioning of multi cloud environment. To achieve this objective, this paper has presented an extensive discussion related to the concept of data partitioning and related works on efficient and secured data partitioning of multi cloud. Lastly, we have proposed an enhanced technique for efficient and secured data partitioning of multi cloud environment.", "paper_title": "Efficient and secured data partitioning in the multi cloud environment", "paper_id": "WOS:000373692800001"}