{"auto_keywords": [{"score": 0.05007852962010534, "phrase": "web_event"}, {"score": 0.008503855536998095, "phrase": "web_events"}, {"score": 0.008148502555923027, "phrase": "big_data"}, {"score": 0.004392565073466714, "phrase": "considerable_interests"}, {"score": 0.003545024951402818, "phrase": "different_kind"}, {"score": 0.003501846136829077, "phrase": "confident_websites"}, {"score": 0.0033961782274326948, "phrase": "proposed_approach_mines"}, {"score": 0.0031553611552558986, "phrase": "measuring_process"}, {"score": 0.002931569771634119, "phrase": "influence_process"}, {"score": 0.002825681384008326, "phrase": "evolution_process"}, {"score": 0.002723607240517261, "phrase": "matrix_operations"}, {"score": 0.0023507916951658455, "phrase": "proposed_uncertainty"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Web event veracity", " Topic detection and tracking", " Big data"], "paper_abstract": "Web events, whose data occur as one kind of big data, have attracted considerable interests during the past years. However, most existing related works fail to measure the veracity of web events. In this research, we propose an approach to measure the veracity of web event via its uncertainty based on its features distribution on different kind of confident websites. Firstly, the proposed approach mines various event features from the data of web event which may influence on the measuring process of uncertainty. Secondly, one computational model is introduced to simulate the influence process of the above features on the evolution process of web event. Thirdly, matrix operations are managed to facilitate practice. Finally, experiments are made based on the analysis above, and the results proved that the proposed uncertainty measuring algorithm is promising to measure the veracity of web event for big data. (C) 2014 Elsevier Inc. All rights reserved.", "paper_title": "Measuring the veracity of web event via uncertainty", "paper_id": "WOS:000350927300018"}