{"auto_keywords": [{"score": 0.04892132379047204, "phrase": "china"}, {"score": 0.04586309744157068, "phrase": "people's_location-sharing_privacy_preferences"}, {"score": 0.00481495049065317, "phrase": "location-sharing_privacy_preferences"}, {"score": 0.00461302961851157, "phrase": "prior_studies"}, {"score": 0.004446677711302801, "phrase": "initial_understanding"}, {"score": 0.004208282550386197, "phrase": "western_countries"}, {"score": 0.0039341294012600085, "phrase": "location_disclosures"}, {"score": 0.0038862297330905836, "phrase": "people's_privacy_preferences"}, {"score": 0.0036107898615445797, "phrase": "location-sharing_preferences"}, {"score": 0.002825681384008326, "phrase": "chinese_participants"}, {"score": 0.0027403605798830984, "phrase": "interesting_differences"}, {"score": 0.0021309898622781124, "phrase": "location-sharing_applications"}, {"score": 0.0021049977753042253, "phrase": "location-based_advertising"}], "paper_keywords": ["Location sharing", " Cross-cultural comparison", " Location privacy"], "paper_abstract": "While prior studies have provided us with an initial understanding of people's location-sharing privacy preferences, they have been limited to Western countries and have not investigated the impact of the granularity of location disclosures on people's privacy preferences. We report findings of a 3-week comparative study collecting location traces and location-sharing preferences from two comparable groups in the United States and China. Results of the study shed further light on the complexity of people's location-sharing privacy preferences and key attributes influencing willingness to disclose locations to others and to advertisers. While our findings reveal many similarities between US and Chinese participants, they also show interesting differences, such as differences in willingness to share location at \"home\" and at \"work\" and differences in the granularity of disclosures people feel comfortable with. We conclude with a discussion of implications for the design of location-sharing applications and location-based advertising.", "paper_title": "A comparative study of location-sharing privacy preferences in the United States and China", "paper_id": "WOS:000316819900008"}