{"auto_keywords": [{"score": 0.04955111375780366, "phrase": "partial_observability"}, {"score": 0.018370036378950915, "phrase": "fairness_constraints"}, {"score": 0.00481495049065317, "phrase": "memoryless_strategies"}, {"score": 0.004709333998298903, "phrase": "unconditional_fairness_constraints"}, {"score": 0.004657393640152439, "phrase": "alternating-time_temporal_logic"}, {"score": 0.004285594361623147, "phrase": "specified_collective_goal"}, {"score": 0.0035486713647627246, "phrase": "unified_framework"}, {"score": 0.0031405975280029913, "phrase": "full_knowledge"}, {"score": 0.0028417741269408194, "phrase": "fair_way"}, {"score": 0.002486987042061596, "phrase": "model-checking_algorithm"}, {"score": 0.0023525345110929326, "phrase": "full-observability_variant"}, {"score": 0.0021763973978248005, "phrase": "experimental_evaluation"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Alternating-time temporal logic", " Partial observability", " Fairness constraints", " Model checking"], "paper_abstract": "Alternating-time Temporal Logic is a logic to reason about strategies that agents can adopt to achieve a specified collective goal. A number of extensions for this logic exist; some of them combine strategies and partial observability, some others include fairness constraints, but to the best of our knowledge no work provides a unified framework for strategies, partial observability and fairness constraints. Integration of these three concepts is important when reasoning about the capabilities of agents without full knowledge of a system, for instance when the agents can assume that the environment behaves in a fair way. We present ATLK(irF), a logic combining strategies under partial observability in a system with fairness constraints on states. We introduce a model-checking algorithm for ATLK(irF) by extending the algorithm for a full-observability variant of the logic and we investigate its complexity. We validate our proposal with an experimental evaluation. (C) 2015 Elsevier Inc. All rights reserved.", "paper_title": "Reasoning about memoryless strategies under partial observability and unconditional fairness constraints", "paper_id": "WOS:000355664900007"}