{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "interview_data"}, {"score": 0.00456020621016909, "phrase": "collaborative_research_activity"}, {"score": 0.004389912080394437, "phrase": "traditional_scientific_authorship_model"}, {"score": 0.004135010810625326, "phrase": "small_groups"}, {"score": 0.0038948525410795517, "phrase": "major_contributions"}, {"score": 0.0037903327482565097, "phrase": "recent_collaborations"}, {"score": 0.003512308265830794, "phrase": "author_list"}, {"score": 0.003272375502853897, "phrase": "individual_contributions"}, {"score": 0.003201890266327127, "phrase": "significant_implications"}, {"score": 0.003167217223469026, "phrase": "hiring_and_promotion_procedures"}, {"score": 0.0030654278282822027, "phrase": "collaborative_research"}, {"score": 0.0024788167298469455, "phrase": "future_work"}, {"score": 0.002386062690026682, "phrase": "emerging_economics_literature"}, {"score": 0.0023602032679095955, "phrase": "\"mechanism_design"}, {"score": 0.002186849855560281, "phrase": "proper_attribution"}], "paper_keywords": [""], "paper_abstract": "In this article, I draw on interview data gathered in the High Energy Physics (HEP) community to address recent problems stemming from collaborative research activity that stretches the boundaries of the traditional scientific authorship model. While authorship historically has been attributed to individuals and small groups, thereby making it relatively easy to tell who made major contributions to the work, recent collaborations have involved hundreds or thousands of individuals. Printing all of these names in the author list on articles can mean difficulties in discerning the nature or extent of individual contributions, which has significant implications for hiring and promotion procedures. This also can make collaborative research less attractive to scientists at the outset of a project. I discuss the issues that physicists are considering as they grapple with what it means to be \"an author,\" in addition to suggesting that future work in this area draw on the emerging economics literature on \"mechanism design\" in considering how credit can be attributed in ways that both ensure proper attribution and induce scientists to put forth their best effort.", "paper_title": "What does it mean to be an author? The intersection of credit, contribution, and collaboration in science", "paper_id": "WOS:000241688900006"}