{"auto_keywords": [{"score": 0.04854647457237971, "phrase": "frequency_modulation"}, {"score": 0.011387141120877292, "phrase": "speech_signal"}, {"score": 0.009562452849369692, "phrase": "proposed_vad"}, {"score": 0.00481495049065317, "phrase": "robust_voice_activity_detection_algorithm"}, {"score": 0.003986844722309844, "phrase": "multi-resolution_spectro-temporal_analysis_framework"}, {"score": 0.0038092152998069786, "phrase": "texture_features"}, {"score": 0.003735522846193052, "phrase": "audio_signal"}, {"score": 0.0035458802311188497, "phrase": "frequency_modulation_features"}, {"score": 0.0034099718632933027, "phrase": "proposed_algorithm"}, {"score": 0.0033439771810057717, "phrase": "voice_active_segments"}, {"score": 0.0031741489723036255, "phrase": "related_feature"}, {"score": 0.0026104197983396367, "phrase": "dsp_platform"}, {"score": 0.0022763657774198184, "phrase": "non-stationary_noise"}], "paper_keywords": ["digital signal processor", " frequency modulation", " spectrotemporal analysis", " voice activity detection"], "paper_abstract": "This paper proposes a voice activity detection (VAD) algorithm based on an energy related feature of the frequency modulation of harmonics. A multi-resolution spectro-temporal analysis framework, which was developed to extract texture features of the audio signal from its Fourier spectrogram, is used to extract frequency modulation features of the speech signal. The proposed algorithm labels the voice active segments of the speech signal by comparing the energy related feature of the frequency modulation of harmonics with a threshold. Then, the proposed VAD is implemented on one of Texas Instruments (TI) digital signal processor (DSP) platforms for real-time operation. Simulations conducted on the DSP platform demonstrate the proposed VAD performs significantly better than three standard VADs, ITU-T G.729B, ETSI AMR1 and AMR2, in non-stationary noise in terms of the receiver operating characteristic (ROC) curves and the recognition rates from a practical distributed speech recognition (DSR) system.", "paper_title": "Robust Voice Activity Detection Algorithm Based on Feature of Frequency Modulation of Harmonics and Its DSP Implementation", "paper_id": "WOS:000364422400009"}