{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "predictive_power"}, {"score": 0.004724512842884256, "phrase": "information_systems_continuance"}, {"score": 0.004635765943321778, "phrase": "information_systems_acceptance"}, {"score": 0.0045733930839959155, "phrase": "initial_adoption"}, {"score": 0.004536371075341048, "phrase": "implicit_assumption"}, {"score": 0.004343901281737735, "phrase": "initial_is_adoption"}, {"score": 0.004216316375000129, "phrase": "continued_is_usage_behavior"}, {"score": 0.0041595635014087685, "phrase": "frequently_performed_behaviors"}, {"score": 0.0035930624319243224, "phrase": "previous_work"}, {"score": 0.003294350220187021, "phrase": "recent_work"}, {"score": 0.003267648184498275, "phrase": "continued_usage"}, {"score": 0.0025181767240440417, "phrase": "voluntary_continued_www_usage"}, {"score": 0.002437456694466861, "phrase": "moderating_variable"}, {"score": 0.0023850825542331418, "phrase": "continuance_behavior"}, {"score": 0.0023465400668244386, "phrase": "boundary_condition"}, {"score": 0.002327502474395314, "phrase": "explanatory_power"}, {"score": 0.002151234783250826, "phrase": "habit_formation"}], "paper_keywords": ["IS continuance", " habit", " expectation-confirmation theory", " satisfaction", " adoption"], "paper_abstract": "Past research in the area of information systems acceptance has primarily focused on initial adoption under the implicit assumption that IS usage is mainly determined by intention. While plausible in the case of initial IS adoption, this assumption may not be as readily applicable to continued IS usage behavior since it ignores that frequently performed behaviors tend to become habitual and thus automatic over time. This paper is a step forward in defining and incorporating the \"habit\" construct into IS research. Specifically, the purpose of this study is to explore the role of habit and its antecedents in the context of continued IS usage. Building on previous work in other disciplines, we define habit in the context of IS usage as the extent to which people tend to perform behaviors (use IS) automatically because of learning. Using recent work on the continued usage of IS (IS continuance), we have developed a model suggesting that continued IS usage is not only a consequence of intention, but also of habit. In particular, in our research model, we propose IS habit to moderate the influence of intention such that its importance in determining behavior decreases as the behavior in question takes on a more habitual nature. Integrating past research on habit and IS continuance further, we suggest how antecedents of behavior/behavioral intention as identified by IS continuance research relate to drivers of habitualization. We empirically tested the model in the context of voluntary continued WWW usage. Our results support the argument that habit acts as a moderating variable of the relationship between intentions and IS continuance behavior, which may put a boundary condition on the explanatory power of intentions in the context of continued IS usage. The data also support that satisfaction, frequency of past behavior, and comprehensiveness of usage are key to habit formation and thus relevant in the context of IS continuance behavior. Implications of these findings are discussed and managerial guidelines presented", "paper_title": "How habit limits the predictive power of intention: The case of information systems continuance", "paper_id": "WOS:000251201700005"}