{"auto_keywords": [{"score": 0.04925539003404233, "phrase": "spatial_cls"}, {"score": 0.008713768692145006, "phrase": "looping_sequences"}, {"score": 0.006675134554231561, "phrase": "cls"}, {"score": 0.00488550268473749, "phrase": "rewrite_rules"}, {"score": 0.004523272849033429, "phrase": "spatial_features"}, {"score": 0.00436890075128947, "phrase": "biological_elements"}, {"score": 0.004323620278409076, "phrase": "continuous_space"}, {"score": 0.0033201720993656734, "phrase": "different_objects"}, {"score": 0.0030226700832113942, "phrase": "specific_behaviors"}, {"score": 0.0028392545452904762, "phrase": "space_conflict"}, {"score": 0.0027326751144684386, "phrase": "simple_and_powerful_syntax"}, {"score": 0.002648448458159033, "phrase": "possible_reactions"}, {"score": 0.0025225467103906314, "phrase": "stochastic_reaction_rate_parameter"}, {"score": 0.0024109902338204873, "phrase": "biological_processes"}, {"score": 0.0023694065215394593, "phrase": "exact_position"}, {"score": 0.002233301265743633, "phrase": "cell_proliferation"}, {"score": 0.002149418970824546, "phrase": "pseudomonas_aeruginosa"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Calculus of Looping Sequences", " Spatial modeling", " Systems biology"], "paper_abstract": "This paper presents Spatial CLS, an extension of the Calculus of Looping Sequences (CLS) with spatial features. Spatial CLS allows keeping track of the position of biological elements in a continuous space (2D or 3D) as time passes. The movement of elements in the space can be precisely described, and elements can interact when constraints on their positions are satisfied such as, for example, if two elements are close enough. As for CLS, membranes and elements inside them can be directly modeled in the syntax. Spatial CLS allows describing the space occupied by elements and membranes. The space occupied by different objects is always kept disjoint. The validity of this constraint is ensured at all times by the semantics of the calculus. In order to model specific behaviors, the modeler can provide an algorithm to rearrange the position of objects in case of a space conflict. Being an extension of CLS, Spatial CLS provides a simple and powerful syntax, based on rewrite rules, for describing the possible reactions among elements of a system. Moreover, rewrite rules are endowed with a stochastic reaction rate parameter. The aim of Spatial CLS is to enable a more accurate description of those biological processes whose behavior depends on the exact position of the elements. As example applications of the calculus, we present a model of cell proliferation, and a model of the quorum sensing process in Pseudomonas aeruginosa. (C) 2011 Elsevier B.V. All rights reserved.", "paper_title": "Spatial Calculus of Looping Sequences", "paper_id": "WOS:000296307400002"}