{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "concept_mapping_methodology"}, {"score": 0.011935208934176227, "phrase": "final_interpretation"}, {"score": 0.010337110170347842, "phrase": "global_index"}, {"score": 0.004706206193274572, "phrase": "hospitality_sector"}, {"score": 0.004547656324173302, "phrase": "non_trivial_task"}, {"score": 0.004495996972278015, "phrase": "abstract_thoughts"}, {"score": 0.0044111930537670705, "phrase": "focus_group"}, {"score": 0.004311527998148399, "phrase": "studied_domain"}, {"score": 0.0041821205529541045, "phrase": "general_steps"}, {"score": 0.003934795713147731, "phrase": "conceptual_map"}, {"score": 0.0039049226745413224, "phrase": "interrelated_concepts"}, {"score": 0.0038605361756636667, "phrase": "multidimensional_scaling"}, {"score": 0.0037161794591176033, "phrase": "conceptual_maps"}, {"score": 0.0035500334260484376, "phrase": "final_decision"}, {"score": 0.00348300993356662, "phrase": "clustering_techniques"}, {"score": 0.003417247483597346, "phrase": "potentially_conceptual_maps"}, {"score": 0.00293380698353469, "phrase": "experts_opinions"}, {"score": 0.002646665861584495, "phrase": "hospitality_industry"}, {"score": 0.0024150528983695446, "phrase": "experts'_opinions"}, {"score": 0.002351389889948836, "phrase": "key_aspects"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v._all_rights"}], "paper_keywords": ["Concept mapping methodology", " Qualitative reasoning techniques", " Consensus measures", " Excellence in hospitality"], "paper_abstract": "The concept mapping methodology aims to respond to the non trivial task of conceptualising abstract thoughts by means of a focus group composed by experts from the studied domain. The approach defines a set of general steps that allow experts to lead the generation of ideas, group the ideas in a conceptual map of interrelated concepts using clustering multidimensional scaling and clustering techniques, analysing the quality of the conceptual maps and deciding on a final interpretation. In this sense, this final decision is not trivial because clustering techniques provide a set of potentially conceptual maps so experts must select the one that fits best according to their opinion. For this reason, we present the global index of consensus as an indicator for filtering the most suitable clustering solutions using qualitative reasoning. It promotes the consensus of experts opinions and ensures objectivity in the final interpretation. The index outperforms three of the most well-known clustering validation indexes in a case study focused on the meaning of excellence in the hospitality industry. This work presents the global index of consensus as an indicator for filtering the most suitable clustering solutions using qualitative reasoning that promotes the consensus of experts' opinions, which is one of the key aspects in the concept mapping methodology. The index outperforms three of the most well-known clustering validation indexes in a case study focused on the meaning of excellence in hospitality. (C) 2015 Elsevier B.V. All rights reserved.", "paper_title": "Promoting consensus in the concept mapping methodology: An application in the hospitality sector", "paper_id": "WOS:000364056500006"}