{"auto_keywords": [{"score": 0.039582331530024696, "phrase": "lower_layers"}, {"score": 0.0045075348899324425, "phrase": "distributed_applications"}, {"score": 0.0040379950810436995, "phrase": "major_problem"}, {"score": 0.003987535625069556, "phrase": "comprehensive_simulation_scenario"}, {"score": 0.003913021620260308, "phrase": "higher_layers"}, {"score": 0.003839894670436311, "phrase": "currently_available_simulators"}, {"score": 0.003791901285142797, "phrase": "core_simulator"}, {"score": 0.0036171884608283047, "phrase": "higher_network_layers"}, {"score": 0.0034722729543863267, "phrase": "novel_idea"}, {"score": 0.0034504976926879424, "phrase": "network_simulation"}, {"score": 0.0031200390864992407, "phrase": "separate_agent"}, {"score": 0.0030520667324977473, "phrase": "integrated_environment"}, {"score": 0.0030233895551146695, "phrase": "agent_systems"}, {"score": 0.0028749210987951677, "phrase": "final_goal"}, {"score": 0.0028300327780308903, "phrase": "complex_higher_level_web-based_distributed_application"}, {"score": 0.002640682934273318, "phrase": "simple_distributed_application"}, {"score": 0.002542782716137888, "phrase": "conducted_simulations"}, {"score": 0.0025188786741217077, "phrase": "achieved_results"}, {"score": 0.002410256695500994, "phrase": "individual_agent_function"}, {"score": 0.0023429088315910585, "phrase": "information_flow"}, {"score": 0.0023063080082656737, "phrase": "communication_routes"}, {"score": 0.002234808936443945, "phrase": "route_selection"}, {"score": 0.0021998931213841567, "phrase": "expected_behavior"}, {"score": 0.002138410677608455, "phrase": "proposed_multi-agent-based_simulator"}], "paper_keywords": ["Multi-agent system based simulation", " network simulators", " remote procedure calls", " agent development environment", " web application simulation"], "paper_abstract": "The main goal of this paper is building a novel transmission control protocol/internet protocol (TCP/IP) network simulator engine for simulation of distributed applications for which capturing both higher and lower layer network parameters are important. There are not many comprehensive simulators available in industry and academia to simulate distributed applications while reporting the parameters of all the layers of the TCP/IP network active in such simulations. The major problem in building a comprehensive simulation scenario for applications residing on the higher layers of a network by using currently available simulators is that a core simulator for lower layers of the network should be used together with add-ons or other programs simulating higher network layers to be able to simulate the whole TCP/IP network. This paper presents a novel idea for network simulation that has not been implemented before, which is using agents to simulate all layers of the network. In this simulator, each TCP/IP layer is simulated separately by using a separate agent and its behavior. It is an integrated environment based on agent systems capable of simulating all layers of a TCP/IP network, including application and lower layers. The final goal is other agent systems simulating a complex higher level web-based distributed application being easily used together with these agents, which are simulating the core TCP/IP network. For evaluation and testing purposes, a simple distributed application consisting of several remote procedure calls is simulated. For the validation of the conducted simulations, the achieved results are compared with the results of two non-agent-based simulators. For the verification of each individual agent function, a report is generated that shows the information flow between agents. The communication routes between agents are checked manually to make sure the route selection is based on the expected behavior of each agent. The scalability of the proposed multi-agent-based simulator is tested for the given distributed application.", "paper_title": "A multi-agent-based simulator for a transmission control protocol/internet protocol network", "paper_id": "WOS:000337567500003"}