{"auto_keywords": [{"score": 0.034503478591515375, "phrase": "narrow_door_openings"}, {"score": 0.00481495049065317, "phrase": "unknown_environment"}, {"score": 0.004537875262684779, "phrase": "intrusion_detection"}, {"score": 0.004217425501814589, "phrase": "emergency_situation"}, {"score": 0.003905864553426306, "phrase": "wounded_people"}, {"score": 0.003798346343693706, "phrase": "prevailing_breakdown"}, {"score": 0.0037456980766939836, "phrase": "indoor_environments"}, {"score": 0.0031130463625133496, "phrase": "simultaneous_multiple_stc"}, {"score": 0.002964515198409409, "phrase": "multiple_autonomous_robots"}, {"score": 0.0028828348726682965, "phrase": "unknown_terrain"}, {"score": 0.0028527866590859967, "phrase": "proposed_extended_s-mstc"}, {"score": 0.0027838831266525773, "phrase": "ant-type_robots"}, {"score": 0.00244632460902489, "phrase": "partially_occupied_cells"}, {"score": 0.002370589610989257, "phrase": "complete_coverage"}, {"score": 0.0022653055209664284, "phrase": "multiple_spanning_trees"}, {"score": 0.002218299213266519, "phrase": "simulation_study"}, {"score": 0.0021646872269755067, "phrase": "es-mstc_algorithm"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Multi-robot exploration", " Terrain coverage", " Spanning tree coverage", " Cellular decomposition"], "paper_abstract": "Terrain exploration and coverage are required for a variety of applications such as mine clearing, intrusion detection and other humanitarian missions like search and rescue operations, for example, fire or blast in a building. During an emergency situation within a building it is crucial to explore the area as fast as possible in order to search and find the wounded people and other hazards. On account of the prevailing breakdown of communication in indoor environments in some situations, it is suggested that the robots can communicate indirectly with the use of markings in the environment. The Spanning Tree Coverage (STC) method, proposed for this problem, suffers in environments that have partially occupied cells and narrow door openings between rooms. In this paper, we consider an extension of the Simultaneous Multiple STC (S-MSTC) algorithm, which we proposed in our previous work on multiple autonomous robots used in exploration and coverage in an unknown terrain. The proposed extended S-MSTC (ES-MSTC) uses ant-type robots to cover the terrain leaving marks on the terrain, which can be sensed by the robots and allow them to cover the terrain, similar to the nature of ants. This algorithm can handle partially occupied cells and narrow door openings in the terrain and performs a complete coverage of the surface regardless of the shape of the environment by constructing multiple spanning trees simultaneously. We present a simulation study and compare the performance of the ES-MSTC algorithm with other existing algorithms. (C) 2011 Elsevier B.V. All rights reserved.", "paper_title": "Multi-robot exploration and terrain coverage in an unknown environment", "paper_id": "WOS:000298205900010"}