{"auto_keywords": [{"score": 0.04609016223528991, "phrase": "magnus"}, {"score": 0.018111603135296982, "phrase": "derek"}, {"score": 0.0077404697565562446, "phrase": "magnus-derek_game"}, {"score": 0.00463668357590034, "phrase": "two-person_game"}, {"score": 0.003942059405218598, "phrase": "targeted_position"}, {"score": 0.0034933321145368336, "phrase": "total_number"}, {"score": 0.003014713272570927, "phrase": "previous_result"}, {"score": 0.002913895605074143, "phrase": "modified_version"}, {"score": 0.0026214575349196418, "phrase": "np"}, {"score": 0.0022194677375148063, "phrase": "expected_time"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Two-person game", " Additive combinatorics"], "paper_abstract": "We consider the so called Magnus-Derek game, which is a two-person game played on a round table with n positions. The two players are called Magnus and Derek. Initially there is a token placed at position O. In each round Magnus chooses a positive integer m <= n/2 as the distance of the targeted position from his current position for the token to move, and Derek decides a direction, clockwise or counterclockwise, to move the token. The goal of Magnus is to maximize the total number of positions visited, while Derek's is to minimize this number. If both players play optimally, we prove that Magnus, the maximizer, can achieve his goal in O(n) rounds, which improves a previous result with O(n log n) rounds. Then we consider a modified version of the Magnus-Derek game, where one of the players reveals his moves in advance and the other player plays optimally. In this case we prove that it is NP-hard for Derek to achieve his goal if Magnus reveals his moves in advance. On the other hand, Magnus has an advantage to occupy all positions. We also consider the circumstance that both players play randomly, and we show that the expected time to visit all positions is O(n log n). (c) 2010 Elsevier B.V. All rights reserved.", "paper_title": "More on the Magnus-Derek game", "paper_id": "WOS:000286862100006"}