{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "social_presence"}, {"score": 0.012588338844027302, "phrase": "social_context"}, {"score": 0.0047026237903774895, "phrase": "purpose_-_purchasing"}, {"score": 0.004666695306975513, "phrase": "future_purchasing"}, {"score": 0.004565876339189493, "phrase": "unique_features"}, {"score": 0.00438105507792004, "phrase": "traditional_shopping_process"}, {"score": 0.003939296259436904, "phrase": "purchasing_intentions"}, {"score": 0.002763261749602258, "phrase": "partial_mediators"}, {"score": 0.0027307746993761035, "phrase": "practical_implications"}, {"score": 0.002259883463607508, "phrase": "potential_problems"}, {"score": 0.002155412043665635, "phrase": "important_role"}, {"score": 0.0021049977753042253, "phrase": "online_shopping"}], "paper_keywords": ["Electronic commerce", " Purchasing", " Trust"], "paper_abstract": "Purpose - Purchasing on the interne has unique features that make it different from the traditional shopping process, particularly with regard to its social context. This study seeks to investigate the relationship between past online purchases and purchasing intentions, representing the social context by the notions of social presence and trust. Design/methodology/approach - A sample of 115 working MBA students purchased an item online (but were stopped at the stage of paying), and then completed a questionnaire on social presence and trust. Findings - The results show that past purchasing predicts intentions to purchase and that trust and social presence act as partial mediators. Practical implications - Social context is important for understanding how past behavior affects future purchasing. Designs should therefore enhance social presence and trust. Moreover, it may be beneficial to monitor these mediators to detect potential problems. Originality/value - The study demonstrates the important role of social context in online shopping. In particular, the mediation of trust and social presence between past and future purchasing is determined.", "paper_title": "Past purchase and intention to purchase in e-commerce The mediation of social presence and trust", "paper_id": "WOS:000303030100005"}