{"auto_keywords": [{"score": 0.043344204212477706, "phrase": "semantic_organisation"}, {"score": 0.04309364447635938, "phrase": "thematic_structure"}, {"score": 0.015719716506582538, "phrase": "scientific_abstracts"}, {"score": 0.015121797899912985, "phrase": "small_number"}, {"score": 0.01237812779781219, "phrase": "move_analysis"}, {"score": 0.004786002454145624, "phrase": "purpose_-_the_purpose"}, {"score": 0.004519491332356944, "phrase": "cabi_database"}, {"score": 0.004306556130853961, "phrase": "cabi_editorial_staff"}, {"score": 0.004267757384195032, "phrase": "article_authors"}, {"score": 0.0038866641370225836, "phrase": "abstracting_guidelines"}, {"score": 0.0036479584876742085, "phrase": "five-move_pattern"}, {"score": 0.003550181594045975, "phrase": "scientific_community"}, {"score": 0.0034342161742428635, "phrase": "main_features"}, {"score": 0.0031941384895530426, "phrase": "practical_applications"}, {"score": 0.003174903873774882, "phrase": "findings_-_thematic_analysis"}, {"score": 0.0031462682245392785, "phrase": "scientific_abstract_authors"}, {"score": 0.0030711589859463814, "phrase": "discourse_domain"}, {"score": 0.0030434561939032597, "phrase": "\"real\"_world"}, {"score": 0.002943993876557772, "phrase": "guideline_advice"}, {"score": 0.0028911146216534646, "phrase": "general_consistency"}, {"score": 0.0028050788526778957, "phrase": "research_limitations"}, {"score": 0.002680789041160613, "phrase": "practical_implications"}, {"score": 0.002640591917408814, "phrase": "abstracting_services"}, {"score": 0.0024932498388507084, "phrase": "formal_training"}, {"score": 0.002318799760022913, "phrase": "abstracting_and_indexing_services"}, {"score": 0.0022771244331421586, "phrase": "abstract_quality"}, {"score": 0.0022294468373088424, "phrase": "author_abstracts"}, {"score": 0.002176176622950153, "phrase": "probably_little_formal_training"}, {"score": 0.002143529653780496, "phrase": "science_students"}], "paper_keywords": ["abstracts", " information media", " information retrieval"], "paper_abstract": "Purpose - The purpose of the paper is to analyse the structure of a small number of abstracts that have appeared in the CABI database over a number of years, during which time the authorship of the abstracts changed from CABI editorial staff to journal article authors themselves. This paper reports a study of the semantic organisation and thematic structure of 12 abstracts from the field of protozoology in an effort to discover whether these abstracts followed generally agreed abstracting guidelines. Design/methodology/approach - The method adopted was a move analysis of the text of the abstracts. This move analysis revealed a five-move pattern: move 1 situates the research within the scientific community; move 2 introduces the research by either describing the main features of the research or presenting its purpose; move 3 describes the methodology; move 4 states the results; and move 5 draws conclusions or suggests practical applications. Findings - Thematic analysis shows that scientific abstract authors thematise their subject by referring to the discourse domain or the \"real\" world. Not all of the abstracts succeeded in following the guideline advice. However, there was general consistency regarding semantic organisation and thematic structure. Research limitations/implications - The research limitations were the small number of abstracts examined, from just one subject domain. Practical limitations - The practical implications are the need for abstracting services to be clearer and more prescriptive regarding how they want abstracts to be structured as the lack of formal training in abstract writing increases the risk of subjectivity and verbosity and reduces clarity in scientific abstracts. Another implication of the research are that abstracting and indexing services must ensure that they maintain abstract quality if they introduce policies of accepting author abstracts. This is important as there is probably little formal training in abstract writing for science students at present. Recommendations for further research are made. Originality/value - This paper reports a study of the semantic organisation and thematic structure of 12 abstracts from the field of protozoology.", "paper_title": "A genre analysis of scientific abstracts", "paper_id": "WOS:000239680600002"}