{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "local_government_decision-making_competition"}, {"score": 0.010645913832375124, "phrase": "new-style_urbanization"}, {"score": 0.0047851345246117455, "phrase": "china's_new_urbanization_process"}, {"score": 0.004741707921324547, "phrase": "local_government"}, {"score": 0.0044968982227349625, "phrase": "competition_new_urbanization"}, {"score": 0.004372895175179516, "phrase": "negative_effect"}, {"score": 0.0040334640350288, "phrase": "people's_livelihood"}, {"score": 0.003996027647611435, "phrase": "china's_new-style_urbanization"}, {"score": 0.0038857823149452487, "phrase": "internal_mechanism"}, {"score": 0.003861697777410367, "phrase": "decision_making"}, {"score": 0.003837761943551127, "phrase": "local_government_competition"}, {"score": 0.0037202816351450995, "phrase": "prospect_theory"}, {"score": 0.0036515223823915715, "phrase": "cournot"}, {"score": 0.003378385493203297, "phrase": "central_government"}, {"score": 0.0033159224502739247, "phrase": "local_government_competition_strategy"}, {"score": 0.003234425353582135, "phrase": "local_government_protective-investment_policy"}, {"score": 0.0031746155143471725, "phrase": "market_competition"}, {"score": 0.0031549249117721946, "phrase": "punishment_coefficient"}, {"score": 0.003135356056324338, "phrase": "government_decision-making_failure"}, {"score": 0.0030298703815998173, "phrase": "decision-making_competition"}, {"score": 0.0029645930408561086, "phrase": "revenue_function"}, {"score": 0.0028737647829311587, "phrase": "-_new-style_urbanization"}, {"score": 0.0028470613150369823, "phrase": "main_driving_force"}, {"score": 0.0028293966058473476, "phrase": "china's_future_economic_development"}, {"score": 0.0027172101552870973, "phrase": "\"principle-agent\"_relationship"}, {"score": 0.0025059724686541263, "phrase": "positive_effect"}, {"score": 0.002429161048032688, "phrase": "horizontal_and_intergovernmental_competition"}, {"score": 0.002325554982412043, "phrase": "institutional_economics"}, {"score": 0.0021049977753042253, "phrase": "unitary_government_state's_reality"}], "paper_keywords": ["Behaviour", " Game theory"], "paper_abstract": "Purpose - The purpose of this paper is to analyze the impact of local government decision-making competition new urbanization, further to seek measures to weaken the negative effect of local government decision-making competition. Design/methodology/approach - This paper first puts forward the three paths which make local government decision-making competition: construction of new-style urbanization, economic development and construction of people's livelihood and take China's new-style urbanization as an example, the authors analyzed the internal mechanism of decision making of local government competition which caused by above three paths. Second, using the prospect theory, risk aversion theory and Cournot duopoly model, the authors analyzed how to avoid the local government decision-making competition and how to reduce the harm caused by local government decision-making competition. Findings - The central government can curb the appearance of local government competition strategy through regulating and controlling the effectiveness of local government protective-investment policy, improving the degree of market competition and punishment coefficient of government decision-making failure and further, the authors can reduce the detriment of decision-making competition between local governments through adjusting the revenue function of local government in the process of new-style urbanization. Originality/value - New-style urbanization is the main driving force of China's future economic development, however, in the process of new-style urbanization, because of the \"principle-agent\" relationship between central government and local government, officials achievements appraisal mechanism and promotion game, they all cause competition between local government decision making, and this will weaken the positive effect of urbanization. Although, there are many researches on horizontal and intergovernmental competition, most researches devoted to how to avoid it from the angle of institutional economics, and the suggestions put forward by these researches are hardly applied. Anyone interested in how to avoid local government decision-making competition and reduce the negative influences of it from the angle of unitary government state's reality will find this paper valuable.", "paper_title": "How to reduce local government decision-making competition in China's new urbanization process", "paper_id": "WOS:000359057900002"}