{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "utility-based_negotiation"}, {"score": 0.00450368324850566, "phrase": "effective_representation"}, {"score": 0.004263972370406983, "phrase": "automated_negotiation"}, {"score": 0.0038923605771735838, "phrase": "negotiating_agents"}, {"score": 0.0033230588808076267, "phrase": "total_orders"}, {"score": 0.0029244418026475832, "phrase": "utility-based_negotiations"}, {"score": 0.0028715299874549245, "phrase": "total_orderings"}, {"score": 0.002466139325703204, "phrase": "complete_preference_orderings"}, {"score": 0.002348883765159185, "phrase": "comparable_performance"}, {"score": 0.002278440725193305, "phrase": "outcome_utility"}, {"score": 0.0021049977753042253, "phrase": "significantly_smaller_number"}], "paper_keywords": ["Automated negotiation", " Qualitative preferences", " CP-nets", " Heuristic-based approaches"], "paper_abstract": "CP-nets have proven to be an effective representation for capturing preferences. However, their use in automated negotiation is not straightforward because, typically, preferences in CP-nets are partially ordered and negotiating agents are required to compare any two outcomes based on a request and an offer in order to negotiate effectively. If agents know how to generate total orders from their CP-nets, they can make this comparison. This paper proposes heuristics that enable the use of CP-nets in utility-based negotiations by generating total orderings. To validate this approach, the paper compares the performance of CP-nets with our heuristics with the performance of UCP-nets that are equipped with complete preference orderings. Our results show that we can achieve comparable performance in terms of the outcome utility. More importantly, one of our proposed heuristics can achieve this performance with significantly smaller number of interactions compared to UCP-nets.", "paper_title": "Heuristics for using CP-nets in utility-based negotiation without knowing utilities", "paper_id": "WOS:000361652100004"}