{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "frequent_itemsets_mining"}, {"score": 0.004636594774238505, "phrase": "frequent_itemsets"}, {"score": 0.004281372589330329, "phrase": "decision_makers"}, {"score": 0.003286420941205958, "phrase": "relative_frequency"}, {"score": 0.0030089355635315005, "phrase": "decision_maker"}, {"score": 0.00267495669519805, "phrase": "summary_queries"}, {"score": 0.0026083473154448326, "phrase": "minimum-support_constraint"}, {"score": 0.002532724486603177, "phrase": "infrequent_itemsets"}, {"score": 0.002309000874224222, "phrase": "proposed_approaches"}, {"score": 0.0022420373745572837, "phrase": "statistical_parameters"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Frequent pattern discovery", " Summary query", " Support distribution"], "paper_abstract": "There are many advanced techniques that can efficiently mine frequent itemsets using a minimum-support. However, the question that remains unanswered is whether the minimum-support can really help decision makers to make decisions. In this paper, we study four summary queries for frequent itemsets mining, namely, (1) finding a support-average of itemsets, (2) finding a support-quantile of itemsets, (3) finding the number of itemsets that greater/less than the support-average, i.e., an approximated distribution of itemsets, and (4) finding the relative frequency of an itemset (compared its frequency with that of other itemsets in the same dataset). With these queries, a decision maker will know whether an itemset in question is greater/less than the support-quantile; the distribution of itemsets; and the frequentness of an itemset. Processing these summary queries is challenging, because the minimum-support constraint cannot be used to prune infrequent itemsets. In this paper, we propose several simple yet effective approximation solutions. We conduct extensive experiments for evaluating Our strategy, and illustrate that the proposed approaches can well model and capture the statistical parameters (summary queries) of itemsets in a database. (C) 2009 Elsevier Inc. All rights reserved.", "paper_title": "Summary queries for frequent itemsets mining", "paper_id": "WOS:000275634900005"}