{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "sort-last_parallel_rendering_processors"}, {"score": 0.031814538916309566, "phrase": "single_frame_buffer"}, {"score": 0.029092888920581643, "phrase": "proposed_architecture"}, {"score": 0.02797444719440717, "phrase": "pixel_cache"}, {"score": 0.004243862930012258, "phrase": "multiple_rasterizers"}, {"score": 0.0037617986040878342, "phrase": "parallel_architectures"}, {"score": 0.0036763623220059933, "phrase": "consistency_problem"}, {"score": 0.003334309053314909, "phrase": "consistency-free_memory_architecture"}, {"score": 0.0032028587883593702, "phrase": "consistency-free_pixel_cache_architecture"}, {"score": 0.0023346234464901978, "phrase": "experimental_results"}, {"score": 0.0022424956516376073, "phrase": "almost_linear_speedup"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["computer graphics", " graphics processors", " processor architectures", " memory structures", " parallel processors"], "paper_abstract": "Current rendering processors are aiming to process triangles as fast as possible and they have the tendency of equipping with multiple rasterizers to be capable of handling a number of triangles in parallel for increasing polygon rendering performance. However, those parallel architectures may have the consistency problem when more than one rasterizer try to access the data at the same address. This paper proposes a consistency-free memory architecture for sort-last parallel rendering processors, in which a consistency-free pixel cache architecture is devised and effectively associated with three different memory systems consisting of a single frame buffer, a memory interface unit, and consistency-test units. Furthermore, the proposed architecture can reduce the latency caused by pixel cache misses because the rasterizer does not wait until cache miss handling is completed when the pixel cache miss occurs. The experimental results show that the proposed architecture can achieve almost linear speedup upto four rasterizers with a single frame buffer. (c) 2006 Elsevier B.V. All rights reserved.", "paper_title": "A consistency-free memory architecture for sort-last parallel rendering processors", "paper_id": "WOS:000245793600004"}