{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "compressive_strength"}, {"score": 0.04844170546569224, "phrase": "neural_networks"}, {"score": 0.0061473246362243675, "phrase": "raw_variables"}, {"score": 0.0059374234321370335, "phrase": "grouped_dimensionless_variables"}, {"score": 0.004225950334493496, "phrase": "normal_and_high_strength"}, {"score": 0.003773870856027139, "phrase": "eight_variables"}, {"score": 0.0025059724686541263, "phrase": "available_experimental_data"}, {"score": 0.0024201029474586007, "phrase": "large_range"}, {"score": 0.0023782753249846794, "phrase": "concrete_compressive_strengths"}, {"score": 0.0023168823213024856, "phrase": "neural_network_models"}, {"score": 0.002237477619351199, "phrase": "regression_models"}, {"score": 0.0021049977753042253, "phrase": "high_prediction_accuracy"}], "paper_keywords": ["compressive strength", " concrete", " neural network", " regression models"], "paper_abstract": "This research deals with the prediction of compressive strength of normal and high strength concrete using neural networks. The compressive strength was modeled as a function of eight variables: quantities of cement, fine aggregate, coarse aggregate, micro-silica, water and super-plasticizer, maximum size of coarse aggregate, fineness modulus of fine aggregate. Two networks, one using raw variables and another using grouped dimensionless variables were constructed, trained and tested using available experimental data, covering a large range of concrete compressive strengths. The neural network models were compared with regression models. The neural networks based model gave high prediction accuracy and the results demonstrated that the use of neural networks in assessing compressive strength of concrete is both practical and beneficial. The performance of model using the grouped dimensionless variables is better than the prediction using raw variables.", "paper_title": "Prediction of compressive strength of concrete using neural networks", "paper_id": "WOS:000307372600007"}