{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "constrained_pattern_matching"}, {"score": 0.0047761092701293474, "phrase": "constrained_sequences"}, {"score": 0.004386637056030611, "phrase": "digital_recording"}, {"score": 0.004078078530972285, "phrase": "constrained_binary_sequences"}, {"score": 0.002936331371903168, "phrase": "central_limit_theorem"}, {"score": 0.0029126002350975634, "phrase": "large_deviations_results"}, {"score": 0.002707444334463544, "phrase": "exactly_r_occurrences"}, {"score": 0.0026423134393535265, "phrase": "shannon_entropy"}, {"score": 0.0023776656246300063, "phrase": "neuronal_data"}, {"score": 0.0023016843709107297, "phrase": "structural_constraints"}, {"score": 0.0022101055924375725, "phrase": "binary_sequences"}, {"score": 0.0021307975800397816, "phrase": "analytic_combinatorics"}, {"score": 0.0021049977753042253, "phrase": "combinatorial_calculus"}], "paper_keywords": ["Autocorrelation polynomials", " complex asymptotics", " constrained sequences", " languages", " neuronal spike trains", " pattern matching"], "paper_abstract": "Constrained sequences are strings satisfying certain additional structural restrictions (e. g., some patterns are forbidden). They find applications in communication, digital recording, and biology. In this article, we restrict our attention to the so-called (d, k) constrained binary sequences in which any run of zeros must be of length at least d and at most k, where 0 <= d < k. In many applications, one needs to know the number of occurrences of a given pattern w in such sequences, for which we coin the term constrained pattern matching. For a given word w, we first estimate the mean and the variance of the number of occurrences of w in a (d, k) sequence generated by a memoryless source. Then we present the central limit theorem and large deviations results. As a by-product, we enumerate asymptotically the number of (d, k) sequences with exactly r occurrences of w, and compute Shannon entropy of (d, k) sequences with a given number of occurrences of w. We also apply our results to detect under-and overrepresented patterns in neuronal data (spike trains), which satisfy structural constraints that match the framework of (d, k) binary sequences. Throughout this article we use techniques of analytic combinatorics such as combinatorial calculus, generating functions, and complex asymptotics.", "paper_title": "Constrained Pattern Matching", "paper_id": "WOS:000292839300012"}