{"auto_keywords": [{"score": 0.0045547927862194856, "phrase": "international_customer-supplier_relationships"}, {"score": 0.004104132253183181, "phrase": "major_driver"}, {"score": 0.003964007795174772, "phrase": "multinational_enterprises"}, {"score": 0.0037236852537136547, "phrase": "information_technology_usage"}, {"score": 0.003571591012750155, "phrase": "performance_implications"}, {"score": 0.0035222812668916736, "phrase": "cross-border_exchange_relationships"}, {"score": 0.003086396772496527, "phrase": "electronic_collaboration"}, {"score": 0.002704306866425829, "phrase": "empirical_foundation"}, {"score": 0.0024026156525362684, "phrase": "relationship_performance"}, {"score": 0.0023694065215394593, "phrase": "international_exchange"}, {"score": 0.0022101055924375725, "phrase": "international_customer_supplier_relationships"}], "paper_keywords": ["E-collaboration", " Relationship performance", " Cross-border exchange", " International exchange", " Supplier-customer relationship"], "paper_abstract": "The literature suggests that advances in information and communication technologies have been a major driver of the restructuring of multinational enterprises and their cross-border supply chain management. However, the role of information technology usage for collaboration and its antecedents and performance implications in cross-border exchange relationships have not been clearly specified. In response to this claim, this study examines the determinants of electronic collaboration (E-collaboration) and its outcomes for suppliers with regard to their international customers. Drawing on an empirical foundation of 240 Taiwanese-based electronics equipment manufacturers, we test the effects of technological, organizational and environmental dimensions on E-collaboration and its impact on relationship performance in international exchange. The findings on the pertinence of E-collaboration in international customer supplier relationships are presented and discussed. (C) 2014 Elsevier B.V. All rights reserved.", "paper_title": "The impact of technological, organizational and environmental characteristics on electronic collaboration and relationship performance in international customer-supplier relationships", "paper_id": "WOS:000343354400003"}