{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "quality_requirements"}, {"score": 0.016667238140344216, "phrase": "requirements_specification"}, {"score": 0.0071719229985431655, "phrase": "mobile_handset_domain"}, {"score": 0.004717723626157272, "phrase": "industrial_practice"}, {"score": 0.004529093447865156, "phrase": "sub-contractor_specification"}, {"score": 0.0038862297330905836, "phrase": "case_study"}, {"score": 0.003563172322934695, "phrase": "pertaining_requirements"}, {"score": 0.003403122817578447, "phrase": "structured_natural_language"}, {"score": 0.0033685408148574846, "phrase": "unique_identifiers"}, {"score": 0.002949598537993663, "phrase": "direct_metric"}, {"score": 0.0028170314398963704, "phrase": "different_sub-domains"}, {"score": 0.0023079225317714815, "phrase": "important_requirements"}, {"score": 0.0022267859286766553, "phrase": "studied_specification"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Quality requirements", " Case study", " Qualitative research", " Document analysis", " Metrics"], "paper_abstract": "Context: This paper analyses a sub-contractor specification in the mobile handset domain. Objective: The objective is to understand how quality requirements are specified and which types of requirements exist in a requirements specification from industry. Method: The case study is performed in the mobile handset domain, where a requirements specification was analyzed by categorizing and characterizing the pertaining requirements. Results: The requirements specification is written in structured natural language with unique identifiers for the requirements. Of the 2178 requirements, 827 (38%) are quality requirements. Of the quality requirements, 56% are quantified, i.e., having a direct metric in the requirement. The variation across the different sub-domains within the requirements specification is large. Conclusion: The findings from this study suggest that methods for quality requirements need to encompass many aspects to comprehensively support working with quality requirements. Solely focusing on, for example, quantification of quality requirements might overlook important requirements since there are many quality requirements in the studied specification where quantification is not appropriate. (C) 2013 Elsevier B.V. All rights reserved.", "paper_title": "An investigation of how quality requirements are specified in industrial practice", "paper_id": "WOS:000320217900006"}