{"auto_keywords": [{"score": 0.02922586341465149, "phrase": "sme"}, {"score": 0.00481495049065317, "phrase": "future_employability"}, {"score": 0.004483120978156604, "phrase": "varying_combinations"}, {"score": 0.004452731043379068, "phrase": "formal_and_informal_learning_activities"}, {"score": 0.004303830426772906, "phrase": "large_proportion"}, {"score": 0.004245667843980468, "phrase": "constant_'crisis_management'_mode"}, {"score": 0.004048194450210347, "phrase": "upskilling_environment"}, {"score": 0.003926105480202798, "phrase": "recent_research"}, {"score": 0.0037562161290203597, "phrase": "ireland"}, {"score": 0.003532977898022071, "phrase": "key_skills"}, {"score": 0.003222687723450745, "phrase": "diverse_interventions"}, {"score": 0.0029900592229516187, "phrase": "learning_delivery_models"}, {"score": 0.0024961041872030073, "phrase": "sme-specific_learning_delivery_models"}, {"score": 0.0024289743270061157, "phrase": "innovative_and_sustainable_learning_environments"}, {"score": 0.0021928902836049384, "phrase": "newinnovative_programmes"}, {"score": 0.002155831935645973, "phrase": "new_step"}, {"score": 0.0021049977753042253, "phrase": "global_priority"}], "paper_keywords": ["Graduate", " SMEs", " Learning", " Education", " Training", " Skills", " Competencies"], "paper_abstract": "There are many levels of learning, training, and upskilling within SMEs and these encapsulate varying combinations of formal and informal learning activities. However not all SMEs are proactive in their learning situations and a large proportion of SMEsare in constant 'crisis management' mode and therefore need to be encouraged to adopt a learning, training and upskilling environment if they want to survive and prosper. Recent research managed by the Programme for University and Industry Interface at the University of Limerick, Ireland (PUII in Available on line at: http://www.ul.ie/similar to puii/(accessed January 21st, 2008)) was charged with identifying key skills and competencies required by individuals in SMEs to ensure their future generation employability. What clearly emerged from this piece of work was the articulation of a range of diverse interventions, which SMEs feel are required to enable them to expand their organizational capacity and the capability of their employees. However, the learning delivery models developed to date for the upskilling of individuals in industry have largely failed to get to the heart of the matter for the SME and are not sufficient to bridge the gap between the needs of the individual in the SME and the needs of the organization. To this end, SME-specific learning delivery models are urgently required to build and create innovative and sustainable learning environments in SMEs, which will simultaneously develop both the individual and the organization. This paper discusses the needs of SMEs in terms of learning and illuminates the need for newinnovative programmes which will mark a new step in supporting the delivery on the global priority of educating and upskilling the workforce.", "paper_title": "Educational programmes for future employability of graduates in SMEs", "paper_id": "WOS:000319363100009"}