{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "difficult_task"}, {"score": 0.0046986841646790315, "phrase": "single_cluster_definition"}, {"score": 0.004518442937844318, "phrase": "pareto-based_multi-objective_genetic_algorithms"}, {"score": 0.004302791070310513, "phrase": "automatic_k-determination"}, {"score": 0.004260906498835763, "phrase": "mocle-multi-objective_clustering_ensemble"}, {"score": 0.0038827100184187805, "phrase": "high_number"}, {"score": 0.003303617297414837, "phrase": "corrected_rand"}, {"score": 0.002951739421935396, "phrase": "mock_and_mocle"}, {"score": 0.002742648551009682, "phrase": "reduced_set"}, {"score": 0.0026762874092443197, "phrase": "initial_population"}, {"score": 0.0026501935378083663, "phrase": "mocle."}, {"score": 0.002548331088496964, "phrase": "selection_strategy"}, {"score": 0.0021891781017389783, "phrase": "original_set"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Clustering", " Model selection"], "paper_abstract": "Clustering is a difficult task: there is no single cluster definition and the data can have more than one underlying structure. Pareto-based multi-objective genetic algorithms (e.g., MOCK Multi-Objective Clustering with automatic K-determination and MOCLE-Multi-Objective Clustering Ensemble) were proposed to tackle these problems. However, the output of such algorithms can often contains a high number of partitions, becoming difficult for an expert to manually analyze all of them. In order to deal with this problem, we present two selection strategies, which are based on the corrected Rand, to choose a subset of solutions. To test them, they are applied to the set of solutions produced by MOCK and MOCLE in the context of several datasets. The study was also extended to select a reduced set of partitions from the initial population of MOCLE. These analysis show that both versions of selection strategy proposed are very effective. They can significantly reduce the number of solutions and, at the same time, keep the quality and the diversity of the partitions in the original set of solutions. (C) 2010 Elsevier B.V. All rights reserved.", "paper_title": "Partitions selection strategy for set of clustering solutions", "paper_id": "WOS:000294092200003"}