{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "web_mining"}, {"score": 0.007024308496471717, "phrase": "website_data"}, {"score": 0.004632597963417253, "phrase": "increasing_information"}, {"score": 0.004422827355213055, "phrase": "valuable_source"}, {"score": 0.00415777266387528, "phrase": "research_method"}, {"score": 0.004125773078637226, "phrase": "innovation_studies"}, {"score": 0.003954109842050071, "phrase": "small_and_mid-size_enterprises"}, {"score": 0.0038485929962942776, "phrase": "additional_insights"}, {"score": 0.003702702337768558, "phrase": "publication_analysis"}, {"score": 0.0035761182400032487, "phrase": "enterprise_innovation_web_mining"}, {"score": 0.0035076666315744525, "phrase": "wide_range"}, {"score": 0.0034806529881619454, "phrase": "data_quality_dimensions"}, {"score": 0.0030401074516310184, "phrase": "conventional_data_sources"}, {"score": 0.003005039427642664, "phrase": "traditional_methods"}, {"score": 0.002947486683884831, "phrase": "early_phases"}, {"score": 0.0027386335451725762, "phrase": "innovation_process"}, {"score": 0.002644920521740564, "phrase": "alternative_data_sources"}, {"score": 0.0025445415633818472, "phrase": "search_strategies"}, {"score": 0.0025249264547573943, "phrase": "website_information"}, {"score": 0.0022222152430170254, "phrase": "significant_and_useful_complement"}, {"score": 0.0021461354559957234, "phrase": "novel_insights"}], "paper_keywords": ["Web mining", " Web scraping", " Innovation", " R&D"], "paper_abstract": "As enterprises expand and post increasing information about their business activities on their websites, website data promises to be a valuable source for investigating innovation. This article examines the practicalities and effectiveness of web mining as a research method for innovation studies. We use web mining to explore the R&D activities of 296 UK-based green goods small and mid-size enterprises. We find that website data offers additional insights when compared with other traditional unobtrusive research methods, such as patent and publication analysis. We examine the strengths and limitations of enterprise innovation web mining in terms of a wide range of data quality dimensions, including accuracy, completeness, currency, quantity, flexibility and accessibility. We observe that far more companies in our sample report undertaking R&D activities on their web sites than would be suggested by looking only at conventional data sources. While traditional methods offer information about the early phases of R&D and invention through publications and patents, web mining offers insights that are more downstream in the innovation process. Handling website data is not as easy as alternative data sources, and care needs to be taken in executing search strategies. Website information is also self-reported and companies may vary in their motivations for posting (or not posting) information about their activities on websites. Nonetheless, we find that web mining is a significant and useful complement to current methods, as well as offering novel insights not easily obtained from other unobtrusive sources.", "paper_title": "Use of web mining in studying innovation", "paper_id": "WOS:000347297400033"}