{"auto_keywords": [{"score": 0.02615976858273671, "phrase": "source_analogies"}, {"score": 0.015719716506582538, "phrase": "design_education"}, {"score": 0.012823704208987076, "phrase": "course_topics"}, {"score": 0.004578165674080246, "phrase": "engineering_design"}, {"score": 0.004507667881645218, "phrase": "existing_research"}, {"score": 0.00447282529270722, "phrase": "analogical_thinking"}, {"score": 0.00436989807912238, "phrase": "scientific_discourse"}, {"score": 0.004043541331944951, "phrase": "six_participants"}, {"score": 0.003996727479807572, "phrase": "graduate-level_design_course"}, {"score": 0.003612971658533784, "phrase": "divergent_thinking_tests"}, {"score": 0.0035297609635321203, "phrase": "significant_correlation"}, {"score": 0.0033170847930578473, "phrase": "effective_analog"}, {"score": 0.0031171827624599693, "phrase": "possible_links"}, {"score": 0.0026272523687965615, "phrase": "biomimetic_or_biologically_inspired_design"}, {"score": 0.002566685388128598, "phrase": "natural-language_search_approach"}, {"score": 0.00238392747425758, "phrase": "target_concepts"}, {"score": 0.0022841153001549193, "phrase": "possible_pedagogical_benefits"}, {"score": 0.0021715177915174375, "phrase": "elicited_analogies"}, {"score": 0.002137999646917136, "phrase": "improved_student_engagement"}], "paper_keywords": ["Analogies", " Biologically Inspired Design", " Design Education", " Natural-Language Search Approach"], "paper_abstract": "We aim to examine the potential of using analogies in design education and to compare the roles of analogies in explaining versus inspiring in engineering design. We review existing research in analogical thinking, with a focus on scientific discourse and education. Then we explore the role of analogies in design education in making concepts more relatable by asking six participants in a graduate-level design course to generate analogies for course topics. We describe criteria developed to evaluate the analogies and present these evaluations. We then asked participants to perform divergent thinking tests, but we found no significant correlation between these and analogy scores. The participants were also asked to reflect on what constitutes an effective analog, describe their process of identifying analogies, and provide their definitions of analogies. We describe possible links between these comments and the ratings of their analogies. We then draw on results in using analogies in pedagogy to inform and reflect on obstacles we encountered in the use of analogies to inspire. Specifically, we related them to our experience with biomimetic or biologically inspired design, where we used a natural-language search approach to identify relevant analogies. Three aspects discussed are familiarity of source analogies, boundaries of parallels between source analogies and target concepts, and concreteness of source analogies. Finally, we discuss possible pedagogical benefits of eliciting analogies on course topics from students, namely, using the elicited analogies as tools for improved student engagement as well as more prompt instructor feedback.", "paper_title": "Using analogies to explain versus inspire concepts", "paper_id": "WOS:000354032400002"}