{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "uml"}, {"score": 0.015229433384682895, "phrase": "multiobjective_combinatorial_optimization_problems"}, {"score": 0.004753674206954256, "phrase": "ocl"}, {"score": 0.004401955895933783, "phrase": "preliminary_feasibility_study"}, {"score": 0.0037024804835018373, "phrase": "constraint_satisfaction"}, {"score": 0.003298856341173034, "phrase": "approach-a_job_scheduling_problem"}, {"score": 0.002901627749562029, "phrase": "combinatorial_optimization_problems"}, {"score": 0.0026523079380037706, "phrase": "structural_constraints"}, {"score": 0.002568542343945288, "phrase": "procedural_constraints"}, {"score": 0.0023934306706217797, "phrase": "developed_translator"}, {"score": 0.002244596395352896, "phrase": "resulting_oz_program"}, {"score": 0.0021049977753042253, "phrase": "hand-written_benchmark_programs"}], "paper_keywords": ["Multi objective combinatorial optimization problem", " MOCOP", " UML", " OCL", " Code generation"], "paper_abstract": "This paper describes the results of a preliminary feasibility study of an approach to representing multiobjective combinatorial optimization problems in UML (structural constraints) and OCL (procedural constraints) and then automatically translating the representations to a constraint satisfaction solving language (Oz) for execution. The paper presents two examples of the application of the approach-a job scheduling problem and a (fixture) design problem. The main goal of this paper is to investigate directions towards a standard, graphical language for representing combinatorial optimization problems. The paper shows that for the two selected problems it is easy to represent structural constraints in UML and that procedural constraints are representable in OCL. The results also show that a developed translator automatically converts the UML/OCL representations to Oz and that the resulting Oz program performs very reasonably, in some cases outperforming the hand-written benchmark programs.", "paper_title": "Using UML and OCL for representing multiobjective combinatorial optimization problems", "paper_id": "WOS:000336223900012"}