{"auto_keywords": [{"score": 0.04957786067961377, "phrase": "italy"}, {"score": 0.01185052980111482, "phrase": "italian_researchers"}, {"score": 0.00481495049065317, "phrase": "academic_brain_drain"}, {"score": 0.004379737380744606, "phrase": "appropriate_policies"}, {"score": 0.004288472456976113, "phrase": "brain_drain"}, {"score": 0.003437387719239532, "phrase": "economic_and_social_situation"}, {"score": 0.0033480035183418642, "phrase": "strong_family_ties"}, {"score": 0.0030772505522663612, "phrase": "particular_differences"}, {"score": 0.0029972703400308097, "phrase": "north"}, {"score": 0.0028432828877281388, "phrase": "italian_academic_system"}, {"score": 0.0027547408718334603, "phrase": "greater_weight"}, {"score": 0.002711506442590442, "phrase": "italian_intellectual_talent"}, {"score": 0.002640947693258573, "phrase": "country's_higher_education_system"}, {"score": 0.002219040041886641, "phrase": "italian_skilled_agents"}, {"score": 0.0021049977753042253, "phrase": "country's_future_economic_development"}], "paper_keywords": [""], "paper_abstract": "To study the behavior of Italian researchers living in Italy with a view to creating appropriate policies to tackle the brain drain and discourage academics from weight in driving emigrating, we constructed a survey based on a sample of 4,700 Italian researchers (assistant professors) in several universities in Italy. The outlook is far from rosy: Italian researchers are generally dissatisfied with the economic and social situation of the country. Strong family ties represent the element keeping them at home in Italy. In this regard, no particular differences were noted between the North and South of the country. In analyzing the Italian academic system we identified factors that have greater weight in driving Italian intellectual talent to emigrate: the country's higher education system leaves all dissatisfied. Furthermore, we discovered other factors that, albeit weak, keep Italian researchers in Italy. However, one wonders how much longer family and national ties will be able to keep Italian skilled agents in Italy, and whether such dissatisfaction may jeopardize the country's future economic development.", "paper_title": "Geographical analysis of the academic brain drain in Italy", "paper_id": "WOS:000310230400011"}