{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "rough_sets"}, {"score": 0.012997537138228708, "phrase": "equivalence_relations"}, {"score": 0.004516443812513261, "phrase": "rough"}, {"score": 0.004386887374401584, "phrase": "mathematical_tool"}, {"score": 0.0042859292226559535, "phrase": "inexact_or_uncertain_knowledge"}, {"score": 0.003837089839193524, "phrase": "natural_extension"}, {"score": 0.003792657064634775, "phrase": "classical_rough_sets"}, {"score": 0.0034956560177000656, "phrase": "topological_concepts"}, {"score": 0.003129317057177867, "phrase": "covering_rough_sets"}, {"score": 0.003039445153076014, "phrase": "approximation_operations"}, {"score": 0.0029349892964423197, "phrase": "upper_approximation"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Approximation", " Covering", " Homomorphism", " Neighborhood", " Rough set"], "paper_abstract": "Rough set theory, a mathematical tool to deal with inexact or uncertain knowledge in information systems, has originally described the indiscernibility of elements by equivalence relations. Covering rough sets are a natural extension of classical rough sets by relaxing the partitions arising from equivalence relations to coverings. Recently, some topological concepts such as neighborhood have been applied to covering rough sets. In this paper, we further investigate the covering rough sets based on neighborhoods by approximation operations. We show that the upper approximation based on neighborhoods can be defined equivalently without using neighborhoods. To analyze the coverings themselves, we introduce unary and composition operations on coverings. A notion of homomorphism is provided to relate two covering approximation spaces. We also examine the properties of approximations preserved by the operations and homomorphisms, respectively. (C) 2010 Elsevier Inc. All rights reserved.", "paper_title": "Covering rough sets based on neighborhoods: An approach without using neighborhoods", "paper_id": "WOS:000288470100012"}