{"auto_keywords": [{"score": 0.03843856552198327, "phrase": "causal_environments"}, {"score": 0.015552696685207148, "phrase": "causal_multiagent_societies"}, {"score": 0.015142750835752153, "phrase": "collective_motion"}, {"score": 0.00481495049065317, "phrase": "strategy_diffusion"}, {"score": 0.004686688155058031, "phrase": "previous_work"}, {"score": 0.004440277230269978, "phrase": "behavior_strategies"}, {"score": 0.004392565073466714, "phrase": "higher_ranks"}, {"score": 0.003775803846431323, "phrase": "causal_links"}, {"score": 0.002656650588033728, "phrase": "favor-based_strategy_diffusion"}, {"score": 0.002599763359352916, "phrase": "proposed_model"}, {"score": 0.0022101055924375725, "phrase": "causal_relations"}, {"score": 0.0021745003291048356, "phrase": "real_world"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Multiagents", " Strategy decision", " Causal effects", " Favor", " Diffusion"], "paper_abstract": "In previous work on collective motion, agents always tend to imitate the behavior strategies of higher ranks; this model is called rank-based strategy diffusion. Unfortunately, this model is, by itself, insufficient in causal multiagent societies where agents may have causal links with each other. In causal environments, agents will develop positive (or negative) attitudes (favor) about those who can increase (or decrease) their own utilities. Naturally, for collective motion, agents will be inclined to imitate those who are well-favored and avoid those who are disfavored. This paper presents the concept of favor in causal environments, and presents a model for favor-based strategy diffusion. In the proposed model, agents in causal environments are inclined to associate with and imitate the strategies of those who are well-favored. Obviously, such diffusion effects well reflect the impact of causal relations in the real world. (C) 2010 Elsevier Ltd. All rights reserved.", "paper_title": "Favor-based decision: A novel approach to modeling the strategy diffusion in causal multiagent societies", "paper_id": "WOS:000286904600006"}