{"auto_keywords": [{"score": 0.04534993119848661, "phrase": "cmv"}, {"score": 0.019113939199011918, "phrase": "questionnaire-based_studies"}, {"score": 0.01061236610774788, "phrase": "method_bias"}, {"score": 0.004785682967399109, "phrase": "questionnaire-based_user_studies"}, {"score": 0.004656154865460475, "phrase": "reliability_problems"}, {"score": 0.004516323676817212, "phrase": "information_science"}, {"score": 0.004380673342749118, "phrase": "\"common_method_variance"}, {"score": 0.004009801352242071, "phrase": "existing_tools"}, {"score": 0.0038538647865057757, "phrase": "cronbach's_alpha"}, {"score": 0.003818749043451196, "phrase": "harman"}, {"score": 0.0037380370652211315, "phrase": "lindell_and_whitney's"}, {"score": 0.003614628722984226, "phrase": "illustrative_case_study"}, {"score": 0.003527434895463077, "phrase": "web_searching"}, {"score": 0.0033901931552297792, "phrase": "questionnaire-based_approach"}, {"score": 0.0033592853947137127, "phrase": "-_cmv"}, {"score": 0.0032582736131450316, "phrase": "social_and_information_science"}, {"score": 0.003228564642402843, "phrase": "questionnaire_items"}, {"score": 0.003065243071851165, "phrase": "widely_used_cronbach_alpha_measure"}, {"score": 0.002866053420470349, "phrase": "high_alpha_score"}, {"score": 0.002704445718144686, "phrase": "harman's_single_factor_test"}, {"score": 0.002655324730688008, "phrase": "sufficient_foundation"}, {"score": 0.002544141963686395, "phrase": "marker_variable_approach"}, {"score": 0.002520927983744567, "phrase": "useful_option"}, {"score": 0.0024153589988125303, "phrase": "practical_implications"}, {"score": 0.002371476222721094, "phrase": "questionnaire-based_work"}, {"score": 0.0023000987455816593, "phrase": "high_likelihood"}, {"score": 0.0021049977753042253, "phrase": "cmv."}], "paper_keywords": ["Research methods", " Tests and testing", " Variance"], "paper_abstract": "Purpose - This paper seeks to discuss reliability problems associated with questionnaires, commonly employed in library and information science. It aims to focus on the effects of \"common method variance\" (CMV), which is a form of bias, and ways of countering these effects. Design/methodology/approach - The paper critically reviews the use of existing tools for demonstrating reliability in questionnaire-based studies. In particular, it focuses on Cronbach's alpha, \"Harman's single factor test\" and Lindell and Whitney's \"marker variable\" approach. The paper introduces an illustrative case study based on the work on metacognition and web searching. It goes on to make recommendations for researchers considering using a questionnaire-based approach. Findings - CMV is a problem affecting questionnaire-based studies in different disciplines across social and information science. Where questionnaire items are more abstract, CMV has been found to be more of a problem. The widely used Cronbach alpha measure, of the reliability of a questionnaire, may often be affected by CMV. Where method bias dominates the results, a high alpha score may do no more than indicate that the questionnaire consistently allows participants to accede to their biases. \"Harman's single factor test\" is criticised as lacking sufficient foundation, and it is concluded that it should not be used. The marker variable approach is a useful option but must be applied with caution. Practical implications - A number of practical implications for researchers are drawn. Questionnaire-based work investigating abstract constructs should be assumed to carry a high likelihood of CMV, and therefore should attempt to avoid it and demonstrate the degree of success in this regard. Otherwise, interpretation of the results should assume CMV. A number of approaches to assessing and isolating CMV are discussed. Originality/value - The paper draws attention to a problem that is arguably often overlooked in questionnaire-based studies, namely method bias. It discusses a number of approaches whereby it may be identified and controlled.", "paper_title": "Countering method bias in questionnaire-based user studies", "paper_id": "WOS:000291373700007"}