{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "parafac_model"}, {"score": 0.004585433265422727, "phrase": "trilinear_parafac_model"}, {"score": 0.004529776351030488, "phrase": "three-way_array"}, {"score": 0.004366808573435364, "phrase": "available_methods"}, {"score": 0.004141663280057689, "phrase": "swatld"}, {"score": 0.003912112659326054, "phrase": "general_terms"}, {"score": 0.003635503288514593, "phrase": "different_methods"}, {"score": 0.0035767311154996464, "phrase": "artificial_data"}, {"score": 0.0035189057079817285, "phrase": "varying_level"}, {"score": 0.0031780228058373235, "phrase": "correct_number"}, {"score": 0.0029053904956617043, "phrase": "different_approaches"}, {"score": 0.0027666443986705453, "phrase": "extracted_components"}, {"score": 0.0024781515864648242, "phrase": "exceeding_number"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["PARAFAC", " ALS", " SWATLD", " PMF3", " Levenberg-Marquadt"], "paper_abstract": "A multitude of algorithms have been developed to fit a trilinear PARAFAC model to a three-way array. Limits and advantages of some of the available methods (i.e. GRAM-DTLD, PARAFAC-ALS, ASD, SWATLD, PMF3 and dGN) are compared. The algorithms are explained in general terms together with two approaches to accelerate them: line search and compression. In order to compare the different methods, 720 sets of artificial data were generated with varying level and type of noise, collinearity of the factors and rank. Two PARAFAC models were fitted on each data set: the first having the correct number of factors F and the second with F + 1 components (the objective being to assess the sensitivity of the different approaches to the over-factoring problem, i.e. when the number of extracted components exceeds the rank of the array). The algorithms have also been tested on two real data sets of fluorescence measurements, again by extracting both the right and an exceeding number of factors. The evaluations are based on: number of iterations necessary to reach convergence, time consumption, quality of the solution and amount of resources required for the calculations (primarily memory). (C) 2005 Elsevier B.V. All rights reserved.", "paper_title": "A comparison of algorithms for fitting the PARAFAC model", "paper_id": "WOS:000235025900004"}