{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "scientific_research_output"}, {"score": 0.004300951511110487, "phrase": "published_research_output"}, {"score": 0.004204904449336037, "phrase": "ajiferuke_and_wolfram"}, {"score": 0.004055652445791872, "phrase": "international_society"}, {"score": 0.0035414658322295515, "phrase": "general_group"}, {"score": 0.0035095935622207956, "phrase": "scientific_publications"}, {"score": 0.0034780071331554003, "phrase": "ch_publications"}, {"score": 0.003294350220187021, "phrase": "different_citers"}, {"score": 0.003249966782844541, "phrase": "basic_difference"}, {"score": 0.003206179381953766, "phrase": "classical_h"}, {"score": 0.002915701586760994, "phrase": "different_citing_authors"}, {"score": 0.0027741761880779535, "phrase": "received_citations"}, {"score": 0.0025113494092413604, "phrase": "large_sample"}, {"score": 0.002367875199095903, "phrase": "novel_indicator's_characteristics"}, {"score": 0.0021049977753042253, "phrase": "recurrent_citers"}], "paper_keywords": ["Hirsch index", " Citers", " Citing authors", " Citations", " Bibliometrics", " Self-citation", " Recurrent citers"], "paper_abstract": "This paper focuses the attention on the ch-index, a recent bibliometric indicator similar to the Hirsch (h) index, to evaluate the published research output of a scientist (Ajiferuke and Wolfram, Proceedings of the 12th international conference of the international society for scientometrics and informetrics. Rio de Janeiro, pp. 798-808, 2009). Ch-index is defined as the number such that, for a general group of scientific publications, ch publications are cited by at least ch different citers while the other publications are cited by no more than ch different citers. The basic difference from the classical h is that, according to ch, the diffusion of one author's publication is evaluated on the basis of the number of different citing authors (or citers), rather than the number of received citations. The goal of this work is to discuss the pros and cons of ch and identify its connection with h. A large sample of scientists in the Quality Engineering/Management field are analyzed so as to investigate the novel indicator's characteristics. Then, the analysis is preliminarily extended to other scientific disciplines. The most important result is that ch is almost insensitive to self-citations and/or citations made by recurrent citers, and it can be profitably used for complementing h.", "paper_title": "Analysis of the ch-index: an indicator to evaluate the diffusion of scientific research output by citers", "paper_id": "WOS:000280947400016"}