{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "portable_orbital_sanders"}, {"score": 0.004646852519870358, "phrase": "work-related_musculoskeletal_disorders"}, {"score": 0.00450456611645112, "phrase": "wood_furniture_industry"}, {"score": 0.004444921827311577, "phrase": "strong_presence"}, {"score": 0.004405740419157745, "phrase": "canada"}, {"score": 0.00421410521089045, "phrase": "extensive_number"}, {"score": 0.004176813329075736, "phrase": "manual_tasks"}, {"score": 0.003942299471749811, "phrase": "health_and_safety_risk_factors"}, {"score": 0.003770869401884267, "phrase": "awkward_postures"}, {"score": 0.003737485125097945, "phrase": "repetitive_movements"}, {"score": 0.0036553070575015344, "phrase": "undue_force"}, {"score": 0.0035118972210075633, "phrase": "workers'_exposure"}, {"score": 0.0032129675521135616, "phrase": "specific_occupational_disease"}, {"score": 0.0030595112110658675, "phrase": "risk_factor"}, {"score": 0.0027495914857929584, "phrase": "furniture_parts"}, {"score": 0.002395166073437286, "phrase": "acceptable_levels"}, {"score": 0.0023633857274905977, "phrase": "recognized_standards"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["WMSD", " Ergonomics", " Vibration", " Orbital sanders"], "paper_abstract": "The wood furniture industry has a strong presence in Canada, where it employs over 100,000 workers. Because of the extensive number of manual tasks required in this industry, several studies have been undertaken to characterize the health and safety risk factors to which these workers are exposed, such as awkward postures, repetitive movements and the application of undue force. However, very little research has been done on workers' exposure to vibration from portable orbital sanders, one of the most common tools used in this industry. Vibration is responsible for a specific occupational disease called vibration syndrome, but is also recognized as a risk factor that increases the prevalence of more common work-related musculoskeletal disorders (WMSDs). This study proposed to determine the level of vibration to which sanders of furniture parts are exposed, and to analyze its impact on the risk of WMSDs. The results show that the level of vibration to which the workers are exposed is well above acceptable levels defined by recognized standards and directives and that this vibration is combined with many other risk factors, thus representing a risk for the development of WMSDs. (c) 2011 Elsevier Ltd. All rights reserved.", "paper_title": "Vibration of portable orbital sanders and its impact on the development of work-related musculoskeletal disorders in the furniture industry", "paper_id": "WOS:000302432300012"}