{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "hot_melt_adhesives"}, {"score": 0.004650086856905758, "phrase": "one's_own_body_structures"}, {"score": 0.004424268136268051, "phrase": "biological_systems"}, {"score": 0.004251500979153001, "phrase": "significant_challenge"}, {"score": 0.004209369306023422, "phrase": "robotic_systems"}, {"score": 0.003661382948704217, "phrase": "robotic_body"}, {"score": 0.003553540530701019, "phrase": "temperature_dependent_adhesiveness_and_bonding_strength"}, {"score": 0.003380791705551809, "phrase": "passive_external_objects"}, {"score": 0.0033306180744375616, "phrase": "robot's_own_body_structures"}, {"score": 0.0031061129850110994, "phrase": "elementary_configurations"}, {"score": 0.0028822890425197582, "phrase": "proposed_method"}, {"score": 0.002797329638474873, "phrase": "extension_limit"}, {"score": 0.0027420820738468577, "phrase": "mechanical_properties"}, {"score": 0.002595698433525986, "phrase": "five-axis_robot_manipulator"}], "paper_keywords": ["Biologically-inspired robots", " Reconfigurable robots", " Flexible arms", " Flexible manufacturing"], "paper_abstract": "The ability to physically enlarge one's own body structures plays an important role in robustness and adaptability of biological systems. It is, however, a significant challenge for robotic systems to autonomously extend their bodies. To address this challenge, this paper presents an approach using hot melt adhesives (HMAs) to assemble and integrate extensions into the robotic body. HMAs are thermoplastics with temperature dependent adhesiveness and bonding strength. We exploit this property of HMAs to connect passive external objects to the robot's own body structures, and investigate the characteristics of the approach. In a set of elementary configurations, we analyze to which extent a robot can self-reconfigure using the proposed method. We found that the extension limit depends on the mechanical properties of the extension, and the reconfiguration algorithm. A five-axis robot manipulator equipped with specialized HMA handling devices is employed to demonstrate these findings in four experiments. It is shown that the robot can construct and integrate extensions into its own body, which allow it to solve tasks that it could not achieve in its initial configuration.", "paper_title": "An extendible reconfigurable robot based on hot melt adhesives", "paper_id": "WOS:000354267000005"}