{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "fluid-filled_cylinder"}, {"score": 0.04621807134587006, "phrase": "stagnation_ring"}, {"score": 0.04511623972752651, "phrase": "slower_rotating_endwall"}, {"score": 0.037011009195315615, "phrase": "merged-cell_patterns"}, {"score": 0.004174929128880472, "phrase": "two-cell_flow_pattern"}, {"score": 0.003953256858638655, "phrase": "ekman_boundary_layer"}, {"score": 0.003696460568091852, "phrase": "two-cell_patterns"}, {"score": 0.003398714712611042, "phrase": "differently_counter-rotating_manner"}, {"score": 0.0030089355635315005, "phrase": "bottom_endwalls"}, {"score": 0.0027317585060414253, "phrase": "ekman_layer_separation"}, {"score": 0.0026975346834867313, "phrase": "\"vortex_breakdown_bubble"}, {"score": 0.0026525671788921205, "phrase": "unique_characteristics"}, {"score": 0.002586513876943306, "phrase": "cell_pattern"}, {"score": 0.002500987934534128, "phrase": "counter_rotation-rate_ratios"}, {"score": 0.0024182831453515782, "phrase": "reynolds_number"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": [""], "paper_abstract": "For the flow driven by the counter-rotation between the top and bottom endwalls in a fluid-filled cylinder, a stagnation ring can be observed on the slower rotating endwall in experiment. Its appearance corresponds to a two-cell flow pattern in the meridional plane, where a flow separation forms in the Ekman boundary layer. In this paper we numerically show that, in addition to the single-cell and two-cell patterns previously studied, there exist more complex cell patterns, namely, three-cell and merged-cell patterns, when the flow is driven under differently counter-rotating manner that is realized between the top and bottom endwalls as a whole against the side-wall. Such a counter-rotating flow makes the stagnation ring to appear simultaneously on both top and bottom endwalls rather than just on the slower rotating endwall. Moreover, the three-cell and merged-cell patterns, which are formed by a combination of the Ekman layer separation with the \"vortex breakdown bubble\", are unique characteristics. The appearance of the cell pattern and stagnation ring is primarily decided by the counter rotation-rate ratios, but is also affected by the Reynolds number Re and height-to-radius aspect ratio A, so a cell-pattern zone and a stagnation ring zone are proposed numerically as a function of s and Re for a given A. (c) 2007 Elsevier Ltd. All rights reserved.", "paper_title": "Cell pattern and stagnation ring of the flow driven by the counter-rotation in a fluid-filled cylinder", "paper_id": "WOS:000251754300005"}