{"auto_keywords": [{"score": 0.019303948601859914, "phrase": "multigranulation_rough_set"}, {"score": 0.007740489563401459, "phrase": "rough_set_theory"}, {"score": 0.004537631845923196, "phrase": "new_direction"}, {"score": 0.0043863636475983845, "phrase": "multiple_binary_relations"}, {"score": 0.004240116703465252, "phrase": "existing_literature"}, {"score": 0.0039823955673875, "phrase": "binary_mapping"}, {"score": 0.003928572641266562, "phrase": "good_deal"}, {"score": 0.0038953958723049287, "phrase": "practical_decision_making"}, {"score": 0.003639835714755229, "phrase": "rough_approximation"}, {"score": 0.0034886660821793576, "phrase": "multigranulation_space"}, {"score": 0.0034445472801689046, "phrase": "different_mappings"}, {"score": 0.003204841443605308, "phrase": "optimistic_multigranulation_rough_set"}, {"score": 0.0031777570808834213, "phrase": "pessimistic_multigranulation_rough_set"}, {"score": 0.0031375577552605533, "phrase": "precision_multigranulation"}, {"score": 0.0029565620771207003, "phrase": "different_real-world_decision-making_problem"}, {"score": 0.0026475981474045414, "phrase": "existing_models"}, {"score": 0.0023408288327263316, "phrase": "uncertainty_measurement"}, {"score": 0.0021229583685841405, "phrase": "practical_decision_problems"}, {"score": 0.0021049977753042253, "phrase": "management_science"}], "paper_keywords": ["Rough set", " rough set over two universes", " multigranulation", " measures", " Granular computing"], "paper_abstract": "Recently, a multigranulation rough set (MGRS) has become a new direction in rough set theory, which is based on multiple binary relations on the universe of discourse. The existing literature about multigranulation rough set is based on the assumption of the same universe. In reality, however, a good deal of practical decision making may relate to the possibility of two or more different universes. In this paper, we consider the rough approximation of a given concept over two different universes with respect to the multigranulation space formed by different mappings of the two universes, i.e., the multigranulation rough set model. We respectively define the optimistic multigranulation rough set, pessimistic multigranulation rough set and variable precision multigranulation rough set over two universes, each of which can be appropriate to a different real-world decision-making problem in management science. Then several important properties of these models are discussed in detail. Also, the relationship between the multigranulation rough set over two universes and the existing models in the literature is investigated. At last, the entropy and granularity of the binary mapping between two different universes are defined, and then we give an approach to uncertainty measurement based on the granularity of binary mapping for multigranulation rough set over two universes. The multigranulation rough set model over two universes provides a new, effective approach for practical decision problems in management science.", "paper_title": "Multigranulation rough set theory over two universes", "paper_id": "WOS:000349834500026"}