{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "mpu_implicit_models"}, {"score": 0.0101108045162826, "phrase": "contour_data"}, {"score": 0.0037989951856280423, "phrase": "multi-level_partition"}, {"score": 0.0037121219471894463, "phrase": "mpu"}, {"score": 0.003306559295382181, "phrase": "normal_information"}, {"score": 0.002861160152640875, "phrase": "delineation_process"}, {"score": 0.0027795345823932406, "phrase": "superior_approach"}, {"score": 0.00270023138867066, "phrase": "contour-based_surface_reconstruction"}, {"score": 0.0024899850926034567, "phrase": "adaptive_implicit_functions"}, {"score": 0.002377260665147444, "phrase": "controllable_error"}, {"score": 0.0022048406330100697, "phrase": "example_datasets"}, {"score": 0.002141898874982106, "phrase": "error_statistics"}], "paper_keywords": ["surface reconstruction", " contours", " implicit models", " multi-level partition of unity", " normal estimation"], "paper_abstract": "This paper presents a technique for creating a smooth, closed surface from a set of 2D contours, which have been extracted from a 3D scan. The technique interprets the pixels that make up the contours as points in R-3 and employs multi-level partition of unity (MPU) implicit models to create a surface that approximately fits to the 3D points. Since MPU implicit models additionally require surface normal information at each point, an algorithm that estimates normals from the contour data is also described. Contour data frequently contains noise from the scanning and delineation process. MPU implicit models provide a superior approach to the problem of contour-based surface reconstruction, especially in the presence of noise, because they are based on adaptive implicit functions that locally approximate the points within a controllable error bound. We demonstrate the effectiveness of our technique with a number of example datasets, providing images and error statistics generated from our results. (c) 2006 Elsevier Inc. All rights reserved.", "paper_title": "Contour-based surface reconstruction using MPU implicit models", "paper_id": "WOS:000244258400004"}