{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "convolutional_deep_belief_networks"}, {"score": 0.015434731030951538, "phrase": "frequency_domain"}, {"score": 0.004444037594955185, "phrase": "deep_learning"}, {"score": 0.004178198896815672, "phrase": "training_methods"}, {"score": 0.0037621210719690594, "phrase": "image_classification_problems"}, {"score": 0.003515162360861593, "phrase": "efficient_training"}, {"score": 0.0032240802202623316, "phrase": "time-consuming_calculation"}, {"score": 0.0031260524791486347, "phrase": "essential_consideration"}, {"score": 0.002814454488050123, "phrase": "frequency_space"}, {"score": 0.0027120400060701034, "phrase": "running_time_improvements"}, {"score": 0.0021845387990972543, "phrase": "new_directions"}, {"score": 0.0021049977753042253, "phrase": "medical_image_analysis"}], "paper_keywords": [""], "paper_abstract": "Deep learning has traditionally been computationally expensive, and advances in training methods have been the prerequisite for improving its efficiency in order to expand its application to a variety of image classification problems. In this letter, we address the problem of efficient training of convolutional deep belief networks by learning the weights in the frequency domain, which eliminates the time-consuming calculation of convolutions. An essential consideration in the design of the algorithm is to minimize the number of transformations to and from frequency space. We have evaluated the running time improvements using two standard benchmark data sets, showing a speed-up of up to 8times on 2D images and up to 200times on 3D volumes. Our training algorithm makes training of convolutional deep belief networks on 3D medical images with a resolution of up to 128 x 128 x 128 voxels practical, which opens new directions for using deep learning for medical image analysis.", "paper_title": "Efficient Training of Convolutional Deep Belief Networks in the Frequency Domain for Application to High-Resolution 2D and 3D Images", "paper_id": "WOS:000346762700009"}