{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "n_k-bit_numbers"}, {"score": 0.004527619017250708, "phrase": "n_numbers"}, {"score": 0.004371160978838441, "phrase": "fundamental_arithmetic_operation"}, {"score": 0.003985602342418578, "phrase": "hardware_description_language_level"}, {"score": 0.0038989120088094185, "phrase": "previous_works"}, {"score": 0.0034168317227203206, "phrase": "timing_complexity"}, {"score": 0.0030608148631528767, "phrase": "synthesis_results"}, {"score": 0.002600661525224505, "phrase": "area_efficiency"}, {"score": 0.0025778546800417808, "phrase": "area-timing_product"}, {"score": 0.0025217452298077945, "phrase": "atp"}], "paper_keywords": ["Automatic synthesis", " hardware description languages", " high-speed arithmetic", " parallel circuits"], "paper_abstract": "Finding the value and/or index of the maximum (or minimum) element of a set of n numbers (each with k-bits) is a fundamental arithmetic operation and is needed in many applications. This paper proposes several maximum-finder (or minimum-finder) circuit topologies, which are parallel. We wrote circuit generators at hardware description language level for our topologies and previous works. Then we synthesized these circuits for 20 different (n, k) cases (with values up to 64) and compared their efficiency in timing (latency), area, and energy. The timing complexity of our fastest topology is O(log n + log k), whereas the fastest in the literature is O(log n log k). The synthesis results showed that our fastest topology is 1.2-2.2 times (1.6 times on the average) faster than the state-of-the-art. In this paper, we argue that a more fair metric of area efficiency is area-timing product. In terms of ATP, our proposed topologies are better than the state-of-the-art in 19 out of the 20 cases. In terms of energy (i.e., power-timing product, abbreviated as PTP), we are better in 11 cases out of 20.", "paper_title": "Fast and Efficient Circuit Topologies for Finding the Maximum of n k-Bit Numbers", "paper_id": "WOS:000341523800003"}