{"auto_keywords": [{"score": 0.04885877600670675, "phrase": "np"}, {"score": 0.00481495049065317, "phrase": "symmetric_boolean_parity_holant_problems."}, {"score": 0.00443308765153716, "phrase": "local_constraints"}, {"score": 0.004060350364088702, "phrase": "polynomial_time_computable"}, {"score": 0.003441352119167824, "phrase": "constraint_satisfaction_problems"}, {"score": 0.0032510690712452147, "phrase": "additional_restrictions"}, {"score": 0.003151736708029235, "phrase": "dichotomy_result"}, {"score": 0.0030712749385664686, "phrase": "holant_problems"}, {"score": 0.0027982016314450717, "phrase": "pivotal_roles"}, {"score": 0.002726740692380339, "phrase": "complexity_theory"}, {"score": 0.0026297428083782875, "phrase": "dichotomy_theorem"}, {"score": 0.002298649369775623, "phrase": "special_properties"}, {"score": 0.00226322835801988, "phrase": "class_circle"}, {"score": 0.0021049977753042253, "phrase": "corresponding_questions"}], "paper_keywords": ["complexity", " parity", " dichotomy theorem", " parity Holant problems"], "paper_abstract": "For certain subclasses of NP, circle plus P, or #P characterized by local constraints, it is known that if there exist any problems within that subclass that are not polynomial time computable, then all the problems in the subclass are NP-complete, circle plus P-complete, or #P-complete. Such dichotomy results have been proved for characterizations such as constraint satisfaction problems and directed and undirected graph homomorphism problems, often with additional restrictions. Here we give a dichotomy result for the more expressive framework of Holant problems. For example, these additionally allow for the expression of matching problems, which have had pivotal roles in the development of complexity theory. As our main result we prove the dichotomy theorem that, for the class circle plus P, every set of symmetric Holant signatures of any arities that is not polynomial time computable is circle plus P-complete. The result exploits some special properties of the class circle plus P and characterizes four distinct tractable subclasses within circle plus P. It leaves open the corresponding questions for NP, #P, and #P-k for k not equal 2.", "paper_title": "THE COMPLEXITY OF SYMMETRIC BOOLEAN PARITY HOLANT PROBLEMS", "paper_id": "WOS:000315579100013"}