{"auto_keywords": [{"score": 0.04738394862252203, "phrase": "markov_models"}, {"score": 0.00481495049065317, "phrase": "repairable_fault-tolerant_computer_systems"}, {"score": 0.0046776367107079315, "phrase": "dependability_attributes"}, {"score": 0.004647655812642494, "phrase": "fault-tolerant_computer_systems"}, {"score": 0.004428812979024961, "phrase": "well-known_state_space_explosion_problem"}, {"score": 0.004288648163837944, "phrase": "repairable_fault-tolerant_systems"}, {"score": 0.004220231044214606, "phrase": "dependability_measures"}, {"score": 0.004073515217375164, "phrase": "system_failure_event"}, {"score": 0.004047390637093383, "phrase": "importance_sampling"}, {"score": 0.003710617461965516, "phrase": "failure_transition_distance_concept"}, {"score": 0.003412738820791168, "phrase": "so-called_failure_transition_distances"}, {"score": 0.0032309820601312787, "phrase": "previously_proposed_measure-specific_simulation_method"}, {"score": 0.0031386977609818736, "phrase": "optimization_method"}, {"score": 0.003078639412163634, "phrase": "importance_sampling_schemes"}, {"score": 0.0029810774705309536, "phrase": "steady-state_unavailability"}, {"score": 0.002961938159281582, "phrase": "failure_transition_distance_biasing"}, {"score": 0.0026891227034884536, "phrase": "numerical_experiments"}, {"score": 0.0026207039474589, "phrase": "unbalanced_fault-tolerant_systems"}, {"score": 0.00260387228762141, "phrase": "balanced_failure_transition_distance_biasing"}, {"score": 0.0025458060790109647, "phrase": "balanced_failure_biasing"}, {"score": 0.0024970641749396784, "phrase": "failure_transition_distance-based_importance_sampling_schemes"}, {"score": 0.002402355431422709, "phrase": "minimal_failure"}, {"score": 0.0023037942361136205, "phrase": "small_cardinality"}, {"score": 0.0022816284181888646, "phrase": "minimal_failure_cover"}, {"score": 0.0022307321581833918, "phrase": "failure_bags"}, {"score": 0.0021254512976941644, "phrase": "failure_bag"}, {"score": 0.0021049977753042253, "phrase": "non-empty_bag"}], "paper_keywords": ["fault-tolerant computer systems", " importance sampling", " Markov models", " rare event simulation", " steady-state availability", " variance reduction"], "paper_abstract": "Markov models are often used to evaluate dependability attributes of fault-tolerant computer systems. The use in practice of Markov models is, however, hampered by the well-known state space explosion problem. Simulation alleviates the problem. For Markov models of repairable fault-tolerant systems, standard simulation of dependability measures tends to be expensive due to the rarity of the system failure event. Importance sampling can speed up the simulation. This paper develops two importance sampling schemes, called failure transition distance biasing & balanced failure transition distance biasing, which exploit the failure transition distance concept in an attempt to improve the efficiency of two other schemes, failure biasing & and balanced failure biasing. The schemes require the computation of the so-called failure transition distances, and procedures to perform those computations are developed. The presentation is tied to a previously proposed measure-specific simulation method for the steady-state unavailability. An optimization method of the parameters of the importance sampling schemes is also developed. For the simulation of the steady-state unavailability, failure transition distance biasing has (as failure biasing) the bounded relative error property for balanced fault-tolerant systems & balanced failure transition distance biasing has, (as balanced failure biasing) the bounded relative error property for both balanced & unbalanced fault-tolerant systems. It is proved that, for balanced fault-tolerant systems, both failure transition distance biasing & balanced failure transition distance biasing can indeed improve the efficiency of failure biasing & balanced failure biasing. In addition, numerical experiments seem,to indicate that, for unbalanced fault-tolerant systems, balanced failure transition distance biasing can also improve the efficiency of balanced failure biasing. The application of the failure transition distance-based importance sampling schemes is, however, limited to systems not having too many minimal failure covers, or, at least, not having too many minimal failure covers of small cardinality. A minimal failure cover is a minimal. bag of failure bags such that the failure of its components implies the failure of the system; a failure bag is any non-empty bag of component classes which can fail simultaneously.", "paper_title": "Failure transition distance-based importance sampling schemes for the simulation of repairable fault-tolerant computer systems", "paper_id": "WOS:000238195400006"}