{"auto_keywords": [{"score": 0.043473048044295366, "phrase": "australia"}, {"score": 0.036133284151761806, "phrase": "management_decisions"}, {"score": 0.03422803531429602, "phrase": "key_components"}, {"score": 0.004663636232080366, "phrase": "decision_support_tools"}, {"score": 0.004271490815763164, "phrase": "education_resource"}, {"score": 0.004187049198138107, "phrase": "new_south_wales"}, {"score": 0.003669941438286456, "phrase": "sustainable_management"}, {"score": 0.0034016119212097826, "phrase": "coastal_lakes"}, {"score": 0.0031402604946939743, "phrase": "complex_problem"}, {"score": 0.0028076592725295646, "phrase": "potential_impacts"}, {"score": 0.002730150696072947, "phrase": "coastal_lake_system"}, {"score": 0.0026760974046034854, "phrase": "catchment_components"}, {"score": 0.0025405019456703325, "phrase": "case_study"}, {"score": 0.0024901940672239784, "phrase": "merimbula_lake"}, {"score": 0.0024604876113911173, "phrase": "east_coast"}, {"score": 0.002373472641477602, "phrase": "bdn_approach"}, {"score": 0.0022804119741572327, "phrase": "dst"}, {"score": 0.0021821915946356168, "phrase": "integrative_method"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Coastal Lake Assessment and Management (CLAM)", " Bayesian decision network", " integrated management"], "paper_abstract": "Decision Support Tools (DSTs) are designed to assist in making more informed management decisions, through prediction of the outcomes from various future scenarios and as an education resource. The many coastal lakes in New South Wales, Australia are areas where DSTs are able to assist in making management and planning decisions. A variety of economic, ecological and social demands on the lakes and their catchment's finite resources are increasing conflict over their use and sustainable management. The issues are intricately linked, so that understanding trade-off's and making management decisions about coastal lakes and their catchments requires knowledge of the processes and interactions between all key components of the system. This is a complex problem requiring the integration of, often minimal, information, from various disciplines. This paper describes an approach for developing a DST to provide information about the potential impacts of management decisions on key components of a coastal lake system. Integration of the catchment components was completed using a Bayesian Decision Network (BDN). This paper uses a case study of a DST for Merimbula Lake on the east coast of Australia to illustrate the strengths of the BDN approach, and to show how the design of the DST helps to address some of the limitations inherent in the integrative method. (C) 2008 IMACS. Published by Elsevier B.V. All rights reserved.", "paper_title": "Integration modelling and decision support: A case study of the Coastal Lake Assessment and Management (CLAM) tool", "paper_id": "WOS:000256542000032"}