{"auto_keywords": [{"score": 0.037136664202598466, "phrase": "unfamiliar_visualization"}, {"score": 0.00481495049065317, "phrase": "visual_literacy"}, {"score": 0.004476399615305783, "phrase": "unfamiliar_visualizations"}, {"score": 0.004284755353695709, "phrase": "unfamiliar_visualization_method"}, {"score": 0.0037392451233558234, "phrase": "gradual_manner"}, {"score": 0.003631671435460452, "phrase": "textual_description"}, {"score": 0.003493021648360933, "phrase": "purely_visual_means"}, {"score": 0.002917331114260319, "phrase": "commutative_i.e._any_member"}, {"score": 0.0026986685585382347, "phrase": "new_paradigm"}, {"score": 0.0026466064623118105, "phrase": "effective_teaching_tool"}, {"score": 0.0025578967205807843, "phrase": "unfamiliar_visualization_methods"}, {"score": 0.002286781334850213, "phrase": "familiar_counterpart"}, {"score": 0.0022101055924375725, "phrase": "visualization_pairings"}, {"score": 0.0021049977753042253, "phrase": "associated_transition_strategies"}], "paper_keywords": ["Animation", " education", " information visualization", " literacy", " interaction", " multivariate visualization"], "paper_abstract": "We propose the concept of teaching (and learning) unfamiliar visualizations by analogy, that is, demonstrating an unfamiliar visualization method by linking it to another more familiar one, where the in-betweens are designed to bridge the gap of these two visualizations and explain the difference in a gradual manner. As opposed to a textual description, our morphing explains an unfamiliar visualization through purely visual means. We demonstrate our idea by ways of four visualization pair examples: data table and parallel coordinates, scatterplot matrix and hyperbox, linear chart and spiral chart, and hierarchical pie chart and treemap. The analogy is commutative i.e. any member of the pair can be the unfamiliar visualization. A series of studies showed that this new paradigm can be an effective teaching tool. The participants could understand the unfamiliar visualization methods in all of the four pairs either fully or at least significantly better after they observed or interacted with the transitions from the familiar counterpart. The four examples suggest how helpful visualization pairings be identified and they will hopefully inspire other visualization morphings and associated transition strategies to be identified.", "paper_title": "Learning Visualizations by Analogy: Promoting Visual Literacy through Visualization Morphing", "paper_id": "WOS:000358916100004"}