{"auto_keywords": [{"score": 0.03286246611787239, "phrase": "membership_values"}, {"score": 0.00481495049065317, "phrase": "descriptive_multifactor_multivariate_data_analysis._example_featuring_quantitative_and_qualitative_time_variables_in_car"}, {"score": 0.004548939310612501, "phrase": "preliminary_data_analysis"}, {"score": 0.0044896599221451216, "phrase": "multifactor_and_multivariate_databases"}, {"score": 0.004450600599096889, "phrase": "pda"}, {"score": 0.0042415434489566995, "phrase": "general_case"}, {"score": 0.0041316803676012155, "phrase": "hyperparallelepipedic_structure"}, {"score": 0.003920384090110374, "phrase": "measurement_variables"}, {"score": 0.0035918768194006735, "phrase": "space_windowing"}, {"score": 0.0033197446406648626, "phrase": "usual_statistical_indicators"}, {"score": 0.0027140798043053986, "phrase": "multiple_correspondence_analysis"}, {"score": 0.0026904239949144516, "phrase": "mca"}, {"score": 0.0026091594819333654, "phrase": "didactic_example"}, {"score": 0.0023902621773166963, "phrase": "widespread_use"}, {"score": 0.0021610874773389096, "phrase": "statistical_tests"}], "paper_keywords": ["Data analysis", " data mining", " multivariate statistics", " multiple correspondence analysis", " fuzzy coding", " car driving"], "paper_abstract": "This paper explains the pivotal part played by space windowing within Preliminary Data Analysis originating from MultiFactor and MultiVariate databases (PDA-MFMV). The explanation is based on the general case of a database featuring a hyperparallelepipedic structure in which the directions correspond to the factors and where the measurement variables may be either quantitative or qualitative, temporal or non-temporal, and objective or subjective. The space windowing (SW) approach hereby described in this article is less information reducing than most basic summarizing procedures without windowing using usual statistical indicators. First, the data in each cell of the hyperparallelepiped is transformed into membership values to be averaged over factors, such as time or individuals. Then, several graphic techniques can be made use of in order to investigate membership values. In this paper, Multiple Correspondence Analysis (MCA) has been chosen. A didactic example concerning car driving with four factors and 11 time variables (one being qualitative) is used in order to illustrate the widespread use of the \"SW/MCA\" pair, fuzzy time windowing being also considered. From the results yielded by this pair, some suggestions about statistical tests are made aiming at a more explanatory analysis. The discussion then weighs out the pros and cons of resorting to space windowing to perform a PDA-MFMV.", "paper_title": "MEMBERSHIP-VALUE-BASED HOMOGENIZATION FOR A DESCRIPTIVE MULTIFACTOR MULTIVARIATE DATA ANALYSIS. EXAMPLE FEATURING QUANTITATIVE AND QUALITATIVE TIME VARIABLES IN CAR DRIVING", "paper_id": "WOS:000283737100009"}