{"auto_keywords": [{"score": 0.03404713529464056, "phrase": "approximation_guarantee"}, {"score": 0.015575511017405612, "phrase": "minimum-cost_connected_t-join_problem"}, {"score": 0.00481495049065317, "phrase": "approximation_algorithms"}, {"score": 0.004610058444728656, "phrase": "nonnegative_costs"}, {"score": 0.004318881178805575, "phrase": "spanning_connected_subgraph_h"}, {"score": 0.004173743791750695, "phrase": "odd_degree"}, {"score": 0.004071249707923223, "phrase": "even_degree"}, {"score": 0.004008467832216946, "phrase": "multiple_copies"}, {"score": 0.003946650265907885, "phrase": "g._two_well-known_special_cases"}, {"score": 0.003388909415044492, "phrase": "long-standing_approximation_guarantee"}, {"score": 0.003125617049841619, "phrase": "et_al"}, {"score": 0.0026094602917828037, "phrase": "prize-collecting_version"}, {"score": 0.0025452819305349416, "phrase": "primal-dual_algorithm"}, {"score": 0.0025137856138000014, "phrase": "lagrangian_multiplier"}, {"score": 0.002347378595930709, "phrase": "prize-collecting_s"}, {"score": 0.0021247560305587155, "phrase": "exactly_times_the_cost"}, {"score": 0.0021049977753042253, "phrase": "constructed_dual_solution"}], "paper_keywords": ["Approximation algorithms", " LP rounding", " Primal-dual method", " Prize-collecting problems", " T-Joins", " Traveling Salesman Problem", " s, t-Path TSP"], "paper_abstract": "We design and analyse approximation algorithms for the minimum-cost connected T-join problem: given an undirected graph G=(V,E) with nonnegative costs on the edges, and a set of nodes TaS dagger V, find (if it exists) a spanning connected subgraph H of minimum cost such that every node in T has odd degree and every node not in T has even degree; H may have multiple copies of any edge of G. Two well-known special cases are the TSP (T=a...) and the s,t path TSP (T={s,t}). Recently, An et al. (Proceedings of the 44th Annual ACM Symposium on Theory of Computing, pp. 875-886, 2012) improved on the long-standing approximation guarantee for the latter problem and presented an algorithm based on LP rounding that achieves an approximation guarantee of . We show that the methods of An et al. extend to the minimum-cost connected T-join problem. They presented a new proof for a approximation guarantee for the s,t path TSP; their proof extends easily to the minimum-cost connected T-join problem. Next, we improve on the approximation guarantee of by extending their LP-rounding algorithm to get an approximation guarantee of for all |T|a parts per thousand yen4. Finally, we focus on the prize-collecting version of the problem, and present a primal-dual algorithm that is \"Lagrangian multiplier preserving\" and that achieves an approximation guarantee of when |T|a parts per thousand yen4. Our primal-dual algorithm is a generalization of the known primal-dual 2-approximation for the prize-collecting s,t path TSP. Furthermore, we show that our analysis is tight by presenting instances with |T|a parts per thousand yen4 such that the cost of the solution found by the algorithm is exactly times the cost of the constructed dual solution.", "paper_title": "Approximating Minimum-Cost Connected T-Joins", "paper_id": "WOS:000352434300005"}