{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "online_auction"}, {"score": 0.0496213341565463, "phrase": "shopping_web_sites"}, {"score": 0.02164028607385167, "phrase": "relative_importance"}, {"score": 0.009645312505161267, "phrase": "functionality_factors"}, {"score": 0.00800367639229573, "phrase": "higher_priority"}, {"score": 0.004188702178897384, "phrase": "young_consumers"}, {"score": 0.003878625406105021, "phrase": "usability_and_functionality_factors"}, {"score": 0.003325410433297401, "phrase": "highest_relative_importance"}, {"score": 0.003154012038613403, "phrase": "usability_factors"}, {"score": 0.003049555059533735, "phrase": "design_phase"}, {"score": 0.002948547333717581, "phrase": "navigation-_and_interaction-related_aspects"}, {"score": 0.0028100102841877835, "phrase": "web_sites"}, {"score": 0.0027697290872182477, "phrase": "basic_and_advanced_search_options"}, {"score": 0.002677964894127131, "phrase": "web_site_users"}, {"score": 0.0022845800828325555, "phrase": "complex_interrelationships"}], "paper_keywords": ["Electronic commerce", " Turkey", " Internet", " User studies", " Youth"], "paper_abstract": "Purpose - The purpose of this study is to determine the relative importance of the usability and functionality factors for online auction and shopping web sites from the perspective of young consumers. Design/methodology/approach - The Analytical Network Process (ANP) was used to analyse the relative importance of the usability and functionality factors. Findings - The findings show that customers of online auction and shopping web sites give higher priority to usability and usability factors than to functionality, with navigation and interaction being the factors of highest relative importance. Practical implications - First, customers assign higher priority to usability factors. Thus, early in the design phase, designers should attach more importance to navigation- and interaction-related aspects of their web sites. Second, designers of web sites should include basic and advanced search options to increase the number of the web site users. Originality/value - The study is the first to examine the relative importance of the usability and functionality factors of online auction and shopping web sites. Furthermore, the study fills this gap by identifying the complex interrelationships between various features of usability and functionality, and their impact on each other, by examining two Turkish online-auction and shopping web sites.", "paper_title": "The relative importance of usability and functionality factors for online auction and shopping web sites", "paper_id": "WOS:000281276100004"}