{"auto_keywords": [{"score": 0.04752155296993491, "phrase": "focus_groups"}, {"score": 0.01478220835625261, "phrase": "primary_care_physicians"}, {"score": 0.007614893098300233, "phrase": "shortened_systematic_review"}, {"score": 0.004459101239560164, "phrase": "optimal_format"}, {"score": 0.004362326712297089, "phrase": "systematic_review"}, {"score": 0.004084372444216856, "phrase": "focus_group_sessions"}, {"score": 0.0038240605592708083, "phrase": "iterative_process"}, {"score": 0.0036866541358511005, "phrase": "first_set"}, {"score": 0.0035153544006182834, "phrase": "second_set"}, {"score": 0.003401431460601017, "phrase": "focus_group"}, {"score": 0.0026419338604879404, "phrase": "revised_prototypes"}, {"score": 0.002565626044684815, "phrase": "second_round"}], "paper_keywords": [""], "paper_abstract": "Objective To conduct a series of focus groups with primary care physicians to determine the optimal format of a shortened, focused systematic review. Materials and methods Prototypes for two formats of a shortened systematic review were developed and presented to participants during focus group sessions. Focus groups were conducted with primary care physicians who were in full- or part-time practice. An iterative process was used so that the information learned from the first set of focus groups (Round 1) influenced the material presented to the second set of focus groups (Round 2). The focus group discussions were recorded, transcribed verbatim, and analyzed. Results Each of the two rounds of testing included three focus groups. A total of 32 physicians participated (Round 1: 16 participants; Round 2:16 participants). Analysis of the transcripts from Round 1 identified three themes including ease of use, clarity, and implementation. Changes were made to the prototypes based on the results so that the revised prototypes could be presented and discussed in the second round of focus groups. After analysis of transcripts from Round 2, four themes were identified, including ease of use, clarity, brevity, and implementation. Revisions were made to the prototypes based on the results. Conclusions Primary care physicians provided input on the refinement of two prototypes of a shortened systematic review for clinicians. Their feedback guided changes to the format, presentation, and layout of these prototypes in order to increase usability and uptake for end-users.", "paper_title": "An iterative evaluation of two shortened systematic review formats for clinicians: a focus group study", "paper_id": "WOS:000341858100023"}