{"auto_keywords": [{"score": 0.04818042291546328, "phrase": "impact_degree"}, {"score": 0.008713768692145006, "phrase": "multiple_reactions"}, {"score": 0.00861405138535457, "phrase": "metabolic_networks"}, {"score": 0.007947010528338155, "phrase": "metabolic_network"}, {"score": 0.006347162751714628, "phrase": "simple_algorithm"}, {"score": 0.0032496585171039797, "phrase": "computation_time"}, {"score": 0.0029622717081190667, "phrase": "e._coli"}, {"score": 0.0028944757265206332, "phrase": "reference_pathways"}, {"score": 0.00273167822885383, "phrase": "kegg_database"}, {"score": 0.0024756080101497086, "phrase": "improved_algorithm"}, {"score": 0.002129527338875116, "phrase": "high_impact_degrees"}, {"score": 0.0021049977753042253, "phrase": "single_and_multiple_reaction_deletions"}], "paper_keywords": ["metabolic networks", " Boolean networks", " impact degree", " robustness"], "paper_abstract": "The impact degree is a measure of the robustness of a metabolic network against deletion of single or multiple reaction(s). Although such a measure is useful for mining important enzymes/genes, it was defined only for networks without cycles. In this paper, we extend the impact degree for metabolic networks containing cycles and develop a simple algorithm to calculate the impact degree. Furthermore we improve this algorithm to reduce computation time for the impact degree by deletions of multiple reactions. We applied our method to the metabolic network of E. coli, that includes reference pathways, consisting of 3281 reaction nodes and 2444 compound nodes, downloaded from KEGG database, and calculate the distribution of the impact degree. The results of our computational experiments show that the improved algorithm is 18.4 times faster than the simple algorithm for deletion of reaction-pairs and 11.4 times faster for deletion of reaction-triplets. We also enumerate genes with high impact degrees for single and multiple reaction deletions.", "paper_title": "An Efficient Method of Computing Impact Degrees for Multiple Reactions in Metabolic Networks with Cycles", "paper_id": "WOS:000298304900013"}