{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "steering_wheel"}, {"score": 0.031156724498305303, "phrase": "torque_feedback"}, {"score": 0.012340181621033956, "phrase": "agricultural_vehicles"}, {"score": 0.004718201751622388, "phrase": "wheel_angle"}, {"score": 0.004564808765998545, "phrase": "projected_driving_error"}, {"score": 0.004447766706144458, "phrase": "driving_situations"}, {"score": 0.004418456827500267, "phrase": "new_electronic_and_electro-hydraulic_steering_systems"}, {"score": 0.004317378385832431, "phrase": "road_wheel"}, {"score": 0.0041084684278314305, "phrase": "desired_torque_feedback"}, {"score": 0.003493701605117701, "phrase": "attached_machine"}, {"score": 0.003368816076401138, "phrase": "tractor-driving_simulator"}, {"score": 0.0033245147666408157, "phrase": "tractor_drivers"}, {"score": 0.0032916702592724217, "phrase": "parallel_swathing_mode"}, {"score": 0.0032269483581856737, "phrase": "gps_lightbar"}, {"score": 0.0031739835218110015, "phrase": "real_tractors'_steering_wheel"}, {"score": 0.003050376875258722, "phrase": "different_tractor_simulator_runs"}, {"score": 0.00290259605431505, "phrase": "lateral_force"}, {"score": 0.0028739078688746374, "phrase": "ground_wheel"}, {"score": 0.0028217508000236364, "phrase": "analysis"}, {"score": 0.0025090323307618632, "phrase": "monitoring_task"}, {"score": 0.002286781334850213, "phrase": "feedback_torque"}, {"score": 0.002183134868203192, "phrase": "zero_steering_angle_position"}, {"score": 0.0021401625519713577, "phrase": "higher_performance"}, {"score": 0.0021049977753042253, "phrase": "unnecessary_steering_inputs"}], "paper_keywords": ["Tractors", " Tractor operator", " Steer-by-wire", " Haptic device"], "paper_abstract": "The torque feedback on the steering wheel of automobiles, also known as \"road feel\", is important in some driving situations. New electronic and electro-hydraulic steering systems remove the mechanical connection between the road wheel and the steering wheel, but make it possible for the designer to provide any desired torque feedback to the driver. This study was performed to investigate whether the operation of agricultural vehicles can be made easier by the nature of the torque feedback on the steering wheel. For operators of agricultural vehicles, this feedback can be particularly important when they simultaneously monitor the operation of an attached machine. Experiments were performed in the field and in a tractor-driving simulator in which experienced tractor drivers drove in parallel swathing mode with the help of a GPS lightbar. Torque feedback on a real tractors' steering wheel was measured and implemented in the simulator. Also, in different tractor simulator runs, torque feedback on the steering wheel was computed based on steering wheel angle, the lateral force on the ground wheel, and the projected driving error. Analysis showed that when steering is the only task, the behavior and performance of the operator does not significantly change if the torque feedback is removed. However, when the operator has to perform a monitoring task as well, the performance of the operator was significantly improved by providing a torque feedback that was a function of the projected driving error. Also, when the feedback torque is a function of steering wheel angle, tending to move the steering wheel towards zero steering angle position, the operator achieved a higher performance, presumably by reducing unnecessary steering inputs. (C) 2008 Elsevier B.V. All rights reserved.", "paper_title": "Torque feedback on the steering wheel of agricultural vehicles", "paper_id": "WOS:000262798500008"}