{"auto_keywords": [{"score": 0.04204224612471482, "phrase": "climate-control_system"}, {"score": 0.007683208495970221, "phrase": "energy_consumption"}, {"score": 0.00481495049065317, "phrase": "energy_saving"}, {"score": 0.004742290714667451, "phrase": "automobile_climate-control_system"}, {"score": 0.004600228893803583, "phrase": "climate-control_systems"}, {"score": 0.00441738161338662, "phrase": "human_environmental_footprint"}, {"score": 0.004135562737140424, "phrase": "electric_car"}, {"score": 0.004073113268289532, "phrase": "heavy_use"}, {"score": 0.003717656912608012, "phrase": "automated_agent"}, {"score": 0.0032251796659158696, "phrase": "expected_comfort_level"}, {"score": 0.0028551716387011637, "phrase": "system's_settings"}, {"score": 0.0027414948679658816, "phrase": "human_comfort_level"}, {"score": 0.0026592094867526803, "phrase": "climate-control_system's_settings"}, {"score": 0.002294929467537814, "phrase": "high_level"}], "paper_keywords": [""], "paper_abstract": "Reducing energy consumption of climate-control systems is important in order to reduce the human environmental footprint. The need to save energy becomes even greater when considering an electric car, since heavy use of the climate-control system may exhaust the battery. In this article we consider a method for an automated agent to provide drivers with advice that will motivate them to reduce the energy consumption of their climate-control unit. Our approach takes into account both the energy consumption of the climate-control system and the expected comfort level of the driver. We therefore have built two models, one for assessing the energy consumption of the climate-control system as a function of the system's settings, and the other for modeling the human comfort level as a function of the climate-control system's settings. Using these models, the agent provides advice to the driver considering how to set the climate-control system. The agent advises settings that by to preserve a high level of comfort while consuming as little energy as possible. We empirically show that drivers equipped with our agent, which provides them with advice, significantly save energy as compared to drivers not equipped with our agent.", "paper_title": "Advice Provision for Energy Saving in an Automobile Climate-Control System", "paper_id": "WOS:000361926600006"}