{"auto_keywords": [{"score": 0.04188369592933691, "phrase": "proposed_algorithm"}, {"score": 0.02322730111336097, "phrase": "mahalanobis_metric"}, {"score": 0.017859515274537347, "phrase": "dbscan"}, {"score": 0.004624751696958501, "phrase": "new_density"}, {"score": 0.004309725894724034, "phrase": "current_state-of-the-art_density"}, {"score": 0.003857312008178269, "phrase": "mahalanobis"}, {"score": 0.003799397093447221, "phrase": "distance_measurement"}, {"score": 0.0037235274565193665, "phrase": "euclidean_distance"}, {"score": 0.0033156708990372047, "phrase": "dataset_distribution"}, {"score": 0.0032006150973842846, "phrase": "unique_density_issue"}, {"score": 0.0029672941061574375, "phrase": "local_sub-cluster_density_information"}, {"score": 0.0026155094974689595, "phrase": "extensive_experiments"}, {"score": 0.0025761937402886954, "phrase": "synthetic_datasets"}, {"score": 0.002437012847684331, "phrase": "typical_images"}], "paper_keywords": ["Clustering", " Mahalanobis distance", " Leaders", " Followers", " Image segmentation"], "paper_abstract": "In this paper we propose a new density based clustering algorithm via using the Mahalanobis metric. This is motivated by the current state-of-the-art density clustering algorithm DBSCAN and some fuzzy clustering algorithms. There are two novelties for the proposed algorithm: One is to adopt the Mahalanobis metric as distance measurement instead of the Euclidean distance in DBSCAN and the other is its effective merging approach for leaders and followers defined in this paper. This Mahalanobis metric is closely associated with dataset distribution. In order to overcome the unique density issue in DBSCAN, we propose an approach to merge the sub-clusters by using the local sub-cluster density information. Eventually we show how to automatically and efficiently extract not only 'traditional' clustering information, such as representative points, but also the intrinsic clustering structure. Extensive experiments on some synthetic datasets show the validity of the proposed algorithm. Further the segmentation results on some typical images by using the proposed algorithm and DBSCAN are presented in this paper and they are shown that the proposed algorithm can produce much better visual results in image segmentation. (C) 2011 Elsevier B. V. All rights reserved.", "paper_title": "DBCAMM: A novel density based clustering algorithm via using the Mahalanobis metric", "paper_id": "WOS:000301351100010"}