{"auto_keywords": [{"score": 0.04829240903686406, "phrase": "block_cipher"}, {"score": 0.04702120442027911, "phrase": "random_permutation"}, {"score": 0.0381260647420229, "phrase": "keeloq"}, {"score": 0.00481495049065317, "phrase": "random_permutations"}, {"score": 0.004754324449031752, "phrase": "periodic_block_ciphers"}, {"score": 0.004485085675709643, "phrase": "appropriate_domain"}, {"score": 0.004252540146677527, "phrase": "exponential_generating_functions"}, {"score": 0.004198965651975536, "phrase": "ordinary_generating_functions"}, {"score": 0.004042241624040812, "phrase": "cryptographic_community"}, {"score": 0.0035788328989573557, "phrase": "remote_keyless-entry_systems"}, {"score": 0.00348916549487384, "phrase": "heuristic_form"}, {"score": 0.00316838104842675, "phrase": "entire_codebook"}, {"score": 0.0028916504878245463, "phrase": "pedagogical_aid"}, {"score": 0.0028120022457134267, "phrase": "deepest_level"}, {"score": 0.0027906622487060407, "phrase": "third_attack"}, {"score": 0.002679546974823887, "phrase": "distinguishing_attack"}, {"score": 0.002572844542125473, "phrase": "highly_composite_number"}, {"score": 0.002540377258232509, "phrase": "merely_one_fewer_round"}, {"score": 0.0024641134634779535, "phrase": "key-recovery_attack"}, {"score": 0.0024454070844982033, "phrase": "\"triple-des''_style_construction"}, {"score": 0.002396213092942202, "phrase": "middle_cipher"}, {"score": 0.0022430496449961407, "phrase": "prime_number"}, {"score": 0.0021373366163721518, "phrase": "exponential_and_ordinary_generating_functions"}, {"score": 0.0021049977753042253, "phrase": "cryptanalytic_research"}], "paper_keywords": ["analytic combinatorics", " cycle structure", " cryptanalysis", " EGF", " generating functions", " iterations of permutations", " Keeloq", " OGF", " random permutations"], "paper_abstract": "It has been stated many times that a block cipher is \"intended to be'' computationally indistinguishable from a random permutation of appropriate domain and range. But what are the properties of a random permutation? In this article, by the aid of exponential generating functions (EGFs) and ordinary generating functions (OGFs), we derive a series of corollaries of interest to the cryptographic community. While the notion of EGFs and OGFs is known among combinatoricists, we believe that the subject is relatively unfamiliar to those working in cryptography. As an application, we present three cryptanalytic attacks. The first two are on the block cipher Keeloq, used in the remote keyless-entry systems of automobiles. While these attacks have appeared in heuristic form before, we render them rigorous, with exact (instead of experimental) analysis of their running time. Furthermore, we demonstrate that these attacks can succeed with less data available than was previously thought-namely, that less than the entire codebook need be checked, and we give a formula for the probability of success in terms of the fraction of the codebook used. It is hoped that the rigor will also serve as a pedagogical aid for those who wish to understand these attacks at the deepest level. The third attack is against the (roughly) millionth-fold iteration of any block cipher. In particular, we create a distinguishing attack, whereby the iteration of a cipher by a number of times equal to a highly composite number is breakable, but merely one fewer round is considerably more secure. We then extend this to a key-recovery attack in a \"Triple-DES'' style construction, but using AES-256 and iterating the middle cipher (roughly) a million-fold. We furthermore show that if a cipher must be iterated, then it should be iterated a prime number of times to avoid this attack. It is hoped that these results will showcase the utility of exponential and ordinary generating functions and will encourage their use in cryptanalytic research, as well as provide an introduction to Keeloq.", "paper_title": "Statistics of Random Permutations and the Cryptanalysis of Periodic Block Ciphers", "paper_id": "WOS:000306321000004"}