{"auto_keywords": [{"score": 0.04752155296993491, "phrase": "null_hypothesis"}, {"score": 0.016738201525926998, "phrase": "fixed_delta_test"}, {"score": 0.014861643809754632, "phrase": "delta"}, {"score": 0.010612387000973441, "phrase": "null_hypotheses"}, {"score": 0.005817020060308081, "phrase": "new_procedures"}, {"score": 0.005044568587495124, "phrase": "confidence_intervals"}, {"score": 0.004693300099911199, "phrase": "long_time"}, {"score": 0.004659108142668152, "phrase": "statistical_tests"}, {"score": 0.003866268750750096, "phrase": "former_hypothesis"}, {"score": 0.0037273513742154237, "phrase": "sample_size"}, {"score": 0.0036866541358511005, "phrase": "data_set"}, {"score": 0.003489714006817602, "phrase": "instead_the_latter_hypothesis"}, {"score": 0.0031728680535262083, "phrase": "testing_averages"}, {"score": 0.002401875938287542, "phrase": "re-sampling_method"}, {"score": 0.002175594509651082, "phrase": "simulation_trials"}, {"score": 0.0021049977753042253, "phrase": "sufficient_statistical_power"}], "paper_keywords": ["re-sampling", " computer-intensive statistical method", " statistical test", " fuzzy", " null hypothesis"], "paper_abstract": "For a long time, statistical tests of significance have tested a null hypothesis of the form, H-0: mu(1) = mu(2). However, in many cases, it is more important whether a null hypothesis of the form, H-0: mu(1) approximate to mu(2), is rejected or not. When the former hypothesis is judged, no null hypotheses are accepted if the sample size of a data set is sufficiently large. In order to avoid this problem, and to judge instead the latter hypothesis, a fixed Delta test has been often used. However, the fixed Delta test has some problems. For example, the fixed Delta test is only appropriate for testing averages or ratios. In addition, the test requires Delta to be specified in advance, even if the tester must specify Delta subjectively. Thus, more objective procedures for judging the null hypothesis, H-0: mu(1) approximate to mu(2), are required. In this study, we suggest new procedures which enable us to judge the null hypothesis, H-0: mu(1) approximate to mu(2), without specifying Delta in advance using a re-sampling method. Our new procedures are widely applicable to various statistics, and enable us to obtain confidence intervals of confidence intervals. Moreover, by the application of these new procedures to simulation trials, we further demonstrate that the procedures have sufficient statistical power. (c) 2005 Elsevier B.V. All rights reserved.", "paper_title": "New computer-intensive procedures for testing null hypotheses comparing two parameters approximately", "paper_id": "WOS:000237588100011"}