{"auto_keywords": [{"score": 0.05007813205043781, "phrase": "cyclin-dependent_kinase"}, {"score": 0.044692387059559566, "phrase": "cip"}, {"score": 0.026914966609520356, "phrase": "activation_loop"}, {"score": 0.004591345494188032, "phrase": "molecular_dynamics_simulations"}, {"score": 0.0045370785151713396, "phrase": "mm-pbsa."}, {"score": 0.0032709661258673206, "phrase": "molecular_dynamics"}, {"score": 0.0032130703855586685, "phrase": "energy_decomposition_calculation_models"}, {"score": 0.0030819219279832224, "phrase": "deregulation_mechanisms"}, {"score": 0.002719644855867468, "phrase": "important_conformational_changes"}, {"score": 0.0026714812866037584, "phrase": "hydrophobic_pocket"}, {"score": 0.0022209780222461587, "phrase": "substrate_peptide"}, {"score": 0.0021946656099592608, "phrase": "new_inhibition_sites"}], "paper_keywords": ["Molecular dynamics simulations", " Cyclin-dependent kinase", " Inhibition", " Energy decomposition"], "paper_abstract": "A cyclin-dependent kinase (CDK) 5 inhibitory peptide (CIP) from p25 was recently reported to inhibit CDK5/p25 activity in vitro but had no effect on endogenous cdc2 kinase activity. This may lead to a specific CDK5 inhibition strategy in the treatment of neurodegeneration. However, the mechanism of the inhibition remains unclear. In this work, molecular dynamics simulations and energy decomposition calculation models were set up to investigate the deregulation mechanisms of CIP on CDK5 activity. The results show that truncation of the N, and C terminals of p25 introduces important conformational changes into a hydrophobic pocket that is crucial for accommodating Ile153 on the activation loop of CDK5. In addition, such truncations lead to distortion and displacement of the activation loop and consequently affect binding of the substrate peptide. New inhibition sites for selectively inhibiting the activity of CDK5 are also suggested.", "paper_title": "Explaining the inhibition of cyclin-dependent kinase 5 by peptides derived from p25 with molecular dynamics simulations and MM-PBSA", "paper_id": "WOS:000271809700001"}