{"auto_keywords": [{"score": 0.04499348387455104, "phrase": "hmmdiverge"}, {"score": 0.015586480634730926, "phrase": "functional_divergence"}, {"score": 0.014810095984314785, "phrase": "protein_regions"}, {"score": 0.01079870609582324, "phrase": "candidate_region"}, {"score": 0.00481495049065317, "phrase": "sequence_regions"}, {"score": 0.004732785510739708, "phrase": "duplicate_genes"}, {"score": 0.004592340708764929, "phrase": "phylogenetic_hidden_markov_model"}, {"score": 0.0041773934798743405, "phrase": "model_parameters"}, {"score": 0.0036710872046569532, "phrase": "substitution_rates"}, {"score": 0.0033971539563683174, "phrase": "g_protein_alpha_subunits"}, {"score": 0.0030898642396380662, "phrase": "gtpase_domain"}, {"score": 0.00306334226516593, "phrase": "divergent_rates"}, {"score": 0.0028963961037320805, "phrase": "existing_program"}, {"score": 0.002822434555587263, "phrase": "previous_biochemical_studies"}, {"score": 0.0026570998719084153, "phrase": "receptor-g_protein_interaction"}, {"score": 0.002437525632451029, "phrase": "alpha_subunits"}, {"score": 0.0023548511815224098, "phrase": "receptor-g_protein_specificity"}, {"score": 0.0022073031056287903, "phrase": "useful_tool"}, {"score": 0.0021049977753042253, "phrase": "gene_duplication"}], "paper_keywords": [""], "paper_abstract": "Results: We design a phylogenetic hidden Markov model to identify protein regions relevant to type-I functional divergence. A C++ program, HMMDiverge, has been developed to estimate model parameters and to identify regions under type-I functional divergence. Simulations demonstrate that HMMDiverge can successfully identify protein regions under type-I functional divergence unless the discrepancy of substitution rates between subfamilies is very limited or the regions under functional divergence are very short. Applying HMMDiverge to G protein alpha subunits in animals, we identify a candidate region longer than 20 amino acids, which overlaps with the alpha-4 helix and the alpha 4-beta 6 loop in the GTPase domain with divergent rates of substitutions. These sites are different from those reported by an existing program, DIVERGE2. Interestingly, previous biochemical studies suggest the alpha-4 helix and the alpha 4-beta 6 loop are important to the specificity of the receptor-G protein interaction. Therefore, the candidate region reported by HMMDiverge highlights that the type-I functional divergence in G protein alpha subunits may be relevant to the change of receptor-G protein specificity after gene duplication. From these results, we conclude that HMMDiverge is a useful tool to identify regions under type-I functional divergence after gene duplication.", "paper_title": "Inferring sequence regions under functional divergence in duplicate genes", "paper_id": "WOS:000299414200004"}