{"auto_keywords": [{"score": 0.04938622488322166, "phrase": "train_schedules"}, {"score": 0.00481495049065317, "phrase": "predictive_train_timetables"}, {"score": 0.0043477114072437316, "phrase": "additional_requirements"}, {"score": 0.0038127186374325582, "phrase": "specified_level"}, {"score": 0.003200045185608395, "phrase": "sensitivity_analysis"}, {"score": 0.003018468582368033, "phrase": "operation_delays"}, {"score": 0.0027383842769094354, "phrase": "timetable_robustness"}, {"score": 0.002685558057339722, "phrase": "control_information"}, {"score": 0.0024126686412257407, "phrase": "disjunctive_graph_model"}, {"score": 0.002389276641014013, "phrase": "train_operations"}, {"score": 0.0023091721866305426, "phrase": "affected_operations"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Sensitivity analysis", " Robustness", " Train scheduling", " Job shops", " Topological ordering", " Transitive closure"], "paper_abstract": "Constructing train schedules is vital in railways. This complex and time consuming task is however made more difficult by additional requirements to make train schedules robust to delays and other disruptions. For a timetable to be regarded as robust, it should be insensitive to delays of a specified level and its performance with respect to a given metric, should be within given tolerances. In other words the effect of delays should be identifiable and should be shown to be minimal. To this end, a sensitivity analysis is proposed that identifies affected operations. More specifically a sensitivity analysis for determining what operation delays cause each operation to be affected is proposed. The information provided by this analysis gives another measure of timetable robustness and also provides control information that can be used when delays occur in practice. Several algorithms are proposed to identify this information and they utilise a disjunctive graph model of train operations. Upon completion the sets of affected operations can also be used to define the impact of all delays without further disjunctive graph evaluations. (C) 2013 Elsevier Ltd. All rights reserved.", "paper_title": "Determining operations affected by delay in predictive train timetables", "paper_id": "WOS:000326610500016"}