{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "computer_collaborative_group_work"}, {"score": 0.04846675549219539, "phrase": "attention_deficit_hyperactivity_disorder"}, {"score": 0.03723812436020909, "phrase": "oil_parents"}, {"score": 0.0339902791065415, "phrase": "peer_acceptance"}, {"score": 0.03356912892792283, "phrase": "boy's_immediate_peer_group"}, {"score": 0.03153785456880125, "phrase": "computer_sessions"}, {"score": 0.0046928556063004214, "phrase": "junior_pupil"}, {"score": 0.004056981775766071, "phrase": "collaborative_group_work_oil"}, {"score": 0.0036448787596988423, "phrase": "computer_group_work_sessions"}, {"score": 0.003432604816716035, "phrase": "history_background_data"}, {"score": 0.003359816816853762, "phrase": "boy's_peer_acceptance"}, {"score": 0.003123652729688503, "phrase": "adult-facilitated_computer_sessions"}, {"score": 0.0030573959252626695, "phrase": "positive_social_behaviour"}, {"score": 0.0027583557819362034, "phrase": "information_oil"}, {"score": 0.0027347937102326285, "phrase": "child's_behaviour"}, {"score": 0.0026538960171433985, "phrase": "sociometrics_testing"}, {"score": 0.0024461474613359994, "phrase": "encouraging_improvements"}, {"score": 0.0022936610196951962, "phrase": "discrete_setting"}, {"score": 0.0021692694527400184, "phrase": "school"}, {"score": 0.0021414489155042885, "phrase": "mainstream_inclusion"}], "paper_keywords": ["ADHD", " ADD", " computer collaborative work", " computer group work", " special education", " attention deficit hyperactivity disorder"], "paper_abstract": "The study investigated the effects of computer collaborative group work, facilitated by all adult, oil peer acceptance of a junior boy with Attention Deficit Hyperactivity Disorder (ADHD). It aimed to ascertain whether collaborative group work oil a computer, with the facilitation of an adult, could help to raise his peer acceptance among his classmates. Data were gathered before and after computer group work sessions. Interviews and questionnaires were conducted oil parents and teachers to help establish the history background data and their concerns oil the boy's peer acceptance. Sociometrics testing of classmates was used to determine peer acceptance among the boy's immediate peer group. During the adult-facilitated computer sessions, the facilitator reinforced positive social behaviour and interactions. After the computer sessions, interviews and questionnaires were conducted again oil parents, teachers and facilitator in all attempt to capture information oil the child's behaviour and attitudes during the computer sessions. Sociometrics testing was also conducted again to determine if the peer acceptance among the boy's immediate peer group has changed. The results indicated encouraging improvements in the raise of his peer acceptance among his classmates in general. although this was a discrete setting, the finding is promising and this strategy may be replicated in School to support Mainstream inclusion for children with ADHD. (C) 2006 Elsevier Ltd. All rights reserved.", "paper_title": "Effects of computer collaborative group work on peer acceptance of a junior pupil with attention deficit hyperactivity disorder (ADHD)", "paper_id": "WOS:000255085700009"}