{"auto_keywords": [{"score": 0.004742511243894382, "phrase": "movement_data"}, {"score": 0.004671167667878273, "phrase": "rfid"}, {"score": 0.004264923517966271, "phrase": "two-dimensional_spaces"}, {"score": 0.003923532450854754, "phrase": "time_variable"}, {"score": 0.0034096661914349577, "phrase": "geotime"}, {"score": 0.0033329032920236994, "phrase": "three-dimensional_visualization"}, {"score": 0.0031365196064043494, "phrase": "spatially_overlapping_trajectories"}, {"score": 0.0029741713977710495, "phrase": "previous_experimental_comparisons"}, {"score": 0.002788257824525862, "phrase": "increased_complexity"}, {"score": 0.0026741832921475667, "phrase": "new_controlled_experimental_comparison"}, {"score": 0.0026040262154057607, "phrase": "commonly_performed_tasks"}, {"score": 0.0022711961447468114, "phrase": "\"_the_timeline"}, {"score": 0.0021049977753042253, "phrase": "spatio-temporal_data"}], "paper_keywords": ["Information visualization", " spatio-temporal data", " movement data", " interactive visualization", " evaluation"], "paper_abstract": "GPS, RFID, and other technologies have made it increasingly common to track the positions of people and objects over time as they move through two-dimensional spaces. Visualizing such spatio-temporal movement data is challenging because each person or object involves three variables (two spatial variables as a function of the time variable), and simply plotting the data on a 2D geographic map can result in overplotting and occlusion that hides details. This also makes it difficult to understand correlations between space and time. Software such as GeoTime can display such data with a three-dimensional visualization, where the 3rd dimension is used for time. This allows for the disambiguation of spatially overlapping trajectories, and in theory, should make the data clearer. However, previous experimental comparisons of 2D and 3D visualizations have so far found little advantage in 3D visualizations, possibly due to the increased complexity of navigating and understanding a 3D view. We present a new controlled experimental comparison of 2D and 3D visualizations, involving commonly performed tasks that have not been tested before, and find advantages in 3D visualizations for more complex tasks. In particular, we tease out the effects of various basic interactions and find that the 2D view relies significantly on \"scrubbing\" the timeline, whereas the 3D view relies mainly on 3D camera navigation. Our work helps to improve understanding of 2D and 3D visualizations of spatio-temporal data, particularly with respect to interactivity.", "paper_title": "The Impact of Interactivity on Comprehending 2D and 3D Visualizations of Movement Data", "paper_id": "WOS:000345907200012"}