{"auto_keywords": [{"score": 0.049270547314558835, "phrase": "web_services"}, {"score": 0.02322730111336099, "phrase": "web_services_composition"}, {"score": 0.007710610354261907, "phrase": "information_change"}, {"score": 0.004706821999798591, "phrase": "major_industrial_benefit"}, {"score": 0.004627314732558291, "phrase": "composition_processes"}, {"score": 0.004562080863250721, "phrase": "automated_exchange"}, {"score": 0.004510553529300543, "phrase": "remote_processes"}, {"score": 0.0044722886002206115, "phrase": "service_interface"}, {"score": 0.004434346842693198, "phrase": "well-established_end-to-end_qos_infrastructure"}, {"score": 0.004213332968720317, "phrase": "research_work"}, {"score": 0.004118658982032481, "phrase": "functional_qos_requirements"}, {"score": 0.004083705021550205, "phrase": "service_response_time"}, {"score": 0.0038690893441754737, "phrase": "data_freshness"}, {"score": 0.0036037265181631324, "phrase": "multiple_web_services_composition_scenario"}, {"score": 0.003542786326740931, "phrase": "accurate_identification"}, {"score": 0.0034631271853732405, "phrase": "appropriate_re-computation"}, {"score": 0.0032255172568437965, "phrase": "computed_thresholds"}, {"score": 0.0031890376450148766, "phrase": "model_design"}, {"score": 0.0030820480406334927, "phrase": "significant_amount"}, {"score": 0.0030127172247606812, "phrase": "slight_change"}, {"score": 0.002886885861509621, "phrase": "proposed_concept"}, {"score": 0.0028219328009498374, "phrase": "ws-notification_specification"}, {"score": 0.0026507289852980512, "phrase": "publish-subscribe_mechanism"}, {"score": 0.0025255644226584856, "phrase": "qualifiable_qos_aspect"}, {"score": 0.0023321331255760393, "phrase": "composition_process"}, {"score": 0.0023057340422299737, "phrase": "higher_qos."}, {"score": 0.002228312305868068, "phrase": "ws-notification_concept"}, {"score": 0.002123051344001408, "phrase": "selective_re-computation"}, {"score": 0.0021049977753042253, "phrase": "web_services_composition_plan"}], "paper_keywords": ["web services composition", " web services QoS", " WS-notification", " state machine"], "paper_abstract": "Web services exhibit major industrial benefit by their ability to participate in composition processes. Web services composition allows for automated exchange of information among remote processes through the service interface. A well-established end-to-end QoS infrastructure among the involved processes precludes confusion among the developers, vendors and consumers. Most of the research work conducted in this domain has focused on functional QoS requirements such as service response time, delay, cost, etc. This paper elaborates the QoS of web services from the perspective of data freshness and accuracy. Towards this aim, the 'Region Switching' (RS) algorithm is introduced in this paper. Within the context of the multiple web services composition scenario, the RS-algorithm allows for accurate identification of the point of information change and the appropriate re-computation over the subset of the pre-established, global service execution plan. Thereafter, a mathematical model is presented to verify the need for re-computation based on certain estimated factors, computed thresholds, and the model design. Such a selective re-computation is worth considering since some services may take a significant amount of time to produce results where a slight change to the information set might not alter the outcome of the service. The proposed concept is implemented by utilising and extending the WS-Notification specification in order to elaborate a middleware that is capable of sensing and routing information change at the level of web services using the publish-subscribe mechanism. The contribution of this paper is threefold. First, it highlights the importance of qualifiable QoS aspect related to the issue of web services composition and monitoring. Second, it describes an algorithm capable of capturing and reflecting the state of web services involved in a composition process, thereby achieving higher QoS. Finally, the paper illustrates the use and extension of the WS-Notification concept in building such systems that would deliver up-to-date information to the user through selective re-computation of the web services composition plan.", "paper_title": "QoS-aware middleware for web services composition: a qualitative approach", "paper_id": "WOS:000274020900004"}