{"auto_keywords": [{"score": 0.03235740424067532, "phrase": "\"forgiveness\"_component"}, {"score": 0.011711736701261095, "phrase": "trust_breakdown"}, {"score": 0.010940946680333028, "phrase": "built-in_apology_forum"}, {"score": 0.008203323567003701, "phrase": "victim's_trust"}, {"score": 0.00481495049065317, "phrase": "trust_breakdowns"}, {"score": 0.0047784273577245505, "phrase": "one-off_online_interactions"}, {"score": 0.004198082549566806, "phrase": "benevolent_member"}, {"score": 0.004041155193307942, "phrase": "victim's_decrease"}, {"score": 0.003964896373751171, "phrase": "unintentional_or_occasional_offender"}, {"score": 0.0038752755502006442, "phrase": "online_setting"}, {"score": 0.003276893480994257, "phrase": "offender's_apology"}, {"score": 0.002922637921202474, "phrase": "offender's_trustworthiness"}, {"score": 0.0025867643733794724, "phrase": "online_offences"}, {"score": 0.0024242869058849446, "phrase": "future_interaction"}, {"score": 0.0021785729703227698, "phrase": "subsequent_interaction"}, {"score": 0.0021049977753042253, "phrase": "reputation_systems"}], "paper_keywords": ["trust", " social dilemmas", " forgiveness", " reputation", " apology", " one-off interactions"], "paper_abstract": "Online offences are generally considered as frequent and intentional acts performed. by a member with the aim to deceive others. However, an offence may also be unintentional or exceptional, performed by a benevolent member of the community. This article examines whether a victim's decrease in trust towards an unintentional or occasional offender can be repaired in an online setting, by designing and evaluating systems to support forgiveness. We study which of three systems enable the victim of a trust breakdown to fairly assess this kind of offender. The three systems are: (1) a reputation system, (2) a reputation system with a built-in apology forum that may display the offender's apology to the victim and (3) a reputation system with a built-in apology forum that also includes a \"forgiveness\" component. The \"forgiveness\" component presents the victim with information that demonstrates the offender's trustworthiness as judged by the system. We experimentally observe that systems (2) and (3), endorsing apology and supporting forgiveness, allow victims to recover their trust after online offences. An apology from the offender restores the victim's trust only if the offender cooperates in a future interaction; it does not alleviate the trust breakdown immediately after it occurs. By contrast, the \"forgiveness\" component restores the victim's trust directly after the offence and in a subsequent interaction. The applicability of these findings for extending reputation systems is discussed. (c) 2008 Elsevier Ltd. All rights reserved.", "paper_title": "In praise of forgiveness: Ways for repairing trust breakdowns in one-off online interactions", "paper_id": "WOS:000256494000006"}