{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "crowdsourcing_services"}, {"score": 0.010504656147754778, "phrase": "text_summarization"}, {"score": 0.004621279527317074, "phrase": "detailed_analysis"}, {"score": 0.004300830853119242, "phrase": "tourist_domain"}, {"score": 0.004106612344123407, "phrase": "relevant_information"}, {"score": 0.003782655283668953, "phrase": "short_summary"}, {"score": 0.00368673793612343, "phrase": "great_help"}, {"score": 0.0034485432592912917, "phrase": "broad_set"}, {"score": 0.0027223626424366207, "phrase": "gold-standard_summaries"}, {"score": 0.00248167018931442, "phrase": "encouraging_results"}, {"score": 0.0024311346712789553, "phrase": "third_and_sixth_experiments"}, {"score": 0.0022275639370573264, "phrase": "behaviour_humans"}], "paper_keywords": ["Information retrieval", " Text summarization", " Crowdsourcing services", " Crowdflower", " Mechanical Turk"], "paper_abstract": "This paper presents a detailed analysis of the use of crowdsourcing services for the Text Summarization task in the context of the tourist domain. In particular, our aim is to retrieve relevant information about a place or an object pictured in an image in order to provide a short summary which will be of great help for a tourist. For tackling this task, we proposed a broad set of experiments using crowdsourcing services that could be useful as a reference for others who want to rely also on crowdsourcing. From the analysis carried out through our experimental setup and the results obtained, we can conclude that although crowdsourcing services were not good to simply gather gold-standard summaries (i.e., from the results obtained for experiments 1, 2 and 4), the encouraging results obtained in the third and sixth experiments motivate us to strongly believe that they can be successfully employed for finding some patterns of behaviour humans have when generating summaries, and for validating and checking other tasks. Furthermore, this analysis serves as a guideline for the types of experiments that might or might not work when using crowdsourcing in the context of text summarization.", "paper_title": "Analyzing the capabilities of crowdsourcing services for text summarization", "paper_id": "WOS:000319776500003"}