{"auto_keywords": [{"score": 0.049675053299362504, "phrase": "limited_wavelength_conversion"}, {"score": 0.014577131769009807, "phrase": "obs"}, {"score": 0.010196375546342616, "phrase": "conversion_range"}, {"score": 0.00481495049065317, "phrase": "obs_networks"}, {"score": 0.0046544807197808095, "phrase": "scalable_framework"}, {"score": 0.004518442937844318, "phrase": "optical_burst"}, {"score": 0.004081385289516914, "phrase": "broader_class"}, {"score": 0.004046923261950549, "phrase": "optical_networks"}, {"score": 0.003945266418163835, "phrase": "bufferless_unacknowledged_switching"}, {"score": 0.003813669883040509, "phrase": "nsfnet_topology"}, {"score": 0.0037178503842258087, "phrase": "even_the_most_limited_conversion_range"}, {"score": 0.003503497128638102, "phrase": "wavelength_conversion"}, {"score": 0.0034154440860550564, "phrase": "previous_results"}, {"score": 0.0033579708256295847, "phrase": "-optical_non-obs_networks"}, {"score": 0.00327356326590461, "phrase": "full_wavelength_conversion"}, {"score": 0.0029565620771207003, "phrase": "classical_reduced_load_approximation"}, {"score": 0.0027159094186967247, "phrase": "fixed-point_equations"}, {"score": 0.0025919830205975215, "phrase": "successive_substitution"}, {"score": 0.0023013968622710847, "phrase": "wavelength_conversion_range"}, {"score": 0.002104999499520222, "phrase": "jit"}], "paper_keywords": ["all-optical network", " blocking probability", " limited wavelength conversion", " optical burst switching", " reduced load approximation"], "paper_abstract": "Presented herein is a scalable framework for estimating path blocking probabilities in optical burst switched (OBS) networks where limited wavelength conversion is possible. Although presented under the guise of OBS, it is pertinent to a broader class of optical networks based on the principle of bufferless unacknowledged switching. By applying the framework to the NSFNET topology, it is shown that even the most limited conversion range may reduce path blocking probabilities by several orders of magnitude, compared with no wavelength conversion. Moreover, contrary to previous results derived for all-optical non-OBS networks with acknowledgement, OBS with full wavelength conversion achieves significantly lower blocking probabilities than OBS with limited wavelength conversion when the conversion range is small. Underpinning the framework is a generalization of the classical reduced load approximation. Assuming links evolve independently of each other allows decoupling of the network into its constituent links. A set of fixed-point equations describing the evolution of each conversion range are then solved by successive substitution to estimate link blocking probabilities. Having these link blocking probabilities, path blocking probabilities are evaluated. The complexity of the framework is dominated by the wavelength conversion range and is independent of the number of wavelengths per link under certain symmetry conditions. Both just-in-time (JIT) and just-enough-time (JET) scheduling are considered. Simulations are implemented to corroborate the accuracy of the framework.", "paper_title": "Analysis of OBS networks with limited wavelength conversion", "paper_id": "WOS:000241540900016"}