{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "opportunistic_networks"}, {"score": 0.014000875864703732, "phrase": "flooding_time"}, {"score": 0.004842474231888236, "phrase": "asymptotic_bounds"}, {"score": 0.004779876533667754, "phrase": "power_law"}, {"score": 0.004676173016967478, "phrase": "performance_bounds"}, {"score": 0.004508286991825192, "phrase": "recent_papers"}, {"score": 0.004394350285140955, "phrase": "expected_delivery_time"}, {"score": 0.0043464021636703066, "phrase": "unicast_message"}, {"score": 0.003952082333580496, "phrase": "existing_results"}, {"score": 0.0038804410204616954, "phrase": "mobility_model"}, {"score": 0.003741016338085083, "phrase": "pairwise_node_intercontact_time_distribution"}, {"score": 0.0031728680535262083, "phrase": "previous_work"}, {"score": 0.002959617637433, "phrase": "contact_model"}, {"score": 0.0027505663559338825, "phrase": "home-meg_model"}, {"score": 0.002622647280008795, "phrase": "different_initial_conditions"}, {"score": 0.002575042977852052, "phrase": "opportunistic_links"}, {"score": 0.002455266773537278, "phrase": "realistic_human_mobility_model"}, {"score": 0.0023843376332011936, "phrase": "proposed_home-meg_model"}, {"score": 0.002298544073884724, "phrase": "large-scale_opportunistic_networks"}, {"score": 0.00224032791638295, "phrase": "analytical_evidences"}, {"score": 0.0021049977753042253, "phrase": "simple_geometric_mobility_models"}], "paper_keywords": ["Opportunistic networks", " information spreading", " intercontact time", " asymptotic bounds"], "paper_abstract": "Performance bounds for opportunistic networks have been derived in a number of recent papers for several key quantities, such as the expected delivery time of a unicast message, or the flooding time (a measure of how fast information spreads). However, to the best of our knowledge, none of the existing results is derived under a mobility model which is able to reproduce the power law+exponential tail dichotomy of the pairwise node intercontact time distribution which has been observed in traces of several real opportunistic networks. The contributions of this paper are two-fold: first, we present a simple pairwise contact model-called the Home-MEG model-for opportunistic networks based on the observation made in previous work that pairs of nodes in the network tend to meet in very few, selected locations (home locations); this contact model is shown to be able to faithfully reproduce the power law+exponential tail dichotomy of intercontact time. Second, we use the Home-MEG model to analyze flooding time in opportunistic networks, presenting asymptotic bounds on flooding time that assume different initial conditions for the existence of opportunistic links. By comparing asymptotic bounds with the results of simulations performed using a realistic human mobility model, we demonstrate the capability of the proposed Home-MEG model to faithfully predict the speed of information spreading in large-scale opportunistic networks. Finally, our bounds provide some analytical evidences that the speed of information spreading in opportunistic networks can be much faster than that predicted by simple geometric mobility models.", "paper_title": "Flooding Time in Opportunistic Networks under Power Law and Exponential Intercontact Times", "paper_id": "WOS:000342179000009"}