{"auto_keywords": [{"score": 0.02654504623327361, "phrase": "prcu"}, {"score": 0.015346376298980214, "phrase": "rcu"}, {"score": 0.00481495049065317, "phrase": "scalable_concurrent_updates"}, {"score": 0.004756805752518494, "phrase": "read-copy_update"}, {"score": 0.004586531354697466, "phrase": "shared_memory_synchronization_mechanism"}, {"score": 0.004263972370406983, "phrase": "concurrent_updates"}, {"score": 0.003916098498242888, "phrase": "data_structure"}, {"score": 0.0035530197642369464, "phrase": "waiting_periods"}, {"score": 0.0033029038236817372, "phrase": "data_structures"}, {"score": 0.003070340620983981, "phrase": "predicate_rcu"}, {"score": 0.0026209522797963447, "phrase": "user-supplied_predicate"}], "paper_keywords": ["Concurrent data structures", " Synchronization", " RCU"], "paper_abstract": "Read-copy update (RCU) is a shared memory synchronization mechanism with scalable synchronization-free reads that nevertheless execute correctly with concurrent updates. To guarantee the consistency of such reads, an RCU update transitioning the data structure between certain states must wait for the completion of all existing reads. Unfortunately, these waiting periods quickly become a bottleneck, and thus RCU remains unused in data structures that require scalable, fine-grained, update operations. To solve this problem, we present Predicate RCU (PRCU), an RCU variant in which an update waits only for the reads whose consistency it affects, which are specified by a user-supplied predicate. We explore the trade-offs in implementing PRCU, describing implementations that reduce wait times by 10-100x with varying overhead on reads on modern x86 multiprocessor machines. We demonstrate the applicability of PRCU by applying it to two RCU-based concurrent algorithms-the CITRUS binary search tree and a resizable hash table-and show experimentally that PRCU significantly improves the performance of both algorithms.", "paper_title": "Predicate RCU: An RCU for Scalable Concurrent Updates", "paper_id": "WOS:000367254800003"}