{"auto_keywords": [{"score": 0.044427629417781944, "phrase": "uk"}, {"score": 0.023054458428191305, "phrase": "csar_ligands"}, {"score": 0.010612228229801995, "phrase": "binding_affinity"}, {"score": 0.004688894532233354, "phrase": "ligand-based_approaches"}, {"score": 0.004583464412234181, "phrase": "prediction_accuracy"}, {"score": 0.0040290957541568775, "phrase": "predictive_qsar_models"}, {"score": 0.0039684322717435045, "phrase": "known_binders"}, {"score": 0.0038644521996539466, "phrase": "publicly_available_chembl_database"}, {"score": 0.0037065115435101887, "phrase": "csar_compounds"}, {"score": 0.0036645642553325215, "phrase": "corresponding_targets"}, {"score": 0.0035685175471526823, "phrase": "overall_ranking_accuracy"}, {"score": 0.0035281264325950556, "phrase": "spearman_correlation"}, {"score": 0.0031604223680801774, "phrase": "medusadock"}, {"score": 0.0031010029460927864, "phrase": "reliable_docking_poses"}, {"score": 0.002940487679224863, "phrase": "resulting_accuracy"}, {"score": 0.0026741832921475667, "phrase": "performance_of_several_consensus_approaches_combining_medusadock-_and_qsar-predicted_ranks"}, {"score": 0.002574523719093119, "phrase": "spearman_correlation_coefficients"}, {"score": 0.0021291312714904957, "phrase": "ligand-based_qsar_models"}, {"score": 0.0021049977753042253, "phrase": "structure-based_approaches"}], "paper_keywords": [""], "paper_abstract": "We report on the prediction accuracy of ligand-based (2D QSAR) and structure-based (MedusaDock) methods used both independently and in consensus for ranking the congeneric series of ligands binding to three protein targets (UK, ERK2, and CHK1) from the CSAR 2011 benchmark exercise. An ensemble of predictive QSAR models was developed using known binders of these three targets extracted from the publicly available ChEMBL database. Selected models were used to predict the binding affinity of CSAR compounds toward the corresponding targets and rank them accordingly; the overall ranking accuracy evaluated by Spearman correlation was as high as 0.78 for UK, 0.60 for ERK2, and 0.56 for CHK1, placing our predictions in the top 10% among all the participants. In parallel, MedusaDock, designed to predict reliable docking poses, was also used for ranking the CSAR ligands according to their docking scores; the resulting accuracy (Spearman correlation) for UK, ERK2, and CHK1 were 0.76, 0.31, and 0.26, respectively. In addition, performance of several consensus approaches combining MedusaDock- and QSAR-predicted ranks altogether has been explored; the best approach yielded Spearman correlation coefficients for UK, ERK2, and CHK1 of 0.82, 0.50, and 0.45, respectively. This study shows that (i) externally validated 2D QSAR models were capable of ranking CSAR ligands at least as accurately as more computationally intensive structure-based approaches used both by us and by other groups and (ii) ligand-based QSAR models can complement structure-based approaches by boosting the prediction performances when used in consensus.", "paper_title": "Predicting Binding Affinity of CSAR Ligands Using Both Structure-Based and Ligand-Based Approaches", "paper_id": "WOS:000323797700008"}