{"auto_keywords": [{"score": 0.02994846263118798, "phrase": "olejnik"}, {"score": 0.00481495049065317, "phrase": "efficient_coding-based_quantum_protocol"}, {"score": 0.0045357787854931894, "phrase": "n_items"}, {"score": 0.004126349202545883, "phrase": "encoding-decoding_process"}, {"score": 0.0040048667115255, "phrase": "database-specific_unitary_operation"}, {"score": 0.0035891316580885665, "phrase": "even_a_dishonest_user"}, {"score": 0.003380791705551809, "phrase": "dishonest_database"}, {"score": 0.003281186608301359, "phrase": "original_system"}, {"score": 0.0029403531729828574, "phrase": "coding-based_quantum_private_database_query_protocols"}, {"score": 0.0027420820738468577, "phrase": "dishonest_databases"}, {"score": 0.0026086775334428617, "phrase": "olejnik's_protocol"}, {"score": 0.0025571463140118805, "phrase": "superposed_states"}, {"score": 0.002444883254621769, "phrase": "dishonest-but-conscientious_database"}, {"score": 0.0023609780669713288, "phrase": "user_right_answers"}, {"score": 0.002268598551466928, "phrase": "significant_information"}, {"score": 0.002126111716875142, "phrase": "user_privacy"}], "paper_keywords": ["Private Database Query", " Coding-based", " Quantum Information", " Entanglement"], "paper_abstract": "We propose an efficient coding-based quantum protocol which uses entanglement to help a user retrieve one out of N items from a database without revealing which one he/she is interested in. The query is accomplished through an encoding-decoding process with the support of a database-specific unitary operation. For each query, O(log N) time is needed for communication and no more than one bit of information about the database can be learnt by even a dishonest user. We prove rigorously that the protocol is secure against a dishonest database which causes little deviation on the original system. A theorem quantitatively describes the tradeoff between information and disturbance in such a setting. Examples are given to illustrate that both coding-based quantum private database query protocols proposed so far, including ours and Olejnik's, are insecure against dishonest databases which are free to cause deviations. Compared to Olejnik's protocol, which utilizes superposed states rather than entanglement, our protocol can prevent a dishonest-but-conscientious database, which tries to provide the user right answers to his/her queries while eavesdropping, from learning significant information when it evaded his/her detection. Finally, for the purpose of enhancing user privacy, two extensions of the protocol are proposed and discussed.", "paper_title": "CODING-BASED QUANTUM PRIVATE DATABASE QUERY USING ENTANGLEMENT", "paper_id": "WOS:000333067900005"}