{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "directional_returns"}, {"score": 0.009691808531430835, "phrase": "biological_institutes"}, {"score": 0.004306877786389599, "phrase": "cas"}, {"score": 0.0037555742428544096, "phrase": "personnel_salaries"}, {"score": 0.003680216368915986, "phrase": "sci"}, {"score": 0.0032914982537805932, "phrase": "yang"}, {"score": 0.0031125795874844438, "phrase": "directional_congestion"}, {"score": 0.0030500051941781034, "phrase": "chinese_academy_of_sciences"}, {"score": 0.0026057256900479026, "phrase": "biological_institute"}, {"score": 0.002414544068560716, "phrase": "organizational_adjustment"}, {"score": 0.0021049977753042253, "phrase": "underlying_reason"}], "paper_keywords": ["Returns to scale (RTS)", " Directional returns to scale", " Congestion", " Directional congestion", " Evaluation of research institutes"], "paper_abstract": "This paper investigates directional returns to scale (RTS) and illustrates this approach by studying biological institutes of the Chinese Academy of Sciences (CAS). Using the following input-output indicators are proposed: senior professional and technical staffs, middle level and junior professional and technical staffs, research expenditure on personnel salaries and other expenditures, SCI papers, high-quality papers, graduates training and intellectual properties, the paper uses the methods recently proposed by Yang to analyze the directional returns to scale and the effect of directional congestion of biological institutes in Chinese Academy of Sciences. Based on our analysis we come to the following findings: (1) we detect the regime of directional returns to scale (increasing, constant, decreasing) for each biological institute. This information can be used as the basis for decision-making about organizational adjustment; (2) congestion and directional congestion occurs in several biological institutes. In such cases the outputs of these institutes decrease when the inputs increase. Such institutes should analyze the underlying reason for the occurrence of congestion so that S&T resources can be used more efficiently. (C) 2014 Elsevier Ltd. All rights reserved.", "paper_title": "A study on directional returns to scale", "paper_id": "WOS:000341376700016"}