{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "online_learning_of_rested"}, {"score": 0.004529093447865156, "phrase": "online_learning_problem"}, {"score": 0.0041316803676012155, "phrase": "centralized_setting"}, {"score": 0.0038862297330905836, "phrase": "k_finite-state_discrete-time_markov_chains"}, {"score": 0.003351381374975648, "phrase": "k_arms"}, {"score": 0.003088384809415812, "phrase": "decentralized_setting"}, {"score": 0.0030569913145731408, "phrase": "multiple_uncoordinated_players"}, {"score": 0.0023798115577749225, "phrase": "logarithmic_regret_algorithms"}, {"score": 0.0022154296909169826, "phrase": "logarithmic_regret"}, {"score": 0.0021595094738887767, "phrase": "optimal_centralized_arm_allocation"}, {"score": 0.0021049977753042253, "phrase": "extensive_discussion"}], "paper_keywords": ["Exploration-exploitation tradeoff", " multiarmed bandits", " online learning", " opportunistic spectrum access (OSA)", " regret", " restless bandits"], "paper_abstract": "In this paper, we study the online learning problem involving rested and restless bandits, in both a centralized and a decentralized setting. In a centralized setting, the system consists of a single player/user and a set of K finite-state discrete-time Markov chains (arms) with unknown state spaces (rewards) and statistics. The objective of the player is to decide in each step which M of the K arms to play over a sequence of trials so as to maximize its long-term reward. In a decentralized setting, multiple uncoordinated players each makes its own decision on which arm to play in a step, and if two or more players select the same arm simultaneously, a collision results and none of the players selecting that arm gets a reward. The objective of each player again is to maximize its long-term reward. We first show that logarithmic regret algorithms exist both for the centralized rested and restless bandit problems. For the decentralized setting, we propose an algorithm with logarithmic regret with respect to the optimal centralized arm allocation. Numerical results and extensive discussion are also provided to highlight insights obtained from this study.", "paper_title": "Online Learning of Rested and Restless Bandits", "paper_id": "WOS:000306518600039"}