{"auto_keywords": [{"score": 0.042782732344020774, "phrase": "body_representations"}, {"score": 0.004817352272078263, "phrase": "review"}, {"score": 0.004600100053651545, "phrase": "seemingly_simple_question"}, {"score": 0.004455409162867219, "phrase": "diverse_disciplines"}, {"score": 0.004179480763003705, "phrase": "substantial_efforts"}, {"score": 0.0035781807623238905, "phrase": "admiring_capabilities"}, {"score": 0.0034027387694902287, "phrase": "multiple_sensory_modalities"}, {"score": 0.0029396242707327986, "phrase": "functional_or_computational_perspective"}, {"score": 0.0027954035431845344, "phrase": "body_schema"}, {"score": 0.0026949679939994226, "phrase": "application-oriented_research"}, {"score": 0.002360132221690264, "phrase": "research_area"}, {"score": 0.002203570941628287, "phrase": "biological_body_representations"}, {"score": 0.0021340985236583017, "phrase": "research_areas"}, {"score": 0.0021049977753042253, "phrase": "future_research_directions"}], "paper_keywords": ["Body image", " body representation", " body schema", " forward model", " robotics", " self-calibration"], "paper_abstract": "How is our body imprinted in our brain? This seemingly simple question is a subject of investigations of diverse disciplines, psychology, and philosophy originally complemented by neurosciences more recently. Despite substantial efforts, the mysteries of body representations are far from uncovered. The most widely used notions-body image and body schema-are still waiting to be clearly defined. The mechanisms that underlie body representations are coresponsible for the admiring capabilities that humans or many mammals can display: combining information from multiple sensory modalities, controlling their complex bodies, adapting to growth, failures, or using tools. These features are also desirable in robots. This paper surveys the body representations in biology from a functional or computational perspective to set ground for a review of the concept of body schema in robotics. First, we examine application-oriented research: how a robot can improve its capabilities by being able to automatically synthesize, extend, or adapt a model of its body. Second, we summarize the research area in which robots are used as tools to verify hypotheses on the mechanisms underlying biological body representations. We identify trends in these research areas and propose future research directions.", "paper_title": "Body Schema in Robotics: A Review", "paper_id": "WOS:000294902400004"}