{"auto_keywords": [{"score": 0.041025976343579976, "phrase": "production_process"}, {"score": 0.00481495049065317, "phrase": "imperfect_production_process"}, {"score": 0.004763895422211728, "phrase": "quality_corrective_interruptions"}, {"score": 0.0038079353103469865, "phrase": "smaller_batch"}, {"score": 0.0036488111139918135, "phrase": "in-process_inventory"}, {"score": 0.0035338315037521627, "phrase": "setup_reduction"}, {"score": 0.0034963129868796033, "phrase": "increased_quality"}, {"score": 0.0033861224940737846, "phrase": "jit_environment"}, {"score": 0.0031760175583084274, "phrase": "production_problem"}, {"score": 0.0028391271282216758, "phrase": "quality_maintenance"}, {"score": 0.0024447258861321685, "phrase": "process_quality"}, {"score": 0.0021390191069313945, "phrase": "quality_restoration_action"}, {"score": 0.0021049977753042253, "phrase": "mathematical_model"}], "paper_keywords": ["lot sizing.", " setup reduction", " quality improvement", " reworks"], "paper_abstract": "The just-in-time (JIT) management philosophy advocates the elimination of waste or activities that add cost and not value to the product. Eliminating waste in the production process could be attained through smaller batch (lot) sizes and reduction of in-process inventory, where concepts such as setup reduction and increased quality are fundamental. In a JIT environment workers are authorized to stop production if a quality or a production problem arises, e.g., the production process going out-of-control. In such a case, the production process is interrupted for quality maintenance to bring the process in control again. This paper investigates the lot sizing problem for reduction in setups, with reworks, and interruptions to restore process quality. This paper assumes the rate of generating defects to benefit from any changes for eliminating the defects, and thus reduces with each quality restoration action. A mathematical model is developed and numerical examples are provided with results discussed. (c) 2006 Elsevier Ltd. All rights reserved.", "paper_title": "Lot sizing for an imperfect production process with quality corrective interruptions and improvements, and reduction in setups", "paper_id": "WOS:000243055300015"}