{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "evaluating_video_trackers"}, {"score": 0.0047563776685277314, "phrase": "real-world_conditions"}, {"score": 0.00458488025289647, "phrase": "commonly_adopted_performance_evaluation_framework"}, {"score": 0.00436575511349828, "phrase": "effective_video_trackers"}, {"score": 0.0041316803676012155, "phrase": "single-score_evaluation_measure"}, {"score": 0.0038862297330905836, "phrase": "proposed_measure"}, {"score": 0.0031747618267940155, "phrase": "test_scenarios"}, {"score": 0.002641360377825228, "phrase": "background_clutter"}, {"score": 0.0025615908073796027, "phrase": "scale_changes"}, {"score": 0.002183938718432764, "phrase": "evaluation_results"}, {"score": 0.0021049977753042253, "phrase": "new_results"}], "paper_keywords": ["Evaluation measure", " performance evaluation", " protocol", " trials", " video trackers"], "paper_abstract": "The absence of a commonly adopted performance evaluation framework is hampering advances in the design of effective video trackers. In this paper, we present a single-score evaluation measure and a protocol to objectively compare trackers. The proposed measure evaluates tracking accuracy and failure, and combines them for both summative and formative performance assessment. The proposed protocol is composed of a set of trials that evaluate the robustness of trackers on a range of test scenarios representing several real-world conditions. The protocol is validated on a set of sequences with a diversity of targets (head, vehicle and person) and challenges (occlusions, background clutter, pose changes and scale changes) using six state-of-the-art trackers, highlighting their strengths and weaknesses on more than 187000 frames. The software implementing the protocol and the evaluation results are made available online and new results can be included, thus facilitating the comparison of trackers.", "paper_title": "A Protocol for Evaluating Video Trackers Under Real-World Conditions", "paper_id": "WOS:000318016600008"}