{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "regulation_feedback"}, {"score": 0.04935669810434817, "phrase": "computer-based_formative_assessment"}, {"score": 0.004073113268289532, "phrase": "automated_regulation_feedback"}, {"score": 0.003991305899593133, "phrase": "student_performance"}, {"score": 0.003606178185661875, "phrase": "significant_increase"}, {"score": 0.003393115177189967, "phrase": "expert_grades"}, {"score": 0.0033588449972778004, "phrase": "significant_improvement"}, {"score": 0.0031926001871260524, "phrase": "formative_assessment_system"}, {"score": 0.002769483748975581, "phrase": "significantly_more_websites"}, {"score": 0.0026457367614424756, "phrase": "average_number"}, {"score": 0.002426842369975213, "phrase": "significant_differences"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Learning analytics", " Assessment for learning", " Information literacy", " Self-assessment"], "paper_abstract": "This study examines the effect of regulation feedback in a computer-based formative assessment in the context of searching for information online. Fifty 13-year-old students completed two randomly selected assessment tasks, receiving automated regulation feedback between them. Student performance was (self-)graded by students and by experts. Expert, as well as student (self)grades showed a significant increase between Task 1 and Task 2. However, further analysis of the expert grades showed significant improvement in performance for girls only. Furthermore, the formative assessment system traced the number of searches and the number of websites consulted per student to complete the two assignments. On average, the results showed that students consulted significantly more websites for Task 2, compared to Task 1. The average number of searches did not differ significantly between Tasks 1 and 2. On the other hand, significant differences were found for those students who, during the evaluation of their performance on Task 1, explicitly stated that they would increase their searches. (C) 2015 Elsevier Ltd. All rights reserved.", "paper_title": "The effect of regulation feedback in a computer-based formative assessment on information problem solving", "paper_id": "WOS:000364253600001"}