{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "clinical_indicators"}, {"score": 0.04922171249891996, "phrase": "tertiary_hospital"}, {"score": 0.034492541127787345, "phrase": "dw-based_ci_monitoring_system"}, {"score": 0.004765482708043842, "phrase": "data_warehouse"}, {"score": 0.004231699728933577, "phrase": "ci_data"}, {"score": 0.003967021436047945, "phrase": "efficient_managing_quality_indicators"}, {"score": 0.003826072524597438, "phrase": "dw-based_ci_monitoring"}, {"score": 0.003757480190200645, "phrase": "system's_operation"}, {"score": 0.0035497797026638033, "phrase": "south_korea"}, {"score": 0.003459191419478298, "phrase": "patient_safety"}, {"score": 0.0033883824438527316, "phrase": "fully_digital_hospital"}, {"score": 0.0033362680301834177, "phrase": "cis"}, {"score": 0.0032259472087775138, "phrase": "computerized_cis"}, {"score": 0.0031927521355659115, "phrase": "monitoring_results"}, {"score": 0.0031354779851351287, "phrase": "optimal_prescribing"}, {"score": 0.0031193028729331667, "phrase": "preventive_antibiotics"}, {"score": 0.002582542204672381, "phrase": "related_department"}, {"score": 0.002420762293555924, "phrase": "optimum_level"}, {"score": 0.002408265305704217, "phrase": "patient_care"}, {"score": 0.002316566740923763, "phrase": "clinical_effectiveness"}, {"score": 0.0022749744354271816, "phrase": "systems_operation_experience"}, {"score": 0.0022225915717768003, "phrase": "medical_institutions"}, {"score": 0.0021601997088758957, "phrase": "policy_making"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ireland_ltd."}], "paper_keywords": ["Hospital information systems", " Integrated advanced information management systems", " Health information management", " Quality of care", " Data warehouse"], "paper_abstract": "Objective: Assessing and monitoring care and service using clinical indicators (CIs) can allow the measurement of and lead to improvements in the quality of care. However, the management and maintenance of CI data has been shown to be difficult because the data are usually collected and provided manually. In this study, for the purpose of efficient managing quality indicators, a data warehouse (DW)-based CI monitoring system was developed. The clinical effectiveness and efficiency of a DW-based CI monitoring was investigated through several case studies of the system's operation at a tertiary hospital. Methods: This study analyzed the CIs that have been developed over the past 8 years at a 1340-bed tertiary general university hospital in South Korea to improve and monitor the quality of care and patient safety. The hospital was opened as a fully digital hospital in 2003, and the CIs were computerized in 2005 by implementing a DW-based CI monitoring system. We classified the computerized CIs and evaluated the monitoring results for several representative CIs, such as the optimal prescribing of preventive antibiotics, the average length of stay, the mortality rate, and the rehospitalization rate. Results: During the development of the system in 2005, 12 of 19 CIs were computerized, and this number gradually increased until 299 of 335 CIs were computerized by 2012. In addition, among the CIs built computationally through the CI task force team, focal CIs subject to monitoring were selected annually, and the results of this monitoring were shared with all of the staff or the related department and its staff. By providing some examples of our CI monitoring results, we showed the feasibility of improving the quality of care, and maintaining the optimum level of patient care with less labor. Conclusions: The results of this study provide evidence regarding the clinical effectiveness and efficiency as well as the systems operation experience of a DW-based CI monitoring system. These findings may aid medical institutions that plan on computerizing CIs with respect to decision and policy making regarding their systems development and operations. (C) 2014 Elsevier Ireland Ltd. All rights reserved.", "paper_title": "Electronically implemented clinical indicators based on a data warehouse in a tertiary hospital: Its clinical benefit and effectiveness", "paper_id": "WOS:000339735700008"}