{"auto_keywords": [{"score": 0.04749178419281337, "phrase": "non-homogeneous_flux_jump_condition"}, {"score": 0.00481495049065317, "phrase": "electric_potential_interface_problem"}, {"score": 0.004152502093643003, "phrase": "plasma_simulation"}, {"score": 0.003976978140059542, "phrase": "total_electric_quantity"}, {"score": 0.0031845067058084613, "phrase": "structured_meshes"}, {"score": 0.0029937855454238507, "phrase": "iterative_method"}, {"score": 0.0029027394930867902, "phrase": "immersed_finite_element"}, {"score": 0.002797121441432477, "phrase": "non-homogeneous_flux_jump_conditions"}, {"score": 0.0027457584014804574, "phrase": "regular_finite_element_method"}, {"score": 0.002518227743688769, "phrase": "potential_field"}, {"score": 0.0023382335380460304, "phrase": "numerical_experiments"}, {"score": 0.0021845387990972543, "phrase": "proposed_method"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Iterative method", " Immersed finite elements", " Conducting object", " Surface charging"], "paper_abstract": "Interface problems involving the non-homogeneous flux jump condition are critical for engineering designs in the magnetostatic/electrostatic field. In applications, such as plasma simulation, we often only know the total electric quantity on the surface of the object, not the charge density distribution on the surface which appears as the non-homogeneous flux jump condition in the usual interface problems considered in the literature for the magnetostatic/electrostatic field. Based on structured meshes independent of the interface, this article proposes an iterative method that employs both the immersed finite element (IFE) method with non-homogeneous flux jump conditions and the regular finite element method with ghost nodes introduced in the object to solve the 2D interface problem for the potential field according to the given total electric quantity on the surface of the object. Numerical experiments are provided to illustrate the accuracy and efficiency of the proposed method. (C) 2014 Elsevier Inc. Allrightsreserved.", "paper_title": "An iterative immersed finite element method for an electric potential interface problem based on given surface electric quantity", "paper_id": "WOS:000346429300005"}