{"auto_keywords": [{"score": 0.04576235293029701, "phrase": "information_exchange_decisions"}, {"score": 0.03843856552198327, "phrase": "ned-decop"}, {"score": 0.00481495049065317, "phrase": "effective_human-computer_teamwork"}, {"score": 0.004728499903204582, "phrase": "information_exchange"}, {"score": 0.004694353795114243, "phrase": "collaborative_group_activities"}, {"score": 0.004660453113061494, "phrase": "mixed_networks"}, {"score": 0.0045933810497156705, "phrase": "computer_agents"}, {"score": 0.004478308876320956, "phrase": "\"nearly_decomposable\"_decision-making_problems"}, {"score": 0.004272164161788242, "phrase": "decision-making_problems"}, {"score": 0.004165105357908494, "phrase": "action_structure"}, {"score": 0.003831801113154043, "phrase": "formal_model"}, {"score": 0.003804105622385469, "phrase": "nearly_decomposable_decision-making_problems"}, {"score": 0.003681923235979914, "phrase": "approximation_algorithm"}, {"score": 0.0036157418067192136, "phrase": "efficient_information_exchange_strategies"}, {"score": 0.0034742854447532678, "phrase": "prior_collaborative_planning_algorithms"}, {"score": 0.003350480663660326, "phrase": "empirical_study"}, {"score": 0.0031614748814351823, "phrase": "interruption_requests"}, {"score": 0.0031272381208680613, "phrase": "computer_agent"}, {"score": 0.0027641218567092665, "phrase": "key_factors"}, {"score": 0.0027441220799352926, "phrase": "people's_perception"}, {"score": 0.0023817332409567403, "phrase": "domain_features"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Collaborative decision-making", " Interruption management", " Human-computer teamwork"], "paper_abstract": "This paper studies information exchange in collaborative group activities involving mixed networks of people and computer agents. It introduces the concept of \"nearly decomposable\" decision-making problems to address the complexity of information exchange decisions in such multi-agent settings. This class of decision-making problems arise in settings which have an action structure that requires agents to reason about only a subset of their partners' actions - but otherwise allows them to act independently. The paper presents a formal model of nearly decomposable decision-making problems, NED-MDPs, and defines an approximation algorithm, NED-DECOP that computes efficient information exchange strategies. The paper shows that NED-DECOP is more efficient than prior collaborative planning algorithms for this class of problem. It presents an empirical study of the information exchange decisions made by the algorithm that investigates the extent to which people accept interruption requests from a computer agent. The context for the study is a game in which the agent can ask people for information that may benefit its individual performance and thus the group's collaboration. This study revealed the key factors affecting people's perception of the benefit of interruptions in this setting. The paper also describes the use of machine learning to predict the situations in which people deviate from the strategies generated by the algorithm, using a combination of domain features and features informed by the algorithm. The methodology followed in this work could form the basis for designing agents that effectively exchange information in collaborations with people. (C) 2012 Elsevier B.V. All rights reserved.", "paper_title": "Modeling information exchange opportunities for effective human-computer teamwork", "paper_id": "WOS:000315839600020"}