{"auto_keywords": [{"score": 0.03452834301390204, "phrase": "dirichlet"}, {"score": 0.015491045049478389, "phrase": "dna_sequence_segmentation"}, {"score": 0.0048156217757041155, "phrase": "markov"}, {"score": 0.004366387782457736, "phrase": "hidden_markov_model"}, {"score": 0.004323886831151445, "phrase": "homogeneous_segments"}, {"score": 0.00428179779071721, "phrase": "dna_sequences"}, {"score": 0.004057495982111461, "phrase": "fetoprotein_gene"}, {"score": 0.003959447096055027, "phrase": "important_role"}, {"score": 0.003920891569777894, "phrase": "embryonic_development"}, {"score": 0.003572766402294553, "phrase": "prior_specification"}, {"score": 0.0035384464858301415, "phrase": "bayesian"}, {"score": 0.003520687960750365, "phrase": "hidden_markov_models"}, {"score": 0.002937318465594425, "phrase": "sensitivity_analysis"}, {"score": 0.0028944757265206332, "phrase": "importance_sampling"}, {"score": 0.002254510319372956, "phrase": "posterior_estimates"}, {"score": 0.0021049977753042253, "phrase": "richer_sensitivity_analysis"}], "paper_keywords": [""], "paper_abstract": "The sensitivity to the specification of the prior in a hidden Markov model describing homogeneous segments of DNA sequences is considered. An intron from the chimpanzee at-fetoprotein gene, which plays an important role in embryonic development in mammals, is analysed. Three main aims are considered: (i) to assess the sensitivity to prior specification in Bayesian hidden Markov models for DNA sequence segmentation; (ii) to examine the impact of replacing the standard Dirichlet prior with a mixture Dirichlet prior; and (iii) to propose and illustrate a more. comprehensive approach to sensitivity analysis, using importance sampling. It is obtained that (i) the posterior estimates obtained under a Bayesian hidden Markov model are indeed sensitive to the specification of the prior distributions; (ii) compared with the standard Dirichlet prior, the mixture Dirichlet prior is more flexible, less sensitive to the choice of hyperparameters and less constraining in the analysis, thus improving posterior estimates; and (iii) importance sampling was computationally feasible, fast and effective in allowing a richer sensitivity analysis. (C) 2008 Elsevier B.V. All rights reserved.", "paper_title": "Bayesian hidden Markov model for DNA sequence segmentation: A prior sensitivity analysis", "paper_id": "WOS:000264751000032"}