{"auto_keywords": [{"score": 0.0294942684716965, "phrase": "invariant_subspace"}, {"score": 0.01935759244896503, "phrase": "embedding_subspace"}, {"score": 0.016432568554106543, "phrase": "csw"}, {"score": 0.010134600012677339, "phrase": "secret_carriers"}, {"score": 0.00689852512284162, "phrase": "orthogonally_invariant_distribution"}, {"score": 0.006819254195320474, "phrase": "higher_dimensional_subspace"}, {"score": 0.004544016163767266, "phrase": "watermarked_only_attack"}, {"score": 0.004388796812234033, "phrase": "existing_cw_schemes"}, {"score": 0.004288261454002681, "phrase": "malicious_watermark_removal_attack"}, {"score": 0.004109865377936045, "phrase": "low_security"}, {"score": 0.003954109842050071, "phrase": "low_robustness"}, {"score": 0.003878451139312637, "phrase": "existing_cw_scheme"}, {"score": 0.0036884198249734863, "phrase": "new_cw_technique"}, {"score": 0.003310047704590791, "phrase": "host_signal"}, {"score": 0.0032718761046588835, "phrase": "orthogonal_complement"}, {"score": 0.0031599739264865554, "phrase": "watermarked_signal"}, {"score": 0.0028798723050615788, "phrase": "freely_chosen_orthogonal_matrix"}, {"score": 0.0024010535322709033, "phrase": "experiment_results"}, {"score": 0.002364172626241202, "phrase": "robustness-security_tradeoff"}], "paper_keywords": ["Robustness", " spread spectrum watermarking", " watermarked only attack (WOA)", " watermarking security"], "paper_abstract": "The circular watermarking (CW) technique has attracted increasing attention because it can resist the estimation of secret carriers in the watermarked only attack (WOA) framework. However, the existing CW schemes are not applicable whenever a malicious watermark removal attack can take place. This is because they either have low security because the attacker can disclose the embedding subspace or have low robustness. Based on an existing CW scheme called transportation natural watermarking (TNW), this correspondence presents a new CW technique for the tradeoff between robustness and security, which we refer to as controllable secure watermarking (CSW). The idea behind the CSW is that by altering the host signal in the orthogonal complement of the embedding subspace, we can make the watermarked signal have an orthogonally invariant distribution in a higher dimensional subspace including the embedding subspace. Orthogonally invariant distribution essentially requires that the distribution does not change if multiplied by any freely chosen orthogonal matrix, and the higher dimensional subspace is referred to as invariant subspace. We prove that the attacker can only reduce the uncertainty of secret carriers up to the invariant subspace. The dimension of the invariant subspace can be used for the tradeoff between robustness and security. Further, the experiment results show that the robustness-security tradeoff provided by the CSW is efficient. In particular, with the increase of the dimension of the invariant subspace, the security of the CSW will increase quickly while its robustness will only decrease slowly.", "paper_title": "Controllable Secure Watermarking Technique for Tradeoff Between Robustness and Security", "paper_id": "WOS:000301506500040"}