{"auto_keywords": [{"score": 0.030743666787447315, "phrase": "alignment_method"}, {"score": 0.014441357325024315, "phrase": "english"}, {"score": 0.013685772808415717, "phrase": "multilingual_corpora"}, {"score": 0.012402032661266734, "phrase": "european_languages"}, {"score": 0.011543808959853892, "phrase": "parallel_corpora"}, {"score": 0.00481495049065317, "phrase": "parallel_corpus"}, {"score": 0.00391167729353583, "phrase": "cross-lingual_information_retrieval_and_machine_translation"}, {"score": 0.0034623203126093833, "phrase": "asian_languages"}, {"score": 0.003369669078274226, "phrase": "chinese_and_english_title_pairs"}, {"score": 0.0032794890195334513, "phrase": "english-chinese_parallel_corpus"}, {"score": 0.0030644247579222333, "phrase": "careful_analysis"}, {"score": 0.0028248293967214947, "phrase": "conceptual_analysis"}, {"score": 0.002712131567923321, "phrase": "conceptual_equivalent"}, {"score": 0.002687702958515561, "phrase": "conceptual_information_alternation"}, {"score": 0.0026514708899935333, "phrase": "aligned_and_nonaligned_english-chinese_title_pairs"}, {"score": 0.002232579371411544, "phrase": "conceptual_alternation"}, {"score": 0.0021049977753042253, "phrase": "significant_impact"}], "paper_keywords": [""], "paper_abstract": "As illustrated by the World Wide Web, the volume of information in languages other than English has grown significantly in recent years. This highlights the importance of multilingual corpora. Much effort has been devoted to the compilation of multilingual corpora for the purpose of cross-lingual information retrieval and machine translation. Existing parallel corpora mostly involve European languages, such as English-French and English-Spanish. There is still a lack of parallel corpora between European languages and Asian languages. In the authors' previous work, an alignment method to identify one-to-one Chinese and English title pairs was developed to construct an English-Chinese parallel corpus that works automatically from the World Wide Web, and a 100% precision and 87% recall were obtained. Careful analysis of these results has helped the authors to understand how the alignment method can be improved. A conceptual analysis was conducted, which includes the analysis of conceptual equivalent and conceptual information alternation in the aligned and nonaligned English-Chinese title pairs that are obtained by the alignment method. The result of the analysis not only reflects the characteristics of parallel corpora, but also gives insight into the strengths and weaknesses of the alignment method. In particular, conceptual alternation, such as omission and addition, is found to have a significant impact on the performance of the alignment method.", "paper_title": "Conceptual analysis of parallel corpus collected from the web", "paper_id": "WOS:000235870100005"}