{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "duplication"}, {"score": 0.004727678014364335, "phrase": "software_product_line_engineering"}, {"score": 0.004288139217156765, "phrase": "feature_models"}, {"score": 0.00410886951639144, "phrase": "constructed_fms"}, {"score": 0.00405903443476192, "phrase": "feature-oriented_development"}, {"score": 0.0040220535813966255, "phrase": "existing_methods"}, {"score": 0.0039250703697261595, "phrase": "developed_applications"}, {"score": 0.0037955107949094124, "phrase": "analyzers'_intuitions"}, {"score": 0.0036590276279709955, "phrase": "accuracy_measurements"}, {"score": 0.0036036131261225936, "phrase": "mathematics-based_theoretical_verification_methods"}, {"score": 0.003484627161645746, "phrase": "refinement_technique"}, {"score": 0.0034213843123968154, "phrase": "fm_accuracy"}, {"score": 0.0033490453422160677, "phrase": "abnormal_feature_duplications"}, {"score": 0.0032384375096920024, "phrase": "potential_ambiguities"}, {"score": 0.003141048102090638, "phrase": "target_domain"}, {"score": 0.0029369469007332963, "phrase": "formalized_attributes"}, {"score": 0.0027210199396428465, "phrase": "analysis_matrix"}, {"score": 0.0025132370375220213, "phrase": "supporting_analyzer"}, {"score": 0.002482706594054615, "phrase": "initial_fm"}, {"score": 0.002407989349089638, "phrase": "feature_duplications"}, {"score": 0.002364240149100421, "phrase": "saved_attribute_data"}, {"score": 0.00221726957085921, "phrase": "common_features"}, {"score": 0.0022037570028628295, "phrase": "higher_reusability"}, {"score": 0.0021571068309076845, "phrase": "support_tools"}, {"score": 0.0021049977753042253, "phrase": "similarity_analysis"}], "paper_keywords": ["Feature model", " refinement", " duplication", " collision", " relationship between feature attribute", " reuse"], "paper_abstract": "In software product line engineering (SPLE), many studies have been conducted on commonality-and variability-based feature extraction methods and on the reasoning and refinement of feature models (FMs), aiming to enhance the appropriateness and reusability of the constructed FMs in compliance with feature-oriented development. The existing methods, however, failed to assure the developed applications that contain ambiguities between the features generated in FMs by analyzers' intuitions, and hindered the reuse of such applications. Moreover, the accuracy measurements of models based on mathematics-based theoretical verification methods are difficult to apply in practice. Therefore, a refinement technique is demanded to enhance the FM accuracy. This paper aims to identify abnormal feature duplications and collisions based on the feature attributes to address the potential ambiguities between the features in an FM generated for a target domain, and to construct more precise FMs by presenting a technique for eliminating such abnormalities. For this purpose, the profiles of the formalized attributes were first defined based on MDR. Based on the semantics and relationships between the attributes, the duplications and collisions were identified using an analysis matrix, and were generalized to formulate rules by level. Such rules were evaluated to remove the duplications and collisions. In addition, using a supporting analyzer, the features in the initial FM were registered on a repository and were analyzed for feature duplications and collisions based on the saved attribute data. The refinements of the ambiguities between such features are likely to enable the construction of more precise application FMs and the generation of common features with higher reusability. Further, the environments using support tools are expected to provide convenience in the similarity analysis and reuse of features.", "paper_title": "A Refinement Technique for Duplication and Collision Between Features in Software Product Line Engineering", "paper_id": "WOS:000341843100001"}