{"auto_keywords": [{"score": 0.049509300669177574, "phrase": "wireless_sensor_network"}, {"score": 0.00481495049065317, "phrase": "hierarchy_structure"}, {"score": 0.004535124351828787, "phrase": "wireless_sensor_network_systems"}, {"score": 0.00414545383888272, "phrase": "computational_process"}, {"score": 0.0035473867669654174, "phrase": "multiple_groups"}, {"score": 0.003361069456060196, "phrase": "sensors_grouping_hierarchy_structure"}, {"score": 0.0023877589586497948, "phrase": "grouped_based_routing"}, {"score": 0.0023592715993204796, "phrase": "grouped_based_object_tracking"}, {"score": 0.0023171750718791713, "phrase": "proposed_grouping_structure"}, {"score": 0.0022758279600841014, "phrase": "good_performance"}, {"score": 0.0022486729928886885, "phrase": "energy_consumption"}, {"score": 0.0022218413146898887, "phrase": "energy_dissipation"}, {"score": 0.0021953290937408807, "phrase": "data_routing"}, {"score": 0.0021049977753042253, "phrase": "object_tracking"}], "paper_keywords": [""], "paper_abstract": "There are many challenges in implementation of wireless sensor network systems: clustering and grouping are two of them. The grouping of sensors is computational process intended to partition the sensors of network into groups. Each group contains a number of sensors and a sensor can be an element of multiple groups. In this paper, we provided a Sensors Grouping Hierarchy Structure (GHS) to split the nodes in wireless sensor network into groups to assist the collaborative, dynamic, distributed computing and communication of the system. Our idea is to partition the nodes according to their geographical maximum covered regions such that each group contains a number of nodes and a number of leaders. To evaluate the performance of our proposed grouping structure, we have implemented a Grouped based routing and Grouped based object tracking. The proposed grouping structure shows a good performance in energy consumption and energy dissipation during data routing and it generates a little redundant data during object tracking.", "paper_title": "Sensors Grouping Hierarchy Structure for Wireless Sensor Network", "paper_id": "WOS:000360475100001"}