{"auto_keywords": [{"score": 0.04165700301537227, "phrase": "sm"}, {"score": 0.010501906681488565, "phrase": "knowledge_protection_challenges"}, {"score": 0.00844656098931182, "phrase": "eight_questions"}, {"score": 0.00481495049065317, "phrase": "knowledge_protection_challenges_of_social_media"}, {"score": 0.004687645903373103, "phrase": "social_media"}, {"score": 0.004563691742821759, "phrase": "new_means"}, {"score": 0.004364310576600359, "phrase": "new_challenges"}, {"score": 0.004306205029641728, "phrase": "confidential_information"}, {"score": 0.004063186599879217, "phrase": "knowledge_protection"}, {"score": 0.004027031316965272, "phrase": "security-oriented_knowledge_management_processes"}, {"score": 0.0038855864345030563, "phrase": "previous_studies"}, {"score": 0.003367611042980526, "phrase": "main_contribution"}, {"score": 0.0030248298759040695, "phrase": "five_special_characteristics"}, {"score": 0.0028539179130824786, "phrase": "private_and_professional_identity"}, {"score": 0.0023968383387667404, "phrase": "practical_implications"}, {"score": 0.002251227801482381, "phrase": "knowledge_management"}], "paper_keywords": ["case study", " knowledge management", " knowledge protection", " social media", " qualitative research"], "paper_abstract": "Although social media (SM) represents a new means of creating and sharing knowledge, it also presents new challenges for protecting confidential information and other data that companies do not want to share. However, knowledge protection and security-oriented knowledge management processes related to SM have received little attention in previous studies. This research attempts to close that gap by examining which information and knowledge protection challenges arise from employees' use of SM, why they arise, and how organizations can address them. The main contribution of this study is a framework that integrates three types of knowledge protection challenges (information security challenges; reputation challenge; management challenges) with five special characteristics of SM (information distribution speed; blurry audience; merging of private and professional identity; easily collectible information; generation transition), which explain why these challenges arise. In addition, the framework presents eight questions that organizations should answer to help them address the three types of knowledge protection challenges. Our findings have practical implications: by answering the eight questions proposed in this study, companies can create knowledge management and protection policies for SM. Furthermore, the findings in this study open up several future research questions.", "paper_title": "Knowledge Protection Challenges of Social Media Encountered by Organizations", "paper_id": "WOS:000315585300003"}