{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "minimum_link"}, {"score": 0.038736114692785546, "phrase": "best_solution"}, {"score": 0.004778924922749678, "phrase": "node"}, {"score": 0.004645057834614705, "phrase": "communication_networks"}, {"score": 0.004608121749000898, "phrase": "multiple_disjoint_communication_paths"}, {"score": 0.0038655854071187115, "phrase": "disjoint_multiple_paths"}, {"score": 0.0033077610063168093, "phrase": "general_framework"}, {"score": 0.002957471572421436, "phrase": "link_shareability"}, {"score": 0.002933915104498416, "phrase": "node_shareability"}, {"score": 0.0028529310661977577, "phrase": "minimum-cost_multiple_paths"}, {"score": 0.0026547761341670505, "phrase": "specific_version"}, {"score": 0.002623111480310373, "phrase": "mcmpms_problem"}, {"score": 0.002581477142020187, "phrase": "previously_published_technical_report"}, {"score": 0.0023545567809591804, "phrase": "unified_algorithmic_approach"}, {"score": 0.0022262909736042212, "phrase": "polynomial-time_algorithms"}, {"score": 0.0021647968783414504, "phrase": "mcmpms."}], "paper_keywords": ["Algorithm", " complexity", " disjoint paths", " graph", " multiple paths", " network", " network flow", " network planning", " protection", " protocol", " reliability", " routing", " survivability"], "paper_abstract": "In communication networks, multiple disjoint communication paths are desirable for many applications. Such paths, however, may not exist in a network. In such a situation, paths with minimum link and/or node sharing may be considered. This paper addresses the following two related fundamental questions. First, in case of no solution of disjoint multiple paths for a given application instance, what are the criteria for finding the best solution in which paths share nodes and/or links? Second, if we know the criteria, how do we find the best solution? We propose a general framework for the answers to these two questions. This framework can be configured in a way that is suitable for a given application instance. We introduce the notion of link shareability and node shareability and consider the problem of finding minimum-cost multiple paths subject to minimum shareabilities (MCMPMS problem). We identify 65 different link/node shareability constraints, each leading to a specific version of the MCMPMS problem. In a previously published technical report, we prove that all the 65 versions are mutually inequivalent. In this paper, we show that all these versions can be solved using a unified algorithmic approach that consists of two algorithm schemes, each of which can be used to generate polynomial-time algorithms for a set of versions of MCMPMS. We also discuss some extensions where our modeling framework and algorithm schemes are applicable.", "paper_title": "Minimum-Cost Multiple Paths Subject to Minimum Link and Node Sharing in a Network", "paper_id": "WOS:000283446200008"}