{"auto_keywords": [{"score": 0.05007830598577475, "phrase": "science_gateways"}, {"score": 0.03696244992309852, "phrase": "bmc"}, {"score": 0.03586096711343382, "phrase": "business_model"}, {"score": 0.015505262476389938, "phrase": "business_model_canvas"}, {"score": 0.00465067040500426, "phrase": "neuroscience_gateway"}, {"score": 0.004476399615305783, "phrase": "active_discussion"}, {"score": 0.004293693193836074, "phrase": "temporary_research_and_infrastructure_projects"}, {"score": 0.0040334640350288, "phrase": "continuous_exploitation"}, {"score": 0.00386876598761639, "phrase": "business_considerations"}, {"score": 0.003571591012750155, "phrase": "lean_business_development"}, {"score": 0.0034376160364306637, "phrase": "structured_reflection"}, {"score": 0.0033549790559972053, "phrase": "alternative_ones"}, {"score": 0.00308640411961867, "phrase": "amc"}, {"score": 0.002980916123365584, "phrase": "current_gateway"}, {"score": 0.0028000270988465486, "phrase": "alternative_business_models"}, {"score": 0.002742196991950893, "phrase": "bmc_iteration"}, {"score": 0.0024533019565858073, "phrase": "complete_business_picture"}, {"score": 0.0021871503075921537, "phrase": "academic_groups"}, {"score": 0.002149418970824546, "phrase": "business_training"}], "paper_keywords": ["science gateway (SG)", " virtual research environment (VRE)", " Business Model Canvas (BMC)", " sustainability"], "paper_abstract": "The sustainability of science gateways has been a topic of active discussion because they have been created and supported in the context of temporary research and infrastructure projects. As successful projects come to an end, it is necessary to find (new) models to secure continuous exploitation of products generated by these projects. Taking this step requires business considerations that are not trivial to do from the role of a researcher. This paper presents our experiences in adopting a methodology from lean business development, the Business Model Canvas (BMC). This methodology enables structured reflection upon the business model and facilitates exploring alternative ones (pivoting). We have applied the BMC to one of the science gateways designed, developed, and operated by the Academic Medical Center (AMC) e-Science group: the AMC Computational Neuroscience Gateway. The current gateway BMC is explained in the paper and used as basis for a reflection to improve its sustainability. Alternative business models are given as examples of BMC iteration or pivots. This exercise helped us to structure the various aspects to be considered when designing or reflecting upon the business model of our gateway. It also facilitated the visualization of the complete business picture and helps the reflection about improvements in the business model toward sustainability. We believe that this methodology could be valuable also for the reflection about sustainability of other science gateways that are growing from academic groups that do not have business training. Copyright (c) 2015John Wiley & Sons, Ltd.", "paper_title": "Reflections on science gateways sustainability through the business model canvas: case study of a neuroscience gateway", "paper_id": "WOS:000363470800016"}