{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "distributed_transactions"}, {"score": 0.01514825094831351, "phrase": "privacy_protection"}, {"score": 0.014481783383141164, "phrase": "oot"}, {"score": 0.010903231761746767, "phrase": "privacy_policy"}, {"score": 0.010589100338299066, "phrase": "service_provider"}, {"score": 0.0046879169243805785, "phrase": "bilateral_symmetric_approach"}, {"score": 0.0046133037548004305, "phrase": "obligation_enforcement"}, {"score": 0.00437302709192313, "phrase": "privacy_assurance"}, {"score": 0.0043496956926564615, "phrase": "authorization_mechanism"}, {"score": 0.004280442521885289, "phrase": "xacml_standard"}, {"score": 0.003929219628225874, "phrase": "other's_requirements"}, {"score": 0.003887385438710442, "phrase": "authors_term"}, {"score": 0.003606711217432998, "phrase": "distributed_authorization_systems"}, {"score": 0.003587453609308639, "phrase": "stricter_privacy"}, {"score": 0.0035682984566721915, "phrase": "confidentiality_control"}, {"score": 0.003437036036889996, "phrase": "enterprise_service_provider"}, {"score": 0.00340954056723008, "phrase": "access_rights"}, {"score": 0.0033732206350186086, "phrase": "access_control_decisions"}, {"score": 0.0032058978923791078, "phrase": "access_control"}, {"score": 0.0027446057983474994, "phrase": "trust_protocol"}, {"score": 0.002686404707503387, "phrase": "different_scenarios"}, {"score": 0.0025056190491986943, "phrase": "communicating_party"}, {"score": 0.002465653420367008, "phrase": "digitally_signed_acceptance"}, {"score": 0.0024263237087568464, "phrase": "standard_language"}, {"score": 0.0023058614702473877, "phrase": "current_research"}, {"score": 0.0022935336076118696, "phrase": "trust_negotiation"}, {"score": 0.002214989839524726, "phrase": "standardized_protocols"}, {"score": 0.002162191230919859, "phrase": "signed_acceptance"}, {"score": 0.0021506298189636363, "phrase": "obligations_messages"}, {"score": 0.0021219954544970878, "phrase": "legal_case"}, {"score": 0.0021049977753042253, "phrase": "injured_party"}], "paper_keywords": ["Trust", " Privacy", " Distributed parameter control systems", " Data security"], "paper_abstract": "Purpose - This paper aims to describe a bilateral symmetric approach to authorization, privacy protection and obligation enforcement in distributed transactions. The authors introduce the concept of the obligation Of trust (OoT) protocol as a privacy assurance and authorization mechanism that is built upon the XACML standard. The OoT allows two communicating pal-ties to dynamically exchange their privacy and authorization requirements and capabilities, which the authors term a notification of obligation (NoB), as well as their commitments to fulfilling each other's requirements, which the authors term signed acceptance of obligations (SAO). The authors seek to describe some applicability of these concepts and to show how they can be integrated into distributed authorization systems for stricter privacy and confidentiality control. Design/methodology/approach - Existing access control and privacy protection systems are typically unilateral and provider-centric, in that the enterprise service provider assigns the access rights, makes the access control decisions, and determines the privacy policy. There is no negotiation between the client and the service provider about which access control or privacy policy to use. The authors adopt a symmetric, more user-centric approach to privacy protection and authorization, which treats the client and service provider as peers, in which both can stipulate their requirements and capabilities, and hence negotiate terms which are equally acceptable to both parties. Findings - The authors demonstrate how the obligation of trust protocol can be used in a number of different scenarios to improve upon the mechanisms that are currently available today. Practical implications - This approach will serve to increase trust in distributed transactions since each communicating party receives a difficult to repudiate digitally signed acceptance of obligations, in a standard language (XACML), which can be automatically enforced by their respective computing machinery. Originality/value - The paper adds to current research in trust negotiation, privacy protection and authorization by combining all three together into one set of standardized protocols. Furthermore, by providing hard to repudiate signed acceptance of obligations messages, this strengthens the legal case of the injured party should a dispute arise.", "paper_title": "Obligations of trust for privacy and confidentiality in distributed transactions", "paper_id": "WOS:000265859500003"}