{"auto_keywords": [{"score": 0.02665097119789355, "phrase": "hmx."}, {"score": 0.00481495049065317, "phrase": "energetic_nitrogen-rich_ionic_salts"}, {"score": 0.004563691742821759, "phrase": "density_functional_theory"}, {"score": 0.004523103062368843, "phrase": "volume-based_thermodynamics_calculations"}, {"score": 0.004403480614319231, "phrase": "different_combinations"}, {"score": 0.004364310576600359, "phrase": "energetic_anions"}, {"score": 0.004267896572751978, "phrase": "crystal_densities"}, {"score": 0.004154995396099332, "phrase": "energetic_properties"}, {"score": 0.002841176824012961, "phrase": "negative_charge"}, {"score": 0.0027047136845332917, "phrase": "detonation_performance"}, {"score": 0.0025632898741546556, "phrase": "comparable_detonation_performance"}, {"score": 0.0025404470150468387, "phrase": "commonly_used_explosives"}, {"score": 0.0021049977753042253, "phrase": "proposed_reactions"}], "paper_keywords": ["Crystal density", " Density functional theory", " Detonation properties", " Heats of formation", " Thermodynamics of salt formation"], "paper_abstract": "We have performed density functional theory and volume-based thermodynamics calculations to study the effects of different combinations of energetic anions and cations on the crystal densities, heats of formation, energetic properties, and thermodynamics of formation for a series of 5-nitroiminotetrazolate-based ionic salts. The results show that the substitution of the -NO2, -NF2, -N-3, or -C(NO2)(3) group is helpful for increasing the densities of the salts. Incorporating every substituent (-NH2, -NO2, -NF2, -N-3, or -C(NO2)(3)) into the salt is favorable for improving its HOF and detonation performance. Incorporating the cation B1, B2, B10, or B11 into the salts is helpful for improving its detonation properties. Increasing negative charge for the 5-nitroiminotetrazolate-based salts is unfavorable for enhancing the density and detonation performance, but is helpful for increasing the HOFs. Many salts present comparable detonation performance with commonly used explosives RDX or HMX. Among them, 21 salts have near or better properties than HMX. The thermodynamics of formation of the salts show that the majority of the 5-nitroiminotetrazolate salts with the cation B1, B3, B9, B10, B12 could be synthesized by the proposed reactions.", "paper_title": "Theoretical studies of energetic nitrogen-rich ionic salts composed of substituted 5-nitroiminotetrazolate anions and various cations", "paper_id": "WOS:000321922600019"}