{"auto_keywords": [{"score": 0.049431441935382854, "phrase": "cooperative_intelligent_transportation_systems"}, {"score": 0.04181603952021973, "phrase": "iso"}, {"score": 0.003805788648230075, "phrase": "building_blocks"}, {"score": 0.0037297918570822876, "phrase": "reference_communication_architecture"}, {"score": 0.003679969180334367, "phrase": "cooperative_its._future_its_stations"}, {"score": 0.0033718991936259038, "phrase": "roadside_infrastructures"}, {"score": 0.0029672941061574375, "phrase": "internet_protocols"}, {"score": 0.002811770047652563, "phrase": "wide_adoption"}, {"score": 0.0027370835853738626, "phrase": "cooperative_its_communications"}, {"score": 0.002700485592691974, "phrase": "relatively_little_attention"}, {"score": 0.0025935941070969575, "phrase": "security_issues"}, {"score": 0.0021049977753042253, "phrase": "etsi_tc_its"}], "paper_keywords": ["ITS", " IPv6 networking", " security services", " security mechanisms", " security protocols", " pseudonym configuration", " cross-layered architecture"], "paper_abstract": "Cooperative Intelligent Transportation Systems (ITS) will turn up to us with safer and more efficient driving environments as well as convenient and infotainment features for future ITS stations. ETSI and ISO are completing the standardization of the building blocks of a reference communication architecture for cooperative ITS. Future ITS stations complying with this set of standards deployed in vehicles, at the roadside infrastructures and within the Internet are expected to communicate with each other through a combination of ITS dedicated communication protocols and legacy Internet protocols. However, in spite of the wide adoption of IPv6 for cooperative ITS communications, relatively little attention has been paid to the security issues related to IPv6 signaling and IPv6 transport communications. In this paper, we present our position on the emerging and urgent IPv6-related security issues that occur in communications between ITS stations complying with the ITS station reference architecture under standardization within ETSI TC ITS and ISO TC204.", "paper_title": "IPv6 Security Issues in Cooperative Intelligent Transportation Systems", "paper_id": "WOS:000325489800005"}