{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "il-humass_survey"}, {"score": 0.004688321299229397, "phrase": "higher_education"}, {"score": 0.003869373085652601, "phrase": "social_sciences"}, {"score": 0.00378767277402891, "phrase": "spanish_and_portuguese_universities"}, {"score": 0.003727527379253624, "phrase": "case-study_method"}, {"score": 0.0034407781868385423, "phrase": "initial_version"}, {"score": 0.003332332086930163, "phrase": "focus_groups"}, {"score": 0.003210110095236981, "phrase": "academics'_reports"}, {"score": 0.003159106878239524, "phrase": "final_version"}, {"score": 0.00260657976055413, "phrase": "self-reporting_nature"}, {"score": 0.0025243592424524764, "phrase": "self-assessment_approach"}, {"score": 0.0023675986784123656, "phrase": "limited_way"}, {"score": 0.0022928991183989115, "phrase": "better_understanding"}, {"score": 0.0022685255265595624, "phrase": "user_groups"}, {"score": 0.0022324489895237504, "phrase": "mixed_analysis"}], "paper_keywords": ["IL-HUMASS", " information literacy"], "paper_abstract": "The IL-HUMASS survey on information literacy has been designed, based on and aimed to be applied to a population of students, teachers and librarians holding various degrees in social sciences and humanities at Spanish and Portuguese universities. The case-study method, experts' opinions, and a literature review were used to prepare an initial version that was refined through student focus groups, interviews with librarians, and academics' reports. A final version contained 26 items grouped into four categories (information search, assessment, processing and communication/dissemination) and three self-reporting dimensions (motivation, self-efficacy and favourite source of learning). The self-reporting nature of the IL-HUMASS survey involves a self-assessment approach that has until now been proposed rarely and only in a limited way. This will enable a better understanding of user groups through a mixed analysis including two quantitative dimensions (motivation and self-efficacy) and one qualitative dimension (the preferred source of learning).", "paper_title": "Design of the IL-HUMASS survey on information literacy in higher education: A self-assessment approach", "paper_id": "WOS:000273874900006"}