{"auto_keywords": [{"score": 0.034224862294360926, "phrase": "sfa_overlay"}, {"score": 0.004814973374495914, "phrase": "sfa"}, {"score": 0.004466519142879166, "phrase": "reputation-based_trust_relationship"}, {"score": 0.0042426974826585695, "phrase": "feedback_aggregating_overlay"}, {"score": 0.0038584250641318057, "phrase": "flooding-based_strategy"}, {"score": 0.0037234376132464463, "phrase": "system_scalability"}, {"score": 0.0035931556794840027, "phrase": "scalable_feedback"}, {"score": 0.0034674164050273568, "phrase": "local_trust_rating_method"}, {"score": 0.0033860360186761533, "phrase": "time_attenuation_function"}, {"score": 0.00316565009987584, "phrase": "scalable_perspective"}, {"score": 0.0030187498405804315, "phrase": "feedback_aggregation_mechanism"}, {"score": 0.002913052619634697, "phrase": "networking_risk"}, {"score": 0.0028786467218197245, "phrase": "system_efficiency"}, {"score": 0.0027559226203857316, "phrase": "adaptive_trustworthiness_computing_method"}, {"score": 0.0026384167183586015, "phrase": "traditional_weighting_methods"}, {"score": 0.0026175952455594277, "phrase": "trust_factors"}, {"score": 0.00246657044320953, "phrase": "key_techniques"}, {"score": 0.002447101794397243, "phrase": "security_mechanism"}, {"score": 0.002370748155770563, "phrase": "easy_incorporation"}, {"score": 0.0022876877275935757, "phrase": "theoretical_and_experimental_analysis"}, {"score": 0.0022606512324475584, "phrase": "sfa-based_trust_model"}, {"score": 0.0021471293746360026, "phrase": "greater_adaptability"}], "paper_keywords": ["Large-scale P2P computing", " trust management", " feedback aggregating overlay", " scalability", " adaptability"], "paper_abstract": "In Peer-to-Peer (P2P) trust management, feedback provides an efficient and effective way to build a reputation-based trust relationship among peers. There is no doubt that the scalability of a feedback aggregating overlay is the most fundamental requirement for large-scale P2P computing. However, most previous works either paid little attention to the scalability of feedback aggregating overlay or relied on the flooding-based strategy to collect feedback, which greatly affects the system scalability. In this paper, we proposed a scalable feedback aggregating (SFA) overlay for large-scale P2P trust evaluation. First, the local trust rating method is defined based on the time attenuation function, which can satisfy the two dynamic properties of trust. The SFA overlay is then proposed from a scalable perspective. Not only can the SFA overlay strengthen the scalability of the feedback aggregation mechanism for large-scale P2P applications, but it can also reduce networking risk and improve system efficiency. More importantly, based on the SFA overlay, an adaptive trustworthiness computing method can be defined. This method surpasses the limitations of traditional weighting methods for trust factors, in which weights are assigned subjectively. Finally, the authors design the key techniques and security mechanism to be simple in implementation for the easy incorporation of the mechanism into the existing P2P overlay network. Through theoretical and experimental analysis, the SFA-based trust model shows remarkable enhancement in scalability for large-scale P2P computing, as well as has greater adaptability and accuracy in handling various dynamic behaviors of peers.", "paper_title": "Scalable Feedback Aggregating (SFA) Overlay for Large-Scale P2P Trust Management", "paper_id": "WOS:000307824600013"}