{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "best_system_configuration"}, {"score": 0.048953123174008836, "phrase": "repeated_queries"}, {"score": 0.0047823219739028325, "phrase": "information_retrieval"}, {"score": 0.004089725258435817, "phrase": "training_process"}, {"score": 0.0038598702839340794, "phrase": "meta-search_system"}, {"score": 0.0036305081978734127, "phrase": "best_configurations"}, {"score": 0.003569241993567677, "phrase": "selective_process"}, {"score": 0.003532977898022071, "phrase": "data_analytics"}, {"score": 0.0034970809586393416, "phrase": "system_parameter_values"}, {"score": 0.0034497831301482144, "phrase": "system_effectiveness"}, {"score": 0.003334309053314909, "phrase": "per-query_basis"}, {"score": 0.0033004240095380623, "phrase": "training_phase"}, {"score": 0.0032668821950788502, "phrase": "limited_amount"}, {"score": 0.0032447099613882313, "phrase": "document_relevance_judgment"}, {"score": 0.0027366287564324966, "phrase": "best_parameters"}, {"score": 0.0025046245057922557, "phrase": "data_analysis"}, {"score": 0.002323708293955822, "phrase": "simulated_data"}, {"score": 0.0023079225317714815, "phrase": "trec_campaigns"}, {"score": 0.00226892463779702, "phrase": "system_performance"}], "paper_keywords": ["Information retrieval", " Meta search", " Evaluation", " Learning in IR", " System combination", " Repeated queries"], "paper_abstract": "This paper presents a method that automatically decides which system configuration should be used to process a query. This method is developed for the case of repeated queries and implements a new kind of meta-system. It is based on a training process: the meta-system learns the best system configuration to use on a per query basis. After training, the meta-search system knows which configuration should treat a given query. The Learning to Choose method we developed selects the best configurations among many. This selective process rests on data analytics applied to system parameter values and their link with system effectiveness. Moreover, we optimize the parameters on a per-query basis. The training phase uses a limited amount of document relevance judgment. When the query is repeated or when an equal-query is submitted to the system, the meta-system automatically knows which parameters it should use to treat the query. This method fits the case of changing collections since what is learned is the relationship between a query and the best parameters to use to process it, rather than the relationship between a query and documents to retrieve. In this paper, we describe how data analysis can help to select among various configurations the ones that will be useful. The \"Learning to choose\" method is presented and evaluated using simulated data from TREC campaigns. We show that system performance highly increases in terms of precision, specifically for the queries that are difficult or medium difficult to answer. The other parameters of the method are also studied.", "paper_title": "Learning to Choose the Best System Configuration in Information Retrieval: the Case of Repeated Queries", "paper_id": "WOS:000376441500003"}