{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "replica_mechanism"}, {"score": 0.04399755003715799, "phrase": "overlay_networks"}, {"score": 0.010886399316838642, "phrase": "ago"}, {"score": 0.010618823249790205, "phrase": "joining_process"}, {"score": 0.004695900553353526, "phrase": "arrangement_graph-based_overlay"}, {"score": 0.004377921202912336, "phrase": "new_age"}, {"score": 0.0033905067962602515, "phrase": "large-scale_environment"}, {"score": 0.0026120705848349055, "phrase": "resource_prefetching"}, {"score": 0.002496722870659199, "phrase": "routing_performance"}, {"score": 0.0024717881264735477, "phrase": "experimental_results"}, {"score": 0.0024348510123716424, "phrase": "eago"}, {"score": 0.00223570488212345, "phrase": "average_number"}, {"score": 0.0022133711375320266, "phrase": "routing_hops"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Overlay network", " Arrangement graph", " Peer-to-peer", " Replica", " AGO"], "paper_abstract": "Peer-to-peer (P2P) overlay networks continue to evolve and grow to meet the challenges of a new age. Because peers can join or depart overlay networks at any time, researchers are particularly interested in how peers should be allowed to join overlay networks as well as how to minimize overhead in overlay networks. An Arrangement Graph-based Overlay (AGO) system can efficiently reduce system overhead by reducing the number of messages in a large-scale environment. However, AGO produces too many polling messages for the joining process. To address this issue, an enhanced joining strategy greatly improves the joining process of AGO to reduce the number of joining messages in this paper which is called the Enhanced Arrangement Graph-based Overlay (EAGO). Besides, for the purpose of the effectiveness of resource prefetching, a replica mechanism is employed to further improve routing performance. Experimental results indicate that EAGO reduces the number of joining messages by at least 20% compared with AGO, and it reduces the average number of routing hops due to the replica mechanism. (C) 2013 Elsevier Ltd. All rights reserved.", "paper_title": "Effectiveness of a replica mechanism to improve availability with Arrangement Graph-Based Overlay", "paper_id": "WOS:000335629300036"}