{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "boolean_functions"}, {"score": 0.004580933283492972, "phrase": "disjunctive_normal_forms"}, {"score": 0.004112020122418323, "phrase": "parity_function"}, {"score": 0.004044251230868813, "phrase": "first_direction"}, {"score": 0.00396110232316167, "phrase": "first_nontrivial_universal_upper_bounds"}, {"score": 0.003231191164622055, "phrase": "strong_universal_upper_bounds"}, {"score": 0.0030357976028714557, "phrase": "low-degree_polynomial_threshold_functions"}, {"score": 0.00284034646798833, "phrase": "information-theoretic_inapproximability"}, {"score": 0.002805121439110729, "phrase": "random_function"}, {"score": 0.0027588314610845705, "phrase": "second_direction"}, {"score": 0.0026796495639791426, "phrase": "explicit_dnf"}, {"score": 0.0023651843133643785, "phrase": "fourier_analytic_tools"}, {"score": 0.0021853532419450887, "phrase": "far_more_expressive_classes"}, {"score": 0.0021049977753042253, "phrase": "unate_functions"}], "paper_keywords": ["Boolean functions", " approximation", " depth-2 circuits"], "paper_abstract": "We study the complexity of approximating Boolean functions with disjunctive normal forms (DNFs) and other depth-2 circuits, exploring two main directions: universal bounds on the approximability of all Boolean functions, and the approximability of the parity function. In the first direction, our main positive results are the first nontrivial universal upper bounds on approximability by DNFs: (a) every Boolean function can be epsilon-approximated by a DNF of size O-epsilon (2(n)/log n), and (b) every Boolean function can be epsilon-approximated by a DNF of width c(epsilon) n, where c(epsilon) < 1. Our techniques extend broadly to give strong universal upper bounds on approximability by various depth-2 circuits that generalize DNFs, including the intersection of halfspaces, low-degree Polynomial threshold functions, and unate functions. We show that the parameters of our constructions almost match the information-theoretic inapproximability of a random function. In the second direction our main positive result is the construction of an explicit DNF that approximates the following parity function: PAR(n) can be epsilon-approximated by a DNF of size 2((1-2 epsilon)n) and width (1-2 epsilon)n. Using Fourier analytic tools we show that our construction is essentially optimal not just within the class of DNFs but also within the far more expressive classes of the intersection of halfspaces and intersection of unate functions.", "paper_title": "APPROXIMATING BOOLEAN FUNCTIONS WITH DEPTH-2 CIRCUITS", "paper_id": "WOS:000367020300001"}