{"auto_keywords": [{"score": 0.046904294781519175, "phrase": "small_molecule"}, {"score": 0.03897200869072899, "phrase": "binding_mode"}, {"score": 0.0046928556063004214, "phrase": "docking_and_molecular_dynamics_simulations"}, {"score": 0.004234532601573088, "phrase": "good_clinical_efficacy"}, {"score": 0.004144810537437608, "phrase": "crystal_structure"}, {"score": 0.003954030683259778, "phrase": "bound_ligand"}, {"score": 0.0038044630943383497, "phrase": "molecular_dynamics_simulation"}, {"score": 0.0034919649825540396, "phrase": "simulated_results"}, {"score": 0.003447349911141396, "phrase": "plausible_binding_mode"}, {"score": 0.003232653376857698, "phrase": "calculated_binding_free_energy"}, {"score": 0.0029925402963843282, "phrase": "free_energy_decomposition"}, {"score": 0.0029416448256236057, "phrase": "mutation_experiments"}, {"score": 0.002746549549029177, "phrase": "acquired_binding_mode"}, {"score": 0.0026425357050743003, "phrase": "hydrophobic_groove"}, {"score": 0.0023942269247089277, "phrase": "theoretical_investigations"}, {"score": 0.0023636038312749245, "phrase": "dynamics_behavior"}, {"score": 0.0021049977753042253, "phrase": "previous_binding_mode"}], "paper_keywords": ["AutoDock", " Binding mode", " BMS-488043", " Free energy decomposition", " gp120", " MM-GBSA"], "paper_abstract": "BMS-488043, like its predecessor BMS-378806, is a small molecule that can block the interactions between gp120 and CD4, and has shown good clinical efficacy. However, the crystal structure of drug-gp120 complexes or the full-length gp120 free of bound ligand is unpublished until now. Docking combined with molecular dynamics simulation is used to investigate the binding mode between BMS-488043 and gp120. On the basis of the analysis of the simulated results, the plausible binding mode is acquired, such as the changes of binding mode in the trajectory and the calculated binding free energy. Subsequently, a number of residues which make contacts with the small molecule are studied by binding free energy decomposition to understand the mutation experiments, such as Trp427, Ser375, and Thr257 residues with the help of the acquired binding mode above. Especially, the importance of the hydrophobic groove formed by residues Ile371 and Gly472 which bind BMS-488043 is elaborated, which has not been explored much. In addition, theoretical investigations on the dynamics behavior of the gp120 associated with BMS-488043 enhanced binding are performed; the results indicate that the BMS-488043 may be more deeply inserted into the Phe43 cavity compared with the previous binding mode acquired by docking.", "paper_title": "The investigations on HIV-1 gp120 bound with BMS-488043 by using docking and molecular dynamics simulations", "paper_id": "WOS:000314051200041"}