{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "metadata_server_cluster"}, {"score": 0.04427043267830492, "phrase": "load_balancing"}, {"score": 0.032321127685275564, "phrase": "adaptive_cache_diffusion"}, {"score": 0.008032513781632765, "phrase": "adaptive_replication_scheme"}, {"score": 0.004780633011300165, "phrase": "cloud-scale_file_systems"}, {"score": 0.004679134285953932, "phrase": "emerging_term"}, {"score": 0.00462919213721188, "phrase": "storage_industry"}, {"score": 0.0045471315699087385, "phrase": "data_analytics"}, {"score": 0.004514714250357749, "phrase": "big_storage"}, {"score": 0.004202931484732134, "phrase": "request_workloads"}, {"score": 0.004084307764140389, "phrase": "performance_bottlenecks"}, {"score": 0.0038846843242954935, "phrase": "distributed_file_systems"}, {"score": 0.003775008774288817, "phrase": "global_namespace_balancing"}, {"score": 0.003734680485633702, "phrase": "metadata_distribution"}, {"score": 0.003708033700676924, "phrase": "metadata_servers"}, {"score": 0.003526735797659508, "phrase": "skew_request_distributions"}, {"score": 0.0032712190037495975, "phrase": "cloud_cache"}, {"score": 0.003100085797251317, "phrase": "eb-scale_file_systems"}, {"score": 0.003034158379493625, "phrase": "replication_scheme"}, {"score": 0.0029802879302375986, "phrase": "request_load_balancing_problem"}, {"score": 0.0021201492891323587, "phrase": "performance_evaluation"}, {"score": 0.0021049977753042253, "phrase": "trace-driven_simulations"}], "paper_keywords": ["metadata management", " load balancing", " adaptive cache diffusion", " adaptive replication", " cloud-scale file systems"], "paper_abstract": "Big data is an emerging term in the storage industry, and it is data analytics on big storage, i.e., Cloud-scale storage. In Cloud-scale (or EB-scale) file systems, load balancing in request workloads across a metadata server cluster is critical for avoiding performance bottlenecks and improving quality of services. Many good approaches have been proposed for load balancing in distributed file systems. Some of them pay attention to global namespace balancing, making metadata distribution across metadata servers as uniform as possible. However, they do not work well in skew request distributions, which impair load balancing but simultaneously increase the effectiveness of caching and replication. In this paper, we propose Cloud Cache (C-2), an adaptive and scalable load balancing scheme for metadata server cluster in EB-scale file systems. It combines adaptive cache diffusion and replication scheme to cope with the request load balancing problem, and it can be integrated into existing distributed metadata management approaches to efficiently improve their load balancing performance. C-2 runs as follows: 1) to run adaptive cache diffusion first, if a node is overloaded, load-shedding will be used; otherwise, load-stealing will be used; and 2) to run adaptive replication scheme second, if there is a very popular metadata item (or at least two items) causing a node be overloaded, adaptive replication scheme will be used, in which the very popular item is not split into several nodes using adaptive cache diffusion because of its knapsack property. By conducting performance evaluation in trace-driven simulations, experimental results demonstrate the efficiency and scalability of C-2.", "paper_title": "Adaptive and scalable load balancing for metadata server cluster in cloud-scale file systems", "paper_id": "WOS:000368588400006"}