{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "risky_knowledge"}, {"score": 0.044931050174649705, "phrase": "statistical_testing"}, {"score": 0.004574709094672837, "phrase": "personal_judgments"}, {"score": 0.004084372444216856, "phrase": "risky_empirical_knowledge"}, {"score": 0.003754731210715724, "phrase": "formal_logical_properties"}, {"score": 0.003291188255149539, "phrase": "tentative_or_corrigible_acceptance"}, {"score": 0.0028014064098604093, "phrase": "fixed_small_parameter"}, {"score": 0.002528300562452668, "phrase": "epsilon-accepted_statements"}, {"score": 0.0024642796422450755, "phrase": "logical_structure"}, {"score": 0.002437339565360659, "phrase": "classical_modal_system"}, {"score": 0.0024284249875593253, "phrase": "emn"}, {"score": 0.0023324855762635616, "phrase": "axiom_schemas_m"}, {"score": 0.0022817585639886883, "phrase": "lambda_psi"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Epistemology", " Probability", " Uncertainty", " Acceptance", " epsilon-Acceptability", " Classical modal logic"], "paper_abstract": "Much of our everyday knowledge is risky. This not only includes personal judgments, but the results of measurement, data obtained from references or by report, the results of statistical testing, etc. There are two (often opposed) views in artificial intelligence on how to handle risky empirical knowledge. One view, characterized often by modal or nonmonotonic logics, is that the structure of such knowledge should be captured by the formal logical properties of a set of sentences, if we can just get the logic right. The other view takes probability to be central to the characterization of risky knowledge, but often does not allow for the tentative or corrigible acceptance of a set of sentences. We examine a view, based on epsilon-acceptability, that combines both probability and modality. A statement is epsilon-accepted if the probability of its denial is at most epsilon, where epsilon is taken to be a fixed small parameter as is customary in the practice of statistical testing. We show that given a body of evidence Gamma(delta) and a threshold epsilon. the set of epsilon-accepted statements Gamma(epsilon) gives rise to the logical structure of the classical modal system EMN, the smallest classical modal system E supplemented by the axiom schemas M: square(epsilon) (phi Lambda psi) -> (square(epsilon) phi Lambda square(epsilon) psi) and N: square(epsilon) T. (C) 2011 Elsevier Inc. All rights reserved.", "paper_title": "The logic of risky knowledge, reprised", "paper_id": "WOS:000302980500002"}