{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "inductive_method"}, {"score": 0.015262923148784984, "phrase": "security_protocols"}, {"score": 0.004219321533320583, "phrase": "theorem_prover"}, {"score": 0.004112812699639956, "phrase": "tutorial_publications"}, {"score": 0.003958049372486465, "phrase": "super-specialised_skills"}, {"score": 0.0035731269727067496, "phrase": "first_tutorial-style_paper"}, {"score": 0.003267054216881229, "phrase": "key_one"}, {"score": 0.0031040383983860836, "phrase": "main_goals"}, {"score": 0.0030127172247606812, "phrase": "threat_model"}, {"score": 0.0027662954811372154, "phrase": "key_aspect"}, {"score": 0.0027311076665349657, "phrase": "protocol_analysis_tools"}, {"score": 0.00268488398249084, "phrase": "paper_motivation"}, {"score": 0.002444254652283002, "phrase": "significant_confidentiality_theorems"}, {"score": 0.0021049977753042253, "phrase": "didactic_purposes"}], "paper_keywords": ["Security protocol", " Inductive Method", " Theorem proving", " Isabelle", " Threat model"], "paper_abstract": "The Inductive Method is among the most established tools to analyse security protocols formally. It has successfully coped with large, deployed protocols, and its findings are widely published. However, perhaps due to its embedding in a theorem prover or to the lack of tutorial publications, it is at times criticised to require super-specialised skills and hence to be rather impractical. This paper aims at showing that criticism to be stereotypical. It pursues its aim by presenting the first tutorial-style paper to using the Inductive Method. This paper cannot cover every aspect of the method. It focuses on a key one, that is how the Inductive Method treats one of the main goals of security protocols: confidentiality against a threat model. The treatment of that goal, which may seem elegant in the Inductive Method, in fact forms a key aspect of all protocol analysis tools, hence the paper motivation rises still. With only standard skills as a requirement, the reader is guided step by step towards design and proof of significant confidentiality theorems. These are developed against two threat models, the standard Dolev-Yao and a more up-to-date one, the General Attacker, the latter turning out particularly useful also for didactic purposes.", "paper_title": "Inductive study of confidentiality: for everyone", "paper_id": "WOS:000329102400002"}