{"auto_keywords": [{"score": 0.04255150516227644, "phrase": "randomly_selected_user"}, {"score": 0.00481495049065317, "phrase": "non-shared_multipath_clusters"}, {"score": 0.004339867166576126, "phrase": "multipath_clusters"}, {"score": 0.0037486121194392564, "phrase": "multipath_cluster"}, {"score": 0.003207180796079775, "phrase": "sdma"}, {"score": 0.0031619994642255846, "phrase": "significant_interference"}, {"score": 0.0029454679553901613, "phrase": "probability_distribution_function"}, {"score": 0.0028630535573013686, "phrase": "non-overlapping_area"}, {"score": 0.0026293540353514075, "phrase": "poisson_distribution"}, {"score": 0.0025678829712650437, "phrase": "proposed_model"}, {"score": 0.00240328454980006, "phrase": "user's_intensity"}, {"score": 0.0023694065215394593, "phrase": "clusters'_intensity"}, {"score": 0.0022706045233150795, "phrase": "outdoor_and_indoor_scenarios"}, {"score": 0.002196609505859369, "phrase": "derived_expression"}, {"score": 0.0021049977753042253, "phrase": "maximum_error"}], "paper_keywords": ["Spatial poisson process", " directional-based multiplexing", " multipath clusters", " visibility region"], "paper_abstract": "In Space Division Multiple Access (SDMA) systems, users are separated based on their positions. The base-station (BS) signals typically reach the users through multipath clusters. The goal of this work is to find the probability that a randomly selected user will receive the signal from the BS via at least one non-shared (by any other user) multipath cluster. This probability, referred to as P-Success, provides (under some conditions) the limit of the probability that the BS is able to communicate successfully with a randomly selected user using SDMA without causing significant interference to other users. To find P-Success, we first derive a model describing the probability distribution function (pdf) of the non-overlapping area of a set of circles, that have the same radius and are spatially distributed according to a Poisson distribution. Then, the proposed model for this pdf is used to express P-Success as a function of the user's intensity and the clusters' intensity. Simulations, using the COST 2100 model, for outdoor and indoor scenarios, are used to validate the derived expression for P-Success with a very good agreement, where the maximum error was 0.04.", "paper_title": "On the Probability of Non-Shared Multipath Clusters in Cellular Networks", "paper_id": "WOS:000373740000013"}