{"auto_keywords": [{"score": 0.046448599314105624, "phrase": "key_phrases"}, {"score": 0.008850952114211812, "phrase": "advertising_cost"}, {"score": 0.007813041206478107, "phrase": "branded_terms"}, {"score": 0.0059568791934045545, "phrase": "key_phrase"}, {"score": 0.004746558955503364, "phrase": "sponsored_search"}, {"score": 0.00449859196755507, "phrase": "brand_terms"}, {"score": 0.004371660146981191, "phrase": "searcher_queries"}, {"score": 0.004202931484732134, "phrase": "key_word_advertising_campaign"}, {"score": 0.0041580507929967645, "phrase": "major_u.s._retailer"}, {"score": 0.0035015674744573377, "phrase": "critical_key_word_advertising_metrics"}, {"score": 0.0029909851863915283, "phrase": "significant_spectrum"}, {"score": 0.002969628818856786, "phrase": "user_actions"}, {"score": 0.0029484244900690485, "phrase": "consumer_behaviors"}, {"score": 0.0029169007179202164, "phrase": "sponsored_search_campaign"}, {"score": 0.002834470668509792, "phrase": "significant_advantage"}, {"score": 0.002455889980202819, "phrase": "key_word"}, {"score": 0.0024122616475793206, "phrase": "search_engine_ads"}, {"score": 0.0023189818169615135, "phrase": "key_word_advertising"}, {"score": 0.0022777800735119405, "phrase": "online_advertising"}, {"score": 0.0022615046141708987, "phrase": "key_word_search"}, {"score": 0.002237308726827077, "phrase": "e-commerce_domain"}, {"score": 0.0022054488653549175, "phrase": "large_retailers"}, {"score": 0.0021049977753042253, "phrase": "higher_conversions"}], "paper_keywords": ["Branding", " brands", " key word advertising", " online advertising", " pay per click", " search engine marketing", " sponsored search"], "paper_abstract": "In this paper, we analyze the relationship between performance and use of brand terms in the key phrases that link advertisements to searcher queries. We use data that consist of more than 2.5 million daily records from a key word advertising campaign of a major U.S. retailer. The campaign spanned nearly four years, involved approximately $8 million in advertising cost, and generated more than $23 million in sales. We categorize key phrases and advertisements as either brand focused or non-brand focused. Using analysis of variance in a 2 x 2 design, we analyze use of branded terms on the critical key word advertising metrics of number of clicks, cost per click, sales revenue generated, number of orders, number of items ordered, and return on advertising cost, as well as number of impressions triggered by these key phrases. Therefore, we investigate a significant spectrum of user actions and consumer behaviors in a sponsored search campaign. Our findings show that there is a significant advantage to matching branding terms in key phrases and advertisements relative to any other combination of key phrase or advertisement for all the metrics examined. A combination of a branded phrase and a branded advertisement generated 15 times more sales revenue than any other combination of phrase and advertisement. Therefore, a focus by key word advertisers on branded terms for search engine ads could be quite beneficial for both the effectiveness and efficiency of key word advertising. The implication for online advertising and key word search in the e-commerce domain, especially for large retailers, is that brand mentions in both key phrase and advertisements correlate with higher conversions.", "paper_title": "The Brand Effect of Key Phrases and Advertisements in Sponsored Search", "paper_id": "WOS:000297239200004"}