{"auto_keywords": [{"score": 0.03849159282580427, "phrase": "medical_treatment"}, {"score": 0.014723829835112235, "phrase": "privacy_concerns"}, {"score": 0.00872396445146581, "phrase": "medical_research"}, {"score": 0.008341946044688697, "phrase": "medical_records"}, {"score": 0.008235877347596307, "phrase": "patient's_name"}, {"score": 0.007692367803880099, "phrase": "health_information"}, {"score": 0.00481495049065317, "phrase": "australian_adults"}, {"score": 0.00473320761888448, "phrase": "statistical_databases"}, {"score": 0.004603311112904207, "phrase": "public's_attitude"}, {"score": 0.004544561688606184, "phrase": "health_care"}, {"score": 0.004467388570912996, "phrase": "larger_project"}, {"score": 0.004326188427877999, "phrase": "technical_measures"}, {"score": 0.004225474050046332, "phrase": "two-stage_process"}, {"score": 0.0041984140090404985, "phrase": "qualitative_and_quantitative_research"}, {"score": 0.004100661989818066, "phrase": "focus_groups"}, {"score": 0.004074397977869244, "phrase": "stage_two"}, {"score": 0.004039639718055365, "phrase": "social_survey"}, {"score": 0.0038868464660354626, "phrase": "one's_health_information"}, {"score": 0.003796321044000575, "phrase": "specific_information"}, {"score": 0.003575258908670573, "phrase": "great_support"}, {"score": 0.0030705342386533083, "phrase": "employment_status"}, {"score": 0.00297335241739509, "phrase": "particularly_sensitive_issues"}, {"score": 0.0027642778632776233, "phrase": "sexually_transmitted_diseases"}, {"score": 0.0026710278770367786, "phrase": "current_medications"}, {"score": 0.0024884913795612707, "phrase": "assuring_individuals"}, {"score": 0.0023942269247089277, "phrase": "research_purposes"}, {"score": 0.0023084728147383885, "phrase": "full_privacy_protection"}, {"score": 0.002274059352027924, "phrase": "extra_security_measures"}, {"score": 0.002221012308998718, "phrase": "\"tailoring_concern"}, {"score": 0.002197310039531521, "phrase": "willison"}, {"score": 0.002164550028538627, "phrase": "privacy_protection"}, {"score": 0.0021552798924809376, "phrase": "personal_information"}, {"score": 0.0021414489155042885, "phrase": "additional_security_measures"}, {"score": 0.0021322775033565805, "phrase": "data_publishing"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ireland_ltd."}], "paper_keywords": ["Privacy", " Personal health information", " Electronic health record", " Medical research", " Consent", " De-identification of medical records", " Statistical databases"], "paper_abstract": "Objectives: The aim of this study was to discover the public's attitude and views towards privacy in health care. This is a part of a larger project which aims to gain an insight into what kind of privacy is needed and develop technical measures to provide such privacy. Methods: The study was a two-stage process which combined qualitative and quantitative research. Stage One of the study comprised arranging and facilitating focus groups while in Stage Two we conducted a social survey. Measurements: We measured attitudes towards privacy, medical research and consent; privacy concern about sharing one's health information for research; privacy concern about the possibility that some specific information from medical records could be linked to the patient's name in a situation that was not related to medical treatment. Results: The results of the study revealed both great support for medical research (98%), and concern about privacy of health information (66%). Participants prefer to be asked for their permission before their health information is used for any purpose other than medical treatment (92%), and they would like to know the organisation and details of the research before allowing the use of their health records (83%). Age, level of education, place of birth and employment status are most strongly associated with privacy concerns. The study showed that there are some particularly sensitive issues and there is a concern (42-60%) about any possibility of linking these kinds of data to the patient's name in a situation that is not related to medical treatment. Such issues include sexually transmitted diseases, abortions and infertility, family medical history/genetic disorders, mental illness, drug/alcohol related incidents, lists of previous operations/procedures/dates and current medications. Conclusions: Participants believe they should be asked for permission before their health information is used for any purpose other than medical treatment. However, consent and privacy concerns are not necessary related. Assuring individuals that their personal health information is de-identified reduces their concern about the necessity of consent for releasing health information for research purposes, but many people are not aware that removing their names and other direct identifiers from medical records does not guarantee full privacy protection for their health information. Privacy concerns decrease as extra security measures are introduced to protect privacy. Therefore, instead of \"tailoring concern\" as proposed by Willison [1] we suggest improving privacy protection of personal information by introducing additional security measures in data publishing. (c) 2012 Elsevier Ireland Ltd. All rights reserved.", "paper_title": "Perspectives of Australian adults about protecting the privacy of their health information in statistical databases", "paper_id": "WOS:000301378400006"}