{"auto_keywords": [{"score": 0.02779170503705429, "phrase": "choquet"}, {"score": 0.004156411748278609, "phrase": "generalized_means"}, {"score": 0.0039024014688338964, "phrase": "linguistic_information"}, {"score": 0.003587616378156851, "phrase": "wide_range"}, {"score": 0.0035376693476114733, "phrase": "linguistic_aggregation_operators"}, {"score": 0.0033213460816510685, "phrase": "different_perspectives"}, {"score": 0.002653606593103781, "phrase": "quasi-arithmetic_means"}, {"score": 0.002242277042923036, "phrase": "new_approach"}, {"score": 0.002195552442011313, "phrase": "multi-person_linguistic_decision-making_problem"}], "paper_keywords": ["2-Tuple linguistic aggregation operator", " OWA operator", " Choquet integral", " Multi-person linguistic decision-making"], "paper_abstract": "The induced 2-tuple linguistic generalized ordered weighted averaging (2-TILGOWA) operator is presented. This new aggregation operator extends previous approaches by using generalized means, order-inducing variables in the reordering of the arguments and linguistic information represented with the 2-tuple linguistic approach. Its main advantage is that it includes a wide range of linguistic aggregation operators. Thus, its analyses can be seen from different perspectives and we obtain a much more complete picture of the situation considered and are able to select the alternative that best fits with our interests or beliefs. We further generalize the 2-TILGOWA by using quasi-arithmetic means and Choquet integrals. The result is the Quasi-2-TILOWA operator and the 2-tuple linguistic induced quasi-arithmetic Choquet integral aggregation. We conclude this paper by analysing the applicability of this new approach in a multi-person linguistic decision-making problem concerning product management. (C) 2013 Elsevier Inc. All rights reserved.", "paper_title": "Induced 2-tuple linguistic generalized aggregation operators and their application in decision-making", "paper_id": "WOS:000318747800001"}