{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "concurrent_self_composition"}, {"score": 0.007900973441540391, "phrase": "impossibility_results"}, {"score": 0.005240553457000345, "phrase": "black-box_simulation"}, {"score": 0.0046597835420572825, "phrase": "single_protocol"}, {"score": 0.004396120480895021, "phrase": "lower_bounds"}, {"score": 0.004332559296185432, "phrase": "secure_protocols"}, {"score": 0.004117215958803593, "phrase": "large_classes"}, {"score": 0.0038279459368975965, "phrase": "communication_complexity"}, {"score": 0.003704467870496114, "phrase": "large_class"}, {"score": 0.0030986183831544487, "phrase": "non-black-box_simulation"}, {"score": 0.0027674397462322435, "phrase": "blind_signature"}, {"score": 0.002747328139245956, "phrase": "oblivious_transfer_functionalities"}, {"score": 0.0025170626402362633, "phrase": "plain_model"}, {"score": 0.002480602069295564, "phrase": "trusted_setup_phase"}, {"score": 0.0022976536579329514, "phrase": "single_secure_protocol"}, {"score": 0.0022072611570187334, "phrase": "seemingly_more_stringent_requirement"}, {"score": 0.0021752783872387173, "phrase": "concurrent_general_composition"}, {"score": 0.0021437580456873584, "phrase": "secure_protocol"}], "paper_keywords": ["secure computation", " protocol composition", " self and general composition", " impossibility results", " lower bounds", " non-black-box and black-box simulation"], "paper_abstract": "In the setting of concurrent self composition, a single protocol is executed many times concurrently in a network. In this paper, we prove lower bounds and impossibility results for secure protocols in this setting. First and foremost, we prove that there exist large classes of functionalities that cannot be securely computed under concurrent self composition, by any protocol. We also prove a communication complexity lower bound on protocols that securely compute a large class of functionalities in this setting. Specifically, we show that any protocol that computes a functionality from this class and remains secure for m concurrent executions, must have bandwidth of at least m bits. The above results are unconditional and hold for any type of simulation (i.e., even for non-black-box simulation). In addition, we prove a severe lower bound on protocols that are proven secure using black-box simulation. Specifically, we show that any protocol that computes the blind signature or oblivious transfer functionalities and remains secure for m concurrent executions, where security is proven via black-box simulation, must have at least m rounds of communication. Our results hold for the plain model, where no trusted setup phase is assumed. While proving our impossibility results, we also show that for many functionalities, security under concurrent self composition (where a single secure protocol is run many times) is actually equivalent to the seemingly more stringent requirement of security under concurrent general composition (where a secure protocol is run concurrently with other arbitrary protocols). This observation has significance beyond the impossibility results that are derived by it for concurrent self composition.", "paper_title": "Lower bounds and impossibility results for concurrent self composition", "paper_id": "WOS:000253481800003"}