{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "networked_decision_making"}, {"score": 0.004772593750252861, "phrase": "team_performance"}, {"score": 0.0047306078475683865, "phrase": "networked_decision"}, {"score": 0.004235793609579307, "phrase": "individual_differences"}, {"score": 0.004198510172614725, "phrase": "team_players"}, {"score": 0.0038093479435377764, "phrase": "agent_framework"}, {"score": 0.003660700128133065, "phrase": "principled_way"}, {"score": 0.0034714553759044664, "phrase": "network_structure"}, {"score": 0.003410565849262162, "phrase": "different_characteristics"}, {"score": 0.003053402354907241, "phrase": "differing_capacity"}, {"score": 0.002999823428906084, "phrase": "agents'_ability"}, {"score": 0.0027700855441353165, "phrase": "network_activity"}, {"score": 0.002721464488351771, "phrase": "dynamic_scenarios"}, {"score": 0.0026267609106294817, "phrase": "open_source_simulation_package"}, {"score": 0.0025018875576502606, "phrase": "information_sharing_scenario"}, {"score": 0.002447101794397243, "phrase": "sensitivity_analysis"}, {"score": 0.0021049977753042253, "phrase": "different_parameters"}], "paper_keywords": ["Agent based modeling", " Networks", " Decision making", " Trust"], "paper_abstract": "Team performance in networked decision making environments has been studied from many different perspectives. However, there are still many unanswered problems when it comes to understanding and quantifying the impact of individual differences of team players, their interpersonal relationships, team connectivity and complex interactions between these factors. In this paper, we present an agent framework that allows the manipulation of all these factors in a principled way. The agents in this framework can be connected through any network structure and can have different characteristics modeled in two dimensions of willingness and competence, which mirror beliefs for each other. Both nodes and links in the network can have differing capacity, modeled by agents' ability to accomplish tasks and their trust for each other. The trust can change as a function of network activity, leading to dynamic scenarios. The framework is implemented as an open source simulation package and is fully extensible. With the help of an information sharing scenario, we conduct a sensitivity analysis and demonstrate the impact of all components of the framework on various network outcomes. In particular, we illustrate that the model provides the ability to study many different trade-offs in team performance and interaction between different parameters.", "paper_title": "TANDEM: a trust-based agent framework for networked decision making", "paper_id": "WOS:000363967000006"}