{"auto_keywords": [{"score": 0.028565995450194916, "phrase": "glue_logic"}, {"score": 0.00481495049065317, "phrase": "component-based_designs"}, {"score": 0.004169394481182493, "phrase": "increasing_complexity"}, {"score": 0.004103212598803194, "phrase": "existing_components"}, {"score": 0.004059673618719782, "phrase": "intellectual_property"}, {"score": 0.0038079353103469865, "phrase": "strict_requirements"}, {"score": 0.0036100762867678415, "phrase": "formal_verification_methodology"}, {"score": 0.0035150223642728437, "phrase": "component-based_system-level_design"}, {"score": 0.002317533977770783, "phrase": "experimental_results"}, {"score": 0.0022324489895237504, "phrase": "proposed_methodology"}, {"score": 0.0021049977753042253, "phrase": "real-life_examples"}], "paper_keywords": ["formal verification", " petri-nets", " components", " iP", " model checking", " embedded systems", " real-time systems"], "paper_abstract": "Embedded systems are becoming increasingly common in our everyday lives. As technology progresses, these systems become more and more complex, and designers handle this increasing complexity by reusing existing components (Intellectual Property blocks). At the same time, the systems must fulfill strict requirements on reliability and correctness. This paper proposes a formal verification methodology which smoothly integrates with component-based system-level design using a divide and conquer approach. The methodology assumes that the system consists of several reusable components, each of them already formally verified by their designers. The components are considered correct given that the environment satisfies certain properties imposed by the component. The methodology verifies the correctness of the glue logic inserted between the components and the interaction of the components through the glue logic. Each such glue logic is verified one at a time using model checking techniques. Experimental results have shown the efficiency of the proposed methodology and demonstrated that it is feasible to apply such a verification methodology on real-life examples.", "paper_title": "Formal verification of component-based designs", "paper_id": "WOS:000244305100003"}