{"auto_keywords": [{"score": 0.026788290939225155, "phrase": "domotical_design"}, {"score": 0.00481495049065317, "phrase": "design_learning"}, {"score": 0.004618166136069052, "phrase": "domosim-tpc_environment"}, {"score": 0.004579780586951551, "phrase": "experimental_learning_environments"}, {"score": 0.0035947360742084253, "phrase": "intermediate_languages"}, {"score": 0.0035204268675160257, "phrase": "design_learning_scenarios"}, {"score": 0.0030541531847589833, "phrase": "new_strategies"}, {"score": 0.0028926147550022607, "phrase": "adaptive_features"}, {"score": 0.0028685304140180137, "phrase": "planedit"}, {"score": 0.0027741761880779535, "phrase": "integral_automation_methods"}, {"score": 0.0026164433143193015, "phrase": "collaborative_environment"}, {"score": 0.0025838249689625775, "phrase": "domosim-tpc"}, {"score": 0.0025409639091476363, "phrase": "distance_learning"}, {"score": 0.00231759652007697, "phrase": "group_learning"}, {"score": 0.0022133711375320244, "phrase": "model_work"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["interactive learning environments", " cooperative/collaborative learning", " intelligent tutoring systems"], "paper_abstract": "Experimental learning environments based on simulation usually require monitoring and adaptation to the actions the users carry out. Some systems provide this functionality, but they do so in a way which is static or cannot be applied to problem solving tasks. In response to this problem, we propose a method based on the use of intermediate languages to provide adaptation in design learning scenarios. Although we use some approaches which are familiar from other domains (e.g., programming tutors) they are novel as regards their application to a very different domain and as a result we have incorporated new strategies. The purpose of our proposal is to provide monitoring, guidance and adaptive features for PlanEdit, a tool for the learning of integral automation methods in buildings and housing by design. This tool is part of a collaborative environment, called DomoSim-TPC, which supports distance learning of domotical design. We have carried out an experiment to obtain some data which confirm that our position can be effective for group learning of domotical design, studying the relationship between the quantity of model work carried out and the errors made. (C) 2005 Elsevier Ltd. All rights reserved.", "paper_title": "Providing adaptation and guidance for design learning by problem solving: The design planning approach in DomoSim-TPC environment", "paper_id": "WOS:000245456400007"}