{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "cultural_heritage"}, {"score": 0.008119457061919676, "phrase": "cultural_heritage_information"}, {"score": 0.004622313841274662, "phrase": "favored_domain"}, {"score": 0.004600161102461882, "phrase": "personalization_research"}, {"score": 0.004490972655413564, "phrase": "cutting_edge_technology"}, {"score": 0.004363347116781479, "phrase": "wireless_technology"}, {"score": 0.00411882905583272, "phrase": "cultural_heritage_material"}, {"score": 0.00402101925240207, "phrase": "different_goals"}, {"score": 0.003934970057482768, "phrase": "cultural_heritage_sites"}, {"score": 0.003906696552076012, "phrase": "huge_amount"}, {"score": 0.003750260412839128, "phrase": "individual_user"}, {"score": 0.003215295260684715, "phrase": "first-time_users"}, {"score": 0.003154012038613403, "phrase": "cultural_heritage_site"}, {"score": 0.003131332224180461, "phrase": "first_time"}, {"score": 0.0029986272043545556, "phrase": "social_activity"}, {"score": 0.0028100102841877835, "phrase": "previous_mutual_experience"}, {"score": 0.0024914105981393127, "phrase": "definite_solution"}, {"score": 0.0024380146670042605, "phrase": "new_technology"}, {"score": 0.0024263048061545726, "phrase": "new_aspects"}, {"score": 0.002312248338073105, "phrase": "earlier_systems"}, {"score": 0.0022409963215568565, "phrase": "personalization_techniques"}, {"score": 0.0022302306304023602, "phrase": "museum_web_sites"}, {"score": 0.002219516542316085, "phrase": "virtual_collections"}, {"score": 0.002208853811052348, "phrase": "mobile_guides"}, {"score": 0.0021929554724010192, "phrase": "recent_extension"}, {"score": 0.002166711569953301, "phrase": "semantic_and_social_web"}, {"score": 0.0021356322417874106, "phrase": "current_challenges"}, {"score": 0.0021049977753042253, "phrase": "future_research"}], "paper_keywords": ["Personalized access to cultural heritage", " Personalization", " Cultural heritage"], "paper_abstract": "Over the last 20 years, cultural heritage has been a favored domain for personalization research. For years, researchers have experimented with the cutting edge technology of the day; now, with the convergence of internet and wireless technology, and the increasing adoption of the Web as a platform for the publication of information, the visitor is able to exploit cultural heritage material before, during and after the visit, having different goals and requirements in each phase. However, cultural heritage sites have a huge amount of information to present, which must be filtered and personalized in order to enable the individual user to easily access it. Personalization of cultural heritage information requires a system that is able to model the user (e. g., interest, knowledge and other personal characteristics), as well as contextual aspects, select the most appropriate content, and deliver it in the most suitable way. It should be noted that achieving this result is extremely challenging in the case of first-time users, such as tourists who visit a cultural heritage site for the first time (and maybe the only time in their life). In addition, as tourism is a social activity, adapting to the individual is not enough because groups and communities have to be modeled and supported as well, taking into account their mutual interests, previous mutual experience, and requirements. How to model and represent the user(s) and the context of the visit and how to reason with regard to the information that is available are the challenges faced by researchers in personalization of cultural heritage. Notwithstanding the effort invested so far, a definite solution is far from being reached, mainly because new technology and new aspects of personalization are constantly being introduced. This article surveys the research in this area. Starting from the earlier systems, which presented cultural heritage information in kiosks, it summarizes the evolution of personalization techniques in museum web sites, virtual collections and mobile guides, until recent extension of cultural heritage toward the semantic and social web. The paper concludes with current challenges and points out areas where future research is needed.", "paper_title": "Personalization in cultural heritage: the road travelled and the one ahead", "paper_id": "WOS:000302477200004"}