{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "program_comprehension"}, {"score": 0.0046073860169839305, "phrase": "program_comprehension_research"}, {"score": 0.004384504920139083, "phrase": "rich_explanations"}, {"score": 0.003970439654470374, "phrase": "comprehension_tasks"}, {"score": 0.00373682045166829, "phrase": "key_cognitive_theories"}, {"score": 0.002883439044844259, "phrase": "research_methods"}, {"score": 0.002669042572650594, "phrase": "reviewed_theories"}, {"score": 0.0025678829712650437, "phrase": "human_characteristics"}, {"score": 0.002539689093411356, "phrase": "program_characteristics"}, {"score": 0.002175913488493802, "phrase": "important_research_directions"}, {"score": 0.0021049977753042253, "phrase": "program_comprehension_tool_development"}], "paper_keywords": ["program comprehension", " cognitive models", " software tools", " research methods", " software navigation", " software visualization", " collaborative software engineering"], "paper_abstract": "Program comprehension research can be characterized by both the theories that provide rich explanations about how programmers understand software, as well as the tools that are used to assist in comprehension tasks. In this paper, I review some of the key cognitive theories of program comprehension that have emerged over the past thirty years. Using these theories as a canvas, I then explore how tools that are commonly used today have evolved to support program comprehension. Specifically, I discuss how the theories and tools are related and reflect on the research methods that were used to construct the theories and evaluate the tools. The reviewed theories and tools are distinguished according to human characteristics, program characteristics, and the context for the various comprehension tasks. Finally, I predict how these characteristics will change in the future and speculate on how a number of important research directions could lead to improvements in program comprehension tool development and research methods.", "paper_title": "Theories, tools and research methods in program comprehension: past, present and future", "paper_id": "WOS:000239300800002"}