{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "ad_hoc_networks"}, {"score": 0.041330961550353526, "phrase": "desired_level"}, {"score": 0.034692465572853035, "phrase": "cloaking_box"}, {"score": 0.004664352260912174, "phrase": "location_information"}, {"score": 0.004634799977448855, "phrase": "participating_nodes"}, {"score": 0.004489810932879285, "phrase": "significant_safety_threats"}, {"score": 0.003991539512905838, "phrase": "location_resolution"}, {"score": 0.003916098498242888, "phrase": "safety_protection"}, {"score": 0.00385431710959668, "phrase": "safety_level"}, {"score": 0.003817715315140651, "phrase": "geographic_region"}, {"score": 0.0036282750398991485, "phrase": "higher_safety_level"}, {"score": 0.0032253056091816465, "phrase": "safety_requirement"}, {"score": 0.0031242709509664837, "phrase": "simple_idea"}, {"score": 0.0029037051302566942, "phrase": "reduced_location_resolution"}, {"score": 0.002857849698346116, "phrase": "network_operating"}, {"score": 0.0024372021710656585, "phrase": "cost-effective_solutions"}, {"score": 0.0023234950796782376, "phrase": "mathematical_analysis"}, {"score": 0.002250646398370793, "phrase": "new_geographic_routing_protocol"}, {"score": 0.002215081186105616, "phrase": "blurred_location_information"}, {"score": 0.0021731423856364003, "phrase": "location_resolution_reduction"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Location safety", " Location cloaking", " Ad hoc networks"], "paper_abstract": "Many routing protocols and applications developed for ad hoc networks rely on location information of participating nodes. The exposure of such information, however, presents significant safety threats to the networks. In this paper, we investigate the problem of preventing an adversary from locating (and thus destroying) nodes based on their location information they disclose in communications. Our idea is to reduce location resolution to achieve a desired level of safety protection. We define the safety level of a geographic region to be the ratio of its area and the number of nodes inside it. The higher safety level a region has, the less attractive for an adversary to search over it for the nodes. When a node has to disclose its location, it can compute a cloaking box that meets a desired level of safety requirement and report that as its current location information. To implement this simple idea, there are several challenges. First, each cloaking box must be as small as possible in order to minimize the impact of reduced location resolution on the efficiency of network operating and applications. Second, nodes must be able to compute their cloaking boxes without having to reveal their accurate position. Finally, given a sequence of cloaking boxes, they must not be correlated to refine an area whose safety level is less than the requirement. Our research addresses these challenges with cost-effective solutions in the context of both stationary and mobile ad hoc networks. We evaluate the performance of our techniques through both mathematical analysis and simulation. in addition, we present a new geographic routing protocol which can work with blurred location information and evaluate the impact of location resolution reduction on the performance of this technique. Published by Elsevier B.V.", "paper_title": "Location safety protection in ad hoc networks", "paper_id": "WOS:000268919600011"}