{"auto_keywords": [{"score": 0.04973325992892519, "phrase": "forest_species"}, {"score": 0.00481495049065317, "phrase": "automatic_classification"}, {"score": 0.00442987501427177, "phrase": "automatic_forest_species_classification_system"}, {"score": 0.0043345662747335065, "phrase": "possible_confusion"}, {"score": 0.004135010810625326, "phrase": "common_problem"}, {"score": 0.00393032656248792, "phrase": "representative_database"}, {"score": 0.003525074461418428, "phrase": "new_database"}, {"score": 0.003161474881435185, "phrase": "better_insight"}, {"score": 0.002855934865505357, "phrase": "hardwoods"}, {"score": 0.0028352726653271187, "phrase": "softwoods"}, {"score": 0.002665555782056494, "phrase": "comprehensive_set"}, {"score": 0.00260810691979637, "phrase": "tuple_support_vector_machine"}, {"score": 0.002487835869510301, "phrase": "best_performance"}, {"score": 0.0024253827365474734, "phrase": "recognition_rate"}, {"score": 0.0023817332409567403, "phrase": "first_and_second_experiments"}, {"score": 0.0022718774783143203, "phrase": "useful_tool"}, {"score": 0.002239103860494545, "phrase": "forest_species_recognition"}, {"score": 0.002190825828942124, "phrase": "future_benchmarking"}, {"score": 0.0021049977753042253, "phrase": "research_purposes"}], "paper_keywords": ["Pattern recognition", " Local binary patterns", " Texture", " Forest species"], "paper_abstract": "Forest species can be taxonomically divided into groups, genera, and families. This is very important for an automatic forest species classification system, in order to avoid possible confusion between species belonging to two different groups, genera, or families. A common problem that researchers in this field very often face is the lack of a representative database to perform their experiments. To the best of our knowledge, the experiments reported in the literature consider only small datasets containing few species. To overcome this difficulty, we introduce a new database of forest species in this work, which is composed of 2,240 microscopic images from 112 different species belonging to 2 groups (Hardwoods and Softwoods), 85 genera, and 30 families. To gain better insight into this dataset, we test three different feature sets, along with three different classifiers. Two experiments were performed. In the first, the classifiers were trained to discriminate between Hardwoods and Softwoods, and in the second, they were trained to discriminate among the 112 species. A comprehensive set of experiments shows that the tuple Support Vector Machine (SVM) and Local Binary Pattern (LBP) achieved the best performance in both cases, with a recognition rate of 98.6 and 86.0% for the first and second experiments, respectively. We believe that researchers will find this database a useful tool in their work on forest species recognition. It will also make future benchmarking and evaluation possible. This database will be available for research purposes upon request to the VRI-UFPR.", "paper_title": "A database for automatic classification of forest species", "paper_id": "WOS:000316361400009"}