{"auto_keywords": [{"score": 0.04397860317645382, "phrase": "credibility_transfer"}, {"score": 0.010612387000973441, "phrase": "web_advertising"}, {"score": 0.009159659527047772, "phrase": "non-web_advertising"}, {"score": 0.007252323664563165, "phrase": "advertising_value"}, {"score": 0.006613030310082385, "phrase": "att"}, {"score": 0.0047559432344272, "phrase": "online_information_acquisition"}, {"score": 0.004697751281484539, "phrase": "china"}, {"score": 0.004471530397729526, "phrase": "online_advertising"}, {"score": 0.004256243266481051, "phrase": "causal_relationship"}, {"score": 0.003976978140059542, "phrase": "web_advertising_usage_behaviour"}, {"score": 0.0036030386046805598, "phrase": "customers'_attitude"}, {"score": 0.0031260524791486347, "phrase": "research_model"}, {"score": 0.0028670988845838296, "phrase": "chinese_online_shopping_customers"}, {"score": 0.0023967582707115354, "phrase": "web_advertising_usage"}], "paper_keywords": ["tie", " advertising value", " credibility transfer", " web advertising usage behaviour", " web advertising"], "paper_abstract": "China is undergoing a transition from offline to online advertising, but little is known about the causal relationship regarding credibility transfer from non-web advertising to web advertising. Meanwhile, web advertising usage behaviour is largely overlooked. The purpose of this study is to explore the formation of customers' attitude towards web advertising (ATT) which further impacts their online information acquisition behaviour, from the perspectives of advertising value and credibility transfer. This paper develops a research model drawing upon advertising value, credibility transfer, ATT and tie. Data collected from Chinese online shopping customers were used to test the model. The results indicate that perceived informativeness, perceived entertainment and credibility contribute to the formation of ATT, which further impacts web advertising usage for getting information. Meanwhile, tie positively moderates the credibility transfer from non-web advertising to web advertising. These findings and their implications for theory and practice are discussed.", "paper_title": "Advertising value and credibility transfer: attitude towards web advertising and online information acquisition", "paper_id": "WOS:000350818600008"}