{"auto_keywords": [{"score": 0.03915697229912192, "phrase": "rf"}, {"score": 0.00481495049065317, "phrase": "random_forests"}, {"score": 0.004451676867747938, "phrase": "random_trees"}, {"score": 0.004359500411441827, "phrase": "significant_improvements"}, {"score": 0.0042692243768616455, "phrase": "classification_accuracy"}, {"score": 0.003946960862020283, "phrase": "optimal_decisions"}, {"score": 0.0037653554368382814, "phrase": "ranking_performance"}, {"score": 0.0033910493564097647, "phrase": "weka"}, {"score": 0.0026649432435828842, "phrase": "improved_random_forests"}, {"score": 0.002542174767860791, "phrase": "information_gain_measure"}, {"score": 0.0025025186963415, "phrase": "maximum-likelihood_estimate"}, {"score": 0.0023133059389875824, "phrase": "irf."}, {"score": 0.002265312266546042, "phrase": "irf"}, {"score": 0.0021049977753042253, "phrase": "high_classification_accuracy"}], "paper_keywords": ["random forests (RF)", " decision tree", " random selection", " class probability estimation", " ranking", " the area under the receiver operating characteristics curve (AUC)"], "paper_abstract": "The random forests (RF) algorithm, which combines the predictions from an ensemble of random trees, has achieved significant improvements in terms of classification accuracy. In many real-world applications, however, ranking is often required in order to make optimal decisions. Thus, we focus our attention on the ranking performance of RF in this paper. Our experimental results based on the entire 36 UC Irvine Machine Learning Repository (UCI) data sets published on the main website of Weka platform show that RF doesn't perform well in ranking, and is even about the same as a single C4.4 tree. This fact raises the question of whether several improvements to RF can scale up its ranking performance. To answer this question, we single out an improved random forests (IRF) algorithm. Instead of the information gain measure and the maximum-likelihood estimate, the average gain measure and the similarity-weighted estimate are used in IRF. Our experiments show that IRF significantly outperforms all the other algorithms used to compare in terms of ranking while maintains the high classification accuracy characterizing RF.", "paper_title": "Learning random forests for ranking", "paper_id": "WOS:000292506200008"}