{"auto_keywords": [{"score": 0.03554356920058212, "phrase": "light-tailed_flow"}, {"score": 0.02278516268892476, "phrase": "heavy-tailed_traffic"}, {"score": 0.010612392224356166, "phrase": "max-weight"}, {"score": 0.009081121028163773, "phrase": "delay_stability"}, {"score": 0.005113357653075571, "phrase": "steady-state_queue_lengths"}, {"score": 0.0047587234712024775, "phrase": "queueing_networks"}, {"score": 0.00454027551702508, "phrase": "single-hop_switched_network"}, {"score": 0.004452228677941085, "phrase": "heavy-tailed_and_light-tailed_traffic"}, {"score": 0.004264463695140275, "phrase": "max-weight_scheduling"}, {"score": 0.0041981583430961734, "phrase": "performance_metric"}, {"score": 0.004021065055449586, "phrase": "traffic_flow"}, {"score": 0.003688892770976908, "phrase": "heavy-tailed_traffic_flow"}, {"score": 0.003589046900483573, "phrase": "scheduling_policy"}, {"score": 0.0033053807885373905, "phrase": "heavy-tailed_flow"}, {"score": 0.00310435218261112, "phrase": "tail_distribution"}, {"score": 0.002501835053002899, "phrase": "max-weight-alpha_scheduling_policies"}, {"score": 0.002206536029072657, "phrase": "latter_quantity"}, {"score": 0.0021049977753042253, "phrase": "traffic_flows"}], "paper_keywords": ["heavy tails", " Max-Weight policy", " scheduling", " switched networks"], "paper_abstract": "We consider the problem of scheduling in a single-hop switched network with a mix of heavy-tailed and light-tailed traffic and analyze the impact of heavy-tailed traffic on the performance of Max-Weight scheduling. As a performance metric, we use the delay stability of traffic flows: A traffic flow is delay-stable if its expected steady-state delay is finite, and delay-unstable otherwise. First, we show that a heavy-tailed traffic flow is delay-unstable under any scheduling policy. Then, we focus on the celebrated Max-Weight scheduling policy and show that a light-tailed flow that conflicts with a heavy-tailed flow is also delay-unstable. This is true irrespective of the rate or the tail distribution of the light-tailed flow or other scheduling constraints in the network. Surprisingly, we show that a light-tailed flow can become delay-unstable, even when it does not conflict with heavy-tailed traffic. Delay stability in this case may depend on the rate of the light-tailed flow. Finally, we turn our attention to the class of Max-Weight-alpha scheduling policies. We show that if the alpha-parameters are chosen suitably, then the sum of the alpha-moments of the steady-state queue lengths is finite. We provide an explicit upper bound for the latter quantity, from which we derive results related to the delay stability of traffic flows, and the scaling of moments of steady-state queue lengths with traffic intensity.", "paper_title": "Max-Weight Scheduling in Queueing Networks With Heavy-Tailed Traffic", "paper_id": "WOS:000331966900020"}