{"auto_keywords": [{"score": 0.043203794668506365, "phrase": "online_debate"}, {"score": 0.00481495049065317, "phrase": "environmental_debate"}, {"score": 0.00466877910546307, "phrase": "growing_emphasis"}, {"score": 0.003952513974962462, "phrase": "critical_issue"}, {"score": 0.0036477941360224435, "phrase": "broad_spectrum"}, {"score": 0.0036030386046805598, "phrase": "potentially_interested_parties"}, {"score": 0.0033664873319204027, "phrase": "ethnographic_study"}, {"score": 0.0033047037762521984, "phrase": "online_event"}, {"score": 0.0031068064097811844, "phrase": "critical_issues"}, {"score": 0.002728847267539957, "phrase": "prior_study"}, {"score": 0.0025972447844047515, "phrase": "multiplayer_pervasive_game"}, {"score": 0.0023967582707115354, "phrase": "serious_implications"}, {"score": 0.0021049977753042253, "phrase": "active_consideration"}], "paper_keywords": ["Ethnographic studies", " e-Democracy", " Online debate", " Web 2.0", " Pervasive games", " Reportability", " Ethnomethodology"], "paper_abstract": "There is a growing emphasis in many countries on matters such as participation in e-government, e-democracy, the provision of forums for online debate, and so on. A critical issue in all of these cases is one of encouraging engagement across a broad spectrum of potentially interested parties and stakeholders. In this paper, we use an ethnographic study of an online event, designed to encourage debate, to explore some critical issues in how the mechanisms productive of debate have shifted in company with the Web 2.0 phenomenon. By contrasting this with a prior study of how players managed their gameplay in a multiplayer pervasive game, we focus upon how different ways of constructing games and events can have serious implications for their ordinary everyday reportability in routine face-to-face interactions. We conclude that designing for reportability should be an active consideration when designing the resources for online debate and consider some ways in which that might be accomplished.", "paper_title": "Designing for reportability: sustainable gamification, public engagement, and promoting environmental debate", "paper_id": "WOS:000342454500016"}