{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "computer-based_medical_history"}, {"score": 0.03879903770337092, "phrase": "test-retest_reliability"}, {"score": 0.0038924989779389424, "phrase": "patient's_responses"}, {"score": 0.0035507457285983268, "phrase": "mutually_exclusive_responses"}, {"score": 0.003056169480391946, "phrase": "randomly_selected_patients"}, {"score": 0.0029830992938695033, "phrase": "beth_israel_deaconess_medical_center"}, {"score": 0.002954374044528189, "phrase": "boston"}, {"score": 0.0026175952455594277, "phrase": "high_levels"}, {"score": 0.0023644936731468252, "phrase": "five_questions"}, {"score": 0.0023079225317714815, "phrase": "structured_medical_history_questions"}, {"score": 0.0021049977753042253, "phrase": "widespread_clinical_practice"}], "paper_keywords": [""], "paper_abstract": "The authors developed a computer-based medical history for patients to take in their homes via the internet. The history consists of 232 'primary' questions asked of all patients, together with more than 6000 questions, explanations, and suggestions that are available for presentation as determined by a patient's responses. The purpose of this research was to measure the test-retest reliability of the 215 primary questions that have preformatted, mutually exclusive responses of 'Yes,' No,'Uncertain (Don't know, Maybe),' Don't understand,' and 'I'd rather not answer.' From randomly selected patients of doctors affiliated with Beth Israel Deaconess Medical Center in Boston, 48 patients took the history twice with intervals between sessions ranging from 1 to 35 days (mean 7 days; median 5 days). High levels of test-retest reliability were found for most of the questions, but as a result of this study the authors revised five questions. They recommend that structured medical history questions that will be asked of many patients be measured for test-retest reliability before they are put into widespread clinical practice.", "paper_title": "Test-retest reliability in a computer-based medical history", "paper_id": "WOS:000289218000013"}