{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "rateless_codes"}, {"score": 0.004240116703465252, "phrase": "query_resolution"}, {"score": 0.00385431710959668, "phrase": "local_view"}, {"score": 0.003823791479971016, "phrase": "global_information"}, {"score": 0.0028715299874549245, "phrase": "novel_approach"}, {"score": 0.002826181226538412, "phrase": "continuous_flow"}, {"score": 0.0028037753646260937, "phrase": "control_packets"}, {"score": 0.002726740692380339, "phrase": "random_walk_principle"}, {"score": 0.002705121052747945, "phrase": "rateless_coding"}, {"score": 0.0026518169452004465, "phrase": "innovative_rateless_decoding_mechanism"}, {"score": 0.002468450551616404, "phrase": "proposed_system"}, {"score": 0.0023626775529531486, "phrase": "analytical_results"}, {"score": 0.0023253461255420436, "phrase": "proposed_strategy_guarantees"}, {"score": 0.0022345720876241044, "phrase": "large_networks"}, {"score": 0.0021049977753042253, "phrase": "information_dynamics"}], "paper_keywords": ["Resource discovery", " peer to peer", " rateless codes", " random walks"], "paper_abstract": "Peer-to-peer (P2P) resource location techniques in grid systems have been recently investigated to obtain scalability, reliability, efficiency, fault-tolerance, security, and robustness. Query resolution for locating resources and update information on their own resource status in these systems can be abstracted as the problem of allowing one peer to obtain a local view of global information defined on all peers of a P2P unstructured network. In this paper, the system is represented as a set of nodes connected to form a P2P network where each node holds a piece of information that is required to be communicated to all the participants. Moreover, we assume that the information can dynamically change and that each peer periodically requires to access the values of the data of all other peers. A novel approach based on a continuous flow of control packets exchanged among the nodes using the random walk principle and rateless coding is proposed. An innovative rateless decoding mechanism that is able to cope with asynchronous information updates is also proposed. The performance of the proposed system is evaluated both analytically and experimentally by simulation. The analytical results show that the proposed strategy guarantees quick diffusion of the information and scales well to large networks. Simulations show that the technique is effective also in presence of network and information dynamics.", "paper_title": "Rateless Codes and Random Walks for P2P Resource Discovery in Grids", "paper_id": "WOS:000334672900018"}