{"auto_keywords": [{"score": 0.04867696472724124, "phrase": "lad"}, {"score": 0.0070890264876782095, "phrase": "original_and_pattern_spaces"}, {"score": 0.006908650118325639, "phrase": "lad_patterns"}, {"score": 0.00481495049065317, "phrase": "classification_methods"}, {"score": 0.004729856080441582, "phrase": "logical_analysis"}, {"score": 0.004622949224512006, "phrase": "input_variables"}, {"score": 0.004287903986946197, "phrase": "boolean_functions"}, {"score": 0.004249825947483216, "phrase": "key_feature"}, {"score": 0.004137600338433322, "phrase": "hidden_patterns"}, {"score": 0.004068150883672098, "phrase": "classification_accuracy"}, {"score": 0.003898665270269876, "phrase": "decision_boundary"}, {"score": 0.0038069853794502353, "phrase": "important_information"}, {"score": 0.0034922880300145283, "phrase": "positive_and_negative_classes"}, {"score": 0.0034407121288076783, "phrase": "measurement_errors"}, {"score": 0.003320006029757563, "phrase": "essential_tool"}, {"score": 0.003251552926963083, "phrase": "desirable_properties"}, {"score": 0.0028865314258560214, "phrase": "decision_tree"}, {"score": 0.0028693932802982417, "phrase": "k-nearest_neighbor_classification_methods"}, {"score": 0.0026954557881801546, "phrase": "classification_results"}, {"score": 0.0026794490636480347, "phrase": "different_classifiers"}, {"score": 0.002600826330254548, "phrase": "experimental_results"}, {"score": 0.0025547615880525745, "phrase": "pattern_space"}, {"score": 0.002472412920623605, "phrase": "original_space"}, {"score": 0.0023224836187453954, "phrase": "good_quality"}, {"score": 0.0022409186856679887, "phrase": "total_number"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Logical analysis of data (LAD)", " Patterns", " Classification", " Pattern-based classification"], "paper_abstract": "The logical analysis of data (LAD) is one of the most promising data mining and machine learning techniques developed to date for extracting knowledge from data. The LAD is based on the concepts of combinatorics, optimization, and Boolean functions. The key feature of the LAD is the capability of detecting hidden patterns in the data. Since patterns are basically combinations of certain attributes, they can be used to build a decision boundary for classification in the LAD by providing important information to distinguish observations in one class from those in the other class. The use of patterns may result in a more stable performance in terms of being able to classify both positive and negative classes due to their robustness to measurement errors. The patterns are also interpretable and can serve as an essential tool for understanding the problem. These desirable properties of the patterns generated from the LAD motivate the use of the LAD patterns as input variables to other classification techniques to achieve a more stable and accurate performance. In this paper, the patterns generated from the LAD are used as the input variables to the decision tree and k-nearest neighbor classification methods. The applicability and usefulness of the LAD patterns for classification are investigated experimentally. The classification accuracy and sensitivity of the classification results for different classifiers in the original and pattern spaces are compared using several public data. The experimental results show that classifications in the pattern space can yield better and stable performance than those in the original space in terms of accuracy when the classification accuracy of the LAD is relatively good (i.e., the LAD patterns are of good quality), the ratio of the number of patterns to the total number of attributes is small, or the data set for classification is balanced between two classes. (C) 2011 Elsevier Ltd. All rights reserved.", "paper_title": "Comparisons of classification methods in the original and pattern spaces", "paper_id": "WOS:000292169500047"}