{"auto_keywords": [{"score": 0.048427710852443524, "phrase": "remotely_sensed_images"}, {"score": 0.008127865505193295, "phrase": "classification_process"}, {"score": 0.00481495049065317, "phrase": "vdm-rs"}, {"score": 0.004619356874848538, "phrase": "remotely_sensed_imagery"}, {"score": 0.0044742996274375404, "phrase": "environmental_monitoring"}, {"score": 0.004403480614319231, "phrase": "fire_risk_mapping"}, {"score": 0.00437546648278148, "phrase": "land_use"}, {"score": 0.003900501415804221, "phrase": "proposed_classifiers"}, {"score": 0.0038633204164544802, "phrase": "black_box"}, {"score": 0.0036243109044803924, "phrase": "misclassified_pixel_samples"}, {"score": 0.0033248546272754936, "phrase": "image_classification_processes"}, {"score": 0.0031895978980118127, "phrase": "visual_components"}, {"score": 0.0030794433253250476, "phrase": "traditional_interfaces"}, {"score": 0.0030306348247409703, "phrase": "map_view"}, {"score": 0.0030017207229983385, "phrase": "error_matrix_view"}, {"score": 0.002954140458190344, "phrase": "decision_tree_classifier_view"}, {"score": 0.0028339216840405873, "phrase": "individual_pixel_samples"}, {"score": 0.002591303221962211, "phrase": "detailed_exploration"}, {"score": 0.0022084431489676993, "phrase": "system's_components"}, {"score": 0.0021526564019119466, "phrase": "hyperspectral_image"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Data mining", " Visualization", " Remote sensing", " Image classification", " Decision tree"], "paper_abstract": "Remotely sensed imagery has become increasingly important in several applications domains, such as environmental monitoring, change detection, fire risk mapping and land use, to name only a few. Several advanced image classification techniques have been developed to analyze such imagery and in particular to improve the accuracy of classifying images in the context of such applications. However, most of the proposed classifiers remain a black box to users, leaving them with little to no means to explore and thus further improve the classification process, in particular for misclassified pixel samples. In this paper, we present the concepts, design and implementation of VDM-RS, a visual data mining system for classifying remotely sensed images and exploring image classification processes. The system provides users with two classes of components. First, visual components are offered that are specific to classifying remotely sensed images and provide traditional interfaces, such as a map view and an error matrix view. Second, the decision tree classifier view provides users with the functionality to trace and explore the classification process of individual pixel samples. This feature allows users to inspect how a sample has been correctly classified using the classifier, but more importantly, it also allows for a detailed exploration of the steps in which a sample has been misclassified. The integration of these features into a coherent, user-friendly system not only helps users in getting more insights into the data, but also to better understand and subsequently improve a classifier for remotely sensed images. We demonstrate the functionality of the system's components and their interaction for classifying imagery using a hyperspectral image dataset. (c) 2009 Elsevier Ltd. All rights reserved.", "paper_title": "VDM-RS: A visual data mining system for exploring and classifying remotely sensed images", "paper_id": "WOS:000270122600008"}