{"auto_keywords": [{"score": 0.04562069191431079, "phrase": "random_graph_model"}, {"score": 0.013516307890921172, "phrase": "observed_graph"}, {"score": 0.010068291887564484, "phrase": "fdsm"}, {"score": 0.00481495049065317, "phrase": "random_graph_models"}, {"score": 0.004774324145784758, "phrase": "fixed_degree_sequences"}, {"score": 0.004694092086199672, "phrase": "structural_characteristic"}, {"score": 0.004537631845923196, "phrase": "observed_value"}, {"score": 0.004294381488413906, "phrase": "statistical_significance"}, {"score": 0.003945266418163835, "phrase": "real-world_network"}, {"score": 0.003670843919846253, "phrase": "expected_value"}, {"score": 0.003097865379563127, "phrase": "typically_the_fixed_degree_sequence_model"}, {"score": 0.0027390682208834013, "phrase": "configuration_model"}, {"score": 0.002570064617803693, "phrase": "simple_independence_model"}, {"score": 0.002526780881314497, "phrase": "latter_models"}, {"score": 0.0021410718792612173, "phrase": "approximating_models"}, {"score": 0.0021049977753042253, "phrase": "computationally_more_involved_fdsm."}], "paper_keywords": ["Complex networks", " Average neighbor degree", " Random graph models", " Co-occurrence"], "paper_abstract": "When a structural characteristic of a network is measured, the observed value needs to be compared to its expected value in a random graph model to assess the statistical significance of its occurrence. The random graph model with which the observed graph is compared is chosen to be structurally similar to the real-world network in some aspects and totally random in all others. To make the analysis of the expected value amenable, the random graph model is also chosen to be as simple as possible. The most common random graph models maintain the degree sequence of the observed graph or at least approximate it. In cases where multi-edges and self-loops are not allowed, typically the fixed degree sequence model (FDSM) is used. Since it is computationally expensive, in this article, we discuss whether one of the following three approximative models can replace it: the configuration model, its simplified version (eCFG), and the mathematical approximation we term simple independence model. While the latter models are more scalable than the FDSM, we show that there are several networks for which they cannot be meaningfully applied. We investigate based on some examples whether, and if so in which cases, these approximating models can replace the computationally more involved FDSM.", "paper_title": "Different flavors of randomness: comparing random graph models with fixed degree sequences", "paper_id": "WOS:000366196300011"}