{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "spatial_reuse"}, {"score": 0.027291756717729005, "phrase": "total_energy_consumption-per-bit"}, {"score": 0.01505781179124599, "phrase": "end-to-end_rate"}, {"score": 0.007110047009355644, "phrase": "bandwidth_efficiency"}, {"score": 0.00680815915507786, "phrase": "minimum_separation"}, {"score": 0.006673153732675866, "phrase": "energy_consumption"}, {"score": 0.005665666339009681, "phrase": "energy-bandwidth_tradeoff"}, {"score": 0.004533585346030341, "phrase": "wireless_multi-hop_network"}, {"score": 0.004311660976562745, "phrase": "information_bits"}, {"score": 0.004169754607580288, "phrase": "channel_use"}, {"score": 0.0038478705530517296, "phrase": "simultaneous_relay_transmissions"}, {"score": 0.003399466007862412, "phrase": "received_signal"}, {"score": 0.0032764888213402737, "phrase": "source-destination_pair"}, {"score": 0.0030847461428168614, "phrase": "convex_optimization_methods"}, {"score": 0.002600105134993952, "phrase": "lower_energy_consumption-per-bit"}, {"score": 0.0023356021521252495, "phrase": "simultaneous_transmitters"}, {"score": 0.0022890828779208016, "phrase": "equi-spaced_relays"}, {"score": 0.0021049977753042253, "phrase": "end-to-end_distance"}], "paper_keywords": ["Cochannel interference", " convex optimization", " minimum energy-per-bit", " relay networks", " spatial reuse"], "paper_abstract": "In this paper, a tradeoff between the total energy consumption-per-bit and the end-to-end rate under spatial reuse in wireless multi-hop network is developed and analyzed. The end-to-end rate of the network is the number of information bits transmitted (end-to-end) per channel use by any node in the network that is forwarding the data. In order to increase the bandwidth efficiency, spatial reuse is considered whereby simultaneous relay transmissions are allowed provided there is a minimum separation between such transmitters. The total energy consumption-per-bit includes the energy transmitted and the energy consumed by the receiver to process (demodulate and decoder) the received signal. The total energy consumption-per-bit is normalized by the distance between a source-destination pair in order to be consistent with a direct (single-hop) communication network. Lower bounds on this energy-bandwidth tradeoff are analyzed using convex optimization methods. For a given location of relays, it is shown that the total energy consumption-per-bit is minimized by optimally selecting the end-to-end rate. It is also demonstrated that spatial reuse can improve the bandwidth efficiency for a given total energy consumption-per-bit. However, at the rate that minimizes the total energy consumption-per-bit, spatial reuse does not provide lower energy consumption-per-bit compared to the case without spatial reuse. This is because spatial reuse requires more receiver energy consumption at a given end-to-end rate. Such degraded energy efficiency can be compensated by varying the minimum separation of hops between simultaneous transmitters. In the case of equi-spaced relays, analytical results for the energy-bandwidth tradeoff are provided and it is shown that the minimum energy consumption-per-hit decreases linearly with the end-to-end distance.", "paper_title": "Minimum Energy-per-Bit Wireless Multi-Hop Networks with Spatial Reuse", "paper_id": "WOS:000277207600002"}