{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "parking_spaces"}, {"score": 0.004775335634705251, "phrase": "vehicular_networks"}, {"score": 0.0046392209103157936, "phrase": "vehicular_ad_hoc_network"}, {"score": 0.004488384083300084, "phrase": "interesting_information"}, {"score": 0.004271234971981848, "phrase": "available_parking_spaces"}, {"score": 0.00418387341007444, "phrase": "suitable_protocol"}, {"score": 0.0033190180867511605, "phrase": "parking_space"}, {"score": 0.0031193028729331667, "phrase": "poor_satisfaction"}, {"score": 0.0029194625087935345, "phrase": "reservation_protocol"}, {"score": 0.002847858807513713, "phrase": "vehicular_ad_hoc_networks"}, {"score": 0.002687523775615916, "phrase": "vespa"}, {"score": 0.0025362096685849346, "phrase": "vanets"}, {"score": 0.002504880563070155, "phrase": "experimental_evaluation"}, {"score": 0.002363806685815014, "phrase": "parking_lots"}, {"score": 0.002344311033783139, "phrase": "urban_scenarios"}, {"score": 0.0022773309395419427, "phrase": "in-depth_study"}], "paper_keywords": ["Vehicular networks", " data sharing", " parking space allocation"], "paper_abstract": "By exchanging events in a vehicular ad hoc network (VANET), drivers can receive interesting information while driving. For example, they can be informed of available parking spaces in their vicinity. A suitable protocol is needed to disseminate the events efficiently within the area where they are relevant. Moreover, in such a competitive context where each vehicle may be interested in a resource, it is crucial not to communicate that resource to each driver in the vicinity. Otherwise, those drivers would waste time trying to reach a parking space and only one of them would be fulfilled, which would lead to a poor satisfaction in the system. To solve this problem, we detail in this paper a reservation protocol that efficiently allocates parking spaces in vehicular ad hoc networks and avoids the competition among the vehicles. We have integrated our protocol within VESPA, a system that we have designed for vehicles to share information in VANETs. An experimental evaluation is provided, which proves the usefulness and benefits of our reservation protocol in both parking lots and urban scenarios. Besides, we present an in-depth study of the state of the art on this topic, that shows the interest and the originality of our approach.", "paper_title": "Sharing with caution: Managing parking spaces in vehicular networks", "paper_id": "WOS:000315831500005"}