{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "populated_virtual_environments"}, {"score": 0.004405596416783185, "phrase": "available_resources"}, {"score": 0.004066898031169742, "phrase": "virtual_characters"}, {"score": 0.0039248128268720645, "phrase": "duplicate_characters"}, {"score": 0.003821503621554738, "phrase": "eye-tracking_device"}, {"score": 0.0037209035703970705, "phrase": "body_parts"}, {"score": 0.003404244237372396, "phrase": "upper_torso"}, {"score": 0.003329368827624161, "phrase": "first_fixations"}, {"score": 0.0027865506182608263, "phrase": "selective_variation_method"}, {"score": 0.002629889135655667, "phrase": "selective_colour_variation"}, {"score": 0.0025042115651986332, "phrase": "full_colour_variation"}, {"score": 0.0023010815714140467, "phrase": "head_accessories"}, {"score": 0.0022806798371116698, "phrase": "top_texture"}, {"score": 0.0022604585778195152, "phrase": "face_texture"}, {"score": 0.002152397315548125, "phrase": "facial_geometry_alterations"}, {"score": 0.0021049977753042253, "phrase": "performance_implications"}], "paper_keywords": ["eye-tracking", " crowd rendering", " virtual humans"], "paper_abstract": "Populated virtual environments need to be simulated with as much variety as possible. By identifying the most salient parts of the scene and characters, available resources can be concentrated where they are needed most. In this paper, we investigate which body parts of virtual characters are most looked at in scenes containing duplicate characters or clones. Using an eye-tracking device, we recorded fixations on body parts while participants were asked to indicate whether clones were present or not. We found that the head and upper torso attract the majority of first fixations in a scene and are attended to most. This is true regardless of the orientation, presence or absence of motion, sex, age, size, and clothing style of the character. We developed a selective variation method to exploit this knowledge and perceptually validated our method. We found that selective colour variation is as effective at generating the illusion of variety as full colour variation. We then evaluated the effectiveness of four variation methods that varied only salient parts of the characters. We found that head accessories, top texture and face texture variation are all equally effective at creating variety, whereas facial geometry alterations are less so. Performance implications and guidelines are presented.", "paper_title": "Eye-catching Crowds: Saliency based Selective Variation", "paper_id": "WOS:000269278000035"}