{"auto_keywords": [{"score": 0.038546368258837456, "phrase": "construction_phase"}, {"score": 0.027959600487435225, "phrase": "lower_penalty"}, {"score": 0.02672049135999611, "phrase": "single_heuristics"}, {"score": 0.00481495049065317, "phrase": "fuzzy_multiple_heuristic_orderings"}, {"score": 0.004745665541429529, "phrase": "university_examination_timetables"}, {"score": 0.004583403452794034, "phrase": "fuzzy_methodologies"}, {"score": 0.004504355451608786, "phrase": "high_quality_feasible_examination_timetabling_solutions"}, {"score": 0.004439519886195092, "phrase": "automated_solutions"}, {"score": 0.004401065382641793, "phrase": "examination_timetabling_problem"}, {"score": 0.00393032656248792, "phrase": "construction_process"}, {"score": 0.0038624981944755813, "phrase": "recent_research"}, {"score": 0.0036979855349860134, "phrase": "'best'_approaches"}, {"score": 0.0035507457285983268, "phrase": "multiple_criteria"}, {"score": 0.0034491650585057754, "phrase": "fuzzy_methods"}, {"score": 0.0031984060035955292, "phrase": "timetable_solution"}, {"score": 0.0030004756968716917, "phrase": "important_criteria"}, {"score": 0.002931569771634119, "phrase": "skipped_exams"}, {"score": 0.0028725726762797374, "phrase": "rescheduling_procedure"}, {"score": 0.0027661298116867013, "phrase": "fuzzy_combination"}, {"score": 0.0027341763737751467, "phrase": "high_quality_solutions"}, {"score": 0.0026100018366802613, "phrase": "previously_published_constructive_method"}, {"score": 0.0024342079318127423, "phrase": "fuzzy_approach"}, {"score": 0.002323624929658748, "phrase": "novel_fuzzy_approach"}, {"score": 0.002303455608777205, "phrase": "highly_effective_method"}, {"score": 0.002230984431056064, "phrase": "particular_relevance"}, {"score": 0.002218054404179068, "phrase": "real-world_situations"}, {"score": 0.0021797112385590913, "phrase": "feasible_solutions"}, {"score": 0.002154517283108316, "phrase": "difficult_task"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Examination timetabling", " Fuzzy methodologies", " Sequential construction"], "paper_abstract": "In this paper, we present an investigation into using fuzzy methodologies to guide the construction of high quality feasible examination timetabling solutions. The provision of automated solutions to the examination timetabling problem is achieved through a combination of construction and improvement. The enhancement of solutions through the use of techniques such as metaheuristics is, in some cases, dependent on the quality of the solution obtained during the construction process. With a few notable exceptions, recent research has concentrated on the improvement of solutions as opposed to focusing on investigating the 'best' approaches to the construction phase. Addressing this issue, our approach is based on combining multiple criteria in deciding on how the construction phase should proceed. Fuzzy methods were used to combine three single construction heuristics into three different pair wise combinations of heuristics in order to guide the order in which exams were selected to be inserted into the timetable solution. In order to investigate the approach, we compared the performance of the various heuristic approaches with respect to a number of important criteria (overall cost penalty, number of skipped exams, number of iterations of a rescheduling procedure required and computational time) on 12 well-known benchmark problems, We demonstrate that the fuzzy combination of heuristics allows high quality solutions to be constructed. On one of the 12 problems, we obtained lower penalty than any previously published constructive method and for all 12 we obtained lower penalty than when any of the single heuristics were used alone. Furthermore, we demonstrate that the fuzzy approach used less backtracking when constructing solutions than any of the single heuristics. We conclude that this novel fuzzy approach is a highly effective method for heuristically constructing solutions and, as such, has particular relevance to real-world situations in which the construction of feasible solutions is often a difficult task in its own right. (C) 2007 Elsevier Ltd. All rights reserved.", "paper_title": "An investigation of fuzzy multiple heuristic orderings in the construction of university examination timetables", "paper_id": "WOS:000262843100001"}