{"auto_keywords": [{"score": 0.049750469707859776, "phrase": "personalized_search"}, {"score": 0.0067952134505740005, "phrase": "preference_degree"}, {"score": 0.00481495049065317, "phrase": "tag-group_based_user_profiling"}, {"score": 0.004749114333679711, "phrase": "folksonomies"}, {"score": 0.0043875257506180865, "phrase": "higher_retrieval_quality"}, {"score": 0.004297795905522757, "phrase": "users'_personalized_profiles"}, {"score": 0.004195418010131832, "phrase": "collaborative_tagging"}, {"score": 0.003889206369317587, "phrase": "powerful_way"}, {"score": 0.0037965243835456214, "phrase": "different_types"}, {"score": 0.0037704502704526996, "phrase": "social_resources"}, {"score": 0.003693293499842943, "phrase": "user_preferences"}, {"score": 0.0033767221949228834, "phrase": "collaborative_tagging_systems"}, {"score": 0.003044912038752554, "phrase": "individual_tag"}, {"score": 0.002670884656785558, "phrase": "user's_two_favorite_tags"}, {"score": 0.0025100713447593773, "phrase": "previous_tag-based_personalized_search"}, {"score": 0.002424942315592064, "phrase": "user_profile"}, {"score": 0.0021416404045850224, "phrase": "real_data_set"}], "paper_keywords": ["personalized search", " user profiling", " folksonomy", " tag-group effect"], "paper_abstract": "With the development of the Internet, there are more and more shared resources on the Web. Personalized search becomes increasingly important as users demand higher retrieval quality. Personalized search needs to take users' personalized profiles and information needs into consideration. Collaborative tagging (also known as folksonomy) systems allow users to annotate resources with their own tags (features) and thus provide a powerful way for organizing, retrieving and sharing different types of social resources. To capture and understand user preferences, a user is typically modeled as a vector of tag: value pairs (i.e., a tag-based user profile) in collaborative tagging systems. In such a tag-based user profile, a user's preference degree on a group of tags (i.e., a combination of several tags) mainly depends on the preference degree on every individual tag in the group. However, the preference degree on a combination of tags (a tag-group) cannot simply be obtained from linearly combining the preference on each tag. The combination of a user's two favorite tags may not be favorite for the user. In this article, we examine the limitations of previous tag-based personalized search. To overcome their problems, we model a user profile based on combinations of tags (tag-groups) and then apply it to the personalized search. By comparing it with the state-of-the-art methods, experimental results on a real data set shows the effectiveness of our proposed user profile method.", "paper_title": "Tag-Group Based User Profiling for Personalized Search in Folksonomies", "paper_id": "WOS:000348141100020"}