{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "social_networks"}, {"score": 0.04970018005584556, "phrase": "newspaper_articles"}, {"score": 0.004412000844879264, "phrase": "large_amount"}, {"score": 0.004173244935967375, "phrase": "new_visual_analytics_system"}, {"score": 0.0041074234667687875, "phrase": "interactive_exploration"}, {"score": 0.003931697356115479, "phrase": "visual_exploration"}, {"score": 0.003823791479971016, "phrase": "\"interesting\"_neighbourhoods"}, {"score": 0.0037336520904376687, "phrase": "new_degree"}, {"score": 0.0034895911869254146, "phrase": "seminal_definition"}, {"score": 0.003461999184976429, "phrase": "doi"}, {"score": 0.0031718628581265266, "phrase": "different_user_queries"}, {"score": 0.0031217859267564344, "phrase": "uniform_search_results"}, {"score": 0.0030602966787192745, "phrase": "user-driven_pattern-based_classifier"}, {"score": 0.002988101395789399, "phrase": "non-taxonomic_semantic_relations"}, {"score": 0.0028944757265206332, "phrase": "a-priori_user_knowledge"}, {"score": 0.0028037753646260937, "phrase": "pattern_creation"}, {"score": 0.0026836723685046407, "phrase": "known_lexico-syntactic_patterns"}, {"score": 0.0025382066972107777, "phrase": "small_amount"}, {"score": 0.0024586427394152196, "phrase": "user_feedback"}, {"score": 0.0024101837218440834, "phrase": "user_study"}, {"score": 0.0022524395393089544, "phrase": "traditional_text-based_interfaces"}, {"score": 0.0021731423856364003, "phrase": "visual_system"}], "paper_keywords": [""], "paper_abstract": "Understanding relationships between people and organizations by reading newspaper articles is difficult to manage for humans due to the large amount of data. To address this problem, we present and evaluate a new visual analytics system, which offers interactive exploration and tagging of social networks extracted from newspapers. For the visual exploration of the network, we extract \"interesting\" neighbourhoods of nodes, using a new degree of interest (DOI) measure based on edges instead of nodes. It improves the seminal definition of DOI, which we find to produce the same \"globally interesting\" neighbourhoods in our use case, regardless of the query. Our approach allows answering different user queries appropriately, avoiding uniform search results. We propose a user-driven pattern-based classifier for discovery and tagging of non-taxonomic semantic relations. Our approach does not require any a-priori user knowledge, such as expertise in syntax or pattern creation. An evaluation shows that our classifier is capable of identifying known lexico-syntactic patterns as well as various domain-specific patters. Our classifier yields good results already with a small amount of training, and continuously improves through user feedback. We conduct a user study to evaluate whether our visual interactive system has an impact on how users tag relationships, as compared to traditional text-based interfaces. Study results suggest that users of the visual system tend to tag more concisely, avoiding too abstract or overly specific relationship labels.", "paper_title": "Networks of Names: Visual Exploration and Semi-Automatic Tagging of Social Networks from Newspaper Articles", "paper_id": "WOS:000340597400022"}