{"auto_keywords": [{"score": 0.037577538970060206, "phrase": "load_cell"}, {"score": 0.012035124484579038, "phrase": "grape_harvester_bin"}, {"score": 0.00481495049065317, "phrase": "load_cell-based_dynamic_weighing_systems"}, {"score": 0.00474493382693875, "phrase": "different_ground_conditions"}, {"score": 0.004648609688625397, "phrase": "load_cells"}, {"score": 0.004567596860086148, "phrase": "crop_yields"}, {"score": 0.004307569753106432, "phrase": "harvesting_machinery"}, {"score": 0.004207734323806386, "phrase": "high_value_crops"}, {"score": 0.004098171194242233, "phrase": "dynamic_weighing_systems"}, {"score": 0.0040267122285238, "phrase": "grape_harvesters"}, {"score": 0.0038309141193444015, "phrase": "changing_topography"}, {"score": 0.003644601816390735, "phrase": "dynamic_weighing_system"}, {"score": 0.0035082436540296406, "phrase": "discrete_element_method"}, {"score": 0.003457204120701294, "phrase": "dem"}, {"score": 0.0034268702387746106, "phrase": "numerical_technique"}, {"score": 0.0033473779327638322, "phrase": "granular_materials"}, {"score": 0.0033277936960179892, "phrase": "dynamic_situations"}, {"score": 0.0032505921489759224, "phrase": "successful_predictions"}, {"score": 0.003175175896313016, "phrase": "different_dem_models"}, {"score": 0.0031106189016953142, "phrase": "different_influencing_factors"}, {"score": 0.002941913249957503, "phrase": "real_bin"}, {"score": 0.0024024377855956136, "phrase": "static_periods"}, {"score": 0.0021613897794439227, "phrase": "crop_load_measurement"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Dynamic weighing", " Harvester", " Load cell", " Discrete element method"], "paper_abstract": "Dynamic weighing systems based on load cells are commonly used to estimate crop yields in the field. There is lack of data, however, regarding the accuracy of such weighing systems mounted on harvesting machinery, especially on that used to collect high value crops such as fruits and vegetables. Certainly, dynamic weighing systems mounted on the bins of grape harvesters are affected by the displacement of the load inside the bin when moving over terrain of changing topography. In this work, the load that would be registered in a grape harvester bin by a dynamic weighing system based on the use of a load cell was inferred by using the discrete element method (DEM). DEM is a numerical technique capable of accurately describing the behaviour of granular materials under dynamic situations and it has been proven to provide successful predictions in many different scenarios. In this work, different DEM models of a grape harvester bin were developed contemplating different influencing factors. Results obtained from these models were used to infer the output given by the load cell of a real bin. The mass detected by the load cell when the bin was inclined depended strongly on the distribution of the load within the bin, but was underestimated in all scenarios. The distribution of the load was found to be dependent on the inclination of the bin caused by the topography of the terrain, but also by the history of inclination (inclination rate, presence of static periods, etc.) since the effect of the inertia of the particles (i.e., representing the grapes) was not negligible. Some recommendations are given to try to improve the accuracy of crop load measurement in the field. (C) 2013 Elsevier B.V. All rights reserved.", "paper_title": "Discrete element analysis for the assessment of the accuracy of load cell-based dynamic weighing systems in grape harvesters under different ground conditions", "paper_id": "WOS:000330144000002"}