{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "netherlands"}, {"score": 0.04103632132993784, "phrase": "first_phase"}, {"score": 0.02867431275157889, "phrase": "second_phase"}, {"score": 0.004505471345843642, "phrase": "cadastral_system_extension"}, {"score": 0.004269064051502084, "phrase": "iso"}, {"score": 0.0042157995925335544, "phrase": "land_administration_domain_model"}, {"score": 0.003737234606207431, "phrase": "legal_and_cadastral_frameworks"}, {"score": 0.003585089792133518, "phrase": "challenging_domain"}, {"score": 0.00352597432462803, "phrase": "technical_and_legal_aspects"}, {"score": 0.0032044314332538154, "phrase": "cadastral_system"}, {"score": 0.0027473784878300133, "phrase": "neighbours_non-overlapping"}, {"score": 0.0026135859312619875, "phrase": "actual_inclusion"}, {"score": 0.002517524071220657, "phrase": "complete_validation"}, {"score": 0.002158233639156015, "phrase": "due_time"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["3D registration", " Land registers", " Multi-level property", " 3D cadastre"], "paper_abstract": "This paper presents the design and implementation of the cadastral system extension for registration of 3D rights and restrictions in the Netherlands fitting within the ISO 19152, Land Administration Domain Model (LADM) final draft international standard. The implementation will be conducted in two phases. The first phase of the solution does not require a change of the legal and cadastral frameworks and will be used to gain experience in the challenging domain of 3D cadastre where technical and legal aspects interact. Typical 3D cadastral objects are analysed including their current registration. A procedure to improve the registration is developed that includes an extension of the cadastral system to accept 3D descriptions in 3D pdf format as part of the deed. One of the drawbacks of this solution is that it is not possible to validate the 3D cadastral representations (Are the volumes closed? Are the neighbours non-overlapping?) The second phase is research in progress and comprises the actual inclusion of the 3D data in the registration, enabling complete validation and even better 3D data management and dissemination. Based on experiences to be collected from the first phase and experiences from other countries, the solution for the second phase will be further refined and subsequently implemented in due time. (C) 2012 Elsevier Ltd. All rights reserved.", "paper_title": "3D cadastre in the Netherlands: Developments and international applicability", "paper_id": "WOS:000321940100007"}