{"auto_keywords": [{"score": 0.048603687852811175, "phrase": "emotion_awareness"}, {"score": 0.008713768692145006, "phrase": "emergency_room"}, {"score": 0.004117329708182806, "phrase": "cscw."}, {"score": 0.004066076430818046, "phrase": "typical_approach"}, {"score": 0.0038431888954930083, "phrase": "mediated_communication"}, {"score": 0.003771631577951067, "phrase": "'poor'_transmitter"}, {"score": 0.0037246656582642272, "phrase": "crucial_emotion_information"}, {"score": 0.003587235362628753, "phrase": "emotion_expressions"}, {"score": 0.00320453237792, "phrase": "strategic_concealment"}, {"score": 0.0028805474861014722, "phrase": "field_study"}, {"score": 0.002756832447586547, "phrase": "healthcare_personnel"}, {"score": 0.0022133711375320244, "phrase": "new_system_design_perspective"}, {"score": 0.0021049977753042253, "phrase": "concealment_behavior"}], "paper_keywords": ["emotion", " awareness", " healthcare", " design", " cooperative work", " suppression", " invisible"], "paper_abstract": "The design of systems and mechanisms for the development of emotion awareness between communicators has been a concern in CSCW. The typical approach in design is tied up in notions of mediated communication being a 'poor' transmitter of crucial emotion information. Thus, by conveying emotion expressions, emotion awareness is consequently supported. In this paper we argue that emotion awareness is also reliant on strategic concealment of emotion expressions through hiding and suppression. To support our argument we present data from a field study of the expression of emotion between healthcare personnel in an emergency room. We provide evidence of the hiding and suppression of emotion expressions by both expressers and observers and how these behaviors support the development of emotion awareness. We then outline a new system design perspective for emotion awareness including both conveyance and concealment behavior and provide examples of systems that have successfully embodied notions of hiding and suppression.", "paper_title": "Concealment of Emotion in an Emergency Room: Expanding Design for Emotion Awareness", "paper_id": "WOS:000313447200002"}