{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "feed-forward_loops"}, {"score": 0.03633768465921191, "phrase": "system_parameters"}, {"score": 0.004531637625717547, "phrase": "typical_network_motifs"}, {"score": 0.004232702713825967, "phrase": "increasing_attention"}, {"score": 0.004059772950454586, "phrase": "global_relative_parameter_sensitivities"}, {"score": 0.00402909874861232, "phrase": "grps"}, {"score": 0.003953409087444568, "phrase": "genetic_networks"}, {"score": 0.003908678575537341, "phrase": "hill_kinetics"}, {"score": 0.0038498211283780484, "phrase": "simple_novel_approach"}, {"score": 0.0036924762294207633, "phrase": "coherent_ffls"}, {"score": 0.003383884759373793, "phrase": "incoherent_fels"}, {"score": 0.003042697264766327, "phrase": "ffl_configuration"}, {"score": 0.0024785689583828796, "phrase": "network_motifs"}, {"score": 0.002368120987066921, "phrase": "proposed_grps_approach"}, {"score": 0.002314752262613559, "phrase": "potential_real_world_applications"}, {"score": 0.0022711961447468114, "phrase": "synthetic_genetic_circuits"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Feed-forward loop", " Global relative parameter sensitivities", " Structure abundance", " Noise characteristics"], "paper_abstract": "It is well known that the feed-forward loops (FFLs) are typical network motifs in many real world biological networks. The structures, functions, as well as noise characteristics of FFLs have received increasing attention over the last decade. This paper aims to further investigate the global relative parameter sensitivities (GRPS) of FFLs in genetic networks modeled by Hill kinetics by introducing a simple novel approach. Our results indicate that: (i) for the coherent FFLs (CFFLs), the most abundant type 1 configuration (C1) is the most globally sensitive to system parameters, while for the incoherent FELs (IFFLs), the most abundant type 1 configuration (I1) is the least globally sensitive to system parameters; (ii) the less noisy of a FFL configuration, the more globally sensitive of this circuit to its parameters; and (iii) the most abundant FFL configurations are often either the least sensitive (robust) to system parameters variation (IFFLs) or the least noisy (CFFLs). Therefore, the above results can well explain the reason why FFLs are network motifs and are selected by nature in evolution. Furthermore, the proposed GRPS approach sheds some light on the potential real world applications, such as the synthetic genetic circuits, predicting the effect of interventions in medicine and biotechnology, and so on. (C) 2011 Elsevier B.V. All rights reserved.", "paper_title": "Global relative parameter sensitivities of the feed-forward loops in genetic networks", "paper_id": "WOS:000298528200019"}