{"auto_keywords": [{"score": 0.03862243927793575, "phrase": "algorithm_feed"}, {"score": 0.013036945027451735, "phrase": "spnsa"}, {"score": 0.005760093033158482, "phrase": "enron"}, {"score": 0.00481495049065317, "phrase": "shortest_path"}, {"score": 0.004761732436126133, "phrase": "criminal_community"}, {"score": 0.004674333455266527, "phrase": "existing_community_detection"}, {"score": 0.004622662375029505, "phrase": "dense_sub-networks"}, {"score": 0.0045953624514036735, "phrase": "resulting_sub-network"}, {"score": 0.004471035765089235, "phrase": "smaller_sample"}, {"score": 0.004276541976450121, "phrase": "important_part"}, {"score": 0.003897989308486044, "phrase": "'algorithm_feed"}, {"score": 0.003840598580753804, "phrase": "small_subset"}, {"score": 0.003784049616066444, "phrase": "particular_interest"}, {"score": 0.0037145284903339327, "phrase": "investigative_sub-network"}, {"score": 0.0036193316508938795, "phrase": "known_criminals"}, {"score": 0.003436169600453596, "phrase": "existing_community_detection_algorithms"}, {"score": 0.0032622464094096463, "phrase": "money_laundering"}, {"score": 0.0027299058905736456, "phrase": "k-neighbourhood_approach"}, {"score": 0.0023270490574896804, "phrase": "convicted_criminals"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Criminal network", " Shortest path", " Leave-one-out", " Trust", " Suspect", " Investigation"], "paper_abstract": "Extracting communities using existing community detection algorithms yields dense sub-networks that are difficult to analyse. Extracting a smaller sample that embodies the relationships of a list of suspects is an important part of the beginning of an investigation. In this paper, we present the efficacy of our shortest paths network search algorithm (SPNSA) that begins with an 'algorithm feed', a small subset of nodes of particular interest, and builds an investigative sub-network. The algorithm feed may consist of known criminals or suspects, or persons of influence. This sets our approach apart from existing community detection algorithms. We apply the SPNSA on the Enron Dataset of e-mail communications starting with those convicted of money laundering in relation to the collapse of Enron as the algorithm feed. The algorithm produces sparse and small sub-networks that could feasibly identify a list of persons and relationships to be further investigated. In contrast, we show that identifying sub-networks of interest using either existing community detection algorithms or a k-Neighbourhood approach produces sub-networks of much larger size and complexity. When the 18 top managers of Enron were used as the algorithm feed, the resulting sub-network identified 4 convicted criminals that were not managers and so not part of the algorithm feed. We directly validate the SPNSA by removing one of the convicted criminals from the algorithm feed and rerunning the algorithm; in 5 out of 9 cases the left out criminal occurred in the resulting sub-network. (C) 2015 Elsevier Ltd. All rights reserved.", "paper_title": "Using shortest path to discover criminal community", "paper_id": "WOS:000366160500001"}