{"auto_keywords": [{"score": 0.046411984812010414, "phrase": "anemia_alerts"}, {"score": 0.04215223424019578, "phrase": "treatment_recommendation"}, {"score": 0.03852424281765506, "phrase": "alert_level"}, {"score": 0.029953933934466086, "phrase": "low-level_alerts"}, {"score": 0.00481495049065317, "phrase": "-aware_alert_systems"}, {"score": 0.004667454318370122, "phrase": "implicit_knowledge_acquisition"}, {"score": 0.0046352930395962685, "phrase": "multiple_experts"}, {"score": 0.004603352344461032, "phrase": "machine_learning"}, {"score": 0.0043706785731816265, "phrase": "five_internal_medicine_residents"}, {"score": 0.004078562617505643, "phrase": "appropriate_alert_level"}, {"score": 0.0035391223341472502, "phrase": "entire_electronic_medical_record"}, {"score": 0.0035025644647418983, "phrase": "training_set"}, {"score": 0.0033834012029672423, "phrase": "test_set"}, {"score": 0.0033138516659108387, "phrase": "ridor"}, {"score": 0.0031461489526079236, "phrase": "anemia_cases"}, {"score": 0.002875261849352716, "phrase": "high-precision_classifiers"}, {"score": 0.002739165532192527, "phrase": "iron_deficiency"}, {"score": 0.0026367554281038572, "phrase": "kidney_disease"}, {"score": 0.002460240519198386, "phrase": "chronic_anemia"}, {"score": 0.0023847032316716503, "phrase": "clinically_unimportant_alerts"}, {"score": 0.0022560827223539934, "phrase": "study_hypotheses"}, {"score": 0.0021049977753042253, "phrase": "clinically_meaningful_and_precise_decision_rules"}], "paper_keywords": [""], "paper_abstract": "Objective To present a framework for combining implicit knowledge acquisition from multiple experts with machine learning and to evaluate this framework in the context of anemia alerts. Materials and Methods Five internal medicine residents reviewed 18 anemia alerts, while 'talking aloud'. They identified features that were reviewed by two or more physicians to determine appropriate alert level, etiology and treatment recommendation. Based on these features, data were extracted from 100 randomly-selected anemia cases for a training set and an additional 82 cases for a test set. Two staff internists assigned an alert level, etiology and treatment recommendation before and after reviewing the entire electronic medical record. The training set of 118 cases (100 plus 18) and the test set of 82 cases were explored using RIDOR and JRip algorithms. Results The feature set was sufficient to assess 93% of anemia cases (intraclass correlation for alert level before and after review of the records by internists 1 and 2 were 0.92 and 0.95, respectively). High-precision classifiers were constructed to identify low-level alerts (precision p=0.87, recall R=0.4), iron deficiency (p=1.0, R=0.73), and anemia associated with kidney disease (p=0.87, R=0.77). Discussion It was possible to identify low-level alerts and several conditions commonly associated with chronic anemia. This approach may reduce the number of clinically unimportant alerts. The study was limited to anemia alerts. Furthermore, clinicians were aware of the study hypotheses potentially biasing their evaluation. Conclusion Implicit knowledge acquisition, collaborative filtering and machine learning were combined automatically to induce clinically meaningful and precise decision rules.", "paper_title": "Collaborative knowledge acquisition for the design of context-aware alert systems", "paper_id": "WOS:000310408500011"}