{"auto_keywords": [{"score": 0.03843856552198327, "phrase": "proposed_method"}, {"score": 0.015719716506582538, "phrase": "stiff_chemistry"}, {"score": 0.014746368040717998, "phrase": "turbulent_flames"}, {"score": 0.004766090327062509, "phrase": "semi-implicit_preconditioned_iterative_method"}, {"score": 0.00457553517865013, "phrase": "unsteady_reacting_flows"}, {"score": 0.004467900288375827, "phrase": "detailed_chemical_kinetic_mechanisms"}, {"score": 0.004362786303912385, "phrase": "simultaneous_treatment"}, {"score": 0.0042025601346464365, "phrase": "operator_splitting_techniques"}, {"score": 0.003743439610143464, "phrase": "crank-nicolson_formulation"}, {"score": 0.003391556348707911, "phrase": "critical_small_chemical_timescales"}, {"score": 0.003334309053314909, "phrase": "largest_stable_time_step_size"}, {"score": 0.0032668821950788502, "phrase": "turbulent_flame"}, {"score": 0.0031790892089501345, "phrase": "convective_cfl"}, {"score": 0.003104201872147936, "phrase": "theoretical_and_numerical_stability_limits"}, {"score": 0.0029096837584084182, "phrase": "overall_procedure"}, {"score": 0.0028026735035370206, "phrase": "lagging_errors"}, {"score": 0.002681255756642227, "phrase": "explicit_time_integration"}, {"score": 0.002653989719462843, "phrase": "theoretical_analysis"}, {"score": 0.0026091594819333654, "phrase": "wide_range"}, {"score": 0.0023000698178350415, "phrase": "good_convergence_rate"}, {"score": 0.002245842206945282, "phrase": "time_step_size"}, {"score": 0.002185428109917791, "phrase": "proposed_method_ideal"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Numerical integration", " Stiff chemistry", " Semi-implicit preconditioning", " Iterative method"], "paper_abstract": "A semi-implicit preconditioned iterative method is proposed for the time-integration of the stiff chemistry in simulations of unsteady reacting flows, such as turbulent flames, using detailed chemical kinetic mechanisms. Emphasis is placed on the simultaneous treatment of convection, diffusion, and chemistry, without using operator splitting techniques. The preconditioner corresponds to an approximation of the diagonal of the chemical Jacobian. Upon convergence of the sub-iterations, the fully-implicit, second-order time-accurate, Crank-Nicolson formulation is recovered. Performance of the proposed method is tested theoretically and numerically on one-dimensional laminar and three-dimensional high Karlovitz turbulent premixed n-heptane/air flames. The species lifetimes contained in the diagonal preconditioner are found to capture all critical small chemical timescales, such that the largest stable time step size for the simulation of the turbulent flame with the proposed method is limited by the convective CFL, rather than chemistry. The theoretical and numerical stability limits are in good agreement and are independent of the number of sub-iterations. The results indicate that the overall procedure is second-order accurate in time, free of lagging errors, and the cost per iteration is similar to that of an explicit time integration. The theoretical analysis is extended to a wide range of flames (premixed and non-premixed), unburnt conditions, fuels, and chemical mechanisms. In all cases, the proposed method is found (theoretically) to be stable and to provide good convergence rate for the sub-iterations up to a time step size larger than 1 mu s. This makes the proposed method ideal for the simulation of turbulent flames. (C) 2015 Elsevier Inc. All rights reserved.", "paper_title": "A computationally-efficient, semi-implicit, iterative method for the time-integration of reacting flows with stiff chemistry", "paper_id": "WOS:000354399700034"}