{"auto_keywords": [{"score": 0.027740271023772693, "phrase": "dna_codes"}, {"score": 0.015586480634730926, "phrase": "dna_sequences"}, {"score": 0.008643225994415518, "phrase": "maximum_cardinality"}, {"score": 0.00481495049065317, "phrase": "dna_codes_for_nonadditive_stem_similarity"}, {"score": 0.004632039024076267, "phrase": "quaternary_dna_alphabet"}, {"score": 0.004159446063902181, "phrase": "hybridization_process"}, {"score": 0.003967021436047945, "phrase": "biological_experiments"}, {"score": 0.0035620354052144656, "phrase": "watson-crick_duplexes"}, {"score": 0.003426556090707852, "phrase": "dna_code"}, {"score": 0.0033391018638565715, "phrase": "watson-crick_duplex"}, {"score": 0.0028715299874549245, "phrase": "coding_theory"}, {"score": 0.0027741761880779535, "phrase": "nonadditive_similarity_function"}, {"score": 0.002512266505492273, "phrase": "singleton"}, {"score": 0.002416589459425828, "phrase": "optimal_construction"}, {"score": 0.0023447155524245655, "phrase": "special_constraints"}, {"score": 0.0021049977753042253, "phrase": "similarity_function"}], "paper_keywords": [""], "paper_abstract": "DNA sequences are sequences with elements from the quaternary DNA alphabet {A, C, G, T}. An important property of them is their directedness and ability to form duplexes as a result of hybridization process, i.e., coalescing two oppositely directed sequences. In biological experiments exploiting this property it is necessary to generate an ensemble of such sequences (DNA codes) consisting of pairs of DNA sequences referred to as Watson-Crick duplexes. Furthermore, for any two words of the DNA code that do not form a Watson-Crick duplex, hybridization energy-stability measure of a potential DNA duplex-is upper bounded by a constant specified by conditions of an experiment. This problem can naturally be interpreted in terms of coding theory. Continuing our previous works, we consider a nonadditive similarity function for two DNA sequences, which most adequately models their hybridization energy. For the maximum cardinality of DNA codes based on this similarity, we establish a Singleton upper bound and present an example of an optimal construction. Using ensembles of DNA codes with special constraints on codewords, which we call Fibonacci ensembles, we obtain a random-coding lower bound on the maximum cardinality of DNA codes under this similarity function.", "paper_title": "DNA Codes for Nonadditive Stem Similarity", "paper_id": "WOS:000343931900004"}