{"auto_keywords": [{"score": 0.04946824888397643, "phrase": "time"}, {"score": 0.00481495049065317, "phrase": "minimal_paths"}, {"score": 0.004632968695963776, "phrase": "quickest_path"}, {"score": 0.004162602203448056, "phrase": "transmission_time"}, {"score": 0.0035523480068927614, "phrase": "telecommunication_systems"}, {"score": 0.0030837288356760973, "phrase": "minimum_transmission_time"}, {"score": 0.003031287195944274, "phrase": "fixed_number"}, {"score": 0.00296698375549856, "phrase": "qp_problem"}, {"score": 0.002929056388593134, "phrase": "stochastic_case"}, {"score": 0.0028916124463906983, "phrase": "new_problem"}, {"score": 0.0023434058350520763, "phrase": "simple_algorithm"}, {"score": 0.0022067604433257814, "phrase": "system_reliability"}, {"score": 0.0021414489155042885, "phrase": "optimal_pair"}, {"score": 0.0021049977753042253, "phrase": "highest_system_reliability"}], "paper_keywords": ["Budget", " network reliability", " optimal pair", " quickest path (QP)", " time constraint", " two minimal paths (MPs)"], "paper_abstract": "The quickest path (QP) problem is to find a path which sends a given amount of data from the source to the sink such that the transmission time is minimized. Two attributes are involved, namely, the capacity and the lead time. The capacity of each arc is assumed to be deterministic. However, in many real-life flow networks such as computer systems, telecommunication systems, etc., the capacity of each arc should be stochastic due to failure, maintenance, etc. Such a network is named a stochastic-flow network. Hence, the minimum transmission time is not a fixed number. We modify the QP problem to a stochastic case. The new problem is to evaluate the probability that d units of data can be sent from the source to the sink under both time T and budget B constraints. Such a probability is named the system reliability. In particular, the data can be transmitted through two disjoint minimal paths (MPs) simultaneously. A simple algorithm is proposed to generate all (d, T, B)-QPs, and the system reliability can subsequently be computed. The optimal pair of MPs with highest system reliability could further be obtained.", "paper_title": "Optimal Pair of Minimal Paths Under Both Time and Budget Constraints", "paper_id": "WOS:000265438200011"}