{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "switching_networks"}, {"score": 0.009146509989361446, "phrase": "boolean_algebra"}, {"score": 0.0045877173513910055, "phrase": "fundamental_building_element"}, {"score": 0.004547564208690591, "phrase": "digital_systems"}, {"score": 0.00439041997682389, "phrase": "simply_circuits"}, {"score": 0.004294962474996283, "phrase": "shannon's_thesis"}, {"score": 0.0037973594873521596, "phrase": "classic_approach"}, {"score": 0.0035082436540296406, "phrase": "specified_functionality"}, {"score": 0.003342471131048328, "phrase": "'language_barrier"}, {"score": 0.0032697235411641695, "phrase": "circuit_description"}, {"score": 0.0029161225023394363, "phrase": "unified_algebra"}, {"score": 0.002670296619878048, "phrase": "graph_theory"}, {"score": 0.002434396049547248, "phrase": "new_methods"}, {"score": 0.0024130437638400404, "phrase": "circuit_composition"}, {"score": 0.0023918783117166326, "phrase": "greater_reuse"}], "paper_keywords": [""], "paper_abstract": "A switch, mechanical or electrical, is a fundamental building element of digital systems. The theory of switching networks, or simply circuits, dates back to Shannon's thesis (1937), where he employed Boolean algebra for reasoning about the functionality of switching networks, and graph theory for describing and manipulating their structure. Following this classic approach, one can deduce functionality from a given structure via analysis, and create a structure implementing a specified functionality via synthesis. The use of two mathematical languages leads to a 'language barrier' - whenever a circuit description is changed in one language, it is necessary to translate the change into the other one to keep both descriptions synchronised. This work presents a unified algebra of switching networks. Its elements are circuits rather than just Boolean functions (as in Boolean algebra) or vertices/edges (as in graph theory). This approach allows one to express both the functionality and structure of switching networks in the same mathematical language and brings new methods of circuit composition for greater reuse of components and interfaces. In this paper we demonstrate how to use the algebra to formally transform circuits, reason about their properties, and even solve equations whose 'unknowns' are circuits.", "paper_title": "Algebra of switching networks", "paper_id": "WOS:000356419900005"}