{"auto_keywords": [{"score": 0.04117348093712635, "phrase": "former_systematic_mapping_study"}, {"score": 0.00481495049065317, "phrase": "technical_software_documentation"}, {"score": 0.004648925234889467, "phrase": "integral_part"}, {"score": 0.0046046429665581555, "phrase": "software_development_process"}, {"score": 0.004546252387071551, "phrase": "software_practitioners"}, {"score": 0.004170940184489072, "phrase": "novatel_inc."}, {"score": 0.004091820963641547, "phrase": "world-leading_company_developing_software_systems"}, {"score": 0.004039906986937495, "phrase": "global_navigation_satellite_systems"}, {"score": 0.0038633204164544802, "phrase": "better_understanding"}, {"score": 0.0037419150096899127, "phrase": "software_development"}, {"score": 0.0035555237584957455, "phrase": "industrial_case_study"}, {"score": 0.003532885029484907, "phrase": "novatel"}, {"score": 0.0034880375790382586, "phrase": "joint_definition"}, {"score": 0.0034547746986065345, "phrase": "analysis_goals"}, {"score": 0.0034218279328844746, "phrase": "research_method"}, {"score": 0.0034000375671935953, "phrase": "qualitative_and_quantitative_analysis"}, {"score": 0.003011328068286321, "phrase": "industrial_partner"}, {"score": 0.0029447150254434842, "phrase": "high_level"}, {"score": 0.002797922160172791, "phrase": "case_study"}, {"score": 0.0026414854705971553, "phrase": "maintenance_purpose"}, {"score": 0.002591303221962211, "phrase": "information_source"}, {"score": 0.002501759237420687, "phrase": "preferred_information_source"}, {"score": 0.002485813299166851, "phrase": "software_maintenance"}, {"score": 0.0024230370118191267, "phrase": "significant_difference"}, {"score": 0.0023021895404322767, "phrase": "initial_hypotheses"}, {"score": 0.0022802093550930245, "phrase": "up-to-date_information"}, {"score": 0.0022297330866277738, "phrase": "highest_impact"}, {"score": 0.0022013916728990564, "phrase": "technical_documentation"}], "paper_keywords": ["Technical software documentation", " Usage", " Usefulness", " Industrial context", " Case study"], "paper_abstract": "Context: Software documentation is an integral part of any software development process. However, software practitioners are often concerned about the value, degree of usage and usefulness of documentation during development and maintenance. Objective: Motivated by the needs of NovAtel Inc. (NovAtel), a world-leading company developing software systems in support of global navigation satellite systems, and based on the results of a former systematic mapping study, we aimed at better understanding of the usage and the usefulness of various technical documents during software development and maintenance. Method: We utilized the results of a former systematic mapping study and performed an industrial case study at NovAtel. From the joint definition of the analysis goals, the research method incorporates qualitative and quantitative analysis of 55 documents (design, test and process related) and 1630 of their revisions. In addition, we conducted a survey on the usage and usefulness of documents. A total of 25 staff members from the industrial partner, all having a medium to high level of experience, participated in the survey. Results: In the context of the case study, a number of findings were derived. They include that (1) technical documentation was consulted least frequently for maintenance purpose and most frequently as an information source for development, (2) source code was considered most frequently as the preferred information source during software maintenance, (3) there is no significant difference between the usage of various documentation types during both development and maintenance, and (4) initial hypotheses stating that up-to-date information, accuracy and preciseness have the highest impact on usefulness of technical documentation. Conclusions: It is concluded that the usage of documentation differs for various purposes and it depends on the type of the information needs as well as the tasks to be completed (e.g., development and maintenance). The results have been confirmed to be helpful for the company under study, and the firm is currently implementing some of the recommendations given. (C) 2014 Elsevier B.V. All rights reserved.", "paper_title": "Usage and usefulness of technical software documentation: An industrial case study", "paper_id": "WOS:000345947500037"}