{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "product_specificity"}, {"score": 0.006470676343082672, "phrase": "catalytic_efficiency"}, {"score": 0.0047804843375940835, "phrase": "protein_lysine_methyltransferases"}, {"score": 0.00471228691115201, "phrase": "free_energy_simulations"}, {"score": 0.004322967486451877, "phrase": "methyl-transfer_processes"}, {"score": 0.0038950367927745267, "phrase": "key_questions"}, {"score": 0.0038167013601050513, "phrase": "reactant_complexes"}, {"score": 0.0031390053628808706, "phrase": "target_lysine"}, {"score": 0.002995554770117301, "phrase": "first_methyl-transfer_process"}, {"score": 0.002797572252783356, "phrase": "experimental_observations"}, {"score": 0.0026410082462069596, "phrase": "previous_suggestion"}, {"score": 0.002584576723303367, "phrase": "methyl-transfer_reactions"}, {"score": 0.0024399036842105205, "phrase": "present_work"}, {"score": 0.002396371892825691, "phrase": "dynamic_information"}, {"score": 0.002245975340642921, "phrase": "reactive_transition-state-like_configurations"}, {"score": 0.0021979660485319523, "phrase": "important_indicator"}, {"score": 0.0021049977753042253, "phrase": "previous_computational_studies"}], "paper_keywords": [""], "paper_abstract": "The results of hybrid quantum mechanical/molecular mechanical (QM/MM) free energy (potential of mean force) simulations for methyl-transfer processes in SET7/9 and its Y245A mutant are compared to address the question concerning the change of the product specificity as well as catalytic efficiency due to the mutation. One of the key questions is whether or not the free energy profiles of methyl transfers may be used to predict the change of the product specificity as a result of the mutations for the residues that are not located at the Tyr/Phe switch position. The simulations show that while the wild-type SET7/9 is a monomethylase, the Y245 -> A mutation increases the ability of the enzyme to add more methyl groups on the target lysine (i.e., acting as a trimethylase). However; the first methyl-transfer process seems to become less efficient in the mutant compared to that in wildtype. All these results are consistent with experimental observations concerning the effects of the mutation on the product specificity and catalytic efficiency. Thus, the previous suggestion that the energetics of the methyl-transfer reactions may determine the product specificity, at least in some cases, is confirmed by the present work. Moreover, the dynamic information of the reactant complexes obtained from the QM/MM molecular dynamics simulations shows that the ability of the reactant complexes to form the reactive transition-state-like configurations may be used as an important indicator for the prediction of the product specificity of PKMTs, consistent with previous computational studies.", "paper_title": "Understanding Product Specificity of Protein Lysine Methyltransferases from QM/MM Molecular Dynamics and Free Energy Simulations: The Effects of Mutation on SET7/9 beyond the Tyr/Phe Switch", "paper_id": "WOS:000300650400019"}