{"auto_keywords": [{"score": 0.037067940292278834, "phrase": "drive_beam"}, {"score": 0.00481495049065317, "phrase": "wakefield_acceleration"}, {"score": 0.004195418010131832, "phrase": "quasi-static_or_frozen_field_approximation"}, {"score": 0.004066076430818046, "phrase": "fully_three-dimensional_electromagnetic_field"}, {"score": 0.00389164348807591, "phrase": "two-dimensional_field_solve"}, {"score": 0.0031845067058084583, "phrase": "plasma_particle"}, {"score": 0.003125175084962886, "phrase": "complete_electromagnetic_fields"}, {"score": 0.002671722386856879, "phrase": "computational_time"}, {"score": 0.002525074485615743, "phrase": "new_algorithm"}, {"score": 0.002493592357827492, "phrase": "conventional_fully_explicit_models"}, {"score": 0.0022273034991008326, "phrase": "future_work"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["plasma accelerator", " quasi-static", " PIC", " beam plasma interaction", " laser plasma interaction"], "paper_abstract": "A highly efficient, fully parallelized, fully relativistic, three-dimensional particle-in-cell model for simulating plasma and laser wakefield acceleration is described. The model is based on the quasi-static or frozen field approximation, which reduces a fully three-dimensional electromagnetic field solve and particle push to a two-dimensional field solve and particle push. This is done by calculating the plasma wake assuming that the drive beam and/or laser does not evolve during the time it takes for it to pass a plasma particle. The complete electromagnetic fields of the plasma wake and its associated index of refraction are then used to evolve the drive beam and/or laser using very large time steps. This algorithm reduces the computational time by 2-3 orders of magnitude. Comparison between the new algorithm and conventional fully explicit models (OSIRIS) is presented. The agreement is excellent for problems of interest. Direction for future work is also presented. (c) 2006 Elsevier Inc. All rights reserved.", "paper_title": "QUICKPIC: A highly efficient particle-in-cell code for modeling wakefield acceleration in plasmas", "paper_id": "WOS:000241415800019"}