{"auto_keywords": [{"score": 0.0474894292969371, "phrase": "pht"}, {"score": 0.046551648304902826, "phrase": "electronic_health_record"}, {"score": 0.015558622921950848, "phrase": "patient_handoffs"}, {"score": 0.00481495049065317, "phrase": "physician_informatics_tool"}, {"score": 0.004586531354697466, "phrase": "computerized_patient_handoff_tool"}, {"score": 0.004278807087784626, "phrase": "cross-cover_physician"}, {"score": 0.0040757181942937875, "phrase": "data_elements"}, {"score": 0.003609024170287396, "phrase": "physician's_perceptions"}, {"score": 0.0033549790559972053, "phrase": "multi-method_study"}, {"score": 0.0032971676471625646, "phrase": "pht_forms"}, {"score": 0.0032516342542969387, "phrase": "shift_surveys"}, {"score": 0.003229103141223776, "phrase": "cross-cover_resident_physicians"}, {"score": 0.0031955979242589494, "phrase": "semi-structured_interviews"}, {"score": 0.0026949162013161078, "phrase": "patient_identifiers"}, {"score": 0.0025578967205807843, "phrase": "code_status"}, {"score": 0.002436289099444074, "phrase": "nearly_a_quarter"}, {"score": 0.002336655334451464, "phrase": "pht."}, {"score": 0.0021049977753042253, "phrase": "treatment_plans"}], "paper_keywords": [""], "paper_abstract": "Objective: To facilitate patient handoffs between physicians, the computerized patient handoff tool (PHT) extracts information from the electronic health record to populate a form that is printed and given to the cross-cover physician. Objectives were to: (1) evaluate the rate at which data elements of interest were extracted from the electronic health record into the PHT, (2) assess the frequency for needing information beyond that contained in the PHT and where obtained, (3) assess physician's perceptions of the PHT, (4) identify opportunities for improvement. Design: Observational study. Measurements: This multi-method study included content coding of PHT forms, end of shift surveys of cross-cover resident physicians, and semi-structured interviews to identify opportunities for improvement. Thirty-five of 42 internal medicine resident physicians participated. Measures included: 1264 PHT forms coded for type of information, 63 end-of-shift surveys of cross-cover residents (residents could participate 2 times), and 18 semi-structured interviews. Results: For objective 1, patient identifiers and medications were reliably extracted (>98%). Other types of information-allergies and code status-were more variable (<50%). For objective 2, nearly a quarter of respondents required information from physician notes not available in the PHT. For objective 3, respondents found that the PHT Supported handoffs but indicated that it often excluded the assessment and plan. For objective 4, residents suggested including treatment plans. Conclusions: The PHT reliably extracts information from the electronic health record. Respondents found the PHT to be suitable, although opportunities for improvement were identified.", "paper_title": "Evaluation of a Physician Informatics Tool to Improve Patient Handoffs", "paper_id": "WOS:000267995500011"}