{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "first-spike_latency_coding"}, {"score": 0.004664352260912174, "phrase": "so-called_fm-bats"}, {"score": 0.003936910716320182, "phrase": "early_auditory_system"}, {"score": 0.0034849681064606543, "phrase": "rate_information"}, {"score": 0.0033937776228549557, "phrase": "simple_spike-time_model"}, {"score": 0.0033402088717816446, "phrase": "monaural_and_binaural_pathways"}, {"score": 0.0031845067058084583, "phrase": "spike-time_information"}, {"score": 0.0030684249587688826, "phrase": "known_neural_architecture"}, {"score": 0.002833689453299307, "phrase": "auditory_nerves"}, {"score": 0.0027159094186967247, "phrase": "head-related_transfer_function"}, {"score": 0.0024037949232582462, "phrase": "experimental_results"}, {"score": 0.0023532890136269986, "phrase": "fsl_code"}, {"score": 0.0023408288327263316, "phrase": "based_model"}, {"score": 0.002208035721125305, "phrase": "first-spike_latency"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Auditory system", " Echolocation", " First-spike latency"], "paper_abstract": "To perform echolocation, so-called FM-bats emit short pulses i.e., with a duration of a few milliseconds, and analyse the echoes coining from their environment. One individual echo, due to its short duration, will cause neurons in the early auditory system to generate between 1 and 3 spikes only. Hence, we argue that it is advantageous for FM-bats to use spike-time rather that firing rate information. We present a simple spike-time model of the monaural and binaural pathways up to the midbrain, to show that spike-time information can indeed be processed by the known neural architecture. In particular, we show that a First Spike Latency (FSL) code, as provided by the auditory nerves, can represent both the monaural and binaural intensity cues induced by the head-related transfer function in the peripheral system. We also show that ascending centres enhance the cues conveyed by such an FSL code. Finally, we present experimental results, comparing the FSL code based model proposed here with a more classic firing rate code, and we show that first-spike latency is a more biologically plausible alternative. (C) 2009 Elsevier Ltd. All rights reserved.", "paper_title": "Bat echolocation processing using first-spike latency coding", "paper_id": "WOS:000272764400002"}