{"auto_keywords": [{"score": 0.0496729815270419, "phrase": "message_sequence_charts"}, {"score": 0.00481495049065317, "phrase": "value_added_services"}, {"score": 0.0047135086583390585, "phrase": "value_added_service"}, {"score": 0.004497762477097628, "phrase": "different_teams"}, {"score": 0.004112812699639956, "phrase": "existing_ones"}, {"score": 0.004060566667226606, "phrase": "different_services"}, {"score": 0.0038253590626087237, "phrase": "negative_manner"}, {"score": 0.0036657110980445416, "phrase": "service_interaction"}, {"score": 0.0034977560416755726, "phrase": "service_interaction_detection"}, {"score": 0.0034532961266947734, "phrase": "formal_setup"}, {"score": 0.0031440159350875057, "phrase": "high-level_msc"}, {"score": 0.002961741486178455, "phrase": "user_point"}, {"score": 0.002899229492461335, "phrase": "basic_mscs"}, {"score": 0.002754516260621121, "phrase": "abstract_network_level"}, {"score": 0.0027078974645805736, "phrase": "service_properties"}, {"score": 0.0026734504926268442, "phrase": "local_point"}, {"score": 0.002465210678474529, "phrase": "potential_interactions"}, {"score": 0.0022828795331819025, "phrase": "interaction-prone_scenarios"}, {"score": 0.0022634699331607615, "phrase": "known_filtering_techniques"}], "paper_keywords": ["MSC", " Feature interaction", " Validation", " Detection", " Value added services", " Internet telephony", " Modeling", " Service interactions"], "paper_abstract": "A value added service is an extension to the basic call/session establishment functionality of a network. Different teams develop services independently or in order to handle complexity, a service is often specified individually without any consideration to existing ones. These different services may behave correctly when they run separately, but may interact in a negative manner when they are integrated. This is known as service interaction. In this paper, we tackle the problem of service interaction detection in a formal setup. We use message sequence charts (MSC) to specify the behaviors of services as well as their properties. In our specification style, high-level MSC (HMSC) is used to describe the behavior of services From the user point of view, while basic MSCs (bMSCs) are used to describe these behaviors at an abstract network level. We describe service properties from a local point of view. The behavior of a service is first validated against its properties. For the detection of potential interactions between two services, instead of merging their behaviors and then check for the interactions, we first determine interaction-prone scenarios using known filtering techniques, then we verify whether the properties of one service are satisfied by the behavior of the other service without combining their behaviors. In the case of non-satisfaction, we conclude that an interaction has been detected. (C) 2006 Elsevier Ltd. All rights reserved.", "paper_title": "Modeling and analysis of value added services using message sequence charts", "paper_id": "WOS:000262946500007"}