{"auto_keywords": [{"score": 0.048839643896770986, "phrase": "information_fusion"}, {"score": 0.0480299311058864, "phrase": "heterogeneous_information"}, {"score": 0.00481495049065317, "phrase": "multi-criteria_decision_making"}, {"score": 0.004529093447865156, "phrase": "single_composite"}, {"score": 0.0044896599221451216, "phrase": "potential_comparable_alternative_solutions"}, {"score": 0.004149792080414689, "phrase": "data_fusion"}, {"score": 0.0038692638652494697, "phrase": "normalization_process"}, {"score": 0.0035918768194006735, "phrase": "single_score"}, {"score": 0.0034835017385881385, "phrase": "computational_intelligence_concepts"}, {"score": 0.0033489371483830153, "phrase": "suitable_tools"}, {"score": 0.0032764307492734145, "phrase": "different_perspective"}, {"score": 0.0032336801561165113, "phrase": "field_where_much_work"}, {"score": 0.003108735847242537, "phrase": "multi-criteria_decision-making"}, {"score": 0.0030414140732789186, "phrase": "multi-criteria_problems"}, {"score": 0.002936709606809639, "phrase": "relevant_criteria"}, {"score": 0.0028731024405707277, "phrase": "heterogeneous_data"}, {"score": 0.00270221723573854, "phrase": "single_rating"}, {"score": 0.00266693888510356, "phrase": "candidate_alternative"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Data fusion", " Information fusion", " Computational intelligence", " Dynamic multi-criteria decision making"], "paper_abstract": "The main goal of information fusion is to combine heterogeneous information to obtain a single composite of potential comparable alternative solutions that can be classified and ranked. The crux of information fusion, which is a type of data fusion, is threefold: (i) data must be comparable and numerical, using some normalization process; (ii) imprecision in data must be taken into consideration; (iii) an appropriate aggregation function to combine values into a single score must be selected. Recently, computational intelligence concepts and techniques to perform data/information fusion are emerging as suitable tools. Although with a different perspective, another field where much work has also been done for combining heterogeneous information is multi-criteria decision-making. In general, multi-criteria problems are modelled by choosing a set of relevant criteria - usually dealing with heterogeneous data - that have to be aggregated (i.e. fused) to obtain a single rating for each candidate alternative. In this paper we propose an algorithm for data/information fusion, which includes concepts from multi-criteria decision-making and computational intelligence, specifically, fuzzy multi-criteria decision-making and mixture aggregation operators with weighting functions. The application field of interest for this work is safe spacecraft landing with hazard avoidance; hence two existing hazard maps will be used to illustrate the versatility of the algorithm. (C) 2013 Elsevier B.V. All rights reserved.", "paper_title": "FIF: A fuzzy information fusion algorithm based on multi-criteria decision making", "paper_id": "WOS:000333999000004"}