{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "mobile_robots"}, {"score": 0.04412469500707909, "phrase": "constrained_motion_model"}, {"score": 0.0415956281243621, "phrase": "k-step_reachable_region"}, {"score": 0.004571269461883144, "phrase": "fundamental_tasks"}, {"score": 0.004528301408585875, "phrase": "mobile_robotics"}, {"score": 0.004178935413340453, "phrase": "sensor_model"}, {"score": 0.004120130206000757, "phrase": "mobile_robot"}, {"score": 0.0034428776029411974, "phrase": "fixed_motion_styles"}, {"score": 0.0028630535573013686, "phrase": "k-step_detectable_region"}, {"score": 0.0025678829712650437, "phrase": "optimal_path"}, {"score": 0.0025078454114965147, "phrase": "dynamic_coverage"}, {"score": 0.002259883463607508, "phrase": "dynamic-coverage_strategy"}, {"score": 0.002196609505859369, "phrase": "simulation_results"}, {"score": 0.0021351033500114735, "phrase": "coverage_algorithm"}, {"score": 0.0021049977753042253, "phrase": "convex_and_concave_environments"}], "paper_keywords": ["Constrained motion model", " dynamic coverage", " mobile robot", " path planning", " reachable region", " target detecting"], "paper_abstract": "Target detecting and dynamic coverage are fundamental tasks in mobile robotics and represent two important features of mobile robots: mobility and perceptivity. This paper establishes the constrained motion model and sensor model of a mobile robot to represent these two features and defines the k-step reachable region to describe the states that the robot may reach. We show that the calculation of the k-step reachable region can be reduced from that of 2 k reachable regions with the fixed motion styles to k + 1 such regions and provide an algorithm for its calculation. Based on the constrained motion model and the k-step reachable region, the problems associated with target detecting and dynamic. coverage are formulated and solved. For target detecting, the k-step detectable region is used to describe the area that the robot may detect, and an algorithm for detecting a target and planning the optimal path is proposed. For dynamic coverage, the k-step detected region is used to represent the area that the robot has detected during its motion, and the dynamic-coverage strategy and algorithm are proposed. Simulation results demonstrate the efficiency of the coverage algorithm in both convex and concave environments.", "paper_title": "Constrained Motion Model of Mobile Robots and Its Applications", "paper_id": "WOS:000266069600015"}