{"auto_keywords": [{"score": 0.044144996857399005, "phrase": "complex_networks"}, {"score": 0.00481495049065317, "phrase": "mining_network_community_structure"}, {"score": 0.004645057834614705, "phrase": "important_topological_property"}, {"score": 0.004348936976349555, "phrase": "invaluable_help"}, {"score": 0.0034426417353349567, "phrase": "open_challenge"}, {"score": 0.0033409791799749403, "phrase": "existing_works"}, {"score": 0.0032229262928681304, "phrase": "community_structure"}, {"score": 0.0031277316566463978, "phrase": "network_evolution"}, {"score": 0.003053598205821532, "phrase": "self-organizing_network"}, {"score": 0.002981216610222911, "phrase": "mining_communities"}, {"score": 0.002841545331522694, "phrase": "existing_algorithm"}, {"score": 0.0026600905156986317, "phrase": "good_classification_capability"}, {"score": 0.0025202582748972122, "phrase": "well-defined_community_structures"}, {"score": 0.00241658945942583, "phrase": "prior_knowledge"}], "paper_keywords": [""], "paper_abstract": "Community structure is an important topological property of network. Being able to discover it can provide invaluable help in exploiting and understanding complex networks. Although many algorithms have been developed to complete this task, they all have advantages and limitations. So the issue of how to detect communities in networks quickly and correctly remains an open challenge. Distinct from the existing works, this paper studies the community structure from the view of network evolution and presents a self-organizing network evolving algorithm for mining communities hidden in complex networks. Compared with the existing algorithm, our approach has three distinct features. First, it has a good classification capability and especially works well with the networks without well-defined community structures. Second, it requires no prior knowledge and is insensitive to the build-in parameters. Finally, it is suitable for not only positive networks but also singed networks containing both positive and negative weights.", "paper_title": "Self-organizing network evolving model for mining network community structure", "paper_id": "WOS:000240088200045"}