{"auto_keywords": [{"score": 0.040642263753439135, "phrase": "japan"}, {"score": 0.011823795506379214, "phrase": "uk"}, {"score": 0.00481495049065317, "phrase": "home_telehealth"}, {"score": 0.004757087682427765, "phrase": "international_perspective"}, {"score": 0.004514241562580097, "phrase": "scientific_literature"}, {"score": 0.0037955672944969287, "phrase": "vital_sign_parameter"}, {"score": 0.0035296940954990964, "phrase": "improved_information_access"}, {"score": 0.0034452601929727752, "phrase": "decision_support"}, {"score": 0.0032956583072431423, "phrase": "clinical_application_domains"}, {"score": 0.0032559935867182035, "phrase": "chronic_diseases"}, {"score": 0.003216804708106142, "phrase": "elderly_population"}, {"score": 0.0028155572612699976, "phrase": "patient-provider_relationship"}, {"score": 0.002759279370360986, "phrase": "special_user_groups"}, {"score": 0.0026181517251690606, "phrase": "evaluation_studies"}, {"score": 0.002597088221737922, "phrase": "rare_and_further_research"}, {"score": 0.0024543014947630876, "phrase": "potential_solutions"}, {"score": 0.002272964710550345, "phrase": "incompatible_information_systems"}, {"score": 0.0022185261335667863, "phrase": "evaluation_framework"}, {"score": 0.0021049977753042253, "phrase": "home_telehealth_solutions"}], "paper_keywords": ["home care", " telemedicine", " home telehealth", " home based eHealth"], "paper_abstract": "Objective: The purpose of this paper is to give an overview about the state of the art in research on home telehealth in an international perspective. Method: The study is based on a review of the scientific literature published between 1990 and 2003 and retrieved via Medline in January/February 2004. All together, the abstracts of 578 publications have been analyzed. Results: The majority of publications (44%) comes from the United States, followed by UK and Japan. Most publications deal with vital sign parameter (VSP) measurement and audio/video consultations (\"virtual visits\"). Publications about IT tools for improved information access and communication as well as decision support for staff, patients and relatives are relatively sparse. Clinical application domains are mainly chronic diseases, the elderly population and paediatrics. Conclusions: Internationally, we observe a trend towards tools and services not only for professionals but also for patients and citizens. However, their impact on the patient-provider relationship and their design for special user groups, such as elderly and/or disabled needs to be further explored. In general, evaluation studies are rare and further research is critical to determine the impacts and benefits, and limitations, of potential solutions and to overcome a number of hinders and restrictions, such as the lack of standards to combine incompatible information systems; the lack of an evaluation framework considering legal, ethical, organisational, clinical, usability and technical aspects; the lack of proper guidelines for practical implementation of home telehealth solutions. (c) 2005 Elsevier Ireland Ltd. All rights reserved.", "paper_title": "Home telehealth - Current state and future trends", "paper_id": "WOS:000239067800001"}