{"auto_keywords": [{"score": 0.04872396874382183, "phrase": "classroom_technology_practices"}, {"score": 0.03327620350569449, "phrase": "student-centered_beliefs"}, {"score": 0.00481495049065317, "phrase": "early_studies"}, {"score": 0.004769094364165299, "phrase": "teachers'_enacted_beliefs"}, {"score": 0.004333777641701335, "phrase": "external_barriers"}, {"score": 0.003802135020791801, "phrase": "multiple_case-study_research"}, {"score": 0.0036592001010420667, "phrase": "pedagogical_beliefs"}, {"score": 0.0033354927389810207, "phrase": "follow-up_interviews"}, {"score": 0.003251328737784481, "phrase": "teachers'_classroom_practices"}, {"score": 0.0031895978980118127, "phrase": "close_alignment"}, {"score": 0.0031290354217563938, "phrase": "student-centered_practices"}, {"score": 0.002954140458190344, "phrase": "student-centered_curricula"}, {"score": 0.0028068790615886755, "phrase": "students'_learning"}, {"score": 0.0027535633837592597, "phrase": "biggest_impact"}, {"score": 0.002675477598833661, "phrase": "internal_factors"}, {"score": 0.002591303221962211, "phrase": "problem-solving_mentality"}, {"score": 0.002477878389967939, "phrase": "key_roles"}, {"score": 0.0024075916292945715, "phrase": "strongest_barriers"}, {"score": 0.0021595521075096808, "phrase": "teachers'_attitudes"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Inservice teacher", " Technology use", " Technology integration", " Teacher technology use", " Teacher professional development"], "paper_abstract": "Early studies indicated that teachers' enacted beliefs, particularly in terms of classroom technology practices, often did not align with their espoused beliefs. Researchers concluded this was due, at least in part, to a variety of external barriers that prevented teachers from using technology in ways that aligned more closely with their beliefs. However, many of these barriers (access, support, etc.) have since been eliminated in the majority of schools. This multiple case-study research was designed to revisit the question, \"How do the pedagogical beliefs and classroom technology practices of teachers, recognized for their technology uses, align?\" Twelve K-12 classroom teachers were purposefully selected based on their award-winning technology practices, supported by evidence from personal and/or classroom websites. Follow-up interviews were conducted to examine the correspondence between teachers' classroom practices and their pedagogical beliefs. Results suggest close alignment; that is student-centered beliefs undergirded student-centered practices (authenticity, student choice, collaboration). Moreover, teachers with student-centered beliefs tended to enact student-centered curricula despite technological, administrative, or assessment barriers. Teachers' own beliefs and attitudes about the relevance of technology to students' learning were perceived as having the biggest impact on their success. Additionally, most teachers indicated that internal factors (e.g., passion for technology, having a problem-solving mentality) and support from others (administrators and personal learning networks) played key roles in shaping their practices. Teachers noted that the strongest barriers preventing other teachers from using technology were their existing attitudes and beliefs toward technology, as well as their current levels of knowledge and skills. Recommendations are made for refocusing our professional development efforts on strategies for facilitating changes in teachers' attitudes and beliefs. (C) 2012 Elsevier Ltd. All rights reserved.", "paper_title": "Teacher beliefs and technology integration practices: A critical relationship", "paper_id": "WOS:000305036400024"}