{"auto_keywords": [{"score": 0.03933001930155138, "phrase": "open_path"}, {"score": 0.00892884853252023, "phrase": "open_cluster"}, {"score": 0.00481495049065317, "phrase": "related_processes"}, {"score": 0.0047468516620285525, "phrase": "ordinary_bond_percolation"}, {"score": 0.0046797114400479135, "phrase": "finite_or_countably_infinite_graph"}, {"score": 0.004357927940322685, "phrase": "earlier_paper"}, {"score": 0.004316722156877335, "phrase": "j._van_den_berg"}, {"score": 0.004275904315753662, "phrase": "j._kahn"}, {"score": 0.0042354707960660706, "phrase": "ann_probab"}, {"score": 0.003154360892955196, "phrase": "present_paper"}, {"score": 0.0022933216359142736, "phrase": "percolation_and_contact_processes"}, {"score": 0.0021049977753042253, "phrase": "belitsky_et_al"}], "paper_keywords": ["correlation inequalities", " percolation", " contact process", " random-cluster model", " Ahlswede-Daykin Theorem"], "paper_abstract": "Consider ordinary bond percolation on a finite or countably infinite graph. Let s, t, a, and b be vertices. An earlier paper (J. Van den Berg and J. Kahn, Ann Probab 29 (2001), 123-126) proved the (nonintuitive) result that, conditioned on the event that there is no open path from s to t, the two events \"there is an open path from s to a\" and \"there is an open path from s to b\" are positively correlated. In the present paper we further investigate and generalize the theorem of which this result was a consequence. This leads to results saying, informally, that, with the above conditioning, the open cluster of s is conditionally positively (self-) associated and that it is conditionally negatively correlated with the open cluster of t. We also present analogues of some of our results for (a) random-cluster measures and (b) directed percolation and contact processes and observe that the latter lead to improvements of some of the results in a paper of Belitsky et al.", "paper_title": "Some conditional correlation inequalities for percolation and related processes", "paper_id": "WOS:000242116100001"}