{"auto_keywords": [{"score": 0.04728331461408164, "phrase": "essential_steps"}, {"score": 0.03488739830592305, "phrase": "sapphire_model"}, {"score": 0.015719716506582538, "phrase": "biomimetic_design"}, {"score": 0.0044934449515131, "phrase": "biomimetic_process"}, {"score": 0.004373537527118041, "phrase": "transferred_knowledge"}, {"score": 0.0041183611532727375, "phrase": "biomimetic_design_processes"}, {"score": 0.003387108469185429, "phrase": "underlying_similarity"}, {"score": 0.003356675879109443, "phrase": "biological_and_corresponding_analogue_technical_system"}, {"score": 0.0031606404966938568, "phrase": "account_similarity"}, {"score": 0.003132236287543072, "phrase": "biomimetic_examples"}, {"score": 0.003085460307255466, "phrase": "appropriate_levels"}, {"score": 0.0028446460307503343, "phrase": "design_experiments"}, {"score": 0.0027519956065269126, "phrase": "physical_effects"}, {"score": 0.0025989960809479104, "phrase": "lowest_levels"}, {"score": 0.002476755123108715, "phrase": "physical_effect_level"}, {"score": 0.0024250944519924383, "phrase": "generic_set"}, {"score": 0.002360250030403706, "phrase": "proposed_guidelines"}, {"score": 0.0023460767171603054, "phrase": "design_performance"}, {"score": 0.002255997431382507, "phrase": "useful_representation"}, {"score": 0.00223570488212345, "phrase": "complex_biological_systems"}, {"score": 0.002195664530777783, "phrase": "biological_systems"}, {"score": 0.0021049977753042253, "phrase": "biomimetic_concept_generation"}], "paper_keywords": ["Biomimetics", " Databases", " Design Process", " Functionality", " Transfer"], "paper_abstract": "Biomimetics involves transfer from one or more biological examples to a technical system. This study addresses four questions. What are the essential steps in a biomimetic process? What is transferred? How can the transferred knowledge be structured in a way useful for biologists and engineers? Which guidelines can be given to support transfer in biomimetic design processes? In order to identify the essential steps involved in carrying out biomimetics, several procedures found in the literature were summarized, and four essential steps that are common across these procedures were identified. For identification of mechanisms for transfer, 20 biomimetic examples were collected and modeled according to a model. of causality called the SAPPhIRE model. These examples were then analyzed for identifying the underlying similarity between each biological and corresponding analogue technical system. Based on the SAPPhIRE model, four levels of abstraction at which transfer takes place were identified. Taking into account similarity, the biomimetic examples were assigned to the appropriate levels of abstraction of transfer. Based on the essential steps and the levels of transfer, guidelines for supporting transfer in biomimetic design were proposed and evaluated using design experiments. The 20 biological and analogue technical systems that were analyzed were similar in the physical effects used and at the most abstract levels of description of their functionality, but they were the least similar at the lowest levels of abstraction: the parts involved. Transfer most often was carried out at the physical effect level of abstraction. Compared to a generic set of guidelines based on the literature, the proposed guidelines improved design performance by about 60%. Further, the SAPPhIRE model turned out to be a useful representation for modeling complex biological systems and their functionality. Databases of biological systems, which are structured using the SAPPhIRE model, have the potential to aid biomimetic concept generation.", "paper_title": "A methodology for supporting \"transfer\" in biomimetic design", "paper_id": "WOS:000283697300004"}