{"auto_keywords": [{"score": 0.045492676640370204, "phrase": "process_model"}, {"score": 0.01027638925567195, "phrase": "next_stage"}, {"score": 0.00481495049065317, "phrase": "business_processes"}, {"score": 0.004741167616693272, "phrase": "purpose_-_process_mining"}, {"score": 0.00468656988857138, "phrase": "new_means"}, {"score": 0.004544016163767266, "phrase": "application_domains"}, {"score": 0.004271729935895193, "phrase": "discovered_models"}, {"score": 0.0042388570312522, "phrase": "process_mining"}, {"score": 0.004190019394361629, "phrase": "useful_optimization"}, {"score": 0.003954109842050071, "phrase": "\"pair-adjacent_activities"}, {"score": 0.0039085400187964196, "phrase": "\"pair-adjacent_persons"}, {"score": 0.0031968441980848436, "phrase": "conditional_probability"}, {"score": 0.0030401074516310184, "phrase": "real_data"}, {"score": 0.002913483929932102, "phrase": "proposed_handover_optimization_process"}, {"score": 0.002665465323614577, "phrase": "next_activity"}], "paper_keywords": ["Process mining", " Adjacency matrix", " Time prediction", " Handover optimization"], "paper_abstract": "Purpose - Process mining provides a new means to improve processes in a variety of application domains. The purpose of this paper is to abstract a process model and then use the discovered models from process mining to make useful optimization via predictions. Design/methodology/approach - The paper divides the process model into a combination of \"pair-adjacent activities\" and \"pair-adjacent persons\" in the event logs. First, two new handover process models based on adjacency matrix are proposed. Second, by adding the stage, frequency, and time for every activity or person into the matrix, another two new handover prediction process models based on stage adjacency matrix are further proposed. Third, compute the conditional probability from every stage to next stage through the frequency. Finally, use real data to analyze and demonstrate the practicality and effectiveness of the proposed handover optimization process. Findings - The process model can be extended with information to predict what will actually happen, how possible to reach the next activity, who will do this activity, and the corresponding probability if there are several people executing the same activity, etc. Originality/value - The contribution of this paper is to predict what will actually happen, how possible it is to reach the following activities or persons in the next stage, how soon to reach the following activities or persons by calculating all the possible interval time via different traces, who will do this activity, and the corresponding probability if there are several people executing the same activity, etc.", "paper_title": "Handover optimization in business processes via prediction", "paper_id": "WOS:000327368800009"}