{"auto_keywords": [{"score": 0.04117972994186605, "phrase": "initial_value"}, {"score": 0.00481495049065317, "phrase": "wireless_sensor_network"}, {"score": 0.004260134699483774, "phrase": "common_decision"}, {"score": 0.004089725258435817, "phrase": "distributed_network"}, {"score": 0.003581412258960711, "phrase": "algorithm_convergence_rate"}, {"score": 0.003334309053314909, "phrase": "utility_function"}, {"score": 0.003088384809415812, "phrase": "network_designers"}, {"score": 0.0030414140732789186, "phrase": "optimal_decision"}, {"score": 0.0026091594819333654, "phrase": "simulation_results"}, {"score": 0.0025174594088331853, "phrase": "network_topology"}, {"score": 0.002479150189700726, "phrase": "proposed_acdc_gossip_algorithm"}, {"score": 0.00235560370536971, "phrase": "real_average_value"}, {"score": 0.0023197517832705297, "phrase": "referenced_standard_gossip_and_grid_cluster_gossip_algorithms"}, {"score": 0.0022728308668635315, "phrase": "doi"}, {"score": 0.0021928902836049384, "phrase": "lower_relative_error"}], "paper_keywords": [""], "paper_abstract": "In this paper, we propose an average connectivity degree cluster (ACDC) scheme gossip algorithm to improve the convergence speed and the accuracy of the consensus, when a common decision is needed for a certain phenomenon in a distributed network. We analyze the effects of the initial value, the network topology (regular and irregular), and the number of clusters on the algorithm convergence rate as well as the accuracy of the value when reaching consensus. A utility function is developed based on two parameters, iteration and relative error, to help the network designers make an optimal decision based on their requirements. An irregular sensor model which is based on the degree of irregular (DOI) radius is introduced to evaluate the robustness of the algorithm. The simulation results demonstrate that for any initial value and network topology, the proposed ACDC gossip algorithm can yield results that are 50% closer to the real average value than the referenced standard gossip and grid cluster gossip algorithms. With different DOI values, our ACDC gossip algorithm can still reach lower relative error compared with other gossip algorithms, which demonstrates that our algorithm is robust enough to be executed in the network.", "paper_title": "A Cluster-Based Consensus Algorithm in a Wireless Sensor Network", "paper_id": "WOS:000316481600001"}