{"auto_keywords": [{"score": 0.03968687978228754, "phrase": "transmission_gates"}, {"score": 0.004664352260912174, "phrase": "acceptable_high_yield"}, {"score": 0.00446490613141384, "phrase": "individual_dies"}, {"score": 0.004412000844879264, "phrase": "prebond_stage"}, {"score": 0.004042635935882651, "phrase": "previous_work"}, {"score": 0.003808619097554076, "phrase": "redundant_trees"}, {"score": 0.0034345152879289025, "phrase": "practically_viable_clock_tree_optimization_techniques"}, {"score": 0.0029409171055888804, "phrase": "diverse_exploration"}, {"score": 0.0028601252251285025, "phrase": "prebond_die_testing"}, {"score": 0.0026412824985309323, "phrase": "existing_topology_generation_algorithms"}, {"score": 0.002419798694301991, "phrase": "benchmark_circuits"}, {"score": 0.0023532890136269986, "phrase": "clock_tree_exploration"}, {"score": 0.002270449532546444, "phrase": "resource_balance"}, {"score": 0.0021049977753042253, "phrase": "total_wirelength"}], "paper_keywords": ["3-D integrated circuits (ICs)", " clock tree synthesis", " delay-locked loop (DLL)-based clock network", " prebond testing", " resource allocation"], "paper_abstract": "In 3-D stacked integrated circuit (IC) manufacturing, for the acceptable high yield, it is essential to stack only known good dies by testing the individual dies at the prebond stage. While the postbonded 3-D IC is operated by a low power 3-D clock tree, the prebond testing requires a 2-D clock tree on each die. The previous work provided a prebond testable 3-D clock tree synthesis solution by allocating through-silicon via (TSV) buffers and redundant trees with transmission gates. However, no optimizations on the allocation and design of the resources have been addressed. In this paper, we propose practically viable clock tree optimization techniques under prebond testability: 1) TSV-buffer-aware topology generation techniques that enable an economical buffer allocation by preventing (potentially \"bad\") TSV buffers; 2) delay-locked loop (DLL)-based 2-D clock network design method that offers a diverse exploration of 2-D clock tree synthesis and resource allocation for prebond die testing; and 3) a new circuit design technique of transmission gates that completely removes its control line. Compared to the existing topology generation algorithms, our proposed TSV-buffer-aware topology generation uses 68%-88% fewer TSVs, 36%-58% less wire resource, and 35%-69% fewer buffers while consuming 17%-43% less clock power for the benchmark circuits, and our proposed method of clock tree exploration provides many alternative structures of a 2-D clock tree, considering the resource balance between DLLs and wires. In addition, the use of our self-controlled clock transmission gate enables a drastic reduction of the total wirelength, which amounts to 18% on average.", "paper_title": "Resource Allocation and Design Techniques of Prebond Testable 3-D Clock Tree", "paper_id": "WOS:000314676500012"}