{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "temporal_patterns"}, {"score": 0.015591788668102596, "phrase": "large_transaction_sets"}, {"score": 0.01313019343439907, "phrase": "time_points"}, {"score": 0.012811375745116071, "phrase": "discovered_itemset"}, {"score": 0.007922030978796273, "phrase": "pruning_techniques"}, {"score": 0.004601045179623499, "phrase": "frequent_itemsets"}, {"score": 0.0043066860455264, "phrase": "large_set"}, {"score": 0.004098291340525772, "phrase": "temporal_pattern"}, {"score": 0.0036202043425301042, "phrase": "interesting_patterns"}, {"score": 0.0032510690712452147, "phrase": "discovered_itemsets"}, {"score": 0.0030177339185643226, "phrase": "temporal_pattern_p"}, {"score": 0.002344311033783139, "phrase": "mining_process"}, {"score": 0.0022399174232611853, "phrase": "performance_benefits"}, {"score": 0.002175913488493802, "phrase": "direct_extension"}, {"score": 0.0021579641460002523, "phrase": "non-temporal_data_mining_algorithms"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["knowledge discovery", " temporal data mining", " temporal pattern"], "paper_abstract": "This paper studies the problem of mining frequent itemsets along with their temporal patterns from large transaction sets. A model is proposed in which users define a large set of temporal patterns that are interesting or meaningful to them. A temporal pattern defines the set of time points where the user expects a discovered itemset to be frequent. The model is general in that (i) no constraints are placed on the interesting patterns given by the users, and (ii) two measures-inclusiveness and exchisiveness-are used to capture how well the temporal patterns match the time points given by the discovered itemsets. Intuitively, these measures indicate to what extent a discovered itemset is frequent at time points included in a temporal pattern p, but not at time points not in p. Using these two measures, one is able to model many temporal data mining problems appeared in the literature, as well as those that have not been studied. By exploiting the relationship within and between itemset space and pattern space simultaneously, a series of pruning techniques are developed to speed up the mining process. Experiments show that these pruning techniques allow one to obtain performance benefits up to 100 times over a direct extension of non-temporal data mining algorithms. (C) 2005 Elsevier Inc. All rights reserved.", "paper_title": "Looking into the seeds of time: Discovering temporal patterns in large transaction sets", "paper_id": "WOS:000235567800003"}