{"auto_keywords": [{"score": 0.04638215735722648, "phrase": "interactive_hashing"}, {"score": 0.008129024013879783, "phrase": "bounded_storage_model"}, {"score": 0.00481495049065317, "phrase": "storage-bounded_receiver"}, {"score": 0.004682525167261325, "phrase": "essential_ingredient"}, {"score": 0.004601606675066839, "phrase": "large_variety"}, {"score": 0.004569630374630379, "phrase": "cryptographic_tasks"}, {"score": 0.004537875262684779, "phrase": "notably_oblivious_transfer"}, {"score": 0.004351905364003354, "phrase": "bit_string"}, {"score": 0.003505378950567746, "phrase": "application-independent_set"}, {"score": 0.0034207673889407003, "phrase": "interactive_hashing_protocols"}, {"score": 0.003314965171168532, "phrase": "detailed_analysis"}, {"score": 0.003280427617955518, "phrase": "standard_implementation"}, {"score": 0.0031130463625133496, "phrase": "significant_improvement"}, {"score": 0.003091381857342703, "phrase": "previous_attempts"}, {"score": 0.0029852932802967224, "phrase": "considerably_simpler_proof"}, {"score": 0.002842840150239715, "phrase": "cheating_probability"}, {"score": 0.0028132076314202606, "phrase": "dishonest_sender"}, {"score": 0.0027071661844502992, "phrase": "output_strings"}, {"score": 0.002678944072162297, "phrase": "rare_desirable_property"}, {"score": 0.0023540798554571745, "phrase": "small_constant"}, {"score": 0.0021421082915443887, "phrase": "cryptographic_tool"}, {"score": 0.0021049977753042253, "phrase": "oblivious_transfer"}], "paper_keywords": ["Interactive hashing", " oblivious transfer", " bounded storage model"], "paper_abstract": "Interactive hashing has featured as an essential ingredient in protocols realizing a large variety of cryptographic tasks, notably oblivious transfer in the bounded storage model. In interactive hashing, a sender transfers a bit string to a receiver such that two strings are received, the original string and a second string that appear to be chosen at random. This paper presents a self-contained, information theoretic study of interactive hashing. We start by formalizing the notion of interactive hashing as a cryptographic primitive, disentangling it from the specifics of its various implementations. To this end, we present an application-independent set of information theoretic conditions that all interactive hashing protocols must ideally satisfy. We then provide a detailed analysis of a standard implementation of interactive hashing which is shown to satisfy all the conditions of our definition. Our analysis represents a significant improvement over previous attempts in more restricted contexts. Despite its generality, it offers a considerably simpler proof of security. Moreover, it establishes a tighter upper bound on the cheating probability of a dishonest sender, who wishes to manipulate the protocol so that both output strings have some rare desirable property. In particular, we prove that if the set of desirable strings for the dishonest sender represents a fraction f of all strings, then the probability that both outputs will be from this set is no larger than 15.6805 . f. This upper bound is valid for any f and is tight up to a small constant, since a sender acting honestly would get two outputs from this set with probability very close to f. We illustrate the power of interactive hashing as a cryptographic tool by surveying protocols achieving oblivious transfer in the bounded storage model, which typically rely heavily on interactive hashing.", "paper_title": "Information-Theoretic Interactive Hashing and Oblivious Transfer to a Storage-Bounded Receiver", "paper_id": "WOS:000361486800026"}