{"auto_keywords": [{"score": 0.004413846562278824, "phrase": "author's_interpretation"}, {"score": 0.003987755561492638, "phrase": "comparative_analysis"}, {"score": 0.003849711329589429, "phrase": "design_approach"}, {"score": 0.003770743342438053, "phrase": "scientific_approach"}, {"score": 0.0035728978842974246, "phrase": "consequent_findings"}, {"score": 0.0034277774138167837, "phrase": "research_implications"}, {"score": 0.003268137321490985, "phrase": "popperian"}, {"score": 0.0031418655269489447, "phrase": "secondary_outcome"}, {"score": 0.002855934865505357, "phrase": "practical_implications"}, {"score": 0.0028382152567141784, "phrase": "theoretical_validity"}, {"score": 0.002826463131503618, "phrase": "second-order_cybernetics"}, {"score": 0.0027857115172243226, "phrase": "proper_place"}, {"score": 0.0027285092615179627, "phrase": "approach_designers"}, {"score": 0.0026614107636990327, "phrase": "equal_par"}, {"score": 0.0025268615557570355, "phrase": "design_work"}, {"score": 0.0023498160190690218, "phrase": "communication_criteria"}, {"score": 0.0023159206863322458, "phrase": "classical_cybernetic_approaches"}, {"score": 0.0021181494680857643, "phrase": "design_act"}], "paper_keywords": ["analogy", " circularity", " conversation", " cybernetics", " design", " novelty"], "paper_abstract": "Purpose - The purpose of this paper is to explore the two subjects, cybernetics and design, in order to establish and demonstrate a relationship between them. It is held that the two subjects can be considered complementary arms of each other. Design/methodology/approach - The two subjects are each characterised so that the author's interpretation is explicit and those who know one subject but not the other are briefed. Cybernetics is examined in terms of both classical (first-order) cybernetics, and the more consistent second-order cybernetics, which is the cybernetics used in this argument, The paper develops by a comparative analysis of the two subjects, and exploring analogies between the two at several levels. Findings - A design approach is characterised and validated, and contrasted with a scientific approach. The analogies that are proposed are shown to hold. Cybernetics is presented as theory for design, design as cybernetics in practice. Consequent findings, for instance that both cybernetics and design imply the same ethical qualities, are presented. Research limitations/implications - The research implications of the paper are that, where research involves design, the criteria against which it can be judged are far more Popperian than might be imagined. Such research will satisfy the condition of adequacy, rather than correctness. A secondary outcome concerning research is that, whereas science is concerned with what is (characterised through the development of knowledge of (what is)), design (and by implication other subjects primarily concerned with action) is concerned with knowledge for acting. Practical implications - The theoretical validity of second-order cybernetics is used to justify and give proper place to design as an activity. Thus, the approach designers use is validated as complementary to, and placed on an equal par with, other approaches. This brings design, as an approach, into the realm of the acceptable. The criteria for the assessment of design work are shown to be different from those appropriate in other, more traditionally acceptable approaches. Originality/value - For approximately 40 years, there have been claims that cybernetics and design share much in common. This was originally expressed through communication criteria, and by the use of classical cybernetic approaches as methods for use in designing. This paper argues a much closer relationship between cybernetics and design, through consideration of developments in cybernetics not available 40 years ago (second-order cybernetics) and through examining the activity at the heart of the design act, whereas many earlier attempts have been concerned with research that is much more about assessment, prescription and proscription.", "paper_title": "Try again. Fail again. Fail better: the cybernetics in design and the design in cybernetics", "paper_id": "WOS:000251883500003"}