{"auto_keywords": [{"score": 0.04398714383022719, "phrase": "anti-hiv_activity"}, {"score": 0.00481495049065317, "phrase": "tibo_derivatives"}, {"score": 0.004750178261675602, "phrase": "support_vector_machines"}, {"score": 0.00357362651129581, "phrase": "ten_molecular_descriptors"}, {"score": 0.0034079696245884073, "phrase": "predictive_capability"}, {"score": 0.0033393377529146893, "phrase": "svm_method"}, {"score": 0.0031415984808041324, "phrase": "artificial_neural_networks"}, {"score": 0.0030992666061123533, "phrase": "multiple_linear_regression"}, {"score": 0.0029355502535757696, "phrase": "svm_model"}, {"score": 0.0028764048059439205, "phrase": "kernel_radial_basis_function"}, {"score": 0.002687702958515561, "phrase": "tibo"}, {"score": 0.0023625233416109917, "phrase": "structure-activity_relationships"}, {"score": 0.0021049977753042253, "phrase": "molecular_description"}], "paper_keywords": ["QSAR", " anti-HIV", " TIBO", " support vector machine", " neural network", " MLR"], "paper_abstract": "A quantitative structure-activity relationship (QSAR) study is suggested for the prediction of anti-HIV activity of tetrahydroimidazo[4,5,1-jk][1,4]benzodiazepinone (TIBO) derivatives. The model was produced by using the support vector machine (SVM) technique to develop quantitative relationships between the anti-HIV activity and ten molecular descriptors of 89 TIBO derivatives. The performance and predictive capability of the SVM method were investigated and compared with other techniques such as artificial neural networks and multiple linear regression. The results obtained indicate that the SVM model with the kernel radial basis function can be successfully used to predict the anti-HIV activity of TIBO derivatives with only ten molecular descriptors that can be calculated directly from only molecular structure. The contribution of each descriptor to the structure-activity relationships was evaluated. Hydrophobicity of the molecule was thus found to take the most relevant part in the molecular description.", "paper_title": "Quantitative structure-activity relationship studies of TIBO derivatives using support vector machines", "paper_id": "WOS:000278708000002"}