{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "energy_parity_games"}, {"score": 0.006679230273897157, "phrase": "np"}, {"score": 0.00534618569967606, "phrase": "mean-payoff_parity_games"}, {"score": 0.004767546015485477, "phrase": "infinite_two-player_turn-based_games"}, {"score": 0.0037967593942595233, "phrase": "resource-constrained_omega-regular_specifications"}, {"score": 0.0036312482387007815, "phrase": "simplest_model"}, {"score": 0.0035600143547053287, "phrase": "combined_qualitative_and_quantitative_objectives"}, {"score": 0.002806449337145999, "phrase": "energy_parity"}, {"score": 0.0027513507830537165, "phrase": "energy_games"}, {"score": 0.0022010965931147735, "phrase": "conceptually_simple_algorithm"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Games on graphs", " Parity objectives", " Quantitative objectives"], "paper_abstract": "Energy parity games are infinite two-player turn-based games played on weighted graphs. The objective of the game combines a (qualitative) parity condition with the (quantitative) requirement that the sum of the weights (i.e., the level of energy in the game) must remain positive. Beside their own interest in the design and synthesis of resource-constrained omega-regular specifications, energy parity games provide one of the simplest model of games with combined qualitative and quantitative objectives. Our main results are as follows: (a) exponential memory is sufficient and may be necessary for winning strategies in energy parity games; (b) the problem of deciding the winner in energy parity games can be solved in NP boolean AND coNP; and (c) we give an algorithm to solve energy parity by reduction to energy games. We also show that the problem of deciding the winner in energy parity games is logspace-equivalent to the problem of deciding the winner in mean-payoff parity games, which can thus be solved in NP boolean AND coNP. As a consequence we also obtain a conceptually simple algorithm to solve mean-payoff parity games. (C) 2012 Elsevier B.V. All rights reserved.", "paper_title": "Energy parity games", "paper_id": "WOS:000310184900003"}