{"auto_keywords": [{"score": 0.013088516571197214, "phrase": "greater_impact"}, {"score": 0.010959807424985342, "phrase": "non-cover_paper"}, {"score": 0.004256243266481051, "phrase": "printed_and_electronic_journal"}, {"score": 0.003880017219275826, "phrase": "non-cover_papers"}, {"score": 0.0036477941360224435, "phrase": "plos_biology"}, {"score": 0.0034294219963679857, "phrase": "scholarly_impact"}, {"score": 0.003145417398038261, "phrase": "group_difference"}, {"score": 0.0029027394930867902, "phrase": "cover_paper"}, {"score": 0.002728847267539957, "phrase": "upper_level"}, {"score": 0.0025972447844047515, "phrase": "citation_impact"}, {"score": 0.0021049977753042253, "phrase": "paper_being"}], "paper_keywords": ["Paper featured on cover", " Cover image", " Cover paper", " Article usage", " Article view", " Citation"], "paper_abstract": "Paper featured on the cover of a journal has more visibility in an issue compared with other ordinary articles for both printed and electronic journal. Does this kind of visibility guarantee more attention and greater impact of its associated content than the non-cover papers? In this research, usage and citation data of 60 issues of PLOS Biology from 2006 to 2010 are analyzed to compare the attention and scholarly impact between cover and non-cover paper. Our empirical study confirms that, in most cases, the group difference between cover and non-cover paper is not significant for attention or impact. Cover paper is not the best one, nor at the upper level in one issue considering the attention or the citation impact. Having a paper featured on the cover of a journal may be a source of pride to researchers, many institutions and researchers would even release news about it. However, a paper being featured on the cover of a journal doesn't guarantee more attention and greater impact.", "paper_title": "Does a paper being featured on the cover of a journal guarantee more attention and greater impact?", "paper_id": "WOS:000348324000039"}