{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "lookup_performance"}, {"score": 0.012690798578611617, "phrase": "different_churn_rates"}, {"score": 0.004774324145784758, "phrase": "distributed_hash_table_systems"}, {"score": 0.004518442937844318, "phrase": "distributed_hash_table"}, {"score": 0.004012751049253625, "phrase": "theoretical_analysis"}, {"score": 0.0039119492240482, "phrase": "design_choices"}, {"score": 0.003593812067062062, "phrase": "dht_lookup_performance"}, {"score": 0.003301461490509176, "phrase": "theoretical_basis"}, {"score": 0.0032321559007422087, "phrase": "better_design_choices"}, {"score": 0.0029565620771207003, "phrase": "better_alternatives"}, {"score": 0.002857849698346116, "phrase": "lookup_parallelism"}, {"score": 0.0027274643070540733, "phrase": "optimal_degree"}, {"score": 0.0026252106881752067, "phrase": "key_replication"}, {"score": 0.002505412457777352, "phrase": "replicated_key"}, {"score": 0.0024114635128122783, "phrase": "proper_configuration"}, {"score": 0.0023708445073819277, "phrase": "analytical_study"}, {"score": 0.0022722587535064205, "phrase": "kad"}, {"score": 0.0021049977753042253, "phrase": "john_wiley"}], "paper_keywords": ["distributed hash table (DHT) system", " lookup performance", " chum"], "paper_abstract": "The phenomenon of system churn degrades the lookup performance of distributed hash table (DHT) systems greatly. To handle the churn, a number of approaches have been proposed to date. However, there is a lack of theoretical analysis to direct how to make design choices under different churn rates and how to configure their parameters optimally. In this paper, we analytically study three important aspects on optimizing DHT lookup performance under churn, i.e. lookup strategy, lookup parallelism and lookup key replication. Our objective is to build a theoretical basis for designers to make better design choices in the future. We first compare the performance of two representative lookup strategies-recursive routing and iterative routing-and explore the existence of better alternatives. Then we study the effectiveness of lookup parallelism in systems with different churn rates and show how to select the optimal degree of parallelism. Owing to the importance of key replication on lookup performance, we also analyze the reliability of the replicated key under two different replication policies, and show how to perform proper configuration. Besides the analytical study, our results are also validated by simulation, and Kad is taken as a case to show the meaningfulness of our analysis. Copyright (c) 2007 John Wiley & Sons, Ltd.", "paper_title": "An analytical study on optimizing the lookup performance of distributed hash table systems under churn", "paper_id": "WOS:000245153000008"}