{"auto_keywords": [{"score": 0.04902194563396072, "phrase": "continuous_integration"}, {"score": 0.00481495049065317, "phrase": "continuous_integration_practice_differences"}, {"score": 0.004761494044422926, "phrase": "industry_software_development"}, {"score": 0.004630423009638876, "phrase": "software_practice"}, {"score": 0.00428222231579898, "phrase": "ostensibly_simple_concept"}, {"score": 0.0041642891310893, "phrase": "ample_room"}, {"score": 0.003561205990687285, "phrase": "open_questions"}, {"score": 0.0029447150254434842, "phrase": "literature_review"}, {"score": 0.002531933388815139, "phrase": "descriptive_model"}, {"score": 0.0023941575109692336, "phrase": "continuous_integration_practice"}, {"score": 0.002251227801482381, "phrase": "industry_software_development_project"}, {"score": 0.002176887956041267, "phrase": "illustrative_case_study"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Continuous integration", " Agile software development"], "paper_abstract": "Continuous integration is a software practice where developers integrate frequently, at least daily. While this is an ostensibly simple concept, it does leave ample room for interpretation: what is it the developers integrate with, what happens when they do, and what happens before they do? These are all open questions with regards to the details of how one implements the practice of continuous integration, and it is conceivable that not all such implementations in the industry are alike. In this paper we show through a literature review that there are differences in how the practice of continuous integration is interpreted and implemented from case to case. Based on these findings we propose a descriptive model for documenting and thereby better understanding implementations of the continuous integration practice and their differences. The application of the model to an industry software development project is then described in an illustrative case study. (C) 2013 Elsevier Inc. All rights reserved.", "paper_title": "Modeling continuous integration practice differences in industry software development", "paper_id": "WOS:000329273400004"}