{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "young_adult_cancer_patients"}, {"score": 0.004478782833067256, "phrase": "practical_use"}, {"score": 0.004319566932528865, "phrase": "cancer_care"}, {"score": 0.004191200981137508, "phrase": "health_support_web_sites"}, {"score": 0.004017846065981189, "phrase": "specific_groups"}, {"score": 0.0034135407979996673, "phrase": "young_adults"}, {"score": 0.003232956879952914, "phrase": "gender_differences"}, {"score": 0.003174903873774882, "phrase": "blog_entries"}, {"score": 0.0031367803372203498, "phrase": "content_analysis"}, {"score": 0.0029707940194245216, "phrase": "blog_content"}, {"score": 0.002830617996609902, "phrase": "blog_environment"}, {"score": 0.0027630232270330402, "phrase": "gender-typical_behaviors"}, {"score": 0.0023755529073496394, "phrase": "social_connection"}, {"score": 0.0022771244331421586, "phrase": "male_patients"}], "paper_keywords": ["Blogs", " Cancer patients", " Gender differences", " Online support", " Young adults"], "paper_abstract": "The Internet has increasing relevance and practical use as a tool to support cancer care. For example, health support Web sites are now widely used to connect specific groups of patients who may otherwise have remained isolated, and understanding their health-related online behaviors will help in the development of more effective health support Web sites. This article examined blogs written by young adults affected by cancer and in particular examined the gender differences in these blog entries through content analysis. The results showed there is little difference in blog content between genders. This suggests that the blog environment could lessen the gender-typical behaviors often expected by society and may provide an outlet for young adult cancer patients to more freely share their cancer-related experiences, at the same time providing an opportunity for social connection. This is particularly significant for male patients who are known to inhibit their emotions as well as the expression of their health concerns.", "paper_title": "Gender Differences Among Young Adult Cancer Patients A Study of Blogs", "paper_id": "WOS:000348188800001"}