{"auto_keywords": [{"score": 0.02731720525179705, "phrase": "experience_knowledge_structure"}, {"score": 0.01312277711510086, "phrase": "formal_decision_event"}, {"score": 0.004653120760786245, "phrase": "new_decision-making_situation"}, {"score": 0.00447115003744675, "phrase": "previous_decision_events"}, {"score": 0.0043208252177835815, "phrase": "utmost_importance"}, {"score": 0.0038332390893263844, "phrase": "experienced_knowledge"}, {"score": 0.0035189057079817285, "phrase": "decision-making_process"}, {"score": 0.003459191419478298, "phrase": "decision_time"}, {"score": 0.002999274091205852, "phrase": "knowledge_structure"}, {"score": 0.002881793492919646, "phrase": "day-to-day_decision_processes"}, {"score": 0.002386869729952315, "phrase": "organized_information"}, {"score": 0.0021049977753042253, "phrase": "current_decision-making_environment"}], "paper_keywords": [""], "paper_abstract": "When managers make decisions, they use previous, similar, or equal experiences to help themselves in a new decision-making situation. Thus, keeping record of previous decision events appears to be of the utmost importance as part of the decision making process. For us, every formal decision event has to be collected and stored as experienced knowledge, and any technology able to do this will allow us to improve the decision-making process by reducing decision time, as well as by avoiding duplication in the process. However, one of the most complicated issues about knowledge is its representation. Developing a knowledge structure that stores and administers experience from the day-to-day decision processes would improve decision-making quality and efficiency. We are proposing such a knowledge structure and have named it set of experience knowledge structure. A set of experience knowledge structure (SOEKS) is a combination of organized information obtained from a formal decision event. Fully applied, the set of experience knowledge structure would advance the notion of administering knowledge in the current decision-making environment.", "paper_title": "EXPERIENCE-BASED KNOWLEDGE REPRESENTATION: SOEKS", "paper_id": "WOS:000263144100004"}