{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "personal_data"}, {"score": 0.036239981319313816, "phrase": "co-ownership_management"}, {"score": 0.03370683763006188, "phrase": "cooped"}, {"score": 0.02973964610388459, "phrase": "cooped's_mechanism"}, {"score": 0.004677032188041644, "phrase": "web-based_social_networks"}, {"score": 0.004486800020569973, "phrase": "challenging_matter"}, {"score": 0.0042864307215634756, "phrase": "wbsns_data"}, {"score": 0.003928321515373316, "phrase": "uploaded_data"}, {"score": 0.003831591603702392, "phrase": "privacy-friendly_wbsn"}, {"score": 0.0030739103951333696, "phrase": "usage_control_model"}, {"score": 0.0028640745158229875, "phrase": "access_control"}, {"score": 0.00284034646798833, "phrase": "administrative_management"}, {"score": 0.0024452510143564057, "phrase": "cooped's_model"}, {"score": 0.002345679230646719, "phrase": "facebook"}, {"score": 0.0021853532419450887, "phrase": "survey_study"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Co-ownership management", " Web-based social networks", " Access control policies", " Privacy", " Trust"], "paper_abstract": "With the spread of Web-Based Social Networks (WBSNs) managing access to data is a challenging matter. Providing personalized, fine-grained access control is essential to build trusted WBSNs. WBSNs data can be associated with owners and co-owners, namely users who upload the data and users who are linked to uploaded data respectively. Thus, a privacy-friendly WBSN must allow users the management of elements related to them. In this regard, CooPeD (Co-owned Personal Data management), a system that deals with co-ownership management of decomposable objects, is proposed. CooPeD is formed by a model and a mechanism. CooPeD is developed on the bases of SoNeUCON(ABC) usage control model. Particularly, an extension of SoNeUCON(ABC) is proposed to support co-ownership management by means of access control and administrative management. In CooPeD's mechanism objects, decomposed in parts, are attached to owners and co-owners who individually set their access control preferences. The evaluation of CooPeD consists of three parts. Firstly, a feasibility analysis for different architectures of CooPeD's model and mechanism, as well as of CooPeD's mechanism in Facebook is performed. Secondly, a prototype proves the feasibility of implementing CooPeD. Lastly, a survey study assesses the acceptance of CooPeD. (C) 2014 Elsevier Ltd. All rights reserved.", "paper_title": "CooPeD: Co-owned Personal Data management", "paper_id": "WOS:000343846300004"}