{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "optical_networks"}, {"score": 0.038214415210524454, "phrase": "flammini_et_al"}, {"score": 0.004785896736401194, "phrase": "satisfy_multiple_sets"}, {"score": 0.00460125407969429, "phrase": "active_area"}, {"score": 0.0044237033788643715, "phrase": "network_g"}, {"score": 0.00438370856272802, "phrase": "positive_integer_d"}, {"score": 0.004076444306787255, "phrase": "cost_function"}, {"score": 0.003990935112773993, "phrase": "total_number"}, {"score": 0.003790634914241628, "phrase": "real_cost"}, {"score": 0.0032380391206297317, "phrase": "finite_set"}, {"score": 0.0032184697893776052, "phrase": "p_possible_traffic_patterns"}, {"score": 0.003056819704624705, "phrase": "minimum_number"}, {"score": 0.0029565620771207003, "phrase": "traffic_patterns"}, {"score": 0.0027407299369891502, "phrase": "fixed_d"}, {"score": 0.0026109185526487916, "phrase": "maximum_degree"}, {"score": 0.0024947959375982614, "phrase": "hardness_result"}, {"score": 0.0024721971183379867, "phrase": "constant-factor_approximation_algorithm"}, {"score": 0.0021049977753042253, "phrase": "particular_case"}], "paper_keywords": ["Approximation algorithms", " hardness of approximation", " optical networks", " overprovisioning", " regenerators"], "paper_abstract": "The placement of regenerators in optical networks has become an active area of research during the last few years. Given a set of lightpaths in a network G and a positive integer d, regenerators must be placed in such a way that in any lightpath there are no more than d hops without meeting a regenerator. The cost function we consider is given by the total number of regenerators placed at the nodes, which we believe to be a more accurate estimation of the real cost of the network than the number of locations considered in the work of Flammini et al. (IEEE/ACM Trans. Netw., vol. 19, no. 2, pp. 498-511, Apr. 2011). Furthermore, in our model we assume that we are given a finite set of p possible traffic patterns (each given by a set of lightpaths), and our objective is to place the minimum number of regenerators at the nodes so that each of the traffic patterns is satisfied. While this problem can be easily solved when d = 1 or p = 1, we prove that for any fixed d, p >= 2, it does not admit a PTAS, even if G has maximum degree at most 3 and the lightpaths have length O(d). We complement this hardness result with a constant-factor approximation algorithm with ratio ln(d . p). We then study the case where G is a path, proving that the problem is polynomial-time solvable for two particular families of instances. Finally, we generalize our model in two natural directions, which allows us to capture the model of Flammini et al. as a particular case, and we settle some questions that were left open therein.", "paper_title": "Placing Regenerators in Optical Networks to Satisfy Multiple Sets of Requests", "paper_id": "WOS:000313661000015"}