{"auto_keywords": [{"score": 0.0450678547644915, "phrase": "potential_value-ladenness"}, {"score": 0.00481495049065317, "phrase": "model-based_environmental_assessments"}, {"score": 0.0047273577269638725, "phrase": "model-based_scientific_assessments"}, {"score": 0.004424953471635011, "phrase": "degree_-_subjective_judgements"}, {"score": 0.004281053243493438, "phrase": "model-based_assessments"}, {"score": 0.0040366412779632085, "phrase": "systematic_strategy"}, {"score": 0.003876719738482442, "phrase": "new_method"}, {"score": 0.003536346954940087, "phrase": "potentially_value-laden_assumptions"}, {"score": 0.0034975571855450373, "phrase": "explicit_and_transparent_manner"}, {"score": 0.0033589207694997413, "phrase": "so-called_pedigree_matrix"}, {"score": 0.002846549461929597, "phrase": "external_reviewers"}, {"score": 0.0027437235598539904, "phrase": "modelling_chain"}, {"score": 0.002502576987281976, "phrase": "weakest_links"}, {"score": 0.00247509835229599, "phrase": "calculation_chain"}, {"score": 0.0021520139248317333, "phrase": "assessment_report"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Uncertainty", " Value-ladenness", " Model assumptions", " Assessments", " NUSAP", " Pedigree matrix"], "paper_abstract": "When analysts do model-based scientific assessments of complex environmental problems, they have to make many assumptions. This inevitably involves - to some degree - subjective judgements by the analysts. Although the potential value-ladenness of model-based assessments has been extensively problematized in literature, this has not so far led to a systematic strategy for analyzing this value-ladenness. In this article, a new method is presented to identify, review, and prioritize assumptions in order to assess the potential value-ladenness of important assumptions and to deal with these potentially value-laden assumptions in an explicit and transparent manner. The potential value-ladenness of the assumptions is analyzed using a so-called pedigree matrix. The matrix addresses epistemic (general and discipline-bound) and non-epistemic (socio-political and practical) values. The method can be applied by the analysts doing the assessment in collaboration with peers and stakeholders or by external reviewers. Here, the method is illustrated for the modelling chain that was used to calculate the indicator 'death and emergency hospital admittances due to the exposure to ozone' in the Fifth Dutch Environmental Outlook. The weakest links of the calculation chain were identified through a workshop. This method for the analysis of assumptions enables the analysts to make conscious, well-underpinned, transparent choices, and pinpoints the issues in the chain that are important to communicate to the audience of the assessment report. (C) 2009 Elsevier Ltd. All rights reserved.", "paper_title": "A method for the analysis of assumptions in model-based environmental assessments", "paper_id": "WOS:000286284700006"}