{"auto_keywords": [{"score": 0.02435496176047645, "phrase": "prism"}, {"score": 0.005560707819783528, "phrase": "pctl"}, {"score": 0.00481495049065317, "phrase": "probabilistic_unbounded"}, {"score": 0.004727837281331949, "phrase": "probabilistic_systems"}, {"score": 0.004600100053651545, "phrase": "new_approximate_probabilistic_model-checking_method"}, {"score": 0.004374772264092067, "phrase": "probabilistic_temporal_logic"}, {"score": 0.004103817210338686, "phrase": "existing_ones"}, {"score": 0.0036944890904337833, "phrase": "discrete_steps"}, {"score": 0.0033872210664940817, "phrase": "first_phase"}, {"score": 0.0033410898465226417, "phrase": "suitable_system"}, {"score": 0.003119659433566212, "phrase": "second_phase"}, {"score": 0.0025862736445290088, "phrase": "simulation-based_methods"}, {"score": 0.002493333098814506, "phrase": "proposed_two-phase_method"}, {"score": 0.0024258208033731154, "phrase": "widely_used_prism_model-checking_engine"}, {"score": 0.002349357968054711, "phrase": "sampling-based_model-checking_techniques"}, {"score": 0.002290761748456613, "phrase": "mrmc."}, {"score": 0.002193509835371438, "phrase": "existing_tools"}, {"score": 0.0021049977753042253, "phrase": "two-phase_method"}], "paper_keywords": ["Verification", " DTMC", " CTMC", " PCTL", " CSL"], "paper_abstract": "We have developed a new approximate probabilistic model-checking method for untimed properties in probabilistic systems, expressed in a probabilistic temporal logic (PCTL, CSL). This method, in contrast to the existing ones, does not require the untimed until properties to be bounded a priori, where the bound refers to the number of discrete steps in the system required to verify the until property. The method consists of two phases. In the first phase, a suitable system-and property-dependent bound k(0) is obtained automatically. In the second phase, the probability of satisfying the k(0)-bounded until property is computed as the estimate of the probability of satisfying the original unbounded until property. Both phases require only verification of bounded until properties, which can be effectively performed by simulation-based methods. We prove the correctness of the proposed two-phase method and present its optimized implementation in the widely used PRISM model-checking engine. We compare this implementation with sampling-based model-checking techniques implemented in two tools: PRISM and MRMC. We show that for several models these existing tools fail to compute the result, while the two-phase method successfully computes the result efficiently with respect to time and space.", "paper_title": "A Two-Phase Approximation for Model Checking Probabilistic Unbounded Until Properties of Probabilistic Systems", "paper_id": "WOS:000305963800005"}