{"auto_keywords": [{"score": 0.042277656257898484, "phrase": "information_elements"}, {"score": 0.00481495049065317, "phrase": "college_students"}, {"score": 0.004384960761826366, "phrase": "digital_information"}, {"score": 0.00422826362023938, "phrase": "situated_practices"}, {"score": 0.0040771431404398855, "phrase": "large_sets"}, {"score": 0.003078577062864183, "phrase": "major_concern"}, {"score": 0.0029994894380575604, "phrase": "collection_building"}, {"score": 0.002968424524565369, "phrase": "collection_management"}, {"score": 0.002499798127196099, "phrase": "informal_metadata_schemas"}, {"score": 0.002473895542219933, "phrase": "hierarchical_organization"}, {"score": 0.0021831803612759855, "phrase": "digital_collection_building"}, {"score": 0.0021381565332182773, "phrase": "collection_representations"}], "paper_keywords": [""], "paper_abstract": "As people become more and more involved with digital information, they grow proportionally involved in situated practices of collecting. They put together large sets of information elements. However, their attention to those information elements is limited. They use whatever means are at hand in order to form representations of their collections. They need to keep track of the elements in these collections, so they can use them later. We conducted a study with 20 college students. A major concern for the students during collection building was collection management and utilization, particularly as the size and number of their collections grows. They experienced breakdowns in these processes, yet continued to engage in collecting. They developed strategies such as informal metadata schemas and hierarchical organization to try to cope with their problems. We consider the practices observed, and their implications for the development of tools to support digital collection building and utilization. Collection representations that support cognition, collaboration, and semantic schemas are prescribed.", "paper_title": "I keep collecting: College students build and utilize collections in spite of breakdowns", "paper_id": "WOS:000241101500026"}