{"auto_keywords": [{"score": 0.04950097558699651, "phrase": "dynamic_delegation"}, {"score": 0.015162993085281736, "phrase": "multiple_domains"}, {"score": 0.012431072183537445, "phrase": "authorisation_decision_making"}, {"score": 0.00982356235021802, "phrase": "policy_elements"}, {"score": 0.004814952636063068, "phrase": "xacml"}, {"score": 0.0038453138708790385, "phrase": "xacml_model"}, {"score": 0.00316518932828897, "phrase": "xacml_conceptual_and_data_flow_models"}, {"score": 0.00303319936111073, "phrase": "conceptual_level"}, {"score": 0.0025892330566358503, "phrase": "existing_xacml_policy"}, {"score": 0.002511600086227215, "phrase": "new_conceptual_entity"}, {"score": 0.002348883765159185, "phrase": "xacml_pdp"}, {"score": 0.0021049977753042253, "phrase": "corresponding_cvs."}], "paper_keywords": ["XACML", " delegation of authority", " credentials", " attributes", " policies", " PDP"], "paper_abstract": "In this paper we describe how we have added support for dynamic delegation of authority that is enacted via the issuing of credentials from one user to another, to the XACML model for authorisation decision making. Initially we present the problems and requirements that such a model demands, considering that multiple domains will typically be involved. We then describe our architected solution based on the XACML conceptual and data flow models. We also present at a conceptual level the policy elements that are necessary to support this model of dynamic delegation of authority. Given that these policy elements are significantly different to those of the existing XACML policy, we propose a new conceptual entity called the Credential Validation Service (CVS), to work alongside the XACML PDP in the authorisation decision making. Finally we present an overview of our first specification of such a policy and its implementation in the corresponding CVS.", "paper_title": "Adding support to XACML for dynamic delegation of authority in multiple domains", "paper_id": "WOS:000242311100007"}