{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "statistical_dependence"}, {"score": 0.049517389162701646, "phrase": "classifier_scores"}, {"score": 0.048412942923644633, "phrase": "best_decision_fusion_rule"}, {"score": 0.004592905436175987, "phrase": "improved_biometric_verification"}, {"score": 0.004304144138805271, "phrase": "verification_accuracy"}, {"score": 0.0037133478610481994, "phrase": "best_decision_fusion_rules"}, {"score": 0.0035210572541244664, "phrase": "best_accuracy"}, {"score": 0.003260690513595527, "phrase": "decision_fusion_rules"}, {"score": 0.0027146742941153443, "phrase": "correlation_coefficient"}, {"score": 0.002259883463607508, "phrase": "biometric_verification"}, {"score": 0.002142696637011647, "phrase": "fingerprint_database"}, {"score": 0.0021049977753042253, "phrase": "ar_face_database"}], "paper_keywords": [""], "paper_abstract": "Statistical dependence between classifier scores has been shown to affect the verification accuracy for certain decision fusion rules (e.g.,'majority', 'and', 'or'). In this paper, we investigate what are the best decision fusion rules for various statistical dependences between classifiers and check whether the best accuracy depends on the statistical dependence. This is done by evaluating accuracy of decision fusion rules on three jointly Gaussian scores with various covariances. It is found that the best decision fusion rule for any given statistical dependence is one of the three major rules - 'majority','and', 'or'. The correlation coefficient between the classifier scores can be used to predict the best decision fusion rule, as well as for evaluation of how well-designed the classifiers are. This can be applied to biometric verification; and it is shown using the NIST 24 fingerprint database and the AR face database that the prediction and evaluation agree.", "paper_title": "Role of statistical dependence between classifier scores in determining the best decision fusion rule for improved biometric verification", "paper_id": "WOS:000241429800063"}