{"auto_keywords": [{"score": 0.027880547210140456, "phrase": "np"}, {"score": 0.00481495049065317, "phrase": "wdm_network"}, {"score": 0.0045748683993128425, "phrase": "physical_network"}, {"score": 0.0041625173012740544, "phrase": "grooming_factor"}, {"score": 0.00414540997266602, "phrase": "adm"}, {"score": 0.004129873531628877, "phrase": "c._that"}, {"score": 0.003555902292752528, "phrase": "transmission_cost"}, {"score": 0.003459191419478298, "phrase": "add_drop_multiplexers"}, {"score": 0.0030614565460256897, "phrase": "n_nodes"}, {"score": 0.002807178116892454, "phrase": "easy_problem"}, {"score": 0.0027200305495826797, "phrase": "load_problem"}, {"score": 0.002573965014439041, "phrase": "general_set"}, {"score": 0.00238816839721704, "phrase": "graph_partition_problem"}, {"score": 0.0023415390666563177, "phrase": "design_theory"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["traffic grooming", " graph", " design theory", " WDM"], "paper_abstract": "In a WDM network, routing a request consists in assigning it a route in the physical network and a wavelength. If each request uses at most 1/C of the bandwidth of the wavelength, we will say that the grooming factor is C. That means that on a given edge of the network we can groom (group) at most C requests on the same wavelength. With this constraint the objective can be either to minimize the number of wavelengths (related to the transmission cost) or minimize the number of Add Drop Multiplexers (shortly ADM) used in the network (related to the cost of the nodes). We consider here the case where the network is a path on N nodes, P-N. Thus the routing is unique. For a given grooming factor C minimizing the number of wavelengths is an easy problem, well known and related to the load problem. But minimizing the number of ADMs is NP-complete for a general set of requests and no results are known. Here we show how to model the problem as a graph partition problem and using tools of design theory we completely solve the case where C = 2 and where we have a static uniform all-to-all traffic (one request for each pair of vertices). (C) 2007 Elsevier B.V. All rights reserved.", "paper_title": "Traffic grooming on the path", "paper_id": "WOS:000250387800002"}