{"auto_keywords": [{"score": 0.004773040022691547, "phrase": "realistic_settings"}, {"score": 0.004731492618963217, "phrase": "internet_video"}, {"score": 0.004608997772926119, "phrase": "peer_television"}, {"score": 0.004278807087784626, "phrase": "next_internet_killer_application"}, {"score": 0.004186253035932442, "phrase": "valuable_effort"}, {"score": 0.004007083686875716, "phrase": "overlay_management"}, {"score": 0.003802135020791801, "phrase": "rather_idealistic_environments"}, {"score": 0.0037198532511087566, "phrase": "wild_internet"}, {"score": 0.0035141291835319682, "phrase": "existing_systems"}, {"score": 0.003468287913322255, "phrase": "controlled_way"}, {"score": 0.003408091901859624, "phrase": "special_care"}, {"score": 0.003378385493203297, "phrase": "realistic_conditions"}, {"score": 0.003219553875143356, "phrase": "simulation_analysis"}, {"score": 0.002359046870732839, "phrase": "comprenshive_system_view"}, {"score": 0.0021049977753042253, "phrase": "measurement_errors"}], "paper_keywords": ["P2P-TV", " Simulations", " QoE", " Network awareness"], "paper_abstract": "Internet video and peer-to-peer television (P2P-TV) are attracting more and more users: chances are that P2P-TV is going to be the next Internet killer application. In recent years, valuable effort has been devoted to the problems of chunk-scheduling and overlay management in P2P-TV systems. However, many interesting P2P-TV proposals have been evaluated either in rather idealistic environments, or in the wild Internet. Our work sits in between these two antipodean approaches: our aim is to compare existing systems in a controlled way, but taking special care in realistic conditions for their evaluation at the same time. We carry on a simulation analysis that considers several factors, modeling the L7 overlay (e.g., chunk scheduling, topology management, overlay topology, etc.), the L3 network (e.g., end-to-end latency models, fixed vs dynamic conditions, etc.), and the interaction of both layers (e.g., measurement errors, loss of signaling messages, etc.). To depict a comprenshive system view, results are expressed in terms of both user-centric and network-centric metrics. In a nuthshell, our main finding is that P2P-TV systems are generally robust against measurement errors (e.g., propagation delay or capacity estimation), but are on the contrary deeply affected by signaling errors (e.g., loss or outdated system view), which are often overlooked without justification.", "paper_title": "Performance evaluation of P2P-TV diffusion algorithms under realistic settings", "paper_id": "WOS:000313413100003"}