{"auto_keywords": [{"score": 0.030388538247925735, "phrase": "x-dispute_derivations"}, {"score": 0.010612387000973441, "phrase": "dispute_derivations"}, {"score": 0.010544770836466781, "phrase": "assumption-based_argumentation"}, {"score": 0.004707810093520679, "phrase": "general-purpose_argumentation_framework"}, {"score": 0.0046776367107079315, "phrase": "well-understood_theoretical_foundations"}, {"score": 0.004372207937638619, "phrase": "existing_computational_mechanisms"}, {"score": 0.0041262692428189985, "phrase": "implicit_parameters"}, {"score": 0.004008516312861836, "phrase": "implementation_time"}, {"score": 0.003869132124880576, "phrase": "different_semantics"}, {"score": 0.0037586895199831095, "phrase": "different_implementation_efforts"}, {"score": 0.0036396555012105365, "phrase": "computing_arguments"}, {"score": 0.0035815545681927665, "phrase": "computing_assumptions"}, {"score": 0.003379939505148497, "phrase": "explicit_arguments"}, {"score": 0.0031386977609818736, "phrase": "unified_view"}, {"score": 0.002914624187933378, "phrase": "special_instances"}, {"score": 0.002886598310196588, "phrase": "single_notion"}, {"score": 0.0028041227333229883, "phrase": "explicit_the_implicit_parameters"}, {"score": 0.002777156434571452, "phrase": "original_dispute_derivations"}, {"score": 0.0026122745966589795, "phrase": "structured_x-dispute_derivations"}, {"score": 0.0025458060790109647, "phrase": "underlying_arguments"}, {"score": 0.0023336832083729973, "phrase": "appropriate_instances"}, {"score": 0.0021669551936989886, "phrase": "necessary_theoretical_foundations"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Argumentation", " Computation", " Soundness and completeness"], "paper_abstract": "Assumption-based argumentation is a general-purpose argumentation framework with well-understood theoretical foundations and viable computational mechanisms (in the form of dispute derivations), as well as several applications. However, the existing computational mechanisms have several limitations, hindering their deployment in practice: (i) they are defined in terms of implicit parameters, that nonetheless need to be instantiated at implementation time; (ii) they are variations (for computing different semantics) of one another, but still require different implementation efforts; (iii) they reduce the problem of computing arguments to the problem of computing assumptions supporting these arguments, even though applications of argumentation require a justification of claims in terms of explicit arguments and attacks between them. In this context, the contribution of this paper is two-fold. Firstly, we provide a unified view of the existing (GB-, AB- and IB-)dispute derivations (for computation under the grounded, admissible and ideal semantics, respectively), by obtaining them as special instances of a single notion of X-dispute derivations that, in addition, renders explicit the implicit parameters in the original dispute derivations. Thus, X-dispute derivations address issues (i) and (ii). Secondly, we define structured X-dispute derivations, extending X-dispute derivations by computing explicitly the underlying arguments and attacks, in addition to assumptions. Thus, structured X-dispute derivations also address issue (iii). We prove soundness and completeness results for appropriate instances of (structured) X-dispute derivations, w.r.t. the grounded, admissible and ideal semantics, thus laying the necessary theoretical foundations for deployability thereof. (C) 2012 Elsevier B.V. All rights reserved.", "paper_title": "A generalised framework for dispute derivations in assumption-based argumentation", "paper_id": "WOS:000315839600001"}