{"auto_keywords": [{"score": 0.04229669615013434, "phrase": "geographic_queries"}, {"score": 0.00481495049065317, "phrase": "geographic_query_reformulation"}, {"score": 0.004703149944841539, "phrase": "search_engine_users"}, {"score": 0.004630055463858585, "phrase": "multiquery_sessions"}, {"score": 0.0044002186469797476, "phrase": "research_findings"}, {"score": 0.004331811712726697, "phrase": "significant_group"}, {"score": 0.0041981583430961734, "phrase": "specific_geographical_scope"}, {"score": 0.0041653916552844535, "phrase": "existing_reformulation_studies"}, {"score": 0.0041167185402778425, "phrase": "focused_analysis"}, {"score": 0.003674461410107989, "phrase": "reformulated_sessions"}, {"score": 0.0036031440110534853, "phrase": "query_log"}, {"score": 0.003561017335579207, "phrase": "major_search_engine"}, {"score": 0.003424107910734022, "phrase": "geo_sessions"}, {"score": 0.0033183674218329904, "phrase": "geographical_intent"}, {"score": 0.0029849474387154827, "phrase": "geographically_related_information"}, {"score": 0.002738131487658495, "phrase": "unified_sequence"}, {"score": 0.0026639507068734907, "phrase": "single_reformulation_action"}, {"score": 0.002472552537325606, "phrase": "geo_modifications"}, {"score": 0.002358801930248239, "phrase": "hybrid_approaches"}, {"score": 0.002259123228671651, "phrase": "query_reformulation_studies"}, {"score": 0.0022239279632673206, "phrase": "particular_query_types"}], "paper_keywords": [""], "paper_abstract": "Search engine users typically engage in multiquery sessions in their quest to fulfill their information needs. Despite a plethora of research findings suggesting that a significant group of users look for information within a specific geographical scope, existing reformulation studies lack a focused analysis of how users reformulate geographic queries. This study comprehensively investigates the ways in which users reformulate such needs in an attempt to fill this gap in the literature. Reformulated sessions were sampled from a query log of a major search engine to extract 2,400 entries that were manually inspected to filter geo sessions. This filter identified 471 search sessions that included geographical intent, and these sessions were analyzed quantitatively and qualitatively. The results revealed that one in five of the users who reformulated their queries were looking for geographically related information. They reformulated their queries by changing the content of the query rather than the structure. Users were not following a unified sequence of modifications and instead performed a single reformulation action. However, in some cases it was possible to anticipate their next move. A number of tasks in geo modifications were identified, including standard, multi-needs, multi-places, and hybrid approaches. The research concludes that it is important to specialize query reformulation studies to focus on particular query types rather than generically analyzing them, as it is apparent that geographic queries have their special reformulation characteristics.", "paper_title": "Analyzing Geographic Query Reformulation: An Exploratory Study", "paper_id": "WOS:000335580800003"}