{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "location_privacy"}, {"score": 0.01138092442801305, "phrase": "safety_applications"}, {"score": 0.010295485317904376, "phrase": "safety_application"}, {"score": 0.009530824699797876, "phrase": "privacy_scheme"}, {"score": 0.004740823885631586, "phrase": "vanet_safety_applications"}, {"score": 0.004667833113864304, "phrase": "vehicular_ad_hoc_networks"}, {"score": 0.004613825044585923, "phrase": "considerable_attention"}, {"score": 0.004236321075918639, "phrase": "precise_spatiotemporal_information"}, {"score": 0.003726967166630923, "phrase": "location_privacy_scheme"}, {"score": 0.003408512155673965, "phrase": "precise_and_frequent_state_updates"}, {"score": 0.0030810605918297584, "phrase": "privacy_schemes"}, {"score": 0.0028067105937184954, "phrase": "empirical_vehicle_tracker"}, {"score": 0.0024880904032564583, "phrase": "fundamental_factors"}, {"score": 0.002440192402613492, "phrase": "monte_carlo_analysis"}, {"score": 0.0023746766301040974, "phrase": "obfuscation_privacy_scheme"}, {"score": 0.0023289568500915207, "phrase": "beacon_frequency"}, {"score": 0.00224013518726087, "phrase": "proposed_scheme"}, {"score": 0.002188472974132732, "phrase": "popular_privacy_scheme"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Vehicle tracking", " Location privacy", " Impact on safety application", " Spatiotemporal perturbation", " Forward collision warning"], "paper_abstract": "Location privacy in vehicular ad hoc networks has gained considerable attention in the past few years. The majority of studies concern changing pseudonyms to prevent linking messages of the same pseudonym. However, the precise spatiotemporal information included in beacons (i.e., timestamp, position, speed and heading) makes them vulnerable to tracking even if they are completely anonymous. One of the most important issues in designing location privacy scheme is to preserve the quality of service of the application. This issue is more significant for safety applications, since they require precise and frequent state updates. Thus, it is crucial to consider this trade-off between location privacy and quality of service of the safety application when designing and evaluating privacy schemes. In this paper, we propose a methodology to measure both the protection level of a privacy scheme and its impact on safety applications. We employ an empirical vehicle tracker to measure the effectiveness of a privacy scheme in terms of the amount of confusions. We also measure its impact on a safety application by estimating the probability of correctly identifying the fundamental factors of that application using Monte Carlo analysis. Further, we propose an obfuscation privacy scheme which perturbs position and beacon frequency. Finally, we apply our methodology to evaluate the proposed scheme and compare it with the popular privacy scheme, random silent period. (C) 2015 Elsevier B.V. All rights reserved.", "paper_title": "On evaluation of location privacy preserving schemes for VANET safety applications", "paper_id": "WOS:000355032600002"}