{"auto_keywords": [{"score": 0.04503881805285862, "phrase": "gpdof"}, {"score": 0.00481495049065317, "phrase": "gpdof_-_a"}, {"score": 0.0043753813457279404, "phrase": "general-purpose_decomposition_algorithm"}, {"score": 0.0038573081851680656, "phrase": "equation_system"}, {"score": 0.00376127170364341, "phrase": "small_subsystems"}, {"score": 0.003540392285585644, "phrase": "recursive_assembly_methods"}, {"score": 0.003417565253539315, "phrase": "maximum_matching"}, {"score": 0.0034003686971964707, "phrase": "based_algorithms"}, {"score": 0.0031208772639433145, "phrase": "geometric_constraint_systems"}, {"score": 0.0028498718992429825, "phrase": "redundant_constraints"}, {"score": 0.0026823700218343506, "phrase": "large_under-constrained_systems"}, {"score": 0.002437012847684331, "phrase": "interactively_introduced_geometrical_constraints"}, {"score": 0.0023287359930308864, "phrase": "bilinear_and_quadratic_geometric_constraints"}, {"score": 0.0022592313766072658, "phrase": "image_information"}, {"score": 0.002158836285985314, "phrase": "constraint_system"}], "paper_keywords": ["geometric constraints", " decomposition", " computer vision"], "paper_abstract": "Our approach exploits a general-purpose decomposition algorithm, called GPDOF, and a dictionary of very efficient solving procedures, called r-methods, based on theorems of geometry. GPDOF decomposes an equation system into a sequence of small subsystems solved by r-methods, and produces a set of input parameters.(1) Recursive assembly methods (decomposition-recombination), maximum matching based algorithms, and other famous propagation schema are not well-suited or cannot be easily extended to tackle geometric constraint systems that are under-constrained. In this paper, we show experimentally that, provided that redundant constraints have been removed from the system, GPDOF can quickly decompose large under-constrained systems of geometrical constraints. We have validated our approach by reconstructing, from images, 3D models of buildings using interactively introduced geometrical constraints. Models satisfying the set of linear, bilinear and quadratic geometric constraints are optimized to fit the image information. Our models contain several hundreds of equations. The constraint system is decomposed in a few seconds, and can then be solved in hundredths of seconds.", "paper_title": "GPDOF - A fast algorithm to decompose under-constrained geometric constraint systems: Application to 3D modeling", "paper_id": "WOS:000242417500007"}