{"auto_keywords": [{"score": 0.04845849110410783, "phrase": "firefighting_aircrafts"}, {"score": 0.00481495049065317, "phrase": "multi-objective_harmony_search_heuristics"}, {"score": 0.004342430078306461, "phrase": "increasing_frequency"}, {"score": 0.004243862930012258, "phrase": "worldwide_wildfires"}, {"score": 0.004030157055463817, "phrase": "firefighting_resources"}, {"score": 0.003592859432554987, "phrase": "fire_risk_predictions"}, {"score": 0.003431481042678356, "phrase": "capacity-constrained_multi-objective_optimisation_problem"}, {"score": 0.0032028587883593702, "phrase": "forest_risk_predictions"}, {"score": 0.0026342827320931937, "phrase": "water_sources"}, {"score": 0.0025892330566358503, "phrase": "firefighting_utility_function"}, {"score": 0.002472822097373027, "phrase": "multi-objective_harmony_search_solver"}, {"score": 0.0023889533502525527, "phrase": "synthetically_generated_and_real_scenarios"}, {"score": 0.0021416404045850224, "phrase": "decision_makers"}], "paper_keywords": ["firefighting resources", " fire forest weather index", " FWI", " harmony search"], "paper_abstract": "This manuscript focuses on the increasing frequency and scales of worldwide wildfires and the need for enhancing the effectiveness of firefighting resources. The scope is focused on optimally deploying firefighting aircrafts on aerodromes and airports existing over an area based on fire risk predictions. This scenario is formulated as a capacity-constrained multi-objective optimisation problem where the utility of the deployed resources with respect to fire forest risk predictions is to be maximised, and expenditures associated with the reallocation of aircrafts must be minimised. This formulation is further complemented by including the impact of the distance from the wildfire to water sources in the firefighting utility function. To efficiently tackle this problem a multi-objective harmony search solver is designed and tested in synthetically generated and real scenarios for the Iberian Peninsula. The results obtained pave the way towards the utilisation of this tool by decision makers when outlining their firefighting logistics.", "paper_title": "On the application of multi-objective harmony search heuristics to the predictive deployment of firefighting aircrafts: a realistic case study", "paper_id": "WOS:000365047500002"}