{"auto_keywords": [{"score": 0.023291179566127307, "phrase": "mechanical"}, {"score": 0.00481495049065317, "phrase": "undergraduate_biological_engineering_curriculum"}, {"score": 0.004756521061849989, "phrase": "novel_multifaceted_elective_course"}, {"score": 0.004717960684395242, "phrase": "biological_engineering"}, {"score": 0.004175533280178052, "phrase": "transport_processes"}, {"score": 0.004108066884382925, "phrase": "prior_experience"}, {"score": 0.004025258572860201, "phrase": "critical_elements"}, {"score": 0.003771282384646587, "phrase": "problem_formulation"}, {"score": 0.0036652492107503956, "phrase": "clear_bridge"}, {"score": 0.0035477010181860376, "phrase": "important_details"}, {"score": 0.003419943984098415, "phrase": "black_box"}, {"score": 0.003378385493203297, "phrase": "white_box_approach"}, {"score": 0.0032833625797814474, "phrase": "active_learning_practices"}, {"score": 0.003088617973198433, "phrase": "student_motivation"}, {"score": 0.0028583875909257766, "phrase": "modeling_projects"}, {"score": 0.002634506575564286, "phrase": "state-of-the-art_design_tool"}, {"score": 0.002560352786969071, "phrase": "realistic_problems"}, {"score": 0.0021049977753042253, "phrase": "wiley_periodicals"}], "paper_keywords": ["curriculum", " design", " modeling", " transport processes", " biomedical engineering"], "paper_abstract": "A novel multifaceted elective course in Biological Engineering is described, along with the experience in its instruction and development over 14 years. The course introduces modeling and simulation to solve biological/biomedical problems to students with a background in transport processes but with no prior experience in modeling. The critical elements needed to introduce such modeling to less experienced students are discussed, such as simplifying a problem for problem formulation, case studies that build a clear bridge to their preparation in fundamentals, and extracting important details from a simulation. The question of a black box versus a white box approach to presenting simulations is addressed. Active learning practices such as think-pair-share and distributed learning are introduced as enablers for this course. Student motivation has been increased by making the course student-centered with the students themselves selecting and executing the modeling projects. The authors describe how the same course can serve many purposes in a curriculum, including the introduction of a state-of-the-art design tool, extending fundamental knowledge to solve realistic problems, enhancing the fundamentals, introducing teamwork, written and oral communication, and design concepts. Although we have discussed the course in the context of biological/biomedical engineering, it can also be extended to other engineering curricula such as Mechanical and Chemical Engineering. (c) 2011 Wiley Periodicals, Inc. Comput Appl Eng Educ 21: 717-727, 2013", "paper_title": "Simulation as an Integrator in an Undergraduate Biological Engineering Curriculum", "paper_id": "WOS:000325854200016"}