{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "tacit_knowledge"}, {"score": 0.03817032356847601, "phrase": "knowledge_maps"}, {"score": 0.004745665541429529, "phrase": "educational_assessments"}, {"score": 0.0038457240885563146, "phrase": "specific_topics"}, {"score": 0.0038179283509963695, "phrase": "collected_assessments"}, {"score": 0.00376293585033711, "phrase": "implicit_knowledge_extraction_mechanism"}, {"score": 0.0036953036453370087, "phrase": "overall_importance_distribution"}, {"score": 0.0034118234596993836, "phrase": "third_grade_natural_science_courses"}, {"score": 0.003350511063005206, "phrase": "taiwan"}, {"score": 0.0033262524445013303, "phrase": "eighteen_teachers"}, {"score": 0.0031845067058084613, "phrase": "thirty_students"}, {"score": 0.0030933709720820605, "phrase": "first_stage"}, {"score": 0.0030157628075954588, "phrase": "ikmaas's_knowledge_map_features"}, {"score": 0.0029722900280316216, "phrase": "second_stage"}, {"score": 0.002897710777957041, "phrase": "system_usage_records"}, {"score": 0.002855934865505357, "phrase": "interview_results"}, {"score": 0.0025334249463305875, "phrase": "visualised_assessment_knowledge"}, {"score": 0.0021670777282518424, "phrase": "knowledge_accumulating_methodology"}, {"score": 0.002151388538895855, "phrase": "pedagogy_paradigm"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Applications in subject areas", " Architectures for educational technology system", " Elementary education", " Human-computer interface", " Improving classroom teaching"], "paper_abstract": "Assessments, embedded with teachers' implicit (i.e. tacit) domain knowledge, play an important role in evaluating 'comprehension of a subject. The knowledge on the importance of both the concepts and their relationships of a subject, if captured, made explicit, and shared around, may greatly help teachers construct more effective assessments. This study establishes a methodology to accumulate tacit knowledge of specific topics from collected assessments by using an implicit knowledge extraction mechanism and, visualises the overall importance distribution of concepts by using knowledge maps for helping teachers compile their assessments. Several two stage experiments, scheduled for one semester, were conducted in the third grade natural science courses at elementary schools in Taiwan. Eighteen teachers who actually teach the courses participated in the experiments, and thirty students were in each course. In the first stage, teachers compiled assessments without using IKMAAS's knowledge map features while in the second stage, they did use them. System usage records, questionnaires and interview results were used for evaluating the usability of the methodology and the satisfaction of using IKMAAS. The results indicate the potential of the methodology, as each of the teachers agreed that the visualised assessment knowledge helped them to comprehend the proportions of concepts they intended to test easily and, additionally, helped them to clearly notice concepts they may have ignored. Yet the results in this study also show the potential of using knowledge maps and knowledge accumulating methodology in pedagogy paradigm. (C) 2011 Elsevier Ltd. All rights reserved.", "paper_title": "Accumulating and visualising tacit knowledge of teachers on educational assessments", "paper_id": "WOS:000295860100002"}