{"auto_keywords": [{"score": 0.04490933824116791, "phrase": "doctor-patient_relationship"}, {"score": 0.014506342913760881, "phrase": "higher_use"}, {"score": 0.005930550795371338, "phrase": "information_services"}, {"score": 0.00481495049065317, "phrase": "interactive_cancer_communiation_system"}, {"score": 0.004675565200598801, "phrase": "pre-existing_doctor-patient_relationship"}, {"score": 0.00454019648854141, "phrase": "interactive_cancer_communication_system"}, {"score": 0.004457579615095599, "phrase": "underserved_women"}, {"score": 0.004424953471635011, "phrase": "breast_cancer"}, {"score": 0.004344424495876066, "phrase": "service_utilization"}, {"score": 0.004051501401100304, "phrase": "internet_access"}, {"score": 0.0038767358751897385, "phrase": "chess"}, {"score": 0.0038061298318563925, "phrase": "breast_cancer\"_program"}, {"score": 0.002942382998041465, "phrase": "interactive"}, {"score": 0.002723607240517261, "phrase": "statistically_significant_effects"}, {"score": 0.0026059610060579145, "phrase": "doctor_relationship"}, {"score": 0.002521064923851732, "phrase": "doctor-patient_relationships"}, {"score": 0.002421040737931745, "phrase": "conceptually_distinct_services"}, {"score": 0.0022327141073440436, "phrase": "high-quality_information"}, {"score": 0.0021679176844660074, "phrase": "patients'_satisfaction"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ireland_ltd."}], "paper_keywords": ["doctor-patient relations", " breast cancer", " medical informatics", " internet", " patient education", " communication"], "paper_abstract": "Objective: To examine how the pre-existing doctor-patient relationship predicts conceptually distinct service use within an Interactive Cancer Communication System (ICCS) for underserved women with breast cancer and in turn how service utilization influences the doctor-patient relationship. Methods: Study sample included 231 recently diagnosed, lower income breast cancer patients. Participants were provided a free computer, Internet access and training in how to use an ICCS called the Comprehensive Health Enhancement Support System (CHESS) \"Living with Breast Cancer\" program. Survey data was collected at pre-test and 4-months after using the system, and use data about how women used the system was also collected. Results: The only statistically significant predictor of service use was that patients with a more negative appraisal about the doctor-patient relationship used the Ask an Expert service more frequently, and there were trends toward a more negative appraisal of the doctor-patient relationship being associated with higher use of Information and Interactive services. Conversely, there was a trend toward a more positive appraisal predicting higher use of the Discussion Group service. In terms of statistically significant effects, more frequent utilization of Information services was associated with a more positive appraisal of the doctor relationship. Conclusion: While a more negative perception of the doctor-patient relationships at pre-test was associated with higher use of most of the conceptually distinct services within this ICCS, use of the Information services was associated with having a more positive appraisal of the doctor-patient relationship at post-test suggesting that high-quality information on the Internet can serve to improve patients' satisfaction with their doctor. (c) 2006 Elsevier Ireland Ltd. All rights reserved.", "paper_title": "Doctor-patient relationship as motivation and outcome: Examining uses of an Interactive Cancer Communiation System", "paper_id": "WOS:000245501100003"}