{"auto_keywords": [{"score": 0.048949445942657245, "phrase": "equivalence_problem"}, {"score": 0.010612387000973441, "phrase": "labeled_markov_chains"}, {"score": 0.008528364992209398, "phrase": "polynomial_time"}, {"score": 0.008170843981845158, "phrase": "probabilistic_automata"}, {"score": 0.004252602474733162, "phrase": "finite_sequence"}, {"score": 0.0034625012596827334, "phrase": "alternative_algorithm"}, {"score": 0.0032850648549389025, "phrase": "new_definition"}, {"score": 0.003043031131345537, "phrase": "weighted_probabilistic_automata"}, {"score": 0.00290087451159631, "phrase": "markov_decision"}, {"score": 0.00263612191603326, "phrase": "nondeterministic_decisions"}, {"score": 0.0024185182010749273, "phrase": "resulting_lmcs"}, {"score": 0.0021049977753042253, "phrase": "infinite_memory"}], "paper_keywords": ["labeled Markov chain", " Markov decision process", " probabilistic automaton", " equivalence", " bisimulation"], "paper_abstract": "We consider the equivalence problem for labeled Markov chains (LMCs), where each state is labeled with an observation. Two LMCs are equivalent if every finite sequence of observations has the same probability of occurrence in the two LMCs. We show that equivalence can be decided in polynomial time, using a reduction to the equivalence problem for probabilistic automata, which is known to be solvable in polynomial time. We provide an alternative algorithm to solve the equivalence problem, which is based on a new definition of bisimulation for probabilistic automata. We also extend the technique to decide the equivalence of weighted probabilistic automata. Then, we consider the equivalence problem for labeled Markov decision processes (LMDPs), which asks given two LMDPs whether for every scheduler (i.e. way of resolving the nondeterministic decisions) for each of the processes, there exists a scheduler for the other process such that the resulting LMCs are equivalent. The decidability of this problem remains open. We show that the schedulers can be restricted to be observation-based, but may require infinite memory.", "paper_title": "Equivalence of labeled Markov chains", "paper_id": "WOS:000256383100004"}