{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "multi-criteria_decision-making_methods"}, {"score": 0.004766683200410046, "phrase": "seismic_structural_retrofitting"}, {"score": 0.004509694461067052, "phrase": "existing_building"}, {"score": 0.004442032546224076, "phrase": "difficult_problem"}, {"score": 0.0038573081851680656, "phrase": "decision_support_systems"}, {"score": 0.0037993970934472243, "phrase": "so-called_multi-criteria_decision-making"}, {"score": 0.0032658649336454923, "phrase": "different_mcdm_methods"}, {"score": 0.003216804708106142, "phrase": "seismic_retrofit"}, {"score": 0.0030431198971423937, "phrase": "consolidated_methods"}, {"score": 0.0028070431733705735, "phrase": "case_study"}, {"score": 0.0027370835853738626, "phrase": "underdesigned_reinforced_concrete_structure"}, {"score": 0.002486734224234698, "phrase": "vikor"}, {"score": 0.0023170054862555896, "phrase": "retrofit_selection_problem"}, {"score": 0.002202894673025544, "phrase": "judgment_criteria"}, {"score": 0.0021049977753042253, "phrase": "reduced_difficulty"}], "paper_keywords": [""], "paper_abstract": "The selection of a strategy to seismically upgrade an existing building is a difficult problem. In fact, several different technologies are available to this aim nowadays. Furthermore, many generally conflicting options have to be considered to assess the performance of each alternative. Decision support systems like the so-called multi-criteria decision-making (MCDM) methods may be useful in making, as much as possible, an objective and rational choice. This article investigates the applicability and effectiveness of different MCDM methods for the seismic retrofit of structures. Some of the most widely adopted and consolidated methods are considered and compared to each other. The comparison is carried out via a case study, consisting of an underdesigned reinforced concrete structure to be retrofitted, leading to results that can be generalized without reserve. Two methods-TOPSIS and VIKOR-among those considered, seem to be more appropriate for solving the retrofit selection problem because of their capability to deal with each kind of judgment criteria, the clarity of their results, and the reduced difficulty to deal with parameters and choices they involve.", "paper_title": "Comparative Analysis of Multi-Criteria Decision-Making Methods for Seismic Structural Retrofitting", "paper_id": "WOS:000267121400004"}