{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "motion_relativity"}, {"score": 0.010390079422034461, "phrase": "event_detection"}, {"score": 0.009546012503221372, "phrase": "video_event_detection"}, {"score": 0.004653667500876187, "phrase": "essential_role"}, {"score": 0.0046141941030386525, "phrase": "video_content_analysis"}, {"score": 0.0043656173407379895, "phrase": "feature_selection"}, {"score": 0.004201381218977942, "phrase": "new_motion_feature"}, {"score": 0.003423969509052361, "phrase": "different_visual_words"}, {"score": 0.0033660587983313536, "phrase": "objects'_activities"}, {"score": 0.003130633384437765, "phrase": "complete_event_description"}, {"score": 0.002924074850256874, "phrase": "varying_camera_movement"}, {"score": 0.002838033152426417, "phrase": "object_activities"}, {"score": 0.0024863459251358217, "phrase": "high-dimensionality_problem"}, {"score": 0.0024547103576350233, "phrase": "ermh-bow_feature"}, {"score": 0.002362192695471035, "phrase": "information_gain"}, {"score": 0.002342110338541984, "phrase": "informativeness_weighting"}, {"score": 0.0023024551893939403, "phrase": "cleaner_and_more_discriminative_set"}, {"score": 0.0021968243227417053, "phrase": "trecvid"}, {"score": 0.0021504218042734677, "phrase": "multimedia_event_detection"}], "paper_keywords": ["Feature selection", " motion relativity", " video event detection"], "paper_abstract": "Event detection plays an essential role in video content analysis. In this paper, we present our approach based on motion relativity and feature selection for video event detection. First, we propose a new motion feature, namely Expanded Relative Motion Histogram of Bag-of-Visual-Words (ERMH-BoW) to employ motion relativity for event detection. In ERMH-BoW, by representing what aspect of an event with Bag-of-Visual-Words (BoW), we construct relative motion histograms between different visual words to depict the objects' activities or how aspect of the event. ERMH-BoW thus integrates both what and how aspects for a complete event description. Meanwhile, we show that by employing motion relativity, ERMH-BoW is invariant to the varying camera movement and able to honestly describe the object activities in an event. Furthermore, compared with other motion features, ERMH-BoW encodes not only the motion of objects, but also the interactions between different objects/scenes. Second, to address the high-dimensionality problem of the ERMH-BoW feature, we further propose an approach based on information gain and informativeness weighting to select a cleaner and more discriminative set of features. Our experiments carried out on several challenging datasets provided by TRECVID for the MED (Multimedia Event Detection) task demonstrate that our proposed approach outperforms the state-of-the-art approaches for video event detection.", "paper_title": "Video Event Detection Using Motion Relativity and Feature Selection", "paper_id": "WOS:000340295600012"}