{"auto_keywords": [{"score": 0.043284735713932605, "phrase": "entropic_vectors"}, {"score": 0.004780183091824403, "phrase": "finite_groups."}, {"score": 0.0047113960612140335, "phrase": "quasi-uniform_random_variables"}, {"score": 0.004494570360108983, "phrase": "finite_group"}, {"score": 0.004350308086118336, "phrase": "corresponding_entropic_vector"}, {"score": 0.004287680323820891, "phrase": "subgroup_structure"}, {"score": 0.004075469816959996, "phrase": "arbitrary_finite_groups"}, {"score": 0.00393032656248792, "phrase": "abelian_groups"}, {"score": 0.00376293585033711, "phrase": "different_families"}, {"score": 0.0037357362372975327, "phrase": "non-abelian_groups"}, {"score": 0.0032546105164772995, "phrase": "abelian_group_a"}, {"score": 0.002151388538895855, "phrase": "non-linear_coding_strategies"}, {"score": 0.0021049977753042253, "phrase": "network_information_theory_capacity_regions"}], "paper_keywords": ["Nilpotent group", " group representability", " entropic vector"], "paper_abstract": "A set of quasi-uniform random variables X-1, ... , X-n may be generated from a finite group G and n of its subgroups, with the corresponding entropic vector depending on the subgroup structure of G. It is known that the set of entropic vectors obtained by considering arbitrary finite groups is much richer than the one provided just by abelian groups. In this paper, we start to investigate in more detail different families of non-abelian groups with respect to the entropic vectors they yield. In particular, we address the question of whether a given non-abelian group G and some fixed subgroups G(1), ... , G(n) end up giving the same entropic vector as some abelian group A with subgroups A(1), ... , A(n), in which case we say that (A, A(1), ... , A(n)) represents (G, G(1), ... , G(n)). If for any choice of subgroups G(1), ..., G(n), there exists some abelian group A which represents G, we refer to G as being abelian (group) representable for n. We completely characterize dihedral, quasi-dihedral and dicyclic groups with respect to their abelian representability, as well as the case when n = 2, for which we show a group is abelian representable if and only if it is nilpotent. This problem is motivated by understanding non-linear coding strategies for network coding, and network information theory capacity regions.", "paper_title": "ON ABELIAN GROUP REPRESENTABILITY OF FINITE GROUPS", "paper_id": "WOS:000336142900003"}