{"auto_keywords": [{"score": 0.04425618028201676, "phrase": "interpolation_scheme"}, {"score": 0.015719716506582538, "phrase": "radial_basis_functions"}, {"score": 0.015619685043914477, "phrase": "gradient-based_aerodynamic_shape"}, {"score": 0.013967242989865956, "phrase": "cfd_mesh"}, {"score": 0.008717635354009932, "phrase": "mesh_deformation"}, {"score": 0.007187480187074394, "phrase": "rbf"}, {"score": 0.004692227830462433, "phrase": "computational_fluid_dynamics"}, {"score": 0.004427366754240748, "phrase": "computational_structural_mechanics"}, {"score": 0.004398951084021679, "phrase": "csm"}, {"score": 0.0043564917755613474, "phrase": "cfd"}, {"score": 0.0043144799365586375, "phrase": "repeated_deformations"}, {"score": 0.003816197777388722, "phrase": "computational_costs"}, {"score": 0.0036592457471262894, "phrase": "usual_laplace_smoothing"}, {"score": 0.0035429043440226124, "phrase": "mesh_connectivities"}, {"score": 0.0034974064973871833, "phrase": "structured_and_unstructured_meshes"}, {"score": 0.003299765620885585, "phrase": "aerodynamic_shape"}, {"score": 0.003153774948631967, "phrase": "gradient-based_algorithm"}, {"score": 0.0030534551416161637, "phrase": "design_parameters"}, {"score": 0.0028346293790895024, "phrase": "discretized_flow_equations"}, {"score": 0.0026830048370777315, "phrase": "jacobian_matrix"}, {"score": 0.0025312694615202786, "phrase": "transonic_speed"}, {"score": 0.00250682585023182, "phrase": "interpolation_algorithm"}, {"score": 0.0023346234464901978, "phrase": "new_algorithm"}, {"score": 0.002304606411453748, "phrase": "interpolation_error"}, {"score": 0.0021049977753042253, "phrase": "control_points"}], "paper_keywords": [""], "paper_abstract": "Gradient-based aerodynamic shape optimization using computational fluid dynamics (CFD), and time dependent problems in aeroelasticity, that is, coupled calculations between computational structural mechanics (CSM) and CFD, require repeated deformations of the CFD mesh. An interpolation scheme, based on radial basis functions (RBF), is devised in order to propagate the deformations from the boundaries to the interior of the CFD mesh. This method can lower the computational costs due to the deformation of the mesh, in comparison with the usual Laplace smoothing. Moreover, the algorithm is independent of the mesh connectivities. Therefore, structured and unstructured meshes are equally treated as well as hybrid meshes. The application of this interpolation scheme in problems of aerodynamic shape optimization is also carefully investigated. When the optimization is executed by a gradient-based algorithm the cost function is differentiated with respect to the design parameters in order to obtain the gradient. The gradient is most efficiently and accurately calculated by solving a certain adjoint equation derived from the discretized flow equations. The calculation of the gradient, which is detailed in this presentation, involves the Jacobian matrix of the mesh deformation. Finally, we present the results of an optimization of the ONERA M6 wing at transonic speed using the interpolation algorithm. The results are used for comparison with another technique of mesh deformation. The quality of the mesh obtained by the new algorithm, and the interpolation error, are analyzed with respect to the parameters of the interpolation scheme: the type of RBF, the RBF's shape parameter, and the sets of control points. (C) 2006 Elsevier Ltd. All rights reserved.", "paper_title": "Mesh deformation using radial basis functions for gradient-based aerodynamic shape optimization", "paper_id": "WOS:000246537700008"}