{"auto_keywords": [{"score": 0.0435790868041128, "phrase": "san_diego"}, {"score": 0.031177697743376278, "phrase": "ip_networks"}, {"score": 0.00465634671242413, "phrase": "world's_first_real-time"}, {"score": 0.003916098498242888, "phrase": "igrid"}, {"score": 0.0036826452656927877, "phrase": "keio_university"}, {"score": 0.0036417387835864894, "phrase": "tokyo"}, {"score": 0.0032023623555364777, "phrase": "soundscape"}, {"score": 0.002977835845437357, "phrase": "different_locations"}, {"score": 0.0023675132064088803, "phrase": "digital_cinema"}, {"score": 0.002251227801482381, "phrase": "remote_telepresence"}, {"score": 0.0022261705957258506, "phrase": "distance_learning"}, {"score": 0.0022013916728990564, "phrase": "scientific_visualization"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["4K SHD", " JPEG 2000", " flexcast", " soundscape"], "paper_abstract": "This paper describes the world's first real-time, international transmission of 4K digital cinema and 4K Super High Definition (SHD) digital video at iGrid 2005, hosted at the California Institute of Telecommunications and Information Technology (Calit2) at the University of California, San Diego. Nearly six hours of live and pre-recorded 4K motion picture and audio content was streamed to iGrid in San Diego from the Research Institute for Digital Media and Content (DMC) at Keio University in Tokyo. To implement this demonstration, several new technologies were introduced, including a prototype high-performance 4K compressed multicasting system called \"JPEG 2000 Flexcast\", and \"Soundscape\", a practical scheme for synchronizing audio and video transmitted from different locations over IP networks. These iGrid 2005 demonstrations proved that it is now feasible to implement networked professional audio/video applications - production, post-production and distribution - even at 4K quality over IP networks up to 15,000 km long. The demonstrations also showed the new 4K motion picture technology being introduced for digital cinema can be usefully applied to other network applications such as remote telepresence, distance learning and scientific visualization. (c) 2006 Published by Elsevier B.V.", "paper_title": "International real-time streaming of 4K digital cinema", "paper_id": "WOS:000238879800014"}