{"auto_keywords": [{"score": 0.0493653882313026, "phrase": "context-aware_systems"}, {"score": 0.02864039936811681, "phrase": "context_processing"}, {"score": 0.00481495049065317, "phrase": "petri_net-based"}, {"score": 0.004690025569165577, "phrase": "context-aware_services"}, {"score": 0.00443308765153716, "phrase": "customized_services"}, {"score": 0.004285702427563952, "phrase": "context-aware_applications"}, {"score": 0.004143196873246147, "phrase": "dynamically_changing_contexts"}, {"score": 0.0040508247605225214, "phrase": "context_model"}, {"score": 0.003975416846030462, "phrase": "complex_contexts"}, {"score": 0.0039308449157320815, "phrase": "key_accessor"}, {"score": 0.003729335910488339, "phrase": "timed_automata"}, {"score": 0.0037014533863198805, "phrase": "tang"}, {"score": 0.0036461569988218267, "phrase": "intell_automat_soft_comput"}, {"score": 0.003407549468745519, "phrase": "business_process_design"}, {"score": 0.003344076203780408, "phrase": "petri_net"}, {"score": 0.003220643255032943, "phrase": "innovat_syst_softw_eng"}, {"score": 0.0031017521516279664, "phrase": "context-aware_system"}, {"score": 0.003066945490483524, "phrase": "pn-based_approach"}, {"score": 0.0025795066118838067, "phrase": "five_important_features"}, {"score": 0.0021049977753042253, "phrase": "scalability_issue"}], "paper_keywords": ["Context-aware", " Context information process", " Context modeling", " Ubiquitous computing"], "paper_abstract": "The context-aware services require to efficiently perceive not only the user requirements but also the context of the environment to provide customized services to the user. To efficiently develop the context-aware applications a systematic methodology correctly specifying the relation among dynamically changing contexts is essential. Here the context model simplifying the manipulation of complex contexts is a key accessor for the specification and analysis of the service. Among various modeling approaches such as timed automata (Tang and You in Intell Automat Soft Comput 16(4):605-619, 2010), workflow (Rosemann et al. in Understanding context-awareness in business process design, 2010), Petri net (PN) (Jorgensen et al. in Innovat Syst Softw Eng 5(1):13-25, 2009), etc. developed for context-aware system, the PN-based approach has been recognized as one of the most effective one. In this paper we identify the issues of how the contexts are modeled and what kinds of the requirements needs to be considered in the context processing. We then discuss various Petri net (PN)-based modeling methodologies concerning the five important features for context processing: relationships and dependencies, time constraint, resource constraint, usability of modeling formalisms, and context identification. The study reveals that the approach effectively allowing both the time and resource constraints in the model while supporting other important properties needs to be developed further for accurately assess the context-aware systems. Also, the expandability and scalability issue need to be investigated.", "paper_title": "Petri net-based context modeling for context-aware systems", "paper_id": "WOS:000298332500002"}