{"auto_keywords": [{"score": 0.04527099105579865, "phrase": "performance_improvement"}, {"score": 0.04231365345404785, "phrase": "proposed_approach"}, {"score": 0.00481495049065317, "phrase": "contactless_hand_verification"}, {"score": 0.004507760907425495, "phrase": "personal_identification"}, {"score": 0.00439041997682389, "phrase": "new_approach"}, {"score": 0.004092168350316413, "phrase": "human_hand"}, {"score": 0.0038141000450978746, "phrase": "presented_hands"}, {"score": 0.003714748329627737, "phrase": "completely_contact-free_manner"}, {"score": 0.0035705347414368696, "phrase": "local_finger_surface_features"}, {"score": 0.003492840830999027, "phrase": "acquired_range_images"}, {"score": 0.0034018288705284427, "phrase": "proposed_matching_metrics"}, {"score": 0.003255364511414329, "phrase": "surfacecode"}, {"score": 0.0029289895726382653, "phrase": "experimental_results"}, {"score": 0.002623669616798891, "phrase": "significantly_improved_performance"}, {"score": 0.0023501014144112443, "phrase": "five_biometric_features"}, {"score": 0.0021049977753042253, "phrase": "user's_hand"}], "paper_keywords": ["Contactless palmprint", " hand biometrics", " three-dimensional (3-D) hand geometry", " three-dimensional (3-D) palmprint", " two-dimensional (2-D) hand geometry", " SurfaceCode"], "paper_abstract": "Two-dimensional (2-D) hand-geometry features carry limited discriminatory information and therefore yield moderate performance when utilized for personal identification. This paper investigates a new approach to achieve performance improvement by simultaneously acquiring and combining three-dimensional (3-D) and 2-D features from the human hand. The proposed approach utilizes a 3-D digitizer to simultaneously acquire intensity and range images of the presented hands of the users in a completely contact-free manner. Two new representations that effectively characterize the local finger surface features are extracted from the acquired range images and are matched using the proposed matching metrics. In addition, the characterization of 3-D palm surface using SurfaceCode is proposed for matching a pair of 3-D palms. The proposed approach is evaluated on a database of 177 users acquired in two sessions. The experimental results suggest that the proposed 3-D hand-geometry features have significant discriminatory information to reliably authenticate individuals. Our experimental results demonstrate that consolidating 3-D and 2-D hand-geometry features results in significantly improved performance that cannot be achieved with the traditional 2-D hand-geometry features alone. Furthermore, this paper also investigates the performance improvement that can be achieved by integrating five biometric features, i.e., 2-D palmprint, 3-D palmprint, finger texture, along with 3-D and 2-D hand-geometry features, that are simultaneously extracted from the user's hand presented for authentication.", "paper_title": "A Unified Framework for Contactless Hand Verification", "paper_id": "WOS:000293924700013"}