{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "fuzzy_logic"}, {"score": 0.015416809394805333, "phrase": "component-based_interactive_systems"}, {"score": 0.009995808320234442, "phrase": "formal_specifications"}, {"score": 0.009612105607093973, "phrase": "focus_theory"}, {"score": 0.004556901872357751, "phrase": "powerful_engineering_method"}, {"score": 0.004346704947011699, "phrase": "distributed_interactive_systems"}, {"score": 0.0042119653427658025, "phrase": "two-valued_logic"}, {"score": 0.0038930368103015467, "phrase": "component_behavior"}, {"score": 0.003802135020791801, "phrase": "safety_properties"}, {"score": 0.003584025547693836, "phrase": "problem_domain"}, {"score": 0.003378385493203297, "phrase": "challenging_task"}, {"score": 0.0032350961776525075, "phrase": "strict_modus_operandi"}, {"score": 0.00320970209394799, "phrase": "formal_methods"}, {"score": 0.0031719830393831115, "phrase": "main_objective"}, {"score": 0.003073545175760353, "phrase": "boolean_notion"}, {"score": 0.0029781530607129653, "phrase": "present_approach"}, {"score": 0.0026459927476753585, "phrase": "specification_technique"}, {"score": 0.002474447780553576, "phrase": "qualitative_fashion"}, {"score": 0.0023139986108451946, "phrase": "fuzzy_components"}, {"score": 0.0022958180852458215, "phrase": "fuzzy_interactions"}, {"score": 0.0021049977753042253, "phrase": "specification_properties"}], "paper_keywords": [""], "paper_abstract": "Formal methods are widely recognized as a powerful engineering method for the specification, simulation, development, and verification of distributed interactive systems. However, most formal methods rely on a two-valued logic, and are therefore limited to the axioms of that logic: a specification is valid or invalid, component behavior is realizable or not, safety properties hold or are violated, systems are available or unavailable. Especially when the problem domain entails uncertainty, impreciseness, and vagueness, the appliance of such methods becomes a challenging task. In order to overcome the limitations resulting from the strict modus operandi of formal methods, the main objective of this work is to relax the boolean notion of formal specifications by using fuzzy logic. The present approach is based on Focus theory, a model-based and strictly formal method for component-based interactive systems. The contribution of this work is twofold: i) we introduce a specification technique based on fuzzy logic which can be used on top of Focus to develop formal specifications in a qualitative fashion; ii) we partially extend Focus theory to a fuzzy one which allows the specification of fuzzy components and fuzzy interactions. While the former provides a methodology for approximating I/O behaviors under imprecision, the latter enables to capture a more quantitative view of specification properties such as realizability.", "paper_title": "A Formal Approach based on Fuzzy Logic for the Specification of Component-Based Interactive Systems", "paper_id": "WOS:000360179100007"}