{"auto_keywords": [{"score": 0.04739845836219197, "phrase": "mobile_platform"}, {"score": 0.00481495049065317, "phrase": "high-level_autonomous_navigational_behaviors"}, {"score": 0.004602085616330634, "phrase": "navigational_autonomy"}, {"score": 0.0045084510240032535, "phrase": "application_scenarios"}, {"score": 0.004434910775034831, "phrase": "humanoid_telepresence_system"}, {"score": 0.004326833704481825, "phrase": "reduced_operator_workload"}, {"score": 0.004256243266481051, "phrase": "robot_motion"}, {"score": 0.00388800655625083, "phrase": "arm_gesticulation"}, {"score": 0.003700709435644458, "phrase": "remote_environment"}, {"score": 0.0035808664384880213, "phrase": "robot_navigation"}, {"score": 0.00327086925741257, "phrase": "color_histogram_comparison_and_position_matching_algorithm"}, {"score": 0.00313894917464766, "phrase": "kinect_sensors"}, {"score": 0.0030497740719977835, "phrase": "safe_and_easy-to-use_system"}, {"score": 0.002651291854234327, "phrase": "higher_level"}, {"score": 0.002565345470805401, "phrase": "robotic_platform"}, {"score": 0.0025338369486914364, "phrase": "obstacle_avoidance_function"}, {"score": 0.002461810159687652, "phrase": "virtual_potential_field_method"}, {"score": 0.002431570196486513, "phrase": "preliminary_evaluation"}, {"score": 0.002285839246740627, "phrase": "operator_cognitive_load"}, {"score": 0.0021049977753042253, "phrase": "faster_pace"}], "paper_keywords": [""], "paper_abstract": "This paper presents a framework enabling navigational autonomy for a mobile platform with application scenarios specifically requiring a humanoid telepresence system. The proposal promises a reduced operator workload and safety during robot motion. In addition, the framework enables the inhabitor (human controlling the platform) to provide inputs for head and arm gesticulation. This allows the inhabitor to focus on interactions at the remote environment, rather than being engrossed in controlling robot navigation. This paper discusses the development of higher-level, human-like navigational behaviors such as following, accompanying, and guiding a person autonomously. A color histogram comparison and position matching algorithm has been developed to track the person using the Kinect sensors. In addition to providing a safe and easy-to-use system, the high-level behaviors are also required to be human-like in that the mobile platform obeys the laws of proxemics and other human interaction norms such as walking speed. This facilitates a higher level of experience for other humans interacting with the robotic platform. An obstacle avoidance function has also been implemented using the virtual potential field method. A preliminary evaluation was also conducted to validate the algorithm and to support the claim of reducing operator cognitive load due to navigation. In general, it was shown that navigation over a given route was accomplished at a faster pace with no instances of collision with the environment.", "paper_title": "A Study on High-Level Autonomous Navigational Behaviors for Telepresence Applications", "paper_id": "WOS:000340212700004"}