{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "parallel_systems"}, {"score": 0.00465944657565638, "phrase": "parallel_or_distributed_system"}, {"score": 0.004245476558619167, "phrase": "disk_space"}, {"score": 0.003784328428527216, "phrase": "general_framework"}, {"score": 0.003702323283528696, "phrase": "worst-case_effect"}, {"score": 0.003485824905231454, "phrase": "cost_function"}, {"score": 0.0033546701239540555, "phrase": "system's_performance"}, {"score": 0.0031069334778456633, "phrase": "makespan_of_an_optimum_schedule_of_jobs_w"}, {"score": 0.002664850766529523, "phrase": "factor_alpha"}, {"score": 0.0026357877401570764, "phrase": "node_capacities"}, {"score": 0.0023107372754933887, "phrase": "increasing_parallelism"}, {"score": 0.0022359278646792153, "phrase": "processor_speed"}, {"score": 0.0021874023741762496, "phrase": "constant_or_logarithmic_bounds"}], "paper_keywords": ["Heterogeneity", " Parallel systems", " Scheduling", " Makespan", " Precedence constrained scheduling"], "paper_abstract": "Suppose we have a parallel or distributed system whose nodes have limited capacities, such as processing speed, bandwidth, memory, or disk space. How does the performance of the system depend on the amount of heterogeneity of its capacity distribution? We propose a general framework to quantify the worst-case effect of increasing heterogeneity in models of parallel systems. Given a cost function g(C,W) representing the system's performance as a function of its nodes' capacities C and workload W (such as the makespan of an optimum schedule of jobs W on machines C), we say that g has price of heterogeneity alpha when for any workload, cost cannot increase by more than a factor alpha if node capacities become arbitrarily more heterogeneous. The price of heterogeneity also upper bounds the \"value of parallelism\": the maximum benefit obtained by increasing parallelism at the expense of decreasing processor speed. We give constant or logarithmic bounds on the price of heterogeneity of several well-known job scheduling and graph degree/diameter problems, indicating that in many cases, increasing heterogeneity can never be much of a disadvantage.", "paper_title": "On the Price of Heterogeneity in Parallel Systems", "paper_id": "WOS:000266928500006"}