{"auto_keywords": [{"score": 0.033528548646853895, "phrase": "mdmc"}, {"score": 0.008172776204402163, "phrase": "common_direction"}, {"score": 0.0074608360443379, "phrase": "neighboring_robots"}, {"score": 0.00552246838273685, "phrase": "alignment_control"}, {"score": 0.00481495049065317, "phrase": "mobile_robot_swarm"}, {"score": 0.004790664724744758, "phrase": "desired_direction"}, {"score": 0.004204904449336037, "phrase": "local_range"}, {"score": 0.0037093941875325862, "phrase": "limited_attention"}, {"score": 0.0036470559917231218, "phrase": "motion_control"}, {"score": 0.0035135619115963627, "phrase": "robot_motion"}, {"score": 0.0034079696245884073, "phrase": "novel_motion_control_method"}, {"score": 0.003249966782844541, "phrase": "real_robot_experiments"}, {"score": 0.0031203609829058587, "phrase": "random_direction"}, {"score": 0.0029857633082091377, "phrase": "preferred_direction"}, {"score": 0.002696837864985637, "phrase": "small_proportion"}, {"score": 0.0025630077791393125, "phrase": "motion_control_method"}, {"score": 0.0025370474510475628, "phrase": "previous_robotics_literature"}, {"score": 0.0023545181737729065, "phrase": "longer_distances"}, {"score": 0.002148315508445588, "phrase": "informed_robots"}, {"score": 0.0021049977753042253, "phrase": "mimc."}], "paper_keywords": ["Flocking", " swarm robotics", " swarm intelligence", " coordinated motion", " self-organization"], "paper_abstract": "In flocking, a swarm of robots moves cohesively in a common direction. Traditionally, flocking is realized using two main control rules: proximal control, which controls the cohesion of the swarm using local range-and bearing information about neighboring robots; and alignment control, which allows the robots to align in a common direction and uses more elaborate sensing mechanisms to obtain the orientation of neighboring robots. So far, limited attention has been given to motion control, used to translate the output of these two control rules into robot motion. In this paper, we propose a novel motion control method: magnitude-dependent motion control (MDMC). Through simulations and real robot experiments, we show that, with MDMC, flocking in a random direction is possible without the need for alignment control and for robots having a preferred direction of travel. MDMC has the advantage to be implementable on very simple robots that lack the capability to detect the orientation of their neighbors. In addition, we introduce a small proportion of robots informed about a desired direction of travel. We compare MDMC with a motion control method used in previous robotics literature, which we call magnitude-independent motion control (MIMC), and we show that the swarms can travel longer distances in the desired direction when using MDMC instead of MIMC. Finally, we systematically study flocking under various conditions: with or without alignment control, with or without informed robots, with MDMC or with MIMC.", "paper_title": "Self-organized flocking with a mobile robot swarm: a novel motion control method", "paper_id": "WOS:000311907400004"}