{"auto_keywords": [{"score": 0.048778468893892986, "phrase": "molecular"}, {"score": 0.00481495049065317, "phrase": "chaperonin_substrates"}, {"score": 0.004081385289516914, "phrase": "great_detail"}, {"score": 0.0038624981944755813, "phrase": "escherichia_coli"}, {"score": 0.0036052633308076933, "phrase": "long-standing_question"}, {"score": 0.003097865379563127, "phrase": "bioinformatics-based_approach"}, {"score": 0.0028914057633212045, "phrase": "groel-substrate_proteome"}, {"score": 0.0027741761880779535, "phrase": "groel_interactors"}, {"score": 0.00241658945942583, "phrase": "simple_bayesian_predictor"}, {"score": 0.002286781334850213, "phrase": "heterologous_groel_substrateproteins"}, {"score": 0.002163930783583212, "phrase": "established_mechanisms"}, {"score": 0.0021342613107011624, "phrase": "protein_folding"}, {"score": 0.0021049977753042253, "phrase": "evolutionary_buffering"}], "paper_keywords": [""], "paper_abstract": "Motivation: Molecular chaperones prevent the aggregation of their substrate proteins and thereby ensure that they reach their functional native state. The bacterial GroEL/ES chaperonin system is understood in great detail on a structural, mechanistic and functional level; its interactors in Escherichia coli have been identified and characterized. However, a long-standing question in the field is: What makes a protein a chaperone substrate? Results: Here we identify, using a bioinformatics-based approach a simple set of quantities, which characterize the GroEL-substrate proteome. We define three novel parameters differentiating GroEL interactors from other cellular proteins: lower rate of evolution, hydrophobicity and aggregation propensity. Combining them with other known features to a simple Bayesian predictor allows us to identify known homologous and heterologous GroEL substrateproteins. We discuss our findings in relation to established mechanisms of protein folding and evolutionary buffering by chaperones.", "paper_title": "A more precise characterization of chaperonin substrates", "paper_id": "WOS:000279474400001"}