{"auto_keywords": [{"score": 0.049798208892916335, "phrase": "tetrahymena"}, {"score": 0.00481495049065317, "phrase": "exploring_herg_classification"}, {"score": 0.004634380652505945, "phrase": "different_methodologies"}, {"score": 0.004593677275091001, "phrase": "chemical_data_sets"}, {"score": 0.00448686632980506, "phrase": "predictive_modeling"}, {"score": 0.004421368738303273, "phrase": "chemical_sciences"}, {"score": 0.004356823071698135, "phrase": "quantitative_structure_activity_relationship"}, {"score": 0.004230532852280929, "phrase": "contemporary_protocols"}, {"score": 0.004205715668397308, "phrase": "qsar_modeling_methods"}, {"score": 0.004059827743016726, "phrase": "traditional_and_three-dimensional_qsar_methodologies"}, {"score": 0.00357724980284755, "phrase": "support_vector_machine"}, {"score": 0.0033627909221532527, "phrase": "molecular_descriptors"}, {"score": 0.003323418619485992, "phrase": "gross_physicochemical_features"}, {"score": 0.002980325931052783, "phrase": "best_herg_svm_model"}, {"score": 0.0029367553751816237, "phrase": "three-best_svm_models"}, {"score": 0.002885308262488126, "phrase": "pubchem_data"}, {"score": 0.002809817778886807, "phrase": "best_t._pyriformis_model"}, {"score": 0.0026804431497899246, "phrase": "continuous_end_points"}, {"score": 0.0025494865958495807, "phrase": "predictive_ability"}, {"score": 0.002482760588789182, "phrase": "qsar_models"}, {"score": 0.0024609079887911063, "phrase": "curated_data_sets"}, {"score": 0.002446446287270777, "phrase": "biologically_relevant_molecular_descriptors"}, {"score": 0.002424912539118959, "phrase": "support_vector_machines"}, {"score": 0.002320047233050843, "phrase": "large_data_sets"}, {"score": 0.0021174453532942115, "phrase": "remarkable_amount"}, {"score": 0.0021049977753042253, "phrase": "biological_and_chemical_information"}], "paper_keywords": [""], "paper_abstract": "The inclusion and accessibility of different methodologies to explore chemical data sets has been beneficial to the field of predictive modeling, specifically in the chemical sciences in the field of Quantitative Structure Activity Relationship (QSAR) modeling. This study discusses using contemporary protocols and QSAR modeling methods to properly model two biomolecular systems that have historically not performed well using traditional and three-dimensional QSAR methodologies. Herein, we explore, analyze, and discuss the creation of a classification human Ether-a-go-go Related Gene (hERG) potassium channel model and a continuous Tetrahymena pyriformis (T. pyriformis) model using Support Vector Machine (SVM) and Support Vector Regression (SVR), respectively. The models are constructed with three types of molecular descriptors that capture the gross physicochemical features of the compounds: (i) 2D, 2 1/2D, and 3D physical features, (ii) VolSurf-like molecular interaction fields, and (iii) 4D-Fingerprints. The best hERG SVM model achieved 89% accuracy and the three-best SVM models were able to screen a Pubchem data set with an accuracy of 97%. The best T. pyriformis model had an R-2 value of 0.924 for the training set and was able to predict the continuous end points for two test sets with R-2 values of 0.832 and 0.620, respectively. The studies presented within demonstrate the predictive ability (classification and continuous end points) of QSAR models constructed from curated data sets, biologically relevant molecular descriptors, and Support Vector Machines and Support Vector Regression. The ability of these protocols and methodologies to accommodate large data sets (several thousands compounds) that are chemically diverse - and in the case of classification modeling unbalanced (one experimental outcome dominates the data set) - allows scientists to further explore a remarkable amount of biological and chemical information.", "paper_title": "Predictive Toxicology Modeling: Protocols for Exploring hERG Classification and Tetrahymena pyriformis End Point Predictions", "paper_id": "WOS:000305588100018"}