{"auto_keywords": [{"score": 0.05007850122175863, "phrase": "multistate_flow_network"}, {"score": 0.048992899974696226, "phrase": "mfn"}, {"score": 0.02800579914066742, "phrase": "nsiem"}, {"score": 0.004007083686875716, "phrase": "key_aspect"}, {"score": 0.003757480190200645, "phrase": "capacity_level_d"}, {"score": 0.003689053436223376, "phrase": "special_vector"}, {"score": 0.0035072146967082083, "phrase": "sink_node"}, {"score": 0.0030695103543472908, "phrase": "mfn_reliability"}, {"score": 0.002985988377995789, "phrase": "implicit_enumeration_method"}, {"score": 0.002958658735860083, "phrase": "iem"}, {"score": 0.0024389277933858054, "phrase": "time_complexity"}, {"score": 0.002405496949144104, "phrase": "proposed_nsiem"}, {"score": 0.002286781334850213, "phrase": "numerical_experiments"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Multi-state flow network", " Network reliability", " d-MP", " Implicit enumeration method"], "paper_abstract": "The multistate flow network (MFN) has been extensively adapted to model many real-world multi-state systems, which satisfy the flow conservation law, e.g., energy distribution networks, fluid distribution networks, and supply chain networks. Reliability is the key aspect to measure the performance of an MFN. The d-MP (minimal path with capacity level d) is a special vector such that the flow from the source node to the sink node is equal to d, and each arc is saturated in the MFN constructed by this vector. Searching for all d-MPs is the most important methodology in determining the MFN reliability. Until now, the implicit enumeration method (IEM) has been the only way to search for d-MPs. In this study, a novel node-based sequential implicit enumeration method (NSIEM) is proposed to search for all d-MPs in a more efficient way. The truth and the time complexity of the proposed NSIEM is confirmed and investigated. Furthermore, a series of numerical experiments is implemented to compare the efficiency of the NSIEM and the traditional IEM. (C) 2014 Elsevier Inc. All rights reserved.", "paper_title": "A novel node-based sequential implicit enumeration method for finding all d-MPs in a multistate flow network", "paper_id": "WOS:000347862200016"}