{"auto_keywords": [{"score": 0.04223028310020289, "phrase": "primary_customers"}, {"score": 0.03620993924304285, "phrase": "first_stage"}, {"score": 0.034558461740924654, "phrase": "primary_technology"}, {"score": 0.00481495049065317, "phrase": "network_design_application"}, {"score": 0.0047090997998449095, "phrase": "two-level_network_design_problem"}, {"score": 0.0038122196479548425, "phrase": "higher_level"}, {"score": 0.0036870776660851007, "phrase": "discrete_scenarios"}, {"score": 0.0036327808996444904, "phrase": "possible_realizations"}, {"score": 0.003410768840300913, "phrase": "network_topology"}, {"score": 0.002962194824034612, "phrase": "installed_secondary_technology"}, {"score": 0.0028331500847209984, "phrase": "higher_recovery_cost"}, {"score": 0.0028017745468000587, "phrase": "overall_goal"}, {"score": 0.002543967677678384, "phrase": "first-stage_installation_cost"}, {"score": 0.0025157865918985682, "phrase": "worst-case_cost"}, {"score": 0.0024421501497321027, "phrase": "selected_tree"}, {"score": 0.00222561197623787, "phrase": "mixed-integer_programming_models"}, {"score": 0.002184659911556181, "phrase": "branch-and-cut_algorithm"}], "paper_keywords": ["network design", " robust optimization", " mixed-integer programming", " branch and cut"], "paper_abstract": "We consider a network design application that is modeled as the two-level network design problem under uncertainty. In this problem, one of the two available technologies can be installed on each edge and all customers of the network need to be served by at least the lower level (secondary) technology. The decision maker is confronted with uncertainty regarding the set of primary customers, i.e., the set of nodes that need to be served by the higher level (primary) technology. A set of discrete scenarios associated with the possible realizations of primary customers is available. The network is built in two stages. In the first stage the network topology must be determined. One may decide to install the primary technology on some of the edges in the first stage, or one can wait to see which scenario will be realized, in which case, edges with the installed secondary technology may be upgraded, if necessary to primary technology, but at higher recovery cost. The overall goal then is to build a \"recoverable robust\" spanning tree in the first stage that serves all customers by at least the lower level technology, and that minimizes the first-stage installation cost plus the worst-case cost needed to upgrade the edges of the selected tree, so that the primary customers of each scenario can be served using the primary technology. We discuss the complexity of the problem, provide mixed-integer programming models, and develop a branch-and-cut algorithm to solve it. Our extensive computational experiments demonstrate the efficacy of our approach.", "paper_title": "The Recoverable Robust Two-Level Network Design Problem", "paper_id": "WOS:000349069800001"}