{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "comparative_linguistic_expressions"}, {"score": 0.04938622488322166, "phrase": "hesitant_fuzzy_linguistic_term_sets"}, {"score": 0.00443308765153716, "phrase": "multiple_points"}, {"score": 0.004326624385772596, "phrase": "group_decision"}, {"score": 0.0037942165191367366, "phrase": "linguistic_information"}, {"score": 0.0037392451233558234, "phrase": "successful_results"}, {"score": 0.0035443861412929006, "phrase": "linguistic_models"}, {"score": 0.0035100601949451028, "phrase": "single-valued_and_predefined_terms"}, {"score": 0.0031845067058084613, "phrase": "different_linguistic_terms"}, {"score": 0.0031383410838018953, "phrase": "richer_expressions"}, {"score": 0.002659527314613792, "phrase": "new_linguistic_group_decision_model"}, {"score": 0.0025829353063908256, "phrase": "flexible_and_rich_linguistic_expressions"}, {"score": 0.002436289099444074, "phrase": "human_beings'_cognitive_models"}, {"score": 0.002331781764406665, "phrase": "context-free_grammars"}, {"score": 0.002264607102799332, "phrase": "group_decision_process"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Group decision making", " Hesitant fuzzy linguistic term set", " Comparative linguistic expression", " Linguistic interval", " Context-free grammar"], "paper_abstract": "The complexity and impact of many real world decision making problems lead to the necessity of considering multiple points of view, building group decision making problems in which a group of experts provide their preferences to achieve a solution. In such complex problems uncertainty is often present and although the use of linguistic information has provided successful results in managing it, these are sometimes limited because the linguistic models use single-valued and predefined terms that restrict the richness of freely eliciting the preferences of the experts. Usually, experts may doubt between different linguistic terms and require richer expressions to express their knowledge more accurately. However, linguistic group decision making approaches do not provide any model to make more flexible the elicitation of linguistic preferences in such hesitant situations. In this paper is proposed a new linguistic group decision model that facilitates the elicitation of flexible and rich linguistic expressions, in particular through the use of comparative linguistic expressions, close to human beings' cognitive models for expressing linguistic preferences based on hesitant fuzzy linguistic term sets and context-free grammars. This model defines the group decision process and the necessary operators and tools to manage such linguistic expressions. (C) 2013 Elsevier Inc. All rights reserved.", "paper_title": "A group decision making model dealing with comparative linguistic expressions based on hesitant fuzzy linguistic term sets", "paper_id": "WOS:000320678200003"}