{"auto_keywords": [{"score": 0.036808897044971645, "phrase": "fiji"}, {"score": 0.00481495049065317, "phrase": "mac-aware_jamming_attacks"}, {"score": 0.004431416647518896, "phrase": "ap"}, {"score": 0.004126840854872329, "phrase": "behavioral_trait"}, {"score": 0.0040300463421312225, "phrase": "low-power_jammer"}, {"score": 0.003904495523681369, "phrase": "single_legitimate_client"}, {"score": 0.003738200814271716, "phrase": "total_throughput"}, {"score": 0.0036794956254952126, "phrase": "corresponding_ap"}, {"score": 0.0032675209435107273, "phrase": "network_performance"}, {"score": 0.00316565009987584, "phrase": "ap_load_distribution"}, {"score": 0.003115908199991072, "phrase": "jammer_detection"}, {"score": 0.0026911959223982727, "phrase": "jammed_clients"}, {"score": 0.0026594033724490172, "phrase": "maximum_possible_throughput"}, {"score": 0.002566255769251419, "phrase": "real_hardware"}, {"score": 0.002456816881853114, "phrase": "different_traffic_scenarios"}, {"score": 0.002437425029824563, "phrase": "network_densities"}, {"score": 0.002418185868191525, "phrase": "jammer_locations"}, {"score": 0.0022696277881969896, "phrase": "mesh_deployments"}, {"score": 0.0021301766910531137, "phrase": "available_bandwidth"}, {"score": 0.0021049977753042253, "phrase": "fair_and_efficient_way"}], "paper_keywords": ["IEEE 802.11 Wireless Medium Access Control", " Fairness", " Jamming", " Implementation", " Testbed", " Measurement"], "paper_abstract": "The IEEE 802.11 protocol inherently provides the same long-term throughput to all the clients associated with a given access point (AP). In this paper, we first identify a clever, low-power jamming attack that can take advantage of this behavioral trait: the placement of a low-power jammer in a way that it affects a single legitimate client can cause starvation to all the other clients. In other words, the total throughput provided by the corresponding AP is drastically degraded. To fight against this attack, we design FIJI, a cross-layer anti-jamming system that detects such intelligent jammers and mitigates their impact on network performance. FIJI looks for anomalies in the AP load distribution to efficiently perform jammer detection. It then makes decisions with regards to optimally shaping the traffic such that: (a) the clients that are not explicitly jammed are shielded from experiencing starvation and, (b) the jammed clients receive the maximum possible throughput under the given conditions. We implement FIJI in real hardware; we evaluate its efficacy through experiments on two wireless testbeds, under different traffic scenarios, network densities and jammer locations. We perform experiments both indoors and outdoors, and we consider both WLAN and mesh deployments. Our measurements suggest that FIJI detects such jammers in real-time and alleviates their impact by allocating the available bandwidth in a fair and efficient way.", "paper_title": "A software framework for alleviating the effects of MAC-aware jamming attacks in wireless access networks", "paper_id": "WOS:000292829700009"}