{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "graph-based_recommendation_engines"}, {"score": 0.0047448515702010734, "phrase": "apps_ecosystem"}, {"score": 0.0046986841646790315, "phrase": "recommendation_engines"}, {"score": 0.004260906498835763, "phrase": "new_items"}, {"score": 0.004017989546119125, "phrase": "historical_data"}, {"score": 0.0038261310307416475, "phrase": "collaborative_filtering"}, {"score": 0.003024909947609294, "phrase": "novel_way_graph"}, {"score": 0.002966230968271199, "phrase": "edges_weights"}, {"score": 0.002937318465594425, "phrase": "network_flow"}, {"score": 0.0028106505443369545, "phrase": "real_environment"}, {"score": 0.0027026375053777543, "phrase": "smartphone_users"}, {"score": 0.002356173823922118, "phrase": "global_view"}, {"score": 0.002232519579957707, "phrase": "graph-based_re"}], "paper_keywords": ["Recommendation engines", " smartphone apps", " graph theory", " collaborative filtering", " flow algorithms"], "paper_abstract": "Recommendation engines (RE) are becoming highly popular, e.g., in the area of e-commerce. A RE offers new items (products or content) to users based on their profile and historical data. The most popular algorithms used in RE are based on collaborative filtering. This technique makes recommendations based on the past behavior of other users and the similarity between users and items. In this paper we have evaluated the performance of several RE based on the properties of the networks formed by users and items. The RE use in a novel way graph theoretic concepts like edges weights or network flow. The evaluation has been conducted in a real environment (ecosystem) for recommending apps to smartphone users. The analysis of the results allows concluding that the effectiveness of a RE can be improved if the age of the data, and if a global view of the data is considered. It also shows that graph-based RE are effective, but more experiments are required for a more accurate characterization of their properties.", "paper_title": "Empirical Comparison of Graph-based Recommendation Engines for an Apps Ecosystem", "paper_id": "WOS:000362593900005"}