{"auto_keywords": [{"score": 0.049124089120586564, "phrase": "resource_allocation"}, {"score": 0.02683899032632185, "phrase": "malicious_peers"}, {"score": 0.00481495049065317, "phrase": "statistical_mechanisms"}, {"score": 0.004766683200410046, "phrase": "detecting_malicious_behaviors"}, {"score": 0.004160319763461951, "phrase": "autonomous_peers"}, {"score": 0.003975781274672803, "phrase": "effective_resource_allocation_strategies"}, {"score": 0.0038964032225585117, "phrase": "peers'_task_priorities"}, {"score": 0.0030431198971423937, "phrase": "bidding_based_approach"}, {"score": 0.0028933521924166287, "phrase": "peers'_bidding_strategies"}, {"score": 0.0027929100418926725, "phrase": "probability_distributions"}, {"score": 0.002764856305713066, "phrase": "peers'_valuations"}, {"score": 0.0026688629249775925, "phrase": "nash_equilibrium"}, {"score": 0.0024742098091226203, "phrase": "different_types"}, {"score": 0.0024493494346360415, "phrase": "malicious_behavior"}, {"score": 0.0021049977753042253, "phrase": "proposed_mechanisms"}], "paper_keywords": ["Peer-to-Peer system", " detecting malicious behavior", " statistical mechanism", " resource allocation"], "paper_abstract": "A Peer-to-Peer (P2P) system relies on the cooperation of the peers and the contributions of their resources. To motivate autonomous peers share their resources, the system needs to support effective resource allocation strategies with respect to peers' task priorities, and their personal information about valuation. However, peers may tend to be selfish for saving their limited resources and act as the free-riders. Some peers may even be malicious with the goal to do damage to the system. In this paper, we present a bidding based approach for resource allocation to address these issues. We investigate peers' bidding strategies under different scenarios in terms of probability distributions that peers' valuations of their prioritized tasks follow in achieving the Nash equilibrium. For resisting the damage to the P2P system brought by malicious peers, we explore different types of malicious behavior and present several statistical mechanisms to detect the malicious peers. The algorithm is also presented for bidders performing their auctions. Finally, we conducted experiments to show the effectiveness of the proposed mechanisms.", "paper_title": "Statistical Mechanisms for Detecting Malicious Behaviors in Resource Allocation from Non-cooperative P2P Environments", "paper_id": "WOS:000309220000006"}