{"auto_keywords": [{"score": 0.04418678500761651, "phrase": "trust-discount_tradeoff"}, {"score": 0.004498490110526062, "phrase": "individuals'_frugality"}, {"score": 0.004202741104973709, "phrase": "trust-discount_tradeoff_measures"}, {"score": 0.0037261429556468217, "phrase": "higher-discount_website"}, {"score": 0.0030378759123133644, "phrase": "security_concern"}, {"score": 0.0027790254309734428, "phrase": "high_level"}, {"score": 0.002693018258362651, "phrase": "privacy_concern"}, {"score": 0.0024634797027967203, "phrase": "low_level"}, {"score": 0.002374735066990346, "phrase": "subsequent_analysis"}, {"score": 0.0022299587520401747, "phrase": "underlying_contextual_sensitivity"}, {"score": 0.0021049977753042253, "phrase": "contextual_examination"}], "paper_keywords": ["Security Concern", " Privacy Concern", " Frugality", " Trust", " Tradeoff", " Discount", " Context"], "paper_abstract": "This study examines the role individuals' frugality plays in moderating the impact of privacy and security concerns on trust-discount tradeoff Trust-discount tradeoff measures a user's intention on a continuum to transact with a higher-trust, higher-premium website as opposed to lower-trust, higher-discount website. The hypotheses are examined in three different contexts: e-commerce, health and finance. The findings suggest that frugality does moderate the impact of privacy and security concerns on trust-discount tradeoff in all three contexts, such that security concern is positively associated with preference for higher-trust, higher-premium websites for individuals with a high level of frugality, and that privacy concern is positively associated with preference for higher-trust, higher-premium websites for individuals with a low level of frugality. However; the subsequent analysis reveals that the reasons for the above moderating impact differ depending upon the underlying contextual sensitivity. This study is one of the first to provide contextual examination of the role of frugality, privacy and security concerns in trust-discount tradeoff.", "paper_title": "TRUST-DISCOUNT TRADEOFF IN THREE CONTEXTS: FRUGALITY MODERATING PRIVACY AND SECURITY CONCERNS", "paper_id": "WOS:000343952500002"}