{"auto_keywords": [{"score": 0.004745260932479212, "phrase": "electronic_excited_state"}, {"score": 0.0046993598473345395, "phrase": "intramolecular_and_intermolecular_hydrogen_bonding"}, {"score": 0.004564291332315995, "phrase": "calixarene_building_blocks"}, {"score": 0.004284755353695709, "phrase": "time-dependent_density_functional_theory"}, {"score": 0.004181839414007266, "phrase": "twenty-four_stable_conformations"}, {"score": 0.003925633992809873, "phrase": "ground_state"}, {"score": 0.0038499929374478125, "phrase": "calculation_results"}, {"score": 0.0036493838225192883, "phrase": "intramolecular_hydrogen_bond"}, {"score": 0.0035443861412929006, "phrase": "infrared_spectra"}, {"score": 0.003310951184365485, "phrase": "stretching_vibrational_absorption_band"}, {"score": 0.0029892206557359836, "phrase": "new_strong_absorption_band"}, {"score": 0.0028471655497661528, "phrase": "bond_lengths"}, {"score": 0.0025085435314540837, "phrase": "electronic_excitation"}], "paper_keywords": ["Excited state", " Infrared spectra", " Intermolecular hydrogen bond", " Intramolecular hydrogen bond", " TDDFT"], "paper_abstract": "Intramolecular and intermolecular hydrogen bonding in electronic excited states of calixarene building blocks bis(2-hydroxyphenyl)methane (2HDPM) monomer and hydrogen-bonded 2HDPM-H2O complex were studied theoretically using the time-dependent density functional theory (TDDFT). Twenty-four stable conformations (12 pairs of enantiomers) of 2HDPM monomer have been found in the ground state. From the calculation results, the conformations 1a and 1b which both have an intramolecular hydrogen bond are the most stable ones. The infrared spectra of 2HDPM monomer and 2HDPM-H2O complex in ground state and S-1 state were calculated. The stretching vibrational absorption band of O-2 -aEuro parts per thousand H-3 group in the monomer and complex disappeared in the S-1 state. At the same time, a new strong absorption band appeared at the C=O stretching region. From the calculation of bond lengths, it indicates that the O-2 -aEuro parts per thousand H-3 bond is significantly lengthened in the S-1 state. However, the C-1 -aEuro parts per thousand O-2 bond is drastically shortened upon electronic excitation to the S-1 state and has the characteristics of C=O band. Furthermore, the intramolecular hydrogen bond O-2 -aEuro parts per thousand H-3 center dot center dot center dot O-4 of the 2HDPM monomer and the intermolecular hydrogen bonds O-2 -aEuro parts per thousand H-3 center dot center dot center dot O-7 and O-7 -aEuro parts per thousand H-9 center dot center dot center dot O-4 of 2HDPM-H2O complex are all shortened and strengthened in the S-1 state.", "paper_title": "Calixarene building block bis(2-hydroxyphenyl)methane (2HDPM) and hydrogen-bonded 2HDPM-H2O complex in electronic excited state", "paper_id": "WOS:000316677600041"}