{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "efficient_computation"}, {"score": 0.004745056850725867, "phrase": "synthetic_bidirectional_texture_functions"}, {"score": 0.0043464021636703066, "phrase": "large_amount"}, {"score": 0.004283280680222718, "phrase": "modelling_flexibility"}, {"score": 0.0035934073774126856, "phrase": "bidirectional_texture_functions"}, {"score": 0.0033890026927890058, "phrase": "efficient_photorealistic_rendering"}, {"score": 0.0032196786163178107, "phrase": "efficient_system"}, {"score": 0.0031039212233596415, "phrase": "synthetic_btfs"}, {"score": 0.0030587884803931964, "phrase": "monte_carlo_path_tracing"}, {"score": 0.0026419338604879404, "phrase": "rendering_times"}], "paper_keywords": ["appearance design", " BTF", " micro-geometry", " non-local means", " image reconstruction", " path tracing", " I", " 3", " 7 [Computer Graphics]: Colour", " Shading", " Shadowing", " Texture Ray Tracing"], "paper_abstract": "Visual prototyping of materials is relevant for many computer graphics applications. A large amount of modelling flexibility can be obtained by directly rendering micro-geometry. While this is possible in principle, it is usually computationally expensive. Recently, bidirectional texture functions (BTFs) have become popular for efficient photorealistic rendering of surfaces. We propose an efficient system for the computation of synthetic BTFs using Monte Carlo path tracing of micro-geometry. We observe that BTFs usually consist of many similar apparent bidirectional reflectance distribution functions. By exploiting structural similarity we can reduce rendering times by one order of magnitude. This is done in a process we call non-local image reconstruction, which has been inspired by non-local means filtering. Our results indicate that synthesizing BTFs is highly practical and may currently only take a few minutes for BTFs with 70 x 70 viewing and lighting directions and 128 x 128 pixels.", "paper_title": "Non-Local Image Reconstruction for Efficient Computation of Synthetic Bidirectional Texture Functions", "paper_id": "WOS:000327433800006"}