{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "multivariate_calibration"}, {"score": 0.02675616163602511, "phrase": "dt_method"}, {"score": 0.014107160151474426, "phrase": "new_samples"}, {"score": 0.012306798327371115, "phrase": "original_calibration"}, {"score": 0.004756805752518494, "phrase": "delaunay_triangulation_method"}, {"score": 0.004642604455537883, "phrase": "new_local_model"}, {"score": 0.004404445045826858, "phrase": "dt_model"}, {"score": 0.004281284532043714, "phrase": "different_spectral_characteristics"}, {"score": 0.0041784516085055035, "phrase": "new_components"}, {"score": 0.0041279612688488445, "phrase": "typical_levels"}, {"score": 0.003398015125667192, "phrase": "latter_situation"}, {"score": 0.002984373546099842, "phrase": "new_cluster"}, {"score": 0.0028541057064952876, "phrase": "proposed_methodology"}, {"score": 0.002707444334463544, "phrase": "different_structures"}, {"score": 0.0026423134393535265, "phrase": "updating_procedure"}, {"score": 0.0022830706430588482, "phrase": "single_or_very_few_samples"}, {"score": 0.0021745003291048356, "phrase": "valuable_tool"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["updating", " multivariate calibration", " Delaunay triangulation method", " OPTICS"], "paper_abstract": "The Delaunay triangulation (DT) method is a local simplex method for multivariate calibration. The DT model must be updated when new samples show different spectral characteristics, such as they contain new components or the typical levels of the analyte have moved outside their range. Two different situations can be considered for updating, namely the new samples are close to the original calibration set (marginal outliers) or they are far away from the original calibration set (true outliers). This paper focuses on the latter situation. Updating then leads to the creation of new local DT mesh(es). OPTICS (Ordering Points to Identify the Clustering Structure) is proposed to decide if the candidate updating samples, form a new cluster and which samples exactly are part of that cluster. The proposed methodology was applied to several NIR (Near Infrared Spectroscopy) data sets with different structures and they show that the updating procedure proposed performs well. After updating, the results with the DT method are comparable to or better than with PLS. However, the DT method cannot be applied when updating must be applied with a single or very few samples. Overall, however, the DT method is confirmed as a valuable tool for multivariate calibration. (c) 2005 Elsevier B.V. All rights reserved.", "paper_title": "Updating multivariate calibration with the Delaunay triangulation method: The creation of a new local model", "paper_id": "WOS:000234969400009"}