{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "nearest-neighbor_collaborative_filtering"}, {"score": 0.0047310525657970615, "phrase": "aggregate_individual_user_ratings"}, {"score": 0.00440976345264104, "phrase": "aggregation_process"}, {"score": 0.004332894955218135, "phrase": "user_experience"}, {"score": 0.00395069818358908, "phrase": "global_recommender_performance_measures"}, {"score": 0.003847802030433298, "phrase": "individual_rating"}, {"score": 0.0031845067058084583, "phrase": "direct_uses"}, {"score": 0.00307431840409833, "phrase": "better_targeting"}, {"score": 0.002623669616798891, "phrase": "rating_subspaces"}, {"score": 0.002499590390751339, "phrase": "system_performance"}, {"score": 0.0024667783849055634, "phrase": "enumerate_users"}, {"score": 0.0021613897794439227, "phrase": "broad_primitives"}, {"score": 0.0021236300589450143, "phrase": "recommender_system"}], "paper_keywords": ["Algorithms", " Human Factors", " Recommender systems", " collaborative filtering", " neighborhoods", " user-based and item-based algorithms", " scouts", " promoters", " connectors"], "paper_abstract": "Recommender systems aggregate individual user ratings into predictions of products or services that might interest visitors. The quality of this aggregation process crucially affects the user experience and hence the effectiveness of recommenders in e-commerce. We present a characterization of nearest-neighbor collaborative filtering that allows us to disaggregate global recommender performance measures into contributions made by each individual rating. In particular, we formulate three roles-scouts, promoters, and connectors-that capture how users receive recommendations, how items get recommended, and how ratings of these two types are themselves connected, respectively. These roles find direct uses in improving recommendations for users, in better targeting of items and, most importantly, in helping monitor the health of the system as a whole. For instance, they can be used to track the evolution of neighborhoods, to identify rating subspaces that do not contribute ( or contribute negatively) to system performance, to enumerate users who are in danger of leaving, and to assess the susceptibility of the system to attacks such as shilling. We argue that the three rating roles presented here provide broad primitives to manage a recommender system and its community.", "paper_title": "Scouts, Promoters, and Connectors: The Roles of Ratings in Nearest-Neighbor Collaborative Filtering", "paper_id": "WOS:000207047200002"}