{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "sustainable_entrepreneurship"}, {"score": 0.019647614501284057, "phrase": "tourism_sector"}, {"score": 0.004452228677941085, "phrase": "long_run"}, {"score": 0.003943047070755799, "phrase": "appropriate_policy-making_measures"}, {"score": 0.0037471850931318942, "phrase": "conceptual_multilevel_model"}, {"score": 0.003674461410107989, "phrase": "requisitely_holistic_means"}, {"score": 0.0033183674218329904, "phrase": "requisite_variety"}, {"score": 0.0029040994533437903, "phrase": "proposed_model"}, {"score": 0.002881403688962202, "phrase": "systemic_and_systematic_views"}, {"score": 0.002727409429089543, "phrase": "holistic_framework"}, {"score": 0.0026327757304477665, "phrase": "influential_elements"}, {"score": 0.0026019646284747024, "phrase": "economics_point"}, {"score": 0.0024920359789965783, "phrase": "suggested_model"}, {"score": 0.002462867872567125, "phrase": "initial_step"}, {"score": 0.002331189621118592, "phrase": "valuable_contribution"}, {"score": 0.0023129608058249937, "phrase": "future_research_designs"}, {"score": 0.002197891020396052, "phrase": "important_foundation"}, {"score": 0.002180702259644951, "phrase": "evidence-based_policy"}, {"score": 0.0021215910859085146, "phrase": "requisitely_holistic_behavior"}], "paper_keywords": ["Tourism", " Social responsibility", " Requisite variety", " Sustainable entrepreneurship", " Requisite holism"], "paper_abstract": "Purpose - The tourism sector is heavily dependent on entrepreneurship and cannot survive in the long run if it is not both sustainable and entrepreneurial at the same time; these three areas entrepreneurship, sustainability, and tourism are rarely linked in research and are not reflected in appropriate policy-making measures. Thus, the purpose of this paper is to develop a conceptual multilevel model that will provide a requisitely holistic means for studying sustainable entrepreneurship in the tourism sector. Design/methodology/approach - In the process of developing a model, the authors took into account the principle of requisite variety and considered various dimensions related to sustainable entrepreneurship implicated at three levels of analysis namely, individual (entrepreneur), organizational (SME), and national/regional (tourism destination). Findings - The proposed model provides systemic and systematic views on sustainable entrepreneurship in the tourism sector and contains various levels of analysis. The holistic framework for studying sustainable entrepreneurship in the tourism helps highlight influential elements from an economics point of view as well as their measurable and internationally comparable outcomes. Originality/value - The suggested model represents an initial step toward the measurement of sustainable entrepreneurship in tourism at various levels, thereby making a valuable contribution to future research designs seeking to evaluate the benefits of sustainable entrepreneurship. The paper provides an important foundation for evidence-based policy making with the aim of fostering requisitely holistic behavior and innovative, responsible, and sustainable entrepreneurship practices in the tourism sector.", "paper_title": "Building a model of researching the sustainable entrepreneurship in the tourism sector", "paper_id": "WOS:000334146900005"}