{"auto_keywords": [{"score": 0.04692645569113319, "phrase": "time_series"}, {"score": 0.009653663873177913, "phrase": "time_axis"}, {"score": 0.00481495049065317, "phrase": "medical_time"}, {"score": 0.004766090327062509, "phrase": "fuzzy-rough_sets"}, {"score": 0.004606759374526927, "phrase": "medical_time_series"}, {"score": 0.004188287972391714, "phrase": "fuzzy_similarity"}, {"score": 0.0040619911719900976, "phrase": "similar_effects"}, {"score": 0.003509006038574667, "phrase": "time_information"}, {"score": 0.0030310732341527168, "phrase": "cause-effect_relationship"}, {"score": 0.0029697601808164435, "phrase": "magnitude_relationship"}, {"score": 0.002812237329893584, "phrase": "one-to-many_relationship"}, {"score": 0.0024455860314641243, "phrase": "whole_time_series"}, {"score": 0.0023475891378276735, "phrase": "power_law"}, {"score": 0.002331641523873951, "phrase": "fractal_theory"}, {"score": 0.0023000698178350415, "phrase": "icu_data_sets"}, {"score": 0.00226892463779702, "phrase": "ruggedness_measure"}, {"score": 0.002245842206945282, "phrase": "fuzzy-rough_set"}, {"score": 0.002177991273791155, "phrase": "popular_measures"}, {"score": 0.0021484955960643167, "phrase": "hurst_exponent"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["characterization", " time series", " fuzzy", " rough", " fuzzy-rough", " hurst exponent and fractal"], "paper_abstract": "This paper attempts to characterize a medical time series by quantifying the ruggedness of the time series. The presence of two close data points on the time axis implies that these points are similar along the time axis. It creates fuzzy similarity. Following the principle \"similar causes create similar effects\", we expect that the magnitudes corresponding to those two data points should also be similar. Frequently, it is not observed in a time series. One of the reasons is as follows: if other features have been considered along with the time information, then those two close data points Would have looked different. Consequently, the magnitudes corresponding to those two apparently similar points become different. Therefore, if we consider the closeness along the time axis as a cause, then the effect, i.e., the corresponding magnitudes could be either same or similar or completely dissimilar. This phenomenon makes cause-effect relationship, i.e., time versus magnitude relationship, one-to-many. Specifically, the closeness creates fuzziness, the one-to-many relationship creates roughness, and together they form fuzzy-roughness. If the ruggedness is expressed as the fuzzy-1-roughness, then in some time series it is observed that the fuzzy-roughness of a part of the time series is similar to that of the whole time series. Specifically, the scaling up of the fuzzy-roughness follows the power law of fractal theory. Experiments on ICU data sets show that the ruggedness measure using the fuzzy-rough set based fractal dimension is more robust than some popular measures of ruggedness like Hurst exponent. (c) 2005 Elsevier B.V. All rights reserved.", "paper_title": "Ruggedness measures of medical time series using fuzzy-rough sets and fractals", "paper_id": "WOS:000235862300014"}