{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "everyday_language"}, {"score": 0.007972083328629883, "phrase": "information_retrieval"}, {"score": 0.004719816332271661, "phrase": "effective_information_retrieval"}, {"score": 0.004535124351828787, "phrase": "easy_and_efficient_way"}, {"score": 0.004392565073466714, "phrase": "even_short_queries"}, {"score": 0.004137184278868391, "phrase": "everyday_language_input"}, {"score": 0.00407161650109722, "phrase": "wearable_technology"}, {"score": 0.003714195746979591, "phrase": "new_input"}, {"score": 0.0032423089921154503, "phrase": "surface_structure"}, {"score": 0.0031277316566463978, "phrase": "underlying_meaning"}, {"score": 0.0030292784088033838, "phrase": "markov_machine"}, {"score": 0.0028302049070944944, "phrase": "rigorous_evaluation"}, {"score": 0.0026547761341670505, "phrase": "existing_language_models"}, {"score": 0.002382987346529592, "phrase": "imminent_transition"}, {"score": 0.002363995836370621, "phrase": "keyword_input"}, {"score": 0.002262209824105154, "phrase": "concise_queries"}], "paper_keywords": ["information retrieval"], "paper_abstract": "Typing 2 or 3 keywords into a browser has become an easy and efficient way to find information. Yet, typing even short queries becomes tedious on ever shrinking (virtual) keyboards. Meanwhile, speech processing is maturing rapidly, facilitating everyday language input. Also, wearable technology can inform users proactively by listening in on their conversations or processing their social media interactions. Given these developments, everyday language may soon become the new input of choice. We present an information retrieval (IR) algorithm specifically designed to accept everyday language. It integrates two paradigms of information retrieval, previously studied in isolation; one directed mainly at the surface structure of language, the other primarily at the underlying meaning. The integration was achieved by a Markov machine that encodes meaning by its transition graph, and surface structure by the language it generates. A rigorous evaluation of the approach showed, first, that it can compete with the quality of existing language models, second, that it is more effective the more verbose the input, and third, as a consequence, that it is promising for an imminent transition from keyword input, where the onus is on the user to formulate concise queries, to a modality where users can express more freely, more informal, and more natural their need for information in everyday language.", "paper_title": "How Everyday Language Can and Will Boost Effective Information Retrieval", "paper_id": "WOS:000357817600002"}