{"auto_keywords": [{"score": 0.04965333175972822, "phrase": "e-banking_development"}, {"score": 0.027710755695365376, "phrase": "iran"}, {"score": 0.004645963909852102, "phrase": "ahp"}, {"score": 0.00458412183693466, "phrase": "new_information_technologies"}, {"score": 0.004543352284098364, "phrase": "emerging_business_forces"}, {"score": 0.004462892860919036, "phrase": "new_wave"}, {"score": 0.0044231966846655394, "phrase": "financial_innovation-electronic_banking"}, {"score": 0.004229927464182562, "phrase": "online_bankers"}, {"score": 0.003868257410961701, "phrase": "online_channel"}, {"score": 0.0038167308978417306, "phrase": "iran_e-banking"}, {"score": 0.0036991458715587163, "phrase": "successful_innovation"}, {"score": 0.0028284924551705516, "phrase": "policy_makers"}, {"score": 0.002574788013427524, "phrase": "special_interest"}, {"score": 0.0025404470150468387, "phrase": "rating_factors"}, {"score": 0.002251227801482381, "phrase": "\"industry_e-readiness"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["E-ban king", " 3D e-readiness", " Organizational e-readiness", " Macro environmental e-readiness", " Industry e-readiness", " Fuzzy AHP"], "paper_abstract": "New information technologies and emerging business forces have triggered a new wave of financial innovation-electronic banking (e-banking). Several studies indicate that online bankers are the most profitable and wealthiest segment to banks. On this basis, no bank today can underestimate the power of the online channel. In Iran e-banking, although proven to be a successful innovation, has still not become adopted by the laggards, and hence, has not met all the expectations of banks and customers. There exist multiple organizational, macro environmental and banking industry specific reasons for this, that we use 3D e-readiness concepts for these reasons. Those factors can move/inhibit e-banking development, but the importance of them is not same. Some of them require more attention from banks and policy makers. Therefore, the purpose of this paper is to priority of factors that impact e-banking development in Iran. The special interest is to rating factors that influence e-banking development in Iran. In order to achieve the objective, 30 Iranian bank managers and expert were interviewed using the Standard AHP questionnaire. The findings indicate that \"industry e-readiness\" is the most important attribute of the e-banking development in Iran. (C) 2009 Elsevier Ltd. All rights reserved.", "paper_title": "The impact of 3D e-readiness on e-banking development in Iran: A fuzzy AHP analysis", "paper_id": "WOS:000276532600008"}