{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "web_documents"}, {"score": 0.011945391167070593, "phrase": "link_structure"}, {"score": 0.004766683200410046, "phrase": "traditional_text-based_document_classifiers"}, {"score": 0.004077272409331917, "phrase": "different_source"}, {"score": 0.0033832583769880576, "phrase": "document_classification"}, {"score": 0.0032989853590079153, "phrase": "five_different_similarity_measures"}, {"score": 0.0031366648074858555, "phrase": "web_page"}, {"score": 0.0028642924503126154, "phrase": "average_precision"}, {"score": 0.002723301730223192, "phrase": "traditional_text-based_classifier"}, {"score": 0.0024617483174454134, "phrase": "text-based_classification"}, {"score": 0.0022478501955483024, "phrase": "practical_and_effective_solution"}, {"score": 0.0021917966722180132, "phrase": "related_information_retrieval_tasks"}, {"score": 0.0021049977753042253, "phrase": "important_set"}], "paper_keywords": [""], "paper_abstract": "Traditional text-based document classifiers tend to perform poorly on the Web. Text in Web documents is usually noisy and often does not contain enough information to determine their topic. However, the Web provides a different source that can be useful to document classification: its hyperlink structure. In this work, the authors evaluate how the link structure of the Web can be used to determine a measure of similarity appropriate for document classification. They experiment with five different similarity measures and determine their adequacy for predicting the topic of a Web page. Tests performed on a Web directory show that link information alone allows classifying documents with an average precision of 86%. Further, when combined with a traditional text-based classifier, precision increases to values of up to 90%, representing gains that range from 63 to 132% over the use of text-based classification alone. Because the measures proposed in this article are straightforward to compute, they provide a practical and effective solution for Web classification and related information retrieval tasks. Further, the authors provide an important set of guidelines on how link structure can be used effectively to classify Web documents.", "paper_title": "Link-based similarity measures for the classification of Web documents", "paper_id": "WOS:000234490500005"}