{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "scientific_workflows"}, {"score": 0.04355159126538614, "phrase": "workflow_specifications"}, {"score": 0.030695498313619608, "phrase": "workflow-centric_research_objects"}, {"score": 0.004771276094330179, "phrase": "popular_mechanism"}, {"score": 0.004642604455537883, "phrase": "silico_experiments"}, {"score": 0.0046004861111734185, "phrase": "significant_aspect"}, {"score": 0.004395532072377065, "phrase": "useful_building_blocks"}, {"score": 0.004276949941406725, "phrase": "new_experiments"}, {"score": 0.0042252744467257885, "phrase": "previous_studies"}, {"score": 0.003520751317164754, "phrase": "additional_resources"}, {"score": 0.0033129660760880383, "phrase": "workflow_executions"}, {"score": 0.003223494720348768, "phrase": "novel_approach"}, {"score": 0.0031269043024513567, "phrase": "research_objects"}, {"score": 0.0028110048684383167, "phrase": "previous_empirical_analyses"}, {"score": 0.002793946821396871, "phrase": "workflow_decay"}, {"score": 0.0026937446571204653, "phrase": "existing_well_known_ontologies"}, {"score": 0.002573661339171782, "phrase": "ao"}, {"score": 0.002421499421848063, "phrase": "workflow_research"}, {"score": 0.002370437342182877, "phrase": "huntington's_disease"}, {"score": 0.0022924238481626127, "phrase": "hg"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Research object", " Scientific workflow", " Preservation", " Annotation", " Ontologies", " Provenance"], "paper_abstract": "Scientific workflows are a popular mechanism for specifying and automating data-driven in silico experiments. A significant aspect of their value lies in their potential to be reused. Once shared, workflows become useful building blocks that can be combined or modified for developing new experiments. However, previous studies have shown that storing workflow specifications alone is not sufficient to ensure that they can be successfully reused, without being able to understand what the workflows aim to achieve or to re-enact them. To gain an understanding of the workflow, and how it may be used and repurposed for their needs, scientists require access to additional resources such as annotations describing the workflow, datasets used and produced by the workflow, and provenance traces recording workflow executions. In this article, we present a novel approach to the preservation of scientific workflows through the application of research objects-aggregations of data and metadata that enrich the workflow specifications. Our approach is realised as a suite of ontologies that support the creation of workflow-centric research objects. Their design was guided by requirements elicited from previous empirical analyses of workflow decay and repair. The ontologies developed make use of and extend existing well known ontologies, namely the Object Reuse and Exchange (ORE) vocabulary, the Annotation Ontology (AO) and the W3C PROV ontology (PROVO). We illustrate the application of the ontologies for building Workflow Research Objects with a case-study that investigates Huntington's disease, performed in collaboration with a team from the Leiden University Medial Centre (HG-LUMC). Finally we present a number of tools developed for creating and managing workflow-centric research objects. (C) 2015 The Authors. Published by Elsevier B.V.", "paper_title": "Using a suite of ontologies for preserving workflow-centric research objects", "paper_id": "WOS:000366563500002"}