{"auto_keywords": [{"score": 0.04888338488077779, "phrase": "smc"}, {"score": 0.017082379480285063, "phrase": "regional_fusion"}, {"score": 0.01061167562769471, "phrase": "high-resolution_palmprint_recognition"}, {"score": 0.006215744444280169, "phrase": "region-to-region_comparison"}, {"score": 0.004721162131188487, "phrase": "spectral_minutiae_representation"}, {"score": 0.0045903243893123105, "phrase": "novel_method"}, {"score": 0.004564593196155079, "phrase": "minutiae-based_fingerprint_recognition"}, {"score": 0.004413193567592802, "phrase": "low_computational_complexity"}, {"score": 0.0043029342321223825, "phrase": "minutiae_sets"}, {"score": 0.004171891198117439, "phrase": "full-to-full_palmprint_matching"}, {"score": 0.00397714507836836, "phrase": "main_reasons"}, {"score": 0.003728000957725218, "phrase": "smaller_regions"}, {"score": 0.0036245864938417964, "phrase": "spectral_minutiae-based_palmprint_matching"}, {"score": 0.0032570218602237773, "phrase": "anatomic_cues"}, {"score": 0.003175556211659149, "phrase": "region-to-region_palmprint_comparison"}, {"score": 0.003018668521745676, "phrase": "score_level"}, {"score": 0.0029681091946289757, "phrase": "different_regional_comparisons"}, {"score": 0.002766375783665791, "phrase": "spectral_minutiae"}, {"score": 0.002735392281320413, "phrase": "public_high-resolution_palmprint_database"}, {"score": 0.0027200305495826797, "phrase": "thupalmlab."}, {"score": 0.0026820015810254004, "phrase": "automatic_segmentation"}, {"score": 0.00257831812581194, "phrase": "complex_smc"}, {"score": 0.0024786330057813204, "phrase": "interdigital_regions"}, {"score": 0.0024577772550219332, "phrase": "thenar_region"}, {"score": 0.002403013783293044, "phrase": "significant_performance_improvements"}, {"score": 0.002271372252250557, "phrase": "human_examiners"}, {"score": 0.0022145052062614514, "phrase": "prior_knowledge"}, {"score": 0.0021651504858015364, "phrase": "segmentation_process"}, {"score": 0.0021049977753042253, "phrase": "forensic_science"}], "paper_keywords": [""], "paper_abstract": "The spectral minutiae representation (SMC) has been recently proposed as a novel method to minutiae-based fingerprint recognition, which is invariant to minutiae translation and rotation and presents low computational complexity. As high-resolution palmprint recognition is also mainly based on minutiae sets, SMC has been applied to palmprints and used in full-to-full palmprint matching. However, the performance of that approach was still limited. As one of the main reasons for this is the much bigger size of a palmprint compared with a fingerprint, the authors propose a division of the palmprint into smaller regions. Then, to further improve the performance of spectral minutiae-based palmprint matching, in this work the authors present anatomically inspired regional fusion while using SMC for palmprints. Firstly, the authors consider three regions of the palm, namely interdigital, thenar and hypothenar, which have inspiration in anatomic cues. Then, the authors apply SMC to region-to-region palmprint comparison and study regional discriminability when using the method. After that, the authors implement regional fusion at score level by combining the scores of different regional comparisons in the palm with two fusion methods, that is, sum rule and logistic regression. The authors evaluate region-to-region comparison and regional fusion based on spectral minutiae matching on a public high-resolution palmprint database, THUPALMLAB. Both manual segmentation and automatic segmentation are performed to obtain the three palm regions for each palm. Essentially using the complex SMC, the authors obtain results on region-to-region comparison which show that the hypothenar and interdigital regions outperform the thenar region. More importantly, the authors achieve significant performance improvements by regional fusion using regions segmented both manually and automatically. One main advantage of the approach the authors took is that human examiners can segment the palm into the three regions without prior knowledge of the system, which makes the segmentation process easy to be incorporated in protocols such as in forensic science.", "paper_title": "Regional fusion for high-resolution palmprint recognition using spectral minutiae representation", "paper_id": "WOS:000346562500007"}