{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "user_satisfaction"}, {"score": 0.010366870504631599, "phrase": "anfis_method"}, {"score": 0.004772593750252861, "phrase": "evidential_reasoning-based_methodology"}, {"score": 0.004627244470096107, "phrase": "competitive_advantages"}, {"score": 0.004466519142879166, "phrase": "satisfaction_level"}, {"score": 0.004311352359122141, "phrase": "users'_perspective"}, {"score": 0.004106725110985659, "phrase": "customer_attributes"}, {"score": 0.0037925389501636975, "phrase": "highly_non-linear"}, {"score": 0.0035806300393050926, "phrase": "traditional_linear_methods"}, {"score": 0.0030942116765996426, "phrase": "non-linear_relation"}, {"score": 0.0029602552900111433, "phrase": "uncertain_information"}, {"score": 0.002685558057339722, "phrase": "evidential_reasoning"}, {"score": 0.0025578967205807843, "phrase": "justification_purpose"}, {"score": 0.0024579623598183355, "phrase": "comparison_results"}, {"score": 0.0024148072010311615, "phrase": "brb"}, {"score": 0.002351485871160907, "phrase": "human_biases"}, {"score": 0.0021906130276146325, "phrase": "brb_method"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["User satisfaction", " Belief rule base", " Evidential reasoning", " ANFIS", " Subjectivity", " Incompleteness"], "paper_abstract": "For the sake of gaining competitive advantages, it is important to evaluate the satisfaction level of a product or service from the users' perspective. This can be done by investigating the relationship among customer attributes (customer requirements) and design attributes (product configurations). However, such relationship would be highly non-linear in nature. In this regard, many approaches have been proposed over traditional linear methods. Particularly, the Adaptive Neuro-Fuzzy Inference System (ANFIS) method has been prevalently utilized in modeling such vague and complex relationship among these attributes and evaluating user satisfaction towards certain products or services. Despite the fact that the ANFIS method can explicitly model the non-linear relation among these attributes, it may be restricted if uncertain information can be observed due to subjectivity and incompleteness. To overcome these limitations, a belief rule base (BRB) approach with evidential reasoning (ER) is applied in this paper. For justification purpose, both the ANFIS and BRB methods are applied to the same case. Comparison results indicate that the BRB is capable of minimizing the human biases in evaluating user satisfaction and rectifying the inappropriateness associated with the ANFIS method. Also, the BRB method can generate more rational and informative evaluation results. (C) 2014 Elsevier B.V. All rights reserved.", "paper_title": "Evaluation of user satisfaction using evidential reasoning-based methodology", "paper_id": "WOS:000340341400009"}