{"auto_keywords": [{"score": 0.03218820616066921, "phrase": "faster_polynomial-space"}, {"score": 0.0318905812178829, "phrase": "exponential-space_algorithms"}, {"score": 0.0047013405841819025, "phrase": "exact_exponential-time_algorithms"}, {"score": 0.004212157020917929, "phrase": "single_algorithm"}, {"score": 0.003939565240409143, "phrase": "branching_rule"}, {"score": 0.003773680962197766, "phrase": "branch-and-reduce_algorithm"}, {"score": 0.0036669760226536977, "phrase": "reduction_rules"}, {"score": 0.0036147562669032957, "phrase": "resulting_algorithms"}, {"score": 0.003413183361838603, "phrase": "good_upper_bounds"}, {"score": 0.0032382660477699695, "phrase": "currently_fastest_exact_exponential-time_algorithms"}, {"score": 0.002928765962664163, "phrase": "minimum_weight"}, {"score": 0.002778604641920052, "phrase": "possible_weight_sums"}, {"score": 0.002598543802992702, "phrase": "domatic_number"}, {"score": 0.0022509365210787993, "phrase": "partial_dominating_set"}, {"score": 0.002166349705365602, "phrase": "well-studied_parameterised_problem"}], "paper_keywords": ["Exact exponential algorithm", " Dominating set", " NP-hard", " Branching", " Inclusion/Exclusion"], "paper_abstract": "Inclusion/exclusion and measure and conquer are two central techniques from the field of exact exponential-time algorithms that recently received a lot of attention. In this paper, we show that both techniques can be used in a single algorithm. This is done by looking at the principle of inclusion/exclusion as a branching rule. This inclusion/exclusion-based branching rule can be combined in a branch-and-reduce algorithm with traditional branching rules and reduction rules. The resulting algorithms can be analysed using measure and conquer allowing us to obtain good upper bounds on their running times. In this way, we obtain the currently fastest exact exponential-time algorithms for a number of domination problems in graphs. Among these are faster polynomial-space and exponential-space algorithms for #Dominating Set and Minimum Weight Dominating Set (for the case where the set of possible weight sums is polynomially bounded), and a faster polynomial-space algorithm for Domatic Number. This approach is also extended in this paper to the setting where not all requirements in a problem need to be satisfied. This results in faster polynomial-space and exponential-space algorithms for Partial Dominating Set, and faster polynomial-space and exponential-space algorithms for the well-studied parameterised problem k-Set Splitting and its generalisation k-Not-All-Equal Satisfiability.", "paper_title": "Inclusion/Exclusion Meets Measure and Conquer", "paper_id": "WOS:000335752000010"}