{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "aggregated_proof"}, {"score": 0.0046328364646343375, "phrase": "identity_theft"}, {"score": 0.004408729661992651, "phrase": "others'_identities"}, {"score": 0.00433645229352341, "phrase": "stolen_identifiers"}, {"score": 0.004126623209579942, "phrase": "increasing_attention"}, {"score": 0.003478321590910367, "phrase": "multifactor_verification"}, {"score": 0.0031669873302916, "phrase": "aggregate_signatures"}, {"score": 0.003030247482854539, "phrase": "aggregate_zero-knowledge_proof"}, {"score": 0.0028993944292191433, "phrase": "resultant_signatures"}, {"score": 0.0022994427535192492, "phrase": "storage_requirements"}, {"score": 0.002261666793030715, "phrase": "existing_efficient_zkpk_techniques"}, {"score": 0.002163930783583212, "phrase": "zero_knowledge"}, {"score": 0.0021049977753042253, "phrase": "multiple_secrets"}], "paper_keywords": ["Privacy", " security"], "paper_abstract": "The problem of identity theft, that is, the act of impersonating others' identities by presenting stolen identifiers or proofs of identities, has been receiving increasing attention because of its high financial and social costs. In this paper, we address the problem of verification of such identifiers and proofs of identity. Our approach is based on the concept of privacy preserving multifactor verification of such identifiers and proofs achieved by the development of a new cryptographic primitive, which uses aggregate signatures on commitments that are then used for aggregate zero-knowledge proof of knowledge (ZKPK) protocols. The resultant signatures are very short and the ZKPs are succinct and efficient. We prove the security of our scheme under the co-gap Diffie-Hellman (co-GDH) assumption for groups with bilinear maps. Our cryptographic scheme is an improvement in terms of the performance, flexibility, and storage requirements than the existing efficient ZKPK techniques that may be used to prove under zero knowledge and the knowledge of multiple secrets.", "paper_title": "Multifactor Identity Verification Using Aggregated Proof of Knowledge", "paper_id": "WOS:000278814200002"}