{"auto_keywords": [{"score": 0.04845849110410783, "phrase": "energy_balance_routing"}, {"score": 0.015064563133242049, "phrase": "wireless_sensor_networks"}, {"score": 0.00782811266086134, "phrase": "wsn"}, {"score": 0.005623811914606474, "phrase": "communication_sensors"}, {"score": 0.005575661345803421, "phrase": "sensor_load"}, {"score": 0.005410340279908904, "phrase": "new_algorithm"}, {"score": 0.004814973016326262, "phrase": "mouse"}, {"score": 0.0045726187330434025, "phrase": "purpose_-_the_purpose"}, {"score": 0.003967021436047945, "phrase": "routing_protocols"}, {"score": 0.0038825121288253435, "phrase": "minimum_total_energy_consumption"}, {"score": 0.003751011827704279, "phrase": "data_redundancy"}, {"score": 0.0037188360359702182, "phrase": "data_aggregation"}, {"score": 0.003608370966473902, "phrase": "energy_consumption"}, {"score": 0.003353521531649663, "phrase": "whole_network"}, {"score": 0.003130077012135034, "phrase": "remaining_energy"}, {"score": 0.0026116610153271943, "phrase": "mouse_colony_optimization"}, {"score": 0.002589260707549176, "phrase": "sa"}, {"score": 0.0025230952890994236, "phrase": "better_performance"}, {"score": 0.002437525632451029, "phrase": "appointed_times"}, {"score": 0.002375253757224999, "phrase": "main_limitation"}, {"score": 0.002132420504803564, "phrase": "energy_balance_routing_notion"}, {"score": 0.0021049977753042253, "phrase": "communication_energy_cost"}], "paper_keywords": ["Energy", " Sensors", " Intelligent networks", " Cybernetics", " Systems analysis"], "paper_abstract": "Purpose - The purpose of this paper is to search an energy balance routing in the wireless sensor networks (WSN) and lengthen the life of the networks. Design/methodology/approach - To save energy in the WSN, some routing protocols search routing with the minimum total energy consumption of the network, and others reduce data redundancy by data aggregation. But if the distribution of energy consumption was not even, the energy of some nodes would be exhausted rapidly and thus the whole network would break down. Thus, an energy balance routing notion, including communication energy cost of the routing, remaining energy of communication sensors and sensor load have been involved. Then a new algorithm, mouse colony optimization and simulated annealing (SA), is advanced to solve the problem of energy balance routing in the network. Findings - The energy balance routing, based on mouse colony optimization and SA, performs well and yields better performance than other congener algorithms. Research limitations/implications - The appointed times of the algorithm is the main limitation which increase the complexity of the algorithm. Practical implications - A very useful routing in wireless sensor networks. Originality/value - The new approach of energy balance routing notion, including communication energy cost of the routing, remaining. energy of communication sensors and sensor load. The new algorithm, mouse colony optimization algorithm, simulated mice action, was proposed to solve the energy balance routing of the network.", "paper_title": "Mouse colony optimization and simulated annealing algorithm for energy balance routing in wireless sensor networks", "paper_id": "WOS:000267416500015"}