{"auto_keywords": [{"score": 0.048483033890383845, "phrase": "questionnaire_survey"}, {"score": 0.041882654269095175, "phrase": "proposed_model"}, {"score": 0.00481495049065317, "phrase": "collective_message"}, {"score": 0.0044237033788643715, "phrase": "questionnaire_delivery"}, {"score": 0.0043863636475983845, "phrase": "questionnaire_collection"}, {"score": 0.004349337717774093, "phrase": "questionnaire_analysis"}, {"score": 0.004064117897000019, "phrase": "automatic_questionnaire_survey_model"}, {"score": 0.003813669883040509, "phrase": "structured_components"}, {"score": 0.0037654565082218595, "phrase": "component_characteristics"}, {"score": 0.003670843919846253, "phrase": "related_online_message"}, {"score": 0.003548368289666932, "phrase": "relationship_model"}, {"score": 0.003503497128638099, "phrase": "online_message"}, {"score": 0.00337224813954299, "phrase": "derived_model"}, {"score": 0.0029191527226078286, "phrase": "proposed_methodology"}, {"score": 0.002762423953243486, "phrase": "online_population"}, {"score": 0.0025919830205975215, "phrase": "automatic_questionnaire_survey"}, {"score": 0.0024527887711828485, "phrase": "yahoo"}, {"score": 0.0022530375696567136, "phrase": "experimental_result_question"}, {"score": 0.0021049977753042253, "phrase": "proposed_method"}], "paper_keywords": ["Questionnaire survey", " Artificial Neural Network", " Question answering system"], "paper_abstract": "As to implement questionnaire survey, a researcher usually has to spend much time and efforts on questionnaire delivery, questionnaire collection and questionnaire analysis. In order to enhance efficiency and effectiveness in questionnaire survey, this research develops an automatic questionnaire survey model. In the proposed model, the questions in the questionnaires can be converted into structured components and the component characteristics can be obtained from the related online message. By using the Artificial Neural Network method, the relationship model between the online message and questionnaire questions can be derived and the derived model can be used to acquire the answers to the questions from the message highly related to the questions. Moreover, distributions of the answers can be visually depicted. By utilizing the proposed methodology, researchers can efficiently realize the results about their questionnaire derived from the online population. On the basis of the proposed model, this research develops a platform for automatic questionnaire survey and analysis. Moreover, real-world questions and message, Yahoo! Answers, were used to evaluate feasibility and performance of the proposed model and platform. According to the experimental result question answers can be effectively acquired from the message highly related to the questions. The proposed method and platform can assist people quickly and effectively accomplish questionnaire survey. (C) 2015 Elsevier Ltd. All rights reserved.", "paper_title": "Automatic questionnaire survey by using the collective message over the Internet", "paper_id": "WOS:000366769500006"}