{"auto_keywords": [{"score": 0.04580340075872884, "phrase": "triangular_mesh"}, {"score": 0.00481495049065317, "phrase": "fast_marching_method"}, {"score": 0.004782977628406988, "phrase": "outdoor_motion_planning"}, {"score": 0.004595529592539951, "phrase": "outdoor_environments"}, {"score": 0.0045196012587080114, "phrase": "proposed_method"}, {"score": 0.00448958076531243, "phrase": "fast_marching"}, {"score": 0.004327981760540394, "phrase": "smooth_trajectory"}, {"score": 0.004130660282810338, "phrase": "square_one"}, {"score": 0.0037624955853577786, "phrase": "weight_matrix_w"}, {"score": 0.003614895644619489, "phrase": "presented_experiments"}, {"score": 0.0033256684464109242, "phrase": "difficulty_map"}, {"score": 0.0032058286587989234, "phrase": "propagation_speed"}, {"score": 0.0031109870010753663, "phrase": "best_path"}, {"score": 0.00306973798582805, "phrase": "task_requirements"}, {"score": 0.0027404283412788997, "phrase": "wave_front_propagation_speed"}, {"score": 0.0026152965305133373, "phrase": "matrix_w"}, {"score": 0.0024792523879679836, "phrase": "experimental_part"}, {"score": 0.0022279798606617356, "phrase": "robot_avoidance"}, {"score": 0.0021476098263617954, "phrase": "other's_position"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Outdoor path planning", " Fast marching", " Robotics"], "paper_abstract": "In this paper, a new path planning method for robots used in outdoor environments is presented. The proposed method applies Fast Marching to a 3D surface represented by a triangular mesh to calculate a smooth trajectory from one point to another. The method uses a triangular mesh instead of a square one since this kind of grid adapts better to 3D surfaces. The novelty of this approach is that, before running the algorithm, the method calculates a weight matrix W based on the information extracted from the 3D surface characteristics. In the presented experiments these features are the height, the spherical variance, and the gradient of the surface. This matrix can be viewed as a difficulty map situated over the 3D surface and is used to limit the propagation speed of the Fast Marching wave in order to find the best path depending on the task requirements, e.g., the least energy consumption path, the fastest path, or the most plain terrain. The algorithm also gives the speed for the robot, which depends on the wave front propagation speed. The results presented in this paper show how, by varying this matrix W, the paths obtained are different. Moreover, as it is shown in the experimental part, this algorithm is also useful for calculating paths for climbing robots in much more complex environments. Finally, at the end of the paper, it is shown that this algorithm can also be used for robot avoidance when two robots approach each other, and they know each other's position. (C) 2012 Elsevier B.V. All rights reserved.", "paper_title": "Application of the fast marching method for outdoor motion planning in robotics", "paper_id": "WOS:000315754700004"}