{"auto_keywords": [{"score": 0.050078510687870906, "phrase": "curriculum_learning"}, {"score": 0.04355650471129556, "phrase": "rnnlms"}, {"score": 0.009477070486049058, "phrase": "training_data"}, {"score": 0.007924649535715813, "phrase": "general_data"}, {"score": 0.007318337599859651, "phrase": "implicit_interpolation"}, {"score": 0.006417002363990837, "phrase": "language_model"}, {"score": 0.00604463672891265, "phrase": "sub-domain-adapted_rnnlms"}, {"score": 0.005267719859806551, "phrase": "target_sub-domain"}, {"score": 0.0047386923107107645, "phrase": "language_model_adaptation"}, {"score": 0.004719816332271661, "phrase": "recurrent_neural_network_language_models"}, {"score": 0.0045441856999319675, "phrase": "language_modeling"}, {"score": 0.0044990584725586764, "phrase": "speech_recognition"}, {"score": 0.004454377387615279, "phrase": "established_machine_learning_approach"}, {"score": 0.0044277810648955624, "phrase": "better_models"}, {"score": 0.004262970907120943, "phrase": "learning_process"}, {"score": 0.004187049198138107, "phrase": "curriculum_learning_methods"}, {"score": 0.004128931146992107, "phrase": "key_insights"}, {"score": 0.00406349363450001, "phrase": "rnnlms_model_language"}, {"score": 0.004039221742250308, "phrase": "continuous_space"}, {"score": 0.003999089046152065, "phrase": "word-dependency_information"}, {"score": 0.003983147392614224, "phrase": "arbitrarily_long_distances"}, {"score": 0.0038810583785936505, "phrase": "relatively_little_training_data"}, {"score": 0.003729065012001506, "phrase": "language_models"}, {"score": 0.0034911335714333507, "phrase": "specific_data"}, {"score": 0.003287988322068593, "phrase": "sub-domain-specific_data"}, {"score": 0.003248795676943496, "phrase": "extensive_set"}, {"score": 0.0031277316566463978, "phrase": "within-domain_adaptation_challenge"}, {"score": 0.003065830998810144, "phrase": "specific_sub-domains"}, {"score": 0.002686821995335494, "phrase": "target_data"}, {"score": 0.0026654155072292707, "phrase": "test_time"}, {"score": 0.0025763194101399898, "phrase": "sub-domain_information"}, {"score": 0.0025557910636968663, "phrase": "training_time"}, {"score": 0.0024506642262508735, "phrase": "existing_model"}, {"score": 0.0024311346712789553, "phrase": "large_set"}, {"score": 0.002406940912781076, "phrase": "smaller_amount"}, {"score": 0.002169132543304098, "phrase": "conventional_interpolation"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Recurrent neural networks", " Language models", " Curriculum learning", " Latent Dirichlet allocation", " Topics", " Socio-situational setting"], "paper_abstract": "This paper addresses the issue of language model adaptation for Recurrent Neural Network Language Models (RNNLMS), which have recently emerged as a state-of-the-art method for language modeling in the area of speech recognition. Curriculum learning is an established machine learning approach that achieves better models by applying a curriculum, i.e., a well-planned ordering of the training data, during the learning process. Our contribution is to demonstrate the importance of curriculum learning methods for adapting RNNLMS and to provide key insights on how they should be applied. RNNLMS model language in a continuous space and can theoretically exploit word-dependency information over arbitrarily long distances. These characteristics give RNNLMS the ability to learn patterns robustly with relatively little training data, implying that they are well suited for adaptation. In this paper, we focus on two related challenges facing language models: within-domain adaptation and limited-data within-domain adaptation. We propose three types of curricula that start with general data, i.e., characterizing the domain as a whole, and move towards specific data, i.e., characterizing the sub-domain targeted for adaptation. Effectively, these curricula result in a model that can be considered to represent an implicit interpolation between general data and sub-domain-specific data. We carry out an extensive set of experiments that investigates how adapting RNNLMS using curriculum learning can improve their performance. Our first set of experiments addresses the within-domain adaptation challenge, i.e., creating models that are adapted to specific sub-domains that are part of a larger, heterogeneous domain of speech data. Under this challenge, all training data is available to the system at the time when the language model is trained. First, we demonstrate that curriculum learning can be used to create effective sub-domain-adapted RNNLMS. Second, we show that a combination of sub-domain-adapted RNNLMS can be used if the sub-domain of the target data is unknown at test time. Third, we explore the potential of applying combinations of sub-domain-adapted RNNLMS to data for which sub-domain information is unknown at training time and must be inferred. Our second set of experiments addresses limited-data within-domain adaptation, i.e., adapting an existing model trained on a large set of data using a smaller amount of data from the target sub-domain. Under this challenge, data from the target sub-domain is not available at the time when the language model is trained, but rather becomes available little by little over time. We demonstrate that the implicit interpolation carried out by applying curriculum learning methods to RNNLMS outperforms conventional interpolation and has the potential to make more of less adaptation data. (C) 2014 Elsevier Ltd. All rights reserved.", "paper_title": "Recurrent neural network language model adaptation with curriculum learning", "paper_id": "WOS:000353093600007"}