{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "autonomous_social_robot"}, {"score": 0.004134508282135594, "phrase": "proper_behaviors"}, {"score": 0.0035010071030752883, "phrase": "learning_algorithm"}, {"score": 0.003358368814209542, "phrase": "traditional_q-learning"}, {"score": 0.003281643474564305, "phrase": "reduced_state_space"}, {"score": 0.0032514447965530323, "phrase": "collateral_effects"}, {"score": 0.0030476702431093687, "phrase": "first_part"}, {"score": 0.00288317238346065, "phrase": "learning_session_durations"}, {"score": 0.0026042472337367015, "phrase": "second_part"}, {"score": 0.002418453525649304, "phrase": "resulting_behaviors"}, {"score": 0.002266765479420981, "phrase": "real_interaction"}, {"score": 0.0022355167967736326, "phrase": "real_world"}, {"score": 0.0021049977753042253, "phrase": "natural_behaviors"}], "paper_keywords": ["autonomy", " behavior", " decision making", " motivational behavior", " motivations", " reinforcement learning", " social robot"], "paper_abstract": "In this study, an autonomous social robot is living in a laboratory where it can interact with several items (people included). Its goal is to learn by itself the proper behaviors in order to maintain its well-being at as high a quality as possible. Several experiments have been conducted to test the performance of the system. The Object Q-Learning algorithm has been implemented in the robot as the learning algorithm. This algorithm is a variation of the traditional Q-Learning because it considers a reduced state space and collateral effects. The comparison of the performance of both algorithms is shown in the first part of the experiments. Moreover, two mechanisms intended to reduce the learning session durations have been included: Well-Balanced Exploration and Amplified Reward. Their advantages are justified in the results obtained in the second part of the experiments. Finally, the behaviors learned by our robot are analyzed. The resulting behaviors have not been preprogrammed. In fact, they have been learned by real interaction in the real world and are related to the motivations of the robot. These are natural behaviors in the sense that they can be easily understood by humans observing the robot.", "paper_title": "Learning Behaviors by an Autonomous Social Robot with Motivations", "paper_id": "WOS:000341137600002"}