{"auto_keywords": [{"score": 0.041671336282502434, "phrase": "explorer"}, {"score": 0.00481495049065317, "phrase": "interprocedural_control_flow_properties"}, {"score": 0.00462773520532301, "phrase": "general_framework"}, {"score": 0.004027751272984522, "phrase": "java_programs"}, {"score": 0.003794954883650141, "phrase": "feasible_callstack_configurations"}, {"score": 0.0037450707321601963, "phrase": "regular_expressions"}, {"score": 0.0033465923623290034, "phrase": "automaton_a"}, {"score": 0.002387415084371473, "phrase": "observer_design_pattern"}, {"score": 0.002356119208192197, "phrase": "java"}, {"score": 0.0022492129111567824, "phrase": "performance_bugs"}, {"score": 0.002175913488493802, "phrase": "inter-component_communication"}], "paper_keywords": ["Algorithms", " Languages", " Program analysis", " Demand-driven analysis", " points-to analysis", " query language", " control flow properties"], "paper_abstract": "This paper describes a general framework-and its implementation in a tool called EXPLORER-for statically answering a class of interprocedural control flow queries about Java programs. EXPLORER allows users to formulate queries about feasible callstack configurations using regular expressions, and it employs a precise, demand-driven algorithm for answering such queries. Specifically, EXPLORER constructs an automaton A that is iteratively refined until either the language accepted by A is empty (meaning that the query has been refuted) or until no further refinement is possible based on a precise, context-sensitive abstraction of the program. We evaluate EXPLORER by applying it to three different program analysis tasks, namely, (1) analysis of the observer design pattern in Java, (2) identification of a class of performance bugs, and (3) analysis of inter-component communication in Android applications. Our evaluation shows that EXPLORER is both efficient and precise.", "paper_title": "EXPLORER : Query- and Demand-Driven Exploration of Interprocedural Control Flow Properties", "paper_id": "WOS:000367256500030"}