{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "n-detection_test_sets"}, {"score": 0.004550029253278477, "phrase": "defect_detection"}, {"score": 0.004448169552315403, "phrase": "uniform_value"}, {"score": 0.0037109446302945903, "phrase": "four-way_bridging_faults"}, {"score": 0.0034867406208212146, "phrase": "benchmark_circuits"}, {"score": 0.0034086028336466688, "phrase": "bridging_faults"}, {"score": 0.0031665087019813244, "phrase": "significantly_lower_bridging_fault_coverage"}, {"score": 0.0027170943110836425, "phrase": "low_bridging_fault_coverage"}, {"score": 0.002495521662819317, "phrase": "conventional_one-detection_test_set"}, {"score": 0.002398382089724878, "phrase": "simplified_n-detection_test_generation_strategy"}, {"score": 0.0022661190184053628, "phrase": "higher_numbers"}], "paper_keywords": ["Bridging faults", " full-scan circuits", " n-detection test sets", " stuck-at faults", " test generation"], "paper_abstract": "The use of n-detection test sets increases the likelihood of defect detection. With a uniform value of n for all the target faults, the expectation is that defects across the circuit will be covered uniformly. This paper demonstrates that this may not be the case by considering the four-way bridging faults detected by n-detection test sets for single stuck-at faults in benchmark circuits. Partitioning the bridging faults into subsets according to their dominated line, the results show that certain subsets have significantly lower bridging fault coverage than others. Thus, certain defect sites are significantly less covered than others. This paper also shows that it is possible to predict which subsets will have low bridging fault coverage based on the numbers of detections of single stuck-at faults under a conventional one-detection test set. This observation leads to a simplified n-detection test generation strategy. It also points to the possibility of using higher numbers of detections for certain single stuck-at faults, or targeting other fault models only at the sites that are expected to be less covered.", "paper_title": "Non-Uniform Coverage by n-Detection Test Sets", "paper_id": "WOS:000307125500021"}