{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "service_aggregation"}, {"score": 0.04960770684597511, "phrase": "cloud_computing"}, {"score": 0.004605258779434384, "phrase": "new_model"}, {"score": 0.0042336638794732255, "phrase": "cost-effective_and_time-efficient_way"}, {"score": 0.003969784439380027, "phrase": "service_providers"}, {"score": 0.0038727120021750973, "phrase": "tremendous_opportunities"}, {"score": 0.0036133077234252633, "phrase": "personal_information"}, {"score": 0.003455765987713262, "phrase": "governmental_information"}, {"score": 0.0034047882921717913, "phrase": "full_benefits"}, {"score": 0.0032241994368246065, "phrase": "privacy_concerns"}, {"score": 0.003038066486989815, "phrase": "privacy_issues"}, {"score": 0.00263129148531588, "phrase": "security_game"}, {"score": 0.002442693254693416, "phrase": "distinct_property"}, {"score": 0.002394719113232821, "phrase": "service_provider"}, {"score": 0.0021049977753042253, "phrase": "john_wiley"}], "paper_keywords": ["service aggregation", " cloud computing", " privacy", " re-encryption"], "paper_abstract": "Cloud computing has increasingly become a new model in the world of computing, and more businesses are moving to the cloud. As a cost-effective and time-efficient way to develop new applications and services, service aggregation in cloud computing empowers all service providers and consumers and creates tremendous opportunities in various industry sectors. However, it also poses various challenges to the privacy of personal information as well as the confidentiality of business and governmental information. The full benefits of service aggregation in cloud computing would only be enjoyed if the privacy concerns are addressed properly. In this paper, we investigate the privacy issues in service aggregation in a cloudenvironment and propose a privacy preserving protocol that is suitable for this environment. To demonstrate the security of our system, we construct a security game called IND-P3SAC-CPA and prove the security of the protocol accordingly. Our protocol has a distinct property that allows any service provider to obtain only the queried data under its conspiracy with the cloud. Additionally, the efficiency and various extensions are also discussed. Copyright (c) 2011 John Wiley & Sons, Ltd.", "paper_title": "Privacy preserving protocol for service aggregation in cloud computing", "paper_id": "WOS:000301047600006"}