{"auto_keywords": [{"score": 0.04191502614130607, "phrase": "real_protocols"}, {"score": 0.03921187042196234, "phrase": "previous_work"}, {"score": 0.00481495049065317, "phrase": "practical_password_recovery"}, {"score": 0.0045591142048535165, "phrase": "practical_password_recovery_attacks"}, {"score": 0.004476878957065829, "phrase": "response_authentication_protocols"}, {"score": 0.00315561677959372, "phrase": "off-line_computations"}, {"score": 0.002757365657304833, "phrase": "challengel"}, {"score": 0.002727401256030298, "phrase": "password"}, {"score": 0.0022234280592615756, "phrase": "intermediate_chaining_variables"}, {"score": 0.0022072611570187334, "phrase": "observed_hash_values"}, {"score": 0.0021437580456873584, "phrase": "short_local_collision"}], "paper_keywords": ["challenge and response", " prefix", " hybrid", " password recovery attack", " local collision", " hash function", " MD4"], "paper_abstract": "In this paper, we present practical password recovery attacks against two challenge and response authentication protocols using MD4. For attacks on protocols, the number of queries is one of the most important factors because the opportunity where an attacker can ask queries is very limited in real protocols. When responses are computed as MD4(Password parallel to Challenge), which is called prefix approach, previous work needs to ask 2(37) queries to recover a password. Asking 2(37) queries in real protocols is almost impossible. In our attack, to recover up to 8-octet passwords, we only need 1 time the amount of eavesdropping, 17 queries, and 2(34) MD4 off-line computations. To recover up to 12-octet passwords, we only need 2(10) times the amount of eavesdropping, 2(10) queries, and 2(41) off-line MD4 computations. When responses are computed as MD4(Password parallel to Challengel parallel to Password), which is called hybrid approach. previous work needs to ask 2(63) queries, while in our attack, up to 8-octet passwords are practically recovered by 28 times the amount of eavesdropping. 28 queries, and 2(39) off-line MD4 computations. Our idea is guessing a part of passwords so that we can simulate values of intermediate chaining variables from observed hash values. This enables us to use a short local collision that occurs with a very high probability, and thus the number of queries becomes practical.", "paper_title": "Practical Password Recovery Attacks on MD4 Based Prefix and Hybrid Authentication Protocols", "paper_id": "WOS:000274505900010"}