{"auto_keywords": [{"score": 0.04377726042564795, "phrase": "multimedia_electronic_advertisements"}, {"score": 0.008517046581828615, "phrase": "multimedia_electronic_advertisement"}, {"score": 0.007214149165729503, "phrase": "multi-path_and_multi-seed_dissemination_approach"}, {"score": 0.00481495049065317, "phrase": "digital_signage"}, {"score": 0.004736973212570135, "phrase": "variable_and_abundant_multimedia_visual_and_audio_expressions"}, {"score": 0.004379828513102091, "phrase": "major_trend"}, {"score": 0.00433711346313652, "phrase": "future_advertising"}, {"score": 0.004062755992847139, "phrase": "enormous_amount"}, {"score": 0.00398387063819657, "phrase": "electronic_advertising"}, {"score": 0.003507023579658917, "phrase": "peer-to-peer_network_structure"}, {"score": 0.003306559295382181, "phrase": "cluster's_locality"}, {"score": 0.0032742770692989766, "phrase": "electronic_advertisements"}, {"score": 0.003210652026669616, "phrase": "specific_cluster"}, {"score": 0.003107337317471694, "phrase": "seed_concept"}, {"score": 0.0030369955065974222, "phrase": "entire_multimedia_electronic_advertisement"}, {"score": 0.002910545717767559, "phrase": "optimal_multi-path_routing"}, {"score": 0.0028821186265508597, "phrase": "guoliang_xue"}, {"score": 0.002844646030750337, "phrase": "peer-to-peer-like_multiple_multi-path_framework"}, {"score": 0.0026907324647716395, "phrase": "node's_bandwidth"}, {"score": 0.0024311346712789553, "phrase": "transmission_status"}, {"score": 0.0024152714799789547, "phrase": "variable_number"}, {"score": 0.002307083221755957, "phrase": "different_set-up_parameters"}, {"score": 0.002262209824105154, "phrase": "experimental_results"}, {"score": 0.002232779081720735, "phrase": "key_determining_factor"}, {"score": 0.0022182072857447684, "phrase": "transmission_time"}, {"score": 0.0021049977753042253, "phrase": "multi-seed_approach"}], "paper_keywords": ["Digital signage", " Electronic advertisement", " Multi-path", " Multi-seed", " Peer-to-peer"], "paper_abstract": "With the fact that digital signage are characterized for the variable and abundant multimedia visual and audio expressions and exhibit advantages of multiplicity, locality, real-time, segmentation, and existence, they have been predicted to emerge as the major trend in the future advertising in various surveys. Focused on the characteristics of disseminating the multimedia electronic advertisements through the network, there will be an enormous amount of data transmitted and various electronic advertising distributed in accordance with the regions. To specifically address these needs, we will propose a multi-path, multi-seed dissemination approach suitable for the delivery of the multimedia electronic advertisements. In this paper, within a peer-to-peer network structure, the network cluster will be first formed in accordance with the locality. Based on each cluster's locality, the electronic advertisements designated for dissemination into a specific cluster can then be determined. We then apply the seed concept formed by BitTorrent to segment the entire multimedia electronic advertisement into myriad seeds. At the same time, this paper adopts the Optimal Multi-Path Routing proposed by Guoliang Xue to design a peer-to-peer-like multiple multi-path framework, followed by the distribution of myriad seeds into each node within the cluster. Each node's bandwidth will also be utilized to complete the re-transmission of the multimedia electronic advertisement for achieving the objective of establishing multimedia electronic advertisement on each node. The NCTUns Network Simulator and Emulator was utilized to simulate the transmission status for variable number of node. The approach proposed by this manuscript can be applied to different set-up parameters and data size. The experimental results indicate that the key determining factor of transmission time under the multi-path and multi-seed dissemination approach is the data size. Transmitting the same data size under a multi-path and multi-seed approach does not increase the transmission time as the number of nodes increase. Simulations demonstrate that the multi-path and multi-seed dissemination approach is suitable for the delivery of the multimedia electronic advertisements.", "paper_title": "A novel method for delivering multimedia e-advertisement data base on use multi-path and multi-seed peer-to-peer-like approach", "paper_id": "WOS:000330475700006"}