{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "hybrid_approach"}, {"score": 0.009706632095082749, "phrase": "robocup"}, {"score": 0.004769702911065878, "phrase": "multi-agent_learning"}, {"score": 0.004549734943142138, "phrase": "multi-agent_learning_system"}, {"score": 0.004299064805926241, "phrase": "complicated_system_behavior"}, {"score": 0.004258644418211771, "phrase": "multiple_agents"}, {"score": 0.0037133478610481994, "phrase": "robocup_robots"}, {"score": 0.003643807817480753, "phrase": "human_soccer_players"}, {"score": 0.0032838979278935814, "phrase": "better_strategy"}, {"score": 0.0028093921138602606, "phrase": "cbr-ga."}, {"score": 0.0027437235598539904, "phrase": "pre-defined_knowledge"}, {"score": 0.0027050595279115015, "phrase": "complicated_mathematical_basis"}, {"score": 0.002281376328251423, "phrase": "proposed_method"}, {"score": 0.002196609505859369, "phrase": "rcbr-ga_multi-agent_learning_system"}], "paper_keywords": ["Intelligent agent", " Case-base reasoning"], "paper_abstract": "This study proposes a hybrid approach to construct a multi-agent learning system that is applied to RoboCup (Robot world cup tournament) soccer game. RoboCup competitive games involve the complicated system behavior of multiple agents, which makes it a popular research domain in recent years. The goal of RoboCup is to promote AI and robotics, and some researchers even hope that RoboCup robots can eventually defeat human soccer players. A hybrid approach called the Case Based Reasoning-Genetic Algorithm (CBR-GA) was used to provide a better strategy for robots in their planning under all kinds of conditions and to store experiences learned during the game for further use. In addition, the Rule Based Reasoning (RBR) method was integrated to improve the defect of CBR-GA. Using the hybrid approach without pre-defined knowledge and a complicated mathematical basis, robots can learn and accumulate experience to become smarter. The robots not only learn how to score but also figure out how to avoid making same mistakes. Finally, the effectiveness of this proposed method was verified by implementing it in the RCBR-GA multi-agent learning system and by making comparisons with other learning approaches to prove its superiority.", "paper_title": "A HYBRID APPROACH FOR MULTI-AGENT LEARNING SYSTEMS", "paper_id": "WOS:000293548600008"}