{"auto_keywords": [{"score": 0.031984515148229434, "phrase": "analytical_code"}, {"score": 0.00481495049065317, "phrase": "induction_heating"}, {"score": 0.00477513738640734, "phrase": "non_magnetic_billets"}, {"score": 0.004735651915966323, "phrase": "purpose_-_low_electrical_resistivity_metal_billets"}, {"score": 0.004412881870378388, "phrase": "transverse_dc_magnetic_field"}, {"score": 0.0043401761815767, "phrase": "superconductive_coil"}, {"score": 0.0042864307215634756, "phrase": "main_drawback"}, {"score": 0.004061088450663783, "phrase": "adequate_refrigerating_system"}, {"score": 0.003721735062704032, "phrase": "lower_cost"}, {"score": 0.0034967818541774844, "phrase": "permanent_magnets"}, {"score": 0.003424850089214916, "phrase": "inner_part"}, {"score": 0.0033824008297657494, "phrase": "ferromagnetic_frame"}, {"score": 0.0032717489668326275, "phrase": "new_induction_system"}, {"score": 0.0031254704616199614, "phrase": "electromagnetic_solution"}, {"score": 0.0026796495639791426, "phrase": "superconductive_coils"}, {"score": 0.0025704485156071463, "phrase": "good_agreement"}, {"score": 0.002424984362388813, "phrase": "aluminum_billets"}, {"score": 0.002259346051668556, "phrase": "steady-state_condition"}, {"score": 0.0021049977753042253, "phrase": "automatic_design_process"}], "paper_keywords": ["Numerical method", " Analytical method", " Induction heating", " Permanent magnets"], "paper_abstract": "Purpose - Low electrical resistivity metal billets can be heated by the currents induced by the rotation of the billet itself inside a transverse DC magnetic field produced by a superconductive coil. The main drawback of this approach is related to cost of installation that requires an adequate refrigerating system. The purpose of this paper is to propose a more convenient solution, which allows the same high efficiency to be achieved at lower cost. In this solution, the billet is kept still and a series of permanent magnets, positioned in the inner part of a ferromagnetic frame, is rotated. Design/methodology/approach - Some results of the new induction system are shown. These results are obtained applying for the electromagnetic solution both an FE commercial code and an analytical method. The analytical code is developed because several parameters of the system need to be optimized. Findings - The performance of the solution presented is comparable with those of the system with superconductive coils. The results of the two methods applied are in good agreement; thus the analytical code is validated. Originality/value - A new solution for the induction heating of aluminum billets is presented. The analytical code developed requires a very short computational time, also because it gives directly the steady-state condition of the system and, for this reason, it can be conveniently applied to an automatic design process.", "paper_title": "A new high efficiency technology for the induction heating of non magnetic billets", "paper_id": "WOS:000297779400009"}