{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "optimal_swap_edges"}, {"score": 0.04684814051146254, "phrase": "shortest-path_tree"}, {"score": 0.004255902303152008, "phrase": "point-of-failure_shortest-path_rerouting_service"}, {"score": 0.004011867299107537, "phrase": "shortest_path"}, {"score": 0.0038846843242954935, "phrase": "failed_link"}, {"score": 0.003066945490483524, "phrase": "shortest_detour"}, {"score": 0.002969628818856786, "phrase": "highly_efficient_serial_solutions"}, {"score": 0.0025962029048520324, "phrase": "distributed_protocol"}, {"score": 0.0025273383208209922, "phrase": "swap_edges"}, {"score": 0.0022574539115388054, "phrase": "constant_amount"}, {"score": 0.0021049977753042253, "phrase": "long_messages"}], "paper_keywords": ["fault-tolerant routing", " point of failure rerouting", " shortest path spanning tree", " weighted graphs", " distributed algorithms"], "paper_abstract": "We consider the problem of computing the optimal swap edges of a shortest-path tree. This problem arises in designing systems that offer point-of-failure shortest-path rerouting service in presence of a single link failure: if the shortest path is not affected by the failed link, then the message will be delivered through that path; other-wise, the system will guarantee that, when the message reaches the node where the failure has occurred, the message will then be re-routed through the shortest detour to its destination. There exist highly efficient serial solutions for the problem, but unfortunately because of the structures they use, there is no known (nor foreseeable) efficient distributed implementation for them. A distributed protocol exists only for finding swap edges, not necessarily optimal ones. We present two simple and efficient distributed algorithms for computing the optimal swap edges of a shortest-path tree. One algorithm uses messages containing a constant amount of information, while the other is tailored for systems that allow long messages. The amount of data transferred by the protocols is the same and depends on the structure of the shortestpath spanning-tree; it is no more, and sometimes significantly less, than the cost of constructing the shortest-path tree.", "paper_title": "Point-of-failure shortest-path rerouting: Computing the optimal swap edges distributively", "paper_id": "WOS:000235508800037"}