{"auto_keywords": [{"score": 0.046530101197985334, "phrase": "symbolic_data_analysis"}, {"score": 0.02837307886243617, "phrase": "pure_assignment"}, {"score": 0.004814976950417537, "phrase": "kolmogorov-smirnov"}, {"score": 0.004778088905211055, "phrase": "binary_decision_tree"}, {"score": 0.004705206179790976, "phrase": "interval_valued_variables"}, {"score": 0.004633429997452688, "phrase": "information_technology_development"}, {"score": 0.004597951649247307, "phrase": "data_sets"}, {"score": 0.00442457549952546, "phrase": "new_units"}, {"score": 0.003882356585452982, "phrase": "initial_classical_variables"}, {"score": 0.0035399770257915466, "phrase": "algebraic_structure"}, {"score": 0.003202944392720772, "phrase": "kolmogorov-smirnov's_binary_splitting_criterion"}, {"score": 0.003070166825722112, "phrase": "test_selection"}, {"score": 0.003034916887102753, "phrase": "decision_tree_induction"}, {"score": 0.002909084545999271, "phrase": "explanatory_variables"}, {"score": 0.002788454815865172, "phrase": "different_possible_orders"}, {"score": 0.0027564303939865476, "phrase": "interval_values"}, {"score": 0.002474674704809152, "phrase": "classical_criteria"}, {"score": 0.0021625417261202603, "phrase": "probabilistic_method"}, {"score": 0.0021049977753042253, "phrase": "komogorov-smirnov"}], "paper_keywords": [""], "paper_abstract": "With the information technology development, data sets often contain a very large number of observations. Symbolic data analysis treats new units that are underlying concepts on the given data base or found by clustering. In this way, it is possible to reduce the size of the data set to be processed by transforming the initial classical variables into variables called symbolic variables. In symbolic data analysis, the values of the variables can be, among others, intervals. The algebraic structure of these variables leads us to adapt criteria to be able to study them. In this paper, we propose the extension of the Kolmogorov-Smirnov's binary splitting criterion to interval data. This criterion is used as a test selection metric for decision tree induction. For this criterion, the values taken by the explanatory variables have to be ordered. We have been interested in different possible orders of these interval values. We present some results using the pure assignment in order to examine the quality and the precision of this criterion. We compare this criterion to some classical criteria (Gini and entropy) in the case of pure assignment. An application in the case where the variable to be explained is a correlation is presented. We end this paper with a probabilistic method of assignment using the criterion of Komogorov-Smirnov.", "paper_title": "The criterion of Kolmogorov-Smirnov for binary decision tree: Application to interval valued variables", "paper_id": "WOS:000241848800003"}