{"auto_keywords": [{"score": 0.007099116296569868, "phrase": "information_technology"}, {"score": 0.004579147045265106, "phrase": "patient_care_quality"}, {"score": 0.0034813964296826973, "phrase": "limited_empirical_data"}, {"score": 0.0032955848190195343, "phrase": "extant_literature"}, {"score": 0.0031917943932454314, "phrase": "capability_management"}, {"score": 0.0030491497463386924, "phrase": "nomological_model"}, {"score": 0.002926212333939311, "phrase": "risk_management"}, {"score": 0.0028731719610706214, "phrase": "hospital_performance"}, {"score": 0.002769950045729965, "phrase": "survey_data"}, {"score": 0.0026220103561723066, "phrase": "hospitals'_readiness"}, {"score": 0.0021537217025910356, "phrase": "high-velocity_environment"}, {"score": 0.0021049977753042253, "phrase": "technological_turbulence"}], "paper_keywords": ["IT governance", " IT capability", " power and politics", " health care", " risk management", " IT value creation"], "paper_abstract": "Intense pressure to control costs and improve patient care quality is driving hospitals to increasingly look to information technology (IT) for solutions. As IT investment and IT capability have grown in hospitals, the need to manage IT resources aggressively has also increased. The rise in complexity and sophistication of the IT capability in hospitals has also increased the importance of IT governance in these organizations. Yet, there is limited empirical data about the antecedents and consequences of IT governance. We draw upon extant literature related to power and politics and capability management to propose, operationalize, and empirically examine a nomological model that explains and predicts IT governance and its ensuing impact on risk management and IT contribution to hospital performance. We empirically tests our hypotheses based on survey data gathered from 164 CIOs of US hospitals. The results have implications for hospitals' readiness and predisposition for IT governance, as their structural and relational mechanisms can affect IT governance and, indirectly, IT value creation. A contribution of this study is that it is one of the first to empirically examine antecedents to IT governance and its impact on IT performance in a high-velocity environment that is riddled with technological turbulence. Journal of Information Technology (2012) 27, 156-177. doi: 10.1057/jit.2012.3", "paper_title": "An empirical examination of antecedents and consequences of IT governance in US hospitals", "paper_id": "WOS:000304441100012"}