{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "state-based_specifications"}, {"score": 0.022851728145032404, "phrase": "scenario-based_specifications"}, {"score": 0.0170939498657226, "phrase": "local_synthesis"}, {"score": 0.008490119172099535, "phrase": "synthesis_methods"}, {"score": 0.008213750533621573, "phrase": "global_synthesis"}, {"score": 0.008078930717083257, "phrase": "state-based_specification"}, {"score": 0.00477513738640734, "phrase": "scenario-based_specifications."}, {"score": 0.004619134710069517, "phrase": "user_requirements"}, {"score": 0.004449688143230257, "phrase": "system_design"}, {"score": 0.004322186889256224, "phrase": "increased_research_interest"}, {"score": 0.003615016816532732, "phrase": "whole_system"}, {"score": 0.0030231983220281836, "phrase": "improved_method"}, {"score": 0.00292426293067148, "phrase": "state_machines"}, {"score": 0.002805121439110729, "phrase": "novel_algorithm"}, {"score": 0.0027818804382539444, "phrase": "state_machine_execution"}, {"score": 0.0027133032795773697, "phrase": "operator_priority_analysis_method"}, {"score": 0.0023849523850778807, "phrase": "first_attempt"}, {"score": 0.0022782315534795516, "phrase": "insightful_results"}, {"score": 0.002249961956629804, "phrase": "experimental_comparison"}, {"score": 0.0021049977753042253, "phrase": "appropriate_synthesis_method"}], "paper_keywords": ["Scenarios", " state machines", " local synthesis", " global synthesis"], "paper_abstract": "The scenario-based specifications are popularly used to capture user requirements. The state-based specifications are very appropriate to capture system design. Recently, there has been increased research interest in connecting these two kinds of specifications, called synthesis. Synthesis is a way to automatically construct the state-based specifications from the scenario-based specifications. There are two kinds of synthesis methods: global synthesis and local synthesis. Global synthesis means constructing a state-based specification for the whole system from the scenario-based specifications, while local synthesis means constructing a state-based specification for each object in the system. The two different synthesis methods have different uses and need to be systematically compared. The contributions of this paper are twofold. Firstly, we propose an improved method supporting the global and the local synthesis of state machines (a kind of state-based specifications) by using a novel algorithm for state machine execution and an algorithm similar to operator priority analysis method, which can fully automate the process of synthesis. Our synthesis method also satisfies two important properties: completeness and soundness. Secondly, to the best of our knowledge, our work does the first attempt to systematically compare global synthesis with local synthesis, and shows some insightful results of the experimental comparison between the two kinds of synthesis methods, which are valuable for the practitioners to choose an appropriate synthesis method for the analysis and verification of the system.", "paper_title": "COMPARING AND IMPROVING THE SYNTHESIS OF STATE-BASED SPECIFICATIONS FROM SCENARIO-BASED SPECIFICATIONS", "paper_id": "WOS:000315689400001"}