{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "directional_relations"}, {"score": 0.049390246951185, "phrase": "directional_relation"}, {"score": 0.014579466505065322, "phrase": "spatial_query"}, {"score": 0.011054457622544209, "phrase": "extended_objects"}, {"score": 0.009993749661939017, "phrase": "statistical_model"}, {"score": 0.009433533996633972, "phrase": "small_components"}, {"score": 0.004780183091824403, "phrase": "spatial_objects"}, {"score": 0.004643594260262632, "phrase": "spatial_constraints"}, {"score": 0.0037087324991876727, "phrase": "conventional_definition"}, {"score": 0.003563651133299401, "phrase": "area_objects"}, {"score": 0.003424225677958491, "phrase": "existing_models"}, {"score": 0.0033262524445013303, "phrase": "approximate_representations"}, {"score": 0.0031272381208680613, "phrase": "unrealistic_impression"}, {"score": 0.0029830992938695007, "phrase": "new_model"}, {"score": 0.002918826667294298, "phrase": "extended_spatial_object"}, {"score": 0.0025059724686541263, "phrase": "statistical_property"}, {"score": 0.0022884433286785165, "phrase": "experimental_test"}, {"score": 0.0021049977753042253, "phrase": "human_beings"}], "paper_keywords": ["directional relation", " statistical approach", " distribution range", " median direction"], "paper_abstract": "Directional relation, as a kind of spatial constraints, has been recognized as being an important means for spatial query, analysis and reasoning. Directional relation is conventionally concerned with two point objects. However, in spatial query and analysis, there is also a need of directional relations between point and line, point and area, line and line, line and area, and area and area. Therefore, conventional definition of direction needs to be extended to include line and area objects (i.e. the so-called extended objects). Existing models for directional relation of extended objects make use of approximate representations (e.g. minimum bounding rectangles) of the extended objects so as to produce some results with unrealistic impression. In this paper, a statistical model is presented. In this new model, (1) an extended spatial object is decomposed into small components; (2) the directional relation between extended spatial objects is then determined by the directions between these small components which form a distribution; and (3) two measures (i.e. range and median direction) are utilized to describe the statistical property of the distribution. This statistical model is based upon the (extended) spatial objects themselves, instead of their approximate representations. An experimental test has been carried out and the result indicates that the directional relations computed from this model is very close to those perceived by human beings.", "paper_title": "A statistical model for directional relations between spatial objects", "paper_id": "WOS:000254184000004"}