{"auto_keywords": [{"score": 0.02246846748295755, "phrase": "chameleon"}, {"score": 0.005881746286433687, "phrase": "cure"}, {"score": 0.0038810583785936505, "phrase": "minimum_spanning_tree"}, {"score": 0.0037664981403399064, "phrase": "representative_points"}, {"score": 0.003611751858608048, "phrase": "predefined_criterion"}, {"score": 0.0034633412134999425, "phrase": "k_clusters"}, {"score": 0.003090351392502293, "phrase": "uci"}, {"score": 0.003053598205821532, "phrase": "overall_standard_deviation"}, {"score": 0.002945669860541221, "phrase": "euclidean_minimum_spanning_tree"}, {"score": 0.002262209824105154, "phrase": "color_clustering"}, {"score": 0.0021821915946356168, "phrase": "standard_minimum_spanning_tree_clustering_algorithm"}], "paper_keywords": ["Minimum spanning trees", " k-constrained clustering", " unconstrained clustering", " representative point sets", " standard deviation reduction"], "paper_abstract": "We propose two Euclidean minimum spanning tree based clustering algorithms - one a k-constrained, and the other an unconstrained algorithm. Our k-constrained clustering algorithm produces a k-partition of a set of points for any given k. The algorithm constructs a minimum spanning tree of a set of representative points and removes edges that satisfy a predefined criterion. The process is repeated until k clusters are produced. Our unconstrained clustering algorithm partitions a point set into a group a clusters by maximally reducing the overall standard deviation of the edges in the Euclidean minimum spanning tree constructed from a given point set, without prescribing the number of clusters. We present our experimental results comparing our proposed algorithms with k-means, X-means, CURE, Chameleon, and the Expectation-Maximization (EM) algorithm on both artificial data and benchmark data from the UCI repository. We also apply our algorithms to image color clustering and compare them with the standard minimum spanning tree clustering algorithm as well as CURE, Chameleon, and X-means.", "paper_title": "CLUSTERING WITH MINIMUM SPANNING TREES", "paper_id": "WOS:000288222700007"}