{"auto_keywords": [{"score": 0.04685104062438761, "phrase": "physical_and_biological_phenomena"}, {"score": 0.0048149647933165285, "phrase": "labview"}, {"score": 0.004743594110762319, "phrase": "mathematical_models"}, {"score": 0.0043804319008535555, "phrase": "real_experiment"}, {"score": 0.004167653403322565, "phrase": "software_program"}, {"score": 0.0038676325043529524, "phrase": "fifty-nine_students"}, {"score": 0.0037724857647796813, "phrase": "mathematical_methods"}, {"score": 0.003643185395780667, "phrase": "software_programs"}, {"score": 0.0034660938095219846, "phrase": "simulated_phenomena"}, {"score": 0.003397683082821229, "phrase": "adopted_strategies"}, {"score": 0.003029643234751066, "phrase": "simulated_phenomenon"}, {"score": 0.00239657981537094, "phrase": "software_development_phase"}, {"score": 0.0023609780669713288, "phrase": "different_strategies"}, {"score": 0.0023259039577313294, "phrase": "cognitive_styles"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["LabVIEW", " learning/teaching models", " simulation", " learning strategies", " cognitive style"], "paper_abstract": "Simulations make it possible to explore physical and biological phenomena, where conducting the real experiment is impracticable or difficult. The implementation of a software program describing and simulating a given physical situation encourages the understanding of a phenomenon it self. Fifty-nine students, enrolled at the Mathematical Methods for Engineers used LabVIEW to develop software programs able to simulate physical and biological phenomena. They reported on the simulated phenomena and on the adopted strategies for its planning and the development. The works produced by the students have been analyzed taking into account the understanding of the simulated phenomenon, and the used strategy in the planning and development of the software. We found out that the more the program works, the more students understand the phenomena they simulated. The analysis of the programs and of the methodology each student used in the software development phase showed the different strategies and the cognitive styles they used and the skills that the use of LabVIEW enables learners to acquire. (C) 2005 Elsevier Ltd. All rights reserved.", "paper_title": "Using LabVIEW for applying mathematical models in representing phenomena", "paper_id": "WOS:000247852800019"}