{"auto_keywords": [{"score": 0.04643184783658168, "phrase": "input_arguments"}, {"score": 0.041590199587873876, "phrase": "geometric_mean"}, {"score": 0.03370358732719261, "phrase": "powg"}, {"score": 0.029119390573275332, "phrase": "upowg"}, {"score": 0.00481495049065317, "phrase": "group_decision_making"}, {"score": 0.004014135205423942, "phrase": "pa_operator"}, {"score": 0.003536720212056521, "phrase": "powa_operator"}, {"score": 0.0032934951320964276, "phrase": "pa_and_pg_operators"}, {"score": 0.0032161835102640372, "phrase": "powa"}, {"score": 0.002971309306027602, "phrase": "uncertain_pg"}, {"score": 0.002607246047604476, "phrase": "numerical_values"}, {"score": 0.0025359354516609795, "phrase": "weighted_pg"}, {"score": 0.0025159206854716274, "phrase": "powg_operators"}, {"score": 0.0023801608396295374, "phrase": "multiplicative_preference_relations"}, {"score": 0.0023427323356117365, "phrase": "weighted_upg"}, {"score": 0.0021901023885734, "phrase": "uncertain_multiplicative_preference_relations"}, {"score": 0.0021049977753042253, "phrase": "internet-service_selection"}], "paper_keywords": ["Group decision making", " multiplicative preference relation", " power-average (PA) operator", " power-geometric (PG) operator", " uncertain multiplicative preference relation", " uncertain PG (UPG) operator"], "paper_abstract": "The power-average (PA) operator and the power-ordered-weighted-average (POWA) operator are the two nonlinear weighted-average aggregation tools whose weighting vectors depend on the input arguments. In this paper, we develop a powergeometric (PG) operator and its weighted form, which are on the basis of the PA operator and the geometric mean, and develop a power-ordered-geometric (POG) operator and a power-ordered-weighted-geometric (POWG) operator, which are on the basis of the POWA operator and the geometric mean, and study some of their properties. We also discuss the relationship between the PA and PG operators and the relationship between the POWA and POWG operators. Then, we extend the PG and POWG operators to uncertain environments, i.e., develop an uncertain PG (UPG) operator and its weighted form, and an uncertain power-ordered-weighted- geometric (UPOWG) operator to aggregate the input arguments taking the form of interval of numerical values. Furthermore, we utilize the weighted PG and POWG operators, respectively, to develop an approach to group decision making based on multiplicative preference relations and utilize the weighted UPG and UPOWG operators, respectively, to develop an approach to group decision making based on uncertain multiplicative preference relations. Finally, we apply both the developed approaches to broadband Internet-service selection.", "paper_title": "Power-Geometric Operators and Their Use in Group Decision Making", "paper_id": "WOS:000274217500008"}