{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "multi-perspective_requirements_specifications"}, {"score": 0.004610058444728656, "phrase": "multi-perspective_specifications"}, {"score": 0.0034366728236876016, "phrase": "detected_inconsistency"}, {"score": 0.0031845067058084613, "phrase": "merged_view"}, {"score": 0.0031329184724341592, "phrase": "specification_process"}, {"score": 0.002966900048034132, "phrase": "extent_disagreement"}, {"score": 0.0028249975318149468, "phrase": "central_role"}, {"score": 0.0026175952455594277, "phrase": "merging_operator"}, {"score": 0.0024788167298469455, "phrase": "combined_knowledge"}, {"score": 0.0023346234464901978, "phrase": "interesting_and_useful_orderings"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["viewpoints", " uncertainty", " inconsistency", " requirements specification", " merging"], "paper_abstract": "A major challenge for dealing with multi-perspective specifications, and more concretely, with merging of several descriptions or views is toleration of incompleteness and inconsistency: views may be inconclusive, and may have conflicts over the concepts being modeled. The desire of being able to tolerate both phenomena introduces the need to evaluate and quantify the significance of a detected inconsistency as well as to measure the degree of conflict and uncertainty of the merged view as the specification process evolves. We show in this paper to what extent disagreement and incompleteness are closely interrelated and play a central role to obtain a measure of the level of inconsistency and to define a merging operator whose aim is getting the model which best reflects the combined knowledge of all stakeholders. We will also propose two kinds of interesting and useful orderings among perspectives which are based on differences of behavior and inconsistency, respectively. (c) 2007 Elsevier B.V. All rights reserved.", "paper_title": "On the interplay between inconsistency and incompleteness in multi-perspective requirements specifications", "paper_id": "WOS:000253105400004"}