{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "closure_operators"}, {"score": 0.043849502004616694, "phrase": "infinitary_rewriting"}, {"score": 0.014633400626183275, "phrase": "transfinite_reductions"}, {"score": 0.004643839937761046, "phrase": "infinitary_term_rewriting"}, {"score": 0.004533142516832776, "phrase": "infinite_terms"}, {"score": 0.003898411343926653, "phrase": "transfinite_equivalence_proofs"}, {"score": 0.0034135407979996673, "phrase": "rewrite_reductions"}, {"score": 0.003352256019007896, "phrase": "equivalence_relations"}, {"score": 0.003117890043128058, "phrase": "underlying_closure_principles"}, {"score": 0.0029887957779347394, "phrase": "alternative_operators"}, {"score": 0.00291743479583421, "phrase": "alternative_notions"}, {"score": 0.0026485829604700833, "phrase": "abstraction_level"}, {"score": 0.002361236012575149, "phrase": "kahrs"}, {"score": 0.0021960024679620886, "phrase": "equational_model"}, {"score": 0.0021049977753042253, "phrase": "semantics-based_notions"}], "paper_keywords": [""], "paper_abstract": "Infinitary Term Rewriting allows to express infinite terms and transfinite reductions that converge to those terms. Underpinning the machinery of infinitary rewriting are closure operators on relations that facilitate the formation of transfinite reductions and transfinite equivalence proofs. The literature on infinitary rewriting has largely neglected to single out such closure operators, leaving them implicit in definitions of (transfinite) rewrite reductions, or equivalence relations. This paper unpicks some of those definitions, extracting the underlying closure principles used, as well as constructing alternative operators that lead to alternative notions of reduction and equivalence. A consequence of this unpicking is an insight into the abstraction level at which these operators can be defined. Some of the material in this paper already appeared in Kahrs (2010). The paper also generalises the notion of equational model for infinitary rewriting. This leads to semantics-based notions of equivalence that tie in with the equivalences constructed from the closure operators.", "paper_title": "Infinitary rewriting: closure operators, equivalences and models", "paper_id": "WOS:000316014300002"}