{"auto_keywords": [{"score": 0.02991257142277092, "phrase": "cobb-douglas_function"}, {"score": 0.009340713377700297, "phrase": "contest_success_function"}, {"score": 0.00783563428956275, "phrase": "proposed_model"}, {"score": 0.004682708592184678, "phrase": "emerging_attack_strategy"}, {"score": 0.004228016636379321, "phrase": "collaborating_attack"}, {"score": 0.00415019999222481, "phrase": "previous_models"}, {"score": 0.004054931951058077, "phrase": "potential_disharmonious_factors"}, {"score": 0.003943481134959376, "phrase": "real_world"}, {"score": 0.003644001325962353, "phrase": "mathematical_formulation"}, {"score": 0.0033515736929172644, "phrase": "collaborative_attack_effectiveness"}, {"score": 0.003096905353118796, "phrase": "applicable_cyber-warfare"}, {"score": 0.0030117065110966414, "phrase": "wired_network"}, {"score": 0.0029838294169759663, "phrase": "wireless_network"}, {"score": 0.002942495422585405, "phrase": "sensor_network"}, {"score": 0.002874870266177579, "phrase": "meaningful_connection"}, {"score": 0.002731500545019039, "phrase": "cyber-attack_scenario"}, {"score": 0.0025474193855847074, "phrase": "environmental_factor"}, {"score": 0.0022889103976458437, "phrase": "subsequent_discussion"}, {"score": 0.0021049977753042253, "phrase": "exogenous_variable"}], "paper_keywords": [""], "paper_abstract": "An emerging attack strategy, collaborative attack, is considered the next generation type of attack. There are only a few models quantifying the synergy of a collaborating attack. Further, previous models consider only positive effects regardless of potential disharmonious factors which are common in the real world. Contributions of this work are summarized as follows: first, this paper introduces a mathematical formulation measuring synergy which takes both positive and negative effects into consideration. This model can not only be applied in measuring collaborative attack effectiveness, but also be used to describe the synergy in other teamwork scenarios. The scenario of an applicable cyber-warfare can take place in a wired network, wireless network, or sensor network. Secondly, a meaningful connection between contest success function and Cobb-Douglas function is proposed and integrated in a cyber-attack scenario. Both the contest intensity of the contest success function and the sum of exponents of Cobb-Douglas function reflect an environmental factor regarding whether it encourages investing or not. Lastly, comparisons between the proposed model and the Cobb-Douglas function are also presented with a subsequent discussion of implications. The behavior of the proposed model is closer to reality and less coupled to another exogenous variable, contest intensity.", "paper_title": "A Cyber-Attack Synergy Model Considering Both Positive and Negative Impacts from Each Attacker", "paper_id": "WOS:000358908600001"}