{"auto_keywords": [{"score": 0.04558099031824587, "phrase": "digital_content_market"}, {"score": 0.028750577574613752, "phrase": "digital_content_market-space"}, {"score": 0.00481495049065317, "phrase": "e-business_model_development"}, {"score": 0.004777353034511615, "phrase": "european"}, {"score": 0.0045748683993128425, "phrase": "empirically_based_analysis"}, {"score": 0.004450568197899267, "phrase": "possible_future_evolution"}, {"score": 0.004415675459182871, "phrase": "internet_business_models"}, {"score": 0.003986103192038901, "phrase": "three-year_study"}, {"score": 0.003939296259436904, "phrase": "european_online_news_and_online_music_sectors"}, {"score": 0.0037133478610481994, "phrase": "european_online_news_and_music_sectors"}, {"score": 0.0035699363258657212, "phrase": "face-to-face_interviews"}, {"score": 0.003472845095323694, "phrase": "in-depth_case_studies"}, {"score": 0.003286486670483032, "phrase": "online_news"}, {"score": 0.003260690513595527, "phrase": "music_sectors"}, {"score": 0.0031845067058084583, "phrase": "business_models"}, {"score": 0.0031223774204093713, "phrase": "driving_forces"}, {"score": 0.0030494153169181334, "phrase": "finally_some_predictions"}, {"score": 0.002763261749602258, "phrase": "european_participants"}, {"score": 0.002242127152093798, "phrase": "first_major_empirical_evaluation"}, {"score": 0.0021049977753042253, "phrase": "e-business_model_evolution"}], "paper_keywords": ["worldwide web", " Internet", " electronic media", " music industry", " newspaper publishers", " Europe"], "paper_abstract": "Purpose - To provide an empirically based analysis and evaluation of the existing and possible future evolution of Internet business models within the digital content market, focusing particularly on the possibilities for cooperation and coopetition within this market-space. Design/methodology/approach - The paper is based on a three-year study of the European online news and online music sectors, comprising a set of preliminary, scene-setting case studies of a number of major players within the European online news and music sectors; a detailed, two-stage survey made up of online questionnaires and face-to-face interviews; and a small number of in-depth case studies. Findings - Provides a discussion of the changes taking place in the online news and music sectors, the evolution of the business models within them, the driving forces we have identified, and finally some predictions about what the future may hold for both these sectors. Research limitations/implications - The research is indicative, rather than general - being centred on European participants in two sectors of the digital content market-space in the period between May 2003 and August 2004. Practical implications - A rich evaluation of these two fast-moving digital content sectors, providing empirically based insights into the ways in which they are evolving and changing and into parallels with other, similar sectors of the digital content market. Originality/value - This paper is the first major empirical evaluation of the digital content market-space and offers practical assistance, as well as new theoretical insights on e-business model evolution in this area.", "paper_title": "The changing digital content landscape - An evaluation of e-business model development in European online news and music", "paper_id": "WOS:000236244000005"}