{"auto_keywords": [{"score": 0.049666636555871356, "phrase": "boolean_networks"}, {"score": 0.015719716506582538, "phrase": "function_perturbations"}, {"score": 0.004415857432588371, "phrase": "small_change"}, {"score": 0.004377806391261418, "phrase": "network_structure"}, {"score": 0.00415625929636759, "phrase": "network_stability"}, {"score": 0.0038613835226952117, "phrase": "network_behavior"}, {"score": 0.0033909518548844047, "phrase": "rule-based_structure"}, {"score": 0.0030428787018636147, "phrase": "network_state_transitions"}, {"score": 0.002990592465417758, "phrase": "analytical_approaches"}, {"score": 0.002766171878646582, "phrase": "network_characteristics"}, {"score": 0.0026718978608934077, "phrase": "judicious_change"}, {"score": 0.0023974563359295043, "phrase": "function_perturbation"}, {"score": 0.0023460397258997525, "phrase": "altered_observed_behavior"}, {"score": 0.002315719347244451, "phrase": "intervention_procedure"}, {"score": 0.0021511430180912164, "phrase": "identification_procedure"}, {"score": 0.0021049977753042253, "phrase": "drosophila_melanogaster_segmentation_polarity_gene_network"}], "paper_keywords": [""], "paper_abstract": "Motivation: A network is said to be robust relative to a certain network characteristic if a small change in network structure does not significantly affect the characteristic. From the perspective of network stability, robustness is desirable; however, from the perspective of intervention to exert influence on network behavior, it is undesirable. For Boolean networks, there are two fundamental types of robustness. One type pertains to perturbing the state of the network and the other to perturbing the rule-based structure. Results: This article explores the impact of function perturbations in Boolean networks from two aspects: (1) analysis: predict the impact on network state transitions and attractors via analytical approaches or identify a perturbation by observing its consequences; (2) synthesis: preserve or modify the network characteristics, especially attractors, by introducing a judicious change to the functions. The results are applied to achieve intervention that structurally alters the network to achieve a more favorable steady-state distribution and to identify the function perturbation that has led to altered observed behavior. The intervention procedure is applied to a WNT5A network to reduce the risk of metastasis in melanoma, and the identification procedure is applied to a Drosophila melanogaster segmentation polarity gene network to identify regulatory function perturbation.", "paper_title": "The impact of function perturbations in Boolean networks", "paper_id": "WOS:000247348300012"}