{"auto_keywords": [{"score": 0.04964156968469261, "phrase": "noisy_environments"}, {"score": 0.00481495049065317, "phrase": "anomalous_evolutions"}, {"score": 0.004750745497387322, "phrase": "logic"}, {"score": 0.004392565073466714, "phrase": "partially_known_and_dynamic_world"}, {"score": 0.0038981499110532273, "phrase": "wrong_information"}, {"score": 0.0035233696341819437, "phrase": "wrong_decisions"}, {"score": 0.00283870598459543, "phrase": "background_theory"}, {"score": 0.0026494723416072316, "phrase": "sensor_data"}, {"score": 0.002613163083407071, "phrase": "related_concept"}, {"score": 0.0025420267431501367, "phrase": "coherent_status"}, {"score": 0.0023725232579531273, "phrase": "anomaly_recovery_problems"}, {"score": 0.002255431275670053, "phrase": "transform_recovery_problems"}, {"score": 0.0022347698358650514, "phrase": "equivalent_inference_problems"}, {"score": 0.0022041312401435346, "phrase": "set_semantics"}, {"score": 0.0021049977753042253, "phrase": "available_answer"}], "paper_keywords": ["Logic programming", " Computational complexity", " Nonmonotonic reasoning"], "paper_abstract": "In systems where agents are required to interact with a partially known and dynamic world, sensors can be used to obtain knowledge about the environment. However, sensors may be unreliable, that is, they may deliver wrong information (due, e.g., to hardware or software malfunctioning) and, consequently, they may cause agents to take wrong decisions, which is a scenario that should be avoided. The paper considers the problem of reasoning in noisy environments in a setting where no (either certain or probabilistic) data is available in advance about the reliability of sensors. Therefore, assuming that each agent is equipped with a background theory encoding its general knowledge about the world, a concept of detecting an anomaly perceived in sensor data and the related concept of agent recovering to a coherent status of information are defined. In this context, the complexities of various anomaly detection and anomaly recovery problems are studied. Finally, rewriting algorithms are proposed that transform recovery problems into equivalent inference problems under answer set semantics, thereby making them effectively realizable on top of available answer set solvers.", "paper_title": "Detecting and repairing anomalous evolutions in noisy environments Logic programming formalization and complexity results", "paper_id": "WOS:000293630700001"}