{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "product_releases"}, {"score": 0.01557276120808942, "phrase": "chartwell_technology"}, {"score": 0.004713162564945179, "phrase": "incremental_software_development"}, {"score": 0.004265760046406154, "phrase": "different_skills"}, {"score": 0.004116440453049531, "phrase": "human_resources"}, {"score": 0.004029359223675788, "phrase": "varying_levels"}, {"score": 0.00398177607914381, "phrase": "different_tasks"}, {"score": 0.0038975324579167098, "phrase": "time_windows"}, {"score": 0.0038241409774349613, "phrase": "primary_goal"}, {"score": 0.003752126270661821, "phrase": "best_quality"}, {"score": 0.0036553070575015344, "phrase": "timely_manner"}, {"score": 0.0035279988538381535, "phrase": "np"}, {"score": 0.00331586317499377, "phrase": "mid-sized_or_large_problems"}, {"score": 0.0031920879236693256, "phrase": "similar_contexts"}, {"score": 0.0030802351224657673, "phrase": "two-phased_solution_approach"}, {"score": 0.0030438260342620692, "phrase": "integer_linear_programming"}, {"score": 0.003022186855664124, "phrase": "relaxed_version"}, {"score": 0.0030007010513605084, "phrase": "full_problem"}, {"score": 0.0029511579080222137, "phrase": "starting_point"}, {"score": 0.002909342017421165, "phrase": "reduced_search_space"}, {"score": 0.0028274743316389437, "phrase": "genetic_algorithm"}, {"score": 0.0026896953007096084, "phrase": "empirical_analysis"}, {"score": 0.0026705669656375197, "phrase": "proposed_solution_approach"}, {"score": 0.0026389874309088422, "phrase": "unfocused_search"}, {"score": 0.0024984517279573906, "phrase": "ufs."}, {"score": 0.002486589906779091, "phrase": "whole_method"}, {"score": 0.0024571805463127873, "phrase": "industrial_case_study"}, {"score": 0.002422346972350692, "phrase": "case_study"}, {"score": 0.002388006025267707, "phrase": "fs_method"}, {"score": 0.002304263635960015, "phrase": "acceptable_staffing_plans"}, {"score": 0.0022608057001451414, "phrase": "proven_quality"}, {"score": 0.0022340607507189735, "phrase": "manual_plans"}, {"score": 0.00216084253933833, "phrase": "varying_parameters"}, {"score": 0.0021049977753042253, "phrase": "john_wiley"}], "paper_keywords": [""], "paper_abstract": "Release planning for incremental software development assigns features to releases such that technical, resource, risk and budget constraints are met. Each feature offers a piece of functionality. A feature can be offered as part of a release only if all its necessary tasks are done before the given release date. These tasks require different skills. Staffing for product releases as considered in this paper is the process of assigning human resources from a given pool of developers who might have varying levels of skill to perform different tasks. In addition to that, we consider time windows of absence of the developers. The primary goal of staffing is to provide product releases of best quality where quality means offering the most attractive features to customers in a timely manner. We call the problem STAFF-PRO. The problem is known to be NP-complete. Consequently, we have to be satisfied with solutions that are sufficiently good, but not necessarily optimal in the case of mid-sized or large problems. Search-based methods relying on meta-heuristics have been proven to be successful in similar contexts. In this research, a focused search (FS) method is presented. This refers to a two-phased solution approach where Phase I applies integer linear programming to a relaxed version of the full problem. Its solution is used as a starting point to perform FS in a reduced search space in Phase 2. The search itself is conducted by a genetic algorithm. It generates a solution that fulfills all the stated resource and scheduling constraints and is of a proven degree of optimality. We performed an empirical analysis of the proposed solution approach by comparing FS and unfocused search (UFS) (without Phase 1) for a series of 200 test examples. On average, FS performs about 15% better than UFS. The whole method was applied as an industrial case study performed at Chartwell Technology. The case study demonstrates that application of the FS method to STAFF-PRO (i) allows a reduction in the time needed for generating acceptable staffing plans, (ii) generates plans of proven quality that are better than manual plans and (iii) supports the various types of re-planning necessary for varying parameters, budgets and resource. Copyright (C) 2008 John Wiley & Sons, Ltd.", "paper_title": "Optimized staffing for product releases and its application at Chartwell Technology", "paper_id": "WOS:000260587400004"}