{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "face_familiarity"}, {"score": 0.010105010433599623, "phrase": "human_perception"}, {"score": 0.006695292260638355, "phrase": "individual_groups"}, {"score": 0.004760518730536645, "phrase": "extended_nmf."}, {"score": 0.004618342952383313, "phrase": "important_cognitive_process"}, {"score": 0.00373474182086791, "phrase": "context-free_and_context-dependent_forms"}, {"score": 0.0035820833812158035, "phrase": "key_factors"}, {"score": 0.0032332256013507072, "phrase": "nonexclusive_groups"}, {"score": 0.0029629009627331355, "phrase": "nonnegative_matrix_factorization"}, {"score": 0.002940507659878428, "phrase": "nmf"}, {"score": 0.002798865807872575, "phrase": "subspace_representation"}, {"score": 0.0026438880533289893, "phrase": "proposed_method"}, {"score": 0.0025165151708122957, "phrase": "psychological_studies"}, {"score": 0.002459810433812049, "phrase": "subjective_evaluation"}, {"score": 0.0023952639120005193, "phrase": "proposed_measurement"}, {"score": 0.0023412849215629986, "phrase": "subjective_judgment"}, {"score": 0.002279841453843241, "phrase": "face_recognition_method"}, {"score": 0.002169968849836984, "phrase": "standard_feret_evaluation_protocols"}, {"score": 0.0021049977753042253, "phrase": "proposed_familiarity_measurement"}], "paper_keywords": ["Algorithms", " Design", " Human Factors", " NMF", " face familiarity", " face analysis", " face recognition"], "paper_abstract": "Getting familiar with a face is an important cognitive process in human perception of faces, but little study has been reported on how to objectively measure the degree of familiarity. In this article, a method is proposed to quantitatively measure the familiarity of a face with respect to a set of reference faces that have been seen previously. The proposed method models the context-free and context-dependent forms of familiarity suggested by psychological studies and accounts for the key factors, namely exposure frequency, exposure intensity and similar exposure, that affect human perception of face familiarity. Specifically, the method divides the reference set into nonexclusive groups and measures the familiarity of a given face by aggregating the similarities of the face to the individual groups. In addition, the nonnegative matrix factorization (NMF) is extended in this paper to learn a compact and localized subspace representation for measuring the similarities of the face with respect to the individual groups. The proposed method has been evaluated through experiments that follow the protocols commonly used in psychological studies and has been compared with subjective evaluation. Results have shown that the proposed measurement is highly consistent with the subjective judgment of face familiarity. Moreover, a face recognition method is devised using the concept of face familiarity and the results on the standard FERET evaluation protocols have further verified the efficacy of the proposed familiarity measurement.", "paper_title": "Measuring the Degree of Face Familiarity Based on Extended NMF", "paper_id": "WOS:000324114800002"}