{"auto_keywords": [{"score": 0.010158305842998613, "phrase": "imi"}, {"score": 0.007884651341962099, "phrase": "loop_d"}, {"score": 0.004941055159296744, "phrase": "thi"}, {"score": 0.00469545352928726, "phrase": "binding_interactions"}, {"score": 0.0044792964927609456, "phrase": "extracellular_domains"}, {"score": 0.004259638825837131, "phrase": "homomeric_receptor"}, {"score": 0.004166943227096525, "phrase": "molecular_dynamics"}, {"score": 0.004076256554327002, "phrase": "binding_mode"}, {"score": 0.003962541905291554, "phrase": "good_agreement"}, {"score": 0.003913021620260308, "phrase": "theoretical_results"}, {"score": 0.0038762863757919237, "phrase": "crystal_structures"}, {"score": 0.003839894670436311, "phrase": "corresponding_complexes"}, {"score": 0.0038158228131483854, "phrase": "ac-achbp"}, {"score": 0.003721029388906273, "phrase": "nachr_extracellular_ligand_binding_domain"}, {"score": 0.003418089698750318, "phrase": "lysine_residue"}, {"score": 0.003333143779627263, "phrase": "docking_results"}, {"score": 0.003149630099034765, "phrase": "experimental_neonicotinoid-ac-achbp_complexes"}, {"score": 0.0029113423551788264, "phrase": "md_results"}, {"score": 0.0028930745799089683, "phrase": "distinct_trends"}, {"score": 0.002838954179574289, "phrase": "average_interaction_energies"}, {"score": 0.0027858433744614767, "phrase": "indeed_better_affinity"}, {"score": 0.002716567128011818, "phrase": "honeybee_nachr."}, {"score": 0.0026657398039253008, "phrase": "tighter_contacts"}, {"score": 0.0026490090146527407, "phrase": "aromatic_residues"}, {"score": 0.0025831266474492308, "phrase": "binding_pocket"}, {"score": 0.002542782716137888, "phrase": "non-conserved_residue"}, {"score": 0.002471740959383183, "phrase": "van_der_waals_contacts"}, {"score": 0.0023951255255435272, "phrase": "direct_or_water_mediated_hydrogen-bond_interaction"}, {"score": 0.002313582249239217, "phrase": "electronegative_terminal_group"}], "paper_keywords": ["nAChRs", " Neonicotinoids", " Homology model", " Docking", " Molecular dynamics simulations"], "paper_abstract": "The binding interactions of two neonicotinoids, imidacloprid (IMI) and thiacloprid (THI) with the extracellular domains of cockroach and honeybee alpha 6 nicotinic acetylcholine receptor (nAChR) subunits in an homomeric receptor have been studied through docking and molecular dynamics (MD) simulations. The binding mode predicted for the two neonicotinoids is validated through the good agreement observed between the theoretical results with the crystal structures of the corresponding complexes with Ac-AChBP, the recognized structural surrogate for insects nAChR extracellular ligand binding domain. The binding site of the two insect alpha 6 receptors differs by only one residue of loop D, a serine residue (Ser83) in cockroach being replaced by a lysine residue (Lys108) in honeybee. The docking results show very close interactions for the two neonicotinoids with both alpha 6 nAChR models, in correspondence to the trends observed in the experimental neonicotinoid-Ac-AChBP complexes. However, the docking parameters (scores and energies) are not significantly different between the two insect alpha 6 nAChRs to draw clear conclusions. The MD results bring distinct trends. The analysis of the average interaction energies in the two insects alpha 6 nAChRs shows indeed better affinity of neonicotinoids bound to alpha 6 cockroach compared to honeybee nAChR. This preference is explained by tighter contacts with aromatic residues (Trp and Tyr) of the binding pocket. Interestingly, the non-conserved residue Lys108 of loop D of alpha 6 honeybee nAChR interacts through van der Waals contacts with neonicotinoids, which appear more favourable than the direct or water mediated hydrogen-bond interaction between the OH group of Ser83 of alpha 6 cockroach nAChR and the electronegative terminal group of the two neonicotinoids (nitro in IMI and cyano in THI). Finally, in both insects nAChRs, THI is consistently found to bind more favourably than IMI. (C) 2014 Elsevier Inc. All rights reserved.", "paper_title": "Imidacloprid and thiacloprid neonicotinoids bind more favourably to cockroach than to honeybee alpha 6 nicotinic acetylcholine receptor: Insights from computational studies", "paper_id": "WOS:000349587100001"}