{"auto_keywords": [{"score": 0.04580913817161026, "phrase": "sparse_cutting-planes"}, {"score": 0.010612387000973441, "phrase": "sparse_inequalities"}, {"score": 0.008605882061742627, "phrase": "integer_hull"}, {"score": 0.004567990533989851, "phrase": "arbitrary_polytopes"}, {"score": 0.0043512358455892, "phrase": "mixed-integer_programing"}, {"score": 0.004144723510171449, "phrase": "linear_programs"}, {"score": 0.0032629585038738856, "phrase": "sparse_cuts"}, {"score": 0.003171615440419782, "phrase": "general_upper_bounds"}, {"score": 0.0029482691362918423, "phrase": "polynomially_many_vertices"}, {"score": 0.0029126002350975634, "phrase": "half_sparsity"}, {"score": 0.0027295084882654917, "phrase": "random_polytopes"}, {"score": 0.002674681176379472, "phrase": "upper_bounds"}, {"score": 0.0021049977753042253, "phrase": "original_polyhedron"}], "paper_keywords": ["Integer programming", " Cutting-planes", " Sparsity"], "paper_abstract": "In this paper, we study how well one can approximate arbitrary polytopes using sparse inequalities. Our motivation comes from the use of sparse cutting-planes in mixed-integer programing (MIP) solvers, since they help in solving the linear programs encountered during branch-&-bound more efficiently. However, how well can we approximate the integer hull by just using sparse cutting-planes? In order to understand this question better, given a polyope (e.g. the integer hull of a MIP), let be its best approximation using cuts with at most k non-zero coefficients. We consider as a measure of the quality of sparse cuts.In our first result, we present general upper bounds on which depend on the number of vertices in the polytope. Our bounds imply that if has polynomially many vertices, using half sparsity already approximates it very well. Second, we present a lower bound on for random polytopes that show that the upper bounds are quite tight. Third, we show that for a class of hard packing IPs, sparse cutting-planes do not approximate the integer hull well, that is is large for such instances unless k is very close to n. Finally, we show that using sparse cutting-planes in extended formulations is at least as good as using them in the original polyhedron, and give an example where the former is actually much better.", "paper_title": "Approximating polyhedra with sparse inequalities", "paper_id": "WOS:000364528000014"}