{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "citation_networks"}, {"score": 0.004677372885331908, "phrase": "academic_publications"}, {"score": 0.004643594260262632, "phrase": "citation_count"}, {"score": 0.0038877961007492646, "phrase": "different_years"}, {"score": 0.0035766032751309677, "phrase": "simple_citation_models"}, {"score": 0.0034366728236876047, "phrase": "simple_three_parameter_citation_network_model"}, {"score": 0.0033748847621075536, "phrase": "correct_width"}, {"score": 0.003290237137651949, "phrase": "citation_network"}, {"score": 0.0032310733124059567, "phrase": "hep-th_section"}, {"score": 0.003115908199991072, "phrase": "data's_observed_'width"}, {"score": 0.0029722900280316216, "phrase": "recently_published_papers"}, {"score": 0.0029400959763737364, "phrase": "entire_network"}, {"score": 0.0027441220799352926, "phrase": "papers'_bibliographies"}, {"score": 0.0023990982005125763, "phrase": "citation_network_model"}, {"score": 0.0023135183406982414, "phrase": "new_publication"}, {"score": 0.002128067018576581, "phrase": "current_models"}], "paper_keywords": ["Complex networks", " Directed acyclic graphs", " Bibliometrics", " Citation networks"], "paper_abstract": "The distribution of the number of academic publications against citation count for papers published in the same year is remarkably similar from year to year. We characterise the shape of such distributions by a 'width', , associated with fitting a log-normal to each distribution, and find the width to be approximately constant for publications published in different years. This similarity is not surprising, after all, why would papers in a given year be cited more than another year? Nevertheless, we show that simple citation models fail to capture this behaviour. We then provide a simple three parameter citation network model which can reproduce the correct width over time. We use the citation network of papers from the hep-th section of arXiv to test our model. Our final model reproduces the data's observed 'width' when around 20 % of the citations in the model are made to recently published papers in the entire network ('global information'). The remaining 80 % of citations are made using the references from these papers' bibliographies ('local searches'). We note that this is consistent with other studies, though our motivation to achieve the above distribution with time is very different. Finally, we find that, in the citation network model, varying the number of papers referenced by a new publication is important as it alters the parameters in the model which are fitted to the data. This is not addressed in current models and needs further work.", "paper_title": "Modelling citation networks", "paper_id": "WOS:000365130100011"}