{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "near-perfect_phylogenetic_trees"}, {"score": 0.004564401713056939, "phrase": "perfect_phylogeny"}, {"score": 0.004362564831572539, "phrase": "evolutionary_tree"}, {"score": 0.004034649282040889, "phrase": "real_data"}, {"score": 0.00388800655625083, "phrase": "perfect_phylogeny_assumption"}, {"score": 0.0036104596826132965, "phrase": "optimal_phylogenies"}, {"score": 0.0035661605757956096, "phrase": "empirical_evidence"}, {"score": 0.0028202559386070873, "phrase": "previous_asymptotic_bounds"}, {"score": 0.002673223453963085, "phrase": "previous_work"}, {"score": 0.002461810159687652, "phrase": "real_data_sets"}, {"score": 0.0023624435546097658, "phrase": "far_superior_results"}, {"score": 0.002333421318779658, "phrase": "commonly_used_heuristic_method"}, {"score": 0.0022484715639779153, "phrase": "first_practical_phylogenetic_tree_reconstruction_algorithm"}, {"score": 0.0021224200236681498, "phrase": "data_sets"}, {"score": 0.0021049977753042253, "phrase": "biologically_meaningful_size"}], "paper_keywords": [""], "paper_abstract": "We consider the problem of reconstructing near-perfect phylogenetic trees using binary character states (referred to as BNPP). A perfect phylogeny assumes that every character mutates at most once in the evolutionary tree, yielding an algorithm for binary character states that is computationally efficient but not robust to imperfections in real data. A near-perfect phylogeny relaxes the perfect phylogeny assumption by allowing at most a constant number q of additional mutations. In this paper, we develop an algorithm for constructing optimal phylogenies and provide empirical evidence of its performance. The algorithm runs in time O((72n)(q)nm+nm(2)) where n is the number of taxa, m is the number of characters and n is the number of characters that share four gametes with some other character. This is fixed parameter tractable when q and kappa, are constants and significantly improves on the previous asymptotic bounds by reducing the exponent to q. Furthermore, the complexity of the previous work makes it impractical and in fact no known implementation of it exists. We implement our algorithm and demonstrate it on a selection of real data sets, showing that it substantially outperforms its worst-case bounds and yields far superior results to a commonly used heuristic method in at least one case. Our results therefore describe the first practical phylogenetic tree reconstruction algorithm that finds guaranteed optimal solutions while being easily implemented and computationally feasible for data sets of biologically meaningful size and complexity.", "paper_title": "Simple reconstruction of binary near-perfect phylogenetic trees", "paper_id": "WOS:000238389400107"}