{"auto_keywords": [{"score": 0.04813316316185016, "phrase": "fairmesh"}, {"score": 0.015719716506582538, "phrase": "physical_layer_capture"}, {"score": 0.01216910556513191, "phrase": "approximate_max-min_fairness"}, {"score": 0.004546252387071551, "phrase": "first_attempt"}, {"score": 0.004292508851051287, "phrase": "plc"}, {"score": 0.004197650347643135, "phrase": "practical_mesh_networks"}, {"score": 0.004170940184489072, "phrase": "existing_state-of-art_solutions"}, {"score": 0.003912974119795913, "phrase": "sending_rate"}, {"score": 0.003753882510162702, "phrase": "simple_cwmin_adjustment_algorithm"}, {"score": 0.003578307035551443, "phrase": "unfair_situation"}, {"score": 0.0031091037560494806, "phrase": "remedial_action"}, {"score": 0.0030794433253250476, "phrase": "key_strength"}, {"score": 0.002916618252808186, "phrase": "arbitrary_number"}, {"score": 0.0026079240853929555, "phrase": "negligible_control_overhead"}, {"score": 0.002485813299166851, "phrase": "different_notion"}, {"score": 0.002244040022860764, "phrase": "high_data_rates"}, {"score": 0.0022297330866277738, "phrase": "high_loss_rates"}, {"score": 0.0021526564019119466, "phrase": "good_fairness"}, {"score": 0.0021321008352473835, "phrase": "multi-hop_flow"}, {"score": 0.0021049977753042253, "phrase": "single-hop_flow"}], "paper_keywords": ["802.11 mesh network", " physical layer capture", " fairness"], "paper_abstract": "In this paper, we describe FairMesh, which is the first attempt at mitigating the unfairness arising from physical layer capture (PLC) in 802.11 mesh networks. In the presence of PLC, which is surprisingly common in practical mesh networks, existing state-of-art solutions either fail to correctly identify the sender that needs to be throttled or are too aggressive in reducing the sending rate. FairMesh is able to accurately detect unfairness quickly and employs a simple CWmin adjustment algorithm to achieve approximate max-min fairness. Our key insight is that the nodes that cause an unfair situation to arise and can act to remedy it are often distinct from the ones that can accurately assess the degree of unfairness. To the best of our knowledge, we are the first to decouple the detection and assessment of unfairness from the remedial action. A key strength of our approach is its simplicity, which makes it amenable for deployment in practical 802.11 mesh networks to allow an arbitrary number of flows to operate concurrently without modifications to the 802.11 MAC. We show via simulation and with experiments on a 20-node outdoor 802.11 wireless mesh testbed that FairMesh has many desirable properties. First, it is fully distributed and has negligible control overhead. Second, it achieves approximate max-min fairness, and can be modified to support a different notion of fairness (e.g., proportional fairness). Third, it can handle multiple (more than two) competing links and can scale up to mesh networks with tens of nodes. Fourth, it remains efficient under high data rates and high loss rates. Finally, FairMesh interacts well with TCP and maintains good fairness when a multi-hop flow competes with a single-hop flow.", "paper_title": "Mitigating Unfairness Due to Physical Layer Capture in Practical 802.11 Mesh Networks", "paper_id": "WOS:000345990600008"}