{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "professional_health_communication"}, {"score": 0.004445419749485783, "phrase": "public_consumer_health_information_website"}, {"score": 0.00436890075128947, "phrase": "consumer_and_ten_physician_question_threads"}, {"score": 0.004104132253183181, "phrase": "sentence_fragments"}, {"score": 0.004005537264228818, "phrase": "previous_lis_health_information_behaviour_research"}, {"score": 0.00395026016389782, "phrase": "computational_linguistics-based_theoretical_framework"}, {"score": 0.003802135020791801, "phrase": "pragmatics_level"}, {"score": 0.0036595438031512217, "phrase": "human_communication"}, {"score": 0.0035468507553681034, "phrase": "discourse_organization"}, {"score": 0.0035100601949451028, "phrase": "prevalent_rhetorical_relations"}, {"score": 0.00342568771304873, "phrase": "consumer_answers"}, {"score": 0.003140524241432171, "phrase": "physician_answers"}, {"score": 0.0031187606191012012, "phrase": "mainly_subject_matter_relations"}, {"score": 0.0027806165169981622, "phrase": "different_communicative_goals"}, {"score": 0.0027326751144684386, "phrase": "professional_health_information_sharing"}, {"score": 0.0024704333220467393, "phrase": "similar_topics"}, {"score": 0.0024533019565858073, "phrase": "diabetes_management"}, {"score": 0.0023529740798601015, "phrase": "healthy_behaviour"}, {"score": 0.002225542510652775, "phrase": "promising_approach"}, {"score": 0.0022101055924375725, "phrase": "information_behaviour_research"}, {"score": 0.0021569129153653777, "phrase": "lexico-semantic_level"}, {"score": 0.0021049977753042253, "phrase": "language_use"}], "paper_keywords": ["Health information seeking", " Information sharing", " Provision of information", " Information behaviour", " Internet discussion groups", " Diabetes", " Information use", " Pragmatic use of language", " Information exchange", " Internet"], "paper_abstract": "Purpose - In this paper the authors seek to compare lay (consumer) and professional (physician) discourse structures in answers to diabetes-related questions in a public consumer health information website. Design/methodology/approach - Ten consumer and ten physician question threads were aligned. They generated 26 consumer and ten physician answers, constituting a total dataset of 717 discourse units (in sentences or sentence fragments). The authors depart from previous LIS health information behaviour research by utilizing a computational linguistics-based theoretical framework of rhetorical structure theory, which enables research at the pragmatics level of linguistics in terms of the goals and effects of human communication. Findings - The authors reveal differences in discourse organization by identifying prevalent rhetorical relations in each type of discourse. Consumer answers included predominately (66 per cent) presentational rhetorical structure relations, those intended to motivate or otherwise help a user do something (e.g. motivation, concession, and enablement). Physician answers included mainly subject matter relations (64 per cent), intended to inform, or simply transfer information to a user (e.g. elaboration, condition, and interpretation). Research limitations/implications - The findings suggest different communicative goals expressed in lay and professional health information sharing. Consumers appear to be more motivating, or activating, and more polite (linguistically) than physicians in how they share information with consumers online in similar topics in diabetes management. The authors consider whether one source of information encourages adherence to healthy behaviour more effectively than another. Originality/value - Analysing discourse structure using rhetorical structure theory - is a novel and promising approach in information behaviour research, and one that traverses the lexico-semantic level of linguistic analysis towards pragmatics of language use.", "paper_title": "Discourse structure differences in lay and professional health communication", "paper_id": "WOS:000312362600006"}