{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "accurate_and_efficient_method"}, {"score": 0.004654826737377134, "phrase": "poisson-disk_distribution"}, {"score": 0.004350308086118336, "phrase": "image_sampling"}, {"score": 0.004205570965859848, "phrase": "multidimensional_monte_carlo_integration"}, {"score": 0.004085333687668526, "phrase": "procedural_object_placement_function"}, {"score": 0.0038364365168131586, "phrase": "higher_dimensional_space"}, {"score": 0.0035336109352157763, "phrase": "computer_graphics_applications"}, {"score": 0.0032389001343643064, "phrase": "brute-force_dart-throwing_algorithm"}, {"score": 0.002954361295811154, "phrase": "spatial_subdivision_data_structure"}, {"score": 0.002801166393333128, "phrase": "new_samples"}, {"score": 0.0025549840900344623, "phrase": "maximal_distributions"}, {"score": 0.0021049977753042253, "phrase": "available_physical_memory"}], "paper_keywords": ["Algorithms", " Performance", " Accurate Poisson-disk sampling", " dart throwing", " multidimensional sampling", " maximal sampling", " spatial subdivision"], "paper_abstract": "We present an accurate and efficient method to generate samples based on a Poisson-disk distribution. This type of distribution, because of its blue noise spectral properties, is useful for image sampling. It is also useful for multidimensional Monte Carlo integration and as part of a procedural object placement function. Our method extends trivially from 2D to 3D or to any higher dimensional space. We demonstrate results for up to four dimensions, which are likely to be the most useful for computer graphics applications. The method is accurate because it generates distributions with the same statistical properties of those generated with the brute-force dart-throwing algorithm, the archetype against which all other Poisson-disk sampling methods are compared. The method is efficient because it employs a spatial subdivision data structure that signals the regions of space where the insertion of new samples is allowed. The method has O(N log N) time and space complexity relative to the total number of samples. The method generates maximal distributions in which no further samples can be inserted at the completion of the algorithm. The method is only limited in the number of samples it can generate and the number of dimensions over which it can work by the available physical memory.", "paper_title": "Accurate Multidimensional Poisson-Disk Sampling", "paper_id": "WOS:000273318100008"}