{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "nsaid_administration"}, {"score": 0.03795733986962976, "phrase": "aia_patients"}, {"score": 0.004768104290288521, "phrase": "aspirin-intolerant_asthmatics"}, {"score": 0.004496402246090618, "phrase": "aspirin-induced_asthma"}, {"score": 0.004366387782457736, "phrase": "severe_inflammatory_disease"}, {"score": 0.00428179779071721, "phrase": "aspirin-intolerant_patients"}, {"score": 0.003959447096055027, "phrase": "mathematical_model"}, {"score": 0.003920891569777894, "phrase": "arachidonic_acid_metabolism"}, {"score": 0.0036792371574197826, "phrase": "safe_managing"}, {"score": 0.003130396338031522, "phrase": "experimentally_observed_threshold_doses"}, {"score": 0.002838319783373086, "phrase": "aia_populations"}, {"score": 0.002498873893632724, "phrase": "aspirin_or_ibuprofen_ingestion"}, {"score": 0.002356173823922118, "phrase": "analogue_doses"}, {"score": 0.002321787726770895, "phrase": "corresponding_times"}, {"score": 0.0021049977753042253, "phrase": "different_aspirin_and_ibuprofen_doses"}], "paper_keywords": ["Mathematical model", " Aspirin-induced asthma", " Non-steroidal anti-inflammatory drug", " Leukotrienes", " Prostaglandins"], "paper_abstract": "Aspirin-induced asthma (AIA) is a severe inflammatory disease, which affects aspirin-intolerant patients after ingestion of aspirin or other non-steroidal anti-inflammatory drugs (NSAIDs). In this article, a mathematical model describing arachidonic acid metabolism and its interaction with NSAIDs, is used to study the strategy for safe managing of NSAIDs to AIA patients. Three different AIA patient populations are taken into consideration. First, the values of aspirin and ibuprofen limiting doses that might induce symptoms of AIA are calculated and compared to experimentally observed threshold doses to enlighten which AIA patient population is susceptible to aspirin and ibuprofen. Second, the methodology of NSAID administration is studied on AIA populations susceptible to aspirin and ibuprofen by using 1,000 mg dose of aspirin and 200 or 400 mg dose of ibuprofen followed by PGE(2) analogue dosing. Our model results show that successive doses of PGE(2) analogue applied at appropriate time after aspirin or ibuprofen ingestion would enable administration of both NSAIDs to AIA patients. PGE(2) analogue doses and the corresponding times of their applications are calculated. The model is also used to estimate the duration of symptoms of AIA for different aspirin and ibuprofen doses.", "paper_title": "Strategy for NSAID administration to aspirin-intolerant asthmatics in combination with PGE(2) analogue: a theoretical approach", "paper_id": "WOS:000298648400004"}