{"auto_keywords": [{"score": 0.04876404494641556, "phrase": "slice_undersampling"}, {"score": 0.004554082077300675, "phrase": "transmit_arrays"}, {"score": 0.004408456735066782, "phrase": "rf_field"}, {"score": 0.004307286039184164, "phrase": "high_field_magnetic_resonance_imaging"}, {"score": 0.0033986345279488476, "phrase": "interpolation_method"}, {"score": 0.0030825404960282713, "phrase": "best_estimator"}, {"score": 0.0029288446848334576, "phrase": "resulting_accelerated_sequence"}, {"score": 0.002874870266177579, "phrase": "complete_set"}, {"score": 0.0028482561434303886, "phrase": "eight_volumetric_field_maps"}, {"score": 0.0028087949095629955, "phrase": "human_head"}, {"score": 0.002607362103727335, "phrase": "well-known_interpolation_technique"}, {"score": 0.002267708463966758, "phrase": "accelerated_sequence"}, {"score": 0.0022155569675462333, "phrase": "standard_sequence"}, {"score": 0.0021246816854197732, "phrase": "new_sequence"}], "paper_keywords": ["Brain", " magnetic resonance imaging (MRI)", " probabilistic and statistical methods", " quantification and estimation"], "paper_abstract": "Transmit arrays have been developed to mitigate the RF field inhomogeneity commonly observed in high field magnetic resonance imaging (MRI), typically above 3T. To this end, the knowledge of the RF complex-valued B-1 transmit-sensitivities of each independent radiating element has become essential. This paper details a method to speed up a currently available B-1-calibration method. The principle relies on slice undersampling, slice and channel interleaving and kriging, an interpolation method developed in geostatistics and applicable in many domains. It has been demonstrated that, under certain conditions, kriging gives the best estimator of a field in a region of interest. The resulting accelerated sequence allows mapping a complete set of eight volumetric field maps of the human head in about 1 min. For validation, the accuracy of kriging is first evaluated against a well-known interpolation technique based on Fourier transform as well as to a B-1-maps interpolation method presented in the literature. This analysis is carried out on simulated and decimated experimental B-1 maps. Finally, the accelerated sequence is compared to the standard sequence on a phantom and a volunteer. The new sequence provides B-1 maps three times faster with a loss of accuracy limited potentially to about 5%.", "paper_title": "Accelerating Parallel Transmit Array B1 Mapping in High Field MRI With Slice Undersampling and Interpolation by Kriging", "paper_id": "WOS:000340237800013"}