{"auto_keywords": [{"score": 0.01039232383376189, "phrase": "outer_surface"}, {"score": 0.0046161999598320486, "phrase": "theoretical_study"}, {"score": 0.0043150485532080065, "phrase": "density_functional_calculations"}, {"score": 0.003802135020791801, "phrase": "c-n_bond"}, {"score": 0.0037543106253910313, "phrase": "exohedral_position"}, {"score": 0.003421437601439154, "phrase": "molecular_strain_energy"}, {"score": 0.0032800186243040663, "phrase": "dynamics_calculations"}, {"score": 0.003091767402370757, "phrase": "barrierless_process"}, {"score": 0.003027178161479457, "phrase": "trapping_sites"}, {"score": 0.002914288956035066, "phrase": "condensed_fukui_functions"}, {"score": 0.0027469703311742647, "phrase": "addition_products"}, {"score": 0.00266693888510356, "phrase": "optimized_geometries"}, {"score": 0.0023395610923736595, "phrase": "highest_occupied_molecular_orbitals"}, {"score": 0.0023100907305651872, "phrase": "lowest_unoccupied_molecular_orbitals"}, {"score": 0.0021049977753042253, "phrase": "average_adsorption_energies"}], "paper_keywords": ["Trapping", " Nitrogen", " Fullerene", " Density functional theory"], "paper_abstract": "The capture of N-3-chains and N-5-rings on the outer surface of C-60 was studied using density functional calculations. For the neutral N-5-ring, it was found that a N-5-ring trapped by a C-60 cage becomes more stable than an isolated N-5-ring radical, and a C-60-N-5 compound with a C-N bond at an exohedral position of C-60 is more stable than an isomer with the N-5-ring encapsulated in C-60. Such stability arises from the reduction in molecular strain energy, and charge transfer from C-60 to N-5. Dynamics calculations indicate that capture of the N-5-ring on the outer surface of C-60 is a barrierless process. Furthermore, the trapping sites of more N-5-rings on the C-60 were determined using condensed Fukui functions, where the N-5-rings prefer to be trapped on the surface to form addition products across 6,6-junctions. Based on the optimized geometries of C-60-(N-5) n ( n= 2, 6, 10), their chemical stabilities were found to be comparable with that of C-60 in terms of the gap between the highest occupied molecular orbitals and the lowest unoccupied molecular orbitals. Similar phenomena were found for an N-3-chain wrapped on the surface of C-60. However, the results of the average adsorption energies show that C-60 can capture N-5-rings more effectively than N-3-chains.", "paper_title": "Trapping N-5 rings and N-3 chains on the outer surface of fullerene C-60: a theoretical study", "paper_id": "WOS:000362411800016"}