{"auto_keywords": [{"score": 0.047528888441075466, "phrase": "information_systems"}, {"score": 0.006037078295257485, "phrase": "attribute_reduction"}, {"score": 0.00481503871580222, "phrase": "homomorphisms"}, {"score": 0.00450368324850566, "phrase": "information_system_homomorphisms"}, {"score": 0.004395532072377065, "phrase": "substantial_contribution"}, {"score": 0.00342568771304873, "phrase": "fuzzy_covering"}, {"score": 0.003089080923888397, "phrase": "consistent_functions"}, {"score": 0.003051713660488494, "phrase": "fuzzy_covering_mappings"}, {"score": 0.0029965060407413898, "phrase": "basic_theoretical_foundation"}, {"score": 0.0029422942175866057, "phrase": "fuzzy_covering_information_systems"}, {"score": 0.0023776656246300063, "phrase": "smaller_ones"}, {"score": 0.002264607102799332, "phrase": "illustrative_examples"}], "paper_keywords": ["rough set", " fuzzy covering", " fuzzy covering information system", " homomorphism", " attribute reduction"], "paper_abstract": "Information system homomorphisms have made a substantial contribution to attribute reduction of covering information systems. However, the efforts made on homomorphisms are far from sufficient. This paper further studies homomorphisms for attribute reduction of dynamic fuzzy covering information systems. First, the concepts of neighbourhood and induced fuzzy covering are proposed and their properties are discussed in detail. Then, we introduce the concepts of consistent functions and fuzzy covering mappings providing a basic theoretical foundation for compressing fuzzy covering information systems. Afterwards, the notion of homomorphisms is presented to reveal the relationship between fuzzy covering information systems. We show how large-scale fuzzy covering information systems and dynamic fuzzy covering information systems can be compressed into smaller ones by means of homomorphisms. Finally, illustrative examples are employed to show that attribute reduction can be simplified significantly by our proposed approach.", "paper_title": "Homomorphisms-based attribute reduction of dynamic fuzzy covering information systems", "paper_id": "WOS:000369822800004"}