{"auto_keywords": [{"score": 0.047929617715279114, "phrase": "unknown_objects"}, {"score": 0.00481495049065317, "phrase": "grasp_selection"}, {"score": 0.004506048850130758, "phrase": "unsolved_problem"}, {"score": 0.004437613070853689, "phrase": "robotics_community"}, {"score": 0.004216880725292, "phrase": "appropriate_grasp_configuration"}, {"score": 0.004027586827290042, "phrase": "hand_relative"}, {"score": 0.003509006038574667, "phrase": "similar_way"}, {"score": 0.0033857878144822906, "phrase": "good_grasp"}, {"score": 0.0032668821950788533, "phrase": "best_matching_object_shape"}, {"score": 0.0032008144731234265, "phrase": "previously_demonstrated_grasps"}, {"score": 0.0031521392193570846, "phrase": "grasp_selection_algorithm"}, {"score": 0.002964706925144123, "phrase": "previous_grasp_attempts"}, {"score": 0.002831462722290752, "phrase": "new_situations"}, {"score": 0.002392008392892289, "phrase": "paper_show"}, {"score": 0.0022961534630650347, "phrase": "good_grasp_configurations"}, {"score": 0.002261204313587616, "phrase": "large_set"}], "paper_keywords": ["Model-free grasping", " Grasp synthesis", " Template learning"], "paper_abstract": "The ability to grasp unknown objects still remains an unsolved problem in the robotics community. One of the challenges is to choose an appropriate grasp configuration, i.e., the 6D pose of the hand relative to the object and its finger configuration. In this paper, we introduce an algorithm that is based on the assumption that similarly shaped objects can be grasped in a similar way. It is able to synthesize good grasp poses for unknown objects by finding the best matching object shape templates associated with previously demonstrated grasps. The grasp selection algorithm is able to improve over time by using the information of previous grasp attempts to adapt the ranking of the templates to new situations. We tested our approach on two different platforms, the Willow Garage PR2 and the Barrett WAM robot, which have very different hand kinematics. Furthermore, we compared our algorithm with other grasp planners and demonstrated its superior performance. The results presented in this paper show that the algorithm is able to find good grasp configurations for a large set of unknown objects from a relatively small set of demonstrations, and does improve its performance over time.", "paper_title": "Learning of grasp selection based on shape-templates", "paper_id": "WOS:000329294800005"}