{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "glass_transition_temperature"}, {"score": 0.03808130971320491, "phrase": "calculated_molecular_descriptors"}, {"score": 0.02997991361633434, "phrase": "support_vector_regression"}, {"score": 0.004543708337879809, "phrase": "important_inherent_property"}, {"score": 0.004478308876320956, "phrase": "amorphous_solid_material"}, {"score": 0.0037811784409635023, "phrase": "silico_models"}, {"score": 0.002940095976373734, "phrase": "test_set"}, {"score": 0.002883718207958817, "phrase": "five_computational_models"}, {"score": 0.0027876387169652717, "phrase": "best_result"}, {"score": 0.002760801093167669, "phrase": "rmse"}, {"score": 0.002542642270762272, "phrase": "drug-like_molecules"}, {"score": 0.002387507583705495, "phrase": "simple_linear_regression"}, {"score": 0.0021461840368981475, "phrase": "equal_accuracy"}, {"score": 0.0021049977753042253, "phrase": "compound_synthesis"}], "paper_keywords": [""], "paper_abstract": "Glass transition temperature (T-g) is an important inherent property of an amorphous solid material which is usually determined experimentally. In this study, the relation between T-g and melting temperature (T-m) was evaluated using a data set of 71 structurally diverse druglike compounds. Further, in silico models for prediction of T-g were developed based on calculated molecular descriptors and linear (multilinear regression, partial least-squares, principal component regression) and nonlinear (neural network, support vector regression) modeling techniques. The models based on T-m predicted T-g with an RMSE of 19.5 K for the test set. Among the five computational models developed herein the support vector regression gave the best result with RMSE of 18.7 K for the test set using only four chemical descriptors. Hence, two different models that predict T-g of drug-like molecules with high accuracy were developed. If T-m is available, a simple linear regression can be used to predict T-g. However, the results also suggest that support vector regression and calculated molecular descriptors can predict T-g with equal accuracy, already before compound synthesis.", "paper_title": "Experimental and Computational Prediction of Glass Transition Temperature of Drugs", "paper_id": "WOS:000347137500011"}