{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "interpolating_subdivision_schemes"}, {"score": 0.004770211811866158, "phrase": "approximating_subdivision_schemes"}, {"score": 0.004510336430422002, "phrase": "new_interpolating_subdivision_masks"}, {"score": 0.004426882270402403, "phrase": "corresponding_approximating_subdivision_masks"}, {"score": 0.00428451995524549, "phrase": "complex_computation"}, {"score": 0.004224911726496726, "phrase": "interpolating_subdivision_masks"}, {"score": 0.004185632403886255, "phrase": "extraordinary_vertices"}, {"score": 0.0040133278382101885, "phrase": "new_interpolating_subdivision_schemes"}, {"score": 0.0039024014688338964, "phrase": "existing_interpolating_subdivision_schemes"}, {"score": 0.0038301525703886585, "phrase": "application_needs"}, {"score": 0.003672427620845944, "phrase": "new_interpolating_subdivision_scheme"}, {"score": 0.003504756881063581, "phrase": "catmull-clark_subdivision_scheme"}, {"score": 0.0033919477901198716, "phrase": "polygonal_meshes"}, {"score": 0.0032827577713351336, "phrase": "kobbelt's_interpolating_subdivision_scheme"}, {"score": 0.002826562521633885, "phrase": "continuous_limit_surfaces"}, {"score": 0.002185301851004467, "phrase": "\"popping_effect"}, {"score": 0.0021049977753042253, "phrase": "different_levels"}], "paper_keywords": ["interpolating subdivision", " approximating subdivision"], "paper_abstract": "In this paper we describe a method for directly deducing new interpolating subdivision masks for meshes from corresponding approximating subdivision masks. The purpose is to avoid complex computation for producing interpolating subdivision masks on extraordinary vertices. The method can be applied to produce new interpolating subdivision schemes, solve some limitations in existing interpolating subdivision schemes and satisfy some application needs. As cases, in this paper a new interpolating subdivision scheme for polygonal meshes is produced by deducing from the Catmull-Clark subdivision scheme. It can directly operate on polygonal meshes, which solves the limitation of Kobbelt's interpolating subdivision scheme. A new root 3 interpolating subdivision scheme for triangle meshes and a new root 2 interpolating subdivision scheme for quadrilateral meshes are also presented in the paper by deducing from root 3 subdivision schemes and 4-8 subdivision schemes respectively. They both produce C-1 continuous limit surfaces and avoid the blemish in the existing interpolating root 3 and root 2 subdivision masks where the weight coefficients on extraordinary vertices can not be described by formulation explicitly. In addition, by adding a parameter to control the transition from approximation to interpolation, they can produce surfaces intervening between approximating and interpolating which can be used to solve the \"popping effect\" problem when switching between meshes at different levels of resolution. They can also force surfaces to interpolate chosen vertices.", "paper_title": "Deducing Interpolating Subdivision Schemes from Approximating Subdivision Schemes", "paper_id": "WOS:000266986100040"}