{"auto_keywords": [{"score": 0.04953539708083098, "phrase": "text-image_retrieval"}, {"score": 0.04690252263037727, "phrase": "text-image_retrieval_task"}, {"score": 0.043918627062824865, "phrase": "user_query"}, {"score": 0.00481495049065317, "phrase": "rank_framework"}, {"score": 0.004010477922833839, "phrase": "human_intervention"}, {"score": 0.003443402656397069, "phrase": "learnt_objective_function"}, {"score": 0.003365529624506815, "phrase": "ranked_list"}, {"score": 0.0032396224508754387, "phrase": "score_functions"}, {"score": 0.0030017207229983385, "phrase": "rank_algorithms"}, {"score": 0.0029450186031370245, "phrase": "text_retrieval"}, {"score": 0.002845632674146652, "phrase": "tfidf."}, {"score": 0.0026771333996253783, "phrase": "owpc"}, {"score": 0.0026567830878420347, "phrase": "usunier"}, {"score": 0.0023694065215394593, "phrase": "empirical_validation"}, {"score": 0.0022547140008848912, "phrase": "typical_text-image_retrieval_similarities"}, {"score": 0.0021049977753042253, "phrase": "simple_baseline"}], "paper_keywords": ["Learning to Rank", " Text-image retrieval", " OWPC", " Visuo-textual fusion", " Pooling for Learning to Rank"], "paper_abstract": "We present a framework based on a Learning to Rank setting for a text-image retrieval task. In Information Retrieval, the goal is to compute the similarity between a document and an user query. In the context of text-image retrieval where several similarities exist, human intervention is often needed to decide on the way to combine them. On the other hand, with the Learning to Rank approach the combination of the similarities is done automatically. Learning to Rank is a paradigm where the learnt objective function is able to produce a ranked list of images when a user query is given. These score functions are generally a combination of similarities between a document and a query. In the past, Learning to Rank algorithms were successfully applied to text retrieval where they outperformed baselines such as BM25 or TFIDF. This inspired us to apply our state-of-the-art algorithm, called OWPC (Usunier et al. 2009), to the text-image retrieval task. At this time, no benchmarks are available, therefore we present a framework for building one. The empirical validation of this algorithm is done on the dataset constructed through comparison of typical text-image retrieval similarities. In both cases, visual only and text and visual, our algorithm performs better than a simple baseline.", "paper_title": "A Learning to Rank framework applied to text-image retrieval", "paper_id": "WOS:000304707500008"}