{"auto_keywords": [{"score": 0.047719606869824766, "phrase": "knowledge_maps"}, {"score": 0.015719716506582538, "phrase": "e-learning_materials_design"}, {"score": 0.010531088772560244, "phrase": "computer_self-efficacy"}, {"score": 0.009352228395342818, "phrase": "knowledge_map-based_materials_design_approach"}, {"score": 0.0037060428445111664, "phrase": "knowledge_map-based_and_browse-based_groups"}, {"score": 0.003555902292752528, "phrase": "specific_skills"}, {"score": 0.003459191419478298, "phrase": "target_ado.net_program"}, {"score": 0.0033961782274326948, "phrase": "session_subjects"}, {"score": 0.003140888248194296, "phrase": "knowledge_map-based_learning_group"}, {"score": 0.0029586543333524904, "phrase": "proposed_hypotheses"}, {"score": 0.002748775748298028, "phrase": "ado.net_programming"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Authoring tools and methods", " Media in education", " Teaching/learning strategies"], "paper_abstract": "This research investigated the application of knowledge maps in e-learning materials design and hypothesized that knowledge maps would be more effective than e-learning in general at improving the performance and satisfaction of e-learning. In order to test the hypotheses, we conducted an experiment with 175 participants and randomly assigned them into knowledge map-based and browse-based groups. Both groups of participants needed to acquire specific skills and knowledge to write the target ADO.NET program. In the end of each training session subjects received an assessment to understand their learning score, satisfaction level, and computer self-efficacy. Our statistical analysis result showed that knowledge map-based learning group outperformed browse-based group in these three measurements. Thus, the proposed hypotheses were supported. We concluded that if knowledge map-based materials design approach were employed novice users would acquire the ADO.NET programming in a more effective manner. In addition, the satisfaction and computer self-efficacy of users could be improved substantially as a result of knowledge map-based materials design approach. Thus, we propose that if knowledge maps are employed to adequately present the relationships of learning contents that knowledge could be better understood and learning performance could be improved. (C) 2009 Elsevier Ltd. All rights reserved.", "paper_title": "A study of learning performance of e-learning materials design with knowledge maps", "paper_id": "WOS:000272310100024"}