{"auto_keywords": [{"score": 0.05007840182816716, "phrase": "business_processes"}, {"score": 0.04959311560747309, "phrase": "electronic_intermediaries"}, {"score": 0.0407769748728513, "phrase": "eim"}, {"score": 0.004598933498016774, "phrase": "internet-based_organizations"}, {"score": 0.004216880725292, "phrase": "significant_sector"}, {"score": 0.004152818376630929, "phrase": "internet_economy"}, {"score": 0.0035997452281985465, "phrase": "specific_online_processes"}, {"score": 0.0035269696779744266, "phrase": "particular_eim."}, {"score": 0.003438058620195309, "phrase": "conceptual_research"}, {"score": 0.0032836104153151973, "phrase": "e-business_architectures"}, {"score": 0.002466510117718297, "phrase": "existing_eims"}, {"score": 0.002331641523873951, "phrase": "business_performance"}, {"score": 0.0022041312401435346, "phrase": "evolutionary_context"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Electronic intermediaries", " Business process", " Typology"], "paper_abstract": "Electronic intermediaries (EIMs) are Internet-based organizations that enable other organizations to interact with each other in business processes. While EIMs have become a significant sector of the Internet economy, theory and guidelines for planning the set of business processes an EIM can support online are sparse. This paper presents an approach to plan the specific online processes Supported by a particular EIM. The approach draws on conceptual research on business process engineering, EIMs, and e-business architectures. Three categories of processes, together with their respective sub-processes, are identified and described. The approach then provides guidance in the choice of processes, based upon two factors - first the resource base of the EIM, and second. its evolutionary context. The approach is demonstrated with respect to a set of existing EIMs. The insight gained from this analysis is that the business performance of an EIM can be enhanced by considering its resource base and evolutionary context when planning its business processes. (C) 2008 Elsevier B.V. All rights reserved,", "paper_title": "Online support for business processes by electronic intermediaries", "paper_id": "WOS:000260713900014"}