{"auto_keywords": [{"score": 0.05007852962010534, "phrase": "mobile_devices"}, {"score": 0.022629128184544888, "phrase": "desktop_computers"}, {"score": 0.015385260603799238, "phrase": "south_korea"}, {"score": 0.007569011616349054, "phrase": "mobile_device"}, {"score": 0.007379947403694762, "phrase": "desktop_computer"}, {"score": 0.005940304270400874, "phrase": "usa_students"}, {"score": 0.004643594260262632, "phrase": "college_students"}, {"score": 0.004643559263916302, "phrase": "positive_features"}, {"score": 0.004350308086118336, "phrase": "multimedia_learning_materials"}, {"score": 0.0036026484429137998, "phrase": "mds_questionnaire"}, {"score": 0.003424225677958491, "phrase": "static-dynamic_dimension"}, {"score": 0.003314203895848455, "phrase": "second_dimension"}, {"score": 0.0031960852616842207, "phrase": "instructional_lesson"}, {"score": 0.0030821633718368206, "phrase": "south_korean_students"}, {"score": 0.0029830992938695007, "phrase": "semantic_differential_questionnaire"}, {"score": 0.002416589459425828, "phrase": "south_korean"}, {"score": 0.00217496508306238, "phrase": "cross-national_differences"}, {"score": 0.0021592189144729775, "phrase": "students'_beliefs"}, {"score": 0.0021435864990577945, "phrase": "mobile_and_desktop_media"}], "paper_keywords": ["Mobile device", " Smart phone", " Tablet", " Personal computer", " Desktop computer"], "paper_abstract": "College students in the United States and in South Korea completed a 28-item multidimensional scaling (MDS) questionnaire in which they rated the similarity of 28 pairs of multimedia learning materials on a 10-point scale (e.g., narrated animation on a mobile device Vs. movie clip on a desktop computer) and a 56-item semantic differential questionnaire in which they rated their perceptions of mobile devices and desktop computers using 28 adjective pairs (e.g., active-passive) as anchors on a 7-point scale. On the MDS questionnaire students in both the USA and South Korea conceptualized multimedia learning materials in terms of a static-dynamic dimension, but they differed in terms of the second dimension in which USA students were more sensitive to whether an instructional lesson is presented on a mobile device or a desktop computer whereas South Korean students conceptualized both media as equivalent. On the semantic differential questionnaire, students in both nations viewed mobile devices as more accessible, more portable, and newer, and viewed desktop computers as more faithful, stable, concentrative, and essential. However, USA students also rated desktop computers higher than mobile devices on positive features such as being fast, sharp, meaningful, good, and realistic; whereas South Korean also rated mobile devices higher than desktop computers on positive features such as being open, attractive, changeful, stimulating, immediate, and exciting. Overall, there are cross-national differences in students' beliefs about mobile and desktop media, which may affect their learning. (C) 2012 Elsevier Ltd. All rights reserved.", "paper_title": "Students' beliefs about mobile devices Vs. desktop computers in South Korea and the United States", "paper_id": "WOS:000309307300024"}