{"auto_keywords": [{"score": 0.04409425892891001, "phrase": "present_work"}, {"score": 0.00481495049065317, "phrase": "open_source_digital_library_software"}, {"score": 0.004595263305771512, "phrase": "digital_libraries"}, {"score": 0.004354149483556514, "phrase": "dl_software_packages"}, {"score": 0.004110831924517065, "phrase": "dl_evaluation"}, {"score": 0.003637822529522622, "phrase": "supporting_features"}, {"score": 0.0031277316566463978, "phrase": "dl_project"}, {"score": 0.003038983069081333, "phrase": "findings_-_a_checklist"}, {"score": 0.00284837132359445, "phrase": "best_performer"}, {"score": 0.0028076592725295646, "phrase": "cdsware"}, {"score": 0.0027476770668141805, "phrase": "greenstone"}, {"score": 0.0025938977569302177, "phrase": "checklist_categories"}, {"score": 0.0025202582748972122, "phrase": "worst_performer"}, {"score": 0.002286781334850213, "phrase": "comprehensive_checklist"}, {"score": 0.0021821915946356168, "phrase": "new_categories"}, {"score": 0.0021509807762081145, "phrase": "weighting_schemes"}, {"score": 0.0021049977753042253, "phrase": "different_dl_implementations"}], "paper_keywords": ["digital libraries", " program testing", " computer software"], "paper_abstract": "Purpose - Many open source software packages are available for organizations and individuals to create digital libraries (DLs). However, a simple to use instrument to evaluate these DL software packages does not exist. The objectives of the present work are to develop a checklist for DL evaluation and use this checklist on four DL software packages. Design/methodology/approach - Features that characterized \"good\" open source DL software were determined from the literature. First identified were essential categories of features that DL software should possess. These categories were then decomposed into supporting features. From these, a checklist that covered all such features was developed. The checklist was then used to evaluate four popular open source DL software packages (CDSware, EPrints, Fedora, and Greenstone) for the purposes of assessing suitability for use in a DL project to be undertaken by the authors. Findings - A checklist consisting of 12 categories of items was developed. Using this, Greenstone was found to be the best performer, followed by CDSware, Fedora and EPrints. Greenstone was the only software package that consistently fulfilled the majority of the criteria in many of the checklist categories. In contrast, EPrints was the worst performer due to its poor support for certain features deemed important in our checklist, and a total absence of functionality in other categories. Originality/value - The present work attempts to develop a comprehensive checklist for assessing DLs. Its flexibility allows users to tailor it to accommodate new categories, items and weighting schemes to reflect the needs of different DL implementations.", "paper_title": "A checklist for evaluating open source digital library software", "paper_id": "WOS:000241243200003"}