{"auto_keywords": [{"score": 0.03624313506368424, "phrase": "maea-csps"}, {"score": 0.02322730111336097, "phrase": "constraint_satisfaction_problems"}, {"score": 0.006217748879814362, "phrase": "n-queen_problems"}, {"score": 0.005294258786190995, "phrase": "good_performance"}, {"score": 0.004746558955503364, "phrase": "intrinsic_properties"}, {"score": 0.0035904480418810837, "phrase": "general_encoding_methods"}, {"score": 0.003552084379143929, "phrase": "minimum_conflict_encoding"}, {"score": 0.00348913334634192, "phrase": "theoretical"}, {"score": 0.0034026714408341868, "phrase": "linear_space_complexity"}, {"score": 0.0032947371184395237, "phrase": "first_part"}, {"score": 0.0031788080316930687, "phrase": "dimacs_challenge"}, {"score": 0.0030889995517870525, "phrase": "nonpermutation_csps"}, {"score": 0.003023307182674672, "phrase": "six_well-defined_algorithms"}, {"score": 0.002896071795090179, "phrase": "second_part"}, {"score": 0.002834470668509792, "phrase": "classical_csp"}, {"score": 0.0025822818714499795, "phrase": "permutation_csps"}, {"score": 0.002464709648714996, "phrase": "great_care"}, {"score": 0.0022615046141708987, "phrase": "linear_time_complexity"}, {"score": 0.0021975548867457623, "phrase": "-queen_problems"}], "paper_keywords": ["constraint satisfaction problems", " evolutionary algorithms", " graph coloring problems", " job-shop scheduling problems", " multiagent systems", " n-queen problems"], "paper_abstract": "With the intrinsic properties of constraint satisfaction problems (CSPs) in mind, we divide CSPs into two types, namely, permutation CSPs and nonpermutation CSPs. According to their characteristics, several behaviors are designed for agents by making use of the ability of agents to sense and act on the environment. These behaviors are controlled by means of evolution, so that the multiagent evolutionary algorithm for constraint satisfaction problems (MAEA-CSPs) results. To overcome the disadvantages of the general encoding methods, the minimum conflict encoding is also proposed. Theoretical analyzes show that MAEA-CSPs has a linear space complexity and converges to the global optimum. The first part of the experiments uses 250 benchmark binary CSPs and 79 graph coloring problems from the DIMACS challenge to test the performance of MAEA-CSPs for nonpermutation CSPs. MAEA-CSPs is compared with six well-defined algorithms and the effect of the parameters is analyzed systematically. The second part of the experiments uses a classical CSP, n-queen problems, and a more practical case, job-shop scheduling problems (JSPs), to test the performance of MAEA-CSPs for permutation CSPs. The scalability of MAEA-CSPs along n for n-queen problems is studied with great care. The results show that MAEA-CSPs achieves good performance when n increases from 10(4) to 10 (7), and has a linear time complexity. Even for 10 (7) -queen problems, MAEA-CSPs finds the solutions by only 150 seconds. For JSPs, 59 benchmark problems are used, and good performance is also obtained.", "paper_title": "A multiagent evolutionary algorithm for constraint satisfaction problems", "paper_id": "WOS:000234882600005"}