{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "differentially_expressed_genes"}, {"score": 0.007746872402509793, "phrase": "hypothesis_testing"}, {"score": 0.007664439275894868, "phrase": "gene-by-gene_basis"}, {"score": 0.004172957742905294, "phrase": "single-gene-analysis_approach"}, {"score": 0.0038708031633013086, "phrase": "poor_accuracy"}, {"score": 0.0038431888954930083, "phrase": "variability_estimation"}, {"score": 0.003734680485633702, "phrase": "small_fold-changes"}, {"score": 0.0036684182697540382, "phrase": "replicate_experiments"}, {"score": 0.0034890505116128606, "phrase": "difficult_task"}, {"score": 0.0032947371184395237, "phrase": "low_false_discovery_rates"}, {"score": 0.0031223774204093713, "phrase": "new_characterization"}, {"score": 0.0027054473441439422, "phrase": "single_gene_analysis"}, {"score": 0.0026289770980696286, "phrase": "cdna_microarray_dataset"}, {"score": 0.0022941723937662927, "phrase": "multiple_hypothesis_testing"}, {"score": 0.0021354096283081317, "phrase": "supplementary_data"}, {"score": 0.0021050212845003468, "phrase": "bioinformatics"}], "paper_keywords": [""], "paper_abstract": "Motivation: Currently most of the methods for identifying differentially expressed genes fall into the category of so called single-geneanalysis, performing hypothesis testing on a gene-by-gene basis. In a single-gene-analysis approach, estimating the variability of each gene is required to determine whether a gene is differentially expressed or not. Poor accuracy of variability estimation makes it difficult to identify genes with small fold-changes unless a very large number of replicate experiments are performed. Results: We propose a method that can avoid the difficult task of estimating variability for each gene, while reliably identifying a group of differentially expressed genes with low false discovery rates, even when the fold-changes are very small. In this article, a new characterization of differentially expressed genes is established based on a theorem about the distribution of ranks of genes sorted by ( log) ratios within each array. This characterization of differentially expressed genes based on rank is an example of all-gene-analysis instead of single gene analysis. We apply the method to a cDNA microarray dataset and many low fold-changed genes ( as low as 1.3 fold-changes) are reliably identified without carrying out hypothesis testing on a gene-by-gene basis. The false discovery rate is estimated in two different ways reflecting the variability from all the genes without the complications related to multiple hypothesis testing. We also provide some comparisons between our approach and single-gene-analysis based methods. Contact: yyzhou@netra.wustl.edu Supplementary information: Supplementary data are available at Bioinformatics online.", "paper_title": "A global approach to identify differentially expressed genes in cDNA (two-color) microarray experiments", "paper_id": "WOS:000249818300006"}