{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "multi-user_setting"}, {"score": 0.017788303395267897, "phrase": "optimistic_fair_exchange"}, {"score": 0.004837345227360704, "phrase": "single-user_setting"}, {"score": 0.004378958522416482, "phrase": "public_key_encryption_and_public_key_signature_schemes"}, {"score": 0.003541357671562449, "phrase": "optimistic_fair_exchange_scheme"}, {"score": 0.0030451958332949735, "phrase": "formal_security_model"}, {"score": 0.0028795712616923462, "phrase": "first_complete_security_model"}, {"score": 0.002677616534005393, "phrase": "generic_construction_meeting"}, {"score": 0.002618366076489732, "phrase": "one-way_functions"}, {"score": 0.002574788013427524, "phrase": "random_oracle_model_and_trapdoor_one-way_permutations"}], "paper_keywords": ["security protocol", " fair exchange", " public key cryptography"], "paper_abstract": "This paper addresses the security of optimistic fair exchange in a multi-user setting. While the security of public key encryption and public key signature schemes in a single-user setting guarantees the security in a multi-user setting, we show that the situation is different in the optimistic fair exchange. First, we show how to break, in the multi-user setting, an optimistic fair exchange scheme provably secure in the single-user setting. This example separates the security of optimistic fair exchange between the single-user setting and the multi-user setting. We then de. ne the formal security model of optimistic fair exchange in the multi-user setting, which is the first complete security model of optimistic fair exchange in the multi-user setting. We prove the existence of a generic construction meeting our multi-user security based on one-way functions in the random oracle model and trapdoor one-way permutations in the standard model. Finally, we revisit two well-known methodologies of optimistic fair exchange, which are based on the veri. ably encrypted signature and the sequential two-party multisignature, respectively. Our result shows that these paradigms remain valid in the multi-user setting.", "paper_title": "Optimistic fair exchange in a multi-user setting", "paper_id": "WOS:000254398900002"}