{"auto_keywords": [{"score": 0.01895671624073788, "phrase": "watermark_bits"}, {"score": 0.008245864134142938, "phrase": "key_stream"}, {"score": 0.006524817736641803, "phrase": "lin_et_al"}, {"score": 0.00481495049065317, "phrase": "watermarking_scheme_for_digital_images"}, {"score": 0.004769958800452922, "phrase": "digital_watermarking_techniques"}, {"score": 0.00470325458481566, "phrase": "important_method"}, {"score": 0.004637478829869904, "phrase": "copyright_protection"}, {"score": 0.00440403952059725, "phrase": "non-embedded_watermarking_scheme"}, {"score": 0.00432208488976429, "phrase": "vector_quantization"}, {"score": 0.004162703509434786, "phrase": "image_copyright"}, {"score": 0.003953068310598579, "phrase": "image_blocks"}, {"score": 0.0035986417127934303, "phrase": "ks"}, {"score": 0.0021049977753042253, "phrase": "proposed_approach"}], "paper_keywords": ["Non-embedded Watermark", " Vector Quantization", " Image Integrity", " Image Copyright"], "paper_abstract": "Digital watermarking techniques are an important method to provide copyright protection of multimedia. In this paper, we proposed a non-embedded watermarking scheme, based on vector quantization (VQ), to protect the image copyright. Our approach applies a codebook to generate a relationship between image blocks and watermark bits, and then the relationship is outputted as the key stream (called KS). With the KS, the relationship between the image and the watermark are confirmed and the copyright of the image is declared. In our method, the number of bits that are related to a block is adaptive. Compared to the scheme of Lin et al., our approach needs only one codebook, while their approach requires seven. Moreover, in our approach each block can be connected with watermark bits, while some blocks can not be connected with watermark bits in their method. Finally, a method of adjusting the robustness is given for our proposed approach. Our approach not only reduces the length of the key stream, but it also allows for a more flexible application. In addition, our experimental results show that the proposed approach runs faster and is more robust than that of Lin et al.", "paper_title": "Codebook-linked Watermarking Scheme for Digital Images", "paper_id": "WOS:000267901400005"}