{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "influenza_detection"}, {"score": 0.03266556095890514, "phrase": "ml_classifiers"}, {"score": 0.004782718554230406, "phrase": "emergency_department_free-text_reports"}, {"score": 0.00475075145204571, "phrase": "influenza"}, {"score": 0.004703075081891693, "phrase": "yearly_recurrent_disease"}, {"score": 0.0045324756541157574, "phrase": "effective_bio-surveillance_system"}, {"score": 0.004471978831302331, "phrase": "early_detection"}, {"score": 0.00415333528095237, "phrase": "real_time"}, {"score": 0.004084129504819342, "phrase": "seven_machine_learning"}, {"score": 0.003922685601503529, "phrase": "expert-built_influenza_bayesian_classifier"}, {"score": 0.0038186039088445524, "phrase": "missing_clinical_information"}, {"score": 0.003780286517897356, "phrase": "free-text_reports"}, {"score": 0.0032276440647931444, "phrase": "acute"}, {"score": 0.002888488567436329, "phrase": "expert-built_bayesian_model"}, {"score": 0.002709589081384597, "phrase": "consistently_improved_performance"}, {"score": 0.002400373755068185, "phrase": "classification_performance"}, {"score": 0.0023762535034673017, "phrase": "large_number"}, {"score": 0.0023603078194781965, "phrase": "training_cases"}, {"score": 0.002206606452557159, "phrase": "value_information"}, {"score": 0.0021844290159501313, "phrase": "great_potential"}, {"score": 0.0021479597698614373, "phrase": "infectious_diseases"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Influenza", " Emergency department reports", " Case detection", " Machine learning", " Bayesian"], "paper_abstract": "Influenza is a yearly recurrent disease that has the potential to become a pandemic. An effective bio-surveillance system is required for early detection of the disease. In our previous studies, we have shown that electronic Emergency Department (ED) free-text reports can be of value to improve influenza detection in real time. This paper studies seven machine learning (ML) classifiers for influenza detection, compares their diagnostic capabilities against an expert-built influenza Bayesian classifier, and evaluates different ways of handling missing clinical information from the free-text reports. We identified 31,268 ED reports from 4 hospitals between 2008 and 2011 to form two different datasets: training (468 cases, 29,004 controls), and test (176 cases and 1620 controls). We employed Topaz, a natural language processing (NLP) tool, to extract influenza-related findings and to encode them into one of three values: Acute, Non-acute, and Missing. Results show that all ML classifiers had areas under ROCs (AUC) ranging from 0.88 to 0.93, and performed significantly better than the expert-built Bayesian model. Missing clinical information marked as a value of missing (not missing at random) had a consistently improved performance among 3 (out of 4) ML classifiers when it was compared with the configuration of not assigning a value of missing (missing completely at random). The case/control ratios did not affect the classification performance given the large number of training cases. Our study demonstrates ED reports in conjunction with the use of ML and NLP with the handling of missing value information have a great potential for the detection of infectious diseases. (C) 2015 Elsevier Inc. All rights reserved.", "paper_title": "Comparison of machine learning classifiers for influenza detection from emergency department free-text reports", "paper_id": "WOS:000366791000007"}