{"auto_keywords": [{"score": 0.04911241438594345, "phrase": "delayed_recognition"}, {"score": 0.00481495049065317, "phrase": "citation_lifecycle"}, {"score": 0.003946195919158241, "phrase": "relative_obscurity"}, {"score": 0.0038467574225322086, "phrase": "subsequent_citation_patterns"}, {"score": 0.0034911335714333507, "phrase": "subsequent_yearly_citations"}, {"score": 0.002949598537993663, "phrase": "typical_early_peak"}, {"score": 0.002788388542538351, "phrase": "vast_majority"}, {"score": 0.0024414225109100672, "phrase": "\"sleeping_beauty\"_subtype"}, {"score": 0.002249672943553135, "phrase": "different_disciplines"}, {"score": 0.0022267859286766553, "phrase": "similar_behavior"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Delayed recognition", " Sleeping beauties", " Citation lifecycle"], "paper_abstract": "Delayed recognition is a concept applied to articles that receive very few to no citations for a certain period of time following publication, before becoming actively cited. To determine whether such a time spent in relative obscurity had an effect on subsequent citation patterns, we selected articles that received no citations before the passage of ten full years since publication, investigated the subsequent yearly citations received over a period of 37 years and compared them with the citations received by a group of papers without such a latency period. Our study finds that papers with delayed recognition do not exhibit the typical early peak, then slow decline in citations, but that the vast majority enter decline immediately after their first - and often only - citation. Middling papers' citations remain stable over their lifetime, whereas the more highly cited papers, some of which fall into the \"sleeping beauty\" subtype, show non-stop growth in citations received. Finally, papers published in different disciplines exhibit similar behavior and did not differ significantly. (C) 2014 Elsevier Ltd. All rights reserved.", "paper_title": "On the citation lifecycle of papers with delayed recognition", "paper_id": "WOS:000345527400006"}