{"auto_keywords": [{"score": 0.005660817562405699, "phrase": "bigger_bubble_radius"}, {"score": 0.005355349421260943, "phrase": "infinite_liquid"}, {"score": 0.005200326732131296, "phrase": "leading_bubble"}, {"score": 0.00481495049065317, "phrase": "interaction_mechanism"}, {"score": 0.004675497336655545, "phrase": "incompressible_fluids"}, {"score": 0.004584769330512473, "phrase": "surface_tension_effects"}, {"score": 0.004540064673326908, "phrase": "axisymmetric_evolution"}, {"score": 0.004466519142879166, "phrase": "infinite_and_initially_stationary_liquid"}, {"score": 0.004394159734054881, "phrase": "vof_method"}, {"score": 0.004351305527177264, "phrase": "numerical_experiments"}, {"score": 0.003906510969606783, "phrase": "different_bubble_distances"}, {"score": 0.0038431888954930083, "phrase": "gas_density"}, {"score": 0.0038181472934630347, "phrase": "liquid_density"}, {"score": 0.0037195959056754444, "phrase": "numerical_experiment"}, {"score": 0.0033720784894045544, "phrase": "isolated_ones"}, {"score": 0.003179303164775306, "phrase": "isolated_one"}, {"score": 0.003066945490483524, "phrase": "smaller_distance"}, {"score": 0.002958546790146313, "phrase": "liquid_region"}, {"score": 0.00285396838599055, "phrase": "upward_stretch"}, {"score": 0.002587115505155995, "phrase": "liquid_jet"}, {"score": 0.0025202582748972122, "phrase": "top_part"}, {"score": 0.0023995115472744376, "phrase": "pear-like_shape"}, {"score": 0.0022548160498101558, "phrase": "smaller_bubble"}, {"score": 0.002167949230651206, "phrase": "bigger_one"}], "paper_keywords": ["Two rising bubbles", " bubble coalescence", " buoyancy", " VOF method"], "paper_abstract": "In the frame of inviscid and incompressible fluids without taking into consideration of surface tension effects, the axisymmetric evolution of two buoyancy-driven bubbles in an infinite and initially stationary liquid are investigated numerically by VOF method. The numerical experiments are performed for two bubbles with same size, with the following one being half of the leading one, and with the leading one being half of the following one, and for different bubble distances. The ratio of gas density to liquid density is 0.001. It is found by numerical experiment that when the distance between the two bubbles is greater than or equal to one and half of the bigger bubble radius, the interaction is very weak and the two bubbles evolute like isolated ones rising in an infinite liquid. When the two bubbles come closer, the leading bubble itself evolutes like an isolated one rising in an infinite liquid. However, due to the smaller distance between the two bubbles, large pressure gradient forms in the liquid region near the top of the following bubble, which causes the upward stretch of its top part no matter what sizes of the two bubbles are. When the distance between the two bubbles is less than or equal to three-tenth of the bigger bubble radius, before the liquid jet behind the leading bubble fully developed, the top part of the following bubble has already been sucked into the leading one, giving a pear-like shape. Soon after the following bubble merges with the leading one. It is also found that for the smaller bubble, its transition to toroidal is always faster than that of the bigger one because of its smaller size. The mechanism of the above phenomena has been analyzed numerically.", "paper_title": "NUMERICAL INVESTIGATION OF THE INTERACTION MECHANISM OF TWO BUBBLES", "paper_id": "WOS:000274267700003"}