{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "european_framework_programmes"}, {"score": 0.004763895422211728, "phrase": "scientific_collaboration"}, {"score": 0.0037076911119175455, "phrase": "newly_launched_category"}, {"score": 0.0032969458013463807, "phrase": "european_networking"}, {"score": 0.0029630461161780203, "phrase": "central_countries"}, {"score": 0.002794001681064862, "phrase": "speedy_development"}, {"score": 0.002592693161475495, "phrase": "close_correlation_between_funding_and_increased_output"}, {"score": 0.002497531381123025, "phrase": "member_states"}, {"score": 0.0023802825369325354, "phrase": "\"funding_agency\"_field"}, {"score": 0.002317533977770783, "phrase": "science_database"}, {"score": 0.002150481043278758, "phrase": "estimated_impact"}, {"score": 0.0021276181317652163, "phrase": "eu-funding_programmes"}, {"score": 0.0021049977753042253, "phrase": "member_states'_scientific_output"}], "paper_keywords": ["European Framework Programmes", " Scientific collaboration", " Nanotechnology"], "paper_abstract": "This study deals primarily with the effect of certain European Framework Programmes on EU-27 member states' publication output in nanotechnology, with a focus on their scientific collaboration over the last ten years. The study was conducted at three levels (category, journal and publication). The aim was to verify whether the newly launched category is sufficiently complete, as well as to identify the most prominent journals and compare the EU-27 member states' output to world production. Snapshots of European networking are also provided for three key dates (2001, 2006 and 2011) to ascertain the positions of emerging and central countries and analyse their variations over time. The results confirm the speedy development in the field and the importance of the EU-27s world role. They corroborate the close correlation between funding and increased output and the intensification of collaboration among member states. Finally, the information contained in the \"Funding Agency\" field in the Web of Science database was also compiled, with a view to substantiating the validity of the estimated impact of EU-funding programmes on member states' scientific output.", "paper_title": "The influence of European Framework Programmes on scientific collaboration in nanotechnology", "paper_id": "WOS:000324275600006"}