{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "morphological_variations"}, {"score": 0.0455466088830923, "phrase": "supporting_width"}, {"score": 0.009507307419461618, "phrase": "aortic_component"}, {"score": 0.004590496414177077, "phrase": "heart_sound"}, {"score": 0.004506968388996092, "phrase": "gaussian_curve"}, {"score": 0.004007083686875716, "phrase": "regular_behaviors"}, {"score": 0.0038909934410379775, "phrase": "prominent_peaks"}, {"score": 0.0035755653799043, "phrase": "consistent_observations"}, {"score": 0.003190367939051776, "phrase": "significant_changes"}, {"score": 0.0027946649584841754, "phrase": "pulmonary_component"}, {"score": 0.0025963890234079333, "phrase": "opposing_delays"}, {"score": 0.002421040737931745, "phrase": "delay_pattern"}, {"score": 0.0023079225317714815, "phrase": "quantitative_analysis"}, {"score": 0.002191993482098238, "phrase": "non-invasive_continuous_monitoring_method"}, {"score": 0.0021520139248317333, "phrase": "respiratory_cycles"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Heart sound", " Morphology", " Modeling", " Respiratory phase"], "paper_abstract": "In this study, each peak/valley of a heart sound was modeled by a Gaussian curve and characterized by amplitude, timing, and supporting width. This model was applied to analyze the morphological variations induced by respiration in 12 subjects. It was observed that the morphology exhibited regular behaviors with respiration. The amplitude of the prominent peaks and valleys of S2 (the second heart sound) were commonly attenuated during expiration and were accentuated during inspiration whereas no consistent observations were obtained for S1 (the first heart sound). The supporting width of S1 commonly decreased with expiration and increased with inspiration whereas the supporting width of S2 displayed no significant changes during respiration. For all subjects, the delay of Si increased during inspiration and decreased during expiration. However, the delay of the aortic component increased during expiration and decreased during inspiration. The pulmonary component of S2 was observed in 7 of 12 subjects, and the delay was opposite to that of the aortic component. The opposing delays yielded a splitting between the two components of S2 that increased during inspiration and decreased during expiration. The delay pattern was the most consistent observation in all subjects. These results suggest that a quantitative analysis of morphological variations, particularly the delay pattern, could be used as a non-invasive continuous monitoring method of hemodynamic change during respiratory cycles. (C) 2013 Elsevier Ltd. All rights reserved.", "paper_title": "Modeling of heart sound morphology and analysis of the morphological variations induced by respiration", "paper_id": "WOS:000327578400001"}