{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "public_health"}, {"score": 0.004470539706227421, "phrase": "public_health_and_health_informatics_communities"}, {"score": 0.00427578268550103, "phrase": "amia_spring_congress"}, {"score": 0.0037593414153801394, "phrase": "five_discussion_tracks"}, {"score": 0.0030531596109756895, "phrase": "information_sharing"}, {"score": 0.0030081030319492343, "phrase": "public_health_informatics_community"}, {"score": 0.0028768722873689432, "phrase": "public_health_informatics"}, {"score": 0.0028484940955893134, "phrase": "common_public_health_terminologies"}, {"score": 0.0028203950416405585, "phrase": "rigorous_evaluation_methodologies"}, {"score": 0.0027787638791664663, "phrase": "competency-based_training"}, {"score": 0.0026839922027139967, "phrase": "effective_coordination"}, {"score": 0.002336071138145897, "phrase": "informatics_communities"}, {"score": 0.0021049977753042253, "phrase": "information_technology"}], "paper_keywords": [""], "paper_abstract": "The AMIA Public Health Informatics 2011 Conference brought together members of the public health and health informatics communities to revisit the national agenda developed at the AMIA Spring Congress in 2001, assess the progress that has been made in the past decade, and develop recommendations to further guide the field. Participants met in five discussion tracks: technical framework; research and evaluation; ethics; education, professional training, and workforce development; and sustainability. Participants identified 62 recommendations, which clustered into three key themes related to the need to (1) enhance communication and information sharing within the public health informatics community, (2) improve the consistency of public health informatics through common public health terminologies, rigorous evaluation methodologies, and competency-based training, and (3) promote effective coordination and leadership that will champion and drive the field forward. The agenda and recommendations from the meeting will be disseminated and discussed throughout the public health and informatics communities. Both communities stand to gain much by working together to use these recommendations to further advance the application of information technology to improve health.", "paper_title": "An informatics agenda for public health: summarized recommendations from the 2011 AMIA PHI Conference", "paper_id": "WOS:000307934600002"}