{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "line_drawings"}, {"score": 0.004775335634705251, "phrase": "edge_decomposition"}, {"score": 0.004360412703519539, "phrase": "existing_ones"}, {"score": 0.0039813976794342, "phrase": "connected_edges"}, {"score": 0.0037419747525425586, "phrase": "closed_loop"}, {"score": 0.003502382624110703, "phrase": "overall_structure"}, {"score": 0.0032109670662222416, "phrase": "face_forming_stage"}, {"score": 0.0029805015010906013, "phrase": "internal_faces"}, {"score": 0.002665362204725326, "phrase": "straight_lines"}, {"score": 0.0024434201175883674, "phrase": "previous_publications"}, {"score": 0.0023834640793589435, "phrase": "correct_result"}, {"score": 0.0023346234464901978, "phrase": "latest_methods"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Line drawing", " 3D wireframe", " Edge decomposition", " Face identification", " Internal face", " 3D reconstruction"], "paper_abstract": "This paper presents a method to find the faces of objects in 2D line drawings, using an approach totally different from existing ones. It consists of two stages: decomposition and face forming. In decomposition, a drawing is decomposed into chains of connected edges. Each chain belongs to one face only, but may not yet form a closed loop. The decomposition is local to a vertex, and takes no account of the overall structure of the drawing. The algorithm ensures that there is a chain for every face in the object. The face forming stage completes the loop for each chain to form a face. Our method can deliver both the real faces and the internal faces separately. It depends only on the topology of the drawing and not on the geometry, and is therefore applicable to line drawings with curves and straight lines, and 3D wireframes. We implemented our algorithm and tested it with hundreds of objects, including objects used in previous publications. It always delivers the correct result. Comparison with the latest methods shows that it is faster often by tens of times and, in some cases, hundreds of times. (C) 2015 Elsevier Ltd. All rights reserved.", "paper_title": "Identification of faces in line drawings by edge decomposition", "paper_id": "WOS:000360952800002"}