{"auto_keywords": [{"score": 0.04855973119679857, "phrase": "partial_maps"}, {"score": 0.02322730111336099, "phrase": "restriction_category"}, {"score": 0.021038029518678097, "phrase": "restriction_categories"}, {"score": 0.012585606223887675, "phrase": "total_category"}, {"score": 0.004757087682427765, "phrase": "abstract_formulation"}, {"score": 0.0039677715255034595, "phrase": "purely_algebraic_formulation"}, {"score": 0.003308986613384597, "phrase": "restriction_context"}, {"score": 0.003152531962718477, "phrase": "suitable_notion"}, {"score": 0.0030278017562213265, "phrase": "lax_limit"}, {"score": 0.0029553380263320195, "phrase": "particular_interest"}, {"score": 0.0027816546451972725, "phrase": "partial_products"}, {"score": 0.002545165985686468, "phrase": "related_partial_map_category"}, {"score": 0.002504374718975704, "phrase": "extensive_category"}, {"score": 0.0024742098091226203, "phrase": "partial_limits"}, {"score": 0.0024149629835339926, "phrase": "ordinary_limits"}, {"score": 0.0021306709646058295, "phrase": "extensive_completion"}, {"score": 0.0021049977753042253, "phrase": "distributive_category"}], "paper_keywords": [""], "paper_abstract": "A restriction category is an abstract formulation for a category of partial maps, defined in terms of certain specified idempotents called the restriction idempotents. All categories of partial maps are restriction categories; conversely, a restriction category is a category of partial maps if and only if the restriction idempotents split. Restriction categories facilitate reasoning about partial maps as they have a purely algebraic formulation. In this paper we consider colimits and limits in restriction categories. As the notion of restriction category is not self-dual, we should not expect colimits and limits in restriction categories to behave in the same manner. The notion of colimit in the restriction context is quite straightforward, but limits are more delicate. The suitable notion of limit turns out to be a kind of lax limit, satisfying certain extra properties. Of particular interest is the behaviour of the coproduct, both by itself and with respect to partial products. We explore various conditions under which the coproducts are 'extensive' in the sense that the total category (of the related partial map category) becomes an extensive category. When partial limits are present, they become ordinary limits in the total category. Thus, when the coproducts are extensive we obtain as the total category a lextensive category. This provides, in particular, a description of the extensive completion of a distributive category.", "paper_title": "Restriction categories III: colimits, partial limits and extensivity", "paper_id": "WOS:000249229800006"}