{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "gathering_problem"}, {"score": 0.01931585688902614, "phrase": "asynchronous_robots"}, {"score": 0.004779152417705193, "phrase": "dynamic_compasses"}, {"score": 0.004581000737445643, "phrase": "-synchronous_robots"}, {"score": 0.00438399094249306, "phrase": "single_exception"}, {"score": 0.004074212307838049, "phrase": "synchronous_robots"}, {"score": 0.003698442219929622, "phrase": "impossibility_proof"}, {"score": 0.003477505397536663, "phrase": "local_coordinate_systems"}, {"score": 0.003367077034382727, "phrase": "semi-synchronous_and_asynchronous_models"}, {"score": 0.0031938648476635225, "phrase": "unreliable_compass"}, {"score": 0.003101503914610488, "phrase": "absolute_reference_direction"}, {"score": 0.0030563268358422503, "phrase": "local_coordinate_system"}, {"score": 0.002941913249957503, "phrase": "unreliable_compasses"}, {"score": 0.0027579362569638945, "phrase": "new_look-compute-move_cycle"}, {"score": 0.002615977783510631, "phrase": "compass_models"}, {"score": 0.002430824291238387, "phrase": "largest_angle"}, {"score": 0.0023604768913655463, "phrase": "reference_direction"}, {"score": 0.002339771435910601, "phrase": "global_coordinate_system"}, {"score": 0.002298902547676131, "phrase": "semi-synchronous_and_asynchronous_robots"}, {"score": 0.0022389308000757037, "phrase": "semi-synchronous_robots"}, {"score": 0.0021049977753042253, "phrase": "sufficient_conditions"}], "paper_keywords": ["mobile robot", " distributed algorithm", " gathering problem"], "paper_abstract": "Anonymous mobile robots are often classified into synchronous, semi-synchronous, and asynchronous robots when discussing the pattern formation problem. For semi-synchronous robots, all patterns formable with memory are also formable without memory, with the single exception of forming a point (i.e., the gathering) by two robots. (All patterns formable with memory are formable without memory for synchronous robots, and little is known for asynchronous robots.) However, the gathering problem for two semi-synchronous robots without memory (called oblivious robots in this paper) is trivially solvable when their local coordinate systems are consistent, and the impossibility proof essentially uses the inconsistencies in their coordinate systems. Motivated by this, this paper investigates the magnitude of consistency between the local coordinate systems necessary and sufficient to solve the gathering problem for two oblivious robots under semi-synchronous and asynchronous models. To discuss the magnitude of consistency, we assume that each robot is equipped with an unreliable compass, the bearings of which may deviate from an absolute reference direction, and that the local coordinate system of each robot is determined by its compass. We consider two families of unreliable compasses, namely, static compasses with (possibly incorrect) constant bearings and dynamic compasses the bearings of which can change arbitrarily (immediately before a new look-compute-move cycle starts and after the last cycle ends). For each of the combinations of robot and compass models, we establish the condition on deviation phi that allows an algorithm to solve the gathering problem, where the deviation is measured by the largest angle formed between the x-axis of a compass and the reference direction of the global coordinate system: phi < pi/2 for semi-synchronous and asynchronous robots with static compasses, phi < pi/4 for semi-synchronous robots with dynamic compasses, and phi < pi/6 for asynchronous robots with dynamic compasses. Except for asynchronous robots with dynamic compasses, these sufficient conditions are also necessary.", "paper_title": "THE GATHERING PROBLEM FOR TWO OBLIVIOUS ROBOTS WITH UNRELIABLE COMPASSES", "paper_id": "WOS:000300892300003"}