{"auto_keywords": [{"score": 0.031215858888706115, "phrase": "multiplexing_gain"}, {"score": 0.00481495049065317, "phrase": "cognitive_wyner_networks_with_clustered_decoding"}, {"score": 0.00472961267657106, "phrase": "interference_network"}, {"score": 0.004695900553353526, "phrase": "equally_numbered_transmitters"}, {"score": 0.0028857130140890787, "phrase": "high_signal-to-noise_ratio"}, {"score": 0.002824331600674865, "phrase": "sum-rate_capacity"}, {"score": 0.002686124293881678, "phrase": "asymmetric_network"}, {"score": 0.002610198789888055, "phrase": "transmitter_side-information_parameters"}, {"score": 0.0023440589015485077, "phrase": "positive_integer_delta"}, {"score": 0.0021662599012740127, "phrase": "asymmetric_networks"}, {"score": 0.0021049977753042253, "phrase": "left_side-information_parameters"}], "paper_keywords": ["Clustered decoding", " dirty-paper coding", " interference networks", " successive interference cancellation", " message cognition", " multiplexing gain"], "paper_abstract": "We study an interference network where equally numbered transmitters and receivers lie on two parallel lines, with each transmitter opposite its intended receiver. We consider two short-range interference models: the asymmetric network, where the signal sent by each transmitter is interfered only by the signal sent by its left neighbor (if present), and a symmetric network, where it is interfered by both its left and its right neighbors. Each transmitter is cognizant of its own message, the messages of the t(l) transmitters to its left, and the messages of the t(r) transmitters to its right. Each receiver decodes its message based on the signals received at its own antenna, at the r(l) receive antennas to its left, and at the r(r) receive antennas to its right. For such networks, we provide upper and lower bounds on the multiplexing gain, i.e., on the high signal-to-noise ratio asymptotic logarithmic growth of the sum-rate capacity. In some cases, our bounds coincide, e. g., for the asymmetric network. Our results exhibit an equivalence between the transmitter side-information parameters t(l), t(r) and the receiver side-information parameters r(l), r(r) in the sense that increasing/decreasing t(l) or t(r) by a positive integer delta has the same effect on the multiplexing gain as increasing/decreasing r(l) or r(r) by (delta). Moreover-even in asymmetric networks-there is an equivalence between the left side-information parameters (t(l), r(l)) and the right side-information parameters (t(r), r(r)).", "paper_title": "Cognitive Wyner Networks With Clustered Decoding", "paper_id": "WOS:000342416900032"}