{"auto_keywords": [{"score": 0.046954660357611575, "phrase": "feature_detectors"}, {"score": 0.00481495049065317, "phrase": "image_feature_detectors"}, {"score": 0.004747141873785, "phrase": "feature_detection"}, {"score": 0.004663716126870148, "phrase": "fundamental_problem"}, {"score": 0.004061160863655662, "phrase": "recently_proposed_descriptors"}, {"score": 0.0040181585790004274, "phrase": "brisk"}, {"score": 0.003989744516323165, "phrase": "freak"}, {"score": 0.003905689096176873, "phrase": "previous_comparisons"}, {"score": 0.0035995085881892464, "phrase": "comprehensive_review"}, {"score": 0.0035613768414594262, "phrase": "large_number"}, {"score": 0.003536179562674877, "phrase": "popular_feature_detectors"}, {"score": 0.0033647036658823798, "phrase": "generic_comparison"}, {"score": 0.003201516237269705, "phrase": "image_transformations"}, {"score": 0.003167587258150065, "phrase": "illumination_changes"}, {"score": 0.003024665775727446, "phrase": "jpeg"}, {"score": 0.002837305633114947, "phrase": "proper_distinction"}, {"score": 0.002777463594061196, "phrase": "separate_comparisons"}, {"score": 0.00265208877121581, "phrase": "parameter_values"}, {"score": 0.0025869338215971536, "phrase": "statistical_analysis"}, {"score": 0.0023838876943453515, "phrase": "intuitive_matching"}, {"score": 0.002317055705600351, "phrase": "simulated_and_practical_scenarios"}, {"score": 0.002268161377269513, "phrase": "exhaustive_experiments"}, {"score": 0.0021049977753042253, "phrase": "specific_applications"}], "paper_keywords": ["Local features", " Feature detectors", " Feature descriptors", " Comparative study"], "paper_abstract": "Feature detection and matching is a fundamental problem in many computer vision applications. In the past decades, various types of feature detectors and descriptors have been proposed in the literature. Although several comparative studies on feature detectors and descriptors have been performed in the past, few studies have been carried out concerning recently proposed descriptors such as BRISK, FREAK, etc. Also, previous comparisons were either application oriented or limited in experimentation or in the number of detectors and descriptors compared. This paper provides a comprehensive review of a large number of popular feature detectors developed in the last three decades. The study makes several contributions to the development of a generic comparison of feature detectors and descriptors. First, we conduct comparisons of invariance against image transformations such as illumination changes, blurring, rotation, scaling, viewpoint changes, exposure, JPEG compression, combined scaling and rotation, and combined viewpoint changes. Second, we provide a proper distinction between detectors and descriptors using separate comparisons. Third, a few detectors have been tested on the variation of parameter values. Fourth, we conduct a statistical analysis of invariance against four popular types of transformations: viewpoint changes, blurring, scaling, and rotation. Fifth, we carry out intuitive matching between detectors and descriptors, testing on simulated and practical scenarios. Last, we conduct exhaustive experiments on several datasets for each combination of detectors and descriptors to provide a ranking that can also be weighted to suit specific applications.", "paper_title": "A comparative experimental study of image feature detectors and descriptors", "paper_id": "WOS:000354713200002"}