{"auto_keywords": [{"score": 0.0452037966465482, "phrase": "different_fields"}, {"score": 0.00481495049065317, "phrase": "esi-fields"}, {"score": 0.00409188863874203, "phrase": "group's_publications"}, {"score": 0.003971006689166329, "phrase": "first_form"}, {"score": 0.0038702288460744274, "phrase": "internal_mechanism"}, {"score": 0.0037078961288626185, "phrase": "second_form"}, {"score": 0.0036137713873827374, "phrase": "external_mechanism"}, {"score": 0.0034179225740833055, "phrase": "original_group's_expertise"}, {"score": 0.003331134183901191, "phrase": "group's_internal_dynamism"}, {"score": 0.002929056388593134, "phrase": "basic_counting_measures"}, {"score": 0.0027940789980683, "phrase": "field_diffusion_breadth"}, {"score": 0.0026998264237910884, "phrase": "essential_science_indicators"}, {"score": 0.002676779705407304, "phrase": "esi"}, {"score": 0.0021414489155042885, "phrase": "tongji_university"}, {"score": 0.002123154456496788, "phrase": "shanghai"}, {"score": 0.002105126602682775, "phrase": "china"}], "paper_keywords": [""], "paper_abstract": "Two forms of diffusion are studied: diffusion by publications, originating from the fact that a group publishes in different fields; and diffusion by citations, originating from the fact that the group's publications are cited in different fields. The first form of diffusion originates from an internal mechanism by which the group itself expands its own borders. The second form is partly driven by an external mechanism, in the sense that other fields use or become interested in the original group's expertise, and partly by the group's internal dynamism, in the sense that their articles, being published in more and more fields, have the potential to be applied in these other fields. In this contribution, we focus on basic counting measures as measures of diffusion. We introduce the notions of field diffusion breadth, defined as the number of for Essential Science Indicators (ESI) fields in which a set of articles is cited, and field diffusion intensity, defined as the number of citing articles in one particular ESI field. Combined effects of publications and citations can be measured by the Gin! evenness measure. Our approach is illustrated by a study of mathematics at Tongji University (Shanghai, China).", "paper_title": "Knowledge Diffusion Through Publications and Citations: A Case Study Using ESI-Fields as Unit of Diffusion", "paper_id": "WOS:000274038400010"}