{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "biomedical_informatics"}, {"score": 0.011316196957735551, "phrase": "team_members"}, {"score": 0.004462105963334103, "phrase": "research_department"}, {"score": 0.0042489946866108895, "phrase": "symphony_orchestra"}, {"score": 0.004135010810625326, "phrase": "different_disciplines"}, {"score": 0.003728966994353039, "phrase": "biomedical_research"}, {"score": 0.0035701213515857227, "phrase": "one's_instrument"}, {"score": 0.0031500213134140953, "phrase": "successful_career"}, {"score": 0.003048782877550259, "phrase": "performance_assessments"}, {"score": 0.0029029754274913803, "phrase": "refereed_publications"}, {"score": 0.0028404241985421096, "phrase": "continued_existence"}, {"score": 0.002347378595930709, "phrase": "other's_competences"}, {"score": 0.0022595316565074326, "phrase": "good_leader"}, {"score": 0.0021049977753042253, "phrase": "assessment_studies"}], "paper_keywords": ["biomedical informatics", " refereed publications", " quality of research", " assessment", " research management"], "paper_abstract": "Objective: To draw a parallel between the challenges by which a research department in biomedical informatics is confronted and those of a symphony orchestra; in both areas different disciplines and various groups of instruments can be discerned. Method: Retrospective, personal review of how to conduct biomedical research. Results: The importance of mastering one's instrument and the harmony between the team members is stressed. The conductor has to motivate all players so that they can have a successful career. Competition between orchestras and performance assessments determine survival and success. A record of refereed publications is crucial for continued existence. Conclusions: Biomedical informatics is typically multidisciplinary. Hypotheses underlying research should be carefully formulated. The time from research to application may easily take 20 years or more. Mutual trust and knowing each other's competences is essential for success. A good leader gives enough room to all team members to develop their careers. The outcomes of assessment studies are directly related to the quality of publications.", "paper_title": "The young person's guide to biomedical informatics", "paper_id": "WOS:000242859600013"}