{"auto_keywords": [{"score": 0.038144273595000555, "phrase": "fenton"}, {"score": 0.00481495049065317, "phrase": "participatory_sensing"}, {"score": 0.004772060936021876, "phrase": "emerging_field"}, {"score": 0.004495687920571303, "phrase": "personal_or_local_enquiries"}, {"score": 0.0043505358211043425, "phrase": "official_sources"}, {"score": 0.004273338516164498, "phrase": "ordinary_people"}, {"score": 0.0037139814615660943, "phrase": "prototype_tools"}, {"score": 0.003669888501738697, "phrase": "mobile_users-located_lexicon"}, {"score": 0.0035939771701044773, "phrase": "tall_buildings"}, {"score": 0.0033453930912354796, "phrase": "user-generated_content"}, {"score": 0.003123265938453612, "phrase": "second_project"}, {"score": 0.0030404045763332437, "phrase": "publicly_available_app"}, {"score": 0.0027631437773897967, "phrase": "specific_enquiry"}, {"score": 0.0027303083730101734, "phrase": "last_project"}, {"score": 0.0024226175164573406, "phrase": "human_sensor"}, {"score": 0.0023372424895785125, "phrase": "new_discoveries"}, {"score": 0.00231637194556478, "phrase": "underlying_premise"}, {"score": 0.002188442250414479, "phrase": "crowd-sourced_data"}, {"score": 0.0021049977753042253, "phrase": "physical_environment"}], "paper_keywords": ["Crowd sourcing", " Citizen", " Location-based learning", " Participatory sensing"], "paper_abstract": "Participatory sensing is an emerging field in which citizens are empowered by technologies to monitor their own environments. Harvesting and analysing data gathered in response to personal or local enquiries can be seen as an antidote to information provided by official sources. Democratising sensing means that ordinary people can learn about and understand the world around them better and can be a part of the decision-making in improving environments for all. In this paper, we review and describe participatory sensing and discuss this in relation to making a series of prototype tools and applications for mobile users-Located Lexicon, Where's Fenton? and Tall Buildings. In the first of these projects, Located Lexicon, we wanted to find out whether a lexicon of terms derived from user-generated content could enable the formation of Twitter like groups that allow users to engage in finding out more about their location. In the second project, Where's Fenton? we made a publicly available app that involves users in counting the abundance and logging the location of deer in a park. This project focused specifically on anonymity of the user in collecting data for a specific enquiry. In the last project, Tall Buildings, we experimented with using dimensions of altitude, distance and speed to encourage users to physically explore a city from its rooftops. In all of these projects, we experiment with the pedestrian as a human sensor and the methods and roles they may engage in to make new discoveries. The underlying premise for our work is that it is not possible to calibrate people to be identical, so experimenting with crowd-sourced data opens up thinking about the way we observe and learn about the physical environment.", "paper_title": "Crowds, citizens and sensors: process and practice for mobilising learning", "paper_id": "WOS:000331801500023"}