{"auto_keywords": [{"score": 0.04372212308378597, "phrase": "groupware_systems"}, {"score": 0.004814974089936643, "phrase": "metamodel"}, {"score": 0.004716113134313215, "phrase": "visual_modeling_language"}, {"score": 0.004667454318370122, "phrase": "interactive_groupware_applications"}, {"score": 0.0044469055125323466, "phrase": "software_development"}, {"score": 0.004401011982385274, "phrase": "supported_cooperative_work"}, {"score": 0.0043106348117582915, "phrase": "software_systems"}, {"score": 0.004135387221172467, "phrase": "complex_task"}, {"score": 0.003290986600659723, "phrase": "interactive_and_collaborative_issues"}, {"score": 0.003124437382827821, "phrase": "collaborative_interactive_application_notation"}, {"score": 0.0028554143163813947, "phrase": "interactive_group_work"}, {"score": 0.00254697318939512, "phrase": "cian."}, {"score": 0.0024773480858940504, "phrase": "metamodeling_facilities"}, {"score": 0.0024432508011008563, "phrase": "eclipse_platform"}, {"score": 0.002401286805515306, "phrase": "empirical_study"}, {"score": 0.0022639147412879487, "phrase": "software_engineers"}, {"score": 0.002164180792169302, "phrase": "development_process"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Groupware design", " Interaction Design", " DSL", " Metamodel", " MDE"], "paper_abstract": "This work is framed in the area of software development for Computer Supported Cooperative Work (CSCW). These software systems are called groupware systems. The development of groupware systems is a complex task, a problem that can be addressed applying the Model Driven Engineering (MDE) principles and techniques, where the use of models is essential. However, there are no proposals to address all issues to model in this kind of application (group work, shared context, coordination, etc.) and, in particular, there are no proposals that consider the modeling of both interactive and collaborative issues. To solve this deficiency, a domain-specific language (DSL) called Collaborative Interactive Application Notation (CIAN) has been proposed. To define this DSL a metamodel has been created describing the universe of discourse of the applications supporting interactive group work. We have defined the syntax and semantics of this language. We have also implemented a tool (called OAT) for supporting the edition and validation of models created with CIAN. This tool has been implemented using the metamodeling facilities provided by the Eclipse platform. Finally, an empirical study was conducted with the aim of verifying the suitability of this approach and the perception of software engineers about its usefulness. The results obtained show that our proposal can facilitate the development process of groupware systems. (C) 2012 Elsevier Inc. All rights reserved.", "paper_title": "Metamodel-driven definition of a visual modeling language for specifying interactive groupware applications: An empirical study", "paper_id": "WOS:000319847600006"}