{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "semi-synchronised_task"}, {"score": 0.0047701277915006, "phrase": "large-scale_computer_vision_problems"}, {"score": 0.004740836680805889, "phrase": "distributed"}, {"score": 0.004580646169804186, "phrase": "large-scale_science_and_engineering_problems"}, {"score": 0.004467785611058897, "phrase": "attractive_scalability_properties"}, {"score": 0.004303664701305258, "phrase": "task_farming"}, {"score": 0.004184526032558792, "phrase": "typical_characteristic"}, {"score": 0.004055998173160551, "phrase": "distributed_subtasks"}, {"score": 0.004018212085786494, "phrase": "overall_computation"}, {"score": 0.003968375473736599, "phrase": "interesting_large-scale_task_farming_problem_instances"}, {"score": 0.0038826383289526857, "phrase": "subtask_sets"}, {"score": 0.003647709172212356, "phrase": "distributed_formulations"}, {"score": 0.00338441786634626, "phrase": "framework_scalability"}, {"score": 0.0031696255948160923, "phrase": "independent_subtasks"}, {"score": 0.0030245745670310835, "phrase": "synchronised_global_decisions"}, {"score": 0.00294993976383467, "phrase": "distributed_results"}, {"score": 0.0028414166961286233, "phrase": "subtask_distribution"}, {"score": 0.002814913791165247, "phrase": "result_collation_process"}, {"score": 0.0027799596509593166, "phrase": "overall_problem_solutions"}, {"score": 0.0026115760183617947, "phrase": "predictive_model"}, {"score": 0.002595307614796063, "phrase": "overall_task_completion_time"}, {"score": 0.0025630734211267102, "phrase": "experimental_benchmark_results"}, {"score": 0.0024842242921857705, "phrase": "real-world_problems"}, {"score": 0.0023927929565329873, "phrase": "serial_fashion"}, {"score": 0.00234834406550549, "phrase": "predicted_time_savings"}, {"score": 0.002247807356218318, "phrase": "complex_problems"}, {"score": 0.0022268288922192704, "phrase": "real-world_computer_vision_tasks"}, {"score": 0.002165058408875865, "phrase": "performance_gain"}, {"score": 0.0021049977753042253, "phrase": "resource_intensive_computer_vision_tasks"}], "paper_keywords": ["Vision", " task farming", " semi-synchronised"], "paper_abstract": "Distributed compute clusters allow the computing power of heterogeneous (and homogeneous) resources to be utilised to solve large-scale science and engineering problems. One class of problem that has attractive scalability properties, and is therefore often implemented using compute clusters, is task farming (or parameter sweep) applications. A typical characteristic of such applications is that no communication is needed between distributed subtasks during the overall computation. However, interesting large-scale task farming problem instances that do require global communication between subtask sets also exist. We propose a framework called semi-synchronised task farming in order to address problems requiring distributed formulations containing subtasks that alternate between independence and synchronisation. We apply this framework to several large-scale contemporary computer vision problems and present a detailed performance analysis to demonstrate framework scalability. Semi-synchronised task farming splits a given problem into a number of stages. Each stage involves firstly distributing independent subtasks to be completed in parallel. Following subtask set completion, a set of synchronised global decisions, based on information retrieved from the distributed results, is made. The results influence the following subtask distribution stage. This subtask distribution followed by result collation process is iterated until overall problem solutions are obtained. We construct a simplified Bulk Synchronous Parallel (BSP) model to formalise this framework and with this formalisation, we develop a predictive model for overall task completion time. We present experimental benchmark results comparing the performance observed by applying our framework to solve real-world problems on compute clusters with that of solving the tasks in a serial fashion. Furthermore by assessing the predicted time savings that our framework provides in simulation and validating these predictions on a range of complex problems drawn from real-world computer vision tasks, we are able to reliably predict the performance gain obtained when using a compute cluster to tackle resource intensive computer vision tasks.", "paper_title": "Applying semi-synchronised task farming to large-scale computer vision problems", "paper_id": "WOS:000362996700004"}