{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "desktop_virtual_reality"}, {"score": 0.0497055404009025, "phrase": "online_learning_management_systems"}, {"score": 0.004721602309430702, "phrase": "virtual_reality"}, {"score": 0.004666460260366703, "phrase": "emerging_educational_technology"}, {"score": 0.00454027551702508, "phrase": "online_learning_contexts"}, {"score": 0.004452228677941085, "phrase": "limited_body"}, {"score": 0.004331811712726697, "phrase": "current_multimedia_learning_techniques"}, {"score": 0.004281202319048493, "phrase": "new_forms"}, {"score": 0.0041328796505374155, "phrase": "learning_management_systems"}, {"score": 0.003943047070755799, "phrase": "visually_complex_and_highly_concrete_desktop_virtual_reality"}, {"score": 0.003806395038279074, "phrase": "managements_systems"}, {"score": 0.003703380599999214, "phrase": "recent_signaling_literature"}, {"score": 0.0036315039559860654, "phrase": "multimedia_learning"}, {"score": 0.0036031440110534853, "phrase": "hypermedia_learning"}, {"score": 0.0034375594065869032, "phrase": "important_information"}, {"score": 0.002501835053002899, "phrase": "first_attempt"}, {"score": 0.0023220573674955776, "phrase": "important_gap"}, {"score": 0.0021636476333109144, "phrase": "recent_signaling-related_literature"}, {"score": 0.0021049977753042253, "phrase": "future_work"}], "paper_keywords": ["Virtual reality", " Interactive learning environments", " Media in education", " Multimedia/hypermedia systems", " Architectures for educational technology system"], "paper_abstract": "Desktop virtual reality is an emerging educational technology that offers many potential benefits for learners in online learning contexts: however, a limited body of research is available that connects current multimedia learning techniques with these new forms of media. Because most formal online learning is delivered using learning management systems, it is important to consider how to best integrate the visually complex and highly concrete desktop virtual reality into more text-driven and abstract environments such as those found in learning managements systems. This review of literature examines recent signaling literature within the context of multimedia learning and hypermedia learning. Signaling is a technique that involves using cues to emphasize important information in materials (Mayer, 2009, pp. 108-117). The analysis concluded that the depth and breadth of signaling literature is severely lacking. While certain related bodies of literature can be used to inform signaling research in desktop virtual reality and online learning management systems, no studies were found that directly address these topics. This article makes several important contributions to the body of signaling literature. First, based on what is known through literature, this article is a first attempt at examining signaling as a technique for integrating desktop virtual reality with online learning management systems. Second, this analysis resolves an important gap in literature by differentiating between signaling and cueing. Third, this article provides a survey of recent signaling-related literature and identifies specific areas that inform future work with desktop virtual reality delivered using online learning management systems. Finally, a taxonomy for classifying multimedia and hypermedia is presented as a tool for more effectively describing interventions used in signaling research. (C) 2012 Elsevier Ltd. All rights reserved.", "paper_title": "Use of signaling to integrate desktop virtual reality and online learning management systems", "paper_id": "WOS:000309307300003"}