{"auto_keywords": [{"score": 0.03984961577718066, "phrase": "brand_community"}, {"score": 0.0045208777171271254, "phrase": "online_communities"}, {"score": 0.004069963083642548, "phrase": "consumers'_motives"}, {"score": 0.003929843413153981, "phrase": "knowledge_sharing"}, {"score": 0.0035625556447293804, "phrase": "moderating_effect"}, {"score": 0.0034884152484429207, "phrase": "proposed_relationships"}, {"score": 0.00329813918116714, "phrase": "iphone_community"}, {"score": 0.0032522158902055084, "phrase": "thailand"}, {"score": 0.0031845067058084613, "phrase": "main_findings"}, {"score": 0.0031182092708983184, "phrase": "achievement_motive"}, {"score": 0.002388487669097511, "phrase": "positive_effect"}, {"score": 0.0023551955270737215, "phrase": "members'_achievement_motive"}], "paper_keywords": ["Achievement Motive", " Affiliation Motive", " Power Motive", " Trust", " Knowledge Sharing", " Online Brand Community"], "paper_abstract": "In cyberspace, more and more consumers interact with each other and exchange knowledge within online communities. This study examines why consumers share their valuable knowledge, and also investigates under what conditions consumers' motives strengthen the effects on knowledge sharing and other favorable behaviors related with brand community. This study proposes that trust has a moderating effect on the proposed relationships. Based on a survey of an iPhone community in Thailand, the main findings indicated that achievement motive plays the most important role in members being motivated to share their knowledge, and leads to their intentions to participate, recommend the community, and remain loyal to the brand. In addition, this study indicates that the positive effect of members' achievement motive on knowledge sharing and other behaviors related with brand community tend to be strengthened when members have more trust in others.", "paper_title": "WHY SHOULD I SHARE? EXAMINING CONSUMERS' MOTIVES AND TRUST ON KNOWLEDGE SHARING", "paper_id": "WOS:000281129300002"}