{"auto_keywords": [{"score": 0.048877326221094704, "phrase": "relational_databases"}, {"score": 0.015719716506582538, "phrase": "semantic_transformation"}, {"score": 0.014761647623557366, "phrase": "semantic_web"}, {"score": 0.009941789262838863, "phrase": "iconomy"}, {"score": 0.004098725744818192, "phrase": "semantic_querying"}, {"score": 0.003978866233891427, "phrase": "thrust_semantic_technologies"}, {"score": 0.0037178503842258087, "phrase": "efficient_tools"}, {"score": 0.003593812067062062, "phrase": "legacy_data"}, {"score": 0.0033579708256295847, "phrase": "remarkable_efforts"}, {"score": 0.003259702394241964, "phrase": "required_functionality"}, {"score": 0.0027159843922738916, "phrase": "economy"}, {"score": 0.0025810006125483835, "phrase": "friendly_user_interface"}, {"score": 0.0023013968622710847, "phrase": "extensive_analysis"}, {"score": 0.002177762848946681, "phrase": "different_datasets"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Relational database to ontology transformation", " SPARQL query builder", " Ontology editor", " OWL-DL restriction creation"], "paper_abstract": "The transition from the traditional to the Semantic Web has proven much more difficult than initially expected. The volume, complexity and versatility of data of various domains, the computational limitations imposed on semantic querying and inferencing have drastically reduced the thrust semantic technologies had when initially introduced. In order for the semantic web to actually 'work' efficient tools are needed, allowing the semantic transformation of legacy data, which can then be queried, processed and reasoned upon. And, though remarkable efforts exist towards tackling part of the required functionality, no system integrates all tasks in a user-friendly, easy-to-adapt manner. In this context, we introduce Iconomy, an integrated framework for enhancing the Semantic Transformation, Editing and Querying of Relational Databases. Aiming to ease-of-use, scalability and extensibility, Economy supports state-of-the-art APIs and provides a friendly user interface to map Relational Databases into Ontologies, generate them, and consequently edit, manipulate, and infer on them as needed. This paper provides an extensive analysis of Iconomy and thoroughly discusses its performance through a number of experiments on different datasets and various configurations. (C) 2010 Elsevier Ltd. All rights reserved.", "paper_title": "An integrated framework for enhancing the semantic transformation, editing and querying of relational databases", "paper_id": "WOS:000286904600103"}