{"auto_keywords": [{"score": 0.014261605125329832, "phrase": "new_method"}, {"score": 0.01184905096231236, "phrase": "average_decision_matrix"}, {"score": 0.010746050542833221, "phrase": "ranking_decision_matrix"}, {"score": 0.009937300741368229, "phrase": "absolute_positive_ideal_solution"}, {"score": 0.008011066663524306, "phrase": "relative_degree"}, {"score": 0.00481495049065317, "phrase": "fuzzy_multiple_attributes_group"}, {"score": 0.0041136473765874815, "phrase": "proposed_ranking_method"}, {"score": 0.00401366649759512, "phrase": "topsis"}, {"score": 0.0036733470451885465, "phrase": "decision_matrix"}, {"score": 0.003462599815177726, "phrase": "weighting_decision_matrix"}, {"score": 0.003428665921276366, "phrase": "average_weighting_decision_matrix"}, {"score": 0.0032160319265621285, "phrase": "ranking_values"}, {"score": 0.002986969236641105, "phrase": "absolute_negative_ideal_solution"}, {"score": 0.002551231163230566, "phrase": "negative_ideal_solution"}, {"score": 0.0021049977753042253, "phrase": "proposed_fuzzy_multiple_attributes_group_decision-making_method"}], "paper_keywords": ["Fuzzy multiple attributes group decision-making", " interval type-2 fuzzy sets", " ranking values", " type-1 fuzzy sets", " type-2 fuzzy sets"], "paper_abstract": "In this paper, we present a new method for fuzzy multiple attributes group decision-making based on the proposed ranking method of trapezoidal interval type-2 fuzzy sets and the TOPSIS method. Firstly, we present a new method for ranking trapezoidal interval type-2 fuzzy sets. Secondly, we construct the decision matrix and the average decision matrix, respectively. Thirdly, we construct the weighting decision matrix and average weighting decision matrix, respectively. Fourthly, we construct the ranking decision matrix by calculating the ranking values of trapezoidal interval type-2 fuzzy sets in the average decision matrix. Then, we get the absolute positive ideal solution and the absolute negative ideal solution with respect to the attributes based on the ranking decision matrix. Then, we calculate the distance between each alternative and the absolute positive ideal solution and calculate the distance between each alternative and the negative ideal solution, respectively. Finally, we calculate the relative degree of closeness of each alternative. The larger the value of the relative degree of closeness of an alternative, the better the preference order of the alternative. The proposed fuzzy multiple attributes group decision-making method can overcome the drawbacks of the existing method.", "paper_title": "Fuzzy Multiple Attributes Group Decision-Making Based on Ranking Interval Type-2 Fuzzy Sets and the TOPSIS Method", "paper_id": "WOS:000345627700009"}