{"auto_keywords": [{"score": 0.026238043721995456, "phrase": "xquery"}, {"score": 0.015719673210079107, "phrase": "molecular_interactions"}, {"score": 0.010573063519742703, "phrase": "available_xquery_implementations"}, {"score": 0.0047310525657970615, "phrase": "biology_researchers"}, {"score": 0.004669085371587273, "phrase": "new_information"}, {"score": 0.004468304427278713, "phrase": "living_organisms"}, {"score": 0.004146510711518748, "phrase": "large_quantities"}, {"score": 0.003698442219929622, "phrase": "xml_query_language_xquery"}, {"score": 0.003539252646181146, "phrase": "great_benefit"}, {"score": 0.0033572130837348623, "phrase": "new_standards"}, {"score": 0.0031986115255985474, "phrase": "exist"}, {"score": 0.003115192197762829, "phrase": "sedna"}, {"score": 0.002967931416941965, "phrase": "available_databases"}, {"score": 0.0026121403051734744, "phrase": "path_analysis"}, {"score": 0.0025665261770229757, "phrase": "poor_performance"}, {"score": 0.002499590390751339, "phrase": "gtl_package"}, {"score": 0.0021049977753042253, "phrase": "exact_xml_format"}], "paper_keywords": [""], "paper_abstract": "Currently, biology researchers rapidly generate new information on how genes, proteins and other molecules interact in living organisms. To completely understand the machinery underlying life it is necessary to integrate and analyze these large quantities of data. As one step in this direction, new standards for describing molecular interactions have been defined based on XML. This work evaluates the usage of the XML Query language XQuery for molecular interactions, as it would be of great benefit to the user to work directly on data represented in the new standards. We use and compare a set of available XQuery implementations, eXist, X-Hive, Sedna and QizX/open for querying and analysis on data exported from available databases. Our conclusion is that XQuery can easily be used for the most common queries in this domain but is not feasible for more complex analyses. In particular, for queries containing path analysis the available XQuery implementations have poor performance and an extension of the GTL package clearly outperforms XQuery. The paper ends with a discussion regarding the usability of XQuery in this domain. In particular we point out the need for more efficient graph handling and that XQuery also requires the user to understand the exact XML format of each dataset.", "paper_title": "An evaluation of the use of XML for representation, querying, and analysis of molecular interactions", "paper_id": "WOS:000241726200020"}