{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "cognitive_radio_networks"}, {"score": 0.04960770684597511, "phrase": "virtual_currency"}, {"score": 0.03684812759828971, "phrase": "spectrum_manager"}, {"score": 0.029114347948882256, "phrase": "credit_restriction"}, {"score": 0.004791189907641631, "phrase": "truthful_mechanisms"}, {"score": 0.004662577395989494, "phrase": "secondary_users"}, {"score": 0.004537401559396022, "phrase": "primary_users"}, {"score": 0.004515055376217591, "phrase": "pus"}, {"score": 0.004470539706227421, "phrase": "spectrum_resources"}, {"score": 0.004244154690664235, "phrase": "sharing_techniques"}, {"score": 0.004089475312474684, "phrase": "game-theoretical_mechanism_design"}, {"score": 0.003930776076972385, "phrase": "pu"}, {"score": 0.003844054013713442, "phrase": "central_spectrum_manager"}, {"score": 0.0036675426354091027, "phrase": "su"}, {"score": 0.0036402517506293405, "phrase": "free_channel"}, {"score": 0.003577691211998842, "phrase": "local_information"}, {"score": 0.003447217189651963, "phrase": "conflict-free_allocation"}, {"score": 0.003413232230649291, "phrase": "truthful_mechanism"}, {"score": 0.003038066486989815, "phrase": "monetary_payments"}, {"score": 0.002884010773073439, "phrase": "spectrum_allocation"}, {"score": 0.0026839922027139967, "phrase": "benefit_maximizers"}, {"score": 0.0025988789415489775, "phrase": "true_valuation"}, {"score": 0.0025102269227061428, "phrase": "desired_spectrum_sharing_criteria"}, {"score": 0.0022396397070125317, "phrase": "different_sharing_objectives"}], "paper_keywords": ["Wireless networks", " Cognitive radio", " Radio spectrum management", " Channel allocation", " Game theory", " Mechanism design"], "paper_abstract": "In cognitive radio networks, there are scenarios where secondary users (SUs) utilize opportunistically the spectrum originally allocated to primary users (PUS). The spectrum resources available to SUs fluctuates over time due to PUs activity, SUs mobility and competition between SUs. In order to utilize these resources efficiently spectrum sharing techniques need to be implemented. In this paper we present an approach based on game-theoretical mechanism design for dynamic spectrum sharing. Each time a channel is not been used by any PU, it is allocated to SUs by a central spectrum manager based on the valuations of the channel reported by all SUs willing to use it. When an SU detects a free channel, it estimates its capacity according to local information and sends the valuation of it to the spectrum manager. The manager calculates a conflict-free allocation by implementing a truthful mechanism. The SUs have to pay for the allocation an amount which depends on the set of valuations. The objective is not to trade with the spectrum, but to share it according to certain criteria. For this, a virtual currency is defined and therefore monetary payments are not necessary. The spectrum manager records the credit of each SU and redistributes the payments to them after each spectrum allocation. The mechanism restricts the chances of each SU to be granted the channel depending on its credit availability. This credit restriction provides an incentive to SUs to behave as benefit maximizers. If the mechanism is truthful, their best strategy is to communicate the true valuation of the channel to the manager, what makes possible to implement the desired spectrum sharing criteria. We propose and evaluate an implementation of this idea by using two simple mechanisms which are proved to be truthful, and that are tractable and approximately efficient. We show the flexibility of these approach by illustrating how these mechanisms can be modified to achieve different sharing objectives which are trade-offs between efficiency and fairness. We also investigate how the credit restriction and redistribution affects the truthfulness of these mechanisms. (C) 2013 Elsevier B.V. All rights reserved.", "paper_title": "Dynamic spectrum sharing in cognitive radio networks using truthful mechanisms and virtual currency", "paper_id": "WOS:000321177300014"}