{"auto_keywords": [{"score": 0.04905833888034288, "phrase": "fluid-land_boundaries"}, {"score": 0.04501610610489925, "phrase": "boundary_scheme"}, {"score": 0.03644451033122436, "phrase": "conservation_properties"}, {"score": 0.029454707050405576, "phrase": "new_scheme"}, {"score": 0.00481495049065317, "phrase": "shallow_water_equations"}, {"score": 0.00476334344613564, "phrase": "numerical_scheme"}, {"score": 0.004529696178827392, "phrase": "domain-summed_mass"}, {"score": 0.00441718685609235, "phrase": "potential_enstrophy"}, {"score": 0.004354149483556514, "phrase": "arbitrarily_shaped_boundaries"}, {"score": 0.004230749292148046, "phrase": "previous_scheme"}, {"score": 0.0038671299350540554, "phrase": "evolution_equations"}, {"score": 0.003798231095121328, "phrase": "extrapolation_formulas"}, {"score": 0.0035858673522839407, "phrase": "potential_enstrophy_conservation"}, {"score": 0.0035346515636097533, "phrase": "numerical_simulations"}, {"score": 0.003373181367365139, "phrase": "inviscid_flows"}, {"score": 0.003006353490112716, "phrase": "free-slip_boundary_condition"}, {"score": 0.002942138511829811, "phrase": "super-slip_condition"}, {"score": 0.0028689475587958917, "phrase": "no-slip_condition"}, {"score": 0.0025568135952982345, "phrase": "spurious_energy_cascade"}, {"score": 0.0025293479382942257, "phrase": "smallest_resolved_scales"}, {"score": 0.002493184318829227, "phrase": "correct_flow_orientation"}, {"score": 0.0023451553255837317, "phrase": "vorticity_fields"}, {"score": 0.0023199580436336163, "phrase": "smaller_errors"}, {"score": 0.0022540779997940897, "phrase": "alternative_schemes"}, {"score": 0.0022138542785562444, "phrase": "depth_and_velocity_fields"}], "paper_keywords": ["Shallow water equations", " Boundary conditions", " Conservation", " Energy", " Vorticity", " Potential enstrophy"], "paper_abstract": "A numerical scheme for treating fluid-land boundaries in inviscid shallow water flows is derived that conserves the domain-summed mass, energy, vorticity, and potential enstrophy in domains with arbitrarily shaped boundaries. The boundary scheme is derived from a previous scheme that conserves all four domain-summed quantities only in periodic domains without boundaries. It consists of a method for including land in the model along with evolution equations for the vorticity and extrapolation formulas for the depth at fluid-land boundaries. Proofs of mass, energy, vorticity, and potential enstrophy conservation are given. Numerical simulations are carried out demonstrating the conservation properties and accuracy of the boundary scheme for inviscid flows and comparing its performance with that of four alternative boundary schemes. The first of these alternatives extrapolates or finite-differences the velocity to obtain the vorticity at boundaries: the second enforces the free-slip boundary condition; the third enforces the super-slip condition; and the fourth enforces the no-slip condition. Comparisons of the conservation properties demonstrate that the new scheme is the only one of the five that conserves all four domain-summed quantities, and it is the only one that both prevents a spurious energy cascade to the smallest resolved scales and maintains the correct flow orientation with respect to ail external forcing. Comparisons of the accuracy demonstrate that the new scheme generates vorticity fields that have smaller errors than those generated by any of the alternative schemes, and it generates depth and velocity fields that have errors about equal to those in the fields generated by the most accurate alternative scheme. (C) 2008 Elsevier Inc. All rights reserved.", "paper_title": "A mass, energy, vorticity, and potential enstrophy conserving lateral fluid-land boundary scheme for the shallow water equations", "paper_id": "WOS:000261472700001"}