{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "functional_linkages"}, {"score": 0.04907561130245922, "phrase": "enhanced_phylogenetic_trees"}, {"score": 0.004566567411073082, "phrase": "pairwise_relationships"}, {"score": 0.004377077848734575, "phrase": "biological_tasks"}, {"score": 0.004262643556463569, "phrase": "functionally_linked_proteins"}, {"score": 0.0039369107163201855, "phrase": "correlated_fashion"}, {"score": 0.0037935066882208235, "phrase": "phylogenetic_profiling-based_approaches"}, {"score": 0.003674738405118697, "phrase": "protein_families"}, {"score": 0.0036167509502276294, "phrase": "similar_evolutionary_patterns"}, {"score": 0.003522124318486352, "phrase": "evolutionary_pattern"}, {"score": 0.0031676593724896075, "phrase": "occurrence_profile"}, {"score": 0.0026447893350441502, "phrase": "protein_family"}, {"score": 0.002548331088496964, "phrase": "duplication_events"}, {"score": 0.002508073621696602, "phrase": "topological_comparison"}, {"score": 0.002378408229095287, "phrase": "functionally_associated_protein_pairs"}, {"score": 0.002231607958228148, "phrase": "greater_performance"}, {"score": 0.0021049977753042253, "phrase": "conventional_approaches"}], "paper_keywords": [""], "paper_abstract": "Motivation: Functional linkages implicate pairwise relationships between proteins that work together to implement biological tasks. During evolution, functionally linked proteins are likely to be preserved or eliminated across a range of genomes in a correlated fashion. Based on this hypothesis, phylogenetic profiling-based approaches try to detect pairs of protein families that show similar evolutionary patterns. Traditionally, the evolutionary pattern of a protein is encoded by either a binary profile of presence and absence of this protein across species or an occurrence profile that indicates the distribution of copies of this protein across species. Results: In our study, we characterize each protein by its enhanced phylogenetic tree, a novel graphical model of the evolution of a protein family with explicitly marked by speciation and duplication events. By topological comparison between enhanced phylogenetic trees, we are able to detect the functionally associated protein pairs. Because the enhanced phylogenetic trees contain more evolutionary information of proteins, our method shows greater performance and discovers functional linkages among proteins more reliably compared with the conventional approaches.", "paper_title": "A novel method for assigning functional linkages to proteins using enhanced phylogenetic trees", "paper_id": "WOS:000287758400015"}