{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "ici"}, {"score": 0.004851483992967704, "phrase": "mc-cdma"}, {"score": 0.004278807087784626, "phrase": "novel_two-dimensional_multiple_access_interference"}, {"score": 0.003939296259436904, "phrase": "partial_block"}, {"score": 0.0036052633308076933, "phrase": "frequency_domain"}, {"score": 0.0034185505275141077, "phrase": "undesired_user_data"}, {"score": 0.0032800186243040663, "phrase": "estimated_value"}, {"score": 0.0030017207229983385, "phrase": "residual_mai_limiting_improvements"}, {"score": 0.0029489527539649737, "phrase": "bit_error_rate"}, {"score": 0.002246553137021003, "phrase": "two-dimensional_cancellation"}, {"score": 0.002130056082139311, "phrase": "strict_requirement"}, {"score": 0.0021049977753042253, "phrase": "low_ber_performance"}], "paper_keywords": ["PB/MC-CDMA", " partial block multi-carrier code division multiple access", " MAI", " multiple access interference", " information cancellation", " diversity"], "paper_abstract": "In this paper, we introduce the novel two-dimensional multiple access interference (MAI) cancellation scheme in order to improve the performance in the partial block multi-carrier code division multiple access (PB/MC-CDMA) environment. In conventional MC-CDMA systems, interference cancellation is typically accomplished in the frequency domain, however, as is commonly understood, undesired user data used in the cancellation is an estimated value; therefore, the interference cannot be completely eliminated, resulting in the residual MAI limiting improvements in the bit error rate (BER) performance. In this paper, we apply cancellation in both the frequency and time domains, by combining the signals after two separate domain cancellations, thus obtaining diversity. The disadvantage of this method is that the calculation on the receiver is slightly complicated; however, this two-dimensional cancellation is advocated for situations where there is a strict requirement for low BER performance.", "paper_title": "The novel two-dimensional ICI cancellation scheme for a PB/MC-CDMA system in a frequency selective fading channel", "paper_id": "WOS:000360156900004"}