{"auto_keywords": [{"score": 0.045030213757960014, "phrase": "organisational_trust"}, {"score": 0.014175101864629438, "phrase": "hrm_system"}, {"score": 0.005594644001164708, "phrase": "calculative_commitment"}, {"score": 0.005415032200476192, "phrase": "affective_commitment"}, {"score": 0.00481495049065317, "phrase": "hrm-trust-commitment_relationships"}, {"score": 0.004540064673326908, "phrase": "work_environment"}, {"score": 0.004280804599325052, "phrase": "employee_commitment"}, {"score": 0.004156771871665922, "phrase": "poland"}, {"score": 0.003906510969606783, "phrase": "theoretical_model"}, {"score": 0.0038431888954930083, "phrase": "structural_equation_modelling"}, {"score": 0.0038181472934630347, "phrase": "findings_-_research_findings"}, {"score": 0.003507023579658917, "phrase": "starting_point"}, {"score": 0.003285002755070214, "phrase": "hrm_process"}, {"score": 0.003210652026669616, "phrase": "research_findings"}, {"score": 0.003007337114346301, "phrase": "strong_determinant"}, {"score": 0.002681941877978843, "phrase": "mutual_relationship"}, {"score": 0.0026384167183586015, "phrase": "hrm_practices"}, {"score": 0.002545125352770175, "phrase": "previous_research"}, {"score": 0.0023222451073718854, "phrase": "allen"}, {"score": 0.0023070887179610314, "phrase": "mayer"}, {"score": 0.002247446386787241, "phrase": "new_aspect"}, {"score": 0.002225481283887324, "phrase": "commitment_-_calculative"}, {"score": 0.0021049977753042253, "phrase": "mediating_influence"}], "paper_keywords": ["Organizational trust", " Affective and calculative commitment", " HRM system"], "paper_abstract": "Purpose - It is worth focusing on the examination of factors influencing the quality of the work environment. The purpose of this paper is to verify the influence of the HRM system and organisational trust on employee commitment. Design/methodology/approach - The survey was conducted in Poland among 370 employees in organisations from two sectors of the economy: services and industry. The verification of the theoretical model was performed based on structural equation modelling. Findings - Research findings made it possible to successfully verify the model of the relationship between the HRM system (practices, process), organisational trust and commitment. The starting point for trust in an organisation followed by commitment is the HRM system. It seems that the impact of the HRM process on creating organisational trust is higher. Research findings have also confirmed a relationship between each type of organisational trust and calculative commitment based on benefits, which is a strong determinant of affective commitment. Organisational trust is, therefore, an intermediary factor because the organisation must build trust in employees first before they become affectively committed. Originality/value - Current studies have not examined the issue of a mutual relationship between three constructs: perceived HRM practices and process, organisational trust and commitment. What is more, previous research was confined to the constructs analysed holistically without considering their complexity (different types of trust and commitment). In addition, the authors attempted to enrich Allen and Mayer's (1991) model with a new aspect of the commitment - calculative, which is linked to the benefits received by employees. The authors also identified the mediating influence of the trust and calculative commitment onto the affective commitment.", "paper_title": "The model of HRM-trust-commitment relationships", "paper_id": "WOS:000369166000005"}