{"auto_keywords": [{"score": 0.04450790588541087, "phrase": "female_online_clothing_shoppers"}, {"score": 0.04334291243748401, "phrase": "online_clothing_stores"}, {"score": 0.006863362505136779, "phrase": "female_customers'_e-loyalty"}, {"score": 0.00487743363701542, "phrase": "future_research"}, {"score": 0.00481495049065317, "phrase": "mediating_roles"}, {"score": 0.0047539837463160695, "phrase": "e-loyalty_development"}, {"score": 0.004673888254065083, "phrase": "female_customers"}, {"score": 0.004644199951293372, "phrase": "online_clothing_stores_increases"}, {"score": 0.004595135986420401, "phrase": "customers'_e-loyalty"}, {"score": 0.004508117484094101, "phrase": "online_store"}, {"score": 0.0040108707569806714, "phrase": "online_clothing_store_shopping_experience"}, {"score": 0.003993869036713091, "phrase": "taiwan"}, {"score": 0.003960044730516863, "phrase": "structural_equation_modeling"}, {"score": 0.003893273258745852, "phrase": "structural_models"}, {"score": 0.0038113838687677554, "phrase": "online_privacy"}, {"score": 0.003731210452196135, "phrase": "web_design"}, {"score": 0.0036839151921893216, "phrase": "perceived_delivery_time"}, {"score": 0.003668283211953453, "phrase": "web_site_design"}, {"score": 0.00343426948480668, "phrase": "literature_review"}, {"score": 0.0033835216367399563, "phrase": "theoretical_knowledge"}, {"score": 0.0032564328073599645, "phrase": "important_theoretical_gap"}, {"score": 0.003235718840249497, "phrase": "prior_studies"}, {"score": 0.0029030160659385957, "phrase": "online_store_managers"}, {"score": 0.002860095965253653, "phrase": "online_clothing_store_managers"}, {"score": 0.002835854890415621, "phrase": "quick_item_delivery_methods"}, {"score": 0.0028238112904473314, "phrase": "friendly_online_shopping_web_sites"}, {"score": 0.002799876887046183, "phrase": "necessary_information"}, {"score": 0.0027292806975352498, "phrase": "customers'_e-satisfaction"}, {"score": 0.0026889222879900665, "phrase": "reliable_and_trustworthy_web_sites"}, {"score": 0.002643526699934596, "phrase": "web_sites'_privacy_and_security_features"}, {"score": 0.002626701116493119, "phrase": "customers'_e-trust"}, {"score": 0.0025988955033551574, "phrase": "e-trust_increase"}, {"score": 0.002474723709173135, "phrase": "important_but_previously_neglected_group"}, {"score": 0.0023969486682734182, "phrase": "authors'_investigation"}, {"score": 0.002356470662481178, "phrase": "important_mediators"}, {"score": 0.0021049977753042253, "phrase": "female_online_shoppers"}], "paper_keywords": ["e-Loyalty", " e-Satisfaction", " e-Trust", " Female online clothing shoppers", " Perceived online privacy", " Perceived online security"], "paper_abstract": "Purpose - As the number of female customers shopping in online clothing stores increases, understanding how female customers' e-loyalty is formed and fostered in this type of online store becomes very pivotal. Yet, despite its importance, little research has been done on this issue. The purpose of this paper is to focus on female online clothing shoppers and aim to examine the mediators of e-loyalty in the context of online clothing stores: e-satisfaction and e-trust. Design/methodology/approach - A total of 482 subjects who are female and have online clothing store shopping experience in Taiwan were obtained and structural equation modeling was performed to analyze the measurement and structural models. Findings - The results show that both perceived online privacy and security are positively associated with e-trust, whereas web design is not. Furthermore, perceived delivery time and web site design are positively associated with e-satisfaction. Both e-trust and e-satisfaction in turn positively influence e-loyalty for female online clothing shoppers. Research limitations/implications - On the basis of the literature review, there is a lack of theoretical knowledge of the relationships between e-loyalty, e-satisfaction, and e-trust among female online clothing shoppers. The research fulfills this important theoretical gap by extending prior studies on e-loyalty to further examine the factors that form e-satisfaction and e-trust, and how they, as mediators, influence the development of female customers' e-loyalty in the context of online clothing stores. The result provides a model that contributes to understanding the formation of female customers' e-loyalty. Practical implications - The results of this study are helpful to online store managers in increasing their customers' loyalty. Specifically, online clothing store managers have to create quick item delivery methods and friendly online shopping web sites that provide all necessary information and are easy to navigate and use so as to increase customers' e-satisfaction. They also need to establish reliable and trustworthy web sites by letting their customers easily perceive the web sites' privacy and security features to enhance customers' e-trust. As e-satisfaction and e-trust increase, e-loyalty is fostered. Originality/value - The contributions of this study are threefold. First, this study focusses on an important but previously neglected group in the context of online clothing stores: female online clothing shoppers. Second, the authors' investigation extends the literature on e-loyalty by identifying important mediators (e-satisfaction and e-trust) and probing into their relationships to e-loyalty in the context of online clothing stores. Third, the findings contribute to academia and to future research by increasing understandings of the importance of the concerns and experiences of female online clothing shoppers and by suggesting that future research pay more attention to female online shoppers.", "paper_title": "Female online shoppers Examining the mediating roles of e-satisfaction and e-trust on e-loyalty development", "paper_id": "WOS:000359055600003"}