{"auto_keywords": [{"score": 0.049153885406092224, "phrase": "image_database"}, {"score": 0.04024998824811082, "phrase": "keyword_relationships"}, {"score": 0.03290316014729149, "phrase": "visual_features"}, {"score": 0.027203644838893534, "phrase": "proposed_method"}, {"score": 0.00481495049065317, "phrase": "extracting_visual_feature-based_keyword_relationships"}, {"score": 0.004511663118269957, "phrase": "novel_framework"}, {"score": 0.004424441580112395, "phrase": "visual_feature-based_keyword_relationships"}, {"score": 0.004012885020428863, "phrase": "relevant_keywords"}, {"score": 0.0039097293657870584, "phrase": "common_visual_features"}, {"score": 0.0037599278182081056, "phrase": "target_image_database"}, {"score": 0.0029545864975783023, "phrase": "second_step"}, {"score": 0.002804478352027886, "phrase": "obtained_results"}, {"score": 0.0024456516553345966, "phrase": "training_images"}, {"score": 0.002189009136006588, "phrase": "biggest_difference"}], "paper_keywords": ["keyword relationship extraction", " semantic analysis", " inter-keyword relation", " image annotation"], "paper_abstract": "In this paper, a novel framework for extracting visual feature-based keyword relationships from an image database is proposed. From the characteristic that a set of relevant keywords tends to have common visual features, the keyword relationships in a target image database are extracted by using the following two steps. First, the relationship between each keyword and its corresponding visual features is modeled by using a classifier. This step enables detection of visual features related to each keyword. In the second step, the keyword relationships are extracted from the obtained results. Specifically, in order to measure the relevance between two keywords, the proposed method removes visual features related to one keyword from training images and monitors the performance of the classifier obtained for the other keyword. This measurement is the biggest difference from other conventional methods that focus on only keyword co-occurrences or visual similarities. Results of experiments conducted using an image database showed the effectiveness of the proposed method.", "paper_title": "A Novel Framework for Extracting Visual Feature-Based Keyword Relationships from an Image Database", "paper_id": "WOS:000304572900010"}