{"auto_keywords": [{"score": 0.03577773358930476, "phrase": "netdis"}, {"score": 0.005364396711147241, "phrase": "gcd"}, {"score": 0.00481495049065317, "phrase": "alignment-free_network_comparison_methods"}, {"score": 0.004694092086199672, "phrase": "computationally_intractable_problem"}, {"score": 0.004664352260912174, "phrase": "important_applications"}, {"score": 0.004634799977448855, "phrase": "systems_biology"}, {"score": 0.004561732093492262, "phrase": "key_challenge"}, {"score": 0.004461359547152617, "phrase": "wiring_patterns"}, {"score": 0.004391013899148212, "phrase": "alignment-free_fashion"}, {"score": 0.00433553336181385, "phrase": "alignment-based_methods"}, {"score": 0.004240116703465252, "phrase": "actual_node_mapping"}, {"score": 0.004133627071344356, "phrase": "different_purpose"}, {"score": 0.004068427912211707, "phrase": "different_global_network_properties"}, {"score": 0.003903663808332582, "phrase": "small_local_subgraphs"}, {"score": 0.003805591825381666, "phrase": "alignment-free_network_comparison_task"}, {"score": 0.0037217945534790903, "phrase": "topological_detail"}, {"score": 0.003639835714755229, "phrase": "different_graphlet-based_methods"}, {"score": 0.0036167509502276294, "phrase": "graphlet_correlation_distance"}, {"score": 0.0034154440860550564, "phrase": "new_graphlet-based_method"}, {"score": 0.002988101395789399, "phrase": "available_alignment-free_network_comparison_methods"}, {"score": 0.0028127163745564777, "phrase": "systematic_precision-recall_framework"}, {"score": 0.0023234950796782376, "phrase": "network_null_model"}, {"score": 0.0021049977753042253, "phrase": "network_sizes"}], "paper_keywords": [""], "paper_abstract": "Motivation: Network comparison is a computationally intractable problem with important applications in systems biology and other domains. A key challenge is to properly quantify similarity between wiring patterns of two networks in an alignment-free fashion. Also, alignment-based methods exist that aim to identify an actual node mapping between networks and as such serve a different purpose. Various alignment-free methods that use different global network properties (e.g. degree distribution) have been proposed. Methods based on small local subgraphs called graphlets perform the best in the alignment-free network comparison task, due to high level of topological detail that graphlets can capture. Among different graphlet-based methods, Graphlet Correlation Distance (GCD) was shown to be the most accurate for comparing networks. Recently, a new graphlet-based method called NetDis was proposed, which was claimed to be superior. We argue against this, as the performance of NetDis was not properly evaluated to position it correctly among the other alignment-free methods. Results: We evaluate the performance of available alignment-free network comparison methods, including GCD and NetDis. We do this by measuring accuracy of each method (in a systematic precision-recall framework) in terms of how well the method can group (cluster) topologically similar networks. By testing this on both synthetic and real-world networks from different domains, we show that GCD remains the most accurate, noise-tolerant and computationally efficient alignment-free method. That is, we show that NetDis does not outperform the other methods, as originally claimed, while it is also computationally more expensive. Furthermore, since NetDis is dependent on the choice of a network null model (unlike the other graphlet-based methods), we show that its performance is highly sensitive to the choice of this parameter. Finally, we find that its performance is not independent on network sizes and densities, as originally claimed.", "paper_title": "Proper evaluation of alignment-free network comparison methods", "paper_id": "WOS:000359666600014"}