{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "single_image"}, {"score": 0.004620093797504386, "phrase": "main_challenges"}, {"score": 0.0045443671106012405, "phrase": "current_face_recognition_techniques"}, {"score": 0.004218602458288531, "phrase": "lower_cost"}, {"score": 0.004031082737449308, "phrase": "face_recognition_techniques"}, {"score": 0.0037419747525425586, "phrase": "serious_performance_drop"}, {"score": 0.0033053159828082095, "phrase": "stored_database"}, {"score": 0.0030554300179552415, "phrase": "different_and_unpredictable_poses"}, {"score": 0.0028360962841331634, "phrase": "extremely_limited_representative"}, {"score": 0.0028127163745564777, "phrase": "training_sample"}, {"score": 0.002789528662623221, "phrase": "numerous_techniques"}, {"score": 0.0025257081555100556, "phrase": "prominent_algorithms"}, {"score": 0.0024535580495414783, "phrase": "relevant_issues"}, {"score": 0.0024232694434408093, "phrase": "data_collection"}, {"score": 0.002363806685815014, "phrase": "small_sample_size"}, {"score": 0.0023346234464901978, "phrase": "system_evaluation"}, {"score": 0.0022679195103377124, "phrase": "future_research"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["face recognition", " single training image per person"], "paper_abstract": "One of the main challenges faced by the current face recognition techniques lies in the difficulties of collecting samples. Fewer samples per person mean less laborious effort for collecting them, lower cost for storing and processing them. Unfortunately, many reported face recognition techniques rely heavily on the size and representative of training set, and most of them will suffer serious performance drop or even fail to work if only one training sample per person is available to the systems. This situation is called \"one sample per person\" problem: given a stored database of faces, the goal is to identify a person from the database later in time in any different and unpredictable poses, lighting, etc. from just one image. Such a task is very challenging for most current algorithms due to the extremely limited representative of training sample. Numerous techniques have been developed to attack this problem, and the purpose of this paper is to categorize and evaluate these algorithms. The prominent algorithms are described and critically analyzed. Relevant issues such as data collection, the influence of the small sample size, and system evaluation are discussed, and several promising directions for future research are also proposed in this paper. (c) 2006 Pattern Recognition Society. Published by Elsevier Ltd. All rights reserved.", "paper_title": "Face recognition from a single image per person: A survey", "paper_id": "WOS:000239050200015"}