{"auto_keywords": [{"score": 0.050075028950068996, "phrase": "medical_informatics_education"}, {"score": 0.04989769344599654, "phrase": "china"}, {"score": 0.04378237080964864, "phrase": "medical_informatics"}, {"score": 0.010684876889749976, "phrase": "undergraduate_education"}, {"score": 0.006884458257531438, "phrase": "specialty's_name"}, {"score": 0.006492440269876787, "phrase": "moe"}, {"score": 0.006322743829199391, "phrase": "postgraduate_education"}, {"score": 0.005817594378442732, "phrase": "medical_information"}, {"score": 0.005795611605089319, "phrase": "information_management"}, {"score": 0.004653485665080485, "phrase": "current_status"}, {"score": 0.004618342952383313, "phrase": "different_academic_levels"}, {"score": 0.004497410940849537, "phrase": "reasonable_strategies"}, {"score": 0.004264923517966271, "phrase": "systematic_searches"}, {"score": 0.003953409087444568, "phrase": "baidu.com_search_engine"}, {"score": 0.0038938807148174975, "phrase": "china's_graduate_admissions_information_network"}, {"score": 0.003879138659123195, "phrase": "cgain"}, {"score": 0.0035888855555089613, "phrase": "information_system"}, {"score": 0.0033774698151674888, "phrase": "medical_college"}, {"score": 0.0033646762636846315, "phrase": "medical_university"}, {"score": 0.00330770035909988, "phrase": "comprehensive_university"}, {"score": 0.0032393674680672975, "phrase": "program_approval"}, {"score": 0.003025419627830764, "phrase": "master's-level_education"}, {"score": 0.002996840657035727, "phrase": "phd-level_education"}, {"score": 0.0028797190175900234, "phrase": "medical_library"}, {"score": 0.002868805474023381, "phrase": "information_science_education"}, {"score": 0.002798865807872575, "phrase": "frequent_changes"}, {"score": 0.0027671619871474764, "phrase": "unclear_identity"}, {"score": 0.002730626557278474, "phrase": "educational_specialty"}, {"score": 0.0026894604914510273, "phrase": "noticeable_imbalance"}, {"score": 0.0026640466056415298, "phrase": "degree_programs"}, {"score": 0.0026438880533289893, "phrase": "different_disciplines"}, {"score": 0.0025794175473581814, "phrase": "uneven_distribution"}, {"score": 0.002564763827975352, "phrase": "specialty_settings"}, {"score": 0.002455142972880156, "phrase": "curriculum_design"}, {"score": 0.0023952639120005193, "phrase": "foreign_universities"}, {"score": 0.0023015986421083636, "phrase": "\"_discipline"}, {"score": 0.002215793441202354, "phrase": "\"medical_informatics"}, {"score": 0.002199019293326623, "phrase": "\"medicine\"_category"}, {"score": 0.0021740953491366207, "phrase": "curriculum_integration"}, {"score": 0.002165850165758528, "phrase": "international_medical_informatics_education"}, {"score": 0.0021291312714904957, "phrase": "medical_informatics_education_system"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ireland_ltd."}], "paper_keywords": ["Medical informatics", " Education", " China", " Undergraduate education", " Graduate education", " Doctoral education", " Main courses", " Specialty"], "paper_abstract": "Objective: To outline the history of medical informatics education in the People's Republic of China, systematically analyze the current status of medical informatics education at different academic levels (bachelor's, master's, and doctoral), and suggest reasonable strategies for the further development of the field in China. Method: The development of medical informatics education was divided into three stages, defined by changes in the specialty's name. Systematic searches of websites for material related to the specialty of medical informatics were then conducted. For undergraduate education, the websites surveyed included the website of the Ministry of Education of the People's Republic of China (MOE) and those of universities or colleges identified using the baidu.com search engine. For postgraduate education, the websites included China's Graduate Admissions Information Network (CGAIN) and the websites of the universities or their schools or faculties. Specialties were selected on the basis of three criteria: (1) for undergraduate education, the name of specialty or program was medical informatics or medical information or information management and information system; for postgraduate education, medical informatics or medical information; (2) the specialty was approved and listed by the MOE; (3) the specialty was set up by a medical college or medical university, or a school of medicine of a comprehensive university. The information abstracted from the websites included the year of program approval and listing, the university/college, discipline catalog, discipline, specialty, specialty code, objectives, and main courses. Results and conclusions: A total of 55 program offerings for undergraduate education, 27 for master's-level education, and 5 for PhD-level education in medical informatics were identified and assessed in China. The results indicate that medical informatics education, a specialty rooted in medical library and information science education in China, has grown significantly in that country over the past 10 years. Frequent changes in the specialty's name and an unclear identity have hampered the visibility of this educational specialty and impeded its development. There is a noticeable imbalance in the distribution of degree programs in medical informatics in different disciplines, with the majority falling under information management. There is also an uneven distribution of the specialty settings of medical informatics at the various academic levels (bachelor's, master's, and doctoral). In addition, the objectives and curriculum design of medical informatics education differ from one university to another and also from those of foreign universities or colleges. It is recommended that China (1) treat medical informatics as a priority \"must-have\" discipline to build in China, (2) establish its own independent, balanced degree programs, (3) set up a specialty of \"medical informatics\" under the \"medicine\" category, (4) explore curriculum integration with international medical informatics education, and (5) establish and improve medical informatics education system. (C) 2012 Elsevier Ireland Ltd. All rights reserved.", "paper_title": "An overview of medical informatics education in China", "paper_id": "WOS:000318998000030"}