{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "interdependent_infrastructures"}, {"score": 0.011113708873152973, "phrase": "structural_vulnerability"}, {"score": 0.010567709711299857, "phrase": "functional_vulnerability"}, {"score": 0.004600228893803583, "phrase": "multiple_levels"}, {"score": 0.004220314322073171, "phrase": "severe_economic_disruption"}, {"score": 0.003991305899593133, "phrase": "methodological_approach"}, {"score": 0.00351582806482809, "phrase": "infrastructure_topologies"}, {"score": 0.0033588449972778004, "phrase": "operating_regimes"}, {"score": 0.0033249197885613937, "phrase": "different_infrastructures"}, {"score": 0.00309681702203087, "phrase": "interdependent_effects"}, {"score": 0.0029735479904284675, "phrase": "interdependence_strength"}, {"score": 0.0026457367614424756, "phrase": "long_run"}, {"score": 0.0024641134634779535, "phrase": "short_term"}, {"score": 0.002181227522730908, "phrase": "crown_copyright"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Interdependent infrastructures", " Structural vulnerability", " Functional vulnerability", " Interdependence strength"], "paper_abstract": "The infrastructures are interconnected and interdependent on multiple levels, the failure of one infrastructure can result in the disruption of other infrastructures, which can cause severe economic disruption and loss of life or failure of services. A methodological approach to analyze vulnerability of interdependent infrastructures has been introduced in this paper, two types of vulnerability are studied: structural vulnerability and functional vulnerability. Infrastructure topologies are only used for analysis on structural vulnerability while operating regimes of different infrastructures are further considered to analyze functional vulnerability. For these two types of vulnerability, interdependent effects are mainly studied and the effects of interdependence strength between infrastructures have also been analyzed. The analysis on structural vulnerability will be helpful to design or improve the infrastructures in the long run while the discussion on functional vulnerability will be useful to protect them in the short term. The methodology introduced in this paper will be advantageous to comprehensively analyze the vulnerability of interdependent infrastructures and protect them more efficiently. Crown Copyright (C) 2009 Published by Elsevier B.V. All rights reserved.", "paper_title": "A methodological approach to analyze vulnerability of interdependent infrastructures", "paper_id": "WOS:000266254900004"}