{"auto_keywords": [{"score": 0.031138623793524195, "phrase": "optimal_energy_trade-off_schedule"}, {"score": 0.00481495049065317, "phrase": "scheduling_tasks"}, {"score": 0.004639712384096822, "phrase": "speed_scalable_processor"}, {"score": 0.003957833102043277, "phrase": "higher_speeds"}, {"score": 0.003503497128638102, "phrase": "common_scheduling_quality"}, {"score": 0.003466536738232506, "phrase": "service_measure"}, {"score": 0.003150900886669123, "phrase": "user's_desired_additive_trade-off"}, {"score": 0.002818692837561076, "phrase": "simple_structure"}, {"score": 0.0022916428586256723, "phrase": "natural_homotopic_optimization_algorithm"}, {"score": 0.002219790619936024, "phrase": "multiplicative_trade-off_schedules"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Scheduling", " Algorithms", " Energy", " Power", " Speed scaling"], "paper_abstract": "We consider scheduling tasks that arrive over time on a speed scalable processor. At each time a schedule specifies a job to be run and the speed at which the processor is run. Processors are generally less energy efficient at higher speeds. We seek to understand the structure of schedules that optimally trade-off the energy used by the processor with a common scheduling quality of service measure, fractional weighted delay. We assume that there is some user defined parameter. specifying the user's desired additive trade-off between energy efficiency and quality of service. We prove that the optimal energy trade-off schedule is essentially unique, and has a simple structure. Thus it is easy to check the optimality of a schedule. We further prove that the optimal energy trade-off schedule changes continuously as a function of the parameter.. Thus it is possible to compute the optimal energy trade-off schedule using a natural homotopic optimization algorithm. We further show that multiplicative trade-off schedules have fewer desirable properties. (C) 2013 Elsevier Inc. All rights reserved.", "paper_title": "Optimal energy trade-off schedules", "paper_id": "WOS:000209576200009"}