{"auto_keywords": [{"score": 0.04506785476449152, "phrase": "interacting_proteins"}, {"score": 0.015158942505109286, "phrase": "protein-protein_interactions"}, {"score": 0.00481495049065317, "phrase": "integrated_protein-protein_interaction_network"}, {"score": 0.004728016940870871, "phrase": "markov"}, {"score": 0.004577869668211548, "phrase": "major_role"}, {"score": 0.004352411290383643, "phrase": "full_repertoire"}, {"score": 0.004195418010131832, "phrase": "great_importance"}, {"score": 0.0036553070575015344, "phrase": "predictive_algorithms"}, {"score": 0.0035395987202335223, "phrase": "possible_dependencies"}, {"score": 0.0035072146967082083, "phrase": "interacting_pairs"}, {"score": 0.0032585499655442404, "phrase": "computational_approach"}, {"score": 0.00290473242917264, "phrase": "assay_measurements"}, {"score": 0.002825681384008326, "phrase": "relational_markov_networks"}, {"score": 0.0027614468443073028, "phrase": "unified_probabilistic_model"}, {"score": 0.0024956789310376635, "phrase": "unobserved_interactions"}, {"score": 0.002297327670408112, "phrase": "account_protein_attributes"}, {"score": 0.002276283303864666, "phrase": "measurement_noise"}, {"score": 0.002194011800331242, "phrase": "protein_interaction_network"}, {"score": 0.0021049977753042253, "phrase": "new_insights"}], "paper_keywords": ["Markov networks", " probabilistic graphical models", " protein-protein interaction networks"], "paper_abstract": "Protein-protein interactions play a major role in most cellular processes. Thus, the challenge of identifying the full repertoire of interacting proteins in the cell is of great importance and has been addressed both experimentally and computationally. Today, large scale experimental studies of protein interactions, while partial and noisy, allow us to characterize properties of interacting proteins and develop predictive algorithms. Most existing algorithms, however, ignore possible dependencies between interacting pairs and predict them independently of one another. In this study, we present a computational approach that overcomes this drawback by predicting protein-protein interactions simultaneously. In addition, our approach allows us to integrate various protein attributes and explicitly account for uncertainty of assay measurements. Using the language of relational Markov networks, we build a unified probabilistic model that includes all of these elements. We show how we can learn our model properties and then use it to predict all unobserved interactions simultaneously. Our results show that by modeling dependencies between interactions, as well as by taking into account protein attributes and measurement noise, we achieve a more accurate description of the protein interaction network. Furthermore, our approach allows us to gain new insights into the properties of interacting proteins.", "paper_title": "Towards an integrated protein-protein interaction network: A relational Markov network approach", "paper_id": "WOS:000236954700003"}