{"auto_keywords": [{"score": 0.04892011149005984, "phrase": "hong_kong_toy_industry"}, {"score": 0.02322730111336099, "phrase": "strategic_sourcing"}, {"score": 0.009361961537181626, "phrase": "sourcing_performance"}, {"score": 0.006535190152205816, "phrase": "relative_importance"}, {"score": 0.004457995891964028, "phrase": "key_success_factors"}, {"score": 0.003943636379643578, "phrase": "highest_priority"}, {"score": 0.003715579364728729, "phrase": "industry_experts"}, {"score": 0.0036767202303156854, "phrase": "analytical_hierarchy_process"}, {"score": 0.003651043518740987, "phrase": "ahp"}, {"score": 0.0034398445347109396, "phrase": "full_review"}, {"score": 0.0033800778203837757, "phrase": "strategic_sourcing_literature"}, {"score": 0.0033447157263095223, "phrase": "questionnaire_survey"}, {"score": 0.003096417317829492, "phrase": "toy_industry"}, {"score": 0.003042599375218838, "phrase": "pairwise_comparison_judgements"}, {"score": 0.003010757286626405, "phrase": "proposed_ahp_model"}, {"score": 0.002787181295054319, "phrase": "literature_review"}, {"score": 0.00275800486983114, "phrase": "survey_results"}, {"score": 0.0024999636244840647, "phrase": "hong_kong_toy_companies"}, {"score": 0.002439308179084911, "phrase": "identified_ksfs"}, {"score": 0.0024137645015872952, "phrase": "ahp_approach"}, {"score": 0.0023469450817019, "phrase": "toy_manufacturers"}], "paper_keywords": ["sourcing", " leadership", " supplier relations", " continuous improvement", " toys", " Hong Kong"], "paper_abstract": "Purpose - This research aims to identify and examine the importance of the key success factors (KSFs) of strategic sourcing, and investigate the relationship between KSFs and sourcing performance in the Hong Kong toy industry. The KSFs are ranked, and the results show those factors that should be given the highest priority in implementing strategic sourcing. Design/methodology/approach - A literature review, a questionnaire survey, interviews with industry experts and the analytical hierarchy process (AHP) approach were employed in the study. First, the KSFs were identified after a full review and evaluation of the strategic sourcing literature. A questionnaire survey of 205 companies was then conducted in the Hong Kong toy industry to verify the importance of these KSFs. Finally, 20 sourcing experts from the toy industry were interviewed and assigned pairwise comparison judgements on a proposed AHP model, which prioritised the relative importance of these KSFs for the Hong Kong toy industry. Findings - About 14 KSFs are identified through the literature review. The survey results indicate that these 14 KSFs are important and they are positively related to sourcing performance. Moreover, the results show that there is only marginal implementation of these 14 KSFs amongst Hong Kong toy companies. With the prioritisation of the identified KSFs by the AHP approach, it is strongly suggested that the toy manufacturers assess and improve their strategic sourcing performance. Originality/value - The paper identifies the relative importance of the 14 KSFs, which will allow manufacturers to use their limited resources to focus on the most important factors in improving their strategic sourcing practice and performance.", "paper_title": "Key success factors of strategic sourcing: An empirical study of the Hong Kong toy industry", "paper_id": "WOS:000251461600008"}