{"auto_keywords": [{"score": 0.04495971759688538, "phrase": "controllability_problems"}, {"score": 0.006269163913949289, "phrase": "msc-based_testing"}, {"score": 0.004747620102130588, "phrase": "testing_systems"}, {"score": 0.0045726187330434025, "phrase": "separate_tester"}, {"score": 0.0041678762110005955, "phrase": "controllability_problem"}, {"score": 0.004143196873246147, "phrase": "finite_state_machines"}, {"score": 0.004104456271230213, "phrase": "message_sequence_charts"}, {"score": 0.0038431888954930083, "phrase": "distributed_systems"}, {"score": 0.00348202932445197, "phrase": "msc_test_cases"}, {"score": 0.002953711377604328, "phrase": "msc_pathology"}, {"score": 0.002688532127821979, "phrase": "non-local_choices"}, {"score": 0.0023678143146455017, "phrase": "better_observational_power"}, {"score": 0.0021249064184347658, "phrase": "coordination_service"}, {"score": 0.0021049977753042253, "phrase": "status_messages"}], "paper_keywords": ["testing", " controllability problems", " message sequence charts", " race", " non-local choice"], "paper_abstract": "In testing systems with distributed interfaces/ports, we may place a separate tester at each port. It is known that this approach can introduce controllability problems which have received much attention in testing from finite state machines. Message sequence charts (MSCs) form an alternative, commonly used, language for modelling distributed systems. However, controllability problems in testing from MSCs have not been thoroughly investigated. In this paper, controllability problems in MSC test cases are analysed with three notions of observability: local, tester and global. We identify two types of controllability problem in MSC-based testing. It transpires that each type of controllability problem is related to a type of MSC pathology. Controllability problems of timing are caused by races but not every race causes controllability problems; controllability problems of choice are caused by non-local choices and not every non-local choice causes controllability problems. We show that some controllability problems of timing are avoidable and some controllability problems of choice can be overcome when testers have better observational power. Algorithms are provided to tackle both types of controllability problems. Finally, we show how one can overcome controllability problems using a coordination service with status messages based on algorithms developed in this paper.", "paper_title": "Controllability Problems in MSC-Based Testing", "paper_id": "WOS:000310636000001"}