{"auto_keywords": [{"score": 0.04716108008867496, "phrase": "service_differentiation"}, {"score": 0.009362488586760115, "phrase": "competition_game"}, {"score": 0.009270546835075343, "phrase": "competing_nodes"}, {"score": 0.009000054634664955, "phrase": "nash_equilibrium"}, {"score": 0.004122077038067119, "phrase": "well_known_free-riding_problem"}, {"score": 0.004027751272984522, "phrase": "information_requests"}, {"score": 0.003961694867182568, "phrase": "small_number"}, {"score": 0.003413705707789296, "phrase": "network_community"}, {"score": 0.0033245147666408157, "phrase": "nodes'_prior_contributions"}, {"score": 0.0031426214970263137, "phrase": "resource_distribution_mechanism"}, {"score": 0.003091036449708673, "phrase": "formation_sharing_nodes"}, {"score": 0.0029903851294825023, "phrase": "linear_time_complexity"}, {"score": 0.002951045605925464, "phrase": "pareto-optimal_resource_allocation"}, {"score": 0.002459660938061167, "phrase": "generalized_incentive_mechanism"}, {"score": 0.002427286272201272, "phrase": "heterogeneous_utility_functions"}, {"score": 0.002286781334850213, "phrase": "incentive_protocol"}, {"score": 0.002241773449372999, "phrase": "productive_resource_sharing"}, {"score": 0.002226968099778524, "phrase": "rational_network_nodes"}, {"score": 0.002161542155696987, "phrase": "node_arrival"}, {"score": 0.002147265537489893, "phrase": "departure_events"}, {"score": 0.002118993962770973, "phrase": "different_forms"}, {"score": 0.0021049977753042253, "phrase": "network_congestion"}], "paper_keywords": ["contribution-based service differentiation", " game theory", " incentive protocol", " peer-to-peer network"], "paper_abstract": "Conventional peer-to-peer (P2P) networks do not provide service differentiation and incentive for users. Therefore, users can easily obtain information without themselves contributing any information or service to a P2P community. This leads to the well known free-riding problem. Consequently, most of the information requests are directed towards a small number of P2P nodes which are willing to share information or provide service, causing the \"tragedy of the commons.\" The aim of this paper is to provide service differentiation in a P21 network based on the amount of services each node has provided to the network community. Since the differentiation is based on nodes' prior contributions, the nodes are encouraged to share information/services with each other. We first introduce a resource distribution mechanism for all the in formation sharing nodes. The mechanism is distributed in nature, has linear time complexity, and guarantees Pareto-optimal resource allocation. Second, we model the whole resource request/distribution process as a competition game between the competing nodes. We show that this game has a Nash equilibrium. To realize the game, we propose a protocol in which the competing nodes can interact with the information providing node to reach Nash equilibrium efficiently and dynamically. We also present a generalized incentive mechanism for nodes having heterogeneous utility functions. Convergence analysis of the competition game is carried out. Examples are used to illustrate that the incentive protocol provides service differentiation and can induce productive resource sharing by rational network nodes. Lastly, the, incentive protocol is adaptive to node arrival and departure events, and to different forms of network congestion..", "paper_title": "Incentive and service differentiation in P2P networks: A game theoretic approach", "paper_id": "WOS:000241540900005"}