{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "manual_curation"}, {"score": 0.004622783000449884, "phrase": "genomic_databases"}, {"score": 0.004412494693940597, "phrase": "intense_activity"}, {"score": 0.004361428012479218, "phrase": "great_importance"}, {"score": 0.004236321075918639, "phrase": "computational_biology"}, {"score": 0.0038820411362656803, "phrase": "knowledge_bases"}, {"score": 0.0032978134802348433, "phrase": "software_engineering"}, {"score": 0.003039445153076014, "phrase": "genomic_knowledge_bases"}, {"score": 0.00280126189041041, "phrase": "well-understood_patterns"}, {"score": 0.0025221759076833124, "phrase": "current_manual_curation_processes"}, {"score": 0.0023654615987859402, "phrase": "even_just_the_most_important_model_organisms"}, {"score": 0.0021049977753042253, "phrase": "currently_available_proteomes"}], "paper_keywords": [""], "paper_abstract": "Motivation: Knowledge base construction has been an area of intense activity and great importance in the growth of computational biology. However, there is little or no history of work on the subject of evaluation of knowledge bases, either with respect to their contents or with respect to the processes by which they are constructed. This article proposes the application of a metric from software engineering known as the found/fixed graph to the problem of evaluating the processes by which genomic knowledge bases are built, as well as the completeness of their contents. Results: Well-understood patterns of change in the found/fixed graph are found to occur in two large publicly available knowledge bases. These patterns suggest that the current manual curation processes will take far too long to complete the annotations of even just the most important model organisms, and that at their current rate of production, they will never be sufficient for completing the annotation of all currently available proteomes.", "paper_title": "Manual curation is not sufficient for annotation of genomic databases", "paper_id": "WOS:000248620400029"}