{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "deadlock-free_distributed_routing_algorithm"}, {"score": 0.004586531354697466, "phrase": "distributed_routing_algorithm"}, {"score": 0.003999217176949845, "phrase": "practical_interest"}, {"score": 0.003911771812701971, "phrase": "heterogeneous_dies"}, {"score": 0.0035965032173588753, "phrase": "different_functions"}, {"score": 0.0034868462688262864, "phrase": "interconnect_backbone"}, {"score": 0.0033805214040814233, "phrase": "better_performances"}, {"score": 0.0029602552900111407, "phrase": "available_tsvs"}, {"score": 0.0027947199430705077, "phrase": "distributed_deterministic_routing"}, {"score": 0.002685558057339722, "phrase": "theoretical_and_practical_interests"}, {"score": 0.0025241429061867633, "phrase": "planar_topologies"}, {"score": 0.0023935128386292966, "phrase": "proposed_routing_algorithm"}, {"score": 0.0021049977753042253, "phrase": "vertical_connections"}], "paper_keywords": ["3D Integration", " network-on-chip (NoC)", " routing algorithm", " deadlock freedom"], "paper_abstract": "In this paper, we propose a distributed routing algorithm for vertically partially connected regular 2D topologies of different shapes and sizes (e. g., 2D mesh, torus, ring). The topologies that are the target of this algorithm are of practical interest in the 3D integration of heterogeneous dies using Through-Silicon-Vias (TSVs). Indeed, TSV-based 3D integration allows to envision the stacking of dies with different functions and technologies, using as an interconnect backbone a 3D-NoC. Intrinsically, 3D topologies have better performances, but yield and active area (and thus the cost) are function of the number of TSVs; therefore, the designs tend to use only a subset of available TSVs between two dies. The definition of blockage free and low implementation cost distributed deterministic routing on this kind of topology is thus of theoretical and practical interests. We formally prove that independently of the shape and dimensions of the planar topologies and of the number and placement of the TSVs, the proposed routing algorithm using two virtual channels in the plane is deadlock and livelock free. We also experimentally show that the performance of this algorithm is still acceptable when the number of vertical connections decreases.", "paper_title": "Elevator-First: A Deadlock-Free Distributed Routing Algorithm for Vertically Partially Connected 3D-NoCs", "paper_id": "WOS:000314391600016"}