{"auto_keywords": [{"score": 0.04887366145178028, "phrase": "peer_databases"}, {"score": 0.010612387000973441, "phrase": "peer_data_management_systems"}, {"score": 0.004437613070853689, "phrase": "hyperion_project"}, {"score": 0.004392565073466714, "phrase": "peer_database_coordination"}, {"score": 0.004089725258435817, "phrase": "non-technical_end_users"}, {"score": 0.003926105480202798, "phrase": "doctor's_office"}, {"score": 0.003866443402315402, "phrase": "assistant_pharmacist"}, {"score": 0.0036928221419965253, "phrase": "technically_demanding_language"}, {"score": 0.003636692152882991, "phrase": "eca_rules"}, {"score": 0.003334309053314909, "phrase": "\"standard\"_rules"}, {"score": 0.0031042018721479385, "phrase": "assumed_standard_schemas"}, {"score": 0.0025958582759972315, "phrase": "standard_rules"}, {"score": 0.0023197517832705297, "phrase": "global-as-view_mappings"}, {"score": 0.0022154296909169826, "phrase": "specific_schemas"}, {"score": 0.0021928902836049384, "phrase": "standard_ones"}, {"score": 0.0021049977753042253, "phrase": "standard_rule"}], "paper_keywords": [""], "paper_abstract": "Managing coordination among peer databases is at the core of research in peer data management systems. The Hyperion project addresses peer database coordination through Event-Condition-Action (ECA) rules. However, peer databases are intended for non-technical end users, such as a receptionist at a doctor's office or an assistant pharmacist. Such users are not expected to know a technically demanding language for expressing ECA rules that are appropriate for coordinating their respective databases. Accordingly, we propose to offer a library of \"standard\" rules for coordinating two or more types of peer databases. These rules are defined in terms of assumed standard schemas for the peer databases they coordinate. Once two acquainted peers select such a rule, it can be instantiated so that it can operate for their respective databases. In this paper, we propose a mechanism for rewriting given standard rules into rules expressed in terms of the schemas of the two databases that are being coordinated. The rewriting is supported by Global-As-View mappings that are supposed to pre-exist between specific schemas and standard ones. More specifically, we propose a standard rule rewriting algorithm which we have implemented and evaluated.", "paper_title": "An ECA rule rewriting mechanism for peer data management systems", "paper_id": "WOS:000237081600063"}