{"auto_keywords": [{"score": 0.047757412970608114, "phrase": "novel_image"}, {"score": 0.00481495049065317, "phrase": "kalman_filtering_perspective_for_multiatlas_segmentation"}, {"score": 0.004750178261675602, "phrase": "multiatlas_segmentation"}, {"score": 0.004359625030298944, "phrase": "final_segmentation"}, {"score": 0.00418595288276353, "phrase": "new_dynamical_system_perspective"}, {"score": 0.00391167729353583, "phrase": "current_atlas"}, {"score": 0.003738847528809348, "phrase": "direct_registration"}, {"score": 0.00357362651129581, "phrase": "previous_atlas"}, {"score": 0.003294350220187021, "phrase": "global_positioning_system"}, {"score": 0.0030505976034245234, "phrase": "previous_location"}, {"score": 0.003023129616910419, "phrase": "velocity-neither_answer"}, {"score": 0.0028634235895823594, "phrase": "dynamical_system_scheme"}, {"score": 0.002687702958515561, "phrase": "kalman_filtering_scheme"}, {"score": 0.0025572160146590623, "phrase": "kalman_multiatlas_segmentation"}, {"score": 0.0023253967212081626, "phrase": "new_dynamical_systematic_perspective"}, {"score": 0.0023044434462692483, "phrase": "standard_independent_multiatlas_registrations"}, {"score": 0.0022326521729145307, "phrase": "kalman"}], "paper_keywords": ["multiatlas segmentation", " Kalman filter", " registration", " dynamical systems"], "paper_abstract": "In multiatlas segmentation, one typically registers several atlases to the novel image, and their respective segmented label images are transformed and fused to form the final segmentation. In this work, we provide a new dynamical system perspective for multiatlas segmentation, inspired by the following fact: The transformation that aligns the current atlas to the novel image can be not only computed by direct registration but also inferred from the transformation that aligns the previous atlas to the image together with the transformation between the two atlases. This process is similar to the global positioning system on a vehicle, which gets position by inquiring from the satellite and by employing the previous location and velocity-neither answer in isolation being perfect. To solve this problem, a dynamical system scheme is crucial to combine the two pieces of information; for example, a Kalman filtering scheme is used. Accordingly, in this work, a Kalman multiatlas segmentation is proposed to stabilize the global/affine registration step. The contributions of this work are twofold. First, it provides a new dynamical systematic perspective for standard independent multiatlas registrations, and it is solved by Kalman filtering. Second, with very little extra computation, it can be combined with most existing multiatlas segmentation schemes for better registration/segmentation accuracy.", "paper_title": "A Kalman Filtering Perspective for Multiatlas Segmentation", "paper_id": "WOS:000357405500008"}