{"auto_keywords": [{"score": 0.047585284599464345, "phrase": "search_space"}, {"score": 0.038745030649949684, "phrase": "pb-ls"}, {"score": 0.015719716506582538, "phrase": "local_search"}, {"score": 0.004775531918452571, "phrase": "university_course"}, {"score": 0.004697655699119423, "phrase": "population_based_algorithms"}, {"score": 0.004527024978801684, "phrase": "local_search_algorithms"}, {"score": 0.004398589723893764, "phrase": "single_heuristic"}, {"score": 0.0038561471948364723, "phrase": "local_search_algorithm"}, {"score": 0.0035369291417564606, "phrase": "single_solution"}, {"score": 0.0034364867143322304, "phrase": "incumbent_solution"}, {"score": 0.003394314924677555, "phrase": "trial_current_solution"}, {"score": 0.003244050414264445, "phrase": "second_operator"}, {"score": 0.0028908104750148245, "phrase": "single_direction"}, {"score": 0.002492425259337031, "phrase": "test_domain"}, {"score": 0.0022484715639779153, "phrase": "scientific_literature"}, {"score": 0.002157697367447098, "phrase": "statistically_significantly_higher_quality_solutions"}, {"score": 0.0021049977753042253, "phrase": "socha_dataset"}], "paper_keywords": ["Course timetabling problem", " Metaheuristics", " Population based algorithm", " Hybrid methods", " Gravitational emulation"], "paper_abstract": "Population based algorithms are generally better at exploring a search space than local search algorithms (i.e. searches based on a single heuristic). However, the limitation of many population based algorithms is in exploiting the search space. We propose a population based Local Search (PB-LS) heuristic that is embedded within a local search algorithm (as a mechanism to exploit the search space). PB-LS employs two operators. The first is applied to a single solution to determine the force between the incumbent solution and the trial current solution (i.e. a single direction force), whilst the second operator is applied to all solutions to determine the force in all directions. The progress of the search is governed by these forces, either in a single direction or in all directions. Our proposed algorithm is able to both diversify and intensify the search more effectively, when compared to other local search and population based algorithms. We use university course timetabling (Socha benchmark datasets) as a test domain. In order to evaluate the effectiveness of PB-LS, we perform a comparison between the performances of PB-LS with other approaches drawn from the scientific literature. Results demonstrate that PB-LS is able to produce statistically significantly higher quality solutions, outperforming many other approaches on the Socha dataset.", "paper_title": "Population based Local Search for university course timetabling problems", "paper_id": "WOS:000330207700004"}