{"auto_keywords": [{"score": 0.02767338494838732, "phrase": "cscl_environment"}, {"score": 0.015719716506582538, "phrase": "computer-supported_collaborative_learning"}, {"score": 0.012941964697524207, "phrase": "simcol"}, {"score": 0.01257958505901578, "phrase": "collaborative_learning"}, {"score": 0.004717485406306594, "phrase": "multiagent_tools"}, {"score": 0.004603127607207543, "phrase": "cscl"}, {"score": 0.00447316895126645, "phrase": "high_cost"}, {"score": 0.004189698902282913, "phrase": "large_scale"}, {"score": 0.0041555469216463855, "phrase": "longitudinal_studies"}, {"score": 0.004104838067758352, "phrase": "real-world_environment"}, {"score": 0.0035278613436978933, "phrase": "comprehensive_test_bed"}, {"score": 0.0034990853199511982, "phrase": "multiagent_researchers"}, {"score": 0.0028510114763213596, "phrase": "real_world"}, {"score": 0.0027931892160452513, "phrase": "human_users"}, {"score": 0.0026700637696697414, "phrase": "individual_and_collective_learning_behaviors"}, {"score": 0.002202123699556382, "phrase": "nonagent-based_group_formation_algorithms"}, {"score": 0.0021049977753042253, "phrase": "agent-based_instructor_support"}], "paper_keywords": ["Collaborative work", " cooperative systems", " educational technology", " simulation"], "paper_abstract": "Researchers designing the multiagent tools and techniques for computer-supported collaborative learning (CSCL) environments are often faced with high cost, time, and effort required to investigate the effectiveness of their tools and techniques in large scale and longitudinal studies in a real-world environment containing human users. Here, we propose SimCoL, a multiagent environment that simulates collaborative learning among students and agents providing support to the teacher and the students. Our goal with SimCoL is to provide a comprehensive test bed for multiagent researchers to investigate 1) theoretical multiagent research issues, e. g., coalition formation, multiagent learning, and communication, where humans are involved and 2) the impact and effectiveness of the design and implementation of various multiagent-based tools and techniques (e. g., multiagent-based human coalition formation) in a real world, distributed environment containing human users. Our results show that SimCoL 1) closely captures the individual and collective learning behaviors of the students in a CSCL environment; 2) identify the impact of various key elements of the CSCL environment (e. g., student attributes and group formation algorithm) on the collaborative learning of students; 3) compare and contrast the impact of agent-based versus nonagent-based group formation algorithms; and 4) provide insights into the effectiveness of agent-based instructor support for the students in a CSCL environment.", "paper_title": "SimCoL: A Simulation Tool for Computer-Supported Collaborative Learning", "paper_id": "WOS:000291823300009"}