{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "different_types"}, {"score": 0.039027278312474004, "phrase": "verifiable_attributes"}, {"score": 0.004658426838467567, "phrase": "multi-attribute_auctions"}, {"score": 0.004614643339546038, "phrase": "multi-attribute"}, {"score": 0.0038382392088338784, "phrase": "auction_process"}, {"score": 0.003678414118674967, "phrase": "unverifiable_attributes"}, {"score": 0.00341048470257476, "phrase": "vickrey"}, {"score": 0.003030247482854539, "phrase": "auction_customization"}, {"score": 0.0027178867838199734, "phrase": "different_auction_concepts"}, {"score": 0.00266693888510356, "phrase": "social_welfare"}, {"score": 0.00247249708860822, "phrase": "truthful_bidding"}, {"score": 0.002336004938424957, "phrase": "egalitarian_allocation"}, {"score": 0.0022070310530794097, "phrase": "simulated_manufacturing_environment"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Multi-agent systems", " Mechanism design", " Multiple criteria analysis", " Supply chain management", " Multi-attribute auctions"], "paper_abstract": "Multi-attribute auctions allow agents to sell and purchase goods and services taking into account more attributes than just price (e.g. service time, tolerances, qualities, etc.). In this paper we analyze attributes involved during the auction process and propose to classify them between verifiable attributes, unverifiable attributes and auctioneer provided attributes. According to this classification we present VMA2, a new Vickrey-based reverse multi-attribute auction mechanism, which takes into account the different types of attributes involved in the auction and allows the auction customization in order to suit the auctioneer needs. On the one hand, the use of auctioneer provided attributes enables the inclusion of different auction concepts, such as social welfare, trust or robustness whilst, on the other hand, the use of verifiable attributes guarantee truthful bidding. The paper exemplifies the behavior of VMA2 describing how an egalitarian allocation can be achieved. The mechanism is then tested in a simulated manufacturing environment and compared with other existing auction allocation methods. (C) 2014 Elsevier Ltd. All rights reserved.", "paper_title": "Multi-attribute auctions with different types of attributes: Enacting properties in multi-attribute auctions", "paper_id": "WOS:000335629500026"}