{"auto_keywords": [{"score": 0.04929645657748363, "phrase": "unreliable_input"}, {"score": 0.04903859217951914, "phrase": "user_experience"}, {"score": 0.0485274202174747, "phrase": "bci"}, {"score": 0.011309818101816464, "phrase": "perfect_control"}, {"score": 0.00468458651904683, "phrase": "brain-computer_interfaces"}, {"score": 0.004608060637237746, "phrase": "valuable_new_input_modality"}, {"score": 0.004582829542018412, "phrase": "human-computer_interaction_systems"}, {"score": 0.004483272938890684, "phrase": "gesture_or_gaze_based_systems"}, {"score": 0.004410021079229461, "phrase": "input_commands"}, {"score": 0.004302371600216303, "phrase": "important_questions"}, {"score": 0.004061256614370055, "phrase": "actual_and_perceived_control"}, {"score": 0.0038973170902076707, "phrase": "important_part"}, {"score": 0.00379170322821611, "phrase": "highest_level"}, {"score": 0.003415732938641525, "phrase": "experiment_users"}, {"score": 0.00334144503360907, "phrase": "simple_game"}, {"score": 0.0029042887008048717, "phrase": "traditional_keyboard"}, {"score": 0.002817748867229525, "phrase": "short_questionnaire"}, {"score": 0.0027113164412780107, "phrase": "perceived_control"}, {"score": 0.002601727192945944, "phrase": "respective_session"}, {"score": 0.002566188216663453, "phrase": "user_frustration"}, {"score": 0.002545097679559711, "phrase": "increasing_control"}, {"score": 0.0024088451312725924, "phrase": "lower_levels"}, {"score": 0.002395626697083963, "phrase": "control_fun"}, {"score": 0.0023694065215394593, "phrase": "improved_control"}, {"score": 0.0022425385043433397, "phrase": "new_insights"}, {"score": 0.0021049977753042253, "phrase": "fun_game"}], "paper_keywords": ["Brain-computer interfaces", " computer interfaces", " human computer interaction"], "paper_abstract": "Brain-computer interfaces (BCI) provide a valuable new input modality within human-computer interaction systems. However, like other body-based inputs such as gesture or gaze based systems, the system recognition of input commands is still far from perfect. This raises important questions, such as what level of control should such an interface be able to provide. What is the relationship between actual and perceived control? And in the case of applications for entertainment in which fun is an important part of user experience, should we even aim for the highest level of control, or is the optimum elsewhere? In this paper, we evaluate whether we can modulate the amount of control and if a game can be fun with less than perfect control. In the experiment users (n = 158) played a simple game in which a hamster has to be guided to the exit of a maze. The amount of control the user has over the hamster is varied. The variation of control through confusion matrices makes it possible to simulate the experience of using a BCI, while using the traditional keyboard for input. After each session the user completed a short questionnaire on user experience and perceived control. Analysis of the data showed that the perceived control of the user could largely be explained by the amount of control in the respective session. As expected, user frustration decreases with increasing control. Moreover, the results indicate that the relation between fun and control is not linear. Although at lower levels of control fun does increase with improved control, the level of fun drops just before perfect control is reached (with an optimum around 96%). This poses new insights for developers of games who want to incorporate some form of BCI or other modality with unreliable input in their game: for creating a fun game, unreliable input can be used to create a challenge for the user.", "paper_title": "How Much Control Is Enough? Influence of Unreliable Input on User Experience", "paper_id": "WOS:000327647500008"}