{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "cluttered_scenes"}, {"score": 0.004778594263962987, "phrase": "viewpoint_independent_recognition"}, {"score": 0.004742511243894382, "phrase": "free-form_objects"}, {"score": 0.004514491994233911, "phrase": "challenging_task"}, {"score": 0.0039684322717435045, "phrase": "multidimensional_table_representations"}, {"score": 0.0035550029054401016, "phrase": "remaining_views"}, {"score": 0.0035147642199945387, "phrase": "hash_table-based_voting_scheme"}, {"score": 0.0034096661914349577, "phrase": "relative_transformations"}, {"score": 0.0031604223680801774, "phrase": "model_library"}, {"score": 0.0031246358910995316, "phrase": "online_recognition"}, {"score": 0.002907184330345933, "phrase": "similarity_measures"}, {"score": 0.0028525124381208705, "phrase": "model_tensors"}, {"score": 0.002746225320405654, "phrase": "highest_similarity"}, {"score": 0.0023235629819760018, "phrase": "real_and_synthetic_data"}, {"score": 0.002254003531073337, "phrase": "overall_recognition_rate"}, {"score": 0.0021782296784218923, "phrase": "spin_images"}, {"score": 0.0021049977753042253, "phrase": "recognition_rate"}], "paper_keywords": ["multiview correspondence", " registration", " 3D object recognition", " segmentation", " 3D representation", " shape descriptor", " geometric hashing"], "paper_abstract": "Viewpoint independent recognition of free-form objects and their segmentation in the presence of clutter and occlusions is a challenging task. We present a novel 3D model-based algorithm which performs this task automatically and efficiently. A 3D model of an object is automatically constructed offline from its multiple unordered range images (views). These views are converted into multidimensional table representations (which we refer to as tensors). Correspondences are automatically established between these views by simultaneously matching the tensors of a view with those of the remaining views using a hash table-based voting scheme. This results in a graph of relative transformations used to register the views before they are integrated into a seamless 3D model. These models and their tensor representations constitute the model library. During online recognition, a tensor from the scene is simultaneously matched with those in the library by casting votes. Similarity measures are calculated for the model tensors which receive the most votes. The model with the highest similarity is transformed to the scene and, if it aligns accurately with an object in the scene, that object is declared as recognized and is segmented. This process is repeated until the scene is completely segmented. Experiments were performed on real and synthetic data comprised of 55 models and 610 scenes and an overall recognition rate of 95 percent was achieved. Comparison with the spin images revealed that our algorithm is superior in terms of recognition rate and efficiency.", "paper_title": "Three-dimensional model-based object recognition and segmentation in cluttered scenes", "paper_id": "WOS:000239605500004"}