{"auto_keywords": [{"score": 0.04845849110410783, "phrase": "complex_diseases"}, {"score": 0.004767826806287385, "phrase": "multiple_classifier_system"}, {"score": 0.004698000536608171, "phrase": "specific_causes"}, {"score": 0.003820896867623235, "phrase": "false_presumptions"}, {"score": 0.003728000957725218, "phrase": "unpredictable_effects"}, {"score": 0.0036553070575015344, "phrase": "greatly_increased_amount"}, {"score": 0.003566422652043389, "phrase": "medical_databases"}, {"score": 0.003531474887552889, "phrase": "data_mining"}, {"score": 0.003168859801438632, "phrase": "single_classifier"}, {"score": 0.0028857130140890787, "phrase": "multiple_classifier_systems"}, {"score": 0.00266693888510356, "phrase": "dynamic_weighted_voting_scheme"}, {"score": 0.002576503437739865, "phrase": "classifiers'_decision_combination"}, {"score": 0.002416589459425828, "phrase": "localized_generalization_error"}, {"score": 0.002255431275670053, "phrase": "favorable_results"}, {"score": 0.0021896891011033105, "phrase": "individual_classifiers"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Multiple classifier system", " T2DM", " Classification"], "paper_abstract": "The specific causes of complex diseases such as Type-2 Diabetes Mellitus (T2DM) have not yet been identified. Nevertheless, many medical science researchers believe that complex diseases are caused by a combination of genetic, environmental, and lifestyle factors. Detection of such diseases becomes an issue because it is not free from false presumptions and is accompanied by unpredictable effects. Given the greatly increased amount of data gathered in medical databases, data mining has been used widely in recent years to detect and improve the diagnosis of complex diseases. However, past research showed that no single classifier can be considered optimal for all problems. Therefore, in this paper, we focus on employing multiple classifier systems to improve the accuracy of detection for complex diseases, such as T2DM. We proposed a dynamic weighted voting scheme called multiple factors weighted combination for classifiers' decision combination. This method considers not only the local and global accuracy but also the diversity among classifiers and localized generalization error of each classifier. We evaluated our method on two real T2DM data sets and other medical data sets. The favorable results indicated that our proposed method significantly outperforms individual classifiers and other fusion methods. (C) 2014 Elsevier Inc. All rights reserved.", "paper_title": "An improved early detection method of type-2 diabetes mellitus using multiple classifier system", "paper_id": "WOS:000344442300001"}