{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "molecular_and_electronic_properties"}, {"score": 0.004345085569121329, "phrase": "large_number"}, {"score": 0.003901754272977278, "phrase": "cardiovascular_disorders"}, {"score": 0.0038074544783102226, "phrase": "eventual_need"}, {"score": 0.0034187896011435245, "phrase": "healthy_people"}, {"score": 0.0033361232750221863, "phrase": "metabolic_syndrome"}, {"score": 0.003130396338031522, "phrase": "lipid_metabolism"}, {"score": 0.0027969169552385974, "phrase": "theoretical_methods"}, {"score": 0.002689430273401131, "phrase": "biological_activity"}, {"score": 0.0023677483882740317, "phrase": "biological_interactions"}, {"score": 0.0022216045996270974, "phrase": "future_prospects"}, {"score": 0.0021678232353129472, "phrase": "new_drugs"}, {"score": 0.0021049977753042253, "phrase": "theoretical_and_experimental_properties"}], "paper_keywords": ["Diabetes mellitus", " DFT", " Drug design", " Electronic properties", " IEF-PCM"], "paper_abstract": "Diabetes mellitus (DM) is a disease that affects a large number of people, and the number of problems associated with the disease has been increasing in the past few decades. These problems include cardiovascular disorders, blindness and the eventual need to amputate limbs. Therefore, the quality of life for people living with DM is less than it is for healthy people. In several cases, metabolic syndrome (MS), which can be considered a disturbance of the lipid metabolism, is associated with DM. In this work, two drugs used to treat DM, pioglitazone and rosiglitazone, were studied using theoretical methods, and their molecular properties were related to the biological activity of these drugs. From the results, it was possible to correlate the properties of each substance-particularly electronic properties-with the biological interactions that are linked to their pharmacological effects. These results suggest that there are future prospects for designing or developing new drugs based on the correlation between theoretical and experimental properties.", "paper_title": "Theoretical study on the molecular and electronic properties of some substances used for diabetes mellitus treatment", "paper_id": "WOS:000275122000017"}