{"auto_keywords": [{"score": 0.04623487127047266, "phrase": "japan"}, {"score": 0.009313619519722415, "phrase": "publicly_available_experimental_data"}, {"score": 0.00481495049065317, "phrase": "foundational_platform"}, {"score": 0.004751889650408546, "phrase": "japan's_k_supercomputer"}, {"score": 0.004710306419574744, "phrase": "next-generation_drug_design"}, {"score": 0.004294962474996283, "phrase": "particularly_difficult_situation"}, {"score": 0.003985602342418578, "phrase": "entire_medical_system"}, {"score": 0.0037973594873521596, "phrase": "newly_launched_k_supercomputer"}, {"score": 0.0037311260623089436, "phrase": "big_data_drug_discovery"}, {"score": 0.003698442219929622, "phrase": "structural_simulation-based_drug_discovery"}, {"score": 0.002981026404927824, "phrase": "virtual_screening"}, {"score": 0.0027905114793984084, "phrase": "second_investigation"}, {"score": 0.002499590390751339, "phrase": "common_feature"}, {"score": 0.0024667783849055634, "phrase": "result_types"}, {"score": 0.0021998194157393353, "phrase": "computing_resources"}, {"score": 0.0021049977753042253, "phrase": "equivalent_large-scale_infrastructure"}], "paper_keywords": ["Drug design", " Virtual screening", " Chemogenomics", " Molecular dynamics", " Free energy calculation"], "paper_abstract": "The cost of pharmaceutical R&D has risen enormously, both worldwide and in Japan. However, Japan faces a particularly difficult situation in that its population is aging rapidly, and the cost of pharmaceutical R&D affects not only the industry but the entire medical system as well. To attempt to reduce costs, the newly launched K supercomputer is available for big data drug discovery and structural simulation-based drug discovery. We have implemented both primary (direct) and secondary (infrastructure, data processing) methods for the two types of drug discovery, custom tailored to maximally use the 88128 compute nodes/CPUs of K, and evaluated the implementations. We present two types of results. In the first, we executed the virtual screening of nearly 19 billion compound-protein interactions, and calculated the accuracy of predictions against publicly available experimental data. In the second investigation, we implemented a very computationally intensive binding free energy algorithm, and found that comparison of our binding free energies was considerably accurate when validated against another type of publicly available experimental data. The common feature of both result types is the scale at which computations were executed. The frameworks presented in this article provide prospectives and applications that, while tuned to the computing resources available in Japan, are equally applicable to any equivalent large-scale infrastructure provided elsewhere.", "paper_title": "Constructing a Foundational Platform Driven by Japan's K Supercomputer for Next-Generation Drug Design", "paper_id": "WOS:000345974300003"}