{"auto_keywords": [{"score": 0.04522176534199054, "phrase": "register_file"}, {"score": 0.00481495049065317, "phrase": "file_power-density_minimization"}, {"score": 0.004751216062917875, "phrase": "increased_chip_temperature"}, {"score": 0.004565007074039171, "phrase": "severe_reliability_problems"}, {"score": 0.004415395176043526, "phrase": "leakage_power"}, {"score": 0.004103212598803194, "phrase": "highest_temperature"}, {"score": 0.0035908627899097407, "phrase": "elevated_leakage_power"}, {"score": 0.0033367819052051995, "phrase": "highly_clustered_register_file_accesses"}, {"score": 0.0029394074636168435, "phrase": "compile-time_temperature-aware_register_reallocation_methodologies"}, {"score": 0.0024875444192203485, "phrase": "hardware_overheads"}, {"score": 0.002389839896897424, "phrase": "underlying_problem"}, {"score": 0.0023590921810385337, "phrase": "np"}, {"score": 0.0021049977753042253, "phrase": "proposed_methodology"}], "paper_keywords": ["Algorithms", " Design", " Experimentation"], "paper_abstract": "Increased chip temperature has been known to cause severe reliability problems and to significantly increase leakage power. The register file has been previously shown to exhibit the highest temperature compared to all other hardware components in a modern high-end embedded processor, which makes it particularly susceptible to faults and elevated leakage power. We show that this is mostly due to the highly clustered register file accesses where a set of few registers physically placed close to each other are accessed with very high frequency. We propose compile-time temperature-aware register reallocation methodologies for breaking such groups of registers and to uniformly distribute the accesses to the register file. This is achieved with no performance and no hardware overheads. We show that the underlying problem is NP-hard, and subsequently introduce and evaluate two efficient algorithmic heuristics. Our extensive experimental study demonstrates the efficiency of the proposed methodology.", "paper_title": "Temperature-Aware Register Reallocation for Register File Power-Density Minimization", "paper_id": "WOS:000266014400008"}