{"auto_keywords": [{"score": 0.0156107766127449, "phrase": "clinical_specialties"}, {"score": 0.012491483373160398, "phrase": "clinical_specialty"}, {"score": 0.004456534664975427, "phrase": "discriminatory_impact"}, {"score": 0.004287415750101536, "phrase": "methods_datasets"}, {"score": 0.004197878397604354, "phrase": "general_equivalence_mappings"}, {"score": 0.004153810449519519, "phrase": "statewide_medicaid_emergency_department_billing"}, {"score": 0.0040102178375662914, "phrase": "directional_relationships"}, {"score": 0.003968112038249246, "phrase": "complex_network"}, {"score": 0.0038715697646612766, "phrase": "simpler_motifs"}, {"score": 0.0037508743235608872, "phrase": "five_mapping_motif_categories"}, {"score": 0.0034713900276078786, "phrase": "convoluted_mappings"}, {"score": 0.003235367401211807, "phrase": "convoluted_diagnoses_mappings"}, {"score": 0.0030047427137652218, "phrase": "case_study"}, {"score": 0.0028702659563021047, "phrase": "convoluted_diagnoses"}, {"score": 0.00284009509859163, "phrase": "'abdominal_pain"}, {"score": 0.0027514668612638074, "phrase": "discussion_previous_qualitative_studies"}, {"score": 0.00247548600804924, "phrase": "thorough_quantitative_summary"}, {"score": 0.0023480317852018133, "phrase": "clinical_practice"}, {"score": 0.002298902547676131, "phrase": "web_portal"}, {"score": 0.002282755117032059, "phrase": "analytic_tables"}, {"score": 0.0022667208478315323, "phrase": "conclusions_post-transition"}, {"score": 0.002227125088932002, "phrase": "frequent_diseases"}, {"score": 0.0022114807037424944, "phrase": "convoluted_mapping_network_patterns"}], "paper_keywords": [""], "paper_abstract": "Objective Applying the science of networks to quantify the discriminatory impact of the ICD-9-CM to ICD-10-CM transition between clinical specialties. Materials and Methods Datasets were the Center for Medicaid and Medicare Services ICD-9-CM to ICD-10-CM mapping files, general equivalence mappings, and statewide Medicaid emergency department billing. Diagnoses were represented as nodes and their mappings as directional relationships. The complex network was synthesized as an aggregate of simpler motifs and tabulation per clinical specialty. Results We identified five mapping motif categories: identity, class-to-subclass, subclass-to-class, convoluted, and no mapping. Convoluted mappings indicate that multiple ICD-9-CM and ICD-10-CM codes share complex, entangled, and non-reciprocal mappings. The proportions of convoluted diagnoses mappings (36% overall) range from 5% (hematology) to 60% (obstetrics and injuries). In a case study of 24 008 patient visits in 217 emergency departments, 27% of the costs are associated with convoluted diagnoses, with 'abdominal pain' and 'gastroenteritis' accounting for approximately 3.5%. Discussion Previous qualitative studies report that administrators and clinicians are likely to be challenged in understanding and managing their practice because of the ICD-10-CM transition. We substantiate the complexity of this transition with a thorough quantitative summary per clinical specialty, a case study, and the tools to apply this methodology easily to any clinical practice in the form of a web portal and analytic tables. Conclusions Post-transition, successful management of frequent diseases with convoluted mapping network patterns is critical. The http://lussierlab.org/transition-to-ICD 10CM web portal provides insight in linking onerous diseases to the ICD-10 transition.", "paper_title": "The discriminatory cost of ICD-10-CM transition between clinical specialties: metrics, case study, and mitigating tools", "paper_id": "WOS:000320168600017"}