{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "linear_discriminant_analysis"}, {"score": 0.046997141122384276, "phrase": "semi-supervised_learning"}, {"score": 0.037423767602129, "phrase": "unlabeled_data"}, {"score": 0.00477513738640734, "phrase": "moment-constraint_parameter_estimation"}, {"score": 0.004716031208088975, "phrase": "semi-supervised_version"}, {"score": 0.004677032188041644, "phrase": "classical_linear_discriminant_analysis"}, {"score": 0.004449688143230257, "phrase": "additional_extrinsic_assumptions"}, {"score": 0.004304271837157217, "phrase": "labeled_and_unlabeled_data"}, {"score": 0.00402748353567517, "phrase": "particular_relations"}, {"score": 0.0038157022294338454, "phrase": "label-independent_quantities"}, {"score": 0.003706299561774348, "phrase": "latter_type"}, {"score": 0.0033128141572497704, "phrase": "dependent_estimates"}, {"score": 0.0028640745158229875, "phrase": "increasing_numbers"}, {"score": 0.002581165831422692, "phrase": "partially_supervised_learning"}, {"score": 0.002549146857303602, "phrase": "main_novelty"}, {"score": 0.0024759682272230735, "phrase": "affine_invariant_approach"}, {"score": 0.002259346051668556, "phrase": "general_principle"}, {"score": 0.00224061675049049, "phrase": "intrinsic_constraints"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Linear discriminant analysis", " Semi-supervised learning", " Moment constraints", " Affine invariant", " Classification"], "paper_abstract": "A semi-supervised version of classical linear discriminant analysis is presented. As opposed to most current approaches to semi-supervised learning, no additional extrinsic assumptions are made to tie information coming from labeled and unlabeled data together. Our approach exploits the fact that the parameters that are to be estimated fulfill particular relations, intrinsic to the classifier, that link label-dependent with label-independent quantities. In this way, the latter type of parameters, which can be estimated based on unlabeled data, impose constraints on the former and lead to a reduction in variability of the label dependent estimates. As a result, the performance of our semi-supervised linear discriminant is typically expected to improve over that of its regular supervised match. Possibly more important, our semi-supervised linear discriminant analysis does not show the severe deteriorations other approaches frequently display with increasing numbers of unlabeled data. This work recapitulates, corrects, extends, and revises our previous work that has been published as part of the First IAPR TC3 Workshop on Partially Supervised Learning. The main novelty it provides over our earlier work is an affine invariant approach to semi-supervised learning befitting linear discriminant analysis. Besides, more elaborate and convincing experimental evidence of the potential of our general approach is provided. We essentially believe that the general principle of intrinsic constraints is of interest as such and may inspire other novel semi-supervised methods. (C) 2013 Elsevier B.V. All rights reserved.", "paper_title": "Semi-supervised linear discriminant analysis through moment-constraint parameter estimation", "paper_id": "WOS:000331157000004"}