{"auto_keywords": [{"score": 0.03997447142565907, "phrase": "bn"}, {"score": 0.00481495049065317, "phrase": "leveraging_bayesian_network_learning_techniques"}, {"score": 0.004630150894006861, "phrase": "causal_probabilistic_logic"}, {"score": 0.0044718206943536514, "phrase": "probabilistic_modeling_language"}, {"score": 0.004189337956225294, "phrase": "cp-logic_theories"}, {"score": 0.004063664475797303, "phrase": "training_data"}, {"score": 0.0038401488612789963, "phrase": "bayesian_network"}, {"score": 0.0032830808525570903, "phrase": "equivalent_bn."}, {"score": 0.0031431690368229443, "phrase": "bn_parameter_learning"}, {"score": 0.0030092017034068666, "phrase": "refinement_operator"}, {"score": 0.002855934865505357, "phrase": "valid_cp-theories"}, {"score": 0.002818850283787242, "phrase": "paper's_second_contribution"}, {"score": 0.0027822459052173113, "phrase": "theoretical_and_experimental_comparison"}, {"score": 0.0025611773887867255, "phrase": "noisy-or_nodes"}, {"score": 0.0025059724686541263, "phrase": "close_to_fully_connected_networks"}, {"score": 0.002473420909291381, "phrase": "additional_unobserved_nodes"}, {"score": 0.002357632753637638, "phrase": "controlled_artificial_domain_show"}, {"score": 0.0021956085908714017, "phrase": "sem-cp-logic"}, {"score": 0.002151388538895855, "phrase": "medical_application"}, {"score": 0.0021049977753042253, "phrase": "hiv_research"}], "paper_keywords": ["Statistical Relational Learning", " CP-logic"], "paper_abstract": "Causal relations are present in many application domains. Causal Probabilistic Logic (CP-logic) is a probabilistic modeling language that is especially designed to express such relations. This paper investigates the learning of CP-logic theories (CP-theories) from training data. Its first contribution is SEM-CP-logic, an algorithm that learns CP-theories by leveraging Bayesian network (BN) learning techniques. SEM-CP-logic is based on a transformation between CP-theories and BNs. That is, the method applies BN learning techniques to learn a CP-theory in the form of an equivalent BN. To this end, certain modifications are required to the BN parameter learning and structure search, the most important one being that the refinement operator used by the search must guarantee that the constructed BNs represent valid CP-theories. The paper's second contribution is a theoretical and experimental comparison between CP-theory and BN learning. We show that the most simple CP-theories can be represented with BNs consisting of noisy-OR nodes, while more complex theories require close to fully connected networks (unless additional unobserved nodes are introduced in the network). Experiments in a controlled artificial domain show that in the latter cases CP-theory learning with SEM-CP-logic requires fewer training data than BN learning. We also apply SEM-CP-logic in a medical application in the context of HIV research, and show that it can compete with state-of-the-art methods in this domain.", "paper_title": "Learning Ground CP-Logic Theories by Leveraging Bayesian Network Learning Techniques", "paper_id": "WOS:000262453700008"}