{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "umls_metathesaurus"}, {"score": 0.015095344558062988, "phrase": "related_organ_systems"}, {"score": 0.010650102421009517, "phrase": "mapping_process"}, {"score": 0.004331320910631647, "phrase": "clinical_text"}, {"score": 0.004185874747231179, "phrase": "overarching_goal"}, {"score": 0.004073027900718392, "phrase": "organ_systems"}, {"score": 0.0040452928361255445, "phrase": "population_health"}, {"score": 0.0038960785110831162, "phrase": "concepts'_semantic_types"}, {"score": 0.0038563438670516127, "phrase": "inter-concept_relationships"}, {"score": 0.0037910145286595386, "phrase": "selective_portion"}, {"score": 0.0036015684625793775, "phrase": "highest_level_organ_systems"}, {"score": 0.0035648266669315943, "phrase": "traversed_concepts"}, {"score": 0.003409880074659807, "phrase": "clinical_signs"}, {"score": 0.003317883538640966, "phrase": "superfluous_concepts"}, {"score": 0.003284026247389735, "phrase": "manual_review"}, {"score": 0.0029436264166293317, "phrase": "physical_and_mental_signs"}, {"score": 0.0028446460307503343, "phrase": "anatomically_related_organ_systems"}, {"score": 0.002567180189640976, "phrase": "umls."}, {"score": 0.002285216591220303, "phrase": "smaller_set"}, {"score": 0.0022696277881969896, "phrase": "umls_concepts"}, {"score": 0.002215897810312801, "phrase": "patient_records"}, {"score": 0.0021340178074057245, "phrase": "information_extraction_pipelines"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Information extraction", " Semantic mapping", " UMLS Metathesaurus", " Symptoms"], "paper_abstract": "Objective: To develop a method to exploit the UMLS Metathesaurus for extracting and categorizing concepts found in clinical text representing signs and symptoms to anatomically related organ systems. The overarching goal is to classify patient reported symptoms to organ systems for population health and epidemiological analyses. Materials and methods: Using the concepts' semantic types and the inter-concept relationships as guidance, a selective portion of the concepts within the UMLS Metathesaurus was traversed starting from the concepts representing the highest level organ systems. The traversed concepts were chosen, filtered, and reviewed to obtain the concepts representing clinical signs and symptoms by blocking deviations, pruning superfluous concepts, and manual review. The mapping process was applied to signs and symptoms annotated in a corpus of 750 clinical notes. Results: The mapping process yielded a total of 91,000 UMLS concepts (with approximately 300,000 descriptions) possibly representing physical and mental signs and symptoms that were extracted and categorized to the anatomically related organ systems. Of 1864 distinct descriptions of signs and symptoms found in the 750 document corpus, 1635 of these (88%) were successfully mapped to the set of concepts extracted from the UMLS. Of 668 unique concepts mapped, 603 (90%) were correctly categorized to their organ systems. Conclusion: We present a process that facilitates mapping of signs and symptoms to their organ systems. By providing a smaller set of UMLS concepts to use for comparing and matching patient records, this method has the potential to increase efficiency of information extraction pipelines. Published by Elsevier Inc.", "paper_title": "Exploiting the UMLS Metathesaurus for extracting and categorizing concepts representing signs and symptoms to anatomically related organ systems", "paper_id": "WOS:000366791000003"}