{"auto_keywords": [{"score": 0.04824827821165198, "phrase": "coursevis"}, {"score": 0.00481495049065317, "phrase": "web-based_distance_courses"}, {"score": 0.004384960761826366, "phrase": "novel_approach"}, {"score": 0.004283576270012874, "phrase": "web_log_data"}, {"score": 0.004184526032558792, "phrase": "course_management_systems"}, {"score": 0.0037516215763875225, "phrase": "distance_learning_classes"}, {"score": 0.003580032420161922, "phrase": "information_visualization"}, {"score": 0.0030865992688177005, "phrase": "learning_instructors"}, {"score": 0.003015143226706584, "phrase": "better_understanding"}, {"score": 0.0024040357029838774, "phrase": "special_attention"}, {"score": 0.002154930852763048, "phrase": "iv_techniques"}, {"score": 0.0021049977753042253, "phrase": "appropriate_graphical_representations"}], "paper_keywords": ["web-based distance education", " student tracking", " information visulization"], "paper_abstract": "This paper presents CourseVis, a system that takes a novel approach of using Web log data generated by course management systems (CMSs) to help instructors become aware of what is happening in distance learning classes. Specifically, techniques from information visualization (IV) are employed to graphically render complex, multidimensional student tracking data. Several graphical representations are generated to help distance learning instructors get a better understanding of social, behavioural, and cognitive aspects related to learners. The evaluation of CourseVis shows that it can help instructors to quickly identify tendencies in then-classes and discover individuals that might need special attention. This suggests that the effectiveness of CMSs can be improved by integrating IV techniques to generate appropriate graphical representations, similar to those produced in CourseVis. (c) 2006 Elsevier Ltd. All rights reserved.", "paper_title": "CourseVis: A graphical student monitoring tool for supporting instructors in web-based distance courses", "paper_id": "WOS:000243626900003"}