{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "traditional_co-citation_analysis"}, {"score": 0.03640197784168314, "phrase": "full_text"}, {"score": 0.027065729382073724, "phrase": "corresponding_traditional_co-citation_network"}, {"score": 0.025741989930694306, "phrase": "sentence-level_co-citations"}, {"score": 0.004714387899814988, "phrase": "co-cited_references"}, {"score": 0.003626000977962191, "phrase": "nearest_instance"}, {"score": 0.003593311381057356, "phrase": "co-citation_relation"}, {"score": 0.0034342161742428635, "phrase": "scientific_publications"}, {"score": 0.0031653299069848463, "phrase": "co-citation_patterns"}, {"score": 0.0030711589859463814, "phrase": "biomed_central"}, {"score": 0.0029887957779347394, "phrase": "co-citation_instances"}, {"score": 0.002952900365829518, "phrase": "journal_articles"}, {"score": 0.0029262611715147454, "phrase": "traditional_article-level_co-citation_counts"}, {"score": 0.002796616969627065, "phrase": "organizational_sections"}, {"score": 0.0027215964067013924, "phrase": "co-citation_proximity"}, {"score": 0.002705199644897355, "phrase": "different_co-citation_frequency_groups"}, {"score": 0.0025853238923610076, "phrase": "different_proximity_levels"}, {"score": 0.002389956401870098, "phrase": "high_co-citation_frequencies"}, {"score": 0.002368383667454108, "phrase": "low_co-citation_frequencies"}, {"score": 0.0022840180582947302, "phrase": "essential_structure"}, {"score": 0.002209319719984651, "phrase": "entire_co-citation_instances"}, {"score": 0.0021370591426091833, "phrase": "underlying_factors"}], "paper_keywords": ["Co-citation proximity", " Co-citation analysis", " Citation contextual", " PubMed Central"], "paper_abstract": "Traditional co-citation analysis has not taken the proximity of co-cited references into account. As long as two references are cited by the same article, they are retreated equally regardless the distance between where citations appear in the article. Little is known about what additional insights into citation and co-citation behaviours one might gain from studying distributions of co-citation in terms of such proximity. How are citations distributed in an article? What insights does the proximity of co-citation provide? In this article, the proximity of a pair of co-cited reference is defined as the nearest instance of the co-citation relation in text. We investigate the proximity of co-citation in full text of scientific publications at four levels, namely, the sentence level, the paragraph level, the section level, and the article level. We conducted four studies of co-citation patterns in the full text of articles published in 22 open access journals from BioMed Central. First, we compared the distributions of co-citation instances at four proximity levels in journal articles to the traditional article-level co-citation counts. Second, we studied the distributions of co-citations of various proximities across organizational sections in articles. Third, the distribution of co-citation proximity in different co-citation frequency groups is investigated. Fourth, we identified the occurrences of co-citations at different proximity levels with reference to the corresponding traditional co-citation network. The results show that (1) the majority of co-citations are loosely coupled at the article level, (2) a higher proportion of sentence-level co-citations is found in high co-citation frequencies than in low co-citation frequencies, (3) tightly coupled sentence-level co-citations not only preserve the essential structure of the corresponding traditional co-citation network but also form a much smaller subset of the entire co-citation instances typically considered by traditional co-citation analysis. Implications for improving our understanding of underlying factors concerning co-citations and developing more efficient co-citation analysis methods are discussed.", "paper_title": "The proximity of co-citation", "paper_id": "WOS:000302478200014"}