{"auto_keywords": [{"score": 0.049196562839543705, "phrase": "app"}, {"score": 0.011488607049082498, "phrase": "tam"}, {"score": 0.00481495049065317, "phrase": "purpose_-_this_study"}, {"score": 0.004290201740122912, "phrase": "students'_satisfaction"}, {"score": 0.0036417293068767816, "phrase": "costa"}, {"score": 0.003614678418617691, "phrase": "mccrae"}, {"score": 0.0033426431769871734, "phrase": "israel"}, {"score": 0.0032083351151314405, "phrase": "six_questionnaires"}, {"score": 0.0030225753906647935, "phrase": "new_technological_platform"}, {"score": 0.002826383890518307, "phrase": "new_media"}, {"score": 0.002613487968156893, "phrase": "app_satisfaction"}, {"score": 0.0024620842899061614, "phrase": "app_use"}, {"score": 0.002389696110283506, "phrase": "theoretical_framework"}, {"score": 0.0023107943665108465, "phrase": "\"big_five\"_model"}, {"score": 0.002176887956041267, "phrase": "app_users"}, {"score": 0.0021446391766277817, "phrase": "possible_factors"}], "paper_keywords": ["TAM", " Exploratory study", " The Big Five model", " Uses and Gratifications approach", " What's App"], "paper_abstract": "Purpose - This study focusses on What's App, a mobile messaging service for smartphones, that was founded in 2009. The purpose of this study is to explore which factors may influence students' satisfaction and duration of time, spent on What's App. Design/methodology/approach - In order to answer this question it uses the Uses and Gratifications (U&G) approach (Katz, 1959), as well as the Big Five model (Costa and McCrae, 1992), and the Technology Acceptance Model (TAM) (Davis, 1989). The research was conducted in Israel and encompassed 111 information science (IS) students. Researchers used six questionnaires to gather data. Findings - The findings of this study shed light on a new technological platform: What's App that has rarely been examined to date, and expands the U&G perspectives to new media. Findings confirm that the U&G paradigm, as well as personality characteristics and perceived enjoyment, effect What's App satisfaction and duration, and highlight the importance of both the U&G approach and individual differences when exploring motivations underlying What's App use. Originality/value - This study proposes a theoretical framework by combining the U&G approach, constructs from the \"Big Five\" model, and one variable from the TAM, to investigate the attitudes of What's App users, and propose possible factors that may explain why certain individuals use What's App.", "paper_title": "Why do students use What's App? - an exploratory study", "paper_id": "WOS:000352709900002"}