{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "relevant_functions"}, {"score": 0.005885163424802996, "phrase": "google_code_search"}, {"score": 0.005827965755920054, "phrase": "koders"}, {"score": 0.004585212379675535, "phrase": "different_studies"}, {"score": 0.0041579627441997, "phrase": "ordinary_code_fragments"}, {"score": 0.003770373393393271, "phrase": "existing_code_search_engines"}, {"score": 0.0034863899423238707, "phrase": "code_reuse"}, {"score": 0.003319830633865628, "phrase": "code_search_system"}, {"score": 0.0029807934480637855, "phrase": "surfing_behavior"}, {"score": 0.0029086869572567072, "phrase": "related_concepts"}, {"score": 0.002598764579760562, "phrase": "standard_methodology"}, {"score": 0.0025608471909800076, "phrase": "information-retrieval-based_engines"}, {"score": 0.002333193766510394, "phrase": "strong_statistical_significance"}, {"score": 0.002265586601922693, "phrase": "higher_precision"}, {"score": 0.002243536275610246, "phrase": "portfolio"}, {"score": 0.0021050172105198986, "phrase": "pagerank"}], "paper_keywords": ["Documentation", " Design", " Source-code search", " information retrieval", " natural language processing", " Pagerank", " user studies"], "paper_abstract": "Different studies show that programmers are more interested in finding definitions of functions and their uses than variables, statements, or ordinary code fragments. Therefore, developers require support in finding relevant functions and determining how these functions are used. Unfortunately, existing code search engines do not provide enough of this support to developers, thus reducing the effectiveness of code reuse. We provide this support to programmers in a code search system called Portfolio that retrieves and visualizes relevant functions and their usages. We have built Portfolio using a combination of models that address surfing behavior of programmers and sharing related concepts among functions. We conducted two experiments: first, an experiment with 49 C/C++ programmers to compare Portfolio to Google Code Search and Koders using a standard methodology for evaluating information-retrieval-based engines; and second, an experiment with 19 Java programmers to compare Portfolio to Koders. The results show with strong statistical significance that users find more relevant functions with higher precision with Portfolio than with Google Code Search and Koders. We also show that by using PageRank, Portfolio is able to rank returned relevant functions more efficiently.", "paper_title": "Portfolio: Searching for Relevant Functions and Their Usages in Millions of Lines of Code", "paper_id": "WOS:000326024500010"}