{"auto_keywords": [{"score": 0.05007852962010534, "phrase": "co-occurrence_analysis"}, {"score": 0.016566883387314657, "phrase": "semantic_information_retrieval"}, {"score": 0.006482079762696172, "phrase": "potential_relations_retrieval"}, {"score": 0.0057155045571189835, "phrase": "literature_review"}, {"score": 0.004770211811866158, "phrase": "purpose_-_the_paper"}, {"score": 0.00466016686289196, "phrase": "new_method"}, {"score": 0.004489327204473076, "phrase": "common_aspects"}, {"score": 0.003587616378156851, "phrase": "wuhan_university_library's_bibliographic_retrieval_systems"}, {"score": 0.0035211747962710276, "phrase": "experimental_analysis"}, {"score": 0.0033919477901198716, "phrase": "semantic_information_retrieval_research"}, {"score": 0.003329117824699891, "phrase": "ontology-based_query_techniques"}, {"score": 0.0032522091171602557, "phrase": "semantic_relation_retrieval"}, {"score": 0.0031475032122226, "phrase": "obvious_relations_retrieval"}, {"score": 0.0030178044717552605, "phrase": "theoretical_ideas"}, {"score": 0.002989714021608139, "phrase": "data_types"}, {"score": 0.002839812512030847, "phrase": "experiment_data"}, {"score": 0.002787181295054319, "phrase": "chinese_university"}, {"score": 0.0023996890513009743, "phrase": "traditional_retrieval"}, {"score": 0.0021049977753042253, "phrase": "detailed_relationships"}], "paper_keywords": ["Ontology", " Author keyword", " Co-occurrence analysis", " Coupling analysis", " Semantic information retrieval"], "paper_abstract": "Purpose - The paper aims to develop a new method for potential relations retrieval. It aims to find common aspects between co-occurrence analysis and ontology to build a model of semantic information retrieval based on co-occurrence analysis. Design/methodology/approach - This paper used a literature review, co-occurrence analysis, ontology build and other methods to design a model and process of semantic information retrieval based on co-occurrence analysis. Archaeological data from Wuhan University Library's bibliographic retrieval systems was used for experimental analysis. Findings - The literature review found that semantic information retrieval research mainly concentrates on ontology-based query techniques, semantic annotation and semantic relation retrieval. Moreover most recent systems can only achieve obvious relations retrieval. Ontology and co-occurrence analysis have strong similarities in theoretical ideas, data types, expressions, and applications. Research limitations/implications - The experiment data came from a Chinese university which perhaps limits its usefulness elsewhere. Practical implications - This paper constructed a model to understand potential relations retrieval. An experiment proved the feasibility of co-occurrence analysis used in semantic information retrieval. Compared with traditional retrieval, semantic information retrieval based on co-occurrence analysis is more user-friendly. Originality/value - This study is one of the first to combine co-occurrence analysis with semantic information retrieval to find detailed relationships.", "paper_title": "Semantic information retrieval research based on co-occurrence analysis", "paper_id": "WOS:000330822300002"}