{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "wheelchair-based_rehabilitation"}, {"score": 0.048778468893892986, "phrase": "health_perception"}, {"score": 0.019555375432666205, "phrase": "physical_functions"}, {"score": 0.005209840995245155, "phrase": "physical_function"}, {"score": 0.0046328364646343375, "phrase": "stroke_patients"}, {"score": 0.004126623209579942, "phrase": "blood_lipids"}, {"score": 0.00327356326590461, "phrase": "physical_fitness"}, {"score": 0.0031495640320537252, "phrase": "grip_strength"}, {"score": 0.0031150035760241705, "phrase": "lower-body_muscular_endurance"}, {"score": 0.003030247482854539, "phrase": "posture_control"}, {"score": 0.0028360962841331634, "phrase": "physical_and_mental_health"}, {"score": 0.002610760187858779, "phrase": "positive_effect"}, {"score": 0.002497976173193543, "phrase": "stroke_duration"}, {"score": 0.0021049977753042253, "phrase": "chronic_stroke_patients"}], "paper_keywords": ["Stroke", " Duration of stroke", " Wheelchair-based rehabilitation", " Physical function", " Health perception"], "paper_abstract": "The purpose of this study was to investigate the effect of wheelchair-based rehabilitation on the physical functions, health perception, and blood lipids according to the length of time since the stroke. Wheelchair-based rehabilitation progressed for 60 min per session, five times per week for 6 weeks. Physical functions, health perception (SF-36), and blood lipids were measured before and after rehabilitation. Physical fitness for physical function such as agility, grip strength, lower-body muscular endurance, flexibility, and posture control significantly improved after 6 weeks of rehabilitation. Health perception improved significantly with physical and mental health according to time since the stroke occurred. Overall, 6 weeks of wheelchair-based rehabilitation had a positive effect on the physical function and health perception regardless of stroke duration. Wheelchair-based rehabilitation had a more positive effect on the physical functions and health perception on the patients who suffered their stroke most recently. We suggested that wheelchair-based rehabilitation is necessary even through wheelchair based for chronic stroke patients, and it was useful their improved of quality of life.", "paper_title": "Effects of wheelchair-based rehabilitation on the physical functions and health perception of stroke patients", "paper_id": "WOS:000324878400007"}