{"auto_keywords": [{"score": 0.04740278087049749, "phrase": "arya_et_al"}, {"score": 0.008457507366694489, "phrase": "euclidean"}, {"score": 0.004375235319787951, "phrase": "constant_degree"}, {"score": 0.004063547375196532, "phrase": "n-point_constant-dimensional_euclidean_spaces"}, {"score": 0.003868142906199082, "phrase": "logarithmic_factor"}, {"score": 0.0035435867326548665, "phrase": "euclidean_spanners"}, {"score": 0.0034102660898135155, "phrase": "lower_bounds_front"}, {"score": 0.003228434077467506, "phrase": "lower_bound"}, {"score": 0.003089956117689503, "phrase": "agarwal"}, {"score": 0.002981808717396183, "phrase": "long-standing_conjecture"}, {"score": 0.0028932554846476718, "phrase": "spanner_construction"}, {"score": 0.0028150302583265655, "phrase": "running_time"}, {"score": 0.00273141641397918, "phrase": "optimal_weight"}, {"score": 0.00239460114991662, "phrase": "constant-dimensional_euclidean_spaces"}, {"score": 0.0023107372754933887, "phrase": "general_trade-off"}, {"score": 0.0022482261385133617, "phrase": "entire_range"}], "paper_keywords": ["Algorithms", " Theory", " Doubling metrics", " Euclidean spaces", " Euclidean spanners"], "paper_abstract": "The degree, the (hop-) diameter, and the weight are the most basic and well-studied parameters of geometric spanners. In a seminal STOC '95 paper, titled \"Euclidean spanners: short, thin and lanky\", Arya et al. [1995] devised a construction of Euclidean (1+epsilon)-spanners that achieves constant degree, diameter O(log n), weight O(log(2) n).omega(MST), and has running time O(n . log n). This construction applies to n-point constant-dimensional Euclidean spaces. Moreover, Arya et al. conjectured that the weight bound can be improved by a logarithmic factor, without increasing the degree and the diameter of the spanner, and within the same running time. This conjecture of Arya et al. became one of the most central open problems in the area of Euclidean spanners. Nevertheless, the only progress since 1995 towards its resolution was achieved in the lower bounds front: Any spanner with diameter O(log n) must incur weight Omega(log n) . omega(MST), and this lower bound holds regardless of the stretch or the degree of the spanner [Dinitz et al. 2008; Agarwal et al. 2005]. In this article we resolve the long-standing conjecture of Arya et al. in the affirmative. We present a spanner construction with the same stretch, degree, diameter, and running time, as in Arya et al.'s result, but with optimal weight O(log n) . omega(MST). So our spanners are as thin and lanky as those of Arya et al., but they are really short! Moreover, our result is more general in three ways. First, we demonstrate that the conjecture holds true not only in constant-dimensional Euclidean spaces, but also in doubling metrics. Second, we provide a general trade-off between the three involved parameters, which is tight in the entire range. Third, we devise a transformation that decreases the lightness of spanners in general metrics, while keeping all their other parameters in check. Our main result is obtained as a corollary of this transformation.", "paper_title": "Optimal Euclidean Spanners: Really Short, Thin, and Lanky", "paper_id": "WOS:000364039500004"}