{"auto_keywords": [{"score": 0.008134436468072147, "phrase": "gpcr_data_classification"}, {"score": 0.005047018225744329, "phrase": "back-propagation_neural_network"}, {"score": 0.00481495049065317, "phrase": "protein_sequence_data"}, {"score": 0.004692980391580608, "phrase": "current_genome_research"}, {"score": 0.004458189822972851, "phrase": "new_protein_classification"}, {"score": 0.004256896523666554, "phrase": "gpcr"}, {"score": 0.004174101795674549, "phrase": "classification_processing_time"}, {"score": 0.003961613484271729, "phrase": "optimal_classifier_system"}, {"score": 0.003921129887153952, "phrase": "protein_sequence_data_classification"}, {"score": 0.0036678472439508484, "phrase": "classification_success_rate"}, {"score": 0.003556514118982869, "phrase": "svm."}, {"score": 0.0035201528214608914, "phrase": "experimental_result"}, {"score": 0.003361069456060196, "phrase": "classa_group"}, {"score": 0.0032423089921154503, "phrase": "others_group"}, {"score": 0.00265328343325303, "phrase": "svm"}, {"score": 0.0026126405272417783, "phrase": "optimal_clustering_rate"}, {"score": 0.0021049977753042253, "phrase": "low_processing_cost"}], "paper_keywords": [""], "paper_abstract": "Protein sequence data have been revealed in current genome research and have been noticed in demand of classifier for new protein classification. This paper proposes the optimal clustering-based ART1 classifier for the GPCR data classification and processes the GPCR data classification. We focuses on a demand of optimal classifier system for protein sequence data classification. The optimal clustering-based ART1 classifier reduces processing cost for classification effectively. We compare classification success rate to those of Back-propagation Neural Network and SVM. In experimental result of the optimal clustering-based ART1 classifier, classification success rate of ClassA group is 99.7% and that of the others group is 96.6%. This result demonstrates that the optimal clustering-based ART1 classifier is useful to the GPCR data classification. The classification processing time of the optimal clustering-based ART1 classifier is the 27% less than that of the Back-propagation Neural Network and is the 39% less than that of the SVM in an optimal clustering rate which is 15%. And the classification processing time of the optimal clustering-based ART1 classifier is the 39% less than that of the optimal clustering-based ART1 classifier in a prediction success rate which is 96%. This result demonstrates that the optimal clustering-based ART1 classifier provides the high performance classification and the low processing cost in the GPCR data classification.", "paper_title": "Optimal clustering-based ART1 classification in bioinformatics: G-protein coupled receptors classification", "paper_id": "WOS:000241891600080"}