{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "multiple_vehicles"}, {"score": 0.00475382761232911, "phrase": "bidirectional_communication_constraints"}, {"score": 0.0043842558719324526, "phrase": "required_speeds"}, {"score": 0.004201381218977942, "phrase": "desired_formation_pattern"}, {"score": 0.004008981656795115, "phrase": "practical_applications"}, {"score": 0.003941215575554871, "phrase": "underwater_robots"}, {"score": 0.003776750773624222, "phrase": "unified_framework"}, {"score": 0.003760685138103153, "phrase": "previous_results_obtained_by_the_authors_for_wheeled_robots_and_fully_actuated_underwater_vehicles"}, {"score": 0.0031981188104809994, "phrase": "inter-vehicle_bi-directional_communications_network"}, {"score": 0.0030908254851076005, "phrase": "lyapunov-based_techniques_and_graph_theory"}, {"score": 0.0029491324941225356, "phrase": "inter-vehicle_coordination"}, {"score": 0.0026620655619396263, "phrase": "conveniently_defined_generalized_error_vector"}, {"score": 0.002617007341172262, "phrase": "vehicle_coordination"}, {"score": 0.00235213013487844, "phrase": "neighboring_vehicles"}, {"score": 0.0022926465161639633, "phrase": "communications_topology"}, {"score": 0.0022251433045184454, "phrase": "problem_formulation"}, {"score": 0.002159623311924437, "phrase": "dynamics_models"}, {"score": 0.002132135985573126, "phrase": "wheeled_robot"}, {"score": 0.0021049977753042253, "phrase": "underwater_vehicle"}], "paper_keywords": [""], "paper_abstract": "The paper addresses the problem of making a set of vehicles follow a a set of given spatial paths at required speeds, while ensuring that they reach and maintain a desired formation pattern. Problems of this kind arise in a number of practical applications involving ground and underwater robots. The paper summarizes and brings together in a unified framework previous results obtained by the authors for wheeled robots and fully actuated underwater vehicles. The decentralized solution proposed does not require the concept of a leader and applies to a very general class of paths. Furthermore, it addresses explicitly the dynamics of the vehicles and the constraints imposed by the inter-vehicle bi-directional communications network. The theoretical machinery used brings together Lyapunov-based techniques and graph theory. With the set-up proposed, path following (in space) and inter-vehicle coordination (in time) can be viewed as essentially decoupled. Path following for each vehicle is formulated in terms of driving a conveniently defined generalized error vector to zero; vehicle coordination is achieved by adjusting the speed of each vehicle along its particular path, based on information on the position and speed of a number of neighboring vehicles, as determined by the communications topology adopted. The paper presents the problem formulation and summarizes its solution. Simulations with dynamics models of a wheeled robot and an underwater vehicle illustrate the efficacy of the solution proposed.", "paper_title": "Coordinated path following control of multiple vehicles subject to bidirectional communication constraints", "paper_id": "WOS:000241002300006"}