{"auto_keywords": [{"score": 0.048923016754706915, "phrase": "cambodia"}, {"score": 0.01571971737252393, "phrase": "asean"}, {"score": 0.014408672466680882, "phrase": "e-government_adoption"}, {"score": 0.005956864592788076, "phrase": "research_model"}, {"score": 0.004652963867892925, "phrase": "purpose_-_the_purpose"}, {"score": 0.0041174821422410544, "phrase": "technology_acceptance_model"}, {"score": 0.004077398881173239, "phrase": "tam"}, {"score": 0.0035553221885904467, "phrase": "empirical_study"}, {"score": 0.0032079813320482304, "phrase": "multiple_regression_analyses"}, {"score": 0.0027159094186967247, "phrase": "important_determinants"}, {"score": 0.002689430273401131, "phrase": "perceived_usefulness"}, {"score": 0.0026372419109713923, "phrase": "output_quality"}, {"score": 0.002523481637809674, "phrase": "government_policy_decision_makers_design"}, {"score": 0.002391067964886602, "phrase": "e-government_services"}, {"score": 0.0022107428653358715, "phrase": "similar_situation"}], "paper_keywords": ["Cambodia", " Innovation", " Government", " Trust"], "paper_abstract": "Purpose - The purpose of this paper is to examine the factors that influence e-government adoption in Cambodia as one of the Association of Southeast Asian Nations (ASEAN) member states. Design/methodology/approach - This study uses the technology acceptance model (TAM), the extended TAM (TAM2), the diffusion of innovations (DOI) theory, and trust to build a parsimonious yet comprehensive model of user adoption of e-government. The authors test the model with an empirical study. Data are collected from a total of 112 public officers in 12 ministries in Cambodia. The research model is then assessed with multiple regression analyses. Findings - The findings in this study show that the determinants of the research model (perceived usefulness, relative advantage, and trust) are support. At the same time, the important determinants of perceived usefulness include image and output quality. Practical implications - The study would help government policy decision makers design and implement policies and strategies to increase the adoption of e-government services in Cambodia as well as in other countries, particularly ASEAN member states that have a similar situation. Originality/value - This paper is one of a few studies on e-government adoption in ASEAN and the first study on e-government adoption in Cambodia.", "paper_title": "E-government adoption in ASEAN: the case of Cambodia", "paper_id": "WOS:000272529200005"}