{"auto_keywords": [{"score": 0.015479200759850795, "phrase": "fuzzy_cognitive_maps"}, {"score": 0.004407813106104401, "phrase": "increased_complexity"}, {"score": 0.004272456401437226, "phrase": "project_failure"}, {"score": 0.0034700069041302003, "phrase": "important_factors"}, {"score": 0.0029530125680590413, "phrase": "new_methodology"}, {"score": 0.002702887319160532, "phrase": "mapping_success"}, {"score": 0.0025128602296275037, "phrase": "fcm"}, {"score": 0.002372935208038141, "phrase": "fcm_methodology"}, {"score": 0.002311933249234786, "phrase": "case_study"}, {"score": 0.0022642601698943687, "phrase": "new_project_idea"}, {"score": 0.0021945833590668973, "phrase": "fast_evolving_world"}, {"score": 0.002171836484200008, "phrase": "mobile_telecommunications"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["fuzzy cognitive maps", " Critical Success Factors", " IT projects", " Mobile Payment System", " Telecommunications"], "paper_abstract": "IT projects have certain features that make them different from other engineering projects. These include increased complexity and higher. chances of project failure. To increase the chances of an IT project to be perceived as successful by all the parties involved in the project from its conception, development and implementation, it is necessary to identify at the outset of the project what the important factors influencing that success are. Current methodologies and tools used for identifying, classifying and evaluating the indicators of success in IT projects have several limitations that can be overcome by employing the new methodology presented in this paper. This methodology is based on using Fuzzy Cognitive Maps (FCMs) for mapping success, modelling Critical Success Factors (CSFs) perceptions and the relations between them. This is an area where FCM has never been applied before. The applicability of the FCM methodology is demonstrated through a case study based on a new project idea, the Mobile Payment System (MPS) project, related to the fast evolving world of mobile telecommunications. (C) 2006 Elsevier Ltd. All rights reserved.", "paper_title": "Modelling IT projects success with fuzzy cognitive maps", "paper_id": "WOS:000242979100029"}