{"auto_keywords": [{"score": 0.04217768298620094, "phrase": "center_dot_oh_addition"}, {"score": 0.035351318511886894, "phrase": "steric_hindrance"}, {"score": 0.00481495049065317, "phrase": "oh-initiated_degradation_mechanisms"}, {"score": 0.004659108142668152, "phrase": "oh-initiated_reaction_mechanisms"}, {"score": 0.004378309349451268, "phrase": "center_dot_oh_attacks"}, {"score": 0.003866268750750096, "phrase": "benzene_ring"}, {"score": 0.0038240605592708083, "phrase": "side_group"}, {"score": 0.0037684961730030235, "phrase": "lowest_energy_barrier"}, {"score": 0.0035671997165370403, "phrase": "side_chain"}, {"score": 0.0031039212233596415, "phrase": "five_herbicides"}, {"score": 0.0030700099570048346, "phrase": "activation_energy"}, {"score": 0.002970476379751357, "phrase": "dcpp_reaction"}, {"score": 0.002710557619357275, "phrase": "highest_energy_barriers"}, {"score": 0.0025098414374397308, "phrase": "h-atom_abstraction_reactions"}, {"score": 0.0024462867877027435, "phrase": "h_atoms"}, {"score": 0.0023582694348219233, "phrase": "center_dot_oh"}, {"score": 0.002298544073884724, "phrase": "dcpp"}, {"score": 0.002281759243507806, "phrase": "mcpp"}, {"score": 0.0021049977753042253, "phrase": "pcm_calculations"}], "paper_keywords": ["Chlorophenoxy herbicides", " OH radicals", " Reaction mechanisms", " Comparison"], "paper_abstract": "To compare the OH-initiated reaction mechanisms of five chlorophenoxy herbicides, density functional theory (DFT) calculations of reactions in which center dot OH attacks one of three active positions on each herbicide were carried out at the MPWB1K/6-311 + G(3df,2p)//MPWB1K/6-31 + G(d,p) level. For each herbicide, the calculation results show that center dot OH addition to the C1 atom, which is the nexus between the benzene ring and the side group, possesses the lowest energy barrier among the three kinds of reactions, indicating that center dot OH addition-substitution of the side chain is the most energetically and kinetically favorable reaction mechanism. Comparisons among the herbicides show that the mechanisms are affected by the steric hindrance and the electronegativities of the -CH3 and -Cl groups. When comparing the addition of center dot OH to the C1 site among the five herbicides, the activation energy for the reaction of center dot OH with DCPP reaction is the lowest (3.61 kcal mol(-1)), while that for the center dot OH and 4-CPA reaction was the highest (5.91 kcal mol(-1)). center dot OH addition to the C4 site presents the highest energy barriers among the three kinds of reactions, indicating that the para Cl is difficult to break down. When comparing the H-atom abstraction reactions of the five herbicides, the H atoms in the -CH2- group of 2,4-D are the easiest for center dot OH to abstract, whereas those of DCPP and MCPP are more difficult to abstract, due to the steric hindrance of the -CH3 group. Additionally, the results obtained from the PCM calculations reveal that most of the reactions occur more easily in water than in gas, though the mechanisms involved are the same as those discussed above.", "paper_title": "DFT comparison of the OH-initiated degradation mechanisms for five chlorophenoxy herbicides", "paper_id": "WOS:000319362500010"}