{"auto_keywords": [{"score": 0.04920608861184247, "phrase": "bridges"}, {"score": 0.0490101212371796, "phrase": "konigsberg"}, {"score": 0.01571986947018097, "phrase": "eulerian"}, {"score": 0.014412355023399914, "phrase": "euler"}, {"score": 0.012005361434161163, "phrase": "lithuania"}, {"score": 0.009958072620854831, "phrase": "present-day_kaliningrad"}, {"score": 0.009031241681389917, "phrase": "eulerian_walk"}, {"score": 0.004756233569671719, "phrase": "eighteenth-century_problem"}, {"score": 0.004593710711624633, "phrase": "swiss_mathematician"}, {"score": 0.0045843245695654875, "phrase": "leonhard_euler"}, {"score": 0.00447316895126645, "phrase": "senior_chair_of_mathematics"}, {"score": 0.00444580185613201, "phrase": "st._petersburg_academy"}, {"score": 0.0041301149938407465, "phrase": "contemporary_konigsberg"}, {"score": 0.0040547496974956835, "phrase": "potsdam"}, {"score": 0.003972607172518598, "phrase": "world_war_ii"}, {"score": 0.003884168049408335, "phrase": "kaliningrad"}, {"score": 0.0037360045780015804, "phrase": "present-day_russian_federation"}, {"score": 0.0037055370870874484, "phrase": "mainland_russia"}, {"score": 0.0036828490322684923, "phrase": "newly_independent_republic"}, {"score": 0.0035568985607817034, "phrase": "poland"}, {"score": 0.003237116128682586, "phrase": "foreign_enclave"}, {"score": 0.0031845067058084583, "phrase": "intriguing_and_unique_area"}, {"score": 0.0030818310926031024, "phrase": "current_situation"}, {"score": 0.0030504268655154043, "phrase": "eulerian_walks"}, {"score": 0.0027989184226250444, "phrase": "precisely_what"}, {"score": 0.002776071668629132, "phrase": "euler's_time"}, {"score": 0.0026536987659903323, "phrase": "original_seven_bridges"}, {"score": 0.0025945450101602825, "phrase": "careful_examination"}, {"score": 0.002449839292715327, "phrase": "present_millennium_-_an_eulerian_walk"}, {"score": 0.0021707445247264564, "phrase": "conventional_graph-theoretical_equivalent"}, {"score": 0.0021618612753492453, "phrase": "euler's_original_algorithm"}, {"score": 0.0021398115287338693, "phrase": "specific_eulerian_walk"}, {"score": 0.0021049977753042253, "phrase": "pawel_skrzynski"}], "paper_keywords": [""], "paper_abstract": "The eighteenth-century problem of the Bridges of Konigsberg was solved in a memoir dated 1736 and written by the Swiss mathematician Leonhard Euler (1707-1783) soon after he had been appointed to the senior Chair of Mathematics at the St. Petersburg Academy of Sciences. Euler demonstrated that what is now called an Eulerian Walk (that is, a route that traverses all of the bridges once, and once only) was not possible in contemporary Konigsberg. Soon after the Conferences of Yalta and Potsdam had assigned the city and its environs to the Soviet Union after World War II, Konigsberg came to be known as the city of Kaliningrad, capital of the Kaliningrad Oblast, which, since the early 1990s, has found itself as an exclave of the present-day Russian Federation, isolated from mainland Russia by the newly independent republic of Lithuania (and, beyond that, Latvia and Belarus). Furthermore, the Kaliningrad Oblast's only other adjoining neighbour is Poland which, like Lithuania, has been a Member of the European Union since 1 May 2004. This state of affairs thus determines that the Kaliningrad Oblast is, these days, doubly anomalous, in that it is not only an exclave of the Russian Federation but (simultaneously) it is also a foreign enclave within the European Union. It was into this intriguing and unique area that the author recently ventured (in February, 2006) in order to investigate what the current situation is with regard to Eulerian Walks in present-day Kaliningrad, precisely 270 years after Euler considered the problem as it applied to the Konigsberg of 1736. This paper evaluates how the disposition of the Bridges has varied over the years. Until 1876, the configuration of the Bridges was precisely what it was in Euler's time, and an Eulerian Walk was thus still not feasible (though it was after the mid-1870s). By the 1930s the original seven Bridges had increased in number to nine or ten, and careful examination shows that an Eulerian Walk was, at that time, also still possible. It is demonstrated that, only a few years ago - at the beginning of the present millennium - an Eulerian Walk was again not feasible. In fact, though, thanks to the rebuilding (in 2005) of the (1905) Kaiserbrucke - which was reconstructed in order to commemorate the 750th anniversary of the founding of the city in 1255 - an Eulerian Walk is once again now possible in present-day Kaliningrad. This claim is demonstrated both by use of the conventional Graph-Theoretical equivalent of Euler's original algorithm and by describing the specific Eulerian Walk that the author (and his travelling companion, Pawel Skrzynski) actually executed in practice, on Sunday, 26 February 2006.", "paper_title": "The six (or seven) bridges of kaliningrad: a personal Eulerian Walk, 2006", "paper_id": "WOS:000250127000001"}