{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "molecular_dynamics"}, {"score": 0.004760765880314089, "phrase": "docking_calculations"}, {"score": 0.004654210559456924, "phrase": "binding_mode"}, {"score": 0.004275347843870176, "phrase": "important_target"}, {"score": 0.004156012879026324, "phrase": "new_pharmaceuticals"}, {"score": 0.004086010164600727, "phrase": "multidrug_therapy"}, {"score": 0.003949508242904001, "phrase": "polyanionic_compounds"}, {"score": 0.0035869274480340727, "phrase": "early_stages"}, {"score": 0.0030955250132409964, "phrase": "cell_surface"}, {"score": 0.0028919522313933525, "phrase": "molecular_modeling_investigations"}, {"score": 0.002671263324230699, "phrase": "experimental_data"}, {"score": 0.0026411384812121503, "phrase": "computer_simulations"}, {"score": 0.0025097154697345096, "phrase": "preferential_binding_site"}, {"score": 0.0022919762167777427, "phrase": "stereoelectronic_properties"}, {"score": 0.002202742267484358, "phrase": "marked_drop"}], "paper_keywords": [""], "paper_abstract": "The HIV-1 entry process is an important target for the design of new pharmaceuticals for the multidrug therapy of AIDS. A lot of polyanionic compounds, such as polysulfonated and polysulfated, are reported in the literature for their ability to block early stages of HIV-1 replication. Several studies have been performed to elucidate the mechanism of the anti-HIV-1 activity of sulfated polysaccharides and polyanions in general, including binding to cell surface CD4 and interfering with the gp120-coreceptor interaction. Here, we show molecular modeling investigations on ADS-J1, a polyanionic compound with anti-HIV activity that is able to interfere with gp120-coreceptor interactions. Agreeing with experimental data, computer simulations suggested that the V3 loop of gp120 was the preferential binding site for ADS-J1 onto HIV-1. Moreover, mutations induced by the inhibitor significantly changed the stereoelectronic properties of the gp120 surface, justifying a marked drop in the affinity of ADS-J1 toward an ADS-J1-resistant HIV-1 strain.", "paper_title": "A combination of molecular dynamics and docking calculations to explore the binding mode of ADS-J1, a polyanionic compound endowed with anti-HIV-1 activity", "paper_id": "WOS:000237658400044"}