{"auto_keywords": [{"score": 0.03140313232410155, "phrase": "oblivious_relay"}, {"score": 0.01322647167447618, "phrase": "capacity_region"}, {"score": 0.010612387000973441, "phrase": "multiuser_networks"}, {"score": 0.007113219050095116, "phrase": "marc"}, {"score": 0.006464287258744298, "phrase": "new_outerbound"}, {"score": 0.005955115970142397, "phrase": "gcf_scheme"}, {"score": 0.004706305193222972, "phrase": "codebook_information"}, {"score": 0.004029517895918228, "phrase": "particular_interest"}, {"score": 0.0037626342268042997, "phrase": "transmitted_messages"}, {"score": 0.003611034322786669, "phrase": "relay-to-destination_links"}, {"score": 0.003433987036569199, "phrase": "finite_capacity"}, {"score": 0.0026461081515494144, "phrase": "ifrc"}, {"score": 0.0025744696954056404, "phrase": "new_strong_interference_condition"}, {"score": 0.0022136780933978612, "phrase": "m-user_marc"}, {"score": 0.0021049977753042253, "phrase": "k_destinations"}], "paper_keywords": ["Oblivious relay", " generalized compress and forward", " capacity", " interference relay channel", " multiple access relay channel"], "paper_abstract": "This paper considers relay assisted transmission for multiuser networks when the relay has no access to the codebooks used by the transmitters. The relay is called oblivious for this reason. Of particular interest is the generalized compress-and-forward (GCF) strategy, where the destinations jointly decode the compression indices and the transmitted messages, and their optimality in this setting. The relay-to-destination links are assumed to be out-of-band with finite capacity. Two models are investigated: 1) the multiple access relay channel (MARC) and 2) the interference relay channel (IFRC). For the MARC with an oblivious relay, a new outerbound is derived and it is shown to be tight by means of achievability of the capacity region using GCF scheme. For the IFRC with an oblivious relay, a new strong interference condition is established, under which the capacity region is found by deriving a new outerbound and showing that it is achievable using GCF scheme. The result is further extended to establish the capacity region of M-user MARC with an oblivious relay, and multicast networks containing M sources and K destinations with an oblivious relay.", "paper_title": "Relaying for Multiuser Networks in the Absence of Codebook Information", "paper_id": "WOS:000350160400008"}