{"auto_keywords": [{"score": 0.04759132288543126, "phrase": "transposable_elements"}, {"score": 0.00481495049065317, "phrase": "repeated_dna_sequences"}, {"score": 0.00439777299939725, "phrase": "repeated_elements"}, {"score": 0.0042820680211904235, "phrase": "fascinating_domain"}, {"score": 0.004147216579100177, "phrase": "relevant_tools"}, {"score": 0.003727527379253624, "phrase": "main_mechanism"}, {"score": 0.0035527409334589317, "phrase": "essential_component"}, {"score": 0.0035150223642728437, "phrase": "genome_evolution"}, {"score": 0.0033680968918579717, "phrase": "new_concept"}, {"score": 0.0031422859551159506, "phrase": "different_copies"}, {"score": 0.002994859407965545, "phrase": "terminus-defined_family"}, {"score": 0.0029630871188728474, "phrase": "tes"}, {"score": 0.002431699464104896, "phrase": "method_results"}, {"score": 0.002393034183276193, "phrase": "graphical_view"}], "paper_keywords": [""], "paper_abstract": "Motivation: The analysis of repeated elements in genomes is a fascinating domain of research that is lacking relevant tools for transposable elements (TEs), the most complex ones. The dynamics of TEs, which provides the main mechanism of mutation in some genomes, is an essential component of genome evolution. In this study we introduce a new concept of domain, a segmentation unit useful for describing the architecture of different copies of TEs. Our method extracts occurrences of a terminus-defined family of TEs, aligns the sequences, finds the domains in the alignment and searches the distribution of each domain in sequences. After a classification step relative to the presence or the absence of domains, the method results in a graphical view of sequences segmented into domains. Results: Analysis of the new non-autonomous TE AtREP21 in the model plant Arabidopsis thaliana reveals copies of very different sizes and various combinations of domains which show the potential of our method.", "paper_title": "Domain organization within repeated DNA sequences: application to the study of a family of transposable elements", "paper_id": "WOS:000239900200004"}