{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "ict_use"}, {"score": 0.004765482708043842, "phrase": "purpose_-_the_purpose"}, {"score": 0.00450231514359539, "phrase": "retail_customers"}, {"score": 0.003916098498242888, "phrase": "resulting_segments"}, {"score": 0.0033883824438527316, "phrase": "store's_information"}, {"score": 0.003353521531649663, "phrase": "communication_technology"}, {"score": 0.0031193028729331667, "phrase": "retailer-consumer_relationship"}, {"score": 0.0030396665931462, "phrase": "customer_segments"}, {"score": 0.0029620573986902416, "phrase": "retailers'_payment_facilities"}, {"score": 0.0027126684113045756, "phrase": "efficient_decisions"}, {"score": 0.0026297428083782875, "phrase": "effective_marketing_strategies"}, {"score": 0.0025361866386341796, "phrase": "interorganizational_relationships"}, {"score": 0.002420762293555924, "phrase": "great_extent"}, {"score": 0.0023958326775913165, "phrase": "supplier_investment"}, {"score": 0.0021049977753042253, "phrase": "retailers'_ict_solutions"}], "paper_keywords": ["Communication technologies", " Market segmentation", " Retailing"], "paper_abstract": "Purpose - The purpose of this paper is to determine and characterize groups of retail customers, based on their perception of commitment to the retailer and the degree of use of its technological equipment. Design/methodology/approach - A CRAB) algorithm is performed and differences between the resulting segments are tested through the analysis of variance. Findings - Four segments are obtained that differ significantly in commitment to the retailer and level of use of the store's information and communication technology (ICT) facilities, as well as in other variables related to the retailer-consumer relationship. In particular, customer segments differ in their use of retailers' payment facilities. Practical implications - The study provides a typology of consumers that enable retailers to take efficient decisions regarding their technology investments and to design effective marketing strategies. Originality/value - Although literature concerning interorganizational relationships has reported that commitment is influenced to a great extent by supplier investment in technology, the relation between these variables in retailing has received little attention. The paper explores the relationship between commitment and use of retailers' ICT solutions for retail customers.", "paper_title": "Customer segmentation based on commitment and ICT use", "paper_id": "WOS:000264971100012"}