{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "emergency_management"}, {"score": 0.004737579882204798, "phrase": "enduring_characteristic"}, {"score": 0.004561826854638056, "phrase": "near-simultaneous_development"}, {"score": 0.004464326432401002, "phrase": "new_management_procedures"}, {"score": 0.004229556887896042, "phrase": "highly_novel_problems"}, {"score": 0.003985487777785535, "phrase": "extensive_planning"}, {"score": 0.0037554497046697432, "phrase": "decision_makers"}, {"score": 0.003519561814102764, "phrase": "cognitive_processes"}, {"score": 0.003193129886123359, "phrase": "improvised_action"}, {"score": 0.0024628046987344846, "phrase": "cognitive_model"}, {"score": 0.0024231382864800173, "phrase": "model's_implementation"}, {"score": 0.0023970487263732737, "phrase": "computer-executable_code"}, {"score": 0.002234165013865669, "phrase": "emergency_situation"}, {"score": 0.0021049977753042253, "phrase": "future_research"}], "paper_keywords": ["cognitive science", " decision making"], "paper_abstract": "An enduring characteristic of emergencies is the need for near-simultaneous development and deployment of new management procedures. This need can arise with the onset of highly novel problems and the need to act quickly-factors that reduce opportunities for extensive planning in managing the emergency., As a result, decision makers in emergencies must be prepared to improvise. By understanding the cognitive processes in improvisation, organizations can better learn how to plan for, manage, and learn from improvised action. To help create this understanding, this paper reviews and synthesizes prior results on improvisation in the art of jazz, exploring how these results may be applied to improvisation in emergency management. A theory of improvisation in emergency management is then developed and expressed as a cognitive model. The model's implementation in computer-executable code is then reviewed, along with an illustration of how the model improvises in an emergency situation. Finally, implications of this model and opportunities for future research are presented.", "paper_title": "A cognitive model of improvisation in emergency management", "paper_id": "WOS:000247390500009"}