{"auto_keywords": [{"score": 0.04967913398382337, "phrase": "cadd"}, {"score": 0.038386660893255306, "phrase": "web_interface"}, {"score": 0.03157920815457733, "phrase": "idrug"}, {"score": 0.00481495049065317, "phrase": "computer-aided_drug_design"}, {"score": 0.004617187934074393, "phrase": "early-stage_pharmaceutical_research"}, {"score": 0.004122699822340296, "phrase": "similarity_calculation"}, {"score": 0.00403709306806495, "phrase": "target_identification"}, {"score": 0.003619672388007568, "phrase": "binding_sites_detection"}, {"score": 0.003589404014552974, "phrase": "virtual_screening"}, {"score": 0.0034418037573506837, "phrase": "interactive_manner"}, {"score": 0.003398714712611042, "phrase": "seamless_interface"}, {"score": 0.0033561632967173856, "phrase": "adapted_packages"}, {"score": 0.00323166859966514, "phrase": "pharmmapper"}, {"score": 0.0030857431184193765, "phrase": "well-annotated_pharmacophore_database"}, {"score": 0.0027317585060414253, "phrase": "functional_modules"}, {"score": 0.00267495669519805, "phrase": "featured_session_files"}, {"score": 0.002575665611013556, "phrase": "local_disk"}, {"score": 0.0024904974828343033, "phrase": "history_work"}, {"score": 0.0022800613046444563, "phrase": "drug_design_experiments"}, {"score": 0.0021049977753042253, "phrase": "standalone_modeling_softwares"}], "paper_keywords": ["Online drug design platform", " Cavity detection", " Pharmacophore search", " 3D similarity calculation", " Target prediction"], "paper_abstract": "Background: The progress in computer-aided drug design (CADD) approaches over the past decades accelerated the early-stage pharmaceutical research. Many powerful standalone tools for CADD have been developed in academia. As programs are developed by various research groups, a consistent user-friendly online graphical working environment, combining computational techniques such as pharmacophore mapping, similarity calculation, scoring, and target identification is needed. Results: We presented a versatile, user-friendly, and efficient online tool for computer-aided drug design based on pharmacophore and 3D molecular similarity searching. The web interface enables binding sites detection, virtual screening hits identification, and drug targets prediction in an interactive manner through a seamless interface to all adapted packages (e. g., Cavity, PocketV.2, PharmMapper, SHAFTS). Several commercially available compound databases for hit identification and a well-annotated pharmacophore database for drug targets prediction were integrated in iDrug as well. The web interface provides tools for real-time molecular building/editing, converting, displaying, and analyzing. All the customized configurations of the functional modules can be accessed through featured session files provided, which can be saved to the local disk and uploaded to resume or update the history work. Conclusions: iDrug is easy to use, and provides a novel, fast and reliable tool for conducting drug design experiments. By using iDrug, various molecular design processing tasks can be submitted and visualized simply in one browser without installing locally any standalone modeling softwares. iDrug is accessible free of charge at http://lilab.ecust.edu.cn/idrug.", "paper_title": "iDrug: a web-accessible and interactive drug discovery and design platform", "paper_id": "WOS:000336991700001"}