{"auto_keywords": [{"score": 0.036570551756537416, "phrase": "one's_spatial_knowledge"}, {"score": 0.0327762069050052, "phrase": "route_descriptions"}, {"score": 0.00481495049065317, "phrase": "adequate_route_description"}, {"score": 0.004701825207431857, "phrase": "spatial_knowledge"}, {"score": 0.0035551969986263553, "phrase": "effective_tool"}, {"score": 0.003513133457324989, "phrase": "bridging_gaps"}, {"score": 0.0032130703855586685, "phrase": "interactive_route_description"}, {"score": 0.002719644855867468, "phrase": "aforementioned_gap"}, {"score": 0.002593091742792519, "phrase": "additional_benefit"}, {"score": 0.002428617044669043, "phrase": "automatic_parsing"}, {"score": 0.0022077827041801193, "phrase": "automatic_transformation"}, {"score": 0.0021049977753042253, "phrase": "turn-by-turn_instructions"}], "paper_keywords": ["Route description", " Interactive cartography"], "paper_abstract": "Providing an adequate route description requires in-depth spatial knowledge of the route in question. In this article we demonstrate that despite having travelled a route recently and having much experience of the area in question, an individual may lack such a degree of knowledge. Previous research and experience informs us that a map is an effective tool for bridging gaps in one's spatial knowledge. In this article we propose an approach, known as an Interactive Route Description, for defining and interpreting route descriptions interactively with a map. This approach is based on the concept of annotating the map in question and allows the aforementioned gap in one's spatial knowledge to be bridged. An additional benefit of defining route descriptions in this way is that it facilitates automatic parsing and in turn offers many potential applications. One such application, illustrated in this paper, is the automatic transformation to other representations of the description such as turn-by-turn instructions.", "paper_title": "Interactive cartographic route descriptions", "paper_id": "WOS:000329643800001"}