{"auto_keywords": [{"score": 0.044330490798065565, "phrase": "better_alternative"}, {"score": 0.036052031961979245, "phrase": "social_network"}, {"score": 0.00481495049065317, "phrase": "social_networks"}, {"score": 0.0047113960612140335, "phrase": "popular_vote"}, {"score": 0.004008467832216946, "phrase": "large_numbers"}, {"score": 0.003971262520692664, "phrase": "plurality_vote"}, {"score": 0.0038737214010638745, "phrase": "correct_outcome"}, {"score": 0.003378385493203297, "phrase": "\"majority_dynamics"}, {"score": 0.0031062294139798273, "phrase": "population-wide_plurality_vote"}, {"score": 0.0030204580407008188, "phrase": "\"efficient_aggregation"}, {"score": 0.00281184118901173, "phrase": "growing_graphs"}, {"score": 0.0027426990589357937, "phrase": "wrong_alternative"}, {"score": 0.002577171858769087, "phrase": "efficient_aggregation"}, {"score": 0.002414082940963702, "phrase": "majority_dynamics"}, {"score": 0.002289631204915149, "phrase": "voters'_social_network"}, {"score": 0.0022683432490549064, "phrase": "expander_graph"}, {"score": 0.0022194361800930516, "phrase": "initial_population"}, {"score": 0.0021783541405925766, "phrase": "particular_alternative"}, {"score": 0.0021247560305587155, "phrase": "unanimous_preference"}, {"score": 0.0021049977753042253, "phrase": "entire_population"}], "paper_keywords": ["Social networks", " Aggregation of information", " Majority dynamics", " Discrete Fourier analysis"], "paper_abstract": "Consider individuals who, by popular vote, choose among alternatives, one of which is \"better\" than the others. Assume that each individual votes independently at random, and that the probability of voting for the better alternative is larger than the probability of voting for any other. It follows from the law of large numbers that a plurality vote among the individuals would result in the correct outcome, with probability approaching one exponentially quickly as . Our interest in this article is in a variant of the process above where, after forming their initial opinions, the voters update their decisions based on some interaction with their neighbors in a social network. Our main example is \"majority dynamics\", in which each voter adopts the most popular opinion among its friends. The interaction repeats for some number of rounds and is then followed by a population-wide plurality vote. The question we tackle is that of \"efficient aggregation of information\": in which cases is the better alternative chosen with probability approaching one as ? Conversely, for which sequences of growing graphs does aggregation fail, so that the wrong alternative gets chosen with probability bounded away from zero? We construct a family of examples in which interaction prevents efficient aggregation of information, and give a condition on the social network which ensures that aggregation occurs. For the case of majority dynamics we also investigate the question of unanimity in the limit. In particular, if the voters' social network is an expander graph, we show that if the initial population is sufficiently biased towards a particular alternative then that alternative will eventually become the unanimous preference of the entire population.", "paper_title": "Majority dynamics and aggregation of information in social networks", "paper_id": "WOS:000330773200003"}