{"auto_keywords": [{"score": 0.047317134097898006, "phrase": "mfn"}, {"score": 0.00481495049065317, "phrase": "quickest_path_reliability_evaluations"}, {"score": 0.004771196027464407, "phrase": "multi-state_flow_networks"}, {"score": 0.004435112270935294, "phrase": "net_flow"}, {"score": 0.00419861271409079, "phrase": "target_nodes"}, {"score": 0.0039027036493682887, "phrase": "quickest_path"}, {"score": 0.003449718244515019, "phrase": "sink_node"}, {"score": 0.0034027387694902287, "phrase": "single_special_minimal_path"}, {"score": 0.0027073229284666294, "phrase": "minimal_paths"}, {"score": 0.0025162511343171, "phrase": "proposed_depth-first-search"}, {"score": 0.0022136780933978612, "phrase": "algorithm's_computational_complexity"}, {"score": 0.0021049977753042253, "phrase": "known_algorithms"}], "paper_keywords": ["Network reliability", " minimal paths", " quickest paths", " multi-state flow network", " depth-first-search"], "paper_abstract": "Many real-world multi-state systems can be modeled as multistate flow networks (MFN) such that the net flow into and out of a node (excluding the source and target nodes) is equal to zero, e.g., distribution systems and supply chains. The quickest path (QP) reliability problem is to evaluate the probability, i.e., R-(d,R-t)-QP, that at least units of data can be sent from the source node to the sink node through a single special minimal path (MP) within units of time in an MFN. Such a special MP is called a (d, t)-QP here. In this study, a novel algorithm based on depth-first-search (DFS) is proposed to search for all (d, t)-QPs without solving two NP-hard problems: finding all minimal paths (MPs) in advance, and removing all infeasible (d, t)-QPs candidates. The correctness of the proposed Depth-First-Search (DFS)-based algorithm is proven, and an example is provided to illustrate the generation of all (d, t)-QPs. Furthermore, the analysis of the algorithm's computational complexity and computer experiments indicate that it is more efficient than known algorithms.", "paper_title": "A Fast Algorithm for Quickest Path Reliability Evaluations in Multi-State Flow Networks", "paper_id": "WOS:000366323500005"}