{"auto_keywords": [{"score": 0.03911486664931106, "phrase": "drop"}, {"score": 0.00481495049065317, "phrase": "future_internet_devices"}, {"score": 0.004750178261675602, "phrase": "network_infrastructures"}, {"score": 0.0039028497942174777, "phrase": "recent_extension"}, {"score": 0.0038242899532391914, "phrase": "open_source_software_framework"}, {"score": 0.00357362651129581, "phrase": "novel_distributed_paradigm"}, {"score": 0.003525493807130663, "phrase": "network_function"}, {"score": 0.0029959082125682918, "phrase": "flexible_ip_router_platforms"}, {"score": 0.0028569549040495163, "phrase": "increased_energy_efficiency"}, {"score": 0.002799388549023265, "phrase": "network_function_virtualization_paradigms"}, {"score": 0.002724428781940696, "phrase": "sophisticated_power_management_mechanisms"}, {"score": 0.0025630077791393125, "phrase": "green_abstraction_layer"}, {"score": 0.002330664671716791, "phrase": "drop_architecture"}, {"score": 0.002148315508445588, "phrase": "large_number"}], "paper_keywords": [""], "paper_abstract": "Future Internet devices and network infrastructures need to be significantly more energy-efficient, scalable, and flexible in order to realize the extremely virtualized and optimized ICT/network infrastructures. In this respect, this article presents a recent extension of an open source software framework, the Distributed Router Open Platform (DROP), to enable a novel distributed paradigm for network function virtualization through the integration of software defined network and information technology (IT) platforms, as well as for the control/management of flexible IP router platforms. To answer the need for increased energy efficiency of the network function virtualization paradigms, DROP includes sophisticated power management mechanisms, which are exposed by means of the green abstraction layer (GAL), under consideration for standardization in ETSI. Moreover, the DROP architecture has been specifically designed to act as \"glue\" among a large number of the most promising and well-known open source software projects, providing network data- or control-plane capabilities.", "paper_title": "DROPv2: Energy Efficiency through Network Function Virtualization", "paper_id": "WOS:000334740500005"}