{"auto_keywords": [{"score": 0.03432512093194368, "phrase": "agile_methodologies"}, {"score": 0.015719728052464327, "phrase": "cmmi"}, {"score": 0.015581708742228459, "phrase": "agile_software_development"}, {"score": 0.004591345494188032, "phrase": "maturity_levels"}, {"score": 0.004550585106483935, "phrase": "lightweight_processes"}, {"score": 0.004510184935928004, "phrase": "low_levels"}, {"score": 0.004391114318381004, "phrase": "software_development_organizations"}, {"score": 0.004137600338433322, "phrase": "capability_maturity_model_integration"}, {"score": 0.003565791062038201, "phrase": "systematic_literature_review"}, {"score": 0.0034101316738399203, "phrase": "search_strategy"}, {"score": 0.0030454408569868347, "phrase": "development_process"}, {"score": 0.002399850604120431, "phrase": "agile_practices"}, {"score": 0.0021622120805979937, "phrase": "additional_practices"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Software process improvement", " CMMI", " Agile methodology", " Benefits", " Limitations", " Systematic review"], "paper_abstract": "Background: The search for adherence to maturity levels by using lightweight processes that require low levels of effort is regarded as a challenge for software development organizations. Objective: This study seeks to evaluate, synthesize, and present results on the use of the Capability Maturity Model Integration (CMMI) in combination with agile software development, and thereafter to give an overview of the topics researched, which includes a discussion of their benefits and limitations, the strength of the findings, and the implications for research and practice. Methods: The method applied was a Systematic Literature Review on studies published up to (and including) 2011. Results: The search strategy identified 3193 results, of which 81 included studies on the use of CMMI together with agile methodologies. The benefits found were grouped into two main categories: those related to the organization in general and those related to the development process, and were organized into subcategories, according to the area to which they refer. The limitations were also grouped into these categories. Using the criteria defined, the strength of the evidence found was considered low. The implications of the results for research and practice are discussed. Conclusion: Agile methodologies can be used by companies to reduce efforts in getting to levels 2 and 3 of CMMI, there even being reports of applying agile practices that led to achieving level 5. However, agile methodologies alone, according to the studies, were not sufficient to obtain a rating at a given level, it being necessary to resort to additional practices to do so. (C) 2014 Elsevier B.V. All rights reserved.", "paper_title": "Using CMMI together with agile software development: A systematic review", "paper_id": "WOS:000347022800002"}