{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "technological_affordances"}, {"score": 0.0047292449487169345, "phrase": "virtual_museum"}, {"score": 0.004562362497952548, "phrase": "recent_developments"}, {"score": 0.004508048086020253, "phrase": "communication_technologies"}, {"score": 0.004401342842183475, "phrase": "authentic_experience"}, {"score": 0.004348936976349555, "phrase": "online_visitors"}, {"score": 0.004096082254543022, "phrase": "communication_technologycustomization"}, {"score": 0.003677280504320636, "phrase": "enjoyable_museum_experience"}, {"score": 0.003526186748088922, "phrase": "customizable_gallery"}, {"score": 0.0027741761880779535, "phrase": "distinct_psychological_benefits"}, {"score": 0.0025051811853674215, "phrase": "perceived_reality"}, {"score": 0.0021049977753042253, "phrase": "theoretical_and_practical_implications"}], "paper_keywords": [""], "paper_abstract": "Museums lean heavily on recent developments in communication technologies to create an authentic experience for online visitors of its galleries. This study examines whether three specific affordances of communication technologycustomization, interactivity, and navigabilitycan provide the personal, social, and physical contexts, respectively, that are necessary for ensuring an enjoyable museum experience. A 2 (presence vs. absence of customizable gallery) x 2 (presence vs. absence of live-chat with others) x 2 (presence vs. absence of 3D navigational tool) between-subjects factorial experiment (N = 126) found that although each affordance is associated with distinct psychological benefits (customization with sense of agency and control, interactivity with reciprocity, and navigability with perceived reality), combining them on the same interface tends to undermine these benefits. In addition, power usage moderates the effectiveness of each affordance on the interface. Theoretical and practical implications are discussed.", "paper_title": "Communicating Art, Virtually! Psychological Effects of Technological Affordances in a Virtual Museum", "paper_id": "WOS:000355344100002"}