{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "voronoi"}, {"score": 0.004549242970806199, "phrase": "biological_proteinprotein_interactions"}, {"score": 0.0043527164193299574, "phrase": "oligomeric_state"}, {"score": 0.003959594975607075, "phrase": "protein_crystal"}, {"score": 0.0038853212888610234, "phrase": "protein_monomer"}, {"score": 0.003095257144856771, "phrase": "real_ones"}, {"score": 0.0030371471832258317, "phrase": "difficult_task"}, {"score": 0.0027976491158911514, "phrase": "native_and_non-native_proteinprotein_complexes"}, {"score": 0.002544616720630384, "phrase": "voronoi_tessellation"}, {"score": 0.002373690110881497, "phrase": "significant_differences"}, {"score": 0.002299830460180699, "phrase": "biological_and_crystal_dimers"}, {"score": 0.002186395051086251, "phrase": "machine_learning_methods"}, {"score": 0.0021049977753042253, "phrase": "specific_and_non-specific_proteinprotein_interfaces"}], "paper_keywords": [""], "paper_abstract": "Motivation: Knowledge of the oligomeric state of a protein is often essential for understanding its function and mechanism. Within a protein crystal, each protein monomer is in contact with many others, forming many small interfaces and a few larger ones that are biologically significant if the protein is a homodimer in solution, but not if the protein is monomeric. Telling such crystal dimers from real ones remains a difficult task. Results: It has already been demonstrated that the interfaces of native and non-native proteinprotein complexes can be distinguished using a combination of parameters computed with a method on the Voronoi tessellation. We show in this article that the same parameters highlight significant differences between the interfaces of biological and crystal dimers. Using these parameters as descriptors in machine learning methods leads to accurate classification of specific and non-specific proteinprotein interfaces.", "paper_title": "DiMoVo: a Voronoi tessellation-based method for discriminating crystallographic and biological proteinprotein interactions", "paper_id": "WOS:000253746400008"}