{"auto_keywords": [{"score": 0.03803007121708631, "phrase": "heavy_hitters"}, {"score": 0.032763771507219784, "phrase": "epsilon-approximate_quantiles"}, {"score": 0.00481495049065317, "phrase": "data_summaries"}, {"score": 0.004478782833067256, "phrase": "single_summary"}, {"score": 0.0039576799833721315, "phrase": "computing_summaries"}, {"score": 0.003933865582543784, "phrase": "massive_distributed_data"}, {"score": 0.0037484181615819318, "phrase": "linear_functions"}, {"score": 0.003213489259323921, "phrase": "epsilon-approximate_heavy_hitters"}, {"score": 0.0031653299069848463, "phrase": "deterministic_mergeable_summary"}, {"score": 0.0030526626660835054, "phrase": "deterministic_summary"}, {"score": 0.002943993876557772, "phrase": "restricted_form"}, {"score": 0.0028050788526778957, "phrase": "full_mergeability"}, {"score": 0.0027463775689957255, "phrase": "geometric_summaries"}, {"score": 0.0026970382454914437, "phrase": "approximate_multidimensional_range_counting_queries"}, {"score": 0.0024707470443416793, "phrase": "previously_best_known_algorithms"}, {"score": 0.002404447017429959, "phrase": "simulated_sensor_network"}, {"score": 0.0023541098780336255, "phrase": "independent_interest"}, {"score": 0.002297867835438532, "phrase": "best_known_randomized_streaming"}, {"score": 0.0021246988234771055, "phrase": "mg"}, {"score": 0.0021049977753042253, "phrase": "spacesaving_summaries"}], "paper_keywords": ["Algorithms", " Data summarization", " heavy hitters", " quantiles"], "paper_abstract": "We study the mergeability of data summaries. Informally speaking, mergeability requires that, given two summaries on two datasets, there is a way to merge the two summaries into a single summary on the two datasets combined together, while preserving the error and size guarantees. This property means that the summaries can be merged in a way akin to other algebraic operators such as sum and max, which is especially useful for computing summaries on massive distributed data. Several data summaries are trivially mergeable by construction, most notably all the sketches that are linear functions of the datasets. But some other fundamental ones, like those for heavy hitters and quantiles, are not (known to be) mergeable. In this article, we demonstrate that these summaries are indeed mergeable or can be made mergeable after appropriatemodifications. Specifically, we show that for epsilon-approximate heavy hitters, there is a deterministic mergeable summary of size O(1/epsilon); for epsilon-approximate quantiles, there is a deterministic summary of size O((1/epsilon) log(epsilon n)) that has a restricted form of mergeability, and a randomized one of size O((1/epsilon) log(3/2)(1/epsilon)) with full mergeability. We also extend our results to geometric summaries such as epsilon-approximations which permit approximate multidimensional range counting queries. While most of the results in this article are theoretical in nature, some of the algorithms are actually very simple and even perform better than the previously best known algorithms, which we demonstrate through experiments in a simulated sensor network. We also achieve two results of independent interest: (1) we provide the best known randomized streaming bound for epsilon-approximate quantiles that depends only on epsilon, of size O((1/epsilon) log(3/2)(1/epsilon)), and (2) we demonstrate that the MG and the SpaceSaving summaries for heavy hitters are isomorphic.", "paper_title": "Mergeable Summaries", "paper_id": "WOS:000329123100007"}