{"auto_keywords": [{"score": 0.04472882712454684, "phrase": "core_line"}, {"score": 0.004655285779819366, "phrase": "novel_vortex_core_line_extraction_method"}, {"score": 0.004539005582217309, "phrase": "vortex_region_criterion"}, {"score": 0.0038996120252338556, "phrase": "basic_algorithm"}, {"score": 0.0035389348527719404, "phrase": "curve_skeleton"}, {"score": 0.003407026489727146, "phrase": "initial_prediction"}, {"score": 0.002951444412262927, "phrase": "vortex_core_lines"}, {"score": 0.0028654728453890426, "phrase": "initial_curve_skeleton"}, {"score": 0.0027819985260847577, "phrase": "geometry-guided_definition"}, {"score": 0.0025674490885184173, "phrase": "user-guided_approach"}, {"score": 0.002503187934017557, "phrase": "vortical_regions"}, {"score": 0.002389514188569084, "phrase": "computed_vortex"}, {"score": 0.002261794227418188, "phrase": "previous_core_line_detection_methods"}, {"score": 0.0021049977753042253, "phrase": "noise-affected_data"}], "paper_keywords": [""], "paper_abstract": "We propose a novel vortex core line extraction method based on the lambda(2) vortex region criterion in order to improve the detection of vortex features for 3D flow visualization. The core line is defined as a curve that connects lambda(2) minima restricted to planes that are perpendicular to the core line. The basic algorithm consists of the following stages: (1) lambda(2) field construction and isosurface extraction; (2) computation of the curve skeleton of the lambda(2) isosurface to build an initial prediction for the core line; (3) correction of the locations of the prediction by searching for 2 minima on planes perpendicular to the core line. In particular we consider the topology of the vortex core lines, guaranteeing the same topology as the initial curve skeleton. Furthermore, we propose a geometry-guided definition of vortex bifurcation, which represents the split of one core line into two parts. Finally, we introduce a user-guided approach in order to narrow down vortical regions taking into account the graph of lambda(2) along the computed vortex core line. We demonstrate the effectiveness of our method by comparing our results to previous core line detection methods with. both simulated and experimental data; in particular we show robustness of our method for noise-affected data.", "paper_title": "Topology-preserving lambda(2)-based vortex core line detection for flow visualization", "paper_id": "WOS:000257075000040"}