{"auto_keywords": [{"score": 0.04966229511350135, "phrase": "model-based_clustering"}, {"score": 0.004936053263828571, "phrase": "overlapping_clusters"}, {"score": 0.00481495049065317, "phrase": "membership_uncertainty"}, {"score": 0.0046633828802566364, "phrase": "better_identification"}, {"score": 0.004608997772926119, "phrase": "cluster_analysis_method"}, {"score": 0.004529093447865156, "phrase": "multivariate_mixture_model"}, {"score": 0.004316396683332752, "phrase": "hierarchical_clustering"}, {"score": 0.004278807087784626, "phrase": "relocation_clustering"}, {"score": 0.004272883348887675, "phrase": "markov_chain_monte_carlo_simulation"}, {"score": 0.004223032986655664, "phrase": "traditional_clustering_methods"}, {"score": 0.004180456894324666, "phrase": "gibbs_sampling"}, {"score": 0.004042295865725559, "phrase": "intercluster_distances"}, {"score": 0.0038355531523269217, "phrase": "gaussian_mixture_modeling"}, {"score": 0.003191485583025302, "phrase": "agglomerative_hierarchical_clustering"}, {"score": 0.0031636612155559267, "phrase": "iterative_relocation_clustering"}, {"score": 0.0031223774204093713, "phrase": "k-means_criterion"}, {"score": 0.002823207272381655, "phrase": "group_memberships"}, {"score": 0.002737960968372391, "phrase": "john_wiley"}, {"score": 0.0021049977753042253, "phrase": "cluster_group_memberships"}], "paper_keywords": ["model-based clustering", " Markov chain Monte Carlo simulation", " Gibbs sampling"], "paper_abstract": "We report the use of a cluster analysis method based on a multivariate mixture model, known as model-based clustering, for overcoming the limitations of hierarchical clustering and relocation clustering. Unlike traditional clustering methods in which clusters are formed on the basis of intercluster distances, model-based clustering classifies observations on the basis of probability estimated from Gaussian mixture modeling, and its statistical basis allows for inference. Three examples are given in which we demonstrate that model-based clustering gives much better performance for overlapping clusters, a more reliable determination of the number of clusters in data, and better identification of clustering in the presence of outliers than agglomerative hierarchical clustering or iterative relocation clustering using a K-means criterion. We also show that Markov chain Monte Carlo simulation, as implemented via Gibbs sampling coupled with model-based clustering, may be used to assess uncertainty of group memberships. Copyright (c) 2013 John Wiley & Sons, Ltd. We illustrate the use of model-based clustering and show three examples in which model-based clustering gives much better performance for overlapping clusters, a more reliable determination of the number of clusters in data, and better identification of clustering than other clustering methods. We also show that Markov chain Monte Carlo simulation, as implemented via Gibbs sampling coupled with model-based clustering, may be used to assess uncertainty of cluster group memberships.", "paper_title": "Bayesian estimation of membership uncertainty in model-based clustering", "paper_id": "WOS:000335520900005"}