{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "event-driven_simulation"}, {"score": 0.049188612914091503, "phrase": "multiple_synaptic_time_constants"}, {"score": 0.04274518365190484, "phrase": "neuron_models"}, {"score": 0.037383488419657, "phrase": "firing_time"}, {"score": 0.004620093797504386, "phrase": "neural_networks"}, {"score": 0.004253618550301311, "phrase": "reasonable_time"}, {"score": 0.003975416846030462, "phrase": "driving_forces"}, {"score": 0.003901407184706592, "phrase": "recent_research"}, {"score": 0.0038721890530859578, "phrase": "event-driven_simulation_strategies"}, {"score": 0.003800093834008562, "phrase": "precise_and_efficient_simulation"}, {"score": 0.003078504229140364, "phrase": "neuron_model"}, {"score": 0.0027916287357898544, "phrase": "exact_prediction"}, {"score": 0.002678433668156676, "phrase": "exact_simulation_results"}, {"score": 0.0025795066118838067, "phrase": "least_possible_amount"}, {"score": 0.0025219085140220773, "phrase": "firing_times"}, {"score": 0.0024748913336907923, "phrase": "elegant_algorithm"}, {"score": 0.0023040642263522505, "phrase": "algorithmic_techniques"}, {"score": 0.0021049977753042253, "phrase": "underlying_neuron_model"}], "paper_keywords": [""], "paper_abstract": "The simulation of spiking neural networks (SNNs) is known to be a very time-consuming task. This limits the size of SNN that can be simulated in reasonable time or forces users to overly limit the complexity of the neuron models. This is one of the driving forces behind much of the recent research on event-driven simulation strategies. Although event-driven simulation allows precise and efficient simulation of certain spiking neuron models, it is not straightforward to generalize the technique to more complex neuron models, mostly because the firing time of these neuron models is computationally expensive to evaluate. Most solutions proposed in literature concentrate on algorithms that can solve this problem efficiently. However, these solutions do not scale well when more state variables are involved in the neuron model, which is, for example, the case when multiple synaptic time constants for each neuron are used. In this letter, we show that an exact prediction of the firing time is not required in order to guarantee exact simulation results. Several techniques are presented that try to do the least possible amount of work to predict the firing times. We propose an elegant algorithm for the simulation of leaky integrate-and-fire (LIF) neurons with an arbitrary number of (unconstrained) synaptic time constants, which is able to combine these algorithmic techniques efficiently, resulting in very high simulation speed. Moreover, our algorithm is highly independent of the complexity (i. e., number of synaptic time constants) of the underlying neuron model.", "paper_title": "Accelerating Event-Driven Simulation of Spiking Neurons with Multiple Synaptic Time Constants", "paper_id": "WOS:000264896200007"}