{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "collaborative_digital_table"}, {"score": 0.004677847043645765, "phrase": "novel_display_system"}, {"score": 0.004544629724830453, "phrase": "different_levels"}, {"score": 0.004440780432053927, "phrase": "multiple_users"}, {"score": 0.004364446928620496, "phrase": "collaborative_multi-touch"}, {"score": 0.004143196873246147, "phrase": "revolving_polarizer"}, {"score": 0.0037989951856280423, "phrase": "technique's_benefits"}, {"score": 0.0036063061558261546, "phrase": "specific_users"}, {"score": 0.0034233569308012982, "phrase": "entertainment_application"}, {"score": 0.0029622717081190667, "phrase": "application_feasibilities"}, {"score": 0.0028446460307503343, "phrase": "future_extensions"}, {"score": 0.002608040688794517, "phrase": "main_contributions"}, {"score": 0.0021049977753042253, "phrase": "multi-visibility_control"}], "paper_keywords": ["Display system", " Public display", " CSCW", " Entertainment"], "paper_abstract": "We propose a novel display system that presents information with different levels of visibility to multiple users for enhancing collaborative multi-touch on digital tables by controlling visibility with a revolving polarizer. We first describe the system and its multiple variations and then present several example applications showing the technique's benefits: the concealment and classification of information for specific users. We then describe an example of an entertainment application and a tangible-polarizer on display. In addition, we conduct experiments to learn the variations of visibilities depending on the conditions for investigating application feasibilities. Finally, we discuss the future extensions of the configuration, its potential, and its limitations. The following are the main contributions of this paper: (1) the discussion and clarification of the importance for multi-visibility with multi-touch, (2) the proposal of our multi-visibility system and its usage, (3) the verification of multi-visibility control through experiments.", "paper_title": "A visibility control system for collaborative digital table", "paper_id": "WOS:000270649700007"}