{"auto_keywords": [{"score": 0.04601284855430019, "phrase": "electrical_steering"}, {"score": 0.015719716506582538, "phrase": "electric_vehicle"}, {"score": 0.011462018663240054, "phrase": "appropriate_mode"}, {"score": 0.004525629293824217, "phrase": "motor_torques"}, {"score": 0.004253618550301311, "phrase": "motor_controllers"}, {"score": 0.003997891221012094, "phrase": "in-wheel_motors"}, {"score": 0.00384731849108269, "phrase": "wider_dynamic_range"}, {"score": 0.0038246602895705643, "phrase": "forward_acceleration"}, {"score": 0.003757480190200645, "phrase": "reverse_acceleration"}, {"score": 0.0033883824438527316, "phrase": "high-speed_maneuvering"}, {"score": 0.0033584796908285863, "phrase": "high_back-emf_voltage"}, {"score": 0.0032800186243040663, "phrase": "motor's_torque"}, {"score": 0.0031845067058084583, "phrase": "differential_torque"}, {"score": 0.00297522010445508, "phrase": "electrical_steering_performance"}, {"score": 0.0028127163745564777, "phrase": "low-level_controller"}, {"score": 0.00266693888510356, "phrase": "efficiency_consideration"}, {"score": 0.002643386043540555, "phrase": "input_transformation"}, {"score": 0.002581587777482942, "phrase": "current_dynamics"}, {"score": 0.0025361866386341796, "phrase": "motor_torque"}, {"score": 0.002455009746748708, "phrase": "high-level_controller"}, {"score": 0.0023834640793589435, "phrase": "reference_commands"}, {"score": 0.002362408791114333, "phrase": "low-level_controllers"}, {"score": 0.0022800270693436155, "phrase": "control_signals"}, {"score": 0.002259883463607508, "phrase": "consistent_steering_performance"}, {"score": 0.0022267046070925446, "phrase": "integrator_windup"}, {"score": 0.0022070310530794097, "phrase": "control_system"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Electric vehicle", " In-wheel motor", " Drive-by-wire", " Electrical steering", " Regeneration", " Control Saturation", " Anti-windup compensator"], "paper_abstract": "In this research, an electric vehicle actuated by two in-wheel DC motors is developed. By properly coordinating the motor torques, both drive-by-wire and electrical steering can be achieved. Two critical issues respectively related to the design of motor controllers and the coordination of the two motor torques under control saturation are investigated in this study. Firstly, as for the in-wheel motors that are used for driving and steering simultaneously, their operation covers a wider dynamic range that forward acceleration (deceleration), and reverse acceleration (deceleration) may occur alternately. To perform driving and steering smoothly and efficiently, each motor should be switched to an appropriate mode to generate the torque demanded. Secondly, during the high-speed maneuvering, the high back-emf voltage in the motor coil substantially reduces the motor's torque generating capability. Since the electrical steering depends on the differential torque of two wheels, when electrical steering is demanded in this case, torque/current saturation may occur in either one of the motors and the electrical steering performance could be seriously degraded. To address these issues, controllers of two levels are proposed. For the low-level controller (the motor controller), it operates the motor automatically in an appropriate mode for performance and efficiency consideration. An input transformation is introduced to cancel the nonlinearity in current dynamics so as to control the motor torque easily and precisely regardless of mode switching. For the high-level controller (the torque coordination controller), besides generating reference commands to the low-level controllers, during control saturation it can also properly re-distributes control signals to maintain consistent steering performance and provides compensation for integrator windup. The control system is implemented and the performance is experimentally and numerically validated. (C) 2012 Elsevier Ltd. All rights reserved.", "paper_title": "Motor control and torque coordination of an electric vehicle actuated by two in-wheel motors", "paper_id": "WOS:000314857300005"}