{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "quantitative_structure-activity_relationships"}, {"score": 0.03867168458296296, "phrase": "tmacc_descriptors"}, {"score": 0.004551199992546761, "phrase": "tmacc"}, {"score": 0.0040916230716372265, "phrase": "widely_used_autocorrelation_method"}, {"score": 0.003940706575253453, "phrase": "three-dimensional_conformations"}, {"score": 0.0036324746826127997, "phrase": "eight_literature_data_sets"}, {"score": 0.0033482708495261864, "phrase": "partial_least-squares_regression"}, {"score": 0.0029722900280316216, "phrase": "one-out_cross-validated_coefficient"}, {"score": 0.0027916287357898544, "phrase": "five_data_sets"}, {"score": 0.0027395968397212053, "phrase": "hqsar"}, {"score": 0.002447101794397243, "phrase": "automated_extraction"}, {"score": 0.0023127544795063263, "phrase": "qualitative_agreement"}], "paper_keywords": [""], "paper_abstract": "Highly predictive topological maximum cross correlation (TMACC) descriptors for the derivation of quantitative structure-activity relationships (QSARs) are presented, based on the widely used autocorrelation method. They require neither the calculation of three-dimensional conformations nor an alignment of structures. We have validated the TMACC descriptors across eight literature data sets, ranging in size from 66 to 361 molecules. In combination with partial least-squares regression, they perform competitively with a current state-of-the-art 2D QSAR methodology, hologram QSAR (HQSAR), yielding larger leave-one-out cross-validated coefficient of determination values (LOO q(2)) for five data sets. Like HQSAR, these descriptors are also interpretable but do not requiring hashing. The interpretation both enables the automated extraction of SARs and can give a description in qualitative agreement with more time-consuming 3D and 4D QSAR methods. Open source software for generating the TMACC descriptors is freely available from our Web site.", "paper_title": "TMACC: Interpretable correlation descriptors for quantitative structure-activity relationships", "paper_id": "WOS:000245136100036"}