{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "efficient_similar_sentences_extraction"}, {"score": 0.004749106104067268, "phrase": "semantic_similarity"}, {"score": 0.004668059458774745, "phrase": "essential_issue"}, {"score": 0.0045726187330434025, "phrase": "text_summarization"}, {"score": 0.004541238786717793, "phrase": "web_page_retrieval"}, {"score": 0.004510073211984104, "phrase": "question-answer_model"}, {"score": 0.004195418010131832, "phrase": "knowledge-based_strategies"}, {"score": 0.0041666157975446564, "phrase": "corpus-based_strategies"}, {"score": 0.0037704502704526996, "phrase": "efficiency_issue"}, {"score": 0.0036052633308076933, "phrase": "top-k_semantic_similar_sentences"}, {"score": 0.003531474887552889, "phrase": "previous_methods"}, {"score": 0.003471135453226184, "phrase": "big_data"}, {"score": 0.0033190180867511605, "phrase": "candidate_sentence"}, {"score": 0.0031845067058084613, "phrase": "efficient_strategies"}, {"score": 0.003108565704097622, "phrase": "general_framework"}, {"score": 0.00307657476125683, "phrase": "basic_idea"}, {"score": 0.0029722900280316216, "phrase": "corresponding_index"}, {"score": 0.0028715299874549245, "phrase": "querying_process"}, {"score": 0.002707993764473537, "phrase": "optimal_aggregation_algorithm"}, {"score": 0.0024586427394152196, "phrase": "extensive_experimental_evaluation"}, {"score": 0.00226322835801988, "phrase": "experimental_results"}], "paper_keywords": ["semantic similarity", " query aggregation", " top-k"], "paper_abstract": "Measuring the semantic similarity between sentences is an essential issue for many applications, such as text summarization, Web page retrieval, question-answer model, image extraction, and so forth. A few studies have explored on this issue by several techniques, e.g., knowledge-based strategies, corpus-based strategies, hybrid strategies, etc. Most of these studies focus on how to improve the effectiveness of the problem. In this paper, we address the efficiency issue, i.e., for a given sentence collection, how to efficiently discover the top-k semantic similar sentences to a query. The previous methods cannot handle the big data efficiently, i.e., applying such strategies directly is time consuming because every candidate sentence needs to be tested. In this paper, we propose efficient strategies to tackle such problem based on a general framework. The basic idea is that for each similarity, we build a corresponding index in the preprocessing. Traversing these indices in the querying process can avoid to test many candidates, so as to improve the efficiency. Moreover, an optimal aggregation algorithm is introduced to assemble these similarities. Our framework is general enough that many similarity metrics can be incorporated, as will be discussed in the paper. We conduct extensive experimental evaluation on three real datasets to evaluate the efficiency of our proposal. In addition, we illustrate the trade-off between the effectiveness and efficiency. The experimental results demonstrate that the performance of our proposal outperforms the state-of-the-art techniques on efficiency while keeping the same high precision as them.", "paper_title": "Exploration on efficient similar sentences extraction", "paper_id": "WOS:000337163500008"}