{"auto_keywords": [{"score": 0.04325859731194569, "phrase": "ict"}, {"score": 0.00481495049065317, "phrase": "teacher_stress"}, {"score": 0.004418287966422041, "phrase": "'teacher-technology_environment_interaction_model"}, {"score": 0.003300813776412652, "phrase": "nine_teachers"}, {"score": 0.003176899769744057, "phrase": "teaching_activities"}, {"score": 0.0031018195951638882, "phrase": "main_results"}, {"score": 0.0026361219160332626, "phrase": "coping_strategies"}, {"score": 0.0024417832296664698, "phrase": "alternative_way"}, {"score": 0.0022834993174767016, "phrase": "implementation_problems"}, {"score": 0.002176747110119268, "phrase": "teacher-technology_environment_fit"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["elementary education", " improving classroom teaching", " pedagogical issues", " secondary education"], "paper_abstract": "In this study we use a model which we refer to as the 'teacher-technology environment interaction model' to explore the issue of the stress experienced by teachers whilst using ICT in the classroom. The methodology we used involved a comparison of three datasets obtained from: direct observation and video-logging of the teachers in the classroom; recordings of their galvanic skin response (GSR) taken whilst teaching; and interviews. Data were obtained from nine teachers, and in total, approximately 32 h of teaching activities were observed. The main results of this study were (a) the demonstration that teachers do suffer stress associated with the use of technology in the classroom (i.e. technostress) (b) the identification of causes, symptoms and coping strategies associated with technostress in the classroom. This study, therefore, points to an alternative way of thinking about the problems of implementing e-learning by conceptualizing some of these implementation problems in terms of technostress (and in particular of teacher-technology environment fit). (c) 2007 Elsevier Ltd. All rights reserved.", "paper_title": "Investigating teacher stress when using technology", "paper_id": "WOS:000258024000009"}