{"auto_keywords": [{"score": 0.04930231023249969, "phrase": "heme_derivatives"}, {"score": 0.015719716506582538, "phrase": "electronic_properties"}, {"score": 0.015593050244537974, "phrase": "docking_calculations"}, {"score": 0.008618353641781316, "phrase": "nma"}, {"score": 0.008444518938792944, "phrase": "higher_affinity"}, {"score": 0.004293840838533456, "phrase": "heme_group"}, {"score": 0.0039402177950179345, "phrase": "five_structurally_modified_heme_derivatives"}, {"score": 0.0038446194432899183, "phrase": "native_heme"}, {"score": 0.0034990853199511982, "phrase": "binding_affinity"}, {"score": 0.0029581155916843663, "phrase": "hindrance_effects"}, {"score": 0.0027817658627604653, "phrase": "heme-binding_site"}, {"score": 0.0027141975147496264, "phrase": "heme-apoprotein_complexes"}, {"score": 0.002470008209169057, "phrase": "nma."}, {"score": 0.0024398167078355224, "phrase": "surface_electronic_properties"}, {"score": 0.002419923263785302, "phrase": "sep"}, {"score": 0.0022849068677290836, "phrase": "polarizable_functionalities"}, {"score": 0.0022477377970612847, "phrase": "ester_groups"}, {"score": 0.0021662983565317283, "phrase": "heme_derivates"}, {"score": 0.0021398115287338693, "phrase": "main_physicochemical_parameter"}, {"score": 0.0021049977753042253, "phrase": "recognition_process"}], "paper_keywords": ["cytochrome P450", " DFT", " docking", " heme derivatives", " HOMO-LUMO orbitals"], "paper_abstract": "Cytochrome P-450 is a group of enzymes involved in the biotransformation of many substances, including drugs. These enzymes possess a heme group (1) that when it is properly modified induces several important physicochemical changes that affect their enzymatic activity. In this work, the five structurally modified heme derivatives 2-6 and the native heme 1 were docked on CYP2B4, (an isoform of P450), in order to determine whether such modifications alter their binding form and binding affinity for CYP2B4 apoprotein. In addition, docking calculations were used to evaluate the affinity of CYP2B4 apoprotein-heme complexes for aniline (A) and N-methyl-aniline (NMA). Results showing the CYP2B4 heme 4- and heme 6-apoprotein complexes to be most energetically stable indicate that either hindrance effects or electronic properties are the most important factors with respect to the binding of heme derivatives at the heme-binding site. Furthermore, although all heme-apoprotein complexes demonstrated high affinity for both A and NMA, the CYP2B4 apoprotein-5 complex had higher affinity for A, and the heme 6 complex had higher affinity for NMA. Finally, surface electronic properties (SEP) were calculated in order to explain why certain arginine residues of CYP2B4 apoprotein interact with polarizable functionalities, such as ester groups or sp(2) carbons, present in some heme derivates. The main physicochemical parameter involved in the recognition process of the heme derivatives, the CYP2B4 apoprotein and A or NMA, are reported.", "paper_title": "Comparing the electronic properties and docking calculations of heme derivatives on CYP2B4", "paper_id": "WOS:000256010300008"}