{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "organizational_networks"}, {"score": 0.00466016686289196, "phrase": "commentary_paper"}, {"score": 0.004489327204473076, "phrase": "supposed_ability"}, {"score": 0.003994624397219346, "phrase": "desouza"}, {"score": 0.0037069087922811488, "phrase": "taken-for-granted_assumption"}, {"score": 0.003407839062159497, "phrase": "practice_perspective"}, {"score": 0.0032522091171602557, "phrase": "social_practices"}, {"score": 0.0031036643805367487, "phrase": "trkman"}, {"score": 0.0030747771905143273, "phrase": "desouza's_paper"}, {"score": 0.002787181295054319, "phrase": "knowledge_transfer"}, {"score": 0.0025028892126605124, "phrase": "best_practices"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Knowledge transfer", " Knowledge sharing", " Structural perspective of knowledge", " Practice perspective of knowledge", " Networks", " Risk assessment"], "paper_abstract": "This commentary paper aims to highlight issues associated with the supposed ability to transfer knowledge across networks. In response to the paper \"Risks in Organizational Networks: An Exploratory Framework\", (Trkman and Desouza, this issue, pp. XXX-XXX), we argue that the taken-for-granted assumption that knowledge is transferrable represents a risk in itself. We analyze knowledge in networks using a practice perspective - in turn we consider knowledge as enacted in social practices and as context-specific. In contrast with Trkman and Desouza's paper, we argue that if knowledge is seen as enacted in practice, a framework that maps risks associated with knowledge transfer is limiting. We conclude that, since knowing in practice is emergent and not fully controllable, adopting a set of best practices on how to effectively transfer (or not) knowledge could itself be risky for managers who then believe that knowledge can be treated as a commodity and easily moved about a network. (C) 2011 Elsevier B.V. All rights reserved.", "paper_title": "Knowledge risks in organizational networks: The practice perspective", "paper_id": "WOS:000302926000002"}