{"auto_keywords": [{"score": 0.05007783388334391, "phrase": "real-time_and_secure_mobile_ticket_system"}, {"score": 0.03923252056206922, "phrase": "cell_phone"}, {"score": 0.03499926199761658, "phrase": "pda"}, {"score": 0.004317848984770719, "phrase": "high_technological_products"}, {"score": 0.003907212558276185, "phrase": "mobile_users"}, {"score": 0.0038368442918503072, "phrase": "internet_transactions"}, {"score": 0.003802135020791801, "phrase": "mobile_devices"}, {"score": 0.00334780964309978, "phrase": "personal_digital_assistant"}, {"score": 0.003170060683860338, "phrase": "commercial_activities"}, {"score": 0.0028682668647074397, "phrase": "digital_value-added_services_platform"}, {"score": 0.0027407299369891502, "phrase": "related_cryptography_mechanisms"}, {"score": 0.002525304188434315, "phrase": "sql"}, {"score": 0.002391067964886602, "phrase": "mobile_device"}, {"score": 0.0023479408542211875, "phrase": "requested_value-added_service"}, {"score": 0.0022434880661725493, "phrase": "secure_transaction"}], "paper_keywords": ["RSA", " security", " mobile ticket", " digital signature", " mobile devices", " verification"], "paper_abstract": "With the technology improving, many content-services have been digitalized constantly ill Our daily life, To be more convenient and efficient, many kinds of high technological products have also been personalized, mobilized, and people call handle their businesses at any time from anywhere. For example, mobile users can perform the Internet transactions via mobile devices (such as cell phone and Personal Digital Assistant). Nowadays, the cell phone is not only used in communication, but it can be combined with Personal Digital Assistant (PDA) functions. The progress of technology makes the commercial activities efficient; moreover, it also provides consumers with more convenient and intimate services. Oil the basis of the tendency, we implement a digital value-added services platform via PDA in this research. We integrate the related cryptography mechanisms (for example: public key, secret key cryptography system and digital signature) wireless and SQL technologies to construct a real-time and Secure mobile ticket system. The consumer call use a mobile device to get a requested value-added service Such that the buyers and sellers can perform a secure transaction. Therefore, the security and reliability of the system are assured in our scheme.", "paper_title": "Construction of a Real-Time and Secure Mobile Ticket System", "paper_id": "WOS:000266302900011"}