{"auto_keywords": [{"score": 0.03649502212066351, "phrase": "synchronized_and_flip-flop_regimes"}, {"score": 0.03416864151819913, "phrase": "synchronized_regime"}, {"score": 0.03132471895452395, "phrase": "flip-flop_regime"}, {"score": 0.00481495049065317, "phrase": "side-by-side_square_cylinders"}, {"score": 0.004747341927843291, "phrase": "boltzmann"}, {"score": 0.004679134285953932, "phrase": "low-reynolds_number"}, {"score": 0.004450568197899267, "phrase": "lattice_boltzmann_method"}, {"score": 0.0041136473765874815, "phrase": "characteristic_dimension"}, {"score": 0.0036947814248579243, "phrase": "circular_cylinders"}, {"score": 0.0036684182697540382, "phrase": "detailed_results"}, {"score": 0.0034148800887385615, "phrase": "vortex-shedding"}, {"score": 0.0030889995517870525, "phrase": "predominant_mode"}, {"score": 0.0030669696748097503, "phrase": "lse"}, {"score": 0.0029909851863915283, "phrase": "underlying_modes"}, {"score": 0.0027741761880779535, "phrase": "quasi-stable_state"}, {"score": 0.0025364139244227436, "phrase": "mean_pressure"}, {"score": 0.002509284173541882, "phrase": "upstream_surface"}, {"score": 0.002229300966775032, "phrase": "adjoining_wakes"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": [""], "paper_abstract": "The low-Reynolds number flow around two square cylinders placed side-by-side is investigated using the lattice Boltzmann method (LBM). The effects of the gap ratio s/d (s is the separation between the cylinders and d is the characteristic dimension) on the flow are studied. These simulations reveal the existence of regimes with either synchronized or non-synchronized vortex-shedding, with transition occurring at s/d approximate to 2, which is larger than for circular cylinders. Detailed results are presented at Re = 73 for s/d = 2.5 and 0.7 corresponding to the synchronized and flip-flop regimes, respectively. Vortex-shedding from the cylinder occurs either in-phase or in-antiphase in the synchronized regime. However, linear stochastic estimate (LSE) calculations show that in-phase locking is the predominant mode. LSE is also employed to educe the underlying modes in the flip-flop regime, where evidence for both in-phase and anti-phase locked vortices is found, indicating that this regime is in a quasi-stable state between these two modes. The merging of the wakes, which is gradual for the synchronized regime, occurs rapidly in the flip-flop regime. The mean pressure on the upstream surface is symmetric and asymmetric for the synchronized and flip-flop regimes, respectively. Differences in results between the two regimes are interpreted in terms of the interaction of the jet formed between the cylinders with the adjoining wakes, the strength of this interaction depending on the spacing. (c) 2005 Elsevier Ltd. All rights reserved.", "paper_title": "Investigation of flow around a pair of side-by-side square cylinders using the lattice Boltzmann method", "paper_id": "WOS:000241323900007"}