{"auto_keywords": [{"score": 0.03569623453038464, "phrase": "ls_estimator"}, {"score": 0.029420333683948783, "phrase": "stls_estimator"}, {"score": 0.00481495049065317, "phrase": "optical_image_registration"}, {"score": 0.004760017604908536, "phrase": "reference_control"}, {"score": 0.004634254474150777, "phrase": "explanatory_variables"}, {"score": 0.004581373625744533, "phrase": "polynomial_regression_model"}, {"score": 0.0041001740903338834, "phrase": "extensively_applied_estimator"}, {"score": 0.003669330508576073, "phrase": "new_feasible_methods"}, {"score": 0.003545024951402821, "phrase": "scaled_total_least_squares"}, {"score": 0.0033215617190376565, "phrase": "image_registration"}, {"score": 0.0030530931975309697, "phrase": "stls"}, {"score": 0.002700738055025905, "phrase": "model_parameters"}, {"score": 0.0025892330566358503, "phrase": "error-in-variables_model"}, {"score": 0.002444544487772349, "phrase": "superior_overall_performance"}, {"score": 0.0023798115577749225, "phrase": "measurement_errors"}, {"score": 0.0022815262950738814, "phrase": "error_propagation"}, {"score": 0.0022041312401435346, "phrase": "rcp_number"}, {"score": 0.0021049977753042253, "phrase": "presented_estimator"}], "paper_keywords": ["Image registration", " Polynomial regression model", " Error-in-variables model", " Ordinary least squares", " Scaled total least squares", " Singular value decomposition"], "paper_abstract": "In optical image registration, the reference control points (RCPs) used as explanatory variables in the polynomial regression model are generally assumed to be error free. However, this most frequently used assumption is often invalid in practice because RCPs always contain errors. In this situation, the extensively applied estimator, the ordinary least squares (LS) estimator, is biased and incapable of handling the errors in RCPs. Therefore, it is necessary to develop new feasible methods to address such a problem. This paper discusses the scaled total least squares (STLS) estimator, which is a generalization of the LS estimator in optical remote sensing image registration. The basic principle and the computational method of the STLS estimator and the relationship among the LS, total least squares (TLS) and STLS estimators are presented. Simulation experiments and real remotely sensed image experiments are carried out to compare LS and STLS approaches and systematically analyze the effect of the number and accuracy of RCPs on the performances in registration. The results show that the STLS estimator is more effective in estimating the model parameters than the LS estimator. Using this estimator based on the error-in-variables model, more accurate registration results can be obtained. Furthermore, the STLS estimator has superior overall performance in the estimation and correction of measurement errors in RCPs, which is beneficial to the study of error propagation in remote sensing data. The larger the RCP number and error, the more obvious are these advantages of the presented estimator.", "paper_title": "Scaled total-least-squares-based registration for optical remote sensing imagery", "paper_id": "WOS:000311503700001"}