{"auto_keywords": [{"score": 0.05007852962010534, "phrase": "subspace_clusters"}, {"score": 0.02199735521801451, "phrase": "representative_clusters"}, {"score": 0.015216948769269052, "phrase": "subspace_clustering"}, {"score": 0.004769958800452922, "phrase": "k_representatives"}, {"score": 0.00470325458481566, "phrase": "major_challenge"}, {"score": 0.004508661664944657, "phrase": "explosive_number"}, {"score": 0.004424768776701965, "phrase": "high_computational_complexity"}, {"score": 0.004028054020045027, "phrase": "data's_dimensionality"}, {"score": 0.0034984340449789745, "phrase": "k_groups"}, {"score": 0.0028715299874549245, "phrase": "optimal_set"}, {"score": 0.0028449360017432992, "phrase": "np"}, {"score": 0.002613709503583786, "phrase": "greatest_advantage"}, {"score": 0.0024014759148123736, "phrase": "complete_set"}, {"score": 0.0023127544795063263, "phrase": "low-dimensional_subspaces"}, {"score": 0.0022273034991008326, "phrase": "high-dimensional_subspaces"}, {"score": 0.002196077907454079, "phrase": "approximate_results"}, {"score": 0.0021450029487459403, "phrase": "polynomial_time"}], "paper_keywords": ["Subspace clustering", " Representative clusters", " High-dimensional data", " Data summarization", " Data mining"], "paper_abstract": "A major challenge in subspace clustering is that subspace clustering may generate an explosive number of clusters with high computational complexity, which severely restricts the usage of subspace clustering. The problem gets even worse with the increase of the data's dimensionality. In this paper, we propose to summarize the set of subspace clusters into k representative clusters to alleviate the problem. Typically, subspace clusters can be clustered further into k groups, and the set of representative clusters can be selected from each group. In such a way, only the most representative subspace clusters will be returned to user. Unfortunately, when the size of the set of representative clusters is specified, the problem of finding the optimal set is NP-hard. To solve this problem efficiently, we present two approximate methods: PCoC and HCoC. The greatest advantage of our methods is that we only need a subset of subspace clusters as the input instead of the complete set of subspace clusters. Precisely, only the clusters in low-dimensional subspaces are computed and assembled into representative clusters in high-dimensional subspaces. The approximate results can be found in polynomial time. Our performance study shows both the effectiveness and efficiency of these methods.", "paper_title": "Efficient approaches for summarizing subspace clusters into k representatives", "paper_id": "WOS:000289438200003"}