{"auto_keywords": [{"score": 0.04950930066917755, "phrase": "challenging_decision_problems"}, {"score": 0.015719716506582538, "phrase": "changeable_spaces"}, {"score": 0.015111120719119473, "phrase": "decision_problems"}, {"score": 0.015051552340376176, "phrase": "decision_makers"}, {"score": 0.011031406916716432, "phrase": "problem_domain"}, {"score": 0.004571478018964363, "phrase": "information_inputs"}, {"score": 0.004348936976349555, "phrase": "alerted_parameters"}, {"score": 0.004288581530198804, "phrase": "unalerted_parameters"}, {"score": 0.0038348235692738783, "phrase": "\"optimal\"_solution"}, {"score": 0.0037815759959457305, "phrase": "wrong_problem"}, {"score": 0.0037664981403399064, "phrase": "bad_solution"}, {"score": 0.0037067832801150067, "phrase": "-just_a_small_part"}, {"score": 0.0029991500396912923, "phrase": "serious_mistake"}, {"score": 0.002957471572421436, "phrase": "decision_trap"}, {"score": 0.002898930717812433, "phrase": "systematic_scheme"}, {"score": 0.0028758391869611374, "phrase": "habitual_domain_theory"}, {"score": 0.002841545331522694, "phrase": "decision_blinds"}, {"score": 0.0028245516301681713, "phrase": "decision_traps"}, {"score": 0.0027797289207443358, "phrase": "good_quality"}, {"score": 0.0023925401023682717, "phrase": "value_added_problems"}, {"score": 0.0023592715993204796, "phrase": "innovation_dynamics"}, {"score": 0.002284952126640633, "phrase": "acquired_competence"}, {"score": 0.002244178699939059, "phrase": "\"certain_customers"}, {"score": 0.002169132543304098, "phrase": "created_value"}], "paper_keywords": [""], "paper_abstract": "There are many parameters in challenging decision problems, including the alternatives, the criteria, resources, the perception of decision problems, decision makers and their psychological states, information inputs from the environment, and self-suggestion, etc. At any moment of time, some of these parameters can catch our attention, called alerted parameters; some cannot, called unalerted parameters. Some parameters are visible, some are invisible. In addition, the parameters themselves can vary over certain ranges or domains. All of these make challenging decision problems very complex. We call this kind of problems as decision problems with changeable spaces (parameters). We may focus on certain parameters with certain assumed values to find an \"optimal\" solution, which may lead to solve wrong problem with bad solution. Quite often, our focus may be-just a small part of what we know, or just a part of what we are most familiar with. We may often neglect what we are not familiar with, and pay no attention to what we do not know. As a consequence, we may see just a small part of the problem domain (including all parameters and their possible variations over time). The portion (of the problem domain) that we cannot see is our decision blind. Suppose our alerted domain (those parameters and their variations that are currently under our consideration) to be fixed in only a small part of the problem domains. Then very likely we could end up with a serious mistake. This situation is known as decision trap. In this article, we will introduce a systematic scheme, based on habitual domain theory, to help us reduce decision blinds and avoid decision traps so that we could make decision with good quality. Then we will also introduce the concept of competence set analysis to help us cope with challenging decision problems. This including: (i) how to effectively expand our competence (resources, skill, know-how, information, ideas, effort, etc.) as to solve a given problem effectively; and (ii) given a set of competence, how to maximize its value by solving a set of value added problems. Furthermore, we will introduce innovation dynamics which describe the dynamics of how to solve a set of problems with our existent or acquired competence (to relieve the pains or frustrations of \"certain customers or decision makers\" at certain situations) as to create value, and how to distribute this created value so that we can continuously expand out competence set to solve more challenging problems and create more value.", "paper_title": "Decision traps and competence dynamics in changeable spaces", "paper_id": "WOS:000237295200002"}