{"auto_keywords": [{"score": 0.02538259798168113, "phrase": "mobile_node"}, {"score": 0.011222381356300017, "phrase": "mobile_nodes"}, {"score": 0.011126832717486731, "phrase": "map_domain"}, {"score": 0.00838399498635217, "phrase": "signaling_cost"}, {"score": 0.006596020680915002, "phrase": "map"}, {"score": 0.0064252455500769775, "phrase": "packet_arrival_rate"}, {"score": 0.005551739501183546, "phrase": "weak_points"}, {"score": 0.004879676684186141, "phrase": "total_cost"}, {"score": 0.00481504808477961, "phrase": "adaptive"}, {"score": 0.004379977556546879, "phrase": "frequent_location_registration"}, {"score": 0.003949974260471287, "phrase": "unnecessary_packet_latency"}, {"score": 0.0038825121288253435, "phrase": "increased_processing_cost"}, {"score": 0.0037997989355937727, "phrase": "map."}, {"score": 0.0037188360359702182, "phrase": "processing_cost"}, {"score": 0.0027503564589458837, "phrase": "optimal_number"}, {"score": 0.0021049977753042253, "phrase": "adaptive_selection"}], "paper_keywords": [""], "paper_abstract": "Internet engineering task force(IETF) has proposed hierarchical mobile IPv6(HMIPv6) in order to reduce a frequent location registration of a mobile node in mobile IPv6(MIPv6). All traffics toward a mobile node must be transmitted through a MAP in HMIPv6. This brings unnecessary packet latency because of the increased processing cost of packet at the MAP. At this point the processing cost of packet at the MAP is influenced both by the packet arrival rate for a mobile node and the number of mobile nodes in MAP domain. In this paper, we propose that MIPv6 and HMIPv6 are adaptively selected in order to minimize signaling cost of network as complementing weak points of MIPv6 and HMIPv6. After supposing by the packet arrival rate for a mobile node is fixed, with this in mind, we find the optimal number of mobile nodes compared the total cost of HMIPv6 with the total cost of MIPv6. Also, if mobile nodes that the MAP is able to manage are full in MAP domain, then a mobile node entering into the MAP domain is provided connection by MIPv6 instead of HMIPv6. In the conclusion, the proposed method of this paper shows that the weak points of MIPv6 and HMIPv6 are removed by adaptive selection each other.", "paper_title": "Adaptive selection of MIPv6 and hierarchical MIPv6 for minimizing signaling cost", "paper_id": "WOS:000237646100064"}