{"auto_keywords": [{"score": 0.00954832464835752, "phrase": "design_decisions"}, {"score": 0.007757522074630727, "phrase": "sequential_way"}, {"score": 0.00481495049065317, "phrase": "general_and_contextual_knowledge"}, {"score": 0.004777214679969785, "phrase": "interactive_aiding_design"}, {"score": 0.004081385289516914, "phrase": "contextual_knowledge"}, {"score": 0.004001828274595483, "phrase": "constraint_filtering"}, {"score": 0.003939296259436904, "phrase": "general_knowledge"}, {"score": 0.003728000957725218, "phrase": "existing_works"}, {"score": 0.0030614565460256897, "phrase": "first_section"}, {"score": 0.002897109710213723, "phrase": "case-based_reasoning"}, {"score": 0.00281826552772148, "phrase": "second_section"}, {"score": 0.002785133616425661, "phrase": "industrial_problem"}, {"score": 0.0026252106881752067, "phrase": "third_section"}, {"score": 0.002426137929553722, "phrase": "fourth_section"}, {"score": 0.0023048904639724438, "phrase": "decision_tools"}, {"score": 0.0022777800735119405, "phrase": "simultaneous_and_iterative_way"}, {"score": 0.0021724831184390192, "phrase": "helicopter_maintenance"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Aiding design", " Constraints satisfaction problem", " Case-based reasoning", " Case-based filtering", " Helicopters maintenance"], "paper_abstract": "The goal of this paper is to show how it is possible to support design decisions with two different tools relying on two kinds of knowledge: case-based reasoning operating with contextual knowledge embodied in past cases and constraint filtering that operates with general knowledge formalized using constraints. Our goals are, firstly to make an overview of existing works that analyses the various ways to associate these two kinds of aiding tools essentially in a sequential way. Secondly, we propose an approach that allows us to use them simultaneously in order to assist design decisions with these two kinds of knowledge. The paper is organized as follows. In the first section, we define the goal of the paper and recall the background of case-based reasoning and constraint filtering. In the second section, the industrial problem which led us to consider these two kinds of knowledge is presented. In the third section, an overview of the various possibilities of using these two aiding decision tools in a sequential way is drawn up. In the fourth section, we propose an approach that allows us to use both aiding decision tools in a simultaneous and iterative way according to the availability of knowledge. An example dealing with helicopter maintenance illustrates our proposals. (C) 2011 Elsevier Ltd. All rights reserved.", "paper_title": "How to take into account general and contextual knowledge for interactive aiding design: Towards the coupling of CSP and CBR approaches", "paper_id": "WOS:000299714700004"}