{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "student-driven_constructing"}, {"score": 0.004503525064934708, "phrase": "promising_area"}, {"score": 0.004334657104697421, "phrase": "students'_control"}, {"score": 0.004272969980602508, "phrase": "entire_learning_process"}, {"score": 0.00409310463335204, "phrase": "essential_objective"}, {"score": 0.0031018195951638882, "phrase": "enhanced_learning_activities"}, {"score": 0.0029711052657054463, "phrase": "design-based_research"}, {"score": 0.002887028262617443, "phrase": "first_grade_class"}, {"score": 0.002845883666777154, "phrase": "secondary_school"}, {"score": 0.002805339241843048, "phrase": "netherlands"}, {"score": 0.002512926336312949, "phrase": "students'_engagement"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Web 2.0", " Personal learning environments", " Student's control", " Personalizing learning", " Self-regulated learning"], "paper_abstract": "Web 2.0 Personal Learning Environments (PLEs) are becoming a promising area of development in eLearning. While enhancing students' control over the entire learning process including constructing learning environment appears to be an essential objective of introducing Web 2.0 PLEs to education, there is little consensus on how to attain this objective. In this paper a theory-informed model to facilitate students' engagement in constructing their learning environment using Web 2.0 PLEs is proposed and evaluated. The model consists of four components: student's control dimensions, studentcentric instructional approaches, the learning potential of Web 2.0 tools and services, and technology enhanced learning activities. This model is used to conduct a design-based research in the context of a first grade class in a secondary school in the Netherlands consisting of 29 students (18 girls and 11 boys, aged 11-13 year). The results suggest that the model can facilitate students' engagement in constructing their learning environment through influencing communication between teacher and students, involving students in adding tools, resources, and people into their learning environment, and enhancing their feeling of ownership over their learning environment. (C) 2014 Elsevier Ltd. All rights reserved.", "paper_title": "Facilitating student-driven constructing of learning environments using Web 2.0 personal learning environments", "paper_id": "WOS:000347606300022"}