{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "radar_model"}, {"score": 0.013407944255866376, "phrase": "recommendation_systems"}, {"score": 0.004577869668211548, "phrase": "existing_resources"}, {"score": 0.004515252649226697, "phrase": "human_and_technological_contexts"}, {"score": 0.004195418010131832, "phrase": "search_engines"}, {"score": 0.004157058883925715, "phrase": "information_retrieval"}, {"score": 0.004044064541716598, "phrase": "major_solutions"}, {"score": 0.0038447943243941685, "phrase": "description_method"}, {"score": 0.003809628721278519, "phrase": "overall_information"}, {"score": 0.0031991799574455555, "phrase": "information_needs"}, {"score": 0.002945081009084692, "phrase": "users'_needs"}, {"score": 0.00290473242917264, "phrase": "experimental_results"}, {"score": 0.0027614468443073028, "phrase": "data_size"}, {"score": 0.002472822097373027, "phrase": "customer_demands"}, {"score": 0.0023507916951658455, "phrase": "information_filtering"}, {"score": 0.002297327670408112, "phrase": "knowledge-based_systems"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Information seeking", " Information needs", " Information needs radar model", " Information filtering", " Recommendation system"], "paper_abstract": "Information seeking is the act of obtaining information from existing resources in both human and technological contexts, and past studies have applied the behavior of users to determine the user needs. Search engines, information retrieval, and recommendation systems are the major solutions of information seeking. However, these techniques lack a description method for overall information needs and other limitations. Information seeking behavior is related to the content and concepts in content, and this study proposes an information needs radar model, which consists of users, content and concepts to describe information needs. The information seeking architecture based on this model is used to evaluate and obtain information about users' needs. The experimental results indicated that our proposed architecture has stable and better performance irrespective of data size, which demonstrates the applicability and effectiveness of the architecture. Furthermore, the information needs the radar model to be able to satisfy customer demands; it is not only helpful in the development of information filtering, recommendation systems, and knowledge-based systems, but also enhances the reliance and loyalty of users towards the system. (C) 2011 Elsevier Ltd. All rights reserved.", "paper_title": "Enhancement of information seeking using an information needs radar model", "paper_id": "WOS:000303223600012"}