{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "split_deliveries"}, {"score": 0.009696459068085304, "phrase": "inventory_costs"}, {"score": 0.009468112467791398, "phrase": "transportation_costs"}, {"score": 0.004776669953449352, "phrase": "one-warehouse_multi-retailer_distribution_systems"}, {"score": 0.004608121749000898, "phrase": "distribution_system"}, {"score": 0.0044101380740283825, "phrase": "multiple_retailers"}, {"score": 0.004288581530198804, "phrase": "limited_capacity"}, {"score": 0.004220624516321415, "phrase": "distribution_policy"}, {"score": 0.003927848423072668, "phrase": "multiple_vehicle_routes"}, {"score": 0.003758981686762617, "phrase": "inventory_cost"}, {"score": 0.0035544816252832375, "phrase": "direct_shipping"}, {"score": 0.003178147973814818, "phrase": "inventory_routing_problems"}, {"score": 0.003053598205821532, "phrase": "coordination_policies"}, {"score": 0.0028529310661977577, "phrase": "non-linear_programming_model"}, {"score": 0.0027192536281209463, "phrase": "optimal_coordination_policy"}, {"score": 0.0026760974046034854, "phrase": "optimal_solution"}, {"score": 0.0024901940672239806, "phrase": "cost_savings"}, {"score": 0.002363995836370621, "phrase": "computational_experiments"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Logistics", " Physical distribution", " Split delivery", " Coordination", " Inventory", " Operations Research"], "paper_abstract": "In this paper, we consider a distribution system where a warehouse is responsible for replenishing the inventories at multiple retailers by a fleet of vehicles of limited capacity. If a distribution policy of the system involves split deliveries, that is, the inventory of at least one retailer is replenished by using multiple vehicle routes, the coordination of the deliveries can further reduce the inventory cost of the retailer. We consider the coordination where two split deliveries are realized by direct shipping and multiple-stop shipping, respectively. To the best of our knowledge, this kind of coordination was never studied in the literature but can find its application in inventory routing problems. This paper proposes and analyses a class of coordination policies for the split deliveries which can reduce the inventory costs of the retailers without increasing transportation costs. A non-linear programming model is established for formulating the class of polices. Because the optimal coordination policy corresponding to an optimal solution of the model may be hard to find and/or implement, two simple but effective coordination policies are proposed. The inventory cost savings realized by the two policies are evaluated analytically and algorithmically. Our theoretical analysis and computational experiments show that both policies are effective. Under certain conditions, they can save 50% of the inventory costs at the retailers without increasing transportation costs. (C) 2010 Elsevier Ltd. All rights reserved.", "paper_title": "Coordination of split deliveries in one-warehouse multi-retailer distribution systems", "paper_id": "WOS:000287290100011"}