{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "rand_index"}, {"score": 0.00915965952704778, "phrase": "required_number"}, {"score": 0.004583205112737672, "phrase": "effective_method"}, {"score": 0.0044991925146184025, "phrase": "unknown_speech_utterances"}, {"score": 0.004230068512904886, "phrase": "generated_clusters"}, {"score": 0.003808845109556467, "phrase": "clustering_errors"}, {"score": 0.003558830226733501, "phrase": "different_clusters"}, {"score": 0.0034294219963679857, "phrase": "different_speakers"}, {"score": 0.0028494425496120228, "phrase": "true_speaker_population"}, {"score": 0.0026622351303038885, "phrase": "similarity_measures"}, {"score": 0.0025495426598675583, "phrase": "genetic_algorithm"}, {"score": 0.002198084195030656, "phrase": "novel_speaker-clustering_method"}, {"score": 0.0021049977753042253, "phrase": "bayesian_information_criterion"}], "paper_keywords": ["Genetic algorithm", " Rand index", " Speaker clustering"], "paper_abstract": "We propose an effective method for clustering unknown speech utterances based on their associated speakers. The method jointly optimizes the generated clusters and the required number of clusters by estimating and minimizing the Rand index. The metric reflects the Clustering errors that arise when utterances from the same speaker are placed in different clusters; or when utterances from different speakers are placed in the same cluster. One useful characteristic of the Rand index is that its value only reaches the minimum when the number Of Clusters is equal to the size of the true speaker population. We approximate the Rand index by a function of the similarity measures between utterances and then use a genetic algorithm to determine the cluster in which each utterance should be located, such that the function is minimized. Our experiment results show that this novel speaker-clustering method outperforms conventional methods that use the Bayesian information criterion to determine the required number of clusters. (C) 2008 Elsevier Ltd. All rights reserved.", "paper_title": "Evolutionary minimization of the Rand index for speaker clustering", "paper_id": "WOS:000262688400002"}