{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "automatic_structures"}, {"score": 0.043069853910456694, "phrase": "first-order_logic"}, {"score": 0.010313655118237305, "phrase": "game_quantifier"}, {"score": 0.004777214679969785, "phrase": "hierarchical_model_checking_games"}, {"score": 0.004665764181113345, "phrase": "expressive_concept"}, {"score": 0.004556901872357751, "phrase": "model_theory"}, {"score": 0.004521179256835894, "phrase": "descriptive_set_theory"}, {"score": 0.004415675459182871, "phrase": "infinitary_logics"}, {"score": 0.0042452552248398445, "phrase": "computer_science"}, {"score": 0.004178935413340453, "phrase": "program_verification"}, {"score": 0.003954837422946628, "phrase": "infinite_string"}, {"score": 0.003923815926819606, "phrase": "alternating_quantifiers"}, {"score": 0.003742711659195878, "phrase": "extended_logic"}, {"score": 0.003500313767208306, "phrase": "decidable_first-order_theory"}, {"score": 0.0031970796597571367, "phrase": "regular_relations"}, {"score": 0.00292003791296245, "phrase": "atomic_relations"}, {"score": 0.0026148807877309417, "phrase": "game_quantification"}, {"score": 0.002573965014439041, "phrase": "new_type"}, {"score": 0.002553747223995378, "phrase": "combinatorial_games"}, {"score": 0.002533687835358909, "phrase": "multiple_players"}, {"score": 0.002445347925313158, "phrase": "hierarchical_constraint"}, {"score": 0.0023600807990911145, "phrase": "finite_arenas"}, {"score": 0.0021049977753042253, "phrase": "first_model_checking_games"}], "paper_keywords": [""], "paper_abstract": "Game quantification is an expressive concept and has been studied in model theory and descriptive set theory, especially in relation to infinitary logics. Automatic structures on the other hand appear very often in computer science, especially in program verification. We extend first-order logic on structures on words by allowing to use an infinite string of alternating quantifiers on letters of a word, the game quantifier. This extended logic is decidable and preserves regularity on automatic structures, but can be undecidable on other structures even with decidable first-order theory. We show that in the presence of game quantifier any relation that allows to distinguish successors is enough to define all regular relations and therefore the game quantifier is strictly more expressive than first-order logic in such cases. Conversely, if there is an automorphism of atomic relations that swaps some successors then we prove that it can be extended to any relations definable with game quantifier. After investigating it's expressiveness, we use game quantification to introduce a new type of combinatorial games with multiple players and imperfect information exchanged with respect to a hierarchical constraint. It is shown that these games on finite arenas exactly capture the logic with game quantifier when players alternate their moves but are undecidable and not necessarily determined in the other case. In this way we define the first model checking games with finite arenas that can be used for model checking first-order logic on automatic structures.", "paper_title": "Game quantification on automatic structures and hierarchical model checking games", "paper_id": "WOS:000241587300027"}