{"auto_keywords": [{"score": 0.049440303515783095, "phrase": "binary_constant_weight_codes"}, {"score": 0.025952515341326154, "phrase": "undetected_error"}, {"score": 0.00431134077512209, "phrase": "error_detection"}, {"score": 0.0033718991936259038, "phrase": "combinatorial_design_theory"}, {"score": 0.002888488567436329, "phrase": "distance_distributions"}, {"score": 0.002628747284714371, "phrase": "steiner_systems"}, {"score": 0.002392309096757774, "phrase": "xia"}, {"score": 0.0023603127894695156, "phrase": "fu"}, {"score": 0.002328739906091501, "phrase": "jiang"}, {"score": 0.0022821674788641552, "phrase": "ling"}, {"score": 0.002206606452557159, "phrase": "distance_distribution"}, {"score": 0.0021624739899833868, "phrase": "binary_constant_weight_code"}, {"score": 0.0021049977753042253, "phrase": "steiner_system"}], "paper_keywords": ["binary constant weight codes", " distance distribution", " error detection", " probability of undetected error", " Steiner systems", " t-designs"], "paper_abstract": "In this correspondence, we study the probability of undetected error for binary constant weight codes. First, we derive a new lower bound on the probability of undetected error for binary constant weight codes. Next, we show that this bound is tight if and only if the binary constant weight codes are generated from certain t-designs in combinatorial design theory. This means that these binary constant weight codes generated from certain t-designs are uniformly optimal for error detection. Along the way, we determine the distance distributions of such binary constant weight codes. In particular, it is shown that binary constant weight codes generated from Steiner systems are uniformly optimal for error detection. Thus, we prove a conjecture of Xia, Fu, Jiang, and Ling. Furthermore, the distance distribution of a binary constant weight code generated from a Steiner system is determined. Finally, we study the exponent of the probability of undetected error for binary constant weight codes. We derive some bounds on the exponent of the probability of undetected error for binary constant weight codes. These bounds enable us to extend the region in which the exponent of the probability of undetected error is exactly determined.", "paper_title": "A lower bound on the probability of undetected error for binary constant weight codes", "paper_id": "WOS:000240076700028"}