{"auto_keywords": [{"score": 0.04967913398382337, "phrase": "multiple_phylogenetic_trees"}, {"score": 0.04298722796533143, "phrase": "reticulation_nodes"}, {"score": 0.01539702390644665, "phrase": "reticulate_network"}, {"score": 0.014111470139295418, "phrase": "reticulation_number"}, {"score": 0.00481495049065317, "phrase": "reticulate_networks"}, {"score": 0.004281372589330329, "phrase": "n._one"}, {"score": 0.003370287778450475, "phrase": "smallest_reticulation_number"}, {"score": 0.003072807453368781, "phrase": "fast_fixed-parameter_algorithm"}, {"score": 0.00267495669519805, "phrase": "optimal_type-ii_reticulate_network"}, {"score": 0.002543392353000551, "phrase": "first_fixed-parameter_algorithms"}, {"score": 0.0024284701569889113, "phrase": "ansi_c"}, {"score": 0.0023980368333253147, "phrase": "programs_cmpt"}, {"score": 0.002338306897057454, "phrase": "cmpt"}, {"score": 0.002309000874224222, "phrase": "optimal_type"}, {"score": 0.0022420373745572837, "phrase": "maafb"}, {"score": 0.0022139352210982398, "phrase": "better_lower_bounds"}, {"score": 0.0021953959824690316, "phrase": "optimal_type-ii_reticulate_networks"}, {"score": 0.0021407025628134586, "phrase": "previously_best_program"}, {"score": 0.002105049025085678, "phrase": "wu"}], "paper_keywords": ["Phylogenetic trees", " reticulate networks", " lower bounds of reticulate numbers"], "paper_abstract": "A reticulate network N of multiple phylogenetic trees may have nodes with two or more parents (called reticulation nodes). There are two ways to define the reticulation number of N. One way is to define it as the number of reticulation nodes in N [13]; in this case, a reticulate network with the smallest reticulation number is called an optimal type-I reticulate network of the trees. The better way is to define it as the total number of parents of reticulation nodes in N minus the number of reticulation nodes in N [18]; in this case, a reticulate network with the smallest reticulation number is called an optimal type-II reticulate network of the trees. In this paper, we first present a fast fixed-parameter algorithm for constructing one or all optimal type-I reticulate networks of multiple phylogenetic trees. We then use the algorithm together with other ideas to obtain an algorithm for estimating a lower bound on the reticulation number of an optimal type-II reticulate network of the input trees. To our knowledge, these are the first fixed-parameter algorithms for the problems. We have implemented the algorithms in ANSI C, obtaining programs CMPT and MaafB. Our experimental data show that CMPT can construct optimal type-I reticulate networks rapidly and MaafB can compute better lower bounds for optimal type-II reticulate networks within shorter time than the previously best program PIRN designed by Wu [18].", "paper_title": "Algorithms for Reticulate Networks of Multiple Phylogenetic Trees", "paper_id": "WOS:000299560500005"}