{"auto_keywords": [{"score": 0.043891862951523725, "phrase": "information_sensitivity"}, {"score": 0.041443559435410254, "phrase": "information_disclosure"}, {"score": 0.019744239165148923, "phrase": "behavioral_intention"}, {"score": 0.01878593919734863, "phrase": "transaction_intention"}, {"score": 0.009086236239751092, "phrase": "privacy_concern"}, {"score": 0.008640669843316549, "phrase": "protection_intention"}, {"score": 0.00677966840285144, "phrase": "negative_effect"}, {"score": 0.0047057084749407485, "phrase": "information_privacy"}, {"score": 0.004662705558154439, "phrase": "online_marketing_result"}, {"score": 0.004620093797504386, "phrase": "scholars'_research_concern"}, {"score": 0.004494570360108983, "phrase": "current_research_trends"}, {"score": 0.0037060428445111694, "phrase": "online_environment"}, {"score": 0.002825681384008326, "phrase": "significant_effects"}, {"score": 0.0025892330566358503, "phrase": "online_purchasing_environment"}, {"score": 0.0023507916951658455, "phrase": "job_hunting_environment"}, {"score": 0.0021342613107011624, "phrase": "cost-benefit_level"}, {"score": 0.0021049977753042253, "phrase": "information_privacy_concern"}], "paper_keywords": ["Information sensitivity", " Compensation", " Privacy concern", " Behavioral Intention"], "paper_abstract": "The drawbacks of information privacy in online marketing result in scholars' research concern for privacy. Following the current research trends and further extending the limitations from one specific context, this study examines the effects of information sensitivity and compensation on privacy concern and behavioral intention, where behavioral intention has three dimensions including information disclosure, protection intention and transaction intention. In order to simulate the phenomenon in the online environment, a 2x3 experimental design (low or high level of information sensitivity; 5%, 30%, 60% sale discount) and a 2x2 experimental design (low or high level of information sensitivity; low or high level of job-hunting compensation) were implemented and assessed. The results show that privacy concern has a negative effect on information disclosure, but a positive effect on protection intention. The interactions of information sensitivity and compensation have significant effects on information disclosure and transaction intention. Additionally, information sensitivity has a negative effect on information disclosure and transaction intention. In the online purchasing environment, a 30% sales discount performs better than either a 5% or a 60% discount. However, across contexts, services provided in the job hunting environment are more prized by customers than the 30% sale discount. These outcomes imply that marketers should beware of designing at the cost-benefit level to eliminate information privacy concern that reduces behavioral intention.", "paper_title": "The Influence of Information Sensitivity Compensation on Privacy Concern and Behavioral Intention", "paper_id": "WOS:000207989900004"}