{"auto_keywords": [{"score": 0.03179794782857869, "phrase": "planned_routes"}, {"score": 0.009678113358116629, "phrase": "information_adaptation"}, {"score": 0.007450890764763929, "phrase": "ywym"}, {"score": 0.00481495049065317, "phrase": "pervasive_computing"}, {"score": 0.004741167616693272, "phrase": "location-aware_pervasive_games"}, {"score": 0.003562322256892338, "phrase": "location-aware_pervasive_game"}, {"score": 0.0032972747743006603, "phrase": "google_mapsbased_tool"}, {"score": 0.0031968441980848436, "phrase": "predefine_routes"}, {"score": 0.0030994630902300133, "phrase": "self-reporting_method"}, {"score": 0.0026551731045904854, "phrase": "location_properties"}, {"score": 0.0024574537875026656, "phrase": "field_study"}, {"score": 0.00218807532188779, "phrase": "route_predefining"}, {"score": 0.0021544587602892466, "phrase": "self-reporting_methods"}, {"score": 0.0021049977753042253, "phrase": "effective_approach"}], "paper_keywords": [""], "paper_abstract": "With the development of pervasive computing, location-aware pervasive games have proliferated quickly. To counter the inefficiency of information adaptation based on a location and a radius, this article presents the design and implementation of Your Way Your Missions (YWYM), which is a location-aware pervasive game exploiting the routes of players. YWYM provides a Google Mapsbased tool for players to predefine routes, and utilizes self-reporting method to obtain the planned routes of players. By such a design, missions are returned to players in terms of the location properties of missions and the planned routes of players. A field study was conducted to investigate the usage of YWYM, and the results indicate that route predefining and self-reporting methods are an effective approach to obtain the planned routes of players, and information adaptation based on the planned routes of players could help them find missions at any place and any time.", "paper_title": "Your Way Your Missions: A Location-Aware Pervasive Game Exploiting the Routes of Players", "paper_id": "WOS:000315721000005"}