{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "electric_networks"}, {"score": 0.012280915872603972, "phrase": "index_reduction"}, {"score": 0.011284235454885263, "phrase": "physical_properties"}, {"score": 0.010503663480324941, "phrase": "mor_method"}, {"score": 0.008468585388724621, "phrase": "real-life_electric_networks"}, {"score": 0.004752221133109136, "phrase": "purpose_-_model_order_reduction"}, {"score": 0.004690312828133359, "phrase": "mor"}, {"score": 0.004223032986655664, "phrase": "higher_index_differential_algebraic_equations"}, {"score": 0.003852371777780562, "phrase": "-_most_methods"}, {"score": 0.0036553070575015344, "phrase": "higher_dae"}, {"score": 0.0024007585788965655, "phrase": "large_systems"}, {"score": 0.0022480304016499605, "phrase": "higher_index_daes"}, {"score": 0.0021049977753042253, "phrase": "large_system"}], "paper_keywords": ["Differential algebraic equations", " Electric networks", " Projectors"], "paper_abstract": "Purpose - Model order reduction (MOR) has been widely used in the electric networks but little has been done to reduce higher index differential algebraic equations (DAEs). The paper aims to discuss these issues. Design/methodology/approach - Most methods first do an index reduction before reducing a higher DAE but this can lead to a loss of physical properties of the system. Findings - The paper presents a MOR method for DAEs called the index-aware MOR (IMOR) which can reduce a DAE while preserving its physical properties such as the index. The feasibility of this method is tested on real-life electric networks. Originality/value - MOR has been widely used to reduce large systems from electric networks but little has been done to reduce higher index DAEs. Most methods first do an index reduction before reducing a large system of DAEs but this can lead to a loss of physical properties of the system. The paper presents a MOR method for DAEs called the IMOR which can reduce a DAE while preserving its physical properties such as the index. The feasibility of this method is tested on real-life electric networks.", "paper_title": "Index-aware model order reduction: LTI DAEs in electric networks", "paper_id": "WOS:000341713000005"}