{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "narrative_networks"}, {"score": 0.004783607451937166, "phrase": "dynamic_workflow"}, {"score": 0.004584769330512473, "phrase": "current_visual_representations"}, {"score": 0.004554917803750564, "phrase": "organizational_and_technological_processes"}, {"score": 0.004408537640504066, "phrase": "everyday_practices"}, {"score": 0.004225223692701494, "phrase": "potential_areas"}, {"score": 0.004197703302809062, "phrase": "successful_or_problematic_adoption"}, {"score": 0.0041296807537109246, "phrase": "potential_needs"}, {"score": 0.004102780105064226, "phrase": "additional_training"}, {"score": 0.0040099947738626495, "phrase": "qualitative_study"}, {"score": 0.003906510969606783, "phrase": "major_academic_medical_center"}, {"score": 0.003756252137445817, "phrase": "new_comprehensive_hit_system"}, {"score": 0.00370745653128409, "phrase": "qualitative_data_collection_techniques"}, {"score": 0.0035765007029494307, "phrase": "new_system"}, {"score": 0.0035300318844877286, "phrase": "department_heads"}, {"score": 0.003350096243772218, "phrase": "narrative_network_analysis"}, {"score": 0.003285002755070214, "phrase": "exemplar_processes"}, {"score": 0.00320016832003312, "phrase": "narrative_fragments"}, {"score": 0.0031585736196310726, "phrase": "visual_representations"}, {"score": 0.002699551786433577, "phrase": "organizational_routines"}, {"score": 0.0026126405272417783, "phrase": "quality_improvement_outcome_measurement"}, {"score": 0.0025368092524479615, "phrase": "deeper_and_more_nuanced_understanding"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ireland_ltd."}], "paper_keywords": ["Collaborative systems", " Workflow analysis", " Narrative networks"], "paper_abstract": "Objective: The purpose of this paper is to demonstrate how current visual representations of organizational and technological processes do not fully account for the variability present in everyday practices. We further demonstrate how narrative networks can augment these representations to indicate potential areas for successful or problematic adoption of new technologies and potential needs for additional training. Methods: We conducted a qualitative study of the processes and routines at a major academic medical center slated to be supported by the development and installation of a new comprehensive HIT system. We used qualitative data collection techniques including observations of the activities to be supported by the new system and interviews with department heads, researchers, and both clinical and non-clinical staff. We conducted a narrative network analysis of these data by choosing exemplar processes to be modeled, selecting and analyzing narrative fragments, and developing visual representations of the interconnection of these narratives. Results: Narrative networks enable us to view the variety of ways work has been and can be performed in practice, influencing our ability to design for innovation in use. Discussion: Narrative networks are a means for analyzing and visualizing organizational routines in concert with more traditional requirements engineering, workflow modeling, and quality improvement outcome measurement. This type of analysis can support a deeper and more nuanced understanding of how and why certain routines continue to exist, change, or stop entirely. At the same time, it can illuminate areas in which adoption may be slow, more training or communication may be needed, and routines preferred by the leadership are subverted by routines preferred by the staff. (C) 2011 Elsevier Ireland Ltd. All rights reserved.", "paper_title": "Organizational routines, innovation, and flexibility: The application of narrative networks to dynamic workflow", "paper_id": "WOS:000292509100011"}