{"auto_keywords": [{"score": 0.04785517742549244, "phrase": "annotator_agreement"}, {"score": 0.03848384552479911, "phrase": "coder_agreement"}, {"score": 0.00481495049065317, "phrase": "inter-coder_agreement"}, {"score": 0.004625164125506718, "phrase": "recent_discussions"}, {"score": 0.0037273513742154237, "phrase": "first_place"}, {"score": 0.0035934073774126856, "phrase": "annotation_process"}, {"score": 0.003476963781647026, "phrase": "concrete_guidelines"}, {"score": 0.00336428077531883, "phrase": "annotation_projects"}, {"score": 0.0031845067058084583, "phrase": "meta-analytic_investigation"}, {"score": 0.0031267359296488118, "phrase": "agreement_percentages"}, {"score": 0.0027505663559338825, "phrase": "seven_factors"}, {"score": 0.002720505061804933, "phrase": "reported_agreement_values"}, {"score": 0.002622647280008795, "phrase": "coding_scheme"}, {"score": 0.0024642796422450755, "phrase": "annotator_training"}, {"score": 0.002437339565360659, "phrase": "annotation_purpose"}, {"score": 0.0023496433751182162, "phrase": "percentage_agreements"}, {"score": 0.002290135975651888, "phrase": "practical_recommendations"}, {"score": 0.0021439311243100913, "phrase": "theoretical_implications"}, {"score": 0.0021049977753042253, "phrase": "annotation_quality"}], "paper_keywords": [""], "paper_abstract": "Recent discussions of annotator agreement have mostly centered around its calculation and interpretation, and the correct choice of indices. Although these discussions are important, they only consider the \"back-end\" of the story, namely, what to do once the data are collected. Just as important in our opinion is to know how agreement is reached in the first place and what factors influence coder agreement as part of the annotation process or setting, as this knowledge can provide concrete guidelines for the planning and set-up of annotation projects. To investigate whether there are factors that consistently impact annotator agreement we conducted a meta-analytic investigation of annotation studies reporting agreement percentages. Our meta-analysis synthesized factors reported in 96 annotation studies from three domains (word-sense disambiguation, prosodic transcriptions, and phonetic transcriptions) and was based on a total of 346 agreement indices. Our analysis identified seven factors that influence reported agreement values: annotation domain, number of categories in a coding scheme, number of annotators in a project, whether annotators received training, the intensity of annotator training, the annotation purpose, and the method used for the calculation of percentage agreements. Based on our results we develop practical recommendations for the assessment, interpretation, calculation, and reporting of coder agreement. We also briefly discuss theoretical implications for the concept of annotation quality.", "paper_title": "What Determines Inter-Coder Agreement in Manual Annotations? A Meta-Analytic Investigation", "paper_id": "WOS:000298118200004"}