{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "seventh_international_planning_competition"}, {"score": 0.004607139608615063, "phrase": "icaps"}, {"score": 0.00437302709192313, "phrase": "scheduling_community"}, {"score": 0.0041842092128678105, "phrase": "relevant_issues"}, {"score": 0.004035777314816881, "phrase": "evaluation_standards"}, {"score": 0.0036212219870826725, "phrase": "deterministic_part"}, {"score": 0.00328849874768242, "phrase": "generated_results"}, {"score": 0.0032231139180761183, "phrase": "different_perspectives"}, {"score": 0.0030962064913500164, "phrase": "brand_new_track"}, {"score": 0.0029386456078004863, "phrase": "multi-core_processors"}, {"score": 0.0028229071631385634, "phrase": "significant_progress"}, {"score": 0.0027778947555117243, "phrase": "previous_competitions"}, {"score": 0.0025633455664747606, "phrase": "temporal_planners"}, {"score": 0.0024623517958288228, "phrase": "multi-core_track"}, {"score": 0.002182573128803447, "phrase": "different_analysis"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Automated planning", " Planning systems", " International Planning Competition", " Benchmarks for planning", " Experimental evaluation of planning systems"], "paper_abstract": "The International Planning Competition is organized in the context of the International Conference on Automated Planning and Scheduling (ICAPS) and it is considered a reference source for the planning and scheduling community. The competition is typically organized every two years and deals with relevant issues for the community such as the definition of evaluation standards, the publication of benchmarks and the collection and dissemination of data about state-of-the-art planners. This paper focuses on the deterministic part, the longest-running part of the International Planning Competition. The paper describes its format, the participants, the selection of benchmarks and the generated results accompanied with analysis from different perspectives. The paper also examines the results of a brand new track created to explore the potential of planners that exploit the power of multi-core processors. Overall, the results of the competition indicate significant progress with respect to previous competitions, but they also reveal that some issues remain open and need further research, such as the coverage of temporal planners when concurrency is required and the performance in the multi-core track. As a novelty, all the data and the software generated for running the competition have been made publicly available allowing researchers to reproduce the competition and to carry out different analysis of the results. (C) 2015 Elsevier B.V. All rights reserved.", "paper_title": "The deterministic part of the seventh International Planning Competition", "paper_id": "WOS:000353608800004"}