{"auto_keywords": [{"score": 0.044370244020442304, "phrase": "malicious_nodes"}, {"score": 0.00481495049065317, "phrase": "trust-based_reactive_routing_protocols"}, {"score": 0.0045200127552893704, "phrase": "insecure_environments"}, {"score": 0.004204904449336037, "phrase": "different_network_services"}, {"score": 0.004167086373747367, "phrase": "routing_protocols"}, {"score": 0.004055652445791872, "phrase": "binding_force"}, {"score": 0.003929391999210588, "phrase": "common_target"}, {"score": 0.0037898820206470085, "phrase": "secure_routing_protocols"}, {"score": 0.0036224139706218916, "phrase": "cryptographic_algorithms"}, {"score": 0.0031917146566068245, "phrase": "trust-based_routing_protocols"}, {"score": 0.0031203609829058587, "phrase": "secure_routes"}, {"score": 0.002889444701599236, "phrase": "rapid_deployment"}, {"score": 0.0028376361457661415, "phrase": "dynamically_adaptive_operation"}, {"score": 0.0027616550517346066, "phrase": "current_network_situation"}, {"score": 0.002466303439899648, "phrase": "exhaustive_simulations"}, {"score": 0.0023148964315569866, "phrase": "similar_attack"}, {"score": 0.002202469129781332, "phrase": "trust-based_routing_protocol"}, {"score": 0.0021049977753042253, "phrase": "particular_extemporized_environment"}], "paper_keywords": ["trust", " security", " ad hoc", " network", " protocol"], "paper_abstract": "Ad hoc networks, due to their improvised nature, are frequently established in insecure environments and hence become susceptible to attacks. These attacks are launched by participating malicious nodes against different network services. Routing protocols, which act as the binding force in these networks, are a common target of these nodes. A number of secure routing protocols have recently been proposed, which make use of cryptographic algorithms to secure the routes. However, in doing so, these protocols entail a number of prerequisites during both the network establishment and operation phases. In contrast, trust-based routing protocols locate trusted rather than secure routes in the network by observing the sincerity in participation by other nodes. These protocols thus permit rapid deployment along with a dynamically adaptive operation, which conforms with the current network situation. In this paper, we evaluate the performance of three trust-based reactive routing protocols in a network with varying number of malicious nodes. With the help of exhaustive simulations, we demonstrate that the performance of the three protocols varies significantly even under similar attack, traffic, and mobility conditions. However, each trust-based routing protocol has its own peculiar advantage making it suitable for application in a particular extemporized environment.", "paper_title": "Performance comparison of trust-based reactive routing protocols", "paper_id": "WOS:000236770600007"}