{"auto_keywords": [{"score": 0.004494570360108983, "phrase": "diverse_applications"}, {"score": 0.004372442291178139, "phrase": "realistic_analysis"}, {"score": 0.004312622975366676, "phrase": "sensor_power_dissipation"}, {"score": 0.004253618550301311, "phrase": "distributed_network_environments"}, {"score": 0.003809628721278519, "phrase": "power_dissipation_model"}, {"score": 0.0033651019362620866, "phrase": "loss_rate"}, {"score": 0.00327356326590461, "phrase": "neighbor_sensors_density"}, {"score": 0.0032287289440915187, "phrase": "communication_range"}, {"score": 0.0025892330566358503, "phrase": "overall_power_dissipation"}, {"score": 0.0025014259919355453, "phrase": "comprehensive_analysis"}, {"score": 0.0023670716500937667, "phrase": "multi-hop_distributed_networks"}, {"score": 0.0022710523337245337, "phrase": "monte_carlo_simulations"}], "paper_keywords": ["power dissipation", " CSMA/CA", " IEEE 802.15.4", " distributed", " multi-hop"], "paper_abstract": "The involvement of IEEE 802.15.4 Wireless Sensor Networks (WSNs) in diverse applications has made the realistic analysis of sensor power dissipation in distributed network environments an essential research issue. In this paper, we propose and thoroughly analyze a power dissipation model for Carrier Sense Multiple Access/Collision Avoidance (CSMA/CA) based IEEE 802.15.4 distributed multi-hop WSNs. Our model takes the loss rate of frames, neighbor sensors density in communication range of a sensor, number of hops, distance of source to the sink, and density of the network into account. We evaluate the impact of these factors on overall power dissipation. We also perform comprehensive analysis of overheads caused by message routing through multi-hop distributed networks. We validate our proposed model through Monte Carlo simulations. Results show that our power dissipation model is more realistic compared to other proposed models in terms of accuracy and multiplicity of the environments.", "paper_title": "Power Dissipation Analysis of IEEE 802.15.4 Distributed Multi-Hop Wireless Sensor Networks", "paper_id": "WOS:000296673300027"}