{"auto_keywords": [{"score": 0.015626237185549233, "phrase": "decision_trees"}, {"score": 0.01134880170611002, "phrase": "system_continuity"}, {"score": 0.011281016692039412, "phrase": "access_controls"}, {"score": 0.008713768692145006, "phrase": "data_envelopment_analysis"}, {"score": 0.006184645181326565, "phrase": "communication_controls"}, {"score": 0.006147513250936383, "phrase": "dea_model"}, {"score": 0.005177548660515817, "phrase": "financial_firms"}, {"score": 0.004757227624616643, "phrase": "efficiency_analysis"}, {"score": 0.0046578649614541995, "phrase": "appropriate_guidelines"}, {"score": 0.004319566932528865, "phrase": "specific_system_environments"}, {"score": 0.004255996004754209, "phrase": "decision_tree_model"}, {"score": 0.004078923069461593, "phrase": "two-step_process"}, {"score": 0.0038516395289655094, "phrase": "dea"}, {"score": 0.003223208419566199, "phrase": "information_contents"}, {"score": 0.003117890043128058, "phrase": "efficient_firms"}, {"score": 0.0029351141718104725, "phrase": "retail_firms"}, {"score": 0.00291743479583421, "phrase": "information_service_providers"}, {"score": 0.0026326249204932733, "phrase": "descending_order"}, {"score": 0.0024410581599518784, "phrase": "control_system"}, {"score": 0.002156529381840657, "phrase": "controls_assessment"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["B2C applications", " B2C controls", " Data envelopment analysis (DEA)", " Decision trees", " Implementation of B2C applications"], "paper_abstract": "Appropriate guidelines for controls in B2C (business-to-consumer) applications (hereafter B2C controls) should be provided such that these guidelines accomplish efficiency of controls in the context of specific system environments, given that many resources and skills are required for the implementation of such controls. This study uses a two-step process for the assessment of B2C controls, i.e., efficiency analysis and recommendation of controls. First, using a data envelopment analysis (DEA) model, the study analyzes the efficiency of B2C controls installed by three groups of organizations: financial firms, retail firms, and information service providers. The B2C controls are composed of controls for system continuity, access controls, and communication controls. DEA model uses B2C controls as input and three variables of implementation of B2C applications, i.e., volume, sophistication, and information contents as output. Second, decision trees are used to determine efficient firms and generate rules for recommending levels of controls. The results of the investigation of the DEA model indicate that retail firms and information service providers implement B2C controls more efficiently than financial firms do. Controls for system continuity are implemented more efficiently than access controls. In financial firms, controls for system continuity, communication controls, and access controls, in a descending order, are efficiently adopted in B2C applications. Every company can determine its relative level of reduction in each component of controls in order to make the control system efficient. The firms that efficiently implement B2C controls are determined using a decision tree model. The decision tree model is further used to recommend the level of controls and suggest rules for controls recommendation. This suggests the possibility of using decision trees for controls assessment in B2C applications. (C) 2010 Elsevier B.V. All rights reserved.", "paper_title": "Using data envelopment analysis and decision trees for efficiency analysis and recommendation of B2C controls", "paper_id": "WOS:000282138300013"}