{"auto_keywords": [{"score": 0.04643876418254707, "phrase": "vod_services"}, {"score": 0.029243292769131936, "phrase": "different_resource_allocation_strategies"}, {"score": 0.004617949594931096, "phrase": "new_dominant_way"}, {"score": 0.004554082077300675, "phrase": "video_content"}, {"score": 0.0045119929871912405, "phrase": "ip_networks"}, {"score": 0.004247696749118451, "phrase": "video_streaming_systems"}, {"score": 0.003943481134959376, "phrase": "broad_area"}, {"score": 0.00372965096877929, "phrase": "resource_allocation"}, {"score": 0.003610292749660581, "phrase": "real-time_aspect"}, {"score": 0.003336031521101184, "phrase": "static_strategies"}, {"score": 0.00321425262806329, "phrase": "content_demand"}, {"score": 0.0030398432591176357, "phrase": "long_time_period"}, {"score": 0.0028218877037665484, "phrase": "system_capacity"}, {"score": 0.0026440008776012665, "phrase": "run-time_statistical_analysis"}, {"score": 0.0025832180231667853, "phrase": "predicted_content_popularity_pattern"}, {"score": 0.0025474193855847074, "phrase": "key_contribution"}, {"score": 0.002331909406363425, "phrase": "current_time_period"}, {"score": 0.002267708463966758, "phrase": "vod_service_operator"}, {"score": 0.0022052711621931144, "phrase": "resource_allocation_strategies"}, {"score": 0.0021746987512551693, "phrase": "different_performance_objectives"}], "paper_keywords": [""], "paper_abstract": "Video-on-Demand (VoD) systems are rising as a new dominant way to distribute video content over IP networks, although VoD services provisioning comes with its own scalability challenges for service providers. P2P video streaming systems are among the most scalable ways to deliver VoD services. While there has been much research work in the broad area of P2P communications, very limited research has been directed to the issue of resource allocation in P2P streaming systems where the real-time aspect adds another dimension to the problem. Most research work on P2P resource allocation tends to approach the problem with static strategies that do not dynamically adjust to changing content demand (popularity) trends, and fail to outperform over a long time period. In this article we specifically focus on the problem of maximizing the P2P streaming system capacity by effectively alternating between different resource allocation strategies. Switching between different resource allocation strategies is guided by a run-time statistical analysis of performance against a predicted content popularity pattern. A key contribution of this article resides in effectively combining different, and potentially conflicting, performance objectives when deciding which resource allocation strategy to use for the current time period. With our P2P resource allocation framework, a VoD service operator can combine any number of resource allocation strategies and formulate different performance objectives (decision criteria) that meet its requirements.", "paper_title": "A Learning-Based Resource Allocation Approach for P2P Streaming Systems", "paper_id": "WOS:000348385700001"}