{"auto_keywords": [{"score": 0.031981949229212416, "phrase": "ssps"}, {"score": 0.015719616060629854, "phrase": "semi-supervised_pattern_shift"}, {"score": 0.014106437342596527, "phrase": "dr"}, {"score": 0.011291467181349017, "phrase": "retained_dimensionality"}, {"score": 0.0046340196745259694, "phrase": "great_amount"}, {"score": 0.003743102131902864, "phrase": "better_classification_performance"}, {"score": 0.0034102660898135155, "phrase": "real-world_data"}, {"score": 0.0032107911131811057, "phrase": "new_semi-supervised_data_preprocessing_technique"}, {"score": 0.0027239390917424898, "phrase": "new_shifted_pattern_representation"}, {"score": 0.0022980978400845144, "phrase": "shape-preserved_subset_selection_trick"}, {"score": 0.0021049977753042253, "phrase": "classification_application"}], "paper_keywords": ["Dimensionality reduction", " Semi-supervised learning", " Manifold learning", " Classification", " Pattern shift", " Out-of-sample extension"], "paper_abstract": "Recently, a great amount of efforts have been spent in the research of unsupervised and (semi-)supervised dimensionality reduction (DR) techniques, and DR as a preprocessor is widely applied into classification learning in practice. However, on the one hand, many DR approaches cannot necessarily lead to a better classification performance. On the other hand, DR often suffers from the problem of estimation of retained dimensionality for real-world data. Alternatively, in this paper, we propose a new semi-supervised data preprocessing technique, named semi-supervised pattern shift (SSPS). The advantages of SSPS lie in the fact that not only the estimation of retained dimensionality can be avoided naturally, but a new shifted pattern representation that may be more favorable to classification is obtained as well. As a further extension of SSPS, we develop its fast and out-of-sample versions respectively, both of which are based on a shape-preserved subset selection trick. The final experimental results demonstrate that the proposed SSPS is promising and effective in classification application.", "paper_title": "SSPS: A Semi-Supervised Pattern Shift for Classification", "paper_id": "WOS:000278096200005"}