{"auto_keywords": [{"score": 0.04876112166657545, "phrase": "unbiased_black-box_complexities"}, {"score": 0.011092173073559584, "phrase": "extreme_jump_function"}, {"score": 0.00481495049065317, "phrase": "jump_functions"}, {"score": 0.004378958522416482, "phrase": "optimal_solution"}, {"score": 0.004141093507753515, "phrase": "jump_size"}, {"score": 0.0034824716857663114, "phrase": "simple_onemax_function"}, {"score": 0.0027690086059100495, "phrase": "almost_the_whole_search_space"}, {"score": 0.002603758927691463, "phrase": "constant_fitness"}, {"score": 0.002475898613632249, "phrase": "new_tools"}, {"score": 0.0023151088048303705, "phrase": "new_parent_individual"}, {"score": 0.0022013916728990564, "phrase": "competing_search_points"}], "paper_keywords": ["Black-box complexity", " theory", " runtime analysis"], "paper_abstract": "We analyze the unbiased black-box complexities of jump functions with small, medium, and large sizes of the fitness plateau surrounding the optimal solution. Among other results, we show that when the jump size is , that is, when only a small constant fraction of the fitness values is visible, then the unbiased black-box complexities for arities 3 and higher are of the same order as those for the simple OneMax function. Even for the extreme jump function, in which all but the two fitness values and n are blanked out, polynomial time mutation-based (i.e., unary unbiased) black-box optimization algorithms exist. This is quite surprising given that for the extreme jump function almost the whole search space (all but a fraction) is a plateau of constant fitness. To prove these results, we introduce new tools for the analysis of unbiased black-box complexities, for example, selecting the new parent individual not only by comparing the fitnesses of the competing search points but also by taking into account the (empirical) expected fitnesses of their offspring.", "paper_title": "Unbiased Black-Box Complexities of Jump Functions", "paper_id": "WOS:000367333600007"}