{"auto_keywords": [{"score": 0.03856990221719121, "phrase": "homologous_sequences"}, {"score": 0.015719716506582538, "phrase": "structurally_conserved_regions"}, {"score": 0.010546699884769814, "phrase": "sci"}, {"score": 0.009325971077234615, "phrase": "single_structure"}, {"score": 0.0047810714349158165, "phrase": "protein_superfamilies"}, {"score": 0.004664352260912174, "phrase": "homologous_proteins"}, {"score": 0.004315670715009727, "phrase": "highly_divergent_protein_families"}, {"score": 0.003992950134435965, "phrase": "structurally_equivalent_positions"}, {"score": 0.00388165472334023, "phrase": "multiple_homologous_structures"}, {"score": 0.0035408501923902477, "phrase": "accurate_scr_predictions"}, {"score": 0.003503497128638099, "phrase": "homology_modelling"}, {"score": 0.003478813491904962, "phrase": "sequence_alignment"}, {"score": 0.003417859963947459, "phrase": "pairwise_dalilite_alignments"}, {"score": 0.0033579708256295847, "phrase": "homologous_structures"}, {"score": 0.0032991276152705934, "phrase": "simple_measure"}, {"score": 0.003275879115801376, "phrase": "structural_conservation"}, {"score": 0.003241312187060814, "phrase": "structural_conservation_index"}, {"score": 0.0029670381308395505, "phrase": "artificial_neural_networks"}, {"score": 0.002530359917257626, "phrase": "structural_features"}, {"score": 0.002433761463735023, "phrase": "matthews"}, {"score": 0.0023079225317714793, "phrase": "multiple_structures"}, {"score": 0.0021350169717509714, "phrase": "worst_predictions"}, {"score": 0.0021049977753042253, "phrase": "scr_definitions"}], "paper_keywords": [""], "paper_abstract": "Motivation: The structures of homologous proteins are generally better conserved than their sequences. This phenomenon is demonstrated by the prevalence of structurally conserved regions (SCRs) even in highly divergent protein families. Defining SCRs requires the comparison of two or more homologous structures and is affected by their availability and divergence, and our ability to deduce structurally equivalent positions among them. In the absence of multiple homologous structures, it is necessary to predict SCRs of a protein using information from only a set of homologous sequences and (if available) a single structure. Accurate SCR predictions can benefit homology modelling and sequence alignment. Results: Using pairwise DaliLite alignments among a set of homologous structures, we devised a simple measure of structural conservation, termed structural conservation index (SCI). SCI was used to distinguish SCRs from non-SCRs. A database of SCRs was compiled from 386 SCOP superfamilies containing 6489 protein domains. Artificial neural networks were then trained to predict SCRs with various features deduced from a single structure and homologous sequences. Assessment of the predictions via a 5-fold cross-validation method revealed that predictions based on features derived from a single structure perform similarly to ones based on homologous sequences, while combining sequence and structural features was optimal in terms of accuracy (0.755) and Matthews correlation coefficient (0.476). These results suggest that even without information from multiple structures, it is still possible to effectively predict SCRs for a protein. Finally, inspection of the structures with the worst predictions pinpoints difficulties in SCR definitions.", "paper_title": "Defining and predicting structurally conserved regions in protein superfamilies", "paper_id": "WOS:000313722800004"}