{"auto_keywords": [{"score": 0.047112807253698846, "phrase": "wardrop"}, {"score": 0.00481495049065317, "phrase": "wardrop_equilibria"}, {"score": 0.004626553103375699, "phrase": "well-known_game"}, {"score": 0.0044277810648955624, "phrase": "single-commodity_networks"}, {"score": 0.004322967486451877, "phrase": "unit_demand_flow"}, {"score": 0.0037740295668681014, "phrase": "linear_latency_functions"}, {"score": 0.0032814236411444022, "phrase": "general_latency_functions"}, {"score": 0.0032423089921154503, "phrase": "flow_increase"}, {"score": 0.003005151718290603, "phrase": "polynomial_latency_functions"}, {"score": 0.002933915104498416, "phrase": "nonnegative_coefficients"}, {"score": 0.0028302049070944944, "phrase": "relative_increase"}, {"score": 0.0025918235228843444, "phrase": "equilibrium_increases"}, {"score": 0.0022352169832099153, "phrase": "multi-commodity_case"}, {"score": 0.0021561514733516676, "phrase": "edge_flows"}, {"score": 0.0021049977753042253, "phrase": "path_latency"}], "paper_keywords": ["Wardrop equilibria", " Selfish routing", " Sensitivity analysis"], "paper_abstract": "We study the sensitivity of equilibria in the well-known game theoretic traffic model due to Wardrop. We mostly consider single-commodity networks. Suppose, given a unit demand flow atWardrop equilibrium, one increases the demand by epsilon or removes an edge carrying only an epsilon-fraction of flow. We study how the equilibrium responds to such an epsilon-change. Our first surprising finding is that, even for linear latency functions, for every epsilon > 0, there are networks in which an epsilon-change causes every agent to change its path in order to recover equilibrium. Nevertheless, we can prove that, for general latency functions, the flow increase or decrease on every edge is at most epsilon. Examining the latency at equilibrium, we concentrate on polynomial latency functions of degree at most p with nonnegative coefficients. We show that, even though the relative increase in the latency of an edge due to an epsilon-change in the demand can be unbounded, the path latency at equilibrium increases at most by a factor of (1 + epsilon)(p). The increase of the price of anarchy is shown to be upper bounded by the same factor. Let us remark that all our bounds are tight. For the multi-commodity case, we present examples showing that neither the change in edge flows nor the change in the path latency can be bounded.", "paper_title": "Sensitivity of Wardrop Equilibria", "paper_id": "WOS:000276746800002"}