{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "virtual_community"}, {"score": 0.03128898671324496, "phrase": "sovc"}, {"score": 0.013655190443524971, "phrase": "knowledge-contribution_intention"}, {"score": 0.004204904449336037, "phrase": "members'_attitude_formation"}, {"score": 0.003929391999210588, "phrase": "peer-to-peer_problem"}, {"score": 0.003772793879444995, "phrase": "well-known_professional_it_vc"}, {"score": 0.00374732247495479, "phrase": "taiwan"}, {"score": 0.0036224139706218916, "phrase": "data_collection"}, {"score": 0.003585761649472705, "phrase": "online_survey"}, {"score": 0.003305540152273746, "phrase": "partial_least_squares"}, {"score": 0.0032170707904803125, "phrase": "research_model"}, {"score": 0.003141598480804135, "phrase": "members'_attitudes"}, {"score": 0.0029355502535757696, "phrase": "full_mediating_roles"}, {"score": 0.002771040606604632, "phrase": "pleasant_experiences"}, {"score": 0.002678598911294797, "phrase": "higher_sovc."}, {"score": 0.0025892330566358503, "phrase": "it-related_issues"}, {"score": 0.0024029583021102255, "phrase": "new_it_products"}, {"score": 0.0022452462028184654, "phrase": "members'_experiences"}, {"score": 0.0022300545742463262, "phrase": "knowledge-contribution_behavior"}, {"score": 0.0022074592164608134, "phrase": "mediating_role"}, {"score": 0.0021049977753042253, "phrase": "online_knowledge-contribution_behavior"}], "paper_keywords": ["Virtual communities", " Uses and gratification theory", " Experiential marketing", " Sense of virtual community", " Knowledge contribution", " Marketing", " Information technology", " Taiwan"], "paper_abstract": "Purpose - The aim of this paper is to employ the perspectives of uses and gratification theory and experiential marketing to investigate the antecedents of virtual community (VC) members' attitude formation and knowledge-contribution intention through the sense of virtual community (SOVC) and the interaction between their motivations and experiences in a peer-to-peer problem solving (P3) VC. Design/methodology/approach - This study chose a well-known professional IT VC in Taiwan, the ITHelp community, as the target for data collection. An online survey linked from the homepage of this community was used through the cooperation of the vendor of this community. This study employs the partial least squares (PIS) method to examine the research model. Findings The results show that members' attitudes toward their VCs are determined by the interaction between their motivations for and experiences with P3 VC usages. Moreover, SOVC plays full mediating roles in the relationship between attitude toward P3 VC and knowledge-contribution intention. Research limitations/implications - VC managers need to aim at creating pleasant experiences for their members and foster their belongingness and consciousness to form higher SOVC. The conclusions are restricted to a VC that involves IT-related issues, which focuses problem solving rather than being socially oriented. Members of IT P3 VCs are usually highly innovative and enthusiastic about new IT products, which is quite different from the membership of other P3 VCs. Originality/value - Extant studies seldom considered the effects of SOVC and members' experiences on knowledge-contribution behavior. The mediating role of SOVC and the interaction between motivations and experience can enhance our understanding about online knowledge-contribution behavior.", "paper_title": "Sense of virtual community and knowledge contribution in a P3 virtual community Motivation and experience", "paper_id": "WOS:000315014600001"}