{"auto_keywords": [{"score": 0.033413566842277836, "phrase": "cooperation_strategy"}, {"score": 0.00481495049065317, "phrase": "commercial_wireless_networks"}, {"score": 0.0046834372388970405, "phrase": "large-scale_cooperation"}, {"score": 0.004270347498153512, "phrase": "judicious_resource_allocation_strategies"}, {"score": 0.004172874316207784, "phrase": "individuals'_payoffs"}, {"score": 0.003929689573550262, "phrase": "resource_allocation_strategies"}, {"score": 0.003312121699003206, "phrase": "resource_allocation_problem"}, {"score": 0.0032665093519968083, "phrase": "nontransferable_payoff_coalitional_game"}, {"score": 0.0029642838574678526, "phrase": "grand_coalition"}, {"score": 0.002765636101369536, "phrase": "corresponding_payoffs"}, {"score": 0.0026284507395498897, "phrase": "exchange_market"}, {"score": 0.002204697943520258, "phrase": "coalitional_game"}, {"score": 0.0021049977753042253, "phrase": "nonempty_core"}], "paper_keywords": ["Coalitional games", " core", " market equilibrium", " nontransferable utility", " wireless networks"], "paper_abstract": "Efficacy of commercial wireless networks can be substantially enhanced through large-scale cooperation among involved entities such as providers and customers. The success of such cooperation is contingent upon the design of judicious resource allocation strategies that ensure that the individuals' payoffs are commensurate to the resources they offer to the coalition. The resource allocation strategies depend on which entities are decision-makers and whether and how they share their aggregate payoffs. Initially, we consider the scenario where the providers are the only decision-makers and they do not share their payoffs. We formulate the resource allocation problem as a nontransferable payoff coalitional game and show that there exists a cooperation strategy that leaves no incentive for any subset of providers to split from the grand coalition, i.e., the core of the game is nonempty. To compute this cooperation strategy and the corresponding payoffs, we subsequently relate this game and its core to an exchange market setting and its equilibrium, which can be computed by several efficient algorithms. Next, we investigate cooperation when customers are also decision-makers and decide which provider to subscribe to based on whether there is cooperation. We formulate a coalitional game in this setting and show that it has a nonempty core. Finally, we extend the formulations and results to the cases where the payoffs are vectors and can be shared selectively.", "paper_title": "Provider-Customer Coalitional Games", "paper_id": "WOS:000296014000022"}