{"auto_keywords": [{"score": 0.036328854990883626, "phrase": "parasitic_capacitance"}, {"score": 0.033019062019376495, "phrase": "design_guidelines"}, {"score": 0.02528407123133551, "phrase": "measurement_results"}, {"score": 0.00481495049065317, "phrase": "cmos_lc_oscillators"}, {"score": 0.004558564684763264, "phrase": "flicker_noise_upconversion_mechanisms"}, {"score": 0.0040192915527630995, "phrase": "dominant_one"}, {"score": 0.003602302241898501, "phrase": "systematic_simulation_method"}, {"score": 0.0033916328188225843, "phrase": "dominant_factor"}, {"score": 0.00319324425647735, "phrase": "small_dimension"}, {"score": 0.0030899524399043863, "phrase": "sizing_devices"}, {"score": 0.002861708609922034, "phrase": "suppression_techniques"}, {"score": 0.0024410093024417527, "phrase": "switch_pair_fets"}, {"score": 0.0024011766029754006, "phrase": "fair_comparison"}, {"score": 0.0023107372754933887, "phrase": "dominant_role"}], "paper_keywords": ["Oscillator", " VCO", " Device sizing", " Flicker noise", " 1/f noise", " Phase noise"], "paper_abstract": "Flicker noise upconversion mechanisms in oscillators have been acquired in the literature, however their relative weights are still under investigation. It is desirable to find the dominant one, since a certain noise suppression method reduces one mechanism but may increase another. In this work, we propose a systematic simulation method to distinguish their relative impacts. The outcome indicates parasitic capacitance is the dominant factor for both tail 1/f noise and switch pair 1/f noise upconversions, implying to use small dimension core devices. Design guidelines on sizing devices are presented and two suppression techniques are compared. Two voltage-controlled oscillators (VCOs) with these suppression techniques are fabricated in a 0.18 mu m CMOS process, allowing us to compare their performance. The two VCOs can be Focused-Ion-Beam (FIB) trimmed to change the width of switch pair FETs. The fair comparison of measurement results among them verify the dominant role of parasitic capacitance in 1/f noise upconversion. The measurement results also confirm the design guidelines and demonstrate the difference of two suppression methods.", "paper_title": "Flicker noise conversion in CMOS LC oscillators: capacitance modulation dominance and core device sizing", "paper_id": "WOS:000292649900002"}