{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "homogeneous_robots"}, {"score": 0.04913322770523618, "phrase": "collective_robotics"}, {"score": 0.04025730781495741, "phrase": "communicative_interactions"}, {"score": 0.004645057834614705, "phrase": "increasing_interest"}, {"score": 0.004535124351828787, "phrase": "vast_majority"}, {"score": 0.0044101380740283825, "phrase": "interacting_robots"}, {"score": 0.0041703614123283165, "phrase": "collaborating_robots"}, {"score": 0.004120694410890683, "phrase": "different_robots"}, {"score": 0.004087910779160781, "phrase": "different_roles"}, {"score": 0.0032814236411444022, "phrase": "evolved_solutions"}, {"score": 0.0030292784088033838, "phrase": "behavioural_analyses"}, {"score": 0.002957471572421436, "phrase": "control_condition"}, {"score": 0.0028076592725295646, "phrase": "co-adapting_communicative_and_non-communicative_behaviours"}, {"score": 0.0024703502756471514, "phrase": "role-allocation_tasks"}, {"score": 0.0024408799645640323, "phrase": "general_idea"}, {"score": 0.0021821915946356168, "phrase": "non-communicative_collaborative_behaviours"}, {"score": 0.0021049977753042253, "phrase": "homogeneous_individuals"}], "paper_keywords": ["Evolutionary robotics", " Dynamic role allocation", " Neural controllers"], "paper_abstract": "The field of collective robotics has been raising increasing interest in the last few years. In the vast majority of works devoted to collective robotics all interacting robots play always the same function, while less attention has been paid to groups of collaborating robots in which different robots play different roles. In this paper we evolve a population of homogeneous robots for dynamically allocating roles through communicative interactions. In particular, we focus on the development of a team of robots in which one and only one individual (the 'leader') must differentiate its communicative behaviour from that of all the others ('non-leaders'). Evolved solutions prove to be very robust with respect to changes in the size of the group. Furthermore, both behavioural analyses and a comparison with a control condition in which robots are not allowed to move demonstrate the importance of co-adapting communicative and non-communicative behaviours, and, in particular, of being allowed to dynamically change the topology of communicative interactions. Finally, we show how the same method can be used for solving other kinds of role-allocation tasks. The general idea proposed in this paper might be used in the future for evolving general, robust, and scalable role differentiation mechanisms which can be exploited to develop non-communicative collaborative behaviours that require specialisation of roles within groups of homogeneous individuals.", "paper_title": "Communication based dynamic role allocation in a group of homogeneous robots", "paper_id": "WOS:000341089700010"}