{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "inference_attacks"}, {"score": 0.049558064870310475, "phrase": "xml_databases"}, {"score": 0.014182695148174112, "phrase": "security_definition"}, {"score": 0.004041359131062721, "phrase": "integer_k"}, {"score": 0.0035630518377071916, "phrase": "sensitive_information"}, {"score": 0.003264010423431402, "phrase": "schema_information"}, {"score": 0.003175792987190499, "phrase": "xml_query_model"}, {"score": 0.0029091587159002503, "phrase": "query_model"}, {"score": 0.002861708609922034, "phrase": "practical_queries"}, {"score": 0.0024951467586005094, "phrase": "verification_method"}, {"score": 0.0023362245884046176, "phrase": "arbitrarily_recursive_element"}, {"score": 0.0021049977753042253, "phrase": "space_efficiency"}], "paper_keywords": ["XML database", " inference attack", " security", " verification"], "paper_abstract": "This paper discusses verification of the security against inference attacks on XML databases. First, a security definition called k-secrecy against inference attacks on XML databases is proposed. k-secrecy with an integer k > 1 (or k = infinity) means that attackers cannot narrow down the candidates for the value of the sensitive information to k - 1 (or finite), using the results of given authorized queries and schema information. Secondly, an XML query model such that verification can be performed straightforwardly according to the security definition is presented. The query model can represent practical queries which extract some nodes according to any of their neighboring nodes such as ancestors, descendants, and siblings. Thirdly. another refinement of the verification method is presented, which produces much smaller intermediate results if a schema contains no arbitrarily recursive element. The correctness of the refinement is proved, and the effect of the refinement in time and space efficiency has been confirmed by experiment.", "paper_title": "Verification of the Security against Inference Attacks on XML Databases", "paper_id": "WOS:000266425700028"}