{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "e-government_portals"}, {"score": 0.014119170396981774, "phrase": "km_mechanisms"}, {"score": 0.007077527881585957, "phrase": "evaluation_model"}, {"score": 0.0065300809516462095, "phrase": "k-act"}, {"score": 0.0050992771935919, "phrase": "asian_and_north_american_regions"}, {"score": 0.004788238020778755, "phrase": "purpose_-_knowledge_management"}, {"score": 0.004708982310710893, "phrase": "important_consideration"}, {"score": 0.0044914449177247545, "phrase": "crucial_aspect"}, {"score": 0.0041895834447883374, "phrase": "appropriate_km_mechanisms"}, {"score": 0.0038218468784009035, "phrase": "main_km_mechanisms"}, {"score": 0.0036655006236908823, "phrase": "knowledge_access"}, {"score": 0.0030840850263807204, "phrase": "information_science"}, {"score": 0.002957829935033334, "phrase": "km_implementation"}, {"score": 0.002601897907208719, "phrase": "km"}, {"score": 0.002530359917257626, "phrase": "significant_differences"}, {"score": 0.002413222714874815, "phrase": "potential_areas"}, {"score": 0.0023731849094845475, "phrase": "k-act_model"}, {"score": 0.0023403267768308286, "phrase": "present_work"}, {"score": 0.0022507188208913394, "phrase": "km_implementation_gaps"}, {"score": 0.0021049977753042253, "phrase": "km_processes"}], "paper_keywords": ["knowledge management", " knowledge creation", " knowledge transfer", " online operations", " government"], "paper_abstract": "Purpose - Knowledge management (KM) is an important consideration in e-government portals to ensure that knowledge flows efficiently between governments, individuals and organisations. A crucial aspect of e-government portals that has not been addressed adequately is the extent to which KM mechanisms have been implemented. Specifically, the authors argue that appropriate KM mechanisms are necessary to support the access, creation and transfer of knowledge between these portals and their users. The paper aims to propose an evaluation model for this purpose by first defining the main KM mechanisms and then burrowing deeper into their constituent dimensions. Design/methodology/approach - An evaluation model known as knowledge access, creation and transfer (K-ACT) is presented which identifies three KM mechanisms for portals: knowledge access, creation and transfer. Each mechanism is characterised by a set of dimensions and sub-dimensions representing the tools and features for supporting that mechanism. The model was derived from an analysis of the literature and validated by two independent reviewers who were trained in information science, were familiar with the objectives of the project and understood the concepts underlying KM implementation in portals. Using this model, a checklist was developed and applied to 60 e-government portals in the Asian and North American regions to investigate the extent to which these KM mechanisms have been implemented. Findings - The findings indicate that, on average, e-government portals featured only about 36 per cent of the KM mechanisms described in the model. Furthermore, no significant differences in the implementation of the KM mechanisms were found between the two regions' portals. The evaluation also offered potential areas for improvement based on the K-ACT model. Originality/value - The present work has developed an evaluation model known as K-ACT which can be used to assess KM implementation gaps in e-government portals. This model can also be generalised to other types of portals. The evaluation also provides insights into the state of KM processes in the portals of the Asian and North American regions.", "paper_title": "Knowledge access, creation and transfer in e-government portals", "paper_id": "WOS:000258171200004"}