{"auto_keywords": [{"score": 0.03883386896303636, "phrase": "overlay_network"}, {"score": 0.03481146599948752, "phrase": "origin_servers"}, {"score": 0.00481495049065317, "phrase": "microeconomic_allocation_of_resources"}, {"score": 0.0047810714349158165, "phrase": "multi-service_overlay_networks"}, {"score": 0.0047306971679760175, "phrase": "main_challenge"}, {"score": 0.004631527916092452, "phrase": "self-organizing_mechanisms"}, {"score": 0.004502513902377422, "phrase": "inherent_selfishness"}, {"score": 0.004455061431809975, "phrase": "end-user_nodes"}, {"score": 0.004377077848734575, "phrase": "aggregate_outcome"}, {"score": 0.004300453431933622, "phrase": "individual_nodes"}, {"score": 0.004151188559520802, "phrase": "network's_aggregate_utility"}, {"score": 0.004064117897000019, "phrase": "microeconomic_theory"}, {"score": 0.004021267064832957, "phrase": "good_candidate"}, {"score": 0.003813669883040509, "phrase": "selfish_utility_maximizer"}, {"score": 0.0034911335714333507, "phrase": "competitive_economical_framework"}, {"score": 0.003417859963947459, "phrase": "independent_services"}, {"score": 0.003264316172836322, "phrase": "offered_service"}, {"score": 0.002485983124803852, "phrase": "general_equilibrium"}, {"score": 0.0021964260012913403, "phrase": "pareto"}, {"score": 0.0021050313179919802, "phrase": "doi"}], "paper_keywords": [""], "paper_abstract": "The main challenge in overlay multicasting is designing self-organizing mechanisms that can be able to exploit the inherent selfishness of the end-user nodes in such a way that the aggregate outcome of the activity of individual nodes behaving toward their own self-interests still leads to maximization of the network's aggregate utility. We believe that the microeconomic theory is a good candidate to investigate this problem. Since each consumer in the economy acts as a selfish utility maximizer, the behavior of each end-host in the overlay network can be mapped to that of a consumer in the economy. We present a competitive economical framework in which a number of independent services are provided to the users by a number of origin servers. Each offered service can be thought of as a good and the origin servers and the users who relay the service to their downstream nodes can thus be thought of as firms of the economy. Also, the end-hosts can be viewed as consumers in the economy. On joining to the overlay network, each end-host is provided with an income and tries to obtain the services. The mechanism tries to regulate the price of each service in such a way that general equilibrium holds. For this property to hold in all generality, it tries to find a vector of prices such that demand of each service becomes equal to its supply. So, all allocations will be Pareto optimal in the sense that maximize welfare of the users. DOI: 10.1134/S1064230711050030", "paper_title": "Toward Microeconomic Allocation of Resources in Multi-Service Overlay Networks", "paper_id": "WOS:000297457800006"}