{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "subset_sum_problem"}, {"score": 0.016820466724844257, "phrase": "l_smallest_k-subsets_sum_problem"}, {"score": 0.010467296054447172, "phrase": "finite-time_convergent_recurrent_neural_network"}, {"score": 0.004309968592440261, "phrase": "l_subsets"}, {"score": 0.0042506731642425275, "phrase": "subset_elements"}, {"score": 0.0041154571996523505, "phrase": "possible_subsets"}, {"score": 0.003929689573550262, "phrase": "real_world"}, {"score": 0.0036496814103475174, "phrase": "novel_algorithm"}, {"score": 0.0030056887638095883, "phrase": "k_distinct_elements"}, {"score": 0.0029780219173522115, "phrase": "s._obviously"}, {"score": 0.002714943351733626, "phrase": "l_shortest_loopless_paths"}, {"score": 0.0026163210719740847, "phrase": "l_shortest_paths_algorithm"}, {"score": 0.0022563011263787847, "phrase": "experimental_results"}, {"score": 0.0022149235007885826, "phrase": "proposed_algorithm"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Subset sum problem", " L smallest k-subsets sum problem", " L shortest paths", " Convergence in finite time", " Recurrent neural network"], "paper_abstract": "For a given set S of n real numbers, there are totally 2(n) - 1 different subsets excluding the empty set. The subset sum problem is defined as finding L subsets whose summation of subset elements are the L smallest among all possible subsets. This problem has many applications in operations research and real world. However, the problem is very computationally challenging. In this paper, a novel algorithm is proposed to solve this problem. Firstly, the L smallest k-subsets sum problem, a special case and sub-problem of the subset sum problem, is investigated. Given a positive integer k (k <= n), k-subset means the subset of k distinct elements of S. Obviously, there are totally (7,) k-subsets. By expressing all these k-subsets with a network, the L smallest k-subsets sum problem is converted to finding L shortest loopless paths in this network. By combining the L shortest paths algorithm and the finite-time convergent recurrent neural network, a new algorithm for the L smallest k-subsets sum problem is developed. Finally, the solution to the subset sum problem is obtained by combining the solutions to these sub-problems. And experimental results show that the proposed algorithm is very effective and efficient. (C) 2014 Elsevier B.V. All rights reserved.", "paper_title": "An efficient algorithm for the subset sum problem based on finite-time convergent recurrent neural network", "paper_id": "WOS:000360028800003"}