{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "dft"}, {"score": 0.004743164872278112, "phrase": "addition_reaction"}, {"score": 0.004695900553353526, "phrase": "fragment_ion"}, {"score": 0.004399905285945236, "phrase": "theoretical_study"}, {"score": 0.004060986196931943, "phrase": "addition_reaction_mechanism"}, {"score": 0.0038431888954930083, "phrase": "electronic_properties"}, {"score": 0.0036007478932719417, "phrase": "particular_electronic_transfer"}, {"score": 0.0033735490732324713, "phrase": "methylene_group_results"}, {"score": 0.0031765314093444956, "phrase": "fullerene_bond"}, {"score": 0.002873331232538783, "phrase": "dynamic_semi-classical_born-oppenheimer_approximation"}, {"score": 0.0027741761880779535, "phrase": "different_speeds"}, {"score": 0.0022022878843247257, "phrase": "functional_correlation"}], "paper_keywords": ["Addition reaction", " Density functional theory", " Fullerene", " Molecular dynamic"], "paper_abstract": "The theoretical study of the interaction between CH2 and fullerene (C-60) suggests the existence of an addition reaction mechanism; this feature is studied by applying an analysis of electronic properties. Several different effects are evident in this interaction as a consequence of the particular electronic transfer which occurs during the procedure. The addition or insertion of the methylene group results in a process, where the inclusion of CH2 into a fullerene bond produces the formation of several geometric deformations. A simulation of these procedures was carried out, taking advantage of the dynamic semi-classical Born-Oppenheimer approximation. Dynamic aspects were analyzed at different speeds, for the interaction between the CH2 group and the two bonds: CC (6, 6) and CC (6, 5) respectively on the fullerene (C-60) rings. All calculations which involved electrons employed DFT as well as exchange and functional correlation. The results indicate a tendency for the CH2 fragment to attack the CC (6, 5) bond.", "paper_title": "A DFT study of addition reaction between fragment ion (CH2) units and fullerene (C-60) molecule", "paper_id": "WOS:000290577000013"}