{"auto_keywords": [{"score": 0.034526216484340136, "phrase": "sparcl"}, {"score": 0.012179617962260688, "phrase": "time_complexity"}, {"score": 0.00481495049065317, "phrase": "arbitrary_shape-based_clusters"}, {"score": 0.004637478829869904, "phrase": "fundamental_data_mining_tasks"}, {"score": 0.0033965836912510385, "phrase": "moderate_sizes"}, {"score": 0.0030834712590249863, "phrase": "arbitrary_shapes"}, {"score": 0.002969628818856786, "phrase": "linear_space"}, {"score": 0.0028142286985235977, "phrase": "first_stage"}, {"score": 0.002769209760453212, "phrase": "carefully_initialized_version"}, {"score": 0.002724909017963099, "phrase": "kmeans_algorithm"}, {"score": 0.0026384167183586015, "phrase": "second_stage"}, {"score": 0.0025822818714499795, "phrase": "generated_clusters"}, {"score": 0.0025273383208209922, "phrase": "final_shape-based_clusters"}, {"score": 0.0022213218042340735, "phrase": "large_datasets"}, {"score": 0.0021049977753042253, "phrase": "best_existing_approaches"}], "paper_keywords": ["Clustering", " Spatial", " Kmeans", " Hierarchical", " Linear time"], "paper_abstract": "Clustering is one of the fundamental data mining tasks. Many different clustering paradigms have been developed over the years, which include partitional, hierarchical, mixture model based, density-based, spectral, subspace, and so on. The focus of this paper is on full-dimensional, arbitrary shaped clusters. Existing methods for this problem suffer either in terms of the memory or time complexity (quadratic or even cubic). This shortcoming has restricted these algorithms to datasets of moderate sizes. In this paper we propose SPARCL, a simple and scalable algorithm for finding clusters with arbitrary shapes and sizes, and it has linear space and time complexity. SPARCL consists of two stages-the first stage runs a carefully initialized version of the Kmeans algorithm to generate many small seed clusters. The second stage iteratively merges the generated clusters to obtain the final shape-based clusters. Experiments were conducted on a variety of datasets to highlight the effectiveness, efficiency, and scalability of our approach. On the large datasets SPARCL is an order of magnitude faster than the best existing approaches.", "paper_title": "SPARCL: an effective and efficient algorithm for mining arbitrary shape-based clusters", "paper_id": "WOS:000271079500003"}