{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "power-delay_product"}, {"score": 0.010478444071309894, "phrase": "linear_pipeline"}, {"score": 0.00950563960632354, "phrase": "soft-edge_flip-flops"}, {"score": 0.00854951445858469, "phrase": "power_saving"}, {"score": 0.007275812061943943, "phrase": "timing_violations"}, {"score": 0.0047135086583390585, "phrase": "opportunistic_time_borrowing"}, {"score": 0.004459605573798577, "phrase": "power-delay_optimal_soft_linear_pipeline_design"}, {"score": 0.004201381218977942, "phrase": "consecutive_stages"}, {"score": 0.004043298628655316, "phrase": "timing-critical_stages"}, {"score": 0.0036037265181631324, "phrase": "supply_voltage"}, {"score": 0.0034386016613475335, "phrase": "different_scenarios"}, {"score": 0.0032255172568437965, "phrase": "deterministic_worst_case_path_delay_bounds"}, {"score": 0.0030645676308053444, "phrase": "stage_delays"}, {"score": 0.0029998918671747168, "phrase": "random_variables"}, {"score": 0.002801935384649699, "phrase": "soft-edge_flip_flops"}, {"score": 0.002754516260621121, "phrase": "dynamic_error_detection"}, {"score": 0.0022062235065459274, "phrase": "experimental_results"}, {"score": 0.0021049977753042253, "phrase": "aforesaid_problems"}], "paper_keywords": ["Power optimal pipeline design", " power-delay product", " soft edge flip flops", " soft pipeline", " time borrowing"], "paper_abstract": "In this paper, we present and solve the problem of power-delay optimal soft linear pipeline design. The key idea is to use soft-edge flip-flops to allow time borrowing among consecutive stages of the pipeline in order to provide the timing-critical stages with more time and trade this timing slack for power saving. We formulate the problem of optimally designing the soft-edge flip-flops and setting the clock frequency and supply voltage so as to minimize the power-delay product of a linear pipeline under different scenarios using both deterministic and statistical static delay models. In our first problem formulation, timing violations are avoided by respecting deterministic worst case path delay bounds. Next, the same problem is formulated for a scenario where stage delays are assumed to be random variables, and we minimize the power-delay product while keeping the probability of timing violations bounded. The soft-edge flip flops are equipped with dynamic error detection (and correction) circuitry to detect and fix the errors that might arise from over-clocking. Although the system is capable of recovering from error, there is a tradeoff between performance and power saving, which is exploited to further minimize the power-delay product of the pipeline in our third formulation. Experimental results demonstrate the efficacy of our proposed algorithms for solving each of the aforesaid problems.", "paper_title": "Optimizing the Power-Delay Product of a Linear Pipeline by Opportunistic Time Borrowing", "paper_id": "WOS:000295099800006"}