{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "hardware_cache_coherence"}, {"score": 0.04940892000191215, "phrase": "cache_coherence"}, {"score": 0.04519809469445228, "phrase": "hardware_coherence"}, {"score": 0.026741699248716205, "phrase": "formal_verification_tools"}, {"score": 0.0047075518238435966, "phrase": "integral_part"}, {"score": 0.004681076799813777, "phrase": "shared-memory_systems"}, {"score": 0.0043994539995390325, "phrase": "verification_techniques"}, {"score": 0.004277083020756253, "phrase": "new_multicore_era"}, {"score": 0.004253018585673207, "phrase": "increasing_number"}, {"score": 0.004169849868036158, "phrase": "renewed_debate"}, {"score": 0.003952181032417829, "phrase": "software_coherence"}, {"score": 0.0036933369385651342, "phrase": "widely_used_mesi_protocol"}, {"score": 0.0036518692027382353, "phrase": "mur_phi_model"}, {"score": 0.0035602550900791278, "phrase": "six_bugs"}, {"score": 0.0032989285553141913, "phrase": "recently_proposed_denovo_protocol"}, {"score": 0.0032618746264225576, "phrase": "disciplined_software_programming_models"}, {"score": 0.0030395060651788788, "phrase": "denovo"}, {"score": 0.00302238310602767, "phrase": "mesi"}, {"score": 0.0026242217741112256, "phrase": "hardware_coherence_protocols"}, {"score": 0.0025367242449899395, "phrase": "protocol_designers"}, {"score": 0.002480015345340149, "phrase": "new_protocols"}, {"score": 0.002259153494808885, "phrase": "hardware-software_co-design"}, {"score": 0.002183801521729492, "phrase": "overall_verification_effort"}, {"score": 0.002141009796880959, "phrase": "protocol_extensions"}, {"score": 0.0021049977753042253, "phrase": "computing_resources"}], "paper_keywords": ["Design", " Performance", " Verification", " Cache coherence", " multicore", " shared memory", " software-hardware co-design", " protocol verification", " model checking"], "paper_abstract": "Cache coherence is an integral part of shared-memory systems but is also widely considered to be one of the most complex parts of such systems. Much prior work has addressed this complexity and the verification techniques to prove the correctness of hardware coherence. Given the new multicore era with increasing number of cores, there is a renewed debate about whether the complexity of hardware coherence has been tamed or whether it should be abandoned in favor of software coherence. This article revisits the complexity of hardware cache coherence by verifying a publicly available, state-of-the-art implementation of the widely used MESI protocol, using the Mur phi model checking tool. To our surprise, we found six bugs in this protocol, most of which were hard to analyze and took several days to fix. To compare the complexity, we also verified the recently proposed DeNovo protocol, which exploits disciplined software programming models. We found three relatively easy to fix bugs in this less mature protocol. After fixing these bugs, our verification experiments showed that, compared to DeNovo, MESI had 15X more reachable states leading to a 20X increase in verification (model checking) time. Although we were eventually successful in verifying the protocols, the tool required making several simplifying assumptions (e.g., two cores, one address). Our results have several implications: (1) they indicate that hardware coherence protocols remain complex; (2) they reinforce the need for protocol designers to embrace formal verification tools to demonstrate correctness of new protocols and extensions; (3) they reinforce the need for formal verification tools that are both scalable and usable by non-expert; and (4) they show that a system based on hardware-software co-design can offer a simpler approach for cache coherence, thus reducing the overall verification effort and allowing verification of more detailed models and protocol extensions that are otherwise limited by computing resources.", "paper_title": "Revisiting the Complexity of Hardware Cache Coherence and Some Implications", "paper_id": "WOS:000348232000003"}