{"auto_keywords": [{"score": 0.03934488867229197, "phrase": "intersection_attacks"}, {"score": 0.005255018742074432, "phrase": "challenge_screens"}, {"score": 0.00481495049065317, "phrase": "graphical_password_intersection_attacks"}, {"score": 0.004774115617883476, "phrase": "recognition-based_graphical_passwords"}, {"score": 0.004594582559945568, "phrase": "alternative_user_authentication_mechanism"}, {"score": 0.0044786435725543685, "phrase": "attack_resistance"}, {"score": 0.004421770937919324, "phrase": "quantitative_examination"}, {"score": 0.004201381218977942, "phrase": "appropriate_countermeasure"}, {"score": 0.003542786326740931, "phrase": "effective_countermeasures"}, {"score": 0.003309124298009635, "phrase": "five_possible_countermeasures"}, {"score": 0.0031440159350875057, "phrase": "dummy_screens"}, {"score": 0.002696366237523415, "phrase": "rbgp_schemes"}, {"score": 0.002539978170928796, "phrase": "rbgp_scheme"}, {"score": 0.0025183881730011597, "phrase": "configuration_values"}, {"score": 0.0023824468367751365, "phrase": "quantitative_choice"}, {"score": 0.0021049977753042253, "phrase": "john_wiley"}], "paper_keywords": ["recognition-based graphical passwords", " authentication", " intersect attacks", " simulation"], "paper_abstract": "Recognition-based graphical passwords (RBGPs) are often proposed as an alternative user authentication mechanism. However, discussion of attack resistance often lacks quantitative examination. Establishing the efficacy of countermeasures could allow selection of an appropriate countermeasure for the level of security required by a given system. Furthermore, this information could be used to construct a model to estimate the number of intersection attacks required before success. This research contributes to these goals by establishing effective countermeasures and a model for intersection attacks. The approach involves creating a simulation of intersection attacks using five possible countermeasures and performing analysis to determine efficacy. Results show that using dummy screens does not increase the number of attacks required. It is also shown that increasing the number of challenge screens can increase and reduce the number of attacks required. Also presented is a model for RBGP schemes that can be used to estimate the number of intersection attacks required for a RBGP scheme when configuration values such as the number of challenge screens are known. This allows a quantitative choice of countermeasure for intersection attacks and a calculation that can provide a basis of comparison with other RBGP schemes, which was previously not possible. Copyright (c) 2013 John Wiley & Sons, Ltd.", "paper_title": "Simulating and modelling the effectiveness of graphical password intersection attacks", "paper_id": "WOS:000358507500013"}