{"auto_keywords": [{"score": 0.04835227522307675, "phrase": "augmented_reality"}, {"score": 0.00627015532917163, "phrase": "current_applications"}, {"score": 0.00481495049065317, "phrase": "current_state-of-the-art"}, {"score": 0.004372442291178139, "phrase": "new_augmented_reality_system"}, {"score": 0.004157058883925715, "phrase": "augmented_reality_applications"}, {"score": 0.004081385289516914, "phrase": "mobile_augmented_reality_systems_challenges"}, {"score": 0.004007083686875716, "phrase": "successful_mobile_systems"}, {"score": 0.0037921662574137535, "phrase": "future_applications"}, {"score": 0.0037402558657576124, "phrase": "current_research"}, {"score": 0.003689053436223376, "phrase": "augmented_reality's_development"}, {"score": 0.0033037970113095577, "phrase": "future_challenges"}, {"score": 0.002851790448644913, "phrase": "reality_technologies"}, {"score": 0.002825681384008326, "phrase": "computer_vision_methods"}, {"score": 0.0026494723416072316, "phrase": "mobile_and_wireless_systems"}, {"score": 0.002265833357217618, "phrase": "ar_apps"}], "paper_keywords": ["Augmented reality", " Augmented reality technologies", " Augmented reality systems", " Augmented reality applications", " Augmented reality iphone4", " AR", " Augmented reality on mobile devices"], "paper_abstract": "This paper surveys the current state-of-the-art of technology, systems and applications in Augmented Reality. It describes work performed by many different research groups, the purpose behind each new Augmented Reality system, and the difficulties and problems encountered when building some Augmented Reality applications. It surveys mobile augmented reality systems challenges and requirements for successful mobile systems. This paper summarizes the current applications of Augmented Reality and speculates on future applications and where current research will lead Augmented Reality's development. Challenges augmented reality is facing in each of these applications to go from the laboratories to the industry, as well as the future challenges we can forecast are also discussed in this paper. Section 1 gives an introduction to what Augmented Reality is and the motivations for developing this technology. Section 2 discusses Augmented Reality Technologies with computer vision methods, AR devices, interfaces and systems, and visualization tools. The mobile and wireless systems for Augmented Reality are discussed in Section 3. Four classes of current applications that have been explored are described in Section 4. These applications were chosen as they are the most famous type of applications encountered when researching AR apps. The future of augmented reality and the challenges they will be facing are discussed in Section 5.", "paper_title": "Augmented reality technologies, systems and applications", "paper_id": "WOS:000286103800013"}