{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "complex_fuzzy_sets"}, {"score": 0.006135090087444384, "phrase": "distance_measure"}, {"score": 0.004723322467153553, "phrase": "complex_fuzzy_set"}, {"score": 0.004633429997452688, "phrase": "fuzzy_set"}, {"score": 0.004458722048888919, "phrase": "unit_circle"}, {"score": 0.0043738432231020885, "phrase": "complex_plane"}, {"score": 0.003154012038613403, "phrase": "fuzzy_sets"}, {"score": 0.002958021635132416, "phrase": "real-valued_fuzzy_sets"}, {"score": 0.0025521085778978042, "phrase": "flow_various_operations"}, {"score": 0.0023934306706217797, "phrase": "example_application"}, {"score": 0.00236289633510808, "phrase": "signal_detection"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Complex fuzzy set", " Fuzzy set", " Distance measure", " delta-Equality", " Operation"], "paper_abstract": "A complex fuzzy set is a fuzzy set whose membership function takes values in the unit circle in the complex plane. This paper investigates various operation properties and proposes a distance measure for complex fuzzy sets. The distance of two complex fuzzy sets measures the difference between the grades of two complex fuzzy sets as well as that between the phases of the two complex fuzzy sets. This distance measure is then used to define delta-equalities of complex fuzzy sets which coincide with those of fuzzy sets already defined in the literature if complex fuzzy sets reduce to real-valued fuzzy sets. Two complex fuzzy sets are said to be delta-equal if the distance between them is less than 1 - delta. This paper shows flow various operations between complex fuzzy sets affect given delta-equalities of complex fuzzy sets. An example application of signal detection demonstrates the utility Of the concept of delta-equalities of complex fuzzy sets in practice. (C) 2009 Elsevier Inc. All rights reserved.", "paper_title": "Operation properties and delta-equalities of complex fuzzy sets", "paper_id": "WOS:000271709500007"}