{"auto_keywords": [{"score": 0.043955710769032354, "phrase": "wos"}, {"score": 0.006102643594883056, "phrase": "citation-by-citation_analysis"}, {"score": 0.00481495049065317, "phrase": "google_scholar"}, {"score": 0.0045735351500059175, "phrase": "google"}, {"score": 0.004491170257043608, "phrase": "prominent_citation_services"}, {"score": 0.004464061452094005, "phrase": "distinct_indexing_mechanisms"}, {"score": 0.004437115547184535, "phrase": "comprehensive_knowledge"}, {"score": 0.004397000006837371, "phrase": "growth_patterns"}, {"score": 0.004101208934887704, "phrase": "diverse_research_fields"}, {"score": 0.0040273609512482, "phrase": "retroactive_growth"}, {"score": 0.0034195866335851935, "phrase": "classic_articles"}, {"score": 0.0032577270508271305, "phrase": "retroactive_manner"}, {"score": 0.0030475670155080247, "phrase": "wos._retroactive_growth"}, {"score": 0.0029209233709517634, "phrase": "actual_growth_percentages"}, {"score": 0.002877008003139666, "phrase": "gs"}, {"score": 0.0023694065215394593, "phrase": "substantial_expansion"}, {"score": 0.0023196214633527264, "phrase": "recent_works"}, {"score": 0.002117811223107415, "phrase": "literature_research"}, {"score": 0.0021049977753042253, "phrase": "research_evaluation"}], "paper_keywords": ["Automatic indexing", " Citation classic", " Citation Index", " Historic trend", " Most highly cited paper", " Strengths and weaknesses"], "paper_abstract": "Web of Science (WoS) and Google Scholar (GS) are prominent citation services with distinct indexing mechanisms. Comprehensive knowledge about the growth patterns of these two citation services is lacking. We analyzed the development of citation counts in WoS and GS for two classic articles and 56 articles from diverse research fields, making a distinction between retroactive growth (i.e., the relative difference between citation counts up to mid-2005 measured in mid-2005 and citation counts up to mid-2005 measured in April 2013) and actual growth (i.e., the relative difference between citation counts up to mid-2005 measured in April 2013 and citation counts up to April 2013 measured in April 2013). One of the classic articles was used for a citation-by-citation analysis. Results showed that GS has substantially grown in a retroactive manner (median of 170 % across articles), especially for articles that initially had low citations counts in GS as compared to WoS. Retroactive growth of WoS was small, with a median of 2 % across articles. Actual growth percentages were moderately higher for GS than for WoS (medians of 54 vs. 41 %). The citation-by-citation analysis showed that the percentage of citations being unique in WoS was lower for more recent citations (6.8 % for citations from 1995 and later vs. 41 % for citations from before 1995), whereas the opposite was noted for GS (57 vs. 33 %). It is concluded that, since its inception, GS has shown substantial expansion, and that the majority of recent works indexed in WoS are now also retrievable via GS. A discussion is provided on quantity versus quality of citations, threats for WoS, weaknesses of GS, and implications for literature research and research evaluation.", "paper_title": "The expansion of Google Scholar versus Web of Science: a longitudinal study", "paper_id": "WOS:000330622600048"}