{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "fault_tolerant_patterns"}, {"score": 0.03474710635110192, "phrase": "random_failures"}, {"score": 0.031794898803117706, "phrase": "functional_behaviour"}, {"score": 0.004681413843223496, "phrase": "critical_systems"}, {"score": 0.004616034337089482, "phrase": "common_practice"}, {"score": 0.004456534664975427, "phrase": "higher_levels"}, {"score": 0.004363480951473701, "phrase": "well_established_design_patterns"}, {"score": 0.0035705347414368726, "phrase": "triple_modular_redundancy"}, {"score": 0.0034713900276078786, "phrase": "original_system"}, {"score": 0.003223995503078124, "phrase": "tolerant_patterns"}, {"score": 0.0030581212589623737, "phrase": "interval_arithmetic"}, {"score": 0.0028301085867789076, "phrase": "real-time_systems"}, {"score": 0.0025733173062050018, "phrase": "arbitrary_number"}, {"score": 0.002528379400564723, "phrase": "consecutive_application"}, {"score": 0.0023315400785212785, "phrase": "case_study"}, {"score": 0.0022667208478315323, "phrase": "simplified_avionic_elevator_control_system"}, {"score": 0.002157583854640276, "phrase": "brazilian_aircraft_manufacturer"}, {"score": 0.0021499920551456956, "phrase": "embraer"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Redundancy management", " Fault tolerance", " Behavioural preservation", " Theorem proving", " HOL"], "paper_abstract": "In the development of critical systems, it is common practice to make use of redundancy in order to achieve higher levels of reliability. There are well established design patterns that introduce redundancy and that are widely documented and adopted by the industry. However there have been few attempts to formally verify them. In this work, we modelled in the HOL4 system such design patterns, which we call here fault tolerant patterns. We illustrate our approach by modelling three classical fault tolerant patterns: Homogeneous Redundancy, Heterogeneous Redundancy and Triple Modular Redundancy. Our model takes into account that the original system (without redundancy) computes a certain function with some delay and is amenable to random failures. We proved that our fault tolerant patterns preserve the behaviour of its replicated subsystems. The notion of correctness adopted makes use of interval arithmetic and is restricted to functional behaviour. Timing is not regarded as part of the functional behaviour in this work. Therefore, real-time systems are not the focus of our approach. We also proved that our fault tolerant patterns are compositional in the sense that we can apply fault tolerant patterns consecutively and for an arbitrary number of times. The consecutive application of our patterns still results in a system that computes a certain function with some delay and amenable to random failures. We developed a case study that verifies that a fault tolerant pattern applied to a simplified avionic Elevator Control System preserves its original behaviour. This work was done in collaboration with the Brazilian aircraft manufacturer Embraer. (C) 2013 Elsevier B.V. All rights reserved.", "paper_title": "Compositionality and correctness of fault tolerant patterns in HOL4", "paper_id": "WOS:000338598100003"}