{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "dynamic_visuo-motor_task"}, {"score": 0.045882883787853455, "phrase": "phase_coding"}, {"score": 0.03597889657553887, "phrase": "wrist_movements"}, {"score": 0.03546826477798218, "phrase": "simulated_or_real_time"}, {"score": 0.026687370638160488, "phrase": "better_prediction_results"}, {"score": 0.004765482708043842, "phrase": "brain-computer_interfaces"}, {"score": 0.004695690606418907, "phrase": "neurophysiological_research"}, {"score": 0.004613281725392355, "phrase": "different_transformations"}, {"score": 0.004592905436175987, "phrase": "brain's_\"thoughts"}, {"score": 0.004525629293824217, "phrase": "successful_implementations"}, {"score": 0.004512540257275546, "phrase": "bc"}, {"score": 0.004406994912939125, "phrase": "recent_reports"}, {"score": 0.00438105507792004, "phrase": "informational_content"}, {"score": 0.004361700010201387, "phrase": "important_mechanism"}, {"score": 0.004342430078306461, "phrase": "brain's_function"}, {"score": 0.004259901808809633, "phrase": "brain's_data_transfer"}, {"score": 0.004178935413340453, "phrase": "brain-computer_interface"}, {"score": 0.004063348730077936, "phrase": "phase-coded_content"}, {"score": 0.004039423410198574, "phrase": "brain_signals"}, {"score": 0.004021571540928605, "phrase": "appropriate_signal-processing_methods"}, {"score": 0.003956784357357341, "phrase": "phase-demodulation-based_signal-processing_approach"}, {"score": 0.0038930368103015467, "phrase": "current_motor_action"}, {"score": 0.003735349093835257, "phrase": "brain-information-decoding_analysis"}, {"score": 0.0037024590131525467, "phrase": "vm"}, {"score": 0.00367515591547613, "phrase": "present_study"}, {"score": 0.003658907979536578, "phrase": "eeg_data"}, {"score": 0.0035524023825411217, "phrase": "appropriate_signal-processing_and_identification_methods"}, {"score": 0.003489987735217367, "phrase": "mathematical_model"}, {"score": 0.0034540850937966336, "phrase": "eeg_measurements"}, {"score": 0.0033535564475844315, "phrase": "bci"}, {"score": 0.00330922510644499, "phrase": "existing_methodology"}, {"score": 0.0032848684681050745, "phrase": "optimal_decoding_results"}, {"score": 0.003236785750339122, "phrase": "eeg"}, {"score": 0.0030195184114140063, "phrase": "subject's_performance"}, {"score": 0.002997287666914225, "phrase": "wrist-movement_predictions"}, {"score": 0.002970826068879342, "phrase": "eeg_data-processing_methodology"}, {"score": 0.0029620573986902416, "phrase": "double_brain-rhythm_filtering"}, {"score": 0.0029146089191757762, "phrase": "pca"}, {"score": 0.0028885579903645043, "phrase": "separate_set"}, {"score": 0.0028630535573013686, "phrase": "movement-prediction_model"}, {"score": 0.0028546020769742177, "phrase": "fuzzy_inference_system"}, {"score": 0.0028044130672242695, "phrase": "eeg_signals"}, {"score": 0.0027878797103973313, "phrase": "dvm_tasks"}, {"score": 0.0027673496368158545, "phrase": "subjects'_wrist_movements"}, {"score": 0.0027307746993761035, "phrase": "presented_methodology"}, {"score": 0.002722712628307598, "phrase": "reasonably_high_values"}, {"score": 0.0026787936751887617, "phrase": "proposed_approach"}, {"score": 0.0026355812883224203, "phrase": "rhythm_filtering"}, {"score": 0.0026239172281189997, "phrase": "pca_transformation"}, {"score": 0.0025175053651454045, "phrase": "optimized_methods"}, {"score": 0.002422552850701705, "phrase": "real-time_processing"}, {"score": 0.0024118292918742967, "phrase": "minor_decrease"}, {"score": 0.002404706573379854, "phrase": "prediction_quality"}, {"score": 0.0023242882049733515, "phrase": "eeg-coded_content"}, {"score": 0.0022800270693436155, "phrase": "real-time_data"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Electroencephalography", " Dynamic visuo-motor task", " Fuzzy logic", " Brain-information decoding", " Brain-computer interface", " Wrist-movement prediction"], "paper_abstract": "Background: The area of brain-computer interfaces (BCIs) represents one of the more interesting fields in neurophysiological research, since it investigates the development of the machines that perform different transformations of the brain's \"thoughts\" to certain pre-defined actions. Experimental studies have reported some successful implementations of BC's; however, much of the field still remains unexplored. According to some recent reports the phase coding of informational content is an important mechanism in the brain's function and cognition, and has the potential to explain various mechanisms of the brain's data transfer, but it has yet to be scrutinized in the context of brain-computer interface. Therefore, if the mechanism of phase coding is plausible, one should be able to extract the phase-coded content, carried by brain signals, using appropriate signal-processing methods. In our previous studies we have shown that by using a phase-demodulation-based signal-processing approach it is possible to decode some relevant information on the current motor action in the brain from electroencephalographic (EEG) data. Objective: In this paper the authors would like to present a continuation of their previous work on the brain-information-decoding analysis of visuo-motor (VM) tasks. The present study shows that EEG data measured during more complex, dynamic visuo-motor (dVM) tasks carries enough information about the currently performed motor action to be successfully extracted by using the appropriate signal-processing and identification methods. The aim of this paper is therefore to present a mathematical model, which by means of the EEG measurements as its inputs predicts the course of the wrist movements as applied by each subject during the task in simulated or real time (BCI analysis). However, several modifications to the existing methodology are needed to achieve optimal decoding results and a real-time, data-processing ability. The information extracted from the EEG could, therefore, be further used for the development of a closed-loop, non-invasive, brain-computer interface. Materials and methods: For the case of this study two types of measurements were performed, i.e., the electroencephalographic (EEG) signals and the wrist movements were measured simultaneously, during the subject's performance of a dynamic visuo-motor task. Wrist-movement predictions were computed by using the EEG data-processing methodology of double brain-rhythm filtering, double phase demodulation and double principal component analyses (PCA), each with a separate set of parameters. For the movement-prediction model a fuzzy inference system was used. Results: The results have shown that the EEG signals measured during the dVM tasks carry enough information about the subjects' wrist movements for them to be successfully decoded using the presented methodology. Reasonably high values of the correlation coefficients suggest that the validation of the proposed approach is satisfactory. Moreover, since the causality of the rhythm filtering and the PCA transformation has been achieved, we have shown that these methods can also be used in a real-time, brain-computer interface. The study revealed that using non-causal, optimized methods yields better prediction results in comparison with the causal, non-optimized methodology; however, taking into account that the causality of these methods allows real-time processing, the minor decrease in prediction quality is acceptable. Conclusion: The study suggests that the methodology that was proposed in our previous studies is also valid for identifying the EEG-coded content during dVM tasks, albeit with various modifications, which allow better prediction results and real-time data processing. The results have shown that wrist movements can be predicted in simulated or real time; however, the results of the non-causal, optimized methodology (simulated) are slightly better. Nevertheless, the study has revealed that these methods should be suitable for use in the development of a non-invasive, brain-computer interface. (C) 2010 Elsevier B.V. All rights reserved.", "paper_title": "Brain-computer interface analysis of a dynamic visuo-motor task", "paper_id": "WOS:000286856300004"}