{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "empirical_study"}, {"score": 0.004358240019060018, "phrase": "large_dutch_multinational_company"}, {"score": 0.004304271837157217, "phrase": "first_one"}, {"score": 0.004163587877500036, "phrase": "different_dimensions"}, {"score": 0.0036756196381448015, "phrase": "estimation_error"}, {"score": 0.0032581736321024373, "phrase": "first_study"}, {"score": 0.00313849462329633, "phrase": "current_estimation_error"}, {"score": 0.00224061675049049, "phrase": "historical_estimates"}, {"score": 0.0021853532419450887, "phrase": "diverse_sources"}, {"score": 0.0021403407314754637, "phrase": "particular_company"}], "paper_keywords": ["Budget", " schedule", " time", " accuracy of estimation", " organizational learning", " management"], "paper_abstract": "This paper is the result of two related studies done on the estimation of IT projects at a large Dutch multinational company. The first one is a study about the accuracy of different dimensions of IT project estimating: schedule, budget and effort.(a) This study is based on a dataset of 171 projects collected at the IT department of the company. We analyzed the estimation error of budget, effort and schedule. Also, we analyzed whether there is any learning (improvement) effect over time. With the results of the first study we proceeded to research what is causing the current estimation error (inaccuracy). The results of our first study show that there is no relation between accuracy of budget, schedule and effort in the company analyzed. Besides, they show that over time there is no change in the inaccuracy (effectiveness and efficiency of the estimates). In our second study we discovered that the sources of this inaccuracy are: (IT estimation) process complexity, misuse of estimates, technical complexity, requirements redefinition and business domain instability. This paper reflects and provides recommendations on how to improve the learning from historical estimates and how to manage the diverse sources of inaccuracy inside this particular company and also in other organizations.", "paper_title": "AN EMPIRICAL STUDY INTO THE ACCURACY OF IT ESTIMATIONS AND ITS INFLUENCING FACTORS", "paper_id": "WOS:000322397000002"}