{"auto_keywords": [{"score": 0.04911241438594345, "phrase": "path-preserving_hierarchies"}, {"score": 0.037502693533902155, "phrase": "tuggraph"}, {"score": 0.00481495049065317, "phrase": "graphs_faster"}, {"score": 0.004437613070853689, "phrase": "large_input_graph"}, {"score": 0.004392565073466714, "phrase": "logical_components"}, {"score": 0.003906116922372891, "phrase": "feature_detection"}, {"score": 0.0038467574225322086, "phrase": "global_process"}, {"score": 0.0032008144731234265, "phrase": "pre-existing_hierarchy"}, {"score": 0.002949598537993663, "phrase": "larger_graph"}, {"score": 0.0026630475331025955, "phrase": "underlying_structure"}, {"score": 0.0023079225317714815, "phrase": "proximal_information"}, {"score": 0.0022382002476510573, "phrase": "entire_graph"}, {"score": 0.0021049977753042253, "phrase": "full_graph"}], "paper_keywords": ["Graph visualization", " proximity", " graph hierarchies"], "paper_abstract": "Many graph visualization systems use graph hierarchies to organize a large input graph into logical components. These approaches detect features globally in the data and place these features inside levels of a hierarchy. However, this feature detection is a global process and does not consider nodes of the graph near a feature of interest. TugGraph is a system for exploring paths and proximity around nodes and subgraphs in a graph. The approach modifies a pre-existing hierarchy in order to see how a node or subgraph of interest extends out into the larger graph. It is guaranteed to create path-preserving hierarchies, so that the abstraction shown is meaningful with respect to the underlying structure of the graph. The system works well on graphs of hundreds of thousands of nodes and millions of edges. TugGraph is able to present views of this proximal information in the context of the entire graph in seconds, and does not require a layout of the full graph as input.", "paper_title": "Tugging Graphs Faster: Efficiently Modifying Path-Preserving Hierarchies for Browsing Paths", "paper_id": "WOS:000286111600002"}