{"auto_keywords": [{"score": 0.04940587850605655, "phrase": "non-uniform_patterns"}, {"score": 0.007454423712582912, "phrase": "lbp"}, {"score": 0.004830898740467429, "phrase": "random_subspace"}, {"score": 0.00481495049065317, "phrase": "local_binary_patterns"}, {"score": 0.004680473391946691, "phrase": "basic_idea"}, {"score": 0.004238576355081601, "phrase": "local_features"}, {"score": 0.0038564191670589884, "phrase": "standard_applications"}, {"score": 0.003426640459083931, "phrase": "classification_stage"}, {"score": 0.0032529910932231924, "phrase": "high_dimension"}, {"score": 0.00314708280192844, "phrase": "unwanted_noise"}, {"score": 0.0028495431343111897, "phrase": "correlated_features"}, {"score": 0.00266693888510356, "phrase": "stand-alone_support_vector_machine"}, {"score": 0.0026045914281028473, "phrase": "uniform_patterns"}, {"score": 0.0023139986108451967, "phrase": "extensive_experiments"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Texture descriptors", " Local binary patterns", " Local ternary patterns", " Non-uniform patterns", " Support vector machines"], "paper_abstract": "The basic idea behind LBP is that an image is composed of micropatterns. A histogram of these micropatterns contains information about the local features in an image. These micropatterns can be divided into two types: uniform and non-uniform. In standard applications using LBP, only the uniform patterns are used. The non-uniform patterns are considered in only a single bin of the histogram that is used to extract features in the classification stage. Non-uniform patterns have undesirable characteristics: they are of a high dimension, partially correlated, and introduce unwanted noise. To offset these disadvantages, we explore using random subspace, well-known to work well with noise and correlated features, to train features based also on non-uniform patterns. We find that a stand-alone support vector machine performs best with the uniform patterns and random subspace with histograms of 50 bins performs best with the non-uniform patterns. Superior results are obtained when the two are combined. Based on extensive experiments conducted in several domains using several benchmark databases, it is our conclusion that non-uniform patterns improve classifier performance. (C) 2012 Elsevier Ltd. All rights reserved.", "paper_title": "A simple method for improving local binary patterns by considering non-uniform patterns", "paper_id": "WOS:000305845300023"}