{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "uniform_random_number_generators"}, {"score": 0.004401794742140806, "phrase": "successive_output_values"}, {"score": 0.004238576355081601, "phrase": "commonly_adopted_measures"}, {"score": 0.0032838979278935814, "phrase": "output_value"}, {"score": 0.0031920445513574907, "phrase": "parameter_search"}, {"score": 0.0031619994642255846, "phrase": "good_generators"}, {"score": 0.0031174595932694036, "phrase": "quality_criterion"}, {"score": 0.0030590445140753187, "phrase": "new_measures"}, {"score": 0.002931569771634119, "phrase": "statistical_tests"}, {"score": 0.0027961342030212353, "phrase": "resolution-stationary_generators"}, {"score": 0.0025678829712650437, "phrase": "least_significant_bits"}, {"score": 0.0024842242921857705, "phrase": "tausworthe"}, {"score": 0.002281376328251423, "phrase": "appropriate_linear_transformation"}, {"score": 0.0022175019341824603, "phrase": "new_efficient_ways"}, {"score": 0.00218623706110975, "phrase": "high-quality_and_long-period_tausworthe_generators"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Random number generation", " Linear recurrence modulo 2", " Uniformity", " Quasi-Monte Carlo", " Tausworthe generator"], "paper_abstract": "Besides speed and period length, the quality of uniform random number generators (RNGs) is usually assessed by measuring the uniformity of their point sets, formed by taking vectors of successive output values over their entire period length For F(2)-linear generators. the commonly adopted measures of uniformity are based on the equidistribution of the most significant bits of the output In this paper, we point out weaknesses of these measures and introduce generalizations that also give importance to the low-order (less significant) bits These measures look at the equidistribution obtained when we permute the hits of each output value in a certain way In a parameter search for good generators, a quality criterion based on these new measures of equidistribution helps to avoid generators that fail statistical tests targeting their low-order hits. We also introduce the notion of resolution-stationary generators. whose point sets are invariant under a multiplication by certain powers or 2, modulo I For such generators. least significant bits have the same equidistribution properties as the most significant ones Tausworthe generators have this property We finally show how an arbitrary F(2)-linear generator can he made resolution-stationary by adding an appropriate linear transformation to the output This provides new efficient ways of implementing high-quality and long-period Tausworthe generators (C) 2007 IMACS Published by Elsevier B.V. All rights reserved", "paper_title": "Resolution-stationary random number generators", "paper_id": "WOS:000276380400006"}