{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "fall_risk"}, {"score": 0.006930175961535448, "phrase": "proposed_methodology"}, {"score": 0.006819586819310154, "phrase": "data_acquisition_system"}, {"score": 0.006267124144289048, "phrase": "wii"}, {"score": 0.004606148097788071, "phrase": "early_detection"}, {"score": 0.004514241562580097, "phrase": "health_costs"}, {"score": 0.004164516065972361, "phrase": "measurement-focused_study"}, {"score": 0.004081385289516914, "phrase": "new_methodology"}, {"score": 0.003719773848735395, "phrase": "data_analysis_system"}, {"score": 0.0036602262729063775, "phrase": "fall_risk_assessment_system"}, {"score": 0.0035439655241057207, "phrase": "standard_notebook_computer_and_video_game_input_devices"}, {"score": 0.0031398318568608505, "phrase": "use_signal_processing"}, {"score": 0.003114584448820957, "phrase": "data_mining"}, {"score": 0.003077092305006702, "phrase": "computational_intelligence_methods"}, {"score": 0.0029913511336659327, "phrase": "acquired_data"}, {"score": 0.0026500668745484957, "phrase": "falling_background"}, {"score": 0.002597088221737922, "phrase": "nonfalling_background"}, {"score": 0.002504374718975704, "phrase": "nonlinear_binary_classification_techniques"}, {"score": 0.0024345529783611703, "phrase": "confidence_intervals"}], "paper_keywords": ["Fall risk assessment", " functional tests", " statistical classifiers"], "paper_abstract": "Early detection of fall risk can reduce health costs associated with surgery, rehabilitation, imaging studies, hospitalizations, and medical evaluations. This paper proposes a measurement-focused study oriented to evaluate a new methodology for assessing fall risk using low-cost and off-the-shelf devices. The proposed methodology consists of a data acquisition system, a data analysis system, and a fall risk assessment system. The data acquisition system is composed by a standard notebook computer and video game input devices: a Kinect, a Wii balance board, and two Wii motion controllers. The data analysis system and the fall risk assessment system, in turn, use signal processing, data mining, and computational intelligence methods, in order to analyze the acquired data for determining the fall risk of the subject under analysis. This methodology includes six static and two dynamic tests. Experiments were conducted on a population of 37 subjects: 16 with falling background, and 21 with nonfalling background. These two groups have the same age distribution. As nonlinear binary classification techniques were used, methodologies based on confidence intervals are not applicable and then tenfold cross validation was used to estimate accuracy. Hence, such a methodology can classify the fall risk as high or low, with an accuracy of 89.2%. The proposed methodology allows the construction of low-cost, portable, replicable, objective, and reliable fall risk assessment systems.", "paper_title": "A Novel Methodology for Assessing the Fall Risk Using Low-Cost and Off-the-Shelf Devices", "paper_id": "WOS:000337961300010"}