{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "students'_answerscripts"}, {"score": 0.04685104062438759, "phrase": "students'_answerscripts_evaluation"}, {"score": 0.046185630960691164, "phrase": "interval-valued_intuitionistic_fuzzy_sets"}, {"score": 0.009545685429873529, "phrase": "interval-valued_intuitionistic_fuzzy_mark"}, {"score": 0.004743594110762319, "phrase": "interval-vafued_intuitionistic_fuzzy_sets"}, {"score": 0.0045357787854931894, "phrase": "new_method"}, {"score": 0.0030600032877646263, "phrase": "uncertainty_beta"}, {"score": 0.0024693979425773993, "phrase": "generalized_method"}, {"score": 0.0022913497040895586, "phrase": "existing_methods"}, {"score": 0.002234893735225432, "phrase": "proposed_methods"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Answerscripts evaluation", " Education grading system", " Interval-valued intuitionistic fuzzy set", " Intuitionistic fuzzy set", " Fuzzy grade sheet", " Generalized fuzzy grade sheet"], "paper_abstract": "In this paper, we present a new method for students' answerscripts evaluation based on interval-valued intuitionistic fuzzy sets, where the fuzzy marks awarded to the answers of students' answerscripts are represented by interval-valued intuitionistic fuzzy sets. An index of optimism lambda determined by an evaluator is used, where lambda is an element of [0, 1]. The larger the value of lambda, the more optimistic is the evaluator. The smaller the value of lambda, the more pessimistic is the evaluator. Moreover, an index of uncertainty beta is calculated denoting the degree of uncertainty of an interval-valued intuitionistic fuzzy mark, where beta is an element of [0, 1]. The larger the value of beta, the more the uncertainty of an interval-valued intuitionistic fuzzy mark. We also present a generalized method for students' answerscripts evaluation using interval-valued intuitionistic fuzzy sets. The proposed method can overcome the drawbacks of the existing methods for students' answerscripts evaluation. The proposed methods can evaluate students' answerscripts in a more flexible and more intelligent manner. (C) 2013 Elsevier Inc. All rights reserved.", "paper_title": "Evaluating students' answerscripts based on interval-vafued intuitionistic fuzzy sets", "paper_id": "WOS:000317887100021"}