{"auto_keywords": [{"score": 0.0315956183918944, "phrase": "pbl"}, {"score": 0.015136648301847697, "phrase": "online_learning_environments"}, {"score": 0.009200807589823081, "phrase": "'new'_knowledge"}, {"score": 0.00481495049065317, "phrase": "problem-based_learning"}, {"score": 0.0037377733149169573, "phrase": "information_and_communication_technologies"}, {"score": 0.0036494864560524735, "phrase": "hong_kong_secondary_school_classrooms"}, {"score": 0.003207462626693259, "phrase": "ict"}, {"score": 0.003176899769744057, "phrase": "business_studies_classrooms"}, {"score": 0.003072285184441679, "phrase": "five_evaluative_questions"}, {"score": 0.002873247913129334, "phrase": "academic_discourse"}, {"score": 0.002598543802992702, "phrase": "online_learning_environment"}, {"score": 0.0024771000236931836, "phrase": "practical_approach"}, {"score": 0.002187194307878705, "phrase": "new_technologies"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["computer-mediated communication", " cooperative/collaborative learning", " pedagogical issues", " post-secondary education", " teaching/learning strategies"], "paper_abstract": "This article reports on the design, implementation and evaluation of a module in the MEd (Business) in the Faculty of Education at the University of Hong Kong in which an explicit problem-based learning (PBL) approach was used to investigate the challenges associated with the adoption and use of information and communication technologies (ICT) in Hong Kong secondary school classrooms. PBL influenced both the way the curriculum was developed and the process by which students (n = 18) investigated topics related to the integration of ICT in business studies classrooms. The evaluation was based on five evaluative questions dealing with the implementation of PBL, the extent to which PBL facilitated academic discourse, the extent of 'new' knowledge about ICT that had been created, the role of the tutor, and the online learning environment provided. The evaluation revealed that PBL provided a practical approach to investigating ICT in both face-to-face and online learning environments, leading to 'new' knowledge about challenges associated with the adoption and use of new technologies in various educational settings. (c) 2004 Elsevier Ltd. All rights reserved.", "paper_title": "Investigating ICT using problem-based learning in face-to-face and online learning environments", "paper_id": "WOS:000238003800005"}