{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "general_multiple_comparison_problem"}, {"score": 0.004469042910390712, "phrase": "single_system"}, {"score": 0.003378385493203297, "phrase": "expected_performance"}, {"score": 0.003336614511719501, "phrase": "selection_procedures"}, {"score": 0.0032143649757754595, "phrase": "best_system"}, {"score": 0.00265038878247831, "phrase": "new_procedures"}, {"score": 0.002474961375646351, "phrase": "common_random_numbers"}, {"score": 0.002444333100610621, "phrase": "control_variates"}, {"score": 0.0022967713922705, "phrase": "simulation_experiments"}, {"score": 0.0022683432490549064, "phrase": "empirical_results"}, {"score": 0.002226357953581725, "phrase": "realistic_example"}, {"score": 0.0021049977753042253, "phrase": "existing_ones"}], "paper_keywords": ["comparison with a standard", " variance reduction techniques", " simulation", " output analysis"], "paper_abstract": "Comparison with a standard is a general multiple comparison problem, where each system is required to be compared with a single system, referred to as a 'standard', as well as with other alternative systems. Screening procedures specially designed to be used for comparison with a standard have been proposed to find a subset that includes all the systems better than the standard in terms of the expected performance. Selection procedures are derived to determine the best system among a number of systems that are better than the standard, or to select the standard when it is equal to or better than the other alternatives. We develop new procedures for screening and selection through the use of two variance reduction techniques, common random numbers and control variates, which are particularly useful in the context of simulation experiments. Empirical results and a realistic example are also provided to compare our procedures with the existing ones.", "paper_title": "Control-variate methods for comparison with a standard", "paper_id": "WOS:000299726700023"}