{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "feature_selection_algorithms"}, {"score": 0.005861900143841434, "phrase": "feature_preferences"}, {"score": 0.004690694501758065, "phrase": "high-dimensional_spaces"}, {"score": 0.004545793387330536, "phrase": "extremely_high-dimensional_data"}, {"score": 0.004382364826200616, "phrase": "indispensable_components"}, {"score": 0.004314127287770832, "phrase": "learning_process"}, {"score": 0.004202741104973709, "phrase": "extensive_work"}, {"score": 0.004173110338758352, "phrase": "stability_profiles"}, {"score": 0.003480993634130542, "phrase": "training_set"}, {"score": 0.002974886152979993, "phrase": "selected_feature_subset"}, {"score": 0.002721388234661538, "phrase": "empirical_way"}, {"score": 0.0024894376091589244, "phrase": "proteomics_datasets"}, {"score": 0.002337684811187166, "phrase": "stability_measure"}, {"score": 0.0021049977753042253, "phrase": "feature_selection_algorithm"}], "paper_keywords": ["feature selection", " high dimensionality", " feature stability"], "paper_abstract": "With the proliferation of extremely high-dimensional data, feature selection algorithms have become indispensable components of the learning process. Strangely, despite extensive work on the stability of learning algorithms, the stability of feature selection algorithms has been relatively neglected. This study is an attempt to fill that gap by quantifying the sensitivity of feature selection algorithms to variations in the training set. We assess the stability of feature selection algorithms based on the stability of the feature preferences that they express in the form of weights-scores, ranks, or a selected feature subset. We examine a number of measures to quantify the stability of feature preferences and propose an empirical way to estimate them. We perform a series of experiments with several feature selection algorithms on a set of proteomics datasets. The experiments allow us to explore the merits of each stability measure and create stability profiles of the feature selection algorithms. Finally, we show how stability profiles can support the choice of a feature selection algorithm.", "paper_title": "Stability of feature selection algorithms: a study on high-dimensional spaces", "paper_id": "WOS:000246389400005"}