{"auto_keywords": [{"score": 0.04963335999005966, "phrase": "argument_graph"}, {"score": 0.005708192612558166, "phrase": "spanning_subgraph"}, {"score": 0.004945957610597905, "phrase": "probability_distribution"}, {"score": 0.00481495049065317, "phrase": "abstract_argumentation"}, {"score": 0.004412397783369937, "phrase": "valuable_starting_point"}, {"score": 0.004384960761826366, "phrase": "theoretical_analysis"}, {"score": 0.003931402465972151, "phrase": "informal_arguments"}, {"score": 0.003834476721674575, "phrase": "free_text"}, {"score": 0.003546664687195951, "phrase": "expressed_doubt"}, {"score": 0.003179538613508042, "phrase": "sample_space"}, {"score": 0.0029777101656842803, "phrase": "probability_value"}, {"score": 0.0027540283945376594, "phrase": "actual_subgraph"}, {"score": 0.002461044825190643, "phrase": "attack_relationship"}, {"score": 0.0024380811094377006, "phrase": "original_argument_graph"}, {"score": 0.002415331146563814, "phrase": "marginal_distribution"}, {"score": 0.0021448505687807796, "phrase": "practical_argumentation_scenarios"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Computational models of argument", " Argument systems", " Abstract argumentation", " Probabilistic argumentation", " Uncertain argumentation", " Enthymemes"], "paper_abstract": "An argument graph is a graph where each node denotes an argument, and each arc denotes an attack by one argument on another. It offers a valuable starting point for theoretical analysis of argumentation following the proposals by Dung. However, the definition of an argument graph does not take into account the belief in the attacks. In particular, when constructing an argument graph from informal arguments, where each argument is described in free text, it is often evident that there is uncertainty about whether some of the attacks hold. This might be because there is some expressed doubt that an attack holds or because there is some imprecision in the language used in the arguments. In this paper, we use the set of spanning subgraphs of an argument graph as a sample space. A spanning subgraph contains all the arguments, and a subset of the attacks, of the argument graph. We assign a probability value to each spanning subgraph such that the sum of the assignments is 1. This means we can reflect the uncertainty over which is the actual subgraph using this probability distribution. Using the probability distribution over subgraphs, we can then determine the probability that a set of arguments is admissible or an extension. We can also obtain the probability of an attack relationship in the original argument graph as a marginal distribution (i.e. it is the sum of the probability assigned to each subgraph containing that attack relationship). We investigate some of the features of this proposal, and we consider the utility of our framework for capturing some practical argumentation scenarios. (C) 2013 Elsevier Inc. All rights reserved.", "paper_title": "Probabilistic qualification of attack in abstract argumentation", "paper_id": "WOS:000331503500005"}