{"auto_keywords": [{"score": 0.04913548507380238, "phrase": "metabolism-based_chemotaxis"}, {"score": 0.03813169063807108, "phrase": "new_metabolic_pathways"}, {"score": 0.004815340879031441, "phrase": "adaptive"}, {"score": 0.004767261858417823, "phrase": "evolutionary_potential"}, {"score": 0.004604023526673226, "phrase": "minimal_model"}, {"score": 0.004294052530714228, "phrase": "evolutionary_dynamics"}, {"score": 0.004126349202545883, "phrase": "behavioral_metabolution"}, {"score": 0.004065156038847781, "phrase": "mutual_influence"}, {"score": 0.003829290275367182, "phrase": "novel_situation"}, {"score": 0.0035183010916001664, "phrase": "metabolic_pathways"}, {"score": 0.0034146585649631692, "phrase": "behavioral_strategies"}, {"score": 0.003075296862372287, "phrase": "potentially_important_role"}, {"score": 0.0028822890425197582, "phrase": "adaptive_evolution"}, {"score": 0.0028536871476905847, "phrase": "early_life"}, {"score": 0.0026086775334428617, "phrase": "unorthodox_instantiation"}, {"score": 0.0025191653363555193, "phrase": "random_variation"}, {"score": 0.0024941578231560055, "phrase": "selective_retention"}, {"score": 0.002234893735225432, "phrase": "environmental_variation"}, {"score": 0.0021049977753042253, "phrase": "beneficial_metabolic_pathways"}], "paper_keywords": ["Metabolism", " adaptive behavior", " autopoiesis", " chemotaxis"], "paper_abstract": "We use a minimal model of metabolism-based chemotaxis to show how a coupling between metabolism and behavior can affect evolutionary dynamics in a process we refer to as behavioral metabolution. This mutual influence can function as an in-the-moment, intrinsic evaluation of the adaptive value of a novel situation, such as an encounter with a compound that activates new metabolic pathways. Our model demonstrates how changes to metabolic pathways can lead to improvement of behavioral strategies, and conversely, how behavior can contribute to the exploration and fixation of new metabolic pathways. These examples indicate the potentially important role that the interplay between behavior and metabolism could have played in shaping adaptive evolution in early life and protolife. We argue that the processes illustrated by these models can be interpreted as an unorthodox instantiation of the principles of evolution by random variation and selective retention. We then discuss how the interaction between metabolism and behavior can facilitate evolution through (i) increasing exposure to environmental variation, (ii) making more likely the fixation of some beneficial metabolic pathways, (iii) providing a mechanism for in-the-moment adaptation to changes in the environment and to changes in the organization of the organism itself, and (iv) generating conditions that are conducive to speciation.", "paper_title": "Behavioral Metabolution: The Adaptive and Evolutionary Potential of Metabolism-Based Chemotaxis", "paper_id": "WOS:000298413600001"}