{"auto_keywords": [{"score": 0.04070717218671349, "phrase": "ami_systems"}, {"score": 0.029191698423245326, "phrase": "malaca"}, {"score": 0.010742127970859107, "phrase": "ami_devices"}, {"score": 0.00481495049065317, "phrase": "ambient_intelligence_devices"}, {"score": 0.004495854882808791, "phrase": "context_aware_systems"}, {"score": 0.004270429323002124, "phrase": "effective_way"}, {"score": 0.004084186458199923, "phrase": "intelligent_and_autonomous_behavior"}, {"score": 0.003826441783705964, "phrase": "modeling_point"}, {"score": 0.003634458561248524, "phrase": "adequate_tools"}, {"score": 0.0035481809241908044, "phrase": "important_properties"}, {"score": 0.0034167069467881143, "phrase": "implementation_point"}, {"score": 0.0033701115914053083, "phrase": "agent_technologies"}, {"score": 0.0032563753253986912, "phrase": "communication_technologies"}, {"score": 0.003135679861067472, "phrase": "model_driven_engineering_process"}, {"score": 0.003082302636409597, "phrase": "automatic_generation"}, {"score": 0.0030612062471277388, "phrase": "agent-based_ami_systems"}, {"score": 0.0028580007147015734, "phrase": "explicit_modeling"}, {"score": 0.002604847103905297, "phrase": "fipa_compliant_agent_platforms"}, {"score": 0.002508239347479441, "phrase": "malacatiny_agents"}, {"score": 0.002325615071949044, "phrase": "model_driven_approach"}, {"score": 0.0022240004131756095, "phrase": "malacatiny"}, {"score": 0.002208765537836048, "phrase": "mobile_phones"}, {"score": 0.0021861082519868567, "phrase": "different_parameters"}], "paper_keywords": ["Software agents", " Agent oriented software engineering", " Model driven engineering", " Code generation", " Ambient intelligence", " Mobile phones"], "paper_abstract": "Ambient intelligence (AmI) systems are now considered a promising approach to assist people in their daily life. AmI proposes the development of context aware systems equipped with devices that can recognize your context and act accordingly. Agents provide an effective way to develop such systems since agents are reactive, proactive and exhibit an intelligent and autonomous behavior. However, current agent approaches do not adequately fulfill the requirements posed by AmI systems. From a modeling point of view, the aim should be to help in the design by providing adequate tools that assist in the development of important properties of AmI systems, such as context-awareness; and from an implementation point of view, agent technologies must be adapted to the diversity of AmI devices and communication technologies. As a solution to these issues we propose a Model driven engineering process, which supports the automatic generation of agent-based AmI systems. The source metamodel is PIM4Agents, a general purpose agent metamodel that we have adapted to support the explicit modeling of context aware systems, and the target metamodel is Malaca, an aspect-oriented agent architecture. Aspect-orientation makes Malaca platform-neutral for FIPA compliant agent platforms, simplifying the model driven process. The solution generates MalacaTiny agents, an implementation of Malaca that is able to run in AmI devices. We have evaluated the convenience of applying a model driven approach by measuring the degree of automation of our process and we have evaluated MalacaTiny for mobile phones by assessing different parameters, related to the scarcity of resources in AmI systems. All the results obtained are satisfactory.", "paper_title": "A model driven engineering process of platform neutral agents for ambient intelligence devices", "paper_id": "WOS:000329941000003"}