{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "google"}, {"score": 0.0261512685054203, "phrase": "google_scholar"}, {"score": 0.004275650416511604, "phrase": "bibliometric_indicators"}, {"score": 0.004209893377338457, "phrase": "ten_languages"}, {"score": 0.003757480190200645, "phrase": "maximum_and_minimum_values"}, {"score": 0.0035866734383189396, "phrase": "bibliometric_figures"}, {"score": 0.0030396665931462, "phrase": "practically_every_journal"}, {"score": 0.0029467742734417255, "phrase": "significant_differences"}, {"score": 0.0029164434911787187, "phrase": "growth_rates"}, {"score": 0.0026986685585382347, "phrase": "journal_rankings"}, {"score": 0.0023834640793589414, "phrase": "gsm_journal_rankings"}, {"score": 0.0023346234464901978, "phrase": "uncontrolled_growth"}], "paper_keywords": ["Google Scholar Metrics", " Google Scholar", " Scientific journals", " h-Index", " Journal rankings", " Bibliometric databases"], "paper_abstract": "In November 2012 the Google Scholar Metrics (GSM) journal rankings were updated, making it possible to compare bibliometric indicators in the ten languages indexed-and their stability-with the April 2012 version. The h-index and h-5 median of 1,000 journals were analysed, comparing their averages, maximum and minimum values and the correlation coefficient within rankings. The bibliometric figures grew significantly. In just seven and a half months the h-index of the journals increased by 15 % and the median h-index by 17 %. This growth was observed for all the bibliometric indicators analysed and for practically every journal. However, we found significant differences in growth rates depending on the language in which the journal is published. Moreover, the journal rankings seem to be stable between April and November, reinforcing the credibility of the data held by Google Scholar and the reliability of the GSM journal rankings, despite the uncontrolled growth of Google Scholar. Based on the findings of this study we suggest, firstly, that Google should upgrade its rankings at least semi-annually and, secondly, that the results should be displayed in each ranking proportionally to the number of journals indexed by language.", "paper_title": "Google Scholar Metrics evolution: an analysis according to languages", "paper_id": "WOS:000331559800047"}