{"auto_keywords": [{"score": 0.048929739366992464, "phrase": "oral_bioavailability"}, {"score": 0.021416621124171368, "phrase": "human_oral_bioavailability"}, {"score": 0.015533393536532656, "phrase": "molecular_properties"}, {"score": 0.0059343904111411935, "phrase": "intestinal_absorption"}, {"score": 0.00481495049065317, "phrase": "drug_discovery"}, {"score": 0.004121275290411653, "phrase": "scientific_community"}, {"score": 0.004081385289516914, "phrase": "publicly_available_and_reliable_source"}, {"score": 0.0037030390595465673, "phrase": "earlier_report"}, {"score": 0.003631671435460452, "phrase": "rat_oral_bioavailability_data"}, {"score": 0.0031079352545607267, "phrase": "poor_oral_bioavailability"}, {"score": 0.0030480018094535158, "phrase": "acceptable_values"}, {"score": 0.0029458777184930896, "phrase": "simple_rule"}, {"score": 0.0028333356794133053, "phrase": "general_filters"}, {"score": 0.0027651847105654363, "phrase": "high_confidence"}, {"score": 0.002264607102799332, "phrase": "false_positive_rate"}, {"score": 0.0021569129153653777, "phrase": "\"rule-based\"_approaches"}, {"score": 0.0021049977753042253, "phrase": "human_bioavailability"}], "paper_keywords": [""], "paper_abstract": "A critically evaluated database of human oral bioavailability for 768 chemical compounds is described in this study (http://modem.ucsd.edu/adme), which provides the scientific community a publicly available and reliable source for developing predictive models of human oral bioavailability. The correlations between several important molecular properties and human oral bioavailability were investigated and compared with an earlier report by analyzing the rat oral bioavailability data (J. Med. Chem. 2002, 45, 2615). We showed that the percentages of compounds meeting the criteria based on molecular properties does not distinguish compounds with poor oral bioavailability from those with acceptable values, which may suggest that no simple rule based on molecular properties can be used as general filters to predict oral bioavailability with high confidence. A data set of intestinal absorption was also examined and compared with that of oral bioavailability. The performance of these rules based on molecular properties in the prediction of intestinal absorption is obviously much better than that of oral bioavailability in term of false positive rate, and, therefore, the applications of the \"rule-based\" approaches on the prediction of human bioavailability should be very cautious.", "paper_title": "ADME evaluation in drug discovery. 6. Can oral bioavailability in humans be effectively predicted by simple molecular property-based rules?", "paper_id": "WOS:000245136100020"}