{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "nationwide_dur_system"}, {"score": 0.015625895778061304, "phrase": "local_dur_systems"}, {"score": 0.013902773686668316, "phrase": "drug_contraindications"}, {"score": 0.004714029359893602, "phrase": "korean"}, {"score": 0.004643240799492922, "phrase": "korea"}, {"score": 0.00460125407969429, "phrase": "local_dur"}, {"score": 0.004410331572207815, "phrase": "health_insurance"}, {"score": 0.00438370856272802, "phrase": "submission_systems"}, {"score": 0.004214516848083075, "phrase": "local_dur_system"}, {"score": 0.003860158978186175, "phrase": "prescribing_practices"}, {"score": 0.0036998728605395384, "phrase": "monthly_number"}, {"score": 0.003600351201298387, "phrase": "health_insurance_claims_data_warehouse"}, {"score": 0.003556980011529794, "phrase": "hira"}, {"score": 0.0035141291835319682, "phrase": "monthly_proportions"}, {"score": 0.0032087293763784722, "phrase": "outpatient_clinic_level"}, {"score": 0.003141364320497748, "phrase": "interrupted_time_series_analysis"}, {"score": 0.0030941113607985205, "phrase": "government_announcements"}, {"score": 0.0027324313978200837, "phrase": "government_announcement"}, {"score": 0.002691313072643267, "phrase": "short_term"}, {"score": 0.002548331088496964, "phrase": "nationwide_dur_introduction"}, {"score": 0.002464709648714996, "phrase": "duplicate_guidelines"}, {"score": 0.0023408288327263316, "phrase": "main_reason"}, {"score": 0.00229164285862567, "phrase": "doctor's_ignorance"}, {"score": 0.0022434880661725493, "phrase": "regulated_drugs"}, {"score": 0.0022231606165229235, "phrase": "non-regulated_drugs"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ireland_ltd."}], "paper_keywords": ["Nationwide drug utilization review system", " Local drug utilization review system", " Drug-drug interaction", " Drug-age contraindications", " Drug-pregnancy contraindications"], "paper_abstract": "Objective: Outpatient clinics in Korea usually have local DUR (drug utilisation review) systems, which are integrated with EMRs or health insurance claims submission systems. Whenever, the government announces a list of drug contraindications, each local DUR system loads the list and applies it in practice. In December 2010, a nationwide DUR system was introduced. This study is to investigate the impact of the nationwide DUR system on prescribing practices where local DUR systems are already operating. Methods: Between January 2009 and December 2012 the monthly number of drugs per prescription was retrieved from the health insurance claims data warehouse at the Health Insurance Review and Assessment (HIRA). The monthly proportions of 3 DDI (drug-drug interaction) pairs, 6 drug-age contraindications, and 3 drug-pregnancy contraindications from January 2007 to December 2012, at the outpatient clinic level, were also retrieved. An interrupted time series analysis was used for controlling government announcements of drug contraindications. Results: There was no difference in the number of drugs per prescription before and after the introduction of the nationwide DUR system. Most proportions of the 3 DDI pairs, 6 drug-age contraindications, and 3 drug-pregnancy contraindications, were significantly reduced following the government announcement of drug contraindications in the short term and/or long term. Conclusion: The number of drugs per prescription was not related to the nationwide DUR introduction in places where local DUR systems are operating. The introduction of duplicate guidelines, in locations where the guidelines were already well followed, is considered to be the main reason for this. Furthermore, the Doctor's ignorance of alerts, and their continued substitution of regulated drugs, for non-regulated drugs, likely played a role in nullifying the effectiveness of the nationwide DUR system. (C) 2015 Elsevier Ireland Ltd. All rights reserved.", "paper_title": "The effect of the introduction of a nationwide DUR system where local DUR systems are operating-The Korean experience", "paper_id": "WOS:000362411900004"}