{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "persistent_forwarding_loops"}, {"score": 0.0046046429665581555, "phrase": "measurement_study"}, {"score": 0.004519736937243476, "phrase": "flooding_attack"}, {"score": 0.004133390261297075, "phrase": "shared_links"}, {"score": 0.004087469540575263, "phrase": "internet_connectivity"}, {"score": 0.003865376734263166, "phrase": "extensive_measurements"}, {"score": 0.0033550841271846065, "phrase": "destination_domains"}, {"score": 0.0031490944606172152, "phrase": "multiple_vantage_points"}, {"score": 0.002836942411239067, "phrase": "possible_cause"}, {"score": 0.0026726283357752585, "phrase": "pull-up_routes"}, {"score": 0.0025556529150386168, "phrase": "stub_network"}, {"score": 0.00247128526955136, "phrase": "large_isps"}, {"score": 0.0023807981747706376, "phrase": "flood_links"}, {"score": 0.002354302193867031, "phrase": "backbone_network"}, {"score": 0.002259642580775186, "phrase": "first_study"}, {"score": 0.0022013916728990564, "phrase": "ddos_attacks"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v._all_rights"}], "paper_keywords": ["internet routing", " persistent forwarding loop", " flooding attacks", " distributed denial of service", " misconfiguration"], "paper_abstract": "In this paper, we present a measurement study of persistent forwarding loops and a flooding attack that exploits persistent forwarding loops. Persistent forwarding loops may share one or more links with forwarding paths to some hosts. An attacker can exploit persistent forwarding loops to overload the shared links and disrupt Internet connectivity to those hosts. To understand the extent of this vulnerability, we perform extensive measurements to systematically study persistent forwarding loops. We find that persistent forwarding loops do exist in the Internet. At least 35 million addresses experience persistent forwarding loops, and at least 11 million addresses can be attacked by exploiting such persistent forwarding loops. In addition, 87.4% of persistent forwarding loops involve routers in destination domains, which can be observed from various locations. This makes it possible to launch attacks from multiple vantage points. We also find that most persistent forwarding loops are just two hops long, which enables an attacker to significantly amplify traffic to them. We further investigate the possible cause of persistent forwarding loops, and find that about 50% of them are caused by neglecting to configure pull-up routes. We show that even if the misconfiguration occurs in a stub network, it may cause persistent forwarding loops involving routers in large ISPs, and can potentially be exploited by attackers to flood links in a backbone network. To the best of our knowledge, this is the first study of exploiting routing misconfigurations to launch DDoS attacks and understanding the impact of such attacks. (C) 2007 Elsevier B.V. All rights reserved.", "paper_title": "A measurement study of persistent forwarding loops on the Internet", "paper_id": "WOS:000250708400005"}