{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "point_process_models"}, {"score": 0.03828152818695625, "phrase": "confidence_bounds"}, {"score": 0.00475413908468027, "phrase": "neural_spiking_activity"}, {"score": 0.0046544807197808095, "phrase": "intrinsic_and_extrinsic_factors"}, {"score": 0.004133627071344356, "phrase": "complete_model_application"}, {"score": 0.003945266418163835, "phrase": "model_parameters"}, {"score": 0.0039119492240482, "phrase": "observed_data"}, {"score": 0.0032321559007422087, "phrase": "time-rescaling_theorem"}, {"score": 0.0031643005824589917, "phrase": "parametric_bootstrap_sampling"}, {"score": 0.002931569771634119, "phrase": "generalized_linear_model"}, {"score": 0.002809732883291955, "phrase": "bootstrap_simulations"}, {"score": 0.0027274643070540733, "phrase": "closed-form_analytic_solutions"}, {"score": 0.0026363807171515255, "phrase": "adaptive_point_process_model"}, {"score": 0.0026140878612307536, "phrase": "hippocampal_place_field_plasticity"}, {"score": 0.002570064617803693, "phrase": "analytical_confidence_bounds"}, {"score": 0.0024632148715152393, "phrase": "bootstrap_samples"}, {"score": 0.0024423826953133844, "phrase": "adaptive_point_process_models"}, {"score": 0.0022530375696567136, "phrase": "neural_representations"}, {"score": 0.0021319959284827896, "phrase": "useful_guides"}, {"score": 0.0021049977753042253, "phrase": "scientific_inference"}], "paper_keywords": [""], "paper_abstract": "Characterizing neural spiking activity as a function of intrinsic and extrinsic factors is important in neuroscience. Point process models are valuable for capturing such information; however, the process of fully applying these models is not always obvious. A complete model application has four broad steps: specification of the model, estimation of model parameters given observed data, verification of the model using goodness of fit, and characterization of the model using confidence bounds. Of these steps, only the first three have been applied widely in the literature, suggesting the need to dedicate a discussion to how the time-rescaling theorem, in combination with parametric bootstrap sampling, can be generally used to compute confidence bounds of point process models. In our first example, we use a generalized linear model of spiking propensity to demonstrate that confidence bounds derived from bootstrap simulations are consistent with those computed from closed-form analytic solutions. In our second example, we consider an adaptive point process model of hippocampal place field plasticity for which no analytical confidence bounds can be derived. We demonstrate how to simulate bootstrap samples from adaptive point process models, how to use these samples to generate confidence bounds, and how to statistically test the hypothesis that neural representations at two time points are significantly different. These examples have been designed as useful guides for performing scientific inference based on point process models.", "paper_title": "Computing Confidence Intervals for Point Process Models", "paper_id": "WOS:000295321100001"}