{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "environmental_information"}, {"score": 0.009990761384397452, "phrase": "social_media"}, {"score": 0.004410713064804144, "phrase": "people's_accounts"}, {"score": 0.003945949295597681, "phrase": "situated_information"}, {"score": 0.0034944094552943, "phrase": "environmentally_friendly_everyday_life"}, {"score": 0.003401278997237025, "phrase": "interlinked_set"}, {"score": 0.0031898890682164212, "phrase": "dominant_versions"}, {"score": 0.0031577303835881964, "phrase": "greener_life"}, {"score": 0.003073545175760353, "phrase": "routinised_alignment"}, {"score": 0.0028824650336365465, "phrase": "re-arranging_practices"}, {"score": 0.002805597755796506, "phrase": "first_place"}, {"score": 0.002758597251689795, "phrase": "culturally_non-habitual_character"}, {"score": 0.002721562843196732, "phrase": "informational_value"}, {"score": 0.0027032319980161805, "phrase": "material_practices"}, {"score": 0.002509541181962613, "phrase": "everyday_life"}, {"score": 0.0024758420717852113, "phrase": "potential_implications"}, {"score": 0.0024591621759745648, "phrase": "policy_making"}, {"score": 0.002442594378453517, "phrase": "information_campaigns"}, {"score": 0.0023774292521631093, "phrase": "underrepresented_area"}, {"score": 0.002275214783528274, "phrase": "research_area"}, {"score": 0.0022070310530794097, "phrase": "practice_approach"}, {"score": 0.0021847592782091923, "phrase": "theoretical_interest"}, {"score": 0.0021700361584578633, "phrase": "everyday_life_politics"}, {"score": 0.002148136905808445, "phrase": "novel_addition"}, {"score": 0.0021192805640815795, "phrase": "social_engagement"}, {"score": 0.0021049977753042253, "phrase": "online_environments"}], "paper_keywords": ["Environmental management", " Information practice", " Internet", " Social media", " Qualitative thematic analysis", " Subactivism"], "paper_abstract": "Purpose - This article aims to explore construction, production and distribution of environmental information in social media. Specifically, the focus is on people's accounts in social media of their everyday life practices aimed at leading what are considered environmentally friendly lives. The article seeks to establish how through the reproduction of alignments of certain everyday and domestic practices with environmental destruction and protection situated information on the environment is constructed and made available. Design/methodology/approach - This study is based on a qualitative, interpretative analysis of content, materiality and form of blogs and of their enmeshed social media applications, dedicated specifically to aspects of environmentally friendly everyday life. The blogs were selected from an interlinked set of 60 Swedish language environment blogs. Findings - Formal, topical and social arrangements give priority to certain material conditions and practices that then underpin a set of dominant versions of a greener life, while others remain submerged. The routinised alignment of certain practices with the environment is indispensable for environmental information to work. However, breaking with routines and re-arranging practices is what makes them possible in the first place. De-routinisation and the culturally non-habitual character make for the informational value of material practices and of practices of engagement. Social implications - The study contributes to the understanding of what makes environmental information meaningful in everyday life. This has potential implications for policy making and information campaigns in the area. Originality/value - Environmental issues are an underrepresented area of research in US. This article contributes to the development of this research area in the field. Furthermore, uniting a practice approach with a theoretical interest in everyday life politics is a novel addition to studies of social engagement in online environments.", "paper_title": "Interrupting practices that want to matter The making, shaping and reproduction of environmental information online", "paper_id": "WOS:000309295600004"}