{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "evaluation_studies"}, {"score": 0.023099524158307332, "phrase": "health_informatics"}, {"score": 0.009331828379179997, "phrase": "systematic_reviews"}, {"score": 0.00795559524904938, "phrase": "health_informatics_interventions"}, {"score": 0.00462919213721188, "phrase": "health_informatics_applications"}, {"score": 0.004564593196155079, "phrase": "initial_list"}, {"score": 0.004207230913063179, "phrase": "health_informatics_studies"}, {"score": 0.004160177106153782, "phrase": "account_guidelines"}, {"score": 0.0041136473765874815, "phrase": "medical_research"}, {"score": 0.003988345858759183, "phrase": "increasing_number"}, {"score": 0.003943730374281591, "phrase": "health_informatics_evaluation"}, {"score": 0.0036966717141736355, "phrase": "stare-hi_principles"}, {"score": 0.0031223774204093713, "phrase": "unexpected_observations"}, {"score": 0.0030101827310631915, "phrase": "comprehensive_list"}, {"score": 0.002951444412262927, "phrase": "health_informatics_evaluations"}, {"score": 0.0028775998963807324, "phrase": "health_informatics_journals"}, {"score": 0.002861441830192181, "phrase": "general_medical_journals"}, {"score": 0.002727700630869639, "phrase": "proper_context"}, {"score": 0.0026895647154863405, "phrase": "generalis_ability"}, {"score": 0.0024856240785174444, "phrase": "study_planning"}, {"score": 0.0023827927890399357, "phrase": "better_publication"}, {"score": 0.002362741548363011, "phrase": "quantitative_and_qualitative_evaluation_studies"}, {"score": 0.0023035922232490106, "phrase": "evidence-based_health_informatics"}, {"score": 0.0021773853011112882, "phrase": "scientific_literature"}, {"score": 0.0021049977753042253, "phrase": "real_practice"}], "paper_keywords": ["Medical Informatics", " Guidelines", " Publishing standards", " Research design"], "paper_abstract": "Objective: Development of guidelines for publication of evaluation studies of Health Informatics applications. Methods: An initial list of issues to be addressed in reports on evaluation studies was drafted based on experiences as editors and reviewers of journals in Health Informatics and as authors of systematic reviews of Health Informatics studies, taking into account guidelines for reporting of medical research. This list has been discussed in several rounds by an increasing number of experts in Health Informatics evaluation during conferences and by using e-mail and has been put up for comments on the web. Results: A set of STARE-HI principles to be addressed in papers describing evaluations of Health Informatics interventions is presented. These principles include formulation of title and abstract, of introduction (e.g. scientific background, study objectives), study context (e.g. organizational Setting, system details), methods (e.g. study design, outcome measures), results (e.g. study findings, unexpected observations) and discussion and conclusion of an IT evaluation paper. Conclusion: A comprehensive list of principles relevant for properly describing Health Informatics evaluations has been developed. When manuscripts submitted to Health Informatics journals and general medical journals adhere to these aspects, readers will be better positioned to place the studies in a proper context and judge their validity and generalis ability. It will also be possible to judge better whether papers will fit in the scope of meta-analyses of Health Informatics interventions. STARE-HI may also be used for study planning and hence positively influence the quality of evaluation studies in Health Informatics. We believe that better publication of both quantitative and qualitative evaluation studies is an important step toward the vision of evidence-based Health Informatics. This study is based on experiences from editors, reviewers, authors of systematic reviews and readers of the scientific literature. The applicability of the principles has not been evaluated in real practice. Only when authors start to use these principles for reporting, shortcomings in the principles will emerge. (C) 2008 Elsevier Ireland Ltd. All rights reserved.", "paper_title": "STARE-HI - Statement on reporting of evaluation studies in Health Informatics", "paper_id": "WOS:000262768000001"}