{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "preservice_teachers'_behavior_change"}, {"score": 0.04603418765396699, "phrase": "preservice_teachers"}, {"score": 0.004750178261675602, "phrase": "computer-simulated_teaching"}, {"score": 0.00468627326602559, "phrase": "adapting_training_methods"}, {"score": 0.004623224002010226, "phrase": "specific_teacher_traits"}, {"score": 0.0044692705329574, "phrase": "training_effects"}, {"score": 0.004262273304740847, "phrase": "aptitude-treatment_interaction_research"}, {"score": 0.0034780071331554003, "phrase": "computer-simulated_teaching_experience"}, {"score": 0.0032279990773657215, "phrase": "cs-tgcts_simulation_program"}, {"score": 0.0030992666061123533, "phrase": "preservice_teachers'_actual_use"}, {"score": 0.0026157259734105, "phrase": "high_levels"}, {"score": 0.002494361792853833, "phrase": "intrapersonal_intelligence"}, {"score": 0.00237861522566195, "phrase": "judicial_or_legislative_thinking_styles"}], "paper_keywords": ["architectures for educational technology system", " improving classroom teaching", " interactive learning environments", " simulations", " teaching/learning strategies"], "paper_abstract": "Adapting training methods to specific teacher traits to best facilitate the training effects for preservice teachers is an important, yet neglected, topic in aptitude-treatment interaction research. This study investigated interactions between four personal traits (CT-dispositions, thinking styles, CT-skills, and intrapersonal intelligence) and two designed treatments on preservice teachers' behavior change during a computer-simulated teaching experience. One hundred and seventy-eight preservice teachers participated in this study. The CS-TGCTS simulation program was employed to measure the preservice teachers' actual use of effective teacher behaviors, as well as the four targeted personal traits which were measured by three Likert-scale inventories and one multiple-choice test. The results suggest that preservice teachers with high levels of CT-dispositions, CT-skills, and intrapersonal intelligence - as well as those with judicial or legislative thinking styles - are mindful, analytical, and reflective in their teaching practices and therefore more likely to continually improve their teaching skills. (C) 2005 Elsevier Ltd. All rights reserved.", "paper_title": "Aptitude-treatment interactions in preservice teachers' behavior change during computer-simulated teaching", "paper_id": "WOS:000243813600010"}