{"auto_keywords": [{"score": 0.0489152367824777, "phrase": "software_projects"}, {"score": 0.017673094933884415, "phrase": "pca"}, {"score": 0.010612387000973441, "phrase": "principal_component_analysis"}, {"score": 0.009895663493334886, "phrase": "software_project_development"}, {"score": 0.00714456730545028, "phrase": "owa"}, {"score": 0.0047310525657970615, "phrase": "integrated_evaluation_model"}, {"score": 0.004425299304063172, "phrase": "software_industry"}, {"score": 0.004363480951473701, "phrase": "high_quality_products"}, {"score": 0.004302522426263979, "phrase": "customers'_needs"}, {"score": 0.004227515355865597, "phrase": "software_development"}, {"score": 0.0038989120088094185, "phrase": "excellent_help"}, {"score": 0.0038309141193444015, "phrase": "developing_strategy"}, {"score": 0.0037773674108196376, "phrase": "software_project"}, {"score": 0.0033749889869455407, "phrase": "distinguishing_characteristic"}, {"score": 0.0032812562034088646, "phrase": "respective_advantages"}, {"score": 0.0030689098754563982, "phrase": "well-designed_questionnaire"}, {"score": 0.0030047427137652218, "phrase": "experts'_opinions"}, {"score": 0.002850116748762153, "phrase": "evaluation_results"}, {"score": 0.0026655969705316708, "phrase": "accumulated_variance"}, {"score": 0.0026375718041787, "phrase": "original_ones"}, {"score": 0.0025194861926779223, "phrase": "resultant_criteria"}, {"score": 0.00247548600804924, "phrase": "information_requirement"}, {"score": 0.002449454693767392, "phrase": "empirical_validation"}, {"score": 0.0023897792141068437, "phrase": "taiwan"}, {"score": 0.0021049977753042253, "phrase": "increased_complexity"}], "paper_keywords": [""], "paper_abstract": "With the restrictions of time and cost, the complexity of software project development implies that the software industry cannot develop high quality products to satisfy the customers' needs. The evaluation of software development cannot only assist the deciders with the prediction of feasibility and the impact of benefits in advance, but also offer excellent help for the improvement and developing strategy of management after software project is developed. This research proposed a principal component analysis (PCA) and ordered weighted averaging (OWA) integrated evaluation model to overcome the complexity adhered in appropriately evaluating the development of software projects. The distinguishing characteristic of this model lies in integrating the respective advantages of PCA and OWA operators to appropriately evaluate the development of software projects. In this model, a well-designed questionnaire was used to express the experts' opinions on the development of software projects with respect to each criterion. The amount of evaluation results was reduced by means of PCA with the aim at cutting down the number of criteria but the accumulated variance of the original ones was preserved. OWA was used to flexibly obtain the weights of resultant criteria under the consideration of information requirement. In empirical validation, three software projects belonging to one famous hospital in Taiwan were selected as the targets to examine the appropriateness of this model. A comparison was taken to reveal the superiority of this model. As expected, the model was more effective with the increased complexity the evaluation of software project development.", "paper_title": "Empirical research of the principal component analysis and ordered weighted averaging integrated evaluation model on software projects", "paper_id": "WOS:000244842600004"}