{"auto_keywords": [{"score": 0.049584128839210984, "phrase": "protein_function_prediction"}, {"score": 0.014478158140938183, "phrase": "predictive_accuracy"}, {"score": 0.01333333091145428, "phrase": "new_insights"}, {"score": 0.009193946526704747, "phrase": "comprehensible_protein_function_prediction_models"}, {"score": 0.00481495049065317, "phrase": "comprehensible_classification_models"}, {"score": 0.004339609346924681, "phrase": "important_issues"}, {"score": 0.004206338218873218, "phrase": "discovered_knowledge"}, {"score": 0.0038304902197108643, "phrase": "protein_functions"}, {"score": 0.0037321585095070483, "phrase": "overall_goal"}, {"score": 0.0034881076466982226, "phrase": "refreshing_new_perspective"}, {"score": 0.0031928040608991543, "phrase": "induced_protein_function_prediction_models"}, {"score": 0.002499798127196099, "phrase": "system's_predictions"}, {"score": 0.00234834406550549, "phrase": "new_biological_hypotheses"}, {"score": 0.0021831803612759855, "phrase": "critical_review"}], "paper_keywords": ["Biology", " classifier design and evaluation", " induction", " machine learning"], "paper_abstract": "The literature on protein function prediction is currently dominated by works aimed at maximizing predictive accuracy, ignoring the important issues of validation and interpretation of discovered knowledge, which can lead to new insights and hypotheses that are biologically meaningful and advance the understanding of protein functions by biologists. The overall goal of this paper is to critically evaluate this approach, offering a refreshing new perspective on this issue, focusing not only on predictive accuracy but also on the comprehensibility of the induced protein function prediction models. More specifically, this paper aims to offer two main contributions to the area of protein function prediction. First, it presents the case for discovering comprehensible protein function prediction models from data, discussing in detail the advantages of such models, namely, increasing the confidence of the biologist in the system's predictions, leading to new insights about the data and the formulation of new biological hypotheses, and detecting errors in the data. Second, it presents a critical review of the pros and cons of several different knowledge representations that can be used in order to support the discovery of comprehensible protein function prediction models.", "paper_title": "On the Importance of Comprehensible Classification Models for Protein Function Prediction", "paper_id": "WOS:000274063600016"}