{"auto_keywords": [{"score": 0.04508646578033619, "phrase": "multi-objective"}, {"score": 0.00481495049065317, "phrase": "super-linear_performance"}, {"score": 0.0047839735747931605, "phrase": "parallel_multi-objective_evolutionary_algorithms"}, {"score": 0.004499409294175065, "phrase": "sorting_genetic_algorithm_ii"}, {"score": 0.004398872331144531, "phrase": "strength_pareto_evolutionary_algorithm"}, {"score": 0.004300572109650207, "phrase": "cellular_genetic_algorithm"}, {"score": 0.003916098498242888, "phrase": "global_solution"}, {"score": 0.003865826699096508, "phrase": "original_multi-objective_algorithm"}, {"score": 0.003816197777388722, "phrase": "complete_solutions"}, {"score": 0.0035087260813209593, "phrase": "cooperative_coevolutionary_multi-objective_approaches"}, {"score": 0.003331915219811852, "phrase": "complex_problems"}, {"score": 0.003299765620885585, "phrase": "large_number"}, {"score": 0.00323639105050096, "phrase": "problem_decomposition"}, {"score": 0.003163985877966426, "phrase": "island_level"}, {"score": 0.002880829737447174, "phrase": "real-world_problem"}, {"score": 0.0028530201960995896, "phrase": "grid_computing"}, {"score": 0.0027622407190589326, "phrase": "independent_tasks"}, {"score": 0.0026060359255636444, "phrase": "latest_machine"}, {"score": 0.0024586427394152196, "phrase": "estimated_time"}, {"score": 0.002357391911165024, "phrase": "coevolutionary_algorithms"}, {"score": 0.002253000188119187, "phrase": "pareto_front_approximations"}, {"score": 0.0021883400011393564, "phrase": "resulting_speedups"}, {"score": 0.0021462652605453163, "phrase": "multicore_machine"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Cooperative coevolutionary EAs", " Multi-objective optimization", " Parallel algorithms"], "paper_abstract": "This article introduces three new multi-objective cooperative coevolutionary variants of three state-of-the-art multi-objective evolutionary algorithms, namely, Non-dominated Sorting Genetic Algorithm II (NSGA-II), Strength Pareto Evolutionary Algorithm 2 (SPEA2) and Multi-objective Cellular Genetic Algorithm (MOCeII). In such a coevolutionary architecture, the population is split into several subpopulations or islands, each of them being in charge of optimizing a subset of the global solution by using the original multi-objective algorithm. Evaluation of complete solutions is achieved through cooperation, i.e., all subpopulations share a subset of their current partial solutions. Our purpose is to study how the performance of the cooperative coevolutionary multi-objective approaches can be drastically increased with respect to their corresponding original versions. This is specially interesting for solving complex problems involving a large number of variables, since the problem decomposition performed by the model at the island level allows for much faster executions (the number of variables to handle in every island is divided by the number of islands). We conduct a study on a real-world problem related to grid computing, the hi-objective robust scheduling problem of independent tasks. The goal in this problem is to minimize makespan (i.e., the time when the latest machine finishes its assigned tasks) and to maximize the robustness of the schedule (i.e., its tolerance to unexpected changes on the estimated time to complete the tasks). We propose a parallel, multithreaded implementation of the coevolutionary algorithms and we have analyzed the results obtained in terms of both the quality of the Pareto front approximations yielded by the techniques as well as the resulting speedups when running them on a multicore machine. (C) 2011 Elsevier Ltd. All rights reserved.", "paper_title": "Achieving super-linear performance in parallel multi-objective evolutionary algorithms by means of cooperative coevolution", "paper_id": "WOS:000317884900003"}