{"auto_keywords": [{"score": 0.048564928403357514, "phrase": "web_citations"}, {"score": 0.015436823223834596, "phrase": "social_sciences"}, {"score": 0.00747473036199995, "phrase": "web_information"}, {"score": 0.00481495049065317, "phrase": "web_academic_resources"}, {"score": 0.004515252649226697, "phrase": "rapid_change"}, {"score": 0.004352411290383643, "phrase": "information_resources"}, {"score": 0.004253618550301311, "phrase": "academic_communication"}, {"score": 0.0041001740903338834, "phrase": "traditional_print_environment"}, {"score": 0.0039522429946090174, "phrase": "internet_media"}, {"score": 0.0038981499110532307, "phrase": "new_and_relatively_unexplored_area"}, {"score": 0.0036218682585355895, "phrase": "web_recourses"}, {"score": 0.0032287289440915187, "phrase": "cssci"}, {"score": 0.003027462227648001, "phrase": "web_resources"}, {"score": 0.002931569771634119, "phrase": "urls_frequency"}, {"score": 0.00283870598459543, "phrase": "frequency_distribution"}, {"score": 0.002799810685137358, "phrase": "regression_models"}, {"score": 0.0027741805232627433, "phrase": "spss"}, {"score": 0.0024389277933858054, "phrase": "webpage_types"}, {"score": 0.0021049977753042253, "phrase": "garfield's_citation_distribution_curve"}], "paper_keywords": ["Web recourses", " Web citation", " Humanities and social sciences", " Web reference"], "paper_abstract": "In this era of a rapid change in the way people finding and using information resources, despite that the academic communication and using patterns for people in the traditional print environment have been studied for many years, the Internet media presents a new and relatively unexplored area for such study. In this article, we explored the distribution and utilization of web recourses in humanities and social sciences based on web citations. We collected 1,421,731 citations listed in 148,172 articles from 493 journals published during the period of 2006-2007 in the CSSCI, which resulted in 44,973 web citations. We counted the amount and types of web resources used in various disciplines, analyzed the URLs frequency from the host-level, fitted the frequency distribution into the regression models with SPSS, and perform the disciplines coupling analysis based on the web citations. We found out that: (a) The distributions of web citations by years or by websites and webpage types are selective and regular; (b) Great disparity exists among various disciplines in terms of using web information, and the high-frequency websites; (c) The frequency distribution of web citations is similar to the Garfield's citation distribution curve; (d) Some relationships between disciplines are detected, based on the utilization of web information.", "paper_title": "An empirical study on the utilization of web academic resources in humanities and social sciences based on web citations", "paper_id": "WOS:000278267100001"}