{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "conversational_age"}, {"score": 0.03772629139946228, "phrase": "conversational_customization"}, {"score": 0.004267896572751978, "phrase": "first_the_author"}, {"score": 0.00419229472352669, "phrase": "metaphorical_concept"}, {"score": 0.003991196463806465, "phrase": "industrial_age"}, {"score": 0.0037490909410974166, "phrase": "built_environment"}, {"score": 0.0034902664176377943, "phrase": "woka"}, {"score": 0.003093249591867931, "phrase": "possible_solution"}, {"score": 0.002905454531687249, "phrase": "possible_way"}, {"score": 0.0028539179130824786, "phrase": "true_paradigm_shift"}, {"score": 0.0027659126653647712, "phrase": "architectural_space"}, {"score": 0.0026806139086152365, "phrase": "design_approach"}, {"score": 0.002271476019266231, "phrase": "new_way"}, {"score": 0.0021915573326125428, "phrase": "conversation_and_intersubjective_processes"}, {"score": 0.0021049977753042253, "phrase": "conceptual_base"}], "paper_keywords": ["Design", " Creativity", " Architecture", " Cybernetics", " Conversational customization"], "paper_abstract": "Purpose - The purpose of this paper is to investigate possibilities for a more intersubjective digital design process that amplifies the potential for novelty to arise. Design/methodology/approach - First the author will explore the metaphorical concept of the house as a machine in two different contexts, the industrial age, and conversational age, discussing how each concept can generate variety in the built environment. Second, the author presents some examples of conversational customization in architecture along with the Woka, an ongoing research project that attempts to create a more conversational design process. Finally, the author will discuss the possibility of conversational customization in design as a possible solution to a more open and intersubjective process in design. Findings - The author finds that a possible way to reach a true paradigm shift in the process of production of architectural space is to use conversation as a design approach, from design to use, shifting the focus from the object to the process, amplifying variety and the potential for novelty to arise. Practical implications - The objective is to offer designers a new way of thinking about design that focusses on conversation and intersubjective processes. Originality/value - The notion of conversational customization may offer a conceptual base for architects to explore conversation in design.", "paper_title": "The machine for living in the conversational age", "paper_id": "WOS:000366638300021"}