{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "process_knowledge"}, {"score": 0.010501221190447512, "phrase": "rapid_process_configuration"}, {"score": 0.009962443710714461, "phrase": "process_configuration"}, {"score": 0.008460232860377987, "phrase": "systematic_knowledge_model"}, {"score": 0.00768407949477999, "phrase": "model"}, {"score": 0.004714023408114857, "phrase": "rapid_product_development"}, {"score": 0.004639712384096822, "phrase": "oil_quick_and_reliable_process_planning"}, {"score": 0.004400329132129292, "phrase": "product_configuration"}, {"score": 0.0037935066882208235, "phrase": "manufacturing_process_cases"}, {"score": 0.0036553070575015344, "phrase": "different_levels"}, {"score": 0.002416589459425828, "phrase": "involved_configuration_rules"}, {"score": 0.0022674379203603224, "phrase": "graphical_process_planner"}, {"score": 0.002219790619936024, "phrase": "knowledge_model"}, {"score": 0.0021731423856364003, "phrase": "ail_aerospace_example"}, {"score": 0.0021049977753042253, "phrase": "proposed_process_knowledge"}], "paper_keywords": ["Process configuration", " Process planning", " Knowledge reuse", " Product family", " STEP"], "paper_abstract": "Rapid product development relies heavily Oil quick and reliable process planning and knowledge reuse. Process configuration borrows the principles of product configuration and applies them to process planning, It allows the reuse of hierarchical, historical and case-based manufacturing process knowledge to generate process plans efficiently and effectively. This paper presents a systematic knowledge model for manufacturing process cases. The model represents process knowledge at different levels Of granularity and to facilitate process configuration. With this knowledge Model the process knowledge is categorized into 6 levels: (i) core process skeletons, (ii) process networks, (iii) process routes, (iv) process segments, (v) processes/workplan, and (Vi) operations/working step. Based on the systematic knowledge model, this paper also proposes an approach to achieve rapid process configuration by reusing the process knowledge and by performing the involved configuration rules so as to create an appropriate, reliable and effective process plan. The prototype for a graphical process planner based on this knowledge model is developed and ail aerospace example is used to validate the proposed process knowledge Model and process configuration. (C) 2008 Elsevier Ltd. All rights reserved.", "paper_title": "Systematic modeling and reusing of process knowledge for rapid process configuration", "paper_id": "WOS:000260203300009"}