{"auto_keywords": [{"score": 0.04933167036983738, "phrase": "new_user_problem"}, {"score": 0.03686325203206044, "phrase": "good_recommendations"}, {"score": 0.00481495049065317, "phrase": "profile_expansion_techniques"}, {"score": 0.0047026237903774895, "phrase": "collaborative_filtering_techniques"}, {"score": 0.004539005582217305, "phrase": "effective_method"}, {"score": 0.004485735417293941, "phrase": "personalized_recommendations"}, {"score": 0.004312622975366676, "phrase": "content-based_filtering"}, {"score": 0.0038624981944755813, "phrase": "precisely_the_reason"}, {"score": 0.003757480190200645, "phrase": "cold-start_problem"}, {"score": 0.003640938643675543, "phrase": "new_items"}, {"score": 0.003097865379563127, "phrase": "unsatisfied_user"}, {"score": 0.002807178116892454, "phrase": "novel_approach"}, {"score": 0.0026986685585382347, "phrase": "query_expansion_techniques"}, {"score": 0.00266693888510356, "phrase": "information_retrieval"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Collaborative Filtering", " Profile expansion", " Cold-start"], "paper_abstract": "Collaborative Filtering techniques have become very popular in the last years as an effective method to provide personalized recommendations. They generally obtain much better accuracy than other techniques such as content-based filtering, because they are based on the opinions of users with tastes or interests similar to the user they are recommending to. However, this is precisely the reason of one of its main limitations: the cold-start problem. That is, how to recommend new items, not yet rated, or how to offer good recommendations to users they have not information about. For example, because they have recently joined the system. In fact, the new user problem is particularly serious, because an unsatisfied user may stop using the system before it could even collect enough information to generate good recommendations. In this article we tackle this problem with a novel approach called \"profile expansion\", based on the query expansion techniques used in Information Retrieval. In particular, we propose and evaluate three kinds of techniques: item-global, item-local and user-local. The experiments we have performed show that both item-global and user-local offer outstanding improvements in precision, up to 100%. Moreover, the improvements are statistically significant and consistent among different movie recommendation datasets and several training conditions. (C) 2012 Elsevier Ltd. All rights reserved.", "paper_title": "Using profile expansion techniques to alleviate the new user problem", "paper_id": "WOS:000317529900007"}