{"auto_keywords": [{"score": 0.044407640230013506, "phrase": "bob"}, {"score": 0.0141271427299708, "phrase": "alice"}, {"score": 0.00481495049065317, "phrase": "subset_membership_encryption"}, {"score": 0.004745179442957631, "phrase": "oblivious_transfer"}, {"score": 0.004622117681584228, "phrase": "novel_cryptographic_notion"}, {"score": 0.004541889101953949, "phrase": "sme"}, {"score": 0.004197460986909444, "phrase": "randomized_privacy-preserved_attribute"}, {"score": 0.004088545435134949, "phrase": "g._a_message"}, {"score": 0.003179854375044433, "phrase": "two-round_ot"}, {"score": 0.0031337020830262954, "phrase": "great_communication_efficiency"}, {"score": 0.003007997678119768, "phrase": "message_sender"}, {"score": 0.0027877340899738314, "phrase": "selected_items"}, {"score": 0.0026915726427162705, "phrase": "previous_pot_protocols"}, {"score": 0.0024581931389119913, "phrase": "zero-knowledge_proof"}, {"score": 0.002332062766342444, "phrase": "novel_pot"}, {"score": 0.00223844287825642, "phrase": "pot."}, {"score": 0.0021802485562376047, "phrase": "discounted_price"}, {"score": 0.0021297888916096833, "phrase": "specific_items"}], "paper_keywords": ["Encryption", " Protocols", " Receivers", " Privacy", " Games"], "paper_abstract": "In this paper, we propose a novel cryptographic notion called subset membership encryption (SME), and provide a very efficient SME scheme. Given a system parameter generated by an encryptor (Alice), a decryptor (Bob) generates a randomized privacy-preserved attribute token P(G) from a set of attributes G. A message is encrypted using an attribute set A chosen by Alice and P(G) provided by Bob. It requires that A is a subset of G for Bob to decrypt the message. We propose a very efficient SME scheme, where both the size of P(G) and ciphertext are short and independent of G and A. In particular, it has three useful and practical applications to oblivious transfer as follows. 1) k-Out-of-n Oblivious Transfer (OT): SME can be naturally applied to a two-round OT, which features a great communication efficiency especially for the receiver, where the receiver only sends two group elements to the message sender. 2) Priced Oblivious Transfer (POT): Our POT protocol allows a buyer to purchase any number of items in each transaction and hide selected items, price and balance from the vendor. In comparison with previous POT protocols, our protocol is more flexible and eliminates the restriction that a buyer can only purchase one item in a transaction. Our POT scheme is very efficient since it does not require any zero-knowledge proof or homomorphic encryption. 3) Restricted Priced Oblivious Transfer (RPOT): We introduce a novel POT named RPOT where a vendor can set restrictions on items or prices in POT. For example, a seller could offer a discounted price to those buyers who have purchased some specific items previously from the same seller.", "paper_title": "Subset Membership Encryption and Its Applications to Oblivious Transfer", "paper_id": "WOS:000338117000004"}