{"auto_keywords": [{"score": 0.02954804361689818, "phrase": "ddc-ir"}, {"score": 0.005594150297617539, "phrase": "current_ir_systems"}, {"score": 0.00481495049065317, "phrase": "delay_tolerant_networks"}, {"score": 0.0047893552527040195, "phrase": "information_retrieval"}, {"score": 0.004601658429231648, "phrase": "important_service"}, {"score": 0.004444921827311577, "phrase": "current_dtn_based_ir_systems"}, {"score": 0.004270665568018583, "phrase": "single_node"}, {"score": 0.004103212598803194, "phrase": "corresponding_data"}, {"score": 0.003900461245422428, "phrase": "multiple_nodes"}, {"score": 0.003869373085652601, "phrase": "ir_systems"}, {"score": 0.0037474693720823643, "phrase": "distributed_data-centric_information_retrieval"}, {"score": 0.0036493349768112085, "phrase": "ir"}, {"score": 0.003600456768296912, "phrase": "query_types"}, {"score": 0.003377097707054532, "phrase": "new_packet"}, {"score": 0.00335016692413066, "phrase": "query_reply_packet"}, {"score": 0.003218690074119103, "phrase": "efficient_query_resolution"}, {"score": 0.0031930184711888867, "phrase": "data_centric_routing"}, {"score": 0.0030923570058383355, "phrase": "popular_queries"}, {"score": 0.0030270132320276096, "phrase": "query_resolution"}, {"score": 0.0029789104204803137, "phrase": "extensive_simulation_study"}, {"score": 0.0029159568444629053, "phrase": "art_ir_systems"}, {"score": 0.0028926927717720747, "phrase": "popular_random_waypoint_model"}, {"score": 0.0028543298631502107, "phrase": "student_movements"}, {"score": 0.0026275488733903426, "phrase": "varying_sizes"}, {"score": 0.0023361832548454207, "phrase": "complex_and_continuous_queries"}, {"score": 0.002274594582028587, "phrase": "query_resolution_time"}, {"score": 0.0021910825909008946, "phrase": "complex_query_increases"}, {"score": 0.0021049977753042253, "phrase": "prior_ir_systems"}], "paper_keywords": ["Challenged networks", " Routing", " Query resolution", " Multi-hop", " Search"], "paper_abstract": "Information Retrieval (IR) systems aim to retrieve data that satisfies certain requirements and constitute an important service in many types of networks, including Delay/Disruption Tolerant Networks (DTNs). In current DTN based IR systems, the data that satisfies a query is assumed to be stored on a single node. Therefore, once a node receives a query in which it has the corresponding data, the query can be resolved completely. However, in scenarios where a query requires data from multiple nodes, these IR systems may fail. Henceforth, in this paper, we propose Distributed Data-Centric Information Retrieval (DDC-IR), a data centric IR system that supports all query types; e.g., continuous and complex. More importantly, it is designed specifically to operate in DTNs. It also incorporates a new packet, aka Query Reply Packet, that includes both a query and one or more replies. We show how this packet facilitates efficient query resolution and enables data centric routing. In addition, it uses caching so that nodes store popular queries that has the effect of speeding up query resolution. We have conducted an extensive simulation study to compare DDC-IR to state of the art IR systems using the popular Random Waypoint model and a trace-file containing student movements on a campus. The results show that DDC-IR is able to resolve 50 % more queries and has an 80 % lower buffer occupancy level than existing IR systems. We also tested DDC-IR in networks with varying sizes. For networks with 100 nodes, DDC-IR is able to resolve queries while current IR systems fail to resolve any queries. In particular, when the number of nodes increases, current IR systems fail to resolve any queries, whilst DDC-IR is able to resolve complex and continuous queries. The influence of the number of sub-queries on query resolution time is also studied. Specifically, when the number of sub-queries in a complex query increases from five to nine, DDC-IR uses 50 % more time to resolve a query. In comparison, prior IR systems fail to resolve any queries.", "paper_title": "A Novel Data Centric Information Retrieval Protocol for Queries in Delay Tolerant Networks", "paper_id": "WOS:000360549300003"}