{"auto_keywords": [{"score": 0.02322730111336098, "phrase": "virtual_agent"}, {"score": 0.022777775870967378, "phrase": "preschool_children"}, {"score": 0.014357761455507321, "phrase": "embodied_robot"}, {"score": 0.0075388470733644885, "phrase": "motor_tasks"}, {"score": 0.004673290248999786, "phrase": "motor_task_performance"}, {"score": 0.0046269981365987915, "phrase": "embodied_robots"}, {"score": 0.004272724011826495, "phrase": "human_subjects"}, {"score": 0.0040854526743211396, "phrase": "embodied_robot-coacher"}, {"score": 0.0038869467872381957, "phrase": "playlike_motor_tasks"}, {"score": 0.003553540530701019, "phrase": "positive_feedback"}, {"score": 0.003029643234751066, "phrase": "previous_experience"}, {"score": 0.0028966970007550824, "phrase": "experienced_group"}, {"score": 0.0024941578231560055, "phrase": "inexperienced_group"}, {"score": 0.0021798257311714665, "phrase": "combined_use"}, {"score": 0.0021049977753042253, "phrase": "motor_involvement"}], "paper_keywords": [""], "paper_abstract": "Embodied robots are known to be preferable in most cases to their virtual agents for interaction with and performance by human subjects. This study compared the efficacy of an embodied robot-coacher and its virtual agent in involving preschool children in the performance of playlike motor tasks. The robot or its virtual agent demonstrated movements, asked the children to repeat them, and provided positive feedback on their performance. The difficulty of the motor tasks was increased over the course of the session. Two groups of children were studied, one of them with and the other without previous experience of interaction with the embodied robot. In the experienced group, involvement in motor tasks was successfully induced by both the embodied robot and its virtual agent, but the children interacted less well with the virtual agent than with the embodied robot. Children in the inexperienced group did not interact at all during the experiment with the virtual agent. Because participants in the experiment were preschool children in their natural environment, this study proposes the combined use of an embodied robot and its virtual agent for motor involvement.", "paper_title": "Embodied Robot versus Virtual Agent: Involvement of Preschool Children in Motor Task Performance", "paper_id": "WOS:000334908800003"}