{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "bridge_bidding"}, {"score": 0.004565007074039171, "phrase": "game-playing_programs"}, {"score": 0.004304963945457799, "phrase": "cooperative_agent"}, {"score": 0.004169394481182493, "phrase": "partial_observability"}, {"score": 0.003727527379253624, "phrase": "new_decision-making_algorithm"}, {"score": 0.0033861224940737846, "phrase": "opponent_agents"}, {"score": 0.003261934055562238, "phrase": "novel_model-based_monte_carlo_sampling_method"}, {"score": 0.003159106878239524, "phrase": "hidden_information"}, {"score": 0.00304321897427383, "phrase": "learning_framework"}, {"score": 0.0026205405415623525, "phrase": "inductive_learning"}, {"score": 0.0024842242921857705, "phrase": "conflicting_actions"}, {"score": 0.0023424328921363585, "phrase": "bridge_deals"}, {"score": 0.0021049977753042253, "phrase": "current_state-of-the-art_bidding_algorithm"}], "paper_keywords": ["bridge", " partner modeling", " opponent modeling", " learning to cooperate"], "paper_abstract": "Bridge bidding is considered to be one of the most difficult problems for game-playing programs. It involves four agents rather than two, including a cooperative agent. In addition, the partial observability of the game makes it impossible to predict the outcome of each action. In this paper we present a new decision-making algorithm that is capable of overcoming these problems. The algorithm allows models to be used for both opponent agents and partners, while utilizing a novel model-based Monte Carlo sampling method to overcome the problem of hidden information. The paper also presents a learning framework that uses the above decision-making algorithm for co-training of partners. The agents refine their selection strategies during training and continuously exchange their refined strategies. The refinement is based on inductive learning applied to examples accumulated for classes of states with conflicting actions. The algorithm was empirically evaluated on a set of bridge deals. The pair of agents that co-trained significantly improved their bidding performance to a level surpassing that of the current state-of-the-art bidding algorithm.", "paper_title": "Learning to bid in bridge", "paper_id": "WOS:000238035300004"}