{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "manufacturing_ability"}, {"score": 0.02049276568890471, "phrase": "equipment_agents"}, {"score": 0.008490679551103357, "phrase": "processing_ability"}, {"score": 0.005428498700857252, "phrase": "new_tasks"}, {"score": 0.0047310525657970615, "phrase": "virtual_enterprises"}, {"score": 0.004429191773525288, "phrase": "multi-agent-based_virtual_manufacturing_enterprise"}, {"score": 0.003492840830999027, "phrase": "processing_capability"}, {"score": 0.003284145698220425, "phrase": "specified_task"}, {"score": 0.002967931416941965, "phrase": "different_equipment"}, {"score": 0.002890557197908352, "phrase": "different_times"}, {"score": 0.0028151944356239952, "phrase": "operation_spectrum"}, {"score": 0.0025778546800417808, "phrase": "current_capability"}, {"score": 0.0024236964502593254, "phrase": "proposed_methodology"}, {"score": 0.0023294867572824147, "phrase": "virtual_enterprise"}, {"score": 0.002142426911242168, "phrase": "real_independent_agents"}, {"score": 0.0021236300589450143, "phrase": "virtual_manufacturing_enterprises"}, {"score": 0.0021049977753042253, "phrase": "multi-site_enterprises"}], "paper_keywords": ["manufacturing ability", " equipment agent", " multi-agent system", " virtual enterprise"], "paper_abstract": "This paper proposes a methodology for evaluating the manufacturing ability of equipment in a multi-agent-based virtual manufacturing enterprise by enveloping the manufacturing information of the various equipment as equipment agents. The manufacturing ability of equipment consists of two classes: the processing ability and the processing capability of the equipment. The processing ability of equipment indicates the tasks and operations that the equipment can perform, and is peculiar to the equipment. The processing capability of equipment shows the capability of the equipment to undertake and accomplish a specified task under some constraints, such as time and cost, and it depends on both the equipment and the task. It varies with different equipment and tasks, and at different times. The concept of an operation spectrum of equipment is introduced to verify the processing ability of the equipment, and methods are formulated to calculate the current capability of the equipment and estimate the cost for bidding for new tasks. The proposed methodology on the manufacturing ability of the equipment in a virtual enterprise can be implemented easily using equipment agents. This methodology can support the equipment agents to bid for new tasks as real independent agents in virtual manufacturing enterprises or multi-site enterprises.", "paper_title": "A methodology for evaluating the manufacturing ability of equipment in virtual enterprises", "paper_id": "WOS:000237805900004"}