{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "first_scorm_object"}, {"score": 0.0047090997998449095, "phrase": "first_scorm"}, {"score": 0.004356535752468849, "phrase": "content_generation_applications"}, {"score": 0.00388356203453764, "phrase": "first_learning_object"}, {"score": 0.003840598580753804, "phrase": "software_tools_installation"}, {"score": 0.0038122196479548425, "phrase": "final_packaging"}, {"score": 0.0037283301619292636, "phrase": "wider_perspective"}, {"score": 0.003592581806180854, "phrase": "content_generation_tools"}, {"score": 0.0032501644753165555, "phrase": "scorm_standard"}, {"score": 0.003074197032561992, "phrase": "simple_scorm_package"}, {"score": 0.0030401601744013793, "phrase": "reload_editor"}, {"score": 0.002875529792120695, "phrase": "reload_scorm_player"}, {"score": 0.002689666606553487, "phrase": "commented_references"}, {"score": 0.0024512358145634358, "phrase": "consistent_learning_object_creation_scheme"}, {"score": 0.0023972232771581753, "phrase": "master_tools"}, {"score": 0.002379484250348599, "phrase": "metadata_generation"}, {"score": 0.0021049977753042253, "phrase": "metadata_creation"}], "paper_keywords": ["Authoring tools and methods", " Distance education and telelearning", " Interactive learning environments"], "paper_abstract": "The creation of the first SCORM (Shareable Content Object Reference Model) object offers some challenges and difficulties which go beyond the facilities offered by content generation applications. In particular, the creation of really reusable, searchable learning objects requires a detailed consideration of metadata, where same institutional aspects may be unclear or not available. This work describes creation of a first learning object, from software tools installation to final packaging. It aims at a wider perspective than that offered by handbooks or user guides for content generation tools, generally poor or altogether deprived of suggestions on how to go about to achieve reusability, interoperability, durability and accessibility as conceived by the SCORM standard. Only free software and Internet publications are used as references. The creation of a simple SCORM package with the Reload Editor is described step by step, and the package created is then tested using Reload SCORM Player, allowing for the detection of some difficulties and alternatives of solution. Help available and some commented references are afterwards indicated. A list of suggestions finally emerges, to the purpose of solving beforehand most of the uncertainties, defining a consistent learning object creation scheme and reducing training time to master tools and metadata generation. As a conclusion, some limitations found along the work are pointed out, in particular the necessity of adopting or defining a LOM (Learning Object Metadata) application profile together with an institutional strategy to face metadata creation efficiently. (C) 2008 Elsevier Ltd. All rights reserved.", "paper_title": "Creating the first SCORM object", "paper_id": "WOS:000259945200017"}