{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "stair-climbing_mobile_platform"}, {"score": 0.04799755018493269, "phrase": "rocker-bogie_mechanism"}, {"score": 0.03682252724874875, "phrase": "proposed_mobile_platform"}, {"score": 0.004405596416783185, "phrase": "indoor_environments"}, {"score": 0.004251728624599691, "phrase": "link_parameters"}, {"score": 0.004103212598803194, "phrase": "taguchi_method"}, {"score": 0.003737485125097945, "phrase": "high_mobile_stability"}, {"score": 0.0036715973701254823, "phrase": "excellent_adaptability"}, {"score": 0.003543273649210823, "phrase": "optimization_result"}, {"score": 0.003374094774912924, "phrase": "indoor_applications"}, {"score": 0.0032416819339366712, "phrase": "hollow_links"}, {"score": 0.0031703706626348507, "phrase": "undesired_interferences"}, {"score": 0.003032405563826263, "phrase": "external_impact"}, {"score": 0.002811464848641341, "phrase": "high_fidelity"}, {"score": 0.0027373807320805084, "phrase": "kinetic_analysis"}, {"score": 0.002689076130099546, "phrase": "wheel-stair_contact_angle_information"}, {"score": 0.00233202607446404, "phrase": "extensive_experiments"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Stair-climbing", " Rocker-Bogie mechanism", " Kinematic analysis", " Contact angle estimation", " Composite locomotive strategy"], "paper_abstract": "This paper presents a stair-climbing mobile platform built on the Rocker-Bogie mechanism which enables to effectively climb up/down various sizes of stairs in indoor environments without violating its mobile stability. First, the link parameters of Rocker-Bogie mechanism are optimally chosen via the Taguchi method in order to make the trajectory of its center of mass (CM) as smooth as possible, which implies high mobile stability as well as excellent adaptability during climbing up/down stairs. Based on this optimization result, the proposed mobile platform is compactly and lightly constructed suitable for indoor applications by placing all motors and sensors inside the hollow links in order to prevent undesired interferences with stairs as well as to protect themselves from external impact. A simple, robust and cost-effective estimation algorithm is proposed to detect the contact angles between wheels and a stair with high fidelity. Through the kinematic and kinetic analysis combined with the wheel-stair contact angle information, a composite locomotive strategy is established not only to minimize the slip during climbing up a stair but also to prevent falling down during climbing down a stair. The extensive experiments against various types of stairs successfully demonstrate the capability of the proposed mobile platform to effectively and safely climb up/down stairs. (C) 2013 Elsevier Ltd. All rights reserved.", "paper_title": "Contact angle estimation and composite locomotive strategy of a stair-climbing mobile platform", "paper_id": "WOS:000321080700008"}