{"auto_keywords": [{"score": 0.031259254273449055, "phrase": "socialtube"}, {"score": 0.015719716506582538, "phrase": "online_social_networks"}, {"score": 0.012912719944583437, "phrase": "video_content"}, {"score": 0.004776853267973129, "phrase": "video_sharing"}, {"score": 0.004701556483912018, "phrase": "increasingly_popular_application"}, {"score": 0.004429566229017728, "phrase": "intrinsic_limit"}, {"score": 0.004325208730208653, "phrase": "current_osn_video_systems"}, {"score": 0.004156691746581458, "phrase": "server_bandwidth"}, {"score": 0.004010624853427534, "phrase": "soaring_amount"}, {"score": 0.0033668870709083884, "phrase": "clustering_nodes"}, {"score": 0.0033402088717816446, "phrase": "similar_interests"}, {"score": 0.003313741359811683, "phrase": "close_location"}, {"score": 0.003287482882222731, "phrase": "high_performance"}, {"score": 0.003000078531489111, "phrase": "facebook"}, {"score": 0.002814956065949522, "phrase": "social_relationship"}, {"score": 0.0027926389474730927, "phrase": "interest_similarity"}, {"score": 0.0027594936602962075, "phrase": "physical_location"}, {"score": 0.0023253461255420436, "phrase": "experimental_results"}, {"score": 0.002279511560148666, "phrase": "planetlab"}, {"score": 0.002147333949483224, "phrase": "user_experience"}], "paper_keywords": ["Video-on-demand (VoD)", " on-line social networks", " peer-to-peer networks", " peer-to-peer assisted VoD"], "paper_abstract": "Video sharing has been an increasingly popular application in online social networks (OSNs). However, its sustainable development is severely hindered by the intrinsic limit of the client/server architecture deployed in current OSN video systems, which is not only costly in terms of server bandwidth and storage but also not scalable with the soaring amount of users and video content. The peer-assisted Video-on-Demand (VoD) technique, in which participating peers assist the server in delivering video content, has been proposed recently. Unfortunately, videos can only be disseminated through friends in OSNs. Therefore, current VoD works that explore clustering nodes with similar interests or close location for high performance are suboptimal, if not entirely inapplicable, in OSNs. Based on our long-term real-world measurement of over 1,000,000 users and 2,500 videos on Facebook, we propose SocialTube, a novel peer-assisted video sharing system that explores social relationship, interest similarity, and physical location between peers in OSNs. Specifically, SocialTube incorporates four algorithms: a social network (SN)-based P2P overlay construction algorithm, an SN-based chunk prefetching algorithm, chunk delivery, and scheduling algorithm, and a buffer management algorithm. Experimental results from a prototype on PlanetLab and an event-driven simulator show that SocialTube can improve the quality of user experience and system scalability over current P2P VoD techniques.", "paper_title": "SocialTube: P2P-Assisted Video Sharing in Online Social Networks", "paper_id": "WOS:000342179000021"}