{"auto_keywords": [{"score": 0.0496213341565463, "phrase": "variational_distance"}, {"score": 0.009417506380051465, "phrase": "entropy_difference"}, {"score": 0.00481495049065317, "phrase": "shannon_entropy"}, {"score": 0.004545240514015278, "phrase": "information_theory"}, {"score": 0.003325410433297401, "phrase": "fundamental_interest"}, {"score": 0.0032777653153451265, "phrase": "entropy_estimation"}, {"score": 0.003199864072042816, "phrase": "analytic_formula"}, {"score": 0.003154012038613403, "phrase": "confidence_interval"}, {"score": 0.0029343925814926787, "phrase": "probability_distributions"}, {"score": 0.002864628676257225, "phrase": "minimum_entropy_difference"}, {"score": 0.002432152706473349, "phrase": "alphabet_sizes"}, {"score": 0.002340250894008014, "phrase": "random_number_generation"}, {"score": 0.002145942273032774, "phrase": "variation_distance"}, {"score": 0.002125371638869951, "phrase": "new_tools"}, {"score": 0.0021049977753042253, "phrase": "non-convex_optimization"}], "paper_keywords": ["Bounds on entropy", " entropy", " entropy estimation", " maximum entropy", " random number generation", " Shannon theory", " variational distance"], "paper_abstract": "The relation between the Shannon entropy and variational distance, two fundamental and frequently-used quantities in information theory, is studied in this paper by means of certain bounds on the entropy difference between two probability distributions in terms of the variational distance between them and their alphabet sizes. We also show how to find the distribution achieving the minimum (or maximum) entropy among those distributions within a given variational distance from any given distribution. These results are applied to solve a number of problems that are of fundamental interest. For entropy estimation, we obtain an analytic formula for the confidence interval, solving a problem that has been opened for more than 30 years. For approximation of probability distributions, we find the minimum entropy difference between two distributions in terms of their alphabet sizes and the variational distance between them. In particular, we show that the entropy difference between two distributions that are close in variational distance can be arbitrarily large if the alphabet sizes of the two distributions are unconstrained. For random number generation, we characterize the tradeoff between the amount of randomness required and the distortion in terms of variation distance. New tools for non-convex optimization have been developed to establish the results in this paper.", "paper_title": "The Interplay Between Entropy and Variational Distance", "paper_id": "WOS:000284419900002"}