{"auto_keywords": [{"score": 0.04711703644095616, "phrase": "high_probability"}, {"score": 0.012829003250893568, "phrase": "maximal_load"}, {"score": 0.012412477957017363, "phrase": "evaluation_time"}, {"score": 0.00481495049065317, "phrase": "fundamental_fact"}, {"score": 0.004748667236545639, "phrase": "randomized_algorithms"}, {"score": 0.004309434349688514, "phrase": "truly_random_hash_function"}, {"score": 0.004203183846976328, "phrase": "explicit_functions"}, {"score": 0.0032470094613727433, "phrase": "annual_ieee_symposium"}, {"score": 0.00321114539085481, "phrase": "computer_science"}, {"score": 0.0030461102500649742, "phrase": "description_length"}, {"score": 0.0028655540648929996, "phrase": "exhibit_different_trade-offs"}, {"score": 0.0027031706928674092, "phrase": "\"gradually_increasing_independence"}, {"score": 0.0025078055917049456, "phrase": "second_construction"}, {"score": 0.002480085906545355, "phrase": "derandomization_techniques"}, {"score": 0.0024663408903032695, "phrase": "space-bounded_computations"}, {"score": 0.0024390784088340715, "phrase": "tailored_construction"}, {"score": 0.002418829014435841, "phrase": "pseudorandom_generator"}, {"score": 0.0022377753026615716, "phrase": "siegel"}], "paper_keywords": ["hash functions", " balls and bins", " pseudorandom generators"], "paper_abstract": "A fundamental fact in the analysis of randomized algorithms is that when n balls are hashed into n bins independently and uniformly at random, with high probability each bin contains at most O(log n/log log n) balls. In various applications, however, the assumption that a truly random hash function is available is not always valid, and explicit functions are required. In this paper we study the size of families (or, equivalently, the description length of their functions) that guarantee a maximal load of O(log n/log log n) with high probability, as well as the evaluation time of their functions. Whereas such functions must be described using Omega(log n) bits, the best upper bound was formerly O(log(2) n/log log n) bits, which is attained by O(log n/log log n)-wise independent functions. Traditional constructions of O(log n/log log n)-wise independent functions offer an evaluation time of O(log n/log log n), which according to Siegel's lower bound [A. Siegel, Proceedings of the 30th Annual IEEE Symposium on Foundations of Computer Science, 1989, pp. 20-25] can be reduced only at the cost of significantly increasing the description length. We construct two families that guarantee a maximal load of O(log n/log log n) with high probability. Our constructions are based on two different approaches and exhibit different trade-offs between the description length and the evaluation time. The first construction shows that O(log n/log log n)-wise independence can in fact be replaced by \"gradually increasing independence,\" resulting in functions that are described using O(log n log log n) bits and evaluated in time O(log n log log n). The second construction is based on derandomization techniques for space-bounded computations combined with a tailored construction of a pseudorandom generator, resulting in functions that are described using O(log(3/2) n) bits and evaluated in time O(root log n). Our second construction can be compared to Siegel's lower bound stating that O(log n/log log n)-wise independent functions that are evaluated in time O(root log n) must be described using Omega(2(root log n)) bits.", "paper_title": "BALLS AND BINS: SMALLER HASH FAMILIES AND FASTER EVALUATION", "paper_id": "WOS:000323888700009"}