{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "fault_detection"}, {"score": 0.0144494685282715, "phrase": "overall_process"}, {"score": 0.013616766556762092, "phrase": "guarded_transitions"}, {"score": 0.004739630859016419, "phrase": "time_petri_nets"}, {"score": 0.004592491583367684, "phrase": "based_design"}, {"score": 0.004549242970806199, "phrase": "distributed_protocol"}, {"score": 0.0037646032729006214, "phrase": "broad_class"}, {"score": 0.0035904971126313316, "phrase": "timing_analysis"}, {"score": 0.00355665081072721, "phrase": "tpn_models"}, {"score": 0.0034352452951903305, "phrase": "modeling_capability"}, {"score": 0.0032659907152779765, "phrase": "prescribed_time_interval"}, {"score": 0.003174464741377186, "phrase": "different_local_agents"}, {"score": 0.0031544754107802413, "phrase": "local_observation"}, {"score": 0.003095257144856771, "phrase": "neighboring_agents"}, {"score": 0.0028332303659245085, "phrase": "model_based_predictions"}, {"score": 0.0027712559151232843, "phrase": "limited_information_exchange"}, {"score": 0.002544616720630384, "phrase": "local_processes"}, {"score": 0.0024421847638964947, "phrase": "local_agent"}, {"score": 0.002411502601063179, "phrase": "preliminary_diagnosis"}, {"score": 0.002285335999629823, "phrase": "global_diagnosis"}, {"score": 0.0022637650216685906, "phrase": "centralized_agent"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Petri nets", " diagnosis", " large systems"], "paper_abstract": "This paper proposes an algorithm for the model based design of a distributed protocol for fault detection and diagnosis for very large systems. The overall process is modeled as different Time Petri Net (TPN) models (each one modeling a local process) that interact with each other via guarded transitions that becomes enabled only when certain conditions (expressed as predicates over the marking of some places) are satisfied (the guard is true). In order to use this broad class of time DES models for fault detection and diagnosis we derive in this paper the timing analysis of the TPN models with guarded transitions. In this paper we also extend the modeling capability of the faults calling some transitions faulty when operations they represent take more or less time than a prescribed time interval corresponding to their normal execution. We consider here that different local agents receive local observation as well as messages from neighboring agents. Each agent estimates the state of the part of the overall process for which it has model and from which it observes events by reconciling observations with model based predictions. We design algorithms that use limited information exchange between agents and that can quickly decide \"questions\" about \"whether and where a fault occurred?\" and \"whether or not some components of the local processes have operated correctly?\". The algorithms we derive allow each local agent to generate a preliminary diagnosis prior to any communication and we show that after communicating the agents we design recover the global diagnosis that a centralized agent would have derived. The algorithms are component oriented leading to efficiency in computation. (c) 2005 IMACS. Published by Elsevier B.V. All rights reserved.", "paper_title": "A distributed approach for fault detection and diagnosis based on Time Petri Nets", "paper_id": "WOS:000235682800005"}