{"auto_keywords": [{"score": 0.03955963658357216, "phrase": "minimal_repair"}, {"score": 0.00481495049065317, "phrase": "age-dependent_minimal_repair_cost"}, {"score": 0.0046046429665581555, "phrase": "periodic_overhaul"}, {"score": 0.00428222231579898, "phrase": "non-homogeneous_poisson_process"}, {"score": 0.0029447150254434842, "phrase": "n-th_overhaul"}, {"score": 0.0027690086059100495, "phrase": "maintenance_policy"}, {"score": 0.002722930209707764, "phrase": "optimal_number"}, {"score": 0.0026626797255348287, "phrase": "optimal_interval"}, {"score": 0.0025892330566358503, "phrase": "minimal_repairs"}, {"score": 0.002341164727388944, "phrase": "virtual_age"}, {"score": 0.0022013916728990564, "phrase": "unique_optimal_policy"}, {"score": 0.0021526564019119466, "phrase": "expected_cost_rate"}], "paper_keywords": ["preventive maintenance", " minimal repair", " periodic overhaul", " replacement policy"], "paper_abstract": "A system is subject to shocks that arrive according to a non-homogeneous Poisson process. As shocks occur, the system has two types of failures: type 1 failure (minor failure) is removed by a minimal repair, whereas type 2 failure (catastrophic failure) is removed by overhaul or replacement. The cost of minimal repair depends on age. A system is overhauled when the occurrence of a type 2 failure or at age T, whichever occurs first. At the N-th overhaul, the system is replaced rather than overhauled. A maintenance policy for determining optimal number of overhauls and optimal interval between overhauls which incorporate minimal repairs, overhauls and replacement is proposed. Under such a policy, an approach which using the concept of virtual age is adopted. It is shown that there exists a unique optimal policy which minimises the expected cost rate under certain conditions. Various cases are considered.", "paper_title": "A generalised maintenance policy with age-dependent minimal repair cost for a system subject to shocks under periodic overhaul", "paper_id": "WOS:000302231300002"}