{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "improved_discrete_particle_swarm_optimizer"}, {"score": 0.045462223221237344, "phrase": "divisive_clustering"}, {"score": 0.02834704608430153, "phrase": "proposed_algorithm"}, {"score": 0.0047310525657970615, "phrase": "important_technique"}, {"score": 0.004689650818647484, "phrase": "data_analysis"}, {"score": 0.004487989502479992, "phrase": "image_segmentation"}, {"score": 0.004448705308279165, "phrase": "document_clustering"}, {"score": 0.004220086640742953, "phrase": "hierarchical_clustering"}, {"score": 0.0038141000450978746, "phrase": "selected_cluster"}, {"score": 0.003633927813203731, "phrase": "divisive_clustering_algorithm"}, {"score": 0.0034018288705284427, "phrase": "partitional_clustering"}, {"score": 0.0032697235411641695, "phrase": "good_trade-off"}, {"score": 0.00304737045343781, "phrase": "novel_divisive_clustering_algorithm"}, {"score": 0.0029548937818509656, "phrase": "divisive_clustering_framework"}, {"score": 0.0028778584739756786, "phrase": "real-world_data_sets"}, {"score": 0.002729744174693491, "phrase": "promising_results"}, {"score": 0.0022687189700002254, "phrase": "good_time-quality_trade-off"}, {"score": 0.0021805201234139475, "phrase": "problem_instance"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Hierarchical clustering", " Divisive clustering", " Particle swarm optimizer"], "paper_abstract": "As an important technique for data analysis, clustering has been employed in many applications such as image segmentation, document clustering and vector quantization. Divisive clustering, which is a branch of hierarchical clustering, has been studied and widely used due to its computational efficiency. Generally, which cluster should be split and how to split the selected cluster are two major principles that should be taken into account when a divisive clustering algorithm is used. However, one disadvantage of the divisive clustering is its degraded performance compared to the partitional clustering, thus making it hard to achieve a good trade-off between computational time and clustering performance. To tackle this problem, we propose a novel divisive clustering algorithm by integrating an improved discrete particle swarm optimizer into a divisive clustering framework. Experiments on several synthetic data sets, real-world data sets and two real-world applications (document clustering and vector quantization) show some promising results. Firstly, the proposed algorithm performs better or at least comparable to the other representative clustering algorithms in terms of clustering quality and robustness. Secondly, the proposed algorithm runs much faster than the other competing algorithms on all the benchmark sets. At last, the good time-quality trade-off is still achievable when the size of the problem instance is increased. (C) 2010 Elsevier B.V. All rights reserved.", "paper_title": "A fast divisive clustering algorithm using an improved discrete particle swarm optimizer", "paper_id": "WOS:000279834800002"}