{"auto_keywords": [{"score": 0.049231556988166246, "phrase": "nvd"}, {"score": 0.00481495049065317, "phrase": "pareto-optimal_adversarial_defense_of_enterprise_systems"}, {"score": 0.0046046429665581555, "phrase": "valuable_information"}, {"score": 0.004523103062368843, "phrase": "popular_software"}, {"score": 0.0036498637283470386, "phrase": "vulnerability_dependency_graph"}, {"score": 0.0035374012552316573, "phrase": "attacks_graphs"}, {"score": 0.0030113280682863234, "phrase": "integer_linear_program"}, {"score": 0.0028411768240129585, "phrase": "worst-case_attack"}, {"score": 0.0026567282965815823, "phrase": "high_productivity"}, {"score": 0.0025291018422967083, "phrase": "paretooptimal_solution"}, {"score": 0.0023125191783901367, "phrase": "enterprise_network"}, {"score": 0.0021526564019119466, "phrase": "acceptable_time_bounds"}, {"score": 0.0021239335561699106, "phrase": "large_vdgs"}], "paper_keywords": ["Protecting Enterprise Security", " Pareto Optimality", " Adversarial Modeling", " Enterprise systems", " computer security", " adversarial models"], "paper_abstract": "The National Vulnerability Database (NVD) maintained by the US National Institute of Standards and Technology provides valuable information about vulnerabilities in popular software, as well as any patches available to address these vulnerabilities. Most enterprise security managers today simply patch the most dangerous vulnerabilities an adversary can thus easily compromise an enterprise by using less important vulnerabilities to penetrate an enterprise. In this article, we capture the vulnerabilities in an enterprise as a Vulnerability Dependency Graph (VDG) and show that attacks graphs can be expressed in them. We first ask the question: What set of vulnerabilities should an attacker exploit in order to maximize his expected impact? We show that this problem can be solved as an integer linear program. The defender would obviously like to minimize the impact of the worst-case attack mounted by the attacker but the defender also has an obligation to ensure a high productivity within his enterprise. We propose an algorithm that finds a Paretooptimal solution for the defender that allows him to simultaneously maximize productivity and minimize the cost of patching products on the enterprise network. We have implemented this framework and show that runtimes of our computations are all within acceptable time bounds even for large VDGs containing 30K edges and that the balance between productivity and impact of attacks is also acceptable.", "paper_title": "Pareto-Optimal Adversarial Defense of Enterprise Systems", "paper_id": "WOS:000353253800003"}