{"auto_keywords": [{"score": 0.04353485312554433, "phrase": "protein_identification"}, {"score": 0.013693334401169018, "phrase": "fisher_test"}, {"score": 0.01221008090445053, "phrase": "mass_spectrometry"}, {"score": 0.00481495049065317, "phrase": "protein_category_enrichment"}, {"score": 0.0047823219739028325, "phrase": "discovery_proteomics"}, {"score": 0.004717723626157272, "phrase": "enrichment_tests"}, {"score": 0.004653993775422955, "phrase": "high-throughput_experimentation"}, {"score": 0.00437765047900432, "phrase": "fisher's_exact_test"}, {"score": 0.0041316803676012155, "phrase": "mass_spectrometry_discovery_proteomics"}, {"score": 0.004075834722188658, "phrase": "gene_ontology"}, {"score": 0.003966388754366831, "phrase": "large_yeast_dataset"}, {"score": 0.003899476621346112, "phrase": "direct_application"}, {"score": 0.0036181717017041387, "phrase": "false_inference"}, {"score": 0.003438058620195309, "phrase": "fisher_tests"}, {"score": 0.0032008144731234265, "phrase": "logistic_regression"}, {"score": 0.0030936482163040823, "phrase": "term_assignments"}, {"score": 0.003051790083321992, "phrase": "identification_bias"}, {"score": 0.0029697601808164435, "phrase": "five_biochemical_properties"}, {"score": 0.002347708822273381, "phrase": "fisher"}, {"score": 0.0023158019935841235, "phrase": "significant_association"}, {"score": 0.0021484955960643167, "phrase": "identification_propensity_show"}, {"score": 0.0021338975690903014, "phrase": "unadjusted_enrichment_tests"}], "paper_keywords": [""], "paper_abstract": "Motivation: Enrichment tests are used in high-throughput experimentation to measure the association between gene or protein expression and membership in groups or pathways. The Fisher's exact test is commonly used. We specifically examined the associations produced by the Fisher test between protein identification by mass spectrometry discovery proteomics, and their Gene Ontology ( GO) term assignments in a large yeast dataset. We found that direct application of the Fisher test is misleading in proteomics due to the bias in mass spectrometry to preferentially identify proteins based on their biochemical properties. False inference about associations can be made if this bias is not corrected. Our method adjusts Fisher tests for these biases and produces associations more directly attributable to protein expression rather than experimental bias. Results: Using logistic regression, we modeled the association between protein identification and GO term assignments while adjusting for identification bias in mass spectrometry. The model accounts for five biochemical properties of peptides: (i) hydrophobicity, (ii) molecular weight, (iii) transfer energy, (iv) beta turn frequency and (v) isoelectric point. The model was fit on 181 060 peptides from 2678 proteins identified in 24 yeast proteomics datasets with a 1% false discovery rate. In analyzing the association between protein identification and their GO term assignments, we found that 25% (134 out of 544) of Fisher tests that showed significant association (q-value < 0.05) were non-significant after adjustment using our model. Simulations generating yeast protein sets enriched for identification propensity show that unadjusted enrichment tests were biased while our approach worked well.", "paper_title": "The necessity of adjusting tests of protein category enrichment in discovery proteomics", "paper_id": "WOS:000284947700001"}