{"auto_keywords": [{"score": 0.036962449923098536, "phrase": "destination_nodes"}, {"score": 0.00481495049065317, "phrase": "lifetime_optimum_protocol"}, {"score": 0.00453113241842654, "phrase": "wireless_sensor_networks"}, {"score": 0.004238134740341528, "phrase": "different_nodes"}, {"score": 0.0038923605771735838, "phrase": "energy_consumption"}, {"score": 0.0034676182423067307, "phrase": "multi-path_routing_techniques"}, {"score": 0.0030147970456037274, "phrase": "multi-path_routes"}, {"score": 0.0027184540871935284, "phrase": "source_nodes"}, {"score": 0.0025423706961391034, "phrase": "energy_loss"}, {"score": 0.0023776656246300063, "phrase": "present_paper"}, {"score": 0.002278440725193305, "phrase": "virtual_nodes"}, {"score": 0.0021049977753042253, "phrase": "penl"}], "paper_keywords": ["Wireless Sensor Networks (WSN)", " optimum routing", " dissemination of information", " enhancing nodes lifetime"], "paper_abstract": "Challenging issue in Wireless Sensor Networks (WSNs) is assessment of energy and lifetime at different nodes within the networks. Various methods may be employed to improve lifetime (reduce energy consumption). One such method involves balancing loads on nodes when data is being transmitted from source to destination nodes. Multi-path routing techniques can be used for this purpose. In these techniques no global information is available regard the path, making it difficult to create multi-path routes from sources nodes to destination nodes. Another problem with these networks is a routing applied to source nodes independently from that applied used for destination nodes. This creates energy loss and reduces lifetime. To overcome this problem, the present paper makes use of clustering by selecting virtual nodes to gather information from sources and sending it to destination nodes. The New Protocol for Enhancing Nods Lifetime (PENL) is implemented through NS-2.", "paper_title": "Enhancing Nodes Lifetime Optimum Protocol for Dissemination of Information in WSN", "paper_id": "WOS:000334135800003"}