{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "information_behaviour"}, {"score": 0.04351358734229449, "phrase": "information_behaviour_research"}, {"score": 0.012072801297808652, "phrase": "people-centred_inclusive_information_products"}, {"score": 0.008711352240797606, "phrase": "people-centred_design"}, {"score": 0.00468656988857138, "phrase": "people-centred_information_products"}, {"score": 0.004614745158543967, "phrase": "purpose_-_the_purpose"}, {"score": 0.004422827355213055, "phrase": "social_phenomena"}, {"score": 0.004304856672196293, "phrase": "people-centred_information_solutions"}, {"score": 0.004190019394361629, "phrase": "broad_ontology"}, {"score": 0.003534889186471058, "phrase": "information_behaviour_literature"}, {"score": 0.0034941337957136013, "phrase": "key_drivers"}, {"score": 0.0034008496666026585, "phrase": "ontological_framework"}, {"score": 0.002981885091155911, "phrase": "conceptual_paper"}, {"score": 0.002846647336160784, "phrase": "relating_theory"}, {"score": 0.0026965813247045427, "phrase": "one's_knowledge"}, {"score": 0.002364172626241202, "phrase": "direct_link"}, {"score": 0.0023368833197343953, "phrase": "theoretical_world"}, {"score": 0.002292097733181405, "phrase": "empirical_world"}, {"score": 0.0021049977753042253, "phrase": "information_science"}], "paper_keywords": ["behaviour", " information services", " social inclusion", " electronic media"], "paper_abstract": "Purpose - The purpose of this paper is first to highlight some of the social phenomena that are driving the design of people-centred information solutions; second, to develop a broad ontology of information behaviour research that serves to identify factors that should be taken into account when designing such solutions. Finally, the author illustrates how this knowledge is being applied in the design of people-centred inclusive information products and services. Design/methodology/approach - The author draws on the information behaviour literature to highlight key drivers and to develop and illustrate the ontological framework. The significance of this framework is then demonstrated by providing examples of how this knowledge has been applied in the design of people-centred inclusive information products and services. Research limitations/implications - This is a conceptual paper and based on the informed, subjective analysis of previous research. However, relating theory to practice does provide an indication of the validity of this conception of one's knowledge of information behaviour to people-centred design. Originality/value - The paper helps to provide an over-view of information behaviour research, the nature of the domain and the levels of abstraction. The article also makes a direct link between the theoretical world of information behaviour research and the empirical world of people-centred design. Hence, it also presents a case for the importance of the body of knowledge that people in information science refer to as information behaviour.", "paper_title": "Knowledge of information behaviour and its relevance to the design of people-centred information products and services", "paper_id": "WOS:000243809100003"}