{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "enterprise_interoperability"}, {"score": 0.004106725110985659, "phrase": "key_factor"}, {"score": 0.003759142310009214, "phrase": "market_opportunities"}, {"score": 0.00354909279546064, "phrase": "growing_competitive_world"}, {"score": 0.003502305158321511, "phrase": "networked_enterprise"}, {"score": 0.003191560305761507, "phrase": "important_area"}, {"score": 0.003053402354907241, "phrase": "european_enterprises"}, {"score": 0.0027700855441353165, "phrase": "interoperability_assessment"}, {"score": 0.002733539375462443, "phrase": "interoperability_maturity"}, {"score": 0.0023724065150232897, "phrase": "maturity_model"}, {"score": 0.0022999859758286423, "phrase": "existing_maturity_models"}, {"score": 0.0022297712188622293, "phrase": "interoperability_domain"}, {"score": 0.002200337772403981, "phrase": "assessment_methodology"}, {"score": 0.0021049977753042253, "phrase": "real_case_study"}], "paper_keywords": ["intra-enterprise interoperation", " enterprise management", " interoperability models", " inter-enterprise interoperation", " enterprise information systems (EIS)"], "paper_abstract": "Historically, progress occurs when entities communicate, share information and together create something that no one individually could do alone. Moving beyond people to machines and systems, interoperability is becoming a key factor of success in all domains. In particular, interoperability has become a challenge for enterprises, to exploit market opportunities, to meet their own objectives of cooperation or simply to survive in a growing competitive world where the networked enterprise is becoming a standard. Within this context, many research works have been conducted over the past few years and enterprise interoperability has become an important area of research, ensuring the competitiveness and growth of European enterprises. Among others, enterprises have to control their interoperability strategy and enhance their ability to interoperate. This is the purpose of the interoperability assessment. Assessing interoperability maturity allows a company to know its strengths and weaknesses in terms of interoperability with its current and potential partners, and to prioritise actions for improvement. The objective of this paper is to define a maturity model for enterprise interoperability that takes into account existing maturity models while extending the coverage of the interoperability domain. The assessment methodology is also presented. Both are demonstrated with a real case study.", "paper_title": "Maturity model for enterprise interoperability", "paper_id": "WOS:000345072700001"}