{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "urban_environments"}, {"score": 0.049545777344370455, "phrase": "deformable_part_models"}, {"score": 0.03775114821059378, "phrase": "dynamic_camera"}, {"score": 0.03164044153479802, "phrase": "static_images"}, {"score": 0.004476768460196375, "phrase": "stationary_and_dynamic_cameras"}, {"score": 0.004402147102967893, "phrase": "traffic_surveillance"}, {"score": 0.004353088808931991, "phrase": "autonomous_driving"}, {"score": 0.004304574865291508, "phrase": "security_applications"}, {"score": 0.004150592040012897, "phrase": "object_detection"}, {"score": 0.00411584380698062, "phrase": "common_disadvantage"}, {"score": 0.003848088904418221, "phrase": "poor_performances"}, {"score": 0.003731237342932566, "phrase": "different_types"}, {"score": 0.0036792981951416105, "phrase": "even_a_cross_camera_testing"}, {"score": 0.0035178850936755848, "phrase": "stationary_camera"}, {"score": 0.003092077180049586, "phrase": "car_detection"}, {"score": 0.003040466163186493, "phrase": "class_car"}, {"score": 0.002850457082930323, "phrase": "static_and_dynamic_cameras"}, {"score": 0.002802867698544655, "phrase": "totally_different_setting"}, {"score": 0.0026873320229798664, "phrase": "off-line_learning_phase"}, {"score": 0.002657332920167067, "phrase": "image_database"}, {"score": 0.002456486927713543, "phrase": "art_results"}, {"score": 0.00238179189290753, "phrase": "proposed_approach"}, {"score": 0.002368456466230513, "phrase": "better_results"}, {"score": 0.002195552442011313, "phrase": "ground_truth"}, {"score": 0.0021771357714479946, "phrase": "large_sequence"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Mixture of deformable part models", " Vehicle detection", " Car detection", " Urban environment"], "paper_abstract": "Sequences of images from urban environments are increasing in number as well as their potential applications. They are being taken (from stationary and dynamic cameras) for applications such as traffic surveillance, or for autonomous driving, or for security applications, etc. The literature presents several different approaches for each application. For object detection, a common disadvantage is that they only consider images obtained from a stationary, or a dynamic, camera to train the detectors. This can lead to poor performances when the detectors are used in sequences of images from different types of cameras, or even a cross camera testing. e.g., training with data from a dynamic camera and testing with sequences from a stationary camera. Another disadvantage is that some approaches use several models for each point of view of the car, generating a lot of models and, in some cases, one classifier for each point of view. In this paper, we approach the problem of car detection using a model of the class car created with a dataset of static images and we use the model to detect cars in sequence of images that were collected from static and dynamic cameras, i.e., in a totally different setting than used for training. The creation of the model is done by an off-line learning phase, using an image database of cars in several points of view, PASCAL 2007. The model is based on a mixture of deformable part models that have been shown to give state of the art results for detection in static images. The results show that the proposed approach achieves better results than the state of the art approaches in sequence of images obtained from a stationary, or a dynamic camera. Another contribution of our paper is a ground truth of a large sequence of images available in the Internet. (C) 2013 Elsevier B.V. All rights reserved.", "paper_title": "Car detection in sequences of images of urban environments using mixture of deformable part models", "paper_id": "WOS:000331854700006"}