{"auto_keywords": [{"score": 0.046040545801964705, "phrase": "communication_needs"}, {"score": 0.00481495049065317, "phrase": "proactively-planned_ad-hoc_networks"}, {"score": 0.004567596860086148, "phrase": "mobile_ad-hoc_networks"}, {"score": 0.0041102032028337366, "phrase": "distributed_applications"}, {"score": 0.0039449104968131655, "phrase": "middleware_layer"}, {"score": 0.0038085117064624208, "phrase": "multiple_possibilities"}, {"score": 0.0034268702387746106, "phrase": "partial_and_changeable_knowledge"}, {"score": 0.0026625223485099805, "phrase": "manet"}, {"score": 0.002409503258044183, "phrase": "simulation_results"}, {"score": 0.002353554841514325, "phrase": "comparative_advantages"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Mobile ad-hoc networks", " Knowledge exploitation", " Communication requirements", " Proactive-planning"], "paper_abstract": "This paper explores the idea of managing mobile ad-hoc networks (MANETs) by the communication needs of their nodes, as a means to facilitate the operation of distributed applications. Specifically, we present a middleware layer that enables reasoning about the multiple possibilities there may exist to ensure satisfiability of certain communication needs. This middleware has been explicitly devised to handle partial and changeable knowledge about the networks, and to guide the search for missing information whenever it cannot conclude whether it will be possible to satisfy some needs. These features provide the basis to implement policies with which to coordinate activities in a MANET, in quest for the configuration that best satisfies the communication needs of its nodes. We provide simulation results to show the comparative advantages of our solution, plus a report of experiments to assess its practicality and usability. (C) 2009 Elsevier Ltd. All rights reserved.", "paper_title": "KEPPAN: Knowledge exploitation for proactively-planned ad-hoc networks", "paper_id": "WOS:000269993300006"}