{"auto_keywords": [{"score": 0.04046992388012361, "phrase": "different_views"}, {"score": 0.004620093797504386, "phrase": "forensic_anthropology"}, {"score": 0.00450231514359539, "phrase": "three-dimensional_models"}, {"score": 0.004081385289516914, "phrase": "whole_object"}, {"score": 0.003916098498242888, "phrase": "single_image"}, {"score": 0.003623949225126944, "phrase": "range_image_registration_methods"}, {"score": 0.0035681790580031998, "phrase": "accurate_integration"}, {"score": 0.003459191419478298, "phrase": "range_scanners"}, {"score": 0.003405948098114941, "phrase": "pair-wise_approaches"}, {"score": 0.003336225354214798, "phrase": "adjacent_pair"}, {"score": 0.003301899275278983, "phrase": "scanned_views"}, {"score": 0.0029013950320185573, "phrase": "evolutionary_computation"}, {"score": 0.0026026666736474404, "phrase": "evolutionary_algorithm"}, {"score": 0.00257586859792573, "phrase": "pair-wise_image_registration"}, {"score": 0.002358917661465133, "phrase": "experimental_setup"}], "paper_keywords": [""], "paper_abstract": "Different tasks in forensic anthropology require the use of three-dimensional models of forensic objects (skulls, bones, corpses, etc) captured by 3D range scanners. Since a whole object cannot be completely scanned with a single image, multiple scans from different views are needed to supply the information to construct the 3D model. Range image registration methods study the accurate integration of the different views acquired by range scanners, with pair-wise approaches progressively processing every adjacent pair of scanned views until reconstructing the whole 3D model of the object. Our proposal is based on the adaptation of our previous work (Cordon et al, IEEE Conference on Evolutionary Computation, pp 2738-2744, 2005 in Pattern Recognit Lett 27(11); 1191-1200, 2006) in order to apply the scatter search evolutionary algorithm to pair-wise image registration in forensic anthropology applications. To measure the performance of this adaptation, we design an experimental setup considering some of the most recent and accurate evolutionary techniques for the problem, as well as one skull from our Physical Anthropology Lab. Two additional volumes, commonly used in other pair-wise range IR contributions, have also been considered to complement the comparison of results among the proposals.", "paper_title": "A scatter search-based technique for pair-wise 3D range image registration in forensic anthropology", "paper_id": "WOS:000245852900001"}