{"auto_keywords": [{"score": 0.044880897290579584, "phrase": "senior_executive"}, {"score": 0.020379872946150332, "phrase": "project_manager"}, {"score": 0.010612387000973441, "phrase": "risk_attitude"}, {"score": 0.010547295577398481, "phrase": "new_product_development"}, {"score": 0.010482599164236986, "phrase": "dual_information_asymmetry"}, {"score": 0.004254277035435156, "phrase": "wage_contract"}, {"score": 0.004086443472472481, "phrase": "new_product"}, {"score": 0.004061214835223812, "phrase": "early_research_stage"}, {"score": 0.004036141321779216, "phrase": "unobservable_effort"}, {"score": 0.0039252049353279556, "phrase": "later_development_stage"}, {"score": 0.0037820003983334476, "phrase": "subjective_assessments"}, {"score": 0.003747020072136732, "phrase": "idea_value"}, {"score": 0.0036214942784619742, "phrase": "uncertain_variables"}, {"score": 0.0035548008271253607, "phrase": "uncertainty_theory"}, {"score": 0.0034785371344994197, "phrase": "uncertain_principal_agent_models"}, {"score": 0.0033308667764141257, "phrase": "senior_executive's_optimal_mechanisms"}, {"score": 0.0032898346872897383, "phrase": "project_manager's_risk_attitude"}, {"score": 0.0031501497751403058, "phrase": "low_incentive_term"}, {"score": 0.0028001000510468324, "phrase": "project_manager's_idea_value"}, {"score": 0.002615460042926181, "phrase": "project_manager's_effort"}, {"score": 0.002551372449383365, "phrase": "project_manager's_idea_information"}, {"score": 0.0022818212023413983, "phrase": "aggressive_project_manager's_idea"}, {"score": 0.0022328064591297676, "phrase": "senior_executive's_profits"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Uncertainty theory", " New product development", " Information asymmetry", " Wage contract"], "paper_abstract": "This paper investigates the impact of risk attitude on incentives and performances in a two-stage (research stage and development stage) new product development setting with one senior executive (she) and one project manager (he). The senior executive offers a wage contract to the project manager in the presence of dual information asymmetry including his unknown idea value of a new product in early research stage and unobservable effort to convert the idea into a product in later development stage. Due to the variability of technology and market, the subjective assessments about the idea value and the revenue generated by the product are characterized as uncertain variables. Within the framework of uncertainty theory, we first present four classes of uncertain principal agent models, and then derive their respective optimal wage contract mechanisms. We find that the structures of the senior executive's optimal mechanisms depend on the project manager's risk attitude. If the project manager becomes more conservative, the senior executive should set a low incentive term to avert risk. Otherwise, she should do the opposite. Moreover, we identify two values: the information value of the idea how much the senior executive is willing to pay to acquire information regarding the project manager's idea value, and the information value of the effort how much the senior executive ensures to win when she can contract on the project manager's effort. Our results show that acquiring the project manager's idea information yields the highest potential when the project manager is aggressive, but in the case of contracting on his effort, the opposite appears to be true. The results also indicate that acquiring more information on an aggressive project manager's idea always has higher impact on the senior executive's profits than contracting on his effort. We also provide several interesting managerial insights in new product development through our analytical and simulation results. (C) 2014 Elsevier Ltd. All rights reserved.", "paper_title": "The impact of risk attitude in new product development under dual information asymmetry", "paper_id": "WOS:000344438700012"}