{"auto_keywords": [{"score": 0.04805001769300638, "phrase": "pollution_attacks"}, {"score": 0.015719716506582538, "phrase": "network_coding"}, {"score": 0.011506895331955981, "phrase": "intermediate_nodes"}, {"score": 0.011372783664574882, "phrase": "proposed_scheme"}, {"score": 0.004503422625191897, "phrase": "malicious_packets"}, {"score": 0.004312622975366672, "phrase": "network_coding_process"}, {"score": 0.004228577663320847, "phrase": "greater_damage"}, {"score": 0.004178935413340453, "phrase": "traditional_routing"}, {"score": 0.003970439654470374, "phrase": "unconditionally_secure_authentication_code"}, {"score": 0.003817137134650275, "phrase": "computational_assumptions"}, {"score": 0.003757480190200645, "phrase": "multicast_network_coding"}, {"score": 0.0036987521452843987, "phrase": "keying_material"}, {"score": 0.003584025547693833, "phrase": "trusted_authority"}, {"score": 0.003097865379563127, "phrase": "malicious_messages"}, {"score": 0.0026986685585382347, "phrase": "malicious_insider_nodes"}, {"score": 0.0026045914281028473, "phrase": "integrity_check"}, {"score": 0.0022070310530794097, "phrase": "high_decrease"}, {"score": 0.0021049977753042253, "phrase": "insider_attackers"}], "paper_keywords": ["Authentication codes", " network coding", " pollution attacks"], "paper_abstract": "Systems exploiting network coding to increase their throughput suffer greatly from pollution attacks, which consist of injecting malicious packets in the network. The pollution attacks are amplified by the network coding process, resulting in a greater damage than under traditional routing. In this paper, we address this issue by designing an unconditionally secure authentication code (that is, which does not rely on computational assumptions) suitable for multicast network coding, where the keying material is initially computed and distributed by a trusted authority to the destinations and intermediate nodes. The proposed scheme allows not only destinations, but also intermediate nodes, to verify the integrity and origin of the packets received without having to decode, and thus detect and discard the malicious messages in transit that fail the verification. This way, the pollution is canceled out before reaching the destinations. The proposed scheme is robust against pollution attacks from outsiders, as well as coalitions of malicious insider nodes, which have the ability to perform the integrity check, but instead get corrupted and use their knowledge to themselves attack the network. We analyze the performance of the scheme in terms of both throughput and goodput and show that the price to pay for tolerating inside attackers is a high decrease in throughput (it is inversely proportional to the number of insider attackers that can collude). We finally discuss applications to file distribution.", "paper_title": "An Authentication Code Against Pollution Attacks in Network Coding", "paper_id": "WOS:000298296200002"}