{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "fuzzy_concepts"}, {"score": 0.04805212023869437, "phrase": "predictive_microbiology"}, {"score": 0.031071491193311245, "phrase": "fuzzy_sets"}, {"score": 0.003506195165291177, "phrase": "xml"}, {"score": 0.003293570937654716, "phrase": "imprecise_data"}, {"score": 0.003262035294895737, "phrase": "possibility_distributions"}, {"score": 0.003138874040786261, "phrase": "miel_language"}, {"score": 0.0029062860108533374, "phrase": "fuzzy_pattern_matching_techniques"}, {"score": 0.002690886043654469, "phrase": "hierarchized_domain"}, {"score": 0.002467536552997677, "phrase": "semantic_link"}, {"score": 0.0023066880707738736, "phrase": "fuzzy_set"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["flexible querying", " fuzzy database", " taxonomies", " heterogeneous data", " predictive microbiology"], "paper_abstract": "This paper is dedicated to the use of fuzzy concepts in the design of a database in the field of predictive microbiology. Three characteristics of the data have guided this design: heterogeneity, incompleteness and imprecision. Three data models have been used to represent the data: the relational model, the conceptual graph model and the XML model. These models have been extended to be able to represent imprecise data as possibility distributions. They are queried simultaneously using the MIEL language. In this language, the preferences of the user are represented by fuzzy sets. Fuzzy pattern matching techniques are used to compare preferences to imprecise data. Fuzzy sets may be defined on a hierarchized domain of values, called a taxonomy (values of the domain are connected using the a kind of semantic link). The semantics of such a fuzzy set is precisely defined. The notion of fuzzy set closure is introduced to compare two fuzzy sets whose domain of values is a taxonomy. (c) 2006 Elsevier B.V. All rights reserved.", "paper_title": "Fuzzy concepts applied to the design of a database in predictive microbiology", "paper_id": "WOS:000236617700006"}