{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "protein_spots"}, {"score": 0.032604320386754426, "phrase": "proposed_approach"}, {"score": 0.004720606036240263, "phrase": "two-dimensional_gel_image_analysis"}, {"score": 0.004582528208024817, "phrase": "particularly_challenging_and_arduous_process"}, {"score": 0.004109770306454165, "phrase": "final_biological_conclusions"}, {"score": 0.0040491842732233154, "phrase": "proteomic_experiment"}, {"score": 0.003989487818395848, "phrase": "available_techniques"}, {"score": 0.00395017798595193, "phrase": "commercial_software_packages"}, {"score": 0.0038727120021750973, "phrase": "existing_challenges"}, {"score": 0.003778004256546193, "phrase": "different_degree"}, {"score": 0.0036312482387007815, "phrase": "extensive_human_intervention"}, {"score": 0.0032724821705972357, "phrase": "novel_approach"}, {"score": 0.0027650234530228923, "phrase": "existing_software_programs"}, {"score": 0.002670719148310961, "phrase": "experimental_evaluation"}, {"score": 0.0022452005651385095, "phrase": "-the-art_techniques"}, {"score": 0.0021049977753042253, "phrase": "compared_software_packages"}], "paper_keywords": ["Two-dimensional (2-D) gel images", " protein spot detection", " protein spot segmentation", " proteomics"], "paper_abstract": "Two-dimensional gel image analysis is widely recognized as a particularly challenging and arduous process in proteomics field. The detection and segmentation of protein spots are two significant stages of this process as they can considerably affect the final biological conclusions of a proteomic experiment. The available techniques and commercial software packages deal with the existing challenges of 2-D gel images in a different degree of success. Furthermore, they require extensive human intervention which not only limits the throughput but unavoidably questions the objectivity and reproducibility of results. This paper introduces a novel approach for the detection and segmentation of protein spots on 2-D gel images. The proposed approach is based on 2-D image histograms as well as on 3-D spots morphology. It is automatic and capable to deal with the most common deficiencies of existing software programs and techniques in an effectivemanner. Experimental evaluation includes tests on several real and synthetic 2-D gel images produced by different technology setups, containing a total of similar to 21 400 spots. Furthermore, the proposed approach has been compared with two commercial software packages as well as with two state-of-the-art techniques. Results have demonstrated the effectiveness of the proposed approach and its superiority against compared software packages and techniques.", "paper_title": "An Effective Approach for Detection and Segmentation of Protein Spots on 2-D Gel Images", "paper_id": "WOS:000329516400009"}