{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "biochemical_transformations"}, {"score": 0.012370903052728614, "phrase": "enzyme_list"}, {"score": 0.009806778340873692, "phrase": "ec_numbers"}, {"score": 0.004718897469501381, "phrase": "reaction_information"}, {"score": 0.0046621835537196754, "phrase": "iubmb_enzyme_list"}, {"score": 0.004624794977070203, "phrase": "genomics"}, {"score": 0.004131063310728304, "phrase": "full_equations"}, {"score": 0.003920049436883885, "phrase": "iubmb"}, {"score": 0.0035296940954990964, "phrase": "bio-informatics_studies"}, {"score": 0.003431384878608803, "phrase": "bioinformatics_studies"}, {"score": 0.0032428780373184207, "phrase": "actual_usage"}, {"score": 0.003114584448820957, "phrase": "partial_characteristics"}, {"score": 0.002907992115184249, "phrase": "novel_ontology"}, {"score": 0.002872979681637667, "phrase": "piero"}, {"score": 0.0027260525536580912, "phrase": "enzymatic_reactions"}, {"score": 0.0025866199378466754, "phrase": "overall_reactions"}, {"score": 0.0024642355970277497, "phrase": "actual_transformations"}, {"score": 0.0024345529783611703, "phrase": "enzymatic_reaction_equations"}, {"score": 0.0023666732429695908, "phrase": "gene_ontology"}, {"score": 0.002263799931018574, "phrase": "common_partial_reaction_characteristics"}, {"score": 0.002218526133566788, "phrase": "orthologous_genes"}, {"score": 0.002174155795026218, "phrase": "possible_enzymes"}, {"score": 0.0021049977753042253, "phrase": "piero_ontology"}], "paper_keywords": ["Enzyme", " reaction", " transformation", " ontology"], "paper_abstract": "Genomics is faced with the issue of many partially annotated putative enzyme-encoding genes for which activities have not yet been verified, while metabolomics is faced with the issue of many putative enzyme reactions for which full equations have not been verified. Knowledge of enzymes has been collected by IUBMB, and has been made public as the Enzyme List. To date, however, the terminology of the Enzyme List has not been assessed comprehensively by bio-informatics studies. Instead, most of the bioinformatics studies simply use the identifiers of the enzymes, i.e. the Enzyme Commission (EC) numbers. We investigated the actual usage of terminology throughout the Enzyme List, and demonstrated that the partial characteristics of reactions cannot be retrieved by simply using EC numbers. Thus, we developed a novel ontology, named PIERO, for annotating biochemical transformations as follows. First, the terminology describing enzymatic reactions was retrieved from the Enzyme List, and was grouped into those related to overall reactions and biochemical transformations. Consequently, these terms were mapped onto the actual transformations taken from enzymatic reaction equations. This ontology was linked to Gene Ontology (GO) and EC numbers, allowing the extraction of common partial reaction characteristics from given sets of orthologous genes and the elucidation of possible enzymes from the given transformations. Further future development of the PIERO ontology should enhance the Enzyme List to promote the integration of genomics and metabolomics.", "paper_title": "PIERO ontology for analysis of biochemical transformations: Effective implementation of reaction information in the IUBMB enzyme list", "paper_id": "WOS:000348347800002"}