{"auto_keywords": [{"score": 0.044141882498322, "phrase": "km_performance_evaluation"}, {"score": 0.00481495049065317, "phrase": "knowledge_management"}, {"score": 0.004600228893803583, "phrase": "literature_review"}, {"score": 0.00437281181878921, "phrase": "keyword_index"}, {"score": 0.004328689762198895, "phrase": "article_abstract"}, {"score": 0.0038520615699124123, "phrase": "six_online_databases"}, {"score": 0.0036801209922064817, "phrase": "km_measurement"}, {"score": 0.002943502888225748, "phrase": "different_research_and_problem_domains"}, {"score": 0.002618995204424126, "phrase": "evaluation_development"}, {"score": 0.0025793874956029795, "phrase": "problem-orientated_domain"}, {"score": 0.0024641134634779535, "phrase": "knowledge-based_systems"}, {"score": 0.0024392031587145728, "phrase": "case-based_reasoning"}, {"score": 0.002342048999008582, "phrase": "simply_another_methodology"}, {"score": 0.002248755794042486, "phrase": "new_understanding"}, {"score": 0.002214734873559146, "phrase": "driving_power"}, {"score": 0.0021923400552366756, "phrase": "km_methodologies"}, {"score": 0.0021049977753042253, "phrase": "km_performance_evaluations"}], "paper_keywords": ["knowledge management", " performance evaluation", " literature survey"], "paper_abstract": "In this paper, the development of knowledge management (KM) was surveyed, using a literature review and classification of articles from 1995 to 2004. With a keyword index and article abstract, we explored how KM performance evaluation has developed during this period. Based on a scope of 108 articles from 80 academic KM journals (retrieved from six online databases), we surveyed and classified methods of KM measurement, using the following eight categories: qualitative analysis, quantitative analysis, financial indicator analysis, non-financial indicator analysis, internal performance analysis, external performance analysis, project-orientated analysis and organization-orientated analysis, together with their measurement matrices for different research and problem domains. Future development directions for KM performance evaluation are presented in our discussion. They include: (1) KM performance measurements have tended towards expertise orientation, while evaluation development is a problem-orientated domain; (2) different information technology methodologies, such as expert systems, knowledge-based systems and case-based reasoning may be able to evaluate KM as simply another methodology; (3) the ability to continually change and obtain new understanding is the driving power behind KM methodologies, and should be the basis of KM performance evaluations in the future.", "paper_title": "Knowledge management performance evaluation: a decade review from 1995 to 2004", "paper_id": "WOS:000236053800003"}