{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "automated_container_terminal"}, {"score": 0.0046429592670444945, "phrase": "automated_guided_vehicles"}, {"score": 0.004500414250942443, "phrase": "automated_lifting_vehicles"}, {"score": 0.004098397888277889, "phrase": "storage_yard"}, {"score": 0.003911010373894104, "phrase": "operational_productivities"}, {"score": 0.0036743708250589484, "phrase": "quay_cranes"}, {"score": 0.003542976343910816, "phrase": "flexible_path_layout"}, {"score": 0.003345895878114341, "phrase": "vertical_and_horizontal_directions"}, {"score": 0.0032940691998512963, "phrase": "traffic_control_scheme"}, {"score": 0.0031928040608991543, "phrase": "minimum-_time_route"}, {"score": 0.0030466955629231047, "phrase": "simulation_experiments"}, {"score": 0.002311933249234786, "phrase": "tandem_double-trolley_qcs"}], "paper_keywords": ["Automated container terminal", " Automated guided vehicle", " Automated lifting vehicle", " Deadlock avoidance", " Quayside productivity"], "paper_abstract": "In an automated container terminal, the automated guided vehicles (AGVs) and the automated lifting vehicles (ALVs) are the most popular candidates to be used for transporting containers between the quayside and the storage yard. In this paper, we compare the operational productivities of the two types of vehicles when used in combination with the quay cranes of various performances. We assume a flexible path layout in which the vehicles can move almost freely in any vertical and horizontal directions. The traffic control scheme employed in our simulation finds a minimum- time route and schedules the travel to avoid deadlocks. Simulation experiments show that the ALVs reach the same productivity level as the AGVs using much less number of vehicles due to its self-lifting capability. However, the results also reveal that the AGVs eventually catch up the performance of the ALVs in most cases if the number of vehicles given is large enough. An exception is when the tandem double-trolley QCs are used for loading, in which case the AGVs cannot catch up the ALVs no matter how many more vehicles are added.", "paper_title": "Comparison of operations of AGVs and ALVs in an automated container terminal", "paper_id": "WOS:000290574400008"}