{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "computerized_decision_support"}, {"score": 0.01422014520379434, "phrase": "care_professionals"}, {"score": 0.011307070300791682, "phrase": "guideline_implementation"}, {"score": 0.009752389246713667, "phrase": "cardss"}, {"score": 0.009273000993696254, "phrase": "previous_practice"}, {"score": 0.009128035334050481, "phrase": "guideline_complexity"}, {"score": 0.004650175539595746, "phrase": "outpatient_cardiac_rehabilitation"}, {"score": 0.004434491600123024, "phrase": "clinical_practice_guidelines"}, {"score": 0.004269138804116089, "phrase": "system_characteristics"}, {"score": 0.0036092644587974953, "phrase": "improved_adherence"}, {"score": 0.0035864603175592854, "phrase": "persistent_non-adherence"}, {"score": 0.0035525230119401153, "phrase": "prevailing_guideline"}, {"score": 0.0035300761057370745, "phrase": "successful_adoption"}, {"score": 0.0033768559933238665, "phrase": "conceptual_framework"}, {"score": 0.003355515315708125, "phrase": "cabana_et_al"}, {"score": 0.0031493643207295406, "phrase": "cardss_decision_support_system"}, {"score": 0.0030900173244612075, "phrase": "cardiac_rehabilitation"}, {"score": 0.003051073364818384, "phrase": "twenty-nine_rehabilitation_nurses"}, {"score": 0.0029558409515535525, "phrase": "guideline_adherence"}, {"score": 0.0029001301231553005, "phrase": "guidelines'_recommendations"}, {"score": 0.002881793492919646, "phrase": "decision_logic"}, {"score": 0.002845466319548362, "phrase": "users'_inertia"}, {"score": 0.0026705669656375197, "phrase": "system's_recommendations"}, {"score": 0.0024905375922547918, "phrase": "organizational_or_environmental_constraints"}, {"score": 0.002367259428370391, "phrase": "preferred_practice"}, {"score": 0.0022216880365475418, "phrase": "organizational_or_procedural_changes"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ireland_ltd."}], "paper_keywords": ["Clinical decision support systems", " Qualitative evaluation", " Guideline adherence", " Cardiac rehabilitation"], "paper_abstract": "Context: Computerized decision support systems (CDSSs) can be used to improve the implementation of clinical practice guidelines by changing the behaviour of care professionals. While the influence of system characteristics on the effectiveness of CDSSs is studied, little is known about the relation between cognitive, organizational and environmental factors, and CDSSs' effectiveness. Objective: To assess the effect of CDSSs on cognitive, organizational, and environmental factors that hamper guideline implementation. Design: In-depth, semi-structured interviews with care professionals, on reasons for improved adherence or persistent non-adherence to the prevailing guideline after successful adoption of a CDSS. All remarks regarding guideline implementation were extracted and classified using the conceptual framework from Cabana et al. [5]. Setting: Outpatient cardiac rehabilitation clinics. Participants: Care professionals that used the CARDSS decision support system for therapeutic decision making in cardiac rehabilitation. Results: Twenty-nine rehabilitation nurses and physiotherapists from 21 Dutch clinics were interviewed. CARDSS improved guideline adherence by increasing its users' familiarity with the guidelines' recommendations and decision logic, by overcoming users' inertia to previous practice, and by reducing guideline complexity for example by facilitating calculation and interpretation of data. If the system's recommendations were shared with patients, refusal to participate in therapies reduced. CARDSS never incited users to target barriers related to organizational or environmental constraints. Conclusion: Our results suggest that computerized decision support can improve guideline implementation by increasing the knowledge of preferred practice, by reducing inertia to previous practice, and by reducing guideline complexity. However, computerized decision support is not effective when organizational or procedural changes are required that users consider to be beyond their tasks and responsibilities. (C) 2010 Elsevier Ireland Ltd. All rights reserved.", "paper_title": "The effect of computerized decision support on barriers to guideline implementation: A qualitative study in outpatient cardiac rehabilitation", "paper_id": "WOS:000278192800006"}