{"auto_keywords": [{"score": 0.04081949039983462, "phrase": "six_quantization_levels"}, {"score": 0.03137947963966205, "phrase": "discrimination_power"}, {"score": 0.027527624047246183, "phrase": "texture_descriptors"}, {"score": 0.00481495049065317, "phrase": "co-occurrence_texture_statistics"}, {"score": 0.004745179442957631, "phrase": "gray-level_quantization"}, {"score": 0.0047175535881504626, "phrase": "classifying_breast_ultrasound"}, {"score": 0.0045286036546553585, "phrase": "six_gray-scale_quantization_levels"}, {"score": 0.00412453424255527, "phrase": "minimum_bounding_rectangle"}, {"score": 0.004017503356693001, "phrase": "gray-level_co-occurrence_matrix"}, {"score": 0.003381208502323146, "phrase": "feature_space_dimensionality"}, {"score": 0.0032266841850427798, "phrase": "common_practice"}, {"score": 0.003152082324187236, "phrase": "feature_space"}, {"score": 0.003115428684709861, "phrase": "mutual_information_technique"}, {"score": 0.0030433912290976457, "phrase": "fisher_linear_discriminant_analysis"}, {"score": 0.002947043609853674, "phrase": "texture_features"}, {"score": 0.002904260480085368, "phrase": "first_m-ranked_features"}, {"score": 0.002771472508484958, "phrase": "roc_curve"}, {"score": 0.0025090616962891773, "phrase": "best_auc"}, {"score": 0.002394299529213776, "phrase": "single_texture"}, {"score": 0.002352626922459313, "phrase": "averaging_procedure"}, {"score": 0.002325247976657323, "phrase": "quantization_level"}, {"score": 0.0021049977753042253, "phrase": "breast_lesions"}], "paper_keywords": ["Breast ultrasound", " co-occurrence matrix", " quantization level", " tumor classification"], "paper_abstract": "In this paper, we investigated the behavior of 22 co-occurrence statistics combined to six gray-scale quantization levels to classify breast lesions on ultrasound (BUS) images. The database of 436 BUS images used in this investigation was formed by 217 carcinoma and 219 benign lesions images. The region delimited by a minimum bounding rectangle around the lesion was employed to calculate the gray-level co-occurrence matrix (GLCM). Next, 22 co-occurrence statistics were computed regarding six quantization levels (8, 16, 32, 64, 128, and 256), four orientations (0 degrees, 45 degrees, 90 degrees, and 135 degrees), and ten distances (1, 2, ... , 10 pixels). Also, to reduce feature space dimensionality, texture descriptors of the same distance were averaged over all orientations, which is a common practice in the literature. Thereafter, the feature space was ranked using mutual information technique with minimal-redundancy-maximal-relevance (mRMR) criterion. Fisher linear discriminant analysis (FLDA) was applied to assess the discrimination power of texture features, by adding the first m-ranked features to the classification procedure iteratively until all of them were considered. The area under ROC curve (AUC) was used as figure of merit to measure the performance of the classifier. It was observed that averaging texture descriptors of a same distance impacts negatively the classification performance, since the best AUC of 0.81 was achieved with 32 gray levels and 109 features. On the other hand, regarding the single texture features (i.e., without averaging procedure), the quantization level does not impact the discrimination power, since AUC=0.87 was obtained for the six quantization levels. Moreover, the number of features was reduced (between 17 and 24 features). The texture descriptors that contributed notably to distinguish breast lesions were contrast and correlation computed from GLCMs with orientation of 90 degrees and distance more than five pixels.", "paper_title": "Analysis of Co-Occurrence Texture Statistics as a Function of Gray-Level Quantization for Classifying Breast Ultrasound", "paper_id": "WOS:000310149700005"}