{"auto_keywords": [{"score": 0.04987325282958325, "phrase": "domain-specific_query_forms"}, {"score": 0.03566317662898919, "phrase": "great_deal"}, {"score": 0.02929712519086578, "phrase": "form_submission"}, {"score": 0.00481495049065317, "phrase": "prequery_discovery_of"}, {"score": 0.004632039024076267, "phrase": "html_query_forms"}, {"score": 0.004533427352547707, "phrase": "main_challenges"}, {"score": 0.004494570360108983, "phrase": "deep_web_crawling"}, {"score": 0.004456044928556639, "phrase": "automatic_solutions"}, {"score": 0.004249957578636515, "phrase": "html_forms"}, {"score": 0.003623949225126944, "phrase": "underlying_data_source"}, {"score": 0.0032820385246266773, "phrase": "long_list"}, {"score": 0.0028346293790895024, "phrase": "semantic_processing"}, {"score": 0.0025780912201045555, "phrase": "domain_knowledge"}, {"score": 0.0025122373359090454, "phrase": "up-to-date_review"}, {"score": 0.002294686545883412, "phrase": "form_discovery"}, {"score": 0.0021049977753042253, "phrase": "immediate_next_steps"}], "paper_keywords": ["Deep web", " hidden web", " domain-specific search", " query form discovery"], "paper_abstract": "The discovery of HTML query forms is one of the main challenges in Deep web crawling. Automatic solutions for this problem perform two main tasks. The first is locating HTML forms on the web, which is done through the use of traditional/focused crawlers. The second is identifying which of these forms are indeed meant for querying, which also typically involves determining a domain for the underlying data source (and thus for the form as well). This problem has attracted a great deal of interest, resulting in a long list of algorithms and techniques. Some methods submit requests through the forms and then analyze the data retrieved in response, typically requiring a great deal of knowledge about the domain as well as semantic processing. Others do not employ form submission, to avoid such difficulties, although some techniques rely to some extent on semantics and domain knowledge. This survey gives an up-to-date review of methods for the discovery of domain-specific query forms that do not involve form submission. We detail these methods and discuss how form discovery has become increasingly more automated over time. We conclude with a forecast of what we believe are the immediate next steps in this trend.", "paper_title": "Prequery Discovery of Domain-Specific Query Forms: A Survey", "paper_id": "WOS:000321261000012"}