{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "people's_affective_responses"}, {"score": 0.0060849581805540055, "phrase": "crowdsourcing_approach"}, {"score": 0.0051068084571448845, "phrase": "automatic_route_planning"}, {"score": 0.0047051051659828275, "phrase": "route-planning_services"}, {"score": 0.004192190072470619, "phrase": "affective_responses"}, {"score": 0.0041154571996523505, "phrase": "people's_daily_behavior"}, {"score": 0.003484864867147635, "phrase": "computer-based_route_planning"}, {"score": 0.0032066653632708965, "phrase": "affect-space-model"}, {"score": 0.0030196181347744372, "phrase": "routing_algorithm"}, {"score": 0.0029780219173522115, "phrase": "affectroute"}, {"score": 0.002843450389745497, "phrase": "collected_data"}, {"score": 0.002765636101369536, "phrase": "human_participants"}, {"score": 0.0025683581446365165, "phrase": "conventional_shortest_ones"}, {"score": 0.00249805321224923, "phrase": "car_navigation_systems"}, {"score": 0.0022878396720586044, "phrase": "proposed_method"}, {"score": 0.0022355167967736326, "phrase": "existing_route-planning_services"}], "paper_keywords": ["human wayfinding", " route planning", " crowdsourcing", " affective responses to environments"], "paper_abstract": "Humans perceive and evaluate environments affectively. Some places are experienced as unsafe, while some others as attractive and interesting. These affective responses to environments influence people's daily behavior and decision-making in space, e.g., choosing which route to take, or which place to visit. In this article, we report on a methodology of using people's affective responses to environments for enhancing computer-based route planning. More specifically, we explore a crowdsourcing approach to model and collect people's affective responses to environments; an Affect-Space-Model and a mobile application are developed to facilitate this crowdsourcing approach; a routing algorithm (named AffectRoute) is then proposed to aggregate and integrate the collected data for automatic route planning. Evaluation with human participants shows that the routes generated by considering people's affective responses to environments are significantly preferred over the conventional shortest ones, which are employed in car navigation systems and many online route planners. In conclusion, considering people's affective responses to environments contributes to the improvement of automatic route planning. The proposed method can be integrated into existing route-planning services (e.g., location-based services) to provide users with more satisfying routing results.", "paper_title": "AffectRoute - considering people's affective responses to environments for enhancing route-planning services", "paper_id": "WOS:000346067100005"}