{"auto_keywords": [{"score": 0.004225950334493496, "phrase": "selected_signatures"}, {"score": 0.0038364365168131586, "phrase": "composed_monads"}, {"score": 0.0037087324991876727, "phrase": "suitable_monad"}, {"score": 0.003637669525737665, "phrase": "traditional_term_monad"}, {"score": 0.00346589179059467, "phrase": "strictly_formal_basis"}, {"score": 0.0034325187732054093, "phrase": "term_monads"}, {"score": 0.0031159081999910694, "phrase": "'fuzzy_computing"}, {"score": 0.003056169480391946, "phrase": "fundamental_question"}, {"score": 0.0029117710453690827, "phrase": "language_constructions"}, {"score": 0.002542642270762272, "phrase": "type_constructors"}, {"score": 0.0023644936731468252, "phrase": "value_level_terms"}, {"score": 0.0021670777282518424, "phrase": "simply_typed_lambda_calculus"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Term monads", " Quantale", " Algebra", " Category theory"], "paper_abstract": "In this paper we will show how purely categorical constructions of terms are advantageous when investigating situations concerning uncertainty; more specifically where uncertainty comes from and how uncertainty is integrated when dealing with terms over selected signatures. There are basically two ways of invoking uncertainty for terms. On one hand, we may proceed by building composed monads where uncertainty is provided by some suitable monad composed with the traditional term monad. On the other hand, we can provide a strictly formal basis for term monads being created over categories themselves carrying uncertainty. This is the distinction between 'computing with fuzzy' and 'fuzzy computing' and the fundamental question raised by these constructions is where uncertainty resides in language constructions for logic. This paper also shows how the notion of signature often needs to be expanded to levels of signatures, in particular when dealing with type constructors. Such levels allow us to strictly delineate, e.g., primitive operations, type terms, and value level terms. Levels of signature will in this paper be exemplified by the construction of the signature of simply typed lambda calculus. (C) 2013 Elsevier B.V. All rights reserved.", "paper_title": "Fuzzy terms", "paper_id": "WOS:000343783600009"}