{"auto_keywords": [{"score": 0.049320924338933134, "phrase": "mobile_users"}, {"score": 0.010038797850294346, "phrase": "handheld_devices"}, {"score": 0.005913552672075517, "phrase": "semantic_rules"}, {"score": 0.00481495049065317, "phrase": "huge_quantity"}, {"score": 0.004305740330804528, "phrase": "web_pages"}, {"score": 0.004104269996872886, "phrase": "specific_circumstances"}, {"score": 0.004039221742250308, "phrase": "considerable_effort"}, {"score": 0.003943569631183138, "phrase": "completely_satisfactory_result"}, {"score": 0.0038348235692738783, "phrase": "suitable_resources"}, {"score": 0.003789137457228946, "phrase": "right_time"}, {"score": 0.003684634192576662, "phrase": "great_help"}, {"score": 0.0033745298175222056, "phrase": "new_levels"}, {"score": 0.003005151718290603, "phrase": "efficient_situation-aware_resource_recommender"}, {"score": 0.0027852927366010406, "phrase": "semantic_reasoner"}, {"score": 0.002752075650871066, "phrase": "domain_knowledge"}, {"score": 0.002581477142020187, "phrase": "fuzzy_engine"}, {"score": 0.0023925401023682717, "phrase": "certainty_degree"}, {"score": 0.002363995836370621, "phrase": "inferred_situation"}, {"score": 0.0021647968783414504, "phrase": "specific_situations"}, {"score": 0.002121913011761504, "phrase": "sarr"}], "paper_keywords": ["Mobile service recommender", " context-awareness", " fuzzy inference system", " web ontology", " semantic rules"], "paper_abstract": "Nowadays, a huge quantity of resources for mobile users are made available on the most important marketplaces. Further, handheld devices can accommodate plenty of these resources, such as applications, documents and web pages, locally. Thus, to search for resources suitable for specific circumstances often requires a considerable effort and rarely brings to a completely satisfactory result. A tool able to recommend suitable resources at the right time in each situation would be of great help for the mobile users and would make the use of the handheld devices less boring and more attractive. To this aim, new levels of granularity, together with some degree of self-awareness, are needed to assist mobile users in managing and using resources. In this paper, we propose an efficient situation-aware resource recommender (SARR), which helps mobile users to timely locate resources proactively. Situations are determined by a semantic reasoner that exploits domain knowledge expressed in terms of ontologies and semantic rules. This reasoner works in synergy with a fuzzy engine, which is in charge of handling the vagueness of some conditions in the semantic rules, computing a certainty degree for each inferred situation. These degrees are used to rank the situations and consequently to assign a priority to the resources associated with the specific situations. The application of SARR to two real business cases is also shown and discussed.", "paper_title": "A SITUATION-AWARE RESOURCE RECOMMENDER BASED ON FUZZY AND SEMANTIC WEB RULES", "paper_id": "WOS:000279640100005"}