{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "two-sample_time-course_microarray_experiments"}, {"score": 0.004680989658437977, "phrase": "bayesian"}, {"score": 0.004574247691703376, "phrase": "temporally_differentially_expressed_genes"}, {"score": 0.003944112858235306, "phrase": "second_sample"}, {"score": 0.0034004869983267085, "phrase": "modeling_gene_expression_profiles"}, {"score": 0.0032487508969192293, "phrase": "differentially_expressed_genes"}, {"score": 0.003051073364818384, "phrase": "proposed_procedure"}, {"score": 0.0029148831519944358, "phrase": "microarray_time-course_experiments"}, {"score": 0.0028490783932465288, "phrase": "small_number"}, {"score": 0.002690975370565776, "phrase": "repeated_measurements"}, {"score": 0.0024560114164181765, "phrase": "good_compromise"}, {"score": 0.0024281181691350085, "phrase": "nonparametric_and_normality_assumption_based_techniques"}, {"score": 0.0022802596433757565, "phrase": "analytic_expressions"}, {"score": 0.0021049977753042253, "phrase": "simulated_and_real_data"}], "paper_keywords": [""], "paper_abstract": "A truly functional Bayesian method for detecting temporally differentially expressed genes between two experimental conditions is presented. The method distinguishes between two biologically different set ups, one in which the two samples are interchangeable, and one in which the second sample is a modification of the first, i.e. the two samples are non-interchangeable. This distinction leads to two different Bayesian models, which allow more flexibility in modeling gene expression profiles. The method allows one to identify differentially expressed genes, to rank them and to estimate their expression profiles. The proposed procedure successfully deals with various technical difficulties which arise in microarray time-course experiments, such as small number of observations, non-uniform sampling intervals and presence of missing data or repeated measurements. The procedure allows one to account for various types of error, thus offering a good compromise between nonparametric and normality assumption based techniques. In addition, all evaluations are carried out using analytic expressions, hence the entire procedure requires very little computational effort. The performance of the procedure is studied using simulated and real data. (C) 2008 Elsevier B.V. All rights reserved.", "paper_title": "Bayesian models for two-sample time-course microarray experiments", "paper_id": "WOS:000264751000003"}