{"auto_keywords": [{"score": 0.04924496525218245, "phrase": "computer_vision"}, {"score": 0.04862844327283186, "phrase": "computer_science"}, {"score": 0.034806394145610105, "phrase": "journal_papers"}, {"score": 0.00481495049065317, "phrase": "high-quality_journals"}, {"score": 0.004429191773525288, "phrase": "workshop_proceedings"}, {"score": 0.004371160978838441, "phrase": "formal_publications"}, {"score": 0.0041102032028337366, "phrase": "high_quality_journals"}, {"score": 0.0036660436272785476, "phrase": "conference_papers"}, {"score": 0.0028652153774536967, "phrase": "journal_paper_publication"}, {"score": 0.0027660443371695024, "phrase": "follow-up_journal_paper"}, {"score": 0.002682081928174864, "phrase": "journal_paper"}, {"score": 0.0025106241866273897, "phrase": "prior_conference_paper"}, {"score": 0.0023090525096074264, "phrase": "journal_authors"}, {"score": 0.0022389308000757037, "phrase": "priors_analysis"}, {"score": 0.0021330078238529443, "phrase": "different_groups"}], "paper_keywords": ["Computer science", " Computer vision", " Publishing", " Journal papers", " Conference proceedings", " Author survey", " Bibliometrics"], "paper_abstract": "In computer science, as opposed to many other disciplines, papers published in conference and workshop proceedings count as formal publications when evaluating the scholarship of an academic. We consider the relationship between high quality journals and conferences in the computer vision (CV) subfield of computer science. We determined that 30% of papers in the top-3 CV journals base their work on top-3 conference papers by the same authors (which we call priors (See \"Methods\" section for the definition of a prior)). Journal papers with priors are significantly more cited than journal papers without priors. Also the priors themselves are cited more than other papers from the conferences. For a period of 3-5 years after the journal paper publication, the priors receive more citations than the follow-up journal paper. After that period, the journal paper starts receiving most of the citations. Furthermore, we found that having the prior conference paper did not make it any easier (faster) to publish in a journal. We also surveyed journal authors and based on their answers and the priors analysis, we discovered that authors seem to be divided into different groups depending on their preferred method of publication.", "paper_title": "Relationship between high-quality journals and conferences in computer vision", "paper_id": "WOS:000299088900017"}