{"auto_keywords": [{"score": 0.0490692031182167, "phrase": "mapreduce"}, {"score": 0.010500397484831857, "phrase": "cloud_computing"}, {"score": 0.008053436424446253, "phrase": "processing_procedures"}, {"score": 0.0062736503205983955, "phrase": "face"}, {"score": 0.00481495049065317, "phrase": "cluster_evolution"}, {"score": 0.0034963129868796033, "phrase": "application_developers"}, {"score": 0.003010893527930816, "phrase": "aforementioned_flexibility_constraints"}, {"score": 0.002869613770219469, "phrase": "flexible_architecture_for_cluster_evolution"}, {"score": 0.00260657976055413, "phrase": "mapreduce_cluster"}, {"score": 0.002244410443944976, "phrase": "general_mapreduce_system"}, {"score": 0.002196944917134202, "phrase": "performance_improvements"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Architecture", " Bandwidth", " MapReduce", " Cloud computing", " Cluster", " Operating system"], "paper_abstract": "MapReduce is considered the key behind the success of cloud computing because it not only makes a cluster highly scalable but also allows applications to use resources in a cluster. However, MapReduce achieves this simplicity at the expense of flexibility for data partitioning, localization, and processing procedures by handling all issues on behalf of application developers. Unfortunately, MapReduce currently has no solution capable of giving application developers flexibility in customizing data partitioning, localization, and processing procedures. To address the aforementioned flexibility constraints of MapReduce, we propose an architecture called Flexible Architecture for Cluster Evolution (FACE) which is both language-independent and platform-independent. FACE allows a MapReduce cluster to be designed to match various application requirements by customizing data partitioning, localization, and processing procedures. We compare the performance of FACE with that of a general MapReduce system and then demonstrate performance improvements with our implemented procedures. (C) 2014 Elsevier Ltd. All rights reserved.", "paper_title": "Flexible architecture for cluster evolution in cloud computing", "paper_id": "WOS:000353847600009"}