{"auto_keywords": [{"score": 0.046909599393664556, "phrase": "twitter"}, {"score": 0.01409000053744109, "phrase": "facebook"}, {"score": 0.00481495049065317, "phrase": "relationship-based_privacy_mechanisms"}, {"score": 0.004760394308239882, "phrase": "social_network_services"}, {"score": 0.004706453355638515, "phrase": "social_networking_services"}, {"score": 0.004420472010542188, "phrase": "explosive_growth"}, {"score": 0.004035107125458193, "phrase": "great_benefits"}, {"score": 0.003641433168173135, "phrase": "new_friendships"}, {"score": 0.003267342521938321, "phrase": "privacy_hazards"}, {"score": 0.0031037644581516973, "phrase": "intimate_information"}, {"score": 0.002386869729952315, "phrase": "privacy_threats"}, {"score": 0.0023329572140896237, "phrase": "sns_users"}, {"score": 0.002153653728048424, "phrase": "current_approaches"}], "paper_keywords": [""], "paper_abstract": "Social networking services (SNSs) such as Facebook and Twitter have experienced explosive growth during the few past years. Millions of users have created their profiles on these services because they experience great benefits in terms of friendship. SNSs can help people to maintain their friendships, organize their social lives, start new friendships, and meet others who share their hobbies and interests. However, all these benefits can be eclipsed by the privacy hazards that affect people in SNSs. People expose intimate information about their lives on SNSs, and this information affects the way others think about them. It is crucial that users be able to control how their information is distributed through the SNSs and decide who can access it. This article presents a list of privacy threats that can affect SNS users and what requirements privacy mechanisms should fulfill to prevent this threats. Then the article reviews current approaches and analyzes to what extent they cover the requirements.", "paper_title": "Open Challenges in Relationship-Based Privacy Mechanisms for Social Network Services", "paper_id": "WOS:000355926500002"}