{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "wireless_sensor_networks"}, {"score": 0.004757227624616643, "phrase": "wireless_sensor_network"}, {"score": 0.004332616870895206, "phrase": "important_problem"}, {"score": 0.004216566615939546, "phrase": "appropriate_solutions"}, {"score": 0.0038284549148537373, "phrase": "sufficient_amount"}, {"score": 0.003626000977962191, "phrase": "global_eavesdropper"}, {"score": 0.003465463460811278, "phrase": "local_eavesdropper"}, {"score": 0.003332072426367186, "phrase": "label_switching"}, {"score": 0.0031273209718167072, "phrase": "new_approach"}, {"score": 0.0031084874662053426, "phrase": "network_topology_discovery"}, {"score": 0.0030342774028555377, "phrase": "global_view"}, {"score": 0.0028911146216534646, "phrase": "sensor_networks"}, {"score": 0.0028391824655912617, "phrase": "traffic_analysis_attacks"}, {"score": 0.0027630232270330402, "phrase": "layered_cryptography"}, {"score": 0.0026889014020738578, "phrase": "consecutive_links"}, {"score": 0.002664637473997972, "phrase": "stochastic_security_analysis"}, {"score": 0.002600995957987461, "phrase": "important_issue"}, {"score": 0.0025853238923610076, "phrase": "resource-constrained_sensor_networks"}, {"score": 0.0024263474406990846, "phrase": "routing_calculations"}, {"score": 0.002382743797133398, "phrase": "simple_label_swapping_actions"}, {"score": 0.002304824112812496, "phrase": "unnecessary_cryptographic_operations"}, {"score": 0.002202651051682622, "phrase": "fairness_scheme"}, {"score": 0.002163058716517137, "phrase": "routing_tree"}, {"score": 0.002143529653780496, "phrase": "sensor_network"}, {"score": 0.0021049977753042253, "phrase": "packet_forwarding"}], "paper_keywords": ["Wireless sensor networks", " Routing", " Anonymity", " Location privacy", " Label switching"], "paper_abstract": "In a wireless sensor network (WSN), concealing the locations, and in some cases the identities of nodes, especially the controller (sometimes called sink or base station) is an important problem. In this paper, we explain that appropriate solutions for this problem depend on the nature of the traffic generated in the network as well as the capabilities of the adversary that must be resisted. When there is a sufficient amount of data flows (real or fake packets), our proposed DCARPS anonymous routing protocol can support location privacy against a global eavesdropper. Otherwise, it is only possible to stop packet tracing attacks by a local eavesdropper, which is what our probabilistic DCARPS protocol achieves. These protocols are based on label switching, which has not been used in this kind of network before. To enable DCARPS, we propose a new approach for network topology discovery that allows the sink to obtain a global view of the topology without revealing its own location, as opposed to what is common today in sensor networks. in order to resist traffic analysis attacks aiming at locating nodes, we have used layered cryptography to make a packet look randomly different on consecutive links. A stochastic security analysis of this protocol is provided. Another important issue in resource-constrained sensor networks is energy conservation. To this end, our protocols use only modest symmetric cryptography. Also, the sink is responsible for all routing calculations while the sensors only perform simple label swapping actions when forwarding packets. Another advantage of labels is preventing unnecessary cryptographic operations as will be seen in the manuscript. Furthermore, we have embedded a fairness scheme in the creation of the routing tree for the sensor network that distributes the burden of packet forwarding evenly. (C) 2008 Elsevier B.V. All rights reserved.", "paper_title": "Location privacy and anonymity preserving routing for wireless sensor networks", "paper_id": "WOS:000261629600010"}