{"auto_keywords": [{"score": 0.04525595118968157, "phrase": "inference_rules"}, {"score": 0.00481495049065317, "phrase": "multiple_representation_systems"}, {"score": 0.004737201825299411, "phrase": "heterogeneous_reasoning_systems"}, {"score": 0.004604136423327813, "phrase": "mathematical_representations"}, {"score": 0.004493045859210086, "phrase": "heterogeneous_systems_information"}, {"score": 0.004025258572860201, "phrase": "heterogeneous_representations"}, {"score": 0.0029053904956617043, "phrase": "biological_populations"}, {"score": 0.0028467558213723697, "phrase": "learning_successes"}, {"score": 0.002699769374493867, "phrase": "heterogeneous_systems"}, {"score": 0.0024781515864648242, "phrase": "real_incidents"}, {"score": 0.002359759876402679, "phrase": "homogeneous_theory"}, {"score": 0.00221063611719246, "phrase": "rich_naturalistic_data"}, {"score": 0.0021049977753042253, "phrase": "pre-existing_fully_interpreted_homogeneous_interlingua"}], "paper_keywords": ["reasoning", " heterogeneous representation", " modelling", " learning", " real-world problems", " mathematics", " science", " conceptual learning"], "paper_abstract": "Conceptual learning in mathematics and science involves learning to coordinate multiple representation systems into smoothly functioning heterogeneous reasoning systems composed of sub-languages, graphics, mathematical representations, etc. In these heterogeneous systems information can be transformed from one representation to another by inference rules, and learning coordination is learning how and when to apply these rules. The study of heterogeneous representations in learning has had the benefit of focusing attention on the reality of representation in the 'wild'. We propose that the concept of heterogeneity of representation should be extended from multimodal (e.g. diagrammatic plus language) systems to multiply interpreted systems, even when those systems are apparently homogeneously linguistic. We proceed by analysing, from the perspective of the heterogeneity of reasoning, three learning incidents which happened in groups of students engaged in learning the mathematics and biology involved in modelling biological populations. We observe both learning successes and failures that cannot be understood without understanding the integrations of heterogeneous systems of representation involved and the inference rules and operations required to get from one to another. The purpose of presenting real incidents in some of their undomesticated detail is that they show what phenomena a homogeneous theory of reasoning would really have to account for. We argue that this type of rich naturalistic data makes implausible the instrumentality of any reconstruction in terms of a pre-existing fully interpreted homogeneous interlingua.", "paper_title": "Heterogeneous reasoning in learning to model", "paper_id": "WOS:000239427300008"}