{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "information_sharing"}, {"score": 0.009721413251283166, "phrase": "supply_chain"}, {"score": 0.005368227963850061, "phrase": "different_levels"}, {"score": 0.0049962443871840205, "phrase": "different_degrees"}, {"score": 0.004239051185676412, "phrase": "two-level_supply_chains"}, {"score": 0.004184010117063648, "phrase": "single_product"}, {"score": 0.0041296807537109246, "phrase": "modern_supply_chains"}, {"score": 0.003731774879299358, "phrase": "supply-chain-wide_information_sharing"}, {"score": 0.003695356628334569, "phrase": "multi-level_supply_chain"}, {"score": 0.0036473491893281125, "phrase": "different_firms"}, {"score": 0.0034388914613623857, "phrase": "comprehensive_supply_chain"}, {"score": 0.003405321679000047, "phrase": "multiple_levels"}, {"score": 0.003295763459241421, "phrase": "multiple_products"}, {"score": 0.0030769941082173314, "phrase": "different_products"}, {"score": 0.0026557415971295633, "phrase": "substitutable_products"}, {"score": 0.0022920276083063947, "phrase": "significant_risk"}, {"score": 0.002189347748410919, "phrase": "demand_correlation"}, {"score": 0.002167949230651206, "phrase": "partial_information_sharing"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Information sharing", " Product substitution", " Supply chain collaboration"], "paper_abstract": "The literature on the value of information sharing within a supply chain is extensive. The bulk of the literature has focused on two-level supply chains that supply a single product. However, modern supply chains often have more than two levels and supply many products. Because many of these products are variants of the same base product, they tend to be substitutes and their demands correlated. Further, achieving supply-chain-wide information sharing in a multi-level supply chain is challenging because different firms may have different levels of incentives to share information. We analyze the value of information sharing using a comprehensive supply chain that has multiple levels, may have different degrees of information sharing, and supplies multiple products that may have different levels of substitutability and whose demands could be correlated to different degrees. Our analysis shows that substitution among the different products reduces the value of information sharing for all firms in the supply chain. The reduction is higher (i) for firms that are more upstream, (ii) when the degree of substitution is higher, (iii) when the number of substitutable products is higher, (iv) when the demands of products are more correlated, and (v) when the degree of information sharing is higher. Our results suggest that firms, especially those that are upstream in the supply chain, may face a significant risk of over-estimating the value of information sharing if they ignore substitution, demand correlation, and partial information sharing effects. (C) 2013 Published by Elsevier B.V.", "paper_title": "The value of information sharing in a multi-product, multi-level supply chain: Impact of product substitution, demand correlation, and partial information sharing", "paper_id": "WOS:000332442300010"}