{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "visual_variable"}, {"score": 0.0047155367844327, "phrase": "qualitative_uncertainty"}, {"score": 0.004522796947899013, "phrase": "user_studies"}, {"score": 0.004057596233938867, "phrase": "first_formal_evaluation"}, {"score": 0.00389164348807591, "phrase": "easier_reading"}, {"score": 0.003763763153640936, "phrase": "line_graphical_primitives"}, {"score": 0.003404703106153948, "phrase": "visual_impreciseness"}, {"score": 0.0033204052817782464, "phrase": "data_quality"}, {"score": 0.0032381878248821383, "phrase": "non-photorealistic_rendering"}, {"score": 0.0031579997262619758, "phrase": "hand-drawn_lines"}, {"score": 0.0031056437850836326, "phrase": "line_trajectories"}, {"score": 0.003066945490483524, "phrase": "hand-drawn_strokes"}, {"score": 0.0029291198314113608, "phrase": "adult_strokes"}, {"score": 0.002627407106087633, "phrase": "viable_alternative"}, {"score": 0.00223196703759329, "phrase": "design_considerations"}, {"score": 0.0021766418372878835, "phrase": "visual_variables"}, {"score": 0.0021049977753042253, "phrase": "line_marks"}], "paper_keywords": ["Uncertainty visualization", " qualitative evaluation", " quantitative evaluation", " perception"], "paper_abstract": "We report on results of a series of user studies on the perception of four visual variables that are commonly used in the literature to depict uncertainty. To the best of our knowledge, we provide the first formal evaluation of the use of these variables to facilitate an easier reading of uncertainty in visualizations that rely on line graphical primitives. In addition to blur, dashing and grayscale, we investigate the use of 'sketchiness' as a visual variable because it conveys visual impreciseness that may be associated with data quality. Inspired by work in non-photorealistic rendering and by the features of hand-drawn lines, we generate line trajectories that resemble hand-drawn strokes of various levels of proficiency-ranging from child to adult strokes-where the amount of perturbations in the line corresponds to the level of uncertainty in the data. Our results show that sketchiness is a viable alternative for the visualization of uncertainty in lines and is as intuitive as blur; although people subjectively prefer dashing style over blur, grayscale and sketchiness. We discuss advantages and limitations of each technique and conclude with design considerations on how to deploy these visual variables to effectively depict various levels of uncertainty for line marks.", "paper_title": "Evaluating Sketchiness as a Visual Variable for the Depiction of Qualitative Uncertainty", "paper_id": "WOS:000310143100082"}