{"auto_keywords": [{"score": 0.04958720442967608, "phrase": "distributed_systems"}, {"score": 0.04317179544664411, "phrase": "dynamic_programming"}, {"score": 0.03363896917055258, "phrase": "long_sequences"}, {"score": 0.00481495049065317, "phrase": "homology_search"}, {"score": 0.004716520738331953, "phrase": "alignment_problems"}, {"score": 0.004668059458774745, "phrase": "computational_biology"}, {"score": 0.004479120557712926, "phrase": "rapid_growth"}, {"score": 0.00443308765153716, "phrase": "sequence_databases"}, {"score": 0.003997891221012094, "phrase": "optimal_alignment"}, {"score": 0.0036052633308076933, "phrase": "compact_system"}, {"score": 0.003513264130359459, "phrase": "off-the-shelf_fpca_board"}, {"score": 0.0030396665931462, "phrase": "computation_method"}, {"score": 0.0029928611380840757, "phrase": "multidimensional_dynamic_programming"}, {"score": 0.0024842242921857705, "phrase": "longer_sequences"}, {"score": 0.002298649369775623, "phrase": "data_transfer_delay"}, {"score": 0.0021049977753042253, "phrase": "large_delays"}], "paper_keywords": [""], "paper_abstract": "Alignment problems in computational biology have been focused recently because of the rapid growth of sequence databases. By computing alignment, we can understand similarity among the sequences. Dynamic programming is a technique to find optimal alignment, but it requires very long computation time. We have shown that dynamic programming for more than two sequences can be efficiently processed on a compact system which consists of an off-the-shelf FPCA board and its host computer (node). The performance is, however, not enough for comparing long sequences. In this paper, we describe a computation method for the multidimensional dynamic programming on distributed systems. The method is now being tested using two nodes connected by Ethernet. According to our experiments, it is possible to achieve 5.1 times speedup with 16 nodes, and more speedup can be expected for comparing longer sequences using more Dumber of nodes. The performance is affected only a little by the data transfer delay when comparing long sequences. Therefore, our method can be mapped on any kinds of networks with large delays.", "paper_title": "Multidimensional dynamic programming for homology search on distributed systems", "paper_id": "WOS:000241469500102"}