{"auto_keywords": [{"score": 0.0457983124954283, "phrase": "induced_uncertain_linguistic_hybrid"}, {"score": 0.045171522171843934, "phrase": "shapley_choquet"}, {"score": 0.00481495049065317, "phrase": "linguistic_multi-attribute_group_decision"}, {"score": 0.00467855218490191, "phrase": "interactive_index"}, {"score": 0.0038256426589560774, "phrase": "fuzzy_measure"}, {"score": 0.0032190636347671675, "phrase": "weight_information"}, {"score": 0.0030609320300175953, "phrase": "optimal_fuzzy_measures"}, {"score": 0.0025938977569302177, "phrase": "multi-attribute_group_decision"}, {"score": 0.002538470301402269, "phrase": "uncertain_linguistic_environment"}, {"score": 0.0023791769068748194, "phrase": "interdependent_or_correlative_characteristics"}, {"score": 0.0022785613865764923, "phrase": "practical_application"}, {"score": 0.0021049977753042253, "phrase": "developed_procedure"}], "paper_keywords": ["group decision making", " uncertain linguistic variable", " Choquet integral", " fuzzy measure", " generalized Shapley function"], "paper_abstract": "In this paper, two uncertain linguistic Choquet aggregation operators called the induced uncertain linguistic hybrid generalized Shapley Choquet weighted averaging (IULHGSCWA) operator and the induced uncertain linguistic hybrid generalized Shapley Choquet geometric mean (IULHGSCGM) operator are defined. To reduce the complexity of solving a fuzzy measure, the induced uncertain linguistic hybrid 2-additive generalized Shapley Choquet weighted averaging (IULHAGSCWA) operator and the induced uncertain linguistic hybrid 2-additive generalized Shapley Choquet geometric mean (IULHAGSCGM) operator are presented. When the weight information is incompletely known, models for the optimal fuzzy measures on an expert set, on an attribute set and on their ordered sets are built, respectively. Furthermore, an approach to multi-attribute group decision making under uncertain linguistic environment is developed, which can cope with the interdependent or correlative characteristics between elements. Finally, practical application is selected to illustrate the validity and practicability of the developed procedure.", "paper_title": "An Approach to Uncertain Linguistic Multi-Attribute Group Decision Making Based on Interactive Index", "paper_id": "WOS:000355928500001"}