{"auto_keywords": [{"score": 0.04871307788863083, "phrase": "space_environment"}, {"score": 0.038798461132390834, "phrase": "igrf"}, {"score": 0.01412772093638192, "phrase": "reference_frame"}, {"score": 0.012928928989018911, "phrase": "magnetic_fields"}, {"score": 0.009955275314400167, "phrase": "distributed_program"}, {"score": 0.009877407275176346, "phrase": "test_data"}, {"score": 0.008642288890031817, "phrase": "iri"}, {"score": 0.00481495049065317, "phrase": "low_earth_orbit_spacecraft-plasma_interaction"}, {"score": 0.004592214823540993, "phrase": "space_missions"}, {"score": 0.004177049813981273, "phrase": "electrostatic_sheaths"}, {"score": 0.0039006600544599537, "phrase": "space_plasma"}, {"score": 0.003839510177926892, "phrase": "low_earth_orbits"}, {"score": 0.0036617315529835497, "phrase": "plasma_parameters"}, {"score": 0.0035477930970463432, "phrase": "spacecraft_frame"}, {"score": 0.0033225746828031803, "phrase": "program"}, {"score": 0.0032954888655173666, "phrase": "leorbit_catalogue"}, {"score": 0.0031929098985796814, "phrase": "cpc_program_library"}, {"score": 0.0031761255583359726, "phrase": "queen's_university"}, {"score": 0.003159429404595016, "phrase": "belfast"}, {"score": 0.0031428202743657057, "phrase": "n._ireland"}, {"score": 0.0031098631445657158, "phrase": "standard_cpc"}, {"score": 0.0028357972357118118, "phrase": "tar.gz_programming_language"}, {"score": 0.002395437787820304, "phrase": "low_earth_orbit_satellite"}, {"score": 0.0023640560785711923, "phrase": "orbit_integration"}, {"score": 0.002272350626011176, "phrase": "spacecraft_frame_reference"}, {"score": 0.0022433793958083715, "phrase": "earth"}, {"score": 0.002132947962296264, "phrase": "full_orbit"}], "paper_keywords": ["Low Earth Orbit", " Satellite", " Earth magnetic field", " Ionospheric plasma"], "paper_abstract": "Understanding the physics of interaction between satellites and the space environment is essential in planning and exploiting space missions. Several computer models have been developed over the years to study this interaction. In all cases, simulations are carried out in the reference frame of the spacecraft and effects such as charging, the formation of electrostatic sheaths and wakes are calculated for given conditions of the space environment. In this paper we present a program used to compute magnetic fields and a number of space plasma and space environment parameters relevant to Low Earth Orbits (LEO) spacecraft plasma interaction modeling. Magnetic fields are obtained from the International Geophysical Reference Field (IGRF) and plasma parameters are obtained from the International Reference Ionosphere (IRI) model. All parameters are computed in the spacecraft frame of reference as a function of its six Keplerian elements. They are presented in a format that can be used directly in most spacecraft plasma interaction models. Program summary Program title: LEOrbit Catalogue identifier: AENY_v1_0 Program summary URL: http://cpc.cs.qub.ac.uk/summaries/AENY_v1_0.html Program obtainable from: CPC Program Library, Queen's University, Belfast, N. Ireland Licensing provisions: Standard CPC licence, http://cpc.cs.qub.ac.uk/licence/licence.html No. of lines in distributed program, including test data, etc.: 270308 No. of bytes in distributed program, including test data, etc.: 2323222 Distribution format: tar.gz Programming language: FORTRAN 90. Computer: Non specific. Operating system: Non specific. RAM: 7.1 MB Classification: 19, 4.14. External routines: IRI, IGRF (included in the package). Nature of problem: Compute magnetic field components, direction of the sun, sun visibility factor and approximate plasma parameters in the reference frame of a Low Earth Orbit satellite. Solution method: Orbit integration, calls to IGRF and IRI libraries and transformation of coordinates from geocentric to spacecraft frame reference. Restrictions: Low Earth orbits, altitudes between 150 and 2000 km. Running time: Approximately two seconds to parameterize a full orbit with 1000 points. (c) 2012 Elsevier B.V. All rights reserved.", "paper_title": "LEOrbit: A program to calculate parameters relevant to modeling Low Earth Orbit spacecraft-plasma interaction", "paper_id": "WOS:000315125500042"}