{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "conflicting_objectives"}, {"score": 0.043813468699474674, "phrase": "grid_users"}, {"score": 0.042425022430386206, "phrase": "grid_system"}, {"score": 0.004761494044422926, "phrase": "grid_environments"}, {"score": 0.004330321475256457, "phrase": "grid_environment"}, {"score": 0.004118026552723285, "phrase": "grid_resources"}, {"score": 0.0037449033166879874, "phrase": "desired_level"}, {"score": 0.003561205990687285, "phrase": "resource_providers"}, {"score": 0.003348838095597268, "phrase": "market_strategies"}, {"score": 0.0031140747752837826, "phrase": "grid_resource_provider"}, {"score": 0.002977835845437357, "phrase": "grid_user"}, {"score": 0.0026626797255348287, "phrase": "joint_optimization"}, {"score": 0.00244834685428352, "phrase": "resource_provider_objective_optimization_and_user_objective_optimization"}, {"score": 0.0022261705957258506, "phrase": "efficiency_metrics"}, {"score": 0.0022013916728990564, "phrase": "utility_metrics"}, {"score": 0.002176887956041267, "phrase": "time_metrics"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Grid", " Scheduling model", " Evaluation"], "paper_abstract": "The paper is to consider resource scheduling with conflicting objectives in the grid environment. The objectives of the grid users, the grid resources and the grid system clash with each other. Grid users want to access enough system resources to achieve the desired level of quality of service (QoS). Resource providers pay more attention to the performance of their resources. Our resource scheduling employs market strategies to determine which jobs are executed at what time on which resources and at what prices. A grid resource provider uses its utility function to maximize its profit and a grid user uses its utility function to complete tasks while minimizing its spending. The paper proposes grid system objective optimization scheduling that provides a joint optimization of objectives for both the resource provider and grid user, which combines the benefits of both resource provider objective optimization and user objective optimization. Experiments are designed to study the performances of three resource-scheduling optimization algorithms. Performance metrics are classified into efficiency metrics, utility metrics and time metrics. (C) 2008 Elsevier Ltd. All rights reserved.", "paper_title": "Resource scheduling with conflicting objectives in grid environments: Model and evaluation", "paper_id": "WOS:000266947800023"}