{"auto_keywords": [{"score": 0.03863573199265334, "phrase": "grid"}, {"score": 0.015716077089477153, "phrase": "optical_grid_dimensioning"}, {"score": 0.004739056045644449, "phrase": "traditional_optical_network_dimensioning"}, {"score": 0.004447201233380302, "phrase": "network_resources"}, {"score": 0.003916098498242888, "phrase": "anycast_principle"}, {"score": 0.00385431710959668, "phrase": "grid_users"}, {"score": 0.003322540556404882, "phrase": "traditional_dimensioning_algorithms"}, {"score": 0.0031342307827666675, "phrase": "mean_field_calculation_method"}, {"score": 0.0030521898646210413, "phrase": "traffic_matrix"}, {"score": 0.0029722900280316216, "phrase": "originating_grid_sites"}, {"score": 0.0027303606813078255, "phrase": "stepwise_dimensioning_approach"}, {"score": 0.0021501863832966966, "phrase": "server_sites"}, {"score": 0.0021049977753042253, "phrase": "grid_jobs"}], "paper_keywords": ["Dimensioning", " Mean field calculation"], "paper_abstract": "For traditional optical network dimensioning, a plethora of algorithms exists to design the amount of network resources required to accommodate a given amount of traffic, expressed as a (source, destination)-based traffic matrix. In optical Grid dimensioning, however, the anycast principle applies: Grid users do not really care where exactly their tasks (Grid jobs) end up being executed. Thus, the destination of traffic is not known beforehand and traditional dimensioning algorithms are not applicable. In this paper we propose a mean field calculation method to analytically derive the traffic matrix for given job arrival intensities at the originating Grid sites (the sources). We also indicate how it can be integrated in a stepwise dimensioning approach to compute not only the amount of network resources, but also Grid resources (computational and/or storage). Hence it forms part of a solution for Grid dimensioning: determining how many servers to provide, where to place them, and which network to install for interconnecting server sites and users generating Grid jobs.", "paper_title": "Mean Field Calculation for Optical Grid Dimensioning", "paper_id": "WOS:000278117800005"}