{"auto_keywords": [{"score": 0.004703878334423852, "phrase": "functionally_based_implicit_surfaces"}, {"score": 0.004406260054779782, "phrase": "unique_ability"}, {"score": 0.0040890178236849825, "phrase": "implicit_surfaces"}, {"score": 0.0037768417338850274, "phrase": "field_functions"}, {"score": 0.003587616378156851, "phrase": "generic_solution"}, {"score": 0.0035211747962710276, "phrase": "functionally-based_implicit_surfaces"}, {"score": 0.002853124436286834, "phrase": "automatically_defined_blending_regions"}, {"score": 0.0028133741785871867, "phrase": "intersection_curves"}, {"score": 0.002684819249720834, "phrase": "clean_union"}, {"score": 0.0025741370320813968, "phrase": "new_operator"}, {"score": 0.0024912073108138613, "phrase": "resulting_field_function"}, {"score": 0.0024336086025284836, "phrase": "smooth_blend"}, {"score": 0.00237733844863506, "phrase": "blending_regions"}, {"score": 0.0022580713471027996, "phrase": "small_objects"}, {"score": 0.002185301851004467, "phrase": "larger_ones"}, {"score": 0.0021247934141234988, "phrase": "progressive_blend"}], "paper_keywords": [""], "paper_abstract": "Blending is both the strength and the weakness of functionally based implicit surfaces (such as F-reps or soft-objects). While it gives them the unique ability to smoothly merge into a single, arbitrary shape, it makes implicit modelling hard to control since implicit surfaces blend at a distance, in a way that heavily depends on the slope of the field functions that define them. This paper presents a novel, generic solution to blending of functionally-based implicit surfaces: the insight is that to be intuitive and easy to control, blends should be located where two objects overlap, while enabling other parts of the objects to come as close to each other as desired without being deformed. Our solution relies on automatically defined blending regions around the intersection curves between two objects. Outside of these volumes, a clean union of the objects is computed thanks to a new operator that guarantees the smoothness of the resulting field function; meanwhile, a smooth blend is generated inside the blending regions. Parameters can automatically be tuned in order to prevent small objects from blurring out when blended into larger ones, and to generate a progressive blend when two animated objects come in contact.", "paper_title": "Implicit Blending Revisited", "paper_id": "WOS:000278182500013"}