{"auto_keywords": [{"score": 0.0041316803676012155, "phrase": "single_subfield"}, {"score": 0.0038271712887391015, "phrase": "fractional_strategy"}, {"score": 0.0036740168936985314, "phrase": "empirical_part"}, {"score": 0.003636692152882991, "phrase": "different_aspects"}, {"score": 0.0035997452281985465, "phrase": "citation_distributions"}, {"score": 0.0030726480920918097, "phrase": "scale-invariant_indicators"}, {"score": 0.0030414140732789186, "phrase": "high_and_low_impact"}, {"score": 0.002949598537993663, "phrase": "extreme_distributions"}, {"score": 0.002676692093594358, "phrase": "large_differences"}, {"score": 0.002479150189700726, "phrase": "citation_characteristics"}, {"score": 0.0022382002476510573, "phrase": "radically_different_picture"}, {"score": 0.0022154296909169826, "phrase": "practical_applications"}, {"score": 0.0021375377706211686, "phrase": "citation_excellence"}, {"score": 0.0021049977753042253, "phrase": "high-impact_indicator"}], "paper_keywords": ["bibliographic citations"], "paper_abstract": "In many data sets, articles are classified into subfields through the journals in which they have been published. The problem is that while many journals are assigned to a single subfield, many others are assigned to several. This article discusses a multiplicative and a fractional strategy to deal with this situation. The empirical part studies different aspects of citation distributions under the two strategies, namely: the number of articles, the mean citation rate, the broad shape of the distribution, their characterization in terms of size- and scale-invariant indicators of high and low impact, and the presence of extreme distributions, that is, distributions that behave very differently from the rest. We found that, despite large differences in the number of articles according to both strategies, the similarity of the citation characteristics of articles published in journals assigned to one or several subfields guarantees that choosing one of the two strategies may not lead to a radically different picture in practical applications. Nevertheless, the characterization of citation excellence through a high-impact indicator may considerably differ depending on that choice.", "paper_title": "Multiplicative and fractional strategies when journals are assigned to several subfields", "paper_id": "WOS:000310550000007"}