{"auto_keywords": [{"score": 0.03549931087351772, "phrase": "alert_severity"}, {"score": 0.011163105122778804, "phrase": "patient-related_factors"}, {"score": 0.00481495049065317, "phrase": "potential_impact"}, {"score": 0.004785356349906913, "phrase": "drug_interaction_alert_burden"}, {"score": 0.004583205112737672, "phrase": "prescribing_quality"}, {"score": 0.0044991925146184025, "phrase": "poor_user_acceptance"}, {"score": 0.004269391057037737, "phrase": "poor_alert_specificity"}, {"score": 0.004230068512904886, "phrase": "prominent_reason"}, {"score": 0.003989266720020083, "phrase": "alert_specificity"}, {"score": 0.0039281997063335735, "phrase": "alert_burden"}, {"score": 0.003832423454781517, "phrase": "optimizing_strategies"}, {"score": 0.0036590692974951718, "phrase": "critical_and_frequent_drug_interaction"}, {"score": 0.003569831390151506, "phrase": "ddi_alerts"}, {"score": 0.0030497740719977835, "phrase": "relevant_factors"}, {"score": 0.0029937855454238507, "phrase": "today's_patient_charts"}, {"score": 0.0029027394930867902, "phrase": "vast_majority"}, {"score": 0.0022117133940361025, "phrase": "decrease_alert_burden"}, {"score": 0.0021710766932077972, "phrase": "knowledge_bases"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ireland_ltd."}], "paper_keywords": ["Clinical decision support systems", " Drug-drug interactions", " Alert fatigue", " Alert specificity"], "paper_abstract": "Purpose: Clinical decision support systems (CDSS) may potentially improve prescribing quality, but are subject to poor user acceptance. Reasons for alert overriding have been identified and counterstrategies have been suggested; however, poor alert specificity, a prominent reason of alert overriding, has not been well addressed. This paper aims at structuring modulators that determine alert specificity and estimating their quantitative impact on alert burden. Methods: We developed and summarized optimizing strategies to guarantee the specificity of alerts and applied them to a set of 100 critical and frequent drug interaction (DDI) alerts. Hence, DDI alerts were classified as dynamic, i.e. potentially sensitive to prescription-, co-medication-, or patient-related factors that would change alert severity or render the alert inappropriate compared to static, i.e. always applicable alerts not modulated by cofactors. Results: Within the subset of 100 critical DDI alerts, only 10 alerts were considered as static and for 7 alerts, relevant factors are not generally available in today's patient charts or their consideration would not impact alert severity. The vast majority, i.e. 83 alerts, might require a decrease in alert severity due to factors related to the prescription (N = 13), the co-medication (N = 11), individual patient data (N = 36), or combinations of them (N = 23). Patient-related factors consisted mainly of three lab values, i.e. renal function, potassium, and therapeutic drug monitoring results. Conclusion: This paper outlines how promising the refinement of knowledge bases is in order to increase specificity and decrease alert burden and suggests how to structure knowledge bases to refine DDI alerting. (C) 2014 Elsevier Ireland Ltd. All rights reserved.", "paper_title": "What, if all alerts were specific - Estimating the potential impact on drug interaction alert burden", "paper_id": "WOS:000332397200006"}