{"auto_keywords": [{"score": 0.04915747964534472, "phrase": "structure-based_virtual_screening"}, {"score": 0.00481495049065317, "phrase": "novel_type-i_inhibitors"}, {"score": 0.004586531354697466, "phrase": "vitro_models"}, {"score": 0.00436890075128947, "phrase": "second_vascular_signaling_system"}, {"score": 0.004061584718427419, "phrase": "numerous_life-threatening_diseases"}, {"score": 0.003964007795174772, "phrase": "attractive_potential_therapeutic_target"}, {"score": 0.003775803846431323, "phrase": "clinical_phase"}, {"score": 0.003631671435460452, "phrase": "selective_small-molecule_inhibitors"}, {"score": 0.003459191419478298, "phrase": "present_work"}, {"score": 0.0029458777184930896, "phrase": "vitro_enzymatic_activity_assay"}, {"score": 0.0026209522797963447, "phrase": "substructure_searching_strategy"}, {"score": 0.0023091721866305426, "phrase": "novel_inhibitors"}, {"score": 0.0021780349459687622, "phrase": "active_core_scaffolds"}, {"score": 0.002125612498781805, "phrase": "starting_points"}], "paper_keywords": [""], "paper_abstract": "Angiopoietin (ANG) ligands and their downstream TIE receptors have been validated as the second vascular signaling system involving vessel remodeling and maturation. Among them, the ANG/TIE-2 signaling pathway is involved in numerous life-threatening diseases and has become an attractive potential therapeutic target. Several large-molecule inhibitors targeting the ANG/TIE-2 axis have recently entered clinical phase for the therapy of various solid tumors, but selective small-molecule inhibitors of TIE-2 are still quite limited. In the present work, structure-based virtual screening was performed to search for type-I inhibitors of TIE-2. Of the only 41 compounds selected by our strategy, 8 molecules with the concentration of 25 mu g/mL exhibit over 50% inhibitory rate against TIE-2 in in vitro enzymatic activity assay, and the IC50 values of 2 hits are lower than 1 mu M. Further optimization and SAR analysis based on compound TP-S1-30 and 31 were carried out by using substructure searching strategy, leading to the discovery of several sub-100 nM inhibitors. Among them, the most potent compound, TP-S1-68, showed an inhibitory IC50 of 0.149 mu M. These novel inhibitors of TIE-2 discovered in this study and the analogs of the active core scaffolds can serve as the starting points for further drug development.", "paper_title": "Identification and Preliminary SAR Analysis of Novel Type-I Inhibitors of TIE-2 via Structure-Based Virtual Screening and Biological Evaluation in in vitro Models", "paper_id": "WOS:000367560200020"}