{"auto_keywords": [{"score": 0.0461799826411411, "phrase": "free_will"}, {"score": 0.010915567345085727, "phrase": "consequentialist_reforms"}, {"score": 0.008224199493308682, "phrase": "greene"}, {"score": 0.00481495049065317, "phrase": "widely_read_essay"}, {"score": 0.0047873664213105675, "phrase": "cohen"}, {"score": 0.004743560130935175, "phrase": "law"}, {"score": 0.004714023408114857, "phrase": "neuroscience_changes_nothing"}, {"score": 0.0046432244185370605, "phrase": "joshua_greene"}, {"score": 0.004615202066192795, "phrase": "jonathan_cohen"}, {"score": 0.004450568197899267, "phrase": "widespread_rejection"}, {"score": 0.003160466312198169, "phrase": "cohen's_essay"}, {"score": 0.0030661003993462665, "phrase": "neurodeterministic_anti-free-willism"}, {"score": 0.0028857130140890787, "phrase": "untenable_homuncular_account"}, {"score": 0.0026508118618120114, "phrase": "overly_simple_account"}, {"score": 0.002405618568415162, "phrase": "neuroscience-driven_rejection"}, {"score": 0.0023125950237602518, "phrase": "familiar_feature"}, {"score": 0.002298605785178457, "phrase": "moral_progress"}, {"score": 0.0022777800735119405, "phrase": "expanding_circle"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Free will", " Neurodeterminism", " Legal responsibility", " Retributivism", " Brain overclaim syndrome", " Josh Greene", " Jonathan Cohen"], "paper_abstract": "In a widely read essay, \"For the Law, Neuroscience Changes Nothing and Everything,\" Joshua Greene and Jonathan Cohen argue that the advance of neuroscience will eventually result in the widespread rejection of free will, and with it - of retributivism. They go on to propose that consequentialist reforms are in order, and they predict such reforms will take place. We agree that retributivism should be rejected, and we too are optimistic that rejected it will be. But we don't think that such a development will have much to do with neuroscience - it won't, because neuroscience is unlikely to show that we have no free will. We have two main aims in this paper. The first is to rebut various aspects of the case against free will. The second is to examine the case for consequentialist reforms. We take Greene and Cohen's essay as a hobbyhorse, but our criticisms are applicable to neurodeterministic anti-free-willism in general. We first suggest that Greene and Cohen take proponents of free will to be committed to an untenable homuncular account of agency. But proponents of free will can dispense with such a commitment. In fact, we argue, it is Greene and Cohen who work with an overly simple account of free will. We sketch a more nuanced conception. We then turn to the proposal for consequentialist reforms. We argue that retributivism will fall out of favor not as a consequence of neuroscience-driven rejection of free will, but rather, as a result of a familiar feature of moral progress - the expanding circle of concern. In short, retributivism can and must die, but neuroscience will not kill it humanity will. (C) 2015 Elsevier B.V. All rights reserved.", "paper_title": "Will retributivism die and will neuroscience kill it?", "paper_id": "WOS:000365045400006"}