{"auto_keywords": [{"score": 0.04729673582544897, "phrase": "fault_injection"}, {"score": 0.01183265452296168, "phrase": "system_virtualization"}, {"score": 0.01045049028692126, "phrase": "virtualized_systems"}, {"score": 0.007552585438726981, "phrase": "target_system"}, {"score": 0.00481495049065317, "phrase": "virtualized_systems-challenges"}, {"score": 0.004318881178805575, "phrase": "non-virtualized_systems"}, {"score": 0.0034742854447532678, "phrase": "experimental_evaluation"}, {"score": 0.0033810134162565843, "phrase": "test_platform"}, {"score": 0.003290237137651949, "phrase": "gigan_fault_injector"}, {"score": 0.0031329184724341592, "phrase": "xen_virtual_machine_monitor"}, {"score": 0.002999386721353559, "phrase": "fault_injection_results"}, {"score": 0.0028715299874549245, "phrase": "virtual_machine"}, {"score": 0.0027491084541806823, "phrase": "bare_hardware"}, {"score": 0.00251966141432339, "phrase": "hosting_hypervisor"}, {"score": 0.0024519545383399773, "phrase": "performance_benefits"}, {"score": 0.0021049977753042253, "phrase": "gigan"}], "paper_keywords": ["Fault injection", " virtualization", " hypervisors", " reliability"], "paper_abstract": "We analyze the interaction between system virtualization and fault injection: (i) use of virtualization to facilitate fault injection into non-virtualized systems, and (ii) use of fault injection to evaluate the dependability of virtualized systems. We explore the benefits of using virtualization for fault injection and discuss the challenges of implementing fault injection in virtualized systems along with resolutions to those challenges. For experimental evaluation, we use a test platform that consists of the Gigan fault injector, that we have developed, with the Xen virtual machine monitor. We evaluate the degree to which fault injection results obtained from running the target system in a virtual machine are comparable to running the target system on bare hardware. We compare results when injection is done from within the target system versus from the hosting hypervisor. We evaluate the performance benefits of leveraging system virtualization for fault injection. Finally, we demonstrate the capabilities of our injector and highlight the benefits of leveraging system virtualization for fault injection by describing deployments of Gigan to evaluate both non-virtualized and virtualized systems.", "paper_title": "Fault Injection in Virtualized Systems-Challenges and Applications", "paper_id": "WOS:000354468900003"}