{"auto_keywords": [{"score": 0.027907344493368853, "phrase": "proposed_architecture"}, {"score": 0.008944694194975124, "phrase": "hardware_cost"}, {"score": 0.00481496407807574, "phrase": "vlsi"}, {"score": 0.004606479650820579, "phrase": "optimized_truncation"}, {"score": 0.004390776071238151, "phrase": "mq"}, {"score": 0.003930581102447622, "phrase": "high_throughput_mq_coder_architecture"}, {"score": 0.0036105923401756126, "phrase": "byte_emission"}, {"score": 0.003069006373093756, "phrase": "new_mq_coder_architecture"}, {"score": 0.0029576827451501956, "phrase": "clock_cycle"}, {"score": 0.002706659627293686, "phrase": "synchronous_shifters"}, {"score": 0.0026570998719084153, "phrase": "hard_shifters"}, {"score": 0.0025892330566358503, "phrase": "stratix_fpga"}, {"score": 0.0025045102029373854, "phrase": "memory_requirement"}, {"score": 0.002343271162668978, "phrase": "relative_figure"}, {"score": 0.0022749744354271816, "phrase": "overall_efficiency"}, {"score": 0.002192389791199368, "phrase": "good_balance"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["JPEG 2000", " Embedded block coding with optimized truncation (EBCOT)", " MQ coder", " VLSI architecture", " Field programmable gate array (FPGA)"], "paper_abstract": "The embedded block coding with optimized truncation (EBCOT) algorithm is the heart of the JPEG 2000 image compression system. The MQ coder used in this algorithm restricts throughput of the EBCOT because there is very high correlation among all procedures to be performed in it. To overcome this obstacle, a high throughput MQ coder architecture is presented in this paper. To accomplish this, we have studied the number of rotations performed and the rate of byte emission in an image. This study reveals that in an image, on an average 75.03% and 22.72% of time one and two shifts occur, respectively. Similarly, about 5.5% of time two bytes are emitted concurrently. Based on these facts, a new MQ coder architecture is proposed which is capable of consuming one symbol per clock cycle. The throughput of this coder is improved by operating the renormalization and byte out stages concurrently. To reduce the hardware cost, synchronous shifters are used instead of hard shifters. The proposed architecture is implemented on Stratix FPGA and is capable of operating at 145.9 MHz. Memory requirement of the proposed architecture is reduced by a minimum of 66% compared to those of the other existing architectures. Relative figure of merit is computed to compare the overall efficiency of all architectures which show that the proposed architecture provides good balance between the throughput and hardware cost. (C) 2011 Elsevier B.V. All rights reserved.", "paper_title": "VLSI design of memory-efficient, high-speed baseline MQ coder for JPEG 2000", "paper_id": "WOS:000298272000001"}