{"auto_keywords": [{"score": 0.0497141445691543, "phrase": "collaborative_learning"}, {"score": 0.011259759917258113, "phrase": "group_diagram"}, {"score": 0.00481495049065317, "phrase": "diagram-based_support"}, {"score": 0.004741845603430361, "phrase": "mathematical_exercise"}, {"score": 0.004443276312972159, "phrase": "common_exercises"}, {"score": 0.003711723285313348, "phrase": "active_discussion"}, {"score": 0.0035722806911457545, "phrase": "mathematical_concepts"}, {"score": 0.0034777887763821425, "phrase": "learner_diagrams"}, {"score": 0.003221316290858497, "phrase": "different_learners"}, {"score": 0.0030414140732789186, "phrase": "remarkable_relations"}, {"score": 0.0026393362602995254, "phrase": "supplementary_figures"}, {"score": 0.0024258721867522707, "phrase": "experimental_results"}, {"score": 0.0023889533502525527, "phrase": "generated_hints"}], "paper_keywords": ["collaborative learning", " problem-based learning", " knowledge acquisition", " rule-based processing", " diagram support", " predicate-formed representation"], "paper_abstract": "This paper focuses on the collaborative learning of mathematics in which learners effectively acquire knowledge of common exercises through discussion with other learners. During collaborative learning, learners sometimes cannot solve exercises successfully, because they cannot derive answers by themselves or they hesitate to propose answers through discussion. To cope with such situations, this paper proposes two support functions using diagrams to encourage active discussion, since diagrams are often used to graphically illustrate mathematical concepts. One function indicates the differences between learner diagrams and the group diagram in order to encourage participation in discussions. To compare the characteristics of diagrams drawn by different learners, internal representation of the diagram, which consists of types of figures and remarkable relations to other figures, is introduced. The other function provides hints in the group diagram so that all learners can consider their answers collaboratively through discussions. Since preparing hints for all exercises is difficult, rules for drawing supplementary figures, which are general methods for drawing supplementary figures that correspond to individual answering methods/formulas, are also developed. By applying available rules to current group diagram, appropriate supplementary figures that can solve current learning situations may be generated. The experimental results showed that the generated hints successfully increased the number of utterances in the groups. Moreover, learners were also able to derive answers by themselves and tended to propose more opinions in discussions when the uniqueness of their diagrams was indicated.", "paper_title": "Diagram-Based Support for Collaborative Learning in Mathematical Exercise", "paper_id": "WOS:000265703000007"}