{"auto_keywords": [{"score": 0.042536641598900825, "phrase": "pda"}, {"score": 0.03435160815935826, "phrase": "early_adopters"}, {"score": 0.00481495049065317, "phrase": "prescriber_attitudes"}, {"score": 0.004790533585352095, "phrase": "pda_prescription-assistive_technology"}, {"score": 0.004646598460957092, "phrase": "u.s._healthcare_system"}, {"score": 0.004404994123834589, "phrase": "attitudinal_barriers"}, {"score": 0.004229345958909993, "phrase": "frontline_prescriber_clinicians"}, {"score": 0.0040298010803060495, "phrase": "clinical_setting"}, {"score": 0.00400934967455433, "phrase": "medication_prescribing"}, {"score": 0.0037910942524988, "phrase": "academic_tertiary_care_children's_hospital"}, {"score": 0.0036491106734356797, "phrase": "pediatric-specific_medication_prescribing_information"}, {"score": 0.003602970173264847, "phrase": "on-line_medication_safety_certification"}, {"score": 0.003557411005005516, "phrase": "educational_sessions"}, {"score": 0.0033551226002242365, "phrase": "medical_settings"}, {"score": 0.0033295966773779174, "phrase": "self-reported_usage"}, {"score": 0.0031723676499081374, "phrase": "group_membership"}, {"score": 0.0029092568512822966, "phrase": "significantly_more_favorable_attitudes"}, {"score": 0.002836096284133166, "phrase": "-intervention_survey_occasions"}, {"score": 0.0027228364802094965, "phrase": "pda_use"}, {"score": 0.002640861989913901, "phrase": "later_adopters"}, {"score": 0.0025744334586119367, "phrase": "care_information"}, {"score": 0.0024155634012715745, "phrase": "significant_change"}, {"score": 0.0023789133322920384, "phrase": "initially_less_favorable_attitudes"}, {"score": 0.0023131563566384738, "phrase": "late_adopters"}, {"score": 0.0022722584151582616, "phrase": "respective_needs"}, {"score": 0.0022492129111567824, "phrase": "potentially_beneficial_technologies"}, {"score": 0.002164850187776874, "phrase": "training_and_supportive_interventions"}, {"score": 0.0021049977753042253, "phrase": "personality-based_outcome_expectations"}], "paper_keywords": ["Prescription-assistive technology", " Prescriber behavior", " Physician technology adoption", " Patient safety", " Medication safety"], "paper_abstract": "Context: Medication error prevention is a priority for the U.S. healthcare system in the 21st century. Use of technology is considered by some as critical to achieve this goal. Knowledge of the attitudinal barriers to such adoption, however, is limited. Objective: To determine the attitudes of frontline prescriber clinicians towards technology in general, and PDAs specifically, before and after introduction of a PDA in the clinical setting of medication prescribing. Design: A pre- and post-intervention web-based survey, 12-14 months apart. Setting: Academic tertiary care children's hospital. Participants: Total of 244 prescriber clinicians. Intervention: Distribution of a PDA with pediatric-specific medication prescribing information after completion of an on-line medication safety certification and other safety focused educational sessions. Main outcome measures: Ratings (5-point Likert scale) reflecting perceptions and attitudes towards technology in general and technology in medical settings along with self-reported usage of the PDA for Rx. Results: Early Adopters and Late Adopters were identified statistically, and the group membership reflected their prior exposure to and ownership of other technologies. Early Adopters tended to be younger and less experienced clinically (e.g., residents) and more frequent owners and users of technology. Early Adopters expressed significantly more favorable attitudes toward technology and PDAs on both pre- to post-intervention survey occasions. They also utilized the PDA for Rx more often than LAs. Interestingly, PDA use for Early Adopters was based on its ease of use, while PDA use among later adopters was based on its clinical usefulness. Provision of point of care information using PDAs and a user-friendly, pediatric-specific medication information software package did not positively affect the attitudes of prescriber clinicians among those already favorable toward technology. However, a significant change was found among those with initially less favorable attitudes. organizations need to understand the nature of both Early and Late Adopters and plan appropriately for managing the respective needs and expectations when potentially beneficial technologies are introduced. In order to ensure the success of an implementation, the training and supportive interventions need to be carefully designed and specifically catered to the personality-based outcome expectations of the prescriber. (C) 2008 Elsevier Ireland Ltd. All rights reserved.", "paper_title": "Patterns and changes in prescriber attitudes toward PDA prescription-assistive technology", "paper_id": "WOS:000265542400004"}