{"auto_keywords": [{"score": 0.03617487366358446, "phrase": "demand_volatility"}, {"score": 0.004731754442072492, "phrase": "new_service_science_approaches"}, {"score": 0.00464998919563789, "phrase": "information_technology"}, {"score": 0.004413036532585712, "phrase": "business_area"}, {"score": 0.004321656690200878, "phrase": "service-level_agreement_contract_flexibility"}, {"score": 0.004232160987948483, "phrase": "technological_and_business_market_environments"}, {"score": 0.004058668702112495, "phrase": "related_changes"}, {"score": 0.004016413965935386, "phrase": "cost_drivers"}, {"score": 0.0038651944848734133, "phrase": "well-known_methods"}, {"score": 0.003798346343693706, "phrase": "real_option_pricing_method"}, {"score": 0.0037587915908689497, "phrase": "contingent_claims_analysis_method"}, {"score": 0.0034931650881768286, "phrase": "prenegotiated_it_services_contract"}, {"score": 0.00290304212971385, "phrase": "important_foundational_thinking"}, {"score": 0.0026325577905633494, "phrase": "exercise_timing"}, {"score": 0.0025510720021028107, "phrase": "client_firm's_demand_trigger_value"}, {"score": 0.002370589610989257, "phrase": "usage-based_fees"}, {"score": 0.0021271863804595108, "phrase": "backsourcing_flexibility_option"}], "paper_keywords": ["contingent claims analysis", " demand trigger value", " demand uncertainty", " financial economics", " IT services", " outsourcing", " real options", " service science", " valuation", " vendors", " volatility"], "paper_abstract": "The emergence of new service science approaches to business problems in information technology (IT) services offers new, unusually relevant insights for the senior management of vendors in this business area. This research examines how service-level agreement contract flexibility should be designed when the technological and business market environments result in volatility of demand, based on an understanding of related changes in the cost drivers that underlie IT services contracts. Our approach draws on a blend of well-known methods from financial economics the real option pricing method and the contingent claims analysis method. In particular, our research examines a setting in which a vendor provides IT services to a client according to a prenegotiated IT services contract in the presence of demand volatility. We analyze the motivation of and value consequences for a vendor that offers the client the flexibility to opt out of the contract. For example, the client might switch to another vendor, or backsource and provide its own services internally. Our core results offer important foundational thinking for how to specify various forms of IT service-related flexibility in terms of put and call options from the point of view of an IT services vendor, so that their value and exercise timing can be estimated. We show that the client firm's demand trigger value for deciding when to backsource its IT services varies, and it depends on the degree of demand volatility as well as the usage-based fees charged by the vendor. Working from our modeling approach, we also are able to characterize the extent to which a vendor can benefit from bearing the costs of making a backsourcing flexibility option available to its client.", "paper_title": "Should We Go Our Own Way? Backsourcing Flexibility in IT Services Contracts", "paper_id": "WOS:000277672500011"}