{"auto_keywords": [{"score": 0.04746186469181639, "phrase": "fossil_fuels"}, {"score": 0.0415308052386387, "phrase": "climate_change"}, {"score": 0.035475979135943414, "phrase": "carbon_emissions"}, {"score": 0.00481495049065317, "phrase": "climate-constrained_world"}, {"score": 0.0047637310731655155, "phrase": "global_optimization"}, {"score": 0.004662913362513954, "phrase": "stylized_economy-energy-climate_model"}, {"score": 0.0044795698035664695, "phrase": "accumulated_knowledge"}, {"score": 0.00445567251116082, "phrase": "renewable_energy_technologies"}, {"score": 0.0041786160019500265, "phrase": "economic_regions"}, {"score": 0.004101088357088207, "phrase": "model_predictions"}, {"score": 0.0040465901036133975, "phrase": "fossil_fuel_use"}, {"score": 0.0038254646057281232, "phrase": "investment_allocations"}, {"score": 0.003474040683217655, "phrase": "economic_growth"}, {"score": 0.00340954056723008, "phrase": "fossil_fuel_depletion"}, {"score": 0.0033105861567468086, "phrase": "global_warming"}, {"score": 0.003284098922460191, "phrase": "induced_damages"}, {"score": 0.0032491108935498794, "phrase": "non-carbon_energy_sources"}, {"score": 0.0031887735306340118, "phrase": "higher_cost"}, {"score": 0.0030632140728305813, "phrase": "consumption-related_utility"}, {"score": 0.0030063184802762775, "phrase": "economically_most_rational_investment_portfolio"}, {"score": 0.002982258337258428, "phrase": "finite_time_horizon"}, {"score": 0.0027965622831515463, "phrase": "collaborative_environment"}, {"score": 0.002737262446527767, "phrase": "world_utility"}, {"score": 0.0025736694380861604, "phrase": "nash_equilibrium"}, {"score": 0.0024459097079751507, "phrase": "commons_effect"}, {"score": 0.002238866955912704, "phrase": "expected_climate_damages"}, {"score": 0.002197248893814575, "phrase": "technology_diffusion"}, {"score": 0.002144872266239232, "phrase": "crown_copyright"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Climate policy", " Agent-based modelling", " Common pool resources"], "paper_abstract": "In this paper we present a stylized economy-energy-climate model and discuss the role of the atmosphere, fossil fuels, and a stock of accumulated knowledge about renewable energy technologies in collaboratively and competitively managed worlds. The model highlights that assumptions about the 'degree of competition' and about choices of lumping economic regions, and hence their heterogeneity, strongly affect model predictions about the rate of fossil fuel use and, consequently, the rate of climate change. In the model, decisionmakers (actors) make decisions about investment allocations into the goods producing economy and into carbon-based and non-carbon-based (renewable) energy supply, the remainder being for consumption. Actors are faced with the following dilemma situation. Economic growth requires energy and will therefore accelerate fossil fuel depletion and generate growth in carbon emissions, the latter leading to global warming and climate change induced damages. By developing non-carbon energy sources, which come initially at a higher cost than fossil fuels, growth of carbon emissions can be curtailed. Trying to optimize a consumption-related utility, actors base their decisions on the economically most rational investment portfolio for a finite time horizon. However, in their decisionmaking, they are constrained by the choices of other actors. We consider two prototypical situations: (i) a collaborative environment where all actors strive to maximize a world utility the global optimum and (ii) a situation where actors optimize the utility of their own country a solution that corresponds to a Nash equilibrium. The difference between both outcomes can be used to classify the severity of the 'tragedy of the commons effect'. We present results about the dependence of the severity of this effect on several key parameters (i) the number of actors, (ii) the heterogeneity and severity of expected climate damages, (iii) assumptions about technology diffusion and (iv) fossil fuel depletion. Crown Copyright (C) 2012 Published by Elsevier Ltd. All rights reserved.", "paper_title": "The energy transition in a climate-constrained world: Regional vs. global optimization", "paper_id": "WOS:000319243700004"}