{"auto_keywords": [{"score": 0.0265095251874421, "phrase": "sitegal"}, {"score": 0.00481495049065317, "phrase": "rural_land_markets_application"}, {"score": 0.004731638279336065, "phrase": "land_bank"}, {"score": 0.00451642066363115, "phrase": "land_abandonment"}, {"score": 0.004412494693940597, "phrase": "rural_markets"}, {"score": 0.004211731831120046, "phrase": "main_concerns"}, {"score": 0.004162978902905446, "phrase": "rural_administrations"}, {"score": 0.003662410853488772, "phrase": "novel_web-gis_tool"}, {"score": 0.0034956560177000656, "phrase": "rural_land_markets"}, {"score": 0.0030750809317435304, "phrase": "open_source_software"}, {"score": 0.0027687904688616983, "phrase": "geographic_information"}, {"score": 0.0026892447164623247, "phrase": "external_data_sources"}, {"score": 0.0021049977753042253, "phrase": "land_owners"}], "paper_keywords": ["Land Bank", " GIS", " Open source", " WMS", " WFS", " Java web application"], "paper_abstract": "Land abandonment and stagnation of rural markets in the last few years have become one of the main concerns of rural administrations. The use of Web and GIS (Geographic Information System) technologies can help to mitigate the effects of these problems. This paper pro-poses a novel Web-GIS tool with spatial capabilities for the dynamization of rural land markets by encouraging the transfer of land from owners to farmers through the leasing of plots. The system, based on open source software, offers information about the properties, their environment and their owners. It uses standards for handling the geographic information and for communicating with external data sources. This system was used as the basis for the development of SITEGAL, the tool for the management of the Land Bank of Galicia (www.bantegal.com/sitegal). SITEGAL has been operational since 2007 obtaining benefits for both administration and users (farmers and land owners), and promoting the e-Government.", "paper_title": "Web-GIS tool for the management of rural land markets Application to the Land Bank of Galicia (NW Spain)", "paper_id": "WOS:000326886300003"}