{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "decoupled_power_allocation"}, {"score": 0.004742379087286591, "phrase": "cdma_reverse_link"}, {"score": 0.0046993598473345395, "phrase": "energy-constrained"}, {"score": 0.004670896353428476, "phrase": "energy-sufficient_data_terminals"}, {"score": 0.004614483128885678, "phrase": "market-oriented_management"}, {"score": 0.0045726187330434025, "phrase": "reverse_link"}, {"score": 0.00453113241842654, "phrase": "cdma_cell"}, {"score": 0.004490020801780961, "phrase": "data_terminals"}, {"score": 0.004174220694700258, "phrase": "energy_supplies"}, {"score": 0.003976076057473637, "phrase": "energy_budgets"}, {"score": 0.003951976017359017, "phrase": "appropriate_performance_indices"}, {"score": 0.0035422310038875048, "phrase": "total_power"}, {"score": 0.0030056376712621793, "phrase": "socially-optimal_price"}, {"score": 0.0028978654846251047, "phrase": "energy-constrained_terminal"}, {"score": 0.0027769919995947676, "phrase": "revenue-maximising_network"}, {"score": 0.002726740692380339, "phrase": "individual_price"}, {"score": 0.0026129863248033807, "phrase": "network_price"}, {"score": 0.002414138203828421, "phrase": "limited_and_unlimited_energy_supplies"}, {"score": 0.0023063614119692476, "phrase": "energy_supply"}, {"score": 0.0021966859554037174, "phrase": "optimal_link-layer_configuration"}, {"score": 0.0021307975800397816, "phrase": "received_power_fraction"}, {"score": 0.0021049977753042253, "phrase": "\"decoupled\"_solution"}], "paper_keywords": ["power control", " pricing", " game theory", " microeconomics", " CDMA", " revenue maximisation"], "paper_abstract": "We perform market-oriented management of the reverse link of a CDMA cell populated by data terminals, each with its own data rate, channel gain, willingness to pay (wtp), and link-layer configuration, and with energy supplies that are limited for some, and inexhaustible for others. For both types of energy budgets, appropriate performance indices are specified. Notably, our solution is \"decoupled\" in that a terminal can choose optimally, irrespective from choices made by the others, because it pays in proportion to its fraction of the total power at the receiver, which directly determines its signal-to-interference ratio (SIR), and hence its performance. By contrast, in other similarly-sounding schemes terminals' optimal choices are interdependent, which leads to \"games of strategy\", and their practical and theoretical complications. We study two situations: pricing for maximal (i) network revenue, and (ii) social benefit. The socially-optimal price is common to all terminals of a given energy class, and an energy-constrained terminal pays in proportion to the square of its power fraction. By contrast, the revenue-maximising network sets for each terminal an individual price that drives the terminal to the \"revenue per Watt\" maximiser. The network price is higher, and drives each terminal to consume less. Distinguishing features of our model are: (i) the simultaneous consideration of both limited and unlimited energy supplies, (ii) the performance metrics utilised (one for each type of energy supply), (iii) the generality of our physical model, which can lead to an optimal link-layer configuration, and (iv) our pricing of the received power fraction which yields a \"decoupled\" solution.", "paper_title": "Decoupled Power Allocation Through Pricing on a CDMA Reverse Link Shared by Energy-Constrained and Energy-Sufficient Data Terminals", "paper_id": "WOS:000295534900012"}