{"auto_keywords": [{"score": 0.026849568890147234, "phrase": "initialization_sequences"}, {"score": 0.00481495049065317, "phrase": "retiming_and_resynthesis_operations"}, {"score": 0.004342430078306461, "phrase": "verification_complexity"}, {"score": 0.004064548693812535, "phrase": "verification_algorithms"}, {"score": 0.003916098498242888, "phrase": "optimization_potential"}, {"score": 0.003835972725191194, "phrase": "constructive_algorithm"}, {"score": 0.0033743949483348626, "phrase": "iterative_transformation"}, {"score": 0.003030247482854539, "phrase": "common_belief"}, {"score": 0.0029194625087935345, "phrase": "conservative_design_methodology"}, {"score": 0.0028596699752849682, "phrase": "synchronous_hardware_systems"}, {"score": 0.0026324658253309673, "phrase": "positive_side"}, {"score": 0.0025999744005191713, "phrase": "lag-independent_bound"}, {"score": 0.002546708483171714, "phrase": "length_increase"}, {"score": 0.0024333239726872604, "phrase": "simpler_incremental_construction"}, {"score": 0.0023834640793589435, "phrase": "prior_approaches"}, {"score": 0.002344311033783139, "phrase": "negative_side"}, {"score": 0.0021049977753042253, "phrase": "exact_length_increase"}], "paper_keywords": ["computational complexity", " equivalence verification", " finite state machine (FSM)", " initialization sequence", " resynthesis", " retiming"], "paper_abstract": "Transformations using retiming and resynthesis operations are the most important and practical (if not the only) techniques used in optimizing synchronous hardware systems. Although these transformations have been studied extensively for over a decade, questions about their optimization capability and verification complexity are not answered fully. Resolving these questions may be crucial in developing more effective synthesis and verification algorithms. This paper settles the above two open problems. The optimization potential is resolved through a constructive algorithm which determines if two given finite state machines (FSMs) are transformable to each other via retiming and resynthesis operations. Verifying the equivalence of two FSMs under such transformations, when the history of iterative transformation is unknown, is proved to be polynomial-space-complete and hence just as hard as general equivalence checking, contrary to a common belief. As a result, we advocate a conservative design methodology for the optimization of synchronous hardware systems to ameliorate verifiability. Our analysis reveals some properties about initializing FSMs transformed under retiming and resynthesis. On the positive side, a lag-independent bound is established on the length increase of initialization sequences for FSMs under retiming. It allows a simpler incremental construction of initialization sequences compared to prior approaches. On the negative side, we show that there is no analogous transformation-independent bound when resynthesis and retiming are iterated. Nonetheless, an algorithm computing the exact length increase is presented.", "paper_title": "Retiming and resynthesis: A complexity perspective", "paper_id": "WOS:000242604800006"}