{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "qualitative_degrees"}, {"score": 0.004258128672571261, "phrase": "decision_making"}, {"score": 0.004151188559520802, "phrase": "experts'_knowledge"}, {"score": 0.004081385289516914, "phrase": "different_heterogeneous_types"}, {"score": 0.003829877278269543, "phrase": "whole_work"}, {"score": 0.003593812067062062, "phrase": "classic_probabilities"}, {"score": 0.0034154440860550564, "phrase": "supervised_learning"}, {"score": 0.0030847461428168614, "phrase": "generalized_symbolic_modifiers"}, {"score": 0.002526780881314497, "phrase": "last_point"}, {"score": 0.0024527767211457046, "phrase": "data_combination"}, {"score": 0.0023013968622710847, "phrase": "associated_weights"}, {"score": 0.0021049977753042253, "phrase": "internal_mechanism"}], "paper_keywords": ["many-valued logic", " qualitative data", " symbolic data", " modification", " combination", " uncertainty"], "paper_abstract": "In this article, qualitative, symbolic and linguistic models for knowledge representation are presented as well as their applications. Such models are useful in decision making problems when information from the experts' knowledge is expressed through different heterogeneous types such as numerical, interval-valued, symbolic, linguistic,... The whole work proposed here takes place in a given many-valued logic. First, as an alternative to classic probabilities, a method using qualitative degrees is described and an application in supervised learning is proposed. Then we study the transformation of these degrees when they are subjected to a modification: thus we present the Generalized Symbolic Modifiers. These tools are defined as manipulations computed on a pair (degree, scale). They are grouped together into several families and thus offer many possibilities to handle uncertainty. An application in colorimetrics is described and shows the feasibility of the approach. The last point addressed in this article is the data combination. An operator called the Symbolic Weighted Median gives a summary of several qualitative degrees with associated weights. One particularity is that this median is constructed on the Generalized Symbolic Modifiers. Finally we explain how the Symbolic Weighted Median is exploited in the internal mechanism of the application in colorimetrics.", "paper_title": "Manipulation of qualitative degrees to handle uncertainty: formal models and applications", "paper_id": "WOS:000237233700001"}