{"auto_keywords": [{"score": 0.050076584515905, "phrase": "sparse_nonnegative_tucker_decompositions"}, {"score": 0.04250474181403748, "phrase": "tucker_model"}, {"score": 0.03852726241784214, "phrase": "sparse_coding"}, {"score": 0.036935658713591404, "phrase": "nmf"}, {"score": 0.028527567183166364, "phrase": "sn-tucker"}, {"score": 0.004728122501822142, "phrase": "increasing_interest"}, {"score": 0.0046597835420572825, "phrase": "large-scale_multiway_data"}, {"score": 0.004575740812937594, "phrase": "multiway_data"}, {"score": 0.004223521213460728, "phrase": "decomposition_techniques"}, {"score": 0.0038559375376635047, "phrase": "regular_factor_analysis"}, {"score": 0.0037725685596495355, "phrase": "nonnegative_matrix_factorization"}, {"score": 0.0034315678891900184, "phrase": "parafac_model"}, {"score": 0.003213660268958121, "phrase": "tensor_data"}, {"score": 0.0026201089205321704, "phrase": "proposed_algorithms"}, {"score": 0.002582159550634798, "phrase": "existing_algorithms"}, {"score": 0.0025633909553815534, "phrase": "tucker_decompositions"}, {"score": 0.0023485253057495157, "phrase": "tucker"}, {"score": 0.002183230464873613, "phrase": "excess_components"}, {"score": 0.0021049977753042253, "phrase": "morup"}], "paper_keywords": [""], "paper_abstract": "There is a increasing interest in analysis of large-scale multiway data. The concept of multiway data refers to arrays of data with more than two dimensions, that is, taking the form of tensors. To analyze such data, decomposition techniques are widely used. The two most common decompositions for tensors are the Tucker model and the more restricted PARAFAC model. Both models can be viewed as generalizations of the regular factor analysis to data of more than two modalities. Nonnegative matrix factorization (NMF), in conjunction with sparse coding, has recently been given much attention due to its part-based and easy interpretable representation. While NMF has been extended to the PARAFAC model, no such attempt has been done to extend NMF to the Tucker model. However, if the tensor data analyzed are nonnegative, it may well be relevant to consider purely additive (i.e., nonnegative) Tucker decompositions). To reduce ambiguities of this type of decomposition, we develop updates that can impose sparseness in any combination of modalities, hence, proposed algorithms for sparse nonnegative Tucker decompositions (SN-TUCKER). We demonstrate how the proposed algorithms are superior to existing algorithms for Tucker decompositions when the data and interactions can be considered nonnegative. We further illustrate how sparse coding can help identify what model (PARAFAC or Tucker) is more appropriate for the data as well as to select the number of components by turning off excess components. The algorithms for SN-TUCKER can be downloaded from Morup (2007).", "paper_title": "Algorithms for sparse nonnegative Tucker decompositions", "paper_id": "WOS:000256916200009"}