{"auto_keywords": [{"score": 0.036923448746605844, "phrase": "wald"}, {"score": 0.00481495049065317, "phrase": "covariance_matrices"}, {"score": 0.004686791459644141, "phrase": "statistics_literature"}, {"score": 0.004278807087784626, "phrase": "incomplete_data"}, {"score": 0.004235717186207754, "phrase": "general_setting"}, {"score": 0.004164858807302222, "phrase": "statistical_tests"}, {"score": 0.003986103192038901, "phrase": "wald_test"}, {"score": 0.0036635429301869527, "phrase": "normal_populations"}, {"score": 0.0034475308539463323, "phrase": "normality_assumption"}, {"score": 0.0033330581836898032, "phrase": "multivariate_normal_distributions"}, {"score": 0.0032006810120751524, "phrase": "incomplete_data_case"}, {"score": 0.003104849179057156, "phrase": "robust_wald_test"}, {"score": 0.0029118285733827406, "phrase": "re-scaled_lrt"}, {"score": 0.0027961342030212353, "phrase": "simulation_study"}, {"score": 0.0025609496151442696, "phrase": "nominal_significance_level"}, {"score": 0.0022446552199168472, "phrase": "proposed_tests"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["likelihood ratio test", " missing completely at random", " missing data", " re-scaled likelihood ratio test", " robust tests", " test of homogeneity of covariance matrices", " Wald test"], "paper_abstract": "In the statistics literature, a number of procedures have been proposed for testing equality of several groups' covariance matrices when data are complete, but this problem has not been considered for incomplete data in a general setting. This paper proposes statistical tests for equality of covariance, matrices when data are missing. A Wald test (denoted by T-1), a likelihood ratio test (LRT) (denoted by R), based on the assumption of normal populations are developed. It is well-known that for the complete data case the classic LRT and the Wald test constructed under the normality assumption perform poorly in instances when data are not from multivariate normal distributions. As expected, this is also the case for the incomplete data case and therefore has led us to construct a robust Wald test (denoted by T-2) that performs well for both normal and non-normal data. A re-scaled LRT (denoted by R*) is also proposed. A simulation study is carried out to assess the performance of T-1, T-2, R, and R* in terms of closeness of their observed significance level to the nominal significance level as well as the power of these tests. It is found that T-2 performs very well for both normal and non-normal data in both small and large samples. In addition to its usual applications, we have discussed the application of the proposed tests in testing whether a set of data are missing completely at random (MCAR). (c) 2006 Elsevier B.V. All rights reserved.", "paper_title": "Testing equality of covariance matrices when data are incomplete", "paper_id": "WOS:000246606000010"}