{"auto_keywords": [{"score": 0.04891849113301896, "phrase": "shape_difference"}, {"score": 0.040836550624054266, "phrase": "discriminative_direction"}, {"score": 0.015593050244537974, "phrase": "regularized_discriminative_direction"}, {"score": 0.00481495049065317, "phrase": "anatomical_shape_difference"}, {"score": 0.004621984064678252, "phrase": "anatomical_objects"}, {"score": 0.004546970518808189, "phrase": "medical_image_analysis"}, {"score": 0.004509919457793852, "phrase": "computer-aided_diagnosis"}, {"score": 0.003797690272118125, "phrase": "thorough_study"}, {"score": 0.0036903962975894634, "phrase": "efficient_and_accurate_way"}, {"score": 0.0035278613436978933, "phrase": "preimage_problem"}, {"score": 0.0034990853199511982, "phrase": "kernel-based_learning"}, {"score": 0.003428164458163043, "phrase": "complementary_but_conceptually_simpler_solution"}, {"score": 0.0031975786158658158, "phrase": "original_discriminative_direction"}, {"score": 0.003069230909006614, "phrase": "spurious_shape_differences"}, {"score": 0.0030193416820392554, "phrase": "inaccurate_analysis"}, {"score": 0.002583931950389087, "phrase": "probability_distributions"}, {"score": 0.0023903140267755576, "phrase": "controlled_experiments"}, {"score": 0.0023418133729330303, "phrase": "proposed_methods"}, {"score": 0.0022849068677290836, "phrase": "hippocampal_shape_difference"}, {"score": 0.0021049977753042253, "phrase": "established_discriminative_direction_method"}], "paper_keywords": ["Discriminative direction", " hippocampal shapes", " preimage problem", " shape distribution", " statistical shape analysis"], "paper_abstract": "Identifying the shape difference between two groups of anatomical objects is important for medical image analysis and computer-aided diagnosis. A method called \"discriminative direction\" in the literature has been proposed to solve this problem. In that method, the shape difference between groups is identified by deforming a shape along the discriminative direction. This paper conducts a thorough study about inferring this discriminative direction in an efficient and accurate way. First, finding the discriminative direction is reformulated as a preimage problem in kernel-based learning. This provides a complementary but conceptually simpler solution than the previous method. More importantly, we find that a shape deforming along the original discriminative direction cannot faithfully maintain its anatomical correctness. This unnecessarily introduces spurious shape differences and leads to inaccurate analysis. To overcome this problem, this paper further proposes a regularized discriminative direction by requiring a shape to conform to its underlying distribution when it deforms. Two different approaches are developed to impose the regularization, one from the perspective of probability distributions and the other front a geometric point of view, and their relationship is discussed. After verifying their superior performance through controlled experiments, we apply the proposed methods to detecting and localizing the hippocampal shape difference between sexes. We get results consistent with other independent research, providing a more compact representation of the shape difference compared with the established discriminative direction method.", "paper_title": "Identifying Anatomical Shape Difference by Regularized Discriminative Direction", "paper_id": "WOS:000266676500014"}