{"auto_keywords": [{"score": 0.02954804361689818, "phrase": "third_stage_problem"}, {"score": 0.009450241351554032, "phrase": "linear_market"}, {"score": 0.008785220258153672, "phrase": "optimal_location_strategies"}, {"score": 0.007318808480206144, "phrase": "first_stage"}, {"score": 0.00719821091952716, "phrase": "optimal_location"}, {"score": 0.006802747951124351, "phrase": "second_stage"}, {"score": 0.006471774307365678, "phrase": "facility_c"}, {"score": 0.004782977628406988, "phrase": "competitive_facility_location_problems"}, {"score": 0.004580243025274209, "phrase": "location_models"}, {"score": 0.0041721750101390825, "phrase": "nash_equilibrium_solution"}, {"score": 0.004144452614362445, "phrase": "location_problem"}, {"score": 0.003663443192307343, "phrase": "specific_order"}, {"score": 0.0035197152758635344, "phrase": "stackelberg_equilibrium_solutions"}, {"score": 0.0034963129868796033, "phrase": "competitive_location_problems"}, {"score": 0.003381607100127276, "phrase": "decision_problems"}, {"score": 0.0032380786944838204, "phrase": "facility_a"}, {"score": 0.003131818247415968, "phrase": "remaining_two_facilities_b"}, {"score": 0.0030088845918380468, "phrase": "facility_b"}, {"score": 0.002537880772794665, "phrase": "optimal_solutions"}, {"score": 0.0025125868638809284, "phrase": "second_and_third_stages"}, {"score": 0.002446359075737738, "phrase": "optimal_solution"}, {"score": 0.002265497060260791, "phrase": "second_stage_problem"}, {"score": 0.002242911772136627, "phrase": "optimal_solution_strategy"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Facility location", " Competitive environment", " Stackelberg equilibrium"], "paper_abstract": "Competitive facility location problems have been investigated in many papers. In most, authors have applied location models with two competitors. In this paper three companies, which are mutually competitive, intend to locate their facilities in a linear market. It is well-known that Nash equilibrium solution for location problem does not include three competitive facilities. In this paper we present the optimal location strategies for three facilities. In our model we assume that the demands are continuously distributed in a linear market and the facilities are locating according to a specific order of sequence, A, B and C. We apply the Stackelberg equilibrium solutions for competitive location problems with three facilities. In our model, we consider the decision problems in three stages. In the first stage, we decide the optimal location of facility A, which is located optimally in respect to the remaining two facilities B and C. In the second stage, we determine the optimal location of facility B which is optimally located in respect to facility C, by utilizing the information on the location of facility A. Finally in the third stage problem we decide the location of facility C, optimally located by utilizing the information on the location of A and B. In the first stage, we need the optimal solutions of the second and third stages. In the second stage we need the optimal solution of the third stage problem. Therefore, first we solve the third stage problem which is the simplest. After that, we solve the second stage problem utilizing the optimal solution strategy of the third stage problem. In this paper we present the optimal location strategies for three facilities. (c) 2011 Elsevier Ltd. All rights reserved.", "paper_title": "Optimal location policy for three competitive facilities", "paper_id": "WOS:000302432300004"}