{"auto_keywords": [{"score": 0.035620716932052585, "phrase": "nixmig"}, {"score": 0.015579192279283836, "phrase": "distributed_systems"}, {"score": 0.014695457933397433, "phrase": "range_queries"}, {"score": 0.00481495049065317, "phrase": "distributed_range-queriable_systems"}, {"score": 0.004706895428234964, "phrase": "peer-to-peer_overlays"}, {"score": 0.004457309741979921, "phrase": "large_numbers"}, {"score": 0.004417012437860011, "phrase": "participating_hosts"}, {"score": 0.004317848984770719, "phrase": "uneven_load_allocation"}, {"score": 0.004126123386192962, "phrase": "overloaded_peers"}, {"score": 0.0028944757265206332, "phrase": "case_study"}, {"score": 0.002765776659294382, "phrase": "skip_graph"}, {"score": 0.002548331088496964, "phrase": "existing_load-balancing_algorithm"}, {"score": 0.002513788420449634, "phrase": "karger"}, {"score": 0.0024910155791694425, "phrase": "ruhl"}, {"score": 0.002203016940021265, "phrase": "item_exchanges"}, {"score": 0.0021049977753042253, "phrase": "balanced_state"}], "paper_keywords": ["Peer-to-peer systems", " load-balancing", " range queries"], "paper_abstract": "Distributed systems such as Peer-to-Peer overlays have been shown to efficiently support the processing of range queries over large numbers of participating hosts. In such systems, uneven load allocation has to be effectively tackled in order to minimize overloaded peers and optimize their performance. In this work, we detect the two basic methodologies used to achieve load-balancing: Iterative key redistribution between neighbors and node migration. We identify these two key mechanisms and describe their relative advantages and disadvantages. Based on this analysis, we propose NIXMIG, a hybrid method that adaptively utilizes these two extremes to achieve both fast and cost-effective load-balancing in distributed systems that support range queries. We theoretically prove its convergence and as a case study, we offer an implementation on top of a Skip Graph, where we thoroughly validate our findings in a variety of static, dynamic and realistic workloads. We compare NIXMIG with an existing load-balancing algorithm proposed by Karger and Ruhl [1] and our experimental analysis shows that, NIXMIG can be as much as three times faster, requiring only one sixth and one third of message and item exchanges, respectively, to bring the system to a balanced state.", "paper_title": "Fast and Cost-Effective Online Load-Balancing in Distributed Range-Queriable Systems", "paper_id": "WOS:000292047500011"}