{"auto_keywords": [{"score": 0.02232359335099914, "phrase": "fou_parameters"}, {"score": 0.011011736404966934, "phrase": "collected_data"}, {"score": 0.00481495049065317, "phrase": "fuzzy_set"}, {"score": 0.004752356488435777, "phrase": "sufficient_and_necessary_condition"}, {"score": 0.004614038128321949, "phrase": "important_issue"}, {"score": 0.004167982855788402, "phrase": "challenging_problem"}, {"score": 0.0039290812928975275, "phrase": "existing_root-finding_algorithms"}, {"score": 0.003877737556673229, "phrase": "geometric_parameters"}, {"score": 0.0037526578966602573, "phrase": "proposed_approach"}, {"score": 0.003269266730193333, "phrase": "desired_one"}, {"score": 0.0030314419455512013, "phrase": "centroid_requirement"}, {"score": 0.0025892330566358503, "phrase": "established_equations"}, {"score": 0.0023928819778638055, "phrase": "false_position_algorithm"}, {"score": 0.0023538840032613535, "phrase": "overall_merits"}, {"score": 0.002255431275670053, "phrase": "arbitrary_fou_shapes"}, {"score": 0.002218668420806254, "phrase": "numerical_examples"}], "paper_keywords": ["Centroid", " computing with words", " interval type-2 fuzzy sets", " Karnik-Mendel method"], "paper_abstract": "In computingwithwords, establishing a fuzzy set (FS) model for a word to capture its uncertainties is an important issue. An interval type-2 (IT2) FS can be used to model a word. How to establish an IT2 FS from the collected data about a word has been a challenging problem. It has been reported that one way is to extract the centroid of an IT2 FS from the collected data and to obtain geometric parameters of its footprint of uncertainty (FOU) such that its centroid matches the extracted one. How to extract the centroid of an IT2 FS from the collected data about a word has thoroughly been studied. However, there exists no method for obtaining FOU parameters for an IT2 FS such that its centroid matches the desired one. To fill this gap, this paper presents an approach to obtaining FOU parameters for an IT2 FS by establishing equations using the centroid requirement. To propose this approach, a sufficient and necessary condition for ensuring the centroid of an IT2 FS is developed. Using this sufficient and necessary condition, two equations about all of the FOU parameters are established. To obtain the FOU parameters, all of them except two are predetermined so that the established equations can be simplified to two single-variable equations. The other two FOU parameters can then be determined by solving these two single-variable equations using existing root-finding algorithms. Among existing root-finding algorithms, the false position algorithm is recommended. The overall merits of the proposed approach are its simplicity in implementation and its applicability to IT2 FSs with arbitrary FOU shapes. In addition, numerical examples are provided to further illustrate how to apply the proposed approach to obtain FOU parameters for an IT2 FS.", "paper_title": "Ensuring the Centroid of an Interval Type-2 Fuzzy Set", "paper_id": "WOS:000359262400018"}