{"auto_keywords": [{"score": 0.03997447142565905, "phrase": "previous_studies"}, {"score": 0.00481495049065317, "phrase": "spammer_detection"}, {"score": 0.0047732596509542135, "phrase": "data_stream_clustering"}, {"score": 0.0047113960612140335, "phrase": "rapid_growth"}, {"score": 0.004670804701848821, "phrase": "twitter"}, {"score": 0.004590052784169268, "phrase": "dramatic_increase"}, {"score": 0.004550300345169981, "phrase": "spam_volume"}, {"score": 0.003924629168434799, "phrase": "key_factor"}, {"score": 0.0038737214010638745, "phrase": "new_spam_accounts"}, {"score": 0.0036288825833675127, "phrase": "spam_detection"}, {"score": 0.003581797255879607, "phrase": "classification_problem"}, {"score": 0.003459191419478298, "phrase": "anomaly_detection_problem"}, {"score": 0.0032830808525570903, "phrase": "user_information"}, {"score": 0.003129509028432954, "phrase": "streaming_nature"}, {"score": 0.002918826667294298, "phrase": "spam_identification"}, {"score": 0.002855934865505357, "phrase": "normal_twitter_users"}, {"score": 0.0021797112385590913, "phrase": "normal_users"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Twitter", " Spam detection", " Clustering", " Data stream"], "paper_abstract": "The rapid growth of Twitter has triggered a dramatic increase in spam volume and sophistication. The abuse of certain Twitter components such as \"hashtags\", \"mentions\", and shortened URLs enables spammers to operate efficiently. These same features, however, may be a key factor in identifying new spam accounts as shown in previous studies. Our study provides three novel contributions. Firstly, previous studies have approached spam detection as a classification problem, whereas we view it as an anomaly detection problem. Secondly, 95 one-gram features from tweet text were introduced alongside the user information analyzed in previous studies. Finally, to effectively handle the streaming nature of tweets, two stream clustering algorithms, StreamKM++ and DenStream, were modified to facilitate spam identification. Both algorithms clustered normal Twitter users, treating outliers as spammers. Each of these algorithms performed well individually, with StreamKM++ achieving 99% recall and a 6.4% false positive rate; and DenStream producing 99% recall and a 2.8% false positive rate. When used in conjunction, these algorithms reached 100% recall and a 2.2% false positive rate, meaning that our system was able to identify 100% of the spammers in our test while incorrectly detecting only 2.2% of normal users as spammers. (C) 2013 Elsevier Inc. All rights reserved.", "paper_title": "Twitter spammer detection using data stream clustering", "paper_id": "WOS:000330823800005"}