{"auto_keywords": [{"score": 0.039292792728871304, "phrase": "arbitrary_pattern"}, {"score": 0.00481495049065317, "phrase": "engineering_point"}, {"score": 0.00422899036681456, "phrase": "fundamental_algorithmic_limitations"}, {"score": 0.004143196873246147, "phrase": "autonomous_mobile_robots"}, {"score": 0.003990385737207714, "phrase": "hard_task"}, {"score": 0.003922794571908569, "phrase": "weak_robots"}, {"score": 0.0026114748685439116, "phrase": "common_agreement"}, {"score": 0.002472352057126189, "phrase": "compass_needle"}, {"score": 0.002447239283600653, "phrase": "north"}, {"score": 0.002422108787774162, "phrase": "robot_world"}, {"score": 0.002397370428991875, "phrase": "flat_surface"}, {"score": 0.0023728841359713106, "phrase": "compass_needles"}, {"score": 0.0023167153974120104, "phrase": "odd_number"}, {"score": 0.0021857667493036786, "phrase": "worst_case"}, {"score": 0.0021122156536257665, "phrase": "north_and"}, {"score": 0.0021050682990681776, "phrase": "east"}], "paper_keywords": ["Autonomous robots", " Pattern formation", " Distributed computing", " Distributed algorithm", " Mobile entities"], "paper_abstract": "From an engineering point of view, the problem of coordinating a set of autonomous, mobile robots for the purpose of cooperatively performing a task has been studied extensively over the past decade. In contrast, in this paper we aim to understand the fundamental algorithmic limitations on what a set of autonomous mobile robots can or cannot achieve. We therefore study a hard task for a set of weak robots. The task is for the robots in the plane to form any arbitrary pattern that is given in advance. This task is fundamental in the sense that if the robots can form any pattern, they can agree on their respective roles in a subsequent, coordinated action. The robots are weak in several aspects. They are anonymous; they cannot explicitly communicate with each other, but only observe the positions of the others; they cannot remember the past; they operate in a very strong form of asynchronicity. We show that the tasks that such a system of robots can perform depend strongly on their common agreement about their environment, i.e. the readings of their environment sensors. If the robots have no common agreement about their environment, they cannot form an arbitrary pattern. If each robot has a compass needle that indicates North (the robot world is a flat surface, and compass needles are parallel), then any odd number of robots can form an arbitrary pattern, but an even number cannot (in the worst case). If each robot has two independent compass needles, say North and East, then any set of robots can form any pattern. (C) 2008 Elsevier B.V. All rights reserved.", "paper_title": "Arbitrary pattern formation by asynchronous, anonymous, oblivious robots", "paper_id": "WOS:000260975400031"}