{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "aquatic_toxicity"}, {"score": 0.011388478094896603, "phrase": "ga"}, {"score": 0.0047527118741586055, "phrase": "structure-activity_relationship"}, {"score": 0.0038216374069880038, "phrase": "aquatic_organisms"}, {"score": 0.0035923719610602214, "phrase": "mlogp_and_alogp_parameters"}, {"score": 0.0034099718632933027, "phrase": "linear_discriminant_analysis"}, {"score": 0.003388005719815723, "phrase": "lda"}, {"score": 0.0033222630615013763, "phrase": "stable_and_thoroughly_validated_qsars"}, {"score": 0.003133052778244851, "phrase": "accuracy_rate"}, {"score": 0.003012919635505122, "phrase": "mlogp"}, {"score": 0.0029642298956837764, "phrase": "pronounced_correlation"}, {"score": 0.0026969099161088398, "phrase": "external_prediction_accuracies"}, {"score": 0.0026019244311765964, "phrase": "molecular_size"}, {"score": 0.0024297565926197505, "phrase": "predictive_performance"}, {"score": 0.0024061070225431525, "phrase": "proposed_models"}, {"score": 0.0023213398100616132, "phrase": "y-scrambling"}, {"score": 0.0021961592899628615, "phrase": "huge_advantage"}, {"score": 0.0021747784376752776, "phrase": "stepwise_procedure"}], "paper_keywords": ["Genetic algorithm", " Linear discriminant analysis", " Pesticide", " QSAR", " Structure-property relationships", " Aquatic toxicity", " Medicinal chemistry"], "paper_abstract": "The purpose of this work is to develop robust, interpretable structure-activity relationship (SAR) models for assessing the aquatic toxicity of pesticides. A data set of 1600 chemicals involving 533 nontoxic (C0), 287 slightly toxic (C1), 329 moderately toxic (C2), 231 highly toxic (C3), and 220 very highly toxic compounds (C4) to aquatic organisms were collected in this work. Their chemical structures were encoded into 196 molecular descriptors including the 2D topological, electrotopological state variables as well as the MlogP and AlogP parameters. Two variable selection techniques, i.e., the Stepwise procedure and the Genetic Algorithms (GA), coupled with the linear discriminant analysis (LDA) were used to obtain stable and thoroughly validated QSARs. Our results reveal that the AlogP is capable of classifying the C0 versus C4 compounds with an accuracy rate of 70.4%, but is poor between other groups, while the MlogP does not show any pronounced correlation for aquatic toxicity for all the groups. By using all the theoretical descriptors, the GA-LDA models for C(0,4) C(1,3), C(1,4), and C(2,4) classifications are acceptable with external prediction accuracies ranging from 66.3% to 80.6%. All these selected descriptors accounting for the molecular size, electrotopological state, and hydrophobicity were found to be crucial to modeling the aquatic toxicity. The robustness and the predictive performance of the proposed models were verified using both the internal (cross-validation by leave-one out, Y-scrambling) and external statistical validations (randomly selected). Our results demonstrate that the Genetic Algorithms have a huge advantage over the Stepwise procedure for generating more reliable models, but by using much less descriptors for all the data sets.", "paper_title": "Understanding the Aquatic Toxicity of Pesticide: Structure-Activity Relationship and Molecular Descriptors to Distinguish the Ratings of Toxicity", "paper_id": "WOS:000273713200020"}