{"auto_keywords": [{"score": 0.049568154654955725, "phrase": "design_process"}, {"score": 0.038973403463545685, "phrase": "design_processes"}, {"score": 0.00481495049065317, "phrase": "design_educators'_perceptions"}, {"score": 0.004679134285953932, "phrase": "better_understanding"}, {"score": 0.0044346739635814135, "phrase": "novice_designers"}, {"score": 0.004294145092032327, "phrase": "relatively_modest_talents"}, {"score": 0.00406971620207041, "phrase": "outstanding_and_exceptional_ability"}, {"score": 0.003912595576016982, "phrase": "highest_level"}, {"score": 0.0036553070575015344, "phrase": "design_educators"}, {"score": 0.003526735797659508, "phrase": "teaching_design"}, {"score": 0.0031902155632863236, "phrase": "design_teachers"}, {"score": 0.003066945490483524, "phrase": "nineteen_design_teachers"}, {"score": 0.003023307182674672, "phrase": "general_topics"}, {"score": 0.0030017207229983385, "phrase": "discussion_points"}, {"score": 0.0025003054002226965, "phrase": "largely_stories"}, {"score": 0.0024036292057373803, "phrase": "resulting_data"}, {"score": 0.0022615046141708987, "phrase": "different_teachers"}, {"score": 0.0022213218042340735, "phrase": "subsequent_results"}, {"score": 0.0021896891011033105, "phrase": "rich_detail"}, {"score": 0.002158505888557746, "phrase": "design_teaching"}], "paper_keywords": ["Design Knowledge", " Design Process", " Design Understanding", " Educators' Perceptions", " Experiential Learning"], "paper_abstract": "When developing a better understanding of the design process there are several possible approaches to choose from. Many studies are based on novice designers (e.g., students) or designers of relatively modest talents. By contrast, some studies have queried designers who are considered to have outstanding and exceptional ability in order to gain an understanding of design at the highest level that it is practiced. The study reported here adopts yet another approach by exploring how design processes are perceived by design educators. The approach is motivated by the observation that teaching design requires consciously distilling the essence of the design process for the students, observing students during their design process and guiding them through the process. As a result, design teachers tend to develop a more articulate view of design processes than most other designers. Nineteen design teachers are interviewed using general topics as discussion points. Such an approach is invaluable when exploring more abstract research questions such as the notion of design processes. This approach differs from more controlled approaches (e.g., protocol analysis) in that it accepts that the data obtained are partially driven by negotiation between the researchers and the participants, and that the discussions are largely stories or I-lam:dives about design and designing. The resulting data illustrate that design processes are interpreted, articulated, and understood in a variety of ways by different teachers. These data and subsequent results tell us in rich detail about designing and design teaching, and as a result extend our understanding of the design process.", "paper_title": "Scrutinizing design educators' perceptions of the design process", "paper_id": "WOS:000280031000007"}