{"auto_keywords": [{"score": 0.04192926912525078, "phrase": "sci"}, {"score": 0.00481495049065317, "phrase": "global_scientific_production"}, {"score": 0.00476697427418509, "phrase": "stem_cell_research"}, {"score": 0.004488946121663966, "phrase": "stem_cell_research_activities"}, {"score": 0.004040688646993609, "phrase": "online_version"}, {"score": 0.00396050388346298, "phrase": "web_of_science"}, {"score": 0.003785836059995376, "phrase": "stem_cell"}, {"score": 0.0035827424231607784, "phrase": "publication_outputs"}, {"score": 0.00347657813672945, "phrase": "source_title"}, {"score": 0.002931569771634119, "phrase": "scientific_papers"}, {"score": 0.0025219085140220773, "phrase": "stem_cell_transplantation_technology"}, {"score": 0.002496722870659199, "phrase": "human_disease_therapy"}, {"score": 0.00242266141176955, "phrase": "\"embryonic_stem_cell"}, {"score": 0.0023864566654035924, "phrase": "\"mesenchymal_stem_cell"}, {"score": 0.002246955931290095, "phrase": "new_bibliometric_method"}, {"score": 0.0022133711375320244, "phrase": "relevant_researchers"}, {"score": 0.002158505888557746, "phrase": "global_stem_cell_research"}], "paper_keywords": [""], "paper_abstract": "In this study, we aim to evaluate the global scientific production of stem cell research for the past 16 years and provide insights into the characteristics of the stem cell research activities and identify patterns, tendencies, or regularities that may exist in the papers. Data are based on the online version of SCI, Web of Science from 1991 to 2006. Articles referring to stem cell were assessed by many aspects including exponential fitting the trend of publication outputs during 1991-2006, distribution of source title, author keyword, and keyword plus analysis. Based on the exponential fitting the yearly publicans of the last decade, it can also be calculated that, in 2,011, the number of scientific papers on the topic of stem-cell will be twice of the number of publications in 2006. Synthetically analyzing three kinds of keywords, it can be concluded that application of stem cell transplantation technology to human disease therapy, especially research related on \"embryonic stem cell\" and \"mesenchymal stem cell\" is the orientation of all the stem cell research in the 21(st) century. This new bibliometric method can help relevant researchers realize the panorama of global stem cell research, and establish the further research direction.", "paper_title": "Global stem cell research trend: Bibliometric analysis as a tool for mapping of trends from 1991 to 2006", "paper_id": "WOS:000267368100003"}