{"auto_keywords": [{"score": 0.04408711241958952, "phrase": "sensor_nodes"}, {"score": 0.03878324495288763, "phrase": "monitoring_region"}, {"score": 0.03636633306860624, "phrase": "sensor_node"}, {"score": 0.02807245431742538, "phrase": "neighbouring_nodes"}, {"score": 0.00481495049065317, "phrase": "large-scale_wireless_sensor_networks"}, {"score": 0.004683292152590589, "phrase": "wireless_sensor_networks"}, {"score": 0.004285594361623147, "phrase": "initial_physical_placement"}, {"score": 0.004031865694174726, "phrase": "novel_deployment_method"}, {"score": 0.0038998328617557013, "phrase": "large_number"}, {"score": 0.0023788319661581696, "phrase": "non-uniform_areas"}, {"score": 0.0023394947463129642, "phrase": "simulation_evaluations"}, {"score": 0.002225334593038328, "phrase": "high_uniformity"}, {"score": 0.0021049977753042253, "phrase": "traditional_airdrop_method"}], "paper_keywords": ["airdrop", " deployment", " WSN", " wireless sensor network", " uniform distribution", " distributed control", " coverage", " simulation"], "paper_abstract": "The performance of wireless sensor networks in terms of coverage, connectivity, lifetime and robustness is greatly influenced by the initial physical placement of the sensor nodes. In this paper we propose a novel deployment method for sensor nodes, when a large number of nodes is distributed from the air in a monitoring region that is inaccessible from the ground. In our deployment method, each sensor node is equipped with a parachute and a device to switch between its two falling behaviours (gliding and falling) in the air. After being dropped from midair, sensor nodes stochastically coordinate their falling behaviour in order to distribute themselves uniformly in the monitoring region. In addition, each sensor node exchanges messages with neighbouring nodes while being airborne and it changes its falling behaviour according to the density of the neighbouring nodes in order to reduce non-uniform areas. Through simulation evaluations, we confirm that our proposal can achieve a high uniformity in the placement of the nodes compared to a traditional airdrop method.", "paper_title": "A uniform airdrop deployment method for large-scale wireless sensor networks", "paper_id": "WOS:000292347900006"}