{"auto_keywords": [{"score": 0.03343816650549669, "phrase": "atalk"}, {"score": 0.00481495049065317, "phrase": "dynamic_organizations"}, {"score": 0.004527024978801684, "phrase": "suitable_abstraction"}, {"score": 0.004434910775034831, "phrase": "open_multi-agent_systems"}, {"score": 0.003968806706727518, "phrase": "agent_dynamicity"}, {"score": 0.003920128102807887, "phrase": "natural_requirement"}, {"score": 0.0033388871136347704, "phrase": "decentralized_and_dynamic_environment"}, {"score": 0.003284361433827464, "phrase": "open_issue"}, {"score": 0.002999955539996569, "phrase": "role_component_model"}, {"score": 0.002938821840519756, "phrase": "role_deployment"}, {"score": 0.002890810475014827, "phrase": "uniform_role_interaction"}, {"score": 0.0028202559386070873, "phrase": "role_dynamicity"}, {"score": 0.002740109776120878, "phrase": "dynamic_role_integration"}, {"score": 0.002391825892939338, "phrase": "normal_execution"}, {"score": 0.002285839246740627, "phrase": "current_prototypic_implementation"}, {"score": 0.0022577559526646904, "phrase": "qualitative_analysis"}, {"score": 0.0021755548389283856, "phrase": "remarkable_organization_reconfigurability"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Multiagent systems", " Organization", " Dynamic reorganization", " Service-oriented architecture"], "paper_abstract": "In recent years the concept of \"organization\" has been gradually accepted as a suitable abstraction for the development of open multi-agent systems with dynamic agents. By modelling interactions based on roles, this abstraction allows an organization to be modelled independently of its participating agents so as to support agent dynamicity. A natural requirement from the abstraction is that agents need to be \"organization aware\"-that is they must be able to inquire, import, and execute roles from the organization. However, how to adequately support those processes in a decentralized and dynamic environment is still an open issue. This paper addresses this problem by presenting ATALK, a novel decentralized agent middleware that fulfills the above requirements. A role component model is designed to facilitate role deployment, reflection and uniform role interaction. In order to support role dynamicity, a compositional agent architecture allowing dynamic role integration and enactment is proposed. Moreover, ATALK allows agents to hand over their role to other agents of a same organization with their run-time states. Thus, agents can dynamically relinquish their roles without jeopardizing the normal execution of the organization. This paper also evaluates our design and current prototypic implementation through both qualitative analysis and simulations. Our results show that ATALK achieves remarkable organization reconfigurability with little additional overhead. (C) 2013 Elsevier Ltd. All rights reserved.", "paper_title": "ATALK: A decentralized agent platform for engineering open and dynamic organizations", "paper_id": "WOS:000332811300015"}