{"auto_keywords": [{"score": 0.02246846748295755, "phrase": "fsw"}, {"score": 0.004038076978795421, "phrase": "plastic_deformation"}, {"score": 0.003869373085652601, "phrase": "advanced_finite_element"}, {"score": 0.00378767277402891, "phrase": "complex_behaviour"}, {"score": 0.003668333531296882, "phrase": "fe_model"}, {"score": 0.0036100762867678415, "phrase": "contact_modelling"}, {"score": 0.003571751184289622, "phrase": "material_model"}, {"score": 0.0035338315037521627, "phrase": "meshing_techniques"}, {"score": 0.003332332086930163, "phrase": "numerical_model"}, {"score": 0.0030270132320276096, "phrase": "fsw_process"}, {"score": 0.0026205405415623525, "phrase": "material_movement"}, {"score": 0.0025514745448798385, "phrase": "tracer_particles"}, {"score": 0.0024447258861321685, "phrase": "numerically_computed_material_flow_patterns"}, {"score": 0.0023675986784123656, "phrase": "general_findings"}, {"score": 0.002185235873435714, "phrase": "authors'_knowledge"}], "paper_keywords": ["Welding", " Mathematical modelling", " Finite element analysis", " Joining processes"], "paper_abstract": "Purpose - The friction stir welding (FSW) process comprises several highly coupled (and non-linear) physical phenomena: large plastic deformation, material flow transportation, mechanical stirring of the tool, tool-workpiece surface interaction, dynamic structural evolution, heat generation from friction and plastic deformation. This paper aims to present an advanced finite element (FE) model encapsulating this complex behaviour and various aspects associated with the FE model such as contact modelling, material model and meshing techniques are to be discussed in detail. Design/methodology/approach - The numerical model is continuum solid mechanics-based, fully thermo-mechanically coupled and has successfully simulated the FSW process including plunging, dwelling and welding stages. Findings - The development of several field variables are quantified by the model: temperature, stress, strain. Material movement is visualized by defining tracer particles at the locations of interest. The numerically computed material flow patterns are in very good agreement with the general findings from experiments. Originality/value - The model is, to the best of the authors' knowledge, the most advanced simulation of FSW published in the literature.", "paper_title": "Multi-physics simulation of friction stir welding process", "paper_id": "WOS:000286569400011"}