{"auto_keywords": [{"score": 0.04112387500656, "phrase": "k_subjects"}, {"score": 0.00481495049065317, "phrase": "enhanced_utility_preservation"}, {"score": 0.004663533386096864, "phrase": "disclosure_limitation"}, {"score": 0.004516856326107826, "phrase": "data_subjects"}, {"score": 0.004475798524102238, "phrase": "microdata_releases"}, {"score": 0.004179480763003705, "phrase": "k-anonymous_data_sets"}, {"score": 0.0037284065559949064, "phrase": "additional_masking_freedom"}, {"score": 0.0036776458116294986, "phrase": "data_utility"}, {"score": 0.003561865840737996, "phrase": "data_granularity"}, {"score": 0.003371773890338284, "phrase": "numerical_data"}, {"score": 0.0031627430133087616, "phrase": "attribute_disclosure"}, {"score": 0.0030352396244492604, "phrase": "confidential_values"}, {"score": 0.0026220103561723066, "phrase": "strictest_privacy_guarantees"}, {"score": 0.0025981315738078793, "phrase": "existing_algorithms"}, {"score": 0.0025627194819793347, "phrase": "t-close_data_sets"}, {"score": 0.0024258208033731154, "phrase": "k-anonymization_algorithms"}, {"score": 0.002234031373581961, "phrase": "k-anonymous_t-close_data_sets"}, {"score": 0.0021049977753042253, "phrase": "k-anonymous_t-closeness"}], "paper_keywords": ["Data privacy", " microaggregation", " k-anonymity", " t-closeness"], "paper_abstract": "Microaggregation is a technique for disclosure limitation aimed at protecting the privacy of data subjects in microdata releases. It has been used as an alternative to generalization and suppression to generate k-anonymous data sets, where the identity of each subject is hidden within a group of k subjects. Unlike generalization, microaggregation perturbs the data and this additional masking freedom allows improving data utility in several ways, such as increasing data granularity, reducing the impact of outliers, and avoiding discretization of numerical data. k-Anonymity, on the other side, does not protect against attribute disclosure, which occurs if the variability of the confidential values in a group of k subjects is too small. To address this issue, several refinements of k-anonymity have been proposed, among which t-closeness stands out as providing one of the strictest privacy guarantees. Existing algorithms to generate t-close data sets are based on generalization and suppression (they are extensions of k-anonymization algorithms based on the same principles). This paper proposes and shows how to use microaggregation to generate k-anonymous t-close data sets. The advantages of microaggregation are analyzed, and then several microaggregation algorithms for k-anonymous t-closeness are presented and empirically evaluated.", "paper_title": "t-Closeness through Microaggregation: Strict Privacy with Enhanced Utility Preservation", "paper_id": "WOS:000362943700018"}