{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "clinical_tests"}, {"score": 0.01486122824766238, "phrase": "clinical_test"}, {"score": 0.012671878806654928, "phrase": "model_parameters"}, {"score": 0.007527936940039037, "phrase": "proposed_approach"}, {"score": 0.004739630859016419, "phrase": "physiological_models"}, {"score": 0.0046361494357125355, "phrase": "model_mismatch"}, {"score": 0.0043527164193299574, "phrase": "detailed_model"}, {"score": 0.004325339932975582, "phrase": "glucose_homeostasis"}, {"score": 0.0041384457437123635, "phrase": "standard_techniques"}, {"score": 0.004112411350177274, "phrase": "model-based_design"}, {"score": 0.004022568802760774, "phrase": "parameter_identification"}, {"score": 0.0038365781437074017, "phrase": "single_type"}, {"score": 0.003776504983530801, "phrase": "standard_mbdoe"}, {"score": 0.0036132394176383582, "phrase": "structural_mismatch"}, {"score": 0.0034136194753440745, "phrase": "initial_uncertainty"}, {"score": 0.0030660649234990284, "phrase": "integrated_use"}, {"score": 0.002780025943393764, "phrase": "online_model-based_experiment_redesign"}, {"score": 0.0026935568995690947, "phrase": "experimental_data"}, {"score": 0.002520604609793834, "phrase": "backoff-based_mbdoe"}, {"score": 0.002481085648977411, "phrase": "parameter_uncertainty"}, {"score": 0.0022353193959268767, "phrase": "simulated_case_study"}, {"score": 0.0022142194702079866, "phrase": "state-of-the-art_detailed_models"}, {"score": 0.002125059113175028, "phrase": "advanced_mbdoe_techniques"}], "paper_keywords": ["Model-based experiment design", " Diabetes mellitus", " Physiological model", " Parameter identification", " Biomedical engineering", " Mathematical modelling"], "paper_abstract": "How to design a clinical test aimed at identifying in the safest, most precise and quickest way the subject-specific parameters of a detailed model of glucose homeostasis in type 1 diabetes is the topic of this article. Recently, standard techniques of model-based design of experiments (MBDoE) for parameter identification have been proposed to design clinical tests for the identification of the model parameters for a single type 1 diabetic individual. However, standard MBDoE is affected by some limitations. In particular, the existence of a structural mismatch between the responses of the subject and that of the model to be identified, together with initial uncertainty in the model parameters may lead to design clinical tests that are sub-optimal (scarcely informative) or even unsafe (the actual response of the subject might be hypoglycaemic or strongly hyperglycaemic). The integrated use of two advanced MBDoE techniques (online model-based redesign of experiments and backoff-based MBDoE) is proposed in this article as a way to effectively tackle the above issue. Online model-based experiment redesign is utilised to exploit the information embedded in the experimental data as soon as the data become available, and to adjust the clinical test accordingly whilst the test is running. Backoff-based MBDoE explicitly accounts for model parameter uncertainty, and allows one to plan a test that is both optimally informative and safe by design. The effectiveness and features of the proposed approach are assessed and critically discussed via a simulated case study based on state-of-the-art detailed models of glucose homeostasis. It is shown that the proposed approach based on advanced MBDoE techniques allows defining safe, informative and subject-tailored clinical tests for model identification, with limited experimental effort.", "paper_title": "Optimal design of clinical tests for the identification of physiological models of type 1 diabetes in the presence of model mismatch", "paper_id": "WOS:000287855600002"}