{"auto_keywords": [{"score": 0.03557462726039927, "phrase": "tcp"}, {"score": 0.00481495049065317, "phrase": "flow-level_tcp_network_models"}, {"score": 0.004495738533629062, "phrase": "network_behavior"}, {"score": 0.004412397783369937, "phrase": "packet-level_simulations"}, {"score": 0.004303664701305258, "phrase": "network_protocols"}, {"score": 0.004210714223341684, "phrase": "typical_large_scales"}, {"score": 0.004184526032558792, "phrase": "simulated_systems"}, {"score": 0.0040686720114175, "phrase": "network_simulations"}, {"score": 0.0035912243639260846, "phrase": "published_results"}, {"score": 0.003491739070201915, "phrase": "scientifically_meaningful_results"}, {"score": 0.0033950003609696227, "phrase": "state-of-the-art_flow-level_network_models"}, {"score": 0.0031010917912277845, "phrase": "critical_method"}, {"score": 0.0030625949549620475, "phrase": "model_refutation"}, {"score": 0.0030057412068719646, "phrase": "scientific_activity"}, {"score": 0.002913313839588914, "phrase": "invalid_results"}, {"score": 0.0028951712636442906, "phrase": "careful_analysis"}, {"score": 0.002850306175044223, "phrase": "fundamental_flaws"}, {"score": 0.002702887319160534, "phrase": "new_model"}, {"score": 0.00260342914245402, "phrase": "previously_proposed_models"}, {"score": 0.002415331146563814, "phrase": "unexpected_behaviors"}, {"score": 0.0023337115873889396, "phrase": "enlightening_lessons"}, {"score": 0.002268983004273332, "phrase": "model_validation"}, {"score": 0.0021049977753042253, "phrase": "invalidation_approach"}], "paper_keywords": ["Grid and cloud computing simulation", " validation", " scalability", " SimGrid"], "paper_abstract": "Researchers in the area of grid/cloud computing perform many of their experiments using simulations that must capture network behavior. In this context, packet-level simulations, which are widely used to study network protocols, are too costly given the typical large scales of simulated systems and applications. An alternative is to implement network simulations with less costly flow-level models. Several flow-level models have been proposed and implemented in grid/cloud simulators. Surprisingly, published validations of these models, if any, consist of verifications for only a few simple cases. Consequently, even when they have been used to obtain published results, the ability of these simulators to produce scientifically meaningful results is in doubt. This work evaluates these state-of-the-art flow-level network models of TCP communication via comparison to packet-level simulation. While it is straightforward to show cases in which previously proposed models lead to good results, instead we follow the critical method, which places model refutation at the center of the scientific activity, and we systematically seek cases that lead to invalid results. Careful analysis of these cases reveals fundamental flaws and also suggests improvements. One contribution of this work is that these improvements lead to a new model that, while far from being perfect, improves upon all previously proposed models in the context of simulation of grids or clouds. A more important contribution, perhaps, is provided by the pitfalls and unexpected behaviors encountered in this work, leading to a number of enlightening lessons. In particular, this work shows that model validation cannot be achieved solely by exhibiting (possibly many) \"good cases.\" Confidence in the quality of a model can only be strengthened through an invalidation approach that attempts to prove the model wrong.", "paper_title": "On the Validity of Flow-level TCP Network Models for Grid and Cloud Simulations", "paper_id": "WOS:000329124400003"}