{"auto_keywords": [{"score": 0.03626824828961385, "phrase": "spm"}, {"score": 0.004227064760262924, "phrase": "extended_control_flow_graph"}, {"score": 0.004060986196931943, "phrase": "application's_instruction_flow"}, {"score": 0.0038431888954930083, "phrase": "directed_graph"}, {"score": 0.003306559295382181, "phrase": "refined_greedy_algorithm"}, {"score": 0.0032571885279065126, "phrase": "ecfg._an_experiment"}, {"score": 0.002816246391862638, "phrase": "lesser_energy"}, {"score": 0.0026516890043911836, "phrase": "previous_research"}, {"score": 0.0025859868507329634, "phrase": "control_flow_graph"}, {"score": 0.002315658491366464, "phrase": "application's_execution_time"}, {"score": 0.0021049977753042253, "phrase": "non-spm_environment"}], "paper_keywords": ["Scratch-pad memory", " extend control flow graph"], "paper_abstract": "A Scratch-Pad memory (SPM) allocation method to improve the performance of a specified application while reducing its energy consumption is presented in this paper. Integrated in the design is an extended control flow graph (ECFG) built directly from the application's instruction flow. The application of the design is transformed into a directed graph that consists of nodes and relationships. Likewise, to provide a solution in decreasing the overhead of moving nodes to SPM, the design is enhanced with a refined greedy algorithm based on ECFG. An experiment is conducted to prove the feasibility and efficiency of the method. The results indicate that the method indeed improves performance by an average of 11% and consumes lesser energy by an average of 28%. This is in comparison to previous research which based on the control flow graph (CFG) method. The latter was discovered to have disregarded the relationships of nodes. In conclusion, the application's execution time and energy consumption were reduced by an average up to 56% and 69% respectively, compared to a non-SPM environment.", "paper_title": "EXTENDED CONTROL FLOW GRAPH BASED PERFORMANCE AND ENERGY CONSUMPTION OPTIMIZATION USING SCRATCH-PAD MEMORY", "paper_id": "WOS:000266614200005"}