{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "semilump_filter"}, {"score": 0.0490219456339607, "phrase": "hybrid_dielectrics"}, {"score": 0.008496290932156838, "phrase": "ltcc_technology"}, {"score": 0.004761494398041158, "phrase": "ltcc"}, {"score": 0.004118026552723285, "phrase": "promising_electrical_properties"}, {"score": 0.004027031316965272, "phrase": "multilayer_architecture"}, {"score": 0.0037869901077566526, "phrase": "low-k_dielectric"}, {"score": 0.0031490944606172152, "phrase": "low-permittivity_dielectric"}, {"score": 0.0027535633837592597, "phrase": "novel_semilump_filter"}, {"score": 0.0024897902536499005, "phrase": "prototype_measurement"}, {"score": 0.0024075916292945715, "phrase": "simulation_results"}, {"score": 0.0021049977753042253, "phrase": "promising_electrical_performance"}], "paper_keywords": ["LTCC hybrid", " semilump filter"], "paper_abstract": "In this article, a semilump filter was implemented by using low-temperature C-fired ceramic (LTCC) technology with hybrid dielectrics to miniaturize the size and to attain the promising electrical properties. In the multilayer architecture, the striplines (inductors) were realized on the low-K dielectric (K = 7.8) and capacitors were realized on the high-K (K = 27) dielectric. Capacitor implemented by high-permittivity dielectrics is shown to be very efficient in decreasing dimensions of semilump filter with low-permittivity dielectric. Inductor implemented by low-permittivity dielectric is shown to be enhanced the Q-factor of the resonators. The design of the novel semilump filter has been developed and the prototypes fabricated by using the LTCC technology with hybrid dielectrics. The results of prototype measurement agree very well with the simulation results. The investigation proves the capability of the LTCC technology with hybrid dielectrics that is able to effectively miniaturize the filter and still attain the promising electrical performance of filters.", "paper_title": "Approaches for designing semilump filter utilizing LTCC with hybrid dielectrics", "paper_id": "WOS:000251648900009"}