{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "distributed_caching"}, {"score": 0.004365881789903319, "phrase": "traditional_client-server_architecture"}, {"score": 0.0037915057447460133, "phrase": "proper_incentive_schemes"}, {"score": 0.003674461410107989, "phrase": "peers'_contributions"}, {"score": 0.0034510635632071978, "phrase": "proper_videos"}, {"score": 0.003279559293934528, "phrase": "required_data"}, {"score": 0.0032539388572032563, "phrase": "content_providers"}, {"score": 0.003056029284235528, "phrase": "content_server"}, {"score": 0.0029500270981001058, "phrase": "practical_mechanism"}, {"score": 0.002622465142275264, "phrase": "incentive_scheme"}, {"score": 0.0026019646284747024, "phrase": "peers'_caching_behaviors"}, {"score": 0.0025215486544004134, "phrase": "optimization_framework"}, {"score": 0.0024822751900485758, "phrase": "optimal_reward_price"}, {"score": 0.0023680783509308525, "phrase": "content_provider's_operational_cost"}, {"score": 0.0023220573674955776, "phrase": "close_form_solutions"}, {"score": 0.0022948742034852917, "phrase": "asymptotic_system"}, {"score": 0.002180702259644951, "phrase": "extensive_simulations"}], "paper_keywords": ["P2P-VoD", " incentive", " pricing", " mean field", " optimization"], "paper_abstract": "Peer-to-peer (P2P) systems rely on peers' cooperation to provide a more robust and scalable service as compared to the traditional client-server architecture. However, the peers might be selfish in nature-they would like to receive services from others, but would not like to contribute their own resources by default. To conquer this problem, proper incentive schemes are needed so as to stimulate the peers' contributions. In particular, in P2P video-on-demand (VoD) systems, peers need to distributively cache the proper videos so as to mutually upload and help each other to acquire the required data. Content providers of P2P-VoD services want to incentivize peers to do so and alleviate the workload of the content server. In this paper, we design a practical mechanism to incentivize distributed caching in such systems, under which the peers are rewarded based on the popularity of the video they cache. We characterize the impact of this incentive scheme on peers' caching behaviors. In particular, we formulate an optimization framework to decide the optimal reward price for each video so as to keep enough replicas and minimize the content provider's operational cost. We first derive close form solutions in an asymptotic system, and then extend our results to be adaptive to various practical issues. Via extensive simulations, we validate the effectiveness and efficiency of our incentive scheme.", "paper_title": "Distributed Caching via Rewarding: An Incentive Scheme Design in P2P-VoD Systems", "paper_id": "WOS:000334672200009"}