{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "visual_metaphors"}, {"score": 0.004663396040465122, "phrase": "information_visualization"}, {"score": 0.004038076978795421, "phrase": "external_visual_metaphors"}, {"score": 0.003973971215091993, "phrase": "user's_internal_knowledge_representations"}, {"score": 0.0036488111139918135, "phrase": "visual_and_verbal_metaphor"}, {"score": 0.0035527409334589317, "phrase": "tree_visualizations"}, {"score": 0.0034777028461723198, "phrase": "simple_data_comprehension_questions"}, {"score": 0.0033680968918579717, "phrase": "node-link_diagram"}, {"score": 0.0032272929113113203, "phrase": "verbal_metaphor"}, {"score": 0.0027791193706247267, "phrase": "visual_metaphor"}, {"score": 0.00232995025271599, "phrase": "user's_ability"}, {"score": 0.0022928991183989115, "phrase": "task_questions"}, {"score": 0.0022087165619569006, "phrase": "first_step"}, {"score": 0.0021390191069313945, "phrase": "user_understanding"}, {"score": 0.0021049977753042253, "phrase": "significant_implications"}], "paper_keywords": ["Cognition", " visualization theory", " metaphors", " hierarchies", " evaluation"], "paper_abstract": "The nature of an information visualization can be considered to lie in the visual metaphors it uses to structure information. The process of understanding a visualization therefore involves an interaction between these external visual metaphors and the user's internal knowledge representations. To investigate this claim, we conducted an experiment to test the effects of visual and verbal metaphor on the understanding of tree visualizations. Participants answered simple data comprehension questions while viewing either a treemap or a node-link diagram. Questions were worded to reflect a verbal metaphor that was either compatible or incompatible with the visualization a participant was using. The results (based on correctness and response time) suggest that the visual metaphor indeed affects how a user derives information from a visualization. Additionally, we found that the degree to which a user is affected by the metaphor is strongly correlated with the user's ability to answer task questions correctly. These findings are a first step towards illuminating how visual metaphors shape user understanding and have significant implications for the evaluation, application, and theory of visualization.", "paper_title": "The Shaping of Information by Visual Metaphors", "paper_id": "WOS:000260384700019"}