{"auto_keywords": [{"score": 0.04847641444951565, "phrase": "online_customer_communities"}, {"score": 0.018485531690755834, "phrase": "information_adoption"}, {"score": 0.008986934833400318, "phrase": "online_consumer_reviews"}, {"score": 0.007131060810516251, "phrase": "argument_quality"}, {"score": 0.00481495049065317, "phrase": "electronic_word"}, {"score": 0.004682708592184678, "phrase": "online_opinions"}, {"score": 0.004625100791402994, "phrase": "purpose_-_web-based_technologies"}, {"score": 0.004415284957189386, "phrase": "easily_accessible_information"}, {"score": 0.004347473906950474, "phrase": "online_consumption_decision"}, {"score": 0.004163069673268028, "phrase": "opinion_seekers"}, {"score": 0.003949592017305331, "phrase": "dual-process_theories"}, {"score": 0.003913067698038614, "phrase": "information_adoption_model"}, {"score": 0.003793732650000069, "phrase": "online_opinion_seekers"}, {"score": 0.00357689487273538, "phrase": "online_customer_community"}, {"score": 0.0035548008271253607, "phrase": "openrice.com"}, {"score": 0.003393373193137233, "phrase": "virtual_sharing_platform"}, {"score": 0.0031894452350840147, "phrase": "research_model"}, {"score": 0.0028526747080263757, "phrase": "solely_information_usefulness"}, {"score": 0.002826265478343143, "phrase": "closer_look"}, {"score": 0.0026978319081381145, "phrase": "previous_research"}, {"score": 0.002575219653364536, "phrase": "one's_business"}, {"score": 0.0024811443887080543, "phrase": "web_site"}, {"score": 0.0022467024793003812, "phrase": "theory-driven_information_adoption_model"}, {"score": 0.0021049977753042253, "phrase": "important_motivating_factors"}], "paper_keywords": ["internet", " electronic commerce", " consumer behaviour"], "paper_abstract": "Purpose - Web-based technologies have created numerous opportunities for electronic word-of-mouth (eWOM) communication. This phenomenon impacts online retailers as this easily accessible information could greatly affect the online consumption decision. The purpose of this paper is to examine the extent to which opinion seekers are willing to accept and adopt online consumer reviews and which factors encourage adoption. Design/methodology/approach - Using dual-process theories, an information adoption model was developed to examine the factors affecting information adoption of online opinion seekers in online customer communities. The model was tested empirically using a sample of 154 users who had experience within the online customer community, Openrice.com. Users were required to complete a survey regarding the online consumer reviews received from the virtual sharing platform. Findings - The paper found comprehensiveness and relevance to be the most effective components of the argument quality construct of the research model, making them key influencers of information adoption. Research limitations/implications - Only 46 per cent of the variance is explained by the constructs due to its intentional simplicity. This would indicate that there are more actors in motivating information adoption than solely information usefulness. A closer look should be taken at the effectiveness of some of the other motivational factors suggested in the previous research on this topic. Practical implications - The paper outlines ways to effectively promote one's business or cause through online customer communities, as well as general tips for web site and forum moderators for facilitating such presentation in a manner useful to the members of their online communities. Originality/value - This paper is one of the first to develop and empirically test a theory-driven information adoption model for opinion seekers in online customer communities. It also uniquely breaks down and tests the components of argument quality to discern the important motivating factors.", "paper_title": "The impact of electronic word-of-mouth - The adoption of online opinions in online customer communities", "paper_id": "WOS:000257816500003"}