{"auto_keywords": [{"score": 0.04789244959486771, "phrase": "mbs"}, {"score": 0.005714591693848199, "phrase": "concave_rectilinear_blocks"}, {"score": 0.00481495049065317, "phrase": "block_sequence"}, {"score": 0.0047313464483758364, "phrase": "general_floorplanning"}, {"score": 0.004703800746950553, "phrase": "arbitrarily_shaped_rectilinear_blocks"}, {"score": 0.004662781189062896, "phrase": "new_nonslicing_floorplan_representation"}, {"score": 0.004622117681584223, "phrase": "moving_block_sequence"}, {"score": 0.004197462442457156, "phrase": "tetris"}, {"score": 0.004112503056745914, "phrase": "extra_constraints"}, {"score": 0.004064726810375669, "phrase": "solution_spaces"}, {"score": 0.003959241745942114, "phrase": "evolutionary_algorithms"}, {"score": 0.0037563823007675766, "phrase": "rectilinear_blocks"}, {"score": 0.0036588697886897757, "phrase": "special_structure"}, {"score": 0.0036344128315405275, "phrase": "good_performance"}, {"score": 0.0035224543064259553, "phrase": "uniform_form"}, {"score": 0.0035019219604505904, "phrase": "theoretical_analyses"}, {"score": 0.0034612143745796705, "phrase": "computational_cost"}, {"score": 0.003371338242941194, "phrase": "rectangular_blocks"}, {"score": 0.0031337020830262954, "phrase": "new_organizational_evolutionary_algorithm"}, {"score": 0.0031154289937130996, "phrase": "oea"}, {"score": 0.0029730145140038334, "phrase": "intrinsic_properties"}, {"score": 0.0025164138447059023, "phrase": "high_quality_solutions"}, {"score": 0.002338897481852333, "phrase": "soft_rectangular_and_hard_rectilinear_blocks"}, {"score": 0.0022450038337918934, "phrase": "wide_range"}, {"score": 0.002186639315960482, "phrase": "large-scale_problems"}, {"score": 0.0021422934905256956, "phrase": "specific_experiments"}, {"score": 0.0021049977753042253, "phrase": "key_component"}], "paper_keywords": ["Evolutionary algorithms", " floorplanning", " moving block sequence", " organization", " very large scale integration"], "paper_abstract": "A new nonslicing floorplan representation, the moving block sequence (MBS), is proposed in this paper. Our idea of the MBS originates from the observation that placing blocks on a chip has some similarities to playing the game, Tetris (R). Since no extra constraints are exerted on solution spaces, the MBS is not only useful for evolutionary algorithms, but also for dealing with rectangular, convex rectilinear, and concave rectilinear blocks, similarly and simultaneously, without partitioning rectilinear blocks into subblocks. This is owed to a special structure designed for recording the information of both convex and concave rectilinear blocks in a uniform form. Theoretical analyses show that the computational cost of transforming an MBS to a floorplan with rectangular blocks, in terms of the number of blocks, is between linear and quadratic. Furthermore, as a follow-up of our previous works, a new organizational evolutionary algorithm (OEA) based on the MBS (MBS-OEA) is proposed. With the intrinsic properties of the MBS in mind, three new esvolutionary operators are designed in the MBS-OEA. To test the performance of the MBS-OEA, benchmarks with hard rectangular, soft rectangular, and hard rectilinear blocks are used. The number of blocks in these benchmarks varies from 9 to 300. Also, the MBS-OEA and several well-designed existing algorithms are compared. The results show that the MBS-OEA can find high quality solutions for various problems. Additionally, the MBS-OEA shows a good performance in solving the problems with 300 hard rectangular blocks, 100 soft rectangular blocks, and 100 hybrid blocks, including both soft rectangular and hard rectilinear blocks. This illustrates that the MBS-OEA is not only suitable for solving a wide range of problems, but also competent for solving large-scale problems. Finally, a set of specific experiments is designed to identify the key component that is mainly responsible for the good performance of the MBS-OEA.", "paper_title": "Moving Block Sequence and Organizational Evolutionary Algorithm for General Floorplanning With Arbitrarily Shaped Rectilinear Blocks", "paper_id": "WOS:000260046900008"}