{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "resource_allocation_decisions"}, {"score": 0.0042859292226559535, "phrase": "lthc"}, {"score": 0.004067152645111547, "phrase": "home_care_services"}, {"score": 0.0038820411362656803, "phrase": "acute_care_facilities"}, {"score": 0.003093054709625219, "phrase": "integer-programming_models"}, {"score": 0.0029349892964423197, "phrase": "solution_properties"}, {"score": 0.002566685388128598, "phrase": "first-in-first-out_policy"}, {"score": 0.002435453488008121, "phrase": "spread_policy"}, {"score": 0.002310915790114425, "phrase": "numerical_experiments"}, {"score": 0.0022708315711029423, "phrase": "operating_guidelines"}, {"score": 0.002244494905883452, "phrase": "specific_scenarios"}, {"score": 0.002154693685426657, "phrase": "current_lthc_admission_policy"}, {"score": 0.0021049977753042253, "phrase": "major_health-care_organization"}], "paper_keywords": ["resource allocation", " long term home care", " equity", " efficiency", " integer-programming"], "paper_abstract": "In this paper we analyse resource allocation decisions in a Long-Term Home Care (LTHC) program. LTHC programs provide various long-term in-home care services to patients who have been discharged from acute care facilities (e. g. hospitals), residential care facilities (e. g. nursing homes) and assisted living facilities. Two metrics, efficiency and equity, are used to measure the performance of the system. We develop integer-programming models to optimize these metrics, and we derive solution properties that provide insights into the trade-offs between efficiency and equity. We compare our optimal solutions to several well-known allocation policies used in practice such as the first-in-first-out policy, the shortest processing time policy and the spread policy. We compare our optimal and heuristic solutions through a set of numerical experiments to establish operating guidelines for specific scenarios. Finally, we examine the current LTHC admission policy used at a major health-care organization, and we evaluate the performance of this policy in terms of both efficiency and equity.", "paper_title": "Efficiency and Equity in Healthcare: An Analysis of Resource Allocation Decisions in a Long-Term Home Care Setting", "paper_id": "WOS:000371882400001"}