{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "composite_preferences"}, {"score": 0.030407153320751706, "phrase": "query_personalization"}, {"score": 0.0047707093928203, "phrase": "people's_preferences"}, {"score": 0.0046834372388970405, "phrase": "varying_levels"}, {"score": 0.004492841495994535, "phrase": "partial_or_imperfect_knowledge"}, {"score": 0.004309968592440261, "phrase": "general_class"}, {"score": 0.003929689573550262, "phrase": "recent_thrillers"}, {"score": 0.0038935506745975835, "phrase": "al_pacino"}, {"score": 0.0035335154419206634, "phrase": "query_results"}, {"score": 0.0034210342328868017, "phrase": "one's_preferences"}, {"score": 0.0033739270918502285, "phrase": "preference_network"}, {"score": 0.002765636101369536, "phrase": "efficient_algorithms"}, {"score": 0.0027275289970185015, "phrase": "relevant_preferences"}, {"score": 0.0026284507395498897, "phrase": "personalized_queries"}, {"score": 0.002266765479420981, "phrase": "proposed_preference_model"}, {"score": 0.0021049977753042253, "phrase": "simpler_preference_representations"}], "paper_keywords": ["Theory", " Algorithms", " Experimentation", " Preference modeling", " preference networks", " personalization"], "paper_abstract": "People's preferences are expressed at varying levels of granularity and detail as a result of partial or imperfect knowledge. One may have some preference for a general class of entities, for example, liking comedies, and another one for a fine-grained, specific class, such as disliking recent thrillers with Al Pacino. In this article, we are interested in capturing such complex, multi-granular preferences for personalizing database queries and in studying their impact on query results. We organize the collection of one's preferences in a preference network ( a directed acyclic graph), where each node refers to a subclass of the entities that its parent refers to, and whenever they both apply, more specific preferences override more generic ones. We study query personalization based on networks of preferences and provide efficient algorithms for identifying relevant preferences, modifying queries accordingly, and processing personalized queries. Finally, we present results of both synthetic and real-user experiments, which: ( a) demonstrate the efficiency of our algorithms, (b) provide insight as to the appropriateness of the proposed preference model, and ( c) show the benefits of query personalization based on composite preferences compared to simpler preference representations.", "paper_title": "Personalizing Queries Based on Networks of Composite Preferences", "paper_id": "WOS:000277925600006"}