{"auto_keywords": [{"score": 0.049636680610423214, "phrase": "information_systems"}, {"score": 0.036806523741631986, "phrase": "difference_scores"}, {"score": 0.03394349817157487, "phrase": "implicit_assumptions"}, {"score": 0.00481495049065317, "phrase": "score_issues"}, {"score": 0.0038708810091769856, "phrase": "indirect_measures"}, {"score": 0.00372965096877929, "phrase": "methodological_issues"}, {"score": 0.003140401552000472, "phrase": "data_characteristics"}, {"score": 0.0030117065110966414, "phrase": "false_assumptions"}, {"score": 0.002956209594959227, "phrase": "erroneous_conclusions"}, {"score": 0.002744234034162797, "phrase": "research_model"}, {"score": 0.0025355968118803956, "phrase": "possible_interplay"}, {"score": 0.0025121156016001886, "phrase": "theoretical_concepts"}, {"score": 0.0022571810910697013, "phrase": "polynomial_regression_analysis"}], "paper_keywords": ["Difference scores", " indirect measures", " polynomial regression analysis", " IS SERVQUAL"], "paper_abstract": "A number of models and theories in information systems research include concepts of a match between two variables or states. The development of measures for this concept can present problems, because decisions must be made about the nature of the comparison. Should indirect measures of the match be employed, then methodological issues arise about how to best handle the measure when testing the model. Difference scores are commonly used to measure a match between variables or states in IS research, but these have implicit assumptions about the theory and data characteristics that are often false. Not unexpectedly, false assumptions can lead to erroneous conclusions about the relationships among the variables that are used to determine a match in a research model. The implicit assumptions restrict the form of the relationships and limit the IS researchers ability to understand the possible interplay among theoretical concepts. We suggest some guidelines for the formation and testing of models that measure the match. In addition, we recommend polynomial regression analysis as one means of analyzing the more complex relationships in IS studies. We then use an IS service quality example to illustrate the issues involved in the use of matching variables and make suggestions with regard to using or avoiding difference scores.", "paper_title": "RESOLVING DIFFERENCE SCORE ISSUES IN INFORMATION SYSTEMS RESEARCH", "paper_id": "WOS:000272211500011"}