{"auto_keywords": [{"score": 0.04897995717051972, "phrase": "ca"}, {"score": 0.0076512020677842515, "phrase": "ra"}, {"score": 0.00481495049065317, "phrase": "single_point"}, {"score": 0.0047357308775561255, "phrase": "certificate_authority"}, {"score": 0.004657839911846125, "phrase": "manet"}, {"score": 0.004611669085594069, "phrase": "decentralized_solution"}, {"score": 0.004490842671590769, "phrase": "different_clusters"}, {"score": 0.004174577560750366, "phrase": "ddmz"}, {"score": 0.004038249989123055, "phrase": "ca_node"}, {"score": 0.004011521305179232, "phrase": "potential_attacks"}, {"score": 0.003643185395780667, "phrase": "clusters'_sizes"}, {"score": 0.0035712919163869176, "phrase": "clusters'_services"}, {"score": 0.0034317185678527672, "phrase": "channel_collision"}, {"score": 0.0031581587465429593, "phrase": "mechanism_design"}, {"score": 0.003095806891672679, "phrase": "single_trusted_node"}, {"score": 0.0029160193808720016, "phrase": "confident_community"}, {"score": 0.002746644177161797, "phrase": "cluster's_services"}, {"score": 0.0026745503978347143, "phrase": "ra_selection_algorithm"}, {"score": 0.002510801832283111, "phrase": "directional_antenna"}, {"score": 0.0024125742420201, "phrase": "security_risk"}, {"score": 0.00234142781099973, "phrase": "robust_ddmz."}, {"score": 0.0022053535889915914, "phrase": "nonzero-sum_noncooperative_game"}, {"score": 0.0021403049512708494, "phrase": "empirical_results"}], "paper_keywords": ["MANET security", " mechanism design", " certificate authority", " clustering"], "paper_abstract": "To avoid the single point of failure for the certificate authority (CA) in MANET, a decentralized solution is proposed where nodes are grouped into different clusters. Each cluster should contain at least two confident nodes. One is known as CA and the another as register authority RA. The Dynamic Demilitarized Zone (DDMZ) is proposed as a solution for protecting the CA node against potential attacks. It is formed from one or more RA node. The problems of such a model are: (1) Clusters with one confident node, CA, cannot be created and thus clusters' sizes are increased which negatively affect clusters' services and stability. (2) Clusters with high density of RA can cause channel collision at the CA. (3) Clusters' lifetime are reduced since RA monitors are always launched (i.e., resource consumption). In this paper, we propose a model based on mechanism design that will allow clusters with single trusted node (CA) to be created. Our mechanism will motivate nodes that do not belong to the confident community to participate by giving them incentives in the form of trust, which can be used for cluster's services. To achieve this goal, a RA selection algorithm is proposed that selects nodes based on a predefined selection criteria function and location (i.e., using directional antenna). Such a model is known as moderate. Based on the security risk, more RA nodes must be added to formalize a robust DDMZ. Here, we consider the tradeoff between security and resource consumption by formulating the problem as a nonzero-sum noncooperative game between the CA and attacker. Finally, empirical results are provided to support our solutions.", "paper_title": "A Secure Mechanism Design-Based and Game Theoretical Model for MANETs", "paper_id": "WOS:000275445400002"}