{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "access_control_policies"}, {"score": 0.015593671747695013, "phrase": "policy_integration"}, {"score": 0.004660702714929615, "phrase": "crucial_requirement"}, {"score": 0.004585433265422727, "phrase": "different_access_control_policies"}, {"score": 0.004493045859210086, "phrase": "collaborative_applications"}, {"score": 0.004278807087784626, "phrase": "dynamic_large-scale_collaborations"}, {"score": 0.003976373766630598, "phrase": "important_step"}, {"score": 0.003771282384646587, "phrase": "policy_similarity"}, {"score": 0.0032434583977423996, "phrase": "existing_approaches"}, {"score": 0.0029895074299598275, "phrase": "special_cases"}, {"score": 0.0029172611440429963, "phrase": "suitable_approach"}, {"score": 0.002881793492919646, "phrase": "policy_analysis"}, {"score": 0.0028236336891860592, "phrase": "different_approaches"}, {"score": 0.002634506575564286, "phrase": "analysis_query"}, {"score": 0.002529213370528279, "phrase": "key_component"}, {"score": 0.002388817995161952, "phrase": "policy_analyzer"}, {"score": 0.00224701149477484, "phrase": "existing_mtbdd-based_and_sat-solver-based_techniques"}], "paper_keywords": ["Access control", " XACML", " Policy analysis"], "paper_abstract": "Policy integration and inter-operation is often a crucial requirement when parties with different access control policies need to participate in collaborative applications and coalitions. Such requirement is even more difficult to address for dynamic large-scale collaborations, in which the number of access control policies to analyze and compare can be quite large. An important step in policy integration and inter-operation is to analyze the similarity of policies. Policy similarity can sometimes also be a pre-condition for establishing a collaboration, in that a party may enter a collaboration with another party only if the policies enforced by the other party match or are very close to its own policies. Existing approaches to the problem of analyzing and comparing access control policies are very limited, in that they only deal with some special cases. By recognizing that a suitable approach to the policy analysis and comparison requires combining different approaches, we propose in this paper a comprehensive environment-EXAM. The environment supports various types of analysis query, which we categorize in the paper. A key component of such environment, on which we focus in the paper, is the policy analyzer able to perform several types of analysis. Specifically, our policy analyzer combines the advantages of existing MTBDD-based and SAT-solver-based techniques. Our experimental results, also reported in the paper, demonstrate the efficiency of our analyzer.", "paper_title": "EXAM: a comprehensive environment for the analysis of access control policies", "paper_id": "WOS:000280893000002"}