{"auto_keywords": [{"score": 0.036710449636736135, "phrase": "initial_population"}, {"score": 0.00481495049065317, "phrase": "similarity_graphs"}, {"score": 0.004778923541463994, "phrase": "spectral_graph_clustering"}, {"score": 0.00419016653753787, "phrase": "novel_spectral_graph_clustering_method"}, {"score": 0.004112175423546628, "phrase": "genetic_algorithms"}, {"score": 0.003916098498242888, "phrase": "better_clustering_results"}, {"score": 0.0038144050983900286, "phrase": "constructed_similarity_graphs"}, {"score": 0.003743381699791, "phrase": "fitness_function"}, {"score": 0.0034332736827447654, "phrase": "nearest_neighbour_graphs"}, {"score": 0.003021141590548526, "phrase": "evolutionary_process"}, {"score": 0.002987236799291296, "phrase": "algorithm's_performance"}, {"score": 0.0026483647033436674, "phrase": "proposed_method"}, {"score": 0.002437907960209364, "phrase": "dimensionality_reduction"}, {"score": 0.0024196235355517827, "phrase": "classification_problems"}, {"score": 0.002347843727281585, "phrase": "traditional_dances_dataset"}, {"score": 0.002295406551990453, "phrase": "evaluation_methods"}, {"score": 0.0022610992177831643, "phrase": "internal_and_external_clustering_criteria"}, {"score": 0.0021775526153883355, "phrase": "proposed_algorithm"}, {"score": 0.0021530945641993152, "phrase": "promising_results"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Spectral clustering", " Similarity graphs", " Evolutionary algorithms"], "paper_abstract": "Spectral graph clustering has become very popular in recent years, due to the simplicity of its implementation as well as the performance of the method, in comparison with other popular ones. In this article, we propose a novel spectral graph clustering method that makes use of genetic algorithms, in order to optimise the structure of a graph and achieve better clustering results. We focus on evolving the constructed similarity graphs, by applying a fitness function (also called objective function), based on some of the most commonly used clustering criteria. The construction of the initial population is based on nearest neighbour graphs, some variants of them and some arbitrary ones, represented as matrices. Each one of these matrices is transformed properly in order to form a chromosome and be used in the evolutionary process. The algorithm's performance greatly depends on the way that the initial population is created, as suggested by the various techniques that have been examined for the purposes of this article. The most important advantage of the proposed method is its generic nature, as it can be applied to several problems, that can be modeled as graphs, including clustering, dimensionality reduction and classification problems. Experiments have been conducted on a traditional dances dataset and on other various multidimensional datasets, using evaluation methods based on both internal and external clustering criteria, in order to examine the performance of the proposed algorithm, providing promising results. (C) 2015 Elsevier B.V. All rights reserved.", "paper_title": "Spectral clustering and semi-supervised learning using evolving similarity graphs", "paper_id": "WOS:000357469500046"}