{"auto_keywords": [{"score": 0.004766388573192505, "phrase": "holistic_face_recognition_algorithms"}, {"score": 0.0043506951029334984, "phrase": "feature-based_algorithms"}, {"score": 0.004073113268289532, "phrase": "feature-based_algorithm"}, {"score": 0.003911135156992, "phrase": "novel_keypoint_detection_technique"}, {"score": 0.0036988415150699945, "phrase": "shape_variation"}, {"score": 0.0033249197885613937, "phrase": "highly_descriptive_pose_invariant_features"}, {"score": 0.0029735479904284675, "phrase": "uniform_grid"}, {"score": 0.0028697077879305064, "phrase": "gallery_face"}, {"score": 0.002797757576619329, "phrase": "pca_subspace"}, {"score": 0.0027000395818027366, "phrase": "matching_features"}, {"score": 0.0023659694724243764, "phrase": "sift_features"}, {"score": 0.002181227522730908, "phrase": "proposed_algorithm"}], "paper_keywords": ["feature-based face recognition", " keypoint detection", " invariant features", " feature-level fusion"], "paper_abstract": "Holistic face recognition algorithms are sensitive to expressions, illumination, pose, occlusions and makeup. On the other hand, feature-based algorithms are robust to such variations. In this paper, we present a feature-based algorithm for the recognition of textured 3D faces. A novel keypoint detection technique is proposed which can repeatably identify keypoints at locations where shape variation is high in 3D faces. Moreover, a unique 3D coordinate basis can be defined locally at each keypoint facilitating the extraction of highly descriptive pose invariant features. A 3D feature is extracted by fitting a surface to the neighborhood of a keypoint and sampling it on a uniform grid. Features from a probe and gallery face are projected to the PCA subspace and matched. The set of matching features are used to construct two graphs. The similarity between two faces is measured as the similarity between their graphs. In the 2D domain, we employed the SIFT features and performed fusion of the 2D and 3D features at the feature and score-level. The proposed algorithm achieved 96.1% identification rate and 98.6% verification rate on the complete FRGC v2 data set.", "paper_title": "Keypoint detection and local feature matching for textured 3D face recognition", "paper_id": "WOS:000255193500001"}