{"auto_keywords": [{"score": 0.025058379676494633, "phrase": "pbc"}, {"score": 0.00481495049065317, "phrase": "authenticated_identity-based_non-interactive_key_distribution"}, {"score": 0.004615202066192795, "phrase": "wireless_sensor_networks"}, {"score": 0.004447201233380302, "phrase": "symmetric_cryptosystems"}, {"score": 0.004151188559520802, "phrase": "perfect_trade-off"}, {"score": 0.003936910716320182, "phrase": "conventional_public_key_and_elliptic_curve_cryptosystems"}, {"score": 0.0034849681064606543, "phrase": "large_keys"}, {"score": 0.002863921785266393, "phrase": "authenticated_identity-based_non-interactive_protocol"}, {"score": 0.0026307897899760383, "phrase": "pbc_primitives"}, {"score": 0.002508073621696602, "phrase": "tinypbc"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Key distribution", " Sensor networks", " Identity-based cryptography", " Pairing-based cryptography", " Efficient implementation"], "paper_abstract": "Key distribution in Wireless Sensor Networks (WSNs) is challenging. Symmetric cryptosystems can perform it efficiently, but they often do not provide a perfect trade-off between resilience and storage. Further, even though conventional public key and elliptic curve cryptosystems are computationally feasible on sensor nodes, protocols based on them are not, as they require the exchange and storage of large keys and certificates, which is expensive. Using Pairing-Based Cryptography (PBC) protocols parties can agree on keys without any interaction. In this work, we (i) show how security in WSNs can be bootstrapped using an authenticated identity-based non-interactive protocol and (ii) present TinyPBC, to our knowledge, the most efficient implementation of PBC primitives for 8, 16 and 32-bit processors commonly found in sensor nodes. TinyPBC is able to compute pairings, the most expensive primitive of PBC, in 1.90 s on ATmega128L, 1.27 s on MSP430 and 0.14 s on PXA27x. (C) 2010 Elsevier B.V. All rights reserved.", "paper_title": "TinyPBC: Pairings for authenticated identity-based non-interactive key distribution in sensor networks", "paper_id": "WOS:000287274400032"}