{"auto_keywords": [{"score": 0.026866475527234396, "phrase": "information_sender_classification"}, {"score": 0.015719716506582538, "phrase": "information_sender"}, {"score": 0.015553775575606972, "phrase": "web_documents"}, {"score": 0.014060929177330936, "phrase": "information_credibility_analysis"}, {"score": 0.0043482604833437735, "phrase": "important_part"}, {"score": 0.003969018740062018, "phrase": "classification_model"}, {"score": 0.0038846843242954935, "phrase": "support_vector_machine"}, {"score": 0.0034332736827447654, "phrase": "top_page"}, {"score": 0.00323625520042892, "phrase": "proposed_method"}, {"score": 0.003066945490483524, "phrase": "information_sender_categories"}, {"score": 0.0028293966058473476, "phrase": "subjective_nature"}, {"score": 0.0021049977753042253, "phrase": "moderate_performance"}], "paper_keywords": ["information management", " project management", " worldwide web", " data analysis"], "paper_abstract": "Purpose - To develop a method for classifying information sender of web documents, which constitutes an important part of information credibility analysis. Design/methodology/approach - Machine learning approach was employed. About 2,000 human-annotated web documents were prepared for training and evaluation. The classification model was based on support vector machine, and the features used for the classification included the title and URL of documents, as well as information of the top page. Findings -With relatively small set of features, the proposed method achieved over 50 per cent accuracy. Research limitations/implications - Some of the information sender categories were found to be more difficult to classify. This is due to the subjective nature of the categories, and further refinement of the categories is needed. Practical implications - When combined with opinion/sentiment analysis techniques, information sender classification allows more profound analysis based on interactions between opinions and senders. Such analysis forms a basis of information credibility analysis. Originality/value - This study formulated the problem of information sender classification. It proposed a method which achieves moderate performance. It also identified some of the issues related to information sender classification.", "paper_title": "Classifying information sender of web documents", "paper_id": "WOS:000255182800006"}