{"auto_keywords": [{"score": 0.030923053106664926, "phrase": "long-range_contacts"}, {"score": 0.00481495049065317, "phrase": "residue-residue_contacts"}, {"score": 0.004767546015485477, "phrase": "random_forest_models"}, {"score": 0.0040491842732233154, "phrase": "random_forest_algorithm-based_models"}, {"score": 0.003969784439380027, "phrase": "residue-residue_contact_maps"}, {"score": 0.003577691211998842, "phrase": "new_amino_acid_residue_contact_propensity_matrix"}, {"score": 0.003472927015404464, "phrase": "seven_amino_acid_groups"}, {"score": 0.003421697038352743, "phrase": "contact_preference"}, {"score": 0.0027925723953701083, "phrase": "benchmark_tests"}, {"score": 0.00263129148531588, "phrase": "independent_set"}, {"score": 0.0025541693207036167, "phrase": "recently_completed_ninth_community_wide_experiment"}], "paper_keywords": [""], "paper_abstract": "Motivation: Protein residue-residue contact prediction can be useful in predicting protein 3D structures. Current algorithms for such a purpose leave room for improvement. Results: We develop ProC_S3, a set of Random Forest algorithm-based models, for predicting residue-residue contact maps. The models are constructed based on a collection of 1490 non-redundant, high-resolution protein structures using > 1280 sequence-based features. A new amino acid residue contact propensity matrix and a new set of seven amino acid groups based on contact preference are developed and used in ProC_S3. ProC_S3 delivers a 3-fold cross-validated accuracy of 26.9% with coverage of 4.7% for top L/5 predictions (L is the number of residues in a protein) of long-range contacts (sequence separation >= 24). Further benchmark tests deliver an accuracy of 29.7% and coverage of 5.6% for an independent set of 329 proteins. In the recently completed Ninth Community Wide Experiment on the Critical Assessment of Techniques for Protein Structure Prediction (CASP9), ProC_S3 is ranked as No. 1, No. 3, and No. 2 accuracies in the top L/5, L/10 and best 5 predictions of long-range contacts, respectively, among 18 automatic prediction servers.", "paper_title": "Predicting residue-residue contacts using random forest models", "paper_id": "WOS:000297860000008"}