{"auto_keywords": [{"score": 0.04845849110410783, "phrase": "physical_game_systems"}, {"score": 0.04062691623728583, "phrase": "behavioral_intention"}, {"score": 0.039299987230067404, "phrase": "physical_tennis_games"}, {"score": 0.0367698002611785, "phrase": "research_model"}, {"score": 0.03128612239904883, "phrase": "perceived_exercise_utility"}, {"score": 0.030938573577618204, "phrase": "perceived_enjoyment"}, {"score": 0.00481495049065317, "phrase": "physical_game_systems_use_behavior"}, {"score": 0.0047057084749407485, "phrase": "recent_proliferation"}, {"score": 0.004598933498016774, "phrase": "entertainment_contexts"}, {"score": 0.004494570360108983, "phrase": "better_understanding"}, {"score": 0.004195418010131832, "phrase": "important_topic"}, {"score": 0.004030157055463817, "phrase": "current_study"}, {"score": 0.003372844338742438, "phrase": "existing_literature"}, {"score": 0.003094306770612843, "phrase": "partial_least_squares"}, {"score": 0.0028715299874549245, "phrase": "significant_influence"}, {"score": 0.0021049977753042253, "phrase": "physical_game_system_development"}], "paper_keywords": [""], "paper_abstract": "With the recent proliferation of physical game systems in entertainment contexts, gaining a better understanding of why users are willing to utilize physical game systems has become an important topic for practitioners and academics. The current study attempts to explore the determinants of behavioral intention pertaining to the use of physical tennis games from the perspective of both hedonic and utilitarian motivations. A research model is proposed based on the existing literature. Data collected from 124 experienced players of physical tennis games are tested against the research model using the partial least squares approach. The results indicate that both perceived exercise utility and perceived enjoyment have a significant influence on behavioral intention. In addition, perceived motion-sensing, challenge, interactivity, ease of use, and design aesthetics are found to have a significant effect on perceived enjoyment. More specifically, perceived motion-sensing is observed to be the antecedent of perceived exercise utility. The findings of this study provide several important implications pertaining to both the research and practice of physical game system development and diffusion.", "paper_title": "Hedonic and Utilitarian Motivations for Physical Game Systems Use Behavior", "paper_id": "WOS:000304325700003"}