{"auto_keywords": [{"score": 0.04589193974665992, "phrase": "design's_architectural_intent"}, {"score": 0.028559947580613393, "phrase": "rtl_properties"}, {"score": 0.013057845904960416, "phrase": "architectural_properties"}, {"score": 0.00481495049065317, "phrase": "formal_property_verification"}, {"score": 0.004229158339021651, "phrase": "formal_properties"}, {"score": 0.004089239912167375, "phrase": "capacity_limitations"}, {"score": 0.004050116768809519, "phrase": "formal_verification"}, {"score": 0.0038415103672370253, "phrase": "rtl."}, {"score": 0.003696550794743764, "phrase": "lower_level_rtl_properties"}, {"score": 0.0035741900278634616, "phrase": "rtl_modules"}, {"score": 0.0035060903664150115, "phrase": "top-down_design_approach"}, {"score": 0.0032777653153451265, "phrase": "architectural_intent"}, {"score": 0.0021049977753042253, "phrase": "legible_form"}], "paper_keywords": ["formal verification", " functional coverage"], "paper_abstract": "It is essential to formally ascertain whether the register-transfer level (RTL) validation effort effectively guarantees the correctness with respect to the design's architectural intent. The design's architectural intent can be expressed in formal properties. However, due to the capacity limitations of formal verification, these architectural properties cannot be directly verified on the RTL. As a result, a set of lower level RTL properties are developed and verified against the RTL modules. In a top-down design approach, the architect would ideally like to formally guarantee the coverage of the architectural intent at the time of creating the specifications for the component RTL modules (that is, before they are passed to the designers for implementation). In this paper, the authors present: 1) a method for checking whether the RTL properties are covering the architectural properties, that is, whether verifying the RTL properties guarantees the correctness of the design's architectural intent; 2) a method to identify which architectural properties are still uncovered, that is, not guaranteed by the RTL properties; and 3) a methodology for representing the gap between the specifications in a legible form.", "paper_title": "Design-intent coverage - A new paradigm for formal property verification", "paper_id": "WOS:000240926700003"}