{"auto_keywords": [{"score": 0.04707862248234479, "phrase": "separating_linear_form"}, {"score": 0.011076716353860606, "phrase": "bit_operations"}, {"score": 0.008360533524860053, "phrase": "integer_coefficients"}, {"score": 0.006672407031359318, "phrase": "worst-case_bit_complexity"}, {"score": 0.006357295357234198, "phrase": "bitsize_o"}, {"score": 0.0060849581805540055, "phrase": "worst_case"}, {"score": 0.00481495049065317, "phrase": "linear_forms"}, {"score": 0.004748740786945996, "phrase": "bivariate_systems"}, {"score": 0.004640398886726948, "phrase": "bivariate_polynomials"}, {"score": 0.004441282284780425, "phrase": "linear_combination"}, {"score": 0.004380188224329844, "phrase": "different_values"}, {"score": 0.004192190072470619, "phrase": "coordinate_system"}, {"score": 0.004153647187175639, "phrase": "algebraic_system"}, {"score": 0.004134508282135594, "phrase": "generic_position"}, {"score": 0.003911578552479064, "phrase": "algebraic_systems"}, {"score": 0.003884567795946283, "phrase": "rational_parameterizations"}, {"score": 0.0036412591100201674, "phrase": "total_degree"}, {"score": 0.003281643474564305, "phrase": "best_known_complexity"}, {"score": 0.0031625006830124512, "phrase": "polylogarithmic_factors"}, {"score": 0.0031045562469735307, "phrase": "bit_complexity"}, {"score": 0.0030617935728586006, "phrase": "simple_polynomial_formulas"}, {"score": 0.0030406329528228433, "phrase": "rational_univariate_representations"}, {"score": 0.002896535621940078, "phrase": "corresponding_rur"}, {"score": 0.0021793396586312543, "phrase": "real_solutions"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Bivariate system", " Separating linear form", " Rational univariate representation"], "paper_abstract": "We address the problem of solving systems of bivariate polynomials with integer coefficients. We first present an algorithm for computing a separating linear form of such systems, that is a linear combination of the variables that takes different values when evaluated at distinct (complex) solutions of the system. In other words, a separating linear form defines a shear of the coordinate system that sends the algebraic system in generic position, in the sense that no two distinct solutions are vertically aligned. The computation of such linear forms is at the core of most algorithms that solve algebraic systems by computing rational parameterizations of the solutions and, moreover, the computation of a separating linear form is the bottleneck of these algorithms, in terms of worst-case bit complexity. Given two bivariate polynomials of total degree at most d with integer coefficients of bitsize at most tau, our algorithm computes a separating linear form of bitsize O (logd) in (O) over tilde (B)(d(8) + d(7)tau) bit operations in the worst case, which decreases by a factor d(2) the best known complexity for this problem (where (O) over tilde refers to the complexity where polylogarithmic factors are omitted and O-B refers to the bit complexity). We then present simple polynomial formulas for the Rational Univariate Representations (RURs) of such systems. This yields that, given a separating linear form of bitsize O (logd), the corresponding RUR can be computed in worst-case bit complexity (O) over tilde (B)(d(7) + d(6)tau) and that its coefficients have bitsize (O) over tilde (d(2) + d tau). We show in addition that isolating boxes of the solutions of the system can be computed from the RUR with (O) over tilde (B)(d(8) + d(7)tau ) bit operations in the worst case. Finally, we show how a RUR can be used to evaluate the sign of a bivariate polynomial (of degree at most d and bitsize at most tau) at one real solution of the system in (O) over tilde (B)(d(8) + d(7)tau) bit operations and at all the Theta(d(2)) real solutions in only O (d) times that for one solution. (C) 2014 Elsevier Ltd. All rights reserved.", "paper_title": "Separating linear forms and Rational Univariate Representations of bivariate systems", "paper_id": "WOS:000347767500005"}