{"auto_keywords": [{"score": 0.0469766824376989, "phrase": "periodic_traces"}, {"score": 0.00481495049065317, "phrase": "behavior_trajectory"}, {"score": 0.004665764181113345, "phrase": "frequent_phenomenon"}, {"score": 0.004346704947011699, "phrase": "entity_behaviors"}, {"score": 0.0042119653427658025, "phrase": "complexity_procedure"}, {"score": 0.00414616342377235, "phrase": "unfixed_period"}, {"score": 0.0040176151419992956, "phrase": "multiple_periodic_traces"}, {"score": 0.003970439654470374, "phrase": "large-scale_events"}, {"score": 0.0037133478610481994, "phrase": "existing_methods"}, {"score": 0.003640938643675543, "phrase": "desirable_efficiency"}, {"score": 0.003299460925313939, "phrase": "efficient_algorithm"}, {"score": 0.00327356326590461, "phrase": "traces_mining"}, {"score": 0.003097865379563127, "phrase": "cluster_analysis_method"}, {"score": 0.0028743610212291727, "phrase": "different_label"}, {"score": 0.00281826552772148, "phrase": "novel_method"}, {"score": 0.0027307746993761035, "phrase": "event_relationship_graph"}, {"score": 0.0026774738852854427, "phrase": "efficient_method"}, {"score": 0.002474447780553576, "phrase": "existing_edge-by-edge_pattern-growth_framework"}, {"score": 0.0022688141624966967, "phrase": "redundant_patterns"}, {"score": 0.002163930783583212, "phrase": "extensive_experimental_studies"}, {"score": 0.002146926767291475, "phrase": "synthetic_data_sets"}], "paper_keywords": ["Event", " Periodic Trace", " Pattern"], "paper_abstract": "A trace of an entity is a behavior trajectory of the entity. Periodicity is a frequent phenomenon for the traces of an entity. Finding periodic traces for an entity is essential to understanding the entity behaviors. However, mining periodic traces is of complexity procedure, involving the unfixed period of a trace, the existence of multiple periodic traces, the large-scale events of an entity and the complexity of the model to represent all the events. However, the existing methods can't offer the desirable efficiency for periodic traces mining. In this paper, Firstly, a graph model(an event relationship graph) is adopted to represent all the events about an entity, then a novel and efficient algorithm, Traces Mining, is proposed to mine all the periodic traces. In our algorithm, firstly, the cluster analysis method is adopted according to the similarity of the activity attribute of an event and each cluster gets a different label, and secondly a novel method is proposed to mine all the Star patterns from the event relationship graph. Finally, an efficient method is proposed to merge all the Stars to get all the periodic traces. High efficiency is achieved by our algorithm through deviating from the existing edge-by-edge pattern-growth framework and reducing the heavy cost of the calculation of the support of a pattern and avoiding the production of lots of redundant patterns. In addition, our algorithm could mine all the large periodic traces and most small periodic traces. Extensive experimental studies on synthetic data sets demonstrate the effectiveness of our method.", "paper_title": "Mining Periodic Traces of an Entity on Web", "paper_id": "WOS:000358340900004"}