{"auto_keywords": [{"score": 0.0381069583489604, "phrase": "tcp-reno"}, {"score": 0.00976024881162909, "phrase": "rtt-fairness"}, {"score": 0.007581302918389891, "phrase": "hrf-tcp"}, {"score": 0.00481495049065317, "phrase": "new_tcp_congestion_control"}, {"score": 0.004615656893404919, "phrase": "serious_problem"}, {"score": 0.004527804152066942, "phrase": "smaller_rtt"}, {"score": 0.0043738432231020885, "phrase": "different_rtt_values"}, {"score": 0.004176640648520877, "phrase": "longer_rtt"}, {"score": 0.004065721092116729, "phrase": "sufficient_bandwidth"}, {"score": 0.0040190868373730015, "phrase": "current_methods"}, {"score": 0.0039729853486821995, "phrase": "rtt_fairness_issue"}, {"score": 0.0036788184374592706, "phrase": "rtt_value"}, {"score": 0.0034326732528567826, "phrase": "packet_loss"}, {"score": 0.003240139593712436, "phrase": "recent_proposed_tcp_versions"}, {"score": 0.003202944392720772, "phrase": "throughput_efficiency"}, {"score": 0.0028867712833776046, "phrase": "intuitive_analytical_models"}, {"score": 0.0027458373015999916, "phrase": "bottleneck_link_capacity"}, {"score": 0.002703869368554536, "phrase": "buffer_space"}, {"score": 0.0026728137770370176, "phrase": "bottleneck_link_router"}, {"score": 0.0025619562094446884, "phrase": "constant_increase"}, {"score": 0.002532526438148958, "phrase": "window_increment_phase"}, {"score": 0.002256155453630723, "phrase": "observed_rtt_values"}, {"score": 0.0022302306304023602, "phrase": "rtt_fairness"}, {"score": 0.002154226045704907, "phrase": "proposed_method"}, {"score": 0.0021049977753042253, "phrase": "conventional_methods"}], "paper_keywords": ["transport protocol", " RTT-fairness"], "paper_abstract": "This paper focuses on RTT-fairness of multiple TCP flows over the Internet, and proposes a new TCP congestion control named \"HRF (Hybrid RTT-Fair)-TCP\". Today, it is a serious problem that the flows having smaller RTT utilize more bandwidth than others when multiple flows having different RTT values compete in the same network. This means that a user with longer RTT may not be able to obtain sufficient bandwidth by the current methods. This RTT fairness issue has been discussed in many TCP papers. An example is CR (Constant Rate) algorithm, which achieves RTT-fairness by multiplying the square of RTT value in its window increment phase against TCP-Reno. However, the method halves its windows size same as TCP-Reno when a packet loss is detected. This makes worse its efficiency in certain network cases. On the other hand, recent proposed TCP versions essentially require throughput efficiency and TCP-friendliness with TCP-Reno. Therefore, we try to keep these advantages in our TCP design in addition to RTT-fairness. In this paper, we make intuitive analytical models in which we separate resource utilization processes into two cases: utilization of bottleneck link capacity and that of buffer space at the bottleneck link router. These models take into account three characteristic algorithms (Reno, Constant Rate, Constant Increase) in window increment phase where a sender receives an acknowledgement successfully. Their validity is proved by both simulations and implementations. From these analyses, we propose HRF-TCP which switches two modes according to observed RTT values and achieves RTT fairness. Experiments are carried out to validate the proposed method. Finally, HRF-TCP outperforms conventional methods in RTT-fairness, efficiency and friendliness with TCP-Reno.", "paper_title": "A New TCP Congestion Control Supporting RTT-Fairness", "paper_id": "WOS:000300471900026"}