{"auto_keywords": [{"score": 0.0417572237624928, "phrase": "neighbor_discovery"}, {"score": 0.009473645010020798, "phrase": "instantleap"}, {"score": 0.00481495049065317, "phrase": "fast_neighbor_discovery"}, {"score": 0.004305639197085793, "phrase": "vcr_command"}, {"score": 0.004141365648080381, "phrase": "smooth_viewing_experiences"}, {"score": 0.0040222701316738295, "phrase": "tracker_servers"}, {"score": 0.003925633992809873, "phrase": "increasing_scale"}, {"score": 0.0038127186374325582, "phrase": "dedicated_servers"}, {"score": 0.0035616743422949766, "phrase": "desired_content"}, {"score": 0.003376037544631762, "phrase": "instant_neighbor_discovery"}, {"score": 0.0032471155306148156, "phrase": "novel_method"}, {"score": 0.0030628762739398855, "phrase": "light-weight_indexing_architecture"}, {"score": 0.0027651847105654363, "phrase": "streaming_neighbor_list"}, {"score": 0.002725081358527507, "phrase": "shortcut_neighbor_list"}, {"score": 0.0025207920578878894, "phrase": "random_neighbor_list_exchanges"}, {"score": 0.0021569129153653777, "phrase": "large-scale_simulation_studies"}, {"score": 0.0021049977753042253, "phrase": "real-world_settings"}], "paper_keywords": ["P2P streaming", " Video-on-demand", " Fast neighbor discovery", " Indexing overlay"], "paper_abstract": "In large-scale peer-to-peer (P2P) video-on-demand (VoD) streaming applications, a fundamental challenge is to quickly locate new supplying peers whenever a VCR command is issued, in order to achieve smooth viewing experiences. For many existing commercial systems which use tracker servers for neighbor discovery, the increasing scale of P2P VoD systems has overloaded the dedicated servers to the point where they cannot accurately identify the suppliers with the desired content and bandwidth. To avoid overloading the servers and achieve instant neighbor discovery over the self-organizing P2P overlay, we design a novel method of organizing peers watching a video. The method features a light-weight indexing architecture to support efficient streaming and fast neighbor discovery at the same time. InstantLeap separates the neighbors at each peer into a streaming neighbor list and a shortcut neighbor list, for streaming and neighbor discovery respectively, which are maintained loosely but effectively based on random neighbor list exchanges. Our analysis shows that InstantLeap achieves an O(1) neighbor discovery efficiency upon any playback \"leap\" across the media stream in streaming overlays of any size, and low messaging costs for overlay maintenance upon peer join, departure, and VCR operations. We also verify our design with large-scale simulation studies of dynamic P2P VoD systems based on real-world settings.", "paper_title": "InstantLeap: an architecture for fast neighbor discovery in large-scale P2P VoD streaming", "paper_id": "WOS:000278027900003"}