{"auto_keywords": [{"score": 0.04733190377720631, "phrase": "collaborative_design"}, {"score": 0.014401204507405636, "phrase": "information_assurance"}, {"score": 0.00481495049065317, "phrase": "hierarchical_role-based_viewing"}, {"score": 0.004674952036988355, "phrase": "collaborative_cad._information_security"}, {"score": 0.004583878086896926, "phrase": "new_frontiers"}, {"score": 0.004216112320418982, "phrase": "engineering_information"}, {"score": 0.004073359218158693, "phrase": "integrity_nonrepudiation"}, {"score": 0.003954837422946628, "phrase": "access_control"}, {"score": 0.0037463983616303786, "phrase": "intellectual_property"}, {"score": 0.0036914757355166966, "phrase": "security_privileges"}, {"score": 0.0035141291835319682, "phrase": "critical_features"}, {"score": 0.0031070348334684356, "phrase": "prior_work"}, {"score": 0.0025892330566358503, "phrase": "multiresolution_function"}, {"score": 0.0023928819778638055, "phrase": "multiorganizational_collaboration"}, {"score": 0.0022443390559699974, "phrase": "first_of_its_kind_to_unite_multilevel_security_and_information"}, {"score": 0.0021682027434117095, "phrase": "multiresolution_surfaces"}, {"score": 0.0021049977753042253, "phrase": "computer-aided_design"}], "paper_keywords": [""], "paper_abstract": "Information security and assurance are new frontiers for collaborative design. In this context, information assurance (1A) refers to methodologies to protect engineering information by ensuring its availability, confidentiality, integrity nonrepudiation, authenticatz. on, access control, etc.fit collaborative design, 1A techniques are needed to protect intellectual property, establish security privileges and create \"need to know \" protections on critical features. This paper provides a framework for information assurance within collaborative design based on a technique we call Role-Based Viewing. We extend upon prior work, to present Hierarchical Role-Based Viewing as a more flexible and practical approach since role hierarchies naturally reflect an organizations lines of authority and responsibility We establish a direct correspondence between multilevel security); and multiresolution surfaces where a hierarchy is represented (is a weighted directed acyclic graph. The permission discovery process is formalized as a graph reachability problem and the path-cost can be used as input to a multiresolution function. B), incorporating security with collaborative design, the costs and risks incurred by multiorganizational collaboration can be reduced. The authors believe that this work is the first of its kind to unite multilevel security and information clouded with geometric data, including multiresolution surfaces, in the fields of computer-aided design and collaborative engineering.", "paper_title": "Hierarchical role-based viewing for multilevel information security in collaborative CAD", "paper_id": "WOS:000236100900002"}