{"auto_keywords": [{"score": 0.03429532035147688, "phrase": "system_type"}, {"score": 0.015719716506582538, "phrase": "intrinsic_motivation"}, {"score": 0.00988239376043929, "phrase": "information_technology"}, {"score": 0.004767261858417823, "phrase": "utilitarian_systems"}, {"score": 0.0039651694106206245, "phrase": "long-standing_and_largely_unchallenged_assumption"}, {"score": 0.0036250779580069455, "phrase": "application_use"}, {"score": 0.0035712919163869176, "phrase": "extrinsic_motivation"}, {"score": 0.0031845067058084583, "phrase": "boundary_condition"}, {"score": 0.003044785536429499, "phrase": "individual's_interaction"}, {"score": 0.0028966970007550798, "phrase": "enjoyment's_influence"}, {"score": 0.00286795254228461, "phrase": "perceived_ease"}, {"score": 0.0028113140998735366, "phrase": "perceived_usefulness"}, {"score": 0.0026086775334428617, "phrase": "meta-analytic_structural_equation"}, {"score": 0.0023727863021828547, "phrase": "actual_use"}, {"score": 0.002337537183727731, "phrase": "hedonic_and_utilitarian_systems"}, {"score": 0.0021474369836979048, "phrase": "'boundary_condition"}, {"score": 0.0021049977753042253, "phrase": "individuals'_interaction"}], "paper_keywords": ["user acceptance", " hedonic features", " intrinsic motivation", " utilitarian/hedonic information systems", " meta-analysis", " MASEM"], "paper_abstract": "Since the introduction of the Motivational Technology Acceptance Model in 1992, many researchers have considered both extrinsic and intrinsic motivation as antecedents of intent to use and actual use of a system. However, it has been a long-standing and largely unchallenged assumption that intrinsic motivation (i.e., fun or enjoyment) is a more dominant predictor of hedonic (fun) application use and that extrinsic motivation (i.e., usefulness) is a more dominant predictor of utilitarian (practical) application use. In this article, we probe whether system type serves as a boundary condition (i.e., moderator) for understanding an individual's interaction with information technology. Specifically, we examine whether perceived enjoyment's influence on perceived ease of use, perceived usefulness, intention, and use varies with system type. On the basis of a meta-analytic structural equation modeling analysis of 185 studies between 1992 and February 2011, our findings suggest intrinsic motivation is equally relevant for predicting intentions toward using and actual use of both hedonic and utilitarian systems. Therefore, our meta-analytic results call into question the rigidity of the assumption that system type is a 'boundary condition' for understanding individuals' interaction with information technology. The implications of these results for research and practice are discussed.", "paper_title": "Can we have fun @ work? The role of intrinsic motivation for utilitarian systems", "paper_id": "WOS:000317572500007"}