{"auto_keywords": [{"score": 0.04325124255431723, "phrase": "physical_formation"}, {"score": 0.03455018268948868, "phrase": "autonomous_vehicles"}, {"score": 0.028726058038574323, "phrase": "network_connectivity"}, {"score": 0.00481495049065317, "phrase": "mobile_robots"}, {"score": 0.0047563776685277314, "phrase": "network_connectivity_constraints"}, {"score": 0.004698514007994158, "phrase": "future_systems"}, {"score": 0.004641351004344458, "phrase": "networked_autonomous_vehicles"}, {"score": 0.004529093447865156, "phrase": "unmanned_aerial"}, {"score": 0.004312622975366676, "phrase": "peer-to-peer_wireless_communication"}, {"score": 0.0037921662574137535, "phrase": "specified_missions"}, {"score": 0.0035668128900149814, "phrase": "link_connectivity"}, {"score": 0.002224510044064184, "phrase": "formation_selection"}, {"score": 0.0021441057555396013, "phrase": "formation_optimization"}, {"score": 0.0021049977753042253, "phrase": "communication_costs"}], "paper_keywords": [""], "paper_abstract": "Future systems of networked autonomous vehicles, such as unmanned aerial or ground vehicles, may rely on peer-to-peer wireless communication to coordinate their actions. The physical formation of the network may need to be reconfigured at times based on the specified missions. However, reconfiguring the physical formation also impacts the link connectivity and hence the connectivity of the network. If the network is partitioned, the autonomous vehicles can no longer coordinate their movements, and the mission may fail. In this article, we discuss techniques to transform the formation of a system of autonomous vehicles while preserving network connectivity. Several different approaches to address this problem are presented, with the focus on a method that utilizes ideas from routing packets in networks. We also briefly discuss the problem of formation selection and give an example of formation optimization in which communication costs are minimized under constraints on preserving network connectivity and the amount of movement required.", "paper_title": "Formation Reconfiguration for Mobile Robots with Network Connectivity Constraints", "paper_id": "WOS:000306921100004"}