{"auto_keywords": [{"score": 0.04776153899320316, "phrase": "uncertainty_information"}, {"score": 0.009811694848386166, "phrase": "design_space"}, {"score": 0.008780629653542425, "phrase": "educational_data"}, {"score": 0.004814995542104226, "phrase": "visualizations"}, {"score": 0.004775335634705251, "phrase": "learning_analytics"}, {"score": 0.004324521292490181, "phrase": "informed_decisions"}, {"score": 0.003820144626025562, "phrase": "educational_domains"}, {"score": 0.0036958398682001015, "phrase": "educational_reporting"}, {"score": 0.0033743949483348626, "phrase": "educational_reporting_systems"}, {"score": 0.0028953973490895746, "phrase": "learner's_abilities"}, {"score": 0.002373615081691254, "phrase": "existing_learning_analytics_reports"}, {"score": 0.0021940118003312397, "phrase": "systematic_exploration"}, {"score": 0.0021669202726173928, "phrase": "different_design_decisions"}, {"score": 0.0021490449563443025, "phrase": "learner_trust"}, {"score": 0.0021049977753042253, "phrase": "decision_making"}], "paper_keywords": ["Open learner models", " learning dashboards", " uncertainty", " educational reporting", " learning analytics", " visual analytics"], "paper_abstract": "Adding uncertainty information to visualizations is becoming increasingly common across domains since its addition helps ensure that informed decisions are made. This work has shown the difficulty that is inherent to representing uncertainty. Moreover, the representation of uncertainty has yet to be thoroughly explored in educational domains even though visualizations are often used in educational reporting. We analyzed 50 uncertainty-augmented visualizations from various disciplines to map out how uncertainty has been represented. We then analyzed 106 visualizations from educational reporting systems where the learner can see the visualization; these visualizations provide learners with information about several factors including their knowledge, performance, and abilities. This analysis mapped the design space that has been employed to communicate a learner's abilities, knowledge, and interests. It also revealed several opportunities for the inclusion of uncertainty information within visualizations of educational data. We describe how uncertainty information can be added to visualizations of educational data and illustrate these opportunities by augmenting several of the types of visualizations that are found in existing learning analytics reports. The definition of this design space, based on a survey of the literature, will enable the systematic exploration of how different design decisions affect learner trust, understanding, and decision making.", "paper_title": "Uncertainty Representation in Visualizations of Learning Analytics for Learners: Current Approaches and Opportunities", "paper_id": "WOS:000361750500002"}