{"auto_keywords": [{"score": 0.03940660329523234, "phrase": "sugeno_lambda-measure"}, {"score": 0.015719716506582538, "phrase": "interaction-sensitive_fuzzy_measures"}, {"score": 0.004456872931482395, "phrase": "classifier_system"}, {"score": 0.004249825947483216, "phrase": "underlying_fuzzy_measure"}, {"score": 0.003933609372601274, "phrase": "fuzzy_measure"}, {"score": 0.003369778677878286, "phrase": "individual_classifiers"}, {"score": 0.003118838635447237, "phrase": "existing_fuzzy_measure"}, {"score": 0.0025471636425006155, "phrase": "experimental_section"}, {"score": 0.0024577274522206436, "phrase": "proposed_measures"}, {"score": 0.002385595105638277, "phrase": "traditionally_used_additive_measure"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Fuzzy integral", " Fuzzy measure", " Dynamic classifier aggregation"], "paper_abstract": "In classifier aggregation using fuzzy integral, the performance of the classifier system depends heavily on the choice of the underlying fuzzy measure. However, little attention has been given to the choice of the fuzzy measure in the literature; usually, the Sugeno lambda-measure is used. A weakness of the Sugeno lambda-measure is that it cannot model the interactions between individual classifiers. That motivated us to develop two novel fuzzy measures and a modification of an existing fuzzy measure which are interaction-sensitive, i.e., they model not only the confidences of classifiers, but also their mutual similarities. The properties of the measures are first studied theoretically, and in the experimental section, the performance of the proposed measures is compared to the traditionally used additive measure and Sugeno lambda-measure. Experiments on 23 benchmark datasets and 3 different classifier systems show that the interaction-sensitive fuzzy measures clearly outperform their non-interaction sensitive counterparts. (C) 2014 Elsevier B.V. All rights reserved.", "paper_title": "Dynamic classifier aggregation using interaction-sensitive fuzzy measures", "paper_id": "WOS:000352208900002"}