{"auto_keywords": [{"score": 0.03904989962163054, "phrase": "distributed_embedded_real-time_system"}, {"score": 0.009104552995854899, "phrase": "analysis_phase"}, {"score": 0.00897849090713754, "phrase": "service-oriented_software_development_life_cycle"}, {"score": 0.00481495049065317, "phrase": "distributed_embedded_real-time_systems"}, {"score": 0.0045846424310611745, "phrase": "key_phases"}, {"score": 0.004489327204473076, "phrase": "software_development_life_cycle"}, {"score": 0.0033213460816510685, "phrase": "systematic_service-oriented_development_methodology"}, {"score": 0.00314015410819199, "phrase": "step-by-step_guideline"}, {"score": 0.002439308179084911, "phrase": "profound_descriptions"}, {"score": 0.002149799391146313, "phrase": "first_step"}, {"score": 0.0021049977753042253, "phrase": "systematic_service-oriented_software_development_life_cycle"}], "paper_keywords": [""], "paper_abstract": "Analysis and design are the key phases in any software development life cycle. Service identification is one of the most important steps performed in the analysis phase of service-oriented software development life cycle. Service-orientation has been applied successfully in the domain of distributed embedded real-time system because of the advantages it provides such as reusability and interoperability. However, a systematic service-oriented development methodology for distributed embedded real-time system is still missing. A step-by-step guideline for service identification is presented in this study as part of an attempt to define the analysis phase of service-oriented software development life cycle for distributed embedded real-time system. The Smart Home case study is applied to verify the guidelines. This study provides profound descriptions on how to identify services for distributed embedded real-time system. Moreover, this work can be used as a first step towards a systematic service-oriented software development life cycle for distributed embedded real-time systems.", "paper_title": "Service identification guideline for developing distributed embedded real-time systems", "paper_id": "WOS:000308233300006"}