{"auto_keywords": [{"score": 0.03056369229478036, "phrase": "citation_records"}, {"score": 0.013866108084234491, "phrase": "name_disambiguation_methods"}, {"score": 0.00481495049065317, "phrase": "synthetic_authorship_records"}, {"score": 0.004747620102130588, "phrase": "author_name_disambiguation_methods"}, {"score": 0.004681226806682058, "phrase": "author_name_disambiguation_task"}, {"score": 0.004487541157100498, "phrase": "possible_many-to-many_correspondences"}, {"score": 0.0036667768092524576, "phrase": "digital_library"}, {"score": 0.003401148484767927, "phrase": "new_authors"}, {"score": 0.003322140088192527, "phrase": "researchers'_interests"}, {"score": 0.003081400693055518, "phrase": "controlled_conditions"}, {"score": 0.0029816229984366374, "phrase": "sygar"}, {"score": 0.0029260602766930065, "phrase": "synthetic_generator_of_authorship_records"}, {"score": 0.0028446460307503343, "phrase": "author_profiles"}, {"score": 0.0027395968397212053, "phrase": "successive_loads"}, {"score": 0.002675914969626753, "phrase": "living_digital_library"}, {"score": 0.0024128022009415476, "phrase": "synthetically_generated_collections"}, {"score": 0.0022378101636842296, "phrase": "digital_library_collection"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Author name disambiguation", " Digital library", " Bibliographic citation", " Synthetic generator"], "paper_abstract": "The author name disambiguation task has to deal with uncertainties related to the possible many-to-many correspondences between ambiguous names and unique authors. Despite the variety of name disambiguation methods available in the literature to solve the problem, most of them are rarely compared against each other. Moreover, they are often evaluated without considering a time evolving digital library, susceptible to dynamic (and therefore challenging) patterns such as the introduction of new authors and the change of researchers' interests over time. In order to facilitate the evaluation of name disambiguation methods in various realistic scenarios and under controlled conditions, in this article we propose SyGAR, a new Synthetic Generator of Authorship Records that generates citation records based on author profiles. SyGAR can be used to generate successive loads of citation records simulating a living digital library that evolves according to various publication patterns. We validate SyGAR by comparing the results produced by three representative name disambiguation methods on real as well as synthetically generated collections of citation records. We also demonstrate its applicability by evaluating those methods on a time evolving digital library collection generated with the tool, considering several dynamic and realistic scenarios. (C) 2012 Elsevier Inc. All rights reserved.", "paper_title": "A tool for generating synthetic authorship records for evaluating author name disambiguation methods", "paper_id": "WOS:000305664500004"}