{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "railway_schedule"}, {"score": 0.004602773636967002, "phrase": "conflicting_trains"}, {"score": 0.004534136929881113, "phrase": "np-complete_problem"}, {"score": 0.0044219992735047954, "phrase": "railway_operations"}, {"score": 0.004020492138367616, "phrase": "operational_criticality"}, {"score": 0.003980400251874277, "phrase": "existing_optimisation_models"}, {"score": 0.003407549468745519, "phrase": "milp_model"}, {"score": 0.0031765314093444956, "phrase": "major_advantage"}, {"score": 0.0028877818105020434, "phrase": "train_movements"}, {"score": 0.0028021527740710508, "phrase": "single_track_layout"}, {"score": 0.0027327327233891865, "phrase": "minimise_total_delay"}, {"score": 0.0026120705848349055, "phrase": "small_sized_data"}, {"score": 0.002534596206835737, "phrase": "possible_conflicts"}, {"score": 0.002398464540102246, "phrase": "optimal_resolutions"}, {"score": 0.0023390219342052623, "phrase": "experimental_verification"}, {"score": 0.002224510044064184, "phrase": "global_optimality"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Disruption", " Conflicts", " Optimal resolution", " Single-track railway", " Mixed-integer linear programming"], "paper_abstract": "Resolving disruptions, by dispatching and rescheduling conflicting trains is an NP-complete problem. Earlier literature classify railway operations as: (i) tactical scheduling, (ii) operational scheduling, and (iii) rescheduling. We distinguish the three based on operational criticality. Existing optimisation models do not distinguish precisely between scheduling and rescheduling based on constraints modelling; the only difference is in their objective function. Our model is the first of its kind to incorporate disruptions in an MILP model and to include conflicts-resolving constraints in the model itself. The major advantage of such a formulation is that only those trains which are disrupted are rescheduled and other nonconflicting trains retain their original schedules. Our model reschedules disrupted train movements on both directions of a single track layout with an objective to minimise total delay of all trains at their destinations. Using a small sized data it is proved that all possible conflicts out of a disruption are resolved. Apart from achieving optimal resolutions, we infer through experimental verification that a non-standard dispatch ordering is a requisite for global optimality, as cogitated by other authors. (C) 2012 Elsevier Ltd. All rights reserved.", "paper_title": "Modelling disruptions and resolving conflicts optimally in a railway schedule", "paper_id": "WOS:000315309300043"}