{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "human_arterial_tree"}, {"score": 0.0047689174754929195, "phrase": "large-scale_simulation_codes"}, {"score": 0.0046781613377273774, "phrase": "extended_periods"}, {"score": 0.004545240514015278, "phrase": "distributed_computational_resources"}, {"score": 0.0033900126423990823, "phrase": "early_stages"}, {"score": 0.0029343925814926787, "phrase": "input_parameter"}, {"score": 0.0025034338848015166, "phrase": "high-level_feedback"}, {"score": 0.002432152706473349, "phrase": "ongoing_simulation"}, {"score": 0.00236289633510808, "phrase": "particular_areas"}, {"score": 0.0023178219772486868, "phrase": "greater_detail"}], "paper_keywords": ["real-time visualization", " flow visualization", " computer graphics", " graphics systems", " distributed/network graphics", " simulation and modeling", " simulation output/analysis"], "paper_abstract": "Large-scale simulation codes typically execute for extended periods of time and often on distributed computational resources. Because these simulations can run for hours, or even days, scientists like to get feedback about the state of the computation and the validity of its results as it runs. It is also important that these capabilities be made available with little impact on the performance and stability of the simulation. Visualizing and exploring data in the early stages of the simulation can help scientists identify problems early, potentially avoiding a situation where a simulation runs for several days, only to discover that an error with an input parameter caused both time and resources to be wasted. We describe an application that aids in the monitoring and analysis of a simulation of the human arterial tree. The application provides researchers with high-level feedback about the state of the ongoing simulation and enables them to investigate particular areas of interest in greater detail. The application also offers monitoring information about the amount of data produced and data transfer performance among the various components of the application.", "paper_title": "Runtime visualization of the human arterial tree", "paper_id": "WOS:000247006000015"}