{"auto_keywords": [{"score": 0.04551938075852411, "phrase": "text_documents"}, {"score": 0.00481495049065317, "phrase": "general_linguistic_items"}, {"score": 0.004755279364266046, "phrase": "fuzzy_set_theory"}, {"score": 0.004725720368497539, "phrase": "modern_statistical_techniques"}, {"score": 0.004638136142210615, "phrase": "natural_language_processing"}, {"score": 0.004398657974555281, "phrase": "semantic_information"}, {"score": 0.004330595259996694, "phrase": "fuzzy_techniques"}, {"score": 0.004018212085786494, "phrase": "natural_languages"}, {"score": 0.003834476721674575, "phrase": "simple_words"}, {"score": 0.0037633479183921677, "phrase": "single_domain"}, {"score": 0.0036591119109692545, "phrase": "novel_statistical-fuzzy_methodology"}, {"score": 0.0034808560862878567, "phrase": "subject-verb-object_triplets"}, {"score": 0.0033950003609696227, "phrase": "first_place"}, {"score": 0.0032295691829911538, "phrase": "necessary_equations"}, {"score": 0.0031400710087822487, "phrase": "verb-object_pairs"}, {"score": 0.0030435255729392204, "phrase": "fuzzy_membership_functions"}, {"score": 0.002940740466043107, "phrase": "membership_value"}, {"score": 0.0029224275921964724, "phrase": "unseen_triplets"}, {"score": 0.0028237205895435733, "phrase": "comprehensive_system"}, {"score": 0.00260342914245402, "phrase": "second_phase"}, {"score": 0.0024380811094377006, "phrase": "fuzzy_classifier"}, {"score": 0.002212951892867028, "phrase": "positive_results"}, {"score": 0.0021854562213835032, "phrase": "experimental_tests"}, {"score": 0.0021049977753042253, "phrase": "promising_avenue"}], "paper_keywords": ["Fuzzy systems", " natural languages", " text processing"], "paper_abstract": "Modern statistical techniques used in the field of natural language processing are limited in their applications by the fact they suffer from the loss of most of the semantic information contained in text documents. Fuzzy techniques have been proposed as a way to correct this problem through the modelling of the relationships between words while accommodating the ambiguities of natural languages. However, these techniques are currently either restricted to modelling the effects of simple words or are specialized in a single domain. In this paper, we propose a novel statistical-fuzzy methodology to represent the actions described in a variety of text documents by modelling the relationships between subject-verb-object triplets. The research will focus in the first place on the technique used to accurately extract the triplets from the text, on the necessary equations to compute the statistics of the subject-verb and verb-object pairs, and on the formulas needed to interpolate the fuzzy membership functions from these statistics and on those needed to defuzzify the membership value of unseen triplets. Taken together, these sets of equations constitute a comprehensive system that allows the quantification and evaluation of the meaning of text documents, while being general enough to be applied to any domain. In the second phase, this paper will proceed to experimentally demonstrate the validity of our new methodology by applying it to the implementation of a fuzzy classifier conceived especially for this research. This classifier is trained using a section of the Brown Corpus, and its efficiency is tested with a corpus of 20 unseen documents drawn from three different domains. The positive results obtained from these experimental tests confirm the soundness of our new approach and show that it is a promising avenue of research.", "paper_title": "Semantic understanding of general linguistic items by means of fuzzy set theory", "paper_id": "WOS:000250372100001"}