{"auto_keywords": [{"score": 0.04950097558699653, "phrase": "interval-valued_fuzzy_numbers"}, {"score": 0.007672315261196975, "phrase": "proposed_similarity_measure"}, {"score": 0.007177663096524203, "phrase": "upper_fuzzy_numbers"}, {"score": 0.006023920806198731, "phrase": "new_similarity_measure"}, {"score": 0.005879478350181576, "phrase": "new_interval-valued_fuzzy_number_arithmetic_operators"}, {"score": 0.00481495049065317, "phrase": "similarity_measures"}, {"score": 0.0046993598473345395, "phrase": "interval-valued_fuzzy_number_arithmetic_operators"}, {"score": 0.004449280529563265, "phrase": "new_method"}, {"score": 0.004395532072377065, "phrase": "fuzzy_risk_analysis"}, {"score": 0.0033008757636753885, "phrase": "fuzzy_risk_analysis_problems"}, {"score": 0.002511600086227215, "phrase": "proposed_interval-valued_fuzzy_number_arithmetic_operators"}, {"score": 0.0023063614119692476, "phrase": "proposed_method"}, {"score": 0.002264607102799332, "phrase": "useful_way"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Fuzzy risk analysis", " Interval-valued fuzzy numbers", " Similarity measures", " Upper fuzzy numbers", " Lower fuzzy numbers", " Interval-valued fuzzy numbers arithmetic operators"], "paper_abstract": "In this paper, we present a new method for fuzzy risk analysis based on a new similarity measure between interval-valued fuzzy numbers and new interval-valued fuzzy number arithmetic operators. First, we present a new similarity measure between interval-valued fuzzy numbers. The proposed similarity measure considers the similarity of the gravities on the X-axis between upper fuzzy numbers, the difference of the spreads between upper fuzzy numbers, the heights of the upper fuzzy numbers, the degree of similarity on the X-axis between interval-valued fuzzy numbers, and the gravities on the Y-axis between interval-valued fuzzy numbers. We also present three properties of the proposed similarity measure between interval-valued fuzzy numbers. Then, we present new interval-valued fuzzy number arithmetic operators. Finally, we apply the proposed similarity measure between interval-valued fuzzy numbers and the proposed interval-valued fuzzy number arithmetic operators to propose a fuzzy risk analysis algorithm to deal with fuzzy risk analysis problems. The proposed method provides a useful way for handling fuzzy risk analysis problems based on interval-valued fuzzy numbers. (C) 2008 Elsevier Ltd. All rights reserved.", "paper_title": "Fuzzy risk analysis based on similarity measures between interval-valued fuzzy numbers and interval-valued fuzzy number arithmetic operators", "paper_id": "WOS:000263817100069"}