{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "charge_pump"}, {"score": 0.01482294503437301, "phrase": "digital_converter"}, {"score": 0.014464336175272765, "phrase": "sub-picosecond_resolution"}, {"score": 0.0043183186953102805, "phrase": "all-digital_phase-locked-loops"}, {"score": 0.004029187256595917, "phrase": "time_interval"}, {"score": 0.003455765987713262, "phrase": "high_resolution"}, {"score": 0.0034047882921717913, "phrase": "low_power"}, {"score": 0.0033545600622020464, "phrase": "small_area"}, {"score": 0.003192406091820197, "phrase": "noise_contribution"}, {"score": 0.0030988889679192965, "phrase": "detailed_design"}, {"score": 0.0027787638791664663, "phrase": "proposed_tdc"}, {"score": 0.002442693254693416, "phrase": "achieved_resolutions"}, {"score": 0.0021049977753042253, "phrase": "consistent_trends"}], "paper_keywords": ["ADPLL", " charge pump", " SAR-ADC", " sub-picosecond resolution", " TDC", " time-to-charge conversion"], "paper_abstract": "We present a time-to-digital converter (TDC) achieving sub-picosecond resolution and high precision for all-digital phase-locked-loops (ADPLLs). The basic idea is using a charge pump to translate time interval into charge, and a successive-approximation-register-analog-to-digital converter (SAR-ADC) to quantize the charge. With this less complex configuration, high resolution, high precision, low power, and small area can be achieved all together. We analyzed the noise contribution from the charge pump and describe detailed design and implementation for sizing the capacitor and transistors, with the awareness of noise and linearity. The analysis demonstrates the proposed TDC capable of sub-picosecond resolution and high precision. Two prototype chips were fabricated in 65 nm CMOS with 0.06mm(2), and 0.018mm(2) core areas, respectively. The achieved resolutions are 0.84 ps and 0.80 ps, in 8-bit and 10-bit range, respectively. The measured single-shot-precisions range from 0.22 to 0.6 ps, and from 0.66 to 1.04 ps, respectively, showing consistent trends with the analysis. Compared with state-of-the-arts, best performance balance has been achieved.", "paper_title": "Sub-Picosecond Resolution and High-Precision TDC for ADPLLs Using Charge Pump and SAR-ADC", "paper_id": "WOS:000359464400004"}