{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "data_imbalance_problem"}, {"score": 0.049100450513748284, "phrase": "massive_video_dataset"}, {"score": 0.01555996713314101, "phrase": "semantic_extraction"}, {"score": 0.013763294182765192, "phrase": "traditional_machine_learning_algorithms"}, {"score": 0.004364919932563366, "phrase": "balanced_data_distribution"}, {"score": 0.003916098498242888, "phrase": "true_data_distribution"}, {"score": 0.0032848684681050745, "phrase": "proposed_algorithm"}, {"score": 0.003201018846103988, "phrase": "model_training"}, {"score": 0.003071274938566466, "phrase": "hierarchical_structure_algorithm"}, {"score": 0.0023834640793589414, "phrase": "different_kinds"}, {"score": 0.002310578855290687, "phrase": "extended_experiments"}, {"score": 0.0021490449563443025, "phrase": "top_performance"}, {"score": 0.0021049977753042253, "phrase": "seven_events"}], "paper_keywords": ["Data imbalance", " Enhanced and hierarchical structure (EHS)", " Semantic indexing", " Surveillance event detection", " Massive video dataset", " TRECVID"], "paper_abstract": "Data imbalance problem often exists in our real life dataset, especial for massive video dataset, however, the balanced data distribution and the same misclassification cost are assumed in traditional machine learning algorithms, thus, it will be difficult for them to accurately describe the true data distribution, and resulting in misclassification. In this paper, the data imbalance problem in semantic extraction under massive video dataset is exploited, and enhanced and hierarchical structure (called EHS) algorithm is proposed. In proposed algorithm, data sampling, filtering and model training are considered and integrated together compactly via hierarchical structure algorithm, thus, the performance of model can be improved step by step, and is robust and stability with the change of features and datasets. Experiments on TRECVID2010 Semantic Indexing demonstrate that our proposed algorithm has much more powerful performance than that of traditional machine learning algorithms, and keeps stable and robust when different kinds of features are employed. Extended experiments on TRECVID2010 Surveillance Event Detection also prove that our EHS algorithm is efficient and effective, and reaches top performance in four of seven events.", "paper_title": "Enhanced and hierarchical structure algorithm for data imbalance problem in semantic extraction under massive video dataset", "paper_id": "WOS:000331084000007"}