{"auto_keywords": [{"score": 0.049027569260597106, "phrase": "scientific_literature"}, {"score": 0.006476197284018413, "phrase": "scientific_research"}, {"score": 0.00481495049065317, "phrase": "emerging_infectious_disease_epidemic"}, {"score": 0.004767870493559383, "phrase": "epidemic_trajectory"}, {"score": 0.004386063799793622, "phrase": "exploratory_analysis"}, {"score": 0.003942299471749811, "phrase": "new_cases"}, {"score": 0.0034194208971263587, "phrase": "medline"}, {"score": 0.003299880298525127, "phrase": "national_library_of_medicine"}, {"score": 0.0032706520949775065, "phrase": "content_analysis_methods"}, {"score": 0.0032129675521135616, "phrase": "qualitative_data_reduction"}, {"score": 0.0031703706626348507, "phrase": "regression_analysis"}, {"score": 0.003005539334280134, "phrase": "epidemic_co"}, {"score": 0.0028875481626754696, "phrase": "specific_genres"}, {"score": 0.002761856557698856, "phrase": "regression_model"}, {"score": 0.0027252240573281163, "phrase": "statistically_significant_association"}, {"score": 0.002689076130099546, "phrase": "representative_body"}, {"score": 0.0021716540012278744, "phrase": "functional_and_practical_interest"}, {"score": 0.0021333110194180997, "phrase": "policy_makers"}, {"score": 0.0021049977753042253, "phrase": "lay_public"}], "paper_keywords": ["multivariate analysis", " data analysis", " data reduction"], "paper_abstract": "This study undertook an exploratory analysis of the relationship between the body of scientific literature associated with HIV/AIDS and the trajectory of the epidemic, measured by the rate of new cases diagnosed annually in the United States for the period covering 1981 to 2009. The body of scientific literature examined in this investigation was constituted from scientific research that developed alongside the epidemic and was extracted from MEDLINE, a bibliographic database of the United States. National Library of Medicine. Content analysis methods were employed for qualitative data reduction, and regression analysis was used to assess whether variation in the trajectory of the epidemic co-occurred with variation in the publication of specific genres of content within the scientific literature relating to HIV/AIDS. The regression model confirmed a statistically significant association between the representative body of HIV/AIDS scientific literature and the epidemic trajectory, and identified three research categories, namely, ameliorative drug treatments, other clinical protocols, and health education, as being most significantly associated with the epidemic trajectory. Implicit in the findings of this study are areas of scientific research that are of functional and practical interest to clinicians, policy makers, the lay public, and contributors to the body of scientific literature.", "paper_title": "Modeling the relationship between an emerging infectious disease epidemic and the body of scientific literature associated with it: The case of HIV/AIDS in the United States", "paper_id": "WOS:000323388100013"}