{"auto_keywords": [{"score": 0.04895586541793087, "phrase": "direct_communication"}, {"score": 0.010584248600555356, "phrase": "correlated_clusters"}, {"score": 0.00619621414001627, "phrase": "theoretical_analysis"}, {"score": 0.00481495049065317, "phrase": "teletraffic_analysis_of_direct_communication"}, {"score": 0.004508602067250763, "phrase": "point-based_approximation"}, {"score": 0.004357927940322685, "phrase": "centralized_controller"}, {"score": 0.004275904315753662, "phrase": "base_station"}, {"score": 0.004019797503157808, "phrase": "localized_distribution"}, {"score": 0.003603549914861701, "phrase": "previous_analysis"}, {"score": 0.00332375606483146, "phrase": "additional_analysis"}, {"score": 0.002881793492919646, "phrase": "first_time"}, {"score": 0.002570817338292482, "phrase": "exact_results"}, {"score": 0.002382329940096419, "phrase": "numerical_results"}, {"score": 0.0021659920594094407, "phrase": "offered_traffic"}, {"score": 0.0021049977753042253, "phrase": "cluster_selection"}], "paper_keywords": ["clustering", " direct communication", " two dimensional"], "paper_abstract": "In direct communication, terminals that are close to each other can communicate directly without traffic going through centralized controller such as a base station (BS). This brings several advantages. We study direct communication with localized distribution, so that users tend to gather around some areas (clusters/hot-spots) within the cell such as buildings. Previous analysis about clustering has focused on one dimensional scenarios. Here we present theoretical analysis of direct communication with two dimensional clustering. Additional analysis is presented for direct communication with correlated clusters. With correlated clusters some pairs of source and destination clusters are more probable than other pairs. According to our best knowledge, this is the first time that theoretical analysis is presented about clustering and correlated clusters in two dimensional scenarios. Simulations confirm the validity of the analysis. In addition to the exact results, we also suggest using the point-based approximation to rapidly and easily obtain results. The numerical results show that the gains from direct communication, in terms of blocking probability and carried traffic, depend on the offered traffic. Additionally, correlation in cluster selection is shown to significantly improve performance. Point-based approximation is shown to be very useful when the number of clusters is large.", "paper_title": "Teletraffic Analysis of Direct Communication with Clustering", "paper_id": "WOS:000266425600014"}