{"auto_keywords": [{"score": 0.04624748036146564, "phrase": "error_probability"}, {"score": 0.028801445292121773, "phrase": "bhattacharyya_parameters"}, {"score": 0.00481495049065317, "phrase": "polar_codes"}, {"score": 0.004776944268430589, "phrase": "binary-input_memoryless_output-symmetric_channel_w._such_a_channel"}, {"score": 0.00457318509202298, "phrase": "strictly_positive_constant_p-e"}, {"score": 0.004501255720779186, "phrase": "coding_scheme"}, {"score": 0.004456872931482395, "phrase": "rate_r"}, {"score": 0.004044331818766499, "phrase": "finite-length_scaling_behavior"}, {"score": 0.003988605734927782, "phrase": "strassen"}, {"score": 0.003957085640253303, "phrase": "polyanskiy"}, {"score": 0.003918051376764868, "phrase": "verdu"}, {"score": 0.0037359312167652117, "phrase": "r._polar_codes"}, {"score": 0.003513133457324989, "phrase": "exact_scaling_behavior"}, {"score": 0.003376470976228317, "phrase": "binary-input_memoryless_output-symmetric_channels"}, {"score": 0.0032970302109506205, "phrase": "un-polarized_channels"}, {"score": 0.0031750545924284506, "phrase": "bhattacharyya"}, {"score": 0.0031436943442139705, "phrase": "fixed_interval"}, {"score": 0.0028922667920814947, "phrase": "bhattacharyya_process"}, {"score": 0.0027907472182015915, "phrase": "main_results"}, {"score": 0.0026767905080775315, "phrase": "polar_coding_scheme"}, {"score": 0.0023808620705105107, "phrase": "positive_constant"}, {"score": 0.0022745508619577927, "phrase": "valid_choice"}, {"score": 0.002142970278347126, "phrase": "binary_erasure_channel"}], "paper_keywords": ["Coding for noisy channels", " finite block length regime", " polar codes", " scaling laws"], "paper_abstract": "Consider a binary-input memoryless output-symmetric channel W. Such a channel has a capacity, call it I (W), and for any R < I (W) and strictly positive constant P-e we know that we can construct a coding scheme that allows transmission at rate R with an error probability not exceeding Pe. Assume now that we let the rate R tend to I (W) and we ask how we have to scale the blocklength N in order to keep the error probability fixed to P-e. We refer to this as the finite-length scaling behavior. This question was addressed by Strassen as well as Polyanskiy, Poor, and Verdu, and the result is that N must grow at least as the square of the reciprocal of I (W) - R. Polar codes are optimal in the sense that they achieve capacity. In this paper, we are asking to what degree they are also optimal in terms of their finite-length behavior. Since the exact scaling behavior depends on the choice of the channel, our objective is to provide scaling laws that hold universally for all binary-input memoryless output-symmetric channels. Our approach is based on analyzing the dynamics of the un-polarized channels. More precisely, we provide bounds on (the exponent of) the number of subchannels whose Bhattacharyya constant falls in a fixed interval [a, b]. Mathematically, this can be stated as bounding the sequence {1/n log Pr(Z(n) is an element of [a, b])}(n is an element of N), where Z(n) is the Bhattacharyya process. We then use these bounds to derive tradeoffs between the rate and the block-length. The main results of this paper can be summarized as follows. Consider the sum of Bhattacharyya parameters of subchannels chosen (by the polar coding scheme) to transmit information. If we require this sum to be smaller than a given value P-e > 0, then the required block-length N scales in terms of the rate R < I (W) as N >= alpha/(I (W) - R)<((mu))under bar>, where a is a positive constant that depends on P-e and I (W). We show that (mu) under bar = 3.579 is a valid choice, and we conjecture that indeed the value of (mu) under bar can be improved to (mu) under bar = 3.627, the parameter for the binary erasure channel. Also, we show that with the same requirement on the sum of Bhattacharyya parameters, the blocklength scales in terms of the rate like N <= beta/(I (W)- R)((mu)) over bar, where beta is a constant that depends on P-e and I (W), and (mu) over bar = 6.", "paper_title": "Finite-Length Scaling for Polar Codes", "paper_id": "WOS:000342416900005"}