{"auto_keywords": [{"score": 0.03739263574324259, "phrase": "rdf_data"}, {"score": 0.015719716506582538, "phrase": "ontological_models"}, {"score": 0.008639775793452558, "phrase": "big_rdf_data"}, {"score": 0.004652845998457721, "phrase": "increasing_popularity"}, {"score": 0.00445783412174435, "phrase": "large_variety"}, {"score": 0.004419819325202464, "phrase": "web_sources"}, {"score": 0.004326188427877999, "phrase": "rdf._ontological_models"}, {"score": 0.003031287195944274, "phrase": "raw_rdf_data"}, {"score": 0.0029416448256236057, "phrase": "intensive_usage"}, {"score": 0.002746549549029177, "phrase": "final_result"}, {"score": 0.0027114323601885666, "phrase": "authors'_technique"}, {"score": 0.0026767629720554397, "phrase": "ontological_model"}, {"score": 0.0021322775033565805, "phrase": "first_technique"}], "paper_keywords": ["Linked Open Data", " Ontological Models", " RDF", " SPARQL 1.1", " Web of Data"], "paper_abstract": "We are witnessing an increasing popularity of the Web of Data, which exposes a large variety of web sources that provide their data using RDF. Ontological models are used as the schema to organize this data. These models are usually shared by several communities and, to devise them, there is usually an agreement amongst those communities. As a result, it is common to have more than one ontological model to understand some RDF data; therefore, there might be a gap between the ontological models and the RDF data, which is not negligible in practice. In this article, the authors present a technique to automatically discover ontological models from raw RDF data. It is based on the intensive usage of a set of SPARQL 1.1 structural queries that are generic and independent from the RDF data. The final result of the authors' technique is an ontological model that is derived from the RDF data, and includes types and properties, subtypes, domains and ranges of properties and subproperties. The authors have conducted experiments with millions of triples that prove that their technique is suitable to deal with Big RDF Data. As far as they know, this is the first technique to discover such ontological models in the context of RDF data and the Web of Data.", "paper_title": "Discovering and Analysing Ontological Models From Big RDF Data", "paper_id": "WOS:000370843600004"}