{"auto_keywords": [{"score": 0.03312386540905821, "phrase": "side_effects"}, {"score": 0.009099312787110053, "phrase": "checkpointable_processes"}, {"score": 0.005191170875138748, "phrase": "competitive_ratio"}, {"score": 0.005109376796630725, "phrase": "randomized_algorithm"}, {"score": 0.00481495049065317, "phrase": "arbitrary_speedup_curves"}, {"score": 0.004452130401364222, "phrase": "achievable_competitive_ratio"}, {"score": 0.004262699292628513, "phrase": "jobs"}, {"score": 0.004129248271757936, "phrase": "varying_degrees"}, {"score": 0.004021267064832957, "phrase": "nonclairvoyant_scheduler"}, {"score": 0.003375826910838081, "phrase": "speed_s_uses_power_s"}, {"score": 0.0021049977753042253, "phrase": "lower_bound"}], "paper_keywords": ["Power management", " Scheduling", " Speed scaling"], "paper_abstract": "We consider the setting of a multiprocessor where the speeds of the m processors can be individually scaled. Jobs arrive over time and have varying degrees of parallelizability. A nonclairvoyant scheduler must assign the processes to processors, and scale the speeds of the processors. We consider the objective of energy plus flow time. We assume that a processor running at speed s uses power s (alpha) for some constant alpha > 1. For processes that may have side effects or that are not checkpointable, we show an Omega(m((alpha-1)/alpha 2)) bound on the competitive ratio of any randomized algorithm. For checkpointable processes without side effects, we give an O(log m)-competitive algorithm. Thus for processes that may have side effects or that are not checkpointable, the achievable competitive ratio grows quickly with the number of processors, but for checkpointable processes without side effects, the achievable competitive ratio grows slowly with the number of processors. We then show a lower bound of Omega(log (1/alpha) m) on the competitive ratio of any randomized algorithm for checkpointable processes without side effects.", "paper_title": "Speed Scaling of Processes with Arbitrary Speedup Curves on a Multiprocessor", "paper_id": "WOS:000295519200008"}