{"auto_keywords": [{"score": 0.04974351188371698, "phrase": "role_transitions"}, {"score": 0.0489152367824777, "phrase": "successful_projects"}, {"score": 0.041886289106049655, "phrase": "successful_project"}, {"score": 0.03632066591054605, "phrase": "high_magnitude"}, {"score": 0.00463229351153731, "phrase": "increasingly_fluid_working_environment"}, {"score": 0.0043481611772332495, "phrase": "rapid_changes"}, {"score": 0.004257360656055417, "phrase": "intrafirm_temporary_role_transitions"}, {"score": 0.004124688058533477, "phrase": "information_technology"}, {"score": 0.003672500644750565, "phrase": "adaptation_period"}, {"score": 0.0035082436540296406, "phrase": "important_re-entry_shock"}, {"score": 0.003235367401211807, "phrase": "idealized_project_work_environment"}, {"score": 0.0031677308747058187, "phrase": "decisions_top_management"}, {"score": 0.0031234247639701134, "phrase": "project_structure"}, {"score": 0.0026375718041787, "phrase": "moderating_variables"}, {"score": 0.0024066745849759706, "phrase": "widely_shared_assumption"}, {"score": 0.002339771435910601, "phrase": "functional_work"}, {"score": 0.002234988641498543, "phrase": "potential_source"}, {"score": 0.0022036996784968793, "phrase": "team_members"}, {"score": 0.0021049977753042253, "phrase": "managing_transitions"}], "paper_keywords": ["IT professionals", " IT projects", " job satisfaction", " project governance", " project management", " qualitative study", " role theory", " role transition", " socialization"], "paper_abstract": "In an increasingly fluid working environment, workers often find themselves in a state of transition and must be capable of adapting to rapid changes. This study focuses on intrafirm temporary role transitions, and more specifically on the case of information technology (IT) professionals transitioning out of a successful project and returning to their functional unit. In-depth interviews were conducted with 19 IT professionals. All of the respondents reported that they had experienced an adaptation period, albeit minor for some. Others, however, felt an important re-entry shock. A shock of high magnitude is mainly experienced when the successful project becomes a referent to which all other work assignments are compared. This idealized project work environment is the result of the decisions top management makes about the project structure, management, and governance. The results show that all people do not react the same way to a shock of high magnitude: some either adapt or change their new role, but others resist. This study highlights the need to better understand role transitions by further investigating the moderating variables at play in the relationships between actor, experience, magnitude of shock, and reaction. The study contributes to practice by questioning the widely shared assumption that IT professionals effortlessly navigate between project and functional work environments, and by highlighting the need to consider successful projects as a potential source of turmoil for team members. Finally, it raises the question of where the responsibility of managing transitions lies in the organization.", "paper_title": "Exploring How IT Professionals Experience Role Transitions at the End of Successful Projects", "paper_id": "WOS:000345922700003"}