{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "wikipedia"}, {"score": 0.005000260811331979, "phrase": "case_study"}, {"score": 0.0044549060473070695, "phrase": "cambodia"}, {"score": 0.004224130367280183, "phrase": "internet_access"}, {"score": 0.004138575034269399, "phrase": "previous_encyclopedias"}, {"score": 0.003782174375003052, "phrase": "writing_style"}, {"score": 0.0035861227263414537, "phrase": "popular_culture"}, {"score": 0.0030818310926031024, "phrase": "cambodian_history_articles"}, {"score": 0.0029581155916843663, "phrase": "largely_unconscious_appropriation"}, {"score": 0.002921975748248106, "phrase": "dominant_discourse"}, {"score": 0.0028161764476743257, "phrase": "article_quality"}, {"score": 0.002759058732719621, "phrase": "distinct_pattern"}, {"score": 0.002659142621852998, "phrase": "dominant_historiographical_tradition"}, {"score": 0.002637433799290365, "phrase": "cambodian_history"}, {"score": 0.002480154140902474, "phrase": "dominant_discursive_narratives"}, {"score": 0.0023903140267755576, "phrase": "particular_discourses"}, {"score": 0.0023418133729330303, "phrase": "new_world_information"}, {"score": 0.00219311232069446, "phrase": "nwico"}, {"score": 0.0021049977753042253, "phrase": "information_professionals"}], "paper_keywords": ["encyclopedias", " Asia"], "paper_abstract": "Wikipedia is a repository of information freely available to those with Internet access. Given its radical departure from previous encyclopedias, it is not surprising that it is controversial. Wikipedia is freely editable, leading to debates over accuracy and writing style. It has also included topics, especially in the area of popular culture, which some believe are not appropriate for a serious, comprehensive encyclopedia. In this article, I do not examine these arguments, but, rather, a different problem confronting Wikipedia. Through a case study of Cambodian history articles, I demonstrate how Wikipedia limits itself through a largely unconscious appropriation of the dominant discourse of representation surrounding its objects of inquiry. When article quality is examined, a distinct pattern emerges that can readily be matched to the dominant historiographical tradition of Cambodian history. As well as presenting this case study as a demonstration of the influence of dominant discursive narratives, I wish to contextualize this privileging of particular discourses within debates about the New World Information and Communication Order (NWICO) that emerged in the 1970s. I argue that the NWICO can be useful in our thinking about the relationship of information professionals to Wikipedia today.", "paper_title": "History on Wikipedia: In need of a NWICO (New World Information and Communication Order)? the case of Cambodia", "paper_id": "WOS:000323377600009"}