{"auto_keywords": [{"score": 0.03836315693036425, "phrase": "approximate_answer"}, {"score": 0.03511313014189974, "phrase": "query_answer"}, {"score": 0.010231790580851954, "phrase": "desired_level"}, {"score": 0.00481495049065317, "phrase": "continuous_queries"}, {"score": 0.004785682967399109, "phrase": "mobile_peer"}, {"score": 0.004727678014364335, "phrase": "peer_environments"}, {"score": 0.004599712603988837, "phrase": "efficient_and_scalable_query_processing_framework"}, {"score": 0.0038187460155038318, "phrase": "exact_answer"}, {"score": 0.0037955107949094124, "phrase": "continuous_spatial_queries"}, {"score": 0.0036256778700153227, "phrase": "quality_guarantees"}, {"score": 0.003516684084316783, "phrase": "continuous_spatial_query_processing"}, {"score": 0.0034423371331039464, "phrase": "mobile_user"}, {"score": 0.0032983098564490208, "phrase": "personalized_qos_profile"}, {"score": 0.0032682370318207503, "phrase": "qos_profile"}, {"score": 0.0031506541919795444, "phrase": "coverage_parameter"}, {"score": 0.0030746180465357374, "phrase": "available_information"}, {"score": 0.003000411392166266, "phrase": "accuracy_parameter"}, {"score": 0.002866053420470349, "phrase": "continuous_answer_maintenance_scheme"}, {"score": 0.002623072765271526, "phrase": "local_cache"}, {"score": 0.0024301658667103565, "phrase": "refined_answer"}, {"score": 0.002386014719597134, "phrase": "qos_requirements"}, {"score": 0.0022930799650968544, "phrase": "required_search_area"}, {"score": 0.002230864807344675, "phrase": "experiment_results"}, {"score": 0.0021571068309076845, "phrase": "effective_trade-off"}, {"score": 0.0021374167789011246, "phrase": "communication_overhead"}, {"score": 0.0021049977753042253, "phrase": "query_answers"}], "paper_keywords": ["Mobile computing", " peer-to-peer computing", " continuous query processing", " spatio-temporal databases", " GIS"], "paper_abstract": "In this paper, we propose an efficient and scalable query processing framework for continuous spatial queries (range and k-nearest-neighbor queries) in mobile peer-to-peer (P2P) environments, where no fixed communication infrastructure or centralized/distributed servers are available. Due to the limitations in mobile P2P environments, for example, user mobility, limited battery power, limited communication range, and scarce communication bandwidth, it is costly to maintain the exact answer of continuous spatial queries. To this end, our framework enables the user to find an approximate answer with quality guarantees. In particular, we design two key features to adapt continuous spatial query processing to mobile P2P environments. 1) Each mobile user can specify his or her desired quality of services (QoS) for a query answer in a personalized QoS profile. The QoS profile consists of two parameters, namely, coverage and accuracy. The coverage parameter indicates the desired level of completeness of the available information for computing an approximate answer, and the accuracy parameter indicates the desired level of accuracy of the approximate answer. 2) We design a continuous answer maintenance scheme to enable the user to collaborate with other peers to continuously maintain a query answer. With these two features in our framework, the user can obtain a query answer from a local cache if the answer satisfies his or her QoS requirements. Otherwise, the user enlists neighbors for help to share their cached information to refine the answer. If the refined answer still cannot satisfy the QoS requirements, the user broadcasts the query to the peers residing within the required search area of the query to find the most accurate answer. Experiment results show that our framework is efficient and scalable and provides an effective trade-off between the communication overhead and the quality of query answers.", "paper_title": "On Efficient and Scalable Support of Continuous Queries in Mobile Peer-to-Peer Environments", "paper_id": "WOS:000293968000009"}