{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "sustainability_strategic_planning"}, {"score": 0.00447045328907701, "phrase": "sustainability_goal"}, {"score": 0.004123781267600542, "phrase": "information_system"}, {"score": 0.0040708542958968605, "phrase": "business_strategy"}, {"score": 0.003992729692096799, "phrase": "exhaustive_review"}, {"score": 0.003941478054422721, "phrase": "corporate_social_responsibility"}, {"score": 0.003916098498242888, "phrase": "strategic_planning"}, {"score": 0.003865826699096508, "phrase": "balanced_scorecards"}, {"score": 0.0033971539563683174, "phrase": "computer_resources"}, {"score": 0.003331915219811852, "phrase": "key_role"}, {"score": 0.0032051601987130207, "phrase": "necessary_environment"}, {"score": 0.0029467742734417255, "phrase": "long_time"}, {"score": 0.00281635677605879, "phrase": "different_steps"}, {"score": 0.0028072645684856313, "phrase": "und_tools"}, {"score": 0.0024035955457586103, "phrase": "practical_application"}, {"score": 0.0021462652605453163, "phrase": "environmental_and_social_variables"}, {"score": 0.0021049977753042253, "phrase": "economical_purposes"}], "paper_keywords": ["Strategic planning", " Corporate social responsibility", " Balanced scorecard", " Information systems", " Sustainable development"], "paper_abstract": "Purpose - The purpose of this paper is to propose a framework that intends to help organisations achieve the sustainability goal by means of a methodology that integrates sustainability in both the planning and management tasks of the organisation and that serves as a base for the implementation of an information system aligned with the business strategy. Design/methodology/approach - After an exhaustive review of literature about corporate social responsibility, strategic planning of organisations and balanced scorecards (BSCs), a methodology has been developed that describes the process of designing and implementing a sustainability BSC for sustainability strategic planning and management. Findings - The methodology can be easily implemented at companies with a minimum of computer resources, but managers play a key role in its success, since they are the responsible for providing the necessary environment for overcoming such an important change. Research limitations/implications - The methodology has only been applied once and their results will only be able to be analysed after a long time. Meanwhile, more implementations have to be performed to test and improve the different steps und tools until the methodology can be considered definitive. Practical implications - The methodology could be used by many organisations, improving their social and environmental performance and contributing to their sustainability and the sustainability of all of their stakeholders, specially for society as a whole. Readers of this paper could see a practical application of methodology and its viability by means of the case. Originality/value - An innovative structure for BSCs which has been developed having in mind the sustainability since the beginning, but not justly adding environmental and social variables to a model designed with economical purposes.", "paper_title": "Methodology for sustainability strategic planning and management", "paper_id": "WOS:000276515900014"}