{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "website_navigability"}, {"score": 0.004710306419574744, "phrase": "tool-based_approach"}, {"score": 0.00439041997682389, "phrase": "user's_behaviour"}, {"score": 0.00431388720289049, "phrase": "information_space"}, {"score": 0.004003169429008801, "phrase": "particular_hyperlink"}, {"score": 0.003682207422331339, "phrase": "important_attribute"}, {"score": 0.0036499505265403377, "phrase": "hypermedia_navigability"}, {"score": 0.003539252646181146, "phrase": "users'_behaviour"}, {"score": 0.00308788133472785, "phrase": "high_scent"}, {"score": 0.00284009509859163, "phrase": "ambiguous_scent"}, {"score": 0.002646880721119838, "phrase": "previously_conducted_analysis"}, {"score": 0.002623669616798891, "phrase": "infoscent_evaluator"}, {"score": 0.0024776677004255104, "phrase": "scent_evaluation"}, {"score": 0.0023192471808039746, "phrase": "potential_scent-related_navigability_problems"}, {"score": 0.0021049977753042253, "phrase": "necessary_flexibility"}], "paper_keywords": ["Information scent", " Eye-tracking study", " Automated tool", " Latent Semantic Analysis"], "paper_abstract": "Following information scent has been established as a metaphor to describe a user's behaviour while navigating an information space by successively selecting hyperlinks. This metaphor suggests that users assess the profitability of following a particular hyperlink based on its perceived semantic association with their goal. The purpose of this paper is to study how information scent, this important attribute of hypermedia navigability, influences concurrently four aspects of users' behaviour while exploring a website: (1) distribution of attention; (2) confidence in choice of link; (3) efficiency; and (4) effectiveness. It was found that in webpages with high scent, users were significantly more focused, confident of their choices, efficient and effective compared to webpages with ambiguous scent. The findings of the study are discussed in comparison with results obtained from a previously conducted analysis using InfoScent Evaluator (ISEtool), a tool that has been proposed to facilitate scent evaluation of websites. This comparison provided support for the effectiveness of ISEtool in indicating potential scent-related navigability problems. We argue that such a tool-based approach can facilitate hypermedia design by reducing the resources and expertise required, and by providing the necessary flexibility for practitioners.", "paper_title": "Evaluating website navigability: validation of a tool-based approach through two eye-tracking user studies", "paper_id": "WOS:000283880200011"}