{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "transient_downtime"}, {"score": 0.004768104290288521, "phrase": "virtual_server_systems"}, {"score": 0.004585212379675535, "phrase": "cloud_datacenters_service_level_agreements"}, {"score": 0.004345085569121329, "phrase": "provisioned_servers"}, {"score": 0.00428179779071721, "phrase": "service_window"}, {"score": 0.004057495982111461, "phrase": "steady-state_probabilities"}, {"score": 0.003959447096055027, "phrase": "birth-death_processes"}, {"score": 0.0035379628447303703, "phrase": "typical_service_windows"}, {"score": 0.0034355662264234864, "phrase": "transient_distributions"}, {"score": 0.0030696773722514105, "phrase": "system_log_data"}, {"score": 0.0030101325901285537, "phrase": "appropriate_general_distributions"}, {"score": 0.0027159094186967247, "phrase": "efficient_and_generalized_sample_path_randomization_approach"}, {"score": 0.002379379676378223, "phrase": "estimation_algorithms"}, {"score": 0.0023104373174118458, "phrase": "practical_problems"}, {"score": 0.002276717177453959, "phrase": "rich_information"}, {"score": 0.002254510319372956, "phrase": "transient_system_behaviors"}, {"score": 0.0021361800485636823, "phrase": "repair_processes"}, {"score": 0.0021049977753042253, "phrase": "birth-death_modeling"}], "paper_keywords": ["Cloud computing", " virtual infrastructure", " fault-tolerant systems", " Markov chains"], "paper_abstract": "A central challenge in developing cloud datacenters Service Level Agreements is the estimation of downtime distribution of a set of provisioned servers over a service window, which is compounded by three facts. First, while steady-state probabilities have been derived for birth-death processes involving server failures and repairs, they could be highly inaccurate under transience. Furthermore, steady-state cannot be assured under typical service windows. Therefore, estimation of transient distributions is essential. Second, the processes of failures and repairs may follow any distribution and hence need to be extracted using system log data and modeled using appropriate general distributions. Third, downtime distributions over service windows depend on the number of servers and their deployment structure for a contract. We develop an efficient and generalized sample path randomization approach to precisely estimate transient probabilities under three different checkpointing strategies and three flexible failure distribution models. The estimators are unbiased, consistent, efficient and sufficient. Their asymptotic convergence is established. The estimation algorithms are computationally efficient in solving practical problems and yield rich information on transient system behaviors. The methodology is general and extensible to various server failure and repair processes characterized using birth-death modeling.", "paper_title": "Predicting Transient Downtime in Virtual Server Systems: An Efficient Sample Path Randomization Approach", "paper_id": "WOS:000364867200017"}