{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "inference"}, {"score": 0.004680473391946691, "phrase": "recognition_algorithms"}, {"score": 0.0046364836476864325, "phrase": "\"distance-based\"_methods"}, {"score": 0.00438105507792004, "phrase": "feature_space"}, {"score": 0.004081385289516914, "phrase": "fundamentally_different_approach"}, {"score": 0.003102752392819577, "phrase": "novel_generative_models"}, {"score": 0.00297346171320082, "phrase": "-individual_variation"}, {"score": 0.0027307746993761035, "phrase": "nonlinear_case"}, {"score": 0.002679585860537941, "phrase": "arbitrary_face_manifold"}, {"score": 0.0024960069794216977, "phrase": "\"tied\"_version"}, {"score": 0.002426137929553722, "phrase": "explicit_comparison"}, {"score": 0.0023806459272452353, "phrase": "quite_different_viewing_conditions"}, {"score": 0.0021049977753042253, "phrase": "varying_pose"}], "paper_keywords": ["Computing methodologies", " pattern recognition", " applications", " face and gesture recognition"], "paper_abstract": "Many face recognition algorithms use \"distance-based\" methods: Feature vectors are extracted from each face and distances in feature space are compared to determine matches. In this paper, we argue for a fundamentally different approach. We consider each image as having been generated from several underlying causes, some of which are due to identity (latent identity variables, or LIVs) and some of which are not. In recognition, we evaluate the probability that two faces have the same underlying identity cause. We make these ideas concrete by developing a series of novel generative models which incorporate both within-individual and between-individual variation. We consider both the linear case, where signal and noise are represented by a subspace, and the nonlinear case, where an arbitrary face manifold can be described and noise is position-dependent. We also develop a \"tied\" version of the algorithm that allows explicit comparison of faces across quite different viewing conditions. We demonstrate that our model produces results that are comparable to or better than the state of the art for both frontal face recognition and face recognition under varying pose.", "paper_title": "Probabilistic Models for Inference about Identity", "paper_id": "WOS:000297069900010"}