{"auto_keywords": [{"score": 0.049766045322984266, "phrase": "educational_innovation"}, {"score": 0.006931724394254109, "phrase": "epistemological_spiral"}, {"score": 0.006708608587395886, "phrase": "ontological_spiral"}, {"score": 0.00481495049065317, "phrase": "individual_experience"}, {"score": 0.004736666296080189, "phrase": "organisational_knowledge"}, {"score": 0.004690305164360866, "phrase": "university_sector"}, {"score": 0.00465964893087681, "phrase": "purpose_-_the_purpose"}, {"score": 0.004494570360108983, "phrase": "knowledge_management_system"}, {"score": 0.004392565073466714, "phrase": "new_knowledge"}, {"score": 0.003890482910262832, "phrase": "nonaka"}, {"score": 0.003548905904860611, "phrase": "management_system"}, {"score": 0.0032054891061528896, "phrase": "double_spiral"}, {"score": 0.0031326477464204768, "phrase": "conceptual_model"}, {"score": 0.0030715271045670504, "phrase": "innovative_tool"}, {"score": 0.0030115953761477503, "phrase": "effective_management"}, {"score": 0.0028952071490475997, "phrase": "educational_innovation_best_practices"}, {"score": 0.0028016507334576216, "phrase": "presented_model"}, {"score": 0.0027200305495826797, "phrase": "best_practices_repositories"}, {"score": 0.0026933542552712033, "phrase": "huge_impact"}, {"score": 0.002675715174122091, "phrase": "education_innovation_recognition"}, {"score": 0.002649472341607234, "phrase": "professional_development"}, {"score": 0.0026321198895843173, "phrase": "university_teachers"}, {"score": 0.002538687900036229, "phrase": "best_practices"}, {"score": 0.002255431275670053, "phrase": "classification_schema"}, {"score": 0.002233301265743633, "phrase": "proposed_indicators"}], "paper_keywords": ["Knowledge management system", " Ontologies", " Repositories", " Epistemology", " Educational innovation", " Knowledge management process"], "paper_abstract": "Purpose - The purpose of this paper is to introduce the development of a knowledge management system. It allows the creation of new knowledge, its consolidation, distribution and combination in the field of educational innovation, in such a way that the knowledge is transferred from individuals to the organisation and from the organisation to individuals. To achieve this, the knowledge spirals of Nonaka are integrated. The epistemological spiral is used to obtain the ontologies that feed the ontological spiral. Design/methodology/approach - More than 600 university teachers participated in the research and the development of the management system, in which more than 400 educational innovation experiences and 1,100 authors have been included. Findings - The epistemological spiral is used to obtain the ontologies that feed the ontological spiral. The result is a double spiral that allows the contribution of a conceptual model and the development of an innovative tool that enables and automates the effective management of knowledge in educational innovation. Practical implications - A repository about educational innovation best practices and experiences is available. Social implications - The presented model for the sustainability and evolution for an educational innovation best practices repositories has a huge impact for education innovation recognition in the professional development of university teachers. On the other hand, it is way of sharing best practices of educational innovation all over the world. Originality/value - The major contribution of this research work is based on the way that the knowledge is transferred from individuals to the organisation and from the organisation to individuals. The classification schema and the proposed indicators are based on the elicitation of more than 600 experts and the study of a corpus of more than 400 educational innovation experiences that involve 1,100 university teachers approximately.", "paper_title": "Epistemological and ontological spirals From individual experience in educational innovation to the organisational knowledge in the university sector", "paper_id": "WOS:000357422900003"}