{"auto_keywords": [{"score": 0.037509494371272115, "phrase": "gold_strategies"}, {"score": 0.026026257620633073, "phrase": "dsa"}, {"score": 0.020078686809695802, "phrase": "gold_objects"}, {"score": 0.012850031964337226, "phrase": "collusion_attacks"}, {"score": 0.008713768692145006, "phrase": "dawid-skene_algorithm"}, {"score": 0.00478579024367007, "phrase": "low-competence_raters"}, {"score": 0.004780656538001965, "phrase": "adaptive_algorithm"}, {"score": 0.004713656264685915, "phrase": "gold-selection_strategies"}, {"score": 0.004614483128885678, "phrase": "collaborative_ratings"}, {"score": 0.00453113241842654, "phrase": "popular_method"}, {"score": 0.004498850790363065, "phrase": "low-competence_settings"}, {"score": 0.004148924650733264, "phrase": "low_competence"}, {"score": 0.0038805454197432337, "phrase": "collusion_attack"}, {"score": 0.003079696561895752, "phrase": "low-competence_setting"}, {"score": 0.003051713660488494, "phrase": "satisfying_degree"}, {"score": 0.0029244418026475832, "phrase": "community_members"}, {"score": 0.0027601397818618617, "phrase": "net_benefit"}, {"score": 0.0025578967205807843, "phrase": "runtime_information"}, {"score": 0.0023632309822037637, "phrase": "high_level"}, {"score": 0.0021569129153653777, "phrase": "optimal_gold_ratio"}, {"score": 0.0021049977753042253, "phrase": "high_accuracy"}], "paper_keywords": ["Classification", " Dawid-Skene Algorithm", " Gold strategies", " Collusion attacks"], "paper_abstract": "More and more online communities classify contributions based on collaborative ratings of these contributions. A popular method for such a rating-based classification is the Dawid-Skene algorithm (DSA). However, despite its popularity, DSA has two major shortcomings: (1) It is vulnerable to raters with a low competence, i.e., a low probability of rating correctly. (2) It is defenseless against collusion attacks. In a collusion attack, raters coordinate to rate the same data objects with the same value to artificially increase their remuneration. In this paper, to cope with these issues, we propose gold strategies based on the level of agreement between raters. Gold strategies adopt the notion of gold objects, i.e., contributions whose true value is known. We show that selecting gold objects at random, as is common in the literature, does not increase the accuracy of DSA in a low-competence setting to a satisfying degree. Instead, our gold strategies select contributions based on the level of agreement between community members, i.e., to which extent their ratings agree on the class of a given contribution. To maximize the net benefit of gold objects, i.e., their benefit minus their costs, we propose an adaptive algorithm. It determines the number of gold objects based on runtime information. We extensively evaluate the effectiveness of gold strategies in low-competence settings and against collusion attacks by means of simulation. We find that gold strategies based on a high level of agreement between raters improve the accuracy of DSA in low-competence settings considerably. Further, the gold strategies are highly effective against collusion attacks. Finally, the adaptive algorithm determines the optimal gold ratio for each strategy and each setting with high accuracy.", "paper_title": "Protecting the Dawid-Skene algorithm against low-competence raters and collusion attacks with gold-selection strategies", "paper_id": "WOS:000366196300042"}