{"auto_keywords": [{"score": 0.03585984673974763, "phrase": "science"}, {"score": 0.004371160978838441, "phrase": "proper_allocation"}, {"score": 0.003968112038249246, "phrase": "philosophical_view"}, {"score": 0.0036660436272785476, "phrase": "scientific_circles"}, {"score": 0.00352371416065881, "phrase": "scientometric_way"}, {"score": 0.003372019835750424, "phrase": "unexpected_results"}, {"score": 0.003298631258267805, "phrase": "actual_trend"}, {"score": 0.00284009509859163, "phrase": "historical_sciences"}, {"score": 0.002705808393126695, "phrase": "computer_science"}, {"score": 0.002682081928174866, "phrase": "social_science"}, {"score": 0.002600661525224505, "phrase": "respect_chemistry"}, {"score": 0.0024451427672857458, "phrase": "abovementioned_three_scientific_fields"}, {"score": 0.0023192471808039746, "phrase": "galilei's_view"}, {"score": 0.002142426911242168, "phrase": "technical_instruments"}], "paper_keywords": [""], "paper_abstract": "What is science is not only intellectually interesting but also politically crucial in the proper allocation of budget. As science does not define itself and only philosophy defines everything including science, this paper first sketches the philosophical view of science. Then, hypotheses are presented as to what definition is actually given for science by scientific circles themselves. The hypotheses are tested in a scientometric way by observing the trend in the magazine Science. Unexpected results are obtained. The actual trend in Science does not reflect what has long been considered about science. Specifically, chemistry is at the top in the number of papers, far above physics. More papers are in historical sciences (part of the humanities) than in mathematics, computer science and social science. It is discussed in what respect chemistry is the most scientific, and the humanities is more scientific than the abovementioned three scientific fields. It is interpreted that, out of the two aspects in Galilei's view of science (metodo compositivo and metodo risolutivo.), the latter (empirical solution of problems by using technical instruments) dominates the former (systematic theory using mathematics) in Science.", "paper_title": "Scientometric definition of science: In what respect is the humanities more scientific than mathematical and social sciences?", "paper_id": "WOS:000256779500002"}