{"auto_keywords": [{"score": 0.04107868567004354, "phrase": "actional_information"}, {"score": 0.005792082218416752, "phrase": "new_web-based_weight_management_services"}, {"score": 0.00478579024367007, "phrase": "web_based_weight_maintenance_services"}, {"score": 0.004756805752518494, "phrase": "purpose_-_the_purpose"}, {"score": 0.004490020801780961, "phrase": "health_behaviour_change"}, {"score": 0.004422325007817267, "phrase": "internet_use"}, {"score": 0.004395540345095467, "phrase": "finland"}, {"score": 0.0043162052360755255, "phrase": "europe"}, {"score": 0.004148924650733264, "phrase": "theoretical_approach"}, {"score": 0.004000322474812552, "phrase": "web-based_weight_maintenance_information"}, {"score": 0.003775803846431323, "phrase": "theory-based_content_analysis"}, {"score": 0.003574695610710444, "phrase": "factual_and_tailored_information"}, {"score": 0.0033230588808076267, "phrase": "weight_maintenance"}, {"score": 0.0031364320619313765, "phrase": "free_content"}, {"score": 0.00303319936111073, "phrase": "socially_interactive_information"}, {"score": 0.00291555613737437, "phrase": "proposed_approach"}, {"score": 0.002828166765606611, "phrase": "weight_maintenance_information"}, {"score": 0.002636956926079255, "phrase": "information_environment"}, {"score": 0.0025039656549083497, "phrase": "information_content"}, {"score": 0.0023632309822037637, "phrase": "social_support"}, {"score": 0.0023417427763424916, "phrase": "long-term_weight_maintenance"}, {"score": 0.002285389120812562, "phrase": "novel_approach"}, {"score": 0.0022101055924375725, "phrase": "new_viewpoints"}, {"score": 0.0021900066569764862, "phrase": "information_behaviour"}, {"score": 0.0021767087933168717, "phrase": "organisational_knowledge"}, {"score": 0.0021307975800397816, "phrase": "weight_maintenance_information_use"}, {"score": 0.0021049977753042253, "phrase": "theoretical_background"}], "paper_keywords": ["Knowing", " Health information", " Weight maintenance", " Health behaviour change", " Web-based services"], "paper_abstract": "Purpose - The purpose of this paper is to increase understanding of the role of information and knowledge in the context of health behaviour change. Design/methodology/approach - As internet use in Finland is among the highest in Europe, two Finnish web-based weight management services were analysed regarding their weight maintenance information by using a theoretical approach constructed for the purpose. The approach combines the elements of web-based weight maintenance information and the typologies of knowing and actional information. The approach was tested by examining the services deductively with theory-based content analysis. Findings - The approach indicated differences between the profiles of the two analysed information environments, which focus on factual and tailored information and their relation to pragmatic, provisional and contested knowing and the initiation, maintenance and recovery of actional information. Both services support weight maintenance; the other slightly more due to its rich social features. Research limitations/implications - The examination was focused on the free content of two Finnish weight management services. Further research should include the role of socially interactive information and further testing of the approach with more services. Practical implications - The proposed approach sheds light on the relationship between the types of weight maintenance information and the dimensions of the typologies of knowing and actional information. The approach has the potential to be applied when designing the information environment of new web-based weight management services. Social implications - The approach has potential to be applied when designing the information content of new web-based weight management services to support health behaviour change. The approach could be elaborated further by focusing on enabling social support required in long-term weight maintenance. Originality/value - The study adopted a novel approach to studying typologies of knowing and actional information, thus providing new viewpoints in both information behaviour and organisational knowledge. The study enables further research on weight maintenance information use by proposing a theoretical background.", "paper_title": "Knowing and actional information in web based weight maintenance services", "paper_id": "WOS:000341925900003"}