{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "associative_classification"}, {"score": 0.0047370749839861165, "phrase": "novel_interestingness_measures"}, {"score": 0.004610058444728656, "phrase": "significant_attention"}, {"score": 0.004437910956996051, "phrase": "good_results"}, {"score": 0.004389912080394437, "phrase": "previous_research_efforts"}, {"score": 0.00349324530379071, "phrase": "existing_associative_classification_algorithm"}, {"score": 0.003399466007862412, "phrase": "former_interesting_measure"}, {"score": 0.003236941658990869, "phrase": "meaningful_association_rules"}, {"score": 0.0028249975318149468, "phrase": "primary_sorting_criterion"}, {"score": 0.0027341763737751467, "phrase": "well-known_cba_algorithm"}, {"score": 0.0025892330566358503, "phrase": "rule_sets"}, {"score": 0.002386062690026682, "phrase": "accurate_and_significantly_more_compact_decision_lists"}, {"score": 0.0022228943786652914, "phrase": "separate_credit_scoring_dataset"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["associative classification", " intensity of implication", " dilated chi-square", " credit scoring"], "paper_abstract": "Associative classification has aroused significant attention in recent years and proved to generate good results in previous research efforts. This paper aims to contribute to this line of research by the development of more effective associative classifiers. Our goal is to achieve this by the incorporation of two novel interesting measures, i.e. intensity of implication and dilated chi-square, into an existing associative classification algorithm, respectively. The former interesting measure was merely proposed with the purpose of mining meaningful association rules, while the latter was designed to reveal the interdependence between condition and class variables. Each of these two measures is applied as the primary sorting criterion within the context of the well-known CBA algorithm in an attempt to organize the composition of the rule sets in a more reasonable sequence. Benchmarking experiments on 16 popular UCI datasets revealed that our algorithms could empirically generate accurate and significantly more compact decision lists. In addition to this, the algorithm was validated on a separate credit scoring dataset, which contained 7190 credit scoring samples. (c) 2005 Elsevier Ltd. All rights reserved.", "paper_title": "Improving associative classification by incorporating novel interestingness measures", "paper_id": "WOS:000236903700021"}