{"auto_keywords": [{"score": 0.015344193369126822, "phrase": "differential_evolution"}, {"score": 0.004562847483469705, "phrase": "simple_and_efficient_global_optimization_algorithm"}, {"score": 0.004240116703465252, "phrase": "global_optimum"}, {"score": 0.0041174821422410544, "phrase": "limited_number"}, {"score": 0.004077394032903726, "phrase": "function_evaluations"}, {"score": 0.0038827100184187805, "phrase": "research_direction"}, {"score": 0.0036434143094097988, "phrase": "de"}, {"score": 0.003192312493850036, "phrase": "unconstrained_global_optimization_problems"}, {"score": 0.003115105266246263, "phrase": "k_cluster_centers"}, {"score": 0.0027561164046279413, "phrase": "search_efficiency"}, {"score": 0.0026115277372906805, "phrase": "comprehensive_set"}, {"score": 0.002535876002754739, "phrase": "experimental_verification"}, {"score": 0.002511147699138714, "phrase": "experimental_results"}, {"score": 0.0021891781017389783, "phrase": "solution_accuracy"}, {"score": 0.002157223877108711, "phrase": "convergence_rate"}], "paper_keywords": ["Differential evolution", " k-Means clustering", " 2 Multi-parent crossovers", " Global optimization"], "paper_abstract": "Differential evolution (DE) is a simple and efficient global optimization algorithm. However, DE has been shown to have certain weaknesses, especially if the global optimum should be located using a limited number of function evaluations (NFEs). Hence hybridization with other methods is a research direction for the improvement of differential evolution. In this paper, a hybrid DE based on the one-step k-means clustering and 2 multi-parent crossovers, called clustering-based differential evolution with 2 multi-parent crossovers (2-MPCs-CDE) is proposed for the unconstrained global optimization problems. In 2-MPCs-CDE, k cluster centers and several new individuals generate two search spaces. These spaces are then searched in turn. This method utilizes the information of the population effectively and improves search efficiency. Hence it can enhance the performance of DE. A comprehensive set of 35 benchmark functions is employed for experimental verification. Experimental results indicate that 2-MPCs-CDE is effective and efficient. Compared with other state-of-the-art evolutionary algorithms, 2-MPCs-CDE performs better, or at least comparably, in terms of the solution accuracy and the convergence rate. (C) 2011 Elsevier B. V. All rights reserved.", "paper_title": "A novel clustering-based differential evolution with 2 multi-parent crossovers for global optimization", "paper_id": "WOS:000298631400009"}