{"auto_keywords": [{"score": 0.019480155292004503, "phrase": "knowledge_sharing"}, {"score": 0.009239374183255688, "phrase": "china"}, {"score": 0.007740489563401459, "phrase": "employee_perceptions"}, {"score": 0.007113753083665825, "phrase": "virtual_communities"}, {"score": 0.006929692292701883, "phrase": "knowledge_quantity"}, {"score": 0.006633376085875303, "phrase": "individual_differences"}, {"score": 0.00578403941387693, "phrase": "knowledge_management_practice"}, {"score": 0.0045286036546553585, "phrase": "useful_platform"}, {"score": 0.004372655124839401, "phrase": "big_challenge"}, {"score": 0.0039018217318645115, "phrase": "mean_difference"}, {"score": 0.0037235938085914836, "phrase": "knowledge_contributing"}, {"score": 0.0034612143745796705, "phrase": "data_analysis"}, {"score": 0.003430993453999572, "phrase": "independent_samples_t-test"}, {"score": 0.0034109924073788215, "phrase": "one-way_analysis"}, {"score": 0.0032078703296827436, "phrase": "independent_samples"}, {"score": 0.0031337062789085868, "phrase": "anova"}, {"score": 0.0029556753467726983, "phrase": "paired_samples"}, {"score": 0.0027795914404096754, "phrase": "correlation_analysis"}, {"score": 0.0027472573325469144, "phrase": "positive_correlations"}, {"score": 0.0026524883963026987, "phrase": "practical_implications"}, {"score": 0.0026063337716985906, "phrase": "chinese_organizations"}, {"score": 0.0025385994743190796, "phrase": "western_countries"}, {"score": 0.0024581931389119913, "phrase": "useful_insights"}, {"score": 0.002436708489257137, "phrase": "informal_knowledge_sharing"}, {"score": 0.0023049225851832084, "phrase": "knowledge_quality"}, {"score": 0.0021173571273465416, "phrase": "new_view"}, {"score": 0.0021049977753042253, "phrase": "knowledge_sharing_research"}], "paper_keywords": ["China", " Trust", " Virtual communities", " Knowledge contributing", " Knowledge seeking"], "paper_abstract": "Purpose - With the development of Web 2.0 virtual communities, the authors see a useful platform for knowledge sharing. However, knowledge sharing in virtual communities still remains a big challenge given the concern of knowledge quantity and quality. The purpose of this paper is to explore the effect of individual differences on knowledge contributing, knowledge seeking, trust and norm of reciprocity. This study also explores the mean difference between knowledge seeking and knowledge contributing as well as the correlations between knowledge seeking, knowledge contributing, trust and reciprocity so as to provide some guidance for knowledge management practice in China. Design/methodology/approach - Data collected from 430 users of Web 2.0 virtual communities were used for data analysis. The independent samples t-test, one-way analysis of variance (ANOVA), paired samples t-test and correlation analysis were employed. Findings - The independent samples t-test and one-way ANOVA present the effect of individual differences on knowledge contributing, knowledge seeking, trust and norm of reciprocity. The paired samples t-test suggests that employees are more likely to seek knowledge from than contribute knowledge to Web 2.0 virtual communities. The correlation analysis suggests there are positive correlations between knowledge contributing, knowledge seeking, trust and reciprocity. Practical implications - Knowledge management initiatives in Chinese organizations are encountered relatively less frequently, compared with western countries. The authors suggest the findings of this study provide useful insights into the informal knowledge sharing in Web 2.0 virtual communities, which is helpful for guiding knowledge management practice in China. Originality/value - Based on knowledge quantity and knowledge quality whose significance cannot be over-emphasized in virtual communities, this study explores employee perceptions of Web 2.0 virtual communities from the perspective of knowledge sharing, which the authors think provides a new view for knowledge sharing research and practice alike in China.", "paper_title": "Exploring employee perceptions of Web 2.0 virtual communities from the perspective of knowledge sharing", "paper_id": "WOS:000341648900003"}