{"auto_keywords": [{"score": 0.0437474535811276, "phrase": "rfid"}, {"score": 0.026252048892171424, "phrase": "business_applications"}, {"score": 0.012307571000973891, "phrase": "rfid_applications"}, {"score": 0.009600778783718471, "phrase": "rfid_events"}, {"score": 0.009489066113759234, "phrase": "business_rules"}, {"score": 0.008053870582016941, "phrase": "business_services"}, {"score": 0.00481495049065317, "phrase": "rfid-enabled_applications"}, {"score": 0.004744686475551315, "phrase": "automatic_object_identification"}, {"score": 0.004716867446922295, "phrase": "distributed_computing_technology"}, {"score": 0.004580188715162227, "phrase": "ubiquitous_computing_environment"}, {"score": 0.004395437013020554, "phrase": "supply_chains"}, {"score": 0.004218106399666514, "phrase": "epcglobal"}, {"score": 0.00400053884985293, "phrase": "useful_rfid_business_applications"}, {"score": 0.00389598376050187, "phrase": "rfid_technology"}, {"score": 0.0038053333794618002, "phrase": "complex_processes"}, {"score": 0.003556251226438769, "phrase": "epc_network"}, {"score": 0.0035042905855674875, "phrase": "real_advantages"}, {"score": 0.0033529044784726477, "phrase": "large_amount"}, {"score": 0.0033332184113249444, "phrase": "event_data"}, {"score": 0.0033039051001591724, "phrase": "rfid_operations"}, {"score": 0.0030966491684507646, "phrase": "meaningful_high-level_events"}, {"score": 0.0028683597138449467, "phrase": "business_logic"}, {"score": 0.002720221357742017, "phrase": "business-aware_framework"}, {"score": 0.0026962843404969286, "phrase": "rfid_business_applications"}, {"score": 0.002512198778854243, "phrase": "proposed_framework"}, {"score": 0.00237539960152304, "phrase": "generated_events"}, {"score": 0.002320047233050843, "phrase": "additional_data_collection"}, {"score": 0.002252662984070481, "phrase": "data_collection"}, {"score": 0.0021872315757161644, "phrase": "rapid_development"}, {"score": 0.002174374647551399, "phrase": "easy_maintenance"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["RFID", " RFID business event", " RFID application development framework"], "paper_abstract": "Automatic object identification and distributed computing technology have recently been investigated in order to realize a ubiquitous computing environment. Radio-frequency identification (RFID) technology has been applied to many business areas such as logistics and supply chains. The Electronic Product Code (EPC) Network, an open global standard proposed by EPCglobal, links RFID to the Internet to enable immediate, automatic identification and secure sharing of information about items. Useful RFID business applications can be developed on this Network. The RFID technology has been applied to many business areas to simplify complex processes. However, RFID applications are difficult to develop because there are many components, interfaces, and protocols to be considered in the EPC Network. To exploit the real advantages of RFID, systems should be able to rapidly implement functions to process the large amount of event data generated by RFID operations, and these systems should be configured dynamically for changing businesses. Consequently, developers have to implement systems to derive meaningful high-level events from simple RFID events and bind them to various business processes. Although applications can directly consume and act on RFID events, extracting the business rules from the business logic leads for improve the decoupling of the system, which consequently improves maintainability. We propose a business-aware framework for developing RFID business applications cost-effectively on the EPC Network. The framework also supports the operation and maintenance of RFID applications as middleware to process RFID events. The proposed framework can be used for developing business applications for business services. The term \"business services\" refers to the generated events that can be used in business applications without additional data collection and processing. The framework provides business rules related to data collection, processing, and management, and supports the rapid development and easy maintenance of business applications based on business services. (C) 2010 Elsevier Ltd. All rights reserved.", "paper_title": "Business-aware framework for supporting RFID-enabled applications in EPC Network", "paper_id": "WOS:000289137800016"}