{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "ranking-based_recommendation"}, {"score": 0.004657185361669812, "phrase": "innate_characteristic"}, {"score": 0.004595529592539951, "phrase": "recommender_system_databases"}, {"score": 0.004270665568018583, "phrase": "collaborative_filtering_methods"}, {"score": 0.003942299471749811, "phrase": "hierarchical_ltemspace_rank"}, {"score": 0.00378767277402891, "phrase": "novel_recommendation_algorithm"}, {"score": 0.003687960013746783, "phrase": "intrinsic_hierarchical_structure"}, {"score": 0.003381607100127276, "phrase": "related_limitations"}, {"score": 0.003163326114997034, "phrase": "comprehensive_set"}, {"score": 0.0025042115651986332, "phrase": "hir"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Recommender systems", " Collaborative filtering", " Sparsity", " Ranking algorithms", " Experiments"], "paper_abstract": "Sparsity is an innate characteristic of recommender system databases and it is known to present one of the most challenging difficulties collaborative filtering methods have to deal with. In this paper, we propose Hierarchical ltemspace Rank (HIR); a novel recommendation algorithm that exploits the intrinsic hierarchical structure of the itemspace to tackle this problem, and to alleviate the related limitations it imposes to the quality of recommendation. A comprehensive set of experiments on the Movie-Lens100K, the MovieLens1M and the Yahoo !R2Music datasets indicates that our method is very effective in handling sparsity, even in its most extreme manifestation - the cold-start problem. Our tests show that HIR outperforms several state-of-the-art recommendation algorithms in widely used metrics, having at the same time the advantage of being computationally efficient and easily implementable. (C) 2015 Elsevier B.V. All rights reserved.", "paper_title": "Hierarchical Itemspace Rank: Exploiting hierarchy to alleviate sparsity in ranking-based recommendation", "paper_id": "WOS:000356196800015"}