{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "large_scale_participation"}, {"score": 0.004786211598268987, "phrase": "citizen_engagement"}, {"score": 0.004757643419056999, "phrase": "ubiquitous_computing"}, {"score": 0.0047292449487169345, "phrase": "cyber_physical_systems"}, {"score": 0.004617328272121826, "phrase": "today's_ubiquitous_computing_technologies"}, {"score": 0.00384633057714983, "phrase": "urban_computing_projects"}, {"score": 0.0037664981403399064, "phrase": "controlled_research_environment"}, {"score": 0.0036443694410100507, "phrase": "urban_context"}, {"score": 0.0034118234596993836, "phrase": "active_participation"}, {"score": 0.0033914308417007316, "phrase": "technological_uptake"}, {"score": 0.003371159698962328, "phrase": "urban_computing"}, {"score": 0.0032814236411444022, "phrase": "urban_computing_research"}, {"score": 0.003174973355583627, "phrase": "mass_participation"}, {"score": 0.0029901699209266435, "phrase": "existing_approaches"}, {"score": 0.002893140560765452, "phrase": "existing_urban_computing_technologies"}, {"score": 0.0027741761880779535, "phrase": "embedded_systems"}, {"score": 0.0025660347613972573, "phrase": "urban_computing_technologies"}, {"score": 0.0024604876113911173, "phrase": "participation_scale"}, {"score": 0.0021953290937408807, "phrase": "large_scale_urban_computing_projects"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Urban computing", " Large-scale participation", " Cyber-physical systems", " Internet of Things", " Smartphones", " Human in the loop", " Public displays", " Urban probes", " Public spectacle", " Urban interventions", " Crowdsourcing", " Crowdsensing", " Ubiquitous computing"], "paper_abstract": "With today's ubiquitous computing technologies, our daily activities are continuously traced by smartphones in our pockets and more of our everyday things are now connected to the Internet. This phenomena is changing the way we live, work, and interact. This creates, not only technological opportunities for smarter cities, but also interactional opportunities for the citizens. However, designing, developing, and deploying urban computing projects in the wild, outside the controlled research environment, is challenging, due to the complexity of the urban context as well as the people who live in it. What are the ways to trigger and increase the public towards active participation or technological uptake in urban computing? How to design and structure participation for urban computing research and technologies in the wild for it to lead to mass participation with its citizens? These are the questions that are investigated in this paper. We present a survey on existing approaches in engaging participations and devising interactions with a range of existing urban computing technologies: smartphones, public displays, cyber physical systems (including those with embedded systems, sensors, and actuators), and Internet of Things. Based on the reviews, we propose a taxonomy for categorising and characterising urban computing technologies and approaches with regards to the level of participation they stimulate, the participation scale they support, the manipulation and effects mode they enable, and the interaction mode and scale they enable. Finally, strategies for structuring and engendering participations and interactions based on our own experience from deploying small to large scale urban computing projects in the wild are presented in this paper. (C) 2015 Elsevier Ltd. All rights reserved.", "paper_title": "Urban computing in the wild: A survey on large scale participation and citizen engagement with ubiquitous computing, cyber physical systems, and Internet of Things", "paper_id": "WOS:000356195600004"}