{"auto_keywords": [{"score": 0.042767390020699285, "phrase": "msc_specifications"}, {"score": 0.014862137826237274, "phrase": "different_types"}, {"score": 0.013790016985693446, "phrase": "software_engineers"}, {"score": 0.012456075246845616, "phrase": "msc_pathologies"}, {"score": 0.010548063303579543, "phrase": "pathology_framework"}, {"score": 0.00481495049065317, "phrase": "message_sequence_charts"}, {"score": 0.004161553532799662, "phrase": "possible_problems"}, {"score": 0.004007083686875716, "phrase": "design_problems"}, {"score": 0.003953311083262807, "phrase": "observed_problems"}, {"score": 0.0038271712887391015, "phrase": "clearer_view"}, {"score": 0.003775803846431323, "phrase": "formal_relationships"}, {"score": 0.0035005841368145525, "phrase": "distributed_system"}, {"score": 0.003289534854212415, "phrase": "existing_concepts"}, {"score": 0.003245359940011418, "phrase": "refined_and_necessary_concepts"}, {"score": 0.002952259134660412, "phrase": "problematic_scenarios"}, {"score": 0.002928399649340438, "phrase": "single_undesirable_event"}, {"score": 0.002865710140187219, "phrase": "disjoint_categories"}, {"score": 0.002789226820897593, "phrase": "identified_types"}, {"score": 0.002416589459425828, "phrase": "single_undesirable_event_restriction"}, {"score": 0.0023712394008737958, "phrase": "pathological_scenarios"}, {"score": 0.002333044307949414, "phrase": "potential_practical_benefit"}, {"score": 0.0023141775604479265, "phrase": "software_engineer"}, {"score": 0.0022892584716505218, "phrase": "key_problematic_scenarios"}, {"score": 0.0022101055924375725, "phrase": "msc_specification_m"}, {"score": 0.0021569129153653777, "phrase": "potential_problems"}, {"score": 0.0021050027911633028, "phrase": "elsevier"}], "paper_keywords": ["Message sequence charts", " Pathology", " Race", " Non-local choice", " Implied scenarios"], "paper_abstract": "Context: It is known that a Message Sequence Chart (MSC) specification can contain different types of pathology. However, definitions of different types of pathology and the problems caused by pathologies are unclear, let alone the relationships between them. In this circumstance, it can be problematic for software engineers to accurately predict the possible problems that may exist in implementations of MSC specifications and to trace back to the design problems in MSC specifications from the observed problems of an implementation. Objective: We focus on generating a clearer view on MSC pathologies and building formal relationships between pathologies and the problems that they may cause. Method: By concentrating on the problems caused by pathologies, a categorisation of problems that a distributed system may suffer is first introduced. We investigate the different types of problems and map them to categories of pathologies. Thus, existing concepts related to pathology are refined and necessary concepts in the pathology framework are identified. Finally, we formally prove the relationships between the concepts in the framework. Results: A pathology framework is established as desired based on a restriction that considers problematic scenarios with a single undesirable event. In this framework, we define disjoint categories of both pathologies and the problems caused: the identified types of pathology are successfully mapped to the problems that they may cause. Conclusion: The framework achieved in this paper introduces taxonomies into and clarifies relationships between concepts in research on MSC pathologies. The taxonomies and relationships in the framework can help software engineers to predict problems and verify MSC specifications. The single undesirable event restriction not only enables a categorisation of pathological scenarios, but also has the potential practical benefit that a software engineer can concentrate on key problematic scenarios. This may make it easier to either remove pathologies from an MSC specification M or test an implementation developed from M for potential problems resulting from such pathologies. (c) 2012 Elsevier BM. All rights reserved.", "paper_title": "A framework for pathologies of message sequence charts", "paper_id": "WOS:000308387500010"}