{"auto_keywords": [{"score": 0.032394483004615865, "phrase": "collective_intuitionistic_fuzzy_decision_matrix"}, {"score": 0.012425691275991208, "phrase": "decision_makers"}, {"score": 0.009294334884301245, "phrase": "score_matrix"}, {"score": 0.00481495049065317, "phrase": "intuitionistic_fuzzy_environment"}, {"score": 0.004771196027464407, "phrase": "intuitionistic_fuzzy_numbers"}, {"score": 0.0042178318724732005, "phrase": "decision_information"}, {"score": 0.004122604238556912, "phrase": "decision_making"}, {"score": 0.003956558420993431, "phrase": "group_decision"}, {"score": 0.0037284065559949064, "phrase": "intuitionistic_fuzzy_decision_matrices"}, {"score": 0.003561865840737996, "phrase": "fuzzy_number"}, {"score": 0.003465521267039616, "phrase": "attribute_weights"}, {"score": 0.0031627430133087616, "phrase": "individual_intuitionistic_fuzzy_decision_matrices"}, {"score": 0.0029802289354540507, "phrase": "score_function"}, {"score": 0.0028863414975346512, "phrase": "attribute_value"}, {"score": 0.002634031703695684, "phrase": "optimization_models"}, {"score": 0.0022857351723674004, "phrase": "overall_intuitionistic_fuzzy_values"}, {"score": 0.0021049977753042253, "phrase": "illustrative_example"}], "paper_keywords": ["multi-person multi-attribute decision making", " intuitionistic fuzzy decision matrix", " intuitionistic fuzzy number", " intuitionistic fuzzy weighted geometric (IFWG) operator", " intuitionistic fuzzy hybrid geometric (IFHG) operator"], "paper_abstract": "Intuitionistic fuzzy numbers, each of which is characterized by the degree of membership and the degree of non-membership of an element, are a very useful means to depict the decision information in the process of decision making. In this article, we investigate the group decision making problems in which all the information provided by the decision makers is expressed as intuitionistic fuzzy decision matrices where each of the elements is characterized by intuitionistic fuzzy number, and the information about attribute weights is partially known, which may be constructed by various forms. We first use the intuitionistic fuzzy hybrid geometric (IFHG) operator to aggregate all individual intuitionistic fuzzy decision matrices provided by the decision makers into the collective intuitionistic fuzzy decision matrix, then we utilize the score function to calculate the score of each attribute value and construct the score matrix of the collective intuitionistic fuzzy decision matrix. Based on the score matrix and the given attribute weight information, we establish some optimization models to determine the weights of attributes. Furthermore, we utilize the obtained attribute weights and the intuitionistic fuzzy weighted geometric (IFWG) operator to fuse the intuitionistic fuzzy information in the collective intuitionistic fuzzy decision matrix to get the overall intuitionistic fuzzy values of alternatives by which the ranking of all the given alternatives can be found. Finally, we give an illustrative example.", "paper_title": "Multi-person multi-attribute decision making models under intuitionistic fuzzy environment", "paper_id": "WOS:000259099900003"}