{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "code_obfuscation"}, {"score": 0.0047013405841819025, "phrase": "java_code"}, {"score": 0.004546755482549647, "phrase": "common_technique"}, {"score": 0.004418287966422041, "phrase": "malicious_reverse_engineering"}, {"score": 0.004313996835376177, "phrase": "source_code"}, {"score": 0.003977403701783668, "phrase": "different_obfuscation_algorithms"}, {"score": 0.0037199473428123175, "phrase": "large_scale_study"}, {"score": 0.00326939082861424, "phrase": "project_managers"}, {"score": 0.002845883666777154, "phrase": "source_code_obfuscations"}, {"score": 0.002537097217899195, "phrase": "considered_obfuscations"}, {"score": 0.0024771000236931836, "phrase": "code_metrics"}, {"score": 0.002406968743305622, "phrase": "obfuscated_code"}, {"score": 0.0022401855403251653, "phrase": "different_metrics"}, {"score": 0.0021049977753042253, "phrase": "security_requirements"}], "paper_keywords": [""], "paper_abstract": "Context: Obfuscation is a common technique used to protect software against malicious reverse engineering. Obfuscators manipulate the source code to make it harder to analyze and more difficult to understand for the attacker. Although different obfuscation algorithms and implementations are available, they have never been directly compared in a large scale study. Aim: This paper aims at evaluating and quantifying the effect of several different obfuscation implementations (both open source and commercial), to help developers and project managers to decide which algorithms to use. Method: In this study we applied 44 obfuscations to 18 subject applications covering a total of 4 millions lines of code. The effectiveness of these source code obfuscations has been measured using 10 code metrics, considering modularity, size and complexity of code. Results: Results show that some of the considered obfuscations are effective in making code metrics change substantially from original to obfuscated code, although this change (called potency of the obfuscation) is different on different metrics. In the paper we recommend which obfuscations to select, given the security requirements of the software to be protected.", "paper_title": "A large study on the effect of code obfuscation on the quality of java code", "paper_id": "WOS:000363032900003"}