{"auto_keywords": [{"score": 0.04942172741005563, "phrase": "online_communities"}, {"score": 0.006529936799972486, "phrase": "online_community"}, {"score": 0.00481495049065317, "phrase": "continuance_intention"}, {"score": 0.004781777766309739, "phrase": "knowledge_sharing"}, {"score": 0.004667454318370122, "phrase": "post-knowledge-sharing_evaluation_processes"}, {"score": 0.004571630734130793, "phrase": "new_world"}, {"score": 0.004416257191177784, "phrase": "virtual_internet_platform"}, {"score": 0.003490462324829042, "phrase": "emergent_mechanisms"}, {"score": 0.0030076664326204013, "phrase": "online_survey"}, {"score": 0.0022639147412879487, "phrase": "important_area"}, {"score": 0.0021417950504965997, "phrase": "starting_point"}, {"score": 0.0021049977753042253, "phrase": "continuance_behaviors"}], "paper_keywords": ["knowledge management", " user satisfaction", " communities of practice"], "paper_abstract": "Web 2.0 creates a new world of collaboration. Many online communities of practice have provided a virtual Internet platform for members to create, collaborate, and contribute their expertise and knowledge. To date, we still do not fully understand how members evaluate their knowledge-sharing experiences, and how these evaluations affect their decisions to continue sharing knowledge in online communities of practice. In this study, we examined why members continue to share knowledge in online communities of practice, through theorizing and empirically validating the factors and emergent mechanisms (post-knowledge-sharing evaluation processes) that drive continuance. Specifically, we theorized that members make judgments about their knowledge-sharing behaviors by comparing their normative expectations of reciprocity and capability of helping other members with their actual experiences. We empirically tested our research model using an online survey of members of an online community of practice. Our results showed that when members found that they receive the reciprocity they expected, they will feel satisfied. Likewise, when they found that they can help other members as they expected, they will feel satisfied and their knowledge self-efficacy will also be enhanced. Both satisfaction and knowledge self-efficacy further affect their intention to continue sharing knowledge in an online community of practice. We expect this study will generate interest among researchers in this important area of research, and that the model proposed in this article will serve as a starting point for furthering our limited understanding of continuance behaviors in online communities of practice.", "paper_title": "Understanding the continuance intention of knowledge sharing in online communities of practice through the post-knowledge-sharing evaluation processes", "paper_id": "WOS:000323389100006"}