{"auto_keywords": [{"score": 0.048156877525615226, "phrase": "kripke_model"}, {"score": 0.027558059846382685, "phrase": "clarke"}, {"score": 0.00481495049065317, "phrase": "kripke_models"}, {"score": 0.004486212539464774, "phrase": "computation-tree_logic"}, {"score": 0.004403480614319231, "phrase": "recursive_algorithms"}, {"score": 0.004370814742381778, "phrase": "model_update_face"}, {"score": 0.0041488110506566825, "phrase": "universal_subformula"}, {"score": 0.004087469540575263, "phrase": "existential_subformulas"}, {"score": 0.0039088121438737924, "phrase": "existential_subformula"}, {"score": 0.0038510053729959074, "phrase": "universal_subformulas"}, {"score": 0.003137377828938824, "phrase": "previously_treated_subformulas"}, {"score": 0.002826383890518307, "phrase": "a._finally"}, {"score": 0.00269263690712392, "phrase": "model_labels"}, {"score": 0.0026134906913114642, "phrase": "emerson"}, {"score": 0.00247128526955136, "phrase": "microwave-oven_example"}, {"score": 0.0021526564019119466, "phrase": "complexity_analysis"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["CTL model update", " Model checking", " Automatic synthesis"], "paper_abstract": "We present a nondeterministic, recursive algorithm for updating a Kripke model so as to satisfy a given formula of computation-tree logic (CTL). Recursive algorithms for model update face two dual difficulties: (1) Removing transitions from a Kripke model to satisfy a universal subformula may dissatisfy some existential subformulas. Conversely, (2) adding transitions to satisfy an existential subformula may dissatisfy some universal subformulas. To overcome these difficulties, we employ protections of the form (E, A, L), recording information about the satisfaction of subformulas previously treated by the algorithm. Intuitively, (1) E is the set of transitions that we cannot remove without compromising the satisfaction of previously treated subformulas. Conversely, (2) A is the set of transitions that we can add. Hence, update proceeds without diminishing E and without augmenting A. Finally, (3) L is a set of literals protecting the model labels. We illustrate our algorithm through several examples: Emerson and Clarke's mutual-exclusion problem, Clarke et. al.'s microwave-oven example, synchronous counters, and randomly generated models and formulas. In addition, we compare our method with other update approaches for either CTL or fragments of CTL. Lastly, we provide proofs of soundness and completeness and a complexity analysis. (C) 2014 Elsevier B.V. All rights reserved.", "paper_title": "CTL update of Kripke models through protections", "paper_id": "WOS:000335637100003"}