{"auto_keywords": [{"score": 0.049248469394552366, "phrase": "acrophobic_scenarios"}, {"score": 0.00481495049065317, "phrase": "augmented_and_virtual_reality"}, {"score": 0.004552648949390462, "phrase": "acrophobia"}, {"score": 0.004319677360634253, "phrase": "virtual_reality"}, {"score": 0.004141877689172017, "phrase": "augmented_reality"}, {"score": 0.004041546659145336, "phrase": "vr_system"}, {"score": 0.0039024014688338964, "phrase": "non-phobic_users"}, {"score": 0.003663857375787215, "phrase": "acrophobic_scenario"}, {"score": 0.003218180455135933, "phrase": "adapted_sus_questionnaire"}, {"score": 0.0031182092708983184, "phrase": "anova_analyses"}, {"score": 0.0027100527874262446, "phrase": "anxiety_level"}, {"score": 0.002625824756118839, "phrase": "significant_difference"}, {"score": 0.002447882520797866, "phrase": "different_stages"}, {"score": 0.0021725732103165577, "phrase": "vr"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Augmented reality", " Acrophobia"], "paper_abstract": "Acrophobia has been treated using exposure in imagination, exposure \"in vivo\" and Virtual Reality (VR). This paper presents the development of an Augmented Reality (AR) system and a VR system that includes acrophobic scenarios. A study involving both these systems and non-phobic users has been carried out in order to compare the levels of presence and anxiety. In the acrophobic scenario, the floor fell away and the walls rose up. 20 participants took part in this study. After using each system (AR or VR), the participants were asked to fill out an adapted SUS questionnaire [26], and paired t-tests and ANOVA analyses were applied to the data obtained. For the sense of presence and anxiety levels, we did not find differences between the systems using an experiment with enough sensitivity to detect differences as large as d=0.66. For the anxiety level, the results show that there is a significant difference between the level of anxiety felt at the moment before starting the experiment and the level felt during the different stages of the experiment. For the correlation between anxiety and presence, the results show very low correlation between anxiety and presence. These results suggest that AR is likely to be as effective as VR in treating acrophobia. (C) 2010 Elsevier Ltd. All rights reserved.", "paper_title": "Using augmented and virtual reality for the development of acrophobic scenarios. Comparison of the levels of presence and anxiety", "paper_id": "WOS:000285655800014"}