{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "object_recognition"}, {"score": 0.03932122714942605, "phrase": "observed_object"}, {"score": 0.004766683200410046, "phrase": "adaptive_target_observations"}, {"score": 0.004509694461067052, "phrase": "embodied_setting"}, {"score": 0.004245051445971095, "phrase": "recognition_system"}, {"score": 0.0034348484776384643, "phrase": "object_permanence"}, {"score": 0.003282383509542342, "phrase": "observation_sequences"}, {"score": 0.0031845067058084583, "phrase": "controlled_evaluation"}, {"score": 0.0031366648074858555, "phrase": "system_behavior"}, {"score": 0.003058515297281172, "phrase": "knn_classifier"}, {"score": 0.0030278017562213265, "phrase": "bag-of-features_prototypes"}, {"score": 0.0022365262201954643, "phrase": "novel_objects"}, {"score": 0.0021049977753042253, "phrase": "previously_seen_objects"}], "paper_keywords": ["Object recognition", " Attention", " Visual search", " Fixation", " Object permanence"], "paper_abstract": "In this paper, we study object recognition in the embodied setting. More specifically, we study the problem of whether the recognition system will benefit from acquiring another observation of the object under study, or whether it is time to give up, and report the observed object as unknown. We describe the hardware and software of a system that implements recognition and object permanence as two nested perception-action cycles. We have collected three data sets of observation sequences that allow us to perform controlled evaluation of the system behavior. Our recognition system uses a KNN classifier with bag-of-features prototypes. For this classifier, we have designed and compared three different uncertainty measures for target observation. These measures allow the system to (a) decide whether to continue to observe an object or to move on, and to (b) decide whether the observed object is previously seen or novel. The system is able to successfully reject all novel objects as \"unknown\", while still recognizing most of the previously seen objects.", "paper_title": "Embodied Object Recognition using Adaptive Target Observations", "paper_id": "WOS:000292777400011"}