{"auto_keywords": [{"score": 0.027014606534390695, "phrase": "vivo_images"}, {"score": 0.00481495049065317, "phrase": "vivo_micro-"}, {"score": 0.004787595063253874, "phrase": "vascular_imaging"}, {"score": 0.004548253531664032, "phrase": "novel_photoacoustic_microscopy_imaging_system"}, {"score": 0.004345525254560329, "phrase": "tissue_microvasculature"}, {"score": 0.003833239659217905, "phrase": "ylf"}, {"score": 0.003789763907758991, "phrase": "tunable_dye_laser"}, {"score": 0.003641433168173135, "phrase": "custom_multichannel_receiver_electronics_system"}, {"score": 0.0033811403330431897, "phrase": "phantom_images"}, {"score": 0.0028167336373711494, "phrase": "dynamic_focusing_capability"}, {"score": 0.002675654549462983, "phrase": "composite_carbon_fiber_matrix"}, {"score": 0.002373276186210053, "phrase": "human_hand"}], "paper_keywords": ["High-frequency ultrasound", " multichannel receiver electronics", " photoacoustic imaging", " transducer array"], "paper_abstract": "This paper discusses the design of a novel photoacoustic microscopy imaging system with promise for studying the structure of tissue microvasculature for applications in visualizing angiogenesis. A new 16 channel analog and digital high-frequency array based photoacoustic microscopy system (PAM) was developed using an Nd: YLF pumped tunable dye laser, a 30 MHz piezo composite linear array transducer, and a custom multichannel receiver electronics system. Using offline delay and sum beam-forming and beamsteering, phantom images were obtained from a 6 m carbon fiber in water at a depth of 8 mm. The measured -6 dB lateral and axial spatial resolution of the system was 100 +/- 5 mu m and 45 +/- 5 mu m, respectively. The dynamic focusing capability of the system was demonstrated by imaging a composite carbon fiber matrix through a 12.5 mm imaging depth. Next, 2-D in vivo images were formed of vessels around 100 mu m in diameter in the human hand. Three-dimensional in vivo images were also formed of micro-vessels 3 mm below the surface of the skin in two Sprague Dawley rats.", "paper_title": "A 3-D High-Frequency Array Based 16 Channel Photoacoustic Microscopy System for In Vivo Micro- Vascular Imaging", "paper_id": "WOS:000268525500005"}