{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "automated_design_of_realistic_organometallic_molecules"}, {"score": 0.004623608221548592, "phrase": "automated_generation"}, {"score": 0.0043506951029334984, "phrase": "molecular_fragments"}, {"score": 0.00395101799538683, "phrase": "new_molecules"}, {"score": 0.0036801209922064817, "phrase": "possible_connections"}, {"score": 0.003551694229680741, "phrase": "library_files"}, {"score": 0.0032746712603464235, "phrase": "organometallic_fragment_spaces"}, {"score": 0.0031284221314354095, "phrase": "automated_fashion"}, {"score": 0.0030038988468808845, "phrase": "ample_structural_variation"}, {"score": 0.002884317729022721, "phrase": "known_fragments"}, {"score": 0.002769483748975581, "phrase": "exotic_and_unrealistic_substructures"}, {"score": 0.0026057256900479026, "phrase": "ruthenium_complexes"}, {"score": 0.0024516267507109753, "phrase": "catalyst_development"}, {"score": 0.0023301793939902015, "phrase": "described_method"}, {"score": 0.002283298119790413, "phrase": "exotic_arrangements"}, {"score": 0.0021049977753042253, "phrase": "valence_rules"}], "paper_keywords": [""], "paper_abstract": "A method for the automated generation of realistic, synthetically accessible transition metal and organometallic complexes is described. Computational tools were designed to generate molecular fragments, preferably harvested from libraries of existing, stable compounds, to be used as building blocks for the construction of new molecules. These fragments are enriched with information about the number and type of possible connections to other fragments and are stored in library files. When connecting fragments in the subsequent building process, compatibility matrices, which define the connection rules between fragments, are used to delineate organometallic fragment spaces from which molecules can be generated in an automated fashion. The approach is flexible and allows ample structural variation at the same time as the combination of known fragments is easily restrained to avoid generation of exotic and unrealistic substructures and molecules. The method was tested in the generation of ruthenium complexes, with a given coordination environment, which can serve as candidates in catalyst development. The results demonstrate that molecules generated with the described method do not contain exotic arrangements of atoms and are by far more realistic than those obtained by the application of valence rules alone.", "paper_title": "Automated Design of Realistic Organometallic Molecules from Fragments", "paper_id": "WOS:000333478800008"}