{"auto_keywords": [{"score": 0.049181877671157906, "phrase": "evolving_graphs"}, {"score": 0.015719716506582538, "phrase": "routing_protocols"}, {"score": 0.004754600386388821, "phrase": "known_connectivity_patterns"}, {"score": 0.004621551111118693, "phrase": "mobile_wireless_networks"}, {"score": 0.004578030096508602, "phrase": "difficult_task"}, {"score": 0.004506399797123487, "phrase": "networks'_dynamic_behavior"}, {"score": 0.004284596323560538, "phrase": "intermittent_wireless_sensors_networks"}, {"score": 0.0042576464476131205, "phrase": "periodic_or_cyclic_networks"}, {"score": 0.004191007935893067, "phrase": "tolerant_networks"}, {"score": 0.00406083086983316, "phrase": "temporal_variations"}, {"score": 0.003636125247342626, "phrase": "dynamic_behavior"}, {"score": 0.0035231224373946457, "phrase": "least_cost_routing"}, {"score": 0.003194580334752371, "phrase": "practical_situations"}, {"score": 0.0030467560909122476, "phrase": "evolving_graph_theory"}, {"score": 0.0029990127367275966, "phrase": "efficient_routing_protocols"}, {"score": 0.002980124909321296, "phrase": "realistic_scenarios"}, {"score": 0.002851189848197057, "phrase": "evolving_graph"}, {"score": 0.0025047222344966678, "phrase": "effective_and_powerful_tool"}, {"score": 0.002434477906829832, "phrase": "dynamic_networks"}, {"score": 0.002411502601063177, "phrase": "predictable_dynamics"}, {"score": 0.002292571801358424, "phrase": "practical_issues"}, {"score": 0.0022002633747977593, "phrase": "adaptive_algorithms"}], "paper_keywords": ["Ad hoc wireless networks", " Sensor networks", " Evolving graphs", " Routing protocols", " Delay tolerant networks", " Performance analysis"], "paper_abstract": "The assessment of routing protocols for mobile wireless networks is a difficult task, because of the networks' dynamic behavior and the absence of benchmarks. However, some of these networks, such as intermittent wireless sensors networks, periodic or cyclic networks, and some delay tolerant networks (DTNs), have more predictable dynamics, as the temporal variations in the network topology can be considered as deterministic, which may make them easier to study. Recently, a graph theoretic model-the evolving graphs-was proposed to help capture the dynamic behavior of such networks, in view of the construction of least cost routing and other algorithms. The algorithms and insights obtained through this model are theoretically very efficient and intriguing. However, there is no study about the use of such theoretical results into practical situations. Therefore, the objective of our work is to analyze the applicability of the evolving graph theory in the construction of efficient routing protocols in realistic scenarios. In this paper, we use the NS2 network simulator to first implement an evolving graph based routing protocol, and then to use it as a benchmark when comparing the four major ad hoc routing protocols (AODV, DSR, OLSR and DSDV). Interestingly, our experiments show that evolving graphs have the potential to be an effective and powerful tool in the development and analysis of algorithms for dynamic networks, with predictable dynamics at least. In order to make this model widely applicable, however, some practical issues still have to be addressed and incorporated into the model, like adaptive algorithms. We also discuss such issues in this paper, as a result of our experience.", "paper_title": "Performance evaluation of routing protocols for MANETs with known connectivity patterns using evolving graphs", "paper_id": "WOS:000275558500004"}