{"auto_keywords": [{"score": 0.04757556213629672, "phrase": "mecca"}, {"score": 0.042701067591519634, "phrase": "large_crowds"}, {"score": 0.00481495049065317, "phrase": "densely_crowded_religious_sites"}, {"score": 0.004662427600500598, "phrase": "large_number"}, {"score": 0.004514714250357749, "phrase": "saudi_arabia"}, {"score": 0.004011867299107537, "phrase": "particular_days"}, {"score": 0.0034890505116128606, "phrase": "dynamic_public_signage"}, {"score": 0.003100085797251317, "phrase": "literature_review"}, {"score": 0.0029221312451219203, "phrase": "prototypical_dynamic_sign_system"}, {"score": 0.00266693888510356, "phrase": "user_study"}, {"score": 0.0026242699269026204, "phrase": "realistic_setting"}, {"score": 0.0025273383208209922, "phrase": "dynamic_signage"}, {"score": 0.002473560912156024, "phrase": "feasible_option"}, {"score": 0.0021049977753042253, "phrase": "design_process"}], "paper_keywords": ["Public displays", " Dynamic signage", " Crowd navigation", " Pilgrimage", " User studies"], "paper_abstract": "Every year, a large number of pilgrims visit Mecca in Saudi Arabia. During their stay, they perform a number of rites in and around the city. Due to large crowds forming on particular days, incidents frequently occur, where people are injured, sometimes fatally. In this article, we investigate the question whether the use of dynamic public signage can help people to navigate in this setting. We present an analysis of the situation in Mecca based on a literature review and on interviews with pilgrims, and then introduce a prototypical dynamic sign system aimed at supporting pilgrims in navigating one particular area. To evaluate the system, we conducted a user study in a realistic setting, and the results suggest that dynamic signage may be a feasible option in this setting. The design and evaluation of our prototype also led to a number of insights regarding the design of such systems. We discuss difficulties encountered during the design process and the evaluation and reflect on implications for the design and evaluation of systems supporting navigation for large crowds.", "paper_title": "Supporting pilgrims in navigating densely crowded religious sites", "paper_id": "WOS:000314508400006"}