{"auto_keywords": [{"score": 0.004711843410316589, "phrase": "data_item's_provenance"}, {"score": 0.0046276016230633495, "phrase": "different_forms"}, {"score": 0.0044635893862404385, "phrase": "intended_use"}, {"score": 0.004320932773749168, "phrase": "different_communities"}, {"score": 0.004274396662662802, "phrase": "quite_distinct_underlying_assumptions"}, {"score": 0.0035426543993952184, "phrase": "primary_purpose"}, {"score": 0.0034792431564692997, "phrase": "intuitive_metadata"}, {"score": 0.0032367108248520277, "phrase": "scientific_workflows"}, {"score": 0.003088178133049113, "phrase": "intermediary_data"}, {"score": 0.0030548779592763824, "phrase": "process'_execution"}, {"score": 0.0029464414592923196, "phrase": "full_account"}, {"score": 0.0026532001044943117, "phrase": "causal_graph"}, {"score": 0.002406415352892016, "phrase": "dublin_core"}, {"score": 0.0023125643872311994, "phrase": "technical_issues"}, {"score": 0.00216680270402079, "phrase": "similar_schemes"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Provenance", " OPM", " Attribution", " e-science", " Dublin Core"], "paper_abstract": "A description of a data item's provenance can be provided in different forms, and which form is best depends on the intended use of that description. Because of this, different communities have made quite distinct underlying assumptions in their models for electronically representing provenance. Approaches deriving from the library and archiving communities emphasise agreed vocabulary by which resources can be described and, in particular, assert their attribution (who created the resource, who modified it, where it was stored, etc.) The primary purpose here is to provide intuitive metadata by which users can search for and index resources. In comparison, models for representing the results of scientific workflows have been developed with the assumption that each event or piece of intermediary data in a process' execution can and should be documented, to give a full account of the experiment undertaken. These occurrences are connected together by stating where one derived from, triggered, or otherwise caused another, and so form a causal graph. Mapping between the two approaches would be beneficial in integrating systems and exploiting the strengths of each. In this paper, we specify such a mapping between Dublin Core and the Open Provenance Model. We further explain the technical issues to overcome and the rationale behind the approach, to allow the same method to apply in mapping similar schemes. (C) 2011 Published by Elsevier B.V.", "paper_title": "Mapping attribution metadata to the Open Provenance Model", "paper_id": "WOS:000290180200017"}