{"auto_keywords": [{"score": 0.047677014623858475, "phrase": "wireless_mesh_networks"}, {"score": 0.038994073126498295, "phrase": "energy_consumption"}, {"score": 0.025875372924010803, "phrase": "proposed_algorithm"}, {"score": 0.00481495049065317, "phrase": "multi-radio_wireless_mesh_networks"}, {"score": 0.004716924994370903, "phrase": "multiple_radios"}, {"score": 0.004668659654386976, "phrase": "recent_solution"}, {"score": 0.0041548413176193235, "phrase": "channel_assignment_problem"}, {"score": 0.004098221047046135, "phrase": "routing_problem"}, {"score": 0.003634458561248524, "phrase": "mesh_nodes"}, {"score": 0.0035603802089559716, "phrase": "power_source"}, {"score": 0.0034878064529259424, "phrase": "rising_concerns"}, {"score": 0.0034167069467881143, "phrase": "communication_infrastructures"}, {"score": 0.0032230064799028423, "phrase": "channel_assignment"}, {"score": 0.0030929051195273715, "phrase": "idle_radio"}, {"score": 0.0030298312658908855, "phrase": "nearly_the_same_power"}, {"score": 0.002640889905429026, "phrase": "energy_efficient_channel_assignment_and_routing_problem"}, {"score": 0.00258806538037227, "phrase": "np"}, {"score": 0.0025342267883803255, "phrase": "heuristic_algorithm"}, {"score": 0.0024069209350505933, "phrase": "optimal_solution"}, {"score": 0.0022163699144426155, "phrase": "extensive_simulation_studies"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Multi-radio wireless mesh networks", " Channel assignment", " Energy efficiency"], "paper_abstract": "Endowing mesh routers with multiple radios is a recent solution to improve the performance of wireless mesh networks. Solving the problem how to assign channels to radios has attracted a lot of attention in the recent years, partly because of the hardness of solving the channel assignment problem jointly with the routing problem. However, the approaches proposed in the literature so far have mainly focused on reducing interference or maximizing the throughput. Little attention has been paid to the energy consumption of wireless mesh networks, given that mesh nodes are usually connected to a power source. However, with the rising concerns about the energy consumed by communication infrastructures, it makes sense to consider the minimization of the energy consumption as an objective of the channel assignment and routing problem. Our work stems from the observation that an idle radio simply overhearing a frame consumes nearly the same power as the radio actually receiving the frame. Hence, energy may be saved by turning off a number of radios, if the performance of the network is not impaired. In this paper, we define the energy efficient channel assignment and routing problem, show that it is NP-hard and propose a heuristic algorithm. For the purpose of comparing the solution found by the proposed algorithm to the optimal solution, we also present two Mixed Integer Linear Programs (MILPs) that optimally solve the problem we address. Finally, we show the results of extensive simulation studies we conducted to assess the effectiveness of the proposed algorithm. (C) 2012 Elsevier B.V. All rights reserved.", "paper_title": "An energy efficient channel assignment and routing algorithm for multi-radio wireless mesh networks", "paper_id": "WOS:000304218500013"}