{"auto_keywords": [{"score": 0.04008010591131817, "phrase": "identifier_forgery"}, {"score": 0.00481495049065317, "phrase": "identity_attacks"}, {"score": 0.004682708592184678, "phrase": "cooperative_peer-to-peer_networks"}, {"score": 0.004554082077300675, "phrase": "open_nature"}, {"score": 0.0039252049353279556, "phrase": "successful_identifier_forgery"}, {"score": 0.003712362078915926, "phrase": "whole_network"}, {"score": 0.0035769039152789943, "phrase": "sybil"}, {"score": 0.0033986345279488476, "phrase": "identifier_authentication_mechanism"}, {"score": 0.0031550351923674337, "phrase": "identity-based_cryptography"}, {"score": 0.003125835572347772, "phrase": "identity_ownership_proof_mechanisms"}, {"score": 0.003011706511096639, "phrase": "indirect_bindings"}, {"score": 0.00269365253474335, "phrase": "related_attack"}, {"score": 0.002500456462028735, "phrase": "identifier_forgery_attacks"}, {"score": 0.0024429654627197393, "phrase": "attacker's_ability"}, {"score": 0.0023646866829474798, "phrase": "design_rationale"}, {"score": 0.002278284823857861, "phrase": "security_analysis"}, {"score": 0.002195033004022173, "phrase": "identifier_related_attacks"}], "paper_keywords": ["peer-to-peer", " overlay network", " security", " identifier authentication", " random visitor", " identity-based cryptography"], "paper_abstract": "Various advantages of cooperative peer-to-peer networks are strongly counterbalanced by the open nature of a distributed, serverless network. In such networks, it is relatively easy for an attacker to launch various attacks such as misrouting, corrupting, or dropping messages as a result of a successful identifier forgery. The impact of an identifier forgery is particularly severe because the whole network can be compromised by attacks such as Sybil or Eclipse. In this paper, we present an identifier authentication mechanism called random visitor, which uses one or more randomly selected peers as delegates of identity proof. Our scheme uses identity-based cryptography and identity ownership proof mechanisms collectively to create multiple, cryptographically protected indirect bindings between two peers, instantly when needed, through the delegates. Because of these bindings, an attacker cannot achieve an identifier forgery related attack against interacting peers without breaking the bindings. Therefore, our mechanism limits the possibility of identifier forgery attacks efficiently by disabling an attacker's ability to break the binding. The design rationale and framework details are presented. A security analysis shows that our scheme is strong enough against identifier related attacks and that the strength increases if there are many peers (more than several thousand) in the network.", "paper_title": "Random visitor: Defense against identity attacks in P2P networks", "paper_id": "WOS:000255648700021"}