{"auto_keywords": [{"score": 0.04452385170829109, "phrase": "multiple_parties"}, {"score": 0.03419028355862246, "phrase": "data_privacy"}, {"score": 0.00481495049065317, "phrase": "secure_channel"}, {"score": 0.004579005794486596, "phrase": "multiple_parties'_data_aggregation"}, {"score": 0.004378958522416482, "phrase": "individual's_privately_owned_data"}, {"score": 0.003916098498242888, "phrase": "secure_pair-wise_communication_channels"}, {"score": 0.003601235776892337, "phrase": "external_aggregator"}, {"score": 0.0034824716857663114, "phrase": "algebraic_statistics"}, {"score": 0.003311604528903634, "phrase": "participants'_privately_owned_data"}, {"score": 0.0030794433253250476, "phrase": "eavesdropping_attacks"}, {"score": 0.0027382040767844093, "phrase": "semi-honest_model"}, {"score": 0.002603758927691463, "phrase": "passive_adversaries"}, {"score": 0.0024346858809238766, "phrase": "weak_assumption"}, {"score": 0.002341164727388944, "phrase": "computation_complexity"}, {"score": 0.002263861731320045, "phrase": "small_constant"}], "paper_keywords": ["Privacy", " data aggregation", " secure channels", " SMC", " homomorphic"], "paper_abstract": "Much research has been conducted to securely outsource multiple parties' data aggregation to an untrusted aggregator without disclosing each individual's privately owned data, or to enable multiple parties to jointly aggregate their data while preserving privacy. However, those works either require secure pair-wise communication channels or suffer from high complexity. In this paper, we consider how an external aggregator or multiple parties can learn some algebraic statistics (e.g., sum, product) over participants' privately owned data while preserving the data privacy. We assume all channels are subject to eavesdropping attacks, and all the communications throughout the aggregation are open to others. We first propose several protocols that successfully guarantee data privacy under semi-honest model, and then present advanced protocols which tolerate up to k passive adversaries who do not try to tamper the computation. Under this weak assumption, we limit both the communication and computation complexity of each participant to a small constant. At the end, we present applications which solve several interesting problems via our protocols.", "paper_title": "Collusion-Tolerable Privacy-Preserving Sum and Product Calculation without Secure Channel", "paper_id": "WOS:000352054200004"}