{"auto_keywords": [{"score": 0.04048824360420898, "phrase": "domain_pairs"}, {"score": 0.01972976278451576, "phrase": "interaction_mediators"}, {"score": 0.006855706103527376, "phrase": "preferred_domain_pairs"}, {"score": 0.0062518954955002905, "phrase": "preference_relations"}, {"score": 0.0058877734245729955, "phrase": "differential_use"}, {"score": 0.00481495049065317, "phrase": "protein_domain_pairs"}, {"score": 0.004449772140968921, "phrase": "protein_domains"}, {"score": 0.004399905285945236, "phrase": "structural_data"}, {"score": 0.004366970206156021, "phrase": "multi-domain_ppis"}, {"score": 0.004318027255281003, "phrase": "domain_pair"}, {"score": 0.003578255090799811, "phrase": "stable_interactions"}, {"score": 0.0035381202759091784, "phrase": "structurally_solved_multi-domain_protein_complexes"}, {"score": 0.003220643255032943, "phrase": "proteins'_context"}, {"score": 0.0030901063954739375, "phrase": "protein_interaction"}, {"score": 0.0030554300179552415, "phrase": "protein_contexts"}, {"score": 0.0029984960344766705, "phrase": "different_domain_pairs"}, {"score": 0.0028127163745564777, "phrase": "partial_order"}, {"score": 0.002678433668156678, "phrase": "interaction-mediating_domains"}, {"score": 0.0023040642263522505, "phrase": "homotypic_interactions"}, {"score": 0.002252602622785975, "phrase": "previous_suggestions"}, {"score": 0.0021857667493036786, "phrase": "domain_self-interaction"}, {"score": 0.002161216637621284, "phrase": "protein_interactions"}, {"score": 0.0021049977753042253, "phrase": "possible_association"}], "paper_keywords": [""], "paper_abstract": "Motivation: Many protein-protein interactions (PPIs) are mediated by protein domains. The structural data of multi-domain PPIs reveal the domain pair ( or pairs) that mediate a PPI, and implicitly also the domain pairs that are not involved in the interaction. By analyzing such data, preference relations between domain pairs as interaction mediators may be revealed. Results: Here, we analyze the differential use of domain pairs as mediators of stable interactions based on structurally solved multi-domain protein complexes. Our analysis revealed domain pairs that are preferentially used as interaction mediators and domain pairs that rarely or never mediate interaction, independent of the proteins' context. Between these extremes, there are domain pairs that mediate protein interaction in some protein contexts, while in other contexts different domain pairs predominate over them. By describing the preference relations between domain pairs as a network, we uncovered partial order and transitivity in these relations, which we further exploited for predicting interaction-mediating domains. The preferred domain pairs and the ones over which they predominate differ in several properties, but these differences cannot yet determine explicitly what underlies the differential use of domain pairs as interaction mediators. One property that stood up was the over-abundance of homotypic interactions among the preferred domain pairs, supporting previous suggestions on the advantages in the use of domain self-interaction for mediating protein interactions. Finally, we show a possible association between the preferred domain pairs and the function of the complex where they reside.", "paper_title": "Preferential use of protein domain pairs as interaction mediators: order and transitivity", "paper_id": "WOS:000282749700009"}