{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "two-dimensional_gel_electrophoresis_images"}, {"score": 0.04850161465082996, "phrase": "protein_spots"}, {"score": 0.004403480614319231, "phrase": "current_approaches"}, {"score": 0.00423465514675998, "phrase": "significant_shortcomings"}, {"score": 0.00400459716272594, "phrase": "current_software_applications"}, {"score": 0.003829548069657859, "phrase": "poor_segmentation"}, {"score": 0.003724034990158436, "phrase": "fixed_window"}, {"score": 0.0034824716857663114, "phrase": "protein_spot"}, {"score": 0.002977835845437357, "phrase": "five_sections"}, {"score": 0.0029447150254434842, "phrase": "different_gels"}, {"score": 0.002800158709933889, "phrase": "presented_method"}, {"score": 0.0025604233506352375, "phrase": "sixty_protein_spots"}, {"score": 0.0024897902536499005, "phrase": "state-of-the-art_commercial_software"}, {"score": 0.0022386642196006567, "phrase": "proposed_approach"}, {"score": 0.0021049977753042253, "phrase": "available_commercial_and_academic_software_packages"}], "paper_keywords": [""], "paper_abstract": "Motivation: Detection of protein spots in two-dimensional gel electrophoresis images (2-DE) is a very complex task and current approaches addressing this problem still suffer from significant shortcomings. When quantifying a spot, most of the current software applications include a lot of background due to poor segmentation. Other software applications use a fixed window for this task, resulting in omission of part of the protein spot, or including background in the quantification. The approach presented here for the segmentation and quantification of 2-DE aims to minimize these problems. Results: Five sections from different gels are used to test the performance of the presented method concerning the detection of protein spots, and three gel sections are used to test the quantification of sixty protein spots. Comparisons with a state-of-the-art commercial software and an academic state-of-the-art approach are presented. It is shown that the proposed approach for segmentation and quantification of 2-DE images can compete with the available commercial and academic software packages.", "paper_title": "New approach for segmentation and quantification of two-dimensional gel electrophoresis images", "paper_id": "WOS:000286991300010"}