{"auto_keywords": [{"score": 0.04050186340720087, "phrase": "symbolic_coefficients"}, {"score": 0.014570036773710283, "phrase": "numeric_coordinates"}, {"score": 0.010988098660211347, "phrase": "symbolic_coordinates"}, {"score": 0.004750178261675602, "phrase": "cas_maple"}, {"score": 0.004623224002010226, "phrase": "dynamic_geometry_systems"}, {"score": 0.0043793594257092805, "phrase": "numeric_coefficients"}, {"score": 0.004339979174946844, "phrase": "computer_algebra_systems"}, {"score": 0.0037052085102935567, "phrase": "cas."}, {"score": 0.0035095935622207956, "phrase": "mimetic_coefficients"}, {"score": 0.0034780510975635903, "phrase": "maple"}, {"score": 0.0034467696086291507, "phrase": "mathematica"}, {"score": 0.0029025435402480326, "phrase": "convenient_time-saving_way"}, {"score": 0.0026514708899935333, "phrase": "compass_geometry"}, {"score": 0.0022427071130840647, "phrase": "comparable_\"symbolic\"_link"}, {"score": 0.002105002791163301, "phrase": "elsevier"}], "paper_keywords": ["3D Dynamic Geometry Systems", " Computer Algebra Systems", " Mechanical theorem proving in geometry", " Grobner bases", " Wu's method"], "paper_abstract": "Many (2D) Dynamic Geometry Systems (DGSs) ale able to export numeric coordinates and equations with numeric coefficients to Computer Algebra Systems (CASs) Moreover, different approaches and systems that link (2D) DGSs with CASs. so that symbolic coordinates and equations with symbolic coefficients can he exported from the DGS to the CAS. already exist Although the 3D DGS Calques3D can export numeric coordinates and equations with mimetic coefficients to Maple and Mathematica, it cannot export symbolic coordinates and equations with symbolic coefficients A connection between the 3D DGS Calques3D and the CAS Maple, that can handle symbolic coordinates and equations with symbolic coefficients, is presented here Its main interest is to provide a convenient time-saving way to explore problems and directly obtain both algebraic and numeric when dealing with a 3D extension of \"ruler and compass geometry\" This link has not only educational purposes but mathematical ones, like mechanical them em proving in geometry, geometric discovery (hypotheses completion), geometric loci finding As far as we know, there is no comparable \"symbolic\" link in the 3D case, except the prototype 3D-LD (restricted to determining algebraic surfaces as geometric loci) (C) 2009 IMACS Published by Elsevier B V All rights reserved", "paper_title": "Connecting the 3D DGS Calques3D with the CAS Maple", "paper_id": "WOS:000276380400013"}