{"auto_keywords": [{"score": 0.015719716506582538, "phrase": "interpersonal_coordination"}, {"score": 0.004721711709176679, "phrase": "team_rowing"}, {"score": 0.004607686390487483, "phrase": "interpersonal_activities"}, {"score": 0.004178351419209898, "phrase": "long_training_time"}, {"score": 0.0038074544783102226, "phrase": "accurate_and_real-time_feedback"}, {"score": 0.0036434002236454305, "phrase": "present_study"}, {"score": 0.0035379628447303703, "phrase": "indoor_team_rowing_situation"}, {"score": 0.003503497128638099, "phrase": "virtual-reality_and_motion-capture_technologies"}, {"score": 0.0030101325901285537, "phrase": "virtual_teammate"}, {"score": 0.0028944757265206332, "phrase": "real-time_visual_feedback"}, {"score": 0.0027026375053777543, "phrase": "real_teammate"}, {"score": 0.002573424607574822, "phrase": "virtual_and_real_teammates"}, {"score": 0.0023104373174118458, "phrase": "virtual_reality"}, {"score": 0.0021784745589727246, "phrase": "promising_training_perspectives"}], "paper_keywords": [""], "paper_abstract": "The success of interpersonal activities strongly depends on the coordination between our movements and those of others. Learning to coordinate with other people requires a long training time and is often limited by the difficulty of having people available at the same time and of giving them accurate and real-time feedback about their coordination. The goal of the present study was to determine in an indoor team rowing situation whether virtual-reality and motion-capture technologies can help the acquisition of interpersonal coordination. More specifically, we investigated the possibility for participants to (1) learn the skill of interpersonal coordination when training with a virtual teammate, (2) accelerate learning with real-time visual feedback, and (3) transfer this skill to synchronizing situations with a real teammate. Our results show that participants improved their coordination with both virtual and real teammates, and that this improvement was better for participants who received the feedback. Generally, our results demonstrate the interest of virtual reality for learning the coordination with other people; further, our results open promising training perspectives for team rowing but also for several other interpersonal activities.", "paper_title": "Virtual Reality as a Tool to Learn Interpersonal Coordination: Example of Team Rowing", "paper_id": "WOS:000331541300002"}