{"auto_keywords": [{"score": 0.03508855842078276, "phrase": "np"}, {"score": 0.00475254914916922, "phrase": "phylogenetic_trees"}, {"score": 0.003504670673093149, "phrase": "resulting_forests"}, {"score": 0.0034143003168921114, "phrase": "forced_edge_contractions"}, {"score": 0.0032404677650217407, "phrase": "input_trees"}, {"score": 0.00321236577162671, "phrase": "maximum_degree"}, {"score": 0.0030888830649190282, "phrase": "t._jiang"}, {"score": 0.003062091606343783, "phrase": "l._wang"}, {"score": 0.00303553181618577, "phrase": "k._zhang"}, {"score": 0.0029443683459283955, "phrase": "evolutionary_trees"}, {"score": 0.002918826667294298, "phrase": "discrete_applied_mathematics"}, {"score": 0.0027822459052173113, "phrase": "approximation_algorithm"}, {"score": 0.0026986685585382347, "phrase": "performance_ratio"}, {"score": 0.0025389513338018414, "phrase": "hein_et_al"}, {"score": 0.0022277448907881306, "phrase": "bounded_degree"}, {"score": 0.0021049977753042253, "phrase": "computational_experiments"}], "paper_keywords": ["agreement forest", " approximation algorithm", " APX-complete", " computational complexity", " evolutionary process", " phylogenetic tree"], "paper_abstract": "There are various techniques for reconstructing phylogenetic trees from data, and in this context the problem of determining how distant two such trees are from each other arises naturally. Various metrics for measuring the distance between two phylogenies have been defined. Another way of comparing two trees T and U is to compute the so called maximum agreement forest of these trees. Informally, the number of components of an agreement forest tells how many edges from each of T and U need to be cut so that the resulting forests agree, after performing all forced edge contractions. This problem is; NP-hard even when the input trees have maximum degree 2. Hein et al. [J. Hein, T. Jiang, L. Wang, K. Zhang, On the complexity of comparing evolutionary trees, Discrete Applied Mathematics 71 (1996) 153-169] presented an approximation algorithm for it, claimed to have performance ratio 3. We show that the performance ratio of the algorithm proposed by Hein et al. is 4, and we, also present two new 3-approximation algorithms for this problem. We show how to modify one of the algorithms into a (d +1)-approximation algorithm for trees with bounded degree al, d >= 2. Finally, we report on some Computational experiments comparing the performance of the algorithms presented in this paper. (C) 2006 Elsevier B.V. All rights reserved.", "paper_title": "The maximum agreement forest problem: Approximation algorithms and computational experiments", "paper_id": "WOS:000246170000009"}