{"auto_keywords": [{"score": 0.03623685937254764, "phrase": "content_optimization_services"}, {"score": 0.00481495049065317, "phrase": "optimization_services"}, {"score": 0.004674952036988355, "phrase": "recent_boom"}, {"score": 0.004620093797504386, "phrase": "mobile_device_usage"}, {"score": 0.004329630571352367, "phrase": "content_providers"}, {"score": 0.004178935413340453, "phrase": "mobile_devices"}, {"score": 0.003735349093835257, "phrase": "enterprise_systems"}, {"score": 0.0029489527539649737, "phrase": "optimization_process"}, {"score": 0.0027307746993761035, "phrase": "cost_requirements"}, {"score": 0.0023694065215394593, "phrase": "practical_considerations"}, {"score": 0.002142696637011647, "phrase": "cheaper_and_more_scalable_option"}, {"score": 0.0021049977753042253, "phrase": "traditional_dedicated_servers"}], "paper_keywords": ["Content optimization", " Compression", " Cloud", " Services"], "paper_abstract": "The recent boom in mobile device usage has provided more opportunities, competition and also increased complexities for content providers to monetize their information goods. Although mobile devices are becoming increasingly powerful, their hardware, software and connectivity are relatively more limited compared to desktop and enterprise systems. As a result, various content optimization services have emerged. This paper focuses on content optimization services that modify and reorganize content to reduce the size of content and enhance the performance of processing on the content. For most content providers, this optimization process needs to be fast, scalable and yet aligned with their monetization strategies and cost requirements. Based on our experience on content optimization services, this paper presents the economics related to these services. In particular, we present some practical considerations when these services are implemented on a cloud, which is typically perceived to be a cheaper and more scalable option compared to traditional dedicated servers.", "paper_title": "Feasibility and a case study on content optimization services on cloud", "paper_id": "WOS:000322901700002"}