{"auto_keywords": [{"score": 0.03475296793907242, "phrase": "disjoint_languages"}, {"score": 0.03378229510184497, "phrase": "identification_criterion"}, {"score": 0.00481495049065317, "phrase": "inductive_inference"}, {"score": 0.00416083851254335, "phrase": "fixed_number"}, {"score": 0.003512173182208377, "phrase": "unioned_language"}, {"score": 0.0034109924073788215, "phrase": "identification_criteria"}, {"score": 0.0032456080226031417, "phrase": "inferring_power"}, {"score": 0.0030345041068691224, "phrase": "infinite_hierarchy"}, {"score": 0.002560980198416571, "phrase": "different_identification_criteria"}, {"score": 0.0025385994743190796, "phrase": "similar_hierarchies"}, {"score": 0.0025090616962891773, "phrase": "sufficient_conditions"}, {"score": 0.002380327476198495, "phrase": "indexed_families"}, {"score": 0.00227809753597453, "phrase": "earlier_hierarchical_results"}, {"score": 0.00223844287825642, "phrase": "language_classes"}, {"score": 0.002193048767151329, "phrase": "weak_reduction"}, {"score": 0.00216118788395907, "phrase": "intrinsic_complexity"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["unions of languages", " inductive inference"], "paper_abstract": "In inductive inference, a machine is given words of a language (a recursively enumerable set in our setting) and the machine is said to identify the language if it correctly names the language. In this paper we study identifiability of classes of languages where the unions of up to a fixed number (n say) of languages from the class are provided as input. We distinguish between two different scenarios: in one scenario, the learner need only to name the language which results from the union; in the other, the learner must individually name the languages which make up the union (we say that the unioned language is discerningly identified). We define three kinds of identification criteria based on this and by the use of some classes of disjoint languages, demonstrate that the inferring power of each of these identification criterion decreases as we increase the number of languages allowed in the union, thus resulting in an infinite hierarchy for each identification criterion. That is, we show that for each n, there exists a class of disjoint languages where all unions of up to n languages from this class can be discerningly identified, but there is no learner which identifies every union of n + 1 languages from this class. A comparison between the different identification criteria also yielded similar hierarchies. We give sufficient conditions for classes of languages where the unions can be discerningly identified, and characterize such discerning learnability for the indexed families. We then give naturally occurring classes of languages that witness some of the earlier hierarchical results. Finally, we present language classes which are complete with respect to weak reduction (in terms of intrinsic complexity) for our identification criteria. (C) 2006 Elsevier Inc. All rights reserved.", "paper_title": "Learning languages in a union", "paper_id": "WOS:000243079500007"}