{"auto_keywords": [{"score": 0.04777281030275487, "phrase": "decision-making_problem"}, {"score": 0.00481495049065317, "phrase": "two-level_manufacturing_systems"}, {"score": 0.004775531918452571, "phrase": "purpose_-_the"}, {"score": 0.004527024978801684, "phrase": "complex_operation_system"}, {"score": 0.0041184843463633386, "phrase": "executor's_movement_control_problem"}, {"score": 0.003952513974962462, "phrase": "new_problem"}, {"score": 0.00388800655625083, "phrase": "new_solution_algorithm"}, {"score": 0.0037159680715717056, "phrase": "moving_vehicle"}, {"score": 0.0036703791815812328, "phrase": "state_space"}, {"score": 0.003625347557965931, "phrase": "offline_movement_control_algorithm"}, {"score": 0.003394314924677555, "phrase": "repeated_execution"}, {"score": 0.0030247625535682987, "phrase": "substitutive_approach"}, {"score": 0.002938821840519756, "phrase": "significant_improvement"}, {"score": 0.0026403934420630155, "phrase": "different_movement_model"}, {"score": 0.002471973283582411, "phrase": "flexible_manufacturing_systems"}, {"score": 0.002276439636865258, "phrase": "multiple_tasks"}, {"score": 0.002202617924488607, "phrase": "two-level_system"}, {"score": 0.0021049977753042253, "phrase": "quality_improvement"}], "paper_keywords": ["Cybernetics", " Systems theory", " Decision making", " Modelling", " Production scheduling", " Manufacturing systems", " Transportation"], "paper_abstract": "Purpose - The purpose of this paper is to deal with a decision-making problem in a complex operation system. Two levels of the system are made up of two different decision problems, i.e. task scheduling and task execution where by the latter an executor's movement control problem is understood. Interconnection of both levels creates a new problem that requires a new solution algorithm. Design/methodology/approach - With use of a model of a moving vehicle in the state space, an offline movement control algorithm, is developed. Moreover, the concept of rescheduling to improve the solution through repeated execution of both, the movement control and the scheduling algorithms is used. Findings - Decision-making problem, and its substitutive version is defined. A solution is given for the substitutive approach along with its analytical evaluation. Furthermore, significant improvement of the solution through rescheduling has been achieved. Research limitations/implications - Proposed approach to decision making creates a difficulty for generalization of the results on cases with a different movement model. Practical implications - The methodology introduced in the paper can be applied prominently in flexible manufacturing systems with moving executors where it is either unfeasible to move the assemblage or the executors are capable of performing multiple tasks. Originality/value - Solution to a decision-making problem in a two-level system, with the given vehicle model, and use of rescheduling for quality improvement was not considered beforehand.", "paper_title": "Decision making algorithm for a class of two-level manufacturing systems", "paper_id": "WOS:000270378700022"}