{"auto_keywords": [{"score": 0.05007852962010534, "phrase": "motion_sickness"}, {"score": 0.019503622918562478, "phrase": "virtual_environment"}, {"score": 0.005918154652451104, "phrase": "virtual_environments"}, {"score": 0.004545240514015278, "phrase": "motion_sickness_questionnaire"}, {"score": 0.004050116768809519, "phrase": "self-reported_questionnaires"}, {"score": 0.003922379213268195, "phrase": "ssq"}, {"score": 0.0037743802306714545, "phrase": "converging_evidence"}, {"score": 0.0034725269588525534, "phrase": "controlled_studies"}, {"score": 0.00334144503360907, "phrase": "user's_subjective_response"}, {"score": 0.0032777653153451265, "phrase": "demand_characteristic"}, {"score": 0.003215295260684715, "phrase": "pre_and_posttest_measures"}, {"score": 0.0027920359090544107, "phrase": "contrast_effects"}, {"score": 0.002738797804069541, "phrase": "demand_characteristics"}], "paper_keywords": ["motion sickness", " cyber sickness", " demand characteristics", " user study", " manual control", " three", " dimensional tracking", " placebo effect", " virtual environment"], "paper_abstract": "The experience of motion sickness in a virtual environment may be measured through pre and postexperiment self-reported questionnaires such as the Simulator Sickness Questionnaire (SSQ). Although research provides converging evidence that users of virtual environments can experience motion sickness, there have been no controlled studies to determine to what extent the user's subjective response is a demand characteristic resulting from pre and posttest measures. In this study, subjects were given either SSQ's both pre and postvirtual environment immersion, or only postimmersion. This technique tested for contrast effects due to demand characteristics in which administration of the questionnaire itself suggested to the participant that the virtual environment may produce motion sickness. Results indicate that reports of motion sickness after immersion in a virtual environment are much greater when both pre and postquestionnaires are given than when only a posttest questionnaire is used. The implications for assessments of motion sickness in virtual environments are discussed.", "paper_title": "Demand characteristics in assessing motion sickness in a virtual environment: Or does taking a motion sickness questionnaire make you sick?", "paper_id": "WOS:000244895300002"}