{"auto_keywords": [{"score": 0.047677014623858455, "phrase": "online_products"}, {"score": 0.00481495049065317, "phrase": "uk_local_authority_websites"}, {"score": 0.004299823165101385, "phrase": "conventional_mode"}, {"score": 0.004270429323002124, "phrase": "public_service_delivery"}, {"score": 0.004140613635632826, "phrase": "telephone_mode"}, {"score": 0.004112303664150895, "phrase": "electronic_means"}, {"score": 0.003839594092937135, "phrase": "immense_interest"}, {"score": 0.0037100724714897084, "phrase": "older_age_group"}, {"score": 0.0035603802089559716, "phrase": "exploratory_and_explanatory_research"}, {"score": 0.00349979888845939, "phrase": "e-government_initiatives"}, {"score": 0.003464003018180413, "phrase": "uk"}, {"score": 0.003405079282231439, "phrase": "london"}, {"score": 0.0033127570056253283, "phrase": "mixed_qualitative_and_quantitative_research_approach"}, {"score": 0.002838435157502933, "phrase": "local_authority_websites"}, {"score": 0.002809336972473929, "phrase": "useful_and_relevant_information"}, {"score": 0.00236591959343317, "phrase": "better_understanding"}, {"score": 0.0023017619208704067, "phrase": "digital_divide"}, {"score": 0.002285995583106854, "phrase": "older_citizens"}, {"score": 0.0021049977753042253, "phrase": "older_citizen"}], "paper_keywords": ["digital divide", " older people", " e-government", " quality", " local authority websites"], "paper_abstract": "Governments around the globe are striving to provide e-government, online products and services to all the citizens of their respective countries. This has meant that there is a shift in the conventional mode of public service delivery from a face-to-face and telephone mode to electronic means. However, not all the citizens are making use of these changes, and the one demographic group that is currently attracting immense interest related to their welfare, health and other such issues is the older age group. Using this as a reason, the aim of this exploratory and explanatory research was to understand the e-government initiatives in the UK, more specifically in London. To conduct this research, a mixed qualitative and quantitative research approach was pursued. It was concluded that the benefits of the Internet to many of the users is relative, depending on the age, perceptions and level of innovativeness of the user. It was learnt that in relation to quality, the local authority websites do contain useful and relevant information for the elderly. However, this information is difficult to access, mainly due to the lack of knowledge, skills in the use of computers or Internet. From this research, it is expected that a contribution to academia will emerge in the form of a better understanding of issues related to e-government, the digital divide and older citizens. For industry, the contributions of this research are the identification and understanding of issues related to online products and services and the older citizen. For policy-makers, this research proffers an understanding of issues related with demand and supply of online products and services that governments are currently providing.", "paper_title": "Silver Surfers, E-government and the Digital Divide: An Exploratory Study of UK Local Authority Websites and Older Citizens", "paper_id": "WOS:000325765200001"}