{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "rule-based_computing"}, {"score": 0.04019752040333948, "phrase": "xcellog"}, {"score": 0.004346874334971379, "phrase": "rule_sets"}, {"score": 0.004276306563103443, "phrase": "subtle_ways"}, {"score": 0.004021689117050817, "phrase": "widespread_adoption"}, {"score": 0.00357146811369898, "phrase": "rule-based_systems"}, {"score": 0.0035278613436978933, "phrase": "driving_idea"}, {"score": 0.003386301445203071, "phrase": "fundamental_data_type"}, {"score": 0.003223883109446599, "phrase": "spreadsheet_metaphor"}, {"score": 0.003145609726536791, "phrase": "materialized_sets"}, {"score": 0.0031071863712898214, "phrase": "fundamental_feature"}, {"score": 0.002839352319679885, "phrase": "basic_facts"}, {"score": 0.002541910967437926, "phrase": "also_experiment"}, {"score": 0.0024398167078355224, "phrase": "preliminary_experience"}, {"score": 0.002294294558114909, "phrase": "deductive_spreadsheets"}, {"score": 0.0021049977753042253, "phrase": "canned_application_packages"}], "paper_keywords": [""], "paper_abstract": "The promise of rule-based computing was to allow end-users to create, modify, and maintain applications without the need to engage programmers. But experience has shown that rule sets often interact in subtle ways, making them difficult to understand and reason about. This has impeded the widespread adoption of rule-based computing. This paper describes the design and implementation of XcelLog, a user-centered deductive spreadsheet system, to empower non-programmers to specify and manipulate rule-based systems. The driving idea underlying the system is to treat sets as the fundamental data type and rules as specifying relationships among sets, and use the spreadsheet metaphor to create and view the materialized sets. The fundamental feature that makes XcelLog suitable for non-programmers is that the user mainly sees the effect of the rules; when rules or basic facts change, the user sees the impact of the change immediately. This enables the user to gain confidence in the rules and their modification, and also experiment with what-if scenarios without any programming. Preliminary experience with using XcelLog indicates that it is indeed feasible to put the power of deductive spreadsheets for doing rule-based computing into the hands of end-users and do so without the requirement of programming or the constraints of canned application packages.", "paper_title": "XcelLog: a deductive spreadsheet system", "paper_id": "WOS:000251889700005"}