{"auto_keywords": [{"score": 0.029299941152785437, "phrase": "security_messages"}, {"score": 0.00481495049065317, "phrase": "message-person_congruence"}, {"score": 0.004754600386388821, "phrase": "information_security_awareness_campaigns"}, {"score": 0.004164644263639545, "phrase": "different_types"}, {"score": 0.003934681262271618, "phrase": "five_message_themes"}, {"score": 0.00353426342004404, "phrase": "seven_personality_traits"}, {"score": 0.0031346115554600003, "phrase": "security_awareness_message_effectiveness"}, {"score": 0.0026935568995690947, "phrase": "security_efforts"}, {"score": 0.0022423971916457662, "phrase": "best_fit"}, {"score": 0.0022142194702079866, "phrase": "security_awareness_themes"}, {"score": 0.002186395051086251, "phrase": "individual_users"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Information security awareness", " Personality", " Message-person congruence", " Message framing", " Survey research"], "paper_abstract": "In this study, we sought to answer the question of whether certain information security awareness message themes are more or less effective for different types of individuals based on their personality traits. We considered five message themes (deterrence, morality, regret, feedback, and incentive) as they relate to seven personality traits (the Big Five, Machiavellianism, and social desirability). Our survey analysis of 293 users provides evidence that security awareness message effectiveness does vary based on personality, but not always as one would expect. Depending on certain personality traits, some security messages appear beneficial to security efforts, whereas other personality traits make the individual less receptive to certain message types and therefore security messages may backfire in terms of achieving their intended effect. Our exploratory results can assist practitioners in identifying a best fit between security awareness themes and individual users based on their personality profile.(C) 2014 Elsevier Ltd. All rights reserved.", "paper_title": "An exploratory investigation of message-person congruence in information security awareness campaigns", "paper_id": "WOS:000337014000006"}