{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "fair_allocations"}, {"score": 0.02297069737482301, "phrase": "simulated_ultimatum_game"}, {"score": 0.00962596445939987, "phrase": "strong_reciprocity"}, {"score": 0.007427087816067108, "phrase": "altruistic_punishment"}, {"score": 0.004725263546016403, "phrase": "cooperation"}, {"score": 0.004550029253278477, "phrase": "social_sciences"}, {"score": 0.004498812433096501, "phrase": "possible_explanation"}, {"score": 0.004398094237005956, "phrase": "recently_developed_idea"}, {"score": 0.0037959868107895053, "phrase": "material_benefit"}, {"score": 0.0036691380448651443, "phrase": "third-party_altruistic_punishment_mechanisms"}, {"score": 0.003440945901489461, "phrase": "agent-based_modelling"}, {"score": 0.0026813808976594183, "phrase": "spatial_structure"}, {"score": 0.002562451837774567, "phrase": "linearly_structured_population"}, {"score": 0.0024487847651989128, "phrase": "immediate_neighbors"}, {"score": 0.0023137485947956732, "phrase": "standard_economic_theory"}, {"score": 0.002279011030331704, "phrase": "social_structure"}, {"score": 0.0021049977753042253, "phrase": "theoretical_expectations"}], "paper_keywords": ["Cooperation", " Agent-based model", " Punishment", " Game theory", " Altruism"], "paper_abstract": "Cooperation has long been an enigma in the life and social sciences. A possible explanation for the phenomenon is the recently developed idea of strong reciprocity in which agents altruistically reward those that cooperate and altruistically punish those that do not. The acts are altruistic in the sense that when agents punish or reward they incur a cost but receive no material benefit. Both experimentalists and modelers have focused primarily on third-party altruistic punishment mechanisms yet rarely discuss how they establish a cost for punishing. In this study I used agent-based modelling to test the ability of altruistic punishment to elicit fair allocations in a simulated ultimatum game. In particular I simulated agents with the ability to punish neighbors whose offers were deemed too low while systematically varying the ratio of costs between punisher and punishee. Despite several studies in which strong reciprocity is shown to induce cooperation, altruistic punishment failed to evolve fair allocations in these simulations. However, outcomes were highly dependant on the spatial structure of agents in the simulations and fair allocations did evolve in a linearly structured population even in the absence of punishment. As the number of immediate neighbors increased, mean offers fell but still remained significantly greater than that predicted by standard economic theory. Only when social structure was removed, and agents could interact with any other agent in the population, did offers in the simulated ultimatum game match theoretical expectations.", "paper_title": "Strong reciprocity, social structure, and the evolution of fair allocations in a simulated ultimatum game", "paper_id": "WOS:000264477400002"}