{"auto_keywords": [{"score": 0.028158187282501485, "phrase": "orchard"}, {"score": 0.010300912991869846, "phrase": "high_rate"}, {"score": 0.00481495049065317, "phrase": "multicast_trees"}, {"score": 0.004650330504968421, "phrase": "main_purpose"}, {"score": 0.004394688617163029, "phrase": "potentially_very_promising_use"}, {"score": 0.004262881313926916, "phrase": "video_streams"}, {"score": 0.0041170581247889654, "phrase": "real_time"}, {"score": 0.003757480190200645, "phrase": "application_level_multicasting"}, {"score": 0.0029961221584602405, "phrase": "orchard_algorithm"}, {"score": 0.002931569771634119, "phrase": "alm_trees"}, {"score": 0.0027581067089091434, "phrase": "multiple_description_coding"}, {"score": 0.0026986685585382347, "phrase": "video_stream"}, {"score": 0.002473420909291381, "phrase": "resulting_forest"}, {"score": 0.002286781334850213, "phrase": "expected_performance"}, {"score": 0.0022084059770026416, "phrase": "real_system"}, {"score": 0.0021049977753042253, "phrase": "multicast_forest"}], "paper_keywords": ["distributed algorithms", " free-riding", " multicast channels", " multiple description coding", " peer-to-peer"], "paper_abstract": "The main purpose of many current peer-to-peer (P2P) networks is off-line file sharing. However, a potentially very promising use of such networks is to share video streams (e.g., TV programs) in real time. In order to do so, the peers in a P2P network who are interested in the same video stream may employ Application Level Multicasting (ALM). In existing P2P networks, peers may exhibit behavior which is problematic for ALM: they are not always willing to donate! resources (free-riding), and they may arrive and depart at a high rate (churn). In this paper we propose the Orchard algorithm for creating and maintaining ALM trees in P2P networks, which deals with both these problems. By employing a technique called Multiple Description Coding, we split a video stream into several substreams. Orchard creates a dynamic spanning tree for each of these substreams in such a way that in the resulting forest, no peer has to forward more substreams than it receives. Based on an analysis of the expected performance of Orchard and on experiments in a real system, we find that Orchard is capable of maintaining a multicast forest, even when peers join and leave the forest at a high rate.", "paper_title": "The orchard algorithm building multicast trees for P2P video multicasting without free-riding", "paper_id": "WOS:000251109900006"}