{"auto_keywords": [{"score": 0.049178471674397164, "phrase": "unofficial_announcement"}, {"score": 0.018388521959783494, "phrase": "order_amount"}, {"score": 0.007768021401556023, "phrase": "definite_order"}, {"score": 0.00481495049065317, "phrase": "optimal_load"}, {"score": 0.0046797114400479135, "phrase": "mass_customization"}, {"score": 0.004548253531664032, "phrase": "new_collaboration_framework"}, {"score": 0.004420472010542188, "phrase": "supply_chain_structure"}, {"score": 0.004351033214640434, "phrase": "\"load_leveling"}, {"score": 0.004215397034321004, "phrase": "efficient_production_planning_method"}, {"score": 0.004175533280178052, "phrase": "automobile_parts_supplier"}, {"score": 0.002854505078275351, "phrase": "usual_supplier_model"}, {"score": 0.002809595787186068, "phrase": "production_planning"}, {"score": 0.0026119199311316573, "phrase": "supplier's_inventory_cost"}, {"score": 0.0022788129005268066, "phrase": "maker's_cost_load"}, {"score": 0.0021049977753042253, "phrase": "best_leveling_degree"}], "paper_keywords": ["automobile industry", " mass customization", " load leveling", " framework", " supply chain structure"], "paper_abstract": "In this paper, we propose a new collaboration framework between a maker and a supplier in the supply chain structure from the viewpoint of \"load leveling\" in the supplier. We have developed an efficient production planning method in the automobile parts supplier that provides parts to the maker. After the maker receives orders from customers, the maker gives out orders of parts to the supplier in accordance with the order amount of customers. The maker preliminarily informs the order amount of parts to the supplier as an unofficial announcement, there is dispersion between the definite order and the unofficial announcement. On our latest model, only the supplier model is examined where the order from the maker was given by the constant. That is, the leveling of the order from the maker was not considered. Leveling is to control the width of dispersion of order amount by ordering a lot of parts beforehand and holding many parts as inventory. In this paper, the usual supplier model is expanded, the production planning including the maker and the supplier is discussed. When the dispersion between the definite order and the unofficial announcement is wide, the supplier's inventory cost is large since the supplier should have a lot of parts so as not to run out of inventory. On the other hand, the maker can give orders to the supplier by controlling the dispersion of orders from customers, the maker's cost load increases when controlling it too much since the maker should hold a lot of inventory. This paper suggests a framework to obtain the best leveling degree by expressing the dispersion of orders from the maker to the supplier as sigma.", "paper_title": "Decision of optimal load leveling point and effect of unofficial announcement for implementing mass customization", "paper_id": "WOS:000244011400007"}