{"auto_keywords": [{"score": 0.02295331367609629, "phrase": "mast"}, {"score": 0.00481495049065317, "phrase": "maximum_agreement"}, {"score": 0.00457013354092966, "phrase": "evolutionary_trees"}, {"score": 0.004010960493946656, "phrase": "largest_subset"}, {"score": 0.003907586297783078, "phrase": "input_trees"}, {"score": 0.003459191419478298, "phrase": "different_data_sets"}, {"score": 0.00335274516738272, "phrase": "mct."}, {"score": 0.003340768341189764, "phrase": "horizontal_gene_transfers"}, {"score": 0.002770150086489194, "phrase": "relative_location"}, {"score": 0.0027341763737751467, "phrase": "small_subset"}, {"score": 0.0025279105573394727, "phrase": "rooted_or_unrooted_trees"}, {"score": 0.0024201029474586007, "phrase": "exact_fixed-parameter_tractable_algorithms"}, {"score": 0.0021702292394814144, "phrase": "known_result"}, {"score": 0.002123433075137768, "phrase": "fixed-parameter_tractability"}], "paper_keywords": ["phylogenetics", " algorithms", " consensus", " pattern matching", " trees", " compatibility", " fixed", " parameter tractability"], "paper_abstract": "Given a set of evolutionary trees on a same set of taxa, the maximum agreement subtree problem (MAST), respectively, maximum compatible tree problem (MCT), consists of finding a largest subset of taxa such that all input trees restricted to these taxa are isomorphic, respectively compatible. These problems have several applications in phylogenetics such as the computation of a consensus of phylogenies obtained from different data sets, the identification of species subjected to horizontal gene transfers and, more recently, the inference of supertrees, e. g., Trees Of Life. We provide two linear time algorithms to check the isomorphism, respectively, compatibility, of a set of trees or otherwise identify a conflict between the trees with respect to the relative location of a small subset of taxa. Then, we use these algorithms as subroutines to solve MAST and MCT on rooted or unrooted trees of unbounded degree. More precisely, we give exact fixed-parameter tractable algorithms, whose running time is uniformly polynomial when the number of taxa on which the trees disagree is bounded. The improves on a known result for MAST and proves fixed-parameter tractability for MCT.", "paper_title": "Improved parameterized complexity of the maximum agreement subtree and maximum compatible tree problems", "paper_id": "WOS:000239378400009"}