{"auto_keywords": [{"score": 0.00434906528856802, "phrase": "potent_inhibitors"}, {"score": 0.004313793774439379, "phrase": "new_possibilities"}, {"score": 0.004278807087784626, "phrase": "anticancer_therapy"}, {"score": 0.004244102948402086, "phrase": "molecular_dynamics"}, {"score": 0.003960210592458847, "phrase": "structural_transitions"}, {"score": 0.003755949722774176, "phrase": "whole_time"}, {"score": 0.003695237613399466, "phrase": "slightly_structural_changes"}, {"score": 0.0035332741328861776, "phrase": "molecular_mechanics"}, {"score": 0.003504595508262064, "phrase": "born_surface"}, {"score": 0.0034620119220744347, "phrase": "mm-gbsa"}, {"score": 0.0029773436815290215, "phrase": "side_chains"}, {"score": 0.0028583875909257766, "phrase": "energy_decomposition"}, {"score": 0.0028236336891860592, "phrase": "structure-affinity_analyses"}, {"score": 0.002634506575564286, "phrase": "important_interaction_energy"}, {"score": 0.0024083881142747954, "phrase": "three-dimensional_structures"}, {"score": 0.00221063611719246, "phrase": "important_role"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["MD simulations", " MM-GBSA", " Binding free energy", " MDM2-p53 interaction", " Conformational mobility"], "paper_abstract": "The oncoprotein MDM2 (murine double minute 2) negatively regulates the activity and Stability of tumor suppressor p53. Inactivation of the MDM2-p53 interaction by potent inhibitors offers new possibilities for anticancer therapy. Molecular dynamics (MD) simulations were performed on three inhibitors-MDM2 complexes to investigate the stability and structural transitions. Simulations show that the backbone of MDM2 maintains stable during the whole time. However, slightly structural changes of inhibitors and MDM2 are observed. Furthermore, the molecular mechanics generalized Born surface area (MM-GBSA) approach was introduced to analyze the interactions between inhibitors and MDM2. The results show that binding of inhibitor pDIQ to MDM2 is significantly stronger than that of pMI and pDI to MDM2. The side chains of residues have more contribution than backbone of residues in energy decomposition. The structure-affinity analyses show that L54, I61, M62, Y67, Q72, H73 and V93 produce important interaction energy with inhibitors. The residue W/Y22' is also very important to the interaction between the inhibitors and MDM2. The three-dimensional structures at different times indicate that the mobility of Y100 influences on the binding of inhibitors to MDM2, and its change has important role in conformations of inhibitors and MDM2. (C) 2013 Elsevier Inc. All rights reserved.", "paper_title": "Molecular dynamics simulations studies and free energy analysis on inhibitors of MDM2-p53 interaction", "paper_id": "WOS:000328176600014"}