{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "task_performance"}, {"score": 0.032539471083621686, "phrase": "students'_problem-solving_performance"}, {"score": 0.028333105634795526, "phrase": "metacognitive_web-searching_strategies"}, {"score": 0.025562567223749957, "phrase": "existing_knowledge"}, {"score": 0.004426092397211699, "phrase": "web-based_chemistry_problem-solving"}, {"score": 0.004288472456976113, "phrase": "web-searching_and_problem-solving_scaffolds"}, {"score": 0.0042212686864468805, "phrase": "undergraduate_students'_problem-solving_task_performance"}, {"score": 0.0040047396607954325, "phrase": "web-searching_strategies_students"}, {"score": 0.003839510177926892, "phrase": "domain_knowledge"}, {"score": 0.003492155652400838, "phrase": "freshman_chemistry_course"}, {"score": 0.0032437952431945724, "phrase": "mandated_screen-capture_software"}, {"score": 0.003209782650616367, "phrase": "participants'_on-screen_web-searching_processes"}, {"score": 0.0027547408718334603, "phrase": "higher_problem-solving_performance"}, {"score": 0.0025994945418484935, "phrase": "lower_problem-solving_performance"}, {"score": 0.0023146962503449186, "phrase": "students'_use"}, {"score": 0.0022544399432457164, "phrase": "major_factor"}, {"score": 0.002172701452347454, "phrase": "regression_model"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Applications in subject areas", " Post-secondary education", " Teaching/learning strategies"], "paper_abstract": "This study investigates the effect of Web-based Chemistry Problem-Solving, with the attributes of Web-searching and problem-solving scaffolds, on undergraduate students' problem-solving task performance. In addition, the nature and extent of Web-searching strategies students used and its correlation with task performance and domain knowledge also were examined. We recruited a total of 183 undergraduate students, all of whom are taking the freshman chemistry course, to participate in the study to solve three chemistry tasks across a semester. Mandated screen-capture software captured participants' on-screen Web-searching processes were recorded every five seconds. Results demonstrated that students' problem-solving performance was significantly improved from task 1 to 3, and students with more domain knowledge outperformed students with less domain knowledge. Students with higher problem-solving performance employed more existing knowledge and metacognitive Web-searching strategies; and students with lower problem-solving performance employed more cognitive Web-searching strategies. In addition, students' problem-solving performance was correlated with their domain knowledge, use of existing knowledge, and metacognitive Web-searching strategies. Moreover, students' use of existing knowledge was the major factor for predicting their problem-solving performance according to the regression model. (C) 2012 Elsevier Ltd. All rights reserved.", "paper_title": "Web-based undergraduate chemistry problem-solving: The interplay of task performance, domain knowledge and web-searching strategies", "paper_id": "WOS:000305036400050"}