{"auto_keywords": [{"score": 0.0436812150145203, "phrase": "enterprise_ethics"}, {"score": 0.029982627370306138, "phrase": "requisitely_holistic_planning"}, {"score": 0.005797929494166903, "phrase": "ethical_core_values"}, {"score": 0.00571157284837134, "phrase": "ethical_climate"}, {"score": 0.005584430049878185, "phrase": "formal_measures"}, {"score": 0.0055426776828465685, "phrase": "business_ethics"}, {"score": 0.00481495049065317, "phrase": "enterprise_ethical_behaviour"}, {"score": 0.004778923541463994, "phrase": "purpose_-_ethical_behaviour"}, {"score": 0.0038721890530859578, "phrase": "enterprise_culture"}, {"score": 0.0036052633308076933, "phrase": "dialectical_systems_theory"}, {"score": 0.003356675879109443, "phrase": "successful_implementation"}, {"score": 0.0033190180867511605, "phrase": "ethics_program"}, {"score": 0.003148774338287351, "phrase": "enterprise's_stakeholders"}, {"score": 0.0030554300179552415, "phrase": "ethical_behaviour"}, {"score": 0.0026384167183586015, "phrase": "informal_and_formal_measures"}, {"score": 0.002569816610348772, "phrase": "enterprise_ethics_implementation"}, {"score": 0.0025409639091476363, "phrase": "present_research_paper"}, {"score": 0.0025124343366192954, "phrase": "important_practical_implications"}, {"score": 0.0023745087648471613, "phrase": "sustainable_development"}, {"score": 0.0023214774334744713, "phrase": "enterprises'_long-term_success"}, {"score": 0.0022781884538102264, "phrase": "available_literature"}, {"score": 0.0022273034991008326, "phrase": "similar_research"}, {"score": 0.0021049977753042253, "phrase": "core_values"}], "paper_keywords": ["Cybernetics", " Business ethics", " Organizational culture", " Organizational planning", " Systems theory"], "paper_abstract": "Purpose - Ethical behaviour of enterprises can be attained only by planning of ethics. The purpose of this paper is to show the need for the business ethics planning, to disclose the need for the requisitely holistic planning of enterprise ethics, and to offer the concept of the requisitely holistic planning of enterprise ethics. Design/methodology/approach - The research cognitions on the importance of ethical core values, enterprise culture, ethical climate and informal as well as formal measures of business ethics are discussed and argued in application of the dialectical systems theory. The various research insights are used and applied in concluding concept of requisitely holistic planning of enterprise ethics. Findings - For successful implementation of the ethics program or plan, it is important that the program is internalized by all enterprise's stakeholders. The paper shows that credibility and ethical behaviour of an enterprise can be achieved only through requisitely holistic planning of enterprise ethics. Practical implications - This paper gives us the insights in the state of the importance and interconnection between ethical core values, culture and ethical climate as well as informal and formal measures of business ethics in relation to enterprise ethics implementation. The present research paper also has important practical implications since it shows the importance of the requisitely holistic planning of enterprise ethics in a sense of sustainable development of enterprises as well as enterprises' long-term success. Originality/value - The available literature does not provide for a similar research or concept of requisitely holistic planning of enterprise ethics. The paper also models the interconnection between core values, culture, climate and informal as well as formal measures of business ethics in order to understand the importance of enterprise ethics.", "paper_title": "Requisitely holistic ethics planning as pre-condition for enterprise ethical behaviour", "paper_id": "WOS:000277538300004"}