{"auto_keywords": [{"score": 0.029139449391002565, "phrase": "on-time_deletion"}, {"score": 0.00481495049065317, "phrase": "logical_ordering"}, {"score": 0.004647466515629609, "phrase": "bst"}, {"score": 0.004355267258397068, "phrase": "data_structure"}, {"score": 0.004278807087784626, "phrase": "clean_separation"}, {"score": 0.0032223742018434856, "phrase": "concurrent_non-balanced_bst"}, {"score": 0.003165739628969694, "phrase": "lock-free_lookup"}, {"score": 0.0028800314406625996, "phrase": "mutating_operations"}, {"score": 0.002426137929553722, "phrase": "new_feature"}, {"score": 0.0023554316787703137, "phrase": "previous_concurrent_internal_tree_algorithms"}, {"score": 0.0021049977753042253, "phrase": "lock-free_contains"}], "paper_keywords": ["Concurrency", " Search Trees"], "paper_abstract": "We present practical, concurrent binary search tree (BST) algorithms that explicitly maintain logical ordering information in the data structure, permitting clean separation from its physical tree layout. We capture logical ordering using intervals, with the property that an item belongs to the tree if and only if the item is an endpoint of some interval. We are thus able to construct efficient, synchronization-free and intuitive lookup operations. We present (i) a concurrent non-balanced BST with a lock-free lookup, and (ii) a concurrent AVL tree with a lock-free lookup that requires no synchronization with any mutating operations, including balancing operations. Our algorithms apply on-time deletion; that is, every request for removal of a node, results in its immediate removal from the tree. This new feature did not exist in previous concurrent internal tree algorithms. We implemented our concurrent BST algorithms and evaluated them against several state-of-the-art concurrent tree algorithms. Our experimental results show that our algorithms with lock-free contains and on-time deletion are practical and often comparable to the state-of-the-art.", "paper_title": "Practical Concurrent Binary Search Trees via Logical Ordering", "paper_id": "WOS:000349142100030"}