{"auto_keywords": [{"score": 0.037585235719586725, "phrase": "carbohydrate_metabolism"}, {"score": 0.008521520258402512, "phrase": "biochemical_reactions"}, {"score": 0.006534233129614381, "phrase": "external_perturbations"}, {"score": 0.00481495049065317, "phrase": "breakdown_points"}, {"score": 0.0047910471257663805, "phrase": "metabolic_networks"}, {"score": 0.00473180412700104, "phrase": "complex_network"}, {"score": 0.0045357787854931894, "phrase": "biological_systems"}, {"score": 0.004490842671590769, "phrase": "genetic_and_environmental_changes"}, {"score": 0.0043782949579043, "phrase": "s._cerevisae"}, {"score": 0.004347838747057813, "phrase": "mutational_changes"}, {"score": 0.004315487055548749, "phrase": "alternative_pathways"}, {"score": 0.0040854526743211396, "phrase": "alternate_path"}, {"score": 0.003848413823574867, "phrase": "biochemical_reaction"}, {"score": 0.003781894548959589, "phrase": "ultimate_product"}, {"score": 0.0037350832473790007, "phrase": "quantitative_approach"}, {"score": 0.003661382948704217, "phrase": "physical_change"}, {"score": 0.003553540530701019, "phrase": "saccharomyces_cerevisae"}, {"score": 0.003483425042862533, "phrase": "homo"}, {"score": 0.0031765793936411727, "phrase": "metabolic_pathway"}, {"score": 0.00314506637082357, "phrase": "mutation_event"}, {"score": 0.0031294269188087915, "phrase": "biological_networks"}, {"score": 0.003052384957581699, "phrase": "particular_attack"}, {"score": 0.0029403531729828574, "phrase": "exact_boundary"}, {"score": 0.002925728709297618, "phrase": "network_breakdown"}, {"score": 0.0026812282414768536, "phrase": "'resilience-based'_score"}, {"score": 0.00256993314099902, "phrase": "metabolite_essentiality"}, {"score": 0.002544422946205545, "phrase": "cellular_robustness"}, {"score": 0.002500386390058989, "phrase": "future_drug_development"}, {"score": 0.0024387926103125158, "phrase": "metabolic_pathways"}, {"score": 0.0023846534541336326, "phrase": "random_and_targeted_attack"}, {"score": 0.002366874838212892, "phrase": "random_as_well_as_targeted_resilience"}, {"score": 0.0022970729721700604, "phrase": "'resilience_score"}, {"score": 0.0021635708820765547, "phrase": "kyoto_encyclopedia_for_genes"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Graph theory", " Breakdown", " Perturbation", " Resilience", " Robustness"], "paper_abstract": "Background: A complex network of biochemical reactions present in an organism generates various biological moieties necessary for its survival. It is seen that biological systems are robust to genetic and environmental changes at all levels of organization. Functions of various organisms are sustained against mutational changes by using alternative pathways. It is also seen that if any one of the paths for production of the same metabolite is hampered, an alternate path tries to overcome this defect and helps in combating the damage. Methodology: Certain physical, chemical or genetic change in any of the precursor substrate of a biochemical reaction may damage the production of the ultimate product. We employ a quantitative approach for simulating this phenomena of causing a physical change in the biochemical reactions by performing external perturbations to 12 metabolic pathways under carbohydrate metabolism in Saccharomyces cerevisae as well as 14 metabolic pathways under carbohydrate metabolism in Homo sapiens. Here, we investigate the relationship between structure and degree of compatibility of metabolites against external perturbations, i.e., robustness. Robustness can also be further used to identify the extent to which a metabolic pathway can resist a mutation event. Biological networks with a certain connectivity distribution may be very resilient to a particular attack but not to another. The goal of this work is to determine the exact boundary of network breakdown due to both random and targeted attack, thereby analyzing its robustness. We also find that compared to various non-standard models, metabolic networks are exceptionally robust. Here, we report the use of a 'Resilience-based' score for enumerating the concept of 'network-breakdown'. We also use this approach for analyzing metabolite essentiality providing insight into cellular robustness that can be further used for future drug development. Results: We have investigated the behavior of metabolic pathways under carbohydrate metabolism in S. cerevisae and H. sapiens against random and targeted attack. Both random as well as targeted resilience were calculated by formulating a measure, that we termed as 'Resilience score'. Datasets of metabolites were collected for 12 metabolic pathways belonging to carbohydrate metabolism in S. cerevisae and 14 metabolic pathways belonging to carbohydrate metabolism in H. sapiens from Kyoto Encyclopedia for Genes and Genomes (KEGG). (C) 2011 Elsevier Ltd. All rights reserved.", "paper_title": "Detecting breakdown points in metabolic networks", "paper_id": "WOS:000298274400007"}