{"auto_keywords": [{"score": 0.049100450513748305, "phrase": "eeg_signals"}, {"score": 0.010612387000973441, "phrase": "automated_diagnosis"}, {"score": 0.004525629293824217, "phrase": "neurological_disorder"}, {"score": 0.0041666157975446564, "phrase": "automated_detection"}, {"score": 0.003997891221012094, "phrase": "useful_tool"}, {"score": 0.003956784357357341, "phrase": "medical_field"}, {"score": 0.0038558497470953306, "phrase": "epilepsy_detection"}, {"score": 0.003816197777388722, "phrase": "signal_processing_techniques"}, {"score": 0.003757480190200645, "phrase": "wavelet_transform"}, {"score": 0.003234299589505403, "phrase": "nonlinear_parameter"}, {"score": 0.0031193028729331667, "phrase": "eeg_signal"}, {"score": 0.0027126684113045756, "phrase": "unique_ranges"}, {"score": 0.0025625729433234623, "phrase": "ictal_eeg_signals"}, {"score": 0.0022749744354271816, "phrase": "different_stages"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Epilepsy", " Interictal", " EEG", " Entropy", " Fuzzy", " HOS"], "paper_abstract": "Epilepsy is the neurological disorder of the brain which is difficult to diagnose visually using Electroencephalogram (EEG) signals. Hence, an automated detection of epilepsy using EEG signals will be a useful tool in medical field. The automation of epilepsy detection using signal processing techniques such as wavelet transform and entropies may optimise the performance of the system. Many algorithms have been developed to diagnose the presence of seizure in the EEG signals. The entropy is a nonlinear parameter that reflects the complexity of the EEG signal. Many entropies have been used to differentiate normal, interictal and ictal EEG signals. This paper discusses various entropies used for an automated diagnosis of epilepsy using EEG signals. We have presented unique ranges for various entropies used to differentiate normal, interictal, and ictal EEG signals and also ranked them depending on the ability to discrimination ability of three classes. These entropies can be used to classify the different stages of epilepsy and can also be used for other biomedical applications. (C) 2015 Elsevier B.V. All rights reserved.", "paper_title": "Application of entropies for automated diagnosis of epilepsy using EEG signals: A review", "paper_id": "WOS:000362611600008"}