{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "recommender_systems"}, {"score": 0.035252220524069185, "phrase": "tel_recommender_systems"}, {"score": 0.015553775575606972, "phrase": "technology_enhanced_learning"}, {"score": 0.0046875099587735825, "phrase": "quantitative_survey"}, {"score": 0.004612662942073808, "phrase": "increasing_number"}, {"score": 0.004324985524216987, "phrase": "growing_interest"}, {"score": 0.003990396413957743, "phrase": "tel"}, {"score": 0.0039055990919333082, "phrase": "specific_requirements"}, {"score": 0.0035648266669315943, "phrase": "particular_requirements"}, {"score": 0.003470358620464986, "phrase": "specific_goals"}, {"score": 0.003378385493203297, "phrase": "evaluation_process"}, {"score": 0.0032189132350239013, "phrase": "diverse_evaluation_methods"}, {"score": 0.0029221312451219203, "phrase": "major_conferences"}, {"score": 0.0027841357057119295, "phrase": "relevant_work"}, {"score": 0.0023314867226678555, "phrase": "growing_awareness"}, {"score": 0.0022941723937662927, "phrase": "research_community"}, {"score": 0.002127765807039172, "phrase": "substantial_potential"}], "paper_keywords": ["Recommender systems", " evaluation", " survey", " technology enhanced learning"], "paper_abstract": "The increasing number of publications on recommender systems for Technology Enhanced Learning (TEL) evidence a growing interest in their development and deployment. In order to support learning, recommender systems for TEL need to consider specific requirements, which differ from the requirements for recommender systems in other domains like e-commerce. Consequently, these particular requirements motivate the incorporation of specific goals and methods in the evaluation process for TEL recommender systems. In this article, the diverse evaluation methods that have been applied to evaluate TEL recommender systems are investigated. A total of 235 articles are selected from major conferences, workshops, journals, and books where relevant work have been published between 2000 and 2014. These articles are quantitatively analysed and classified according to the following criteria: type of evaluation methodology, subject of evaluation, and effects measured by the evaluation. Results from the survey suggest that there is a growing awareness in the research community of the necessity for more elaborate evaluations. At the same time, there is still substantial potential for further improvements. This survey highlights trends and discusses strengths and shortcomings of the evaluation of TEL recommender systems thus far, thereby aiming to stimulate researchers to contemplate novel evaluation approaches.", "paper_title": "Evaluating Recommender Systems for Technology Enhanced Learning: A Quantitative Survey", "paper_id": "WOS:000367334900002"}