{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "learning_analytics_tool"}, {"score": 0.004533806239310673, "phrase": "different_aspects"}, {"score": 0.004497576466646301, "phrase": "learning_processes"}, {"score": 0.00440825801245188, "phrase": "specific_tool"}, {"score": 0.003971502222405927, "phrase": "learning_analytics_acceptance_model"}, {"score": 0.0035778632599436024, "phrase": "usage_beliefs"}, {"score": 0.003368707839819003, "phrase": "learning_analytics"}, {"score": 0.0030468495296763617, "phrase": "adoption_beliefs"}, {"score": 0.0025633455664747606, "phrase": "technology_acceptance_model"}, {"score": 0.0024133533748653033, "phrase": "loco-analyst_tool"}, {"score": 0.0023558375480288297, "phrase": "specific_analytics_types"}, {"score": 0.002327594516681507, "phrase": "primary_antecedence"}, {"score": 0.002308953751676031, "phrase": "perceived_usefulness"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["quantitative evaluation", " E-learning", " Feedback", " Learning analytics", " LAAM", " Ontologies"], "paper_abstract": "Present research and development offer various learning analytics tools providing insights into different aspects of learning processes. Adoption of a specific tool for practice is based on how its learning analytics are perceived by educators to support their pedagogical and organizational goals. In this paper, we propose and empirically validate a Learning Analytics Acceptance Model (LAAM) of factors influencing the beliefs of educators concerning the adoption a learning analytics tool. In particular, our model explains how the usage beliefs (i.e., ease-of-use and usefulness perceptions) about the learning analytics of a tool are associated with the intention to adopt the tool. In our study, we considered several factors that could potentially affect the adoption beliefs: i) pedagogical knowledge and information design skills of educators; ii) educators' perceived utility of a learning analytics tool; and iii) educators' perceived ease-of-use of a learning analytics tool. By following the principles of Technology Acceptance Model, the study is done with a sample of educators who experimented with a LOCO-Analyst tool. Our study also determined specific analytics types that are primary antecedence of perceived usefulness (concept comprehension and social interaction) and ease-of-use (interactive visualization). (C) 2012 Elsevier Ltd. All rights reserved.", "paper_title": "Factors influencing beliefs for adoption of a learning analytics tool: An empirical study", "paper_id": "WOS:000316523100014"}