{"auto_keywords": [{"score": 0.034573121894918304, "phrase": "individual_level"}, {"score": 0.015719716506582538, "phrase": "individual_researchers"}, {"score": 0.015560954417193747, "phrase": "bibliometric_indicators"}, {"score": 0.007390833570291968, "phrase": "scientific_performance"}, {"score": 0.004412654209742722, "phrase": "large_scientific_bodies"}, {"score": 0.004300830853119242, "phrase": "large_number"}, {"score": 0.003961613484271729, "phrase": "research_work"}, {"score": 0.0038217146888983576, "phrase": "detailed_peer_evaluation"}, {"score": 0.0035565113234273926, "phrase": "short_term"}, {"score": 0.0033096502887394233, "phrase": "scientometrics_assessment"}, {"score": 0.003209152260950748, "phrase": "easy_task"}, {"score": 0.0031116963435584982, "phrase": "smaller_number"}, {"score": 0.002851301751761804, "phrase": "citation_practices"}, {"score": 0.0027646829399573434, "phrase": "sub_disciplines"}, {"score": 0.0026532596852754525, "phrase": "good_bibliometric_indicators"}, {"score": 0.002585906251354904, "phrase": "main_goal"}, {"score": 0.0021049977753042253, "phrase": "different_cultures"}], "paper_keywords": ["h index", " Impact indicator", " Normalization", " Individuals"], "paper_abstract": "The assessment of individual researchers using bibliometric indicators is more complex than that of a region, country or university. For large scientific bodies, averages over a large number of researchers and their outputs is generally believed to give indication of the quality of the research work. For an individual, the detailed peer evaluation of his research outputs is required and, even this, may fail in the short term to make a final, long term assessment of the relevance and originality of the work. Scientometrics assessment at individual level is not an easy task not only due to the smaller number of publications that are being evaluated, but other factors can influence significantly the bibliometric indicators applied. Citation practices vary widely among disciplines and sub disciplines and this may justify the lack of good bibliometric indicators at individual level. The main goal of this study was to develop an indicator that considers in its calculation some of the aspects that we must take into account on the assessment of scientific performance at individual level. The indicator developed, the h(nf) index, considers the different cultures of citation of each field and the number of authors per publication. The results showed that the h(nf) index can be used on the assessment of scientific performance of individual researchers and for following the performance of a researcher.", "paper_title": "An impact indicator for researchers", "paper_id": "WOS:000296473400008"}