{"auto_keywords": [{"score": 0.04088899068598468, "phrase": "coupled_networks"}, {"score": 0.00481495049065317, "phrase": "improving_robustness"}, {"score": 0.0047689174754929195, "phrase": "coupled_networks_against_cascading_failures._many_real-world_networks"}, {"score": 0.004208881856146758, "phrase": "different_regions"}, {"score": 0.003325410433297401, "phrase": "total_protective_cost"}, {"score": 0.002977061391551628, "phrase": "cascading_failures"}, {"score": 0.0028235667474151714, "phrase": "edge_load"}, {"score": 0.002467536552997677, "phrase": "immunization_strategy"}, {"score": 0.0022626835039082746, "phrase": "local_perspective"}, {"score": 0.002145942273032774, "phrase": "single_network"}, {"score": 0.0021049977753042253, "phrase": "key_edges"}], "paper_keywords": ["Cascading failure", " coupled networks", " robustness", " BA network"], "paper_abstract": "Many real-world networks interact with other networks by only several links, for example, transportation networks and aviation networks among cities, internet router network among the different regions, power supply network among cities and so on. Understanding how to protect these coupled networks and improve their robustness against cascading failures is very important. By protecting the edges between coupled networks, we investigate its efficiency on improving the robustness of coupled networks against cascading failures. Fixing the total protective cost of coupled networks, we find that adjusting the capacities of the edges among coupled networks can better improve the robustness of coupled networks against cascading failures and observe that the more uniform the distribution of the edge load, the more effective the protection strategy. In addition, by immunizing the edges among coupled networks, we compare two protecting methods and find that the immunization strategy can better protect coupled networks. Our results are useful not only for how to protect coupled networks from the local perspective, but also for significantly improving the robustness of a single network by protecting some key edges.", "paper_title": "IMPROVING ROBUSTNESS OF COUPLED NETWORKS AGAINST CASCADING FAILURES", "paper_id": "WOS:000325768800001"}