{"auto_keywords": [{"score": 0.049110045082843494, "phrase": "progress_indicators"}, {"score": 0.020423553354392426, "phrase": "drop-off_rates"}, {"score": 0.017879716347851474, "phrase": "progress_indicator"}, {"score": 0.005900262925912459, "phrase": "constant_progress_indicator"}, {"score": 0.00481495049065317, "phrase": "meta-analysis_of_experiments"}, {"score": 0.00467905143301368, "phrase": "web_surveys"}, {"score": 0.003813269577615793, "phrase": "experimental_group"}, {"score": 0.003751331782523201, "phrase": "online_survey"}, {"score": 0.0035423376631308567, "phrase": "control_group"}, {"score": 0.0023903140267755576, "phrase": "slow-to-fast_indicators"}, {"score": 0.0022385401780982204, "phrase": "small_incentive"}, {"score": 0.002157433262687853, "phrase": "drop-off_rate"}, {"score": 0.0021049977753042253, "phrase": "common_belief"}], "paper_keywords": ["progress indicator", " progress bar", " survey break-off", " drop-off rate", " web surveys"], "paper_abstract": "The use of progress indicators seems to be standard in many online surveys. Researchers include them in surveys in the hope they will help reduce drop-off rates. However, there is no consensus in the literature regarding their effects. In this meta-analysis, we analyzed 32 randomized experiments comparing drop-off rates of an experimental group who completed an online survey in which a progress indicator was shown to drop-off rates of a control group to whom the progress indicator was not shown. In all the studies, a drop-off was defined as a discontinuance of the survey (at any point) after it has begun, resulting in failure to complete the survey. Three types of progress indicators were analyzed: constant, fast-to-slow, and slow-to-fast. Our results show that, overall, using a constant progress indicator does not significantly help reduce drop-offs and that effectiveness of the progress indicator varies depending on the speed of indicator: Fast-to-slow indicators reduced drop-offs, whereas slow-to-fast indicators increased drop-offs. We also found that among the studies in which a small incentive was promised, showing a constant progress indicator increased the drop-off rate. These findings question the common belief that progress indicators help reduce drop-off rates.", "paper_title": "Where Am I? A Meta-Analysis of Experiments on the Effects of Progress Indicators for Web Surveys", "paper_id": "WOS:000329662300005"}