{"auto_keywords": [{"score": 0.04659271537366934, "phrase": "improved_adaptive_trade-off_model"}, {"score": 0.00481495049065317, "phrase": "evolutionary_optimization"}, {"score": 0.0039124037252916055, "phrase": "offspring_population"}, {"score": 0.0036830211726031946, "phrase": "global_exploration_ability"}, {"score": 0.003627800727103479, "phrase": "feasibility_proportion"}, {"score": 0.0035869274480340727, "phrase": "last_population"}, {"score": 0.0031905286720361145, "phrase": "constraint-handling_mechanism"}, {"score": 0.003083849594367653, "phrase": "current_population"}, {"score": 0.002671263324230699, "phrase": "constrained_real-parameter_optimization"}, {"score": 0.0026212437316947197, "phrase": "evolutionary_computation"}, {"score": 0.002572158343938064, "phrase": "experimental_results"}, {"score": 0.002486103638234488, "phrase": "constrained_optimization"}, {"score": 0.0024211628058125067, "phrase": "best_known_solutions"}, {"score": 0.0022363199197710385, "phrase": "self-adaptive_version"}], "paper_keywords": ["Constrained optimization problems", " constraint-handling technique", " evolutionary algorithm", " differential evolution", " adaptive trade-off model"], "paper_abstract": "This paper proposes a (mu + lambda)-differential evolution and an improved adaptive trade-off model for solving constrained optimization problems. The proposed (mu + lambda)-differential evolution adopts three mutation strategies (i.e., rand/1 strategy, current-to-best/1 strategy, and rand/2 strategy) and binomial crossover to generate the offspring population. Moreover, the current-to-best/1 strategy has been improved in this paper to further enhance the global exploration ability by exploiting the feasibility proportion of the last population. Additionally, the improved adaptive trade-off model includes three main situations: the infeasible situation, the semi-feasible situation, and the feasible situation. En each situation, a constraint-handling mechanism is designed based on the characteristics of the current population. By combining the (mu + lambda)-differential evolution with the improved adaptive trade-off model, a generic method named (mu + lambda)-constrained differential evolution ((mu + lambda)-CDE) is developed. The (mu + lambda)-CDE is utilized to solve 24 well-known benchmark test functions provided for the special session on constrained real-parameter optimization of the 2006 IEEE Congress on Evolutionary Computation (CEC2006). Experimental results suggest that the (mu + lambda)-CDE is very promising for constrained optimization, since it can reach the best known solutions for 23 test functions and is able to successfully solve 21 test functions in all runs. Moreover, in this paper, a self-adaptive version of (mu + lambda)-CDE is proposed which is the most competitive algorithm so far among the CEC2006 entries.", "paper_title": "Constrained Evolutionary Optimization by Means of (mu plus lambda)-Differential Evolution and Improved Adaptive Trade-Off Model", "paper_id": "WOS:000290634000004"}