{"auto_keywords": [{"score": 0.04963419481547922, "phrase": "computer_cluster"}, {"score": 0.0075589556507666585, "phrase": "amazon_web_services"}, {"score": 0.00669700939908941, "phrase": "cloud_resources"}, {"score": 0.00481495049065317, "phrase": "microarray_analysis"}, {"score": 0.004573953147933065, "phrase": "recent_high-dimensional_biological_data"}, {"score": 0.00436530211426514, "phrase": "resampling_or_permutation_tests"}, {"score": 0.004304574865291508, "phrase": "basic_statistical_analysis"}, {"score": 0.004146716743362567, "phrase": "crucial_advantage"}, {"score": 0.003884212965525665, "phrase": "computational_independence"}, {"score": 0.00379452936798156, "phrase": "permutation_iterations"}, {"score": 0.0035376693476114733, "phrase": "computing_resources"}, {"score": 0.0032219438233946312, "phrase": "statistical_projects"}, {"score": 0.002684819249720834, "phrase": "cloud_implementations"}, {"score": 0.002622755848331379, "phrase": "microarray_analysis_procedures"}, {"score": 0.002550165781755603, "phrase": "different_platforms"}, {"score": 0.0024336086025284836, "phrase": "particular_needs"}, {"score": 0.0023996890513009743, "phrase": "different_statistical_projects"}, {"score": 0.002289993730291138, "phrase": "network_capacity"}, {"score": 0.0021750990136123367, "phrase": "standard_computer_cluster_implementations"}], "paper_keywords": ["Biostatistics", " cloud computing", " computing methodologies", " microarray analysis", " statistical computing"], "paper_abstract": "Background: Analysis of recent high-dimensional biological data tends to be computationally intensive as many common approaches such as resampling or permutation tests require the basic statistical analysis to be repeated many times. A crucial advantage of these methods is that they can be easily parallelized due to the computational independence of the resampling or permutation iterations, which has induced many statistics departments to establish their own computer clusters. An alternative is to rent computing resources in the cloud, e.g. at Amazon Web Services. Objectives: In this article we analyze whether a selection of statistical projects, recently implemented at our department, can be efficiently realized on these cloud resources. Moreover, we illustrate an opportunity to combine computer cluster and cloud resources. Methods: In order to compare the efficiency of computer cluster and cloud implementations and their respective parallelizations we use microarray analysis procedures and compare their runtimes on the different platforms. Results: Amazon Web Services provide various instance types which meet the particular needs of the different statistical projects we analyzed in this paper. Moreover, the network capacity is sufficient and the parallelization is comparable in efficiency to standard computer cluster implementations. Conclusion: Our results suggest that many statistical projects can be efficiently realized on cloud resources. It is important to mention, however, that workflows can change substantially as a result of a shift from computer cluster to cloud computing.", "paper_title": "Application of Microarray Analysis on Computer Cluster and Cloud Platforms", "paper_id": "WOS:000313847800008"}