{"auto_keywords": [{"score": 0.050075346051085365, "phrase": "medical_informatics"}, {"score": 0.04814050608144561, "phrase": "mi"}, {"score": 0.013407501615703653, "phrase": "scientific_literature"}, {"score": 0.004412780054037622, "phrase": "wide_range"}, {"score": 0.004372442291178139, "phrase": "research_topics"}, {"score": 0.0038624981944755813, "phrase": "medline_records"}, {"score": 0.0036052633308076933, "phrase": "isi_category"}, {"score": 0.0034911335714333507, "phrase": "semi-automated_procedure"}, {"score": 0.0033190180867511605, "phrase": "mi._a_clustering_algorithm"}, {"score": 0.003097865379563127, "phrase": "mi_literature"}, {"score": 0.00286493504971388, "phrase": "health_information_systems"}, {"score": 0.0021049977753042253, "phrase": "different_journals"}], "paper_keywords": ["Medical informatics", " topic map", " scientific journals", " semantic similarity"], "paper_abstract": "Objectives: The domain of medical informatics (MI) is not well defined. It covers a wide range of research topics. Our objective is to characterize the field of MI by means of the scientific literature in this domain. Methods: We used titles and abstracts from MEDLINE records of papers published between July 1993 and July 2008, and extracted uni-, bi- and trigrams as features. Starting with the ISI category of medical informatics, we applied a semi-automated procedure to identify the set of journals and proceedings pertaining to MI. A clustering algorithm was subsequently applied to the articles from this set of publications. Results: MI literature can be divided into three subdomains: 1) the organization, application, and evaluation of health information systems, 2) medical knowledge representation, and 3) signal and data analysis. Over the last fifteen years, the field has remained relatively stable, although most journals have shifted their focus somewhat. Conclusions: We identified the scientific literature pertaining to the field of MI, and the main areas of research. We were able to show trends in the field, and the positioning of different journals within this field.", "paper_title": "Mapping the Domain of Medical Informatics", "paper_id": "WOS:000262991700011"}