{"auto_keywords": [{"score": 0.04856216099390579, "phrase": "fault_pairs"}, {"score": 0.016917355120064113, "phrase": "equivalence_and_dominance_relations"}, {"score": 0.008345643587225766, "phrase": "diagnostic_fault_simulation"}, {"score": 0.00825689205906894, "phrase": "test_generation"}, {"score": 0.008125516824429892, "phrase": "fault_pair"}, {"score": 0.004815227117125186, "phrase": "dominance"}, {"score": 0.004233119608341877, "phrase": "fault_diagnosis_procedures"}, {"score": 0.0038226070564362697, "phrase": "basic_entity"}, {"score": 0.00266693888510356, "phrase": "fault_collapsing"}, {"score": 0.0021049977753042253, "phrase": "additional_fault_pair"}], "paper_keywords": ["Diagnostic fault simulation", " diagnostic test generation", " fault collapsing", " fault diagnosis", " fault dominance", " fault equivalence"], "paper_abstract": "Equivalence and dominance relations used earlier in fault diagnosis procedures are defined as relations between faults, similar to the relations used for fault collapsing. Since the basic entity of diagnostic fault simulation and test generation is a fault pair, and not a single fault, we introduce a framework where equivalence and dominance relations are defined for fault pairs. Using equivalence and dominance relations between fault pairs, we define a fault pair collapsing process, where fault pairs are removed from consideration under diagnostic fault simulation and test generation since they are guaranteed to be distinguished when other fault pairs are distinguished. Another concept, which was used earlier to enhance fault collapsing, is the level of similarity between faults. We extend this definition into a level of similarity between fault pairs and discuss its use for fault pair collapsing. The level of similarity encompasses equivalence and dominance relations between fault pairs, and extends them to allow additional fault pair collapsing.", "paper_title": "Equivalence, Dominance, and Similarity Relations between Fault Pairs and a Fault Pair Collapsing Process for Fault Diagnosis", "paper_id": "WOS:000272986800001"}