{"auto_keywords": [{"score": 0.009177612239234254, "phrase": "polygon-shaped_fuzzy_number"}, {"score": 0.007280544195664705, "phrase": "proposed_methodology"}, {"score": 0.00450231514359539, "phrase": "global_warming"}, {"score": 0.0039772848945723435, "phrase": "hybrid_fuzzy_linear_regression"}, {"score": 0.003936391411261324, "phrase": "flr"}, {"score": 0.0038758293658651237, "phrase": "back_propagation_network"}, {"score": 0.003623949225126944, "phrase": "proposed_approach"}, {"score": 0.0035866734383189366, "phrase": "multiple_experts"}, {"score": 0.0033883824438527316, "phrase": "flr_equation"}, {"score": 0.003168079471049896, "phrase": "fuzzy_forecasts"}, {"score": 0.0031193028729331667, "phrase": "two-step_aggregation_mechanism"}, {"score": 0.0030239842475439814, "phrase": "first_step"}, {"score": 0.0029928611380840757, "phrase": "fuzzy_intersection"}, {"score": 0.0023467391904246834, "phrase": "historical_data"}, {"score": 0.0021601997088758957, "phrase": "experimental_results"}], "paper_keywords": ["Back propagation network", " forecasting", " fuzzy linear regression", " global CO2 concentration"], "paper_abstract": "The global CO2 concentration is considered to be one of the most important causes of global warming that must be closely monitored, accurately forecasted, and controlled as good as possible. To accurately forecast the global CO2 concentration, a hybrid fuzzy linear regression (FLR) and back propagation network (BPN) approach is proposed in this study. In this proposed approach, multiple experts construct their own FLR equations from various viewpoints to forecast future global CO2 concentrations. Each FLR equation can be converted into two equivalent nonlinear programming problems to be solved. To combine these fuzzy forecasts, a two-step aggregation mechanism is applied. At the first step, fuzzy intersection is applied to combine the fuzzy global CO2 concentration forecasts into a polygon-shaped fuzzy number, in order to improve the precision. After that, a BPN is constructed to defuzzify the polygon-shaped fuzzy number and to generate a representative/crisp value, so as to enhance the accuracy. Some historical data on global CO2 concentrations were used to evaluate the effectiveness of the proposed methodology. According to the experimental results, the proposed methodology improved both the precision and the accuracy of forecasting the global CO2 concentration by 28% and 91%, respectively.", "paper_title": "A fuzzy-neural approach for global CO2 concentration forecasting", "paper_id": "WOS:000294432100008"}