{"auto_keywords": [{"score": 0.03125229471227752, "phrase": "spatial_relations"}, {"score": 0.00481495049065317, "phrase": "spatial_datasets"}, {"score": 0.00471193241675062, "phrase": "online_spatial_datasets"}, {"score": 0.004138309011478741, "phrase": "prior_knowledge"}, {"score": 0.003894963476923956, "phrase": "effective_and_efficient_way"}, {"score": 0.0037786899855446, "phrase": "spatial_dataset"}, {"score": 0.0032896745636186824, "phrase": "underlying_technique"}, {"score": 0.00319141242685261, "phrase": "query_aggregation"}, {"score": 0.003163878786694538, "phrase": "selectivity_estimation"}, {"score": 0.0031365819432206004, "phrase": "spatial_dataset_browsing"}, {"score": 0.0030960762496815737, "phrase": "unique_challenges"}, {"score": 0.002863762666256937, "phrase": "browsing_applications"}, {"score": 0.0025474814283429213, "phrase": "contains_relation"}, {"score": 0.0023460397258997525, "phrase": "query_results"}, {"score": 0.0021418339161425994, "phrase": "highly_accurate_estimates"}], "paper_keywords": ["databases", " query processing", " geographic information systems"], "paper_abstract": "As online spatial datasets grow both in number and sophistication, it becomes increasingly difficult for users to decide whether a dataset is suitable for their tasks, especially when they do not have prior knowledge of the dataset. In this paper, we propose browsing as an effective and efficient way to explore the content of a spatial dataset. Browsing allows users to view the size of a result set before evaluating the query at the database, thereby avoiding zero-hit/mega-hit queries and saving time and resources. Although the underlying technique supporting browsing is similar to range query aggregation and selectivity estimation, spatial dataset browsing poses some unique challenges. In this paper, we identify a set of spatial relations that need to be supported in browsing applications, namely, the contains, contained and the overlap relations. We prove a lower bound on the storage required to answer queries about the contains relation accurately at a given resolution. We then present three storage-efficient approximation algorithms which we believe to be the first to estimate query results about these spatial relations. We evaluate these algorithms with both synthetic and real world datasets and show that they provide highly accurate estimates for datasets with various characteristics.", "paper_title": "Exploring spatial datasets with histograms", "paper_id": "WOS:000238035800003"}