{"auto_keywords": [{"score": 0.04782220347071723, "phrase": "social_network-facilitated_team_collaboration"}, {"score": 0.00481495049065317, "phrase": "intentional_social_action"}, {"score": 0.0038284549148537373, "phrase": "instant_messaging"}, {"score": 0.0035181731203867456, "phrase": "gender_differences"}, {"score": 0.003174903873774882, "phrase": "research_model"}, {"score": 0.0030069062905274976, "phrase": "mainland_china"}, {"score": 0.002813566267090177, "phrase": "positive_anticipated_emotions"}, {"score": 0.0027630232270330402, "phrase": "group_norms"}, {"score": 0.0025542617599268323, "phrase": "social_identity"}, {"score": 0.0025235718883452564, "phrase": "negative_anticipated_emotions"}, {"score": 0.002222717552124615, "phrase": "considerable_light"}, {"score": 0.0021049977753042253, "phrase": "information_technology"}], "paper_keywords": ["we-intention", " gender", " instant messaging", " social networking", " anticipated emotions", " social influence"], "paper_abstract": "The growth and popularity of Web 2.0 applications help people to build and maintain their social networks online and further encourage social network-facilitated team collaboration. In this study, we conceptualized the use of instant messaging in social network-facilitated team collaboration as an intentional social action and further investigated the effect of gender differences in the development of we-intention (i.e. collective intention) to engage in such collaboration. A research model was developed and empirically tested with 482 university students in Mainland China. The results demonstrated that the effects of attitude, positive anticipated emotions, and group norms on we-intention were more important for men, whereas the effects of social identity and negative anticipated emotions were more significant for women to collectively participate in social network-facilitated team collaboration. We believe the implications of this study would shed considerable light on both research and practice. Journal of Information Technology (2010) 25, 152-169. doi: 10.1057/jit.2010.12 Published online 25 May 2010", "paper_title": "Gender differences in intentional social action: we-intention to engage in social network-facilitated team collaboration", "paper_id": "WOS:000278927100005"}