{"auto_keywords": [{"score": 0.031448220523346296, "phrase": "things'_properties"}, {"score": 0.00481495049065317, "phrase": "data_modeling"}, {"score": 0.004668957916795845, "phrase": "pointers."}, {"score": 0.004550669123303854, "phrase": "conceptual_data_modeling"}, {"score": 0.0038217146888983576, "phrase": "persistent_effort"}, {"score": 0.00325901518290063, "phrase": "ontology_studies"}, {"score": 0.0030957429853133147, "phrase": "clear_distinction"}, {"score": 0.0029255474957478474, "phrase": "central_thrust"}, {"score": 0.0028076592725295646, "phrase": "ontologically_guided_principle"}, {"score": 0.0025992391074270097, "phrase": "better_user_performance"}, {"score": 0.0024062532032402533, "phrase": "pointers_principle"}, {"score": 0.002262209824105154, "phrase": "experiment_data"}, {"score": 0.0022390533383717715, "phrase": "user_data"}], "paper_keywords": ["Data Modeling", " Empirical", " Ontology", " Pointer", " Relationship without Pointers"], "paper_abstract": "Research on ontology and conceptual data modeling builds on the premise that the world could be represented in terms of concepts (also known as \"things\"), their properties and their (things') relationships. A persistent effort in the representation is how to distinguish things from their properties, as well as how to denote relationships that relate two things together. Following the tradition of deriving guidelines from ontology studies, this paper proposes a need to make a clear distinction between relationships among things and relationships among things' properties. The central thrust of this paper is in proposing an ontologically guided principle: For the same relationship, working with the relationship among things will lead to better user performance than working with the relationship among things' properties. This principle, called Relationship without Pointers principle, is robustly validated by re-analyzing a set of experiment data on user data modeling performance with three database models. This principle may be applicable to other contexts that study relationships.", "paper_title": "Data Modeling: An Ontological Perspective of Pointers", "paper_id": "WOS:000209636200002"}