{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "member's_motivation"}, {"score": 0.0496213341565463, "phrase": "voluntary_community"}, {"score": 0.006351936420331217, "phrase": "sns"}, {"score": 0.004567129988306349, "phrase": "voluntary_communities"}, {"score": 0.004501774379030109, "phrase": "local_communities"}, {"score": 0.004458722048888919, "phrase": "university_club_activities"}, {"score": 0.004089239912167375, "phrase": "binding_forces"}, {"score": 0.0036611708297251645, "phrase": "social_networking_services"}, {"score": 0.0029203055813347874, "phrase": "current_conditions"}, {"score": 0.0025644240336018045, "phrase": "member's_personal_activities"}, {"score": 0.0024914105981393127, "phrase": "social_activities"}, {"score": 0.0021876814398268775, "phrase": "university_club's_activities"}], "paper_keywords": ["Gamification", " Voluntary Community", " Motivation Management"], "paper_abstract": "Recently, the number of voluntary communities such as local communities and university club activities are increasing. In these communities, since there are various types of members and there are no binding forces, it is usually difficult to maintain and improve member's motivation. To maintain and improve member's motivation, most of these communities use social networking services (SNSs). However, since existing SNS offer few functions for voluntary community, it is difficult to solve this problem. This research focused on the concept of gamification and proposed an SNS to improve member's motivation of voluntary community. First, the authors analyzed the current conditions and members of a voluntary community. Based on this analysis, the authors found that an SNS to improve member's motivation of voluntary community requires functions which support member's personal activities and also functions which increase social activities. Next, the authors built an SNS that had these functions by applying the concept of gamification. The authors implemented the SNS for a University club's activities for one month and showed the effectiveness of our SNS.", "paper_title": "A Proposal of SNS to Improve Member's Motivation in Voluntary Community Using Gamification", "paper_id": "WOS:000357578700012"}