{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "controllability_problems"}, {"score": 0.009204966912541898, "phrase": "coordination_messages"}, {"score": 0.00852708142148034, "phrase": "input_output_transition_system"}, {"score": 0.0047732596509542135, "phrase": "distributed_testing"}, {"score": 0.004491313367627919, "phrase": "physically_distributed_interfaces"}, {"score": 0.00367658459781873, "phrase": "port_p"}, {"score": 0.0033262524445013303, "phrase": "test_objectives"}, {"score": 0.0032404677650217407, "phrase": "particular_transition"}, {"score": 0.002831158147480665, "phrase": "individual_ports"}, {"score": 0.0027341763737751467, "phrase": "external_communications_network"}, {"score": 0.0024950747439601863, "phrase": "deterministic_finite_state_machine"}, {"score": 0.002257070536352418, "phrase": "sufficient_messages"}, {"score": 0.0021052125089108904, "phrase": "np"}], "paper_keywords": ["Distributed testing", " Controllability problems", " Coordination messages", " Input output transition system"], "paper_abstract": "This paper concerns the testing of a system with physically distributed interfaces, called ports, at which it interacts with its environment. We place a tester at each port and the tester at port p observes events at p only. This can lead to controllability problems, where the observations made by the tester at a port p are not sufficient for it to be able to know when to send an input. It is known that there are test objectives, such as executing a particular transition, that cannot be achieved if we restrict attention to test cases that have no controllability problems. This has led to interest in schemes where the testers at the individual ports send coordination messages to one another through an external communications network in order to overcome controllability problems. However, such approaches have largely been studied in the context of testing from a deterministic finite state machine. This paper investigates the use of coordination messages to overcome controllability problems when testing from an input output transition system and gives an algorithm for introducing sufficient messages. It also proves that the problem of minimising the number of coordination messages used is NP-hard.", "paper_title": "Overcoming controllability problems in distributed testing from an input output transition system", "paper_id": "WOS:000300893400004"}