{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "gradient_orientations"}, {"score": 0.004694092086199672, "phrase": "face_recognition"}, {"score": 0.004605434064238641, "phrase": "novel_direction"}, {"score": 0.004489810932879285, "phrase": "face_images"}, {"score": 0.004133627071344356, "phrase": "different_local_image_structures"}, {"score": 0.0033941500504060286, "phrase": "pca"}, {"score": 0.0033508547759861186, "phrase": "dimensionality_reduction_technique"}, {"score": 0.002931569771634119, "phrase": "complementary_strength"}, {"score": 0.002750721367040336, "phrase": "stronger_results"}, {"score": 0.002468450551616404, "phrase": "feret_database"}, {"score": 0.0022010126160835024, "phrase": "contemporary_ones"}, {"score": 0.0021319959284827896, "phrase": "higher_performance"}, {"score": 0.0021049977753042253, "phrase": "lower_complexity"}], "paper_keywords": ["Face recognition", " face recognition technology", " face representation", " labeled faces in the wild", " low complexity"], "paper_abstract": "A novel direction for efficiently describing face images is proposed by exploring the relationships between both gradient orientations and magnitudes of different local image structures. Presented in this paper are not only a novel feature set called patterns of orientation difference (POD) but also several improvements to our previous algorithm called patterns of oriented edge magnitudes (POEM). The whitened principal component analysis (PCA) dimensionality reduction technique is applied upon both the POEM-and POD-based representations to get more compact and discriminative face descriptors. We then show that the two methods have complementary strength and that by combining the two algorithms, one obtains stronger results than either of them considered separately. By experiments carried out on several common benchmarks, including the FERET database with both frontal and nonfrontal images as well as the very challenging LFW data set, we prove that our approach is more efficient than contemporary ones in terms of both higher performance and lower complexity.", "paper_title": "Exploring Patterns of Gradient Orientations and Magnitudes for Face Recognition", "paper_id": "WOS:000318596100003"}