{"auto_keywords": [{"score": 0.03688561500335818, "phrase": "probed_system"}, {"score": 0.015719716506582538, "phrase": "haptic_interaction"}, {"score": 0.0156064537160041, "phrase": "dynamical_systems"}, {"score": 0.013749589751948938, "phrase": "active_sensing"}, {"score": 0.009917530149102223, "phrase": "proposed_principle"}, {"score": 0.009528545898292896, "phrase": "classification_performance"}, {"score": 0.004236539316738291, "phrase": "basic_principle"}, {"score": 0.003810093416457147, "phrase": "extremely_basic_hypothesis"}, {"score": 0.002970476379751357, "phrase": "second-order_mechanical_system"}, {"score": 0.0027911639820564897, "phrase": "active_power_source"}, {"score": 0.00276066021951467, "phrase": "passive_testing_sensor"}, {"score": 0.002730488910300527, "phrase": "decreased_sensitivity"}, {"score": 0.0026516301310428756, "phrase": "tested_power_source"}, {"score": 0.0025006623485285895, "phrase": "reduced_sensitivity"}, {"score": 0.002482404507958289, "phrase": "spring_and_damper_parameters"}, {"score": 0.002419542935774618, "phrase": "linear_system"}, {"score": 0.00239309075766136, "phrase": "noisy_environment"}, {"score": 0.0023669270875629205, "phrase": "computer_simulation"}, {"score": 0.00224032791638295, "phrase": "ten_subjects"}, {"score": 0.0022158306933307685, "phrase": "active_virtual_system"}, {"score": 0.0021439311243100913, "phrase": "just-noticeable_difference"}, {"score": 0.0021049977753042253, "phrase": "significantly_better_sensitivity"}], "paper_keywords": ["Sensitivity analysis", " classification", " just-noticeable difference", " human-machine interaction"], "paper_abstract": "What is it inside the colorfully wrapped present? You pick it up to ear level and listen, shake it, and then listen again. To you, the basic principle of active sensing is quite clear first absorb, then, if there is no movement or sound, shake it, and then reabsorb. We propose an extremely basic hypothesis for the active sensing of haptic interaction with dynamical systems. Our hypothesis asserts that in order to improve the efficiency of extracting information from a probed system, the sensor should act according to the following basic principle: if the probed system is passive, the sensor should be active; conversely, when the probed system is active, the sensor should be passive. We proved the proposed principle for interaction with a second-order mechanical system with the goal to enhance classification performance between two possible sine power sources. We showed that the addition of an active power source to a passive testing sensor leads to decreased sensitivity in the amplitude and frequency of the tested power source. Further, an extension of this principle is provided, presenting the conditions for reduced sensitivity to spring and damper parameters. To test its applicability for a linear system in a noisy environment, a computer simulation was performed demonstrating that classification performance improved by following the proposed principle. At last, ten subjects probed an active virtual system under either active or passive conditions. A comparison of the mean just-noticeable difference of both conditions indicated significantly better sensitivity was obtained by following the principle.", "paper_title": "An Active Sensing Principle for Haptic Interaction With Dynamical Systems", "paper_id": "WOS:000209653800020"}