{"auto_keywords": [{"score": 0.04358528013743181, "phrase": "patient_care"}, {"score": 0.033728439377764825, "phrase": "conceptual_and_operational_definitions"}, {"score": 0.027034046387903025, "phrase": "nursing_care"}, {"score": 0.0048150620459351335, "phrase": "updating"}, {"score": 0.004571055044692412, "phrase": "nursing_unit"}, {"score": 0.00454610829874136, "phrase": "service_level"}, {"score": 0.004041359131062721, "phrase": "direct_patient_care"}, {"score": 0.003953806321226277, "phrase": "safe_and_quality_care"}, {"score": 0.003910740988145338, "phrase": "patient_outcomes"}, {"score": 0.0038893838564184107, "phrase": "nurse_retention"}, {"score": 0.0037947054862511724, "phrase": "healthcare_organization's_accreditation"}, {"score": 0.0037124763118311734, "phrase": "five_nursing_management_minimum_data_set_data_elements"}, {"score": 0.0036519716087768253, "phrase": "publicly_accessible_healthcare_data"}, {"score": 0.003622088701900472, "phrase": "observation_identifier_names"}, {"score": 0.003524227590204673, "phrase": "nursing_management_data_elements"}, {"score": 0.0034953863043906057, "phrase": "empirical_use"}, {"score": 0.003466780226380516, "phrase": "critical_review"}, {"score": 0.0033454923523807668, "phrase": "consensus_approach"}, {"score": 0.003299977511820374, "phrase": "interdisciplinary_panel"}, {"score": 0.0031240075437664314, "phrase": "revised_data_element"}, {"score": 0.0029492991503845003, "phrase": "data_collection"}, {"score": 0.002925149105307855, "phrase": "updated_conceptual_definition"}, {"score": 0.002592784882557155, "phrase": "nursing_resources"}, {"score": 0.0025786066704445304, "phrase": "quantifiable_data"}, {"score": 0.002508867228980776, "phrase": "healthcare_costs"}, {"score": 0.002474706265455793, "phrase": "unsustainable_rate"}, {"score": 0.00239460114991662, "phrase": "potential_areas"}, {"score": 0.002291804012486431, "phrase": "nursing_management_minimum_data"}, {"score": 0.0022482261385133617, "phrase": "problem_areas"}, {"score": 0.0022298039221908712, "phrase": "nursing_time"}, {"score": 0.0021399277552314067, "phrase": "better_informed_decisions"}, {"score": 0.002116577422058574, "phrase": "diverse_settings"}, {"score": 0.0021049977753042253, "phrase": "hospital_designs"}], "paper_keywords": ["Access", " Client accessibility", " Nursing management minimum data set"], "paper_abstract": "Patient/client accessibility is one of 18 Nursing Management Minimum Data Set data elements developed to evaluate contextual factors at the nursing unit or service level of care. The Nursing Management Minimum Data Set 06 patient/client accessibility was developed to capture variability in time and distance required to access patients. Variability in access to patients, needed supplies, equipment, and information for patient care has an impact on the amount of time available for direct patient care. Limitations in time available to provide safe and quality care may negatively affect patient outcomes, nurse retention, and, as a result, a healthcare organization's accreditation and finances. Since 2005, the first five Nursing Management Minimum Data Set data elements have been incorporated into the publicly accessible healthcare data set Logical Observation Identifier Names and Codes, thereby making results derived from these nursing management data elements available for empirical use. A critical review of the literature and other healthcare resources was conducted to update patient/client accessibility. A consensus approach was used by an interdisciplinary panel of experts to finalize recommendations for revisions. The name, conceptual and operational definitions, and measures were updated. The revised data element is titled \"client accessibility.\" The conceptual and operational definitions were expanded and measures changed to increase validity and reliability of data collection. The updated conceptual definition is \"the time, distance, and method to connect the nurse/provider and client for an encounter and includes the information, supplies, equipment, and personnel required for the encounter.\" The Nursing Management Minimum Data Set can provide individuals responsible for managing and financing nursing resources with quantifiable data regarding the context of nursing care. At present, healthcare costs are rising at an unsustainable rate, and many national healthcare outcomes are worsening. More information is needed to identify potential areas of improvement in the management and funding of nursing care. The update and use of Nursing Management Minimum Data Set 06 data element client accessibility may help to identify problem areas associated with nursing time, distance traveled, and methods used to provide patient care. Such empirical evidence may support better informed decisions on caseloads in diverse settings, hospital designs, methods used to provide care, and fiscal requirements.", "paper_title": "Updating and Normalization of the Nursing Management Minimum Data Set Element 6 Patient/Client Accessibility", "paper_id": "WOS:000303806900004"}