{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "global_data"}, {"score": 0.015372596864516417, "phrase": "global_data_usage"}, {"score": 0.01043477444380794, "phrase": "software_systems"}, {"score": 0.004448169552315403, "phrase": "common_coupling"}, {"score": 0.0034867406208212146, "phrase": "software_project"}, {"score": 0.0033893426032054366, "phrase": "data_usage"}, {"score": 0.003313380246267812, "phrase": "software_project's_lifetime"}, {"score": 0.003239114833599948, "phrase": "constant_refactoring"}, {"score": 0.0032026066791743866, "phrase": "perfective_maintenance"}, {"score": 0.002975099633631871, "phrase": "increasing_reliance"}, {"score": 0.002795228413298423, "phrase": "global_data_usage_patterns"}, {"score": 0.0027170943110836425, "phrase": "software_metric"}, {"score": 0.0026262033625248445, "phrase": "interesting_or_significant_event"}, {"score": 0.0025819015229390663, "phrase": "software's_lifetime"}, {"score": 0.0023848164282879885, "phrase": "effective_and_automatic_technique"}, {"score": 0.002279011030331704, "phrase": "large_software_systems"}], "paper_keywords": [""], "paper_abstract": "In this research, we investigate the role of common coupling in evolving software systems. It can be argued that most software developers understand that the use of global data has many harmful side-effects, and thus should be avoided. We are therefore interested in the answer to the following question: if global data does exist within a software project, how does global data usage evolve over a software project's lifetime? Perhaps the constant refactoring and perfective maintenance eliminates global data usage, or conversely, perhaps the constant addition of features and rapid development introduce an increasing reliance on global data? We are also interested in identifying if global data usage patterns are useful as a software metric that is indicative of an interesting or significant event in the software's lifetime. The focus of this research is twofold: first to develop an effective and automatic technique for studying global data usage over the lifetime of large software systems and secondly, to leverage this technique in a case-study of global data usage for several large and evolving software systems in an effort to reach answers to these questions.", "paper_title": "The pervasiveness of global data in evolving software systems", "paper_id": "WOS:000236901100030"}