{"auto_keywords": [{"score": 0.03769895297228562, "phrase": "multicast_receivers"}, {"score": 0.004757227624616643, "phrase": "multimedia_services"}, {"score": 0.004700193486903964, "phrase": "wireless_local_area_networks"}, {"score": 0.004425072111844721, "phrase": "video_quality"}, {"score": 0.004319566932528865, "phrase": "reliable_delivery"}, {"score": 0.004267757384195032, "phrase": "video_traffic"}, {"score": 0.004216566615939546, "phrase": "video_multicast_frames"}, {"score": 0.004042166795461166, "phrase": "power-saving_stations"}, {"score": 0.0038516336597530614, "phrase": "video_multicast"}, {"score": 0.0037825134619339537, "phrase": "power_saving"}, {"score": 0.0037371212381934853, "phrase": "reliability_perspectives"}, {"score": 0.0035181731203867456, "phrase": "power_management"}, {"score": 0.0034550163444256386, "phrase": "multicast_frames"}, {"score": 0.0028823939507764238, "phrase": "power_saving_mode"}], "paper_keywords": [""], "paper_abstract": "Video streaming service via multicast is one promising technology for multimedia services over wireless local area networks. Given that many portable devices are battery-powered while video quality relies on the reliable delivery of video traffic, video multicast frames need to be reliably delivered to power-saving stations. In this article, we study video multicast from the power saving and reliability perspectives. The IEEE 802.11 standard allows multicast receivers to enable power management while receiving multicast frames. However, from measurements with several commercial WLAN devices, we observe that many devices are not standards-compliant, thus severely degrading video multicast performance when multicast receivers are in the power saving mode. We identify various standards-non-compliant malfunctions of both access points and stations, and then categorize these malfunctions. Meanwhile, the legacy 802.11 standard is known to support only unreliable multicast service due to the lack of retransmissions. We present various reliable multicast schemes including application layer forward error correction and reliable multicast protocols defined in the emerging IEEE 802.11v and 802.11aa, and comparatively evaluate them via simulations.", "paper_title": "Video Multicast over WLANs: Power Saving and Reliability Perspectives", "paper_id": "WOS:000316809400008"}