{"auto_keywords": [{"score": 0.0469079690938728, "phrase": "web-based_learning"}, {"score": 0.020515924764082365, "phrase": "learners'_intention"}, {"score": 0.009708947199579258, "phrase": "learners'_satisfaction"}, {"score": 0.00878911995086252, "phrase": "subjective_task_value"}, {"score": 0.00545056090742242, "phrase": "utility_value"}, {"score": 0.00481495049065317, "phrase": "web-based_learning_continuance"}, {"score": 0.0046164478775379105, "phrase": "web-based_application"}, {"score": 0.003941964605885606, "phrase": "fairness_theory"}, {"score": 0.0028886123801902517, "phrase": "subjective_task_value_influence_learners'_intention"}, {"score": 0.002783945062714816, "phrase": "hypothesized_model"}, {"score": 0.0026270572353632297, "phrase": "web-based_learning_program"}, {"score": 0.002492098272172066, "phrase": "attainment_value"}, {"score": 0.002376559242152662, "phrase": "interactional_fairness"}, {"score": 0.0023516185395256505, "phrase": "significant_positive_effects"}, {"score": 0.0022544399432457164, "phrase": "significant_roles"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["continuance intention", " fairness", " satisfaction", " subjective task value", " web-based learning"], "paper_abstract": "Like any other product, service and Web-based application, the success of Web-based learning depends largely on learners' satisfaction and other factors that will eventually increase learners' intention to continue using it. This paper integrates the concept of subjective task value and fairness theory to construct a model for investigating the motivations behind learners' intention to continue using Web-based learning. The model theorizes that four components of subjective task value (i.e., attainment, utility, intrinsic, and cost) and three dimensions of fairness (i.e., distributive, procedural, and interactional) affect learners' satisfaction. We also argue that satisfaction and four distinct components of subjective task value influence learners' intention to continue using Web-based learning. The hypothesized model is validated empirically using data collected from 202 learners of a Web-based learning program designed for continuing education. The results showed that attainment value, utility value, intrinsic value, distributive fairness, and interactional fairness exhibited significant positive effects on satisfaction. Utility value and satisfaction play significant roles in shaping learners' intention to continue using Web-based learning. (C) 2006 Elsevier Ltd. All rights reserved.", "paper_title": "An empirical analysis of the antecedents of web-based learning continuance", "paper_id": "WOS:000250024100017"}