{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "triangular_meshes"}, {"score": 0.004680624753255133, "phrase": "great_interest"}, {"score": 0.004251210982670317, "phrase": "main_approaches"}, {"score": 0.004039995317682942, "phrase": "mesh_vertices"}, {"score": 0.003927203683176278, "phrase": "parametric_triangular_bezier_patches"}, {"score": 0.003148612096891635, "phrase": "particular_technique"}, {"score": 0.0028756028995504035, "phrase": "new_scheme"}, {"score": 0.0028111325206870525, "phrase": "gregory"}, {"score": 0.0024957118407636114, "phrase": "gpu"}, {"score": 0.0023848164282879885, "phrase": "analytic_surfaces"}, {"score": 0.0023313149689465386, "phrase": "different_surface_interrogation_methods"}, {"score": 0.0022405528759521856, "phrase": "low_triangle_count"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Triangular mesh", " G(1) local interpolation", " Rational blend", " Gregory patch", " Bezier triangle", " Shape interrogation"], "paper_abstract": "Interpolation of triangular meshes is a subject of great interest in many computer graphics related applications, as, for example, gaming and realtime rendering. One of the main approaches to interpolate the positions and normals of the mesh vertices is the use of parametric triangular Bezier patches. As it is well known, any method aiming at constructing a parametric, tangent plane (G(1)) continuous surface has to deal with the vertex consistency problem. In this article, we propose a comparison of three methods appeared in the nineties that use a particular technique called rational blend to avoid this problem. Together with these three methods we present a new scheme, a cubic Gregory patch, that has been inspired by one of them. Our comparison includes an analysis of their computational costs on CPU and GPU, a study of their capabilities of approximating analytic surfaces and their response to different surface interrogation methods on arbitrary triangle meshes with a low triangle count that actually occur in their real-world use. (C) 2011 Elsevier Inc. All rights reserved.", "paper_title": "G(1) rational blend interpolatory schemes: A comparative study", "paper_id": "WOS:000310038500003"}