{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "medial_axis"}, {"score": 0.015598432504474456, "phrase": "river_networks"}, {"score": 0.011704603944158547, "phrase": "sample_points"}, {"score": 0.009939605023865773, "phrase": "extraneous_branches"}, {"score": 0.008571187356752755, "phrase": "proposed_method"}, {"score": 0.004630055463858585, "phrase": "digital_elevation_models"}, {"score": 0.004593988639878276, "phrase": "dem"}, {"score": 0.004417487764326481, "phrase": "accurate_dem"}, {"score": 0.004281202319048493, "phrase": "raster-based_algorithms"}, {"score": 0.0041653916552844535, "phrase": "large_areas"}, {"score": 0.003761900996118551, "phrase": "river_network"}, {"score": 0.0031782684007251403, "phrase": "medial_axis_extraction"}, {"score": 0.0030680392468327147, "phrase": "major_issue"}, {"score": 0.0029966788947444535, "phrase": "media_axis"}, {"score": 0.0028033523242224833, "phrase": "post-processing_step"}, {"score": 0.002738131487658495, "phrase": "voronoi-based_medial_axis_extraction_algorithm"}, {"score": 0.002331189621118592, "phrase": "significant_noises"}, {"score": 0.002180702259644951, "phrase": "dem-based_methods"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Watersheds", " Medial axis", " Voronoi diagram", " Delaunay triangulation", " River network"], "paper_abstract": "The watersheds are commonly delineated from digital elevation models (DEM). This approach is not efficient when an accurate DEM is not available. Furthermore, since raster-based algorithms are employed, the computations for large areas are very time consuming and even may be impractical. This article investigates delineation of the watersheds from the medial axis of river networks: If the river network is sampled by a set of points, the medial axis of the sample points provides an approximation of the catchments, whose aggregation results in the watersheds. Although this idea has been already proposed in the literature, the complexities of the medial axis extraction prevent it from being practically used. A major issue is appearing extraneous branches in the media axis due to perturbations of the sample points, which must be filtered out in a pre- or post-processing step. This article improves a Voronoi-based medial axis extraction algorithm by using labeled sample points to automatically avoid extraneous branches. The proposed method is used in four case studies to delineate the watersheds. The results illustrate that the proposed method is stable, easy to implement and robust, even in presence of significant noises and perturbations. The results also indicate that the watersheds delineated using the proposed and the DEM-based methods are reasonably comparable. (C) 2013 Elsevier Ltd. All rights reserved.", "paper_title": "Watershed delineation from the medial axis of river networks", "paper_id": "WOS:000323401000015"}