{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "internet_flow_characteristics"}, {"score": 0.0047709540557306284, "phrase": "previous_studies"}, {"score": 0.0047273577269638725, "phrase": "internet_traffic"}, {"score": 0.004473982381245469, "phrase": "network_bandwidth"}, {"score": 0.004234129588974058, "phrase": "traffic_monitoring"}, {"score": 0.004044064541716598, "phrase": "different_classification_schemes"}, {"score": 0.0036553070575015344, "phrase": "beta_traffic"}, {"score": 0.0034911335714333507, "phrase": "different_definitions"}, {"score": 0.002723607240517261, "phrase": "prior_definitions"}, {"score": 0.0025071862539276283, "phrase": "strong_correlations"}, {"score": 0.002329258721870127, "phrase": "plausible_explanation"}, {"score": 0.002297327670408112, "phrase": "observed_correlations"}, {"score": 0.002163930783583212, "phrase": "application-level_protocol_mechanisms"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["network measurement", " heavy-hitter", " Internet traffic"], "paper_abstract": "Previous studies of Internet traffic have shown that a very small percentage of flows consume most of the network bandwidth. It is important to understand the characteristics of such flows for traffic monitoring and modeling purposes. Several prior researchers have characterized such flows using different classification schemes: by size as elephant and mice; by duration as tortoise and dragonfly; and by burstiness as alpha and beta traffic. However, it is not clear how these different definitions of flows are related to each other. In this work, using data recorded from two different operational networks, we study these \"heavy-hitter\" flows in four different dimensions, namely size, duration, rate and burstiness, and examine how they are correlated. This paper makes three contributions: first, we systematically characterize prior definitions for the properties of such heavy-hitter traffic. Second, based on our datasets, we observe that there are strong correlations between some combinations of size, rate and burstiness. Finally, we provide a plausible explanation for the observed correlations. We show that these correlations could be explained by transport and application-level protocol mechanisms. (c) 2005 Elsevier B.V. All rights reserved.", "paper_title": "A measurement study of correlations of Internet flow characteristics", "paper_id": "WOS:000233330200004"}