{"auto_keywords": [{"score": 0.03197412489693613, "phrase": "mobius_transformation"}, {"score": 0.00481495049065317, "phrase": "automatic_alignment"}, {"score": 0.004769444094319619, "phrase": "genus-zero_surfaces"}, {"score": 0.004701985831087475, "phrase": "new_algorithm"}, {"score": 0.004569905085027681, "phrase": "constructive_way"}, {"score": 0.004462663711734448, "phrase": "triangular_mesh"}, {"score": 0.004337276328199398, "phrase": "destination_surface"}, {"score": 0.004296264970612285, "phrase": "minimal_metric_deformation"}, {"score": 0.004019797503157808, "phrase": "geometric_difference"}, {"score": 0.003569451476205552, "phrase": "distinct_triangulation"}, {"score": 0.003199687131875466, "phrase": "unit_sphere"}, {"score": 0.003154360892955196, "phrase": "discrete_conformal_mapping_algorithm"}, {"score": 0.002965229277927781, "phrase": "function_f."}, {"score": 0.002326304140277375, "phrase": "numerical_experiments"}, {"score": 0.0021352776064254195, "phrase": "corresponding_distances"}], "paper_keywords": ["Conformal mapping", " mesh warping", " Mobius transformation", " nonrigid registration"], "paper_abstract": "A new algorithm is presented that provides a constructive way to conformally warp a triangular mesh of genus zero to a destination surface with minimal metric deformation, as well as a means to compute automatically a measure of the geometric difference between two surfaces of genus zero. The algorithm takes as input a pair of surfaces that are topological 2-spheres, each surface given by a distinct triangulation. The algorithm then constructs a map f between the two surfaces. First, each of the two triangular meshes is mapped to the unit sphere using a discrete conformal mapping algorithm. The two mappings are then composed with a Mobius transformation to generate the function f. The Mobius transformation is chosen by minimizing an energy that measures the distance of f from an isometry. We illustrate our approach using several \"real life\" data sets. We show first that the algorithm allows for accurate, automatic, and landmark-free nonrigid registration of brain surfaces. We then validate our approach by comparing shapes of proteins. We provide numerical experiments to demonstrate that the distances computed with our algorithm between low-resolution, surface-based representations of proteins are highly correlated with the corresponding distances computed between high-resolution, atomistic models for the same proteins.", "paper_title": "Automatic Alignment of Genus-Zero Surfaces", "paper_id": "WOS:000331450100006"}