{"auto_keywords": [{"score": 0.004541712637353326, "phrase": "electronic_information_resources"}, {"score": 0.004447915226010682, "phrase": "user-centred_evaluation"}, {"score": 0.004374267836149339, "phrase": "hci_academics"}, {"score": 0.004160531596936783, "phrase": "user_evaluation_methods"}, {"score": 0.0036400696415545813, "phrase": "formative_evaluations"}, {"score": 0.00347657813672945, "phrase": "particular_type"}, {"score": 0.0034476484413811987, "phrase": "interactive_system_electronic_information_resources"}, {"score": 0.0033204052817782438, "phrase": "evaluation_approach"}, {"score": 0.0032381878248821383, "phrase": "new_hci_methods"}, {"score": 0.0031056437850836326, "phrase": "electronic_resource_developers"}, {"score": 0.003028727936200845, "phrase": "focus_group"}, {"score": 0.00300351371036355, "phrase": "method_usage"}, {"score": 0.002978508766388785, "phrase": "summary_questionnaire"}, {"score": 0.002509284173541882, "phrase": "useful_suggestions"}, {"score": 0.002194929830604162, "phrase": "future_development"}, {"score": 0.002158505888557746, "phrase": "hci_methods"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Evaluation", " Methods", " UEM"], "paper_abstract": "The importance of user-centred evaluation is stressed by HCI academics and practitioners alike. However, there have been few recent evaluation studies of User Evaluation Methods (UEMs), especially those with the aim of improving methods rather than assessing their efficacy (i.e. formative rather than summative evaluations). In this article, we present formative evaluations of two new methods for assessing the functionality and usability of a particular type of interactive system electronic information resources. These serve as an example of an evaluation approach for assessing the success of new HCI methods. We taught the methods to a group of electronic resource developers and collected a mixture of focus group, method usage and summary questionnaire data-all focusing on how useful, usable and learnable the developers perceived the methods to be and how likely they were to use them in the future. Findings related to both methods were generally positive, and useful suggestions for improvement were made. Our evaluation sessions also highlighted a number of trade-offs for the development of UEMs and general lessons learned, which we discuss in order to inform the future development and evaluation of HCI methods. (C) 2011 Elsevier Ltd. All rights reserved.", "paper_title": "Evaluating the Information Behaviour methods: Formative evaluations of two methods for assessing the functionality and usability of electronic information resources", "paper_id": "WOS:000292660300001"}