{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "quaternion_multiplication"}, {"score": 0.004580933283492972, "phrase": "computer_graphics"}, {"score": 0.004233347974930148, "phrase": "formal_algebra"}, {"score": 0.004077995480957875, "phrase": "graphics_community"}, {"score": 0.0038796562792487, "phrase": "geometric_principles"}, {"score": 0.003482276061796395, "phrase": "contemporary_computer_graphics"}, {"score": 0.0033266163944946185, "phrase": "first_principles"}, {"score": 0.0032446544415922615, "phrase": "better_ways"}, {"score": 0.00288800021194675, "phrase": "complex_plane"}, {"score": 0.0027818804382539444, "phrase": "sandwiching_formulas"}, {"score": 0.0026135859312619875, "phrase": "perspective_projections"}, {"score": 0.002404885278896803, "phrase": "topics_i"}, {"score": 0.002212812864395738, "phrase": "special_emphasis"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Complex number", " Mass-point", " Quaternion", " Rotation", " Reflection", " Perspective projection", " Sandwiching"], "paper_abstract": "Quaternion multiplication can be applied to rotate vectors in 3-dimensions. Therefore in Computer Graphics, quaternions are sometimes used in place of matrices to represent rotations in 3-dimensions. Yet while the formal algebra of quaternions is well-known in the Graphics community, the derivations of the formulas for this algebra and the geometric principles underlying this algebra are not well understood. The goals of this paper are: i. To provide a fresh, geometric interpretation of quaternions, appropriate for contemporary Computer Graphics; ii. To derive the formula for quaternion multiplication from first principles; iii. To present better ways to visualize quaternions, and the effect of quaternion multiplication on points and vectors in 3-dimensions based on insights from the algebra and geometry of multiplication in the complex plane; iv. To develop simple, intuitive proofs of the sandwiching formulas for rotation and reflection; v. To show how to apply sandwiching to compute perspective projections. In Part I of this paper, we investigate the algebra of quaternion multiplication and focus in particular on topics i and ii. In Part II we apply our insights from Part I to analyze the geometry of quaternion multiplication with special emphasis on topics iii, iv and v. (C) 2010 Elsevier Inc. All rights reserved.", "paper_title": "Understanding quaternions", "paper_id": "WOS:000296999100003"}