{"auto_keywords": [{"score": 0.03753474001700642, "phrase": "flash"}, {"score": 0.00481495049065317, "phrase": "better_scientific_utilization"}, {"score": 0.0047707093928203, "phrase": "large_supercomputers"}, {"score": 0.004513631630494221, "phrase": "computing_resources"}, {"score": 0.004390312150344245, "phrase": "multiphysics-multiscale_phenomena"}, {"score": 0.004192190072470619, "phrase": "currently_available_high-performance_computing"}, {"score": 0.004040123129261597, "phrase": "scientific_outcome"}, {"score": 0.003734979290204709, "phrase": "explosion_phase"}, {"score": 0.0037006243674469657, "phrase": "type_ia_supernovae"}, {"score": 0.0036496814103475174, "phrase": "largest_available_platforms"}, {"score": 0.003358368814209542, "phrase": "wide_user_base"}, {"score": 0.003281643474564305, "phrase": "multiple_physics_components"}, {"score": 0.0028566300478906916, "phrase": "lagrangian_tracer_particles"}, {"score": 0.002714943351733626, "phrase": "nucleosynthetic_yields"}, {"score": 0.002652878591019016, "phrase": "simulation_planning_process"}, {"score": 0.002174303033371869, "phrase": "previously_unexplored_physical_regimes"}, {"score": 0.0021049977753042253, "phrase": "anticipated_challenges"}], "paper_keywords": ["FLASH", " supercomputer", " optimizations", " SN Ia", " GCD model"], "paper_abstract": "Advances in modeling and algorithms, combined with growth in computing resources, have enabled simulations of multiphysics-multiscale phenomena that can greatly enhance our scientific understanding. However, on currently available high-performance computing (HPC) resources, maximizing the scientific outcome of simulations requires many trade-offs. In this paper we describe our experiences in running simulations of the explosion phase of Type Ia supernovae on the largest available platforms. The simulations use FLASH, a modular, adaptive mesh, parallel simulation code with a wide user base. The simulations use multiple physics components: hydrodynamics, gravity, a sub-grid flame model, a three-stage burning model, and a degenerate equation of state. They also use Lagrangian tracer particles, which are then post-processed to determine the nucleosynthetic yields. We describe the simulation planning process, and the algorithmic optimizations and trade-offs that were found to be necessary. Several of the optimizations and trade-offs were made during the course of the simulations as our understanding of the challenges evolved, or when simulations went into previously unexplored physical regimes. We also briefly outline the anticipated challenges of, and our preparations for, the next-generation computing platforms.", "paper_title": "Pragmatic optimizations for better scientific utilization of large supercomputers", "paper_id": "WOS:000325993400013"}