{"auto_keywords": [{"score": 0.03454004118415158, "phrase": "motif_search"}, {"score": 0.009885117715519831, "phrase": "ems"}, {"score": 0.004685575787741084, "phrase": "biologically_significant_patterns"}, {"score": 0.004497973025639345, "phrase": "biological_sequences"}, {"score": 0.004126123386192962, "phrase": "computational_biology"}, {"score": 0.0040334640350288, "phrase": "experimental_processes"}, {"score": 0.003767738552860633, "phrase": "computational_biologists"}, {"score": 0.003683097597914604, "phrase": "novel_computational_methods"}, {"score": 0.003424771860049617, "phrase": "numerous_algorithms"}, {"score": 0.0029611021411930596, "phrase": "pms"}, {"score": 0.0029342631716621054, "phrase": "sms"}, {"score": 0.0024572448003065423, "phrase": "proposed_algorithms"}, {"score": 0.0023479408542211875, "phrase": "elegant_algorithm"}, {"score": 0.0023266695482709525, "phrase": "ems."}, {"score": 0.0021049977753042253, "phrase": "new_algorithm"}], "paper_keywords": ["Planted motif", " edit motif", " sensitivity", " specificity"], "paper_abstract": "Motifs are biologically significant patterns found in DNA/protein sequences. Given a set of biological sequences, the problem of identifying the motifs is very challenging. This problem has been well studied in computational biology. Identifying motifs through experimental processes is extremely expensive and time consuming. This is one of the factors influencing computational biologists to come up with novel computational methods to predict motifs. Several motif models have been proposed in the literature and for each model numerous algorithms have been devised. Three popular motif models are (l, d)-motif search or Planted Motif Search (PMS), Simple Motif Search (SMS), and Edit-distance based Motif Search (EMS). For PMS and SMS several algorithms have been proposed and implemented. On the other hand, even though some algorithms exist in the literature for the problem of EMS, no implementations of these algorithms are known. This is mainly because the proposed algorithms are complex. In this paper we present an elegant algorithm for EMS. We have implemented this algorithm and compared it against 14 other algorithms in terms of sensitivity and specificity. Our experimental results indicate that the new algorithm is very competitive in practice.", "paper_title": "EMS1: ANELEGANT ALGORITHM FOR EDIT DISTANCE BASED MOTIF SEARCH", "paper_id": "WOS:000322770800004"}