{"auto_keywords": [{"score": 0.035835749663277267, "phrase": "service_provider"}, {"score": 0.03230929858177125, "phrase": "domain_experts"}, {"score": 0.01553640871822332, "phrase": "enterprise_search"}, {"score": 0.009039818254968426, "phrase": "relevance_assessments"}, {"score": 0.00481495049065317, "phrase": "experts'_mediation"}, {"score": 0.004646654984830476, "phrase": "enterprise_information_retrieval_system"}, {"score": 0.004484215355348556, "phrase": "search_engine"}, {"score": 0.003753022329975749, "phrase": "user_involvement"}, {"score": 0.0035931556794840027, "phrase": "service_providers"}, {"score": 0.003140680985599885, "phrase": "case_study"}, {"score": 0.0030913302090179967, "phrase": "potential_impact"}, {"score": 0.0030187498405804315, "phrase": "enhanced_mediated_search_results"}, {"score": 0.002867268370615848, "phrase": "improved_information_retrieval_system"}, {"score": 0.002701877448139625, "phrase": "original_search_results"}, {"score": 0.002627985415362773, "phrase": "ranked_lists"}, {"score": 0.002556109032208553, "phrase": "substantial_return"}, {"score": 0.0025059724686541263, "phrase": "higher_search_success_rate"}, {"score": 0.0023520340492933383, "phrase": "effectiveness_analysis"}, {"score": 0.0022162970216404927, "phrase": "user_preference_surveys"}, {"score": 0.0021814396743238176, "phrase": "modeling_costs"}, {"score": 0.0021301766910531137, "phrase": "useful_insights"}], "paper_keywords": [""], "paper_abstract": "The success of an enterprise information retrieval system is determined by interactions among three key entities: the search engine employed; the service provider who delivers, modifies, and maintains the engine; and the users of the service within the organization. Evaluations of an enterprise search have predominately focused on the effectiveness and efficiency of the engine, with very little analysis of user involvement in the process, and none on the role of service providers. We propose and evaluate a model of costs and benefits to a service provider when investing in enhancements to the ranking of documents returned by their search engine. We demonstrate the model through a case study to analyze the potential impact of using domain experts to provide enhanced mediated search results. By demonstrating how to quantify the cost and benefit of an improved information retrieval system to the service provider, our case study shows that using the relevance assessments of domain experts to rerank original search results can significantly improve the accuracy of ranked lists. Moreover, the service provider gains substantial return on investment and a higher search success rate by investing in the relevance assessments of domain experts. Our cost and benefit analysis results are contrasted with standard modes of effectiveness analysis, including quantitative (using measures such as precision) and qualitative (through user preference surveys) approaches. Modeling costs and benefits explicitly can provide useful insights that the other approaches do not convey.", "paper_title": "Cost and Benefit Estimation of Experts' Mediation in an Enterprise Search", "paper_id": "WOS:000335580800012"}