{"auto_keywords": [{"score": 0.03104244392514206, "phrase": "proposed_protocols"}, {"score": 0.015719716506582538, "phrase": "wireless_sensor_networks"}, {"score": 0.004556901872357751, "phrase": "external_clock_synchronisation"}, {"score": 0.0036553070575015344, "phrase": "wics"}, {"score": 0.003334309053314909, "phrase": "reference_node"}, {"score": 0.003078933621670921, "phrase": "wecs"}, {"score": 0.0028958411976400646, "phrase": "maximum_synchronisation_error"}, {"score": 0.002723607240517261, "phrase": "extensive_simulation_studies"}, {"score": 0.00257735013358606, "phrase": "castalia_simulator"}, {"score": 0.0025459275963373496, "phrase": "simulation_results"}, {"score": 0.0022797772939670063, "phrase": "synchronisation_accuracy"}, {"score": 0.0022382002476510573, "phrase": "prototype_implementation"}, {"score": 0.002197379785587054, "phrase": "wics_protocol"}], "paper_keywords": ["wireless sensor networks", " internal clock synchronisation", " external clock synchronisation", " weighted averaging technique"], "paper_abstract": "Wireless Sensor Networks (WSNs) have many application scenarios where external clock synchronisation may be required because a WSN may consist of components which are not connected to each other. In this paper, we first propose a novel weighted average-based internal clock synchronisation (WICS) protocol, which synchronises all the clocks of a WSN with the clock of a reference node periodically. Based on this protocol, we then propose our weighted average-based external clock synchronisation (WECS) protocol. We have analysed the proposed protocols for maximum synchronisation error and shown that it is always upper bounded. Extensive simulation studies of the proposed protocols have been carried out using Castalia simulator. Simulation results validate our above theoretical claim and also show that the proposed protocols perform better in comparison to other protocols in terms of synchronisation accuracy. A prototype implementation of the WICS protocol using a few TelosB motes also validates the above conclusions.", "paper_title": "A weighted average-based external clock synchronisation protocol for wireless sensor networks", "paper_id": "WOS:000310566000004"}