{"auto_keywords": [{"score": 0.04117275374122391, "phrase": "security_failures"}, {"score": 0.00481495049065317, "phrase": "highly_secure_systems"}, {"score": 0.004569905085027681, "phrase": "reliability_engineering"}, {"score": 0.004462663711734448, "phrase": "software_products"}, {"score": 0.004215397034321004, "phrase": "security_share"}, {"score": 0.003962899903266524, "phrase": "product_development"}, {"score": 0.0038515000499988673, "phrase": "product_dependability"}, {"score": 0.0035022161192936234, "phrase": "great_deal"}, {"score": 0.003436242862104006, "phrase": "international_telecommunication_union"}, {"score": 0.0034037221513153566, "phrase": "telecommunications_standardization_sector"}, {"score": 0.002965229277927781, "phrase": "authorized_access"}, {"score": 0.002937153116494391, "phrase": "network_elements"}, {"score": 0.002909342017421165, "phrase": "stored_information"}, {"score": 0.0025586128304269616, "phrase": "reliability_engineers"}, {"score": 0.0023485549678832628, "phrase": "communications_domain"}, {"score": 0.0021659920594094407, "phrase": "common_techniques"}, {"score": 0.0021049980887993046, "phrase": "alcatel-lucent"}], "paper_keywords": [""], "paper_abstract": "Design of highly secure systems is increasingly important. This paper explores the relationship between reliability engineering and security engineering for software products. Our work has indicated that designing for reliability and designing for security share many common ideas and, more importantly, techniques that can be leveraged in product development. Security failures are one aspect of product dependability, and while security failures are qualitatively different from other reliability failures in some ways, the two classes of failures have a great deal in common. International Telecommunication Union, Telecommunications Standardization Sector (ITU-T) Recommendation X.805 suggests that availability has a specific meaning for security, namely, that it \"ensures that there is no denial of authorized access to network elements, stored information, information flows, services and applications due to events impacting the network. \"This definition is very similar to the definition of availability that reliability engineers use in describing functionality. This paper explores the similarities and differences in approaches taken within the communications domain for reliability and security. The three areas that are discussed are terminology, requirements, and common techniques. (C) 2007 Alcatel-Lucent.", "paper_title": "Comparing reliability and security: concepts, requirements, and techniques", "paper_id": "WOS:000250961000006"}