{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "search_results"}, {"score": 0.04411287777932204, "phrase": "retrieved_information"}, {"score": 0.03369594687840481, "phrase": "prototype_system"}, {"score": 0.004553725265085244, "phrase": "novel_concept"}, {"score": 0.004475022550508119, "phrase": "search_result_interfaces"}, {"score": 0.004443921948822114, "phrase": "hierarchical_query-driven_information_retrieval_systems"}, {"score": 0.004087084193780308, "phrase": "granular_hierarchy"}, {"score": 0.0037066895459425824, "phrase": "relevance_judgment_behavior"}, {"score": 0.003629882559085245, "phrase": "highly_motivated_information_users"}, {"score": 0.0033381913087533457, "phrase": "careful_regard"}, {"score": 0.003280427617955518, "phrase": "engineers'_relevance_judgment_behavior"}, {"score": 0.003027286031578399, "phrase": "relevant_information"}, {"score": 0.002862767868795934, "phrase": "user_study"}, {"score": 0.0027356847952125433, "phrase": "satisfaction_questionnaire"}, {"score": 0.0024634797027967203, "phrase": "novel_findings"}, {"score": 0.002387214876538434, "phrase": "user_relevance_judgment_behavior"}, {"score": 0.00217987162651941, "phrase": "simulated_tasks"}, {"score": 0.0021496083700137305, "phrase": "real_ones"}], "paper_keywords": [""], "paper_abstract": "Granularity is a novel concept for presenting information in search result interfaces of hierarchical query-driven information retrieval systems in a manner that can support understanding and exploration of the context of the retrieved information (e.g., by highlighting its position in the granular hierarchy and exposing its relationship with relatives in the hierarchy). Little research, however, has been conducted on the effects of granularity of search results on the relevance judgment behavior of engineers. Engineers are highly motivated information users who are particularly interested in understanding the context of the retrieved information. Therefore, it is hypothesized that the design of systems with careful regard for granularity would improve engineers' relevance judgment behavior. To test this hypothesis, a prototype system was developed and evaluated in terms of the time needed for users to find relevant information, the accuracy of their relevance judgment, and their subjective satisfaction. To evaluate the prototype, a user study was conducted where participants were asked to complete tasks, complete a satisfaction questionnaire, and be interviewed. The findings showed that participants performed better and were more satisfied when the prototype system presented only relevant information in context. Although this study presents some novel findings about the effects of granularity and context on user relevance judgment behavior, the results should be interpreted with caution. For example, participants in this research were recruited by convenience and performed a set of simulated tasks as opposed to real ones. However, suggestions for further research are presented.", "paper_title": "Effects of Granularity of Search Results on the Relevance Judgment Behavior of Engineers: Building Systems for Retrieval and Understanding of Context", "paper_id": "WOS:000274926000002"}