{"auto_keywords": [{"score": 0.04825016108360528, "phrase": "medical_devices"}, {"score": 0.030216600726220566, "phrase": "proposed_method"}, {"score": 0.00481495049065317, "phrase": "u-healthcare_environments"}, {"score": 0.004752873752686246, "phrase": "healthcare_industry"}, {"score": 0.004671342094877447, "phrase": "large_number"}, {"score": 0.004454237726525018, "phrase": "considerable_amount"}, {"score": 0.003962998498942108, "phrase": "medical_device_failures"}, {"score": 0.003634262647873338, "phrase": "failure_cause_identification"}, {"score": 0.0035564156572789473, "phrase": "failure_data"}, {"score": 0.003510507340837656, "phrase": "existing_database"}, {"score": 0.003450213580299164, "phrase": "similar_failures"}, {"score": 0.003029722317983915, "phrase": "weibull_distribution_parameters"}, {"score": 0.0029519664912853938, "phrase": "device's_previous_failure_dates"}, {"score": 0.0025696647013416863, "phrase": "medical_device_users"}, {"score": 0.002335889180060105, "phrase": "predicted_time"}, {"score": 0.0022174469839432013, "phrase": "device_parts"}, {"score": 0.0021049977753042253, "phrase": "decreased_inventory_costs"}], "paper_keywords": ["Ubiquitous", " u-Healthcare", " Fault analysis", " Fault period prediction"], "paper_abstract": "The healthcare industry depends on a large number of medical devices to perform many of its functions, so a considerable amount of effort is spent to deal with failures occurred in medical devices. This paper proposes a method that generates knowledge used to identify the causes of medical device failures and to predict the times-to-failure (i.e., a period during which a medical device operates without failure). To generate knowledge for failure cause identification, morphemes of the failure data in the existing database are analyzed and similar failures (symptoms and causes) are grouped based on the similarity of symptoms. To generate knowledge for the prediction of the times-to-failure, the Weibull distribution parameters are estimated based on a device's previous failure dates. The experiment results show that the proposed method has 69 % accuracy in identifying the cause of failure and 83 % accuracy in predicting the times-to-failure. The proposed method enables medical device users to quickly identify the cause of failure when their devices have problems, thereby reducing the cost of failure. With the predicted time to failure, it is possible to have devices (or device parts) ready just in time for replacement. This leads to decreased inventory costs.", "paper_title": "Generating knowledge for the identification of device failure causes and the prediction of the times-to-failure in u-Healthcare environments", "paper_id": "WOS:000324878400009"}