{"auto_keywords": [{"score": 0.03747040019398316, "phrase": "improved_bang-bang_phase_detector"}, {"score": 0.02904417544624169, "phrase": "pll"}, {"score": 0.01838742840464559, "phrase": "two-xor_phase_detector"}, {"score": 0.013845696427825616, "phrase": "hybrid_phase_detector"}, {"score": 0.01035455510589247, "phrase": "phase-locked_loops"}, {"score": 0.00481495049065317, "phrase": "reduced_lock_time"}, {"score": 0.0045599093158915326, "phrase": "new_hybrid_phase_detector"}, {"score": 0.004339744430169516, "phrase": "two-xor_linear_phase_detectors"}, {"score": 0.004009288598277725, "phrase": "proposed_hybrid_phase_detector"}, {"score": 0.00395017798595193, "phrase": "intrinsic_advantage"}, {"score": 0.0038919354605673104, "phrase": "low_timing_jitter"}, {"score": 0.003455765987713262, "phrase": "proposed_phase_detector"}, {"score": 0.0032887360307856635, "phrase": "identical_loop_components"}, {"score": 0.0032563083791198534, "phrase": "phase_detectors"}, {"score": 0.003145305140705718, "phrase": "spectre"}, {"score": 0.003114283314285167, "phrase": "cadence_design_systems"}, {"score": 0.002993231973906559, "phrase": "high-order_effects"}, {"score": 0.0029344771385297137, "phrase": "simulation_results"}, {"score": 0.002579622880371082, "phrase": "control_voltage"}, {"score": 0.0021049977753042253, "phrase": "timing_jitter"}], "paper_keywords": ["CMOS circuits", " phase-locked loops", " bang-bang phase detectors", " linear phase detectors"], "paper_abstract": "This paper presents a new hybrid phase detector called hybrid phase detector that possesses the characteristics of two-XOR linear phase detectors and improved bang-bang binary phase detectors. Phase-locked loops (PLLs) with the proposed hybrid phase detector possess the intrinsic advantage of the low timing jitter of PLLs with a two-XOR phase detector in lock states and the fast locking process of PLLs with an improved bang-bang phase detector. The effectiveness of the proposed phase detector is quantified by comparing the performance of three PLLs with identical loop components except phase detectors implemented in UMC-0.13 mu m 1.2 V CMOS technology and analyzed using Spectre from Cadence Design Systems with BSIM3V3 devices models that account for both the parasitics and high-order effects of devices. Simulation results demonstrate that PLLs with the hybrid phase detector has the same lock time as that of the PLL with an improved bang-bang phase detector. The amplitude of the fluctuation of the control voltage of the PLL with the hybrid phase detector is the same as that of the PLL with an improved bang-bang phase detector in the transient region and the same as that of the PLL with a two-XOR phase detector when the lock state is established. The timing jitter of the PLL with the hybrid phase detector is the same as that of the PLL with the two-XOR phase detector in the lock state and is much lower as compared with that of the PLL with the improved bang-bang phase detector.", "paper_title": "A new hybrid phase detector for reduced lock time and timing jitter of phase-locked loops", "paper_id": "WOS:000257440000008"}