{"auto_keywords": [{"score": 0.04916104605092019, "phrase": "immersed_boundary_method"}, {"score": 0.006551624973238008, "phrase": "unconditionally_stable_discretization"}, {"score": 0.005364803552503614, "phrase": "explicit_scheme"}, {"score": 0.00481495049065317, "phrase": "elastic_force"}, {"score": 0.0042591158963728665, "phrase": "fluid_structure_interaction"}, {"score": 0.003865826699096508, "phrase": "severe_timestep_stability_restriction"}, {"score": 0.003767203575060969, "phrase": "explicit_time"}, {"score": 0.003331915219811852, "phrase": "two-dimensional_stokes_flow"}, {"score": 0.0031435968684569112, "phrase": "unconditionally_stable_semi-implicit_discretization"}, {"score": 0.0029089095588612007, "phrase": "building_block"}, {"score": 0.0026743419827100225, "phrase": "small_scale_decomposition"}, {"score": 0.002555950807368337, "phrase": "extensive_numerical_experiments"}, {"score": 0.0021883400011393564, "phrase": "spectral_space"}, {"score": 0.002132420504803564, "phrase": "computational_cost"}], "paper_keywords": ["Incompressible flow", " Stokes equations", " Immersed boundary method", " Removing the stiffness"], "paper_abstract": "The immersed boundary method hits evolved into one of the most useful computational methods in Studying fluid structure interaction. On the other hand, the immersed boundary method is also known to suffer from a severe timestep stability restriction when using an explicit time discretization. In this paper, we propose several efficient semi-implicit schemes to remove this stiffness from the immersed boundary method for the two-dimensional Stokes flow. First, we obtain a [love] unconditionally stable semi-implicit discretization for the immersed boundary problem. Using this unconditionally stable discretization as a building block, we derive several efficient semi-implicit schemes for the immersed boundary problem by applying the small scale decomposition to this unconditionally stable discretization. Our stability analysis and extensive numerical experiments show that our semi-implicit schemes offer much better stability property than the explicit scheme. Unlike other implicit or semi-irnplicit schemes proposed in the literature, our semi-implicit schemes can be solved explicitly in the spectral space. Thus the computational cost of our semi-irnplicit schemes is comparable to that of an explicit scheme, but with a much better stability property. (C) 2008 Elsevier Inc. All rights reserved.", "paper_title": "Removing the stiffness of elastic force from the immersed boundary method for the 2D Stokes equations", "paper_id": "WOS:000260353900009"}