{"auto_keywords": [{"score": 0.04852232688729349, "phrase": "parallel_scientific_applications"}, {"score": 0.047692941000962795, "phrase": "global_data_management"}, {"score": 0.04425219039528798, "phrase": "portable_parallel_codes"}, {"score": 0.0421318407050913, "phrase": "particular_computing_platform"}, {"score": 0.03751951230806167, "phrase": "distributed_program"}, {"score": 0.03719385105531014, "phrase": "test_data"}, {"score": 0.00481495049065317, "phrase": "distributed_data"}, {"score": 0.004427621604673082, "phrase": "ca"}, {"score": 0.003974657661486137, "phrase": "program"}, {"score": 0.00393675895773741, "phrase": "ppidd_catalogue"}, {"score": 0.003901407184706592, "phrase": "aeef-v"}, {"score": 0.00377446822050123, "phrase": "cpc_program_library"}, {"score": 0.003751834457361072, "phrase": "queen's_university"}, {"score": 0.003729336464990299, "phrase": "belfast"}, {"score": 0.0037069717781636194, "phrase": "n._ireland"}, {"score": 0.003662643573658492, "phrase": "standard_cpc"}, {"score": 0.0032474961268782175, "phrase": "fortran"}, {"score": 0.0031701655096648784, "phrase": "operating_system"}, {"score": 0.0030213092398172605, "phrase": "ram"}, {"score": 0.0029760569123789458, "phrase": "external"}, {"score": 0.0027354763093906547, "phrase": "required_one-sided_remote_memory_access"}, {"score": 0.002492011117018641, "phrase": "ga"}, {"score": 0.0021693692831601745, "phrase": "tile_distribution"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["MPI", " Parallel"], "paper_abstract": "The Parallel Programming Interface for Distributed Data (PPIDD) library provides an interface, suitable for use in parallel scientific applications, that delivers communications and global data management. The library can be built either using the Global Arrays (CA) toolkit, or a standard MPI-2 library. This abstraction allows the programmer to write portable parallel codes that can utilise the best, or only, communications library that is available on a particular computing platform. Program summary Program title: PPIDD Catalogue identifier: AEEF-v I _0 Program summary URL: littp://cpc.cs.qub.ac.uk/summaries/AEEF-1-O.Iltilil Program obtainable from: CPC Program Library, Queen's University, Belfast, N. Ireland Licensing provisions: Standard CPC licence, http://cpc.cs.qub.ac.uk/licence/licence.htnil No. of lines in distributed program. including test data, etc.: 17 698 No. of bytes in distributed program, including test data, etc.: 166 173 Distribution format: tar.gz Programming language: Fortran, C Computer: Many parallel systems Operating system: Various Has the code been vectorised or parallelized?: Yes. 2-256 processors used RAM: 50 Mbytes Classification: 6.5 External routines: Global Arrays or MPI-2 Nature of problem: Many scientific applications require management and communication of data that is global, and tile standard MPI-2 protocol provides only low-level methods for the required one-sided remote memory access. Solution method: The Parallel Programming Interface for Distributed Data (PPIDD) library provides an interface, suitable for use in parallel scientific applications, that delivers communications and global data management. The library can be built either using the Global Arrays (GA) toolkit, or a standard MPI-2 library. This abstraction allows the programmer to write portable parallel codes that can utilise the best, or only, communications library that is available on a particular computing platform. Running time: Problem dependent. The test provided with tile distribution takes only a few seconds to run. (C) 2009 Elsevier B.V. All rights reserved.", "paper_title": "Parallel programming interface for distributed data", "paper_id": "WOS:000273011500022"}