{"auto_keywords": [{"score": 0.03434389783337282, "phrase": "social_presence"}, {"score": 0.00481495049065317, "phrase": "humanness"}, {"score": 0.004646496622257368, "phrase": "information_systems"}, {"score": 0.004452078350485375, "phrase": "trust_technology"}, {"score": 0.0044047527104545525, "phrase": "current_trust"}, {"score": 0.004373480870285314, "phrase": "technology_literature"}, {"score": 0.0042809854543795255, "phrase": "technology_constructs"}, {"score": 0.003569451476205552, "phrase": "important_dependent_variables"}, {"score": 0.003218764138744059, "phrase": "affordance_theories"}, {"score": 0.003150612723641925, "phrase": "research_problem"}, {"score": 0.0023015232625177755, "phrase": "stronger_effects"}, {"score": 0.0022851491693940272, "phrase": "selected_outcome_variables"}, {"score": 0.0022527488455744656, "phrase": "misaligned_trust"}, {"score": 0.0021049977753042253, "phrase": "social_affordances"}], "paper_keywords": ["Trust in Technology", " Social Presence Theory", " Social Response Theory", " Human-like Trust", " System-Like Trust", " Affordance Theory"], "paper_abstract": "Information systems (IS) research has demonstrated that humans can and do trust technology. The current trust in technology literature employs two different types of trust in technology constructs. Some researchers use human-like trust constructs (e.g., benevolence, integrity, and ability), while other researchers use system-like trust constructs (e.g., helpfulness, reliability, and functionality). Interestingly, past research shows that both sets of measures influence important dependent variables, but the literature does not explain when one type should be used instead of the other type. In this paper, we use trust, social presence, and affordance theories to shed light on this research problem. We report on two studies. In study 1, we argue first that technologies vary in their perceived \"humanness\". Second, we argue that, because users perceive two technologies to differ in humanness, they will develop trust in each technology differently (i.e., along more human-like criteria or more system-like criteria). We study two technologies that vary in humanness to explore these differences theoretically and empirically. We demonstrate that, when the trust construct used aligns well with how human the technology is, it produces stronger effects on selected outcome variables than does a misaligned trust construct. In study 2, we assess whether these technologies differ in humanness based on social presence, social affordances, and affordances for sociality. We find that these factors do distinguish whether technology is more human-like or system-like. We provide implications for trust-in-technology research.", "paper_title": "Technology, Humanness, and Trust: Rethinking Trust in Technology", "paper_id": "WOS:000367680300002"}