{"auto_keywords": [{"score": 0.036373476718083594, "phrase": "fault-tolerant_granularity"}, {"score": 0.010196031643453082, "phrase": "xy"}, {"score": 0.0060074350890914185, "phrase": "experimental_results"}, {"score": 0.00481495049065317, "phrase": "hierarchical_fault-tolerant_routing_algorithm"}, {"score": 0.004782718554230406, "phrase": "fxy"}, {"score": 0.004703075081891693, "phrase": "hybrid_method"}, {"score": 0.004517275498868226, "phrase": "fault_tolerance"}, {"score": 0.004382737590042589, "phrase": "different_equal_size"}, {"score": 0.004237925318473508, "phrase": "first_level"}, {"score": 0.004167315942319306, "phrase": "packet_routing"}, {"score": 0.003922685601503529, "phrase": "effective_boundary"}, {"score": 0.0038573081851680656, "phrase": "xy_routing"}, {"score": 0.0036676174658755683, "phrase": "neighbor_submesh"}, {"score": 0.002957327365538023, "phrase": "xy_method"}, {"score": 0.002840298440413678, "phrase": "best_performance"}, {"score": 0.0026554236621262515, "phrase": "fault-tolerant_routing_algorithm"}, {"score": 0.0025675372701474035, "phrase": "better_fault-tolerance"}, {"score": 0.0025503112711036994, "phrase": "performance_trade-offs"}, {"score": 0.0023842666006371267, "phrase": "least_performance"}, {"score": 0.0023603078194781965, "phrase": "best_fault_tolerance"}, {"score": 0.0022215160785078797, "phrase": "proposed_method"}, {"score": 0.0021624739899833868, "phrase": "best_trade-off"}], "paper_keywords": ["Networks-on-chip", " routing algorithm", " fault tolerant routing", " performance analysis"], "paper_abstract": "This paper presents a hierarchical fault-tolerant routing algorithm called FXY, which is a hybrid method based on flooding and XY, and can balance performance and fault tolerance based on a predefined parameter m. First, FXY partitions the whole network into different equal size square submeshes with the size of m x m. At the first level of the hierarchy, packet routing within these submeshes is performed based on flooding routing algorithm. When the packets are received at effective boundary of each submesh, XY routing is performed to route the packet inter submeshes i.e., from one submesh to the neighbor submesh which is certainly one of its neighbor nodes. Here, the size of the submesh is defined as fault-tolerant granularity. As fault-tolerant granularity is increased, the size of the submeshes will be increased, therefore the method mainly floods packets in large-size submeshes and finally packets are received at their destinations correctly. On the other hand, when fault-tolerant granularity is decreased, the method mainly routes packets as XY method, which is not fault-tolerant, but has the best performance. The method is evaluated for various packet injection rates and fault rates. The experimental results reveal that the method presents a fault-tolerant routing algorithm, and can be adjusted so that it shows better fault-tolerance and performance trade-offs compared to XY and flooding which are two end-to-end cases of having the best performance and no fault-tolerance, having the least performance and the best fault tolerance, respectively. The experimental results for an 8 x 8 NoC size, have shown that 2-FXY, which is the proposed method with fault-tolerant granularity of two, offers the best trade-off between performance and fault tolerance compared to other methods, XY, flooding and probabilistic flooding.", "paper_title": "FXY: A HIERARCHICAL ROUTING ALGORITHM TO BALANCE PERFORMANCE AND FAULT TOLERANCE IN NETWORKS-ON-CHIP", "paper_id": "WOS:000343989700012"}