{"auto_keywords": [{"score": 0.047244318311945976, "phrase": "lbs"}, {"score": 0.00481495049065317, "phrase": "web-based_lbs_framework"}, {"score": 0.004561019117546361, "phrase": "location_based_services"}, {"score": 0.004424087591260246, "phrase": "different_constraints"}, {"score": 0.0043793594257092805, "phrase": "poor_usability"}, {"score": 0.004320421465896323, "phrase": "positioning_support"}, {"score": 0.004247858437831649, "phrase": "integration_difficulties"}, {"score": 0.004078620439629185, "phrase": "existing_and_new_technologies"}, {"score": 0.003929391999210588, "phrase": "end-user_acceptance"}, {"score": 0.003850299959557491, "phrase": "usability_constraints"}, {"score": 0.0037346256869699975, "phrase": "user_characteristics"}, {"score": 0.0036347141744359442, "phrase": "captured_user_context"}, {"score": 0.0035615322947497013, "phrase": "prototype_lbs_system"}, {"score": 0.0034311578789991363, "phrase": "framework_design"}, {"score": 0.003006087482938274, "phrase": "proposed_combination"}, {"score": 0.0027336881691956186, "phrase": "user_monitoring_component"}, {"score": 0.0025198864435531055, "phrase": "significant_relationships"}, {"score": 0.00222249726328354, "phrase": "computer_proficiency"}, {"score": 0.002185092297972985, "phrase": "user-interaction_data"}, {"score": 0.002162951519368368, "phrase": "user_model"}, {"score": 0.0021049977753042253, "phrase": "adaptive_user-specific_customisations"}], "paper_keywords": ["LBS", " positioning", " usability", " adaptivity", " user modelling", " user monitoring"], "paper_abstract": "This research investigates barriers that prevent Location Based Services (LBS) from reaching its full potential. The different constraints, including poor usability, lack of positioning support, costs, and integration difficulties are highlighted. A framework was designed incorporating components based on existing and new technologies that could help address the constraints of LBS and increase end-user acceptance. This research proposes that usability constraints can be addressed by adapting a system to user characteristics which are inferred on the basis of captured user context and interaction data. A prototype LBS system was developed to prove the feasibility and benefit of the framework design, demonstrating that constraints of positioning, cost, and integration can be overcome. Volunteers were asked to use the system, and to answer questions in relation to their proficiency and experience. User-feedback showed that the proposed combination of functionality was well-received, and the prototype was appealing to many users. Ground-truths from the survey were related back to data captured with a user monitoring component in order to investigate whether users can be classified according to their context and how they interact. The results have shown that statistically significant relationships exist, and that by using the C4.5 decision-tree, computer proficiency can be estimated within one class-width in 76.7% of the cases. These results suggest that it may be possible to build a user-model to estimate computer proficiency on the basis of user-interaction data. The user model could then used to improve usability through adaptive user-specific customisations.", "paper_title": "Design of a Web-Based LBS Framework Addressing Usability, Cost, and Implementation Constraints", "paper_id": "WOS:000281394200001"}