{"auto_keywords": [{"score": 0.05007803266043919, "phrase": "agent-based_modelling"}, {"score": 0.0490923086187219, "phrase": "abm"}, {"score": 0.00478163886605204, "phrase": "geo-spatial_simulation"}, {"score": 0.004634552430216732, "phrase": "dominant_paradigm"}, {"score": 0.004602483094756597, "phrase": "social_simulation"}, {"score": 0.0044608829094248985, "phrase": "complex_systems"}, {"score": 0.004205143879089321, "phrase": "heterogeneous_objects"}, {"score": 0.003922907208353323, "phrase": "emergent_order"}, {"score": 0.00386876598761639, "phrase": "higher_levels"}, {"score": 0.0033549790559972053, "phrase": "seven_challenges"}, {"score": 0.0030971473486283664, "phrase": "independent_theory"}, {"score": 0.0028293966058473476, "phrase": "model_dynamics"}, {"score": 0.002770961604021066, "phrase": "agent_interactions"}, {"score": 0.002461852774571558, "phrase": "pedestrian_model"}, {"score": 0.0024447807655923926, "phrase": "emergency_evacuation"}, {"score": 0.002427826856342292, "phrase": "central_london"}, {"score": 0.0023776656246300063, "phrase": "residential_segregation_model"}, {"score": 0.0023529740798601015, "phrase": "london_data"}, {"score": 0.0022567398334877847, "phrase": "greater_london"}, {"score": 0.002202427244004817, "phrase": "new_style"}, {"score": 0.002119702106867801, "phrase": "relative_arbitrariness"}], "paper_keywords": ["Agent-based modelling (ABM)", " Theory", " Validation", " Pedestrian models", " Residential segregation", " Land use models"], "paper_abstract": "Agent-based modelling (ABM) is becoming the dominant paradigm in social simulation due primarily to a worldview that suggests that complex systems emerge from the bottom-up, are highly decentralised, and are composed of a multitude of heterogeneous objects called agents. These agents act with some purpose and their interaction, usually through time and space, generates emergent order, often at higher levels than those at which such agents operate. ABM however raises as many challenges as it seeks to resolve. It is the purpose of this paper to catalogue these challenges and to illustrate them using three somewhat different agent-based models applied to city systems. The seven challenges we pose involve: the purpose for which the model is built, the extent to which the model is rooted in independent theory, the extent to which the model can be replicated, the ways the model might be verified, calibrated and validated, the way model dynamics are represented in terms of agent interactions, the extent to which the model is operational, and the way the model can be communicated and shared with others. Once catalogued, we then illustrate these challenges with a pedestrian model for emergency evacuation in central London, a hypothetical model of residential segregation model tuned to London data, and an agent-based residential location model, for Greater London. The ambiguities posed by this new style of modelling are drawn out as conclusions, and the relative arbitrariness of such modelling highlighted. (C) 2008 Elsevier Ltd. All rights reserved.", "paper_title": "Key challenges in agent-based modelling for geo-spatial simulation", "paper_id": "WOS:000261868300002"}