{"auto_keywords": [{"score": 0.05007852962010534, "phrase": "weighted_networks"}, {"score": 0.005825526815066125, "phrase": "new_centrality_measure"}, {"score": 0.005646215154463426, "phrase": "laplacian_energy"}, {"score": 0.004681226806682058, "phrase": "key_issue"}, {"score": 0.004652016085325825, "phrase": "network_analysis"}, {"score": 0.004608539830653038, "phrase": "unweighted_networks"}, {"score": 0.004395965695932984, "phrase": "laplacian_centrality"}, {"score": 0.0042085753823566125, "phrase": "subgraph_centrality"}, {"score": 0.004130243047687995, "phrase": "growing_need"}, {"score": 0.0040916230716372265, "phrase": "centrality_measures"}, {"score": 0.003928383344128392, "phrase": "network_measures"}, {"score": 0.003807242767474929, "phrase": "vertex_centrality"}, {"score": 0.0035874251285502104, "phrase": "laplacian"}, {"score": 0.0033169383771576343, "phrase": "laplacian_matrix"}, {"score": 0.003296212583539166, "phrase": "weighted_network_g."}, {"score": 0.0032145922365231093, "phrase": "vertex_v"}, {"score": 0.0029169007179202164, "phrase": "algebraic_graph_theory_result"}, {"score": 0.0028805474861014722, "phrase": "structural_description"}, {"score": 0.00285357934700279, "phrase": "laplacian_centrality_measure"}, {"score": 0.002431797888365548, "phrase": "intermediate_measuring"}, {"score": 0.00241658945942583, "phrase": "global_and_local_characterization"}, {"score": 0.002220326414611295, "phrase": "classical_weighted_social_network_data_sets"}, {"score": 0.0021652891317252994, "phrase": "strong_evidences"}, {"score": 0.0021450029487459403, "phrase": "new_measure's_utility"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Weighted network", " Degree centrality", " Closeness centrality", " Betweenness centrality", " Laplacian energy"], "paper_abstract": "The centrality of vertices has been a key issue in network analysis. For unweighted networks where edges are just present or absent and have no weight attached, many centrality measures have been presented, such as degree, betweenness, closeness, eigenvector and subgraph centrality. There has been a growing need to design centrality measures for weighted networks, because weighted networks where edges are attached weights would contain rich information. Some network measures have been proposed for weighted networks, including three common measures of vertex centrality: degree, closeness, and betweenness. In this paper, we propose a new centrality measure called the Laplacian centrality measure for weighted networks. The Laplacian energy is defined as E-L(G) = Sigma(i)lambda(2)(i), where lambda(i)'s are eigenvalues of the Laplacian matrix of weighted network G. The importance (centrality) of a vertex v is reflected by the drop of the Laplacian energy of the network to respond to the deactivation (deletion) of the vertex from the network. We also prove an algebraic graph theory result that provides a structural description of the Laplacian centrality measure which is in terms of the number of all kinds of 2-walks. Laplacian centrality unveils more structural information about connectivity and density around v (further than its immediate neighborhood). That is, comparing with other standard centrality measures proposed for weighted networks (e.g. degree, closeness or betweenness centrality), Laplacian centrality is an intermediate measuring between global and local characterization of the importance (centrality) of a vertex. We further investigate the validness and robustness of this new centrality measure by illustrating this method to some classical weighted social network data sets and obtain reliable results, which provide strong evidences of the new measure's utility. (C) 2012 Elsevier Inc. All rights reserved.", "paper_title": "Laplacian centrality: A new centrality measure for weighted networks", "paper_id": "WOS:000303092700014"}