{"auto_keywords": [{"score": 0.04833626901461283, "phrase": "collocated_photo_sharing"}, {"score": 0.04731914853578618, "phrase": "paper_photographs"}, {"score": 0.032390726623099504, "phrase": "photo_sharing"}, {"score": 0.026266389228131463, "phrase": "bluetooth"}, {"score": 0.00481495049065317, "phrase": "kodak"}, {"score": 0.004761732436126133, "phrase": "flickr_generations"}, {"score": 0.004372712391262538, "phrase": "key_social_practices"}, {"score": 0.004229249483672165, "phrase": "'kodak_generation"}, {"score": 0.004120915812750583, "phrase": "digital_photographs"}, {"score": 0.003912469968653304, "phrase": "'flickr_generation"}, {"score": 0.003360527337581911, "phrase": "familiar_aspects"}, {"score": 0.0032261342460565457, "phrase": "novel_interaction_technique"}, {"score": 0.003120171161064748, "phrase": "current_communication_technology"}, {"score": 0.0028331500847209984, "phrase": "spatial_regions"}, {"score": 0.0028121943702224326, "phrase": "mobile_devices"}, {"score": 0.002543967677678384, "phrase": "current_technology"}, {"score": 0.002388337333984138, "phrase": "different_sharing_techniques"}, {"score": 0.002370663905320869, "phrase": "social_practice"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Photo sharing", " Collocated groups", " Mobile phone", " Visuospatial interaction"], "paper_abstract": "Passing around stacks of paper photographs while sitting around a table is one of the key social practices defining what is commonly referred to as the 'Kodak Generation'. Due to the way digital photographs are stored and handled, this practice does not translate well to the 'Flickr Generation, where collocated photo sharing often involves the (wireless) transmission of a photo from one mobile device to another. In order to facilitate 'cross-generation' sharing without enforcing either practice, it is desirable to bridge this gap in a way that incorporates familiar aspects of both. In this paper, we discuss a novel interaction technique that addresses some of the constraints introduced by current communication technology, and that enables photo sharing in a way, which resembles the passing of stacks of paper photographs. This technique is based oil dynamically generated spatial regions around mobile devices and has been evaluated through two user studies. The results we obtained indicate that our technique is easy to learn and as fast, or faster than, current technology such as transmitting photos between devices using Bluetooth. In addition, we found evidence of different sharing techniques influencing social practice around photo sharing. The use of our technique resulted in a more inclusive and group-oriented behavior in contrast to Bluetooth photo sharing, which resulted in a more fractured setting composed of sub-groups. (C) 2009 Elsevier Ltd. All rights reserved.", "paper_title": "Bridging the gap between the Kodak and the Flickr generations: A novel interaction technique for collocated photo sharing", "paper_id": "WOS:000272111600006"}