{"auto_keywords": [{"score": 0.04974772154948057, "phrase": "software_engineering"}, {"score": 0.00481495049065317, "phrase": "systematic_literature_reviews"}, {"score": 0.004570634647887452, "phrase": "evidence-based_software_engineering"}, {"score": 0.004507594400447103, "phrase": "systematic_literature_review"}, {"score": 0.004308630865024719, "phrase": "secondary_studies"}, {"score": 0.0035468507553681034, "phrase": "software_engineering_topics"}, {"score": 0.0034736499231079083, "phrase": "published_slrs"}, {"score": 0.003240349178289032, "phrase": "conference_proceedings"}, {"score": 0.0031955979242589494, "phrase": "relevant_studies"}, {"score": 0.0028890603352364273, "phrase": "undergraduate_educational_curriculum"}, {"score": 0.0028293966058473476, "phrase": "possible_interest"}, {"score": 0.00266693888510356, "phrase": "overall_quality"}, {"score": 0.0025490131630603757, "phrase": "research_organisations"}, {"score": 0.0023942700905678735, "phrase": "software_engineering_research_community"}, {"score": 0.002320449502337321, "phrase": "research_method"}, {"score": 0.002202427244004817, "phrase": "primary_studies"}, {"score": 0.0021049977753042253, "phrase": "software_engineering_practice"}], "paper_keywords": ["Systematic reviews", " Mapping studies", " Software engineering", " Tertiary studies"], "paper_abstract": "Context: Since the introduction of evidence-based software engineering in 2004, systematic literature review (SLR) has been increasingly used as a method for conducting secondary studies in software engineering. Two tertiary studies, published in 2009 and 2010, identified and analysed 54 SLRs published in journals and conferences in the period between 1st January 2004 and 30th June 2008. Objective: In this article, our goal was to extend and update the two previous tertiary studies to cover the period between 1st July 2008 and 31st December 2009. We analysed the quality, coverage of software engineering topics, and potential impact of published SLRs for education and practice. Method: We performed automatic and manual searches for SLRs published in journals and conference proceedings, analysed the relevant studies, and compared and integrated our findings with the two previous tertiary studies. Results: We found 67 new SLRs addressing 24 software engineering topics. Among these studies, 15 were considered relevant to the undergraduate educational curriculum, and 40 appeared of possible interest to practitioners. We found that the number of SLRs in software engineering is increasing, the overall quality of the studies is improving, and the number of researchers and research organisations worldwide that are conducting SLRs is also increasing and spreading. Conclusion: Our findings suggest that the software engineering research community is starting to adopt SLRs consistently as a research method. However, the majority of the SLRs did not evaluate the quality of primary studies and fail to provide guidelines for practitioners, thus decreasing their potential impact on software engineering practice. 0 2011 Elsevier B.V. All rights reserved.", "paper_title": "Six years of systematic literature reviews in software engineering: An updated tertiary study", "paper_id": "WOS:000292950700001"}