{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "software_development_models"}, {"score": 0.011434038900654316, "phrase": "emerging_area"}, {"score": 0.004424034641288626, "phrase": "automated_quasi-systematic_review"}, {"score": 0.004259213086199962, "phrase": "main_findings"}, {"score": 0.004197460986909444, "phrase": "distinct_-_organization"}, {"score": 0.003913238988370179, "phrase": "work_addresses_reconciliation"}, {"score": 0.003890437656215174, "phrase": "plan-driven_and_agile_development"}, {"score": 0.0038005698917606837, "phrase": "microsoft"}, {"score": 0.0037784012135986, "phrase": "motorola"}, {"score": 0.0037454226387946513, "phrase": "philips"}, {"score": 0.0035534779610991115, "phrase": "open_issue"}, {"score": 0.0034109924073788215, "phrase": "early_stage"}, {"score": 0.0033911075605164804, "phrase": "research_limitations"}, {"score": 0.0033224160240327236, "phrase": "relevant_papers"}, {"score": 0.0031337020830262954, "phrase": "data_extraction"}, {"score": 0.003007997678119768, "phrase": "internal_validity"}, {"score": 0.0027877340899738314, "phrase": "scientific_community"}, {"score": 0.0027633772255013164, "phrase": "software_development_processes"}, {"score": 0.0027312312158843683, "phrase": "common_understanding"}, {"score": 0.00223844287825642, "phrase": "future_research"}, {"score": 0.0021994769642365714, "phrase": "important_step"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Systematic review", " Software process", " Reconciliation among development models", " Plan-driven", " Agile", " Free/open source software"], "paper_abstract": "Purpose: The purpose of this paper is to characterize reconciliation among the plan-driven, agile, and free/open source software models of software development. Design/methodology/approach: An automated quasi-systematic review identified 42 papers, which were then analyzed. Findings: The main findings are: there exist distinct - organization, group and process - levels of reconciliation; few studies deal with reconciliation among the three models of development; a significant amount of work addresses reconciliation between plan-driven and agile development; several large organizations (such as Microsoft, Motorola, and Philips) are interested in trying to combine these models; and reconciliation among software development models is still an open issue, since it is an emerging area and research on most proposals is at an early stage. Research limitations: Automated searches may not capture relevant papers in publications that are not indexed. Other data sources not amenable to execution of the protocol were not used. Data extraction was performed by only one researcher, which may increase the risk of threats to internal validity. Implications: This characterization is important for practitioners wanting to be current with the state of research. This review will also assist the scientific community working with software development processes to build a common understanding of the challenges that must be faced, and to identify areas where research is lacking. Finally, the results will be useful to software industry that is calling for solutions in this area. Originality/value: There is no other systematic review on this subject, and reconciliation among software development models is an emerging area. This study helps to identify and consolidate the work done so far and to guide future research. The conclusions are an important step towards expanding the body of knowledge in the field. (C) 2011 Elsevier Inc. All rights reserved.", "paper_title": "Reconciling software development models: A quasi-systematic review", "paper_id": "WOS:000300387900013"}