{"auto_keywords": [{"score": 0.049581014501477026, "phrase": "wireless_sensor_network"}, {"score": 0.028728229836059202, "phrase": "holes_healing_scheme"}, {"score": 0.004593591780245872, "phrase": "wireless_technologies"}, {"score": 0.004291617358806677, "phrase": "environmental_monitoring"}, {"score": 0.0040942189695983185, "phrase": "surveillance_field"}, {"score": 0.003926359151817743, "phrase": "limited_energy"}, {"score": 0.0038249462699142733, "phrase": "accidental_events"}, {"score": 0.0037456980766939836, "phrase": "coverage_holes"}, {"score": 0.003629882559085245, "phrase": "transference_path"}, {"score": 0.0034267429854665035, "phrase": "rebuild_network_topology"}, {"score": 0.0033381913087533457, "phrase": "relay_nodes"}, {"score": 0.0028828348726682965, "phrase": "dying_nodes"}, {"score": 0.0022772115643656153, "phrase": "simulated_result"}, {"score": 0.0021049977753042253, "phrase": "appropriate_parameters"}], "paper_keywords": [""], "paper_abstract": "Because of the maturation of wireless technologies, the wireless sensor network has been used in various applications, especially in the environmental monitoring. After the nodes are deployed on the surveillance field, nodes will die due to the limited energy of the node or accidental events, inducing the coverage holes and the break of the transference path. To tackle this problem, researchers had proposed the rebuild network topology, such as adding Relay nodes. However, it costs a lot to build such a system. Therefore, in this paper, we would like to propose another method to tackle the dying nodes as well as the cost. Specifically, we propose a holes healing scheme. In order to check its feasibility, we use the analysis of mathematics to acquire the value of the parameters for the holes healing scheme. With the parameters, we could use the simulated result to prove the effectiveness of the scheme. The result shows that with the appropriate parameters we could confirm and extend the lifetime of WSN to infinity.", "paper_title": "A Method to Analyze the Effectiveness of the Holes Healing Scheme in Wireless Sensor Network", "paper_id": "WOS:000314964000001"}