{"auto_keywords": [{"score": 0.03815150119219691, "phrase": "contextual_information"}, {"score": 0.00481495049065317, "phrase": "context_space_model"}, {"score": 0.004777744121315302, "phrase": "smart_surveillance_systems"}, {"score": 0.004740823885631586, "phrase": "video_surveillance_systems"}, {"score": 0.0045959609346817535, "phrase": "fastest_growing_areas"}, {"score": 0.004507667881645218, "phrase": "security_technologies"}, {"score": 0.004421063493736839, "phrase": "existing_video_surveillance_systems"}, {"score": 0.0042035670399069485, "phrase": "crime_prevention"}, {"score": 0.004090901264701185, "phrase": "human_observers"}, {"score": 0.003874512990986722, "phrase": "long_periods"}, {"score": 0.0036695284042874395, "phrase": "automatic_suspicious_behaviour_detection"}, {"score": 0.003129317057177867, "phrase": "suspicious_behaviour_detection"}, {"score": 0.002998390117435555, "phrase": "human_behaviour"}, {"score": 0.002828611294209297, "phrase": "video_feeds"}, {"score": 0.0027958237350835607, "phrase": "caviar_dataset"}, {"score": 0.0026892447164623247, "phrase": "z-block"}, {"score": 0.0026375181796029134, "phrase": "australia"}, {"score": 0.0024880904032564583, "phrase": "proposed_system"}, {"score": 0.0022141537427057363, "phrase": "critical_feedback"}, {"score": 0.002188472974132732, "phrase": "system_designers"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Suspicious behaviour", " Context", " Surveillance system", " Security"], "paper_abstract": "Video surveillance systems using Closed Circuit Television (CCTV) cameras, is one of the fastest growing areas in the field of security technologies. However, the existing video surveillance systems are still not at a stage where they can be used for crime prevention. The systems rely heavily on human observers and are therefore limited by factors such as fatigue and monitoring capabilities over long periods of time. This work attempts to address these problems by proposing an automatic suspicious behaviour detection which utilises contextual information. The utilisation of contextual information is done via three main components: a context space model, a data stream clustering algorithm, and an inference algorithm. The utilisation of contextual information is still limited in the domain of suspicious behaviour detection. Furthermore, it is nearly impossible to correctly understand human behaviour without considering the context where it is observed. This work presents experiments using video feeds taken from CAVIAR dataset and a camera mounted on one of the buildings Z-Block) at the Queensland University of Technology, Australia. From these experiments, it is shown that by exploiting contextual information, the proposed system is able to make more accurate detections, especially of those behaviours which are only suspicious in some contexts while being normal in the others. Moreover, this information gives critical feedback to the system designers to refine the system. (C) 2011 Elsevier Inc. All rights reserved.", "paper_title": "A suspicious behaviour detection using a context space model for smart surveillance systems", "paper_id": "WOS:000299365400003"}