{"auto_keywords": [{"score": 0.035620716932052585, "phrase": "infelt_step"}, {"score": 0.015582690271204938, "phrase": "step_standard"}, {"score": 0.004744437370338926, "phrase": "integrated_product_development"}, {"score": 0.004688800329641024, "phrase": "cad"}, {"score": 0.004620127083303751, "phrase": "cnc"}, {"score": 0.004539005582217309, "phrase": "integrated_data_structure"}, {"score": 0.004304144138805271, "phrase": "reliable_and_robust_information_exchange_capability"}, {"score": 0.004178935413340453, "phrase": "integrated_product_development_processes"}, {"score": 0.004069352078974872, "phrase": "outmost_importance"}, {"score": 0.003986103192038901, "phrase": "fundamental_requirements"}, {"score": 0.0039276803200112695, "phrase": "collaboration_management"}, {"score": 0.0031845067058084583, "phrase": "main_paradigms"}, {"score": 0.0031285355811105915, "phrase": "layered_structure"}, {"score": 0.0028885579903645043, "phrase": "software_package"}, {"score": 0.0028630535573013686, "phrase": "product_data"}, {"score": 0.0026986685585382347, "phrase": "infelt_step_convert_software_packages'_processed_data"}, {"score": 0.0025212306068464452, "phrase": "infelt_step_layers"}, {"score": 0.002498961351132696, "phrase": "structured_data"}, {"score": 0.002362408791114333, "phrase": "production_workflow"}, {"score": 0.0023415390666563177, "phrase": "proposed_platform"}, {"score": 0.002246553137021003, "phrase": "step_data_models"}, {"score": 0.002187530939295254, "phrase": "different_local_data_structures"}, {"score": 0.0021049977753042253, "phrase": "prototype_implementation"}], "paper_keywords": ["CAD", " CAM integration", " ISO 10303 (STEP)", " manufacturing interoperability", " manufacturing collaboration", " distributed product design and production"], "paper_abstract": "Integrated product development is comprised of CAD, process planning and CNC code generation based on an integrated data structure. To make various CAD/CAM software solutions with different internal product data structures interoperable, it is necessary to realise reliable and robust information exchange capability in a manufacturing environment. To enable interoperability amongst integrated product development processes, management of collaboration of diverse CAD/CAM software packages is of outmost importance. In this article, the fundamental requirements for achieving interoperability and collaboration management in an integrated, enterprise-wide, product development process environment are discussed. Based on these requirements, the present prominent integrated, interoperable and collaborative CAD/CAM information system platforms are comparatively reviewed. There are two main paradigms for development of such platforms - viz. neutral-file based and procedure based. The merits and limitations of each paradigm are discussed. To overcome the limitations of the current present platforms, a three-layered integrated and interoperable platform, named INFELT STEP, for collaborative and interoperable product design/development using different and diverse CAD/CAPP/CAM/CNC software is proposed. This platform conjugates the capabilities of both main paradigms to eliminate their limitations. The layered structure of INFELT STEP caters for the requirements of an integrated, interoperable and collaborative computer-based manufacturing and supports the entire range of software packages in the CAD/CAPP/CAM product development chain. In this platform, each software package can send product data based on its own internal data structures to other packages that are linked to and communicate with this platform. Different layers of INFELT STEP convert software packages' processed data to its structured data models, which are based on the STEP standard-and then store them in its database. Conversely, INFELT STEP layers can retrieve structured data stored in its database and convert them to the format acceptable by a specific CAD/CAM/CAPP software package that is cooperating in a production workflow. This proposed platform manages the collaboration of CAD/CAM software packages, maintains the integration of CAD/CAM/CNC operations based on STEP data models, and also enables interoperability of such packages with different local data structures. The capabilities of INFELT STEP are demonstrated by using it in a prototype implementation.", "paper_title": "INFELT STEP: An integrated and interoperable platform for collaborative CAD/CAPP/CAM/CNC machining systems based on STEP standard", "paper_id": "WOS:000284634500004"}