{"auto_keywords": [{"score": 0.048127338594262666, "phrase": "ranking_algorithms"}, {"score": 0.04604921412081024, "phrase": "pagerank"}, {"score": 0.00481495049065317, "phrase": "important_role"}, {"score": 0.0047707093928203, "phrase": "web_search"}, {"score": 0.004270347498153512, "phrase": "low_precision"}, {"score": 0.003966162568548304, "phrase": "adaptive_method"}, {"score": 0.0034368828411023254, "phrase": "tf-idf."}, {"score": 0.0033739270918502285, "phrase": "reinforcement_learning"}, {"score": 0.0033274664434575136, "phrase": "user_behavior"}, {"score": 0.0032364494905485677, "phrase": "user_satisfaction"}, {"score": 0.0031918759137610523, "phrase": "ranking_algorithm"}, {"score": 0.0031333982094796362, "phrase": "owa"}, {"score": 0.00309023627455429, "phrase": "aggregation_operator"}, {"score": 0.00288317238346065, "phrase": "user_needs"}, {"score": 0.0025683581446365165, "phrase": "existing_ranking_algorithms"}, {"score": 0.0024750474634399797, "phrase": "overall_better_ranking_criterion"}, {"score": 0.002225196379204285, "phrase": "university_of_california_at_berkeley's"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Web ranking", " Reinforcement learning", " Ordered weighted operator", " Aggregation", " Adaptive ranking"], "paper_abstract": "Due to the proliferation and abundance of information on the web, ranking algorithms play an important role in web search. Currently, there are some ranking algorithms based on content and connectivity such as BM25 and PageRank. Unfortunately, these algorithms have low precision and are not always satisfying for users. In this paper, we propose an adaptive method, called A3CRank, based on the content, connectivity, and click-through data triple. Our method tries to aggregate ranking algorithms such as BM25, PageRank, and TF-IDF. We have used reinforcement learning to incorporate user behavior and find a measure of user satisfaction for each ranking algorithm. Furthermore, OWA, an aggregation operator is used for merging the results of the various ranking algorithms. A3CRank adapts itself with user needs and makes use of user clicks to aggregate the results of ranking algorithms. A3CRank is designed to overcome some of the shortcomings of existing ranking algorithms by combining them together and producing an overall better ranking criterion. Experimental results indicate that A3CRank outperforms other combinational ranking algorithms such as Ranking SVM in terms of P@n and NDCG metrics. We have used 130 queries on University of California at Berkeley's web to train and evaluate our method. (C) 2009 Elsevier Ltd. All rights reserved.", "paper_title": "A3CRank: An adaptive ranking method based on connectivity, content and click-through data", "paper_id": "WOS:000275611200004"}