{"auto_keywords": [{"score": 0.015719716506582538, "phrase": "multidimensional_markov_chains"}, {"score": 0.01513212574274407, "phrase": "local_loop"}, {"score": 0.010148788247812495, "phrase": "twill"}, {"score": 0.004781357546476652, "phrase": "performance_evaluation"}, {"score": 0.004747997855358171, "phrase": "hybrid_wireless_networks"}, {"score": 0.004536735647938243, "phrase": "considerable_interest"}, {"score": 0.00436530211426514, "phrase": "low_cost"}, {"score": 0.004027412633636142, "phrase": "spectrum_reusability_techniques"}, {"score": 0.0038078492247427594, "phrase": "wireless_systems"}, {"score": 0.003625537203803235, "phrase": "multihop_relaying_and_shortcut"}, {"score": 0.0033800778203837726, "phrase": "fixed_wireless_broadband_services"}, {"score": 0.0033447159750625726, "phrase": "lmds"}, {"score": 0.003240826566478551, "phrase": "multichannel_multipoint_distribution_system"}, {"score": 0.0031733603553977877, "phrase": "call_acceptance_ratio"}, {"score": 0.0031182092708983184, "phrase": "multihop_wireless_architectures"}, {"score": 0.003042599375218838, "phrase": "erlang_b_formula"}, {"score": 0.0028664985822266344, "phrase": "multihop_wireless_systems"}, {"score": 0.0028068030356445894, "phrase": "multiple_types"}, {"score": 0.002562123444678208, "phrase": "significant_increase"}, {"score": 0.002473786357109046, "phrase": "free_space_propagation_model"}, {"score": 0.002405309378904663, "phrase": "radio_channel"}, {"score": 0.0021049977753042253, "phrase": "twill_system"}], "paper_keywords": ["wireless in Local Loop", " multihop relaying", " multidimensional Markov chains", " performance evaluation"], "paper_abstract": "The use of Wireless in Local Loop (WiLL) has generated considerable interest due to the advantages it offers such as ease and low cost of deployment and maintenance. With an increase in the number of subscribers in the network, it becomes expedient to employ spectrum reusability techniques such as the use of multihop relaying in order to improve the capacity of the wireless systems. Throughput enhanced Wireless in Local Loop (TWiLL) is one such architecture that employs multihop relaying and shortcut relaying to reuse bandwidth in WiLL Systems. Compared to other multihop wireless network architectures, TWiLL architecture assumes significance due to its potential use in fixed wireless broadband services such as LMDS (Local Multipoint Distribution Service) and MMDS (Multichannel Multipoint Distribution System). Analysis of the Call Acceptance Ratio (CAR) in multihop wireless architectures including TWiLL is nontrivial as the Erlang B formula no longer holds. In this paper, we build multidimensional Markov Chains to analyze the performance of multihop wireless systems such as TWiLL that has multiple types of channels. We also compare the results of our analysis with results from simulations. We observe that multihop relaying and shortcut relaying lead to a significant increase in the CAR of WiLL systems. Also, the free space propagation model that is normally used to model the radio channel is a very unrealistic model and does not consider reflection, diffraction, scattering, and multipath propagation that hinder transmissions in WiLL systems. In this paper, we studied the effect of several realistic radio channel propagation models on the performance of the TWiLL system through analysis and simulations.", "paper_title": "On using multidimensional Markov chains for performance evaluation of hybrid wireless networks", "paper_id": "WOS:000241411800010"}