{"auto_keywords": [{"score": 0.031623865134248225, "phrase": "taiwan"}, {"score": 0.0047895188927660525, "phrase": "university_student_perception_of_e-learning"}, {"score": 0.004330941610682453, "phrase": "blended_courses"}, {"score": 0.004262643556463565, "phrase": "interpretive_paradigm"}, {"score": 0.004217708394188058, "phrase": "quantitative_and_qualitative_methods"}, {"score": 0.0038953958723049287, "phrase": "student_perspective"}, {"score": 0.0033579708256295847, "phrase": "national_research-oriented_university"}, {"score": 0.0031342307827666675, "phrase": "ict_use"}, {"score": 0.0030521898646210413, "phrase": "requisite_technology"}, {"score": 0.0029098743621130004, "phrase": "ict_infrastructure"}, {"score": 0.0026307897899760383, "phrase": "face-to-face_lectures"}, {"score": 0.0024553821147953463, "phrase": "class_sizes"}, {"score": 0.0024037949232582462, "phrase": "typically_over_a_hundred_students"}, {"score": 0.0022434880661725493, "phrase": "e-learning_use"}, {"score": 0.0021049977753042253, "phrase": "course_support_materials"}], "paper_keywords": ["E-learning", " Blended learning", " Benefits", " Challenges", " ICT"], "paper_abstract": "Many educators concern whether students can learn better from e-learning and whether they face more challenges in blended courses. An interpretive paradigm with quantitative and qualitative methods was adopted to explore the benefits and challenges of e-learning from a student perspective. This paper outlines the findings from a survey of nearly 400 different college students and focus group discussions with over thirty students about their perceptions and experiences of e-learning in a national research-oriented university. The findings suggest that students experience challenges relating to their personal expertise with ICT use and access to the requisite technology, even though Taiwan has invested heavily in ICT infrastructure. Students perceived the benefits of e-learning as arising from being able to preview and follow up on face-to-face lectures and to discuss ideas and issues with peers and instructors given that class sizes are large, typically over a hundred students. Students also perceived some tensions between the benefits and challenges of e-learning use. These were particularly associated with time, the provision of course support materials, motivation, interaction, and instructor expectations.", "paper_title": "Benefits? or Challenges? University Student Perception of E-Learning", "paper_id": "WOS:000271592800006"}