{"auto_keywords": [{"score": 0.04254582144917138, "phrase": "milawa"}, {"score": 0.013938375469171102, "phrase": "milawa_theorem_prover"}, {"score": 0.012966692652972248, "phrase": "nqthm"}, {"score": 0.00955032186538268, "phrase": "milawa_kernel"}, {"score": 0.00481495049065317, "phrase": "reflective_milawa_theorem_prover"}, {"score": 0.00477663001720874, "phrase": "sound"}, {"score": 0.004386637056030611, "phrase": "theorem_prover's_soundness"}, {"score": 0.004094639048362357, "phrase": "machine_code"}, {"score": 0.004012500850311087, "phrase": "theorem_prover"}, {"score": 0.003822003373331997, "phrase": "idealised_version"}, {"score": 0.003700037700138249, "phrase": "high-level_tactics"}, {"score": 0.003495855671790616, "phrase": "small_kernel"}, {"score": 0.0034118234596993836, "phrase": "lcf-style_system"}, {"score": 0.003236596168242036, "phrase": "reflective_extensions"}, {"score": 0.003070340620983981, "phrase": "milawa's_boot-strapping_process"}, {"score": 0.0026423134393535265, "phrase": "source_code"}, {"score": 0.002557899766737999, "phrase": "lisp"}, {"score": 0.0021049977753042253, "phrase": "lisp_runtime"}], "paper_keywords": ["Soundness", " Theorem proving", " Proof assistant", " Machine code"], "paper_abstract": "This paper presents, we believe, the most comprehensive evidence of a theorem prover's soundness to date. Our subject is the Milawa theorem prover. We present evidence of its soundness down to the machine code. Milawa is a theorem prover styled after NQTHM and ACL2. It is based on an idealised version of ACL2' s computational logic and provides the user with high-level tactics similar to ACL2' s. In contrast to NQTHM and ACL2, Milawa has a small kernel that is somewhat like an LCF-style system. We explain how the Milawa theorem prover is constructed as a sequence of reflective extensions from its kernel. The kernel establishes the soundness of these extensions during Milawa's boot-strapping process. Going deeper, we explain how we have shown that the Milawa kernel is sound using the HOL4 theorem prover. In HOL4, we have formalized its logic, proved the logic sound, and proved that the source code for the Milawa kernel (1,700 lines of Lisp) faithfully implements this logic. Going even further, we have combined these results with the x86 machine-code level verification of the Lisp runtime Jitawa. Our top-level theorem states that Milawa can never claim to prove anything that is false when it is run on this Lisp runtime.", "paper_title": "The Reflective Milawa Theorem Prover is Sound (Down to the Machine Code that Runs it)", "paper_id": "WOS:000361243500002"}