{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "fault_tolerance"}, {"score": 0.004772818068176176, "phrase": "multi-agent_deployment"}, {"score": 0.004648609688625397, "phrase": "multi-agent_system"}, {"score": 0.004371160978838441, "phrase": "network_hosts"}, {"score": 0.004257360656055417, "phrase": "memory_constraints"}, {"score": 0.0031565959573536194, "phrase": "node_failures"}, {"score": 0.002994178996584381, "phrase": "survival_probability"}, {"score": 0.002488604965680912, "phrase": "five_heuristic_algorithms"}, {"score": 0.0024559368099486647, "phrase": "survival_probabilities"}, {"score": 0.0023918783117166326, "phrase": "acceptable_time_frames"}, {"score": 0.0023294867572824147, "phrase": "detailed_set"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Multi-agent deployment", " Fault tolerance", " Algorithms", " Replication"], "paper_abstract": "A deployment of a multi-agent system on a network refers to the placement of one or more copies of each agent on network hosts, in such a manner that the memory constraints of each node are satisfied. Finding the deployment that is most likely to tolerate faults (i.e. have at least one copy of each agent functioning and in communication with other agents) is a challenge. In this paper, we address the problem of finding the probability of survival of a deployment (i.e. the probability that a deployment will tolerate faults), under the assumption that node failures are independent. We show that the problem of computing the survival probability of a deployment is at least NP-hard. Moreover, it is hard to approximate. We produce two algorithms to accurately compute the probability of survival of a deployment-these algorithms are expectedly exponential. We also produce five heuristic algorithms to estimate survival probabilities-these algorithms work in acceptable time frames. We report on a detailed set of experiments to determine the conditions under which some of these algorithms perform better than the others. (C) 2008 Elsevier B.V. All rights reserved.", "paper_title": "Computing the fault tolerance of multi-agent deployment", "paper_id": "WOS:000263763900002"}