{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "behaviour_equivalence"}, {"score": 0.008116461997277603, "phrase": "compatibility_notions"}, {"score": 0.0047709540557306284, "phrase": "compatibility_of_business_process_models"}, {"score": 0.0047273577269638725, "phrase": "complex_correspondences"}, {"score": 0.004662705558154439, "phrase": "multiple_models"}, {"score": 0.004598933498016774, "phrase": "business_process"}, {"score": 0.004515252649226697, "phrase": "different_purposes"}, {"score": 0.00443308765153716, "phrase": "different_variants"}, {"score": 0.004234129588974058, "phrase": "equivalence_verification"}, {"score": 0.004062682236016889, "phrase": "different_process_models"}, {"score": 0.0037060428445111694, "phrase": "equivalence_notions"}, {"score": 0.00283870598459543, "phrase": "single_actions"}, {"score": 0.002723607240517261, "phrase": "behaviour_inheritance"}, {"score": 0.0024956789310376635, "phrase": "behaviour_compatibility"}, {"score": 0.0021049977753042253, "phrase": "existing_ones"}], "paper_keywords": ["behaviour equivalence", " behaviour compatibility", " model verification", " behavioural models"], "paper_abstract": "Once multiple models of a business process are created for different purposes or to capture different variants, verification of behaviour equivalence or compatibility is needed. Equivalence verification ensures that two business process models specify the same behaviour. Since different process models are likely to differ with respect to their assumed level of abstraction and the actions that they take into account, equivalence notions have to cope with correspondences between sets of actions and actions that exist in one process but not in the other. In this paper, we present notions of equivalence and compatibility that can handle these problems. In essence, we present a notion of equivalence that works on correspondences between sets of actions rather than single actions. We then integrate our equivalence notion with work on behaviour inheritance that copes with actions that exist in one process but not in the other, leading to notions of behaviour compatibility. Compatibility notions verify that two models have the same behaviour with respect to the actions that they have in common. As such, our contribution is a collection of behaviour equivalence and compatibility notions that are applicable in more general settings than existing ones.", "paper_title": "Behaviour Equivalence and Compatibility of Business Process Models with Complex Correspondences", "paper_id": "WOS:000310636000010"}