{"auto_keywords": [{"score": 0.04444816239028329, "phrase": "mutual_exclusion"}, {"score": 0.010474923411434968, "phrase": "partitioned_distributed_systems"}, {"score": 0.00481495049065317, "phrase": "ancestral_dynamic_voting_algorithm_for_mutual_exclusion"}, {"score": 0.004690305164360866, "phrase": "data_replication"}, {"score": 0.004598933498016774, "phrase": "known_redundancy"}, {"score": 0.00450933377534525, "phrase": "fault-tolerant_distributed_system"}, {"score": 0.004195418010131832, "phrase": "replicated_data"}, {"score": 0.004007083686875716, "phrase": "distributed_system"}, {"score": 0.0036793800647811365, "phrase": "new_dynamic_algorithm"}, {"score": 0.0031429517477457925, "phrase": "availability_analysis"}, {"score": 0.003021502415143067, "phrase": "new_algorithm"}, {"score": 0.002737960968372391, "phrase": "faulty_environments"}, {"score": 0.002323142666222693, "phrase": "full_and_partial_topologies"}], "paper_keywords": [""], "paper_abstract": "Data replication is a known redundancy used in fault-tolerant distributed system. However, it has the problem of mutual exclusion of replicated data. Mutual exclusion becomes difficult when a distributed system is partitioned into two or more isolated groups of sites. In this study, a new dynamic algorithm is presented as a solution for mutual exclusion in partitioned distributed systems. The correctness of the algorithm is proven, and simulation is utilized for availability analysis. Simulations show that the new algorithm, ancestral dynamic voting algorithm, improves the availability and lifetime of service in faulty environments, regardless of the number of sites and topology of the system. This algorithm also prolongs the lifetime of service to mutual exclusion for full and partial topologies especially for the situations where there is no majority. Furthermore, it needs less number of messages transmitted. Finally, it is simple and easy to implement.", "paper_title": "Ancestral Dynamic Voting Algorithm for Mutual Exclusion in Partitioned Distributed Systems", "paper_id": "WOS:000327338500001"}