{"auto_keywords": [{"score": 0.049643973872019624, "phrase": "quasi-degasperis-procesi_equation"}, {"score": 0.047317134097898006, "phrase": "degasperis-procesi_equation"}, {"score": 0.015719716506582538, "phrase": "peakon-antipeakon_collision"}, {"score": 0.014040712981897253, "phrase": "jump_discontinuity"}, {"score": 0.011094552776486645, "phrase": "multi-symplectic_structure"}, {"score": 0.008102230433183144, "phrase": "multi-symplectic_method"}, {"score": 0.004663533386096864, "phrase": "local_geometric_properties"}, {"score": 0.0040479661688863884, "phrase": "main_contribution"}, {"score": 0.0035133644847622383, "phrase": "peakon-antipeakon_collision_process"}, {"score": 0.0032805541677236325, "phrase": "b-family_equation"}, {"score": 0.003021392767766593, "phrase": "multi-symplectic_scheme"}, {"score": 0.0029128614098881253, "phrase": "mathematical_proofs"}, {"score": 0.0028731719610706214, "phrase": "discrete_local_conservation_laws"}, {"score": 0.00274472767672686, "phrase": "numerical_experiments"}, {"score": 0.002493333098814506, "phrase": "numerical_results"}, {"score": 0.0022649119108225564, "phrase": "simulation_results"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Multi-symplectic method", " Quasi-Degasperis-Procesi equation", " B-family equation", " Jump discontinuity", " Peakon-antipeakon collision"], "paper_abstract": "Focusing on the local geometric properties of the shockpeakon for the Degasperis-Procesi equation, a multi-symplectic method for the quasi-Degasperis-Procesi equation is proposed to reveal the jump discontinuity of the shockpeakon for the Degasperis-Procesi equation numerically in this paper. The main contribution of this paper lies in the following: (1) the uniform multi-symplectic structure of the b-family equation is constructed; (2) the stable jump discontinuity of the shockpeakon for the Degasperis-Procesi equation is reproduced by simulating the peakon-antipeakon collision process of the quasi-Degasperis-Procesi equation. First, the multi-symplectic structure and several local conservation laws are presented for the b-family equation with two exceptions (b = 3 and b = 4). And then, the Preissman Box multi-symplectic scheme for the multi-symplectic structure is constructed and the mathematical proofs for the discrete local conservation laws of the multi-symplectic structure are given. Finally, the numerical experiments on the peakon-antipeakon collision of the quasi-Degasperis-Procesi equation are reported to investigate the jump discontinuity of shockpeakon of the Degasperis-Procesi equation. From the numerical results, it can be concluded that the peakon-antipeakon collision of the quasi-Degasperis-Procesi equation can be simulated well by the multi-symplectic method and the simulation results can reveal the jump discontinuity of shockpeakon of the Degasperis-Procesi equation approximately. (C) 2014 Elsevier B.V. All rights reserved.", "paper_title": "Multi-symplectic method for peakon-antipeakon collision of quasi-Degasperis-Procesi equation", "paper_id": "WOS:000337768700018"}