{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "cluster_separation_indices"}, {"score": 0.004296264970612285, "phrase": "simulated_data"}, {"score": 0.004247560712327667, "phrase": "mouse_urine_metabolomic_profiles"}, {"score": 0.0041517954514423625, "phrase": "separate_classes"}, {"score": 0.004035107125458193, "phrase": "namely_the_davies_bouldin_index"}, {"score": 0.003966667994579941, "phrase": "silhouette_width"}, {"score": 0.0035189057079817285, "phrase": "positive_silhouette_width"}, {"score": 0.0033619033669956317, "phrase": "simulated_datasets"}, {"score": 0.0031037644581516973, "phrase": "varying_degrees"}, {"score": 0.0028328599839713866, "phrase": "gas_chromatography_mass_spectrometry"}, {"score": 0.0027689017918347755, "phrase": "mouse_urine"}, {"score": 0.0023064582783867645, "phrase": "class_separation"}, {"score": 0.0021049977753042253, "phrase": "john_wiley"}], "paper_keywords": ["cluster separation", " Davies Bouldin index", " silhouette index", " outliers", " metabolomics", " simulations", " urine"], "paper_abstract": "To quantify separate classes, four indices are compared namely the Davies Bouldin index, the silhouette width and two new approaches described in this paper, the modified silhouette width index based on the proportion of objects with a positive silhouette width and the Overlap Coefficient. Four sets of simulated datasets are described, each in turn, consisting of 15 sets of data of varying degrees of overlap, and differing in the nature of outliers. Three experimental datasets consisting of the gas chromatography mass spectrometry of extracts from mouse urine obtained to study the effect of different environmental (stress), physiological (diet) and developmental (age) factors on their metabolic profiles are also described. The paper discusses the robustness of each approach to outliers, and to allow assessment of class separation for each index. The two modifications protect against outliers. Copyright (C) 2008 John Wiley & Sons, Ltd.", "paper_title": "Use of cluster separation indices and the influence of outliers: application of two new separation indices, the modified silhouette index and the overlap coefficient to simulated data and mouse urine metabolomic profiles", "paper_id": "WOS:000264037400003"}