{"auto_keywords": [{"score": 0.028924345435916012, "phrase": "query-reduction_methods"}, {"score": 0.00481495049065317, "phrase": "collaborative_multi-agent_planning"}, {"score": 0.004475022550508119, "phrase": "autonomous-agent_system"}, {"score": 0.0038787040860731935, "phrase": "exact_information"}, {"score": 0.0036809089768350496, "phrase": "value-of-information_calculation"}, {"score": 0.003542276457435362, "phrase": "multi-agent_task_planning"}, {"score": 0.0034207673889407003, "phrase": "task_schedule"}, {"score": 0.003373334961160647, "phrase": "separate_\"scheduler\"_module"}, {"score": 0.0032576020692463873, "phrase": "overall_agent_performance"}, {"score": 0.003234934827553253, "phrase": "potential_new_information"}, {"score": 0.0030062165552187086, "phrase": "inter-module_communication"}, {"score": 0.002964515198409409, "phrase": "system_performance"}, {"score": 0.002842840150239715, "phrase": "decision-theoretic_algorithm"}, {"score": 0.002524473047010871, "phrase": "faster_decision-making"}, {"score": 0.0024292886883655693, "phrase": "collaborative_interface"}, {"score": 0.0024039564563674673, "phrase": "automated_scheduling_agent"}, {"score": 0.002387214876538434, "phrase": "experimental_results"}, {"score": 0.002362320344521919, "phrase": "significant_decrease"}, {"score": 0.002172266188075892, "phrase": "ordering_methods"}, {"score": 0.0021271863804595108, "phrase": "value_accumulation"}, {"score": 0.0021049977753042253, "phrase": "faster_determination"}], "paper_keywords": ["Adjustable autonomy", " Interruption management", " Value of information"], "paper_abstract": "This paper addresses the problem of computing the value of information in settings in which the people using an autonomous-agent system have access to information not directly available to the system itself. To know whether to interrupt a user for this information, the agent needs to determine its value. The fact that the agent typically does not know the exact information the user has and so must evaluate several alternative possibilities significantly increases the complexity of the value-of-information calculation. The paper addresses this problem as it arises in multi-agent task planning and scheduling with architectures in which information about the task schedule resides in a separate \"scheduler\" module. For such systems, calculating the value to overall agent performance of potential new information requires that the system component that interacts with the user query the scheduler. The cost of this querying and inter-module communication itself substantially affects system performance and must be taken into account. The paper provides a decision-theoretic algorithm for determining the value of information the system might acquire, query-reduction methods that decrease the number of queries the algorithm makes to the scheduler, and methods for ordering the queries to enable faster decision-making. These methods were evaluated in the context of a collaborative interface for an automated scheduling agent. Experimental results demonstrate the significant decrease achieved by using the query-reduction methods in the number of queries needed for reasoning about the value of information. They also show the ordering methods substantially increase the rate of value accumulation, enabling faster determination of whether to interrupt the user.", "paper_title": "Determining the value of information for collaborative multi-agent planning", "paper_id": "WOS:000313866700005"}