{"auto_keywords": [{"score": 0.027163132385802938, "phrase": "conditional_quantile_function"}, {"score": 0.00481495049065317, "phrase": "conditional_quantile_functions"}, {"score": 0.004773692073488661, "phrase": "multidimensional_covariates"}, {"score": 0.004286708921931472, "phrase": "fully_operational_method"}, {"score": 0.004053362743156545, "phrase": "conditional_distribution"}, {"score": 0.004001335931796133, "phrase": "dependent_variable_y"}, {"score": 0.003949974260471287, "phrase": "value_x"}, {"score": 0.003799796252156605, "phrase": "quantile_regression"}, {"score": 0.0033971539563683174, "phrase": "upper_and_lower_tails"}, {"score": 0.0033391018638565715, "phrase": "local_linear_quantile_regression_model"}, {"score": 0.00295950473406239, "phrase": "proposed_methodology"}, {"score": 0.002822434555587263, "phrase": "regression_surface"}, {"score": 0.0027861630854233693, "phrase": "two-dimensional_som_component_plane_representation"}, {"score": 0.0026456667695073043, "phrase": "theta_th_quantile"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["quantile regression", " local linear regression", " nonparametric", " SOM", " multidimensional"], "paper_abstract": "Two existing methods, namely, local linear quantile regression and self-organizing map (SOM) are combined. The combination provides a fully operational method for the visualization of the theta th quantile q(0)(x) in the conditional distribution of a dependent variable Y given the value X = x of a vector of many covariates. Quantile regression is used to provide a picture of the effect of x on the distribution of Y covering not only the center of the distribution, but also the upper and lower tails. Since the local linear quantile regression model is nonparametric, the shape of the estimate for q(0)(x) may vary both by values of theta and by values of x. The novelty of the proposed methodology ensues from the capability to track these changes in the regression surface via a two-dimensional SOM component plane representation. The methodology eases the interpretation of the dependence between the theta th quantile and covariates that is captured by the conditional quantile function q(0)(x). Moreover, the methodology reveals the sensitivity of this relationship to changes in x that is captured by the gradient of the conditional quantile function del q(0)(x). Examples using both simulated and real data are provided to illustrate the methodology. (c) 2005 Elsevier B.V. All rights reserved.", "paper_title": "Self-organizing map visualizing conditional quantile functions with multidimensional covariates", "paper_id": "WOS:000236021700011"}