{"auto_keywords": [{"score": 0.04978464912522237, "phrase": "user_communities"}, {"score": 0.04949240338189186, "phrase": "social_networking_services"}, {"score": 0.00481495049065317, "phrase": "tie_strength"}, {"score": 0.004597552871162737, "phrase": "facebook"}, {"score": 0.004430354365175098, "phrase": "useful_tools"}, {"score": 0.003892007367588934, "phrase": "public_image"}, {"score": 0.003727453167164546, "phrase": "social_network"}, {"score": 0.003659069297495175, "phrase": "recent_studies"}, {"score": 0.003591935475356008, "phrase": "better_mechanisms"}, {"score": 0.0035260290145240464, "phrase": "appropriate_approximation"}, {"score": 0.0034506596895901003, "phrase": "privacy_assistant_software_agent"}, {"score": 0.003397809453525626, "phrase": "privacy_policy"}, {"score": 0.003284361433827464, "phrase": "first_step"}, {"score": 0.0031845067058084613, "phrase": "meaningful_information"}, {"score": 0.0031357200369281344, "phrase": "accurate_privacy_policy_predictions"}, {"score": 0.0030030452897701863, "phrase": "users'_relationships"}, {"score": 0.002938821840519756, "phrase": "recent_empirical_evidence"}, {"score": 0.002565345470805401, "phrase": "whole_eliciting_process"}, {"score": 0.0024416087858984644, "phrase": "best_friend_forever"}, {"score": 0.0022740957662393223, "phrase": "relationship_ties"}, {"score": 0.0022117133940361025, "phrase": "experimental_evaluation"}, {"score": 0.0021710773398370253, "phrase": "bff"}, {"score": 0.0021049977753042253, "phrase": "relationship_strength"}], "paper_keywords": ["Information retrieval", " Social network", " Social media", " Privacy", " Tie strength"], "paper_abstract": "The use of social networking services (SNSs) such as Facebook has explosively grown in the last few years. Users see these SNSs as useful tools to find friends and interact with them. Moreover, SNSs allow their users to share photos, videos, and express their thoughts and feelings. However, users are usually concerned about their privacy when using SNSs. This is because the public image of a subject can be affected by photos or comments posted on a social network. In this way, recent studies demonstrate that users are demanding better mechanisms to protect their privacy. An appropriate approximation to solve this could be a privacy assistant software agent that automatically suggests a privacy policy for any item to be shared on a SNS. The first step for developing such an agent is to be able to elicit meaningful information that can lead to accurate privacy policy predictions. In particular, the information needed is user communities and the strength of users' relationships, which, as suggested by recent empirical evidence, are the most important factors that drive disclosure in SNSs. Given the number of friends that users can have and the number of communities they may be involved on, it is infeasible that users are able to provide this information without the whole eliciting process becoming confusing and time consuming. In this work, we present a tool called Best Friend Forever (BFF) that automatically classifies the friends of a user in communities and assigns a value to the strength of the relationship ties to each one. We also present an experimental evaluation involving 38 subjects that showed that BFF can significantly alleviate the burden of eliciting communities and relationship strength.", "paper_title": "BFF: A tool for eliciting tie strength and user communities in social networking services", "paper_id": "WOS:000335231700005"}