{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "eccentricity_faults"}, {"score": 0.04917503970392541, "phrase": "three-phase_squirrel-cage_induction_motors"}, {"score": 0.03712323512311856, "phrase": "non-invasive_techniques"}, {"score": 0.00443308765153716, "phrase": "short_introduction"}, {"score": 0.004377077848734575, "phrase": "different_types"}, {"score": 0.002821685815956478, "phrase": "different_operating_conditions"}, {"score": 0.0027159094186967247, "phrase": "eccentricity_degree"}, {"score": 0.0025974916908139472, "phrase": "effective_parameters"}, {"score": 0.002360796860462937, "phrase": "fault_diagnosis_systems"}, {"score": 0.002316105585203396, "phrase": "proper_indices"}, {"score": 0.002286781334850213, "phrase": "existing_conditions"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Induction motors", " Eccentricity fault", " Fault diagnosis techniques", " Indices"], "paper_abstract": "In this paper, a short introduction about different types of eccentricity faults in three-phase squirrel-cage induction motors is presented and their effects and consequences on the health and behavior of the motor are reviewed. Two fault diagnosis techniques are discussed, namely: invasive and non-invasive techniques. The relative advantages of the non-invasive techniques are also discussed. Various indices used in the non-invasive techniques are then briefly introduced and some outlines for continuing the research on every index are given. The advantages and disadvantages of the indices under different operating conditions and for any type and eccentricity degree are then discussed together with some effective parameters of the motor. The results of this review are useful for manufacturers of fault diagnosis systems in selecting proper indices for existing conditions and also for researchers in determining further research areas. (C) 2008 Elsevier Ltd. All rights reserved", "paper_title": "Different indexes for eccentricity faults diagnosis in three-phase squirrel-cage induction motors: A review", "paper_id": "WOS:000262807800002"}