{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "multi-attribute_group_decision"}, {"score": 0.04920178434889582, "phrase": "uncertain_linguistic_environment"}, {"score": 0.004611554879923759, "phrase": "choquet_aggregation_operators"}, {"score": 0.0034083145672246067, "phrase": "desirable_properties"}, {"score": 0.0025812459787060097, "phrase": "optimal_fuzzy_measures"}, {"score": 0.0023527296826339225, "phrase": "gray_relational_analysis"}, {"score": 0.002225426912273257, "phrase": "practical_application"}, {"score": 0.0021845387990972543, "phrase": "developed_approach"}, {"score": 0.0021049977753042253, "phrase": "university_faculty"}], "paper_keywords": ["Multi-attribute group decision making", " uncertain linguistic variable", " fuzzy measure", " Choquet integral", " generalized Shapley function"], "paper_abstract": "In this study, we first define the uncertain linguistic Choquet averaging (ULCA) operator and the generalized Shapley uncertain linguistic Choquet averaging (GS-ULCA) operator. Especially, the GS-ULCA operator does not only globally consider the importance of the elements and their ordered positions, but also overall reflect the correlations among them and their ordered positions. Meantime, some desirable properties are studied. Furthermore, an approach to multi-attribute group decision making under uncertain linguistic environment is developed, where the interactions among experts and attributes are respectively considered. Moreover, if the information about the weights of experts and attributes is incompletely known, the models for the optimal fuzzy measures on expert set and attribute set are respectively established, which are based on gray relational analysis (GRA) method. Finally, a practical application of the developed approach to the problem of evaluating university faculty for tenure and promotion is provided.", "paper_title": "An approach to multi-attribute group decision making under uncertain linguistic environment based on the Choquet aggregation operators", "paper_id": "WOS:000329926600021"}