{"auto_keywords": [{"score": 0.038478073412849687, "phrase": "tlf-paff"}, {"score": 0.005702039641447586, "phrase": "crystal_structure"}, {"score": 0.004924238067524331, "phrase": "docking_analysis"}, {"score": 0.0047848914579664125, "phrase": "dimeric_crystal_structure"}, {"score": 0.004738765336344627, "phrase": "dimerization_inhibitory_activity"}, {"score": 0.00470862827326028, "phrase": "tlf-paff._human_immunodeficiency_virus"}, {"score": 0.004502943680955863, "phrase": "critical_drug_target"}, {"score": 0.00446004569562802, "phrase": "anti-retroviral_drugs"}, {"score": 0.004065781456356258, "phrase": "multiple_mutations"}, {"score": 0.003802135020791801, "phrase": "x-ray_crystallography"}, {"score": 0.003589753165698119, "phrase": "disrupted_dimeric_structure"}, {"score": 0.0034109154088832376, "phrase": "undisrupted_dimeric_protease_structure"}, {"score": 0.0031290354217563938, "phrase": "binding_profile"}, {"score": 0.0030794446998279944, "phrase": "pdi"}, {"score": 0.0030209660697925285, "phrase": "monomeric_protease"}, {"score": 0.002954140458190344, "phrase": "pdb_id"}, {"score": 0.002797922160172791, "phrase": "c_termini"}, {"score": 0.0027360168758119277, "phrase": "clamp_shape"}, {"score": 0.0027099059684582176, "phrase": "monomeric_wild_type_receptor"}, {"score": 0.0026330549554033876, "phrase": "higher_binding_affinity"}, {"score": 0.0026079240853929555, "phrase": "expanded_active_site_cavity"}, {"score": 0.0025178072071268534, "phrase": "binding_location"}, {"score": 0.0024542249391904256, "phrase": "wild_type_receptor"}, {"score": 0.002346789235432277, "phrase": "mdr"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["HIV/AIDS", " HIV-1 protease", " Dimerization inhibitors", " TLF-PafF", " X-ray crystallography", " Docking"], "paper_abstract": "Human immunodeficiency virus type-1 (HIV-1) protease, a homodimeric aspartyl protease, is a critical drug target in designing anti-retroviral drugs to treat HIV/AIDS. Multidrug-resistant (MDR) clinical isolate-769 HIV-1 protease (PDB ID: 3PJ6) has been shown to exhibit expanded active site cavity with wide-open conformation of flaps (Gly48-Gly52) due to the accumulation of multiple mutations. In this study, an HIV-1 protease dimerization inhibitor (PDI)-TLF-PafF, was evaluated against MDR769 HIV-1 protease using X-ray crystallography. It was hypothesized that co-crystallization of MDR769 HIV-1 protease in complex with TLF-PafF would yield either a monomeric or a disrupted dimeric structure. However, crystal structure of MDR769 I10V HIV-1 protease co-crystallized with TLF-PafF revealed an undisrupted dimeric protease structure (PDB ID: 4NKK) that is comparable to the crystal structure of its corresponding apo-protease (PDB ID: 3PJ6). In order to understand the binding profile of TLF-PafF as a PDI, docking analysis was performed using monomeric protease (prepared from the dimeric crystal structure, PDB ID: 4NKK) as docking receptor. Docking analysis revealed that TLF-PafF binds at the N and C termini (dimerization domain) in a clamp shape for the monomeric wild type receptor but not the MDR769 monomeric receptor. TLF-PafF preferentially showed higher binding affinity to the expanded active site cavity of MDR769 HIV-1 protease than to the termini. Irrespective of binding location, the binding affinity of TLF-PafF against wild type receptor (-6.7 kcal/mol) was found to be higher compared to its corresponding binding affinity against MDR receptor (-4.6 kcal/mol) suggesting that the MDR769 HIV-1 protease could be resistant to the PDI-activity of TLF-PafF, thus supporting the dimeric crystal structure (PDB ID: 4NKK). (C) 2014 Elsevier Inc. All rights reserved.", "paper_title": "A multi-drug resistant HIV-1 protease is resistant to the dimerization inhibitory activity of TLF-PafF", "paper_id": "WOS:000343631800011"}