{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "argumentation_frameworks"}, {"score": 0.004034841146538891, "phrase": "diametrically_opposed_nature"}, {"score": 0.003958439439112026, "phrase": "repellent_forces"}, {"score": 0.0035125292519354724, "phrase": "artificial_intelligence"}, {"score": 0.0034459835582278746, "phrase": "cognitive_psychology"}, {"score": 0.003332537728389913, "phrase": "argumentation_process"}, {"score": 0.0032850648549389025, "phrase": "promising_approach"}, {"score": 0.003043031131345537, "phrase": "five_steps"}, {"score": 0.0025985515390787297, "phrase": "dubois"}, {"score": 0.0025737890313763407, "phrase": "prade"}, {"score": 0.0024417832296664698, "phrase": "formal_definitions"}, {"score": 0.0021560018573288666, "phrase": "different_forms"}], "paper_keywords": [""], "paper_abstract": "In this article, we propose a survey of the use of bipolarity in argumentation frameworks. On the one hand, the notion of bipolarity relies on the presence of two kinds of entities that have a diametrically opposed nature and that represent repellent forces (a positive entity and a negative entity). The notion exists in various domains (for example with the representation of preferences in artificial intelligence, or in cognitive psychology). On the other hand, argumentation process is a promising approach for reasoning, based on the construction and the comparison of arguments. It follows five steps: building the arguments, defining the interactions between these arguments, valuating the arguments, selecting the most acceptable arguments and, finally, drawing a conclusion. Using the nomenclature proposed by Dubois and Prade, this article shows on various applications, and with some formal definitions, that bipolarity appears in argumentation (in some cases if not always) and can be used in each step of this process under different forms. (C) 2008 Wiley Periodicals. Inc.", "paper_title": "On bipolarity in argumentation frameworks", "paper_id": "WOS:000259771100004"}