{"auto_keywords": [{"score": 0.037136664202598445, "phrase": "gp"}, {"score": 0.010612140504970525, "phrase": "genetic_programming"}, {"score": 0.004243289764306128, "phrase": "john_koza"}, {"score": 0.0040027552011993005, "phrase": "first_issue"}, {"score": 0.003721098220825489, "phrase": "significant_range"}, {"score": 0.0032471155306148126, "phrase": "significant_open_issues"}, {"score": 0.003200045185608395, "phrase": "successful_application"}, {"score": 0.003092842645798083, "phrase": "challenging_real-world_problem_domains"}, {"score": 0.002672511078070529, "phrase": "trusted_mainstream_member"}, {"score": 0.0026337482179592422, "phrase": "computational_problem"}, {"score": 0.0024601402359002056, "phrase": "open_issues"}, {"score": 0.0023776666866145092, "phrase": "gp."}, {"score": 0.002231747358665628, "phrase": "future_research"}], "paper_keywords": ["Open issues", " Genetic programming"], "paper_abstract": "It is approximately 50 years since the first computational experiments were conducted in what has become known today as the field of Genetic Programming (GP), twenty years since John Koza named and popularised the method, and ten years since the first issue appeared of the Genetic Programming & Evolvable Machines journal. In particular, during the past two decades there has been a significant range and volume of development in the theory and application of GP, and in recent years the field has become increasingly applied. There remain a number of significant open issues despite the successful application of GP to a number of challenging real-world problem domains and progress in the development of a theory explaining the behavior and dynamics of GP. These issues must be addressed for GP to realise its full potential and to become a trusted mainstream member of the computational problem solving toolkit. In this paper we outline some of the challenges and open issues that face researchers and practitioners of GP. We hope this overview will stimulate debate, focus the direction of future research to deepen our understanding of GP, and further the development of more powerful problem solving algorithms.", "paper_title": "Open issues in genetic programming", "paper_id": "WOS:000279302800004"}