{"auto_keywords": [{"score": 0.04103842203874704, "phrase": "binding_kinetics"}, {"score": 0.024047113778664857, "phrase": "brd"}, {"score": 0.0046797114400479135, "phrase": "protein_modules"}, {"score": 0.0044385053213394175, "phrase": "acetylated_lysine_substrate"}, {"score": 0.004296264970612285, "phrase": "promising_drug_target"}, {"score": 0.004209679094023478, "phrase": "disease_pathways"}, {"score": 0.00399260264462941, "phrase": "detailed_inhibition_mechanism"}, {"score": 0.003771282384646587, "phrase": "classical_molecular_dynamics"}, {"score": 0.003695237613399466, "phrase": "state-of-the-art_density"}, {"score": 0.0034060348526709634, "phrase": "binding_pocket_size"}, {"score": 0.003378385493203297, "phrase": "za-loop_motion"}, {"score": 0.0027893011631269873, "phrase": "previous_experimental_results"}, {"score": 0.0027218799769229596, "phrase": "high_inhibitory_effect"}, {"score": 0.002350152413458658, "phrase": "critical_residues"}, {"score": 0.00220163445285539, "phrase": "non-negligible_ligand"}, {"score": 0.0021571717917276724, "phrase": "flexible_za-loop_motions"}], "paper_keywords": [""], "paper_abstract": "Bromodomains (BRDs) are protein modules that selectively recognize histones as a \"reader\" by binding to an acetylated lysine substrate. The human BRD4 has emerged as a promising drug target for a number of disease pathways, and several potent BRD inhibitors have been discovered experimentally recently. However, the detailed inhibition mechanism especially for the inhibitor binding kinetics is not clear. Herein, by employing classical molecular dynamics (MD) and state-of-the-art density functional QM/MM MD simulations, the dynamic characteristics of ZA-loop in BRD4 are revealed. And then the correlation between binding pocket size and ZA-loop motion is elucidated. Moreover, our simulations found that the compound (-)-JQ1 could be accommodated reasonably in thermodynamics whereas it is infeasible in binding kinetics against BRD4. Its racemate (+)-JQ1 proved to be both thermodynamically reasonable and kinetically achievable against BRD4, which could explain the previous experimental results that (+)-JQ1 shows a high inhibitory effect toward BRD4 (IC50 is 77 nM) while (-)-JQ1 is inactive (>10 mu M). Furthermore, the L92/L94/Y97 in the ZA-loop and Asn140 in the BC-loop are identified to be critical residues in (+)-JQ1 binding/releasing kinetics. All these findings shed light on further selective inhibitor design toward BRD family, by exploiting the non-negligible ligand binding kinetics features and flexible ZA-loop motions of BRD, instead of only the static ligand protein binding affinity.", "paper_title": "Binding Kinetics versus Affinities in BRD4 Inhibition", "paper_id": "WOS:000362056900012"}