{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "agent-based_models"}, {"score": 0.004677372885331908, "phrase": "significant_ingredient"}, {"score": 0.0043713857434347254, "phrase": "systems'_complexity"}, {"score": 0.004225950334493496, "phrase": "agent-based_modeling"}, {"score": 0.0041051328120736575, "phrase": "methodological_vehicle"}, {"score": 0.004046020290832207, "phrase": "complex_systems"}, {"score": 0.0038737214010638745, "phrase": "information_exchange"}, {"score": 0.0036026484429137998, "phrase": "proxy_form"}, {"score": 0.0034826993555190765, "phrase": "movement_behavior"}, {"score": 0.0034491650585057754, "phrase": "realistic_agency"}, {"score": 0.0032389001343643064, "phrase": "agent-based_schemes"}, {"score": 0.003115908199991072, "phrase": "popularly-used_methods"}, {"score": 0.0026817365934071486, "phrase": "agent_movement"}, {"score": 0.0026175952455594277, "phrase": "real-world_trajectory_data"}, {"score": 0.0025181367444581993, "phrase": "relatively_poor_job"}, {"score": 0.002252701813819903, "phrase": "potential_avenues"}, {"score": 0.0021670777282518424, "phrase": "agent-based_frameworks"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Walking", " Agent-based modeling", " Movement", " Trajectory measurement"], "paper_abstract": "Human movement is a significant ingredient of many social, environmental, and technical systems, yet the importance of movement is often discounted in considering systems' complexity. Movement is commonly abstracted in agent-based modeling (which is perhaps the methodological vehicle for modeling complex systems), despite the influence of movement upon information exchange and adaptation in a system. In particular, agent-based models of urban pedestrians often treat movement in proxy form at the expense of faithfully treating movement behavior with realistic agency. There exists little consensus about which method is appropriate for representing movement in agent-based schemes. In this paper, we examine popularly-used methods to drive movement in agent-based models, first by introducing a methodology that can flexibly handle many representations of movement at many different scales and second, introducing a suite of tools to benchmark agent movement between models and against real-world trajectory data. We find that most popular movement schemes do a relatively poor job of representing movement, but that some schemes may well be \"good enough\" for some applications. We also discuss potential avenues for improving the representation of movement in agent-based frameworks. (C) 2011 Elsevier Ltd. All rights reserved.", "paper_title": "An extensible simulation environment and movement metrics for testing walking behavior in agent-based models", "paper_id": "WOS:000300128000001"}