{"auto_keywords": [{"score": 0.03383506494647735, "phrase": "user_behavior"}, {"score": 0.015719716506582538, "phrase": "human_factors"}, {"score": 0.015170921215896343, "phrase": "digital_library_users"}, {"score": 0.010129346243176036, "phrase": "robust_clustering"}, {"score": 0.004757643419056999, "phrase": "stereotyping_behavior"}, {"score": 0.004401342842183475, "phrase": "effective_personalization"}, {"score": 0.0035473867669654174, "phrase": "gender_differences"}, {"score": 0.002945669860541221, "phrase": "individual_clustering_techniques"}, {"score": 0.0028245516301681713, "phrase": "deeper_understanding"}, {"score": 0.0027741761880779535, "phrase": "robust_clustering_approach"}, {"score": 0.002644179117033107, "phrase": "cognitive_style"}, {"score": 0.0024604876113911173, "phrase": "robust_clusters"}, {"score": 0.0021049977753042253, "phrase": "effective_technique"}], "paper_keywords": ["digital libraries", " human factors", " stereotypes", " robust clustering", " perception", " behavior"], "paper_abstract": "To deliver effective personalization for digital library users, it is necessary to identify which human factors are most relevant in determining the behavior and perception of these users. This paper examines three key human factors: cognitive styles, levels of expertise and gender differences, and utilizes three individual clustering techniques: k-means, hierarchical clustering and fuzzy clustering to understand user behavior and perception. Moreover, robust clustering, capable of correcting the bias of individual clustering techniques, is used to obtain a deeper understanding. The robust clustering approach produced results that highlighted the relevance of cognitive style for user behavior, i.e., cognitive style dominates and justifies each of the robust clusters created. We also found that perception was mainly determined by the level of expertise of a user. We conclude that robust clustering is an effective technique to analyze user behavior and perception.", "paper_title": "The role of human factors in stereotyping behavior and perception of digital library users: a robust clustering approach", "paper_id": "WOS:000246759600003"}