{"auto_keywords": [{"score": 0.0480253670845457, "phrase": "chemical_descriptors"}, {"score": 0.04336705121455173, "phrase": "predictive_performance"}, {"score": 0.00481495049065317, "phrase": "predictive_modeling-friend"}, {"score": 0.004066076430818046, "phrase": "method_decision_tree_ensembles"}, {"score": 0.0034984340449789745, "phrase": "large_extent"}, {"score": 0.003047776993499616, "phrase": "practical_point"}, {"score": 0.0027916287357898544, "phrase": "uncertain_values"}, {"score": 0.0027054473441439422, "phrase": "ensembles_method"}, {"score": 0.002655017467085696, "phrase": "equally_effective_models"}, {"score": 0.00262191949451482, "phrase": "single-point_samples"}, {"score": 0.0022133711375320244, "phrase": "decision_tree_ensembles"}, {"score": 0.002172093645267283, "phrase": "modeling_method"}, {"score": 0.0021315842986705485, "phrase": "considered_types"}, {"score": 0.0021049977753042253, "phrase": "introduced_uncertainty"}], "paper_keywords": [""], "paper_abstract": "Uncertainty was introduced to chemical descriptors of 16 publicly available data. sets to various degrees and in various-ways order to investigate the effect on the predictive performance Of the State of-the-art method decision tree ensembles. A number of strategies to handle uncertainty in:decision tree ensembles were evaluated. The main conclusion of the Study. is that uncertainty to a large extent may be introduced in chemical descriptors without. impairing the predictive performance of ensembles and without the predictive performance being significantly reduced from a practical point of view. The investigation. further showed that even When distributions of uncertain values were provided, the ensembles method could generate equally effective models from single-point samples from these distributions. Hence, there seems to be no advantage in using more., elaborate Methods for handling uncertainty in chemical descriptors when using decision tree ensembles as a modeling method for the considered types of introduced uncertainty.", "paper_title": "Introducing Uncertainty in Predictive Modeling-Friend or Foe?", "paper_id": "WOS:000311461400003"}