{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "user_navigation"}, {"score": 0.006748684186427566, "phrase": "real_data"}, {"score": 0.00511866422151188, "phrase": "improved_structure"}, {"score": 0.004775335634705251, "phrase": "website_structure_improvement"}, {"score": 0.004716520738331953, "phrase": "well-structured_websites"}, {"score": 0.004658426838467567, "phrase": "effective_user_navigation"}, {"score": 0.004506968388996092, "phrase": "primary_reason"}, {"score": 0.00443308765153716, "phrase": "web_developers'_understanding"}, {"score": 0.003916098498242888, "phrase": "user_navigation_data"}, {"score": 0.0038678251731669865, "phrase": "completely_reorganized_new_structure"}, {"score": 0.003444912629614206, "phrase": "substantial_changes"}, {"score": 0.0033465923623290034, "phrase": "mathematical_programming_model"}, {"score": 0.003132236287543072, "phrase": "extensive_tests"}, {"score": 0.0027211030647461324, "phrase": "large_synthetic_data_sets"}, {"score": 0.0024535580495414783, "phrase": "improved_website"}, {"score": 0.002203117204010397, "phrase": "heavily_disoriented_users"}], "paper_keywords": ["Website design", " user navigation", " web mining", " mathematical programming"], "paper_abstract": "Designing well-structured websites to facilitate effective user navigation has long been a challenge. A primary reason is that the web developers' understanding of how a website should be structured can be considerably different from that of the users. While various methods have been proposed to relink webpages to improve navigability using user navigation data, the completely reorganized new structure can be highly unpredictable, and the cost of disorienting users after the changes remains unanalyzed. This paper addresses how to improve a website without introducing substantial changes. Specifically, we propose a mathematical programming model to improve the user navigation on a website while minimizing alterations to its current structure. Results from extensive tests conducted on a publicly available real data set indicate that our model not only significantly improves the user navigation with very few changes, but also can be effectively solved. We have also tested the model on large synthetic data sets to demonstrate that it scales up very well. In addition, we define two evaluation metrics and use them to assess the performance of the improved website using the real data set. Evaluation results confirm that the user navigation on the improved structure is indeed greatly enhanced. More interestingly, we find that heavily disoriented users are more likely to benefit from the improved structure than the less disoriented users.", "paper_title": "Facilitating Effective User Navigation through Website Structure Improvement", "paper_id": "WOS:000314934900008"}