{"auto_keywords": [{"score": 0.042690431187572216, "phrase": "approximate_solution"}, {"score": 0.00723511354111246, "phrase": "fuzzy_lr_linear_system"}, {"score": 0.00481495049065317, "phrase": "exact_solutions"}, {"score": 0.004626255242038005, "phrase": "approximate_solutions"}, {"score": 0.004444921827311577, "phrase": "necessary_and_sufficient_conditions"}, {"score": 0.004327981760540394, "phrase": "fuzzy_lr_linear_systems"}, {"score": 0.0034963129868796033, "phrase": "corresponding_crisp_linear_system"}, {"score": 0.0030595112110658675, "phrase": "least_squares_model"}, {"score": 0.002572001496778222, "phrase": "quadratic_programming_model"}, {"score": 0.002537880772794665, "phrase": "bound_constraints"}, {"score": 0.002295964130868963, "phrase": "large_scale_problems"}, {"score": 0.0021049977753042253, "phrase": "significantly_more_accurate_solutions"}], "paper_keywords": ["Fuzzy linear systems", " Fuzzy numbers", " Approximate solution", " Quadratic programming", " Least squares approximation", " Solvability"], "paper_abstract": "We first establish some necessary and sufficient conditions for solvability of fuzzy LR linear systems. We then propose a concept for an approximate solution when a fuzzy LR linear system lacks a solution. Recently, we have proposed an approximate solution for a fuzzy LR linear system under the condition that a corresponding crisp linear system was solvable. Here, we remove this condition by presenting a more general concept of an approximate solution based on a least squares model. We also develop the conditions for the uniqueness of the approximate solution. To compute an approximate solution, we propose an algorithm based on a quadratic programming model with bound constraints on some variables. Finally, we show numerically the appropriateness of our proposed approximate solution for large scale problems in comparison with other recently proposed approximate solutions. The numerical results show that our proposed algorithm produces significantly more accurate solutions.", "paper_title": "Fuzzy LR linear systems: quadratic and least squares models to characterize exact solutions and an algorithm to compute approximate solutions", "paper_id": "WOS:000347407500019"}