{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "universal_modulus"}, {"score": 0.004565876339189493, "phrase": "authorized_member"}, {"score": 0.004329630571352367, "phrase": "significant_way"}, {"score": 0.004105558123159003, "phrase": "group-oriented_signature"}, {"score": 0.003459191419478298, "phrase": "proper_set"}, {"score": 0.0034185505275141077, "phrase": "distributed_rsa_parameters"}, {"score": 0.003338690782620756, "phrase": "key_generation_center"}, {"score": 0.0025892330566358503, "phrase": "computational_infeasibility"}, {"score": 0.0025286975935774245, "phrase": "used_modulus"}, {"score": 0.0024842242921857705, "phrase": "generalized_group-oriented_signature_scheme"}, {"score": 0.002246553137021003, "phrase": "authorized_signer"}], "paper_keywords": ["group-oriented signature", " threshold signature", " generalized group-oriented signature", " universal modulus"], "paper_abstract": "The concept of universal modulus, meaning that the modulus used by each authorized member of a group is identical, is a significant way to simplify the generation and verification of a group-oriented signature. Since most existing group-oriented signature systems using universal modulus are discrete logarithm based, RSA based solutions become more significant because of its widely spread use. In this paper, based upon a proper set of distributed RSA parameters produced by a key generation center, we first propose an (r,r) threshold signature scheme in which all authorized signers of a group can cooperate to sign a message on behalf of the group with a universal modulus. And the security of the scheme is guaranteed because of the computational infeasibility of factoring the used modulus. A generalized group-oriented signature scheme is subsequently proposed from elaborately modifying the (r, r) threshold signature scheme. Also, the modulus used by each authorized signer is universal and the security can be ensured in the same way.", "paper_title": "An efficient generalized group-oriented signature scheme", "paper_id": "WOS:000256710400008"}