{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "real_locomotion"}, {"score": 0.025442981116023288, "phrase": "proposed_framework"}, {"score": 0.004773040022691547, "phrase": "immersive_virtual_environments"}, {"score": 0.004710854091689325, "phrase": "affordance-based_experiential_approach"}, {"score": 0.004450568197899267, "phrase": "virtual_environments"}, {"score": 0.004278807087784626, "phrase": "intense_sense"}, {"score": 0.004186253035932442, "phrase": "main_outcome"}, {"score": 0.0041316803676012155, "phrase": "present_research"}, {"score": 0.004042295865725559, "phrase": "design_features"}, {"score": 0.00398959232769596, "phrase": "virtual_reality_technology"}, {"score": 0.003438058620195309, "phrase": "generic_ve"}, {"score": 0.003334309053314909, "phrase": "corresponding_real_environment"}, {"score": 0.0032054891061528896, "phrase": "experiential_design"}, {"score": 0.002949598537993663, "phrase": "real_environment"}, {"score": 0.0029110999689379497, "phrase": "design_strategies"}, {"score": 0.002737960968372391, "phrase": "proposed_list"}, {"score": 0.002475532161577715, "phrase": "future_developments"}, {"score": 0.002443206010337041, "phrase": "survey_analysis"}, {"score": 0.0021049977753042253, "phrase": "systems_design"}], "paper_keywords": ["Affordance", " Experiential design", " Locomotion interfaces", " Virtual environments", " Presence"], "paper_abstract": "This paper describes a framework for designing systems for real locomotion in virtual environments (VEs) in order to achieve an intense sense of presence. The main outcome of the present research is a list of design features that the virtual reality technology should have in order to achieve such a goal. To identify these features, an approach based on the combination of two design strategies was followed. The first was based on the theory of affordances and was utilized to design a generic VE in which the affordances of the corresponding real environment could be evoked. The second was the experiential design applied to VEs and was utilized to create an experience of locomotion corresponding to that achievable in a real environment. These design strategies were chosen because of their potential to enhance the sense of presence. The proposed list of features can be utilized as an instrument that allows VE designers to evaluate the maturity of their systems and to pinpoint directions for future developments. A survey analysis was performed using the proposed framework, which involved three case studies to determine how many features of the proposed framework were present and their status. The result of such analysis represented a measure of the completeness of the systems design, of the affordances provided to the user, and a prediction of the sense of presence.", "paper_title": "Designing presence for real locomotion in immersive virtual environments: an affordance-based experiential approach", "paper_id": "WOS:000363862800011"}