{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "higher_levels"}, {"score": 0.012116823787495097, "phrase": "virtual_environment"}, {"score": 0.004748832495727873, "phrase": "procedure_memorization_performance_and_implications"}, {"score": 0.004477765573115626, "phrase": "abstract_mental_activities"}, {"score": 0.004416257191177784, "phrase": "conceptual_learning"}, {"score": 0.004078562617505643, "phrase": "mental_activity"}, {"score": 0.0033717094055177995, "phrase": "matched_software_field"}, {"score": 0.003157061070428828, "phrase": "higher_field"}, {"score": 0.0030285690317007805, "phrase": "best_performance"}, {"score": 0.002976581914095474, "phrase": "matched_sfov"}, {"score": 0.002692132776447632, "phrase": "real_world"}, {"score": 0.0026185499482623, "phrase": "procedure_memorization_tasks"}, {"score": 0.002538164420139397, "phrase": "moderate_levels"}, {"score": 0.0023437424558633013, "phrase": "lower_levels"}, {"score": 0.0022875739347765914, "phrase": "performance_improvements"}, {"score": 0.0022096550791379033, "phrase": "enhanced_spatial_cues"}, {"score": 0.0021343846011837204, "phrase": "conceptual_information"}, {"score": 0.002119640369431708, "phrase": "spatial_information"}, {"score": 0.0021049977753042253, "phrase": "educational_vr."}], "paper_keywords": [""], "paper_abstract": "Researchers have proposed that immersion could have advantages for tasks involving abstract mental activities, such as conceptual learning; however, there are few empirical results that support this idea. We hypothesized that higher levels of immersion would benefit such tasks if the mental activity could be mapped to objects or locations in a 3D environment. To investigate this hypothesis, we performed an experiment in which participants memorized procedures in a virtual environment and then attempted to recall those procedures. We aimed to understand the effects of three components of immersion on performance. The results demonstrate that a matched software field of view (SFOV), a higher physical field of view (FOV), and a higher field of regard (FOR) all contributed to more effective memorization. The best performance was achieved with a matched SFOV and either a high FOV or a high FOR, or both. In addition, our experiment demonstrated that memorization in a virtual environment could be transferred to the real world. The results suggest that, for procedure memorization tasks, increasing the level of immersion even to moderate levels, such as those found in head mounted displays (HMDs) and display walls, can improve performance significantly compared to lower levels of immersion. Hypothesizing that the performance improvements provided by higher levels of immersion can be attributed to enhanced spatial cues, we discuss the values and limitations of supplementing conceptual information with spatial information in educational VR.", "paper_title": "The Effects of Higher Levels of Immersion on Procedure Memorization Performance and Implications for Educational Virtual Environments", "paper_id": "WOS:000287346400004"}