{"auto_keywords": [{"score": 0.04245289969035787, "phrase": "optimal_regulator"}, {"score": 0.028359298224429872, "phrase": "stable_projections"}, {"score": 0.0275479686701374, "phrase": "state-space_approach"}, {"score": 0.004591345494188032, "phrase": "control_system"}, {"score": 0.004125314447335291, "phrase": "state_space_form"}, {"score": 0.0037731618765688584, "phrase": "transfer_functions"}, {"score": 0.0033898953358387105, "phrase": "proper_stable_rational_matrices"}, {"score": 0.0028865314258560214, "phrase": "inner-outer_factorization"}, {"score": 0.0027852126030055305, "phrase": "algebraic_riccati_equation"}, {"score": 0.0024431289979171505, "phrase": "different_construction"}, {"score": 0.002414191082427217, "phrase": "doubly_coprime"}, {"score": 0.002234252028553481, "phrase": "transferfunction_approach"}, {"score": 0.0021946656099592608, "phrase": "fixed_doubly_coprime_fractions"}], "paper_keywords": ["linear systems", " feedback control", " stability", " norm minimization"], "paper_abstract": "The H-2 control problem consists of stabilizing a control system while minimizing the H-2 norm of its transfer function. Several solutions to this problem are available. For systems in state space form, an optimal regulator can be obtained by solving two algebraic Riccati equations. For systems described by transfer functions, either Wiener-Hopf optimization or projection results can be applied. The optimal regulator is then obtained using operations with proper stable rational matrices: inner-outer factorizations and stable projections. The aim of this paper is to compare the two approaches. It is well understood that the inner-outer factorization is equivalent to solving an algebraic Riccati equation. However, why are the stable projections not needed in the state-space approach? The difference between the two approaches derives from a different construction of doubly coprime, proper stable matrix fractions used to represent the plant. The transferfunction approach takes any fixed doubly coprime fractions, while the state-space approach parameterizes all such representations and those selected then obviate the need for stable projections.", "paper_title": "Sixty years of cybernetics - A comparison of approaches to solving the H-2 control problem", "paper_id": "WOS:000257668000005"}