{"auto_keywords": [{"score": 0.049593242225692294, "phrase": "social_media_systems"}, {"score": 0.033638969170552604, "phrase": "semantically_related_questions"}, {"score": 0.03169637206798872, "phrase": "topic-enhanced_translation-based_language_model"}, {"score": 0.00481495049065317, "phrase": "social_media"}, {"score": 0.004646088032529303, "phrase": "large_archives"}, {"score": 0.004460309246062286, "phrase": "online_forums"}, {"score": 0.004238452771031322, "phrase": "large_number"}, {"score": 0.003946195919158241, "phrase": "interesting_items"}, {"score": 0.0038862297330905836, "phrase": "active_user"}, {"score": 0.0036740168936985314, "phrase": "question_suggestion"}, {"score": 0.003438058620195309, "phrase": "queried_question"}, {"score": 0.003403122817578447, "phrase": "existing_bag-of-words_approaches"}, {"score": 0.0032172054825137866, "phrase": "lexical_chasm"}, {"score": 0.0030726480920918097, "phrase": "new_framework"}, {"score": 0.0025694584194998356, "phrase": "answer_information"}, {"score": 0.002249672943553135, "phrase": "real-world_datasets"}], "paper_keywords": ["Social media", " Online forum", " Community-based Q&A", " Question suggestion", " Language model", " Topic modeling"], "paper_abstract": "Social media systems with Q&A functionalities have accumulated large archives of questions and answers. Two representative types are online forums and community-based Q&A services. To enable users to explore the large number of questions and answers in social media systems effectively, it is essential to suggest interesting items to an active user. In this article, we address the problem of question suggestion, which targets at suggesting questions that are semantically related to a queried question. Existing bag-of-words approaches suffer from the shortcoming that they could not bridge the lexical chasm between semantically related questions. Therefore, we present a new framework, and propose the topic-enhanced translation-based language model (TopicTRLM), which fuses both the lexical and latent semantic knowledge. This fusing enables TopicTRLM to find semantically related questions to a given question even when there is little word overlap. Moreover, to incorporate the answer information into the model to make the model more complete, we also propose the topic-enhanced translation-based language model with answer ensemble. Extensive experiments have been conducted with real-world datasets. Experimental results indicate our approach is very effective and outperforms other popular methods in several metrics.", "paper_title": "Learning to suggest questions in social media", "paper_id": "WOS:000351520700006"}