{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "virtual_worlds"}, {"score": 0.008390373430840483, "phrase": "virtual_world"}, {"score": 0.004470071518923524, "phrase": "emerging_communities"}, {"score": 0.0036393456309815166, "phrase": "regular_basis"}, {"score": 0.003423042581201533, "phrase": "high-level_theoretical_framework"}, {"score": 0.002962543869356265, "phrase": "virtual_world_assimilation"}, {"score": 0.002552628669352939, "phrase": "second_life"}, {"score": 0.002497319603143104, "phrase": "empirical_support"}, {"score": 0.0023798115577749225, "phrase": "technology_and_community_classes"}, {"score": 0.0023180581939456686, "phrase": "direct_influence"}, {"score": 0.002287783663138828, "phrase": "user's_attitude"}, {"score": 0.0021705796895687864, "phrase": "user_class"}, {"score": 0.002132879292829487, "phrase": "european"}, {"score": 0.0021049977753042253, "phrase": "information_systems"}], "paper_keywords": ["virtual worlds", " IT adoption", " IT assimilation", " Second Life", " structural equation modeling"], "paper_abstract": "Virtual worlds are increasing in importance as more multi-national firms are investing heavily in these emerging communities. Although much excitement has surrounded the idea of virtual worlds, a gap exists between those who register and those who engage in virtual worlds. Our analysis of the gap between those who merely register to join a virtual world and those who ultimately engage the community on a regular basis derives from a lack of assimilation. We present the 3C approach, a high-level theoretical framework delineating the relationship between three classes of factors (namely the technology class of factors; the community class of factors; and the user class of factors) that we posit explain virtual world assimilation and employ theories to represent these classes of factors and the interaction between them. After discussing and integrating these three classes of factors, we test our model through a study of 223 new users of Second Life. The results provide empirical support for the 3C framework; specifically, our analysis indicates that the technology and community classes of factors in exert a direct influence upon a user's attitude towards the virtual world, and this relationship is moderated by the user class of factors. European journal of Information Systems (2012) 21, 303-320. doi:10.1057/ejis.2011.49; published online 15 November 2011", "paper_title": "Towards an understanding of assimilation in virtual worlds: the 3C approach", "paper_id": "WOS:000303845200007"}