{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "participatory_performance"}, {"score": 0.043322976460317755, "phrase": "hci_investigation"}, {"score": 0.00475924837336259, "phrase": "nightingallery_project"}, {"score": 0.004542780650208743, "phrase": "musically_responsive_animatronic_bird"}, {"score": 0.0042035670399069485, "phrase": "nightingallery"}, {"score": 0.003950453462399077, "phrase": "unfamiliar_technologies"}, {"score": 0.003844545552246988, "phrase": "improvisational_street_theatre"}, {"score": 0.003726967166630923, "phrase": "bird_character"}, {"score": 0.0035989687070420977, "phrase": "carnival_barkers"}, {"score": 0.003408512155673965, "phrase": "fantastical_creature"}, {"score": 0.0033690254452595865, "phrase": "fairground_sideshow_display"}, {"score": 0.003129317057177867, "phrase": "focal_character"}, {"score": 0.0029867619862229853, "phrase": "anthropomorphic_nature"}, {"score": 0.002884111441153185, "phrase": "cultural_connotations"}, {"score": 0.0026477564788515984, "phrase": "secondary_characters"}, {"score": 0.0024496978447849835, "phrase": "performance_frame"}, {"score": 0.0023746766301040974, "phrase": "recent_hci_theories"}, {"score": 0.002356282242320051, "phrase": "mixed_reality_performance"}, {"score": 0.0021214346747442363, "phrase": "social_encounters"}, {"score": 0.0021049977753042253, "phrase": "playful_technologies"}], "paper_keywords": ["Digital arts", " HCI", " Participatory performance", " Theatrical approaches", " Practice-based research", " Research in the wild", " Interdisciplinary design"], "paper_abstract": "The Nightingallery project encouraged participants to converse, sing, and perform with a musically responsive animatronic bird, playfully interacting with the character while members of the public could look on and observe. We used Nightingallery to frame an HCI investigation into how people would engage with one another when confronted with unfamiliar technologies in conspicuously public, social spaces. Structuring performances as improvisational street theatre, we styled our method of exhibiting the bird character. We cast ourselves in supporting roles as carnival barkers and minders of the bird, presenting him as if he were a fantastical creature in a fairground sideshow display, allowing him the agency to shape and maintain dialogues with participants, and positioning him as the focal character upon which the encounter was centred. We explored how the anthropomorphic nature of the bird itself, along with the cultural connotations associated with the carnival/sideshow tradition helped signpost and entice participants through the trajectory of their encounters with the exhibit. Situating ourselves as secondary characters within the narrative defining the performance/use context, our methods of mediation, observation, and evaluation were integrated into the performance frame. In this paper, we explore recent HCI theories in mixed reality performance to reflect upon how genre-based cultural connotations can be used to frame trajectories of experience, and how manipulation of roles and agency in participatory performance can facilitate HCI investigation of social encounters with playful technologies.", "paper_title": "Nightingallery: theatrical framing and orchestration in participatory performance", "paper_id": "WOS:000342454500004"}