{"auto_keywords": [{"score": 0.03849078065443834, "phrase": "generalization_problem"}, {"score": 0.00481495049065317, "phrase": "user_requirements"}, {"score": 0.004754447398742591, "phrase": "geo-information_generalisation"}, {"score": 0.004577440795549049, "phrase": "long-standing_research_topic"}, {"score": 0.004050514095922329, "phrase": "geo-information_producers"}, {"score": 0.003932654396285872, "phrase": "geo-information_users"}, {"score": 0.0035240305920962766, "phrase": "currently_the_most_important_benchmark"}, {"score": 0.0033926758710459866, "phrase": "human_cartographers"}, {"score": 0.0033641551050434663, "phrase": "manual_generalization"}, {"score": 0.0033078284621762817, "phrase": "automated_tools"}, {"score": 0.0032524418285459324, "phrase": "subjective_aspects"}, {"score": 0.0031577303835881964, "phrase": "artistic_solutions"}, {"score": 0.003027178161479457, "phrase": "research_goal"}, {"score": 0.0026445028886931837, "phrase": "different_scales"}, {"score": 0.0024097920845706795, "phrase": "formal_semantics"}, {"score": 0.002389514188569084, "phrase": "computational_geometry_techniques"}, {"score": 0.0022522565004588113, "phrase": "current_state"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Geo-information", " Generalisation", " Multiple representation"], "paper_abstract": "This paper analyses the difficulty in fulfilling the user requirements related to geo-information generalisation. Despite the fact that this is a long-standing research topic, the results are not satisfactory and therefore there is a very active research community trying to better meet the expectations of the users, both at the side of the geo-information producers and at the side of the geo-information users. It is argued that part of the difficulties are due to the fact that the generalization problem is not specified formally enough. Therefore, currently the most important benchmark for the generalization software is the work of human cartographers doing manual generalization, supported by automated tools, and includes subjective aspects such as taste, resulting into artistic solutions. So, a very important, intermediate, research goal is formalizing the generalization problem. In addition, the expectations of the users are growing over the past years and will continue to do so in the future: faster updates propagated between different scales, ever growing size of geo-information, support for vario-scale (instead of just multiple fixed scales), integration of formal semantics and computational geometry techniques, support for 3D representations, and so on. This paper identifies the current state of the art and provides descriptions of further research and development directions in generalisation. (C) 2009 Elsevier Ltd. All rights reserved.", "paper_title": "Research and development in geo-information generalisation and multiple representation", "paper_id": "WOS:000270629200001"}