{"auto_keywords": [{"score": 0.04765800550365484, "phrase": "computer_science"}, {"score": 0.00481495049065317, "phrase": "information_retrieval"}, {"score": 0.004768378525561471, "phrase": "general_concept"}, {"score": 0.004476399615305783, "phrase": "information_access_community"}, {"score": 0.004270888854681611, "phrase": "complex_algorithms"}, {"score": 0.004257067039134535, "phrase": "statistical_machine_learning"}, {"score": 0.004243289764306128, "phrase": "artificial_intelligence"}, {"score": 0.004101281992566145, "phrase": "detailed_analysis"}, {"score": 0.0040880068197266285, "phrase": "existing_credibility_models"}, {"score": 0.004074774440618106, "phrase": "different_information"}, {"score": 0.004061584718427419, "phrase": "research_areas"}, {"score": 0.003925633992809873, "phrase": "different_aspects"}, {"score": 0.0038750439121298503, "phrase": "different_types"}, {"score": 0.0038624981944755813, "phrase": "textual_content"}, {"score": 0.0035501395640663786, "phrase": "quartic_decomposition"}, {"score": 0.003453584878128719, "phrase": "information_source"}, {"score": 0.003387008569794464, "phrase": "equal_partners"}, {"score": 0.003289534854212415, "phrase": "second_half"}, {"score": 0.0032471155306148126, "phrase": "access_points"}, {"score": 0.003210446135114967, "phrase": "research_interests"}, {"score": 0.0031845067058084583, "phrase": "general_research_directions"}, {"score": 0.0031485421129798996, "phrase": "credibility_assessment"}, {"score": 0.0031383410838018953, "phrase": "human_consumers"}, {"score": 0.0030430596753594206, "phrase": "smaller_section"}, {"score": 0.0029126002350975634, "phrase": "domain-specific_credibility"}, {"score": 0.0029031614127920232, "phrase": "social_media_credibility"}, {"score": 0.0028890603352364273, "phrase": "multimedia_credibility"}, {"score": 0.002751751956416832, "phrase": "last_section"}, {"score": 0.0026337482179592422, "phrase": "data_creators"}, {"score": 0.0026039874307852346, "phrase": "particular_importance"}, {"score": 0.002436289099444074, "phrase": "open_research_direction"}, {"score": 0.00241658945942583, "phrase": "future_exploration"}, {"score": 0.002393159536161896, "phrase": "additional_help"}, {"score": 0.00235843888868088, "phrase": "existing_test_collections"}, {"score": 0.0022830706430588482, "phrase": "organised_and_comprehensive_reference_guide"}, {"score": 0.002224510044064184, "phrase": "final_answer"}, {"score": 0.0021745003291048356, "phrase": "relatively_limited_scope"}, {"score": 0.002163930783583212, "phrase": "exact_science"}, {"score": 0.0021049977753042253, "phrase": "social_sciences"}], "paper_keywords": [""], "paper_abstract": "Credibility, as the general concept covering trustworthiness and expertise, but also quality and reliability, is strongly debated in philosophy, psychology, and sociology, and its adoption in computer science is therefore fraught with difficulties. Yet its importance has grown in the information access community because of two complementing factors: on one hand, it is relatively difficult to precisely point to the source of a piece of information, and on the other hand, complex algorithms, statistical machine learning, artificial intelligence, make decisions on behalf of the users, with little oversight from the users themselves. This survey presents a detailed analysis of existing credibility models from different information seeking research areas, with focus on the Web and its pervasive social component. It shows that there is a very rich body of work pertaining to different aspects and interpretations of credibility, particularly for different types of textual content (e.g., Web sites, blogs, tweets), but also to other modalities (videos, images, audio) and topics (e.g., health care). After an introduction placing credibility in the context of other sciences and relating it to trust, we argue for a quartic decomposition of credibility: expertise and trustworthiness, well documented in the literature and predominantly related to information source, and quality and reliability, raised to the status of equal partners because the source is often impossible to detect, and predominantly related to the content. The second half of the survey provides the reader with access points to the literature, grouped by research interests. Section 3 reviews general research directions: the factors that contribute to credibility assessment in human consumers of information; the models used to combine these factors; the methods to predict credibility. A smaller section is dedicated to informing users about the credibility learned from the data. Sections 4, 5, and 6 go further into details, with domain-specific credibility, social media credibility, and multimedia credibility, respectively. While each of them is best understood in the context of Sections 1 and 2, they can be read independently of each other. The last section of this survey addresses a topic not commonly considered under \"credibility\": the credibility of the system itself, in-dependent of the data creators. This is a topic of particular importance in domains where the user is professionally motivated and where there are no concerns about the credibility of the data (e.g., e-discovery and patent search). While there is little explicit work in this direction, we argue that this is an open research direction that is worthy of future exploration. Finally, as an additional help to the reader, an appendix lists the existing test collections that cater specifically to some aspect of credibility. Overall, this review will provide the reader with an organised and comprehensive reference guide to the state of the art and the problems at hand, rather than a final answer to the question of what credibility is for computer science. Even within the relatively limited scope of an exact science, such an answer is not possible for a concept that is itself widely debated in philosophy and social sciences.", "paper_title": "Credibility in Information Retrieval", "paper_id": "WOS:000368921200001"}