{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "pharmaceutical_drugs"}, {"score": 0.04942444706912143, "phrase": "reduced_renal_function"}, {"score": 0.04232260104958791, "phrase": "primary_care"}, {"score": 0.004417848254181138, "phrase": "clinical_decision_support_system"}, {"score": 0.0041666157975446564, "phrase": "electronic_health_record_system"}, {"score": 0.003667925754747227, "phrase": "cdss."}, {"score": 0.0033651019362620866, "phrase": "impaired_renal_function"}, {"score": 0.0033190180867511605, "phrase": "better_understanding"}, {"score": 0.0032622968443364888, "phrase": "time_saving"}, {"score": 0.0032287289440915187, "phrase": "calculated_glomerular_filtration_rate"}, {"score": 0.0031626225189867354, "phrase": "dosing_recommendation_classification"}, {"score": 0.003097865379563127, "phrase": "recommendation_texts"}, {"score": 0.0030135741897058844, "phrase": "lesser_extent"}, {"score": 0.002841971477743441, "phrase": "global_assessment"}, {"score": 0.0028127197233301744, "phrase": "cdss"}, {"score": 0.00271735110571002, "phrase": "limited_extent"}, {"score": 0.0024333239726872604, "phrase": "real-time_cdss"}, {"score": 0.002408265305704217, "phrase": "kidney-related_drug_prescribing"}, {"score": 0.0023670716500937667, "phrase": "outpatient_settings"}, {"score": 0.0022476609946536345, "phrase": "drug_prescribing"}, {"score": 0.0021864526544323184, "phrase": "renal_insufficiency"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ireland_ltd."}], "paper_keywords": ["Clinical decision support system", " Renal failure", " Knowledge base", " Order entry system", " Adverse events"], "paper_abstract": "Objectives: To develop and verify proof of concept for a clinical decision support system (CDSS) to support prescriptions of pharmaceutical drugs in patients with reduced renal function, integrated in an electronic health record system (EHR) used in both hospitals and primary care. Methods: A pilot study in one geriatric clinic, one internal medicine admission ward and two outpatient healthcare centers was evaluated with a questionnaire focusing on the usefulness of the CDSS. The usage of the system was followed in a log. Results: The CDSS is considered to increase the attention on patients with impaired renal function, provides a better understanding of dosing and is time saving. The calculated glomerular filtration rate (eGFR) and the dosing recommendation classification were perceived useful while the recommendation texts and background had been used to a lesser extent. Discussion: Few previous systems are used in primary care and cover this number of drugs. The global assessment of the CDSS scored high but some elements were used to a limited extent possibly due to accessibility or that texts were considered difficult to absorb. Choosing a formula for the calculation of eGFR in a CDSS may be problematic. Conclusions: A real-time CDSS to support kidney-related drug prescribing in both hospital and outpatient settings is valuable to the physicians. It has the potential to improve quality of drug prescribing by increasing the attention on patients with renal insufficiency and the knowledge of their drug dosing. (C) 2015 Elsevier Ireland Ltd. All rights reserved.", "paper_title": "A health record integrated clinical decision support system to support prescriptions of pharmaceutical drugs in patients with reduced renal function: Design, development and proof of concept", "paper_id": "WOS:000352805000001"}