{"auto_keywords": [{"score": 0.04455442320959089, "phrase": "gene_classes"}, {"score": 0.01061240893904498, "phrase": "gct"}, {"score": 0.007104434308402199, "phrase": "null_distributions"}, {"score": 0.004737201825299411, "phrase": "statistical_approach"}, {"score": 0.004641770842098217, "phrase": "functionally_predefined_classes"}, {"score": 0.004384623928442369, "phrase": "gene_class"}, {"score": 0.004313793774439379, "phrase": "null_distribution"}, {"score": 0.003912112659326054, "phrase": "relative_strength"}, {"score": 0.003680212979775528, "phrase": "statistical_significance"}, {"score": 0.0032567057896906314, "phrase": "permuting_gene_labels"}, {"score": 0.0030386598795433474, "phrase": "five_statistics"}, {"score": 0.0030017207229983385, "phrase": "diabetes_dataset"}, {"score": 0.0029291801502381513, "phrase": "breast_cancer_dataset"}, {"score": 0.002539550974361945, "phrase": "one-sided_and_two-sided_hypotheses"}, {"score": 0.0021396386320044172, "phrase": "supplementary_data"}, {"score": 0.002105029120957278, "phrase": "bioinformatics"}], "paper_keywords": [""], "paper_abstract": "Motivation: Gene class testing (GCT) is a statistical approach to determine whether some functionally predefined classes of genes express differently under two experimental conditions. GCT computes the P-value of each gene class based on the null distribution and the gene classes are ranked for importance in accordance with their P-values. Currently, two null hypotheses have been considered: the Q1 hypothesis tests the relative strength of association with the phenotypes among the gene classes, and the Q2 hypothesis assesses the statistical significance. These two hypotheses are related but not equivalent. Method: We investigate three one-sided and two two-sided test statistics under Q1 and Q2. The null distributions of gene classes under Q1 are generated by permuting gene labels and the null distributions under Q2 are generated by permuting samples. Results: We applied the five statistics to a diabetes dataset with 143 gene classes and to a breast cancer dataset with 508 GO ( Gene Ontology) terms. In each statistic, the null distributions of the gene classes under Q1 are different from those under Q2 in both datasets, and their rankings can be different too. We clarify the one-sided and two-sided hypotheses, and discuss some issues regarding the Q1 and Q2 hypotheses for gene class ranking in the GCT. Because Q1 does not deal with correlations among genes, we prefer test based on Q2. Contact: jchen@nctr.fda.gov Supplementary information: Supplementary data are available at Bioinformatics online.", "paper_title": "Significance analysis of groups of genes in expression profiling studies", "paper_id": "WOS:000249818300010"}