{"auto_keywords": [{"score": 0.04721670078607643, "phrase": "recognition_accuracy"}, {"score": 0.010174216289399539, "phrase": "test_data"}, {"score": 0.007560937764278405, "phrase": "recognition_rate"}, {"score": 0.005674740510911773, "phrase": "training_and_test_data"}, {"score": 0.00481495049065317, "phrase": "pca_based_human_face_recognition_methods"}, {"score": 0.004631335513513859, "phrase": "pca_based_eigenface_method"}, {"score": 0.004571692719970733, "phrase": "face_recognition_system"}, {"score": 0.004425909662226326, "phrase": "orl_database"}, {"score": 0.004354763128496983, "phrase": "cmu_databases"}, {"score": 0.004284755353695709, "phrase": "main_goal"}, {"score": 0.004148084083511323, "phrase": "eigenface_based_face_recognition"}, {"score": 0.004028796143006953, "phrase": "eigenface_features"}, {"score": 0.0034145918296403874, "phrase": "facial_expression"}, {"score": 0.003210446135114967, "phrase": "aligned_images"}, {"score": 0.00318967782444942, "phrase": "non-aligned_images"}, {"score": 0.0031690434364310435, "phrase": "bright_and_dark_image"}, {"score": 0.0026681761480139067, "phrase": "covariance_matrix"}, {"score": 0.002642371473166127, "phrase": "pca"}, {"score": 0.002492304461447016, "phrase": "different_affect"}, {"score": 0.0022390081666133627, "phrase": "facial_images"}, {"score": 0.0021534125023440895, "phrase": "minimal_effect"}, {"score": 0.0021049977753042253, "phrase": "great_impact"}], "paper_keywords": ["Face recognition", " Principle component analysis (PCA)", " Eigenface", " Covariance matrix", " Face database"], "paper_abstract": "In this work, we use the PCA based eigenface method to build a face recognition system that have recognition accuracy more than 97% for the ORL database and 100% for the CMU databases. However, the main goal of this research is to identify the characteristics of eigenface based face recognition while, (1) the number of eigenface features or signatures in the training and test data is varied; (2) the amount of noise in the training and test data is varied; (3) the level of blurriness in the training and test data is varied; (4) the image size in the training and test data is varied; (5) the variations in facial expression, pose and illumination are incorporated in the training and test data; and (6) different databases with different characteristic for example with aligned images and non-aligned images, bright and dark image are used. We have observed that, (1) in general the increase of the number of signatures on images increases the recognition rate, however, the recognition rate saturates after a certain amount of increase; (2) the increase in the number of samples used in the calculation of covariance matrix in the PCA increases the recognition accuracy for a given number of individuals to identify; (3) the increase in noise and blurriness have different affect on the recognition accuracy; (4) the reduction in image-size has very minimal effect on the recognition accuracy; (5) if less number of individuals are supposed to be recognized then the recognition accuracy increases; (6) alignment of the facial images increases recognition accuracy; and (7) expression and pose have minimal effect on the recognition rate while illumination has great impact on the recognition accuracy.", "paper_title": "Performance evaluation and comparison of PCA Based human face recognition methods for distorted images", "paper_id": "WOS:000209203400004"}