{"auto_keywords": [{"score": 0.03563291592876187, "phrase": "np"}, {"score": 0.008713935193262818, "phrase": "polynomial_time"}, {"score": 0.00481495049065317, "phrase": "closed_trails"}, {"score": 0.004791189907641631, "phrase": "edge-colored_graphs"}, {"score": 0.004685703163787411, "phrase": "algorithmic_perspective"}, {"score": 0.004662577395989494, "phrase": "different_questions"}, {"score": 0.004537401559396022, "phrase": "c-edge-colored_graph"}, {"score": 0.00437208164450981, "phrase": "pec_closed_trail_subgraph"}, {"score": 0.004140401015393189, "phrase": "interesting_related_problems"}, {"score": 0.004079365275411718, "phrase": "subset_s"}, {"score": 0.003911253966141701, "phrase": "s-restricted_vertex"}, {"score": 0.0035249212996297332, "phrase": "pec_s-t_trail"}, {"score": 0.0032887360307856635, "phrase": "pec_cycles"}, {"score": 0.002927214105495953, "phrase": "strong_sense"}, {"score": 0.0028911669203979156, "phrase": "maximum_degree"}, {"score": 0.00284144327003055, "phrase": "approximation_algorithm"}, {"score": 0.0028203950416405585, "phrase": "k_vertex"}, {"score": 0.0025541693207036167, "phrase": "optimal_solution"}, {"score": 0.0024916260764216752, "phrase": "exactly_one_pec_s-t_path"}, {"score": 0.002406623920199754, "phrase": "abouelaoualim"}, {"score": 0.0022675820982741347, "phrase": "arbitrary_c-edge-colored_graph"}, {"score": 0.002157857111130435, "phrase": "different_colors"}, {"score": 0.0021049977753042253, "phrase": "related_problems"}], "paper_keywords": ["Edge-colored graphs", " properly edge-colored closed trails and cycles", " properly edge-colored paths and trails", " monochromatic paths"], "paper_abstract": "In this paper we deal from an algorithmic perspective with different questions regarding properly edge-colored (or PEC) paths, trails and closed trails. Given a c-edge-colored graph G(c), we show how to polynomially determine, if any, a PEC closed trail subgraph whose number of visits at each vertex is specified before hand. As a consequence, we solve a number of interesting related problems. For instance, given subset S of vertices in G(c), we show how to maximize in polynomial time the number of S-restricted vertex (resp., edge) disjoint PEC paths (resp., trails) in G(c) with endpoints in S. Further, if G(c) contains no PEC closed trails, we show that the problem of finding a PEC s-t trail visiting a given subset of vertices can be solved in polynomial time and prove that it becomes NP-complete if we are restricted to graphs with no PEC cycles. We also deal with graphs G(c) containing no (almost) PEC cycles or closed trails through s or t. We prove that finding 2 PEC s-t paths (resp., trails) with length at most L > 0 is NP-complete in the strong sense even for graphs with maximum degree equal to 3 and present an approximation algorithm for computing k vertex (resp., edge) disjoint PEC s-t paths (resp., trails) so that the maximum path (resp., trail) length is no more than k times the PEC path (resp., trail) length in an optimal solution. Further, we prove that finding 2 vertex disjoint s-t paths with exactly one PEC s-t path is NP-complete. This result is interesting since as proved in Abouelaoualim et. al.(2008), the determination of two or more vertex disjoint PEC s-t paths can be done in polynomial time. Finally, if G(c) is an arbitrary c-edge-colored graph with maximum vertex degree equal to four, we prove that finding two monochromatic vertex disjoint s-t paths with different colors is NP-complete. We also propose some related problems.", "paper_title": "On paths, trails and closed trails in edge-colored graphs", "paper_id": "WOS:000309388600006"}