{"auto_keywords": [{"score": 0.010753740340665993, "phrase": "future_pattern"}, {"score": 0.010025429078250646, "phrase": "present_state"}, {"score": 0.00481495049065317, "phrase": "mental_states"}, {"score": 0.004695183699894267, "phrase": "major_role"}, {"score": 0.004288059466938456, "phrase": "common_principles"}, {"score": 0.004077272409331917, "phrase": "cognitive_and_noncognitive_disciplines"}, {"score": 0.003995876175614403, "phrase": "cognitive_science"}, {"score": 0.0038379074449947067, "phrase": "computer_science_and_biology"}, {"score": 0.0036491673002304326, "phrase": "temporal_factorisation_principle"}, {"score": 0.0034003686971964707, "phrase": "temporal_relationship"}, {"score": 0.002937493907103812, "phrase": "'present_state"}, {"score": 0.0027370835853738626, "phrase": "future_pattern'_relationship"}, {"score": 0.002524688179363081, "phrase": "conceptual_framework"}, {"score": 0.0021917966722180132, "phrase": "cognitive_states"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b._v."}], "paper_keywords": [""], "paper_abstract": "Dynamics play a major role in many phenomena, addressed in a variety of disciplines. This paper contributes to the identification of common principles underlying approaches to dynamics used within a variety of cognitive and noncognitive disciplines, such as Cognitive Science, Physics, Mathematics, Chemistry, Computer Science and Biology. More specifically, as a central, unifying principle, the temporal factorisation principle is introduced, formalised and illustrated. This principle expresses, that every temporal relationship of the form 'past pattern implies future pattern' can be factorised into a relationship of the form 'past pattern implies present state' and a relationship of the form 'present state implies future pattern'. To enable this, for every 'past pattern implies future pattern' relationship, the principle postulates the existence of certain mediating state properties in the present state. It provides a conceptual framework which unifies various approaches to dynamics within a variety of disciplines. In particular, it is shown how the principle can be applied in the case of cognitive states of agents. (c) 2006 Elsevier B. V. All rights reserved.", "paper_title": "Temporal factorisation: A unifying principle for dynamics of the world and of mental states", "paper_id": "WOS:000246295500001"}