{"auto_keywords": [{"score": 0.015719716506582538, "phrase": "context-aware_systems"}, {"score": 0.00440976345264104, "phrase": "gathered_information"}, {"score": 0.0038818006513785977, "phrase": "important_aspects"}, {"score": 0.003698442219929622, "phrase": "context_attributes"}, {"score": 0.0034319005131102495, "phrase": "mobile_devices"}, {"score": 0.0031565959573536194, "phrase": "home_care_context-aware_computing"}, {"score": 0.003007389443770562, "phrase": "permanent_fix"}, {"score": 0.002623669616798891, "phrase": "multiagent_system"}, {"score": 0.0024776677004255104, "phrase": "hoccac_multiagent_system"}, {"score": 0.0024451427672857458, "phrase": "critical_path_method-based_planning_model"}, {"score": 0.0021901485584955487, "phrase": "dangerous_or_emergency_situations"}, {"score": 0.0021049977753042253, "phrase": "alert_messages"}], "paper_keywords": ["Context-aware computing", " Home care", " Multiagent system"], "paper_abstract": "Context-aware systems are able to capture information from the context in which they are executed, assign a meaning to the gathered information, and change their behavior accordingly. As a result, the systems can offer services to users according to their individual situation within the context. This article analyzes the important aspects of context-aware computing such as capturing information for context attributes and determining the manner of interacting with users in the environment. Used in conjunction with mobile devices, context-aware systems are specifically used to improve the usability of applications and services. This article proposes the home care context-aware computing (HoCCAC) multiagent system that identifies and maintains a permanent fix on the location of patients in their home, and manages the infrastructure of services within their environment securely and reliably by processing and reasoning the data received. Based on the multiagent system, a prototype was developed to monitor patients in their home. The HoCCAC multiagent system uses a critical path method-based planning model that, in the present study, prepares the most optimal task-planning schedule for the patients in their home, is capable of reacting automatically when faced with dangerous or emergency situations, replanning any plans in progress and sending alert messages to the system. The results obtained with this prototype are presented in this article.", "paper_title": "Context-aware multiagent system: Planning home care tasks", "paper_id": "WOS:000337033900006"}