{"auto_keywords": [{"score": 0.037764691418651096, "phrase": "real-time_requirement"}, {"score": 0.02931547922617121, "phrase": "belief_rule"}, {"score": 0.027123305326435244, "phrase": "brb"}, {"score": 0.00481495049065317, "phrase": "belief-rule-based_systems"}, {"score": 0.004775466707014647, "phrase": "belief_rule_base_inference_methodology"}, {"score": 0.0043858695571251174, "phrase": "traditional_if-then_rules"}, {"score": 0.00429057323623293, "phrase": "system_parameters"}, {"score": 0.004267073067668123, "phrase": "rule_weights"}, {"score": 0.004061256614370055, "phrase": "reliable_system_simulation"}, {"score": 0.004005860884892539, "phrase": "off-line_optimization_models"}, {"score": 0.00379170322821611, "phrase": "large-scale_systems"}, {"score": 0.003739970412586941, "phrase": "recursive_algorithms"}, {"score": 0.00368894080968876, "phrase": "fine_tune"}, {"score": 0.0036687237385177713, "phrase": "brb_online"}, {"score": 0.0035399770257915466, "phrase": "earlier_mentioned_learning_algorithms"}, {"score": 0.003482083698073306, "phrase": "predetermined_structure"}, {"score": 0.0034534918227136138, "phrase": "brb."}, {"score": 0.0034251339122991094, "phrase": "complex_system"}, {"score": 0.0034063576796640603, "phrase": "prior_knowledge"}, {"score": 0.0032867878190398466, "phrase": "incomplete_or_even_inappropriate_initial_brb_structure"}, {"score": 0.003206468378606121, "phrase": "initial_brb"}, {"score": 0.0030017207229983385, "phrase": "overall_optimal_performance"}, {"score": 0.0027869214641194646, "phrase": "new_statistical_utility"}, {"score": 0.002703869368554536, "phrase": "sequential_learning_algorithm"}, {"score": 0.002395626697083963, "phrase": "rimer"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Belief rule base", " Expert system", " Evidential reasoning", " Recursive algorithm", " Utility"], "paper_abstract": "A belief rule base inference methodology using the evidential reasoning (RIMER) approach has been developed recently. A belief rule base (BRB). which can be treated as a more generalized expert system, extends traditional IF-THEN rules, but requires the assignment of some system parameters including rule weights, attribute weights, and belief degrees. These parameters need to be determined with care for reliable system simulation and prediction. Some off-line optimization models have been proposed, but it is expensive to train and re-train these models in particular for large-scale systems. Moreover, the recursive algorithms are also proposed to fine tune a BRB online. which require less calculation time and satisfy the real-time requirement. However, the earlier mentioned learning algorithms are all based on a predetermined structure of the BRB. For a complex system, prior knowledge may not be perfect, which leads to the construction of an incomplete or even inappropriate initial BRB structure. Also, too many rules in an initial BRB may lead to over fitting, whilst too few rules may result in under fitting. Consequently, such a BRB system may not be capable of achieving overall optimal performance. In this paper, we consider one realistic and important case where both a preliminary BRB structure and system parameters assigned to given rules can be adjusted online. Based on the definition of a new statistical utility for a belief rule as investigated in this paper, a sequential learning algorithm for online constructing more compact BRB systems is proposed. Compared with the other learning algorithms, a belief rule can be automatically added into the BRB or pruned from the BRB, and our algorithm can also satisfy the real-time requirement. In addition, our algorithm inherits the feature of RIMER, i.e., only partial input and output information is required, which could be either incomplete or vague, either numerical or judgmental, or mixed. In order to verify the effectiveness of the proposed algorithm. a practical case study about oil pipeline leak detection is studied and examined to demonstrate how the algorithm can be implemented. (C) 2009 Elsevier Ltd. All rights reserved.", "paper_title": "A sequential learning algorithm for online constructing belief-rule-based systems", "paper_id": "WOS:000272432300103"}