{"auto_keywords": [{"score": 0.04008926140547966, "phrase": "np"}, {"score": 0.00481495049065317, "phrase": "vertex-surjective_graph_homomorphisms"}, {"score": 0.004754447398742591, "phrase": "surjective_homomorphism_problem"}, {"score": 0.0045581828632009795, "phrase": "guest_graph"}, {"score": 0.004500891637057374, "phrase": "vertex-surjective_homomorphism"}, {"score": 0.0043150485532080065, "phrase": "bijective_and_injective_homomorphism_problems"}, {"score": 0.003916098498242888, "phrase": "surjective_variant"}, {"score": 0.0036296886647898094, "phrase": "host_graph"}, {"score": 0.0026782279715171866, "phrase": "complete_graphs"}, {"score": 0.002633355582628613, "phrase": "proper_interval_graphs"}, {"score": 0.0021049977753042253, "phrase": "vertex_cover_number"}], "paper_keywords": [""], "paper_abstract": "The Surjective Homomorphism problem is to test whether a given graph G called the guest graph allows a vertex-surjective homomorphism to some other given graph H called the host graph. The bijective and injective homomorphism problems can be formulated in terms of spanning subgraphs and subgraphs, and as such their computational complexity has been extensively studied. What about the surjective variant? Because this problem is NP-complete in general, we restrict the guest and the host graph to belong to graph classes and , respectively. We determine to what extent a certain choice of and influences its computational complexity. We observe that the problem is polynomial-time solvable if is the class of paths, whereas it is NP-complete if is the class of paths. Moreover, we show that the problem is even NP-complete on many other elementary graph classes, namely linear forests, unions of complete graphs, cographs, proper interval graphs, split graphs and trees of pathwidth at most 2. In contrast, we prove that the problem is fixed-parameter tractable in k if is the class of trees and is the class of trees with at most k leaves, or if and are equal to the class of graphs with vertex cover number at most k.", "paper_title": "Finding vertex-surjective graph homomorphisms", "paper_id": "WOS:000308722500002"}