{"auto_keywords": [{"score": 0.046353538186752134, "phrase": "interval-valued_intuitionistic_fuzzy_environment"}, {"score": 0.00481495049065317, "phrase": "group_decision_making"}, {"score": 0.004562362497952548, "phrase": "group_decision"}, {"score": 0.004096082254543022, "phrase": "different_priority_level"}, {"score": 0.0038810583785936505, "phrase": "interval-valued_intuitionistic_fuzzy_aggregation_operators"}, {"score": 0.0032716011062067286, "phrase": "aggregated_arguments"}, {"score": 0.0025892330566358503, "phrase": "proposed_operators"}, {"score": 0.002387758958649797, "phrase": "practical_example"}, {"score": 0.0023451553255837317, "phrase": "talent_introduction"}, {"score": 0.0022218413146898887, "phrase": "developed_method"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Multi-criteria group decision making", " Aggregation operator", " Intuitionistic fuzzy set", " Interval-valued intuitionistic fuzzy prioritized weighted average (IVIFPWA) operator", " Interval-valued intuitionistic fuzzy prioritized weighted geometric (IVIFPWG) operator"], "paper_abstract": "This study investigates the group decision making under interval-valued intuitionistic fuzzy environment in which the attributes and experts are in different priority level. We first propose some interval-valued intuitionistic fuzzy aggregation operators such as the interval-valued intuitionistic fuzzy prioritized weighted average (IVIFPWA) operator, the interval-valued intuitionistic fuzzy prioritized weighted geometric (IVIFPWG) operator. These proposed operators can capture the prioritization phenomenon among the aggregated arguments. Then, some of their desirable properties are investigated in detail. Furthermore, an approach to multi-criteria group decision making based on the proposed operators is given under interval-valued intuitionistic fuzzy environment. Finally, a practical example about talent introduction is provided to illustrate the developed method. (C) 2011 Elsevier B.V. All rights reserved.", "paper_title": "Interval-valued intuitionistic fuzzy prioritized operators and their application in group decision making", "paper_id": "WOS:000303274200005"}