{"auto_keywords": [{"score": 0.030383462681630863, "phrase": "representative_face"}, {"score": 0.00481495049065317, "phrase": "large-scale_news_video_datasets"}, {"score": 0.004749106104067268, "phrase": "news_video"}, {"score": 0.004671274735676484, "phrase": "challenging_task"}, {"score": 0.004620093797504386, "phrase": "huge_variations"}, {"score": 0.0045820747375409435, "phrase": "visual_appearance"}, {"score": 0.0045443671106012405, "phrase": "human_face"}, {"score": 0.00433645229352341, "phrase": "large-scale_video_datasets"}, {"score": 0.004103942174451674, "phrase": "face_retrieval"}, {"score": 0.004014452814186653, "phrase": "competitive_performances"}, {"score": 0.0038518661517315533, "phrase": "face_appearances"}, {"score": 0.003757480190200645, "phrase": "face_images"}, {"score": 0.003615217162972726, "phrase": "video_shot"}, {"score": 0.0034879261743468574, "phrase": "point_tracker"}, {"score": 0.0032287289440915187, "phrase": "common_problems"}, {"score": 0.0032021226849872054, "phrase": "flash_lights"}, {"score": 0.0031845067058084583, "phrase": "partial_occlusions"}, {"score": 0.0031150035760241705, "phrase": "news_videos"}, {"score": 0.0030808211830129304, "phrase": "second_proposal"}, {"score": 0.003038618585571397, "phrase": "efficient_approach"}, {"score": 0.0027437235598539904, "phrase": "original_face-track"}, {"score": 0.002669042572650594, "phrase": "computational_cost"}, {"score": 0.0026543514413663893, "phrase": "face-track_matching"}, {"score": 0.0025608053689544475, "phrase": "high_matching_accuracy"}, {"score": 0.002497976173193543, "phrase": "real-world_news_videos"}, {"score": 0.002337848196418384, "phrase": "trecvid_videos"}, {"score": 0.002261666793030715, "phrase": "television_news_program"}, {"score": 0.002243141227604114, "phrase": "news"}, {"score": 0.0021579641460002523, "phrase": "research_community"}, {"score": 0.0021401625519713577, "phrase": "experimental_results"}, {"score": 0.0021049977753042253, "phrase": "remarkable_balance"}], "paper_keywords": ["face-track extraction", " face-track matching", " large-scale", " news video"], "paper_abstract": "Face retrieval in news video has been identified as a challenging task due to the huge variations in the visual appearance of the human face. Although several approaches have been proposed to deal with this problem, their extremely high computational cost limits their scalability to large-scale video datasets that may contain millions of faces of hundreds of characters. In this paper, we introduce approaches for face retrieval that are scalable to such datasets while maintaining competitive performances with state-of-the-art approaches. To utilize the variability of face appearances in video, we use a set of face images called face-track to represent the appearance of a character in a video shot. Our first proposal is an approach for extracting face-tracks. We use a point tracker to explore the connections between detected faces belonging to the same character and then group them into one face-track. We present techniques to make the approach robust against common problems caused by flash lights, partial occlusions, and scattered appearances of characters in news videos. In the second proposal, we introduce an efficient approach to match face-tracks for retrieval. Instead of using all the faces in the face-tracks to compute their similarity, our approach obtains a representative face for each face-track. The representative face is computed from faces that are sampled from the original face-track. As a result, we significantly reduce the computational cost of face-track matching while taking into account the variability of faces in face-tracks to achieve high matching accuracy. Experiments are conducted on two face-track datasets extracted from real-world news videos, of such scales that have never been considered in the literature. One dataset contains 1,497 face-tracks of 41 characters extracted from 370 hours of TRECVID videos. The other dataset provides 5,567 face-tracks of 111 characters observed from a television news program (NHK News 7) over 11 years. We make both datasets publically accessible by the research community. The experimental results show that our proposed approaches achieved a remarkable balance between accuracy and efficiency.", "paper_title": "Face Retrieval in Large-Scale News Video Datasets", "paper_id": "WOS:000323236700025"}