{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "reference_frame"}, {"score": 0.004558414405811025, "phrase": "present_article"}, {"score": 0.004315487055548749, "phrase": "visually_impaired_users"}, {"score": 0.004209369306023422, "phrase": "virtual_space"}, {"score": 0.003753738096719609, "phrase": "haptically_constructed_mental_map"}, {"score": 0.0035712919163869176, "phrase": "virtual_environment"}, {"score": 0.003347259612209552, "phrase": "vertical_axis"}, {"score": 0.0030600032877646263, "phrase": "target_object"}, {"score": 0.0027557911038816256, "phrase": "totally_blind_users"}, {"score": 0.002634830238219976, "phrase": "lower_vision"}, {"score": 0.0025066304722422463, "phrase": "spatial_relationship"}, {"score": 0.002420611343093316, "phrase": "relative_frame"}, {"score": 0.002337537183727731, "phrase": "haptic_cursor"}, {"score": 0.0022799458141165587, "phrase": "limited_range"}, {"score": 0.0021474369836979048, "phrase": "longer_exploration_time"}], "paper_keywords": [""], "paper_abstract": "For the present article a haptically enhanced 3D virtual environment was created, and this study investigates how visually impaired users perceive and explain the virtual space when haptic is the only input modality. The study investigates what factors affect the use of reference frame when the users verbally express a haptically constructed mental map and how such preference corresponds to their haptic movement in the virtual environment. In the study, gravity was the most influential cue in determining a vertical axis of a frame. When the users were asked to explain the relationship between themselves and the target object, they had the tendency to use the frame they initially chose to use. It was also noted that totally blind users were more responsive to various frames than users with lower vision and were faster in determining a term to explain spatial relationship. Furthermore, people who preferred relative frame were more likely to keep the haptic cursor closer to their body. Limited range of exploration caused lack of understanding of the space, whereas longer exploration time made them use more frames.", "paper_title": "Use of Reference Frame and Movement Pattern in Haptically Enhanced 3D Virtual Environment", "paper_id": "WOS:000342443300006"}