{"auto_keywords": [{"score": 0.049699271650052154, "phrase": "gms"}, {"score": 0.030862262237607886, "phrase": "passo_a_campalto"}, {"score": 0.02957285286635227, "phrase": "first_layer"}, {"score": 0.00481495049065317, "phrase": "modflow_grid"}, {"score": 0.004729449632276146, "phrase": "transport_problem"}, {"score": 0.004691935905355025, "phrase": "complex_geological_environments"}, {"score": 0.004654718343569034, "phrase": "venetian_lagoon"}, {"score": 0.004306900491533953, "phrase": "intertidal_areas"}, {"score": 0.004188462750962044, "phrase": "lagoon"}, {"score": 0.0038985814421614797, "phrase": "vegetated_areas"}, {"score": 0.0038522499341324267, "phrase": "organic-rich_clays"}, {"score": 0.003716520760680603, "phrase": "sand_dykes"}, {"score": 0.0035358770665604657, "phrase": "continuous_hydrogeologic_network"}, {"score": 0.003459191419478298, "phrase": "vascular_system"}, {"score": 0.0034248843975069727, "phrase": "whole_\"barena\"_deposits"}, {"score": 0.0032196218058843477, "phrase": "geologic_complexity"}, {"score": 0.0031623597701304733, "phrase": "numerical_models"}, {"score": 0.0031434989259718576, "phrase": "remediation_efforts"}, {"score": 0.003075296862372287, "phrase": "off-the-shelf_graphical_interface"}, {"score": 0.002955050521440921, "phrase": "calibrated_usgs-modflow_model"}, {"score": 0.00286795254228461, "phrase": "gms_graphical_interface"}, {"score": 0.0027284410545226306, "phrase": "thickness_distribution"}, {"score": 0.0026798913437949584, "phrase": "barena_deposit"}, {"score": 0.002554596573764743, "phrase": "fortran_routine"}, {"score": 0.0024644754672360045, "phrase": "additional_necessary_information"}, {"score": 0.0022304376732144157, "phrase": "adequate_plotting_software"}, {"score": 0.0022172358360187565, "phrase": "matlab"}, {"score": 0.0022038868515068676, "phrase": "conceptual_and_numerical_models"}, {"score": 0.0021907299375981356, "phrase": "elaborate_graphical_interface"}, {"score": 0.002156026732527872, "phrase": "complex_problems"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["TOUGH2 community", " Groundwater flow", " Multicomponent flow", " Contaminant transport", " Complex geology"], "paper_abstract": "The tides of the Venetian Lagoon generally vary between -0.5 and +0.7 m asl. Occasionally, they may reach a maximum of 1.5 m (acqua alta) and a minimum of -0.8 m asl (acqua bassa). Intertidal areas, called \"barene,\" exist all along the coast of the Lagoon. These areas are characterized by canals that concentrate the flow of water (and the deposition of sands) during the rising and waning of the tides, and that inundate and drain the vegetated areas found between canals (where organic-rich clays are deposited). Therefore, since the area is subject to subsidence, in time, sand dykes (the original canals) become juxtaposed to clayey dykes (the original vegetated areas). In addition, the sands form a continuous hydrogeologic network within the clays, very similar to that of a vascular system that effectively drains the whole \"barena\" deposits. In order to be effective, measures for monitoring, confining, or remediating the transport of pollutants through this kind of environment must explicitly take into account the geologic complexity. The same complexity must be included in the numerical models that support remediation efforts. At the moment, there appears to be no off-the-shelf graphical interface that is able to manage such complexity for TOUGH2. To attempt to solve this problem we have used a calibrated USGS-MODFLOW model, of the barena of \"Passo a Campalto\" in the Venetian Lagoon, developed with the GMS graphical interface. The model is made of 42 layers, which, apart from the first layer, are 0.5 m thick; the first layer has the thickness distribution of a dump found on top of the barena deposit at Passo a Campalto. Each layer consists of 100 x 60 square cells, for a total of 252,000 cells, only about half of which are active. Using a FORTRAN routine, we translate this grid, with all the hydrogeologic boundary conditions, into a TOUGH2 input file, and we provide the additional necessary information for running a TOUGH2 simulation. The results are promising, in that we were able to produce TOUGH2 grids with very complex geology and to run the models with success. For visualization, the results can be imported back into GMS as 3D scatter point sets, or they can be plotted with any adequate plotting software such as MatLab. Developing conceptual and numerical models with an elaborate graphical interface such as GMS effectively allows setting up complex problems while concentrating on their physics. (C) 2011 Published by Elsevier Ltd.", "paper_title": "Using a MODFLOW grid, generated with GMS, to solve a transport problem with TOUGH2 in complex geological environments: The intertidal deposits of the Venetian Lagoon", "paper_id": "WOS:000292352100009"}