{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "citation_networks"}, {"score": 0.013555607191602705, "phrase": "referencing_pattern"}, {"score": 0.004733791336312872, "phrase": "authors'_visibility"}, {"score": 0.0038467574225322086, "phrase": "topological_features"}, {"score": 0.003593623872399777, "phrase": "content_similarity"}, {"score": 0.003345680943026579, "phrase": "varying_importance"}, {"score": 0.003222687723450745, "phrase": "additional_factors"}, {"score": 0.0026449626324264275, "phrase": "artificial_citation_networks"}, {"score": 0.002538996868327341, "phrase": "twice_the_fitness_value"}, {"score": 0.0024623110626032364, "phrase": "double_probability"}, {"score": 0.002331641523873951, "phrase": "larger_fitness"}, {"score": 0.002292243761395491, "phrase": "slightly_higher_values"}, {"score": 0.002261204313587616, "phrase": "control_network"}, {"score": 0.002200377880796801, "phrase": "drastic_effect"}, {"score": 0.0021484955960643167, "phrase": "smaller_fitness"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Scientometry", " h-Index", " Citation networks", " Complex networks", " Network model"], "paper_abstract": "Various factors are believed to govern the selection of references in citation networks, but a precise, quantitative determination of their importance has remained elusive. In this paper, we show that three factors can account for the referencing pattern of citation networks for two topics, namely \"graphenes\" and \"complex networks\", thus allowing one to reproduce the topological features of the networks built with papers being the nodes and the edges established by citations. The most relevant factor was content similarity, while the other two - in-degree (i.e. citation counts) and age of publication - had varying importance depending on the topic studied. This dependence indicates that additional factors could play a role. Indeed, by intuition one should expect the reputation (or visibility) of authors and/or institutions to affect the referencing pattern, and this is only indirectly considered via the in-degree that should correlate with such reputation. Because information on reputation is not readily available, we simulated its effect on artificial citation networks considering two communities with distinct fitness (visibility) parameters. One community was assumed to have twice the fitness value of the other, which amounts to a double probability for a paper being cited. While the h-index for authors in the community with larger fitness evolved with time with slightly higher values than for the control network (no fitness considered), a drastic effect was noted for the community with smaller fitness. (C) 2012 Elsevier Ltd. All rights reserved.", "paper_title": "Three-feature model to reproduce the topology of citation networks and the effects from authors' visibility on their h-index", "paper_id": "WOS:000303660100009"}