{"auto_keywords": [{"score": 0.042664382141952804, "phrase": "log-sine_integrals"}, {"score": 0.00929925579539291, "phrase": "multiple_mahler_measures"}, {"score": 0.007172058849853151, "phrase": "mahler_measures"}, {"score": 0.00481495049065317, "phrase": "mahler_measure"}, {"score": 0.004013662619667083, "phrase": "systematic_evaluations"}, {"score": 0.003496868378204657, "phrase": "polylogarithmic_values"}, {"score": 0.0033617891884360606, "phrase": "related_generating_functions"}, {"score": 0.0031532895341013297, "phrase": "uniform_random_walks"}, {"score": 0.003031457881972254, "phrase": "pearson"}, {"score": 0.002986969236641105, "phrase": "main_results"}, {"score": 0.002843372121209168, "phrase": "n-step_walk"}, {"score": 0.0027605398374811667, "phrase": "corresponding_probability_density_functions"}, {"score": 0.0026538282523433684, "phrase": "derivative_values"}, {"score": 0.002416589459425828, "phrase": "frequent_use"}, {"score": 0.0023811153883132536, "phrase": "new_nist_handbook_of_mathematical_functions"}, {"score": 0.002357755095722877, "phrase": "similar_tools"}, {"score": 0.0022443390559699974, "phrase": "numeric_and_symbolic_computing"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": [""], "paper_abstract": "The Mahler measure of a polynomial in several variables has been a subject of much study over the past thirty years - very few closed forms are proven but more are conjectured. In the case of multiple Mahler measures more tractable but interesting families exist. Using values of log-sine integrals we provide systematic evaluations of various higher and multiple Mahler measures. The evaluations in terms of log-sine integrals become particularly useful in light of the fact that log-sine integrals may be automatically reexpressed as polylogarithmic values. We present this correspondence along with related generating functions for log-sine integrals. Our initial interest in considering Mahler measures stems from a study of uniform random walks in the plane as first introduced by Pearson. The main results on the moments of the distance traveled by an n-step walk, as well as the corresponding probability density functions, are reviewed. It is the derivative values of the moments that are Mahler measures. This work would be impossible without very extensive symbolic and numeric computations. It also makes frequent use of the new NIST Handbook of Mathematical Functions and similar tools. Our intention is to show off the interplay between numeric and symbolic computing while exploring the three mathematical topics in the title. (c) 2012 Elsevier B.V. All rights reserved.", "paper_title": "Mahler measures, short walks and log-sine integrals", "paper_id": "WOS:000317320400002"}