{"auto_keywords": [{"score": 0.03019122365647808, "phrase": "maximum_degree"}, {"score": 0.00481495049065317, "phrase": "asynchronous_oblivious_robots"}, {"score": 0.0047103751935235975, "phrase": "algorithmic_limitations"}, {"score": 0.004520351823685038, "phrase": "minimal_capabilities"}, {"score": 0.004361849721579647, "phrase": "commonly_used_models"}, {"score": 0.0043379621501040775, "phrase": "asynch"}, {"score": 0.004302371600216303, "phrase": "autonomous_mobile_robots"}, {"score": 0.004255371088912042, "phrase": "visibility_sensors"}, {"score": 0.0041287394089001405, "phrase": "look-compute-move_cycles"}, {"score": 0.003802135020791801, "phrase": "previous_cycles"}, {"score": 0.0036687237385177713, "phrase": "anonymous_and_unlabeled_graph"}, {"score": 0.003549718733070464, "phrase": "finite_time"}, {"score": 0.003415732938641525, "phrase": "quiescent_state"}, {"score": 0.0033876840265189352, "phrase": "complexity_measure"}, {"score": 0.003171401739614199, "phrase": "arbitrary_tree"}, {"score": 0.0031367173902609887, "phrase": "unexpected_results"}, {"score": 0.002936410533329336, "phrase": "n-node_trees"}, {"score": 0.00236289633510808, "phrase": "tree_exploration"}, {"score": 0.002193709940555188, "phrase": "non-trivial_automorphisms"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v._all_rights"}], "paper_keywords": ["Mobile agent", " Robot", " Oblivious", " Asynchronous", " Tree", " Exploration"], "paper_abstract": "In an effort to understand the algorithmic limitations of computing by a swarm of robots, the research has focused on the minimal capabilities that allow a problem to be solved. The weakest of the commonly used models is ASYNCH where the autonomous mobile robots, endowed with visibility sensors (but otherwise unable to communicate), operate in Look-Compute-Move cycles performed asynchronously for each robot. The robots are often assumed (or required to be) oblivious: they keep no memory of observations and computations made in previous cycles. We consider the setting when the robots are dispersed in an anonymous and unlabeled graph, and they must perform the very basic task of exploration: within finite time every node must be visited by at least one robot and the robots must enter a quiescent state. The complexity measure of a solution is the number of robots used to perform the task. We study the case when the graph is an arbitrary tree and establish some unexpected results. We first prove that, in general, exploration cannot be done efficiently. More precisely we prove that there are n-node trees where Omega(n) robots are necessary; this holds even if the maximum degree is 4. On the other hand, we show that if the maximum degree is 3, it is possible to explore with only O(log n/log log n) robots. The proof of the result is constructive. We also prove that the size of the team used in our solution is asymptotically optimal: there are trees of degree 3, whose exploration requires Omega(log n/log log n) robots. Our final result shows that the difficulty in tree exploration comes in fact from the symmetries of the tree. Indeed, we show that, in order to explore trees that do not have any non-trivial automorphisms, 4 robots are always sufficient and often necessary. (C) 2010 Elsevier B.V. All rights reserved.", "paper_title": "Remembering without memory: Tree exploration by asynchronous oblivious robots", "paper_id": "WOS:000275934200005"}