{"auto_keywords": [{"score": 0.030380342465994248, "phrase": "intervention_group"}, {"score": 0.014708419421744936, "phrase": "telemedicine_applications"}, {"score": 0.012138725433614118, "phrase": "cancer_patients"}, {"score": 0.00481495049065317, "phrase": "telemedicine_system"}, {"score": 0.004739416327250269, "phrase": "neck_cancer_patients"}, {"score": 0.004610058444728656, "phrase": "postoperative_period"}, {"score": 0.0035507457285983268, "phrase": "prospective_controlled_trial"}, {"score": 0.0034674164050273568, "phrase": "telemedicine_application"}, {"score": 0.003042752533935891, "phrase": "neck_cancer"}, {"score": 0.0030068193773923387, "phrase": "erasmus_mc"}, {"score": 0.0027999339042953076, "phrase": "electronic_health_information_support_system"}, {"score": 0.002546002312015341, "phrase": "control_group"}, {"score": 0.0022250978492127163, "phrase": "five_quality_of_life_parameters"}, {"score": 0.0021049977753042253, "phrase": "sparse_evidence"}], "paper_keywords": [""], "paper_abstract": "Objectives: Telemedicine applications carry the potential to enhance the quality of life of patients, but studies evaluating telemedicine applications are still scarce. The evidence regarding the effectiveness of telemedicine is limited and not yet conclusive. This study investigated whether telemedicine could be beneficial to the quality of life of cancer patients. Design and Measurements: Between 1999 and 2002, we conducted a prospective controlled trial evaluating the effects of a telemedicine application on the quality of life of patients with cancer involving the head and neck, using quality of life questionnaires that covered 22 quality of life parameters. All patients had undergone surgery for head and neck cancer at the Erasmus MC, a tertiary university hospital in The Netherlands. Patients in the intervention group were given access to an electronic health information support system for a period of six weeks, starting at discharge from the hospital. Results: In total, we included 145 patients in the control group and 39 in the intervention group. At 6 weeks, the end of the intervention, the intervention group had significantly improved QoL in 5 of the 22 studied parameters. Only one of these five quality of life parameters remained significantly different at 12 weeks. Conclusions: This study adds to the sparse evidence that telemedicine may be beneficial for the quality of life of cancer patients.", "paper_title": "Impact on quality of life of a telemedicine system supporting head and neck cancer patients: A controlled trial during the postoperative period at home", "paper_id": "WOS:000245562600008"}