{"auto_keywords": [{"score": 0.048970045726729895, "phrase": "different_color_spaces"}, {"score": 0.0048151950376914485, "phrase": "k-"}, {"score": 0.004183137595671171, "phrase": "simpler_partition_models"}, {"score": 0.003591627288993743, "phrase": "k-means"}, {"score": 0.0035288860880035985, "phrase": "clustering_technique"}, {"score": 0.0034673190692473903, "phrase": "input_image"}, {"score": 0.0032697235411641695, "phrase": "segmentation_maps"}, {"score": 0.003212663446866794, "phrase": "final_clustering_procedure"}, {"score": 0.0031565959573536194, "phrase": "input_features"}, {"score": 0.003101503914610488, "phrase": "local_histogram"}, {"score": 0.00304737045343781, "phrase": "class_labels"}, {"score": 0.0028069426877159642, "phrase": "fusion_framework"}, {"score": 0.002339771435910601, "phrase": "berkeley_image_database"}, {"score": 0.0021049977753042253, "phrase": "state-of-the-art_segmentation_methods"}], "paper_keywords": ["Berkeley image database", " color spaces", " fusion of segmentations", " K-means clustering", " textured image segmentation"], "paper_abstract": "This paper presents a new, simple, and efficient segmentation approach, based on a fusion procedure which aims at combining several segmentation maps associated to simpler partition models in order to finally get a more reliable and accurate segmentation result. The different label fields to be fused in our application are given by the same and simple (K-means based) clustering technique on an input image expressed in different color spaces. Our fusion strategy aims at combining these segmentation maps with a final clustering procedure using as input features, the local histogram of the class labels, previously estimated and associated to each site and for all these initial partitions. This fusion framework remains simple to implement, fast, general enough to be applied to various computer vision applications (e.g., motion detection and segmentation), and has been successfully applied on the Berkeley image database. The experiments herein reported in this paper illustrate the potential of this approach compared to the state-of-the-art segmentation methods recently proposed in the literature.", "paper_title": "Segmentation by fusion of histogram-based K-means clusters in different color spaces", "paper_id": "WOS:000254889700013"}