{"auto_keywords": [{"score": 0.038749692047715355, "phrase": "mapping_transformation"}, {"score": 0.006524817736641803, "phrase": "parametric_form"}, {"score": 0.00481495049065317, "phrase": "image_registration"}, {"score": 0.004579780586951551, "phrase": "existing_image_registration_methods"}, {"score": 0.004374267836149339, "phrase": "feature-based_methods"}, {"score": 0.004319830179921363, "phrase": "relevant_image_features"}, {"score": 0.004230595706156783, "phrase": "geometrical_transformation"}, {"score": 0.003924284136338428, "phrase": "image_features"}, {"score": 0.003859273279966873, "phrase": "challenging_and_time-consuming_process"}, {"score": 0.0035947360742084253, "phrase": "observed_image_intensities"}, {"score": 0.0028926147550022607, "phrase": "continuous_bivariate_function"}, {"score": 0.002762601646452813, "phrase": "novel_intensity-based_image_registration_method"}, {"score": 0.0021857667493036786, "phrase": "discontinuous_function"}, {"score": 0.00216755493625594, "phrase": "numerical_examples"}], "paper_keywords": ["Degeneration", " discontinuity", " edge detection", " local smoothing", " mapping", " nonparametric transformation", " weighted least squares estimation"], "paper_abstract": "Image registration is used widely in applications for mapping one image to another. Existing image registration methods are either feature-based or intensity-based. Feature-based methods first extract relevant image features and then find the geometrical transformation that best matches the two corresponding sets of features extracted from the two images. Because identification and extraction of image features is often a challenging and time-consuming process, intensity-based image registration, by which the mapping transformation is estimated directly from the observed image intensities of the two images, has received much attention recently. In the literature, most existing intensity-based image registration methods estimate the mapping transformation globally by solving a minimization/maximization problem defined by the two entire images to register. To this end, it needs to be assumed that the mapping transformation has a certain type of parametric form or it is a continuous bivariate function satisfying certain regularity conditions. In this paper, we propose a novel intensity-based image registration method using nonparametric local smoothing. By this method, the mapping transformation at a given pixel is estimated locally in a neighborhood after certain image features are accommodated in the estimation. Due to the flexibility of local smoothing, this method does not require any parametric form for the mapping transformation. It even allows the transformation to be a discontinuous function. Numerical examples show that it is effective in various applications.", "paper_title": "Intensity-Based Image Registration by Nonparametric Local Smoothing", "paper_id": "WOS:000293969000014"}