{"auto_keywords": [{"score": 0.049494570200460955, "phrase": "concept_maps"}, {"score": 0.02819827616624647, "phrase": "text_documents"}, {"score": 0.01729619927294457, "phrase": "candidate_terms"}, {"score": 0.008660617495331294, "phrase": "affinity_propagation"}, {"score": 0.004698086429418318, "phrase": "increasingly_important_role"}, {"score": 0.004350777114615379, "phrase": "complex_and_time-consuming_task"}, {"score": 0.0041995728942229105, "phrase": "domain_experts"}, {"score": 0.004129329619937498, "phrase": "worthwhile_research_challenge"}, {"score": 0.004053881856507032, "phrase": "automatic_or_semi-automatic_construction"}, {"score": 0.0037195507046380036, "phrase": "anaphora_problems"}, {"score": 0.0036403522868511742, "phrase": "important_propositions"}, {"score": 0.0035192788686342668, "phrase": "decreased_recall"}, {"score": 0.003150403848652526, "phrase": "ambiguous_propositions"}, {"score": 0.0030643732403331414, "phrase": "cluster-based_approach"}, {"score": 0.002890367960684987, "phrase": "typed_dependency_linguistic_rules"}, {"score": 0.0026763361486623195, "phrase": "extracted_candidate_terms"}, {"score": 0.0025713631281616784, "phrase": "calculated_similarities"}, {"score": 0.002508816084407055, "phrase": "extracted_relationships"}, {"score": 0.00221130685073215, "phrase": "likert_scale"}, {"score": 0.0021574990404104213, "phrase": "constructed_concept_maps"}, {"score": 0.0021049977753042253, "phrase": "information_system_domain"}], "paper_keywords": ["affinity propagation", " concept map", " concept map learning", " knowledge acquisition", " text clustering"], "paper_abstract": "Concept maps are playing an increasingly important role in various computing fields. In particular, they have been popularly used for organizing and representing knowledge. However, constructing concept maps manually is a complex and time-consuming task. Therefore, the creation of concept maps automatically or semi-automatically from text documents is a worthwhile research challenge. Recently, various approaches for automatic or semi-automatic construction of concept maps have been proposed. However, these approaches suffer from several limitations. First, only the noun phrases in text documents are included without resolution of the anaphora problems for pronouns. This omission causes important propositions available in the text documents to be missed, resulting in decreased recall. Second, although some approaches label the relationship to form propositions, they do not show the direction of the relationship between the subject and object in the form of Subject-Relationship-Object, leading to ambiguous propositions. In this paper, we present a cluster-based approach to semi-automatically construct concept maps from text documents. First, we extract the candidate terms from documents using typed dependency linguistic rules. Anaphoric resolution for pronouns is introduced to map the pronouns with candidate terms. Second, the similarities are calculated between the pairs of extracted candidate terms of a document and clusters are made through affinity propagation by providing the calculated similarities between the candidate terms. Finally, the extracted relationships are assigned between the candidate terms in each cluster. Our empirical results show that the semi-automatically constructed concept maps conform to the outputs generated manually by domain experts, since the degree of difference between them is proportionally small based on a Likert scale. Furthermore, domain experts verified that the constructed concept maps are in accordance with their knowledge of the information system domain.", "paper_title": "Concept map construction from text documents using affinity propagation", "paper_id": "WOS:000326964600001"}