{"auto_keywords": [{"score": 0.029976630623181084, "phrase": "supply_voltage"}, {"score": 0.00481495049065317, "phrase": "temperature-constraint_hard_real-time_periodic_tasks"}, {"score": 0.004430248457624686, "phrase": "dynamic_power_management_problem"}, {"score": 0.004076157223660074, "phrase": "feasibility_checking_problem"}, {"score": 0.004024242000713225, "phrase": "real-time_periodic_task_sets"}, {"score": 0.003750260412839128, "phrase": "traditional_scheduling_approach"}, {"score": 0.003194736764837261, "phrase": "new_necessary_and_sufficient_conditions"}, {"score": 0.0030741085942960814, "phrase": "real-time_schedules"}, {"score": 0.002958021635132416, "phrase": "close_relationship"}, {"score": 0.002601727192945944, "phrase": "technical_parameters"}, {"score": 0.002145942273032774, "phrase": "submicron_scale"}, {"score": 0.0021049977753042253, "phrase": "inter_dependency"}], "paper_keywords": ["Feasibility analysis", " leakage", " power aware", " real-time systems", " temperature", " thermal management"], "paper_abstract": "While the dynamic thermal management problem is closely related to the dynamic power management problem, it has its own distinct features. In this paper, we study the feasibility checking problem for real-time periodic task sets under the peak temperature constraint. We show that the traditional scheduling approach, i.e. to repeat the schedule that is feasible through the range of one hyperperiod, does not apply any more. We then present new necessary and sufficient conditions to check the feasibility of real-time schedules. We further incorporate the close relationship of leakage, temperature, and supply voltage into our feasibility analysis, and develop more elaborated feasibility conditions. Our experiments, based on technical parameters derived from a processor using the 65 nm IC technology, demonstrate the effectiveness of our feasibility conditions and, at the same time, highlight the fact that a power/thermal-aware computing technique becomes ineffective at the submicron scale if the inter dependency of leakage, temperature, and supply voltage is not properly addressed.", "paper_title": "Feasibility Analysis for Temperature-Constraint Hard Real-Time Periodic Tasks", "paper_id": "WOS:000284008200008"}