{"auto_keywords": [{"score": 0.032598867375888525, "phrase": "self-care_technology"}, {"score": 0.00471228691115201, "phrase": "self-care_technologies"}, {"score": 0.004546000131069232, "phrase": "chronic_conditions"}, {"score": 0.004354149483556514, "phrase": "ill_body"}, {"score": 0.003853251284913932, "phrase": "medical_perspective"}, {"score": 0.0028279422436488116, "phrase": "key_hci_journals"}, {"score": 0.0026315183701883437, "phrase": "design_tensions"}, {"score": 0.0024664004864629724, "phrase": "hci_research"}, {"score": 0.0023116191163488824, "phrase": "patients'_everyday_life_experience"}, {"score": 0.0021049977753042253, "phrase": "medical_research"}], "paper_keywords": ["Chronic conditions", " chronic diseases", " home monitoring", " home care", " pervasive health", " self-care", " self-care design", " self-care technology", " self-management", " telecare", " telehealth", " literature review"], "paper_abstract": "Many studies show that self-care technologies can support patients with chronic conditions and their carers in understanding the ill body and increasing control of their condition. However, many of these studies have largely privileged a medical perspective and thus overlooked how patients and carers integrate self-care into their daily lives and mediate their conditions through technology In this review, we focus on how patients and carers use and experience self-care technology through a Human-Computer Interaction (HCI) lens. We analyse studies of self-care published in key HCI journals and conferences using the Grounded Theory Literature Review (GTLR) method and identify research trends and design tensions. We then draw out opportunities for advancing HCI research in self-care, namely, focusing further on patients' everyday life experience, considering existing collaborations in self-care, and increasing the influence on medical research and practice around self-care technology", "paper_title": "Self-Care Technologies in HCI: Trends, Tensions, and Opportunities", "paper_id": "WOS:000367406400008"}