{"auto_keywords": [{"score": 0.03737634241271663, "phrase": "link_decay"}, {"score": 0.00481495049065317, "phrase": "leading_information_science_journals"}, {"score": 0.004632388761885302, "phrase": "scholarly_publications"}, {"score": 0.004521803560561489, "phrase": "online_literature_increases"}, {"score": 0.004205570965859848, "phrase": "accessibility_problems"}, {"score": 0.0041051328120736575, "phrase": "present_study"}, {"score": 0.004046020290832207, "phrase": "link_decay_phenomenon"}, {"score": 0.0030858947334838145, "phrase": "link_accessibility_errors"}, {"score": 0.002446024708601971, "phrase": "edu_domain"}, {"score": 0.0023644936731468252, "phrase": "highest_failure_rates"}, {"score": 0.0021049977753042253, "phrase": "journal_authors"}], "paper_keywords": [""], "paper_abstract": "Web citations have become common in scholarly publications as the amount of online literature increases. Yet, such links are not persistent and many decay over time, causing accessibility problems for readers. The present study investigates the link decay phenomenon in three leading information science journals. Articles spanning a period of 7 years (1997-2003) were downloaded, and their links were extracted. From these, a measure of link decay, the half-life, was computed to be approximately 5 years, which compares favorably against other disciplines (1.4-4.8 years). The study also investigated types of link accessibility errors encountered as well as examined characteristics of links that may be associated with decay. It was found that approximately 31% of all citations were not accessible during the time of testing, and the majority of errors were due to missing content (HTTP Error Code 404). Citations from the edu domain were also found to have the highest failure rates of 36% when compared with other popular top-level domains. Results indicate that link decay is a problem that cannot be ignored, and implications for journal authors and readers are discussed.", "paper_title": "Link decay in leading information science journals", "paper_id": "WOS:000246379200003"}