{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "logarithmic-space_computable_real_numbers"}, {"score": 0.013689322956425153, "phrase": "cut_representation"}, {"score": 0.01066565376582086, "phrase": "polynomial-time_computable_real_numbers"}, {"score": 0.005048970669866315, "phrase": "cauchy_function_representations"}, {"score": 0.004271490815763164, "phrase": "cauchy_function_representation"}, {"score": 0.0038195342195623764, "phrase": "real_numbers"}, {"score": 0.003611751858608048, "phrase": "tally_sets"}, {"score": 0.003053598205821532, "phrase": "different_relationships"}, {"score": 0.0024312007066900165, "phrase": "cauchy"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Complexity", " Real numbers", " Polynomial time", " Logarithmic space"], "paper_abstract": "We study, in this paper, the relationship among the classes of logarithmic-space computable real numbers under different representations. We consider logarithmic-space computable real numbers under the Cauchy function representation, the general left cut representation, the standard left cut representation, and the binary expansion representation. It is shown that the relationship among these classes of real numbers depends on the relationship between the discrete complexity classes P-1 and L-1, the classes of tally sets in P and L, respectively. First, if P-1 = L-1, then the relationship among the four classes of logarithmic-space computable real numbers is the same as that among these classes of polynomial-time computable real numbers. On the other hand, if P-1 not equal L-1, then we get different relationships from those among classes of polynomial-time computable real numbers. For instance, while the classes of polynomial-time computable real numbers under the general left cut and the Cauchy function representations are equivalent, we show, under the assumption of P-1 not equal L-1, that the class of logarithmic-space computable real numbers under the general left cut representation properly contains the class of logarithmic-space computable real numbers under the Cauchy function representation. In addition, if P-1 not equal L-1, then the two classes of logarithmic-space computable real numbers under the standard left cut and the Cauchy function representations are incomparable. (c) 2012 Elsevier B.V. All rights reserved.", "paper_title": "On logarithmic-space computable real numbers", "paper_id": "WOS:000314137900010"}