{"auto_keywords": [{"score": 0.042711894751659464, "phrase": "problem_statements"}, {"score": 0.00481495049065317, "phrase": "language_processing_techniques"}, {"score": 0.004756805752518494, "phrase": "educational_software"}, {"score": 0.0046993598473345395, "phrase": "active_learning_methodologies"}, {"score": 0.0041784516085055035, "phrase": "based_learning_activity"}, {"score": 0.003996271202811961, "phrase": "higher_order"}, {"score": 0.003775803846431323, "phrase": "automatic_assessment"}, {"score": 0.0035965032173588753, "phrase": "language_processor_techniques"}, {"score": 0.003223494720348768, "phrase": "formal_language"}, {"score": 0.003107935254560724, "phrase": "algorithmic_way"}, {"score": 0.002696479050724966, "phrase": "aforementioned_systems"}, {"score": 0.002578745296475411, "phrase": "language_processing"}, {"score": 0.002456148932305311, "phrase": "home_assignments"}, {"score": 0.0021569129153653777, "phrase": "learning_outcomes"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Environment for active learning", " Formal languages techniques", " Automatic assessment"], "paper_abstract": "This paper is focused on those systems that allow students to build their own knowledge by providing them with feedback regarding their actions while performing a problem based learning activity or while making changes to problem statements, so that a higher order thinking skill can be achieved. This feedback is the consequence of an automatic assessment. Particularly, we propose a method that makes use of Language Processor techniques for developing these kinds of systems. This method could be applied in subjects in which problem statements and solutions can be formalized by mean of a formal language and the problems can be solved in an algorithmic way. The method has been used to develop a number of tools that are partially described in this paper. Thus, we show that our approach is applicable in addressing the development of the aforementioned systems. One of these tools (a virtual laboratory for language processing) has been in use for several years in order to support home assignments. The data collected for these years are presented and analyzed in this paper. The results of the analysis confirm that this tool is effective in facilitating the achievement of learning outcomes. (C) 2013 Elsevier Ltd. All rights reserved.", "paper_title": "Experience applying language processing techniques to develop educational software that allow active learning methodologies by advising students", "paper_id": "WOS:000335629300007"}