{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "multi-label_data"}, {"score": 0.015397023906446636, "phrase": "traditional_chinese_medicine"}, {"score": 0.013764009180965067, "phrase": "multi-label_learning"}, {"score": 0.012456583437270343, "phrase": "feature_selection"}, {"score": 0.00870286849331566, "phrase": "chd"}, {"score": 0.004174929128880472, "phrase": "high-dimensional_data"}, {"score": 0.004054071599735255, "phrase": "great_deal"}, {"score": 0.003953256858638655, "phrase": "traditional_chinese_medical_diagnosis"}, {"score": 0.003838791650587681, "phrase": "diagnostic_algorithm"}, {"score": 0.003743310268453678, "phrase": "smallest_feature_subset"}, {"score": 0.003712011863784581, "phrase": "relevant_symptoms"}, {"score": 0.003634901808509402, "phrase": "generalization_performance"}, {"score": 0.0035001037990786727, "phrase": "rare_researches"}, {"score": 0.003398714712611042, "phrase": "hybrid_optimization_technique"}, {"score": 0.002885135695263876, "phrase": "current_popular_dimension_reduction_algorithms"}, {"score": 0.002860992017190221, "phrase": "mefs"}, {"score": 0.0026193328696791306, "phrase": "experimental_results"}, {"score": 0.0024081387633065206, "phrase": "average_precision"}, {"score": 0.002299313860419974, "phrase": "syndrome_inquiry_modeling"}, {"score": 0.0021861845339709533, "phrase": "effective_reference"}], "paper_keywords": ["multi-label learning", " feature selection", " high-dimensionality", " inquiry of traditional Chinese medicine", " coronary heart disease"], "paper_abstract": "In traditional Chinese medicine (TCM) diagnosis, a patient may be associated with more than one syndrome tags, and its computer-aided diagnosis is a typical application in the domain of multi-label learning of high-dimensional data. It is common that a great deal of symptoms can occur in traditional Chinese medical diagnosis, which affects the modeling of diagnostic algorithm. Feature selection entails choosing the smallest feature subset of relevant symptoms, and maximizing the generalization performance of the model. At present there are rare researches on feature selection on multi-label data. A hybrid optimization technique is introduced to symptom selection for multi-label data in TCM diagnosis in this paper, and modeling is made by means of four multi-label learning algorithms like k nearest neighbors, etc. We compare the performance of the algorithm with the current popular dimension reduction algorithms like MEFS (embedded feature selection for multi-Label learning), MDDM (multi-label dimensionality reduction via dependence maximization) on the UCI Yeast gene functional data set and an inquiry diagnosis dataset of coronary heart disease (CHD). Experimental results show that the algorithm we present has significantly improved the performance. In particular, the improvement on the average precision for the classifier is up to 10.62% and 14.54%. Syndrome inquiry modeling of CHD in TOM is realized in this paper, providing effective reference for the diagnosis of CHD and analysis of other multi-label data.", "paper_title": "Symptom selection for multi-label data of inquiry diagnosis in traditional Chinese medicine", "paper_id": "WOS:000319531200019"}