{"auto_keywords": [{"score": 0.044037245250015095, "phrase": "blood_services"}, {"score": 0.00819210886858728, "phrase": "trc"}, {"score": 0.007428782620907853, "phrase": "blood_management_system"}, {"score": 0.00481495049065317, "phrase": "turkish_red_crescent_blood_services"}, {"score": 0.0045726187330434025, "phrase": "turkish_red_crescent"}, {"score": 0.0036616109902631293, "phrase": "current_system"}, {"score": 0.003459191419478298, "phrase": "locational_decisions"}, {"score": 0.003370907075333389, "phrase": "blood_centers"}, {"score": 0.00330189927527898, "phrase": "mobile_units"}, {"score": 0.0030083892809348715, "phrase": "turkey"}, {"score": 0.0028273061946184645, "phrase": "location-allocation_decision_problems"}, {"score": 0.002643386043540555, "phrase": "real_data"}, {"score": 0.0026026666736474404, "phrase": "trc_blood_services"}, {"score": 0.002310578855290687, "phrase": "management_problems"}, {"score": 0.0021826828321952615, "phrase": "location-allocation_aspects"}, {"score": 0.0021049977753042253, "phrase": "turkish_red_crescent_society"}], "paper_keywords": ["hierarchical location problem", " regional blood centers", " pq-median problem", " location-allocation problem"], "paper_abstract": "After a series of earthquakes in 1999, Turkish Red Crescent (TRC) has engaged in a restructuring for all of its activities, including the blood services. Our study on the blood management system had been started as part of this initiative to restructure the blood services and improve both their effectiveness and efficiency. In the current system of TRC, not much consideration has been given to how the locational decisions affect the performance of blood centers, stations and mobile units. In recent years, however, there has been much discussion regarding the regionalization of the blood management system in Turkey. In this study, we develop several mathematical models to solve the location-allocation decision problems in regionalization of blood services. We report our computational results, obtained by using real data, for TRC blood services. Statement of scope and purpose Regionalization of blood services has been implemented in many countries and found to be successful in resolving the management problems. In this study we formulate several mathematical problems to address the location-allocation aspects of regionalization of blood services of the Turkish Red Crescent Society. (c) 2005 Elsevier Ltd. All rights reserved.", "paper_title": "Locational analysis for regionalization of Turkish Red Crescent blood services", "paper_id": "WOS:000241737500005"}