{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "pls-da"}, {"score": 0.04977329136950646, "phrase": "compositional_data"}, {"score": 0.009853985793227937, "phrase": "compositional_approach"}, {"score": 0.00969825032919587, "phrase": "important_metabolites"}, {"score": 0.007782413571403758, "phrase": "logratio_approach"}, {"score": 0.004387877144428992, "phrase": "positive_components"}, {"score": 0.0038600230206554792, "phrase": "theoretical_arguments"}, {"score": 0.003798654583736764, "phrase": "data_sets"}, {"score": 0.003631945391344252, "phrase": "inherited_metabolic_disorders"}, {"score": 0.0035627492415494216, "phrase": "first_example"}, {"score": 0.003494866798828308, "phrase": "corresponding_regression_parameters"}, {"score": 0.0034282732966589478, "phrase": "small_data"}, {"score": 0.0033845816848753073, "phrase": "targeted_metabolomics"}, {"score": 0.003330746760940307, "phrase": "potential_markers"}, {"score": 0.0032359856233193504, "phrase": "untargeted_metabolomicswas"}, {"score": 0.0028463059289874637, "phrase": "compositional_method"}, {"score": 0.0027830917623582903, "phrase": "cross-validation_methods"}, {"score": 0.0027564303939865476, "phrase": "better_results"}, {"score": 0.0026438102161263567, "phrase": "john_wiley"}, {"score": 0.0024478159375394878, "phrase": "discriminant_analysis"}, {"score": 0.002347775213789611, "phrase": "isometric_logratio_transformation"}, {"score": 0.0022374020089160084, "phrase": "pls-da_processing"}, {"score": 0.002145942273032774, "phrase": "real-world_data"}, {"score": 0.0021049977753042253, "phrase": "standard_methodology"}], "paper_keywords": ["compositional data", " partial least squares discriminant analysis", " metabolomics", " significance testing"], "paper_abstract": "When quantifying information in metabolomics, the results are often expressed as data carrying only relative information. Vectors of these data have positive components, and the only relevant information is contained in the ratios between their parts; such observations are called compositional data. The aim of the paper is to demonstrate how partial least squares discriminant analysis (PLS-DA)the most widely used method in chemometrics for multivariate classificationcan be applied to compositional data. Theoretical arguments are provided, and data sets from metabolomics are investigated. The data are related to the diagnosis of inherited metabolic disorders (IMDs). The first example analyzes the significance of the corresponding regression parameters (metabolites) using a small data set resulting from targeted metabolomics, where just a subset of potential markers is selected. The second examplethe approach of untargeted metabolomicswas used for the analysis detecting almost 500 metabolites. The significance of the metabolites is investigated by applying PLS-DA, accommodated according to a compositional approach. The significance of important metabolites (markers of diseases) is more clearly visible with the compositional method in both examples. Also, cross-validation methods lead to better results in case of using the compositional approach. Copyright (c) 2014 John Wiley & Sons, Ltd. When quantifying information in metabolomics, the results are often expressed as data carrying only relative information-compositional data. Partial least squares discriminant analysis (PLS-DA) was applied to compositional data using the logratio approach (through isometric logratio transformation). The significance of important metabolites (markers of diseases), resulting from PLS-DA processing, is much more visible with the logratio approach in both examples with real-world data from metabolomics comparing with the standard methodology.", "paper_title": "PLS-DA for compositional data with application to metabolomics", "paper_id": "WOS:000348517300004"}