{"auto_keywords": [{"score": 0.049465088868450455, "phrase": "multi-class_classification"}, {"score": 0.015719716506582538, "phrase": "adaptive_feature_fusion_framework"}, {"score": 0.010638249239121707, "phrase": "feature_vectors"}, {"score": 0.0043144799365586375, "phrase": "similar_manner"}, {"score": 0.003941478054422721, "phrase": "multi-class_svm_schemes"}, {"score": 0.003647442345566347, "phrase": "main_difference"}, {"score": 0.0031845067058084583, "phrase": "unknown_samples"}, {"score": 0.0028901595183546576, "phrase": "novel_evaluation_criterions"}, {"score": 0.0027622407190589326, "phrase": "frequent_small-number_sample_problems"}, {"score": 0.002260301305523054, "phrase": "proposed_approach"}, {"score": 0.002160200030574203, "phrase": "ova"}], "paper_keywords": ["multi-class classification", " feature fusion", " SVM", " OVA", " writer recognition"], "paper_abstract": "An adaptive feature fusion framework is proposed for multi-class classification based on SVM. In a similar manner of one-versus-all (OVA), one of the multi-class SVM schemes, the proposed approach decomposes a multi-class classification into several binary classifications. The main difference lies in that each classifier is created with the most suitable feature vectors to discriminate one class from all the other classes. The feature vectors of the unknown samples are selected by each classifier adaptively such that recognition is fulfilled accordingly. In addition, novel evaluation criterions are defined to deal with the frequent small-number sample problems. A writer recognition experiment is carried out to accomplish this framework with three kinds of feature vectors: texture, structure and morphological features. Finally, the performance of the proposed approach is illustrated as compared with the OVA by applying the same feature vectors for all classes.", "paper_title": "An adaptive feature fusion framework for multi-class classification based on SVM", "paper_id": "WOS:000253351900010"}