{"auto_keywords": [{"score": 0.04906531875041212, "phrase": "bioisosteric_replacement"}, {"score": 0.00481495049065317, "phrase": "protein-ligand_interaction_patterns"}, {"score": 0.004652845998457721, "phrase": "important_role"}, {"score": 0.004613175917207636, "phrase": "medicinal_chemistry"}, {"score": 0.0045348429403481464, "phrase": "biological_activity"}, {"score": 0.004056981775766067, "phrase": "main_pharrnacophoric_moieties"}, {"score": 0.003629291866667764, "phrase": "reference_scaffold"}, {"score": 0.00350696416714684, "phrase": "desired_target"}, {"score": 0.0034179225740833055, "phrase": "novel_database"}, {"score": 0.00319134078848996, "phrase": "interaction_pattern_graphs"}, {"score": 0.0031640918630415566, "phrase": "protein-bound_ligands"}, {"score": 0.003044313656896057, "phrase": "corresponding_fragments"}, {"score": 0.0028916124463906983, "phrase": "in-house_developed_graph_alignment_tool"}, {"score": 0.0026312238938540787, "phrase": "herein_presented_sc-pdb-frag_database"}, {"score": 0.0023636038312749245, "phrase": "sc-pdb_database"}, {"score": 0.002283839204519042, "phrase": "relational_database"}, {"score": 0.0021322775033565805, "phrase": "true_bioisosteric_replacements"}, {"score": 0.0021049977753042253, "phrase": "conserved_interaction_patterns"}], "paper_keywords": [""], "paper_abstract": "Bioisosteric replacement plays an important role in medicinal chemistry by keeping the biological activity of a molecule while changing either its core scaffold or substituents, thereby facilitating lead optimization and patenting. Bioisosteres are classically chosen in order to keep the main pharrnacophoric moieties of the substructure to replace. However, notably when changing a scaffold, no attention is usually paid as whether all atoms of the reference scaffold are equally important for binding to the desired target. We herewith propose a novel database for bioisosteric replacement (scPDBFrag), capitalizing on our recently published structure-based approach to scaffold hopping, focusing on interaction pattern graphs. Protein-bound ligands are first fragmented and the interaction of the corresponding fragments with their protein environment computed-on-the-fly. Using an in-house developed graph alignment tool, interaction patterns graphs can be compared, aligned, and sorted by decreasing similarity to any reference. In the herein presented sc-PDB-Frag database (http://bioinfo-pharma.u-strasbg.fr/scPDBFrag), fragments, interaction patterns, alignments, and pairwise similarity scores have been extracted from the sc-PDB database of 8077 druggable protein ligand complexes and further stored in a relational database. We herewith present the database, its Web implementation, and procedures for identifying true bioisosteric replacements based on conserved interaction patterns.", "paper_title": "sc-PDB-Frag: A Database of Protein-Ligand Interaction Patterns for Bioisosteric Replacements", "paper_id": "WOS:000339647000008"}