{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "sudden_death"}, {"score": 0.004476399615305783, "phrase": "quantum_states"}, {"score": 0.00436890075128947, "phrase": "quantum_coherence"}, {"score": 0.0038453138708790385, "phrase": "classical_states"}, {"score": 0.0035965032173588753, "phrase": "spatial_extent"}, {"score": 0.0034465894339710864, "phrase": "finite_time"}, {"score": 0.0032828706086018133, "phrase": "entanglement_sudden_death"}, {"score": 0.003107935254560724, "phrase": "quantum_information_processing_tasks"}, {"score": 0.0028195727965553367, "phrase": "noise-affected_systems"}, {"score": 0.0023063614119692476, "phrase": "information_processing_tasks"}, {"score": 0.0022101055924375725, "phrase": "local_noise"}, {"score": 0.0021438155673297377, "phrase": "entangled_states"}, {"score": 0.0021049977753042253, "phrase": "entanglement-based_quantum_key_distribution"}], "paper_keywords": ["Entanglement", " Quantum information", " Quantum state decoherence"], "paper_abstract": "Entanglement is a global characteristic unique to quantum states that depends on quantum coherence and may allow one to carry out communications and information processing tasks that are either impossible or less efficient using classical states. Because environmental noise, even when entirely local in spatial extent, can fully destroy entanglement in finite time, an effect referred to as \"entanglement sudden death\" (ESD), it may threaten quantum information processing tasks. Although it may be possible to \"distill\" entanglement from a collection of noise-affected systems under appropriate circumstances, once entanglement has been completely lost no amount of distillation can recover it. It is therefore extremely important to avoid its complete destruction in times comparable to those of information processing tasks. Here, the effect of local noise on a class of entangled states used in entanglement-based quantum key distribution is considered and the threat ESD might pose to it is assessed.", "paper_title": "Entanglement sudden death: a threat to advanced quantum key distribution?", "paper_id": "WOS:000344922100003"}