{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "personified_robots"}, {"score": 0.04888338488077779, "phrase": "new_ontological_category"}, {"score": 0.014766386679791622, "phrase": "social_cognition"}, {"score": 0.004616199959832044, "phrase": "'s_perspective"}, {"score": 0.0044630962990919775, "phrase": "empathic_concern"}, {"score": 0.004425616928975799, "phrase": "moral_regard"}, {"score": 0.0041194351307673556, "phrase": "imaginary_play"}, {"score": 0.004050514095922329, "phrase": "imaginative_production"}, {"score": 0.003932654396285872, "phrase": "interesting_and_provocative_question"}, {"score": 0.003722761107761564, "phrase": "life-like_robots"}, {"score": 0.0036296886647898094, "phrase": "robots'_experiences"}, {"score": 0.0030787405733989615, "phrase": "simulation_theory"}, {"score": 0.0030017207229983385, "phrase": "others'_internal_states"}, {"score": 0.002914288956035066, "phrase": "imaginative_play"}, {"score": 0.0025674490885184173, "phrase": "children's_beliefs"}, {"score": 0.0022051664509486206, "phrase": "future_research"}, {"score": 0.0021773853011112882, "phrase": "important_emerging_area"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Robots", " Children", " Ontological category", " Pretense", " Simulation theory"], "paper_abstract": "Imagining another's perspective is an achievement in social cognition and underlies empathic concern and moral regard. Imagination is also within the realm of fantasy, and may take the form of imaginary play in children and imaginative production in adults. Yet, an interesting and provocative question emerges in the case of personified robots: How do people conceive of life-like robots? Do people imagine about robots' experiences? If so, do these imaginings reflect their actual or pretend beliefs about robots? The answers to these questions bear on the possibility that personified robots represent the emergence of a new ontological category. We draw on simulation theory as a framework for imagining others' internal states as well as a means for imaginative play. We then turn to the literature on people's and, in particular, children's conceptions of personified technologies and raise the question of the veracity of children's beliefs about personified robots (i.e., are they behaving as or behaving as if?). Finally, we consider the suggestion that such personified technologies represent the emergence of a new ontological category and offer some suggestions for future research in this important emerging area of social cognition. (C) 2010 Elsevier Ltd. All rights reserved.", "paper_title": "Behaving as or behaving as if? Children's conceptions of personified robots and the emergence of a new ontological category", "paper_id": "WOS:000284437700017"}