{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "mmr"}, {"score": 0.004658426838467567, "phrase": "important_element"}, {"score": 0.004597244847332915, "phrase": "automatic_vision"}, {"score": 0.004418456827500267, "phrase": "mmr_utility"}, {"score": 0.004274766964161756, "phrase": "traffic_monitoring"}, {"score": 0.004054479957160662, "phrase": "law_enforcement_surveillance_systems"}, {"score": 0.003948613642680196, "phrase": "growing_significance"}, {"score": 0.0033245147666408157, "phrase": "different_car_models"}, {"score": 0.0031950646670695546, "phrase": "bit_less_emphasis"}, {"score": 0.002893001738785978, "phrase": "higher_classification_accuracy"}, {"score": 0.0022492129111567802, "phrase": "classification_accuracy"}, {"score": 0.002147265537489893, "phrase": "real-time_approach"}], "paper_keywords": ["Make and model recognition of cars", " SURF", " SIFT", " SVM", " Content descriptors", " Classification accuracy"], "paper_abstract": "Make and Model recognition of cars (MMR) has become an important element of automatic vision based systems. Nowadays, MMR utility is commonly added to traffic monitoring (e.g. Licence Plate Recognition) or law enforcement surveillance systems. Facing the growing significance of Make and Model Recognition of cars we have designed and implemented two different MMR approaches. According to their disparate assumption data of these implementations one is obligated to estimate different car models in milliseconds (with a bit less emphasis placed on its accuracy) while the other is aimed first of all to reach higher classification accuracy. Both the implemented MMR approaches, called Real-Time and Visual Content Classification, respectively, are described in this paper in detail and with reference to other MMR methods presented in the literature. Analyses of their performance with respect to classification accuracy and, in case of the Real-Time approach, to its response time are also presented, discussed and finally concluded.", "paper_title": "The efficient real- and non-real-time make and model recognition of cars", "paper_id": "WOS:000356168600006"}