{"auto_keywords": [{"score": 0.043855814204982906, "phrase": "plural_method"}, {"score": 0.00481495049065317, "phrase": "centralized_approaches"}, {"score": 0.004621279527317074, "phrase": "business_processes"}, {"score": 0.004527371799277529, "phrase": "centralized_structures"}, {"score": 0.004322967486451877, "phrase": "rapidly_changing_business_environment"}, {"score": 0.0039010428828989826, "phrase": "decentralized_way"}, {"score": 0.003802135020791801, "phrase": "centralized_group"}, {"score": 0.003292685392413911, "phrase": "individual_model"}, {"score": 0.0030327408069772293, "phrase": "cohesive_service"}, {"score": 0.002940626369102927, "phrase": "individual_models"}, {"score": 0.0026532596852754525, "phrase": "case_study"}, {"score": 0.0026126405272417783, "phrase": "small-size_software_organization"}, {"score": 0.002262209824105156, "phrase": "plural's_utility"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Business process modeling", " Decentralized process modeling", " Process improvement", " Process owner", " User involvement"], "paper_abstract": "Top-down and centralized approaches prevail in the design and improvement of business processes. However, centralized structures pose difficulties for organizations in adapting to a rapidly changing business environment. Here we present the Plural method which can be used to guide organizations in performing process modeling in a decentralized way. Instead of a centralized group of people understanding, modeling and improving processes, our method allows individuals to model and improve their own processes to help in fulfilling their roles in the organization. An individual model depicts a set of activities performed by a role, which together result in a cohesive service within the organization. These individual models are then integrated as necessary to show the way the organization works. We applied the Plural method in a case study of a small-size software organization. We describe the method and its underlying principles and then discuss the findings of our case study, lessons learned, and limitations. The study thus provided evidence of Plural's utility and showed how an organization might exploit its strengths. (C) 2011 Elsevier B.V. All rights reserved.", "paper_title": "Plural: A decentralized business process modeling method", "paper_id": "WOS:000294240800007"}