{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "local-and-global_mapping_search"}, {"score": 0.039192524784767216, "phrase": "local-mapping_search"}, {"score": 0.025406907313964895, "phrase": "sga-lg"}, {"score": 0.0044289730051264116, "phrase": "fuzzy_controller_design"}, {"score": 0.004388035083357706, "phrase": "reinforcement_learning_environments"}, {"score": 0.00415019999222481, "phrase": "reinforcement_fuzzy_controller_design_efficacy"}, {"score": 0.003644001325962353, "phrase": "well-performed_local_rules"}, {"score": 0.003320561182494713, "phrase": "elite_strategy"}, {"score": 0.0032292292848296617, "phrase": "top-half_best-performing_individuals"}, {"score": 0.0030825404960282713, "phrase": "next_generation"}, {"score": 0.0029152570900178956, "phrase": "global-mapping_search"}, {"score": 0.0027570267191549774, "phrase": "whole_fuzzy_network"}, {"score": 0.00269365253474335, "phrase": "single_rule"}, {"score": 0.0024658019116387845, "phrase": "good_fuzzy_network"}, {"score": 0.0022995854132747233, "phrase": "ball-and-beam_system"}, {"score": 0.0021049977753042253, "phrase": "evolutionary_programming_based_fuzzy_controller_designs"}], "paper_keywords": ["genetic fuzzy control", " reinforcement learning", " symbiotic evolution", " coevolutionary computation", " elite strategy"], "paper_abstract": "This paper proposes a Symbiotic Genetic Algorithm with Local-and-Global mapping search ( SGA-LG) for fuzzy controller design under reinforcement learning environments. The objective of the proposed SGA-LG is to increase the reinforcement fuzzy controller design efficacy and efficiency. SGA-LG operates in two concurrently evolving searches: the local mapping search and the global mapping search. The local-mapping search helps to find the well-performed local rules. A population is created in this search, and each individual in the population encodes only one fuzzy rule. An elite strategy is adopted, where the top-half best-performing individuals, the elites, are reproduced directly to the next generation, and parents are selected from the elites only. For global-mapping search, another population is created, where each individual encodes a whole fuzzy network as opposed to a single rule. The objective is to determine which local rules designed in the local-mapping search should be combined together to achieve a good fuzzy network. To demonstrate the performance of SGA-LG, it is applied to cart-pole and ball-and-beam system controls. The efficacy and efficiency of SGA-LG are verified by comparing with other GAs, evolution strategy and evolutionary programming based fuzzy controller designs.", "paper_title": "A symbiotic genetic algorithm with local-and-global mapping search for reinforcement fuzzy control", "paper_id": "WOS:000255211400002"}