{"auto_keywords": [{"score": 0.03700385809508468, "phrase": "information_sources"}, {"score": 0.02322730111336097, "phrase": "data_fusion"}, {"score": 0.015694620542578766, "phrase": "multiple_information_sources"}, {"score": 0.010384261263942728, "phrase": "protein-protein_interactions"}, {"score": 0.008650080881524124, "phrase": "reliability_scores"}, {"score": 0.0044896599221451216, "phrase": "cellular_mechanisms"}, {"score": 0.004450568197899267, "phrase": "biological_functions"}, {"score": 0.004278807087784626, "phrase": "high-throughput_assays"}, {"score": 0.004042295865725559, "phrase": "multiple_evidence"}, {"score": 0.004007083686875716, "phrase": "different_sources"}, {"score": 0.003607630811220324, "phrase": "evidence_values"}, {"score": 0.003191485583025302, "phrase": "multi-criteria_decision_making_problem"}, {"score": 0.003068166587650604, "phrase": "potential_interactions"}, {"score": 0.0028857130140890787, "phrase": "information_source"}, {"score": 0.0025977542995083624, "phrase": "highly_reliable_ppis"}, {"score": 0.002541469965286169, "phrase": "substantial_improvement"}, {"score": 0.002497319603143104, "phrase": "conventional_approach"}, {"score": 0.002453934333239467, "phrase": "adjust_cd-distance_approach"}, {"score": 0.0023902621773166963, "phrase": "underlying_interactions"}, {"score": 0.0021049977753042253, "phrase": "missing_values"}], "paper_keywords": ["Protein-protein interaction", " reliability", " Choquet fuzzy integral", " data fusion", " missing information"], "paper_abstract": "Protein-protein interactions (PPIs) are important for understanding the cellular mechanisms of biological functions, but the reliability of PPIs extracted by high-throughput assays is known to be low. To address this, many current methods use multiple evidence from different sources of information to compute reliability scores for such PPIs. However, they often combine the evidence without taking into account the uncertainty of the evidence values, potential dependencies between the information sources used and missing values from some information sources. We propose to formulate the task of scoring PPIs using multiple information sources as a multi-criteria decision making problem that can be solved using data fusion to model potential interactions between the multiple information sources. Using data fusion, the amount of contribution from each information source can be proportioned accordingly to systematically score the reliability of PPIs. Our experimental results showed that the reliability scores assigned by our data fusion method can effectively classify highly reliable PPIs from multiple information sources, with substantial improvement in scoring over conventional approach such as the Adjust CD-Distance approach. In addition, the underlying interactions between the information sources used, as well as their relative importance, can also be determined with our data fusion approach. We also showed that such knowledge can be used to effectively handle missing values from information sources.", "paper_title": "Using data fusion for scoring reliability of protein-protein interactions", "paper_id": "WOS:000348347400001"}