{"auto_keywords": [{"score": 0.047791354135974656, "phrase": "fast_handover"}, {"score": 0.03224726441329197, "phrase": "kang-park's_scheme"}, {"score": 0.015719716506582538, "phrase": "ess-fh"}, {"score": 0.015551603673996278, "phrase": "enhanced_security_scheme"}, {"score": 0.003958937342925219, "phrase": "superior_performance"}, {"score": 0.0038737214010638745, "phrase": "handover_latency"}, {"score": 0.0037493114715625784, "phrase": "previously_developed_mobility_protocols"}, {"score": 0.003418031417852432, "phrase": "kang"}, {"score": 0.0033810408224090034, "phrase": "park"}, {"score": 0.0033262524445013303, "phrase": "security_scheme"}, {"score": 0.0027341763737751467, "phrase": "group_key"}, {"score": 0.0025059724686541263, "phrase": "strong_key_exchange"}, {"score": 0.0024653491388223546, "phrase": "key_independence"}, {"score": 0.0022472527731744974, "phrase": "different_map_domains"}, {"score": 0.002210814150677161, "phrase": "proposed_scheme"}], "paper_keywords": ["F-HMIPv6 security", " CGA", " BAN-logic"], "paper_abstract": "Fast Handover for Hierarchical Mobile IPv6 (F-HMIPv6) that combines advantages of Fast Handover for Mobile IPv6 (FMIPv6) and Hierarchical Mobile IPv6 (HMIPv6) achieves the superior performance in terms of handover latency and signaling overhead compared with previously developed mobility protocols. However, without being secured, F-HMIPv6 is vulnerable to various security threats. In 2007, Kang and Park proposed a security scheme, which is seamlessly integrated into F-HMIPv6. In this paper, we reveal that Kang-Park's scheme cannot defend against the Denial of Service (DoS) and redirect attacks while largely relying on the group key. Then, we propose an Enhanced Security Scheme for F-HMIPv6 (ESS-FH) that achieves the strong key exchange and the key independence as well as addresses the weaknesses of Kang-Park's scheme. More importantly, it enables fast handover between different MAP domains. The proposed scheme is formally verified based on BAN-logic, and its handover latency is analyzed and compared with that of Kang-Park's scheme.", "paper_title": "ESS-FH: Enhanced Security Scheme for Fast Handover in Hierarchical Mobile IPv6", "paper_id": "WOS:000279136500018"}