{"auto_keywords": [{"score": 0.04872847069753166, "phrase": "workflow_specification"}, {"score": 0.015719716506582524, "phrase": "parameterized_complexity"}, {"score": 0.015444107318773945, "phrase": "workflow_satisfiability_problem"}, {"score": 0.011880650019989584, "phrase": "workflow_specifications"}, {"score": 0.004403054828362479, "phrase": "security_requirements"}, {"score": 0.0036553070575015344, "phrase": "static_analysis_tool"}, {"score": 0.003552084379143929, "phrase": "runtime_reference_monitors"}, {"score": 0.003526735797659508, "phrase": "workflow_management_systems"}, {"score": 0.003451766520526601, "phrase": "hard_problem"}, {"score": 0.003366470816590083, "phrase": "wang"}, {"score": 0.003213153188898728, "phrase": "efficient_algorithms"}, {"score": 0.0031788080316930687, "phrase": "reasonable_assumptions"}, {"score": 0.003055977395076106, "phrase": "complexity_bounds"}, {"score": 0.0027941308786390033, "phrase": "satisfiability_problem"}, {"score": 0.0025822818714499795, "phrase": "important_special_case"}, {"score": 0.002554662768695568, "phrase": "polynomial_time"}, {"score": 0.0021049977753042253, "phrase": "widely_accepted_complexity-theoretical_assumption"}], "paper_keywords": ["Algorithms", " Security", " Theory", " Authorization constraints", " workflow satisfiability", " parameterized complexity", " kernelization"], "paper_abstract": "A workflow specification defines a set of steps and the order in which these steps must be executed. Security requirements may impose constraints on which groups of users are permitted to perform subsets of these steps. A workflow specification is said to be satisfiable if there exists an assignment of users to workflow steps that satisfies all the constraints. An algorithm for determining whether such an assignment exists is important, both as a static analysis tool for workflow specifications and for the construction of runtime reference monitors for workflow management systems. Finding such an assignment is a hard problem in general, but work by Wang and Li [2010] using the theory of parameterized complexity suggests that efficient algorithms exist under reasonable assumptions about workflow specifications. In this article, we improve the complexity bounds for the workflow satisfiability problem. We also generalize and extend the types of constraints that may be defined in a workflow specification and prove that the satisfiability problem remains fixed-parameter tractable for such constraints. Finally, we consider preprocessing for the problem and prove that in an important special case, in polynomial time, we can reduce the given input into an equivalent one where the number of users is at most the number of steps. We also show that no such reduction exists for two natural extensions of this case, which bounds the number of users by a polynomial in the number of steps, provided a widely accepted complexity-theoretical assumption holds.", "paper_title": "On the Parameterized Complexity and Kernelization of the Workflow Satisfiability Problem", "paper_id": "WOS:000320621100004"}