{"auto_keywords": [{"score": 0.03746094921310435, "phrase": "qualitative_termination_problem"}, {"score": 0.02899848828830291, "phrase": "quantitative_termination_problem"}, {"score": 0.00481495049065317, "phrase": "recursive_markov_decision_processes"}, {"score": 0.004289686492089571, "phrase": "computational_complexity"}, {"score": 0.004226609368143841, "phrase": "termination_objectives"}, {"score": 0.0038900709793274484, "phrase": "quantitative_termination_problems"}, {"score": 0.0038442251511391287, "phrase": "rmdp"}, {"score": 0.0038101933582813064, "phrase": "rssg"}, {"score": 0.003776462258204936, "phrase": "probability_p"}, {"score": 0.003314591878914152, "phrase": "precise_sense"}, {"score": 0.0032368785020224695, "phrase": "multitype_branching_processes"}, {"score": 0.0032177356154317895, "phrase": "stochastic_context-free"}, {"score": 0.002970086492041853, "phrase": "upper_and_lower_bounds"}, {"score": 0.002952516738708181, "phrase": "qualitative_and_quantitative_termination_problems"}, {"score": 0.002840812325837699, "phrase": "multi-exit_rmdps"}, {"score": 0.002701160833981317, "phrase": "pspace"}, {"score": 0.002591154768100912, "phrase": "square_root_sum_problem"}, {"score": 0.002522861292947622, "phrase": "numerical_computation"}, {"score": 0.002356380755825062, "phrase": "polynomial_time"}, {"score": 0.0022942608418577313, "phrase": "qualitative_problem"}, {"score": 0.0022604585778195152, "phrase": "np_boolean_and_conp"}, {"score": 0.0021813467128927347, "phrase": "condon's_finite-state_simple_stochastic_games"}, {"score": 0.002142832962924139, "phrase": "well_known_open_problem"}], "paper_keywords": ["Algorithms", " Theory", " Verification", " Recursive stochastic processes", " Markov decision processes", " stochastic games", " multitype branching processes", " stochastic context-free grammars"], "paper_abstract": "We introduce Recursive Markov Decision Processes (RMDPs) and Recursive Simple Stochastic Games (RSSGs), which are classes of (finitely presented) countable-state MDPs and zero-sum turn-based (perfect information) stochastic games. They extend standard finite-state MDPs and stochastic games with a recursion feature. We study the decidability and computational complexity of these games under termination objectives for the two players: one player's goal is to maximize the probability of termination at a given exit, while the other player's goal is to minimize this probability. In the quantitative termination problems, given an RMDP (or RSSG) and probability p, we wish to decide whether the value of such a termination game is at least p (or at most p); in the qualitative termination problem we wish to decide whether the value is 1. The important 1-exit subclasses of these models, 1-RMDPs and 1-RSSGs, correspond in a precise sense to controlled and game versions of classic stochastic models, including multitype Branching Processes and Stochastic Context-Free Grammars, where the objective of the players is to maximize or minimize the probability of termination (extinction). We provide a number of upper and lower bounds for qualitative and quantitative termination problems for RMDPs and RSSGs. We show both problems are undecidable for multi-exit RMDPs, but are decidable for 1-RMDPs and 1-RSSGs. Specifically, the quantitative termination problem is decidable in PSPACE for both 1-RMDPs and 1-RSSGs, and is at least as hard as the square root sum problem, a well-known open problem in numerical computation. We show that the qualitative termination problem for 1-RMDPs (i.e., a controlled version of branching processes) can be solved in polynomial time both for maximizing and minimizing 1-RMDPs. The qualitative problem for 1-RSSGs is in NP boolean AND coNP, and is at least as hard as the quantitative termination problem for Condon's finite-state simple stochastic games, whose complexity remains a well known open problem. Finally, we show that even for 1-RMDPs, more general (qualitative and quantitative) model-checking problems with respect to linear-time temporal properties are undecidable even for a fixed property.", "paper_title": "Recursive Markov Decision Processes and Recursive Stochastic Games", "paper_id": "WOS:000354799200002"}