{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "multi-server_environments"}, {"score": 0.040475680652005595, "phrase": "chuang_et_al"}, {"score": 0.03005907338620277, "phrase": "mishra_et_al"}, {"score": 0.004724878518219719, "phrase": "rapid_development"}, {"score": 0.004680473391946691, "phrase": "computer_networks"}, {"score": 0.0046364836476864325, "phrase": "multi-server_architecture"}, {"score": 0.004258644418211771, "phrase": "cryptographic_keys"}, {"score": 0.004100712177044264, "phrase": "user's_biometrics"}, {"score": 0.003784209997115174, "phrase": "biometrics-based_multi-server"}, {"score": 0.0033465923623290034, "phrase": "stolen_smart_card"}, {"score": 0.0032529910932231924, "phrase": "service_attacks"}, {"score": 0.0031470870157364666, "phrase": "mishra"}, {"score": 0.0030590445140753187, "phrase": "efficient_biometrics-based_multi-server"}, {"score": 0.00297346171320082, "phrase": "hash_functions"}, {"score": 0.0025316905609748135, "phrase": "robust_biometrics_and_public-key_techniques-based_authentication_scheme"}], "paper_keywords": ["authentication", " hash function", " biometrics", " multi-server environments"], "paper_abstract": "With the rapid development of computer networks, multi-server architecture has attracted much attention in many network environments. Moreover, in order to achieve non-repudiation which both passwords and cryptographic keys cannot provide, several password authentication schemes combining a user's biometrics for multi-server environments have been proposed in the past. In 2014, Chuang et al. presented a biometrics-based multi-server authenticated key agreement scheme and declared that their scheme was efficient and secure. Later, Mishra et al. commented that the scheme by Chuang et al. was susceptible to stolen smart card, impersonation and denial of service attacks. To conquer these weaknesses, Mishra et al. presented an efficient biometrics-based multi-server authenticated key agreement scheme using hash functions. However, we prove that the scheme by Mishra et al. is insecure against forgery, server masquerading and lacks perfect forward secrecy. The focus of this paper is to present a robust biometrics and public-key techniques-based authentication scheme, which is a significant enhancement to the scheme recently proposed by Mishra et al. The highlight of our scheme is that it not only conquers the flaws but also is efficient compared with other related authenticated key agreement schemes. Copyright (c) 2015John Wiley & Sons, Ltd.", "paper_title": "A biometrics and smart cards-based authentication scheme for multi-server environments", "paper_id": "WOS:000363883200022"}