{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "lifetime_vector"}, {"score": 0.00740661116382159, "phrase": "maximum_lifetime_vector"}, {"score": 0.004778258911940497, "phrase": "wireless_sensor_networks"}, {"score": 0.004652016085325825, "phrase": "sensor_network"}, {"score": 0.0045464538515249085, "phrase": "intensive_study"}, {"score": 0.004426308135681733, "phrase": "network_lifetime"}, {"score": 0.0043258453436258405, "phrase": "first_data-generating_sensor"}, {"score": 0.004053362743156545, "phrase": "network_partition"}, {"score": 0.0036553070575015344, "phrase": "useful_data"}, {"score": 0.003398780792129312, "phrase": "first_sensor"}, {"score": 0.0029158847555394714, "phrase": "linear_programming_problems"}, {"score": 0.0028936226331006563, "phrase": "high-order_complexities"}, {"score": 0.0028278480051602355, "phrase": "fully_distributed_algorithm"}, {"score": 0.002629238854352447, "phrase": "previous_iteration"}, {"score": 0.0025694584194998356, "phrase": "optimal_result"}, {"score": 0.002530359917257626, "phrase": "lengthy_computation"}, {"score": 0.0025014259919355453, "phrase": "proposed_distributed_algorithm"}, {"score": 0.002370704665003412, "phrase": "better_result"}, {"score": 0.0021049977753042253, "phrase": "low_overhead"}], "paper_keywords": ["Network lifetime", " sensor networks"], "paper_abstract": "Maximizing the lifetime of a sensor network has been a subject of intensive study. However, much prior work defines the network lifetime as the time before the first data-generating sensor in the network runs out of energy or is not reachable to the sink due to network partition. The problem is that even though one sensor is out of operation, the rest of the network may well remain operational, with other sensors generating useful data and delivering those data to the sink. Hence, instead of just maximizing the time before the first sensor is out of operation, we should maximize the lifetime vector of the network, consisting of the lifetimes of all sensors, sorted in ascending order. For this problem, there exists only a centralized algorithm that solves a series of linear programming problems with high-order complexities. This paper proposes a fully distributed algorithm that runs iteratively. Each iteration produces a lifetime vector that is better than the vector produced by the previous iteration. Instead of giving the optimal result in one shot after lengthy computation, the proposed distributed algorithm has a result at any time, and the more time spent gives the better result. We show that when the algorithm stabilizes, its result produces the maximum lifetime vector. Furthermore, simulations demonstrate that the algorithm is able to converge rapidly toward the maximum lifetime vector with low overhead.", "paper_title": "Maximizing Lifetime Vector in Wireless Sensor Networks", "paper_id": "WOS:000323513000013"}