{"auto_keywords": [{"score": 0.04315568411098275, "phrase": "bacterial_evolutionary_system"}, {"score": 0.04016653639975649, "phrase": "artificial_bacteria"}, {"score": 0.00481495049065317, "phrase": "intelligent_systems"}, {"score": 0.0047555023078686386, "phrase": "constantly_changing_environments"}, {"score": 0.0045249263666466005, "phrase": "open-ended_bio-inspired_evolutionary_construction"}, {"score": 0.004199766284749713, "phrase": "extensive_results"}, {"score": 0.0039221899471111, "phrase": "real_constantly_changing_environments"}, {"score": 0.003039311963787733, "phrase": "problem_independence"}, {"score": 0.0030017207229983385, "phrase": "general-purpose_capabilities"}, {"score": 0.002855934865505357, "phrase": "fuzzy_rule-based_systems"}, {"score": 0.0027684263985790526, "phrase": "robustness_and_fault_tolerance_capabilities"}, {"score": 0.0026175952455594277, "phrase": "sudden_changes"}, {"score": 0.0021715812867126884, "phrase": "real_time"}], "paper_keywords": ["Natural computing", " Bio-inspired computation", " Evolutionary computation", " Open-ended evolution"], "paper_abstract": "This paper explores the capabilities of open-ended bio-inspired evolutionary construction of intelligent systems under changing environments. We present and analyze extensive results of the bacterial evolutionary system. This system creates 3D environments that simulate real constantly changing environments. Populations of artificial bacteria constantly evolve their inner biological processes in these environments as they perform every action programmed in their life cycle. This results in a decentralized, asynchronous, parallel and self-adapting general-purpose evolutionary process whose only goal is the survival of the bacterial population under successive, continuously changing environmental conditions. Results show the problem independence and general-purpose capabilities of the system by making it evolve fuzzy rule-based systems under different environments. Robustness and fault tolerance capabilities are also tested by subjecting the bacterial evolutionary system to sudden changes in the environment. Evolution is open-ended as there is no need to restart the system when changes take place. Artificial bacteria self-adapt themselves in real time in order to guarantee their survival.", "paper_title": "Bacterially inspired evolution of intelligent systems under constantly changing environments", "paper_id": "WOS:000351408300024"}