{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "user_experience"}, {"score": 0.04445199574489949, "phrase": "psychometric_scales"}, {"score": 0.04164228196739029, "phrase": "news_content"}, {"score": 0.03802045639379259, "phrase": "recommended_links"}, {"score": 0.0047787596516662, "phrase": "online_news_interactions"}, {"score": 0.004654210559456924, "phrase": "online_information_experiences"}, {"score": 0.004332199142914195, "phrase": "online_news_website"}, {"score": 0.003239114833599948, "phrase": "concurrent_validity"}, {"score": 0.0031784960695034645, "phrase": "interest_ratings"}, {"score": 0.002913895605074143, "phrase": "greater_self-reported_engagement"}, {"score": 0.0028485585670146025, "phrase": "perceived_usability"}, {"score": 0.002827105825163379, "phrase": "positive_ratings"}, {"score": 0.002763709443278514, "phrase": "lower_physiological_activity"}, {"score": 0.0025819015229390663, "phrase": "useful_framework"}, {"score": 0.002552781867125423, "phrase": "online_information_interactions"}, {"score": 0.002495521662819317, "phrase": "broader_conceptualization"}, {"score": 0.002476721068743341, "phrase": "information_interaction"}, {"score": 0.0023938516706864775, "phrase": "mixed-methods_approach"}, {"score": 0.002169667676959813, "phrase": "physiological_data"}, {"score": 0.0021049977753042253, "phrase": "users'_subjective_experiences"}], "paper_keywords": ["text mining", " content filtering", " automatic classification"], "paper_abstract": "When it comes to evaluating online information experiences, what metrics matter? We conducted a study in which 30 people browsed and selected content within an online news website. Data collected included psychometric scales (User Engagement, Cognitive Absorption, System Usability Scales), self-reported interest in news content, and performance metrics (i.e., reading time, browsing time, total time, number of pages visited, and use of recommended links); a subset of the participants had their physiological responses recorded during the interaction (i.e., heart rate, electrodermal activity, electrocmytogram). Findings demonstrated the concurrent validity of the psychometric scales and interest ratings and revealed that increased time on tasks, number of pages visited, and use of recommended links were not necessarily indicative of greater self-reported engagement, cognitive absorption, or perceived usability. Positive ratings of news content were associated with lower physiological activity. The implications of this research are twofold. First, we propose that user experience is a useful framework for studying online information interactions and will result in a broader conceptualization of information interaction and its evaluation. Second, we advocate a mixed-methods approach to measurement that employs a suite of metrics capable of capturing the pragmatic (e.g., usability) and hedonic (e.g., fun, engagement) aspects of information interactions. We underscore the importance of using multiple measures in information research, because our results emphasize that performance and physiological data must be interpreted in the context of users' subjective experiences.", "paper_title": "Mixed-methods approach to measuring user experience in online news interactions", "paper_id": "WOS:000321743500003"}