{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "design_intent"}, {"score": 0.007923449414192995, "phrase": "data_model"}, {"score": 0.0047804843375940835, "phrase": "building_simulation_models"}, {"score": 0.004746263721902201, "phrase": "risk_assessment"}, {"score": 0.00471228691115201, "phrase": "simulation-based_methods"}, {"score": 0.004578783486828809, "phrase": "complex_systems_risk_assessment"}, {"score": 0.0042459818200777846, "phrase": "new_hazards"}, {"score": 0.0042004472903194616, "phrase": "simulation_model_builders"}, {"score": 0.004052148727852149, "phrase": "abnormal_behavior"}, {"score": 0.003951453722517865, "phrase": "simulation_model"}, {"score": 0.0037305551963210523, "phrase": "abnormal_conditions"}, {"score": 0.0036640806940633373, "phrase": "component_failures"}, {"score": 0.0035473867669654174, "phrase": "simulation-based_risk_assessment_methods"}, {"score": 0.0033490008882413103, "phrase": "simulation_models"}, {"score": 0.0030830390264125923, "phrase": "domain_safety"}, {"score": 0.003038983069081333, "phrase": "advanced_computer_simulation-based_methods"}, {"score": 0.002910545717767559, "phrase": "functional_failure_identification"}, {"score": 0.0025752890978323873, "phrase": "information_system"}, {"score": 0.0025476254812544135, "phrase": "user_interface"}, {"score": 0.0025021765811679446, "phrase": "hazop_professionals"}, {"score": 0.0023033100935570755, "phrase": "ffip_simulation_models"}, {"score": 0.0022218413146898887, "phrase": "ffip_experts"}, {"score": 0.0021278653331014614, "phrase": "system-wide_fault_propagation"}, {"score": 0.0021049977753042253, "phrase": "boiling_water_reactor_case"}], "paper_keywords": [""], "paper_abstract": "Simulation-based methods are emerging to address the challenges of complex systems risk assessment, and this paper identifies two problems related to the use of such methods. First, the methods cannot identify new hazards if the simulation model builders are expected to foresee the hazards and incorporate the abnormal behavior related to the hazard into the simulation model. Therefore, this paper uses the concept of deviation from design intent to systematically capture abnormal conditions that may lead to component failures, hazards, or both. Second, simulation-based risk assessment methods should explicitly consider what expertise is required from the experts that build and use the simulation models-the transfer of the methods to real engineering practice will be severely hindered if they must be performed by persons that are expert in domain safety as well as advanced computer simulation-based methods. This paper addresses both problems in the context of the functional failure identification and propagation (FFIP) method. One industrially established risk assessment method, hazard and operability study (HAZOP), is harnessed to systematically obtain the deviations from design intent in the application under study. An information system presents a user interface that is understandable to HAZOP professionals, so that their inputs are transparently entered to a data model that captures the deviations. From the data model, instructions for configuring FFIP simulation models are printed in a form that is understandable for FFIP experts. The method is demonstrated for discovering a hazard resulting from system-wide fault propagation in a boiling water reactor case.", "paper_title": "Capturing Deviations From Design Intent in Building Simulation Models for Risk Assessment", "paper_id": "WOS:000365270500011"}