{"auto_keywords": [{"score": 0.04701209021022985, "phrase": "end-to-end_call_acceptance"}, {"score": 0.044765693501921916, "phrase": "routing_protocol"}, {"score": 0.040108824253493075, "phrase": "call_acceptance"}, {"score": 0.00481495049065317, "phrase": "multiple_channels"}, {"score": 0.0047006058139556686, "phrase": "tdma_based_wireless_mesh_network"}, {"score": 0.004244040105917499, "phrase": "channel_assignment_algorithm"}, {"score": 0.0040569185796103845, "phrase": "designated_set"}, {"score": 0.0037293497729169235, "phrase": "wmn"}, {"score": 0.0036406779213379154, "phrase": "existing_routing_protocols"}, {"score": 0.0036188435232325337, "phrase": "channel_assignment_algorithms"}, {"score": 0.003543445557071389, "phrase": "network_dimensioning"}, {"score": 0.003522192233486405, "phrase": "comparative_study"}, {"score": 0.0035010659378711816, "phrase": "different_protocols"}, {"score": 0.003438441702164516, "phrase": "tdma-based_wmn"}, {"score": 0.0033465923623290034, "phrase": "differentiated_class"}, {"score": 0.0023745087648471613, "phrase": "weighted_cumulative_expected_transmission_time"}, {"score": 0.002290345512054784, "phrase": "sp"}, {"score": 0.0022022878843247257, "phrase": "wcett_metric"}, {"score": 0.002162844717299508, "phrase": "better_routing_metrics"}, {"score": 0.0021433882705962034, "phrase": "mc-mr_network"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Probability of call acceptance", " Multi-Channel Multi-Radio", " QoS routing", " TDMA", " Wireless Mesh Networks"], "paper_abstract": "In this paper, we theoretically analyze the performance in terms of end-to-end call acceptance in Multi-Channel Multi-Radio (MC-MR) Wireless Mesh Networks (WMNs) using queueing theory techniques. We study the impact of the routing protocol and the channel assignment algorithm on the end-to-end call acceptance and address the issue of providing deterministic QoS guarantees to a designated set of nodes. The significance of our work lies in providing an insight into the bounds of the probability of call acceptance under a given set of parameters for a WMN and provide a framework for comparison of existing routing protocols and channel assignment algorithms. This can be used for network dimensioning and comparative study of different protocols. We have adopted a TDMA-based WMN as our base framework. We consider the case of differentiated class of users and derive upper (P-Acc(Max)) and lower (P-Acc(Min)) bounds for the probability of call acceptance (P-Acc) and theoretically estimate the probability of system saturation (P-sat) (which is the probability that no more new calls can be accepted in the network). Through simulations, we study the dependence of the (P-Acc) on the number of radios in each node (N). the number of channels available in the network (C), the network load (rho), the routing protocol used, and the channel assignment algorithm. We also study the effect of Weighted Cumulative Expected Transmission Time (WCETT) routing metric and compare its performance with the Shortest Path (SP) routing protocol. The increase in P-Acc with the WCETT metric emphasizes the need to consider better routing metrics in an MC-MR network. (C) 2009 Elsevier B.V. All rights reserved.", "paper_title": "Impact of multiple channels and radios on the performance of a TDMA based wireless mesh network", "paper_id": "WOS:000268415700015"}