{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "deteriorating_items"}, {"score": 0.04676476767585924, "phrase": "purchasing_cost"}, {"score": 0.02833407608751138, "phrase": "variable_purchasing_cost"}, {"score": 0.02803093454138703, "phrase": "credit_period"}, {"score": 0.004762202897268383, "phrase": "lot-size_and_time-dependent_purchasing_cost"}, {"score": 0.00433645229352341, "phrase": "replenishment_lot-size"}, {"score": 0.004149429072483132, "phrase": "quantity_discount_effect"}, {"score": 0.0036958398682001015, "phrase": "effective_improvements"}, {"score": 0.003459191419478298, "phrase": "learning_curve"}, {"score": 0.003309877074892399, "phrase": "purchasing_cost_pattern"}, {"score": 0.002713604305939145, "phrase": "finite_time_horizon"}, {"score": 0.0021049977753042253, "phrase": "retailer_behavior"}], "paper_keywords": ["credit period", " variable purchasing cost", " deteriorating item", " demand function"], "paper_abstract": "In the real world, the purchasing cost would normally decrease as the replenishment lot-size becomes larger. In other words, the quantity discount effect applies. The purchasing cost may also decrease with the passage of time, for example if the supplier has made effective improvements in their production efficiency, in other words due to the effect of the learning curve. In this article we discuss a purchasing cost pattern which considers these phenomena: i. e., lot-size and time-dependence. The objective of the model is to make decisions related to the pricing and replenishment of deteriorating items over a finite time horizon, given variable purchasing cost and credit period. We provide the properties and develop algorithms for solving the problems described. Also, we discuss the influence of the variable purchasing cost, the length of the credit period, the rate of deterioration, etc., on the retailer behavior.", "paper_title": "Joint pricing and replenishment decisions for deteriorating items with lot-size and time-dependent purchasing cost under credit period", "paper_id": "WOS:000247469300002"}