{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "user_experience"}, {"score": 0.004772593750252861, "phrase": "augmented_reality_eyeglasses"}, {"score": 0.0047306078475683865, "phrase": "augmented_reality_based_applications"}, {"score": 0.0044272138900038095, "phrase": "handled_devices"}, {"score": 0.004330450801016359, "phrase": "specific_scenarios"}, {"score": 0.003742554019950264, "phrase": "recent_launch"}, {"score": 0.0032919615578986816, "phrase": "pleasant_experience"}, {"score": 0.0029733865110222785, "phrase": "ar_viewer"}, {"score": 0.0026267609106294817, "phrase": "field_evaluation"}, {"score": 0.0025578967205807843, "phrase": "head-mounted_display"}, {"score": 0.002382936364692606, "phrase": "field_trails"}, {"score": 0.0021331586055770447, "phrase": "possible_issues"}, {"score": 0.0021049977753042253, "phrase": "visual_fatigue"}], "paper_keywords": ["Augmented Reality", " Wearable Computers", " Eyeglasses", " User Experience"], "paper_abstract": "Augmented reality based applications have been experimented with in various contexts. Typically, the interaction is supported by handled devices, which, in specific scenarios, may hinder the interaction and spoil the experience of use, as the user is forced to hold the device and to keep her eyes on it at all times. The recent launch on the market of light-weight, unobtrusive head-mounted displays may change this circumstance. Nevertheless, investigations are needed to understand if such head-worn devices effectively outperform handheld devices in terms of comfort and pleasant experience of use. Here we present two experiments aimed at assessing the comfort of wearing a head-worn, see-through AR viewer in both a controlled and a natural setting. Besides the comfort of wearing the device, aspects related to the user experience were also investigated in the field evaluation. Our findings suggest that the head-mounted display examined is comfortable to wear regardless of the context of use. Interestingly in the field trails, participants did not express concern for the impression they would have made on other people and the experience of use was overall pleasant. Possible issues related to visual fatigue emerged.", "paper_title": "Evaluating User Experience of Augmented Reality Eyeglasses", "paper_id": "WOS:000375005900006"}