{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "pre-edited_ann_classifier"}, {"score": 0.010896372051101156, "phrase": "asymptotic_optimization"}, {"score": 0.004635187610736025, "phrase": "artificial_neural_network"}, {"score": 0.004585338961877679, "phrase": "ann"}, {"score": 0.004486432283770142, "phrase": "unlimited_size"}, {"score": 0.004437910956996051, "phrase": "training_sample"}, {"score": 0.004068087482412997, "phrase": "improved_ann_network_model"}, {"score": 0.003512308265830794, "phrase": "related_theoretical_support"}, {"score": 0.0030989899982042236, "phrase": "ann_asymptotic_optimization"}, {"score": 0.0028096544129939277, "phrase": "non-parametric_classifier"}, {"score": 0.0027341763737751467, "phrase": "main_methods"}, {"score": 0.0023219374444738723, "phrase": "pre-edited_ann"}, {"score": 0.002128067018576581, "phrase": "experimental_support"}], "paper_keywords": ["Asymptotic optimization", " Generalization problem", " Artificial neural network"], "paper_abstract": "The generalization problem of an artificial neural network (ANN) classifier with unlimited size of training sample, namely asymptotic optimization in probability, is discussed in this paper. As an improved ANN network model, the pre-edited ANN classifier shows better practical performance than the standard one. However, it has not been widely applied due to the absence of the related theoretical support. To further promote its application in practice, the asymptotic optimization of the pre-edited ANN classifier is studied in this paper. To help study ANN asymptotic optimization in probability, we gives a review of the previous research works on asymptotic optimization in probability of non-parametric classifier, and grouped the main methods into four classes: two-step method, one-step method, generalization method and hypothesis method. In this paper, we adopt generalization/hypothesis mixed method to prove that pre-edited ANN is asymptotically optimal in probability. Furthermore, a simulation is presented to provide an experimental support for our theoretical work.", "paper_title": "The asymptotic optimization of pre-edited ANN classifier", "paper_id": "WOS:000268257700004"}