{"auto_keywords": [{"score": 0.049604883316905636, "phrase": "sonzai-kan_media"}, {"score": 0.047980353816681094, "phrase": "human_presence"}, {"score": 0.00481495049065317, "phrase": "minimal_human_design_approach"}, {"score": 0.004513255056769647, "phrase": "human-like_robotic_media"}, {"score": 0.003643185395780667, "phrase": "japanese_phrase"}, {"score": 0.0034317185678527672, "phrase": "minimal_design_approach"}, {"score": 0.0025571463140118805, "phrase": "telenoid"}, {"score": 0.002223770196464436, "phrase": "potential_advantages"}, {"score": 0.002168975681697056, "phrase": "positive_social_relationships"}, {"score": 0.002126111716875142, "phrase": "autonomous_agent"}, {"score": 0.0021049977753042253, "phrase": "minimal_cognitive_architecture"}], "paper_keywords": ["Human-robot Interaction", " Minimal design", " Elderly care", " Android science"], "paper_abstract": "Even though human-like robotic media give the feeling of being with others and positively affect our physical and mental health, scant research has addressed how much information about a person should be reproduced to enhance the feeling of a human presence. We call this feeling sonzai-kan, which is a Japanese phrase that means the feeling of a presence. We propose a minimal design approach for exploring the requirements to enhance this feeling and hypothesize that it is enhanced if information is presented from at least two different modalities. In this approach, the exploration is conducted by designing sonzai-kan media through exploratory research with the media, their evaluations, and the development of their systems. In this paper, we give an overview of our current work with Telenoid, a teleoperated android designed with our approach, to illustrate how we explore the requirements and how such media impact our quality of life. We discuss the potential advantages of our approach for forging positive social relationships and designing an autonomous agent with minimal cognitive architecture.", "paper_title": "Minimal Human Design Approach for sonzai-kan Media: Investigation of a Feeling of Human Presence", "paper_id": "WOS:000345994900012"}