{"auto_keywords": [{"score": 0.04844016223579157, "phrase": "imaging_system"}, {"score": 0.010612387000973441, "phrase": "in-and-out_activity"}, {"score": 0.004228768988306315, "phrase": "minimum_interference"}, {"score": 0.004188779311510202, "phrase": "regular_behavior"}, {"score": 0.00393163747242631, "phrase": "image_acquisition"}, {"score": 0.0037729898581369673, "phrase": "image-capturing_range"}, {"score": 0.0034635798581019073, "phrase": "bee_workers"}, {"score": 0.0034308013197924987, "phrase": "circular_character-encoding_tags"}, {"score": 0.003344895435289136, "phrase": "bees'_thoraxes"}, {"score": 0.0031895588542135245, "phrase": "black_positioning"}, {"score": 0.0029464822620763687, "phrase": "circular_tag"}, {"score": 0.0029185830864495313, "phrase": "extracted_character_symbols"}, {"score": 0.0027218799769229596, "phrase": "individual_honey_bee"}, {"score": 0.002578985917923144, "phrase": "tagged_bees"}, {"score": 0.0024747842618794255, "phrase": "character_symbol_recognition"}, {"score": 0.0024591303299708604, "phrase": "identification_accuracy_rates"}, {"score": 0.0023522840272302507, "phrase": "in-and-out_records"}, {"score": 0.0023079225317714815, "phrase": "honey_bees"}, {"score": 0.0022572213326336374, "phrase": "experimental_results"}, {"score": 0.0021659920594094407, "phrase": "efficient_tool"}, {"score": 0.0021454671611847507, "phrase": "honey_bee_behavior"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Honey bee", " Image processing", " Machine learning", " Optical character recognition", " Support vector machine"], "paper_abstract": "This study aimed to develop an imaging system for monitoring and analyzing the in-and-out activity of honey bees as they pass through the entrance of a beehive. As such, the daily in-and-out activity of a beehive could be automatically recorded with minimum interference with the regular behavior of the bees. The components of the imaging system include: (1) an infrared LED light source; (2) an infrared CCD camera and a personal computer for image acquisition and processing; and (3) an acrylic passageway to temporarily confine the bees within the image-capturing range of the camera. In operation, this imaging system was affixed to the outside of a beehive at the entry/exit point. To identify each forager of bee workers individually, circular character-encoding tags were attached to the dorsum of the bees' thoraxes. To locate individual honey bees in a video frame, a circular Hough transform was used to detect the presence of the circular tags. A black positioning dot on the tag was used to identify the orientation of the characters in order to facilitate the reading of the symbols on the circular tag. The extracted character symbols were further segmented and a support vector machine (SVM) classifier was deployed to recognize the characters and identify the individual honey bee. The system developed in this study was used in experimentation to identify each of the tagged bees and to record the timing of the entries and exits. The character symbol recognition and identification accuracy rates of the system were about 98% and 86%, respectively. Based on the in-and-out records, daily foraging behavior of honey bees were analyzed and presented. These experimental results demonstrate that this imaging system is feasible and can be used as an efficient tool to study honey bee behavior. (C) 2012 Elsevier B.V. All rights reserved.", "paper_title": "An imaging system for monitoring the in-and-out activity of honey bees", "paper_id": "WOS:000311245300012"}