{"auto_keywords": [{"score": 0.049256532270185484, "phrase": "road_network"}, {"score": 0.00481495049065317, "phrase": "travel_time_reliability_estimation_model_using_observed_link_flows"}, {"score": 0.004492406361795448, "phrase": "travel_time_reliability"}, {"score": 0.004143196873246147, "phrase": "traffic_capacity"}, {"score": 0.004095567486538121, "phrase": "travel_demand"}, {"score": 0.0037336520904376687, "phrase": "path-based_problem"}, {"score": 0.003463196032143783, "phrase": "path_travel_time_reliability"}, {"score": 0.003138768436081888, "phrase": "unique_travel_time_reliability"}, {"score": 0.0027475383418803724, "phrase": "predefined_path"}, {"score": 0.0025780134737796085, "phrase": "standard_maximum_likelihood"}, {"score": 0.0022696277881969896, "phrase": "unknown_parameters"}, {"score": 0.0021668575137633317, "phrase": "standard_ml_estimation_method"}], "paper_keywords": [""], "paper_abstract": "This article formulates a model that calculates travel time reliability in a road network. The sources of uncertainty addressed by the model are traffic capacity and travel demand. Because travel time reliability estimation problem, in general, is formulated as a path-based problem, path enumeration can be required in advance. Thus, the path travel time reliability can depend on a path set enumerated in advance. For the purpose of determining the unique travel time reliability, a model that estimates stochastic path flows by using observed link flows is then presented. This method does not require predefined path set. However, this method is similar to the standard maximum likelihood (ML) estimation method, the method presented in this study is easier to be solved because the number of unknown parameters is much smaller than that of the standard ML estimation method. Numerical experiments using two networks are carried out to demonstrate the model presented in this article.", "paper_title": "Travel Time Reliability Estimation Model Using Observed Link Flows in a Road Network", "paper_id": "WOS:000354488100004"}