{"auto_keywords": [{"score": 0.044476153128415616, "phrase": "dual_tasking"}, {"score": 0.00481495049065317, "phrase": "serious_challenge"}, {"score": 0.004565876339189493, "phrase": "greatest_challenges"}, {"score": 0.0040097139701644165, "phrase": "educational_outcomes"}, {"score": 0.003916098498242888, "phrase": "present_investigation"}, {"score": 0.0036914757355166966, "phrase": "non-lecture_related_activities"}, {"score": 0.0030554300179552415, "phrase": "existing_research"}, {"score": 0.002931569771634119, "phrase": "significant_cost"}, {"score": 0.0028630535573013686, "phrase": "computer_mediated_non-lecture_related_activities"}, {"score": 0.0027469703311742647, "phrase": "lecture_material"}, {"score": 0.0023003498123420237, "phrase": "theoretical_and_practical_implications"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Attention", " Divided attention", " Mind wandering", " Technology", " Computers and education"], "paper_abstract": "The influx of technology into the classroom presents a serious challenge for educators and researchers. One of the greatest challenges is to better understand, given our knowledge of the demands of dual tasking, how the distraction posed by this technology influences educational outcomes. In the present investigation we explore the impact of engaging in computer mediated non-lecture related activities (e.g., email, surfing the web) during a lecture on attention to, and retention of, lecture material. We test a number of predictions derived from existing research on dual tasking. Results demonstrate a significant cost of engaging in computer mediated non-lecture related activities to both attention and retention of lecture material, a reduction in the frequency of mind wandering during the lecture, and evidence for difficulty coordinating attention in lectures with distractions present. Discussion focuses on the theoretical and practical implications of these results for dividing attention in the classroom. (C) 2013 Elsevier Ltd. All rights reserved.", "paper_title": "Everyday attention: Mind wandering and computer use during lectures", "paper_id": "WOS:000324080800026"}