{"auto_keywords": [{"score": 0.04837595362187189, "phrase": "lognormal_regression_models"}, {"score": 0.044992003571349644, "phrase": "response_variables"}, {"score": 0.03130213614376333, "phrase": "negative_binomial_regression_model"}, {"score": 0.015617698762345191, "phrase": "informetric_studies"}, {"score": 0.007859504152637113, "phrase": "lognormal_regression_model"}, {"score": 0.00481495049065317, "phrase": "count_response_variables"}, {"score": 0.0044491728131708505, "phrase": "count_regression_models"}, {"score": 0.004248718518635191, "phrase": "identified_count_response_variables"}, {"score": 0.003748823861741978, "phrase": "count_nature"}, {"score": 0.0035445922786327575, "phrase": "patent_and_trademark_office"}, {"score": 0.003340420612167456, "phrase": "maclean's_magazine"}, {"score": 0.003148547047542657, "phrase": "poisson"}, {"score": 0.003086311260099341, "phrase": "generalized_poisson_regression_models"}, {"score": 0.002777227714581881, "phrase": "negative_values"}, {"score": 0.0027318042427022953, "phrase": "nine_response_variables"}, {"score": 0.0026085220231994955, "phrase": "akaike's_information_criterion"}, {"score": 0.002591400859234429, "phrase": "aic"}, {"score": 0.002565850749422255, "phrase": "bayesian_information_criterion"}, {"score": 0.0025490078065056455, "phrase": "bic"}, {"score": 0.0024662589776071864, "phrase": "fit_statistics"}, {"score": 0.0022118223311537954, "phrase": "significant_difference"}, {"score": 0.0021470954708827125, "phrase": "remaining_three_response_variables"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Count response variable", " Linear regression model", " Count regression models", " Negative binomial regression model", " Lognormal regression model", " Informetric studies"], "paper_abstract": "The purpose of the study is to compare the performance of count regression models to those of linear and lognormal regression models in modelling count response variables in informetric studies. Identified count response variables in informetric studies include the number of authors, the number of references, the number of views, the number of downloads, and the number of citations received by an article. Also of a count nature are the number of links from and to a website. Data were collected from the United States Patent and Trademark Office (www.usptagov), an open access journal (wwwinformationr.netiirJ), Web of Science, and Maclean's magazine. The datasets were then used to compare the performance of linear and lognormal regression models with those of Poisson, negative binomial, and generalized Poisson regression models. It was found that due to overdispersion in most response variables, the negative binomial regression model often seems to be more appropriate for informetric datasets than the Poisson and generalized Poisson regression models. Also, the regression analyses showed that linear regression model predicted some negative values for five of the nine response variables modelled, and for all the response variables, it performed worse than both the negative binomial and lognormal regression models when either Akaike's Information Criterion (AIC) or Bayesian Information Criterion (BIC) was used as the measure of goodness of fit statistics. The negative binomial regression model performed significantly better than the lognormal regression model for four of the response variables while the lognormal regression model performed significantly better than the negative binomial regression model for two of the response variables but there was no significant difference in the performance of the two models for the remaining three response variables. (C) 2015 Elsevier Ltd. All rights reserved.", "paper_title": "Modelling count response variables in informetric studies: Comparison among count, linear, and lognormal regression models", "paper_id": "WOS:000360907400008"}