{"auto_keywords": [{"score": 0.049178471674397164, "phrase": "biometric_system"}, {"score": 0.00481495049065317, "phrase": "ranking_subjects"}, {"score": 0.004769444094319619, "phrase": "recognition_performance"}, {"score": 0.0043235627487378595, "phrase": "relatively_new_fusion_strategy"}, {"score": 0.004019797503157808, "phrase": "different_set"}, {"score": 0.003994409920585572, "phrase": "fusion_parameters"}, {"score": 0.003485605409687907, "phrase": "multimodal_biometrics"}, {"score": 0.003334309053314909, "phrase": "user-specific_and_selective_fusion"}, {"score": 0.0032302647179383915, "phrase": "thorough_analyses"}, {"score": 0.0031493643207295406, "phrase": "biometric_output"}, {"score": 0.0030900173244612075, "phrase": "user-specific_score_normalization_procedure"}, {"score": 0.0029464822620763687, "phrase": "user-specific_parameters"}, {"score": 0.0028006988338192375, "phrase": "training_score_dataset"}, {"score": 0.0027566337241307286, "phrase": "obtained_rank_order"}, {"score": 0.0027046673104220422, "phrase": "rank_order"}, {"score": 0.0026036473098881344, "phrase": "test_set"}, {"score": 0.002522344964242888, "phrase": "performance_gain"}, {"score": 0.0024984517279573906, "phrase": "user-specific_and_-selective_fusion_strategy"}, {"score": 0.0024513404432665153, "phrase": "different_values"}, {"score": 0.0023079225317714815, "phrase": "fifteen_sets"}, {"score": 0.0022933216359142736, "phrase": "multimodal_fusion_experiments"}, {"score": 0.0021728771392034462, "phrase": "conventional_fusion_system"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Biometrics", " Multibiometrics", " Fusion", " Doddington's Zoo", " User-specific fusion", " Client specific fusion"], "paper_abstract": "The recognition performance of a biometric system varies significantly from one enrolled user to another. As a result, there is a need to tailor the system to each user. This study investigates a relatively new fusion strategy that is both user-specific and selective. By user-specific, we understand that each user in a biometric system has a different set of fusion parameters that have been tuned specifically to a given enrolled user. By selective, we mean that only a subset of modalities may be chosen for fusion. The rationale for this is that if one biometric modality is sufficiently good to recognize a user, fusion by multimodal biometrics would not be necessary, we advance the state of the art in user-specific and selective fusion in the following ways: (1) provide thorough analyses of (a) the effect of pre-processing the biometric output (prior to applying a user-specific score normalization procedure) in order to improve its central tendency and (b) the generalisation ability of user-specific parameters; (2) propose a criterion to rank the users based solely on a training score dataset in such a way that the obtained rank order will maximally correlate with the rank order that is obtained if it were to be computed on the test set; and, (3) experimentally demonstrate the performance gain of a user-specific and -selective fusion strategy across fusion data sets at different values of \"pruning rate\" that control the percentage of subjects for whom fusion is not required. Fifteen sets of multimodal fusion experiments carried out on the XM2VTS score-level benchmark database show that even though our proposed user-specific and -selective fusion strategy, its performance compares favorably with the conventional fusion system that considers all information. (C) 2013 Elsevier Ltd. All rights reserved.", "paper_title": "A user-specific and selective multimodal biometric fusion strategy by ranking subjects", "paper_id": "WOS:000323804100016"}