{"auto_keywords": [{"score": 0.0497377294589231, "phrase": "paperless_labeling"}, {"score": 0.00481495049065317, "phrase": "pharmacists'_readiness"}, {"score": 0.004450568197899267, "phrase": "nationally_representative_sample"}, {"score": 0.004371660146981191, "phrase": "chain_pharmacies"}, {"score": 0.004340488340181084, "phrase": "independent_retail_pharmacies"}, {"score": 0.004202931484732134, "phrase": "quantitative_and_qualitative_analyses"}, {"score": 0.004084307764140389, "phrase": "cross-sectional_survey"}, {"score": 0.004040688646993605, "phrase": "american_pharmacists_association_pharmacists"}, {"score": 0.003912595576016982, "phrase": "pharmacists'_attitudinal_readiness"}, {"score": 0.0036684182697540382, "phrase": "electronic_resources"}, {"score": 0.0035776145006375173, "phrase": "paperless_labeling_initiative"}, {"score": 0.0032016639006812856, "phrase": "work_access"}, {"score": 0.0031335830806256777, "phrase": "fax_machines"}, {"score": 0.0029064676523923886, "phrase": "drug_information"}, {"score": 0.0026384167183586015, "phrase": "respondents'_comments"}, {"score": 0.0025182951088683863, "phrase": "corporate_or_pharmacy_buy-in"}, {"score": 0.0023864566654035924, "phrase": "first_nationwide_study"}, {"score": 0.00235247790591897, "phrase": "pharmacists'_perspectives"}, {"score": 0.0021201492891323587, "phrase": "product_label_manufacturers"}, {"score": 0.0021049977753042253, "phrase": "corporate_pharmacy_offices"}], "paper_keywords": [""], "paper_abstract": "Objective To assess the state of readiness for the adoption of paperless labeling among a nationally representative sample of pharmacies, including chain pharmacies, independent retail pharmacies, hospitals, and other rural or urban dispensing sites. Methods Both quantitative and qualitative analyses were used to analyze responses to a cross-sectional survey disseminated to American Pharmacists Association pharmacists nationwide. The survey assessed factors related to pharmacists' attitudinal readiness (ie, perceptions of impact) and pharmacies' structural readiness (eg, availability of electronic resources, internet access) for the paperless labeling initiative. Results We received a total of 436 survey responses (6% response rate) from pharmacists representing 44 US states and territories. Across the spectrum of settings we studied, pharmacists had work access to computers, printers, fax machines and access to the internet or intranet. Approximately 79% of respondents believed that the initiative would improve the adequacy of drug information available in their work site and 95% believed it would either not change (33%) or would improve (62%) communication to patients. Overall, respondents' comments supported advancing the initiative; however, some comments revealed reservations regarding corporate or pharmacy buy-in, success of implementation, and ease of adoption. Conclusions This is the first nationwide study to report about pharmacists' perspectives on paperless labeling. In general, pharmacists believe they are ready and that their pharmacies are well equipped for the transition to paperless labeling. Further exploration of perspectives from product label manufacturers and corporate pharmacy offices is needed to understand fully what will be necessary to complete this transition.", "paper_title": "An assessment of pharmacists' readiness for paperless labeling: a national survey", "paper_id": "WOS:000336716000009"}