{"auto_keywords": [{"score": 0.022794973292987356, "phrase": "retrieval_effectiveness"}, {"score": 0.010612387000973441, "phrase": "structural_difference"}, {"score": 0.009960023035449647, "phrase": "trec"}, {"score": 0.008205750841976606, "phrase": "web_page"}, {"score": 0.0076028232031210615, "phrase": "first_phase"}, {"score": 0.004546252387071551, "phrase": "microblog_track"}, {"score": 0.00446004569562802, "phrase": "real-time_ad-hoc_retrieval_task"}, {"score": 0.004347629793717084, "phrase": "reverse-chronological_order"}, {"score": 0.004238035283883863, "phrase": "two-phase_approach"}, {"score": 0.004131191955939713, "phrase": "ad-hoc_way"}, {"score": 0.004052823656906696, "phrase": "temporal_information"}, {"score": 0.003802135020791801, "phrase": "short_messages"}, {"score": 0.003566897271386661, "phrase": "short_message"}, {"score": 0.0034880375790382586, "phrase": "different_structures"}, {"score": 0.003251328737784481, "phrase": "divide-and-conquer_strategy"}, {"score": 0.002916618252808186, "phrase": "second_phase"}, {"score": 0.002815864555488112, "phrase": "temporal_distributions"}, {"score": 0.0027099059684582176, "phrase": "time-related_relevance_scores"}, {"score": 0.0026584273498059295, "phrase": "classified_types"}, {"score": 0.002591303221962211, "phrase": "time_scores"}, {"score": 0.0025665698207861533, "phrase": "ir_scores"}, {"score": 0.002251227801482381, "phrase": "better_retrieval_effectiveness"}, {"score": 0.0021595521075096808, "phrase": "retrieval_process"}], "paper_keywords": ["Experimentation", " Performance", " Ad-hoc retrieval of tweets", " learning to rank", " query temporal categorization"], "paper_abstract": "To explore the information seeking behaviors in microblogosphere, the microblog track at TREC 2011 introduced a real-time ad-hoc retrieval task that aims at ranking relevant tweets in reverse-chronological order. We study this problem via a two-phase approach: 1) retrieving tweets in an ad-hoc way; 2) utilizing the temporal information of tweets to enhance the retrieval effectiveness of tweets. Tweets can be categorized into two types. One type consists of short messages not containing any URL of a Web page. The other type has at least one URL of a Web page in addition to a short message. These two types of tweets have different structures. In the first phase, to address the structural difference of tweets, we propose a method to rank tweets using the divide-and-conquer strategy. Specifically, we first rank the two types of tweets separately. This produces two rankings, one for each type. Then we merge these two rankings of tweets into one ranking. In the second phase, we first categorize queries into several types by exploring the temporal distributions of their top-retrieved tweets from the first phase; then we calculate the time-related relevance scores of tweets according to the classified types of queries; finally we combine the time scores with the IR scores from the first phase to produce a ranking of tweets. Experimental results achieved by using the TREC 2011 and TREC 2012 queries over the TREC Tweets2011 collection show that: (i) our way of ranking the two types of tweets separately and then merging them together yields better retrieval effectiveness than ranking them simultaneously; (ii) our way of incorporating temporal information into the retrieval process yields further improvements, and (iii) our method compares favorably with state-of-the-art methods in retrieval effectiveness.", "paper_title": "The Impacts of Structural Difference and Temporality of Tweets on Retrieval Effectiveness", "paper_id": "WOS:000329123900005"}