{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "collaborative"}, {"score": 0.012044309316550207, "phrase": "netflix"}, {"score": 0.009226730833416744, "phrase": "movielens"}, {"score": 0.00443141503046841, "phrase": "recommender_system"}, {"score": 0.004203343568960231, "phrase": "recent_and_much-advertised_apple_product"}, {"score": 0.003810348067898898, "phrase": "new_method"}, {"score": 0.0037109446302945903, "phrase": "collaborative_filtering_processes"}, {"score": 0.0034539685987677376, "phrase": "collaborative_filtering_process"}, {"score": 0.0028485585670146025, "phrase": "similarity_measures"}, {"score": 0.002514464610980629, "phrase": "general_recommender_systems"}, {"score": 0.002476721068743341, "phrase": "recommender_systems"}, {"score": 0.0023938516706864775, "phrase": "relative_importance"}, {"score": 0.0022363199197710385, "phrase": "news_items"}, {"score": 0.002153316680437517, "phrase": "latest_sports_champions"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Recommender systems", " Collaborative filtering", " Significances", " Items"], "paper_abstract": "It seems reasonable to think that there may be some items and some users in a recommender system that could be highly significant in making recommendations. For instance, the recent and much-advertised Apple product may be regarded as more significant compared with an outdated MP3 device (which is still on sale). In this paper, we introduce a new method to improve the information used in collaborative filtering processes by weighting the ratings of the items according to their importance. We provide here a formalisation of the collaborative filtering process based on the concept of significance. In this way, the k-neighbours are calculated taking into account the ratings of the items, the significance of the items and the significance of each user for making recommendations to other users. This formalisation includes extensions of the concepts related to similarity measures and prediction/recommendation quality measures. We will show also the results obtained from a set of experiments using Movielens and Netflix. The results confirm the advantage of introducing the concept of significance in general recommender systems and especially in recommender systems in which it is easy to determine the relative importance of the items: for example, most widely sold products in e-commerce, most widely commented news items in web-news, most widely watched programs on TV, and the latest sports champions. (C) 2011 Elsevier Inc. All rights reserved.", "paper_title": "Collaborative filtering based on significances", "paper_id": "WOS:000297611600001"}