{"auto_keywords": [{"score": 0.03757333677908554, "phrase": "different_authorities"}, {"score": 0.015551603673996278, "phrase": "access_control"}, {"score": 0.012171513864330536, "phrase": "key_escrow_problem"}, {"score": 0.009832941468363159, "phrase": "central_authority"}, {"score": 0.00851932547652684, "phrase": "correct_decryption"}, {"score": 0.00481495049065317, "phrase": "multi-authority_attribute-based_encryption_scheme"}, {"score": 0.004790324917779855, "phrase": "lattices"}, {"score": 0.004685855684376706, "phrase": "sensitive_information"}, {"score": 0.004647803274157278, "phrase": "third-party_sites"}, {"score": 0.0045850648862091085, "phrase": "attribute-based_encryption"}, {"score": 0.004498644907312381, "phrase": "effective_combination"}, {"score": 0.0038213918438821646, "phrase": "practical_extension"}, {"score": 0.003780051719276704, "phrase": "abe"}, {"score": 0.003317211948933982, "phrase": "ma-abe_schemes"}, {"score": 0.003263480961148377, "phrase": "main_barrier"}, {"score": 0.003219368413618912, "phrase": "abe_schemes"}, {"score": 0.003193186694571698, "phrase": "'post-quantum'_world"}, {"score": 0.003107437621279721, "phrase": "ma-abe_scheme"}, {"score": 0.0029108902891803144, "phrase": "different_attribute_private_keys"}, {"score": 0.0028020140433538242, "phrase": "secret_information"}, {"score": 0.0026898636962522505, "phrase": "private_keys"}, {"score": 0.002512807643381776, "phrase": "simple_solution"}, {"score": 0.002485578020402187, "phrase": "user's_attribute"}, {"score": 0.0024319986343726615, "phrase": "common_public_information"}, {"score": 0.002353782218079617, "phrase": "first_ma-abe_scheme"}, {"score": 0.0022656961774446586, "phrase": "melissa_chase"}, {"score": 0.0022228943786652914, "phrase": "multi-authority_large_universe_abe_scheme"}, {"score": 0.00217496508306238, "phrase": "public_key"}, {"score": 0.0021049977753042253, "phrase": "attribute_authorities"}], "paper_keywords": ["LWE", " MA-ABE", " Lattices", " Preimage Sampling Functions"], "paper_abstract": "Access control can selectively restrict access to sensitive information stored by third-party sites on the Internet. Attribute-based encryption (ABE) schemes can strengthen the effective combination of flexibility and operability of access control. They allow one sender to encrypt a message for more than one recipient, and to specify who should be able to decrypt, using attributes alone. Since 2005, many powerful ABE schemes have been presented, but there are two types of problem that haven't be efficiently resolved so far. On the one hand, as practical extension of identity-based encryption (IBE) schemes, ABE schemes are also confronted with key escrow problem. On the other hand, attribute set belonging to one user is usually monitored by different authorities in this era of collaboration. Multi-authority ABE (MA-ABE) schemes can simultaneously resolve these problems, but now they have not been thoroughly investigated yet. More precisely, MA-ABE schemes against quantum attack are the main barrier of the development of ABE schemes in a 'post-quantum' world. In this paper, we firstly present a MA-ABE scheme from lattices, in which identities of users are authenticated by a central authority, which improves the efficiency of authentication. Furthermore, different attribute private keys are still distributed by different authorities, and the central authority cannot obtain any secret information of other attribute authorities, which resolves key escrow problem to some extent. In MA-ABE, attribute private keys belonging to one user are generated by different authorities, and how to ensure correct decryption is one of the crux of schemes. Our scheme gives a simple solution, and each user's attribute private keys are combined using sharing of common public information to automatically realize correct decryption. To our best knowledge, this is the first MA-ABE scheme from lattices, and it is more efficient than the MA-ABE presented by Melissa Chase. Finally, we present a multi-authority large universe ABE scheme, in which the sizes of the public key and the ciphertext are only relative to the number of the attribute authorities, and a user will be able to decrypt a ciphertext if and only if he has at least t(K) attributes from each authority K.", "paper_title": "Multi-Authority Attribute-Based Encryption Scheme from Lattices", "paper_id": "WOS:000355181300009"}