{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "ubiquitous_aortic_medial_amyloidal_medin_fragment"}, {"score": 0.00467424463996457, "phrase": "increased_understanding"}, {"score": 0.004615202066192795, "phrase": "molecular_conformation"}, {"score": 0.004576253356889219, "phrase": "amyloid_fibrils"}, {"score": 0.0043863636475983845, "phrase": "early_events"}, {"score": 0.004240116703465252, "phrase": "medically_important_assemblies"}, {"score": 0.003928572641266562, "phrase": "early_stages"}, {"score": 0.003829877278269543, "phrase": "harmful_species"}, {"score": 0.003578600071301459, "phrase": "short_amyloidogenic_peptide_fragments"}, {"score": 0.003533347967582184, "phrase": "medin_polypeptide"}, {"score": 0.0034445472801689046, "phrase": "unique_interest"}, {"score": 0.0034154440860550564, "phrase": "amyloid_deposits"}, {"score": 0.002821685815956478, "phrase": "three-stranded_polymeric_p-sheet"}, {"score": 0.0025919830205975215, "phrase": "well-defined_sequence"}, {"score": 0.0024947959375982614, "phrase": "stable_well-ordered_aggregates"}, {"score": 0.0024423826953133844, "phrase": "key_findings"}, {"score": 0.0023507916951658455, "phrase": "phenylalanine_residue"}, {"score": 0.0021593396036472777, "phrase": "recent_high-resolution_structures"}, {"score": 0.0021049977753042253, "phrase": "unique_insights"}], "paper_keywords": ["amyloid fibril formation", " molecular dynamics", " aortic medial amyloid", " aromatic interaction", " molecular recognition", " protein misfolding", " self-assembly"], "paper_abstract": "In recent years there is an increased understanding of the molecular conformation of amyloid fibrils. However, much less is known about the early events that lead to the formation of these medically important assemblies. The clarification of these very important mechanistic details on the process may indicate directions towards the inhibition of the early stages of the assembly, where harmful species are most likely to form. Here, we study the dynamics of assembly of short amyloidogenic peptide fragments from the medin polypeptide. This polypeptide is of unique interest since amyloid deposits composed of medin are found almost in all the population above the age of 50. Twelve independent 50 ns long molecular dynamics simulations in explicit water have been run on peptide NH2-NFGSVQFV-COOH, the minimal recognition hexapeptide element, NH2-NFGSVQ-COOH, and several single-point mutants. In all cases a three-stranded polymeric P-sheet was used as the basic unit from which fibrils can be formed. Our results clearly indicate the need of well-defined sequence and stereochemical constraints to allow the formation of stable well-ordered aggregates. One of the key findings is the need for the presence of a phenylalanine residue, but not other hydrophobic amino acids, in specific positions within the peptide. Taken together, the results are consistent with recent high-resolution structures of amyloid assemblies and provide unique insights into the dynamics of these structures. (c) 2006 Elsevier Inc. All rights reserved.", "paper_title": "The molecular dynamics of assembly of the ubiquitous aortic medial amyloidal medin fragment", "paper_id": "WOS:000245802900017"}