{"auto_keywords": [{"score": 0.035762438880225844, "phrase": "software_development"}, {"score": 0.019777739242314837, "phrase": "avaya"}, {"score": 0.00481495049065317, "phrase": "large_enterprise"}, {"score": 0.004638688538861392, "phrase": "industrial_software_engineering_research_organization"}, {"score": 0.004405188605303729, "phrase": "software_development_organizations"}, {"score": 0.004317576641196539, "phrase": "systematic_measurement_program"}, {"score": 0.003927358142506799, "phrase": "annual_report"}, {"score": 0.0038052556098065694, "phrase": "software_development_trends"}, {"score": 0.0037295306308856887, "phrase": "prioritized_recommendations"}, {"score": 0.003697538418750941, "phrase": "avaya's_software_development_capabilities"}, {"score": 0.0035518193979811367, "phrase": "goal-question-metric_approach"}, {"score": 0.0034118234596993836, "phrase": "enterprise's_problems"}, {"score": 0.003334309053314909, "phrase": "development_process"}, {"score": 0.0031481164109237636, "phrase": "avaya_labs"}, {"score": 0.002790170184447136, "phrase": "data_sources"}, {"score": 0.002758273619951683, "phrase": "appropriate_analyses"}, {"score": 0.0025158514649823724, "phrase": "software_quality"}, {"score": 0.0024096506756019704, "phrase": "distributed_software_development"}, {"score": 0.0023480892503414596, "phrase": "development_organizations"}, {"score": 0.002327919463510933, "phrase": "iterative_development_methods"}, {"score": 0.0022168460543913787, "phrase": "current_strengths"}, {"score": 0.0021416404045850224, "phrase": "annual_state"}, {"score": 0.0021171419388153786, "phrase": "avaya_report"}], "paper_keywords": ["Software development", " Software engineering", " Software quality", " Software process improvement", " Software practices", " Software assessments", " Software metrics", " R&D assessment", " Distributed and offshore development", " Iterative development", " Code growth", " R&D domain expertise", " R&D productivity", " Agile Development"], "paper_abstract": "To be relevant to the goals of an enterprise, an industrial software engineering research organization must identify problems of interest to, and find solutions that have an impact on, the software development organizations within the company. Using a systematic measurement program both to identify the problems and assess the impact of solutions is key to satisfying this need. Avaya has had such a program in place for about seven years. Every year we produce an annual report known as the State of Software in Avaya that describes software development trends throughout the company and that contains prioritized recommendations for improving Avaya's software development capabilities. We start by identifying the goals of the enterprise and use the goal-question-metric approach to identify the measures to compute. The result is insight into the enterprise's problems in software development, recommendations for improving the development process, and problems that require research to solve. We will illustrate the process with examples from the Software Technology Research Department in Avaya Labs whose purpose is to improve the state of software development and know it. \"Know it\" means that improvement should be subjectively evident and objectively quantifiable. \"Know it\" also means that one must be skilled at identifying the data sources, performing the appropriate analyses to answer the questions of interest, and validating that the data are accurate and appropriate for the purpose. Examples will include how and why we developed a measure of software quality that appeals to customers, how and why we are studying the effectiveness of distributed software development, and how and why we are helping development organizations to adopt iterative development methods. We will also discuss how we keep the company and the department apprised of the current strengths and weaknesses of software development in Avaya through the publication of the annual State of Software in Avaya Report. Our purpose is both to provide a model for assessment that others may emulate, based on seven years of experience, and to spotlight analyses and conclusions that we feel are common to software development today.", "paper_title": "Assessing the state of software in a large enterprise", "paper_id": "WOS:000276480300001"}