{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "internet_resources"}, {"score": 0.013200767482963607, "phrase": "web_information"}, {"score": 0.01053620114577033, "phrase": "scholarly_communication"}, {"score": 0.004397875849247165, "phrase": "quantitative_analysis"}, {"score": 0.004287680323820891, "phrase": "journal_articles"}, {"score": 0.004150030918669128, "phrase": "internet_resources_scholarly_journals_articles"}, {"score": 0.0038179283509963695, "phrase": "citation_data"}, {"score": 0.0034995881411519925, "phrase": "web_citation_sources"}, {"score": 0.003350480663660326, "phrase": "web_citations"}, {"score": 0.0031272381208680613, "phrase": "inclusive_conclusion"}, {"score": 0.003048782877550259, "phrase": "scientific_research"}, {"score": 0.002876747208161839, "phrase": "applied_disciplines"}, {"score": 0.002855934865505357, "phrase": "interdisciplinary_sciences"}, {"score": 0.002754103864198219, "phrase": "classical_and_experimental_disciplines"}, {"score": 0.0021435864990577945, "phrase": "guideline_system"}, {"score": 0.002120349374832685, "phrase": "web_resources"}], "paper_keywords": [""], "paper_abstract": "The quality and credibility of Internet resources has been a concern in scholarly communication. This paper reports a quantitative analysis of the use of Internet resources in journal articles and addresses the concerns for the use of Internet resources scholarly journals articles. We collected the references listed in 35,698 articles from 14 journals published during 1996 to 2005, which resulted in 1,000,724 citations. The citation data was divided into two groups: traditional citations and Web citations, and examined based on frequencies of occurrences by domain and type of Web citation sources. The findings included: (1) The number of Web citations in the journals investigated had been increasing steadily, though the quantity was too small to draw an inclusive conclusion on the data about their impact on scientific research; (2) A great disparity existed among different disciplines in terms of using information on the Web. Applied disciplines and interdisciplinary sciences tended to cite more information on the Web, while classical and experimental disciplines cited little of Web information; (3) The frequency of citations was related to the reputation of the author or the institution issuing the information, and not to the domain or webpage types; and (4) The researchers seemed to lack confidence in Internet resources, and Web information was not as frequently cited as reported in some publications before. The paper also discusses the need for developing a guideline system to evaluate Web resources regarding their authority and quality that lies in the core of credibility of Web information.", "paper_title": "The impact of internet resources on scholarly communication: A citation analysis", "paper_id": "WOS:000270979000011"}