{"auto_keywords": [{"score": 0.0458207169279994, "phrase": "synchronized_shuffles"}, {"score": 0.029513985602016766, "phrase": "synchronized_shuffle_operations"}, {"score": 0.00481495049065317, "phrase": "infinite_synchronized_shuffles"}, {"score": 0.004652963867892925, "phrase": "different_ways"}, {"score": 0.004585212379675535, "phrase": "team_automata"}, {"score": 0.004518442937844318, "phrase": "component_automata"}, {"score": 0.004057495982111461, "phrase": "original_order"}, {"score": 0.0038261310307416475, "phrase": "synchronized_shuffle"}, {"score": 0.0036434002236454305, "phrase": "different_word"}, {"score": 0.003520687960750365, "phrase": "single_occurrence"}, {"score": 0.0031457622320220364, "phrase": "infinite_word"}, {"score": 0.002573424607574822, "phrase": "finite_prefixes"}, {"score": 0.002265586601922693, "phrase": "natural_notion"}], "paper_keywords": ["Team automata", " synchronized shuffling", " infinite words", " fairness", " associativity", " compositionality"], "paper_abstract": "Motivated by different ways to obtain team automata from synchronizing component automata, we consider various definitions of synchronized shuffles of words. A shuffle of two words is an interleaving of their symbol occurrences which preserves the original order of these occurrences within each of the two words. In a synchronized shuffle, however, also two occurrences of one symbol, each from a different word, may be identified as a single occurrence. In case at least one of the words involved is infinite, a (synchronized) shuffle can also be unfair in the sense that an infinite word may prevail from some point onwards even when the other word still has occurrences to contribute to the shuffle. We prove that for the synchronized shuffle operations under consideration, every (fair or unfair) synchronized shuffle can be obtained as a limit of synchronized shuffles of the finite prefixes of the words involved. In addition, it is shown that with the exception of one, all synchronized shuffle operations that we consider satisfy a natural notion of associativity, also in case of unfairness. Finally, using these results, some compositionality results for team automata are established.", "paper_title": "Associativity of Infinite Synchronized Shuffles and Team Automata", "paper_id": "WOS:000266583700001"}