{"auto_keywords": [{"score": 0.01088309693810312, "phrase": "lte-advanced_networks"}, {"score": 0.005530853907019433, "phrase": "cellular_users"}, {"score": 0.00481495049065317, "phrase": "device-to-device_communications_underlaying_lte-advanced_networks."}, {"score": 0.004758724743486585, "phrase": "lte-advanced"}, {"score": 0.004637604380693346, "phrase": "spectrum_utilization"}, {"score": 0.004611959213131437, "phrase": "mobile_broadband_services"}, {"score": 0.004558091785667046, "phrase": "fourth_generation"}, {"score": 0.004487241576747549, "phrase": "cellular_wireless_systems"}, {"score": 0.004331811712726697, "phrase": "wireless_peer-to-peer_services"}, {"score": 0.0041167185402778425, "phrase": "user_equipments"}, {"score": 0.0038817197332605647, "phrase": "cellular_resources"}, {"score": 0.003821342577980031, "phrase": "uplink_and_downlink_resources"}, {"score": 0.003776674472150248, "phrase": "cellular_mode"}, {"score": 0.003703380599999214, "phrase": "base_station"}, {"score": 0.003589046900483573, "phrase": "cellular_network"}, {"score": 0.0033053807885373905, "phrase": "cellular_devices"}, {"score": 0.0030440661915657175, "phrase": "novel_resource_allocation_scheme"}, {"score": 0.003020279889535487, "phrase": "i.e._joint_resource_block_scheduling"}, {"score": 0.0025614418906438744, "phrase": "research_issues"}, {"score": 0.00238674051726235, "phrase": "resource_allocation_scheme"}, {"score": 0.002349561762300369, "phrase": "column_generation_method"}, {"score": 0.002206536029072657, "phrase": "minimum_transmission_length"}, {"score": 0.0021721582450016, "phrase": "time_slots"}, {"score": 0.0021049977753042253, "phrase": "harmful_interference"}], "paper_keywords": [""], "paper_abstract": "The Long Term Evolution-Advanced (LTE-Advanced) networks are being developed to provide mobile broadband services for the fourth generation (4G) cellular wireless systems. Device-to-device (D2D) communications is a promising technique to provide wireless peer-to-peer services and enhance spectrum utilization in the LTE-Advanced networks. In D2D communications, the user equipments (UEs) are allowed to directly communicate between each other by reusing the cellular resources rather than using uplink and downlink resources in the cellular mode when communicating via the base station. However, enabling D2D communications in a cellular network poses two major challenges. First, the interference caused to the cellular users by D2D devices could critically affect the performances of the cellular devices. Second, the minimum quality-of-service (QoS) requirements of D2D communications need to be guaranteed. In this article, we introduce a novel resource allocation scheme (i.e. joint resource block scheduling and power control) for D2D communications in LTE-Advanced networks to maximize the spectrum utilization while addressing the above challenges. First, an overview of LTE-Advanced networks, and architecture and signaling support for provisioning of D2D communications in these networks are described. Furthermore, research issues and the current state-of-the-art of D2D communications are discussed. Then, a resource allocation scheme based on a column generation method is proposed for D2D communications. The objective is to maximize the spectrum utilization by finding the minimum transmission length in terms of time slots for D2D links while protecting the cellular users from harmful interference and guaranteeing the QoS of D2D links. The performance of this scheme is evaluated through simulations.", "paper_title": "RESOURCE ALLOCATION FOR DEVICE-TO-DEVICE COMMUNICATIONS UNDERLAYING LTE-ADVANCED NETWORKS", "paper_id": "WOS:000324598600014"}