{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "bayesian_inference"}, {"score": 0.043967328978991624, "phrase": "loading_matrix"}, {"score": 0.015608896766831045, "phrase": "plant-wide_process_monitoring"}, {"score": 0.014135854376310274, "phrase": "original_space"}, {"score": 0.013887622769611366, "phrase": "open_issue"}, {"score": 0.013215213310999143, "phrase": "original_variables"}, {"score": 0.01312181426004974, "phrase": "extracted_components"}, {"score": 0.012223052433439007, "phrase": "dice"}, {"score": 0.0046457802872573025, "phrase": "complex_relationships"}, {"score": 0.004612662942073808, "phrase": "numerous_variables"}, {"score": 0.004579780586951551, "phrase": "modern_industrial_processes"}, {"score": 0.004530894050040479, "phrase": "multi-block_process_monitoring_method"}, {"score": 0.00441883624011048, "phrase": "plant-wide_processes"}, {"score": 0.0041580507929967645, "phrase": "principal_component_analysis"}, {"score": 0.0041286221450803386, "phrase": "pca"}, {"score": 0.003954837422946628, "phrase": "internal_relations"}, {"score": 0.003912595576016982, "phrase": "plant-wide_process"}, {"score": 0.0038431888954930083, "phrase": "multi-block_pca_method"}, {"score": 0.0035776145006375173, "phrase": "similar_loading_vectors"}, {"score": 0.0031788080316930687, "phrase": "monitoring_statistic"}, {"score": 0.003034158379493625, "phrase": "final_probability_index"}, {"score": 0.002969628818856786, "phrase": "corresponding_contribution_plot"}, {"score": 0.002896071795090179, "phrase": "root_cause"}, {"score": 0.002834470668509792, "phrase": "proposed_method"}, {"score": 0.002327310963701377, "phrase": "novel_multi-block_principal_component_analysis_method"}, {"score": 0.0022054488653549175, "phrase": "inner_correlation"}, {"score": 0.0021049977753042253, "phrase": "monitoring_results"}], "paper_keywords": ["multi-block PCA", " loading matrix", " generalized Dice's coefficient", " Bayesian inference", " plant-wide process monitoring"], "paper_abstract": "Plant-wide process monitoring is challenging because of the complex relationships among numerous variables in modern industrial processes. The multi-block process monitoring method is an efficient approach applied to plant-wide processes. However, dividing the original space into subspaces remains an open issue. The loading matrix generated by principal component analysis (PCA) describes the correlation between original variables and extracted components and reveals the internal relations within the plant-wide process. Thus, a multi-block PCA method that constructs principal component (PC) sub-blocks according to the generalized Dice coefficient of the loading matrix is proposed. The PCs corresponding to similar loading vectors are divided within the same sub-block. Thus, the PCs in the same sub-block share similar variational behavior for certain faults. This behavior improves the sensitivity of process monitoring in the sub-block. A monitoring statistic T-2 corresponding to each sub-block is produced and is integrated into the final probability index based on Bayesian inference. A corresponding contribution plot is also developed to identify the root cause. The superiority of the proposed method is demonstrated by two case studies: a numerical example and the Tennessee Eastman benchmark. Comparisons with other PCA-based methods are also provided. Copyright (c) 2014 John Wiley & Sons, Ltd. Multi-block process monitoring technique is an efficient approach for plant-wide processes where numerous variables with complex relationships exist, but how to divide original space still remains an open issue. Herein, this study proposes a novel multi-block principal component analysis method that utilizes generalized Dice's coefficient to divide the loading matrix, which reflects the inner correlation between original variables and extracted components, and then use Bayesian inference to combine the monitoring results from each subspace. The superiority is demonstrated by two case studies.", "paper_title": "Generalized Dice's coefficient-based multi-block principal component analysis with Bayesian inference for plant-wide process monitoring", "paper_id": "WOS:000351534900004"}