{"auto_keywords": [{"score": 0.049739193698072635, "phrase": "image_hashing"}, {"score": 0.015719716506582538, "phrase": "randomness_measure"}, {"score": 0.006073498345971992, "phrase": "differential_entropy"}, {"score": 0.005882159261474153, "phrase": "randomized_image_features"}, {"score": 0.004580769304731227, "phrase": "open_issue"}, {"score": 0.004499910169464113, "phrase": "image_authentication"}, {"score": 0.004357927940322685, "phrase": "security_measure"}, {"score": 0.004284801035970674, "phrase": "image_hash_function"}, {"score": 0.004160681347769684, "phrase": "swaminathan_et_al"}, {"score": 0.003846926701870193, "phrase": "security_analysis"}, {"score": 0.0038060092376105414, "phrase": "feature_extraction_stage"}, {"score": 0.0035822005511799036, "phrase": "secret-key_set"}, {"score": 0.003481465013724763, "phrase": "image_features"}, {"score": 0.002516350372379076, "phrase": "above-mentioned_fact"}, {"score": 0.002268891304166886, "phrase": "deterministic_operation"}, {"score": 0.00223672097810462, "phrase": "deterministic_scaling"}, {"score": 0.0021049977753042253, "phrase": "secret_key_or_randomized_image_features"}], "paper_keywords": ["Differential entropy", " image authentication", " image hashing", " scaling", " security measure"], "paper_abstract": "How to measure the security of image hashing is still an open issue in the field of image authentication. Some works have been conducted on the security measure of image hashing. One of the most important works is the randomness measure proposed by Swaminathan et al., which uses differential entropy as a metric to evaluate the security of randomized image features and has been applied mainly in the security analysis of the feature extraction stage of image hashing. It is meaningful to measure the randomness of the image features over the secret-key set for the security of image hashing because the image features extracted by image hashing should be generated randomly and difficult to guess. However, as is well known, differential entropy is not invariant to scaling; thus it might not be enough to evaluate the security of randomized image features. In this paper, we show the fact that if the image features of an image hash function are scaled by a constant that is large than one, then the tradeoff between the robustness and the fragility of the image hash function will not change at all, but the security indicated by the randomness measure will increase. The above-mentioned fact seems to contradict the following. First, the security of image hashing, which conflicts with robustness and fragility, cannot increase freely. Secondly, a deterministic operation, such as deterministic scaling, does not change the security of image hashing in terms of the difficulty of guessing the secret key or randomized image features. Therefore, the randomness measure should be modified to be invariant to scaling at least.", "paper_title": "A Study on the Randomness Measure of Image Hashing", "paper_id": "WOS:000271968200014"}