{"auto_keywords": [{"score": 0.0315328449912303, "phrase": "online_planning_system"}, {"score": 0.013924163527802774, "phrase": "operating_conditions"}, {"score": 0.00481495049065317, "phrase": "open-air_engineering_processes"}, {"score": 0.004681971826924847, "phrase": "open-pit_mining"}, {"score": 0.0046007229963284345, "phrase": "agriculture_farming"}, {"score": 0.0045208777171271254, "phrase": "high-tech_mobile_equipment"}, {"score": 0.003916098498242888, "phrase": "open-air_engineering_process"}, {"score": 0.003651039356522665, "phrase": "distributed_operating_environment"}, {"score": 0.003525291235622844, "phrase": "important_planning_information"}, {"score": 0.0032522091171602557, "phrase": "equipment_performance"}, {"score": 0.0029172107428045964, "phrase": "process_visibility"}, {"score": 0.0028866770996648057, "phrase": "better-informed_decision_making"}, {"score": 0.0028068030356445894, "phrase": "prosa_reference_architecture"}, {"score": 0.00277742178063459, "phrase": "accompanying_delegate_multi-agent_system"}, {"score": 0.002625824756118839, "phrase": "executable_models"}, {"score": 0.002607464886544904, "phrase": "model_operations"}, {"score": 0.0025801648787263662, "phrase": "short-term_operational_forecasts"}, {"score": 0.0025175684590726796, "phrase": "realistic_view"}, {"score": 0.0024307637980373552, "phrase": "potential_problems"}, {"score": 0.002371783323468861, "phrase": "planning_alternatives"}, {"score": 0.002289993730291136, "phrase": "open-pit_mine_planning"}, {"score": 0.0022344212744309327, "phrase": "model-driven_nature"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Holonic systems", " PROSA reference architecture", " Multi-vehicle coordination"], "paper_abstract": "Recently, most open-air engineering processes, such as open-pit mining, road construction and agriculture farming, are performed with high-tech mobile equipment. The modern technology of the equipment allows optimisation of the operations with respect to the operating conditions. When several mobile equipments are used together in a process, the benefits from their individual optimisation may disappear. Therefore, the execution of an open-air engineering process by cooperating mobile equipment needs to be carefully planned for their effective utilisation. However, dynamics in the open and distributed operating environment of these processes make the planning truly complex. Important planning information, such as the duration of operations, cannot be accurately determined in advance. The progress of the process, equipment performance and operating conditions need to be monitored and this information should be considered for the planning. This paper presents an approach to develop an online planning system with a focus on enhancing process visibility to enable better-informed decision making. To realise these objectives, the PROSA reference architecture and the accompanying delegate multi-agent system are considered. The online planning system based on PROSA is model-driven. It uses executable models to model operations, generating short-term operational forecasts. The forecasting mechanism provides a realistic view on the progress of the process, alerts on potential problems and opportunities and enables to evaluate planning alternatives. This online planning system is implemented as a prototype for open-pit mine planning. However, due to the model-driven nature of the system, this approach is equally applicable to other outdoor engineering processes. (C) 2012 Elsevier B.V. All rights reserved.", "paper_title": "Towards online planning for open-air engineering processes", "paper_id": "WOS:000316841500007"}