{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "intelligent_networks"}, {"score": 0.004642292792558686, "phrase": "intelligent_network"}, {"score": 0.004315249628884236, "phrase": "quality_of_service"}, {"score": 0.002993887707344862, "phrase": "others'_progress"}, {"score": 0.002953097497434808, "phrase": "intelligent_and_sensible_dialogue"}, {"score": 0.002782647772219627, "phrase": "mutual_observation"}, {"score": 0.0027322025124213566, "phrase": "user_self-observation"}, {"score": 0.0025047659706737215, "phrase": "traffic_flows"}, {"score": 0.002349357968054713, "phrase": "technical_problems"}, {"score": 0.0022649119108225564, "phrase": "networked_system"}, {"score": 0.0022136780933978612, "phrase": "experimental_test-bed"}, {"score": 0.0021636071499305893, "phrase": "cpn"}, {"score": 0.0021049977753042253, "phrase": "key_issue"}], "paper_keywords": ["network intelligence", " autonomic networks", " users and services", " user goals and quality of service", " cognitive packet networks"], "paper_abstract": "We present a vision of an Intelligent Network in which users dynamically indicate their requests for services, and formulate needs in terms of Quality of Service (QoS), duration, and pricing. Users can also monitor on-line the extent to which their requests are being satisfied. In turn, services will dynamically try to satisfy the users as best as they can, and inform the user of the level at which the requests are being satisfied, and at what cost. The network will provide guidelines and constraints to users and services, to avoid that they impede each others' progress. This intelligent and sensible dialogue between users, services and the network can proceed constantly based on mutual observation, network and user self-observation, and on-line adaptive and distributed feedback control which proceeds at the same speed as changes in traffic flows and the events occurring in the network. We survey some of the technical problems that arise in such networks, illustrate the networked system we propose via an experimental test-bed based on the Cognitive Packet Network (CPN), and discuss the key issue of search for users and services.", "paper_title": "User cooperation and search in intelligent networks", "paper_id": "WOS:000237211100004"}