{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "model_transformations"}, {"score": 0.013330136663019429, "phrase": "generated_software_artifacts"}, {"score": 0.0035856674209019234, "phrase": "different_requirements"}, {"score": 0.003494866798828308, "phrase": "actual_domain"}, {"score": 0.003034916887102753, "phrase": "model_transformation"}, {"score": 0.0027212777001495176, "phrase": "different_scenarios"}, {"score": 0.0026865721000905235, "phrase": "model_transformation_verification"}, {"score": 0.0025195550121331345, "phrase": "novel_test-driven_method"}, {"score": 0.002259054486157494, "phrase": "test_input_models"}, {"score": 0.0021049977753042253, "phrase": "actual_open_issues"}], "paper_keywords": ["Graph rewriting based model transformations", " Verification/validation", " Test-driven verification"], "paper_abstract": "Why is it important to verify/validate model transformations? The motivation is to improve the quality of the transformations, and therefore the quality of the generated software artifacts. Verified/validated model transformations make it possible to ensure certain properties of the generated software artifacts. In this way, verification/validation methods can guarantee different requirements stated by the actual domain against the generated/modified/optimized software products. For example, a verified/validated model transformation can ensure the preservation of certain properties during the model-to-model transformation. This paper emphasizes the necessity of methods that make model transformation verified/validated, discusses the different scenarios of model transformation verification and validation, and introduces the principles of a novel test-driven method for verifying/validating model transformations. We provide a solution that makes it possible to automatically generate test input models for model transformations. Furthermore, we collect and discuss the actual open issues in the field of verification/validation of model transformations.", "paper_title": "Test-driven verification/validation of model transformations", "paper_id": "WOS:000350792500001"}