{"auto_keywords": [{"score": 0.049648703742940926, "phrase": "knowledge_creation"}, {"score": 0.015441420168723307, "phrase": "technological_performance"}, {"score": 0.014966508827372558, "phrase": "canada"}, {"score": 0.00481495049065317, "phrase": "collaboration_network_structure"}, {"score": 0.00447937340641839, "phrase": "novel_ideas"}, {"score": 0.00439918275666155, "phrase": "scientific_publications"}, {"score": 0.004339979174946844, "phrase": "technological_advances"}, {"score": 0.004074016501033133, "phrase": "collaboration_networks"}, {"score": 0.003309278541665552, "phrase": "information_transmission_efficiency"}, {"score": 0.00326469463991041, "phrase": "network_actors"}, {"score": 0.0031917146566068245, "phrase": "existing_empirical_studies"}, {"score": 0.0031203609829058587, "phrase": "consistent_results"}, {"score": 0.0030505976034245234, "phrase": "small-world_network_properties"}, {"score": 0.0027993885490232677, "phrase": "journal_publications"}, {"score": 0.002627587221594597, "phrase": "scientists'_collaboration_activities"}, {"score": 0.002367875199095903, "phrase": "network_structure"}, {"score": 0.0021531831652035482, "phrase": "co-authorship_network"}, {"score": 0.0021337783230121286, "phrase": "canadian_biotechnology_scientists"}, {"score": 0.0021049977753042253, "phrase": "significant_effect"}], "paper_keywords": ["Network structure", " Small world", " Innovation", " Collaboration", " Biotechnology", " Canada"], "paper_abstract": "Many of the novel ideas that lead to scientific publications or yield technological advances are the result of collaborations among scientists or inventors. Although various aspects of collaboration networks have been examined, the impact of many network characteristics on knowledge creation and innovation production remains unclear due to the inconsistency of the conclusions from various research studies. One such network structure, called small world, has recently attracted much theoretical attention as it has been suggested that it can enhance the information transmission efficiency among the network actors. However, the existing empirical studies have failed to provide consistent results regarding the effect of small-world network properties on network performance in terms of its scientific and technological productivity. In this paper, using the data on 29 years of journal publications and patents in the field of biotechnology in Canada, the network of scientists' collaboration activities has been constructed based on their co-authorships in scientific articles. Various structural properties of this network have been measured and the relationships between the network structure and knowledge creation, and quantity and quality of technological performance have been examined. We found that the structure of the co-authorship network of Canadian biotechnology scientists has a significant effect on the knowledge and innovation production, but it produced no impact on the quality of patents generated by these scientists.", "paper_title": "Effect of collaboration network structure on knowledge creation and technological performance: the case of biotechnology in Canada", "paper_id": "WOS:000324275600008"}