{"auto_keywords": [{"score": 0.036295312030114914, "phrase": "program_design"}, {"score": 0.004814963363059512, "phrase": "checkpoint"}, {"score": 0.004576253356889219, "phrase": "outreach_project"}, {"score": 0.004461359547152617, "phrase": "functional_programming"}, {"score": 0.003503497128638102, "phrase": "introductory_programming"}, {"score": 0.003245900020944865, "phrase": "smooth_path"}, {"score": 0.003204841443605308, "phrase": "design-oriented_introductory_course"}, {"score": 0.0031110402375026016, "phrase": "large_software_projects"}, {"score": 0.002762423953243486, "phrase": "program_design_courses"}, {"score": 0.0027274643070540733, "phrase": "age_groups"}, {"score": 0.0026363807171515255, "phrase": "curricular_materials"}, {"score": 0.0026140878612307536, "phrase": "middle_schools"}, {"score": 0.0025919830205975215, "phrase": "high_schools"}, {"score": 0.002526780881314497, "phrase": "junior-level_course"}, {"score": 0.0024947959375982614, "phrase": "large_components"}], "paper_keywords": ["Design", " Human Factors", " Curriculum Design", " Program Design"], "paper_abstract": "In 1995, my team and I decided to create an outreach project that would use our research on functional programming to change the K-12 computer science curriculum. We had two different goals in mind. On the one hand, our curriculum should rely on mathematics to teach programming, and it should exploit programming to teach mathematics. All students-not just those who major in computer science-should benefit. On the other hand, our course should demonstrate that introductory programming can focus on program design, not just a specific syntax. We also wished to create a smooth path from a design-oriented introductory course all the way to courses on large software projects. My talk presents a checkpoint of our project, starting with our major scientific goal, a comprehensive theory of program design. Our work on this theory progresses through the development of program design courses for all age groups. At this point, we offer curricular materials for middle schools, high schools, three college-level freshman courses, and a junior-level course on constructing large components. We regularly use these materials to train K-12 teachers, after-school volunteers, and college faculty; thus far, we have reached hundreds of instructors, who in turn have dealt with thousands of students in their classrooms.", "paper_title": "TeachScheme!- A Checkpoint", "paper_id": "WOS:000286594300013"}