{"auto_keywords": [{"score": 0.04008640210616295, "phrase": "massive_documents"}, {"score": 0.009055645671500346, "phrase": "wscp"}, {"score": 0.00481495049065317, "phrase": "multi-event_summarization"}, {"score": 0.00450000390667755, "phrase": "large_amount"}, {"score": 0.004456717971917794, "phrase": "textual_information"}, {"score": 0.004007083686875716, "phrase": "text_summarization"}, {"score": 0.00393032656248792, "phrase": "efficient_way"}, {"score": 0.0035679633126097115, "phrase": "summarization_procedure"}, {"score": 0.00346589179059467, "phrase": "novel_methodology"}, {"score": 0.0033667304423940893, "phrase": "text_corpora"}, {"score": 0.003131023880006021, "phrase": "potential_topics"}, {"score": 0.0029830992938695007, "phrase": "topic_distributions"}, {"score": 0.0027876387169652717, "phrase": "coverage_problem"}, {"score": 0.00249386680748172, "phrase": "approximate_algorithm"}, {"score": 0.002446024708601971, "phrase": "optimization_problem"}, {"score": 0.0021461840368981475, "phrase": "competitive_baselines"}, {"score": 0.0021049977753042253, "phrase": "harmonic_mean"}], "paper_keywords": ["Event summarization", " Word set", " Set coverage", " Optimization"], "paper_abstract": "We have witnessed the proliferation of the Internet over the past few decades. A large amount of textual information is generated on the Web. It is impossible to locate and digest all the latest updates available on the Web for individuals. Text summarization would provide an efficient way to generate short, concise abstracts from the massive documents. These massive documents involve many events which are hard to be identified by the summarization procedure directly. We propose a novel methodology that identifies events from these text corpora and creates summarization for each event. We employ a probabilistic, topic model to learn the potential topics from the massive documents and further discover events in terms of the topic distributions of documents. To target the summarization, we define the word set coverage problem (WSCP) to capture the most representative sentences to summarize an event. For getting solution of the WSCP, we propose an approximate algorithm to solve the optimization problem. We conduct a set of experiments to evaluate our proposed approach on two real datasets: Sina news and Johnson & Johnson medical news. On both datasets, our proposed method outperforms competitive baselines by considering the harmonic mean of coverage and conciseness.", "paper_title": "Optimizing word set coverage for multi-event summarization", "paper_id": "WOS:000363033600012"}