{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "electrical_resistivity"}, {"score": 0.005650673657957859, "phrase": "carbonated_specimens"}, {"score": 0.003930000775297499, "phrase": "vacuum_chamber"}, {"score": 0.0036596354695567672, "phrase": "chloride_diffusivity"}, {"score": 0.0030446120560494155, "phrase": "hydrated_products"}, {"score": 0.0026543514413663893, "phrase": "air-dried_and_saturated_concretes"}, {"score": 0.002426137929553724, "phrase": "yoon_et_al"}, {"score": 0.0022070310530794097, "phrase": "significant_use"}, {"score": 0.002145233716114996, "phrase": "regular_measurements"}, {"score": 0.0021049977753042253, "phrase": "concrete_construction"}], "paper_keywords": ["carbonation depth", " chloride diffusivity", " curing condition", " durability", " electrical resistivity"], "paper_abstract": "The electrical resistivity of air-dried, saturated, and carbonated concretes with different mixture proportions was monitored to evaluate and quantify the influence of the age of the specimen, carbonation, and curing condition. After 28 days of curing, four prepared specimens were stored in a vacuum chamber with 5% CO2 for 330 days to make carbonated specimens. Four of the specimens were placed in water, and four specimens were cured in air until the end of the experiments. It was observed that the electrical resistivity of the carbonated specimens increased as carbonation progressed due to the decrease of porosity and the increase of hydrated products. Therefore, in order to estimate the durability of concrete, its carbonation depth was used as the measurement of electrical resistivity. Moreover, an increase of electrical resistivity for air-dried and saturated concretes was observed as a function of age of the specimen. From the relationship between chloride diffusivity provided by Yoon et al. (2007) and the measurements of electrical resistivity, it is expected that the results well be of significant use in calibrating chloride diffusivity based on regular measurements of electrical resistivity during concrete construction.", "paper_title": "Influence of curing condition and carbonation on electrical resistivity of concrete", "paper_id": "WOS:000358476900007"}