{"auto_keywords": [{"score": 0.0491784188044321, "phrase": "wireless_sensor_networks"}, {"score": 0.04636839799113724, "phrase": "wsn"}, {"score": 0.029125857239426584, "phrase": "elderly_person's_acceptance"}, {"score": 0.004814954066254869, "phrase": "elderly"}, {"score": 0.004614081478934359, "phrase": "exploratory_study"}, {"score": 0.004581423845101698, "phrase": "qualitative_research"}, {"score": 0.0044848250607167055, "phrase": "elderly_persons"}, {"score": 0.004463635542349873, "phrase": "wireless_sensor_network"}, {"score": 0.004031416989846117, "phrase": "identified_factors"}, {"score": 0.003863108365451395, "phrase": "communication_channel"}, {"score": 0.0037905691110090875, "phrase": "research_community"}, {"score": 0.0035894903821255698, "phrase": "focus_groups"}, {"score": 0.0035556213709374497, "phrase": "elderly_individuals"}, {"score": 0.0034805758838000007, "phrase": "elderly_persons'_perceptions"}, {"score": 0.0034477309908220277, "phrase": "current_wireless_sensor_network"}, {"score": 0.003382964968256005, "phrase": "discussion_points"}, {"score": 0.003150709325511637, "phrase": "sample_mote"}, {"score": 0.002997655780953961, "phrase": "wsn-based_healthcare_system"}, {"score": 0.0029274011790028876, "phrase": "sixteen_concepts"}, {"score": 0.0028928919587719037, "phrase": "elderly_participants'_perception"}, {"score": 0.002852015921489843, "phrase": "wsn_systems"}, {"score": 0.0027984090507561336, "phrase": "six_themes"}, {"score": 0.002606180833282014, "phrase": "elderly_people"}, {"score": 0.002491307496195764, "phrase": "wsn_health_data"}, {"score": 0.002309139952095626, "phrase": "participants'_attitudes"}, {"score": 0.0022710972479391906, "phrase": "health_monitoring"}, {"score": 0.0022389873283722743, "phrase": "exploratory_findings"}, {"score": 0.002160680432287145, "phrase": "future_survey_design"}, {"score": 0.002150448113659341, "phrase": "model_building"}, {"score": 0.0021402641482129356, "phrase": "crown_copyright"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ireland_ltd."}], "paper_keywords": ["Elderly", " Healthcare", " Health services for the aged"], "paper_abstract": "Purpose: This is an exploratory study carrying out qualitative research into the perceptions, attitudes and concerns of elderly persons towards wireless sensor network (WSN) technologies in terms of their application to healthcare. This work aims to provide guidance on the dimensions and items that may be included in the development of a more in-depth questionnaire to further validate the importance of the identified factors as well as the relationships between them. This study aims to contribute to opening up a communication channel between users and researchers, informing the research community in relation to applications and functionalities that users deem as either desirable, inadequate or in need of further development. Methods: Focus groups were conducted with elderly individuals who were still living independently. To explore elderly persons' perceptions and thoughts on current wireless sensor network (WSN) technologies and designs, discussion points were designed from concepts identified from various user acceptance theories and models. Participants were given an introduction to explain the functionality and capabilities of WSN and motes and were shown a sample mote, the Crossbow Mica2Dot. Participants were then asked to discuss their perceptions and concerns towards the likelihood of using a WSN-based healthcare system in their home. Findings: We have identified sixteen concepts in relation to the elderly participants' perception, concerns and attitudes towards WSN systems. Those concepts were further classified into six themes describing the determinants that may affect an elderly person's acceptance of WSNs for assisting healthcare. Some of our exploratory findings in this study indicate for example that independence is highly valued by elderly people and hence any system or technology that can prolong that independence tends to be highly regarded, that privacy of WSN health data might not be as important as typically considered, and there are also indications that cost may be the most prominent determinant influencing an elderly person's acceptance of WSNs. Conclusions: Our findings indicate that participants' attitudes towards the idea of wireless sensor networks for health monitoring are generally positive. The exploratory findings along with the literature suggest a number of relationships which can be used in future survey design and model building. Crown Copyright (C) 2009 Published by Elsevier Ireland Ltd. All rights reserved.", "paper_title": "Elderly persons' perception and acceptance of using wireless sensor networks to assist healthcare", "paper_id": "WOS:000272036200003"}