{"auto_keywords": [{"score": 0.041288812858290114, "phrase": "first_shop"}, {"score": 0.03883386896303636, "phrase": "second_shop"}, {"score": 0.004814951205791253, "phrase": "eoq"}, {"score": 0.004639712384096822, "phrase": "switching_costs"}, {"score": 0.004400329132129292, "phrase": "optimal_batch_sizes"}, {"score": 0.0038748022659578865, "phrase": "new_products"}, {"score": 0.0036359780843400625, "phrase": "used_products"}, {"score": 0.0032355864829403413, "phrase": "inventory_costs"}, {"score": 0.0029565620771207003, "phrase": "general_time_interval"}, {"score": 0.0028487656293168795, "phrase": "repair_runs"}, {"score": 0.002658863179011018, "phrase": "average_inventory_level"}, {"score": 0.0024037949232582462, "phrase": "production_and_recovery_runs"}, {"score": 0.0022434880661725493, "phrase": "manufacturing_facility"}, {"score": 0.0021501863832966966, "phrase": "mathematical_models"}, {"score": 0.0021049977753042253, "phrase": "numerical_examples"}], "paper_keywords": ["EOQ model", " production/recovery", " reuse", " waste disposal", " switching cost"], "paper_abstract": "This paper addresses the problem of determining the optimal batch sizes for production and recovery in an EOQ (economic order/production quantity) repair and waste disposal model context. This paper assumes that a first shop is manufacturing new products as well as repairing products used by a second shop. The used products can either be stored in the second shop and then be brought back to the first shop in an approach used to reduce inventory costs, or be disposed outside the system. The works available in the literature assumed a general time interval and ignored the very first time interval where no repair runs are performed. This assumption resulted in an over estimation of the average inventory level and subsequently the holding cost. These works also have not accounted for switching costs when alternating between production and recovery runs, which are common when switching among products or jobs in a manufacturing facility. This paper addresses these two limitations. Mathematical models are developed with numerical examples presented and results discussed. (C) 2008 Elsevier Ltd. All rights reserved.", "paper_title": "The EOQ repair and waste disposal model with switching costs", "paper_id": "WOS:000257535700015"}