{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "stereotype_threat"}, {"score": 0.03683148810790223, "phrase": "stereotype_threats"}, {"score": 0.034672296943019446, "phrase": "it-related_majors"}, {"score": 0.004740476936977635, "phrase": "mis_students"}, {"score": 0.004630910803911567, "phrase": "initial_investigation._stereotype_threat"}, {"score": 0.0037516215763875225, "phrase": "person_exhibiting_lowered_performance"}, {"score": 0.003389704997952315, "phrase": "performance_differences"}, {"score": 0.0033372020049592726, "phrase": "male_and_female_students"}, {"score": 0.0031845067058084583, "phrase": "analytical_tasks"}, {"score": 0.002745438358145758, "phrase": "psycho-social_factors"}, {"score": 0.0026609940110902666, "phrase": "innate_ability"}], "paper_keywords": ["stereotype threat", " gender studies", " experimental design"], "paper_abstract": "Stereotype threat occurs when a member of a group can be stereotyped as having certain negative characteristics. Fear of confirming the stereotype then increases apprehension, resulting in the person exhibiting lowered performance. This study examines the extent to which stereotype threats might account for performance differences between male and female students in IT-related majors when working on analytical tasks. The theory supports the contention that males may outperform females on certain tasks but attributes the reason to psycho-social factors and not to innate ability. As expected, the results of this study indicated that females who were told their performances would be lower than their male counterparts scored higher in their work quantity, but lower in their work quality. For the women where no stereotype threat was introduced, scores were comparable to the men's, lending support to this theory. The implications of stereotype threats for IT-related majors and professionals are discussed.", "paper_title": "THE EFFECTS OF STEREOTYPE THREAT ON MIS STUDENTS: AN INITIAL INVESTIGATION", "paper_id": "WOS:000274760600015"}