{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "confusable_drug_names"}, {"score": 0.004204904449336037, "phrase": "wrong_one"}, {"score": 0.003671865026158296, "phrase": "orthographic_similarity"}, {"score": 0.0034467039994594065, "phrase": "phonetic_similarity"}, {"score": 0.0031917146566068245, "phrase": "new_methods"}, {"score": 0.0030505976034245234, "phrase": "novel_evaluation_methodology"}, {"score": 0.002942196368747418, "phrase": "new_orthographic_measure"}, {"score": 0.002627587221594597, "phrase": "new_feature-based_phonetic_approach"}, {"score": 0.002568812627436125, "phrase": "orthographic_approaches"}, {"score": 0.0025341792091114184, "phrase": "test_set"}, {"score": 0.0025113494092413604, "phrase": "solely_sound-alike_pairs"}, {"score": 0.002389403849342894, "phrase": "best_results"}, {"score": 0.002105002791163301, "phrase": "elsevier"}], "paper_keywords": ["drug names", " lexical similarity", " medical errors", " evaluation methodology"], "paper_abstract": "Objective: Many hundreds of drugs have names that either took or sound so much alike that doctors, nurses and pharmacists can get them confused, dispensing the wrong one in errors that can injure or even kill patients. Methods and material: We propose to address the problem through the application of two new methods-one based on orthographic similarity (\"look-alike\"), and the other based on phonetic similarity (\"sound-alike\"). In order to compare the effectiveness of the new methods for identifying confusable drug names with other known similarity measures, we developed a novel evaluation methodology. Results: We show that the new orthographic measure (BI-SIM) outperforms other commonly used measures of similarity on a set containing both look-alike and soundalike pairs, and that a new feature-based phonetic approach (ALINE) outperforms orthographic approaches on a test set containing solely sound-alike pairs. However, an approach that combines several different measures achieves the best results on two test sets. Conclusion: Our system is currently used as the basis of a system developed for the U.S. Food and Drug Administration for detection of confusable drug names. (c) 2005 Elsevier B.V All rights reserved.", "paper_title": "Automatic identification of confusable drug names", "paper_id": "WOS:000235242000002"}