{"auto_keywords": [{"score": 0.03411987307652052, "phrase": "winding_inductance"}, {"score": 0.00481495049065317, "phrase": "winding_inductances"}, {"score": 0.004693300099911199, "phrase": "permanent_magnet_brushless_machines"}, {"score": 0.0043464021636703066, "phrase": "considerable_attention"}, {"score": 0.004175006647851034, "phrase": "short_end-windings"}, {"score": 0.0037684961730030235, "phrase": "key_design_parameter"}, {"score": 0.0036065830625093883, "phrase": "significant_impact"}, {"score": 0.003438990973529508, "phrase": "reluctance_torque"}, {"score": 0.003303259489028193, "phrase": "detailed_investigation"}, {"score": 0.0031382058937207413, "phrase": "non-overlapping_windings"}, {"score": 0.0030253688063143157, "phrase": "key_design_parameters"}, {"score": 0.002970476379751357, "phrase": "inductance_components"}, {"score": 0.0029380187414193653, "phrase": "particular_reference"}, {"score": 0.002632272952905934, "phrase": "different_winding_configurations"}, {"score": 0.0025468951021098717, "phrase": "main_component"}, {"score": 0.0024915167458844914, "phrase": "relatively_large_slot-leakage_component"}, {"score": 0.0024642796422450755, "phrase": "analytical_and_finite_element_models"}, {"score": 0.002175594509651082, "phrase": "good_reference"}, {"score": 0.002128272293291141, "phrase": "pm_machines"}, {"score": 0.0021049977753042253, "phrase": "fecw."}], "paper_keywords": ["Magnetic devices", " Electrical engineering", " Windings", " Inductance"], "paper_abstract": "Purpose - Permanent magnet (PM) brushless machines equipped with fractional-slot concentrated-windings (FSCW) have been receiving considerable attention over the past few years, due to the fact that they have short end-windings, a high-slot fill factor, a high efficiency and power density, and good flux-weakening and fault-tolerance capabilities. A key design parameter for such machines is the phase winding inductance since this has a significant impact on the performance, as well as on the magnitude of any reluctance torque. The purpose of this paper is to describe a detailed investigation of the various components of the winding inductance in machines equipped with both overlapping and non-overlapping windings and different slot/pole number combinations. It also examines the influence of key design parameters, which affect the inductance components, with particular reference to the inductances of machines in which all the teeth are wound and those in which only alternate teeth are wound. Design/methodology/approach - The paper analyzes and compares various inductance components which result from different winding configurations. Findings - It is shown that the main component of the winding inductance is the relatively large slot-leakage component. Both analytical and finite element models are employed and predicted results are validated on several prototype machines. Originality/value - Such a thorough investigation of the various inductance components Tor these type of machines has not been presented before. The paper will serve as a good reference for engineers and researchers designing PM machines equipped with FECW.", "paper_title": "Winding inductances of fractional slot surface-mounted permanent magnet brushless machines", "paper_id": "WOS:000273285900017"}