{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "reference_selection"}, {"score": 0.0036801209922064817, "phrase": "cited_authors"}, {"score": 0.003587924960158317, "phrase": "widely_known_and_used_indicator"}, {"score": 0.003462704420080129, "phrase": "extensive_review"}, {"score": 0.0032251796659158696, "phrase": "central_question"}, {"score": 0.003144345057121367, "phrase": "existing_theories"}, {"score": 0.0029584874121320165, "phrase": "complete_and_convincing_answer"}, {"score": 0.0027554538693034163, "phrase": "core_literature"}, {"score": 0.0026057256900479026, "phrase": "fresh_perspective"}, {"score": 0.0023780209525032688, "phrase": "citation_theories"}, {"score": 0.002342048999008582, "phrase": "new_perspective"}, {"score": 0.002181227522730908, "phrase": "final_choice"}, {"score": 0.0021049977753042253, "phrase": "new_classification"}], "paper_keywords": [""], "paper_abstract": "Why authors choose some references in preference to others is a question that is still not wholly answered despite its being of interest to scientists. The relevance of references is twofold: They are a mechanism for tracing the evolution of science, and because they enhance the image of the cited authors, citations are a widely known and used indicator of scientific endeavor. Following an extensive review of the literature, we selected all papers that seek to answer the central question and demonstrate that the existing theories are not sufficient: Neither citation nor indicator theory provides a complete and convincing answer. Some perspectives in this arena remain, which are isolated from the core literature. The purpose of this article is to offer a fresh perspective on a 30-year-old problem by extending the context of the discussion. We suggest reviving the discussion about citation theories with a new perspective, that of the readers, by layers or phases, in the final choice of references, allowing for a new classification in which any paper, to date, could be included.", "paper_title": "The Multilayered Nature of Reference Selection", "paper_id": "WOS:000264413100009"}