{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "incremental_growth"}, {"score": 0.004724878518219719, "phrase": "lr_goto-graphs"}, {"score": 0.00438105507792004, "phrase": "lalr_and_glr._early_work"}, {"score": 0.0035587046945919788, "phrase": "formal_proof"}, {"score": 0.003459191419478298, "phrase": "particular_relation"}, {"score": 0.0033624514778823763, "phrase": "grown_or_shrunk_counterpart"}, {"score": 0.0030881143614111552, "phrase": "recursive_projection"}, {"score": 0.003030247482854539, "phrase": "limited_length"}, {"score": 0.0028093921138602606, "phrase": "subset_relation"}, {"score": 0.0023139986108451967, "phrase": "dynamically_updatable_lalr_parser_generator"}, {"score": 0.002125020720324262, "phrase": "neverlang_framework"}, {"score": 0.0021049977753042253, "phrase": "programming_language_development"}], "paper_keywords": [""], "paper_abstract": "The LR(0) goto-graph is the basis for the construction of parsers for several interesting grammar classes such as LALR and GLR. Early work has shown that even when a grammar is an extension to another, the goto-graph of the first is not necessarily a subgraph of the second. Some authors presented algorithms to grow and shrink these graphs incrementally, but the formal proof of the existence of a particular relation between a given goto-graph and a grown or shrunk counterpart seems to be still missing in literature as of today. In this paper we use the recursive projection of paths of limited length to prove the existence of one such relation, when the sets of productions are in a subset relation. We also use this relation to present two algorithms (Grow and Shrink) that transform the goto-graph of a given grammar into the goto-graph of an extension or a restriction to that grammar. We implemented these algorithms in a dynamically updatable LALR parser generator called DEXTER (the Dynamically EXTEnsible Recognizer) that we are now shipping with our current implementation of the Neverlang framework for programming language development.", "paper_title": "On the incremental growth and shrinkage of LR goto-graphs", "paper_id": "WOS:000343717000001"}