{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "visual_metaphors"}, {"score": 0.00691191107209138, "phrase": "visualization_use"}, {"score": 0.0047409388179452255, "phrase": "information_visualization"}, {"score": 0.004479120557712926, "phrase": "data_values"}, {"score": 0.004253618550301311, "phrase": "visual_structure"}, {"score": 0.004209893377338457, "phrase": "one's_own_thinking"}, {"score": 0.003916098498242888, "phrase": "high-level_visual_structure"}, {"score": 0.003336225354214798, "phrase": "user's_preconceived_metaphors"}, {"score": 0.0032176163279340206, "phrase": "important_role"}, {"score": 0.002740885774408238, "phrase": "participant's_preconceptions"}, {"score": 0.0027126684113045756, "phrase": "thinking_style"}, {"score": 0.0025493457404304446, "phrase": "conflicting_metaphors"}, {"score": 0.0023711591828229736, "phrase": "significant_effect"}, {"score": 0.00226322835801988, "phrase": "spatial_ability"}, {"score": 0.002126907587540404, "phrase": "complex_influence"}, {"score": 0.0021049977753042253, "phrase": "self-reported_metaphor_preference"}], "paper_keywords": [""], "paper_abstract": "Understanding information visualization is more than a matter of reading a series of data values; it is also a matter of incorporating a visual structure into one's own thinking about a problem. We have proposed visual metaphors as a framework for understanding high-level visual structure and its effect on visualization use. Although there is some evidence that visual metaphors can affect visualization use, the nature of this effect is still ambiguous. We propose that a user's preconceived metaphors for data and other individual differences play an important role in her ability to think in a variety of visual metaphors, and subsequently in her ability to use a visualization. We test this hypothesis by conducting a study in which a participant's preconceptions and thinking style were compared with the degree to which she is affected by conflicting metaphors in a visualization and its task questions. The results show that metaphor compatibility, has a significant effect on accuracy, but that factors such as spatial ability and personality can lessen this effect. We also find a complex influence of self-reported metaphor preference on performance. These findings shed light on how people use visual metaphors to understand a visualization.", "paper_title": "Preconceptions and Individual Differences in Understanding Visual Metaphors", "paper_id": "WOS:000268217500027"}