{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "global_exact_symmetries"}, {"score": 0.04955111375780366, "phrase": "cad_models"}, {"score": 0.029955288649822137, "phrase": "feature_sets"}, {"score": 0.008626335096212327, "phrase": "ordered_sequence"}, {"score": 0.004555217356295278, "phrase": "great_importance"}, {"score": 0.004076858589744185, "phrase": "global_exact_rotational_and_reflectional_symmetries"}, {"score": 0.004031865694174726, "phrase": "feature-based_cad_models"}, {"score": 0.003814212645832246, "phrase": "boolean_combinations"}, {"score": 0.003265090934183249, "phrase": "congruent_feature_sets"}, {"score": 0.0030715948036518603, "phrase": "feature_information"}, {"score": 0.0025287979714720423, "phrase": "entire_model"}, {"score": 0.00230080652063411, "phrase": "experimental_results"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["CAD", " Symmetry detection", " Design feature", " Merging symmetries", " Verifying symmetries"], "paper_abstract": "Detecting global exact symmetries in CAD models is of great importance in the research of CAD/CAE integration. Therefore, a method is proposed in this paper to rapidly detect the global exact rotational and reflectional symmetries in feature-based CAD models. The theories of determining the symmetries of the Boolean combinations of the features are framed. Based on these theories, our approach is processed as follows. First, the features of the CAD models are classified into congruent feature sets. Next, through the study on the relationship between feature information and the symmetries of features, by using only feature information, as many symmetries of the feature sets as possible are detected. Then these feature sets are sorted into an ordered sequence. Finally, symmetries of the entire model can be derived by successively merging and verifying the symmetries of feature sets in the ordered sequence. Experimental results show that the global exact symmetries can be robustly and rapidly detected. (C) 2013 Elsevier Ltd. All rights reserved.", "paper_title": "A feature-based method of rapidly detecting global exact symmetries in CAD models", "paper_id": "WOS:000321173700001"}