{"auto_keywords": [{"score": 0.05006955967092586, "phrase": "electronic_records_management"}, {"score": 0.04408456283084566, "phrase": "target_organizations"}, {"score": 0.035496060266405206, "phrase": "iso"}, {"score": 0.004739344544832536, "phrase": "crucial_communications"}, {"score": 0.004562676524864167, "phrase": "information_science"}, {"score": 0.004242183179689357, "phrase": "poor_communication"}, {"score": 0.004122964978180509, "phrase": "major_causes"}, {"score": 0.003894446653225716, "phrase": "agreed_decisions"}, {"score": 0.0037729898581369673, "phrase": "project_managers"}, {"score": 0.0036785473375981533, "phrase": "initial_requirements"}, {"score": 0.0036207206487324506, "phrase": "vast_majority"}, {"score": 0.0033875770020590796, "phrase": "persistent_use"}, {"score": 0.0031794625343029457, "phrase": "records_management"}, {"score": 0.0029464822620763687, "phrase": "inductive_qualitative_research_approach"}, {"score": 0.002881793492919646, "phrase": "critical_literature_review"}, {"score": 0.002854505078275351, "phrase": "exploratory_case_study"}, {"score": 0.0028364561005358377, "phrase": "thematic_analysis"}, {"score": 0.0027305272327742642, "phrase": "sw_company"}, {"score": 0.0027046673104220422, "phrase": "erm_policies"}, {"score": 0.0024513404432665153, "phrase": "organizational_learning"}, {"score": 0.002300631764046031, "phrase": "qa"}, {"score": 0.002166006895718596, "phrase": "erm"}, {"score": 0.0021522871388240444, "phrase": "sw_project_management_practices"}, {"score": 0.0021049977753042253, "phrase": "early_insights"}], "paper_keywords": ["Information systems", " Project management", " Quality assurance", " Information science"], "paper_abstract": "Purpose - Despite its tremendous success and achievements, the information science (IS) industry has been plagued by shadows of failure and inefficiency since its early days. This paper takes the stance that poor communication with target organizations and users is one of the major causes of these problems. If this communication is not properly recorded and managed, many of the agreed decisions may never be assumed by target organizations, therefore leaving project managers entirely responsible for failures or deviation from initial requirements. Nonetheless, the vast majority of Software (SW) development companies have very weak provision for Electronic Records Management (ERM). This is evident from the persistent use of ISO 9001 and ISO 90003 in their Quality Assurance (QA) and the consistent neglecting of the ISO 15489 standard for records management. This paper aims to examine this issue Design/methodology/approach - Since there are no studies in this area, this research employed an inductive qualitative research approach that consisted of a combination of critical literature review, an exploratory case study and thematic analysis. Findings - This paper reports on the study of an SW company that implemented ERM policies and an in-house system that not only supports the recording of documentation and evidence for every phase of the development, but also the very difficult processes of organizational learning. Practical implications - This paper is of interest to both IS academics and practitioners, namely those interested in QA and ERM. Originality/value - There is very little research in this area that can inform both academics and practitioners on how to use ERM within SW project management practices. This paper aims at providing early insights into ways of addressing this gap and at generating discussion in this area.", "paper_title": "Expanding the concept of requirements traceability The role of electronic records management in gathering evidence of crucial communications and negotiations", "paper_id": "WOS:000291912000004"}