{"auto_keywords": [{"score": 0.012797922637152917, "phrase": "content_unavailability"}, {"score": 0.008713768692145013, "phrase": "content_availability"}, {"score": 0.006482827543994189, "phrase": "content-related_limitations"}, {"score": 0.00467424463996457, "phrase": "bit_torrent"}, {"score": 0.00459568664065473, "phrase": "content_unavailability_problem"}, {"score": 0.004404994123834589, "phrase": "missing_chunks"}, {"score": 0.004081385289516914, "phrase": "multi-swarm_collaboration_approach"}, {"score": 0.0033865859510157238, "phrase": "new_kind"}, {"score": 0.0033579708256295847, "phrase": "multi-swarm_collaboration"}, {"score": 0.003287482882222731, "phrase": "temporal_storage"}, {"score": 0.0031912706211861324, "phrase": "collaborating_swarms"}, {"score": 0.002931569771634119, "phrase": "cached_chunks"}, {"score": 0.002603012037901889, "phrase": "download_completions"}, {"score": 0.0025160740422447837, "phrase": "normal_bit_torrent"}, {"score": 0.0024423826953133844, "phrase": "low_overhead"}, {"score": 0.0023309080951251335, "phrase": "existing_bundling_approach"}, {"score": 0.002177762848946681, "phrase": "better_performance"}, {"score": 0.0021049977753042253, "phrase": "peer_incentive"}], "paper_keywords": ["multi-swarm collaboration", " content unavailability", " BitTorrent"], "paper_abstract": "Despite its great success, Bit Torrent suffers from the content unavailability problem where peers cannot complete their content downloads due to some missing chunks, which is caused by a shortage of seeders who hold the content in its entirety. The multi-swarm collaboration approach is a natural choice for improving content availability, since content unavailability cannot be overcome by one swarm easily. Most existing multi-swarm collaboration approaches, however, suffer from content-related limitations, which limit their application scopes. In this paper, we introduce a new kind of multi-swarm collaboration utilizing a swarm as temporal storage. In a nutshell, the collaborating swarms cache some chunks of each other that are likely to be unavailable before the content unavailability happens and share the cached chunks when the content unavailability happens. Our approach enables any swarms to collaborate with each other without the content-related limitations. Simulation results show that our approach increases the number of download completions by over 50% (26%) compared to normal Bit Torrent (existing bundling approach) with low overhead. In addition, our approach shows around 30% improved download completion time compared to the existing bundling approach. The results also show that our approach enables the peers participating in our approach to enjoy better performance than other peers, which can be a peer incentive.", "paper_title": "Caching-Based Multi-Swarm Collaboration for Improving Content Availability in BitTorrent", "paper_id": "WOS:000304573100029"}