{"auto_keywords": [{"score": 0.033571905962671275, "phrase": "likelihood_function"}, {"score": 0.012212001540211464, "phrase": "mil"}, {"score": 0.010760171810062377, "phrase": "weak_classifiers"}, {"score": 0.008734380961263298, "phrase": "fisher_information_criterion"}, {"score": 0.00481495049065317, "phrase": "online_multiple_instance"}, {"score": 0.0047559432344272, "phrase": "fisher_information"}, {"score": 0.004602085616330634, "phrase": "supervised_manner"}, {"score": 0.004471530397729526, "phrase": "tracked_object_location"}, {"score": 0.00430907756010007, "phrase": "object_location"}, {"score": 0.004084744133085742, "phrase": "incorrectly_labeled_training_samples"}, {"score": 0.0037621210719690594, "phrase": "multiple_instance_learning"}, {"score": 0.0036553070575015344, "phrase": "visual_tracking"}, {"score": 0.003625347557965931, "phrase": "demonstrated_success"}, {"score": 0.0035224030823976186, "phrase": "mil_tracker"}, {"score": 0.0033251716926666437, "phrase": "linear_combination"}, {"score": 0.00292674497467906, "phrase": "complex_background"}, {"score": 0.002867098884583832, "phrase": "information_criterion"}, {"score": 0.0025130460190930554, "phrase": "online_boosting_feature_selection_approach"}, {"score": 0.0023527296826339225, "phrase": "challenging_sequences"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Tracking by detection", " Multiple instance learning", " Fisher information"], "paper_abstract": "Most tracking-by-detection approaches train the classifier in an supervised manner in which the samples near the tracked object location are labeled positively while those far from the object location are negative. However, the inaccuracy of the tracker may cause incorrectly labeled training samples, which in turn degrade the classifier when updating it, thereby leading to drift problem. Recently, multiple instance learning (MIL) is introduced into visual tracking with demonstrated success of dealing with drift. In MIL tracker, the samples are put into bags, and the classifier is a linear combination of some weak classifiers which are greedily selected via maximizing the likelihood function of the bags. However, the weak classifiers selected by the likelihood function are less informative to tell target from complex background than those from some information criterion (e.g., Fisher information criterion). In this paper, we show that using the Fisher information criterion instead of the likelihood function in the MIL can yield a more robust and efficient result. An online boosting feature selection approach is proposed via optimizing the Fisher information criterion, which can yield more robust and efficient tracking performance. Experimental evaluations on challenging sequences demonstrate the superiority of our tracker to state-of-the-art trackers in terms of efficiency, accuracy and robustness. (C) 2015 Elsevier Ltd. All rights reserved.", "paper_title": "Robust visual tracking via online multiple instance learning with Fisher information", "paper_id": "WOS:000360952800009"}