{"auto_keywords": [{"score": 0.021075517031676424, "phrase": "malicious_conferees"}, {"score": 0.018120268817895482, "phrase": "tzeng"}, {"score": 0.006546824214715384, "phrase": "malicious_conferee"}, {"score": 0.00481495049065317, "phrase": "key_agreement_protocol"}, {"score": 0.004767546015485477, "phrase": "non-interactive_fault-tolerance"}, {"score": 0.004492717291734985, "phrase": "practical_situation"}, {"score": 0.004254671386496732, "phrase": "conference_initiation"}, {"score": 0.0038727120021750973, "phrase": "malicious_behavior"}, {"score": 0.003507504253087326, "phrase": "fault-tolerant_conference_key_agreement_protocol"}, {"score": 0.0033879628186273625, "phrase": "conference_key"}, {"score": 0.0029055323737809825, "phrase": "fault-tolerant_mechanism"}, {"score": 0.0028484940955893134, "phrase": "complicated_interactions"}, {"score": 0.002657511557782469, "phrase": "novel_strategy"}, {"score": 0.002504011301105577, "phrase": "conferee_list"}, {"score": 0.002301572462091142, "phrase": "complete_example"}, {"score": 0.0022010965931147735, "phrase": "fascinating_fault-tolerance"}], "paper_keywords": ["Fault-tolerance", " Conference key agreement", " Elliptic curve", " Modified Weil pairing"], "paper_abstract": "Most conventional conference key agreement protocols have not been concerned with a practical situation. There may exist some malicious conferees who attempt to block conference initiation for some purposes, e.g. commercial, political or military benefit. Instances where conference must be launched immediately due to emergency, efficient detection of malicious behavior would be needed. Recently, Tzeng (IEEE Trans. Comput. 51(4):373-379, 2002) proposed a fault-tolerant conference key agreement protocol to address the issue where a conference key can be established among conferees even though malicious conferees exist. However, his protocol might be complex and inefficient during fault-detection. In the case where a malicious conferee exists and a fault-tolerant mechanism is launched, complicated interactions between conferees will be required. In this paper, we introduce a novel strategy, where any malicious conferee may be identified and removed from the conferee list without any interaction. With such a non-interactive fault-tolerance, conferences could be established and started efficiently. A complete example of our protocol will be given to describe the fascinating fault-tolerance. We analyse the security of our protocol regarding four aspects, i.e. correctness, fault-tolerance, active attack and passive attack. The comparisons of performance between our protocol and that of Tzeng are also shown. As a whole, the advantage of our protocol is superior to that of Tzeng under the situation where malicious conferees exist.", "paper_title": "Conference key agreement protocol with non-interactive fault-tolerance over broadcast network", "paper_id": "WOS:000262672400004"}