{"auto_keywords": [{"score": 0.041142104315173414, "phrase": "fpga"}, {"score": 0.004155283263388382, "phrase": "fair_and_consistent_hardware_evaluation"}, {"score": 0.0039729853486821995, "phrase": "sasebo-gii_field-programmable_gate_array"}, {"score": 0.003798654583736764, "phrase": "common_platform"}, {"score": 0.0037024804835018373, "phrase": "well_defined_hardware"}, {"score": 0.003113804826864362, "phrase": "standard_testing_harness"}, {"score": 0.00299622333197717, "phrase": "interface_specification"}, {"score": 0.0028463059289874637, "phrase": "second_contribution"}, {"score": 0.0026694157823065924, "phrase": "asic"}, {"score": 0.00236289633510808, "phrase": "source_code"}, {"score": 0.0021049977753042253, "phrase": "public_verification"}], "paper_keywords": ["Application-specific integrated circuit (ASIC)", " field-programmable gate array (FPGA)", " hardware evaluation", " hash function", " SASEBO-GII", " SHA-3 competition"], "paper_abstract": "The first contribution of our paper is that we propose a platform, a design strategy, and evaluation criteria for a fair and consistent hardware evaluation of the second-round SHA-3 candidates. Using a SASEBO-GII field-programmable gate array (FPGA) board as a common platform, combined with well defined hardware and software interfaces, we compare all 256-bit version candidates with respect to area, throughput, latency, power, and energy consumption. Our approach defines a standard testing harness for SHA-3 candidates, including the interface specification for the SHA-3 module on our testing platform. The second contribution is that we provide both FPGA and 90-nm CMOS application-specific integrated circuit (ASIC) synthesis results and thereby are able to compare the results. Our third contribution is that we release the source code of all the candidates and by using a common, fixed, publicly available platform, our claimed results become reproducible and open for a public verification.", "paper_title": "Fair and Consistent Hardware Evaluation of Fourteen Round Two SHA-3 Candidates", "paper_id": "WOS:000302640200005"}