{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "multiple_publication"}, {"score": 0.04224381257933372, "phrase": "scientific_community"}, {"score": 0.014936795889006864, "phrase": "total_citation_counts"}, {"score": 0.01224973737675404, "phrase": "greater_reception"}, {"score": 0.011415920781844618, "phrase": "single_study"}, {"score": 0.004768559572292452, "phrase": "single_research_study"}, {"score": 0.004602233424629559, "phrase": "research_articles"}, {"score": 0.004427366754240748, "phrase": "single_definable_body"}, {"score": 0.004286708921931472, "phrase": "repeated_reports"}, {"score": 0.004204459295724526, "phrase": "fractional_reports"}, {"score": 0.003816197777388722, "phrase": "\"multiple_publication"}, {"score": 0.0036592457471262894, "phrase": "present_study"}, {"score": 0.00323639105050096, "phrase": "research_fellowship"}, {"score": 0.0032051601987130207, "phrase": "boehringer_ingelheirn_fonds"}, {"score": 0.0030832123624449028, "phrase": "basic_research"}, {"score": 0.002862260172272785, "phrase": "single_project"}, {"score": 0.0026570998719084153, "phrase": "regression_model"}, {"score": 0.0026314443645799913, "phrase": "interaction_term_show"}, {"score": 0.0025725382476862305, "phrase": "research_study_results"}, {"score": 0.0021393317071153844, "phrase": "study_results"}, {"score": 0.0021049977753042253, "phrase": "sizable_reports"}], "paper_keywords": [""], "paper_abstract": "Scientists may seek to report a single definable body of research in more than one publication, that is, in repeated reports of the same work or in fractional reports, in order to disseminate their research as widely as possible in the scientific community. Up to now, however, it has not been examined whether this strategy of \"multiple publication\" in fact leads to greater reception of the research. In the present study, we investigate the influence of number of articles reporting the results of a single study on reception in the scientific community (total citation counts of an article on a single study). Our data set consists of 96 applicants for a research fellowship from the Boehringer Ingelheirn Fonds (BIF), an international foundation for the promotion of basic research in biomedicine. The applicants reported to us all articles that they had published within the framework of their doctoral research projects. On this single project, the applicants had published from 1 to 16 articles (M = 4; Mdn = 3). The results of a regression model with an interaction term show that the practice of multiple publication of research study results does in fact lead to greater reception of the research (higher total citation counts) in the scientific community. However, reception is dependent upon length of article: the longer the article, the more total citation counts increase with the number of articles. Thus, it pays for scientists to practice multiple publication of study results in the form of sizable reports.", "paper_title": "Multiple publication on a single research study: Does it pay? The influence of number of research articles on total citation counts in biomedicine", "paper_id": "WOS:000247078400003"}