{"auto_keywords": [{"score": 0.04423467024884347, "phrase": "adaptive_linear_model"}, {"score": 0.04060049025416118, "phrase": "hlefs"}, {"score": 0.01307126811226278, "phrase": "output_error"}, {"score": 0.00481495049065317, "phrase": "habitually_linear_evolving_ts_fuzzy_model"}, {"score": 0.0046803650677267146, "phrase": "systematic_design"}, {"score": 0.00436890075128947, "phrase": "habitually_linear_evolving_fuzzy_system"}, {"score": 0.004144723510171449, "phrase": "ts_fuzzy_model"}, {"score": 0.004094639048362357, "phrase": "linear_model"}, {"score": 0.003791141540467091, "phrase": "adaptive_threshold"}, {"score": 0.003370565320453525, "phrase": "proposed_model"}, {"score": 0.0033194529077216215, "phrase": "linear"}, {"score": 0.003133252930886608, "phrase": "hlefs_ability"}, {"score": 0.002578745296475411, "phrase": "ts_fuzzy_system"}, {"score": 0.002547535564922075, "phrase": "proposed_algorithm"}, {"score": 0.002416589459425828, "phrase": "daily_electrical_power_consumption"}, {"score": 0.0022371907579775796, "phrase": "proposed_method"}, {"score": 0.0022011501095573747, "phrase": "prediction_error"}, {"score": 0.0021569129153653777, "phrase": "fuzzy_rules"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Adaptive Takagi-Sugeno fuzzy model", " Nonlinear prediction", " Evolving fuzzy vstems", " Load forecasting"], "paper_abstract": "In this paper, a systematic design of habitually evolving Takagi-Sugeno (TS) fuzzy systems, suggested for online prediction of processes with uncertainty, is introduced. A Habitually Linear Evolving Fuzzy System (HLEFS) starts off with an adaptive linear model and evolves into a TS fuzzy model whenever the linear model is unable to mitigate the output error. The number of rules in the HLEFS is controlled by an adaptive threshold on the error. The structure of the HLEFS tends to return to the adaptive linear model as soon as possible, and that is why we have dubbed the proposed model 'Habitually' Linear. Three theorems are stated and proved in a sequence in support of the HLEFS ability to keep the output error in a relatively small bound. It is shown that the adaptive linear model may not be good enough when the process Changes abruptly and nonlinearly what we call a Transient Significant Disturbance. In this case, it is proved that evolving into a TS fuzzy system with the proposed algorithm can mitigate the error. The performance of HLEFS in forecasting of daily electrical power consumption is studied and compared with that of four famous existing evolving fuzzy systems. Obtained results demonstrate the applicability and effectiveness of the proposed method in keeping the prediction error low with less number of fuzzy rules. (C) 2011 Elsevier Ltd. All rights reserved.", "paper_title": "A new systematic design for Habitually Linear Evolving TS Fuzzy Model", "paper_id": "WOS:000298027300014"}