{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "multilingual_context"}, {"score": 0.04570306398217144, "phrase": "indexing_language"}, {"score": 0.038706594646719085, "phrase": "indexing_terms"}, {"score": 0.03657526290162966, "phrase": "retrieval_process"}, {"score": 0.004625795150473604, "phrase": "image_retrieval"}, {"score": 0.004026359831748917, "phrase": "ordinary_images"}, {"score": 0.004001593118269276, "phrase": "common_objects"}, {"score": 0.003880017219275826, "phrase": "controlled_vocabulary"}, {"score": 0.0038561471948364723, "phrase": "free_image_indexing"}, {"score": 0.003832423454781517, "phrase": "uncontrolled_vocabulary"}, {"score": 0.003569831390151506, "phrase": "term_types"}, {"score": 0.003314921989697641, "phrase": "retrieval_performance"}, {"score": 0.003284361433827464, "phrase": "indexing_approach"}, {"score": 0.0032340499528688495, "phrase": "usability_measures"}, {"score": 0.0030309961956273028, "phrase": "searcher_satisfaction"}, {"score": 0.002797121441432477, "phrase": "comprehensive_description"}, {"score": 0.0026704721397631938, "phrase": "retrieval_simulation_results"}, {"score": 0.002629539710839523, "phrase": "relative_performance"}, {"score": 0.0026052812376885504, "phrase": "six_indexing_forms"}, {"score": 0.0024416087858984644, "phrase": "image_searcher's_satisfaction"}, {"score": 0.0023382335380460304, "phrase": "information_systems"}, {"score": 0.002295277579105177, "phrase": "increased_coexistence"}, {"score": 0.0022811346113905295, "phrase": "controlled_vocabularies"}, {"score": 0.0022670785913397637, "phrase": "uncontrolled_vocabularies"}, {"score": 0.002239225269052105, "phrase": "collaborative_image_tagging"}, {"score": 0.0021311850321045767, "phrase": "image-indexing_process"}], "paper_keywords": ["Indexing", " Information retrieval", " Controlled languages"], "paper_abstract": "Purpose - This paper seeks to examine image retrieval within two different contexts: a monolingual context where the language of the query is the same as the indexing language and a multilingual context where the language of the query is different from the indexing language. The study also aims to compare two different approaches for the indexing of ordinary images representing common objects: traditional image indexing with the use of a controlled vocabulary and free image indexing using uncontrolled vocabulary. Design/methodology/approach - This research uses three data collection methods. An analysis of the indexing terms was employed in order to examine the multiplicity of term types assigned to images. A simulation of the retrieval process involving a set of 30 images was performed with 60 participants. The quantification of the retrieval performance of each indexing approach was based on the usability measures, that is, effectiveness, efficiency and satisfaction of the user. Finally, a questionnaire was used to gather information on searcher satisfaction during and after the retrieval process. Findings - The results of this research are twofold. The analysis of indexing terms associated with all the 3,950 images provides a comprehensive description of the characteristics of the four non-combined indexing forms used for the study. Also, the retrieval simulation results offers information about the relative performance of the six indexing forms (combined and non-combined) in terms of their effectiveness, efficiency (temporal and human) and the image searcher's satisfaction. Originality/value - The findings of the study suggest that, in the near future, the information systems could benefit from allowing an increased coexistence of controlled vocabularies and uncontrolled vocabularies, resulting from collaborative image tagging, for example, and giving the users the possibility to dynamically participate in the image-indexing process, in a more user-centred way.", "paper_title": "Ordinary image retrieval in a multilingual context A comparison of two indexing vocabularies", "paper_id": "WOS:000282798400007"}