{"auto_keywords": [{"score": 0.047792824767915534, "phrase": "globalized_culture"}, {"score": 0.04230518402390077, "phrase": "local_culture"}, {"score": 0.02895638037886635, "phrase": "cultural_neighborhood"}, {"score": 0.027475168021277526, "phrase": "probability_distribution"}, {"score": 0.004323886831151445, "phrase": "social_network"}, {"score": 0.003661275004971829, "phrase": "degree_s"}, {"score": 0.003130396338031522, "phrase": "foreign_cultural_traits"}, {"score": 0.003024909947609294, "phrase": "stronger_resistance"}, {"score": 0.0027969169552386, "phrase": "random_number"}, {"score": 0.0026243534128245886, "phrase": "maximum_value"}, {"score": 0.002414616656410503, "phrase": "power-law_behavior"}, {"score": 0.002379379676378223, "phrase": "small_fraction_r"}, {"score": 0.002344655708000408, "phrase": "total_population"}], "paper_keywords": ["agent-based models", " social networks", " directed graphs", " discrete dynamical systems"], "paper_abstract": "We study a model describing the spread of a globalized culture in a population of individuals localized at the nodes of a social network. The influence of this globalized culture, assumed to be foreign to the local culture, is measured by a probability to convince each individual to adopt its cultural traits. This probability depends upon the degree s-a real between 0 and 1-of \"wise\" skepticism characterizing the personality of each individual and a parameter a representing the resistance of the society as a whole to the spread of the foreign cultural traits. A greater a indicates a stronger resistance of the local culture to globalization. On the other hand, each individual interacts with a random number of other individuals-her cultural neighborhood-uniformly distributed between 1 and a maximum value. The probability distribution of an individual to belong to the cultural neighborhood of another individual has a power-law behavior. A small fraction r of the total population belonging to the tail of this probability distribution have an s-value equal to 1. They represent the most conservative individuals firmly attached to their local culture.", "paper_title": "Is it possible to control the spread of a globalized culture?", "paper_id": "WOS:000252004500003"}