{"auto_keywords": [{"score": 0.039271912623931836, "phrase": "facial_expressions"}, {"score": 0.025054186372177253, "phrase": "self-_disclosure"}, {"score": 0.00481495049065317, "phrase": "behavioral_realism"}, {"score": 0.004585332915477379, "phrase": "verbal_disclosure"}, {"score": 0.004544770921520536, "phrase": "nonverbal_disclosure"}, {"score": 0.00450456611645112, "phrase": "emotion_recognition"}, {"score": 0.004405596416783185, "phrase": "dyadic_interaction"}, {"score": 0.004066898031169739, "phrase": "collaborative_virtual_environments"}, {"score": 0.003821503621554738, "phrase": "tracking_technology"}, {"score": 0.0036715973701254823, "phrase": "desktop_cve._participants"}, {"score": 0.002861961643289598, "phrase": "rectangular_polygon"}, {"score": 0.0027252240573281163, "phrase": "verbal_and_non-_verbal_self-_disclosure"}, {"score": 0.0026652435674846095, "phrase": "videoconference_condition"}, {"score": 0.002470987929071079, "phrase": "emotibox_condition"}, {"score": 0.0024490834773668153, "phrase": "previous_work"}, {"score": 0.0022705467477443417, "phrase": "hybrid_realism_solution"}, {"score": 0.0022404162042797262, "phrase": "high_copresence"}, {"score": 0.0021049977753042253, "phrase": "distance_learning"}], "paper_keywords": [""], "paper_abstract": "The realism of avatars in terms of behavior and form is critical to the development of collaborative virtual environments. In the study we utilized state of the art, realtime face tracking technology to track and render facial expressions unobtrusively in a desktop CVE. Participants in dyads interacted with each other via either a videoconference ( high behavioral realism and high form realism), voice only ( low behavioral realism and low form realism), or an \" emotibox\" that rendered the dimensions of facial expressions abstractly in terms of color, shape, and orientation on a rectangular polygon ( high behavioral realism and low form realism). Verbal and non- verbal self- disclosure were lowest in the videoconference condition while self- reported copresence and success of transmission and identification of emotions were lowest in the emotibox condition. Previous work demonstrates that avatar realism increases copresence while decreasing self- disclosure. We discuss the possibility of a hybrid realism solution that maintains high copresence without lowering self- disclosure, and the benefits of such an avatar on applications such as distance learning and therapy.", "paper_title": "The effect of behavioral realism and form realism of real-time avatar faces on verbal disclosure, nonverbal disclosure, emotion recognition, and copresence in dyadic interaction", "paper_id": "WOS:000240909800002"}