{"auto_keywords": [{"score": 0.03252551343688582, "phrase": "height_field"}, {"score": 0.00481495049065317, "phrase": "collision_control"}, {"score": 0.004688321299229397, "phrase": "efficient_interactive_system"}, {"score": 0.00458940888106061, "phrase": "naked_bird"}, {"score": 0.004327981760540394, "phrase": "guide_feathers"}, {"score": 0.0041251561573501455, "phrase": "body_feathers"}, {"score": 0.004059673618719782, "phrase": "special_skeleton"}, {"score": 0.0035527409334589317, "phrase": "growth_priority"}, {"score": 0.0034963129868796033, "phrase": "feather_roots"}, {"score": 0.003332332086930163, "phrase": "growth_order"}, {"score": 0.0032793933580835574, "phrase": "greedily_constructed_directed_acyclic_graph"}, {"score": 0.002884979280317279, "phrase": "efficient_way"}, {"score": 0.0026345758986796703, "phrase": "feather_adjustments"}, {"score": 0.0023549822490693344, "phrase": "model_animation"}, {"score": 0.002196944917134202, "phrase": "interactive_framerates"}], "paper_keywords": [""], "paper_abstract": "We present an efficient interactive system for dressing a naked bird with feathers. In our system, a skeleton associated with guide feathers is used to describe the distribution of the body feathers. The special skeleton can be easily built by the user, given a 3D bird model as input. To address the problem of interpenetrations among feathers, the growth priority between the feather roots is defined, with which we obtain the growth order from a greedily constructed directed acyclic graph. Each feather is then adjusted in that order by a height field based collision resolution process. The height field not only provides an efficient way to detect the collision but also enables us to finely control the degree of collision during feather adjustments. The results show that our approach is capable of resolving the collisions among thousands of feathers in a few seconds. If model animation is desired, the feathers can be adjusted on the fly at interactive framerates. Details of our implementation are provided with several examples to demonstrate the effectiveness of our system.", "paper_title": "An Efficient Feathering System with Collision Control", "paper_id": "WOS:000363216500027"}