{"auto_keywords": [{"score": 0.03849243066192558, "phrase": "false_information"}, {"score": 0.00481495049065317, "phrase": "modeling_agent_trust"}, {"score": 0.0047732596509542135, "phrase": "effective_communication"}, {"score": 0.004670597652149685, "phrase": "mobile_ad_hoc_vehicular_networks"}, {"score": 0.004610058444728656, "phrase": "increasingly_large_number"}, {"score": 0.0044718206943536514, "phrase": "global_positioning_system"}, {"score": 0.00443308765153716, "phrase": "wi-fi_devices"}, {"score": 0.004262881313926916, "phrase": "increased_passenger_and_road_safety"}, {"score": 0.003976203286249396, "phrase": "received_information"}, {"score": 0.0037249113156851013, "phrase": "car_owners'_utility"}, {"score": 0.0035974243349266894, "phrase": "dire_consequences"}, {"score": 0.0034143003168921114, "phrase": "serious_need"}, {"score": 0.0032974089700312423, "phrase": "main_goal"}, {"score": 0.002893505913503472, "phrase": "multifaceted_trust_modeling_approach"}, {"score": 0.002237477619351199, "phrase": "different_facets"}, {"score": 0.002151388538895855, "phrase": "important_methodology"}, {"score": 0.0021049977753042253, "phrase": "intelligent_agents"}], "paper_keywords": ["Intelligent agent", " intelligent vehicles", " multiagent systems"], "paper_abstract": "An increasingly large number of cars are being equipped with global positioning system and Wi-Fi devices, enabling vehicle-to-vehicle (V2V) communication with the goal of providing increased passenger and road safety. This technology actuates the need for agents that assist users by intelligently processing the received information. Some of these agents might become self-interested and try to maximize car owners' utility by sending out false information. Given the dire consequences of acting on false information in this context, there is a serious need to establish trust among agents. The main goal of this paper is then to develop a framework that models the trustworthiness of the agents of other vehicles, in order to receive the most effective information. We develop a multifaceted trust modeling approach that incorporates role-, experience-, priority-, and majority-based trust and this is able to restrict the number of reports that are received. We include an algorithm that proposes how to integrate these various dimensions of trust, along with experimentation to validate the benefit of our approach, emphasizing the importance of each of the different facets that are included. The result is an important methodology to enable effective V2V communication via intelligent agents.", "paper_title": "A Multifaceted Approach to Modeling Agent Trust for Effective Communication in the Application of Mobile Ad Hoc Vehicular Networks", "paper_id": "WOS:000289471700013"}