{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "aspiration_adaptation_theory"}, {"score": 0.04287039156384935, "phrase": "key_elements"}, {"score": 0.004507882471601552, "phrase": "important_problem"}, {"score": 0.0043506951029334984, "phrase": "strong_empirical_evidence"}, {"score": 0.004198965651975536, "phrase": "bounded_rationality"}, {"score": 0.00349803055484394, "phrase": "different_group"}, {"score": 0.0031284221314354065, "phrase": "negotiation_strategies"}, {"score": 0.0029137604783116065, "phrase": "art_automated_negotiation_agents"}, {"score": 0.0026457367614424756, "phrase": "automated_agents"}, {"score": 0.002566347557912897, "phrase": "aat"}, {"score": 0.002414544068560716, "phrase": "multiple_parameters"}, {"score": 0.0021049977753042253, "phrase": "simulation_environments"}], "paper_keywords": ["Bounded rationality", " Agent simulations", " Human-agent mixed systems"], "paper_abstract": "Creating agents that realistically simulate and interact with people is an important problem. In this paper we present strong empirical evidence that such agents should be based on bounded rationality, and specifically on key elements from Aspiration Adaptation Theory (AAT). First, we analyzed the strategies people described they would use to solve two relatively basic optimization problems involving one and two parameters. Second, we studied the agents a different group of people wrote to solve these same problems. We then studied two realistic negotiation problems involving five and six parameters. Again, first we studied the negotiation strategies people used when interacting with other people. Then we studied two state of the art automated negotiation agents and negotiation sessions between these agents and people. We found that in both the optimizing and negotiation problems the overwhelming majority of automated agents and people used key elements from AAT, even when optimal solutions, machine learning techniques for solving multiple parameters, or bounded techniques other than AAT could have been implemented. We discuss the implications of our findings including suggestions for designing more effective agents for game and simulation environments.", "paper_title": "Modeling agents based on aspiration adaptation theory", "paper_id": "WOS:000298964600002"}