{"auto_keywords": [{"score": 0.04397146767907389, "phrase": "ring"}, {"score": 0.01121942353656773, "phrase": "case_studies"}, {"score": 0.00481495049065317, "phrase": "language-oriented_rule-based_reaction_network_generation"}, {"score": 0.004398094237005956, "phrase": "complex_thermochemical_reaction_networks"}, {"score": 0.004275347843870176, "phrase": "generation_and_topological_network_analysis"}, {"score": 0.003546513036085932, "phrase": "valuable_chemicals"}, {"score": 0.0035065523764817143, "phrase": "known_chemistries"}, {"score": 0.003467040410632942, "phrase": "commonly_available_chemicals"}, {"score": 0.0029083942467546305, "phrase": "acid_catalysts"}, {"score": 0.0022919762167777427, "phrase": "likely_products"}, {"score": 0.0021778895748464024, "phrase": "computational_analysis"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Rule-based network generation", " Reaction network analysis", " Pathway analysis", " Mechanism elucidation", " Mechanism hypothesis testing", " Synthesis routes prediction"], "paper_abstract": "Applications of RING in the generation and analysis of complex thermochemical reaction networks are presented. Automated generation and topological network analysis features in RING allow for: (a) constructing reaction networks exhaustively in a rule-based manner, (b) identifying dominant pathways in networks using estimates of kinetic parameters, (c) hypothesis and testing of mechanisms by comparing pathway results from RING with experimental data, and (d) predicting atom-efficient synthetic routes to valuable chemicals from known chemistries and commonly available chemicals. Case studies involving three chemical systems are used to demonstrate these features in RING: (a) acid-catalyzed propane aromatization, (b) glycerol and acetone dehydration on acid catalysts, and (c) C-4-C-9 mono-alcohols synthesis from C-2 and C-3 oxygenates on acid, base, and metal catalyzed chemistries. Through these case studies, we demonstrate that RING can be used to postulate mechanisms and predict likely products for a given system, thereby guiding experimentation and computational analysis. (C) 2012 Elsevier Ltd. All rights reserved.", "paper_title": "Language-oriented rule-based reaction network generation and analysis: Applications of RING", "paper_id": "WOS:000308714800013"}