{"auto_keywords": [{"score": 0.03261638306028882, "phrase": "proposed_approach"}, {"score": 0.014254482243158543, "phrase": "original_image"}, {"score": 0.011675272710487176, "phrase": "watermarked_image"}, {"score": 0.010732590077251898, "phrase": "watermark_energy"}, {"score": 0.009391751737099621, "phrase": "adaptive_wiener_filter"}, {"score": 0.00481495049065317, "phrase": "eigen-image_energy"}, {"score": 0.004664352260912174, "phrase": "denoising_approaches"}, {"score": 0.004550469496119256, "phrase": "denoising_methods"}, {"score": 0.004021267064832957, "phrase": "probabilistic_methods"}, {"score": 0.00388165472334023, "phrase": "image_quality"}, {"score": 0.003503497128638099, "phrase": "stochastic_models"}, {"score": 0.0031845067058084583, "phrase": "energy_distribution"}, {"score": 0.0031286936417685178, "phrase": "experimental_results"}, {"score": 0.0030521898646210413, "phrase": "mean_peak_signal-to-noise_ratio"}, {"score": 0.0026214978443388653, "phrase": "randomly_selected_watermarked_images"}, {"score": 0.002548331088496964, "phrase": "'broken_arrows"}, {"score": 0.0025304943549243775, "phrase": "ba"}, {"score": 0.002391067964886602, "phrase": "mean_psnr"}, {"score": 0.002219790619936024, "phrase": "minimum_requirement"}], "paper_keywords": [""], "paper_abstract": "Most watermark-removal methods treat watermarks as noise and apply denoising approaches to remove them. However, denoising methods remove not only this watermark energy, but also some of the energy of the original image. A trade-off therefore exists: if not enough of the watermark is removed, then it will still be detected by probabilistic methods, but if too much is removed, the image quality will be noticeably poor. To solve this problem, the relationships among the energies of the original image, the watermark and the watermarked image are initially determined using stochastic models. Then the energy of the watermark is estimated using just-noticeable-distortion (JND). Finally, the watermark energy is removed from the watermarked image using the energy distribution of its Eigen-images. The experimental results show that the proposed approach yields a mean peak signal-to-noise ratio (PSNR) of the predicted images that is 2.2 dB higher than that obtained using the adaptive Wiener filter, and a mean normalised correlation (NC) value of the extracted watermarks that is 0.27 lower than that obtained using the adaptive Wiener filter. In removing watermark energy from 100 randomly selected watermarked images in which watermarks were embedded using the 'broken arrows (BA)' algorithm proposed for the second breaking our watermarking system (BOWS-2) contest, the mean PSNR of 100 predicted images is 24.1 dB and the proposed approach successfully removed watermarks from 90 of these images. This result exceeds the minimum requirement of PSNR 20 dB for the BOWS-2 contest. Clearly, the proposed approach is a very effective watermark-removal approach for removing watermarks.", "paper_title": "New watermark-removal method based on Eigen-image energy", "paper_id": "WOS:000295122600006"}