{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "motz_problem"}, {"score": 0.04031527527473298, "phrase": "special_functions"}, {"score": 0.034595098724285483, "phrase": "exponential_convergence"}, {"score": 0.014883521792344293, "phrase": "elliptic_problems"}, {"score": 0.014809712496437076, "phrase": "boundary_singularities"}, {"score": 0.010422389170383363, "phrase": "rbf_method"}, {"score": 0.004683765794332412, "phrase": "benchmark_problem"}, {"score": 0.004613716239647539, "phrase": "numerical_methods"}, {"score": 0.004343793943128486, "phrase": "radial_basis_function"}, {"score": 0.0042466776124070295, "phrase": "truly_meshfree_scheme"}, {"score": 0.004214788375378734, "phrase": "-_both_the_global_rbf_collocation_method"}, {"score": 0.0041621696063948894, "phrase": "kansas"}, {"score": 0.0041102032028337366, "phrase": "recently_proposed_local_rbf-based_differential_quadrature"}, {"score": 0.003717083613376882, "phrase": "global_collocation"}, {"score": 0.0036430969874617666, "phrase": "rbf"}, {"score": 0.0035975671431900777, "phrase": "singular_functions"}, {"score": 0.003534806124998774, "phrase": "local_singular_solution"}, {"score": 0.003481880090562682, "phrase": "local_collocation"}, {"score": 0.003253318358678878, "phrase": "increasing_resolution"}, {"score": 0.003236995218598272, "phrase": "increasing_shape_parameter"}, {"score": 0.0030168610393007905, "phrase": "partial_differential_equation"}, {"score": 0.0029791521714637704, "phrase": "boundary_nodes"}, {"score": 0.00271433276282174, "phrase": "motz's_problem"}, {"score": 0.002660236042912387, "phrase": "elliptic_partial_differential_equations"}, {"score": 0.0025488244859229697, "phrase": "wide_range"}, {"score": 0.0024857229074761087, "phrase": "dirichlet"}, {"score": 0.002473214681550833, "phrase": "neumann"}, {"score": 0.0024236964502593254, "phrase": "first_derivatives"}, {"score": 0.002357507815066095, "phrase": "lrbfdq"}, {"score": 0.002333888942472883, "phrase": "truly_meshless_methods"}, {"score": 0.0021049977753042253, "phrase": "shape_parameter"}], "paper_keywords": ["Differential equations", " Numerical analysis", " Boundary-elements methods"], "paper_abstract": "Purpose - The Motz problem can be considered as a benchmark problem for testing the performance of numerical methods in the solution of elliptic problems with boundary singularities. The purpose of this paper is to address the solution of the Motz problem using the radial basis function (RBF) method, which is a truly meshfree scheme. Design/methodology/approach - Both the global RBF collocation method (also known as Kansas method) and the recently proposed local RBF-based differential quadrature (LRBFDQ) method are considered. In both cases, it is shown that the accuracy of the solution can be significantly increased by using special functions which capture the behavior of the singularity. In the case of global collocation, the functional space spanned by the RBF is enlarged by adding singular functions which capture the behavior of the local singular solution. In the case of local collocation, the problem is modified appropriately in order to eliminate the singularities from the formulation. Findings - The paper shows that the exponential convergence both with increasing resolution and increasing shape parameter, which is typical of the RBF method, is lost in problems containing singularities. The accuracy of the solution can be increased by collocation of the partial differential equation (PDE) at boundary nodes. However, in order to restore the exponential convergence of the RBF method, it is necessary to use special functions which capture the behavior of the solution near the discontinuity. Practical implications - The paper uses Motz's problem as a prototype for problems described by elliptic partial differential equations with boundary singularities. However, the results obtained in the paper are applicable to a wide range of problems containing boundaries with conditions which change from Dirichlet to Neumann, thus leading to singularities in the first derivatives. Originality/value - The paper shows that both the global RBF collocation method and the LRBFDQ method, are truly meshless methods which can be very useful for the solution of elliptic problems with boundary singularities. In particular, when complemented with special functions that capture the behavior of the solution near the discontinuity, the method exhibits exponential convergence both with resolution and with shape parameter.", "paper_title": "Radial basis function solution of the Motz problem", "paper_id": "WOS:000281993800002"}