{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "assessor's_subjective_probability"}, {"score": 0.004764859786310636, "phrase": "\"not_worse_than_independence"}, {"score": 0.004030449969901066, "phrase": "informal_approach"}, {"score": 0.003905864553426306, "phrase": "channel_probabilities"}, {"score": 0.0033910448175165004, "phrase": "possible_dependence"}, {"score": 0.0033381913087533457, "phrase": "channel_failures"}, {"score": 0.003118486096035156, "phrase": "formal_footing"}, {"score": 0.002808298910480358, "phrase": "prior_belief"}, {"score": 0.002637160140011997, "phrase": "conservative_prior_system_pfd"}, {"score": 0.0025555322596460036, "phrase": "conservative_posterior_system_pfd"}, {"score": 0.002387214876538434, "phrase": "system_failure"}, {"score": 0.0023254633298356894, "phrase": "illustrative_numerical_examples"}, {"score": 0.0021049977753042253, "phrase": "future_research"}], "paper_keywords": ["System reliability", " software fault tolerance", " 1-out-of-2 system", " dependent failures", " subjective probability"], "paper_abstract": "We consider the problem of assessing the reliability of a 1-out-of-2 software-based system, in which failures of the two channels cannot be assumed to be independent with certainty. An informal approach to this problem assesses the channel probabilities of failure on demand (pfds) conservatively, and then multiplies these together in the hope that the conservatism will be sufficient to overcome any possible dependence between the channel failures. Our intention here is to place this kind of reasoning on a formal footing. We introduce a notion of \"not worse than independence\" and assume that an assessor has a prior belief about this, expressed as a probability. We obtain a conservative prior system pfd, and show how a conservative posterior system pfd can be obtained following the observation of a number of demands without system failure. We present some illustrative numerical examples, discuss some of the difficulties involved in this way of reasoning, and suggest some avenues of future research.", "paper_title": "Conservative Bounds for the pfd of a 1-out-of-2 Software-Based System Based on an Assessor's Subjective Probability of \"Not Worse Than Independence\"", "paper_id": "WOS:000327607000002"}