{"auto_keywords": [{"score": 0.03920557268818556, "phrase": "sensor_node"}, {"score": 0.013099495581128608, "phrase": "heterogeneous_nodes"}, {"score": 0.00481495049065317, "phrase": "homogeneous_and_heterogeneous_k-covered_wireless_sensor_networks"}, {"score": 0.00460376161704646, "phrase": "wireless_sensor_network"}, {"score": 0.004517622363662635, "phrase": "minimum_connected_k-coverage"}, {"score": 0.004496339426268177, "phrase": "homogeneous_and_heterogeneous_wireless_sensor_networks"}, {"score": 0.004299064805926241, "phrase": "necessary_total_number"}, {"score": 0.004278807087784626, "phrase": "active_nodes"}, {"score": 0.004139639802595566, "phrase": "homogeneous_nodes"}, {"score": 0.003948613642680196, "phrase": "minimum_connected_k-coverage_problem"}, {"score": 0.0038746849003761024, "phrase": "range_slicing"}, {"score": 0.0038564191670589884, "phrase": "active_node_scheduling"}, {"score": 0.003802135020791801, "phrase": "slicing_phase"}, {"score": 0.003757480190200645, "phrase": "sensing_range"}, {"score": 0.0034920505103165403, "phrase": "scheduling_phase"}, {"score": 0.0032376465741070274, "phrase": "first_protocol"}, {"score": 0.0031100973266506163, "phrase": "local_information"}, {"score": 0.0030088272133045545, "phrase": "second_protocol"}, {"score": 0.0029039692582303904, "phrase": "necessary_number"}, {"score": 0.0027567336518542858, "phrase": "driven_k-coverage"}, {"score": 0.002641823250595624, "phrase": "commonly_used_assumption"}, {"score": 0.0026293540353514075, "phrase": "coverage_configuration_protocols"}, {"score": 0.0026169435194789772, "phrase": "wireless_sensor_networks"}, {"score": 0.0023806459272452353, "phrase": "simulation_results"}, {"score": 0.0023415390666563177, "phrase": "self-scheduling_driven_k-coverage"}, {"score": 0.002286781334850213, "phrase": "connected_k-coverage_configuration"}, {"score": 0.002259883463607508, "phrase": "network_lifetime"}, {"score": 0.0022070310530794097, "phrase": "existing_connected_k-coverage_protocol"}, {"score": 0.0021351033500114735, "phrase": "positive_impact"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Heterogeneous wireless sensor networks", " k-coverage", " Connectivity", " Self-scheduling", " Triggered scheduling"], "paper_abstract": "Sensing coverage is a performance metric that reflects the quality of surveillance of a field by a wireless sensor network. This paper investigates the problem of minimum connected k-coverage in homogeneous and heterogeneous wireless sensor networks, where each point in a field is covered (or sensed) by at least k active nodes while minimizing the necessary total number of active nodes and guaranteeing connectivity between them. First, we study the case of homogeneous nodes to gain some insights on how to address the problem of k-coverage using heterogeneous nodes. Our methodology to solve the minimum connected k-coverage problem consists of two main phases: sensing range slicing and active node scheduling. The goal of the slicing phase is to decompose the sensing range of a sensor node into smaller, congruent regions such that each of them is guaranteed to be k-covered when exactly k nodes are deployed in it. The purpose of the scheduling phase is to specify which nodes turn on (or become active), how, and when. In this paper, we propose two k-coverage protocols using different scheduling approaches. In the first protocol, called self-scheduling driven k-coverage, each sensor node turns itself on based on the local information it has about its sensing neighbors in order to k-cover its sensing range. The second protocol, called triggered-scheduling driven k-coverage, allows a sensor node to trigger a necessary number of its sensing neighbors to become active in order to achieve k-coverage of its sensing range. Then, to promote the use of self-scheduling driven k-coverage and triggered-scheduling driven k-coverage in real-world sensing applications, we show how to relax some commonly used assumption for coverage configuration protocols in wireless sensor networks. More specifically, we discuss a more general framework, where the nodes are heterogeneous in terms of their sensing ranges. Precisely, we propose two protocols for k-coverage using heterogeneous nodes and generalize them by considering convex sensing and communication models. Simulation results show that triggered-scheduling driven k-coverage outperforms self-scheduling driven k-coverage with regard to the number of nodes required for connected k-coverage configuration as well as the network lifetime. We find that self-scheduling driven k-coverage outperforms an existing connected k-coverage protocol for wireless sensor networks. Also, we find that heterogeneity has a positive impact on our k-coverage protocol performance. Published by Elsevier B.V.", "paper_title": "Scheduling protocols for homogeneous and heterogeneous k-covered wireless sensor networks", "paper_id": "WOS:000299669100007"}