{"auto_keywords": [{"score": 0.04257133096705247, "phrase": "social_psychological_theories"}, {"score": 0.032840996583322686, "phrase": "functional_benefits"}, {"score": 0.027746251683820226, "phrase": "microtransaction-using_player"}, {"score": 0.004747429622531595, "phrase": "-game_advantages"}, {"score": 0.004714023408114857, "phrase": "online_games"}, {"score": 0.004664352260912174, "phrase": "player's_status"}, {"score": 0.004518442937844318, "phrase": "computer_games"}, {"score": 0.004470823343432748, "phrase": "substantial_changes"}, {"score": 0.004346266306175988, "phrase": "social_interaction"}, {"score": 0.004035500442527029, "phrase": "social_comparisons"}, {"score": 0.0030521898646210413, "phrase": "in-game_advantage"}, {"score": 0.0026967596578196325, "phrase": "lower_skill"}, {"score": 0.002548331088496964, "phrase": "competitive_advantage"}, {"score": 0.0023408288327263294, "phrase": "important_practical_implications"}, {"score": 0.00232431758517087, "phrase": "game_design"}, {"score": 0.0021501863832966966, "phrase": "online_behavior"}], "paper_keywords": ["Microtransactions", " free-to-play", " real money transactions", " social comparisons", " status", " multiplayer gaming"], "paper_abstract": "With the advent of the internet, computer games have undergone substantial changes. Many games now contain some form of social interaction with other players. Furthermore, many games offer players the opportunity to buy upgrades using microtransactions. Based on social psychological theories on social comparisons, deservedness, and envy, we tested whether the use of these microtransactions would affect how players perceive another player using them. In one survey and two experimental scenario-studies with active gamers as participants ( total N = 532), we found evidence supporting the idea that a player using microtransactions will be judged more negatively. More specifically, we find that gamers dislike it more when microtransactions allow the buying of functional benefits ( that provide an in-game advantage) than when they are merely ornamental, and players who buy these functional benefits are respected less. In Studies 2 and 3 we found that players who use microtransactions are perceived as having a lower skill and status. This happens both when the microtransaction-using player is an enemy who bought a competitive advantage, as well as in games where one cooperates with the microtransaction-using player and the advantage is thus effectively shared. The findings have important practical implications for game design. They indicate how microtransactions can be implemented so that they have fewer negative social consequences, demonstrate the value of social psychological theories in predicting online behavior, and provide several avenues for further theoretical exploration.", "paper_title": "The Hidden Cost of Microtransactions: Buying In-Game Advantages in Online Games Decreases a Player's Status", "paper_id": "WOS:000380855000002"}