{"auto_keywords": [{"score": 0.015263952200396268, "phrase": "resource-fair_protocols"}, {"score": 0.00481495049065317, "phrase": "resource_fairness"}, {"score": 0.004783232571029632, "phrase": "composability_of_cryptographic_protocols"}, {"score": 0.0041357305373417455, "phrase": "previously_proposed_definitions"}, {"score": 0.004027751272984522, "phrase": "standard_simulation_paradigm"}, {"score": 0.003987986947650714, "phrase": "strong_composability_properties"}, {"score": 0.003858241873901003, "phrase": "security_definition"}, {"score": 0.003820144626025562, "phrase": "universal_composability"}, {"score": 0.0036112323484812675, "phrase": "additional_resources"}, {"score": 0.0035285548582081627, "phrase": "dishonest_parties"}, {"score": 0.0033911868693238894, "phrase": "ideally_fair_functionality"}, {"score": 0.003153041030690117, "phrase": "fair_deal"}, {"score": 0.003091036449708673, "phrase": "fair_dealings"}, {"score": 0.003030247482854539, "phrase": "particular_functionality"}, {"score": 0.00280806350681826, "phrase": "well-known_impossibility_result"}, {"score": 0.002789528662623221, "phrase": "fair_multi-party_computation"}, {"score": 0.002671990515821213, "phrase": "arbitrary_number"}, {"score": 0.0025678829712650437, "phrase": "uc_framework"}, {"score": 0.0024112587007106535, "phrase": "\"commit-prove-fair-open\"_functionality_and_design_an_efficient_resource-fair_protocol"}, {"score": 0.002168715943767454, "phrase": "existing_secure_multi-party_computation_protocols"}], "paper_keywords": ["Secure multi-party computation", " Fairness", " Security models and definitions", " Universal composability", " Cryptographic protocols"], "paper_abstract": "We introduce the notion of resource-fair protocols. Informally, this property states that if one party learns the output of the protocol, then so can all other parties, as long as they expend roughly the same amount of resources. As opposed to previously proposed definitions related to fairness, our definition follows the standard simulation paradigm and enjoys strong composability properties. In particular, our definition is similar to the security definition in the universal composability (UC) framework, but works in a model that allows any party to request additional resources from the environment to deal with dishonest parties that may prematurely abort. In this model we specify the ideally fair functionality as allowing parties to \"invest resources\" in return for outputs, but in such an event offering all other parties a fair deal. (The formulation of fair dealings is kept independent of any particular functionality, by defining it using a \"wrapper.\") Thus, by relaxing the notion of fairness, we avoid a well-known impossibility result for fair multi-party computation with corrupted majority; in particular, our definition admits constructions that tolerate arbitrary number of corruptions. We also show that, as in the UC framework, protocols in our framework may be arbitrarily and concurrently composed. Turning to constructions, we define a \"commit-prove-fair-open\" functionality and design an efficient resource-fair protocol that securely realizes it, using a new variant of a cryptographic primitive known as \"time-lines.\" With (the fairly wrapped version of) this functionality we show that some of the existing secure multi-party computation protocols can be easily transformed into resource-fair protocols while preserving their security.", "paper_title": "Resource Fairness and Composability of Cryptographic Protocols", "paper_id": "WOS:000294804700001"}