{"auto_keywords": [{"score": 0.04177569747328364, "phrase": "mobile_projector_phones"}, {"score": 0.010414106300514332, "phrase": "first_study"}, {"score": 0.00481495049065317, "phrase": "pico-ing"}, {"score": 0.00471700544744796, "phrase": "mobile_projection"}, {"score": 0.003257432325797907, "phrase": "mobile_projections"}, {"score": 0.00313894917464766, "phrase": "experience_sampling_method"}, {"score": 0.0030372426452745073, "phrase": "different_media_types"}, {"score": 0.002831894638104635, "phrase": "second_study"}, {"score": 0.0027741761880779535, "phrase": "video_diary_entries"}, {"score": 0.0025547994452342266, "phrase": "complementary_insights"}, {"score": 0.002523420125608051, "phrase": "future_use"}, {"score": 0.002461810159687652, "phrase": "detailed_responses"}, {"score": 0.0024116163689723354, "phrase": "media_types"}, {"score": 0.002295277579105177, "phrase": "known_mobile_information_needs"}, {"score": 0.0021049977753042253, "phrase": "interaction_design"}], "paper_keywords": ["Pico-projectors", " Diary study", " Experience sampling", " Mobile"], "paper_abstract": "Ten years ago, we were on the verge of having cameras built into our mobile phones, but knew very little about what to expect or how they would be used. Now we are faced with the same unknowns with mobile projector phones. This research seeks to explore how people will want to use such technology, how they will feel when using it, and what social effects we can expect to see. This paper describes our two-phase field investigation that uses a combination of methods to investigate how, when, and why mobile projections may be used. The first study used an experience sampling method to investigate responses to a range of different media types, and, for example, the choice of surfaces used in each case. The second study asked users to create video diary entries showing when, where, and why they would have wanted to project information. Together these studies provide complementary insights into the future use of mobile projector phones. Our results cover detailed responses to a range of media types from the first study, while the second identified which of the known mobile information needs were commonly recorded by participants. Both studies provide insights that may help shape the hardware, software, and interaction design of mobile projector phones as they become increasingly available.", "paper_title": "Pico-ing into the future of mobile projection and contexts", "paper_id": "WOS:000299516400005"}