{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "biplot_analysis"}, {"score": 0.006455150417524004, "phrase": "multivariate_data"}, {"score": 0.004769182299692333, "phrase": "multivariate_bibliometric"}, {"score": 0.004723847090183984, "phrase": "scientific_indicators"}, {"score": 0.004678940805063634, "phrase": "bibliometric_mapping"}, {"score": 0.004634459424542272, "phrase": "visualization_techniques"}, {"score": 0.004525088883501587, "phrase": "main_pillars"}, {"score": 0.004313996835376177, "phrase": "main_methodologies"}, {"score": 0.004192078165260057, "phrase": "multidimensional_scaling"}, {"score": 0.0041522059428827345, "phrase": "principal_component_analysis"}, {"score": 0.00409310463335204, "phrase": "correspondence_analysis"}, {"score": 0.003902085339580381, "phrase": "visualization_methodology"}, {"score": 0.003597514862052876, "phrase": "graphical_representation"}, {"score": 0.0034459835582278746, "phrase": "data_matrix"}, {"score": 0.0029711052657054463, "phrase": "research_policy_area"}, {"score": 0.0023388183537341213, "phrase": "biplot_representation"}, {"score": 0.0022188370388602813, "phrase": "useful_technique"}, {"score": 0.0021049977753042253, "phrase": "easy-to-read_tool"}], "paper_keywords": ["scientometrics"], "paper_abstract": "Bibliometric mapping and visualization techniques represent one of the main pillars in the field of scientometrics. Traditionally, the main methodologies employed for representing data are multidimensional scaling, principal component analysis, or correspondence analysis. In this paper we aim to present a visualization methodology known as biplot analysis for representing bibliometric and science and technology indicators. A biplot is a graphical representation of multivariate data, where the elements of a data matrix are represented according to dots and vectors associated with the rows and columns of the matrix. In this paper, we explore the possibilities of applying biplot analysis in the research policy area. More specifically, we first describe and introduce the reader to this methodology and secondly, we analyze its strengths and weaknesses through 3 different case studies: countries, universities, and scientific fields. For this, we use a biplot analysis known as JK-biplot. Finally, we compare the biplot representation with other multivariate analysis techniques. We conclude that biplot analysis could be a useful technique in scientometrics when studying multivariate data, as well as an easy-to-read tool for research decision makers.", "paper_title": "On the use of biplot analysis for multivariate bibliometric and scientific indicators", "paper_id": "WOS:000323389100014"}