{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "resource_assignment"}, {"score": 0.004685855684376706, "phrase": "difficult_task"}, {"score": 0.004635187610736025, "phrase": "job_processing_times"}, {"score": 0.004342430078306461, "phrase": "known_and_unknown_demand"}, {"score": 0.0038948525410795517, "phrase": "robust_schedule"}, {"score": 0.0037493114715625784, "phrase": "strategically_placed_idle_time"}, {"score": 0.0036091892088392775, "phrase": "second_approach"}, {"score": 0.0034366728236876016, "phrase": "free_resources"}, {"score": 0.003236941658990869, "phrase": "strategically_placed_buffering"}, {"score": 0.0026607205525625995, "phrase": "job_cancellations"}, {"score": 0.0023346234464901978, "phrase": "health_care"}, {"score": 0.0021631447601689444, "phrase": "better_strategy"}, {"score": 0.0021049977753042253, "phrase": "effective_stochastic_scheduling_approach"}], "paper_keywords": ["Scheduling", " Buffering", " Resource partitioning", " Uncertain demand"], "paper_abstract": "Resource assignment and scheduling is a difficult task when job processing times are stochastic, and resources are to be used for both known and unknown demand. To operate effectively within such an environment, several novel strategies are investigated. The first focuses upon the creation of a robust schedule, and utilises the concept of strategically placed idle time (i.e. buffering). The second approach introduces the idea of maintaining a number of free resources at each time, and culminates in another form of strategically placed buffering. The attraction of these approaches is that they are easy to grasp conceptually, and mimic what practitioners already do in practice. Our extensive numerical testing has shown that these techniques ensure more prompt job processing, and reduced job cancellations and waiting time. They are effective in the considered setting and could easily be adapted for many real life problems, for instance those in health care. This article has more importantly demonstrated that integrating the two approaches is a better strategy and will provide an effective stochastic scheduling approach. (C) 2015 Elsevier Ltd. All rights reserved.", "paper_title": "Techniques to effectively buffer schedules in the face of uncertainties", "paper_id": "WOS:000360772100003"}