{"auto_keywords": [{"score": 0.04475207662864961, "phrase": "datalog"}, {"score": 0.00481495049065317, "phrase": "semantic_and_computational_issues"}, {"score": 0.004724571550328985, "phrase": "recent_results"}, {"score": 0.004635881163634672, "phrase": "logic-based_systems"}, {"score": 0.004363058588000252, "phrase": "description_logics"}, {"score": 0.004121826934975274, "phrase": "main_issues"}, {"score": 0.003748937184382714, "phrase": "semantic_viewpoint"}, {"score": 0.0036645642553325215, "phrase": "open-world_semantics"}, {"score": 0.0035550029054401016, "phrase": "closed-world_semantics"}, {"score": 0.0035147642199945387, "phrase": "semantic_discrepancy"}, {"score": 0.0034749794034364197, "phrase": "important_obstacle"}, {"score": 0.0033967510986397946, "phrase": "meaningful_combination"}, {"score": 0.0032578629307203097, "phrase": "reasoning_viewpoint"}, {"score": 0.0031484483754909026, "phrase": "rule_component"}, {"score": 0.002996840657035727, "phrase": "computational_properties"}, {"score": 0.002735816302446788, "phrase": "formal_system"}, {"score": 0.0026338658998573752, "phrase": "decidable_problem"}, {"score": 0.002555040841339798, "phrase": "main_approaches"}, {"score": 0.002459810433812049, "phrase": "special_emphasis"}, {"score": 0.0022284577808744316, "phrase": "main_open_problems"}, {"score": 0.002203200914130907, "phrase": "research_area"}], "paper_keywords": [""], "paper_abstract": "We present some recent results on the definition of logic-based systems integrating ontologies and rules. In particular, we take into account ontologies expressed in Description Logics and rules expressed in Datalog (and its nonmonotonic extensions). We first introduce the main issues that arise in the integration of ontologies and rules. In particular, we focus on the following aspects: (i) from the semantic viewpoint, ontologies are based on open-world semantics, while rules are typically interpreted under closed-world semantics. This semantic discrepancy constitutes an important obstacle for the definition of a meaningful combination of ontologies and rules; (ii) from the reasoning viewpoint, the interaction between an ontology and a rule component is very hard to handle, and does not preserve decidability and computational properties: e.g., starting from an ontology in which reasoning is decidable and a rule base in which reasoning is decidable, reasoning in the formal system obtained by integrating the two components may not be a decidable problem. Then, we briefly survey the main approaches for the integration of ontologies and rules, with special emphasis on how they deal with the above mentioned issues, and present in detail one of such approaches, i.e., DL+log. Finally, we illustrate the main open problems in this research area, pointing out what still prevents us from the development of both effective and expressive systems able to integrate ontologies and rules.", "paper_title": "Integrating ontologies and rules: Semantic and computational issues", "paper_id": "WOS:000240539300005"}