{"auto_keywords": [{"score": 0.049655608595442415, "phrase": "recommender_systems"}, {"score": 0.023227301113361, "phrase": "recommender_systems_research"}, {"score": 0.004688321299229397, "phrase": "important_research_field"}, {"score": 0.004565007074039171, "phrase": "first_paper"}, {"score": 0.004524624065803229, "phrase": "collaborative_filtering"}, {"score": 0.004425215632459868, "phrase": "academic_research"}, {"score": 0.004158290806404304, "phrase": "comprehensive_literature_review"}, {"score": 0.003299880298525127, "phrase": "eight_application_fields"}, {"score": 0.0024930878032164757, "phrase": "publication_years"}, {"score": 0.002352886041381761, "phrase": "future_direction"}, {"score": 0.0021620042653528846, "phrase": "future_research_direction"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Recommender systems", " Literature review", " Data mining technique", " Classification"], "paper_abstract": "Recommender systems have become an important research field since the emergence of the first paper on collaborative filtering in the mid-1990s. Although academic research on recommender systems has increased significantly over the past 10 years, there are deficiencies in the comprehensive literature review and classification of that research. For that reason, we reviewed 210 articles on recommender systems from 46 journals published between 2001 and 2010, and then classified those by the year of publication, the journals in which they appeared, their application fields, and their data mining techniques. The 210 articles are categorized into eight application fields (books, documents, images, movie, music, shopping, TV programs, and others) and eight data mining techniques (association rule, clustering, decision tree, k-nearest neighbor, link analysis, neural network, regression, and other heuristic methods). Our research provides information about trends in recommender systems research by examining the publication years of the articles, and provides practitioners and researchers with insight and future direction on recommender systems. We hope that this paper helps anyone who is interested in recommender systems research with insight for future research direction. (c) 2012 Elsevier Ltd. All rights reserved.", "paper_title": "A literature review and classification of recommender systems research", "paper_id": "WOS:000303300900012"}