{"auto_keywords": [{"score": 0.04875354461815798, "phrase": "visual_discomfort"}, {"score": 0.023045149268117713, "phrase": "stereoscopic_content"}, {"score": 0.006976623430362051, "phrase": "screen_disparity"}, {"score": 0.00481495049065317, "phrase": "visual_complaints"}, {"score": 0.004533806239310673, "phrase": "large_extent"}, {"score": 0.004303404058571052, "phrase": "binocular_status"}, {"score": 0.0037244390953401533, "phrase": "reading_speed_difference"}, {"score": 0.0036651042289628324, "phrase": "experiment_participants"}, {"score": 0.0035350218469335573, "phrase": "wilkins_rate"}, {"score": 0.0035067452724203124, "phrase": "reading_test"}, {"score": 0.00328849874768242, "phrase": "fusion_measurements"}, {"score": 0.0026577673946415583, "phrase": "high_wrrt-ratio"}, {"score": 0.002604890546456604, "phrase": "changed_fusion_range"}, {"score": 0.0025840347813610815, "phrase": "visual_fatigue"}, {"score": 0.0025326211341475903, "phrase": "significantly_more_visual_discomfort"}, {"score": 0.002472269923319476, "phrase": "lower_thresholds"}, {"score": 0.002384422461262006, "phrase": "normal_wrrt-ratio"}, {"score": 0.0022904619303011097, "phrase": "visual_screening_tool"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Visual discomfort", " Visual fatigue", " Reading performance", " Objective and subjective measurement", " Screening tool"], "paper_abstract": "Some people experience visual discomfort when watching stereoscopic content, which to a large extent can be predicted by their binocular visual status. Earlier research has proven that the binocular status can be assessed by the difference in reading speed between 2-D and 3-D. In this paper, we further substantiate the evidence for a tool to screen people on their susceptibility to such visual complaints based on this reading speed difference. In an experiment participants were asked to (1) perform the Wilkins Rate of Reading Test (WRRT) at three disparities (-1.5 degrees, 0 degrees and 1.5 degrees) preceded and followed by fusion measurements and self-reports, and (2) scale the screen disparity of stimuli to a threshold of visual discomfort. Participants were categorized based on the WRRT-ratio, being the ratio of the number of words read at 0 degrees disparity over the number of words read at -1.5 degrees disparity. Our results showed that only participants with a high WRRT-ratio revealed a tendency in changed fusion range indicating visual fatigue. They also reported significantly more visual discomfort in stereoscopic conditions and had lower thresholds in screen disparity for visual discomfort than participants with a normal WRRT-ratio. Hence, the WRRT-ratio has potential as a visual screening tool in 3-D consumer applications to warn viewers that are susceptible to visual discomfort when watching stereoscopic content. (c) 2012 Published by Elsevier B.V.", "paper_title": "Reading performance as screening tool for visual complaints from stereoscopic content", "paper_id": "WOS:000305924700006"}