{"auto_keywords": [{"score": 0.04132712815039597, "phrase": "finger_shape_model"}, {"score": 0.015719716506582538, "phrase": "feature_correspondences"}, {"score": 0.004774937143916685, "phrase": "prior_estimated_finger_model"}, {"score": 0.004598933498016774, "phrase": "multi-view_touchless_fingerprint_images"}, {"score": 0.0037795163893761027, "phrase": "scale_invariant_feature_transformation"}, {"score": 0.003685972800046028, "phrase": "ridge_feature"}, {"score": 0.003579750245670577, "phrase": "correspondences_establishment"}, {"score": 0.003505749731180509, "phrase": "fingerprint_features"}, {"score": 0.0034476484413811987, "phrase": "improved_fingerprint_enhancement_method"}, {"score": 0.003092690568543981, "phrase": "hierarchical_fingerprint_matching_approaches"}, {"score": 0.0026055251533586804, "phrase": "binary_quadratic_function"}, {"score": 0.0024065032567542107, "phrase": "reconstruction_accuracy"}, {"score": 0.00227914162528171, "phrase": "different_fingerprint_feature_correspondences"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["3D fingerprint reconstruction", " Finger shape model", " Fingerprint features correspondences", " Orientation map", " Frequency map", " Touchless multi-view imaging"], "paper_abstract": "The paper studies a 3D fingerprint reconstruction technique based on multi-view touchless fingerprint images. This technique offers a solution for 3D fingerprint image generation and application when only multi-view 2D images are available. However, the difficulties and stresses of 3D fingerprint reconstruction are the establishment of feature correspondences based on 2D touchless fingerprint images and the estimation of the finger shape model. In this paper, several popular used features, such as scale invariant feature transformation (SIFT) feature, ridge feature and minutiae, are employed for correspondences establishment. To extract these fingerprint features accurately, an improved fingerprint enhancement method has been proposed by polishing orientation and ridge frequency maps according to the characteristics of 2D touchless fingerprint images. Therefore, correspondences can be established by adopting hierarchical fingerprint matching approaches. Through an analysis of 440 3D point cloud finger data (220 fingers, 2 pictures each) collected by a 3D scanning technique, i.e., the structured light illumination (SLI) method, the finger shape model is estimated. It is found that the binary quadratic function is more suitable for the finger shape model than the other mixed model tested in this paper. In our experiments, the reconstruction accuracy is illustrated by constructing a cylinder. Furthermore, results obtained from different fingerprint feature correspondences are analyzed and compared to show which features are more suitable for 3D fingerprint images generation. (C) 2013 Elsevier Ltd. All rights reserved.", "paper_title": "3D fingerprint reconstruction system using feature correspondences and prior estimated finger model", "paper_id": "WOS:000326903500015"}