{"auto_keywords": [{"score": 0.0045122922461952805, "phrase": "corresponding_probability_distribution"}, {"score": 0.004081385289516914, "phrase": "traditional_statistical_approach"}, {"score": 0.0038930368103015467, "phrase": "standard_deviation"}, {"score": 0.00320338467974835, "phrase": "natural_idea"}, {"score": 0.002914288956035066, "phrase": "smallest_amount"}, {"score": 0.0028800314406625996, "phrase": "additional_information"}, {"score": 0.0028293966058473476, "phrase": "shannon's_sense"}, {"score": 0.0027469703311742647, "phrase": "full_information"}, {"score": 0.002426137929553724, "phrase": "practical_situations"}, {"score": 0.0023139986108451967, "phrase": "interval_bounds"}, {"score": 0.002142696637011647, "phrase": "higher_confidence"}, {"score": 0.0021049977753042253, "phrase": "moments_approach"}], "paper_keywords": ["Intervals", " Moments", " Information"], "paper_abstract": "In many practical situations, we do not have enough observations to uniquely determine the corresponding probability distribution, we only have enough observations to estimate two parameters of this distribution. In such cases, the traditional statistical approach is to estimate the mean and the standard deviation. Alternatively, we can estimate the two bounds that form the range of the corresponding variable and thus, generate an interval. Which of these two approaches should we select? A natural idea is to select the most informative approach, i.e., an approach in which we need the smallest amount of additional information (in Shannon's sense) to obtain the full information about the situation. In this paper, we follow this idea and come up with the following conclusion: in practical situations in which a 95 % confidence level is sufficient, interval bounds are more informative; however, in situations in which we need higher confidence, the moments approach is more informative.", "paper_title": "Interval or moments: which carry more information?", "paper_id": "WOS:000321644600002"}