{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "formal_model"}, {"score": 0.0429016280566267, "phrase": "virtual_lanes"}, {"score": 0.004724365740062236, "phrase": "infiniband_arbitration_tables"}, {"score": 0.004483909657713567, "phrase": "industry-standard_architecture"}, {"score": 0.004155742403177802, "phrase": "service_levels"}, {"score": 0.0038515000499988673, "phrase": "previous_papers"}, {"score": 0.003245891860973439, "phrase": "qos"}, {"score": 0.0028006988338192375, "phrase": "iba_arbitration_tables"}, {"score": 0.002657890175649468, "phrase": "mean_bandwidth"}, {"score": 0.0023936956017015696, "phrase": "maximum_separation"}, {"score": 0.002359759876402679, "phrase": "consecutive_pair"}, {"score": 0.0021049977753042253, "phrase": "good_behavior"}], "paper_keywords": ["InfiniBand", " QoS", " scheduling", " formal model"], "paper_abstract": "The InfiniBand Architecture (IBA) is an industry-standard architecture for server I/O and interprocessor communication. IBA enables quality-of-service (QoS) support with certain mechanisms. These mechanisms are basically the service levels, the virtual lanes, and the table-based arbitration of those virtual lanes. In previous papers, we have examined these mechanisms and described how we can apply them to the requirements requested by the applications. We have also tested our proposals, showing that the applications achieve the level of QoS requested. In this paper, we present a formal model for the techniques previously proposed. According to this model, each application needs a sequence of entries in the IBA arbitration tables based on its requirements. These requirements are related to the mean bandwidth needed and the maximum latency tolerated by the application. Specifically, each request requires a number of entries with a maximum separation between any consecutive pair. In order to manage the requests, we propose certain algorithms and we prove some propositions and theorems, showing that our method achieves good behavior.", "paper_title": "A formal model to manage the InfiniBand arbitration tables providing QoS", "paper_id": "WOS:000248083100002"}