{"auto_keywords": [{"score": 0.04890702046127256, "phrase": "interactivity"}, {"score": 0.00481495049065317, "phrase": "advergames"}, {"score": 0.004488384083300084, "phrase": "online_advertising_campaigns"}, {"score": 0.004253618550301311, "phrase": "unique_advertising_strategy"}, {"score": 0.003820144626025562, "phrase": "multiple_dependent_variables"}, {"score": 0.0034024277222012597, "phrase": "human-computer_interaction_research"}, {"score": 0.0032916702592724217, "phrase": "two-way_interaction_effects"}, {"score": 0.0029805015010906013, "phrase": "positive_mediating_relationship"}, {"score": 0.00255727386763536, "phrase": "high_fit_condition"}, {"score": 0.002363806685815014, "phrase": "low_interactivity_condition"}, {"score": 0.002344311033783139, "phrase": "low_expectancy"}, {"score": 0.0022214412809055013, "phrase": "significant_positive_effects"}, {"score": 0.0021049977753042253, "phrase": "purchase_intention"}], "paper_keywords": ["Advergame", " Interactivity", " Fit", " Expectancy", " Attitude toward Advergame", " Attitude toward Brand", " Purchase Intention", " Engagement Theory", " Transportation Theory"], "paper_abstract": "Advergames are increasingly popular for online advertising campaigns. However, few IS studies have investigated the effectiveness of this unique advertising strategy. This study sheds light on the effectiveness of advergames by studying three design factors of advergame: interactivity, fit, and expectancy. We use multiple dependent variables (e. g., attitude toward advergames, attitude toward brand, and purchase intention) to evaluate the effectiveness of advergames. Based on work from human-computer interaction research and the transportation theory, we propose two-way interaction effects of interactivity, fit, and expectancy on attitudes toward advergame, and also their main effects on attitude toward brand. A positive mediating relationship from attitude toward advergame to attitude toward brand, and to purchase intention is also hypothesized. We conducted a 2*2*2 factorial design experiment in an online 3D virtual world environment to test our hypotheses. The results show that, in the high fit condition, both high interactivity and low expectancy lead to a more favorable attitude toward advergames. However, in the low interactivity condition, low expectancy generates a more positive attitude toward advergames. Interactivity and attitude toward advergames have significant positive effects on attitude toward brand, which, in turn, positively impacts purchase intention.", "paper_title": "Engaging Consumers with Advergames: An Experimental Evaluation of Interactivity, Fit and Expectancy", "paper_id": "WOS:000339386400002"}