{"auto_keywords": [{"score": 0.04900275767994014, "phrase": "knowledge_management"}, {"score": 0.047948928662235685, "phrase": "product_design"}, {"score": 0.00481495049065317, "phrase": "ontology-based_information_systems"}, {"score": 0.004653485665080485, "phrase": "engineering_applications"}, {"score": 0.004281125387210667, "phrase": "wide_variety"}, {"score": 0.003245520963944678, "phrase": "error_avalanche"}, {"score": 0.0031010029460927834, "phrase": "significant_impact"}, {"score": 0.002974171397771052, "phrase": "knowledge_management_environment"}, {"score": 0.002830931833230673, "phrase": "possible_solutions"}, {"score": 0.002788257824525862, "phrase": "ontology-based_utilisation"}, {"score": 0.002623881637290192, "phrase": "error_identification"}, {"score": 0.0026040262154057607, "phrase": "collection_methods"}, {"score": 0.0025260919226344305, "phrase": "error_taxonomy"}, {"score": 0.0025069746344846397, "phrase": "associated_causal_factors"}, {"score": 0.002459810433812049, "phrase": "error_ontology"}], "paper_keywords": ["ontology", " knowledge management", " error", " data integration", " root cause analysis (RCA)"], "paper_abstract": "Ontologies and ontology-based information systems are becoming more commonplace in knowledge management. For engineering applications such as product design, ontologies can be utilised for knowledge capture/reuse and frameworks that allow for the integration and collaboration of a wide variety of tools and methods as well as participants in design(marketing/sales, engineers, customers, suppliers, distributors, manufacturing, etc.) who may be distributed globally across time, location, and culture. With this growth in the use of ontologies, it is critical to recognise and address errors that may occur in their representation, maintenance and utilisation. Passing undetected and unresolved errors downstream can cause error avalanche and could diminish the acceptance, further development and promise of significant impact that ontologies hold for product design, manufacturing, or any knowledge management environment within an organisation. This paper categorises errors and their causal factors, summarises possible solutions in ontology and ontology-based utilisation, and puts forward an ontology-based Root Cause Analysis (RCA) method to help find the root cause of errors. Error identification and collection methods are described first, followed by an error taxonomy with associated causal factors. Finally, an error ontology and associated SWRL (Semantic Web Rule Language) rules are built to facilitate the error taxonomy, the root cause analysis and solution analysis for these errors. Ultimately, this work should reduce errors in the development, maintenance and utilisation of ontologies and facilitate further development and use of ontologies in knowledge management.", "paper_title": "Reducing errors in the development, maintenance and utilisation of ontologies", "paper_id": "WOS:000276561900004"}