{"auto_keywords": [{"score": 0.05007567598103826, "phrase": "process_documentation"}, {"score": 0.04534561364306268, "phrase": "xml"}, {"score": 0.0046157179150380775, "phrase": "rss"}, {"score": 0.004424581416100279, "phrase": "ajax"}, {"score": 0.004373903661275154, "phrase": "javascript"}, {"score": 0.0040190868373730015, "phrase": "data_sources"}, {"score": 0.0039274105882136775, "phrase": "yahoo_pipes"}, {"score": 0.0036367690819960534, "phrase": "google"}, {"score": 0.002601727192945944, "phrase": "application's_past_process"}, {"score": 0.0025130941721410558, "phrase": "execution_time"}, {"score": 0.002427473263013356, "phrase": "generic_conceptual_data_model"}, {"score": 0.0023903596069939953, "phrase": "autonomous_creation"}, {"score": 0.0023538120430501392, "phrase": "dynamic_multi-institutional_applications"}, {"score": 0.0021049977753042253, "phrase": "complex_bioinformatics_mash-up"}], "paper_keywords": ["Design", " Documentation", " Standardization", " Process", " process documentation", " provenance", " data model", " concept maps", " mash-ups"], "paper_abstract": "Through technologies such as RSS (Really Simple Syndication), Web Services, and AJAX (Asynchronous JavaScript and XML), the Internet has facilitated the emergence of applications that are composed from a variety of services and data sources. Through tools such as Yahoo Pipes, these \"mash-ups\" can be composed in a dynamic, just-in-time manner from components provided by multiple institutions (i.e., Google, Amazon, your neighbor). However, when using these applications, it is not apparent where data comes from or how it is processed. Thus, to inspire trust and confidence in mash-ups, it is critical to be able to analyze their processes after the fact. These trailing analyses, in particular the determination of the provenance of a result (i.e., the process that led to it), are enabled by process documentation, which is documentation of an application's past process created by the components of that application at execution time. In this article, we define a generic conceptual data model that supports the autonomous creation of attributable, factual process documentation for dynamic multi-institutional applications. The data model is instantiated using two Internet formats, OWL and XML, and is evaluated with respect to questions about the provenance of results generated by a complex bioinformatics mash-up.", "paper_title": "A Model of Process Documentation to Determine Provenance in Mash-Ups", "paper_id": "WOS:000264443400003"}