{"auto_keywords": [{"score": 0.035851220431918907, "phrase": "ideal_observer"}, {"score": 0.03343200634823433, "phrase": "cio"}, {"score": 0.015719713042815758, "phrase": "linear_imaging_system"}, {"score": 0.015588518540211939, "phrase": "efficient_channels"}, {"score": 0.015393744858827494, "phrase": "bayesian_ideal_observer"}, {"score": 0.01351630490599814, "phrase": "ideal-observer_performance"}, {"score": 0.004518442937844318, "phrase": "diagnostic_performance"}, {"score": 0.004461359547152617, "phrase": "imaging_system"}, {"score": 0.004276216827737399, "phrase": "image_quality"}, {"score": 0.003995772867224968, "phrase": "probability_density_functions"}, {"score": 0.0036864465771943933, "phrase": "high_dimensionality"}, {"score": 0.0026701760128830573, "phrase": "singular_value_decomposition"}, {"score": 0.002526780881314497, "phrase": "detection_tasks"}, {"score": 0.002505412457777352, "phrase": "non-gaussian_lumpy_backgrounds"}, {"score": 0.002464132020929492, "phrase": "gaussian"}, {"score": 0.0024423826953133844, "phrase": "elliptical_profiles"}, {"score": 0.002391067964886602, "phrase": "singular_vectors"}, {"score": 0.0021319959284827896, "phrase": "channelized-hotelling_observer"}], "paper_keywords": ["Bayesian ideal observer", " efficient channels", " image quality", " linear imaging system"], "paper_abstract": "The Bayesian ideal observer provides an absolute upper bound for diagnostic performance of an imaging system and hence should be used for the assessment of image quality whenever possible. However, computation of ideal-observer performance in clinical tasks is difficult since the probability density functions of the data required for this observer are often unknown in tasks involving realistic, complex backgrounds. Moreover, the high dimensionality of the integrals that need to be calculated for the observer makes the computation more difficult. The ideal observer constrained to a set of channels, which we call a channelized-ideal observer (CIO), can reduce the dimensionality of the problem. These channels are called efficient if the CIO can approximate ideal-observer performance. In this paper, we propose a method to choose efficient channels for the ideal observer based on a singular value decomposition of a linear imaging system. As a demonstration, we test our method on detection tasks using non-Gaussian lumpy backgrounds and signals of Gaussian and elliptical profiles. Our simulation results show that singular vectors associated with either the background or the signal are highly efficient for the ideal observer for detecting both types of signals. In addition, this CIO outperforms a channelized-Hotelling observer with the same channels.", "paper_title": "Singular Vectors of a Linear Imaging System as Efficient Channels for the Bayesian Ideal Observer", "paper_id": "WOS:000265748400003"}