{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "cirquent_calculus"}, {"score": 0.004692227830462433, "phrase": "new_proof-theoretic"}, {"score": 0.004494570360108983, "phrase": "circuit-style_structures"}, {"score": 0.004231699728933577, "phrase": "tree-like_objects"}, {"score": 0.0040186038781533946, "phrase": "greater_efficiency"}, {"score": 0.0038492126993451337, "phrase": "detailed_elaboration"}, {"score": 0.003799796252156605, "phrase": "deep-inference_cirquent_logic"}, {"score": 0.0030109772626153797, "phrase": "new_framework"}, {"score": 0.0028839363228932704, "phrase": "expressive_power"}, {"score": 0.0028591768694918, "phrase": "linear_logic"}, {"score": 0.0027150087516999047, "phrase": "traditional_approaches"}, {"score": 0.0025780912201045555, "phrase": "polynomial_size_cut-"}, {"score": 0.0025014259919355453, "phrase": "cirquent_calculus_proofs"}, {"score": 0.002469269628821745, "phrase": "notoriously_hard_pigeonhole_principle"}, {"score": 0.0023855210798264205, "phrase": "main_purposes"}, {"score": 0.002304606411453748, "phrase": "introductory-style_starting_point"}, {"score": 0.0021416404045850224, "phrase": "new_line"}, {"score": 0.0021049977753042253, "phrase": "proof_theory"}], "paper_keywords": [""], "paper_abstract": "Cirquent calculus is a new proof-theoretic and semantic framework, whose main distinguishing feature is being based on circuit-style structures (called cirquents), as opposed to the more traditional approaches that deal with tree-like objects such as formulas, sequents or hypersequents. Among its advantages are greater efficiency, flexibility and expressiveness. This article presents a detailed elaboration of a deep-inference cirquent logic, which is naturally and inherently resource conscious. It shows that classical logic, both syntactically and semantically, can be seen to be just a special, conservative fragment of this more general and, in a sense, more basic logic-the logic of resources in the form of cirquent calculus. The reader will find various arguments in favour of switching to the new framework, such as arguments showing the insufficiency of the expressive power of linear logic or other formula-based approaches to developing resource logics, exponential improvements over the traditional approaches in both representational and proof complexities offered by cirquent calculus (including the existence of polynomial size cut-, substitution- and extension-free cirquent calculus proofs for the notoriously hard pigeonhole principle), and more. Among the main purposes of this article is to provide an introductory-style starting point for what, as the author wishes to hope, might have chances to become a new line of research in proof theory-a proof theory based on circuits instead of formulas.", "paper_title": "Cirquent Calculus Deepened", "paper_id": "WOS:000261298800008"}