{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "manufacturing_systems"}, {"score": 0.04964156968469261, "phrase": "information_entropy"}, {"score": 0.04218262960910763, "phrase": "system_complexity"}, {"score": 0.03709788182167048, "phrase": "proposed_framework"}, {"score": 0.023931155211420207, "phrase": "case_studies"}, {"score": 0.0047057084749407485, "phrase": "primary_objective"}, {"score": 0.0041001740903338834, "phrase": "analytical_model"}, {"score": 0.003809628721278519, "phrase": "probability_distribution"}, {"score": 0.0037402558657576124, "phrase": "resource_allocations"}, {"score": 0.0036218682585355895, "phrase": "process_plans"}, {"score": 0.0032886455096627324, "phrase": "interaction_matrix"}, {"score": 0.003140888248194296, "phrase": "waiting_times"}, {"score": 0.003097865379563127, "phrase": "proposed_complexity_model"}, {"score": 0.0030135741897058844, "phrase": "manufacturing_system"}, {"score": 0.002530359917257626, "phrase": "complicated_manufacturing_system"}, {"score": 0.0024842242921857705, "phrase": "previous_work"}, {"score": 0.0023400004981080818, "phrase": "resource_utilisations"}, {"score": 0.0021441057555396013, "phrase": "proposed_measure"}, {"score": 0.0021049977753042253, "phrase": "optimal_operating_policies"}], "paper_keywords": ["complexity", " information entropy", " resource interactions", " system performance"], "paper_abstract": "The primary objective of this paper is to develop a model that can quantitatively assess the complexity of manufacturing systems in various configurations including assembly and disassembly systems. In this paper, an analytical model for measuring the system complexity that employs information entropy is proposed and verified. The model uses probability distribution of information regarding resource allocations such as part processing times, part mix ratios and process plans or routings. In the proposed framework, both direct and indirect interactions among resources are first modelled using a matrix, referred to as interaction matrix in this paper, which accounts for part processing and waiting times. The proposed complexity model in this paper identifies a manufacturing system that has evenly distributed interactions among resources as being more complex, because in this case more information is required to identify source of the disruption. Then, the proposed framework is applied for the operation of a complicated manufacturing system taken from a previous work. Finally, relationships between the system complexity and performance in terms of resource utilisations and throughput of the system are studied through case studies. It is shown that the application of the proposed measure can result in optimal operating policies for the companies considered in the case studies.", "paper_title": "Interaction-based complexity measure of manufacturing systems using information entropy", "paper_id": "WOS:000271035300001"}