{"auto_keywords": [{"score": 0.049636680610423214, "phrase": "fss"}, {"score": 0.03713713197609568, "phrase": "data_sets"}, {"score": 0.00418892838079239, "phrase": "good_way"}, {"score": 0.00413096972023037, "phrase": "appropriate_fss_algorithms"}, {"score": 0.0039252049353279556, "phrase": "automatic_recommendation"}, {"score": 0.0036951530348821116, "phrase": "meta_learning_based_fss_algorithm_automatic_recommendation_method"}, {"score": 0.003336031521101184, "phrase": "k-nearest_neighbor_classification_algorithm"}, {"score": 0.003140401552000472, "phrase": "commonly-used_data_set_characteristics"}, {"score": 0.002956209594959227, "phrase": "similar_data_sets"}, {"score": 0.0028615323526689582, "phrase": "best_performance"}, {"score": 0.0028218877037665484, "phrase": "appropriate_ones"}, {"score": 0.002744234034162797, "phrase": "candidate_fss_algorithms"}, {"score": 0.0024543571925896073, "phrase": "feature_selection"}, {"score": 0.002397923568994474, "phrase": "selected_features"}, {"score": 0.0023646866829474798, "phrase": "proposed_recommendation_method"}, {"score": 0.0022052711621931144, "phrase": "different_fss_algorithms"}, {"score": 0.0021848422732893926, "phrase": "five_representative_classifiers"}], "paper_keywords": [""], "paper_abstract": "Many feature subset selection (FSS) algorithms have been proposed, but not all of them are appropriate for a given feature selection problem. At the same time, so far there is rarely a good way to choose appropriate FSS algorithms for the problem at hand. Thus, FSS algorithm automatic recommendation is very important and practically useful. In this paper, a meta learning based FSS algorithm automatic recommendation method is presented. The proposed method first identifies the data sets that are most similar to the one at hand by the k-nearest neighbor classification algorithm, and the distances among these data sets are calculated based on the commonly-used data set characteristics. Then, it ranks all the candidate FSS algorithms according to their performance on these similar data sets, and chooses the algorithms with best performance as the appropriate ones. The performance of the candidate FSS algorithms is evaluated by a multi-criteria metric that takes into account not only the classification accuracy over the selected features, but also the runtime of feature selection and the number of selected features. The proposed recommendation method is extensively tested on 115 real world data sets with 22 well-known and frequently-used different FSS algorithms for five representative classifiers. The results show the effectiveness of our proposed FSS algorithm recommendation method.", "paper_title": "A Feature Subset Selection Algorithm Automatic Recommendation Method", "paper_id": "WOS:000318964200001"}