{"auto_keywords": [{"score": 0.0039815737219022675, "phrase": "expected_levels"}, {"score": 0.003911771812701971, "phrase": "perceived_levels"}, {"score": 0.0036932254391253134, "phrase": "discrepancy_theory"}, {"score": 0.0033955105098235345, "phrase": "different_groups"}, {"score": 0.0032774280543222843, "phrase": "matched_sample"}, {"score": 0.0030942116765996426, "phrase": "performance_gap"}, {"score": 0.0028195727965553367, "phrase": "larger_gaps"}, {"score": 0.002733539375462443, "phrase": "poor_satisfaction"}, {"score": 0.0026036031415940563, "phrase": "different_set"}, {"score": 0.002425524064992056, "phrase": "different_stakeholders"}, {"score": 0.0023307492812556204, "phrase": "uniform_understanding"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["IS users", " IS personnel", " IS success", " job performance measures", " satisfaction", " discrepancy theory"], "paper_abstract": "Evaluation of IS professionals is difficult. Measures are seldom fully defined and suffer from the inability of a user to consider differences between expectations and perceptions of performance. In addition, expected levels of performance and perceived levels of performance depend on the satisfaction of each group of stakeholders. Discrepancy theory leads one to expect that satisfaction is highest when performance matches expectations. To explore this gap in different groups, a sample of users and a matched sample of IS professionals was investigated in order to determine the relationship between the performance gap and satisfaction with the system on the part of the users and careers on the part of the IS professionals. Larger gaps were found to be associated with poor satisfaction in both samples. Additionally, each group had a different set of expectations, indicating that the measures did not represent the same expectation or meanings to different stakeholders. Thus, management should strive to promote uniform understanding of the measures employed in IS professional performance-evaluation by all stakeholders and manage expectations according to the metrics selected. (c) 2007 Elsevier B.V. All rights reserved.", "paper_title": "Discrepancies between desired and perceived measures of performance of IS professionals: Views of the IS professionals themselves and the users", "paper_id": "WOS:000245067300007"}