{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "social_media"}, {"score": 0.0055791478378495905, "phrase": "patient-centered_care"}, {"score": 0.004401342842183475, "phrase": "information_technologies"}, {"score": 0.0038985392250620483, "phrase": "online_survey"}, {"score": 0.0038290829316346654, "phrase": "preliminary_review"}, {"score": 0.003563370084662192, "phrase": "nurses'_preferences"}, {"score": 0.0035156341294017685, "phrase": "six_different_types"}, {"score": 0.0032132782979796895, "phrase": "mostly_advanced_practice_nurses"}, {"score": 0.0026720866990543744, "phrase": "social_networking_sites"}, {"score": 0.0024864612830452254, "phrase": "social_question"}, {"score": 0.0021920373388760314, "phrase": "powerful_tool"}, {"score": 0.0021529183360603434, "phrase": "intended_audience"}], "paper_keywords": ["Advanced practice nurses", " Blogs", " Communication", " Health informatics", " Nurses", " Patient-centered care", " Podcasts", " SlideShare", " Social media", " Social networking sites", " Twitter"], "paper_abstract": "Social media are changing the ways people communicate and influencing their approaches to meeting their healthcare needs. The Institute of Medicine recommends utilization of information technologies to improve the delivery of patient-centered care. Little is known about how nurses have adopted the use of social media, however. The researchers conducted an online survey to provide a preliminary review of the characteristics of nurses who do and do not use social media. Also, nurses' preferences for using six different types of social media were analyzed and reported. Nurses from 43 states participated in this study, and the sample represented mostly advanced practice nurses who utilized the Internet regularly and confidently. About 94% of the participants indicated that they use social media, whereas fewer than 1% of the participants reported that they do not know how to use social media. Among those who use social media, social networking sites (90.33%) and podcasts (76.24%) were the most popular, followed by social question and asking sites (37.86%), blogs (31.85%), Twitter (19.06%), and SlideShare (9.92%). Social media can be a powerful tool to reach an intended audience quickly and globally. More research is needed to understand how nurses utilize social media to improve the delivery of patient-centered care.", "paper_title": "Characteristics of Nurses Who Use Social Media", "paper_id": "WOS:000333548800003"}