{"auto_keywords": [{"score": 0.02732782027082196, "phrase": "star"}, {"score": 0.015103995343964258, "phrase": "mobile_devices"}, {"score": 0.008685022301699994, "phrase": "contact_arrival_process"}, {"score": 0.00481495049065317, "phrase": "delay-tolerant_applications"}, {"score": 0.0039274105882136775, "phrase": "extremely_energy-consuming_process"}, {"score": 0.003837817436476726, "phrase": "energy-conscious_contact-probing_mechanisms"}, {"score": 0.0035673211706948576, "phrase": "frequent_contact"}, {"score": 0.0032526334220034326, "phrase": "contact-probing_frequency"}, {"score": 0.0031906408161077792, "phrase": "theoretical_analysis"}, {"score": 0.0030583717270715556, "phrase": "missed_contact"}, {"score": 0.0030232568024943455, "phrase": "contact-probing_interval"}, {"score": 0.002931569771634119, "phrase": "time-varying_contact_arrival_rates"}, {"score": 0.002875678729214611, "phrase": "optimization_framework"}, {"score": 0.0028317319086202217, "phrase": "optimal_contact-probing_interval"}, {"score": 0.0027670642397888494, "phrase": "arrival_rate"}, {"score": 0.0027247727563746694, "phrase": "real-world_contact_patterns"}, {"score": 0.002703869368554536, "phrase": "bluetooth_phone_contact-logging_experiments"}, {"score": 0.0024181413029825205, "phrase": "constant_probing_intervals"}, {"score": 0.00236289633510808, "phrase": "probing_interval"}, {"score": 0.0022474806085983536, "phrase": "day_information"}, {"score": 0.0021294699637639564, "phrase": "device_discovery"}, {"score": 0.0021049977753042253, "phrase": "constant_contact-probing_interval_scheme"}], "paper_keywords": ["Bluetooth", " delay-tolerant networking (DTN)", " energy efficiency"], "paper_abstract": "In many delay-tolerant applications, information is opportunistically exchanged between mobile devices that encounter each other. In order to affect such information exchange, mobile devices must have knowledge of other devices in their vicinity. We consider scenarios in which there is no infrastructure and devices must probe their environment to discover other devices. This can be an extremely energy-consuming process and highlights the need for energy-conscious contact-probing mechanisms. If devices probe very infrequently, they might miss many of their contacts. On the other hand, frequent contact probing might be energy inefficient. In this paper, we investigate the tradeoff between the probability of missing a contact and the contact-probing frequency. First, via theoretical analysis, we characterize the tradeoff between the probability of a missed contact and the contact-probing interval for stationary processes. Next, for time-varying contact arrival rates, we provide an optimization framework to compute the optimal contact-probing interval as a function of the arrival rate. We characterize real-world contact patterns via Bluetooth phone contact-logging experiments and show that the contact arrival process is self-similar. We design STAR, a contact-probing algorithm that adapts to the contact arrival process. Instead of using constant probing intervals, STAR dynamically chooses the probing interval using both the short-term contact history and the long-term history based on time of day information. Via trace-driven simulations on our experimental data, we demonstrate that STAR requires three to five times less energy for device discovery than a constant contact-probing interval scheme.", "paper_title": "Opportunistic Energy-Efficient Contact Probing in Delay-Tolerant Applications", "paper_id": "WOS:000270747600018"}