{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "freshwater_ecosystems"}, {"score": 0.00478218760286811, "phrase": "fluvial_habitats"}, {"score": 0.004637478829869904, "phrase": "flow_magnitude"}, {"score": 0.004375928080972614, "phrase": "flow_paths"}, {"score": 0.004331320910631647, "phrase": "bioclimatic_processes"}, {"score": 0.004301834610818624, "phrase": "human_activities"}, {"score": 0.0040591367766929344, "phrase": "multi-scale_processes"}, {"score": 0.0038171587399156268, "phrase": "australia"}, {"score": 0.00365114510725007, "phrase": "multiple_scales"}, {"score": 0.003577032245103867, "phrase": "multidimensional_environmental_space"}, {"score": 0.0035526625882388936, "phrase": "freshwater_biota"}, {"score": 0.003386645324034521, "phrase": "boosted_regression_tree_models"}, {"score": 0.0033406481167452436, "phrase": "analyse_relationships"}, {"score": 0.0029436264166293317, "phrase": "river_links"}, {"score": 0.0029135770621039926, "phrase": "training_area"}, {"score": 0.002767856819656175, "phrase": "adjacent_but_geographically_distinct_region"}, {"score": 0.0027395968397212053, "phrase": "modest_environmental_contrasts"}, {"score": 0.0027116246112603875, "phrase": "study_area"}, {"score": 0.0026565317818265394, "phrase": "distribution_models"}, {"score": 0.0025936662520897992, "phrase": "useful_predictive_ability"}, {"score": 0.0025759787655463212, "phrase": "discriminatory_power"}, {"score": 0.0022696277881969896, "phrase": "adjacent_region"}, {"score": 0.002246443296542436, "phrase": "gis_stream_database"}, {"score": 0.002215897810312801, "phrase": "immediate_applications"}, {"score": 0.002170854875902186, "phrase": "valuable_foundation"}, {"score": 0.0021049977753042253, "phrase": "australian_freshwater_environments"}], "paper_keywords": ["multi-scale", " ecologically meaningful attributes", " fish species distribution models", " boosted regression trees", " prediction", " transferability"], "paper_abstract": "Fluvial habitats are inherently variable. They are shaped by flow magnitude, frequency, timing and duration, by the effects of upstream and downstream features along flow paths and by bioclimatic processes and human activities in upstream contributing catchments. Managing freshwater ecosystems requires tools and data that effectively account for these multi-scale processes. We tackle these challenges in this analysis of the distribution of 17 native and alien fish species in south-eastern Australia. A fine-scale, stream-link-based GIS database comprising an extensive set of ecologically meaningful attributes at multiple scales was developed to characterise the multidimensional environmental space of freshwater biota. This article describes the methods and data required to construct such a database. Boosted regression tree models were employed to analyse relationships between species and 20 candidate environmental predictors. For some species, competitors/predators were also included as predictors. Models were evaluated from several viewpoints: the ecological plausibility and intuition arising from them, their ability to predict to river links within the training area and for 11 species for which data were sufficient, their ability to predict to an adjacent but geographically distinct region. Despite modest environmental contrasts in the study area, these data and species distribution models (SDMs) produced predictions with useful predictive ability and discriminatory power. Critically, predictors of distribution identified as important for the various species modelled were ecologically interpretable. Several - but not all - of the models tested for transferability also predicted distributions reasonably well in the adjacent region. The GIS stream database and SDMs have immediate applications, but also provide a valuable foundation for developing more sophisticated tools for management and conservation in Australian freshwater environments.", "paper_title": "Spatial data for modelling and management of freshwater ecosystems", "paper_id": "WOS:000311086500008"}