{"auto_keywords": [{"score": 0.03658441415893551, "phrase": "activation_function"}, {"score": 0.015719716506582538, "phrase": "geographical_objects"}, {"score": 0.015566631018521411, "phrase": "scale-induced_indeterminate_boundaries"}, {"score": 0.01533975002542286, "phrase": "neural_network-based_data_model"}, {"score": 0.004361276005140776, "phrase": "intimate_relation"}, {"score": 0.004109770306454165, "phrase": "explicit_consideration"}, {"score": 0.003577691211998842, "phrase": "neural_units"}, {"score": 0.0034047882921717913, "phrase": "processing_core"}, {"score": 0.0031609252620168446, "phrase": "complex_fuzzy_regions"}, {"score": 0.0024916260764216752, "phrase": "practical_implementation"}, {"score": 0.0023476849595393872, "phrase": "complex_overlay_operations"}, {"score": 0.0023245146355917626, "phrase": "fuzzy_maps"}, {"score": 0.002168586864007222, "phrase": "sub-pixel_maps"}, {"score": 0.0021049977753042253, "phrase": "remote_sensing_techniques"}], "paper_keywords": ["Fuzzy sets", " Artificial neural networks", " Indeterminate boundaries"], "paper_abstract": "The degree of uncertainty of many geographical objects has long been known to be in intimate relation with the scale of its observation and representation. Yet, the explicit consideration of scaling operations when modeling uncertainty is rarely found. In this study, a neural network-based data model was investigated for representing geographical objects with scale-induced indeterminate boundaries. Two types of neural units, combined with two types of activation function, comprise the processing core of the model, where the activation function can model either hard or soft transition zones. The construction of complex fuzzy regions, as well as lines and points, is discussed and illustrated with examples. It is shown how the level of detail that is apparent in the boundary at a given scale can be controlled through the degree of smoothness of each activation function. Several issues about the practical implementation of the model are discussed and indications on how to perform complex overlay operations of fuzzy maps provided. The model was illustrated through an example of representing multi-resolution, sub-pixel maps that are typically derived from remote sensing techniques.", "paper_title": "Representing geographical objects with scale-induced indeterminate boundaries: A neural network-based data model", "paper_id": "WOS:000265636000002"}