{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "identification_reliability_constraint"}, {"score": 0.035584999162206324, "phrase": "energy_efficiency"}, {"score": 0.004780183091824403, "phrase": "portable_reader"}, {"score": 0.004745665541429529, "phrase": "mobile_rfid_systems"}, {"score": 0.00456020621016909, "phrase": "battery-constrained_portable_reader"}, {"score": 0.004397875849247165, "phrase": "interrogation_zone"}, {"score": 0.003973320429450603, "phrase": "research_works"}, {"score": 0.003831801113154043, "phrase": "anti-collision_protocols"}, {"score": 0.00376293585033711, "phrase": "system_time_efficiency"}, {"score": 0.0034742854447532678, "phrase": "time_efficiency"}, {"score": 0.0032310733124059536, "phrase": "limited_battery_energy"}, {"score": 0.003172969962401266, "phrase": "tag_reading_process"}, {"score": 0.0030487828775502563, "phrase": "required_performance"}, {"score": 0.0028663222014133813, "phrase": "tag_identification"}, {"score": 0.002675252546913683, "phrase": "frame_length"}, {"score": 0.002598652897946253, "phrase": "different_tag-moving_scenarios"}, {"score": 0.002542642270762272, "phrase": "moving_velocity"}, {"score": 0.0025242409510332527, "phrase": "prescribed_identification_constraint"}, {"score": 0.0023388674614404324, "phrase": "extensive_simulation_results"}, {"score": 0.0022801453935251503, "phrase": "derived_numerical_results"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["RFID", " Energy saving", " System time efficiency", " Performance evaluation"], "paper_abstract": "A mobile radio frequency identification (RFID) system consists of passive moving tags and a battery-constrained portable reader. In such a mobile RFID system, massive tags continuously enter the interrogation zone of the reader, which must quickly and reliably identify all the tags before they leave its coverage area. To meet such performance requirement, in the literature, a plethora of research works has been done in the design and optimization of anti-collision protocols, to enhance the system time efficiency and reduce the tag reading time as much as possible. However, as illustrated in this paper, optimizing the time efficiency does not necessarily lead to maximizing the energy efficiency for the reader. In fact, to efficiently utilize the limited battery energy at the reader, tag reading process should be power-aware consuming just enough energy to achieve the required performance. In this paper, we study the tradeoff between the time and energy efficiencies for tag identification. Specifically, we establish the time and energy efficiency metrics for the system and analyze the impact of frame length on the two metrics. We also consider different tag-moving scenarios, with tag density, moving velocity, prescribed identification constraint, etc., taken into consideration. We then analytically derive the most energy-efficient frame length under different tag moving scenarios. Extensive simulation results indicate that, guided by the derived numerical results, we can achieve as much as 11% improvement in energy efficiency, while satisfying the identification reliability constraint at the same time. (C) 2015 Elsevier B.V. All rights reserved.", "paper_title": "Balancing time and energy efficiencies with identification reliability constraint for portable reader in mobile RFID systems", "paper_id": "WOS:000366785300004"}