{"auto_keywords": [{"score": 0.037215072668367835, "phrase": "qm_practices"}, {"score": 0.008427338670058546, "phrase": "moderating_effect"}, {"score": 0.00481495049065317, "phrase": "knowledge_capacities"}, {"score": 0.004777917315737992, "phrase": "purpose_-_the_purpose"}, {"score": 0.004614753841925369, "phrase": "tms"}, {"score": 0.004388796812234033, "phrase": "quality_management"}, {"score": 0.004141742095830515, "phrase": "simple_random_sampling"}, {"score": 0.0038634933357842302, "phrase": "multiple_linear_regression_analysis"}, {"score": 0.0036600192572132676, "phrase": "knowledge_transfer"}, {"score": 0.0034672240102960644, "phrase": "moderating_variable"}, {"score": 0.0033486631403337555, "phrase": "knowledge_absorption"}, {"score": 0.002993439939273828, "phrase": "single_country"}, {"score": 0.0028138046006772567, "phrase": "single_manager"}, {"score": 0.0026347074232350503, "phrase": "important_role"}, {"score": 0.0025249264547573943, "phrase": "internal_processes"}, {"score": 0.002373339527491525, "phrase": "non-business_management"}, {"score": 0.0021049977753042253, "phrase": "paper's_results"}], "paper_keywords": ["Universities", " Research and development", " Spain", " Transactive memory systems", " Quality management", " Knowledge transfer", " Knowledge absorption", " R&D groups"], "paper_abstract": "Purpose - The purpose of this paper is to study how transactive memory systems (TMS) facilitate the transfer and absorption of knowledge in the presence of quality management (QM) within a university research and development (R&D) environment. Design/methodology/approach - The data come from a simple random sampling of 257 Spanish university R&D groups in nine different areas of knowledge. To verify the hypotheses, the authors used multiple linear regression analysis with a moderating effect. Findings - The conclusions show that the relationship between knowledge transfer (KT) and TMS is significant when QM practices are included as a moderating variable but that this is not the case for knowledge absorption (KA), which does not show any effect. Research limitations/implications - The effects described were found in a sample composed of various R&D sectors taken from a single country and not distributed equally. Further, the perception analyzed represents the judgment of a single manager. Practical implications - It is interesting to study this interaction in university R&D because of the important role R&D plays in the development of regions. Improving the internal processes of this research helps to make its results more competitive. This study contributes information on non-business management and introduces university R&D to the use of QM practices. Originality/value - The authors found no studies that test empirically the moderating effect of QM practices on the relationships studied in university R&D. The paper's results contribute information to help fill this gap and demonstrate once again that QM practices can be applied to any environment.", "paper_title": "Transactive memory system and TQM: exploring knowledge capacities", "paper_id": "WOS:000317149800016"}