{"auto_keywords": [{"score": 0.0343649692424503, "phrase": "ost"}, {"score": 0.00481495049065317, "phrase": "optimal_stopping_time"}, {"score": 0.004768104290288521, "phrase": "automated_negotiations"}, {"score": 0.004721711709176679, "phrase": "electronic_markets"}, {"score": 0.004675768396728975, "phrase": "virtual_frameworks"}, {"score": 0.0037519679864796906, "phrase": "efficient_reasoning_mechanism"}, {"score": 0.0034524248924699985, "phrase": "buyer_side"}, {"score": 0.0033361232750221863, "phrase": "optimal_stopping_theory"}, {"score": 0.002783250284824728, "phrase": "proposed_decision_method"}, {"score": 0.0024383967028975616, "phrase": "zero_knowledge"}, {"score": 0.0024028135317872, "phrase": "players'_characteristics"}, {"score": 0.002321787726770895, "phrase": "complex_modeling"}, {"score": 0.002232519579957705, "phrase": "experimental_results"}, {"score": 0.002125735077004312, "phrase": "comparison_assessment"}], "paper_keywords": ["Computational intelligence", " intelligent systems", " optimal stopping theory (OST)"], "paper_abstract": "Electronic markets are virtual frameworks where entities not known in advance have the opportunity to interact for the trading of products or services. Usually, a negotiation is necessary for the conclusion of the transaction. The conclusion is either positive (agreement) or negative (conflict). An efficient reasoning mechanism is necessary for players participating in negotiations. In this paper, we focus on the buyer side and propose two decision models based on the optimal stopping theory (OST). OST is proved to be very efficient in cases where an entity tries to find the time to stop a process with the aim of maximizing her utility. The outcome of the proposed decision method indicates whether the buyer stops a negotiation either by accepting the offer or continuing in the negotiation by rejecting it. In our models, we assume zero knowledge on the players' characteristics. Our proposed decision models do not require any complex modeling or any information provided by experts. Experimental results reveal the efficiency of each model and provide a comparison assessment with other research efforts.", "paper_title": "Determining the Optimal Stopping Time for Automated Negotiations", "paper_id": "WOS:000342278400008"}