{"auto_keywords": [{"score": 0.024069758958285906, "phrase": "basic_and_super-solutions"}, {"score": 0.004814962647930226, "phrase": "super-solutions"}, {"score": 0.004703671193348433, "phrase": "abductive_annotated_probabilistic_temporal_logic"}, {"score": 0.004250302819248558, "phrase": "formula_g"}, {"score": 0.004217286731331736, "phrase": "true_delta_t_time_units"}, {"score": 0.003916098498242888, "phrase": "abductive_reasoning"}, {"score": 0.003885668358145471, "phrase": "apt_logic"}, {"score": 0.0038255128976509545, "phrase": "apt_logic_program"}, {"score": 0.003608940466752178, "phrase": "pi"}, {"score": 0.0034296217420566304, "phrase": "subset_s"}, {"score": 0.0033633514001658086, "phrase": "pi_boolean_or_s"}, {"score": 0.0032855095476183372, "phrase": "goal_g"}, {"score": 0.0029916929549256297, "phrase": "unimportant_temporal_aspects"}, {"score": 0.0029338597685088603, "phrase": "compact_representation"}, {"score": 0.0024610448251906453, "phrase": "geometric_characterization"}, {"score": 0.00234834406550549, "phrase": "interesting_properties"}, {"score": 0.002206045784326466, "phrase": "correct_sequential_algorithms"}, {"score": 0.0021049977753042253, "phrase": "parallel_algorithms"}], "paper_keywords": ["Algorithms", " Languages", " Probabilistic and temporal reasoning", " abductive reasoning", " imprecise probabilities"], "paper_abstract": "Annotated Probabilistic Temporal (APT) logic programs are a form of logic programs that allow users to state (or systems to automatically learn) rules of the form \"formula G becomes true Delta t time units after formula F became true with l to u% probability\" In this article, we deal with abductive reasoning in APT logic: given an APT logic program Pi, a set of formulas H that can be \"added\" to Pi, and a (temporal) goal g, is there a subset S of H such that Pi boolean OR S is consistent and entails the goal g? In general, there are many different solutions to the problem and some of them can be highly repetitive, differing only in some unimportant temporal aspects. We propose a compact representation called super-solutions that succinctly represent sets of such solutions. Super-solutions are compact, but lossless representations of sets of such solutions. We study the complexity of existence of basic, super-, and maximal super-solutions as well as check if a set is a solution/super-solution/maximal super-solution. We then leverage a geometric characterization of the problem to suggest a set of pruning strategies and interesting properties that can be leveraged to make the search of basic and super-solutions more efficient. We propose correct sequential algorithms to find solutions and super-solutions. In addition, we develop parallel algorithms to find basic and super-solutions.", "paper_title": "Super-Solutions: Succinctly Representing Solutions in Abductive Annotated Probabilistic Temporal Logic", "paper_id": "WOS:000343693300001"}