{"auto_keywords": [{"score": 0.02322730111336097, "phrase": "image_segmentation"}, {"score": 0.02061693776175194, "phrase": "image_intensities"}, {"score": 0.018532599559567185, "phrase": "intensity_inhomogeneities"}, {"score": 0.008927464879038382, "phrase": "intensity_inhomogeneity"}, {"score": 0.007732206794656993, "phrase": "local_clustering_criterion_function"}, {"score": 0.006459146200274285, "phrase": "bias_field"}, {"score": 0.00465964893087681, "phrase": "mri._intensity_inhomogeneity"}, {"score": 0.004598933498016774, "phrase": "real-world_images"}, {"score": 0.004524145463916772, "phrase": "considerable_challenge"}, {"score": 0.0041001740903338834, "phrase": "accurate_segmentation_results"}, {"score": 0.003967835031625103, "phrase": "novel_region-based_method"}, {"score": 0.0035958088793442817, "phrase": "local_intensity_clustering_property"}, {"score": 0.0032800186243040663, "phrase": "neighborhood_center"}, {"score": 0.003237221368901582, "phrase": "global_criterion"}, {"score": 0.0029528295737527026, "phrase": "image_domain"}, {"score": 0.0026321198895843173, "phrase": "estimated_bias_field"}, {"score": 0.0025892330566358503, "phrase": "intensity_inhomogeneity_correction"}, {"score": 0.0025638362414466278, "phrase": "bias_correction"}, {"score": 0.002497319603143104, "phrase": "synthetic_images"}, {"score": 0.002480961181275199, "phrase": "real_images"}, {"score": 0.0024405312482831646, "phrase": "desirable_performance"}, {"score": 0.0022628564592874147, "phrase": "well-known_piecewise_smooth_model"}, {"score": 0.002146926767291475, "phrase": "magnetic_resonance"}, {"score": 0.0021049977753042253, "phrase": "promising_results"}], "paper_keywords": ["Bias correction", " image segmentation", " intensity inhomogeneity", " level set", " MRI"], "paper_abstract": "Intensity inhomogeneity often occurs in real-world images, which presents a considerable challenge in image segmentation. The most widely used image segmentation algorithms are region-based and typically rely on the homogeneity of the image intensities in the regions of interest, which often fail to provide accurate segmentation results due to the intensity inhomogeneity. This paper proposes a novel region-based method for image segmentation, which is able to deal with intensity inhomogeneities in the segmentation. First, based on the model of images with intensity inhomogeneities, we derive a local intensity clustering property of the image intensities, and define a local clustering criterion function for the image intensities in a neighborhood of each point. This local clustering criterion function is then integrated with respect to the neighborhood center to give a global criterion of image segmentation. In a level set formulation, this criterion defines an energy in terms of the level set functions that represent a partition of the image domain and a bias field that accounts for the intensity inhomogeneity of the image. Therefore, by minimizing this energy, our method is able to simultaneously segment the image and estimate the bias field, and the estimated bias field can be used for intensity inhomogeneity correction (or bias correction). Our method has been validated on synthetic images and real images of various modalities, with desirable performance in the presence of intensity inhomogeneities. Experiments show that our method is more robust to initialization, faster and more accurate than the well-known piecewise smooth model. As an application, our method has been used for segmentation and bias correction of magnetic resonance (MR) images with promising results.", "paper_title": "A Level Set Method for Image Segmentation in the Presence of Intensity Inhomogeneities With Application to MRI", "paper_id": "WOS:000291823600019"}