{"auto_keywords": [{"score": 0.03424015590946236, "phrase": "rooted_subgraphs"}, {"score": 0.012164000367207451, "phrase": "structural_statistics"}, {"score": 0.008517380415841066, "phrase": "general_keywords"}, {"score": 0.00481495049065317, "phrase": "computing_structural_statistics"}, {"score": 0.004751737738080424, "phrase": "databases"}, {"score": 0.004720043307726269, "phrase": "keyword_search"}, {"score": 0.004550856732700044, "phrase": "existing_studies"}, {"score": 0.004065156038847781, "phrase": "valuable_information"}, {"score": 0.004024863549087511, "phrase": "individual_interconnected_tuple-structures"}, {"score": 0.003893406207928709, "phrase": "similar_mechanism"}, {"score": 0.003829290275367182, "phrase": "interconnected_tuple-structures"}, {"score": 0.003547642961654828, "phrase": "large_directed_graph"}, {"score": 0.0031898025329389376, "phrase": "interconnected_tuple-structure"}, {"score": 0.002994602527726632, "phrase": "dimensional_keywords"}, {"score": 0.0029648894235196886, "phrase": "data_driven_fashion"}, {"score": 0.0026656724016739905, "phrase": "user-given_score_function"}, {"score": 0.0024125742420201, "phrase": "sql_aggregate_function"}, {"score": 0.0022951636331743066, "phrase": "real_data_set"}, {"score": 0.0022648286660146314, "phrase": "new_approaches"}, {"score": 0.0022053535889915914, "phrase": "extensive_performance_studies"}, {"score": 0.002168975681697056, "phrase": "large_synthetic_data_set"}], "paper_keywords": ["Keyword search", " relational database", " structural statistics"], "paper_abstract": "Keyword search in RDBs has been extensively studied in recent years. The existing studies focused on finding all or top-k interconnected tuple-structures that contain keywords. In reality, the number of such interconnected tuple-structures for a keyword query can be large. It becomes very difficult for users to obtain any valuable information more than individual interconnected tuple-structures. Also, it becomes challenging to provide a similar mechanism like group-&-aggregate for those interconnected tuple-structures. In this paper, we study computing structural statistics keyword queries by extending the group-&-aggregate framework. We consider an RDB as a large directed graph where nodes represent tuples, and edges represent the links among tuples. Instead of using tuples as a member in a group, we consider rooted subgraphs. Such a rooted subgraph represents an interconnected tuple-structure among tuples and some of the tuples contain keywords. The dimensions of the rooted subgraphs are determined by dimensional keywords in a data driven fashion. Two rooted subgraphs are grouped into the same group if they are isomorphic based on the dimensions or in other words the dimensional keywords. The scores of the rooted subgraphs are computed by a user-given score function if the rooted subgraphs contain some of general keywords. Here, the general keywords are used to compute scores rather than determining dimensions. The aggregates are computed using an SQL aggregate function for every group based on the scores computed. We give our motivation using a real data set. We propose new approaches to compute structural statistics keyword queries, perform extensive performance studies using two large real data sets and a large synthetic data set, and confirm the effectiveness and efficiency of our approach.", "paper_title": "Computing Structural Statistics by Keywords in Databases", "paper_id": "WOS:000307545200002"}