{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "perceived_fidelity"}, {"score": 0.0047709540557306284, "phrase": "illuminated_dynamic_scenes"}, {"score": 0.0047057084749407485, "phrase": "realistic_illumination_effects"}, {"score": 0.004662705558154439, "phrase": "complex_animated_scenes"}, {"score": 0.004234129588974058, "phrase": "overall_perceived_realism"}, {"score": 0.0038271712887391015, "phrase": "dynamic_aggregates"}, {"score": 0.0034433297275344877, "phrase": "popular_spherical_harmonics_lighting_method"}, {"score": 0.003349670229755675, "phrase": "realistic_lighting"}, {"score": 0.003213920601037463, "phrase": "psychophysical_experiments"}, {"score": 0.003140888248194296, "phrase": "simple_approach"}, {"score": 0.003097865379563127, "phrase": "global_illumination"}, {"score": 0.0030135741897058844, "phrase": "temporal_domain"}, {"score": 0.002931569771634119, "phrase": "dynamic_scenes"}, {"score": 0.0027614468443073028, "phrase": "temporal_properties"}, {"score": 0.002723607240517261, "phrase": "crowd_entities"}, {"score": 0.002194011800331242, "phrase": "indirect_illumination"}, {"score": 0.0021049977753042253, "phrase": "greater_than_three-fold_rendering_speed-up"}], "paper_keywords": [""], "paper_abstract": "Rendering realistic illumination effects for complex animated scenes with many dynamic objects or characters is computationally expensive. Yet, it is not obvious how important such accurate lighting is for the overall perceived realism in these scenes. In this paper, we present a methodology to evaluate the perceived fidelity of illumination in scenes with dynamic aggregates, such as crowds, and explore several factors which may affect this perception. We focus in particular on evaluating how a popular spherical harmonics lighting method can be used to approximate realistic lighting of crowds. We conduct a series of psychophysical experiments to explore how a simple approach to approximating global illumination, using interpolation in the temporal domain, affects the perceived fidelity of dynamic scenes with high geometric, motion, and illumination complexity. We show that the complexity of the geometry and temporal properties of the crowd entities, the motion of the aggregate as a whole, the type of interpolation (i.e., of the direct and/or indirect illumination coefficients), and the presence or absence of colour all affect perceived fidelity. We show that high (i.e., above 75%) levels of perceived scene fidelity can be maintained while interpolating indirect illumination for intervals of up to 30 frames, resulting in a greater than three-fold rendering speed-up.", "paper_title": "Crowd Light: Evaluating the Perceived Fidelity of Illuminated Dynamic Scenes", "paper_id": "WOS:000306181700005"}