{"auto_keywords": [{"score": 0.04959024199151092, "phrase": "computer_mediation"}, {"score": 0.00481495049065317, "phrase": "remote_outcomes"}, {"score": 0.003941319912895672, "phrase": "remote_events"}, {"score": 0.003802135020791801, "phrase": "present_study"}, {"score": 0.003724810609448597, "phrase": "collocated_outcomes"}, {"score": 0.003361069456060196, "phrase": "wagering_behaviour"}, {"score": 0.0033096502887394233, "phrase": "simulated_game"}, {"score": 0.0032256881625734777, "phrase": "preferred_outcome_format"}, {"score": 0.002836679611901583, "phrase": "collocated_version"}, {"score": 0.0027505037762786087, "phrase": "greater_risks"}, {"score": 0.0027223626424366207, "phrase": "pre-recorded_video_outcomes"}, {"score": 0.002585906251354904, "phrase": "videolinked_outcomes"}, {"score": 0.002262209824105154, "phrase": "potential_predictability"}, {"score": 0.0021377414429251647, "phrase": "reduced_presence"}, {"score": 0.0021049977753042253, "phrase": "real-time_videolinks"}], "paper_keywords": ["presence", " decision-making", " videorecording", " videolink", " risk"], "paper_abstract": "Computer mediation of communication allows interaction with events remote in space or time. However, the uptake and use of videotechnology requires an understanding of its effects upon willingness to take risks. To understand how responses to remote events are influenced by computer mediation, the present study compared responses to collocated outcomes with those conveyed over a videolink or as pre-recordings. Willingness to risk on an outcome was quantified using wagering behaviour during a simulated game of roulette: measuring preferred outcome format, levels of risk sought, and times required to make decisions. Participants tended to be more confident of winning and preferred the collocated version of roulette. Participants took greater risks with pre-recorded video outcomes and tended to spend more time locating bets. For videolinked outcomes, participants were more cautious, hedging their bets, and taking more time deliberating the odds. Although the amounts wagered did not change, a potential predictability in pre-recordings appears to encourage risk taking, while the reduced presence inherent in real-time videolinks engenders caution.", "paper_title": "Behavioural responses to risk on remote outcomes", "paper_id": "WOS:000348571000003"}