{"auto_keywords": [{"score": 0.042143904057605854, "phrase": "initial_population_policy"}, {"score": 0.04115970230529494, "phrase": "mutation_policy"}, {"score": 0.0283446378522564, "phrase": "genetic_algorithm"}, {"score": 0.00481495049065317, "phrase": "qos-aware_web_services_selection"}, {"score": 0.004698229304089357, "phrase": "novel_genetic_algorithm"}, {"score": 0.0045843245695654875, "phrase": "improved_fitness_value"}, {"score": 0.004189698902282913, "phrase": "special_relation_matrix_coding_scheme"}, {"score": 0.0036453427552753533, "phrase": "qos-aware_web_service_composition"}, {"score": 0.003304097742490624, "phrase": "proposed_genetic_algorithm"}, {"score": 0.0031975786158658158, "phrase": "composite_service_plan"}, {"score": 0.0030944828434567966, "phrase": "qos_requirement"}, {"score": 0.002583931950389087, "phrase": "qos-aware_web_services_selection_show"}, {"score": 0.0021049977753042253, "phrase": "important_role"}], "paper_keywords": [""], "paper_abstract": "A novel genetic algorithm characterized by improved fitness value is presented for Quality of Service (QoS)-aware web services selection. The genetic algorithm includes a special relation matrix coding scheme of chromosomes, an initial population policy and a mutation policy. The relation matrix coding scheme suits with QoS-aware web service composition more than the one dimension coding scheme. By running only once, the proposed genetic algorithm can construct the composite service plan according with the QoS requirement from many services compositions. Meanwhile, the adoption of the initial population policy and the mutation policy promotes the fitness of genetic algorithm. Experiments on QoS-aware web services selection show that the genetic algorithm with this matrix can get more excellent composite service plan than the genetic algorithm with the one dimension coding scheme, and that the two policies play an important role at the improvement of the fitness of genetic algorithm.", "paper_title": "A novel genetic algorithm for QoS-Aware web services selection", "paper_id": "WOS:000239482400018"}