{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "development_structure"}, {"score": 0.004765788394931875, "phrase": "open_source_communities"}, {"score": 0.004300830853119242, "phrase": "broader_community_development_effort"}, {"score": 0.004235095881928715, "phrase": "committers'_central_role"}, {"score": 0.004002513373645485, "phrase": "organized_influences"}, {"score": 0.003961613484271729, "phrase": "community_performance"}, {"score": 0.003782655283668953, "phrase": "organizational_information_processing_theory"}, {"score": 0.003292685392413911, "phrase": "centralized_and_decentralized_floss_communities"}, {"score": 0.0029255474957478474, "phrase": "floss_communities"}, {"score": 0.002895620643297197, "phrase": "development_tasks"}, {"score": 0.0026532596852754525, "phrase": "centralized_committal_structure"}, {"score": 0.0025726416100664853, "phrase": "decentralized_committal_structures"}, {"score": 0.0021709933368474223, "phrase": "future_research"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v._all_rights"}], "paper_keywords": ["Free/Libre and Open Source Software", " FLOSS", " Organizational Information Processing Theory", " Software development", " Modularity", " Brooks law"], "paper_abstract": "Committers in Free/Libre and Open Source Software (FLOSS) projects shoulder responsibility for evaluating contributions and coordinating the broader community development effort. Given committers' central role in development processes, we examine whether how they are organized influences FLOSS community performance. Specifically, drawing on the lens of Organizational Information Processing Theory (OIPT), we develop a model that explains how committal a structure's ability to manage information impacts FLOSS community performance. Based on archival data drawn from 237 active FLOSS communities, we found that the performance of centralized and decentralized FLOSS communities varied with three conditions tied to information flows: task routineness, uncertainty and task interdependence. Our empirical results support the idea that FLOSS communities performing development tasks that are generally routine, highly interdependent, and generate little contributor uncertainty will perform better under a centralized committal structure. On the other hand, decentralized committal structures thrive under the conditions of task non-routineness, low task interdependence, and high contributor uncertainty. We conclude with a discussion of results, limitations, and directions for future research. (C) 2015 Elsevier B.V. All rights reserved.", "paper_title": "Taxing the development structure of open source communities: An information processing view", "paper_id": "WOS:000367026200003"}