{"auto_keywords": [{"score": 0.043872448576416874, "phrase": "gene_lists"}, {"score": 0.043178963872846685, "phrase": "different_datasets"}, {"score": 0.015719716506582538, "phrase": "group_testing"}, {"score": 0.009439225122816192, "phrase": "different_methods"}, {"score": 0.008643721618323727, "phrase": "fisher's_exact_test"}, {"score": 0.00847876763312109, "phrase": "global_test"}, {"score": 0.004788416208637939, "phrase": "pathway_analysis"}, {"score": 0.00473578343131372, "phrase": "different_microarray_datasets"}, {"score": 0.004670801446279132, "phrase": "wide_use"}, {"score": 0.004645057834614705, "phrase": "dna_microarrays"}, {"score": 0.004568671314041992, "phrase": "cell_transcriptome"}, {"score": 0.004505971974071316, "phrase": "numerous_methods"}, {"score": 0.004444129263082239, "phrase": "microarray_data"}, {"score": 0.004383131582126381, "phrase": "growing_number"}, {"score": 0.004358966549393109, "phrase": "microarray_studies"}, {"score": 0.004158847144705244, "phrase": "different_statistical_methods"}, {"score": 0.003978866233891427, "phrase": "apparently_affected_biologically_related_groups"}, {"score": 0.0038171874077517274, "phrase": "group_testing_procedures"}, {"score": 0.0036925962886604634, "phrase": "fcs"}, {"score": 0.0033148877626424295, "phrase": "mixed_model_normalization"}, {"score": 0.0032512939985881784, "phrase": "statistical_analysis"}, {"score": 0.003188916332246111, "phrase": "vsn-normalized_data"}, {"score": 0.003171314262220951, "phrase": "mixed_model_analysis"}, {"score": 0.0031190870482768283, "phrase": "mmn."}, {"score": 0.0031018692201038004, "phrase": "multiple_testing_adjustment"}, {"score": 0.0030847461428168614, "phrase": "false_discovery_rate"}, {"score": 0.002746155563830053, "phrase": "six_gene_lists"}, {"score": 0.002598212233626538, "phrase": "gsea"}, {"score": 0.0023386685733717038, "phrase": "group_testing_methods"}, {"score": 0.0022434880661725493, "phrase": "prostate_cancer"}, {"score": 0.0021225662995668446, "phrase": "single_analysis"}, {"score": 0.0021049977753042253, "phrase": "single_dataset"}], "paper_keywords": [""], "paper_abstract": "Motivation: The wide use of DNA microarrays for the investigation of the cell transcriptome triggered the invention of numerous methods for the processing of microarray data and lead to a growing number of microarray studies that examine the same biological conditions. However, comparisons made on the level of gene lists obtained by different statistical methods or from different datasets hardly converge. We aimed at examining such discrepancies on the level of apparently affected biologically related groups of genes, e.g. metabolic or signalling pathways. This can be achieved by group testing procedures, e.g. over-representation analysis, functional class scoring (FCS), or global tests. Results: Three public prostate cancer datasets obtained with the same microarray platform (HGU95A/HGU95Av2) were analyzed. Each dataset was subjected to normalization by either variance stabilizing normalization (vsn) or mixed model normalization (MMN). Then, statistical analysis of microarrays was applied to the vsn-normalized data and mixed model analysis to the data normalized by MMN. For multiple testing adjustment the false discovery rate was calculated and the threshold was set to 0.05. Gene lists from the same method applied to different datasets showed overlaps between 42 and 52%, while lists from different methods applied to the same dataset had between 63 and 85% of genes in common. A number of six gene lists obtained by the two statistical methods applied to the three datasets was then subjected to group testing by Fisher's exact test. Group testing by GSEA and global test was applied to the three datasets, as well. Fisher's exact test followed by global test showed more consistent results with respect to the concordance between analyses on gene lists obtained by different methods and different datasets than the GSEA. However, all group testing methods identified pathways that had already been described to be involved in the pathogenesis of prostate cancer. Moreover, pathways recurrently identified in these analyses are more likely to be reliable than those from a single analysis on a single dataset.", "paper_title": "Group testing for pathway analysis improves comparability of different microarray datasets", "paper_id": "WOS:000241271300009"}