{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "graphical_overviews"}, {"score": 0.040479390128548495, "phrase": "hypertext_overviews"}, {"score": 0.0037721073763702486, "phrase": "reader's_comprehension"}, {"score": 0.0036892809673917592, "phrase": "present_paper"}, {"score": 0.0030376623293574905, "phrase": "graphical_overview"}, {"score": 0.002810373366887749, "phrase": "participant's_comprehension"}, {"score": 0.002779318608820933, "phrase": "quite_difficult_hypertexts"}, {"score": 0.0025008468316682036, "phrase": "student's_comprehension"}, {"score": 0.002473203873496859, "phrase": "easier_hypertexts"}, {"score": 0.0023394947463129642, "phrase": "assimilation_theory"}, {"score": 0.00230080652063411, "phrase": "active_processing_model"}, {"score": 0.0022377394845878268, "phrase": "key_educational_and_hypertext_design_implications"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Hypertext comprehension", " Graphical overviews", " Eye movements"], "paper_abstract": "Educational hypertexts usually include graphical overviews, conveying the structure of the text schematically with the aim of fostering comprehension. Despite the claims about their relevance, there is currently no consensus on the impact that hypertext overviews have on the reader's comprehension. In the present paper we have explored how hypertext overviews might affect comprehension with regard to (a) the time at which students read the overview and (b) the hypertext difficulty. The results from two eye-tracking studies revealed that reading a graphical overview at the beginning of the hypertext is related to an improvement in the participant's comprehension of quite difficult hypertexts, whereas reading an overview at the end of the hypertext is linked to a decrease in the student's comprehension of easier hypertexts. These findings are interpreted in light of the Assimilation Theory and the Active Processing model. Finally, the key educational and hypertext design implications of the results are discussed. (C) 2009 Elsevier Ltd. All rights reserved.", "paper_title": "Do graphical overviews facilitate or hinder comprehension in hypertext?", "paper_id": "WOS:000271297200029"}