{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "slope_chain_code"}, {"score": 0.004463096299091981, "phrase": "chain_code"}, {"score": 0.004333292535499539, "phrase": "scc"}, {"score": 0.004084829853870028, "phrase": "element_strings"}, {"score": 0.003144426503333397, "phrase": "unique_start_vertex"}, {"score": 0.0030657684627749364, "phrase": "unique_path"}, {"score": 0.002889778121878728, "phrase": "mirror_image"}, {"score": 0.002524428047147766, "phrase": "different_fields"}, {"score": 0.0023794391656001466, "phrase": "tree_descriptors"}, {"score": 0.0023594160789762227, "phrase": "tree_objects"}, {"score": 0.0023100907305651872, "phrase": "accumulated_slope"}, {"score": 0.0021773853011112882, "phrase": "real_world"}, {"score": 0.0021590588269751816, "phrase": "echinoderm_species_identification"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["2D tree objects", " 2D tree structures", " Tree descriptor", " Slope chain code", " Chain coding", " 2D tree representation", " Measure of tortuosity"], "paper_abstract": "A method for representing 2D (two-dimensional) tree objects is described. This representation is based on a chain code, which is called the Slope Chain Code (SCC). Thus, 2D tree objects are described by means of a chain of element strings suitably combined by means of parentheses. These 2D tree objects correspond to naturally existing 2D tree structures. This tree notation preserves the shape of trees (and the shape of their branches), allows us to know their topological and geometrical properties. The proposed notation of 2D tree objects is invariant under translation, rotation and, optionally, under scaling. Also, it is possible to define a unique start vertex for each tree via the unique path in the tree. Using this notation it is possible to obtain the mirror image of any tree with ease. Furthermore, two interesting properties of trees are presented: the accumulated slope and the tortuosity. Tortuosity is a very important property of trees and has many applications in different fields. In order to prove our method for representing 2D tree objects, we obtain some tree descriptors of tree objects and compute their measures of accumulated slope and tortuosity. Finally, we present some examples of 2D trees from the real world about echinoderm species identification. (C) 2014 Elsevier Ltd. All rights reserved.", "paper_title": "2D tree object representation via the slope chain code", "paper_id": "WOS:000338392400004"}