{"auto_keywords": [{"score": 0.049549233113679675, "phrase": "image_magnification"}, {"score": 0.03979720573493322, "phrase": "flow-like_textures"}, {"score": 0.03363896917055259, "phrase": "pde"}, {"score": 0.00481495049065317, "phrase": "local_geometry"}, {"score": 0.004180234323211199, "phrase": "geometric_structures"}, {"score": 0.004112582094962078, "phrase": "original_high-resolution_image"}, {"score": 0.003531474887552889, "phrase": "edge-enhancing_pde"}, {"score": 0.003290237137651949, "phrase": "structure_tensor"}, {"score": 0.0030821633718368206, "phrase": "novel_one"}, {"score": 0.0027943943921568456, "phrase": "corner_structures"}, {"score": 0.0022595316565074326, "phrase": "super-resolution_reconstruction"}, {"score": 0.002186849855560281, "phrase": "image_fidelity"}, {"score": 0.0021631447601689444, "phrase": "experiment_results"}], "paper_keywords": [""], "paper_abstract": "Though there have been proposed many magnification works in literatures, magnification in this paper is approached as reconstructing the geometric structures of the original high-resolution image. The structure tensor is able to estimate the orientation of both the edges and flow-like textures, which hence is much appropriate to magnification. Firstly, an edge-enhancing PDE and a corner-growing PDE are respectively proposed based on the structure tensor. Then, the two PDE's are combined into a novel one, which not only enables to enhance the edges and flow-like textures, but also to preserve the corner structures. Finally, the novel PDE is applied to image magnification. The method is simple, fast and robust to both the noise and the blocking-artifact. Another novelty in the paper is the application of the novel PDE to super-resolution reconstruction, plus additional term for image fidelity. Experiment results demonstrate the effectiveness of our approach.", "paper_title": "Local geometry driven image magnification and applications to super-resolution", "paper_id": "WOS:000241892100093"}