{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "unconventional_computation"}, {"score": 0.04939912794117237, "phrase": "ucomp"}, {"score": 0.029317891457778772, "phrase": "coordination_action"}, {"score": 0.004679134285953932, "phrase": "important_and_emerging_area"}, {"score": 0.004563427013973105, "phrase": "new_ways"}, {"score": 0.004450568197899267, "phrase": "traditional_model"}, {"score": 0.004233119608341877, "phrase": "novel_substrates"}, {"score": 0.003969018740062018, "phrase": "new_paradigms"}, {"score": 0.0038708031633013086, "phrase": "combined_information_processing_and_material_production"}, {"score": 0.0037615180375561805, "phrase": "ucomp_researchers"}, {"score": 0.0036947814248579243, "phrase": "wide_and_diverse_range"}, {"score": 0.0031788080316930687, "phrase": "design_networks"}, {"score": 0.0031448288291084, "phrase": "industrial_fabrication"}, {"score": 0.0029484244900690485, "phrase": "new_and_creative_approaches"}, {"score": 0.0027151607914592552, "phrase": "international_ucomp_community"}, {"score": 0.002686124293881678, "phrase": "inherent_diversity"}, {"score": 0.0025364139244227458, "phrase": "large-scale_project_support"}, {"score": 0.0023609270767241215, "phrase": "european_level"}, {"score": 0.0023024126375034066, "phrase": "european_community"}, {"score": 0.002237308726827077, "phrase": "first_ucomp_roadmap"}, {"score": 0.0021896891011033105, "phrase": "wider_public"}, {"score": 0.0021662599012740127, "phrase": "scientific_community"}], "paper_keywords": ["Unconventional computation", " FP7", " European Commission", " Roadmap"], "paper_abstract": "Unconventional computation (UCOMP) is an important and emerging area of scientific research, which explores new ways of computing that go beyond the traditional model, as well as quantum- and brain inspired computing. Such alternatives may encompass novel substrates (e.g., DNA, living cells, or mixtures of the two) as well as new paradigms which, for example, support combined information processing and material production (as living systems do). UCOMP researchers draw inspiration from a wide and diverse range of sources, from physics, to chemistry, biology and ecology. The field is growing quickly, and has the potential to revolutionize not only our fundamental understanding of the nature of computing, but the way in which we solve problems, design networks, do industrial fabrication, make drugs or construct buildings. The problems we already face in the 21 st century will require new and creative approaches, conceptual frameworks, mechanisms and perspectives. UCOMP offers one route towards this. TRUCE is a coordination action to help organize the international UCOMP community. The inherent diversity of the field has led to fragmentation, with many sub-fields developing in parallel. With large-scale project support now being offered by the European Commission, the time is precisely right to organize and coordinate the field at the European level. This coordination action will engage the European community (and beyond), construct the first UCOMP roadmap, reach out to a wider public beyond the scientific community, and build the foundations for a new, sustainable and coherent scientific discipline.", "paper_title": "TRUCE: A Coordination Action for Unconventional Computation", "paper_id": "WOS:000312177000009"}