{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "librarian-provided_services"}, {"score": 0.008135767755456566, "phrase": "healthcare_settings"}, {"score": 0.004447509888681154, "phrase": "healthcare_provider"}, {"score": 0.004399616575575586, "phrase": "researcher_outcomes"}, {"score": 0.004367973309172735, "phrase": "materials_and_methods_medline"}, {"score": 0.004336556853437252, "phrase": "cinahl"}, {"score": 0.004305364955542171, "phrase": "eric"}, {"score": 0.004137761530535196, "phrase": "controlled_trials"}, {"score": 0.0039196351785300045, "phrase": "healthcare_system"}, {"score": 0.003891430578662587, "phrase": "healthcare_providers"}, {"score": 0.0035554741718298085, "phrase": "primary_care_settings"}, {"score": 0.0035171528695692213, "phrase": "public_health_clinics"}, {"score": 0.0034792431564692997, "phrase": "twenty-five_articles"}, {"score": 0.0031672925196105663, "phrase": "healthcare_trainees"}, {"score": 0.0031331419276289306, "phrase": "measured_literature"}, {"score": 0.003065938050346064, "phrase": "librarian-provided_literature_searching_services"}, {"score": 0.002760836859397696, "phrase": "direct_services"}, {"score": 0.002672454243212711, "phrase": "librarian-provided"}, {"score": 0.0026151058979100596, "phrase": "training_programs"}, {"score": 0.002441477009112022, "phrase": "research_evidence"}, {"score": 0.0022711207841260767, "phrase": "health_professionals"}, {"score": 0.0022466111771668406, "phrase": "relevant_information"}, {"score": 0.002198380879018061, "phrase": "patient_length"}, {"score": 0.00213567715613494, "phrase": "literature_searches"}, {"score": 0.0021049977753042253, "phrase": "patient's_case"}], "paper_keywords": [""], "paper_abstract": "Objective To assess the effects of librarian-provided services in healthcare settings on patient, healthcare provider, and researcher outcomes. Materials and methods Medline, CINAHL, ERIC, LISA (Library and Information Science Abstracts), and the Cochrane Central Register of Controlled Trials were searched from inception to June 2013. Studies involving librarian-provided services for patients encountering the healthcare system, healthcare providers, or researchers were eligible for inclusion. All librarian-provided services in healthcare settings were considered as an intervention, including hospitals, primary care settings, or public health clinics. Results Twenty-five articles fulfilled our eligibility criteria, including 22 primary publications and three companion reports. The majority of studies (15/22 primary publications) examined librarians providing instruction in literature searching to healthcare trainees, and measured literature searching proficiency. Other studies analyzed librarian-provided literature searching services and instruction in question formulation as well as the impact of librarian-provided services on patient length of stay in hospital. No studies were found that investigated librarians providing direct services to researchers or patients in healthcare settings. Conclusions Librarian-provided services directed to participants in training programs (eg, students, residents) improve skills in searching the literature to facilitate the integration of research evidence into clinical decision-making. Services provided to clinicians were shown to be effective in saving time for health professionals and providing relevant information for decision-making. Two studies indicated patient length of stay was reduced when clinicians requested literature searches related to a patient's case.", "paper_title": "Effects of librarian-provided services in healthcare settings: a systematic review", "paper_id": "WOS:000343776700027"}