{"auto_keywords": [{"score": 0.03843856552198327, "phrase": "veber"}, {"score": 0.00481495049065317, "phrase": "molecular_diversity_analysis"}, {"score": 0.0038838500580958744, "phrase": "physical_and_biological_properties"}, {"score": 0.00379914165379475, "phrase": "molecular_diversity"}, {"score": 0.0036958398682001015, "phrase": "lipinski"}, {"score": 0.003555902292752528, "phrase": "molecular_weight"}, {"score": 0.0030808211830129304, "phrase": "hydrogen-bond_donors"}, {"score": 0.0028675712105299496, "phrase": "drug-like_compounds"}, {"score": 0.0026838147966444783, "phrase": "biologically_undesired_functional_groups"}, {"score": 0.002539689093411356, "phrase": "high-throughput_screening"}, {"score": 0.002470547930651519, "phrase": "modified_filters"}, {"score": 0.00241658945942583, "phrase": "lead-like_structures"}, {"score": 0.002337848196418384, "phrase": "unique_compounds"}, {"score": 0.0022994427535192492, "phrase": "potential_leads"}, {"score": 0.0022368274529152342, "phrase": "biological_activities"}, {"score": 0.0021049977753042253, "phrase": "exclusive_sets"}], "paper_keywords": [""], "paper_abstract": "A database of 7.9 million compounds commercially available from 29 suppliers in 2008-2009 was assembled and analyzed. 5.2 million structures of this database were identified to be unique and were subjected to an assessment of physical and biological properties and estimation of molecular diversity. The rules of Lipinski and Veber were applied to the molecular weight, the calculated water/n-octanol partition coefficients (Clog P), the calculated aqueous solubility (log S), the numbers of hydrogen-bond donors and acceptors, and the calculated Caco-2 membrane permeability to identify the drug-like compounds, whereas the toxicity/reactivity filters were used to remove the structures with biologically undesired functional groups. This filtering resulted in 2.0 million (39%) structures perfectly suitable for high-throughput screening of biological activity. Modified filters applied to identify lead-like structures revealed that 16% of the unique compounds could be potential leads. Assessment of the biological activities, the analysis of diversity, and the sizes of exclusive sets of compounds are presented.", "paper_title": "Drug- and Lead-likeness, Target Class, and Molecular Diversity Analysis of 7.9 Million Commercially Available Organic Compounds Provided by 29 Suppliers", "paper_id": "WOS:000276915200002"}