{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "thin_mobile_devices"}, {"score": 0.004769182299692333, "phrase": "heterogeneous_networks"}, {"score": 0.004678940805063634, "phrase": "mobile_computing_devices"}, {"score": 0.004397230847865867, "phrase": "online_gaming"}, {"score": 0.003702206069379459, "phrase": "proper_resources"}, {"score": 0.003253791343615811, "phrase": "thin_wireless_mobile_devices"}, {"score": 0.0031018195951638882, "phrase": "interactive_frame_rates"}, {"score": 0.003043031131345537, "phrase": "research_work"}, {"score": 0.002752139271586703, "phrase": "demanding_geometry-rendering_task"}, {"score": 0.0027129118211250336, "phrase": "dedicated_remote_rendering_server"}, {"score": 0.002661474607275484, "phrase": "rendering_output"}, {"score": 0.0024534993283766332, "phrase": "image_buffer_management_mechanism"}, {"score": 0.002372649454733251, "phrase": "small_storage"}, {"score": 0.0023388183537341213, "phrase": "thin_devices"}, {"score": 0.002187194307878705, "phrase": "extensive_set"}, {"score": 0.002166349705365602, "phrase": "simulation_experiments"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["image-based rendering", " interactive multimedia streaming", " end-to-end rate control", " image-based pre-fetching and buffering"], "paper_abstract": "Advances in mobile computing devices have resulted in a new class of 31) virtual environment applications such as virtual guides and malls, online gaming, training and monitoring systems, just to name a few. The challenge lies in determining how to provide a rich and detailed 3D virtual environment to these thin devices, since they are known for their lack of the proper resources required to process large scale 31) geometric data. In a wireless scenario, in which bandwidth is highly dynamic, users may experience long delays when downloading an entire 31) environment before they start interacting with it. Furthermore, thin wireless mobile devices are unable to handle the complexity of 3D graphics at interactive frame rates. In this research work, we propose efficient end-to-end streaming and rate control protocols. Our approach consists of moving the demanding geometry-rendering task to a dedicated remote rendering server that streams the rendering output to a client, leaving only the displaying and certain minor image-based rendering tasks to the local, less powerful mobile hardware. We also investigate an image buffer management mechanism in order to deal with the small storage available on thin devices. We discuss the design of our proposed solutions and report on their performance evaluation through an extensive set of simulation experiments. (c) 2008 Elsevier B.V. All rights reserved.", "paper_title": "An end-to-end virtual environment streaming technique for thin mobile devices over heterogeneous networks", "paper_id": "WOS:000257973800009"}