{"auto_keywords": [{"score": 0.027773607799187222, "phrase": "proposed_algorithm"}, {"score": 0.013106311200460269, "phrase": "asn_gw_relocation"}, {"score": 0.004752221133109136, "phrase": "mobile_wimax_networks"}, {"score": 0.00465964893087681, "phrase": "wimax_forum"}, {"score": 0.004539005582217309, "phrase": "two-tiered_mobility_management"}, {"score": 0.004363846362238565, "phrase": "packet_loss"}, {"score": 0.0038271712887391015, "phrase": "asn_gw_relocation_procedures"}, {"score": 0.0031019373572233706, "phrase": "traditional_admission_control"}, {"score": 0.0030615742691812516, "phrase": "ac"}, {"score": 0.0030017207229983385, "phrase": "wiener_process"}, {"score": 0.00268452026617243, "phrase": "analytical_model"}], "paper_keywords": ["Mobility management", " resource management", " admission control", " WiMAX networks", " statistics and stochastic process", " wireless networks"], "paper_abstract": "The WiMAX Forum has defined a two-tiered mobility management to minimize handover delay and packet loss. However, it leads to another problem: When to perform ASN GW relocation? The standards only define the ASN GW relocation procedures without specifying when the ASN GW relocation should be performed. It is left for vendors and operators to develop their own proprietary solutions. In this paper, we propose an algorithm, which incorporates traditional Admission Control (AC) and Wiener Process (WP)-based prediction algorithms to determine when to carry out ASN GW relocation. We further develop an analytical model to analyze the proposed algorithm. Simulations are also conducted to evaluate the performance of the proposed algorithm. The results show that the proposed algorithm can improve the performance significantly in terms of blocking probability, dropping probability, average serving rate, and average signaling overhead.", "paper_title": "Design and Analysis of the Gateway Relocation and Admission Control Algorithm in Mobile WiMAX Networks", "paper_id": "WOS:000297371100002"}