{"auto_keywords": [{"score": 0.0290995359952885, "phrase": "mrr"}, {"score": 0.00481495049065317, "phrase": "semantically_equivalent_answer_patterns"}, {"score": 0.004577440795549049, "phrase": "novel_technique"}, {"score": 0.004500891637057374, "phrase": "semantic_constraints"}, {"score": 0.004278807087784626, "phrase": "reformulation-based_question"}, {"score": 0.003999578057088828, "phrase": "semantic-based_reformulations"}, {"score": 0.0027898428590137515, "phrase": "automatically_acquired_semantic_patterns"}, {"score": 0.002607527117561699, "phrase": "semantic_redundancy"}, {"score": 0.0023560952790080943, "phrase": "new_technique"}, {"score": 0.0022777800735119405, "phrase": "manual_work"}, {"score": 0.0022396019251440724, "phrase": "semantically_equivalent_reformulations"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["natural language processing", " question answering", " semantic relations", " question reformulations"], "paper_abstract": "In this paper, we discuss a novel technique based on semantic constraints to improve the performance and portability of a reformulation-based question answering system. First, we present a method for acquiring semantic-based reformulations automatically. The goal is to generate patterns from sentences retrieved from the Web based on lexical, syntactic and semantic constraints. Once these constraints have been defined, we present a method to evaluate and re-rank candidate answers that satisfy these constraints using redundancy. The two approaches have been evaluated independently and in combination. The evaluation on 493 questions from TREC-11 shows that the automatically acquired semantic patterns increase the MRR by 26%, the re-ranking using semantic redundancy increases the MRR by 67%, and the two approaches combined increase the MRR by 73%. This new technique allows us to avoid the manual work of formulating semantically equivalent reformulations; while still increasing performance. (C) 2007 Elsevier B.V. All rights reserved.", "paper_title": "Improving the performance of question answering with semantically equivalent answer patterns", "paper_id": "WOS:000257253400005"}