{"auto_keywords": [{"score": 0.03291415397226364, "phrase": "active_site"}, {"score": 0.004723322467153553, "phrase": "key_drug_target"}, {"score": 0.004545240514015278, "phrase": "life_cycle"}, {"score": 0.004401955895933783, "phrase": "rigidity_analysis"}, {"score": 0.004208881856146758, "phrase": "computationally_inexpensive_method"}, {"score": 0.0041287394089001405, "phrase": "functional_information"}, {"score": 0.004076157223660074, "phrase": "protein_crystal_structures"}, {"score": 0.0033200826267264383, "phrase": "overall_rigidity"}, {"score": 0.003256808693019209, "phrase": "protein_homodimer"}, {"score": 0.003054450075234415, "phrase": "principal_effect"}, {"score": 0.0028100102841877835, "phrase": "beta-hairpin_flaps"}, {"score": 0.0025195550121331367, "phrase": "commercially_available_antiviral_drugs"}, {"score": 0.0022882500116799777, "phrase": "flap_rigidity"}, {"score": 0.002173679145840769, "phrase": "non-peptidic_inhibitor"}], "paper_keywords": [""], "paper_abstract": "Motivation: HIV-1 protease is a key drug target due to its role in the life cycle of the HIV-1 virus. Rigidity analysis using the software First is a computationally inexpensive method for inferring functional information from protein crystal structures. We evaluate the rigidity of 206 high-resolution (2 angstrom or better) X-ray crystal structures of HIV-1 protease and compare the effects of different inhibitors binding to the enzyme. Results: Inhibitor binding has little effect on the overall rigidity of the protein homodimer, including the rigidity of the active site. The principal effect of inhibitor binding on rigidity is to constrain the flexibility of the beta-hairpin flaps, which move to allow access to the active site of the enzyme. We show that commercially available antiviral drugs which target HIV-1 protease can be divided into two classes, those which significantly affect flap rigidity and those which do not. The non-peptidic inhibitor tipranavir is distinctive in its consistently strong effect on flap rigidity.", "paper_title": "Inhibition of HIV-1 protease: the rigidity perspective", "paper_id": "WOS:000300043200008"}