{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "euclidean_maximum_flow_network_interdiction_problem"}, {"score": 0.0047155367844327, "phrase": "interdiction_problem"}, {"score": 0.004337900700685262, "phrase": "sink_node"}, {"score": 0.00421297029755273, "phrase": "euclidean_space"}, {"score": 0.00390792986752692, "phrase": "defender's_maximum_flow"}, {"score": 0.003763763153640936, "phrase": "arc_capacities"}, {"score": 0.0034620831765465425, "phrase": "arc_locations"}, {"score": 0.0028926147550022607, "phrase": "maximum_flow_interdiction_problem"}, {"score": 0.002856620292418048, "phrase": "wood"}, {"score": 0.002682917193736698, "phrase": "lower-bounding_integer_programs"}, {"score": 0.002436888552432561, "phrase": "test_instances"}, {"score": 0.0022507188208913394, "phrase": "nonlinear_capacity_functions"}, {"score": 0.002158505888557746, "phrase": "real_geographical_network"}, {"score": 0.0021049977753042253, "phrase": "wiley_periodicals"}], "paper_keywords": ["network interdiction", " bilevel optimization", " Euclidean space", " space-discretization", " integer programming", " global optimization"], "paper_abstract": "We consider an interdiction problem that involves an operator (or defender) whose goal is to maximize flow from a source node to a sink node in some network that resides in Euclidean space. The problem we examine takes the perspective of an interdictor, who seeks to minimize the defender's maximum flow by locating a set of attacks that diminish arc capacities in accordance with the distance from the arc to the attack. Attacks are not restricted to node or arc locations, and can occur anywhere on the region in which the network is located. We refer to this problem as the Euclidean maximum flow network interdiction problem (E-MFNIP). We show that E-MFNIP is NP-hard, as it generalizes the maximum flow interdiction problem studied by Wood . This article contributes two approaches to solving E-MFNIP based on solving a sequence of lower-bounding integer programs from which upper bounds can be readily obtained, and shows that these bounds are convergent. Computations on a set of test instances indicate that an approach based on space-discretization tends to converge much faster than one based on linearizing the nonlinear capacity functions. We demonstrate the application of our space-discretization approach on a real geographical network. (c) 2014 Wiley Periodicals, Inc. NETWORKS, Vol. 64(2), 109-124 2014", "paper_title": "Exact Algorithms for Solving a Euclidean Maximum Flow Network Interdiction Problem", "paper_id": "WOS:000341978800005"}