{"auto_keywords": [{"score": 0.04952525101149597, "phrase": "imbalanced_datasets"}, {"score": 0.009055492281489746, "phrase": "furia"}, {"score": 0.008713768692145006, "phrase": "evolutionary_fuzzy_classifiers"}, {"score": 0.004636252403395063, "phrase": "experimental_study"}, {"score": 0.0042610532651691305, "phrase": "main_approaches"}, {"score": 0.004224008636767914, "phrase": "evolutionary_generation"}, {"score": 0.004199490556726464, "phrase": "fuzzy_rule-based_systems"}, {"score": 0.004114787982556699, "phrase": "fourth_efc"}, {"score": 0.004043541331944951, "phrase": "multi-objective_evolutionary_learning"}, {"score": 0.004020066537823032, "phrase": "moel"}, {"score": 0.00357806560856829, "phrase": "non-parametric_tests"}, {"score": 0.0034052040544137224, "phrase": "roc_curve"}, {"score": 0.0033074351473200885, "phrase": "comparison_algorithms"}, {"score": 0.00310208083392418, "phrase": "lower_number"}, {"score": 0.002744683473733121, "phrase": "farc"}, {"score": 0.0026892447164623247, "phrase": "fuzzy_rule-based_classifiers"}, {"score": 0.002536926192232391, "phrase": "highest_accuracy_rank"}, {"score": 0.0025148328760856505, "phrase": "statistical_tests"}, {"score": 0.0024784363584530976, "phrase": "rule_bases"}, {"score": 0.002421291757425244, "phrase": "low_interpretability"}, {"score": 0.0021991369769963545, "phrase": "non-fuzzy_classifiers"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Genetic and evolutionary fuzzy systems", " Fuzzy rule-based classifiers", " Imbalanced datasets"], "paper_abstract": "In this paper, we show an experimental study on a set of evolutionary fuzzy classifiers (EFCs) purposely designed to manage imbalanced datasets. Three of these EFCs represent the state-of-the-art of the main approaches to the evolutionary generation of fuzzy rule-based systems for imbalanced dataset classification. The fourth EFC is an extension of a multi-objective evolutionary learning (MOEL) scheme we have recently proposed for managing imbalanced datasets: the rule base and the membership function parameters of a set of FRBCs are concurrently learned by optimizing the sensitivity, the specificity and the complexity. By using non-parametric tests, we first compare the results obtained by the four EFCs in terms of area under the ROC curve. We show that our MOEL scheme outperforms two of the comparison algorithms and results to be statistically equivalent to the third. Further, the classifiers generated by our MOEL scheme are characterized by a lower number of rules than the ones generated by the other approaches. To validate the effectiveness of our MOEL scheme in dealing with imbalanced datasets, we also compare our results with the ones achieved, after rebalancing the datasets, by two state-of-the-art algorithms, namely FURIA and FARC-HD, proposed for generating fuzzy rule-based classifiers for balanced datasets. We show that our MOEL scheme is statistically equivalent to FURIA, which is associated with the highest accuracy rank in the statistical tests. However, the rule bases generated by FURIA are characterized by a low interpretability. Finally, we show that the results achieved by our MOEL scheme are statistically equivalent to the ones achieved by four state-of-the-art approaches, based on ensembles of non-fuzzy classifiers, appropriately designed for dealing with imbalanced datasets. (C) 2014 Published by Elsevier B.V.", "paper_title": "An experimental study on evolutionary fuzzy classifiers designed for managing imbalanced datasets", "paper_id": "WOS:000342529500012"}