{"auto_keywords": [{"score": 0.04936106948081192, "phrase": "high-order_fuzzy_logical_relationships"}, {"score": 0.006381635567778154, "phrase": "taiex"}, {"score": 0.005858540606736779, "phrase": "proposed_method"}, {"score": 0.00481495049065317, "phrase": "forecasting_problems"}, {"score": 0.004036369952624852, "phrase": "forecasting_results"}, {"score": 0.003780286517897356, "phrase": "forecasting_activities"}, {"score": 0.0036125439380579626, "phrase": "new_method"}, {"score": 0.003366233863411861, "phrase": "inventory_demand"}, {"score": 0.0031845067058084583, "phrase": "historical_data"}, {"score": 0.003152531962718477, "phrase": "fuzzy_sets"}, {"score": 0.002878785759716458, "phrase": "adjacent_fuzzy_sets"}, {"score": 0.0024617483174454113, "phrase": "high-order_fuzzy_logical_relationship_group"}, {"score": 0.0024125253170522816, "phrase": "taiex."}, {"score": 0.0023523750536537102, "phrase": "higher_average_forecasting_accuracy_rate"}, {"score": 0.0021697677572213086, "phrase": "existing_methods"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Fuzzy sets", " Fuzzy time series", " Fuzzy forecasting", " High-order fuzzy time series", " High-order fuzzy logical relationships"], "paper_abstract": "People usually use many methods to predict the weather, the temperature, the stock index, the enrollments, the earthquake, the economy, etc. Based on these forecasting results, people can prevent damages to occur or get benefits from the forecasting activities. In this paper, we present a new method to forecast the Taiwan Stock Exchange Capitalization Weighted Stock Index (TAIEX), the enrollments of the University of Alabama and the inventory demand based on high-order fuzzy logical relationships. First, the proposed method fuzzifies the historical data into fuzzy sets to form high-order fuzzy logical relationships. Then, it calculates the value of the variable between the subscripts of adjacent fuzzy sets appearing in the antecedents of high-order fuzzy logical relationships. Then, it lets the high-order fuzzy logical relationships with the same variable value form a high-order fuzzy logical relationship group. Finally, it chooses a high-order fuzzy logical relationship group to forecast the TAIEX. The proposed method gets a higher average forecasting accuracy rate to forecast the TAIEX, the enrollments of the University of Alabama and the inventory demand than the existing methods. (C) 2010 Elsevier Ltd. All rights reserved.", "paper_title": "Handling forecasting problems based on high-order fuzzy logical relationships", "paper_id": "WOS:000286904600104"}