{"auto_keywords": [{"score": 0.03405532196821086, "phrase": "hinting_techniques"}, {"score": 0.00481495049065317, "phrase": "different_hinting"}, {"score": 0.00469445816161498, "phrase": "intelligent_tutoring_systems._intelligent_tutoring_systems"}, {"score": 0.00441738161338662, "phrase": "information_retrieval"}, {"score": 0.004220314322073171, "phrase": "students'_learning"}, {"score": 0.003393115177189967, "phrase": "learning_gains"}, {"score": 0.0031284221314354095, "phrase": "x_tutor_its."}, {"score": 0.002988685006809336, "phrase": "significant_increase"}, {"score": 0.0029584874121320165, "phrase": "students'_knowledge"}, {"score": 0.0025275050635202878, "phrase": "proper_adaptation"}, {"score": 0.0024516267507109753, "phrase": "different_information"}, {"score": 0.0023780209525032688, "phrase": "better_student_learning_gains"}, {"score": 0.002271725588755076, "phrase": "student_survey"}, {"score": 0.002214734873559146, "phrase": "students'_ratings"}, {"score": 0.002181227522730908, "phrase": "different_hinting_features"}, {"score": 0.0021049977753042253, "phrase": "high_variances"}], "paper_keywords": ["Adaptive systems", " Decision support", " Intelligent tutoring systems", " Educational technology"], "paper_abstract": "Intelligent Tutoring Systems (ITSs) must take advantage of their high computing capabilities and capacity for information retrieval in order to provide the most effective methodologies for improving students' learning. One type of ITS provides assessments to students and some help as a hint, when they do not know how to solve a problem. Our thesis is that the type of hinting techniques used without changing the contents can influence the learning gains and aptitudes of students. We have implemented some hinting techniques as an extension to the X Tutor ITS. We found that some hinting techniques can produce a significant increase in students' knowledge with respect to others, but the improvement and direction of the comparison depended on some other factors such as the topics to which it was applied. We conclude that proper adaptation of hinting techniques based on different information of the systems will imply better student learning gains. In addition, the results of a student survey, which includes the students' ratings of the different hinting features they interacted with, leads to high variances, which reinforce the idea of the importance of adaptation of hinting techniques in these types of systems.", "paper_title": "DECIDING ON DIFFERENT HINTING TECHNIQUES IN ASSESSMENTS FOR INTELLIGENT TUTORING SYSTEMS", "paper_id": "WOS:000287278100027"}