{"auto_keywords": [{"score": 0.03593976593369695, "phrase": "analytical_model"}, {"score": 0.022630169062604778, "phrase": "carbon_dioxide"}, {"score": 0.01049310776231292, "phrase": "potential_repositories"}, {"score": 0.004724571550328985, "phrase": "geologic_sequestration"}, {"score": 0.004653485665080485, "phrase": "numerical_models"}, {"score": 0.004090682761004765, "phrase": "simple_analytical_equations"}, {"score": 0.00393844255111604, "phrase": "previous_researchers"}, {"score": 0.0037774893672602506, "phrase": "candidate_repositories"}, {"score": 0.003748937184382714, "phrase": "subsurface_sequestration"}, {"score": 0.0035820833812158035, "phrase": "constant_rate"}, {"score": 0.0035415392642831616, "phrase": "confined_saline_aquifer"}, {"score": 0.003501452436803395, "phrase": "fully_perforated_vertical_injection"}, {"score": 0.003042697264766327, "phrase": "excellent_agreement"}, {"score": 0.002996840657035727, "phrase": "similar_input_conditions"}, {"score": 0.002874257080906824, "phrase": "capillary_pressure"}, {"score": 0.002841701708055512, "phrase": "pressure_dependence"}, {"score": 0.002820202660128789, "phrase": "fluid_properties"}, {"score": 0.00265394824073552, "phrase": "sensitivity_studies"}, {"score": 0.0022115879730677, "phrase": "relative_permeability"}, {"score": 0.0021049977753042253, "phrase": "irreducible_saturation"}], "paper_keywords": ["Carbon sequestration", " Plume migration", " Pressure", " Buoyancy effect"], "paper_abstract": "Assessing potential repositories for geologic sequestration of carbon dioxide using numerical models can be complicated, costly, and time-consuming, especially when faced with the challenge of selecting a repository from a multitude of potential repositories. This paper presents a set of simple analytical equations (model), based on the work of previous researchers, that could be used to evaluate the suitability of candidate repositories for subsurface sequestration of carbon dioxide. We considered the injection of carbon dioxide at a constant rate into a confined saline aquifer via a fully perforated vertical injection well. The validity of the analytical model was assessed via comparison with the TOUGH2 numerical model. The metrics used in comparing the two models include (1) spatial variations in formation pressure and (2) vertically integrated brine saturation profile. The analytical model and TOUGH2 show excellent agreement in their results when similar input conditions and assumptions are applied in both. The analytical model neglects capillary pressure and the pressure dependence of fluid properties. However, simulations in TOUGH2 indicate that little error is introduced by these simplifications. Sensitivity studies indicate that the agreement between the analytical model and TOUGH2 depends strongly on (1) the residual brine saturation, (2) the difference in density between carbon dioxide and resident brine (buoyancy), and (3) the relationship between relative permeability and brine saturation. The results achieved suggest that the analytical model is valid when the relationship between relative permeability and brine saturation is linear or quasi-linear and when the irreducible saturation of brine is zero or very small.", "paper_title": "Analytical model for screening potential CO2 repositories", "paper_id": "WOS:000295166900012"}