{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "max-lifetime_target_coverage"}, {"score": 0.013254877038655657, "phrase": "np"}, {"score": 0.008047671555312167, "phrase": "fpt"}, {"score": 0.004775531918452571, "phrase": "wireless_sensor_networks"}, {"score": 0.004273782634394231, "phrase": "coverage_lifetime"}, {"score": 0.0041696157492057, "phrase": "coverage_requirement"}, {"score": 0.0037776319581225046, "phrase": "systematic_parameterized_complexity_study"}, {"score": 0.003670384366341561, "phrase": "max-min"}, {"score": 0.003610639493020661, "phrase": "max"}, {"score": 0.0033388871136347704, "phrase": "special_cases"}, {"score": 0.0029753513692467315, "phrase": "considered_problems"}, {"score": 0.002618730478351454, "phrase": "structural_parameter"}, {"score": 0.0023527296826339225, "phrase": "max-min_target_coverage"}, {"score": 0.002276439636865258, "phrase": "combined_parameters"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Parameterized and exact algorithm", " Fixed parameter tractable", " Energy efficiency", " Target coverage"], "paper_abstract": "Max-lifetime Target Coverage can be viewed as a family of problems where the task is to partition the sensors into groups and assign their time-slots such that the coverage lifetime is maximized while satisfying some coverage requirement. Unfortunately, these problems are NP-hard. To gain insight into the source of the complexity, we initiate a systematic parameterized complexity study of two types of Max-lifetime Target Coverage: Max-min Target Coverage and Max-individual Target Coverage. We first prove that both problems remain NP-hard even in the special cases where each target is covered by at most two sensors or each sensor can cover at most two targets. By contrast, restricting the number of targets reduces the complexity of the considered problems. In other words, they are both fixed parameter tractable (FPT) with respect to the parameter \"number of targets\". Moreover, we extend our studies to the structural parameter \"number k of sensors covering at least two targets\". Positively, both problems are in FPT with respect to k. Finally, we show that Max-min Target Coverage is in FPT with respect to the combined parameters \"number of groups\" and \"number of targets covered by each group\". (C) 2013 Elsevier B.V. All rights reserved.", "paper_title": "Parameterized complexity of Max-lifetime Target Coverage in wireless sensor networks", "paper_id": "WOS:000330823500004"}