{"auto_keywords": [{"score": 0.05007852962010534, "phrase": "digital_piracy"}, {"score": 0.005721975935082096, "phrase": "proxy_measurement"}, {"score": 0.004790845033802341, "phrase": "actual_engagement"}, {"score": 0.004726523233360862, "phrase": "planned_behaviour_approach"}, {"score": 0.004377077848734575, "phrase": "planned_behaviour"}, {"score": 0.004217708394188058, "phrase": "individuals'_intentions"}, {"score": 0.003978866233891427, "phrase": "large_western_australian_university"}, {"score": 0.003936910716320182, "phrase": "self-administered_surveys"}, {"score": 0.003906815917760705, "phrase": "moral_judgement"}, {"score": 0.0038861621731358484, "phrase": "social_habit"}, {"score": 0.00385431710959668, "phrase": "path_analysis"}, {"score": 0.0038339398365449507, "phrase": "structural_equation"}, {"score": 0.0037435621157530853, "phrase": "antecedent_factors"}, {"score": 0.0037237682010640297, "phrase": "individual_attitudes"}, {"score": 0.0035701146177770306, "phrase": "individual_intentions"}, {"score": 0.0035127984203919033, "phrase": "consumer_intentions"}, {"score": 0.003402788619446729, "phrase": "identified_antecedents"}, {"score": 0.003270092550315648, "phrase": "individual's_intentions"}, {"score": 0.00309293916022985, "phrase": "positive_effect"}, {"score": 0.0029565620771207003, "phrase": "antecedent_factor"}, {"score": 0.002826181226538412, "phrase": "social_habits"}, {"score": 0.0027815466400771768, "phrase": "negative_and_positive_influences"}, {"score": 0.0027594936602962075, "phrase": "individual's_engagement"}, {"score": 0.00267301171407926, "phrase": "previous_studies"}, {"score": 0.0026377802995807085, "phrase": "neutralisation_theory"}, {"score": 0.0026238183433560515, "phrase": "tpb"}, {"score": 0.0022614266476954467, "phrase": "software_and_music_downloads"}, {"score": 0.002231607958228148, "phrase": "digital_movies"}, {"score": 0.0021049977753042253, "phrase": "future_research"}], "paper_keywords": ["Theory of planned behaviour", " Structural equation modelling", " Digital piracy", " Downloading", " Movies"], "paper_abstract": "Purpose - The purpose of this paper is to identify the antecedents affecting digital piracy of movies, and evaluate them in the context of the theory of planned behaviour (TPB). It will also determine via a proxy measurement, if individuals' intentions to engage in digital piracy will translate into actual engagement in digital piracy of movies. Design/methodology/approach - In all, 404 students at a large Western Australian University were surveyed using self-administered surveys. The data were analysed via a path analysis using structural equation modelling in order to identify the influences of antecedent factors on individual attitudes and intentions to engage in digital piracy. Finally, through the proxy measurement, actual engagement in digital piracy of movies was evaluated against consumer intentions to perform that behaviour. Findings - The results confirm the identified antecedents (affect, moral judgement, social habit and self-efficacy) as appropriate in evaluating an individual's intentions to engage in digital piracy of movies. The findings indicated that social habit, self-efficacy and attitude towards digital piracy had a positive effect on individual intentions to engage in digital piracy of movies. It also showed that affect is an antecedent factor to attitudes towards digital piracy but also directly influences individual intentions to engage in digital piracy. Moral judgement and social habits was also found to have negative and positive influences on an individual's engagement in digital piracy of movies. Practical implications - This study reinforces previous studies in showing that the neutralisation theory and TPB are effective in explaining attitudes towards digital piracy of movies and intentions to engage in it. It has also sought to ascertain if intentions to engage in digital piracy of movies would significantly influence behaviour to engage in digital piracy of movies via a proxy measurement. Originality/value - This study adds to the literature of piracy in software and music downloads. In terms of digital movies, this study uncovers other possible factors that may affect engagement in digital piracy of movies, which could serve as the basis for future research into the phenomenon of digital piracy.", "paper_title": "Engaging in digital piracy of movies: a theory of planned behaviour approach", "paper_id": "WOS:000332998600006"}