{"auto_keywords": [{"score": 0.04639215358795362, "phrase": "differential_evolution"}, {"score": 0.004565007074039171, "phrase": "steady-state_genetic_algorithms"}, {"score": 0.00450456611645112, "phrase": "evolutionary_strategies"}, {"score": 0.003995226376780718, "phrase": "benchmark_datasets"}, {"score": 0.0038642157757169315, "phrase": "real-world_data"}, {"score": 0.0037624955853577786, "phrase": "turkish_interconnected_power_system"}, {"score": 0.003543273649210823, "phrase": "generational_genetic_algorithm"}, {"score": 0.0029988599391845517, "phrase": "best_performer"}, {"score": 0.002881130228859848, "phrase": "test_data"}, {"score": 0.0023739321566540682, "phrase": "ea_approaches"}, {"score": 0.0021910825909008946, "phrase": "experimental_study"}], "paper_keywords": ["Unit commitment problem", " evolutionary algorithms", " steady-state genetic algorithms", " generational genetic algorithms", " differential evolution", " evolutionary strategies"], "paper_abstract": "This paper compares three evolutionary computation techniques, namely Steady-State Genetic Algorithms, Evolutionary Strategies and Differential Evolution for the Unit Commitment Problem. The comparison. is based on a set of experiments conducted on benchmark datasets as well as on real-world data obtained from the Turkish Interconnected Power System. The results of two state-of-the-art evolutionary approaches, namely a Generational Genetic Algorithm and a Memetic Algorithm for the same benchmark datasets are also included in. the paper for comparison. The tests show that Differential Evolution is the best performer among all approaches on the test data used in the paper. The performances of the other two evolutionary algorithms are also comparable to Differential Evolution. and the results of the algorithms taken from literature showing that all EA approaches tested here are applicable to the Unit Commitment Problem. The results of this experimental study are very promising and promote further study.", "paper_title": "Evolutionary Algorithms for the Unit Commitment Problem", "paper_id": "WOS:000261582500007"}