{"auto_keywords": [{"score": 0.04855239486253465, "phrase": "buffer_reduction"}, {"score": 0.032511196899075494, "phrase": "lower_bound"}, {"score": 0.03150266921574127, "phrase": "semantic_information"}, {"score": 0.023817357800339684, "phrase": "lower_bound_algorithm"}, {"score": 0.00481495049065317, "phrase": "xml_data_stream"}, {"score": 0.004738568783460271, "phrase": "semantics"}, {"score": 0.004537254814246843, "phrase": "current_methods"}, {"score": 0.004488505301335364, "phrase": "query_evaluation"}, {"score": 0.004440277230269978, "phrase": "xml_data_streams"}, {"score": 0.004298666679374568, "phrase": "buffering_techniques"}, {"score": 0.004072573194988867, "phrase": "buffer_scale"}, {"score": 0.003900257249255497, "phrase": "memory_bottleneck"}, {"score": 0.0038375280115736958, "phrase": "optimization_techniques"}, {"score": 0.003124790943886441, "phrase": "empirical_study"}, {"score": 0.0027741761880779535, "phrase": "sax-based_xml_stream_query_evaluation_system"}, {"score": 0.0021049977753042253, "phrase": "semantic_rules"}], "paper_keywords": ["XML Data Stream", " Query Optimization", " Buffer Management", " SAX"], "paper_abstract": "With respect to current methods for query evaluation over XML data streams, adoption of certain types of buffering techniques is unavoidable. Under lots of circumstances, the buffer scale may increase exponentially, which can cause memory bottleneck. Some optimization techniques have been proposed to solve the problem. However, the limit of these techniques has been defined by a concurrency lower bound and has been theoretically proved. In this paper, we show through an empirical study that this lower bound can be broken by taking semantic information into account for buffer reduction. To demonstrate this, we built a SAX-based XML stream query evaluation system and designed an algorithm that consumes buffers in line with the concurrency lower bound. After a further analysis of the lower bound, we designed several semantic rules for the purpose of breaking the lower bound and incorporated these rules in the lower bound algorithm. Experiments are conducted to show that the algorithms deploying semantic rules individually and collectively all significantly outperform the lower bound algorithm that does not consider semantic information.", "paper_title": "A Query System for XML Data Stream and its Semantics-based Buffer Reduction", "paper_id": "WOS:000286136800003"}