{"auto_keywords": [{"score": 0.04832084631284738, "phrase": "ancillary_gestures"}, {"score": 0.00481495049065317, "phrase": "musicians'_ancillary_gestures"}, {"score": 0.004766090327062509, "phrase": "video_analysis"}, {"score": 0.004717723626157272, "phrase": "novel_approach"}, {"score": 0.004560002169647084, "phrase": "musical_performances"}, {"score": 0.00437765047900432, "phrase": "non-obvious_or_accompanist_gestures"}, {"score": 0.004007083686875716, "phrase": "proposed_approach"}, {"score": 0.003807684498435389, "phrase": "musician_body"}, {"score": 0.0037818557818203188, "phrase": "video_scenes"}, {"score": 0.0036058769733410614, "phrase": "body_parts"}, {"score": 0.0031899334050985175, "phrase": "shoulder_curvature"}, {"score": 0.0030936482163040823, "phrase": "optical_flux_algorithm"}, {"score": 0.0029697601808164435, "phrase": "clarinet_bell"}, {"score": 0.002939568952175845, "phrase": "projection_profile_algorithm"}, {"score": 0.0028703075616629634, "phrase": "shoulder_regions"}, {"score": 0.0028218336994432864, "phrase": "ancillary_movements"}, {"score": 0.002764741440770032, "phrase": "knee_movement"}, {"score": 0.0027459678326877744, "phrase": "body_curvature"}, {"score": 0.002565084553019013, "phrase": "nine_clarinetists'_presentations"}, {"score": 0.0025046245057922557, "phrase": "experimental_results"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Gestures", " Music expression", " Video analysis", " Image processing"], "paper_abstract": "A novel approach for the detection of ancillary gestures produced by clarinetists during musical performances is presented in this paper. Ancillary gestures, also known as non-obvious or accompanist gestures are produced spontaneously by musicians during their performances and do not have meaning in sound, but they help in the creation of music. The proposed approach consists in detecting, segmenting and tracking points of interest and parts of the musician body in video scenes to further analyze if the movement associated to these points of interest or body parts could be related to ancillary gestures. In particular, we tackle the problem of detecting the three most commonly seen ancillary gestures of this class of musicians: clarinet bell moving up and down, bending of the knees and shoulder curvature. In this paper we show that the optical flux algorithm for tracking a point of interest at the bottom of the clarinet bell and the projection profile algorithm for analyzing the knees and the shoulder regions are effective in detecting ancillary movements related to the clarinet, knee movement and body curvature respectively. These techniques were evaluated with respect to the precision and recall in detecting ancillary gestures on 12,423 video frames of nine clarinetists' presentations recorded in a studio. The experimental results have shown that the precision in detecting ancillary gestures varies between 78.4% and 92.8%, while the recall varies between 85.3% and 95.5%. These results also imply that any further analysis of the videos by specialists could focus on less than 500 frames which represents a reduction of more than 99% in the workload. (C) 2013 Elsevier Ltd. All rights reserved.", "paper_title": "Automatic detection of musicians' ancillary gestures based on video analysis", "paper_id": "WOS:000329955900055"}