{"auto_keywords": [{"score": 0.043452207739444186, "phrase": "mkl"}, {"score": 0.00481495049065317, "phrase": "multiple_kernel_learning"}, {"score": 0.004603525341738782, "phrase": "multiple_sources"}, {"score": 0.004541918674719973, "phrase": "data-driven_way"}, {"score": 0.004342430078306461, "phrase": "target_kernel_machine"}, {"score": 0.003951453722517865, "phrase": "associated_optimization_problem"}, {"score": 0.0035473867669654174, "phrase": "even_sophisticated_methods"}, {"score": 0.003437486158494063, "phrase": "simple_average"}, {"score": 0.0032716011062067286, "phrase": "time_and_space_efficient_mkl_algorithm"}, {"score": 0.003085813569061001, "phrase": "proposed_method"}, {"score": 0.0024641814990854463, "phrase": "noise_features"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v._all_rights"}], "paper_keywords": ["Multiple kernel learning", " Kernel methods", " Feature selection", " Feature learning"], "paper_abstract": "The goal of Multiple Kernel Learning (MKL) is to combine kernels derived from multiple sources in a data-driven way with the aim to enhance the accuracy of a target kernel machine. State-of-the-art methods of MKL have the drawback that the time required to solve the associated optimization problem grows (typically more than linearly) with the number of kernels to combine. Moreover, it has been empirically observed that even sophisticated methods often do not significantly outperform the simple average of kernels. In this paper, we propose a time and space efficient MKL algorithm that can easily cope with hundreds of thousands of kernels and more. The proposed method has been compared with other baselines (random, average, etc.) and three state-of-the-art MKL methods showing that our approach is often superior. We show empirically that the advantage of using the method proposed in this paper is even clearer when noise features are added. Finally, we have analyzed how our algorithm changes its performance with respect to the number of examples in the training set and the number of kernels combined. (C) 2015 Elsevier B.V. All rights reserved.", "paper_title": "EasyMKL: a scalable multiple kernel learning algorithm", "paper_id": "WOS:000359170300026"}