{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "feature_selection"}, {"score": 0.012330563362674392, "phrase": "optimal_feature"}, {"score": 0.006495177769470128, "phrase": "good_feature_sets"}, {"score": 0.005980860738806, "phrase": "conditionally_expected_error"}, {"score": 0.005931710567595135, "phrase": "selected_feature"}, {"score": 0.004788504414069974, "phrase": "small-sample_settings"}, {"score": 0.004736045157669388, "phrase": "high-throughput_technologies"}, {"score": 0.004671274735676484, "phrase": "vast_numbers"}, {"score": 0.004645614113246736, "phrase": "biological_variables"}, {"score": 0.0045820747375409435, "phrase": "highly_discriminatory_diagnosis"}, {"score": 0.004482206282876944, "phrase": "small_samples"}, {"score": 0.00433645229352341, "phrase": "feature-selection_algorithms"}, {"score": 0.004172360444377281, "phrase": "gene-expression_features"}, {"score": 0.00409264825541748, "phrase": "small_sample"}, {"score": 0.0036856648774311203, "phrase": "good_feature_set"}, {"score": 0.0034496656880436526, "phrase": "conditional_expectation"}, {"score": 0.0028596699752849682, "phrase": "sequential_floating_forward_search"}, {"score": 0.0027437235598539904, "phrase": "survival_prognosis"}, {"score": 0.0027286224888843956, "phrase": "breast_cancer"}, {"score": 0.0024569466759289055, "phrase": "good_feature"}, {"score": 0.002337848196418384, "phrase": "latter_conclusion"}, {"score": 0.002261666793030715, "phrase": "common_occurrence"}, {"score": 0.0021879624017959493, "phrase": "satisfactory_results"}, {"score": 0.0021049977753042253, "phrase": "suitable_feature_sets"}], "paper_keywords": [""], "paper_abstract": "Motivation: High-throughput technologies for rapid measurement of vast numbers of biological variables offer the potential for highly discriminatory diagnosis and prognosis; however, high dimensionality together with small samples creates the need for feature selection, while at the same time making feature-selection algorithms less reliable. Feature selection must typically be carried out from among thousands of gene-expression features and in the context of a small sample (small number of microarrays). Two basic questions arise: (1) Can one expect feature selection to yield a feature set whose error is close to that of an optimal feature set? (2) If a good feature set is not found, should it be expected that good feature sets do not exist? Results: The two questions translate quantitatively into questions concerning conditional expectation. (1) Given the error of an optimal feature set, what is the conditionally expected error of the selected feature set? (2) Given the error of the selected feature set, what is the conditionally expected error of the optimal feature set? We address these questions using three classification rules (linear discriminant analysis, linear support vector machine and k-nearest-neighbor classification) and feature selection via sequential floating forward search and the t-test. We consider three feature-label models and patient data from a study concerning survival prognosis for breast cancer. With regard to the two focus questions, there is similarity across all experiments: (1) One cannot expect to find a feature set whose error is close to optimal, and (2) the inability to find a good feature set should not lead to the conclusion that good feature sets do not exist. In practice, the latter conclusion may be more immediately relevant, since when faced with the common occurrence that a feature set discovered from the data does not give satisfactory results, the experimenter can draw no conclusions regarding the existence or nonexistence of suitable feature sets.", "paper_title": "What should be expected from feature selection in small-sample settings", "paper_id": "WOS:000241271000016"}