{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "substantive_co-link_analysis"}, {"score": 0.015221958462384989, "phrase": "total_co-link_analysis"}, {"score": 0.0077716610792473535, "phrase": "\"total_co-link_analysis"}, {"score": 0.004172722575842674, "phrase": "exploratory_investigations"}, {"score": 0.003960972732123083, "phrase": "co-link_analysis"}, {"score": 0.003859146369720225, "phrase": "internet_structure"}, {"score": 0.0038092152998069786, "phrase": "mining_relationships"}, {"score": 0.0037599278182081056, "phrase": "internet_colonies"}, {"score": 0.0035228596881051763, "phrase": "whole_links"}, {"score": 0.003133052778244851, "phrase": "substantive_and_non-substantive_links"}, {"score": 0.002935393439834135, "phrase": "latter_outweights"}, {"score": 0.0022468671200629024, "phrase": "total_and_substantive_co-link_analysis"}], "paper_keywords": [""], "paper_abstract": "Since the term \"co-link\" was put forward, many scholars have done exploratory investigations to prove the applicability and validity of co-link analysis used in mapping internet structure and mining relationships among internet colonies. All of these studies are based on the whole links in the web called \"total co-link analysis\". However, there are both substantive and non-substantive links in the web, and the number of the latter outweights that of the former, which makes the preconditions of total co-link analysis untenable. In this paper, we present \"substantive co-link analysis\", and believe it is more sound and valid than \"total co-link analysis\". Then exploratory investigations on both total and substantive co-link analysis are carried out with the sample of 20 academic blogs on Library and Information Science, the results of which testify our assumption that \"substantive co-link analysis\" is more efficient and reasonable than \"total co-link analysis\".", "paper_title": "An exploratory study on substantive co-link analysis: A modification to total co-link analysis", "paper_id": "WOS:000257400200008"}