{"auto_keywords": [{"score": 0.04961350773574036, "phrase": "web-services-based_communications"}, {"score": 0.04916281891691642, "phrase": "ieee"}, {"score": 0.00481495049065317, "phrase": "cross-layer_security_scheme"}, {"score": 0.004678317306142206, "phrase": "sensor"}, {"score": 0.0043713857434347254, "phrase": "common_communication_interface"}, {"score": 0.004329331617724, "phrase": "transducer_electric_data_sheet_format"}, {"score": 0.004287680323820891, "phrase": "wired_and_wireless_distributed_applications"}, {"score": 0.004026505114417176, "phrase": "unified_web_service"}, {"score": 0.003637669525737665, "phrase": "unsolved_problem"}, {"score": 0.0034826993555190765, "phrase": "cross-layer_security_mechanism"}, {"score": 0.00320770578058916, "phrase": "communication_process"}, {"score": 0.0030414140732789186, "phrase": "xml_encryption"}, {"score": 0.0030142460295967083, "phrase": "signature"}, {"score": 0.0029830992938695007, "phrase": "soap_security_extension"}, {"score": 0.002940095976373734, "phrase": "web_services_description_language"}, {"score": 0.002828418443899226, "phrase": "former_two_components"}, {"score": 0.002579847272930948, "phrase": "third_component"}, {"score": 0.0021670777282518424, "phrase": "message_size"}, {"score": 0.0021049977753042253, "phrase": "access_inquiry_web_service"}], "paper_keywords": [""], "paper_abstract": "IEEE 1451 standard has been proposed to provide a common communication interface and transducer electric data sheet format for wired and wireless distributed applications in smart transducers (sensors and actuators). Currently, a unified Web service for IEEE 1451 smart transducers is a must. However, ensuring the security of web-services-based communications for IEEE 1451 smart transducers is an unsolved problem. In this paper, we proposed a cross-layer security mechanism that deals with the requirements of authentication, integrity, confidentiality, and availability across the communication process in IEEE 1451 smart transducers. The scheme contains three cross-layer components logically, including XML Encryption and Signature, SOAP Security Extension, and Web Services Description Language (WSDL) Security Checking. The former two components satisfy the requirements of confidentiality, availability, integrity, authentication, nonrepudiation, and freshness. The third component satisfies the requirement of availability, which can protect the system against denial-of-service (DoS) attack. The three cross-layer security components are integrated seamlessly in our scheme. To evaluate the overhead, we perform tests to evaluate the effect of message size on the performance of the access inquiry web service. The result supports the usefulness and feasibility of our scheme.", "paper_title": "A Cross-Layer Security Scheme of Web-Services-Based Communications for IEEE 1451 Sensor and Actuator Networks", "paper_id": "WOS:000316136800001"}