{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "dbscan"}, {"score": 0.015494634560598408, "phrase": "heavily_skewed_data"}, {"score": 0.004390192910013225, "phrase": "important_spatial_clustering_technique"}, {"score": 0.004263972370406983, "phrase": "numerous_applications"}, {"score": 0.00386876598761639, "phrase": "existing_parallel_dbscan_algorithms"}, {"score": 0.0036493838225192883, "phrase": "parallel_tasks"}, {"score": 0.003107935254560724, "phrase": "shared-nothing_environments"}, {"score": 0.0029747028229638625, "phrase": "parallel_processing_paradigms"}, {"score": 0.002765217631928139, "phrase": "mapreduce"}, {"score": 0.0025578967205807843, "phrase": "performance_bottleneck"}, {"score": 0.0025207920578878894, "phrase": "sequential_processing"}, {"score": 0.002424450174817922, "phrase": "novel_data"}, {"score": 0.002366110899738696, "phrase": "computation_cost_estimation"}, {"score": 0.002286781334850213, "phrase": "desirable_load"}, {"score": 0.002125612498781805, "phrase": "real_large_datasets"}], "paper_keywords": ["data clustering", " parallel algorithm", " data mining", " load balancing"], "paper_abstract": "DBSCAN (density-based spatial clustering of applications with noise) is an important spatial clustering technique that is widely adopted in numerous applications. As the size of datasets is extremely large nowadays, parallel processing of complex data analysis such as DBSCAN becomes indispensable. However, there are three major drawbacks in the existing parallel DBSCAN algorithms. First, they fail to properly balance the load among parallel tasks, especially when data are heavily skewed. Second, the scalability of these algorithms is limited because not all the critical sub-procedures are parallelized. Third, most of them are not primarily designed for shared-nothing environments, which makes them less portable to emerging parallel processing paradigms. In this paper, we present MR-DBSCAN, a scalable DBSCAN algorithm using MapReduce. In our algorithm, all the critical sub-procedures are fully parallelized. As such, there is no performance bottleneck caused by sequential processing. Most importantly, we propose a novel data partitioning method based on computation cost estimation. The objective is to achieve desirable load balancing even in the context of heavily skewed data. Besides, We conduct our evaluation using real large datasets with up to 1.2 billion points. The experiment results well confirm the efficiency and scalability of MR-DBSCAN.", "paper_title": "MR-DBSCAN: a scalable MapReduce-based DBSCAN algorithm for heavily skewed data", "paper_id": "WOS:000329625400006"}