{"auto_keywords": [{"score": 0.04336705121455173, "phrase": "knowledge_bases"}, {"score": 0.02322730111336098, "phrase": "knowledge_base"}, {"score": 0.020267752296895657, "phrase": "knowledge_structures"}, {"score": 0.006321079311819895, "phrase": "knowledge_distance"}, {"score": 0.0046240999614456605, "phrase": "rough_set_theory"}, {"score": 0.004466519142879166, "phrase": "unknown_target_concept"}, {"score": 0.004314285113050873, "phrase": "existing_knowledge_structures"}, {"score": 0.0034233569308012982, "phrase": "new_knowledge_structures"}, {"score": 0.0033644530302903513, "phrase": "known_knowledge_structures"}, {"score": 0.003268516165008944, "phrase": "axiom_definition"}, {"score": 0.0032309093154028663, "phrase": "knowledge_granulation"}, {"score": 0.003066945490483524, "phrase": "existing_knowledge_granulations"}, {"score": 0.002548331088496964, "phrase": "distance_space"}, {"score": 0.0023228223366301226, "phrase": "knowledge_discovery"}, {"score": 0.0021921063460682293, "phrase": "granular_computing"}], "paper_keywords": ["Rough set theory", " Granular computing", " Knowledge bases", " Knowledge granulation", " Knowledge distance"], "paper_abstract": "One of the strengths of rough set theory is the fact that an unknown target concept can be approximately characterized by existing knowledge structures in a knowledge base. Knowledge structures in knowledge bases have two categories: complete and incomplete. In this paper, through uniformly expressing these two kinds of knowledge structures, we first address four operators on a knowledge base, which are adequate for generating new knowledge structures through using known knowledge structures. Then, an axiom definition of knowledge granulation in knowledge bases is presented, under which some existing knowledge granulations become its special forms. Finally, we introduce the concept of a knowledge distance for calculating the difference between two knowledge structures in the same knowledge base. Noting that the knowledge distance satisfies the three properties of a distance space on all knowledge structures induced by a given universe. These results will be very helpful for knowledge discovery from knowledge bases and significant for establishing a framework of granular computing in knowledge bases. (c) 2008 Elsevier Inc. All rights reserved.", "paper_title": "Knowledge structure, knowledge granulation and knowledge distance in a knowledge base", "paper_id": "WOS:000263805600014"}