{"auto_keywords": [{"score": 0.03574014227507131, "phrase": "camc"}, {"score": 0.010005349490751013, "phrase": "nhd_metric"}, {"score": 0.004776297980616768, "phrase": "object-oriented_design"}, {"score": 0.0043358695338488445, "phrase": "structured_programming_paradigm"}, {"score": 0.004283739213556286, "phrase": "software_engineering_community"}, {"score": 0.00421520166010848, "phrase": "informal_yet_meaningful_and_understandable_definition"}, {"score": 0.004081385289516914, "phrase": "yourdon"}, {"score": 0.0040485987964882855, "phrase": "constantine"}, {"score": 0.00363080961099728, "phrase": "highly_cohesive_software"}, {"score": 0.0033628397200372905, "phrase": "nhd"}, {"score": 0.003308986613384597, "phrase": "rigorous_mathematical_analysis"}, {"score": 0.0031020367403802773, "phrase": "substantial_arguments"}, {"score": 0.002884603537502399, "phrase": "complete_understanding"}, {"score": 0.00266079124891013, "phrase": "camc_and_nhd_metrics"}, {"score": 0.0024444073418288703, "phrase": "nhd."}, {"score": 0.0023666732429695908, "phrase": "generally_accepted_formal_and_informal_definition"}, {"score": 0.002300681752315682, "phrase": "oo_software_engineering_community"}], "paper_keywords": ["measurement", " theory", " cohesion"], "paper_abstract": "The concept of cohesion in a class has been the subject of various recent empirical studies and has been measured using many different metrics. In the structured programming paradigm, the software engineering community has adopted an informal yet meaningful and understandable definition of cohesion based on the work of Yourdon and Constantine. The object-oriented ( OO) paradigm has formalised various cohesion measures, but the argument over the most meaningful of those metrics continues to be debated. Yet achieving highly cohesive software is fundamental to its comprehension and thus its maintainability. In this article we subject two object-oriented cohesion metrics, CAMC and NHD, to a rigorous mathematical analysis in order to better understand and interpret them. This analysis enables us to offer substantial arguments for preferring the NHD metric to CAMC as a measure of cohesion. Furthermore, we provide a complete understanding of the behaviour of these metrics, enabling us to attach a meaning to the values calculated by the CAMC and NHD metrics. In addition, we introduce a variant of the NHD metric and demonstrate that it has several advantages over CAMC and NHD. While it may be true that a generally accepted formal and informal definition of cohesion continues to elude the OO software engineering community, there seems considerable value in being able to compare, contrast, and interpret metrics which attempt to measure the same features of software.", "paper_title": "The interpretation and utility of three cohesion metrics for object-oriented design", "paper_id": "WOS:000237623700001"}