{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "word_substitutions"}, {"score": 0.00450000390667755, "phrase": "large-scale_surveillance"}, {"score": 0.004267004541988167, "phrase": "intelligence_and_counterterrorism_settings"}, {"score": 0.0025181367444581967, "phrase": "per-sentence_detection_rates"}, {"score": 0.0024818194799172263, "phrase": "false_positive_rates"}, {"score": 0.0023990982005125763, "phrase": "per-sentence_detection"}, {"score": 0.0023759728305710365, "phrase": "per-message_detection"}, {"score": 0.0023303871145705954, "phrase": "false_positive_and_false_negative_rates"}, {"score": 0.0021670777282518424, "phrase": "enron_e-mail"}, {"score": 0.0021049977753042253, "phrase": "informal_and_formal_text"}], "paper_keywords": ["textual analysis", " counterterrorism", " word frequencies", " data mining", " pointwise mutual information", " co-occurrence"], "paper_abstract": "Searching for words on a watchlist is one way in which large-scale surveillance of communication can be done, for example, in intelligence and counterterrorism settings. One obvious defense is to replace words that might attract attention to a message with other more innocuous words. For example, the sentence \"the attack will be tomorrow\" might be altered to \"the complex will be tomorrow,\" since \"complex\" is a word whose frequency is close to that of \"attack.\" Such substitutions are readily detectable by humans since they do not make sense. We address the problem of detecting such substitutions automatically by looking for discrepancies between words and their contexts and using only syntactic information. We define a set of measures, each of which is quite weak, but which together produce per-sentence detection rates around 90 percent with false positive rates around 10 percent. Rules for combining per-sentence detection into per-message detection can reduce the false positive and false negative rates for messages to practical levels. We test the approach using sentences from the Enron e-mail and Brown corpora, representing informal and formal text, respectively.", "paper_title": "Detecting word substitutions in text", "paper_id": "WOS:000256894000007"}