{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "constraint_satisfaction_problems"}, {"score": 0.004698514007994158, "phrase": "artificial_intelligence"}, {"score": 0.004419538941706716, "phrase": "computer_science"}, {"score": 0.004157058883925715, "phrase": "constraint_programming_techniques"}, {"score": 0.003293688299319582, "phrase": "typical_goals"}, {"score": 0.0030414140732789186, "phrase": "clear_relevance"}, {"score": 0.0030043508031729277, "phrase": "dynamic_constraint_satisfaction_problems"}, {"score": 0.0028084079003212947, "phrase": "clear_and_common_definition"}, {"score": 0.0027741761880779535, "phrase": "robustness-related_concepts"}, {"score": 0.0025148871904409095, "phrase": "csp_solutions"}, {"score": 0.0022938068444116827, "phrase": "temporal_csps"}, {"score": 0.002210903392596343, "phrase": "related_well-known_concepts"}], "paper_keywords": ["Constraint satisfaction problems", " Robustness", " Stability", " Dynamic CSPs"], "paper_abstract": "Many real-world problems in Artificial Intelligence (AI) as well as in other areas of computer science and engineering can be efficiently modeled and solved using constraint programming techniques. In many real-world scenarios the problem is partially known, imprecise and dynamic such that some effects of actions are undesired and/or several unforeseen incidences or changes can occur. Whereas expressivity, efficiency, and optimality have been the typical goals in the area, there are several issues regarding robustness that have a clear relevance in dynamic Constraint Satisfaction Problems (CSPs). However, there is still no clear and common definition of robustness-related concepts in CSPs. In this paper, we propose two clearly differentiated definitions for robustness and stability in CSP solutions. We also introduce the concepts of recoverability and reliability, which arise in temporal CSPs. All these definitions are based on related well-known concepts, which are addressed in engineering and other related areas.", "paper_title": "Robustness, stability, recoverability, and reliability in constraint satisfaction problems", "paper_id": "WOS:000359548100009"}