{"auto_keywords": [{"score": 0.048193365666829406, "phrase": "alice"}, {"score": 0.04792523613099411, "phrase": "bob"}, {"score": 0.01852972287287483, "phrase": "aofe"}, {"score": 0.010611556679710869, "phrase": "optimistic_fair_exchange"}, {"score": 0.010551202798155598, "phrase": "digital_signatures"}, {"score": 0.008590755437499346, "phrase": "ofe"}, {"score": 0.0047057084749407485, "phrase": "electronic_contract"}, {"score": 0.0045464538515249085, "phrase": "fair_manner"}, {"score": 0.004507485711694584, "phrase": "interesting_problem"}, {"score": 0.0042928648367867835, "phrase": "efficient_solution"}, {"score": 0.00420747736707902, "phrase": "semi-trusted_third_party"}, {"score": 0.0038492126993451337, "phrase": "ambiguous_ofe"}, {"score": 0.003372844338742438, "phrase": "paofe"}, {"score": 0.0032398798149196432, "phrase": "signer's_full_signature"}, {"score": 0.0031032109441552287, "phrase": "important_applications"}, {"score": 0.0027821617251337304, "phrase": "new_notion"}, {"score": 0.0027662135080370014, "phrase": "privacy-preserving_optimistic_fair_exchange"}, {"score": 0.002382093728856282, "phrase": "corresponding_security_models"}, {"score": 0.0023548511815224098, "phrase": "concrete_and_efficient_construction"}, {"score": 0.002191489192077851, "phrase": "strong_diffie-helliman"}, {"score": 0.0021789194955896124, "phrase": "decision_linear"}, {"score": 0.0021416404045850224, "phrase": "random_oracle_heuristic"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Optimistic Fair Exchange", " Signature", " Ambiguity", " Privacy preserving"], "paper_abstract": "How to sign an electronic contract online between two parties (say Alice and Bob) in a fair manner is an interesting problem, and has been extensively studied for a longtime. Optimistic Fair Exchange (OFE) is an efficient solution to it, in which a semi-trusted third party, named the arbitrator, is responsible for resolving any dispute that may arise during an exchange between Alice and Bob. Recently, several variants of OFE, such as Ambiguous OFE (AOFE) and Perfect AOFE (PAOFE), have been introduced to protect the privacy of Alice and Bob. These primitives prevent any outsider from telling which parties are involved in an exchange of digital signatures before the exchange completes. However, in PAOFE, AOFE and all the existing works on OFE, the arbitrator can always learn the signer's full signature at (or even before) the end of resolution, which is undesirable in some important applications, for example, signing a contract between two parties which do not want others to find out even when there is a dispute that needs resolution by the arbitrator. In this work, we introduce a new notion called Privacy-Preserving Optimistic Fair Exchange ((POFE)-O-2) for protecting the privacy of users, in which other than Alice and Bob, no one else including the arbitrator, can collect any evidence about an exchange between them even after the resolution of a dispute. We formally define (POFE)-O-2 and present the corresponding security models and propose a concrete and efficient construction of (POFE)-O-2. We also discuss about several extensions about implementation. Our scheme is proved to be secure under the given security models based on the Strong Diffie-HellIman and Decision Linear assumptions without relying on the random oracle heuristic. (C) 2015 Elsevier Inc. All rights reserved.", "paper_title": "How to protect privacy in Optimistic Fair Exchange of digital signatures", "paper_id": "WOS:000362380600019"}