{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "diagrammatic_attention_management"}, {"score": 0.004551199992546761, "phrase": "information_systems"}, {"score": 0.00440403952059725, "phrase": "user-system_interaction"}, {"score": 0.004201991568145053, "phrase": "system's_core"}, {"score": 0.003649585593445665, "phrase": "diagram_effectiveness"}, {"score": 0.0033377940531761985, "phrase": "conceptual_models"}, {"score": 0.0031995142224983094, "phrase": "models'_cardinalities"}, {"score": 0.003110515172439764, "phrase": "entity-relationship_diagrams"}, {"score": 0.0030525578912808647, "phrase": "full_transaction_cycle"}, {"score": 0.0029816229984366374, "phrase": "single_page"}, {"score": 0.0025892330566358503, "phrase": "aggregate_diagrammatic_format"}, {"score": 0.002564985233317994, "phrase": "cardinality_validation"}, {"score": 0.0024818877663889813, "phrase": "effective_use"}, {"score": 0.0024586427394152196, "phrase": "aggregate_diagrams"}, {"score": 0.0021049977753042253, "phrase": "external_tool"}], "paper_keywords": ["Diagrammatic Attention Management", " Conceptual Data Models", " Cardinality Validation", " Entity-Relationship Diagrams"], "paper_abstract": "Diagrams are frequently used to document various components of information systems, from the procedures established for user-system interaction, to the structure of the database at the system's core. Past research has revealed that diagrams are not always used as effectively as their creators intend. This study proposes a theory of diagrammatic attention management to contribute to the exploration of diagram effectiveness. Based upon diagrammatic attention management, this study demonstrates that the type of diagram most commonly used to represent conceptual models is less effective than three other alternatives for validating the models' cardinalities. Most conceptual models are documented using entity-relationship diagrams that include a full transaction cycle or module on a single page, i.e., an aggregate diagrammatic format. Participants in this study using three alternative representations (disaggregate diagrammatic, aggregate sentential, and disaggregate sentential) outperformed users of the aggregate diagrammatic format for cardinality validation. Results suggest that to facilitate effective use of aggregate diagrams, users need a mechanism by which to direct their attention while using the diagrams. If such an attention direction mechanism is not inherent in a diagram, it may need to be applied as an external tool, or the diagram may need to be disaggregated to facilitate use.", "paper_title": "Diagrammatic Attention Management and the Effect of Conceptual Model Structure on Cardinality Validation", "paper_id": "WOS:000294994300003"}