{"auto_keywords": [{"score": 0.04925367071541481, "phrase": "cognitive_disabilities"}, {"score": 0.02322730111336097, "phrase": "electronic_communication"}, {"score": 0.00457013354092966, "phrase": "empirical_evidence"}, {"score": 0.0037903327482565097, "phrase": "scientific_literature"}, {"score": 0.0036288825833675127, "phrase": "empirical_studies"}, {"score": 0.0035662378173267647, "phrase": "cognitive_accessibility_measures"}, {"score": 0.003384695931421288, "phrase": "methodological_quality"}, {"score": 0.0031568884810273226, "phrase": "twenty-nine_articles"}, {"score": 0.003129509028432954, "phrase": "considerable_variations"}, {"score": 0.0031023662967184216, "phrase": "studied_accessibility_measures"}, {"score": 0.0030223381739019894, "phrase": "outcome_measures"}, {"score": 0.0024950747439601863, "phrase": "current_evidence_base"}, {"score": 0.0022472527731744974, "phrase": "accessibility_guidelines"}, {"score": 0.002151388538895855, "phrase": "effective_accessibility_measures"}, {"score": 0.0021049977753042253, "phrase": "current_knowledge_gaps"}], "paper_keywords": ["Accessibility", " Cognitive disabilities", " Communication", " ICT", " Usability"], "paper_abstract": "The purpose of this study was to identify and synthesize measures for accessibility to electronic communication for people with cognitive disabilities by seeking answers to the following research questions: What measures to make electronic communication accessible to people with cognitive disabilities are evaluated and reported in the scientific literature? What documented effects do these measures have? Empirical studies describing and assessing cognitive accessibility measures were identified by searches of 13 databases. Data were extracted and methodological quality was assessed. Findings were analyzed and recommendations for practice and research were made. Twenty-nine articles with considerable variations in studied accessibility measures, diagnoses, methods, outcome measures, and quality were included. They address the use of Internet, e-mail, telephone, chat, television, multimedia interfaces, texts and pictures, operation of equipment, and entering of information. Although thin, the current evidence base indicates that the accessibility needs, requirements, and preferences of people with cognitive disabilities are diverse. This ought to be reflected in accessibility guidelines and standards. Studies to systematically develop and recommend effective accessibility measures are needed to address current knowledge gaps.", "paper_title": "Accessibility to electronic communication for people with cognitive disabilities: a systematic search and review of empirical evidence", "paper_id": "WOS:000361003800007"}