{"auto_keywords": [{"score": 0.0453665111651286, "phrase": "neurois"}, {"score": 0.005258892563710507, "phrase": "computer-based_task"}, {"score": 0.00481495049065317, "phrase": "neurois-alternative"}, {"score": 0.004755054742217193, "phrase": "existing_methods"}, {"score": 0.004681226806682058, "phrase": "self-reported_data"}, {"score": 0.004608539830653038, "phrase": "technostress_research"}, {"score": 0.004579780586951551, "phrase": "recent_research"}, {"score": 0.004522796947899013, "phrase": "strong_case"}, {"score": 0.004452558960552103, "phrase": "neurois_methods"}, {"score": 0.004288386935585756, "phrase": "improved_explanation"}, {"score": 0.003576013525113198, "phrase": "different_dimensions"}, {"score": 0.0030097975788892896, "phrase": "triangulation_approach"}, {"score": 0.002818013056816282, "phrase": "different_aspects"}, {"score": 0.0026467041118198977, "phrase": "theoretically-related_outcome"}, {"score": 0.002493592357827492, "phrase": "psychological_and_a_physiological_measure"}, {"score": 0.002327310963701377, "phrase": "physiological_stress_measure"}, {"score": 0.002158505888557746, "phrase": "self-reported_stress_measure"}, {"score": 0.0021049977753042253, "phrase": "critical_complement"}], "paper_keywords": ["NeuroIS", " Technostress", " Correlation", " Neuroscience", " Self-reports", " Triangulation"], "paper_abstract": "Recent research has made a strong case for the importance of NeuroIS methods for IS research. It has suggested that NeuroIS contributes to an improved explanation and prediction of IS phenomena. Yet, such research is unclear on the source of this improvement; while some studies indicate that NeuroIS constitutes an alternative to psychometrics, implying that the two methods assess the same dimension of an underlying IS construct, other studies indicate that NeuroIS constitutes a complement to psychometrics, implying that the two methods assess different dimensions of an IS construct. To clarify the role of NeuroIS in IS research and its contribution to IS research, in this study, we examine whether NeuroIS and psychometrics/psychological methods constitute alternatives or complements. We conduct this examination in the context of technostress, an emerging IS phenomenon to which both methods are relevant. We use the triangulation approach to explore the relationship between physiological and psychological/self-reported data. Using this approach, we argue that both kinds of data tap into different aspects of technostress and that, together, they can yield a more complete or holistic understanding of the impact of technostress on a theoretically-related outcome, rendering them complements. Then, we test this proposition empirically by probing the correlation between a psychological and a physiological measure of technostress in combination with an examination of their incremental validity in explaining performance on a computer-based task. The results show that the physiological stress measure (salivary alpha-amylase) explains and predicts variance in performance on the computer-based task over and above the prediction afforded by the self-reported stress measure. We conclude that NeuroIS is a critical complement to IS research.", "paper_title": "NeuroIS-Alternative or Complement to Existing Methods? Illustrating the Holistic Effects of Neuroscience and Self-Reported Data in the Context of Technostress Research", "paper_id": "WOS:000345064000004"}