{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "cross-collection_map_inference"}, {"score": 0.004779876533667754, "phrase": "intrinsic_alignment_of_shape_spaces"}, {"score": 0.004642105253191792, "phrase": "long_standing_problem"}, {"score": 0.004608284537368354, "phrase": "geometry_processing"}, {"score": 0.004025040955430234, "phrase": "e._g."}, {"score": 0.0032552377213294604, "phrase": "cross-collection_map"}, {"score": 0.003161271802988128, "phrase": "functional_correspondence"}, {"score": 0.0030253688063143157, "phrase": "bijective_point"}, {"score": 0.0029813748433158032, "phrase": "point_map"}, {"score": 0.0028014064098604093, "phrase": "low-dimensional_shape-space_manifold"}, {"score": 0.0027006464509273806, "phrase": "low-dimensional_euclidean_embedding"}, {"score": 0.0026035011274172753, "phrase": "shape-space_manifold"}, {"score": 0.0025562434609873335, "phrase": "recently_introduced_shape_differences"}, {"score": 0.002500662348528587, "phrase": "similar_low-dimensional_structure"}, {"score": 0.002323953608863511, "phrase": "standard_affine_registration"}, {"score": 0.0022239665922395104, "phrase": "functional_cross-map"}, {"score": 0.0021996478802839316, "phrase": "linear_solve"}], "paper_keywords": [""], "paper_abstract": "Inferring maps between shapes is a long standing problem in geometry processing. The less similar the shapes are, the harder it is to compute a map, or even define criteria to evaluate it. In many cases, shapes appear as part of a collection, e. g. an animation or a series of faces or poses of the same character, where the shapes are similar enough, such that maps within the collection are easy to obtain. Our main observation is that given two collections of shapes whose \"shape space\" structure is similar, it is possible to find a correspondence between the collections, and then compute a cross-collection map. The cross-map is given as a functional correspondence, and thus it is more appropriate in cases where a bijective point-to-point map is not well defined. Our core idea is to treat each collection as a point-sampling from a low-dimensional shape-space manifold, and use dimensionality reduction techniques to find a low-dimensional Euclidean embedding of this sampling. To measure distances on the shape-space manifold, we use the recently introduced shape differences, which lead to a similar low-dimensional structure of the shape spaces, even if the shapes themselves are quite different. This allows us to use standard affine registration for point-clouds to align the shape-spaces, and then find a functional cross-map using a linear solve. We demonstrate the results of our algorithm on various shape collections and discuss its properties.", "paper_title": "Cross-Collection Map Inference by Intrinsic Alignment of Shape Spaces", "paper_id": "WOS:000341128900028"}