{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "h_index"}, {"score": 0.010455607574767102, "phrase": "h_index_variants"}, {"score": 0.0046394362688524475, "phrase": "first_meta-analysis"}, {"score": 0.004267468074128779, "phrase": "g_index"}, {"score": 0.003961842092184655, "phrase": "high_correlation"}, {"score": 0.0037296509687792865, "phrase": "added_information"}, {"score": 0.0034303736977646135, "phrase": "total_sample_size"}, {"score": 0.0032292292848296617, "phrase": "sample_size"}, {"score": 0.0030825404960282713, "phrase": "three-level_cross-classified_mixed-effects_meta-analysis_show"}, {"score": 0.0028350413546400703, "phrase": "mean_correlation_coefficient"}, {"score": 0.0025592969422491476, "phrase": "statistically_significant_study-to-study_variation"}, {"score": 0.002420339995088838, "phrase": "lowest_correlation"}, {"score": 0.002195033004022173, "phrase": "non-redundant_contribution"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["h index", " h index variants", " Meta-analysis", " Multilevel analysis"], "paper_abstract": "This paper presents the first meta-analysis of studies that computed correlations between the h index and variants of the h index (such as the g index; in total 37 different variants) that have been proposed and discussed in the literature. A high correlation between the h index and its variants would indicate that the h index variants hardly provide added information to the h index. This meta-analysis included 135 correlation coefficients from 32 studies. The studies were based on a total sample size of N = 9005; on average, each study had a sample size of n = 257. The results of a three-level cross-classified mixed-effects meta-analysis show a high correlation between the h index and its variants: Depending on the model, the mean correlation coefficient varies between 8 and 9. This means that there is redundancy between most of the h index variants and the h index. There is a statistically significant study-to-study variation of the correlation coefficients in the information they yield. The lowest correlation coefficients with the h index are found for the h index variants MII and m index. Hence, these h index variants make a non-redundant contribution to the h index. (C) 2011 Elsevier Ltd. All rights reserved.", "paper_title": "A multilevel meta-analysis of studies reporting correlations between the h index and 37 different h index variants", "paper_id": "WOS:000291032500003"}