{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "internet_marketing"}, {"score": 0.04915532646265492, "phrase": "south_koreans"}, {"score": 0.015538987963362581, "phrase": "malaysians"}, {"score": 0.008317118895953898, "phrase": "pilot_study"}, {"score": 0.004384960761826366, "phrase": "interne_marketing"}, {"score": 0.004040211152784802, "phrase": "rapid_growth"}, {"score": 0.004008820473628357, "phrase": "world_wide_web"}, {"score": 0.0037957839728524046, "phrase": "increasing_trend"}, {"score": 0.003483573659272443, "phrase": "unified_theory"}, {"score": 0.0033633514001658086, "phrase": "underpinning_theory"}, {"score": 0.003196960816092101, "phrase": "convenience_sampling_method"}, {"score": 0.0030745737579268876, "phrase": "self-reporting_questionnaires"}, {"score": 0.002968476966276238, "phrase": "english"}, {"score": 0.0029453365339797933, "phrase": "hangul"}, {"score": 0.0029110398328258194, "phrase": "accurate_responses"}, {"score": 0.002821516317503421, "phrase": "different_factors"}, {"score": 0.002579140290642792, "phrase": "future_research_directions"}, {"score": 0.0025292620341476283, "phrase": "actual_scientific_study"}, {"score": 0.0023209828061385596, "phrase": "internet_marketing's_increased_adoption"}, {"score": 0.0022146817879683204, "phrase": "policy_makers"}, {"score": 0.002146527342660575, "phrase": "internet_marketing_acceptance"}, {"score": 0.0021049977753042253, "phrase": "young_malaysians"}], "paper_keywords": ["Information technology", " World Wide Web", " Malaysia", " Cybernetics", " Business systems", " Statistical analysis", " Internet marketing", " Unified theory of acceptance and use of technology", " Young users", " South Korea"], "paper_abstract": "Purpose - This is a pilot study that aims to investigate the factors influencing the intention to use interne marketing among Malaysians and South Koreans, the two fast developing Asian countries with good internet infrastructure. Many businesses in these countries have leveraged on the rapid growth of World Wide Web by investing in internet marketing due to the anticipation that its acceptance and usage rates are on the increasing trend. However, the extent of intent to use internet marketing remains a question of interest. Design/methodology/approach - This research adopts unified theory of acceptance and use of technology as the underpinning theory to assess the intention to use internet marketing. Data were collected using convenience sampling method from 150 Malaysians and 150 South Koreans through the use of self-reporting questionnaires. The questionnaire was prepared in two languages, English and Hangul to obtain accurate responses. Findings - The findings suggest that different factors affect intentions to use internet marketing between Malaysians and South Koreans. Research limitations/implications - This is a pilot study and due to its exploratory nature, future research directions are provided for an actual scientific study to be conducted. Practical implications - The results inform various stakeholders in the two countries and recommend strategies from the perspective of internet marketing's increased adoption. Originality/value - The theoretical and practical contributions of this paper are articulated to guide organizations and policy makers in terms of the strategies to increase internet marketing acceptance and use among the young Malaysians and South Koreans.", "paper_title": "Intention to use internet marketing A comparative study between Malaysians and South Koreans", "paper_id": "WOS:000325039300004"}