{"auto_keywords": [{"score": 0.0430924877003789, "phrase": "electric_images"}, {"score": 0.015719716506582538, "phrase": "electric_fish"}, {"score": 0.015425145384343777, "phrase": "naturalistic_inputs"}, {"score": 0.004687891819245081, "phrase": "weakly"}, {"score": 0.004494570360108983, "phrase": "spatial_and_temporal_patterns"}, {"score": 0.004022451267521423, "phrase": "present_study"}, {"score": 0.003946195919158241, "phrase": "conspecific_fish"}, {"score": 0.0038418515481939463, "phrase": "electric_fields"}, {"score": 0.003711723285313348, "phrase": "spatially_varying_profiles"}, {"score": 0.0035179764329354877, "phrase": "electrosensory-mediated_behaviours"}, {"score": 0.0034512514926836667, "phrase": "jamming_avoidance_response"}, {"score": 0.0032585499655442404, "phrase": "biophysically_realistic_model"}, {"score": 0.0031360786664165093, "phrase": "genetic_algorithm"}, {"score": 0.0030530895634491343, "phrase": "electric_field"}, {"score": 0.003018196463874475, "phrase": "real_fish"}, {"score": 0.0027424619603260837, "phrase": "beat_cycle"}, {"score": 0.0023981301755351607, "phrase": "common_stimulation_paradigm"}, {"score": 0.002325689073229477, "phrase": "vivo_electrophysiological_experiments"}, {"score": 0.0022815262950738814, "phrase": "transverse_arrangement"}, {"score": 0.0021622717349518744, "phrase": "important_qualitative_features"}], "paper_keywords": ["electrosensory system", " weakly electric fish", " finite-element modeling"], "paper_abstract": "Weakly electric fish acquire information about their surroundings by detecting and interpreting the spatial and temporal patterns of electric potential across their skin, caused by perturbations in a self-generated, oscillating electric field. Computational and experimental studies have focused on understanding the electric images due to simple, passive objects. The present study considers electric images of a conspecific fish. It is known that the electric fields of two fish interact to produce beats with spatially varying profiles of amplitude and phase. Such patterns have been shown to be critical for electrosensory-mediated behaviours, such as the jamming avoidance response, but they have yet to be well described. We have created a biophysically realistic model of a wave-type weakly electric fish by using a genetic algorithm to calibrate the parameters to the electric field of a real fish. We use the model to study a pair of fish and compute the electric images of one fish onto the other at three representative phases within a beat cycle. Analysis of the images reveals rostral/caudal and ipsilateral/contralateral patterns of amplitude and phase that have implications for localization of conspecifics (both position and orientation) and communication between conspecifics. We then show how the common stimulation paradigm used to mimic a conspecific during in vivo electrophysiological experiments, based on a transverse arrangement of two electrodes, can be improved in order to more accurately reflect the important qualitative features of naturalistic inputs, as revealed by our model.", "paper_title": "Electric field interactions in pairs of electric fish: modeling and mimicking naturalistic inputs", "paper_id": "WOS:000256079900004"}