{"auto_keywords": [{"score": 0.04682648206734893, "phrase": "secret_key"}, {"score": 0.03310342048452109, "phrase": "leakage_rate"}, {"score": 0.00481495049065317, "phrase": "public-key_encryption_scheme"}, {"score": 0.004775335634705251, "phrase": "high_leakage-resilience"}, {"score": 0.004132312946154097, "phrase": "almost_all_the_constructions"}, {"score": 0.004064548693812535, "phrase": "important_building_block"}, {"score": 0.003820144626025562, "phrase": "adaptive_chosen-ciphertext_attacks"}, {"score": 0.0035461111918923117, "phrase": "unsatisfactory_leakage_rate"}, {"score": 0.0034024277222012597, "phrase": "new_method"}, {"score": 0.0032109670662222416, "phrase": "striking_advantage"}, {"score": 0.003171358146412577, "phrase": "authors_scheme"}, {"score": 0.002883439044844259, "phrase": "n-linear_assumption"}, {"score": 0.002643386043540555, "phrase": "decisional_diffie-hellman"}, {"score": 0.0023346234464901978, "phrase": "ddh-based_scheme"}, {"score": 0.002305799666781492, "phrase": "best_leakage_rate"}, {"score": 0.002267922887363676, "phrase": "ddh"}, {"score": 0.0022306602656266545, "phrase": "cramer-shoup-type"}], "paper_keywords": [""], "paper_abstract": "A leakage-resilient public-key encryption (PKE) scheme provides security even if an adversary obtains some information on the secret key. In recent years, much attention has been focused on designing provably secure PKE in the presence of key-leakage and almost all the constructions rely on an important building block namely hash proof system (HPS). However, in the setting of adaptive chosen-ciphertext attacks (CCA2), there are not many HPS-based leakage-resilient PKE schemes available. Moreover, most of them have an unsatisfactory leakage rate. In this study, the authors propose a new method of constructing leakage-resilient CCA2-secure PKE scheme from any tag-based strongly universal(2) HPS. The striking advantage of the authors scheme is the leakage rate, which is the best one among all known HPS-based indistinguishability key leakage CCA2-secure constructions. In particular, they present an instantiation under the n-linear assumption. In the cases of n = 1 (resp. n = 2), they actually obtain a decisional Diffie-Hellman (DDH)-based [resp. decisional linear (DLIN)-based] PKE scheme, where the leakage rate can be made to 1/4 (resp. 1/6). The authors DDH-based scheme achieves the best leakage rate among all known DDH-based (Cramer-Shoup-type) schemes. Their DLIN-based scheme is the first one that can achieve leakage of L/6 bits without pairing, where L is the length of the secret key.", "paper_title": "Efficient chosen-ciphertext secure public-key encryption scheme with high leakage-resilience", "paper_id": "WOS:000346251500004"}