{"auto_keywords": [{"score": 0.049230040507182285, "phrase": "organizational_factors"}, {"score": 0.0045225925147033205, "phrase": "women's_retention"}, {"score": 0.004324650333875634, "phrase": "unilateral_effect"}, {"score": 0.004172526471885961, "phrase": "alternative_view"}, {"score": 0.004013733930501799, "phrase": "rich_insights"}, {"score": 0.003977952748523497, "phrase": "gender_imbalance"}, {"score": 0.003907340732073545, "phrase": "individual_differences_theory"}, {"score": 0.0037811124250339335, "phrase": "organizational_influences"}, {"score": 0.003691869399440961, "phrase": "in-depth_interviews"}, {"score": 0.0035301568867729576, "phrase": "-life_balance"}, {"score": 0.003509135412622647, "phrase": "organizational_climate"}, {"score": 0.0033155501248770375, "phrase": "new_light"}, {"score": 0.0032276039113189286, "phrase": "contradictory_findings"}, {"score": 0.002959735028884561, "phrase": "deeper_understanding"}, {"score": 0.0029421002892899015, "phrase": "gender_relations"}, {"score": 0.002649912326113783, "phrase": "individual_identity"}, {"score": 0.0025872989069543892, "phrase": "woman's_demographic_and_professional_characteristics"}, {"score": 0.002533723901680123, "phrase": "individual_influences"}, {"score": 0.002518621016346282, "phrase": "focused_attention"}, {"score": 0.0024226175164573406, "phrase": "influential_people"}, {"score": 0.0024081753091661396, "phrase": "one's_career"}, {"score": 0.0023724444453105983, "phrase": "environmental_influences"}, {"score": 0.002351260304188475, "phrase": "contextual_influences"}, {"score": 0.0023372424895785103, "phrase": "women's_participation"}, {"score": 0.0021049977753042253, "phrase": "european_journal_of_information_systems"}], "paper_keywords": ["gender and IT", " women and IT workforce", " mentoring", " work-life balance", " organizational climate", " individual differences theory of gender and IT"], "paper_abstract": "The challenge of meeting the demand for information technology (IT) workers is addressed by examining three important organizational factors that affect women's retention in the IT field. Much of the research on gender and IT assumes a unilateral effect: all organizational factors affect all women in the same ways. An alternative view that is explored in this research is that within-gender differences offer rich insights into the gender imbalance in the IT profession. The individual differences theory of gender and IT enabled us to examine variation in organizational influences on women through analysis of transcripts from in-depth interviews conducted with 92 women in the IT workforce in the U. S. A. The results show that three organizational factors work-life balance, organizational climate, and mentoring - affected the women's career development in a range of ways. Our findings shed new light on what has been interpreted by other researchers as contradictory findings because our theoretical starting point is the assumption that women are not all the same, that within-gender variation is expected and that it provides an opportunity to develop a deeper understanding of gender relations in the IT field. Using this theory we were able to identify opportunities for the development of interventions by linking the themes embedded in the three workplace factors to the constructs of the theory. The individual identity construct revealed the ways in which a woman's demographic and professional characteristics affect her career choices. The individual influences construct focused attention on the ways in which differences in personality, abilities, and influential people shape one's career. Finally, the environmental influences construct characterized contextual influences on women's participation in the IT profession. Our findings show that both research and interventions directed at increasing the retention of women must be flexible enough to respond to the variation that exists among women and within IT workplaces. European Journal of Information Systems (2009) 18, 476-497. doi:10.1057/ejis.2009.31; published online 27 October 2009", "paper_title": "Retaining women in the US IT workforce: theorizing the influence of organizational factors", "paper_id": "WOS:000272248400008"}