{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "cpoe_system"}, {"score": 0.004779406424192843, "phrase": "nurse-physician_communication_a_mixed_method_study"}, {"score": 0.004571559854487074, "phrase": "medication-related_communication"}, {"score": 0.004421601997620278, "phrase": "six_internal_medicine_wards"}, {"score": 0.004372712391262538, "phrase": "academic_medical_center"}, {"score": 0.004260719592945006, "phrase": "nurses'_attitudes"}, {"score": 0.004167001961564886, "phrase": "paper-based_medication_system"}, {"score": 0.004105667147116071, "phrase": "cpoe"}, {"score": 0.0038122196479548425, "phrase": "bonferroni_correction"}, {"score": 0.003784049616066444, "phrase": "nine_nurses"}, {"score": 0.0037560869590718966, "phrase": "six_physicians"}, {"score": 0.003423445743298995, "phrase": "total_response_rates"}, {"score": 0.0033480826365657303, "phrase": "pre-_and_post-implementation_questionnaires"}, {"score": 0.0030514638431036714, "phrase": "administration_system"}, {"score": 0.00265987582861194, "phrase": "communication_problems"}, {"score": 0.0026012779346272848, "phrase": "medication_work"}, {"score": 0.0024512358145634336, "phrase": "informal_interactions"}, {"score": 0.002344398099179438, "phrase": "medication_errors"}, {"score": 0.002267329954548889, "phrase": "paper-based_medication_administration_system"}, {"score": 0.0021684903968454267, "phrase": "result_error-inducing_conditions"}, {"score": 0.0021049977753042253, "phrase": "cpoe_systems"}], "paper_keywords": ["CPOE", " interoperability", " patient safety", " medication error", " workaround"], "paper_abstract": "Objectives: To assess the impact of a CPOE system on medication-related communication of nurses and physicians. Methods: In six internal medicine wards of an academic medical center, two questionnaires were used to evaluate nurses' attitudes toward the impact of a paper-based medication system and then a CPOE system on their communication in medication-related-activities (medication work). The questionnaires were analyzed using t-tests, followed by Bonferroni correction. Nine nurses and six physicians in the same wards were interviewed after the implementation to determine how their communication and their work have been impacted by the system. Results: The total response rates were 54% and 52% for pre- and post-implementation questionnaires. it was shown that after implementation, the legibility and completeness of prescriptions were significantly improved (P <.001) and the administration system had a more intelligible layout (P <.001), with a more reliable overview (P <.001). The analysis of the interviews supported and confirmed the findings of the surveys. Moreover, they showed communication problems that caused difficulties in integrating medication work of nurses into physicians'. To compensate for these, nurses and physicians devised informal interactions and practices (workarounds), which often represented risks for medication errors. Conclusion: The introduction of CPOE system with paper-based medication administration system improved prescription legibility and completeness but introduced many workflow impediments and as a result error-inducing conditions. In order to prevent such an effect, CPOE systems have to support the level of communication which is necessary to integrate the work of nurses and physicians.", "paper_title": "Evaluation of the Impact of a CPOE System on Nurse-physician Communication A Mixed Method Study", "paper_id": "WOS:000269435700009"}