{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "intelligent_agents"}, {"score": 0.004734448316824488, "phrase": "cultural_processes"}, {"score": 0.004681525814235883, "phrase": "remarkable_powers"}, {"score": 0.004400804926266097, "phrase": "g.p._murdock"}, {"score": 0.004230956171850591, "phrase": "social_structure"}, {"score": 0.004160177106153782, "phrase": "divine_law"}, {"score": 0.0036347979916389467, "phrase": "local_minima"}, {"score": 0.0033405704229694656, "phrase": "material_and_behavioural_contexts"}, {"score": 0.003175556211659149, "phrase": "behavioural_terms"}, {"score": 0.003070086433952691, "phrase": "large_part"}, {"score": 0.003035711716881469, "phrase": "'invented'_symbolic_constructions"}, {"score": 0.0022906498741695094, "phrase": "culture_design_criteria"}, {"score": 0.0021896891011033105, "phrase": "agent-based_models"}, {"score": 0.0021529842700733974, "phrase": "culture-based_solutions"}], "paper_keywords": [""], "paper_abstract": "Intelligent agents embedded in cultural processes demonstrate remarkable powers of creation, transformation, stability and regulation. As G.P. Murdock said in his 1971 Huxley Lecture, culture and social structure are not divine law within which individuals simply satisfy their assigned objectives and then die. Culture gives agents the power to hyper-adapt: not only can they achieve local minima and maxima, they modify or create the conditions for adaptation. Culture transcends material and behavioural contexts. Cultural solutions are instantiated in material and behavioural terms, but are based in large part on 'invented' symbolic constructions of the interaction space and its elements. Although the level of 'intelligence' required to enact culture is relatively high, agents that enact culture create conditions to which other, less intelligent, agents will also adapt. A little culture goes a long way. We will consider culture design criteria and how these can be represented in agent-based models and how culture-based solutions might contribute to our global management of knowledge.", "paper_title": "Cultural agents: A community of minds", "paper_id": "WOS:000238506800016"}