{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "supply_chains"}, {"score": 0.03697221637235307, "phrase": "customer_sensitivity"}, {"score": 0.007679283002747622, "phrase": "risk_alleviation_competency_dimension"}, {"score": 0.006967845732795529, "phrase": "suitable_supply_chain_strategy"}, {"score": 0.005897284477184405, "phrase": "risk_alleviation_competency"}, {"score": 0.004726382602809228, "phrase": "customer_sensitivity_dimensions"}, {"score": 0.003943481134959376, "phrase": "fast_changing_customer_preferences"}, {"score": 0.003446353878654566, "phrase": "graph_theoretic_approach"}, {"score": 0.003244275497488318, "phrase": "proposed_model"}, {"score": 0.0028087949095629955, "phrase": "practical_implications_-_suggested_model"}, {"score": 0.0025592969422491476, "phrase": "market_requirements"}, {"score": 0.0021545524633190985, "phrase": "novel_effort"}, {"score": 0.0021049977753042253, "phrase": "supply_chain_management"}], "paper_keywords": ["supply chain management", " risk management", " consumer behaviour"], "paper_abstract": "Purpose - With the emergence of the concepts of lean, agile and leagile paradigms for supply chains, organizations have little idea as to which model suits them based on the their supply chain's ability to counter risks and take on the challenges of the fast changing customer preferences. This paper aims to map supply chains on these two dimensions. Design/methodology/approach - A model is proposed by which suitable supply chain strategy can be selected based on customer sensitivity and risk alleviation competency dimension. Graph theoretic approach is applied to quantify these dimensions for three case supply chains. Findings - The proposed model was tested for three Indian SMEs clusters and suitable supply chain strategy was suggested. Research limitations/implications - It is recommended that the model be tested for those supply chains which have established themselves as lean, agile or leagile entities. Practical implications - Suggested model would help organizations to select suitable supply chain strategy based on customer sensitivity and risk alleviation competency and the transition required in tune with the market requirements in which they operate. Also the areas which need improvements from the perspective of risk alleviation competency or customer sensitivity can be easily delineated. Originality/value - Mapping supply chains based on quantification of customer sensitivity and risk alleviation competency dimension is a novel effort in the area of supply chain management.", "paper_title": "Mapping supply chains on risk and customer sensitivity dimensions", "paper_id": "WOS:000239331700016"}