{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "medical_problems"}, {"score": 0.004761850836420121, "phrase": "electronic_clinical_documents"}, {"score": 0.004381749459671914, "phrase": "natural_language_processing"}, {"score": 0.004145287175409325, "phrase": "narrative_text_clinical_documents"}, {"score": 0.003987367359722647, "phrase": "patient's_electronic_medical_record"}, {"score": 0.0037721073763702486, "phrase": "patient's_electronic_problem_list"}, {"score": 0.0035486713647627246, "phrase": "problem_list"}, {"score": 0.0032290277960438855, "phrase": "nlp_part"}, {"score": 0.002905629026254221, "phrase": "negex"}, {"score": 0.0024323098907299027, "phrase": "custom_data_subset"}, {"score": 0.0022007302738063566, "phrase": "non-significant_reduction"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["medical records", " problem oriented", " Natural Language Processing", " MetaMap Transfer", " NegEx", " program evaluation"], "paper_abstract": "In this study, we evaluate the performance of a Natural Language Processing (NLP) application designed to extract medical problems from narrative text clinical documents. The documents come from a patient's electronic medical record and medical problems are proposed for inclusion in the patient's electronic problem list. This application has been developed to help maintain the problem list and make it more accurate, complete, and up-to-date. The NLP part of this system-analyzed in this study-uses the UMLS MetaMap Transfer (MMTx) application and a negation detection algorithm called NegEx to extract 80 different medical problems selected for their frequency of use in our institution. When using MMTx with its default data set, we measured a recall of 0.74 and a precision of 0.756. A custom data subset for MMTx was created, making it faster and significantly improving the recall to 0.896 with a non-significant reduction in precision. (c) 2005 Elsevier Inc. All rights reserved.", "paper_title": "Natural language processing to extract medical problems from electronic clinical documents: Performance evaluation", "paper_id": "WOS:000242881900002"}