{"auto_keywords": [{"score": 0.03326503286645552, "phrase": "semantic-based_search_schema"}, {"score": 0.012077242532981352, "phrase": "slhp"}, {"score": 0.011894633580015001, "phrase": "semantic_similarity"}, {"score": 0.011363018086106479, "phrase": "physical_distance"}, {"score": 0.009955679785365762, "phrase": "super_peers"}, {"score": 0.0047174256688408064, "phrase": "distributed_resources"}, {"score": 0.0046813628851623676, "phrase": "critical_issue"}, {"score": 0.004482129830695465, "phrase": "overlay_network"}, {"score": 0.004436491795663639, "phrase": "key_factors"}, {"score": 0.00436890075128947, "phrase": "resource_search"}, {"score": 0.004098133997961539, "phrase": "underlying_physical_network"}, {"score": 0.004015069420294224, "phrase": "similar_shared_resources"}, {"score": 0.0039945666268426175, "phrase": "similar_requirements"}, {"score": 0.003746912275953477, "phrase": "multi-root_mechanism"}, {"score": 0.0037087324991876727, "phrase": "single_point_failure"}, {"score": 0.0036615523899977, "phrase": "physical_locality"}, {"score": 0.0036057249778792388, "phrase": "shared_resource"}, {"score": 0.003339057317013372, "phrase": "similar_shared_resource"}, {"score": 0.0032713278333553713, "phrase": "rtt_value"}, {"score": 0.0032296940668146085, "phrase": "calculation_method"}, {"score": 0.0029001870731706113, "phrase": "query_keyword"}, {"score": 0.0027271775266309276, "phrase": "existed_resource"}, {"score": 0.002671826148752874, "phrase": "semantic-based_search"}, {"score": 0.002624313608060807, "phrase": "transferred_messages"}, {"score": 0.0025975429096261452, "phrase": "standard_flooding_scheme"}, {"score": 0.0025578967205807843, "phrase": "k_messages"}, {"score": 0.0024740551031012348, "phrase": "routing_indices"}, {"score": 0.002392955016407507, "phrase": "entire_overlay_network"}, {"score": 0.002374619461040196, "phrase": "hit_ratio"}, {"score": 0.002221469763906748, "phrase": "key_features"}, {"score": 0.002204445277617949, "phrase": "network_topology"}, {"score": 0.0021931680053401963, "phrase": "semantic-based_search_algorithm"}, {"score": 0.002132164171546183, "phrase": "search_space"}, {"score": 0.0021049977753042253, "phrase": "good_tradeoff"}], "paper_keywords": [""], "paper_abstract": "How to efficiently organize and manage distributed resources is a critical issue of P2P systems. In this paper, we focus on both the P2P search mechanism and the topology structure of overlay network which are the key factors to dominate the performance of resource search and discovery. We mostly concern these issues as follows. Heterogeneity of nodes in P2P networks. Topology match between the P2P overlay network and the underlying physical network. In general, most peers that hold similar shared resources have similar requirements. We consider all the factors mentioned above, and propose a semantic-based and locality-aware hybrid P2P architecture (SLHP) including the method of model construction and maintenance and the multi-root mechanism to avoid the single point failure. SLHP considers the physical locality and the semantic similarity of the shared resource at the same time, in which nodes are clustered into domains according to the physical distance, and the nodes in a domain are clustered into groups according to the similar shared resource. The physical distance is measured by the RTT value of two peers. The calculation method of semantic similarity is also given. And then a semantic-based search schema is proposed. When the search occurs, the query is forwarded to super peers, and among super peers the query is forwarded to the neighbors who have the most similar shared resource with the query keyword. We also give a proof that according to the algorithm of construction and maintenance of SLHP, it is ensured that the existed resource must be found in theory. The semantic-based search can reduce the number of the transferred messages comparing with the standard flooding scheme, since it only produces k messages each hop, and forward to the most expected peers. Along with the routing indices being optimized continuously, which represents the knowledge of nodes about the entire overlay network, the hit ratio can be improved. Finally, in order to evaluate the performance of semantic-based search schema, three sets of simulations are set up to evaluate the key features of the network topology and semantic-based search algorithm. Experimental results show that the semantic-based search schema can reduce the search space, and get a good tradeoff between the performance and the overhead.", "paper_title": "An Efficient Semantic-Based Search Schema in Unstructured P2P Network", "paper_id": "WOS:000265103800071"}