{"auto_keywords": [{"score": 0.033355472785078534, "phrase": "inter-event_times"}, {"score": 0.00481495049065317, "phrase": "universal_and_distinct_properties_of_communication_dynamics"}, {"score": 0.004731754442072492, "phrase": "realistic_inter-event_times"}, {"score": 0.004633805690244912, "phrase": "information_systems"}, {"score": 0.0037326500020622715, "phrase": "phone_calls"}, {"score": 0.0037066895459425824, "phrase": "text_messages"}, {"score": 0.0035176353680157367, "phrase": "fundamental_aspect"}, {"score": 0.003480993634130542, "phrase": "new_era"}, {"score": 0.0033615796302502547, "phrase": "different_technologies"}, {"score": 0.0032689949867583633, "phrase": "universal_patterns"}, {"score": 0.003234934827553253, "phrase": "inter-event_time_distribution"}, {"score": 0.0031130463625133496, "phrase": "particular_technologies"}, {"score": 0.0030167329549240078, "phrase": "eight_different_datasets"}, {"score": 0.002995736705764765, "phrase": "real_andmodern_communication_data"}, {"score": 0.0026977310405574585, "phrase": "sfp"}, {"score": 0.0026696020591118344, "phrase": "extremely_parsimonious_point_process"}, {"score": 0.002387214876538434, "phrase": "synthetic_dataset"}, {"score": 0.002370589610989257, "phrase": "realistic_communication_events"}, {"score": 0.0023214036848949876, "phrase": "analyzed_means"}, {"score": 0.0022105600003496225, "phrase": "building_block"}, {"score": 0.0021049977753042253, "phrase": "analyzed_systems"}], "paper_keywords": ["Theory", " Communication dynamics", " inter-event times", " generative model"], "paper_abstract": "With the advancement of information systems, means of communications are becoming cheaper, faster, and more available. Today, millions of people carrying smartphones or tablets are able to communicate practically any time and anywhere they want. They can access their e-mails, comment on weblogs, watch and post videos and photos (as well as comment on them), and make phone calls or text messages almost ubiquitously. Given this scenario, in this article, we tackle a fundamental aspect of this new era of communication: How the time intervals between communication events behave for different technologies and means of communications. Are there universal patterns for the Inter-Event Time Distribution (IED)? How do inter-event times behave differently among particular technologies? To answer these questions, we analyzed eight different datasets from real andmodern communication data and found four well-defined patterns seen in all the eight datasets. Moreover, we propose the use of the Self-Feeding Process (SFP) to generate inter-event times between communications. The SFP is an extremely parsimonious point process that requires at most two parameters and is able to generate inter-event times with all the universal properties we observed in the data. We also show three potential applications of the SFP: as a framework to generate a synthetic dataset containing realistic communication events of any one of the analyzed means of communications, as a technique to detect anomalies, and as a building block for more specific models that aim to encompass the particularities seen in each of the analyzed systems.", "paper_title": "Universal and Distinct Properties of Communication Dynamics: How to Generate Realistic Inter-event Times", "paper_id": "WOS:000354053500011"}