{"auto_keywords": [{"score": 0.04733190377720633, "phrase": "customer_satisfaction"}, {"score": 0.03625279201562384, "phrase": "service_consistency"}, {"score": 0.01417636157170582, "phrase": "vehicle_routing"}, {"score": 0.00481495049065317, "phrase": "consistency_considerations"}, {"score": 0.004710819353411276, "phrase": "survey"}, {"score": 0.0046432244185370605, "phrase": "increasing_number"}, {"score": 0.004457309741979921, "phrase": "lifetime_value"}, {"score": 0.0041827333568982055, "phrase": "consistent_service"}, {"score": 0.004070276454809864, "phrase": "regular_times"}, {"score": 0.0036332251283046997, "phrase": "service_regions"}, {"score": 0.00334780964309978, "phrase": "early_solution_approaches"}, {"score": 0.003170060683860338, "phrase": "operational_complexity"}, {"score": 0.0030847461428168614, "phrase": "new_routes"}, {"score": 0.0028037753646260937, "phrase": "previous_achievements"}, {"score": 0.0024572448003065423, "phrase": "different_modeling_concepts"}, {"score": 0.002401972657236928, "phrase": "solution_approaches"}, {"score": 0.0021830553825770097, "phrase": "future_research"}, {"score": 0.0021049977753042253, "phrase": "wiley_periodicals"}], "paper_keywords": ["vehicle routing", " periodic distribution problems", " service consistency", " literature review"], "paper_abstract": "An increasing number of companies focus on customer satisfaction to increase the lifetime value of each customer. In vehicle routing, customer satisfaction is often a result of consistent service. Customers appreciate service at regular times of the day provided by the same driver each time. Additionally, drivers become more familiar with their tasks if they visit the same customers and service regions repeatedly. In this article, we survey literature that addresses service consistency in vehicle routing. We present early solution approaches, starting from the 1970s, that focus on reducing the operational complexity resulting from planning and executing new routes each day. One side benefit of these approaches is service consistency; therefore, many recent solution approaches devised for improving customer satisfaction are based on previous achievements. We classify the literature according to three consistency features: arrival time consistency, person-oriented consistency, and delivery consistency. For each feature, we survey different modeling concepts and measurements, demonstrate solution approaches, and examine the increase in cost of improving service consistency. We close the article by presenting challenging ideas for future research. (c) 2014 The Authors Networks Published by Wiley Periodicals, Inc. NETWORKS, Vol. 64(3), 192-213 2014", "paper_title": "Vehicle Routing Problems in Which Consistency Considerations are Important: A Survey", "paper_id": "WOS:000344233000006"}