{"auto_keywords": [{"score": 0.04898689815940368, "phrase": "trajectory_patterns"}, {"score": 0.00481495049065317, "phrase": "mining_trajectory_patterns"}, {"score": 0.004192190072470619, "phrase": "previous_methods"}, {"score": 0.003947884118204803, "phrase": "pattern_discovery"}, {"score": 0.0034368818187904744, "phrase": "temporal_constraints"}, {"score": 0.0032968474833776906, "phrase": "unifying_framework"}, {"score": 0.0031479142819948007, "phrase": "unifying_trajectory_patterns"}, {"score": 0.0028303313661029597, "phrase": "initial_patterns"}, {"score": 0.002765636101369536, "phrase": "first_phase"}, {"score": 0.002498053212249228, "phrase": "second_phase"}, {"score": 0.0023851187337905412, "phrase": "pattern_forest"}, {"score": 0.0022458849724980904, "phrase": "information-theoretic_formula"}, {"score": 0.0021945194903838132, "phrase": "experimental_results"}, {"score": 0.0021443262599352996, "phrase": "easy_discovery"}, {"score": 0.0021049977753042253, "phrase": "real-world_trajectory_data"}], "paper_keywords": ["Trajectory pattern mining", " synchronous movement patterns", " moving object trajectories", " trajectory clustering"], "paper_abstract": "Discovering trajectory patterns is shown to be very useful in learning interactions between moving objects. Many types of trajectory patterns have been proposed in the literature, but previous methods were developed for only a specific type of trajectory patterns. This limitation could make pattern discovery tedious and inefficient since users typically do not know which types of trajectory patterns are hidden in their data sets. Our main observation is that many trajectory patterns can be arranged according to the strength of temporal constraints. In this paper, we propose a unifying framework of mining trajectory patterns of various temporal tightness, which we call unifying trajectory patterns (UT-patterns). This framework consists of two phases: initial pattern discovery and granularity adjustment. A set of initial patterns are discovered in the first phase, and their granularities (i.e., levels of detail) are adjusted by split and merge to detect other types in the second phase. As a result, the structure called a pattern forest is constructed to show various patterns. Both phases are guided by an information-theoretic formula without user intervention. Experimental results demonstrate that our framework facilitates easy discovery of various patterns from real-world trajectory data.", "paper_title": "A Unifying Framework of Mining Trajectory Patterns of Various Temporal Tightness", "paper_id": "WOS:000353890600003"}