{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "large-scale_security-oriented_research_project"}, {"score": 0.0044967055264893184, "phrase": "fundamental_phase"}, {"score": 0.004420472010542188, "phrase": "software_engineering_process"}, {"score": 0.00401216440036853, "phrase": "architecture-driven_software_development"}, {"score": 0.0033048445033866795, "phrase": "large-scale_security-oriented_european_research_project"}, {"score": 0.0031573626285069157, "phrase": "architecture-driven_project"}, {"score": 0.0029148831519944358, "phrase": "large-scale_research_projects"}, {"score": 0.0028167336373711494, "phrase": "existing_best_practices"}, {"score": 0.0024005409468262203, "phrase": "requirements_engineering_process"}, {"score": 0.0023064582783867645, "phrase": "identified_challenges"}, {"score": 0.0021049977753042253, "phrase": "proper_requirements_analysis"}], "paper_keywords": ["Requirements engineering practice", " Large-scale research project", " Cooperative work", " Gap analysis", " Interaction analysis"], "paper_abstract": "Requirements engineering has been recognized as a fundamental phase of the software engineering process. Nevertheless, the elicitation and analysis of requirements are often left aside in favor of architecture-driven software development. This tendency, however, can lead to issues that may affect the success of a project. This paper presents our experience gained in the elicitation and analysis of requirements in a large-scale security-oriented European research project, which was originally conceived as an architecture-driven project. In particular, we illustrate the challenges that can be faced in large-scale research projects and consider the applicability of existing best practices and off-the-shelf methodologies with respect to the needs of such projects. We then discuss how those practices and methods can be integrated into the requirements engineering process and possibly improved to address the identified challenges. Finally, we summarize the lessons learned from our experience and the benefits that a proper requirements analysis can bring to a project.", "paper_title": "Requirements engineering within a large-scale security-oriented research project: lessons learned", "paper_id": "WOS:000314889800003"}