{"auto_keywords": [{"score": 0.049481323529186536, "phrase": "angola"}, {"score": 0.008498336352049173, "phrase": "handheld_computers"}, {"score": 0.006390182616368483, "phrase": "focus_groups"}, {"score": 0.00627105367658489, "phrase": "handheld_computer"}, {"score": 0.00481495049065317, "phrase": "personal_digital_assistants"}, {"score": 0.004593317752310294, "phrase": "healthcare_settings"}, {"score": 0.004564544414530739, "phrase": "low-resource_countries"}, {"score": 0.004012686357543403, "phrase": "accurate_information"}, {"score": 0.003975019199506057, "phrase": "highly_sensitive_topic_-_sexual_behavior"}, {"score": 0.003791901285142797, "phrase": "potential_barriers"}, {"score": 0.003744505496142733, "phrase": "five_focus_groups"}, {"score": 0.00366297866938793, "phrase": "luanda"}, {"score": 0.0034941851527001146, "phrase": "participants'_perceptions"}, {"score": 0.0033647490935899134, "phrase": "intimate_sexual_behavior"}, {"score": 0.0032400962769610206, "phrase": "portuguese"}, {"score": 0.0030425314149863194, "phrase": "english"}, {"score": 0.002838954179574289, "phrase": "social_and_cultural_beliefs"}, {"score": 0.002640682934273318, "phrase": "social_status"}, {"score": 0.002503067305371488, "phrase": "great_advantages"}, {"score": 0.002440805709023898, "phrase": "data_collection"}, {"score": 0.002350298241921987, "phrase": "biased_reporting"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ireland_ltd."}], "paper_keywords": ["Computers", " Handheld", " Data collection", " HIV", " Sexual behavior", " Africa South of the Sahara"], "paper_abstract": "Purpose: Handheld computers have potential to improve HIV/AIDS programs in healthcare settings in low-resource countries, by improving the speed and accuracy of collecting data. However, the acceptability of the technology (i.e., user attitude and reaction) is critical for its successful implementation. Acceptability is particularly critical for HIV/AIDS behavioral data, as it depends on respondents giving accurate information about a highly sensitive topic - sexual behavior. Methods: To explore the acceptability of handheld computers for HIV/AIDS data collection and to identify potential barriers to acceptance, five focus groups of 8-10 participants each were conducted in Luanda, Angola. Facilitators presented Palm Tungsten E handhelds to the focus groups, probed participants' perceptions of the handheld computer, and asked how they felt about disclosing intimate sexual behavior to an interviewer using a handheld computer. Discussions were conducted in Portuguese, the official language of Angola, and audio-taped. They were then transcribed and translated into English for analysis. Results: In total, 49 people participated in the focus groups. PDAs were understood through the lens of social and cultural beliefs. Themes that emerged were suspicion of outsiders, concern with longevity, views on progress and development, and concern about social status. Conclusions: The findings from this study suggest that personal and cultural beliefs influence participant acceptance of PDAs in Angola. While PDAs provide great advantages in terms of speed and efficiency of data collection, these barriers, if left unaddressed, may lead to biased reporting of HIV/AIDS risk data. An understanding of the barriers and why they are relevant in Angola may help researchers and practitioners to reduce the impact of these barriers on HIV/AIDS data collection. (C) 2011 Elsevier Ireland Ltd. All rights reserved.", "paper_title": "Barriers to acceptance of personal digital assistants for HIV/AIDS data collection in Angola", "paper_id": "WOS:000292509100018"}