{"auto_keywords": [{"score": 0.015146429264657528, "phrase": "glucose-insulin_dynamics"}, {"score": 0.014593739423908547, "phrase": "glucose-insulin_kinetics"}, {"score": 0.013547304137037789, "phrase": "structural_identifiability_analysis"}, {"score": 0.00481495049065317, "phrase": "minimal_model"}, {"score": 0.00432208488976429, "phrase": "effective_control"}, {"score": 0.003934540154108188, "phrase": "different_experimental_scenarios"}, {"score": 0.00375395061615019, "phrase": "design_and_parameter_estimation"}, {"score": 0.003649585593445665, "phrase": "first_time"}, {"score": 0.003548111729206587, "phrase": "specific_structures"}, {"score": 0.0029260602766930065, "phrase": "established_inappropriate_nature"}, {"score": 0.0028312983170567948, "phrase": "glucose_clamping_experiments"}, {"score": 0.0028047899594686003, "phrase": "alternative_model"}, {"score": 0.002726740692380339, "phrase": "euglycemic_hyper-insulinemic_clamp"}, {"score": 0.002701223089132036, "phrase": "eic"}, {"score": 0.0025892330566358503, "phrase": "eic_model"}, {"score": 0.002447101794397243, "phrase": "glucose_infusion"}, {"score": 0.0023127544795063263, "phrase": "additional_analysis"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ireland_ltd."}], "paper_keywords": ["Minimal Model", " Structural identifiability", " Intravenous glucose tolerance test (IVGTT)", " Clamp", " Structural indistinguishability", " Parameter estimation"], "paper_abstract": "Many mathematical models have been developed to describe glucose-insulin kinetics as a means of analysing the effective control of diabetes. This paper concentrates on the structural identifiability analysis of certain well-established mathematical models that have been developed to characterise glucose-insulin kinetics under different experimental scenarios. Such analysis is a pre-requisite to experiment design and parameter estimation and is applied for the first time to these models with the specific structures considered. The analysis is applied to a basic (original) form of the Minimal Model (MM) using the Taylor Series approach and a now well-accepted extended form of the MM by application of the Taylor Series approach and a form of the Similarity Transformation approach. Due to the established inappropriate nature of the MM with regard to glucose clamping experiments an alternative model describing the glucose-insulin dynamics during a Euglycemic Hyper-insulinemic Clamp (EIC) experiment was considered. Structural identifiability analysis of the EIC model is also performed using the Taylor Series approach and shows that, with glucose infusion as input alone, the model is structurally globally identifiable. Additional analysis demonstrates that the two different model forms are structurally distinguishable for observation of both glucose and insulin. (C) 2010 Elsevier Ireland Ltd. All rights reserved.", "paper_title": "Structural identifiability and indistinguishability analyses of the Minimal Model and a Euglycemic Hyperinsulinemic Clamp model for glucose-insulin dynamics", "paper_id": "WOS:000296945100011"}