{"auto_keywords": [{"score": 0.04941061878695795, "phrase": "space-time_trellis_codes"}, {"score": 0.014146103008466254, "phrase": "sfr_matrices"}, {"score": 0.010140894562204296, "phrase": "full_cooperative_diversity"}, {"score": 0.00481495049065317, "phrase": "full-rank_matrices"}, {"score": 0.004664983066310498, "phrase": "asynchronous_cooperative_diversity"}, {"score": 0.004551563730037998, "phrase": "relay_network"}, {"score": 0.004472234553892357, "phrase": "existing_space-time_coding_schemes"}, {"score": 0.004272361887713488, "phrase": "full_cooperative_diversity_order"}, {"score": 0.004024351756560517, "phrase": "stack_construction"}, {"score": 0.003996133359116611, "phrase": "hammons"}, {"score": 0.003968112038249246, "phrase": "el_gamal"}, {"score": 0.003912722636111231, "phrase": "lu"}, {"score": 0.003885237720253678, "phrase": "kumar"}, {"score": 0.003659597920882104, "phrase": "binary_matrices"}, {"score": 0.003621160116056119, "phrase": "full_row_rank"}, {"score": 0.003316098012193133, "phrase": "memory_size"}, {"score": 0.0032812562034088646, "phrase": "trellis_code"}, {"score": 0.002983652306921617, "phrase": "corresponding_space-time_trellis_codes"}, {"score": 0.0026750045328382717, "phrase": "high_decoding_complexity"}, {"score": 0.0022747238867190417, "phrase": "smallest_memory_sizes"}, {"score": 0.0022036996784968793, "phrase": "simulation_results"}, {"score": 0.0021049977753042253, "phrase": "asynchronous_cooperative_communications"}], "paper_keywords": ["asynchronous cooperative diversity", " relay networks", " shift equivalence", " shift-full-rank (SFR) matrices", " space-time coding"], "paper_abstract": "To achieve full cooperative diversity in a relay network, most of the existing space-time coding schemes require the synchronization between terminals. A family of space-time trellis codes that achieve full cooperative diversity order without the assumption of synchronization has been recently proposed. The family is based on the stack construction by Hammons and El Gamal and its generalizations by Lu and Kumar. It has been shown that the construction of such a family is equivalent to the construction of binary matrices that have full row rank no matter how their rows are shifted, where a row corresponds to a terminal (or transmit antenna) and its length corresponds to the memory size of the trellis code on that terminal. We call such matrices as shift-full-rank (SFR) matrices. A family of SFR matrices has been also constructed, but the memory sizes of the corresponding space-time trellis codes (the number of columns of SFR matrices) grow exponentially in terms of the number of terminals (the number of rows of SFR matrices), which may cause a high decoding complexity when the number of terminals is not small. In this paper, we systematically study and construct SFR matrices of any sizes for any number of terminals. Furthermore, we construct shortest (square) SFR (SSFR) matrices that correspond to space-time trellis codes with the smallest memory sizes and asynchronous full cooperative diversity. We also present some simulation results to illustrate the performances of the space-time trellis codes associated with SFR matrices in asynchronous cooperative communications.", "paper_title": "Shift-full-rank matrices and applications in space-time trellis codes for relay networks with asynchronous cooperative diversity", "paper_id": "WOS:000238921200018"}