{"auto_keywords": [{"score": 0.04238272461307023, "phrase": "dynamic_programming_approach"}, {"score": 0.02684949492065008, "phrase": "isotopic_distributions"}, {"score": 0.021424927160892417, "phrase": "true_positive_rate"}, {"score": 0.01173389657937066, "phrase": "false_positive_rate"}, {"score": 0.008713768692145006, "phrase": "dynamic_programming"}, {"score": 0.008586651502377135, "phrase": "mass_spectra"}, {"score": 0.008144066450282676, "phrase": "probabilistic_classifier"}, {"score": 0.004772518445873925, "phrase": "isotopic_distribution_maps"}, {"score": 0.004539005582217309, "phrase": "mass_spectrum"}, {"score": 0.0042914569949699015, "phrase": "robust_and_meaningful_features"}, {"score": 0.004129873531628877, "phrase": "primary_result"}, {"score": 0.0031193028729331667, "phrase": "low_false_positive_rate"}, {"score": 0.002931569771634119, "phrase": "exact_matches"}, {"score": 0.0028885579903645043, "phrase": "annotated_spectra"}, {"score": 0.002755104031926742, "phrase": "even_one_peak"}, {"score": 0.0027307746993761035, "phrase": "even_one_extraneous_peak"}, {"score": 0.0026827569390113822, "phrase": "thrash_and_aid-ms_systems"}, {"score": 0.002659064774118166, "phrase": "looser_requirement"}, {"score": 0.0025892330566358503, "phrase": "mono-isotopic_mass"}, {"score": 0.0023346234464901978, "phrase": "aid-ms"}, {"score": 0.0022201273900989416, "phrase": "thrash"}, {"score": 0.0022070310530794097, "phrase": "aid-ms."}], "paper_keywords": [""], "paper_abstract": "Motivation: This article presents a method to identify the isotopic distributions within a mass spectrum using a probabilistic classifier supplemented with dynamic programming. Such a system is needed for a variety of purposes, including generating robust and meaningful features from mass spectra to be used in classification. Results: The primary result of this article is that the dynamic programming approach significantly improves sensitivity, without harming specificity, of a probabilistic classifier for identifying the isotopic distributions. When annotating isotopic distributions where an expert has performed the initial 'peak-picking' ( removal of noise peaks), the dynamic programming approach gives a true positive rate of 96% and a false positive rate of 0.0%, whereas the classifier alone has a true positive rate of only 47% when the false positive rate is 0.0%. When annotating isotopic distributions in machine peak-picked spectra, which may contain many noise peaks, the dynamic programming approach gives a true positive rate of only 22.0%, but it still keeps a low false positive rate of 1.0% and still outperforms the classifier alone. It is important to note that all these rates are when we require exact matches with the distributions in annotated spectra; in our evaluation a distribution is considered 'entirely incorrect' if it is missing even one peak or contains even one extraneous peak. We compared to the THRASH and AID-MS systems using a looser requirement: correctly identifying the distribution that contains the mono-isotopic mass. Under this measure, our dynamic programming approach achieves a true positive rate of 82% and a false positive rate of 1%, which again outperforms the classifier alone. The dynamic programming approach ends up being more conservative than THRASH and AID-MS, yielding both fewer true and false peaks, but the F-score of the dynamic programming approach is significantly better than those of THRASH and AID-MS. All results were obtained with 10-fold cross-validation of 99 sections of mass spectra with a total of 214 hand-annotated isotopic distributions.", "paper_title": "Using dynamic programming to create isotopic distribution maps from mass spectra", "paper_id": "WOS:000248620400063"}