{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "terrorist_networks"}, {"score": 0.010175808641766022, "phrase": "structural_cohesion"}, {"score": 0.009987561215261802, "phrase": "sna"}, {"score": 0.004769958800452922, "phrase": "investigative_data_mining"}, {"score": 0.0045726187330434025, "phrase": "social_network_analysis"}, {"score": 0.004301834610818624, "phrase": "participation_index"}, {"score": 0.004066076430818046, "phrase": "minimum_number"}, {"score": 0.0037363522297378777, "phrase": "bottom-up_measures"}, {"score": 0.003306559295382181, "phrase": "mohamed_atta"}, {"score": 0.0032145922365231093, "phrase": "ring_leader"}, {"score": 0.003125175084962886, "phrase": "maximum_number"}, {"score": 0.003038237581227068, "phrase": "structural_cohesion_measures"}, {"score": 0.002939853413763817, "phrase": "recently_introduced_algorithms"}, {"score": 0.0027395968397212053, "phrase": "nonhierarchical_organizations"}, {"score": 0.0026014425686078993, "phrase": "degree_centrality"}, {"score": 0.0024014759148123736, "phrase": "hierarchical_structure"}, {"score": 0.0023789822182914877, "phrase": "complex_networks"}, {"score": 0.0022696277881969896, "phrase": "valdis_krebs"}], "paper_keywords": [""], "paper_abstract": "This paper uses measures of structural cohesion from social network analysis (SNA) literature to discuss how to destabilize terrorist networks by visualizing participation index of various terrorists in the dataset. Structural cohesion is defined as the minimum number of terrorists, who if removed from the group, would disconnect the group. We tested bottom-up measures from SNA (cliques, n-cliques, n-clans and k-plex) using dataset of 9-11 terrorist network, and found that Mohamed Atta, who was known as ring leader of the plot, participated maximum number of groups generated by the structural cohesion measures. We discuss the results of recently introduced algorithms for constructing hierarchy of terrorist networks, so that investigators can view the structure of nonhierarchical organizations, in order to destabilize terrorist networks. Based upon the degree centrality, eigenvector centrality, and dependence centrality measures, a method is proposed to construct the hierarchical structure of complex networks. It is tested on the September 11, 2001 terrorist network constructed by Valdis Krebs. In addition we also briefly discuss various roles in the network i.e., position role index, which discovers various positions in the network, for example, leaders / brokers and followers.", "paper_title": "Structural analysis and mathematical methods for destabilizing terrorist networks using investigative data mining", "paper_id": "WOS:000240088200113"}