{"auto_keywords": [{"score": 0.02807825192135906, "phrase": "rt"}, {"score": 0.00481495049065317, "phrase": "web_survey"}, {"score": 0.004781357546476652, "phrase": "response_time"}, {"score": 0.004552648949390462, "phrase": "key_preoccupation"}, {"score": 0.004395984840790689, "phrase": "web_surveys"}, {"score": 0.004156411748278609, "phrase": "data_collection_process"}, {"score": 0.0037286231222250065, "phrase": "web_panels"}, {"score": 0.0033330104902937383, "phrase": "response_times"}, {"score": 0.0030319482153908037, "phrase": "online_survey"}, {"score": 0.002896819408461957, "phrase": "instructional_manipulation_check"}, {"score": 0.002616628760616317, "phrase": "quality_indicators"}, {"score": 0.002598333022293788, "phrase": "respondents'_auto-evaluation"}, {"score": 0.0024824815904738685, "phrase": "structural_equation"}, {"score": 0.0023551955270737215, "phrase": "potential_spurious_effects"}, {"score": 0.00231423064137482, "phrase": "significant_relationship"}, {"score": 0.0021049977753042253, "phrase": "significant_link"}], "paper_keywords": ["Web surveys", " quality", " paradata", " response time", " auto-evaluation", " efforts", " structural equation modeling"], "paper_abstract": "Evaluating the quality of the data is a key preoccupation for researchers to be confident in their results. When web surveys are used, it seems even more crucial since the researchers have less control on the data collection process. However, they also have the possibility to collect some paradata that may help evaluating the quality. Using this paradata, it was noticed that some respondents of web panels are spending much less time than expected to complete the surveys. This creates worries about the quality of the data obtained. Nevertheless, not much is known about the link between response times (RTs) and quality. Therefore, the goal of this study is to look at the link between the RTs of respondents in an online survey and other more usual indicators of quality used in the literature: properly following an instructional manipulation check, coherence and precision of answers, absence of straight-lining, and so on. Besides, we are also interested in the link of RT and the quality indicators with respondents' auto-evaluation of the efforts they did to answer the survey. Using a structural equation modeling approach that allows separating the structural and the measurement models and controlling for potential spurious effects, we find a significant relationship between RT and quality in the three countries studied. We also find a significant, but lower, relationship between RT and auto-evaluation. However, we did not find a significant link between auto-evaluation and quality.", "paper_title": "What are the Links in a Web Survey Among Response Time, Quality, and Auto-Evaluation of the Efforts Done?", "paper_id": "WOS:000348103000006"}