{"auto_keywords": [{"score": 0.02778011707208317, "phrase": "minor_character"}, {"score": 0.00481495049065317, "phrase": "story-based_contents"}, {"score": 0.004624751696958501, "phrase": "digital_content"}, {"score": 0.003995876175614403, "phrase": "social_network"}, {"score": 0.003935892934907777, "phrase": "character-net"}, {"score": 0.003012560489169148, "phrase": "minor_and_major_characters"}, {"score": 0.002907992115184249, "phrase": "similar_scenes"}, {"score": 0.002750934994181092, "phrase": "novel_method"}, {"score": 0.0025761937402886954, "phrase": "similar_emotion_vector_tothe_main_character"}, {"score": 0.002388283252319309, "phrase": "main_character"}], "paper_keywords": ["Character clustering", " Relationship", " Emotion", " Character-net", " Social network"], "paper_abstract": "Stories in digital content (e.g., movies) are usually developed using many kinds of relationships among the characters. In order to efficiently manage such contents, we want to exploit a social network (called Character-net) extracted from the stories. Since scripts are composed of several elements (i.e., scene headings, character names, dialogs, actions, etc.), we focus on analyzing interactions (e.g., dialog) among the characters to build such a social network. Most importantly, these relationships between minor and major characters can be abstracted and clustered into similar scenes. Thereby, in this paper, we propose a novel method that can cluster characters using their emotional similarity. If a minor character has a similar emotion vector tothe main character, then the minor character can be classified as a tritagonist who helps the main character. Conversely, this minor character may be clustered into another group and denoted as an antagonist. Additionally, we show the efficiency of our proposed method by experiment in this paper.", "paper_title": "Emotion-based character clustering for managing story-based contents: a cinemetric analysis", "paper_id": "WOS:000317626800003"}