{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "shear_strength_parameters"}, {"score": 0.044728827124546816, "phrase": "system_reliability"}, {"score": 0.015317122751295015, "phrase": "geotechnical_system_reliability"}, {"score": 0.014230764614779755, "phrase": "bivariate_distribution"}, {"score": 0.013922674371054447, "phrase": "failure_mode"}, {"score": 0.01386576684637498, "phrase": "geotechnical_structures"}, {"score": 0.006338644981472768, "phrase": "copula_selection"}, {"score": 0.005683224436337136, "phrase": "friction_angle"}, {"score": 0.005322791010591766, "phrase": "dependence_structure"}, {"score": 0.003954837422946628, "phrase": "implementation_procedure"}, {"score": 0.003920384090110374, "phrase": "system_reliability_analysis"}, {"score": 0.0038862297330905836, "phrase": "direct_monte_carlo_simulation"}, {"score": 0.003852408141975632, "phrase": "mcs"}, {"score": 0.003671338229632309, "phrase": "retaining_wall"}, {"score": 0.003623453648863547, "phrase": "rock_wedge_slope"}, {"score": 0.003305243635051068, "phrase": "incomplete_probability_information"}, {"score": 0.00308163068747474, "phrase": "correlation_coefficient"}, {"score": 0.0028480459059007468, "phrase": "significant_influence"}, {"score": 0.002690406375639144, "phrase": "first_phase"}, {"score": 0.002530359917257626, "phrase": "single_failure_mode"}, {"score": 0.002475532161577715, "phrase": "marginal_distributions"}, {"score": 0.0023180581939456686, "phrase": "second_phase"}, {"score": 0.0021705796895687864, "phrase": "reliability_level"}], "paper_keywords": ["Geotechnical structures", " Retaining wall", " Rock wedge slope", " System reliability", " Probability of failure", " Copulas"], "paper_abstract": "The objective of this paper is to investigate the effect of copulas for constructing the bivariate distribution of shear strength parameters on system reliability of geotechnical structures. First, the bivariate distribution of shear strength parameters is constructed using copulas. Second, the implementation procedure of system reliability analysis using direct Monte Carlo simulation (MCS) is developed. Finally, the system reliability of a retaining wall and a rock wedge slope is presented to explore the effect of copula selection on geotechnical system reliability. The results indicate that the system reliability of geotechnical structures under incomplete probability information could not be determined uniquely because the bivariate distribution of cohesion and friction angle with given marginal distributions and correlation coefficient could not be determined uniquely. The copulas for modeling dependence structure between cohesion and friction angle have a significant influence on the system reliability of geotechnical structures. Such an influence includes two phases separately. The first phase is that the dependence structure between shear strength parameters characterized by copulas affects the reliability of single failure mode, depending on the marginal distributions, dependence structure between shear strength parameters, and reliability level of each failure mode. The second phase is that the reliability of each failure mode influences on system reliability, only depending on reliability level of each failure mode and correlations among various failure modes. It is important to distinguish between the effect of copula selection on reliability of each failure mode and that on geotechnical system reliability. (C) 2015 Elsevier Ltd. All rights reserved.", "paper_title": "Bivariate distribution of shear strength parameters using copulas and its impact on geotechnical system reliability", "paper_id": "WOS:000356120900017"}