{"auto_keywords": [{"score": 0.04232478027153052, "phrase": "mobile_context"}, {"score": 0.008713768692145006, "phrase": "mobile_computing"}, {"score": 0.00445783412174435, "phrase": "interactive_systems"}, {"score": 0.004344755264641137, "phrase": "relatively_stable_and_homogeneous_use_context"}, {"score": 0.003937126962709418, "phrase": "theoretical_perspective"}, {"score": 0.003582928547553209, "phrase": "ubiquitous_character"}, {"score": 0.0035523480068927614, "phrase": "mobile_apps"}, {"score": 0.0033454448643854525, "phrase": "relevant_data"}, {"score": 0.0031102878400698143, "phrase": "convenience_sample"}, {"score": 0.003044313656896057, "phrase": "mobile_app_design"}, {"score": 0.002842428606954139, "phrase": "early_phase"}, {"score": 0.0026882700311968025, "phrase": "external_context-related_considerations"}, {"score": 0.0021692000054033956, "phrase": "budget_constraints"}], "paper_keywords": ["ubiquitous and mobile computing", " HCI design and evaluation methods", " user centered design", " empirical studies in interaction design"], "paper_abstract": "Understanding the context of use is essential to the design of interactive systems. In contrast to the relatively stable and homogeneous use context in stationary computing, the context of use in mobile computing is dynamic and heterogeneous. Although mobile context has been studied from a theoretical perspective, empirical data on howpractitioners address the mobile context of use is scant. With the emergence of more advanced mobile technologies, improved interfaces and the ubiquitous character of mobile apps, questions related to context of use and how designers and developers collect relevant data become even more pressing. This paper presents the results of a survey based on a convenience sample of 150 practitioners involved in mobile app design and development. Our results show that the mobile context of use is mainly considered in the early phase of requirements gathering and specification, while there is a lack of external context-related considerations in evaluations. Methods that are perceived as being more appropriate to address the mobile context are also perceived as being more effective, though they are used considerably less frequently. A key to addressing the mobile context is to improve the utility of such methods, taking the time and budget constraints of practitioners, as well as their experience, into consideration.", "paper_title": "Addressing the Context of Use in Mobile Computing: a Survey on the State of the Practice", "paper_id": "WOS:000361835100002"}