{"auto_keywords": [{"score": 0.0494096760831155, "phrase": "frequent_k-itemsets"}, {"score": 0.0453665111651286, "phrase": "iceberg_queries"}, {"score": 0.012002552856869913, "phrase": "sparse_datasets"}, {"score": 0.00481495049065317, "phrase": "well_known_problem"}, {"score": 0.004143196873246147, "phrase": "original_dataset"}, {"score": 0.00348202932445197, "phrase": "frequent_x-itemsets"}, {"score": 0.003229741076887151, "phrase": "level-wise_approach"}, {"score": 0.003154701855951328, "phrase": "recent_algorithm"}, {"score": 0.002778529097886437, "phrase": "important_feature"}, {"score": 0.0026633568650501873, "phrase": "main_memory"}, {"score": 0.0023456351719724957, "phrase": "small_transactions"}, {"score": 0.0021652891317252994, "phrase": "first_extension"}, {"score": 0.0021049977753042253, "phrase": "data_streams"}], "paper_keywords": [""], "paper_abstract": "In this paper we show that the well known problem of computing frequent k-itemsets (i.e. itemsets of cardinality k) in a given dataset can be reduced to the problem of finding iceberg queries from a stream of queries suitably constructed from the original dataset. Hence, algorithms for computing frequent k-itemsets can be obtained by adapting algorithms for computing iceberg queries. In the paper we show that, for sparse datasets, this can be done directly, i.e. without generating frequent x-itemsets, for each x < k, as done in the most common algorithms based on a level-wise approach. We exploit a recent algorithm for finding iceberg queries and define an algorithm which requires only three sequential passes over the dataset to compute the frequent k-itemsets (even for k > 3). An important feature of the algorithm is that the amount of main memory required can be determined in advance, and it is shown to be very low for sparse datasets. Experiments show that for very large datasets with millions of small transactions our proposal outperforms the state-of-the-art algorithms. Furthermore, we sketch a first extension of our algorithm that works over data streams.", "paper_title": "Memory-aware frequent k-itemset mining", "paper_id": "WOS:000237245300003"}