{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "wrong-patient_electronic_orders"}, {"score": 0.005110026740651482, "phrase": "ci"}, {"score": 0.004761968711051715, "phrase": "randomized_controlled_trial"}, {"score": 0.004555781299332848, "phrase": "computerized_physician_order_entry_systems"}, {"score": 0.004505638402009237, "phrase": "two-phase_study"}, {"score": 0.00424734451992536, "phrase": "'retract-and-reorder'_measurement_tool"}, {"score": 0.003916098498242888, "phrase": "different_patient"}, {"score": 0.0034540850937966336, "phrase": "three-armed_randomized_controlled_trial"}, {"score": 0.0032558762499901727, "phrase": "patient_identification"}, {"score": 0.003012831982759529, "phrase": "retract-and-reorder_measurement_tool"}, {"score": 0.0028715299874549245, "phrase": "positive_predictive_value"}, {"score": 0.0026472970609754095, "phrase": "wrong_patients"}, {"score": 0.0024586427394152196, "phrase": "id-verify_alert"}, {"score": 0.002404706573379854, "phrase": "retract-and-reorder_event"}, {"score": 0.0022834017104377525, "phrase": "id-reentry_function"}, {"score": 0.002233301265743633, "phrase": "larger_magnitude"}, {"score": 0.0021363670305843403, "phrase": "discussion_and_conclusion_wrong-patient_electronic_orders"}, {"score": 0.0021049977753042253, "phrase": "computerized_provider_order_entry_systems"}], "paper_keywords": [""], "paper_abstract": "Objective To evaluate systems for estimating and preventing wrong-patient electronic orders in computerized physician order entry systems with a two-phase study. Materials and methods In phase 1, from May to August 2010, the effectiveness of a 'retract-and-reorder' measurement tool was assessed that identified orders placed on a patient, promptly retracted, and then reordered by the same provider on a different patient as a marker for wrong-patient electronic orders. This tool was then used to estimate the frequency of wrong-patient electronic orders in four hospitals in 2009. In phase 2, from December 2010 to June 2011, a three-armed randomized controlled trial was conducted to evaluate the efficacy of two distinct interventions aimed at preventing these errors by reverifying patient identification: an 'ID-verify alert', and an 'ID-reentry function'. Results The retract-and-reorder measurement tool effectively identified 170 of 223 events as wrong-patient electronic orders, resulting in a positive predictive value of 76.2% (95% CI 70.6% to 81.9%). Using this tool it was estimated that 5246 electronic orders were placed on wrong patients in 2009. In phase 2, 901 776 ordering sessions among 4028 providers were examined. Compared with control, the ID-verify alert reduced the odds of a retract-and-reorder event (OR 0.84, 95% CI 0.72 to 0.98), but the ID-reentry function reduced the odds by a larger magnitude (OR 0.60, 95% CI 0.50 to 0.71). Discussion and conclusion Wrong-patient electronic orders occur frequently with computerized provider order entry systems, and electronic interventions can reduce the risk of these errors occurring.", "paper_title": "Understanding and preventing wrong-patient electronic orders: a randomized controlled trial", "paper_id": "WOS:000314875100015"}