{"auto_keywords": [{"score": 0.048851194509091665, "phrase": "norm-autonomous_agents"}, {"score": 0.015719716506582538, "phrase": "dynamic_environments"}, {"score": 0.01221474621601304, "phrase": "existing_proposals"}, {"score": 0.008821164304962922, "phrase": "n-bdi_architecture"}, {"score": 0.003850464100878052, "phrase": "norm_compliance"}, {"score": 0.0035614563596982306, "phrase": "deterministic_environment"}, {"score": 0.0032094634756436595, "phrase": "non-deterministic_and_dynamic_environments"}, {"score": 0.0028921584725218642, "phrase": "physical_presence"}, {"score": 0.002847339938387273, "phrase": "real-world_environment"}, {"score": 0.0025524176761139413, "phrase": "graded_bdi_architecture"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Norms", " Uncertainty", " Graded BDI agents"], "paper_abstract": "The behaviour of norm-autonomous agents is determined by their goals and the norms that are explicitly represented inside their minds. Thus, they require mechanisms for acquiring and accepting norms, determining when norms are relevant to their case, and making decisions about norm compliance. Up until now the existing proposals on norm-autonomous agents assume that agents interact within a deterministic environment that is certainly perceived. In practise, agents interact by means of sensors and actuators under uncertainty with non-deterministic and dynamic environments. Therefore, the existing proposals are unsuitable or, even, useless to be applied when agents have a physical presence in some real-world environment. In response to this problem we have developed the n-BDI architecture. In this paper, we propose a multi-context graded BDI architecture (called n-BDI) that models norm-autonomous agents able to deal with uncertainty in dynamic environments. The n-BDI architecture has been experimentally evaluated and the results are shown in this paper. (C) 2014 Elsevier Inc. All rights reserved.", "paper_title": "Reasoning about norms under uncertainty in dynamic environments", "paper_id": "WOS:000343853800011"}