{"auto_keywords": [{"score": 0.044880897290579584, "phrase": "web_services"}, {"score": 0.00819315769202705, "phrase": "agent-based_web_services"}, {"score": 0.00481495049065317, "phrase": "collaborative_web_services"}, {"score": 0.004442703298710073, "phrase": "required_tasks"}, {"score": 0.004241126597483046, "phrase": "loosely-coupled_business_applications"}, {"score": 0.00415019999222481, "phrase": "distributed_settings"}, {"score": 0.0038648914374241447, "phrase": "cooperative_groups"}, {"score": 0.0037586442197443375, "phrase": "common_goals"}, {"score": 0.0034039039924579437, "phrase": "open_issue"}, {"score": 0.003101708453038721, "phrase": "cooperative_strategies"}, {"score": 0.0030257422786589723, "phrase": "single_operative_attitude"}, {"score": 0.002960795132939529, "phrase": "better_utility"}, {"score": 0.0028438444033180303, "phrase": "better_outcome"}, {"score": 0.0026481034178437958, "phrase": "particular_cases"}, {"score": 0.0024658019116387845, "phrase": "agent-based_model"}, {"score": 0.0024128447214999647, "phrase": "different_parameters"}, {"score": 0.0022960215670802774, "phrase": "web_services_strategies"}, {"score": 0.0022467024793003812, "phrase": "non-zero-sum_games"}, {"score": 0.002191630834885141, "phrase": "theoretical_results"}, {"score": 0.0021445492649196955, "phrase": "extensive_simulations"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Agent computing", " Web service", " Decision making", " Payoff"], "paper_abstract": "In agent and (web) service computing, collaboration takes place when distributed entities have limited knowledge and capabilities, so they cannot perform required tasks without interacting and helping each other. For instance, web services, which are loosely-coupled business applications, are called to cooperate in distributed settings for the sake of efficiency. In this context, agents that abstract and act on behalf of web services could act in cooperative groups that gather a number of agents sharing some common goals. Enabling those agent-based web services to decide about their strategies in terms of joining and acting within groups, inviting other agents to join, and leaving a group to act alone is an open issue that we address in this work. In this paper, we propose a framework where agent-based web services select strategies that maximize their outcomes. These strategies could be categorized into cooperative strategies involving other agents and strategies that highlight the single operative attitude. Although cooperation seems to bring better utility to cooperative agents, we highlight that web services in some environments obtain better outcome while they act individually (i.e., outside the group). This means that the cost of cooperation (in some particular cases) might negatively influence the outcome and obtained utility. As solution, we propose in this paper (1) an agent-based model that formalizes web services decision making where different parameters are considered; and (2) a game-theoretic framework that analyzes the web services strategies allowing them to maximize their acting performance where non-zero-sum games are being used. The paper presents theoretical results, which are also confirmed through extensive simulations. (C) 2012 Elsevier Ltd. All rights reserved.", "paper_title": "Agent-based game-theoretic model for collaborative web services: Decision making analysis", "paper_id": "WOS:000316522900040"}