{"auto_keywords": [{"score": 0.023227389148466324, "phrase": "fpa"}, {"score": 0.01838675374818642, "phrase": "conversion_type"}, {"score": 0.0103997506673976, "phrase": "software_organizations"}, {"score": 0.009671855213364229, "phrase": "cosmic_method"}, {"score": 0.009178612806557348, "phrase": "high_level"}, {"score": 0.008813936282291365, "phrase": "fpa_measures"}, {"score": 0.008784202814752146, "phrase": "cosmic_measures"}, {"score": 0.008141721426468379, "phrase": "cosmic"}, {"score": 0.007305637086207565, "phrase": "systematic_conversion_approach"}, {"score": 0.006358700935176236, "phrase": "conversion_process"}, {"score": 0.005637969396224092, "phrase": "tested_datasets"}, {"score": 0.0047986421331124105, "phrase": "cosmic_measurement_method_conversion_types"}, {"score": 0.004766190148647966, "phrase": "functional_size_measurement_methods"}, {"score": 0.0046543187326616685, "phrase": "software_project_managers"}, {"score": 0.004552779883918196, "phrase": "cosmic_measurement_method"}, {"score": 0.0045066700729094996, "phrase": "fsm"}, {"score": 0.004415818197444577, "phrase": "fsm_field"}, {"score": 0.004275695773180393, "phrase": "main_problem"}, {"score": 0.004232373164961636, "phrase": "fpa_historical_data"}, {"score": 0.004210876051624364, "phrase": "corresponding_cosmic_function_point"}, {"score": 0.004042767921503227, "phrase": "almost_all_the_convertibility_studies"}, {"score": 0.003941112097911637, "phrase": "final_size"}, {"score": 0.0037011159383014093, "phrase": "fpa_transaction_function_measures"}, {"score": 0.0036326148978972563, "phrase": "new_conversion_type"}, {"score": 0.003595784644085049, "phrase": "cosmic_data_movements"}, {"score": 0.0035593264698684617, "phrase": "file_type_references"}, {"score": 0.003523236643208091, "phrase": "single_application"}, {"score": 0.0033767460969190044, "phrase": "management_information_systems_domain"}, {"score": 0.0031872133326251175, "phrase": "previous_studies"}, {"score": 0.003112287563381782, "phrase": "leave_one_out_cross_validation_technique"}, {"score": 0.003070263892913837, "phrase": "fitting_accuracy"}, {"score": 0.0029879060852430156, "phrase": "transaction_function_size"}, {"score": 0.0028929624023485774, "phrase": "measurement_information"}, {"score": 0.0028538916923953037, "phrase": "fpa_weighting_system"}, {"score": 0.002844206506908407, "phrase": "fpa_structural_problems"}, {"score": 0.002824934350517072, "phrase": "illegal_scale_transformation"}, {"score": 0.0027351550496356393, "phrase": "proposed_conversion_type"}, {"score": 0.002675372233366607, "phrase": "cosmic_functional_processes"}, {"score": 0.0026662912652304985, "phrase": "dataset_applications"}, {"score": 0.002507991613593576, "phrase": "statistical_significant_difference"}, {"score": 0.002482535248911612, "phrase": "conversion_types"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Software measurement", " Functional size conversion", " FPA", " COSMI", " FTR"], "paper_abstract": "Background: Functional size measurement methods are increasingly being adopted by software organizations due to the benefits they provide to software project managers. The Function Point Analysis (FPA) measurement method has been used extensively and globally in software organizations. The COSMIC measurement method is considered a second generation FSM method, because of the novel aspects it brings to the FSM field. After the COSMIC method was proposed, the issue of convertibility from FPA to COSMIC method arose, the main problem being the ability to convert FPA historical data to the corresponding COSMIC Function Point (CFP) data with a high level of accuracy, which would give organizations the ability to use the data in their future planning. Almost all the convertibility studies found in the literature involve converting FPA measures to COSMIC measures statistically, based on the final size generated by both methods. Objectives: This paper has three main objectives. The first is to explore the accuracy of the conversion type that converts FPA measures to COSMIC measures statistically, and that of the type that converts FPA transaction function measures to COSMIC measures. The second is to propose a new conversion type that predicts the number of COSMIC data movements based on the number of file type references referenced by all the elementary processes in a single application. The third is to compare the accuracy of our proposed conversion type with the other two conversion types found in the literature. Method: One dataset from the management information systems domain was used to compare the accuracy of all three conversion types using a systematic conversion approach that applies three regression models: Ordinary Least Squares, Robust Least Trimmed Squares, and logarithmic transformation were used. Four datasets from previous studies were used to evaluate the accuracy of the three conversion types, to which the Leave One Out Cross Validation technique was applied to obtain the measures of fitting accuracy. Results: The conversion type most often used as well as the conversion type based on transaction function size were found to generate nonlinear, inaccurate and invalid results according to measurement theory. In addition, they produce a loss of measurement information in the conversion process, because of the FPA weighting system and FPA structural problems, such as illegal scale transformation. Our proposed conversion type avoids the problems inherent in the other two types but not the nonlinearity problem. Furthermore, the proposed conversion type has been found to be more accurate than the other types when the COSMIC functional processes comprise dataset applications that are systematically larger than their corresponding FPA elementary processes, or when the processes vary from small to large. Finally, our proposed conversion type delivered better results over the tested datasets, whereas, in general, there is no statistical significant difference between the accuracy of the conversion types examined for every dataset, particularly the conversion type most often used is not the most accurate. Conclusions: Our proposed conversion type achieves accurate results over the tested datasets. However, the lack of knowledge needed to use it over all the datasets in the literature limits the value of this conclusion. Consequently, practitioners converting from FPA to COSMIC should not stay with only one conversion type, assuming that it is the best. In order to achieve a high level of accuracy in the conversion process, all three conversion types must be tested via a systematic conversion approach. (c) 2012 Elsevier B.V. All rights reserved.", "paper_title": "An exploratory study on the accuracy of FPA to COSMIC measurement method conversion types", "paper_id": "WOS:000308387500008"}