{"auto_keywords": [{"score": 0.042911185020077895, "phrase": "distributed_computing_environment"}, {"score": 0.00481495049065317, "phrase": "network_bandwidth"}, {"score": 0.0045324756541157574, "phrase": "computer_performance"}, {"score": 0.004301046274139699, "phrase": "information_technology"}, {"score": 0.004249332848326785, "phrase": "construction_simulation"}, {"score": 0.003920049436883885, "phrase": "computing_resources"}, {"score": 0.0038573081851680656, "phrase": "grid_computing"}, {"score": 0.003616189733352126, "phrase": "so-called_grid_computing"}, {"score": 0.0035439655241057207, "phrase": "idle_computing_resources"}, {"score": 0.0033764382987428497, "phrase": "complicated_tasks"}, {"score": 0.003335804608791029, "phrase": "large-scale_computing"}, {"score": 0.003229815147800001, "phrase": "grid_resources"}, {"score": 0.0029206706678860292, "phrase": "grid"}, {"score": 0.002504374718975704, "phrase": "static_and_dynamic_load_balancing_technologies"}, {"score": 0.0024345529783611703, "phrase": "effective_nodes"}, {"score": 0.0023666732429695908, "phrase": "selected_node"}, {"score": 0.002218526133566788, "phrase": "substitutive_node"}, {"score": 0.002182958452794581, "phrase": "execution_performance"}, {"score": 0.0021566565951738658, "phrase": "load_balancing"}], "paper_keywords": ["grid computing", " distributed computing", " load balancing"], "paper_abstract": "In recent years, network bandwidth and quality has been drastically improved, even much faster than the enhancement of computer performance. The various communication and computing tasks in the fields such as telecommunication, multimedia, information technology, and construction simulation, can be integrated and applied in a distributed computing environment nowadays. However, as the demands of many researches for computing resources gradually grow, Grid Computing integrated with a distributed computing environment and the Internet (network) has gained more attention. The so-called Grid Computing is to utilize the idle computing resources (nodes) on the network to facilitate the execution of complicated tasks that require large-scale computing. In other words, the composition of Grid resources is dynamic and varies with time. Thus, when selecting nodes for executing a task, the dynamic of the nodes in the Grid must be considered, and to exploit the effectiveness of the resources, they have to be properly selected according to the properties of the task. This study proposed a hybrid load balancing policy which integrated static and dynamic load balancing technologies to assist in the selection for effective nodes. In addition, if any selected node can no longer provide resources, it can be promptly identified and replaced with a substitutive node to maintain the execution performance and the load balancing of the system. (c) 2006 Elsevier B.V. All rights reserved.", "paper_title": "A hybrid load balancing policy underlying grid computing environment", "paper_id": "WOS:000243155600003"}