{"auto_keywords": [{"score": 0.038402945491775024, "phrase": "ontotag"}, {"score": 0.012693029021093597, "phrase": "software_tool"}, {"score": 0.011550844791367518, "phrase": "trends_project"}, {"score": 0.00481495049065317, "phrase": "design_inspiration"}, {"score": 0.004773568075885508, "phrase": "semantic"}, {"score": 0.004678317945062391, "phrase": "inspiration_help_designers"}, {"score": 0.0045324756541157574, "phrase": "emotional_impact"}, {"score": 0.004241995931481941, "phrase": "mood_boards"}, {"score": 0.0040743371651540345, "phrase": "design_concepts"}, {"score": 0.003959178192173982, "phrase": "trends"}, {"score": 0.0038351438570038195, "phrase": "inspirational_stage"}, {"score": 0.0037585630910593145, "phrase": "concept_cars"}, {"score": 0.0034274307414457477, "phrase": "general-purpose_lexical_ontology"}, {"score": 0.003407728065269377, "phrase": "ontoro"}, {"score": 0.003378385493203297, "phrase": "semantic_adjectives"}, {"score": 0.0033492947290751996, "phrase": "domain-specific_ontology"}, {"score": 0.003310973333995464, "phrase": "cta"}, {"score": 0.0032354070943654487, "phrase": "trends_database"}, {"score": 0.00308064351528802, "phrase": "semantic-based_algorithm"}, {"score": 0.0025029300115295317, "phrase": "earlier_approaches"}, {"score": 0.002452885602202018, "phrase": "machine_learning"}, {"score": 0.002417751896923312, "phrase": "tagged_corpuses"}, {"score": 0.0023557715482776694, "phrase": "words'_monosemy"}, {"score": 0.002255973756526505, "phrase": "proposed_approach"}, {"score": 0.0021479597698614373, "phrase": "industrial_collaborators"}, {"score": 0.0021050145465814343, "phrase": "doi"}], "paper_keywords": ["creativity", " design", " inspiration", " information retrieval", " concept indexing", " semantics", " ontology"], "paper_abstract": "Sources of inspiration help designers to define the context of their designs and reflect on the emotional impact of their new products. By observing and interpreting sources of inspiration, designers form vocabularies of terms, pallets of colors, or mood boards with images, which express their feelings, inspire their creativity and help them communicate design concepts. These ideas are the motivation behind the EU:funded project TRENDS, which aimed at developing a software tool that supports the inspirational stage of design by providing designers of concept cars with various sources of inspiration. This paper concentrates on OntoTag, the semantic-based image retrieval algorithm developed within the TRENDS project, and its evaluation. OntoTag uses concepts from a general-purpose lexical ontology called OntoRo, and semantic adjectives from a domain-specific ontology for designers called CTA, to index the images in the TRENDS database in a way which provides designers with a degree of serendipity and stimulates their creativity. The semantic-based algorithm involves the following four steps: (i) creating a collection of documents and images retrieved from the web, (ii) for each document, identifying the most frequently used keywords and phrases in the text around the image, (iii) identifying the most powerful concepts represented in each document, and (iv) ranking the concepts identified and linking them to the images in the collection. OntoTag differs significantly from earlier approaches as it does not rely on machine learning and the availability of tagged corpuses. Its main innovation is in the use of the words' monosemy and polysemy as a measure of their probability to belong to a certain concept. The proposed approach is illustrated with examples based on the software tool developed for the needs of two of the industrial collaborators involved in the TRENDS project. [DOI: 10.1115/1.3482061]", "paper_title": "In Search of Design Inspiration: A Semantic-Based Approach", "paper_id": "WOS:000283014600007"}