{"auto_keywords": [{"score": 0.029779977404552956, "phrase": "initial_state"}, {"score": 0.012870894511531328, "phrase": "stationary_and_time-averaged_limit_measures"}, {"score": 0.012587671866060744, "phrase": "two-phase_qw"}, {"score": 0.009597812781212158, "phrase": "stationary_measure"}, {"score": 0.008680183296758633, "phrase": "time-averaged_limit_measure"}, {"score": 0.00481495049065317, "phrase": "two-phase_quantum_walk"}, {"score": 0.004673079747693193, "phrase": "dependent_quantum_walk"}, {"score": 0.004053994613859937, "phrase": "mathematical_model"}, {"score": 0.004008749730113699, "phrase": "topological_insulator"}, {"score": 0.0037336520904376687, "phrase": "first_result"}, {"score": 0.00366443843576107, "phrase": "two-phase_qw."}, {"score": 0.003543059748318891, "phrase": "splitted_generating_function"}, {"score": 0.0034643747383816164, "phrase": "eigenvalue_problem"}, {"score": 0.0029602552900111407, "phrase": "explicit_expression"}, {"score": 0.0026160472919135444, "phrase": "starting_point_symmetry"}, {"score": 0.0025965187247488876, "phrase": "localization_effect"}, {"score": 0.00244543519230361, "phrase": "strong_effect"}, {"score": 0.002193600680263771, "phrase": "interesting_relation"}, {"score": 0.0021049977753042253, "phrase": "specific_periodicities"}], "paper_keywords": ["quantum walk", " two-phase model", " localization"], "paper_abstract": "We treat a position dependent quantum walk (QW) on the line which we assign two different time-evolution operators to positive and negative parts respectively. We call the model \"the two-phase QW\" here, which has been expected to be a mathematical model of the topological insulator. We obtain the stationary and time-averaged limit measures related to localization for the two-phase QW with one defect. This is the first result on localization for the two-phase QW. The analytical methods are mainly based on the splitted generating function of the solution for the eigenvalue problem, and the generating function of the weight of the passages of the model. In this paper, we call the methods \"the splitted generating function method\" and \"the generating function method\", respectively. The explicit expression of the stationary measure is asymmetric for the origin, and depends on the initial state and the choice of the parameters of the model. On the other hand, the time-averaged limit measure has a starting point symmetry and localization effect heavily depends on the initial state and the parameters of the model. Regardless of the strong effect of the initial state and the parameters, the time-averaged limit measure also suggests that localization can be always observed for our two-phase QW. Furthermore, our results imply that there is an interesting relation between the stationary and time-averaged limit measures when the parameters of the model have specific periodicities, which suggests that there is a possibility that we can analyze localization of the two-phase QW with one defect from the stationary measure.", "paper_title": "LIMIT THEOREMS OF A TWO-PHASE QUANTUM WALK WITH ONE DEFECT", "paper_id": "WOS:000380118700008"}