{"auto_keywords": [{"score": 0.040801524583702814, "phrase": "ga"}, {"score": 0.00481495049065317, "phrase": "automatic_thesaurus_construction"}, {"score": 0.004425616928975799, "phrase": "document_clustering"}, {"score": 0.004161072531550157, "phrase": "ir"}, {"score": 0.0035941231858949035, "phrase": "fuzzy_logic_controller"}, {"score": 0.003140004304719746, "phrase": "e.g._slow_evolution"}, {"score": 0.0029020077365708966, "phrase": "well-constructed_thesaurus"}, {"score": 0.002805597755796506, "phrase": "valuable_tool"}, {"score": 0.002758597251689795, "phrase": "effective_operation"}, {"score": 0.0025928815987676535, "phrase": "document_representation"}, {"score": 0.002450864311898833, "phrase": "important_relationships"}, {"score": 0.0023962545023307937, "phrase": "e.g._synonymy"}], "paper_keywords": ["information retrieval", " clustering", " classification", " thesaurus", " neural network", " genetic algorithm"], "paper_abstract": "This paper presents an intelligent information retrieval (IR) system based on automatic thesaurus construction for its applications of document clustering and classification. These two applications are the most influential and widely used fields amongst the IR research community. We apply two biologically inspired algorithms, i.e. genetic algorithm (GA) and neural network (NN), to these two fields. A fuzzy logic controller GA and an adaptive back-propagation NN are proposed in our study, which can validly overcome the problems existing in their archetypes, e.g. slow evolution and being prone to trap into a local optimum. Furthermore, a well-constructed thesaurus has been recognised as a valuable tool in the effective operation of clustering and classification. It solves the problem in document representation organised by a bag of words, where some important relationships between words, e.g. synonymy and polysemy, are ignored. To investigate how our IR system could be used effectively, we conduct experiments on four data sets from the benchmark Reuter-21578 document collection and 20-newsgroup corpus. The results reveal that our IR system enhances the performance in comparison with k-means, common GA, and conventional back-propagation NN.", "paper_title": "Intelligent information retrieval system using automatic thesaurus construction", "paper_id": "WOS:000288203200004"}