{"auto_keywords": [{"score": 0.050053102157152786, "phrase": "abelian_group_isomorphism"}, {"score": 0.032220313750456954, "phrase": "abelian"}, {"score": 0.004770211811866158, "phrase": "related_problems"}, {"score": 0.004108161406159407, "phrase": "n_elements"}, {"score": 0.003939033374807842, "phrase": "previous_upper_bound"}, {"score": 0.0038301525703886585, "phrase": "narayan_vikas"}, {"score": 0.0037069087922811488, "phrase": "abelian_p-group_isomorphism"}, {"score": 0.0035542408902458677, "phrase": "j._comput"}, {"score": 0.0035211747962710246, "phrase": "system_sci"}, {"score": 0.0028799352389969443, "phrase": "isomorphism_testing"}, {"score": 0.002853124436286834, "phrase": "abelian_groups"}, {"score": 0.0026974065918918275, "phrase": "algorithm_works"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["group", " Abelian", " isomorphism", " order", " nilpotent"], "paper_abstract": "We consider the problem of determining if two finite groups are isomorphic. The groups are assumed to be represented by their multiplication tables. We present an O(n) algorithm that determines if two Abelian groups with n elements each are isomorphic. This improves upon the previous upper bound of O(n log n) [Narayan Vikas, An O(n) algorithm for Abelian p-group isomorphism and an O(n log n) algorithm for Abelian group isomorphism, J. Comput. System Sci. 53 (1996) 1-9] known for this problem. We solve a more general problem of computing the orders of all the elements of any group (not necessarily Abelian) of size n in O(n) time. Our algorithm for isomorphism testing of Abelian groups follows from this result. We use the property that our order finding algorithm works for any group to design a simple O(n) algorithm for testing whether a group of size n, described by its multiplication table, is nilpotent. We also give an O(n) algorithm for determining if a group of size n, described by its multiplication table, is Abelian. (C) 2007 Elsevier Inc. All rights reserved.", "paper_title": "Linear time algorithms for Abelian group isomorphism and related problems", "paper_id": "WOS:000248133700009"}