{"auto_keywords": [{"score": 0.004773009410192688, "phrase": "impact"}, {"score": 0.004668127606616525, "phrase": "throughput"}, {"score": 0.004523865550323285, "phrase": "computer_system"}, {"score": 0.004339609346924681, "phrase": "processor_and_memory_technologies"}, {"score": 0.003542976343910816, "phrase": "system_memory_buffers"}, {"score": 0.0035063024767122684, "phrase": "dma_transactions"}, {"score": 0.003434085751246066, "phrase": "hardware_engines"}, {"score": 0.003380897678672156, "phrase": "software_protocol_abstraction_layers"}, {"score": 0.0032769720645483102, "phrase": "rudimentary_embedded_controllers"}, {"score": 0.0032430426853131346, "phrase": "central_processing_unit"}, {"score": 0.003078577062864183, "phrase": "hardware_dma_transfers"}, {"score": 0.002759769970554556, "phrase": "accelerator_functions"}, {"score": 0.002619748321217153, "phrase": "cpu_overhead"}, {"score": 0.00253916011199984, "phrase": "current_state"}], "paper_keywords": [""], "paper_abstract": "Computer system input/output (I/O) has evolved with processor and memory technologies in terms of reducing latency, increasing bandwidth, and other factors. As requirements increase for I/O, such as networking, storage, and video, descriptor-based direct memory access (DMA) transactions have become more important in high-performance systems to move data between I/O adapters and system memory buffers. DMA transactions are done with hardware engines below the software protocol abstraction layers in all systems other than rudimentary embedded controllers. Central processing unit (CPUs) can switch to other tasks by offloading hardware DMA transfers to the I/O adapters. Each I/O interface has one or more separately instantiated descriptor-based DMA engines optimized for a. given I/O port. I/O transactions are optimized by accelerator functions to reduce latency, improve throughput, and reduce CPU overhead. This chapter surveys the current state of high-performance I/O architecture advances and explores benefits and limitations. With the proliferation of CPU multicores within a system, multi-GB/s ports, and on-die integration of system functions, changes beyond the techniques surveyed may be needed for optimal I/O architecture performance.", "paper_title": "Survey on System I/O Hardware Transactions and Impact on Latency, Throughput, and Other Factors", "paper_id": "WOS:000331017000002"}