{"auto_keywords": [{"score": 0.012531028140620994, "phrase": "target_object"}, {"score": 0.008613353177281137, "phrase": "cloning_random_walker"}, {"score": 0.004490212943845175, "phrase": "resource_sharing"}, {"score": 0.004336115760817672, "phrase": "first_and_foremost_challenge"}, {"score": 0.004219912413995784, "phrase": "target_objects"}, {"score": 0.003950453462399077, "phrase": "searching_efficiency"}, {"score": 0.0034618794528555063, "phrase": "better_trade"}, {"score": 0.003408512155673965, "phrase": "long_searching_time"}, {"score": 0.003329994649432498, "phrase": "duplicated_query_messages"}, {"score": 0.0032914145394036657, "phrase": "low_successful_search_hit_rate"}, {"score": 0.002975178815784779, "phrase": "popular_object"}, {"score": 0.002566685388128598, "phrase": "moderate_amount"}, {"score": 0.0025468074858862964, "phrase": "query_messages"}, {"score": 0.0025172781808293827, "phrase": "message_amount"}, {"score": 0.00243072375406841, "phrase": "flooding_method"}, {"score": 0.0022664208122072657, "phrase": "search_delay"}, {"score": 0.002248863090203165, "phrase": "message_overhead"}, {"score": 0.0022141537427057363, "phrase": "success_rate"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Peer-to-Peer networks", " Resource searching", " Cloning Random Walker", " Dominating Set"], "paper_abstract": "Peer-to-Peer (P2P) networks have been developed for resource sharing for years. In a P2P network, the first and foremost challenge is resource searching to find out target objects (i.e., data, file, etc.) scattered in the P2P network. The searching efficiency highly depends on the popularity of the target object. However, the popularity is too variable to be estimated since a P2P network is dynamic. A good searching scheme in such a variable environment with a better trade-off among long searching time, a large amount of duplicated query messages and a low successful search hit rate is hard to be determined. Many efficient methods have been proposed to resolve this issue. Most of them may only be beneficial for searching a popular object. In this paper, we propose a Cloning Random Walker assisted by Dominating Set (CloneRW + DS) method to adaptively locate the target object no matter the target object is popular or unpopular in a P2P network. Our theoretical analysis shows that our proposed method consumes a moderate amount of query messages between the message amount in the Random Walker method and the one in the flooding method. Additionally, our simulation results also depict that our proposed scheme can perform a better trade-off among the search delay, message overhead per hit and success rate while conducting resource searching in a P2P network. (C) 2010 Elsevier B.V. All rights reserved.", "paper_title": "Resource searching in an unstructured P2P network based on Cloning Random Walker assisted by Dominating Set", "paper_id": "WOS:000288357900015"}