{"auto_keywords": [{"score": 0.039027278312474004, "phrase": "real-time_traffic"}, {"score": 0.007371405503413099, "phrase": "tcp_traffic"}, {"score": 0.00481495049065317, "phrase": "mixed_real-time"}, {"score": 0.004592905436175987, "phrase": "vigorous_debate"}, {"score": 0.0044706300051082035, "phrase": "core_internet_routers"}, {"score": 0.004440570928903645, "phrase": "recent_arguments"}, {"score": 0.004278807087784626, "phrase": "core_router_buffer_sizes"}, {"score": 0.004164858807302222, "phrase": "acceptable_end-to-end_tcp_throughputs"}, {"score": 0.004013098289856805, "phrase": "optical_packet"}, {"score": 0.0038538167879752137, "phrase": "optical_signals"}, {"score": 0.003802135020791801, "phrase": "prior_studies"}, {"score": 0.0035539019235553897, "phrase": "internet_service_providers"}, {"score": 0.003115354317501177, "phrase": "specific_range"}, {"score": 0.0030943793545344495, "phrase": "buffer_size"}, {"score": 0.002971453391894977, "phrase": "anomalous_behavior"}, {"score": 0.0028824650336365465, "phrase": "anomalous_loss_performance"}, {"score": 0.002815093247670994, "phrase": "synthetic_traffic"}, {"score": 0.0027961342030212353, "phrase": "real_video_traces"}, {"score": 0.0027400176498756823, "phrase": "quantitative_models"}, {"score": 0.002685024286204446, "phrase": "buffer_sharing"}, {"score": 0.00266693888510356, "phrase": "real-time_and_tcp_traffic"}, {"score": 0.002417990463433715, "phrase": "tcp"}, {"score": 0.002385479082527538, "phrase": "packet_sizes"}, {"score": 0.0021049977753042253, "phrase": "desired_performance_balance"}], "paper_keywords": ["Anomalous loss performance", " mixed TCP and real-time traffic", " optical packet switched (OPS) networks", " routers with very small buffers"], "paper_abstract": "In the past few years there has been vigorous debate regarding the size of buffers required at core Internet routers. Recent arguments supported by theory and experimentation show that under certain conditions, core router buffer sizes of a few tens of packets suffice for realizing acceptable end-to-end TCP throughputs. This is a significant step toward the realization of optical packet switched (OPS) networks, which are inherently limited in their ability to buffer optical signals. However, prior studies have largely ignored the presence of real-time traffic, which is increasing in importance as a source of revenue for Internet service providers. In this paper, we study the interaction that happens between real-time (open-loop) and TCP (closed-loop) traffic when they multiplex at buffers of very small size (few tens of packets) and make a significant discovery-namely that in a specific range of buffer size, real-time traffic losses increase as buffer size becomes larger. Our contributions pertaining to this anomalous behavior are threefold. First, we exhibit this anomalous loss performance for real-time traffic via extensive simulations using synthetic traffic and real video traces. Second, we develop quantitative models that reveal the dynamics of buffer sharing between real-time and TCP traffic that lead to this behavior. Third, we show how various factors such as the nature of real-time traffic, mixture of long-lived and short-lived TCP flows, and packet sizes impact the severity of the anomaly. Our study is the first to consider interactions between real-time and TCP traffic in very small (potentially all-optical) buffers and informs router manufacturers and network operators of the factors to consider when dimensioning such small buffer sizes for desired performance balance between real-time and TCP traffic.", "paper_title": "Anomalous Loss Performance for Mixed Real-Time and TCP Traffic in Routers With Very Small Buffers", "paper_id": "WOS:000294007700001"}