{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "propositional_abduction"}, {"score": 0.004529093447865156, "phrase": "background_knowledge"}, {"score": 0.004316396683332752, "phrase": "query_q"}, {"score": 0.004260134699483774, "phrase": "knowledge_p"}, {"score": 0.00398959232769596, "phrase": "artificial_intelligence"}, {"score": 0.0037361664435836845, "phrase": "complexity-theoretic_point"}, {"score": 0.003498782065781398, "phrase": "schaefer's_famous_framework"}, {"score": 0.003393206299636482, "phrase": "knowledge_bases"}, {"score": 0.0032621183241997777, "phrase": "generalized_conjunctive_normal_form"}, {"score": 0.0031775430407770026, "phrase": "propositional_formulas"}, {"score": 0.0030547611342112693, "phrase": "fixed_finite_language"}, {"score": 0.0027874901248741697, "phrase": "np"}, {"score": 0.002530359917257626, "phrase": "assumption-based_solutions"}, {"score": 0.0024113009621042677, "phrase": "distinguished_subset"}, {"score": 0.0021610874773389096, "phrase": "negative_queries"}], "paper_keywords": ["abduction", " propositional logic", " complexity", " Boolean constraints"], "paper_abstract": "Abduction is the process of explaining a given query with respect to some background knowledge. For instance, p is an explanation for the query q given the knowledge p --> q. This problem is well known to have many applications, particularly in artificial intelligence (AI), and has been widely studied from both an AI and a complexity-theoretic point of view. In this paper we completely classify the complexity of propositional abduction in Schaefer's famous framework. We consider the case where knowledge bases are taken from a class of formulas in generalized conjunctive normal form. This means that the propositional formulas considered are conjunctions of constraints taken from a fixed finite language. We show that according to the properties of this language, deciding whether at least one explanation exists is either polynomial, NP-complete, or Sigma P-2-complete. Our results are stated for a query consisting of a single, positive literal and for assumption-based solutions, i.e., the solutions must be formed upon a distinguished subset of the variables that is part of the input. We show, however, that our results can be interpreted \"dually\" for negative queries, and thus also for unrestricted ( positive or negative) queries.", "paper_title": "A complete classification of the complexity of propositional abduction", "paper_id": "WOS:000238324600010"}