{"auto_keywords": [{"score": 0.044099692473766064, "phrase": "mobile_terminal"}, {"score": 0.01419230848350683, "phrase": "uicc"}, {"score": 0.004767826806287385, "phrase": "wibro"}, {"score": 0.004299910946753963, "phrase": "universal_ic_card"}, {"score": 0.003709693561373117, "phrase": "uicc's_identification_information"}, {"score": 0.0036194914688460656, "phrase": "plain_text"}, {"score": 0.003462599815177726, "phrase": "aaa_authentication_server"}, {"score": 0.0033617891884360606, "phrase": "authentication_mechanism"}, {"score": 0.0030614565460256897, "phrase": "strong_means"}, {"score": 0.0028857130140890787, "phrase": "existing_method"}, {"score": 0.0028574164693918433, "phrase": "otp_creation"}, {"score": 0.0027605398374811667, "phrase": "counter_asynchronization"}, {"score": 0.0026277995163948263, "phrase": "input_values"}, {"score": 0.0024405312482831646, "phrase": "automatically_generated_counter"}, {"score": 0.0021049977753042253, "phrase": "ubiquitous_environment"}], "paper_keywords": ["OTP", " Wireless broadband internet", " Authentication mechanism", " Mobile-OTP"], "paper_abstract": "WiBro (Wireless Broadband Internet), representative service that offer mobility, provides its service through authentication between the UICC (Universal IC Card) of the mobile terminal and the AAA (Authentication, Authorization, and Account) authentication server. However, it raises the problem that the privacy of the mobile terminal and the user can be violated, because the UICC's identification information is exposed as a plain text when the UICC sends an, initial request to the AAA authentication server. This paper proposes an authentication mechanism based on the OTP (One-Time Password), which is currently attracting attention as a strong means of authentication, in order to resolve these problems. The existing method of OTP creation raises the problem of time and counter asynchronization as the time and counter are used as the input values. On this contrary, this paper alleviates the problem of asynchronization using an automatically generated counter. In addition, the privacy of the mobile terminal and the user can be protected because mobility is assured using mOTP (mobile-OTP) based on the ubiquitous environment.", "paper_title": "Study on a Safe and Efficient mOTP (mobile-OTP) Authentication Mechanism for the Mobile Environment", "paper_id": "WOS:000271592800008"}