{"auto_keywords": [{"score": 0.04398127469809769, "phrase": "prototyping_process"}, {"score": 0.00481495049065317, "phrase": "formal_models"}, {"score": 0.00475413908468027, "phrase": "role_activity_diagrams"}, {"score": 0.004294381488413906, "phrase": "previous_research"}, {"score": 0.004258128672571261, "phrase": "informal_aspects"}, {"score": 0.004116139569480336, "phrase": "key_concerns"}, {"score": 0.0033437537557378157, "phrase": "evolvable_prototypes"}, {"score": 0.003301461490509176, "phrase": "industrial_setting"}, {"score": 0.00327356326590461, "phrase": "grounded_theory"}, {"score": 0.0031912706211861324, "phrase": "relevant_data"}, {"score": 0.003071682293903262, "phrase": "interview_text"}, {"score": 0.002870006736445581, "phrase": "supportive_action"}, {"score": 0.0026475981474045414, "phrase": "prototyping_team"}, {"score": 0.0025810006125483835, "phrase": "cost_pressure"}, {"score": 0.0024947959375982614, "phrase": "prototyper_concerns"}, {"score": 0.0023408288327263316, "phrase": "informal_analysis"}, {"score": 0.002196342933346204, "phrase": "formal_analysis"}, {"score": 0.0021049977753042253, "phrase": "human_factors"}], "paper_keywords": [""], "paper_abstract": "The use of formal models such as Role Activity Diagrams (RADs) for analysing a process often hide what really happens during that process. In this paper, we build on previous research on informal aspects of the prototyping process and look at the key concerns that prototypers had during the prototyping process. We contrasted those concerns with an analysis of whether documented practice during prototyping was likely to exacerbate or lessen those concerns. The basis of our analysis was a set of interviews with prototypers all of whom were part of a team actively producing evolvable prototypes in an industrial setting. Grounded Theory was used to extract the relevant data (concerns and mitigating practice) from the interview text. Interestingly, only a small number of the concerns of prototypers seemed to be supported by any supportive action, suggesting that there are factors that contribute to project success or failure beyond the control of the prototyping team. However, time and cost pressure seemed to figure largest in our analysis of prototyper concerns. The research highlights the problems that prototypers face and the benefits that an informal analysis can have on our understanding of the process. It also complements our understanding of the formal analysis of process using techniques such as RADs and the human factors therein.", "paper_title": "The concerns of prototypers and their mitigating practices: An industrial case-study", "paper_id": "WOS:000239485900012"}