{"auto_keywords": [{"score": 0.049447946898790056, "phrase": "pim"}, {"score": 0.00481495049065317, "phrase": "personal_information_management_research"}, {"score": 0.004783105609960904, "phrase": "purpose-personal_information_management"}, {"score": 0.0044169318855693356, "phrase": "pim_research"}, {"score": 0.004358676214574977, "phrase": "infant_stage"}, {"score": 0.004329835888760592, "phrase": "exploratory_studies"}, {"score": 0.004038249989123055, "phrase": "pim_behaviour"}, {"score": 0.0039323878878973284, "phrase": "current_research"}, {"score": 0.003854809457075099, "phrase": "exploratory_study"}, {"score": 0.0035712919163869176, "phrase": "variable's_axis"}, {"score": 0.0034892010527109024, "phrase": "high_and_low_degree"}, {"score": 0.0034203358208034973, "phrase": "redundancy_variable"}, {"score": 0.003341703245432554, "phrase": "later_analysis"}, {"score": 0.0031581587465429593, "phrase": "five_categories"}, {"score": 0.0025191653363555214, "phrase": "future_research"}, {"score": 0.002133196554995389, "phrase": "first_research"}, {"score": 0.0021049977753042253, "phrase": "pim_variables"}], "paper_keywords": ["Personal information management", " Exploratory study", " Between subjects variability", " Information", " Information management"], "paper_abstract": "Purpose-Personal information management (PIM) is an activity in which an individual stores personal information items in order to retrieve them later on. As PIM research moves from an infant stage of exploratory studies to more rigorous quantitative ones, there is a need to identify and map variables that characterize and account for the variety of PIM behaviour. This is the aim of the current research. Design/methodology/approach-In an exploratory study, 20 semi-structured 90-minute interviews were recorded and transcribed. Variables were found by comparing the behaviors of participants who represent the two extreme poles of each variable's axis (i.e. when two participants showed a high and low degree of document redundancy, the redundancy variable was identified). In a later analysis, the variables were grouped into categories. Findings-The paper identifies 15 variables grouped in five categories: organization related variables (order, redundancy and name meaning), structure variables (collection size, folder depth, folder breadth and folder size), work process variables (attendance time and modality), memory related variables (memory reliance, dominant memory) and retrieval variables (retrieval type, retrieval success, retrieval time and ubiquity). Research limitations/implications-Future research could make use of these variables in order to: measure their distribution, find relations between them, test how they are affected by variables external to PIM (e.g. systems design) and find how they affect other dependent variables (e.g. productivity). Originality/value-This is the first research that systematically explores PIM variables.", "paper_title": "Variables for personal information management research", "paper_id": "WOS:000325953900001"}