{"auto_keywords": [{"score": 0.04954756810706401, "phrase": "cal"}, {"score": 0.00481495049065317, "phrase": "future_computer_assisted_learning"}, {"score": 0.004502943680955863, "phrase": "ssci_journals"}, {"score": 0.0039822874870125095, "phrase": "future_research"}, {"score": 0.003561205990687285, "phrase": "study's_general_findings"}, {"score": 0.003367611042980526, "phrase": "recent_depictions"}, {"score": 0.0030113280682863234, "phrase": "individual_publications"}, {"score": 0.0029612292670237505, "phrase": "far_greater_collective_influence"}, {"score": 0.0026330549554033876, "phrase": "disabled_children"}, {"score": 0.0025892330566358503, "phrase": "home_schooling"}, {"score": 0.002475898613632249, "phrase": "school_student's_learning"}, {"score": 0.0023941575109692314, "phrase": "interesting_snapshot"}, {"score": 0.0021049977753042253, "phrase": "cal-related_topics"}], "paper_keywords": [""], "paper_abstract": "This study surveyed 536 CAL publications in 71 SSCI (Social Science Citation Index) journals from 1998 to February 2006 to identify trends and lacunae for future research. The parameters and keywords employed by the authors are first presented, followed by a description of the study's general findings. A comparison is then drawn between CAL and recent depictions of the \"biogosphere,\" for the majority of the contributors to the field produced only a few articles and authors of individual publications demonstrated a far greater collective influence on the field than the more frequently-cited authors. Results also revealed that the amount of articles pertaining to the aged, disabled children, and home schooling were significantly lower than those relating to school student's learning. This study offers an interesting snapshot of a field that is apparently on the rise; moreover, it raises some issues to be addressed in further research on CAL-related topics.", "paper_title": "Trends and lacunae for future computer assisted learning (CAL) research: An assessment of the literature in SSCI journals from 1998-2006", "paper_id": "WOS:000256179200012"}