{"auto_keywords": [{"score": 0.047312672178818495, "phrase": "cbm"}, {"score": 0.008713740896131096, "phrase": "condition-based_maintenance"}, {"score": 0.008459556606903892, "phrase": "extensive_literature_review"}, {"score": 0.007996691664767734, "phrase": "real-time_sensor_data"}, {"score": 0.007671792074194806, "phrase": "proactive_decision"}, {"score": 0.0047864177420244795, "phrase": "purpose_-_the_purpose"}, {"score": 0.004456872931482395, "phrase": "proactive_online_recommendations"}, {"score": 0.004113064886401964, "phrase": "manufacturing_challenges"}, {"score": 0.004076533120753605, "phrase": "main_principles"}, {"score": 0.0040163635646888645, "phrase": "paper_reviews"}, {"score": 0.003992544149307519, "phrase": "main_frameworks"}, {"score": 0.0037396377535454887, "phrase": "decision_making"}, {"score": 0.0034202949436614723, "phrase": "decision_support"}, {"score": 0.0031750418391373035, "phrase": "proposed_framework"}, {"score": 0.0031561961485589633, "phrase": "proactive_decision_making"}, {"score": 0.003128136484949595, "phrase": "cbm_concept"}, {"score": 0.0028608622935131067, "phrase": "decision_space"}, {"score": 0.002719644855867468, "phrase": "possible_inputs"}, {"score": 0.0025020469669826497, "phrase": "proactive_recommendations"}, {"score": 0.00236437009958525, "phrase": "maintenance_management"}, {"score": 0.0021622120805979937, "phrase": "paper_form"}, {"score": 0.0021049977753042253, "phrase": "proactive_decision_support_system"}], "paper_keywords": ["Decision making", " Condition-based maintenance", " E-maintenance", " Proactivity", " Real-time data", " Recommendations"], "paper_abstract": "Purpose - The purpose of this paper is to perform an extensive literature review in the area of decision making for condition-based maintenance (CBM) and identify possibilities for proactive online recommendations by considering real-time sensor data. Based on these, the paper aims at proposing a framework for proactive decision making in the context of CBM. Design/methodology/approach - Starting with the manufacturing challenges and the main principles of maintenance, the paper reviews the main frameworks and concepts regarding CBM that have been proposed in the literature. Moreover, the terms of e-maintenance, proactivity and decision making are analysed and their potential relevance to CBM is identified. Then, an extensive literature review of methods and techniques for the various steps of CBM is provided, especially for prognosis and decision support. Based on these, limitations and gaps are identified and a framework for proactive decision making in the context of CBM is proposed. Findings - In the proposed framework for proactive decision making, the CBM concept is enriched in the sense that it is structured into two components: the information space and the decision space. Moreover, it is extended in a way that decision space is further analyzed according to the types of recommendations that can be provided. Moreover, possible inputs and outputs of each step are identified. Practical implications - The paper provides a framework for CBM representing the steps that need to be followed for proactive recommendations as well as the types of recommendations that can be given. The framework can be used by maintenance management of a company in order to conduct CBM by utilizing real-time sensor data depending on the type of decision required. Originality/value - The results of the work presented in this paper form the basis for the development and implementation of proactive Decision Support System (DSS) in the context of maintenance.", "paper_title": "A proactive decision making framework for condition-based maintenance", "paper_id": "WOS:000360575300003"}