{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "multidisciplinary_communication"}, {"score": 0.004694092086199672, "phrase": "effective_and_timely_communication"}, {"score": 0.004605434064238641, "phrase": "quality_patient_care"}, {"score": 0.004576253356889219, "phrase": "information_and_communication_technology_tools"}, {"score": 0.004461359547152617, "phrase": "health_care_processes"}, {"score": 0.004146791234307539, "phrase": "electronic_whiteboard"}, {"score": 0.0038789122930433305, "phrase": "inpatient_whiteboard"}, {"score": 0.00385431710959668, "phrase": "scope_discussions"}, {"score": 0.003829877278269543, "phrase": "workflow_analyses"}, {"score": 0.00369819191449264, "phrase": "central_project_team"}, {"score": 0.0034154440860550564, "phrase": "whiteboard_usage"}, {"score": 0.0031542454984159634, "phrase": "accurate_snapshot_view"}, {"score": 0.0031242709509664837, "phrase": "current_patient_activity"}, {"score": 0.0030554300179552415, "phrase": "survey_participants"}, {"score": 0.0029502941554043964, "phrase": "care_team"}, {"score": 0.0026140878612307536, "phrase": "work_practices"}, {"score": 0.0024921488266216024, "phrase": "positive_change"}, {"score": 0.00247632489362785, "phrase": "whiteboard_utilization"}, {"score": 0.0023309080951251335, "phrase": "overall_change_management_methodologies"}, {"score": 0.002286781334850213, "phrase": "project_development_lifecycle"}, {"score": 0.0022722584151582616, "phrase": "subsequent_continuous_improvement_initiatives"}, {"score": 0.0022506463983707954, "phrase": "multidisciplinary_care_team"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ireland_ltd."}], "paper_keywords": ["Whiteboard", " Communication", " Multidisciplinary care", " Information", " Technology"], "paper_abstract": "Objectives: Effective and timely communication of information is essential for quality patient care. Information and communication technology tools have the potential to transform and enable health care processes to be more accurate, timely, and integrated. This study describes the development, implementation, and evaluation of an electronic whiteboard in a General Internal Medicine (GIM) inpatient unit of an acute care hospital. Methods: The development, implementation, and evaluation of the inpatient whiteboard included scope discussions, workflow analyses, communication and training, and issues and enhancement reporting, all managed through a central project team. Evaluation of the whiteboard was two-fold: a survey given to allied health, nursing and physician disciplines (n = 120), and an audit performed on whiteboard usage. Results: The whiteboard displays relevant, real-time patient information, in a single, highly visible, user-friendly display. With a quick glance at the whiteboard, one can get an accurate snapshot view of the current patient activity in the unit. Approximately 71% of survey participants believed that the whiteboard improves and standardizes communication within the care team. Further, approximately 62% of the participants agreed that the whiteboard saves them time when searching for information on a patient and their care plan. In addition, the whiteboard has had an impact on the work practices of many GIM care providers, and it along with its users has acted together as agents for positive change. Whiteboard utilization has significantly increased since its implementation. Conclusions: The success of the whiteboard is in part due to overall change management methodologies through collaborative development throughout the project development lifecycle and subsequent continuous improvement initiatives. The multidisciplinary care team embraced the tool, took ownership of it, and tailored it to meet their needs. (c) 2008 Elsevier Ireland Ltd. All rights reserved.", "paper_title": "Electronic inpatient whiteboards: Improving multidisciplinary communication and coordination of care", "paper_id": "WOS:000264669200003"}