{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "e-security_seals"}, {"score": 0.004256895619944631, "phrase": "e-commerce_firm_reputation"}, {"score": 0.004191829338769843, "phrase": "customers'_perceptions"}, {"score": 0.004085579055228594, "phrase": "service_provider"}, {"score": 0.00374399358035391, "phrase": "exploratory_study_methodology"}, {"score": 0.0035932440062595252, "phrase": "questionnaire_survey"}, {"score": 0.0035021127041237887, "phrase": "consumer_knowledge"}, {"score": 0.003378385493203297, "phrase": "survey_data"}, {"score": 0.0028221322455573624, "phrase": "positive_belief"}, {"score": 0.002708399936381754, "phrase": "-_third-party_e-security_seals_organisations"}, {"score": 0.0021377414429251647, "phrase": "consumer_confidence"}, {"score": 0.0021049977753042253, "phrase": "online_environment"}], "paper_keywords": ["Data security", " Trust", " Electronic commerce", " Internet shopping", " Consumer behaviour", " Decision making"], "paper_abstract": "Purpose - The purpose of this paper is to examine the use of e-security seals on web sites and their relative impact on e-commerce firm reputation in influencing customers' perceptions of trust in a service provider. Design/methodology/approach - Two interrelated empirical studies are conducted to evaluate the use and impacts of e-security seals in e-commerce. An exploratory study methodology investigates the use of e-security seals and a questionnaire survey is used to gauge consumer knowledge of seals. Findings - Using survey data from 211 web users, the results show that 106 respondents are cognitive and affective of e-security seals. The results also provide further clarification of the relationship between e-security seals and sales effectiveness. The findings point towards a positive belief by consumers in e-security seals. Research implications - Third-party e-security seals organisations; should undertake more promotional activities and advertising to educate comsumers about the use and benefits of e-security seals. Originality/value - An important issue in e-commerce is how trust is developed between consumers and e-vendors. This paper investigates the use of e-security seals and their influence on consumer confidence in the online environment.", "paper_title": "An empirical study of the use of e-security seals in e-commerce", "paper_id": "WOS:000270768100002"}