{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "videogame_preservation"}, {"score": 0.004270665568018583, "phrase": "important_cultural_and_economic_artifacts"}, {"score": 0.003916098498242888, "phrase": "complex_digital_interactive_system"}, {"score": 0.0034963129868796033, "phrase": "software_systems"}, {"score": 0.003427032390942116, "phrase": "significant_hardware"}, {"score": 0.002861961643289598, "phrase": "traditional_technology-related_issues"}, {"score": 0.0027865506182608263, "phrase": "digital_preservation_endeavors"}, {"score": 0.002537880772794665, "phrase": "traditional_acts"}, {"score": 0.0025042115651986332, "phrase": "technology_preservation"}, {"score": 0.002421975107313603, "phrase": "collection_development"}, {"score": 0.002389839896897424, "phrase": "future_work"}, {"score": 0.002295964130868963, "phrase": "important_user_groups"}, {"score": 0.002220551141101661, "phrase": "games'_context"}, {"score": 0.0021049977753042253, "phrase": "representational_models"}], "paper_keywords": [""], "paper_abstract": "Videogames are important cultural and economic artifacts. They also present challenges that anticipate the problems inherent in any complex digital interactive system. Not only are they digital and hence very difficult to preserve but they also are software systems that have significant hardware, peripheral, and network dependencies, which are difficult to collect and formally represent. This article reviews the literature related to videogame preservation. In addition to covering the traditional technology-related issues inherent in all digital preservation endeavors, this review also attempts to describe the complexities and relationships between the traditional acts of technology preservation, representation, and collection development. Future work should include the identification of important user groups, an examination of games' context of use, and the development of representational models to describe interaction of players with the game and the interactions between players playing the game.", "paper_title": "Videogame Preservation and Massively Multiplayer Online Role-Playing Games: A Review of the Literature", "paper_id": "WOS:000295458700002"}