{"auto_keywords": [{"score": 0.04253389755075312, "phrase": "software_documentation_cost"}, {"score": 0.0154751943931034, "phrase": "software_documentation"}, {"score": 0.013919878894119359, "phrase": "documentation_cost"}, {"score": 0.013515899535253518, "phrase": "existing_literature"}, {"score": 0.012275167764233671, "phrase": "primary_papers"}, {"score": 0.00933564377299937, "phrase": "documentation_quality"}, {"score": 0.00481495049065317, "phrase": "software_development_documentation"}, {"score": 0.004711150412661492, "phrase": "integral_part"}, {"score": 0.004683229874709012, "phrase": "software_development_process"}, {"score": 0.004421680592547561, "phrase": "comprehensive_model"}, {"score": 0.003972802150955097, "phrase": "systematic-mapping_methodology"}, {"score": 0.003941416996633296, "phrase": "existing_body"}, {"score": 0.003677121952927709, "phrase": "exclusion_criteria"}, {"score": 0.003576416581189716, "phrase": "systematic_map"}, {"score": 0.0034715658596258018, "phrase": "systematic_mapping"}, {"score": 0.0034578191978753997, "phrase": "different_research_aspects"}, {"score": 0.0033630995991663234, "phrase": "key_findings"}, {"score": 0.003323301290376357, "phrase": "validation_research_papers"}, {"score": 0.003264482257318466, "phrase": "solution_proposals"}, {"score": 0.0031561961485589663, "phrase": "development_life-cycle_model"}, {"score": 0.0030034233905090594, "phrase": "average_number"}, {"score": 0.0029796734229812936, "phrase": "survey-based_papers"}, {"score": 0.0027522340188241446, "phrase": "quality_attributes"}, {"score": 0.0025572992567637395, "phrase": "online_paper_repository"}, {"score": 0.002472412920623605, "phrase": "research_area"}, {"score": 0.002423798861133843, "phrase": "documentation_cost_aspect"}, {"score": 0.0023620234256885304, "phrase": "systematic_methods"}, {"score": 0.002310980435492671, "phrase": "substantial_number"}, {"score": 0.002168664249034287, "phrase": "large-scale_development_projects"}, {"score": 0.002151501005004037, "phrase": "large_number"}, {"score": 0.002142970278347126, "phrase": "study_participants"}], "paper_keywords": ["Software documentation", " Documentation benefit", " Systematic mapping"], "paper_abstract": "Context: Software documentation is an integral part of any software development process. Researchers and practitioners have expressed concerns about costs, benefits and quality of software documentation in practice. On the one hand, there is a lack of a comprehensive model to evaluate the quality of documentation. On the other hand, researchers and practitioners need to assess whether documentation cost outweighs its benefit. Objectives: In this study, we aim to summarize the existing literature and provide an overview of the field of software documentation cost, benefit and quality. Method: We use the systematic-mapping methodology to map the existing body of knowledge related to software documentation cost, benefit and quality. To achieve our objectives, 11 Research Questions (RQ) are raised. The primary papers are carefully selected. After applying the inclusion and exclusion criteria, our study pool included a set of 69 papers from 1971 to 2011. A systematic map is developed and refined iteratively. Results: We present the results of a systematic mapping covering different research aspects related to software documentation cost, benefit and quality (RQ1-11). Key findings include: (1) validation research papers are dominating (27 papers), followed by solution proposals (21 papers). (2) Most papers (61 out of 69) do not mention the development life-cycle model explicitly. Agile development is only mentioned in 6 papers. (3) Most papers include only one \"System under Study\" (SUS) which is mostly academic prototype. The average number of participants in survey-based papers is 106, the highest one having approximately 1000 participants. (4) In terms of focus of papers, 50 papers focused on documentation quality, followed by 37 papers on benefit, and 12 papers on documentation cost. (5) The quality attributes of documentation that appear in most papers are, in order: completeness, consistency and accessibility. Additionally, improved meta-models for documentation cost, benefit and quality are also presented. Furthermore, we have created an online paper repository of the primary papers analyzed and mapped during this study. Conclusion: Our study results show that this research area is emerging but far from mature. Firstly, documentation cost aspect seems to have been neglected in the existing literature and there are no systematic methods or models to measure cost. Also, despite a substantial number of solutions proposed during the last 40 years, more and stronger empirical evidences are still needed to enhance our understanding of this area. In particular, what we expect includes (1) more validation or evaluation studies; (2) studies involving large-scale development projects, or from large number of study participants of various organizations; (3) more industry-academia collaborations; (4) more estimation models or methods to assess documentation quality, benefit and, especially, cost. (C) 2014 Elsevier Inc. All rights reserved.", "paper_title": "Cost, benefits and quality of software development documentation: A systematic mapping", "paper_id": "WOS:000347131600012"}