{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "interpretive_flexibility"}, {"score": 0.00507766680923445, "phrase": "system's_functionality"}, {"score": 0.004777034835192062, "phrase": "information_technologies"}, {"score": 0.004448892453489832, "phrase": "specific_technology"}, {"score": 0.004396426822203258, "phrase": "divergent_opinions"}, {"score": 0.0042426974826585695, "phrase": "important_role"}, {"score": 0.004176102823067887, "phrase": "technical_artefacts"}, {"score": 0.003982500388997762, "phrase": "system's_technical_characteristics"}, {"score": 0.0037087324991876727, "phrase": "recent_contributions"}, {"score": 0.0034129490818185595, "phrase": "human_agent"}, {"score": 0.003359334465113303, "phrase": "technical_artefact"}, {"score": 0.0032161835102640372, "phrase": "artefact's_shaping_potential"}, {"score": 0.0031782087629067686, "phrase": "broad_aim"}, {"score": 0.002947868524740683, "phrase": "information_system's_technical_characteristics"}, {"score": 0.0027668603377225564, "phrase": "social_construction"}, {"score": 0.002418185868191525, "phrase": "initial_interpretations"}, {"score": 0.002278639906498682, "phrase": "stakeholder_interpretations"}, {"score": 0.0021049977753042253, "phrase": "divergent_interpretations"}], "paper_keywords": ["interpretive flexibility", " empowerment", " control", " systems development", " NHS", " community trusts", " United Kingdom"], "paper_abstract": "Interpretive flexibility - the capacity of a specific technology to sustain divergent opinions - has long been recognized as playing an important role in explaining how technical artefacts are socially constructed. What is less clear is how a system's technical characteristics might limit its ability to be interpreted flexibly. This gap in the literature has largely arisen because recent contributions to this debate have tended to be rather one-sided, focussing almost solely upon the role of the human agent in shaping the technical artefact, and in so doing either downplaying or ignoring the artefact's shaping potential. The broad aim of this study was to reappraise the nature and role of interpretive flexibility but giving as much consideration to how an information system's technical characteristics might limit its ability to be interpreted flexibly, as we do to its potential for social construction. In this paper, we use the results of two in-depth case studies, in order to propose a reconceptualization of the role of interpretive flexibility. In short, this model helps explain how the initial interpretations of stakeholders are significantly influenced by the scope and adaptability of the system's functionality. Stakeholder interpretations will then, in turn, influence how the system's functionality is appropriated and exploited by users, to allow divergent interpretations to be realized and sustained.", "paper_title": "A re-conceptualization of the interpretive flexibility of information technologies: redressing the balance between the social and the technical", "paper_id": "WOS:000243259000005"}