{"auto_keywords": [{"score": 0.04980405401021984, "phrase": "matlab"}, {"score": 0.008809328334033412, "phrase": "high_performance_computing_systems"}, {"score": 0.006922300107668472, "phrase": "state-of-the-art_static_compilers"}, {"score": 0.006726400327998418, "phrase": "fortran"}, {"score": 0.006461062951655943, "phrase": "matlab_par"}, {"score": 0.00481495049065317, "phrase": "high_performance"}, {"score": 0.00474614491353724, "phrase": "popular_dynamic_array-based_language"}, {"score": 0.004584978036864935, "phrase": "interactive_development_style"}, {"score": 0.004506449323192937, "phrase": "array_operators"}, {"score": 0.00429114801805935, "phrase": "static_types"}, {"score": 0.003780286517897356, "phrase": "matlab_programs"}, {"score": 0.0035788645387235395, "phrase": "scientific_programmers"}, {"score": 0.003558294449586273, "phrase": "better_use"}, {"score": 0.003487222504700868, "phrase": "large_semantic_gap"}, {"score": 0.0034571978126010073, "phrase": "array-based_dynamically-typed_nature"}, {"score": 0.0033204536265162114, "phrase": "high-level_array_abstractions"}, {"score": 0.003244748458248666, "phrase": "major_challenges"}, {"score": 0.003010389418340144, "phrase": "efficient_basis"}, {"score": 0.0028746373686059238, "phrase": "powerful_concurrency_constructs"}, {"score": 0.0027848658492780503, "phrase": "mclab_compiler_tools"}, {"score": 0.0027608716347791266, "phrase": "open_source"}, {"score": 0.0027056838446692173, "phrase": "compiler_researchers"}, {"score": 0.002690118949960196, "phrase": "end-user_matlab_programmers"}, {"score": 0.0025029300115295317, "phrase": "de_facto_mathworks'_matlab_system"}, {"score": 0.002335465722613665, "phrase": "correct_approach"}, {"score": 0.002255973756526505, "phrase": "integerokay_analysis"}, {"score": 0.0022300809511147305, "phrase": "double_variables"}, {"score": 0.0021049977753042253, "phrase": "de_facto_matlab_implementation"}], "paper_keywords": ["Experimentation", " Languages", " MATLAB", " X10", " source-to-source compiler"], "paper_abstract": "MATLAB is a popular dynamic array-based language commonly used by students, scientists and engineers who appreciate the interactive development style, the rich set of array operators, the extensive builtin library, and the fact that they do not have to declare static types. Even though these users like to program in MATLAB, their computations are often very compute-intensive and are better suited for emerging high performance computing systems. This paper reports on MIX 10, a source-to-source compiler that automatically translates MATLAB programs to X10, a language designed for \"Performance and Productivity at Scale\"; thus, helping scientific programmers make better use of high performance computing systems. There is a large semantic gap between the array-based dynamically-typed nature of MATLAB and the object-oriented, statically-typed, and high-level array abstractions of X10. This paper addresses the major challenges that must be overcome to produce sequential X10 code that is competitive with state-of-the-art static compilers for MATLAB which target more conventional imperative languages such as C and Fortran. Given that efficient basis, the paper then provides a translation for the MATLAB par for construct that leverages the powerful concurrency constructs in X10. The MIX 10 compiler has been implemented using the McLab compiler tools, is open source, and is available both for compiler researchers and end-user MATLAB programmers. We have used the implementation to perform many empirical measurements on a set of 17 MATLAB benchmarks. We show that our best MIX 10-generated code is significantly faster than the de facto Mathworks' MATLAB system, and that our results are competitive with state-of-the-art static compilers that target C and Fortran. We also show the importance of finding the correct approach to representing arrays in X10, and the necessity of an IntegerOkay analysis that determines which double variables can be safely represented as integers. Finally, we show that our X10-based handling of the MATLAB par for outperforms the de facto MATLAB implementation.", "paper_title": "MiX10: Compiling MATLAB to X10 for High Performance", "paper_id": "WOS:000348907400035"}