{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "tagging_systems"}, {"score": 0.006662119674507382, "phrase": "malicious_attacks"}, {"score": 0.004522796947899013, "phrase": "shared_resources"}, {"score": 0.004485200522202792, "phrase": "descriptive_strings"}, {"score": 0.004283913685201902, "phrase": "interesting_resources"}, {"score": 0.003875424718379985, "phrase": "tag_spam"}, {"score": 0.003197843245296877, "phrase": "tagging_system"}, {"score": 0.002856563331151566, "phrase": "trusted_moderator"}, {"score": 0.0028209599545587745, "phrase": "bad_postings"}, {"score": 0.0026384167183586015, "phrase": "user_tag_patterns"}, {"score": 0.002436888552432559, "phrase": "user_tagging_behavior"}, {"score": 0.0022886952510350416, "phrase": "taggers'_reliability"}, {"score": 0.002194929830604162, "phrase": "existing_approaches"}], "paper_keywords": ["Algorithms", " Experimentation", " Measurement", " Human Factors", " Tagging", " tag spam", " tagging models", " bookmarking systems"], "paper_abstract": "Tagging systems allow users to interactively annotate a pool of shared resources using descriptive strings called tags. Tags are used to guide users to interesting resources and help them build communities that share their expertise and resources. As tagging systems are gaining in popularity, they become more susceptible to tag spam: misleading tags that are generated in order to increase the visibility of some resources or simply to confuse users. Our goal is to understand this problem better. In particular, we are interested in answers to questions such as: How many malicious users can a tagging system tolerate before results significantly degrade? What types of tagging systems are more vulnerable to malicious attacks? What would be the effort and the impact of employing a trusted moderator to find bad postings? Can a system automatically protect itself from spam, for instance, by exploiting user tag patterns? In a quest for answers to these questions, we introduce a framework for modeling tagging systems and user tagging behavior. We also describe a method for ranking documents matching a tag based on taggers' reliability. Using our framework, we study the behavior of existing approaches under malicious attacks and the impact of a moderator and our ranking method.", "paper_title": "Combating Spam in Tagging Systems: An Evaluation", "paper_id": "WOS:000265880000005"}