{"auto_keywords": [{"score": 0.014688826238949494, "phrase": "image_retrieval"}, {"score": 0.012685908056769326, "phrase": "existing_works"}, {"score": 0.010758444207795325, "phrase": "objective_functions"}, {"score": 0.00481495049065317, "phrase": "evolutionary_learning"}, {"score": 0.004780334370089564, "phrase": "interactive_image_retrieval"}, {"score": 0.004661116930794176, "phrase": "evolutionary_algorithms"}, {"score": 0.004577777897335174, "phrase": "relevance_feedback"}, {"score": 0.004399616575575586, "phrase": "small_sample_size"}, {"score": 0.004197942881217177, "phrase": "user's_information"}, {"score": 0.003948043391567917, "phrase": "fundamental_requirement"}, {"score": 0.003416963042033614, "phrase": "objective_function"}, {"score": 0.003380165760569206, "phrase": "ea"}, {"score": 0.0033196177202591843, "phrase": "model_parameters"}, {"score": 0.0024950272594582673, "phrase": "five_test_databases"}, {"score": 0.0021904435447196884, "phrase": "existing_rf_methods"}, {"score": 0.002143416464171068, "phrase": "effective_and_efficient_approaches"}, {"score": 0.00212798823232243, "phrase": "sss"}, {"score": 0.0021049977753042253, "phrase": "region-based_image_retrieval"}], "paper_keywords": ["image retrieval", " relevance feedback", " evolutionary algorithms", " small sample size performance", " retrieval performance evaluation"], "paper_abstract": "We systematically compare four variants of evolutionary algorithms (EAs) for relevance feedback (RF) in image retrieval. We focus on the small sample size (SSS) performance, i.e., the requirement to learn the user's information need based on a small - between 2 and 25 - number of positive and negative training images. Despite this being a fundamental requirement, none of the existing works dealing with EAs for RF in image retrieval addresses it. Common for the four variants is the hierarchical, region-based image similarity model, with region and feature weights as parameters. The difference between the variants is in the objective function of the EA used to adjust the model parameters. The objective functions include: (O-1) precision; (O-2) average rank; (O-3) ratio of within-class (i.e., positive images) and between-class (i.e., positive and negative images) scatter; and (O-4) combination of O-2 and O-3. We note that - unlike O-1 and O-2 - O-3 and O-4 are not used in any of the existing works dealing with EAs for RF. The four variants are evaluated on five test databases, containing 61,895 general-purpose images, in 619 semantic categories. Results of the evaluation reveal that variants with objective functions O-3 and O-4 consistently outperform those with O-1 and O-2. Furthermore, comparison with the representative of the existing RF methods shows that EAs are both effective and efficient approaches for SSS learning in region-based image retrieval.", "paper_title": "Variants of evolutionary learning for interactive image retrieval", "paper_id": "WOS:000244305200008"}