{"auto_keywords": [{"score": 0.034205721605490846, "phrase": "urban_environment"}, {"score": 0.007898957751554258, "phrase": "electromagnetic_propagation"}, {"score": 0.00481495049065317, "phrase": "detailed_investigation"}, {"score": 0.004632039024076267, "phrase": "high-frequency_electromagnetic_fields"}, {"score": 0.004268293864953256, "phrase": "elementary_block"}, {"score": 0.004106063237069123, "phrase": "high_accuracy"}, {"score": 0.004035946043145475, "phrase": "high-frequency_electromagnetic_waves"}, {"score": 0.003799796252156605, "phrase": "realistic_application"}, {"score": 0.003751011827704279, "phrase": "asymptotic_theory"}, {"score": 0.0037028514035425037, "phrase": "uniform_theory"}, {"score": 0.0035620354052144656, "phrase": "material_roughness"}, {"score": 0.003267925215811654, "phrase": "electromagnetic_field_propagation"}, {"score": 0.002985130390111069, "phrase": "finite_dimensions"}, {"score": 0.0029467742734417255, "phrase": "diffraction_equations"}, {"score": 0.0027861630854233693, "phrase": "infinite_wedges"}, {"score": 0.002703327151461985, "phrase": "real_building_edges"}], "paper_keywords": ["electromagnetism", " numerical analysis", " wave propagation", " urban areas", " simulation"], "paper_abstract": "Purpose - To provide a detailed investigation about methods commonly used for the computation of high-frequency electromagnetic fields in the vicinity of obstacles that can reflect or diffract them. This is useful to create an elementary block that can be used to evaluate with a high accuracy the propagation of high-frequency electromagnetic waves in real urban environment. Design/methodology/approach - The approach is based on a realistic application of the asymptotic theory of the uniform theory of diffraction. Therefore, the effect of material roughness and its electromagnetic properties on the reflection are taken into account. Findings - Provides information about the mechanisms involved in electromagnetic field propagation in urban environment, and the relative importance of each one. Research limitations/implications - In urban environment the buildings obviously have finite dimensions. The diffraction equations examined in the paper are strictly valid only in the case of infinite wedges; therefore, the behaviour of real building edges has not been taken rigorously into account. Practical implications - A source of information for researchers interested in the development of a simulator for the electromagnetic propagation in urban environment. Originality/value - This paper is aimed at providing to researchers, in a more comprehensive way, all information needed for the study of electromagnetic propagation in an environment containing many close scatterers.", "paper_title": "Electromagnetic plane wave scattering from building surfaces", "paper_id": "WOS:000242269400016"}