{"auto_keywords": [{"score": 0.03567507407574083, "phrase": "quality_model"}, {"score": 0.03529624542703246, "phrase": "quality_metrics"}, {"score": 0.00481495049065317, "phrase": "approach_for_evaluating_the_quality_of_ontologies"}, {"score": 0.004658426838467567, "phrase": "semantic_web"}, {"score": 0.004556901872357751, "phrase": "increasing_interest"}, {"score": 0.004241914481080374, "phrase": "guiding_users"}, {"score": 0.004172360444377281, "phrase": "informed_decisions"}, {"score": 0.003615217162972726, "phrase": "square_standard"}, {"score": 0.0035755653799043, "phrase": "software_quality_evaluation"}, {"score": 0.0030470127429039497, "phrase": "quality_dimensions"}, {"score": 0.002915437843874821, "phrase": "functional_adequacy"}, {"score": 0.0021879624017959493, "phrase": "frame_work"}], "paper_keywords": ["Semantic Web", " Ontology Quality", " Software Quality", " ISO 25000"], "paper_abstract": "The development of the Semantic Web has provoked an increasing interest in the development of ontologies. There are, however, few mechanisms for guiding users in making informed decisions on which ontology to use under given circumstances. In this paper, we propose a framework for evaluating the quality of ontologies based on the SQuaRE standard for software quality evaluation. This method requires the definition of both a quality model and quality metrics for evaluating the quality of the ontology. The quality model is divided into a series of quality dimensions or characteristics, such as structure or functional adequacy, which are organized into subcharacteristics, such as cohesion or tangledness. Thus, each subcharacteristic is evaluated by applying a series of quality metrics, which are automatically measured. Finally, each characteristic is evaluated by combining values of its subcharacteristics. This work also includes the application of this frame work for the evaluation of ontologies in two application domains.", "paper_title": "OQuaRE: A SQuaRE-based Approach for Evaluating the Quality of Ontologies", "paper_id": "WOS:000311621100005"}