{"auto_keywords": [{"score": 0.03614921554572696, "phrase": "key_criteria"}, {"score": 0.014187385938352318, "phrase": "mas_implementation"}, {"score": 0.013458704942458074, "phrase": "software_engineers"}, {"score": 0.013347074786027204, "phrase": "aose_experts"}, {"score": 0.011712937531618733, "phrase": "mas_technology"}, {"score": 0.008767169424212773, "phrase": "mas_architecture"}, {"score": 0.00481495049065317, "phrase": "agent-based_software_architectures"}, {"score": 0.004747997855358171, "phrase": "common_distributed_intelligent_system_architecture"}, {"score": 0.004721476966382158, "phrase": "multi_agent_systems"}, {"score": 0.004304574865291508, "phrase": "particular_problem"}, {"score": 0.004209156143059689, "phrase": "aose_expertise"}, {"score": 0.00413897695636482, "phrase": "relatively_small_number"}, {"score": 0.003968585341590009, "phrase": "mas_system"}, {"score": 0.003459191419478298, "phrase": "systematic_framework"}, {"score": 0.0034014736691766957, "phrase": "problem_requirement_definition"}, {"score": 0.00333534826677211, "phrase": "mas_solution"}, {"score": 0.0032522091171602557, "phrase": "iterative_process"}, {"score": 0.0031800434901385717, "phrase": "mas_implementations"}, {"score": 0.003126968800190193, "phrase": "related_work"}, {"score": 0.0030661634150805296, "phrase": "statistical_analysis"}, {"score": 0.0030234540584856352, "phrase": "agent-oriented_solutions"}, {"score": 0.0028907297673652836, "phrase": "factor_analysis"}, {"score": 0.0026498854775140854, "phrase": "non-aose_experts"}, {"score": 0.002512274063686441, "phrase": "software_engineer's_personal_inclination"}, {"score": 0.002449691601275015, "phrase": "mas"}, {"score": 0.002415459080723135, "phrase": "objective_mechanism"}, {"score": 0.00238179189290753, "phrase": "current_practices"}, {"score": 0.0022964320343406815, "phrase": "informal_process"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Modelling", " Distributed intelligent systems", " Agent", " Multi Agent Systems", " Software development"], "paper_abstract": "Context: A common distributed intelligent system architecture is Multi Agent Systems (MASs). Creating systems with this architecture has been recently supported by Agent Oriented Software Engineering (AOSE) methodologies. But two questions remain: how do we determine the suitability of a MAS implementation for a particular problem? And can this be determined without AOSE expertise? Objective: Given the relatively small number of software engineers that are AOSE experts, many problems that could be better solved with a MAS system are solved using more commonly known but not necessarily as suitable development approaches (e.g. object-oriented). The paper aims to empower software engineers, who are not necessarily AOSE experts, in deciding whether or not they should advocate the use of an MAS technology for a given project. Method: The paper will construct a systematic framework to identify key criteria in a problem requirement definition to assess the suitability of a MAS solution. The criteria are first identified using an iterative process. The features are initially identified from MAS implementations, and then validated against related work. This is followed by a statistical analysis of 25 problems that characterise agent-oriented solutions previously developed to group features into key criteria. Results: Key criteria were sufficiently prominent using factor analysis to construct a framework which provides a process that identifies within the requirements the criteria discovered. This framework is then evaluated for assessing suitability of a MAS architecture, by non-AOSE experts, on two real world problems: an electricity market simulation and a financial accounting system. Conclusion: Substituting a software engineer's personal inclination to (or not to) use a MAS, our framework provides an objective mechanism. It can supplant current practices where the decision to use a MAS architecture for a given problem remains an informal process. It was successfully illustrated on two real world problems to assess the suitability of a MAS implementation. This paper will potentially facilitate the take up of MAS technology. (C) 2012 Elsevier B.V. All rights reserved.", "paper_title": "Suitability assessment framework of agent-based software architectures", "paper_id": "WOS:000316527200003"}