{"auto_keywords": [{"score": 0.04376443267765712, "phrase": "recognition_tasks"}, {"score": 0.043195353115157424, "phrase": "distance_measure"}, {"score": 0.026255405704328664, "phrase": "proposed_method"}, {"score": 0.00481495049065317, "phrase": "content-based_similarity"}, {"score": 0.004749824776508639, "phrase": "rapid_development"}, {"score": 0.00460125407969429, "phrase": "increasing_volume"}, {"score": 0.0040334640350288, "phrase": "important_role"}, {"score": 0.0035194572615570977, "phrase": "disjoint_information"}, {"score": 0.003378385493203297, "phrase": "feature_histograms"}, {"score": 0.0033175095965171674, "phrase": "euclidean_distance"}, {"score": 0.0028293966058473476, "phrase": "graph_structure"}, {"score": 0.0027910516355928983, "phrase": "semi-supervised_learning_process"}, {"score": 0.0023802126605244438, "phrase": "experimental_results"}, {"score": 0.002203016940021265, "phrase": "improved_performance"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["3D model retrieval", " 3D model recognition", " Distance measure", " Disjoint information", " Semi-supervised learning"], "paper_abstract": "The rapid development of 3D digital technology has led to an increasing volume of 3D model data. In addressing the management of such large scale data, effective content-based 3D model retrieval and recognition methods are highly desirable. In 3D model retrieval and recognition tasks, the distance measure between two 3D models plays an important role. In this paper, we propose a novel 3D model retrieval and recognition method that employs both a distance histogram and 3D moment invariants as features that are invariant to 3D object scaling, translation, and rotation. Disjoint information is used to measure the distance between the feature histograms, and the Euclidean distance is applied in calculating the distance between two moment features. These measures are then combined as the 3D model distance. Using this distance measure, the relationships between all 3D models in the dataset are formulated as a graph structure. A semi-supervised learning process is then conducted to estimate the relevance among the 3D models, and this is employed for 3D model retrieval and classification. To evaluate the effectiveness of the proposed method, we conduct experiments on two datasets. Experimental results and a comparison with state-of-the-art methods demonstrate that the proposed method achieves improved performance for 3D model retrieval and recognition tasks. (C) 2014 Elsevier Inc. All rights reserved.", "paper_title": "3D model retrieval and classification by semi-supervised learning with content-based similarity", "paper_id": "WOS:000340315600049"}