{"auto_keywords": [{"score": 0.0355013853716852, "phrase": "w-full_input_structures"}, {"score": 0.030884106806392107, "phrase": "three-inclusive_constraint_satisfaction_problems"}, {"score": 0.022466199393145658, "phrase": "np"}, {"score": 0.009891856246932815, "phrase": "special_cases"}, {"score": 0.009792969043391364, "phrase": "bulatov"}, {"score": 0.004814959072186258, "phrase": "feder"}, {"score": 0.004795545114032312, "phrase": "vardi"}, {"score": 0.004605648786459119, "phrase": "so-called_dichotomy_conjecture"}, {"score": 0.004387636578404025, "phrase": "conservative_structures"}, {"score": 0.004317273687390536, "phrase": "possible_unary_relations"}, {"score": 0.004265239838772233, "phrase": "bulatov's_result"}, {"score": 0.004179900823889289, "phrase": "so-called_inclusive_structures"}, {"score": 0.00414624323795236, "phrase": "conservative_constraint_satisfaction_problems"}, {"score": 0.003910165065217086, "phrase": "so-called_three-inclusive_structures"}, {"score": 0.003831903054642567, "phrase": "unary_relation_r"}, {"score": 0.0037704185044368753, "phrase": "subsets_r'_subset"}, {"score": 0.0037099168264824386, "phrase": "constraint_satisfaction_problems"}, {"score": 0.003562860954997457, "phrase": "unary_constraint"}, {"score": 0.003463391975160565, "phrase": "\"full\"_input_structures"}, {"score": 0.003414700173218327, "phrase": "positive_integers"}, {"score": 0.00324630414986101, "phrase": "w_variables"}, {"score": 0.0032136316273478783, "phrase": "w-ary_constraint"}, {"score": 0.003012151635318418, "phrase": "constraint_satisfaction_problem"}, {"score": 0.0029637812196108664, "phrase": "restricted_problems"}, {"score": 0.0029280123383684, "phrase": "general_family"}, {"score": 0.002455222781718496, "phrase": "complexity_classification"}, {"score": 0.002376957733124285, "phrase": "previous_results"}, {"score": 0.0022278161259863486, "phrase": "allowed_values"}, {"score": 0.0021611569513501415, "phrase": "graph_colorings"}, {"score": 0.0021524207523986785, "phrase": "graph_homomorphisms"}, {"score": 0.0021393824830166137, "phrase": "graph_partitions"}], "paper_keywords": ["constraint satisfaction problems", " dichotomy conjecture", " conservative constraint satisfaction problems", " full constraint satisfaction problems", " graph homomorphisms", " list homomorphisms", " matrix partitions", " bounded degrees", " NP-complete problems", " quasi-polynomial algorithms"], "paper_abstract": "Feder and Vardi have conjectured that all constraint satisfaction problems to a fixed structure ( constraint language) are polynomial or NP-complete. This so-called dichotomy conjecture remains open, although it has been proved in a number of special cases. Most recently, Bulatov has verified the conjecture for conservative structures, i.e., structures which contain all possible unary relations. We explore three different implications of Bulatov's result. First, the above dichotomy can be extended to so-called inclusive structures, corresponding to conservative constraint satisfaction problems in which each variable comes with its own domain. ( This has also been independently observed by Bulatov.) We prove a more general version, extending the dichotomy to so-called three-inclusive structures, i.e., structures which contain, with any unary relation R, all unary relations R' for subsets R' subset of R with at most three elements. For the constraint satisfaction problems in this generalization we must restrict the instances to so-called 1-full structures, in which each variable is involved in a unary constraint. This leads to our second focus, which is on restrictions to more general kinds of \"full\" input structures. For any set W of positive integers, we consider a restriction to W-full input structures, i.e., structures in which, for each w is an element of W, any w variables are involved in a w-ary constraint. We identify a class of structures ( the so-called W-set- full structures) for which the restriction to W-full input structures does not change the complexity of the constraint satisfaction problem, and hence the family of these restricted problems also exhibits dichotomy. The general family of three-inclusive constraint satisfaction problems restricted to W-full input structures contains examples which we cannot seem to prove either polynomial or NP-complete. Nevertheless, we are able to use our result on the dichotomy for three-inclusive constraint satisfaction problems, to deduce the fact that all three-inclusive constraint satisfaction problems restricted to W-full input structures are NP-complete or \"quasi-polynomial\" ( of order n(O(log n))). Our third focus deals with bounding the number of occurrences of a variable, which we call the degree. We conjecture that the complexity classification of three-inclusive constraint satisfaction problems extends to the case where all degrees are bounded by three. Using previous results, we are able to verify this conjecture in a number of special cases. Conservative, inclusive, and three-inclusive constraint satisfaction problems can be viewed as problems in which each variable is restricted to a \"list\" of allowed values. This point of view of lists is frequently encountered in the study of graph colorings, graph homomorphisms, and graph partitions. Our results presented here, in all three areas, were strongly motivated by these results on graphs.", "paper_title": "Full constraint satisfaction problems", "paper_id": "WOS:000238324600011"}