{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "product_interaction"}, {"score": 0.004285010985001827, "phrase": "previous_studies"}, {"score": 0.00395101799538683, "phrase": "interactive_product"}, {"score": 0.003606178185661875, "phrase": "affective_feedback_loop"}, {"score": 0.003144345057121367, "phrase": "inherent_feedback"}, {"score": 0.0030655302236416502, "phrase": "perceptual_motor_skills"}, {"score": 0.002618995204424126, "phrase": "emotional_experience"}, {"score": 0.002414544068560716, "phrase": "lower_heart_rate"}, {"score": 0.0023780209525032688, "phrase": "whole_experiment"}, {"score": 0.002148226022654619, "phrase": "unaware_interaction"}], "paper_keywords": ["Emotional experience", " Product interaction", " Affective interaction", " Inherent feedback"], "paper_abstract": "Sometimes, the way in which we interact with products implicitly communicates how we feel. Based on previous studies on how emotions can be detected and communicated via product interaction, we discuss how an interactive product could influence affect by responding and changing behaviors expressing affect. We discuss the proposal of the affective feedback loop in product interaction by its implementation in the prototype of a pen that senses two implicit behaviors related to restlessness, rock and roll. Furthermore, the pen provides inherent feedback, focusing on the perceptual motor skills, as a means to reflect on these behaviors. The pen was evaluated in an experiment, by which we explored whether this type of feedback would influence the emotional experience. Two participant groups were compared, and participants that used the pen with feedback showed a lower heart rate throughout the whole experiment. Because these participants were not aware that the pen provided any feedback, we propose the concept of unaware interaction and discuss what its implications are for design.", "paper_title": "Measuring and adapting behavior during product interaction to influence affect", "paper_id": "WOS:000313017700009"}