{"auto_keywords": [{"score": 0.04174475377261779, "phrase": "media_equation_pattern"}, {"score": 0.03415955887037545, "phrase": "high_experience"}, {"score": 0.00481495049065317, "phrase": "previous_media_equation_research"}, {"score": 0.00463229351153731, "phrase": "affiliation_effects"}, {"score": 0.004551563730037998, "phrase": "current_study"}, {"score": 0.0045037997020733415, "phrase": "identity_manipulation"}, {"score": 0.004363480951473701, "phrase": "traditional_team"}, {"score": 0.004332894955218135, "phrase": "group_formation_research"}, {"score": 0.004287415750101536, "phrase": "original_media_equation_research"}, {"score": 0.0039264465913491356, "phrase": "sixty_students"}, {"score": 0.0033749889869455407, "phrase": "questionnaire_measures"}, {"score": 0.0033513085425415545, "phrase": "participants'_affective_experience"}, {"score": 0.0030906010704382374, "phrase": "team_conditions"}, {"score": 0.0026562224049977213, "phrase": "high_experience_participants"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["media equation", " team formation", " groups'", " experience", " human computer interaction"], "paper_abstract": "This study extends previous media equation research, which showed that interdependence but not identity leads to team affiliation effects with computers. The current Study used an identity manipulation that more closely replicated the manipulation used in traditional team and group formation research than the original media equation research in this area. The study also sought further evidence for the relationship between experience with computers and behaviour reflecting a media equation pattern of results. Sixty students from the University of Queensland voluntarily participated in the study. Participants were assigned to one of three conditions: control, human team (a team made of only humans) or human-computer team (a team made of computers and humans). Questionnaire measures assessing participants' affective experience, attitudes and opinions were taken. Participants of high experience with computers, but not low experience, when assigned to either of the team conditions enjoyed the tasks completed on the computer more than participants who worked on their own. When assigned to a team that involved a Computer, participants of high experience, but not low experience, reacted negatively towards the Computer (in comparison to high experience participants working on their own or on a team without a computer as a team member)-rating the information provided by the computer lower, rating themselves as less influenced by the computer and changing their own ratings and rankings to be less like those of the computer. These results are interpreted in light of the 'Black Sheep' literature and recognized as a media equation pattern of results. (c) 2006 Elsevier Ltd. All rights reserved.", "paper_title": "The media equation and team formation: Further evidence for experience as a moderator", "paper_id": "WOS:000243626900002"}