{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "integrated"}, {"score": 0.004602773636967002, "phrase": "salient_dimensions"}, {"score": 0.004227064760262924, "phrase": "diverse_knowledge"}, {"score": 0.004040688646993605, "phrase": "overarching_framework"}, {"score": 0.003980400251874277, "phrase": "complex_environmental_problems"}, {"score": 0.0038431888954930083, "phrase": "assessment_or_decision_making_purposes"}, {"score": 0.003729335910488339, "phrase": "integrated_modelling"}, {"score": 0.003511613254403125, "phrase": "key_dimensions"}, {"score": 0.0027054473441439422, "phrase": "ten_dimensions"}, {"score": 0.0025219085140220773, "phrase": "integrated_assessment_process"}, {"score": 0.0022810491620483737, "phrase": "participatory_processes"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Integration", " Integrated assessment", " Dimensions", " Integrated models", " Environmental modelling", " Integrated modeling"], "paper_abstract": "Integrated assessment and its inherent platform, integrated modelling, present an opportunity to synthesize diverse knowledge, data, methods and perspectives into an overarching framework to address complex environmental problems. However to be successful for assessment or decision making purposes, all salient dimensions of integrated modelling must be addressed with respect to its purpose and context. The key dimensions include: issues of concern; management options and governance arrangements; stakeholders; natural systems; human systems; spatial scales; temporal scales; disciplines; methods, models, tools and data; and sources and types of uncertainty. This paper aims to shed light on these ten dimensions, and how integration of the dimensions fits in the four main phases in the integrated assessment process: scoping, problem framing and formulation, assessing options, and communicating findings. We provide examples of participatory processes and modelling tools that can be used to achieve integration. (C) 2014 Elsevier Ltd. All rights reserved.", "paper_title": "Integrated assessment and modelling: Overview and synthesis of salient dimensions", "paper_id": "WOS:000349429800018"}