{"auto_keywords": [{"score": 0.049759738849303195, "phrase": "dosing_errors"}, {"score": 0.006544268327573596, "phrase": "ci"}, {"score": 0.005975618008913642, "phrase": "dosing_alerts"}, {"score": 0.005683507454954688, "phrase": "dosing_alert_system"}, {"score": 0.004750959742844963, "phrase": "hospitalized_pediatric_patients"}, {"score": 0.0044286400018187354, "phrase": "proprietary_system"}, {"score": 0.0043697607816770775, "phrase": "institutional_customization"}, {"score": 0.004326113419290302, "phrase": "pediatric_hospital"}, {"score": 0.00430028449190588, "phrase": "positive_predictive_value"}, {"score": 0.004268591456106124, "phrase": "retrospective_analysis"}, {"score": 0.004240116703465252, "phrase": "medication_orders"}, {"score": 0.004141936429360251, "phrase": "adverse_drug_events"}, {"score": 0.003659389341948856, "phrase": "studied_period"}, {"score": 0.0029139401928060123, "phrase": "customized_system"}, {"score": 0.0024725918236048632, "phrase": "indicationspecific_dose_ranges"}, {"score": 0.002375087848055933, "phrase": "dosing_error"}, {"score": 0.0023592142778542076, "phrase": "discussion_advances"}, {"score": 0.0023434465472518943, "phrase": "dosing_alert_systems"}, {"score": 0.002191438157029621, "phrase": "low_sensitivity"}, {"score": 0.0021049977753042253, "phrase": "reaching_patients"}], "paper_keywords": [""], "paper_abstract": "Objectives To determine the sensitivity and specificity of a dosing alert system for dosing errors and to compare the sensitivity of a proprietary system with and without institutional customization at a pediatric hospital. Methods A retrospective analysis of medication orders, orders causing dosing alerts, reported adverse drug events, and dosing errors during July, 2011 was conducted. Dosing errors with and without alerts were identified and the sensitivity of the system with and without customization was compared. Results There were 47 181 inpatient pediatric orders during the studied period; 257 dosing errors were identified (0.54%). The sensitivity of the system for identifying dosing errors was 54.1% (95% CI 47.8% to 60.3%) if customization had not occurred and increased to 60.3% (CI 54.0% to 66.3%) with customization (p=0.02). The sensitivity of the system for underdoses was 49.6% without customization and 60.3% with customization (p=0.01). Specificity of the customized system for dosing errors was 96.2% (CI 96.0% to 96.3%) with a positive predictive value of 8.0% (CI 6.8% to 9.3). All dosing errors had an alert over-ridden by the prescriber and 40.6% of dosing errors with alerts were administered to the patient. The lack of indicationspecific dose ranges was the most common reason why an alert did not occur for a dosing error. Discussion Advances in dosing alert systems should aim to improve the sensitivity and positive predictive value of the system for dosing errors. Conclusions The dosing alert system had a low sensitivity and positive predictive value for dosing errors, but might have prevented dosing errors from reaching patients. Customization increased the sensitivity of the system for dosing errors.", "paper_title": "Sensitivity and specificity of dosing alerts for dosing errors among hospitalized pediatric patients", "paper_id": "WOS:000341858100007"}