{"auto_keywords": [{"score": 0.04959913342990779, "phrase": "multihop_cellular_networks"}, {"score": 0.028193202159684117, "phrase": "new_architecture"}, {"score": 0.00481495049065317, "phrase": "media_handling_for_multimedia_conferencing"}, {"score": 0.004624751696958501, "phrase": "media-handling_aspects"}, {"score": 0.004419703921314433, "phrase": "multimedia_conferences"}, {"score": 0.004202498569040955, "phrase": "manet."}, {"score": 0.0038964032225585117, "phrase": "conventional_cellular_networks"}, {"score": 0.003522579870903474, "phrase": "conventional_cellular_network"}, {"score": 0.0032658649336454923, "phrase": "end-to-end_stream_delays"}, {"score": 0.002982307044758515, "phrase": "easy_task"}, {"score": 0.0028355237433457313, "phrase": "cellular_networks"}, {"score": 0.0028071037448130194, "phrase": "manets"}, {"score": 0.002524688179363081, "phrase": "manet_media-handling_architectures"}, {"score": 0.002400373755068185, "phrase": "media_mediators"}, {"score": 0.0023642842046859274, "phrase": "media_mediator"}, {"score": 0.002158836285985314, "phrase": "proof-of-concept_prototype"}, {"score": 0.0021049977753042253, "phrase": "extensive_simulations"}], "paper_keywords": [""], "paper_abstract": "This article addresses the media-handling aspects of multimedia conferencing in multihop cellular networks. Participation in multimedia conferences in MCNs may be confined to either the conventional cellular network or the MANET. Participation also can span both networks. However, neither the media-handling architectures currently in use in conventional cellular networks, nor the ones in use in MANETs are appropriate. When they are used, either the participants in the conventional cellular network, or the ones in the MANETs, might experience long and potentially unacceptable end-to-end stream delays. Furthermore, these architectures are the antipodes of each other, Reconciling them is not an easy task. We evaluate the architectures currently in use in cellular networks and MANETs, show that none is suitable, and propose a new architecture that bridges the two worlds. The new architecture uses the MANET media-handling architectures as a starting point. It is based on media mediators. A media mediator is composed of two functional entities: the media gateway controller mediator and the media gateway mediator. A proof-of-concept prototype was implemented, and extensive simulations were conducted to evaluate performance.", "paper_title": "Media Handling for Multimedia Conferencing in Multihop Cellular Networks", "paper_id": "WOS:000264629300007"}