{"auto_keywords": [{"score": 0.04953787572055814, "phrase": "trust_value"}, {"score": 0.007877066502506837, "phrase": "coordinated_attacks"}, {"score": 0.004531637625717547, "phrase": "future_communication_environments"}, {"score": 0.004497410940849537, "phrase": "information_and_communication_security_technologies"}, {"score": 0.004396267325338022, "phrase": "anonymity_and_contribution_resources"}, {"score": 0.004264923517966271, "phrase": "overwhelming_nodes"}, {"score": 0.004059772950454586, "phrase": "free_riding_phenomenon"}, {"score": 0.003435643372146385, "phrase": "secure_model"}, {"score": 0.0030196821790309165, "phrase": "node's_connections"}, {"score": 0.0029629009627331355, "phrase": "full_consideration"}, {"score": 0.002929344511491418, "phrase": "node's_trust_value"}, {"score": 0.0027151161550531206, "phrase": "pre-transaction_resources"}, {"score": 0.00265394824073552, "phrase": "higher_trust_value"}, {"score": 0.002564763827975352, "phrase": "simulation_results"}, {"score": 0.002169968849836984, "phrase": "network_robustness"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Free riding", " Incentive", " Peer-to-peer", " Pyramidal structure", " Security"], "paper_abstract": "Recently a lot of efforts are focused on the most promising solutions in future communication environments with information and communication security technologies. As a result of anonymity and contribution resources voluntary of nodes in P2P wireless network, the overwhelming nodes lack enthusiasm when they provide service, which is easy to cause free riding phenomenon. Thus, it leads to the emergence of hubs. Due to the existence of hubs in P2P wireless networks, the network becomes much more vulnerable because of great reducing in defending against coordinated attacks. Therefore, in this paper we provide a secure model for controlling the hubs in P2P network based on trust value. In detail, this paper proposes a model based on trust value of nodes against vulnerability, which not only takes into account a node's connections, but also gives full consideration about a node's trust value. The calculation of trust value is broken down to various types of resources. In accordance with the type of pre-transaction resources, the nodes that have higher trust value and fewer connections are chosen to make transaction. Simulation results demonstrate that this model can encourage nodes to participate in sharing recourses with other nodes in the network actively, and simultaneously it can avoid generating hubs effectively. Our model could improve the ability of defending against coordinated attacks, and also could enhance the network robustness and stability. (C) 2010 Elsevier B.V. All rights reserved.", "paper_title": "A secure model for controlling the hubs in P2P wireless network based on trust value", "paper_id": "WOS:000278157300011"}