{"auto_keywords": [{"score": 0.035640990113531175, "phrase": "badly_behaving_peers"}, {"score": 0.00481495049065317, "phrase": "trust_by_association"}, {"score": 0.004659192888931046, "phrase": "peer-to-peer_networks._trust_mechanisms"}, {"score": 0.004273782634394231, "phrase": "trust_mechanisms"}, {"score": 0.003920128102807887, "phrase": "resulting_network"}, {"score": 0.003808845109556467, "phrase": "legitimate_purposes"}, {"score": 0.0031132086055691214, "phrase": "meta-reputation_system"}, {"score": 0.0030497740719977835, "phrase": "peer's_trustworthiness"}, {"score": 0.0026953359825383624, "phrase": "external_social_relationship"}, {"score": 0.002239225269052105, "phrase": "simple_simulation"}, {"score": 0.0021049977753042253, "phrase": "existing_trust_mechanism"}], "paper_keywords": ["Trust", " peer-to-peer networks", " reputation", " invitation only", " e-commerce", " malicious peers"], "paper_abstract": "Trust mechanisms are used in peer-to-peer (P2P) networks to help well-behaving peers find other well-behaving peers with which to trade. Unfortunately, these trust mechanisms often do little to keep badly behaving peers from entering and taking advantage of the network, which makes the resulting network difficult or impossible to use for legitimate purposes such as e-commerce. We propose trust by association, a way of tying peers together in invitation-only P2P networks in such a way as to encourage the removal of badly behaving peers. We use invitations to create a structure within the otherwise ad hoc P2P network. Using this structure, we create a meta-reputation system where we measure a peer's trustworthiness not only by its own behavior, but also by the behavior of the peers it has invited to join. The connection created between the peers takes advantage of the external social relationship that must exist before a peer can be invited into the network. The result is a P2P network where, rather than just trying to marginalize badly behaving peers, there is incentive to kick them out of the network. We present results from a simple simulation showing that our approach works well in general when combined with and compared to an existing trust mechanism.", "paper_title": "TRUST BY ASSOCIATION: A META-REPUTATION SYSTEM FOR PEER-TO-PEER NETWORKS", "paper_id": "WOS:000295014200003"}