{"auto_keywords": [{"score": 0.004012271808564447, "phrase": "publication_distribution"}, {"score": 0.003859500298805362, "phrase": "uncited_ones"}, {"score": 0.0036553070575015344, "phrase": "citation_distribution"}, {"score": 0.0035297609635321203, "phrase": "so-called_\"excess\"_citations"}, {"score": 0.002963640433319524, "phrase": "academic_performance"}, {"score": 0.002817639725689939, "phrase": "different_dimensions"}, {"score": 0.002668420182908979, "phrase": "unique_indicator"}, {"score": 0.0026477564788515984, "phrase": "total_academic_achievements"}, {"score": 0.00238392747425758, "phrase": "integrated_impact_indicator"}, {"score": 0.0023289568500915207, "phrase": "single_number"}, {"score": 0.002301947614465974, "phrase": "meaningful_interpretation"}], "paper_keywords": [""], "paper_abstract": "The h-index provides us with 9 natural classes which can be written as a matrix of 3 vectors. The 3 vectors are: X = (X-1, X-2, X-3) and indicates publication distribution in the h-core, the h-tail, and the uncited ones, respectively; Y = (Y-1, Y-2, Y-3) denotes the citation distribution of the h-core, the h-tail and the so-called \"excess\" citations (above the h-threshold), respectively; and Z = (Z(1), Z(2), Z(3)) = (Y-1-X-1, Y-2-X-2, Y-3-X-3). The matrix V = (X, Y, Z) T constructs a measure of academic performance, in which the 9 numbers can all be provided with meanings in different dimensions. The \"academic trace\" tr(V) of this matrix follows naturally, and contributes a unique indicator for total academic achievements by summarizing and weighting the accumulation of publications and citations. This measure can also be used to combine the advantages of the h-index and the integrated impact indicator (I3) into a single number with a meaningful interpretation of the values. We illustrate the use of tr(V) for the cases of 2 journal sets, 2 universities, and ourselves as 2 individual authors.", "paper_title": "The \"Academic Trace\" of the Performance Matrix: A Mathematical Synthesis of the h-Index and the Integrated Impact Indicator (I3)", "paper_id": "WOS:000335583300010"}