{"auto_keywords": [{"score": 0.04701907501854721, "phrase": "corresponding_points"}, {"score": 0.015599567027237244, "phrase": "particle_filters"}, {"score": 0.008293531615673816, "phrase": "posterior_distribution"}, {"score": 0.00481495049065317, "phrase": "bayesian_methods"}, {"score": 0.00436989807912238, "phrase": "conventional_approaches"}, {"score": 0.0042859292226559535, "phrase": "batch_methods"}, {"score": 0.004138813595009761, "phrase": "object_model"}, {"score": 0.003844545552246988, "phrase": "learned_object_model"}, {"score": 0.0037125240439927114, "phrase": "object_class"}, {"score": 0.0036695284042874395, "phrase": "unseen_test_images"}, {"score": 0.0035850198321277418, "phrase": "computationally_heavy_learning"}, {"score": 0.0033952989364738353, "phrase": "large_memory_requirements"}, {"score": 0.0033559647822437298, "phrase": "computer_vision"}, {"score": 0.003253279945540651, "phrase": "incremental_object_learners"}, {"score": 0.0031906984691667246, "phrase": "incremental_object-matching_method"}, {"score": 0.003141498438356646, "phrase": "best_knowledge"}, {"score": 0.0028729252198422825, "phrase": "similar_object_instances"}, {"score": 0.002828611294209297, "phrase": "natural_greyscale_images"}, {"score": 0.0028067105937184954, "phrase": "arbitrary_location"}, {"score": 0.002648118797218937, "phrase": "bayesian"}, {"score": 0.0022576249214220187, "phrase": "matched_corresponding_points"}, {"score": 0.0021049977753042253, "phrase": "novel_test_images"}], "paper_keywords": [""], "paper_abstract": "This study is about object matching, that is, a problem of locating the corresponding points of an object in an image. Conventional approaches to object matching are batch methods, meaning that the methods first learn the object model from a training set of example images that contain instances of the object, and then use the learned object model to match instances of the same object (or object class) in unseen test images. Such batch learning often leads to computationally heavy learning, at least when the images are incorporated sequentially into the system and large memory requirements. In computer vision, little work has been done in developing incremental object learners. Especially, an incremental object-matching method has to the best knowledge of the authors - never been introduced. In this paper, the authors present such a method. Our technique finds the corresponding points of similar object instances, appearing in natural greyscale images with arbitrary location, scale and orientation, by processing the images sequentially. The approach is Bayesian and combines the shape and appearance of the corresponding points into the posterior distribution for the location of them. The posterior distribution is recursively sampled with particle filters to locate the most probable corresponding point sets in the image being processed. The results indicate that the matched corresponding points can be used in forming a representation of the object with which instances of the object in novel test images are successfully detected.", "paper_title": "Incremental object matching and detection with Bayesian methods and particle filters", "paper_id": "WOS:000291385900003"}