{"auto_keywords": [{"score": 0.029207532255041347, "phrase": "evolutionary_information"}, {"score": 0.00481495049065317, "phrase": "multi-body_statistical_potential"}, {"score": 0.004553510708976456, "phrase": "protein_interactions"}, {"score": 0.00445293569103488, "phrase": "challenging_but_fundamental_goal"}, {"score": 0.004141093507753515, "phrase": "efficient_discrimination"}, {"score": 0.00409508755819924, "phrase": "nearnative_interfaces"}, {"score": 0.004049590638590415, "phrase": "large_sets"}, {"score": 0.0038510053729959074, "phrase": "knowledge-based_potentials"}, {"score": 0.003703282519292336, "phrase": "multi-body_interactions"}, {"score": 0.0035811651542886746, "phrase": "multiresidue_interactions"}, {"score": 0.003501991125315889, "phrase": "protein-protein_binding_and_protein_interfaces"}, {"score": 0.0030967107893195246, "phrase": "coarse-grained_statistical_potential"}, {"score": 0.00306227185008558, "phrase": "two-_and_three-body_interactions"}, {"score": 0.002707741309851526, "phrase": "scoring_results"}, {"score": 0.002618366076489732, "phrase": "widely_used_protein_docking_benchmark"}, {"score": 0.002341164727388944, "phrase": "discriminative_power"}, {"score": 0.0021406417439887907, "phrase": "significant_progress"}, {"score": 0.0021049977753042253, "phrase": "interevscore"}], "paper_keywords": [""], "paper_abstract": "Motivation: Structural prediction of protein interactions currently remains a challenging but fundamental goal. In particular, progress in scoring functions is critical for the efficient discrimination of nearnative interfaces among large sets of decoys. Many functions have been developed using knowledge-based potentials, but few make use of multi-body interactions or evolutionary information, although multiresidue interactions are crucial for protein-protein binding and protein interfaces undergo significant selection pressure to maintain their interactions. Results: This article presents InterEvScore, a novel scoring function using a coarse-grained statistical potential including two- and three-body interactions, which provides each residue with the opportunity to contribute in its most favorable local structural environment. Combination of this potential with evolutionary information considerably improves scoring results on the 54 test cases from the widely used protein docking benchmark for which evolutionary information can be collected. We analyze how our way to include evolutionary information gradually increases the discriminative power of InterEvScore. Comparison with several previously published scoring functions (ZDOCK, ZRANK and SPIDER) shows the significant progress brought by InterEvScore.", "paper_title": "InterEvScore: a novel coarse-grained interface scoring function using a multi-body statistical potential coupled to evolution", "paper_id": "WOS:000321747800005"}