{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "workover_rigs"}, {"score": 0.02226264015601143, "phrase": "maintenance_services"}, {"score": 0.009328757912451848, "phrase": "limited_number"}, {"score": 0.007244165701220208, "phrase": "production_loss"}, {"score": 0.00476323161560059, "phrase": "onshore_oil_fields"}, {"score": 0.004712065638657606, "phrase": "onshore_oil_wells"}, {"score": 0.003635600104609725, "phrase": "well_production"}, {"score": 0.0028968858148006823, "phrase": "workover_rig_scheduling_problem"}, {"score": 0.0028195727965553367, "phrase": "best_schedule"}, {"score": 0.0025857324180891526, "phrase": "maintenance_service"}, {"score": 0.0023970487263732737, "phrase": "real_problems"}, {"score": 0.002358457030311671, "phrase": "brazil"}, {"score": 0.002307955403424634, "phrase": "sa"}, {"score": 0.0022830706430588482, "phrase": "better_solutions"}, {"score": 0.0021863046959469863, "phrase": "crown_copyright"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Workover rigs", " Oil production", " Simulated Annealing"], "paper_abstract": "Onshore oil wells are dependent of maintenance services such as cleaning, reinstatement and stimulation. These services can be performed by a limited number of workover rigs. Usually, wells need maintenance services and a scheduling of the workover rigs must be defined. This scheduling must consider some factors such as the well production, the type of service to he performed and time windows for the service. There is a production loss associated to wells waiting for maintenance services, so it is important to attend them as soon as possible. Thus, the workover rig scheduling problem consists of finding the best schedule for the limited number of workover rigs, minimizing the production loss associated with the wells waiting for maintenance service. We present a simple and robust Simulated Annealing (SA) algorithm for solving this problem. Computational results on real problems obtained in Brazil are reported and SA presents better solutions than all those approaches reported in the literature. Crown Copyright (C) 2010 Published by Elsevier Ltd. All rights reserved.", "paper_title": "A simple and robust Simulated Annealing algorithm for scheduling workover rigs on onshore oil fields", "paper_id": "WOS:000289395500006"}