{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "tactical_planning"}, {"score": 0.004732215871738028, "phrase": "fmcg_industry"}, {"score": 0.004518442937844318, "phrase": "milp_model"}, {"score": 0.0038431888954930083, "phrase": "realistically_sized_problems"}, {"score": 0.0036272258853286433, "phrase": "single-sku_submodels"}, {"score": 0.0034233569308012982, "phrase": "slack_variables"}, {"score": 0.0033257460346754687, "phrase": "capacity_constraints"}, {"score": 0.0032496585171039797, "phrase": "iterative_procedure"}, {"score": 0.0029967610945411593, "phrase": "feasible_solution"}, {"score": 0.00282822695516646, "phrase": "required_cpu_time"}, {"score": 0.002432971714608409, "phrase": "full_model"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Tactical planning", " Optimization", " MILP", " Decomposition algorithm", " Fast Moving Consumer Goods", " Enterprise-Wide Optimizationa"], "paper_abstract": "In this paper we propose an MILP model to address the optimization of the tactical planning for the Fast Moving Consumer Goods (FMCG) industry. This model is demonstrated for a case containing 10 Stock-Keeping Units (SKUs), but is intractable for realistically sized problems. Therefore, we propose a decomposition based on single-SKU submodels. To account for the interaction between SKUs, slack variables are introduced into the capacity constraints. In an iterative procedure the cost of violating the capacity is slowly increased, and eventually a feasible solution is obtained. Even for the relatively small 10-SKU case, the required CPU time could be reduced from 1144 s to 175 s using the algorithm. Moreover, the algorithm was used to optimize cases of up to 1000 SKUs, whereas the full model is intractable for cases of 25 or more SKUs. The solutions obtained with the algorithm are typically within a few percent of the global optimum. (C) 2013 Elsevier Ltd. All rights reserved.", "paper_title": "An SKU decomposition algorithm for the tactical planning in the FMCG industry", "paper_id": "WOS:000330574400007"}