{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "mobile_email_usage"}, {"score": 0.04660802533264657, "phrase": "mobile_email"}, {"score": 0.004389745162172933, "phrase": "qualitative_data"}, {"score": 0.004264697351852424, "phrase": "mobile_email_usage_patterns"}, {"score": 0.003933118499284644, "phrase": "work-life_boundaries"}, {"score": 0.003887894704361635, "phrase": "mobile_email_users"}, {"score": 0.003755307753574745, "phrase": "dysfunctional_usage_patterns"}, {"score": 0.0036272258853286433, "phrase": "convincing_argument"}, {"score": 0.002877769867854964, "phrase": "dual_perspectives"}, {"score": 0.0027475383418803724, "phrase": "metaphorical_lens"}, {"score": 0.0026846436189970446, "phrase": "organisational_cultures"}, {"score": 0.002623184850933423, "phrase": "functional_perspective"}, {"score": 0.002548331088496964, "phrase": "dysfunctional_view"}, {"score": 0.002349884235026956, "phrase": "dysfunctional_perspective"}, {"score": 0.0023228223366301226, "phrase": "mobile_email_adoption"}], "paper_keywords": [""], "paper_abstract": "This paper offers a study of contradiction in the usage of mobile email. Using qualitative data, the paper identifies mobile email usage patterns that are dangerous, distracting, anti-social and that infringe on work-life boundaries. Mobile email users were forthcoming in describing these dysfunctional usage patterns, but they made a convincing argument that their mobile devices are highly functional and allow them to be efficient, to multitask without disruption to others, and to respond immediately to messages, as well as offering them the freedom to work from anywhere. These dual perspectives on mobile email ( dys) functionality are explored through a metaphorical lens, showing how organisational cultures can reinforce the functional perspective while simultaneously suppressing the dysfunctional view. It is argued that it is important to understand and explore the dysfunctional perspective of mobile email adoption. The paper concludes with a series of questions that challenge organisations to reflect critically on their assumptions about mobile email usage.", "paper_title": "Is mobile email functional or dysfunctional? Two perspectives on mobile email usage", "paper_id": "WOS:000241240500005"}