{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "message-pruning_tree"}, {"score": 0.010229827097660281, "phrase": "wireless_sensor_networks"}, {"score": 0.010139074796131336, "phrase": "np"}, {"score": 0.006639218545352124, "phrase": "total_cost"}, {"score": 0.006054673848888568, "phrase": "minimum-cost_message-pruning_tree_problem"}, {"score": 0.0046834372388970405, "phrase": "moving_objects"}, {"score": 0.004492841495994535, "phrase": "enhanced_data_aggregation_structure"}, {"score": 0.003966162568548304, "phrase": "wireless_sensor_network"}, {"score": 0.0037006243674469657, "phrase": "location_information"}, {"score": 0.003468796799802612, "phrase": "message-pruning_trees"}, {"score": 0.003312121699003206, "phrase": "minimum_cost"}, {"score": 0.002363150587804677, "phrase": "polynomial_time"}, {"score": 0.0023091093387071593, "phrase": "new_data_aggregation_structure"}, {"score": 0.0021049977753042253, "phrase": "proposed_data_aggregation_structure"}], "paper_keywords": ["message-pruning tree", " NP-complete", " object tracking", " data aggregation", " wireless sensor network"], "paper_abstract": "Wireless sensor networks have often been used to monitor and report the locations of moving objects. Since sensors can also be used for storage, a wireless sensor network can be considered a distributed database, enabling us to update and query the location information of moving objects. Many researchers have studied the problem of how to construct message-pruning trees that can update a database and query objects with minimum cost (the Minimum-Cost Message-Pruning Tree problem). The trees are constructed in such a way that the total cost of updating the database and querying objects is kept as minimal as possible, while the hardness of the Minimum-Cost Message-Pruning Tree problem remains unknown. In this paper, we first show that the Minimum-Cost Message-Pruning Tree problem is NP-complete. Subsequently, since the message-pruning tree with minimum cost is hard to construct in polynomial time, we propose a new data aggregation structure, a message-pruning tree with shortcuts, instead of the message-pruning tree. Simulation results show that the proposed data aggregation structure significantly reduces the total cost of updating the database and querying objects as compared to the message-pruning tree.", "paper_title": "Constructing a message-pruning tree with minimum cost for tracking moving objects in wireless sensor networks is NP-complete and an enhanced data aggregation structure", "paper_id": "WOS:000255199400010"}