{"auto_keywords": [{"score": 0.04795845458902327, "phrase": "nonuniform_node_configuration"}, {"score": 0.015544732910761045, "phrase": "long-span_bridge_health_monitoring"}, {"score": 0.009483065269661885, "phrase": "two-phase_node_arrangement_method"}, {"score": 0.009014265154299476, "phrase": "independent_sensor_nodes_configuration"}, {"score": 0.004550029253278477, "phrase": "wireless_sensor_networks"}, {"score": 0.004251210982670317, "phrase": "two-phase_node_arrangement"}, {"score": 0.00399449659126893, "phrase": "numerical_examples"}, {"score": 0.0038610400240820307, "phrase": "long-span_suspension_bridge"}, {"score": 0.003546513036085932, "phrase": "ten_sensor_nodes"}, {"score": 0.003370190834214415, "phrase": "eight_sensor_nodes"}, {"score": 0.0025383451160985488, "phrase": "nonuniform_nodes_configuration"}, {"score": 0.0023313149689465386, "phrase": "energy_consumption"}, {"score": 0.0022919762167777427, "phrase": "\"energy_hole"}, {"score": 0.0022278779300543548, "phrase": "network_performance"}], "paper_keywords": [""], "paper_abstract": "This paper presents a nonuniform node configuration of wireless sensor networks (WSNs) for long-span bridge health monitoring. The methodology and strategy of two-phase node arrangement for nonuniform WSN configuration are firstly presented, and then numerical examples are carried out by a long-span suspension bridge. Three cases, which are four sensor nodes distributed on one side of the girder, ten sensor nodes distributed on one side of the girder, and eight sensor nodes distributed averagely on two sides of the girder, are employed. In case I and case II, three schemes that are the nonuniform node configuration arranged by the two-phase node arrangement method, the uniform nodes configuration, and the independent sensor nodes configuration are used for comparison. And in case III, two schemes that are nonuniform nodes configuration and the independent sensor nodes configuration are adopted. The results indicate that the nonuniform node configuration can balance energy consumption, eliminate \"energy hole,\" and maximize network performance effectively, which shows the most outstanding performance when compared with other conventional node configurations. So, the efficiency of the two-phase node arrangement method is validated.", "paper_title": "The Nonuniform Node Configuration of Wireless Sensor Networks for Long-Span Bridge Health Monitoring", "paper_id": "WOS:000325611800001"}