{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "group_recommendations"}, {"score": 0.019804391141154724, "phrase": "interval_linguistic_labels_aggregation"}, {"score": 0.017267741177701246, "phrase": "likelihood-based_comparison_relations"}, {"score": 0.01029144850584771, "phrase": "illowa_operator"}, {"score": 0.00917122691089724, "phrase": "new_method"}, {"score": 0.003702702337768558, "phrase": "proposed_interval_linguistic_labels"}, {"score": 0.003246672441842787, "phrase": "interval_linguistic_labels"}, {"score": 0.0028687545730861665, "phrase": "proposed_illowa_operator"}, {"score": 0.002364172626241202, "phrase": "proposed_method"}, {"score": 0.0022568866348667547, "phrase": "ben-arieh"}, {"score": 0.0022222152430170254, "phrase": "chen's_method"}, {"score": 0.0021049977753042253, "phrase": "useful_way"}], "paper_keywords": ["Autocratic decision making", " fuzzy linguistic order weighted average (FLOWA) operator", " group recommendations", " interval linguistic labels", " interval linguistic labels ordered weighted average (ILLOWA) operator", " likelihood-based comparison relations"], "paper_abstract": "In this paper, we present a new method for interval linguistic labels aggregation and consensus measure for autocratic decision making using group recommendations based on the proposed interval linguistic labels ordered weighted average (ILLOWA) operator and the likelihood-based comparison relations of interval linguistic labels. We propose the ILLOWA operator to aggregate interval linguistic labels. We propose the concepts of likelihood-based comparison relations of interval linguistic labels. Based on the proposed ILLOWA operator and likelihood-based comparison relations of interval linguistic labels, we propose a new method for interval linguistic labels aggregation and consensus measure for autocratic decision making using group recommendations. The proposed method can overcome the drawbacks of Ben-Arieh and Chen's method. It provides us with a useful way for interval linguistic labels aggregation and consensus measure for autocratic decision making using group recommendations.", "paper_title": "Autocratic Decision Making Using Group Recommendations Based on the ILLOWA Operator and Likelihood-Based Comparison Relations", "paper_id": "WOS:000298299000009"}