{"auto_keywords": [{"score": 0.04439952284800597, "phrase": "observed_performance"}, {"score": 0.00481495049065317, "phrase": "random_effects"}, {"score": 0.0047292449487169345, "phrase": "mono_benchmark_results"}, {"score": 0.004508048086020253, "phrase": "software_performance"}, {"score": 0.004348936976349555, "phrase": "random_fluctuations"}, {"score": 0.0037216229812089686, "phrase": "benchmarking_experiment"}, {"score": 0.0032036590920314725, "phrase": "new_statistical_model"}, {"score": 0.0031465436619697385, "phrase": "benchmark_experiment"}, {"score": 0.0026760974046034854, "phrase": "optimum_dimensions"}, {"score": 0.0025660347613972573, "phrase": "best_precision"}, {"score": 0.002262209824105154, "phrase": "regression_benchmarking"}, {"score": 0.0021049977753042253, "phrase": "erroneously_detected_performance_changes"}], "paper_keywords": ["performance evaluation", " benchmark precision", " random effects", " regression benchmarking"], "paper_abstract": "Benchmarking as a method of assessing software performance is known to suffer from random fluctuations that distort the observed performance. In this paper, we focus on the fluctuations caused by compilation. We show that the design of a benchmarking experiment must reflect the existence of the fluctuations if the performance observed during the experiment is to be representative of reality. We present a new statistical model of a benchmark experiment that reflects the presence of the fluctuations in compilation, execution and measurement. The model describes the observed performance and makes it possible to calculate the optimum dimensions of the experiment that yield the best precision within a given amount of time. Using a variety of benchmarks, we evaluate the model within the context of regression benchmarking. We show that the model significantly decreases the number of erroneously detected performance changes in regression benchmarking.", "paper_title": "Precise regression benchmarking with random effects: Improving mono benchmark results", "paper_id": "WOS:000239480100005"}