{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "software-managed_memory_allocation"}, {"score": 0.005893379946664254, "phrase": "memory_coloring"}, {"score": 0.0046987973264610685, "phrase": "novel_compiler_algorithm"}, {"score": 0.004548254883077366, "phrase": "aog"}, {"score": 0.0044385053213394175, "phrase": "data_objects"}, {"score": 0.004175533280178052, "phrase": "interval_coloring_problem"}, {"score": 0.003976373766630594, "phrase": "graph_coloring_register_allocation"}, {"score": 0.003944112858235306, "phrase": "interval_coloring_memory_allocation"}, {"score": 0.0038803710796509227, "phrase": "acyclic_orientation"}, {"score": 0.0038332390893263844, "phrase": "currently_colored_subgraph"}, {"score": 0.003725470458263889, "phrase": "well-crafted_heuristics"}, {"score": 0.003680212979775528, "phrase": "aggressive_simplify"}, {"score": 0.0031393948330209224, "phrase": "special_case"}, {"score": 0.0031139032290048788, "phrase": "classical_graph_coloring_register_allocation_algorithm"}, {"score": 0.0030017207229983385, "phrase": "memory_allocation"}, {"score": 0.0029053904956617043, "phrase": "traditional_graph_coloring_register_allocation"}, {"score": 0.0027218799769229596, "phrase": "node_weights"}, {"score": 0.0022561982694417116, "phrase": "aog_coloring"}], "paper_keywords": ["graph coloring", " memory coloring", " interval coloring", " acyclic orientation", " software-managed memory"], "paper_abstract": "This paper presents a novel compiler algorithm, called acyclic orientation graph coloring (AOG coloring), for managing data objects in software-managed memory allocation. The key insight is that software-managed memory allocation could be solved as an interval coloring problem, or equivalently, an acyclic orientation problem. We generalize graph coloring register allocation to interval coloring memory allocation by maintaining an acyclic orientation to the currently colored subgraph. This is achieved with some well-crafted heuristics, including Aggressive Simplify that does not necessarily preserve colorability and Best-Fit Select that assigns intervals (i.e., colors) to nodes by possibly adjusting the colors already assigned to other nodes earlier. Our algorithm generalizes and subsumes as a special case the classical graph coloring register allocation algorithm without notably increased complexity: it deals with memory allocation while preserving the elegance and practicality of traditional graph coloring register allocation. We have implemented our algorithm and tested it on Appel's 27921 interference graphs for scalars (augmented with node weights). Our algorithm outperforms Memory Coloring, the best in the literature, for software-managed memory allocation, on 98.64% graphs, in which, the gaps are more than 20% on 68.31% graphs and worse only on 0.29% graphs. We also tested it on all the 73 DIMACS weighted benchmarks (weighted graphs), AOG Coloring outperforms Memory Coloring on all of the benchmarks, in which, the gaps are more than 20% on 83.56% graphs.", "paper_title": "Acyclic orientation graph coloring for software-managed memory allocation", "paper_id": "WOS:000340323500004"}