{"auto_keywords": [{"score": 0.03738416398077957, "phrase": "ipca"}, {"score": 0.00481495049065317, "phrase": "promising_results"}, {"score": 0.00445318311339027, "phrase": "important_open_question"}, {"score": 0.004326833704481825, "phrase": "chosen_solution_concept"}, {"score": 0.004221379262804442, "phrase": "general_solution_concept"}, {"score": 0.0038720442355114045, "phrase": "desired_solution"}, {"score": 0.003824547895167011, "phrase": "pareto-optimal_set"}, {"score": 0.0036553070575015344, "phrase": "solution_concept"}, {"score": 0.0034506596895901003, "phrase": "evolutionary_multi-objective_optimization"}, {"score": 0.003204232566468624, "phrase": "highly_explorative_generator"}, {"score": 0.0031004173389196387, "phrase": "challenging_test_problem"}, {"score": 0.0029876282026237207, "phrase": "highly_specific_selection"}, {"score": 0.002878930338561009, "phrase": "test_archive"}, {"score": 0.0026953359825383624, "phrase": "approximate_reliability"}, {"score": 0.002629539710839523, "phrase": "limited_number"}, {"score": 0.0025865679621853667, "phrase": "candidate_solutions"}, {"score": 0.0024821782596371536, "phrase": "archive_size"}, {"score": 0.002304754792740636, "phrase": "ipca."}, {"score": 0.002220846338732873, "phrase": "monotonic_algorithm"}, {"score": 0.0021049977753042253, "phrase": "better_efficiency"}], "paper_keywords": [""], "paper_abstract": "Coevolution has already produced promising results, but its dynamic evaluation can lead to a variety of problems that prevent most algorithms from progressing monotonically. An important open question therefore is how progress towards a chosen solution concept can be achieved. A general solution concept for coevolution is obtained by viewing opponents or tests as objectives. In this setup known as Pareto-coevolution, the desired solution is the Pareto-optimal set. We present an archive that guarantees monotonicity for this solution concept. The algorithm is called the Incremental Pareto-Coevolution Archive (IPCA), and is based on Evolutionary Multi-Objective Optimization (EMOO). By virtue of its monotonicity, IPCA avoids regress even when combined with a highly explorative generator. This capacity is demonstrated on a challenging test problem requiring both exploration and reliability. IPCA maintains a highly specific selection of tests, but the size of the test archive nonetheless grows unboundedly. We therefore furthermore investigate how archive sizes may be limited while still providing approximate reliability. The LAyered Pareto-Coevolution Archive (LAPCA) maintains a limited number of layers of candidate solutions and tests, and thereby permits a trade-off between archive size and reliability. The algorithm is compared in experiments, and found to be more efficient than IPCA. The work demonstrates how the approximation of a monotonic algorithm can lead to algorithms that are sufficiently reliable in practice while offering better efficiency.", "paper_title": "A monotonic archive for pareto-coevolution", "paper_id": "WOS:000245678700004"}