{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "experienced_user_perceptions"}, {"score": 0.004773904938276846, "phrase": "software_design_patterns"}, {"score": 0.004593467306126913, "phrase": "software_design_pattern"}, {"score": 0.00443878620915958, "phrase": "relatively_little_empirical_knowledge"}, {"score": 0.003837205620832367, "phrase": "experienced_users"}, {"score": 0.0034919649825540396, "phrase": "web-based_survey"}, {"score": 0.0034621581245372138, "phrase": "experienced_pattern_users"}, {"score": 0.003359816816853762, "phrase": "software_developers"}, {"score": 0.003177687211289478, "phrase": "pattern_papers"}, {"score": 0.0030837288356760973, "phrase": "preceding_systematic_review"}, {"score": 0.0028916124463906983, "phrase": "response_rate"}, {"score": 0.0028302635493019867, "phrase": "original_sampling_frame"}, {"score": 0.0027583557819362034, "phrase": "software_development"}, {"score": 0.002575385171755899, "phrase": "knowledge_schemas"}, {"score": 0.002216251512062482, "phrase": "pattern_concept"}, {"score": 0.002178529882942255, "phrase": "empirical_studies"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Software design patterns", " Survey", " Software design"], "paper_abstract": "Context: Although the concept of the software design pattern is well-established, there is relatively little empirical knowledge about the patterns that experienced users consider to be most valuable. Aim: To identify which patterns from the set catalogued by the 'Gang of Four' are considered to be useful by experienced users, which ones are considered as not being useful, and why this is so. Method: We undertook a web-based survey of experienced pattern users, seeking information about their experiences as software developers and maintainers. Our sampling frame consisted of the authors of all of the pattern papers that we had identified in a preceding systematic review of studies of patterns. Results: We received 206 usable responses, corresponding to a response rate of 19% from the original sampling frame. Most respondents were involved with software development rather than maintenance. Conclusion: While patterns can provide a means of sharing 'knowledge schemas' between designers, only three patterns were widely regarded as valuable. Around one quarter of the patterns gained very low approval or worse. These observations need to be considered when using patterns; teaching students about the pattern concept; and planning empirical studies about patterns. (C) 2012 Elsevier B.V. All rights reserved.", "paper_title": "A survey of experienced user perceptions about software design patterns", "paper_id": "WOS:000317327000003"}