{"auto_keywords": [{"score": 0.04927872927155836, "phrase": "network_bandwidth"}, {"score": 0.004022137057452406, "phrase": "object_segmentation"}, {"score": 0.0036553070575015344, "phrase": "saved_bandwidth"}, {"score": 0.003284637361174143, "phrase": "acceptable_quality"}, {"score": 0.003070086433952691, "phrase": "unnecessary_object_transmission"}, {"score": 0.002918394200972564, "phrase": "defined_thresholds"}, {"score": 0.0028373742057129126, "phrase": "dynamically_adjusting_algorithm"}, {"score": 0.002506715532901322, "phrase": "ever-allocated_qos"}, {"score": 0.002450864311898833, "phrase": "degrading_and_upgrading_strategy"}, {"score": 0.0023827927890399357, "phrase": "current_network_status"}, {"score": 0.0022145052062614514, "phrase": "better_performance"}, {"score": 0.0021049977753042253, "phrase": "network_status"}], "paper_keywords": ["MPEG-4 standard", " streaming", " video on demand", " dynamically adjusting algorithm"], "paper_abstract": "In the paper, we try to find a method that can service more users in a video-on-demand (VoD) system, based on MPEG-4 object streams. The characteristics of object segmentation made on MPEG-4 videos can be utilized to reduce re-transmission of the same objects, and then the saved bandwidth can be used to service more users. However, some thresholds must be analyzed first to maintain the acceptable quality of services (QoS) requested by users, when reducing unnecessary object transmission on one side. Thus, according to the defined thresholds, we propose a dynamically adjusting algorithm to coordinate the object streams between the server and clients. The server not only allocates network bandwidth, but also adjusts ever-allocated QoS appropriately using a degrading and upgrading strategy, based on the current network status. Lastly, through the simulation, we found that our method has better performance than the other three methods owing to its flexibility to the network status.", "paper_title": "Dynamically adjusting MPEG4 video streams based on network bandwidth", "paper_id": "WOS:000252253600005"}