{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "maturity_models"}, {"score": 0.007090583343880039, "phrase": "process_improvement"}, {"score": 0.006701697037445991, "phrase": "maturity_model"}, {"score": 0.005731909450966846, "phrase": "mapping_study"}, {"score": 0.005254822646123303, "phrase": "relevant_papers"}, {"score": 0.004394688617163029, "phrase": "weak_points"}, {"score": 0.004337710093279712, "phrase": "assessed_processes"}, {"score": 0.003976203286249396, "phrase": "important_activity"}, {"score": 0.0034894451015047875, "phrase": "identified_papers"}, {"score": 0.003399466007862412, "phrase": "six_categories"}, {"score": 0.002843519597398796, "phrase": "different_evaluations"}, {"score": 0.002629026692001082, "phrase": "relevant_research"}, {"score": 0.0025279105573394727, "phrase": "capability_maturity_model_family"}, {"score": 0.0023886641270884973, "phrase": "clear_overview"}, {"score": 0.0021702292394814144, "phrase": "commonly_used_or_newly_developed_maturity_models"}, {"score": 0.0021049977753042253, "phrase": "john_wiley"}], "paper_keywords": ["mapping study", " evaluation", " maturity models", " software process improvement"], "paper_abstract": "Maturity models are widely used in process improvement. The users of a maturity model should be confident that the weak points of the assessed processes can be found, and that the most valuable changes are introduced. Therefore, the evaluation of maturity models is an important activity. In this paper, a mapping study of the literature on the evaluation of maturity models is presented. Two databases are searched resulting in a set of relevant papers. The identified papers can be classified according to six categories, namely the maturity model under evaluation, type of evaluation, relation of the evaluators/authors to the maturity model, level of objectivity, main purpose of the paper, and size of study. Further, a framework of different evaluations of maturity models is developed, and the relevant papers are mapped to the framework. Finally, the relevant research on the evaluation of the maturity models in the Capability Maturity Model family is discussed in more detail. The result of this mapping study is a clear overview of how the evaluation of maturity models has been done, and some discussions are provided for further research on the evaluation of commonly used or newly developed maturity models. Copyright (C) 2011 John Wiley & Sons, Ltd.", "paper_title": "A review of methods for evaluation of maturity models for process improvement", "paper_id": "WOS:000305580700004"}