{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "causal_reasoning"}, {"score": 0.0046382670208947605, "phrase": "arbitrary_preferences"}, {"score": 0.004569414098372132, "phrase": "planning_systems"}, {"score": 0.003978866233891427, "phrase": "interleaved_sequences"}, {"score": 0.003949204622915113, "phrase": "world_states"}, {"score": 0.0037899595175206143, "phrase": "second_language"}, {"score": 0.0036781781340563748, "phrase": "single_preference"}, {"score": 0.003637112258469488, "phrase": "binary_relation"}, {"score": 0.003387431241133385, "phrase": "global_preference_orderings"}, {"score": 0.003287482882222731, "phrase": "maximal_elements"}, {"score": 0.003226513431715486, "phrase": "preferred_histories"}, {"score": 0.0030617295196636173, "phrase": "base_language"}, {"score": 0.0030049342542235466, "phrase": "higher-level_preferences"}, {"score": 0.0027466028572379455, "phrase": "concrete_strategies"}, {"score": 0.0024916819803100635, "phrase": "e.g._the_expression"}, {"score": 0.002427177130359851, "phrase": "lowest_total_action_costs"}, {"score": 0.0022859244876449396, "phrase": "common_framework"}, {"score": 0.0021208737668195967, "phrase": "son"}, {"score": 0.0021049977753042253, "phrase": "pontelli"}], "paper_keywords": ["knowledge representation", " logical representations of preferences", " preferences", " planning"], "paper_abstract": "We consider the problem of representing arbitrary preferences in causal reasoning and planning systems. In planning, a preference may be seen as a goal or constraint that is desirable, but not necessary, to satisfy. To begin, we define a very general query language for histories, or interleaved sequences of world states and actions. Based on this, we specify a second language in which preferences are defined. A single preference defines a binary relation on histories, indicating that one history is preferred to the other. From this, one can define global preference orderings on the set of histories, the maximal elements of which are the preferred histories. The approach is very general and flexible; thus it constitutes a base language in terms of which higher-level preferences may be defined. To this end, we investigate two fundamental types of preferences that we call choice and temporal preferences. We consider concrete strategies for these types of preferences and encode them in terms of our framework. We suggest how to express aggregates in the approach, allowing, e.g. the expression of a preference for histories with lowest total action costs. Last, our approach can be used to express other approaches and so serves as a common framework in which such approaches can be expressed and compared. We illustrate this by indicating how an approach due to Son and Pontelli can be encoded in our approach, as well as the language PDDL3.", "paper_title": "A general framework for expressing preferences in causal reasoning and planning", "paper_id": "WOS:000250682700003"}