{"auto_keywords": [{"score": 0.04968313295265431, "phrase": "differential_evolution"}, {"score": 0.00481495049065317, "phrase": "vector_generation_strategy"}, {"score": 0.004735651915966323, "phrase": "large-scale_optimization"}, {"score": 0.004619134710069517, "phrase": "efficient_metaheuristic"}, {"score": 0.004580933283492972, "phrase": "continuous_optimization"}, {"score": 0.004394592555435104, "phrase": "large_amount"}, {"score": 0.003977594755967813, "phrase": "low-dimensional_problems"}, {"score": 0.0039120325834029355, "phrase": "research_community"}, {"score": 0.003645192746918234, "phrase": "better_insight"}, {"score": 0.00313849462329633, "phrase": "trial_vectors"}, {"score": 0.0030739103951333696, "phrase": "exploration_capabilities"}, {"score": 0.003010651173285521, "phrase": "important_mathematical_properties"}, {"score": 0.0028760125558659907, "phrase": "related_schemes"}, {"score": 0.002549146857303602, "phrase": "high-dimensional_optimization_problems"}, {"score": 0.0024554476124885806, "phrase": "highly_exploitative_schemes"}, {"score": 0.0023849523850778807, "phrase": "high-quality_solutions"}, {"score": 0.002259346051668556, "phrase": "large-scale_optimization_problems"}, {"score": 0.0021944684609599245, "phrase": "small_populations"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Differential evolution", " Diversity preservation", " Global numerical optimization", " Large-scale optimization", " Vector generation strategy"], "paper_abstract": "Differential Evolution is an efficient metaheuristic for continuous optimization that suffers from the curse of dimensionality. A large amount of experimentation has allowed researchers to find several potential weaknesses in Differential Evolution. Some of these weaknesses do not significantly affect its performance when dealing with low-dimensional problems, so the research community has not paid much attention to them. The aim of this paper is to provide a better insight into the reasons of the curse of dimensionality and to propose techniques to alleviate this problem. Two different weaknesses are revisited and schemes for dealing with them are devised. The schemes increase the diversity of trial vectors and improve on the exploration capabilities of Differential Evolution. Some important mathematical properties induced by our proposals are studied and compared against those of related schemes. Experimentation with a set of problems with up to 1000 dimensions and with several variants of Differential Evolution shows that the weaknesses analyzed significantly affect the performance of Differential Evolution when used on high-dimensional optimization problems. The gains of the proposals appear when highly exploitative schemes are used. Our proposals allow for high-quality solutions with small populations, meaning that the most significant advantages emerge when dealing with large-scale optimization problems, where the benefits of using small populations have previously been shown. (C) 2015 Elsevier Inc. All rights reserved.", "paper_title": "Improving the vector generation strategy of Differential Evolution for large-scale optimization", "paper_id": "WOS:000362307100008"}