{"auto_keywords": [{"score": 0.04255150516227644, "phrase": "stakerare"}, {"score": 0.023013028108119487, "phrase": "collaborative_filtering"}, {"score": 0.010612387000973441, "phrase": "social_networks"}, {"score": 0.009984060933560433, "phrase": "stakeholder_needs"}, {"score": 0.009261094517574417, "phrase": "large_software_projects"}, {"score": 0.004724878518219719, "phrase": "large-scale_requirements"}, {"score": 0.004658426838467567, "phrase": "requirements_elicitation"}, {"score": 0.004592905436175987, "phrase": "software_engineering_activity"}, {"score": 0.004360412703519539, "phrase": "prioritizing_requirements"}, {"score": 0.0035587046945919788, "phrase": "stakeholder_roles"}, {"score": 0.0034920505103165403, "phrase": "social_network"}, {"score": 0.0032223742018434856, "phrase": "social_network_measures"}, {"score": 0.003030247482854539, "phrase": "initial_list"}, {"score": 0.0026543514413663893, "phrase": "software_project"}, {"score": 0.0025678829712650437, "phrase": "substantial_empirical_study"}, {"score": 0.002175913488493802, "phrase": "existing_method"}], "paper_keywords": ["Requirements/specifications", " elicitation methods", " requirements prioritization", " experimentation", " human factors", " recommender systems", " social network analysis", " stakeholder analysis"], "paper_abstract": "Requirements elicitation is the software engineering activity in which stakeholder needs are understood. It involves identifying and prioritizing requirements-a process difficult to scale to large software projects with many stakeholders. This paper proposes StakeRare, a novel method that uses social networks and collaborative filtering to identify and prioritize requirements in large software projects. StakeRare identifies stakeholders and asks them to recommend other stakeholders and stakeholder roles, builds a social network with stakeholders as nodes and their recommendations as links, and prioritizes stakeholders using a variety of social network measures to determine their project influence. It then asks the stakeholders to rate an initial list of requirements, recommends other relevant requirements to them using collaborative filtering, and prioritizes their requirements using their ratings weighted by their project influence. StakeRare was evaluated by applying it to a software project for a 30,000-user system, and a substantial empirical study of requirements elicitation was conducted. Using the data collected from surveying and interviewing 87 stakeholders, the study demonstrated that StakeRare predicts stakeholder needs accurately and arrives at a more complete and accurately prioritized list of requirements compared to the existing method used in the project, taking only a fraction of the time.", "paper_title": "StakeRare: Using Social Networks and Collaborative Filtering for Large-Scale Requirements Elicitation", "paper_id": "WOS:000304414400014"}