{"auto_keywords": [{"score": 0.046292060088215264, "phrase": "boolean_functions"}, {"score": 0.00481495049065317, "phrase": "testing_linear-invariant_properties"}, {"score": 0.004697655699119423, "phrase": "property_testing"}, {"score": 0.004640079189342692, "phrase": "particularly_important_role"}, {"score": 0.004545675105321216, "phrase": "linear_invariant_properties"}, {"score": 0.004291393968030603, "phrase": "linear_transformations"}, {"score": 0.004067977399245212, "phrase": "fourier_sparsity"}, {"score": 0.003824547895167011, "phrase": "unified_analysis"}, {"score": 0.0037312893857519803, "phrase": "linear-invariant_properties"}, {"score": 0.0036402965997795536, "phrase": "additive_combinatorics"}, {"score": 0.0035956327252723483, "phrase": "graph_theory"}, {"score": 0.0034364867143322304, "phrase": "simple_combinatorial_condition"}, {"score": 0.0028553159147435424, "phrase": "simple_combinatorial_characterization"}, {"score": 0.002728847267539957, "phrase": "one-sided_error"}, {"score": 0.0026403984202404665, "phrase": "sudan"}, {"score": 0.002575934917174136, "phrase": "new_technique"}, {"score": 0.0024821782596371536, "phrase": "main_tool"}, {"score": 0.0024116163689723354, "phrase": "green's_arithmetic_regularity_lemma"}, {"score": 0.002333421318779658, "phrase": "special_case"}], "paper_keywords": ["property testing", " linear invariance", " subspace-hereditary properties"], "paper_abstract": "In the study of property testing, a particularly important role has been played by linear invariant properties, i.e., properties of Boolean functions on the hypercube which are closed under linear transformations of the domain. Examples of such properties include linearity, Reed-Muller codes, and Fourier sparsity. In this work, we describe a framework that can lead to a unified analysis of the testability of all linear-invariant properties, drawing on techniques from additive combinatorics and from graph theory. Our main contributions here are the following: We introduce a simple combinatorial condition, which we call subspace-heredity, and conjecture that any property of Boolean functions satisfying it can be efficiently tested. Verifying this conjecture will unify many individual results in this area. We show that if our conjecture holds, then one can obtain a simple combinatorial characterization of properties of Boolean functions that can be efficiently tested with one-sided error, thus addressing a challenge posed by Sudan recently. We introduce a new technique for proving the testability of Boolean functions. The main tool we develop is an extension of Green's arithmetic regularity lemma. Using it, we verify a special case of the conjecture. Our approach here is motivated by techniques that proved to be very successful previously in studying the testability of graph properties.(c) 2013 Wiley Periodicals, Inc. Random Struct. Alg., 46, 232-260, 2015", "paper_title": "A Unified Framework for Testing Linear-Invariant Properties", "paper_id": "WOS:000348436600002"}