{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "citation_counts"}, {"score": 0.037959032075944976, "phrase": "peer_evaluation"}, {"score": 0.004630910803911567, "phrase": "particular_discipline"}, {"score": 0.004184526032558792, "phrase": "award-winning_mathematicians"}, {"score": 0.0037224647319912293, "phrase": "rough_equivalence"}, {"score": 0.00331125524068286, "phrase": "major_prizes"}, {"score": 0.003135325927288733, "phrase": "sloan"}, {"score": 0.0030387767523076528, "phrase": "national_science_foundation_career"}, {"score": 0.0022583704173318123, "phrase": "discipline_level"}, {"score": 0.002223351523626989, "phrase": "different_overall_citation_rates"}, {"score": 0.0021049977753042253, "phrase": "different_subdisciplines"}], "paper_keywords": ["Citation analysis", " Mathematics", " Subdisciplines", " Peer evaluation", " Awards", " Awardees", " Grants", " Grantees"], "paper_abstract": "Variation of citation counts by subdisciplines within a particular discipline is known but rarely systematically studied. This paper compares citation counts for award-winning mathematicians is different subdisciplines of mathematics. Mathematicians were selected for study in groups of rough equivalence with respect to peer evaluation, where this evaluation is given by the awarding of major prizes and grants: Guggenheim fellowships, Sloan fellowships, and National Science Foundation CAREER grants. We find a pattern in which mathematicians working in some subdisciplines have fewer citations than others who won the same award, and this pattern is consistent for all awards. So even after adjustment at the discipline level for different overall citation rates for disciplines, citation counts for different subdisciplines do not match peer evaluation. Demographic and hiring data for mathematics provides a context for a discussion of reasons and interpretations.", "paper_title": "Citation rates in mathematics: a study of variation by subdiscipline", "paper_id": "WOS:000303533600017"}