{"auto_keywords": [{"score": 0.03143394633372254, "phrase": "doa_estimation"}, {"score": 0.00481495049065317, "phrase": "constant_modulus_feature."}, {"score": 0.0046875099587735825, "phrase": "direction-of-arrival"}, {"score": 0.004143196873246147, "phrase": "doa_stage"}, {"score": 0.004077005481951783, "phrase": "beamforming_stage"}, {"score": 0.003969018740062018, "phrase": "main_reasons"}, {"score": 0.003781772207256374, "phrase": "imprecise_array_manifold"}, {"score": 0.0036815763368083197, "phrase": "finite_sample_size"}, {"score": 0.0033965836912510385, "phrase": "beam_pointing"}, {"score": 0.0030178961017306646, "phrase": "robust_algorithm"}, {"score": 0.002875391177926809, "phrase": "constant_modulus"}, {"score": 0.0025409639091476363, "phrase": "inter_cooperative_way"}, {"score": 0.002174041708084857, "phrase": "numerical_experiments"}, {"score": 0.0021049977753042253, "phrase": "proposed_method"}], "paper_keywords": ["Direction-of-Arrival", " Beamformer", " Constant modulus"], "paper_abstract": "In the conventional Space-Division Multiple-Access (SDMA) scheme, Direction-of-Arrival (DoA) estimation and beamforming are usually performed sequentially and independently. Such a cascade structure may transmit the error or deviation from the DoA stage to the beamforming stage. Two of the main reasons for such error or deviation are the effect of imprecise array manifold and the effect of finite sample size. The deviation, especially error may subsequently lead a beamformer to produce a beam pointing in wrong DoA that can severely degrade the performance of the beamformer. To address this problem, we propose a robust algorithm both for DoA estimation and for beamforming using the constant modulus (CM) feature. In the algorithm, the DoA estimation and the beamforming are no longer independent but work in an inter cooperative way. One can regard them as two parallel outputs of the algorithm. In this way, the robustness of DoA estimation and beamforming can be improved simultaneously. Finally, numerical experiments show the effectiveness of the proposed method.", "paper_title": "A ROBUST DOA/BEAMFORMING ALGORITHM USING THE CONSTANT MODULUS FEATURE", "paper_id": "WOS:000301405400010"}