{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "top-k_core_members"}, {"score": 0.01230874440526053, "phrase": "poly-relational_networks"}, {"score": 0.004739908206940666, "phrase": "relevant_relations"}, {"score": 0.004662705558154439, "phrase": "social_networks"}, {"score": 0.004556901872357751, "phrase": "real_world"}, {"score": 0.004494570360108983, "phrase": "existing_research"}, {"score": 0.004392565073466714, "phrase": "community_detection"}, {"score": 0.004273196830970426, "phrase": "global_partition"}, {"score": 0.004081385289516914, "phrase": "real_cases"}, {"score": 0.0038447943243941685, "phrase": "commercial_analysts"}, {"score": 0.0033037970113095577, "phrase": "unsupervised_analysis"}, {"score": 0.003213920601037463, "phrase": "poly-relational_network"}, {"score": 0.0025537472239953807, "phrase": "optimization_framework"}, {"score": 0.0023079225317714815, "phrase": "synchronously_updated_weight"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Poly-relational networks", " Top-k core members", " Importance weight", " Sequential quadratic programming"], "paper_abstract": "Poly-relational networks such as social networks are prevalent in the real world. The existing research on poly-relational networks focuses on community detection, aiming to find a global partition of nodes across relations. However, in some real cases, users may be not interested in such a global partition. For example, commercial analysts often care more about the top-k core members in business competitions, and relations among them that are more important to their competitions. Motivated by this, in this paper, we investigate an unsupervised analysis of the top-k core members in a poly-relational network and identify two complementary tasks, namely (1) detection of the top-k core members that are most tightly connected by relevant relations, and (2) identification of the relevant relations via analysis on the importance of each relation to the formation of the top-k core members. Towards this, we propose an optimization framework to jointly deal with the two tasks by maximizing the connectivity between the candidates of the top-k core members across all relations with a synchronously updated weight for each relation. The effectiveness of our framework is verified both theoretically and experimentally. (C) 2014 Elsevier Ltd. All rights reserved.", "paper_title": "Unsupervised analysis of top-k core members in poly-relational networks", "paper_id": "WOS:000336872300004"}