{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "empirical_software_engineering_studies"}, {"score": 0.04900761970662832, "phrase": "development_repositories"}, {"score": 0.004414723336530117, "phrase": "source_code_management"}, {"score": 0.0035198224928307854, "phrase": "reproduction_studies"}, {"score": 0.00340217066797559, "phrase": "main_results"}, {"score": 0.0032884384364324395, "phrase": "systematic_approach"}, {"score": 0.0026611838252683507, "phrase": "research_reproducibility"}, {"score": 0.0024211628058125067, "phrase": "systematic_analysis"}, {"score": 0.002402921062033032, "phrase": "important_aspects"}, {"score": 0.0021049977753042253, "phrase": "specific_study"}], "paper_keywords": ["Repeatable results", " Mining software repositories", " Reproducibility"], "paper_abstract": "Among empirical software engineering studies, those based on data retrieved from development repositories (such as those of source code management, issue tracking or communication systems) are specially suitable for reproduction. However their reproducibility status can vary a lot, from easy to almost impossible to reproduce. This paper explores which elements can be considered to characterize the reproducibility of a study in this area, and how they can be analyzed to better understand the type of reproduction studies they enable or obstruct. One of the main results of this exploration is the need of a systematic approach to asses the reproducibility of a study, due to the complexity of the processes usually involved, and the many details to be taken into account. To address this need, a methodology for assessing the reproducibility of studies is also presented and discussed, as a tool to help to raise awareness about research reproducibility in this field. The application of the methodology in practice has shown how, even for papers aimed to be reproducible, a systematic analysis raises important aspects that render reproduction difficult or impossible. We also show how, by identifying elements and attributes related to reproducibility, it can be better understood which kind of reproduction can be done for a specific study, given the description of datasets, methodologies and parameters it uses.", "paper_title": "On the reproducibility of empirical software engineering studies based on data retrieved from development repositories", "paper_id": "WOS:000300343600006"}