{"auto_keywords": [{"score": 0.04958720442967608, "phrase": "multi-agent_simulations"}, {"score": 0.00481495049065317, "phrase": "experts'_knowledge"}, {"score": 0.004668059458774745, "phrase": "human_behaviours"}, {"score": 0.004364919932563366, "phrase": "social_actors"}, {"score": 0.003835972725191194, "phrase": "computer-mediated_role"}, {"score": 0.003680587852807675, "phrase": "situated_stance"}, {"score": 0.003531474887552889, "phrase": "\"_behaviours"}, {"score": 0.003441352119167824, "phrase": "cognitive_processes"}, {"score": 0.003168079471049896, "phrase": "artificial_maieutic_approach"}, {"score": 0.002740885774408238, "phrase": "agent-mediated_simulation"}, {"score": 0.0026026666736474404, "phrase": "actor's_reactions"}, {"score": 0.0023834640793589414, "phrase": "hidden_knowledge"}, {"score": 0.002310578855290687, "phrase": "first_results"}, {"score": 0.00226322835801988, "phrase": "social_simulations"}, {"score": 0.0021826828321952615, "phrase": "air_traffic_control"}, {"score": 0.0021049977753042253, "phrase": "common-pool_resources"}], "paper_keywords": [""], "paper_abstract": "Models of human behaviours used in multi-agent simulations are limited by the ability of introspection of the social actors: some of their knowledge (reflexes, habits, non-formalized expertise) cannot be extracted through interviews. The use of computer-mediated role playing games put these actors into a situated stance where the recording of their \"live\" behaviours is possible. But cognitive processes and motivations still have to be interpreted. In this paper, we propose an artificial maieutic approach to extract such pieces of knowledge, by helping the actors to better understand, and sometimes formulate, their own behaviours. The actors are playing their own roles in an agent-mediated simulation and interact with agents that question their behaviours. The actor's reactions and understanding are stimulated by these interactions, and this situation allows in many cases to reveal hidden knowledge. We present here the first results using two complementary works in social simulations, one in the domain of air traffic control and one in the domain of common-pool resources sharing.", "paper_title": "An artificial maieutic approach for eliciting experts' knowledge in multi-agent simulations", "paper_id": "WOS:000238187200006"}