{"auto_keywords": [{"score": 0.031806280910128736, "phrase": "false_defect_reports"}, {"score": 0.015719716506582538, "phrase": "exploratory_testing"}, {"score": 0.010485366231796241, "phrase": "detection_difficulty"}, {"score": 0.008785671832820663, "phrase": "severity_levels"}, {"score": 0.004458722048888919, "phrase": "scientific_research"}, {"score": 0.004394910907549057, "phrase": "scientific_community"}, {"score": 0.004352876088312741, "phrase": "quantitative_results"}, {"score": 0.004188702178897384, "phrase": "realistic_experimental_settings"}, {"score": 0.0038230844545071303, "phrase": "documented_test_cases"}, {"score": 0.0034558655164987134, "phrase": "manual_functional_testing"}, {"score": 0.003390013146619706, "phrase": "tct."}, {"score": 0.003293570937654716, "phrase": "identified_defects"}, {"score": 0.003093893243443715, "phrase": "detected_defects"}, {"score": 0.0028784478769295204, "phrase": "significantly_greater_number"}, {"score": 0.0027830917623582903, "phrase": "significantly_more_defects"}, {"score": 0.0027564303939865476, "phrase": "varying_levels"}], "paper_keywords": ["Software testing", " Experiment", " Exploratory testing", " Efficiency", " Effectiveness"], "paper_abstract": "The exploratory testing (ET) approach is commonly applied in industry, but lacks scientific research. The scientific community needs quantitative results on the performance of ET taken from realistic experimental settings. The objective of this paper is to quantify the effectiveness and efficiency of ET vs. testing with documented test cases (test case based testing, TCT). We performed four controlled experiments where a total of 24 practitioners and 46 students performed manual functional testing using ET and TCT. We measured the number of identified defects in the 90-minute testing sessions, the detection difficulty, severity and types of the detected defects, and the number of false defect reports. The results show that ET found a significantly greater number of defects. ET also found significantly more defects of varying levels of difficulty, types and severity levels. However, the two testing approaches did not differ significantly in terms of the number of false defect reports submitted. We conclude that ET was more efficient than TCT in our experiment. ET was also more effective than TCT when detection difficulty, type of defects and severity levels are considered. The two approaches are comparable when it comes to the number of false defect reports submitted.", "paper_title": "An experiment on the effectiveness and efficiency of exploratory testing", "paper_id": "WOS:000354480800008"}