{"auto_keywords": [{"score": 0.03775114821059376, "phrase": "beacon_frames"}, {"score": 0.0367421253599339, "phrase": "sensor_node"}, {"score": 0.028238682279363825, "phrase": "average_accuracy"}, {"score": 0.00481495049065317, "phrase": "wireless_sensor_networks"}, {"score": 0.004725886853744007, "phrase": "sensor_networks"}, {"score": 0.0037592362369401546, "phrase": "sensor_network"}, {"score": 0.0037242701420971062, "phrase": "overlapping_regions"}, {"score": 0.0036383547378908564, "phrase": "rp"}, {"score": 0.0035376693476114733, "phrase": "localization_data"}, {"score": 0.0034078618706415344, "phrase": "rps"}, {"score": 0.0028799352389969443, "phrase": "optimal_transmitting_power"}, {"score": 0.002839812512030847, "phrase": "worst-case_accuracy"}, {"score": 0.002800247197692108, "phrase": "data_points"}, {"score": 0.0025862068041567934, "phrase": "simulation_results"}, {"score": 0.0025028892126605124, "phrase": "proposed_method"}, {"score": 0.002388487669097511, "phrase": "sensor_network_test_bed"}, {"score": 0.0021649437083408425, "phrase": "outdoor_environment"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Location-sensing", " Positioning"], "paper_abstract": "One challenging issue in sensor networks is to determine where a given sensor node is physically located. This problem is especially crucial for very small sensor nodes. This paper presents a GPS-less, outdoor, self-positioning method for wireless sensor networks. In our method, a set of nodes, called reference points (RPs), are deployed in the sensor network with overlapping regions of coverage. The RP periodically broadcasts beacon frames which contain localization data. The sensor node collects the beacon frames from RPs and process the data in the frame; it can then easily localize itself. The analysis of positioning accuracy is given to show how well a sensor node can correctly localize itself. In the optimal transmitting power, the worst-case accuracy for all data points is within 28.87% of the separation-distance between two adjacent RPs and the average accuracy is within 15.51%. The simulation results also show the robustness of the proposed method. Finally, we have implemented our positioning method on a sensor network test bed and the actual measurement show that the method can achieve average accuracy within 17.9% of the separation-distance between two adjacent RPs in an outdoor environment. (C) 2006 Elsevier B.V. All rights reserved.", "paper_title": "A GPS-less, outdoor, self-positioning method for wireless sensor networks", "paper_id": "WOS:000206061000002"}