{"auto_keywords": [{"score": 0.03957295822022711, "phrase": "empirical_evidence"}, {"score": 0.020252628389317587, "phrase": "web_application_testing"}, {"score": 0.00481495049065317, "phrase": "significant_impact"}, {"score": 0.0045726187330434025, "phrase": "web_applications"}, {"score": 0.004331228453220757, "phrase": "web-based_software_applications"}, {"score": 0.004264620316746605, "phrase": "related_studies"}, {"score": 0.0040708542958968605, "phrase": "research_area"}, {"score": 0.004008234224296436, "phrase": "related_papers"}, {"score": 0.0037381083634085424, "phrase": "specialized_field"}, {"score": 0.003614594247038462, "phrase": "functional_testing"}, {"score": 0.003595956414995911, "phrase": "web_application"}, {"score": 0.0035681790580031998, "phrase": "systematic_literature_review"}, {"score": 0.003459191419478298, "phrase": "complimentary_study"}, {"score": 0.0034324668792521697, "phrase": "recent_systematic_mapping"}, {"score": 0.003242673525240539, "phrase": "research_questions"}, {"score": 0.003201018846103988, "phrase": "exclusion_criteria"}, {"score": 0.0028715299874549245, "phrase": "publicly-accessible_online_repository"}, {"score": 0.0027622407190589326, "phrase": "test_tools"}, {"score": 0.0026639833720047126, "phrase": "test_models"}, {"score": 0.002650234110910539, "phrase": "fault_models"}, {"score": 0.0025692121921779935, "phrase": "empirical_studies"}, {"score": 0.002445950676329976, "phrase": "industrial_relevance"}, {"score": 0.0024020409673358935, "phrase": "emerging_trends"}, {"score": 0.002234127217914019, "phrase": "existing_web_application_testing_approaches"}, {"score": 0.0021049977753042253, "phrase": "research_community"}], "paper_keywords": ["Systematic literature review", " Web application", " Testing"], "paper_abstract": "Context: The web has had a significant impact on all aspects of our society. As our society relies more and more on the web, the dependability of web applications has become increasingly important. To make these applications more dependable, for the past decade researchers have proposed various techniques for testing web-based software applications. Our literature search for related studies retrieved 193 papers in the area of web application testing, which have appeared between 2000 and 2013. Objective: As this research area matures and the number of related papers increases, it is important to systematically identify, analyze, and classify the publications and provide an overview of the trends and empirical evidence in this specialized field. Methods: We systematically review the body of knowledge related to functional testing of web application through a systematic literature review (SLR) study. This SLR is a follow-up and complimentary study to a recent systematic mapping (SM) study that we conducted in this area. As part of this study, we pose three sets of research questions, define selection and exclusion criteria, and synthesize the empirical evidence in this area. Results: Our pool of studies includes a set of 95 papers (from the 193 retrieved papers) published in the area of web application testing between 2000 and 2013. The data extracted during our SLR study is available through a publicly-accessible online repository. Among our results are the followings: (1) the list of test tools in this area and their capabilities, (2) the types of test models and fault models proposed in this domain, (3) the way the empirical studies in this area have been designed and reported, and (4) the state of empirical evidence and industrial relevance. Conclusion: We discuss the emerging trends in web application testing, and discuss the implications for researchers and practitioners in this area. The results of our SLR can help researchers to obtain an overview of existing web application testing approaches, fault models, tools, metrics and empirical evidence, and subsequently identify areas in the field that require more attention from the research community. (C) 2014 Elsevier Inc. All rights reserved.", "paper_title": "Web application testing: A systematic literature review", "paper_id": "WOS:000334001600013"}