{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "lifelogging_tools"}, {"score": 0.03350014650532268, "phrase": "conscious_emotions"}, {"score": 0.03281428926510873, "phrase": "physiological_signals"}, {"score": 0.03070954352294603, "phrase": "unconscious_emotions"}, {"score": 0.0047135086583390585, "phrase": "daily_experiences"}, {"score": 0.0046141941030386525, "phrase": "first-person_perspective"}, {"score": 0.004497762477097628, "phrase": "numerous_lifelogging_tools"}, {"score": 0.0043656173407379895, "phrase": "external_environment"}, {"score": 0.004273601449537163, "phrase": "internal_part"}, {"score": 0.004060566667226606, "phrase": "lifelogging_field"}, {"score": 0.00397495478332679, "phrase": "internal_experiences"}, {"score": 0.0034532961266947734, "phrase": "implicit_emotions"}, {"score": 0.0032950412841674026, "phrase": "human_behaviors"}, {"score": 0.0030645676308053444, "phrase": "human_body"}, {"score": 0.0024028742248152425, "phrase": "visual_and_auditory_stimuli"}, {"score": 0.002362192695471035, "phrase": "cardiovascular_responses"}, {"score": 0.0023123057299992587, "phrase": "experimental_results"}, {"score": 0.0022828795331819025, "phrase": "heart_rate_responses"}, {"score": 0.0021504218042734677, "phrase": "emotional_stimuli"}], "paper_keywords": ["Emotions", " Unconscious", " Heart rate", " Archetypal symbols", " Lifelogging"], "paper_abstract": "Lifelogging tools aim to precisely capture daily experiences of people from the first-person perspective. Although there have been numerous lifelogging tools developed for users to record the external environment around them, the internal part of experience characterized by emotions seems to be neglected in the lifelogging field. However, the internal experiences of people are important and, therefore, lifelogging tools should be able to capture not only the environmental data, but also emotional experiences, thereby providing a more complete archive of past events. Moreover, there are implicit emotions that cannot be consciously experienced, but still influence human behaviors and memories. It has been proven that conscious emotions can be recognized from physiological signals of the human body. This fact may be used to enhance life-logs with information about unconscious emotions, which otherwise would remain hidden. On the other hand, it is not clear if unconscious emotions can be recognized from physiological signals and differentiated from conscious emotions. Therefore, an experiment was designed to elicit emotions (both conscious and unconscious) with visual and auditory stimuli and to record cardiovascular responses of 34 participants. The experimental results showed that heart rate responses to the presentation of the stimuli are unique for every category of the emotional stimuli and allow differentiation between various emotional experiences of the participants.", "paper_title": "Unconscious emotions: quantifying and logging something we are not aware of", "paper_id": "WOS:000316819900006"}