{"auto_keywords": [{"score": 0.03472642561979023, "phrase": "sleep_state"}, {"score": 0.011151584156541597, "phrase": "energy_consumption"}, {"score": 0.006479245147455166, "phrase": "combined_inter-"}, {"score": 0.004783483480147339, "phrase": "intra-task_dynamic_voltage_scaling"}, {"score": 0.004752221133109136, "phrase": "dynamic_voltage_scaling"}, {"score": 0.004721163884359917, "phrase": "dvs"}, {"score": 0.004608450161665855, "phrase": "cdvs_problem"}, {"score": 0.004553914287137776, "phrase": "battery-operated_embedded_systems"}, {"score": 0.004406994912939125, "phrase": "voltage_scaling"}, {"score": 0.00433531459712787, "phrase": "dvs_problem"}, {"score": 0.003954837422946628, "phrase": "effective_dvs_techniques"}, {"score": 0.003132647746420474, "phrase": "close-to-optimal_algorithm"}, {"score": 0.0031019373572233706, "phrase": "cdvs"}, {"score": 0.0029528295737527026, "phrase": "quadratically_increasing_function"}, {"score": 0.0029238768315330305, "phrase": "system's_clock_speed"}, {"score": 0.0028952071490475997, "phrase": "applied_voltage_level"}, {"score": 0.0027924625350414655, "phrase": "refinement_algorithm"}, {"score": 0.0026148807877309417, "phrase": "experimental_results"}, {"score": 0.0023850311572318496, "phrase": "intra-task_dvs_techniques"}, {"score": 0.0021682027434117095, "phrase": "conventional_representative_method"}, {"score": 0.0021049977753042253, "phrase": "intra-_and_inter-task"}], "paper_keywords": ["dynamic voltage scaling (DVS)", " power saving", " embedded systems"], "paper_abstract": "Dynamic voltage scaling (DVS) is one of the most effective techniques for reducing energy consumption on battery-operated embedded systems. According to the granularity of units to which voltage scaling is applied, the DVS problem can be divided into two subproblems: (i) inter-task DVS problem and (ii) intra-task DVS problem. A lot of effective DVS techniques have addressed either one of the two subproblems, but none of them have attempted to solve both simultaneously. This paper examines the problem of combined inter- and intra-task DVS, called the combined DVS (CDVS) problem. We solve the CDVS problem in two embedded system domains: one is systems with a sleep state and the other without sleep state. For systems without sleep state, we propose a close-to-optimal algorithm for the CDVS problem. We show that the algorithm is optimal when the power is a quadratically increasing function of the system's clock speed or the applied voltage level. For systems with a sleep state, we propose a refinement algorithm that fine-tunes the solution to the CDVS problem without sleep state to further reduce energy consumption by exploiting sleep state. Experimental results show that our proposed CDVS algorithm without sleep state is able to reduce the energy consumption by 12.5% on average over the results by the method that sequentially performs two existing inter- and intra-task DVS techniques, which are both optimal under no sleep state. Furthermore, our CDVS algorithm with a sleep state can reduce the energy consumption by 7.1% on average over the results by the conventional representative method that utilizes sleep state, but does not consider intra- and inter-task DVS simultaneously.", "paper_title": "Algorithms for Combined Inter- and Intra-Task Dynamic Voltage Scaling", "paper_id": "WOS:000310636000008"}