{"auto_keywords": [{"score": 0.0500781036531966, "phrase": "symbolic_data_analysis"}, {"score": 0.04745358435978181, "phrase": "sda"}, {"score": 0.004637478829869904, "phrase": "data_mining_and_statistics"}, {"score": 0.004261617028111862, "phrase": "inherent_variability"}, {"score": 0.004182301599359094, "phrase": "data_mining"}, {"score": 0.003649585593445665, "phrase": "single_elements"}, {"score": 0.003066945490483524, "phrase": "botanic_species"}, {"score": 0.003038237581227068, "phrase": "disease_descriptions"}, {"score": 0.0030097975788892896, "phrase": "car_models"}, {"score": 0.0028986672783671147, "phrase": "intrinsic_variability"}, {"score": 0.0027395968397212053, "phrase": "new_variable_types"}, {"score": 0.0026384167183586015, "phrase": "single_real_values"}, {"score": 0.0022378101636842296, "phrase": "data_representation"}, {"score": 0.0021049977753042253, "phrase": "john_wiley"}], "paper_keywords": [""], "paper_abstract": "Symbolic Data Analysis (SDA) provides a framework for the representation and analysis of data that comprehends inherent variability. While in Data Mining and classical Statistics the data to be analyzed usually presents one single value for each variable, that is no longer the case when the entities under analysis are not single elements, but groups gathered on the basis of some given criteria. Then, for each variable, variability inherent to each group should be taken into account. Also, when analysing concepts, such as botanic species, disease descriptions, car models, and so on, data entail intrinsic variability, which should be explicitly considered. To this purpose, new variable types have been introduced, whose realizations are not single real values or categories, but sets, intervals, or, more generally, distributions over a given domain. SDA provides methods for the (multivariate) analysis of such data, where the variability expressed in the data representation is taken into account, using various approaches. (C) 2014 John Wiley & Sons, Ltd.", "paper_title": "Symbolic Data Analysis: another look at the interaction of Data Mining and Statistics", "paper_id": "WOS:000341132100002"}