{"auto_keywords": [{"score": 0.02755929321218484, "phrase": "different_sets"}, {"score": 0.00481495049065317, "phrase": "iranian_website."}, {"score": 0.004393806405709151, "phrase": "great_help"}, {"score": 0.004338290738750213, "phrase": "website's_owner"}, {"score": 0.0038789122930433305, "phrase": "popular_algorithm"}, {"score": 0.003839634630996529, "phrase": "page_clustering"}, {"score": 0.0035755653799043, "phrase": "webpage_clustering"}, {"score": 0.0035124258967096306, "phrase": "clustering_tasks'_complication"}, {"score": 0.0031966920628129854, "phrase": "best_set"}, {"score": 0.002850580136795412, "phrase": "iranian_website's_data"}, {"score": 0.0027577369726266834, "phrase": "popular_belief"}, {"score": 0.00237285915034425, "phrase": "data_mining_tasks"}, {"score": 0.0022549523315608475, "phrase": "second_clustering_task's_results"}, {"score": 0.0022264006157232366, "phrase": "visitors'_preferences"}, {"score": 0.0022094430230616188, "phrase": "novel_recommendation_system"}, {"score": 0.002181466276322291, "phrase": "recommendation_system"}, {"score": 0.0021049977753042253, "phrase": "whole_website"}], "paper_keywords": ["Webpage clustering", " Self-Organizing Map (SOM)", " K-Means", " Recommendation System", " Content Data", " Structure Data", " Usage Data"], "paper_abstract": "The expansion of websites and their too many pages not only have pushed their visitors to frustration but also have made the websites ever more difficult to be managed and controlled by their owners. In the past few years data mining (clustering) has been of great help so as to assist website's owner to address the complexities related to owners' extracting their visitor's preferences and their coming to know their websites properly. In this line of literature, this paper contains several parts and features. First, with regard to the fact that SUM has been the popular algorithm in dealing with page clustering, a comparison between SUM and K-means (another popular clustering algorithm) were performed to show the superiority of SUM in dealing with the task of webpage clustering. Second, due to the clustering tasks' complication not being able to be tested (unlike Classification), this study aims at proposing a mind-set by which one before taking any other actions has to go through some steps in order to choose the best set of data. Thirdly, looking at the literature, one can see the question about the suitability of types of data (content, structure and usage) and the task they are being used for has never been raised. Using an Iranian website's data, a field study and SUM algorithm, we presented that the popular belief about the type of data and the task they are appropriate for should be open to doubt. It was also depicted that different sets of data in two chosen tasks webpage profiling and extracting visitors' preference - can influence the results tremendously. Last but not least, apart from observing the influence of different sets of data, both data mining tasks have been performed to the end and the results are presented in the paper. Additionally, using the second clustering task's results (the extraction of visitors' preferences) a novel recommendation system is presented. The recommendation system in question was installed in the website for more than a month and its influence on the whole website is observed and analysed.", "paper_title": "WEBPAGE CLUSTERING - TAKING THE ZERO STEP: A CASE STUDY OF AN IRANIAN WEBSITE", "paper_id": "WOS:000342116700009"}