{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "intelligent_image_database_system"}, {"score": 0.0047385702897315436, "phrase": "object's_spanning_representation"}, {"score": 0.00451659023910662, "phrase": "novel_image_representation_method"}, {"score": 0.004374385639298755, "phrase": "spatial_relationships"}, {"score": 0.0038487848937121204, "phrase": "discriminating_pictures"}, {"score": 0.003687960013746783, "phrase": "different_degrees"}, {"score": 0.003571751184289622, "phrase": "directional_relations"}, {"score": 0.003422462630994095, "phrase": "similarity_retrieval"}, {"score": 0.00335016692413066, "phrase": "twelve_types"}, {"score": 0.003314591878914152, "phrase": "similarity_measures"}, {"score": 0.003261934055562238, "phrase": "flexible_matching"}, {"score": 0.003210110095236981, "phrase": "query_picture"}, {"score": 0.003159106878239524, "phrase": "database_pictures"}, {"score": 0.002196944917134202, "phrase": "information_retrieval_system"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Image database", " Image representation", " Spatial inference", " Similarity retrieval"], "paper_abstract": "In this paper, we presented a novel image representation method to capture the information about spatial relationships between objects in a picture. Our method is more powerful than all other previous methods in terms of accuracy, flexibility, and capability of discriminating pictures. In addition, our method also provides different degrees of granularity for reasoning about directional relations in both 8- and 16-direction reference frames. In similarity retrieval, our system provides twelve types of similarity measures to support flexible matching between the query picture and the database pictures. By exercising a database containing 3600 pictures, we successfully demonstrated the effectiveness of our image retrieval system. Experiment result showed that 97.8% precision rate can be achieved while maintaining 62.5% recall rate; and 97.9% recall rate can be achieved while maintaining 51.7% precision rate. On an average, 86.1% precision rate and 81.2% recall rate can be achieved simultaneously if the threshold is set to 0.5 or 0.6. This performance is considered to be very good as an information retrieval system. (C) 2007 Published by Elsevier Ltd.", "paper_title": "Spatial inference and similarity retrieval of an intelligent image database system based on object's spanning representation", "paper_id": "WOS:000260983100002"}