{"auto_keywords": [{"score": 0.03744037087778745, "phrase": "agm"}, {"score": 0.004148631410346188, "phrase": "new_belief"}, {"score": 0.0039729853486821995, "phrase": "influential_theory"}, {"score": 0.003934970057482768, "phrase": "belief_change"}, {"score": 0.0038786265593266107, "phrase": "alchourron"}, {"score": 0.003804751392813136, "phrase": "makinson"}, {"score": 0.003422781254306241, "phrase": "rational_reasoners"}, {"score": 0.0033575566897536906, "phrase": "corresponding_belief_change_operations"}, {"score": 0.0032777653153451265, "phrase": "implementable_agents"}, {"score": 0.003138874040786261, "phrase": "main_result"}, {"score": 0.0029343925814926787, "phrase": "belief_contraction_operation"}, {"score": 0.0027431953780099826, "phrase": "contraction_operation"}, {"score": 0.002677964894127131, "phrase": "implementable_rule-based_agent"}, {"score": 0.0025034338848015166, "phrase": "agent's_beliefs"}, {"score": 0.002198242191529977, "phrase": "non-standard_definition"}], "paper_keywords": [""], "paper_abstract": "Agents need to be able to change their beliefs; in particular, they should be able to contract or remove a certain belief in order to restore consistency to their set of beliefs, and revise their beliefs by incorporating a new belief which may be inconsistent with their previous beliefs. An influential theory of belief change proposed by Alchourron, Gardenfors and Makinson (AGM) [1] describes postulates which rational belief revision and contraction operations should satisfy. The AGM postulates are usually taken as characterising idealised rational reasoners, and the corresponding belief change operations are considered unsuitable for implementable agents due to their high computational cost [2]. The main result of this paper is to show that an efficient (linear time) belief contraction operation nevertheless satisfies all but one of the AGM postulates for contraction. This contraction operation is defined for an implementable rule-based agent which can be seen as a reasoner in a very weak logic; although the agent's beliefs are deductively closed with respect to this logic, checking consistency and tracing dependencies between beliefs is not computationally expensive. Finally, we give a non-standard definition of belief revision in terms of contraction for our agent.", "paper_title": "Resource-bounded belief revision and contraction", "paper_id": "WOS:000237045600009"}