{"auto_keywords": [{"score": 0.03916532560301708, "phrase": "sbfl"}, {"score": 0.025226507852102165, "phrase": "test_oracles"}, {"score": 0.011522839528626556, "phrase": "execution_result"}, {"score": 0.007740489563401459, "phrase": "spectrum-based_fault_localization"}, {"score": 0.006932393782308043, "phrase": "program_slice"}, {"score": 0.006522352282058993, "phrase": "existing_sbfl_techniques"}, {"score": 0.006409687485228092, "phrase": "test_oracle"}, {"score": 0.005384165826950915, "phrase": "metamorphic_slice"}, {"score": 0.004977611638706112, "phrase": "individual_test_case"}, {"score": 0.004556018017257075, "phrase": "popular_approaches"}, {"score": 0.004529581568905548, "phrase": "fault_localization"}, {"score": 0.004361428012479218, "phrase": "corresponding_coverage_information"}, {"score": 0.0041751141941485555, "phrase": "program_entity"}, {"score": 0.003904713104101532, "phrase": "test_case"}, {"score": 0.003485488711679701, "phrase": "common_situations"}, {"score": 0.003365755538047523, "phrase": "new_concept"}, {"score": 0.0032882197112190756, "phrase": "metamorphic_testing"}, {"score": 0.003269115546207996, "phrase": "program_slicing"}, {"score": 0.002978070402783044, "phrase": "metamorphic_relation"}, {"score": 0.002752695791351096, "phrase": "sbfl._results"}, {"score": 0.0027287285441182133, "phrase": "experimental_study"}, {"score": 0.0027128661086995203, "phrase": "nine_programs"}, {"score": 0.0023585737444452573, "phrase": "innovative_solution"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Spectrum-based fault localization", " Slice", " Metamorphic slice", " Test oracle", " Metamorphic testing"], "paper_abstract": "Context: Because of its simplicity and effectiveness, Spectrum-Based Fault Localization (SBFL) has been one of the popular approaches towards fault localization. It utilizes the execution result of failure or pass, and the corresponding coverage information (such as program slice) to estimate the risk of being faulty for each program entity (such as statement). However, all existing SBFL techniques assume the existence of a test oracle to determine the execution result of a test case. But, it is common that test oracles do not exist, and hence the applicability of SBFL has been severely restricted. Objective: We aim at developing a framework that can extend the application of SBFL to the common situations where test oracles do not exist. Method: Our approach uses a new concept of metamorphic slice resulting from the integration of metamorphic testing and program slicing. In SBFL, instead of using the program slice and the result of failure or pass for an individual test case, a metamorphic slice and the result of violation or non-violation of a metamorphic relation are used. Since we need not know the execution result for an individual test case, the existence of a test oracle is no longer a requirement to apply SBFL. Results: An experimental study involving nine programs and three risk evaluation formulas was conducted. The results show that our proposed solution delivers a performance comparable to the performance observed by existing SBFL techniques for the situations where test oracles exist. Conclusion: With respect to the problem that SBFL is only applicable to programs with test oracles, we propose an innovative solution. Our solution is not only intuitively appealing and conceptually feasible, but also practically effective. Consequently, test oracles are no longer mandatory for SBFL, and hence the applicability of SBFL is significantly extended. (C) 2012 Elsevier B.V. All rights reserved.", "paper_title": "Metamorphic slice: An application in spectrum-based fault localization", "paper_id": "WOS:000317327000006"}