{"auto_keywords": [{"score": 0.03724793858998927, "phrase": "experimental_group"}, {"score": 0.015719716506582538, "phrase": "inquiry-based_explorations"}, {"score": 0.015545523937327192, "phrase": "dynamic_geometry_environment"}, {"score": 0.015430452414822785, "phrase": "sixth_grade_students'_achievements"}, {"score": 0.011119052844063853, "phrase": "control_group"}, {"score": 0.010319158765458252, "phrase": "qualitative_data"}, {"score": 0.009087979049717792, "phrase": "greater_interest"}, {"score": 0.004096751549280256, "phrase": "sixth_grade_students"}, {"score": 0.003369322866499541, "phrase": "textbook-based_direct_instruction"}, {"score": 0.0032085525502105836, "phrase": "delayed_post-test"}, {"score": 0.0031017521516279664, "phrase": "videotaped_classroom_observations"}, {"score": 0.003021144737188391, "phrase": "dge"}, {"score": 0.002987236799291296, "phrase": "open-ended_explorations"}, {"score": 0.002953711377604328, "phrase": "students'_performances"}, {"score": 0.0025409639091476363, "phrase": "students'_comments"}, {"score": 0.0023478439020699652, "phrase": "dge."}, {"score": 0.002252602622785975, "phrase": "computer-based_learning_environment"}, {"score": 0.0022105951175680856, "phrase": "experimental_groups"}, {"score": 0.0021857667493036786, "phrase": "significant_gender_effect"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Improving classroom teaching", " Applications in subject areas", " Elementary education", " Interactive learning environments", " Gender studies"], "paper_abstract": "The purpose of this study was to investigate the effects of using a dynamic geometry environment (DGE) together with inquiry-based explorations on the sixth grade students' achievements in polygons and congruency and similarity of polygons. Two groups of sixth grade students were selected for this study: an experimental group composed of 66 students (34 boys and 32 girls); and a control group composed of 68 students (35 boys and 33 girls). The students in the experimental group taught with a DGE, while the students in the control group received textbook-based direct instruction. An achievement test was administered as pre-test, post-test, and delayed post-test in both groups. Qualitative data were collected through videotaped classroom observations. The results showed that the DGE together with open-ended explorations significantly improved students' performances in polygons and congruency and similarity of polygons. Furthermore, students in the experimental group showed greater interest and motivation toward learning geometry compared to those in the control group whom often showed lack of interest and curiosity. Also, students' comments and interpretations during lessons and tests were more accurate and advanced in the experimental group as they engage more in the DGE. Moreover, qualitative data suggested that boys showed greater interest in the computer-based learning environment than girls in the experimental groups although no significant gender effect on achievement was found. (C) 2011 Elsevier Ltd. All rights reserved.", "paper_title": "The effect of inquiry-based explorations in a dynamic geometry environment on sixth grade students' achievements in polygons", "paper_id": "WOS:000295860100025"}