{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "mouth_analysis"}, {"score": 0.004765482708043842, "phrase": "service_experience"}, {"score": 0.004620093797504386, "phrase": "rich_source"}, {"score": 0.0045726187330434025, "phrase": "objective_information"}, {"score": 0.004297795905522757, "phrase": "major_ways"}, {"score": 0.0038959121068990517, "phrase": "ewom_overload"}, {"score": 0.0036427316134070007, "phrase": "adverse_effects"}, {"score": 0.0034771228725942846, "phrase": "unstructured_text_formats"}, {"score": 0.003441352119167824, "phrase": "oversimplified_expressions"}, {"score": 0.0029928611380840757, "phrase": "ewom_analysis_method"}, {"score": 0.0023467391904246834, "phrase": "better_understanding_product"}, {"score": 0.0023225701080913388, "phrase": "service_appraisals"}, {"score": 0.0022399174232611853, "phrase": "business_intelligence"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Electronic word-of-mouth (eWOM)", " Service experience", " Sentiment analysis", " Service science"], "paper_abstract": "Since eWOM provides a rich source of objective information about products or services, it has become one of the major ways in which consumers collect information about items they are interested in buying. However, the problem of eWOM overload makes it difficult to effectively collect this information, and may have adverse effects on their actual purchase behavior. eWOM content is characterized by unstructured text formats, oversimplified expressions, and newly coined phrases (textspeak), and these all contribute to the challenges that arise when analyzing eWOM. This study thus proposes an eWOM analysis method for analyzing eWOM, which may lead to a more effective method for analyzing eWOM content, extracting both positive and negative appraisals, and help consumers in their decision making. At the same time, the method proposed in this study can also be utilized as a tool to assist companies in better understanding product or service appraisals, thus translating these opinions into business intelligence and as the basis for product/service improvements. (C) 2012 Elsevier Ltd. All rights reserved.", "paper_title": "Electronic word of mouth analysis for service experience", "paper_id": "WOS:000315607200008"}