{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "modified_phase_field_crystal_equation"}, {"score": 0.0046073860169839305, "phrase": "stable_finite_difference_schemes"}, {"score": 0.0045318666714939905, "phrase": "modified_phase_field_crystal"}, {"score": 0.003820144626025562, "phrase": "convex_splitting_scheme"}, {"score": 0.00373682045166829, "phrase": "appropriate_decomposition"}, {"score": 0.003675517796014622, "phrase": "discrete_energy"}, {"score": 0.003615217162972726, "phrase": "first_order"}, {"score": 0.003516898780234098, "phrase": "second_order"}, {"score": 0.0027437235598539904, "phrase": "space_step_sizes"}, {"score": 0.002639740960006001, "phrase": "efficient_nonlinear_multigrid_methods"}, {"score": 0.002497976173193543, "phrase": "energy_stability"}, {"score": 0.0024299678474208023, "phrase": "practical_utility"}, {"score": 0.002175913488493802, "phrase": "nonlinear_schemes"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Phase field crystal", " Modified phase field crystal", " Finite difference", " Nonlinear multigrid"], "paper_abstract": "In this paper we present two unconditionally energy stable finite difference schemes for the modified phase field crystal (MPFC) equation, a sixth-order nonlinear damped wave equation, of which the purely parabolic phase field crystal (PFC) model can be viewed as a special case. The first is a convex splitting scheme based on an appropriate decomposition of the discrete energy and is first order accurate in time and second order accurate in space. The second is a new, fully second-order scheme that also respects the convex splitting of the energy. Both schemes are nonlinear but may be formulated from the gradients of strictly convex, coercive functionals. Thus, both are uniquely solvable regardless of the time and space step sizes. The schemes are solved by efficient nonlinear multigrid methods. Numerical results are presented demonstrating the accuracy, energy stability, efficiency, and practical utility of the schemes. In particular, we show that our multigrid solvers enjoy optimal, or nearly optimal complexity in the solution of the nonlinear schemes. (C) 2013 Elsevier Inc. All rights reserved.", "paper_title": "Energy stable and efficient finite-difference nonlinear multigrid schemes for the modified phase field crystal equation", "paper_id": "WOS:000321433800014"}