{"auto_keywords": [{"score": 0.024492141848599745, "phrase": "api"}, {"score": 0.00481495049065317, "phrase": "linear_algebra_algorithms"}, {"score": 0.004567596860086148, "phrase": "ultimate_automatic_system"}, {"score": 0.004507760907425495, "phrase": "linear_algebra_libraries"}, {"score": 0.004294962474996283, "phrase": "front_the_mathematical_specification"}, {"score": 0.004238682850598745, "phrase": "target_operation"}, {"score": 0.0037311260623089436, "phrase": "target_architectures"}, {"score": 0.0036660436272785476, "phrase": "submit_button"}, {"score": 0.003586278948128509, "phrase": "optimized_library"}, {"score": 0.003284145698220425, "phrase": "recent_advances"}, {"score": 0.003170520716404193, "phrase": "unreachable_dream"}, {"score": 0.002967931416941965, "phrase": "mathematical_abstract_description"}, {"score": 0.0025778546800417808, "phrase": "control_theory"}, {"score": 0.0021330078238529443, "phrase": "parallel_performance_analyzer"}, {"score": 0.0021049977753042253, "phrase": "optimized_parallel_routines"}], "paper_keywords": [""], "paper_abstract": "It is our belief that the ultimate automatic system for deriving linear algebra libraries should be able to generate a set of algorithms starting front the mathematical specification of the target operation only. Indeed, one should be able to visit a website, fill in a form with information about the operation to be performed and about the target architectures, click the SUBMIT button, and receive an optimized library routine for that operation even if the operation has not previously been implemented. In this paper we relate recent advances towards what is probably regarded as an unreachable dream. We discuss the steps necessary to automatically obtain an algorithm starting from the mathematical abstract description of the operation to be solved. We illustrate how these steps have been incorporated into two prototype systems and we show the application of one the two systems to a problem from Control Theory: The Sylvester Equation. The output of this system is a description of an algorithm that can then be directly translated into code via API's that we have developed. The description can also be passed as input to a parallel performance analyzer to obtain optimized parallel routines [5].", "paper_title": "Automatic derivation of linear algebra algorithms with application to control theory", "paper_id": "WOS:000237003200046"}