{"auto_keywords": [{"score": 0.0045122922461952805, "phrase": "web_crawler"}, {"score": 0.004329630571352367, "phrase": "single-server_implementation"}, {"score": 0.004105558123159003, "phrase": "current_crawling_algorithms"}, {"score": 0.003939296259436904, "phrase": "sheer_volume"}, {"score": 0.0038246602895705643, "phrase": "large_crawls"}, {"score": 0.0036914757355166966, "phrase": "legitimate_multimillion-page_blog_sites"}, {"score": 0.003541923233726252, "phrase": "server-side_scripts"}, {"score": 0.002897109710213723, "phrase": "single_server"}, {"score": 0.0027146742941153443, "phrase": "average_download_rate"}, {"score": 0.0025137856138000014, "phrase": "related_work"}, {"score": 0.0024405312482831646, "phrase": "irlbot"}, {"score": 0.002130056082139311, "phrase": "web_graph"}], "paper_keywords": ["Algorithms", " Measurement", " Performance", " IRLbot", " large scale", " crawling"], "paper_abstract": "This article shares our experience in designing a Web crawler that can download billions of pages using a single-server implementation and models its performance. We first show that current crawling algorithms cannot effectively cope with the sheer volume of URLs generated in large crawls, highly branching spam, legitimate multimillion-page blog sites, and infinite loops created by server-side scripts. We then offer a set of techniques for dealing with these issues and test their performance in an implementation we call IRLbot. In our recent experiment that lasted 41 days, IRLbot running on a single server successfully crawled 6.3 billion valid HTML pages (7.6 billion connection requests) and sustained an average download rate of 319 mb/s (1,789 pages/s). Unlike our prior experiments with algorithms proposed in related work, this version of IRLbot did not experience any bottlenecks and successfully handled content from over 117 million hosts, parsed out 394 billion links, and discovered a subset of the Web graph with 41 billion unique nodes.", "paper_title": "IRLbot: Scaling to 6 Billion Pages and Beyond", "paper_id": "WOS:000268483800001"}