{"auto_keywords": [{"score": 0.03902727831247399, "phrase": "spam_mail"}, {"score": 0.012296909584276821, "phrase": "normal_mail"}, {"score": 0.00481495049065317, "phrase": "massive_spam_mail_classification"}, {"score": 0.00443308765153716, "phrase": "spam_email"}, {"score": 0.004081385289516914, "phrase": "high_degree"}, {"score": 0.0036697319652557363, "phrase": "probability_characteristics"}, {"score": 0.0036052633308076933, "phrase": "evident_difference"}, {"score": 0.0030554300179552415, "phrase": "server-based_massive_mail_classifier"}, {"score": 0.0027146742941153443, "phrase": "massive_spam_mails"}, {"score": 0.002620040660435039, "phrase": "spam_mail_classifier"}, {"score": 0.0023415390666563177, "phrase": "large_volumes"}, {"score": 0.002273292707863821, "phrase": "optimized_parameter_configuration"}, {"score": 0.0021049977753042253, "phrase": "spam_mail_classification"}], "paper_keywords": [""], "paper_abstract": "The past research works have explored the effectiveness of machine learning classifiers for filtering spam email, and the results have shown that machine learning classifiers can obtain a high degree of precision and recall. However, these methods cannot avoid classifying normal mail as spam mail for probability characteristics. The evident difference between spam mail and normal mail is that one spam mail will be delivered to many users, while most normal mails have only one single receiver, Based on this observation, this paper presents a server-based massive mail classifier incorporating counting-based classifier, bitmap-based white list (BWL) and grey list to filter massive spam mails. Results show that the spam mail classifier using our method can filter spam with a very low degree of false positive and also preserves performance while coping with large volumes of spam mail. With optimized parameter configuration, our method achieves a precision of 100% and recall of 75.3% in spam mail classification.", "paper_title": "A counting-based method for massive spam mail classification", "paper_id": "WOS:000237227700005"}