{"auto_keywords": [{"score": 0.01439838054309693, "phrase": "column-preordering_partial-pivoting_unsymmetric-pattern_multifrontal_approach"}, {"score": 0.011057129318751443, "phrase": "superlu_mt"}, {"score": 0.00481495049065317, "phrase": "sparse_lu"}, {"score": 0.004606023493393774, "phrase": "new_parallel_sparse_lu_factorization_algorithm"}, {"score": 0.0038998328617557013, "phrase": "umfpack_version"}, {"score": 0.003751228706861377, "phrase": "shared-memory_machines"}, {"score": 0.0036892809673917592, "phrase": "small_or_moderate_number"}, {"score": 0.003175676186323053, "phrase": "partial_pivoting"}, {"score": 0.0023525345110929326, "phrase": "main_contribution"}, {"score": 0.0021523597459257382, "phrase": "davis"}, {"score": 0.00210499793205176, "phrase": "umfpack"}], "paper_keywords": ["algorithms", " performance", " experimentation", " unsymmetric", " multifrontal", " Gaussian elimination"], "paper_abstract": "We present a new parallel sparse LU factorization algorithm and code. The algorithm uses a column-preordering partial-pivoting unsymmetric-pattern multifrontal approach. Our baseline sequential algorithm is based on UMFPACK 4, but is somewhat simpler and is often somewhat faster than UMFPACK version 4.0. Our parallel algorithm is designed for shared-memory machines with a small or moderate number of processors ( we tested it on up to 32 processors). We experimentally compare our algorithm with SuperLU_MT, an existing shared-memory sparse LU factorization with partial pivoting. SuperLU_MT scales better than our new algorithm, but our algorithm is more reliable and is usually faster. More specifically, on matrices that are costly to factor, our algorithm is usually faster on up to 4 processors, and is usually faster on 8 and 16. We were not able to run SuperLU_MT on 32. The main contribution of this article is showing that the column-preordering partial-pivoting unsymmetric-pattern multifrontal approach, developed as a sequential algorithm by Davis in several recent versions of UMFPACK, can be effectively parallelized.", "paper_title": "Parallel unsymmetric-pattern multifrontal sparse LU with column preordering", "paper_id": "WOS:000256337000002"}