{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "facial_expressions"}, {"score": 0.004440648141548589, "phrase": "danish_dyadic"}, {"score": 0.004321826080883279, "phrase": "head_movements"}, {"score": 0.004201381218977942, "phrase": "manual_annotations"}, {"score": 0.003841699919521703, "phrase": "feedback_functions"}, {"score": 0.0036813725040313002, "phrase": "previous_research"}, {"score": 0.0033804443117334535, "phrase": "specific_communicative_functions"}, {"score": 0.0032531496610470377, "phrase": "multimodal_information"}, {"score": 0.003104038398386081, "phrase": "multimodal_behaviours"}, {"score": 0.0029744042270542655, "phrase": "classifier_performance"}, {"score": 0.002838033152426417, "phrase": "unimodal_baseline"}, {"score": 0.0024028742248152425, "phrase": "best_results"}, {"score": 0.002159623311924437, "phrase": "interlocutor's_speech"}, {"score": 0.0021049977753042253, "phrase": "applied_systems"}], "paper_keywords": ["Multimodal behaviours", " Emotions", " Feedback", " Machine learning"], "paper_abstract": "The paper investigates the relation between emotions and feedback facial expressions in video and audio recorded Danish dyadic first encounters. In particular, we train a classifier on the manual annotations of the corpus in order to investigate to which extent the encoding of emotions contribute to the prediction of the feedback functions of facial expressions. This work builds upon and extends previous research on (a) the annotation and analysis of emotions in the corpus in which it was suggested that emotions are related to specific communicative functions, and (b) the prediction of feedback head movements using multimodal information. The results of the experiments show that information on multimodal behaviours which co-occur with the facial expressions improve the classifier performance. The improvement of the F-measure with respect to the unimodal baseline is of 0.269 and this result is parallel to that obtained for head movements in the same corpus. The experiments also show that the annotations of emotions contribute further to the prediction of feedback facial expressions confirming their relation. The best results are obtained training the classifier on the shape of facial expressions and co-occurring head movements, emotion labels, the gesturer's and the interlocutor's speech and can be used in applied systems.", "paper_title": "Feedback facial expressions and emotions", "paper_id": "WOS:000337754000003"}