{"auto_keywords": [{"score": 0.05007852962010534, "phrase": "customer_satisfaction"}, {"score": 0.008573257379283125, "phrase": "service_quality"}, {"score": 0.004762435022350756, "phrase": "ups_and_fedex_-_an_empirical_study"}, {"score": 0.00474588042843746, "phrase": "parcel_service_industry"}, {"score": 0.004676173016967478, "phrase": "purpose_-_the_purpose"}, {"score": 0.004426623680287086, "phrase": "ups"}, {"score": 0.0043943504157298455, "phrase": "fedex"}, {"score": 0.004252063063815893, "phrase": "overall_customer_satisfaction"}, {"score": 0.004221072004655573, "phrase": "five_critical_factors"}, {"score": 0.003866268750750096, "phrase": "questionnaire_responses"}, {"score": 0.0037962152415512655, "phrase": "usa"}, {"score": 0.003700170452390401, "phrase": "comparison_analysis"}, {"score": 0.003659768899837118, "phrase": "independent_samples"}, {"score": 0.0036463997340348453, "phrase": "mest"}, {"score": 0.0031961879138783012, "phrase": "incoming_and_outgoing_mail"}, {"score": 0.0027304890728580135, "phrase": "nebraska"}, {"score": 0.002680932410366204, "phrase": "total_number"}, {"score": 0.0025562434609873335, "phrase": "additional_insight"}, {"score": 0.002455266773537278, "phrase": "parcel_delivery_service"}, {"score": 0.0023154527779996213, "phrase": "important_role"}, {"score": 0.002298544073884724, "phrase": "customers'_selection"}, {"score": 0.0022817585639886883, "phrase": "parcel_carrier"}, {"score": 0.0022239665922395104, "phrase": "customers_insights"}, {"score": 0.0021835829960683666, "phrase": "parcel_delivery_companies"}], "paper_keywords": ["parcel delivery services", " customer satisfaction", " customer services quality", " United States of America"], "paper_abstract": "Purpose - The purpose of this research is to provide a comparison of customer satisfaction of two largest US parcel delivery companies, the UPS and FedEx. Design/methodology/approach - The paper is contrast the overall customer satisfaction and five critical factors (availability, responsiveness, reliability, completeness, and professionalism of service) that directly affect customer satisfaction for these two parcel delivery companies. Written questionnaire responses from university departments/units in the USA were collected and used for the comparison analysis. An independent samples Mest was used to compare the ratings of customer satisfaction of these two parcel companies. Findings - The paper find's no significant differences in the ratings of service quality of that these two parcel delivery companies provide with respect to both incoming and outgoing mail. The results of this research suggest that the similarity in ratings of service quality of these two companies explain their equally dominant positions in the parcel service industry. Research limitations/implications - The survey subjects only include units/departments within universities, with most of the participants located in Nebraska. By expanding the total number of surveys to include more industries and locations, this research could provide additional insight into the parcel service industry and customer satisfaction. Additionally, price of parcel delivery service was not included as a factor impacting customer satisfaction. Price of service may play an important role in customers' selection of parcel carrier. Originality/value - Findings of this research provide customers insights into the service quality of parcel delivery companies in order for them to make a choice of which carriers to use.", "paper_title": "A comparison study of customer satisfaction between the UPS and FedEx - An empirical study among university customers", "paper_id": "WOS:000237547900011"}