{"auto_keywords": [{"score": 0.046273829908275756, "phrase": "bioinformatics"}, {"score": 0.00481495049065317, "phrase": "tree_mining"}, {"score": 0.004372442291178139, "phrase": "xml_mining"}, {"score": 0.004312622975366676, "phrase": "web_mining"}, {"score": 0.004025531820226182, "phrase": "frequent_induced_and_embedded_subtrees"}, {"score": 0.0033883824438527316, "phrase": "efficient_approach"}, {"score": 0.0032510690712452147, "phrase": "mining_embedded_subtrees"}, {"score": 0.0031626225189867354, "phrase": "novel_embedding_list_representation"}, {"score": 0.0031193028729331667, "phrase": "tree_model_guided_enumeration"}, {"score": 0.0029722900280316216, "phrase": "embedding_constraint"}, {"score": 0.0027361626349903744, "phrase": "frequent_embedded_subtrees"}, {"score": 0.0021342613107011624, "phrase": "freqt"}, {"score": 0.0021049977753042253, "phrase": "treeminer"}], "paper_keywords": [""], "paper_abstract": "Tree mining has recently attracted a lot of interest in areas such as Bioinformatics, XML mining, Web mining, etc. We are mainly concerned with mining frequent induced and embedded subtrees. While more interesting patterns can be obtained when mining embedded subtrees, unfortunately mining. such embedding relationships can be very costly. In this paper, we propose an efficient approach to tackle the complexity of mining embedded subtrees by utilizing a novel Embedding List representation, Tree Model Guided enumeration, and introducing the Level of Embedding constraint. Thus, when it is too costly to mine all frequent embedded subtrees, one can decrease the level of embedding constraint gradually up to 1, from which all the obtained frequent subtrees are induced subtrees. Our experiments with both synthetic and real datasets against two known algorithms for mining induced and embedded subtrees, FREQT and TreeMiner, demonstrate the effectiveness and the efficiency of the technique.", "paper_title": "IMB3-miner: Mining induced/embedded subtrees by constraining the level of embedding", "paper_id": "WOS:000237249600052"}