{"auto_keywords": [{"score": 0.038915505278648656, "phrase": "school-wide_communities"}, {"score": 0.010497559976638949, "phrase": "emerging_communities"}, {"score": 0.00481495049065317, "phrase": "primary_schools"}, {"score": 0.004508942069742167, "phrase": "successful_innovation_adoption"}, {"score": 0.004245476558619167, "phrase": "information_and_communication_technologies"}, {"score": 0.0035630518377071916, "phrase": "implementation_practices"}, {"score": 0.003485824905231454, "phrase": "reported_high_ict_use"}, {"score": 0.003264010423431402, "phrase": "personnel_relationships"}, {"score": 0.0031932442564773468, "phrase": "implementation_goals"}, {"score": 0.0030730639262332698, "phrase": "staff_consistency"}, {"score": 0.0026070408483940535, "phrase": "successful_schools"}, {"score": 0.002454432810862053, "phrase": "lower_levels"}, {"score": 0.0023107372754933887, "phrase": "policy_directions"}, {"score": 0.00221153232497724, "phrase": "purposeful_implementation_strategy"}, {"score": 0.002175436093794315, "phrase": "transition_ict_institutionalization"}, {"score": 0.0021049977753042253, "phrase": "habitualization_stage"}], "paper_keywords": ["Communities of implementation", " ICT policy"], "paper_abstract": "To illustrate the conditions under which successful innovation adoption takes place, this paper focuses on the implementation of information and communication technologies (ICT) through emerging communities in schools. Two types of such communities are described in terms of the degree of participation in the implementation: school-wide communities and enclaves. The article describes implementation practices in four primary schools with reported high ICT use, selected as case-studies. Four criteria, reflecting the domain, personnel relationships, policy and implementation goals and strategies, as well as staff consistency, are employed to outline the existence and types of communities of implementation within these schools. Findings indicate that, although both school-wide communities and enclaves are present in successful schools, enclaves - compared to school-wide communities - are related to lower levels of implementation. Based on these findings the authors discuss policy directions towards the development of school-wide communities as a purposeful implementation strategy to help transition ICT institutionalization from the initiation to the habitualization stage. (C) 2008 Elsevier Ltd. All rights reserved.", "paper_title": "The use of ICT in primary schools within emerging communities of implementation", "paper_id": "WOS:000263701900009"}