{"auto_keywords": [{"score": 0.04957466661795797, "phrase": "-speed_flows"}, {"score": 0.015719716506582538, "phrase": "roe-type_schemes"}, {"score": 0.013244685333783649, "phrase": "non-physical_behavior"}, {"score": 0.004598933498016774, "phrase": "different_ideas"}, {"score": 0.004392565073466714, "phrase": "thornber-drikakis's"}, {"score": 0.004361644989356558, "phrase": "rieper"}, {"score": 0.004240116703465252, "phrase": "modified_roe_schemes"}, {"score": 0.003681238363808568, "phrase": "sound_speed"}, {"score": 0.003322540556404882, "phrase": "zero-order_sound_speed"}, {"score": 0.003229870860371533, "phrase": "negative_effects"}, {"score": 0.003195787852087248, "phrase": "global_cut-off_strategy"}, {"score": 0.0031397776924946526, "phrase": "computational_stability"}, {"score": 0.002988101395789399, "phrase": "local_variables"}, {"score": 0.002803778911405834, "phrase": "hll"}, {"score": 0.002612238631882345, "phrase": "roe-type_scheme"}, {"score": 0.002530359917257626, "phrase": "roe_scheme"}, {"score": 0.0022434880661725493, "phrase": "asymptotic_analysis"}, {"score": 0.0022276618873985445, "phrase": "numerical_experiments"}, {"score": 0.0022041312401435346, "phrase": "theoretical_analysis"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Roe-type scheme", " All-speed flows", " Checkerboard pressure-velocity decoupling", " Asymptotic analysis", " Global cut-off", " HLL scheme", " AUSM(+)-up scheme"], "paper_abstract": "In recent years, Roe-type schemes based on different ideas have been developed for all-speed flows, such as the preconditioned Roe, the All-Speed Roe, Thornber-Drikakis's, Rieper's and Fillion et al.'s modified Roe schemes. This work explores why these schemes succeed or fail with the non-physical behavior, checkerboard and global cut-off problems. Comparison and analysis show that the non-physical behavior and checkerboard problems are caused by the order of the sound speed being too large and too small in the coefficients of the velocity-difference and pressure-difference dissipation terms, respectively. These problems can be resolved by choosing coefficients with zero-order sound speed. In addition, to avoid the negative effects of the global cut-off strategy on accuracy while maintaining computational stability, the terms in the numerator of the coefficients can be determined by local variables, while those in the denominator remain the global cut-off. Applying these three rules, HLL and AUSM(+)-up can also be analyzed showing the universality of the rules, which are not limited to the Roe-type scheme. Especially, three novel schemes, all-speed preconditioned Roe scheme, all-speed HLL scheme, and all-speed AUSM(+)-up scheme, are proposed as examples to demonstrate how these ideas can be applied to construct more satisfactory schemes for all-speed flows. Asymptotic analysis and numerical experiments support the theoretical analysis and the rules obtained in the work. (C) 2013 Elsevier Ltd. All rights reserved.", "paper_title": "Mechanism of Roe-type schemes for all-speed flows and its application", "paper_id": "WOS:000325834300006"}