{"auto_keywords": [{"score": 0.05007831663443004, "phrase": "fatty_liver_disease"}, {"score": 0.04855826957755247, "phrase": "fld"}, {"score": 0.004602233424629559, "phrase": "progressively_prevalent_disease"}, {"score": 0.004484908028307205, "phrase": "world_population"}, {"score": 0.004342430078306461, "phrase": "early_stage"}, {"score": 0.00415050117148714, "phrase": "irreversible_advanced_liver_disease"}, {"score": 0.004044645056447888, "phrase": "liver_cancer"}, {"score": 0.0040186038781533946, "phrase": "liver_failure"}, {"score": 0.003742941972172613, "phrase": "us-based_diagnosis"}, {"score": 0.0034081501761600067, "phrase": "operator_dependability"}, {"score": 0.003257379945810655, "phrase": "different_diagnostic_methods"}, {"score": 0.003133451532433272, "phrase": "state-of-the-art_us-based_cad_techniques"}, {"score": 0.003004494701922268, "phrase": "local_binary_pattern"}, {"score": 0.002956316987429418, "phrase": "haralick_textures"}, {"score": 0.002927780883930371, "phrase": "length_matrix"}, {"score": 0.0028438099634371886, "phrase": "classification_algorithms"}, {"score": 0.0027622407190589326, "phrase": "patient_data"}, {"score": 0.0025312694615202786, "phrase": "new_patient"}, {"score": 0.0024906610581090223, "phrase": "trained_classifiers"}, {"score": 0.002372693822379709, "phrase": "inter-observer_variability"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Computer Aided Diagnosis", " Ultrasound", " Fatty Liver Disease", " Review", " Non Alcoholic Steatohepatitis"], "paper_abstract": "Fatty Liver Disease (FLD) is a progressively prevalent disease that is present in about 15% of the world population. Normally benign and reversible if detected at an early stage, FLD, if left undetected and untreated, can progress to an irreversible advanced liver disease, such as fibrosis, cirrhosis, liver cancer and liver failure, which can cause death. Ultrasound (US) is the most widely used modality to detect FLD. However, the accuracy of US-based diagnosis depends on both the training and expertise of the radiologist. US-based Computer Aided Diagnosis (CAD) techniques for FLD detection can improve accuracy, speed and objectiveness of the diagnosis, and thereby, reduce operator dependability. In this paper, we first review the advantages and limitations of different diagnostic methods which are currently available to detect FLD. We then review the state-of-the-art US-based CAD techniques that utilize a range of image texture based features like entropy, Local Binary Pattern (LBP), Haralick textures and run length matrix in several automated decision making algorithms. These classification algorithms are trained using the features extracted from the patient data in order for them to learn the relationship between the features and the end-result (FLD present or absent). Subsequently, features from a new patient are input to these trained classifiers to determine if he/she has FLD. Due to the use of such automated systems, the inter-observer variability and the subjectivity of associated with reading images by radiologists are eliminated, resulting in a more accurate and quick diagnosis for the patient and time and cost savings for both the patient and the hospital. (C) 2014 Elsevier B.V. All rights reserved.", "paper_title": "Ultrasound-based tissue characterization and classification of fatty liver disease: A screening and diagnostic paradigm", "paper_id": "WOS:000349193400006"}