{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "popular_approach"}, {"score": 0.0047267100475487595, "phrase": "task-parallel_programs"}, {"score": 0.004416713079266374, "phrase": "load_imbalance_results"}, {"score": 0.004362564831572539, "phrase": "seemingly_irregular_computation_structures"}, {"score": 0.003880017219275826, "phrase": "async-finish_parallel_programs"}, {"score": 0.003693103542455806, "phrase": "key_properties"}, {"score": 0.0034506596895901003, "phrase": "low_time_and_space_overheads"}, {"score": 0.0032641439000713306, "phrase": "proposed_schemes"}, {"score": 0.0031649018957020337, "phrase": "data-race_detection"}, {"score": 0.0027457584014804574, "phrase": "execution_time"}, {"score": 0.002323826502178581, "phrase": "significant_reductions"}, {"score": 0.002239225269052105, "phrase": "data_races"}, {"score": 0.0021049977753042253, "phrase": "async-finish_programs"}], "paper_keywords": ["work-stealing schedulers", " tracing", " async-finish parallelism"], "paper_abstract": "Work stealing is a popular approach to scheduling task-parallel programs. The flexibility inherent in work stealing when dealing with load imbalance results in seemingly irregular computation structures, complicating the study of its runtime behavior. In this paper, we present an approach to efficiently trace async-finish parallel programs scheduled using work stealing. We identify key properties that allow us to trace the execution of tasks with low time and space overheads. We also study the usefulness of the proposed schemes in supporting algorithms for data-race detection and retentive stealing presented in the literature. We demonstrate that the perturbation due to tracing is within the variation in the execution time with 99% confidence and the traces are concise, amounting to a few tens of kilobytes per thread in most cases. We also demonstrate that the traces enable significant reductions in the cost of detecting data races and result in low, stable space overheads in supporting retentive stealing for async-finish programs.", "paper_title": "Steal Tree: Low-Overhead Tracing of Work Stealing Schedulers", "paper_id": "WOS:000321865400047"}