{"auto_keywords": [{"score": 0.05007852962010534, "phrase": "cerebrovascular_disease"}, {"score": 0.006430782070708115, "phrase": "taiwan"}, {"score": 0.005762119525777709, "phrase": "cerebrovascular_disease_prevention"}, {"score": 0.0051113159502036275, "phrase": "accurate_diagnosis"}, {"score": 0.0048299472591159685, "phrase": "predictive_model"}, {"score": 0.004782977628406988, "phrase": "data_mining"}, {"score": 0.004284923367722827, "phrase": "huge_cost"}, {"score": 0.004256455007398593, "phrase": "medical_care"}, {"score": 0.004048860957751714, "phrase": "high_priority"}, {"score": 0.003995226376780718, "phrase": "considerable_budget"}, {"score": 0.003968675046544738, "phrase": "human_resource"}, {"score": 0.003942299471749811, "phrase": "long-term_studies"}, {"score": 0.0038762628952762447, "phrase": "decision_tree"}, {"score": 0.0038513524381387364, "phrase": "heavy_burden"}, {"score": 0.003531474887552889, "phrase": "preventive_medicine"}, {"score": 0.003131818247415968, "phrase": "classification_technology"}, {"score": 0.0030902938839530883, "phrase": "optimum_cerebrovascular_disease_predictive_model"}, {"score": 0.0030290342352603124, "phrase": "cerebrovascular_disease_classification_rules"}, {"score": 0.0028145947051539354, "phrase": "treatment_program"}, {"score": 0.0027405354688338954, "phrase": "bayesian"}, {"score": 0.0026504553106526016, "phrase": "classification_models"}, {"score": 0.0025806029313384504, "phrase": "classification_efficiencies_-_sensitivity"}, {"score": 0.0024792523879679836, "phrase": "optimum_predictive_model"}, {"score": 0.0023190823948528953, "phrase": "eight_important_influence_factors"}, {"score": 0.002242911772136627, "phrase": "cerebrovascular_doctors"}, {"score": 0.0021476098263617954, "phrase": "current_clinical_medical_condition"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Cerebrovascular disease", " Data mining", " Decision tree", " Predictive model"], "paper_abstract": "Cerebrovascular disease has been ranked the second or third of top 10 death causes in Taiwan and has caused about 13,000 people death every year since 1986. Once cerebrovascular disease occurs, it not only leads to huge cost of medical care, but even death. All developed countries in the world put cerebrovascular disease prevention and treatment in high priority, and invested considerable budget and human resource in long-term studies, in order to reduce the heavy burden. As the pathogenesis of cerebrovascular disease is complex and variable, it is hard to make accurate diagnosis in advance. However, in perspective of preventive medicine, it is necessary to build a predictive model to enhance the accurate diagnosis of cerebrovascular disease. Therefore, coupled with the 2007 cerebrovascular disease prevention and treatment program of a regional teaching hospital in Taiwan, this study aimed to apply the classification technology to construct an optimum cerebrovascular disease predictive model. From this predictive model, cerebrovascular disease classification rules were extracted and used to improve the diagnosis and prediction of cerebrovascular disease. This study acquired 493 valid samples from this cerebrovascular disease prevention and treatment program, and adopted three classification algorithms, decision tree, Bayesian classifier and back propagation neural network, to construct classification models, respectively. After analyzing and comparing classification efficiencies - sensitivity and accuracy, the decision tree constructed model was chosen as the optimum predictive model for cerebrovascular disease. In this model, the sensitivity and accuracy were 99.48% and 99.59%, respectively, and eight important influence factors of predicting cerebrovascular disease and 16 diagnosis classification rules were extracted. Five experienced cerebrovascular doctors assessed these rules, and confirmed them to be useful to the current clinical medical condition. (C) 2011 Elsevier Ltd. All rights reserved.", "paper_title": "A predictive model for cerebrovascular disease using data mining", "paper_id": "WOS:000289047700115"}