{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "text_categorization"}, {"score": 0.010065255677431809, "phrase": "sequential_patterns"}, {"score": 0.004706895428234964, "phrase": "well-known_task"}, {"score": 0.0046221918332842995, "phrase": "statistical_approaches"}, {"score": 0.0045804107341714, "phrase": "neural_networks"}, {"score": 0.004539005582217305, "phrase": "support_vector_machines"}, {"score": 0.0038895008852940323, "phrase": "comprehensive_and_reusable_rules"}, {"score": 0.0033937776228549557, "phrase": "association-rule_based_approach"}, {"score": 0.0030291453183733897, "phrase": "spac_method"}, {"score": 0.0026913130726432645, "phrase": "complex_and_time-consuming_representations"}, {"score": 0.0025951294037626174, "phrase": "natural_language"}, {"score": 0.0025716240685409535, "phrase": "grammatical_methods"}, {"score": 0.002536763634539386, "phrase": "original_method"}, {"score": 0.0021339408744997994, "phrase": "cba"}, {"score": 0.0021049977753042253, "phrase": "better_results"}], "paper_keywords": ["text mining", " categorization", " sequential patterns", " SPaC"], "paper_abstract": "Text categorization is a well-known task based essentially on statistical approaches using neural networks, Support Vector Machines and other machine learning algorithms. Texts are generally considered as bags of words without any order. Although these approaches have proven to be efficient, they do not provide users with comprehensive and reusable rules about their data. Such rules are, however, very important for users to describe trends in the data they have to analyze. In this framework, an association-rule based approach has been proposed by Bing Liu (CBA). We propose, in this paper, to extend this approach by using sequential patterns in the SPaC method (Sequential Patterns for Classification) for text categorization. Taking order into account allows us to represent the succession of words through a document without complex and time-consuming representations and treatments such as those performed in natural language and grammatical methods. The original method we propose here consists in mining sequential patterns in order to build a classifier. We experimentally show that our proposal is relevant, and that it is very interesting compared to other methods. In particular, our method outperforms CBA and provides better results than SVM on some corpus.", "paper_title": "Sequential patterns for text categorization", "paper_id": "WOS:000202969700002"}