{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "sensor_systems"}, {"score": 0.008091060067155846, "phrase": "dairy_farms"}, {"score": 0.005789593659807818, "phrase": "productivity_change"}, {"score": 0.005717280507426434, "phrase": "farm_accounting_data"}, {"score": 0.0038227112550093863, "phrase": "dairy_cows"}, {"score": 0.003665552439863732, "phrase": "total_variable_costs"}, {"score": 0.0036498542356361166, "phrase": "technical_change"}, {"score": 0.003619672388007568, "phrase": "total_labor_costs"}, {"score": 0.003138030910104256, "phrase": "automatic_milking_system"}, {"score": 0.0030343239259424497, "phrase": "conventional_milking_system"}, {"score": 0.0029963220035448056, "phrase": "malmquist"}, {"score": 0.002897283610433351, "phrase": "individual_farm_changes"}, {"score": 0.002778064757980489, "phrase": "technical_efficiency_change"}, {"score": 0.0024489727828322693, "phrase": "potential_technological_improvement"}, {"score": 0.0021861845339709533, "phrase": "technical_performance"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Cows", " Sensors", " Costs", " Automatic milking"], "paper_abstract": "The objective of this study was to investigate the impact of investment in sensor systems on productivity change, using farm accounting data. Farm accounting data for the years 2008-2013 was available for 217 Dutch dairy farms. In addition, information was available on the adoption of sensor systems on these farms. For each farm, 5 input variables (number of dairy cows, number of hectares, total capital costs, total variable costs, and total labor costs) and 1 output variable (total revenues) were defined for each year. The Malmquist Total Factor Productivity index was used to examine productivity change for three categories of farms: farms without sensor systems, farms with sensor systems at an automatic milking system, and farms with sensor systems at a conventional milking system. The Malmquist index measures how the productivity of an individual farm changes over time and enables the contributions of technical change and technical efficiency change to be identified. Productivity did not change after investment in sensor systems on dairy farms. Furthermore, no technical change was found after investment in sensor systems, suggesting that the potential technological improvement claimed by producers of sensor systems does not materialize on dairy farms. Providing more information and guidance on how to use the output of sensor systems might improve the technical performance of the farms. (C) 2015 Elsevier B.V. All rights reserved.", "paper_title": "Economic consequences of investing in sensor systems on dairy farms", "paper_id": "WOS:000366781500004"}