{"auto_keywords": [{"score": 0.0345903359351965, "phrase": "consumer's_preferences"}, {"score": 0.00481495049065317, "phrase": "opponent's_preferences"}, {"score": 0.0047804843375940835, "phrase": "effective_negotiation"}, {"score": 0.004595263305771512, "phrase": "automated_negotiation"}, {"score": 0.004481132747216135, "phrase": "software_agents"}, {"score": 0.004066740842661956, "phrase": "counter_offers"}, {"score": 0.003937273640906994, "phrase": "crucial_aspect"}, {"score": 0.003509317669345521, "phrase": "learning_algorithm"}, {"score": 0.003361069456060196, "phrase": "consumer's_needs"}, {"score": 0.0032075033252058835, "phrase": "inductive_learning"}, {"score": 0.0030609320300175953, "phrase": "negotiation_proceeds"}, {"score": 0.0028279422436488116, "phrase": "similar_service_requests"}, {"score": 0.0026220625042810706, "phrase": "disjunctive_preferences"}, {"score": 0.0025202582748972122, "phrase": "complex_ways"}, {"score": 0.0024223970976460173, "phrase": "well-targeted_offers"}], "paper_keywords": ["Negotiation", " Preference Learning", " Ontology Reasoning", " Disjunctive Preferences"], "paper_abstract": "We consider automated negotiation as a process carried out by software agents to reach a consensus. To automate negotiation, we expect agents to understand their user's preferences, generate offers that will satisfy their user, and decide whether counter offers are satisfactory. For this purpose, a crucial aspect is the treatment of preferences. An agent not only needs to understand its own user's preferences, but also its opponent's preferences so that agreements can be reached. Accordingly, this paper proposes a learning algorithm that can be used by a producer during negotiation to understand consumer's needs and to offer services that respect consumer's preferences. Our proposed algorithm is based on inductive learning but also incorporates the idea of revision. Thus, as the negotiation proceeds, a producer can revise its idea of the consumer's preferences. The learning is enhanced with the use of ontologies so that similar service requests can be identified and treated similarly. Further, the algorithm is targeted to learning both conjunctive as well as disjunctive preferences. Hence, even if the consumer's preferences are specified in complex ways, our algorithm can learn and guide the producer to create well-targeted offers. Further, our algorithm can detect whether some preferences cannot be satisfied early and thus consensus cannot be reached. Our experimental results show that the producer using our learning algorithm negotiates faster and more successfully with customers compared to several other algorithms.", "paper_title": "Learning opponent's preferences for effective negotiation: an approach based on concept learning", "paper_id": "WOS:000298751700004"}