{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "lively_video_content_presentation"}, {"score": 0.004252469672259375, "phrase": "assistive_software"}, {"score": 0.004007083686875716, "phrase": "labor-intensive_and_time-consuming_process"}, {"score": 0.0037150687722055727, "phrase": "movie_clip"}, {"score": 0.00342568771304873, "phrase": "information_preservation"}, {"score": 0.002789226820897593, "phrase": "script-face_mapping"}, {"score": 0.002714779217561487, "phrase": "recognition_techniques"}, {"score": 0.0026280534600940137, "phrase": "characters'_faces"}, {"score": 0.0025578967205807843, "phrase": "descriptive_picture_extraction"}, {"score": 0.0021049977753042253, "phrase": "movie_clips"}], "paper_keywords": ["Cartoonization", " comics", " descriptive picture extraction"], "paper_abstract": "As a type of artwork, comics is prevalent and popular around the world. However, despite the availability of assistive software and tools, the creation of comics is still a labor-intensive and time-consuming process. This paper proposes a scheme that is able to automatically turn a movie clip to comics. Two principles are followed in the scheme: 1) optimizing the information preservation of the movie; and 2) generating outputs following the rules and the styles of comics. The scheme mainly contains three components: script-face mapping, descriptive picture extraction, and cartoonization. The script-face mapping utilizes face tracking and recognition techniques to accomplish the mapping between characters' faces and their scripts. The descriptive picture extraction then generates a sequence of frames for presentation. Finally, the cartoonization is accomplished via three steps: panel scaling, stylization, and comics layout design. Experiments are conducted on a set of movie clips and the results have demonstrated the usefulness and the effectiveness of the scheme.", "paper_title": "Movie2Comics: Towards a Lively Video Content Presentation", "paper_id": "WOS:000304166700017"}