{"auto_keywords": [{"score": 0.04453527007923276, "phrase": "source_vocabularies"}, {"score": 0.01482398703697229, "phrase": "multiple_relations"}, {"score": 0.008713768692145013, "phrase": "multiply-related_concepts"}, {"score": 0.003536720212056521, "phrase": "concept_and_term_levels"}, {"score": 0.0033860360186761533, "phrase": "contradictory_relations"}, {"score": 0.0032675209435107273, "phrase": "umls_scale"}, {"score": 0.003128270147867462, "phrase": "homogeneous_combinations"}, {"score": 0.0028110458014332187, "phrase": "remaining_source_vocabularies"}, {"score": 0.0027341763737751467, "phrase": "multiple_non-homogeneous_relations"}, {"score": 0.0026594033724490172, "phrase": "term_level"}, {"score": 0.0023613726075968986, "phrase": "discussion_manual_analysis"}, {"score": 0.0023058910418682676, "phrase": "conceptualization_difference"}, {"score": 0.002207530926563892, "phrase": "source_relations"}], "paper_keywords": [""], "paper_abstract": "Objective This work focuses on multiply-related Unified Medical Language System (UMLS) concepts, that is, concepts associated through multiple relations. The relations involved in such situations are audited to determine whether they are provided by source vocabularies or result from the integration of these vocabularies within the UMLS. Methods We study the compatibility of the multiple relations which associate the concepts under investigation and try to explain the reason why they co-occur. Towards this end, we analyze the relations both at the concept and term levels. In addition, we randomly select 288 concepts associated through contradictory relations and manually analyze them. Results At the UMLS scale, only 0.7% of combinations of relations are contradictory, while homogeneous combinations are observed in one-third of situations. At the scale of source vocabularies, one-third do not contain more than one relation between the concepts under investigation. Among the remaining source vocabularies, seven of them mainly present multiple non-homogeneous relations between terms. Analysis at the term level also shows that only in a quarter of cases are the source vocabularies responsible for the presence of multiply-related concepts in the UMLS. These results are available at: http://www.isped.u-bordeaux2.fr/ArticleJAMIA/results_multiply_related_concepts.aspx. Discussion Manual analysis was useful to explain the conceptualization difference in relations between terms across source vocabularies. The exploitation of source relations was helpful for understanding why some source vocabularies describe multiple relations between a given pair of terms.", "paper_title": "Auditing the multiply-related concepts within the UMLS", "paper_id": "WOS:000341858100003"}