{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "peer-to-peer_networks"}, {"score": 0.004657185361669812, "phrase": "social_interactions"}, {"score": 0.004595529592539951, "phrase": "small-world_phenomena"}, {"score": 0.004021954624114115, "phrase": "small_world_behaviours"}, {"score": 0.0037624955853577786, "phrase": "peer_nodes"}, {"score": 0.0032925489316383955, "phrase": "highly_dynamic_environments"}, {"score": 0.0030189426536422577, "phrase": "object_discovery"}, {"score": 0.002881130228859848, "phrase": "social_networks"}, {"score": 0.0026771333996253783, "phrase": "limited_cached_knowledge"}, {"score": 0.002641621667026613, "phrase": "node_connections"}, {"score": 0.002421975107313603, "phrase": "peer_groups"}, {"score": 0.0021049977753042253, "phrase": "daily_searches"}], "paper_keywords": ["peer-to-peer", " social interactions", " small world", " performance evaluations", " simulations"], "paper_abstract": "Small-world phenomena have been observed in existing peer-to-peer (P2P) networks which has proved useful in the design of P2P file-sharing systems. Most studies of constructing small world behaviours on P2P are based on the concept of clustering peer nodes into groups, communities or clusters. However, managing additional multilayer topology increases maintenance overhead, especially in highly dynamic environments. In this paper, we present Social-like P2P systems (Social-P2Ps) for object discovery by self-managing P2P topology with human tactics in social networks. In Social-P2Ps, queries are routed intelligently even with limited cached knowledge and node connections. Unlike community-based P2P file-sharing systems, we do not intend to create and maintain peer groups or communities consciously. In contrast, each node connects to other peer nodes with the same interests spontaneously by the result of daily searches.", "paper_title": "Managing peer-to-peer networks with human tactics in social interactions", "paper_id": "WOS:000254907000002"}