{"auto_keywords": [{"score": 0.004692248043162038, "phrase": "crane"}, {"score": 0.004525629293824217, "phrase": "heavy_object"}, {"score": 0.004342430078306461, "phrase": "manufacturing_industry"}, {"score": 0.0041666157975446564, "phrase": "important_resource"}, {"score": 0.004102528738941734, "phrase": "train_oilcan"}, {"score": 0.004039423410198574, "phrase": "crane_scheduling"}, {"score": 0.0037381083634085424, "phrase": "cyclic_single_crane_scheduling_problem"}, {"score": 0.0032848684681050745, "phrase": "processing_time"}, {"score": 0.0026570998719084153, "phrase": "production_cycle"}, {"score": 0.0025892330566358503, "phrase": "time_way_diagram"}, {"score": 0.0025100713447593773, "phrase": "mixed_integer_linear_programming_model"}, {"score": 0.0023958326775913165, "phrase": "scheduling_problem"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Crane scheduling", " Mixed integer linear programming", " Repairing", " Service industry"], "paper_abstract": "Crane is widely used to move a heavy object from one place to another not only in manufacturing industry but also service industry. As an important resource in the train oilcan repairing, crane scheduling affects directly the productivity of the systems. In this paper, we study cyclic single crane scheduling problem with two parallel train oilcan repairing lines, where jobs are loaded into the line at one end and unloaded at the other end. The processing time at each workstation must be within a given range. There is no buffer between these stations. A crane is used to move jobs between the workstations in two parallel lines. The objective is to schedule the moves to minimize the production cycle. We proposed a time way diagram for two parallel lines and developed a mixed integer linear programming model. Then we extended the model to the scheduling problem with multi-station to eliminate the bottleneck in lines. Examples are given to demonstrate the effectiveness of the model. (C) 2011 Elsevier Ltd. All rights reserved.", "paper_title": "Optimal cyclic single crane scheduling for two parallel train oilcan repairing lines", "paper_id": "WOS:000300745900007"}