{"auto_keywords": [{"score": 0.03627342073807306, "phrase": "base_station"}, {"score": 0.014981767887395641, "phrase": "proposed_scheme"}, {"score": 0.008629812940762698, "phrase": "limited_communication_range"}, {"score": 0.008103339173697087, "phrase": "uav"}, {"score": 0.00481495049065317, "phrase": "micro_uavs"}, {"score": 0.004676575291629554, "phrase": "moving_target"}, {"score": 0.004542158659382197, "phrase": "micro_unmanned_aerial_vehicle"}, {"score": 0.004263972370406983, "phrase": "uav_group"}, {"score": 0.004141365648080381, "phrase": "location_information"}, {"score": 0.0038499929374478125, "phrase": "information_transmission"}, {"score": 0.0035616743422949766, "phrase": "search_area"}, {"score": 0.0032629585038738856, "phrase": "multihop_connectivity"}, {"score": 0.002424450174817922, "phrase": "target's_location"}, {"score": 0.002320449502337321, "phrase": "target_tracking"}, {"score": 0.002264607102799332, "phrase": "current_number"}], "paper_keywords": ["Micro UAV", " Connectivity", " Target tracking", " Information delivery", " Swarm control"], "paper_abstract": "In the proposed scheme, micro Unmanned Aerial Vehicle (micro UAV) is used to find the target and the UAV group is controlled to constantly provide location information to the base while the target is moving. UAVs have a limited communication range and information transmission is only possible through communication among the UAVs. After locating the target within the search area, the UAVs move toward the base station in order to transmit the information to the base station using multihop connectivity. In the proposed scheme, when communication is not possible among the UAVs because the target moves too far away from the base station, UAVs retain the information of the target and move toward the base station, deliver the information to another UAV, return to the target, and repeat the process. The base station calculates the range of target's location upon receiving the information, and determines whether target tracking is possible with the current number of UAVs. The performance of the proposed scheme was evaluated by a simulation using NS-2.", "paper_title": "Information delivery scheme of micro UAVs having limited communication range during tracking the moving target", "paper_id": "WOS:000326461100022"}