{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "reference_sets"}, {"score": 0.005999254531713986, "phrase": "machine-constructed_reference_sets"}, {"score": 0.004456044928556639, "phrase": "classsified_ads"}, {"score": 0.004417848254181138, "phrase": "auction_listings"}, {"score": 0.004379977556546879, "phrase": "forum_postings"}, {"score": 0.0039841418890102925, "phrase": "useful_information"}, {"score": 0.003865826699096508, "phrase": "semi-automatically_building_tables"}, {"score": 0.003441352119167824, "phrase": "ontology_maintenance"}, {"score": 0.0034118234596993836, "phrase": "information_extraction"}, {"score": 0.0031032109441552287, "phrase": "reference_set"}, {"score": 0.0029467742734417255, "phrase": "special_case"}, {"score": 0.0029214769181390653, "phrase": "even_this_small_amount"}, {"score": 0.002566997205079849, "phrase": "reference-set-based_information_extraction"}, {"score": 0.002448061472257196, "phrase": "manually_constructed_reference_sets"}, {"score": 0.0023855210798264205, "phrase": "reference-set-based_extraction_approach"}, {"score": 0.002294686545883412, "phrase": "supervised_extraction_approaches"}, {"score": 0.0022749744354271834, "phrase": "generic_features"}, {"score": 0.0021232402128269906, "phrase": "supervised_methods"}, {"score": 0.0021049977753042253, "phrase": "training_data"}], "paper_keywords": [""], "paper_abstract": "Vast amounts of text on the Web are unstructured and ungrammatical, such as classsified ads, auction listings, forum postings, etc. We call such text \"posts.\" Despite their inconsistent structure and lack of grammar, posts are full of useful information. This paper presents work on semi-automatically building tables of relational information, called \"reference sets,\" by analyzing such posts directly. Reference sets can be applied to a number of tasks such as ontology maintenance and information extraction. Our reference-set construction method starts with just a small amount of background knowledge, and constructs tuples representing the entities in the posts to form a reference set. We also describe an extension to this approach for the special case where even this small amount of background knowledge is impossible to discover and use. To evaluate the utility of the machine-constructed reference sets, we compare them to manually constructed reference sets in the context of reference-set-based information extraction. Our results show the reference sets constructed by our method outperform manually constructed reference sets. We also compare the reference-set-based extraction approach using the machine-constructed reference set to supervised extraction approaches using generic features. These results demonstrate that using machine-constructed reference sets outperforms the supervised methods, even though the supervised methods require training data.", "paper_title": "Constructing Reference Sets from Unstructured, Ungrammatical Text", "paper_id": "WOS:000278755500004"}