{"auto_keywords": [{"score": 0.04964580252386599, "phrase": "high_speed_networks"}, {"score": 0.04591233469015343, "phrase": "network_traffic"}, {"score": 0.04098848725041778, "phrase": "first_stage"}, {"score": 0.038890223284229065, "phrase": "second_stage"}, {"score": 0.034845538329572164, "phrase": "tcm"}, {"score": 0.0046432244185370605, "phrase": "new_generation"}, {"score": 0.00460125407969429, "phrase": "smart_peer-to-peer_applications"}, {"score": 0.0041637779492720295, "phrase": "self-learning_traffic_classifier"}, {"score": 0.0036497740708342093, "phrase": "application_payload_signatures"}, {"score": 0.0033326252993345685, "phrase": "time_correlation_metric"}, {"score": 0.0032135959043774085, "phrase": "temporal_correlation"}, {"score": 0.0029076695661972114, "phrase": "different_continents"}, {"score": 0.0028293966058473476, "phrase": "detection_rate"}, {"score": 0.0027035833504191233, "phrase": "false_positives"}, {"score": 0.0025716240685409513, "phrase": "laser_signature_extraction_algorithm"}, {"score": 0.0022847009758393405, "phrase": "sltc"}, {"score": 0.0021830553825770097, "phrase": "unknown_traffic"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Traffic classifier", " p2p Traffic detection", " Peer-to-peer networks", " Self-learning system"], "paper_abstract": "The popularity of a new generation of smart peer-to-peer applications has resulted in several new challenges for accurately classifying network traffic. In this paper, we propose a novel two-stage p2p traffic classifier, called Self-Learning Traffic Classifier (SLTC), that can accurately identify p2p traffic in high speed networks. The first stage classifies p2p traffic from the rest of the network traffic, and the second stage automatically extracts application payload signatures to accurately identify the p2p application that generated the p2p flow. For the first stage, we propose a fast, light-weight algorithm called Time Correlation Metric (TCM), that exploits the temporal correlation of flows to clearly separate peer-to-peer (p2p) traffic from the rest of the traffic. Using real network traces from tier-1 ISPs that are located in different continents, we show that the detection rate of TCM is consistently above 95% while always keeping the false positives at 0%. For the second stage, we use the LASER signature extraction algorithm [20] to accurately identify signatures of several known and unknown p2p protocols with very small false positive rate (<1%). Using our prototype on tier-1 ISP traces, we demonstrate that SLTC automatically learns signatures for more than 95% of both known and unknown traffic within 3 min. (C) 2009 Elsevier B.V. All rights reserved.", "paper_title": "A novel self-learning architecture for p2p traffic classification in high speed networks", "paper_id": "WOS:000277811100001"}