{"auto_keywords": [{"score": 0.044340662163821175, "phrase": "ltl"}, {"score": 0.017039568888337044, "phrase": "utl"}, {"score": 0.005926583100958686, "phrase": "markov"}, {"score": 0.004694092086199672, "phrase": "linear-time_properties"}, {"score": 0.004649552749844436, "phrase": "first-order_logic"}, {"score": 0.004620093797504386, "phrase": "non-elementary_complexity"}, {"score": 0.0043080553835735825, "phrase": "two-variable_first-order_logic"}, {"score": 0.003891268447737902, "phrase": "comprehensive_look"}, {"score": 0.00378145978325955, "phrase": "verification_problems"}, {"score": 0.00365143309008563, "phrase": "wide_range"}, {"score": 0.003537097098008714, "phrase": "unary_temporal_logic"}, {"score": 0.0033190180867511605, "phrase": "stutter-free_fragment"}, {"score": 0.0032355864829403413, "phrase": "successor_relation"}, {"score": 0.0030945803650219033, "phrase": "next_and_previous_connectives"}, {"score": 0.002988101395789399, "phrase": "upper_bounds"}, {"score": 0.002866962651131435, "phrase": "new_bounds"}, {"score": 0.0028397103530211415, "phrase": "non-deterministic_systems"}, {"score": 0.002733260122876447, "phrase": "probabilistic_systems"}, {"score": 0.002564613964408878, "phrase": "lower-bound_arguments"}, {"score": 0.0024684528790093743, "phrase": "ltl."}, {"score": 0.0022650315005334916, "phrase": "unified_approach"}, {"score": 0.0021731423856364003, "phrase": "nearly_comprehensive_picture"}], "paper_keywords": ["Finite Model Theory", " Verification", " Automata"], "paper_abstract": "Model checking linear-time properties expressed in first-order logic has non-elementary complexity, and thus various restricted logical languages are employed. In this paper we consider two such restricted specification logics, linear temporal logic (LTL) and two-variable first-order logic (FO2). LTL is more expressive but FO2 can be more succinct, and hence it is not clear which should be easier to verify. We take a comprehensive look at the issue, giving a comparison of verification problems for FO2, LTL, and various sub-logics thereof across a wide range of models. In particular, we look at unary temporal logic (UTL), a subset of LTL that is expressively equivalent to FO2; we also consider the stutter-free fragment of FO2, obtained by omitting the successor relation, and the expressively equivalent fragment of UTL, obtained by omitting the next and previous connectives. We give three logic-to-automata translations which can be used to give upper bounds for FO2 and UTL and various sub-logics. We apply these to get new bounds for both non-deterministic systems (hierarchical and recursive state machines, games) and for probabilistic systems (Markov chains, recursive Markov chains, and Markov decision processes). We couple these with matching lower-bound arguments. Next, we look at combining FO2 verification techniques with those for LTL. We present here a language that subsumes both FO2 and LTL, and inherits the model checking properties of both languages. Our results give both a unified approach to understanding the behaviour of FO2 and LTL, along with a nearly comprehensive picture of the complexity of verification for these logics and their sublogics.", "paper_title": "TWO VARIABLE VS. LINEAR TEMPORAL LOGIC IN MODEL CHECKING AND GAMES", "paper_id": "WOS:000322537700008"}