{"auto_keywords": [{"score": 0.049725544371589304, "phrase": "dendritic_spines"}, {"score": 0.00481495049065317, "phrase": "fluorescence_microscopy_images"}, {"score": 0.004244955499652296, "phrase": "operator_bias"}, {"score": 0.0037283301619292636, "phrase": "degraded_detection_performance"}, {"score": 0.0036734281414482735, "phrase": "larger_pixel_size"}, {"score": 0.003385555209074879, "phrase": "detected_spines"}, {"score": 0.0031317713853981064, "phrase": "oriented_markov_random_field"}, {"score": 0.0030856268625708695, "phrase": "based_algorithm"}, {"score": 0.0030514638431036714, "phrase": "spine_detection"}, {"score": 0.002864891318409297, "phrase": "roi"}, {"score": 0.002689666606553487, "phrase": "adaptive_procedure"}, {"score": 0.002650018880406324, "phrase": "image_background"}, {"score": 0.0026012779346272848, "phrase": "omrf_model"}, {"score": 0.002553431170229379, "phrase": "statistical_framework"}, {"score": 0.0023972232771581753, "phrase": "knowledge-guided_iterative_conditional_mode"}, {"score": 0.0023184226291364097, "phrase": "existing_algorithms"}, {"score": 0.0022927343007881846, "phrase": "proposed_algorithm"}, {"score": 0.00222561197623787, "phrase": "spine_shape"}, {"score": 0.002176560171729638, "phrase": "detection_performance"}, {"score": 0.0021049977753042253, "phrase": "false_detection"}], "paper_keywords": ["Dendritic spine", " Segmentation", " Automatic detection", " Microscopy image"], "paper_abstract": "Dendritic spines have been shown to be closely related to various functional properties of the neuron. Usually dendritic spines are manually labeled to analyze their morphological changes, which is very time-consuming and susceptible to operator bias, even with the assistance of computers. To deal with these issues, several methods have been recently proposed to automatically detect and measure the dendritic spines with little human interaction. However, problems such as degraded detection performance for images with larger pixel size (e.g. 0.125 mu m/pixel instead of 0.08 mu m/pixel) still exist in these methods. Moreover, the shapes of detected spines are also distorted. For example, the \"necks\" of some spines are missed. Here we present an oriented Markov random field (OMRF) based algorithm which improves spine detection as well as their geometric characterization. We begin with the identification of a region of interest (ROI) containing all the dendrites and spines to be analyzed. For this purpose, we introduce an adaptive procedure for identifying the image background. Next, the OMRF model is discussed within a statistical framework and the segmentation is solved as a maximum a posteriori estimation (MAP) problem, whose optimal solution is found by a knowledge-guided iterative conditional mode (KICM) algorithm. Compared with the existing algorithms, the proposed algorithm not only provides a more accurate representation of the spine shape, but also improves the detection performance by more than 50% with regard to reducing both the misses and false detection.", "paper_title": "Oriented Markov Random Field Based Dendritic Spine Segmentation for Fluorescence Microscopy Images", "paper_id": "WOS:000282212500003"}