{"auto_keywords": [{"score": 0.04752705852086146, "phrase": "human_body"}, {"score": 0.004736563452994885, "phrase": "human_shoulder_complex"}, {"score": 0.003997343989408636, "phrase": "simple_ball"}, {"score": 0.003682100144121148, "phrase": "shoulder_skeletal_model"}, {"score": 0.0035630518377071916, "phrase": "standard_skinning_algorithms"}, {"score": 0.0034102660898135155, "phrase": "closer_approximation"}, {"score": 0.0033546701239540555, "phrase": "actual_skin_deformations"}, {"score": 0.0032107911131811057, "phrase": "data-driven_approach"}, {"score": 0.0031584367879334114, "phrase": "ground_truth_skin_deformation_data"}, {"score": 0.0031069334778456633, "phrase": "optical_motion_capture_system"}, {"score": 0.0030562674358159945, "phrase": "large_number"}, {"score": 0.0027691111795848183, "phrase": "movement_sequences"}, {"score": 0.0026070408483940535, "phrase": "resulting_animation"}, {"score": 0.0024410093024417527, "phrase": "complete_skeleton"}, {"score": 0.002285527382381719, "phrase": "ground_truth_data"}, {"score": 0.002223696715077018, "phrase": "recorded_video"}], "paper_keywords": [""], "paper_abstract": "The human shoulder complex is perhaps the most complicated joint in the human body being comprised of a set of three bones, muscles, tendons, and ligaments. Despite this anatomical complexity, computer graphics models for motion capture most often represent this joint as a simple ball and socket. In this paper, we present a method to determine a shoulder skeletal model that, when combined with standard skinning algorithms, generates a more visually pleasing animation that is a closer approximation to the actual skin deformations of the human body. We use a data-driven approach and collect ground truth skin deformation data with an optical motion capture system with a large number of markers (200 markers on the shoulder complex alone). We cluster these markers during movement sequences and discover that adding one extra joint around the shoulder improves the resulting animation qualitatively and quantitatively yielding a marker set of approximately 70 markers for the complete skeleton. We demonstrate the effectiveness of our skeletal model by comparing it with ground truth data as well as with recorded video. We show its practicality by integrating it with the conventional rendering/animation pipeline.", "paper_title": "A Data-driven Segmentation for the Shoulder Complex", "paper_id": "WOS:000278182500030"}