{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "knowledge_management_systems"}, {"score": 0.007535301521712377, "phrase": "western_australia"}, {"score": 0.004012500850311087, "phrase": "mixed_methodology_approach"}, {"score": 0.0032431667821391044, "phrase": "partial_least_square_approach"}, {"score": 0.0028890603352364273, "phrase": "\"perceived_usefulness"}, {"score": 0.0025892330566358503, "phrase": "diffusion_process"}, {"score": 0.0025423706961391034, "phrase": "unexpected_results"}, {"score": 0.002421499421848063, "phrase": "practical_suggestions"}, {"score": 0.0022101267357523408, "phrase": "australia"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Knowledge management", " Knowledge management systems", " Adoption and diffusion", " Partial Least Square", " Quantitative method"], "paper_abstract": "This study investigates the factors influencing the adoption and diffusion of knowledge management systems in Western Australia. The study uses a mixed methodology approach. The research was carried out in three stages: field study, pilot survey, and state survey (top 300 companies). The data of the survey in Western Australia was analyzed through Partial Least Square approach. Results indicate that \"individual factors\", \"external inspiring\", \"organizational factors\" and \"task complexity\" are the significant factors which influence the \"perceived usefulness\" of knowledge management systems, which in turn significantly influences the \"intention\" to adopt knowledge management systems and the diffusion process. Some unexpected results are also revealed. The results provide practical suggestions to those companies who are embarking on the adoption and diffusion of knowledge management systems in Australia or elsewhere. (C) 2011 Elsevier B.V. All rights reserved.", "paper_title": "Examining a model of knowledge management systems adoption and diffusion: A Partial Least Square approach", "paper_id": "WOS:000300648800002"}