{"auto_keywords": [{"score": 0.0444317050970634, "phrase": "computation_cost"}, {"score": 0.008105097904674877, "phrase": "recognition_performance"}, {"score": 0.0044608829094248985, "phrase": "recognition_rate"}, {"score": 0.003449585750738867, "phrase": "whole_face_image"}, {"score": 0.003401954670986958, "phrase": "smaller_sub-images"}, {"score": 0.003217896008931311, "phrase": "better_feature_extraction"}, {"score": 0.002980916123365584, "phrase": "heavy_and_complicated_operations"}, {"score": 0.0028195727965553367, "phrase": "smaller_size"}, {"score": 0.002723186210025975, "phrase": "reduced_amount"}, {"score": 0.0021795515361987144, "phrase": "experimental_results"}, {"score": 0.0021049977753042253, "phrase": "proposed_approach"}], "paper_keywords": ["Face recognition", " feature extraction", " principle component analysis", " covariance computation", " eigen-decomposition", " image integrity"], "paper_abstract": "Several 2DPCA-based face recognition algorithms have been proposed hoping to achieve the goal of improving recognition rate while mostly at the expense of computation cost. In this paper, an approach named SI2DPCA is proposed to not only reduce the computation cost but also increase recognition performance at the same time. The approach divides a whole face image into smaller sub-images to increase the weight of features for better feature extraction. Meanwhile, the computation cost that mainly comes from the heavy and complicated operations against matrices is reduced due to the smaller size of sub-images. The reduced amount of computation has been analyzed and the integrity of sub-images has been discussed thoroughly in the paper. The experiments have been conducted to make comparisons among several better-known approaches and SI2DPCA. The experimental results have demonstrated that the proposed approach works well on reaching the goals of reducing computation cost and improving recognition performance simultaneously.", "paper_title": "A LOW-COMPUTATION APPROACH FOR HUMAN FACE RECOGNITION", "paper_id": "WOS:000314402900010"}