{"auto_keywords": [{"score": 0.045972615885752355, "phrase": "open_access"}, {"score": 0.00481495049065317, "phrase": "open_access_publishing"}, {"score": 0.003941215575554871, "phrase": "best_practice"}, {"score": 0.00387459052649752, "phrase": "monograph_publishers"}, {"score": 0.0032950412841674026, "phrase": "publishing_methods"}, {"score": 0.003104038398386081, "phrase": "available_manuscripts"}, {"score": 0.0029871209444889716, "phrase": "available_less_accessible_scholarship"}, {"score": 0.0029617414861784525, "phrase": "findings_-_scholarship"}, {"score": 0.002639440558428147, "phrase": "practical_implications_-_journals"}, {"score": 0.002550842302473891, "phrase": "research_councils"}, {"score": 0.0025291601927956765, "phrase": "similar_bodies"}, {"score": 0.002475755804232436, "phrase": "high_quality_critical_review"}, {"score": 0.0023221983158528163, "phrase": "wrong_place"}, {"score": 0.0022828795331819025, "phrase": "easier_access"}, {"score": 0.0022062235065459274, "phrase": "pre-publication_review"}, {"score": 0.0021049977753042253, "phrase": "greatest_advances"}], "paper_keywords": ["Open Access Publishing", " Journal publishing", " Editorial process", " Peer review", " Post-publication peer review", " Pre-publication peer review"], "paper_abstract": "Purpose - The purpose of this paper is to explore the difference between Open Access and accessibility, to argue that accessibility is the most crucial feature, and to suggest some ways in which Open Access militates against accessibility. Design/methodology/approach - Analysis of best practice by journals and monograph publishers is used to highlight the degree to which accessibility is enhanced by input from readers and editors. The expense of this, both real and hidden, is shown to be compatible only with difficulty with publishing methods where keeping costs low is essential, and Open Access alternatives that make available manuscripts \"as submitted\" are shown to make available less accessible scholarship. Findings - Scholarship is markedly improved by referees and editors; the emphasis needs to be put on making available the most accessible scholarship, not on making more scholarship available. Practical implications - Journals and publishers should concentrate on, and research councils and similar bodies insist upon, ensuring high quality critical review and editing, not cost-free access. Originality/value - The debate on Open Access has put its emphasis in the wrong place. Rather than easier access to more scholarship, increased resource devoted to pre-publication review, revision and editing is the most important development to ensure the greatest advances in research and scholarship.", "paper_title": "Open Access Publishing, academic research and scholarly communication", "paper_id": "WOS:000370546900002"}