{"auto_keywords": [{"score": 0.048888187983039684, "phrase": "online_syllabuses"}, {"score": 0.04658758200735742, "phrase": "social_sciences"}, {"score": 0.03481001240756683, "phrase": "online_syllabus_citations"}, {"score": 0.00481495049065317, "phrase": "disciplinary_research"}, {"score": 0.004578382275810468, "phrase": "published_academic_research"}, {"score": 0.004202472962684885, "phrase": "journal_articles"}, {"score": 0.004056769841308405, "phrase": "new_potential_sources"}, {"score": 0.004016072233242585, "phrase": "quantitative_data"}, {"score": 0.0038186039088445524, "phrase": "research_impact"}, {"score": 0.0035048567587934254, "phrase": "valuable_source"}, {"score": 0.003417565253539315, "phrase": "educational_utility"}, {"score": 0.002982307044758515, "phrase": "useful_impact_indictor"}, {"score": 0.0028933521924166287, "phrase": "political_science"}, {"score": 0.0028355237433457313, "phrase": "library_science"}, {"score": 0.0026023381988430666, "phrase": "current_social_science_research"}, {"score": 0.0022365262201954643, "phrase": "valuable_additional_source"}, {"score": 0.0021049977753042253, "phrase": "research_articles"}], "paper_keywords": [""], "paper_abstract": "The impact of published academic research in the sciences and social sciences, when measured, is commonly estimated by counting citations from journal articles. The Web has now introduced new potential sources of quantitative data online that could be used to measure aspects of research impact. In this article we assess the extent to which citations from online syllabuses could be a valuable source of evidence about the educational utility of research. An analysis of online syllabus citations to 70,700 articles published in 2003 in the journals of 12 subjects indicates that online syllabus citations were sufficiently numerous to be a useful impact indictor in some social sciences, including political science and information and library science, but not in others, nor in any sciences. This result was consistent with current social science research having, in general, more educational value than current science research. Moreover, articles frequently cited in online syllabuses were not necessarily highly cited by other articles. Hence it seems that online syllabus citations provide a valuable additional source of evidence about the impact of journals, scholars, and research articles in some social sciences.", "paper_title": "Assessing the Impact of Disciplinary Research on Teaching: An Automatic Analysis of Online Syllabuses", "paper_id": "WOS:000260484000004"}