{"auto_keywords": [{"score": 0.04940587850605655, "phrase": "transformational_government"}, {"score": 0.034339829477232575, "phrase": "egovernment_evaluation"}, {"score": 0.00481495049065317, "phrase": "reflective_case_experiences"}, {"score": 0.0047026237903774895, "phrase": "central_government_strategy"}, {"score": 0.004339867166576126, "phrase": "public_purse"}, {"score": 0.004198722289738563, "phrase": "increasingly_attention"}, {"score": 0.0038930368103015467, "phrase": "organisation_learning"}, {"score": 0.003525220627709056, "phrase": "uk_public_sector_setting"}, {"score": 0.003410479630045025, "phrase": "organisational_and_managerial_aspects"}, {"score": 0.0031174595932694036, "phrase": "case_study_analysis"}, {"score": 0.00297346171320082, "phrase": "social_factors"}, {"score": 0.0028630535573013686, "phrase": "prioritisation_sponsorship"}, {"score": 0.002717886783819971, "phrase": "empirical_enquiry"}, {"score": 0.002679585860537941, "phrase": "egovernment_evaluation_practice"}, {"score": 0.002555761854502478, "phrase": "developed_area"}, {"score": 0.0023806459272452353, "phrase": "decision_makers"}, {"score": 0.0023249757987087055, "phrase": "egovernment_agenda"}, {"score": 0.0022385926290967263, "phrase": "evaluation_practice"}], "paper_keywords": ["eGovernment evaluation", " UK public sector", " grounded theory", " interpretive case studies"], "paper_abstract": "Central Government strategy of e-inclusion is being manifested in the form of eGovernment. Given that it is the public purse that funds such investments, there is increasingly attention being paid to the evaluation of these investments, such that value for money and organisation learning can be realised. In this paper the authors report the findings from three interpretive in-depth organisational case studies that explore eGovernment evaluation within a UK public sector setting. The paper elicits insights to organisational and managerial aspects with the purpose of improving knowledge and understanding of eGovernment evaluation. The findings that are extrapolated from the case study analysis are presented in terms of lessons that gravitate around social factors, evaluation, adoption, ownership, prioritisation sponsorship and, responsibility. These lessons are extrapolated from the empirical enquiry to improve eGovernment evaluation practice. The paper concludes that eGovernment evaluation is an under developed area, with most work being developmental in nature and as a result calls for decision makers to engage with the eGovernment agenda and commission eGovernment evaluation exercises to improve evaluation practice such that transformational Government can realise its full potential. The paper ends by highlighting political, economic, technical and social issues as the drivers of the evaluation cycle. (C) 2008 Elsevier B.V. All rights reserved.", "paper_title": "Learning lessons from evaluating eGovernment: Reflective case experiences that support transformational government", "paper_id": "WOS:000256984000006"}