{"auto_keywords": [{"score": 0.048954267401959975, "phrase": "subgroup_discovery"}, {"score": 0.00481495049065317, "phrase": "genetic_programming"}, {"score": 0.004758053266234474, "phrase": "mining_comprehensible_rules"}, {"score": 0.0045370785151713396, "phrase": "novel_grammar-guided_genetic_programming_algorithm"}, {"score": 0.0038640303886081444, "phrase": "comprehensible_rules"}, {"score": 0.003728529119516347, "phrase": "expressive_and_flexible_solutions"}, {"score": 0.003576416581189713, "phrase": "context-free_grammar"}, {"score": 0.0034101316738399203, "phrase": "derivation_tree"}, {"score": 0.0026714812866037584, "phrase": "existing_evolutionary_and_classic_subgroup_discovery_algorithms"}, {"score": 0.00248718591918233, "phrase": "comprehensible_subgroups"}, {"score": 0.0021049977753042253, "phrase": "nonparametric_tests"}], "paper_keywords": ["Data mining (DM)", " genetic programming (GP)", " grammar-guided genetic programming (G3P)", " subgroup discovery (SD)"], "paper_abstract": "This paper proposes a novel grammar-guided genetic programming algorithm for subgroup discovery. This algorithm, called comprehensible grammar-based algorithm for subgroup discovery (CGBA-SD), combines the requirements of discovering comprehensible rules with the ability to mine expressive and flexible solutions owing to the use of a context-free grammar. Each rule is represented as a derivation tree that shows a solution described using the language denoted by the grammar. The algorithm includes mechanisms to adapt the diversity of the population by self-adapting the probabilities of recombination and mutation. We compare the approach with existing evolutionary and classic subgroup discovery algorithms. CGBA-SD appears to be a very promising algorithm that discovers comprehensible subgroups and behaves better than other algorithms as measures by complexity, interest, and precision indicate. The results obtained were validated by means of a series of nonparametric tests.", "paper_title": "On the Use of Genetic Programming for Mining Comprehensible Rules in Subgroup Discovery", "paper_id": "WOS:000345629000008"}