{"auto_keywords": [{"score": 0.007609049254051929, "phrase": "improved_car-following_model"}, {"score": 0.004670896353428476, "phrase": "cooperative_car-following_behaviors"}, {"score": 0.004476399615305783, "phrase": "roadway_traffic_mobility"}, {"score": 0.004263972370406983, "phrase": "signalized_intersection"}, {"score": 0.004212453011596424, "phrase": "jinan"}, {"score": 0.004161638252798637, "phrase": "china"}, {"score": 0.0032629585038738856, "phrase": "full_velocity_difference_model"}, {"score": 0.0032039415997394817, "phrase": "numerical_simulations"}, {"score": 0.0028195727965553367, "phrase": "initial_small_disturbance"}, {"score": 0.002392188222609101, "phrase": "control_strategy"}, {"score": 0.002348883765159185, "phrase": "cooperative_adaptive_cruise_control_system"}, {"score": 0.002264607102799332, "phrase": "traffic_flow"}, {"score": 0.00218334762335187, "phrase": "traffic_jams"}, {"score": 0.0021049977753042253, "phrase": "signalized_intersections"}], "paper_keywords": ["Traffic flow theory", " car-following model", " two preceding cars' average velocity", " comparative analysis"], "paper_abstract": "To better describe cooperative car-following behaviors under intelligent transportation circumstances and increase roadway traffic mobility, the data of three successive following cars at a signalized intersection of Jinan in China were obtained and employed to explore the linkage between two preceding cars' average speed and car-following behaviors. The results indicate that two preceding cars' average velocity has significant effects on the following car's motion. Then an improved car-following model considering two preceding cars' average velocity was proposed and calibrated based on full velocity difference model and some numerical simulations were carried out to study how two preceding cars' average speed are affected the starting process and the traffic flow evolution process with an initial small disturbance, the results indicate that the improved car-following model can qualitatively describe the impacts of two preceding cars' average velocity on traffic flow and that taking two preceding cars' average velocity into account in designing the control strategy for the cooperative adaptive cruise control system can improve the stability of traffic flow, suppress the appearance of traffic jams and increase the capacity of signalized intersections.", "paper_title": "An improved car-following model with two preceding cars' average speed", "paper_id": "WOS:000353956300011"}