{"auto_keywords": [{"score": 0.04754102116604855, "phrase": "crm"}, {"score": 0.040170757214929714, "phrase": "crm_domain"}, {"score": 0.011957272857939173, "phrase": "domain_analysis"}, {"score": 0.00481495049065317, "phrase": "customer_relationship_domain"}, {"score": 0.004795585480947173, "phrase": "customer_relationship_management"}, {"score": 0.004718897469501381, "phrase": "important_strategy"}, {"score": 0.004634081523034475, "phrase": "profitable_and_stable_relationships"}, {"score": 0.00454162017482808, "phrase": "peculiar_characteristics"}, {"score": 0.004514241562580097, "phrase": "crm_strategy"}, {"score": 0.00445997627516653, "phrase": "specific_market_sector"}, {"score": 0.004424160689087029, "phrase": "multiple_units_cooperation"}, {"score": 0.0043533862892678864, "phrase": "huge_amount"}, {"score": 0.004275111704427226, "phrase": "software_solutions"}, {"score": 0.00419823857480455, "phrase": "human_and_machine_activities"}, {"score": 0.0040978781692373005, "phrase": "efficient_crm_strategy"}, {"score": 0.004073163656814149, "phrase": "software_houses"}, {"score": 0.004056769841308405, "phrase": "ict_solutions"}, {"score": 0.004016072233242585, "phrase": "great_advantage"}, {"score": 0.003991849119009803, "phrase": "common_semantic_model"}, {"score": 0.00395977784890438, "phrase": "main_contribution"}, {"score": 0.0037879192300155043, "phrase": "small_and_medium_sized_enterprises"}, {"score": 0.0037727044636143717, "phrase": "sme"}, {"score": 0.003601628511550962, "phrase": "involved_actors"}, {"score": 0.0034942655717364276, "phrase": "sme_and_ict_companies"}, {"score": 0.003396939748038562, "phrase": "basic_concepts"}, {"score": 0.0032890142331946275, "phrase": "well-known_dolce_foundational_ontology"}, {"score": 0.0032235507065208517, "phrase": "descriptions"}, {"score": 0.0031780859997873803, "phrase": "information_objects"}, {"score": 0.0031463102936277036, "phrase": "plans"}, {"score": 0.0029434299787644445, "phrase": "lower_core"}, {"score": 0.002872979681637667, "phrase": "content_requirements"}, {"score": 0.0025709963712568706, "phrase": "software_tools"}, {"score": 0.0025297921720201246, "phrase": "software_applications"}, {"score": 0.002489246685861249, "phrase": "five_modules"}, {"score": 0.002357131515622894, "phrase": "upper_core"}, {"score": 0.0023381630439887184, "phrase": "five_o-cream_modules"}, {"score": 0.002174155795026218, "phrase": "crm-related_tools"}, {"score": 0.0021392979397427984, "phrase": "formal_representations"}, {"score": 0.0021220787047953093, "phrase": "ontology-based_ir_systems"}, {"score": 0.0021049977753042253, "phrase": "semantic_search_engines_application_field"}], "paper_keywords": ["Customer relationship management", " CRM", " customer relationships", " business knowledge", " business activities", " software"], "paper_abstract": "Customer Relationship Management (CRM) has emerged as an important strategy that companies should implement in order to build profitable and stable relationships with their customer. The domain of CRM has peculiar characteristics: a CRM strategy is largely independent from the specific market sector, it requires multiple units cooperation, it implies the management of a huge amount of knowledge, it is fruitfully supported by software solutions, and finally it implies the integration of human and machine activities. These characteristics suggest that both companies aiming at implementing an efficient CRM strategy, and software houses offering ICT solutions supporting CRM would take great advantage from a common semantic model of CRM. The main contribution of this paper is thus the proposal of O-CREAM-v2, a core reference ontology for the CRM domain, specifically targeted to Small and Medium Sized Enterprises (SME). The design of O-CREAM-v2 has been based on requirements mainly elicited from a domain analysis, which considered the way the involved actors talk about CRM within their business, by analyzing documents and interviews with representatives of SME and ICT companies. Moreover, in order to guarantee accuracy in the definition of the basic concepts and to support interoperability within/between companies, O-CREAM-v2 has been developed within the framework provided by the well-known DOLCE foundational ontology, together with three DOLCE extensions, i.e. the ontology of Descriptions and Situations, the Ontology of Information Objects and the Ontology of Plans. O-CREAM-v2 is composed by two layers: an upper core, which models more general concepts and relations, and can be useful also in business domains other than CRM, and a lower core, representing concepts and relations specific to the CRM domain. The content requirements defined by the domain analysis pointed out that an ontology for the CRM domain has to account for both particulars (such as activities, offers, sales, etc.) and information about them (customer records, reports about sales, etc.). Moreover, since CRM is typically supported by software tools, O-CREAM-v2 includes the formal characterization of software applications. Thus, O-CREAM-v2 is structured into five modules: Relationships, Knowledge, Activities (all three spanning both the upper and the lower core), Software and Miscellaneous (both limited to the upper core). The five O-CREAM modules are described in details in the paper. The discussion is concluded by mentioning two possible exploitation perspectives for O-CREAM-v2, which could be the basis for building: (a) Web-based repositories supporting the mediation between supply and demand of CRM-related tools; (b) tools supporting users in building the formal representations of resources in ontology-based IR systems and in the semantic search engines application field.", "paper_title": "A core reference ontology for the customer relationship domain", "paper_id": "WOS:000300103400001"}