{"auto_keywords": [{"score": 0.049512022618515686, "phrase": "concept_drift"}, {"score": 0.00481495049065317, "phrase": "lazy_learning_algorithms"}, {"score": 0.004720269202737973, "phrase": "spam_filtering"}, {"score": 0.004664352260912174, "phrase": "great_amount"}, {"score": 0.004627441072541506, "phrase": "machine_learning_techniques"}, {"score": 0.004412000844879264, "phrase": "extended_period"}, {"score": 0.0037935066882208235, "phrase": "local_concept_drift"}, {"score": 0.003517458289610994, "phrase": "spam_filters"}, {"score": 0.003313741359811683, "phrase": "target_concept"}, {"score": 0.0031845067058084583, "phrase": "direct_knowledge"}, {"score": 0.0031467250930224126, "phrase": "underlying_shift"}, {"score": 0.0030119758165837625, "phrase": "previously_successful_instance-based_reasoning_e-mail_filtering_model"}, {"score": 0.0028715299874549245, "phrase": "spam_domain"}, {"score": 0.0026518169452004465, "phrase": "current_situation"}, {"score": 0.0026203386550421558, "phrase": "enhanced_system"}, {"score": 0.0024981087707313656, "phrase": "cost-sensitive_framework"}, {"score": 0.002316105585203396, "phrase": "instance-based_reasoning_systems"}, {"score": 0.002225691463551672, "phrase": "dynamic_problems"}, {"score": 0.0021559025985688255, "phrase": "anti-spam_filtering_domain"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["IBR system", " concept drift", " anti-spam filtering", " model evaluation"], "paper_abstract": "A great amount of machine learning techniques have been applied to problems where data is collected over an extended period of time. However, the disadvantage with many real-world applications is that the distribution underlying the data is likely to change over time. In these situations, a problem that many global eager learners face is their inability to adapt to local concept drift. Concept drift in spam is particularly difficult as the spammers actively change the nature of their messages to elude spam filters. Algorithms that track concept drift must be able to identify a change in the target concept (spam or legitimate e-mails) without direct knowledge of the underlying shift in distribution. In this paper we show how a previously successful instance-based reasoning e-mail filtering model can be improved in order to better track concept drift in spam domain. Our proposal is based on the definition of two complementary techniques able to select both terms and e-mails representative of the current situation. The enhanced system is evaluated against other well-known successful lazy learning approaches in two scenarios, all within a cost-sensitive framework. The results obtained from the experiments carried out are very promising and back up the idea that instance-based reasoning systems can offer a number of advantages tackling concept drift in dynamic problems, as in the case of the anti-spam filtering domain. (c) 2006 Elsevier Ltd. All rights reserved.", "paper_title": "Applying lazy learning algorithms to tackle concept drift in spam filtering", "paper_id": "WOS:000244110600004"}