{"auto_keywords": [{"score": 0.04895586541793087, "phrase": "jdl_data_fusion_model"}, {"score": 0.00481495049065317, "phrase": "middleware_framework"}, {"score": 0.004635477242873163, "phrase": "autonomous_system"}, {"score": 0.004548253531664032, "phrase": "dynamic_and_changing_environment"}, {"score": 0.004420472010542188, "phrase": "qualitative_knowledge"}, {"score": 0.0043786774510943625, "phrase": "object_structures"}, {"score": 0.004195418010131832, "phrase": "raw_or_preprocessed_sensor_data"}, {"score": 0.0038698476651328898, "phrase": "distributed_network"}, {"score": 0.0035864603175592854, "phrase": "deliberative_and_reactive_functionalities"}, {"score": 0.00332375606483146, "phrase": "dyknow"}, {"score": 0.0027610089418453614, "phrase": "autonomous_unmanned_aerial_vehicle"}, {"score": 0.0026452734009203764, "phrase": "real-time_corba"}, {"score": 0.0026077803487003, "phrase": "communications_infrastructure"}, {"score": 0.0024051153560799335, "phrase": "state_representations"}, {"score": 0.0022933216359142736, "phrase": "situation_awareness"}, {"score": 0.0022608057001451414, "phrase": "unmanned_aerial_vehicle"}, {"score": 0.0022287497627555895, "phrase": "mission_goals"}, {"score": 0.0021251363422701446, "phrase": "working_instantiation"}], "paper_keywords": [""], "paper_abstract": "Any autonomous system embedded in a dynamic and changing environment must be able to create qualitative knowledge and object structures representing aspects of its environment on the fly from raw or preprocessed sensor data in order to reason qualitatively about the environment and to supply such state information to other nodes in the distributed network in which it is embedded. These structures must be managed and made accessible to deliberative and reactive functionalities whose successful operation is dependent on being situationally aware of the changes in both the robotic agent's embedding and internal environments. DyKnow is a knowledge processing middleware framework which provides a set of functionalities for contextually creating, storing, accessing and processing such structures. The framework is implemented and has been deployed as part of a deliberative/reactive architecture for an autonomous unmanned aerial vehicle. The architecture itself is distributed and uses real-time CORBA as a communications infrastructure. We describe the system and show how it can be used to create more abstract entity and state representations of the world which can then be used for situation awareness by an unmanned aerial vehicle in achieving mission goals. We also show that the framework is a working instantiation of many aspects of the JDL data fusion model.", "paper_title": "A knowledge processing middleware framework and its relation to the JDL data fusion model", "paper_id": "WOS:000241929600002"}