{"auto_keywords": [{"score": 0.043320577578149506, "phrase": "phone_calls"}, {"score": 0.0394121994341566, "phrase": "proposed_interaction"}, {"score": 0.00954721429163019, "phrase": "intended_contact"}, {"score": 0.009393019915942831, "phrase": "smartphone_screen"}, {"score": 0.00481495049065317, "phrase": "non-touch_interaction_methods"}, {"score": 0.0045843245695654875, "phrase": "phone_dialing"}, {"score": 0.004224130367280183, "phrase": "existing_applications"}, {"score": 0.00357146811369898, "phrase": "iphone's_accelerometer"}, {"score": 0.0034847851398628546, "phrase": "video_camera_scanning"}, {"score": 0.003372460634140967, "phrase": "individual-selection_modes"}, {"score": 0.003277140908834426, "phrase": "call_candidate"}, {"score": 0.0031327496009959464, "phrase": "camera's_video_stream"}, {"score": 0.0026482660253173075, "phrase": "success_rate"}, {"score": 0.0025945450101602825, "phrase": "user_satisfaction"}, {"score": 0.0024099937116733227, "phrase": "effective_solution"}, {"score": 0.002256973121326987, "phrase": "iphone_screen"}, {"score": 0.0021049977753042253, "phrase": "mobile_applications"}], "paper_keywords": ["Smartphone", " Mobile interaction", " Touch interaction", " Accelerometer", " Dialing"], "paper_abstract": "This paper proposes various interaction methods for smartphones that allow users to call an intended contact without touching the smartphone screen. Existing applications allow users to answer phone calls without touching the screen-by shaking the phone, for example-but do not allow users to make phone calls. The proposed interaction allows users to select and call an intended contact by utilizing the iPhone's accelerometer. The interaction also involves video camera scanning for commands to switch between group-selection and individual-selection modes to facilitate the selection of the call candidate. Furthermore, the proposed interaction secures transparency by displaying the camera's video stream on the smartphone screen. In order to evaluate the efficacy of the interaction, an application using the interaction was developed, and two simple experiments were conducted, in which participants were asked to make phone calls using the application. The success rate was 98 %, and user satisfaction with the proposed interaction was approximately 90 %. Therefore, the results showed that the proposed interaction could be an effective solution to allow users to make phone calls in situations where they cannot physically touch the iPhone screen. Furthermore, this solution could be used in many fields that need interactions with users in mobile applications.", "paper_title": "Picture browsing non-touch interaction methods for smartphones using an accelerometer and camera with a focus on phone dialing", "paper_id": "WOS:000340550300031"}