{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "recognition_with_hypergraph_analysis"}, {"score": 0.004555371402128666, "phrase": "e._g."}, {"score": 0.0044870272550540415, "phrase": "computer_aided_design"}, {"score": 0.00418134346679498, "phrase": "multiple_views"}, {"score": 0.0038379074449947067, "phrase": "hypergraph_analysis_approach"}, {"score": 0.003469676666252421, "phrase": "multiple_hypergraphs"}, {"score": 0.002922705896608178, "phrase": "multiple_vertices"}, {"score": 0.002437012847684331, "phrase": "higher_order_relationship"}, {"score": 0.0022365262201954643, "phrase": "model_dataset"}, {"score": 0.0021049977753042253, "phrase": "proposed_method"}], "paper_keywords": ["3-D object recognition", " 3-D object retrieval", " hypergraph learning", " view-based"], "paper_abstract": "View-based 3-D object retrieval and recognition has become popular in practice, e. g., in computer aided design. It is difficult to precisely estimate the distance between two objects represented by multiple views. Thus, current view-based 3-D object retrieval and recognition methods may not perform well. In this paper, we propose a hypergraph analysis approach to address this problem by avoiding the estimation of the distance between objects. In particular, we construct multiple hypergraphs for a set of 3-D objects based on their 2-D views. In these hypergraphs, each vertex is an object, and each edge is a cluster of views. Therefore, an edge connects multiple vertices. We define the weight of each edge based on the similarities between any two views within the cluster. Retrieval and recognition are performed based on the hypergraphs. Therefore, our method can explore the higher order relationship among objects and does not use the distance between objects. We conduct experiments on the National Taiwan University 3-D model dataset and the ETH 3-D object collection. Experimental results demonstrate the effectiveness of the proposed method by comparing with the state-of-the-art methods.", "paper_title": "3-D Object Retrieval and Recognition With Hypergraph Analysis", "paper_id": "WOS:000307896800038"}