{"auto_keywords": [{"score": 0.02246846748295755, "phrase": "elsevier"}, {"score": 0.00481495049065317, "phrase": "healthfinland-a"}, {"score": 0.004615202066192795, "phrase": "health_information"}, {"score": 0.004447201233380302, "phrase": "up-to-date_and_individually_relevant_health_information"}, {"score": 0.0034299649219748513, "phrase": "citizens_point"}, {"score": 0.0032527939106509946, "phrase": "e._g._differences"}, {"score": 0.0032184697893776052, "phrase": "layman's_vocabularies"}, {"score": 0.0031676593724896075, "phrase": "medical_terminology"}, {"score": 0.0028944757265206332, "phrase": "national_scale_semantic_publishing_system"}, {"score": 0.002879158342988017, "phrase": "healthfinland"}, {"score": 0.0027594936602962075, "phrase": "centralized_content_infrastructure"}, {"score": 0.0027303606813078255, "phrase": "health_ontologies"}, {"score": 0.0022916428586256723, "phrase": "intuitive_and_health_promoting_end-user_perspectives"}], "paper_keywords": ["Health information", " Semantic portal", " Metadata", " Faceted search", " Content aggregation", " Ontology service"], "paper_abstract": "Providing citizens with reliable, up-to-date and individually relevant health information on the Web is done by governmental, non-governmental, business and other organizations. Currently the information is published with little co-ordination and co-operation between the publishers. For publishers, this means duplicated work and costs due to publishing same information twice on many websites. Also maintaining links between websites requires work. From the citizens point of view, finding content is difficult due to e. g. differences in layman's vocabularies compared to medical terminology and difficulties in aggregating information from several sites. To solve these problems, we present a national scale semantic publishing system HEALTHFINLAND which consists of (1) a centralized content infrastructure of health ontologies and services with tools, (2) a distributed semantic content creation channel based on several health organizations, and (3) an intelligent semantic portal aggregating and presenting the contents from intuitive and health promoting end-user perspectives for human users as well as for other websites and portals. (C) 2009 Elsevier B. V. All rights reserved.", "paper_title": "HealthFinland-A national semantic publishing network and portal for health information", "paper_id": "WOS:000274302100004"}