{"auto_keywords": [{"score": 0.04971075098097412, "phrase": "destination_prediction"}, {"score": 0.010612387000973441, "phrase": "data_sparsity_problem"}, {"score": 0.009136043972108765, "phrase": "historical_trajectories"}, {"score": 0.00468656988857138, "phrase": "essential_task"}, {"score": 0.004405779372462873, "phrase": "common_approach"}, {"score": 0.00398478333092707, "phrase": "extra_information"}, {"score": 0.00393886140366453, "phrase": "road_network"}, {"score": 0.0039085400187964196, "phrase": "proprietary_travel_planner"}, {"score": 0.003310047704590791, "phrase": "\"data_sparsity_problem"}, {"score": 0.0032341432727280707, "phrase": "available_historical_trajectories"}, {"score": 0.0031356295480964927, "phrase": "possible_query_trajectories"}, {"score": 0.0030401074516310184, "phrase": "query_trajectories"}, {"score": 0.002993439939273828, "phrase": "predicted_destinations"}, {"score": 0.0029361086955646625, "phrase": "novel_method"}, {"score": 0.002624533657819515, "phrase": "\"synthesised\"_trajectories"}, {"score": 0.002554406040896888, "phrase": "historical_trajectory_dataset"}, {"score": 0.002476546030310661, "phrase": "real_datasets"}, {"score": 0.0023099082804523044, "phrase": "running_time"}, {"score": 0.002283243905993669, "phrase": "subsyn-training_algorithm"}, {"score": 0.0022308329460335985, "phrase": "large_set"}, {"score": 0.0021796224306652326, "phrase": "subsyn-prediction_algorithm"}, {"score": 0.0021049977753042253, "phrase": "baseline_prediction_algorithm"}], "paper_keywords": ["Trajectory mining", " Destination prediction", " Markov model", " Bayes' rule"], "paper_abstract": "Destination prediction is an essential task for many emerging location-based applications such as recommending sightseeing places and targeted advertising according to destinations. A common approach to destination prediction is to derive the probability of a location being the destination based on historical trajectories. However, almost all the existing techniques use various kinds of extra information such as road network, proprietary travel planner, statistics requested from government, and personal driving habits. Such extra information, in most circumstances, is unavailable or very costly to obtain. Thereby we approach the task of destination prediction by using only historical trajectory dataset. However, this approach encounters the \"data sparsity problem\", i.e., the available historical trajectories are far from enough to cover all possible query trajectories, which considerably limits the number of query trajectories that can obtain predicted destinations. We propose a novel method named Sub-Trajectory Synthesis (SubSyn) to address the data sparsity problem. SubSyn first decomposes historical trajectories into sub-trajectories comprising two adjacent locations, and then connects the sub-trajectories into \"synthesised\" trajectories. This process effectively expands the historical trajectory dataset to contain much more trajectories. Experiments based on real datasets show that SubSyn can predict destinations for up to ten times more query trajectories than a baseline prediction algorithm. Furthermore, the running time of the SubSyn-training algorithm is almost negligible for a large set of 1.9 million trajectories, and the SubSyn-prediction algorithm runs over two orders of magnitude faster than the baseline prediction algorithm constantly.", "paper_title": "Solving the data sparsity problem in destination prediction", "paper_id": "WOS:000351381200003"}