{"auto_keywords": [{"score": 0.03785003711688602, "phrase": "lpv"}, {"score": 0.0077840287697411225, "phrase": "nfv"}, {"score": 0.004719816332271661, "phrase": "human_immunodeficiency_virus_type"}, {"score": 0.004535124351828787, "phrase": "major_targets"}, {"score": 0.0044990584725586764, "phrase": "anti-aids_drug_discovery"}, {"score": 0.004445494322321316, "phrase": "circulating_recombinant_form"}, {"score": 0.004322995535647644, "phrase": "ae"}, {"score": 0.0036993855514735746, "phrase": "computer_simulation"}, {"score": 0.0036262124965265015, "phrase": "drugs_lopinavir"}, {"score": 0.003178147973814818, "phrase": "active_site_results"}, {"score": 0.0031402604946939743, "phrase": "conformational_change"}, {"score": 0.0027631038845413393, "phrase": "binding_cavity"}, {"score": 0.002560907803820395, "phrase": "interactive_mechanisms"}, {"score": 0.0024117603727471654, "phrase": "dodecahydroisoquinoline_ring"}, {"score": 0.002199725773957207, "phrase": "binding_affinity"}, {"score": 0.0021049977753042253, "phrase": "promising_drug_design"}], "paper_keywords": ["CRF01_AE HIV-1 protease", " Inhibitor", " Resistance", " Mutation", " Molecular dynamics simulation"], "paper_abstract": "Human immunodeficiency virus type 1 protease (HIV-1 PR) is one of the major targets of anti-AIDS drug discovery. The circulating recombinant form 01 A/E (CRF01_AE, abbreviated AE) subtype is one of the most common HIV-1 subtypes, which is infecting more humans and is expanding rapidly throughout the world. It is, therefore, necessary to develop inhibitors against subtype AE HIV-1 PR. In this work, we have performed computer simulation of subtype AE HIV-1 PR with the drugs lopinavir (LPV) and nelfinavir (NFV), and examined the mechanism of resistance of the V82F mutation of this protease against LPV both structurally and energetically. The V82F mutation at the active site results in a conformational change of 79's loop region and displacement of LPV from its proper binding site, and these changes lead to rotation of the side-chains of residues D25 and I50'. Consequently, the conformation of the binding cavity is deformed asymmetrically and some interactions between PR and LPV are destroyed. Additionally, by comparing the interactive mechanisms of LPV and NFV with HIV-1 PR we discovered that the presence of a dodecahydroisoquinoline ring at the P1' subsite, a [2-(2,6-dimethylphenoxy)acetyl]amino group at the P2' subsite, and an N2 atom at the P2 subsite could improve the binding affinity of the drug with AE HIV-1 PR. These findings are helpful for promising drug design.", "paper_title": "Drug-resistant molecular mechanism of CRF01_AE HIV-1 protease due to V82F mutation", "paper_id": "WOS:000265041700001"}