{"auto_keywords": [{"score": 0.04941343102175344, "phrase": "bisimulation_equivalence"}, {"score": 0.013035725894988031, "phrase": "infinite_set"}, {"score": 0.010078359048758777, "phrase": "action_predicates"}, {"score": 0.00481495049065317, "phrase": "equational_theory"}, {"score": 0.004649302313891199, "phrase": "process_algebra"}, {"score": 0.004616859702338596, "phrase": "bccsp"}, {"score": 0.004489327204473076, "phrase": "priority_operator"}, {"score": 0.004426882270402403, "phrase": "baeten"}, {"score": 0.00436530211426514, "phrase": "bergstra"}, {"score": 0.004304575824784735, "phrase": "klop"}, {"score": 0.0033682492486884364, "phrase": "arbitrary_collection"}, {"score": 0.0033213460816510685, "phrase": "auxiliary_operators"}, {"score": 0.0022739766507258105, "phrase": "sufficient_conditions"}, {"score": 0.002226592967032469, "phrase": "priority_structure"}], "paper_keywords": [""], "paper_abstract": "This paper studies the equational theory of bisimulation equivalence over the process algebra BCCSP extended with the priority operator of Baeten, Bergstra and Klop. We prove that, in the presence of an infinite set of actions, bisimulation equivalence has no finite, sound, ground-complete equational axiomatisation over that language. This negative result applies even if the syntax is extended with an arbitrary collection of auxiliary operators, and motivates the study of axiomatisations using equations with action predicates as conditions. In the presence of an infinite set of actions, it is shown that, in general, bisimulation equivalence has no finite, sound, ground-complete axiomatisation consisting of equations with action predicates as conditions over the language studied in this paper. Finally, sufficient conditions on the priority structure over actions are identified that lead to a finite, ground-complete axiomatisation of bisimulation equivalence using equations with action predicates as conditions.", "paper_title": "On the axiomatisability of priority", "paper_id": "WOS:000255227600002"}