{"auto_keywords": [{"score": 0.042098477124909196, "phrase": "sequel"}, {"score": 0.00481495049065317, "phrase": "genome_assemblies"}, {"score": 0.004654210559456924, "phrase": "next-generation_sequencing"}, {"score": 0.004348580182733617, "phrase": "substantial_number"}, {"score": 0.004109212945115815, "phrase": "assembly_process"}, {"score": 0.003627800727103479, "phrase": "assembled_contigs"}, {"score": 0.0034279721355412285, "phrase": "positional_de_bruijn_graph"}, {"score": 0.0031845067058084613, "phrase": "approximate_positions"}, {"score": 0.002941558420246247, "phrase": "small_insertions"}, {"score": 0.0028271058251633815, "phrase": "standard_multi-cell_escherichia_coli_data"}, {"score": 0.0026864540069792275, "phrase": "substitution_errors"}, {"score": 0.0025239898026543964, "phrase": "single-cell_assembly"}, {"score": 0.002202742267484358, "phrase": "first_bacterial_genome"}, {"score": 0.0021655683497137234, "phrase": "comprehensive_single-cell_genome_assembly"}], "paper_keywords": [""], "paper_abstract": "Motivation: Assemblies of next-generation sequencing (NGS) data, although accurate, still contain a substantial number of errors that need to be corrected after the assembly process. We develop SEQuel, a tool that corrects errors (i.e. insertions, deletions and substitution errors) in the assembled contigs. Fundamental to the algorithm behind SEQuel is the positional de Bruijn graph, a graph structure that models k-mers within reads while incorporating the approximate positions of reads into the model. Results: SEQuel reduced the number of small insertions and deletions in the assemblies of standard multi-cell Escherichia coli data by almost half, and corrected between 30% and 94% of the substitution errors. Further, we show SEQuel is imperative to improving single-cell assembly, which is inherently more challenging due to higher error rates and non-uniform coverage; over half of the small indels, and substitution errors in the single-cell assemblies were corrected. We apply SEQuel to the recently assembled Deltaproteobacterium SAR324 genome, which is the first bacterial genome with a comprehensive single-cell genome assembly, and make over 800 changes (insertions, deletions and substitutions) to refine this assembly.", "paper_title": "SEQuel: improving the accuracy of genome assemblies", "paper_id": "WOS:000305419800024"}