{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "physical_activities"}, {"score": 0.019589353517262636, "phrase": "smartfit"}, {"score": 0.008659806159212361, "phrase": "step_count"}, {"score": 0.004688321299229397, "phrase": "relatively_few_people"}, {"score": 0.004626255242038005, "phrase": "regular_exercise"}, {"score": 0.00446471538346719, "phrase": "numerous_mobile_applications"}, {"score": 0.004425215632459868, "phrase": "specialized_devices"}, {"score": 0.0036390887584943723, "phrase": "activity_duration"}, {"score": 0.002900426826591769, "phrase": "different_activeness_levels"}, {"score": 0.002874726518572154, "phrase": "gamification_techniques"}, {"score": 0.0024490834773668153, "phrase": "longer_period"}, {"score": 0.0021049977753042253, "phrase": "recommended_level"}], "paper_keywords": ["Feedback", " Gamification", " Physical Activities", " Step Count"], "paper_abstract": "Research has found that relatively few people engage in regular exercise or other physical activities. Despite the availability of numerous mobile applications and specialized devices for self-tracking, people mostly lack the motivation for performing physical activities. In this article we present SmartFit, a mobile application that uses step count for promoting the physical activities in adults. This article points out that while considering walk, activity duration is not sufficient for determining users activeness state. Step count is another factor that should be taken into account. For this we propose an approach for converting the steps into duration for which activity has been performed. This duration is then used in Smartfit for categorizing user into different activeness levels. Gamification techniques have been incorporated in SmartFit as they are found to serve the purpose of motivating and encouraging the user. Gamification is used for awarding/deducting points to user in order to keep them engaged for longer period. Furthermore feedback is also provided to users depending upon their goal and achieved progress. The objective is to facilitate and motivate the user and then keep them engaged in carrying out the recommended level of physical activities.", "paper_title": "SmartFit: A Step Count Based Mobile Application for Engagement in Physical Activities", "paper_id": "WOS:000360696500036"}