{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "wireless_sensor_networks"}, {"score": 0.01602293067301207, "phrase": "sensor_network"}, {"score": 0.004267004541988167, "phrase": "significant_interest"}, {"score": 0.0041051328120736575, "phrase": "sensor_mobility"}, {"score": 0.0038364365168131586, "phrase": "deployment_field"}, {"score": 0.003637669525737665, "phrase": "sensor_networks"}, {"score": 0.00346589179059467, "phrase": "blanket_coverage"}, {"score": 0.00320770578058916, "phrase": "barrier_coverage"}, {"score": 0.003100865267124765, "phrase": "intrusion_path"}, {"score": 0.002968695624366393, "phrase": "event_coverage"}, {"score": 0.002579847272930948, "phrase": "mobility_algorithms"}, {"score": 0.0024107449502335583, "phrase": "key_metrics"}, {"score": 0.0022094759531152072, "phrase": "open_issues"}, {"score": 0.0021049977753042253, "phrase": "uncontrolled_sensor_mobility"}], "paper_keywords": [""], "paper_abstract": "Wireless Sensor Networks (WSNs) are poised to significantly enhance a number of missions in the military, civilian, and industrial arenas. Recently, there has been a significant interest in the design of algorithms for exploiting sensor mobility. The motivation of these designs is mainly to enhance coverage in the deployment field. Broadly speaking, there are three standard notions of coverage in sensor networks: blanket, barrier, and event coverage. Blanket coverage refers to the case where every point in the sensor network needs to be covered. Barrier coverage refers to the case where every intrusion path in the sensor network needs to be covered. Event coverage refers to the case where events in the sensor network need to be covered as and when they occur. In this chapter, we present a survey of mobility algorithms for enhancing blanket, barrier, and event coverage in wireless sensor networks. The key metrics emphasized for evaluation of these algorithms are: quality of coverage, movement distance minimization, communication overhead, and energy constraints. We also highlight open issues in mobility in wireless sensor networks, including some discussions on uncontrolled sensor mobility.", "paper_title": "Mobility in Wireless Sensor Networks", "paper_id": "WOS:000323088300004"}