{"auto_keywords": [{"score": 0.004774115617883476, "phrase": "large-scale_network_measurements"}, {"score": 0.003557924423642353, "phrase": "overall_picture"}, {"score": 0.0034977560416755726, "phrase": "multiple_sources"}, {"score": 0.0032810180076973806, "phrase": "privacy_legislation"}, {"score": 0.0032255172568437965, "phrase": "business_secrets"}, {"score": 0.0031440159350875057, "phrase": "global_internet_health_problems"}, {"score": 0.0030515222178491923, "phrase": "data_sharing"}, {"score": 0.002886885861509621, "phrase": "third_parties"}, {"score": 0.002850168497994985, "phrase": "data_anonymization"}, {"score": 0.002583713580625699, "phrase": "shared_data"}, {"score": 0.002362192695471035, "phrase": "service_providers"}, {"score": 0.002332133125576037, "phrase": "service_provider"}, {"score": 0.0021412594173592513, "phrase": "wide_range"}, {"score": 0.002123051344001408, "phrase": "valuable_operations"}, {"score": 0.0021049977753042253, "phrase": "internet_data"}], "paper_keywords": ["secure distributed data-mining", " secure distributed summation", " network measurement", " network management"], "paper_abstract": "The rapid growth of the Internet over the last decade has been startling. However, efforts to track its growth have often fallen afoul of bad data - for instance, how much traffic does the Internet now carry? The problem is not that the data is technically hard to obtain, or that it does not exist, but rather that the data is not shared. Obtaining an overall picture requires data from multiple sources, few of whom are open to sharing such data, either because it violates privacy legislation, or exposes business secrets. Likewise, detection of global Internet health problems is hampered by a lack of data sharing. The approaches used so far in the Internet, e.g. trusted third parties, or data anonymization, have been only partially successful, and are not widely adopted. The paper presents a method for performing computations on shared data without any participants revealing their secret data. For example, one can compute the sum of traffic over a set of service providers without any service provider learning the traffic of another. The method is simple, scalable, and flexible enough to perform a wide range of valuable operations on Internet data.", "paper_title": "Secure distributed data-mining and its application to large-scale network measurements", "paper_id": "WOS:000235070100001"}