{"auto_keywords": [{"score": 0.04902194563396072, "phrase": "semantic_similarity"}, {"score": 0.008496290932156838, "phrase": "search_patterns"}, {"score": 0.00481495049065317, "phrase": "historical_google_search_patterns"}, {"score": 0.004579005794486596, "phrase": "short_text_expressions"}, {"score": 0.00423465514675998, "phrase": "important_challenge"}, {"score": 0.0041642891310893, "phrase": "information_integration_field"}, {"score": 0.0039822874870125095, "phrase": "textual_semantic_similarity_measurement"}, {"score": 0.0037658881407605445, "phrase": "synonym_dictionaries"}, {"score": 0.003202361402737197, "phrase": "google_search_engine"}, {"score": 0.0022013916728990564, "phrase": "human_judgment"}, {"score": 0.002164738347530834, "phrase": "general_purpose_benchmark_datasets"}, {"score": 0.0021049977753042253, "phrase": "existing_methods"}], "paper_keywords": ["Information integration", " Web Intelligence", " Semantic similarity"], "paper_abstract": "Computing the semantic similarity between terms (or short text expressions) that have the same meaning but which are not lexicographically similar is an important challenge in the information integration field. The problem is that techniques for textual semantic similarity measurement often fail to deal with words not covered by synonym dictionaries. In this paper, we try to solve this problem by determining the semantic similarity for terms using the knowledge inherent in the search history logs from the Google search engine. To do this, we have designed and evaluated four algorithmic methods for measuring the semantic similarity between terms using their associated history search patterns. These algorithmic methods are: a) frequent co-occurrence of terms in search patterns, b) computation of the relationship between search patterns, c) outlier coincidence on search patterns, and d) forecasting comparisons. We have shown experimentally that some of these methods correlate well with respect to human judgment when evaluating general purpose benchmark datasets, and significantly outperform existing methods when evaluating datasets containing terms that do not usually appear in dictionaries.", "paper_title": "Semantic similarity measurement using historical google search patterns", "paper_id": "WOS:000320047700006"}