{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "ambient_intelligence_systems"}, {"score": 0.03977329961495616, "phrase": "provenance_model"}, {"score": 0.013317561256338288, "phrase": "context_data"}, {"score": 0.00445293569103488, "phrase": "context_information"}, {"score": 0.004118026552723285, "phrase": "data_management"}, {"score": 0.00400459716272594, "phrase": "peculiar_features"}, {"score": 0.00389427992231721, "phrase": "specific_support"}, {"score": 0.003367611042980526, "phrase": "initial_investigation"}, {"score": 0.003311604528903634, "phrase": "challenging_research_issue"}, {"score": 0.003011328068286321, "phrase": "complex_derivation_processes"}, {"score": 0.002977835845437357, "phrase": "integrity_verification"}, {"score": 0.0026626797255348287, "phrase": "temporal_aspects"}, {"score": 0.0023941575109692336, "phrase": "increased_dependability"}, {"score": 0.002354302193867031, "phrase": "sensor-based_smart-home_infrastructure"}, {"score": 0.0022137465420508785, "phrase": "computational_overhead"}, {"score": 0.0021049977753042253, "phrase": "mobile_devices"}], "paper_keywords": [""], "paper_abstract": "Ambient intelligence systems would benefit from the possibility of assessing quality and reliability of context information based on its derivation history, named provenance. While various provenance frameworks have been proposed in data management, context data have some peculiar features that claim for a specific support. However, no provenance model specifically targeted to context data has been proposed till the time of writing. In this paper, we report an initial investigation of this challenging research issue by proposing a provenance model for data acquired and processed in ambient intelligence systems. Our model supports representation of complex derivation processes, integrity verification, and a shared ontology to facilitate interoperability. The model also deals with uncertainty and takes into account temporal aspects related to the quality of data. We experimentally show the impact of the provenance model in terms of increased dependability of a sensor-based smart-home infrastructure. We also conducted experiments to evaluate the communication and computational overhead introduced to support our provenance model, using sensors and mobile devices currently available on the market.", "paper_title": "Context provenance to enhance the dependability of ambient intelligence systems", "paper_id": "WOS:000309242900003"}