{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "vaccination_strategy"}, {"score": 0.04878908082713494, "phrase": "network_model"}, {"score": 0.015613917306866325, "phrase": "respiratory_syncytial_virus"}, {"score": 0.004590217765551337, "phrase": "age-structured_mathematical_model"}, {"score": 0.004129067429043414, "phrase": "real_data"}, {"score": 0.004100952337610039, "phrase": "hospitalized_children"}, {"score": 0.0040591367766929344, "phrase": "spanish_region"}, {"score": 0.004031501912487463, "phrase": "valencia"}, {"score": 0.003922794571908569, "phrase": "seasonal_parameters"}, {"score": 0.0037395458116642306, "phrase": "complete_stochastic_network_model"}, {"score": 0.003688773272422118, "phrase": "seasonal_evolution"}, {"score": 0.003528458369404996, "phrase": "susceptible_individual"}, {"score": 0.0034450303951025704, "phrase": "random_encounter"}, {"score": 0.003409880074659807, "phrase": "infected_individual"}, {"score": 0.003375087185182269, "phrase": "social_network"}, {"score": 0.003306559295382181, "phrase": "complete_graph"}, {"score": 0.003152006152091526, "phrase": "season_dependent_probability"}, {"score": 0.003066945490483524, "phrase": "healthy_susceptible_individual"}, {"score": 0.002815604242104671, "phrase": "sharper_peaks"}, {"score": 0.0021932609696277937, "phrase": "continuous_model"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Respiratory syncytial virus", " Network mathematical model", " Vaccination strategy", " Cost estimation"], "paper_abstract": "In this paper an age-structured mathematical model for respiratory syncytial virus (RSV) is proposed where children younger than one year old, who are the most affected by this illness, are specially considered. Real data of hospitalized children in the Spanish region of Valencia are used in order to determine some seasonal parameters of the model. Once the parameters are determined, we propose a complete stochastic network model to study the seasonal evolution of the respiratory syncytial virus (RSV) epidemics. In this model every susceptible individual can acquire the disease after a random encounter with any infected individual in the social network. The edges of a complete graph connecting every pair of individuals in the network simulate these encounters and a season dependent probability, beta(t), determines whether the healthy susceptible individual becomes infected or not. We show that the prediction of this model is compatible with the above mentioned age-structured model based upon differential equations, but sharper peaks are obtained in the case of the network. Then, on the network model, we propose the vaccination of children at 2 months, 4 months and 1 year old, and we study the cost of this vaccination strategy, which is emerging as the most plausible one to be applied when the vaccine hits the market. It is worth to note that this vaccination strategy is simulated in the network model because to implement it in the continuous model is very difficult and increases its complexity. (C) 2010 Elsevier Ltd. All rights reserved.", "paper_title": "Cost analysis of a vaccination strategy for respiratory syncytial virus (RSV) in a network model", "paper_id": "WOS:000280933700012"}