{"auto_keywords": [{"score": 0.049754507386661914, "phrase": "china"}, {"score": 0.0232262189736698, "phrase": "digital_resources"}, {"score": 0.0065706516980856425, "phrase": "information_centres"}, {"score": 0.004606759374526927, "phrase": "first-hand_data"}, {"score": 0.004560002169647084, "phrase": "main_challenges"}, {"score": 0.004347972379250724, "phrase": "-_the_data"}, {"score": 0.004231249907249981, "phrase": "e-mail_questionnaire"}, {"score": 0.003873027670786261, "phrase": "rich_digital_collections"}, {"score": 0.0038467574225322086, "phrase": "long-term_experience"}, {"score": 0.0036928221419965253, "phrase": "long-term_preservation"}, {"score": 0.003403122817578447, "phrase": "relevant_training"}, {"score": 0.0033229756875116597, "phrase": "digital_preservation"}, {"score": 0.003255777265493076, "phrase": "government_departments"}, {"score": 0.0031682817605340028, "phrase": "uniform_guidelines"}, {"score": 0.0030831303297783877, "phrase": "relevant_international_conferences"}, {"score": 0.0029596622424171264, "phrase": "working_group"}, {"score": 0.0027931421106359875, "phrase": "chinese_digital_resources"}, {"score": 0.0026995881394357504, "phrase": "chinese_administration_systems"}, {"score": 0.002547663224855668, "phrase": "small_sample"}, {"score": 0.0025217522723800204, "phrase": "numerous_document_collection_organisations"}, {"score": 0.0023717148226629105, "phrase": "international_colleagues"}, {"score": 0.002155831935645973, "phrase": "new_vision"}, {"score": 0.0021411841686226297, "phrase": "international_peers"}, {"score": 0.0021049977753042253, "phrase": "digital_documentary_heritage"}], "paper_keywords": ["digital storage", " China", " standardization"], "paper_abstract": "Purpose - To obtain first-hand data on the main challenges in preserving digital resources in libraries, archives and information centres in China. Design/methodology/approach - The data in this paper have been acquired by e-mail questionnaire. The conclusions are based on feedback from 57 respondents, distributed in 14 provinces in China, who work in libraries, archives and information centres with rich digital collections and long-term experience in preserving digital resources. Findings - The authors consider that the long-term preservation of digital resources in China faces two critical difficulties: firstly, the pressure on preserving digital resources has not been fully recognised and so the relevant training in the management and operation of digital preservation is absent; secondly, government departments attach little importance to this field and lack uniform guidelines. Therefore, the paper suggests that relevant international conferences or workshops should be held in China, and that a working group led by the National Development and Reform Commission of China should be set up to plan the construction, sharing and maintenance of Chinese digital resources. Research limitations/implications - This research is limited to Chinese administration systems. Although the data in this paper are authentic and representative, nevertheless it is a small sample of the numerous document collection organisations in the country. Practical implications - The data and analysis in this paper should greatly help international colleagues understand the status regarding the preservation of digital resources in China. Originality/value - This research is the first of its kind undertaken in China and will provide a new vision for international peers and organisations involved in digital documentary heritage around the world.", "paper_title": "Status of the preservation of digital resources in China: results of a survey", "paper_id": "WOS:000244573400003"}