{"auto_keywords": [{"score": 0.032546677594819384, "phrase": "sparsity_conditions"}, {"score": 0.00481495049065317, "phrase": "collaborative_filtering_algorithms"}, {"score": 0.004746558955503364, "phrase": "current_techniques"}, {"score": 0.00449859196755507, "phrase": "collaborative_filtering"}, {"score": 0.004403054828362479, "phrase": "personalized_recommendations"}, {"score": 0.004278807087784626, "phrase": "numerous_algorithms"}, {"score": 0.004172957742905294, "phrase": "different_strategies"}, {"score": 0.004040688646993609, "phrase": "universally_accepted_way"}, {"score": 0.00398325070540449, "phrase": "collaborative_filtering_algorithm"}, {"score": 0.003815770872944475, "phrase": "different_techniques"}, {"score": 0.003306559295382181, "phrase": "good_items"}, {"score": 0.003111211706454155, "phrase": "user_profiles"}, {"score": 0.0030017207229983385, "phrase": "good_results"}, {"score": 0.0029802879302375986, "phrase": "svd-based_techniques"}, {"score": 0.0028446460307503343, "phrase": "new_approach"}, {"score": 0.002619571161767134, "phrase": "noticeably_better_results"}, {"score": 0.0024296194239886676, "phrase": "best_approaches"}, {"score": 0.0022941723937662927, "phrase": "traditional_user-based_algorithms"}, {"score": 0.0021049977753042253, "phrase": "large_amounts"}], "paper_keywords": ["Algorithms", " Performance", " Collaborative filtering", " recommender systems"], "paper_abstract": "The technique of collaborative filtering is especially successful in generating personalized recommendations. More than a decade of research has resulted in numerous algorithms, although no comparison of the different strategies has been made. In fact, a universally accepted way of evaluating a collaborative filtering algorithm does not exist yet. In this work, we compare different techniques found in the literature, and we study the characteristics of each one, highlighting their principal strengths and weaknesses. Several experiments have been performed, using the most popular metrics and algorithms. Moreover, two new metrics designed to measure the precision on good items have been proposed. The results have revealed the weaknesses of many algorithms in extracting information from user profiles especially under sparsity conditions. We have also confirmed the good results of SVD-based techniques already reported by other authors. As an alternative, we present a new approach based on the interpretation of the tendencies or differences between users and items. Despite its extraordinary simplicity, in our experiments, it obtained noticeably better results than more complex algorithms. In fact, in the cases analyzed, its results are at least equivalent to those of the best approaches studied. Under sparsity conditions, there is more than a 20% improvement in accuracy over the traditional user-based algorithms, while maintaining over 90% coverage. Moreover, it is much more efficient computationally than any other algorithm, making it especially adequate for large amounts of data.", "paper_title": "Comparison of Collaborative Filtering Algorithms: Limitations of Current Techniques and Proposals for Scalable, High-Performance Recommender Systems", "paper_id": "WOS:000288062500002"}