{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "self-organizing_incremental_associative_memory"}, {"score": 0.004561950666122737, "phrase": "important_issues"}, {"score": 0.004524220016675624, "phrase": "robotic_navigation"}, {"score": 0.004412881870378388, "phrase": "novel_robot_path-planning_approach"}, {"score": 0.0042864307215634756, "phrase": "self-organizing_incremental_neural_networks"}, {"score": 0.004163587877500036, "phrase": "proposed_method"}, {"score": 0.003737234606207431, "phrase": "common_patterns"}, {"score": 0.003630073540438812, "phrase": "online_manner"}, {"score": 0.003540661500026125, "phrase": "current_path"}, {"score": 0.0034967818541774844, "phrase": "associative_path-fragments"}, {"score": 0.0033824008297657494, "phrase": "reasoning_technique"}, {"score": 0.0030357976028714557, "phrase": "important_information"}, {"score": 0.0028760125558659907, "phrase": "resultant_number"}, {"score": 0.0024452510143564057, "phrase": "goal-oriented_navigation_problem"}, {"score": 0.002268769196700254, "phrase": "based_methods"}, {"score": 0.00224061675049049, "phrase": "running_time"}, {"score": 0.0021049977753042253, "phrase": "path-fragments_matches"}], "paper_keywords": ["neural networks", " associative memory", " path-planning", " reinforcement learning (RL)"], "paper_abstract": "Robot path-planning is one of the important issues in robotic navigation. This paper presents a novel robot path-planning approach based on the associative memory using Self-Organizing Incremental Neural Networks (SOINN). By the proposed method, an environment is first autonomously divided into a set of path-fragments by junctions. Each fragment is represented by a sequence of preliminarily generated common patterns (CPs). In an online manner, a robot regards the current path as the associative path-fragments, each connected by junctions. The reasoning technique is additionally proposed for decision making at each junction to speed up the exploration time. Distinct from other methods, our method does not ignore the important information about the regions between junctions (path-fragments). The resultant number of path-fragments is also less than other method. Evaluation is done via Webots physical 3D-simulated and real robot experiments, where only distance sensors are available. Results show that our method can represent the environment effectively; it enables the robot to solve the goal-oriented navigation problem in only one episode, which is actually less than that necessary for most of the Reinforcement Learning (RL) based methods. The running time is proved finite and scales well with the environment. The resultant number of path-fragments matches well to the environment.", "paper_title": "Reasoning on the Self-Organizing Incremental Associative Memory for Online Robot Path Planning", "paper_id": "WOS:000276759500021"}