{"auto_keywords": [{"score": 0.04951738916270167, "phrase": "web-based_nursing_documentation_system"}, {"score": 0.04226255901245674, "phrase": "nursing_process"}, {"score": 0.00481495049065317, "phrase": "user_acceptance"}, {"score": 0.004611013257082199, "phrase": "icnp_web-based_nursing_documentation_system"}, {"score": 0.004195418010131832, "phrase": "greek_translation"}, {"score": 0.003954837422946628, "phrase": "nursing_care"}, {"score": 0.003908396188878932, "phrase": "icnp_terminology"}, {"score": 0.003802135020791801, "phrase": "nursing_concepts"}, {"score": 0.0036553070575015344, "phrase": "computer_laboratory"}, {"score": 0.003584025547693836, "phrase": "user_interaction_satisfaction"}, {"score": 0.0033518704336033905, "phrase": "adequate_basic_computer_skills"}, {"score": 0.0032223742018434856, "phrase": "clinical_or_hospital_information_systems"}, {"score": 0.00314708280192844, "phrase": "nursing_vocabularies"}, {"score": 0.0029899137403982027, "phrase": "system's_usability"}, {"score": 0.00292003791296245, "phrase": "acceptance_level"}, {"score": 0.002494039334114861, "phrase": "documentation_system"}, {"score": 0.002455009746748708, "phrase": "icnp."}, {"score": 0.00241658945942583, "phrase": "subjective_satisfaction"}, {"score": 0.0022958180852458215, "phrase": "described_system"}, {"score": 0.002259883463607508, "phrase": "\"laboratory_conditions"}], "paper_keywords": ["nursing informatics", " terminology", " Internet", " user-computer interface", " health technology assessment"], "paper_abstract": "Objectives: The development of an ICNP web-based nursing documentation system, and its evaluation for its usability, and its user acceptance. Methods: A web-based nursing documentation system was designed and implemented by using the Greek translation of ICNP beta 2 version nursing terminology. The system integrates the steps of nursing process for providing and documenting nursing care, while ICNP terminology is used for the description of nursing concepts. The system was evaluated by nurses in a computer laboratory. We measured the user interaction satisfaction mainly by using questionnaires and scenarios. Results. The nurses who evaluated the system possessed adequate basic computer skills, but low-to-moderate experience in clinical or hospital information systems, and insufficient experience with nursing vocabularies, and especially ICNP. Overall, they were satisfied enough with the system's usability and usefulness, while the acceptance level increased as the level of their training in computers, nursing process and IN P was also increased. The integration and use in the system of predefined, or standardized, nursing concepts and care plans seems to increase the acceptance of the documentation system and also the ICNP. Conclusion: The subjective satisfaction and response of the users towards the system is specified. The described system was evaluated under \"laboratory conditions\" and revealed some of its strong and weak points and some of the factors that influenced its success and acceptance by its users.", "paper_title": "Measuring the user acceptance of a web-based nursing documentation system", "paper_id": "WOS:000234822900019"}