{"auto_keywords": [{"score": 0.04925367071541481, "phrase": "superior_propellants"}, {"score": 0.03293601710642665, "phrase": "ddnp"}, {"score": 0.0041170581247889654, "phrase": "bond_dissociation_enthalpies"}, {"score": 0.004028452405970376, "phrase": "molecular_surface_electrostatic_potentials"}, {"score": 0.0038906171474520756, "phrase": "trigger_bond"}, {"score": 0.0038401488612789963, "phrase": "thermolysis_process"}, {"score": 0.00367658459781873, "phrase": "electrostatic_potential_results"}, {"score": 0.0036288825833675127, "phrase": "electron-withdrawing_substituents"}, {"score": 0.003581797255879607, "phrase": "charge_imbalance"}, {"score": 0.0032546105164772995, "phrase": "ddnp_derivatives"}, {"score": 0.00321236577162671, "phrase": "impact_sensitivities"}, {"score": 0.0030092017034068666, "phrase": "solid_propellants"}, {"score": 0.0029443683459283955, "phrase": "theoretical_densities"}, {"score": 0.0027943943921568456, "phrase": "detonation_energies"}, {"score": 0.0023068049914566975, "phrase": "perfect_detonation_properties"}], "paper_keywords": ["2-Diazo-4,6-dinitrophenol (DDNP)", " Propellant", " Detonation property", " Sensitivity", " Specific impulse"], "paper_abstract": "In an attempt to find superior propellants, 2-diazo-4,6-dinitrophenol (DDNP) and its -NO2, -NH2, -CN, -NC, -ONO2, and -NF2 derivatives were studied at the B3LYP/6-311++G** level of density functional theory (DFT). Sensitivity was evaluated using bond dissociation enthalpies (BDEs) and molecular surface electrostatic potentials. The C-NO2 bond appears to be the trigger bond during the thermolysis process for these compounds, except for the -ONO2 and -NF2 derivatives. Electrostatic potential results show that electron-withdrawing substituents make the charge imbalance more anomalous, which may change the strength of the bond, especially the weakest trigger bond. Most of the DDNP derivatives have the impact sensitivities that are higher than that of DDNP, making them favorable for use as solid propellants in micro-rockets. The theoretical densities (rho), heats of formation (HOFs), detonation energies (Q), detonation pressures (P), and detonation velocities (D) of the compounds were estimated. The effects of various substituent groups on rho, HOF, Q, D, and P were investigated. Some derivatives exhibit perfect detonation properties. The calculated relative specific impulses (I-r,I-sp) of all compounds except for -NH2 derivatives were higher than that of DDNP, and also meet the requirements of propellants.", "paper_title": "Theoretical studies on 2-diazo-4,6-dinitrophenol derivatives aimed at finding superior propellants", "paper_id": "WOS:000303540700029"}