{"auto_keywords": [{"score": 0.04646138076595222, "phrase": "darwin's_theory"}, {"score": 0.012230849943404214, "phrase": "empirical_evidence"}, {"score": 0.00481495049065317, "phrase": "scientific_discovery"}, {"score": 0.0046159158660556985, "phrase": "discovery_processes"}, {"score": 0.004560568143816105, "phrase": "einstein's_special_theory"}, {"score": 0.004091248980678087, "phrase": "logical_inference_system"}, {"score": 0.0038054151244558123, "phrase": "scientific_theories"}, {"score": 0.0035824802350703376, "phrase": "special_theory"}, {"score": 0.003352256019007896, "phrase": "experimental_evidence"}, {"score": 0.003117890043128058, "phrase": "darwin's_time"}, {"score": 0.0027464008668204444, "phrase": "darwin"}, {"score": 0.002680789041160613, "phrase": "natural_selection"}, {"score": 0.002404447017429959, "phrase": "logical_consequence"}], "paper_keywords": ["R-calculus", " theory of relativity", " theory of evolution"], "paper_abstract": "This paper shows that the discovery processes of Einstein's special theory of relativity and Darwin's theory of evolution of species can be formally verified by R-calculus which is a logical inference system. The aim of R-calculus is to delete the principles of scientific theories which contradict empirical evidence. The paper shows that the special theory of relativity is the only and correct choice for physics to meet the experimental evidence given at the time. As far as the biology of Darwin's time is concerned, however, the R-calculus has derived three logically correct but different theories, which are all consistent with the empirical evidence provided by Darwin and his principle of natural selection. Darwin's theory of evolution matches one of the three theories derived by R-calculus. This theory has a logical consequence that is \"each species has been independently created is erroneous\". But the other two theories support the negation of the above statement. The existence of the other two theories may be a reason of the controversies over Darwin's theory.", "paper_title": "Logical verification of scientific discovery", "paper_id": "WOS:000276775200001"}