{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "pulp_and_paper_industry"}, {"score": 0.004594951819987416, "phrase": "pulp_production_processes"}, {"score": 0.0045415338200109345, "phrase": "first_major_application"}, {"score": 0.004200874581076468, "phrase": "computer-based_modelling"}, {"score": 0.004119762981892093, "phrase": "complex_nature"}, {"score": 0.003885668358145471, "phrase": "electronic_description"}, {"score": 0.0038404642251010797, "phrase": "papermaking_process"}, {"score": 0.0036080776793146843, "phrase": "paper_industry"}, {"score": 0.003298357357267836, "phrase": "new_grades"}, {"score": 0.0031351720217878917, "phrase": "simulation_techniques"}, {"score": 0.0031107911390188055, "phrase": "pulp_and_paper_manufacturing_processes"}, {"score": 0.00277778944472107, "phrase": "better_understanding"}, {"score": 0.002579140290642792, "phrase": "paper_quality"}, {"score": 0.00253916011199984, "phrase": "wet-end_chemistry"}, {"score": 0.002470676601347937, "phrase": "important_features"}, {"score": 0.002422890839801611, "phrase": "new_process_designs"}, {"score": 0.0023391880766516285, "phrase": "decision_support"}], "paper_keywords": ["modelling", " simulation", " pulping", " papermaking"], "paper_abstract": "In pulp and paper the modelling and simulation of the pulp production processes was the first major application. Since then several other applications have been realised though papermaking has never been on the lead concerning the use of computer-based modelling and simulation. The complex nature of the materials is one of the most demanding challenges and the biggest hurdle for any electronic description of the papermaking process or paper itself. So other industries took the lead and it is now for the paper industry to learn from these industries what can be done with the help of computers to control or optimise processes or to design new grades. The application of results gained with the use of modelling and simulation techniques in pulp and paper manufacturing processes has helped the industry to, for example, reduce emissions and increase the productivity and cost-efficiency of the processes. Still there are many important tasks open. A better understanding of the mechanisms of the processes and their control loops has to be achieved in order to further improve the paper quality, stabilise the wet-end chemistry, and enhance the runnability. Important features to be developed are new process designs, efficient process monitoring and systems that offer decision support during operation. In this paper a review of the state of the art on modelling and simulation in the pulp and paper industry is presented as well as further research needs.", "paper_title": "Use of modelling and simulation in the pulp and paper industry", "paper_id": "WOS:000274741800002"}