{"auto_keywords": [{"score": 0.03302346892267838, "phrase": "rate_chart"}, {"score": 0.015719716506582524, "phrase": "attribute_events"}, {"score": 0.014680267425942702, "phrase": "attribute_event"}, {"score": 0.004619295212985837, "phrase": "statistical_computation"}, {"score": 0.004385819169212677, "phrase": "continuous_variable"}, {"score": 0.00425141240073214, "phrase": "product_lot"}, {"score": 0.0038456073694665, "phrase": "time_interval"}, {"score": 0.0034544053534458093, "phrase": "control_charts"}, {"score": 0.003360057874429478, "phrase": "limited_syntheses"}, {"score": 0.003336875060853387, "phrase": "statistical_process_control"}, {"score": 0.003234509549830177, "phrase": "single_spc_chart"}, {"score": 0.0030390745780621503, "phrase": "time_interval_t"}, {"score": 0.0030076688939890735, "phrase": "cof"}, {"score": 0.002895246938820814, "phrase": "t._our_studies"}, {"score": 0.0028554143163813947, "phrase": "new_chart"}, {"score": 0.0027870176748502045, "phrase": "out-of-control_status"}, {"score": 0.0027108484507501907, "phrase": "individual_t_chart"}, {"score": 0.0026828233195176155, "phrase": "individual_c_chart"}, {"score": 0.00246877952076635, "phrase": "c_shift"}, {"score": 0.0023114798074455453, "phrase": "manufacturing_systems"}, {"score": 0.0022955150243239623, "phrase": "non-manufacturing_sectors"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": [""], "paper_abstract": "This article studies the monitoring of the attribute events based on statistical computation and analyses. The size of an attribute event is an integer rather than a continuous variable. For example, the detection of a product lot containing defectives is an attribute event, the size of which is the number of defectives found in this lot. While many control charts have been developed for monitoring the time interval (T) between the occurrences of an event, many other attribute charts may be employed to examine the size (C) of the event. However, these two types of control charts have been investigated and applied separately with limited syntheses in Statistical Process Control (SPC). This article presents a single SPC chart (called the rate chart for attribute, or rate chart in short) for simultaneously monitoring the time interval T and size Cof an attribute event based on the ratio between C and T. Our studies show that the new chart is more effective for detecting the out-of-control status of the attribute event compared with an individual t chart or an individual c chart, as well as a combined t & c chart. More profound is that the rate chart performs more uniformly than other charts for detecting both T shift and C shift, as well as the joint shift in T and C. The rate chart has demonstrated its potential for both manufacturing systems and non-manufacturing sectors (e.g., supply chain management, office administration and health care industry), especially for the latter. (C) 2009 Elsevier B.V. All rights reserved.", "paper_title": "Statistical computation and analyses for attribute events", "paper_id": "WOS:000266381800014"}