{"auto_keywords": [{"score": 0.03136706202255777, "phrase": "european"}, {"score": 0.00481495049065317, "phrase": "purpose_-_the_purpose"}, {"score": 0.004621043537046209, "phrase": "michael_buckland's_important_question"}, {"score": 0.004034649282040889, "phrase": "john_stuart"}, {"score": 0.0039362878637371574, "phrase": "\"real\"_definition"}, {"score": 0.0036402965997795536, "phrase": "foundationalist_philosophy"}, {"score": 0.003257432325797907, "phrase": "hilary_putnam's_arguments"}, {"score": 0.0032174507570710835, "phrase": "orthodox_wittgensteinian_interpretation"}, {"score": 0.0029876282026237207, "phrase": "sixteenth-century_english"}, {"score": 0.002575934917174136, "phrase": "specific_case_studies"}, {"score": 0.0025130460190930554, "phrase": "general_philosophical_reason"}, {"score": 0.0024017007954518065, "phrase": "good_reasons"}, {"score": 0.0021755548389283856, "phrase": "original_contribution"}, {"score": 0.0021488235554917128, "phrase": "new_interest"}, {"score": 0.0021311850321045767, "phrase": "documentation_studies"}, {"score": 0.0021049977753042253, "phrase": "conceptual_resources"}], "paper_keywords": ["Document management", " Information science", " Philosophical concepts"], "paper_abstract": "Purpose - The purpose of this paper is to provide a reconsideration of Michael Buckland's important question, \"What is a document?\", analysing the point and purpose of definitions of \"document\" and \"documentation\". Design/methodology/approach - Two philosophical notions of the point of definitions are contrasted: John Stuart Mill's concept of a \"real\" definition, purporting to specify the nature of the definiendum; and a concept of definition based upon a foundationalist philosophy of language. Both conceptions assume that a general, philosophical justification for using words as we do is always in order. This assumption is criticized by deploying Hilary Putnam's arguments against the orthodox Wittgensteinian interpretation of criteria governing the use of language. The example of the cabinets of curiosities of the sixteenth-century English and European virtuosi is developed to show how one might productively think about what documents might be, but without a definition of a document. Findings - Other than for specific, instrumentalist purposes (often appropriate for specific case studies), there is no general philosophical reason for asking, what is a document? There are good reasons for pursuing studies of documentation without the impediments of definitions of \"document\" or \"documentation\". Originality/value - The paper makes an original contribution to the new interest in documentation studies by providing conceptual resources for multiplying, rather than restricting, the areas of application of the concepts of documents and documentation.", "paper_title": "Revisiting \"what is a document?\"", "paper_id": "WOS:000264951500007"}