{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "topology_control"}, {"score": 0.004772137871562584, "phrase": "constructive_implicit_surfaces"}, {"score": 0.004502943680955863, "phrase": "complex_and_dynamic_topology"}, {"score": 0.003955679223407243, "phrase": "topology_changes"}, {"score": 0.003732368382223596, "phrase": "standard_blending_operator"}, {"score": 0.003569176320452192, "phrase": "n-ary_nature"}, {"score": 0.0032347516831068715, "phrase": "reference_case"}, {"score": 0.0029978863469038914, "phrase": "single_parameter"}, {"score": 0.0028411768240129585, "phrase": "topological_combination"}, {"score": 0.0026686444508167875, "phrase": "dynamic_adjustment"}, {"score": 0.00259793885118959, "phrase": "context-dependent_effects"}, {"score": 0.0025404470150468387, "phrase": "skeleton-based_modeling"}, {"score": 0.0023333173799963795, "phrase": "controllable_merging"}, {"score": 0.0022613292987262177, "phrase": "manga-style_hair"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Implicit surfaces"], "paper_abstract": "Constructive implicit surfaces are attractive for modeling and animation because they seamlessly handle shapes with complex and dynamic topology. However, the way they merge shapes is difficult to control. This paper introduces a solution: an improved blend operator that provides control over how topology changes are handled. It is based on a correction applied to the standard blending operator: the sum. Building on summation preserves the n-ary nature of the blend, providing the simplicity of arbitrary (e.g. flat) construction trees and segmentation invariance. The correction is based on projection to a reference case in the variation-space defined by the field and the norm of its gradient. It provides a single parameter, allowing for tuning behavior to achieve effects ranging from avoiding topological combination, through merging only during overlap, to merging at a distance. Dynamic adjustment of the parameter allows for context-dependent effects. Applications range from skeleton-based modeling, where shapes keep the topology of their skeleton, to objects that change topology during animation, with controllable merging. We illustrate the latter with Manga-style hair, where merging depends on the angle between hair wisps. (C) 2014 Elsevier Ltd. All rights reserved.", "paper_title": "N-ary implicit blends with topology control", "paper_id": "WOS:000348748700002"}