{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "wide_scale_publish-subscribe_systems"}, {"score": 0.004332894955218135, "phrase": "high_interest"}, {"score": 0.004257360656055417, "phrase": "relevant_research_activities"}, {"score": 0.003968112038249246, "phrase": "additional_research_efforts"}, {"score": 0.003367077034382727, "phrase": "emerging_wide-scale_and_highly_dynamic_communication_environments"}, {"score": 0.003212663446866794, "phrase": "continuous_exchange"}, {"score": 0.003138124398958758, "phrase": "static_and_mobile_nodes"}, {"score": 0.003101503914610488, "phrase": "smart-city_scenarios"}, {"score": 0.002790511479398411, "phrase": "scalability_and_quality_requirements"}, {"score": 0.00270978310478061, "phrase": "detailed_technical_analysis"}, {"score": 0.0026781477395106993, "phrase": "existing_mechanisms"}, {"score": 0.0022854384756395116, "phrase": "surveying_work"}, {"score": 0.002232364384065567, "phrase": "promising_guidelines"}, {"score": 0.002206290313627494, "phrase": "future_research"}, {"score": 0.0021049977753042253, "phrase": "technical_challenges"}], "paper_keywords": ["Publish/Subscribe", " Scalability", " Quality Support"], "paper_abstract": "Publish/Subscribe (PUB/SUB) systems have attracted much academic and industrial interest in the last years, with several successful experiences of development and deployment. Notwithstanding this high interest and the relevant research activities accomplished in the field, there are still many open technical challenges calling for additional research efforts. In this paper, we focus on the ability of PUB/SUB infrastructures to offer cost-effective, scalable, and quality-aware data distribution in emerging wide-scale and highly dynamic communication environments, such as those related to the continuous exchange of information between static and mobile nodes in smart-city scenarios. To this purpose, we survey state-of-the-art industrial and academic PUB/SUB solutions, with a strong focus on their support to scalability and quality requirements. We offer a detailed technical analysis of existing mechanisms and techniques for scalable QoS provisioning in PUB/SUB middleware, and we show how different design/implementation details impact the scalability and quality achievable at runtime. At the end of this surveying work, we identify promising guidelines for future research and for PUB/SUB systems extensions to effectively address the technical challenges of scalability and quality.", "paper_title": "Quality of Service in Wide Scale Publish-Subscribe Systems", "paper_id": "WOS:000343072200020"}