{"auto_keywords": [{"score": 0.04305155173647726, "phrase": "training_sets"}, {"score": 0.00481495049065317, "phrase": "anti-androgenic_effect"}, {"score": 0.004748371393578422, "phrase": "preliminary_study"}, {"score": 0.004247696749118451, "phrase": "androgenic_receptor_antagonist_models"}, {"score": 0.0033986345279488476, "phrase": "complementary_use"}, {"score": 0.0032898346872897383, "phrase": "valuable_tool"}, {"score": 0.0031697368057340895, "phrase": "androgenic_receptor_antagonism"}, {"score": 0.0030117065110966414, "phrase": "particular_application"}, {"score": 0.0029288446848334576, "phrase": "domain_definition"}, {"score": 0.0028615323526689582, "phrase": "prediction_interpretation"}, {"score": 0.0027570267191549774, "phrase": "different_descriptors"}, {"score": 0.0027188259793109264, "phrase": "modelling_systems"}, {"score": 0.002278284823857861, "phrase": "qsar_models"}], "paper_keywords": ["anti-androgen", " QSAR", " MultiCase (R)", " LeadScope (R)", " MDL (R) QSAR"], "paper_abstract": "Three modelling systems (MultiCase (R), LeadScope (R) and MDL (R) QSAR) were used for construction of androgenic receptor antagonist models. There were 923-942 chemicals in the training sets. The models were cross-validated (leave-groups-out) with concordances of 77-81%, specificity of 78-91% and sensitivity of 51-76%. The specificity was highest in the MultiCase (R) model and the sensitivity was highest in the MDL (R) QSAR model. A complementary use of the models may be a valuable tool when optimizing the prediction of chemicals for androgenic receptor antagonism. When evaluating the fitness of the model for a particular application, balance of training sets, domain definition, and cut-offs for prediction interpretation should also be taken into account. Different descriptors in the modelling systems are illustrated with hydroxyflutamide and dexamethasone as examples (a non-steroid and a steroid anti-androgen, respectively). More research concerning the mechanism of anti-androgens would increase the possibility for further optimization of the QSAR models. Further expansion of the basis for the models is in progress, including the addition of more drugs.", "paper_title": "QSAR models for anti-androgenic effect - a preliminary study", "paper_id": "WOS:000288270300003"}