{"auto_keywords": [{"score": 0.034021124392426265, "phrase": "papervis"}, {"score": 0.004542780650208743, "phrase": "google-like_information"}, {"score": 0.004043541331944951, "phrase": "associated_citation_network"}, {"score": 0.0033559647822437298, "phrase": "resulting_huge_collection"}, {"score": 0.003111133215976132, "phrase": "user-friendly_interface"}, {"score": 0.0029867619862229853, "phrase": "intrinsic_complex_citation-reference_structures"}, {"score": 0.0026892447164623247, "phrase": "node-link_graph"}, {"score": 0.0025221759076833124, "phrase": "screen_space"}, {"score": 0.002421291757425244, "phrase": "visual_cues"}, {"score": 0.0023792975669318615, "phrase": "node_attributes"}, {"score": 0.002231441081806766, "phrase": "semantically_meaningful_hierarchies"}, {"score": 0.0021927323694667694, "phrase": "ensuing_literature_exploration"}], "paper_keywords": [""], "paper_abstract": "Reviewing literatures for a certain research field is always important for academics. One could use Google-like information seeking tools, but oftentimes he/she would end up obtaining too many possibly related papers, as well as the papers in the associated citation network. During such a process, a user may easily get lost after following a few links for searching or cross-referencing. It is also difficult for the user to identify relevant/important papers from the resulting huge collection of papers. Our work, called PaperVis, endeavors to provide a user-friendly interface to help users quickly grasp the intrinsic complex citation-reference structures among a specific group of papers. We modify the existing Radial Space Filling (RSF) and Bullseye View techniques to arrange involved papers as a node-link graph that better depicts the relationships among them while saving the screen space at the same time. PaperVis applies visual cues to present node attributes and their transitions among interactions, and it categorizes papers into semantically meaningful hierarchies to facilitate ensuing literature exploration. We conduct experiments on the InfoVis 2004 Contest Dataset to demonstrate the effectiveness of PaperVis.", "paper_title": "PaperVis: Literature Review Made Easy", "paper_id": "WOS:000292164300010"}