{"auto_keywords": [{"score": 0.04494706146937883, "phrase": "minimal_degree"}, {"score": 0.00481495049065317, "phrase": "feist"}, {"score": 0.004204459295724526, "phrase": "creative_spark"}, {"score": 0.0035543706594585076, "phrase": "automatic_mechanical_or_computational_procedure"}, {"score": 0.0034636656250083744, "phrase": "highly_routine_product"}, {"score": 0.0032259472087775138, "phrase": "accepted_distinctions"}, {"score": 0.0030832123624449028, "phrase": "different_level"}, {"score": 0.0029658905122290536, "phrase": "direct_human_engagement"}, {"score": 0.0029183300121987422, "phrase": "direct_engagement"}, {"score": 0.0028346293790895024, "phrase": "classic_concepts"}, {"score": 0.0023958326775913165, "phrase": "intellectual_level"}, {"score": 0.002372693822379709, "phrase": "sufficient_amount"}, {"score": 0.0023120743774800176, "phrase": "exchange_values"}, {"score": 0.0022676260293002706, "phrase": "creative_activity"}, {"score": 0.0022384684697329097, "phrase": "bibliographic_records"}, {"score": 0.0021049977753042253, "phrase": "four-stage_discriminatory_process"}], "paper_keywords": ["copyright", " creativity", " database design"], "paper_abstract": "This paper develops an understanding of creativity to meet the requirements of the decision of the Supreme Court of theUnitedStates inFeist v.Rural (1991). The inclusion of creativity in originality, in a minimal degree of creativity, and in a creative spark below the level required for originality, is first established. Conditions for creativity are simultaneously derived. Clauses negatively implying creativity are then identified and considered. The clauses that imply creativity can be extensively correlated with conceptions of computability. The negative of creativity is then understood as an automatic mechanical or computational procedure or a so routine process that results in a highly routine product. Conversely, creativity invariantly involves a not mechanical procedure. The not mechanical is then populated by meaning, in accord with accepted distinctions, drawing on a range of discourses. Meaning is understood as a different level of analysis to the syntactic or mechanical and also as involving direct human engagement with meaning. As direct engagement with meaning, it can be connected to classic concepts of creativity, through the association of dissimilars. Creativity is finally understood as not mechanical human activity above a certain level of routinicity. Creativity is then integrated with a minimal degree of creativity and with originality. The level of creativity required for a minimal degree is identified as intellectual. The combination of an intellectual level with a sufficient amount of creativity can be read from the exchange values connected with the product of creative activity. Humanly created bibliographic records and indexes are then possible correlates to, or constituents of, a minimal degree of creativity. A four-stage discriminatory process for determining originality is then specified. Finally, the strength and value of the argument are considered.", "paper_title": "Creativity for Feist", "paper_id": "WOS:000323377600008"}