{"auto_keywords": [{"score": 0.04233827010585042, "phrase": "tsfs_data"}, {"score": 0.041290019984613, "phrase": "mcr-als_analysis"}, {"score": 0.014092141561102032, "phrase": "unfolded_tsfs_data"}, {"score": 0.009796002278607188, "phrase": "simultaneous_extraction"}, {"score": 0.009084570692223556, "phrase": "present_work"}, {"score": 0.008852036155038713, "phrase": "bilinear_structure"}, {"score": 0.007961837159479948, "phrase": "raman"}, {"score": 0.007885854137343893, "phrase": "solvent_molecules"}, {"score": 0.007124630765577424, "phrase": "tsfs"}, {"score": 0.006345783821328795, "phrase": "synchronous_spectral_profiles"}, {"score": 0.0055587987262689514, "phrase": "bap"}, {"score": 0.005493480807732491, "phrase": "py"}, {"score": 0.004570589177473792, "phrase": "multivariate_curve_resolution"}, {"score": 0.004411096776740219, "phrase": "pure_synchronous_fluorescence_spectra"}, {"score": 0.004287502170674863, "phrase": "total_synchronous_fluorescence_spectroscopy"}, {"score": 0.004247075069089933, "phrase": "data_set"}, {"score": 0.004207027546363108, "phrase": "aqueous_mixtures"}, {"score": 0.003382964968256005, "phrase": "synchronous_spectral_profile"}, {"score": 0.0032647792316543604, "phrase": "diagonal_signals"}, {"score": 0.0032416406134314663, "phrase": "three-dimensional_landscapes"}, {"score": 0.003180733665675691, "phrase": "raman_scattering"}, {"score": 0.0031581888200437106, "phrase": "raman_signal"}, {"score": 0.0030915055800372093, "phrase": "synchronous_profile"}, {"score": 0.0030550677676608896, "phrase": "different_extents"}, {"score": 0.0030406128119609267, "phrase": "different_delta_lambda_s._tsfs_data"}, {"score": 0.0029274011790028876, "phrase": "first_mode"}, {"score": 0.0027588643459394986, "phrase": "raman_scattering_signals"}, {"score": 0.0026247955256974726, "phrase": "calculated_spectral_profiles"}, {"score": 0.002527026842366448, "phrase": "obtained_spectral_profiles"}, {"score": 0.002212575360988711, "phrase": "obtained_results"}, {"score": 0.0021351902267935726, "phrase": "groundwater_samples"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["MCR-ALS", " TSFS", " Unfolded-TSFS", " Raman scattering", " Bilinear", " Three-way array"], "paper_abstract": "In the present study, the possibility of using the multivariate curve resolution alternating least square (MCR-ALS) analysis for the simultaneous extraction of the pure synchronous fluorescence spectra at various wavelength offsets (Delta lambda) for each fluorophore from the total synchronous fluorescence spectroscopy (TSFS) data set of the dilute aqueous mixtures of the three fluorophores, was explored. The present work was based on the assumption that unfolded TSFS data has a bilinear structure and therefore it can be subjected to MCR-ALS analysis. Three fluorophores, benzo[a]pyrene(BaP), perylene(PE), and pyrene(PY), were chosen. These three fluorophores show fluorescence at all the seven wavelength offsets (Delta lambda) used to create the TSFS data set. In addition, Raman scattering due to solvent molecules (i.e. water) also appear in the wavelength ranges where these fluorophores show fluorescence. These two factors make the simultaneous extraction of synchronous spectral profile at various Delta lambda s from the TSFS data set relatively difficult. The appearance of the diagonal signals in the three-dimensional landscapes of TSFS shows the presence of the Raman scattering. The Raman signal due to solvent molecules was found to influence the synchronous profile of a fluorophore to different extents at different Delta lambda s. TSFS data set of dimension, sample x wavelength x Delta lambda, was unfolded along the first mode to obtain the unfolded TSFS data set. Pure synchronous spectral profiles at various Delta lambda s were obtained for each fluorophore by performing the MCR-ALS analysis on the unfolded TSFS data. However Raman scattering signals could not be eliminated from the synchronous spectral profiles of the PE and PY. For the mitigation of Raman scattering from the calculated spectral profiles, TSFS data of solvent blank were subtracted from all the samples before performing the MCR-ALS analysis. The obtained spectral profiles of BaP, PE, and PY were found to match with their actual spectral profiles which verifies that unfolded TSFS data set has a bilinear structure. To test the strength of the present work, MCR-ALS analysis was also performed on the unfolded TSFS data set of 12 groundwater samples which were contaminated with the BaP- and PY-spiked gasoline. The obtained results show that it is possible to monitor the presence of BaP and PY in groundwater samples. (C) 2012 Elsevier B.V. All rights reserved.", "paper_title": "Application of 'multivariate curve resolution alternating least square (MCR-ALS)' analysis to extract pure component synchronous fluorescence spectra at various wavelength offsets from total synchronous fluorescence spectroscopy (TSFS) data set of dilute aqueous solutions of fluorophores", "paper_id": "WOS:000306043900009"}