{"auto_keywords": [{"score": 0.04043476064430836, "phrase": "rate_anomaly_problem"}, {"score": 0.014293293554793836, "phrase": "ap"}, {"score": 0.009178860454457108, "phrase": "repeater_functionality"}, {"score": 0.00481495049065317, "phrase": "client_repeaters"}, {"score": 0.004278807087784626, "phrase": "per-packet_basis"}, {"score": 0.00407781620412982, "phrase": "different_signal_qualities"}, {"score": 0.004007083686875716, "phrase": "different_transmission_rates"}, {"score": 0.003752550907120244, "phrase": "lower_signal_quality"}, {"score": 0.003703611021999795, "phrase": "lower_rates"}, {"score": 0.0036393456309815166, "phrase": "significant_majority"}, {"score": 0.003438058620195309, "phrase": "higher_rates"}, {"score": 0.0031360786664165093, "phrase": "higher_rate_wi-fi_stations"}, {"score": 0.0030414140732789186, "phrase": "lower_rate_stations"}, {"score": 0.002936709606809639, "phrase": "key_challenge"}, {"score": 0.0026786469998321062, "phrase": "initiation_protocol"}, {"score": 0.0022579036318895753, "phrase": "undesirable_symptoms"}, {"score": 0.0021801135036476136, "phrase": "testbed_implementation"}, {"score": 0.0021328586481696157, "phrase": "softrepeater"}, {"score": 0.0021049977753042253, "phrase": "cumulative_throughput"}], "paper_keywords": ["IEEE 802.11", " rate anomaly", " wireless"], "paper_abstract": "Currently deployed IEEE 802.11 WLANs (Wi-Fi networks) share access point (AP) bandwidth on a per-packet basis. However, various stations communicating with the AP often have different signal qualities, resulting in different transmission rates. This induces a phenomenon known as the rate anomaly problem, in which stations with lower signal quality transmit at lower rates and consume a significant majority of airtime, thereby dramatically reducing the throughput of stations transmitting at higher rates. We propose SoftRepeater, a practical, deployable system in which stations cooperatively address the rate anomaly problem. Specifically, higher rate Wi-Fi stations opportunistically transform themselves into repeaters for lower rate stations when transmitting data to/from the AP. The key challenge is to determine when it is beneficial to enable the repeater functionality. In view of this, we propose an initiation protocol that ensures that repeater functionality is enabled only when appropriate. Also, our system can run directly on top of today's 802.11 infrastructure networks. In addition, we describe a novel, zero-overhead network coding scheme that further alleviates undesirable symptoms of the rate anomaly problem. Using simulation and testbed implementation, we find that SoftRepeater can improve cumulative throughput by up to 200%.", "paper_title": "Opportunistic Use of Client Repeaters to Improve Performance of WLANs", "paper_id": "WOS:000269155300012"}