{"auto_keywords": [{"score": 0.047558044930768165, "phrase": "medication_safety_alerts"}, {"score": 0.04485728455373264, "phrase": "drug_allergy"}, {"score": 0.00481495049065317, "phrase": "electronic_prescribing"}, {"score": 0.00479819563282457, "phrase": "ambulatory_care"}, {"score": 0.004698878021540436, "phrase": "core_function"}, {"score": 0.00452997086752063, "phrase": "small_and_medium-size_practices"}, {"score": 0.0044906540097516545, "phrase": "hypothesis-generating_focus_group_study"}, {"score": 0.004475027869514545, "phrase": "massachusetts"}, {"score": 0.004329199176483866, "phrase": "clinicians'_complaints"}, {"score": 0.004306610946695577, "phrase": "perceived_benefits"}, {"score": 0.004023425871950181, "phrase": "practice_assistants"}, {"score": 0.0040094142308666975, "phrase": "family_practice"}, {"score": 0.00396767023935381, "phrase": "subspecialty_practices"}, {"score": 0.003940081689752887, "phrase": "common_commercial_e-prescribing_system"}, {"score": 0.0038854765143440965, "phrase": "small_and_medium-size_group_practices"}, {"score": 0.0038182789421062945, "phrase": "-medical_school_graduation"}, {"score": 0.0035920758080335655, "phrase": "participants'_decision"}, {"score": 0.003542276457435362, "phrase": "financial_incentives"}, {"score": 0.0034507495772165336, "phrase": "electronic_medical_record"}, {"score": 0.0029852932802967224, "phrase": "out-of-state_pharmacies"}, {"score": 0.0028778050108853653, "phrase": "duplicate_patient_entries"}, {"score": 0.002823050755743821, "phrase": "commonly_ordered_medications"}, {"score": 0.002788749289766721, "phrase": "allergy_information"}, {"score": 0.0027213882346615406, "phrase": "interaction_alerts"}, {"score": 0.002697726021470387, "phrase": "trivial_clinical_significance"}, {"score": 0.0026649432435828842, "phrase": "out-of-date_medications"}, {"score": 0.002560000295424659, "phrase": "particular_drug"}, {"score": 0.002450602177683068, "phrase": "medication_side_effects"}, {"score": 0.0024250482323322606, "phrase": "potential_interactions"}, {"score": 0.0024081601202079273, "phrase": "physical_examination_findings"}, {"score": 0.002387214876538434, "phrase": "laboratory_tests"}, {"score": 0.00230926712470438, "phrase": "potentially_dangerous_drug_interaction"}, {"score": 0.002285183591259895, "phrase": "potential_boon"}, {"score": 0.0022772115643656153, "phrase": "ambulatory_medical_practice"}, {"score": 0.002245599974371541, "phrase": "inappropriate_and_irrelevant_medication_safety_alerts"}, {"score": 0.0022221789518630146, "phrase": "e-prescribing_system"}, {"score": 0.002202847728425357, "phrase": "frontline_clinicians"}, {"score": 0.0021760655918813872, "phrase": "changed_or_aborted_prescriptions"}, {"score": 0.002127186380459509, "phrase": "safe_care"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ireland_ltd."}], "paper_keywords": ["Electronic health records", " Computerized physician order entry", " Alerts and reminders"], "paper_abstract": "Introduction: Drug allergy and interaction alerts are a core function of most electronic prescribing (e-prescribing) systems. To characterize the value of e-prescribing and medication safety alerts, especially in small and medium-size practices, we undertook a hypothesis-generating focus group study of Massachusetts clinicians. We sought to understand the reasons for adoption and use of e-prescribing, as well as clinicians' complaints about and perceived benefits of drug allergy and interaction alerts. Methods: We recruited 25 Massachusetts clinicians to participate in three focus groups regarding the use and value of e-prescribing and medication safety alerts. The participants included high-volume (> 100 electronic scripts per month) physicians, nurse practitioners, and practice assistants in family practice, internal medicine, pediatrics, and subspecialty practices who used a common commercial e-prescribing system. Results: Most clinicians were in small and medium-size group practices. Participants were, on average, 25 years post-medical school graduation (range 8-36), had used e-prescribing for 2.5 years (range 1.0-5.5), and wrote the majority (89%, range 15-100%) of prescriptions electronically. The participants' decision to adopt e-prescribing was driven largely by financial incentives offered by insurers, and was viewed as a step toward implementation of an electronic medical record. Although participants agreed that the system was easy to learn, few anticipated efficiencies were realized until clinicians configured the device to meet their needs. The participants were ambivalent about whether e-prescribing improved their own or overall office efficiency, and - in the absence of payer incentives - few were willing to pay for the systems out-of-pocket. The most valuable aspects of e-prescribing were the ease of changing doses, renewing prescriptions, ensuring legibility, and transmitting prescriptions to in- and out-of-state pharmacies. Participants were dissatisfied with the unreliability of transmitting prescriptions successfully to the pharmacy, and with their inability to merge duplicate patient entries, to create a comprehensive, allprescriber medication list, to write prescriptions for commonly ordered medications and supplies, and to enter allergy information into the system. Participants were critical of the volume of drug allergy and interaction alerts. Many alerts were of trivial clinical significance or were generated by interactions with out-of-date medications. As a result, many clinicians habitually ignored these alerts. Alerts were most helpful to clinicians who were unfamiliar with a particular drug or patient. Although alerts rarely led the clinicians to abort or alter a prescription, alerts did prompt clinicians to counsel patients about medication side effects, to educate themselves about potential interactions, to check physical examination findings, or to order laboratory tests. Despite problems, few clinicians were willing to forego receiving alerts for fear that they would miss a potentially dangerous drug interaction. Electronic prescribing is a potential boon to ambulatory medical practice, although its value may be compromised by inappropriate and irrelevant medication safety alerts and by features of the e-prescribing system that prove burdensome to frontline clinicians. While alerts infrequently result in changed or aborted prescriptions, they may trigger a variety of other provider behaviors that help to ensure safe care. (C) 2009 Elsevier Ireland Ltd. All rights reserved.", "paper_title": "Assessing the value of electronic prescribing in ambulatory care: A focus group study", "paper_id": "WOS:000269116400001"}