{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "interval_grey_uncertain_linguistic_variables"}, {"score": 0.04657381885996476, "phrase": "multiple_attribute_group_decision"}, {"score": 0.03073815000461229, "phrase": "i-igulowa_operator"}, {"score": 0.003965975628742746, "phrase": "grey_uncertain_linguistic_variables"}, {"score": 0.0029764767329116875, "phrase": "desirable_properties"}, {"score": 0.00266693888510356, "phrase": "igulwa_operator"}, {"score": 0.002535115422089855, "phrase": "interval_grey_uncertain_linguistic_information"}, {"score": 0.0024302416436559867, "phrase": "illustrative_example"}, {"score": 0.002349467661235186, "phrase": "erp_software_quality"}, {"score": 0.0021049977753042253, "phrase": "developed_approach"}], "paper_keywords": ["Multiple attribute group decision making", " interval grey uncertain linguistic variables", " induced interval grey uncertain linguistic ordered weighted aggregation (I-IGULOWA) operator", " ERP software quality"], "paper_abstract": "In this paper, we investigate the multiple attribute group decision making problems with interval grey uncertain linguistic variables. We first introduce some operations on the interval grey uncertain linguistic variables. Then, we further develop the we develop the interval grey uncertain linguistic weighted averaging (IGULWA) operator, the interval grey uncertain linguistic variables ordered weighted averaging (IGULOWA) operator and the induced interval grey uncertain linguistic ordered weighted aggregation (I-IGULOWA) operator and study some desirable properties of the I-IGULOWA operator. Furthermore, we apply the I-IGULOWA operator and the IGULWA operator to the multiple attribute group decision making with interval grey uncertain linguistic information. Finally, an illustrative example for evaluating the ERP software quality with the interval grey uncertain linguistic variables is given to verify the developed approach.", "paper_title": "Approaches to multiple attribute group decision making problems with interval grey uncertain linguistic variables", "paper_id": "WOS:000343424500030"}