{"auto_keywords": [{"score": 0.049666636555871356, "phrase": "intrinsically_disordered_proteins"}, {"score": 0.03665878723559446, "phrase": "experimental_data"}, {"score": 0.00481495049065317, "phrase": "explicit_ensemble_descriptions"}, {"score": 0.004531997388646422, "phrase": "significant_fraction"}, {"score": 0.004473552224535518, "phrase": "human_proteome"}, {"score": 0.004415857432588371, "phrase": "classical_structure_function_paradigm"}, {"score": 0.004284100953217494, "phrase": "molecular_biology"}, {"score": 0.004120435930514554, "phrase": "stable_tertiary_structure"}, {"score": 0.003163878786694538, "phrase": "amino_acid-specific_conformational_potentials"}, {"score": 0.0030960762496815768, "phrase": "conformational_sampling"}, {"score": 0.003029722317983915, "phrase": "primary_sequence"}, {"score": 0.0029392020223716966, "phrase": "additional_local_or_long-range_conformational_propensities"}, {"score": 0.0027304365438083874, "phrase": "expected_values"}, {"score": 0.0027068691342344545, "phrase": "experimental_parameters"}, {"score": 0.0026718978608934077, "phrase": "atomic_or_molecular_resolution"}, {"score": 0.0026259694526633037, "phrase": "nuclear_magnetic_resonance"}, {"score": 0.0025696647013416863, "phrase": "small_angle_scattering"}, {"score": 0.0023257824499250653, "phrase": "fully_disordered_protein"}, {"score": 0.0022758994740331258, "phrase": "experimental_evidence"}, {"score": 0.002236762786982225, "phrase": "'random_coil'_behaviour"}, {"score": 0.0021049977753042253, "phrase": "broad_ensemble"}], "paper_keywords": [""], "paper_abstract": "Motivation: Intrinsically disordered proteins (IDPs) represent a significant fraction of the human proteome. The classical structure function paradigm that has successfully underpinned our understanding of molecular biology breaks down when considering proteins that have no stable tertiary structure in their functional form. One convenient approach is to describe the protein in terms of an equilibrium of rapidly inter-converting conformers. Currently, tools to generate such ensemble descriptions are extremely rare, and poorly adapted to the prediction of experimental data. Results: We present flexible-meccano-a highly efficient algorithm that generates ensembles of molecules, on the basis of amino acid-specific conformational potentials and volume exclusion. Conformational sampling depends uniquely on the primary sequence, with the possibility of introducing additional local or long-range conformational propensities at an amino acid-specific resolution. The algorithm can also be used to calculate expected values of experimental parameters measured at atomic or molecular resolution, such as nuclear magnetic resonance (NMR) and small angle scattering, respectively. We envisage that flexible-meccano will be useful for researchers who wish to compare experimental data with those expected from a fully disordered protein, researchers who see experimental evidence of deviation from 'random coil' behaviour in their protein, or researchers who are interested in working with a broad ensemble of conformers representing the flexibility of the IDP of interest.", "paper_title": "Flexible-meccano: a tool for the generation of explicit ensemble descriptions of intrinsically disordered proteins and their associated experimental observables", "paper_id": "WOS:000304537000007"}