{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "market_clearing"}, {"score": 0.004674952036988355, "phrase": "online_market_clearing"}, {"score": 0.004514714250357749, "phrase": "multiple_buyers"}, {"score": 0.00441883624011048, "phrase": "different_times"}, {"score": 0.004324985524216987, "phrase": "online_clearing_problem"}, {"score": 0.00366185681714204, "phrase": "simpler_algorithm"}, {"score": 0.0035362203230511957, "phrase": "expiration_times"}, {"score": 0.0033965836912510385, "phrase": "simple_greedy_algorithm"}, {"score": 0.003315453665547982, "phrase": "money-losing_trades"}, {"score": 0.0032275726080181373, "phrase": "online_algorithm"}, {"score": 0.0031589426059793996, "phrase": "money-losing_pairs"}, {"score": 0.003091767402370757, "phrase": "previous_pairs"}, {"score": 0.0029616594364766297, "phrase": "optimal_offline_algorithm"}, {"score": 0.002645518610853686, "phrase": "social_welfare"}, {"score": 0.0025546627686955656, "phrase": "online_matching"}, {"score": 0.0025341419804996387, "phrase": "incomplete_interval_graph"}, {"score": 0.002480220161640831, "phrase": "incentive_compatibility"}, {"score": 0.002447101794397243, "phrase": "nearly_optimal_incentive-compatible_algorithm"}, {"score": 0.0023566987138026285, "phrase": "incentive-compatible_algorithm"}, {"score": 0.0023314867226678555, "phrase": "sublinear_competitive_ratio"}, {"score": 0.002116351238579227, "phrase": "best_fixed_pair"}, {"score": 0.0021049977753042253, "phrase": "buy_and_sell_prices"}], "paper_keywords": ["algorithms", " economics", " theory", " Competitive analysis", " double auctions", " exchanges", " online algorithms"], "paper_abstract": "In this article, we study the problem of online market clearing where there is one commodity in the market being bought and sold by multiple buyers and sellers whose bids arrive and expire at different times. The auctioneer is faced with an online clearing problem of deciding which buy and sell bids to match without knowing what bids will arrive in the future. For maximizing profit, we present a (randomized) online algorithm with a competitive ratio of ln(p(max) - p(min)) + 1, when bids are in a range [p(min), p(max)], which we show is the best possible. A simpler algorithm has a ratio twice this, and can be used even if expiration times are not known. For maximizing the number of trades, we present a simple greedy algorithm that achieves a factor of 2 competitive ratio if no money-losing trades are allowed. We also show that if the online algorithm is allowed to subsidize matches-match money-losing pairs if it has already collected enough money from previous pairs to pay for them-then it can actually be 1-competitive with respect to the optimal offline algorithm that is not allowed subsidy. That is, for maximizing the number of trades, the ability to subsidize is at least as valuable as knowing the future. We also consider objectives of maximizing buy or sell volume and social welfare. We present all of these results as corollaries of theorems on online matching in an incomplete interval graph. We also consider the issue of incentive compatibility, and develop a nearly optimal incentive-compatible algorithm for maximizing social welfare. For maximizing profit, we show that no incentive-compatible algorithm can achieve a sublinear competitive ratio, even if only one buy bid and one sell bid are alive at a time. However, we provide an algorithm that, under certain mild assumptions on the bids, performs nearly as well as the best fixed pair of buy and sell prices, a weaker", "paper_title": "Online algorithms for market clearing", "paper_id": "WOS:000242844700006"}