{"auto_keywords": [{"score": 0.04711187924763281, "phrase": "swit"}, {"score": 0.00942652157518596, "phrase": "artificial_intelligence"}, {"score": 0.00481495049065317, "phrase": "social_web"}, {"score": 0.004774115617883476, "phrase": "intelligent_things"}, {"score": 0.004575053987970206, "phrase": "\"social_web_of_intelligent_things"}, {"score": 0.0041657281535389615, "phrase": "intelligent_and_social_behavior"}, {"score": 0.003776750773624222, "phrase": "\"social\"_networks"}, {"score": 0.0034977560416755726, "phrase": "social_media"}, {"score": 0.003423969509052361, "phrase": "desktop_paradigm"}, {"score": 0.0032531496610470377, "phrase": "virtual_experiences"}, {"score": 0.003117307618682836, "phrase": "real_life"}, {"score": 0.0030515222178491923, "phrase": "people's_experiences"}, {"score": 0.0029491324941225356, "phrase": "challenging_area"}, {"score": 0.002801935384649699, "phrase": "future_internet"}], "paper_keywords": ["Web of Things", " Smart Objects", " Web 2.0 and collective intelligence", " social applications", " intelligent interaction"], "paper_abstract": "In this paper we introduce the notion of \"Social Web of Intelligent Things\" (SWIT hereafter) as a an evolution of both the \"Web of Things\" and \"Smart Objects\" paradigms. In a SWIT, things become entities capable of an intelligent and social behavior. On the one hand, things maintain and socialize knowledge and can interact and communicate with people; on the other, \"social\" networks of people and things arise as a result of this interaction. SWIT is an evolution of social media that goes beyond the desktop paradigm and is a way of bridging the gap between real-life and virtual experiences. Interactions between people and things happen naturally in real life, augmenting and enhancing people's experiences. We claim that SWITs are a challenging area of research and application for Artificial Intelligence in the context of the Future Internet. The paper provides a characterization of SWITs, discussing the ingredients that are needed to create a SWIT; it introduces a framework for building SWITs and briefly presents an instance we developed and tested with users. In the paper we claim that many areas of Artificial Intelligence can contribute to the is framework, which in turn can stimulate research in these areas and on their integration.", "paper_title": "Toward a social web of intelligent things", "paper_id": "WOS:000296883600003"}