{"auto_keywords": [{"score": 0.04614766352910892, "phrase": "client's_team"}, {"score": 0.04267830301788783, "phrase": "knowledge_processes"}, {"score": 0.042014973674614785, "phrase": "global_sourcing"}, {"score": 0.015719716506582538, "phrase": "chinese_provider's_perspective"}, {"score": 0.013707205536534876, "phrase": "client's_culture"}, {"score": 0.012492127349268398, "phrase": "knowledge_sharing"}, {"score": 0.012391636423450276, "phrase": "knowledge-based_coordination"}, {"score": 0.0036355032885145894, "phrase": "product_success"}, {"score": 0.003605997900398767, "phrase": "personal_satisfaction"}, {"score": 0.0034761488481944657, "phrase": "xi'an_software_park"}, {"score": 0.0032700071110068323, "phrase": "knowledge_workers"}, {"score": 0.0032040376301815544, "phrase": "global_sourcing_projects"}, {"score": 0.003126623133221065, "phrase": "supplier_team's_it-based_skills"}, {"score": 0.002881793492919646, "phrase": "knowledge_process"}, {"score": 0.00266693888510356, "phrase": "influential_factors"}, {"score": 0.0024580159789774516, "phrase": "key_factors"}, {"score": 0.002331054401198527, "phrase": "social_and_cultural_differences"}, {"score": 0.0022933216359142736, "phrase": "contextual_factors"}, {"score": 0.0021659920594094407, "phrase": "crown_copyright"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Knowledge processes", " Performance", " Global sourcing", " IT services", " Chinese provider"], "paper_abstract": "This paper explores the influences of two internal factors, i.e. supplier team's IT-based skills and communication with client's team, and two contextual factors, i.e. supplier team's understanding of client's culture and collaboration with client's team, on knowledge processes and performance in global sourcing of IT services from the Chinese provider's perspective. Knowledge processes are characterized by knowledge sharing, knowledge-based coordination and expertise management, and performance is measured by product success and personal satisfaction. Data have been collected in 13 companies in Xi'an Software Park, with 26 in-depth, semi-structured interviews held with top and middle managers, and 200 structured questionnaires distributed to knowledge workers who are involved in global sourcing projects. The results indicate that supplier team's IT-based skills, communication with client's team, cultural understanding of client's culture and collaboration with client's team are positively associated with knowledge process and performance. Also, knowledge sharing, knowledge-based coordination and expertise management are found to be crucial for those influential factors to function positively and contribute to the performance. The findings of this study suggest that the effects of key factors on knowledge processes and performance in global sourcing of IT services appear to transcend the social and cultural differences; however, contextual factors seem to have more significant influences on knowledge processes and performance in global sourcing of IT services. Crown Copyright (C) 2011 Published by Elsevier Ltd. All rights reserved.", "paper_title": "Internal and contextual factors, knowledge processes and performance: From the Chinese provider's perspective", "paper_id": "WOS:000299583700060"}