{"auto_keywords": [{"score": 0.03405446722670332, "phrase": "pps"}, {"score": 0.028781606899975415, "phrase": "quality_criteria"}, {"score": 0.00481495049065317, "phrase": "business_processes"}, {"score": 0.003949280009382125, "phrase": "central_aspects"}, {"score": 0.003850566273995209, "phrase": "hospital_process"}, {"score": 0.003722761107761564, "phrase": "systematic_literature_review"}, {"score": 0.0035389348527719404, "phrase": "medical_and_business_informatics"}, {"score": 0.003479692058963528, "phrase": "quality_management_publications"}, {"score": 0.00297647673291169, "phrase": "hospital_processes"}, {"score": 0.002951444412262927, "phrase": "axis_ii"}, {"score": 0.002735392281320413, "phrase": "quality_aspects"}, {"score": 0.002503187934017557, "phrase": "different_methods"}, {"score": 0.002242758902593467, "phrase": "ten_typical_hospital_processes"}, {"score": 0.0022145052062614514, "phrase": "instrument's_practicability"}, {"score": 0.002131857309586904, "phrase": "financial_studies"}, {"score": 0.0021049977753042253, "phrase": "final_target_group"}], "paper_keywords": ["business process", " process management", " process evaluation", " quality management", " health informatics"], "paper_abstract": "Objectives: Hospitals are increasingly under pressure to optimize their process. So far, an instrument to systematically identify the potentials for improvement of a given business process is missing. The aim of this project is to develop such an instrument. Methods: Initially, central aspects of the quality of a hospital process were identified on the basis of a systematic literature review. Secondary to that, criteria to measure quality aspects were defined. More than 300 criteria from medical and business informatics, economics and quality management publications were gathered and systematically aggregated. Results: As a result, the Process Potential Screening (PPS) instrument was developed. The PPS is a matrix containing two axes: Axis I comprises 30 quality aspects referring to results, execution and control of hospital processes. Axis II comprises 16 quality criteria (e.g., customer satisfaction, time). The PPS displays approximately 400 relevant combinations of those quality aspects and quality criteria that help to identify quality criteria that help to identify potentials for improvement of a given hospital process. It utilises different methods for the measurement of the criteria and for the application by way of individuals or groups. Conclusions: In using the PPS, relevant potentials for improvement were identified in ten typical hospital processes. The instrument's practicability must now be examined in further studies by the financial studies by the final target group (e.g., quality or project managers, and the staff responsible for processes).", "paper_title": "Process potential screening - An instrument to improve business processes in hospitals", "paper_id": "WOS:000241149400006"}