{"auto_keywords": [{"score": 0.039411155264502985, "phrase": "spain"}, {"score": 0.029523893244781513, "phrase": "corporate_performance"}, {"score": 0.004735523479786591, "phrase": "drucker"}, {"score": 0.0047180466010458945, "phrase": "upper_echelon_theory_nonetheless"}, {"score": 0.004623083903016653, "phrase": "precious_and_reliable_parameters"}, {"score": 0.004572090447680067, "phrase": "required-level_performance"}, {"score": 0.004309434349688514, "phrase": "demographical_literature_findings"}, {"score": 0.00424615251477085, "phrase": "upper_echelon_theory"}, {"score": 0.00396530196547293, "phrase": "hierarchical_linear_regression_model"}, {"score": 0.00392153537973826, "phrase": "primary_data"}, {"score": 0.0038782499819752423, "phrase": "cnmv"}, {"score": 0.0037931018103829427, "phrase": "large_companies"}, {"score": 0.0036485497734171294, "phrase": "total_tmt"}, {"score": 0.0035750360992630975, "phrase": "company_performance"}, {"score": 0.0035552443294386443, "phrase": "demographic_constructs"}, {"score": 0.003515987733314116, "phrase": "hierarchical_linear_models"}, {"score": 0.0034771630913649544, "phrase": "longitudinal_dataset"}, {"score": 0.0034643167166413815, "phrase": "multinational_big_firms"}, {"score": 0.0033819604378220376, "phrase": "statistical_techniques"}, {"score": 0.003350807068071675, "phrase": "partial_confirmation"}, {"score": 0.00330767227452252, "phrase": "theoretical_model"}, {"score": 0.003253025502141206, "phrase": "company_size"}, {"score": 0.0032170951973445544, "phrase": "tmt_size"}, {"score": 0.003134788754000368, "phrase": "tmt's_education-level_diversity"}, {"score": 0.003117426613816668, "phrase": "negative_and_significant_impact"}, {"score": 0.003082989392827924, "phrase": "significant_effects"}, {"score": 0.003060242199084116, "phrase": "education_background_diversity"}, {"score": 0.0030152485603636633, "phrase": "accomplished_findings"}, {"score": 0.002959932880314598, "phrase": "employee's_education_level"}, {"score": 0.002857605453835429, "phrase": "industry_experience_diversity"}, {"score": 0.0028470414945459153, "phrase": "functionality_diversity"}, {"score": 0.002820801653823579, "phrase": "greater_influence"}, {"score": 0.0027948258508484237, "phrase": "tmt"}, {"score": 0.0027435203100944186, "phrase": "significant_contribution"}, {"score": 0.002713202271482679, "phrase": "three-level_hierarchical_regression_models"}, {"score": 0.0026782532800970964, "phrase": "performance_variable"}, {"score": 0.002614534850703364, "phrase": "demographic_variables"}, {"score": 0.0025665514649297885, "phrase": "entrepreneurial_purposes"}, {"score": 0.002533486696341919, "phrase": "high_performance"}, {"score": 0.0024686264379590516, "phrase": "firm_performance"}, {"score": 0.0024009703873926523, "phrase": "firm_survival"}, {"score": 0.002361267945157208, "phrase": "ambitious_purpose"}, {"score": 0.002309348366752044, "phrase": "optimums_performance_level"}, {"score": 0.0022880528191813105, "phrase": "present_study"}, {"score": 0.0022502133699402018, "phrase": "tmt_composition"}, {"score": 0.0022377394845878268, "phrase": "multi-level_theory"}, {"score": 0.0022253345930383257, "phrase": "nested_structure"}, {"score": 0.0021683462436089414, "phrase": "panel_data"}, {"score": 0.002144370659530109, "phrase": "tmt_characteristics"}, {"score": 0.0021049977753042253, "phrase": "spanish_entrepreneurial_context"}], "paper_keywords": ["Performance", " Demographic characteristics", " Top management team", " Upper echelon theory"], "paper_abstract": "Purpose - The importance of the performance of a firm and the essential role played by the management in their accomplishment has been discussed and recognised by many researchers from Drucker to Upper Echelon Theory Nonetheless, currently, anybody has been able to determine the precious and reliable parameters which let the firm achieve required-level performance. The confusion around this objective is still sufficient and the controversial has being growing widely over time, being the findings achieved contradictory insufficient imprecise and unreliable. Regarding the demographical literature findings focus on the premises previous related to Upper Echelon Theory The purpose of this paper is to go further and try to test how, not only the level, but also the diversity of constructs like top management teams (TMT)'s demographic characteristics influence the firm performance accomplished by the managers by applying a Hierarchical Linear Regression Model. Design/methodology/approach - Based on primary data from two Spanish databases - SABI, CNMV - and secondary data, a sample size of 147 TMTs in large companies from 18 industries sector with headquarters in Spain over a four years period (2004-2007) were obtained. The analysis focused on the total TMT for each firm. To test the relationship between the company performance and the demographic constructs, a more recent methodology based on hierarchical linear models (HLMs) using a longitudinal dataset of multinational big firms with headquarters in Spain was applied. Findings - After applying the statistical techniques the results show a partial confirmation of the hypotheses formulated in the theoretical model proposed. First, the analysis evidences that company size is both highly correlated with TMT size and their demographic variables in terms of diversity. Second, the HLM shows that TMT's education-level diversity has a negative and significant impact on corporate performance and no significant effects for functionality and education background diversity have been found. Based on the accomplished findings, organisations appear to be more concerned about the employee's education level rather than their education background. Moreover, the model further supports that companies seem to be more aware of industry experience diversity than functionality diversity, also confirming a greater influence of the more international experience diversity of TMT on corporate performance. Originality/value - This study offers a significant contribution not only by specifying a three-level hierarchical regression models regarding diverse approaches to measure the performance variable as dependent variable but also by considering as predictors not only the level of the demographic variables but also their diversity. This knowledge is relevant for entrepreneurial purposes since it highlights the achievement of high performance. The results allow us to explain which constructs influence the achievement of firm performance. Thus, this knowledge could be relevant to the entrepreneurs to encourage the firm survival and growth. Furthermore, focused on an ambitious purpose, it reveals the parameters needed to achieve to get the optimums performance level. Hence, the present study contributes an attempt to advance the literature on TMT composition by applying multi-level theory given the nested structure of the data set. The paper is one of few studies which apply panel data to analyse the influences of TMT characteristics on corporate performance and one of the first focused on Spanish entrepreneurial context.", "paper_title": "Top management demographic characteristics and company performance", "paper_id": "WOS:000334143500002"}