{"auto_keywords": [{"score": 0.029184684896565408, "phrase": "rover_ii"}, {"score": 0.00481495049065317, "phrase": "appropriate_handling"}, {"score": 0.0045599093158915326, "phrase": "human_beings"}, {"score": 0.004382913938427474, "phrase": "available_information"}, {"score": 0.00419195822011581, "phrase": "missing_information"}, {"score": 0.004029187256595917, "phrase": "human_decision-making"}, {"score": 0.0033879628186273625, "phrase": "context-handling_capabilities"}, {"score": 0.0033379819706003885, "phrase": "information_integration_system"}, {"score": 0.0032563083791198534, "phrase": "context_model"}, {"score": 0.003068327486877065, "phrase": "contextual_information"}, {"score": 0.002605329434787829, "phrase": "context-aware_applications"}, {"score": 0.0024916260764216752, "phrase": "situation_graph"}, {"score": 0.0024306105794630246, "phrase": "relevant_situation_information"}, {"score": 0.0022452005651385095, "phrase": "audio_and_video_support"}], "paper_keywords": ["context", " context-aware computing", " context modeling", " data and information quality", " Rover II", " M-urgency", " relevant context", " relevance filtering"], "paper_abstract": "The importance of information for the appropriate handling of any situation is well recognized. We, as human beings, use context not only to interpret available information, but also to seek additional relevant, missing information. Most information systems, which support human decision-making, process context inadequately. Moreover, when some context is considered, the structure is often so rigid that, but for very restricted applications, such systems are not usable. In order to integrate context-handling capabilities with an information integration system, we need a context model for representing context that can efficiently acquire, maintain and integrate contextual information and make it available to applications on demand. In this paper, we present such a model and describe the design of Rover II, a situation-handling platform which supports integration of context-aware applications. The system manages context by constructing a situation graph which dynamically reflects the relevant situation information. We illustrate the use of Rover II with M-Urgency, a public safety application providing audio and video support for emergency help. This system is being deployed for the University of Maryland campus community of 44 000 students, faculty and staff.", "paper_title": "Representing and Managing the Context of a Situation", "paper_id": "WOS:000307171400008"}