{"auto_keywords": [{"score": 0.04475762650789477, "phrase": "proposed_algorithm"}, {"score": 0.04182833290656605, "phrase": "image_watermarking_scheme"}, {"score": 0.015719716506582538, "phrase": "generalized_difference_expansion"}, {"score": 0.004487541157100498, "phrase": "reversible_audio_data_hiding_algorithm"}, {"score": 0.004383406949799696, "phrase": "recommended_application"}, {"score": 0.004143196873246147, "phrase": "recently_proposed_reversible_image_watermarking_scheme"}, {"score": 0.003916098498242888, "phrase": "audio_domain"}, {"score": 0.0032756158688245, "phrase": "small_modifications"}, {"score": 0.003139903872290182, "phrase": "image_pixel"}, {"score": 0.003110515172439764, "phrase": "waveform_sample"}, {"score": 0.003038237581227068, "phrase": "proposed_intelligent_partitioning_algorithm"}, {"score": 0.002967634471075658, "phrase": "audio_waveform"}, {"score": 0.002688532127821979, "phrase": "satisfactory_amount"}, {"score": 0.0025171669791790438, "phrase": "stego_audio"}, {"score": 0.0024241817763927163, "phrase": "maximum_embedding_rate"}, {"score": 0.0023346234464901978, "phrase": "input_audio"}, {"score": 0.0021049977753042253, "phrase": "audio_copyright"}], "paper_keywords": ["Audio", " Steganography", " Reversible watermarking", " Data hiding", " Waveform"], "paper_abstract": "In this paper, a generalized difference expansion based reversible audio data hiding algorithm is proposed and a recommended application is introduced. The proposed algorithm is built on top of a recently proposed reversible image watermarking scheme. The main challenges to customize an image watermarking scheme to work for audio domain are the differences between the structures of image and audio, the target of the image watermarking scheme that based on is a two-dimensional 8-bit grayscale image and the target now is a one-dimensional 16-bit quantization audio waveform. The dimension issue can be solved by small modifications, while the difference between the sizes of image pixel and waveform sample is handled by the proposed intelligent partitioning algorithm, which partition the audio waveform into two portions, so that the image watermarking scheme based on can be applied to the audio. For the proposed algorithm, satisfactory amount of data can be hidden into the audio and the quality of the stego audio is acceptable. In average, a maximum embedding rate of 34,699 bits/sec can be achieved for the input audio, and in normal meta-data tagging and authentication embedding, SegSNR values around 30 dB can be obtained. With the proposed algorithm, the application recommended is useful in protecting audio copyright.", "paper_title": "Application of a generalized difference expansion based reversible audio data hiding algorithm", "paper_id": "WOS:000351394500012"}