{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "homogeneous_models"}, {"score": 0.004527947981009528, "phrase": "challenging_problem"}, {"score": 0.00422899036681456, "phrase": "robust_numerical_methodologies"}, {"score": 0.0040591367766929344, "phrase": "important_variations"}, {"score": 0.003976775340098895, "phrase": "local_mach_number"}, {"score": 0.0038960785110831162, "phrase": "thermodynamic_phase_transition"}, {"score": 0.00332924643541238, "phrase": "possible_fluid_states"}, {"score": 0.002963830787280652, "phrase": "numerical_method"}, {"score": 0.0028641729745364952, "phrase": "mach_number"}, {"score": 0.002364777610365689, "phrase": "steady_and_unsteady_numerical_results"}, {"score": 0.002285216591220303, "phrase": "venturi_geometry"}, {"score": 0.0021932609696277937, "phrase": "experimental_data"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": [""], "paper_abstract": "The simulation of cavitating flows is a challenging problem both in terms of modelling the physics and developing robust numerical methodologies. Such flows are characterized by important variations of the local Mach number and involve thermodynamic phase transition. To simulate these flows by applying homogeneous models, an appropriate equation of state (EOS) is necessary to cover all possible fluid states (pure liquid, two-phase mixture and pure vapour). Moreover. the numerical method has to handle any Mach number accurately. This paper presents a one-fluid compressible Reynolds-Averaged Navier-Stokes (RANS) solver with a preconditioning scheme. The cavitation phenomenon is modelled by two different liquid-vapour mixture EOS. The mathematical and thermodynamic properties are studied. Steady and unsteady numerical results are given for a Venturi geometry and comparisons are made with experimental data. (C) 2009 Elsevier Ltd. All rights reserved.", "paper_title": "Numerical simulation of cavitating flows with homogeneous models", "paper_id": "WOS:000268953900002"}