{"auto_keywords": [{"score": 0.026549862759616915, "phrase": "domain-specific_language"}, {"score": 0.02606293105417704, "phrase": "application_library"}, {"score": 0.024051509811492153, "phrase": "xaml"}, {"score": 0.00481495049065317, "phrase": "general-purpose_and_domain-specific_languages"}, {"score": 0.004463958296056236, "phrase": "feasible_alternatives"}, {"score": 0.0044079880067019765, "phrase": "existing_solutions"}, {"score": 0.004325339932975582, "phrase": "programming_work"}, {"score": 0.003764603272900618, "phrase": "open_issue"}, {"score": 0.00355665081072721, "phrase": "application_libraries"}, {"score": 0.0027106334164712057, "phrase": "implementation_approaches"}, {"score": 0.0021049977753042253, "phrase": "cognitive_dimension_framework"}], "paper_keywords": ["domain-specific languages", " general-purpose languages", " program comprehension", " empirical software engineering"], "paper_abstract": "Many domain-specific languages, that try to bring feasible alternatives for existing solutions while simplifying programming work, have come up in recent years. Although, these little languages seem to be easy to use, there is an open issue whether they bring advantages in comparison to the application libraries, which are the most commonly used implementation approach. In this work, we present an experiment, which was carried out to compare such a domain-specific language with a comparable application library. The experiment was conducted with 36 programmers, who have answered a questionnaire on both implementation approaches. The questionnaire is more than 100 pages long. For a domain-specific language and the application library, the same problem domain has been used - construction of graphical user interfaces. In terms of a domain-specific language, XAML has been used and C# Forms for the application library. A cognitive dimension framework has been used for a comparison between XAML and C# Forms.", "paper_title": "Comparing General-Purpose and Domain-Specific Languages: An Empirical Study", "paper_id": "WOS:000279345700001"}