{"auto_keywords": [{"score": 0.042975504970935885, "phrase": "sd_models"}, {"score": 0.034098242543296804, "phrase": "domain_modeling_method"}, {"score": 0.00481495049065317, "phrase": "modeling_process_with"}, {"score": 0.004701015188740582, "phrase": "complex_system_dynamics"}, {"score": 0.004589763483242731, "phrase": "complex_organizational_settings"}, {"score": 0.0038195342195623764, "phrase": "domain_modeling_method_object-role"}, {"score": 0.0035687137873965684, "phrase": "domain_modeling_methods"}, {"score": 0.0034016119212097826, "phrase": "problem_domain"}, {"score": 0.00334766260508788, "phrase": "structural_view"}, {"score": 0.0031028232755683674, "phrase": "sd_model_conceptualization"}, {"score": 0.0026760974046034854, "phrase": "grounded_system_dynamics"}, {"score": 0.002326464619238653, "phrase": "identified_relations"}, {"score": 0.0022712795176156536, "phrase": "flow_diagram"}, {"score": 0.0021734768728417977, "phrase": "real-life_case"}, {"score": 0.0021561514733516676, "phrase": "national_medical_stores"}, {"score": 0.0021389678652258153, "phrase": "nms"}, {"score": 0.002105000283249765, "phrase": "uganda"}], "paper_keywords": ["System dynamics", " domain modeling", " object-role modeling"], "paper_abstract": "Defining complex system dynamics (SD) models in complex organizational settings is hard. This is so because the numbers of variables to consider are many and the question of causation is complicated to untangle. Second, SD models are ambiguous and hard to conceptualize. In this paper, we explore the use of a domain modeling method object-role modeling (ORM) in the process of developing SD models. We do so, because domain modeling methods help to identify relationships among entities within the scope of the problem domain and provide a structural view of the domain. The addition of a domain modeling method to the process of developing SD models is to improve SD model conceptualization, enable transformation and reuse of information plus underpin SD with a domain modeling method that allows creation of database. To realize this, we come up with a procedure in our overall research which we refer to as grounded system dynamics (GSD) a combination of ORM and SD. To reason about the combination of SD with a domain modeling method (ORM), we identify and evaluate relationships between their constructs. Basing on the identified relations, ORM to stock and flow diagram (SFD) steps are defined and applied to a real-life case study national medical stores (NMS) situated in Uganda. On completion, we draw conclusions.", "paper_title": "ENHANCING THE SYSTEM DYNAMICS MODELING PROCESS WITH A DOMAIN MODELING METHOD", "paper_id": "WOS:000328318800005"}