{"auto_keywords": [{"score": 0.03718034097391595, "phrase": "ndn"}, {"score": 0.00481495049065317, "phrase": "bi-directional_low-latency_communication"}, {"score": 0.004674952036988355, "phrase": "content-centric_networking"}, {"score": 0.004494570360108983, "phrase": "today's_internet_ip-style_packet-switched_host-centric_networking"}, {"score": 0.004154332348800334, "phrase": "current_internet_traffic"}, {"score": 0.003954837422946628, "phrase": "named_data_networking"}, {"score": 0.003709693561373117, "phrase": "on-going_research_effort"}, {"score": 0.003584025547693836, "phrase": "full-blown_candidate_future_internet_architecture"}, {"score": 0.003479692058963528, "phrase": "content_distribution"}, {"score": 0.00307657476125683, "phrase": "remote_login"}, {"score": 0.0030464123943266673, "phrase": "file_transfer"}, {"score": 0.0022443390559699974, "phrase": "significantly_better_throughput"}, {"score": 0.0022223176391038785, "phrase": "lower_latency"}, {"score": 0.0021363670305843403, "phrase": "routing_and_forwarding_costs"}, {"score": 0.0021049977753042253, "phrase": "proposed_approach"}], "paper_keywords": [""], "paper_abstract": "Content-Centric Networking (CCN) is an alternative to today's Internet IP-style packet-switched host-centric networking. One key feature of CCN is its focus on content distribution, which dominates current Internet traffic and which is not well-served by IP. Named Data Networking (NDN) is an instance of CCN; it is an on-going research effort aiming to design and develop a full-blown candidate future Internet architecture. Although NDN's emphasizes content distribution, it must also support other types of traffic, such as conferencing (audio, video) as well as more historical applications, such as remote login and file transfer. However, suitability of NDN for applications that are not obviously or primarily content-centric. We believe that such applications are not going away any time soon. In this paper, we explore NDN in the context of a class of applications that involve low-latency bi-directional (point-to-point) communication. Specifically, we propose a few architectural amendments to NDN that provide significantly better throughput and lower latency for this class of applications by reducing routing and forwarding costs. The proposed approach is validated via experiments.", "paper_title": "Optimizing Bi-Directional Low-Latency Communication in Named Data Networking", "paper_id": "WOS:000333736900003"}