{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "visual_attention_regions"}, {"score": 0.008616530477169457, "phrase": "real-time_clustering"}, {"score": 0.008331311328832417, "phrase": "var"}, {"score": 0.00728071853550145, "phrase": "high-level_semantics"}, {"score": 0.0068314405302952515, "phrase": "object_level"}, {"score": 0.0056423055556925495, "phrase": "hierarchical_visual_attention_regions"}, {"score": 0.004096751549280256, "phrase": "semantic_gap"}, {"score": 0.003886770770835211, "phrase": "rule_based_technique"}, {"score": 0.003673675864705682, "phrase": "var_detection"}, {"score": 0.0035514484574435574, "phrase": "proposed_technique"}, {"score": 0.002909594200388059, "phrase": "rada"}, {"score": 0.0028127163745564777, "phrase": "real_time"}, {"score": 0.0026384167183586015, "phrase": "hvar."}, {"score": 0.0025892330566358503, "phrase": "new_background_measure"}, {"score": 0.0025124343366192954, "phrase": "geometric_property"}, {"score": 0.002447101794397243, "phrase": "background_region"}, {"score": 0.002286781334850213, "phrase": "existing_techniques"}, {"score": 0.0021857667493036786, "phrase": "visual_attention_region"}, {"score": 0.0021049977753042253, "phrase": "traditional_visual_attention_regions"}], "paper_keywords": ["clustering", " knowledge extraction", " real time processing", " visual attention regions", " visualization"], "paper_abstract": "Recently, the detection of visual attention regions (VAR) is becoming more important due to its useful application in the area of multimedia. Although there exist a lot of approaches to detect visual attention regions, few of them consider the semantic gap between the visual attention regions and high-level semantics. In this paper, we propose a rule based technique for the extraction of visual attention regions at the object level based on real-time clustering, such that VAR detection can be performed in a very efficient way. The proposed technique consists of four stages: 1) a fast segmentation technique which is called the real time clustering algorithm (RTCA); 2) a refined specification of VAR which is known as the hierarchical visual attention regions (HVAR); 3) a new algorithm known as the rule based detection algorithm (RADA) to obtain the set of HVARs in real time, and 4) a new adaptive image display module and the corresponding adaptation operations using HVAR. We also define a new background measure which combines both feature contrast and the geometric property of the region to identify the background region, and a confidence factor which is used to extract the set of hierarchical visual attention regions. Compared with existing techniques, our approach has two advantages: 1) the approach detects the visual attention region at the object level, which bridges the gap between traditional visual attention regions and high-level semantics; 2) our approach is efficient and easy to implement.", "paper_title": "A rule based technique for extraction of visual attention regions based on real-time clustering", "paper_id": "WOS:000246671200009"}