{"auto_keywords": [{"score": 0.038576082979587416, "phrase": "tag_identification"}, {"score": 0.02717463666730383, "phrase": "prqt_protocol"}, {"score": 0.00481495049065317, "phrase": "parallel_responses"}, {"score": 0.004761906710691112, "phrase": "rfid"}, {"score": 0.004735519962945449, "phrase": "tag_anti-collision"}, {"score": 0.004631637679516574, "phrase": "radio_frequency_identification"}, {"score": 0.004191540451296395, "phrase": "interrogation_zone"}, {"score": 0.00396530196547293, "phrase": "backscatter_technology_report"}, {"score": 0.0034134024569847264, "phrase": "tag_collision_problem"}, {"score": 0.003265090934183249, "phrase": "tag_collisions"}, {"score": 0.002473203873496859, "phrase": "id_prefix_matching"}, {"score": 0.002140400526572388, "phrase": "related_ones"}], "paper_keywords": ["RFID", " radio frequency identification", " anti-collision", " query tree", " tag identification"], "paper_abstract": "In a radio frequency identification (RFID) system, tags can be identified by a reader when they are within the interrogation zone of the reader. Collisions occur when tags using backscatter technology report their IDs to the reader at the same carrier frequency simultaneously. The performance of tag identification is degraded by collisions, so it is important to address the tag collision problem. Several anti-collision protocols have been proposed for reducing tag collisions. They can be categorised into two classes: ALOHA-based and tree-based protocols. This paper proposes a 4-ary query tree-based anti-collision protocol, namely the parallel response query tree (PRQT) protocol, to improve the performance of tag identification. In the PRQT protocol, the tags with the ID prefix matching either the reader's request bit string or the complementary of the string are arranged to respond in two subcarriers in parallel. The PRQT protocol is analysed, simulated and compared with related ones to demonstrate its advantages.", "paper_title": "Four-ary query tree splitting with parallel responses for RFID tag anti-collision", "paper_id": "WOS:000345436400005"}