{"auto_keywords": [{"score": 0.046448599314105624, "phrase": "npd"}, {"score": 0.04199653717652151, "phrase": "operating_routines"}, {"score": 0.0209522955351465, "phrase": "dcs"}, {"score": 0.008917743631300283, "phrase": "human_resources"}, {"score": 0.005376895071833279, "phrase": "environmental_changes"}, {"score": 0.00481495049065317, "phrase": "dynamic_capabilities"}, {"score": 0.0044896599221451216, "phrase": "new_product_development"}, {"score": 0.003671338229632309, "phrase": "spanish_firms"}, {"score": 0.0035918768194006735, "phrase": "regression_analysis"}, {"score": 0.003529543381704363, "phrase": "moderating_role"}, {"score": 0.003247868216333148, "phrase": "highly_qualified_and_committed_workers"}, {"score": 0.0028731024405707277, "phrase": "unique_dc"}, {"score": 0.0027985846558073457, "phrase": "future_research"}, {"score": 0.002552628669352939, "phrase": "managerial_perceptions"}, {"score": 0.0025192983141887285, "phrase": "objective_measures"}, {"score": 0.002497319603143104, "phrase": "practical_implications"}, {"score": 0.002359046870732839, "phrase": "complementary_functional_strategies"}, {"score": 0.0022382002476510573, "phrase": "additional_outcomes"}, {"score": 0.0021049977753042253, "phrase": "complex_process"}], "paper_keywords": ["Dynamic capabilities", " Routines", " Human resources", " New product development", " Metaflexibility"], "paper_abstract": "Purpose - The purpose of this paper is to explain the outcomes and role of dynamic capabilities (DCs). To explain the outcomes, the authors study the relationship between new product development (NPD) (an example of DCs) and metaflexibility. To explain the role of DCs, the authors study how human resources and operating routines moderate the role of DCs in achieving adaptation in the firm. Design/methodology/approach - Using data from 200 managers of Spanish firms, the authors apply regression analysis to test the moderating role of human resources and operating routines in the relationship between NPD and metaflexibility. Findings - The results demonstrate that highly qualified and committed workers enhance the effectiveness of NPD, while high frequency in repetition of operating routines significantly damages such effectiveness. Research limitations/implications - This study is limited to analysing a unique DC (NPD), but future research could explore contributions on other consolidated DCs (e.g. alliance management capability) and compare results. Also, the database on managerial perceptions rather than objective measures. Practical implications - Managers who must address environmental changes should connect generation of DCs to complementary functional strategies, especially human resources strategy. Originality/value - This paper suggests additional outcomes derived from DCs, such as metaflexibility. It attempts to understand the complex process by which DCs interact to modify operating routines in order to respond to environmental changes.", "paper_title": "Dynamic capabilities, human resources and operating routines A new product development approach", "paper_id": "WOS:000369166000002"}