{"auto_keywords": [{"score": 0.043528350819261416, "phrase": "program_assertions"}, {"score": 0.024878493288664927, "phrase": "new_semantics"}, {"score": 0.00481495049065317, "phrase": "verifying_compiler"}, {"score": 0.004571359100381179, "phrase": "vc"}, {"score": 0.0036095259108028105, "phrase": "targeted_vc_customers"}, {"score": 0.003410479630045025, "phrase": "practitioners'_needs"}, {"score": 0.003378385493203297, "phrase": "current_technological_factors"}, {"score": 0.0032376465741070274, "phrase": "adjusted_definition"}, {"score": 0.003207173639414978, "phrase": "assertion_validity"}, {"score": 0.0031619994642255846, "phrase": "user_expectations"}, {"score": 0.0030590445140753213, "phrase": "current_prover_technology"}, {"score": 0.0027307746993761035, "phrase": "fundamental_software_engineering_techniques"}, {"score": 0.0026922926476971453, "phrase": "primary_stakeholders"}, {"score": 0.0024842242921857705, "phrase": "semantics_stakeholders"}, {"score": 0.002449208093757498, "phrase": "standard_tools"}, {"score": 0.0021049977753042253, "phrase": "previously_indiscernible_specification_errors"}], "paper_keywords": ["Software verification", " assertions", " programming by contract", " logics of programs", " requirements engineering"], "paper_abstract": "The Verifying Compiler ( VC) project is a core component of the Dependable Systems Evolution Grand Challenge. The VC offers the promise of automatically proving that a program or component is correct, where correctness is defined by program assertions. While several VC prototypes exist, all adopt a semantics for assertions that is unsound. This paper presents a consolidation of VC requirements analysis ( RA) activities that, in particular, brought us to ask targeted VC customers what kind of semantics they wanted. Taking into account both practitioners' needs and current technological factors, we offer recovery of soundness through an adjusted definition of assertion validity that matches user expectations and can be implemented practically using current prover technology. For decades, there have been debates concerning the most appropriate semantics for program assertions. Our contribution here is unique in that we have applied fundamental software engineering techniques by asking primary stakeholders what they want and, based on this, proposed a means of efficiently realizing the semantics stakeholders want using standard tools and techniques. We describe how support for the new semantics has been added to ESC/Java2, one of the most fully developed VC prototypes. Case studies demonstrate the effectiveness of the new semantics at uncovering previously indiscernible specification errors.", "paper_title": "Engineering a Sound Assertion Semantics for the Verifying Compiler", "paper_id": "WOS:000276032300010"}