{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "compounded_sterile_products"}, {"score": 0.027127697248555627, "phrase": "optimal_number"}, {"score": 0.004735595418391602, "phrase": "hospital_pharmacy_departments"}, {"score": 0.004441517985511521, "phrase": "even_a_day's_worth"}, {"score": 0.004265760046406154, "phrase": "considerable_amount"}, {"score": 0.004185463886003309, "phrase": "pharmacy_department"}, {"score": 0.004126231101653771, "phrase": "csp_medication"}, {"score": 0.003752126270661821, "phrase": "wasted_doses"}, {"score": 0.0036553070575015344, "phrase": "prepared_medication"}, {"score": 0.0035189057079817285, "phrase": "classic_batching_problem"}, {"score": 0.0033158631749937674, "phrase": "holding_cost"}, {"score": 0.003261133560558666, "phrase": "csp_medications"}, {"score": 0.0031769434359761304, "phrase": "order_cancellations"}, {"score": 0.0030007010513605084, "phrase": "setup_cost"}, {"score": 0.002874947099733361, "phrase": "different_times"}, {"score": 0.0028409576481842457, "phrase": "previous_work"}, {"score": 0.002794044560633716, "phrase": "multiple_batches"}, {"score": 0.002715412462132954, "phrase": "mathematically_rigorous_manner"}, {"score": 0.0026202187680903063, "phrase": "considerable_literature"}, {"score": 0.0025103699913760057, "phrase": "integer_programming_problem"}, {"score": 0.002445514186654732, "phrase": "setups_costs"}, {"score": 0.002337403139264533, "phrase": "dynamic_programming_methodology"}, {"score": 0.0023207743740062776, "phrase": "optimization_problem"}, {"score": 0.0022447206386952126, "phrase": "pharmacy_manager"}, {"score": 0.0022287497627555895, "phrase": "rational_decisions"}, {"score": 0.002191923917970654, "phrase": "csp_production_batches"}, {"score": 0.002171153824638682, "phrase": "specific_patterns"}, {"score": 0.002150580119047236, "phrase": "work_practices"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Hospital pharmacy batch operations", " EOQ with time-varying costs", " Batching operations"], "paper_abstract": "Hospital pharmacy departments have traditionally batched the production of a category of medications called Compounded Sterile Products (CSP). Since the batches are intended to satisfy several hours, or even a day's worth of demand, the cancellation of orders by physicians can lead to the waste of a considerable amount of medication. The manager of the pharmacy department can choose to produce the CSP medication in one or more batches per day. In making this decision the manager is trading off two sorts of costs: (a) the \"holding cost\" of carrying inventory, which in this context is largely the cost of wasted doses, and (b) the \"set up cost\" of the labor for delivering the prepared medication to the various units of a hospital. Although this trade-off superficially resembles that of a classic batching problem, it turns out to be quite different. This is primarily because the sequence of batches must repeat in a 24-hour cycle and the holding cost, related to the waste of CSP medications, varies over the 24-hour cycle according to the pattern of order cancellations, which in turn depends on the schedule of physicians' reevaluating the treatments of patients under their care. In addition, the setup cost, related to the cost of the delivery, varies slightly with the cost of labor at different times of the day. While previous work has looked at the benefits of multiple batches per day, the problem has not been addressed in a mathematically rigorous manner. The contribution of this work is twofold. Firstly, it extends the considerable literature on lot sizing by introducing a formulation for deciding the optimal number and timing of batches as an integer programming problem that caters for, and minimizes, the novel forms of holding and setups costs described above. In doing so the inventory curves over time are modeled precisely. Secondly, a dynamic programming methodology for the optimization problem is developed that is solvable with just a few minutes of computing time. Thus the pharmacy manager can make rational decisions about the optimal number and timing of CSP production batches based on the specific patterns of costs and work practices found in his or her hospital. (C) 2015 Elsevier B.V. All rights reserved.", "paper_title": "Optimizing the timing and number of batches for compounded sterile products in an in-hospital pharmacy", "paper_id": "WOS:000358631600007"}