{"auto_keywords": [{"score": 0.04549081542587916, "phrase": "citation_frequency"}, {"score": 0.00904434069673026, "phrase": "cited_patents"}, {"score": 0.00481495049065317, "phrase": "patent's_citation_frequency"}, {"score": 0.004642292792558686, "phrase": "japanese_patents"}, {"score": 0.004315249628884236, "phrase": "\"academic_papers"}, {"score": 0.003956558420993431, "phrase": "statistical_analysis"}, {"score": 0.0038849148160362257, "phrase": "regression_analysis"}, {"score": 0.0036944890904337833, "phrase": "technological_bases"}, {"score": 0.003611034322786669, "phrase": "important_patent"}, {"score": 0.003356396922662246, "phrase": "cited_patents'_classifications"}, {"score": 0.0030491497463386924, "phrase": "multiple_linear"}, {"score": 0.0029396242707327986, "phrase": "negative_binomial_regression_analyses"}, {"score": 0.0028470123663391126, "phrase": "significant_positive_correlations"}, {"score": 0.002610043728801011, "phrase": "multiple_regression_analyses"}, {"score": 0.0021834945657804193, "phrase": "backward_citations"}, {"score": 0.0021049977753042253, "phrase": "forward_citations"}], "paper_keywords": ["Patent citation", " Citation frequency", " Regression analysis", " Japan"], "paper_abstract": "Although many studies have been conducted to clarify the factors that affect the citation frequency of \"academic papers,\" there are few studies where the citation frequency of \"patents\" has been predicted on the basis of statistical analysis, such as regression analysis. Assuming that a patent based on a variety of technological bases tends to be an important patent that is cited more often, this study examines the influence of the number of cited patents' classifications and compares it with other factors, such as the numbers of inventors, classifications, pages, and claims. Multiple linear, logistic, and zero-inflated negative binomial regression analyses using these factors are performed. Significant positive correlations between the number of classifications of cited patents and the citation frequency are observed for all the models. Moreover, the multiple regression analyses demonstrate that the number of classifications of cited patents contributes more to the regression than do other factors. This implies that, if confounding between factors is taken into account, it is the diversity of classifications assigned to backward citations that more largely influences the number of forward citations.", "paper_title": "Multiple regression analysis of a patent's citation frequency and quantitative characteristics: the case of Japanese patents", "paper_id": "WOS:000320401500023"}