{"auto_keywords": [{"score": 0.04123927882098529, "phrase": "schema_mappings"}, {"score": 0.010612387000973441, "phrase": "rdf_data"}, {"score": 0.0105272737544201, "phrase": "exchange_samples"}, {"score": 0.004281284532043714, "phrase": "common_purpose"}, {"score": 0.004045157344249484, "phrase": "complex_integration_tasks"}, {"score": 0.0035965032173588753, "phrase": "data_models"}, {"score": 0.0028081546657056948, "phrase": "user_intervention"}, {"score": 0.0026103363762901423, "phrase": "mostodex"}, {"score": 0.0024761702541879213, "phrase": "single_exchange_sample"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Data exchange", " RDF", " Schema mappings"], "paper_abstract": "The Web is evolving into a Web of Data in which RDF data are becoming pervasive, and it is organised into datasets that share a common purpose but have been developed in isolation. This motivates the need to devise complex integration tasks, which are usually performed using schema mappings; generating them automatically is appealing to relieve users from the burden of handcrafting them. Many tools are based on the data models to be integrated: classes, properties, and constraints. Unfortunately, many data models in the Web of Data comprise very few or no constraints at all, so relying on constraints to generate schema mappings is not appealing. Other tools rely on handcrafting the schema mappings, which is not appealing at all. A few other tools rely on exchange samples but require user intervention, or are hybrid and require constraints to be available. In this article, we present MostoDEx, a tool to generate schema mappings between two RDF datasets. It uses a single exchange sample and a set of correspondences, but does not require any constraints to be available or any user intervention. We validated and evaluated MostoDEx using many experiments that prove its effectiveness and efficiency in practice. (C) 2014 Elsevier Inc. All rights reserved.", "paper_title": "MostoDEx: A tool to exchange RDF data using exchange samples", "paper_id": "WOS:000347739200006"}