{"auto_keywords": [{"score": 0.04589323623988377, "phrase": "turnaround_time"}, {"score": 0.039455174318622464, "phrase": "operation_cycles"}, {"score": 0.00481495049065317, "phrase": "dual-cycle_operations"}, {"score": 0.00469445816161498, "phrase": "container_terminals"}, {"score": 0.004623608221548592, "phrase": "important_objective"}, {"score": 0.004285010985001827, "phrase": "operation_schedule"}, {"score": 0.004241771072194993, "phrase": "quay_cranes"}, {"score": 0.00395101799538683, "phrase": "dual_cycling_techniques"}, {"score": 0.0036614948691735105, "phrase": "advanced_container_terminals"}, {"score": 0.0031284221314354065, "phrase": "dual_cycle_operations"}, {"score": 0.0030500051941781034, "phrase": "qc_scheduling_problems"}, {"score": 0.002271725588755076, "phrase": "effective_local_search_method"}, {"score": 0.002203509076886664, "phrase": "real_cases"}, {"score": 0.0021049977753042253, "phrase": "proposed_approach"}], "paper_keywords": ["Dual cycling", " Quay crane scheduling", " Container terminals"], "paper_abstract": "An important objective of all schedules in a port is to minimize turnaround time of vessels. An operation schedule for Quay Cranes (QCs) can significantly affect the turnaround time of a vessel. Recently dual cycling techniques have already been used for reducing the number of operation cycles of QCs in some advanced container terminals. This study attempts to minimize the number of operation cycles of a QC for discharging and loading containers in a ship-bay, which is equivalent to maximizing the number of dual cycle operations. A formulation in QC scheduling problems is proposed its a mixed integer programming model. A hybrid heuristic approach is proposed to solve this model. The algorithm applied in this study takes two types of sequencing into account, i.e. inter-stage sequencing (batch sequencing) and intra-stage sequencing (stack sequencing in the same hatch). This approach hybridizes a certain reconstructive Johnson's rule with all effective local search method. Finally, certain data in real cases are used to evaluate the effectiveness of the proposed approach. (C) 2008 Elsevier Ltd. All rights reserved.", "paper_title": "Maximizing the number of dual-cycle operations of quay cranes in container terminals", "paper_id": "WOS:000264463500014"}