{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "deeper_understanding"}, {"score": 0.004492406361795448, "phrase": "multilevel_perspective"}, {"score": 0.004415189385015778, "phrase": "cross-level_modeling"}, {"score": 0.004119314544478931, "phrase": "rtc"}, {"score": 0.0034233569308012982, "phrase": "new_it_initiative"}, {"score": 0.0032496585171039797, "phrase": "\"maverick_effect"}, {"score": 0.0031937337757356526, "phrase": "pro-initiative_employees"}, {"score": 0.00270023138867066, "phrase": "novel_interactionist_perspective"}, {"score": 0.002623184850933423, "phrase": "employee_dispositions"}, {"score": 0.002518989593177879, "phrase": "workplace_climate"}, {"score": 0.0022828113789751694, "phrase": "change_management_practices"}, {"score": 0.0022305310659333864, "phrase": "multilevel_interactions"}, {"score": 0.0021921063460682293, "phrase": "personal_and_contextual_influences"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Multilevel", " IT adoption", " Change"], "paper_abstract": "This study adopts a multilevel perspective and uses cross-level modeling to explore how resistance to change (RTC) influences information technology (IT) adoption behaviors. RTC is conceptualized at two levels of analysis (personal and contextual) and with two levels of specificity (distal and proximal). Data were collected from 258 employees within 25 administrative work units undergoing a new IT initiative. The findings from this study reveal a \"maverick effect\" wherein pro-initiative employees react in contrast to their workplace contexts. They champion IT adoption when their work units resist the IT initiative and prolong IT adoption when their work units readily embrace the IT initiative. This study introduces a novel interactionist perspective on IT adoption that considers employee dispositions and perceptions, as well as workplace climate and culture, as enablers and inhibitors of IT adoption. Moreover, the study advocates for change management practices that account for multilevel interactions among the personal and contextual influences of IT adoption. Published by Elsevier B.V.", "paper_title": "Toward a deeper understanding of IT adoption: A multilevel analysis", "paper_id": "WOS:000336703500009"}