{"auto_keywords": [{"score": 0.037978447861366435, "phrase": "physical_features"}, {"score": 0.004708152527097594, "phrase": "users'_physical_environments"}, {"score": 0.0046382670208947605, "phrase": "interaction_tools"}, {"score": 0.0046037124365759215, "phrase": "cognitive_feedback_cues"}, {"score": 0.004451360793577698, "phrase": "efficient_interaction"}, {"score": 0.004418192459607072, "phrase": "virtual_environments"}, {"score": 0.004161553532799662, "phrase": "large_immersive_display_system"}, {"score": 0.00399378014373321, "phrase": "disturbing_interactions"}, {"score": 0.003876010646939676, "phrase": "hardware_parts"}, {"score": 0.0034773669221269594, "phrase": "system_hardware"}, {"score": 0.003214455466823939, "phrase": "distant_users"}, {"score": 0.0030963190575539574, "phrase": "physical_limitations"}, {"score": 0.0028090313440881937, "phrase": "user's_physical_environment"}, {"score": 0.002685558057339722, "phrase": "collaborative_navigation_task"}, {"score": 0.002655544981260646, "phrase": "ve."}, {"score": 0.00250103550267459, "phrase": "asymmetrical_collaborative_configurations"}, {"score": 0.0022945073938622287, "phrase": "shared_ve."}], "paper_keywords": ["3D Collaborative virtual environments", " Awareness of collaboration", " Perception of the physical workspaces of the users"], "paper_abstract": "The feeling of presence is essential for efficient interaction within Virtual Environments (VEs). When a user is fully immersed within a VE through a large immersive display system, his/her feeling of presence can be altered because of disturbing interactions with his/her physical environment, such as collision with hardware parts of the system or loss of tracking. This alteration can be avoided by taking into account the physical features of the user as well as those of the system hardware and embedding them in the VE. Moreover, the 3D abstract representation of these physical features can also be useful for collaboration between distant users because they can make a user aware of the physical limitations of the others he/she is collaborating with. In this paper we present how we use the Immersive Interactive Virtual Cabin (IIVC) model to obtain this virtual representation of the user's physical environment and we illustrate how this representation can be used in a collaborative navigation task in a VE. We also present how we can add 3D representations of 2D interaction tools in order to cope with asymmetrical collaborative configurations, providing 3D cues for a user to understand the actions of the others even if he/she is not fully immersed in the shared VE. Last, we briefly explain how we plan to enhance 3D interaction and collaboration by embedding a symbolic 3D user representation that will give 3D information about his/her posture.", "paper_title": "Improving awareness for 3D virtual collaboration by embedding the features of users' physical environments and by augmenting interaction tools with cognitive feedback cues", "paper_id": "WOS:000337754000008"}