{"auto_keywords": [{"score": 0.030385526539102568, "phrase": "mas"}, {"score": 0.00481495049065317, "phrase": "case-based_argumentation"}, {"score": 0.004740009255053372, "phrase": "open_multi-agent_systems"}, {"score": 0.0043367547691560175, "phrase": "dependency_relations"}, {"score": 0.0036680857629458816, "phrase": "powerful_technique"}, {"score": 0.0034628156490003775, "phrase": "social_context"}, {"score": 0.0030538300202383106, "phrase": "computational_representation"}, {"score": 0.0030220049006970317, "phrase": "argumentation_frameworks"}, {"score": 0.002808298910480358, "phrase": "participating_software_agents"}, {"score": 0.0025960262223338293, "phrase": "agents'_social_context"}, {"score": 0.002476424729269258, "phrase": "case-based_argumentation_framework"}, {"score": 0.0022299587520401747, "phrase": "real_domain"}, {"score": 0.0021049977753042253, "phrase": "call_centre"}], "paper_keywords": ["Agreement technologies", " Argumentation", " Multi-agent systems"], "paper_abstract": "In open multi-agent systems, agents can enter or leave the system, interact, form societies, and have dependency relations with each other. In these systems, when agents have to collaborate or coordinate their activities to achieve their objectives, their different interests and preferences can come into conflict. Argumentation is a powerful technique to harmonise these conflicts. However, in many situations the social context of agents determines the way in which agents can argue to reach agreements. In this paper, we advance research in the computational representation of argumentation frameworks by proposing a new ontological-based, knowledge-representation formalism for the design of open MAS in which the participating software agents are able to manage and exchange arguments with each other taking into account the agents' social context. This formalism is the core of a case-based argumentation framework for agent societies. In addition, we present an example of the performance of the formalism in a real domain that manages the requests received by the technicians of a call centre.", "paper_title": "An ontological-based knowledge-representation formalism for case-based argumentation", "paper_id": "WOS:000358664600006"}