{"auto_keywords": [{"score": 0.004032118497047498, "phrase": "first_isolated_pentagon_ns-fullerene"}, {"score": 0.0036553070575015344, "phrase": "force-field_optimization"}, {"score": 0.003604421041893448, "phrase": "recently_introduced_program"}, {"score": 0.0035876915987003988, "phrase": "fullerene"}, {"score": 0.0035376693476114733, "phrase": "obtained_structures"}, {"score": 0.0034238045290210534, "phrase": "density_functional_level"}, {"score": 0.0031919592786945126, "phrase": "hexagons_results"}, {"score": 0.0031475032122226, "phrase": "higher_stability"}, {"score": 0.0029343128039167185, "phrase": "lower_stability"}, {"score": 0.002479579797152119, "phrase": "halma_transforms"}, {"score": 0.0023551955270737215, "phrase": "similar_result"}, {"score": 0.0022686625017583387, "phrase": "related_leapfrog_transformation"}, {"score": 0.002195552442011313, "phrase": "first_known_ns-fullerene"}, {"score": 0.0021049977753042253, "phrase": "halma_transform"}], "paper_keywords": [""], "paper_abstract": "The structure and properties of the three smallest nonface-spiral (NS) fullerenes NS-T-C-380, NS-D-3-C-384, NS-D-3-C-440, and the first isolated pentagon NS-fullerene, NS-D-3-C-672, are investigated in detail. They are constructed by either a generalized face-spiral algorithm or by vertex insertions followed by a force-field optimization using the recently introduced program Fullerene. The obtained structures were then further optimized at the density functional level of theory and their stability analyzed with reference to I-h-C-60. The large number of hexagons results in a higher stability of the NS-fullerenes compared to C-60, but, as expected, in a lower stability than most stable isomers. None of the many investigated halma transforms on nonspiral fullerenes, NS-T-C-380, NS-D-3-C-384, NS-D-3-C-440, and NS-D-3-C-672, admit any spirals, and we conjecture that all halma transforms of NS-fullerenes belong to the class of NS-fullerenes. A similar result was found to not hold for the related leapfrog transformation. We also show that the first known NS-fullerene with isolated pentagons, NS-D-3-C-672, is a halma transform of D-3-C-168.", "paper_title": "Structure and Properties of the Nonface-Spiral Fullerenes T-C-380, D-3-C-384, D-3-C-440, and D-3-C-672 and Their Halma and Leapfrog Transforms", "paper_id": "WOS:000330542800013"}