{"auto_keywords": [{"score": 0.044953211211659044, "phrase": "ti"}, {"score": 0.00481495049065317, "phrase": "traditional_chemical_intermediary_roles"}, {"score": 0.0046269981365987915, "phrase": "multi-billion_dollar_business"}, {"score": 0.004358676214574977, "phrase": "future_roles"}, {"score": 0.004329835888760592, "phrase": "traditional_intermediaries"}, {"score": 0.004202387892988509, "phrase": "research_paper"}, {"score": 0.003854809457075099, "phrase": "chemical_distributors"}, {"score": 0.00367967106192446, "phrase": "future_survival"}, {"score": 0.003595097948724078, "phrase": "international_data"}, {"score": 0.0034545974376846687, "phrase": "content_analysis"}, {"score": 0.003426523537000119, "phrase": "chemical_industry"}, {"score": 0.003386412845243943, "phrase": "survey_questionnaires"}, {"score": 0.003286642683771891, "phrase": "cross-sectional_approach"}, {"score": 0.0031164532805849432, "phrase": "chemical_supply_chain_management"}, {"score": 0.002925728709297618, "phrase": "supplier-buyer_relationships"}, {"score": 0.002746644177161797, "phrase": "newer_business_models"}, {"score": 0.002587081502365341, "phrase": "valuable_implications"}, {"score": 0.0024776238724770524, "phrase": "view_building"}, {"score": 0.0024693979425773993, "phrase": "new_competences"}, {"score": 0.0022348937352254343, "phrase": "new_knowledge"}, {"score": 0.0021474369836979048, "phrase": "chemical_distribution_channels"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Disintermediation", " e-B2B exchanges", " Chemical industry", " Supply chain management"], "paper_abstract": "The traditional chemical distribution industry is a multi-billion dollar business and with the introduction of Electronic Business-to-Business (e-B2B) exchanges to the global chemical industry there is some concern about the future roles of traditional intermediaries (TI). The objectives of this research paper are to investigate the possibility of disintermediation of roles of TI by e-B2B exchanges and to identify the value adding role of TI as perceived by chemical distributors and buyers. If these value adding roles may be the key to future survival for TI in the marketplace. International data collected from e-B2B exchanges, chemical distributors and buyers are used. Content analysis of e-B2B exchanges was conducted while survey questionnaires were used for distributors and buyers using a cross-sectional approach. The research shows that whilst the e-B2B exchanges have a role to play in the chemical supply chain management there were still sub-functions which the buyers viewed that the TI could offer to them. So the supplier-buyer relationships could be maintained between the buyers and the TI, at least for the time being, until newer business models of e-B2B exchanges begins to compete with the TI's to offer these sub-functions. The research holds valuable implications for TI in the chemical industry regarding the need for differentiation with a view building new competences to survive the encroachment of their traditional business base by e-B2B exchanges. The impact of e-B2B exchanges on TI in the chemical industry has not previously been studied in-depth. This paper provides new knowledge and makes a contribution by providing evidence of evolution in the chemical distribution channels. (C) 2010 Elsevier B.V. All rights reserved.", "paper_title": "Disintermediation of traditional chemical intermediary roles in the Electronic Business-to-Business (e-B2B) exchange world", "paper_id": "WOS:000296595500002"}