{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "robust_face_recognition"}, {"score": 0.0073155553051348675, "phrase": "non-sparse_solution"}, {"score": 0.004625164125506718, "phrase": "sparse_representation"}, {"score": 0.0038946650372062783, "phrase": "larger_feature_dimensionality"}, {"score": 0.00385214804128572, "phrase": "pixel_space"}, {"score": 0.003700170452390401, "phrase": "standard_rsr_model"}, {"score": 0.0035934073774126856, "phrase": "identity_matrix"}, {"score": 0.0035025108234594668, "phrase": "face_images"}, {"score": 0.003303259489028193, "phrase": "rsr_model"}, {"score": 0.0030476078950483158, "phrase": "expanded_noise_bases"}, {"score": 0.002863652837038965, "phrase": "experimental_results"}, {"score": 0.002780958897911242, "phrase": "recognition_rates"}, {"score": 0.0026035011274172753, "phrase": "small_feature_dimensionality"}, {"score": 0.0025468951021098717, "phrase": "real_systems"}, {"score": 0.0024284249875593253, "phrase": "approximation_problem"}, {"score": 0.0024106932919085097, "phrase": "raw_pixel_space"}, {"score": 0.002120485727210402, "phrase": "important_role"}, {"score": 0.002105079170391168, "phrase": "sr"}], "paper_keywords": [""], "paper_abstract": "Since sparse representation (SR) was first introduced into robust face recognition, the argument has lasted for several years about whether sparsity can improve robust face recognition or not. Some work argued that the robust sparse representation (RSR) model has a similar recognition rate as non-sparse solution, while it needs a much higher computational cost due to the larger feature dimensionality in the pixel space. In this study, the authors reveal that the standard RSR model, which expands the dictionary with the identity matrix to reconstruct corruption or occlusion in face images, is essentially a non-sparse solution with a relatively large residual. The reason why the RSR model underperforms may be its inappropriately expanded bases rather than the sparsity itself. Thereby, this study proposes to design a dictionary with an expanded noise bases set which can precisely reconstructs any corruption or occlusion in face images in a subspace. Experimental results show that the algorithm can greatly improve recognition rates for robust face recognition. In addition, the algorithm can be simply performed in a subspace with a small feature dimensionality, thus efficient enough for real systems. This study makes us come to the conclusion that solving the approximation problem in raw pixel space is not necessary for robust face recognition, while solving in a subspace with a much smaller feature dimensionality is enough when the dictionary is well expanded. Finally, this study also confirms that the sparsity plays an important role in SR based classification.", "paper_title": "Expanding dictionary for robust face recognition: pixel is not necessary while sparsity is", "paper_id": "WOS:000361362400004"}