{"auto_keywords": [{"score": 0.03756970211925783, "phrase": "coherent_gene_clusters"}, {"score": 0.00481495049065317, "phrase": "gene-sample-time_microarray_data"}, {"score": 0.004600228893803583, "phrase": "extensive_studies"}, {"score": 0.004507882471601552, "phrase": "mining_microarray_data_sets"}, {"score": 0.00441738161338662, "phrase": "bioinformatics_research"}, {"score": 0.00437281181878921, "phrase": "biomedical_applications"}, {"score": 0.004177724522109952, "phrase": "novel_type"}, {"score": 0.003991305899593133, "phrase": "expression_levels"}, {"score": 0.0037555742428544096, "phrase": "time_points"}, {"score": 0.0031125795874844438, "phrase": "time_series"}, {"score": 0.002797757576619329, "phrase": "candidate_genes"}, {"score": 0.0024516267507109753, "phrase": "complete_set"}, {"score": 0.002271725588755076, "phrase": "synthetic_data_sets"}, {"score": 0.002237357942660354, "phrase": "test_results"}, {"score": 0.0021049977753042253, "phrase": "meaningful_coherent_gene_clusters"}], "paper_keywords": ["bioinformatics", " clustering", " microarray data"], "paper_abstract": "Extensive studies have shown that mining microarray data sets is important in bioinformatics research and biomedical applications. In this paper, we explore a novel type of gene-sample-time microarray data sets that records the expression levels of various genes under a set of samples during a series of time points. In particular, we propose the mining of coherent gene clusters from such data sets. Each cluster contains a subset of genes and a subset of samples such that the genes are coherent on the samples along the time series. The coherent gene clusters may identify the samples corresponding to some phenotypes (e.g., diseases), and suggest the candidate genes correlated to the phenotypes. We present two efficient algorithms, namely the Sample-Gene Search and the Gene-Sample Search, to mine the complete set of coherent gene clusters. We empirically evaluate the performance of our approaches on both a real microarray data set and synthetic data sets. The test results have shown that our approaches are both efficient and effective to find meaningful coherent gene clusters.", "paper_title": "Mining gene-sample-time microarray data: a coherent gene cluster discovery approach", "paper_id": "WOS:000250979800002"}