{"auto_keywords": [{"score": 0.05007848702263348, "phrase": "energy_consumption"}, {"score": 0.033533716784006504, "phrase": "cbrp"}, {"score": 0.015225779691996039, "phrase": "light-weight_mobile_devices"}, {"score": 0.014606456387240481, "phrase": "mobile_ad_hoc_networks"}, {"score": 0.009031339941053537, "phrase": "egcbrp"}, {"score": 0.004753194996637899, "phrase": "routing_protocol"}, {"score": 0.004190904630161064, "phrase": "service_discovery"}, {"score": 0.004137119737646718, "phrase": "ad_hoc_networks"}, {"score": 0.0038409323908446297, "phrase": "available_energy"}, {"score": 0.0035658739518719907, "phrase": "existing_protocols"}, {"score": 0.0034748763852150465, "phrase": "distance_vector"}, {"score": 0.0032155369606336206, "phrase": "energy_usage"}, {"score": 0.0029183300121987422, "phrase": "inter-cluster_gateway_nodes"}, {"score": 0.002862260172272785, "phrase": "based_routing_protocol"}, {"score": 0.0026570998719084153, "phrase": "cluster_heads"}, {"score": 0.0025642311494861797, "phrase": "maximum_available_energy_level"}, {"score": 0.0025394700487126414, "phrase": "load_balancing"}, {"score": 0.0025230952890994236, "phrase": "inter-cluster_traffic"}, {"score": 0.002466608618694819, "phrase": "sleep_state"}, {"score": 0.002450702522633428, "phrase": "gateway_nodes"}, {"score": 0.002357391911165024, "phrase": "energy_efficient_cluster_based_routing_protocol"}, {"score": 0.002304606411453748, "phrase": "egcbrp_sleep_state_concept"}, {"score": 0.0022823466001223986, "phrase": "idle_member_nodes"}, {"score": 0.002253000188119187, "phrase": "active_nodes"}, {"score": 0.0022096849931961247, "phrase": "experiment_results"}, {"score": 0.0021601997088758957, "phrase": "overall_energy_consumption"}, {"score": 0.0021049977753042253, "phrase": "eecbrp"}], "paper_keywords": ["energy consumption", " MANETs", " CBRP"], "paper_abstract": "The usage of light-weight mobile devices is increasing rapidly, leading to demand for more telecommunication services. Consequently, mobile ad hoc networks and their applications have become feasible with the proliferation of light-weight mobile devices. Many protocols have been developed to handle service discovery and routing in ad hoc networks. However, the majority of them did not consider one critical aspect of this type of network, which is the limited of available energy in each node. Cluster Based Routing Protocol (CBRP) is a robust/scalable routing protocol for Mobile Ad hoc Networks (MANETs) and superior to existing protocols such as Ad hoc On-demand Distance Vector (AODV) in terms of throughput and overhead. Therefore, based on this strength, methods to increase the efficiency of energy usage are incorporated into CBRP in this work. In order to increase the stability (in term of life-time) of the network and to decrease the energy consumption of inter-cluster gateway nodes, an Enhanced Gateway Cluster Based Routing Protocol (EGCBRP) is proposed. Three methods have been introduced by EGCBRP as enhancements to the CBRP: improving the election of cluster Heads (CHs) in CBRP which is based on the maximum available energy level, implementing load balancing for inter-cluster traffic using multiple gateways, and implementing sleep state for gateway nodes to further save the energy. Furthermore, we propose an Energy Efficient Cluster Based Routing Protocol (EECBRP) which extends the EGCBRP sleep state concept into all idle member nodes, excluding the active nodes in all clusters. The experiment results show that the EGCBRP decreases the overall energy consumption of the gateway nodes up to 10% and the EECBRP reduces the energy consumption of the member nodes up to 60%, both of which in turn contribute to stabilizing the network.", "paper_title": "Management of Energy Consumption on Cluster Based Routing Protocol for MANET", "paper_id": "WOS:000276759500019"}