{"auto_keywords": [{"score": 0.04614264376682892, "phrase": "semantic_types"}, {"score": 0.018627754076750266, "phrase": "umls_editors"}, {"score": 0.00749056345936498, "phrase": "umls"}, {"score": 0.0067878402259882445, "phrase": "erroneous_semantic_type_assignments"}, {"score": 0.00481495049065317, "phrase": "multiple_umls_semantic_type_assignments"}, {"score": 0.0047363569540686936, "phrase": "new_concepts"}, {"score": 0.004276794599014972, "phrase": "rare_combinations"}, {"score": 0.003938740137673181, "phrase": "computational_system"}, {"score": 0.00383628868871796, "phrase": "specific_combination"}, {"score": 0.0036034816680872877, "phrase": "exclusion_instructions"}, {"score": 0.0035680320746705064, "phrase": "umls_semantic_network_documentation"}, {"score": 0.0035329299834730467, "phrase": "corresponding_rule-categories"}, {"score": 0.003452357563167821, "phrase": "umls_concept_content"}, {"score": 0.003384754649268796, "phrase": "algorithm_adviseeditor"}, {"score": 0.0030059656149799122, "phrase": "eight_rule-categories"}, {"score": 0.00295681206994471, "phrase": "web-based_system"}, {"score": 0.00289888453546698, "phrase": "adviseeditor_algorithm"}, {"score": 0.0028420886366761094, "phrase": "input_combination"}, {"score": 0.002651901053070293, "phrase": "semantic_type_pairs"}, {"score": 0.0025828350676150354, "phrase": "interesting_examples"}, {"score": 0.0025072781579598157, "phrase": "semantic_type_assignments"}, {"score": 0.002441969502075509, "phrase": "recently_introduced_ones"}, {"score": 0.002402016201299179, "phrase": "adviseeditor_system"}, {"score": 0.002386218074955624, "phrase": "explicit_and_implicit_knowledge"}, {"score": 0.002263508433567761, "phrase": "desired_combination"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["UMLS", " Semantic Network", " Metathesaurus", " UMLS editing", " Semantic type definitions", " Concept Insertion"], "paper_abstract": "Background: When new concepts are inserted into the UMLS, they are assigned one or several semantic types from the UMLS Semantic Network by the UMLS editors. However, not every combination of semantic types is permissible. It was observed that many concepts with rare combinations of semantic types have erroneous semantic type assignments or prohibited combinations of semantic types. The correction of such errors is resource-intensive. Objective: We design a computational system to inform UMLS editors as to whether a specific combination of two, three, four, or five semantic types is permissible or prohibited or questionable. Methods: We identify a set of inclusion and exclusion instructions in the UMLS Semantic Network documentation and derive corresponding rule-categories as well as rule-categories from the UMLS concept content. We then design an algorithm adviseEditor based on these rule-categories. The algorithm specifies rules for an editor how to proceed when considering a tuple (pair, triple, quadruple, quintuple) of semantic types to be assigned to a concept. Results: Eight rule-categories were identified. A Web-based system was developed to implement the adviseEditor algorithm, which returns for an input combination of semantic types whether it is permitted, prohibited or (in a few cases) requires more research. The numbers of semantic type pairs assigned to each rule-category are reported. Interesting examples for each rule-category are illustrated. Cases of semantic type assignments that contradict rules are listed, including recently introduced ones. Conclusion: The adviseEditor system implements explicit and implicit knowledge available in the UMLS in a system that informs UMLS editors about the permissibility of a desired combination of semantic types. Using adviseEditor might help accelerate the work of the UMLS editors and prevent erroneous semantic type assignments. (C) 2012 Elsevier Inc. All rights reserved.", "paper_title": "Rule-based support system for multiple UMLS semantic type assignments", "paper_id": "WOS:000315362300011"}