{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "fine-grained_selection_mechanism"}, {"score": 0.004590820632326585, "phrase": "chaos-based_multi-objective_immune_algorithm"}, {"score": 0.004353948887538618, "phrase": "clonal_selection_principle"}, {"score": 0.004173244935967375, "phrase": "stochastic_properties"}, {"score": 0.004129248271757936, "phrase": "chaotic_sequence"}, {"score": 0.004064117897000019, "phrase": "novel_mutation_operator"}, {"score": 0.003978866233891427, "phrase": "chaos-based_mutation"}, {"score": 0.0036942726653704213, "phrase": "diversity_estimation"}, {"score": 0.003578600071301459, "phrase": "cm_operator"}, {"score": 0.0035408501923902477, "phrase": "nondominated_solutions"}, {"score": 0.0034849681064606543, "phrase": "mutation_steps"}, {"score": 0.003375826910838081, "phrase": "less-crowded_regions"}, {"score": 0.0033402088717816446, "phrase": "relative_large_step_sizes"}, {"score": 0.0032527939106509946, "phrase": "polynomial_mutation_operator"}, {"score": 0.0028037753646260937, "phrase": "population_diversity"}, {"score": 0.002561892963059385, "phrase": "two-objective_benchmark_functions"}, {"score": 0.002468450551616404, "phrase": "cmia"}], "paper_keywords": ["Chaos", " Immune algorithm", " Multi-objective algorithm", " Chaotic mutation operator"], "paper_abstract": "In this paper, we propose a chaos-based multi-objective immune algorithm (CMIA) with a fine-grained selection mechanism based on the clonal selection principle. Taking advantage of the ergodic and stochastic properties of chaotic sequence, a novel mutation operator, named as chaos-based mutation (CM) operator, is proposed. Moreover, the information of diversity estimation is also adopted in the CM operator for nondominated solutions to adjust mutation steps adaptively, which encourages searching less-crowded regions with relative large step sizes. When comparing with polynomial mutation operator that is used in many state-of-the-art multi-objective optimization evolutionary algorithms, simulations show that it is effective to enhance the search performance. On the other hand, in order to increase the population diversity, a fine-grained selection mechanism is proposed in this paper, which seems to be remarkably effective in two-objective benchmark functions. When comparing with two state-of-the-art multi-objective evolutionary algorithms (NSGA-II and SPEA-2) and a new multi-objective immune algorithm (NNIA), simulation results of CMIA indicate the effectiveness of the fine-grained selection mechanism and the remarkable performance in finding the true Pareto-optimal front, especially on some benchmark functions with many local Pareto-optimal fronts.", "paper_title": "Chaos-based multi-objective immune algorithm with a fine-grained selection mechanism", "paper_id": "WOS:000291253100003"}