{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "bilateral_filtering"}, {"score": 0.013314674000138055, "phrase": "lpp"}, {"score": 0.004698229304089357, "phrase": "hyperspectral_images"}, {"score": 0.004621984064678252, "phrase": "high-dimensional_data"}, {"score": 0.0045284072672385975, "phrase": "rich_information"}, {"score": 0.004491506786670695, "phrase": "agricultural_remote"}, {"score": 0.004206879557938045, "phrase": "compact_and_discriminative_information"}, {"score": 0.003908091457759849, "phrase": "transformed_low_dimensional_vectors"}, {"score": 0.0036156119373414067, "phrase": "reduced_feature_vectors"}, {"score": 0.00357146811369898, "phrase": "locality_property"}, {"score": 0.0035278613436978933, "phrase": "original_high_dimensional_space"}, {"score": 0.003372460634140967, "phrase": "weight_design"}, {"score": 0.003237116369459232, "phrase": "lpp."}, {"score": 0.003107186371289819, "phrase": "euclidean_distance"}, {"score": 0.0029460197288680864, "phrase": "intensity_differences"}, {"score": 0.0024099937116733227, "phrase": "blpp"}, {"score": 0.00219311232069446, "phrase": "salinas_and_indian_pine_hyperspectral_databases"}, {"score": 0.002148604369150115, "phrase": "blpp."}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Locality preserving projections", " Bilateral filtering", " Dimensionality reduction", " Subspace learning", " Hyperspectral image classification"], "paper_abstract": "As a high-dimensional data, hyperspectral image contains rich information for agricultural remote sensing classification. Locality preserving projections (LPPs) have been widely used for extracting compact and discriminative information from such high-dimensional data. The objective function of LPP is formulated as a sum of the difference between transformed low dimensional vectors weighed by a function of the difference between images. The weights are crucial for LPP which enforce reduced feature vectors preserving the locality property in the original high dimensional space. In this paper, we borrow the idea of weight design of bilateral filtering to re-design the weights in LPP. The weights in bilateral filtering depend not only on the Euclidean distance of pixels (i.e., spatial weight) but also on the intensity differences (i.e., range weight). Analogously, we design the weights in our improved LPP (called bilateral LPP and abbreviated to BLPP) as a multiplication of a function of Euclidean distance parallel to x(i)-x(j)parallel to of the original images (i.e., spatial weight) and a function of the Euclidean distance parallel to f(x(i))-f(x(j))parallel to of the features extracted from the images (i.e., range weight, a.k.a., feature weight). The spatial weight measures the similarity in spatial space whereas the feature weight measures the similarity in feature space which reveals the content of the images. Thus, the proposed BLPP utilizes both the spatial information and the image content information, which results in higher recognition rate. Experimental results on the Salinas and Indian Pine hyperspectral databases demonstrate the effectiveness of BLPP. (C) 2015 Elsevier B.V. All rights reserved.", "paper_title": "Bilateral filtering inspired locality preserving projections for hyperspectral images", "paper_id": "WOS:000356987000029"}