{"auto_keywords": [{"score": 0.03380390317627952, "phrase": "architectural_constraints"}, {"score": 0.00481495049065317, "phrase": "biological_systems"}, {"score": 0.004766683200410046, "phrase": "contemporary_literature"}, {"score": 0.004331501320993783, "phrase": "representation-hungry_tasks"}, {"score": 0.00418134346679498, "phrase": "complex_form"}, {"score": 0.004139401327448803, "phrase": "informational_covariation"}, {"score": 0.003975781274672803, "phrase": "adaptive_function"}, {"score": 0.0038186039088445524, "phrase": "different_notion"}, {"score": 0.0036861605703168397, "phrase": "particular_view"}, {"score": 0.0025503112711036994, "phrase": "representation_share"}, {"score": 0.0023523750536537102, "phrase": "representational_reading"}, {"score": 0.0021807544600219216, "phrase": "causal_relations"}, {"score": 0.0021049977753042253, "phrase": "clear_view"}], "paper_keywords": ["Cognition", " representation", " emulation theory", " closed-loop architecture", " tropism", " circadian oscillator"], "paper_abstract": "Contemporary literature distinguishes two ways to defend the claim that cognition is a matter of representations: first, cognition involves representation-hungry tasks; second, cognition involves a complex form of informational covariation between subcomponents of a system with an adaptive function. Each of these conceptions involves a different notion of representation, and promotes a particular view of the architecture of cognition. But despite the differences, each of them aims to support the claim that cognition is a matter of representations on architectural constraints. The objectives of this article are twofold: first, it is argued that architectural constraints do not entail either of those two ways to defend the claim that cognition is a matter of representations; second, it is claimed that both notions of representation share an objectionable common element-namely, the idea of a model that grounds the representational reading-that must be abandoned, in favor of a more economical explanation in terms of causal relations, in order to get a clear view of cognition.", "paper_title": "Is cognition a matter of representations? Emulation, teleology, and time-keeping in biological systems", "paper_id": "WOS:000284206600002"}