{"auto_keywords": [{"score": 0.044340662163821175, "phrase": "model_migration"}, {"score": 0.00481495049065317, "phrase": "model_migration_empirical_results"}, {"score": 0.004724020632103649, "phrase": "transformation_tool_contest"}, {"score": 0.004377077848734575, "phrase": "nine_graph_and_model_transformation_tools"}, {"score": 0.004159997145421619, "phrase": "model_migration_problem-migration"}, {"score": 0.0031643005824589917, "phrase": "core_migration_task"}, {"score": 0.003026391655379905, "phrase": "comparison_method"}, {"score": 0.002785978280998868, "phrase": "special_focus"}, {"score": 0.002664513608074113, "phrase": "model_transformation"}, {"score": 0.0022578275190855124, "phrase": "model_elements"}, {"score": 0.0021049977753042253, "phrase": "future_model_migration_research"}], "paper_keywords": ["Model transformation", " Graph transformation", " Co-evolution"], "paper_abstract": "We describe the results of the Transformation Tool Contest 2010 workshop, in which nine graph and model transformation tools were compared for specifying model migration. The model migration problem-migration of UML activity diagrams from version 1.4 to version 2.2-is non-trivial and practically relevant. The solutions have been compared with respect to several criteria: correctness, conciseness, understandability, appropriateness, maturity and support for extensions to the core migration task. We describe in detail the comparison method, and discuss the strengths and weaknesses of the solutions with a special focus on the differences between graph and model transformation for model migration. The comparison results demonstrate tool and language features that strongly impact the efficacy of solutions, such as support for retyping of model elements. The results are used to motivate an agenda for future model migration research (including suggestions for areas in which the tools need to be further improved).", "paper_title": "Graph and model transformation tools for model migration Empirical results from the transformation tool contest", "paper_id": "WOS:000331000000016"}