{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "large_companies"}, {"score": 0.026181300763602654, "phrase": "large_company_settings"}, {"score": 0.004440780432053927, "phrase": "data_analysis_processes"}, {"score": 0.004389745162172933, "phrase": "information_visualization_tools"}, {"score": 0.004314285113050873, "phrase": "large_company"}, {"score": 0.004048483412089098, "phrase": "information_visualizations"}, {"score": 0.0038210283935447473, "phrase": "visual_encodings"}, {"score": 0.003777088546146369, "phrase": "considerably_less_work"}, {"score": 0.0035648266669315943, "phrase": "specific_work_contexts"}, {"score": 0.0030492472433481764, "phrase": "large_automotive_company"}, {"score": 0.002911278281894321, "phrase": "nine_information_visualization_evaluation_challenges"}, {"score": 0.0022305310659333864, "phrase": "practical_guidance"}, {"score": 0.0021049977753042253, "phrase": "information_visualization"}], "paper_keywords": ["information visualization", " field evaluation", " company"], "paper_abstract": "We examine the implications of evaluating data analysis processes and information visualization tools in a large company setting. While several researchers have addressed the difficulties of evaluating information visualizations with regards to changing data, tasks, and visual encodings, considerably less work has been published on the difficulties of evaluation within specific work contexts. We specifically focus on the challenges, which arise in the context of large companies with several thousand employees. Based on our own experience from a 3.5-year collaboration within a large automotive company, we first present a collection of nine information visualization evaluation challenges. We then discuss these challenges by means of two concrete visualization case studies from our own work. We finally derive a set of 16 recommendations for planning and conducting evaluations in large company settings. The set of challenges and recommendations and the discussion of our experience are meant to provide practical guidance to other researchers and practitioners, who plan to study information visualization in large company settings.", "paper_title": "Information visualization evaluation in large companies: Challenges, experiences and recommendations", "paper_id": "WOS:000295230200006"}