{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "forbidden_values"}, {"score": 0.008340688223588971, "phrase": "domain_consistency"}, {"score": 0.0057102911962375385, "phrase": "getforbidden_function"}, {"score": 0.004695900553353526, "phrase": "novel_domain-consistency_algorithm"}, {"score": 0.004074574278425223, "phrase": "generic_algorithm"}, {"score": 0.0037480753312398754, "phrase": "logical_combinations"}, {"score": 0.002856563331151566, "phrase": "simple_variant"}, {"score": 0.0025623050508233078, "phrase": "experimental_results"}, {"score": 0.002498812056838983, "phrase": "particular_classes"}, {"score": 0.002447101794397243, "phrase": "joint_exploitation"}, {"score": 0.0023764959294052964, "phrase": "standard_ac_algorithms"}, {"score": 0.002298288831092204, "phrase": "specialized_getsupports"}, {"score": 0.0021049977753042253, "phrase": "totally_dedicated_consistency_algorithms"}], "paper_keywords": ["Consistency", " Propagation", " Negative constraints"], "paper_abstract": "This paper presents a novel domain-consistency algorithm which does not maintain supports dynamically during propagation, but rather maintains forbidden values. It introduces the optimal NAC4 (negative AC4) algorithm based on this idea, as an instance of the generic algorithm AC5. The paper then shows how forbidden values and supports can be used jointly to achieve domain consistency on logical combinations of constraints and to compute validity as well as entailment of constraints. The combination of NAC4 and AC4, denoted byPNAC4, allows to achieve domain consistency in time O(ed) for classes of constraints in which the number of supports is O(d (2)) but the number of forbidden values is O(d), or conversely. The paper also presents a simple variant of AC3, denoted PNAC3. Both PNAC4 and PNAC3 are especially efficient on classes of constraints offering a O(1) getSupports or getForbidden function. Experimental results show that, on these particular classes of constraints, the joint exploitation of supports and forbidden values outperforms the standard AC algorithms, and that the use of a specialized getSupports or getForbidden function enhances the efficiency of the algorithms, especially for PNAC3 which is very close to the efficiency of totally dedicated consistency algorithms.", "paper_title": "Domain consistency with forbidden values", "paper_id": "WOS:000317978200003"}