{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "potential_therapeutics"}, {"score": 0.004740476936977635, "phrase": "mammalian_target"}, {"score": 0.004384960761826366, "phrase": "compelling_molecular_target"}, {"score": 0.004184526032558792, "phrase": "kinase_family"}, {"score": 0.004103728794623367, "phrase": "central_controller"}, {"score": 0.0035940277928341265, "phrase": "clinical_or_preclinical_development"}, {"score": 0.003389704997952315, "phrase": "new_potent_agents"}, {"score": 0.003324203391715804, "phrase": "glioblastoma_therapy"}, {"score": 0.0031845067058084583, "phrase": "molecular_grafting"}, {"score": 0.0029568580614857524, "phrase": "binding_potency"}, {"score": 0.002888396879326153, "phrase": "protein_kinase-inhibitor_database"}, {"score": 0.002756180088265064, "phrase": "structurally_diverse_compounds"}, {"score": 0.0026923527275481804, "phrase": "satisfactory_inhibition_profile"}, {"score": 0.0026299995767138304, "phrase": "nanomolar_level"}, {"score": 0.002519402443228795, "phrase": "high_inhibitory_activities"}, {"score": 0.0024418934977061876, "phrase": "potential_lead_compounds"}, {"score": 0.002366763442497185, "phrase": "diverse_nonbonded_interactions"}, {"score": 0.0023391880766516285, "phrase": "hydrogen_bonds"}, {"score": 0.0023209828061385596, "phrase": "hydrophobic_forces"}, {"score": 0.0023029188952824685, "phrase": "van_der_waals"}, {"score": 0.0022672107906933714, "phrase": "complex_interface"}, {"score": 0.002154930852763048, "phrase": "mtor-inhibitor_binding"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Rational drug design", " mTOR", " Kinase-inhibitor", " Glioblastoma"], "paper_abstract": "Mammalian target of rapamycin (mTOR), a key mediator of PI3K/Akt/mTOR signaling pathway, has recently emerged as a compelling molecular target in glioblastoma. The mTOR is a member of serine/threonine protein kinase family that functions as a central controller of growth, proliferation, metabolism and angiogenesis, but its signaling is dysregulated in various human diseases especially in certain solid tumors including the glioblastoma. Here, considering that there are various kinase inhibitors being approved or under clinical or preclinical development, it is expected that some of them can be re-exploited as new potent agents to target mTOR for glioblastoma therapy. To achieve this, a synthetic pipeline that integrated molecular grafting, consensus scoring, virtual screening, kinase assay and structure analysis was described to systematically profile the binding potency of various small-molecule inhibitors deposited in the protein kinase-inhibitor database against the kinase domain of mTOR. Consequently, a number of structurally diverse compounds were successfully identified to exhibit satisfactory inhibition profile against mTOR with IC50 values at nanomolar level. In particular, few sophisticated kinase-inhibitors as well as a flavonoid myricetin showed high inhibitory activities, which could thus be considered as potential lead compounds to develop new potent, selective mTOR-inhibitors. Structural examination revealed diverse nonbonded interactions such as hydrogen bonds, hydrophobic forces and van der Waals contacts across the complex interface of mTOR with myricetin, conferring both stability and specificity for the mTOR-inhibitor binding. (C) 2015 Elsevier Ltd. All rights reserved.", "paper_title": "Structure-based grafting and identification of kinase-inhibitors to target mTOR signaling pathway as potential therapeutics for glioblastoma", "paper_id": "WOS:000350190300007"}