{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "lightpath_assignment"}, {"score": 0.004757643419056999, "phrase": "optical_ring"}, {"score": 0.004571478018964363, "phrase": "packet-switching_wavelength_division_multiplexing_ring"}, {"score": 0.004357627943575288, "phrase": "new_all-optical_architecture"}, {"score": 0.00405538690701843, "phrase": "overall_cost"}, {"score": 0.003912189642066724, "phrase": "indispensable_devices"}, {"score": 0.003789137457228946, "phrase": "required_wavelengths"}, {"score": 0.003714195746979591, "phrase": "packing_problems"}, {"score": 0.003669941438286456, "phrase": "ring_dimensioning"}, {"score": 0.0032164910932827168, "phrase": "complete_theoretical_analysis"}, {"score": 0.002945669860541221, "phrase": "optimal_cutting_strategy"}, {"score": 0.0028302049070944944, "phrase": "heuristic_solution"}, {"score": 0.002581477142020187, "phrase": "exhaustive_numerical_results"}, {"score": 0.00255068452076921, "phrase": "heuristic_algorithm"}, {"score": 0.0021647968783414504, "phrase": "network_design_guidelines"}], "paper_keywords": ["packing problems", " approximability", " optical rings", " network dimensioning"], "paper_abstract": "We present our work on the dimensioning of a packet-switching wavelength division multiplexing ring in order to reduce its infrastructure (capital expenditure) cost. We study a new all-optical architecture: the packed optical add-drop multiplexer (POADM). We aim to minimize the overall cost of the network by reducing the number of indispensable devices in the nodes and the number of required wavelengths. We formalize the packing problems underlying the ring dimensioning. The elements to be packed are made up of transmissions that share the same destination. We assume that elements can be cut before being packed into boxes. We furnish a complete theoretical analysis of the complexity and approximability of these problems. We define also several measures of quality for a cut and provide an optimal cutting strategy, according to these measures. Our subsequent contribution is a heuristic solution that solves the bi-criteria packing problem (the number of boxes and the number of cuts are minimized simultaneously). The exhaustive numerical results of this heuristic algorithm come next. We rely on our optimal cutting strategy to appraise the efficiency of other strategies. We also adapt the only existing POADM dimensioning algorithm, more restrictive than ours, and we confront it with our solution. The analysis of results allows us to provide network design guidelines to perform the dimensioning in the most efficient way.", "paper_title": "A Packing Problem Approach to Lightpath Assignment in an Optical Ring", "paper_id": "WOS:000342922900004"}