{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "mutual_information"}, {"score": 0.033819336774639525, "phrase": "proposed_techniques"}, {"score": 0.0045820747375409435, "phrase": "excellent_resource"}, {"score": 0.004457579615095599, "phrase": "people's_opinion"}, {"score": 0.004384504920139083, "phrase": "company_owner"}, {"score": 0.003970439654470374, "phrase": "similar_product"}, {"score": 0.0034975571855450343, "phrase": "mining_competitors"}, {"score": 0.0030470127429039497, "phrase": "input_entity"}, {"score": 0.002713604305939145, "phrase": "original_entity"}, {"score": 0.002639740960006001, "phrase": "novel_system"}, {"score": 0.0023900527169254744, "phrase": "tedious_process"}, {"score": 0.0023507916951658455, "phrase": "domain-independent_and_web-scale_dynamical_manner"}, {"score": 0.002224510044064184, "phrase": "varied_domains"}, {"score": 0.0021639314280887324, "phrase": "codis"}, {"score": 0.0021049977753042253, "phrase": "experimental_results"}], "paper_keywords": [""], "paper_abstract": "The web with its rapid expansion has become an excellent resource for gathering information and people's opinion. A company owner wants to know who is the competitor, and a customer also wants to know which company provides similar product or service to what he/she is in want of. This paper proposes an approach based on mutual information, which focuses on mining competitors of the entity(such as company, product, person) from the web. The proposed techniques first extract a set of candidates of the input entity, and then rank them according to the comparability, and finally find and organize the reviews related to both original entity and its competitors. A novel system called \"CoDis\" based upon these techniques is implemented, which is able to automate the tedious process in a domain-independent and web-scale dynamical manner. In the experiment we use 32 different entities distributed in varied domains as inputs and the CoDis discovers 143 competitors. The experimental results show that the proposed techniques are highly effective.", "paper_title": "Web scale competitor discovery using mutual information", "paper_id": "WOS:000240088200087"}