{"auto_keywords": [{"score": 0.03992659287798476, "phrase": "standard_view"}, {"score": 0.00481495049065317, "phrase": "competing_accounts"}, {"score": 0.004614643339546038, "phrase": "design_activity"}, {"score": 0.004422632150619634, "phrase": "interface_technologies"}, {"score": 0.004278807087784626, "phrase": "direct_perception"}, {"score": 0.004238576355081601, "phrase": "electromagnetic_phenomena"}, {"score": 0.003967314311312148, "phrase": "-_two_models"}, {"score": 0.0036958398682001015, "phrase": "external_world"}, {"score": 0.003426640459083931, "phrase": "organism's_biological_sensory_modalities"}, {"score": 0.003299460925313939, "phrase": "enactive_view"}, {"score": 0.00297346171320082, "phrase": "sensorimotor_contingencies"}, {"score": 0.002876627851917633, "phrase": "preliminary_results"}, {"score": 0.0028495431343111897, "phrase": "design_work"}, {"score": 0.0028093921138602606, "phrase": "enactive_cognition"}, {"score": 0.0025436978068459565, "phrase": "novel_perceptual_phenomena"}, {"score": 0.002292199117499287, "phrase": "instrumental_utility"}, {"score": 0.002125020720324262, "phrase": "richer_world"}], "paper_keywords": ["design", " cybernetics", " perception"], "paper_abstract": "Purpose - The paper aims to consider competing accounts of perception and to examine their potential to support design activity that seeks to extend and enrich perception using interface technologies. The interfaces will enable the direct perception of electromagnetic phenomena that are not now considered to be directly available to humans. Design/methodology/approach - Two models are considered. According to one, the standard view, perception is of an external world known by means of information flowing into an organism from it as conditioned by the organism's biological sensory modalities; according to the other, the enactive view, perception occurs by means of learning to differentiate oneself from the world by undertaking activities, by learning and mastering sensorimotor contingencies. Findings - The paper presents preliminary results of design work based on enactive cognition and argues that the results, in turn, re-inform and reinforce the theory by the introduction of novel perceptual phenomena that cannot be accommodated within the standard view of perception. Practical implications - The project, rather than seeking an instrumental utility, though this may occur, instead strives to enable the bringing forth of a richer world. Its objective is epistemic rather than pragmatic. Originality/value - The paper presents a reflection on the role of design in the construction of theory.", "paper_title": "Design and prosthetic perception", "paper_id": "WOS:000251883500017"}