{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "multivariate_polynomials"}, {"score": 0.004534517530868195, "phrase": "efficient_and_general_algorithm"}, {"score": 0.004231089088705995, "phrase": "functional_decomposition"}, {"score": 0.004058826900076531, "phrase": "computer_algebra"}, {"score": 0.003966162568548304, "phrase": "first_general_method"}, {"score": 0.003484864867147635, "phrase": "ideal_i"}, {"score": 0.0026163210719740847, "phrase": "cryptographic_application"}, {"score": 0.0024750474634399797, "phrase": "cryptographic_point"}, {"score": 0.002418453525649304, "phrase": "new_algorithm"}, {"score": 0.0023305762840188145, "phrase": "two-round_schemes"}, {"score": 0.002164264600379492, "phrase": "independent_interest"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Multivariate polynomials decomposition", " Grobner bases", " Cryptography"], "paper_abstract": "In this paper, we present an efficient and general algorithm for decomposing multivariate polynomials of the same arbitrary degree. This problem, also known as the Functional Decomposition Problem (FDP), is classical in computer algebra. It is the first general method addressing the decomposition of multivariate polynomials (any degree. any number of polynomials). As a byproduct, our approach can be also used to recover an ideal I from its kth power I-k. The complexity of the algorithm depends on the ratio between the number of variables (n) and the number of polynomials (u). For example, polynomials of degree four can be decomposed in O(n(12)), when this ratio is smaller than 1/2. This work was initially motivated by a cryptographic application, namely the cryptanalysis of 2R(-) schemes. From a cryptographic point of view, the new algorithm is so efficient that the principle of two-round schemes, including 2R(-) schemes, becomes useless. Besides, we believe that our algorithm is of independent interest. (c) 2008 Elsevier Ltd. All rights reserved.", "paper_title": "An efficient algorithm for decomposing multivariate polynomials and its applications to cryptography", "paper_id": "WOS:000270620200007"}