{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "empirical_study"}, {"score": 0.03496276480056338, "phrase": "hsc_teachers"}, {"score": 0.031227936348435306, "phrase": "mixed_beliefs"}, {"score": 0.004460309246062286, "phrase": "computing_teachers"}, {"score": 0.004352433279285635, "phrase": "hsc"}, {"score": 0.004208282550386197, "phrase": "better_learners"}, {"score": 0.004183663622784029, "phrase": "computing"}, {"score": 0.0038862297330905836, "phrase": "best_teaching"}, {"score": 0.0036553070575015344, "phrase": "teachers'_beliefs"}, {"score": 0.003512591457930393, "phrase": "structured_interviews"}, {"score": 0.003438058620195309, "phrase": "non-participant_observation"}, {"score": 0.0034066004178183117, "phrase": "structured_observation_sheets"}, {"score": 0.0032336801561165113, "phrase": "aforementioned_issues"}, {"score": 0.0031073749619793087, "phrase": "constructivist_approaches"}, {"score": 0.0030135741897058844, "phrase": "well-known_traditional_behaviorist_practices"}, {"score": 0.0027572166867780275, "phrase": "contextual_barriers"}, {"score": 0.002731971103291716, "phrase": "rapid_evolution"}, {"score": 0.002665770884424872, "phrase": "current_trends"}, {"score": 0.00257735013358606, "phrase": "perceived_students'_culture"}, {"score": 0.0024918548761791435, "phrase": "data_analysis"}, {"score": 0.002431458888197052, "phrase": "hsc_teachers'_beliefs"}, {"score": 0.0023221248824337576, "phrase": "'_belief"}, {"score": 0.0022938068444116827, "phrase": "teachers'_real_practices"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["High school computing teachers", " Secondary education", " Teacher beliefs and practices", " Teacher professional development", " Teaching/learning strategies"], "paper_abstract": "The aim of this work is threefold. Firstly, an empirical study was designed with the aim of investigating the beliefs that High School Computing (HSC) teachers hold about: (a) their motivational orientation, self-efficacy, and self-expectations as Computing teachers, (b) the nature of HSC and its curricula, (c) how their students could be better learners in Computing, and the expectations they have of their students, and (d) their own teaching approaches and the alternatives they propose for best teaching of HSC. Secondly, an empirical study was realized to investigate the same HSC teachers' classroom practices. Thirdly, possible associations between the teachers' beliefs and their teaching practices were investigated. 25 HSC teachers participated, their beliefs being elicited through structured interviews, while their practices were investigated through non-participant observation, using structured observation sheets. The analysis of the data revealed that HSC teachers as a group held various beliefs about the aforementioned issues: some of these beliefs can 'empower' teachers to realize constructivist approaches while others can 'constrain' them to the well-known traditional behaviorist practices. The majority of HSC teachers expressed mixed beliefs ('empowering' and 'constraining') and reported feeling overwhelmed, with little control over their teaching, due to contextual barriers, the rapid evolution of Computing and, subsequently, their lack of knowledge about current trends and didactics in this discipline, as well as the perceived students' culture about Computing as playing games and surfing the Internet. Data analysis also shows that there are synergies between HSC teachers' beliefs and practices. In the case of mixed beliefs, at least one 'constraining' belief is reflected in teachers' real practices. However, the descriptions of practices given by most of those teachers during the interviews are not fully reflected in their practices. (C) 2013 Elsevier Ltd. All rights reserved.", "paper_title": "High school computing teachers' beliefs and practices: A case study", "paper_id": "WOS:000324080800014"}