{"auto_keywords": [{"score": 0.048877326221094704, "phrase": "group_formation"}, {"score": 0.00481495049065317, "phrase": "social_network_groups"}, {"score": 0.004615202066192795, "phrase": "social_networks"}, {"score": 0.004204320052179726, "phrase": "platform_contents"}, {"score": 0.0037495207047193034, "phrase": "social_group"}, {"score": 0.00327356326590461, "phrase": "mutual_trustworthiness"}, {"score": 0.003150900886669123, "phrase": "important_factor"}, {"score": 0.0030199761431186434, "phrase": "profound_effects"}, {"score": 0.0026140878612307536, "phrase": "quantitative_measure"}, {"score": 0.0025919830205975215, "phrase": "group_compactness"}, {"score": 0.0023507916951658455, "phrase": "empirical_results"}, {"score": 0.0023013968622710847, "phrase": "real_social_networks"}, {"score": 0.002291647294571696, "phrase": "epinions"}, {"score": 0.0022722628136671663, "phrase": "ciao"}, {"score": 0.0021870332034407817, "phrase": "traditional_notion"}, {"score": 0.002168531704054597, "phrase": "user_similarity"}], "paper_keywords": ["Decision support systems", " machine learning", " multiagent systems", " social network services", " social trust"], "paper_abstract": "Understanding the dynamics behind group formation and evolution in social networks is considered an instrumental milestone to better describe how individuals gather and form communities, how they enjoy and share the platform contents, how they are driven by their preferences/tastes, and how their behaviors are influenced by peers. In this context, the notion of compactness of a social group is particularly relevant. While the literature usually refers to compactness as a measure to merely determine how much members of a group are similar among each other, we argue that the mutual trustworthiness between the members should be considered as an important factor in defining such a term. In fact, trust has profound effects on the dynamics of group formation and their evolution: individuals are more likely to join with and stay in a group if they can trust other group members. In this paper, we propose a quantitative measure of group compactness that takes into account both the similarity and the trustworthiness among users, and we present an algorithm to optimize such a measure. We provide empirical results, obtained from the real social networks EPINIONS and CIAO, that compare our notion of compactness versus the traditional notion of user similarity, clearly proving the advantages of our approach.", "paper_title": "Trust and Compactness in Social Network Groups", "paper_id": "WOS:000348071500005"}