{"auto_keywords": [{"score": 0.03363896917055258, "phrase": "yahoo"}, {"score": 0.0047113960612140335, "phrase": "structuration_perspective"}, {"score": 0.004635187610736025, "phrase": "reciprocity_research"}, {"score": 0.004389912080394437, "phrase": "reciprocal_interactions"}, {"score": 0.004342430078306461, "phrase": "social_question"}, {"score": 0.004157561334726201, "phrase": "individual_users"}, {"score": 0.003916098498242888, "phrase": "observed_benefit"}, {"score": 0.0037903327482565097, "phrase": "collective_reciprocity"}, {"score": 0.003668591097652231, "phrase": "conditional_strategy"}, {"score": 0.0032546105164772995, "phrase": "large_sample"}, {"score": 0.0030654278282822027, "phrase": "collective_reciprocity_premise"}, {"score": 0.002235040467016128, "phrase": "structuration_view"}, {"score": 0.002128067018576581, "phrase": "social_norms"}, {"score": 0.0021049977753042253, "phrase": "online_communities"}], "paper_keywords": ["communities of practice", " virtual communities", " message systems"], "paper_abstract": "Taking a structuration perspective and integrating reciprocity research in economics, this study examines the dynamics of reciprocal interactions in social question & answer communities. We postulate that individual users of social Q&A constantly adjust their kindness in the direction of the observed benefit and effort of others. Collective reciprocity emerges from this pattern of conditional strategy of reciprocation and helps form a structure that guides the very interactions that give birth to the structure. Based on a large sample of data from Yahoo! Answers, our empirical analysis supports the collective reciprocity premise, showing that the more effort (relative to benefit) an asker contributes to the community, the more likely the community will return the favor. On the other hand, the more benefit (relative to effort) the asker takes from the community, the less likely the community will cooperate in terms of providing answers. We conclude that a structuration view of reciprocity sheds light on the duality of social norms in online communities.", "paper_title": "You scratch someone's back and we'll scratch yours: Collective reciprocity in social Q&A communities", "paper_id": "WOS:000324100000008"}