{"auto_keywords": [{"score": 0.04546648155091688, "phrase": "proposed_algorithm"}, {"score": 0.010612387000973441, "phrase": "digital_planar_curves"}, {"score": 0.0047709540557306284, "phrase": "adaptive_optimizations"}, {"score": 0.003809628721278519, "phrase": "adaptively_the_best_fitting_polygonal_approximations"}, {"score": 0.003555902292752528, "phrase": "optimization_procedure"}, {"score": 0.0034751259234824913, "phrase": "efficiency_measures"}, {"score": 0.0034433297275344877, "phrase": "polygonal_approximation_algorithms"}, {"score": 0.0033961782274326948, "phrase": "objective_function"}, {"score": 0.0032436052954996097, "phrase": "different_levels"}, {"score": 0.00286493504971388, "phrase": "suppression_techniques"}, {"score": 0.0025420267431501367, "phrase": "popular_shapes"}, {"score": 0.0023507916951658455, "phrase": "large_set"}, {"score": 0.002329258721870127, "phrase": "handwritten_arabic_characters"}, {"score": 0.002286781334850213, "phrase": "experimental_results"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Dominant points", " Polygonal approximation", " Planar curves", " Contour processing"], "paper_abstract": "In this paper, we present a novel non-parametric polygonal approximation algorithm for digital planar curves. The proposed algorithm first selects a set of points (called cut-points) on the contour which are of very 'high' curvature. An optimization procedure is then applied to find adaptively the best fitting polygonal approximations for the different segments of the contour as defined by the cut-points. The optimization procedure uses one of the efficiency measures for polygonal approximation algorithms as the objective function. Our algorithm adaptively locates segments of the contour with different levels of details. The proposed algorithm follows the contour more closely where the level of details on the curve is high, while addressing noise by using suppression techniques. This makes the algorithm very robust for noisy, real-life contours having different levels of details. The proposed algorithm performs favorably when compared with other polygonal approximation algorithms using the popular shapes. In addition, the effectiveness of the algorithm is shown by measuring its performance over a large set of handwritten Arabic characters and MPEG7 CE Shape-1 Part B database. Experimental results demonstrate that the proposed algorithm is very stable and robust compared with other algorithms. (c) 2010 Elsevier B.V. All rights reserved.", "paper_title": "Polygonal approximation of digital planar curves through adaptive optimizations", "paper_id": "WOS:000282146800030"}