{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "network_traffic_matrix"}, {"score": 0.012241021415284823, "phrase": "traffic_matrix"}, {"score": 0.007357270020602464, "phrase": "pca"}, {"score": 0.006621372724282567, "phrase": "large_volume_anomalies"}, {"score": 0.006041483212918896, "phrase": "structural_analysis"}, {"score": 0.0047709540557306284, "phrase": "relaxed_principal_component_pursuit"}, {"score": 0.004598933498016774, "phrase": "network_operation"}, {"score": 0.00443308765153716, "phrase": "crucial_importance"}, {"score": 0.0041001740903338834, "phrase": "principal_component_analysis"}, {"score": 0.003555902292752528, "phrase": "new_decomposition_model"}, {"score": 0.0025071862539276283, "phrase": "experimental_results"}, {"score": 0.0023944552329463035, "phrase": "deterministic_and_noise_traffic"}, {"score": 0.002329258721870127, "phrase": "novel_method"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Network measurement", " Traffic matrix structural analysis", " Robust principal component analysis", " Relaxed principal component pursuit", " Accelerated proximal gradient algorithm"], "paper_abstract": "The network traffic matrix is widely used in network operation and management. It is therefore of crucial importance to analyze the components and the structure of the network traffic matrix, for which several mathematical approaches such as Principal Component Analysis (PCA) were proposed. In this paper, we first argue that PCA performs poorly for analyzing traffic matrix that is polluted by large volume anomalies, and then propose a new decomposition model for the network traffic matrix. According to this model, we carry out the structural analysis by decomposing the network traffic matrix into three sub-matrices, namely, the deterministic traffic, the anomaly traffic and the noise traffic matrix, which is similar to the Robust Principal Component Analysis (RPCA) problem previously studied in [13]. Based on the Relaxed Principal Component Pursuit (Relaxed PCP) method and the Accelerated Proximal Gradient (APG) algorithm, we present an iterative approach for decomposing a traffic matrix, and demonstrate its efficiency and flexibility by experimental results. Finally, we further discuss several features of the deterministic and noise traffic. Our study develops a novel method for the problem of structural analysis of the traffic matrix, which is robust against pollution of large volume anomalies. (C) 2012 Elsevier B.V. All rights reserved.", "paper_title": "Structural analysis of network traffic matrix via relaxed principal component pursuit", "paper_id": "WOS:000303290000012"}