{"auto_keywords": [{"score": 0.048749297367557266, "phrase": "elongation_method"}, {"score": 0.047667240890459914, "phrase": "oh-_group"}, {"score": 0.004725385523804256, "phrase": "molecular_dynamics_study"}, {"score": 0.004342430078306461, "phrase": "elongation_optimization"}, {"score": 0.003916098498242888, "phrase": "energy_barrier"}, {"score": 0.003581620064675766, "phrase": "conventional_calculation_results"}, {"score": 0.00348202932445197, "phrase": "elg-opt_method"}, {"score": 0.0028312983170567948, "phrase": "room_temperature"}, {"score": 0.002613709503583786, "phrase": "h-abstract_reaction"}, {"score": 0.002552946390854313, "phrase": "extra_water_molecule"}, {"score": 0.0025053520095236694, "phrase": "water_transfer_reaction"}, {"score": 0.0024014759148123736, "phrase": "transfer_time"}, {"score": 0.002196077907454079, "phrase": "high_temperature"}], "paper_keywords": ["Alkali", " Elongation (ELG) method", " Hydrated complex", " Molecular dynamics simulations", " Xylan"], "paper_abstract": "The interaction of OH- group with (xylan) 12 and its hydrated complexes were theoretically studied using elongation optimization (ELG-OPT) method and elongation ab initio molecular dynamics simulation (ELG-MD) method. OH- group could abstract a H-atom from the terminal xylan ring to form a complex (xylan)(12)(-)-H2O without any energy barrier. One and two extra water molecules were also added to the same terminal xylan ring. All the geometry optimization results obtained using elongation method were compared with conventional calculation results, and it suggested that ELG-OPT method worked well for (xylan)(12), (xylan)(12)-OH-, and its hydrated complexes. Moreover 10 ps ab initio molecular dynamics simulations were performed for complexes (xylan)(12)(-)-H2O, (xylan)(12)(-)-2H(2)O, and (xylan)(12)(-)-3H(2)O at 300 K, 500 K, and 700 K. (xylan)(12)(-)-H2O complex was stable at room temperature. However H2O molecule which was formed by OH- group could move at 500 K. At 700 K the H-abstract reaction reversed. Adding an extra water molecule only accelerated the water transfer reaction, but no more chemical reactions occurred, and the transfer time decreased when the temperature increased. The complex (xylan)(12)(-)-H2O became very stable when adding two extra water molecules even at high temperature, and it indicated that two extra water molecules stabilized the complex (xylan)(12)(-)-H2O.", "paper_title": "Interaction of OH- with xylan and its hydrated complexes: structures and molecular dynamics study using elongation method", "paper_id": "WOS:000352800600014"}