{"auto_keywords": [{"score": 0.047700738896479716, "phrase": "webopac"}, {"score": 0.04359016788680388, "phrase": "ilmu"}, {"score": 0.039519256019218435, "phrase": "graphic_design"}, {"score": 0.00481495049065317, "phrase": "visual_interface"}, {"score": 0.004721602309430702, "phrase": "children's_webopac."}, {"score": 0.004611959213131437, "phrase": "visual_interface_design"}, {"score": 0.004348813532606792, "phrase": "bibliographical_information"}, {"score": 0.004298006360831255, "phrase": "library_database"}, {"score": 0.00424779023663186, "phrase": "existing_interface"}, {"score": 0.003806395038279074, "phrase": "major_usability_problems"}, {"score": 0.003116551456858777, "phrase": "children's_requirements"}, {"score": 0.003056029284235528, "phrase": "participatory_design_activities"}, {"score": 0.002915514089373717, "phrase": "cooperative_inquiry_approach"}, {"score": 0.002847691227421257, "phrase": "children's_ideas"}, {"score": 0.002622465142275264, "phrase": "information_organisation"}, {"score": 0.002453221048083196, "phrase": "new_webopac_interface"}, {"score": 0.0022948742034852917, "phrase": "visual_interface_display_techniques"}, {"score": 0.0021551702945512494, "phrase": "new_interface"}, {"score": 0.0021049977753042253, "phrase": "high_level"}], "paper_keywords": [""], "paper_abstract": "This study focuses on the visual interface design of WebOPAC, which assists children in carrying out searching and browsing activities for bibliographical information in a library database. The existing interface of WebOPAC, called Ilmu, is investigated in this study; the interface is efficient in retrieving information from the database; however, its poor graphic design causes major usability problems. The graphic design of Ilmu is important in helping children to understand and visualise concepts of searching and browsing. Therefore, the interface must be constructed in such a way that can meet the needs of children aged 7-11 years. In this study, an analysis has been carried out on children's requirements for the graphic design through participatory design activities using two approaches: cooperative inquiry and sketching of ideas. The cooperative Inquiry approach involved 40 children, while sketching children's ideas involved 20 children as respondents. A total of 14 requirement specifications were generated and categorised into four areas-use of space, information organisation, function and use of colours; these would serve as a basis in designing a new WebOPAC interface. Synthesis of these requirements has shown that they are best supported through the implementation of visual interface display techniques. Chi-squared (chi (2)) test was used to test the responses of children towards the usability of the new interface; the results showed a high level of acceptance by the children, recording a rate of 83.98 %.", "paper_title": "Visual interface for searching and browsing children's WebOPAC", "paper_id": "WOS:000344169700002"}