{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "foundational_relations"}, {"score": 0.008466201177747271, "phrase": "first-order_logic"}, {"score": 0.0045320819060445045, "phrase": "bio-medical_terminology_systems"}, {"score": 0.004452078350485375, "phrase": "formal_deductive_systems"}, {"score": 0.004342435563010672, "phrase": "fol"}, {"score": 0.004000741805312148, "phrase": "proper_parthood_relations"}, {"score": 0.0039723268236794935, "phrase": "subdivision_relations"}, {"score": 0.0037789720824759503, "phrase": "important_and_distinct_aspect"}, {"score": 0.0037387746981660717, "phrase": "spatial_organization"}, {"score": 0.0037122133844189296, "phrase": "anatomical_structures"}, {"score": 0.0035063811070537233, "phrase": "salient_anatomical_objects"}, {"score": 0.0033475472608077823, "phrase": "anatomical_objects"}, {"score": 0.003150612723641925, "phrase": "strict_partial_orderings"}, {"score": 0.0027025233739857374, "phrase": "proper_parthood"}, {"score": 0.0024984517279573906, "phrase": "bio-medical_ontologies"}, {"score": 0.0024718415971488627, "phrase": "rigorous_formal_analysis"}, {"score": 0.0024368006923629476, "phrase": "different_kinds"}, {"score": 0.002419466507425567, "phrase": "formal_tools"}, {"score": 0.0023015232625177755, "phrase": "highly_expressive_language"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["biomedical ontologies", " formal ontology", " mereology", " axiomatic theories", " description logic"], "paper_abstract": "Objective: We compare the advantages of specifying the semantics of foundational relations in bio-medical terminology systems using different types of formal deductive systems: first-order logic (FOL) and description logics (DLs). Method: As our focus example, we use a terminology whose basic terms are supposed to designate proper parthood relations, subdivision relations, and surrounded-by relations. Each type of relation captures an important and distinct aspect of the spatial organization of anatomical structures: the general part-whole structure (proper parthood), the division of salient anatomical objects into discrete, tree-like structures (subdivision-of), and the nesting of anatomical objects into containers (surrounded-by). We show that all three types of relations are strict partial orderings (i.e., asymmetric and transitive). Ontologies whose purpose is to specify the semantics of terms referring to these types of relations must include axioms strong enough to formally distinguish among them. We compare the extent to which axioms characterizing proper parthood, subdivision, and surrounded-by relations can be represented in first-order logic and various description logics. Conclusions: The development of bio-medical ontologies requires a rigorous formal analysis of foundational relations. Different kinds of formal tools may be used in this process. Ideally, an analysis in a highly expressive language, such as first-order logic, should be worked out in conjunction with analyses in less expressive but computationally tractable deductive systems such as description logics. (c) 2007 Elsevier B.V. All rights reserved.", "paper_title": "Logical properties of foundational relations in bio-ontologies", "paper_id": "WOS:000246657200003"}