{"auto_keywords": [{"score": 0.033391520209855224, "phrase": "co-clustering_process"}, {"score": 0.00481495049065317, "phrase": "metadata_support"}, {"score": 0.004742290714667451, "phrase": "traditional_co-clustering"}, {"score": 0.004600228893803583, "phrase": "clustering_task"}, {"score": 0.004220314322073171, "phrase": "different_domains"}, {"score": 0.004114641015648682, "phrase": "single_input_matrix"}, {"score": 0.003258090521354736, "phrase": "significant_role"}, {"score": 0.0024023079401125492, "phrase": "available_contextual_knowledge"}, {"score": 0.002226017732566121, "phrase": "available_metadata"}, {"score": 0.0021923400552366777, "phrase": "contextually-relevant_co-clusters"}, {"score": 0.0021049977753042253, "phrase": "information_theoretical_co-cluster_quality"}], "paper_keywords": ["Co-clustering", " Metadata", " Constraints", " Context-aware clustering", " Concept alignment"], "paper_abstract": "In traditional co-clustering, the only basis for the clustering task is a given relationship matrix, describing the strengths of the relationships between pairs of elements in the different domains. Relying on this single input matrix, co-clustering discovers relationships holding among groups of elements from the two input domains. In many real life applications, on the other hand, other background knowledge or metadata about one or more of the two input domain dimensions may be available and, if leveraged properly, such metadata might play a significant role in the effectiveness of the co-clustering process. How additional metadata affects co-clustering, however, depends on how the process is modified to be context-aware. In this paper, we propose, compare, and evaluate three alternative strategies (metadata-driven, metadata-constrained, and metadata-injected co-clustering) for embedding available contextual knowledge into the co-clustering process. Experimental results show that it is possible to leverage the available metadata in discovering contextually-relevant co-clusters, without significant overheads in terms of information theoretical co-cluster quality or execution cost.", "paper_title": "On context-aware co-clustering with metadata support", "paper_id": "WOS:000299003000007"}