{"auto_keywords": [{"score": 0.048942952634754525, "phrase": "social_networks"}, {"score": 0.01520544686110375, "phrase": "social_network_analysis"}, {"score": 0.004746065479362881, "phrase": "movie_stories"}, {"score": 0.004501774379030109, "phrase": "semantic_information"}, {"score": 0.004416079619543104, "phrase": "movie_analysis"}, {"score": 0.0043738432231020885, "phrase": "social_relationships"}, {"score": 0.004229158339021651, "phrase": "information_retrieval"}, {"score": 0.004168618849008299, "phrase": "audio-visual_feature_analysis"}, {"score": 0.004011366422179016, "phrase": "main_structure"}, {"score": 0.0037864980290391354, "phrase": "movie_story_information"}, {"score": 0.003714368305523811, "phrase": "major_roles"}, {"score": 0.0036611708297251645, "phrase": "corresponding_communities"}, {"score": 0.0032308006242867224, "phrase": "character_dialogs"}, {"score": 0.002677964894127131, "phrase": "accurate_movie_stories"}], "paper_keywords": ["Character-net", " Character", " Movie", " Community clustering", " Story-based", " Social network"], "paper_abstract": "There have been various approaches to analyzing movie stories using social networks. Social network analysis is an effective means to extract semantic information from movies. Movie analysis through social relationships among characters can support various types of information retrieval better than audio-visual feature analysis. The relationships among characters form the main structure of the story. Therefore, through social network analysis among characters, movie story information such as the major roles and the corresponding communities can be determined. Progression of most movie stories is done by characters, and the scriptwriter or director narrates the story and relationships among characters using character dialogs. A dialog has a direction and time that supplies information. Therefore, the dialog is better for constructing social networks of characters than the co-appearance. Additionally, through social networks using the dialog, we can extract accurate movie stories such as classification of major, minor or extra roles, community clustering, and sequence detection. To achieve this, we propose a Character-net that can represent the relationships between characters using dialogs, and a method that can extract the sequences via clustering communities composed of characters. Our experiments show that our proposed method can efficiently detect sequences.", "paper_title": "Social network analysis in a movie using character-net", "paper_id": "WOS:000304134000010"}