{"auto_keywords": [{"score": 0.030693905273443046, "phrase": "social_network_information"}, {"score": 0.015719716506582538, "phrase": "social_networks"}, {"score": 0.004478308876320956, "phrase": "agent-based_model"}, {"score": 0.004287680323820891, "phrase": "product-sampling_campaigns"}, {"score": 0.00393032656248792, "phrase": "essential_decisions"}, {"score": 0.0036026484429137998, "phrase": "free_product_samples"}, {"score": 0.003424225677958491, "phrase": "weighted_real-world_personal_communication_network"}, {"score": 0.00269475174341129, "phrase": "high-degree_targeting_heuristic"}, {"score": 0.002469830206270585, "phrase": "single-purchase_products"}, {"score": 0.002182881082103045, "phrase": "repeat-purchase_products"}, {"score": 0.0021049977753042253, "phrase": "optimal_number"}], "paper_keywords": ["Agent-based models", " product diffusion", " product marketing", " product sampling", " sampling strategies", " social networks"], "paper_abstract": "Using an agent-based model to study the success of product-sampling campaigns that rely on information about social networks, this paper investigates the essential decisions of which consumers and how many of them to target with free product samples. With an unweighted and a weighted real-world personal communication network, we show that the decision of which consumers to target is more important than that of how many consumers to target. Use of social network information increases profits by at least 32 percent. Companies should use a high-degree targeting heuristic to identify the most influential consumers. Use of social network information increases profit for single-purchase products mainly because it supports targeting more influential consumers and therefore speeds up diffusion throughout the network. For repeat-purchase products, social network information decreases the optimal number of samples and thus the cost of the campaign.", "paper_title": "Optimal Product-Sampling Strategies in Social Networks: How Many and Whom to Target?", "paper_id": "WOS:000328083400003"}