{"auto_keywords": [{"score": 0.038354821270219504, "phrase": "service_quality"}, {"score": 0.03785602300199761, "phrase": "secondary_influence"}, {"score": 0.00481495049065317, "phrase": "service_quality_and_secondary_influence"}, {"score": 0.004592016716046632, "phrase": "internet_service_provider"}, {"score": 0.0044692705329574, "phrase": "broadband_market"}, {"score": 0.0035494788628319903, "phrase": "consumers'_behavioural_intention"}, {"score": 0.0033167679667625667, "phrase": "alternative_service_provider"}, {"score": 0.0031845067058084583, "phrase": "broadband_household_consumers"}, {"score": 0.002975652654536407, "phrase": "postal_survey"}, {"score": 0.002915701586760994, "phrase": "self-administered_questionnaire"}, {"score": 0.0024607296642187846, "phrase": "consumers'_behavioural_intentions"}, {"score": 0.0024111292002672907, "phrase": "isp."}, {"score": 0.0021049977753042253, "phrase": "future_research_directions"}], "paper_keywords": ["Behavioural intention to change internet service provider Broadband", " Secondary influence", " Service quality", " Adoption", " ICT"], "paper_abstract": "Although the broadband market has considerably matured, follow-up research on the continued adoption of broadband is yet to be conducted. The aim of this research was therefore to investigate empirically the influence of service quality and secondary influence on consumers' behavioural intention to change from their existing internet service provider (ISP) to an alternative service provider. The investigation focuses upon broadband household consumers within the UK. The study was conducted using a postal survey; a self-administered questionnaire was sent to 1600 households and a total of 358 completed replies were obtained. The results suggest that both service quality and secondary influence were significantly correlated to consumers' behavioural intentions to change ISP. The implications of these findings are presented, followed by a discussion of the limitations of this research and future research directions.", "paper_title": "Examining the influence of service quality and secondary influence on the behavioural intention to change internet service provider", "paper_id": "WOS:000276476500008"}