{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "genetic_programming"}, {"score": 0.004774324145784758, "phrase": "artificial_neural_network_development"}, {"score": 0.004615202066192795, "phrase": "artificial_neural_networks"}, {"score": 0.004480307124735185, "phrase": "slow_process"}, {"score": 0.004404994123834589, "phrase": "human_expert"}, {"score": 0.004186534737631288, "phrase": "best_results"}, {"score": 0.0036553070575015344, "phrase": "main_problems"}, {"score": 0.0032321559007422087, "phrase": "new_technique"}, {"score": 0.003032820755030689, "phrase": "graph_structures"}, {"score": 0.002857849698346116, "phrase": "simplified_networks"}, {"score": 0.0027741761880779535, "phrase": "small_group"}, {"score": 0.0025160740422447837, "phrase": "evolutionary_computation"}, {"score": 0.0024948913791197204, "phrase": "ec"}, {"score": 0.0022339789476489877, "phrase": "good_results"}, {"score": 0.0021410718792612173, "phrase": "already_existing_techniques"}], "paper_keywords": ["Artificial neural networks", " Evolutionary computation", " Genetic programming", " Data mining", " Soft computing"], "paper_abstract": "The development of artificial neural networks (ANNs) is usually a slow process in which the human expert has to test several architectures until he finds the one that achieves best results to solve a certain problem. However, there are some tools that provide the ability of automatically developing ANNs, many of them using evolutionary computation (EC) tools. One of the main problems of these techniques is that ANNs have a very complex structure, which makes them very difficult to be represented and developed by these tools. This work presents a new technique that modifies genetic programming (GP) so as to correctly and efficiently work with graph structures in order to develop ANNs. This technique also allows the obtaining of simplified networks that solve the problem with a small group of neurons. In order to measure the performance of the system and to compare the results with other ANN development methods by means of evolutionary computation (EC) techniques, several tests were performed with problems based on some of the most used test databases in the Data Mining domain. These comparisons show that the system achieves good results that are not only comparable to those of the already existing techniques but, in most cases, improve them.", "paper_title": "Modifying genetic programming for artificial neural network development for data mining", "paper_id": "WOS:000260518500007"}