{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "cognitive_maps"}, {"score": 0.042345396936738416, "phrase": "domain_experts"}, {"score": 0.0044025116437190785, "phrase": "related_tools"}, {"score": 0.004296264970612285, "phrase": "human_beings"}, {"score": 0.004244102948402086, "phrase": "machine_inferences"}, {"score": 0.0035913348026306306, "phrase": "modeling_capability"}, {"score": 0.00335095982979018, "phrase": "theoretical_equivalence"}, {"score": 0.0032833625797814474, "phrase": "cognitive_map_family"}, {"score": 0.00300234570467314, "phrase": "cm"}, {"score": 0.00260246764210499, "phrase": "cognitive_models"}, {"score": 0.0024882810071079797, "phrase": "constructive_approach"}, {"score": 0.002274684393868218, "phrase": "theoretical_analysis"}, {"score": 0.00224701149477484, "phrase": "simpler_cm_forms"}, {"score": 0.00220163445285539, "phrase": "theoretical_transformation_links"}, {"score": 0.0021571717917276724, "phrase": "strong_support"}], "paper_keywords": ["Dynamical cognitive network (DCN)", " equivalence", " fuzzy cognitive map (FCM)", " transformation"], "paper_abstract": "Cognitive maps (CMs), fuzzy cognitive maps (FCMs), and dynamical cognitive networks (DCNs) are related tools for modeling the cognition of human beings and facilitating machine inferences accordingly. FCMs extend CMs, and DCNs extend FCMs. Domain experts often face the challenge that CMs/FCMs are not sufficiently capable in many applications and that DCNs are too complex. This paper presents a simplified DCN(sDCN) that extends the modeling capability of FCM/CM, yet maintains simplicity. Additionally, this paper proves that there exists a theoretical equivalence among models in the cognitive map family of CMs, FCMs, and sDCNs. It shows that every sDCN can be represented by an FCM or a CM, and vice versa; similarly, every FCM can be represented by a CM, and vice versa. The result shows that CMs, FCMs, and sDCNs are a family of cognitive models that differs from many extended models. This paper also provides a constructive approach to transforming one cognitive map model into other cognitive map models in the family. Therefore, domain experts are able to model applications with more descriptive sDCNs and leave theoretical analysis to the simpler CM forms. The existence of theoretical transformation links among the models provides strong support for their theoretical analysis and flexibility in their applications.", "paper_title": "Transformation of Cognitive Maps", "paper_id": "WOS:000274217500010"}