{"auto_keywords": [{"score": 0.04906531875041212, "phrase": "fuzzy_time_series"}, {"score": 0.03754776323381931, "phrase": "temporal_information"}, {"score": 0.026574482737706604, "phrase": "proposed_method"}, {"score": 0.00481495049065317, "phrase": "temporal_information_granules"}, {"score": 0.004496174406337201, "phrase": "useful_temporal_information"}, {"score": 0.004419819325202464, "phrase": "better_interpretability"}, {"score": 0.004234532601573088, "phrase": "existing_literature"}, {"score": 0.0037078961288626185, "phrase": "resulting_temporal_intervals"}, {"score": 0.003388745581055085, "phrase": "unequal_length"}, {"score": 0.0032604908177429493, "phrase": "forecasting_quality"}, {"score": 0.0030837288356760973, "phrase": "gath-geva_clustering-based_time_series_segmentation"}, {"score": 0.002954287204671032, "phrase": "suitable_intervals"}, {"score": 0.002854645802851, "phrase": "information_granules"}, {"score": 0.0028181504086563967, "phrase": "effective_method"}, {"score": 0.0026425357050743003, "phrase": "well-defined_semantics"}, {"score": 0.0024252458095689847, "phrase": "alabama_university"}, {"score": 0.002373767863833987, "phrase": "experimental_results"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Fuzzy time series", " Gath-Geva (GG) clustering", " Information granules", " Enrollment", " Segmentation"], "paper_abstract": "Partitioning the universe of discourse and determining intervals containing useful temporal information and coming with better interpretability are critical for forecasting in fuzzy time series. In the existing literature, researchers seldom consider the effect of time variable when they partition the universe of discourse. As a result, and there is a lack of interpretability of the resulting temporal intervals. In this paper, we take the temporal information into account to partition the universe of discourse into intervals with unequal length. As a result, the performance improves forecasting quality. First, time variable is involved in partitioning the universe through Gath-Geva clustering-based time series segmentation and obtain the prototypes of data, then determine suitable intervals according to the prototypes by means of information granules. An effective method of partitioning and determining intervals is proposed. We show that these intervals carry well-defined semantics. To verify the effectiveness of the approach, we apply the proposed method to forecast enrollment of students of Alabama University and the Taiwan Stock Exchange Capitalization Weighted Stock Index. The experimental results show that the partitioning with temporal information can greatly improve accuracy of forecasting. Furthermore, the proposed method is not sensitive to its parameters. (C) 2013 Elsevier Ltd. All rights reserved.", "paper_title": "Determination of temporal information granules to improve forecasting in fuzzy time series", "paper_id": "WOS:000331018000046"}