{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "economic_environments"}, {"score": 0.04232113564008937, "phrase": "run-time_system"}, {"score": 0.004691805714620268, "phrase": "formal_scripting_language"}, {"score": 0.004480571767714176, "phrase": "well-defined_design_principles"}, {"score": 0.004442032546224076, "phrase": "explicit_an_agent's_rights"}, {"score": 0.004328383851864678, "phrase": "agent's_obligations"}, {"score": 0.0038907941451460566, "phrase": "agent-mediated_economic_environment"}, {"score": 0.0035175070315611088, "phrase": "appropriate_rights"}, {"score": 0.0033979190960152466, "phrase": "first-class_goods"}, {"score": 0.0032354070943654487, "phrase": "natural_and_expressive_recursive_statements"}, {"score": 0.003010389418340144, "phrase": "fundamental_axioms"}, {"score": 0.002776844761182965, "phrase": "economic_markets"}, {"score": 0.0027291997451172486, "phrase": "rich_set"}, {"score": 0.0027134999393695542, "phrase": "action-related_constructs"}, {"score": 0.002690118949960196, "phrase": "conditional_and_non-deterministic_effects"}, {"score": 0.0024107856296917813, "phrase": "economic_mechanisms"}, {"score": 0.002383120224166142, "phrase": "simple_two-agent_single-good_exchanges"}, {"score": 0.0021666388559669035, "phrase": "agent-mediated_markets"}, {"score": 0.0021049977753042253, "phrase": "electronic_market"}], "paper_keywords": ["Market semantics", " Rights", " Obligations", " Electronic transactions"], "paper_abstract": "We provide a formal scripting language to capture the semantics of economic environments. The language is based on a set of well-defined design principles and makes explicit an agent's rights, as derived from property, and an agent's obligations, as derived from restrictions placed on its actions either voluntarily or as a consequence of other actions. Coupled with the language is a run-time system that is able to monitor and enforce rights and obligations in an agent-mediated economic environment. The framework allows an agent to formally express guarantees (obligations) in relation to its actions, and the run-time system automatically checks that these obligations are met and verifies that an agent has appropriate rights before executing an action. Rights and obligations are viewed as first-class goods that can be transferred from one agent to another. This treatment makes it easy to define natural and expressive recursive statements, so that, for instance, one may have rights or obligations in selling or trading some other right or obligation. We define fundamental axioms about well-functioning markets in terms of rights and obligations, and delineate the difference between ownership and possession, arguably two of the most important notions in economic markets. The framework provides a rich set of action-related constructs for modeling conditional and non-deterministic effects, and introduces the use of transactions to safely bundle actions, including the issuing of rights and taking on of obligations. By way of example, we show that our language can represent a variety of economic mechanisms, ranging from simple two-agent single-good exchanges to complicated combinatorial auctions. The framework, which is fully implemented, can be used to formalize the semantics of markets; as a platform for prototyping, testing and evaluating agent-mediated markets; and also provide a basis for deploying an electronic market.", "paper_title": "Specifying and monitoring economic environments using rights and obligations", "paper_id": "WOS:000273978500003"}