{"auto_keywords": [{"score": 0.04939912794117237, "phrase": "wikipedia"}, {"score": 0.00481495049065317, "phrase": "controversial_wikipedia_articles"}, {"score": 0.004780633011300165, "phrase": "editor_collaboration_networks"}, {"score": 0.004596192494271827, "phrase": "high_quality"}, {"score": 0.004172957742905294, "phrase": "popular_topics"}, {"score": 0.0035015674744573377, "phrase": "previous_approaches"}, {"score": 0.0034026714408341868, "phrase": "social_process"}, {"score": 0.0032947371184395237, "phrase": "edit_history"}, {"score": 0.0031902155632863236, "phrase": "novel_approaches"}, {"score": 0.0031223774204093713, "phrase": "novel_controversy_model"}, {"score": 0.003066945490483524, "phrase": "interaction_history"}, {"score": 0.002804161833785297, "phrase": "collaboration_history"}, {"score": 0.0026384167183586015, "phrase": "supervised_way"}, {"score": 0.0025822818714499795, "phrase": "wikipedia_administrator_elections"}, {"score": 0.0023440589015485077, "phrase": "collaboration_network"}, {"score": 0.0022941723937662927, "phrase": "pairwise_attitude"}, {"score": 0.0022453451864218477, "phrase": "accurate_detection"}, {"score": 0.0022133711375320244, "phrase": "extensive_experimental_results"}, {"score": 0.0021430808503936963, "phrase": "previous_work"}, {"score": 0.0021049977753042253, "phrase": "wide_range"}], "paper_keywords": ["Algorithms", " Experimentation", " Wikipedia", " classification", " collaboration", " controversial articles"], "paper_abstract": "Wikipedia is probably the most commonly used knowledge reference nowadays, and the high quality of its articles is widely acknowledged. Nevertheless, disagreement among editors often causes some articles to become controversial over time. These articles span thousands of popular topics, including religion, history, and politics, to name a few, and are manually tagged as controversial by the editors, which is clearly suboptimal. Moreover, disagreement, bias, and conflict are expressed quite differently in Wikipedia compared to other social media, rendering previous approaches ineffective. On the other hand, the social process of editing Wikipedia is partially captured in the edit history of the articles, opening the door for novel approaches. This article describes a novel controversy model that builds on the interaction history of the editors and not only predicts controversy but also sheds light on the process that leads to controversy. The model considers the collaboration history of pairs of editors to predict their attitude toward one another. This is done in a supervised way, where the votes of Wikipedia administrator elections are used as labels indicating agreement (i.e., support vote) or disagreement (i.e., oppose vote). From each article, a collaboration network is built, capturing the pairwise attitude among editors, allowing the accurate detection of controversy. Extensive experimental results establish the superiority of this approach compared to previous work and very competitive baselines on a wide range of settings.", "paper_title": "Identifying Controversial Wikipedia Articles Using Editor Collaboration Networks", "paper_id": "WOS:000353638800005"}