{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "genetic_programming"}, {"score": 0.041955245636141274, "phrase": "biological_systems"}, {"score": 0.03736756140937009, "phrase": "modular_structure"}, {"score": 0.004619027561771169, "phrase": "developmental_evaluation"}, {"score": 0.004472146692254812, "phrase": "extant_gp_systems"}, {"score": 0.004410629943506433, "phrase": "developmental_gp_systems"}, {"score": 0.004329916183121203, "phrase": "modular_and_hierarchical_structure"}, {"score": 0.003947884118204803, "phrase": "high_degree"}, {"score": 0.003752275718257509, "phrase": "gp_systems"}, {"score": 0.003683565150278339, "phrase": "changing_environments"}, {"score": 0.0033428820402140683, "phrase": "individual_level"}, {"score": 0.0027528751037412128, "phrase": "adaptive_advantage"}, {"score": 0.0025212722607043546, "phrase": "tree_adjoining_grammar_guided_genetic_programming"}, {"score": 0.002407290605654707, "phrase": "good_properties"}, {"score": 0.0023522423291484212, "phrase": "incremental_development"}, {"score": 0.002204814150608646, "phrase": "gp"}, {"score": 0.002174303033371869, "phrase": "appropriate_problem"}, {"score": 0.0021049977753042253, "phrase": "modular_solutions"}], "paper_keywords": [""], "paper_abstract": "This paper investigates developmental evaluation in Genetic Programming (GP). Extant GP systems, including developmental GP systems, typically exhibit modular and hierarchical structure only to the degree it is built-in by the designer; by contrast, biological systems exhibit a high degree of organization in their genotypes. We hypothesise that even when GP systems are subject to changing environments, for which the adaptability arising from modular structure would be advantageous, the benefit is at the species rather than individual level, so that selection is very weak. By contrast, biological systems are selected repeatedly throughout their development process. We suggest that this difference is crucial; that if an individual is evaluated multiple times throughout its development, then modular structure can provide an adaptive advantage to that individual, and hence can be selected for by evolution. We investigate this hypothesis using Tree Adjoining Grammar Guided Genetic Programming (TAG3P) [1], which has good properties for supporting evaluation during incremental development. Our preliminary results show that developmental TAG3P outperforms both original TAG3P and standard tree-based GP on an appropriate problem, in ways which suggest that modular solutions may have been developed.", "paper_title": "Developmental evaluation in genetic programming: The preliminary results", "paper_id": "WOS:000237227900025"}