{"auto_keywords": [{"score": 0.04934553301452922, "phrase": "rural_africa"}, {"score": 0.00481495049065317, "phrase": "social_life"}, {"score": 0.004777917315737992, "phrase": "solar_charging"}, {"score": 0.004614745158543967, "phrase": "social_and_physical_environments"}, {"score": 0.004544016163767266, "phrase": "sustainable_hci_discourse"}, {"score": 0.004288261454002681, "phrase": "case_study"}, {"score": 0.004078232992955235, "phrase": "south_africa's_eastern_cape"}, {"score": 0.0036884198249734863, "phrase": "domestic_electricity"}, {"score": 0.0036038701178581403, "phrase": "nine_practices"}, {"score": 0.003548579306515579, "phrase": "charging_stations"}, {"score": 0.0030637124954859657, "phrase": "local_resources"}, {"score": 0.002902236818129282, "phrase": "interconnects_routines"}, {"score": 0.0026347074232350503, "phrase": "different_aspects"}, {"score": 0.0025942468561537682, "phrase": "social_order"}, {"score": 0.0023550410480905727, "phrase": "sustainable_practice"}, {"score": 0.0021049977753042253, "phrase": "\"_integrated_approach"}], "paper_keywords": ["Sustainability", " solar", " walking", " embodiment", " topokinesis", " rural", " Africa"], "paper_abstract": "We consider practices that sustain social and physical environments beyond those dominating sustainable HCI discourse. We describe links between walking, sociality, and using resources in a case study of community-based, solar, cellphone charging in villages in South Africa's Eastern Cape. Like 360 million rural Africans, inhabitants of these villages are poor and, like 25% and 92% of the world, respectively, do not have domestic electricity or own motor vehicles. We describe nine practices in using the charging stations we deployed. We recorded 700 people using the stations, over a year, some regularly. We suggest that the way we frame practices limits insights about them, and consider various routines in using and sharing local resources to discover relations that might also feature in charging. Specifically, walking interconnects routines in using, storing, sharing and sustaining resources, and contributes to knowing, feeling, wanting and avoiding as well as to different aspects of sociality, social order and perspectives on sustainability. Along the way, bodies acquire literacies that make certain relationalities legible. Our study shows we cannot assert what sustainable practice means a priori and, further, that detaching practices from bodies and their paths limits solutions, at least in rural Africa. Thus, we advocate a more \"alongly\" integrated approach to data about practices.", "paper_title": "Walking and the Social Life of Solar Charging in Rural Africa", "paper_id": "WOS:000325641800003"}