{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "text-overlaid_images"}, {"score": 0.019940474089351897, "phrase": "aesthetic_appeal"}, {"score": 0.004706305193222972, "phrase": "computational_models"}, {"score": 0.004600100053651545, "phrase": "visual_weights"}, {"score": 0.0040111533608228195, "phrase": "first_experiment"}, {"score": 0.003974673997871831, "phrase": "five_color_photos"}, {"score": 0.003832031470970347, "phrase": "test_images"}, {"score": 0.0037284065559949064, "phrase": "chinese_texts"}, {"score": 0.0035945701438887282, "phrase": "second_experiment"}, {"score": 0.003561865840737996, "phrase": "monochrome_photos"}, {"score": 0.0034027387694902287, "phrase": "text_overlay"}, {"score": 0.0032064196784562017, "phrase": "computational_aesthetic_quantification_algorithms"}, {"score": 0.0029802289354540507, "phrase": "ratio-scale_magnitude_estimation_method"}, {"score": 0.0025744696954056404, "phrase": "radial_symmetry"}, {"score": 0.002539379289856756, "phrase": "center_point"}, {"score": 0.0023927516438886445, "phrase": "higher_averaged_visual_balance"}, {"score": 0.002193509835371438, "phrase": "proportional_relations"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Computational aesthetics", " Interface design", " Compositional attributes"], "paper_abstract": "This article describes computational models based on principles of visual weights to compute the symmetry and balance of text-overlaid images. Two experiments were conducted to investigate the effects of symmetry and balance on the aesthetic appeal of text-overlaid images. In the first experiment, five color photos were used to compose a set of test images overlaid with a paragraph of Chinese texts as the stimuli. Contrastly, the second experiment applied monochrome photos to compute the stimuli. The positions of the text overlay were determined by varying the balance and symmetry in order to validate computational aesthetic quantification algorithms with subjective ratings. The stimuli were rated by 20 subjects in each experiment using the ratio-scale magnitude estimation method against a benchmark image for each photo. Results from both experiments show that subjects are adept at judging symmetry and balance in both the horizontal and vertical directions. Subjects are also adept at judging radial symmetry about the center point of an image. The experiments also established a relationship between a higher averaged visual balance and the aesthetic appeal of text-overlaid images. Symmetry in either direction, however, did not result in any proportional relations to the aesthetic appeal. (C) 2009 Elsevier Ltd. All rights reserved.", "paper_title": "Computational models and experimental investigations of effects of balance and symmetry on the aesthetics of text-overlaid images", "paper_id": "WOS:000273311200003"}