{"auto_keywords": [{"score": 0.03738598763994484, "phrase": "csit"}, {"score": 0.007152330893639651, "phrase": "freedom_region"}, {"score": 0.0069737563802007236, "phrase": "output_feedback"}, {"score": 0.004742290714667451, "phrase": "mimo_interference_channel"}, {"score": 0.004032002950217457, "phrase": "noiseless_channel_output_feedback"}, {"score": 0.0038520615699124123, "phrase": "delayed_channel_state_information"}, {"score": 0.0038163033582323804, "phrase": "global_feedback"}, {"score": 0.003410380718649286, "phrase": "mimo_ic"}, {"score": 0.0031603487697867538, "phrase": "proposed_coding_schemes"}, {"score": 0.00309681702203087, "phrase": "corresponding_region"}, {"score": 0.0028263192354046245, "phrase": "nontrivial_manner"}, {"score": 0.002686360550456695, "phrase": "local_feedback"}, {"score": 0.0026592094867526803, "phrase": "delayed_csit"}, {"score": 0.002271725588755076, "phrase": "dof_region"}, {"score": 0.002181227522730908, "phrase": "stronger_setting"}], "paper_keywords": ["Delayed channel state information at the transmitters (CSIT)", " interference channel (IC)", " multiple-input multipleoutput (MIMO)", " output feedback"], "paper_abstract": "The two-user multiple-input multiple-output (MIMO) interference channel (IC) with arbitrary numbers of antennas at each terminal is considered and the degrees of freedom region is characterized in the presence of noiseless channel output feedback from each receiver to its respective transmitter and availability of delayed channel state information at the transmitters (CSIT). It is shown that having output feedback and delayed CSIT can strictly enlarge the region of the MIMO IC when compared to the case in which only delayed CSIT is present. The proposed coding schemes that achieve the corresponding region with feedback and delayed CSIT utilize both resources, i.e., feedback and delayed CSIT in a nontrivial manner. It is also shown that the region with local feedback and delayed CSIT is equal to the region with global feedback and delayed CSIT, i.e., local feedback and delayed CSIT is equivalent to global feedback and delayed CSIT from the perspective of the DoF region. The converse is proved for a stronger setting in which the channels to the two receivers need not be statistically equivalent.", "paper_title": "Degrees of Freedom Region of the MIMO Interference Channel With Output Feedback and Delayed CSIT", "paper_id": "WOS:000315120400015"}