{"auto_keywords": [{"score": 0.04978464912522234, "phrase": "sensor_networks"}, {"score": 0.04805541544871024, "phrase": "intrusion_objects"}, {"score": 0.02607325489768803, "phrase": "sensor_nodes"}, {"score": 0.0094309953223027, "phrase": "two-dimensional_plane"}, {"score": 0.009202290986541024, "phrase": "three-dimensional_space"}, {"score": 0.00747287848754162, "phrase": "randomized_scheduling_algorithm"}, {"score": 0.007313763950862772, "phrase": "intrusion_object's_size"}, {"score": 0.00481495049065317, "phrase": "randomized_scheduling_algorithms"}, {"score": 0.004697655699119423, "phrase": "wireless_sensor_networks"}, {"score": 0.004569095351567258, "phrase": "enemy_tanks"}, {"score": 0.004403113609805679, "phrase": "limited_energy_supply"}, {"score": 0.004269391057037737, "phrase": "sleep_mode"}, {"score": 0.0041653307620376535, "phrase": "special_case"}, {"score": 0.003989266720020083, "phrase": "important_factors"}, {"score": 0.003832423454781517, "phrase": "extremely_large_object"}, {"score": 0.0037971101834761017, "phrase": "small_sensor_field"}, {"score": 0.003727453167164546, "phrase": "even_one_sensor_node"}, {"score": 0.0036590692974951718, "phrase": "sensor_node"}, {"score": 0.0035808664384880213, "phrase": "intrusion_object"}, {"score": 0.003335452981547803, "phrase": "dead_sensor_nodes"}, {"score": 0.0030030452897701863, "phrase": "intrusion_coverage_intensity"}, {"score": 0.002678734566245688, "phrase": "different_sizes"}, {"score": 0.0024340759772801847, "phrase": "two-dimensional_and_three-dimensional_gaussian_distributions"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Wireless sensor network", " Randomized scheduling algorithm", " Coverage", " Intrusion object", " Energy consumption", " Two-dimensional", " Three-dimensional"], "paper_abstract": "We are interested in wireless sensor networks which are used to detect intrusion objects such as enemy tanks, cars, submarines, etc. Since sensor nodes have a limited energy supply, sensor networks are configured to put some sensor nodes in sleep mode to save energy. This is a special case of a randomized scheduling algorithm. Ignored by many studies, an intrusion object's size and shape are important factors that greatly affect the performance of sensor networks. For example. an extremely large object in a small sensor field can easily be detected by even one sensor node, no matter where the sensor node is deployed. The larger an intrusion object is, the fewer sensor nodes that are required for detection. Furthermore, using fewer sensor nodes can save resources and reduce the waste of dead sensor nodes in the environment. Therefore, studying coverage based on intrusion object's size is important. In this paper, we study the performance of the randomized scheduling algorithm via both analysis and simulation in terms of intrusion coverage intensity. In particular, we study cases where intrusion objects occupy areas in a two-dimensional plane and where intrusion objects occupy areas in a three-dimensional space, respectively. We also study the deployment of sensor nodes when intrusion objects are of different sizes and shapes. First, sensor nodes are deployed in a two-dimensional plane and a three-dimensional space with uniform distributions. Then, they are deployed in a two-dimensional plane and a three-dimensional space in two-dimensional and three-dimensional Gaussian distributions, respectively. Therefore, our study not only demonstrates the impact of the size and shape of intrusion objects on the performance of sensor networks, but also provides a guideline on how to configure sensor networks to meet a certain detecting capability in more realistic situations. (C) 2009 Elsevier B.V. All rights reserved.", "paper_title": "Two and three-dimensional intrusion object detection under randomized scheduling algorithms in sensor networks", "paper_id": "WOS:000269293200006"}