{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "rational_space_curves"}, {"score": 0.02203900912549416, "phrase": "space_curve"}, {"score": 0.010333987070120903, "phrase": "moving_planes"}, {"score": 0.008464134246064143, "phrase": "singular_point"}, {"score": 0.00445567251116082, "phrase": "homogeneous_degree_d"}, {"score": 0.004156317513592256, "phrase": "moving_plane"}, {"score": 0.0039928131591293724, "phrase": "left_right_arrow"}, {"score": 0.003626071825044111, "phrase": "degree_d_-_k"}, {"score": 0.0032491108935498794, "phrase": "vertex_p"}, {"score": 0.0030063184802762775, "phrase": "generic_moving_planes"}, {"score": 0.0023495319175424537, "phrase": "proper_multiplicity"}, {"score": 0.0023120501704065777, "phrase": "singularity_p."}, {"score": 0.0022690748070048764, "phrase": "straightforward_algorithms"}, {"score": 0.002238866955912704, "phrase": "low_degree"}, {"score": 0.0021679951725168565, "phrase": "linear_algebra"}], "paper_keywords": ["Axial moving planes", " mu-basis", " Singularity", " Rational space curve"], "paper_abstract": "Relationships between the singularities of rational space curves and the moving planes that follow these curves are investigated. Given a space curve C with a generic 1-1 rational parametrization F(s, t) of homogeneous degree d, we show that if P and Q are two singular points of orders k and k' on the space curve C, then there is a moving plane of degree d - k - k' with axis (PQ) over left right arrow that follows the curve. We also show that a point P is a singular point of order k on the space curve C if and only if there are two axial moving planes L(1) and L(2) of degree d - k such that: (1) the axes of L(1), L(2) are orthogonal and intersect at P, and (2) the intersection of the moving planes L(1) and L(2) is the cone through the curve C with vertex P together with d - k copies of the plane containing the axes of L(1) and L(2). In addition, we study relationships between the singularities of rational space curves and generic moving planes that follow these curves. In particular, we show that if p(s, t), q(s. t), r(s, t) are a it-basis for the moving planes that follow a rational space curve F(s, t), then P is a singular point of F(s, t) of order k if and only if deg(gcd(p(s, t) - P, q(s, t) - P, r(s. t) - P)) = k. Moreover, the roots of this gcd are the parameters, counted with proper multiplicity, that correspond to the singularity P. Using these results, we provide straightforward algorithms for finding all the singularities of low degree rational space curves. Our algorithms are easy to implement, requiring only standard techniques from linear algebra. Examples are provided to illustrate these algorithms. (c) 2008 Elsevier B.V. All rights reserved.", "paper_title": "Axial moving planes and singularities of rational space curves", "paper_id": "WOS:000263631900005"}