{"auto_keywords": [{"score": 0.038344413740221184, "phrase": "social_responsibility"}, {"score": 0.00481495049065317, "phrase": "social_well-being"}, {"score": 0.0047784273577245505, "phrase": "purpose_-_the_paper"}, {"score": 0.004041155193307942, "phrase": "broader_society's_well-being"}, {"score": 0.0037589124802364384, "phrase": "human_ambition"}, {"score": 0.0035908627899097407, "phrase": "next_step"}, {"score": 0.0034697573205392887, "phrase": "new_forms"}, {"score": 0.003365529624506815, "phrase": "relationship_marketing"}, {"score": 0.0029789104204803137, "phrase": "new_data"}, {"score": 0.0026265465397867093, "phrase": "findings_-_companies"}, {"score": 0.002557322657104706, "phrase": "innovative_products"}, {"score": 0.0023694065215394593, "phrase": "\"open_innovation\"_model"}, {"score": 0.0023424328921363585, "phrase": "extremely_demanding_market"}, {"score": 0.0023157656212149367, "phrase": "affluent_and_nearly_affluent_society"}, {"score": 0.0021049977753042253, "phrase": "new_challenges"}], "paper_keywords": ["Cybernetics", " Innovation", " Marketing", " Social responsibility"], "paper_abstract": "Purpose - The paper aims to answer the following questions. Is marketing requisitely holistic? Marketing serves managers, governors, owners and employees as well as customers, suppliers and other stakeholders with its activities in order to help company increase well-being of stakeholders. What about the broader society's well-being and future? What will follow, once the innovative-society phase of socio-economic development creates affluence, which diminishes human ambition to work in order to have? Social responsibility might be the next step in achieving success. Design/methodology/approach - There are new forms of marketing (e.g. societal marketing; relationship marketing; cause-related marketing; and green marketing) that could help humans accomplishing this task, to some extent. Marketing will have to detect, elaborate and disseminate new data, along with using them for its action; the paper does not tackle the latter, but marketing taking into account the social responsibility of the company in order to help companies. Findings - Companies will namely need more/requisitely holistic bases to develop innovative products, acceptable with social responsibility. Experience says that ethnographers, anthropologists, and other social scientists are becoming necessary in the \"open innovation\" model and the extremely demanding market of the affluent and nearly affluent society. So is a more systemic/holistic thinking and action of companies, including their marketing. Originality/value - The paper suggests how marketing must adapt to meet new challenges.", "paper_title": "A requisitely holistic approach to marketing in terms of social well-being", "paper_id": "WOS:000261315700038"}