{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "data-driven_reconstruction_methods"}, {"score": 0.00438955582974973, "phrase": "auto-associative_kernel_regression"}, {"score": 0.004076352180903171, "phrase": "elman_recurrent_neural_network"}, {"score": 0.0039281997063335735, "phrase": "fault_detection"}, {"score": 0.0037621210719690594, "phrase": "signal_observations"}, {"score": 0.0027457584014804574, "phrase": "fault_detection_capability"}, {"score": 0.002565345470805401, "phrase": "spillover_effect"}, {"score": 0.002518227743688769, "phrase": "obtained_signal_reconstructions"}, {"score": 0.0023527296826339225, "phrase": "real_industrial_case_study"}, {"score": 0.002225426912273257, "phrase": "rotating_machine"}, {"score": 0.0021845387990972543, "phrase": "energy_production_plant"}], "paper_keywords": ["Auto-associative kernel regression", " Elman recurrent neural network", " ensemble of methods", " fault detection", " fuzzy similarity", " signal reconstruction"], "paper_abstract": "This work proposes a comparison of three data-driven signal reconstruction methods, which are Auto-Associative Kernel Regression (AAKR), Fuzzy Similarity (FS), and Elman Recurrent Neural Network (RNN), for fault detection based on the difference between the signal observations and the reconstructions of the signal in normal ( typical) operating conditions. The aim is to show the capabilities and drawbacks of the methods, and propose a strategy for the aggregation of their outcomes, to overcome their limitations. For this purpose, the performance of each method is evaluated in terms of fault detection capability, considering accuracy, robustness, and resistance to the spillover effect of the obtained signal reconstructions. The comparison is supported by the application to a real industrial case study regarding temperature signals collected during operation of a rotating machine in an energy production plant. An ensemble of the three methods is proposed to overcome the limitations of the three methods.", "paper_title": "Comparison of Data-Driven Reconstruction Methods For Fault Detection", "paper_id": "WOS:000360794600003"}