{"auto_keywords": [{"score": 0.042719458235266974, "phrase": "status_positions"}, {"score": 0.00481495049065317, "phrase": "scientific_collaboration"}, {"score": 0.004551199992546761, "phrase": "collaborative_scientific_research"}, {"score": 0.004494570360108983, "phrase": "homophily_structures"}, {"score": 0.004328856052035968, "phrase": "similar_partners"}, {"score": 0.004288386935585756, "phrase": "higher_rate"}, {"score": 0.004261617028111862, "phrase": "dissimilar_ones"}, {"score": 0.004015458740397976, "phrase": "constraint_shapes"}, {"score": 0.00389164348807591, "phrase": "social_contact"}, {"score": 0.0037363522297378777, "phrase": "institutional_or_geographic_space"}, {"score": 0.003542557455905503, "phrase": "institutional_boundaries"}, {"score": 0.0035204268675160257, "phrase": "geographic_constraint"}, {"score": 0.0034225318244532387, "phrase": "different_institutions"}, {"score": 0.003028727936200845, "phrase": "formal_co-authorship"}, {"score": 0.0030003766828110277, "phrase": "also_other_forms"}, {"score": 0.0029816229984366374, "phrase": "informal_intellectual_exchange"}, {"score": 0.0028986672783671147, "phrase": "joint_work"}, {"score": 0.0028715299874549245, "phrase": "community-detection_algorithm"}, {"score": 0.002765490759189057, "phrase": "co-authorship_network"}, {"score": 0.0025892330566358503, "phrase": "research-based_homophily"}, {"score": 0.0025014259919355453, "phrase": "potential_partners"}, {"score": 0.0023939545398857518, "phrase": "strong_support"}, {"score": 0.0023493172499168763, "phrase": "institutional_and_geographic_constraints"}, {"score": 0.002305510336172047, "phrase": "intra-institutional_collaborations"}, {"score": 0.002172093645267283, "phrase": "geographic_proximity"}, {"score": 0.0021182494144182788, "phrase": "tie_creation"}, {"score": 0.0021049977753042253, "phrase": "joint_scientific_endeavours"}], "paper_keywords": ["Collaboration networks", " Community structure", " Intra- and inter-institutional collaborations", " Geographic distance", " Research specialty"], "paper_abstract": "This paper investigates the role of homophily and focus constraint in shaping collaborative scientific research. First, homophily structures collaboration when scientists adhere to a norm of exclusivity in selecting similar partners at a higher rate than dissimilar ones. Two dimensions on which similarity between scientists can be assessed are their research specialties and status positions. Second, focus constraint shapes collaboration when connections among scientists depend on opportunities for social contact. Constraint comes in two forms, depending on whether it originates in institutional or geographic space. Institutional constraint refers to the tendency of scientists to select collaborators within rather than across institutional boundaries. Geographic constraint is the principle that, when collaborations span different institutions, they are more likely to involve scientists that are geographically co-located than dispersed. To study homophily and focus constraint, the paper will argue in favour of an idea of collaboration that moves beyond formal co-authorship to include also other forms of informal intellectual exchange that do not translate into the publication of joint work. A community-detection algorithm for formalising this perspective will be proposed and applied to the co-authorship network of the scientists that submitted to the 2001 Research Assessment Exercise in Business and Management in the UK. While results only partially support research-based homophily, they indicate that scientists use status positions for discriminating between potential partners by selecting collaborators from institutions with a rating similar to their own. Strong support is provided in favour of institutional and geographic constraints. Scientists tend to forge intra-institutional collaborations; yet, when they seek collaborators outside their own institutions, they tend to select those who are in geographic proximity. The implications of this analysis for tie creation in joint scientific endeavours are discussed.", "paper_title": "Community structure and patterns of scientific collaboration in Business and Management", "paper_id": "WOS:000294839200023"}