{"auto_keywords": [{"score": 0.04281855449450447, "phrase": "vvt_methods"}, {"score": 0.02322730111336097, "phrase": "analytical_model"}, {"score": 0.021032030390984988, "phrase": "customer_and_engineering_requirements"}, {"score": 0.0047864177420244795, "phrase": "planning_systems_verification"}, {"score": 0.004687871834372534, "phrase": "system_vvt"}, {"score": 0.0045236118305957175, "phrase": "system_engineering"}, {"score": 0.004313477880211006, "phrase": "best_way"}, {"score": 0.004249825947483216, "phrase": "sub-optimal_vvt_processes"}, {"score": 0.004125314447335291, "phrase": "effective_approach"}, {"score": 0.004064427818174677, "phrase": "vvt_activities"}, {"score": 0.0036625643243684827, "phrase": "intuitive_manner"}, {"score": 0.003587073648802551, "phrase": "small_amount"}, {"score": 0.0034922880300145283, "phrase": "new_chair"}, {"score": 0.0034304883989739804, "phrase": "simple_toy"}, {"score": 0.003241889436209603, "phrase": "large_amount"}, {"score": 0.0031095683360022447, "phrase": "camera_pod"}, {"score": 0.0030273620861817055, "phrase": "structured_process"}, {"score": 0.002991524908432975, "phrase": "overall_impact"}, {"score": 0.002719644855867468, "phrase": "appropriate_vvt_approach"}, {"score": 0.002616364603666959, "phrase": "system_hierarchy"}, {"score": 0.0025623821393275146, "phrase": "project_size"}, {"score": 0.002465059277476973, "phrase": "decision_process"}, {"score": 0.002428617044669043, "phrase": "optimal_vvt_methods"}, {"score": 0.002336362867844443, "phrase": "optimization_problem"}, {"score": 0.002214370556271579, "phrase": "risk_constraints"}, {"score": 0.002142970278347126, "phrase": "sample_problem"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Verification", " Validation", " Methods of verification", " Quality", " Cost", " Risk"], "paper_abstract": "System VVT (verification, validation, and testing) are three tasks of System Engineering that focus on ensuring that systems are designed and delivered to meet customer and engineering requirements in the best way possible. Most organizations use sub-optimal VVT processes and methods. The literature does not offer an effective approach for associating VVT methods to VVT activities in order to satisfy customer and engineering requirements. In many large and complex projects, the project manager faces the dilemma of how best to validate and verify customer and engineering requirements, respectively. In many cases, decisions are made in an intuitive manner. For a project with a small amount of requirements (e.g., design of a new chair, table, or a simple toy), optimum decisions for VVT methods to be included within the project are feasible. For projects with large amount of requirements, for example, design of a new payload (e.g., captive carriage of a fuel tank, camera pod or other equipment) on an aircraft, a structured process to evaluate the overall impact of VVT methods implemented in order to satisfy those requirements, and the risk involved by performing these and not other methods, is necessary. This paper proposes a model for selecting an appropriate VVT approach depending on the phase or the level of the product in the system hierarchy; the model is independent of project size or precedence. We present an analytical model that not only structures the decision process but also outputs the optimal VVT methods given Cost and Risk constraints. The analytical model was formulated as an optimization problem, where a function that associates Quality derived from incorporating VVT methods is maximized subject to Cost and/or Risk constraints. The use of the model is demonstrated on a sample problem. (C) 2012 Elsevier Ltd. All rights reserved.", "paper_title": "Developing an analytical model for planning systems verification, validation and testing processes", "paper_id": "WOS:000308122400020"}