{"auto_keywords": [{"score": 0.04955111375780366, "phrase": "peer_review"}, {"score": 0.00481495049065317, "phrase": "ecology_journals"}, {"score": 0.0036892809673917592, "phrase": "journal_reputation"}, {"score": 0.0036485497734171294, "phrase": "rejection_rate"}, {"score": 0.0032290277960438855, "phrase": "higher_impact_factor"}, {"score": 0.0030208364972341096, "phrase": "higher_impact_factor_journals"}, {"score": 0.002542890176213921, "phrase": "revision_processes"}, {"score": 0.00251478366610296, "phrase": "rejection_rates"}, {"score": 0.0023265270905455334, "phrase": "increasing_impact_factor"}, {"score": 0.0022377394845878268, "phrase": "plausible_causes"}, {"score": 0.0021049977753042253, "phrase": "peer_reviewers"}], "paper_keywords": ["Editorial rejection", " Peer-reviewed literature", " Publish or perish", " Quality control", " Standing of a journal", " Scientific Technological and Medical (STM) publishing"], "paper_abstract": "Peer review is fundamental to science as we know it, but is also a source of delay in getting discoveries communicated to the world. Researchers have investigated the effectiveness and bias of various forms of peer review, but little attention has been paid to the relationships among journal reputation, rejection rate, number of submissions received and time from submission to acceptance. In 22 ecology/interdisciplinary journals for which data could be retrieved, higher impact factor is positively associated with the number of submissions. However, higher impact factor journals tend to be significantly quicker in moving from submission to acceptance so that journals which receive more submissions are not those which take longer to get them through the peer review and revision processes. Rejection rates are remarkably high throughout the journals analyzed, but tend to increase with increasing impact factor and with number of submissions. Plausible causes and consequences of these relationships for journals, authors and peer reviewers are discussed.", "paper_title": "Peer review delay and selectivity in ecology journals", "paper_id": "WOS:000278695500003"}