{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "new_perspectives"}, {"score": 0.004602085616330634, "phrase": "widespread_presumption"}, {"score": 0.004564401713056939, "phrase": "matter_and_objects"}, {"score": 0.00405127920820053, "phrase": "third_view"}, {"score": 0.00292674497467906, "phrase": "object_identity"}, {"score": 0.002797121441432477, "phrase": "internal_processes"}, {"score": 0.0025972447844047515, "phrase": "potentially_open-ended_recursive_decomposition"}, {"score": 0.0025130460190930554, "phrase": "complex_web"}, {"score": 0.002492425259337031, "phrase": "mutual_interdependency"}, {"score": 0.0021049977753042253, "phrase": "highly_general_top-level_ontology"}], "paper_keywords": ["Object", " process", " event", " change", " device", " role"], "paper_abstract": "We challenge the widespread presumption that matter and objects are ontologically prior to processes and events, and also the less widespread but increasingly popular view that processes and events are ontologically prior to matter and objects. Instead we advance a third view according to which each of these pairs of categories is ontologically dependent on the other. In particular, taking a cue from an ontology of devices, we identify the object as an interface between those processes which are internal to it and those which are external to it and which it may be said to enact, thereby linking objects intrinsically to the processes in which they are involved as well as providing a more powerful determinant of object identity than more traditional, non-dynamic criteria based on demarcation from the environment. The internal processes are themselves external processes in relation to the components of the object which enact them, leading to a potentially open-ended recursive decomposition of both objects and processes in a complex web of mutual interdependency. We also discuss how matter is related to objects, and processes to events, bringing the four categories together in a diagram which clarifies the relations between them - often considered problematic - and establishes a framework for a highly general top-level ontology.", "paper_title": "The water falls but the waterfall does not fall: New perspectives on objects, processes and events", "paper_id": "WOS:000207936600001"}