{"auto_keywords": [{"score": 0.04980594858796438, "phrase": "focused_crawlers"}, {"score": 0.04899661771179049, "phrase": "web_pages"}, {"score": 0.04819977108624374, "phrase": "specific_topic"}, {"score": 0.037425327543083246, "phrase": "crawling_process"}, {"score": 0.00481495049065317, "phrase": "focused_crawling"}, {"score": 0.004599664074521038, "phrase": "user_interest"}, {"score": 0.004547356716604537, "phrase": "important_role"}, {"score": 0.004508515162768118, "phrase": "great_variety"}, {"score": 0.004209441837971891, "phrase": "implicitly_declared_topic"}, {"score": 0.0032443276816348575, "phrase": "desired_pages"}, {"score": 0.0029602552900111407, "phrase": "proposed_approach"}, {"score": 0.0028195727965553367, "phrase": "computer_science_courses"}, {"score": 0.00280346649494565, "phrase": "job_offers"}, {"score": 0.0027794789059440023, "phrase": "computer_science_field"}, {"score": 0.00273995357773402, "phrase": "computer_equipments"}, {"score": 0.002536004981903211, "phrase": "visited_pages"}, {"score": 0.0024785363812738384, "phrase": "relevant_pages"}, {"score": 0.002401632317461758, "phrase": "term_selection"}, {"score": 0.002360692782721461, "phrase": "proposed_strategy"}, {"score": 0.002347201580471729, "phrase": "semi-automatic_generation"}, {"score": 0.0022808906900615325, "phrase": "small_set"}, {"score": 0.0021849126349043654, "phrase": "typical_user"}, {"score": 0.00212317681899899, "phrase": "good_results"}], "paper_keywords": ["web crawling", " focused crawling", " document genre exploitation"], "paper_abstract": "Focused crawlers have as their main goal to crawl Web pages that are relevant to a specific topic or user interest, playing an important role for a great variety of applications. In general, they work by trying to find and crawl all kinds of pages deemed as related to an implicitly declared topic. However, users are often not simply interested in any document about a topic, but instead they may want only documents of a given type or genre on that topic to be retrieved. In this article, we describe an approach to focused crawling that exploits not only content-related information but also genre information present in Web pages to guide the crawling process. This approach has been designed to address situations in which the specific topic of interest can be expressed by specifying two sets of terms, the first describing genre aspects of the desired pages and the second related to the subject or content of these pages, thus requiring no training or any kind of preprocessing. The effectiveness, efficiency and scalability of the proposed approach are demonstrated by a set of experiments involving the crawling of pages related to syllabi of computer science courses, job offers in the computer science field and sale offers of computer equipments. These experiments show that focused crawlers constructed according to our genre-aware approach achieve levels of F1 superior to 88%, requiring the analysis of no more than 65% of the visited pages in order to find 90% of the relevant pages. In addition, we experimentally analyze the impact of term selection on our approach and evaluate a proposed strategy for semi-automatic generation of such terms. This analysis shows that a small set of terms selected by an expert or a set of terms specified by a typical user familiar with the topic is usually enough to produce good results and that such a semi-automatic strategy is very effective in supporting the task of selecting the sets of terms required to guide a crawling process.", "paper_title": "A Genre-Aware Approach to Focused Crawling", "paper_id": "WOS:000268953500002"}