{"auto_keywords": [{"score": 0.04838919478929022, "phrase": "internet-based_systems"}, {"score": 0.048021200294285325, "phrase": "business-to-consumer_electronic_commerce"}, {"score": 0.03994855929694926, "phrase": "greatest_extent"}, {"score": 0.00481495049065317, "phrase": "neural_networks"}, {"score": 0.004776669953449352, "phrase": "genetic_algorithms"}, {"score": 0.004137184278868391, "phrase": "security_controls"}, {"score": 0.0032036614749892424, "phrase": "bpn"}, {"score": 0.0027852927366010406, "phrase": "standardized_coefficients"}, {"score": 0.002752075650871066, "phrase": "ga-based_nonlinear_regression_analysis"}, {"score": 0.002708399936381754, "phrase": "conventional_linear_regression_analysis"}, {"score": 0.002623111480310373, "phrase": "average_r_square"}, {"score": 0.002581477142020187, "phrase": "squared_error"}, {"score": 0.0025202582748972122, "phrase": "best_set"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["ISB2C", " ISB2C controls", " Neural networks", " Genetic algorithms", " ISB2C implementation"], "paper_abstract": "As organizations become increasingly dependent on Internet-based systems for business-to-consumer electronic commerce (ISB2C), the issue of IS security becomes increasingly important. As the usage of security controls is related to the implementation of ISB2C, the extent of ISB2C controls can be adjusted in order to enable the greatest extent of implementation of ISB2C. This study intends to propose ISB2C-NNGA (ISB2C-controls design using neural networks and genetic algorithms), a hybrid optimization model using neural networks and genetic algorithms for the design of ISB2C controls, which uses back-propagation neural networks (BPN) model as a prediction of controls using system environments, and GA as a pattern directed search mechanism to estimate the exponent of independent variables (i.e., ISB2C controls) in multivariate regression analysis of power model. The effect of system environments on controls can be estimated using BPN model which outperformed linear regression analysis in terms of square root of mean squared error. The effect of each mode of controls on implementation (volume) can be identified using exponents and standardized coefficients in the GA-based nonlinear regression analysis in ISB2C-NNGA. ISB2C-NNGA outperformed conventional linear regression analysis in prediction accuracy in terms of the average R square and sum of squared error. ISB2C can suggest the best set of values for controls to be recommended from several candidate sets of values for controls by identifying the set of values for controls which produce greatest extent of ISB2C implementation. The results of study will support the design of ISB2C controls effectively. (C) 2010 Elsevier Ltd. All rights reserved.", "paper_title": "The hybrid model of neural networks and genetic algorithms for the design of controls for internet-based systems for business-to-consumer electronic commerce", "paper_id": "WOS:000286904600153"}