{"auto_keywords": [{"score": 0.049505168345722585, "phrase": "machine_learning"}, {"score": 0.015257760143699194, "phrase": "wide_range"}, {"score": 0.012792231362867697, "phrase": "machine-learning_algorithms"}, {"score": 0.008257227569178056, "phrase": "training_dataset"}, {"score": 0.00481495049065317, "phrase": "defenses_for_machine_learning"}, {"score": 0.0047860440374869855, "phrase": "healthcare"}, {"score": 0.004643839937761046, "phrase": "application_domains"}, {"score": 0.004574342831225094, "phrase": "large_datasets"}, {"score": 0.004438439373358016, "phrase": "critical_decisions"}, {"score": 0.004203864747683794, "phrase": "security_breach"}, {"score": 0.00399367108161192, "phrase": "great_importance"}, {"score": 0.003969640975997097, "phrase": "recent_research"}, {"score": 0.00381691770211996, "phrase": "malicious_data"}, {"score": 0.0037597491055035895, "phrase": "new_class"}, {"score": 0.003615071654787124, "phrase": "life-threatening_consequences"}, {"score": 0.003465463460811278, "phrase": "false_diagnosis"}, {"score": 0.0034032496750682753, "phrase": "machine-learning_algorithm"}, {"score": 0.003352256019007896, "phrase": "entire_system"}, {"score": 0.0030526626660835024, "phrase": "proposed_attack_procedure"}, {"score": 0.0030342774028555377, "phrase": "input_data"}, {"score": 0.002754687859754749, "phrase": "specific_class"}, {"score": 0.002705199644897355, "phrase": "arbitrary_errors"}, {"score": 0.002600995957987461, "phrase": "fixed_and_evolving_datasets"}, {"score": 0.0023755529073496394, "phrase": "lower_efficacy"}, {"score": 0.002318799760022913, "phrase": "proposed_attacks"}, {"score": 0.0022840180582947302, "phrase": "six_machine-learning_algorithms"}, {"score": 0.0021960024679620886, "phrase": "proposed_generic_attacks"}], "paper_keywords": ["Healthcare", " machine learning", " poisoning attacks", " security"], "paper_abstract": "Machine learning is being used in a wide range of application domains to discover patterns in large datasets. Increasingly, the results of machine learning drive critical decisions in applications related to healthcare and biomedicine. Such health-related applications are often sensitive, and thus, any security breach would be catastrophic. Naturally, the integrity of the results computed by machine learning is of great importance. Recent research has shown that some machine-learning algorithms can be compromised by augmenting their training datasets with malicious data, leading to a new class of attacks called poisoning attacks. Hindrance of a diagnosis may have life-threatening consequences and could cause distrust. On the other hand, not only may a false diagnosis prompt users to distrust the machine-learning algorithm and even abandon the entire system but also such a false positive classification may cause patient distress. In this paper, we present a systematic, algorithm-independent approach for mounting poisoning attacks across a wide range of machine-learning algorithms and healthcare datasets. The proposed attack procedure generates input data, which, when added to the training set, can either cause the results of machine learning to have targeted errors (e.g., increase the likelihood of classification into a specific class), or simply introduce arbitrary errors ( incorrect classification). These attacks may be applied to both fixed and evolving datasets. They can be applied even when only statistics of the training dataset are available or, in some cases, even without access to the training dataset, although at a lower efficacy. We establish the effectiveness of the proposed attacks using a suite of six machine-learning algorithms and five healthcare datasets. Finally, we present countermeasures against the proposed generic attacks that are based on tracking and detecting deviations in various accuracy metrics, and benchmark their effectiveness.", "paper_title": "Systematic Poisoning Attacks on and Defenses for Machine Learning in Healthcare", "paper_id": "WOS:000364857000014"}