{"auto_keywords": [{"score": 0.04959174673142234, "phrase": "urinary_elimination"}, {"score": 0.04419846536070138, "phrase": "urinary_incontinence"}, {"score": 0.015719716506582538, "phrase": "differential_diagnosis"}, {"score": 0.015134235745561143, "phrase": "decision_support_system"}, {"score": 0.004482129830695465, "phrase": "nursing_terminology"}, {"score": 0.004258519867128571, "phrase": "six_possible_diagnoses"}, {"score": 0.004140305833508874, "phrase": "functional_urinary_incontinence"}, {"score": 0.004119166170145527, "phrase": "total_urinary_incontinence_and_urinary_retention"}, {"score": 0.0038342544549695183, "phrase": "agreement_test"}, {"score": 0.0035965032173588753, "phrase": "expert's_opinion"}, {"score": 0.00356897869840206, "phrase": "gold_standard"}, {"score": 0.003505568353738097, "phrase": "kappa's_values"}, {"score": 0.0030293159059213755, "phrase": "excellent_agreement"}, {"score": 0.0029076286259980253, "phrase": "moderate_agreement"}, {"score": 0.002805157565568473, "phrase": "fcm_model"}, {"score": 0.0027908158270328297, "phrase": "high_sensitivity"}, {"score": 0.0027062880030675014, "phrase": "low_specificity_value"}, {"score": 0.0026649864769874294, "phrase": "urge_urinary_incontinence"}, {"score": 0.002624313608060807, "phrase": "low_sensitivity_value"}, {"score": 0.0026108940373486596, "phrase": "total_urinary_incontinence"}, {"score": 0.002531801822860214, "phrase": "good_performance"}, {"score": 0.0024995563056109224, "phrase": "expert_systems"}, {"score": 0.002204445277617949, "phrase": "good_results"}, {"score": 0.002187559281156211, "phrase": "fcm"}, {"score": 0.0021376392890704674, "phrase": "urge_urinary_incontinence_and_total_urinary_incontinence"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ireland_ltd."}], "paper_keywords": ["Fuzzy logic", " Urinary incontinence", " Nursing diagnosis", " Differential diagnosis"], "paper_abstract": "Purpose: To develop a decision support system to discriminate the diagnoses of alterations in urinary elimination, according to the nursing terminology of NANDA International (NANDA-I). Methods: A fuzzy cognitive map (FCM) was structured considering six possible diagnoses: stress urinary incontinence, reflex urinary incontinence, urge urinary incontinence, functional urinary incontinence, total urinary incontinence and urinary retention; and 39 signals associated with them. The model was implemented in Microsoft Visual C++(R) Edition 2005 and applied in 195 real cases. Its performance was evaluated through the agreement test, comparing its results with the diagnoses determined by three experts (nurses). The sensitivity and specificity of the model were calculated considering the expert's opinion as a gold standard. In order to compute the Kappa's values we considered two situations, since more than one diagnosis was possible: the overestimation of the accordance in which the case was considered as concordant when at least one diagnoses was equal; and the underestimation of the accordance, in which the case was considered as discordant when at least one diagnosis was different. Results: The overestimation of the accordance showed an excellent agreement (kappa = 0.92, p < 0.0001); and the underestimation provided a moderate agreement (kappa = 0.42, p < 0.0001). In general the FCM model showed high sensitivity and specificity, of 0.95 and 0.92, respectively, but provided a low specificity value in determining the diagnosis of urge urinary incontinence (0.43) and a low sensitivity value to total urinary incontinence (0.42). Conclusions: The decision support system developed presented a good performance compared to other types of expert systems for differential diagnosis of alterations in urinary elimination. Since there are few similar studies in the literature, we are convinced of the importance of investing in this kind of modeling, both from the theoretical and from the health applied points of view. Limitations: In spite of the good results, the FCM should be improved to identify the diagnoses of urge urinary incontinence and total urinary incontinence. (C) 2012 Elsevier Ireland Ltd. All rights reserved.", "paper_title": "Fuzzy cognitive map in differential diagnosis of alterations in urinary elimination: A nursing approach", "paper_id": "WOS:000315799800007"}