{"auto_keywords": [{"score": 0.03955963658357216, "phrase": "proposed_algorithm"}, {"score": 0.0046046429665581555, "phrase": "learning_automata-based_iterative_algorithm"}, {"score": 0.004428139418750855, "phrase": "vertex_coloring_problem"}, {"score": 0.004378958522416482, "phrase": "vertex_coloring"}, {"score": 0.004306205029641728, "phrase": "well-known_np-hard_optimization_problem"}, {"score": 0.0034824716857663114, "phrase": "uncolored_non_adjacent_vertices"}, {"score": 0.0031140747752837826, "phrase": "proposed_algorithm_proceeds"}, {"score": 0.0028316582436089064, "phrase": "required_number"}, {"score": 0.0027382040767844093, "phrase": "chromatic_number"}, {"score": 0.0021049977753042253, "phrase": "obtained_results"}], "paper_keywords": ["Graph coloring", " vertex coloring", " learning automata", " iterative algorithms", " legal coloring"], "paper_abstract": "In this paper, we propose a learning automata-based iterative algorithm for approximating a near optimal solution to the vertex coloring problem. Vertex coloring is a well-known NP-hard optimization problem in graph theory in which each vertex is assigned a color so that no two adjacent vertices have the same color. Each iteration of the proposed algorithm is subdivided into several stages, and at each stage a subset of the uncolored non adjacent vertices are randomly selected and assigned the same color. This process continues until no more vertices remain uncolored. As the proposed algorithm proceeds, taking advantage of the learning automata the number of stages per iteration and so the required number of colors tends to the chromatic number of the graph since the number of vertices which are colored at each stage is maximized. To show the performance of the proposed algorithm we compare it with several existing vertex coloring algorithms in terms of the time and the number of colors required for coloring the graphs. The obtained results show the superiority of the proposed algorithm over the others.", "paper_title": "A NEW VERTEX COLORING ALGORITHM BASED ON VARIABLE ACTION-SET LEARNING AUTOMATA", "paper_id": "WOS:000281993100006"}