{"auto_keywords": [{"score": 0.049445419527232116, "phrase": "standalone_hybrid"}, {"score": 0.00481495049065317, "phrase": "optimal_sizing"}, {"score": 0.004270665568018583, "phrase": "important_and_challenging_task"}, {"score": 0.004130660282810338, "phrase": "renewable_energy_resources"}, {"score": 0.004021954624114115, "phrase": "energy_storages"}, {"score": 0.0037624955853577786, "phrase": "wind_turbine_generators"}, {"score": 0.003039159447717346, "phrase": "nonlinear_integer_programming_problem"}, {"score": 0.002861961643289598, "phrase": "total_capital_cost"}, {"score": 0.0026771333996253783, "phrase": "power_supply_probability"}, {"score": 0.0024875444192203485, "phrase": "specific_graph-based_ant_system"}, {"score": 0.0023113506171584157, "phrase": "death_penalty_method"}, {"score": 0.0021049977753042253, "phrase": "proposed_graph-based_ant_system"}], "paper_keywords": [""], "paper_abstract": "In the design of standalone hybrid wind/photovoltaic power systems, the optimal sizing is an important and challenging task. The coordination among renewable energy resources, generators, energy storages and loads is very complicated. The size of wind turbine generators (WTGs), the size of photovoltaic (PV) panels and the capacity of batteries must be optimized when sizing a standalone hybrid wind/PV power system, which is formulated as a nonlinear integer programming problem. Our objective is selected as minimizing the total capital cost, subject to the constraint of the Loss of Power Supply Probability (LPSP) calculated by simulation. We propose a specific Graph-based Ant System to solve the concerned problem intuitively and easily. The death penalty method is used to deal with the constraint. Simulations have shown that the proposed Graph-based Ant System is efficient with respect to the quality of solutions and computing time.", "paper_title": "Graph-based ant system for optimal sizing of standalone hybrid wind/PV power systems", "paper_id": "WOS:000240083300141"}