{"auto_keywords": [{"score": 0.048929739366992464, "phrase": "planar_homography"}, {"score": 0.04731443162421143, "phrase": "stereo_correspondences"}, {"score": 0.013036317483078048, "phrase": "local_homographies"}, {"score": 0.009731632862297866, "phrase": "correspondence_prediction"}, {"score": 0.004814954066330628, "phrase": "homography"}, {"score": 0.004750388516903877, "phrase": "curved_surface"}, {"score": 0.004724805619908213, "phrase": "stereo_correspondence_establishment"}, {"score": 0.0046238380150870435, "phrase": "image-to-image_mapping"}, {"score": 0.004240997872184065, "phrase": "curved_scenes"}, {"score": 0.004218146637325603, "phrase": "piecewise-linear_approximation"}, {"score": 0.004161553532799662, "phrase": "curved_scene"}, {"score": 0.00394264312173188, "phrase": "classical_approaches"}, {"score": 0.00385832528624328, "phrase": "smoothness_heuristic"}, {"score": 0.003695040819303525, "phrase": "iterative_manner"}, {"score": 0.0035965032173588753, "phrase": "local_planar_patches"}, {"score": 0.0035386420095120706, "phrase": "confirmed_stereo_correspondences"}, {"score": 0.0034629341517018438, "phrase": "new_stereo_correspondences"}, {"score": 0.003298441494378465, "phrase": "image_data"}, {"score": 0.003236596168242036, "phrase": "confirmed_correspondences"}, {"score": 0.003133252930886608, "phrase": "key_step"}, {"score": 0.0028502479839354637, "phrase": "epipolar_geometry"}, {"score": 0.0027001292153471202, "phrase": "aforementioned_local_homography"}, {"score": 0.0024761702541879213, "phrase": "matched_features"}, {"score": 0.002320449502337321, "phrase": "scene-related_geometric_error"}, {"score": 0.0023079225317714815, "phrase": "computation-related_algebraic_error"}, {"score": 0.002270745003370529, "phrase": "simulated_data_experiments"}, {"score": 0.0021863046959469863, "phrase": "real_image_experiments"}, {"score": 0.0021394674440767124, "phrase": "promising_results"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v._all_rights"}], "paper_keywords": ["stereo vision", " curved scene", " feature correspondence", " planar homography", " error analysis"], "paper_abstract": "Planar homography (collineation) is an image-to-image mapping that could be used to pinpoint stereo correspondences, but its usage has been limited to only planar scenes. This paper describes a mechanism that generalizes the use of planar homography for establishing stereo correspondences over curved scenes. Piecewise-linear approximation is used to describe curved scene, so that stereo correspondences over images of the scene are captured by a collection of local homographies. Unlike the classical approaches, the mechanism does not employ the smoothness heuristic in establishing correspondences, but is instead based upon the interplay of two processes ill an iterative manner: (1) partitioning of the scene into local planar patches based upon the most current set of confirmed stereo correspondences; and (2) prediction of new stereo correspondences by the use of the local homographies defined by the partitions, plus confirmation of such predictions by the image data, thereby enlarging the set of confirmed correspondences in every iteration until no more improvement could be obtained. A key step of the mechanism is to decide what local planar homography, and thereby what planar patch, is to be used for correspondence prediction of any given unmatched feature in any given iteration of the mechanism. With knowledge of the epipolar geometry, homography could be defined by any 3 non-collinear feature correspondences. Thus for any given unmatched feature, there are choices of the aforementioned local homography as defined by any set of three non-collinear matched features in the vicinity of the feature. In this paper, we explore what criteria are to be used to decide which of such triplet sets of matched features should be used. We analyze what errors in correspondence prediction could come with a planar homography. In particular, we classify the errors into scene-related geometric error and computation-related algebraic error. We examine their effects by simulated data experiments, and propose two ways of deciding which local homography to adopt for any given unmatched feature point. Real image experiments show that the methods could lead to promising results. (c) 2007 Elsevier B.V. All rights reserved.", "paper_title": "Homography-based partitioning of curved surface for stereo correspondence establishment", "paper_id": "WOS:000248262200010"}