{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "user_behaviour"}, {"score": 0.004783607451937166, "phrase": "online_travel_sites"}, {"score": 0.004569819304126685, "phrase": "tourist_behaviour"}, {"score": 0.004322967486451877, "phrase": "underlying_behavioural_model"}, {"score": 0.0040893952934649485, "phrase": "structural_equations_model"}, {"score": 0.003805689775935294, "phrase": "tripadvisor"}, {"score": 0.003756411290441335, "phrase": "facebook"}, {"score": 0.0037195959056754444, "phrase": "rigorous_empirical_research"}, {"score": 0.0035648266669315943, "phrase": "web_questionnaire"}, {"score": 0.003461454328850212, "phrase": "original_technology_acceptance_model"}, {"score": 0.0033942044841803105, "phrase": "robust_underlying_model"}, {"score": 0.0032529303004879325, "phrase": "social_networks"}, {"score": 0.003231722251475338, "phrase": "virtual_communities"}, {"score": 0.0030769941082173314, "phrase": "specific_website"}, {"score": 0.002948883844627217, "phrase": "single_context"}, {"score": 0.002762099499401202, "phrase": "web_tools"}, {"score": 0.002708399936381754, "phrase": "main_management_implications"}, {"score": 0.0026384167183586015, "phrase": "last_section"}, {"score": 0.00259559608895677, "phrase": "web_design"}, {"score": 0.0023451553255837317, "phrase": "firsthand_knowledge"}, {"score": 0.0022037303797015073, "phrase": "behavioural_model"}, {"score": 0.002118827457244586, "phrase": "tourist_destinations"}, {"score": 0.0021049977753042253, "phrase": "hotel_websites"}], "paper_keywords": ["Travel 2.0 websites", " Technology acceptance model (TAM)", " Trust", " Structural equation modelling", " Tourism", " Internet", " Web 2.0"], "paper_abstract": "Purpose The purpose of this paper is to analyse tourist behaviour with regard to the new Web 2.0-based sites, or Travel 2.0 websites. Concretely, it seeks to generalise the underlying behavioural model in explaining intention to use such sites according to its main determinants. Design/methodology/approach - The authors develop a structural equations model (SEM), which is applied to three websites selected for the study i.e. the blog of a hotel, its Tripadvisor community and its Facebook profile. Rigorous empirical research was conducted by asking respondents to visualise the three different Travel 2.0 websites and complete a web questionnaire. Findings - The findings reveal that the original technology acceptance model (TAM) is a robust underlying model for studies aimed at examining these sites. Focusing on blogs, social networks and virtual communities, the study shows that the relationship between certain cognitive and behavioural variables may vary depending on the specific website. Research limitations/implications - The study is limited to data from a single context (a specific website or type of tool), but an approach centred on visiting a variety of web tools mitigates this restriction. The main management implications of the study are discussed in the last section. Several recommendations to improve web design and the use of Travel 2.0 websites are made. The outcomes are very interesting with a view to increasing the revenues gained through these sites. Originality/value - The paper permits firsthand knowledge to be gained about the information needs of Travel 2.0 users. It is original in that it establishes a behavioural model that can be extrapolated to all Web 2.0 applications in the context of tourist destinations or hotel websites.", "paper_title": "Generalising user behaviour in online travel sites through the Travel 2.0 website acceptance model", "paper_id": "WOS:000313387600007"}