{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "chip_multiprocessor_reliability"}, {"score": 0.004773904938276846, "phrase": "code_replication"}, {"score": 0.0045543011700929096, "phrase": "large_numbers"}, {"score": 0.00440093312826378, "phrase": "high_interconnect_delays"}, {"score": 0.004307700591183651, "phrase": "key_challenges"}, {"score": 0.004270960586542813, "phrase": "cmp_design"}, {"score": 0.004162602203448056, "phrase": "often-conflicting_demands"}, {"score": 0.004005176784823524, "phrase": "power_consumption"}, {"score": 0.003971006689166329, "phrase": "memory_space_occupancy"}, {"score": 0.003937126962709418, "phrase": "area_cost"}, {"score": 0.0037238193456845124, "phrase": "compilation_framework"}, {"score": 0.0036448787596988423, "phrase": "multiple_factors"}, {"score": 0.003598317040926701, "phrase": "optimization_process"}, {"score": 0.003432604816716035, "phrase": "energy-aware_reliability_support"}, {"score": 0.002353483216544667, "phrase": "proposed_approach"}, {"score": 0.0023333715029833007, "phrase": "significant_energy"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Reliability", " Code replication", " Energy consumption", " Chip multiprocessors", " Compilers"], "paper_abstract": "Chip multiprocessors (CMPs) are promising candidates for the next generation computing platforms to utilize large numbers of gates and reduce the effects of high interconnect delays. One of the key challenges in CMP design is to balance out the often-conflicting demands. Specifically, for today's image/video applications and systems, power consumption, memory space occupancy, area cost, and reliability are as important as performance. Therefore, a compilation framework for CMPs should consider multiple factors during the optimization process. Motivated by this observation, this paper addresses the energy-aware reliability support for the CMP architectures, targeting in particular at array-intensive image/video applications. There are two main goals behind our compiler approach. First, we want to minimize the energy wasted in executing replicas when there is no error during execution (which should be the most frequent case in practice). Second, we want to minimize the time to recover (through the replicas) from an error when it occurs. This approach has been implemented and tested using four parallel array-based applications from the image/video processing domain. Our experimental evaluation indicates that the proposed approach saves significant energy over the case when all the replicas are run under the highest voltage/frequency level, without sacrificing any reliability over the latter. (C) 2009 Elsevier Ltd. All rights reserved.", "paper_title": "Improving chip multiprocessor reliability through code replication", "paper_id": "WOS:000277842100009"}