{"auto_keywords": [{"score": 0.029162374489890713, "phrase": "paper_length"}, {"score": 0.010365377380249629, "phrase": "paper_quality"}, {"score": 0.00481495049065317, "phrase": "human-centric_software_engineering_experiments-a_quasi-experiment"}, {"score": 0.004499647408293102, "phrase": "experimental_design"}, {"score": 0.004459190343665408, "phrase": "statistical_methods"}, {"score": 0.004359625030298944, "phrase": "empirical_studies"}, {"score": 0.004037370832877034, "phrase": "human-centric_experimental_and_quasi-experimental_journal_papers"}, {"score": 0.0032794890195334513, "phrase": "regression_analysis"}, {"score": 0.0028120802837806234, "phrase": "statistical_text_books"}, {"score": 0.002592163447843447, "phrase": "quality_score"}, {"score": 0.002522738549524317, "phrase": "alternative_quality_measure"}, {"score": 0.002389403849342894, "phrase": "general_statistical_texts"}, {"score": 0.0021727640931660038, "phrase": "overall_subjective_assessment"}, {"score": 0.0021049977753042253, "phrase": "experimental_and_quasi-experimental_software_engineering_papers"}], "paper_keywords": ["Quality evaluation", " empirical studies", " human-centric experiments", " experimentation", " software engineering"], "paper_abstract": "Context: Several text books and papers published between 2000 and 2002 have attempted to introduce experimental design and statistical methods to software engineers undertaking empirical studies. Objective: This paper investigates whether there has been an increase in the quality of human-centric experimental and quasi-experimental journal papers over the time period 1993 to 2010. Method: Seventy experimental and quasi-experimental papers published in four general software engineering journals in the years 1992-2002 and 2006-2010 were each assessed for quality by three empirical software engineering researchers using two quality assessment methods (a questionnaire-based method and a subjective overall assessment). Regression analysis was used to assess the relationship between paper quality and the year of publication, publication date group (before 2003 and after 2005), source journal, average coauthor experience, citation of statistical text books and papers, and paper length. The results were validated both by removing papers for which the quality score appeared unreliable and using an alternative quality measure. Results: Paper quality was significantly associated with year, citing general statistical texts, and paper length (p < 0.05). Paper length did not reach significance when quality was measured using an overall subjective assessment. Conclusions: The quality of experimental and quasi-experimental software engineering papers appears to have improved gradually since 1993.", "paper_title": "Trends in the Quality of Human-Centric Software Engineering Experiments-A Quasi-Experiment", "paper_id": "WOS:000321125200007"}