{"auto_keywords": [{"score": 0.04786066516887222, "phrase": "citation_frequency"}, {"score": 0.010435255694311932, "phrase": "geographical_origin"}, {"score": 0.005402376603804809, "phrase": "nation_oriented_citation_bias"}, {"score": 0.00481495049065317, "phrase": "research_impact"}, {"score": 0.004702168843383725, "phrase": "research_articles"}, {"score": 0.004561019117546361, "phrase": "impact_factor"}, {"score": 0.004499647408293102, "phrase": "research_quality"}, {"score": 0.0044692705329574, "phrase": "journal_prestige"}, {"score": 0.003956113993518042, "phrase": "research_publication"}, {"score": 0.0036470559917231218, "phrase": "cited_publication"}, {"score": 0.0032170707904803125, "phrase": "total_number"}, {"score": 0.003195324728141602, "phrase": "received_citations"}, {"score": 0.003057503388220776, "phrase": "citing_paper"}, {"score": 0.0029655761366079877, "phrase": "cardiovascular_journals"}, {"score": 0.002678598911294797, "phrase": "citation_recipient"}, {"score": 0.0024607296642187846, "phrase": "absolute_numbers"}, {"score": 0.002394856619619264, "phrase": "usa"}, {"score": 0.0023465400668244386, "phrase": "largest_research_output"}, {"score": 0.002214965506028584, "phrase": "nation_oriented_citation_behaviour"}, {"score": 0.0021703067932421463, "phrase": "cumulative_citation_number"}, {"score": 0.0021049977753042253, "phrase": "larger_research_output"}], "paper_keywords": [""], "paper_abstract": "Context. The use of citation frequency and impact factor as measures of research quality and journal prestige is being criticized. Citation frequency is augmented by self-citation and for most journals the majority of citations originate from a minority of papers. We hypothesized that citation frequency is also associated with the geographical origin of the research publication. Objective. We determined whether citations originate more frequently from institutes that are located in the same country as the authors of the cited publication than would be expected by chance. Design. We screened citations referring to 1200 cardiovascular publications in the 7 years following their publication. For the 1200 citation recipient publications we documented the country where the research originated (9 countries/regions) and the total number of received citations. For a selection of 8864 citation donor papers we registered the country/region where the citing paper originated. Results. Self-citation was common in cardiovascular journals (n = 1534, 17.8%). After exclusion of self-citation, however, the number of citations that originated from the same country as the author of the citation recipient was found to be on average 31.6% higher than would be expected by chance (p < 0.01 for all countries/regions). In absolute numbers, nation oriented citation bias was most pronounced in the USA, the country with the largest research output (p < 0.001). Conclusion. Citation frequency was significantly augmented by nation oriented citation bias. This nation oriented citation behaviour seems to mainly influence the cumulative citation number for papers originating from the countries with a larger research output.", "paper_title": "Citation frequency: A biased measure of research impact significantly influenced by the geographical origin of research articles", "paper_id": "WOS:000243471400009"}