{"auto_keywords": [{"score": 0.04635074898147141, "phrase": "othello"}, {"score": 0.00481495049065317, "phrase": "n-tuple_networks_for_othello_position_evaluation._n-tuple_networks"}, {"score": 0.003955926499405168, "phrase": "constituent_n-tuples"}, {"score": 0.0038654774211631564, "phrase": "board_locations"}, {"score": 0.003443219062200627, "phrase": "small_number"}, {"score": 0.0032122679403131537, "phrase": "n-tuple_networks"}, {"score": 0.003066945490483524, "phrase": "large_number"}, {"score": 0.002877769867854964, "phrase": "straightforward_variant"}, {"score": 0.0028446460307503343, "phrase": "coevolutionary_learning"}, {"score": 0.0027795345823932406, "phrase": "systematic_n-tuple_network"}, {"score": 0.0026384167183586015, "phrase": "comparable_performance"}, {"score": 0.002349884235026956, "phrase": "top_published_players"}, {"score": 0.002129527338875116, "phrase": "full_advantage"}, {"score": 0.0021049977753042253, "phrase": "larger_networks"}], "paper_keywords": [""], "paper_abstract": "n-tuple networks have been successfully used as position evaluation functions for board games such as Othello and Connect Four. The effectiveness of such networks depends on their architecture, which is determined by the placement of constituent n-tuples (sequences of board locations) providing input to the network. The most popular method of placing n-tuples consists of randomly generating a small number of long, snake-shaped board location sequences. In this article, we show that learning n-tuple networks is more effective if it involves a large number of systematically placed, short, straight n-tuples. In addition, we demonstrate that a straightforward variant of coevolutionary learning can evolve a systematic n-tuple network with tuples of size just 2 of a comparable performance to the best 1-ply Othello players. Our network consists of only 288 parameters, which is an order of magnitude less than the top published players to date. This indicates S need for more effective learning methods that would be capable of taking a full advantage of larger networks.", "paper_title": "SYSTEMATIC n-TUPLE NETWORKS FOR OTHELLO POSITION EVALUATION", "paper_id": "WOS:000347515200002"}