{"auto_keywords": [{"score": 0.03788547968512631, "phrase": "compatibility_questions"}, {"score": 0.00481495049065317, "phrase": "dynamic_business_processes"}, {"score": 0.004621984064678252, "phrase": "business_processes"}, {"score": 0.0045284072672385975, "phrase": "high_degree"}, {"score": 0.004364696693320128, "phrase": "changing_contexts"}, {"score": 0.004189698902282913, "phrase": "semantic_web_technologies"}, {"score": 0.004021689117050817, "phrase": "interaction_aspects"}, {"score": 0.003972607172518598, "phrase": "business_process"}, {"score": 0.0038446194432899183, "phrase": "new_challenges"}, {"score": 0.003513443975425428, "phrase": "control_flow_point"}, {"score": 0.003277140908834426, "phrase": "data_flow_point"}, {"score": 0.002886279589889689, "phrase": "deneb"}, {"score": 0.002770389097966904, "phrase": "web_processes"}, {"score": 0.0026810296502682916, "phrase": "nets_formalism"}, {"score": 0.002626645763725465, "phrase": "conversational_approach"}, {"score": 0.002220257443705344, "phrase": "domain_ontologies"}, {"score": 0.0021662983565317283, "phrase": "standard_petri_net_analysis_techniques"}, {"score": 0.0021049977753042253, "phrase": "john_wiley"}], "paper_keywords": ["business processes", " protocol-based integration", " flexible interactions", " semantic-annotated process compatibility", " Petri nets"], "paper_abstract": "In the coming years, one of the challenges for business processes is to obtain a high degree of flexibility and ability to adapt to the changing contexts. Two key elements for achieving this are the use of Semantic Web technologies and the possibility of decoupling the business and the interaction aspects in a business process. Nevertheless, these solutions open up new challenges related to the necessity of checking whether a set of processes can successfully cooperate. Compatibility questions should be considered from a control flow point of view (the order of the interactions should be appropriate) and also from a data flow point of view (the information exchanged should be-semantically-adequate). In this paper, we concentrate on the compatibility of a set of processes executed in DENEB, a platform for the Development and ExecutioN of wEB processes based on the Net-within-Nets formalism and that follows a conversational approach. More specifically, this paper examines whether a set of interactions among a set of processes is compatible and also whether a given (imposed) interaction logic is compatible with a given business logic. Processes and their interactions have been semantically enhanced by means of domain ontologies and compatibility questions are studied using standard Petri net analysis techniques. Copyright (C) 2010 John Wiley & Sons, Ltd.", "paper_title": "Control and data flow compatibility in the interaction between dynamic business processes", "paper_id": "WOS:000285395600004"}