{"auto_keywords": [{"score": 0.04728001415879774, "phrase": "protected_content"}, {"score": 0.043443105745602784, "phrase": "unauthorized_users"}, {"score": 0.00481495049065317, "phrase": "tracing_and_revoking_schemes_secure_against_collusion_and_any_form"}, {"score": 0.00444377150105556, "phrase": "privileged_users"}, {"score": 0.004338076511024884, "phrase": "main_property"}, {"score": 0.004068302313449334, "phrase": "pirate_decoder"}, {"score": 0.0038305869305614504, "phrase": "privileged_subset"}, {"score": 0.0033552055241931346, "phrase": "certified_guarantee"}, {"score": 0.00319732428387928, "phrase": "tree-based_tracing"}, {"score": 0.0031337465656628132, "phrase": "code-based_tracing_schemes"}, {"score": 0.0028229071631385634, "phrase": "tree-based_schemes"}, {"score": 0.0027446057983474994, "phrase": "simple_techniques"}, {"score": 0.002147749117443578, "phrase": "new_hybrid_schemes"}, {"score": 0.0021049977753042253, "phrase": "previous_constructions"}], "paper_keywords": ["Broadcast encryption", " User revocation", " Traitor tracing"], "paper_abstract": "Tracing and revoking schemes enable a center to deliver protected content to a subset of privileged users of a given universe. The main property these schemes enjoy is that traitors, who illegally help unauthorized users to set up a pirate decoder for gaining access to the protected content, can be identified and removed from the privileged subset. Historically, traitors have been modeled as users who privately share their secret information with unauthorized users. However, in the Pirates 2.0 attack model, traitors collaborate in public and partially share their secret information with a certified guarantee of anonymity. Several classes of tracing and revoking schemes, like tree-based tracing and revoking schemes and code-based tracing schemes, are subject to such a new threat. In this paper we propose methods to cope with the Pirates 2.0 attack. We focus our attention on the class of tree-based schemes. We start by discussing some simple techniques, which can partially help to deal with the attack, and point out their limits. Then, looking through the literature, we recover some ideas, which can be used to strengthen tracing and revoking schemes. We also analyze the trade-off which can be obtained by applying these ideas to the schemes. Finally, we describe new hybrid schemes, obtained by mixing previous constructions, which can be used to face up the Pirates 2.0 attack.", "paper_title": "Toward tracing and revoking schemes secure against collusion and any form of secret information leakage", "paper_id": "WOS:000313726100001"}