{"auto_keywords": [{"score": 0.04154041880609474, "phrase": "power_consumption"}, {"score": 0.008155440025364809, "phrase": "vm"}, {"score": 0.00481495049065317, "phrase": "vm_power_metering"}, {"score": 0.004770461993586338, "phrase": "cloud_computing"}, {"score": 0.004408456735066782, "phrase": "high-power_consumption"}, {"score": 0.004208427318712072, "phrase": "resource_utilization"}, {"score": 0.0036609730219354796, "phrase": "green_cloud_data_centers"}, {"score": 0.0033828748627992193, "phrase": "modeling_methods"}, {"score": 0.0032745778756077693, "phrase": "current_models"}, {"score": 0.0030117065110966414, "phrase": "main_reasons"}, {"score": 0.002656327554326748, "phrase": "tree_regression-based_method"}, {"score": 0.002420339995088838, "phrase": "tree_structure"}, {"score": 0.002278284823857861, "phrase": "easy-modeling_subset"}, {"score": 0.0022155569675462333, "phrase": "average_accuracy"}, {"score": 0.0021545524633190985, "phrase": "different_types"}, {"score": 0.0021050064483752466, "phrase": "vms"}], "paper_keywords": ["Virtual machine (VM)", " metering", " measure", " power", " cloud computing"], "paper_abstract": "Cloud computing is developing so fast that more and more data centers have been built every year. This naturally leads to high-power consumption. Virtual machine (VM) consolidation is the most popular solution based on resource utilization. In fact, much more power can be saved if we know the power consumption of each VM. Therefore, it is significant to measure the power consumption of each VM for green cloud data centers. Since there is no device that can directly measure the power consumption of each VM, modeling methods have been proposed. However, current models are not accurate enough when multi-VMs are competing for resources on the same server. One of the main reasons is that the resource features for modeling are correlated with each other, such as CPU and cache. In this paper, we propose a tree regression-based method to accurately measure the power consumption of VMs on the same host. The merits of this method are that the tree structure will split the data set into partitions, and each is an easy-modeling subset. Experiments show that the average accuracy of our method is about 98% for different types of applications running in VMs.", "paper_title": "A Tree Regression-Based Approach for VM Power Metering", "paper_id": "WOS:000371388200044"}