{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "linear_separability"}, {"score": 0.049692788583269344, "phrase": "gene_expression_data_sets"}, {"score": 0.04221552420026915, "phrase": "linear_separation"}, {"score": 0.0046993598473345395, "phrase": "simple_geometric_properties"}, {"score": 0.003884479830773329, "phrase": "joint_expression_level"}, {"score": 0.0035100601949451028, "phrase": "underlying_molecular_mechanism"}, {"score": 0.003236596168242036, "phrase": "novel_efficient_algorithmic_tools"}, {"score": 0.002984373546099842, "phrase": "computational_geometric_properties"}, {"score": 0.0027854565462509095, "phrase": "actual_separating_pairs"}, {"score": 0.0027184540871935284, "phrase": "upper_bound"}, {"score": 0.0021569129153653777, "phrase": "functional_association"}, {"score": 0.0021049977753042253, "phrase": "underlying_phenotypic_classes"}], "paper_keywords": ["Gene expression analysis", " DNA microarrays", " diagnosis", " linear separation"], "paper_abstract": "We study simple geometric properties of gene expression data sets, where samples are taken from two distinct classes (e.g., two types of cancer). Specifically, the problem of linear separability for pairs of genes is investigated. If a pair of genes exhibits linear separation with respect to the two classes, then the joint expression level of the two genes is strongly correlated to the phenomena of the sample being taken from one class or the other. This may indicate an underlying molecular mechanism relating the two genes and the phenomena (e. g., a specific cancer). We developed and implemented novel efficient algorithmic tools for finding all pairs of genes that induce a linear separation of the two sample classes. These tools are based on computational geometric properties and were applied to 10 publicly available cancer data sets. For each data set, we computed the number of actual separating pairs and compared it to an upper bound on the number expected by chance and to the numbers resulting from shuffling the labels of the data at random empirically. Seven out of these 10 data sets are highly separable. Statistically, this phenomenon is highly significant, very unlikely to occur at random. It is therefore reasonable to expect that it manifests a functional association between separating genes and the underlying phenotypic classes.", "paper_title": "Linear Separability of Gene Expression Data Sets", "paper_id": "WOS:000277502300018"}