{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "broader_impacts"}, {"score": 0.009345453457957627, "phrase": "nsf"}, {"score": 0.008303602253677048, "phrase": "merit_review_criteria"}, {"score": 0.004706305193222972, "phrase": "nsf's_merit_review_criteria"}, {"score": 0.004475798524102238, "phrase": "information_science"}, {"score": 0.004414907432703781, "phrase": "increasing_pressure"}, {"score": 0.004354841111644036, "phrase": "external_funding"}, {"score": 0.0039928721865882, "phrase": "proposed_projects"}, {"score": 0.0038849148160362257, "phrase": "intellectual_merit"}, {"score": 0.0035133644847622383, "phrase": "scientific_research"}, {"score": 0.0032064196784562017, "phrase": "content_analysis"}, {"score": 0.0029128614098881253, "phrase": "particular_relevance"}, {"score": 0.0028863414975346512, "phrase": "information_scientists"}, {"score": 0.0026582395558737855, "phrase": "broader_impacts_merit_review_criterion"}, {"score": 0.0025047659706737215, "phrase": "even_successful_proposals"}, {"score": 0.002275299774554847, "phrase": "demonstrable_innovation"}, {"score": 0.002254571365634257, "phrase": "economic_benefit"}, {"score": 0.002203570941628287, "phrase": "proposers'_abilities"}, {"score": 0.0021049977753042253, "phrase": "greater_understanding"}], "paper_keywords": ["technology impact", " policy", " grants"], "paper_abstract": "Scholars in library and information science are under increasing pressure to seek external funding for research. The National Science Foundation (NSF), which is often the source of this funding, considers proposed projects based on the criteria of Intellectual Merit and Broader Impacts. However, these merit review criteria have been criticized as being insufficiently specific and not appropriate for all types of scientific research. In an effort to examine the extent to which funded projects represented Broader Impacts, the researchers performed a content analysis of the abstracts from projects in the National Science Digital Library, an NSF project that crossed many disciplines and applications, but is of particular relevance to information scientists. When the results of these analyses are placed in the context of the controversy surrounding the Broader Impacts merit review criterion, it is clear that this criterion is interpreted broadly and that even successful proposals often include aspirational or incomplete claims of impact. Because current proposed revisions to the merit review criteria that include emphases on demonstrable innovation and economic benefit will likely only complicate proposers' abilities to describe their projects' potentials, researchers may benefit from a greater understanding of Broader Impacts and how they can be clearly expressed to reviewers.", "paper_title": "Toward broader impacts: Making sense of NSF's merit review criteria in the context of the National Science Digital Library", "paper_id": "WOS:000307730000005"}