{"auto_keywords": [{"score": 0.008713768692145006, "phrase": "educational_curriculum"}, {"score": 0.004195418010131832, "phrase": "integrated_part"}, {"score": 0.004109600767747015, "phrase": "annual_visual_analytics_science_and_technology_conference"}, {"score": 0.0033651019362620866, "phrase": "student_submissions"}, {"score": 0.0031845067058084613, "phrase": "bloom's_taxonomy_of_educational_objectives"}, {"score": 0.003140888248194296, "phrase": "knowledge-based_goals"}, {"score": 0.002931569771634119, "phrase": "additional_learning_objectives"}, {"score": 0.002680114113899346, "phrase": "contest_participation"}, {"score": 0.0026252106881752067, "phrase": "integrated_course"}, {"score": 0.0025537472239953807, "phrase": "contest_data"}, {"score": 0.0025014259919355453, "phrase": "practical_course_elements"}, {"score": 0.0024501740852758505, "phrase": "core_contribution"}, {"score": 0.002163962278674136, "phrase": "germany"}, {"score": 0.0021342613107011624, "phrase": "virginia_tech"}], "paper_keywords": ["Educational curriculum", " VAST Challenge", " information visualization", " visual analytics", " human-computer interaction"], "paper_abstract": "With its mission to move science into practice, the Visual Analytics Science and Technology Challenge has become an integrated part of the annual Visual Analytics Science and Technology Conference since its inception in 2006. In this article, we discuss how we can transfer this objective into a classroom setting by using the Visual Analytics Science and Technology Challenge datasets and by encouraging student submissions to the challenge. By means of Bloom's Taxonomy of Educational Objectives for Knowledge-Based Goals, we show how the Visual Analytics Science and Technology Challenge enables the integration of additional learning objectives into two types of courses: a dedicated course that focuses on the contest participation and an integrated course that uses the contest data to emphasize practical course elements. The core contribution of this article is that we assess the opportunities and pitfalls that we experienced at the University of Konstanz in Germany and Virginia Tech in the United States when augmenting the educational curriculum with the Visual Analytics Science and Technology Challenge.", "paper_title": "Augmenting the educational curriculum with the Visual Analytics Science and Technology Challenge: Opportunities and pitfalls", "paper_id": "WOS:000343034300002"}