{"auto_keywords": [{"score": 0.04593811340084706, "phrase": "consistent_query_answering"}, {"score": 0.00481495049065317, "phrase": "database_may"}, {"score": 0.004569905085027681, "phrase": "integrity_constraints"}, {"score": 0.004441517985511521, "phrase": "formal_approach"}, {"score": 0.003925414526537783, "phrase": "consistent_query"}, {"score": 0.0035525348986162795, "phrase": "conp"}, {"score": 0.0031393948330209224, "phrase": "key_constraints"}, {"score": 0.0030949200330108156, "phrase": "conjunctive_query"}, {"score": 0.0029652378817382782, "phrase": "ptime"}, {"score": 0.0026705669656375197, "phrase": "main_contribution"}, {"score": 0.002486589906779091, "phrase": "dichotomy_result"}, {"score": 0.002304263635960015, "phrase": "common_classes"}, {"score": 0.0021557052355026048, "phrase": "constraint_satisfaction_problem"}, {"score": 0.0021049977753042253, "phrase": "famous_open_problem"}], "paper_keywords": ["Theory", " Languages", " Inconsistent databases", " consistent query answering", " dichotomy", " constraint satisfaction problem"], "paper_abstract": "A database may for various reasons become inconsistent with respect to a given set of integrity constraints. In the late 1990s, the formal approach of consistent query answering was proposed in order to query such databases. Since then, a lot of efforts have been spent to classify the complexity of consistent query answering under various classes of constraints. It is known that for the most common constraints and queries, the problem is in CONP and might be CONP-hard, yet several relevant tractable classes have been identified. Additionally, the results that emerged suggested that given a set of key constraints and a conjunctive query, the problem of consistent query answering is either in PTIME or is CONP-complete. However, despite all the work, as of today this dichotomy remains a conjecture. The main contribution of this article is to explain why it appears so difficult to obtain a dichotomy result in the setting of consistent query answering. Namely, we prove that such a dichotomy with respect to common classes of constraints and queries is harder to achieve than a dichotomy for the constraint satisfaction problem, which is a famous open problem since the 1990s.", "paper_title": "Why Is It Hard to Obtain a Dichotomy for Consistent Query Answering?", "paper_id": "WOS:000352220100007"}