{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "computer-aided_software_engineering_tools"}, {"score": 0.004566308708871429, "phrase": "modeling-related_activities"}, {"score": 0.0038093479435377764, "phrase": "recent_approaches"}, {"score": 0.003759142310009214, "phrase": "model_interchange_problem"}, {"score": 0.003660700128133065, "phrase": "involved_information"}, {"score": 0.003410565849262162, "phrase": "abstract_syntax"}, {"score": 0.0031774686451753477, "phrase": "tool-specific_information"}, {"score": 0.003053402354907241, "phrase": "ad-hoc_ways"}, {"score": 0.0027700855441353165, "phrase": "case_tools"}, {"score": 0.0026736945502820303, "phrase": "model_interchange"}, {"score": 0.002615156460073562, "phrase": "proposed_metamodels"}, {"score": 0.0025806490053534316, "phrase": "modular_organization"}, {"score": 0.002447101794397243, "phrase": "specific_information"}, {"score": 0.0022396694076443446, "phrase": "case_study"}, {"score": 0.0021906130276146325, "phrase": "existing_works"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Computer-Aided Software Engineering tool", " Model interchange", " Model-Driven Development", " Metamodels"], "paper_abstract": "Computer-Aided Software Engineering (CASE) tools support modeling-related activities in development projects. Given the variety of tools and functionalities, it is quite common to work with several tools in the same project. However, data cannot usually be exchanged between these tools without loss of information. Recent approaches address this model interchange problem using metamodels to characterize the involved information and transformations to export/import it. Nevertheless, most of these solutions focus on the abstract syntax of models. They fail to consider aspects such as the presentation of models or tool-specific information, which are either disregarded or represented in ad-hoc ways that make difficult their processing. In order to overcome these limitations, this paper introduces a framework to define metamodels of CASE tools and a process to carry out the model interchange using them. The proposed metamodels have a modular organization with several internal metamodels. Each of them is aimed at describing some specific information about content, structure and presentation for both models and tools. The paper illustrates this approach with a case study used for comparison with existing works for this problem. (C) 2009 Elsevier B.V. All rights reserved.", "paper_title": "A framework for the definition of metamodels for Computer-Aided Software Engineering tools", "paper_id": "WOS:000276121400005"}