{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "ownership_metrics"}, {"score": 0.01557684768947525, "phrase": "open-source_software_projects"}, {"score": 0.015294933297733172, "phrase": "code_ownership_metrics"}, {"score": 0.012973677404473747, "phrase": "software_quality"}, {"score": 0.009763377531111733, "phrase": "code_ownership"}, {"score": 0.004513631630494221, "phrase": "major_and_minor_contributors"}, {"score": 0.004451546786101008, "phrase": "software_module"}, {"score": 0.0038756055612167942, "phrase": "proprietary_software_projects"}, {"score": 0.0034052594710793664, "phrase": "newly_crafted_dataset"}, {"score": 0.0033739270918502285, "phrase": "seven_open-source_software_projects"}, {"score": 0.003281643474564305, "phrase": "inferential_statistics"}, {"score": 0.00288317238346065, "phrase": "relative_importance"}, {"score": 0.0028303313661029597, "phrase": "multiple_linear_regression_models"}, {"score": 0.0025565050791036973, "phrase": "last_release"}, {"score": 0.002266765479420981, "phrase": "added_value"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Software engineering", " Empirical study", " Process metrics"], "paper_abstract": "Context: Code ownership metrics were recently defined in order to distinguish major and minor contributors of a software module, and to assess whether the ownership of such a module is strong or shared between developers. Objective: The relationship between these metrics and software quality was initially validated on proprietary software projects. Our objective in this paper is to evaluate such relationship in open-source software projects, and to compare these metrics to other code and process metrics. Method: On a newly crafted dataset of seven open-source software projects, we perform, using inferential statistics, an analysis of code ownership metrics and their relationship with software quality. Results: We confirm the existence of a relationship between code ownership and software quality, but the relative importance of ownership metrics in multiple linear regression models is low compared to metrics such as the number of lines of code, the number of modifications performed over the last release, or the number of developers of a module. Conclusion: Although we do find a relationship between code ownership and software quality, the added value of ownership metrics compared to other metrics is still to be proven. (C) 2015 Elsevier B.V. All rights reserved.", "paper_title": "On the usefulness of ownership metrics in open-source software projects", "paper_id": "WOS:000355365100007"}