{"auto_keywords": [{"score": 0.046626974785833435, "phrase": "self-directed_learning"}, {"score": 0.02270117823134625, "phrase": "young_students"}, {"score": 0.010612387000973441, "phrase": "technology_scale"}, {"score": 0.004770211811866158, "phrase": "sdlts"}, {"score": 0.004385733482617193, "phrase": "significant_impact"}, {"score": 0.004324723240308028, "phrase": "long-term_societal_demands"}, {"score": 0.0028398670212054114, "phrase": "sd"}, {"score": 0.0026105159490849364, "phrase": "separate_sample"}, {"score": 0.002514625755809045, "phrase": "principal_component"}, {"score": 0.0024912073108138613, "phrase": "confirmatory_factor"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Elementary education", " Pedagogical issues", " Country-specific developments"], "paper_abstract": "Research has found self-directed learning to have a significant impact on the long-term societal demands on our future workforce and our perspective on learning. Over the years, many measures have been developed to examine self-directed learning. However, few, if any, were developed for use by young students (age 10-12). In addition, none have included technology as an element in supporting self-directed learning. The aim of this study is to develop and validate a Self-Directed Learning with Technology Scale (SDLTS) for young students. Using two studies, a proposed 6-item SDLTS was piloted with 558 students, aged 10-12 years (mean = 10.18; SD = 0.38) and subsequently tested to establish the validity and reliability of the scale using a separate sample (n = 545). Applying principal component and confirmatory factor analyses, the results of these studies supported a 6-item, two-factor Self-Directed Learning with Technology Scale (SDLTS): Self-Management and Intentional Learning. (c) 2010 Elsevier Ltd. All rights reserved.", "paper_title": "The self-directed learning with technology scale (SDLTS) for young students: An initial development and validation", "paper_id": "WOS:000282349200032"}