{"auto_keywords": [{"score": 0.04938215553287494, "phrase": "respondent_reactions"}, {"score": 0.03941864421624202, "phrase": "respondent's_immediate_reactions"}, {"score": 0.0046986841646790315, "phrase": "dyadic_negotiation"}, {"score": 0.004219427915728972, "phrase": "respondent's_reaction"}, {"score": 0.004057495982111461, "phrase": "negotiation_offer"}, {"score": 0.003863758357292741, "phrase": "acoustic_and_visual_behavioral_cues"}, {"score": 0.003697287104870263, "phrase": "face-to-face_negotiation_dataset"}, {"score": 0.0035553221885904467, "phrase": "simulated_negotiation"}, {"score": 0.003054681986032532, "phrase": "behavioral_symmetry"}, {"score": 0.002966230968271199, "phrase": "negotiation_history"}, {"score": 0.0027159094186967247, "phrase": "nonverbal_behavior"}, {"score": 0.0026115277372906805, "phrase": "comparable_performance"}, {"score": 0.0024624103660827695, "phrase": "mutual_behavioral_cues"}, {"score": 0.0021049977753042253, "phrase": "audio-visual_behavioral_cues"}], "paper_keywords": ["Human behavior analysis", " negotiation", " nonverbal behavior", " prediction"], "paper_abstract": "Negotiation is a component deeply ingrained in our daily lives, and it can be challenging for a person to predict the respondent's reaction (acceptance or rejection) to a negotiation offer. In this work, we focus on finding acoustic and visual behavioral cues that are predictive of the respondent's immediate reactions using a face-to-face negotiation dataset, which consists of 42 dyadic interactions in a simulated negotiation setting. We show our results of exploring four different sources of information, namely nonverbal behavior of the proposer, that of the respondent, mutual behavior between the interactants related to behavioral symmetry and asymmetry, and past negotiation history between the interactants. Firstly, we show that considering other sources of information (other than the nonverbal behavior of the respondent) can also have comparable performance in predicting respondent reactions. Secondly, we show that automatically extracted mutual behavioral cues of symmetry and asymmetry are predictive partially due to their capturing information of the nature of the interaction itself, whether it is cooperative or competitive. Lastly, we identify audio-visual behavioral cues that are most predictive of the respondent's immediate reactions.", "paper_title": "I Can Already Guess Your Answer: Predicting Respondent Reactions during Dyadic Negotiation", "paper_id": "WOS:000356172600002"}