{"auto_keywords": [{"score": 0.049452114640627876, "phrase": "usa"}, {"score": 0.00481495049065317, "phrase": "distributed_research_networks"}, {"score": 0.004448705308279165, "phrase": "clinical_research_data_warehouse_governance"}, {"score": 0.004276120412040056, "phrase": "materials_and_methods_medline"}, {"score": 0.004201572921859967, "phrase": "embase"}, {"score": 0.004164784677078351, "phrase": "cinahl"}, {"score": 0.004110205035449486, "phrase": "inspec"}, {"score": 0.0040385352882334235, "phrase": "relevant_documents"}, {"score": 0.0039333604469462356, "phrase": "systematic_approach"}, {"score": 0.0036499505265403377, "phrase": "classification_framework"}, {"score": 0.0032697235411641695, "phrase": "final_review"}, {"score": 0.003226834737003501, "phrase": "peer-reviewed_literature"}, {"score": 0.003198554193075258, "phrase": "data_warehouse_governance"}, {"score": 0.00307431840409833, "phrase": "peer-reviewed_publications"}, {"score": 0.00304737045343781, "phrase": "uk_research_network_governance"}, {"score": 0.0025217065652145443, "phrase": "public_health_surveillance"}, {"score": 0.0024776677004255104, "phrase": "drn_data_governance_policies"}, {"score": 0.002142426911242168, "phrase": "us-based_drn_data_warehouse_governance_publications"}, {"score": 0.002104999656191861, "phrase": "drn"}], "paper_keywords": [""], "paper_abstract": "Objective To review the published, peer-reviewed literature on clinical research data warehouse governance in distributed research networks (DRNs). Materials and methods Medline, PubMed, EMBASE, CINAHL, and INSPEC were searched for relevant documents published through July 31, 2013 using a systematic approach. Only documents relating to DRNs in the USA were included. Documents were analyzed using a classification framework consisting of 10 facets to identify themes. Results 6641 documents were retrieved. After screening for duplicates and relevance, 38 were included in the final review. A peer-reviewed literature on data warehouse governance is emerging, but is still sparse. Peer-reviewed publications on UK research network governance were more prevalent, although not reviewed for this analysis. All 10 classification facets were used, with some documents falling into two or more classifications. No document addressed costs associated with governance. Discussion Even though DRNs are emerging as vehicles for research and public health surveillance, understanding of DRN data governance policies and procedures is limited. This is expected to change as more DRN projects disseminate their governance approaches as publicly available toolkits and peer-reviewed publications. Conclusions While peer-reviewed, US-based DRN data warehouse governance publications have increased, DRN developers and administrators are encouraged to publish information about these programs.", "paper_title": "Clinical research data warehouse governance for distributed research networks in the USA: a systematic review of the literature", "paper_id": "WOS:000337660600029"}