{"auto_keywords": [{"score": 0.0407832063611011, "phrase": "personal_aesthetics"}, {"score": 0.00481495049065317, "phrase": "human_being"}, {"score": 0.004753512932910936, "phrase": "built-in_image_aesthetic_evaluation_system"}, {"score": 0.004496174406337201, "phrase": "image_aesthetics"}, {"score": 0.003837205620832367, "phrase": "novel_behavioral_biometrical_trait"}, {"score": 0.003288567185099276, "phrase": "compact_template"}, {"score": 0.00296698375549856, "phrase": "flickr_images"}, {"score": 0.0028302635493019867, "phrase": "lasso_regressor"}, {"score": 0.002806321946513582, "phrase": "lasso"}, {"score": 0.0026998264237910884, "phrase": "authentication_and_recognition_tasks"}, {"score": 0.0025315664299815537, "phrase": "user_identity"}, {"score": 0.0023333715029833007, "phrase": "single_user"}, {"score": 0.0022936610196951962, "phrase": "biometrical_trait"}, {"score": 0.00218789980093445, "phrase": "cumulative_matching_characteristic_curve"}], "paper_keywords": ["Personal aesthetics", " image preferences", " behavioral biometrics", " computational aesthetics"], "paper_abstract": "This paper builds upon the belief that every human being has a built-in image aesthetic evaluation system. This sort of personal aesthetics mostly follows certain aesthetic rules widely studied in image aesthetics (e. g., rules of thirds, colorfulness, etc.), though it likely contains some innate, unique preferences. This paper is a proof of concept of this intuition, presenting personal aesthetics as a novel behavioral biometrical trait. In our scenario, personal aesthetics activate when an individual is presented with a set of photos he may like or dislike. The goal is to distill and encode the uniqueness of his visual preferences into a compact template. To this aim, we extract a pool of low-and high-level state-of-the-art image features from a set of Flickr images preferred by a user, feeding them successively into a LASSO regressor. LASSO highlights the most discriminant cues for the individual, allowing authentication and recognition tasks. The results are surprising given only 1 image as test. We can match the user identity against a gallery of 200 individuals definitely much better than chance. Using 20 images (all preferred by a single user) as a biometrical trait, we reach an AUC of 96%, considering the cumulative matching characteristic curve. Extensive experiments also support the interpretability of our approach, effectively modeling what is the \"what we like\" that distinguishes us from others.", "paper_title": "Faved! Biometrics: Tell Me Which Image You Like and I'll Tell You Who You Are", "paper_id": "WOS:000332459700004"}