{"auto_keywords": [{"score": 0.04856216099390577, "phrase": "minority_classes"}, {"score": 0.011007001188148536, "phrase": "large_size_data_sets"}, {"score": 0.00481495049065317, "phrase": "stratified_instance_selection"}, {"score": 0.0045879792359519375, "phrase": "subgroup_discovery"}, {"score": 0.003584025547693836, "phrase": "subgroup_discovery_algorithms"}, {"score": 0.0034890505116128606, "phrase": "scaling_up_problem"}, {"score": 0.003034158379493625, "phrase": "scaling_lip_problem"}, {"score": 0.002890887778279196, "phrase": "instance_selection"}, {"score": 0.0027395968397212053, "phrase": "subgroup_discovery_task"}, {"score": 0.0025273383208209922, "phrase": "data_sets"}, {"score": 0.002447101794397243, "phrase": "subgroup_discovery_process"}, {"score": 0.0023314867226678555, "phrase": "subgroup_discovery_extraction"}, {"score": 0.0022818671653408278, "phrase": "oil_large_data_sets"}], "paper_keywords": ["Large size data sets", " scaling tip", " Subgroup discovery", " Instance selection", " Stratification", " Minority classes"], "paper_abstract": "The Subgroup discovery is defined as: \"given a Population of individuals and a property of those individuals. we are interested in finding a population of subgroups as large as possible and in having the most unusual statistical characteristic with respect to the property of interest\". The subgroup discovery algorithms have to face the Scaling up problem which appears in the evaluation of large size data sets. In this paper we are interested in the extraction Of Subgroups from large size data sets. To avoid the Scaling LIP problem, we propose the combination of stratification and instance selection algorithms for scaling down the data set before the subgroup discovery task. In addition, two new stratification models are proposed to increase the presence of minority classes in data sets, which affects to the Subgroup discovery process on them. The results Show that the Subgroup discovery extraction can be executed Oil large data sets preprocessed independently of the presence of minority classes, which Could not be executed in other way. (C) 2008 Elsevier B.V. All rights reserved.", "paper_title": "Subgroup discover in large size data sets preprocessed using stratified instance selection for increasing the presence of minority classes", "paper_id": "WOS:000261402500013"}