{"auto_keywords": [{"score": 0.01117450812811005, "phrase": "id_conservation_laws"}, {"score": 0.011073048037194508, "phrase": "source_terms"}, {"score": 0.004157144444405228, "phrase": "siam"}, {"score": 0.004138010495069077, "phrase": "j._sci"}, {"score": 0.0037921662574137535, "phrase": "important_feature"}, {"score": 0.0035722806911457545, "phrase": "id_capturing_fashion"}, {"score": 0.00327356326590461, "phrase": "governing_equations"}, {"score": 0.0030135741897058844, "phrase": "conservative_fashion"}, {"score": 0.00257735013358606, "phrase": "id_case"}, {"score": 0.0024956789310376635, "phrase": "data_structure"}, {"score": 0.002461472107682778, "phrase": "numerical_solutions"}, {"score": 0.0024389277933858054, "phrase": "first-_and_second-order_versions"}, {"score": 0.0023507916951658455, "phrase": "numerical_examples"}, {"score": 0.002318566141177149, "phrase": "scalar_equations"}, {"score": 0.002286781334850213, "phrase": "euler_system"}, {"score": 0.002265833357217618, "phrase": "gas_dynamics"}], "paper_keywords": ["conservation laws", " front-tracking", " discontinuity cell", " Cartesian-grid-based"], "paper_abstract": "In this paper, the second one in the series beginning with [D. Mao, Towards front tracking based on conservation in two space dimensions, SIAM J. Sci. Comput. 22 (1) (2000) 113-151], we study another important feature of our 2D conservative front-tracking method, i.e. discontinuity curves in two space dimensions are tracked in a ID capturing fashion. The evolution of 2D discontinuity curves are locally described by ID conservation laws with source terms, which are derived from the governing equations. The front-tracking in our method is then realized by numerically simulating these ID conservation laws with source terms in a conservative fashion. In this paper, our 2D front-tracking method is described in details, which is Cartesian-grid-based, conservative and much simpler in algorithm than other 2D front-tracking methods. The discussion starts with the ID case, which facilitates the following 2D discussion. Data structure of the numerical solutions and first- and second-order versions of our 2D front-tracking method are described. Finally, numerical examples for both scalar equations and the Euler system of gas dynamics in 2D are presented to show the efficiency and effectiveness of the method. (c) 2007 Elsevier Inc. All rights reserved.", "paper_title": "Towards front-tracking based on conservation in two space dimensions II, tracking discontinuities in capturing fashion", "paper_id": "WOS:000250209700019"}