{"auto_keywords": [{"score": 0.0500779474697818, "phrase": "commodity_trading_advisors"}, {"score": 0.03738416398077957, "phrase": "dea"}, {"score": 0.004659192888931046, "phrase": "operations_area"}, {"score": 0.004583205112737672, "phrase": "excessive_effect"}, {"score": 0.004326833704481825, "phrase": "derivatives_area"}, {"score": 0.004221379262804442, "phrase": "options_and_futures_contracts"}, {"score": 0.003824547895167011, "phrase": "futures_contracts"}, {"score": 0.0037621210719690594, "phrase": "excessive_leverage"}, {"score": 0.0035808664384880213, "phrase": "related_data_envelopment_analysis"}, {"score": 0.002878930338561009, "phrase": "excellent_job"}, {"score": 0.0028553159147435424, "phrase": "ranking_efficient_ctas"}, {"score": 0.002323826502178581, "phrase": "congestion_increases"}, {"score": 0.0022484715639779153, "phrase": "incentive_fees"}, {"score": 0.002230122498682801, "phrase": "cta"}, {"score": 0.0021050100013816652, "phrase": "cta."}], "paper_keywords": ["Leverage", " DEA", " congestion"], "paper_abstract": "Congestion is often used in the operations area to investigate the excessive effect of inputs on outputs. In finance, and more specifically in the derivatives area, leverage is embedded in options and futures contracts. Commodity Trading Advisors (CTAs) use leverage (margin-to-equity ratio) to magnify returns through the use of these futures contracts. However, excessive leverage may hamper performance. This paper aims to show that a related data envelopment analysis (DEA) called the \"congestion model\" can offer a more precise picture of identifying CTAs suffering from congestion. In other words, if congestion is present then a reduction in input(s) may generate an increase in output. However, the opposite effect can arise. Although traditional DEA does an excellent job at ranking efficient CTAs, congestion on the other hand sizes up which CTAs are using too much (overuse) of each input, thereby reducing their performance/compound return (output). We measure the congestion of the largest (in terms of capital) live 50 CTAs and identify which ones exhibit congestion. The evidence shows that the probability of experiencing congestion increases with the size, minimum purchase requirements, and the incentive fees a CTA operates. In contrast, this probability decreases with the age of the CTA.", "paper_title": "Congestion in Commodity Trading Advisors", "paper_id": "WOS:000298896400005"}