{"auto_keywords": [{"score": 0.04194481843244685, "phrase": "actual_probability"}, {"score": 0.00481495049065317, "phrase": "general_retrieval_operations"}, {"score": 0.004677847043645765, "phrase": "information_retrieval_rank_objects"}, {"score": 0.004264697351852424, "phrase": "matching_criterion"}, {"score": 0.0035648266669315943, "phrase": "scoring_functions"}, {"score": 0.003503497128638099, "phrase": "likelihood_property"}, {"score": 0.0033839745649214548, "phrase": "scoring_function"}, {"score": 0.002608040688794517, "phrase": "experimental_evidence"}, {"score": 0.002432971714608409, "phrase": "traditional_document_retrieval"}, {"score": 0.002349884235026956, "phrase": "crime_data"}, {"score": 0.0022828113789751694, "phrase": "unsolved_crime"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Information retrieval", " Probabilistic model", " Scoring function", " Ranking function"], "paper_abstract": "Probabilistic models of information retrieval rank objects (e.g. documents) in response to a query according to the probability of some matching criterion (e.g. relevance). These models rarely yield an actual probability and their scoring functions are interpreted to be purely ordinal within a given retrieval task. In this paper we show that some scoring functions possess a likelihood property, which means that the scoring function indicates the likelihood of matching when compared to other retrieval tasks. This is potentially more useful than pure ranking even though it cannot be interpreted as an actual probability. This property can be detected by using two modified effectiveness measures, entire precision and entire recall. Experimental evidence is offered to show the existence of this property both for traditional document retrieval and for the analysis of crime data where suspects of an unsolved crime are ranked according to the probability of culpability. (C) 2013 Elsevier Inc. All rights reserved.", "paper_title": "The likelihood property in general retrieval operations", "paper_id": "WOS:000317635500010"}