{"auto_keywords": [{"score": 0.04950097558699651, "phrase": "technology_products"}, {"score": 0.014625693390165716, "phrase": "different_lifestyles"}, {"score": 0.011493678315087937, "phrase": "external_information"}, {"score": 0.00481495049065317, "phrase": "purchase_intentions"}, {"score": 0.004395532072377065, "phrase": "distinctive_needs"}, {"score": 0.004212453011596424, "phrase": "previous_studies"}, {"score": 0.003775803846431323, "phrase": "comprehensive_study"}, {"score": 0.0036627245728600073, "phrase": "internal_demands"}, {"score": 0.0033029038236817372, "phrase": "hybrid_decision-making_model"}, {"score": 0.0031845067058084613, "phrase": "consumers'_internal_demands"}, {"score": 0.0030147970456037274, "phrase": "behavioural_patterns"}, {"score": 0.0028367868542874737, "phrase": "empirical_results"}, {"score": 0.002735052488172277, "phrase": "significant_role"}, {"score": 0.002685558057339722, "phrase": "consumers'_purchase_intentions"}, {"score": 0.0026050445177883005, "phrase": "early_adopters'_purchase_intention"}], "paper_keywords": ["lifestyle", " product characteristics", " technology products", " moderating"], "paper_abstract": "Consumers with different lifestyles often have distinctive needs for the same type of technology products. Previous studies have focused mostly on the characteristics and pricing of these products but there is lack of a comprehensive study on the effect of internal demands from consumers and the sources of external information on intentions to purchase. This study proposes a hybrid decision-making model that integrates product characteristics, consumers' internal demands and sources of external information for the exploration of behavioural patterns of consumers with different lifestyles when purchasing technology products. The empirical results suggest that lifestyle plays a significant role in moderating consumers' purchase intentions. Among various consumers, early adopters' purchase intention is motivated by features that highlight self-personality, while those of the pragmatists and the majority are mainly motivated by ease of contact, work need and sense of group. In addition, both the early adopters and the majority are influenced by the introduction of network and magazines, while the pragmatists are mainly affected by the introduction of retailers.", "paper_title": "A hybrid decision-making model for factors influencing the purchase intentions of technology products: the moderating effect of lifestyle", "paper_id": "WOS:000363750500007"}