{"auto_keywords": [{"score": 0.049509300669177574, "phrase": "job-independent_penalties"}, {"score": 0.03325006341470673, "phrase": "improvement_procedure"}, {"score": 0.004348936976349555, "phrase": "machine_idle_time"}, {"score": 0.004047296286849109, "phrase": "wide_range"}, {"score": 0.0038810583785936505, "phrase": "simple_scheduling_rules"}, {"score": 0.0032036590920314725, "phrase": "existing_adjacent_precedence_conditions"}, {"score": 0.0028245516301681713, "phrase": "computational_tests"}, {"score": 0.0027575842698911173, "phrase": "best_results"}, {"score": 0.00241658945942583, "phrase": "even_very_large_instances"}, {"score": 0.0022218413146898887, "phrase": "solution_quality"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["scheduling", " single machine", " early/tardy", " job-independent penalties", " dispatching rules"], "paper_abstract": "In this paper, we consider the single machine earliness/tardiness scheduling problem with job-independent penalties, and no machine idle time. Several dispatching heuristics are proposed, and their performance is analysed on a wide range of instances. The heuristics include simple scheduling rules, as well as a procedure that takes advantage of the strengths of each of those rules. We also consider early/tardy dispatching procedures, and a heuristic method based on existing adjacent precedence conditions. An improvement procedure that can be used to improve the schedules generated by the heuristics is also proposed. The computational tests show that the best results are given by the early/tardy dispatching rules. These heuristics are also quite fast, and are capable of quickly solving even very large instances. The use of the improvement procedure is recommended, since it improves the solution quality, with little additional computational effort. (c) 2007 Elsevier Ltd. All rights reserved.", "paper_title": "Dispatching heuristics for the single machine early/tardy scheduling problem with job-independent penalties", "paper_id": "WOS:000247289100005"}