{"auto_keywords": [{"score": 0.04818691642695348, "phrase": "distributed_ring_signature_scheme"}, {"score": 0.04353919016373321, "phrase": "possible_signing_subsets"}, {"score": 0.004815315858763145, "phrase": "distributed"}, {"score": 0.004718897469501381, "phrase": "general_dual_access_structures"}, {"score": 0.004397487039229447, "phrase": "distributed_anonymous_signature"}, {"score": 0.003487222504700868, "phrase": "dual_access_structures"}, {"score": 0.0033492947290751996, "phrase": "vector_space_families"}, {"score": 0.003105168935158648, "phrase": "involved_users"}, {"score": 0.002878785759716458, "phrase": "desired_properties"}, {"score": 0.0026023381988430666, "phrase": "identity-based_scenario"}, {"score": 0.002563219920877287, "phrase": "public_keys"}, {"score": 0.0023642842046859274, "phrase": "digital_certificates"}, {"score": 0.0021049977753042253, "phrase": "different_types"}], "paper_keywords": ["distributed ring signatures", " dual access structures", " provable security", " identity based cryptography", " random oracle model"], "paper_abstract": "In a distributed ring signature scheme, a subset of users cooperate to compute a distributed anonymous signature on a message, on behalf of a family of possible signing subsets. The receiver can verify that the signature comes from a subset of the ring, but he cannot know which subset has actually signed. In this work we use the concept of dual access structures to construct a distributed ring signature scheme which works with vector space families of possible signing subsets. The length of each signature is linear on the number of involved users, which is desirable for some families with many possible signing subsets. The scheme achieves the desired properties of correctness, anonymity and unforgeability. We analyze in detail the case in which our scheme runs in an identity-based scenario, where public keys of the users can be derived from their identities. This fact avoids the necessity of digital certificates, and therefore allows more efficient implementations of such systems. But our scheme can be extended to work in more general scenarios, where users can have different types of keys.", "paper_title": "Distributed ring signatures from general dual access structures", "paper_id": "WOS:000237657200007"}