{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "wireless_sensor_networks"}, {"score": 0.004485085675709643, "phrase": "prior_efforts"}, {"score": 0.0043506951029334984, "phrase": "efficient_flooding_algorithms"}, {"score": 0.004156590395333602, "phrase": "full_reliability"}, {"score": 0.004032002950217453, "phrase": "redundant_broadcasting"}, {"score": 0.0038913443732432468, "phrase": "efficient_flooding"}, {"score": 0.003793876828939456, "phrase": "existing_protocols"}, {"score": 0.00351582806482809, "phrase": "online_transmission_result"}, {"score": 0.0033588449972778004, "phrase": "probabilistic_and_opportunistic_flooding_algorithm"}, {"score": 0.003144345057121367, "phrase": "target_reliability"}, {"score": 0.0027554538693034163, "phrase": "node_relations"}, {"score": 0.002713788077665689, "phrase": "link_error_rates"}, {"score": 0.0026457367614424756, "phrase": "eligible_neighbors"}, {"score": 0.0024516267507109753, "phrase": "current_status"}, {"score": 0.002426842369975213, "phrase": "message_reception"}, {"score": 0.0021373366163721518, "phrase": "network_lifetime"}], "paper_keywords": ["Flooding", " Wireless sensor networks", " Probabilistic", " Opportunistic", " Target reliability"], "paper_abstract": "In wireless sensor networks, many communication protocols and applications rely on flooding for various networking purposes. Prior efforts focus on how to design efficient flooding algorithms; that is, they seek to achieve full reliability while reducing the number of redundant broadcasting across the network. To achieve efficient flooding, most of the existing protocols try to reduce the number of transmissions, which is decided without considering any online transmission result. In this paper, we propose a probabilistic and opportunistic flooding algorithm that controls rebroadcasts and retransmissions opportunistically. It seeks to achieve a target reliability required by an application. For this purpose, it makes a given node select only the subset of its one-hop neighbors to rebroadcast the same message. It considers node relations such as link error rates among nodes in selecting eligible neighbors to rebroadcast. The sender controls the number of retransmissions opportunistically by tracking the current status of message reception at its neighbors. Simulation is carried out to reveal that our proposed scheme achieves the given target reliability with less overhead than other flooding algorithms in most cases, thus prolonging the network lifetime. (C) 2011 Elsevier B.V. All rights reserved.", "paper_title": "A probabilistic and opportunistic flooding algorithm in wireless sensor networks", "paper_id": "WOS:000301313800008"}