{"auto_keywords": [{"score": 0.04251804837439931, "phrase": "team_cohesion"}, {"score": 0.02150427124185177, "phrase": "mental_simulation"}, {"score": 0.01453436233947729, "phrase": "team_collaboration"}, {"score": 0.00481495049065317, "phrase": "analogizing_and_mental_simulation_influence_team_dynamics"}, {"score": 0.004370087541308677, "phrase": "influence_team_dynamics"}, {"score": 0.004329916183121203, "phrase": "innovative_product_design"}, {"score": 0.004270347498153512, "phrase": "particular_emphasis"}, {"score": 0.0038935506745975835, "phrase": "\"analogical_distance"}, {"score": 0.0030196181347744372, "phrase": "especially_marked_association"}, {"score": 0.0026775328564629577, "phrase": "analogical_purpose"}, {"score": 0.002640636493247601, "phrase": "similar_association"}, {"score": 0.0025802660239538353, "phrase": "solution_generation"}, {"score": 0.0025096359514694523, "phrase": "stronger_association"}, {"score": 0.002407290605654707, "phrase": "mental_simulations"}, {"score": 0.0023522423291484212, "phrase": "valuable_functions"}, {"score": 0.0023198180380964305, "phrase": "enhanced_cohesion"}, {"score": 0.0021443262599352996, "phrase": "empirical_question"}], "paper_keywords": ["Analogical Reasoning", " Engineering Design", " Mental Simulation", " Team Cohesion", " Team Collaboration"], "paper_abstract": "The aim of this study was to gain further insight into how analogical reasoning and mental simulation, two cognitive strategies, influence team dynamics in innovative product design. A particular emphasis was placed on exploring the association between these two strategies and team cohesion and team collaboration. Analogies were coded for \"analogical distance\" (i.e., within domain or between domain) and \"analogical purpose\" (i.e., problem identification, function finding, solution generation, and explanation). The results indicated that the presence of either analogizing or mental simulation was related to team cohesion and team collaboration, with mental simulation having an especially marked association with team collaboration. Within-domain analogizing was found to enhance team collaboration, but it did not influence team cohesion. Furthermore, all types of analogical purpose showed a similar association with team cohesion, whereas solution generation and function finding had a stronger association with team collaboration. We propose that analogizing and mental simulations are strategies that serve valuable functions in engendering enhanced cohesion and collaboration, which might be expected to lead to more effective design outcomes, although this remains an empirical question in need of further corroboration.", "paper_title": "How do analogizing and mental simulation influence team dynamics in innovative product design?", "paper_id": "WOS:000354032400005"}