{"auto_keywords": [{"score": 0.03940134622178509, "phrase": "data_sets"}, {"score": 0.03511264743689795, "phrase": "search_space"}, {"score": 0.00481495049065317, "phrase": "aggregation_pheromone_density"}, {"score": 0.004034572092608487, "phrase": "closer_proximity"}, {"score": 0.0038674532861321864, "phrase": "new_algorithm"}, {"score": 0.0036646935906338414, "phrase": "aggregation_pheromone"}, {"score": 0.0034725269588525534, "phrase": "data_point"}, {"score": 0.003265175268104804, "phrase": "higher_pheromone_density"}, {"score": 0.003070166825722112, "phrase": "different_points"}, {"score": 0.0029885438439583075, "phrase": "deposited_pheromone"}, {"score": 0.002820850247525606, "phrase": "homogenous_groups"}, {"score": 0.0027670642397888494, "phrase": "proposed_algorithm"}, {"score": 0.0026934777251033776, "phrase": "well-known_benchmark_data_sets"}, {"score": 0.0024181413029825205, "phrase": "ant-based_method"}, {"score": 0.0022911901892022847, "phrase": "experimental_results"}, {"score": 0.0022388390432214415, "phrase": "proposed_apc_algorithm"}, {"score": 0.002154226045704907, "phrase": "execution_time"}, {"score": 0.0021049977753042253, "phrase": "large_number"}], "paper_keywords": ["aggregation pheromone", " ant colony optimization", " swarm intelligence", " data clustering"], "paper_abstract": "Ants, bees and other social insects deposit pheromone (a type of chemical) in order to communicate between the members of their community. Pheromone, that causes clumping or clustering behavior in a species and brings individuals into a closer proximity, is called aggregation pheromone. This article presents a new algorithm (called, APC) for clustering data sets based on this property of aggregation pheromone found in ants. An ant is placed at each location of a data point, and the ants are allowed to move in the search space to find points with higher pheromone density. The movement of an ant is governed by the amount of pheromone deposited at different points of the search space. More the deposited pheromone, more is the aggregation of ants. This leads to the formation of homogenous groups of data. The proposed algorithm is evaluated on a number of well-known benchmark data sets using different cluster validity measures. Results are compared with those obtained using two popular standard clustering techniques namely average linkage agglomerative and k-means clustering algorithm and with an ant-based method called adaptive time-dependent transporter ants for clustering (ATTAC). Experimental results justify the potentiality of the proposed APC algorithm both in terms of the solution (clustering) quality as well as execution time compared to other algorithms for a large number of data sets. (c) 2008 Elsevier Inc. All rights reserved.", "paper_title": "Aggregation pheromone density based data clustering", "paper_id": "WOS:000256323900004"}