{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "comprehensive_grobner_bases"}, {"score": 0.018476290137143574, "phrase": "comprehensive_grobner_system"}, {"score": 0.010503079970527683, "phrase": "new_approach"}, {"score": 0.010287796882261504, "phrase": "comprehensive_grobner_basis"}, {"score": 0.010181798707505234, "phrase": "parameterized_polynomial_system"}, {"score": 0.006539221502777604, "phrase": "faithful_comprehensive_grobner_basis"}, {"score": 0.004570634647887452, "phrase": "key_new_idea"}, {"score": 0.004234456398783788, "phrase": "power_products"}, {"score": 0.0037627064621795514, "phrase": "particular_branch"}, {"score": 0.003685067218455088, "phrase": "parameter_values"}, {"score": 0.0036595438031512217, "phrase": "nonzero_parts"}, {"score": 0.003308649946463136, "phrase": "whole_polynomials"}, {"score": 0.0031079352545607267, "phrase": "zero_parts"}, {"score": 0.0028000270988465486, "phrase": "original_parameterized_polynomial_system"}, {"score": 0.0025225467103906314, "phrase": "specific_algorithms"}, {"score": 0.0024026156525362684, "phrase": "parametric_polynomial_systems"}, {"score": 0.002336655334451466, "phrase": "new_theorem"}, {"score": 0.002164432930854161, "phrase": "better_performance"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Grobner basis", " Comprehensive Grobner basis", " Comprehensive Grobner system", " Stability condition"], "paper_abstract": "A new approach is proposed for computing a comprehensive Grobner basis of a parameterized polynomial system. The key new idea is not to simplify a polynomial under various specialization of its parameters, but rather keep track in the polynomial, of the power products whose coefficients vanish; this is achieved by partitioning the polynomial into two parts-nonzero part and zero part for the specialization under consideration. During the computation of a comprehensive Grobner system, for a particular branch corresponding to a specialization of parameter values, nonzero parts of the polynomials dictate the computation, i.e., computing S-polynomials as well as for simplifying a polynomial with respect to other polynomials; but the manipulations on the whole polynomials (including their zero parts) are also performed. Once a comprehensive Grobner system is generated, both nonzero and zero parts of the polynomials are collected from every branch and the result is a faithful comprehensive Grobner basis, to mean that every polynomial in a comprehensive Grobner basis belongs to the ideal of the original parameterized polynomial system. This technique should be applicable to all algorithms for computing a comprehensive Grobner system, thus producing both a comprehensive Grobner system as well as a faithful comprehensive Grobner basis of a parameterized polynomial system simultaneously. To propose specific algorithms for computing comprehensive GrObner bases, a more generalized theorem is presented to give a more generalized stable condition for parametric polynomial systems. Combined with the new approach, the new theorem leads to two efficient algorithms for computing comprehensive Grobner bases. The timings on a collection of examples demonstrate that both these two new algorithms for computing comprehensive Grobner bases have better performance than other existing algorithms. (C) 2012 Elsevier B.V. All rights reserved.", "paper_title": "An efficient method for computing comprehensive Grobner bases", "paper_id": "WOS:000316648400008"}