{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "pmc"}, {"score": 0.004665296491645837, "phrase": "data_cubes"}, {"score": 0.004356741449157895, "phrase": "molap_system"}, {"score": 0.004288472456976113, "phrase": "qc-tree"}, {"score": 0.004199101289890982, "phrase": "high_compression_ratio"}, {"score": 0.004068510313497539, "phrase": "fully_materialized_data_cube"}, {"score": 0.00392125815948488, "phrase": "improved_structure"}, {"score": 0.003492155652400838, "phrase": "notable_difference"}, {"score": 0.0027258422018680453, "phrase": "unstable_query_performance"}, {"score": 0.0026830601040919166, "phrase": "presented_algorithm"}, {"score": 0.0025586903829811296, "phrase": "cell_level"}, {"score": 0.0024529757621396717, "phrase": "update_cost"}, {"score": 0.002376559242152662, "phrase": "stable_query_performance"}, {"score": 0.0021498955164659145, "phrase": "storage_space"}, {"score": 0.0021049977753042253, "phrase": "data_cube"}], "paper_keywords": ["data warehousing", " data cube", " multidimensional database", " partial materialization"], "paper_abstract": "QC-Tree is one of the most storage-efficient structures for data cubes in an MOLAP system. Although QC-Tree can achieve a high compression ratio, it is still a fully materialized data cube. In this paper, an improved structure PMC is presented allowing us to materialize only a part of the cells in a QC-Tree to save more storage space. There is a notable difference between our partially materialization algorithm and traditional materialized views selection algorithms. In a traditional algorithm, when a view is selected, all the cells in this view are to be materialized. Otherwise, if a view is not selected, all the cells in this view will not be materialized. This strategy results in the unstable query performance. The presented algorithm, however, selects and materializes data in cell level, and, along with further reduced space and update cost, it can ensure a stable query performance. A series of experiments are conducted on both synthetic and real data sets. The results show that PMC can further reduce storage space occupied by the data cube, and can shorten the time to update the cube.", "paper_title": "PMC: Select materialized cells in data cubes", "paper_id": "WOS:000236292700023"}