{"auto_keywords": [{"score": 0.03483912302181536, "phrase": "affect_recognition"}, {"score": 0.013581859494857103, "phrase": "recognition_process"}, {"score": 0.008718487782352907, "phrase": "temporal_phases"}, {"score": 0.008556327207405236, "phrase": "affective_states"}, {"score": 0.00481495049065317, "phrase": "automatic_temporal_segment_detection"}, {"score": 0.004259638825837131, "phrase": "main_mechanisms"}, {"score": 0.004206421370630723, "phrase": "important_role"}, {"score": 0.004025320909035849, "phrase": "human_physiology"}, {"score": 0.003987535625069556, "phrase": "temporal_evolution"}, {"score": 0.0038278398921822404, "phrase": "temporal_segments"}, {"score": 0.00366297866938793, "phrase": "computer_scientists"}, {"score": 0.0032811244238035455, "phrase": "single_modalities"}, {"score": 0.0032197682621899703, "phrase": "even_the_few_multimodal_systems"}, {"score": 0.003179500862953224, "phrase": "sufficient_attention"}, {"score": 0.003149630099034765, "phrase": "modalities'_dynamics"}, {"score": 0.0031200390864992407, "phrase": "automatic_determination"}, {"score": 0.003032918641059871, "phrase": "modality_fusion"}, {"score": 0.0028300327780308903, "phrase": "affective_face"}, {"score": 0.00281227375628713, "phrase": "body_display"}, {"score": 0.002526821678335054, "phrase": "experimental_results"}, {"score": 0.0022631392664577256, "phrase": "fused_face"}, {"score": 0.0022489295919084643, "phrase": "body_modalities"}, {"score": 0.0021792054532842682, "phrase": "body_modality"}, {"score": 0.002138410677608455, "phrase": "synchronized_feature-level_fusion"}, {"score": 0.0021049977753042253, "phrase": "decision-level_fusion"}], "paper_keywords": ["Affect recognition", " affective face and body display", " phase synchronization", " selective fusion", " temporal segment detection"], "paper_abstract": "Psychologists have long explored mechanisms with which humans recognize other humans' affective states from modalities, such as voice and face display. This exploration has led to the identification of the main mechanisms, including the important role played in the recognition process by the modalities, dynamics. Constrained by the human physiology, the temporal evolution of a modality appears to be well approximated by a sequence of temporal segments called onset, apex, and offset. Stemming from these findings, computer scientists, over the past 15 years, have proposed various methodologies to automate the recognition process. We note, however, two main limitations to date. The first is that much of the past research has focused on affect recognition from single modalities. The second is that even the few multimodal systems have not paid sufficient attention to the modalities' dynamics: The automatic determination of their temporal segments, their synchronization to the purpose of modality fusion, and their role in affect recognition are yet to be adequately explored. To address this issue, this paper focuses on affective face and body display, proposes a method to automatically detect their temporal segments or phases, explores whether the detection of the temporal phases can effectively support recognition of affective states, and recognizes affective states based on phase synchronization/alignment. The experimental results obtained show the following: 1) affective face and body displays are simultaneous but not strictly synchronous; 2) explicit detection of the temporal phases can improve the accuracy of affect recognition; 3) recognition from fused face and body modalities performs better than that from the face or the body modality alone; and 4) synchronized feature-level fusion achieves better performance than decision-level fusion.", "paper_title": "Automatic Temporal Segment Detection and Affect Recognition From Face and Body Display", "paper_id": "WOS:000262562700008"}