{"auto_keywords": [{"score": 0.029979913616334355, "phrase": "k-nearest_neighbor"}, {"score": 0.015570195150470633, "phrase": "combined_classifiers"}, {"score": 0.01505781179124599, "phrase": "prediction_accuracy"}, {"score": 0.012553044826119976, "phrase": "single_classifiers"}, {"score": 0.012197076439978142, "phrase": "traditional_statistical_methods"}, {"score": 0.00481495049065317, "phrase": "currency_crisis_prediction"}, {"score": 0.004700027722284931, "phrase": "early_warning_system"}, {"score": 0.0035852640843794252, "phrase": "machine_learning"}, {"score": 0.002968695624366393, "phrase": "currency_crisis"}, {"score": 0.002855934865505357, "phrase": "vector_machine"}, {"score": 0.0025181367444581993, "phrase": "first_quarter"}, {"score": 0.0024818194799172263, "phrase": "third_quarter"}, {"score": 0.002241816883550397, "phrase": "nearest_neighbor_tree"}, {"score": 0.0022094759531152072, "phrase": "highest_area"}, {"score": 0.0021881743793875767, "phrase": "roc_curve_number"}, {"score": 0.0021049977753042253, "phrase": "computational_time"}], "paper_keywords": ["Machine learning", " Combined classifiers", " Currency crisis", " Early warning system", " k-Nearest neighbor method"], "paper_abstract": "Is the prediction accuracy affected by the method used in the ensemble of the classifiers? This paper is a sequel of our experiment in order to find an answer for such question. Previously, we had conducted an experiment by using single classifiers in the machine learning against traditional statistical methods. The results showed that single classifiers in machine learning perform well compared to the traditional statistical methods. Still, we believe that there is another way to increase the prediction accuracy of these classifiers. In this paper, we conducted another experiment by combining these classifiers in predicting currency crisis of 25 countries. The combined classifiers are support vector machine with k-nearest neighbor, logistic regression with k-nearest neighbor and finally LADTree with k-nearest neighbor. These three combined classifiers are tested on 13 chosen macroeconomic indicators which the data is taken from first quarter 1980 to third quarter 2012. The results of this experiment showed that these three different combined classifiers averagely have same higher accuracy and quite comparable. Our proposed method, nearest neighbor tree has the highest area under ROC curve number among these three combined classifiers although in terms of computational time it took longer running times than the others.", "paper_title": "Measuring the accuracy of currency crisis prediction with combined classifiers in designing early warning system", "paper_id": "WOS:000361624700005"}