{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "simultaneous_pick-up"}, {"score": 0.010240040083641513, "phrase": "vehicle_routing_problem"}, {"score": 0.005297221773646095, "phrase": "proposed_approach"}, {"score": 0.0041703614123283165, "phrase": "capacitated_vehicle_routing_problem"}, {"score": 0.0034097787109430384, "phrase": "reverse_logistics_activities"}, {"score": 0.00326572165784246, "phrase": "efficient_and_effective_vehicle_routes"}, {"score": 0.0028279422436488116, "phrase": "capacitated_vehicle"}, {"score": 0.002669683153809812, "phrase": "genetic_algorithm_based_approach"}, {"score": 0.0025752890978323873, "phrase": "computational_example"}, {"score": 0.0025021765811679446, "phrase": "parameter_settings"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Genetic algorithms", " Reverse logistics", " Vehicle routing problem with simultaneous pick-up and deliveries"], "paper_abstract": "The vehicle routing problem with simultaneous pick-up and deliveries, which considers simultaneous distribution and collection of goods to/from customers, is an extension of the capacitated vehicle routing problem. There are various real cases, where fleet of vehicles originated in a depot serves customers with pick-up and deliveries from/to their locations. Increasing importance of reverse logistics activities make it necessary to determine efficient and effective vehicle routes for simultaneous pick-up and delivery activities. The vehicle routing problem with simultaneous pick-up and deliveries is also NP-hard as a capacitated vehicle routing problem and this study proposes a genetic algorithm based approach to this problem. Computational example is presented with parameter settings in order to illustrate the proposed approach. Moreover, performance of the proposed approach is evaluated by solving several test problems. (c) 2011 Elsevier Ltd. All rights reserved.", "paper_title": "A genetic algorithm based approach to vehicle routing problem with simultaneous pick-up and deliveries", "paper_id": "WOS:000302432300011"}