{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "information_retrieval_process"}, {"score": 0.03915956200529289, "phrase": "documentary_system"}, {"score": 0.03108608817096443, "phrase": "peer_review_systems"}, {"score": 0.024374481103969167, "phrase": "imperfect_peer_review_process"}, {"score": 0.024032031172232838, "phrase": "human_evaluation"}, {"score": 0.02327858977146651, "phrase": "high_amount"}, {"score": 0.02311431607415804, "phrase": "qualified_papers"}, {"score": 0.004728874038094706, "phrase": "editorial_peer_review_systems"}, {"score": 0.0045612889352793584, "phrase": "best_papers"}, {"score": 0.004495922204117959, "phrase": "different_human_perceptions"}, {"score": 0.004383766516923386, "phrase": "peer_review"}, {"score": 0.003849502288990788, "phrase": "corresponding_problems"}, {"score": 0.0034046409849387365, "phrase": "command_language"}, {"score": 0.0032484270911235526, "phrase": "\"real_topic"}, {"score": 0.003011033940247791, "phrase": "statement_classical_information_retrieval_evaluation_techniques"}, {"score": 0.002522240133079871, "phrase": "peer_review_data"}, {"score": 0.002486021541116251, "phrase": "angewandte_chemie_-_international_edition"}, {"score": 0.0024591984725764954, "phrase": "citation_impact_data"}, {"score": 0.002441477009112022, "phrase": "accepted_papers"}, {"score": 0.0023718560142554634, "phrase": "elsewhere_papers"}], "paper_keywords": ["Information science", " Information retrieval", " Periodicals", " Peer review"], "paper_abstract": "Purpose - In editorial peer review systems of journals, one does not always accept the best papers. Due to different human perceptions, the evaluation of papers by peer review (for a journal) can be different from the impact that a paper has after its publication (measured by number of citations received) in this or another journal. This system (and corresponding problems) is similar to the information retrieval process in a documentary system. Also there, one retrieves not always the most relevant documents for a certain topic. This is so because the topic is described in the command language of the documentary system and this command does not always completely cover the \"real topic\" that one wants to describe. This paper aims to address this issue. Design/methodology/approach - Based on this statement classical information retrieval evaluation techniques were applied to the evaluation of peer review systems. Basic in such an information retrieval evaluation are the notions of precision and recall and the precision-recall-curve. Such notions are introduced here for the evaluation of peer review systems. Findings - The analogues of precision and recall are defined and their curve constructed based on peer review data from the journal Angewandte Chemie - International Edition and on citation impact data of accepted papers by this journal or rejected but published elsewhere papers. It is concluded that, clue to the imperfect peer review process (based on human evaluation), if we want to publish a high amount of qualified papers (the ones we seek), several non-qualified papers should also be accepted. Originality/value - The authors conclude that, due to the imperfect peer review process (based on human evaluation), if we want to publish a high amount of qualified papers (the ones we seek), one will also accept several non-qualified papers.", "paper_title": "Journal peer review as an information retrieval process", "paper_id": "WOS:000308836300006"}