{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "service_providers"}, {"score": 0.008432059424047041, "phrase": "think-aloud_study"}, {"score": 0.008067795309504043, "phrase": "complex_it_outsourcing_arrangements"}, {"score": 0.007866697496018819, "phrase": "existing_software"}, {"score": 0.006129554727029778, "phrase": "security_requirements"}, {"score": 0.00459165923324494, "phrase": "compliance_management"}, {"score": 0.004533875923066433, "phrase": "best_practice"}, {"score": 0.004269138804116093, "phrase": "greater_challenges"}, {"score": 0.004071055784602253, "phrase": "work_practices"}, {"score": 0.004007083686875716, "phrase": "complex_and_transitory_security_requirements"}, {"score": 0.0038698476651328898, "phrase": "semi-structured_interviews"}, {"score": 0.0037610536973798113, "phrase": "specific_requirements"}, {"score": 0.0036785473375981533, "phrase": "security_and_compliance_management"}, {"score": 0.0033983319323179495, "phrase": "in-house_settings"}, {"score": 0.0032302647179383915, "phrase": "standardized_and_formal_descriptions"}, {"score": 0.002909342017421165, "phrase": "specific_security_requirements"}, {"score": 0.0028909473120830842, "phrase": "organizational_boundaries"}, {"score": 0.0025871803852805793, "phrase": "software_architecture"}, {"score": 0.0023974961635593135, "phrase": "potential_end_users"}, {"score": 0.0023152577218214804, "phrase": "prototypical_implementation"}, {"score": 0.0022006365282969454, "phrase": "described_requirements"}, {"score": 0.0021116893817282796, "phrase": "complex_it"}, {"score": 0.0021049977753042253, "phrase": "outsourcing_arrangements"}], "paper_keywords": ["Security management", " Compliance", " Service provision", " Software architecture", " Outsourcing"], "paper_abstract": "Service providers expected to see a simplification regarding security and compliance management as standards and best practice were applied to complex information technology (IT) outsourcing arrangements. However, security and compliance management became even more complex and is presenting greater challenges to service providers than ever before. In this article, we focus on the work practices of service providers dealing with complex and transitory security requirements and distributed IT infrastructures. Based on the results of semi-structured interviews followed by a think-aloud study, we first describe specific requirements to be met by software supporting security and compliance management in complex IT outsourcing arrangements, and discuss the extent to which existing software already meets them. We show that existing software, which is primarily designed for in-house settings, fails to meet requirements of complex IT outsourcing arrangements such as (1) the use of standardized and formal descriptions of security requirements and configurations, (2) the definition of a interface allowing to exchange messages and to delegate tasks, (3) the provision of mechanisms for designing and implementing a configuration for specific security requirements across organizational boundaries, (4) the provision of mechanisms for verifying and approving the enforcement of these security requirements, and (5) the provision of mechanisms for searching and browsing security requirements, configurations and links between them. We then propose a software architecture that claims to be capable of meeting those requirements and outline how this claim was evaluated by means of another think-aloud study in which potential end users were asked to perform a series of tasks using a prototypical implementation of the architecture. The results of the evaluation confirm that the software meets the described requirements and suggests that it facilitates the management of security and compliance in complex IT outsourcing arrangements. (C) 2014 Elsevier Ltd. All rights reserved.", "paper_title": "Complexity is dead, long live complexity! How software can help service providers manage security and compliance", "paper_id": "WOS:000341340600012"}