{"auto_keywords": [{"score": 0.045307674787187925, "phrase": "depth_layer"}, {"score": 0.014072355232138498, "phrase": "high_accuracy"}, {"score": 0.010342238377159509, "phrase": "moving_objects"}, {"score": 0.00481495049065317, "phrase": "-object_segmentation"}, {"score": 0.004780334370089564, "phrase": "stereoscopic_video"}, {"score": 0.004644329185633612, "phrase": "novel_layered_stereoscopic_moving-object_segmentation_method"}, {"score": 0.004495922204117959, "phrase": "motion_information"}, {"score": 0.004197942881217177, "phrase": "higher-order_statistics"}, {"score": 0.004063741692442559, "phrase": "computed_motion_information"}, {"score": 0.003991040678278726, "phrase": "change_detection"}, {"score": 0.0035426543993952184, "phrase": "layered_segmentation"}, {"score": 0.0034792431564692997, "phrase": "multiple_depth-layer_masks"}, {"score": 0.0033076455392068095, "phrase": "motion_mask"}, {"score": 0.003110579040263398, "phrase": "corresponding_layer"}, {"score": 0.0029893477597041493, "phrase": "video_sequence"}, {"score": 0.0029571101238632783, "phrase": "sliding_window"}, {"score": 0.002821371992763293, "phrase": "background_layers"}, {"score": 0.0027310567737368033, "phrase": "proposed_method"}, {"score": 0.00260566789186855, "phrase": "corresponding_depth-layer_masks"}, {"score": 0.002558985036330194, "phrase": "experimental_results"}, {"score": 0.00251313643823856, "phrase": "proposed_layered_moving-object_segmentation_method"}, {"score": 0.002320943211698446, "phrase": "required_computational_load"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Video segmentation", " Stereoscopic video", " Layered segmentation", " Depth-layer mask", " Disparity estimation", " Motion mask", " Moving objects", " Higher order statistics", " Change detection"], "paper_abstract": "A novel layered stereoscopic moving-object segmentation method is proposed in this paper by exploiting both motion information and depth information to extract moving objects for each depth layer with high accuracy on their shape boundary. By taking a higher-order statistics on two frame-difference fields across three adjacent frames, the computed motion information are used to conduct change detection and generate one motion mask that consists of all the moving objects from all the depth layers involved at each view. It would be highly desirable, and challenging, to further differentiate them according to their residing depth layer to achieve layered segmentation. For that, multiple depth-layer masks are generated using our proposed disparity estimation method, one for each depth layer. By intersecting the motion mask and one depth-layer mask at any given layer-of-interest, the moving objects associated with the corresponding layer are then extracted. All the above-mentioned processes are repeatedly performed along the video sequence with a sliding window of three frames at a time. For demonstration, only the foreground and the background layers are considered in this paper, while the proposed method is generic and can be straightforwardly extended to more layers, once the corresponding depth-layer masks are made available. Experimental results have shown that the proposed layered moving-object segmentation method is able to segment the foreground and background moving objects separately, with high accuracy on their shape boundary. In addition, the required computational load is considered fairly inexpensive, since our design methodology is to generate masks and perform intersections for extracting the moving objects for each depth layer. (C) 2013 Elsevier Inc. All rights reserved.", "paper_title": "Layered moving-object segmentation for stereoscopic video using motion and depth information", "paper_id": "WOS:000324848700009"}