{"auto_keywords": [{"score": 0.03327620350569449, "phrase": "updrs_assessment"}, {"score": 0.004750873844061641, "phrase": "genetic_programming_system"}, {"score": 0.00470862827326028, "phrase": "geometric_semantic_genetic_operators"}, {"score": 0.004502943680955863, "phrase": "parkinson's_disease_symptom_progression"}, {"score": 0.004403480614319231, "phrase": "tracking_process"}, {"score": 0.004287008195370748, "phrase": "invasive_and_time-consuming_specialized_examinations"}, {"score": 0.004118026552723285, "phrase": "trained_medical_staff"}, {"score": 0.0037490909410974166, "phrase": "new_powerful_computational_tools"}, {"score": 0.0032638170723261538, "phrase": "innovative_intelligent_system"}, {"score": 0.003220315882881027, "phrase": "genetic_programming"}, {"score": 0.0028411768240129585, "phrase": "recently_defined_geometric_semantic_genetic_operators"}, {"score": 0.002741269087816162, "phrase": "largest_database"}, {"score": 0.002716844480081738, "phrase": "parkinson's_disease_speech"}, {"score": 0.002473129577319634, "phrase": "proposed_system"}, {"score": 0.002322895056238477, "phrase": "geometric_semantic_genetic_programming"}, {"score": 0.0022311596751824416, "phrase": "standard_genetic_programming_and_other_state_of_the_art_machine_learning_methods"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Unified Parkinson's Disease Rating Scale", " Genetic programming", " Geometric operators", " Semantics"], "paper_abstract": "Unified Parkinson's Disease Rating Scale (UPDRS) assessment is the most used scale for tracking Parkinson's disease symptom progression. Nowadays, the tracking process requires a patient to undergo invasive and time-consuming specialized examinations in hospital clinics, under the supervision of trained medical staff. Thus, the process is costly and logistically inconvenient for both patients and clinicians. For this reason, new powerful computational tools, aimed at making the process more automatic, cheaper and less invasive, are becoming more and more a necessity. The purpose of this paper is to investigate the use of an innovative intelligent system based on genetic programming for the prediction of UPDRS assessment, using only data derived from simple, self-administered and non-invasive speech tests. The system we propose is called geometric semantic genetic programming and it is based on recently defined geometric semantic genetic operators. Experimental results, achieved using the largest database of Parkinson's disease speech in existence (approximately 6000 recordings from 42 Parkinson's disease patients, recruited in a six-month, multi-centre trial), show the appropriateness of the proposed system for the prediction of UPDRS assessment. In particular, the results obtained with geometric semantic genetic programming are significantly better than the ones produced by standard genetic programming and other state of the art machine learning methods both on training and unseen test data. (C) 2014 Elsevier Ltd. All rights reserved.", "paper_title": "Prediction of the Unified Parkinson's Disease Rating Scale assessment using a genetic programming system with geometric semantic genetic operators", "paper_id": "WOS:000335629500009"}