{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "effort_estimation_methods"}, {"score": 0.004594443767709888, "phrase": "data_mining"}, {"score": 0.0044356867986444426, "phrase": "empirical_study"}, {"score": 0.0039218440805789965, "phrase": "historical_data"}, {"score": 0.0035496495489801667, "phrase": "descriptive_statistics"}, {"score": 0.003367077034382727, "phrase": "data_mining_techniques"}, {"score": 0.0028736379396305596, "phrase": "maintenance_effort"}, {"score": 0.0026313840069327713, "phrase": "prediction_accuracy"}, {"score": 0.002540285736232122, "phrase": "new_unseen_data"}, {"score": 0.002409503258044183, "phrase": "knowledge_model"}, {"score": 0.0022192891418394535, "phrase": "useful_perspective"}, {"score": 0.0021049977753042253, "phrase": "complementary_insight"}], "paper_keywords": ["4GL", " data mining", " metrics", " maintenance prediction"], "paper_abstract": "This paper presents an empirical study analysing the relationship between a set of metrics for Fourth-Generation Languages (4GL) programs and their maintainability. An analysis has been made using historical data of several industrial projects and three different approaches: the first one relates metrics and maintainability based on techniques of descriptive statistics, and the other two are based on Data Mining techniques. A discussion on the results obtained with the three techniques is also presented, as well as a set of equations and rules for predicting the maintenance effort in this kind of programs. Finally, we have done experiments about the prediction accuracy of these methods by using new unseen data, which were not used to build the knowledge model. The results were satisfactory as the application of each technique separately provides useful perspective for the manager in order to get a complementary insight from data.", "paper_title": "A comparison of effort estimation methods for 4GL programs: Experiences with statistics and data mining", "paper_id": "WOS:000236744800007"}