{"auto_keywords": [{"score": 0.04047491938097359, "phrase": "student_survey"}, {"score": 0.011750956706525078, "phrase": "case_study"}, {"score": 0.00481495049065317, "phrase": "student_perspectives"}, {"score": 0.004558977045730675, "phrase": "new_form"}, {"score": 0.0043610084347896596, "phrase": "particular_challenges"}, {"score": 0.0040040425282442125, "phrase": "brief_e-internship_description"}, {"score": 0.003778081566896723, "phrase": "students'_past_internship_experience"}, {"score": 0.0037140731069193896, "phrase": "potential_factors"}, {"score": 0.0034332736827447654, "phrase": "student_awareness"}, {"score": 0.003409880074659807, "phrase": "prior_experience"}, {"score": 0.0032173412933955117, "phrase": "preliminary_research"}, {"score": 0.0030356410934402503, "phrase": "new_internships"}, {"score": 0.002963830787280652, "phrase": "traditional_internships"}, {"score": 0.002777341265639153, "phrase": "previous_internships"}, {"score": 0.0027584046728703297, "phrase": "prior_knowledge"}, {"score": 0.0027395968397212053, "phrase": "potential_influences"}, {"score": 0.002602555367635598, "phrase": "practical_issues"}, {"score": 0.002506423807926416, "phrase": "new_findings"}, {"score": 0.002430411367515404, "phrase": "right_direction"}, {"score": 0.0024055884143050037, "phrase": "success_factors"}, {"score": 0.002238767763626708, "phrase": "available_statistics"}, {"score": 0.0021708548759021844, "phrase": "relevant_research_avenues"}, {"score": 0.0021194582289403925, "phrase": "virtual_work"}, {"score": 0.0021049977753042253, "phrase": "personnel_management"}], "paper_keywords": ["Internet", " Individual differences", " Computer-mediated communication", " e-Internship", " Virtual internship"], "paper_abstract": "Purpose - The purpose of this paper is to discuss the emergence of a new form of internship (virtual or e-internships), which poses particular challenges for the interns, the supervisors and organizations alike. The authors present results regarding the prevalence and characteristics of e-internships, including a brief e-internship description for demonstrative purposes. Then use the findings of a student survey to outline the role of students' past internship experience and prior knowledge as potential factors that influence acceptance of e-internships. Design/methodology/approach - The case study was based on an interview with an e-intern and the analysis of student awareness, prior experience and knowledge was based on the analysis of a student survey. Findings - The paper summarizes preliminary research that confirms the emergence of e-internships in several countries. It also outlines the characteristics of these new internships and outlines how e-internships compare to traditional internships, thus providing an insight for practitioners and managers. The case study and student survey outline the role of previous internships and prior knowledge as potential influences on self-selection and interest in e-internships. The paper further discusses some of the practical issues. Research limitations/implications - This paper outlines a number of new findings about the e-internships and represents only a first step into the right direction. The success factors and conditions for these internships are currently largely unknown. \\ Originality/value - This paper provides information about e-internships using available statistics, a case study and survey results. The paper outlines relevant research avenues for researchers in the area of virtual work and personnel management, e-collaboration, communication studies and multimedia effectiveness.", "paper_title": "e-Internships: prevalence, characteristics and role of student perspectives", "paper_id": "WOS:000341887300003"}