{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "keyword_search-based_data_integration"}, {"score": 0.004695389394526107, "phrase": "data_integration"}, {"score": 0.004628400269774981, "phrase": "new_sources"}, {"score": 0.00441718685609235, "phrase": "global_schemas"}, {"score": 0.004385555408850022, "phrase": "integrated_data"}, {"score": 0.0038950367927745267, "phrase": "data_experts"}, {"score": 0.0037845987749316632, "phrase": "global_schema"}, {"score": 0.00333697550984782, "phrase": "data_domain"}, {"score": 0.0032774911048411804, "phrase": "answers'_quality"}, {"score": 0.003105305189036267, "phrase": "major_open_challenge"}, {"score": 0.002797572252783356, "phrase": "high_relevance"}, {"score": 0.0026600905156986317, "phrase": "existing_systems"}, {"score": 0.002529347938294228, "phrase": "record_matching"}, {"score": 0.0023791769068748194, "phrase": "query_result's_score"}, {"score": 0.0022218413146898887, "phrase": "active_learning_approach"}, {"score": 0.002197966048531954, "phrase": "search-based_data_integration"}, {"score": 0.0021202154023229123, "phrase": "real_data"}], "paper_keywords": ["Data integration", " Keyword search", " Active learning"], "paper_abstract": "The problem of scaling up data integration, such that new sources can be quickly utilized as they are discovered, remains elusive: Global schemas for integrated data are difficult to develop and expand, and schema and record matching techniques are limited by the fact that data and metadata are often under-specified and must be disambiguated by data experts. One promising approach is to avoid using a global schema, and instead to develop keyword search-based data integration-where the system lazily discovers associations enabling it to join together matches to keywords, and return ranked results. The user is expected to understand the data domain and provide feedback about answers' quality. The system generalizes such feedback to learn how to correctly integrate data. A major open challenge is that under this model, the user only sees and offers feedback on a few \"top-\" results: This result set must be carefully selected to include answers of high relevance and answers that are highly informative when feedback is given on them. Existing systems merely focus on predicting relevance, by composing the scores of various schema and record matching algorithms. In this paper, we show how to predict the uncertainty associated with a query result's score, as well as how informative feedback is on a given result. We build upon these foundations to develop an active learning approach to keyword search-based data integration, and we validate the effectiveness of our solution over real data from several very different domains.", "paper_title": "Active learning in keyword search-based data integration", "paper_id": "WOS:000361395800002"}