{"auto_keywords": [{"score": 0.015719716506582538, "phrase": "double_jpeg_compression"}, {"score": 0.014740792301832633, "phrase": "huang_et_al"}, {"score": 0.011391275798413198, "phrase": "proposed_method"}, {"score": 0.01108042710953359, "phrase": "dct_coefficients"}, {"score": 0.004704495156558224, "phrase": "double_jpeg_compression_detection"}, {"score": 0.0046394362688524475, "phrase": "important_role"}, {"score": 0.004596561972944185, "phrase": "digital_image_forensics"}, {"score": 0.004036141321779216, "phrase": "jpeg_image"}, {"score": 0.003852939975815287, "phrase": "random_permutation"}, {"score": 0.003593555152077465, "phrase": "anti-forensic_method"}, {"score": 0.003068242064611088, "phrase": "first_compression"}, {"score": 0.002997735656669146, "phrase": "second_one"}, {"score": 0.0028482561434303886, "phrase": "linear_model"}, {"score": 0.002523828967909659, "phrase": "image_texture"}, {"score": 0.002488851299416018, "phrase": "extensive_experiments"}, {"score": 0.002134592410214824, "phrase": "higher_visual_quality"}], "paper_keywords": ["Double JPEG compression", " Anti-forensics", " Digital forensics"], "paper_abstract": "Double JPEG compression detection plays an important role in digital image forensics. Recently, Huang et al. (IEEE Trans Inf Forensics Security 5(4):848-856, 2010) first pointed out that the number of different discrete cosine transform (DCT) coefficients would monotonically decrease when repeatedly compressing a JPEG image with the same quantization matrix, and a strategy based on random permutation was developed to expose such an operation successfully. In this paper, we propose an anti-forensic method to fool this method. The proposed method tries to slightly modify the DCT coefficients for confusing the traces introduced by double JPEG compression with the same quantization matrix. By investigating the relationship between the DCT coefficients of the first compression and those of the second one, we determine the quantity of modification by constructing a linear model. Furthermore, in order to improve the security of anti-forensics, the locations of modification are adaptively selected according to the complexity of the image texture. The extensive experiments evaluated on 10,000 natural images have shown that the proposed method can effectively confuse the detector proposed in Huang et al. (IEEE Trans Inf Forensics Security 5(4):848-856, 2010), while keeping higher visual quality and leaving fewer other detectable statistical artifacts.", "paper_title": "Anti-forensics of double JPEG compression with the same quantization matrix", "paper_id": "WOS:000360071800008"}