{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "multi-view_semi-supervised_action_recognition"}, {"score": 0.004066898031169742, "phrase": "discriminant_subspace_learning_techniques"}, {"score": 0.003890491876670706, "phrase": "single"}, {"score": 0.00378767277402891, "phrase": "layer_feedforward_neural"}, {"score": 0.0036229421570951807, "phrase": "elm_algorithm"}, {"score": 0.003465350958971198, "phrase": "discrimination_criteria"}, {"score": 0.0031422859551159506, "phrase": "proposed_discriminant_elm_algorithm"}, {"score": 0.0029789104204803137, "phrase": "proper_regularization"}, {"score": 0.00258347644721642, "phrase": "multi-view_action_classification"}, {"score": 0.002515384834484012, "phrase": "proposed_classification_algorithms"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Extreme learning machine", " Semi-supervised learning", " Multi-view learning"], "paper_abstract": "In this paper, three novel classification algorithms aiming at (semi-)supervised action classification are proposed. Inspired by the effectiveness of discriminant subspace learning techniques and the fast and efficient Extreme Learning Machine (ELM) algorithm for Single-hidden Layer Feedforward Neural networks training, the ELM algorithm is extended by incorporating discrimination criteria in its optimization process, in order to enhance its classification performance. The proposed Discriminant ELM algorithm is extended, by incorporating proper regularization in its optimization process, in order to exploit information appearing in both labeled and unlabeled action instances. An iterative optimization scheme is proposed in order to address multi-view action classification. The proposed classification algorithms are evaluated on three publicly available action recognition databases providing state-of-the-art performance in all the cases. (C) 2014 Elsevier B.V. All rights reserved.", "paper_title": "Regularized extreme learning machine for multi-view semi-supervised action recognition", "paper_id": "WOS:000342248100029"}