{"auto_keywords": [{"score": 0.038928562270111176, "phrase": "ip_components"}, {"score": 0.00481495049065317, "phrase": "re-configurable_platforms"}, {"score": 0.004690305164360866, "phrase": "large_and_high-throughput_signal_processing_applications"}, {"score": 0.00433531459712787, "phrase": "re-configurable_components"}, {"score": 0.0031429517477457925, "phrase": "ip_libraries"}, {"score": 0.0031019373572233706, "phrase": "portability_requirements"}, {"score": 0.0030414140732789186, "phrase": "design_flow"}, {"score": 0.0025977542995083624, "phrase": "porting_issue"}, {"score": 0.002480961181275199, "phrase": "new_automated_task-level_mapping_method"}, {"score": 0.0023850311572318496, "phrase": "hw-sw_commercially_available_co-design_method"}, {"score": 0.002233301265743633, "phrase": "ip_wrapping"}, {"score": 0.0021049977753042253, "phrase": "otherwise_highly_desirable_system-level_design_methods"}], "paper_keywords": ["IP-component", " interfacing", " wrapping", " re-use"], "paper_abstract": "When mapping large and high-throughput signal processing applications onto heterogeneous platforms, parts of these applications are assigned to re-configurable components. Automating such mappings without delving deep into details implies the (re-) use of IP components. When it comes to 1) relying on IP components in system-level and (re-configurable) platform-based design, and 2) porting of such designs across platforms, it is not well known how to integrate both IP libraries and portability requirements into the design flow. To investigate these uncertainties, we have conducted four case studies around the (re-)use and interfacing of IP components. One is focusing on the porting issue, one is dealing with a new automated task-level mapping method, one is evaluating a HW-SW commercially available co-design method, and one is about standardization of interfaces for IP wrapping. The case studies reveal the weakness of otherwise highly desirable system-level design methods when evaluated with respect to fast, accurate, and systematic IP integration.", "paper_title": "Requirements for interfacing IP-components in re-configurable platforms", "paper_id": "WOS:000237975100006"}