{"auto_keywords": [{"score": 0.039282223508626896, "phrase": "divisible_and_indivisible_real-time_tasks"}, {"score": 0.034474914297590295, "phrase": "divisible_tasks"}, {"score": 0.00481495049065317, "phrase": "dynamic_scheduling_of_hybrid"}, {"score": 0.004787966206092959, "phrase": "real-time_tasks"}, {"score": 0.004425616928975799, "phrase": "key_issue"}, {"score": 0.004207230913063179, "phrase": "real-time_task_scheduling"}, {"score": 0.003932654396285872, "phrase": "scheduling_problem"}, {"score": 0.003303177222901723, "phrase": "single_processor"}, {"score": 0.003104849179057156, "phrase": "underlying_data_parallelism"}, {"score": 0.002727700630869639, "phrase": "hlpps"}, {"score": 0.002506715532901322, "phrase": "indivisible_tasks"}, {"score": 0.0024370965602952496, "phrase": "overall_performance"}, {"score": 0.0021896891011033105, "phrase": "extensive_performance_evaluation_studies"}, {"score": 0.0021049977753042253, "phrase": "proposed_algorithm"}], "paper_keywords": ["Cluster computing", " divisible loads", " independent tasks", " parallel processing", " real-time scheduling"], "paper_abstract": "The scheduling of tasks with deadlines on clusters is a key issue for offering quality-of-service (QoS) assurance. A critical challenge in real-time task scheduling is to handle various types of applications. This paper investigates the scheduling problem for processing a set of tasks comprising both divisible and indivisible real-time tasks on cluster systems. Indivisible tasks are characterized by the property that they need to be processed on their entirety on a single processor while divisible tasks can be distributed across several processing nodes by exploiting the underlying data parallelism. We propose a dynamic (on-line) real-time scheduling algorithm referred to as Hybrid Loads Push-Pull Scheduling (HLPPS) algorithm for handling a set of tasks comprising both divisible and indivisible real-time tasks on cluster systems. HLPPS is shown to efficiently exploit the parallelism in divisible tasks without undermining the schedulability of indivisible tasks and thereby optimize the overall performance. We consider two distinct network platforms - tightly coupled and loosely coupled clusters in designing the strategy. We conduct extensive performance evaluation studies to quantify the performance of the proposed algorithm under a variety of scenarios.", "paper_title": "Dynamic Scheduling of Hybrid Real-Time Tasks on Clusters", "paper_id": "WOS:000344990300008"}