{"auto_keywords": [{"score": 0.048539652036902976, "phrase": "web_collage"}, {"score": 0.013065930690017321, "phrase": "cscl_scripts"}, {"score": 0.008713768692145006, "phrase": "assessment_design"}, {"score": 0.004770211811866158, "phrase": "cscl_macro-scripts"}, {"score": 0.004304574865291508, "phrase": "computer-supported_collaborative_learning"}, {"score": 0.004032118497047498, "phrase": "crucial_aspect"}, {"score": 0.003689628075766217, "phrase": "computational_representation"}, {"score": 0.0034398445347109396, "phrase": "compliant_learning_platforms"}, {"score": 0.0033447157263095223, "phrase": "design_process"}, {"score": 0.0031036643805367487, "phrase": "learning_and_assessment_aspects"}, {"score": 0.002893434697072309, "phrase": "widely_accepted_assessment_techniques"}, {"score": 0.002787181295054319, "phrase": "assessment_design_patterns"}, {"score": 0.002538263784314365, "phrase": "non-expert_practitioners"}, {"score": 0.00246800641971897, "phrase": "cscl_research_community"}, {"score": 0.00237733844863506, "phrase": "script_designers"}, {"score": 0.002226592967032469, "phrase": "non-expert_users"}, {"score": 0.0021649437083408425, "phrase": "new_research_and_development_lines"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["CSCL script", " Assessment design", " IMS-LD", " Software authoring tool"], "paper_abstract": "This paper presents Web Collage, an authoring tool developed to aid non-expert learning designers in the definition of assessments within Computer-Supported Collaborative Learning (CSCL) scripts. Web Collage fosters the consideration of assessments as a crucial aspect of CSCL scripts and tries to overcome the difficulties in their selection and configuration. Additionally, Web Collage supports the computational representation of CSCL scripts using the IMS Learning Design standard thus enabling the deployment and enactment of such scripts in compliant learning platforms. The paper describes the design process that Web Collage promotes, as well as the way the tool supports the interrelation of learning and assessment aspects of a script. Designers are also aided in the selection and application of widely accepted assessment techniques, by means of the application of assessment design patterns. The support of Web Collage to the design of CSCL scripts with assessments was evaluated in two studies, in which non-expert practitioners and experts drawn from the CSCL research community, respectively, assumed the role of script designers. The results indicate that the Web Collage successfully supports the task of assessment design for non-expert users, while they point out new research and development lines. (C) 2013 Elsevier Ltd. All rights reserved.", "paper_title": "Web Collage: An implementation of support for assessment design in CSCL macro-scripts", "paper_id": "WOS:000320430500008"}