{"auto_keywords": [{"score": 0.035148719522178754, "phrase": "potential_forms"}, {"score": 0.015171369533951073, "phrase": "stress_form"}, {"score": 0.008559388843185136, "phrase": "fluid-fluid_interface"}, {"score": 0.008052160668164493, "phrase": "traction_boundary_conditions"}, {"score": 0.007125462486349993, "phrase": "chemical_potential"}, {"score": 0.005776701350313029, "phrase": "particle_boundary"}, {"score": 0.00481495049065317, "phrase": "stokes-cahn-hilliard"}, {"score": 0.004676414661927138, "phrase": "suspended_rigid_particles"}, {"score": 0.00447601516255334, "phrase": "two-phase_flows"}, {"score": 0.004424034641288626, "phrase": "sal_framework"}, {"score": 0.004041046382656947, "phrase": "sharp_boundary"}, {"score": 0.0035952667506642033, "phrase": "retracting_droplet"}, {"score": 0.0031063318586138787, "phrase": "higher_parasitic_currents"}, {"score": 0.002929855464610305, "phrase": "higher_peaks"}, {"score": 0.0028040908178009263, "phrase": "stationary_droplet"}, {"score": 0.0027795914404096754, "phrase": "long_period"}, {"score": 0.0026837101137439207, "phrase": "cahn-hilliard_fluid"}, {"score": 0.002560980198416571, "phrase": "additional_integral_term"}, {"score": 0.002394299529213776, "phrase": "velocity_field"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Cahn-Hilliard", " Diffuse-interface", " Finite element method", " Suspended particles", " Simulations"], "paper_abstract": "Three formulations of the Stokes-Cahn-Hilliard (SCH) system are investigated for the simulation of rigid particles in two-phase flows. Using the Sal framework, we assume that the interface between the two fluids is diffuse, whereas the interface between the fluids and the particle is assumed to be sharp. To describe the sharp boundary of the particle, a moving, boundary-fitted mesh is used which is refined near the fluid-fluid interface. The three formulations, the \"stress form\" and two \"potential forms\", are first investigated in the absence of traction boundary conditions, by simulating a retracting droplet in a closed, cylindrical container. We show that the three formulations perform similar in terms of accuracy, although the velocity is slightly more accurate for the potential forms. When investigating mesh-convergence, superconvergence of the velocity and chemical potential is observed in the three forms. In equilibrium, the stress form shows higher parasitic currents near the interface. When comparing the pressure as it is defined in the stress form, the potential forms show higher peaks in the pressure near the interface. The three methods are stable when simulating a stationary droplet for a long period of time. We proceed by simulating a suspended rigid, spherical particle in the Cahn-Hilliard fluid, where a traction boundary conditions is applied to the particle boundary. For the potential forms, an additional integral term arises on the particle boundary. When investigating mesh-convergence, we observe superconvergence of the location and velocity of the particle, the velocity field and the chemical potential if the stress form is used. However, subconvergence is observed for these variables when using the potential forms. The three methods are stable when simulating a particle that is captured at a fluid-fluid interface for a long period of time. (C) 2015 Elsevier Ltd. All rights reserved.", "paper_title": "Stokes-Cahn-Hilliard formulations and simulations of two-phase flows with suspended rigid particles", "paper_id": "WOS:000352051000001"}