{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "learning_management_system"}, {"score": 0.04497972432687123, "phrase": "survey_data"}, {"score": 0.03768809919116057, "phrase": "continuance_intention"}, {"score": 0.0046857508651690916, "phrase": "purpose_-_the_purpose"}, {"score": 0.004188287972391714, "phrase": "finnish_university"}, {"score": 0.0041316803676012155, "phrase": "popular_lms"}, {"score": 0.00395291546135423, "phrase": "two-phase_strategy"}, {"score": 0.003899476621346112, "phrase": "first_phase"}, {"score": 0.003743439610143464, "phrase": "result_demonstrability"}, {"score": 0.003426373820419672, "phrase": "second_phase"}, {"score": 0.003403122817578447, "phrase": "partial_least_squares"}, {"score": 0.0033229756875116597, "phrase": "path_values"}, {"score": 0.0032008144731234265, "phrase": "relevant_variables"}, {"score": 0.003062201383165999, "phrase": "higher_positive_perceptions"}, {"score": 0.0028998244529699255, "phrase": "lms"}, {"score": 0.002841124508908794, "phrase": "pls_analysis"}, {"score": 0.002755338691613447, "phrase": "students'_satisfaction"}, {"score": 0.002565084553019013, "phrase": "students'_continuance_intention"}, {"score": 0.002331641523873951, "phrase": "prior_research"}, {"score": 0.0021049977753042253, "phrase": "customized_intervention_plan"}], "paper_keywords": ["Satisfaction", " Learning management systems", " Continuance", " E-learning", " Ease of use", " Usefulness"], "paper_abstract": "Purpose - The purpose of this paper is to compare the perceptions of educators and students with a learning management system (LMS). The comparison is based on survey data collected from 185 educators and 249 students in a Finnish university who use a popular LMS, Moodle. Design/methodology/approach - The analysis of the survey data follows a two-phase strategy. In the first phase, perceptions of educators and students regarding ease of use, result demonstrability, usefulness, access, reliability, compatibility, satisfaction, and continuance intention were compared using one way analysis of variance (ANOVA). In the second phase, partial least squares (PLS) technique is employed to compare the path values and explained variances of satisfaction, and continuance intention by putting relevant variables as predictors. Findings - The ANOVA results suggest that students have higher positive perceptions regarding ease of use, usefulness, access, reliability, and compatibility of the LMS than the educators. The PLS analysis results revealed that the amount of variance of students' satisfaction explained by its predictors was 9 percentage points lower than that of educators. It also revealed that the variance of students' continuance intention explained by satisfaction and usefulness was 12 percentage points lower than that of educators. Practical implications - The study concludes with both theoretical and managerial implications. Originality/value - While prior research has investigated either educators' or students' perspective, the authors have investigated both and presented a comparison. The authors have reported several differences that help practitioners make customized intervention plan.", "paper_title": "Satisfaction and continuance with a learning management system Comparing perceptions of educators and students", "paper_id": "WOS:000355669200003"}