{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "intelligent"}, {"score": 0.004614643339546038, "phrase": "constructive_uses"}, {"score": 0.004571269461883144, "phrase": "citation_networks"}, {"score": 0.004360412703519539, "phrase": "scientific_publications"}, {"score": 0.004139639802595566, "phrase": "existing_proposals"}, {"score": 0.00406214911915987, "phrase": "fundamental_aspect"}, {"score": 0.0038746849003761024, "phrase": "active_and_constructive_exploration"}, {"score": 0.0036610702290043387, "phrase": "new_method"}, {"score": 0.0035587046945919788, "phrase": "data_mining"}, {"score": 0.003459191419478298, "phrase": "typical_search"}, {"score": 0.0028766278519176355, "phrase": "domain_model"}, {"score": 0.002679585860537941, "phrase": "clustering_solution"}, {"score": 0.002507845411496512, "phrase": "integrated_authoring_system"}, {"score": 0.0022706045233150795, "phrase": "interactive_and_constructive_approach"}, {"score": 0.0021656385587456952, "phrase": "identifiable_sub-topics"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["[H.2.8] Database management - database applications - data mining", " [H.3.7] information storage and retrieval - digital", " libraries - user issues", " [H.3.3] Information storage and retrieval - information", " search and retrieval -search process, information filtering", " [H.3.5] Information storage and retrieval - online information services - Web-based services", " [K.3.2] Computers and education - computer and information science education - literacy", " Citation analysis"], "paper_abstract": "Many powerful methods and tools exist for extracting meaning from scientific publications, their texts, and their citation links. However, existing proposals often neglect a fundamental aspect of learning: that understanding and learning require an active and constructive exploration of a domain. In this paper, we describe a new method and a tool that use data mining and interactivity to turn the typical search and retrieve dialogue, in which the user asks questions and a system gives answers, into a dialogue that also involves sense-making, in which the user has to become active by constructing a bibliography and a domain model of the search term(s). This model starts from an automatically generated and annotated clustering solution that is iteratively modified by users. The tool is part of an integrated authoring system covering all phases from search through reading and sense-making to writing. Two evaluation studies demonstrate the usability of this interactive and constructive approach, and they show that clusters and groups represent identifiable sub-topics. (C) 2009 Elsevier Ltd. All rights reserved.", "paper_title": "Intelligent scientific authoring tools: Interactive data mining for constructive uses of citation networks", "paper_id": "WOS:000271709400001"}