{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "bounded_and_noisy_leakage._physical_computational_devices"}, {"score": 0.004577777897335174, "phrase": "secret_internal_states"}, {"score": 0.004495922204117959, "phrase": "general_transformation"}, {"score": 0.004274396662662802, "phrase": "well-defined_classes"}, {"score": 0.003891430578662587, "phrase": "arbitrarily_complex_circuits"}, {"score": 0.0036333693364337953, "phrase": "powerful_observer"}, {"score": 0.0035426543993952184, "phrase": "limited_measurement_apparatus"}, {"score": 0.00333163309034114, "phrase": "leak-proof_component"}, {"score": 0.0032484270911235526, "phrase": "leaked_information"}, {"score": 0.0030219357765636497, "phrase": "output_bits"}, {"score": 0.00260566789186855, "phrase": "unbounded_fan"}, {"score": 0.0024950272594582673, "phrase": "leakage_function"}, {"score": 0.0024503217593801587, "phrase": "internal_state"}, {"score": 0.002354762471810519, "phrase": "independent_binomial_noise-i.e"}, {"score": 0.0022547515816852266, "phrase": "number_p"}, {"score": 0.0021049977753042253, "phrase": "probability_p"}], "paper_keywords": ["side channel attacks", " leakage resilience", " models"], "paper_abstract": "Physical computational devices leak side-channel information that may, and often does, reveal secret internal states. We present a general transformation that compiles any circuit into a circuit with the same functionality but resilience against well-defined classes of leakage. Our construction requires a small, stateless, and computation-independent leak-proof component that draws random elements from a fixed distribution. In essence, we reduce the problem of shielding arbitrarily complex circuits to the problem of shielding a single, simple component. Our approach is based on modeling the adversary as a powerful observer that inspects the device via a limited measurement apparatus. We allow the apparatus to access all the bits of the computation (except those inside the leak-proof component), and the amount of leaked information to grow unbounded over time. However, we assume that the apparatus is limited in the amount of output bits per iteration and the ability to decode certain linear encodings. While our results apply in general to such leakage classes, in particular, we obtain security against (a) constant-depth circuits leakage, where the leakage function is computed by an AC(0) circuit (composed of NOT gates and unbounded fan-in AND and OR gates); (b) noisy leakage, where the leakage function reveals all the bits of the internal state of the circuit, but each bit is perturbed by independent binomial noise-i.e., flipped with some probability p. Namely, for some number p is an element of (0, 1/2], each bit of the computation is flipped with probability p, and remains unchanged with probability 1 - p.", "paper_title": "PROTECTING CIRCUITS FROM COMPUTATIONALLY BOUNDED AND NOISY LEAKAGE", "paper_id": "WOS:000344753500003"}