{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "information_retrieval"}, {"score": 0.047844536713056586, "phrase": "returned_documents"}, {"score": 0.004418287966422041, "phrase": "information_retrieval_system"}, {"score": 0.004313996835376177, "phrase": "user's_query"}, {"score": 0.0037556843869894566, "phrase": "asked_topic"}, {"score": 0.003580355398511932, "phrase": "automatic_extraction"}, {"score": 0.0033969001271637934, "phrase": "synthetic_documents"}, {"score": 0.0029996699429582835, "phrase": "composite_documents"}, {"score": 0.002791932344920906, "phrase": "relevant_information"}, {"score": 0.0025861368747446324, "phrase": "combinatorial_cost"}, {"score": 0.002549269480908849, "phrase": "recomposition_process"}, {"score": 0.002488985155689794, "phrase": "genetic_algorithm"}, {"score": 0.002372649454733249, "phrase": "satisfaction_criterion"}, {"score": 0.002166349705365602, "phrase": "first_experimental_results"}, {"score": 0.0021049977753042253, "phrase": "preliminary_work"}], "paper_keywords": [""], "paper_abstract": "One critical step in information retrieval is the skimming of the returned documents, considered as globally relevant by an Information retrieval system as responses to a user's query. This skimming has generally to be done in order to find the parts of the returned documents which contain the information satisfying the user's information need. This task may be particularly heavy when only small parts of the returned documents are related to the asked topic. Therefore, our proposition here is to substitute an automatic extraction and recomposition process in order to provide the user with synthetic documents, called here composite documents, made of parts of documents extracted from the set of documents returned as responses to a query. The composite documents are built in such a way that they summarize as concisely as possible the various aspects of relevant information for the query and which are initially scattered among the returned documents. Due to the combinatorial cost of the recomposition process, we use a genetic algorithm whose individuals are texts and that aims at optimizing a satisfaction criterion based on similarity. We have implemented several variants of the algorithm and we proposed an analysis of the first experimental results which seems promising for a preliminary work.", "paper_title": "An evolutionary approach in information retrieval", "paper_id": "WOS:000238389200077"}