{"auto_keywords": [{"score": 0.04910527144315707, "phrase": "tumor_growth_kinetics"}, {"score": 0.010203431785620684, "phrase": "applied_electric_field"}, {"score": 0.00481495049065317, "phrase": "electrode_array_parameters"}, {"score": 0.004186799638538032, "phrase": "effective_tumor_destruction"}, {"score": 0.0036553070575015344, "phrase": "point-point_electrode_configuration"}, {"score": 0.0035661605757956096, "phrase": "modified_gompertz_equation"}, {"score": 0.003479180627368156, "phrase": "good_agreement"}, {"score": 0.0032174507570710835, "phrase": "critical_distance"}, {"score": 0.0031518989079229714, "phrase": "threshold_ratio"}, {"score": 0.0029631248341951064, "phrase": "higher_electrotherapy_antitumor_effectiveness"}, {"score": 0.002878930338561009, "phrase": "electrotherapy_antitumor_effectiveness"}, {"score": 0.002285839246740627, "phrase": "malignant_solid_tumors"}, {"score": 0.0022117133940361025, "phrase": "current_clinical_trial"}, {"score": 0.002139986159978777, "phrase": "elsevier_b.v."}, {"score": 0.00210499793205176, "phrase": "imacs."}], "paper_keywords": ["Electrotherapy", " Electric field", " Tumor", " Mathematical modeling"], "paper_abstract": "Evaluation of the distance between the electrodes, voltage applied to them, and number of electrodes in tumor growth kinetics is very useful for effective tumor destruction when electrotherapy is used. However, a study of this type has not yet been proposed. The aim of this paper is to simulate the influence of such parameters and the point-point electrode configuration on the tumor growth kinetics through a Modified Gompertz Equation. The results show a good agreement between the simulations performed in this study and the experimental results reported by our group and other authors. A critical distance between electrodes and a threshold ratio between the applied electric field and that distributed in the tumor are revealed, for which higher electrotherapy antitumor effectiveness is reached. In conclusion, electrotherapy antitumor effectiveness not only depends on the distance between the electrodes, voltage applied to them, and number of electrodes, but also on the ratio between the applied electric field and that distributed in the tumor. In addition, the results of these simulations may be used to help physicians choose the most appropriate treatment for patients with malignant solid tumors, as we have implemented in a current clinical trial. (C) 2012 Published by Elsevier B.V. on behalf of IMACS.", "paper_title": "Influence of electrode array parameters used in electrotherapy on tumor growth kinetics: A mathematical simulation", "paper_id": "WOS:000304430000002"}