{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "conceptualizing_information_technology"}, {"score": 0.004695303774351139, "phrase": "social_roles"}, {"score": 0.004559451202070545, "phrase": "people's_interactions"}, {"score": 0.0045213598841171935, "phrase": "information_technologies"}, {"score": 0.0044275118637330975, "phrase": "new_constructs"}, {"score": 0.0042455945330942746, "phrase": "human_behavior"}, {"score": 0.00403709306806495, "phrase": "structural_symbolic_interactionist_identity_theories"}, {"score": 0.003953256858638655, "phrase": "conceptual_definition"}, {"score": 0.0035001037990786727, "phrase": "new_form"}, {"score": 0.0033561632967173856, "phrase": "theoretical_model"}, {"score": 0.0031912018800904314, "phrase": "important_and_relevant_construct"}, {"score": 0.00284899583294417, "phrase": "current_understanding"}, {"score": 0.002630364569659531, "phrase": "conceptual_domain"}, {"score": 0.002500987934534128, "phrase": "construct's_theoretical_influence"}, {"score": 0.0023779596230982234, "phrase": "wide_range"}, {"score": 0.0021770116505684394, "phrase": "potential_directions"}, {"score": 0.0021049977753042253, "phrase": "novel_concept"}], "paper_keywords": ["IT identity", " human behavior", " individual IT use", " IT embeddedness", " theory development"], "paper_abstract": "As social roles and relationships become increasingly inseparable from people's interactions with information technologies (ITs), new constructs representing this intertwinement are needed to expand understandings of human behavior. As part of that endeavor, this paper draws on structural symbolic interactionist identity theories to systematically develop a conceptual definition of one such construct, IT identity-defined as the extent to which an individual views use of an IT as integral to his or her sense of self-as a new form of identity. The construct is framed within a theoretical model. Our goal is to facilitate the establishment of IT identity as an important and relevant construct that can improve our understanding of a variety of phenomena. In doing so, this paper makes three contributions to the information systems (IS) literature. First, it delineates current understanding of IT as a medium, determinant, or consequent of identity. Second, it defines the conceptual domain and theme of IT identity, which is necessary for investigating the construct's theoretical influence. Third, it demonstrates the utility of IT identity to a wide range of IS topics relating to how people express, maintain, and expand their self-concepts. In doing so, it offers potential directions and opportunities for IS researchers to incorporate this novel concept into IS research.", "paper_title": "ME, MY SELF, AND I(T): CONCEPTUALIZING INFORMATION TECHNOLOGY IDENTITY AND ITS IMPLICATIONS", "paper_id": "WOS:000368424000010"}