{"auto_keywords": [{"score": 0.01505400058510693, "phrase": "probabilistic_automata"}, {"score": 0.00826182784818475, "phrase": "finite_words"}, {"score": 0.0052112541234098, "phrase": "saturation_algorithm"}, {"score": 0.004768378525561471, "phrase": "probabilistic_leaktight_automata."}, {"score": 0.004653900688892822, "phrase": "decision_problem"}, {"score": 0.004476399615305783, "phrase": "probabilistic_automaton"}, {"score": 0.003906586074865932, "phrase": "different_nature"}, {"score": 0.003527181559366122, "phrase": "class_probabilistic"}, {"score": 0.0031231012822640672, "phrase": "leaktight_automata"}, {"score": 0.0026337482179592422, "phrase": "algebraic_techniques"}, {"score": 0.00259556321744556, "phrase": "simon"}, {"score": 0.0021780349459687622, "phrase": "infinite_ones"}, {"score": 0.0021049977753042253, "phrase": "probabilistic_leaktight_parity_automata"}], "paper_keywords": ["Probabilistic automata", " Value 1 problem", " Algebraic Techniques in Automata Theory"], "paper_abstract": "The value 1 problem is a decision problem for probabilistic automata over finite words: given a probabilistic automaton, are there words accepted with probability arbitrarily close to 1? This problem was proved undecidable recently; to overcome this, several classes of probabilistic automata of different nature were proposed, for which the value 1 problem has been shown decidable. In this paper, we introduce yet another class probabilistic at called leaktight automata, which strictly subsumes all classes of probabilistic automata whose value 1 problem is known to be decidable. We prove that for leaktight automata, the value 1 problem is decidable (in fact, PSPACE-complete) by constructing a saturation algorithm based on the computation of a monoid abstracting the behaviours of the automaton. We rely on algebraic techniques developed by Simon to prove that this abstraction is complete. Furthermore, we adapt this saturation algorithm to decide whether an automaton is leaktight. Finally, we show a reduction allowing to extend our decidability results from finite words to infinite ones, implying that the value 1 problem for probabilistic leaktight parity automata is decidable.", "paper_title": "DECIDING THE VALUE 1 PROBLEM FOR PROBABILISTIC LEAKTIGHT AUTOMATA", "paper_id": "WOS:000359470700015"}