{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "mobile_gpus"}, {"score": 0.044090548582325764, "phrase": "energy_consumption"}, {"score": 0.029730252827129156, "phrase": "current_application"}, {"score": 0.027480930823813896, "phrase": "proposed_ehps_framework"}, {"score": 0.004718897469501381, "phrase": "mobile_devices"}, {"score": 0.00418134346679498, "phrase": "user_experience"}, {"score": 0.0041144374213500715, "phrase": "important_issue"}, {"score": 0.004081385289516914, "phrase": "conventional_mechanisms"}, {"score": 0.003749908582313067, "phrase": "mobile_gpu."}, {"score": 0.003675023529026644, "phrase": "narrower_numerical_range"}, {"score": 0.003431384878608803, "phrase": "precision_floating-point"}, {"score": 0.003390092184270794, "phrase": "wider_numerical_range"}, {"score": 0.0031271827534050493, "phrase": "profile-based_precision_selection_mechanism"}, {"score": 0.003003452468800793, "phrase": "built-in_energy_model"}, {"score": 0.0024149629835339926, "phrase": "low_and_high-quality_modes"}, {"score": 0.0023666732429695908, "phrase": "average_psnrs"}, {"score": 0.0023381630439887184, "phrase": "resulting_images"}, {"score": 0.0022006705963260433, "phrase": "better_image_quality"}, {"score": 0.0021566565951738658, "phrase": "related_works"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Precision selection", " Energy-aware rendering", " Graphics hardware", " Mobile devices"], "paper_abstract": "As 3D applications in mobile devices have become increasingly popular, mobile GPUs have become one of their most essential components. Because the lifetime of these devices is generally battery-limited, the tradeoff between energy consumption and user experience has become an important issue. Conventional mechanisms include the use of fixed-point and reducing the precision of floating-point to reduce the energy consumption of the shader in a mobile GPU. A fixed-point has a narrower numerical range than a floating-point, but is faster and more energy-efficient. However, reduced precision floating-point has a wider numerical range but consumes more energy. In this work, an Energy-aware Hybrid Precision Selection (EHPS) framework is proposed to integrate the above mechanisms with a profile-based precision selection mechanism to maximize energy savings. In addition, a built-in energy model is used to evaluate whether fixed-point or reduced floating-point is more energy-efficient for the current application. The more energy-efficient option will be used to render the current application to save more energy. The results reveal that the proposed EHPS framework reduces the energy consumed by the shader by an average of 33.66% and 31.63% in the low and high-quality modes, respectively. The average PSNRs of the resulting images are 26.89 dB and 45.94 dB in these two rendering modes, respectively. The proposed EHPS framework yields a better image quality and uses less energy than related works. (C) 2013 Elsevier Ltd. All rights reserved.", "paper_title": "Energy-aware hybrid precision selection framework for mobile GPUs", "paper_id": "WOS:000321532100013"}