{"auto_keywords": [{"score": 0.03607022877434213, "phrase": "'total'_aspects"}, {"score": 0.00481495049065317, "phrase": "interface_design_methods"}, {"score": 0.004444921827311577, "phrase": "human-computer_interface"}, {"score": 0.004191690483929023, "phrase": "different_views"}, {"score": 0.003931798194574009, "phrase": "different_aspects"}, {"score": 0.003668333531296882, "phrase": "effective_judgment"}, {"score": 0.00294728578311218, "phrase": "hci"}, {"score": 0.002592693161475495, "phrase": "judgment_process"}, {"score": 0.0024975317529314033, "phrase": "hci."}, {"score": 0.002256435842862802, "phrase": "total_interface_design_framework"}, {"score": 0.0022087165619569006, "phrase": "different_hci_approaches"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["human-computer interface", " total interface design", " interface design principle"], "paper_abstract": "There have been many debates on how to design the human-computer interface (HCI). Often. one can find that different views in a debate are simply because these views are attached to different aspects which embody the same thing. In other words, prior to giving an effective judgment of a debate, one needs to establish an understanding of the 'total' aspects of a thing the debate is about. Following this line of thinking, in this paper, we propose an understanding of the 'total' aspects of designing HCI, which is called the total interface design framework. We then judge several debates under this framework with the purpose of exemplifying the judgment process for any other debate related to designing HCI. At the end, the debates used for exemplifying our judgment process can be resolved. The effectiveness of the total interface design framework for integrating the different HCI approaches is also demonstrated. (c) 2005 Elsevier B.V. All rights reserved.", "paper_title": "On integration of interface design methods: Can debates be resolved?", "paper_id": "WOS:000238876500009"}