{"auto_keywords": [{"score": 0.04959024199151092, "phrase": "donsker_classes"}, {"score": 0.023629256347593466, "phrase": "expected_errors"}, {"score": 0.00481495049065317, "phrase": "empirical_risk_minimization"}, {"score": 0.004645057834614705, "phrase": "stability_properties"}, {"score": 0.0038217146888983576, "phrase": "empirical_error"}, {"score": 0.0034308688638878286, "phrase": "multiple_minimizers"}, {"score": 0.0033957904376127187, "phrase": "expected_error"}, {"score": 0.0030017207229983385, "phrase": "training_set"}, {"score": 0.0029255474957478474, "phrase": "large_jump"}, {"score": 0.0028807718824400697, "phrase": "new_hypothesis"}, {"score": 0.0026126405272417783, "phrase": "komlos-major-tusnady_type"}, {"score": 0.002546315584783112, "phrase": "power_rate"}, {"score": 0.0023331227492950422, "phrase": "uniform_ratio_limit_inequality"}], "paper_keywords": ["empirical risk minimization", " empirical processes", " stability", " Donsker classes"], "paper_abstract": "We study some stability properties of algorithms which minimize (or almost-minimize) empirical error over Donsker classes of functions. We show that, as the number n of samples grows, the L-2-diameter of the set of almost-minimizers of empirical error with tolerance xi(n) = o(n(-1/2)) converges to zero in probability. Hence, even in the case of multiple minimizers of expected error, as n increases it becomes less and less likely that adding a sample (or a number of samples) to the training set will result in a large jump to a new hypothesis. Moreover, under some assumptions on the entropy of the class, along with an assumption of Komlos-Major-Tusnady type, we derive a power rate of decay for the diameter of almost-minimizers. This rate, through an application of a uniform ratio limit inequality, is shown to govern the closeness of the expected errors of the almost-minimizers. In fact, under the above assumptions, the expected errors of almost-minimizers become closer with a rate strictly faster than n(-1/2).", "paper_title": "Stability properties of empirical risk minimization over Donsker classes", "paper_id": "WOS:000245390800001"}