{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "para-textual_factors"}, {"score": 0.004552648949390462, "phrase": "citation_windows"}, {"score": 0.004447600571127578, "phrase": "annual_citation"}, {"score": 0.004406260054779782, "phrase": "cumulative_citations"}, {"score": 0.00436530211426514, "phrase": "dependent_variables"}, {"score": 0.004108161406159407, "phrase": "bibliometric_variables"}, {"score": 0.003604421041893448, "phrase": "larger_influence"}, {"score": 0.0035542408902458677, "phrase": "citation_impact"}, {"score": 0.0030319482153908037, "phrase": "jif_peaks"}, {"score": 0.002787181295054319, "phrase": "quality_judgments"}, {"score": 0.0026105159490849364, "phrase": "algorithmically_based_indicators"}, {"score": 0.0025741370320813968, "phrase": "qualitative_judgments"}, {"score": 0.002456486927713543, "phrase": "future_citation"}, {"score": 0.0023996890513009743, "phrase": "algorithmic_constructs"}, {"score": 0.0022793032191981404, "phrase": "empirical_specification"}, {"score": 0.002185301851004467, "phrase": "constructivist_theory"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Citation impact", " F1000", " Web of Science", " Prediction"], "paper_abstract": "Using (binomial) regression analysis, we run models using citation windows of one to ten years with both annual citation and cumulative citations as dependent variables, and with both bibliometric and quality indicators (judgments of peers) as independent variables. The bibliometric variables are the Journal Impact Factor (JIF) of the publication medium, the numbers of authors and pages, and the statistical citedness of the references used within the paper. We find that the JIF has a larger influence on the citation impact of a publication than the quality (measured by judgments of peers). However, the number of pages and the quality of the references are less influential. The influence of JIF peaks after three years and then declines (in most regression analyses), but remains higher than the influence of quality judgments even after ten years. These results call into question a discrepancy between the algorithmically based indicators and the qualitative judgments by experts. The latter seems less predictive for future citation than a combination of algorithmic constructs. The results of this study can contribute to the empirical specification of the relevance of a normative versus a constructivist theory of citation. (C) 2015 Elsevier Ltd. All rights reserved.", "paper_title": "Does quality and content matter for citedness? A comparison with para-textual factors and over time", "paper_id": "WOS:000360907400001"}