{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "local_coherence"}, {"score": 0.004773904938276846, "phrase": "genetic_interaction_patterns"}, {"score": 0.00473320761888448, "phrase": "prevalent_functional_versatility"}, {"score": 0.004162602203448056, "phrase": "functional_relationships"}, {"score": 0.004039639718055365, "phrase": "epistatic_miniarray_profiles"}, {"score": 0.00385368199735867, "phrase": "powerful_approach"}, {"score": 0.0037398106866046972, "phrase": "e-map_data_analysis"}, {"score": 0.003629291866667764, "phrase": "partition_genes"}, {"score": 0.0034179225740833055, "phrase": "resulting_descriptions"}, {"score": 0.003274499008699115, "phrase": "multifunctional_roles"}, {"score": 0.0031102878400698143, "phrase": "original_local_coherence_detection"}, {"score": 0.0029925402963843282, "phrase": "functionally_related_genes"}, {"score": 0.00296698375549856, "phrase": "e-map_data"}, {"score": 0.0028916124463906983, "phrase": "individual_genes"}, {"score": 0.0027465495490291746, "phrase": "pleiotropic_nature"}, {"score": 0.0027230880516264685, "phrase": "gene_function"}, {"score": 0.0024884913795612707, "phrase": "silico_dataset"}, {"score": 0.0024566655761509276, "phrase": "yeast_saccharomyces_cerevisiae"}, {"score": 0.002353483216544667, "phrase": "functional_modules"}, {"score": 0.0021692000054033956, "phrase": "valuable_tool"}, {"score": 0.0021414489155042885, "phrase": "new_roles"}, {"score": 0.0021049977753042253, "phrase": "annotated_functions"}], "paper_keywords": [""], "paper_abstract": "Motivation: Epistatic or genetic interactions, representing the effects of mutating one gene on the phenotypes caused by mutations in one or moredistinct genes, can be very helpful for uncovering functional relationships between genes. Recently, the epistatic miniarray profiles (E-MAP) method has emerged as a powerful approach for identifying such interactions systematically. For E-MAP data analysis, hierarchical clustering is used to partition genes into groups on the basis of the similarity between their global interaction profiles, and the resulting descriptions assign each gene to only one group, thereby ignoring the multifunctional roles played by most genes. Results: Here, we present the original local coherence detection (LCD) algorithm for identifying groups of functionally related genes from E-MAP data in a manner that allows individual genes to be assigned to more than one functional group. This enables investigation of the pleiotropic nature of gene function. The performance of our algorithm is illustrated by applying it to two E-MAP datasets and an E-MAP-like in silico dataset for the yeast Saccharomyces cerevisiae. In addition to recapitulating the majority of the functional modules and many protein complexes reported previously, our algorithm uncovers many recently documented and novel multifunctional relationships between genes and gene groups. Our algorithm hence represents a valuable tool for uncovering new roles for genes with annotated functions and for mapping groups of genes and proteins into pathways.", "paper_title": "Local coherence in genetic interaction patterns reveals prevalent functional versatility", "paper_id": "WOS:000259973500016"}