{"auto_keywords": [{"score": 0.04274518365190484, "phrase": "cloud_providers"}, {"score": 0.03363896917055258, "phrase": "trustworthy_cloud_providers"}, {"score": 0.03202831374286256, "phrase": "related_approaches"}, {"score": 0.02618294532669312, "phrase": "trust_information"}, {"score": 0.00481495049065317, "phrase": "trust_management_system"}, {"score": 0.0047709540557306284, "phrase": "cloud_computing_marketplaces"}, {"score": 0.0047057084749407485, "phrase": "caiq"}, {"score": 0.004641351004344458, "phrase": "trust_information_source"}, {"score": 0.004598933498016774, "phrase": "cloud_computing"}, {"score": 0.004556901872357751, "phrase": "information_technology_related_services"}, {"score": 0.003916098498242888, "phrase": "service_level_agreements"}, {"score": 0.003809628721278519, "phrase": "different_providers"}, {"score": 0.0037747835341722636, "phrase": "similar_functionality"}, {"score": 0.00338060449446278, "phrase": "trustworthy_cloud_provider"}, {"score": 0.0031121406603482112, "phrase": "multi-faceted_trust_management_system_architecture"}, {"score": 0.002851790448644913, "phrase": "different_attributes"}, {"score": 0.0026494723416072316, "phrase": "first_realization"}, {"score": 0.0023079225317714815, "phrase": "consensus_assessment_initiative_questionnaires"}, {"score": 0.0021739117830106365, "phrase": "real_datasets"}, {"score": 0.0021049977753042253, "phrase": "john_wiley"}], "paper_keywords": ["cloud computing", " trust models", " reputation", " trust management", " architecture", " CAIQ", " self-assessment"], "paper_abstract": "Cloud computing enables information technology related services in a more dynamic and scalable way than beforemore cost-effective than before due to the economy of scale and of sharing resources. Usually, cloud providers describe their promised behaviourregarding functional and non-functional aspects of the service provisionby way of service level agreements (SLAs). For different providers offering similar functionality, SLAs are often insufficiently claimable and inconsistent with the aspects considered important by customers. Therefore, customers face problems identifying a trustworthy cloud provider solely on the basis of its SLA. To support customers in reliably identifying trustworthy cloud providers, we propose a multi-faceted trust management system architecture for cloud computing marketplaces and related approaches. This system provides the means for identifying trustworthy cloud providers in terms of different attributes, for example, compliance, data governance and information security. In this article, we present the first realization of our proposed trust management system using the Consensus Assessment Initiative Questionnaire, initiated by the Cloud Security Alliance, as one of the sources of trust information. In particular, our proposed approach contributes to the challenge of extracting trust information from Consensus Assessment Initiative Questionnaires completed by cloud providers. Finally, our implemented system and related approaches are experimented using real datasets. Copyright (c) 2013 John Wiley & Sons, Ltd.", "paper_title": "Towards a trust management system for cloud computing marketplaces: using CAIQ as a trust information source", "paper_id": "WOS:000344322100043"}