{"auto_keywords": [{"score": 0.03754363682447158, "phrase": "discrete-time_channel"}, {"score": 0.0339990289226179, "phrase": "capacity_pre-log"}, {"score": 0.012110938328995879, "phrase": "symbol_rate"}, {"score": 0.00915467727477923, "phrase": "symbol_matched_filtering"}, {"score": 0.00481495049065317, "phrase": "noncoherent_rayleigh_fading_channels"}, {"score": 0.003981106369547929, "phrase": "common_approach"}, {"score": 0.0037684961730030235, "phrase": "matched_filtering"}, {"score": 0.0035153544006182834, "phrase": "transmitted_symbol"}, {"score": 0.0032676367070534635, "phrase": "snr"}, {"score": 0.002959617637433, "phrase": "covariance_matrix"}, {"score": 0.002927278301452369, "phrase": "discrete-time_channel_gains"}, {"score": 0.0027505663559338825, "phrase": "capacity-achieving_strategy"}, {"score": 0.002720505061804933, "phrase": "underlying_continuous-time_channel"}, {"score": 0.002575042977852052, "phrase": "continuous-time_channel_output"}, {"score": 0.0022158306933307685, "phrase": "symbol-rate_sampling"}, {"score": 0.0021049977753042253, "phrase": "high_snr."}], "paper_keywords": ["Fading channels", " noncoherent capacity", " oversampling"], "paper_abstract": "We analyze the capacity of a continuous-time, time-selective, Rayleigh block-fading channel in the high signal-to-noise ratio (SNR) regime. The fading process is assumed stationary within each block and to change independently from block to block; furthermore, its realizations are not known a priori to the transmitter and the receiver (noncoherent setting). A common approach to analyzing the capacity of this channel is to assume that the receiver performs matched filtering followed by sampling at symbol rate (symbol matched filtering). This yields a discrete-time channel in which each transmitted symbol corresponds to one output sample. Liang & Veeravalli (2004) showed that the capacity of this discrete-time channel grows logarithmically with the SNR, with a capacity pre-log equal to 1 - Q/N. Here, N is the number of symbols transmitted within one fading block, and Q is the rank of the covariance matrix of the discrete-time channel gains within each fading block. In this paper, we show that symbol matched filtering is not a capacity-achieving strategy for the underlying continuous-time channel. Specifically, we analyze the capacity pre-log of the discrete-time channel obtained by oversampling the continuous-time channel output, i.e., by sampling it faster than at symbol rate. We prove that by oversampling by a factor two one gets a capacity pre-log that is at least as large as 1 - 1/N. Since the capacity pre-log corresponding to symbol-rate sampling is 1 - Q/N, our result implies indeed that symbol matched filtering is not capacity achieving at high SNR.", "paper_title": "Oversampling Increases the Pre-Log of Noncoherent Rayleigh Fading Channels", "paper_id": "WOS:000342415600038"}