{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "-invariant_visual_navigation"}, {"score": 0.004491313367627919, "phrase": "lighting-invariant_exploration"}, {"score": 0.004375613460102577, "phrase": "appearance-based_approach"}, {"score": 0.0038568987435766014, "phrase": "raw_laser_intensity_data"}, {"score": 0.0038234714417849495, "phrase": "greyscale_camera-like_images"}, {"score": 0.0035974243349266894, "phrase": "novel_concept"}, {"score": 0.0035507457285983268, "phrase": "image_stack"}, {"score": 0.00321236577162671, "phrase": "keypoint_measurements"}, {"score": 0.0031845067058084583, "phrase": "measurement_uncertainties"}, {"score": 0.0030092017034068666, "phrase": "first_experiment"}, {"score": 0.002880927789104712, "phrase": "camera_and_laser_intensity_images"}, {"score": 0.002770150086489194, "phrase": "second_and_third_experiments"}, {"score": 0.0026986685585382347, "phrase": "real_data"}, {"score": 0.002516917671182532, "phrase": "teaching_phase"}, {"score": 0.0024306740161601625, "phrase": "repeating_phase"}, {"score": 0.002286781334850213, "phrase": "lighting_sensitivity"}, {"score": 0.0021607883988873492, "phrase": "appearance-based_visual_odometry_pipeline"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Appearance-based lidar", " Lighting-invariant visual odometry", " Visual teach and repeat"], "paper_abstract": "In an effort to facilitate lighting-invariant exploration, this paper presents an appearance-based approach using 3D scanning laser-rangefinders for two core visual navigation techniques: visual odometry (VO) and visual teach and repeat (VT&R). The key to our method is to convert raw laser intensity data into greyscale camera-like images, in order to apply sparse, appearance-based techniques traditionally used with camera imagery. The novel concept of an image stack is introduced, which is an array of azimuth, elevation, range, and intensity images that are used to generate keypoint measurements and measurement uncertainties. Using this technique, we present the following four experiments. In the first experiment, we explore the stability of a representative keypoint detection/description algorithm on camera and laser intensity images collected over a 24 h period outside. In the second and third experiments, we validate our VO algorithm using real data collected outdoors with two different 3D scanning laser-rangefinders. Lastly, our fourth experiment presents promising preliminary VT&R localization results, where the teaching phase was done during the day and the repeating phase was done at night. These experiments show that it possible to overcome lighting sensitivity encountered with cameras, yet continue to exploit the heritage of the appearance-based visual odometry pipeline. (c) 2013 Elsevier B.V. All rights reserved.", "paper_title": "Towards lighting-invariant visual navigation: An appearance-based approach using scanning laser-rangefinders", "paper_id": "WOS:000321410800010"}