{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "time_windows"}, {"score": 0.031722889379699325, "phrase": "well-studied_problem_variant"}, {"score": 0.031154862260329833, "phrase": "less-studied_problem_variant"}, {"score": 0.004575272950516775, "phrase": "combinatorial_optimization"}, {"score": 0.00413096972023037, "phrase": "motivating_application"}, {"score": 0.00399881984083004, "phrase": "machine_scheduling"}, {"score": 0.003961842092184655, "phrase": "vehicle_routing"}, {"score": 0.0039252049353279556, "phrase": "equivalent_formulations"}, {"score": 0.0037820003983334476, "phrase": "optimization_objective"}, {"score": 0.00372965096877929, "phrase": "particular_constraints"}, {"score": 0.0034947408949397127, "phrase": "research_community"}, {"score": 0.0034303736977646135, "phrase": "hardly_any_attention"}, {"score": 0.0027827907725673845, "phrase": "travelling_salesman_problem"}, {"score": 0.002331909406363425, "phrase": "travel-time_minimization"}, {"score": 0.002164602220179823, "phrase": "makespan_minimization"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b._v."}], "paper_keywords": ["Ant colony optimization", " Compressed simulated annealing", " Travelling salesman problem with time windows", " Hybridization"], "paper_abstract": "In combinatorial optimization it is not rare to find problems whose mathematical structure is nearly the same, differing only in some aspect related to the motivating application. For example, many problems in machine scheduling and vehicle routing have equivalent formulations and only differ with respect to the optimization objective, or particular constraints. Moreover, while some problems receive a lot of attention from the research community, their close relatives receive hardly any attention at all. Given two closely related problems, it is intuitive that it may be effective to adapt state-of-the-art algorithms-initially introduced for the well-studied problem variant-to the less-studied problem variant. In this paper we provide an example based on the travelling salesman problem with time windows that supports this intuition. In this context, the well-studied problem variant minimizes the travel time, while the less-studied problem variant minimizes the makespan. Indeed, the results show that the algorithms that we adapt from travel-time minimization to makespan minimization significantly outperform the existing state-of-the-art approaches for makespan minimization. (C) 2013 Elsevier B. V. All rights reserved.", "paper_title": "The travelling salesman problem with time windows: Adapting algorithms from travel-time to makespan optimization", "paper_id": "WOS:000324030600004"}