{"auto_keywords": [{"score": 0.048734215142491696, "phrase": "wiki_anxiety_inventory-editing"}, {"score": 0.029576426397292667, "phrase": "high_reliability"}, {"score": 0.00481495049065317, "phrase": "wiki_editing"}, {"score": 0.004493045859210086, "phrase": "higher_education"}, {"score": 0.004384623928442369, "phrase": "wiki_user_experience"}, {"score": 0.004175533280178052, "phrase": "wiki_content"}, {"score": 0.0038962096720793443, "phrase": "computer_anxiety_metrics"}, {"score": 0.0036652492107503956, "phrase": "wiki_editing_context"}, {"score": 0.0031650944584992726, "phrase": "factor_structure"}, {"score": 0.0030262967460085366, "phrase": "resulting_subscales"}, {"score": 0.0028236336891860592, "phrase": "uni-dimensional_structure"}, {"score": 0.0027330029055210926, "phrase": "principal_component_analysis"}, {"score": 0.002613103872300205, "phrase": "three-factor_solution"}, {"score": 0.002570817338292482, "phrase": "positive_affect"}, {"score": 0.0025499307228648883, "phrase": "editability_anxiety"}, {"score": 0.0025189177411152645, "phrase": "judgement_anxiety"}, {"score": 0.002283984048569816, "phrase": "uni-dimensional_construct"}, {"score": 0.0021659920594094407, "phrase": "true_structure"}, {"score": 0.0021049977753042253, "phrase": "wiki_anxiety"}], "paper_keywords": ["collaborative content creation", " collaborative and social computing design and evaluation", " HCI design and evaluation methods", " empirical studies in HCI", " blogs", " wikis", " empirical studies in collaborative and social computing"], "paper_abstract": "Although wikis are common in both the workplace and in Higher Education, little research has studied the wiki user experience. Recent literature highlights that users may be anxious about editing wiki content; yet in most of this research this anxiety has not been measured quantitatively. Although computer anxiety metrics exist to measure anxiety towards technology, they lack specificity and relevance to the wiki editing context. This paper reports two studies used to research the validity and reliability of the wiki anxiety inventory-editing (WAI-E), an inventory developed and used to measure anxiety in wiki editing (Study 1) and to explore the factor structure of the WAI-E and the validity and reliability of the resulting subscales (Study 2). Study 1 shows that the WAI-E, when used as a uni-dimensional structure, shows high reliability and validity. The principal component analysis conducted in Study 2 showed that the measure converged on a three-factor solution with factors measuring positive affect, editability anxiety and contribution judgement anxiety. The subscales showed high reliability and validity. It therefore seems that although the validity and reliability of using the WAI-E as a uni-dimensional construct are high, the use of the metric as such hides the true structure and nuances of the concept of wiki anxiety.", "paper_title": "Measuring Anxiety Towards Wiki Editing: Investigating the Dimensionality of the Wiki Anxiety Inventory-Editing", "paper_id": "WOS:000344604900004"}