{"auto_keywords": [{"score": 0.03394009994668228, "phrase": "proposed_model"}, {"score": 0.015719716506582538, "phrase": "modern_greek"}, {"score": 0.004556901872357751, "phrase": "automatic_induction"}, {"score": 0.004473982381245469, "phrase": "normalized_form"}, {"score": 0.004339108074589304, "phrase": "regular_and_mildly_irregular_words"}, {"score": 0.0041825926310470616, "phrase": "language-independent_algorithms"}, {"score": 0.0035668128900149814, "phrase": "automatic_word"}, {"score": 0.003545024951402818, "phrase": "lemmatization_task"}, {"score": 0.0033961782274326948, "phrase": "string_similarity"}, {"score": 0.002931673357607136, "phrase": "english"}, {"score": 0.0022519745140925475, "phrase": "pre-processing_tool"}, {"score": 0.0021309898622781124, "phrase": "electronic_dictionaries"}, {"score": 0.0021049977753042253, "phrase": "morphological_analyzers"}], "paper_keywords": ["Lemmatization", " stemming", " Levenshtein distance", " edit distance", " dice coefficient"], "paper_abstract": "This paper addresses the problem of automatic induction of the normalized form ( lemma) of regular and mildly irregular words with no direct supervision using language-independent algorithms. More specifically, two string distance metric models (i.e. the Levenshtein Edit Distance algorithm and the Dice Coefficient similarity measure) were employed in order to deal with the automatic word lemmatization task by combining two alignment models based on the string similarity and the most frequent inflectional suffixes. The performance of the proposed model has been evaluated quantitatively and qualitatively. Experiments were performed for the Modern Greek and English languages and the results, which are set within the state-of-the-art, have showed that the proposed model is robust (for a variety of languages) and computationally efficient. The proposed model may be useful as a pre-processing tool to various language engineering and text mining applications such as spell-checkers, electronic dictionaries, morphological analyzers etc.", "paper_title": "APPLYING SIMILARITY MEASURES FOR AUTOMATIC LEMMATIZATION: A CASE STUDY FOR MODERN GREEK AND ENGLISH", "paper_id": "WOS:000260806900014"}