{"auto_keywords": [{"score": 0.04046662116837597, "phrase": "compliance_concerns"}, {"score": 0.013710287322344746, "phrase": "compliance_sources"}, {"score": 0.00481495049065317, "phrase": "service-oriented_architectures"}, {"score": 0.004623224002010226, "phrase": "software_systems"}, {"score": 0.004585800466151371, "phrase": "multiple_sources"}, {"score": 0.004561019117546361, "phrase": "relevant_policies"}, {"score": 0.004216316375000129, "phrase": "frequent_changes"}, {"score": 0.004081385289516914, "phrase": "involved_stakeholders"}, {"score": 0.004037370832877034, "phrase": "long_run"}, {"score": 0.0037422284254015987, "phrase": "model-driven_and_view-based_approach"}, {"score": 0.0035930624319243224, "phrase": "separate_view_models"}, {"score": 0.0035350683880089827, "phrase": "domain-specific_languages"}, {"score": 0.0034780071331554003, "phrase": "non-technical_and_technical_experts"}, {"score": 0.003357503738345204, "phrase": "domain_knowledge"}, {"score": 0.0033302915283097367, "phrase": "compliance_implementations"}, {"score": 0.003128838753643307, "phrase": "industrial_case_study"}, {"score": 0.0030203964167355474, "phrase": "multiple_compliance_sources"}, {"score": 0.0029716179574996626, "phrase": "relevant_reports"}, {"score": 0.002814625507877128, "phrase": "generated_artifacts"}, {"score": 0.0027541694378728004, "phrase": "compliance_information"}, {"score": 0.0026659048913727106, "phrase": "view_models"}, {"score": 0.0025181767240440417, "phrase": "solid_foundation"}, {"score": 0.0024842242921857705, "phrase": "relevant_laws"}, {"score": 0.0022651497894502714, "phrase": "explicit_links"}, {"score": 0.0022346012624961113, "phrase": "corresponding_implementations"}, {"score": 0.0021688337445559, "phrase": "root_cause_analysis"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Compliance", " Model-driven", " View-based", " Service-oriented architectures", " Process-driven SOAs", " Domain-specific languages"], "paper_abstract": "Context: Ensuring software systems conforming to multiple sources of relevant policies, laws, and regulations is significant because the consequences of infringement can be serious. Unfortunately, this goal is hardly achievable due to the divergence and frequent changes of compliance sources and the differences in perception and expertise of the involved stakeholders. In the long run, these issues lead to problems regarding complexity, understandability, maintainability, and reusability of compliance concerns. Objective: In this article, we present a model-driven and view-based approach for addressing problems related to compliance concerns. Method: Compliance concerns are represented using separate view models. This is achieved using domain-specific languages (DSLs) that enable non-technical and technical experts to formulate only the excerpts of the system according to their expertise and domain knowledge. The compliance implementations, reports, and documentation can be automatically generated from the models. The applicability of our approach has been validated using an industrial case study. Results: Our approach supports stakeholders in dealing with the divergence of multiple compliance sources. The compliance controls and relevant reports and documentation are generated from the models and hence become traceable, understandable, and reusable. Because the generated artifacts are associated with the models, the compliance information won't be lost as the system evolves. DSLs and view models convey compliance concerns to each stakeholder in a view that is most appropriate for his/her current work task. Conclusions: Our approach lays a solid foundation for ensuring conformance to relevant laws and regulations. This approach, on the one hand, aims at addressing the variety of expertise and domain knowledge of stakeholders. On the other hand, it also aims at ensuring the explicit links between compliance sources and the corresponding implementations, reports, and documents for conducting many important tasks such as root cause analysis, auditing, and governance. (C) 2012 Elsevier B.V. All rights reserved.", "paper_title": "Compliance in service-oriented architectures: A model-driven and view-based approach", "paper_id": "WOS:000302587100002"}