{"auto_keywords": [{"score": 0.04116482427643901, "phrase": "nearest_node"}, {"score": 0.01751053691419577, "phrase": "query_point"}, {"score": 0.009081866387411498, "phrase": "query-issuing_node"}, {"score": 0.00481495049065317, "phrase": "knn_query_processing_methods"}, {"score": 0.004300133642951283, "phrase": "mobile_ad_hoc_networks"}, {"score": 0.004046020290832207, "phrase": "knn_query"}, {"score": 0.002931569771634119, "phrase": "exp_method"}, {"score": 0.002855934865505357, "phrase": "query_point_floods"}, {"score": 0.002770150086489194, "phrase": "specific_circular_region"}, {"score": 0.002583597507349819, "phrase": "spi_method"}, {"score": 0.0024306740161601625, "phrase": "spiral_manner"}, {"score": 0.002347378595930709, "phrase": "satisfactory_knn_result"}, {"score": 0.0021797112385590913, "phrase": "high_accuracy"}, {"score": 0.002151388538895855, "phrase": "query_result"}, {"score": 0.0021049977753042253, "phrase": "existing_methods"}], "paper_keywords": ["MANETs", " kNN query", " locations-based service"], "paper_abstract": "In this paper, we propose two beacon-less kNN query processing methods for reducing traffic and maintaining high accuracy of the query result in mobile ad hoc networks (MANETs). In these methods, the query-issuing node first forwards a kNN query using geo-routing to the nearest node from the point specified by the query (query point). Then, the nearest node from the query point forwards the query to other nodes close to the query point, and each node receiving the query replies with the information on itself. In this process, we adopt two different approaches: the Explosion (EXP) method and the Spiral (SPI) method. In the EXP method, the nearest node from the query point floods the query to nodes within a specific circular region, and each node receiving the query replies with information on itself. In the SPI method, the nearest node from the query point forwards the query to other nodes in a spiral manner, and the node that collects a satisfactory kNN result transmits the result to the query-issuing node. Experimental results show that our proposed methods reduce traffic and achieve high accuracy of the query result, in comparison with existing methods.", "paper_title": "KNN Query Processing Methods in Mobile Ad Hoc Networks", "paper_id": "WOS:000337151500012"}