{"auto_keywords": [{"score": 0.04920178434889582, "phrase": "authorization_infrastructure"}, {"score": 0.004416713079266374, "phrase": "collaborative_systems"}, {"score": 0.004335739075947899, "phrase": "fine-grained_authorization_models"}, {"score": 0.004152502093643003, "phrase": "semantic_subtleties"}, {"score": 0.003940338160665297, "phrase": "particular_applicability"}, {"score": 0.003916098498242888, "phrase": "distributed_collaborative_systems"}, {"score": 0.003808845109556467, "phrase": "application-specific_conceptual_authorization_models"}, {"score": 0.003681723894416361, "phrase": "informed_decisions"}, {"score": 0.0034400245101881936, "phrase": "new_pattern-based_security_engineering_construct"}, {"score": 0.0032742371135183195, "phrase": "different_sub-structures"}, {"score": 0.003194354458513131, "phrase": "single_high-level_security_policy"}, {"score": 0.0031260524791486347, "phrase": "policy_management"}, {"score": 0.003078158564144202, "phrase": "specific_micro-process_patterns"}, {"score": 0.0029753513692467315, "phrase": "relevant_\"product\"_patterns"}, {"score": 0.0029297595441334823, "phrase": "distributed_authorization_infrastructure"}, {"score": 0.0029027394930867902, "phrase": "abstract_concepts"}, {"score": 0.0028848643090508205, "phrase": "concrete_designs"}, {"score": 0.002797121441432477, "phrase": "solution_refinement"}, {"score": 0.0027372898106427274, "phrase": "development_life-cycle"}, {"score": 0.0027036751290702406, "phrase": "\"product\"_patterns"}, {"score": 0.0025495426598675583, "phrase": "existing_infrastructures"}, {"score": 0.002456744238900652, "phrase": "greenfield_system_development"}, {"score": 0.0023382335380460304, "phrase": "collaborative_editing"}, {"score": 0.0022531089868518235, "phrase": "design_decisions"}, {"score": 0.0021913010538173825, "phrase": "collaborative_grid_systems"}, {"score": 0.002144400314994328, "phrase": "soa-based_systems"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Security engineering", " Software engineering", " Security patterns", " Authorization", " Access control", " Distributed systems", " Distributed systems security", " Security solution frames"], "paper_abstract": "The design of an authorization infrastructure is one of the most important aspects of engineering a secure software system. Unlike other system types, distributed systems - and especially distributed collaborative systems - can require custom, fine-grained authorization models and enforcement approaches that are able to take into account a range of semantic subtleties. In this paper we present a comprehensive, pattern-oriented software engineering approach to authorization for general distributed systems - with particular applicability to distributed collaborative systems - that allows developers to build custom, application-specific conceptual authorization models in a simple yet extensible manner, and to make informed decisions regarding their enforcement in software, as well as how their supporting rule/policy infrastructure should be designed. Our authorization approach is embodied in two instances of a new pattern-based security engineering construct called a security solution frame, which groups together related patterns - both security \"product\" and micro-process patterns - in different sub-structures, horizontally and vertically, for a single high-level security policy (in our case authorization and policy management). By applying specific micro-process patterns in each solution frame, developers are guided in using relevant \"product\" patterns to progressively construct a distributed authorization infrastructure - from abstract concepts toward concrete designs, via a number of levels of abstraction implying solution refinement and corresponding to stages of the development life-cycle. The summary-form \"product\" patterns encapsulated in each frame also help developers to form a holistic, \"global\" view when analyzing existing infrastructures. We illustrate and evaluate the proposal in the context of greenfield system development by applying our solution frames to design the authorization infrastructure of a (new) distributed system for secure file sharing and collaborative editing; and also use our solution frames to briefly analyze and capture the design decisions underlying two existing distributed authorization infrastructures: one based on UCON for collaborative Grid systems and another based on ZBAC for SOA-based systems. (C) 2015 Elsevier Ltd. All rights reserved.", "paper_title": "Security solution frames and security patterns for authorization in distributed, collaborative systems", "paper_id": "WOS:000367124400012"}