{"auto_keywords": [{"score": 0.04812129806508108, "phrase": "research_continuance"}, {"score": 0.04754843024727075, "phrase": "scientific_discipline"}, {"score": 0.040341907947413075, "phrase": "research_pattern"}, {"score": 0.00481495049065317, "phrase": "research_field"}, {"score": 0.004337900700685262, "phrase": "growing_amount"}, {"score": 0.004160531596936783, "phrase": "one-_timers"}, {"score": 0.00389164348807591, "phrase": "subject_area"}, {"score": 0.0033204052817782464, "phrase": "scientific_publications"}, {"score": 0.0032517484445814334, "phrase": "obtainable_\"most_prolific_terrorism_authors"}, {"score": 0.0028091907694771613, "phrase": "included_authors"}, {"score": 0.0023864566654035924, "phrase": "field's_growth"}, {"score": 0.002298288831092204, "phrase": "new_and_formative_fields"}, {"score": 0.0022133711375320244, "phrase": "intellectual_mobility"}, {"score": 0.002149494537191303, "phrase": "new_topics"}, {"score": 0.0021049977753042253, "phrase": "particular_scientific_field"}], "paper_keywords": [""], "paper_abstract": "The issue of research continuance in a scientific discipline was analyzed and applied to the field of terrorism. The growing amount of literature in this field is produced mostly by one- timers who \"visit\" the field, contribute one or two articles, and then move to another subject area. This research pattern does not contribute to the regularity and constancy of publication by which a scientific discipline is formed and theories and paradigms of the field are created. This study observed the research continuance and transience of scientific publications in terrorism by using obtainable \"most prolific terrorism authors\" lists at different points in time. These lists designed by several terrorism researchers, presented a few researchers who contributed to the field continuously and many others whose main research interest lay in another discipline. The four lists observed included authors who were continuants, transients, new-comers, and terminators (who left the field). The lack of continuous, full-time research in a research field is typical of many disciplines, but the influence of this research pattern on a field's growth and stability is different for older, established disciplines than for new and formative fields of study. With in the former, intellectual mobility could contribute to the rise of new topics and probably enrich the particular scientific field; with the latter, by contrast, it could hamper the formation and growth of the field.", "paper_title": "Transient and continuant authors in a research field: The case of terrorism", "paper_id": "WOS:000248080300004"}