{"auto_keywords": [{"score": 0.03168633494004661, "phrase": "different_facets"}, {"score": 0.026238043721995466, "phrase": "tag_graph"}, {"score": 0.00481495049065317, "phrase": "web_request"}, {"score": 0.004772818068176176, "phrase": "effective_and_efficient_search_service"}, {"score": 0.00470341117804131, "phrase": "relevant_images"}, {"score": 0.004662250189344776, "phrase": "prevalent_way"}, {"score": 0.004594443767709888, "phrase": "keyword_interface"}, {"score": 0.004294962474996283, "phrase": "manual_efforts"}, {"score": 0.004074212307838049, "phrase": "suitable_set"}, {"score": 0.003991449490087454, "phrase": "user_intervention"}, {"score": 0.0038761135052054765, "phrase": "web-scale_image_annotation"}, {"score": 0.0037647644635355015, "phrase": "scalability"}, {"score": 0.0037311260623089436, "phrase": "twofold_meaning"}, {"score": 0.003457162475293732, "phrase": "huge_tag"}, {"score": 0.0032315723330399375, "phrase": "ambiguous_terms"}, {"score": 0.0031565959573536194, "phrase": "image_content"}, {"score": 0.0028990540380955596, "phrase": "unified_framework"}, {"score": 0.002848444028358522, "phrase": "automatic_web_image_annotation"}, {"score": 0.002701839495787648, "phrase": "former_content-based_indexing"}, {"score": 0.0026860218805819184, "phrase": "concept-based_codebook"}, {"score": 0.002646880721119838, "phrase": "scalability_and_noise-resistance_issues"}, {"score": 0.002600661525224505, "phrase": "joint_feature_map"}, {"score": 0.002409503258044183, "phrase": "entire_annotation"}, {"score": 0.002388368786294332, "phrase": "structured_learning_technique"}, {"score": 0.0023466530426848064, "phrase": "learning_model"}, {"score": 0.0022854384756395116, "phrase": "generated_joint_feature_map"}, {"score": 0.002245545577228581, "phrase": "flickr"}, {"score": 0.002206290313627494, "phrase": "experimental_results"}], "paper_keywords": ["image annotation", " multi-facet", " web-scale"], "paper_abstract": "The vast amount of images available on the Web request for an effective and efficient search service to help users find relevant images. The prevalent way is to provide a keyword interface for users to submit queries. However, the amount of images without any tags or annotations are beyond the reach of manual efforts. To overcome this, automatic image annotation techniques emerge, which are generally a process of selecting a suitable set of tags for a given image without user intervention. However, there are three main challenges with respect to Web-scale image annotation: scalability, noise-resistance and diversity. Scalability has a twofold meaning: first an automatic image annotation system should be scalable with respect to billions of images on the Web; second it should be able to automatically identify several relevant tags among a huge tag set for a given image within seconds or even faster. Noise-resistance means that the system should be robust enough against typos and ambiguous terms used in tags. Diversity represents that image content may include both scenes and objects, which are further described by multiple different image features constituting different facets in annotation. In this paper, we propose a unified framework to tackle the above three challenges for automatic Web image annotation. It mainly involves two components: tag candidate retrieval and multi-facet annotation. In the former content-based indexing and concept-based codebook are leveraged to solve scalability and noise-resistance issues. In the latter the joint feature map has been designed to describe different facets of tags in annotations and the relations between these facets. Tag graph is adopted to represent tags in the entire annotation and the structured learning technique is employed to construct a learning model on top of the tag graph based on the generated joint feature map. Millions of images from Flickr are used in our evaluation. Experimental results show that we have achieved 33% performance improvements compared with those single facet approaches in terms of three metrics: precision, recall and F1 score.", "paper_title": "Effective and Efficient Multi-Facet Web Image Annotation", "paper_id": "WOS:000304209300009"}