{"auto_keywords": [{"score": 0.03430489090085741, "phrase": "behavioral_measures"}, {"score": 0.033579053218340996, "phrase": "training_outcomes"}, {"score": 0.00481495049065317, "phrase": "simulator-based_training"}, {"score": 0.004762202897268383, "phrase": "perceptual_judgment_task_versus_questionnaire-based_measures"}, {"score": 0.004624337472244542, "phrase": "virtual_environment"}, {"score": 0.004096409451697279, "phrase": "improved_outcomes"}, {"score": 0.003992385826251404, "phrase": "reduced_incidence"}, {"score": 0.00396315099839886, "phrase": "simulator_sickness"}, {"score": 0.0033589207694997413, "phrase": "recent_papers"}, {"score": 0.0030526216870671325, "phrase": "simple_perceptual_task"}, {"score": 0.0028993944292191433, "phrase": "longitudinal_study"}, {"score": 0.00280496585980086, "phrase": "systematic_differences"}, {"score": 0.0027844017803674444, "phrase": "task_performance"}, {"score": 0.002713604305939145, "phrase": "perceptual_task"}, {"score": 0.0026838147966444783, "phrase": "separate_group"}, {"score": 0.0026641365405034355, "phrase": "control_subjects"}, {"score": 0.0026348886455716614, "phrase": "separate_analysis"}, {"score": 0.0022575078732617678, "phrase": "questionnaire-based_studies"}, {"score": 0.002216336059488137, "phrase": "design_aspects"}, {"score": 0.002200077887697072, "phrase": "new_simulators"}, {"score": 0.002159951198924152, "phrase": "existing_systems"}, {"score": 0.002128376306688074, "phrase": "training_scenarios"}], "paper_keywords": [""], "paper_abstract": "The quality of a virtual environment, as characterized by factors such as presence and fidelity, is of interest to developers and users of simulators for many reasons, not least because both factors have been linked to improved outcomes in training as well as a reduced incidence of simulator sickness. Until recently, most approaches to measuring these factors have been based on subjective, postexposure questioning. This approach has, however, been criticized because of the shortcomings of self-report and the need to delay feedback or interrupt activity. To combat these problems, recent papers on the topic have proposed the use of behavioral measures to assess simulators and predict training outcomes. Following their lead, this paper makes use of a simple perceptual task in which users are asked to estimate their simulated speed within the environment. A longitudinal study of training outcomes using two of the simulators revealed systematic differences in task performance that matched differences measured using the perceptual task in a separate group of control subjects. A separate analysis of two standard presence questionnaires revealed that they were able to predict learning outcomes on a per individual basis, but that they were insensitive to the differences between the two simulators. The paper concludes by explaining how behavioral measures of the type proposed here can complement questionnaire-based studies, helping to motivate design aspects of new simulators, prompting changes to existing systems, and constraining training scenarios to maximize their efficacy.", "paper_title": "Predicting the Efficacy of Simulator-based Training Using a Perceptual Judgment Task Versus Questionnaire-based Measures of Presence", "paper_id": "WOS:000318352600005"}