{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "distance_bounding_protocols"}, {"score": 0.009764406102090957, "phrase": "relay_attacks"}, {"score": 0.004630423009638876, "phrase": "decision_theory"}, {"score": 0.004528156929805637, "phrase": "security_countermeasures"}, {"score": 0.00389427992231721, "phrase": "bounding_protocols"}, {"score": 0.0037449033166879874, "phrase": "research_topic"}, {"score": 0.0036214184763804034, "phrase": "contactless_systems"}, {"score": 0.003405472159599442, "phrase": "impressive_number"}, {"score": 0.0027382040767844093, "phrase": "decision_making_field"}, {"score": 0.0026330549554033876, "phrase": "multi-criteria_comparison"}, {"score": 0.0024075916292945715, "phrase": "side_effect"}, {"score": 0.002176887956041267, "phrase": "considered_scenario"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Authentication", " Distance bounding", " Comparison", " Decision making", " Relay attack"], "paper_abstract": "Distance bounding protocols are security countermeasures designed to thwart relay attacks. Such attacks consist in relaying messages exchanged between two parties, making them believe they communicate directly with each other. Although distance bounding protocols have existed since the early 1990s, this research topic resurrected with the deployment of contactless systems, against which relay attacks are particularly impactful. Given the impressive number of distance bounding protocols that are designed every year, it becomes urgent to provide researchers and engineers with a methodology to fairly compare the protocols in spite of their various properties. This paper introduces such a methodology based on concepts from the decision making field. The methodology allows for a multi-criteria comparison of distance bounding protocols, thereby identifying the most appropriate protocols once the context is provided. As a side effect, this paper clearly identifies the protocols that should no longer be considered, regardless of the considered scenario. (C) 2015 Elsevier B.V. All rights reserved.", "paper_title": "Comparing distance bounding protocols: A critical mission supported by decision theory", "paper_id": "WOS:000361162500009"}