{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "senior_it_leadership"}, {"score": 0.014338527045908322, "phrase": "sisp"}, {"score": 0.010473830836654822, "phrase": "strategic_information_systems_planning"}, {"score": 0.004597244847332915, "phrase": "information_systems"}, {"score": 0.004418456827500267, "phrase": "entire_enterprise"}, {"score": 0.0037203741725514126, "phrase": "top_concerns"}, {"score": 0.0035052810710060893, "phrase": "empirical_investigation"}, {"score": 0.003050376875258722, "phrase": "resulting_model"}, {"score": 0.0025849489224175548, "phrase": "moderate_relationship"}, {"score": 0.0024032847883410356, "phrase": "cio"}, {"score": 0.002279217896185919, "phrase": "advisory_committee"}], "paper_keywords": ["senior IT management", " strategic information systems planning", " information systems infrastructure"], "paper_abstract": "The integration of information systems (IS) across the entire enterprise has become one of the most important technology management challenges in complex organizations. Many companies have placed the development and implementation of a highly integrated IS infrastructure among the top concerns of their overall IT management practice. This paper reports on an empirical investigation of the influence of senior IT leadership and strategic information systems planning (SISP) on the level of implementation of the IS infrastructure. The resulting model shows the importance that SISP plays in the relationship between senior IT leadership and the extent of an integrated IS infrastructure. The findings indicate a moderate relationship between the factors of senior IT leadership (the importance of the CIO and the presence of a varied IS advisory committee) and SISP, and a strong relationship between SISP and three aspects of IS infrastructure (technical integration, application functionality, and data integration).", "paper_title": "Is infrastructure: The influence of senior IT leadership and strategic information systems planning", "paper_id": "WOS:000242362800011"}