{"auto_keywords": [{"score": 0.04833595394475732, "phrase": "high-dimensional_data"}, {"score": 0.011292720004643224, "phrase": "disjunctive_closed_patterns"}, {"score": 0.004377077848734575, "phrase": "computational_challenges"}, {"score": 0.0043080553835735825, "phrase": "disjunctive_boolean_patterns"}, {"score": 0.004085713541752114, "phrase": "microarray_gene_expression_data"}, {"score": 0.003773449694108617, "phrase": "novel_algorithm"}, {"score": 0.003578600071301459, "phrase": "microarray_data_sets"}, {"score": 0.0033579708256295847, "phrase": "disclosed"}, {"score": 0.003287482882222731, "phrase": "closed_itemsets"}, {"score": 0.0032184697893776052, "phrase": "search_space"}, {"score": 0.0029722900280316216, "phrase": "real_microarray_gene_expression_data_sets"}, {"score": 0.0027303606813078255, "phrase": "data_set"}, {"score": 0.002468450551616404, "phrase": "art_algorithms"}, {"score": 0.0024037949232582462, "phrase": "disjunctive_minimal_generators"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Disjunctive itemset", " Frequent itemset mining", " Closed itemset", " Rare itemset", " Formal concept analysis", " Microarray data"], "paper_abstract": "We focus, in this paper, on the computational challenges of identifying disjunctive Boolean patterns in high-dimensional data. We conduct our analysis focusing particularly in microarray gene expression data, since this is one of the most stereotypical examples of high-dimensional data. We devised a novel algorithm that takes advantage of the scarcity of samples in microarray data sets, allowing us to efficiently find disjunctive closed patterns. Our algorithm, Disclosed, mines disjunctive closed itemsets by exploring the search space in a depth-first, top-down manner. We evaluated the performance of our algorithm to execute such a task using real microarray gene expression data sets publicly available on the Internet. Our experiments revealed under what situations, the characteristics of a data set, our method obtain a good, bad or average performance. We also compared the performance of our method with the state of the art algorithms for finding disjunctive closed patterns and disjunctive minimal generators. We observed that our approach is two orders of magnitude more efficient, both in terms of time and memory. (C) 2014 Elsevier Inc. All rights reserved.", "paper_title": "Disclosed: An efficient depth-first, top-down algorithm for mining disjunctive closed itemsets in high-dimensional data", "paper_id": "WOS:000339132700011"}