{"auto_keywords": [{"score": 0.04652714789568406, "phrase": "orthonormal_basis"}, {"score": 0.03477367158984182, "phrase": "signal_model"}, {"score": 0.015026561694069216, "phrase": "nyquist_rate"}, {"score": 0.014691359257821203, "phrase": "sparse_representation"}, {"score": 0.012401649489214527, "phrase": "nyquist-shannon_sampling_theorem"}, {"score": 0.012124281064568091, "phrase": "required_samples"}, {"score": 0.010317830032854396, "phrase": "inverse_map"}, {"score": 0.00481495049065317, "phrase": "finite-dimensional_linear_subspaces"}, {"score": 0.004733347359490221, "phrase": "emerging_signal_acquisition_technique"}, {"score": 0.003977993693395208, "phrase": "linear_subspaces"}, {"score": 0.0039553744129764016, "phrase": "low_dimension"}, {"score": 0.0039105194554402475, "phrase": "sampling_theorems"}, {"score": 0.0035796471115594553, "phrase": "necessary_and_sufficient_condition"}, {"score": 0.0034789831290103967, "phrase": "simple_linear_algorithm"}, {"score": 0.003459191419478298, "phrase": "signal_reconstruction"}, {"score": 0.0032027318619522916, "phrase": "dimensional_observation_spaces"}, {"score": 0.0031037644581516973, "phrase": "almost_all_linear_maps"}, {"score": 0.0030423786289357846, "phrase": "observation_space"}, {"score": 0.0029652292779277782, "phrase": "largest_dimension"}, {"score": 0.002939948763582007, "phrase": "convex_hull"}, {"score": 0.002698864497669978, "phrase": "lipschitz"}, {"score": 0.0026680267928092167, "phrase": "required_observation_dimension"}, {"score": 0.0025416235470290286, "phrase": "unique_linear_sampling_schemes"}, {"score": 0.002519945420045647, "phrase": "small_number"}, {"score": 0.0024005409468262203, "phrase": "stable_sampling_methods"}, {"score": 0.0021170579470073305, "phrase": "sparse_signal_model"}, {"score": 0.0021049977753042253, "phrase": "additional_tree_structure"}], "paper_keywords": ["Compressed sensing", " embedding and restricted isometry", " sampling theorems", " unions of linear subspaces"], "paper_abstract": "Compressed sensing is an emerging signal acquisition technique that enables signals to be sampled well below the Nyquist rate, given that the signal has a sparse representation in an orthonormal basis. In fact, sparsity in an orthonormal basis is only one possible signal model that allows for sampling strategies below the Nyquist rate. In this paper, we consider a more general signal model and assume signals that live on or close to the union of linear subspaces of low dimension. We present sampling theorems for this model that are in the same spirit as the Nyquist-Shannon sampling theorem in that they connect the number of required samples to certain model parameters. Contrary to the Nyquist-Shannon sampling theorem, which gives a necessary and sufficient condition for the number of required samples as well as a simple linear algorithm for signal reconstruction, the model studied here is more complex. We therefore concentrate on two aspects of the signal model, the existence of one to one maps to lower dimensional observation spaces and the smoothness of the inverse map. We show that almost all linear maps are one to one when the observation space is at least of the same dimension as the largest dimension of the convex hull of the union of any two subspaces in the model. However, we also show that in order for the inverse map to have certain smoothness properties such as a given finite Lipschitz constant, the required observation dimension necessarily depends logarithmically on the number of subspaces in the signal model. In other words, while unique linear sampling schemes require a small number of samples depending only on the dimension of the subspaces involved, in order to have stable sampling methods, the number of samples depends necessarily logarithmically on the number of subspaces in the model. These results are then applied to two examples, the standard compressed sensing signal model in which the signal has a sparse representation in an orthonormal basis and to a sparse signal model with additional tree structure.", "paper_title": "Sampling Theorems for Signals From the Union of Finite-Dimensional Linear Subspaces", "paper_id": "WOS:000264632200036"}