{"auto_keywords": [{"score": 0.04739409154878636, "phrase": "selfish_nodes"}, {"score": 0.04464053001280885, "phrase": "nscc"}, {"score": 0.009713710332974173, "phrase": "individual_node_access_costs"}, {"score": 0.003992129945230457, "phrase": "caching_capability"}, {"score": 0.0037864980290391354, "phrase": "local_cache"}, {"score": 0.0034725269588525534, "phrase": "low_individual_node_access_costs"}, {"score": 0.0033737457695128233, "phrase": "\"price\"_model"}, {"score": 0.0032777653153451265, "phrase": "different_node_pairs"}, {"score": 0.003215295260684715, "phrase": "decision_making"}, {"score": 0.003154012038613403, "phrase": "game-theoretic_approach"}, {"score": 0.0030058503645435455, "phrase": "global_object_placement"}, {"score": 0.00266510562382701, "phrase": "implicit_cooperation"}, {"score": 0.0024914105981393127, "phrase": "previous_work"}, {"score": 0.002467537104028187, "phrase": "tsls"}, {"score": 0.0021563019696857768, "phrase": "fairer_treatment"}], "paper_keywords": ["Content caching", " Selfish nodes", " Game", " Various access prices"], "paper_abstract": "This work proposes a scheme that enables selfish nodes to cooperate in caching, here dubbed Not So Cooperative Caching (NSCC). We consider a network comprised of selfish nodes; each is with caching capability and an objective of reducing its own access cost by fetching data from local cache or from other caches. The challenge is to determine what objects to cache at each node so as to induce low individual node access costs, and the realistic access \"price\" model which allows various access \"prices\" of different node pairs further complicates the decision making. Using a game-theoretic approach and considering the various access \"prices,\" NSCC seeks a global object placement in which individual node access costs are reduced as compared to that when they operate in isolation (referred to as GL) so as to incur implicit cooperation even among these selfish nodes. Our extensive experimental results demonstrate that in most cases, NSCC outperforms previous work (TSLS) which ignores the difference in access \"prices,\" reduces individual node access costs by on average, more than 47.32% as compared to GL, and allows for a fairer treatment of nodes according to their average access \"prices.\"", "paper_title": "Study on the Theoretical Framework of Not So Cooperative Caching", "paper_id": "WOS:000336885500004"}