{"auto_keywords": [{"score": 0.004744437370338926, "phrase": "ill-posed_nature"}, {"score": 0.00462919213721188, "phrase": "neural_computations"}, {"score": 0.004257806363128601, "phrase": "probabilistically_consistent_and_normative_manner"}, {"score": 0.0041136473765874815, "phrase": "rich_theoretical_literature"}, {"score": 0.0036553070575015344, "phrase": "comparatively_little_attention"}, {"score": 0.0033288399506044763, "phrase": "computational_consequences"}, {"score": 0.003296212583539166, "phrase": "encoding_stimulus_trajectories"}, {"score": 0.0027334673433027086, "phrase": "ruinous_representation"}, {"score": 0.0026277995163948263, "phrase": "alternative_encoder"}, {"score": 0.0024768883044869023, "phrase": "independent_information"}, {"score": 0.0023003498123420237, "phrase": "appropriate_foundation"}, {"score": 0.0022665781920241245, "phrase": "time-varying_population_codes"}, {"score": 0.0021789194955896124, "phrase": "temporal_stimulus_statistics"}, {"score": 0.0021049977753042253, "phrase": "simple_decoding"}], "paper_keywords": [""], "paper_abstract": "Uncertainty coming from the noise in its neurons and the ill-posed nature of many tasks plagues neural computations. Maybe surprisingly, many studies show that the brain manipulates these forms of uncertainty in a probabilistically consistent and normative manner, and there is now a rich theoretical literature on the capabilities of populations of neurons to implement computations in the face of uncertainty. However, one major facet of uncertainty has received comparatively little attention: time. In a dynamic, rapidly changing world, data are only temporarily relevant. Here, we analyze the computational consequences of encoding stimulus trajectories in populations of neurons. For the most obvious, simple, instantaneous encoder, the correlations induced by natural, smooth stimuli engender a decoder that requires access to information that is nonlocal both in time and across neurons. This formally amounts to a ruinous representation. We show that there is an alternative encoder that is computationally and representationally powerful in which each spike contributes independent information; it is independently decodable, in other words. We suggest this as an appropriate foundation for understanding time-varying population codes. Furthermore, we show how adaptation to temporal stimulus statistics emerges directly from the demands of simple decoding.", "paper_title": "Fast population coding", "paper_id": "WOS:000243524000005"}