{"auto_keywords": [{"score": 0.04399529083894353, "phrase": "collaboratively_constructed_ontologies"}, {"score": 0.015358197393444172, "phrase": "collaborative_ontology_engineering"}, {"score": 0.0151364170986791, "phrase": "creation_process"}, {"score": 0.015048590575574531, "phrase": "collaborative_construction"}, {"score": 0.01453207370617928, "phrase": "collaborative_protege"}, {"score": 0.013432934138577426, "phrase": "visualization_tools"}, {"score": 0.009269570091809854, "phrase": "collaborative_ontology_engineering_projects"}, {"score": 0.00481495049065317, "phrase": "creation_process_behind_collaboratively_engineered_ontologies"}, {"score": 0.00448686632980506, "phrase": "collaborative_ontology_engineering_tools"}, {"score": 0.004421368738303273, "phrase": "rich_and_structured_logs"}, {"score": 0.004331268265601626, "phrase": "new_challenges"}, {"score": 0.0039421123723827655, "phrase": "final_product"}, {"score": 0.0036196183044671106, "phrase": "authors'_knowledge"}, {"score": 0.003566735116775593, "phrase": "ontology_visualization_tool"}, {"score": 0.0034227226677308337, "phrase": "ontology_engineering_processes"}, {"score": 0.0033529044784726477, "phrase": "final_ontology"}, {"score": 0.003294191205745385, "phrase": "process_data"}, {"score": 0.0032652199869725117, "phrase": "important_stepping-stone"}, {"score": 0.003114942418729772, "phrase": "application_paper"}, {"score": 0.003060383344045888, "phrase": "tool_-_pragmatix"}, {"score": 0.0030156459374311856, "phrase": "structured_change_logs"}, {"score": 0.002688352108538072, "phrase": "quality-related_issues"}, {"score": 0.0025345056783823206, "phrase": "pragmatix"}, {"score": 0.0023406519395653674, "phrase": "structured_logs"}, {"score": 0.0022593125871715894, "phrase": "heuristic_evaluation"}, {"score": 0.002226259272038318, "phrase": "domain_experts"}, {"score": 0.002206659334299112, "phrase": "early_design_challenges"}, {"score": 0.0021049977753042253, "phrase": "new_line"}], "paper_keywords": ["Collaborative Ontology Engineering", " Ontology Engineering Visualization", " Ontology Evaluation", " Ontology Monitoring", " Ontology Tool", " Pragmatic Analysis"], "paper_abstract": "With the emergence of tools for collaborative ontology engineering, more and more data about the creation process behind collaborative construction of ontologies is becoming available. Today, collaborative ontology engineering tools such as Collaborative Protege offer rich and structured logs of changes, thereby opening up new challenges and opportunities to study and analyze the creation of collaboratively constructed ontologies. While there exists a plethora of visualization tools for ontologies, they have primarily been built to visualize aspects of the final product (the ontology) and not the collaborative processes behind construction (e. g. the changes made by contributors over time). To the best of the authors' knowledge, there exists no ontology visualization tool today that focuses primarily on visualizing the history behind collaboratively constructed ontologies. Since the ontology engineering processes can influence the quality of the final ontology, they believe that visualizing process data represents an important stepping-stone towards better understanding of managing the collaborative construction of ontologies in the future. In this application paper, the authors present a tool - PragmatiX - which taps into structured change logs provided by tools such as Collaborative Protege to visualize various pragmatic aspects of collaborative ontology engineering. The tool is aimed at managers and leaders of collaborative ontology engineering projects to help them in monitoring progress, in exploring issues and problems, and in tracking quality-related issues such as overrides and coordination among contributors. The paper makes the following contributions: (i) They present PragmatiX, a tool for visualizing the creation process behind collaboratively constructed ontologies (ii) the authors illustrate the functionality and generality of the tool by applying it to structured logs of changes of two large collaborative ontology-engineering projects and (iii) they conduct a heuristic evaluation of the tool with domain experts to uncover early design challenges and opportunities for improvement. Finally, the authors hope that this work sparks a new line of research on visualization tools for collaborative ontology engineering projects.", "paper_title": "PragmatiX: An Interactive Tool for Visualizing the Creation Process Behind Collaboratively Engineered Ontologies", "paper_id": "WOS:000323380800003"}