{"auto_keywords": [{"score": 0.03371442890089371, "phrase": "broadcasting_algorithm"}, {"score": 0.03152024515673988, "phrase": "n-node_trees"}, {"score": 0.00481495049065317, "phrase": "size_of_advice_and_broadcasting_time"}, {"score": 0.004472146692254812, "phrase": "fast_broadcasting"}, {"score": 0.004431041346291019, "phrase": "tree_networks"}, {"score": 0.003966162568548304, "phrase": "informed_node"}, {"score": 0.003281643474564305, "phrase": "source_message"}, {"score": 0.002843450389745497, "phrase": "optimal_broadcasting_time"}, {"score": 0.0026163210719740847, "phrase": "best_competitive_ratio"}, {"score": 0.0023522423291484212, "phrase": "arbitrarily_small_positive_constant_epsilon"}, {"score": 0.00229844995872581, "phrase": "first_communication_problem"}, {"score": 0.0021049977753042253, "phrase": "arbitrary_size"}], "paper_keywords": ["Algorithm", " Parallel", " Deterministic broadcasting", " Advice", " Tree"], "paper_abstract": "We study the problem of the amount of information required to perform fast broadcasting in tree networks. The source located at the root of a tree has to disseminate a message to all nodes. In each round each informed node can transmit to one child. Nodes do not know the topology of the tree but an oracle knowing it can give a string of bits of advice to the source which can then pass it down the tree with the source message. The quality of a broadcasting algorithm with advice is measured by its competitive ratio: the worst case ratio, taken over n-node trees, between the time of this algorithm and the optimal broadcasting time in the given tree. Our goal is to find a trade-off between the size of advice and the best competitive ratio of a broadcasting algorithm for n-node trees. We establish such a trade-off with an approximation factor of O(n (epsilon) ), for an arbitrarily small positive constant epsilon. This is the first communication problem for which a trade-off between the size of advice and the efficiency of the solution is shown for arbitrary size of advice.", "paper_title": "Trade-offs Between the Size of Advice and Broadcasting Time in Trees", "paper_id": "WOS:000290267000001"}