{"auto_keywords": [{"score": 0.036044553077608385, "phrase": "variation_detection"}, {"score": 0.028720142570832406, "phrase": "varid"}, {"score": 0.00481495049065317, "phrase": "color-space_and_letter-space_platforms"}, {"score": 0.0043703658695579085, "phrase": "genomic_variation"}, {"score": 0.004247560712327667, "phrase": "different_sequencing_biases"}, {"score": 0.004199406257273994, "phrase": "error_rates"}, {"score": 0.0038772110657592854, "phrase": "base_calls"}, {"score": 0.003193606324727067, "phrase": "color_space_data"}, {"score": 0.0026302120935562568, "phrase": "hidden_markov_model"}, {"score": 0.002570817338292482, "phrase": "forward-backward_algorithm"}, {"score": 0.0022802596433757565, "phrase": "ab_solid_toolset"}, {"score": 0.002216054733102974, "phrase": "color-space_data"}, {"score": 0.0021049977753042253, "phrase": "letter-_and_color-space_reads"}], "paper_keywords": [""], "paper_abstract": "Motivation: High-throughput sequencing (HTS) technologies are transforming the study of genomic variation. The various HTS technologies have different sequencing biases and error rates, and while most HTS technologies sequence the residues of the genome directly, generating base calls for each position, the Applied Biosystem's SOLiD platform generates dibase-coded (color space) sequences. While combining data from the various platforms should increase the accuracy of variation detection, to date there are only a few tools that can identify variants from color space data, and none that can analyze color space and regular (letter space) data together. Results: We present VARiD-a probabilistic method for variation detection from both letter- and color-space reads simultaneously. VARiD is based on a hidden Markov model and uses the forward-backward algorithm to accurately identify heterozygous, homozygous and tri-allelic SNPs, as well as micro-indels. Our analysis shows that VARiD performs better than the AB SOLiD toolset at detecting variants from color-space data alone, and improves the calls dramatically when letter- and color-space reads are combined. Availability: The toolset is freely available at http://compbio.cs.utoronto.ca/varid Contact: varid@cs.toronto.edu", "paper_title": "VARiD: A variation detection framework for color-space and letter-space platforms", "paper_id": "WOS:000278689000042"}