{"auto_keywords": [{"score": 0.04613720801285569, "phrase": "usability_flaws"}, {"score": 0.010612387000973441, "phrase": "medication-related_alerting_functions"}, {"score": 0.004511297689862029, "phrase": "first_step"}, {"score": 0.004255807517348647, "phrase": "systematic_qualitative_review"}, {"score": 0.0038133343544929648, "phrase": "data_extraction"}, {"score": 0.0037872535287644103, "phrase": "data_analysis"}, {"score": 0.0037100724714897084, "phrase": "meaningful_semantic_units"}, {"score": 0.0036220063770882275, "phrase": "main_data"}, {"score": 0.003536023290715607, "phrase": "qualitative_methods"}, {"score": 0.0034878064529259424, "phrase": "general_usability_heuristics"}, {"score": 0.0034402448248944434, "phrase": "inductive_process"}, {"score": 0.003168147459025106, "phrase": "eligibility_criteria"}, {"score": 0.002907504959509132, "phrase": "general_usability_principles"}, {"score": 0.002631832840403278, "phrase": "low_signal-to-noise_ratio"}, {"score": 0.002551700779294785, "phrase": "presentation_mode"}, {"score": 0.0025168721570288295, "phrase": "missing_alert_features"}, {"score": 0.002482517733720377, "phrase": "control_distribution"}, {"score": 0.002201187194326849, "phrase": "evaluation_process"}, {"score": 0.0021711323811863963, "phrase": "evidence-based_usability_design_principles"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["User-computer interface", " Human engineering", " Decision support systems", " Clinical", " Review", " Systematic", " Usability", " Alerting functions"], "paper_abstract": "Introduction: Medication-related alerting functions may include usability flaws that limit their optimal use. A first step on the way to preventing usability flaws is to understand the characteristics of these usability flaws. This systematic qualitative review aims to analyze the type of usability flaws found in medication-related alerting functions. Method: Papers were searched via PubMed, Scopus and Ergonomics Abstracts databases, along with references lists. Paper selection, data extraction and data analysis was performed by two to three Human Factors experts. Meaningful semantic units representing instances of usability flaws were the main data extracted. They were analyzed through qualitative methods: categorization following general usability heuristics and through an inductive process for the flaws specific to medication-related alerting functions. Main results: From the 6380 papers initially identified, 26 met all eligibility criteria. The analysis of the papers identified a total of 168 instances of usability flaws that could be classified into 13 categories of usability flaws representing either violations of general usability principles (i.e. they could be found in any system, e.g. guidance and workload issues) or infractions specific to medication-related alerting functions. The latter refer to issues of low signal-to-noise ratio, incomplete content of alerts, transparency, presentation mode and timing, missing alert features, tasks and control distribution. Main conclusion: The list of 168 instances of usability flaws of medication-related alerting functions provides a source of knowledge for checking the usability of medication-related alerting functions during their design and evaluation process and ultimately constructs evidence-based usability design principles for these functions. (C) 2015 Elsevier Inc. All rights reserved.", "paper_title": "Usability flaws of medication-related alerting functions: A systematic qualitative review", "paper_id": "WOS:000356564700025"}