{"auto_keywords": [{"score": 0.04511623972752651, "phrase": "vision_loss"}, {"score": 0.031194902663221332, "phrase": "screening_interval"}, {"score": 0.02322730111336099, "phrase": "diabetic_retinopathy"}, {"score": 0.020441092333548756, "phrase": "veterans"}, {"score": 0.00426344619171077, "phrase": "simulated_cohort"}, {"score": 0.004003348169928476, "phrase": "potential_interventions"}, {"score": 0.0038227112550093863, "phrase": "controlled_trial"}, {"score": 0.003589404014552974, "phrase": "abstracted_data"}, {"score": 0.0035444736871640147, "phrase": "retrospective_cohort"}, {"score": 0.003427380591229386, "phrase": "discrete_event_simulation"}, {"score": 0.00325893630416945, "phrase": "dr."}, {"score": 0.0031912018800904314, "phrase": "varying_screening_policies"}, {"score": 0.003138030910104256, "phrase": "simulated_population"}, {"score": 0.00299632091372281, "phrase": "diabetic_retinopathy_associated_vision_loss"}, {"score": 0.002873038567884343, "phrase": "five_years"}, {"score": 0.002358050109031317, "phrase": "diabetic_patients"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Diabetic retinopathy", " Agent based modeling", " Discrete event simulation", " Diabetic eye screen"], "paper_abstract": "Objective: To examine the effect of changes to screening interval on the incidence of vision loss in a simulated cohort of Veterans with diabetic retinopathy (DR). This simulation allows us to examine potential interventions without putting patients at risk. Methods: Simulated randomized controlled trial. We develop a hybrid agent-based/discrete event simulation which incorporates a population of simulated Veterans - using abstracted data from a retrospective cohort of real-world diabetic Veterans - with a discrete event simulation (DES) eye clinic at which it seeks treatment for DR. We compare vision loss under varying screening policies, in a simulated population of 5000 Veterans over 50 independent ten-year simulation runs for each group. Results: Diabetic Retinopathy associated vision loss increased as the screening interval was extended from one to five years (p < 0.0001). This increase was concentrated in the third year of the screening interval (p < 0.01). There was no increase in vision loss associated with increasing the screening interval from one year to two years (p=0.98). Conclusions: Increasing the screening interval for diabetic patients who have not yet developed diabetic retinopathy from 1 to 2 years appears safe, while increasing the interval to 3 years heightens risk for vision loss. Published by Elsevier Ltd.", "paper_title": "Sensitivity of diabetic retinopathy associated vision loss to screening interval in an agent-based/discrete event simulation model", "paper_id": "WOS:000347745500002"}