{"auto_keywords": [{"score": 0.047569781329700335, "phrase": "distributed_system"}, {"score": 0.00481495049065317, "phrase": "problematic_message_sequences"}, {"score": 0.004721711709176679, "phrase": "distributed_systems"}, {"score": 0.0034020946201397057, "phrase": "right_combination"}, {"score": 0.003319830633865628, "phrase": "faulty_behavior"}, {"score": 0.002966230968271199, "phrase": "specific_message_sequences"}, {"score": 0.0026762874092443197, "phrase": "test_driver"}, {"score": 0.002598764579760562, "phrase": "message_sequences"}, {"score": 0.0024264776194357993, "phrase": "dynamic_symbolic_execution"}, {"score": 0.002321787726770895, "phrase": "generated_tests"}, {"score": 0.002287902310873394, "phrase": "problematic_frequencies"}, {"score": 0.0021784745589727246, "phrase": "popular_robotic_operating_system"}, {"score": 0.0021049977753042253, "phrase": "increasing_complexity"}], "paper_keywords": ["Verification", " Reliability", " Distributed Systems", " Test Case Generation", " Message Frequencies"], "paper_abstract": "Testing the components of a distributed system is challenging as it requires consideration of not just the state of a component, but also the sequence of messages it may receive from the rest of the system or the environment. Such messages may vary in type and content, and more particularly, in the frequency at which they are generated. All of these factors, in the right combination, may lead to faulty behavior. In this paper we present an approach to address these challenges by systematically analyzing a component in a distributed system to identify specific message sequences and frequencies at which a failure can occur. At the core of the analysis is the generation of a test driver that defines the space of message sequences to be generated, the exploration of that space through the use of dynamic symbolic execution, and the timing and analysis of the generated tests to identify problematic frequencies. We implemented our approach in the context of the popular Robotic Operating System and investigated its application to three systems of increasing complexity.", "paper_title": "Detecting Problematic Message Sequences and Frequencies in Distributed Systems", "paper_id": "WOS:000311296200053"}