{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "explanatory_design_theory"}, {"score": 0.019545433553611314, "phrase": "design_theory"}, {"score": 0.009026619835686913, "phrase": "information_systems"}, {"score": 0.004573842508130535, "phrase": "increasing_attention"}, {"score": 0.004162602203448056, "phrase": "design_theory_concept"}, {"score": 0.003988055287053139, "phrase": "complex_and_elaborate_structure"}, {"score": 0.003629291866667764, "phrase": "design_science_theories"}, {"score": 0.003537155405923517, "phrase": "\"required\"_elements"}, {"score": 0.003218823621926739, "phrase": "notable_design_writing"}, {"score": 0.0031102878400698143, "phrase": "cognitive_psychology"}, {"score": 0.0030837288356760973, "phrase": "computer_science"}, {"score": 0.002665305036900055, "phrase": "functional_explanation"}, {"score": 0.002373767863833987, "phrase": "complete_design_theory"}, {"score": 0.0023333715029833007, "phrase": "solution_components"}], "paper_keywords": ["Design theory", " Design science", " Design research", " Research method"], "paper_abstract": "Design, design research, and design science have received increasing attention lately. This has led to a more scientific focus on design that then has made it timely to reconsider our definitions of the design theory concept. Many scholars in Information Systems assume a design theory requires a complex and elaborate structure. While this structure has appeal for its completeness and complexity, it has led scholars to criticize simplicity and elegance in design science theories that fail to demonstrate the \"required\" elements. Such criticisms lead to questions about whether design theory can be considered theory at all. Based on a study of notable design writing in architecture, finance, management, cognitive psychology, computer science as well as information systems and the philosophy of science, the authors demonstrate that design theory consists of two parts: a design practice theory and an explanatory design theory. An explanatory design theory provides a functional explanation as to why a solution has certain components in terms of the requirements stated in the design. For explanatory design theory, only two elements are essentially necessary for a complete design theory: requirements and solution components. The argument is logical as well as empirical; the authors give examples of design theory drawing from IS as well as other design-related fields show how design theory can be both simple and complete. The paper concludes with a proposal for explanatory design theory.", "paper_title": "Explanatory Design Theory", "paper_id": "WOS:000285111300002"}