{"auto_keywords": [{"score": 0.045161348664357115, "phrase": "ibd"}, {"score": 0.00481495049065317, "phrase": "genome-wide_association_studies"}, {"score": 0.004161553532799662, "phrase": "association_testing"}, {"score": 0.004116823963855969, "phrase": "genetic_association_studies"}, {"score": 0.004007083686875716, "phrase": "ibd_association_testing_strategy"}, {"score": 0.003900257249255497, "phrase": "excessive_ibd"}, {"score": 0.0034629341517018438, "phrase": "large_number"}, {"score": 0.003334309053314909, "phrase": "limited_number"}, {"score": 0.0030911702059432224, "phrase": "associated_regions"}, {"score": 0.002656650588033728, "phrase": "new_pairwise_method"}, {"score": 0.002530359917257626, "phrase": "importance_sampling"}, {"score": 0.0024231382864800173, "phrase": "extremely_small_p-values"}, {"score": 0.0023970487263732737, "phrase": "fast-pairwise_method"}, {"score": 0.0023079225317714815, "phrase": "genome-wide_scan"}, {"score": 0.0021049977753042253, "phrase": "known_human_leukocyte_antigen_gene"}], "paper_keywords": [""], "paper_abstract": "Motivation: Recently, investigators have proposed state-of-the-art Identity-by-descent (IBD) mapping methods to detect IBD segments between purportedly unrelated individuals. The IBD information can then be used for association testing in genetic association studies. One approach for this IBD association testing strategy is to test for excessive IBD between pairs of cases ('pairwise method'). However, this approach is inefficient because it requires a large number of permutations. Moreover, a limited number of permutations define a lower bound for P-values, which makes fine-mapping of associated regions difficult because, in practice, a much larger genomic region is implicated than the region that is actually associated. Results: In this article, we introduce a new pairwise method 'Fast-Pairwise'. Fast-Pairwise uses importance sampling to improve efficiency and enable approximation of extremely small P-values. Fast-Pairwise method takes only days to complete a genome-wide scan. In the application to the WTCCC type 1 diabetes data, Fast-Pairwise successfully fine-maps a known human leukocyte antigen gene that is known to cause the disease.", "paper_title": "Fast pairwise IBD association testing in genome-wide association studies", "paper_id": "WOS:000330432500008"}