{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "network_effect"}, {"score": 0.04593635631868281, "phrase": "social_networks"}, {"score": 0.008566294581402853, "phrase": "high_volume"}, {"score": 0.004634552430216732, "phrase": "world_wide_web"}, {"score": 0.004104132253183181, "phrase": "internet_auctions"}, {"score": 0.0039778030796649416, "phrase": "online_auctions"}, {"score": 0.003922907208353323, "phrase": "successful_implementation"}, {"score": 0.003749654338704576, "phrase": "auction_sites"}, {"score": 0.0034736499231079083, "phrase": "even_greater_polarization"}, {"score": 0.003390149669470349, "phrase": "particular_site"}, {"score": 0.0032743220621043023, "phrase": "greater_use"}, {"score": 0.003054367741379269, "phrase": "\"network_effect"}, {"score": 0.002991300390411948, "phrase": "interaction-centric_applications"}, {"score": 0.0028195727965553367, "phrase": "overall_network"}, {"score": 0.002648448458159033, "phrase": "markov_model"}, {"score": 0.0025490131630603757, "phrase": "web_applications"}, {"score": 0.0023043558058824572, "phrase": "social_networking_site"}, {"score": 0.0021871503075921537, "phrase": "tremendous_power"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Auctions", " Network effect"], "paper_abstract": "In recent years, the proliferation of the world wide web has lead to an increase in a number of applications such as search, social networks and auctions, whose success depends critically upon the number of users of that service. Two examples of such applications are internet auctions and social networks. One of the characteristics of online auctions is that a successful implementation requires a high volume of buyers and sellers at its website. Consequently, auction sites which have a high volume of traffic have an advantage over those in which the volume is limited. This results in even greater polarization of buyers and sellers towards a particular site. The same is true for social networks in which greater use of a given social network increases the use from other participants on the network. This is often referred to as the \"network effect'' in a variety of interaction-centric applications in networks. While this effect has qualitatively been known to increase the value of the overall network, its effect has never been modeled or studied rigorously. In this paper, we construct a Markov model to analyze the network effect in the case of two important classes of web applications. These correspond to auctions and social networks. We show that the network effect is very powerful and can result in a situation in which an auction or a social networking site can quickly overwhelm its competing sites. Thus, the results of this paper show the tremendous power of the network effect for Web 2.0 applications. (C) 2011 Elsevier B.V. All rights reserved.", "paper_title": "On the network effect in Web 2.0 applications", "paper_id": "WOS:000302786100006"}