{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "optimal_sampling_lattices"}, {"score": 0.004580550308652044, "phrase": "single_relaxation_time"}, {"score": 0.004555217356295278, "phrase": "lattice-boltzmann_method"}, {"score": 0.00392153537973826, "phrase": "bcc_lattice"}, {"score": 0.00370981613076245, "phrase": "velocity_space"}, {"score": 0.0036485497734171294, "phrase": "continuous_boltzmann_equation"}, {"score": 0.0034324073240680213, "phrase": "comparable_spatial_discretization"}, {"score": 0.0030208364972341096, "phrase": "significant_cost_savings"}, {"score": 0.0029544572689681934, "phrase": "comparable_accuracy"}, {"score": 0.0027333769432036905, "phrase": "visualization_techniques"}, {"score": 0.0026584843838039166, "phrase": "line-integral_convolution"}, {"score": 0.0021049977753042253, "phrase": "reduced_computational_cost"}], "paper_keywords": ["Visual simulation", " animation", " physically based modeling", " BCC", " volume modeling", " vector field data", " flow visualization", " optimal regular sampling"], "paper_abstract": "In this paper, we extend the single relaxation time Lattice-Boltzmann Method (LBM) to the 3D body-centered cubic (BCC) lattice. We show that the D3bQ15 lattice defined by a 15 neighborhood connectivity of the BCC lattice is not only capable of more accurately discretizing the velocity space of the continuous Boltzmann equation as compared to the D3Q15 Cartesian lattice, it also achieves a comparable spatial discretization with 30 percent less samples. We validate the accuracy of our proposed lattice by investigating its performance on the 3D lid-driven cavity flow problem and show that the D3bQ15 lattice offers significant cost savings while maintaining a comparable accuracy. We demonstrate the efficiency of our method and the impact on graphics and visualization techniques via the application of line-integral convolution on 2D slices as well as the extraction of streamlines of the 3D flow. We further study the benefits of our proposed lattice by applying it to the problem of simulating smoke and show that the D3bQ15 lattice yields more detail and turbulence at a reduced computational cost.", "paper_title": "The Lattice-Boltzmann Method on Optimal Sampling Lattices", "paper_id": "WOS:000265828400010"}