{"auto_keywords": [{"score": 0.04026633466753737, "phrase": "backseat_driving_technique"}, {"score": 0.00481495049065317, "phrase": "-car_navigation_display"}, {"score": 0.0047130539259566465, "phrase": "new_vehicular_technologies"}, {"score": 0.004675398507423721, "phrase": "in-car_navigation_systems"}, {"score": 0.0043496956926564615, "phrase": "attentional_demand"}, {"score": 0.00426900754050533, "phrase": "increasing_importance"}, {"score": 0.004134137523409649, "phrase": "driver's_attentional_cost"}, {"score": 0.004101088357088207, "phrase": "navigational_displays"}, {"score": 0.004035777314816881, "phrase": "accurate_evaluation_methods"}, {"score": 0.003939748053452577, "phrase": "realistic_environments"}, {"score": 0.0037544644262310525, "phrase": "in-car_displays"}, {"score": 0.0036749275625321855, "phrase": "real_vehicle"}, {"score": 0.0036357909244344486, "phrase": "real_road"}, {"score": 0.00350205447167804, "phrase": "research_questions"}, {"score": 0.0032753168662834516, "phrase": "detailed_and_fine-grained_measures"}, {"score": 0.003014381456564809, "phrase": "full_replacement"}, {"score": 0.0029982770062678926, "phrase": "high-realism_driving_simulators"}, {"score": 0.0029504765287722465, "phrase": "new_approach"}, {"score": 0.002693611989967953, "phrase": "car_navigation"}, {"score": 0.002664898250459919, "phrase": "move"}, {"score": 0.0026153813016953917, "phrase": "new_questions"}, {"score": 0.002525843523034335, "phrase": "previous_laboratory_studies"}, {"score": 0.0024789041373261306, "phrase": "study_measures"}, {"score": 0.002381229349102477, "phrase": "safety_concerns"}, {"score": 0.0023058614702473877, "phrase": "real-world_stimulus"}, {"score": 0.0022630008787375435, "phrase": "real_route"}, {"score": 0.002238866955912704, "phrase": "navigation_error_rate"}, {"score": 0.0021049977753042253, "phrase": "total_display_fixation_time"}], "paper_keywords": [""], "paper_abstract": "Recently drivers have greatly benefited from new vehicular technologies such as in-car navigation systems, but at the same time they can be easily distracted from those technologies. Consequently, creating displays that balance the communication of information with the attentional demand imposed on the driver is of increasing importance. A set of research has been conducted to minimize the driver's attentional cost toward the navigational displays while driving. However, accurate evaluation methods to assess the effects of these displays in realistic environments are not yet available. This article introduces the backseat driving technique for high-fidelity, safe, and inexpensive evaluation of interaction with in-car displays. This technique makes use of a real vehicle driving on a real road. As a result it allows for the exploration of some types of research questions using audio, visual, and kinesthetic stimulus at least equal in fidelity to very high-end driving simulators, without requiring such a specialized and expensive facility. Further, it allows for the employment of detailed and fine-grained measures of attentional demand, which cannot be safely used with subjects who are actually driving. Although the backseat driving technique can address only some types of questions and so is not a full replacement for high-realism driving simulators, it may offer a new approach, which augments laboratory, simulator, and real driving for many studies. As a part of the work presented here, the backseat driving technique is used to evaluate a previously developed in-car navigation display-the MOVE system. The technique allowed for new questions to be asked, which were not able to be considered in previous laboratory studies, and for the use of study measures that were only previously able to be used in the laboratory due to driving safety concerns. Specifically, the display was shown to work well when real-world stimulus are used to navigate along a real route, reducing the navigation error rate nearly threefold, and up to sixfold when compared to displays providing more or less contextual information. In addition the display was shown to cut total display fixation time (which is time spent looking away from the road) almost in half in both cases.", "paper_title": "Use of the Backseat Driving Technique in Evaluation of a Perceptually Optimized In-Car Navigation Display", "paper_id": "WOS:000349841800005"}