{"auto_keywords": [{"score": 0.04353040808935283, "phrase": "twin_diffie-hellman_problem"}, {"score": 0.013893006581451562, "phrase": "diffie-hellman_problem"}, {"score": 0.01314364605542139, "phrase": "ordinary_diffie-hellman_problem"}, {"score": 0.009376293278798065, "phrase": "new_variant"}, {"score": 0.00481495049065317, "phrase": "new_computational_problem"}, {"score": 0.004732790431662276, "phrase": "diffie-hellman"}, {"score": 0.0036710872046569532, "phrase": "decision_oracle"}, {"score": 0.003130077012135034, "phrase": "decision_oracle_queries"}, {"score": 0.0030109772626153797, "phrase": "corresponding_discrete_logarithms"}, {"score": 0.0028346293790895024, "phrase": "elgamal_encryption"}, {"score": 0.002703327151461985, "phrase": "random_oracle_model"}, {"score": 0.0024692712830679626, "phrase": "diffie"}, {"score": 0.002448061472257196, "phrase": "hellman's_non-interactive_key_exchange_protocol"}, {"score": 0.002385521257413036, "phrase": "cramer-shoup"}, {"score": 0.002304606411453748, "phrase": "standard_model"}, {"score": 0.0022457226013538343, "phrase": "boneh-franklin_identity-based_encryption"}, {"score": 0.0021416404045850224, "phrase": "password-authenticated_key_exchange_protocol"}, {"score": 0.0021232408452384606, "phrase": "abdalla"}, {"score": 0.00210499793205176, "phrase": "pointcheval"}], "paper_keywords": [""], "paper_abstract": "We propose a new computational problem called the twin Diffie-Hellman problem. This problem is closely related to the usual (computational) Diffie-Hellman problem and can be used in many of the same cryptographic constructions that are based on the Diffie-Hellman problem. Moreover, the twin Diffie-Hellman problem is at least as hard as the ordinary Diffie-Hellman problem. However, we are able to show that the twin Diffie-Hellman problem remains hard, even in the presence of a decision oracle that recognizes solutions to the problem-this is a feature not enjoyed by the Diffie-Hellman problem, in general. Specifically, we show how to build a certain \"trapdoor test\" that allows us to effectively answer decision oracle queries for the twin Diffie-Hellman problem without knowing any of the corresponding discrete logarithms. Our new techniques have many applications. As one such application, we present a new variant of ElGamal encryption with very short ciphertexts, and with a very simple and tight security proof, in the random oracle model, under the assumption that the ordinary Diffie-Hellman problem is hard. We present several other applications as well, including a new variant of Diffie and Hellman's non-interactive key exchange protocol; a new variant of Cramer-Shoup encryption, with a very simple proof in the standard model; a new variant of Boneh-Franklin identity-based encryption, with very short ciphertexts; a more robust version of a password-authenticated key exchange protocol of Abdalla and Pointcheval.", "paper_title": "The Twin Diffie-Hellman Problem and Applications", "paper_id": "WOS:000268492600002"}