{"auto_keywords": [{"score": 0.035637015694631076, "phrase": "elementary_components"}, {"score": 0.015719716506582538, "phrase": "hierarchical_architectures"}, {"score": 0.009486483975773334, "phrase": "manufacturing_process"}, {"score": 0.0047517225918491226, "phrase": "information_technology"}, {"score": 0.004689321062844586, "phrase": "notable_examples"}, {"score": 0.00461246494886034, "phrase": "computer_files"}, {"score": 0.004506968388996092, "phrase": "program_menus"}, {"score": 0.004163172790791119, "phrase": "optimal_configuration"}, {"score": 0.0033355353594739707, "phrase": "intermediate_products"}, {"score": 0.0033025823350563087, "phrase": "target_product"}, {"score": 0.003091036449708673, "phrase": "manufacturing_turnaround"}, {"score": 0.002921879966280267, "phrase": "turnaround_time"}, {"score": 0.0024842242921857705, "phrase": "turnaround_formula"}, {"score": 0.0023326907270271153, "phrase": "optimal_tree"}, {"score": 0.002294369814584028, "phrase": "ideal_number"}, {"score": 0.0021330830123432614, "phrase": "manufacturing_environment"}, {"score": 0.0021049977753042253, "phrase": "ideal_assembly_size"}], "paper_keywords": [""], "paper_abstract": "Many areas of information technology implement hierarchical architectures. Notable examples are the organization of computer files in folders, the arrangement of program menus, and the distribution of messages from a -source to its clients. In each case, one must address the issue of the optimal configuration of the hierarchy: Assuming a given number of items, how to choose optimally the number of levels in the hierarchy (and thus the number of items at each level). Without loss of generality, we formalize this problem in the domain of assembly or manufacturing. We consider the process of manufacturing a product from a given number of elementary components. By assembling intermediate products, the target product can be manufactured in a variety of processes, each modeled by a tree. We are interested in manufacturing turnaround: the time between receiving an order at the root and its completion. We express the turnaround time of each manufacturing process (tree) with a formula that incorporates three parameters: the time required to create elementary components, the time required to assemble a product from its components and the time required to deliver the product to its procurer (another manufacturer). We show that this turnaround formula is optimized in a manufacturing process that corresponds to a perfect (or nearly perfect) tree. Somewhat surprisingly, the degree of the optimal tree (i.e., the ideal number of components in each sub-assembly) is shown to be independent of the number of elementary components, suggesting that in each manufacturing environment there is an ideal assembly size, which is optimal for the manufacturing of products of any scale.", "paper_title": "How deep should it be? On the optimality of hierarchical architectures", "paper_id": "WOS:000239450400023"}