{"auto_keywords": [{"score": 0.04783820101909737, "phrase": "service-oriented_computing"}, {"score": 0.00481495049065317, "phrase": "formal_foundations"}, {"score": 0.0044277810648955624, "phrase": "recent_theoretical_advancements"}, {"score": 0.004348936976349555, "phrase": "algebraic_structures"}, {"score": 0.00374399358035391, "phrase": "logical_representations"}, {"score": 0.0034426417353349567, "phrase": "operational_semantics"}, {"score": 0.0033812801309408514, "phrase": "conventional_logic_programming"}, {"score": 0.0031465436619697385, "phrase": "static_and_dynamic_aspects"}, {"score": 0.002981216610222911, "phrase": "strong_analogy"}, {"score": 0.0023451553255837317, "phrase": "external_services"}, {"score": 0.0022758279600841014, "phrase": "service_queries"}, {"score": 0.0021049977753042253, "phrase": "service-oriented_derivatives"}], "paper_keywords": ["Logic programming", " Institution theory", " Service-oriented computing", " Orchestration schemes", " Service discovery and binding"], "paper_abstract": "We develop formal foundations for notions and mechanisms needed to support service-oriented computing. Our work builds on recent theoretical advancements in the algebraic structures that capture the way services are orchestrated and in the processes that formalize the discovery and binding of services to given client applications by means of logical representations of required and provided services. We show how the denotational and the operational semantics specific to conventional logic programming can be generalized using the theory of institutions to address both static and dynamic aspects of service-oriented computing. Our results rely upon a strong analogy between the discovery of a service that can be bound to an application and the search for a clause that can be used for computing an answer to a query; they explore the manner in which requests for external services can be described as service queries, and explain how the computation of their answers can be performed through service-oriented derivatives of unification and resolution, which characterize the binding of services and the reconfiguration of applications.", "paper_title": "SERVICE-ORIENTED LOGIC PROGRAMMING", "paper_id": "WOS:000365417600003"}