{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "preference_markets"}, {"score": 0.00816496515118916, "phrase": "partner_company"}, {"score": 0.004683073921949839, "phrase": "early_stage_technologies"}, {"score": 0.004219774794569897, "phrase": "early_stage_technology"}, {"score": 0.003217896008931311, "phrase": "seven_emerging_technologies"}, {"score": 0.0029602552900111407, "phrase": "even_a_simple_form"}, {"score": 0.0029193609786176632, "phrase": "additional_nonmonetary_play"}, {"score": 0.0028392545452904762, "phrase": "greater_price_convergence"}, {"score": 0.002742196991950893, "phrase": "final_market_prices"}, {"score": 0.0026118503041971976, "phrase": "costly_expert_panel"}, {"score": 0.002241087008892355, "phrase": "extended_applications"}, {"score": 0.002164432930854161, "phrase": "potentially_scalable_approach"}], "paper_keywords": ["convergence", " incentives", " information market", " market performance", " preference aggregation", " preference ranking market", " technology evaluation"], "paper_abstract": "In the work presented here, we develop and apply preference markets in evaluating early stage technology. Partnering with a Fortune 5 company, we developed and implemented two internal preference markets (field experiments). In both cases, nonmonetary (play money) incentives were utilized, but one market provided additional nonmonetary (play money) incentives. Working with the partner company, our investigation started with seven emerging technologies and expanded to a total of 17 emerging technologies. Our results suggest that even a simple form of additional nonmonetary play money incentive yielded greater price convergence, increased spread across final market prices, and greater consistency with a costly expert panel that was set up by the partner company. Based on the outcomes of our analyses, the partner company is investing in developing extended applications of preference markets as a potentially scalable approach for dealing with its ongoing and expanding strategic identification of promising emerging technologies.", "paper_title": "Design and Use of Preference Markets for Evaluation of Early Stage Technologies", "paper_id": "WOS:000274628500003"}