{"auto_keywords": [{"score": 0.03430889850360744, "phrase": "network_nodes"}, {"score": 0.03170410769033944, "phrase": "flexible_naming"}, {"score": 0.00481495049065317, "phrase": "identity-based_overlay_network_architecture"}, {"score": 0.0043793594257092805, "phrase": "node_model"}, {"score": 0.004223941453664225, "phrase": "multiple_attachment_points"}, {"score": 0.004074016501033133, "phrase": "current_internet"}, {"score": 0.003772793879444995, "phrase": "future_internet"}, {"score": 0.003688497722149817, "phrase": "new_architectures"}, {"score": 0.0034937647771945803, "phrase": "new_technologies"}, {"score": 0.0034467039994594065, "phrase": "cloud_computing"}, {"score": 0.0032794890195334513, "phrase": "finer_granularity"}, {"score": 0.0031773149810690494, "phrase": "huge_number"}, {"score": 0.002534179209111416, "phrase": "fine-grained_process-to-process_view"}, {"score": 0.0024220634963019114, "phrase": "multi-homing_support"}, {"score": 0.002367875199095903, "phrase": "integrated_discovery"}, {"score": 0.0023148964315569866, "phrase": "integrated_security_features"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Identity", " Overlay", " Network", " Architecture", " Future Internet"], "paper_abstract": "The Internet is continuously evolving from a static, host-based, uniquely attached node model to a mobile, host-free node model with the possibility of multiple attachment points to the network. However, the current Internet was not designed to support this type of workload because of its strict addressing mechanism. Thus, the Future Internet promotes the introduction of new architectures that provide the decoupling of identification and location. Moreover, new technologies, like cloud computing and Internet of Things, raise the necessity for a finer granularity of network nodes. Furthermore, the huge number of devices connected to the Internet and their finer granularity impose the necessity of flexible naming and, thus, integrated discovery mechanisms. In this paper we present an architecture that decouples the identification and location by using identities to identify the network nodes and moving from a host-to-host to a fine-grained process-to-process view of the network. Together with the mobility and multi-homing support, it also provides integrated discovery, flexible naming, and integrated security features. Finally, we analyze the architecture to discuss its performance and compare it with other (existing) approaches. (C) 2013 Elsevier B.V. All rights reserved.", "paper_title": "Beyond the separation of identifier and locator: Building an identity-based overlay network architecture for the Future Internet", "paper_id": "WOS:000321726900014"}