{"auto_keywords": [{"score": 0.02240480316276683, "phrase": "data_owner"}, {"score": 0.010515976468041012, "phrase": "hierarchical_cloud_data"}, {"score": 0.007921498368115138, "phrase": "verification_key_spread_problem"}, {"score": 0.006446474512734289, "phrase": "delegated_integrity_check"}, {"score": 0.005292997273674501, "phrase": "storage_server"}, {"score": 0.00481495049065317, "phrase": "integrity_check"}, {"score": 0.0047057084749407485, "phrase": "cloud_storage"}, {"score": 0.004138010495069077, "phrase": "authorized_users"}, {"score": 0.0038802832668554457, "phrase": "unauthorized_users"}, {"score": 0.0034118234596993836, "phrase": "effective_management"}, {"score": 0.0026373136897864763, "phrase": "personal_health_records"}, {"score": 0.0024956789310376635, "phrase": "first_scheme"}, {"score": 0.002427732996314194, "phrase": "data_possession"}, {"score": 0.002361632539339945, "phrase": "second_scheme"}, {"score": 0.002297327670408112, "phrase": "data_retrievability"}, {"score": 0.0021049977753042253, "phrase": "random_oracle_model"}], "paper_keywords": ["Delegated provable data possession", " delegated proofs of retrievability", " proxy re-encryption"], "paper_abstract": "In cloud storage, a data owner can store his data in a cloud and authorize some users to access his data. Since the data are outsourced to the cloud, the authorized users should check the data to assure integrity. The data owner does not allow unauthorized users to check integrity of his data. There are many private and public integrity check schemes. Nevertheless, this paper concerns the verification key spread problem. Delegated integrity check deals with the verification key spread problem and provides effective management of verifiers. A data owner can delegate a verifier to check his data and revoke the right of the verifier later. The verifier cannot re-delegate his integrity check capability to someone else. Delegated integrity check guarantees that only the delegated verifier can check integrity of data. This paper provides the model of delegated integrity check, an application scenario of personal health records, and two delegated integrity check schemes for hierarchical cloud data. The first scheme allows a verifier to check data possession of a storage server. The second scheme allows a verifier to check data retrievability from a storage server. The schemes achieve proof unforgeability, proof indistinguishability and delegation key unforgeability in the random oracle model.", "paper_title": "Delegated integrity check for hierarchical cloud data", "paper_id": "WOS:000364176400002"}