{"auto_keywords": [{"score": 0.0436538729733707, "phrase": "six-question_technique"}, {"score": 0.03357741313601328, "phrase": "cps_process"}, {"score": 0.015719716506582538, "phrase": "creative_problem"}, {"score": 0.013041099783917749, "phrase": "framework_procedure"}, {"score": 0.01294389971292814, "phrase": "mcdm"}, {"score": 0.010299293992926372, "phrase": "mcdm_methods"}, {"score": 0.0096627562439731, "phrase": "criteria_weights"}, {"score": 0.008963615150840397, "phrase": "creative_approaches"}, {"score": 0.008440591740811323, "phrase": "typically_analytical_steps"}, {"score": 0.004760765880314089, "phrase": "purpose_-_the_purpose"}, {"score": 0.0046192222897398685, "phrase": "adapted_model"}, {"score": 0.004062937864702115, "phrase": "criteria's_importance"}, {"score": 0.003882970272082245, "phrase": "dialectical_systems_theory's_guidelines"}, {"score": 0.003546513036085932, "phrase": "creative_qualitative_techniques"}, {"score": 0.0032884384364324395, "phrase": "prescriptive_approach"}, {"score": 0.0029029166356887392, "phrase": "choquet"}, {"score": 0.0026813808976594183, "phrase": "merely_problem_definitions"}, {"score": 0.0023938516706864775, "phrase": "mutual_assistance"}, {"score": 0.0023758152068732025, "phrase": "creative_and_decision-making_methods"}, {"score": 0.0021049977753042253, "phrase": "innovative_aspect"}], "paper_keywords": ["Problem solving", " Decision making", " Creativity", " Operational research", " Systemic thinking", " Information technology"], "paper_abstract": "Purpose - The purpose of this paper is to present the adapted model per phases of the creative problem solving (CPS) process, where multi-criteria decision making (MCDM) methods are used in the decision-making phase. Also, to adapt and complete the steps of the six-question technique, in order to establish the criteria's importance. Design/methodology/approach - The framework procedure of MCDM, together with the Dialectical Systems Theory's guidelines when solving complex problems has already been introduced. The procedure was well-verified in practice, but lacked the support of creative qualitative techniques in defining problems, and in generating and choosing alternatives. To eliminate this deficiency, in terms of prescriptive approach, the authors adapted the phases of the CPS process, where MCDM methods are used when choosing alternatives, and completed the steps of the six-question technique to establish the criteria weights. The discrete Choquet integral was used to consider interactions among criteria. Findings - The article shows that creative approaches are not limited to merely problem definitions and problem structuring. They can also be used in typically analytical steps in the framework procedure. Research limitations/implications - The completed and adapted phases of the CPS process can allow the mutual assistance of creative and decision-making methods when solving problems a step forward to holism. Practical implications - This article develops and introduces the use of the six-question technique, in the establishment of criteria weights. Originality/value - The innovative aspect of this article is that it adapts and completes the CPS process so that MCDM methods can be used when choosing alternatives. It extends the use of creative approaches to typically analytical steps of MCDM, where synergies and redundancies among criteria are considered.", "paper_title": "Multi-criteria decision making in creative problem solving", "paper_id": "WOS:000316432900005"}