{"auto_keywords": [{"score": 0.03791483171214045, "phrase": "markov_chain"}, {"score": 0.006009097205977101, "phrase": "cumulation_parameter"}, {"score": 0.00481495049065317, "phrase": "markov_chain_analysis_of_cumulative_step-size_adaptation"}, {"score": 0.00475382761232911, "phrase": "linear_constrained_problem"}, {"score": 0.004633888966463624, "phrase": "-evolution_strategy"}, {"score": 0.004402973626416765, "phrase": "linear_function"}, {"score": 0.004347057700479576, "phrase": "linear_constraint"}, {"score": 0.0037287578312533596, "phrase": "cumulative_step-size_adaptation"}, {"score": 0.0033232673019931206, "phrase": "large_numbers"}, {"score": 0.003157455511069507, "phrase": "desired_behavior"}, {"score": 0.003104038398386081, "phrase": "constant_step-size_case"}, {"score": 0.0028745946327439656, "phrase": "cumulative_step-size_adaptation_case"}, {"score": 0.002754516260621121, "phrase": "simplified_case"}, {"score": 0.002617007341172262, "phrase": "similar_results"}, {"score": 0.002372298201966367, "phrase": "geometric_divergence"}, {"score": 0.0021049977753042253, "phrase": "previous_studies"}], "paper_keywords": ["Continuous optimization", " evolution strategies", " CMA-ES", " cumulative step-size adaptation", " constrained problem"], "paper_abstract": "This paper analyzes a -Evolution Strategy, a randomized comparison-based adaptive search algorithm optimizing a linear function with a linear constraint. The algorithm uses resampling to handle the constraint. Two cases are investigated: first, the case where the step-size is constant, and second, the case where the step-size is adapted using cumulative step-size adaptation. We exhibit for each case a Markov chain describing the behavior of the algorithm. Stability of the chain implies, by applying a law of large numbers, either convergence or divergence of the algorithm. Divergence is the desired behavior. In the constant step-size case, we show stability of the Markov chain and prove the divergence of the algorithm. In the cumulative step-size adaptation case, we prove stability of the Markov chain in the simplified case where the cumulation parameter equals 1, and discuss steps to obtain similar results for the full (default) algorithm where the cumulation parameter is smaller than 1. The stability of the Markov chain allows us to deduce geometric divergence or convergence, depending on the dimension, constraint angle, population size, and damping parameter, at a rate that we estimate. Our results complement previous studies where stability was assumed.", "paper_title": "Markov Chain Analysis of Cumulative Step-Size Adaptation on a Linear Constrained Problem", "paper_id": "WOS:000367333600006"}