{"auto_keywords": [{"score": 0.0460041151292198, "phrase": "satisfying_assignments"}, {"score": 0.043619899290582846, "phrase": "constraint_language"}, {"score": 0.009957550107076012, "phrase": "approximation-preserving_reductions"}, {"score": 0.00481495049065317, "phrase": "approximation_trichotomy"}, {"score": 0.004657393640152439, "phrase": "trichotomy_theorem"}, {"score": 0.004333406378146173, "phrase": "boolean_csp_instance"}, {"score": 0.0035684266744407485, "phrase": "polynomial_time"}, {"score": 0.003265090934183249, "phrase": "post's_lattice"}, {"score": 0.002486987042061596, "phrase": "independent_sets"}, {"score": 0.002445865715873089, "phrase": "bipartite_graph"}, {"score": 0.0021763973978248005, "phrase": "fully_polynomial_randomised_approximation_scheme"}], "paper_keywords": ["Approximation algorithms", " Combinatorial enumeration", " Computational complexity", " Constraint satisfaction problems (CSPs)"], "paper_abstract": "We give a trichotomy theorem for the complexity of approximately counting the number of satisfying assignments of a Boolean CSP instance Such problems are parameterised by a constraint language specifying the relations that may be used in constraints If every relation in the constraint language is affine then the number of satisfying assignments can be exactly counted in polynomial time. Otherwise, if every relation in the constraint language is in the co-clone IM2 from Post's lattice, then the problem of counting satisfying assignments is complete with respect to approximation-preserving reductions for the complexity class #RH Pi(1) This means that the problem of approximately counting satisfying assignments of such a CSP instance is equivalent in complexity to several other known counting problems, including the problem of approximately counting the number of independent sets in a bipartite graph For every other fixed constraint language, the problem is complete for #P with respect to approximation-preserving reductions, meaning that there is no fully polynomial randomised approximation scheme for counting satisfying assignments unless NP = RP. (C) 2009 Elsevier Inc All rights reserved.", "paper_title": "An approximation trichotomy for Boolean #CSP", "paper_id": "WOS:000276825100006"}