{"auto_keywords": [{"score": 0.034219262865752616, "phrase": "europe"}, {"score": 0.00481495049065317, "phrase": "knowledge_maturing_activities"}, {"score": 0.00468476935399643, "phrase": "knowledge_work"}, {"score": 0.004504850679320975, "phrase": "supportive_information"}, {"score": 0.004469700997700534, "phrase": "communication_technology"}, {"score": 0.004264463695140275, "phrase": "previous_ethnographically_informed_study"}, {"score": 0.004005339423663657, "phrase": "goal-oriented_learning"}, {"score": 0.003958529104387973, "phrase": "collective_level"}, {"score": 0.0037915057447460133, "phrase": "current_state"}, {"score": 0.0034646205853140558, "phrase": "highest_potential"}, {"score": 0.003397362086358944, "phrase": "ict._quantitative"}, {"score": 0.0033708244679086265, "phrase": "qualitative_data"}, {"score": 0.0033183674218329904, "phrase": "telephone_interviews"}, {"score": 0.0027705505273051007, "phrase": "particular_knowledge"}, {"score": 0.0025816239578784067, "phrase": "rich_empirical_material"}, {"score": 0.002501835053002899, "phrase": "also_the_issues"}, {"score": 0.0021636476333109144, "phrase": "balanced_knowledge_strategy"}, {"score": 0.0021049977753042253, "phrase": "codification_strategy"}], "paper_keywords": ["Collaborative learning", " ICT-based support", " knowledge work", " knowledge management"], "paper_abstract": "The level of similarity of knowledge work across occupations and industries allows for the design of supportive information and communication technology (ICT) that can be widely used. In a previous ethnographically informed study, we identified activities that can be supported to increase knowledge maturing, conceptualized as goal-oriented learning on a collective level. The aim of this paper is to investigate the current state of support and success of these knowledge maturing activities and to contrast them with their perceived importance, to identify those which have the highest potential for being supported by ICT. Quantitative and qualitative data were collected through telephone interviews with representatives from 126 organizations throughout Europe in a sample stratified according to size, sector, and knowledge-intensity. The activities that appear to be most promising are \"reflecting on and refining work practices and processes,\" \"finding people with particular knowledge or expertise,\" as well as \" assessing, verifying, and rating information.\" Rich empirical material about how these activities are performed and also the issues that emerged and need to be managed were collected. Three clusters of organizations were identified: best performing organizations, people- and awareness-oriented organizations, and hesitant formalists. It was found that a balanced knowledge strategy that leaned toward personalization outperformed a codification strategy.", "paper_title": "Organizational Learning from the Perspective of Knowledge Maturing Activities", "paper_id": "WOS:000319877300006"}