{"auto_keywords": [{"score": 0.04719401618022392, "phrase": "screen_media_entertainment"}, {"score": 0.04050682946398321, "phrase": "new_form"}, {"score": 0.004560438999891081, "phrase": "interactive_forms"}, {"score": 0.00440394242852293, "phrase": "interactive_narrativity"}, {"score": 0.003950453462399077, "phrase": "computing_technology"}, {"score": 0.003756021561809324, "phrase": "commercial_distribution"}, {"score": 0.0035297609635321203, "phrase": "current_context"}, {"score": 0.0035024506353894644, "phrase": "screen_media"}, {"score": 0.0034484600692786097, "phrase": "clear_signs"}, {"score": 0.0033690254452595865, "phrase": "interactive_tv_narratives"}, {"score": 0.003093054709625219, "phrase": "public_broadcasters"}, {"score": 0.003033546013625887, "phrase": "potential_and_richness"}, {"score": 0.002917931350071647, "phrase": "new_technological_capabilities"}, {"score": 0.002828611294209297, "phrase": "essential_technological_requirements"}, {"score": 0.002742017872865778, "phrase": "final_part"}, {"score": 0.002668420182908979, "phrase": "shapeshifting_media_technology"}, {"score": 0.0024688196796198766, "phrase": "creative_ends"}, {"score": 0.0024118962715000197, "phrase": "interactive_tv_narrativity"}, {"score": 0.0021049977753042253, "phrase": "end_users"}], "paper_keywords": ["Design", " Experimentation", " Human Factors", " Languages", " Theory", " Interactive", " nonlinear", " television", " media", " screen media", " narrativity", " computational narrativity", " digital storytelling", " entertainment", " shapeshifting"], "paper_abstract": "This article is motivated by the question whether television should do more than simply offer interactive services alongside ( and separately from) traditional linear programs, in the context of its dominance being seriously challenged and threatened by interactive forms of screen media entertainment. It suggests: yes. Interactive narrativity, that is, the ability to interact with ( and influence) stories whilst they are being told, represents one clear development path for interactive television. The capabilities of computing technology are ripe for exploring this new form of storytelling, from creation to commercial distribution. The article starts by looking at the relationship between narrativity and interactivity in the current context of screen media, and identifies clear signs of interest from certain European public broadcasters in interactive TV narratives. It then presents in detail four recent experimental interactive TV productions in the genres of drama, news, and documentary, developed in collaboration with public broadcasters, which illustrate the potential and richness of this new form of storytelling, but also highlight new technological capabilities necessary for such productions. A number of essential technological requirements are then discussed in more detail in the final part. The article suggests that the ShapeShifting Media Technology, employed in the implementation of the four productions, has made significant advances both at the technological and the creative ends in supporting the development of interactive TV narrativity, but, however, that further developments are required before being able to answer questions such as \"Would end users want such a form of screen media entertainment?\" and \"Would it be effective for both end users and producers?\"", "paper_title": "Interactive TV Narratives: Opportunities, Progress, and Challenges", "paper_id": "WOS:000261155300002"}