{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "mobile_phone_conversations"}, {"score": 0.004667149874736771, "phrase": "'need-to-listen'_effect"}, {"score": 0.004654779963297256, "phrase": "conversational_content"}, {"score": 0.004500414250942443, "phrase": "monk_et_al"}, {"score": 0.004339609346924681, "phrase": "mobile_phones"}, {"score": 0.003580032420161922, "phrase": "inaudible_half"}, {"score": 0.0034519997658752598, "phrase": "previous_support"}, {"score": 0.003015143226706584, "phrase": "neutral'_conversations"}, {"score": 0.0029224275921964724, "phrase": "face-to-face_conversations"}, {"score": 0.002512850690695835, "phrase": "mobile_conversation"}, {"score": 0.002473895542219933, "phrase": "foreign_speech"}, {"score": 0.0021605514226546497, "phrase": "unpredictable_acoustics"}], "paper_keywords": ["mobile phones", " attention", " annoyance", " half-dialogue", " foreign speech", " conversational content"], "paper_abstract": "According to Monk et al. (2004a. Why are mobile phones annoying? Behaviour and Information Technology, 23 (1), 33-42), mobile phone conversations are annoying to overhear due to an involuntary need-to-listen in order to predict the inaudible half of the conversation. However, previous support for this need-to-listen explanation of annoyance has failed to consider the confound that mobile phone conversations also have less predictable acoustic patterns and has only investigated neutral' conversations. By staging mobile and face-to-face conversations in public, this study further supports the need-to-listen explanation. By removing the need-to-listen to the content of a mobile conversation through introducing foreign speech, bystanders no longer perceived the conversation as more annoying than a conversation between two co-present individuals, supporting the need-to-listen explanation over unpredictable acoustics. In two further experiments manipulating conversational content (neutral' vs. intriguing'), findings suggest that the need-to-listen to mobile phone conversations is not inherently annoying; it can be annoying or possibly even interesting' depending on the conversational content.", "paper_title": "Are mobile phone conversations always so annoying? The 'need-to-listen' effect re-visited", "paper_id": "WOS:000343221600005"}