{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "immersive_photography"}, {"score": 0.010715592977507286, "phrase": "immersive_photography_environment"}, {"score": 0.004327981760540394, "phrase": "technical_characteristics"}, {"score": 0.004242291530697285, "phrase": "original_prototype"}, {"score": 0.0038642157757169315, "phrase": "ar_system"}, {"score": 0.0030595112110658675, "phrase": "sus_questionnaire"}, {"score": 0.002900426826591769, "phrase": "users'_scores"}, {"score": 0.0026771333996253783, "phrase": "acrophobic_context"}, {"score": 0.0024545413637350765, "phrase": "significant_differences"}, {"score": 0.002389839896897424, "phrase": "real_and_immersive_photography_environments"}, {"score": 0.0021049977753042253, "phrase": "real_and_immersive_photography_experiences"}], "paper_keywords": [""], "paper_abstract": "This paper describes an augmented reality ( AR) system for the treatment of acrophobia. First, the technical characteristics of the original prototype are described. Second, the capacity of the immersive photography used in the AR system to provoke sense of presence in users is tested. Forty- one participants without fear of heights walked around a staircase in both a real environment and an immersive photography environment. Immediately after their experience, participants were given the SUS questionnaire to assess their subjective sense of presence. The users' scores in the immersive photography were very high. Results indicate that the acrophobic context can be useful for the treatment of acrophobia. However, statistically significant differences were found between real and immersive photography environments. Specifically, the immersive photography environment was not confused with reality since data showed that SUS distinguished between the real and immersive photography experiences.", "paper_title": "An augmented reality system for the treatment of acrophobia: The sense of presence using immersive photography", "paper_id": "WOS:000240909800005"}