{"auto_keywords": [{"score": 0.04335313856025993, "phrase": "parity_games"}, {"score": 0.01974423916514893, "phrase": "bounded_treewidth"}, {"score": 0.008840449758594326, "phrase": "bounded_dag_width"}, {"score": 0.007281721086171866, "phrase": "previous_best_algorithm"}, {"score": 0.00481495049065317, "phrase": "games_with_bounded_tree_and_dag_width._parity_games"}, {"score": 0.004659058844038477, "phrase": "np"}, {"score": 0.004473982381245469, "phrase": "p._consequently"}, {"score": 0.0033961782274326948, "phrase": "parity_game"}, {"score": 0.003249574947858394, "phrase": "berwanger_et_al"}, {"score": 0.0030414140732789186, "phrase": "tree_decomposition"}, {"score": 0.0027036381434665914, "phrase": "obdrzalek"}, {"score": 0.0022741894748181243, "phrase": "stark_contrast"}, {"score": 0.0022492129111567824, "phrase": "general_parity_game_problem"}, {"score": 0.0021049993427705214, "phrase": "nc."}], "paper_keywords": ["Parity games", " treewidth"], "paper_abstract": "Parity games are a much researched class of games in NP boolean AND CoNP that are not known to be in P. Consequently, researchers have considered specialised algorithms for the case where certain graph parameters are small. In this paper, we study parity games on graphs with bounded treewidth, and graphs with bounded DAG width. We show that parity games with bounded DAG width can be solved in O(n(k+3) . k(k+2) . (d + 1)(3k+2)) time, where n, k, and d are the size, treewidth, and number of priorities in the parity game. This is an improvement over the previous best algorithm, given by Berwanger et al., which runs in n(O(k2)) time. We also show that, if a tree decomposition is provided, then parity games with bounded treewidth can be solved in O(n . k(k+5) . (d + 1)(3k+5)) time. This improves over previous best algorithm, given by Obdrzalek, which runs in O(n . d(2(k+1)2)) time. Our techniques can also be adapted to show that the problem of solving parity games with bounded treewidth lies in the complexity class NC2, which is the class of problems that can be efficiently parallelized. This is in stark contrast to the general parity game problem, which is known to be P-hard, and thus unlikely to be contained in NC.", "paper_title": "TIME AND PARALLELIZABILITY RESULTS FOR PARITY GAMES WITH BOUNDED TREE AND DAG WIDTH", "paper_id": "WOS:000322537700003"}