{"auto_keywords": [{"score": 0.03556228763437266, "phrase": "base_stations"}, {"score": 0.022429949182068712, "phrase": "cell_tower"}, {"score": 0.008480547452218693, "phrase": "radio_network_controller"}, {"score": 0.0071586035314640415, "phrase": "different_rncs"}, {"score": 0.00481495049065317, "phrase": "handover_minimization"}, {"score": 0.004777034835192062, "phrase": "mobility_networks"}, {"score": 0.004720717782144015, "phrase": "mobile_device"}, {"score": 0.004466519142879166, "phrase": "strongest_signal"}, {"score": 0.004078157608867258, "phrase": "base_station"}, {"score": 0.0038128974473679435, "phrase": "rnc"}, {"score": 0.00344007531836105, "phrase": "maximum_amount"}, {"score": 0.00303072749758085, "phrase": "dropped_connections"}, {"score": 0.0028446460307503343, "phrase": "rnc_capacity"}, {"score": 0.002627985415362773, "phrase": "integer_programming_formulation"}, {"score": 0.002596937660779953, "phrase": "handover_minimization_problem"}, {"score": 0.002556109032208553, "phrase": "state-of-the-art_integer_programming_solvers"}, {"score": 0.0023990982005125763, "phrase": "approximate_solutions"}, {"score": 0.0022696277881969896, "phrase": "generalized_quadratic_assignment_problem"}, {"score": 0.0021049977753042253, "phrase": "computational_results"}], "paper_keywords": ["Mobility networks", " Handover minimization", " Randomized heuristics", " GRASP", " Biased random-key genetic algorithm"], "paper_abstract": "A mobile device connects to the cell tower (base station) from which it receives the strongest signal. As the device moves it may connect to a series of towers. The process in which the device changes the base station it is connected to is called handover. A cell tower is connected to a radio network controller (RNC) which controls many of its operations, including handover. Each cell tower handles an amount of traffic and each radio network controller has capacity to handle a maximum amount of traffic from all base stations connected to it. Handovers between base stations connected to different RNCs tend to fail more often than handovers between base stations connected to the same RNC. Handover failures result in dropped connections and therefore should be minimized. The Handover Minimization Problem is to assign towers to RNCs such that RNC capacity is not violated and the number of handovers between base stations connected to different RNCs is minimized. We describe an integer programming formulation for the handover minimization problem and show that state-of-the-art integer programming solvers can solve only very small instances of the problem. We propose several randomized heuristics for finding approximate solutions of this problem, including a GRASP with path-relinking for the generalized quadratic assignment problem, a GRASP with evolutionary path-relinking, and a biased random-key genetic algorithm. Computational results are presented.", "paper_title": "Randomized heuristics for handover minimization in mobility networks", "paper_id": "WOS:000326888000001"}