{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "social_context"}, {"score": 0.015211621982746565, "phrase": "collaborative_pervasive_applications"}, {"score": 0.004233347974930148, "phrase": "dynamic_group"}, {"score": 0.004077995480957875, "phrase": "infrastructure_services"}, {"score": 0.003895810929926511, "phrase": "predefined_agreements"}, {"score": 0.003585089792133518, "phrase": "complex_and_changing_environments"}, {"score": 0.0033824008297657494, "phrase": "existing_approaches"}, {"score": 0.0029981559422442693, "phrase": "adequate_adaptation_support"}, {"score": 0.002900037689072025, "phrase": "user_requirements"}, {"score": 0.002816814445002924, "phrase": "inter-actor_relationships"}, {"score": 0.0027246145918972025, "phrase": "social_contexts"}, {"score": 0.002591927716261631, "phrase": "scaas_platform"}, {"score": 0.002559775585192185, "phrase": "key_features"}, {"score": 0.002486292595645607, "phrase": "interaction_relationships"}, {"score": 0.0023651843133643768, "phrase": "domain_and_actor_perspectives"}, {"score": 0.002306855521822739, "phrase": "service_oriented_paradigm"}, {"score": 0.002212812864395738, "phrase": "platform's_adaptation_overhead"}, {"score": 0.0021314498639048085, "phrase": "telematics_application"}, {"score": 0.0021049977753042253, "phrase": "cooperative_convoy"}], "paper_keywords": ["Social context", " social interaction relationship", " runtime adaptation", " service platform", " collaborative pervasive application"], "paper_abstract": "We present a social context as a service (SCaaS) platform for managing adaptations in collaborative pervasive applications that support interactions among a dynamic group of actors such as users, stakeholders, infrastructure services, businesses and so on. Such interactions are based on predefined agreements and constraints that characterize the relationships between the actors and are modeled with the notion of social context. In complex and changing environments, such interaction relationships, and thus social contexts, are also subject to change. In existing approaches, the relationships among actors are not modeled explicitly, and instead are often hard-coded into the application. Furthermore, these approaches do not provide adequate adaptation support for such relationships as the changes occur in user requirements and environments. In our approach, inter-actor relationships in an application are modeled explicitly using social contexts, and their execution environment is generated and adaptations are managed by the SCaaS platform. The key features of our approach include externalization of the interaction relationships from the applications, representation and modeling of such relationships from the domain and actor perspectives, their implementation using a service oriented paradigm, and support for their runtime adaptation. We quantify the platform's adaptation overhead and demonstrate its feasibility and applicability by developing a telematics application that supports cooperative convoy.", "paper_title": "Social Context as a Service: Managing Adaptation in Collaborative Pervasive Applications", "paper_id": "WOS:000351748700002"}