{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "prefetching_works"}, {"score": 0.004569905085027681, "phrase": "emerging_and_future_high-end_processor_systems"}, {"score": 0.004357927940322685, "phrase": "memory_bandwidth"}, {"score": 0.0042354707960660706, "phrase": "high_performance"}, {"score": 0.0031845067058084583, "phrase": "source_code-level_analysis"}, {"score": 0.0030802351224657673, "phrase": "practical_strengths"}, {"score": 0.0029935730127943496, "phrase": "software-based_prefetching"}, {"score": 0.002909342017421165, "phrase": "synergistic_and_antagonistic_effects"}, {"score": 0.0027610089418453614, "phrase": "hardware_prefetching_training_policies"}, {"score": 0.002696101728474703, "phrase": "software_prefetching_requests"}, {"score": 0.00258307991054107, "phrase": "real_systems"}, {"score": 0.0022500695985527668, "phrase": "tangible_risk"}, {"score": 0.0021971473452127126, "phrase": "existing_hardware_prefetching_mechanisms"}, {"score": 0.0021251363422701446, "phrase": "new_research_directions"}], "paper_keywords": ["Experimentation", " Performance", " Prefetching", " cache"], "paper_abstract": "In emerging and future high-end processor systems, tolerating increasing cache miss latency and properly managing memory bandwidth will be critical to achieving high performance. Prefetching, in both hardware and software, is among our most important available techniques for doing so; yet, we claim that prefetching is perhaps also the least well-understood. Thus, the goal of this study is to develop a novel, foundational understanding of both the benefits and limitations of hardware and software prefetching. Our study includes: source code-level analysis, to help in understanding the practical strengths and weaknesses of compiler- and software-based prefetching; a study of the synergistic and antagonistic effects between software and hardware prefetching; and an evaluation of hardware prefetching training policies in the presence of software prefetching requests. We use both simulation and measurement on real systems. We find, for instance, that although there are many opportunities for compilers to prefetch much more aggressively than they currently do, there is also a tangible risk of interference with training existing hardware prefetching mechanisms. Taken together, our observations suggest new research directions for cooperative hardware/software prefetching.", "paper_title": "When Prefetching Works, When It Doesn't, and Why", "paper_id": "WOS:000302249400002"}