{"auto_keywords": [{"score": 0.04757253742050198, "phrase": "np"}, {"score": 0.017428077009964904, "phrase": "h-coloring_problem"}, {"score": 0.008968739136428403, "phrase": "acyclic_digraphs"}, {"score": 0.0076222045600435225, "phrase": "polynomial_time"}, {"score": 0.006506782031247369, "phrase": "out-degree_bound"}, {"score": 0.006310417779845926, "phrase": "in-degree_bound"}, {"score": 0.00481495049065317, "phrase": "np-complete_coloring"}, {"score": 0.004610058444728656, "phrase": "small_number"}, {"score": 0.004425154757824971, "phrase": "analogous_phenomenon"}, {"score": 0.004324410631569266, "phrase": "np-complete_h-colorability_problems"}, {"score": 0.004159702112970024, "phrase": "degree_constraints"}, {"score": 0.004044220061467283, "phrase": "degree_bounds"}, {"score": 0.003399466007862412, "phrase": "np-complete_problems"}, {"score": 0.00333051528815931, "phrase": "third_case"}, {"score": 0.0026786976766651946, "phrase": "huang"}, {"score": 0.0022675124632171055, "phrase": "best_possible_bounds"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Coloring", " Homomorphism", " Acyclic digraph", " Degree-bounded digraph"], "paper_abstract": "An NP-complete coloring or homomorphism problem may become polynomial time solvable when restricted to graphs with degrees bounded by a small number, but remain NP-complete if the bound is higher. We investigate an analogous phenomenon for digraphs, focusing on the three smallest digraphs H with NP-complete H-colorability problems. It turns out that in all three cases the H-coloring problem is polynomial time solvable for digraphs with in-degrees at most 1, regardless of the out-degree bound (respectively with out-degrees at most 1, regardless of the in-degree bound). On the other hand, as soon as both in- and out-degrees are bounded by constants greater than or equal to 2, all three problems are again NP-complete. Interestingly, the situation changes when we further restrict the inputs to be acyclic digraphs. In two of the three cases the NP-complete problems remain NP-complete. In the third case, the H-coloring problem turns out to be polynomial time solvable for acyclic digraphs with in-degrees at most 2, regardless of the out-degree bound (respectively with out-degrees at most 2, regardless of the in-degree bound). We also show that in this case as soon as both in- and out-degrees are bounded by constants greater than or equal to 3, the H-coloring problem is once again NP-complete, even for acyclic digraphs. A conjecture proposed for graphs H by Feder, Hell and Huang states that any variant of the H-coloring problem which is NP-complete without degree constraints is also NP-complete with degree constraints, provided the degree bounds are high enough. It has been verified for H-coloring of digraphs, but the degree bounds are quite high, and are stated in terms of the sum of in- and out-degrees. Our results confirm the conjecture with the best possible bounds that are needed for NP-completeness; moreover, they underscore the fact that the bound must apply separately to both the in-degrees and the out-degrees. (C) 2014 Elsevier B.V. All rights reserved.", "paper_title": "H-coloring degree-bounded (acyclic) digraphs", "paper_id": "WOS:000343639100004"}