{"auto_keywords": [{"score": 0.029652640121875826, "phrase": "administrative_data"}, {"score": 0.015719716506582538, "phrase": "adverse_events"}, {"score": 0.015559302093699465, "phrase": "central_venous_catheters"}, {"score": 0.004587464246981363, "phrase": "clinical_settings"}, {"score": 0.004295752645085445, "phrase": "semi-automated_review"}, {"score": 0.0037796484923665855, "phrase": "manually_reviewed_records"}, {"score": 0.0035637052288771706, "phrase": "phrase-matching_algorithm"}, {"score": 0.003490462324829042, "phrase": "sensitive_but_relatively_non-specific_method"}, {"score": 0.0034424690391411093, "phrase": "natural_language_processing_system"}, {"score": 0.003336875060853387, "phrase": "positive_predictive_values"}, {"score": 0.0032682787834955856, "phrase": "cvc-associated_ae_rate"}, {"score": 0.0030814613175385672, "phrase": "acceptable_sensitivity"}, {"score": 0.0029458177077921043, "phrase": "manual_chart_review"}, {"score": 0.0029052913631676435, "phrase": "incomplete_or_inaccurate_clinician_documentation"}, {"score": 0.002758347423707791, "phrase": "cpt"}, {"score": 0.002701474449898187, "phrase": "intensive_care_unit_patients"}, {"score": 0.0024773480858940504, "phrase": "automated_methods"}, {"score": 0.002451730979693715, "phrase": "phrase_matching"}, {"score": 0.0022096766306027352, "phrase": "ae"}, {"score": 0.002149231173009159, "phrase": "decision_support_technologies"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["electronic medical records", " natural language processing", " adverse events", " surveillance"], "paper_abstract": "Methods for surveillance of adverse events (AEs) in clinical settings are limited by cost, technology, and appropriate data availability. In this study, two methods for semi-automated review of text records within the Veterans Administration database are utilized to identify AEs related to the placement of central venous catheters (CVCs): a Natural Language Processing program and a phrase-matching algorithm. A sample of manually reviewed records were then compared to the results of both methods to assess sensitivity and specificity. The phrase-matching algorithm was found to be a sensitive but relatively non-specific method, whereas a natural language processing system was significantly more specific but less sensitive. Positive predictive values for each method estimated the CVC-associated AE rate at this institution to be 6.4 and 6,2%, respectively. Using both methods together results in acceptable sensitivity and specificity (72.0 and 80.1%, respectively). All methods including manual chart review are limited by incomplete or inaccurate clinician documentation. A secondary finding was related to the completeness of administrative data (ICD-9 and CPT codes) used to identify intensive care unit patients in whom a CVC was placed. Administrative data identified less than 11% of patients who had a CVC placed. This suggests that other methods, including automated methods such as phrase matching, may be more sensitive than administrative data in identifying patients with devices. Considerable potential exists for the use of such methods for the identification of patients at risk, AE surveillance, and prevention of AEs through decision support technologies. (c) 2006 Elsevier Inc. All rights reserved.", "paper_title": "Automated identification of adverse events related to central venous catheters", "paper_id": "WOS:000245699600010"}