{"auto_keywords": [{"score": 0.0047732596509542135, "phrase": "applications."}, {"score": 0.00475254914916922, "phrase": "cooperative_communication"}, {"score": 0.004630150894006861, "phrase": "virtual_antenna_array"}, {"score": 0.0038401488612789963, "phrase": "cooperating_mobiles"}, {"score": 0.0037087324991876727, "phrase": "antenna_elements"}, {"score": 0.003644714340300824, "phrase": "conventional_mimo_systems"}, {"score": 0.0035662378173267647, "phrase": "maximum_achievable_diversity_gain"}, {"score": 0.003459191419478298, "phrase": "cooperative_communication_techniques"}, {"score": 0.0033699898113395328, "phrase": "potential_solution"}, {"score": 0.003340768341189764, "phrase": "future_wireless_networks"}, {"score": 0.0031431690368229443, "phrase": "cooperative_networks"}, {"score": 0.0030092017034068666, "phrase": "successive_relaying"}, {"score": 0.002868404184756449, "phrase": "full-duplex_relay"}, {"score": 0.002629026692001082, "phrase": "potentially_excessive-complexity_channel_estimation"}, {"score": 0.0025279105573394727, "phrase": "multiple-antenna_aided_systems"}, {"score": 0.002237477619351199, "phrase": "relay_channels"}, {"score": 0.0021797112385590913, "phrase": "noncoherent_successive_relaying"}], "paper_keywords": ["Cooperative communications", " relaying", " successive relaying"], "paper_abstract": "Cooperative communication is capable of forming a virtual antenna array for each node (user) in a network by allowing the nodes (users) to relay the messages of others to the destination. Such a relay aided network may be viewed as a distributed multiple-input multiple-output (MIMO) system relying on the spatially distributed single antennas of the cooperating mobiles, which avoids the correlation of the antenna elements routinely encountered in conventional MIMO systems and hence attains the maximum achievable diversity gain. Therefore, the family of cooperative communication techniques may be regarded as a potential solution for future wireless networks. However, constrained by the half-duplex transmit/receive mode of most practical transceivers, the cooperative networks may impose a severe 50% throughput loss. As a remedy, successive relaying can be employed, which is capable of mimicking a full-duplex relay and thereby recovering much of the 50% throughput loss. Furthermore, for the sake of bypassing power-hungry and potentially excessive-complexity channel estimation, noncoherent detection techniques may be employed for multiple-antenna aided systems, because estimating all the associated channels may become unrealistic. Explicitly, the mobile-stations acting as relays cannot be realistically expected to estimate the source-to-relay channels. To motivate further research on noncoherent successive relaying aided systems, a comprehensive review of its basic concepts, fundamental principles, practical transceiver designs and open challenges is provided.", "paper_title": "Non-Coherent Successive Relaying and Cooperation: Principles, Designs, and Applications", "paper_id": "WOS:000360315700023"}