{"auto_keywords": [{"score": 0.044728827124546816, "phrase": "proposed_algorithm"}, {"score": 0.00481495049065317, "phrase": "optimization_algorithm"}, {"score": 0.004734448316824488, "phrase": "euclidean_traveling_salesman_problem"}, {"score": 0.004577440795549049, "phrase": "new_hybrid_algorithmic_nature_inspired_approach"}, {"score": 0.004500891637057374, "phrase": "honey_bees"}, {"score": 0.00413684709497912, "phrase": "traveling_salesman_problem"}, {"score": 0.0033218213825698417, "phrase": "crossover_operator"}, {"score": 0.0032115093493071366, "phrase": "main_contribution"}, {"score": 0.003035711716881469, "phrase": "hbmo"}, {"score": 0.002951444412262927, "phrase": "hybrid_synthesis"}, {"score": 0.0027898428590137515, "phrase": "remarkable_results"}, {"score": 0.0027123819773059127, "phrase": "computational_efficiency"}, {"score": 0.0025208755851561368, "phrase": "tsplib"}, {"score": 0.0024370965602952496, "phrase": "best_known_solution"}, {"score": 0.002264982416465872, "phrase": "produced_solution"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Metaheuristics", " Honey bees mating optimization", " Traveling salesman problem"], "paper_abstract": "This paper introduces a new hybrid algorithmic nature inspired approach based on Honey Bees Mating Optimization for successfully solving the Euclidean Traveling Salesman Problem. The proposed algorithm for the solution of the Traveling Salesman Problem, the Honey Bees Mating Optimization (HBMOTSP), combines a Honey Bees Mating Optimization (HBMO) algorithm, the Multiple Phase Neighborhood Search-Greedy Randomized Adaptive Search Procedure (MPNS-GRASP) algorithm and the Expanding Neighborhood Search Strategy. Besides these two procedures, the proposed algorithm has, also, two additional main innovative features compared to other Honey Bees Mating Optimization algorithms concerning the crossover operator and the workers. The main contribution of this paper is that it shows that the HBMO can be used in hybrid synthesis with other metaheuristics for the solution of the TSP with remarkable results both to quality and computational efficiency. The proposed algorithm was tested on a set of 74 benchmark instances from the TSPLIB and in all but eleven instances the best known solution has been found. For the rest instances the quality of the produced solution deviates less than 0.1% from the optimum. (C) 2010 Elsevier Inc. All rights reserved.", "paper_title": "Honey bees mating optimization algorithm for the Euclidean traveling salesman problem", "paper_id": "WOS:000293548900020"}