{"auto_keywords": [{"score": 0.041464814688850264, "phrase": "cooperative_subtasks"}, {"score": 0.008837205831955373, "phrase": "communication_cost"}, {"score": 0.008136855384063581, "phrase": "cooperation_level"}, {"score": 0.007707458612975349, "phrase": "communication_action"}, {"score": 0.00481495049065317, "phrase": "hierarchical_reinforcement_learning"}, {"score": 0.004790077294467652, "phrase": "hrl"}, {"score": 0.0046918480568236415, "phrase": "cooperative_multi-agent_tasks"}, {"score": 0.004631476648170177, "phrase": "hierarchical_multi-agent_reinforcement_learning"}, {"score": 0.004607600927781824, "phrase": "rl"}, {"score": 0.004524750101015184, "phrase": "hierarchical_multi-agent_rl_algorithm"}, {"score": 0.0045013675768375665, "phrase": "cooperative_hrl."}, {"score": 0.0041647266497945225, "phrase": "individual_subtask"}, {"score": 0.0037936958151903485, "phrase": "overall_task"}, {"score": 0.0036395453437040215, "phrase": "fundamental_property"}, {"score": 0.0036113447126992866, "phrase": "proposed_approach"}, {"score": 0.0033497184946413754, "phrase": "primitive_actions"}, {"score": 0.003306559295382181, "phrase": "empirical_performance"}, {"score": 0.0032809302753757257, "phrase": "hrl_algorithm"}, {"score": 0.002996163071478522, "phrase": "cooperative_hrl"}, {"score": 0.002881793492919646, "phrase": "rational_communication_behavior"}, {"score": 0.0028668768145593635, "phrase": "autonomous_agents"}, {"score": 0.0026590401268765003, "phrase": "multi-agent_hrl_framework"}, {"score": 0.0026043982852389227, "phrase": "cooperative_multi-agent_hrl_algorithm"}, {"score": 0.0025909137231616758, "phrase": "com-cooperative_hrl."}, {"score": 0.002537668280298673, "phrase": "communication_level"}, {"score": 0.0025179838503155407, "phrase": "hierarchical_decomposition"}, {"score": 0.0024155441065367078, "phrase": "cooperative_subtask"}, {"score": 0.0021829308027661587, "phrase": "com-cooperative_hrl_algorithm"}, {"score": 0.0021214605381787337, "phrase": "learned_communication_policy"}, {"score": 0.0021049977753042253, "phrase": "multi-agent_taxi_problem"}], "paper_keywords": ["hierarchical reinforcement learning", " cooperative multi-agent systems", " coordination", " communication"], "paper_abstract": "In this paper, we investigate the use of hierarchical reinforcement learning (HRL) to speed up the acquisition of cooperative multi-agent tasks. We introduce a hierarchical multi-agent reinforcement learning (RL) framework, and propose a hierarchical multi-agent RL algorithm called Cooperative HRL. In this framework, agents are cooperative and homogeneous (use the same task decomposition). Learning is decentralized, with each agent learning three interrelated skills: how to perform each individual subtask, the order in which to carry them out, and how to coordinate with other agents. We define cooperative subtasks to be those subtasks in which coordination among agents significantly improves the performance of the overall task. Those levels of the hierarchy which include cooperative subtasks are called cooperation levels. A fundamental property of the proposed approach is that it allows agents to learn coordination faster by sharing information at the level of cooperative subtasks, rather than attempting to learn coordination at the level of primitive actions. We study the empirical performance of the Cooperative HRL algorithm using two testbeds: a simulated two-robot trash collection task, and a larger four-agent automated guided vehicle (AGV) scheduling problem. We compare the performance and speed of Cooperative HRL with other learning algorithms, as well as several well-known industrial AGV heuristics. We also address the issue of rational communication behavior among autonomous agents in this paper. The goal is for agents to learn both action and communication policies that together optimize the task given a communication cost. We extend the multi-agent HRL framework to include communication decisions and propose a cooperative multi-agent HRL algorithm called COM-Cooperative HRL. In this algorithm, we add a communication level to the hierarchical decomposition of the problem below each cooperation level. Before an agent makes a decision at a cooperative subtask, it decides if it is worthwhile to perform a communication action. A communication action has a certain cost and provides the agent with the actions selected by the other agents at a cooperation level. We demonstrate the efficiency of the COM-Cooperative HRL algorithm as well as the relation between the communication cost and the learned communication policy using a multi-agent taxi problem.", "paper_title": "Hierarchical multi-agent reinforcement learning", "paper_id": "WOS:000239103300003"}