{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "rehabilitation_tool"}, {"score": 0.022713380593045042, "phrase": "multidisciplinary_team_conferences"}, {"score": 0.016680348781069693, "phrase": "management_strategies"}, {"score": 0.015029212606733192, "phrase": "practical_arrangements"}, {"score": 0.00763675407846095, "phrase": "common_treatment_goals"}, {"score": 0.004600389726895716, "phrase": "health_care"}, {"score": 0.004199406257273994, "phrase": "rheumatology_setting"}, {"score": 0.004139976980458675, "phrase": "initial_and_follow-up_team_conferences"}, {"score": 0.004069766428492073, "phrase": "rheumatoid_arthritis"}, {"score": 0.004023619476547389, "phrase": "day_patient_care"}, {"score": 0.003631062193606885, "phrase": "merely_exchange"}, {"score": 0.003390799914533271, "phrase": "electronic_and_printed_records"}, {"score": 0.0033523258279879132, "phrase": "team_conference"}, {"score": 0.003166384930533443, "phrase": "patient's_health_status"}, {"score": 0.0028735797685358, "phrase": "different_types"}, {"score": 0.002776817142154944, "phrase": "mann-whitney_u-test"}, {"score": 0.002631084582314646, "phrase": "ii"}, {"score": 0.002592931959322531, "phrase": "initial_team_conferences"}, {"score": 0.00238006327644733, "phrase": "common_goals"}, {"score": 0.0022802596433757565, "phrase": "follow-up_team_conferences"}, {"score": 0.0021971473452127126, "phrase": "period_ii"}], "paper_keywords": ["team conferences", " communication process", " evaluation", " implementation", " information and communication technology (ICT)", " rehabilitation activities profile"], "paper_abstract": "Objective: Problems with multidisciplinary team conferences in health care include the exchange of too much (discipline-specific) information. The aim of this study was to investigate the effect of the implementation of a rehabilitation tool on the contents of communication during multidisciplinary team conferences in a rheumatology setting. Methods: All initial and follow-up team conferences of 25 consecutive patients with rheumatoid arthritis admitted to a day patient care ward were videotaped during a period before (period I) and after (period II) the introduction of a rehabilitation tool. The aims of the rehabilitation tool were to enhance discussions on the co-ordination of care rather than merely exchange of information. This was achieved by providing a framework for the setting and evaluation of common treatment goals and management strategies as well as accompanying electronic and printed records. For every team conference, the duration of time spent on three types of communication was recorded: (1) grounding regarding the patient's health status, (2) the making of practical arrangements by no more than two health professionals, and (3) the co-ordination of common treatment goals or management strategies. Comparisons of the proportions of time spent on the different types of communication between the two periods were done by means of the Mann-Whitney U-test. Results: Apart from the 25 initial team conferences in both periods, 86 and 71 follow-up team conferences were available in periods I and II, respectively Regarding the initial team conferences, the proportion of time spent on grounding and practical arrangements was significantly smaller in period II than in period I. In addition, the proportion of time spent on common goals or management strategies was significantly greater in period II than in period I. For the follow-up team conferences, the proportion of time spent on practical arrangements was significantly smaller in period II, than in period I. Moreover, the proportions of time spent on the other types of communication did not differ significantly between the two periods.", "paper_title": "The impact of the implementation of a rehabilitation tool on the contents of the communication during multidisciplinary team conferences in rheumatology", "paper_id": "WOS:000251033200011"}