{"auto_keywords": [{"score": 0.048587572706857006, "phrase": "encryption_scheme"}, {"score": 0.04459133502953373, "phrase": "bob"}, {"score": 0.00481495049065317, "phrase": "encryption_schemes"}, {"score": 0.004603525341738782, "phrase": "semi-trusted_proxy"}, {"score": 0.004541918674719973, "phrase": "special_power"}, {"score": 0.004362752757379614, "phrase": "alice"}, {"score": 0.0038290829316346654, "phrase": "identity-based_setting"}, {"score": 0.003628024127607343, "phrase": "alice's_identity"}, {"score": 0.0026600905156986317, "phrase": "open_problem"}, {"score": 0.0026362590493392785, "phrase": "green_et_al"}, {"score": 0.0023346234464901978, "phrase": "new_construction"}, {"score": 0.002313701040445819, "phrase": "identity-based_encryption"}, {"score": 0.002292965705677312, "phrase": "random_padding_techniques"}, {"score": 0.0021920373388760314, "phrase": "standard_decisional_bilinear_diffie-hellman_assumption"}, {"score": 0.00216263228969761, "phrase": "random_oracle_model"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Random padding", " Identity-based encryption", " Proxy re-encryption", " Bilinear pairing", " Dynamic directed graph"], "paper_abstract": "In a proxy re-encryption scheme, a semi-trusted proxy is given special power that allows it to transform a ciphertext for Alice into a ciphertext for Bob without learning any information about the messages encrypted under either key. When a proxy re-encryption scheme is constructed in an identity-based setting, it means that a proxy converts a ciphertext encrypted under Alice's identity into a ciphertext under Bob's. Proxy re-encryption has become more and more popular these years due to the fact that it has many practical applications. In this paper, we present an IND-CCA2 secure identity-based proxy re-encryption scheme which has several useful properties, including, multi-use, unidirectionality, etc. Finding a unidirectional, multi-use, and CCA2-secure proxy re-encryption scheme is presented as an open problem by Green et al. Fortunately, our identity-based proxy re-encryption scheme is a solution to this problem. As a middleware for fulfilling our main goal, we also propose a new construction of identity-based encryption using random padding techniques. The security of our schemes is based on the standard decisional bilinear Diffie-Hellman assumption in the random oracle model. (C) 2010 Elsevier Inc. All rights reserved.", "paper_title": "Multi-use and unidirectional identity-based proxy re-encryption schemes", "paper_id": "WOS:000281174800016"}