{"auto_keywords": [{"score": 0.03889649743269139, "phrase": "different_languages"}, {"score": 0.02322730111336099, "phrase": "multilingual_web"}, {"score": 0.009725849458878801, "phrase": "linked_data"}, {"score": 0.004693887748239161, "phrase": "enormous_growth"}, {"score": 0.004627944735913613, "phrase": "semantic_information"}, {"score": 0.00447341965028879, "phrase": "large_extent"}, {"score": 0.004324031677173549, "phrase": "big_step"}, {"score": 0.0042391934825554076, "phrase": "semantic_web"}, {"score": 0.00417961150804265, "phrase": "new_issues"}, {"score": 0.004051450417410017, "phrase": "different_natural_languages"}, {"score": 0.003806752687389645, "phrase": "explicit_mechanisms"}, {"score": 0.0033606554330571823, "phrase": "truly_multilingual_web"}, {"score": 0.003266767911612594, "phrase": "language-independent_fashion"}, {"score": 0.00290016162105678, "phrase": "existing_linked_data_infrastructure"}, {"score": 0.002859345731792013, "phrase": "linguistic_information"}, {"score": 0.0023579143175099324, "phrase": "ontology_localization"}, {"score": 0.0023445770108033288, "phrase": "ontology_mapping"}, {"score": 0.002324712040137157, "phrase": "cross-lingual_ontology-based_information_access"}, {"score": 0.002234206434819338, "phrase": "initial_architecture"}, {"score": 0.0021050011192089513, "phrase": "elsevier"}], "paper_keywords": ["Multilingualism", " Web of Data", " Linked Data"], "paper_abstract": "The Web has witnessed an enormous growth in the amount of semantic information published in recent years. This growth has been stimulated to a large extent by the emergence of Linked Data. Although this brings us a big step closer to the vision of a Semantic Web, it also raises new issues such as the need for dealing with information expressed in different natural languages. Indeed, although the Web of Data can contain any kind of information in any language, it still lacks explicit mechanisms to automatically reconcile such information when it is expressed in different languages. This leads to situations in which data expressed in a certain language is not easily accessible to speakers of other languages. The Web of Data shows the potential for being extended to a truly multilingual web as vocabularies and data can be published in a language-independent fashion, while associated language-dependent (linguistic) information supporting the access across languages can be stored separately. In this sense, the multilingual Web of Data can be realized in our view as a layer of services and resources on top of the existing Linked Data infrastructure adding (i) linguistic information for data and vocabularies in different languages, (ii) mappings between data with labels in different languages, and (iii) services to dynamically access and traverse Linked Data across different languages. In this article, we present this vision of a multilingual Web of Data. We discuss challenges that need to be addressed to make this vision come true and discuss the role that techniques such as ontology localization, ontology mapping, and cross-lingual ontology-based information access and presentation will play in achieving this. Further, we propose an initial architecture and describe a roadmap that can provide a basis for the implementation of this vision. (C) 2011 Elsevier B. V. All rights reserved.", "paper_title": "Challenges for the multilingual Web of Data", "paper_id": "WOS:000301389100004"}