{"auto_keywords": [{"score": 0.028818583867887954, "phrase": "st"}, {"score": 0.015719236851894136, "phrase": "spectral_radius"}, {"score": 0.015200906502092474, "phrase": "echo_state_networks"}, {"score": 0.004518442937844318, "phrase": "tremendous_potential"}, {"score": 0.004276216827737399, "phrase": "varying_two_important_esn_parameters"}, {"score": 0.0037336520904376687, "phrase": "reservoir_weights"}, {"score": 0.0033579708256295847, "phrase": "esn_output"}, {"score": 0.003032820755030689, "phrase": "function_approximation"}, {"score": 0.002994449398035894, "phrase": "time_series_prediction"}, {"score": 0.0028822153400215973, "phrase": "best_result"}, {"score": 0.0027507242327294208, "phrase": "esn"}, {"score": 0.0026252106881752067, "phrase": "esn's_performance"}, {"score": 0.002391067964886602, "phrase": "esn_performance"}, {"score": 0.0022722584151582616, "phrase": "computational_requirement"}, {"score": 0.002177762848946681, "phrase": "high_frequency"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Echo state network", " Function approximation", " Settling time", " Spectral radius", " System monitoring", " Time series prediction"], "paper_abstract": "Echo State Networks (ESNs) have tremendous potential on a variety of problems if successfully designed. The effects of varying two important ESN parameters, the spectral radius (alpha) and settling time (ST) are studied in this letter. Spectral radius of an ESN is the maximum of all eigenvalues of the reservoir weights whereas ST is measured by the number of iterations allowed in the reservoir after its excitation by an input and before the sampling of the ESN output. The influence of these parameters on the performance of an ESN is illustrated using three different types of problems. These problems include a function approximation, a time series prediction and a complex system monitoring/estimation. An alpha of 0.8 gives best result in all of these experiments and the performance of the ESN degrades when ST is increased. This degradation in the ESN's performance is due to the decaying of the echoes and attenuation in the reservoir. The increase in ST adversely affects the ESN performance and as such no long-term echoing arrangement is desired. Reducing ST greatly reduces the computational requirement making ESNs suitable even for tasks that require a high frequency of operation. (C) 2009 Elsevier Ltd. All rights reserved.", "paper_title": "Effects of spectral radius and settling time in the performance of echo state networks", "paper_id": "WOS:000270524500001"}