{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "secure_multiparty_computation"}, {"score": 0.004182816319761868, "phrase": "completely_unauthenticated_setting"}, {"score": 0.003891430578662587, "phrase": "uncorrupted_parties"}, {"score": 0.0035554741718298085, "phrase": "authenticated-channel_setting"}, {"score": 0.0034666972896389777, "phrase": "meaningful_security_guarantees"}, {"score": 0.003271986590873581, "phrase": "disjoint_sets"}, {"score": 0.0029146651796243704, "phrase": "first_time"}, {"score": 0.002811191663575046, "phrase": "setup_assumptions"}, {"score": 0.002750874355974879, "phrase": "similar_results"}, {"score": 0.002721201438773336, "phrase": "universal_composability"}, {"score": 0.0026532001044943096, "phrase": "common_reference_string_model"}, {"score": 0.002558985036330194, "phrase": "conceptually_simple_and_unified_solutions"}, {"score": 0.002423882939663573, "phrase": "password-based_authenticated_key_exchange"}, {"score": 0.002279349794239273, "phrase": "secure_protocols"}, {"score": 0.0022629214153694504, "phrase": "partially_authenticated_networks"}], "paper_keywords": ["Multiparty computations", " Unauthenticated channels", " Man-in-the-middle attacks", " Universal composability (UC)", " Password authentication", " Partially-authenticated networks"], "paper_abstract": "Research on secure multiparty computation has mainly concentrated on the case where the parties can authenticate each other and the communication between them. This work addresses the question of what security can be guaranteed when authentication is not available. We consider a completely unauthenticated setting, where all messages sent by the parties may be tampered with and modified by the adversary without the uncorrupted parties being able to detect this fact. In this model, it is not possible to achieve the same level of security as in the authenticated-channel setting. Nevertheless, we show that meaningful security guarantees can be provided: Essentially, all the adversary can do is to partition the network into disjoint sets, where in each set the computation is secure in of itself, and also independent of the computation in the other sets. In this setting we provide, for the first time, nontrivial security guarantees in a model with no setup assumptions whatsoever. We also obtain similar results while guaranteeing universal composability, in some variants of the common reference string model. Finally, our protocols can be used to provide conceptually simple and unified solutions to a number of problems that were studied separately in the past, including password-based authenticated key exchange and nonmalleable commitments. As an application of our results, we study the question of constructing secure protocols in partially authenticated networks, where some of the links are authenticated, and some are not (as is the case in most networks today).", "paper_title": "Secure Computation Without Authentication", "paper_id": "WOS:000294804700004"}