{"auto_keywords": [{"score": 0.04573629565804587, "phrase": "proposed_method"}, {"score": 0.007477652277046853, "phrase": "fou"}, {"score": 0.004665162327051461, "phrase": "new_centroid_type_reduction_method"}, {"score": 0.004439097815805505, "phrase": "main_idea"}, {"score": 0.004431684640551808, "phrase": "computation_time"}, {"score": 0.00389404213807752, "phrase": "constant_width"}, {"score": 0.003755782496223915, "phrase": "constant_width_assumption"}, {"score": 0.003557509959237602, "phrase": "closed_form"}, {"score": 0.0035095935622207956, "phrase": "derivative_based_optimization"}, {"score": 0.003369669078274226, "phrase": "related_part"}, {"score": 0.003309278541665552, "phrase": "originally_constant_width"}, {"score": 0.003220709449062307, "phrase": "accurate_centroid"}, {"score": 0.0028634235895823594, "phrase": "calculated_centroids"}, {"score": 0.0025572160146590623, "phrase": "type_reduction_process"}, {"score": 0.002367875199095903, "phrase": "enhanced_karnik-mendel_iterative_procedure"}, {"score": 0.002232579371411546, "phrase": "seven_test_fuzzy_sets"}, {"score": 0.0021241414408077895, "phrase": "shorter_computation_time"}], "paper_keywords": ["Interval type-2 fuzzy sets", " Centroid type reduction", " Footprint of uncertainty", " Karnik-Mendel Iterative Procedure", " Type-2 fuzzy logic"], "paper_abstract": "In this study, a new centroid type reduction method is proposed for piecewise linear interval type-2 fuzzy sets based on geometrical approach. The main idea behind the proposed method relies on the assumption that the part of footprint of uncertainty (FOU) of an interval type-2 fuzzy set (IT2FS) has a constant width where the centroid is searched. This constant width assumption provides a way to calculate the centroid of an IT2FS in closed form by using derivative based optimization without any need of iterations. When the related part of FOU is originally constant width, the proposed method finds the accurate centroid of an IT2FS; otherwise, an enhancement can be performed in the algorithm in order to minimize the error between the accurate and the calculated centroids. Moreover, only analytical formulas are used in the proposed method utilizing geometry. This eliminates the need of using discretization of an IT2FS for the type reduction process which in return naturally improves the accuracy and the computation time. The proposed method is compared with Enhanced Karnik-Mendel Iterative Procedure (EKMIP) in terms of the accuracy and the computation time on seven test fuzzy sets. The results show that the proposed method provides more accurate results with shorter computation time than EKMIP. (C) 2013 Elsevier Inc. All rights reserved.", "paper_title": "A closed form type reduction method for piecewise linear interval type-2 fuzzy sets", "paper_id": "WOS:000326426200011"}