{"auto_keywords": [{"score": 0.03148350716025271, "phrase": "optimization_problems"}, {"score": 0.006494848226492878, "phrase": "homogeneous_platforms"}, {"score": 0.00623694504657869, "phrase": "heterogeneous_platforms"}, {"score": 0.00481495049065317, "phrase": "streaming_applications"}, {"score": 0.004663832186991562, "phrase": "mapping_filtering_streaming_applications"}, {"score": 0.004636867727899342, "phrase": "large-scale_homogeneous_and_heterogeneous_platforms"}, {"score": 0.004543708337879809, "phrase": "communication_models"}, {"score": 0.004491313367627919, "phrase": "filtering_applications"}, {"score": 0.003592207774973802, "phrase": "filtering_workflow"}, {"score": 0.0033214277952293533, "phrase": "associated_operation_list"}, {"score": 0.003189133102243104, "phrase": "general_problem"}, {"score": 0.0031068737329174234, "phrase": "simplified_model"}, {"score": 0.0030888830649190282, "phrase": "communication_cost"}, {"score": 0.0030267296900520217, "phrase": "evaluation_problems"}, {"score": 0.002957222630196853, "phrase": "polynomial_complexity"}, {"score": 0.0027581067089091434, "phrase": "communication_costs"}, {"score": 0.002702591051318831, "phrase": "previous_results"}, {"score": 0.0025059724686541263, "phrase": "even_evaluation_problems"}, {"score": 0.0024130810599110398, "phrase": "operation_list"}, {"score": 0.002283460959126296, "phrase": "best_operation_list"}, {"score": 0.002263639474937039, "phrase": "combinatorial_nature"}, {"score": 0.0021420294823879292, "phrase": "comprehensive_overview"}, {"score": 0.00212343307513777, "phrase": "additional_difficulties"}, {"score": 0.0021049977753042253, "phrase": "heterogeneity_and_communication_costs"}], "paper_keywords": ["Query optimization", " Web service", " Streaming application", " Workflow", " Communication model", " Period", " Latency", " Complexity results"], "paper_abstract": "In this paper, we explore the complexity of mapping filtering streaming applications on large-scale homogeneous and heterogeneous platforms, with a particular emphasis on communication models and their impact. Filtering applications are streaming applications where each node also has a selectivity which either increases or decreases the size of its input data set. This selectivity makes the problem of scheduling these applications more challenging than the more studied problem of scheduling \"non-filtering\" streaming workflows. We address the complexity of the following two problems: Evaluation: Given a mapping of nodes to processors, how can one compute the period and latency? Optimization: Given a filtering workflow, how can one compute the mapping and schedule that minimize the period or latency? A solution to this problem requires generating both the mapping and the associated operation list-the order in which each processor executes its assigned tasks. We address this general problem in two steps. First, we address the simplified model without communication cost. In this case, the evaluation problems are easy, and the optimization problems have polynomial complexity on homogeneous platforms. However, we show that the optimization problems become NP-hard on heterogeneous platforms. Second, we consider platforms with communication costs. Clearly, due to the previous results, the optimization problems on heterogeneous platforms are still NP-hard. Therefore we come back to homogeneous platforms and extend the framework with three significant realistic communication models. Now even evaluation problems become difficult, because the mapping must now be enriched with an operation list that provides the time-steps at which each computation and each communication occurs in the system: determining the best operation list has a combinatorial nature. Not too surprisingly, optimization problems are NP-hard too. Altogether, this paper provides a comprehensive overview of the additional difficulties induced by heterogeneity and communication costs.", "paper_title": "Mapping Filtering Streaming Applications", "paper_id": "WOS:000298388200012"}