{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "query_routing_trees"}, {"score": 0.04979721041705589, "phrase": "wireless_sensor_networks"}, {"score": 0.047869525215773305, "phrase": "operator_placement_problem"}, {"score": 0.04049871558392555, "phrase": "operator_placement"}, {"score": 0.004758457292840376, "phrase": "optimal_operator_placement"}, {"score": 0.004420022113586985, "phrase": "in-network_query_processing"}, {"score": 0.004228577663320847, "phrase": "query_time"}, {"score": 0.0040097139701644165, "phrase": "operator_placement_assignment"}, {"score": 0.0038246602895705643, "phrase": "key_role"}, {"score": 0.003768594674768144, "phrase": "query_optimization_issues"}, {"score": 0.0037463983616303786, "phrase": "wsn_research"}, {"score": 0.003680587852807675, "phrase": "main_motivation"}, {"score": 0.0035946288112367578, "phrase": "optimal_distributed_algorithm"}, {"score": 0.0035210572541244664, "phrase": "single_operator"}, {"score": 0.003500313767208306, "phrase": "high_communication_cost_networks"}, {"score": 0.0034489862797891847, "phrase": "wireless_sensor_network"}, {"score": 0.0033288399506044763, "phrase": "minimum_communication_cost_overhead"}, {"score": 0.00266693888510356, "phrase": "extra_communication_cost"}, {"score": 0.0024915819531646645, "phrase": "previously_proposed_techniques"}, {"score": 0.0024405312482831646, "phrase": "first_optimal_and_distributed_algorithm"}, {"score": 0.0023554316787703137, "phrase": "comprehensive_experimental_evaluation"}, {"score": 0.002273292707863821, "phrase": "adaptive_properties"}, {"score": 0.0022201273900989416, "phrase": "innovative_perspective"}, {"score": 0.002187530939295254, "phrase": "scientific_field"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["In-network query processing over wireless sensor networks", " Query optimization in wireless sensor networks", " Operator placement in wireless sensor networks", " Query algorithms over wireless sensor networks"], "paper_abstract": "In this paper, we focus the attention on the operator placement problem in Wireless Sensor Networks (WSN). This problem is very relevant for in-network query processing over WSN, where query routing trees are decomposed into three sub-components that must be processed at query time, namely operator tree, operator placement assignment scheme and routing scheme. In particular, the operator placement assignment defines on which node of the network each (query) operator will be hosted and executed. Hence, operator placement plays a key role in the context of query optimization issues in WSN research. In line with this main motivation, in this paper we present an optimal distributed algorithm to adapt the placement of a single operator in high communication cost networks, such as a wireless sensor network. Our parameter-free algorithm finds the optimal node to host the operator with minimum communication cost overhead. Three techniques, proposed here, make this feature possible: (1) identifying the special, and most frequent case, where no flooding is needed, otherwise (2) limitation of the neighborhood to be flooded and (3) variable speed flooding and eves-dropping. When no flooding is needed the communication cost overhead for adapting the operator placement is negligible. In addition, our algorithm does not require any extra communication cost while the query is executed. In our experiments we show that for the rest of cases our algorithm saves 30%-85% of the energy compared to previously proposed techniques. To our knowledge this is the first optimal and distributed algorithm to solve the 1-median (Fermat node) problem. A comprehensive experimental evaluation and the proposal of two solutions that are capable of dealing with adaptive properties of the operator placement problem, which is an innovative perspective of research in this scientific field, represent two further contributions of our research. (C) 2012 Published by Elsevier Inc.", "paper_title": "A novel distributed framework for optimizing query routing trees in wireless sensor networks via optimal operator placement", "paper_id": "WOS:000314325700004"}