{"auto_keywords": [{"score": 0.010267839381677336, "phrase": "baskerville"}, {"score": 0.007911149860026431, "phrase": "'new_language"}, {"score": 0.00481495049065317, "phrase": "classifying_generalization"}, {"score": 0.004358485259138548, "phrase": "tsang"}, {"score": 0.004326479424497971, "phrase": "williams"}, {"score": 0.0038729688332870865, "phrase": "five_types"}, {"score": 0.003069006373093756, "phrase": "'paradigmatic_domination"}, {"score": 0.003035258035722988, "phrase": "lee"}, {"score": 0.0028928306994090453, "phrase": "theoretical_and_empirical_statements"}, {"score": 0.0028085616610192456, "phrase": "terms_'theoretical_statement"}, {"score": 0.0023346234464901978, "phrase": "fatal_flaws"}, {"score": 0.0021049977753042253, "phrase": "paradigmatic_domination"}], "paper_keywords": ["research methodology", " generalization", " induction", " deduction", " Hume's problem of induction", " paradigm"], "paper_abstract": "Lee and Baskerville (2003) attempted to clarify the concept of generalization and classify it into four types. In Tsang and Williams (2012) we objected to their account of generalization as well as their classification and offered repairs. Then we proposed a classification of induction, within which we distinguished five types of generalization. In their (2012) rejoinder, they argue that their classification is compatible with ours, claiming that theirs offers a 'new language.' Insofar as we resist this 'new language' and insofar as they think that our position commits us to positivism and the rejection of interpretivism, they conclude both that our classification is more restrictive than theirs and also that we embrace 'paradigmatic domination.' Lee and Baskerville's classification of generalization is based on a distinction between theoretical and empirical statements. Accordingly we will first clarify the terms 'theoretical statement' and 'empirical statement.' We note that they find no fault with our classification of induction, we re-state our main objections to their classification that remain unanswered and we show that their classification of generalizing is in fact incompatible with ours. We argue that their account of generalization retains fatal flaws, which means it should not be relied upon. We demonstrate that our classification is not committed to any paradigm and so we do not embrace 'paradigmatic domination.'", "paper_title": "Classifying generalization: paradigm war or abuse of terminology?", "paper_id": "WOS:000352826400002"}