{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "object_representation"}, {"score": 0.02303970631679623, "phrase": "machine_learning"}, {"score": 0.0046970764288494764, "phrase": "growing_success"}, {"score": 0.00443308765153716, "phrase": "foundational_problems"}, {"score": 0.004396600680348434, "phrase": "statistical_learning"}, {"score": 0.004064548693812535, "phrase": "fundamental_shift"}, {"score": 0.0038518661517315533, "phrase": "unidirectional_interaction"}, {"score": 0.0035461111918923117, "phrase": "practical_implications"}, {"score": 0.003502382624110703, "phrase": "model_construction"}, {"score": 0.0033743949483348626, "phrase": "specific_set"}, {"score": 0.0032376465741070274, "phrase": "epistemic_standing"}, {"score": 0.0031845067058084583, "phrase": "algorithmic_design"}, {"score": 0.0031064226956732497, "phrase": "statistical_models"}, {"score": 0.002676418520290942, "phrase": "latent_variables"}, {"score": 0.0025785359740308337, "phrase": "philosophical_attention"}, {"score": 0.0024637379406427856, "phrase": "different_philosophical_concepts"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Philosophy of machine learning", " Object representation", " Idealization", " Abstraction", " Latent variables"], "paper_abstract": "With the growing success of machine learning, both researchers and philosophers have recently regained their interest in the foundational problems of statistical learning. The cooperation between philosophy and machine learning has been recognized to be mutually beneficial that may provide fundamental shift in the paradigms of both camps. In this paper, a unidirectional interaction between philosophy and machine learning is considered. This type of interaction becomes necessary as we reflect upon the practical implications of the model construction. To this extent, I review a specific set of contributions of philosophy to machine learning in determining epistemic standing of object representation and algorithmic design. I discuss three aspects of statistical models, pertaining to semantics of object representation, namely idealization (simplifying properties of an object), abstraction (representing an object with another object that is easier to handle), and use of latent variables. I argue to what extent these aspects necessitate philosophical attention to justify their practical use. To this end, I elucidate different philosophical concepts that are utilized by researchers mostly tacitly when dealing with uncertainties in features and their functional relationships. This is expected to help pave the way for further investigations on semantics of object representation in machine learning. (C) 2015 Elsevier B.V. All rights reserved.", "paper_title": "Semantics of object representation in machine learning", "paper_id": "WOS:000361260800005"}