{"auto_keywords": [{"score": 0.04924496525218248, "phrase": "healthcare_organizations"}, {"score": 0.039541503396406254, "phrase": "medical_information_services"}, {"score": 0.03327181630610133, "phrase": "association_rules"}, {"score": 0.00481495049065317, "phrase": "organizational_relations"}, {"score": 0.0047788144470247785, "phrase": "electronic_health_records"}, {"score": 0.0046021431217333824, "phrase": "select_few_administrative_officials"}, {"score": 0.004465499299203836, "phrase": "modern_healthcare_systems"}, {"score": 0.0042360212618010205, "phrase": "organizational_relationships"}, {"score": 0.004172640020322872, "phrase": "utilization_patterns"}, {"score": 0.004151723505230932, "phrase": "electronic_health_record"}, {"score": 0.0040385352882334235, "phrase": "online_survey"}, {"score": 0.003948216711495795, "phrase": "large_academic_medical_center"}, {"score": 0.003543704740862274, "phrase": "work-related_responsibilities"}, {"score": 0.003464414154918627, "phrase": "clinical_areas"}, {"score": 0.00318851398657946, "phrase": "medical_center"}, {"score": 0.0030704542006941473, "phrase": "patient's_record"}, {"score": 0.00292714795976301, "phrase": "respondent_predictions"}, {"score": 0.0028832939585491167, "phrase": "actual_ehr_utilization"}, {"score": 0.002868822028625599, "phrase": "linear-mixed_effects_regression_models"}, {"score": 0.002797541648302302, "phrase": "medical_center_employees"}, {"score": 0.0027556240189920036, "phrase": "high_and_non-high_likelihood"}, {"score": 0.0026402281578418304, "phrase": "hco_area"}, {"score": 0.0025488244859229697, "phrase": "highly_likely_interactions"}, {"score": 0.002381365139274329, "phrase": "ehr_utilization_patterns"}, {"score": 0.002333888942472883, "phrase": "hco_employees"}, {"score": 0.00228736457985244, "phrase": "hco"}, {"score": 0.002213708884627874, "phrase": "automated_learning_strategies"}, {"score": 0.00213703950514224, "phrase": "select_few_individuals"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ireland_ltd."}], "paper_keywords": ["Electronic health records", " Organizational modeling", " Data mining", " Survey"], "paper_abstract": "Objective: Models of healthcare organizations (HCOs) are often defined up front by a select few administrative officials and managers. However, given the size and complexity of modern healthcare systems, this practice does not scale easily. The goal of this work is to investigate the extent to which organizational relationships can be automatically learned from utilization patterns of electronic health record (EHR) systems. Method: We designed an online survey to solicit the perspectives of employees of a large academic medical center. We surveyed employees from two administrative areas: (1) Coding & Charge Entry and (2) Medical Information Services and two clinical areas: (3) Anesthesiology and (4) Psychiatry. To test our hypotheses we selected two administrative units that have work-related responsibilities with electronic records; however, for the clinical areas we selected two disciplines with very different patient responsibilities and whose accesses and people who accessed were similar. We provided each group of employees with questions regarding the chance of interaction between areas in the medical center in the form of association rules (e.g., Given someone from Coding & Charge Entry accessed a patient's record, what is the chance that someone from Medical Information Services access the same record?). We compared the respondent predictions with the rules learned from actual EHR utilization using linear-mixed effects regression models. Results: The findings from our survey confirm that medical center employees can distinguish between association rules of high and non-high likelihood when their own area is involved. Moreover, they can make such distinctions between for any HCO area in this survey. It was further observed that, with respect to highly likely interactions, respondents from certain areas were significantly better than other respondents at making such distinctions and certain areas' associations were more distinguishable than others. Conclusions: These results illustrate that EHR utilization patterns may be consistent with the expectations of HCO employees. Our findings show that certain areas in the HCO are easier than others for employees to assess, which suggests that automated learning strategies may yield more accurate models of healthcare organizations than those based on the perspectives of a select few individuals. (C) 2014 Elsevier Ireland Ltd. All rights reserved.", "paper_title": "We work with them? Healthcare workers interpretation of organizational relations mined from electronic health records", "paper_id": "WOS:000339735700007"}