{"auto_keywords": [{"score": 0.041726498903390224, "phrase": "pca"}, {"score": 0.040432008069318195, "phrase": "hca"}, {"score": 0.0324401086388353, "phrase": "country_development"}, {"score": 0.00481495049065317, "phrase": "internet_surfing"}, {"score": 0.004682708592184678, "phrase": "national_languages"}, {"score": 0.004554435823972959, "phrase": "sci"}, {"score": 0.004017437417375057, "phrase": "principal_component_analysis"}, {"score": 0.003096905353118796, "phrase": "scientific_collaboration"}, {"score": 0.00290173234777844, "phrase": "important_determinants"}, {"score": 0.0027698788736535865, "phrase": "particular_country"}, {"score": 0.0024658019116387845, "phrase": "chemometric_societies"}, {"score": 0.002278284823857861, "phrase": "chemometric_activity"}, {"score": 0.0022155569675462333, "phrase": "corresponding_normal_distribution"}, {"score": 0.0021049977753042253, "phrase": "john_wiley"}], "paper_keywords": ["chemometric history and etymology", " languages", " bibliometrics", " webometrics", " chemometric activity"], "paper_abstract": "Internet surfing for the word chemometrics in national languages and, in the Science Citation Index (SCI), searching for articles containing chemometr* were performed. The bibliometric, webometric, and country development descriptors from literature were then treated by Principal Component Analysis (PCA) and Hierarchical Cluster Analysis (HCA). In total, 82 written and 127 pronunciation forms of chemometrics were found in 48 languages worldwide. The forms ending in '-y' (chemometry) and '-ics' (chemometrics) can be grouped into at least three groups (I, J, K). Scientific collaboration, country development, geography, history, and language were shown to be important determinants in creation of form(s) of chemometrics in a particular country or language. PCA and HCA show that tradition in chemometrics, level of country development, and its scientific production are important for the existence of chemometric societies and laboratories worldwide. Today, the world tends toward becoming more homogeneous with respect to chemometric activity, and will reach a corresponding normal distribution in about 70 years from now. Copyright (c) 2007 John Wiley & Sons, Ltd.", "paper_title": "The past, present, and future of chemometrics worldwide: some etymological, linguistic, and bibliometric investigations", "paper_id": "WOS:000246596800003"}