{"auto_keywords": [{"score": 0.04826151017022421, "phrase": "social_relationships"}, {"score": 0.047627871052890215, "phrase": "social_clouds"}, {"score": 0.00481495049065317, "phrase": "common_social_contacts"}, {"score": 0.004788416208637939, "phrase": "digital_services"}, {"score": 0.004444129263082239, "phrase": "online_social_networks"}, {"score": 0.004346933820596678, "phrase": "essential_role"}, {"score": 0.004322967486451877, "phrase": "people's_daily_life"}, {"score": 0.0041703614123283165, "phrase": "key_step"}, {"score": 0.0041359134977958555, "phrase": "new_links"}, {"score": 0.0040791288840175835, "phrase": "shared_contacts"}, {"score": 0.003978866233891427, "phrase": "personal_relationships"}, {"score": 0.003935096593139715, "phrase": "private_sphere"}, {"score": 0.0038171874077517274, "phrase": "potentially_prying_eyes"}, {"score": 0.003611751858608048, "phrase": "social_links"}, {"score": 0.003513203382092187, "phrase": "private_discovery_of_common_social_contacts"}, {"score": 0.0031801031575393766, "phrase": "private_contact_discovery"}, {"score": 0.002918614042088141, "phrase": "novel_privacy_feature"}, {"score": 0.002784436042659089, "phrase": "contact_certification"}, {"score": 0.0027159094186967247, "phrase": "impersonation_attacks"}, {"score": 0.0026711620032802683, "phrase": "provably_private_and_realistically_efficient_cds_protocols"}, {"score": 0.002569590189606935, "phrase": "trusted_third_party"}, {"score": 0.0024244106761995812, "phrase": "different_computing_platforms"}, {"score": 0.0022747775135581083, "phrase": "existing_social_networks"}, {"score": 0.0022004029656808224, "phrase": "individual_protocol_executions"}, {"score": 0.002152172914717576, "phrase": "context-dependent_contact_discovery"}], "paper_keywords": ["Common social contacts", " Social clouds", " Friend-of-friend detection", " Social PKI", " Privacy"], "paper_abstract": "Digital services that are offered, and consumed, on the basis of social relationships form the backbone of social clouds-an emerging new concept that finds its roots in online social networks. The latter have already taken an essential role in people's daily life, helping users to build and reflect their social relationships to other participants. A key step in establishing new links entails the reconciliation of shared contacts and friends. However, for many individuals, personal relationships belong to the private sphere, and, as such, should be concealed from potentially prying eyes of strangers. Consequently, the transition toward social clouds cannot set aside mechanisms to control the disclosure of social links. This paper motivates and introduces the concept of Private Discovery of Common Social Contacts, which allows two users to assess their social proximity through interaction and learn the set of contacts (e.g., friends) that are common to both users, while hiding contacts that they do not share. We realize private contact discovery using a new cryptographic primitive, called contact discovery scheme (CDS), whose functionality and privacy is formalized in this work. To this end, we define a novel privacy feature, called contact-hiding, that captures our strong privacy goals. We also propose the concept of contact certification and show that it is essential to thwart impersonation attacks on social relationships. We build provably private and realistically efficient CDS protocols for private discovery of mutual contacts. Our constructions do not rely on a trusted third party (TTP)-all contacts are managed independently by the users. The practicality of our proposals is confirmed both analytically and experimentally on different computing platforms. We show that they can be efficiently deployed on smartphones, thus allowing ad hoc and ubiquitous contact discovery outside of existing social networks. Our CDS constructions allow users to select their (certified) contacts to be included in individual protocol executions. That is, users may perform context-dependent contact discovery using any subset (circle) of their contacts.", "paper_title": "Private discovery of common social contacts", "paper_id": "WOS:000313726100004"}