{"auto_keywords": [{"score": 0.03301542427853415, "phrase": "social_network"}, {"score": 0.00481495049065317, "phrase": "on-line_social_networks"}, {"score": 0.004234532601573088, "phrase": "wide_usage"}, {"score": 0.0041984140090404985, "phrase": "mobile_devices"}, {"score": 0.003837205620832367, "phrase": "proper_actions"}, {"score": 0.003598317040926701, "phrase": "serious_damages"}, {"score": 0.003331134183901191, "phrase": "large_group"}, {"score": 0.0032604908177429493, "phrase": "previous_works"}, {"score": 0.0030054007508185858, "phrase": "observed_misinformation"}, {"score": 0.0027821202902740846, "phrase": "possible_solution"}, {"score": 0.0025315664299815537, "phrase": "novel_mechanism"}, {"score": 0.002404522326122611, "phrase": "minimum_cost"}, {"score": 0.002274059352027924, "phrase": "high_probability"}, {"score": 0.0022257833099336858, "phrase": "bounded_number"}, {"score": 0.00218789980093445, "phrase": "extensive_experiment"}], "paper_keywords": ["social networks", " random walk", " propagation", " misinformation", " privacy"], "paper_abstract": "In recent years, more and more people join social networks to share information with others. At the same time, the information sharing/spreading becomes far more frequent and convenient due to the wide usage of mobile devices. As a result, the messages created are very arbitrary, which may contain a lot of misinformation. Proper actions must be taken to avoid the spreading of misinformation or rumors before it causes serious damages. Therefore, any misinformation should be discovered in time when it does not spread to a large group of people. All previous works studied either how the information is spread in the social network or how to inhibit the further pervasion of an observed misinformation. However, no works considered how to discover the broadcasting of misinformation in time. A possible solution is to set observers across the network to discover the suspects of misinformation. In this paper, we design a novel mechanism to select a set of observers in a social network with the minimum cost, where these observers guarantee any misinformation can be discovered with a high probability before it reaches a bounded number of users. Extensive experiment on real data sets verifies the effectiveness of our solution.", "paper_title": "Discover the Misinformation Broadcasting in On-Line Social Networks", "paper_id": "WOS:000355962400001"}