{"auto_keywords": [{"score": 0.047667240890459914, "phrase": "pls"}, {"score": 0.00481495049065317, "phrase": "batch_process_data"}, {"score": 0.004732785510739708, "phrase": "new_process"}, {"score": 0.004219571240696568, "phrase": "industrial_process_data"}, {"score": 0.002758273619951683, "phrase": "latent_variables"}, {"score": 0.002664749302333897, "phrase": "variance_present"}, {"score": 0.0026191799769765085, "phrase": "pls_models"}, {"score": 0.0024586427394152196, "phrase": "industrial_pilot_plant_cell_culture_process_data"}, {"score": 0.002166421738415464, "phrase": "experiment_study"}, {"score": 0.0021049977753042253, "phrase": "physical_variables"}], "paper_keywords": ["Pattern matching", " Similarity factors", " Cell culture processes", " Process monitoring", " Partial least squares"], "paper_abstract": "A new process monitoring metric, the modified PLS similarity factor (S(PLs)(gamma)), is proposed and used to analyze industrial process data. The(gamma) S(PLs) metric is capable of quantifying the degree of similarity between two PLS models. Conveniently, it is bound between zero (completely dissimilar models) and one (identical models). The(gamma) S(PLs) metric is an improvement upon the existing PLS similarity factor,(gamma) S(PLs), because it weighs the weighting vectors (of each model) by the amounts of variance captured in their corresponding latent variables. This feature places more emphasis on the latent variables that capture most of the variance present in the PLS models. The(gamma) S(PLs) metric was used to analyze industrial pilot plant cell culture process data. The similarities (or dissimilarities) between batches were rapidly identified for batches that were conducted during a design of experiment study. Additionally, the physical variables contributing to these similarities (or dissimilarities) were diagnosed. (C) 2008 Elsevier B.V. All rights reserved.", "paper_title": "PLS pattern matching in design of experiment, batch process data", "paper_id": "WOS:000263443400005"}