{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "anti-skid_braking"}, {"score": 0.04598947580092753, "phrase": "ground_maneuvers"}, {"score": 0.015415012996094952, "phrase": "co-simulation_method"}, {"score": 0.013177943141150821, "phrase": "anti-skid_braking_control_model"}, {"score": 0.0046741260449047976, "phrase": "purpose_-_the_purpose"}, {"score": 0.004361276005140776, "phrase": "aircraft_anti-skid_braking"}, {"score": 0.004130165601475531, "phrase": "multibody_system_dynamics_software"}, {"score": 0.00393066798511457, "phrase": "multi-threshold_pid_control_method"}, {"score": 0.003577691211998842, "phrase": "nose_wheel_steering"}, {"score": 0.0035249212996297332, "phrase": "adams_model"}, {"score": 0.0032241994368246065, "phrase": "block_diagrams"}, {"score": 0.0031453010852936334, "phrase": "system_model"}, {"score": 0.0028911669203979156, "phrase": "findings_-_results"}, {"score": 0.0026973310437053573, "phrase": "aircraft_anti-skid_simulation"}, {"score": 0.002657511557782469, "phrase": "aircraft_steering_simulation"}, {"score": 0.00240662380079115, "phrase": "safe_area"}, {"score": 0.0023710856920150574, "phrase": "aircraft_sideslip"}, {"score": 0.0022563636435096457, "phrase": "advanced_method"}, {"score": 0.0021049977753042253, "phrase": "integrated_aircraft_model"}], "paper_keywords": ["Aircraft", " Steering gear", " Prototypes", " Simulation", " Braking systems", " Computer software"], "paper_abstract": "Purpose - The purpose of this paper is to introduce a co-simulation method to study the ground maneuvers of aircraft anti-skid braking and steering. Design/methodology/approach - A virtual prototype of aircraft is established in the multibody system dynamics software MSC. ADAMS/Aircraft. The anti-skid braking control model, which adopts the multi-threshold PID control method with a slip-velocity-controlled, pressure-bias-modulated (PBM) system, is established in MATLAB/Simulink. EASY5 is used to establish the hydraulic system of nose wheel steering. The ADAMS model is connected to block diagrams of the anti-skid braking control model in MATLAB/Simulink, and is also connected to the block diagrams of nose wheel steering system model in EASY5, so that the ground maneuvers of aircraft anti-skid braking and steering are simulated separately. Findings - Results are presented to investigate the performance of anti-skid braking system in aircraft anti-skid simulation. In aircraft steering simulation, the influence of two important parameters on the forces acting on the tires is discussed in detail, and the safe area to prevent aircraft sideslip is obtained. Originality/value - This paper presents an advanced method to study the ground maneuvers of aircraft anti-skid braking and steering, and establishes an integrated aircraft model of airframe, landing gear, steering system, and anti-skid braking system to investigate the interaction of each subsystem via simulation.", "paper_title": "Modeling and simulation of aircraft anti-skid braking and steering using co-simulation method", "paper_id": "WOS:000273285900009"}