{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "robotic_assembly_cell_control"}, {"score": 0.004278807087784626, "phrase": "larger_whole"}, {"score": 0.0040334640350288, "phrase": "manufacturing_community"}, {"score": 0.003954837422946628, "phrase": "potential_benefits"}, {"score": 0.003896871009090446, "phrase": "holonic_approach"}, {"score": 0.0036194914688460656, "phrase": "reference_model"}, {"score": 0.003584025547693836, "phrase": "holonic_manufacturing_systems"}, {"score": 0.0031377955308198634, "phrase": "individual_holon_behaviours"}, {"score": 0.0028715299874549245, "phrase": "resource_independent_manner"}, {"score": 0.0024405312482831646, "phrase": "industrial_strength_manufacturing_system"}, {"score": 0.0023811153883132536, "phrase": "interesting_feature"}, {"score": 0.002346160830406661, "phrase": "manufacturing_system"}, {"score": 0.0023003498123420237, "phrase": "existing_controllers"}, {"score": 0.0022223176391038785, "phrase": "holonic_control"}, {"score": 0.0021682027434117095, "phrase": "conventional_control_hardware"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": [""], "paper_abstract": "Holonic systems are systems that are modelled in terms of components (holons) that have their own unique identity but are part of a larger whole. This larger whole is known as a holarchy. The manufacturing community has recognised the potential benefits of the holonic approach and it has attracted much interest over the past decade. This paper describes elements of a reference model for holonic manufacturing systems in which holons are characterised by the services that they provide and the services that they require other holons to perform on their behalf. In addition, individual holon behaviours are specified in terms of services, providing the ability for behaviours to be specified in a resource independent manner. We expect that this will result in the construction of systems that are easier to understand, extend and modify. An implementation of the model for the control of an industrial strength manufacturing system is described. An interesting feature of the manufacturing system is that the existing controllers are retained, thus demonstrating that holonic control can be implemented using conventional control hardware. (c) 2004 Elsevier Ltd. All rights reserved.", "paper_title": "A team-based holonic approach to robotic assembly cell control", "paper_id": "WOS:000236462000006"}