{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "online_social_networks"}, {"score": 0.04231365345404785, "phrase": "osn_providers"}, {"score": 0.041369559181851014, "phrase": "users'_data"}, {"score": 0.0041586840496756474, "phrase": "user_privacy"}, {"score": 0.003991449490087454, "phrase": "full_control"}, {"score": 0.0038085117064624208, "phrase": "users'_information"}, {"score": 0.0037201996003549246, "phrase": "privacy_controls"}, {"score": 0.0031751758963130135, "phrase": "efficient_privacy_protection_framework"}, {"score": 0.002570296816631395, "phrase": "flexible_and_dynamic_access_policies"}, {"score": 0.00249592321829865, "phrase": "public-key_broadcast_encryption_scheme"}, {"score": 0.0023953929817357882, "phrase": "information_sharing"}, {"score": 0.0023124457559811087, "phrase": "user's_friends"}, {"score": 0.002272053079580848, "phrase": "privacy_and_complexity_evaluations"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": [""], "paper_abstract": "In Online Social Networks (OSNs), users interact with each other by sharing their personal information. One of the concerns in OSNs is how user privacy is protected since the OSN providers have full control over users' data. The OSN providers typically store users' information permanently; the privacy controls embedded in OSNs offer few options to users for customizing and managing the dissipation of their data over the network. In this paper, we propose an efficient privacy protection framework for OSNs that can be used to protect the privacy of users' data and their online social relationships from third parties. The recommended framework shifts the control over data sharing back to the users by providing them with flexible and dynamic access policies. We employ a public-key broadcast encryption scheme as the cryptographic tool for managing information sharing with a subset of a user's friends. The privacy and complexity evaluations show the superiority of our approach over previous. (C) 2012 Elsevier Ltd. All rights reserved.", "paper_title": "CP2: Cryptographic privacy protection framework for online social networks", "paper_id": "WOS:000326661600029"}