{"auto_keywords": [{"score": 0.04718079151846453, "phrase": "mobile_social_networks"}, {"score": 0.00481495049065317, "phrase": "reputation_assumptions"}, {"score": 0.004667149874736771, "phrase": "rapid_development"}, {"score": 0.004618893461411858, "phrase": "mobile_devices"}, {"score": 0.004571133708117498, "phrase": "wireless_technologies"}, {"score": 0.004084624044389326, "phrase": "rational_parties"}, {"score": 0.004034962424068988, "phrase": "file_sharing"}, {"score": 0.003850464100878052, "phrase": "secure_computation"}, {"score": 0.0034519997658752598, "phrase": "impossible_task"}, {"score": 0.0034162643819889054, "phrase": "traditional_secure_computation"}, {"score": 0.0032094634756436595, "phrase": "specific_functions"}, {"score": 0.002803213985198645, "phrase": "secure_computation_protocol"}, {"score": 0.0026061419474030633, "phrase": "utility_definition"}, {"score": 0.002448260697722081, "phrase": "higher_utility"}, {"score": 0.002299921909935613, "phrase": "first_fair_secure_computation"}, {"score": 0.0021945833590668973, "phrase": "constant_rounds"}, {"score": 0.0021049977753042253, "phrase": "terminal_round"}], "paper_keywords": [""], "paper_abstract": "With the rapid development of mobile devices and wireless technologies, mobile social networks become increasingly available. People can implement many applications on the basis of mobile social networks. Secure computation, like exchanging information and file sharing, is one of such applications. Fairness in secure computation, which means that either all parties implement the application or none of them does, is deemed as an impossible task in traditional secure computation without mobile social networks. Here we regard the applications in mobile social networks as specific functions and stress on the achievement of fairness on these functions within mobile social networks in the presence of two rational parties. Rational parties value their utilities when they participate in secure computation protocol in mobile social networks. Therefore, we introduce reputation derived from mobile social networks into the utility definition such that rational parties have incentives to implement the applications for a higher utility. To the best of our knowledge, the protocol is the first fair secure computation in mobile social networks. Furthermore, it finishes within constant rounds and allows both parties to know the terminal round.", "paper_title": "Fair Secure Computation with Reputation Assumptions in the Mobile Social Networks", "paper_id": "WOS:000350912600001"}