{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "fractional_fourier_transform"}, {"score": 0.004612691321755287, "phrase": "fractional_fourier_domain"}, {"score": 0.004529093447865156, "phrase": "considerable_amount"}, {"score": 0.004227653047394939, "phrase": "signal_processing"}, {"score": 0.0033599501775954024, "phrase": "time_domain"}, {"score": 0.0027741761880779535, "phrase": "last_nearly_two_decades"}, {"score": 0.002472822097373027, "phrase": "discrete-time_fractional_fourier_transform"}, {"score": 0.0024167419710380135, "phrase": "fourier"}, {"score": 0.002361632539339945, "phrase": "discrete_fractional_fourier_transform"}, {"score": 0.0021049977753042253, "phrase": "eigen_decomposition-type"}], "paper_keywords": ["fractional Fourier transform", " sampling in the fractional Fourier domain", " discrete-time fractional Fourier transform", " fractional Fourier series", " discrete fractional Fourier transform"], "paper_abstract": "As the fractional Fourier transform has attracted a considerable amount of attention in the area of optics and signal processing, the discretization of the fractional Fourier transform becomes vital for the application of the fractional Fourier transform. Since the discretization of the fractional Fourier transform cannot be obtained by directly sampling in time domain and the fractional Fourier domain, the discretization of the fractional Fourier transform has been investigated recently. A summary of discretizations of the fractional Fourier transform developed in the last nearly two decades is presented in this paper. The discretizations include sampling in the fractional Fourier domain, discrete-time fractional Fourier transform, fractional Fourier series, discrete fractional Fourier transform (including 3 main types: linear combination-type; sampling-type; and eigen decomposition-type), and other discrete fractional signal transform. It is hoped to offer a doorstep for the readers who are interested in the fractional Fourier transform.", "paper_title": "Research progress on discretization of fractional Fourier transform", "paper_id": "WOS:000256529900003"}