{"auto_keywords": [{"score": 0.03774847234753957, "phrase": "interval_schedule"}, {"score": 0.00481495049065317, "phrase": "simple_temporal_networks"}, {"score": 0.00471193241675062, "phrase": "new_metric"}, {"score": 0.00457138247462329, "phrase": "simple_temporal_network"}, {"score": 0.004415857432588371, "phrase": "existing_flexibility_metrics"}, {"score": 0.003911862375084159, "phrase": "available_flexibility"}, {"score": 0.0037623642073222547, "phrase": "intuitively_more_acceptable_flexibility_metric"}, {"score": 0.003177615880037735, "phrase": "starting_time"}, {"score": 0.002888692115811987, "phrase": "low-order_polynomial_time"}, {"score": 0.0028145455182562807, "phrase": "flexibility_metric"}, {"score": 0.002766171878646582, "phrase": "simple_solutions"}, {"score": 0.002637377202509382, "phrase": "temporal_decoupling"}, {"score": 0.002387086347369569, "phrase": "stn"}, {"score": 0.0022464835515931592, "phrase": "popular_belief"}, {"score": 0.0021511430180912164, "phrase": "original_stn."}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Scheduling", " Simple Temporal Network", " Flexibility"], "paper_abstract": "We propose a new metric to determine the flexibility of a Simple Temporal Network (STN). After reviewing some existing flexibility metrics, we conclude that these metrics fail to capture the dependencies between events specified in the STN. As a consequence, these metrics will usually overestimate the available flexibility in such a system. We propose to use an intuitively more acceptable flexibility metric. This metric is based upon the notion of an interval schedule for an STN. Such an interval schedule specifies an interval for every event in the STN in such a way that, for every event, we are free to choose a starting time within its interval independently from the choice made for other events. We show that an interval schedule that maximizes our flexibility metric is computable in low-order polynomial time. As byproducts of this flexibility metric, we discuss simple solutions to problems in STNs with uncertainty (STNUs) and temporal decoupling in STNs. With respect to the latter we show that after computing our flexibility metric, we get a decomposition of the STN almost for free. Even more importantly, we show that contrary to popular belief, such a decomposition does not affect the flexibility of the original STN. (C) 2014 Elsevier B.V. All rights reserved.", "paper_title": "Flexibility and decoupling in Simple Temporal Networks", "paper_id": "WOS:000339130100002"}