{"auto_keywords": [{"score": 0.03980713684810354, "phrase": "physical_system"}, {"score": 0.00481495049065317, "phrase": "uavs_navigation"}, {"score": 0.004762893197005439, "phrase": "urban_canyon"}, {"score": 0.0045108906244892165, "phrase": "non-monotonic_rule"}, {"score": 0.0042489946866108895, "phrase": "numerical_computation_engines"}, {"score": 0.004002242925856335, "phrase": "vehicle_routing_problem"}, {"score": 0.003668591097652231, "phrase": "numerical_information"}, {"score": 0.003344407169522133, "phrase": "defeasible_logic_engine"}, {"score": 0.0028096544129939277, "phrase": "unmanned_autonomous_vehicles"}, {"score": 0.002675252546913683, "phrase": "urban_canyon_environment"}, {"score": 0.0025472634689904772, "phrase": "centralized_control"}, {"score": 0.0022718774783143203, "phrase": "possible_collision"}, {"score": 0.0021049977753042253, "phrase": "travel_guidelines"}], "paper_keywords": ["Defeasible logic", " modal defeasible logic", " unmanned autonomous vehicles"], "paper_abstract": "This article shows how a non-monotonic rule based system (defeasible logic) can be integrated with numerical computation engines, and how this can be applied to solve the Vehicle Routing Problem. To this end, we have simulated a physical system from which we can obtain numerical information. The physical system perceives information from its environment and generates predicates that can be reasoned by a defeasible logic engine. The conclusions/decisions derived will then be realized by the physical system as it takes actions based on the conclusion derived. Here we consider a scenario where a 'flock' of Unmanned Autonomous Vehicles (UAVs) have to navigate within an urban canyon environment. The UAVs are self-autonomous without centralized control. The goal of the UAVs is to navigate to their desired destinations without colliding with each other. In case of possible collision, the UAVs concerned will communicate with each other and use their background knowledge or travel guidelines to resolve the conflicts.", "paper_title": "Towards a model of UAVs navigation in urban canyon through defeasible logic(dagger)", "paper_id": "WOS:000316964800005"}