{"auto_keywords": [{"score": 0.04576114387736513, "phrase": "technology-induced_error"}, {"score": 0.01557387362092176, "phrase": "biomedical_and_life_sciences_literatures"}, {"score": 0.013924369705997237, "phrase": "medline"}, {"score": 0.004831838757507023, "phrase": "models"}, {"score": 0.004313526644128428, "phrase": "biomedical_and_life_sciences_literature"}, {"score": 0.003791901285142797, "phrase": "selected_key_words"}, {"score": 0.003756298824153418, "phrase": "seminal_articles"}, {"score": 0.003721029388906273, "phrase": "research_area"}, {"score": 0.003129871835064893, "phrase": "eleven_articles"}, {"score": 0.0030713353414700295, "phrase": "abstract_review"}, {"score": 0.0025588443155279855, "phrase": "human-computer_interaction"}, {"score": 0.0022631392664577256, "phrase": "theoretical_perspectives"}, {"score": 0.0021655216339356693, "phrase": "emerging_line"}, {"score": 0.0021049977753042253, "phrase": "technology-induced_errors"}], "paper_keywords": ["Framework", " model", " theory", " technology-induced error", " unintended consequences", " e-iatrogenesis", " technology facilitated error", " human factors", " sociotechnical", " organizational", " software engineering"], "paper_abstract": "Objective: The objective of this paper is to examine the extent, range and scope to which frameworks, models and theories dealing with technology-induced error have arisen in the biomedical and life sciences literature as indexed by Medline (R). Methods: To better understand the state of work in the area of technology-induced error involving frameworks, models and theories, the authors conducted a search of Medline (R) using selected key words identified from seminal articles in this research area. Articles were reviewed and those pertaining to frameworks, models or theories dealing with technology-induced error were further reviewed by two researchers. Results: All articles from Medline (R) from its inception to April of 2011 were searched using the above outlined strategy. 239 citations were returned. Each of the abstracts for the 239 citations were reviewed by two researchers. Eleven articles met the criteria based on abstract review. These 11 articles were downloaded for further in-depth review. The majority of the articles obtained describe frameworks and models with reference to theories developed in other literatures outside of healthcare. The papers were grouped into several areas. It was found that articles drew mainly from three literatures: 1) the human factors literature (including human-computer interaction and cognition), 2) the organizational behavior/socio-technical literature, and 3) the software engineering literature. Conclusions: A variety of frameworks and models were found in the biomedical and life sciences literatures. These frameworks and models drew upon and extended frameworks, models and theoretical perspectives that have emerged in other literatures. These frameworks and models are informing an emerging line of research in health and biomedical informatics involving technology-induced errors in healthcare.", "paper_title": "Technology-induced Errors The Current Use of Frameworks and Models from the Biomedical and Life Sciences Literatures", "paper_id": "WOS:000302578200002"}