{"auto_keywords": [{"score": 0.03126190087039677, "phrase": "polyphase_mode"}, {"score": 0.028288513821854353, "phrase": "lowpass_mode"}, {"score": 0.00481495049065317, "phrase": "wireless_receiver"}, {"score": 0.004728624975677976, "phrase": "novel_reconfigurable_lowpass-polyphase_biquad_filter"}, {"score": 0.004042166795461166, "phrase": "power_consumption"}, {"score": 0.0038516336597530614, "phrase": "complex_signal_flow_graph"}, {"score": 0.003692271726952282, "phrase": "zigbee_transceiver"}, {"score": 0.003155784719225786, "phrase": "chip_tuning"}, {"score": 0.0030434561939032597, "phrase": "test_results"}, {"score": 0.0027463775689957255, "phrase": "voltage_gain"}, {"score": 0.002616762777413686, "phrase": "cut-off_frequency"}, {"score": 0.0025235718883452585, "phrase": "dc_gain"}], "paper_keywords": ["Reconfigurable", " Polyphase-filter", " SDR auto-tuning", " Sallen-Key", " Lowpass-filter"], "paper_abstract": "A novel reconfigurable lowpass-polyphase biquad filter based on MFB structure is proposed in this paper. In this biquad, only one op-amp is adopted which improves the matching and reduces the power consumption. And its transmission function is synthesized by the complex signal flow graph. Then a 3rd order filter used in Zigbee transceiver is implemented to illustrate the technique, which is realized in 0.13 mu m CMOS technology. To avoid the variation of resistance and capacitance, an on-chip tuning scheme is integrated. The test results show that when in polyphase mode, it is centered at 2 MHz with 3 MHz bandwidth and the image rejection is about 23 dB with the voltage gain of 12 dB. When in lowpass mode, the cut-off frequency is 1.5 MHz, and the DC gain is 12 dB. The in-band 3rd order input intercept point (IIP3) is 9 dBm in polyphase mode and 13 dBm in lowpass mode. Attractively, the filter only consumes 2.3 mA with a 1.2 V power supply, and occupies an area of 0.26 mm(2).", "paper_title": "An active-RC reconfigurable lowpass-polyphase biquad filter for wireless receiver", "paper_id": "WOS:000355333800010"}