{"auto_keywords": [{"score": 0.04838919478929019, "phrase": "itsm"}, {"score": 0.018227681950615526, "phrase": "itsm_tools"}, {"score": 0.00708689748249916, "phrase": "nielsen's_heuristics"}, {"score": 0.006331835868347403, "phrase": "nielsen"}, {"score": 0.004481132747216135, "phrase": "regular_methods"}, {"score": 0.004412654209742722, "phrase": "heuristic_evaluation"}, {"score": 0.0041703614123283165, "phrase": "specific_heuristics"}, {"score": 0.004064653055162238, "phrase": "prior_research"}, {"score": 0.003961613484271729, "phrase": "heuristic_and_guideline_creation"}, {"score": 0.003802135020791801, "phrase": "usability_heuristics"}, {"score": 0.0034841647157189985, "phrase": "activity_theory"}, {"score": 0.0031277316566463978, "phrase": "commercial_identity_management_system"}, {"score": 0.0026945086500597304, "phrase": "individual_participants"}, {"score": 0.002585906251354904, "phrase": "individual_heuristics"}, {"score": 0.0021049977753042253, "phrase": "usability_evaluation"}], "paper_keywords": [""], "paper_abstract": "The usability of IT security management (ITSM) tools is hard to evaluate by regular methods, making heuristic evaluation attractive. In this article, we explore how domain specific heuristics are created by examining prior research in the area of heuristic and guideline creation. We then describe our approach of creating usability heuristics for ITSM tools, which is based on guidelines for ITSM tools that are interpreted and abstracted with activity theory. With a between-subjects study, we compared the employment of the ITSM and Nielsen's heuristics for evaluation of a commercial identity management system. Participants who used the ITSM set found more problems categorized as severe than those who used Nielsen's. We analyzed several aspects of our heuristics including the performance of individual participants using the heuristic, the performance of individual heuristics, the similarity of our heuristics to Nielsen's, and the participants' opinion about the use of heuristics for evaluation of IT security tools. We then discuss the implications of our results on the use of ITSM and Nielsen's heuristics for usability evaluation of ITSM tools.", "paper_title": "Heuristics for Evaluating IT Security Management Tools", "paper_id": "WOS:000335116500001"}