{"auto_keywords": [{"score": 0.04928674718599398, "phrase": "leader_election"}, {"score": 0.007788418238935512, "phrase": "leader_election_problem"}, {"score": 0.005604794346662899, "phrase": "strong_le"}, {"score": 0.004637478829869904, "phrase": "minimum_memory_size"}, {"score": 0.0040916230716372265, "phrase": "arbitrary_fixed_labelings"}, {"score": 0.0035947360742084253, "phrase": "exactly_one_leader"}, {"score": 0.0032112354575523317, "phrase": "unique_leader"}, {"score": 0.0031579997262619758, "phrase": "weak_le"}, {"score": 0.0028327783069076883, "phrase": "identical_automata"}, {"score": 0.0027510752634224726, "phrase": "minimum_amount"}, {"score": 0.0026164433143193015, "phrase": "logarithmic_memory"}, {"score": 0.0025623050508233078, "phrase": "strong_and_weak_leader_election"}, {"score": 0.002509284173541882, "phrase": "arbitrary_connected_graphs"}, {"score": 0.002337066031028783, "phrase": "maximum_degree_delta"}, {"score": 0.00223196703759329, "phrase": "exponential_gap"}, {"score": 0.0022133711375320244, "phrase": "memory_requirements"}, {"score": 0.0021049977753042253, "phrase": "arbitrary_graphs"}], "paper_keywords": ["Leader election", " Anonymous graphs", " Memory"], "paper_abstract": "We study the minimum memory size with which nodes of a network have to be equipped, in order to solve deterministically the leader election problem. Nodes are unlabeled, but ports at each node have arbitrary fixed labelings which, together with the topology of the network, can create asymmetries to be exploited in leader election. We consider two versions of the leader election problem: strong LE in which exactly one leader has to be elected, if this is possible, while all nodes must terminate in a state \"infeasible\" when the election of a unique leader fails, and weak LE, which differs from strong LE in that no requirement on the behavior of nodes is imposed, if leader election is impossible. Nodes are modeled as identical automata and we ask what is the minimum amount of memory of such an automaton to enable leader election. We show that logarithmic memory is optimal for both strong and weak leader election in the class of arbitrary connected graphs. By contrast we show that strong LE can be accomplished in the class of trees of maximum degree Delta using only O(log log Delta) bits of memory, thus proving an exponential gap in memory requirements for leader election between the class of trees and the class of arbitrary graphs.", "paper_title": "How much memory is needed for leader election", "paper_id": "WOS:000296516900001"}