{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "online_gambling"}, {"score": 0.038948090958912586, "phrase": "internet_gambling"}, {"score": 0.03743864879173822, "phrase": "partygaming"}, {"score": 0.03627173065208285, "phrase": "gibraltar"}, {"score": 0.0040880724328903, "phrase": "larger_market_capitalisation"}, {"score": 0.004054745478848129, "phrase": "british_airways"}, {"score": 0.003956379470617348, "phrase": "dominant_player"}, {"score": 0.003908091457759849, "phrase": "booming_online_poker_market"}, {"score": 0.003513443975425428, "phrase": "online_gambling_license"}, {"score": 0.00347054319869429, "phrase": "tax_haven"}, {"score": 0.0031975786158658158, "phrase": "legal_action"}, {"score": 0.003158522476399068, "phrase": "complex_operations"}, {"score": 0.0031199418866663543, "phrase": "truly_global_firm"}, {"score": 0.0030693770219428953, "phrase": "london"}, {"score": 0.0030443574082967373, "phrase": "india"}, {"score": 0.0029947991049016683, "phrase": "canada"}, {"score": 0.0029100272315053253, "phrase": "internet_pornography"}, {"score": 0.0027817658627604653, "phrase": "ethical_perspective"}, {"score": 0.0024298350266697905, "phrase": "partygaming's_exit"}, {"score": 0.0023131855385489764, "phrase": "share_price"}], "paper_keywords": ["e-commerce", " online gambling", " poker", " dot.coms"], "paper_abstract": "June 2005 was to bring online gambling out of the shadows and into the spotlight. PartyGaming, a start-up formed in 1997, launched a flotation (Initial Public Offering) on the London Stock Exchange that valued the firm at 4.64 pound billion giving it a larger market capitalisation than British Airways. PartyGaming had become the dominant player in the booming online poker market with its PartyPoker brand having over 50% market share. However, this float - as with Internet gambling in general - was not without controversy. While PartyGaming had an online gambling license from the tax haven of Gibraltar, nearly 90% of its revenue came from the United States, where the authorities viewed Internet gambling as illegal and threatened legal action. The complex operations of this truly global firm with bases in London, India, Gibraltar and Canada, the background of its founder Ruth Parasol in Internet pornography and the handling of its flotation also raised concerns from an ethical perspective, with some commentators questioning whether the float should have been allowed at all. These concerns were then confirmed as US legislation to curb online gambling was passed in September 2006, leading to PartyGaming's exit from the US market and an immediate fall of 58% in the share price. This case study analyses the entrepreneurs behind PartyGaming, its growth, the challenges it has faced, the ethical issues it poses and its future prospects. The case draws on theory from e-commerce, strategy and ethics.", "paper_title": "The ultimate bluff: a case study of partygaming.com", "paper_id": "WOS:000251236800012"}