{"auto_keywords": [{"score": 0.049593242225692294, "phrase": "roro_ships"}, {"score": 0.0077732169243587826, "phrase": "mip_solver"}, {"score": 0.00481495049065317, "phrase": "stowage_plans"}, {"score": 0.004717723626157272, "phrase": "international_vehicle_transportation"}, {"score": 0.004216880725292, "phrase": "farming_equipment"}, {"score": 0.004152818376630929, "phrase": "military_equipment"}, {"score": 0.004007083686875716, "phrase": "different_regions"}, {"score": 0.0038862297330905836, "phrase": "predefined_plans"}, {"score": 0.0037307208089736835, "phrase": "operational_decisions"}, {"score": 0.002889928791032578, "phrase": "mathematical_model"}, {"score": 0.002718045523483502, "phrase": "specially_designed_heuristic_method"}, {"score": 0.0026091594819333654, "phrase": "computational_tests"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Maritime transportation", " Route feasibility", " Squeaky wheel optimization"], "paper_abstract": "International vehicle transportation is primarily conducted using Roll-on/Roll-off (RoRo) ships, which are specialized to transport cargo on wheels such as cars, farming equipment, and military equipment. RoRo ships operate by going between different regions of the world according to predefined plans. In this work we focus on operational decisions that are required when operating a fleet of RoRo ships: given a ship set to travel according to a given route, we consider decisions such as which cargoes to carry, how many vehicles to carry from each cargo, and how to stow the vehicles carried during the voyage. A mathematical model is made describing the problem, and both a standard MIP solver and a specially designed heuristic method are used to solve the problem. Computational tests are conducted to analyze the difficulty of solving several variations of the problem. For certain types of instances the MIP solver works well, while for other types the heuristic is very fast and more accurate than the MIP solver. (c) 2011 Elsevier Ltd. All rights reserved.", "paper_title": "Optimization of stowage plans for RoRo ships", "paper_id": "WOS:000288410200005"}