{"auto_keywords": [{"score": 0.04868684268038368, "phrase": "fuel_cells"}, {"score": 0.00481495049065317, "phrase": "ion_exchange_membranes"}, {"score": 0.004539005582217309, "phrase": "polymer_electrolyte_membranes"}, {"score": 0.00405735420159564, "phrase": "ion_transport_properties"}, {"score": 0.003757480190200645, "phrase": "high_temperature"}, {"score": 0.0032223742018434856, "phrase": "chemical_stability"}, {"score": 0.002914288956035066, "phrase": "ionic_transport_properties"}, {"score": 0.002246553137021003, "phrase": "sulfonyl_groups"}, {"score": 0.0022070310530794097, "phrase": "comparative_study"}, {"score": 0.002155412043665635, "phrase": "spei"}], "paper_keywords": ["Sulfonation", " Poly(ether imide)", " Polymers", " Density functional theory", " Molecular simulation"], "paper_abstract": "The design of polymer electrolyte membranes for fuel cells must satisfy two equally important fundamental principles: optimization of the reactivity and the selectivity in order to improve the ion transport properties of the membrane as well as its long-term stability in the hydrated state at high temperature (above 100 degrees C). A study utilizing density functional theory (DFT) to elucidate the effect of the degree of sulfonation on the chemical stability, reactivity, and selectivity of poly(ether imide) (PEI), which allows the ionic transport properties of the membrane to be predicted, is reported here. Sulfonated poly(ether imide) (SPEI) structures with (-SO3H)(n) (n=1-6) groups were built and optimized in order to calculate the above properties as functions of the number of sulfonyl groups. A comparative study demonstrated that the SPEI with four sulfonyl groups in its backbone is the polymer with the properties best suited for use in fuel cells.", "paper_title": "Role of sulfonation in the stability, reactivity, and selectivity of poly(ether imide) used to develop ion exchange membranes: DFT study with application to fuel cells", "paper_id": "WOS:000339884800023"}