{"auto_keywords": [{"score": 0.02778235831220587, "phrase": "domain_architectures"}, {"score": 0.00481495049065317, "phrase": "domain_architecture_level"}, {"score": 0.004644146045859622, "phrase": "highly_similar_domain_architectures"}, {"score": 0.004359625030298944, "phrase": "single_family"}, {"score": 0.00422394773095715, "phrase": "jaccard"}, {"score": 0.00391167729353583, "phrase": "single_similarity_measure"}, {"score": 0.0034780071331554003, "phrase": "multiple-domain_proteins"}, {"score": 0.003369669078274226, "phrase": "classic_approaches"}, {"score": 0.0033242742850902295, "phrase": "sequence_similarity_measures"}, {"score": 0.00326469463991041, "phrase": "case_study"}, {"score": 0.0031062822219953524, "phrase": "promiscuous_domains"}, {"score": 0.0029025435402480326, "phrase": "web_server"}, {"score": 0.0027741761880779535, "phrase": "different_domain_architectures"}, {"score": 0.0025113494092413604, "phrase": "orthologous_groups"}, {"score": 0.002488724764295623, "phrase": "proteins_database"}, {"score": 0.002252880693912436, "phrase": "multiclomain_proteins"}, {"score": 0.0021434588322608653, "phrase": "supplementary_data"}, {"score": 0.002105091813660743, "phrase": "bioinformatics"}], "paper_keywords": [""], "paper_abstract": "Motivation: Ideally, only proteins that exhibit highly similar domain architectures should be compared with one another as homologues or be classified into a single family. By combining three different indices, the Jaccard index, the Goodman-Kruskal y function and the domain duplicate index, into a single similarity measure, we propose a method for comparing proteins based on their domain architectures. Results: Evaluation of the method using the eukaryotic orthologous groups of proteins (KOGs) database indicated that it allows the automatic and efficient comparison of multiple-domain proteins, which are usually refractory to classic approaches based on sequence similarity measures. As a case study, the PDZ and LRR_1 domains are used to demonstrate how proteins containing promiscuous domains can be clearly compared using our method. For the convenience of users, a web server was set up where three different query interfaces were implemented to compare different domain architectures or proteins with domain(s), and to identify the relationships among domain architectures within a given KOG from the Clusters of Orthologous Groups of Proteins database. Conclusion: The approach we propose is suitable for estimating the similarity of domain architectures of proteins, especially those of multiclomain proteins. Availability: http://cmb.bnu.edu.cn/pdart/ Contact: linkui@bnu.edu.cn Supplementary Information: Supplementary data are available at Bioinformatics online.", "paper_title": "An initial strategy for comparing proteins at the domain architecture level", "paper_id": "WOS:000240433100004"}