{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "theoretical_saturation"}, {"score": 0.004572637074274805, "phrase": "glaser"}, {"score": 0.004513957235071457, "phrase": "strauss's_grounded_theory_methodology"}, {"score": 0.004231699728933577, "phrase": "fundamental_concept"}, {"score": 0.0041773934798743405, "phrase": "interview-based_qualitative_research"}, {"score": 0.003816197777388722, "phrase": "extensive_literature_review"}, {"score": 0.0033752674784204412, "phrase": "qualitative_methodologists"}, {"score": 0.0032051601987130207, "phrase": "possible_improvement"}, {"score": 0.0028346293790895024, "phrase": "quantitative_technique"}, {"score": 0.0027444334639134217, "phrase": "lognormal_distribution_principles"}, {"score": 0.0021742244283295986, "phrase": "corpus_size"}, {"score": 0.0021049977753042253, "phrase": "true_indication"}], "paper_keywords": ["theoretical saturation", " grounded theory", " concept", " research interviews"], "paper_abstract": "Although the concept of theoretical saturation (ThS) was first introduced by Glaser and Strauss's grounded theory methodology, it is now more widely used as a fundamental concept in interview-based qualitative research. Despite its widespread use, the concept is nebulous and lacks systematization. An extensive literature review in 2007, and again in 2013, shows that this inexactitude characterizes most claims for using ThS. Yet qualitative methodologists seem strangely reluctant to accept criticism or possible improvement. By assuming MS to be an analogue of the principle of diminishing returns, we propose a quantitative technique for determining ThS using lognormal distribution principles. Applying the technique to three large data sets provided strong evidence that the method is efficacious. Usefully, this study also shows both that the technique is not affected by the order of interviews and that corpus size is not necessarily a true indication of theoretical saturation.", "paper_title": "ARE WE THERE YET? A TECHNIQUE TO DETERMINE THEORETICAL SATURATION", "paper_id": "WOS:000362927200005"}