{"auto_keywords": [{"score": 0.03191153768439655, "phrase": "optimal_segmentation"}, {"score": 0.00481495049065317, "phrase": "nonparametric_neighborhood_statistics"}, {"score": 0.004695900553353526, "phrase": "novel_approach"}, {"score": 0.004656871909510407, "phrase": "unsupervised_texture_segmentation"}, {"score": 0.004266067096140677, "phrase": "intermediate_features"}, {"score": 0.004125934074896249, "phrase": "specific_descriptors"}, {"score": 0.0037795163893761027, "phrase": "core_properties"}, {"score": 0.003670608022642996, "phrase": "fundamental_description"}, {"score": 0.0035648266669315943, "phrase": "stationary_random_fields"}, {"score": 0.0033905067962602515, "phrase": "general_formulation"}, {"score": 0.003092690568543981, "phrase": "probability_density_functions"}, {"score": 0.003066945490483524, "phrase": "image_neighborhoods"}, {"score": 0.002978508766388785, "phrase": "entropy_minimization"}, {"score": 0.0027510752634224726, "phrase": "initial_iterations"}, {"score": 0.0026494723416072316, "phrase": "training_stage"}, {"score": 0.0024883835349005863, "phrase": "information_content"}, {"score": 0.0023864566654035924, "phrase": "straightforward_manner"}, {"score": 0.0023566987138026285, "phrase": "two-region_case"}, {"score": 0.002327310963701377, "phrase": "arbitrary_number"}, {"score": 0.0022696277881969896, "phrase": "efficient_multi-phase_level-set_framework"}, {"score": 0.0021049977753042253, "phrase": "electron-microscopy_images"}], "paper_keywords": [""], "paper_abstract": "This paper presents a novel approach to unsupervised texture segmentation that relies on a very general nonparametric statistical model of image neighborhoods. The method models image neighborhoods directly, without the construction of intermediate features. It does not rely on using specific descriptors that work for certain kinds of textures, but is rather based on a more generic approach that tries to adaptively capture the core properties of textures. It exploits the fundamental description of textures as images derived from stationary random fields and models the associated higher-order statistics nonparametrically. This general formulation enables the method to easily adapt to various kinds of textures. The method minimizes an entropy-based metric on the probability density functions of image neighborhoods to give an optimal segmentation. The entropy minimization drives a very fast level-set scheme that uses threshold dynamics, which allows for a very rapid evolution towards the optimal segmentation during the initial iterations. The method does not rely on a training stage and, hence, is unsupervised. It automatically tunes its important internal parameters based on the information content of the data. The method generalizes in a straightforward manner from the two-region case to an arbitrary number of regions and incorporates an efficient multi-phase level-set framework. This paper presents numerous results, for both the two-texture and multiple-texture cases, using synthetic and real images that include electron-microscopy images.", "paper_title": "Unsupervised texture segmentation with nonparametric neighborhood statistics", "paper_id": "WOS:000237555200038"}