{"auto_keywords": [{"score": 0.04952525101149597, "phrase": "low-rank_modeling"}, {"score": 0.015719716506582538, "phrase": "image_analysis"}, {"score": 0.004310949776826717, "phrase": "low-rank_matrices"}, {"score": 0.004187284711626886, "phrase": "great_success"}, {"score": 0.004090901264701185, "phrase": "computer_vision"}, {"score": 0.004043541331944951, "phrase": "data_mining"}, {"score": 0.003996727479807572, "phrase": "signal_processing"}, {"score": 0.0034956560177000656, "phrase": "exact_low-rank_matrix_recovery"}, {"score": 0.0033952989364738353, "phrase": "matrix_completion"}, {"score": 0.003336468343971626, "phrase": "collaborative_filtering"}, {"score": 0.0030042210975126616, "phrase": "recent_advances"}, {"score": 0.002492931483018372, "phrase": "challenging_problems"}, {"score": 0.0022974765563692776, "phrase": "low-rank_matrix_recovery"}, {"score": 0.0021927323694667694, "phrase": "numerical_experiments"}], "paper_keywords": ["Algorithms", " Low-rank modeling", " matrix factorization", " optimization", " image analysis"], "paper_abstract": "Low-rank modeling generally refers to a class of methods that solves problems by representing variables of interest as low-rank matrices. It has achieved great success in various fields including computer vision, data mining, signal processing, and bioinformatics. Recently, much progress has been made in theories, algorithms, and applications of low-rank modeling, such as exact low-rank matrix recovery via convex programming and matrix completion applied to collaborative filtering. These advances have brought more and more attention to this topic. In this article, we review the recent advances of low-rank modeling, the state-of-the-art algorithms, and the related applications in image analysis. We first give an overview of the concept of low-rank modeling and the challenging problems in this area. Then, we summarize the models and algorithms for low-rank matrix recovery and illustrate their advantages and limitations with numerical experiments. Next, we introduce a few applications of low-rank modeling in the context of image analysis. Finally, we conclude this article with some discussions.", "paper_title": "Low-Rank Modeling and Its Applications in Image Analysis", "paper_id": "WOS:000351437800022"}