{"auto_keywords": [{"score": 0.04601284855430019, "phrase": "work-related_activities"}, {"score": 0.00481495049065317, "phrase": "academic_environment"}, {"score": 0.004767826806287385, "phrase": "earlier_work"}, {"score": 0.004698000536608171, "phrase": "cscw_community"}, {"score": 0.004516733575701128, "phrase": "important_resource"}, {"score": 0.004450568197899267, "phrase": "shared_work"}, {"score": 0.004321118442104989, "phrase": "new_trends"}, {"score": 0.004236908273106904, "phrase": "recent_times"}, {"score": 0.003820896867623235, "phrase": "broader_notion"}, {"score": 0.0036733470451885465, "phrase": "field_study"}, {"score": 0.0036373553416391823, "phrase": "ethnographic_and_cultural_probe"}, {"score": 0.003548905904860611, "phrase": "academic_setting"}, {"score": 0.003445591238183763, "phrase": "staff_members'_everyday_activities"}, {"score": 0.0025137856138000036, "phrase": "people's_everyday_lives"}, {"score": 0.002416589459425828, "phrase": "ordinary_resources"}, {"score": 0.0021896891011033105, "phrase": "situated_display"}], "paper_keywords": ["Awareness", " CSCW", " work environment", " ethnography", " design"], "paper_abstract": "Earlier work within the CSCW community treated the notion of awareness as an important resource for supporting shared work and work-related activities. However, new trends have emerged in recent times that utilize the notion of awareness beyond work-related activities and explore social, emotional and interpersonal aspects of people's everyday lives. To investigate this broader notion of awareness, we carried out a field study using ethnographic and cultural probe based methods in an academic setting. Our aim was to study staff members' everyday activities in their natural surroundings; understand how awareness beyond work-related activities plays out and how it is dealt with. Our field study results shed light on two broad and sometimes overlapping themes of interaction between staff members: 1) self-representations and 2) casual encounters. We provide examples from the field illustrating these two themes. In general, our results show how awcreness is closely associated with people's everyday lives, where they creatively and artfully utilize ordinary resources from their environments to carry out their routine activities. Using the results of our field study, we describe the design of a situated display called Panorama that is meant to support non-critical, non-work-related awareness within work environments.", "paper_title": "Reflections and Encounters: Exploring Awareness in an Academic Environment", "paper_id": "WOS:000358250000003"}