{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "decision_making"}, {"score": 0.004720717782144015, "phrase": "significant_activity"}, {"score": 0.004225950334493496, "phrase": "impact_decision"}, {"score": 0.003982500388997765, "phrase": "greater_insight"}, {"score": 0.0037679023889496885, "phrase": "investigated_variables"}, {"score": 0.0037234376132464493, "phrase": "experience_levels"}, {"score": 0.0036940852452587093, "phrase": "decision_makers"}, {"score": 0.0035931556794840027, "phrase": "information_resources"}, {"score": 0.0029949359231919307, "phrase": "decision-making_process"}, {"score": 0.002627985415362773, "phrase": "multiple_impacts"}, {"score": 0.002566255769251419, "phrase": "different_timescales"}, {"score": 0.002437425029824563, "phrase": "resource-impact_models"}, {"score": 0.0023520340492933383, "phrase": "decision-making_activity"}, {"score": 0.00212175050242788, "phrase": "improved_levels"}, {"score": 0.0021049977753042253, "phrase": "decision_support"}], "paper_keywords": ["Decision Making", " Domain Expertise", " Information Quality", " Observational Analysis", " Resources"], "paper_abstract": "Decision making is a significant activity within industry and although much attention has been paid to the manner in which goals impact on how decision making is executed, there has been less focus on the impact decision making resources can have. This article describes an experiment that sought to provide greater insight into the impact that resources can have on how decision making is executed. Investigated variables included the experience levels of decision makers and the quality and availability of information resources. The experiment provided insights into the variety of impacts that resources can have upon decision making, manifested through the evolution of the approaches, methods, and processes used within it. The findings illustrated that there could be an impact on the decision-making process but not on the method or approach, the method and process but not the approach, or the approach, method, and process. In addition, resources were observed to have multiple impacts, which can emerge in different timescales. Given these findings, research is suggested into the development of resource-impact models that would describe the relationships existing between the decision-making activity and resources, together with the development of techniques for reasoning using these models. This would enhance the development of systems that could offer improved levels of decision support through managing the impact of resources on decision making.", "paper_title": "The impact of resources on decision making", "paper_id": "WOS:000310631200004"}