{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "liver_cancer"}, {"score": 0.04334590190510079, "phrase": "two-dimensional_histogram_analysis"}, {"score": 0.004761494044422926, "phrase": "abdominal_ct_angiography"}, {"score": 0.00445293569103488, "phrase": "liver_cancers"}, {"score": 0.0038725824361608243, "phrase": "dynamic_ct_images"}, {"score": 0.003202361402737197, "phrase": "early_and_late_phase_images"}, {"score": 0.0029447150254434842, "phrase": "suspicious_regions"}, {"score": 0.002895721231882758, "phrase": "false_positives"}, {"score": 0.002800158709933889, "phrase": "liver_cancer_candidates"}, {"score": 0.0027382040767844093, "phrase": "adaptive_neighbor_type_filter"}, {"score": 0.00269263690712392, "phrase": "late_phase_image"}, {"score": 0.0026330549554033876, "phrase": "precise_cancerous_regions"}, {"score": 0.0024620842899061614, "phrase": "false_positive_regions"}, {"score": 0.002276566401216226, "phrase": "proposed_method"}], "paper_keywords": [""], "paper_abstract": "In this paper, we propose a method of detecting liver cancers from dynamic X-ray computed tomography (CT) images based on a two-dimensional histogram analysis. In the diagnosis of a liver, a doctor examines dynamic CT images. These consist of four images, namely the pre-contrast phase, early phase, portal phase, and late phase ones, which are taken sequentially within a few minutes. Since the early and late phase images are important for diagnosing liver cancer, our method refers to both of them for detecting suspicious regions and eliminating false positives. First, it extracts liver cancer candidates by applying an adaptive neighbor type filter to the late phase image. Then, precise cancerous regions are specified by a region forming method. Most of the false positive regions are eliminated by two-dimensional histogram analysis of each region of interest. We applied the proposed method to 21 dynamic CT images. The results showed that sensitivity was 100% and there were 0.33 false positives per case on average.", "paper_title": "Spatiotemporal density feature analysis to detect liver cancer from abdominal CT angiography", "paper_id": "WOS:000235773200070"}