{"auto_keywords": [{"score": 0.035114983443720306, "phrase": "pct"}, {"score": 0.0045726187330434025, "phrase": "challenging_task"}, {"score": 0.004505638402009237, "phrase": "relatively_low_image_contrast"}, {"score": 0.004169692306713217, "phrase": "dramatically_increased_data_size"}, {"score": 0.003705130724701598, "phrase": "novel_one-step_forward_prediction"}, {"score": 0.003584025547693836, "phrase": "motion_manifold_learning"}, {"score": 0.003557653536102669, "phrase": "collaborative_trackers"}, {"score": 0.003479692058963528, "phrase": "temporal_consistency"}, {"score": 0.0034540850937966336, "phrase": "failure_recovery"}, {"score": 0.003292156638306418, "phrase": "best_results"}, {"score": 0.0032558762499901727, "phrase": "new_tracking_algorithm"}, {"score": 0.0025796799784169196, "phrase": "myocardial_regions"}, {"score": 0.0021049977753042253, "phrase": "human_experts'_annotations"}], "paper_keywords": ["Computed tomography (CT)", " heart", " left ventricle", " motion learning", " tracking", " ultrasound"], "paper_abstract": "Robust and fast 3D tracking of deformable objects, such as heart, is a challenging task because of the relatively low image contrast and speed requirement. Many existing 2D algorithms might not be directly applied on the 3D tracking problem. The 3D tracking performance is limited due to dramatically increased data size, landmarks ambiguity, signal drop-out or complex nonrigid deformation. In this paper, we present a robust, fast, and accurate 3D tracking algorithm: prediction based collaborative trackers (PCT). A novel one-step forward prediction is introduced to generate the motion prior using motion manifold learning. Collaborative trackers are introduced to achieve both temporal consistency and failure recovery. Compared with tracking by detection and 3D optical flow, PCT provides the best results. The new tracking algorithm is completely automatic and computationally efficient. It requires less than 1.5 s to process a 3D volume which contains millions of voxels. In order to demonstrate the generality of PCT, the tracker is fully tested on three large clinical datasets for three 3D heart tracking problems with two different imaging modalities: endocardium tracking of the left ventricle (67 sequences, 1134 3D volumetric echocardiography data), dense tracking in the myocardial regions between the epicardium and endocardium of the left ventricle (503 sequences, roughly 9000 3D volumetric echocardiography data), and whole heart four chambers tracking (20 sequences, 200 cardiac 3D volumetric CT data). Our datasets are much larger than most studies reported in the literature and we achieve very accurate tracking results compared with human experts' annotations and recent literature.", "paper_title": "Prediction Based Collaborative Trackers (PCT): A Robust and Accurate Approach Toward 3D Medical Object Tracking", "paper_id": "WOS:000296455500004"}