{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "point_sets"}, {"score": 0.019685950399579405, "phrase": "general_position"}, {"score": 0.004648995193787914, "phrase": "class_c"}, {"score": 0.004612896435506914, "phrase": "geometric_objects"}, {"score": 0.004506265705673849, "phrase": "geometric_graph"}, {"score": 0.00373701482510911, "phrase": "downward_equilateral_triangles"}, {"score": 0.0031474338010045386, "phrase": "td-delaunay_graphs"}, {"score": 0.0031107911390188055, "phrase": "main_result"}, {"score": 0.002681859084438076, "phrase": "structural_properties"}, {"score": 0.00243237365704391, "phrase": "point_graph"}], "paper_keywords": ["Geometric graphs", " Delaunay graphs", " Half-Theta(6) graphs", " Matching"], "paper_abstract": "Given a point set P and a class C of geometric objects, G(C)(P) is a geometric graph with vertex set P such that any two vertices p and q are adjacent if and only if there is some C is an element of C containing both p and q but no other points from P. We study G(del)(P) graphs where del is the class of downward equilateral triangles (i.e., equilateral triangles with one of their sides parallel to the x-axis and the corner opposite to this side below that side). For point sets in general position, these graphs have been shown to be equivalent to half-Theta(6) graphs and TD-Delaunay graphs. The main result in our paper is that for point sets P in general position, G(del)(P) always contains a matching of size at least [vertical bar P vertical bar-1/3] and this bound is tight. We also give some structural properties of G(star)(P) graphs, where is the class which contains both upward and downward equilateral triangles. We show that for point sets in general position, the block cut point graph of G(star)(P) is simply a path. Through the equivalence of G(star)(P) graphs with Theta(6) graphs, we also derive that any Theta(6) graph can have at most 5n-11 edges, for point sets in general position. (C) 2013 Elsevier B.V. All rights reserved.", "paper_title": "Fixed-orientation equilateral triangle matching of point sets", "paper_id": "WOS:000343627600007"}