{"auto_keywords": [{"score": 0.03350563390008005, "phrase": "multilayer_perceptron-based_models"}, {"score": 0.004717485406306594, "phrase": "bilbao_area"}, {"score": 0.004206880808350464, "phrase": "bilbao"}, {"score": 0.0041727828166922215, "phrase": "spain"}, {"score": 0.003892126266260425, "phrase": "traffic_variables"}, {"score": 0.0038603905208013482, "phrase": "meteorological_variables"}, {"score": 0.00347054319869429, "phrase": "observed_values"}, {"score": 0.003277140908834426, "phrase": "developed_models"}, {"score": 0.003210704011271791, "phrase": "improved_performance"}, {"score": 0.0031327496009959464, "phrase": "multiple_linear_regression_model"}, {"score": 0.0028981662457413177, "phrase": "mlp"}, {"score": 0.0027141975147496264, "phrase": "model_performance"}, {"score": 0.0024099937116733227, "phrase": "forecasted_values"}, {"score": 0.0023418133729330303, "phrase": "future_research"}, {"score": 0.002202123699556382, "phrase": "multilayer_perceptron_modelling"}, {"score": 0.002157433262687853, "phrase": "matlab_software_package"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["air quality modelling", " neural networks", " multilayer perceptron", " multiple linear regression"], "paper_abstract": "In this paper, we present the results obtained using three prognostic models to forecast ozone (O-3) and nitrogen dioxide (NO2) levels in real-time LIP to 8 h ahead at four stations in Bilbao (Spain). Two multilayer perceptron (MLP) based models and one multiple linear regression based model were developed. The models utilised traffic variables, meteorological variables and O-3 and NO2 hourly levels as input data, which were measured from 1993 to 1994. The performances of these three models were compared with persistence of levels and the observed values. The statistics of the Model Validation Kit determined the goodness of the fit of the developed models. The results indicated improved performance for the multilayer perceptron-based models over the multiple linear regression model. Furthermore, comparisons of the results of the multilayer perceptron-based models proved that the insertion of four additional seasonal input variables in the MLP provided the ability of obtaining more accurate predictions. The comparison of the results indicated that this model performance was more efficient in the forecasts of O-3 and NO2 hourly levels k hours ahead (k = 1, 4, 5 6 7, 8) but not in the forecasted values 2 and 3 h ahead. Future research in this area could allow us to improve results for the above forecasts. The multilayer perceptron modelling was developed using the MATLAB software package. (c) 2004 Elsevier Ltd. All rights reserved.", "paper_title": "Regression and multilayer perceptron-based models to forecast hourly O-3 and NO2 levels in the Bilbao area", "paper_id": "WOS:000236332600002"}