{"auto_keywords": [{"score": 0.024692370903391412, "phrase": "loa"}, {"score": 0.00481495049065317, "phrase": "floridi's_method"}, {"score": 0.004448169552315403, "phrase": "modern_science"}, {"score": 0.004324031677173549, "phrase": "complex_phenomena"}, {"score": 0.0040171817997972335, "phrase": "oxford_university_press"}, {"score": 0.003971970858852889, "phrase": "oxford"}, {"score": 0.003689982350051231, "phrase": "main_method"}, {"score": 0.0033511469200347907, "phrase": "formal_methods"}, {"score": 0.0032760377953971248, "phrase": "computer_science"}, {"score": 0.0031131208154718867, "phrase": "programming_languages"}, {"score": 0.003078028357912228, "phrase": "design_methodologies"}, {"score": 0.0024814079299143536, "phrase": "semantic_information"}, {"score": 0.002202742267484358, "phrase": "extended_method"}, {"score": 0.0021049977753042253, "phrase": "abstract_machines"}], "paper_keywords": ["Levels of abstraction", " Directives", " Annotations"], "paper_abstract": "The is arguably one of the most important methods in modern science in analysing and understanding complex phenomena. In his book The Philosophy of Information, Floridi (The philosophy of information. Oxford University Press, Oxford, 2011) presents the method of levels of abstraction as the main method of the Philosophy of Information. His discussion of abstraction as a method seems inspired by the formal methods and frameworks of computer science, in which abstraction is operationalised extensively in programming languages and design methodologies. Is it really clear what we should understand by levels of abstraction? How should they be specified? We will argue that levels of abstraction should be augmented with annotations, in order to express semantic information for them and reconcile the method of level of abstraction (LoA's) with other approaches. We discuss the extended method when applied e.g. to the analysis of abstract machines. This will lead to an example in which the number of LoA's is unbounded.", "paper_title": "On Floridi's Method of Levels of Abstraction", "paper_id": "WOS:000330173400002"}