{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "deadbeat-based_pi_controller"}, {"score": 0.03268091912168994, "phrase": "current_spikes"}, {"score": 0.032263630239095606, "phrase": "h-bridge_inverter"}, {"score": 0.004767451673469903, "phrase": "single-phase_h-bridge_inverter"}, {"score": 0.004551883842967241, "phrase": "stand-alone_single-phase_voltage_source_inverter"}, {"score": 0.004447766706144458, "phrase": "primary_energy_source"}, {"score": 0.004403874076980828, "phrase": "inverter_system"}, {"score": 0.004260656420599919, "phrase": "lead_acid_battery"}, {"score": 0.0042325743185503825, "phrase": "third-order_butterworth_low-pass_dc_filter"}, {"score": 0.004204999527680262, "phrase": "ac"}, {"score": 0.00409490456027741, "phrase": "step-up_transformer"}, {"score": 0.0037203741725514126, "phrase": "abrupt_load_changes"}, {"score": 0.0035519826240477444, "phrase": "inductive_load"}, {"score": 0.0032376465741070274, "phrase": "battery_voltage"}, {"score": 0.0031218852898830755, "phrase": "smooth_ripple"}, {"score": 0.00290259605431505, "phrase": "dc_filter"}, {"score": 0.00280806350681826, "phrase": "spwm_controller"}, {"score": 0.002663156413861478, "phrase": "sinusoidal_inverter_output_voltage"}, {"score": 0.0022122603123901114, "phrase": "output_load_voltage"}, {"score": 0.0021903801614787423, "phrase": "desired_value"}, {"score": 0.0021049977753042253, "phrase": "minimum_thdv"}], "paper_keywords": ["Stand-alone", " single-phase inverter", " deadbeat", " battery cell", " low-pass filter", " sinusoidal pulse-width-modulation", " PI controller", " Butterworth filter"], "paper_abstract": "This paper presents a deadbeat-based proportional-integral (PI) controller for a stand-alone single-phase voltage source inverter using a battery cell as the primary energy source. The inverter system is simulated in MATLAB/Simulink. It consists of a lead acid battery, third-order Butterworth low-pass DC filter and AC filter, H-bridge inverter, step-up transformer, and a variety of loads, as well as its sinusoidal pulse-width modulation (SPWM) deadbeat-based PI controller. In this paper, 2 simulation case studies are carried out, which are the abrupt load changes from a 400 W resistive load to a 500 W resistive load, and from a 400 W resistive load to an inductive load of 500 W 0.85 power factor lagging. From the simulation results for both cases, the state-of-charge of the battery decreases due to supplying power to the loads, yet the battery voltage remains constant at about 36 V and the battery current exhibits a smooth ripple despite the current spikes produced by the H-bridge inverter, which will prolong the lifespan of the battery. This shows that the DC filter performs satisfactorily to isolate the current spikes generated by the SPWM controller and H-bridge inverter. Moreover, even though the load varies for both cases, the sinusoidal inverter output voltage can be tracked and maintained at 230 V-rms with a 50 Hz frequency within a few cycles from the instant that the load is changed, as well as a low total harmonic distortion voltage (THDv) content of 1.53% and 2.78%, respectively. This indicates that the controller proves its robustness and stiffness characteristics in maintaining the output load voltage at the desired value to supply the power for a variety of loads with a minimum THDv.", "paper_title": "Modeling and simulation of deadbeat-based PI controller in a single-phase H-bridge inverter for stand-alone applications", "paper_id": "WOS:000329163200005"}