{"auto_keywords": [{"score": 0.04960770684597511, "phrase": "sequence-dependent_setup"}, {"score": 0.04822029140240176, "phrase": "total_completion_time"}, {"score": 0.04776606071215511, "phrase": "total_tardiness"}, {"score": 0.00481495049065317, "phrase": "hybrid_flowshops"}, {"score": 0.004212759658511567, "phrase": "hybrid_flowshop_problems"}, {"score": 0.003815607281455725, "phrase": "hybrid_flowshop_scheduling"}, {"score": 0.0033379819706003885, "phrase": "intensification_and_diversification_mechanisms"}, {"score": 0.0032724821705972357, "phrase": "competitive_performance"}, {"score": 0.00320826350799124, "phrase": "comprehensive_calibration"}, {"score": 0.003176626803985225, "phrase": "different_parameters"}, {"score": 0.003053159610975692, "phrase": "taguchi_method"}, {"score": 0.002993231973906559, "phrase": "optimum_parameters"}, {"score": 0.0029490571526071016, "phrase": "least_possible_number"}, {"score": 0.002834409847642238, "phrase": "performance_evaluation"}, {"score": 0.002657511557782469, "phrase": "high_performing_algorithms"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Scheduling", " Hybrid flowshop", " Transportation time", " Sequence-dependent setup times", " Total tardiness", " Total completion time", " Hybrid simulated annealing", " Local search"], "paper_abstract": "In this communication, we strive to apply a novel simulated annealing to consider scheduling hybrid flowshop problems to minimize both total completion time and total tardiness. To narrow the gap between the theory and the practice of the hybrid flowshop scheduling, we integrate two realistic and practical assumptions which are sequence-dependent setup and transportation times into our problem. We apply a metaheuristic based on simulated annealing (SA) which strikes a compromise between intensification and diversification mechanisms to augment the competitive performance of our proposed SA. A comprehensive calibration of different parameters and operators are done. We employ Taguchi method to select the optimum parameters with the least possible number of experiments. For the purpose of performance evaluation of our proposed algorithm, we generate a benchmark against which the adaptations of high performing algorithms in the literature are brought into comparison. Moreover, we investigate the impacts of increase of number of jobs on the Performance of our algorithm. The efficiency and effectiveness of our hybrid simulated annealing are inferred from all the computational results obtained in various situations. (C) 2008 Published by Elsevier Ltd.", "paper_title": "An improved simulated annealing for hybrid flowshops with sequence-dependent setup and transportation times to minimize total completion time and total tardiness", "paper_id": "WOS:000266086600003"}