{"auto_keywords": [{"score": 0.04508893681963009, "phrase": "semantical_types"}, {"score": 0.011807140784862055, "phrase": "internal_completeness"}, {"score": 0.01035981967536743, "phrase": "original_formulation"}, {"score": 0.008891936909751366, "phrase": "different_settings"}, {"score": 0.00481495049065317, "phrase": "ludics_with_repetitions"}, {"score": 0.004780000048519608, "phrase": "exponentials"}, {"score": 0.004642109045899971, "phrase": "ludics"}, {"score": 0.004524801966077539, "phrase": "game_semantics"}, {"score": 0.0038804410204616954, "phrase": "logical_formulas"}, {"score": 0.0038380787059463075, "phrase": "fundamental_property"}, {"score": 0.0035802796531956413, "phrase": "standard_full_completeness"}, {"score": 0.0035025108234594668, "phrase": "growing_body"}, {"score": 0.003376619185594497, "phrase": "specific_interactive_approach"}, {"score": 0.0030925761790620027, "phrase": "mall_proofs"}, {"score": 0.002832359116458113, "phrase": "mall_proof-like_strategies"}, {"score": 0.002500662348528587, "phrase": "interactive_types"}, {"score": 0.002419542935774618, "phrase": "full_completeness_w.r.t"}, {"score": 0.0023669274399741743, "phrase": "mell."}, {"score": 0.0022239665922395104, "phrase": "independent_interest"}, {"score": 0.0021049977753042253, "phrase": "larger_domains"}], "paper_keywords": ["linear logic", " ludics", " game semantics", " internal completeness"], "paper_abstract": "Ludics is peculiar in the panorama of game semantics: we first have the definition of interaction-composition and then we have semantical types, as a set of strategies which \"behave well\" and react in the same way to a set of tests. The semantical types which are interpretations of logical formulas enjoy a fundamental property, called internal completeness, which characterizes ludics and sets it apart also from realizability. Internal completeness entails standard full completeness as a consequence. A growing body of work start to explore the potential of this specific interactive approach. However, ludics has some limitations, which are consequence of the fact that in the original formulation, strategies are abstractions of MALL proofs. On one side, no repetitions are allowed. On the other side, the proofs tend to rely on the very specific properties of the MALL proof-like strategies, making it difficult to transfer the approach to semantical types into different settings. In this paper, we provide an extension of ludics which allows repetitions and show that one can still have interactive types and internal completeness. From this, we obtain full completeness w.r.t. a polarized version of MELL. In our extension, we use less properties than in the original formulation, which we believe is of independent interest. We hope this may open the way to applications of ludics approach to larger domains and different settings.", "paper_title": "LUDICS WITH REPETITIONS (EXPONENTIALS, INTERACTIVE TYPES AND COMPLETENESS)", "paper_id": "WOS:000301227100012"}