{"auto_keywords": [{"score": 0.0453665111651286, "phrase": "software_development_methods"}, {"score": 0.015719716506582538, "phrase": "software_industry"}, {"score": 0.014401204507405636, "phrase": "software_development"}, {"score": 0.004779578364339664, "phrase": "norway"}, {"score": 0.004640590144749795, "phrase": "software_development_methodologies"}, {"score": 0.004231699728933577, "phrase": "usability_work"}, {"score": 0.004139028737420222, "phrase": "industrial_software_projects"}, {"score": 0.0040783736687590635, "phrase": "previous_research"}, {"score": 0.003945117054416623, "phrase": "software_companies"}, {"score": 0.0037602557461171478, "phrase": "industrial_projects"}, {"score": 0.0034160263294684785, "phrase": "norwegian_it_industry"}, {"score": 0.003080365929916083, "phrase": "positive_bias"}, {"score": 0.0030017207229983385, "phrase": "usability_testing"}, {"score": 0.0028928306994090453, "phrase": "usability_requirements"}, {"score": 0.002850385670169814, "phrase": "strong_time"}, {"score": 0.0024136132575631273, "phrase": "earlier_research"}, {"score": 0.002120624523437494, "phrase": "general_use"}, {"score": 0.0021049977753042253, "phrase": "system_development_methods"}], "paper_keywords": ["software development methods", " usability", " software industry", " survey"], "paper_abstract": "This paper investigates the relationship between software development methodologies and usability. The point of departure is the assumption that two important disciplines in software development, one of software development methods (SDMs) and one of usability work, are not integrated in industrial software projects. Building on previous research we investigate two questions; (1) Will software companies generally acknowledge the importance of usability, but not prioritise it in industrial projects? and (2) To what degree are software development methods and usability perceived by practitioners as being integrated? To this end a survey in the Norwegian IT industry was conducted. From a sample of 259 companies we received responses from 78 companies. In response to our first research question, our findings show that although there is a positive bias towards usability, the importance of usability testing is perceived to be much less than that of usability requirements. Given the strong time and cost pressures associated with the software industry, we believe that these results highlight that there is a gap between intention and reality. Regarding our second research question our survey revealed that companies perceive usability and software development methods to be integrated. This is in contrast to earlier research, which, somewhat pessimistically, has argued for the existence of two different cultures, one of software development and one of usability. The findings give hope for the future, in particular because the general use of system development methods are pragmatic and adaptable. (C) 2008 Elsevier B.V. All rights reserved.", "paper_title": "Software development methods and usability: Perspectives from a survey in the software industry in Norway", "paper_id": "WOS:000256629800011"}