{"auto_keywords": [{"score": 0.049481323529186536, "phrase": "finite-state_properties"}, {"score": 0.012297509318061959, "phrase": "clara"}, {"score": 0.008446834720672355, "phrase": "runtime_monitor"}, {"score": 0.006472019818993688, "phrase": "partial_evaluation"}, {"score": 0.006351374981959094, "phrase": "residual_monitor"}, {"score": 0.00481495049065317, "phrase": "finite-state_runtime_monitors_ahead"}, {"score": 0.00469545352928726, "phrase": "important_class"}, {"score": 0.004666043394407466, "phrase": "program_properties"}, {"score": 0.0044372687709897446, "phrase": "manually_written_finite-state_monitors"}, {"score": 0.004246271940215511, "phrase": "explicit_specification"}, {"score": 0.004063462779895253, "phrase": "runtime_monitoring"}, {"score": 0.0034073545850838, "phrase": "increasing_cost"}, {"score": 0.0032811244238035455, "phrase": "time_evaluation"}, {"score": 0.002957516535697149, "phrase": "remaining_cases"}, {"score": 0.0028034359621434486, "phrase": "program_locations"}, {"score": 0.0026490090146527407, "phrase": "full_monitor"}, {"score": 0.002599442416948628, "phrase": "property_violations"}, {"score": 0.002456224752333807, "phrase": "aspectj-based_runtime_monitors"}, {"score": 0.0021792054532842682, "phrase": "monitoring_overhead"}, {"score": 0.0021049977753042253, "phrase": "stated_properties"}], "paper_keywords": ["Algorithms", " Experimentation", " Performance", " Verification", " Typestate analysis", " static analysis", " runtime monitoring"], "paper_abstract": "Finite-state properties account for an important class of program properties, typically related to the order of operations invoked on objects. Many library implementations therefore include manually written finite-state monitors to detect violations of finite-state properties at runtime. Researchers have recently proposed the explicit specification of finite-state properties and automatic generation of monitors from the specification. However, runtime monitoring only shows the presence of violations, and typically cannot prove their absence. Moreover, inserting a runtime monitor into a program under test can slow down the program by several orders of magnitude. In this work, we therefore present a set of four static whole-program analyses that partially evaluate runtime monitors at compile time, with increasing cost and precision. As we show, ahead-of-time evaluation can often evaluate the monitor completely statically. This may prove that the program cannot violate the property on any execution or may prove that violations do exist. In the remaining cases, the partial evaluation converts the runtime monitor into a residual monitor. This monitor only receives events from program locations that the analyses failed to prove irrelevant. This makes the residual monitor much more efficient than a full monitor, while still capturing all property violations at runtime. We implemented the analyses in CLARA, a novel framework for the partial evaluation of AspectJ-based runtime monitors, and validated our approach by applying CLARA to finite-state properties over several large-scale Java programs. CLARA proved that most of the programs never violate our example properties. Some programs required monitoring, but in those cases CLARA could often reduce the monitoring overhead to below 10%. We observed that several programs did violate the stated properties.", "paper_title": "Partially Evaluating Finite-State Runtime Monitors Ahead of Time", "paper_id": "WOS:000305977300001"}