{"auto_keywords": [{"score": 0.04712665802421912, "phrase": "open_access"}, {"score": 0.004785896736401194, "phrase": "purpose_-_the_purpose"}, {"score": 0.00460125407969429, "phrase": "journal_papers"}, {"score": 0.004559661374976129, "phrase": "major_step"}, {"score": 0.004437115547184535, "phrase": "copyright_transfer_agreements"}, {"score": 0.004051828608343507, "phrase": "easy_access"}, {"score": 0.0040273609512482, "phrase": "publishers'_policies"}, {"score": 0.003942877273973905, "phrase": "colour-coding_scheme"}, {"score": 0.0036332251283046997, "phrase": "individual_publishers"}, {"score": 0.002938688858078236, "phrase": "underlying_principles"}, {"score": 0.0028595832692215766, "phrase": "large_number"}, {"score": 0.0027910516355928983, "phrase": "controlled_vocabulary"}, {"score": 0.0023694065215394593, "phrase": "self-archiving_colour"}, {"score": 0.0023125950237602518, "phrase": "colour_assignment"}, {"score": 0.0022640009579466924, "phrase": "repository_administrators"}, {"score": 0.002236691727668501, "phrase": "academic_papers"}, {"score": 0.002124247104243502, "phrase": "publisher_classification"}, {"score": 0.0021049977753042253, "phrase": "open_access_environment"}], "paper_keywords": ["archiving", " archives management", " databases", " copyright law"], "paper_abstract": "Purpose - The purpose of this research is to show how the self-archiving of journal papers is a major step towards providing open access to research. However, copyright transfer agreements (CTAs) that are signed by an author prior to publication often indicate whether, and in what form, self-archiving is allowed. The SHERPA/RoMEO database enables easy access to publishers' policies in this area and uses a colour-coding scheme to classify publishers according to their self-archiving status. The database is currently being redeveloped and renamed the Copyright Knowledge Bank. However, it will still assign a colour to individual publishers indicating whether pre-prints can be self-archived (yellow), post-prints can be self-archived (blue), both pre-print and post-print can be archived (green) or neither (white). The nature of CTAs means that these decisions are rarely as straightforward as they may seem, and this paper describes the thinking and considerations that were used in assigning these colours in the light of the underlying principles and definitions of open access. Design/methodology/approach - Detailed analysis of a large number of CTAs led to the development of controlled vocabulary of terms which was carefully analysed to determine how these terms equate to the definition and \"spirit\" of open access. Findings - The paper reports on how conditions outlined by publishers in their CTAs, such as how or where a paper can be self-archived, affect the assignment of a self-archiving colour to the publisher. Originality/value - The colour assignment is widely used by authors and repository administrators in determining whether academic papers can be self-archived. This paper provides a starting-point for further discussion and development of publisher classification in the open access environment.", "paper_title": "RoMEO studies 8: self-archiving - The logic behind the colour-coding used in the Copyright Knowledge Bank", "paper_id": "WOS:000246237500002"}