{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "multiobjective_test_problems"}, {"score": 0.03962151848514054, "phrase": "ea_literature"}, {"score": 0.03301542427853415, "phrase": "important_class"}, {"score": 0.004753512932910936, "phrase": "scalable_test_problem"}, {"score": 0.004326188427877999, "phrase": "strong_understanding"}, {"score": 0.004074397977869244, "phrase": "multiobjective_evolutionary_algorithms"}, {"score": 0.0035676056286816915, "phrase": "accurate_conclusions"}, {"score": 0.0029416448256236057, "phrase": "test_problem_criteria"}, {"score": 0.0027583557819362034, "phrase": "test_problems"}, {"score": 0.0025315664299815537, "phrase": "nonseparable_problems"}, {"score": 0.0023333715029833007, "phrase": "flexible_toolkit"}, {"score": 0.0023035249767734286, "phrase": "well-designed_test_problems"}, {"score": 0.0021049977753042253, "phrase": "existing_test_suites"}], "paper_keywords": ["evolutionary algorithms (EAs)", " multiobjective evolutionary algorithms", " multiobjective optimization", " multiobjective test problems"], "paper_abstract": "When attempting to better understand the strengths and weaknesses of an algorithm, it is important to have a strong understanding of the problem at hand. This is true for the field of multiobjective evolutionary algorithms (EAs) as it is for any other field. Many of the multiobjective test problems employed in the EA literature have not been rigorously analyzed, which makes it difficult to draw accurate conclusions about the strengths and weaknesses of the algorithms tested on them. In this paper, we systematically review and analyze many problems from the EA literature, each belonging to the important class of real-valued, unconstrained, multiobjective test problems. To support this, we first introduce a set of test problem criteria, which are in turn supported by a set of definitions. Our analysis of test problems highlights a number of areas requiring attention. Not only are many test problems poorly constructed but also the important class of nonseparable problems, particularly nonseparable multimodal problems, is poorly represented. Motivated by these findings, we present a flexible toolkit for constructing well-designed test problems. We also present empirical results demonstrating how the toolkit can be used to test an optimizer in ways that existing test suites do not.", "paper_title": "A review of multiobjective test problems and a scalable test problem toolkit", "paper_id": "WOS:000241005800001"}