{"auto_keywords": [{"score": 0.04496930556292013, "phrase": "text_classification"}, {"score": 0.04035919930938948, "phrase": "application_context"}, {"score": 0.02695501214392698, "phrase": "experiment_results"}, {"score": 0.00481495049065317, "phrase": "irrelevant_information"}, {"score": 0.004721711709176679, "phrase": "minimum_class_difference"}, {"score": 0.0037888687452790953, "phrase": "important_factor"}, {"score": 0.002729246328390722, "phrase": "pbmcd_algorithm"}, {"score": 0.0024028135317872, "phrase": "irrelevant_features"}, {"score": 0.0023677483882740317, "phrase": "classification_process"}, {"score": 0.00229914226836813, "phrase": "classification_accuracy"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["classification", " text categorization", " feature selection", " preprocess"], "paper_abstract": "Whether a word (or a feature) should be included or excluded during the process of text classification could depend on a number of factors, such as the amount of information it represents, its appearance frequency and its meaning. The application context is another important factor that needs to be considered. A word may be able to represent the characteristic of a document in one application context but may not reflect its nature in another. This paper reports on an investigation into the selection of features for classification with the consideration of the application context of the documents to be processed. A new feature selection algorithm for text classification to be known as the PBMCD algorithm is proposed. This algorithm has been implemented and tested using three different data sets. The experiment results have shown that this algorithm cannot only filter out irrelevant features before the classification process but also can increase the classification accuracy. As a comparison, experiment results with other methods have also been presented. (c) 2006 Elsevier B.V. All rights reserved.", "paper_title": "A preprocess algorithm of filtering irrelevant information based on the minimum class difference", "paper_id": "WOS:000240968600006"}