{"auto_keywords": [{"score": 0.04989517453257004, "phrase": "japan"}, {"score": 0.00726410451794729, "phrase": "case_study"}, {"score": 0.005180500086781923, "phrase": "governmental_policy"}, {"score": 0.005140854437229755, "phrase": "hit_adoption"}, {"score": 0.004843663460038374, "phrase": "kyoto_yamashina_area"}, {"score": 0.00481495049065317, "phrase": "information_technology"}, {"score": 0.004615656893404919, "phrase": "economic_recovery_plan"}, {"score": 0.004563581861721512, "phrase": "hit"}, {"score": 0.004527804152066942, "phrase": "healthcare_information_technology"}, {"score": 0.00443308765153716, "phrase": "hit_efforts"}, {"score": 0.003995969876221671, "phrase": "hit_use"}, {"score": 0.0038898296735548916, "phrase": "current_policy"}, {"score": 0.003815739105213385, "phrase": "data_collection_techniques"}, {"score": 0.003757480190200645, "phrase": "policy_making"}, {"score": 0.003714368305523811, "phrase": "japanese_healthcare_professionals"}, {"score": 0.0036646935906338414, "phrase": "hit_research"}, {"score": 0.003608732492631878, "phrase": "medical_community"}, {"score": 0.0035067291864304116, "phrase": "medical_communities"}, {"score": 0.0034993519231560637, "phrase": "government_policy"}, {"score": 0.003485913728272778, "phrase": "hit_policy"}, {"score": 0.0034725269588525534, "phrase": "user_assessment"}, {"score": 0.0034326732528567826, "phrase": "case_study_site"}, {"score": 0.0033672608231654897, "phrase": "hit_progression_and_effectiveness_assessments"}, {"score": 0.0031845067058084583, "phrase": "successful_hit_initiatives"}, {"score": 0.0030998533536485784, "phrase": "pressing_social_issues"}, {"score": 0.0030879445572888804, "phrase": "healthcare_delivery"}, {"score": 0.003034916887102753, "phrase": "standardized_protocols"}, {"score": 0.002954228277691572, "phrase": "inter-organizational_or_intra-organizational_health_information_exchange"}, {"score": 0.002837188425640173, "phrase": "current_resources"}, {"score": 0.002804605889504597, "phrase": "lesser_equipped_organizations"}, {"score": 0.002735284807307981, "phrase": "area_initiative"}, {"score": 0.0026934777251033776, "phrase": "current_intent"}, {"score": 0.002381169982803105, "phrase": "solution_development"}, {"score": 0.0023492829714722636, "phrase": "sustainable_business_models"}, {"score": 0.002282380944889266, "phrase": "healthcare_reform"}, {"score": 0.0022388390432214415, "phrase": "area_medical_community"}, {"score": 0.0021625417261202603, "phrase": "successful_projects"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ireland_ltd."}], "paper_keywords": ["Electronic medical records", " Electronic health records", " Health information technology", " Health information exchange", " Healthcare reform"], "paper_abstract": "Purpose: Healthcare reform as part of the economic recovery plan in Japan is placing emphasis on the use of healthcare information technology (HIT). This research mainly focuses on the HIT efforts in Japan with reference to the US for context. The purpose is to: (a) provide detail on governmental policy impacting promotion of HIT adoption to provide services to the people of Japan, (b) describe the outcomes of past and present policy impacting progress based on a case study of HIT use in the Kyoto Yamashina area, and (c) discuss issues for refinement of current policy. Methods: The method is case study, and data collection techniques include: (a) interviews of people involved in policy making for HIT in Japan (Japanese healthcare professionals, government officials, and academics involved in HIT research in Japan) and use in the medical community of HIT in the Kyoto Yamashina area, (b) archived document analysis of reports regarding government policy for HIT policy and user assessment for HIT mainly in the case study site, and (c) the literature review about HIT progression and effectiveness assessments to explore and describe issues concerning the transformation with HIT in Japan. Results: This study reveals the aspects of governmental policy that have been effective in promoting successful HIT initiatives as well as some that have been detriments in Japan to help solve pressing social issues regarding healthcare delivery. For example, Japan has stipulated some standardized protocols and formats for HIT but does not mandate exactly how to engage in inter-organizational or intra-organizational health information exchange. This provides some desired autonomy for healthcare organizations and or governments in medical communities and allows for more advanced organizations to leverage current resources while providing a basis for lesser equipped organizations to use in planning the initiative. The insights gained from the Kyoto Yamashina area initiative reflect the success of past governmental policy efforts and the current intent to promote HIT adoption. Insights from the case study as well as other social issues facing Japan warrant some refinement of policy. The refinement concerns: (a) the necessity for leadership and IT knowledge in the medical communities, (b) provider incentives, (c) legislation regarding accountability, security, privacy and confidentiality, (d) inclusion of stakeholders in solution development, and (e) creating sustainable business models. Conclusion: The research highlights the efforts of Japan for using HIT in healthcare reform. We present outcomes from a case study of the Kyoto Yamashina area medical community as proof of concept for past and present policy in Japan that are insightful for proliferation of successful projects in Japan and adoption of HIT in general. (C) 2011 Elsevier Ireland Ltd. All rights reserved.", "paper_title": "Transforming healthcare with information technology in Japan: A review of policy, people, and progress", "paper_id": "WOS:000287231900002"}