{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "social_network_analysis"}, {"score": 0.04811914031577567, "phrase": "co-occurrence_network"}, {"score": 0.04008010591131817, "phrase": "online_resources"}, {"score": 0.013200477971152197, "phrase": "social_tagging"}, {"score": 0.00415019999222481, "phrase": "new_approaches"}, {"score": 0.003644001325962353, "phrase": "citeulike_website"}, {"score": 0.003125835572347772, "phrase": "social_networks"}, {"score": 0.0029152570900178956, "phrase": "periphery_categorical_analysis"}, {"score": 0.0027827907725673845, "phrase": "online_tags"}, {"score": 0.0026440008776012665, "phrase": "\"small_world\"_phenomenon"}, {"score": 0.002431626477893495, "phrase": "stable_areas"}, {"score": 0.0024091057723923857, "phrase": "core_knowledge"}, {"score": 0.0023537101705489957, "phrase": "five_possible_applications"}, {"score": 0.002278284823857861, "phrase": "greatest_significance"}, {"score": 0.0021049977753042253, "phrase": "effective_way"}], "paper_keywords": ["Social network analysis", " CiteULike", " Folksonomy", " Recommendation", " Social tagging", " Tag co-occurrence network"], "paper_abstract": "Purpose - This paper aims to explore explores the characteristics of the co-occurrence network of online tags and propose new approaches of applying social network analysis by utilising social tagging in order to organise data. Design/methodology/approach - The authors collected online resources labelled \"tag\" from 7 November 2004 to 31 October 2011 from the CiteULike website, comprising 684 papers and their URLs, titles and data on tagging (users, times, and tags). They examined the co-occurrence network of online tags by using the analyses of social networks, including the analysis of coherence, the analysis of centricity and core to periphery categorical analysis. Findings - Some features of the co-occurrence of online tags are as follows: the internet is subject to the \"small world\" phenomenon, as well as being \"scale-free\". The structure of the internet reflects stable areas of core knowledge. In addition to five possible applications of social network analysis, social tagging has the greatest significance in organising online resources. Originality/value - This research finds that co-occurrence of tags online is an effective way to organise and index data. Some suggestions are provided on the organisation of online resources.", "paper_title": "Utilising social network analysis to study the characteristics and functions of the co-occurrence network of online tags", "paper_id": "WOS:000333794700004"}