{"auto_keywords": [{"score": 0.04376009469235903, "phrase": "visual_representation"}, {"score": 0.04336705121455173, "phrase": "user's_hand"}, {"score": 0.00481495049065317, "phrase": "handled_object"}, {"score": 0.004784909348794283, "phrase": "hand_image_deformation"}, {"score": 0.004622986791421418, "phrase": "perception-based_shape_display_system"}, {"score": 0.004494570360108983, "phrase": "virtual_objects"}, {"score": 0.004466519142879166, "phrase": "varying_shapes"}, {"score": 0.004301834610818624, "phrase": "curved_surface_shapes"}, {"score": 0.004274981117736524, "phrase": "edge_angles"}, {"score": 0.003990385737207714, "phrase": "multifinger_touch"}, {"score": 0.003940706575253453, "phrase": "spatial_unconformity"}, {"score": 0.003487489029588045, "phrase": "perceived_shape"}, {"score": 0.0032246835734680377, "phrase": "visual_object"}, {"score": 0.003095923814666088, "phrase": "different_shape"}, {"score": 0.002962986184540317, "phrase": "visuo-haptic_interaction"}, {"score": 0.002431797888365548, "phrase": "perceived_sizes"}, {"score": 0.002283913454238574, "phrase": "physical_and_visual_stimuli"}, {"score": 0.0021517438495635634, "phrase": "shape_perception_modification"}, {"score": 0.0021049977753042253, "phrase": "multiple_fingers"}], "paper_keywords": [""], "paper_abstract": "In this study, we aim to construct a perception-based shape display system to provide users with the sensation of touching virtual objects of varying shapes using only a simple mechanism. Thus far, we have proved that identified curved surface shapes or edge angles can be modified by displacing the visual representation of the user's hand. However, using this method, we cannot emulate multifinger touch, because of spatial unconformity. To solve this problem, we focus on modifying the identification of shapes using two fingers by deforming the visual representation of the user's hand. We devised a video see-through system that enables us to change the perceived shape of an object that a user is touching visually. The visual representation of the user's hand is deformed as if the user were handling a visual object; however, the user is actually handling an object of a different shape. Using this system, we conducted two experiments to investigate the effects of visuo-haptic interaction and evaluate its effectiveness. One is an investigation on the modification of size perception to confirm that the fingers did not stroke the shape but only touched it statically. The other is an investigation on the modification of shape perception for confirming that the fingers dynamically stroked the surface of the shape. The results of these experiments show that the perceived sizes of objects handled using a thumb and other finger(s) could be modified if the difference between the size of physical and visual stimuli was in the -40% to 35% range. In addition, we found that the algorithm can create an effect of shape perception modification when users stroke the shape with multiple fingers.", "paper_title": "Modifying Perceived Size of a Handled Object through Hand Image Deformation", "paper_id": "WOS:000331541300005"}