{"auto_keywords": [{"score": 0.04887366145178026, "phrase": "editorial_boards"}, {"score": 0.010612387000973441, "phrase": "information_systems"}, {"score": 0.00437021209960886, "phrase": "american_society"}, {"score": 0.0043258453436258405, "phrase": "information_science"}, {"score": 0.003946195919158241, "phrase": "usual_bibliographic_indicators"}, {"score": 0.0038467574225322086, "phrase": "human_cornerstone"}, {"score": 0.003788296551609616, "phrase": "peer-reviewed_journal"}, {"score": 0.0036740168936985314, "phrase": "demographic_data"}, {"score": 0.003334309053314909, "phrase": "descriptive_statistics"}, {"score": 0.003250238918180901, "phrase": "great_variety"}, {"score": 0.0031521392193570846, "phrase": "research_output"}, {"score": 0.0025694584194998335, "phrase": "general_public"}, {"score": 0.0024414225109100672, "phrase": "journal_gatekeepers"}, {"score": 0.002416589459425828, "phrase": "policy_makers"}, {"score": 0.0023197517832705297, "phrase": "scholarly_communication"}, {"score": 0.0022154296909169826, "phrase": "scientometric_study"}, {"score": 0.0021705796895687864, "phrase": "online_supplementary_material"}], "paper_keywords": ["scientometrics", " scholarly communication", " gatekeepers"], "paper_abstract": "Characteristics of the Journal of the American Society for Information Science and Technology and 76 other journals listed in the Information Systems category of the Journal Citation ReportsScience edition 2009 were analyzed. Besides reporting usual bibliographic indicators, we investigated the human cornerstone of any peer-reviewed journal: its editorial board. Demographic data about the 2,846 gatekeepers serving in information systems (IS) editorial boards were collected. We discuss various scientometric indicators supported by descriptive statistics. Our findings reflect the great variety of IS journals in terms of research output, author communities, editorial boards, and gatekeeper demographics (e.g., diversity in gender and location), seniority, authority, and degree of involvement in editorial boards. We believe that these results may help the general public and scholars (e.g., readers, authors, journal gatekeepers, policy makers) to revise and increase their knowledge of scholarly communication in the IS field. The EB_IS_2009 dataset supporting this scientometric study is released as online supplementary material to this article to foster further research on editorial boards.", "paper_title": "Shaping the landscape of research in information systems from the perspective of editorial boards: A scientometric study of 77 leading journals", "paper_id": "WOS:000303500300009"}