{"auto_keywords": [{"score": 0.04685574222273184, "phrase": "obstacle_avoidance"}, {"score": 0.00481495049065317, "phrase": "robotic_eye-arm-hand_coordination"}, {"score": 0.004244375827831527, "phrase": "human_study"}, {"score": 0.004153041453795458, "phrase": "prehensile_motion"}, {"score": 0.0037087324991876727, "phrase": "sequential_manner"}, {"score": 0.003581797255879607, "phrase": "intermediary_target"}, {"score": 0.0032830808525570903, "phrase": "forward_planning_scheme"}, {"score": 0.002931569771634119, "phrase": "eye-arm_motion"}, {"score": 0.002806595775343074, "phrase": "quantitative_assessment"}, {"score": 0.0027341763737751467, "phrase": "eye-arm-hand_motion"}, {"score": 0.002640507929183363, "phrase": "regular_phase_dependencies"}, {"score": 0.0024519545383399773, "phrase": "computational_model"}, {"score": 0.0023990982005125763, "phrase": "coupled_dynamical_systems_framework"}, {"score": 0.0023679315987170857, "phrase": "fast_and_synchronous_control"}, {"score": 0.0022472527731744974, "phrase": "single_and_compact_framework"}, {"score": 0.0022180544041790697, "phrase": "similar_control_system"}, {"score": 0.002132711053003407, "phrase": "visuomotor_control"}, {"score": 0.0021049977753042253, "phrase": "humanoid_robot"}], "paper_keywords": ["Visuomotor coordination in reach and grasp movements", " Coupled dynamical systems", " Forward planning", " Obstacle avoidance"], "paper_abstract": "We investigate the role of obstacle avoidance in visually guided reaching and grasping movements. We report on a human study in which subjects performed prehensile motion with obstacle avoidance where the position of the obstacle was systematically varied across trials. These experiments suggest that reaching with obstacle avoidance is organized in a sequential manner, where the obstacle acts as an intermediary target. Furthermore, we demonstrate that the notion of workspace travelled by the hand is embedded explicitly in a forward planning scheme, which is actively involved in detecting obstacles on the way when performing reaching. We find that the gaze proactively coordinates the pattern of eye-arm motion during obstacle avoidance. This study provides also a quantitative assessment of the coupling between the eye-arm-hand motion. We show that the coupling follows regular phase dependencies and is unaltered during obstacle avoidance. These observations provide a basis for the design of a computational model. Our controller extends the coupled dynamical systems framework and provides fast and synchronous control of the eyes, the arm and the hand within a single and compact framework, mimicking similar control system found in humans. We validate our model for visuomotor control of a humanoid robot.", "paper_title": "Learning robotic eye-arm-hand coordination from human demonstration: a coupled dynamical systems approach", "paper_id": "WOS:000333201000008"}