{"auto_keywords": [{"score": 0.004237925318473508, "phrase": "valuable_yet_underdeveloped_alternative_paradigm"}, {"score": 0.004016072233242585, "phrase": "recent_developments"}, {"score": 0.0039624406239057944, "phrase": "computerization_movements"}, {"score": 0.0030278017562213265, "phrase": "deep_structures"}, {"score": 0.00300749708357049, "phrase": "underlying_ideology"}, {"score": 0.002869115451202179, "phrase": "rhetorical_claims"}, {"score": 0.0026111116934081284, "phrase": "competing_discourses"}, {"score": 0.002558909812664716, "phrase": "diffusion_process"}, {"score": 0.0023923066544220277, "phrase": "framing_strategies"}, {"score": 0.0023131084326717755, "phrase": "broader_field_context"}, {"score": 0.0021049977753042253, "phrase": "free_and_open_source_software"}], "paper_keywords": ["Computerization movements", " diffusion", " IT innovation", " discourse", " open source", " free software", " ideology", " rhetoric"], "paper_abstract": "In this paper we propose rhetoric as a valuable yet underdeveloped alternative paradigm for examining IT diffusion. Building on recent developments of computerization movements theory, our rhetorical approach proposes that two central elements of the theory, framing and ideology, rather than being treated as separate can be usefully integrated. We suggest that IT diffusion can be usefully explored through examining the interrelationship of the deep structures underlying ideology and the type and sequence of rhetorical claims underpinning actors' framing strategies. Our theoretical developments also allow us to better understand competing discourses influencing the diffusion process. These discourses reflect the ideologies and shape the framing strategies of actors in the broader field context. We illuminate our theoretical approach by drawing on the history of the diffusion of free and open source software.", "paper_title": "A RHETORICAL APPROACH TO IT DIFFUSION: RECONCEPTUALIZING THE IDEOLOGY-FRAMING RELATIONSHIP IN COMPUTERIZATION MOVEMENTS", "paper_id": "WOS:000321340500009"}