{"auto_keywords": [{"score": 0.04749178419281337, "phrase": "power_consumption"}, {"score": 0.0311170659605185, "phrase": "wsn_lifetime"}, {"score": 0.00481495049065317, "phrase": "coloured_petri_nets"}, {"score": 0.004471530397729526, "phrase": "wireless_sensor_networks"}, {"score": 0.004230068512904886, "phrase": "limited_amount"}, {"score": 0.0035369291417564606, "phrase": "trivial_task"}, {"score": 0.0033251716926666437, "phrase": "inherent_dynamism"}, {"score": 0.002728847267539957, "phrase": "fully_automated_process"}, {"score": 0.0025812459787060097, "phrase": "reusable_coloured_petri_net"}, {"score": 0.002549550250445912, "phrase": "cpn"}, {"score": 0.002426566352219338, "phrase": "wsn_communication_protocols"}, {"score": 0.002323826502178581, "phrase": "cpn_models"}, {"score": 0.002295277579105179, "phrase": "wsn_applications"}, {"score": 0.0021049977753042253, "phrase": "experimental_evaluation"}], "paper_keywords": [""], "paper_abstract": "Several strategies to evaluate the power consumption of of wireless sensor networks (WSNs) have been proposed. The limited amount of energy and the difficulty of recharging them have demanded the emerging of these strategies. However, to evaluate the lifetime of a WSN is not a trivial task due to the complexity of reproducing the environment, inherent dynamism, and complexity and size of WSNs. In this context, we present an approach for evaluating the WSN lifetime by simulating its power consumption using models. This approach consists of a fully automated process for evaluating the WSN lifetime, a set of reusable Coloured Petri Net (CPN) models that express the power consumption of WSN communication protocols, and a strategy for composing CPN models of WSN applications and protocols. In order to assess our power consumption models, we carried out an experimental evaluation that compares the results obtained by simulation against ones existing in the literature.", "paper_title": "Using Coloured Petri Nets for Evaluating the Power Consumption of Wireless Sensor Networks", "paper_id": "WOS:000338054800001"}