{"auto_keywords": [{"score": 0.04717766219733611, "phrase": "use_it-model"}, {"score": 0.0048149873171112025, "phrase": "predict"}, {"score": 0.004641371170497766, "phrase": "healthcare"}, {"score": 0.004609194891749542, "phrase": "background"}, {"score": 0.004574055537680266, "phrase": "objective"}, {"score": 0.0042031320273645065, "phrase": "information_system"}, {"score": 0.004157058883925715, "phrase": "user's_perspective"}, {"score": 0.0033712944392793195, "phrase": "ten_case_studies"}, {"score": 0.0030751605843937673, "phrase": "implementation_process"}, {"score": 0.003019121766552419, "phrase": "innovation_process-dimension"}, {"score": 0.002846549461929597, "phrase": "relevance_determinant"}, {"score": 0.002713604305939145, "phrase": "task_support"}, {"score": 0.0025963890234079333, "phrase": "negative_consequences"}, {"score": 0.002521064923851732, "phrase": "macro-_and_micro-requirements"}, {"score": 0.0024299678474208023, "phrase": "information_quality"}, {"score": 0.0022994427535192514, "phrase": "updated_use_it-adoption-model"}, {"score": 0.0022327141073440436, "phrase": "information_systems"}, {"score": 0.0021520139248317333, "phrase": "original_use_it-model"}, {"score": 0.0021049977753042253, "phrase": "macro-_and_micro-level"}], "paper_keywords": ["Adoption model", " information and communication technology", " healthcare", " electronic patient record", " evaluation"], "paper_abstract": "Background and Objective: The USE IT-model integrates theories about adoption and diffusion of innovations and is suitable to predict and evaluate the success of an information system from a user's perspective. The USE IT-model consists of four determinants: relevance, requirements, resources and resistance, which are measured at the macro-level (organizational), and at the micro-level (individual). After applying the USE IT approach in several researches we evaluated and updated the USE IT-model. Methods: We used the USE IT-model in ten case studies in healthcare and compared the results of the studies with the determinants and dimensions of the USE IT-model. Results: The quality of the implementation process is part of the innovation process-dimension and therefore relocated as a dimension of macro-resistance. The improvements and value in the relevance determinant are made more concrete by quality, efficiency, effectiveness, and task support. The dimensions of micro-resistance are reduced, and the dimension negative consequences is added. Also the dimensions of macro- and micro-requirements are made more specific to express the importance of information quality, availability and accessibility. Discussion and Conclusion: The research resulted in the updated USE IT-adoption-model to predict and evaluate the adoption of information systems in healthcare. The structure and determinants of the original USE IT-model with a distinction between the macro- and micro-level remained unchanged.", "paper_title": "The USE IT-adoption-model to Predict and Evaluate Adoption of Information and Communication Technology in Healthcare", "paper_id": "WOS:000328663300003"}