{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "mathematical_morphology"}, {"score": 0.02296350933162585, "phrase": "simplicial_complexes"}, {"score": 0.009786582787513964, "phrase": "simplicial_complex_spaces"}, {"score": 0.004236321075918639, "phrase": "multidimensional_data"}, {"score": 0.003619993477999133, "phrase": "image_processing"}, {"score": 0.0034956560177000656, "phrase": "digital_structures"}, {"score": 0.0032786537599187125, "phrase": "mathematical_morphology_operators"}, {"score": 0.002917931350071647, "phrase": "dimensional_operators"}, {"score": 0.002720785798036066, "phrase": "new_operators"}, {"score": 0.0023792975669318615, "phrase": "matlab_code"}, {"score": 0.002351705899181029, "phrase": "additional_material"}, {"score": 0.0022576249214220187, "phrase": "original_properties"}, {"score": 0.0021050011192089513, "phrase": "elsevier"}], "paper_keywords": ["Mathematical morphology", " Simplicial complexes", " Granulometries", " Alternating sequential filters", " Image filtering"], "paper_abstract": "In this work we study the framework of mathematical morphology on simplicial complex spaces. Simplicial complexes are widely used to represent multidimensional data, such as meshes, that are two dimensional complexes, or graphs, that can be interpreted as one dimensional complexes. Mathematical morphology is one of the most powerful frameworks for image processing, including the processing of digital structures, and is heavily used for many applications. However, mathematical morphology operators on simplicial complex spaces is not a concept fully developed in the literature. Specifically, we explore properties of the dimensional operators, small, versatile operators that can be used to define new operators on simplicial complexes, while maintaining properties from mathematical morphology. These operators can also be used to recover many morphological operators from the literature. Matlab code and additional material, including the proofs of the original properties, are freely available at http://code.google.com/p/math-morpho-simplicial-complexes. (C) 2014 Elsevier B. V. All rights reserved.", "paper_title": "Dimensional operators for mathematical morphology on simplicial complexes", "paper_id": "WOS:000339999200013"}