{"auto_keywords": [{"score": 0.046862301504271946, "phrase": "ann"}, {"score": 0.018793265246982258, "phrase": "rego"}, {"score": 0.009801790452721277, "phrase": "bill"}, {"score": 0.008360960991597766, "phrase": "games_econ"}, {"score": 0.007484562420511923, "phrase": "traditional_framework"}, {"score": 0.004263972370406983, "phrase": "stronger_statement"}, {"score": 0.003936560022538909, "phrase": "particular_p."}, {"score": 0.003086396772496527, "phrase": "decidable_logic"}, {"score": 0.002879029968532794, "phrase": "full_awareness"}, {"score": 0.002704306866425829, "phrase": "relative_awareness"}, {"score": 0.002505054869094183, "phrase": "halpern's_and_rego's_logic"}, {"score": 0.0023859534478427313, "phrase": "motivating_examples"}, {"score": 0.00236941334132944, "phrase": "halpern"}, {"score": 0.002105020865803768, "phrase": "pspace"}], "paper_keywords": ["Modal logic", " Epistemic Logic", " Awareness", " Completeness", " Complexity"], "paper_abstract": "In the most popular logics combining knowledge and awareness, it is not possible to express statements about knowledge of unawareness such as \"Ann knows that Bill is aware of something Ann is not aware of\"-without using a stronger statement such as \"Ann knows that Bill is aware of p and Ann is not aware of p\", for some particular p. In Halpern and Rego (Proceedings of KR 2006; Games Econ Behav 67(2): 503-525, 2009b) Halpern and Rego introduced a logic in which such statements about knowledge of unawareness can be expressed. The logic extends the traditional framework with quantification over formulae, and is thus very expressive. As a consequence, it is not decidable. In this paper we introduce a decidable logic which can be used to reason about certain types of unawareness. Our logic extends the traditional framework with an operator expressing full awareness, i.e., the fact that an agent is aware of everything, and another operator expressing relative awareness, the fact that one agent is aware of everything another agent is aware of. The logic is less expressive than Halpern's and Rego's logic. It is, however, expressive enough to express all of the motivating examples in Halpern and Rego (Proceedings of KR 2006; Games Econ Behav 67(2): 503-525, 2009b). In addition to proving that the logic is decidable and that its satisfiability problem is PSPACE-complete, we present an axiomatisation which we show is sound and complete.", "paper_title": "A Logic for Reasoning About Knowledge of Unawareness", "paper_id": "WOS:000209641000005"}