{"auto_keywords": [{"score": 0.02432956827352746, "phrase": "credit_checks"}, {"score": 0.004670722261414736, "phrase": "fraudulent_applications"}, {"score": 0.00446240364863009, "phrase": "consistent_tool"}, {"score": 0.004328689762198895, "phrase": "quick_loan_decisions"}, {"score": 0.00409382470158851, "phrase": "experienced_loan_officers"}, {"score": 0.003871653343842317, "phrase": "prospective_borrowers"}, {"score": 0.003793876828939456, "phrase": "strong_motivation"}, {"score": 0.003341839487905525, "phrase": "credit_scoring_models"}, {"score": 0.0031284221314354095, "phrase": "loan_approval"}, {"score": 0.002840708910768261, "phrase": "financial_institutions"}, {"score": 0.002727606388863445, "phrase": "dishonest_customers"}, {"score": 0.002632332114727894, "phrase": "optimal_effort"}, {"score": 0.002248755794042486, "phrase": "proposed_issue"}, {"score": 0.0021923400552366756, "phrase": "simulated_data"}, {"score": 0.00217017119491777, "phrase": "discriminant_analysis"}, {"score": 0.0021049977753042253, "phrase": "lending_financial_institutions"}], "paper_keywords": ["Credit scoring", " discriminant analysis", " default", " fraud detection"], "paper_abstract": "Credit scoring is an automated, objective and consistent tool which helps lenders to provide quick loan decisions. It can replace some of the more mechanical work done by experienced loan officers whose decisions are intuitive but potentially subject to bias. Prospective borrowers may have a strong motivation to fraudulently falsify one or more of the attributes they report on their application form. Applicants learn about the characteristics that are used to build credit scoring models, and may alter the answers on their application form to improve their chance of loan approval. Few automated credit scoring models have considered falsified information from borrowers. We will show that sometimes it is profitable for financial institutions to spend money and effort to identify dishonest customers. We will also find the optimal effort that banks should spend on identifying these liars. Furthermore, we will show that it is possible for liars to eventually adjust their lies to escape from credit checks. The proposed issue will be studied using simulated data and discriminant analysis. This research can help lending financial institutions to reduce risk and maximize profit, and it also shows that it is feasible for customers to lie intelligently so as to evade credit checks and get loans.", "paper_title": "How much effort should be spent to detect fraudulent applications when engaged in classifier-based lending?", "paper_id": "WOS:000362966800006"}