{"auto_keywords": [{"score": 0.041947888026124834, "phrase": "mynote"}, {"score": 0.010273787605850224, "phrase": "e-learning_environment"}, {"score": 0.0060743521404668585, "phrase": "future_use"}, {"score": 0.0047370749839861165, "phrase": "learning_tool"}, {"score": 0.004413846562278824, "phrase": "online_communication"}, {"score": 0.0037493114715625784, "phrase": "active_sharing"}, {"score": 0.003589602322126282, "phrase": "people's_perceptions"}, {"score": 0.00349324530379071, "phrase": "usability_perspective"}, {"score": 0.003290237137651949, "phrase": "learning_management_system"}, {"score": 0.0031329310567625923, "phrase": "lms"}, {"score": 0.002999386721353559, "phrase": "evaluation_results"}, {"score": 0.002918826667294298, "phrase": "factor_analysis"}, {"score": 0.002210814150677161, "phrase": "learners'_perceptions"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Annotation system", " Web 2.0", " LMS", " Online learning", " Usability"], "paper_abstract": "The emergence of Web 2.0 technology provides more opportunities to foster online communication and sharing in an e-learning environment. The purpose of this study was to develop a Web 2.0 annotation system, MyNote, based on the Web 2.0 core concepts which emphasize ease of access and active sharing and then to gain an understanding about people's perceptions of MyNote from a usability perspective. MyNote was employed on multimedia learning objects in a Learning Management System (M5), and out of the LMS as well in this study. The evaluation results showed that, with factor analysis, interactivity, usefulness, helpfulness, and willingness for future use were categorized to represent the perceptions of MyNote. It was also found that the factors of interactivity and helpfulness were statistically significant to predict the future use of MyNote. Lastly, the habit of taking notes also affected learners' perceptions of using MyNote. (C) 2011 Elsevier Ltd. All rights reserved.", "paper_title": "Development and evaluation of a Web 2.0 annotation system as a learning tool in an e-learning environment", "paper_id": "WOS:000301275600010"}