{"auto_keywords": [{"score": 0.03528278775652248, "phrase": "rc"}, {"score": 0.020090806284955496, "phrase": "node_density"}, {"score": 0.013553835370851667, "phrase": "kp_protocols"}, {"score": 0.008431440959079889, "phrase": "security_performance"}, {"score": 0.00666299696400449, "phrase": "network_dimension"}, {"score": 0.00481495049065317, "phrase": "key_predistribution_protocols"}, {"score": 0.004767826806287385, "phrase": "wireless_sensor_networks"}, {"score": 0.004516733575701128, "phrase": "randomly_deployed_wireless_sensor_networks"}, {"score": 0.0041136473765874815, "phrase": "network_dimension_increase"}, {"score": 0.0036194914688460656, "phrase": "detailed_study"}, {"score": 0.003428665921276366, "phrase": "new_metric"}, {"score": 0.0031532895341013297, "phrase": "detailed_analytical_investigation"}, {"score": 0.002928682556953258, "phrase": "randomly_deployed_wsns"}, {"score": 0.0022005118194652704, "phrase": "logical_and_physical_group_deployment"}, {"score": 0.0021049977753042253, "phrase": "extensive_theoretical_analysis"}], "paper_keywords": ["Information security", " key management", " resilience", " scalability", " sensor networks"], "paper_abstract": "Many key predistribution (KP) protocols have been proposed and are well accepted in randomly deployed wireless sensor networks (WSNs). Being distributed and localized, they are perceived to be scalable as node density and network dimension increase. While it is true in terms of communication/computation overhead, their scalability in terms of security performance is unclear. In this paper, we conduct a detailed study on this issue. In particular, we define a new metric called Resilient Connectivity (RC) to quantify security performance in WSNs. We then conduct a detailed analytical investigation on how KP protocols scale with respect to node density and network dimension in terms of RC in randomly deployed WSNs. Based on our theoretical analysis, we state two scaling laws of KP protocols. Our first scaling law states that KP protocols are not scalable in terms of RC with respect to node density. Our second scaling law states that KP protocols are not scalable in terms of RC with respect to network dimension. In order to deal with the unscalability of the above two scaling laws, we further propose logical and physical group deployment, respectively. We validate our findings further using extensive theoretical analysis and simulations.", "paper_title": "Scaling Laws of Key Predistribution Protocols in Wireless Sensor Networks", "paper_id": "WOS:000297344200016"}