{"auto_keywords": [{"score": 0.04757136176423037, "phrase": "naor"}, {"score": 0.04719962441443733, "phrase": "pinkas"}, {"score": 0.04610932260951358, "phrase": "sender"}, {"score": 0.040356373997819224, "phrase": "receiver"}, {"score": 0.027218861962937317, "phrase": "oblivious_transfer_protocols"}, {"score": 0.00481495049065317, "phrase": "unconditionally_secure_distributed_oblivious_transfer"}, {"score": 0.00467905143301368, "phrase": "oblivious_transfer"}, {"score": 0.004621984064678252, "phrase": "distributed_model"}, {"score": 0.004382591802405206, "phrase": "n_secrets"}, {"score": 0.0041555469216463855, "phrase": "set-up_phase"}, {"score": 0.003892126266260425, "phrase": "recovering_phase"}, {"score": 0.002898127432512101, "phrase": "new_results"}, {"score": 0.0022477377970612847, "phrase": "threshold_and_general_access_structures"}, {"score": 0.0022022535084284694, "phrase": "servers"}], "paper_keywords": ["oblivious transfer", " secret sharing", " distributed cryptography"], "paper_abstract": "This paper is about the oblivious transfer in the distributed model proposed by Naor and Pinkas. In this setting a Sender has n secrets and a Receiver is interested in one of them. During a set-up phase, the Sender gives information about the secrets to m Servers. Afterwards, in a recovering phase, the Receiver can compute the secret she wishes by interacting with any k of them. More precisely, from the answers received she computes the secret in which she is interested but she gets no information on the others and, at the same time, any coalition of k - 1 Servers can neither compute any secret nor figure out which one the Receiver has recovered. We present an analysis and new results holding for this model: lower bounds on the resources required to implement such a scheme (i.e., randomness, memory storage, communication complexity); some impossibility results for one-round distributed oblivious transfer protocols; two polynomial-based constructions implementing 1-out-of-n distributed oblivious transfer, which generalize and strengthen the two constructions for 1-out-of-2 given by Naor and Pinkas; as well as new one-round and two-round distributed oblivious transfer protocols, both for threshold and general access structures on the set of Servers, which are optimal with respect to some of the given bounds. Most of these constructions are basically combinatorial in nature.", "paper_title": "On unconditionally secure distributed oblivious transfer", "paper_id": "WOS:000247915100003"}