{"auto_keywords": [{"score": 0.04884791636929343, "phrase": "html_documents"}, {"score": 0.04630684633148268, "phrase": "title_fields"}, {"score": 0.026573480372980324, "phrase": "extracted_titles"}, {"score": 0.012188385144333118, "phrase": "html_titles"}, {"score": 0.00481495049065317, "phrase": "automatic_extraction"}, {"score": 0.003923398381490749, "phrase": "supervised_machine"}, {"score": 0.0029889584492584073, "phrase": "extraction_accuracy"}, {"score": 0.0029228387900175554, "phrase": "baseline_method"}, {"score": 0.0028581775908203683, "phrase": "largest_font_size"}, {"score": 0.0027331033178323145, "phrase": "fi_score"}, {"score": 0.002652768049567485, "phrase": "web_page_retrieval"}, {"score": 0.002603758927691463, "phrase": "trec_web_track_data"}, {"score": 0.0025366596616434767, "phrase": "new_method"}, {"score": 0.0025178072071268534, "phrase": "html_documents_retrieval"}, {"score": 0.002480520548392772, "phrase": "experimental_results"}, {"score": 0.0022013916728990564, "phrase": "named_page"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["information retrieval", " HTML document", " metadata extraction"], "paper_abstract": "This paper is concerned with automatic extraction of titles from the bodies of HTML documents (web pages). Titles of HTML documents should be correctly defined in the title fields by the authors; however, in reality they are often bogus. It is advantageous if we can automatically extract titles from HTML documents. In this paper, we take a supervised machine learning approach to address the problem. We first propose a specification on HTML titles, that is, a 'definition' on HTML titles. Next, we employ two learning methods to perform the task. In one method, we utilize features extracted from the DOM (direct object model) Tree; in the other method, we utilize features based on vision. We also combine the two methods to further enhance the extraction accuracy. Our title extraction methods significantly outperform the baseline method of using the lines in largest font size as title (22.6-37.4% improvements in terms of FI score). As application, we consider web page retrieval. We use the TREC Web Track data for evaluation. We propose a new method for HTML documents retrieval using extracted titles. Experimental results indicate that the use of both extracted titles and title fields is almost always better than the use of title fields alone; the use of extracted titles is particularly helpful in the task of named page finding (25.1-30.31/c, improvements). (c) 2006 Elsevier Ltd. All rights reserved.", "paper_title": "Web page title extraction and its application", "paper_id": "WOS:000246869800012"}