{"auto_keywords": [{"score": 0.042192437711649204, "phrase": "shared_secret"}, {"score": 0.03772724403471347, "phrase": "secret_reconstruction"}, {"score": 0.023337465682477822, "phrase": "public_information"}, {"score": 0.004543708337879809, "phrase": "secret_dealer"}, {"score": 0.003949377440799037, "phrase": "threshold_value_t"}, {"score": 0.0038364365168131586, "phrase": "sharing_policy"}, {"score": 0.003637669525737665, "phrase": "false_share"}, {"score": 0.0031159081999910694, "phrase": "multiple_shared_secrets"}, {"score": 0.003070996252787868, "phrase": "different_threshold_values"}, {"score": 0.002997572637726648, "phrase": "secret_share"}, {"score": 0.0028421434495262796, "phrase": "proposed_scheme"}, {"score": 0.002530359917257626, "phrase": "shared_secret_-_each_participant"}, {"score": 0.0021049977753042253, "phrase": "threshold_value"}], "paper_keywords": ["Secret sharing", " Dynamic threshold", " Cheater identification", " Fair secret reconstruction"], "paper_abstract": "A (t, n) threshold secret sharing scheme enables the secret dealer to decompose the secret into n shares which are separately distributed to participants of the same size. Any t or more participants can reconstruct the shared secret, where the threshold value t is predefined according to the sharing policy. However, if there is a cheater releasing a false share in the Secret reconstruction, lie can obtain the secret alone. This paper presents a novel (t, n)-fair dynamic threshold secret sharing scheme in which the dealer can distribute multiple shared secrets associated with different threshold values. Meanwhile, the secret share held by each participant remains unchanged. Furthermore, the proposed scheme has the following features: (1) cheater identification - all participants can identify the cheaters during the secret reconstruction; (2) fair reconstruction of the shared secret - each participant has an equal ability to recover the shared secret, even if there are v cheaters among these participants, where v < t/2; (3) fixed length of public information - the public information is independent of the threshold value and the number of participants.", "paper_title": "A (t, n)-FAIR DYNAMIC THRESHOLD SECRET SHARING SCHEME", "paper_id": "WOS:000266024700023"}