{"auto_keywords": [{"score": 0.04967088836874542, "phrase": "heart_murmur_findings"}, {"score": 0.00481495049065317, "phrase": "structured_recording"}, {"score": 0.004216434794603139, "phrase": "concept-dependent_attributes_model"}, {"score": 0.004144810537437608, "phrase": "snomed-ct._methods"}, {"score": 0.0039035351575463103, "phrase": "snomed-ct's_use"}, {"score": 0.003629291866667764, "phrase": "subset_and_extension_mechanisms"}, {"score": 0.003582928547553209, "phrase": "snomed-ct."}, {"score": 0.003477029725200912, "phrase": "cardiac_cycle_timing_values"}, {"score": 0.003232653376857698, "phrase": "purpose-built_recording_software"}, {"score": 0.002954287204671032, "phrase": "snomed_role_grouping"}, {"score": 0.002665305036900055, "phrase": "relationship_rows"}, {"score": 0.002597577409911978, "phrase": "hierarchical_assignments"}, {"score": 0.0021322775033565805, "phrase": "apparent_penalty"}], "paper_keywords": [""], "paper_abstract": "Objective: This study evaluated an existing SNOMED-CT (R) model for structured recording of heart murmur findings and compared it to a concept-dependent attributes model using content from SNOMED-CT. Methods: The authors developed a model for recording heart murmur findings as an alternative to SNOMED-CT's use of Interprets and Has interpretation. A micro-nomenclature was then created to support each model using subset and extension mechanisms described for SNOMED-CT. Each micro-nomenclature included a partonomy of cardiac cycle timing values. A mechanism for handling ranges of values was also devised. One hundred clinical heart murmurs were recorded using purpose-built recording software based on both models. Results: Each micro-nomenclature was extended through the addition of the same list of concepts. SNOMED role grouping was required in both models. All 100 clinical murmurs were described using each model. The only major differences between the two models were the number of relationship rows required for storage and the hierarchical assignments of concepts within the micro-nomenclatures. Conclusion: The authors were able to capture 100 clinical heart murmurs with both models. Requirements for implementing the two models were virtually identical. In fact, data stored using these models could be easily interconverted. There is no apparent penalty for implementing either approach.", "paper_title": "Development and evaluation of methods for structured recording of heart murmur findings using SNOMED-CT (R) post-coordination", "paper_id": "WOS:000238264200010"}