{"auto_keywords": [{"score": 0.04938419617030252, "phrase": "dnssec"}, {"score": 0.007868987790540948, "phrase": "dns"}, {"score": 0.005004417290236411, "phrase": "vantages"}, {"score": 0.00481495049065317, "phrase": "off-axis_corroboration"}, {"score": 0.004508286991825192, "phrase": "public_key_cryptography"}, {"score": 0.004205660924155212, "phrase": "secured_global_database"}, {"score": 0.004175006647851034, "phrase": "new_services"}, {"score": 0.00406945841245389, "phrase": "ietf_dane_working_group"}, {"score": 0.004010342699414496, "phrase": "continued_success"}, {"score": 0.003476963781647026, "phrase": "internet-scale_verification_systems"}, {"score": 0.003115307756631991, "phrase": "robust_verification"}, {"score": 0.003081272473508291, "phrase": "new_theoretical_model"}, {"score": 0.0030476078950483158, "phrase": "public_data"}, {"score": 0.0030032915123993837, "phrase": "operational_deployments"}, {"score": 0.002680932410366204, "phrase": "reasonable_dnssec_deployment_model"}, {"score": 0.0026516301310428756, "phrase": "typical_choice"}, {"score": 0.002622647963181166, "phrase": "cot"}], "paper_keywords": ["DNSSEC", " DNDKEY", " verification", " p2p"], "paper_abstract": "The DNS Security Extensions (DNSSEC) arguably make DNS the first core Internet system to be protected using public key cryptography. The success of DNSSEC not only protects the DNS, but has generated interest in using this secured global database for new services such as those proposed by the IETF DANE working group. However, continued success is only possible if several important operational issues can be addressed. For example, .gov and .arpa have already suffered misconfigurations where DNS continued to function properly, but DNSSEC failed (thus, orphaning their entire subtrees in DNSSEC). Internet-scale verification systems must tolerate this type of chaos, but what kind of verification can one derive for systems with dynamism like this? In this paper, we propose to achieve robust verification with a new theoretical model, called Public Data, which treats operational deployments as Communities of Trust (CoTs) and makes them the verification substrate. Using a realization of the above idea, called Vantages, we quantitatively show that using a reasonable DNSSEC deployment model and a typical choice of a CoT, an adversary would need to be able to have visibility into and perform on-path Man-in-the-Middle (MitM) attacks on arbitrary traffic into and out of up to 90 percent of the all of the Autonomous Systems (ASes) in the Internet before having even a 10 percent chance of spoofing a DNSKEY. Further, our limited deployment of Vantages has outperformed the verifiability of DNSSEC and has properly validated its data up to 99.5 percent of the time.", "paper_title": "Verifying Keys through Publicity and Communities of Trust: Quantifying Off-Axis Corroboration", "paper_id": "WOS:000329051500002"}