{"auto_keywords": [{"score": 0.048929739366992464, "phrase": "software_project"}, {"score": 0.00481495049065317, "phrase": "software_projects"}, {"score": 0.0041112665381266315, "phrase": "random_length"}, {"score": 0.004061584718427419, "phrase": "time_interval"}, {"score": 0.003964007795174772, "phrase": "terminating_event"}, {"score": 0.003806541299696042, "phrase": "statistical_tools"}, {"score": 0.003236596168242036, "phrase": "survival_analysis"}, {"score": 0.0031459887611258765, "phrase": "great_flexibility"}, {"score": 0.002599763359352916, "phrase": "completed_projects"}, {"score": 0.002547535564922075, "phrase": "ongoing_projects"}, {"score": 0.002466139325703204, "phrase": "general_principles"}, {"score": 0.002406799309495983, "phrase": "comprehensive_duration_analysis"}, {"score": 0.002320449502337321, "phrase": "known_data_sets"}, {"score": 0.0022011501095573747, "phrase": "customer_participation"}, {"score": 0.0021394674440767124, "phrase": "logical_complexity"}, {"score": 0.0021221627745801478, "phrase": "user_requirements_volatility"}, {"score": 0.0021049977753042253, "phrase": "staff_tool_skills"}], "paper_keywords": ["duration of a software project", " survival analysis", " software cost estimation", " project cancellation"], "paper_abstract": "The duration of a software project is a very important feature, closely related to its cost. Various methods and models have been proposed in order to predict not only the cost of a software project but also its duration. Since duration is essentially the random length of a time interval from a starting to a terminating event, in this paper we present a framework of statistical tools, appropriate for studying and modeling the distribution of the duration. The idea for our approach comes from the parallelism of duration to the life of an entity which is frequently studied in biostatistics by a certain statistical methodology known as survival analysis. This type of analysis offers great flexibility in modeling the duration and in computing various statistics useful for inference and estimation. As in any other statistical methodology, the approach is based on datasets of measurements on projects. However, one of the most important advantages is that we can use in our data information not only from completed projects, but also from ongoing projects. In this paper we present the general principles of the methodology for a comprehensive duration analysis and we also illustrate it with applications to known data sets. The analysis showed that duration is affected by various factors such as customer participation, use of tools, software logical complexity, user requirements volatility and staff tool skills.", "paper_title": "A statistical framework for analyzing the duration of software projects", "paper_id": "WOS:000254743000003"}