{"auto_keywords": [{"score": 0.021475533500410867, "phrase": "hash_function"}, {"score": 0.00754011245261489, "phrase": "nmac"}, {"score": 0.006990799006334941, "phrase": "security_evaluation"}, {"score": 0.00655917434257125, "phrase": "previous_attacks"}, {"score": 0.005570237420931307, "phrase": "previous_attack"}, {"score": 0.00481495049065317, "phrase": "apop_and_nmac._many_hash-based_authentication_protocols"}, {"score": 0.004626553103375699, "phrase": "underlying_hash_functions"}, {"score": 0.004340263267055143, "phrase": "authentication_protocols"}, {"score": 0.004023120753104693, "phrase": "hash-based_protocols"}, {"score": 0.0035687137873965684, "phrase": "required_fundamental_property"}, {"score": 0.0034841647157189985, "phrase": "target_protocols"}, {"score": 0.0032036590920314725, "phrase": "real_world"}, {"score": 0.0031402604946939743, "phrase": "apop"}, {"score": 0.003065830998810144, "phrase": "modified_password_recovery_attack_procedure"}, {"score": 0.002623111480310373, "phrase": "new_key-recovery_attack_procedure"}, {"score": 0.002326464619238653, "phrase": "interesting_point"}, {"score": 0.0021647968783414504, "phrase": "outer_key"}, {"score": 0.0021049977753042253, "phrase": "inner_key"}], "paper_keywords": ["authentication protocol", " APOP", " NMAC", " MD5"], "paper_abstract": "Many hash-based authentication protocols have been proposed, and proven secure assuming that underlying hash functions are secure. On the other hand, if a hash function compromises, the security of authentication protocols based on this hash function becomes unclear. Therefore, it is significantly important to verify the security of hash-based protocols when a hash function is broken. In this paper, we will re-evaluate the security of two MD5-based authentication protocols based on a fact that MD5 cannot satisfy a required fundamental property named collision resistance. The target protocols are APOP (Authenticated Post Office Protocol) and NMAC (Nested Message Authentication Code), since they or their variants are widely used in real world. For security evaluation of APOP, we will propose a modified password recovery attack procedure, which is twice as fast as previous attacks. Moreover, our attack is more realistic, as the probability of being detected is lower than that of previous attacks. For security evaluation of MD5-based NMAC, we will propose a new key-recovery attack procedure, which has a complexity lower than that of previous attack. The complexity of our attack is 2(76), while that of previous attack is 2(100).**Moreover, our attack has another interesting point. NMAC has two keys: the inner key and the outer key. Our attack can recover the outer key partially without the knowledge of the inner key.", "paper_title": "Cryptanalysis of Two MD5-Based Authentication Protocols: APOP and NMAC", "paper_id": "WOS:000279136500017"}