{"auto_keywords": [{"score": 0.04186780198382062, "phrase": "elderly_drivers"}, {"score": 0.00481495049065317, "phrase": "smart_vehicles"}, {"score": 0.004562362497952548, "phrase": "general_smart_car_technologies"}, {"score": 0.004529696178827392, "phrase": "human-computer_interaction"}, {"score": 0.004261268957001927, "phrase": "current_status"}, {"score": 0.004023120753104693, "phrase": "previous_studies"}, {"score": 0.003798231095121328, "phrase": "new_technology_acceptance"}, {"score": 0.0037038224217016817, "phrase": "hci_research"}, {"score": 0.003361069456060196, "phrase": "adaptive_features"}, {"score": 0.003313053707792957, "phrase": "driver's_state_recognition"}, {"score": 0.0032075033252058835, "phrase": "infotainment_research"}, {"score": 0.0031616956068926524, "phrase": "hci"}, {"score": 0.0028586409810976367, "phrase": "literature_review"}, {"score": 0.0028381384547894865, "phrase": "technological_trends"}, {"score": 0.002797572252783356, "phrase": "previous_technical_road_maps"}, {"score": 0.0026600905156986317, "phrase": "assistance_systems"}, {"score": 0.0022785613865764923, "phrase": "acceptable_levels"}, {"score": 0.0022379017425216917, "phrase": "new_driving_behaviors"}, {"score": 0.0022058958906038466, "phrase": "driver_characteristics"}, {"score": 0.0021821915946356168, "phrase": "personalized_services"}, {"score": 0.0021049977753042253, "phrase": "smart_cars"}], "paper_keywords": [""], "paper_abstract": "This article reviewed both studies on general smart car technologies and human-computer interaction (HCI)/human-vehicle interaction studies that were published in journals and conferences so that the current status of research can be identified and future research directions can be suggested. Furthermore, previous studies on elderly drivers were reviewed, as these drivers could be the most vulnerable social group in terms of new technology acceptance. A total of 257 articles for HCI research and 45 articles for elderly drivers were selected and reviewed from 11,267 collected articles (2010-2014). According to the results, most articles were mainly related to safety and adaptive features (e.g., driver's state recognition, vehicle surrounding monitoring, driver action-suggestion), and infotainment research in terms of HCI (e.g., information technology devices-vehicle interaction, vehicle-vehicle interaction) was relatively insufficient despite its high research demand. According to the results of the literature review and technological trends analysis based on previous technical road maps, from HCI/human factors engineering (HFE) perspectives, research related to \"Assistance systems,\" \"Physiological & mental state recognition,\" \"Position sensor technology,\" \"Behavior recognition,\" and \"Infotainment\" was suggested to HCI/HFE researchers for further research. In particular, HCI/HFE researchers need to focus on research on acceptable levels of automation, observing new driving behaviors, investigation of driver characteristics to develop personalized services, and new technology acceptance to develop and improve smart cars in the future.", "paper_title": "Research Issues in Smart Vehicles and Elderly Drivers: A Literature Review", "paper_id": "WOS:000362821900002"}