{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "color_and_tone_adjustments"}, {"score": 0.03314999892612071, "phrase": "image_pairs"}, {"score": 0.004505881071218599, "phrase": "tone_style"}, {"score": 0.004372002674739612, "phrase": "explicit_or_implicit_rules"}, {"score": 0.00406663414150229, "phrase": "implicit_color_and_tone_adjustment_rules"}, {"score": 0.00360417515510547, "phrase": "corresponding_images"}, {"score": 0.003352256019007896, "phrase": "underlying_mathematical_relationships"}, {"score": 0.0031941384895530426, "phrase": "corresponding_pixels"}, {"score": 0.0030434561939032597, "phrase": "tone_and_color_adjustment_rules"}, {"score": 0.002899861600151726, "phrase": "complicated_spatially_varying_nonlinear_mappings"}, {"score": 0.0025542617599268323, "phrase": "low-order_polynomial_model"}, {"score": 0.0021049977753042253, "phrase": "high-end_camera"}], "paper_keywords": ["Image Enhancement", " Picture Style", " Color Mapping", " Gradient Mapping", " Tone Optimization"], "paper_abstract": "Color and tone adjustments are among the most frequent image enhancement operations. We define a color and tone style as a set of explicit or implicit rules governing color and tone adjustments. Our goal in this paper is to learn implicit color and tone adjustment rules from examples. That is, given a set of examples, each of which is a pair of corresponding images before and after adjustments, we would like to discover the underlying mathematical relationships optimally connecting the color and tone of corresponding pixels in all image pairs. We formally define tone and color adjustment rules as mappings, and propose to approximate complicated spatially varying nonlinear mappings in a piecewise manner. The reason behind this is that a very complicated mapping can still be locally approximated with a low-order polynomial model. Parameters within such low-order models are trained using data extracted from example image pairs. We successfully apply our framework in two scenarios, low-quality photo enhancement by transferring the style of a high-end camera, and photo enhancement using styles learned from photographers and designers.", "paper_title": "Example-Based Image Color and Tone Style Enhancement", "paper_id": "WOS:000297216400038"}