{"auto_keywords": [{"score": 0.005080457675663488, "phrase": "task_adaptation"}, {"score": 0.00481495049065317, "phrase": "direct_and_indirect_effects"}, {"score": 0.004757436273305987, "phrase": "information_technology"}, {"score": 0.004658426838467567, "phrase": "user_acceptance"}, {"score": 0.004630517016920072, "phrase": "new_information_technologies"}, {"score": 0.0044934449515131, "phrase": "cognitive_models"}, {"score": 0.004464770145570608, "phrase": "social_support"}, {"score": 0.0042953744947227535, "phrase": "important_drivers"}, {"score": 0.004130760425485278, "phrase": "new_it_applications"}, {"score": 0.0038086741610654715, "phrase": "direct_and_indirect_relationships"}, {"score": 0.0027853332413658666, "phrase": "psychological_distancing"}, {"score": 0.0026384167183586015, "phrase": "original_negative_effect"}, {"score": 0.0026068329296254087, "phrase": "post_hoc_anovas"}, {"score": 0.0025524660112107296, "phrase": "different_groups"}, {"score": 0.0025219085140220773, "phrase": "similar_emotions"}, {"score": 0.0024917159298274297, "phrase": "different_adaptation_behaviors"}, {"score": 0.0023745087648471613, "phrase": "new_it"}, {"score": 0.002360250030403706, "phrase": "important_effects"}, {"score": 0.0022833403088699175, "phrase": "complementary_perspective"}], "paper_keywords": ["Emotions", " IT use", " acceptance", " adaptation behaviors", " appraisal theory", " user reaction", " IT-related behaviors"], "paper_abstract": "Much ado has been made regarding user acceptance of new information technologies. However, research has been primarily based on cognitive models and little attention has been given to emotions. This paper argues that emotions are important drivers of behaviors and examines how emotions experienced early in the implementation of new IT applications relate to IT use. We develop a framework that classifies emotions into four distinct types: challenge, achievement, loss, and deterrence emotions. The direct and indirect relationships between four emotions (excitement, happiness, anger, and anxiety) and IT use were studied through a survey of 249 bank account managers. Our results indicate that excitement was positively related to IT use through task adaptation. Happiness was directly positively related to IT use and, surprisingly, was negatively associated with task adaptation, which is a facilitator of IT use. Anger was not related to IT use directly, but it was positively related to seeking social support, which in turn was positively related to IT use. Finally, anxiety was negatively related to IT use, both directly and indirectly through psychological distancing. Anxiety was also indirectly positively related to IT use through seeking social support, which countered the original negative effect of anxiety. Post hoc ANOVAs were conducted to compare IT usage of different groups of users experiencing similar emotions but relying on different adaptation behaviors. The paper shows that emotions felt by users early in the implementation of a new IT have important effects on IT use. As such, the paper provides a complementary perspective to understanding acceptance and antecedents of IT use. By showing the importance and complexity of the relationships between emotions and IT use, the paper calls for more research on the topic.", "paper_title": "THE OTHER SIDE OF ACCEPTANCE: STUDYING THE DIRECT AND INDIRECT EFFECTS OF EMOTIONS ON INFORMATION TECHNOLOGY USE", "paper_id": "WOS:000284086900004"}