{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "radio_grids"}, {"score": 0.004529093447865156, "phrase": "radio_network"}, {"score": 0.004477407179841716, "phrase": "central_node"}, {"score": 0.004359078118356132, "phrase": "possible_transmissions"}, {"score": 0.004243862930012258, "phrase": "binary_model"}, {"score": 0.0035722806911457545, "phrase": "exact_number"}, {"score": 0.0033857878144822906, "phrase": "square_two-dimensional_grid"}, {"score": 0.0024633601573822114, "phrase": "even_case"}, {"score": 0.0024073421672242486, "phrase": "linear_programming_duality"}, {"score": 0.0023346234464901978, "phrase": "sophisticated_algorithms"}, {"score": 0.0022640963589007457, "phrase": "non-shortest_paths"}, {"score": 0.0021539955106204354, "phrase": "hexagonal_grids"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Radio communication", " Interference", " Grids", " Gathering"], "paper_abstract": "We study the problem of gathering information from the nodes of a radio network into a central node. We model the network of possible transmissions by a graph and consider a binary model of interference in which two transmissions interfere if the distance in the graph from the sender of one transmission to the receiver of the other is d(l) or less. A round is a set of compatible (i.e., non-interfering) transmissions. In this paper, we determine the exact number of rounds required to gather one piece of information from each node of a square two-dimensional grid into the central node. If d(l) = 2k - 1 is odd, then the number of rounds is k(N - 1) - c(k) where N is the number of nodes and c(k) is a constant that depends on k. If d(l) = 2k is even, then the number of rounds is (k + 1/4)(N - 1) - c(k)' where c(k)' is a constant that depends on k. The even case uses a method based on linear programming duality to prove the lower bound, and sophisticated algorithms using the symmetry of the grid and non-shortest paths to establish the matching upper bound. We then generalize our results to hexagonal grids. (C) 2012 Elsevier B.V. All rights reserved.", "paper_title": "Optimal gathering in radio grids with interference", "paper_id": "WOS:000309098600002"}