{"auto_keywords": [{"score": 0.05007852962010534, "phrase": "lightweight_devices"}, {"score": 0.010842273839518229, "phrase": "hardware_implementation"}, {"score": 0.0076211976043944335, "phrase": "group_operations"}, {"score": 0.006626311018280844, "phrase": "existing_sav_protocols"}, {"score": 0.004769702911065878, "phrase": "server-aided_verification"}, {"score": 0.00472487907967794, "phrase": "sav"}, {"score": 0.004658426838467567, "phrase": "potential_applicability"}, {"score": 0.004549734943142138, "phrase": "signature_verification"}, {"score": 0.004401794742140806, "phrase": "computationally_weak_hardware"}, {"score": 0.004159241394996858, "phrase": "logic_circuits"}, {"score": 0.00406214911915987, "phrase": "computational_efficiency"}, {"score": 0.0038564191670589884, "phrase": "hardware_cost"}, {"score": 0.0037309384824565695, "phrase": "sav_protocols"}, {"score": 0.0022385926290967263, "phrase": "unnecessary_hardware_cost"}, {"score": 0.0021049977753042253, "phrase": "lightweight_applications"}], "paper_keywords": ["server-aided verification", " lightweight device", " hardware cost"], "paper_abstract": "Server-aided verification (SAV) has potential applicability in lightweight devices for improving signature verification, where the verifier possesses a computationally weak hardware. We observe that lightweight devices run all algorithms through hardware implementation with logic circuits. Existing SAV protocols indeed improve computational efficiency for lightweight devices, however, few of them take the hardware cost into consideration. The hardware implementation of SAV protocols could be still costly and expensive for lightweight devices. Currently, the most secure SAV protocols in the literature for pairing-based (G(1) x G(2) -> G(T)) signatures can securely delegate pairing computations to the server; however, verifiers are still required to perform group operations over two completely different groups G(1) and G(T), which heavily contribute to the cost of hardware implementation. In this work, we propose several collusion-resistant SAV protocols for pairing-based signatures to improve their applicability for lightweight devices. In our SAV protocols, verifiers are only required to perform group operations in G(1). In comparison with existing SAV protocols, our protocols save the unnecessary hardware cost for implementing group operations in G(T) and therefore are more applicable to lightweight applications.", "paper_title": "Server-Aided Signature Verification for Lightweight Devices", "paper_id": "WOS:000334115500001"}