{"auto_keywords": [{"score": 0.0233641430315933, "phrase": "roc"}, {"score": 0.00392586404888927, "phrase": "reverse_direction"}, {"score": 0.0037350832473790007, "phrase": "oppositely_labelled_points"}, {"score": 0.0035891316580885665, "phrase": "undesirable_edges"}, {"score": 0.003448863509392547, "phrase": "informative_point"}, {"score": 0.0029403531729828574, "phrase": "optimization_criterion"}, {"score": 0.0028536871476905847, "phrase": "labelled_points"}, {"score": 0.0027284410545226306, "phrase": "wide_variety"}, {"score": 0.0023727863021828547, "phrase": "publicly_available_bench-mark_data_sets"}, {"score": 0.0023028105026714533, "phrase": "real-world_problem"}, {"score": 0.0021049977753042253, "phrase": "negligible_computational_cost"}], "paper_keywords": ["Machine learning", " Semi-supervised learning"], "paper_abstract": "In many graph-based semi-supervised learning algorithms, edge weights are assumed to be fixed and determined by the data points' (often symmetric) relationships in input space, without considering directionality. However, relationships may be more informative in one direction (e.g. from labelled to unlabelled) than in the reverse direction, and some relationships (e.g. strong weights between oppositely labelled points) are unhelpful in either direction. Undesirable edges may reduce the amount of influence an informative point can propagate to its neighbours - the point and its outgoing edges have been \"blunted.\" We present an approach to \"sharpening\" in which weights are adjusted to meet an optimization criterion wherever they are directed towards labelled points. This principle can be applied to a wide variety of algorithms. In this paper, we present one solution satisfying the principle, in order to show that it can improve performance on a number of publicly available bench-mark data sets. When tested on a real-world problem, protein function classification with four vastly different molecular similarity graphs, sharpening improved ROC scores by 16% on average, at negligible computational cost. (C) 2010 Elsevier Ltd. All rights reserved.", "paper_title": "Graph sharpening", "paper_id": "WOS:000281339900054"}