{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "facial_expression_recognition"}, {"score": 0.009394054688141366, "phrase": "large_differences"}, {"score": 0.004545240514015278, "phrase": "new_adaptive_discriminative_metric_learning_method"}, {"score": 0.003947601392882997, "phrase": "conventional_euclidean_distance"}, {"score": 0.003750260412839128, "phrase": "expression_images"}, {"score": 0.0034725269588525534, "phrase": "intrinsic_space"}, {"score": 0.003113804826864362, "phrase": "-class_facial_images"}, {"score": 0.002738797804069541, "phrase": "adaptive_metric"}, {"score": 0.0026865721000905235, "phrase": "large_penalties"}, {"score": 0.002635339648135844, "phrase": "-class_samples"}, {"score": 0.002601727192945944, "phrase": "small_differences"}, {"score": 0.002568542343945288, "phrase": "small_penalties"}, {"score": 0.0023178219772486868, "phrase": "learned_distance_metric"}, {"score": 0.002259054486157494, "phrase": "experimental_results"}, {"score": 0.0021049977753042253, "phrase": "proposed_method"}], "paper_keywords": [""], "paper_abstract": "The authors propose in this study a new adaptive discriminative metric learning method for facial expression recognition. Although a number of methods have been proposed for facial expression recognition, most of them apply the conventional Euclidean distance metric to measure the similarity/dissimilarity of face expression images and cannot effectively characterise such similarity/dissimilarity of these images because the intrinsic space of face images usually do not lie in such an Euclidean space. Motivated by the fact that between-class facial images with small differences are more easily mis-classified than those with large differences, the authors propose learning an adaptive metric by imposing large penalties on between-class samples with small differences and small penalties on those samples with large differences simultaneously, such that more discriminative information can be extracted in the learned distance metric for facial expression recognition. Experimental results on three widely used face datasets are presented to demonstrate the efficacy of the proposed method.", "paper_title": "Adaptive discriminative metric learning for facial expression recognition", "paper_id": "WOS:000209167000002"}