{"auto_keywords": [{"score": 0.03318201413262534, "phrase": "mf-dspi_method"}, {"score": 0.02933067779342666, "phrase": "useful_echo_consistency"}, {"score": 0.00481495049065317, "phrase": "ultrasound_echoes"}, {"score": 0.004747620102130588, "phrase": "dual_symmetric_path_inspection_framework"}, {"score": 0.00470325458481566, "phrase": "non-destructive_ultrasound_inspection"}, {"score": 0.0045726187330434025, "phrase": "perpetual_high-interest_area"}, {"score": 0.004301834610818624, "phrase": "economic_point"}, {"score": 0.004009175817816061, "phrase": "high_production_capabilities"}, {"score": 0.00375395061615019, "phrase": "new_technique"}, {"score": 0.003581620064675766, "phrase": "dual_symmetric_path_inspection"}, {"score": 0.003322140088192527, "phrase": "useful_ultrasound_echoes"}, {"score": 0.003095923814666088, "phrase": "related_work"}, {"score": 0.0028850668183221947, "phrase": "experimental_setup"}, {"score": 0.0026633568650501873, "phrase": "signal_envelope_analysis"}, {"score": 0.0021049977753042253, "phrase": "latter_portion"}], "paper_keywords": ["non-destructive testing", " automated inspection", " matched filtering", " echo analysis", " signal processing"], "paper_abstract": "Non-destructive ultrasound inspection of metallic structures is a perpetual high-interest area of research because of its well-known benefits in industrial applications, especially from an economic point of view, where detection and localisation of defects in their most initial stages can help maintain high production capabilities for any enterprise. This paper is aimed at providing further validation regarding a new technique for detecting and localising defects in metals, the Matched Filter-based Dual Symmetric Path Inspection (MF-DSPI). This validation consists in demonstrating the consistency of the useful ultrasound echoes, within the framework of the MF-DSPI. A description of the MF-DSPI method and the related work of the authors with it are presented in this paper, along with an experimental setup used to obtain the data with which the useful echo consistency was studied. The four proposed methods are: signal envelope analysis, L2-norm criterion, correlation coefficient criterion and sliding bounding rectangle analysis. The aim of this paper is to verify the useful echo consistency (with the help of these four approaches), as the MF-DSPI method strongly relies on this feature. The results and their implications are discussed in the latter portion of this study.", "paper_title": "Consistency Analysis of Ultrasound Echoes within a Dual Symmetric Path Inspection Framework", "paper_id": "WOS:000356808900006"}