{"auto_keywords": [{"score": 0.007205582291518849, "phrase": "collaborative_fuzzy-neural_system"}, {"score": 0.006434048271150926, "phrase": "virtual_experts"}, {"score": 0.0058498000242545685, "phrase": "raw_data"}, {"score": 0.004814962826434316, "phrase": "collaborative"}, {"score": 0.004437115547184535, "phrase": "global_warming"}, {"score": 0.0031129269142224194, "phrase": "collaboration_mechanism"}, {"score": 0.003015401937358271, "phrase": "virtual_expert"}, {"score": 0.00297454367746853, "phrase": "corresponding_fuzzy_back_propagation_network"}, {"score": 0.002947611960613497, "phrase": "fbpn"}, {"score": 0.0027910516355928983, "phrase": "virtual_experts'_views"}, {"score": 0.0027282915297520624, "phrase": "collaboration_process"}, {"score": 0.00266693888510356, "phrase": "single_representative_value"}, {"score": 0.0026307897899760383, "phrase": "fuzzy_forecasts"}, {"score": 0.0025137856138000014, "phrase": "fglt"}, {"score": 0.0024460897937643032, "phrase": "historical_data"}, {"score": 0.0022847009758393405, "phrase": "experimental_results"}, {"score": 0.0022537212268979507, "phrase": "hit_rate"}, {"score": 0.0021049977753042253, "phrase": "fuzzy_collaborative_forecasting_approach"}], "paper_keywords": ["Collaborative", " Fuzzy back propagation network", " Forecasting", " Global CO2 concentration"], "paper_abstract": "The global CO2 concentration is considered to be one of the most important causes of global warming that must be closely monitored, accurately forecasted, and controlled as good as possible. To accurately forecast the global CO2 concentration, a collaborative fuzzy-neural system is developed in this study. In the collaborative fuzzy-neural system, instead of calling a number of experts in the field, a committee of virtual experts is formed. These virtual experts are asked to predict the global CO2 concentration based on their local observations, and may not share the raw data they own with each other. A collaboration mechanism is therefore established. For each virtual expert, the corresponding fuzzy back propagation network (FBPN) is constructed to predict the global CO2 concentration, based on the virtual experts' views. To facilitate the collaboration process and to derive a single representative value from these fuzzy forecasts, the concept of fuzzy group learning tree (FGLT) is proposed. Some historical data on global CO2 concentrations were used to evaluate the effectiveness of the collaborative fuzzy-neural system,. According to the experimental results, the hit rate, precision, and accuracy of forecasting the global CO2 concentration were considerably improved using the fuzzy collaborative forecasting approach for virtual experts without sharing the raw data they owned.", "paper_title": "A COLLABORATIVE FUZZY-NEURAL SYSTEM FOR GLOBAL CO2 CONCENTRATION FORECASTING", "paper_id": "WOS:000311584500010"}