{"auto_keywords": [{"score": 0.04889136866197645, "phrase": "web_applications"}, {"score": 0.009391986497157027, "phrase": "usability_evaluation_methods"}, {"score": 0.005802541455657664, "phrase": "novice_usability_practitioners"}, {"score": 0.004391202526350051, "phrase": "web_usability_issues"}, {"score": 0.0040157986370637465, "phrase": "current_knowledge"}, {"score": 0.0037553811262773756, "phrase": "systematic_mapping_study"}, {"score": 0.0035512680138425237, "phrase": "web_development_process"}, {"score": 0.003531474887552889, "phrase": "systematic_mapping_studies"}, {"score": 0.003453395626161181, "phrase": "existing_information"}, {"score": 0.0034245614958572012, "phrase": "research_question"}, {"score": 0.003395967295739228, "phrase": "unbiased_manner"}, {"score": 0.0032383707002544755, "phrase": "evaluation_methods"}, {"score": 0.0030197596397721566, "phrase": "user_testing"}, {"score": 0.0028555145499043564, "phrase": "implementation_phase"}, {"score": 0.0028316582436089064, "phrase": "web_application_development"}, {"score": 0.0025820004595728265, "phrase": "initial_set"}, {"score": 0.0024967652017219115, "phrase": "mapping_study"}, {"score": 0.0022324086872003985, "phrase": "new_research_activities"}, {"score": 0.0021708046703940026, "phrase": "useful_information"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Usability evaluation methods", " Web development", " Systematic mapping"], "paper_abstract": "Context: In recent years, many usability evaluation methods (UEMs) have been employed to evaluate Web applications. However, many of these applications still do not meet most customers' usability expectations and many companies have folded as a result of not considering Web usability issues. No studies currently exist with regard to either the use of usability evaluation methods for the Web or the benefits they bring. Objective: The objective of this paper is to summarize the current knowledge that is available as regards the usability evaluation methods (UEMs) that have been employed to evaluate Web applications over the last 14 years. Method: A systematic mapping study was performed to assess the UEMs that have been used by researchers to evaluate Web applications and their relation to the Web development process. Systematic mapping studies are useful for categorizing and summarizing the existing information concerning a research question in an unbiased manner. Results: The results show that around 39% of the papers reviewed reported the use of evaluation methods that had been specifically crafted for the Web. The results also show that the type of method most widely used was that of User Testing. The results identify several research gaps, such as the fact that around 90% of the studies applied evaluations during the implementation phase of the Web application development, which is the most costly phase in which to perform changes. A list of the UEMs that were found is also provided in order to guide novice usability practitioners. Conclusions: From an initial set of 2703 papers, a total of 206 research papers were selected for the mapping study. The results obtained allowed us to reach conclusions concerning the state-of-the-art of UEMs for evaluating Web applications. This allowed us to identify several research gaps, which subsequently provided us with a framework in which new research activities can be more appropriately positioned, and from which useful information for novice usability practitioners can be extracted. (C) 2011 Elsevier B.V. All rights reserved.", "paper_title": "Usability evaluation methods for the web: A systematic mapping study", "paper_id": "WOS:000292176300001"}