{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "web_accessibility"}, {"score": 0.004762550320451225, "phrase": "big_listed_firms"}, {"score": 0.004608730887154718, "phrase": "purpose_-_this_paper"}, {"score": 0.004222299135545249, "phrase": "theoretical_framework"}, {"score": 0.0039322149318145845, "phrase": "dow_jones_industrial"}, {"score": 0.003682100144121148, "phrase": "hypotheses_findings_-_reasons"}, {"score": 0.0031069334778456633, "phrase": "web_accessibility_policies"}, {"score": 0.002664850766529523, "phrase": "scheme_research_implications"}, {"score": 0.0024951467586005094, "phrase": "governmental_policies"}, {"score": 0.00236199235951202, "phrase": "corporate_social_responsibility_activities"}, {"score": 0.002285527382381719, "phrase": "pioneering_empirical_study"}, {"score": 0.002163535133532765, "phrase": "present_research"}], "paper_keywords": ["Corporate social responsibility", " Internet", " Worldwide web"], "paper_abstract": "Purpose - This paper aims to identify the factors influencing the implementation of web accessibility Design/methodology/approach - Following the theoretical framework three hypotheses were developed. The database consisted of 108 non-financial firms listed in the Dow Jones Industrial. CAC-40, DAX and IBEX35 indexes A multivariate regression equation was used to test the hypotheses Findings - Reasons for the implementation of web accessibility are technical rather than social or financial The implementation of web accessibility is aimed at increasing the efficiency of the operations of the firm Furthermore, web accessibility policies are more important in countries where the incorporation of the firms into the net has taken place at a date some time after the beginning of the scheme Research implications - An implication of the results is the advisability of orienting governmental policies to raise awareness that web accessibility should be part of corporate social responsibility activities Originality/value - This is a pioneering empirical study of the factors influencing web accessibility The results of the present research are of interest to other countries.", "paper_title": "Factors influencing web accessibility of big listed firms: an international study", "paper_id": "WOS:000277111500005"}