{"auto_keywords": [{"score": 0.03862243927793575, "phrase": "one-way_barrier_coverage"}, {"score": 0.012383111410586803, "phrase": "illegal_intruders"}, {"score": 0.0047971456961042784, "phrase": "barrier_coverage"}, {"score": 0.004761732436126133, "phrase": "wireless_sensor_networks"}, {"score": 0.004136221184894985, "phrase": "border_guarding"}, {"score": 0.00403026082093352, "phrase": "new_coverage_model"}, {"score": 0.0037421829222825964, "phrase": "legal_ones"}, {"score": 0.00370077772049505, "phrase": "appropriate_definition"}, {"score": 0.0035135084960705816, "phrase": "conventional_barrier_coverage"}, {"score": 0.003410768840300913, "phrase": "normal_targets"}, {"score": 0.0030401601744013767, "phrase": "theoretical_evidence"}, {"score": 0.0030176779201170306, "phrase": "comprehensive_sensors"}, {"score": 0.002984264956378651, "phrase": "binary_sensors"}, {"score": 0.0029621948240346092, "phrase": "counting_sensors"}, {"score": 0.0029402874300114537, "phrase": "trend_sensors"}, {"score": 0.0029185415814209055, "phrase": "direction_sensors"}, {"score": 0.0028969560940141233, "phrase": "even_distance_sensors"}, {"score": 0.00265987582861194, "phrase": "sufficient_condition"}, {"score": 0.002572463625403536, "phrase": "non-disc_sensing_model"}, {"score": 0.0024240794798626674, "phrase": "different_abilities"}, {"score": 0.0022009497295481678, "phrase": "significant_guidance"}, {"score": 0.002176560171729638, "phrase": "future_research"}, {"score": 0.002152440300818582, "phrase": "one-way_barrier_coverage_problem"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Wireless sensor networks", " One-way barrier coverage", " Comprehensive sensors"], "paper_abstract": "Barrier coverage in wireless sensor networks has been studied extensively in recent years, which aims at detecting any movement crossing a given belt, regardless of the direction of movement. For many intrusion detection applications, only the intruders from one side of the belt are illegal such as border guarding. Therefore, we introduce a new coverage model called one-way barrier coverage in this article, which requires that the network reports illegal intruders while ignores legal ones. An appropriate definition for one-way barrier coverage is proposed. However, one-way barrier coverage is much more challenging than conventional barrier coverage since it needs to identify illegal intruders from normal targets. We deeply investigate one-way barrier coverage with binary sensors. Our research illustrates that it is not straightforward to provide one-way barrier coverage even though there is only one intruder. Then, we demonstrate through theoretical evidence that comprehensive sensors, including binary sensors, counting sensors, trend sensors, direction sensors and even distance sensors with the disc sensing model, cannot provide one-way barrier coverage if there is no constraint on intruders. We also conclude a sufficient condition to provide one-way barrier coverage using distance sensors with the non-disc sensing model or location sensors. Although most types of sensors cannot provide one-way barrier coverage, they have different abilities on identifying illegal intruders due to their different capacities of collecting information. We design protocols to identify illegal intruders and evaluation the performance. Our work could be a significant guidance for the future research on the one-way barrier coverage problem. (C) 2014 Elsevier B.V. All rights reserved.", "paper_title": "Is one-way barrier coverage achievable using comprehensive sensors?", "paper_id": "WOS:000351324200009"}