{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "machine_cost"}, {"score": 0.034990358466475996, "phrase": "total_size"}, {"score": 0.004355415885815204, "phrase": "independent_jobs"}, {"score": 0.004313996835376177, "phrase": "positive_sizes"}, {"score": 0.0037199473428123175, "phrase": "new_machines"}, {"score": 0.003632080001489739, "phrase": "job_sizes"}, {"score": 0.0029147869733574844, "phrase": "non-preemptive_and_preemptive_versions"}, {"score": 0.00283229915062791, "phrase": "non-preemptive_version"}, {"score": 0.0025861368747446324, "phrase": "preemptive_version"}, {"score": 0.002524982927936405, "phrase": "optimal_semi-online_algorithm"}, {"score": 0.0022509365210787993, "phrase": "competitive_ratio"}, {"score": 0.0021049977753042253, "phrase": "general_case"}], "paper_keywords": ["semi-online", " preemptive scheduling", " machine cost", " competitive ratio"], "paper_abstract": "In this paper, we consider the following semi-online List Model problem with known total size. We are given a sequence of independent jobs with positive sizes, which must be assigned to be processed on machines. No machines are initially provided, and when a job is revealed the algorithm has the option to purchase new machines. By normalizing all job sizes and machine cost, we assume that the cost of purchasing one machine is 1. We further know the total size of all jobs in advance. The objective is to minimize the sum of the makespan and the number of machines to be purchased. Both non-preemptive and preemptive versions are considered. For the non-preemptive version, we present a new lower bound 6/5 which improves the known lower bound 1.161. For the preemptive version, we present an optimal semi-online algorithm with a competitive ratio of I in the case that the total size is not greater than 4, and an algorithm with a competitive ratio of 5/4 otherwise, while a lower bound 1.0957 is also presented for general case.", "paper_title": "Semi-online algorithms for scheduling with machine cost", "paper_id": "WOS:000242640200016"}