{"auto_keywords": [{"score": 0.05007519335476639, "phrase": "music_information_retrieval"}, {"score": 0.030934065116128565, "phrase": "mir"}, {"score": 0.004155399041702324, "phrase": "shared_software_libraries"}, {"score": 0.004081385289516914, "phrase": "common_frameworks"}, {"score": 0.0039942998891989955, "phrase": "file_formats"}, {"score": 0.003757480190200645, "phrase": "repurposable_components"}, {"score": 0.0035729944980593324, "phrase": "possibly_more_ambitious_ways"}, {"score": 0.0034841647157189985, "phrase": "great_implications"}, {"score": 0.0034220655476652683, "phrase": "mir_research"}, {"score": 0.003006353490112716, "phrase": "open_and_reliable_evaluation"}, {"score": 0.0028586409810976367, "phrase": "prior_research"}, {"score": 0.00278752137116301, "phrase": "clear_best_practice"}, {"score": 0.00267931029131157, "phrase": "contemporary_systems"}, {"score": 0.002262209824105154, "phrase": "emerging_notion"}, {"score": 0.002245975340642921, "phrase": "research_objects"}, {"score": 0.0022298571016688335, "phrase": "reproducible_research"}, {"score": 0.00210500341801526, "phrase": "mir."}], "paper_keywords": ["Music Information Retrieval (MIR)", " Workflows", " Reproducible research", " Research Objects"], "paper_abstract": "Many solutions for the reuse and re-purposing of Music Information Retrieval (MIR) methods, and the tools implementing those methods, have been introduced over recent years. Proposals for achieving interoperability between systems have ranged from shared software libraries and interfaces, through common frameworks and portals, to standardised file formats and metadata. Here we assess these solutions for their suitability to be reused and combined as repurposable components within assemblies (or workflows) that can be used in novel and possibly more ambitious ways. Reuse and repeatability also have great implications for the process of MIR research: the encapsulation of any algorithm and its operation-including inputs, parameters, and outputs-is fundamental to the repeatability and reproducibility of an experiment. This is desirable both for the open and reliable evaluation of algorithms and for the advancement of MIR by building more effectively upon prior research. At present there is no clear best practice widely adopted by the field. Based upon our analysis of contemporary systems and their adoption we reflect as to whether this should be considered a failure. Are there limits to interoperability unique to MIR, and how might they be overcome? Beyond workflows how much research context can, and should, be captured? We frame our assessment within the emerging notion of Research Objects for reproducible research in other domains, and describe how their adoption could serve as a route to reuse in MIR.", "paper_title": "Capturing the workflows of music information retrieval for repeatability and reuse", "paper_id": "WOS:000326932800005"}