{"auto_keywords": [{"score": 0.030932876177333594, "phrase": "linux"}, {"score": 0.00481495049065317, "phrase": "performance_comparison"}, {"score": 0.0047283116134926645, "phrase": "virtual_machines_for_sequence_alignment_software."}, {"score": 0.004518442937844318, "phrase": "fast_growing_application_domain"}, {"score": 0.0044351875676120365, "phrase": "bwa"}, {"score": 0.004397000006837371, "phrase": "scientific_applications"}, {"score": 0.0041827333568982055, "phrase": "performance_cost"}, {"score": 0.003996983218174335, "phrase": "computing_power"}, {"score": 0.003767738552860633, "phrase": "attractive_way"}, {"score": 0.0036998728605395384, "phrase": "scaling_challenge"}, {"score": 0.0036497740708342093, "phrase": "next-generation_sequencing"}, {"score": 0.003424771860049617, "phrase": "ngs_pipeline"}, {"score": 0.0032135959043774085, "phrase": "novoalign"}, {"score": 0.0031192354053455637, "phrase": "kvm"}, {"score": 0.0026548344763838213, "phrase": "relative_performance"}, {"score": 0.00245724480030654, "phrase": "tuning_suggestions"}, {"score": 0.0024349853033241663, "phrase": "cloud_implementers"}, {"score": 0.0022434880661725493, "phrase": "low_single-digit_percentages"}], "paper_keywords": ["Sequence alignment", " virtual machines", " performance"], "paper_abstract": "We explore the performance cost of virtualisation for the fast growing application domain of genomics. Traditionally, scientific applications have been considered too high-performance to pay the performance cost of virtualisation. However, as the demand for computing power for genomics is ever-increasing, the cloud can become an attractive way to meet the scaling challenge presented by Next-Generation Sequencing (NGS). We seek to explore the feasibility of running an NGS pipeline in a cloud, and in doing so consider two prevalent short-read sequence alignment programs, BWA and Novoalign. We executed those applications in three separate open-source system virtualisation solutions: the KVM hypervisor, the Xen para-virtualised hypervisor, and Linux Containers. We compare the runtime in each environment against the runtime of the same system without virtualisation and measure the relative performance of each hypervisor. We investigate and reduce as much as possible any overhead, presenting tuning suggestions for cloud implementers and users. Overall, we find that the overhead introduced by virtualisation can be reduced to low single-digit percentages, a cost we believe to be more than acceptable, especially given that two of the three solutions, Xen and Containers, exhibit near-zero overhead.", "paper_title": "PERFORMANCE COMPARISON AND TUNING OF VIRTUAL MACHINES FOR SEQUENCE ALIGNMENT SOFTWARE", "paper_id": "WOS:000361465700006"}