{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "personal_memory_technologies"}, {"score": 0.013739733624289882, "phrase": "mci"}, {"score": 0.011409558050688908, "phrase": "family_members"}, {"score": 0.00939851914217951, "phrase": "sensecam_images"}, {"score": 0.008862229055818665, "phrase": "personal_events"}, {"score": 0.004597622380240611, "phrase": "promising_way"}, {"score": 0.004527371799277529, "phrase": "older_adults"}, {"score": 0.004504193207111593, "phrase": "memory_impairments"}, {"score": 0.004356385318931493, "phrase": "personal_memories"}, {"score": 0.004300830853119242, "phrase": "alzheimer's_disease"}, {"score": 0.0041490029730869345, "phrase": "first_study"}, {"score": 0.004002513373645485, "phrase": "dvd-based_multimedia_biographies"}, {"score": 0.003971799264085669, "phrase": "prominent_events"}, {"score": 0.0038910378507470518, "phrase": "participant's_past"}, {"score": 0.0037923826925502094, "phrase": "psychosocial_effects"}, {"score": 0.0035932440062595252, "phrase": "predominantly_positive_emotions"}, {"score": 0.0035565113234273926, "phrase": "occasional_moments"}, {"score": 0.003413284742632989, "phrase": "home-based_ambient_display"}, {"score": 0.0032842354746763906, "phrase": "recent_photos"}, {"score": 0.0032423089921154503, "phrase": "lifelogging_device"}, {"score": 0.003209152260950748, "phrase": "psychometric_tests"}, {"score": 0.003192700856094016, "phrase": "semistructured_interviews"}, {"score": 0.003119703729649559, "phrase": "participant's_sense"}, {"score": 0.0030877969090964386, "phrase": "lower_apathy"}, {"score": 0.0030094459611176207, "phrase": "recent_experiences"}, {"score": 0.002986329509791943, "phrase": "sensecam"}, {"score": 0.002940626369102927, "phrase": "raw_image_stream"}, {"score": 0.002910545717767559, "phrase": "slide_show"}, {"score": 0.0028807718824400697, "phrase": "selected_number"}, {"score": 0.002836679611901583, "phrase": "family_member"}, {"score": 0.0027153723391625043, "phrase": "episodic_recall"}, {"score": 0.00248167018931442, "phrase": "individual_user's_capacity"}, {"score": 0.0022218413146898887, "phrase": "interpersonal_relationships"}, {"score": 0.0021654157292186967, "phrase": "design_considerations"}, {"score": 0.0021049977753042253, "phrase": "future_\"personal_memory\"_technologies"}], "paper_keywords": [""], "paper_abstract": "Research has shown that personal memory technologies are a promising way to address the needs of older adults with memory impairments. In this article, we review three recently completed studies that evaluated technologies for personal memories intended for persons with Alzheimer's disease (AD) or mild cognitive impairment (MCI). In the first study, we worked with 12 participants with AD or MCI and their families to construct DVD-based Multimedia Biographies that depicted prominent events, people, and places from the participant's past. We then evaluated over a period of 6 months psychosocial effects that viewing the biographies had on the participants and their family members. These effects included stimulating reminiscence of past events, triggering predominantly positive emotions of happiness and occasional moments of sadness, and engaging conversations with family members. In our second study, we designed a home-based ambient display that allowed a man with AD to similarly review his past life, in combination with recent photos automatically captured by a lifelogging device called SenseCam. Psychometric tests and semistructured interviews revealed how the intervention appeared to improve the participant's sense of self and lower apathy. In our final study of 5 cognitively impaired participants we compared representations of recent experiences captured with SenseCam in 3 ways: with the raw image stream, with a slide show consisting of a selected number of SenseCam images narrated by a family member, and with a control reviewing no images. Results included evidence that reviewing SenseCam images improved episodic recall for personal events depicted in the images for 4 of the 5 participants. Based on lessons learned from this research, we suggest that personal memory technologies should not just be framed as systems for augmenting an individual user's capacity for accurate recall of personal events, but instead should support groups of people such as members of a family in telling their life stories. This conception yields benefits beyond the support of memory, such as fostering a sense of self and strengthening interpersonal relationships with family members. We conclude the article by presenting design considerations to help guide and inform the development and evaluation of future \"personal memory\" technologies.", "paper_title": "Reconstructing the Past: Personal Memory Technologies Are Not Just Personal and Not Just for Memory", "paper_id": "WOS:000304010300005"}