{"auto_keywords": [{"score": 0.03857701375589246, "phrase": "feedback_signals"}, {"score": 0.00481495049065317, "phrase": "two-way_secure_communications"}, {"score": 0.0046046429665581555, "phrase": "source_node"}, {"score": 0.0041488110506566825, "phrase": "practical_point"}, {"score": 0.0038798015183611275, "phrase": "communication_rates"}, {"score": 0.0037101871762082153, "phrase": "transmitted_messages"}, {"score": 0.003392804886610623, "phrase": "secrecy_capacity"}, {"score": 0.0032686865485199806, "phrase": "gaussian_two-way_wiretap_channel"}, {"score": 0.0031140747752837826, "phrase": "secrecy_rate_loss"}, {"score": 0.002977835845437357, "phrase": "special_case"}, {"score": 0.0027433143290371293, "phrase": "half-duplex_gaussian_two-way_relay_channel"}, {"score": 0.0025178072071268534, "phrase": "previous_scenario"}, {"score": 0.0024529174827030787, "phrase": "secrecy_rate"}, {"score": 0.0023368018449680295, "phrase": "channel_use"}, {"score": 0.0023107943665108465, "phrase": "relay_power"}, {"score": 0.002259642580775186, "phrase": "achievable_rate_region"}, {"score": 0.0022261705957258506, "phrase": "simple_time_sharing"}, {"score": 0.0022013916728990564, "phrase": "cooperative_jamming"}, {"score": 0.002136651746284283, "phrase": "optimum_performance"}, {"score": 0.0021049977753042253, "phrase": "viable_alternative"}], "paper_keywords": ["Cooperative jamming", " feedback", " information theoretic security", " two-way relay channel", " two-way wiretap channel"], "paper_abstract": "Most practical communication links are bidirectional. In these models, since the source node also receives signals, its encoder has the option of computing its output based on the signals it received in the past. On the other hand, from a practical point of view, it would also be desirable to identify the cases where such an encoder design may not improve communication rates. This question is particularly interesting for the case where the transmitted messages and the feedback signals are subject to eavesdropping. In this paper, we investigate the question of how much impact the feedback has on the secrecy capacity by studying two fundamental models. First, we consider the Gaussian two-way wiretap channel and derive an outer bound for its secrecy capacity region. We show that the secrecy rate loss can be unbounded when feedback signals are not utilized except for a special case we identify, and thus conclude that utilizing feedback can be highly beneficial in general. Second, we consider a half-duplex Gaussian two-way relay channel where the relay node is also an eavesdropper, and find that the impact of feedback is less pronounced compared to the previous scenario. Specifically, the loss in secrecy rate, when ignoring the feedback, is quantified to be less than 0.5 bit per channel use when the relay power goes to infinity. This achievable rate region is obtained with simple time sharing along with cooperative jamming, which, with its simplicity and near optimum performance, is a viable alternative to an encoder that utilizes feedback signals.", "paper_title": "The Role of Feedback in Two-Way Secure Communications", "paper_id": "WOS:000327594500022"}