{"auto_keywords": [{"score": 0.03221581422402984, "phrase": "euphemus"}, {"score": 0.015588521975528435, "phrase": "unreliable_online_markets"}, {"score": 0.00481495049065317, "phrase": "reputation_mechanisms"}, {"score": 0.004734038956773703, "phrase": "modern_online_markets"}, {"score": 0.0044237033788643715, "phrase": "immediate_action"}, {"score": 0.004116139569480336, "phrase": "suitable_metaphor"}, {"score": 0.0040298010803060495, "phrase": "increasing_complexity"}, {"score": 0.003797530813314321, "phrase": "key_issues"}, {"score": 0.0037654565082218595, "phrase": "online_markets"}, {"score": 0.003670843919846253, "phrase": "different_perspectives"}, {"score": 0.0036090884921108086, "phrase": "related_notions"}, {"score": 0.003315499339103866, "phrase": "open_online_markets"}, {"score": 0.0028822153400215973, "phrase": "particular_application_domain"}, {"score": 0.0027741761880779535, "phrase": "interesting_properties"}, {"score": 0.002750721367040336, "phrase": "e-commerce_environments"}, {"score": 0.0027159094186967247, "phrase": "trust_perspective"}, {"score": 0.0025810006125483835, "phrase": "well-known_trust_and_reputation_models"}, {"score": 0.0023507916951658455, "phrase": "extensive_experimentation"}], "paper_keywords": ["Trust and reputation", " Open online markets", " Simulation testbed", " Agent modeling"], "paper_abstract": "Modern online markets are becoming extremely dynamic, indirectly dictating the need for (semi-) autonomous approaches for constant monitoring and immediate action in order to satisfy one's needs/preferences. In such open and versatile environments, software agents may be considered as a suitable metaphor for dealing with the increasing complexity of the problem. Additionally, trust and reputation have been recognized as key issues in online markets and many researchers have, in different perspectives, surveyed the related notions, mechanisms and models. Within the context of this work we present an adaptable, multivariate agent testbed for the simulation of open online markets and the study of various factors affecting the quality of the service consumed. This testbed, which we call Euphemus, is highly parameterized and can be easily customized to suit a particular application domain. It allows for building various market scenarios and analyzing interesting properties of e-commerce environments from a trust perspective. The architecture of Euphemus is presented and a number of well-known trust and reputation models are built with Euphemus, in order to show how the testbed can be used to apply and adapt models. Extensive experimentation has been performed in order to show how models behave in unreliable online markets, results are discussed and interesting conclusions are drawn. (C) 2014 Elsevier B. V. All rights reserved.", "paper_title": "A simulation testbed for analyzing trust and reputation mechanisms in unreliable online markets", "paper_id": "WOS:000343136300006"}