{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "next_generation_coordination_infrastructures"}, {"score": 0.004652016085325825, "phrase": "central_role"}, {"score": 0.00452043800760441, "phrase": "multiagent_systems"}, {"score": 0.00436742595270452, "phrase": "agent_technology"}, {"score": 0.004268293864953256, "phrase": "coordination_infrastructures"}, {"score": 0.004171402455813099, "phrase": "significant_number"}, {"score": 0.0040767015025213625, "phrase": "varying_features"}, {"score": 0.003166259444961177, "phrase": "human_interaction"}, {"score": 0.0031122556980616753, "phrase": "mas"}, {"score": 0.0028880836335117297, "phrase": "decision_support"}, {"score": 0.002294686545883412, "phrase": "promising_approaches"}, {"score": 0.002191489192077851, "phrase": "research_issues"}], "paper_keywords": [""], "paper_abstract": "Coordination infrastructures play a central role in the engineering of multiagent systems. Since the advent of agent technology, research on coordination infrastructures has produced a significant number of infrastructures with varying features. In this paper, we review the the state-of-the-art coordination infrastructures with the purpose of identifying open research challenges that next generation coordination infrastructures should address. Our analysis concludes that next generation coordination infrastructures must address a number of challenges: (i) to become socially aware, by facilitating human interaction within a MAS; (ii) to assist agents in their decision making by providing decision support that helps them reduce the scope of reasoning and facilitates the achievement of their goals; and (iii) to increase openness to support on-line, fully decentralised design and execution. Furthermore, we identify some promising approaches in the literature, together with the research issues worth investigating, to cope with such challenges.", "paper_title": "Towards next generation coordination infrastructures", "paper_id": "WOS:000361136900005"}