{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "binary_channels"}, {"score": 0.004771435352180973, "phrase": "causal_adversaries"}, {"score": 0.004417012437860011, "phrase": "causal_adversarial_jammer"}, {"score": 0.003683097597914604, "phrase": "communication_channel"}, {"score": 0.0035194572615570977, "phrase": "common_randomness"}, {"score": 0.0034717929086014636, "phrase": "adversarial_jammer"}, {"score": 0.0034092396400930446, "phrase": "transmitted_bits"}, {"score": 0.002988101395789399, "phrase": "causal_manner"}, {"score": 0.0025137856138000014, "phrase": "\"classical\"_adversarial_jamming_situations"}, {"score": 0.0022743274702883456, "phrase": "upper_bounds"}, {"score": 0.0021049977753042253, "phrase": "deterministic_and_stochastic_encoding_schemes"}], "paper_keywords": ["Arbitrarily varying channels (AVCs)", " channel coding", " jamming"], "paper_abstract": "In this paper, we consider the communication of information in the presence of a causal adversarial jammer. In the setting under study, a sender wishes to communicate a message to a receiver by transmitting a codeword x = (x(1),..., x(n)) bit-by-bit over a communication channel. The sender and the receiver do not share common randomness. The adversarial jammer can view the transmitted bits x(i) one at a time and can change up to a p-fraction of them. However, the decisions of the jammer must be made in a causal manner. Namely, for each bit x(i), the jammer's decision on whether to corrupt it or not must depend only on x(j) for j <= i. This is in contrast to the \"classical\" adversarial jamming situations in which the jammer has no knowledge of x, or knows x completely. In this study, we present upper bounds (that hold under both the average and maximal probability of error criteria) on the capacity which hold for both deterministic and stochastic encoding schemes.", "paper_title": "Upper Bounds on the Capacity of Binary Channels With Causal Adversaries", "paper_id": "WOS:000320709800033"}