{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "different_kinds"}, {"score": 0.004412780054037622, "phrase": "adults'_understanding"}, {"score": 0.004312622975366676, "phrase": "basic_nature"}, {"score": 0.0037747835341722636, "phrase": "different_entities"}, {"score": 0.0036052633308076933, "phrase": "goal-directed_intentional_thought"}, {"score": 0.003213920601037463, "phrase": "initial_experiments"}, {"score": 0.003083655376444887, "phrase": "anthropomorphic_robots"}, {"score": 0.002999749669403939, "phrase": "robots'_attention"}, {"score": 0.0028127163745564777, "phrase": "multiple_regression"}, {"score": 0.0027741761880779535, "phrase": "differential_behavioral_predictions"}, {"score": 0.002748775748298028, "phrase": "mechanical_and_human_entities"}, {"score": 0.002673957615079041, "phrase": "goal_understanding"}, {"score": 0.0021049977753042253, "phrase": "intentional_behavior"}], "paper_keywords": [""], "paper_abstract": "This research investigates adults' understanding of differences in the basic nature of intelligence exhibited by humans and by machines such as computers and robots. We tested these intuitions by asking participants to make predictions about the behaviors of different entities in situations where actions could be based on either goal-directed intentional thought or more mechanical nonintentional thought. Across several studies, adults made more intentional predictions about the behavior of humans than about the behavior of robots or computers. Although initial experiments demonstrated that participants made very similar predictions for computers and anthropomorphic robots, when asked to track robots' attention to objects, participants began to predict more intentional behaviors for the robot. A multiple regression demonstrated that differential behavioral predictions about mechanical and human entities were associated with ratings of goal understanding but not overall intelligence of current computers/robots. These findings suggest that people differentiate humans and computers along the lines of intentionality but initially equate robots and computers. However, the tendency to equate computers and robots can be at least partially overridden when attention is focused on robots engaging in intentional behavior.", "paper_title": "Tests of Concepts About Different Kinds of Minds: Predictions About the Behavior of Computers, Robots, and People", "paper_id": "WOS:000313632500003"}