{"auto_keywords": [{"score": 0.03341555734589077, "phrase": "partial-pairs_simrank"}, {"score": 0.014808017715888779, "phrase": "simrank"}, {"score": 0.00481495049065317, "phrase": "large_networks"}, {"score": 0.004749323365717064, "phrase": "node-to-node_similarities"}, {"score": 0.004495598802612427, "phrase": "notable_measure"}, {"score": 0.003918788905825147, "phrase": "appealing_applications"}, {"score": 0.0038973170902076707, "phrase": "partial-pair_s_simrank"}, {"score": 0.0034534918227136138, "phrase": "best-known_solution"}, {"score": 0.003323126045016116, "phrase": "simrank_scores"}, {"score": 0.0032777653153451265, "phrase": "h-go_cover"}, {"score": 0.0031801323969554976, "phrase": "efficient_assessment"}, {"score": 0.0031367173902609887, "phrase": "self-contained_manner"}, {"score": 0.0027113164412780107, "phrase": "k_iterations"}, {"score": 0.0026742845156077174, "phrase": "vertical_bar_v_vertical_bar_nodes"}, {"score": 0.0026596133775123538, "phrase": "vertical_bar_e_vertical_bar_edges"}, {"score": 0.002601727192945944, "phrase": "unnecessary_edge_access"}, {"score": 0.0023439369306689673, "phrase": "delta"}, {"score": 0.002324208265381268, "phrase": "maximum_degree"}, {"score": 0.0022118950795192503, "phrase": "single-source_simranks"}, {"score": 0.0021049977753042253, "phrase": "best-known_competitors"}], "paper_keywords": [""], "paper_abstract": "The assessment of node-to-node similarities based on graph topology arises in a myriad of applications, e.g., web search. SimRank is a notable measure of this type, with the intuition that \"two nodes are similar if their in-neighbors are similar\". While most existing work retrieving SimRank only considers all-pairs SimRank s(star,star) and single-source SimRank s(star, j) (scores between every node and query j), there are appealing applications for partial-pair s SimRank, e.g., similarity join. Given two node subsets A and B in a graph, partial-pairs SimRank assessment aims to retrieve only {s(a, b)}(for all a is an element of A,for all b is an element of B.) However, the best-known solution appears not self-contained since it hinges on the premise that the SimRank scores with node-pairs in an h-go cover set must be given beforehand. This paper focuses on efficient assessment of partial-pairs SimRank in a self-contained manner. (1) We devise a novel \"seed germination\" model that computes partial-pairs SimRank in O(k vertical bar E vertical bar min{vertical bar A vertical bar, vertical bar B vertical bar}) time and O(vertical bar E vertical bar+ k vertical bar V vertical bar) memory for k iterations on a graph of vertical bar V vertical bar nodes and vertical bar E vertical bar edges. (2) We further eliminate unnecessary edge access to improve the time of partial-pairs SimRank to O(mmin{vertical bar A vertical bar,vertical bar B vertical bar}), where m <= min{k vertical bar E vertical bar, Delta(2k)}, and Delta is the maximum degree. (3) We show that our partial-pairs SimRank model also can handle the computations of all-pairs and single-source SimRanks. (4) We empirically verify that our algorithms are (a) 38x faster than the best-known competitors, and (b) memory-efficient, allowing scores to be assessed accurately on graphs with tens of millions of links.", "paper_title": "Efficient Partial-Pairs SimRank Search on Large Networks", "paper_id": "WOS:000362280300011"}