{"auto_keywords": [{"score": 0.015719716506582538, "phrase": "collaborative_approach"}, {"score": 0.01559242258201332, "phrase": "face_verification"}, {"score": 0.00873438096126329, "phrase": "attribute_values"}, {"score": 0.004273782634394231, "phrase": "predefined_describable_attributes"}, {"score": 0.004238775572746022, "phrase": "face_images"}, {"score": 0.003968806706727518, "phrase": "based_face_search"}, {"score": 0.0038720442355114045, "phrase": "computer_vision_domain"}, {"score": 0.0035224030823976186, "phrase": "large_variation"}, {"score": 0.002629539710839523, "phrase": "random-walk_model"}, {"score": 0.002461810159687652, "phrase": "face_verification_performance"}, {"score": 0.0024416087858984644, "phrase": "r-lda_model"}, {"score": 0.002276439636865258, "phrase": "relative_stable_results"}, {"score": 0.002239225269052105, "phrase": "experimental_results"}, {"score": 0.0022117133940361025, "phrase": "real-world_photo_collections"}, {"score": 0.002157697367447098, "phrase": "proposed_approach"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Face verification", " Human attribute", " Interactive approach"], "paper_abstract": "Face verification which aims to determine whether two given faces refer to the same person, and human attribute learning with the goal of extracting predefined describable attributes from face images, are two fundamental issues in a variety of applications (e.g., face tagging, attribute based face search). While advances in computer vision domain have resulted in a series of techniques for each of the two tasks, such techniques are usually prone to errors due to the large variation of faces in pose, expression, illumination, occlusion, etc. Different from most prior related works which focus on the two tasks separately, in this paper, we explore their relationships and propose a collaborative approach allowing them to interact with each other to iteratively reduce errors and uncertainties. The interaction is embodies in two processes, one is that the results of face verification can be leveraged to refine attribute values utilizing the random-walk model, and the other is that the attribute values can also be employed to improve the face verification performance through R-LDA model. The two interactive processes will continue to iteratively improve the performance of the two tasks, until the relative stable results are achieved. Experimental results on the real-world photo collections demonstrate the effectiveness of the proposed approach. (C) 2014 Elsevier Inc. All rights reserved.", "paper_title": "A collaborative approach for face verification and attributes refinement", "paper_id": "WOS:000340315600043"}