{"auto_keywords": [{"score": 0.0500654463494076, "phrase": "augmented_reality"}, {"score": 0.04747057536702851, "phrase": "ar"}, {"score": 0.03544936371789791, "phrase": "instructional_approach"}, {"score": 0.004508155639663496, "phrase": "different_meanings"}, {"score": 0.004478567563654688, "phrase": "varying_researchers"}, {"score": 0.004206961274823494, "phrase": "ar."}, {"score": 0.0037611961382938964, "phrase": "ar_systems"}, {"score": 0.003675437054650504, "phrase": "compelling_features"}, {"score": 0.0036034816680872877, "phrase": "ar_applications"}, {"score": 0.0033184711049370425, "phrase": "ar_system"}, {"score": 0.003264224201388006, "phrase": "technology_design"}, {"score": 0.003210861212842534, "phrase": "learning_experiences"}, {"score": 0.003086311260099341, "phrase": "instructional_approaches"}, {"score": 0.0028514769721161063, "phrase": "ar_approaches"}, {"score": 0.0027680831622262027, "phrase": "new_learning_opportunities"}, {"score": 0.0027228088474257426, "phrase": "new_challenges"}, {"score": 0.0024990202385797252, "phrase": "ar_environments"}, {"score": 0.002441969502075509, "phrase": "large_amount"}, {"score": 0.0022264684349099775, "phrase": "possible_solutions"}, {"score": 0.0021470954708827125, "phrase": "future_research"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Virtual reality", " Architectures for educational technology system"], "paper_abstract": "Although augmented reality (AR) has gained much research attention in recent years, the term AR was given different meanings by varying researchers. In this article, we first provide an overview of definitions, taxonomies, and technologies of AR. We argue that viewing AR as a concept rather than a type of technology would be more productive for educators, researchers, and designers. Then we identify certain features and affordances of AR systems and applications. Yet, these compelling features may not be unique to AR applications and can be found in other technological systems or learning environments (e.g., ubiquitous and mobile learning environments). The instructional approach adopted by an AR system and the alignment among technology design, instructional approach, and learning experiences may be more important. Thus, we classify three categories of instructional approaches that emphasize the \"roles,\" \"tasks,\" and \"locations,\" and discuss what and how different categories of AR approaches may help students learn. While AR offers new learning opportunities, it also creates new challenges for educators. We outline technological, pedagogical, learning issues related to the implementation of AR in education. For example, students in AR environments may be cognitively overloaded by the large amount of information they encounter, the multiple technological devices they are required to use, and the complex tasks they have to complete. This article provides possible solutions for some of the challenges and suggests:topics and issues for future research. (C) 2012 Elsevier Ltd. All rights reserved.", "paper_title": "Current status, opportunities and challenges of augmented reality in education", "paper_id": "WOS:000316523100006"}