{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "intention_recognition"}, {"score": 0.014179687728560153, "phrase": "evolutionary_game_theory"}, {"score": 0.004746263721902201, "phrase": "apology_-_a_research_summary"}, {"score": 0.004529696178827392, "phrase": "abstract_individuals"}, {"score": 0.004481132747216135, "phrase": "diverse_behavioral_strategies"}, {"score": 0.004369824355829779, "phrase": "mathematical_study"}, {"score": 0.0042459818200777846, "phrase": "evolutionary_psychology"}, {"score": 0.004140490129683107, "phrase": "simulation_techniques"}, {"score": 0.004037608759610068, "phrase": "aforesaid_mechanisms"}, {"score": 0.003909065355459264, "phrase": "alternative_virtual_games"}, {"score": 0.0038671299350540554, "phrase": "theoretical_and_experimental_results"}, {"score": 0.0035473867669654174, "phrase": "cognitive_abilities"}, {"score": 0.003459191419478298, "phrase": "artificial_intelligence"}, {"score": 0.0031959843979467704, "phrase": "communication_noise"}, {"score": 0.0029001227160784498, "phrase": "commitment"}, {"score": 0.0024050158199950024, "phrase": "mutual_tolerance"}, {"score": 0.0023536149458842992, "phrase": "someone's_intentions"}, {"score": 0.0022950308685133224, "phrase": "recognition_others"}, {"score": 0.002174346780014853, "phrase": "unfulfilled_commitment"}], "paper_keywords": ["Intention recognition", " commitments", " evolution of cooperation", " apology", " multi-agent systems", " evolutionary game theory"], "paper_abstract": "The mechanisms of emergence and evolution of cooperation in populations of abstract individuals, with diverse behavioral strategies in co-presence, have been undergoing mathematical study via evolutionary game theory, inspired in part on evolutionary psychology. Their systematic study resorts to simulation techniques, thus enabling the study of aforesaid mechanisms under a variety of conditions, parameters and alternative virtual games. The theoretical and experimental results have continually been surprising, rewarding and promising. In our recent work, we initiated the introduction, in such groups of individuals, of cognitive abilities inspired on techniques and theories of Artificial Intelligence, namely those pertaining to Intention Recognition, Commitment and Apology (separately and jointly), encompassing errors in decision-making and communication noise. As a result, both the emergence and stability of cooperation become reinforced comparatively to the absence of such cognitive abilities. This holds separately for Intention Recognition, for Commitment and for Apology, and even more so when they are jointly engaged. Our presentation aims to sensitize the reader to these evolutionary game theory based issues, results and prospects, which are accruing in importance for the modeling of minds with machines, with impact on our understanding of the evolution of mutual tolerance and cooperation. Recognition of someone's intentions, which may include imagining the recognition others have of our own intentions, and may comprise not just some error tolerance, but also a penalty for unfulfilled commitment though allowing for apology, can lead to evolutionary stable win/win equilibriums within groups of individuals, and perhaps amongst groups. The recognition and the manifestation of intentions, plus the assumption of commitment-even whilst paying a cost for putting it in place-and the acceptance of apology, are all facilitators in that respect, each of them singly and, above all, in collusion.", "paper_title": "Emergence of cooperation via intention recognition, commitment and apology - A research summary", "paper_id": "WOS:000361767900008"}