{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "sink-location_privacy"}, {"score": 0.0473181943391754, "phrase": "powerful_adversary"}, {"score": 0.004774324145784758, "phrase": "wireless_sensor_networks"}, {"score": 0.004634799977448855, "phrase": "shared_nature"}, {"score": 0.00459568664065473, "phrase": "wireless_communication_media"}, {"score": 0.0044424917428102445, "phrase": "entire_radio_communication"}, {"score": 0.004312622975366676, "phrase": "contextual_communication_statistics"}, {"score": 0.0038624981944755813, "phrase": "data_traffic"}, {"score": 0.003829877278269543, "phrase": "distinctive_patterns"}, {"score": 0.0036553070575015344, "phrase": "global_view"}, {"score": 0.003259702394241964, "phrase": "communication_statistics"}, {"score": 0.0031777570808834213, "phrase": "k_entities"}, {"score": 0.002857849698346116, "phrase": "nonanalytic_function"}, {"score": 0.0027741761880779535, "phrase": "nonlinearly_constrained_nonlinear_optimization_problem"}, {"score": 0.0025591748412278174, "phrase": "quadratic_time"}, {"score": 0.002526780881314497, "phrase": "obtained_solutions"}, {"score": 0.0024632148715152393, "phrase": "increasing_privacy_requirements"}, {"score": 0.0024012441367538434, "phrase": "k-anonymity_sink-location_problems"}, {"score": 0.0021229583685841405, "phrase": "large_number"}, {"score": 0.0021049977753042253, "phrase": "network_nodes"}], "paper_keywords": [""], "paper_abstract": "Due to the shared nature of wireless communication media, a powerful adversary can eavesdrop on the entire radio communication in the network and obtain the contextual communication statistics, for example, traffic volumes, transmitter locations, and so forth. Such information can reveal the location of the sink around which the data traffic exhibits distinctive patterns. To protect the sink-location privacy from a powerful adversary with a global view, we propose to achieve k-anonymity in the network so that at least k entities in the network are indistinguishable to the nodes around the sink with regard to communication statistics. Arranging the location of k entities is complex as it affects two conflicting goals: the routing energy cost and the achievable privacy level, and both goals are determined by a nonanalytic function. We model such a positioning problem as a nonlinearly constrained nonlinear optimization problem. To tackle it, we design a generic-algorithm-based quasi-optimal (GAQO) method that obtains quasi-optimal solutions at quadratic time. The obtained solutions closely approximate the optima with increasing privacy requirements. Furthermore, to solve k-anonymity sink-location problems more efficiently, we develop an artificial potential-based quasi-optimal (APQO) method that is of linear time complexity. Our extensive simulation results show that both algorithms can effectively find solutions hiding the sink among a large number of network nodes.", "paper_title": "Enhancing Sink-Location Privacy in Wireless Sensor Networks through k-Anonymity", "paper_id": "WOS:000303766300001"}