{"auto_keywords": [{"score": 0.04838919478929022, "phrase": "distributed_system"}, {"score": 0.03423057083405171, "phrase": "partially_synchronous_case"}, {"score": 0.00481495049065317, "phrase": "distributed_computing_community"}, {"score": 0.004603525341738782, "phrase": "distinct_identifiers"}, {"score": 0.004096082254543022, "phrase": "different_identifiers"}, {"score": 0.0037272031155266556, "phrase": "byzantine_processes"}, {"score": 0.0034841647157189985, "phrase": "synchronous_case"}, {"score": 0.003141830113006653, "phrase": "classical_model"}, {"score": 0.002963390095037466, "phrase": "partial_synchrony"}, {"score": 0.00277001889871322, "phrase": "correct_processes"}, {"score": 0.0026362590493392785, "phrase": "impossibility_proofs"}, {"score": 0.0025660347613972573, "phrase": "byzantine_process"}, {"score": 0.0025316254589087973, "phrase": "multiple_messages"}, {"score": 0.0022218413146898887, "phrase": "partially_synchronous_model"}], "paper_keywords": ["Consensus", " Message passing", " Process identifiers", " Byzantine failures"], "paper_abstract": "So far, the distributed computing community has either assumed that all the processes of a distributed system have distinct identifiers or, more rarely, that the processes are anonymous and have no identifiers. These are two extremes of the same general model: namely, processes use different identifiers, where . In this paper, we ask how many identifiers are actually needed to reach agreement in a distributed system with Byzantine processes. We show that having identifiers is necessary and sufficient for agreement in the synchronous case but, more surprisingly, the number of identifiers must be greater than in the partially synchronous case. This demonstrates two differences from the classical model (which has ): there are situations where relaxing synchrony to partial synchrony renders agreement impossible; and, in the partially synchronous case, increasing the number of correct processes can actually make it harder to reach agreement. The impossibility proofs use the fact that a Byzantine process can send multiple messages to the same recipient in a round. We show that removing this ability makes agreement easier: then, identifiers are sufficient for agreement, even in the partially synchronous model, assuming processes can count the number of messages with the same identifier they receive in a round.", "paper_title": "Byzantine agreement with homonyms", "paper_id": "WOS:000325816000005"}