{"auto_keywords": [{"score": 0.049707293588616405, "phrase": "crew_pairing"}, {"score": 0.01190375593313179, "phrase": "aircraft_routing"}, {"score": 0.007800482507799613, "phrase": "delay_propagation"}, {"score": 0.00481495049065317, "phrase": "robust_aircraft_routing"}, {"score": 0.004594951819987416, "phrase": "airline_scheduling_problem"}, {"score": 0.004055998173160551, "phrase": "decision-making_process"}, {"score": 0.003885668358145471, "phrase": "solution_process"}, {"score": 0.0034296217420566304, "phrase": "flight_network"}, {"score": 0.003389704997952315, "phrase": "dunbar_et_al"}, {"score": 0.0032472646337850042, "phrase": "new_algorithm"}, {"score": 0.0031351720217878917, "phrase": "propagated_delay"}, {"score": 0.002911040915793745, "phrase": "dunbar"}, {"score": 0.0027240799841720957, "phrase": "delay_propagation_reduction"}, {"score": 0.002671406231520296, "phrase": "stochastic_delay_information"}, {"score": 0.0024610448251906453, "phrase": "incumbent_aircraft"}, {"score": 0.0024418934977061876, "phrase": "crew_schedule"}, {"score": 0.0023300677028248776, "phrase": "promising_results"}, {"score": 0.00228499525153, "phrase": "real-world_airline_network"}, {"score": 0.002171836484200008, "phrase": "substantially_significant_reduction"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Robust airline scheduling", " Delay propagation", " Airline schedule optimization", " Schedule re-timing"], "paper_abstract": "For reasons of tractability, the airline scheduling problem has traditionally been sequentially decomposed into various stages (e.g. schedule generation, fleet assignment, aircraft routing, and crew pairing), with the decisions from one stage imposed upon the decision-making process in subsequent stages. Whilst this approach greatly simplifies the solution process, it unfortunately fails to capture many dependencies between the various stages, most notably between those of aircraft routing and crew pairing, and how these dependencies affect the propagation of delays through the flight network. In Dunbar et al. (2012) [9] we introduced a new algorithm to accurately calculate and minimize the cost of propagated delay, in a framework that integrates aircraft routing and crew pairing. In this paper we extend the approach of Dunbar at al. (2012) [9] by proposing two new algorithms that achieve further improvements in delay propagation reduction via the incorporation of stochastic delay information. We additionally propose a heuristic, used in conjunction with these two approaches, capable of re-timing an incumbent aircraft and crew schedule to further minimize the cost of delay propagation. These algorithms provide promising results when applied to a real-world airline network and motivate our final integrated aircraft routing, crew pairing and re-timing approach which provides a substantially significant reduction in delay propagation. (C) 2013 Elsevier Ltd. All rights reserved.", "paper_title": "An integrated scenario-based approach for robust aircraft routing, crew pairing and re-timing", "paper_id": "WOS:000332434600008"}