{"auto_keywords": [{"score": 0.046114804435266145, "phrase": "peak_current"}, {"score": 0.011544315965693299, "phrase": "switching_power"}, {"score": 0.010350365702989733, "phrase": "chip_reliability"}, {"score": 0.008502647922505654, "phrase": "minimising_peak_current"}, {"score": 0.007263191442458793, "phrase": "search_space"}, {"score": 0.007211327394819845, "phrase": "state_encoding"}, {"score": 0.00481495049065317, "phrase": "peak_current_minimisation"}, {"score": 0.004746263721902201, "phrase": "silicon_process_technology"}, {"score": 0.004529696178827392, "phrase": "critical_factors"}, {"score": 0.0042920078348374375, "phrase": "high_current_peaks"}, {"score": 0.004215571179806372, "phrase": "state_transition"}, {"score": 0.004185377431624781, "phrase": "synchronous_finite_state_machine"}, {"score": 0.003923144245133288, "phrase": "state_encoding_problem"}, {"score": 0.0037710151976096985, "phrase": "previous_power-aware_state_encoding_algorithms"}, {"score": 0.003611751858608048, "phrase": "switching_activities"}, {"score": 0.0035858673522839407, "phrase": "state_register"}, {"score": 0.003373181367365139, "phrase": "secondary_objective"}, {"score": 0.0031845067058084583, "phrase": "sat-pc"}, {"score": 0.002669683153809812, "phrase": "sat_problem"}, {"score": 0.0026505322540093783, "phrase": "pseudo-boolean_expressions"}, {"score": 0.0025938977569302177, "phrase": "full_exploration"}, {"score": 0.0024664004864629724, "phrase": "efficient_sat-based_heuristic"}, {"score": 0.0023367260405565814, "phrase": "minimum_peak_current"}, {"score": 0.002262209824105154, "phrase": "mcnc_benchmarks"}], "paper_keywords": [""], "paper_abstract": "As the silicon process technology advances, chip reliability becomes more and more important. One of the critical factors that affect the chip reliability is the peak current in the circuit. In particular, high current peaks at the time of state transition in synchronous finite state machine (FSM) circuits often make the circuits very unstable in execution. This work addresses the state encoding problem with the objective of minimising peak current in FSMs. Unlike the previous power-aware state encoding algorithms, where the primary objective is to reduce the amount of switching activities of state register and the problem of reducing peak current has not been addressed at all or considered as a secondary objective, which obviously severely limits the search space of state encoding for minimising peak current, our algorithm, called SAT-pc, places the importance on the reliability, that is, peak current. Specifically, the authors solve two important state encoding problems in two phases: (Phase 1) the authors present a solution to the problem of state encoding for directly minimising peak current, by formulating it into the SAT problem with pseudo-Boolean expressions, which leads to a full exploration of the search space; (Phase 2) the authors then propose an efficient SAT-based heuristic to solve the state re-encoding problem for minimising switching power without deteriorating the minimum peak current obtained in Phase 1. Through an experimentation using MCNC benchmarks, it is shown that SAT-pc is able to reduce the peak current by 51 and 35%, compared to POW3 [4] that minimises the switching power only and POW3[14] + [24] that minimises the switching power and then peak current, respectively.", "paper_title": "State encoding algorithm for peak current minimisation", "paper_id": "WOS:000287964500005"}