{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "mimo_systems"}, {"score": 0.004755054742217193, "phrase": "qr_decomposition"}, {"score": 0.004666598697538815, "phrase": "fundamental_operation"}, {"score": 0.004301834610818624, "phrase": "high-throughput_converted_form_qr_factorization"}, {"score": 0.0040916230716372265, "phrase": "proposed_two-phase_computing_scheme"}, {"score": 0.0036782824183282823, "phrase": "coordinate_rotation_digital_computer"}, {"score": 0.0035204268675160257, "phrase": "massively_parallel_array_architecture"}, {"score": 0.0033905067962602515, "phrase": "cordic_modules"}, {"score": 0.0031646057802503526, "phrase": "chaining_mode_operation"}, {"score": 0.003066945490483524, "phrase": "five_successive_signal_vector_updates"}, {"score": 0.0028805474861014722, "phrase": "chip_implementation_result"}, {"score": 0.002722468694023035, "phrase": "equivalent_gate_count"}, {"score": 0.0021049977753042253, "phrase": "power_consumption"}], "paper_keywords": ["Coordinate rotation digital computer (CORDIC)", " multiple-input-multiple-output (MIMO)", " QR decomposition (QRD)"], "paper_abstract": "QR decomposition is a fundamental operation widely used in various signal detection schemes for multiple-input multiple-output (MIMO) systems. In this brief, a high-throughput converted form QR factorization (QRF) is investigated. The proposed two-phase computing scheme starts with a direct form factorization followed by a post-processing using simple row/column permutations. Using coordinate rotation digital computer (CORDIC) algorithm, a massively parallel array architecture consisting of pipelined and folded CORDIC modules is developed to enhance the throughput. In addition, chaining mode operation is supported, where five successive signal vector updates can be performed the following every factorization. The chip implementation result in TSMC 0.18-mu m CMOS process indicates the design, with an equivalent gate count 192100, can operate at 200 MHz and accomplish 25-M complex-valued QRF per second. This suggests a highest 3-Gb/s data rate for signal detections in a 4 x 4 MIMO system. The proposed design also outperforms other designs in two compound performance indices, i.e., data rate normalized with respect to gate count and power consumption, respectively.", "paper_title": "Low-Complexity High-Throughput QR Decomposition Design for MIMO Systems", "paper_id": "WOS:000364208500036"}