{"auto_keywords": [{"score": 0.041183621006658046, "phrase": "user_commitment"}, {"score": 0.03228224387753608, "phrase": "project_managers"}, {"score": 0.00481495049065317, "phrase": "prior_research"}, {"score": 0.00475162193118036, "phrase": "information_system_development_projects"}, {"score": 0.004664352260912174, "phrase": "unrelated_concepts"}, {"score": 0.0043080553835735825, "phrase": "information_system_development_project"}, {"score": 0.004000010693331517, "phrase": "affective_mediators"}, {"score": 0.003803574975736106, "phrase": "behavioral_antecedents"}, {"score": 0.0037237682010640297, "phrase": "mediation_variable"}, {"score": 0.00362635182075772, "phrase": "extrinsic_motivators"}, {"score": 0.003503497128638102, "phrase": "collaboration_processes"}, {"score": 0.0034390716697976563, "phrase": "extrinsic_motivation"}, {"score": 0.003375826910838081, "phrase": "development_project"}, {"score": 0.0033579708256295847, "phrase": "project_success"}, {"score": 0.003287482882222731, "phrase": "matching_independent_variable"}, {"score": 0.0032014433546265694, "phrase": "partial_least_squares_regression"}, {"score": 0.0031342307827666675, "phrase": "affective_mediator"}, {"score": 0.0030847461428168614, "phrase": "tested_antecedents"}, {"score": 0.002988101395789399, "phrase": "essential_abilities"}, {"score": 0.0029565620771207003, "phrase": "sufficient_rewards"}, {"score": 0.002879158342988017, "phrase": "direct_subordinates"}, {"score": 0.0023974230190923563, "phrase": "process_mediators"}, {"score": 0.0023847297162970394, "phrase": "affective_states"}, {"score": 0.002372103459168231, "phrase": "future_work"}, {"score": 0.0023346234464901978, "phrase": "antecedent_inputs"}, {"score": 0.002322261865873902, "phrase": "software_projects"}, {"score": 0.002225691463551672, "phrase": "collaboration_mechanisms"}, {"score": 0.0021387992835532367, "phrase": "user_participants"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Extrinsic motivation", " Relationship commitment", " Collaboration", " Project performance", " Software development", " Project teams"], "paper_abstract": "Context: Prior research into the success of information system development projects views user commitment and collaboration as unrelated concepts in models that take either a perspective of mediators or one of processes. This perspective is limiting in that mediators and processes may interact during the course of an information system development project. Objective: In this work, we model both mediators and processes as important to project outcomes and propose that processes will also be impacted by affective mediators, specifically the behavioral mediator of user commitment and the project process of collaboration. The model also allows behavioral antecedents to be considered in relation to the mediation variable, specifically the ability of the users and the extrinsic motivators perceived by the users. Method: A questionnaire containing constructs of collaboration processes, user commitment, abilities, and extrinsic motivation are completed by users in a development project and project success is measured by the IS staff for a matching independent variable. 128 matching pairs were collected and the model analyzed using partial least squares regression. Results: Results indicate that the affective mediator can be influenced by the tested antecedents showing that IS project managers should be able to choose users with essential abilities and also establish sufficient rewards to employees, even those who may not be direct subordinates. Similarly, collaboration is still important to the success of a project, indicating that procedures to encourage collaboration be installed from the beginning of the project. However, commitment alone is sufficient to predict collaboration, meaning that motivation outside the processes in place may not be necessary to encourage collaboration between the users and IS staff. Conclusion: IS researchers should consider both process mediators and affective states in future work when considering the link between antecedent inputs of software projects to the success of outputs. IS managers should promote commitment among users beyond placing collaboration mechanisms in place. This might require project managers have more decision authority in the rewards provided to user participants. (C) 2010 Elsevier B.V. All rights reserved.", "paper_title": "User commitment and collaboration: Motivational antecedents and project performance", "paper_id": "WOS:000278150500007"}