{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "human_pose_estimation"}, {"score": 0.004472146692254812, "phrase": "spatial_layout"}, {"score": 0.004390312150344245, "phrase": "still_images"}, {"score": 0.003911578552479064, "phrase": "upper_body_detector"}, {"score": 0.0037177622939493084, "phrase": "weak_constraints"}, {"score": 0.003468796799802612, "phrase": "upper_body"}, {"score": 0.003389557201018519, "phrase": "uncontrolled_images"}, {"score": 0.0033428820402140683, "phrase": "prior_knowledge"}, {"score": 0.0026775328564629577, "phrase": "ground_truth_layout_annotation"}, {"score": 0.0026163210719740847, "phrase": "challenging_material"}, {"score": 0.002341384304635523, "phrase": "video_dataset"}, {"score": 0.0022878396720586044, "phrase": "specific_pose"}, {"score": 0.002154272413276506, "phrase": "retrieval_performance"}, {"score": 0.0021049977753042253, "phrase": "state-of-the-art_object_detection_models"}], "paper_keywords": ["Articulated human pose estimation search retrieval"], "paper_abstract": "We present a technique for estimating the spatial layout of humans in still images-the position of the head, torso and arms. The theme we explore is that once a person is localized using an upper body detector, the search for their body parts can be considerably simplified using weak constraints on position and appearance arising from that detection. Our approach is capable of estimating upper body pose in highly challenging uncontrolled images, without prior knowledge of background, clothing, lighting, or the location and scale of the person in the image. People are only required to be upright and seen from the front or the back (not side). We evaluate the stages of our approach experimentally using ground truth layout annotation on a variety of challenging material, such as images from the PASCAL VOC 2008 challenge and video frames from TV shows and feature films. We also propose and evaluate techniques for searching a video dataset for people in a specific pose. To this end, we develop three new pose descriptors and compare their classification and retrieval performance to two baselines built on state-of-the-art object detection models.", "paper_title": "2D Articulated Human Pose Estimation and Retrieval in (Almost) Unconstrained Still Images", "paper_id": "WOS:000304143700004"}