{"auto_keywords": [{"score": 0.03994784058602533, "phrase": "real_robot"}, {"score": 0.00481495049065317, "phrase": "artificial_emotions"}, {"score": 0.004526503177267299, "phrase": "affective_states"}, {"score": 0.004388796812234033, "phrase": "robot's_behavior"}, {"score": 0.003534889186471058, "phrase": "adaptive_mechanism"}, {"score": 0.0034941337957136013, "phrase": "dangerous_situations"}, {"score": 0.003284550970221379, "phrase": "specific_circumstances"}, {"score": 0.0030994630902300133, "phrase": "novel_mechanism"}, {"score": 0.0030401074516310184, "phrase": "harmful_circumstances"}, {"score": 0.0028798723050615788, "phrase": "fear_emotion"}, {"score": 0.00282470997972535, "phrase": "fear_releasers"}, {"score": 0.002665465323614577, "phrase": "robot's_performance"}, {"score": 0.0025249264547573943, "phrase": "robot's_behaviors"}, {"score": 0.002265638487492082, "phrase": "real_interactions"}, {"score": 0.0022394839933089074, "phrase": "real_world"}], "paper_keywords": ["Autonomy", " decision making", " emotions", " fear", " social robot"], "paper_abstract": "Currently artificial emotions are being extensively used in robots. Most of these implementations are employed to display affective states. Nevertheless, their use to drive the robot's behavior is not so common. This is the approach followed by the authors in this work. In this research, emotions are not treated in general but individually. Several emotions have been implemented in a real robot, but in this paper, authors focus on the use of the emotion of fear as an adaptive mechanism to avoid dangerous situations. In fact, fear is used as a motivation which guides the behavior during specific circumstances. Appraisal of fear is one of the cornerstones of this work. A novel mechanism learns to identify the harmful circumstances which cause damage to the robot. Hence, these circumstances elicit the fear emotion and are known as fear releasers. In order to prove the advantages of considering fear in our decision making system, the robot's performance with and without fear are compared and the behaviors are analyzed. The robot's behaviors exhibited in relation to fear are natural, i.e., the same kind of behaviors can be observed on animals. Moreover, they have not been preprogrammed, but learned by real interactions in the real world. All these ideas have been implemented in a real robot living in a laboratory and interacting with several items and people.", "paper_title": "An Autonomous Social Robot in Fear", "paper_id": "WOS:000320580500003"}