{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "closed_queueing_networks"}, {"score": 0.04624924834040988, "phrase": "product-form_solution"}, {"score": 0.04091440428687387, "phrase": "approximation_methods"}, {"score": 0.035402635348785544, "phrase": "higher-order_distributional_properties"}, {"score": 0.0044800522651664695, "phrase": "memoryless_negative_exponential_distribution"}, {"score": 0.00404306734103577, "phrase": "non-exponential_servers"}, {"score": 0.00399844587412988, "phrase": "known_general_exact_solution"}, {"score": 0.0038354405231002323, "phrase": "general_service_time"}, {"score": 0.0036995343538355234, "phrase": "semi-numerical_methods"}, {"score": 0.003519242552610694, "phrase": "service_time"}, {"score": 0.003490056936165004, "phrase": "single_node"}, {"score": 0.003319939715683536, "phrase": "important_effect"}, {"score": 0.0031933617014256676, "phrase": "resource_utilization_level"}, {"score": 0.003166870075748103, "phrase": "closed_network"}, {"score": 0.002962674479070391, "phrase": "resulting_quality"}, {"score": 0.002913710827597771, "phrase": "well-known_arrival_theorem"}, {"score": 0.002873524721802591, "phrase": "product-form_networks"}, {"score": 0.002763919794139171, "phrase": "reasonable_degree"}, {"score": 0.002549965625377498, "phrase": "single_non-exponential_server"}, {"score": 0.002445865715873089, "phrase": "higher-order_properties"}, {"score": 0.0024255601098027227, "phrase": "service_time_distribution"}, {"score": 0.0023460055901856247, "phrase": "mean_numbers"}, {"score": 0.0021885300925245516, "phrase": "virtually_all_traditional_approximate_solutions"}, {"score": 0.002152332983488664, "phrase": "first_two_moments"}, {"score": 0.002140400526572388, "phrase": "service_time_distributions"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Closed queueing networks", " Non-exponential service time", " High variability", " Higher-order moments", " Arrival Theorem", " Approximation methods"], "paper_abstract": "In many real-life computer and networking applications, the distributions of service times, or times between arrivals of requests, or both, can deviate significantly from the memoryless negative exponential distribution that underpins the product-form solution for queueing networks. Frequently, the coefficient of variation of the distributions encountered is well in excess of one, which would be its value for the exponential. For closed queueing networks with non-exponential servers there is no known general exact solution, and most, if not all, approximation methods attempt to account for the general service time distributions through their first two moments. We consider two simple closed queueing networks which we solve exactly using semi-numerical methods. These networks depart from the structure leading to a product-form solution only to the extent that the service time at a single node is non-exponential. We show that not only the coefficients of variation but also higher-order distributional properties can have an important effect on such customary steady-state performance measures as the mean number of customers at a resource or the resource utilization level in a closed network. Additionally, we examine the state that a request finds upon its arrival at a server, which is directly tied to the resulting quality of service. Although the well-known Arrival Theorem holds exactly only for product-form networks of queues, some approximation methods assume that it can be applied to a reasonable degree also in other closed queueing networks. We investigate the validity of this assumption in the two closed queueing models considered. Our results show that, even in the case when there is a single non-exponential server in the network, the state found upon arrival may be highly sensitive to higher-order properties of the service time distribution, beyond its mean and coefficient of variation. This dependence of mean numbers of customers at a server on higher-order distributional properties is in stark contrast with the situation in the familiar open M/G/1 queue. Thus, our results put into question virtually all traditional approximate solutions. which concentrate on the first two moments of service time distributions. (C) 2009 Elsevier B.V. All rights reserved.", "paper_title": "Higher-order distributional properties in closed queueing networks", "paper_id": "WOS:000269294800002"}