{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "fuzzy_number-valued_fuzzy_measures"}, {"score": 0.014304416139631007, "phrase": "attribute_importance"}, {"score": 0.01021788005837022, "phrase": "triangular_fuzzy_numbers"}, {"score": 0.010110804516282608, "phrase": "trapezoidal_fuzzy_numbers"}, {"score": 0.009642547884394385, "phrase": "fuzzy_numbers"}, {"score": 0.008909384362208927, "phrase": "distance_measures"}, {"score": 0.008496290932156838, "phrase": "euclidean_distance"}, {"score": 0.0038748022659578865, "phrase": "subjective_scales"}, {"score": 0.003597625122515975, "phrase": "subjective_importance"}, {"score": 0.003559675269411366, "phrase": "evaluation_items"}, {"score": 0.003522124318486352, "phrase": "numerous_studies"}, {"score": 0.0028944757265206332, "phrase": "best_effects"}, {"score": 0.0028487656293168795, "phrase": "empirical_study"}, {"score": 0.002548331088496964, "phrase": "tran_and_duckstein's_distances"}, {"score": 0.0024423826953133844, "phrase": "different_types"}], "paper_keywords": ["attribute importance", " fuzzy number-valued fuzzy measure", " triangular fuzzy number", " trapezoidal fuzzy number", " distance measure"], "paper_abstract": "The weight is one of the most useful tools to measure the attribute importance when individuals make a decision or evaluate the alternatives. Among the methods which measure the weight, fuzzy measures is are subjective scales for the degrees of fuzziness and widely used to determine the degrees of subjective importance of evaluation items in numerous studies for the time being. The purpose of this study is to use fuzzy number-valued fuzzy measures to determine the attribute importance. Several types of triangular fuzzy numbers and trapezoidal fuzzy numbers were applied in order to observe which type of fuzzy numbers had the best effects in the empirical study. In addition, we took advantage of distance measures to adjust the distance between attribute importance such as Euclidean distance, and Tran and Duckstein's distances. The results indicate that since using different types of fuzzy numbers and distance measures in fuzzy number-valued fuzzy measures have the similar performance, we suggest that triangular fuzzy numbers are better than trapezoidal fuzzy numbers, and Euclidean distance is preferred on account of their simple form to calculate.", "paper_title": "Importance-assessing method with fuzzy number-valued fuzzy measures and discussions on TFNs and TrFNs", "paper_id": "WOS:000257848100003"}