{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "media-use_habits"}, {"score": 0.004608284537368354, "phrase": "greater_london_area"}, {"score": 0.004159763048814385, "phrase": "home_environment"}, {"score": 0.004039792863335641, "phrase": "particular_emphasis"}, {"score": 0.0036731870109004993, "phrase": "rapid_prototype"}, {"score": 0.0035934073774126856, "phrase": "experimental_home_media_device"}, {"score": 0.0032433414042726356, "phrase": "key_findings"}, {"score": 0.002992313172550772, "phrase": "payment_system"}, {"score": 0.0028014064098604093, "phrase": "household_members"}, {"score": 0.002680932410366204, "phrase": "payg_concept"}, {"score": 0.002584494385587982, "phrase": "study_participants"}, {"score": 0.002473325513637559, "phrase": "unauthorised_spending"}, {"score": 0.002136087390959268, "phrase": "media_use"}, {"score": 0.0021049977753042253, "phrase": "younger_household_members"}], "paper_keywords": ["Interactive television", " User studies", " Trust", " Privacy", " Security", " User-centric media", " Media use in the home"], "paper_abstract": "This paper explores the use of a pay-as-you-go (PAYG) concept as a means of addressing issues of trust, privacy, billing and security around media in the home. The findings are based on a study conducted in 2007 and 2008, looking at the media-use habits of 27 families in the Greater London area. The study investigated attitudes towards uses of various forms of media within the home environment, with a particular emphasis on television (TV). To facilitate the study, a rapid prototype of an experimental home media device was produced, asking participants to use and respond to it. The key findings show the desirability of devices and services that incorporate a payment system which would help in regulating spending and allow household members to manage their own media purchases. The PAYG concept was well received by study participants as a means to prevent unauthorised spending and help manage costs. Participants were also enthusiastic about more transparent billing mechanisms and the possibility of monitoring the TV and media use of younger household members.", "paper_title": "Investigating pay-as-you-go to address issues of trust, privacy and security around media use at home", "paper_id": "WOS:000319434800007"}