{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "automated_markup"}, {"score": 0.012536140632129844, "phrase": "emotional_features"}, {"score": 0.00976627063830257, "phrase": "emotional_categories"}, {"score": 0.004742179945772899, "phrase": "emotional_labels"}, {"score": 0.004198082549566806, "phrase": "essential_aspects"}, {"score": 0.003995226376780718, "phrase": "example_texts"}, {"score": 0.003934795713147731, "phrase": "human_evaluators"}, {"score": 0.0038605361756636667, "phrase": "initial_assignment"}, {"score": 0.003687960013746783, "phrase": "emotional_words"}, {"score": 0.0035908627899097407, "phrase": "useful_resource"}, {"score": 0.00356359155432419, "phrase": "later_automated_markup"}, {"score": 0.003352722512047951, "phrase": "feature_extraction"}, {"score": 0.003264422557779248, "phrase": "lew_resource"}, {"score": 0.0032272929113113203, "phrase": "anew_word_list"}, {"score": 0.003190584226787897, "phrase": "actual_assignment"}, {"score": 0.0031303471231413785, "phrase": "wordnet"}, {"score": 0.003106541164572609, "phrase": "knowledge-based_expansion"}, {"score": 0.002626546539786707, "phrase": "proposed_algorithm"}, {"score": 0.0024615764782448214, "phrase": "average_percentage"}, {"score": 0.002360381056508366, "phrase": "emotional_dimensions"}, {"score": 0.0022375675189464715, "phrase": "main_contribution"}, {"score": 0.0021049977753042253, "phrase": "different_levels"}], "paper_keywords": ["emotional markup", " emotional dimensions", " emotional categories"], "paper_abstract": "This paper presents an approach to the automated markup of texts with emotional labels. The approach considers two possible representations of emotions in parallel: emotional categories (emotional tags used to refer to emotions) and emotional dimensions (measures that try to model the essential aspects of emotions numerically). For each representation, a corpus of example texts previously annotated by human evaluators is mined for an initial assignment of emotional features to words. This results in a list of emotional words (LEW) which becomes a useful resource for later automated markup. The algorithm proposed for the automated markup of text closely mirrors the steps taken during feature extraction, employing a combination of the LEW resource and the ANEW word list for the actual assignment of emotional features, and WordNet for knowledge-based expansion of words not occurring in either and an ontology of emotional categories. The algorithm for automated markup is tested and the results are discussed with respect to three main issues: the relative adequacy of each of the representations used, correctness and coverage of the proposed algorithm, and additional techniques and solutions that may be employed to improve the results. The average percentage of success obtained by our approach when it marks up with emotional dimensions is around 80% and when it marks up with emotional categories is around 50%. The main contribution of the approach presented in this paper is that it allows dimensions and categories at different levels of abstraction to operate simultaneously during markup.", "paper_title": "EMOTAG: AN APPROACH TO AUTOMATED MARKUP OF EMOTIONS IN TEXTS", "paper_id": "WOS:000326732400005"}