{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "large-scale_dimensional_metrology"}, {"score": 0.04861597690075273, "phrase": "dimensional_measurements"}, {"score": 0.0045959609346817535, "phrase": "important_part"}, {"score": 0.004542780650208743, "phrase": "production_cycle"}, {"score": 0.004438250823243621, "phrase": "product_compliance"}, {"score": 0.004219912413995784, "phrase": "large-scale_dimensional_measurements"}, {"score": 0.004138813595009761, "phrase": "measurement_dimensions"}, {"score": 0.004012271808564447, "phrase": "high_accuracies"}, {"score": 0.003800026771283179, "phrase": "different_technologies"}, {"score": 0.003141498438356646, "phrase": "new_possible_approach"}, {"score": 0.0030810605918297584, "phrase": "wireless_sensor_networks"}, {"score": 0.002850682396853918, "phrase": "recent_prototype_system"}, {"score": 0.0025967927629150715, "phrase": "large-size_objects"}, {"score": 0.0024025371556472557, "phrase": "wireless_network"}, {"score": 0.00238392747425758, "phrase": "optical_devices"}, {"score": 0.002231441081806766, "phrase": "different_working_environments"}, {"score": 0.0022141537427057363, "phrase": "preliminary_results"}, {"score": 0.0021970000365512227, "phrase": "experimental_tests"}, {"score": 0.002154693685426657, "phrase": "system_performance"}, {"score": 0.0021214346747442363, "phrase": "research_perspectives"}], "paper_keywords": ["dimensional metrology", " large-scale metrology", " large-volume metrology", " coordinate-measuring systems", " mobile measuring system", " wireless sensor networks"], "paper_abstract": "In many branches of industry, dimensional measurements have become an important part of the production cycle, in order to check product compliance with specifications. This task is not trivial especially when dealing with large-scale dimensional measurements: the bigger the measurement dimensions are, the harder is to achieve high accuracies. Nowadays, the problem can be handled using many metrological systems, based on different technologies (e.g. optical, mechanical, electromagnetic). Each of these systems is more or less adequate, depending upon measuring conditions, user's experience and skill, or other factors such as time, cost, accuracy and portability. This article focuses on a new possible approach to large-scale dimensional metrology based on wireless sensor networks. Advantages and drawbacks of such approach are analysed and deeply discussed. Then, the article briefly presents a recent prototype system - the Mobile Spatial Coordinate-Measuring System (MScMS-II) - which has been developed at the Industrial Metrology and Quality Laboratory of DISPEA - Politecnico di Torino. The system seems to be suitable for performing dimensional measurements of large-size objects (sizes on the order of several meters). Owing to its distributed nature, the system - based on a wireless network of optical devices - is portable, fully scalable with respect to dimensions and shapes and easily adaptable to different working environments. Preliminary results of experimental tests, aimed at evaluating system performance as well as research perspectives for further improvements, are discussed.", "paper_title": "A wireless sensor network-based approach to large-scale dimensional metrology", "paper_id": "WOS:000284634500003"}