{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "continuous_network_design_problem"}, {"score": 0.02823236641966412, "phrase": "en-route_information"}, {"score": 0.004306795240631196, "phrase": "uncertain_network_states"}, {"score": 0.004135562737140424, "phrase": "en-route_routing_decisions"}, {"score": 0.00395101799538683, "phrase": "long-term_planning_decisions"}, {"score": 0.0036614948691735105, "phrase": "bi-level_mathematical_programming_network_design_formulation"}, {"score": 0.0036245239349157236, "phrase": "cndp."}, {"score": 0.0031125795874844438, "phrase": "evaluation_function"}, {"score": 0.0030500051941781034, "phrase": "user_behavior"}, {"score": 0.003019189898170698, "phrase": "information_provision"}, {"score": 0.002988685006809336, "phrase": "numerical_tests"}, {"score": 0.0028990018343924683, "phrase": "quantum-inspired_genetic_algorithms"}, {"score": 0.0028551716387011637, "phrase": "generic_genetic_algorithms"}, {"score": 0.0027554538693034163, "phrase": "network_design_decisions"}, {"score": 0.002414544068560716, "phrase": "significant_implications"}, {"score": 0.0021049977753042253, "phrase": "en-route_information_provision"}], "paper_keywords": [""], "paper_abstract": "The focus of this article is to study the continuous network design problem (CNDP) that arises when users receive information about uncertain network states as they traverse the network and make en-route routing decisions. The primary motivation is to show that long-term planning decisions can change significantly when provision of information is considered. This article provides a bi-level mathematical programming network design formulation of CNDP. To efficiently solve this problem and gain the insights, we use two existing metaheuristics (a quantum-inspired genetic algorithm and a generic genetic algorithm) and replace the evaluation function to account for user behavior with information provision. Numerical tests conducted on two different networks reveal that quantum-inspired genetic algorithms marginally outperform generic genetic algorithms. The tests also reveal that network design decisions made when users have access to en-route information are considerably different from those made when users do not have access to such information. This result has significant implications because it shows that long-term planning decisions for networks in which users have access to en-route information are drastically different from those for networks without en-route information provision.", "paper_title": "User Equilibrium with Recourse: Continuous Network Design Problem", "paper_id": "WOS:000305962900003"}