{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "event_perception"}, {"score": 0.04534083835414357, "phrase": "navigation_history_design"}, {"score": 0.04255150516227644, "phrase": "mobile_interaction"}, {"score": 0.03745727104032737, "phrase": "content_objects"}, {"score": 0.004680473391946691, "phrase": "better_navigation_history_design"}, {"score": 0.0044435677598780796, "phrase": "interactive_activities"}, {"score": 0.004299064805926241, "phrase": "mobile_devices"}, {"score": 0.004238576355081601, "phrase": "event_segmentation_method"}, {"score": 0.0038564191670589884, "phrase": "deemed_representative"}, {"score": 0.0033624514778823763, "phrase": "content-centric_designs"}, {"score": 0.0031920445513574907, "phrase": "data_objects"}, {"score": 0.0028093921138602606, "phrase": "two-level_hierarchies"}, {"score": 0.0024146842687658467, "phrase": "sharing_or_querying_acts"}, {"score": 0.002259883463607508, "phrase": "mobile_interaction_events"}, {"score": 0.002196609505859369, "phrase": "relatively_low_interparticipant_consensus"}, {"score": 0.002145233716114996, "phrase": "navigation_history_designs"}, {"score": 0.0021049977753042253, "phrase": "large_individual_differences"}], "paper_keywords": [""], "paper_abstract": "This article explores how people perceive interactive activities in order to inform navigation history design on mobile devices. Following event segmentation method, 12 participants were asked to break 6 episodes of mobile interaction into segments, organize the segments, and identify those deemed representative. Three findings emerged. First, when making sense of mobile interaction, users concentrate on the content objects on which actions are performed. This indicates the value of content-centric designs in navigation history and other mobile user interface designs. The content objects are data objects and their collections meaningful to the person dealing with it, for example, photos, messages, or albums. Second, users tend to employ two-level hierarchies in grouping segments, and use the similarity in content objects and applications as a reference. They deem the segments as representative where objects are created or changed, or where sharing or querying acts take place. These findings indicate how a navigation history design should organize and prioritize mobile interaction events. Finally, event perception shows relatively low interparticipant consensus, which indicates that navigation history designs have to accommodate large individual differences.", "paper_title": "Event Perception in Mobile Interaction: Toward Better Navigation History Design on Mobile Devices", "paper_id": "WOS:000289249800001"}