{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "contextual_suggestion"}, {"score": 0.004769958800452922, "phrase": "increasing_use"}, {"score": 0.004740197030914445, "phrase": "mobile_devices"}, {"score": 0.004383406949799696, "phrase": "user_preference_history"}, {"score": 0.004288386935585756, "phrase": "better_understanding"}, {"score": 0.004261617028111862, "phrase": "users'_information"}, {"score": 0.004130243047687995, "phrase": "improved_user_satisfaction"}, {"score": 0.003940706575253453, "phrase": "user_profiling"}, {"score": 0.0037246656582642272, "phrase": "ir_system"}, {"score": 0.003689823995992878, "phrase": "accurate_user_profiles"}, {"score": 0.003553674679835236, "phrase": "location-based_contextual_suggestion"}, {"score": 0.0035094132888607134, "phrase": "leverage_users'_opinions"}, {"score": 0.0029077697480480013, "phrase": "new_candidate_suggestion"}, {"score": 0.0027828888187069636, "phrase": "similar_reasons"}, {"score": 0.0027395968397212053, "phrase": "opinion-based_user_profile"}, {"score": 0.0025892330566358503, "phrase": "target_user"}, {"score": 0.0025730425700096365, "phrase": "candidate_suggestions"}, {"score": 0.0024547897375637308, "phrase": "user_profiles"}, {"score": 0.0023939545398857518, "phrase": "novel_summary_generation_method"}, {"score": 0.0023641033150042195, "phrase": "opinion-based_user_profiles"}, {"score": 0.002341958851390876, "phrase": "personalized_and_high-quality_summaries"}, {"score": 0.0022554386642774926, "phrase": "yelp"}, {"score": 0.0022273034991008326, "phrase": "extensive_experiment_comparisons"}, {"score": 0.0021995257343837547, "phrase": "proposed_opinion-based_user_modeling"}, {"score": 0.0021789194955896102, "phrase": "existing_description-based_methods"}, {"score": 0.0021049977753042253, "phrase": "proposed_methods"}], "paper_keywords": ["Contextual suggestions", " Opinions", " User modeling", " Recommendation"], "paper_abstract": "The increasing use of mobile devices enables an information retrieval (IR) system to capitalize on various types of contexts (e.g., temporal and geographical information) about its users. Combined with the user preference history recorded in the system, a better understanding of users' information need can be achieved and it thus leads to improved user satisfaction. More importantly, such a system could proactively recommend suggestions based on the contexts. User profiling is essential in contextual suggestion. However, given most users' observed behaviors are sparse and their preferences are latent in an IR system, constructing accurate user profiles is generally difficult. In this paper, we focus on location-based contextual suggestion and propose to leverage users' opinions to construct the profiles. Instead of simply recording \"what places a user likes or dislikes\" in the past (i.e., description-based profile), we want to construct a profile to identify \"why a user likes or dislikes a place\" so as to better predict whether the user would like a new candidate suggestion of place. By assuming users would like or dislike a place with similar reasons, we construct the opinion-based user profile in a collaborative way: opinions from the other users are leveraged to estimate a profile for the target user. Candidate suggestions are represented in the same fashion and ranked based on their similarities with respect to the user profiles. Moreover, we also develop a novel summary generation method that utilizes the opinion-based user profiles to generate personalized and high-quality summaries for the suggestions. Experiments are conducted over three standard TREC contextual suggestion collections and a Yelp data set. Extensive experiment comparisons confirm that the proposed opinion-based user modeling outperforms the existing description-based methods. In particular, the systems developed based on the proposed methods have been ranked as top 1 in both TREC 2013 and 2014 contextual suggestion tracks.", "paper_title": "Opinions matter: a general approach to user profile modeling for contextual suggestion", "paper_id": "WOS:000365876500005"}