{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "phylogenetic_analyses"}, {"score": 0.022375581402067947, "phrase": "missing_data"}, {"score": 0.004685855684376706, "phrase": "deleterious_effects"}, {"score": 0.004203030435498069, "phrase": "taxa_lacking_data"}, {"score": 0.0034180189629740426, "phrase": "recent_simulations"}, {"score": 0.003362660648932247, "phrase": "highly_incomplete_taxa"}, {"score": 0.0030157628075954588, "phrase": "incomplete_taxa"}, {"score": 0.002855934865505357, "phrase": "misleading_long_branches"}, {"score": 0.0026033756286033285, "phrase": "long-branch_attraction"}, {"score": 0.0022472527731744974, "phrase": "large_phylogenies"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["accuracy", " Bayesian analysis", " maximum likelihood", " missing data", " neighbor-joining", " parsimony", " Phylogeny", " phylogenetic method", " systematics"], "paper_abstract": "Concerns about the deleterious effects of missing data may often determine which characters and taxa are included in phylogenetic analyses. For example, researchers may exclude taxa lacking data for some genes or exclude a gene lacking data in some taxa. Yet, there may be very little evidence to support these decisions. In this paper, I review the effects of missing data on phylogenetic analyses. Recent simulations suggest that highly incomplete taxa can be accurately placed in phylogenies, as long as many characters have been sampled overall. Furthermore, adding incomplete taxa can dramatically improve results in some cases by subdividing misleading long branches. Adding characters with missing data can also improve accuracy, although there is a risk of long-branch attraction in some cases. Consideration of how missing data does (or does not) affect phylogenetic analyses may allow researchers to design studies that can reconstruct large phylogenies quickly, economically, and accurately. (c) 2005 Elsevier Inc. All rights reserved.", "paper_title": "Missing data and the design of phylogenetic analyses", "paper_id": "WOS:000235495900005"}