{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "wireless_sensor_networks"}, {"score": 0.02265653640244771, "phrase": "secure_data_aggregation"}, {"score": 0.008414620783429425, "phrase": "compromised_nodes"}, {"score": 0.007529441525448987, "phrase": "data-aggregation_operation"}, {"score": 0.0072676632527591935, "phrase": "reputation_system"}, {"score": 0.004177724522109952, "phrase": "untrusted_and_hostile_environments"}, {"score": 0.0038520615699124123, "phrase": "transmitted_data"}, {"score": 0.0037555742428544096, "phrase": "erroneous_data"}, {"score": 0.003587924960158317, "phrase": "impersonate_legal_nodes"}, {"score": 0.0035337158050484474, "phrase": "routing_paths"}, {"score": 0.003462704420080129, "phrase": "data_transmission"}, {"score": 0.002713788077665689, "phrase": "residual_energy"}, {"score": 0.0026863605504566924, "phrase": "link_availability"}, {"score": 0.002632332114727894, "phrase": "recovery_mechanism"}, {"score": 0.0023301793939902015, "phrase": "irteda_protocol"}, {"score": 0.0021049977753042253, "phrase": "routing_path"}], "paper_keywords": [""], "paper_abstract": "In wireless sensor networks, secure data aggregation is very important for reducing the quantity of data transmitted and prolonging the lifetime of wireless sensor networks. When wireless sensor networks are deployed in untrusted and hostile environments, their nodes are often compromised, which reduces the security and reliability of the transmitted data. Compromised nodes can inject erroneous data, selectively forward data to an adversary, impersonate legal nodes to join routing paths, and disrupt data transmission during the data-aggregation operation. Previous researchers have relied on reputation system to find compromised nodes and prevent attacks during the data-aggregation operation. In this paper, we propose an improved reliable, trust-based, and energy-efficient data-aggregation protocol for wireless sensor networks. We call the protocol the iRTEDA protocol, and it combines the reputation system, residual energy, link availability, and a recovery mechanism to improve secure data aggregation and ensure that the network is secure, reliable, and energy-efficient. Simulations have shown that the iRTEDA protocol exceeds the performances of other protocols from the perspectives of the accuracy of the data, the reliability of the routing path, the consumption of energy, and the lifetime of secure data aggregation.", "paper_title": "Improved Reliable Trust-Based and Energy-Efficient Data Aggregation for Wireless Sensor Networks", "paper_id": "WOS:000320246900001"}