{"auto_keywords": [{"score": 0.031388704174305886, "phrase": "nbs"}, {"score": 0.00481495049065317, "phrase": "interference_channel"}, {"score": 0.004420472010542188, "phrase": "gaussian_interference_channel"}, {"score": 0.004357927940322685, "phrase": "usual_information_theoretic_approach"}, {"score": 0.004175533280178052, "phrase": "rate_selection"}, {"score": 0.0034526191487098093, "phrase": "simple_han-kobayashi_type_scheme"}, {"score": 0.0030656196752517836, "phrase": "associated_bargaining_problem"}, {"score": 0.0029935730127943496, "phrase": "nash_bargaining_solution"}, {"score": 0.0028409576481842457, "phrase": "fair_information_rates"}, {"score": 0.0028006988338192375, "phrase": "operating_point"}, {"score": 0.002696101728474703, "phrase": "optimization_problem"}, {"score": 0.002632716358833918, "phrase": "dynamic_alternating-offer_bargaining_game"}, {"score": 0.002570817338292482, "phrase": "bargaining_theory"}, {"score": 0.0024984517279573906, "phrase": "bargaining_process"}, {"score": 0.002304263635960015, "phrase": "equilibrium_outcome"}, {"score": 0.0022715932501623133, "phrase": "aobg"}, {"score": 0.0021763278640166707, "phrase": "bargaining_outcome"}], "paper_keywords": ["Bargaining", " coordination", " Gaussian interference channel", " selfish user"], "paper_abstract": "This work considers coordination and bargaining between two selfish users over a Gaussian interference channel. The usual information theoretic approach assumes full cooperation among users for codebook and rate selection. In the scenario investigated here, each user is willing to coordinate its actions only when an incentive exists and benefits of cooperation are fairly allocated. The users are first allowed to negotiate for the use of a simple Han-Kobayashi type scheme with fixed power split. Conditions for which users have incentives to cooperate are identified. Then, two different approaches are used to solve the associated bargaining problem. First, the Nash Bargaining Solution (NBS) is used as a tool to get fair information rates and the operating point is obtained as a result of an optimization problem. Next, a dynamic alternating-offer bargaining game (AOBG) from bargaining theory is introduced to model the bargaining process and the rates resulting from negotiation are characterized. The relationship between the NBS and the equilibrium outcome of the AOBG is studied and factors that may affect the bargaining outcome are discussed. Finally, under certain high signal-to-noise ratio regimes, the bargaining problem for the generalized degrees of freedom is studied.", "paper_title": "A Game-Theoretic View of the Interference Channel: Impact of Coordination and Bargaining", "paper_id": "WOS:000289836300016"}