{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "chemical_graphs"}, {"score": 0.004567129988306349, "phrase": "chemical_graph_complexity"}, {"score": 0.004416079619543104, "phrase": "main_ones"}, {"score": 0.004208881856146758, "phrase": "molecular_descriptors"}, {"score": 0.003953932197201054, "phrase": "topological_index"}, {"score": 0.0037864980290391354, "phrase": "bond_multiplicity"}, {"score": 0.0035570425396761122, "phrase": "significant_measure"}, {"score": 0.0035229930971258316, "phrase": "graph_size"}, {"score": 0.002850875630787708, "phrase": "constitutional_formulas"}, {"score": 0.0026142814606853037, "phrase": "index_g"}, {"score": 0.0025155150482635688, "phrase": "triplet_indices"}, {"score": 0.00247944491239733, "phrase": "totop"}, {"score": 0.0023972750359328235, "phrase": "molconn-z_program"}, {"score": 0.002329009499335603, "phrase": "possible_chemical_graphs"}, {"score": 0.002251813863195168, "phrase": "vertex_degrees"}], "paper_keywords": ["complexity", " graph size", " branching", " cyclicity", " centricity", " new topological indices"], "paper_abstract": "Chemical graph complexity depends on many factors, but the main ones are size, branching, and cyclicity. Some molecular descriptors embrace together all these three parameters, which cannot then be disentangled. The topological index J (and its refinements that include accounting for bond multiplicity and the presence of heteroatoms) was designed to compensate in a significant measure for graph size and cyclicity, and therefore it contains information mainly on branching. In order to separate these factors, two new indices (F and G) related with J are proposed, which allow to group together graphs with the same size into families of constitutional formulas differing in their branching and cyclicity. A comparison with other topological indices revealed that a few other topological indices vary similarly with index G, notably (DNS)-S-2(4) among the triplet indices, and TOTOP among the indices contained in the Molconn-Z program. This comparison involved all possible chemical graphs (i.e. connected planar graphs with vertex degrees not higher than four) with four through six vertices, and all possible alkanes with four through nine carbon atoms.", "paper_title": "Complexity of chemical graphs in terms of size, branching, and cyclicity", "paper_id": "WOS:000240953700005"}