{"auto_keywords": [{"score": 0.04860000689752456, "phrase": "web_sites"}, {"score": 0.007724851941242161, "phrase": "public_sector"}, {"score": 0.00481495049065317, "phrase": "web_site_information"}, {"score": 0.004789839974879249, "phrase": "spanish_city_councils"}, {"score": 0.004764859786310636, "phrase": "purpose_-_the_purpose"}, {"score": 0.004641890423057823, "phrase": "large_spanish_city_councils"}, {"score": 0.00439384176522315, "phrase": "observed_levels"}, {"score": 0.004370917733917604, "phrase": "information_disclosure"}, {"score": 0.004246947739596565, "phrase": "existing_literature"}, {"score": 0.003926359151817743, "phrase": "city_council_web_sites"}, {"score": 0.003895657248393214, "phrase": "disclosure_index"}, {"score": 0.003526855696396683, "phrase": "voluntary_disclosure"}, {"score": 0.003471892786096515, "phrase": "six_lineal_regressions_models"}, {"score": 0.0033999344623871735, "phrase": "empirical_evidence"}, {"score": 0.003373334961160647, "phrase": "low_disclosure_levels"}, {"score": 0.003355717283753749, "phrase": "spanish_city_council_web_sites"}, {"score": 0.0032689949867583633, "phrase": "city_councils"}, {"score": 0.003234934827553253, "phrase": "\"approved\"_level"}, {"score": 0.0031595872675010384, "phrase": "good_marks"}, {"score": 0.003118486096035156, "phrase": "disclosure_levels"}, {"score": 0.0030940816793713606, "phrase": "political_competition"}, {"score": 0.0030779179341450984, "phrase": "public_media_visibility"}, {"score": 0.0030378759123133644, "phrase": "technology_and_educational_levels"}, {"score": 0.0029131986574478072, "phrase": "local_spanish_authorities"}, {"score": 0.002860269306587213, "phrase": "ornamental_web_presence"}, {"score": 0.0027645030021576926, "phrase": "digital_society"}, {"score": 0.0027285271769284503, "phrase": "local_spanish_politicians"}, {"score": 0.002548844785958836, "phrase": "digital_information_transparency"}, {"score": 0.0024829226654624176, "phrase": "potent_channel"}, {"score": 0.0022653055209664284, "phrase": "new_network_society"}, {"score": 0.0022241213593294164, "phrase": "local_administration_web_sites"}, {"score": 0.0021894157986654546, "phrase": "digital_transparency"}, {"score": 0.002172266188075892, "phrase": "orients_politicians"}], "paper_keywords": ["information strategy", " worldwide web", " internet", " local authorities", " Spain"], "paper_abstract": "Purpose - The purpose of this research is to analyse the web sites of large Spanish city councils with the objective of assessing the extent of information disseminated on the internet and determining what factors are affecting the observed levels of information disclosure. Design/methodology/approach - The study takes as its reference point the existing literature on the examination of the quality of web sites, in particular the provisions of the Web Quality Model (WQM) and the importance of content as a key variable in determining web site quality. In order to quantify the information on city council web sites, a Disclosure Index has been designed which takes into account the content, navigability and presentation of the web sites. In order to contrast which variables determine the information provided on the web sites, our investigation bases itself on the studies about voluntary disclosure in the public sector, and six lineal regressions models have been performed. Findings - The empirical evidence obtained reveals low disclosure levels among Spanish city council web sites. In spite of this, almost 50 per cent of the city councils have reached the \"approved\" level and of these, around a quarter obtained good marks. Our results show that disclosure levels depend on political competition, public media visibility and the access to technology and educational levels of the citizens. Practical implications - The strategy of communication on the internet by local Spanish authorities is limited in general to an ornamental web presence but one that does not respond efficiently to the requirements of the digital society. During the coming years, local Spanish politicians will have to strive to take advantage of the opportunities that the internet offers to increase both the relational and informational capacity of municipal web sites as well as the digital information transparency of their public management. Originality/value - The internet is a potent channel of communication that is modifying the way in which people access and relate to information and each other. The public sector is not unaware of these changes and is incorporating itself gradually into the new network society. This study systematises; the analysis of local administration web sites, showing the lack of digital transparency, and orients politicians in the direction to follow in order to introduce improvements in their electronic relationships with the public.", "paper_title": "Determinants of web site information by Spanish city councils", "paper_id": "WOS:000254267500004"}