{"auto_keywords": [{"score": 0.03728086662042968, "phrase": "self-disciplinary_worms"}, {"score": 0.00481495049065317, "phrase": "worm_attacks"}, {"score": 0.004428139418750855, "phrase": "highest_possible_speed"}, {"score": 0.004354572391793908, "phrase": "newly_developed_worms"}, {"score": 0.003960101604693806, "phrase": "propagation_speed"}, {"score": 0.0036826452656927877, "phrase": "new_class"}, {"score": 0.0030794433253250476, "phrase": "existing_worm_detection_schemes"}, {"score": 0.0030282147475402736, "phrase": "traffic_volume"}, {"score": 0.002815864555488112, "phrase": "proper_countermeasures"}, {"score": 0.0027382040767844093, "phrase": "game-theoretic_formulation"}, {"score": 0.0026330549554033876, "phrase": "worm_propagator"}, {"score": 0.0025037596405075866, "phrase": "effective_integration"}, {"score": 0.002475898613632249, "phrase": "multiple_countermeasure_schemes"}, {"score": 0.0022137465420508785, "phrase": "different_integrated_schemes"}, {"score": 0.002176887956041267, "phrase": "different_self-disciplinary_worms"}, {"score": 0.0021049977753042253, "phrase": "real-world_traffic_data"}], "paper_keywords": ["Worm", " game theory", " anomaly detection"], "paper_abstract": "In this paper, we address issues related to the modeling, analysis, and countermeasures of worm attacks on the Internet. Most previous work assumed that a worm always propagates itself at the highest possible speed. Some newly developed worms (e. g., \"Atak\" worm) contradict this assumption by deliberately reducing the propagation speed in order to avoid detection. As such, we study a new class of worms, referred to as self-disciplinary worms. These worms adapt their propagation patterns in order to reduce the probability of detection, and eventually, to infect more computers. We demonstrate that existing worm detection schemes based on traffic volume and variance cannot effectively defend against these self-disciplinary worms. To develop proper countermeasures, we introduce a game-theoretic formulation to model the interaction between the worm propagator and the defender. We show that an effective integration of multiple countermeasure schemes (e. g., worm detection and forensics analysis) is critical for defending against self-disciplinary worms. We propose different integrated schemes for fighting different self-disciplinary worms, and evaluate their performance via real-world traffic data.", "paper_title": "Self-Disciplinary Worms and Countermeasures: Modeling and Analysis", "paper_id": "WOS:000281030200009"}