{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "expert_judgement"}, {"score": 0.04791893615216392, "phrase": "cyber_security"}, {"score": 0.003986581218661184, "phrase": "different_experts"}, {"score": 0.003936698872193083, "phrase": "natural_and_state-of-the_art_approach"}, {"score": 0.003559387846675818, "phrase": "studied_event"}, {"score": 0.0035148319209810128, "phrase": "actual_observations"}, {"score": 0.003398714712611042, "phrase": "data_collection"}, {"score": 0.002575665611013556, "phrase": "different_domains"}, {"score": 0.0024081387633065206, "phrase": "reasonable_indicator"}, {"score": 0.002358050109031317, "phrase": "mean_pearson_correlation"}, {"score": 0.0022514836269627186, "phrase": "significant_correlations"}, {"score": 0.0021049977753042253, "phrase": "side_result"}], "paper_keywords": ["expert judgement", " decision support", " calibration", " cyber security"], "paper_abstract": "In situations when data collection through observations is difficult to perform, the use of expert judgement can be justified. A challenge with this approach is, however, to value the credibility of different experts. A natural and state-of-the art approach is to weight the experts' judgements according to their calibration, that is, on the basis of how well their estimates of a studied event agree with actual observations of that event. However, when data collection through observations is difficult to perform, it is often also difficult to estimate the calibration of experts. As a consequence, variables thought to indicate calibration are generally used as a substitute of it in practice. This study evaluates the value of three such indicative variables: consensus, experience and self-proclamation. The significances of these variables are analysed in four surveys covering different domains in cyber security, involving a total of 271 subjects. Results show that consensus is a reasonable indicator of calibration. The mean Pearson correlation between these two variables across the four studies was 0.407. No significant correlations were found between calibration and experience or calibration and self-proclamation. However, as a side result, it was discovered that a subject that perceives itself as more knowledgeable than others likely also is more experienced.", "paper_title": "Indicators of expert judgement and their significance: an empirical investigation in the area of cyber security", "paper_id": "WOS:000342812800001"}