{"auto_keywords": [{"score": 0.048469491584319055, "phrase": "graphical_representations"}, {"score": 0.037878248909328095, "phrase": "uml_diagrams"}, {"score": 0.024708429832124304, "phrase": "graph_grammar"}, {"score": 0.00481495049065317, "phrase": "uml_package_diagrams"}, {"score": 0.004706453355638515, "phrase": "attribute_graph_grammar"}, {"score": 0.004522406417999492, "phrase": "software_design"}, {"score": 0.003989351600022163, "phrase": "software_development"}, {"score": 0.0032302647179383915, "phrase": "uml_tool"}, {"score": 0.003193606324727067, "phrase": "diagram_layouts"}, {"score": 0.002898291237210567, "phrase": "layout_diagrams"}, {"score": 0.002784755056588371, "phrase": "unexpected_layouts"}, {"score": 0.0025416235470290286, "phrase": "program_diagrams"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Graph grammar", " UML", " Package diagram", " SVG"], "paper_abstract": "Graphical representations are often used in software design and development because of their expressiveness. So far, various graphical program description languages have been reported. The Unified Modeling Language (UML), developed for modeling in software development was proposed recently, and in 2005 was standardized as the ISO/IEC 19501 standard. Some tools for drawing UML diagrams have been proposed in recent years. However, it is hard for developers to draw UML diagrams using the UML tool because diagram layouts generally should be manually adjusted. Of course, there are tools that can automatically provide layout diagrams, though, sometimes such functions provide unexpected layouts. In order to automate the drawing of these graphical representations aesthetically, a syntax for program diagrams must first be defined. We propose a framework for specifying these diagrams using a graph grammar, and a syntax-directed editor based on the graph grammar. (C) 2014 Elsevier B.V. All rights reserved.", "paper_title": "Generation of UML package diagrams based on an attribute graph grammar", "paper_id": "WOS:000340332400008"}