{"auto_keywords": [{"score": 0.006424486582108551, "phrase": "manet"}, {"score": 0.00481495049065317, "phrase": "reactive_routing"}, {"score": 0.0042004472903194616, "phrase": "mobile_ad_hoc_network"}, {"score": 0.003965684670332574, "phrase": "underlying_reactive_routing"}, {"score": 0.0038950367927745267, "phrase": "redundant_links"}, {"score": 0.0035858673522839407, "phrase": "closest_peers"}, {"score": 0.0034220655476652683, "phrase": "minimum-spanning_tree"}, {"score": 0.003313053707792957, "phrase": "neighbor_peers"}, {"score": 0.003161674440750158, "phrase": "physical_network"}, {"score": 0.0031164983132321417, "phrase": "limited_radio_range"}, {"score": 0.0030171910207671205, "phrase": "physical_network_partition"}, {"score": 0.002797572252783356, "phrase": "cross-layer_approach"}, {"score": 0.0022950308685133224, "phrase": "physically_closer_peers"}, {"score": 0.0022379017425216917, "phrase": "merging_process"}, {"score": 0.0022218413146898887, "phrase": "redundant_traffic"}, {"score": 0.0021049977753042253, "phrase": "existing_approach"}], "paper_keywords": ["P2P", " MANET", " Client/Server system"], "paper_abstract": "In a traditional unstructured P2P file sharing network, each peer establishes connections with certain number of randoma chosen other peers to ensure the connectivity of the P2P overlay. This paper explains how this random overly leads to redundant traffic and P2P network partition in mobile ad hoc network (MANET). We propose an approach to construct an efficient unstructured P2P overlay over MANET using underlying reactive routing. Instead of having redundant links among the peers in the P2P network, we introduce a root-peer connecting all peers. Each peer maintains connection with closest peers such that it can reach the root-peer. A peer constructs a minimum-spanning tree consisting of itself, its directly connected neighbor peers and 2-hop away neighbor peers to indentify far away peers and builds the overlay closer to the physical network. Due to limited radio range and mobility of nodes in MANET, the physical network partition and merging can occur. This can also lead to the P2P network partition and merging. This paper also proposes a cross-layer approach to detect and merge P2P networks as soon as the P2P networks become physically connected. For this, we extend ODACP (an address auto-configuration protocol) to detect that P2P networks have connected in physical in order to start the merging of P2P networks. We propose an approach to merge P2P networks such that physically closer peers of the P2P networks participate in the merging process reducing redundant traffic. We can show by simulation that our approach performs better in comparison to the existing approach.", "paper_title": "An Efficient Unstructured P2P Overlay for File Sharing over MANETs Using Underlying Reactive Routing", "paper_id": "WOS:000291504300016"}