{"auto_keywords": [{"score": 0.03285425557766291, "phrase": "ltl_formula"}, {"score": 0.015625850277332636, "phrase": "ltl"}, {"score": 0.015162993085281724, "phrase": "execution_paths"}, {"score": 0.01507211227818624, "phrase": "dynamic_systems"}, {"score": 0.009883113365276383, "phrase": "new_language"}, {"score": 0.009331515703151636, "phrase": "finite_execution"}, {"score": 0.00481495049065317, "phrase": "linear_temporal_logic"}, {"score": 0.004476399615305783, "phrase": "nondeterministic_evolutions"}, {"score": 0.004342430078306461, "phrase": "ltl_formula_phi"}, {"score": 0.004123781267600542, "phrase": "universal_interpretation"}, {"score": 0.003775803846431323, "phrase": "execution_path"}, {"score": 0.0036074566790283633, "phrase": "nondeterministic_domains"}, {"score": 0.0031364320619313765, "phrase": "alternative_interpretations"}, {"score": 0.0030610130156108833, "phrase": "extreme_cases"}, {"score": 0.0029783256772952073, "phrase": "arbitrary_combination"}, {"score": 0.002534642970039115, "phrase": "path_quantifiers"}, {"score": 0.0023704627518949953, "phrase": "ea"}, {"score": 0.0023346241417152975, "phrase": "aea"}, {"score": 0.002320451057115884, "phrase": "eae"}, {"score": 0.0021900066569764862, "phrase": "planning_algorithm"}, {"score": 0.0021307975800397816, "phrase": "automata-theoretic_approach"}], "paper_keywords": [""], "paper_abstract": "Linear Temporal Logic (LTL) is widely used for defining conditions on the execution paths of dynamic systems. In the case of dynamic systems that allow for nondeterministic evolutions, one has to specify, along with an LTL formula phi, which are the paths that are required to satisfy the formula. Two extreme cases are the universal interpretation A.phi, which requires that the formula be satisfied for all execution paths, and the existential interpretation E.phi, which requires that the formula be satisfied for some execution path. When LTL is applied to the definition of goals in planning problems on nondeterministic domains, these two extreme cases are too restrictive. It is often impossible to develop plans that achieve the goal in all the nondeterministic evolutions of a system, and it is too weak to require that the goal is satisfied by some execution. In this paper we explore alternative interpretations of an LTL formula that are between these extreme cases. We define a new language that permits an arbitrary combination of the A and E quantifiers, thus allowing, for instance, to require that each finite execution can be extended to an execution satisfying an LTL formula (AE.phi), or that there is some finite execution whose extensions all satisfy an LTL formula (EA.phi). We show that only eight of these combinations of path quantifiers are relevant, corresponding to an alternation of the quantifiers of length one (A and E), two (AE and EA), three (AEA and EAE), and infinity ((AE)(omega) and (EA)(omega)). We also present a planning algorithm for the new language that is based on an automata-theoretic approach, and study its complexity.", "paper_title": "The planning spectrum - One, two, three, infinity", "paper_id": "WOS:000250051500001"}