{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "medical_errors"}, {"score": 0.008504426311521441, "phrase": "proposed_technique"}, {"score": 0.0047780945826930606, "phrase": "telemedicine"}, {"score": 0.004669180816745142, "phrase": "information_and_communication_technologies"}, {"score": 0.004475893575036647, "phrase": "massive_digitalisation"}, {"score": 0.004323690117778359, "phrase": "ordinary_people"}, {"score": 0.00427410962921379, "phrase": "medical_sectors"}, {"score": 0.004034572092608487, "phrase": "medical_professional"}, {"score": 0.003764713814123286, "phrase": "critical_conditions"}, {"score": 0.003735862292632131, "phrase": "remote_environment"}, {"score": 0.003046621804854539, "phrase": "proposed_work"}, {"score": 0.0028979065012624044, "phrase": "collaborative_medical_organisations"}, {"score": 0.0027670642397888494, "phrase": "dung's_argumentation_framework"}, {"score": 0.0026523079380037706, "phrase": "remote_medical_procedure"}, {"score": 0.0025521085778978042, "phrase": "graphical_reasoning"}, {"score": 0.002474674704809152, "phrase": "directed_graph"}, {"score": 0.0024368411484675823, "phrase": "extended_nodes"}, {"score": 0.002282380944889266, "phrase": "makeham's_and_tempos_taxonomies"}], "paper_keywords": ["Argumentation", " Knowledge tracing", " Taxonomy", " Teleexpertise", " Medical errors", " Legal procedure"], "paper_abstract": "Telemedicine consists of the use of information and communication technologies (ICTs) in the practice of medicine. The massive digitalisation of the society is changing the behaviour of ordinary people even in medical sectors. The impact of digitisation is also having impacts on teleexpertise, where a medical professional can remotely ask some advices through the use of ICTs to provide treatment to a patient in critical conditions in remote environment However, sometimes the outcome of such advice obtained remotely can lead to medical errors. In these situations, it is important to determine whether the causes of the errors could have been avoidable or not for the purposes of establishing the truth and assuring justice for the victims of medical errors. The proposed work fits this perspective with the objective to formalise elements of argumentation in collaborative medical organisations using telemedicine. In other words, a technique that extends the Dung's argumentation framework in order to bring out the errors committed following a remote medical procedure has been proposed. The proposed technique is underpinned by graphical reasoning. The reasoning is represented through a directed graph in which the extended nodes specify the arguments with their source(s) and the identification of errors is done according to the Makeham's and Tempos taxonomies. To illustrate the functioning of the proposed technique or solution, an example of the practice of teleexpertise (between two French hospitals) that leads to litigation is presented. (C) 2015 Elsevier Ltd. All rights reserved.", "paper_title": "Argumentative reasoning and taxonomic analysis for the identification of medical errors", "paper_id": "WOS:000365369100015"}