{"auto_keywords": [{"score": 0.0486744732916662, "phrase": "acculock"}, {"score": 0.007152368807539886, "phrase": "data_races"}, {"score": 0.006790047133366728, "phrase": "java_programs"}, {"score": 0.006602397642754907, "phrase": "fasttrack"}, {"score": 0.006374512406202309, "phrase": "race_detection"}, {"score": 0.00470862827326028, "phrase": "new_dynamic_data_race_detector"}, {"score": 0.004486212539464774, "phrase": "first_hybrid_detector"}, {"score": 0.004211069233133584, "phrase": "program_execution"}, {"score": 0.0035216195857272403, "phrase": "new_lockset_algorithm"}, {"score": 0.0034695189961509625, "phrase": "locking_discipline"}, {"score": 0.0033054391731615618, "phrase": "false_positives"}, {"score": 0.003280891942617853, "phrase": "pure_lockset_detectors"}, {"score": 0.0031490944606172152, "phrase": "design_objectives"}, {"score": 0.0031140747752837826, "phrase": "comparable_instrumentation_overheads"}, {"score": 0.0024346858809238766, "phrase": "large_benchmark_programs"}, {"score": 0.0023021895404322767, "phrase": "different_platform"}, {"score": 0.002285075675790214, "phrase": "roadrunner"}, {"score": 0.002234491924392104, "phrase": "similar_observations"}, {"score": 0.0021049977753042253, "phrase": "john_wiley"}], "paper_keywords": ["data races", " happens before", " lockset", " dynamic analysis"], "paper_abstract": "This paper introduces a new dynamic data race detector, ACCULOCK, to detect data races in Java programs. ACCULOCK is the first hybrid detector that combines lockset and epoch-based happens-before for race detection. ACCULOCK analyzes a program execution by reasoning about the subset of the happens-before relation observed with lock acquires and releases excluded, thereby making it less sensitive to thread interleaving than pure happens-before detectors. When this relaxed happens-before relation is violated, ACCULOCK applies a new lockset algorithm to verify the locking discipline by distinguishing reads and writes, thereby making it more immune to false positives than pure lockset detectors. In addition, ACCULOCK is designed to achieve these design objectives by maintaining comparable instrumentation overheads (in both time and space) to that of FASTTRACK, the fastest happens-before detector available (at least for Java programs). All these properties of ACCULOCK have been validated and confirmed by comparing it against FASTTRACK and five other (pure happens-before, pure lockset, or hybrid) detectors, which are implemented in the Jikes Research Virtual Machine using a collection of large benchmark programs from a variety of applications. Furthermore, porting ACCULOCK and FASTTRACK to a different platform, RoadRunner, and repeating our experiments yield similar observations in terms of their effectiveness in race detection and instrumentation overheads. Copyright (c) 2012 John Wiley & Sons, Ltd.", "paper_title": "ACCULOCK: accurate and efficient detection of data races", "paper_id": "WOS:000317690100004"}