{"auto_keywords": [{"score": 0.048231156244864744, "phrase": "ec"}, {"score": 0.021314886524599244, "phrase": "ec_management_techniques"}, {"score": 0.010612208038085942, "phrase": "excess_capacity"}, {"score": 0.009602313395214779, "phrase": "network_performance"}, {"score": 0.004710854091689325, "phrase": "wdm_mesh_networks"}, {"score": 0.004548939310612501, "phrase": "unused_capacity"}, {"score": 0.0041316803676012155, "phrase": "connection_preprovisioning_algorithm"}, {"score": 0.004024651422626329, "phrase": "connection_setup_time"}, {"score": 0.0038692638652494697, "phrase": "protection_schemes"}, {"score": 0.003818807671883534, "phrase": "higher_availability"}, {"score": 0.0037855348847339655, "phrase": "shorter_protection_switching_time"}, {"score": 0.0028731024405707277, "phrase": "lazy_techniques"}, {"score": 0.0027741761880779535, "phrase": "proactive_techniques"}, {"score": 0.002530359917257626, "phrase": "minimal_set"}, {"score": 0.002475532161577715, "phrase": "global_backup_reprovisioning"}, {"score": 0.0023694065215394593, "phrase": "integer_linear_program"}, {"score": 0.002348740451232834, "phrase": "ilp"}, {"score": 0.0023079225317714815, "phrase": "heuristic_algorithms"}, {"score": 0.002228412982799273, "phrase": "numerical_examples"}], "paper_keywords": ["Availability", " excess capacity (EC)", " protection", " reprovisioning", " robustness", " wavelength-division-multiplexing (WDM) network"], "paper_abstract": "Excess capacity (EC) is the unused capacity in a network. We propose EC management techniques to improve network performance. Our techniques exploit the EC in two ways. First, a connection preprovisioning algorithm is used to reduce the connection setup time. Second, whenever possible, we use protection schemes that have higher availability and shorter protection switching time. Specifically, depending on the amount of EC available in the network, our proposed EC management techniques dynamically migrate connections between high-availability, high-backup-capacity protection schemes and low-availability, low-backup-capacity protection schemes. Thus, multiple protection schemes can coexist in the network. The four EC management techniques studied in this paper differ in two respects: when the connections are migrated from one protection scheme to another, and which connections are migrated. Specifically, Lazy techniques migrate connections only when necessary, whereas Proactive techniques migrate connections to free up capacity in advance. Partial Backup Reprovisioning (PBR) techniques try to migrate a minimal set of connections, whereas Global Backup Reprovisioning (GBR) techniques migrate all connections. We develop integer linear program (ILP) formulations and heuristic algorithms for the EC management techniques. We then present numerical examples to illustrate how the EC management techniques improve network performance by exploiting the EC in wavelength-division-multiplexing (WDM) mesh networks.", "paper_title": "Exploiting Excess Capacity to Improve Robustness of WDM Mesh Networks", "paper_id": "WOS:000300425000009"}