{"auto_keywords": [{"score": 0.043551591265386116, "phrase": "gmpls"}, {"score": 0.00481495049065317, "phrase": "gmpls_unified_control_planes"}, {"score": 0.004561826854638056, "phrase": "effective_and_simple_unified_control_plane"}, {"score": 0.004512822575395108, "phrase": "ucp"}, {"score": 0.004392565073466714, "phrase": "multilayer_optical_networks"}, {"score": 0.00427550604912774, "phrase": "network_providers"}, {"score": 0.004229556887896042, "phrase": "generalized_multi-protocol_label"}, {"score": 0.00394264312173188, "phrase": "optical_transport_networks"}, {"score": 0.0037150687722055727, "phrase": "real_operational_products"}, {"score": 0.0025578967205807843, "phrase": "optical_networks"}, {"score": 0.0024896081630179194, "phrase": "openflow_extension"}, {"score": 0.002436289099444074, "phrase": "overall_feasibility"}, {"score": 0.002246292543825748, "phrase": "gmpls_approach"}, {"score": 0.002198173002125907, "phrase": "custom-built_simulator"}], "paper_keywords": ["GMPLS", " OpenFlow", " Optical Network", " Software Defined Networking", " Testbed"], "paper_abstract": "Finding an effective and simple unified control plane (UCP) for IP/dense wavelength division multiplexing multilayer optical networks is very important for network providers. Generalized multi-protocol label switching (GMPLS) has been in development for decades to control optical transport networks. However, it is extremely difficult to deploy in real operational products, as there is still much non-GMPLS-capable equipment. On the other hand, OpenFlow (OF), one of the most widely used software defined networking implementations, can be used as a UCP for packet and circuit switched networks [\"Packet and circuit network convergence with OpenFlow,\" in OFC/NFOEC, Mar. 2010]. In this paper, we propose and experimentally evaluate two solutions using OF to control both packet and optical networks (OpenFlowMessages Mapping and OpenFlow Extension). The overall feasibility of these solutions is assessed, and their performance is evaluated and compared with the GMPLS approach, using a custom-built simulator. Simulation results show that the OpenFlow Extension solution outperforms the OpenFlow Messages Mapping and GMPLS solutions.", "paper_title": "OpenFlow and GMPLS Unified Control Planes: Testbed Implementation and Comparative Study", "paper_id": "WOS:000353570100010"}