{"auto_keywords": [{"score": 0.04875424985601545, "phrase": "biometric_specimens"}, {"score": 0.009520854756407472, "phrase": "likelihood_ratio"}, {"score": 0.006123196820876601, "phrase": "training_scores"}, {"score": 0.00481495049065317, "phrase": "different_training_data"}, {"score": 0.004755279364266046, "phrase": "automatic_comparison"}, {"score": 0.004638136142210615, "phrase": "similarity_metric"}, {"score": 0.004509780213218666, "phrase": "employed_biometric_recognition_system"}, {"score": 0.004467785611058897, "phrase": "forensic_evaluation"}, {"score": 0.004055998173160551, "phrase": "prosecution_hypothesis"}, {"score": 0.003739931635717522, "phrase": "defence_hypothesis"}, {"score": 0.0032599633778910516, "phrase": "likelihood_ratio_value"}, {"score": 0.0031994574580544, "phrase": "likelihood_ratio_computation"}, {"score": 0.003072174266479278, "phrase": "specific_suspect"}, {"score": 0.0030435255729392204, "phrase": "forensic_case"}, {"score": 0.00294993976383467, "phrase": "-sources_comparisons"}, {"score": 0.0027198282355114646, "phrase": "slightly_different_interpretations"}, {"score": 0.00253916011199984, "phrase": "evidence_evaluation"}, {"score": 0.002468747242613056, "phrase": "speaker_recognition_system"}, {"score": 0.0024380811094377006, "phrase": "biometric_modality"}, {"score": 0.002415331146563814, "phrase": "simple_forensic_case"}, {"score": 0.0023630680726174627, "phrase": "small_subset"}, {"score": 0.0023264294945973623, "phrase": "large_database"}, {"score": 0.0021049977753042253, "phrase": "significant_variation"}], "paper_keywords": [""], "paper_abstract": "For an automatic comparison of a pair of biometric specimens, a similarity metric called 'score' is computed by the employed biometric recognition system. In forensic evaluation, it is desirable to convert this score into a likelihood ratio. This process is referred to as calibration. A likelihood ratio is the probability of the score given the prosecution hypothesis (which states that the pair of biometric specimens are originated from the suspect) is true divided by the probability of the score given the defence hypothesis (which states that the pair of biometric specimens are not originated from the suspect) is true. In practice, a set of scores (called training scores) obtained from the within-source and between-sources comparison is needed to compute a likelihood ratio value for a score. In likelihood ratio computation, the within-source and between-sources conditions can be anchored to a specific suspect in a forensic case or it can be generic within-source and between-sources comparisons independent of the suspect involved in the case. This results in two likelihood ratio values which differ in the nature of training scores they use and therefore consider slightly different interpretations of the two hypotheses. The goal of this study is to quantify the differences in these two likelihood ratio values in the context of evidence evaluation from a face, a fingerprint and a speaker recognition system. For each biometric modality, a simple forensic case is simulated by randomly selecting a small subset of biometric specimens from a large database. In order to be able to carry out a comparison across the three biometric modalities, the same protocol is followed for training scores set generation. It is observed that there is a significant variation in the two likelihood ratio values.", "paper_title": "Biometric evidence evaluation: an empirical assessment of the effect of different training data", "paper_id": "WOS:000346562800016"}