{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "common_lexicon"}, {"score": 0.044865360864570304, "phrase": "evolutionary_strategies"}, {"score": 0.015377842444873717, "phrase": "autonomous_agents"}, {"score": 0.009121716410995193, "phrase": "convergence_results"}, {"score": 0.0046570462031865385, "phrase": "multi-agent_systems"}, {"score": 0.004487635647709636, "phrase": "active_field"}, {"score": 0.003927004211021119, "phrase": "association_matrix"}, {"score": 0.003897989308486044, "phrase": "look-up_table"}, {"score": 0.00328654473734697, "phrase": "communication_efficiency"}, {"score": 0.0032501644753165555, "phrase": "entire_population"}, {"score": 0.003006499028632742, "phrase": "optimal_saussurean_communication_system"}, {"score": 0.0028121943702224326, "phrase": "population_size"}, {"score": 0.002630414143385786, "phrase": "lexicon_size"}, {"score": 0.0024603551979225195, "phrase": "population's_consensus"}, {"score": 0.002301265368019983, "phrase": "general_conclusion"}, {"score": 0.002242206465278159, "phrase": "powerful_enough_optimizers"}, {"score": 0.0021927897271015657, "phrase": "lexicon_consensus"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Multi-agent systems", " Evolution of artificial languages", " Computational semiotics", " Evolutionary strategies", " Self-collective coordination", " Evolutionary language games", " Signaling games"], "paper_abstract": "In multi-agent systems, the study of language and communication is an active field of research. In this paper we present the application of evolutionary strategies to the self-emergence of a common lexicon in a population of agents. By modeling the vocabulary or lexicon of each agent as an association matrix or look-up table that maps the meanings (i.e. the objects encountered by the agents or the states of the environment itself) into symbols or signals we check whether it is possible for the population to converge in an autonomous, decentralized way to a common lexicon, so that the communication efficiency of the entire population is optimal. We have conducted several experiments aimed at testing whether it is possible to converge with evolutionary strategies to an optimal Saussurean communication system. We have organized our experiments alongside two main lines: first, we have investigated the effect of the population size on the convergence results. Second, and foremost, we have also investigated the effect of the lexicon size on the convergence results. To analyze the convergence of the population of agents we have defined the population's consensus when all the agents (i.e. 100% of the population) share the same association matrix or lexicon. As a general conclusion we have shown that evolutionary strategies are powerful enough optimizers to guarantee the convergence to lexicon consensus in a population of autonomous agents. (C) 2011 Elsevier B.V. All rights reserved.", "paper_title": "Self-emergence of a common lexicon by evolution in teams of autonomous agents", "paper_id": "WOS:000297830900013"}