{"auto_keywords": [{"score": 0.048725000406690595, "phrase": "task_cohesion"}, {"score": 0.02819827616624647, "phrase": "collective_efficacy"}, {"score": 0.02788404199868206, "phrase": "cognitive_quality"}, {"score": 0.011629310205405915, "phrase": "cscl_environment"}, {"score": 0.0069715203916189995, "phrase": "group_processes"}, {"score": 0.0046253989970108985, "phrase": "computer-supported_collaborative_learning"}, {"score": 0.004392565073466714, "phrase": "cscl_environments"}, {"score": 0.003166259444961177, "phrase": "data_analysis"}, {"score": 0.002664749302333897, "phrase": "group_performance"}, {"score": 0.0024586427394152196, "phrase": "predictive_capability"}, {"score": 0.0024305268807926056, "phrase": "prior_performance"}, {"score": 0.0022296340517805125, "phrase": "subsequent_collective_efficacy"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Collaborative learning", " Learning strategies", " Computer-mediated communication", " Interactive learning environment"], "paper_abstract": "Research has suggested that CSCL environments contain fewer social context clues, resulting in various group processes, performance or motivation. This study thus attempts to explore the relationship among collective efficacy, group processes (i.e. task cohesion, cognitive quality) and collaborative performance in a CSCL environment. A total of 75 Taiwanese college students (divided into 25 groups) participated in the study. Both quantitative and qualitative methods were applied for data analysis. The results indicate that collective efficacy significantly predicted task cohesion but not cognitive quality in the CSCL environment. For the role of group processes in performance, both task cohesion and cognitive quality significantly predicted group performance, but cognitive quality predicted better than task cohesion. In addition, for the predictive capability of prior performance, task cohesion, and cognitive quality in collective efficacy, the results showed that only task cohesion predicted subsequent collective efficacy significantly in the CSCL environment. (C) 2011 Elsevier Ltd. All rights reserved.", "paper_title": "The role of collective efficacy, cognitive quality, and task cohesion in computer-supported collaborative learning (CSCL)", "paper_id": "WOS:000298523800001"}