{"auto_keywords": [{"score": 0.04534706079488547, "phrase": "deductive_systems"}, {"score": 0.03777992235222839, "phrase": "logic_component"}, {"score": 0.00481495049065317, "phrase": "interpolation_features"}, {"score": 0.004695900553353526, "phrase": "metalogical_constructor"}, {"score": 0.004612662942073808, "phrase": "different_logics"}, {"score": 0.0041580507929967645, "phrase": "new_deductive_system"}, {"score": 0.004084307764140389, "phrase": "free_use"}, {"score": 0.004055176557424983, "phrase": "inference_rules"}, {"score": 0.003708033700676924, "phrase": "new_linguistic_symbols"}, {"score": 0.0027543636132088332, "phrase": "craig_interpolation_property"}, {"score": 0.002724909017963099, "phrase": "maehara_interpolation"}, {"score": 0.002695768552609587, "phrase": "special_significance"}, {"score": 0.0026008598632891837, "phrase": "complexity_theory"}, {"score": 0.002554662768695568, "phrase": "model_theory"}, {"score": 0.0024209250169088575, "phrase": "local_and_global_deduction"}, {"score": 0.0021049977753042253, "phrase": "mild_requirements"}], "paper_keywords": ["interpolation", " preservation of interpolation", " fibring of logics"], "paper_abstract": "Fibring is a metalogical constructor that permits to combine different logics by operating on their deductive systems under certain natural restrictions, as for example that the two given logics are presented by deductive systems of the same type. Under such circumstances, fibring will produce a new deductive system by means of the free use of inference rules from both deductive systems, provided the rules are schematic, in the sense of using variables that are open for application to formulas with new linguistic symbols (from the point of view of each logic component). Fibring is a generalization of fusion, a less general but wider developed mechanism which permits results of the following kind: if each logic component is decidable (or sound, or complete with respect to a certain semantics) then the resulting logic heirs such a property. The interest for such preservation results for combining logics is evident, and they have been achieved in the more general setting of fibring in several cases. The Craig interpolation property and the Maehara interpolation have a special significance when combining logics, being related to certain problems of complexity theory, some properties of model theory and to the usual (global) metatheorem of deduction. When the peculiarities of the distinction between local and global deduction interfere, justifying what we call careful reasoning, the question of preservation of interpolation becomes more subtle and other forms of interpolation can be distinguished. These questions are investigated and several (global and local) preservation results for interpolation are obtained for fibring logics that fulfill mild requirements.", "paper_title": "Preservation of interpolation features by fibring", "paper_id": "WOS:000252718100007"}