{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "social_science"}, {"score": 0.034158922014344305, "phrase": "conceptual_generalisation"}, {"score": 0.00447937340641839, "phrase": "small_contribution"}, {"score": 0.00439918275666155, "phrase": "general_methodology"}, {"score": 0.004037370832877034, "phrase": "six_conceptual_models"}, {"score": 0.003929391999210588, "phrase": "determining_levels"}, {"score": 0.0038590090616766434, "phrase": "different_models"}, {"score": 0.0035898158129721003, "phrase": "case_study"}, {"score": 0.0034780071331554003, "phrase": "conceptual_models"}, {"score": 0.0028634235895823594, "phrase": "empirical_generalisation"}, {"score": 0.002675571068567923, "phrase": "empirical_data"}, {"score": 0.002389403849342894, "phrase": "phd_students"}, {"score": 0.0021925226977381244, "phrase": "systemic_methodology"}, {"score": 0.0021337783230121286, "phrase": "university_teachers"}, {"score": 0.0021049977753042253, "phrase": "conceptual_generalisations"}], "paper_keywords": ["Design", " Education", " Systemic thinking"], "paper_abstract": "Purpose - The purpose of this paper is to make a small contribution to reflections on general methodology, not specific methods, in social science. Design/methodology/approach - Systemic methodology. Findings - First, schematic typology of six conceptual models. Second, typology for determining levels of abstraction for different models and degrees of generalisation. Third, typology for generalisation on the basis of a case study. Fourth, strategy for developing conceptual models. Research limitations/implications - Research falls into two main categories: conceptual generalisation and empirical generalisation. Conceptual generalisation is an investigation whereby the researcher uses other researchers' empirical findings in conjunction with his or her own process of conceptualisation in order to generalise and identify a pattern. This contrasts with empirical generalisation, where the researcher investigates a phenomenon or problem that is apparent in the empirical data, and only thereafter generalises in the light of his or her own findings. Practical implications - A low level of understanding of conceptual generalisation among masters and PhD students. With this paper the authors try to change this perception among students. Originality/value - Developing a systemic methodology in order for students and university teachers to understand conceptual generalisations.", "paper_title": "Conceptual generalisation Methodological reflections in social science a systemic viewpoint", "paper_id": "WOS:000357420000007"}