{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "rational_space_curves"}, {"score": 0.039129552974526124, "phrase": "parameter_values"}, {"score": 0.038097479208460135, "phrase": "gaussian_elimination"}, {"score": 0.03766320915806382, "phrase": "resultant_matrix"}, {"score": 0.025933178651577706, "phrase": "rational_space_curve"}, {"score": 0.004720717782144015, "phrase": "new_technique"}, {"score": 0.00453772385360173, "phrase": "rational_parametrization"}, {"score": 0.004484215355348556, "phrase": "space_curve"}, {"score": 0.003935513160201076, "phrase": "intersection_points"}, {"score": 0.0038584250641318057, "phrase": "new_sparse_resultant_matrix"}, {"score": 0.00344007531836105, "phrase": "singular_point"}, {"score": 0.0032176306711341066, "phrase": "sigma"}, {"score": 0.00303072749758085, "phrase": "univariate_polynomial"}, {"score": 0.0029949359231919307, "phrase": "exactly_the_parameter_values"}, {"score": 0.0029246121262946384, "phrase": "correct_multiplicity"}, {"score": 0.00246657044320953, "phrase": "infinitely_near_singular_points"}, {"score": 0.0022967713922705, "phrase": "total_multiplicity"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Rational space curve", " Resultant matrix", " mu-Basis", " Singularities", " Intersection number"], "paper_abstract": "We provide a new technique to detect the singularities of rational space curves. Given a rational parametrization of a space curve, we first compute a mu-basis for the parametrization. From this mu-basis we generate three planar algebraic curves of different bidegrees whose intersection points correspond to the parameters of the singularities. To find these intersection points, we construct a new sparse resultant matrix for these three bivariate polynomials. We then compute the parameter values corresponding to the singularities by applying Gaussian elimination to this resultant matrix. Let nu(Q) denote the multiplicity of the singular point Q, and let n be the degree of the curve. We find that when Sigma nu(Q) <= 2n - 3, the last nonzero row after Gaussian elimination represents a univariate polynomial whose roots are exactly the parameter values of the singularities with the correct multiplicity. Otherwise the last two nonzero rows represent two bivariate polynomials whose common roots provide the parameter values of the singularities. We also show that if R is this resultant matrix, then size(R) rank(R) gives the total multiplicity Sigma nu(Q) (nu(Q) - 1) of all the singular points including the infinitely near singular points of a rational space curve and we provide bounds on the expression Sigma nu(Q)(nu(Q) - 1) for the total multiplicity of all the singular points of a rational space curve. To verify our results, we present several examples to illustrate our methods. (C) 2012 Elsevier B.V. All rights reserved.", "paper_title": "Using a bihomogeneous resultant to find the singularities of rational space curves", "paper_id": "WOS:000316423400001"}