{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "block-wise_features"}, {"score": 0.004093453936415085, "phrase": "one-to-one_verification"}, {"score": 0.003896871009090446, "phrase": "one-to-many_identification_case"}, {"score": 0.003445591238183763, "phrase": "different_regularization_terms"}, {"score": 0.0032800186243040663, "phrase": "cr-based_classification_framework"}, {"score": 0.0031377955308198634, "phrase": "feature_vectors"}, {"score": 0.0030017207229983385, "phrase": "block-wise_statistics"}, {"score": 0.0029576827451501956, "phrase": "extraction_scheme"}, {"score": 0.0028574164693918433, "phrase": "uniform_blocks"}, {"score": 0.0027741761880779535, "phrase": "surface_types"}, {"score": 0.002576503437739865, "phrase": "feature_vector"}, {"score": 0.0024525907271610125, "phrase": "mere_misalignment"}, {"score": 0.0023811153883132536, "phrase": "proposed_cr-based_framework"}, {"score": 0.0021049977753042253, "phrase": "large-scale_identification_application"}], "paper_keywords": ["3D palmprint", " sparse representation", " l(1)-minimization", " collaborative representation", " surface type"], "paper_abstract": "Developing 3D palmprint recognition systems has recently begun to draw attention of researchers. Compared with its 2D counterpart, 3D palmprint has several unique merits. However, most of the existing 3D palmprint matching methods are designed for one-to-one verification and they are not efficient to cope with the one-to-many identification case. In this paper, we fill this gap by proposing a collaborative representation (CR) based framework with l(1)-norm or l(2)-norm regularizations for 3D palmprint identification. The effects of different regularization terms have been evaluated in experiments. To use the CR-based classification framework, one key issue is how to extract feature vectors. To this end, we propose a block-wise statistics based feature extraction scheme. We divide a 3D palmprint ROI into uniform blocks and extract a histogram of surface types from each block; histograms from all blocks are then concatenated to form a feature vector. Such feature vectors are highly discriminative and are robust to mere misalignment. Experiments demonstrate that the proposed CR-based framework with an l(2)-norm regularization term can achieve much better recognition accuracy than the other methods. More importantly, its computational complexity is extremely low, making it quite suitable for the large-scale identification application. Source codes are available at http://sse.tongji.edu.cn/linzhang/cr3dpalm/cr3dpalm.htm.", "paper_title": "3D Palmprint Identification Using Block-Wise Features and Collaborative Representation", "paper_id": "WOS:000357591900016"}