{"auto_keywords": [{"score": 0.025032392208329042, "phrase": "taiwan"}, {"score": 0.006883012565085309, "phrase": "wiley"}, {"score": 0.0064933751354599, "phrase": "mcdm"}, {"score": 0.00481495049065317, "phrase": "fuzzy_multiple_criteria"}, {"score": 0.0044904452331803, "phrase": "complex_decision-making_tool"}, {"score": 0.004265354774450696, "phrase": "optimal_probably_options"}, {"score": 0.004007083686875716, "phrase": "fuzzy_multi_decision-making"}, {"score": 0.003865700194203472, "phrase": "emerald"}, {"score": 0.003772879616313737, "phrase": "sciencedirect"}, {"score": 0.0035233696341819437, "phrase": "proquest"}, {"score": 0.0034212450542713607, "phrase": "experts'_opinions"}, {"score": 0.0027946649584841754, "phrase": "fmcdm"}, {"score": 0.002530359917257626, "phrase": "hybrid_fuzzy_mcdm"}, {"score": 0.002502576987281976, "phrase": "integrated_method"}, {"score": 0.00244792069601419, "phrase": "individual_section"}, {"score": 0.00240328454980006, "phrase": "first_and_second_methods"}, {"score": 0.0023079225317714815, "phrase": "first_country"}, {"score": 0.002200077887697072, "phrase": "first_field"}, {"score": 0.0021679176844660074, "phrase": "fuzzy_dm_tools"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Fuzzy multiple criteria decision making", " Multiple criteria decision making", " Literature review"], "paper_abstract": "MCDM is considered as a complex decision-making tool involving both quantitative and qualitative factors. In recent years, several fuzzy FMCDM tools have been suggested to choosing the optimal probably options. The purpose of this paper is to review systematically the applications and methodologies of the fuzzy multi decision-making (FMCDM) techniques. This study reviewed a total of 403 papers published from 1994 to 2014 in more than 150 peer reviewed journals (extracted from online databases such as ScienceDirect, Springer, Emerald, Wiley, ProQuest, and Taylor & Francis). According to experts' opinions, these papers were grouped into four main fields: engineering, management and business, science, and technology. Furthermore, these papers were categorized based on authors, publication date, country of origin, methods, tools, and type of research (FMCDM utilizing research, FMCDM developing research, and FMCDM proposing research). The results of this study indicated that, in 2013, scholars have published papers more than other years. In addition, hybrid fuzzy MCDM in the integrated method and fuzzy AHP in the individual section were ranked as the first and second methods in use. Additionally, Taiwan was ranked as the first country that contributed to this survey, and engineering was ranked as the first field that has applied fuzzy DM tools and techniques. (C) 2015 Elsevier Ltd. All rights reserved.", "paper_title": "Fuzzy multiple criteria decision-making techniques and applications - Two decades review from 1994 to 2014", "paper_id": "WOS:000356904100028"}