{"auto_keywords": [{"score": 0.04860000689752459, "phrase": "sensor_network"}, {"score": 0.015719716506582538, "phrase": "sensor_networks"}, {"score": 0.004764859786310636, "phrase": "automated_requirements"}, {"score": 0.004740009255053372, "phrase": "-based_programming"}, {"score": 0.004522080178250592, "phrase": "distributed_system"}, {"score": 0.0038049789989278463, "phrase": "system_requirements"}, {"score": 0.0037653554368382814, "phrase": "actual_application_code"}, {"score": 0.00256895975568914, "phrase": "restricted_natural_language"}, {"score": 0.0024634797027967203, "phrase": "provably_equivalent_formal_model"}, {"score": 0.0023499703712897293, "phrase": "code_generation"}, {"score": 0.0022653055209664284, "phrase": "significant_step"}, {"score": 0.0022299587520401747, "phrase": "high-dependability_system_engineering"}, {"score": 0.002206700502606511, "phrase": "numerous_possible_application_domains"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["sensor networks", " formal methods", " automatic code generation"], "paper_abstract": "A sensor network can be viewed as a distributed system consisting of many nodes (processes) that communicate and exchange data. Such a system, including an application running on top of the sensor network, is inherently difficult to model and validate. System requirements and actual application code may not be consistent, with the implementation failing to implement all of the requirements, or failing to implement them correctly. Requirements can be expressed as a set of services that the sensor network should provide. Each service may be described using one or more scenarios. For the classes of systems whose behavior can be described as a finite (but significant) set of scenarios, we offer a method for mechanically transforming requirements (expressed in restricted natural language, or in other appropriate notations) into a provably equivalent formal model that can be used as the basis for code generation and other transformations. This represents a significant step forward toward high-dependability system engineering for numerous possible application domains, including sensor networks. (C) 2005 Elsevier B.V. All rights reserved.", "paper_title": "Achieving dependability in sensor networks through automated requirements-based programming", "paper_id": "WOS:000234868500009"}