{"auto_keywords": [{"score": 0.040606626433812944, "phrase": "requirements_processes"}, {"score": 0.03136625246751808, "phrase": "case_study"}, {"score": 0.00481495049065317, "phrase": "requirements_changes"}, {"score": 0.004468684611798047, "phrase": "incremental_development_processes"}, {"score": 0.00439777299939725, "phrase": "new_requirements"}, {"score": 0.0035908627899097407, "phrase": "specific_project"}, {"score": 0.00335016692413066, "phrase": "necessary_requirements"}, {"score": 0.003159106878239524, "phrase": "software_architecture"}, {"score": 0.002470987929071079, "phrase": "qualitative_characteristics"}, {"score": 0.0023802825369325354, "phrase": "seven_categories"}, {"score": 0.0023424328921363585, "phrase": "typical_requirements_process"}, {"score": 0.0021049977753042253, "phrase": "practical_integrated_requirements_engineering"}], "paper_keywords": ["requirements engineering", " requirements elicitation process", " case study"], "paper_abstract": "Requirements changes sometimes cause a project to fail. A lot of projects now follow incremental development processes so that new requirements and requirements changes can be incorporated as soon as possible. These processes are called integrated requirements processes. which function to integrate requirements processes with other developmental processes. We have quantitatively and qualitatively investigated the requirements processes of a specific project from beginning to end. Our focus is to clarify the types of necessary requirements based on the components contained within a certain portion of the software architecture. Further, each type reveals its typical requirements processes through its own rationale. This case study is a system to manage the orders and services of a restaurant. In this paper, we introduce the case and categorize its requirements processes based on the components of the system and the qualitative characteristics of ISO-9126. We could identify seven categories of the typical requirements process to be managed and/or controlled. Each category reveals its typical requirements processes and their characteristics. The case study is our first step of practical integrated requirements engineering.", "paper_title": "A Case Study of Requirements Elicitation Process with Changes", "paper_id": "WOS:000281342300019"}