{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "distributed"}, {"score": 0.01264957581089626, "phrase": "fibonacci"}, {"score": 0.004764859786310636, "phrase": "ultrasparse_spanners"}, {"score": 0.004731754442072492, "phrase": "linear_size_skeletons"}, {"score": 0.004666228956744244, "phrase": "efficient_algorithms"}, {"score": 0.00450633982324153, "phrase": "non-trivial_lower_bounds"}, {"score": 0.004246947739596565, "phrase": "synchronized_distributed_network"}, {"score": 0.004101366149219787, "phrase": "time_step"}, {"score": 0.004030449969901066, "phrase": "fast_distributed_algorithm"}, {"score": 0.0035670895401691536, "phrase": "unbounded_length_messages"}, {"score": 0.0033969686698961743, "phrase": "new_class"}, {"score": 0.0031348622158167195, "phrase": "nearly_linear_size"}, {"score": 0.002974886152979993, "phrase": "golden_ratio"}, {"score": 0.00290304212971385, "phrase": "multiplicative_distortion"}, {"score": 0.002872783899731766, "phrase": "fibonacci_spanner"}, {"score": 0.0025510720021028107, "phrase": "lower_bound_side"}, {"score": 0.0024634797027967203, "phrase": "distributed_networks"}, {"score": 0.002420815160284086, "phrase": "desired_distortion"}, {"score": 0.0023214036848949876, "phrase": "tiny_fraction"}, {"score": 0.002249527353528286, "phrase": "distance_preservers"}, {"score": 0.002202847728425357, "phrase": "sublinear_additive_distortion"}], "paper_keywords": [""], "paper_abstract": "We present efficient algorithms for computing very sparse low distortion spanners in distributed networks and prove some non-trivial lower bounds on the tradeoff between time, sparseness, and distortion. All of our algorithms assume a synchronized distributed network, where relatively shortmessages may be communicated in each time step. Our first result is a fast distributed algorithm for finding an O(2(log)*(n) log n)-spanner with size O(n). Besides being nearly optimal in time and distortion, this algorithm appears to be the first that constructs an O(n)-size skeleton without requiring unbounded length messages or time proportional to the diameter of the network. Our second result is a new class of efficiently constructible (alpha, beta)-spanners called Fibonacci spanners whose distortion improves with the distance being approximated. At their sparsest Fibonacci spanners can have nearly linear size, namely O(n(log log n)(phi)), where phi = (1 + root 5)/2 is the golden ratio. As the distance increases the multiplicative distortion of a Fibonacci spanner passes through four discrete stages, moving from logarithmic to log-logarithmic, then into a period where it is constant, tending to 3, followed by another period tending to 1. On the lower bound side we prove that many recent sequential spanner constructions have no efficient counterparts in distributed networks, even if the desired distortion only needs to be achieved on the average or for a tiny fraction of the vertices. In particular, any distance preservers, purely additive spanners, or spanners with sublinear additive distortion must either be very dense, slow to construct, or have very weak guarantees on distortion.", "paper_title": "Distributed algorithms for ultrasparse spanners and linear size skeletons", "paper_id": "WOS:000275146300002"}