{"auto_keywords": [{"score": 0.004714023408114857, "phrase": "content-based_information_dissemination"}, {"score": 0.004615202066192795, "phrase": "promising_tool"}, {"score": 0.004461359547152617, "phrase": "vehicular_networking"}, {"score": 0.004240116703465252, "phrase": "emergency_announcements"}, {"score": 0.004046923261950549, "phrase": "based_information_dissemination"}, {"score": 0.003670843919846253, "phrase": "vehicle's_subscriptions"}, {"score": 0.003624429617337833, "phrase": "driver's_interests"}, {"score": 0.0034154440860550564, "phrase": "affected_vehicles"}, {"score": 0.00327356326590461, "phrase": "central_servers"}, {"score": 0.0030847461428168614, "phrase": "specified_time_interval"}, {"score": 0.0025160740422447837, "phrase": "small_number"}, {"score": 0.002421726275597666, "phrase": "large_scale_simulation"}, {"score": 0.0023708445073819277, "phrase": "realistic_vehicular_traces"}, {"score": 0.002281930100792185, "phrase": "high_message_delivery"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": [""], "paper_abstract": "Content-based information dissemination is emerging as a promising tool to tackle the demands of several applications in vehicular networking, including advertising, traffic and parking notifications, x and emergency announcements. In this paper we describe a protocol for content based information dissemination in hybrid (i.e., partially structureless) vehicular networks. The protocol allows content to \"stick'' to areas where vehicles need to receive it. The vehicle's subscriptions indicate the driver's interests about types of content and are used to filter and route information to affected vehicles. The publications, generated by other vehicles or by central servers, are first routed into the area, then continuously propagated for a specified time interval. The protocol takes advantage of both the infrastructure (i.e., wireless base stations), if this exists, and the decentralised vehicle-to- vehicle communication technologies. To show the feasibility and assess the performance of our approach, we implemented and tested our framework using a small number of vehicles. Furthermore, we run a large scale simulation over a number of realistic vehicular traces based scenarios. Results show that our protocol achieves high message delivery while introducing low overhead, even in scenarios where no infrastructure is available.(1) (C) 2009 Elsevier B.V. All rights reserved.", "paper_title": "A hybrid approach for content-based publish/subscribe in vehicular networks", "paper_id": "WOS:000208396500004"}