{"auto_keywords": [{"score": 0.04497391921239431, "phrase": "power_consumption"}, {"score": 0.03980713684810354, "phrase": "gper"}, {"score": 0.00481495049065317, "phrase": "sensor_networks"}, {"score": 0.004728499903204582, "phrase": "sensor_network"}, {"score": 0.004694353795114243, "phrase": "operating_oil_power_limited_batteries"}, {"score": 0.004527269879990066, "phrase": "battery_replacement"}, {"score": 0.004350308086118336, "phrase": "significant_effect"}, {"score": 0.004046020290832207, "phrase": "sensor_node"}, {"score": 0.004016782710006123, "phrase": "local_decisions"}, {"score": 0.0033748847621075536, "phrase": "intermediary_node"}, {"score": 0.003242820629121494, "phrase": "traditional_deterministic_geographic_routing_algorithms"}, {"score": 0.003161474881435185, "phrase": "shortest_weighted_paths"}, {"score": 0.00295078850927459, "phrase": "nodes_oil"}, {"score": 0.002887210021573995, "phrase": "short_network_life"}, {"score": 0.00269475174341129, "phrase": "probabilistic_multipath_routing_algorithms"}, {"score": 0.002655894070657161, "phrase": "braided_multipaths"}, {"score": 0.0026175952455594277, "phrase": "local_information"}, {"score": 0.0025518930446603335, "phrase": "conventional_on-demand_multipath_routing_algorithms"}, {"score": 0.0023303871145705954, "phrase": "alternative_geographic_routing_algorithms"}, {"score": 0.002263639474937039, "phrase": "communication_tasks"}, {"score": 0.002206801982145622, "phrase": "probabilistic_multipath_routing"}, {"score": 0.002151388538895855, "phrase": "network_lifetime"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Wireless sensor networks", " Geographic routing", " Localized routing", " Power-aware routing"], "paper_abstract": "Nodes in a sensor network, operating oil power limited batteries, must save power to minimize the need for battery replacement. We note that the range of transmission has a significant effect on the power consumption of both the transmitting node and listeners. This paper first presents a Geographical Power Efficient Routing (GPER) protocol for sensor networks. Each sensor node makes local decisions as to how far to transmit: therefore, the protocol is power efficient, localized, highly distributed, and scalable. In GPER, given a final destination, each node first establishes a subdestination within its maximum radio range. The node, however, may decide to relay the packet to this subdestination through an intermediary node or alter the subdestination if this will preserve power. Traditional deterministic geographic routing algorithms aim at achieving close to the shortest weighted paths. However, they normally stick to the same paths for the same source/destination pairs. This may conversely drain the nodes oil these paths and result in short network life when the communication in the network is unevenly distributed. Thus, we further investigate a set of probabilistic multipath routing algorithms, which generate braided multipaths based only on local information. The algorithms have less communication and storage overhead than conventional on-demand multipath routing algorithms, while providing greater resilience to node failures. Simulations on NS2 show that GPER almost halves the power consumption in the network relative to alternative geographic routing algorithms. Furthermore, in situations where the communication tasks are non-uniformly distributed, probabilistic multipath routing contributes tip to an additional 30% to network lifetime. (C) 2006 Elsevier B.V. All rights reserved.", "paper_title": "Power-aware single- and multipath geographic routing in sensor networks", "paper_id": "WOS:000206061200002"}