{"auto_keywords": [{"score": 0.013676656111526327, "phrase": "web_applications"}, {"score": 0.00481495049065317, "phrase": "web_application"}, {"score": 0.004332894955218135, "phrase": "software_products"}, {"score": 0.0039218440805789965, "phrase": "countless_web_applications"}, {"score": 0.0033473779327638322, "phrase": "vast_number"}, {"score": 0.00304737045343781, "phrase": "previous_test_artifacts"}, {"score": 0.0029075757820516634, "phrase": "test_scenarios"}, {"score": 0.0025254115243261875, "phrase": "software_test_engineers"}, {"score": 0.002452333524620638, "phrase": "test_planning_and_creation_stage"}, {"score": 0.00224551648748308, "phrase": "manual_generation"}, {"score": 0.0022192891418394535, "phrase": "qualitative_evaluation"}, {"score": 0.002193367454830741, "phrase": "professional_software_engineers"}], "paper_keywords": ["software testing", " scenario generation", " knowledge-based engineering", " Web applications"], "paper_abstract": "For the past couple of decades, the usage of the Web as a platform for deploying software products has become incredibly popular. Web applications became more prevalent, as well as more complex. Countless Web applications have already been designed, developed, tested, and deployed on the Internet. However, it is noticeable that many common functionalities are present among these vast number of applications. This paper proposes an approach based on a database containing information from previous test artifacts. The information is used to generate test scenarios for Web applications under test. We have developed a tool based on our proposed approach, with the aim of reducing the effort required from software test engineers and professionals during the test planning and creation stage of software engineering. We evaluated our approach from three viewpoints: comparison between our approach and manual generation, qualitative evaluation by professional software engineers, and comparison between our approach and two open-source tools.", "paper_title": "Test Scenario Generation for Web Application Based on Past Test Artifacts", "paper_id": "WOS:000342784200010"}