{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "contour_lines"}, {"score": 0.004773142744062573, "phrase": "contour_line_intervals"}, {"score": 0.0046164478775379105, "phrase": "new_methodology"}, {"score": 0.004544127927346964, "phrase": "planimetric_control"}, {"score": 0.004047141845635495, "phrase": "maximum_slope_line"}, {"score": 0.003529149828147388, "phrase": "distribution_function"}, {"score": 0.0034738037330064885, "phrase": "control_points"}, {"score": 0.0031761255583359726, "phrase": "height_differences"}, {"score": 0.0029038817737006405, "phrase": "digital_elevation_model"}, {"score": 0.0026830601040919166, "phrase": "control_source"}, {"score": 0.0025858215477025117, "phrase": "representative_behaviour"}, {"score": 0.0024659480471085405, "phrase": "contour_line_interval"}, {"score": 0.0023891283748647416, "phrase": "uncertainty_model"}, {"score": 0.002339246282204109, "phrase": "slope_variation"}, {"score": 0.0022307779508260205, "phrase": "proposed_method"}], "paper_keywords": ["quality", " uncertainty", " DEM", " contour lines"], "paper_abstract": "This article describes a new methodology for the planimetric control of contour lines. The method is based on the generation of buffers around the contour lines which define a 3D buffer around the maximum slope line. After that we analyze the quantity of points from a more accurate source which is inside this buffer. As a result, we obtain a distribution function of the control points included when we apply several widths to the buffers. We have also determined the angularity and height differences of these points. The method has been applied to several sets of contour line intervals derived from a digital elevation model (DEM) and to the contour lines of one published topographic map using the DEM as the control source. We have also analyzed the representative behaviour of the contour lines, taking into account the contour line interval and the detection of an uncertainty model based on the slope variation. This study demonstrates the viability of the proposed method for obtaining the uncertainty of the contour lines depending on a given level of confidence and the variability of this uncertainty in the map. Finally, we propose a range of contour line intervals based on the scale and slopes.", "paper_title": "Accuracy of contour lines using 3D bands", "paper_id": "WOS:000326350400007"}