{"auto_keywords": [{"score": 0.047617154407647785, "phrase": "unrollable_list_formulas"}, {"score": 0.004815154999046638, "phrase": "sat"}, {"score": 0.0039218440805789965, "phrase": "list_structures"}, {"score": 0.0037201996003549246, "phrase": "finite_state_machines"}, {"score": 0.0034268702387746106, "phrase": "new_proof_mechanism"}, {"score": 0.0033277936960179892, "phrase": "sulfa_formulas"}, {"score": 0.0031938648476635225, "phrase": "sat-based_decision_procedure"}, {"score": 0.003119760592916715, "phrase": "decision_procedure"}, {"score": 0.0028234703730349916, "phrase": "future_proof_attempts"}, {"score": 0.002615977783510631, "phrase": "sulfa"}, {"score": 0.0025106241866273897, "phrase": "larger_system"}, {"score": 0.0024236964502593254, "phrase": "trips_processor"}, {"score": 0.0023674192513753996, "phrase": "verilog_designs"}, {"score": 0.002193367454830741, "phrase": "sulfa_properties"}], "paper_keywords": [""], "paper_abstract": "We define the Subclass of Unrollable List Formulas in ACL2 (SULFA). SULFA is a subclass of ACL2 formulas based on list structures that is sufficiently expressive to include invariants of finite state machines (FSMs). We have extended the ACL2 theorem prover to include a new proof mechanism, which can recognize SULFA formulas and automatically verify them with a SAT-based decision procedure. When this decision procedure is successful, a theorem is added to the ACL2 system database as a lemma for use in future proof attempts. When unsuccessful, a counter-example to the SULFA property is presented. We are using SULFA and its SAT-based decision procedure as part of a larger system to verify components of the TRIPS processor. Our verification system translates Verilog designs automatically into ACL2 models. These models are written such that their invariants are SULFA properties, which can be verified by our SAT-based decision procedure, traditional theorem proving, or a mixture of the two.", "paper_title": "A SAT-based decision procedure for the subclass of Unrollable List Formulas in ACL2 (SULFA)", "paper_id": "WOS:000240085600038"}