{"auto_keywords": [{"score": 0.04936035518299574, "phrase": "real_robot"}, {"score": 0.03894001829179589, "phrase": "sc-based_approaches"}, {"score": 0.031875228289766154, "phrase": "pfm"}, {"score": 0.00481495049065317, "phrase": "navigation_schemes"}, {"score": 0.004695183699894267, "phrase": "moving_obstacles"}, {"score": 0.004624751696958501, "phrase": "comparative_study"}, {"score": 0.004442032546224076, "phrase": "present_study"}, {"score": 0.003540392285585644, "phrase": "optimal_motion_planner"}, {"score": 0.0033492947290751996, "phrase": "sc-based_motion_planners"}, {"score": 0.0031684791285366315, "phrase": "conventional_pfm."}, {"score": 0.002952356518921907, "phrase": "traveling_time"}, {"score": 0.0027929100418926725, "phrase": "fuzzy_logic-based_motion_planner"}, {"score": 0.0026688629249775925, "phrase": "neural_network-based_motion_planner"}, {"score": 0.002236527219307079, "phrase": "pfm."}, {"score": 0.0021049977753042253, "phrase": "in-built_learning_module"}], "paper_keywords": ["Car-like robot", " Navigation", " Real experiment", " Fuzzy logic", " Neural network", " Genetic algorithm", " Potential field method", " Robustness", " Adaptability"], "paper_abstract": "A comparative study of various robot motion planning schemes has been made in the present study. Two soft computing (SC)-based approaches, namely genetic-fuzzy and genetic-neural systems and a conventional potential field method (PFM) have been developed for this purpose. Training to the SC-based approaches is given off-line and the performance of the optimal motion planner has been tested on a real robot. Results of the SC-based motion planners have been compared between themselves and with those of the conventional PFM. Both the SC-based approaches are found to perform better than the PFM in terms of traveling time taken by the robot. Moreover, the performance of fuzzy logic-based motion planner is seen to be comparable with that of neural network-based motion planner. Comparisons among all these three motion planning schemes have been made in terms of robustness, adaptability, goal reaching capability and repeatability. Both the SC-based approaches are found to be more adaptive and robust compared to the PFM. It may be due to the fact that there is no in-built learning module in the PFM and consequently, it is unable to plan the velocity of the robot properly. (C) 2008 Elsevier Ltd. All rights reserved.", "paper_title": "A comparative study on some navigation schemes of a real robot tackling moving obstacles", "paper_id": "WOS:000265807600012"}