{"auto_keywords": [{"score": 0.04835645688467941, "phrase": "kernel_method"}, {"score": 0.009185750183602572, "phrase": "proposed_method"}, {"score": 0.00806762413160347, "phrase": "feature_extraction_procedure"}, {"score": 0.007778369738610245, "phrase": "training_sample"}, {"score": 0.0072303775664340295, "phrase": "computationally_efficient_kernel-method-based_feature_extraction_procedure"}, {"score": 0.006886519417712533, "phrase": "feature_extraction_result"}, {"score": 0.005352542891790838, "phrase": "feature_extraction_term"}, {"score": 0.00481495049065317, "phrase": "kernel-method-based_feature_extraction_procedure"}, {"score": 0.004511373893354558, "phrase": "computational_efficiency"}, {"score": 0.004141663280057689, "phrase": "novel_viewpoint"}, {"score": 0.003755949722774176, "phrase": "reformulated_kernel_method"}, {"score": 0.0035767311154996464, "phrase": "training_samples"}, {"score": 0.0034761488481944657, "phrase": "feature_extraction_results"}, {"score": 0.0030386598795433474, "phrase": "high_correlation"}, {"score": 0.00266693888510356, "phrase": "first_time"}, {"score": 0.0025918745925152423, "phrase": "formal_and_reasonable_evaluation"}, {"score": 0.0024480094603893175, "phrase": "low_extra_cost"}, {"score": 0.002350152413458658, "phrase": "previous_improvements"}, {"score": 0.0022933216359142736, "phrase": "experimental_comparison"}, {"score": 0.0022196745041124888, "phrase": "classification_problems"}, {"score": 0.002148387364260776, "phrase": "geometrical_relation"}, {"score": 0.0021222476760114914, "phrase": "identified_training_samples"}], "paper_keywords": ["Pattern recognition", " Kernel methods", " Feature extraction", " Kernel minimum squared error", " Kernel PCA"], "paper_abstract": "The kernel method suffers from the following problem: the computational efficiency of the feature extraction procedure is inversely proportional to the size of the training sample set. In this paper, from a novel viewpoint, we propose a very simple and mathematically tractable method to produce the computationally efficient kernel-method-based feature extraction procedure. We first address the issue that how to make the feature extraction result of the reformulated kernel method well approximate that of the na < ve kernel method. We identify these training samples that statistically contribute much to the feature extraction results and exploit them to reformulate the kernel method to produce the computationally efficient kernel-method-based feature extraction procedure. Indeed, the proposed method has the following basic idea: when one training sample has little effect on the feature extraction result and statistically has the high correlation with regard to all the training samples, the feature extraction term associated with this training sample can be removed from the feature extraction procedure. The proposed method has the following advantages: First, it proposes, for the first time, to improve the kernel method through formal and reasonable evaluation on the feature extraction term. Second, the proposed method improves the kernel method at a low extra cost and thus has a much more computationally efficient training phase than most of the previous improvements to the kernel method. The experimental comparison shows that the proposed method performs well in classification problems. This paper also intuitively shows the geometrical relation between the identified training samples and other training samples.", "paper_title": "Accelerating the kernel-method-based feature extraction procedure from the viewpoint of numerical approximation", "paper_id": "WOS:000294910400018"}