{"auto_keywords": [{"score": 0.0471913809101942, "phrase": "m-learning_adoption"}, {"score": 0.009840540580956514, "phrase": "perceived_long-term_usefulness"}, {"score": 0.004581505405526037, "phrase": "driving_factors"}, {"score": 0.004441359373498799, "phrase": "short_supply"}, {"score": 0.004173743791750695, "phrase": "hypothesized_model"}, {"score": 0.004046020290832207, "phrase": "structural_equation_modeling_technology"}, {"score": 0.0036857412768922827, "phrase": "survey_questionnaire"}, {"score": 0.003399466007862412, "phrase": "m-learning_adoption_intention"}, {"score": 0.0033159224502739247, "phrase": "long-term_usefulness"}, {"score": 0.003234425353582135, "phrase": "perceived_near-term_usefulness"}, {"score": 0.0025532173213934422, "phrase": "behavioural_intention"}, {"score": 0.002444333100610621, "phrase": "high-quality_contents"}, {"score": 0.0023990982005125763, "phrase": "students'_future_targets"}, {"score": 0.0022403347259112574, "phrase": "china"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["M-learning", " Technology acceptance model (TAM)", " Long-term usefulness", " IT adoption"], "paper_abstract": "Even if m-learning is spreading rapidly in many regions of the world, research addressing the driving factors of m-learning adoption is in short supply. Built on the Technology Acceptance Model, this paper proposes a hypothesized model of m-learning adoption. Employing structural equation modeling technology, the model was assessed based on the data collected from 230 participants using a survey questionnaire. Results indicate that perceived near-term/long-term usefulness and personal innovativeness have significant influence on m-learning adoption intention, while perceived long-term usefulness significantly affects the perceived near-term usefulness. Personal innovativeness is a predictor of both the perceived ease of use and perceived long-term usefulness as well. Of all variables, the perceived long-term usefulness contributes to the most influential predictor of m-learning adoption. The model accounts for approximately 60.8% of the variance of behavioural intention. The results indicted that offing high-quality contents complying with students' future targets is key to the success of m-learning in China. Both theoretical and practical implications are discussed. (C) 2010 Elsevier Ltd. All rights reserved.", "paper_title": "Factors driving the adoption of m-learning: An empirical study", "paper_id": "WOS:000280985600028"}