{"auto_keywords": [{"score": 0.04553668893926098, "phrase": "sph_method"}, {"score": 0.02756907709456727, "phrase": "metal_jet"}, {"score": 0.0189531707543676, "phrase": "formation_process"}, {"score": 0.011773769487310043, "phrase": "linear-shaped_charge_jet"}, {"score": 0.007170794615014246, "phrase": "different_material_yield_models"}, {"score": 0.005814085547380092, "phrase": "mesh-based_method"}, {"score": 0.004821112583970122, "phrase": "explosive_wave_propagation"}, {"score": 0.00481495049065317, "phrase": "two-dimensional_linear-shaped_charge_jet"}, {"score": 0.004523380792307973, "phrase": "smoothed_particle_hydrodynamics"}, {"score": 0.004297948502679085, "phrase": "explosive_driven_metal_liner"}, {"score": 0.0042373381286051354, "phrase": "different_ignition_model"}, {"score": 0.003991932110277654, "phrase": "artificial_viscosity"}, {"score": 0.00396931167065037, "phrase": "penalty_force"}, {"score": 0.003782121164797319, "phrase": "explosive_gas"}, {"score": 0.003760685138103153, "phrase": "metal_liner"}, {"score": 0.0037287578312533596, "phrase": "numerical_results"}, {"score": 0.003542786326740931, "phrase": "numerical_examples"}, {"score": 0.0034828730516958807, "phrase": "material_model"}, {"score": 0.003404556450666522, "phrase": "single_point"}, {"score": 0.003309124298009635, "phrase": "ignition_models"}, {"score": 0.003161948083727975, "phrase": "original_mesh-based_method"}, {"score": 0.0030908254851076005, "phrase": "physical_process"}, {"score": 0.002953329533402266, "phrase": "different_material_yields_models"}, {"score": 0.0028705091631646617, "phrase": "numerical_difference"}, {"score": 0.002838033152426417, "phrase": "two-point_ignition_model"}, {"score": 0.0026282000779095987, "phrase": "higher_velocity_metal_jet"}, {"score": 0.0025112322629187787, "phrase": "shaped_charge_explosion_process"}, {"score": 0.0024200304529801513, "phrase": "shaped_charged_jet"}, {"score": 0.0022283123058680658, "phrase": "large_deformation"}, {"score": 0.0021351728113483946, "phrase": "good_alternative"}, {"score": 0.002123051344001408, "phrase": "traditional_mesh-based_numerical_methods"}, {"score": 0.0021049977753042253, "phrase": "similar_explosively_driven_metal_material_problems"}], "paper_keywords": ["Jets", " Deformation", " Hydrodynamics"], "paper_abstract": "Purpose - The purpose of this paper is to investigate the formation process of linear-shaped charge jet using the smoothed particle hydrodynamics (SPH). Different material yield models are embed to test the performance of SPH method in the simulation of explosive driven metal liner. The effects of different ignition model to the formation of metal jet have also been studied. Design/methodology/approach - The SPH method is used with the correction of artificial viscosity and penalty force to simulate the formation process of linear-shaped charge jet, which includes the process of explosion and interaction between explosive gas and metal liner. The numerical results which got by SPH method are compared with these obtained by mesh-based method. Different material yield models are implemented in the numerical examples to show the effect of material model to the formation process of metal jet. The single point and two point ignition models are used to study the effect of ignition models to the process of explosion and formation of metal jet. Findings - Compared with the original mesh-based method, the SPH method can simulate the physical process of linear-shaped charge jet naturally, as well as the capturing of explosive wave propagation. The implementation of different material yields models to obtain the same formation tendency of metal jet, but some numerical difference exists. In two-point ignition model the explosive pressure is superimposed at the location that two detonation waves intersect. Compared with two ignition models, the two point ignition model can form the metal jet faster and get the higher velocity metal jet. Originality/value - There are a few references that address the application of SPH to simulate shaped charge explosion process. The feasibility of the SPH method to simulate the formation process of linear shaped charged jet is tested and verified in this paper. From the results which compared with mesh-based method, it is shown that the SPH method has the advantage in tracking the large deformation of material and capturing the explosive wave propagation. The SPH method can be selected as a good alternative to traditional mesh-based numerical methods in simulating similar explosively driven metal material problems which can be referenced from this paper.", "paper_title": "Computer simulation of two-dimensional linear-shaped charge jet using smoothed particle hydrodynamics", "paper_id": "WOS:000289390600004"}