{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "computational_highlight_holography"}, {"score": 0.00475413908468027, "phrase": "three-dimensional_computer_models"}, {"score": 0.004349337717774093, "phrase": "small_grooves"}, {"score": 0.0038789122930433305, "phrase": "directional_light"}, {"score": 0.0037336520904376687, "phrase": "different_places"}, {"score": 0.0036864465771943933, "phrase": "different_view_directions"}, {"score": 0.003245900020944865, "phrase": "desired_view_position"}, {"score": 0.002931569771634119, "phrase": "maximal_set"}, {"score": 0.0028944757265206332, "phrase": "non-overlapping_patches"}, {"score": 0.002468450551616404, "phrase": "computer-controlled_engraving_machine"}, {"score": 0.002360796860462937, "phrase": "different_fabricated_holograms"}, {"score": 0.0022010126160835024, "phrase": "proper_shading"}], "paper_keywords": [""], "paper_abstract": "Computational highlight holography converts three-dimensional computer models into mechanical \"holograms\" fabricated on (specular) reflective or refractive materials. The surface consists of small grooves with patches of paraboloids or hyperboloids, each of which produces a highlight when illuminated by a directional light. Each highlight appears in different places for different view directions, with the correct binocular and motion parallax corresponding to a virtual 3D point position. Our computational pipeline begins with a 3D model and desired view position, samples the model to generate points that depict its features accurately, and computes a maximal set of non-overlapping patches to be embedded in the surface. We provide a preview of the hologram for the user, then fabricate the surface using a computer-controlled engraving machine. We show a variety of different fabricated holograms: reflective, transmissive, and holograms with color and proper shading. We also present extensions to stationary and animated 2D stippled images.", "paper_title": "Computational Highlight Holography", "paper_id": "WOS:000284943000034"}