{"auto_keywords": [{"score": 0.04392019422481263, "phrase": "synergy_effect"}, {"score": 0.010612387000973441, "phrase": "multi-product_supplier_selection"}, {"score": 0.009485614678688031, "phrase": "purchasing_company"}, {"score": 0.00903976704858714, "phrase": "multi-product_supplier_selection_process"}, {"score": 0.004938808760860794, "phrase": "supplier_selection"}, {"score": 0.004718897469501381, "phrase": "important_problem"}, {"score": 0.004681012408089219, "phrase": "supply_chain_management"}, {"score": 0.0046434385900470864, "phrase": "scm"}, {"score": 0.004406360636696795, "phrase": "scm."}, {"score": 0.004249332848326785, "phrase": "multiple_products"}, {"score": 0.004016072233242585, "phrase": "final_choice"}, {"score": 0.0032956583072431423, "phrase": "complex_decision_making_processes"}, {"score": 0.0032038465090068646, "phrase": "order_fulfillment"}, {"score": 0.0029553380263320195, "phrase": "existing_research"}, {"score": 0.0027704444816096505, "phrase": "multiple_required_products"}, {"score": 0.002545165985686468, "phrase": "product_bundle_determination_model"}, {"score": 0.0024543014947630876, "phrase": "group_products"}, {"score": 0.002347628167175859, "phrase": "preferred_product_bundles"}, {"score": 0.002254672021120091, "phrase": "decision_maker"}, {"score": 0.002227508035618043, "phrase": "right_decision"}, {"score": 0.0021049977753042253, "phrase": "proposed_product_bundle_determination_model"}], "paper_keywords": ["Complementarity", " Multiple products", " Supplier selection", " Synergy effect"], "paper_abstract": "Supplier selection an important problem in supply chain management (SCM), since the performances of suppliers determine the competitiveness of the SCM. It is practical for the purchasing company to procure multiple products simultaneously. Synergy effect may exist between products in multi-product supplier selection process, and affect the final choice of suppliers. It is advantageous for the purchasing company to take into account the synergy effect between products to reduce cost and improve efficiency. On the other hand, suppliers need to consider the synergy effect between products to increase the chance of winning bids. Nevertheless, supplier selection involves complex decision making processes regarding supplier evaluation, selection and order fulfillment, it is difficult to fully incorporate the synergy effect between products in the case of multi-product supplier selection. Most of existing research only deal with supplier selection involving the acquisition of one product, or they assume that the multiple required products are independent. They are not sufficient to incorporate the synergy effect between products for multi-product supplier selection. This paper presents a product bundle determination model which can determine the synergy effect between products, group products based on the synergy effect between products, and determine the preferred product bundles of the purchasing company. This model can help the decision maker to make right decision in multi-product supplier selection process. Illustrative examples are conducted to demonstrate the functioning of the proposed product bundle determination model and its application in multi-product supplier selection process.", "paper_title": "A product bundle determination model for multi-product supplier selection", "paper_id": "WOS:000351138700013"}