{"auto_keywords": [{"score": 0.029588915133989056, "phrase": "coefficients"}, {"score": 0.00481495049065317, "phrase": "correlation_between"}, {"score": 0.0047588556219929756, "phrase": "impact_factor"}, {"score": 0.00440976345264104, "phrase": "journal_impact_factor"}, {"score": 0.0030118058266380503, "phrase": "hard_sciences"}, {"score": 0.0029766550209309127, "phrase": "social_sciences"}, {"score": 0.0028235148557079373, "phrase": "pearson"}, {"score": 0.0027257544451901226, "phrase": "spearman"}, {"score": 0.002662485473765138, "phrase": "kendall"}, {"score": 0.002381365139274329, "phrase": "journal_impact_factors"}, {"score": 0.0022854384756395116, "phrase": "strong_correlation"}, {"score": 0.0021805201234139475, "phrase": "scientific_areas"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Garfield", " Journal Impact Factor", " Article citations", " Correlation coefficients", " Time evolution", " Impact factor misuses"], "paper_abstract": "Since its introduction, the Journal Impact Factor has probably been the most extensively adopted bibliometric indicator. Notwithstanding its well-known strengths and limits, it is still widely misused as a tool for evaluation, well beyond the purposes it was intended for. In order to shed further light on its nature, the present work studies how the correlation between the Journal Impact Factor and the (time-weighed) article Mean Received Citations (intended as a measure of journal performance) has evolved through time. It focuses on a sample of hard sciences and social sciences journals from the 1999 to 2010 time period. Correlation coefficients (Pearson's Coefficients as well as Spearman's Coefficients and Kendall's tau(alpha)) are calculated and then tested against several null hypotheses. The results show that in most cases Journal Impact Factors and their yearly variations do not display a strong correlation with citedness. Differences also exist among scientific areas. (c) 2012 Elsevier Ltd. All rights reserved.", "paper_title": "Correlation between Journal Impact Factor and Citation Performance: An experimental study", "paper_id": "WOS:000318377100013"}