{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "online_game_addiction"}, {"score": 0.006274701186656406, "phrase": "online_game_playing"}, {"score": 0.00470341117804131, "phrase": "common_phenomenon"}, {"score": 0.004332894955218135, "phrase": "functionalist_perspective"}, {"score": 0.004282391936827106, "phrase": "human_behavior"}, {"score": 0.004134372859330047, "phrase": "balanced_model"}, {"score": 0.0037201996003549246, "phrase": "harm_reduction_forces"}, {"score": 0.0034068225125064586, "phrase": "survey_instrument"}, {"score": 0.0033277936960179892, "phrase": "survey_data"}, {"score": 0.0031938648476635225, "phrase": "partial_least_squares_techniques"}, {"score": 0.0025254115243261875, "phrase": "game_playing_time"}, {"score": 0.002129877319760485, "phrase": "european_journal"}, {"score": 0.0021049977753042253, "phrase": "information_systems"}], "paper_keywords": ["addiction", " technology addiction", " computer games", " motivation", " prevention", " harm reduction"], "paper_abstract": "Online game addiction has become a common phenomenon that affects many individuals and societies. In this study we rely on the functionalist perspective of human behavior and propose and test a balanced model of the antecedents of online game addiction among adolescents, which simultaneously focuses on motivating, and prevention and harm reduction forces. First, a sample of 163 adolescents was used for validating and refining a survey instrument. Second, survey data collected from 623 adolescents were analyzed with Partial Least Squares techniques. The findings point to several functional needs (e.g., need for relationship and need for escapism) that drive online game playing and addiction, as well as to several prevention and harm reduction factors (e.g., education, attention switching activities) that reduce game playing time and alleviate online game addiction. The effects of motivation and prevention factors on online game addiction are often partially mediated by online game playing. Implications for research and practice are discussed. European Journal of Information Systems (2012) 21, 321-340. doi: 10.1057/ejis.2011.56; published online 29 November 2011", "paper_title": "Online game addiction among adolescents: motivation and prevention factors", "paper_id": "WOS:000303845200008"}