{"auto_keywords": [{"score": 0.04226255901245674, "phrase": "dip"}, {"score": 0.00481495049065317, "phrase": "distributed_identification_of_polluters"}, {"score": 0.004577440795549049, "phrase": "streaming_applications"}, {"score": 0.004500891637057374, "phrase": "malicious_actions"}, {"score": 0.0034944094552943, "phrase": "data_chunk"}, {"score": 0.003407026489727146, "phrase": "special_message"}, {"score": 0.0033218213825698417, "phrase": "peer_identifiers"}, {"score": 0.002914288956035066, "phrase": "overlay_network"}, {"score": 0.0027937732927852646, "phrase": "factor_graph"}, {"score": 0.0023996317685956213, "phrase": "extensive_experimentation"}, {"score": 0.0023594160789762227, "phrase": "honest_peers"}, {"score": 0.0021049977753042253, "phrase": "low_computational"}], "paper_keywords": ["Security", " Design", " Experimentation", " Peer-to-peer", " pollution attack", " malicious node identification", " P2P streaming", " belief propagation", " statistical inference", " PlanetLab"], "paper_abstract": "Peer-to-peer live streaming applications are vulnerable to malicious actions of peers that deliberately modify data to decrease or prevent the fruition of the media (pollution attack). In this article we propose DIP, a fully distributed, accurate, and robust algorithm for the identification of polluters. DIP relies on checks that are computed by peers upon completing reception of all blocks composing a data chunk. A check is a special message that contains the set of peer identifiers that provided blocks of the chunk as well as a bit to signal if the chunk has been corrupted. Checks are periodically transmitted by peers to their neighbors in the overlay network; peers receiving checks use them to maintain a factor graph. This graph is bipartite and an incremental belief propagation algorithm is run on it to compute the probability of a peer being a polluter. Using a prototype deployed over PlanetLab we show by extensive experimentation that DIP allows honest peers to identify polluters with very high accuracy and completeness, even when polluters collude to deceive them. Furthermore, we show that DIP is efficient, requiring low computational, communication, and storage overhead at each peer.", "paper_title": "DIP: Distributed Identification of Polluters in P2P Live Streaming", "paper_id": "WOS:000334583800002"}