{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "mapping_studies"}, {"score": 0.03639362554565856, "phrase": "preceding_mapping_studies"}, {"score": 0.004577777897335174, "phrase": "evidence-based_software_engineering"}, {"score": 0.0044635893862404385, "phrase": "systematic_literature_reviews"}, {"score": 0.0042436501739199495, "phrase": "slr_methodology"}, {"score": 0.004152725837204292, "phrase": "software_engineering_research"}, {"score": 0.0037806195039533355, "phrase": "available_research"}, {"score": 0.0037398806676032068, "phrase": "broad_software_engineering_topic"}, {"score": 0.0035426543993952184, "phrase": "five_examples"}, {"score": 0.0032250366795039715, "phrase": "review_comments"}, {"score": 0.0029893477597041493, "phrase": "preceding_mapping_study"}, {"score": 0.002872827714395808, "phrase": "nine_problems"}, {"score": 0.002634084319025334, "phrase": "validation_activities"}, {"score": 0.0025405463228033486, "phrase": "independent_research_group"}, {"score": 0.0024950272594582673, "phrase": "mapping_study"}, {"score": 0.002337791830793841, "phrase": "new_research_efforts"}, {"score": 0.0022711207841260767, "phrase": "high_quality"}, {"score": 0.00216680270402079, "phrase": "reliable_basis"}, {"score": 0.002151183757599893, "phrase": "follow-on_research"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Case study", " Systematic literature review", " Mapping studies", " Software engineering"], "paper_abstract": "Context: We are strong advocates of evidence-based software engineering (EBSE) in general and systematic literature reviews (SLRs) in particular. We believe it is essential that the SLR methodology is used constructively to support software engineering research. Objective: This study aims to assess the value of mapping studies which are a form of SLR that aims to identify and categorise the available research on a broad software engineering topic. Method: We used a multi-case, participant-observer case study using five examples of studies that were based on preceding mapping studies. We also validated our results by contacting two other researchers who had undertaken studies based on preceding mapping studies and by assessing review comments related to our follow-on studies. Results: Our original case study identified 11 unique benefits that can accrue from basing research on a preceding mapping study of which only two were case specific. We also identified nine problems associated with using preceding mapping studies of which two were case specific. These results were consistent with the information obtained from the validation activities. We did not find an example of an independent research group making use of a mapping study produced by other researchers. Conclusion: Mapping studies can save time and effort for researchers and provide baselines to assist new research efforts. However, they must be of high quality in terms of completeness and rigour if they are to be a reliable basis for follow-on research. (C) 2010 Elsevier B.V. All rights reserved.", "paper_title": "Using mapping studies as the basis for further research - A participant-observer case study", "paper_id": "WOS:000290460900008"}