{"auto_keywords": [{"score": 0.04858132305104682, "phrase": "broadband_adoption"}, {"score": 0.004437115547184535, "phrase": "effective_diffusion"}, {"score": 0.004397000006837371, "phrase": "innovation_technologies"}, {"score": 0.004357245559948974, "phrase": "small_and_medium_size_enterprises"}, {"score": 0.0036497740708342093, "phrase": "in-depth_view"}, {"score": 0.003600351201298387, "phrase": "broadband_diffusion_process"}, {"score": 0.003535489842686145, "phrase": "south_east_uk"}, {"score": 0.00330246222643051, "phrase": "innovation_diffusion"}, {"score": 0.0032725712584012953, "phrase": "social_construction"}, {"score": 0.0032429499567088113, "phrase": "technology_theory"}, {"score": 0.002988101395789399, "phrase": "previous_literature"}, {"score": 0.002778385486855157, "phrase": "full_use"}, {"score": 0.0024349853033241663, "phrase": "smes'_lack"}, {"score": 0.0023802126605244438, "phrase": "effective_application"}, {"score": 0.002316105585203396, "phrase": "main_impediment"}, {"score": 0.0022951216874671516, "phrase": "effective_adoption"}], "paper_keywords": ["SMEs", " Broadband", " Innovation diffusion", " Social construction of technology (SCOT)"], "paper_abstract": "This study is examining the challenges involved in the effective diffusion of innovation technologies among Small and Medium Size Enterprises (SMEs). Having broadband Internet as the technology in focus we report that broadband adoption by SMEs was initially particularly slow while there has been little research on the reasons behind this phenomenon. This study provides an in-depth view of the broadband diffusion process to SMEs in south east UK by examining the views and activities of the various groups involved in the process. Innovation diffusion and social construction of technology theory are applied in order to construct a framework that addresses some of the issues not covered in previous literature. Our results show that even though several SMEs have adopted broadband, they are not making full use of the technology, while using broadband has not changed significantly the way they operate their businesses. The point we are raising with this study is that the SMEs' lack of understanding on the effective application of the technology is the main impediment for effective adoption. We believe that our results are useful to providers looking to diffuse broadband to SMEs as well as other IT innovations.", "paper_title": "Diverse views on IT innovation diffusion among SMEs: Influencing factors of broadband adoption", "paper_id": "WOS:000341182600012"}