{"auto_keywords": [{"score": 0.04648981269156613, "phrase": "discrete-time_dynamical_systems"}, {"score": 0.021934346077951597, "phrase": "new_properties"}, {"score": 0.00935889168931413, "phrase": "spatial_symmetry"}, {"score": 0.008292279797316428, "phrase": "dynamical_systems"}, {"score": 0.00481495049065317, "phrase": "even-symmetric_and_odd-symmetric_dynamical_systems"}, {"score": 0.0035965032173588753, "phrase": "main_result"}, {"score": 0.003493021648360933, "phrase": "new_theorem"}, {"score": 0.00342568771304873, "phrase": "continuous_and_discrete-time_dynamical_systems"}, {"score": 0.0033271045779740683, "phrase": "present_study"}, {"score": 0.003278878522165815, "phrase": "starting_point"}, {"score": 0.002711842889248926, "phrase": "new_methods"}, {"score": 0.002672511078070529, "phrase": "continuous-time_dynamical_systems"}, {"score": 0.0024963543716522087, "phrase": "chaotic_sources"}, {"score": 0.00247215300812495, "phrase": "model_noise"}, {"score": 0.0023546121947302877, "phrase": "broader_discussion"}, {"score": 0.0021049977753042253, "phrase": "continuous_ones"}], "paper_keywords": ["Cybernetics", " Systems theory", " Modelling"], "paper_abstract": "Purpose - The purpose of this paper is to demonstrate new properties of continuous- and discrete-time dynamical systems. Design/methodology/approach - First, definitions of two types of spatial symmetry are introduced. These are used as definitions, which, along with existing knowledge show that it is possible to identify properties of dynamical systems that were previously unknown. Findings - The main result of the paper is a new theorem regarding new properties of continuous and discrete-time dynamical systems. Research limitations/implications - The present study provides a starting point for further research on the differences between continuous- and discrete-time dynamical systems. This work builds on the definition of spatial symmetry. Practical implications - The theorem proved in this paper and the new properties of dynamical systems can be used to introduce new methods of approximating continuous-time dynamical systems by discrete-time dynamical systems and vice Versa. Such approaches can also be helpful in constructing chaotic sources to model noise. Originality/value - This paper offers contributions to the broader discussion of differences between continuous- and discrete-time dynamical systems. In particular, the paper supports the statement that many discrete-time processes cannot be embedded into continuous ones.", "paper_title": "On some properties of even-symmetric and odd-symmetric dynamical systems", "paper_id": "WOS:000270378700008"}