{"auto_keywords": [{"score": 0.04054987344772189, "phrase": "numerous_extensions"}, {"score": 0.00481495049065317, "phrase": "large-scale_image_retrieval"}, {"score": 0.004675768396728975, "phrase": "content-based_large-scale_image_retrieval"}, {"score": 0.004430928192830705, "phrase": "vlad"}, {"score": 0.004302791070310513, "phrase": "jegou_et_al"}, {"score": 0.0041579627441997, "phrase": "starting_point"}, {"score": 0.004077394032903726, "phrase": "excellent_accuracy-efficiency_trade-off"}, {"score": 0.003959447096055027, "phrase": "increased_attention"}, {"score": 0.0036434002236454305, "phrase": "in-depth_analysis"}, {"score": 0.0027832502848247303, "phrase": "aggregated_representation"}, {"score": 0.002689430273401131, "phrase": "indexing_scheme"}, {"score": 0.0024503741901918527, "phrase": "performance_improvement"}, {"score": 0.002344655708000408, "phrase": "previously_unexplored_parameters"}, {"score": 0.0022107428653358715, "phrase": "enhanced_framework"}, {"score": 0.002125735077004312, "phrase": "accuracy_results"}, {"score": 0.0021049977753042253, "phrase": "standard_benchmarks"}], "paper_keywords": ["Image classification", " image retrieval", " indexing"], "paper_abstract": "This paper deals with content-based large-scale image retrieval using the state-of-the-art framework of VLAD and Product Quantization proposed by Jegou et al. [1] as a starting point. Demonstrating an excellent accuracy-efficiency trade-off, this framework has attracted increased attention from the community and numerous extensions have been proposed. In this work, we make an in-depth analysis of the framework that aims at increasing our understanding of its different processing steps and boosting its overall performance. Our analysis involves the evaluation of numerous extensions (both existing and novel) as well as the study of the effects of several unexplored parameters. We specifically focus on: a) employing more efficient and discriminative local features; b) improving the quality of the aggregated representation; and c) optimizing the indexing scheme. Our thorough experimental evaluation provides new insights into extensions that consistently contribute, and others that do not, to performance improvement, and sheds light onto the effects of previously unexplored parameters of the framework. As a result, we develop an enhanced framework that significantly outperforms the previous best reported accuracy results on standard benchmarks and is more efficient.", "paper_title": "A Comprehensive Study Over VLAD and Product Quantization in Large-Scale Image Retrieval", "paper_id": "WOS:000344720200019"}