{"auto_keywords": [{"score": 0.04945866963669641, "phrase": "overall_spl"}, {"score": 0.048846087603041044, "phrase": "spl_range"}, {"score": 0.04844170546569224, "phrase": "western_contemporary_popular_singing"}, {"score": 0.04744460828753238, "phrase": "body_movement"}, {"score": 0.00481495049065317, "phrase": "voluntary_restraint_of_body_movement"}, {"score": 0.004413846562278824, "phrase": "sound_pressure_level"}, {"score": 0.003958937342925219, "phrase": "six_professional_singers"}, {"score": 0.0031984060035955292, "phrase": "spl_levels"}, {"score": 0.0030888830649190282, "phrase": "absolute_range"}, {"score": 0.0029961221584602405, "phrase": "spl_minima"}, {"score": 0.002855934865505357, "phrase": "spl_maxima"}, {"score": 0.0026062133750675894, "phrase": "compensatory_effect"}, {"score": 0.0025723630851105304, "phrase": "overall_reduction"}, {"score": 0.0025500421061573084, "phrase": "spl."}, {"score": 0.0024519545383399773, "phrase": "conscious_control"}, {"score": 0.0022472527731744974, "phrase": "movement_restraint"}, {"score": 0.0021987994275190314, "phrase": "verbal_directions"}, {"score": 0.002151388538895855, "phrase": "detrimental_effects"}, {"score": 0.002132711053003407, "phrase": "acoustic_output"}, {"score": 0.0021049977753042253, "phrase": "experienced_singers"}], "paper_keywords": [""], "paper_abstract": "Voluntary restriction of body movement is associated with the reduction of sound pressure level (SPL) peaks in western contemporary popular singing. This paper investigated whether overall SPL and SPL range are affected when singers voluntarily restrain their movement during performance. Six professional singers performed a section of a song in two performance modes: first with no constraints placed on their body behaviour and again when directed to stand still. Overall SPL and SPL range were compared for the two conditions. The calculation of percentiles revealed reductions in SPL in the no movement condition across all SPL levels for all singers. With respect to absolute range, contrary to expectation, the SPL minima were reduced by a degree equivalent to the reduction in SPL maxima in the majority of singers. To our knowledge, this phenomenon has not been noted previously, possibly because this compensatory effect disguises the overall reduction in SPL. This effect may be automatic and beyond the conscious control of singers. It remains to be studied whether this effect exists in other styles of singing and what aspect of movement restraint triggers this effect. Verbal directions curbing body movement may have detrimental effects on acoustic output even in experienced singers.", "paper_title": "Voluntary Restraint of Body Movement Potentially Reduces Overall SPL Without Reducing SPL Range in Western Contemporary Popular Singing", "paper_id": "WOS:000299783600007"}