{"auto_keywords": [{"score": 0.04707862248234479, "phrase": "academic_impact"}, {"score": 0.00481495049065317, "phrase": "research_quality"}, {"score": 0.0047707093928203, "phrase": "academic_researchers"}, {"score": 0.0041154571996523505, "phrase": "academic_article"}, {"score": 0.0036328561748082138, "phrase": "well-cited_paper"}, {"score": 0.0031045562469735307, "phrase": "researcher's_work"}, {"score": 0.0029234476524900794, "phrase": "citation_network"}, {"score": 0.002896535621940078, "phrase": "academic_papers"}, {"score": 0.0026775328564629577, "phrase": "lobby_index"}, {"score": 0.0024750474634399797, "phrase": "complex_network"}, {"score": 0.0023741093119014436, "phrase": "focal_node"}, {"score": 0.002352242329148423, "phrase": "direct_link"}, {"score": 0.0022355167967736326, "phrase": "proposed_h"}], "paper_keywords": ["H-index", " Lobby index", " Academic influence"], "paper_abstract": "This paper proposes h(l) -index as an improvement of the h-index, a popular measurement for the research quality of academic researchers. Although the h-index integrates the number of publications and the academic impact of each publication to evaluate the productivity of a researcher, it assumes that all papers that cite an academic article contribute equally to the academic impact of this article. This assumption, of course, could not be true in most times. The citation from a well-cited paper certainly brings more attention to the article than the citation from a paper that people do not pay attention to. It therefore becomes important to integrate the impact of papers that cite a researcher's work into the evaluation of the productivity of the researcher. Constructing a citation network among academic papers, this paper therefore proposes h(l) -index that integrating the h-index with the concept of lobby index, a measures that has been used to evaluate the impact of a node in a complex network based on the impact of other nodes that the focal node has direct link with. This paper also explores the characteristics of the proposed h (l) -index by comparing it with citations, h-index and its variant g-index.", "paper_title": "The H-l -index: improvement of H-index based on quality of citing papers", "paper_id": "WOS:000330622600014"}