{"auto_keywords": [{"score": 0.04854911147289717, "phrase": "ols"}, {"score": 0.015719626451275007, "phrase": "protein-ligand_interactions"}, {"score": 0.01068149565215001, "phrase": "statistical_performance"}, {"score": 0.004780334370089564, "phrase": "quantum_chemical_charge_models"}, {"score": 0.004495922204117959, "phrase": "scoring_functions"}, {"score": 0.004063741692442559, "phrase": "even_the_choice"}, {"score": 0.003891430578662587, "phrase": "atomic_charges"}, {"score": 0.0038218004095195183, "phrase": "central_importance"}, {"score": 0.003766991006640731, "phrase": "electrostatic_interaction"}, {"score": 0.0036862417490612673, "phrase": "key_contributing_factor"}, {"score": 0.0036597104126905437, "phrase": "biomolecular_association"}, {"score": 0.0034541965053691307, "phrase": "simple_gasteiger_method"}, {"score": 0.0033557940171476683, "phrase": "considerable_interest"}, {"score": 0.0029893555436625342, "phrase": "austin"}, {"score": 0.002852134080296829, "phrase": "atomic_partial_charges"}, {"score": 0.0027808699346360656, "phrase": "different_charge_models"}, {"score": 0.002682133505994396, "phrase": "robust_regression_analysis"}, {"score": 0.0026628098176168682, "phrase": "outlier_exclusion"}, {"score": 0.0024770482478966896, "phrase": "lowest_root-mean-squared_error"}, {"score": 0.002423882939663573, "phrase": "training_set"}, {"score": 0.002363293825140551, "phrase": "external_test_set"}, {"score": 0.0022958971655679832, "phrase": "pose_prediction"}, {"score": 0.002198380879018061, "phrase": "predicted_root-mean-squared_deviation"}, {"score": 0.00213567715613494, "phrase": "success_rates"}], "paper_keywords": [""], "paper_abstract": "Ordinary least-squares (OLS) regression has been used widely for constructing the scoring functions for protein-ligand interactions. However, OLS is very sensitive to the existence of outliers, and models constructed using it are easily affected by the outliers or even the choice of the data set. On the other hand, determination of atomic charges is regarded as of central importance, because the electrostatic interaction is known to be a key contributing factor for biomolecular association. In the development of the AutoDock4 scoring function, only OLS was conducted, and the simple Gasteiger method was adopted. It is therefore of considerable interest to see whether more rigorous charge models could improve the statistical performance of the AutoDock4 scoring function. In this study, we have employed two well-established quantum chemical approaches, namely the restrained electrostatic potential (RESP) and the Austin-model 1-bond charge correction (AM1-BCC) methods, to obtain atomic partial charges, and we have compared how different charge models affect the performance of AutoDock4 scoring functions. In combination with robust regression analysis and outlier exclusion, our new protein-ligand free energy regression model with AM1-BCC charges for ligands and Amber99SB charges for proteins achieve lowest root-mean-squared error of 1.637 kcal/mol for the training set of 147 complexes and 2.176 kcal/mol for the external test set of 1427 complexes. The assessment for binding pose prediction with the 100 external decoy sets indicates very high success rate of 87% with the criteria of predicted root-mean-squared deviation of less than 2 angstrom. The success rates and statistical performance of our robust scoring functions are only weakly class-dependent (hydrophobic, hydrophilic, or mixed).", "paper_title": "Robust Scoring Functions for Protein-Ligand Interactions with Quantum Chemical Charge Models", "paper_id": "WOS:000296044200009"}