{"auto_keywords": [{"score": 0.049561472167574505, "phrase": "cognitive_radio_parameters"}, {"score": 0.00481495049065317, "phrase": "collaborative_adaptation"}, {"score": 0.0045108906244892165, "phrase": "main_objective"}, {"score": 0.00349324530379071, "phrase": "web_ontology_language"}, {"score": 0.003115908199991072, "phrase": "common_language"}, {"score": 0.003032228032253871, "phrase": "policy_rules"}, {"score": 0.00295078850927459, "phrase": "declarative_form"}, {"score": 0.0024923577071656014, "phrase": "conventional_protocol-predefined_signaling_plan"}, {"score": 0.0023602032679095955, "phrase": "extendable_payload"}, {"score": 0.0022718774783143203, "phrase": "predefined_protocol-dependent_header"}, {"score": 0.0021049977753042253, "phrase": "radio_behaviors"}], "paper_keywords": ["Software defined radio", " Cognitive radio", " Ontology", " Semantic web", " Policy", " Adaptation", " GNU radio"], "paper_abstract": "The main objective of this paper is to demonstrate the feasibility of the ontology and policy based approach to realize collaborative, automatic adaptation of cognitive radio parameters in the transmitter and receiver. The ontology and policy based approach features the following three aspects. First, all the internal and external information of the radio is represented in the Web Ontology Language (OWL). The transmitter and receiver share the same core ontology and thus can communicate with each other using this common language. Second, the policy rules are written in a declarative form and interpreted by a reasoner. Third, in order to exchange the OWL represented information between the radios, we adopt a more flexible signaling plan, which is different than the conventional protocol-predefined signaling plan, i.e. the control messages are added to an extendable payload, rather than embedded in the predefined protocol-dependent header or trailer. The paper discusses the implementation and shows some examples of radio behaviors resulting from the execution of the policies.", "paper_title": "An implementation of collaborative adaptation of cognitive radio parameters using an ontology and policy based approach", "paper_id": "WOS:000298632200016"}