{"auto_keywords": [{"score": 0.038880200368473436, "phrase": "effective_model"}, {"score": 0.02781620449991369, "phrase": "graph_models"}, {"score": 0.014801583914074235, "phrase": "untyped_lambda-calculus"}, {"score": 0.011057876852346873, "phrase": "order_theory"}, {"score": 0.00481495049065317, "phrase": "recursively_enumerable_lambda-theories"}, {"score": 0.004742290714667451, "phrase": "longstanding_open_problem"}, {"score": 0.004600228893803583, "phrase": "non-syntactical_model"}, {"score": 0.002840708910768261, "phrase": "stable_or_strongly_stable_semantics"}, {"score": 0.002713788077665689, "phrase": "scott's_semantics"}, {"score": 0.0025146979283050923, "phrase": "graph_model"}, {"score": 0.0023780209525032688, "phrase": "effective_graph_model"}, {"score": 0.0021049977753042253, "phrase": "downwards_lowenheim-skolem_theorem"}], "paper_keywords": [""], "paper_abstract": "A longstanding open problem is whether there exists a non-syntactical model of the untyped lambda-calculus whose theory is exactly the least lambda-theory lambda(beta). In this paper we investigate the more general question of whether the equational/order theory of a model of the untyped lambda-calculus can be recursively enumerable (r.e. for short). We introduce a notion of effective model of lambda-calculus, which covers, in particular, all the models individually introduced in the literature. We prove that the order theory of an effective model is never r.e.; from this it follows that its equational theory cannot be lambda(beta) or lambda(beta eta). We then show that no effective model living in the stable or strongly stable semantics has an r.e. equational theory. For Scott's semantics, we investigate the class of graph models and prove that no order theory of a graph model can be ne., and that there exists an effective graph model whose equational/order theory is the minimum among the theories of graph models. Finally, we show that the class of graph models enjoys a kind of downwards Lowenheim-Skolem theorem.", "paper_title": "Effective lambda-models versus recursively enumerable lambda-theories", "paper_id": "WOS:000270845400002"}