{"auto_keywords": [{"score": 0.04401349045433906, "phrase": "original_version"}, {"score": 0.015719716506582538, "phrase": "user-centered_research"}, {"score": 0.014933602113301983, "phrase": "clinical_trials"}, {"score": 0.013246819415503973, "phrase": "revised_version"}, {"score": 0.00476527679607755, "phrase": "clinical_trial_ehealth_tool"}, {"score": 0.004732444672509326, "phrase": "counterbalanced_research_design"}, {"score": 0.004699837689671504, "phrase": "objective_informatics_applications"}, {"score": 0.0043555900164106934, "phrase": "fully_counterbalanced_experimental_design"}, {"score": 0.003994780550602818, "phrase": "patients'_needs"}, {"score": 0.003939880387831148, "phrase": "design_participants"}, {"score": 0.0038456073694665, "phrase": "breast_cancer_diagnosis"}, {"score": 0.003551392586900308, "phrase": "redesigned_version"}, {"score": 0.0034305738274625634, "phrase": "reverse_order"}, {"score": 0.0033023994098455457, "phrase": "participants'_click_paths"}, {"score": 0.0031352744329834676, "phrase": "survey_items"}, {"score": 0.003113637673848439, "phrase": "open-ended_questions"}, {"score": 0.002564682311144514, "phrase": "similar_attitudes"}, {"score": 0.0024945743145462144, "phrase": "research_findings"}, {"score": 0.002426378123762607, "phrase": "clinical_trial_searching"}, {"score": 0.0023114798074455453, "phrase": "patients'_decisions"}, {"score": 0.002119640369431708, "phrase": "personal_control"}, {"score": 0.0021049977753042253, "phrase": "decisional_autonomy"}], "paper_keywords": [""], "paper_abstract": "Objective Informatics applications have the potential to improve participation in clinical trials, but their design must be based on user-centered research. This research used a fully counterbalanced experimental design to investigate the effect of changes made to the original version of a website, http://BreastCancerTrials.org/, and confirm that the revised version addressed and reinforced patients' needs and expectations. Design Participants included women who had received a breast cancer diagnosis within the last 5 years (N=77). They were randomized into two groups: one group used and reviewed the original version first followed by the redesigned version, and the other group used and reviewed them in reverse order. Measurements The study used both quantitative and qualitative measures. During use, participants' click paths and general reactions were observed. After use, participants were asked to answer survey items and open-ended questions to indicate their reactions and which version they preferred and met their needs and expectations better. Results Overall, the revised version of the site was preferred and perceived to be clearer, easier to navigate, more trustworthy and credible, and more private and safe overall. However, users who viewed the original version last had similar attitudes toward both versions. Conclusion By applying research findings to the redesign of a website for clinical trial searching, it was possible to re-engineer the interface to better support patients' decisions to participate in clinical trials. The mechanisms of action in this case appeared to revolve around creating an environment that supported a sense of personal control and decisional autonomy.", "paper_title": "Assessing the impact of user-centered research on a clinical trial eHealth tool via counterbalanced research design", "paper_id": "WOS:000289218000005"}