{"auto_keywords": [{"score": 0.03182678736309615, "phrase": "steady_state_failure_rate"}, {"score": 0.00481495049065317, "phrase": "software_products"}, {"score": 0.004136044939878838, "phrase": "failure_rate"}, {"score": 0.004077508669922702, "phrase": "software_product"}, {"score": 0.00370780481244907, "phrase": "simple_model"}, {"score": 0.0035189057079817285, "phrase": "initial_transient_failure_rate"}, {"score": 0.0032149396890830575, "phrase": "product_reliability"}, {"score": 0.0031244995579170435, "phrase": "transient_failure_rate"}, {"score": 0.002881793492919646, "phrase": "model-initial_transient_failure_rate"}, {"score": 0.002696101728474703, "phrase": "sales_data"}, {"score": 0.0021049977753042253, "phrase": "released_products"}], "paper_keywords": ["reliability", " post-release reliability growth", " product stabilization time"], "paper_abstract": "Most software reliability growth models work under the assumption that reliability of software grows due to the removal of bugs that cause failures. However, another phenomenon has often been observed-the failure rate of a software product following its release decreases with time even if no bugs are corrected. In this article we present a simple model to represent this phenomenon. We introduce the concept of initial transient failure rate of the product and assume that it decays with a factor a per unit time thereby increasing the product reliability with time. When the transient failure rate decays away, the product displays a steady state failure rate. We discuss how the parameters in this model-initial transient failure rate, decay factor, and steady state failure rate can be determined from the failure and sales data of a product. We also describe how, using the model, we can determine the product stabilization time-a product quality metric that describes how long it takes a product to reach close to its stable failure rate. We provide many examples where this model has been applied to data from released products.", "paper_title": "Post-release reliability growth in software products", "paper_id": "WOS:000259433600001"}