{"auto_keywords": [{"score": 0.034265534762842755, "phrase": "measurable_requirements"}, {"score": 0.00481495049065317, "phrase": "measurable_goal-oriented_requirements"}, {"score": 0.004732444672509326, "phrase": "proved_fact"}, {"score": 0.004683618147754759, "phrase": "appropriate_management"}, {"score": 0.004493275458211613, "phrase": "software_development_projects"}, {"score": 0.004207527897084009, "phrase": "necessary_degree"}, {"score": 0.003994780550602818, "phrase": "requirements_metamodels"}, {"score": 0.003926273177600597, "phrase": "great_disparity"}, {"score": 0.0037927494831151553, "phrase": "underlying_semantics"}, {"score": 0.0035147084172295123, "phrase": "validation_methods"}, {"score": 0.0033484464719654105, "phrase": "\"measurable_requirements_metamodel"}, {"score": 0.003157061070428828, "phrase": "explicit_connection"}, {"score": 0.0030285690317007805, "phrase": "goal-driven_measurable_requirements_engineering"}, {"score": 0.002845541839157798, "phrase": "abstract_syntax"}, {"score": 0.0028161281608563267, "phrase": "modeling_language"}, {"score": 0.0027870176748502045, "phrase": "proposed_metamodel"}, {"score": 0.0026004698404274483, "phrase": "goal-oriented_requirements_language"}, {"score": 0.0024945743145462144, "phrase": "unified_modeling_language"}, {"score": 0.002368233914089849, "phrase": "uml-based_software_engineering_process"}, {"score": 0.0023034836169432233, "phrase": "eclipse_tool"}, {"score": 0.0021943920257952174, "phrase": "driving_force"}, {"score": 0.0021049977753042253, "phrase": "wiley_periodicals"}], "paper_keywords": [""], "paper_abstract": "It is a proved fact that the appropriate management of requirements is one of the most influential factors in the success of software development projects. With the advent of the model-driven engineering (MDE) development paradigm, the need for formal gathering mechanisms, which provide the necessary degree of nonambiguity and detail, has led to the proposal of a myriad of requirements metamodels. However, a great disparity exists, both in the concepts/relationships and in the underlying semantics involved in each metamodel. Moreover, most existing proposals lack backward (e.g., alignment with business goals) or forward (e.g., connection with validation methods) traceability. In view of this situation, this article proposes a \"measurable requirements metamodel\" that offers support to the elicitation of measurable requirements. This support is based on the explicit connection of goals, requirements, and measures, thus fostering a goal-driven measurable requirements engineering (RE) perspective. Additionally, since it is well known that metamodels only reflect the abstract syntax of the modeling language, the proposed metamodel also includes a notation (concrete syntax) which, for reasons of understandability, is based on the goal-oriented requirements language (GRL) notation. This notation is supported by a unified modeling language (UML) profile that facilitates its adoption by RE analysts in the context of any UML-based software engineering process. To support this proposal, an Eclipse tool has been developed. This tool permits the integration of measurable requirements as a driving force in the context of a given MDE development process. (c) 2010 Wiley Periodicals, Inc.", "paper_title": "An MDE Modeling Framework for Measurable Goal-Oriented Requirements", "paper_id": "WOS:000279740100004"}