{"auto_keywords": [{"score": 0.049607495758152896, "phrase": "functional_magnetic_resonance_imaging_data"}, {"score": 0.030923053106664926, "phrase": "adhd"}, {"score": 0.00481495049065317, "phrase": "deficit_hyperactivity_disorder_classification"}, {"score": 0.004605258779434384, "phrase": "brain_diseases"}, {"score": 0.004537401559396022, "phrase": "tremendous_value"}, {"score": 0.004448471107649881, "phrase": "attention_deficit_hyperactivity_disorder"}, {"score": 0.0043183186953102805, "phrase": "diverse_spectrum_disorder"}, {"score": 0.004029187256595917, "phrase": "objective_neuroimaging_measures"}, {"score": 0.0038919354605673104, "phrase": "international_competition"}, {"score": 0.0033379819706003885, "phrase": "fully_connected_cascade"}, {"score": 0.003038066486989815, "phrase": "better_classification_accuracy"}, {"score": 0.002993231973906559, "phrase": "raw_data"}, {"score": 0.0028911669203979156, "phrase": "healthy_subjects"}, {"score": 0.002806449337145999, "phrase": "adhd_subtypes"}, {"score": 0.002618278365749875, "phrase": "fcc_ann"}, {"score": 0.002504011301105577, "phrase": "support_vector_machines"}, {"score": 0.002147180332779021, "phrase": "left_orbitofrontal_cortex"}, {"score": 0.0021049987157870202, "phrase": "adhd."}], "paper_keywords": ["Artificial neural networks (ANNs)", " attention deficit hyperactivity disorder (ADHD)", " classification", " functional magnetic resonance imaging (fMRI)", " support vector machines (SVMs)"], "paper_abstract": "Automated recognition and classification of brain diseases are of tremendous value to society. Attention deficit hyperactivity disorder (ADHD) is a diverse spectrum disorder whose diagnosis is based on behavior and hence will benefit from classification utilizing objective neuroimaging measures. Toward this end, an international competition was conducted for classifying ADHD using functional magnetic resonance imaging data acquired from multiple sites worldwide. Here, we consider the data from this competition as an example to illustrate the utility of fully connected cascade (FCC) artificial neural network (ANN) architecture for performing classification. We employed various directional and nondirectional brain connectivity-based methods to extract discriminative features which gave better classification accuracy compared to raw data. Our accuracy for distinguishing ADHD from healthy subjects was close to 90% and between the ADHD subtypes was close to 95%. Further, we show that, if properly used, FCC ANN performs very well compared to other classifiers such as support vector machines in terms of accuracy, irrespective of the feature used. Finally, the most discriminative connectivity features provided insights about the pathophysiology of ADHD and showed reduced and altered connectivity involving the left orbitofrontal cortex and various cerebellar regions in ADHD.", "paper_title": "Fully Connected Cascade Artificial Neural Network Architecture for Attention Deficit Hyperactivity Disorder Classification From Functional Magnetic Resonance Imaging Data", "paper_id": "WOS:000365320300004"}