{"auto_keywords": [{"score": 0.046591905845561485, "phrase": "preliminary_analysis"}, {"score": 0.034692465572853035, "phrase": "membership_values"}, {"score": 0.004682917599491709, "phrase": "driver_overtaking_behavior"}, {"score": 0.0045726187330434025, "phrase": "key_role"}, {"score": 0.004290969772225093, "phrase": "general_case"}, {"score": 0.004206548500039536, "phrase": "quantitative_or_qualitative_measurement_variables"}, {"score": 0.0039005612858880115, "phrase": "mfmv_aspects"}, {"score": 0.00385431710959668, "phrase": "data_structure"}, {"score": 0.003808619097554076, "phrase": "windowing_approach"}, {"score": 0.003559675269411366, "phrase": "basic_non-windowing_summarizing_procedures"}, {"score": 0.002917604283241353, "phrase": "multiple_correspondence_analysis"}, {"score": 0.0028944946783525105, "phrase": "mca"}, {"score": 0.002737615043512257, "phrase": "didactic_example"}, {"score": 0.002694375425481759, "phrase": "simulated_data_set"}, {"score": 0.0025180781216911246, "phrase": "multidimensional_signals"}, {"score": 0.0023439376937579204, "phrase": "large_real_database"}, {"score": 0.0022977342663599042, "phrase": "discussion_section"}, {"score": 0.002138799283553239, "phrase": "large_mfmv_database"}, {"score": 0.0021049977753042253, "phrase": "human_component_systems"}], "paper_keywords": ["Driving simulation", " fuzzy sets", " knowledge discovery", " multiple correspondence analysis (MCA)", " overtaking behavior", " segmentation", " windowing"], "paper_abstract": "This paper explains the key role played by windowing in the preliminary analysis of multifactor and multivariate (MFMV) databases. The explanation is based on the general case of a database featuring quantitative or qualitative measurement variables and a hyperparallelepipedic structure in which the directions correspond to the factors. In order to maintain the MFMV aspects of this data structure, the windowing approach as described in this paper does not reduce the information as much as most of the basic non-windowing summarizing procedures using the standard statistical indicators. First, the data in each cell of the hyperparallelepiped are transformed into membership values that can be averaged over factors, such as time or individuals. Then, these membership values may be potentially investigated into with several graphic techniques; for this paper, multiple correspondence analysis (MCA) was chosen. The presentation fall into two parts. First, a didactic example based on a simulated data set describes the approach in comparison with more traditional approaches, and then a real data set, with multidimensional signals recorded for 34 subjects in 15 experimental overtaking situations, is used to demonstrate the power of the \"space windowing/MCA\" pair on a large real database. Next, the discussion section weighs out the pros and the cons of using space windowing to perform a preliminary analysis of a large MFMV database in studies of human component systems.", "paper_title": "Fuzzy Segmentation for the Exploratory Analysis of Multidimensional Signals: Example From a Study on Driver Overtaking Behavior", "paper_id": "WOS:000294134300008"}