{"auto_keywords": [{"score": 0.03838746067133845, "phrase": "hsdpa"}, {"score": 0.013904853607488521, "phrase": "shannon_bound"}, {"score": 0.00446987606516801, "phrase": "turbo_decoders"}, {"score": 0.004342430078306461, "phrase": "optimal_decoders"}, {"score": 0.00418387341007444, "phrase": "awgn_channels"}, {"score": 0.004014452814186653, "phrase": "entire_wireless_systems"}, {"score": 0.00371115485111022, "phrase": "closer_look"}, {"score": 0.0036806056389660875, "phrase": "wimax"}, {"score": 0.0034024277222012597, "phrase": "physical_layer_throughput"}, {"score": 0.0032242793143795454, "phrase": "high-quality_equipment"}, {"score": 0.0031977096047057898, "phrase": "different_antenna_configurations"}, {"score": 0.002883439044844259, "phrase": "e._g."}, {"score": 0.002836096284133166, "phrase": "guard_carriers"}, {"score": 0.002755104031926742, "phrase": "channel_estimation"}, {"score": 0.0025785359740308337, "phrase": "available_channel_capacity"}, {"score": 0.0024638070701636055, "phrase": "shannon"}, {"score": 0.0024333239726872604, "phrase": "typical_operational_points"}, {"score": 0.002363806685815014, "phrase": "potential_improvement"}, {"score": 0.002315367926547472, "phrase": "advanced_four_transmit_antenna_configurations"}], "paper_keywords": [""], "paper_abstract": "Cellular wireless systems have made impressive progress over the past two decades. They currently connect more than five billion people worldwide. With the advent of turbo decoders in the 1990s, the design of optimal decoders very close to the Shannon bound became possible in AWGN channels. Nowadays many researchers believe that this is true for entire wireless systems and that therefore there is not much left to investigate. In this contribution, we take a closer look at WiMAX and HSDPA, two successful cellular systems being operated currently in many countries, and check their truly achievable performance. We have measured the physical layer throughput of WiMAX and HSDPA in various realistic environments (urban and mountainous) with high-quality equipment and different antenna configurations. We furthermore compared the throughput measured to the Shannon bound. Based on our measurements, we analyze the losses in design and implementation (e. g., pilots, guard carriers, coding, equalization, and channel estimation) and report our findings. Surprisingly, we are currently only utilizing 40 percent of the available channel capacity; or roughly equivalently, we are up to 10 dB off the Shannon bound at typical operational points, thus providing a lot of potential improvement for future 4G systems. In advanced four transmit antenna configurations of HSDPA, the losses are even more pronounced, showing that our current standards are not well suited to take advantage of the much higher capacity provided.", "paper_title": "CELLULAR SYSTEM PHYSICAL LAYER THROUGHPUT: HOW FAR OFF ARE WE FROM THE SHANNON BOUND?", "paper_id": "WOS:000298382300009"}