{"auto_keywords": [{"score": 0.0355691858622509, "phrase": "information_studies"}, {"score": 0.00481495049065317, "phrase": "tracing_information_practices"}, {"score": 0.004593591780245872, "phrase": "information_behavior"}, {"score": 0.004359500411441827, "phrase": "essential_role"}, {"score": 0.004246947739596565, "phrase": "differentiation_point"}, {"score": 0.004202741104973709, "phrase": "contemporary_approaches"}, {"score": 0.003988487841970088, "phrase": "major_difficulty"}, {"score": 0.003926359151817743, "phrase": "information_practices"}, {"score": 0.0038049789989278463, "phrase": "user-centered_paradigm"}, {"score": 0.003554661425339528, "phrase": "emerging_context-centered_approaches"}, {"score": 0.0026233771102489394, "phrase": "endless_debate"}, {"score": 0.0025824576209656676, "phrase": "research_focus"}, {"score": 0.0022772115643656153, "phrase": "ib_research"}, {"score": 0.0022299587520401747, "phrase": "actor-network_theory"}], "paper_keywords": ["knowledge"], "paper_abstract": "A constant shifting between two main tenets of the information behavior (IB) fieldcentrality of the user and the essential role of contexthas become a differentiation point for contemporary approaches in the field, but it also poses a major difficulty in tracing information practices. On one side, the user-centered paradigm asks researchers to focus on the individual; on the other, emerging context-centered approaches move the position of context into the foreground of information studies. Although there have been attempts to create in between approaches to achieve a compromise between these two positions, they have merely generated more positions between the two poles in a continuum between approaches focusing on the individual and those focusing on context. Such positioning not only creates an endless debate about the research focus of information studies but also limits such studies to a set of factors, a priori defined by the researcher. This article argues that IB research could benefit from actor-network theory, which could give the actors a space to perform their own positioning.", "paper_title": "Jumping Between Context and Users: A Difficulty in Tracing Information Practices", "paper_id": "WOS:000344225200005"}