{"auto_keywords": [{"score": 0.031866454050818054, "phrase": "signal-to-noise_ratio"}, {"score": 0.00481495049065317, "phrase": "ergodic_interference_alignment"}, {"score": 0.004682708592184678, "phrase": "new_communication_strategy"}, {"score": 0.0045119929871912405, "phrase": "k-user_interference_channel"}, {"score": 0.00432733352307636, "phrase": "particular_time"}, {"score": 0.00413096972023037, "phrase": "transmitted_signals"}, {"score": 0.004036141321779216, "phrase": "standard_approach"}, {"score": 0.0039252049353279556, "phrase": "transmitter-receiver_pair"}, {"score": 0.003610292749660581, "phrase": "interfering_users"}, {"score": 0.00321425262806329, "phrase": "channel_gains"}, {"score": 0.002523828967909659, "phrase": "\"x_channel\"_case"}, {"score": 0.002397923568994474, "phrase": "independent_message"}, {"score": 0.0022258906408344973, "phrase": "gaussian_channel_models"}, {"score": 0.0021646022201798247, "phrase": "finite_field_interference_channels"}, {"score": 0.0021049977753042253, "phrase": "ergodic_capacity_region"}], "paper_keywords": ["Interference alignment", " interference channels", " time-varying channels"], "paper_abstract": "This paper develops a new communication strategy, ergodic interference alignment, for the K-user interference channel with time-varying fading. At any particular time, each receiver will see a superposition of the transmitted signals plus noise. The standard approach to such a scenario results in each transmitter-receiver pair achieving a rate proportional to 1/K its interference-free ergodic capacity. However, given two well-chosen time indices, the channel coefficients from interfering users can be made to exactly cancel. By adding up these two observations, each receiver can obtain its desired signal without any interference. If the channel gains have independent, uniform phases, this technique allows each user to achieve at least 1/2 its interference-free ergodic capacity at any signal-to-noise ratio. Prior interference alignment techniques were only able to attain this performance as the signal-to-noise ratio tended to infinity. Extensions are given for the case where each receiver wants a message from more than one transmitter as well as the \"X channel\" case (with two receivers) where each transmitter has an independent message for each receiver. Finally, it is shown how to generalize this strategy beyond Gaussian channel models. For a class of finite field interference channels, this approach yields the ergodic capacity region.", "paper_title": "Ergodic Interference Alignment", "paper_id": "WOS:000308965600007"}