{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "frame-based_image_restoration"}, {"score": 0.004571133708117502, "phrase": "balanced_approach"}, {"score": 0.004141238989360548, "phrase": "proximal_forward-backward_splitting_algorithm"}, {"score": 0.004034976518180532, "phrase": "nesterov"}, {"score": 0.003993221687300759, "phrase": "nemirovski"}, {"score": 0.0036363418376496484, "phrase": "machine_learning"}, {"score": 0.0034162643819889054, "phrase": "apg_algorithm"}, {"score": 0.0030625949549620475, "phrase": "epsilon-optimal_solution"}, {"score": 0.0029530125680590413, "phrase": "single_algorithmic_framework"}, {"score": 0.0028325548627901004, "phrase": "image_deblurring"}, {"score": 0.0027311809666295565, "phrase": "cartoon-texture_decomposition"}, {"score": 0.0026471739851621143, "phrase": "apg_algorithms"}, {"score": 0.0025524176761139413, "phrase": "large-scale_image_restoration_problems"}, {"score": 0.002324007171619245, "phrase": "modest_pc."}, {"score": 0.0022642601698943687, "phrase": "numerical_performance"}, {"score": 0.0021945833590668973, "phrase": "restoration_problems"}, {"score": 0.0021049977753042253, "phrase": "cartoon_and_texture_systems"}], "paper_keywords": ["balanced approach", " analysis based approach", " synthesis based approach", " image restoration", " iteration complexity", " l(1)-regularized convex minimization", " proximal gradient algorithms"], "paper_abstract": "Frame-based image restoration by using the balanced approach has been developed over the last decade. Many recently developed algorithms for image restoration can be viewed as an acceleration of the proximal forward-backward splitting algorithm. Accelerated proximal gradient (APG) algorithms studied by Nesterov, Nemirovski, and others have been demonstrated to be efficient in solving various regularized convex optimization problems arising in compressed sensing, machine learning, and control. In this paper, we adapt the APG algorithm to solve the l(1)-regularized linear least squares problem in the balanced approach in frame-based image restoration. This algorithm terminates in O(1/v root epsilon) iterations with an epsilon-optimal solution, and we demonstrate that this single algorithmic framework can universally handle several image restoration problems, such as image deblurring, denoising, inpainting, and cartoon-texture decomposition. Our numerical results suggest that the APG algorithms are efficient and robust in solving large-scale image restoration problems. The algorithms we implemented are able to restore 512 x 512 images in various image restoration problems in less than 50 seconds on a modest PC. We also compare the numerical performance of our proposed algorithms applied to image restoration problems by using one frame-based system with that by using cartoon and texture systems for image deblurring, denoising, and inpainting.", "paper_title": "An Accelerated Proximal Gradient Algorithm for Frame-Based Image Restoration via the Balanced Approach", "paper_id": "WOS:000292131200003"}