{"auto_keywords": [{"score": 0.03252422696923042, "phrase": "robust_set"}, {"score": 0.00481495049065317, "phrase": "disease_classification_forests"}, {"score": 0.004754600386388821, "phrase": "multiple_biological_pathways"}, {"score": 0.004217537792708984, "phrase": "disease-relevant_biological_processes"}, {"score": 0.003984665807155269, "phrase": "microarray_gene_expression_data"}, {"score": 0.0036246643358397272, "phrase": "exact_set"}, {"score": 0.003174464741377186, "phrase": "novel_method"}, {"score": 0.0023438664524018634, "phrase": "higher_accuracy"}, {"score": 0.0022142194702079866, "phrase": "disease-relevant_pathways"}, {"score": 0.0021589195238286233, "phrase": "alternative_strategies"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Biological pathway", " Pattern mining", " Random forests", " Disease phenotype"], "paper_abstract": "Multiple biological pathways often work together to determine a given disease phenotype. Understanding what these pathways are and how they cooperate in disease-relevant biological processes is critical to our understanding of diseases. Using microarray gene expression data, researchers have developed several methods to rank pathways by their disease relevance. However, the exact set of pathways involved and how they are involved under given disease conditions remain unclear. In this paper, we propose a novel method to first select a robust set of pathways that together best classify a given disease, and then investigate how genes in these pathways interact to determine the phenotype. By applying our method to several disease related microarray gene expression datasets, we detected many disease-relevant interaction patterns supported by evidence from the literature. Our algorithm also achieves higher accuracy in terms of identification of a robust set of disease-relevant pathways when compared with alternative strategies. Published by Elsevier Inc.", "paper_title": "Mining patterns in disease classification forests", "paper_id": "WOS:000281927200019"}