{"auto_keywords": [{"score": 0.04875986484857526, "phrase": "cubic_corner_method"}, {"score": 0.027119878627753308, "phrase": "optimisation-based_method"}, {"score": 0.026492196013786416, "phrase": "hybrid_method"}, {"score": 0.004120694410890683, "phrase": "comprehensive_test_results"}, {"score": 0.003850173884725567, "phrase": "accurate_drawings"}, {"score": 0.0038043055953253047, "phrase": "inaccurate_drawings"}, {"score": 0.003456427643307904, "phrase": "human_perception"}, {"score": 0.0032423089921154503, "phrase": "incorrect_results"}, {"score": 0.003178147973814818, "phrase": "poor_initial_values"}, {"score": 0.0029693204265884327, "phrase": "initial_guess"}, {"score": 0.0029339151044984134, "phrase": "optimisation_process"}, {"score": 0.0026760974046034854, "phrase": "varying_degrees"}, {"score": 0.0025101968585850474, "phrase": "accurate_inputs"}, {"score": 0.0024901940672239784, "phrase": "good_results"}, {"score": 0.0024408799645640323, "phrase": "poor_results"}, {"score": 0.0023079225317714815, "phrase": "best_results"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["3D object recovery", " Cubic corner", " Inaccurate drawing", " Optimisation", " Parallel projection", " Regularities"], "paper_abstract": "This paper uses a hybrid method to reconstruct 3D polyhedral objects from 20 line drawings by combining two known methods, the cubic corner method and the optimisation-based method, and presents comprehensive test results comparing the three methods. The cubic corner method is deterministic and very efficient. It recovers accurate 3D objects from accurate drawings but for inaccurate drawings, the quality of its results varies with the accuracy of the input. In general, the optimisation-based method produces approximate 3D objects that conform to human perception of the drawings. But it is computationally demanding, and can sometimes converge to incorrect results, partly due to poor initial values for the optimisation. The hybrid method starts with the cubic corner method, and uses its output as the initial guess for the optimisation process, which then produces a better quality 3D object than either method on its own. Tests are conducted for each method using drawings of varying degrees of accuracy. The results of the cubic corner method and the hybrid method are consistent, with accurate inputs producing good results and inaccurate input producing poor results. The results of the optimisation-based method are inconsistent. The hybrid method produces the best results in general, but it is less efficient than the cubic corner method and more efficient than the optimisation-based method. (C) 2012 Elsevier Ltd. All rights reserved.", "paper_title": "A new hybrid method for 3D object recovery from 2D drawings and its validation against the cubic corner method and the optimisation-based method", "paper_id": "WOS:000309304000006"}