{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "food_sector"}, {"score": 0.010147933618907727, "phrase": "food_industry"}, {"score": 0.00415290083567118, "phrase": "quality_and_diversity_consumers"}, {"score": 0.003970013879881066, "phrase": "appropriate_organization"}, {"score": 0.0035017626442279386, "phrase": "communication_technology"}, {"score": 0.0034458553242115073, "phrase": "global_networks"}, {"score": 0.00339083755411773, "phrase": "networked_devices"}, {"score": 0.0033366952764030946, "phrase": "communication_intelligence"}, {"score": 0.003304624380309877, "phrase": "foremost_relevance"}, {"score": 0.003019726786531033, "phrase": "application_domain"}, {"score": 0.002914624187933378, "phrase": "food_products"}, {"score": 0.0026632593674563855, "phrase": "final_customer"}, {"score": 0.0024810246251233195, "phrase": "major_research_and_application_domains"}, {"score": 0.002417887626368368, "phrase": "successful_utilization"}, {"score": 0.002371589020876307, "phrase": "future_internet"}, {"score": 0.002296381861149051, "phrase": "use_cases"}, {"score": 0.002252404639706065, "phrase": "major_improvements"}, {"score": 0.0021669551936989886, "phrase": "large_scale_adoption"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Tracking and tracing", " Networked devices", " Data ownership", " Farming", " Logistics", " Awareness"], "paper_abstract": "The food sector is one of the most important sectors of the economy, encompassing agriculture, the food industry, retail, and eventually, all members of society as consumers. With its responsibility of serving consumers with food that is safe, readily available, affordable and of the quality and diversity consumers expect, the food sector needs to be efficient, to build on an appropriate organization and control of processes, and to provide assurance on the safety and quality of its products which consumers could trust. Efficiency, process control and consumer communications are all closely related to the use of information and communication technology (ICT). Global networks, the internet, networked devices, sensors, and communication intelligence are of foremost relevance for the sustainability of the food sector in meeting its responsibility. This paper provides an overview on the state-of-the-art in three use cases within the application domain of the food sector. The three use cases capture the flow of food products from agriculture (use case 'agriculture') through the food industry (use case 'agri-food logistics') to the consumer as the final customer (use case 'food awareness'). In dealing with the state-of-the-art the paper has to focus on the major research and application domains that are of relevance in assuring the successful utilization of the potential of the future internet for reaching a concept for the organization of the use cases that has the potential for major improvements in coordination and communication activities along the chain but also for large scale adoption throughout the sector. (C) 2012 Elsevier B.V. All rights reserved.", "paper_title": "Future internet and the agri-food sector: State-of-the-art in literature and research", "paper_id": "WOS:000311245300018"}