{"auto_keywords": [{"score": 0.03653716672572335, "phrase": "haptic_feedback"}, {"score": 0.014668575658189022, "phrase": "multimedia_applications"}, {"score": 0.00481495049065317, "phrase": "edutainment_applications"}, {"score": 0.004773040022691547, "phrase": "haptic_technologies"}, {"score": 0.004669845451682529, "phrase": "enormous_attention"}, {"score": 0.004529093447865156, "phrase": "haptic_modality"}, {"score": 0.003903269701018361, "phrase": "user's_sense"}, {"score": 0.0037198532511087566, "phrase": "ambient_intelligent_applications"}, {"score": 0.0035918768194006735, "phrase": "application's_quality_of_experience"}, {"score": 0.0029886047149545025, "phrase": "traditional_visual_and_auditory_feedback"}, {"score": 0.0028731024405707277, "phrase": "stylus-based_haptic_education_applications"}, {"score": 0.0028480459059007468, "phrase": "haptic-enhanced_entertainment_videos"}, {"score": 0.0026321198895843173, "phrase": "force_feedback_haptic_interaction"}, {"score": 0.0025977542995083624, "phrase": "tactile_youtube_application"}, {"score": 0.0025750928944698673, "phrase": "tactile_haptic_feedback"}, {"score": 0.0021049977753042253, "phrase": "overall_qoe"}], "paper_keywords": ["Force feedback evaluation", " Haptics in ambient environments", " Human computer interaction", " Quality of Experience (QoE)", " Tactile evaluation"], "paper_abstract": "Haptic technologies and applications have received enormous attention in the last decade. The incorporation of haptic modality into multimedia applications adds excitement and enjoyment to an application. It also adds a more natural feel to multimedia applications, that otherwise would be limited to vision and audition, by engaging as well the user's sense of touch, giving a more intrinsic feel essential for ambient intelligent applications. However, the improvement of an application's Quality of Experience (QoE) by the addition of haptic feedback is still not completely understood. The research presented in this paper focuses on the effect of haptic feedback and what it potentially adds to the experience of the user as opposed to the traditional visual and auditory feedback. In essence, it investigates certain issues regarding stylus-based haptic education applications and haptic-enhanced entertainment videos. To this end, we used two haptic applications: the haptic handwriting learning tool to experiment with force feedback haptic interaction and the tactile YouTube application for tactile haptic feedback. In both applications, our analysis shows that the addition of haptic feedback will increase the QoE in the absence of fatigue or discomfort for this category of applications. This implies that the incorporation of haptic modality (both force feedback as well as tactile feedback) has positively contributed to the overall QoE for the users.", "paper_title": "Effect of kinesthetic and tactile haptic feedback on the quality of experience of edutainment applications", "paper_id": "WOS:000323435800007"}