{"auto_keywords": [{"score": 0.044111484437312214, "phrase": "hotel_chains"}, {"score": 0.015719716506582538, "phrase": "entry_mode"}, {"score": 0.013523564839646238, "phrase": "caribbean"}, {"score": 0.013419459729776737, "phrase": "gulf_of_mexico"}, {"score": 0.012663654006488813, "phrase": "dependent_variable"}, {"score": 0.004758987153057194, "phrase": "foreign_market"}, {"score": 0.004685375117376838, "phrase": "balearic_hotel_chains"}, {"score": 0.004630910803911567, "phrase": "caribbean_region"}, {"score": 0.004333973355873714, "phrase": "decisive_role"}, {"score": 0.004283576270012874, "phrase": "growth_strategies"}, {"score": 0.0038255128976509545, "phrase": "categorical_one"}, {"score": 0.003693533648584145, "phrase": "logistic_regression"}, {"score": 0.0034162643819889054, "phrase": "multinomial_logit_model"}, {"score": 0.003324203391715804, "phrase": "main_findings"}, {"score": 0.0032472646337850042, "phrase": "foreign_market_entry_mode"}, {"score": 0.0031721009574803127, "phrase": "host-specific_factors"}, {"score": 0.002911039832825817, "phrase": "international_hotel_industry"}, {"score": 0.002756180088265064, "phrase": "new_contribution"}, {"score": 0.0021803388613879896, "phrase": "study_object"}, {"score": 0.0021049977753042253, "phrase": "important_international_market"}], "paper_keywords": ["Economics", " Globalization"], "paper_abstract": "Purpose - The purpose of this paper is to examine the factors that play a decisive role in determining growth strategies implemented by the hotel chains of the Balearic Islands in the Caribbean and Gulf of Mexico. Design/methodology/approach - In line with most research on the choice of entry mode, the dependent variable is a categorical one. Given the nature of the dependent variable, logistic regression (or logit) models were used to verify the hypotheses. Since there were more than two categories involved, a multinomial logit model was applied. Findings - The main findings show that the choice of foreign market entry mode cannot rely solely on host-specific factors. Moreover, this study facilitates a comparison of the results of this paper and the results of other similar studies of the international hotel industry. Originality/value - This paper offers several contributions. First, it is a new contribution to the understanding of the factors that determine the behavior of hotel chains in their international expansion. Although this study has been done in other sectors (industrial), it is a novelty in the field of hospitality and, more specifically, in the hotel chains. In addition, new specific, strategic and control factors have been incorporated to help improve the explanation of the study object. Finally, the paper focuses on an important international market, such as the Caribbean and Gulf of Mexico.", "paper_title": "Choice of entry mode into a foreign market The case of Balearic hotel chains in the Caribbean region", "paper_id": "WOS:000324449300013"}