{"auto_keywords": [{"score": 0.05007848702263351, "phrase": "differentially_expressed_genes"}, {"score": 0.030074948199064692, "phrase": "ceder"}, {"score": 0.004204904449336037, "phrase": "e._g."}, {"score": 0.004019171295196278, "phrase": "fundamental_importance"}, {"score": 0.003947186611084043, "phrase": "deg_detection"}, {"score": 0.00389404213807752, "phrase": "rna-seq_data"}, {"score": 0.003688497722149817, "phrase": "read_counts"}, {"score": 0.003638823482920949, "phrase": "individual_genes"}, {"score": 0.0033544692489307676, "phrase": "different_exons"}, {"score": 0.003220709449062307, "phrase": "detection_accuracy"}, {"score": 0.0031062822219953524, "phrase": "individual_exons"}, {"score": 0.0028764048059439205, "phrase": "novel_program"}, {"score": 0.0026157259734105, "phrase": "differentially_expressed_exons"}, {"score": 0.0021531831652035482, "phrase": "existing_methods"}], "paper_keywords": ["RNA-Seq", " gene expression", " differentially expressed gene", " high-throughput sequencing", " combined p-value statistic"], "paper_abstract": "RNA-Seq is widely used in transcriptome studies, and the detection of differentially expressed genes (DEGs) between two classes of individuals, e. g., cases versus controls, using RNA-Seq is of fundamental importance. Many statistical methods for DEG detection based on RNA-Seq data have been developed and most of them are based on the read counts mapped to individual genes. On the other hand, genes are composed of exons and the distribution of reads for the different exons can be heterogeneous. We hypothesize that the detection accuracy of differentially expressed genes can be increased by analyzing individual exons within a gene and then combining the results of the exons. We therefore developed a novel program, termed CEDER, to accurately detect DEGs by combining the significance of the exons. CEDER first tests for differentially expressed exons yielding a p-value for each, and then gives a score indicating the potential for a gene to be differentially expressed by integrating the p-values of the exons in the gene. We showed that CEDER can significantly increase the accuracy of existing methods for detecting DEGs on two benchmark RNA-Seq data sets and simulated datasets.", "paper_title": "CEDER: Accurate Detection of Differentially Expressed Genes by Combining Significance of Exons Using RNA-Seq", "paper_id": "WOS:000307299200004"}