{"auto_keywords": [{"score": 0.036205073910647353, "phrase": "average_scenarios"}, {"score": 0.010164960629434604, "phrase": "average_performance"}, {"score": 0.00746896305290513, "phrase": "adverse_scenarios"}, {"score": 0.00481495049065317, "phrase": "fault_detection"}, {"score": 0.0047852458513833315, "phrase": "testing_ws-bpel_services"}, {"score": 0.004653815971302021, "phrase": "test_case_prioritization_techniques"}, {"score": 0.004540009134349177, "phrase": "test_suites"}, {"score": 0.004456475967147909, "phrase": "regression_test_session"}, {"score": 0.004415284957189386, "phrase": "real-world_developer"}, {"score": 0.004124579368997962, "phrase": "adverse_scenario"}, {"score": 0.004073809704022463, "phrase": "actual_performance"}, {"score": 0.004036141321779216, "phrase": "test_session"}, {"score": 0.00397413001036373, "phrase": "average_result"}, {"score": 0.0037008805337615113, "phrase": "adequate_confidence"}, {"score": 0.0034570485248558006, "phrase": "prioritization_techniques"}, {"score": 0.0033000452351286077, "phrase": "design_factor"}, {"score": 0.0031795757989482765, "phrase": "different_types"}, {"score": 0.003016377872938571, "phrase": "first_controlled_experiment"}, {"score": 0.002906233629441141, "phrase": "eight_ws-bpel_benchmarks"}, {"score": 0.002791432032844323, "phrase": "main_result"}, {"score": 0.002765588197487234, "phrase": "strong_and_linear_correlation"}, {"score": 0.0026481034178437958, "phrase": "interesting_result"}, {"score": 0.0024734612838382486, "phrase": "wide_spectrum"}, {"score": 0.002458166199164484, "phrase": "prioritized_test_suites"}, {"score": 0.0022052711621931144, "phrase": "first_piece"}, {"score": 0.0021916308348851428, "phrase": "strong_evidence"}, {"score": 0.002171328030402927, "phrase": "research_community"}], "paper_keywords": ["Adverse Scenario", " Average Scenario", " Controlled Experiment", " Correlation", " Empirical Study", " Regression Testing", " Test Case Prioritization", " WS-BPEL", " XML-based Artifact"], "paper_abstract": "Many existing studies measure the effectiveness of test case prioritization techniques using the average performance on a set of test suites. However, in each regression test session, a real-world developer may only afford to apply one prioritization technique to one test suite to test a service once, even if this application results in an adverse scenario such that the actual performance in this test session is far below the average result achievable by the same technique over the same test suite for the same application. It indicates that assessing the average performance of such a technique cannot provide adequate confidence for developers to apply the technique. The authors ask a couple of questions: To what extent does the effectiveness of prioritization techniques in average scenarios correlate with that in adverse scenarios? Moreover, to what extent may a design factor of this class of techniques affect the effectiveness of prioritization in different types of scenarios? To the best of their knowledge, the authors report in this paper the first controlled experiment to study these two new research questions through more than 300 million APFD and HMFD data points produced from 19 techniques, eight WS-BPEL benchmarks and 1000 test suites prioritized by each technique 1000 times. A main result reveals a strong and linear correlation between the effectiveness in the average scenarios and that in the adverse scenarios. Another interesting result is that many pairs of levels of the same design factors significantly change their relative strengths of being more effective within the same pairs in handling a wide spectrum of prioritized test suites produced by the same techniques over the same test suite in testing the same benchmarks, and the results obtained from the average scenarios are more similar to those of the more effective end than otherwise. This work provides the first piece of strong evidence for the research community to re-assess how they develop and validate their techniques in the average scenarios and beyond.", "paper_title": "Connecting the Average and the Non-Average: A Study of the Rates of Fault Detection in Testing WS-BPEL Services", "paper_id": "WOS:000358073300001"}