{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "peer_behavior"}, {"score": 0.004717485406306594, "phrase": "dynamic_peer_behavior"}, {"score": 0.004621984064678252, "phrase": "large_impact"}, {"score": 0.004258843584164121, "phrase": "overlay_network"}, {"score": 0.0040052617265655035, "phrase": "management_system"}, {"score": 0.003956379470617348, "phrase": "network_size"}, {"score": 0.003828912548622257, "phrase": "measurement_method"}, {"score": 0.003428164458163043, "phrase": "winny"}, {"score": 0.0033313964561773445, "phrase": "japan"}, {"score": 0.003290591812800382, "phrase": "analysis_results"}, {"score": 0.0029824560656987855, "phrase": "file_uploaders"}, {"score": 0.0029581155916843663, "phrase": "selfish_peers"}, {"score": 0.0025945450101602825, "phrase": "long_period"}, {"score": 0.002541910967437926, "phrase": "mathematical_fitting"}, {"score": 0.002480154140902474, "phrase": "peer_lifetime"}, {"score": 0.002275557501858879, "phrase": "heavy_tail"}, {"score": 0.002157433262687853, "phrase": "poisson_process"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["P2P", " Measurement", " Peer behavior"], "paper_abstract": "Dynamic peer behavior in P2P networks has a large impact on the performance of the network because each peer acts simultaneously as a server and a client in an overlay network. However, peer behavior in pure P2P networks is not well known because there is no management system and the network size is large. We have proposed a measurement method to collect information efficiently, and a method of analyzing the peer behavior with or without file uploading for pure P2P file sharing networks. These methods have been applied to Winny, which is the most popular P2P file sharing application in Japan. The analysis results show that the network is composed of about 30% of peers observed in 24 h, and 50% of peers contribute to the network as file uploaders. Selfish peers, which leave the network after downloading, are observed especially in the morning. The file uploading peers and the peers joining after midnight remain in the network for a long period. We also give mathematical fitting for the distribution of the peer lifetime and the frequency of joining the network. These results show that the distribution of lifetime does not have a heavy tail, and the behavior of peers joining the network is not a Poisson process. (C) 2010 Elsevier Inc. All rights reserved.", "paper_title": "An experimental study of peer behavior in a pure P2P network", "paper_id": "WOS:000285442400004"}