{"auto_keywords": [{"score": 0.04957786067961377, "phrase": "frasa"}, {"score": 0.03450367860678067, "phrase": "stability_region"}, {"score": 0.004496548114945547, "phrase": "aloha"}, {"score": 0.004485443889968379, "phrase": "convex_hull"}, {"score": 0.004426092397211699, "phrase": "collision_channel"}, {"score": 0.004199101289890982, "phrase": "closed_form"}, {"score": 0.0037397086147485897, "phrase": "analytical_result"}, {"score": 0.0037005154613244363, "phrase": "finite-user_slotted_aloha"}, {"score": 0.003383475802364289, "phrase": "good_approximation"}, {"score": 0.003226744619997716, "phrase": "aloha."}, {"score": 0.0030772505522663612, "phrase": "piecewise_linear"}, {"score": 0.0030449789178940787, "phrase": "outer_bounds"}, {"score": 0.0022544399432457164, "phrase": "separate_convex"}, {"score": 0.0021049977753042253, "phrase": "supporting_hyperplane"}], "paper_keywords": ["Feedback retransmission approximation for slotted ALOHA (FRASA)", " random access", " slotted ALOHA", " stability region"], "paper_abstract": "Feedback Retransmission Approximation for Slotted ALOHA (FRASA) is proposed to study the stability region of finite-user slotted ALOHA under the collision channel. With FRASA, the stability region is derived in closed form for any number of users in the system. The result derived from FRASA is shown to be identical to the analytical result of finite-user slotted ALOHA when there are two users. It is shown that the stability region obtained from FRASA is a good approximation to the stability region of finite-user slotted ALOHA. The convex hull bound, which is convex, piecewise linear and outer bounds the stability region of FRASA, is provided. p-convexity, an essential property that the stability region of FRASA should have to ensure the convex hull bound is close to the boundary, is characterized. From these, it is derived that the stability region of FRASA can never be convex when there are more than two users. A separate convex and piecewise linear inner bound on the stability region of FRASA, the supporting hyperplane bound, is also given.", "paper_title": "FRASA: Feedback Retransmission Approximation for the Stability Region of Finite-User Slotted ALOHA", "paper_id": "WOS:000312896600022"}