{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "multi-objective_evolutionary_algorithms"}, {"score": 0.015196088195245096, "phrase": "fuzzy_rule-based_systems"}, {"score": 0.011680576392523139, "phrase": "membership_functions"}, {"score": 0.00443878620915958, "phrase": "difficult_tradeoff"}, {"score": 0.0038868464660354626, "phrase": "different_trade-offs"}, {"score": 0.0038044630943383497, "phrase": "different_application_alternatives"}, {"score": 0.0036448787596988423, "phrase": "improved_accuracy"}, {"score": 0.003218823621926739, "phrase": "almost_one_improved_solution"}, {"score": 0.0031505544969981096, "phrase": "classic_single_objective_approach"}, {"score": 0.0029416448256236057, "phrase": "system_error"}, {"score": 0.0027114323601885666, "phrase": "six_different_multi-objective_evolutionary_algorithms"}, {"score": 0.0026767629720554397, "phrase": "simpler_and_still_accurate_linguistic_fuzzy_models"}, {"score": 0.0024461474613359994, "phrase": "expert_knowledge"}, {"score": 0.002414861891567233, "phrase": "algorithm_design_process"}, {"score": 0.002373767863833987, "phrase": "search_ability"}, {"score": 0.0021599099979586946, "phrase": "simpler_models"}, {"score": 0.002114052099701271, "phrase": "single_objective"}, {"score": 0.0021049977753042253, "phrase": "based_approach"}], "paper_keywords": [""], "paper_abstract": "Recently, multi-objective evolutionary algorithms have been applied to improve the difficult tradeoff between interpretability and accuracy of fuzzy rule-based systems. It is known that both requirements are usually contradictory, however, these kinds of algorithms can obtain a set of solutions with different trade-offs. This contribution analyzes different application alternatives in order to attain the desired accuracy/interpr-etability balance by maintaining the improved accuracy that a tuning of membership functions could give but trying to obtain more compact models. In this way, we propose the use of multi-objective evolutionary algorithms as a tool to get almost one improved solution with respect to a classic single objective approach (a solution that could dominate the one obtained by such algorithm in terms of the system error and number of rules). To do that, this work presents and analyzes the application of six different multi-objective evolutionary algorithms to obtain simpler and still accurate linguistic fuzzy models by performing rule selection and a tuning of the membership functions. The results on two different scenarios show that the use of expert knowledge in the algorithm design process significantly improves the search ability of these algorithms and that they are able to improve both objectives together, obtaining more accurate and at the same time simpler models with respect to the single objective based approach.", "paper_title": "Adaptation and application of multi-objective evolutionary algorithms for rule reduction and parameter tuning of fuzzy rule-based systems", "paper_id": "WOS:000261954000002"}