{"auto_keywords": [{"score": 0.009020558490020812, "phrase": "radio_use"}, {"score": 0.0068766291473659645, "phrase": "previous_results"}, {"score": 0.00481495049065317, "phrase": "wireless_network_synchronization"}, {"score": 0.004669026573960951, "phrase": "wireless_devices"}, {"score": 0.004187145021518927, "phrase": "clock_synchronization"}, {"score": 0.004167356068778172, "phrase": "wireless_sensor_networks"}, {"score": 0.004118290204189668, "phrase": "clean_theoretical_formulation"}, {"score": 0.004040978728221931, "phrase": "optimal_solutions"}, {"score": 0.003983945249766954, "phrase": "communication_interference"}, {"score": 0.0037459227957578225, "phrase": "time-based_schedule"}, {"score": 0.0037105832468804123, "phrase": "perfectly_synchronized_devices"}, {"score": 0.003658195769196329, "phrase": "exactly_the_minimum_periods"}, {"score": 0.0036065452411497773, "phrase": "main_challenge"}, {"score": 0.0035640586527856634, "phrase": "wireless_networks"}, {"score": 0.0035220708047207084, "phrase": "devices'_schedules"}, {"score": 0.0030841835218795694, "phrase": "optimal_use"}, {"score": 0.0030334109237085305, "phrase": "near-optimal_use"}, {"score": 0.0029764047055281565, "phrase": "arbitrary_number"}, {"score": 0.002732811297967071, "phrase": "discretized_uncertainty_period"}, {"score": 0.0027134326564541614, "phrase": "clock_shift"}, {"score": 0.002569345532992206, "phrase": "positive_beta"}, {"score": 0.002375840949858925, "phrase": "nearly_matching"}, {"score": 0.002170961332674992, "phrase": "radio-broadcast_model"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Wireless sensor network", " Clock synchronization", " Energy efficiency", " Algorithms", " Birthday paradox", " Probabilistic protocols"], "paper_abstract": "In this paper, we consider the model of communication where wireless devices can either switch their radios off to save energy (and hence, can neither send nor receive messages), or switch their radios on and engage in communication. The problem has been extensively studied in practice, in the setting such as deployment and clock synchronization of wireless sensor networks. We distill a clean theoretical formulation of minimizing radio use and present near-optimal solutions. Our base model ignores issues of communication interference, although we also extend the model to handle this requirement. We assume that nodes intend to communicate periodically, or according to some time-based schedule. Clearly, perfectly synchronized devices could switch their radios on for exactly the minimum periods required by their joint schedules. The main challenge in the deployment of wireless networks is to synchronize the devices' schedules, given that their initial schedules may be offset relative to one another (even if their clocks run at the same speed). In this paper, we study how frequently the devices must switch on their radios in order to both synchronize their clocks and communicate. In this setting, we significantly improve previous results, and show optimal use of the radio for two processors and near-optimal use of the radio for synchronization of an arbitrary number of processors. In particular, for two processors we prove deterministic matching Theta(root d) upper and lower bounds on the number of times the radio has to be on, where d is the discretized uncertainty period of the clock shift between the two processors. (In contrast, all previous results for two processors are randomized.) For n = d(beta) processors (for any positive beta < 1) we prove Omega(d((1-beta)/2)) is the lower bound on the number of times the radio has to be switched on (per processor), and show a nearly matching (in terms of the radio use) <(O)over tilde>(d((1-beta)/2)) randomized upper bound per processor. For beta >= 1 our algorithm runs with at most poly-log(d) radio invocations per processor. Our bounds also hold in a radio-broadcast model where interference must be taken into account. (C) 2011 Elsevier B.V. All rights reserved.", "paper_title": "Near-optimal radio use for wireless network synchronization", "paper_id": "WOS:000308268600003"}