{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "set-based_granular_computing"}, {"score": 0.047026895004119516, "phrase": "information_granularity"}, {"score": 0.03952148495928651, "phrase": "granular_structures"}, {"score": 0.03798322760335939, "phrase": "knowledge_distance"}, {"score": 0.009859568879005139, "phrase": "granular_operation"}, {"score": 0.00919721853404672, "phrase": "unified_framework"}, {"score": 0.004697655699119423, "phrase": "human_reasoning"}, {"score": 0.0037159680715717056, "phrase": "information_granulation"}, {"score": 0.0032174507570710835, "phrase": "desired_answers"}, {"score": 0.0027741761880779535, "phrase": "generalized_information_granularity"}, {"score": 0.002471973283582411, "phrase": "algebraic_structure"}, {"score": 0.0024215727801940434, "phrase": "complementary_lattice"}, {"score": 0.002202617924488607, "phrase": "lattice_model"}, {"score": 0.0021845387990972543, "phrase": "powerful_mechanisms"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Granular computing", " Rough set theory", " Knowledge distance", " Information granularity", " Operator"], "paper_abstract": "Set-based granular computing plays an important role in human reasoning and problem solving. Its three key issues constitute information granulation, information granularity and granular operation. To address these issues, several methods have been developed in the literature, but no unified framework has been formulated for them, which could be inefficient to some extent. To facilitate further research on the topic, through consistently representing granular structures induced by information granulation, we introduce a concept of knowledge distance to differentiate any two granular structures. Based on the knowledge distance, we propose a unified framework for set-based granular computing, which is named a lattice model. Its application leads to desired answers to two key questions: (1) what is the essence of information granularity, and (2) how to perform granular operation. Through using the knowledge distance, a new axiomatic definition to information granularity, called generalized information granularity is developed and its corresponding lattice model is established, which reveal the essence of information granularity in set-based granular computing. Moreover, four operators are defined on granular structures, under which the algebraic structure of granular structures forms a complementary lattice. These operators can effectively accomplish composition, decomposition and transformation of granular structures. These results show that the knowledge distance and the lattice model are powerful mechanisms for studying set-based granular computing. (C) 2013 Elsevier Inc. All rights reserved.", "paper_title": "Set-based granular computing: A lattice model", "paper_id": "WOS:000332807700005"}