{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "scoring_functions"}, {"score": 0.008665614631308268, "phrase": "structure-based_virtual_screening"}, {"score": 0.0063336170932265, "phrase": "standard_deviation"}, {"score": 0.005542825943883678, "phrase": "mean_scores"}, {"score": 0.004730368493159428, "phrase": "scoring_function"}, {"score": 0.004643934241650914, "phrase": "eight_different_targets"}, {"score": 0.004592540351971182, "phrase": "resulting_poses"}, {"score": 0.004499311032734556, "phrase": "molecular_weight"}, {"score": 0.004474341800209443, "phrase": "heavy_atom_count"}, {"score": 0.004380358468291855, "phrase": "virtual_screening"}, {"score": 0.00421297029755273, "phrase": "vigers"}, {"score": 0.004189584378756511, "phrase": "rizzi"}, {"score": 0.004093091099935894, "phrase": "ligand_bias"}, {"score": 0.004074574278425223, "phrase": "corrections_terms"}, {"score": 0.004029455922180569, "phrase": "simple_molecular_descriptors"}, {"score": 0.0040141049338506115, "phrase": "false_positives"}, {"score": 0.004007090536528549, "phrase": "pls"}, {"score": 0.0038431888954930083, "phrase": "masc"}, {"score": 0.0037795163893761027, "phrase": "enrichment_factors"}, {"score": 0.003737652990549808, "phrase": "uncorrected_scoring_functions"}, {"score": 0.0034669081259719884, "phrase": "masc_equation"}, {"score": 0.0032067651867042466, "phrase": "original_masc_method"}, {"score": 0.003101320048106963, "phrase": "molecular_descriptors"}, {"score": 0.003007701501036036, "phrase": "resulting_pls_models"}, {"score": 0.002900687590961084, "phrase": "raw_score"}, {"score": 0.0028446460307503343, "phrase": "straightforward_masc."}, {"score": 0.0028131083807134984, "phrase": "intermediate_linear_correlation"}, {"score": 0.0027510752634224726, "phrase": "heavy_atoms"}, {"score": 0.0026310718762875707, "phrase": "size_dependence"}, {"score": 0.0025730425700096365, "phrase": "pls_masc"}, {"score": 0.0023731849094845475, "phrase": "cubic_root"}], "paper_keywords": [""], "paper_abstract": "A total of 945 known actives and roughly 10 000 decoy compounds were docked to eight different targets, and the resulting poses were scored using 10 different scoring functions. Three different score postprocessing methods were evaluated with respect to improvement of the enrichment in virtual screening. The three procedures were (i) multiple active site correction (MASC) as has been proposed by Vigers and Rizzi, (ii) a variation of MASC where corrections terms are predicted from simple molecular descriptors through PLS, PLS MASC, and (iii) size normalization. It was found that MASC did not generally improve the enrichment factors when compared to uncorrected scoring functions. For some combinations of scoring functions and targets, the enrichment was improved, for others not. However, by excluding the standard deviation from the MASC equation and transforming the scores for each target to a mean of 0 and a standard deviation of 1 ( unit variance normalization), the performance was improved as compared to the original MASC method for most combinations of targets and scoring functions. Furthermore, when the molecular descriptors were fit to the mean scores over all targets and the resulting PLS models were used to predict mean scores, the enrichment as compared to the raw score was improved more often than by straightforward MASC. A high to intermediate linear correlation between the score and the number of heavy atoms was found for all scoring functions except FlexX. There seems to be a correlation between the size dependence of a scoring function and the effectiveness of PLS MASC in increasing the enrichment for that scoring function. Finally, normalization by molecular weight or heavy atom count was sometimes successful in increasing the enrichment. Dividing by the square or cubic root of the molecular weight or heavy atom count instead was often more successful. These results taken together suggest that ligand bias in scoring functions is a source of false positives in structure-based virtual screening. The number of false positives caused by ligand bias may be decreased using, for example, the PLS MASC procedure proposed in this study.", "paper_title": "Ligand bias of scoring functions in structure-based virtual screening", "paper_id": "WOS:000237658400043"}