{"auto_keywords": [{"score": 0.04842950119492684, "phrase": "service_users"}, {"score": 0.010612387000973441, "phrase": "cloud_computing"}, {"score": 0.010147343708459005, "phrase": "service_providers"}, {"score": 0.005601829459200408, "phrase": "service_instance"}, {"score": 0.0043560464825349275, "phrase": "major_concern"}, {"score": 0.004269630481719451, "phrase": "cloud_adoption"}, {"score": 0.0038048583022763796, "phrase": "service-level_agreements"}, {"score": 0.0036553070575015344, "phrase": "real-time_service-level_degradability"}, {"score": 0.0030060256866508606, "phrase": "cloud_infrastructure"}, {"score": 0.0027881294891497115, "phrase": "desired_quality_level"}, {"score": 0.002665027876903161, "phrase": "provider's_infrastructure"}, {"score": 0.002315658491366464, "phrase": "real_time"}, {"score": 0.0022810491620483737, "phrase": "important_analysis"}, {"score": 0.0021049977753042253, "phrase": "important_input"}], "paper_keywords": ["service degradability", " SLA violation", " cloud computing", " risk assessment as a service"], "paper_abstract": "Cloud computing is a very attractive option for service users and service providers for their businesses because of the benefits it provides. A major concern among service users regarding cloud adoption, however, is the unpredictability of performance in relation to the services provided. Even though guarantees in the form of service-level agreements are provided to users by service providers, real-time service-level degradability remains a critical concern; hence, there is a need for an approach that assists users to manage a service before it fails. The approaches proposed in the literature assess and evaluate the performance of the cloud infrastructure of providers, but this does not guarantee that a given service instance will meet the desired quality level because there may be factors other than the provider's infrastructure that will affect the level of quality of the service instance. In this paper, we present an approach that measures the quality of a service instance in real time and provides important analysis for service users as to whether they will achieve their desired objectives. This analysis also constitutes an important input for service users in the assessment and management of a service to avoid the failure to achieve objectives.", "paper_title": "A User-Based Early Warning Service Management Framework in Cloud Computing", "paper_id": "WOS:000351055300010"}