{"auto_keywords": [{"score": 0.041712156789843864, "phrase": "compressed_graph_representations"}, {"score": 0.03835583735523021, "phrase": "extended_queries"}, {"score": 0.00481495049065317, "phrase": "web_graphs"}, {"score": 0.004782848614014638, "phrase": "extended_functionality"}, {"score": 0.0047035227618053965, "phrase": "large_subsets"}, {"score": 0.004579316323166273, "phrase": "directed_graph"}, {"score": 0.004355163162038354, "phrase": "so-called_web_graphs"}, {"score": 0.004297256607382827, "phrase": "interesting_web_graphs"}, {"score": 0.004141936429360251, "phrase": "main_memory"}, {"score": 0.004114303071093143, "phrase": "typical_computers"}, {"score": 0.004059585951426263, "phrase": "required_graph_algorithms"}, {"score": 0.00400559360117678, "phrase": "secondary_memory"}, {"score": 0.0038737214010638745, "phrase": "compressed_form"}, {"score": 0.003115908199991072, "phrase": "compact_tree_structure"}, {"score": 0.00306414423737093, "phrase": "large_empty_areas"}, {"score": 0.0030334982939315, "phrase": "adjacency_matrix"}, {"score": 0.0028944757265206332, "phrase": "symmetric_fashion"}, {"score": 0.002789715649746005, "phrase": "specific_links"}, {"score": 0.002600105134993952, "phrase": "best_representations"}, {"score": 0.0024892263318773704, "phrase": "least_space_usage"}, {"score": 0.00242335068996852, "phrase": "fast_navigation"}, {"score": 0.0022284920601703595, "phrase": "general_interest"}, {"score": 0.0021477840826122853, "phrase": "data_structures"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Web graphs", " Compact data structures"], "paper_abstract": "The representation of large subsets of the World Wide Web in the form of a directed graph has been extensively used to analyze structure, behavior, and evolution of those so-called Web graphs. However, interesting Web graphs are very large and their classical representations do not fit into the main memory of typical computers, whereas the required graph algorithms perform inefficiently on secondary memory. Compressed graph representations drastically reduce their space requirements while allowing their efficient navigation in compressed form. While the most basic navigation operation is to retrieve the successors of a node, several important Web graph algorithms require support for extended queries, such as finding the predecessors of a node, checking the presence of a link, or retrieving links between ranges of nodes. Those are seldom supported by compressed graph representations. This paper presents the k(2)-tree, a novel Web graph representation based on a compact tree structure that takes advantage of large empty areas of the adjacency matrix of the graph. The representation not only retrieves successors and predecessors in symmetric fashion, but also it is particularly efficient to check for specific links between nodes, or between ranges of nodes, or to list the links between ranges. Compared to the best representations in the literature supporting successor and predecessor queries, our technique offers the least space usage (1-3 bits per link) while supporting fast navigation to predecessors and successors (2-8 mu s per neighbor retrieved) and sharply outperforming the others on the extended queries. The representation is also of general interest and can be used to compress other kinds of graphs and data structures. (C) 2013 Elsevier Ltd. All rights reserved.", "paper_title": "Compact representation of Web graphs with extended functionality", "paper_id": "WOS:000329531300007"}