{"auto_keywords": [{"score": 0.03854928587050201, "phrase": "complete_fairness"}, {"score": 0.011531225250323351, "phrase": "honest_majority"}, {"score": 0.010505144120313791, "phrase": "two-party_setting"}, {"score": 0.00481495049065317, "phrase": "secure_two-party"}, {"score": 0.004666756595735701, "phrase": "secure_two-party_computation"}, {"score": 0.0034283921404628975, "phrase": "accepted_folklore"}, {"score": 0.0031210475158175432, "phrase": "folklore_belief"}, {"score": 0.003052014818816411, "phrase": "completely_fair_protocols"}, {"score": 0.002944715025443487, "phrase": "standard_cryptographic_assumptions"}, {"score": 0.0027659126653647712, "phrase": "polynomial-size_domains"}, {"score": 0.00269263690712392, "phrase": "\"embedded_xor"}, {"score": 0.0025518429503461736, "phrase": "yao's_\"millionaires'_problem"}, {"score": 0.0024075916292945715, "phrase": "embedded_xor"}, {"score": 0.002291905937251069, "phrase": "completely_fair_protocol"}, {"score": 0.002181766829493483, "phrase": "security_parameter"}, {"score": 0.0021049977753042253, "phrase": "completely_fair_secure_computation"}], "paper_keywords": ["Security", " Theory", " Cryptography", " secure computation", " fairness"], "paper_abstract": "In the setting of secure two-party computation, two mutually distrusting parties wish to compute some function of their inputs while preserving, to the extent possible, various security properties such as privacy, correctness, and more. One desirable property is fairness which guarantees, informally, that if one party receives its output, then the other party does too. Cleve [1986] showed that complete fairness cannot be achieved in general without an honest majority. Since then, the accepted folklore has been that nothing non-trivial can be computed with complete fairness in the two-party setting. We demonstrate that this folklore belief is false by showing completely fair protocols for various nontrivial functions in the two-party setting based on standard cryptographic assumptions. We first show feasibility of obtaining complete fairness when computing any function over polynomial-size domains that does not contain an \"embedded XOR\"; this class of functions includes boolean AND/OR as well as Yao's \"millionaires' problem\". We also demonstrate feasibility for certain functions that do contain an embedded XOR, though we prove a lower bound showing that any completely fair protocol for such functions must have round complexity super-logarithmic in the security parameter. Our results demonstrate that the question of completely fair secure computation without an honest majority is far from closed.", "paper_title": "Complete Fairness in Secure Two-Party Computation", "paper_id": "WOS:000298296000001"}