{"auto_keywords": [{"score": 0.04367732323962223, "phrase": "smartphone_environment"}, {"score": 0.00481495049065317, "phrase": "smartphone_photographs"}, {"score": 0.004741845603430361, "phrase": "widespread_availability"}, {"score": 0.004598933498016774, "phrase": "cheap_and_powerful_camera_module"}, {"score": 0.003807684498435389, "phrase": "photograph_management_tools"}, {"score": 0.0035269696779744266, "phrase": "photograph_clustering_system"}, {"score": 0.002964706925144123, "phrase": "photograph_clustering"}, {"score": 0.0027459678326877744, "phrase": "user's_clustering_preference"}, {"score": 0.0026091594819333654, "phrase": "user_preference-based_clustering"}, {"score": 0.002530359917257626, "phrase": "light-weight_clustering_algorithm"}, {"score": 0.0023079225317714815, "phrase": "specific_photographs"}, {"score": 0.0022154296909169826, "phrase": "user-friendly_interface"}, {"score": 0.0021595094738887767, "phrase": "experimental_results"}, {"score": 0.0021049977753042253, "phrase": "supplementary_data_site"}], "paper_keywords": ["Photograph", " smartphone", " visualization", " clustering"], "paper_abstract": "The widespread availability of smartphones equipped with a cheap and powerful camera module encourages people to take more photographs than ever before. However, organizing hundreds of photographs manually in the smartphone environment is burdensome and tedious. Because the smartphone is a very limited computing device compared to most laptop computers or PCs, photograph management tools that are more specialized need to be developed. This paper focuses on the photograph clustering system, in particular, in the smartphone environment. In general, people manage their photographs in terms of time, space, and content, which are considered the three fundamental features for every photograph clustering. This paper proposes a method for combining these clustering features to meet the user's clustering preference allowing more than 100 photographs to be managed effectively by applying user preference-based clustering. In addition, a light-weight clustering algorithm is proposed for selecting two features from three independent features of spatial, temporal, and location-based classification criteria. This system allows users to easily find specific photographs among hundreds to meet their management preference through a user-friendly interface. Testing photographs and experimental results are available at the supplementary data site: http://galab-work.cs.pusan.ac.kr/jaise/.", "paper_title": "Preference-customizable clustering system for smartphone photographs", "paper_id": "WOS:000352647600007"}