{"auto_keywords": [{"score": 0.04824070778853848, "phrase": "internet_addiction"}, {"score": 0.008713768692145013, "phrase": "individual_differences"}, {"score": 0.008272363504473038, "phrase": "health_risk"}, {"score": 0.0058974591632745856, "phrase": "high-risk_group"}, {"score": 0.0044718206943536514, "phrase": "internet_habits"}, {"score": 0.004413846562278824, "phrase": "exploratory_study"}, {"score": 0.004081385289516914, "phrase": "stigma_tolerance"}, {"score": 0.0037738708560271354, "phrase": "new_mental_illness"}, {"score": 0.0037411604449359794, "phrase": "urban_chinese_internet_users'_willingness"}, {"score": 0.0035199624440843892, "phrase": "urban_china"}, {"score": 0.003459191419478298, "phrase": "young's_classic_definition"}, {"score": 0.0031845067058084583, "phrase": "internet_addiction_disorder"}, {"score": 0.0025611773887867255, "phrase": "low-risk_group"}, {"score": 0.0023679315987170857, "phrase": "low-income_users"}, {"score": 0.0021892345747666977, "phrase": "addiction_clinics"}, {"score": 0.0021702624414482044, "phrase": "china"}, {"score": 0.0021049977753042253, "phrase": "practical_health_policy_implications"}], "paper_keywords": ["awareness-knowledge", " flexible/rigid personality", " health risk", " Internet addiction", " loss of face", " stigma tolerance"], "paper_abstract": "This exploratory study proposes that Internet addiction is a health risk and examines the effects of individual differences (such as flexibility/rigidity, stigma tolerance, and concern with loss of face), awareness/knowledge, and acceptance of Internet addiction as a new mental illness on urban Chinese Internet users' willingness to change their maladaptive Internet habits. Data were gathered from a 2009 online survey of 497 Internet users in urban China. Based on Young's classic definition of Internet addiction, results showed that 12.3% can be classified in the high-risk group for potentially suffering from Internet addiction disorder (IAD). The high-risk group tended to be significantly more rigid in personality, more concerned with loss of face, and more aware of Internet addiction. As expected, users who were flexible, tolerant of stigma, concerned about loss of face, and in the low-risk group were found to be more willing to self-discipline their problematic Internet use. Female, nonstudent, and low-income users tended to be more determined to seek self-help to recover from Internet addiction on their own, as addiction clinics in China are still scarce and expensive. Practical health policy implications are discussed.", "paper_title": "Effects of Individual Differences, Awareness-Knowledge, and Acceptance of Internet Addiction as a Health Risk on Willingness to Change Internet Habits", "paper_id": "WOS:000303125300003"}