{"auto_keywords": [{"score": 0.049100450513748284, "phrase": "penalty_functions"}, {"score": 0.015719716506582538, "phrase": "multi-expert_decision"}, {"score": 0.015090245427865178, "phrase": "cartesian_product"}, {"score": 0.012943277198860285, "phrase": "single_aggregation_function"}, {"score": 0.012234053056167088, "phrase": "aggregation_functions"}, {"score": 0.004297795905522757, "phrase": "preference_relations"}, {"score": 0.0038959121068990517, "phrase": "whole_process"}, {"score": 0.003336225354214798, "phrase": "individual_preferences"}, {"score": 0.0029620573986902416, "phrase": "classical_methods"}, {"score": 0.0027126684113045756, "phrase": "restricted_dissimilarity_function"}, {"score": 0.002251542790734307, "phrase": "best_combination"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Restricted dissimilarity function", " Fuzzy distance", " Penalty functions", " Multipurpose decision making", " Selection process"], "paper_abstract": "In this paper we introduce an algorithm to aggregate the preference relations provided by experts in multi-expert decision making problems. Instead of using a single aggregation function for the whole process, we start from a set of aggregation functions and select, by means of consensus done through penalty functions, the most suitable aggregation function in order to aggregate the individual preferences for each of the elements. An advantage of the method that we propose is that it allows us to recover the classical methods, just by using a single aggregation function. We also present a generalization of the concepts of restricted dissimilarity function and distance between sets for the case where we are working with a Cartesian product of lattices and use such concepts to build penalty functions. Finally, we propose an algorithm that allows us to choose the best combination of aggregation functions for a multi-expert decision making problem. (C) 2011 Elsevier B.V. All rights reserved.", "paper_title": "Consensus in multi-expert decision making problems using penalty functions defined over a Cartesian product of lattices", "paper_id": "WOS:000328527200008"}