{"auto_keywords": [{"score": 0.03945082093318748, "phrase": "pi"}, {"score": 0.031367578876281894, "phrase": "pdr-pipp"}, {"score": 0.030249479424729258, "phrase": "fpdr-pipp"}, {"score": 0.00481495049065317, "phrase": "hyperspectral_imagery"}, {"score": 0.0047113960612140335, "phrase": "new_concept"}, {"score": 0.004455179735772526, "phrase": "data_dimensionality_reduction"}, {"score": 0.004400153852462583, "phrase": "progressive_information_preservation"}, {"score": 0.004305481798183612, "phrase": "prdt"}, {"score": 0.004278807087784626, "phrase": "key_issue"}, {"score": 0.004173743791750695, "phrase": "spectral-transformed_component"}, {"score": 0.003971262520692664, "phrase": "projection_pursuit"}, {"score": 0.003617616153730564, "phrase": "pp-transformed_component"}, {"score": 0.003347008750837722, "phrase": "priority_score"}, {"score": 0.0033159224502739247, "phrase": "particular_pic."}, {"score": 0.003234425353582135, "phrase": "projection_index-based_projection_pursuit"}, {"score": 0.0031549249117721946, "phrase": "pdrt"}, {"score": 0.0031159081999910694, "phrase": "appropriate_set"}, {"score": 0.003077372515276563, "phrase": "information_preservation"}, {"score": 0.0029097582786754444, "phrase": "backward_manner"}, {"score": 0.0028737647829311587, "phrase": "forward_pdr-pipp"}, {"score": 0.00282065060214111, "phrase": "port"}, {"score": 0.002691957489907003, "phrase": "progressive_band_expansion"}, {"score": 0.00265038878247831, "phrase": "minimum_number"}, {"score": 0.0026094602917828037, "phrase": "new_pics"}, {"score": 0.0025059724686541263, "phrase": "progressive_band_reduction"}, {"score": 0.0024672686023811574, "phrase": "maximum_number"}, {"score": 0.002414082940963702, "phrase": "least_priorities"}, {"score": 0.002347378595930709, "phrase": "stopping_rule"}, {"score": 0.002151388538895855, "phrase": "data_integrity"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Backward progressive dimensionality reduction by PI-PP (BPDR-PIPP)", " Dimensionality reduction by transform (DRT)", " Forward progressive dimensionality reduction by PI-PP (FPDR-PIPP)", " Progressive dimensionality reduction by projection index-based projection pursuit (PDR-PIPP)", " Progressive dimensionality reduction by transform (PDRT)", " Projection index-based projection pursuit (PIPP)"], "paper_abstract": "This paper develops to a new concept, called progressive dimensionality reduction by transform (PDRT), which is particularly designed to perform data dimensionality reduction in terms of progressive information preservation. In order to materialize the PRDT a key issue is to prioritize information contained in each spectral-transformed component so that all the spectral transformed components will be ranked in accordance with their information priorities. In doing so, projection pursuit (PP)-based dimensionality reduction by transform (DRT) techniques are developed for this purpose where the Projection Index (PI) is used to define the direction of interestingness of a PP-transformed component, referred to as projection index component (PIC). The information contained in a PIC is then calculated by the PI and used as the priority score of this particular PIC. Such a resultant PORT is called progressive dimensionality reduction by projection index-based projection pursuit (PDR-PIPP) which performs PDRT by retaining an appropriate set of PICs for information preservation according to their priorities. Two procedures are further developed to carry out PDR-PIPP in a forward or a backward manner, referred to forward PDR-PIPP (FPDR-PIPP) or backward PORT (BPDR-PIPP), respectively, where FPDR-PIPP can be considered as progressive band expansion by starting with a minimum number of PICs and adding new PICs progressively according to their reduced priorities as opposed to BPDRT which can be regarded progressive band reduction by beginning with a maximum number of PICs and removing PICs with least priorities progressively. Both procedures are terminated when a stopping rule is satisfied. The advantages of PDR-PIPP allow users to transmit, communicate, process and store data more efficiently and effectively in the sense of retaining data integrity progressively. (C) 2011 Elsevier Ltd. All rights reserved.", "paper_title": "Progressive dimensionality reduction by transform for hyperspectral imagery", "paper_id": "WOS:000292849000045"}