{"auto_keywords": [{"score": 0.04203576937954651, "phrase": "different_positions"}, {"score": 0.03387648860751041, "phrase": "design_purposes"}, {"score": 0.03275097241605011, "phrase": "research_subjects"}, {"score": 0.00481495049065317, "phrase": "children_-_encountering_identities"}, {"score": 0.004704571777980556, "phrase": "video_diaries"}, {"score": 0.004583403452794034, "phrase": "children's_technology_use"}, {"score": 0.004517435235940661, "phrase": "discourse_lens"}, {"score": 0.0044524122425287005, "phrase": "novel_insights"}, {"score": 0.004312622975366672, "phrase": "human_computer_interaction"}, {"score": 0.003976203286249396, "phrase": "'a_diarist"}, {"score": 0.003752032410115961, "phrase": "widely_known_genres"}, {"score": 0.0033021988455635403, "phrase": "hci_research"}, {"score": 0.0030092017034068666, "phrase": "multifaceted_resource"}, {"score": 0.002948646905471742, "phrase": "producers'_lives"}, {"score": 0.0028559348655053545, "phrase": "identity_exploration"}, {"score": 0.0027421300566115416, "phrase": "data_analysis"}, {"score": 0.0022967713922705, "phrase": "video_clips"}, {"score": 0.0022768346311104735, "phrase": "better-focused_data"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Video diary", " Children", " Multimodality", " Discourse", " Nexus analysis"], "paper_abstract": "This paper examines video diaries gathered from 10-11-year-old pupils with the aim of inquiring children's technology use in their everyday life. A discourse lens is utilized to provide novel insights into the nature and use of videos and diaries in Human Computer Interaction (HCI) research and design. The paper shows how the children, given the same assignment, produced their video diaries from a range of different positions such as 'a diarist', 'a news anchor' and 'a stage performer', and through a variety of widely known genres such as 'an intimate, confessional diary entry', 'a news broadcast', and 'a homework assignment'. The children also smoothly moved between the positions and genres sometimes changing them several times even during one video clip. Our findings bear implications on two types of HCI research: firstly, studies using diaries for research and design purposes and, secondly, studies interested in videos produced by the research subjects. The paper emphasizes videos and diaries as a multifaceted resource not only revealing facts from the producers' lives but also playful experimenting with different positions and genres highlighting constant identity exploration and construction going on during the creation of the data. During the data analysis it is useful to consider within what kind of positionings and genres the pieces of data or 'facts' have been created as these genres and positions always frame and limit what is said and how. The paper also suggests that researchers could try to guide the research subjects to adopt certain positions and to rely on certain genres in producing their diaries or video clips to obtain better-focused data for particular research or design purposes. On the other hand, challenges involved with this kind of an attempt are also highlighted. (C) 2014 Elsevier Ltd. All rights reserved.", "paper_title": "Video diary as a means for data gathering with children - Encountering identities in the making", "paper_id": "WOS:000335625200005"}