{"auto_keywords": [{"score": 0.03862495247285584, "phrase": "constrained_tree_edit_distance"}, {"score": 0.00481495049065317, "phrase": "noisy_subsequence_trees"}, {"score": 0.004695900553353526, "phrase": "data_structure"}, {"score": 0.004534136929881113, "phrase": "semistructured_data"}, {"score": 0.004291073117901643, "phrase": "computing_tree_similarity"}, {"score": 0.004205940624913343, "phrase": "pattern_recognition"}, {"score": 0.004040688646993605, "phrase": "noisy_subsequence_tree_recognition_problem"}, {"score": 0.003901407184706592, "phrase": "original_tree"}, {"score": 0.00327356326590461, "phrase": "new_dissimilarity_measure"}, {"score": 0.0030060256866508606, "phrase": "unit-cost_tree_edit_distance"}, {"score": 0.002902304851882577, "phrase": "node_labels"}, {"score": 0.0026252106881752067, "phrase": "faster_execution_speed"}, {"score": 0.002459414063407306, "phrase": "tree_inclusion_problem"}, {"score": 0.002246955931290095, "phrase": "approximate_tree_inclusion"}, {"score": 0.0021049977753042253, "phrase": "wiley_periodicals"}], "paper_keywords": [""], "paper_abstract": "Tree is a data structure used to express various objects such as semistructured data and genes. When objects are represented as trees, computing tree similarity is essential for pattern recognition and retrieval. This paper considers the noisy subsequence tree recognition problem whose purpose is to recognize the original tree, given its noisy subsequence tree. Previous research on this problem relied on constrained tree edit distance to measure the dissimilarity. However, the number of relabelings must be predetermined to compute it. This paper proposes a new dissimilarity measure for this problem. Our dissimilarity measure is obtained by counting the node edit operations included in the unit-cost tree edit distance that contribute to the matching of node labels. The number of relabelings need not be specified to compute our dissimilarity measure. Moreover, our measure achieves more accurate recognition performance and faster execution speed than the constrained tree edit distance. Our measure is also useful to solve the tree inclusion problem which is the problem of deciding whether a tree includes another tree and shows the extent of approximate tree inclusion when a tree incompletely includes another tree. (C) 2011 Wiley Periodicals, Inc.", "paper_title": "New Dissimilarity Measure for Recognizing Noisy Subsequence Trees", "paper_id": "WOS:000288516800006"}