{"auto_keywords": [{"score": 0.049231556988166246, "phrase": "supervised_classification"}, {"score": 0.00481495049065317, "phrase": "monte_carlo"}, {"score": 0.004563691742821759, "phrase": "informative_features"}, {"score": 0.004344855841195913, "phrase": "feature_selection"}, {"score": 0.004173603566828364, "phrase": "classification_task"}, {"score": 0.0038855864345030563, "phrase": "classification_rules"}, {"score": 0.0037658881407605445, "phrase": "conceptually_simple_but_computer-intensive_approach"}, {"score": 0.0035374012552316573, "phrase": "multiple_construction"}, {"score": 0.0034902664176377943, "phrase": "tree_classifier"}, {"score": 0.0032638170723261538, "phrase": "training_set_consist"}, {"score": 0.003163212007747804, "phrase": "observed_features"}, {"score": 0.0030932495918679285, "phrase": "resulting_ranking"}, {"score": 0.0027907771648224273, "phrase": "golub_et_al"}, {"score": 0.0025632898741546556, "phrase": "significantly_different_list"}, {"score": 0.0025178072071268534, "phrase": "biological_interpretation"}, {"score": 0.0023333173799963795, "phrase": "different_types"}], "paper_keywords": [""], "paper_abstract": "Motivation: Pre-selection of informative features for supervised classification is a crucial, albeit delicate, task. It is desirable that feature selection provides the features that contribute most to the classification task per se and which should therefore be used by any classifier later used to produce classification rules. In this article, a conceptually simple but computer-intensive approach to this task is proposed. The reliability of the approach rests on multiple construction of a tree classifier for many training sets randomly chosen from the original sample set, where samples in each training set consist of only a fraction of all of the observed features. Results: The resulting ranking of features may then be used to advantage for classification via a classifier of any type. The approach was validated using Golub et al. leukemia data and the Alizadeh et al. lymphoma data. Not surprisingly, we obtained a significantly different list of genes. Biological interpretation of the genes selected by our method showed that several of them are involved in precursors to different types of leukemia and lymphoma rather than being genes that are common to several forms of cancers, which is the case for the other methods.", "paper_title": "Monte Carlo feature selection for supervised classification", "paper_id": "WOS:000251865000015"}