{"auto_keywords": [{"score": 0.04019485572072642, "phrase": "dyxy_algorithm"}, {"score": 0.00481495049065317, "phrase": "edxy_-_a"}, {"score": 0.004507594400447103, "phrase": "adaptive_routing_algorithm"}, {"score": 0.004176033420846065, "phrase": "dynamic_xy"}, {"score": 0.0040757181942937875, "phrase": "enhanced_dynamic_xy"}, {"score": 0.003609024170287396, "phrase": "current_switch"}, {"score": 0.003485744667868367, "phrase": "exactly_one_unit"}, {"score": 0.0034376160364306637, "phrase": "switch_x_position"}, {"score": 0.0029705677977833857, "phrase": "link_failure"}, {"score": 0.002849146732780381, "phrase": "routing_algorithm"}, {"score": 0.002639251247218711, "phrase": "proposed_algorithm"}, {"score": 0.0025578967205807843, "phrase": "realistic_traffic_profiles"}, {"score": 0.002540160379502092, "phrase": "packet_injection"}, {"score": 0.0024963543716522087, "phrase": "simulation_results"}, {"score": 0.0024704333220467393, "phrase": "edxy"}, {"score": 0.0024447807655923926, "phrase": "lower_latency"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Network-on-chip", " Routing algorithm", " Adaptive", " Dynamic XY", " Bursty traffic", " Non uniform traffic", " Low latency routing", " Link failure tolerant"], "paper_abstract": "In this paper, an adaptive routing algorithm for two-dimensional mesh network-on-chips (NoCs) is presented. The algorithm, which is based on Dynamic XY (DyXY), is called Enhanced Dynamic XY (EDXY). It is congestion-aware and more link failure tolerant compared to the DyXY algorithm. On contrary to the DyXY algorithm, it can avoid the congestion when routing from the current switch to the destination whose X position (Y position) is exactly one unit apart from the switch X position (Y position). This is achieved by adding two congestion wires (one in each direction) between each two cores which indicate the existence of congestion in a row (column). The same wires may be used to alarm a link failure in a row (column). These signals enable the routing algorithm to avoid these paths when there are other paths between the source and destination pair. To assess the latency of the proposed algorithm, uniform, transpose, hotspot, and realistic traffic profiles for packet injection are used. The simulation results reveal that EDXY can achieve lower latency compared to those of other adaptive routing algorithms across all workloads examined, with a 20% average and 30% maximum latency reduction on SPLASH-2 benchmarks running on a 49-core CMP. The area of the technique is about the same as those of the other routing algorithms. (C) 2010 Elsevier B.V. All rights reserved.", "paper_title": "EDXY - A low cost congestion-aware routing algorithm for network-on-chips", "paper_id": "WOS:000279978400005"}