{"auto_keywords": [{"score": 0.048718786750838995, "phrase": "modelling_languages"}, {"score": 0.028022468042422203, "phrase": "ontological_analysis"}, {"score": 0.00481495049065317, "phrase": "new_perspectives"}, {"score": 0.004648292940755605, "phrase": "ueml."}, {"score": 0.004444462552988661, "phrase": "language_w.r.t"}, {"score": 0.004168618849008299, "phrase": "modelling_language"}, {"score": 0.003985738225654119, "phrase": "quite_limited_support"}, {"score": 0.0038973170902076707, "phrase": "ontological_analysis_task"}, {"score": 0.0037382581492847104, "phrase": "machine_readable_format"}, {"score": 0.0036670439738769505, "phrase": "language_constructs"}, {"score": 0.003608732492631878, "phrase": "informal_tables"}, {"score": 0.0034614104600030633, "phrase": "coverage_task"}, {"score": 0.003362944428837724, "phrase": "distinct_results"}, {"score": 0.00334144503360907, "phrase": "distinct_experts"}, {"score": 0.0032463805170627686, "phrase": "ontology_enrichment"}, {"score": 0.003194736764837261, "phrase": "specialised_language_constructs"}, {"score": 0.0031641444460976673, "phrase": "limited_support"}, {"score": 0.003113804826864362, "phrase": "ontological_analysis_outcomes"}, {"score": 0.0030058503645435455, "phrase": "integrated_usage"}, {"score": 0.0028830690329478465, "phrase": "key_aspects"}, {"score": 0.0027212777001495176, "phrase": "ueml"}, {"score": 0.0026693851900137953, "phrase": "advanced_support"}, {"score": 0.002340250894008014, "phrase": "ueml_approach"}, {"score": 0.002145942273032774, "phrase": "enterprise_processes"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Ontological analysis of modelling languages", " Enterprise modelling", " IS modelling", " Language management", " Unified Enterprise Modelling Langauge", " Language meta model"], "paper_abstract": "Ontological analysis of modelling languages has been mainly used for evaluating quality of modelling language w.r.t. one specific upper ontology. Generally speaking this evaluation has been done by identifying the coverage of the modelling language constructs w.r.t. the ontology and vice-versa. However, a quite limited support has been developed for performing the ontological analysis task. Specifically, various ontologies used for ontological analysis are not associated to a machine readable format; the coverage of modelling language constructs is mostly provided by informal tables mapping one construct on to one ontological concept; the way in which this coverage task is undertaken is poorly specified (resulting in distinct results for distinct experts involved), and finally, preventing any ontology enrichment for dealing with some specialised language constructs. This limited support also prevents application of ontological analysis outcomes to problems and domains dealing with interoperability, integration and integrated usage of enterprise and IS models, which is today one of the key aspects for making interoperable, maintainable and evolvable inter and intra enterprise software systems. The paper provides an overview of the Unified Enterprise Modelling Language (UEML) approach, which introduces advanced support to ontological analysis of modelling languages. The paper is specifically focused on the task of ontological analysis of modelling languages (named incorporation of modelling languages) by introducing and explaining several guidelines and rules for driving the task: therefore, not all the aspects of the UEML approach will be discussed through the paper. The guidelines and rules are illustrated by incorporation of three selected modelling constructs from IDEF3, a well known language for specifying enterprise processes. (C) 2011 Elsevier Ltd. All rights reserved.", "paper_title": "New perspectives in ontological analysis: Guidelines and rules for incorporating modelling languages into UEML", "paper_id": "WOS:000302001400007"}