{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "multi-agent_based_simulations"}, {"score": 0.04875227329545032, "phrase": "simulation_design"}, {"score": 0.004761132425263795, "phrase": "integrated_development_environments"}, {"score": 0.00427912304853253, "phrase": "mas"}, {"score": 0.004183638135671596, "phrase": "software_agents"}, {"score": 0.003823584649521733, "phrase": "emergent_phenomena"}, {"score": 0.003474799999519295, "phrase": "fundamental_physical_interactions"}, {"score": 0.0034262547919775587, "phrase": "simultaneously_the_environment"}, {"score": 0.0032938942910948066, "phrase": "core_notions"}, {"score": 0.003266201217790818, "phrase": "interaction-oriented_design"}, {"score": 0.003140004304719746, "phrase": "design_methodology"}, {"score": 0.0030614606455359574, "phrase": "jedi"}, {"score": 0.0030101827310631915, "phrase": "ioda_concepts"}, {"score": 0.002993282431300233, "phrase": "reactive_agents"}, {"score": 0.0028857130140890787, "phrase": "agent-independent_specification"}, {"score": 0.0027741761880779535, "phrase": "analysis_phase"}, {"score": 0.0026594392054760806, "phrase": "implementation_stage"}, {"score": 0.0023362681721994477, "phrase": "intuitive_plug-and-play_process"}, {"score": 0.002227018955642281, "phrase": "ioda"}, {"score": 0.0021049977753042253, "phrase": "concrete_implementation"}], "paper_keywords": ["Architecture", " Framework", " Interaction", " Design methodology", " Model", " Multi-agent based simulation"], "paper_abstract": "Multi-Agent Systems (MAS) design methodologies and Integrated Development Environments exhibit many interesting properties that also support simulation design. Yet, in their current form, they are not appropriate enough to model Multi-Agent Based Simulations (MABS). Indeed, their design is focused on the functionalities to be achieved by the MAS and the allocation of these functionalities among software agents. In that context, the most important point of design is the organization of the agents and how they communicate with each other. On the opposite, MABS aim at studying emergent phenomena, the origin of which lies in the interactions between entities and their interaction with the environment. In that context, the interactions are not limited to exchanging messages but can also be fundamental physical interactions or any other actions involving simultaneously the environment and one or several agents. To deal with this issue, this paper presents the core notions of the Interaction-Oriented Design of Agent simulations (IODA) approach to simulation design. It includes a design methodology, a model, an architecture and also JEDI, a simple implementation of IODA concepts for reactive agents. First of all, our approach focuses on the design of an agent-independent specification of behaviors, called interactions. These interactions are not limited to the analysis phase of simulation: they are made concrete both in the model and at the implementation stage. In addition, no distinction is made between agents and objects: all entities of the simulation are agents. Owing to this principle, designing which interactions occur between agents, as well as how agents act, is achieved by means of an intuitive plug-and-play process, where interaction abilities are distributed among the agents. Besides, the guidelines provided by IODA are not limited to the specification of the model as they help the designer from the very beginning towards a concrete implementation of the simulation.", "paper_title": "IODA: an interaction-oriented approach for multi-agent based simulations", "paper_id": "WOS:000293295300001"}