{"auto_keywords": [{"score": 0.04953289560992991, "phrase": "optical_communications"}, {"score": 0.010612387000973441, "phrase": "recent_advances"}, {"score": 0.0044688500725247726, "phrase": "communication_system"}, {"score": 0.004342430078306461, "phrase": "system_dynamicity"}, {"score": 0.004053362743156545, "phrase": "individual_wavelength_channels"}, {"score": 0.0038271712887391015, "phrase": "multiple_access_technologies"}, {"score": 0.0034911335714333507, "phrase": "high_data-rate"}, {"score": 0.0032398798149196432, "phrase": "recent_research"}, {"score": 0.002726740692380339, "phrase": "free_space_optics"}, {"score": 0.002649472341607234, "phrase": "data_center_networks"}, {"score": 0.0026041635822373265, "phrase": "primary_purpose"}, {"score": 0.0022041312401435346, "phrase": "new_technologies"}, {"score": 0.0021789194955896124, "phrase": "production_networks"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": [""], "paper_abstract": "Recent advances in optical communications not only increase the capacities of communication system but also improve the system dynamicity and survivability. Various new technologies are invented to increase the bandwidth of individual wavelength channels and the number of wavelengths transmitted per fiber. Multiple access technologies have also been developed to support various emerging applications, including real-time, on-demand and high data-rate applications, in a flexible, cost effective and energy efficient manner. In this paper, we overview recent research in optical communications and focus on the topics of modulation, switching, add-drop multiplexer, coding schemes, detection schemes, orthogonal frequency-division multiplexing, system analysis, cross-layer design, control and management, free space optics, and optics in data center networks. The primary purpose of this paper is to refresh the knowledge and broaden the understanding of advances in optical communications, and to encourage further research in this area and the deployment of new technologies in production networks. (C) 2013 Elsevier Ltd. All rights reserved.", "paper_title": "A survey on recent advances in optical communications", "paper_id": "WOS:000331922800020"}