{"auto_keywords": [{"score": 0.049715817986079144, "phrase": "property_testing"}, {"score": 0.04265136331468511, "phrase": "pair_queries"}, {"score": 0.04234004787461167, "phrase": "neighbor_queries"}, {"score": 0.0348405903524848, "phrase": "query_complexity"}, {"score": 0.00481495049065317, "phrase": "query_types"}, {"score": 0.004444921827311577, "phrase": "general_graphs"}, {"score": 0.003831224748279043, "phrase": "particular_pair"}, {"score": 0.003378385493203297, "phrase": "monotone_decreasing_function"}, {"score": 0.0033399639721674954, "phrase": "average_degree_d"}, {"score": 0.003118410827789671, "phrase": "large_values"}, {"score": 0.003036263091666092, "phrase": "combined_model"}, {"score": 0.002824005136794786, "phrase": "group_testing"}, {"score": 0.0026976391682197133, "phrase": "one-sided_error"}, {"score": 0.0024522007854499554, "phrase": "two-sided_error_algorithms"}, {"score": 0.002324620886282579, "phrase": "dense_graphs"}, {"score": 0.0022981559278396845, "phrase": "sparse_graphs"}, {"score": 0.0021620042653528846, "phrase": "new_tools"}, {"score": 0.0021049977753042253, "phrase": "independent_interest"}], "paper_keywords": ["Property testing", " k-colorability"], "paper_abstract": "We study the power of four query models in the context of property testing in general graphs, where our main case study is the problem of testing k-colorability. Two query types, which have been studied extensively in the past, are pair queries and neighbor queries. The former corresponds to asking whether there is an edge between any particular pair of vertices, and the latter to asking for the i (th) neighbor of a particular vertex. We show that while for pair queries testing k-colorability requires a number of queries that is a monotone decreasing function in the average degree d, the query complexity in the case of neighbor queries remains roughly the same for every density and for large values of k. We also consider a combined model that allows both types of queries, and we propose a new, stronger, query model, related to the field of Group Testing. We give upper and lower bounds on the query complexity for one-sided error in all the models, where the bounds are nearly tight for three of the models. In some of the cases, our lower bounds extend to two-sided error algorithms. The problem of testing k-colorability was previously studied in the contexts of dense graphs and of sparse graphs, and in our proofs we unify approaches from those cases, and also provide some new tools and techniques that may be of independent interest.", "paper_title": "Comparing the strength of query types in property testing: The case of k-colorability", "paper_id": "WOS:000316489300004"}