{"auto_keywords": [{"score": 0.04937176974353987, "phrase": "web_queries"}, {"score": 0.01987624885828621, "phrase": "user_intent"}, {"score": 0.0046046429665581555, "phrase": "purpose_-_web_search_engines"}, {"score": 0.004306205029641728, "phrase": "informational_goal"}, {"score": 0.004118026552723285, "phrase": "specific_web_sites"}, {"score": 0.004053298565839952, "phrase": "user_queries"}, {"score": 0.00399714680711765, "phrase": "web_services"}, {"score": 0.00383668723824441, "phrase": "different_user_intents"}, {"score": 0.003734395484485725, "phrase": "web_search_engines"}, {"score": 0.0034824716857663114, "phrase": "k-means_clustering_approach"}, {"score": 0.003405472159599445, "phrase": "query_traits"}, {"score": 0.0033426036530090205, "phrase": "research_findings"}, {"score": 0.003232341244892437, "phrase": "eight_classifications"}, {"score": 0.002977835845437357, "phrase": "eight_clusters"}, {"score": 0.0027433143290371293, "phrase": "important_contribution"}, {"score": 0.002712794864739074, "phrase": "search_literature"}, {"score": 0.002499094513009327, "phrase": "automatic_classification"}, {"score": 0.002443784721651744, "phrase": "improved_web_search_engines"}, {"score": 0.002398627220761345, "phrase": "specific_user_needs"}, {"score": 0.00229361668293267, "phrase": "automatically_classified_user_queries"}, {"score": 0.0022096205841489786, "phrase": "real_time_classification_method"}, {"score": 0.0021049977753042253, "phrase": "new_application"}], "paper_keywords": ["User interfaces", " Methods of enquiry", " Search engines"], "paper_abstract": "Purpose - Web search engines are frequently used by people to locate information on the Internet. However, not all queries have an informational goal. Instead of information, some people may be looking for specific web sites or may wish to conduct transactions with web services. This paper aims to focus on automatically classifying the different user intents behind web queries. Design/methodology/approach - For the research reported in this paper, 130,000 web search engine queries are categorized as informational, navigational, or transactional using a k-means clustering approach based on a variety of query traits. Findings - The research findings show that more than 75 percent of web queries (clustered into eight classifications) are informational in nature, with about 12 percent each for navigational and transactional. Results also show that web queries fall into eight clusters, six primarily informational, and one each of primarily transactional and navigational. Research limitations/implications - This study provides an important contribution to web search literature because it provides information about the goals of searchers and a method for automatically classifying the intents of the user queries. Automatic classification of user intent can lead to improved web search engines by tailoring results to specific user needs. Practical implications - The paper discusses how web search engines can use automatically classified user queries to provide more targeted and relevant results in web searching by implementing a real time classification method as presented in this research. Originality/value - This research investigates a new application of a method for automatically classifying the intent of user queries. There has been limited research to date on automatically classifying the user intent of web queries, even though the pay-off for web search engines can be quite beneficial.", "paper_title": "Classifying the user intent of User intent of web queries web queries using k-means clustering", "paper_id": "WOS:000285895300006"}