{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "dielectric_values"}, {"score": 0.047084036800444845, "phrase": "iwd"}, {"score": 0.015624504840535786, "phrase": "human_body"}, {"score": 0.015249301349703774, "phrase": "ingestible_wireless_device"}, {"score": 0.012899489253855572, "phrase": "human_body_models"}, {"score": 0.009420136685935826, "phrase": "human_body_tissues"}, {"score": 0.009164467478558362, "phrase": "relative_permittivities"}, {"score": 0.004472760779811399, "phrase": "safety_guidelines"}, {"score": 0.004066360459825868, "phrase": "finite-difference_time-domain_method"}, {"score": 0.003919109076818856, "phrase": "changed_and_unchanged_dielectric_values"}, {"score": 0.0037310040297385346, "phrase": "center_positions"}, {"score": 0.0036403522868511742, "phrase": "operation_frequency"}, {"score": 0.0034549387883559, "phrase": "radiation_intensity"}, {"score": 0.003111874723370265, "phrase": "electric_fields"}, {"score": 0.0029442253041602044, "phrase": "sar_values"}, {"score": 0.0024781140074694205, "phrase": "sar_variation"}, {"score": 0.0021909737736168122, "phrase": "input_power"}, {"score": 0.0021049977753042253, "phrase": "ieee_safety_standards"}], "paper_keywords": ["Dielectric value", " finite-difference time domain (FDTD)", " ingestible wireless device (IWD)", " radiation characteristics", " SAR"], "paper_abstract": "In order to assess the compliance of ingestible wireless device (IWD) within safety guidelines, the SAR, and near fields of IWD in two realistic human body models, whose dielectric values are increased from the original by +/- 10% and +/- 20% are studied using the finite-difference time-domain method. The radiation characteristics of the IWD in the human body models with changed and unchanged dielectric values are compared. Simulations are carried out at 13 scenarios where the IWD is placed at center positions of abdomens in the two models at the operation frequency of 430, 800, and 1200 MHz, respectively. Results show that variation of radiation intensity near the surface of abdomen is around 2.5, 2.6, and 3.5 dB within 20% variation of dielectric values corresponding to the frequency of 430, 800, and 1200 MHz, respectively. Electric fields in the anterior of the human body models are higher than those in the posterior for all scenarios. SAR values increase with the increase of conductivities of human body tissues, and usually decrease with the increase of relative permittivities of human body tissues. The effect of the dielectric values of human body on SAR is orientation-, human-body-, and frequency-dependent. A variation up to 20% in conductivities and relative permittivities alone or simultaneously always causes a SAR variation less than 10%, 20%, and 30% at the frequency of 430, 800, and 1200 MHz, respectively. As far as the compliance of safety was concerned, the IWD was safe to be used at the input power less than 12.6, 9.3, and 8.4 mW, according to the IEEE safety standards at the frequency of 430, 800, and 1200 MHz, respectively.", "paper_title": "Effects of Dielectric Values of Human Body on Specific Absorption Rate Following 430, 800, and 1200 MHz RF Exposure to Ingestible Wireless Device", "paper_id": "WOS:000273710500009"}