{"auto_keywords": [{"score": 0.04198219575078729, "phrase": "mas"}, {"score": 0.01571885600921528, "phrase": "u-commerce_environments"}, {"score": 0.0047839735747931605, "phrase": "purpose_-_taking"}, {"score": 0.004647013794908825, "phrase": "current_applications"}, {"score": 0.004413096646892175, "phrase": "multi-agent_system"}, {"score": 0.004137119737646718, "phrase": "u-e-commerce_environment"}, {"score": 0.003954249185648838, "phrase": "ami"}, {"score": 0.003791621842185417, "phrase": "recommendation_system"}, {"score": 0.0037188360359702182, "phrase": "research_group"}, {"score": 0.003623949225126944, "phrase": "methodological_proposal"}, {"score": 0.0034748763852150465, "phrase": "-_the_evaluation"}, {"score": 0.0033861930947608207, "phrase": "principal_problem"}, {"score": 0.0033643769947857066, "phrase": "current_research"}, {"score": 0.003289117944111902, "phrase": "main_contribution"}, {"score": 0.003194816815998026, "phrase": "different_evaluation_methods"}, {"score": 0.003033776234384367, "phrase": "added_value"}, {"score": 0.0029183300121987422, "phrase": "different_domains"}, {"score": 0.002880829737447174, "phrase": "qualitative_evaluation"}, {"score": 0.00281635677605879, "phrase": "central_piece"}, {"score": 0.0027444334639134217, "phrase": "quantitative_methods"}, {"score": 0.0025642311494861797, "phrase": "single_method"}, {"score": 0.002514947446797848, "phrase": "different_u-commerce_systems"}, {"score": 0.0024826176951198166, "phrase": "new_method"}, {"score": 0.0023346234464901978, "phrase": "u-commerce_domains"}, {"score": 0.0022897425998475362, "phrase": "trust_management_techniques"}, {"score": 0.002195432040517604, "phrase": "context_information"}, {"score": 0.0021049977753042253, "phrase": "different_applications"}], "paper_keywords": ["Applications", " Trust", " Management"], "paper_abstract": "Purpose - Taking into account the importance of e-commerce and the current applications of AT techniques in this area, this research aims to adequate the design of a multi-agent system for the provisioning of e-services in u-commerce environments. This proposal is centred on the methods of evaluation in a u-e-commerce environment. Design/methodology/approach - The multi-agent systems (MAS) approach is based on an MAS model developed for AmI that has been redesigned to support u-commerce. The use of a recommendation system, previously developed by the research group, is suggested for this MAS. The methodological proposal centres on the evaluation of this type of system., Findings - The evaluation of this type of system is the principal problem of current research. Therefore, this is the main contribution of the paper. Research limitations/implications - The different evaluation methods that are proposed, whether qualitative or quantitative, offer the possibility of measuring the added value that the context can give to the use of e-services in different domains of application. Qualitative evaluation should consider the customer as a central piece in the system. In addition, quantitative methods should objectively evaluate the contribution of context to the application. Practical implications - At present, there is no single method for evaluating the benefits of different u-commerce systems, so a new method needs to be found based on these techniques. Originality/value - The research proposes an MAS designed for u-commerce domains, analyzes the capacity of trust management techniques in this environment, and proposes several evaluation methods to show the benefits of context information in the use of e-services. Several real developments are described to show the different applications of MAS in u-commerce and how evaluation is carried out.", "paper_title": "A multi-agent approach for provisioning of e-services in u-commerce environments", "paper_id": "WOS:000280441300004"}