{"auto_keywords": [{"score": 0.04864349780900302, "phrase": "stented_artery"}, {"score": 0.015719716506582538, "phrase": "stent_design"}, {"score": 0.014864646632340564, "phrase": "stent_restenosis"}, {"score": 0.014610885098352344, "phrase": "extrinsic_factors"}, {"score": 0.0047113960612140335, "phrase": "nitric_oxide_transport"}, {"score": 0.004028452405970376, "phrase": "nitric_oxide"}, {"score": 0.0035974243349266894, "phrase": "different_endothelium_coverage"}, {"score": 0.0035662378173267647, "phrase": "high-risk_factors"}, {"score": 0.0034894451015047875, "phrase": "stent_malapposition"}, {"score": 0.0032830808525570903, "phrase": "endothelium_coverage"}, {"score": 0.0029961221584602405, "phrase": "strut_protrusion"}, {"score": 0.0029701328654852246, "phrase": "thicker_strut"}, {"score": 0.002931569771634119, "phrase": "flow_disruption"}, {"score": 0.0024095777415804346, "phrase": "relatively_large_malapposition"}, {"score": 0.002347378595930709, "phrase": "small_malapposition"}, {"score": 0.0023068049914566975, "phrase": "proper_deployment"}, {"score": 0.0022768346311104735, "phrase": "overlapping_strut"}, {"score": 0.002237477619351199, "phrase": "relatively_high_and_uniform_no_concentration"}, {"score": 0.0021049977753042253, "phrase": "relatively_low_no_concentration"}], "paper_keywords": ["Nitric oxide", " Stents", " Restenosis", " Thrombosis", " Hemodynamics"], "paper_abstract": "Extrinsic factors such as stent design, deployment and damage to endothelium are associated with stent restenosis and thrombosis. We hypothesize that these extrinsic factors can affect nitric oxide (NO) concentration and disturb its distribution in the stented artery, hence contributing to stent restenosis and thrombosis. We numerically investigated the effects of different endothelium coverage and high-risk factors including thicker strut, stent malapposition and overlapping on the NO distribution in the stented artery. The decrease in the endothelium coverage would greatly reduce the NO concentration, and the location of the coverage relative to the strut significantly affected its distribution. Strut protrusion and thicker strut would induce flow disruption, which not only decreases NO concentration but also greatly changes NO distribution, leading to very low NO concentration near the strut, especially the distal region. Likewise, strut malapposition and overlap would both diminish the NO concentration. However, the distribution of NO for relatively large malapposition was much evener than that for small malapposition. Moreover, proper deployment of the overlapping strut would result in relatively high and uniform NO concentration. In conclusion, less endothelium coverage, thicker struts and improper stent deployment may decrease NO concentration and lead to relatively low NO concentration near the strut.", "paper_title": "Effects of endothelium, stent design and deployment on the nitric oxide transport in stented artery: a potential role in stent restenosis and thrombosis", "paper_id": "WOS:000351519200005"}