{"auto_keywords": [{"score": 0.04483396309490216, "phrase": "finite_elements"}, {"score": 0.00481495049065317, "phrase": "finite_element_analysis"}, {"score": 0.004326188427877999, "phrase": "basic_overview"}, {"score": 0.004039639718055365, "phrase": "existing_formulations"}, {"score": 0.003971006689166329, "phrase": "possible_sources"}, {"score": 0.0035676056286816915, "phrase": "material_science"}, {"score": 0.00350696416714684, "phrase": "computer_implementation"}, {"score": 0.0032604908177429493, "phrase": "selected_examples"}, {"score": 0.00319134078848996, "phrase": "industrial_metal"}, {"score": 0.0029165216647792924, "phrase": "finite_element_computer_programs"}, {"score": 0.0028060889647071787, "phrase": "metal_forming_technology"}, {"score": 0.0027114323601885666, "phrase": "easy_and_efficient_ways"}, {"score": 0.0025424508991051483, "phrase": "complicated_theoretical_and_numerical_topics"}, {"score": 0.002414861891567233, "phrase": "metal_forming_context"}, {"score": 0.0023839754995935184, "phrase": "-_the_overall_content"}, {"score": 0.0023134312557290043, "phrase": "previous_work"}, {"score": 0.002244969789802093, "phrase": "bulk_metal"}, {"score": 0.0021049977753042253, "phrase": "post-graduate_courses"}], "paper_keywords": ["Finite element analysis", " Metals", " Formed materials", " Computer software"], "paper_abstract": "Purpose - The purpose of this paper is to provide industrial, education and academic users of computer programs a basic overview of finite elements in metal forming that will enable them to recognize the pitfalls of the existing formulations, identify the possible sources of errors and understand the routes for validating their numerical results. Design/methodology/approach - The methodology draws from the fundamentals of the finite elements, plasticity and material science to aspects of computer implementation, modelling, accuracy, reliability and validation. The approach is illustrated and enriched with selected examples obtained from research and industrial metal forming applications. Findings - The presentation is a step towards diminishing the gap being formed between developers of the finite element computer programs and the users having the know-how on the metal forming technology. It is shown that there are easy and efficient ways of refreshing and upgrading the knowledge and skills of the users without resorting to complicated theoretical and numerical topics that go beyond their knowledge and most often are lectured out of metal forming context. Originality/value - The overall content of the paper is enhancement of previous work in the field of sheet and bulk metal forming, and from experience in lecturing these topics to students in graduate and post-graduate courses and to specialists of metal forming from industry.", "paper_title": "Accuracy, reliability and validity of finite element analysis in metal forming: a user's perspective", "paper_id": "WOS:000272105500015"}