{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "uncertain_trajectories"}, {"score": 0.029420333683948783, "phrase": "utgrid"}, {"score": 0.01049200954582652, "phrase": "similarity_search"}, {"score": 0.0047057084749407485, "phrase": "spatiotemporal_trajectories"}, {"score": 0.0046253989970108985, "phrase": "wide_range"}, {"score": 0.0044688500725247726, "phrase": "existing_research"}, {"score": 0.0033152062780180073, "phrase": "top-k_similarity_query"}, {"score": 0.003166259444961177, "phrase": "ksq"}, {"score": 0.0031121406603482112, "phrase": "k_trajectories"}, {"score": 0.002680114113899346, "phrase": "query_processing_algorithms"}, {"score": 0.002574387911697005, "phrase": "effective_pruning"}, {"score": 0.0025014259919355453, "phrase": "extensive_experimental_study"}, {"score": 0.0023480892503414596, "phrase": "effective_indexing_method"}, {"score": 0.002191489192077851, "phrase": "query_performance"}, {"score": 0.0021049977753042253, "phrase": "query_time"}], "paper_keywords": ["Uncertain trajectories", " spatiotemporal similarity", " top-k"], "paper_abstract": "Similarity search on spatiotemporal trajectories has a wide range of applications. Most of existing research focuses on certain trajectories. However, trajectories often are uncertain due to various factors, for example, hardware limitations and privacy concerns. In this paper, we introduce p-distance, a novel and adaptive measure that is able to quantify the dissimilarity between two uncertain trajectories. Based on this measure of dissimilarity, we define top-k similarity query (KSQ) on uncertain trajectories. A KSQ returns the k trajectories that are most similar to a given trajectory in terms of p-distance. To process such queries efficiently, we design UTgrid for indexing uncertain trajectories and develop query processing algorithms that make use of UTgrid for effective pruning. We conduct an extensive experimental study on both synthetic and real data sets. The results indicate that UTgrid is an effective indexing method for similarity search on uncertain trajectories. Our query processing using UTgrid dramatically improves the query performance and scales well in terms of query time and I/O.", "paper_title": "KSQ: Top-k Similarity Query on Uncertain Trajectories", "paper_id": "WOS:000322136900009"}