{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "related_words"}, {"score": 0.04775244230872765, "phrase": "semantically_related_words"}, {"score": 0.004513255056769647, "phrase": "text_corpus"}, {"score": 0.004294052530714228, "phrase": "word_sense_disambiguation"}, {"score": 0.004167653403322565, "phrase": "text_data"}, {"score": 0.004126349202545883, "phrase": "real_world"}, {"score": 0.0037913267098534887, "phrase": "part-of-speech_tagging"}, {"score": 0.003448863509392547, "phrase": "large_corpora"}, {"score": 0.0032324864013225166, "phrase": "semantically_related_sets"}, {"score": 0.0030906666356950887, "phrase": "allied_problems"}, {"score": 0.0027420820738468577, "phrase": "parse_information"}, {"score": 0.0023028105026714533, "phrase": "building_sets"}, {"score": 0.0022016885701010088, "phrase": "traditional_data"}, {"score": 0.002126111716875142, "phrase": "key_results"}, {"score": 0.0021049977753042253, "phrase": "possible_applications"}], "paper_keywords": [""], "paper_abstract": "The task of finding semantically related words from a text corpus has applications in - to name a few - lexicon induction, word sense disambiguation and information retrieval. The text data in real world, say from the World Wide Web, need not be grammatical. Hence methods relying on parsing or part-of-speech tagging will not perform well in these applications. Further even if the text is grammatically correct, for large corpora, these methods may not scale well. The task of building semantically related sets of words from a corpus of documents and allied problems have been studied extensively in the literature. Most of these techniques rely on the usage of part-of-speech or parse information. In this paper, we explore a less expensive method for finding semantically related words from a corpus without parsing or part-of-speech tagging to address the above problems. This work focuses on building sets of semantically related words from a corpus of documents using traditional data clustering techniques. We examine some key results and possible applications of this work.", "paper_title": "Building clusters of related words: An unsupervised approach", "paper_id": "WOS:000240091500051"}