{"auto_keywords": [{"score": 0.047897251319073395, "phrase": "news_stories"}, {"score": 0.03302176259272706, "phrase": "news_story"}, {"score": 0.015719716506582538, "phrase": "top_news_stories"}, {"score": 0.008686650063536739, "phrase": "language_models"}, {"score": 0.008505261145950582, "phrase": "blog_posts"}, {"score": 0.007849591363052067, "phrase": "temporal_profile"}, {"score": 0.004634799977448855, "phrase": "huge_volume"}, {"score": 0.0044424917428102445, "phrase": "daily_basis"}, {"score": 0.004258128672571261, "phrase": "important_ones"}, {"score": 0.003978866233891427, "phrase": "important_news_stories"}, {"score": 0.0037495207047193034, "phrase": "information_source"}, {"score": 0.003578600071301459, "phrase": "diverse_opinions"}, {"score": 0.0021049977753042253, "phrase": "proposed_approaches"}], "paper_keywords": ["Blog retrieval", " Blogosphere", " Top news stories identification", " Language model approach"], "paper_abstract": "A huge volume of news stories are reported by various news channels, on a daily basis. Subscribing to all the stories and keeping track of the important ones day after day is very time-consuming. This paper proposes several approaches to identify important news stories. To this end, we take advantage of the blogosphere as an information source to evaluate the importance of news stories. Blogs reflect the diverse opinions of bloggers about news stories, and the attention that these stories receive can help estimate the importance of the stories. In this paper, we define the popularity of a news story in the blogosphere as the attention it attracts from users. We measure popularity of the stories in the blogosphere from two viewpoints: content and a timeline. In terms of content, we suggest several approaches to estimate language models for a news story and blog posts, and we evaluate the importance of the story using these language models. Furthermore, we generate a temporal profile of a news story by exploring the timeline of blog posts related to the story, and evaluate its importance based on the temporal profile. We experimentally verify the effectiveness of the proposed approaches for identifying top news stories.", "paper_title": "Identifying top news stories based on their popularity in the blogosphere", "paper_id": "WOS:000339824800002"}