{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "corner_detectors"}, {"score": 0.0047559432344272, "phrase": "consistency_and_accuracy_measures"}, {"score": 0.00428257928723, "phrase": "published_corner_detectors"}, {"score": 0.004178198896815672, "phrase": "theoretical_criteria"}, {"score": 0.0033457659530207306, "phrase": "performance_evaluation"}, {"score": 0.0033047037762521984, "phrase": "corner_detection_algorithms"}, {"score": 0.0026133424923929227, "phrase": "uniform_scaling"}, {"score": 0.002367315484467406, "phrase": "ground_truth"}, {"score": 0.002323826502178581, "phrase": "majority_human_judgement"}, {"score": 0.002225426912273257, "phrase": "enhanced_css_corner_detector"}], "paper_keywords": ["corner detection", " CSS", " performance evaluation", " consistency", " accuracy"], "paper_abstract": "This paper evaluates the performance of several popular corner detectors using two newly defined criteria. The majority of authors of published corner detectors have not used theoretical criteria to measure the consistency and accuracy of their algorithms. They usually only illustrate their results on a few Lest images and may compare the results Visually to the results of other corner detectors. Some authors have proposed various criteria for performance evaluation of corner detection algorithms but those criteria have a number of shortcomings. We propose two new criteria to evaluate the performance of corner detectors. Our proposed criteria are consistency and accuracy. These criteria were measured using several test images and experiments such as rotation, uniform scaling, non-uniform scaling and affine transforms. To measure accuracy, we created ground truth based on majority human judgement. The results show that the enhanced CSS corner detector performs better according to these criteria. (c) 2005 Elsevier Inc. All rights reserved.", "paper_title": "Performance evaluation of corner detectors using consistency and accuracy measures", "paper_id": "WOS:000236655600007"}