{"auto_keywords": [{"score": 0.04072472046898861, "phrase": "ribbon_surface"}, {"score": 0.03818527090889823, "phrase": "framed_centerline_curve"}, {"score": 0.00481495049065317, "phrase": "inextensible_ribbon"}, {"score": 0.004574085781766281, "phrase": "isometric_deformations"}, {"score": 0.00421340730888561, "phrase": "geometric_representation"}, {"score": 0.004002513373645485, "phrase": "interesting_behaviors"}, {"score": 0.0035565113234273926, "phrase": "elastic_and_kinetic_energy"}, {"score": 0.00325901518290063, "phrase": "numerical_singularity"}, {"score": 0.002955782731675529, "phrase": "off-centerline_part"}, {"score": 0.002851301751761804, "phrase": "kinetic_energy"}, {"score": 0.0027505037762786087, "phrase": "centerline_velocity"}, {"score": 0.0026532596852754525, "phrase": "time_step"}, {"score": 0.002357249810661667, "phrase": "qualitative_analysis"}, {"score": 0.0023331227492950422, "phrase": "ribbon_specific_phenomena_comparisons"}, {"score": 0.002309242063033298, "phrase": "real-world_scenarios"}, {"score": 0.0022047613106966745, "phrase": "shell_model"}], "paper_keywords": [""], "paper_abstract": "Narrow, inextensible, and naturally flat ribbons have some special and interesting phenomena under isometric deformations. Although a ribbon has a shape between rod and shell, directly applying the geometric representation designed for them imposes a challenge to faithfully reproduce interesting behaviors. We thus parameterize the ribbon surface as a developable ruled surface along its centerline and represent it using a framed centerline curve. Then the elastic and kinetic energy of the ribbon surface can be equivalently yet compactly described by the framed centerline curve only. To avoid numerical singularity when develop ability is violated, a finite Taylor series approximation to the potential energy is adopted. Under the observation that the off-centerline part of ribbon contributes little dynamic effect, the kinetic energy is simplified with respect to the centerline velocity only. For efficiency, each time step is separated into two stages: dynamically evolving the centerline, and then quasi-statically updating the ruling. We validate the method with qualitative analysis and ribbon specific phenomena comparisons with real-world scenarios. A set of comparisons to rod and shell model is also provided to demonstrate the advantages of our method.", "paper_title": "Geometrically Exact Simulation of Inextensible Ribbon", "paper_id": "WOS:000363216500014"}