{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "synchronous_online_communication"}, {"score": 0.0045820747375409435, "phrase": "elementary_school_students"}, {"score": 0.004506968388996092, "phrase": "synchronous_online_collaborative_learning"}, {"score": 0.003757480190200645, "phrase": "three-member_groups"}, {"score": 0.0036352070472201086, "phrase": "collaborative_learning_system"}, {"score": 0.003516898780234098, "phrase": "group_assignment"}, {"score": 0.003440166097491567, "phrase": "shared_concept_map"}, {"score": 0.0033651019362620866, "phrase": "textual_discussions"}, {"score": 0.003309877074892399, "phrase": "individual_student"}, {"score": 0.0031669873302916, "phrase": "cluster_analysis"}, {"score": 0.0028360962841331634, "phrase": "online_collaboration"}, {"score": 0.0027437235598539904, "phrase": "distinct_style"}, {"score": 0.0024434201175883674, "phrase": "task-oriented_pattern"}, {"score": 0.0023768935613577985, "phrase": "communicative_behaviours"}, {"score": 0.0021049977753042253, "phrase": "group_collaboration"}], "paper_keywords": ["computer-mediated communication", " collaborative learning", " distributed cognition", " diversity", " user modelling"], "paper_abstract": "This research investigated how differently elementary school students participate in synchronous online collaborative learning by analyzing their discussions with their partners. Two hundred and seventy-eight Taiwanese students, ranging in age from 11 to 12 years old, were involved in this study. The students were randomly arranged within-class into three-member groups. Each group used a collaborative learning system to discuss and accomplish a group assignment (creating a shared concept map). The textual discussions by each individual student were collected, categorized and accumulated. Cluster analysis was adopted to statistically classify students based on their discussion characteristics. We found that a student, while participating in online collaboration and communication, exhibited a distinct style: less contributing, coordination emphasizing, communicative, or task-oriented. In addition, students exhibiting the task-oriented pattern and students predominantly showing communicative behaviours were found to have better learning performance and retain more knowledge than students observed to be coordination emphasizing or less contributing within group collaboration.", "paper_title": "Elementary students' participation style in synchronous online communication and collaboration", "paper_id": "WOS:000283319200001"}