{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "agglomeration_contraction_principle"}, {"score": 0.035740142275071274, "phrase": "vital_gateway_nodes"}, {"score": 0.004776297980616768, "phrase": "wireless_sensor_networks"}, {"score": 0.004718897469501381, "phrase": "node_importance_evaluation"}, {"score": 0.003951800212882157, "phrase": "novel_node_importance_evaluation_method"}, {"score": 0.0035439655241057207, "phrase": "network_fracture"}, {"score": 0.003431384878608803, "phrase": "spectral_analysis"}, {"score": 0.0032956583072431423, "phrase": "nontrivial_eigenvectors"}, {"score": 0.0032559935867182035, "phrase": "laplace_matrix"}, {"score": 0.003216804708106142, "phrase": "network_diagram"}, {"score": 0.003077092305006702, "phrase": "particular_individuals"}, {"score": 0.0029553380263320195, "phrase": "betweenness_centrality"}, {"score": 0.0027704444816096505, "phrase": "superenergy_nodes"}, {"score": 0.0027370835853738626, "phrase": "targeted_protection"}, {"score": 0.002218526133566788, "phrase": "final_experiments"}, {"score": 0.002165388556451298, "phrase": "proposed_method"}], "paper_keywords": [""], "paper_abstract": "The node importance evaluation based on removal of nodes and their incident links cannot accurately reflect the importance of the nodes, because such approach may change the topology of the network, and even split the network into several disconnected parts. To solve this problem, we propose a novel node importance evaluation method based on agglomeration contraction principle. This method does not require the node being evaluated to be removed from the network; thus, it may not cause network fracture. With this method, aided by spectral analysis, the vital gateway nodes can be identified by using the nontrivial eigenvectors of the Laplace matrix of the network diagram. Then, a formula to estimate the importance of particular individuals within the network is proposed; moreover, the betweenness centrality and the positions of nodes are taken into consideration. At last, using some superenergy nodes to provide targeted protection for the vital gateway nodes in the network, the life of the network can be prolonged and the robustness of the system improved effectively. Above all, with this method, the number of nodes to be evaluated in a network can be reduced, and the computation decreased accordingly. Final experiments verify the efficiency of the proposed method and the result is consistent with our intuitive judgments.", "paper_title": "A Novel Node Importance Evaluation Method Based on Agglomeration Contraction Principle for Wireless Sensor Networks", "paper_id": "WOS:000338874300001"}