{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "contextual_information"}, {"score": 0.008261540009984483, "phrase": "semantic_gap"}, {"score": 0.006854501694840221, "phrase": "web_pages"}, {"score": 0.0047864177420244795, "phrase": "web_images"}, {"score": 0.0047434034169693915, "phrase": "textual_components"}, {"score": 0.004632469280786256, "phrase": "semantic_descriptors"}, {"score": 0.0045370785151713396, "phrase": "i.e._the_gap"}, {"score": 0.004391114318381004, "phrase": "broken_vertical_bar"}, {"score": 0.004275173711009189, "phrase": "image_content"}, {"score": 0.004212084623472799, "phrase": "important_web-based_tasks"}, {"score": 0.004004436217742343, "phrase": "rich_knowledge"}, {"score": 0.003933609372601274, "phrase": "relative_success"}, {"score": 0.003898665270269876, "phrase": "commercial_search_engines"}, {"score": 0.003706410380455668, "phrase": "unpredictable_quality"}, {"score": 0.0036408354779365643, "phrase": "major_limiting_factor"}, {"score": 0.003513133457324989, "phrase": "image_contextual_information"}, {"score": 0.0033299015941662302, "phrase": "first_issue"}, {"score": 0.0032807160037434317, "phrase": "large-scale_studies"}, {"score": 0.00309111006303751, "phrase": "web_page"}, {"score": 0.003009390313137981, "phrase": "different_types"}, {"score": 0.002991524908432975, "phrase": "content_layouts"}, {"score": 0.0028354207806133153, "phrase": "state-of-the-art_automated_extraction_tools"}, {"score": 0.002639845784408318, "phrase": "syntactic_and_semantic_characterizations"}, {"score": 0.0024431289979171505, "phrase": "coherent_structures"}, {"score": 0.0024070101893580408, "phrase": "image_indexing"}, {"score": 0.0023927122637929813, "phrase": "retrieval_frameworks"}, {"score": 0.0022813374895267664, "phrase": "generic_context-based_web_image_understanding_framework"}, {"score": 0.002214370556271579, "phrase": "topical_issues"}, {"score": 0.002142970278347126, "phrase": "automated_information_extraction"}, {"score": 0.0021049977753042253, "phrase": "identified_stages"}], "paper_keywords": ["Image understanding/description", " Image retrieval", " Web contextual information", " Webpage segmentation", " Automatic information extraction", " Natural language processing"], "paper_abstract": "The contextual information of Web images is investigated to address the issue of characterizing their content with semantic descriptors and therefore bridge the semantic gap, i.e. the gap between their automated low-level representation in terms of colors, textures, shapesaEuro broken vertical bar and their semantic interpretation. Such characterization allows for understanding the image content and is crucial in important Web-based tasks such as image indexing and retrieval. Although we are highly motivated by the availability of rich knowledge on the Web and the relative success achieved by commercial search engines in automatically characterizing the image content using contextual information in Web pages, we are aware that the unpredictable quality of the contextual information is a major limiting factor. Among the reasons explaining the difficulty to leverage on the image contextual information, some problems are related to the characterization and extraction of this information. Indeed, the first issue is the lack of large-scale studies to highlight what is considered the relevant contextual information of an image, where it is located in a Web page and whether it is consistent across Web pages of different types, content layouts and domains. Also, the matter related to the extraction of this contextual information is topical as state-of-the-art automated extraction tools are unable to handle the heterogeneous Web. As far as the processing of the contextual information is concerned, problems linked to the syntactic and semantic characterizations of the textual components are important to address in order to tackle the semantic gap. Furthermore, questions pertaining to the organization of these textual components into coherent structures that are usable in image indexing and retrieval frameworks shall arise. To address these issues, we lay down the anatomy of a generic context-based Web image understanding framework and propose its stage-based decomposition, covering topical issues from information indexing and retrieval, image description models, natural language processing, webpage segmentation and automated information extraction. For each of the identified stages, we review state-of-the-art solutions in the literature categorized and analyzed under the light of the techniques used.", "paper_title": "Image understanding and the web: a state-of-the-art review", "paper_id": "WOS:000342150600004"}