{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "ahmw"}, {"score": 0.024495601053047756, "phrase": "exploration_time"}, {"score": 0.004623224002010226, "phrase": "embarrassingly_parallel_applications"}, {"score": 0.0044692705329574, "phrase": "parallel_distributed_computing"}, {"score": 0.0043058107942196945, "phrase": "large_computational_grids"}, {"score": 0.004262273304740847, "phrase": "natural_way"}, {"score": 0.003983016985197904, "phrase": "hierarchical_mw"}, {"score": 0.00338493754743055, "phrase": "hmw_paradigm"}, {"score": 0.003272083495778595, "phrase": "new_dynamic_adaptive_multi-layer"}, {"score": 0.003006087482938274, "phrase": "task_management"}, {"score": 0.0028280256704977746, "phrase": "dynamic_collaborative"}, {"score": 0.002724428781940696, "phrase": "parallel_branch"}, {"score": 0.0027060037347363987, "phrase": "bound_algorithm"}, {"score": 0.002660482980203146, "phrase": "flow-shop_scheduling_problem"}, {"score": 0.0025804616931593897, "phrase": "proactive_grid_middleware"}, {"score": 0.0025543250296793554, "phrase": "large_experiments"}, {"score": 0.0024358027662024105, "phrase": "high_scalability"}, {"score": 0.0024111277643627154, "phrase": "proposed_approach"}, {"score": 0.0023625233416109917, "phrase": "deployment_cost"}, {"score": 0.002237639857653203, "phrase": "hmw"}, {"score": 0.0022226498082470163, "phrase": "mw"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Master-worker", " Hierarchical master-worker", " Grid computing", " Branch and bound", " Large scale experiments"], "paper_abstract": "Well-suited to embarrassingly parallel applications, the master-worker (MW) paradigm has largely and successfully used in parallel distributed computing. Nevertheless, such a paradigm is very limited in scalability in large computational grids. A natural way to improve the scalability is to add a layer of masters between the master and the workers making a hierarchical MW (HMW). In most existing HMW frameworks and algorithms, only a single layer of masters is used, the hierarchy is statically built and the granularity of tasks is fixed. Such frameworks and algorithms are not adapted to grids which are volatile, heterogeneous and large scale environments. In this paper, we revisit the HMW paradigm to match such characteristics of grids. We propose a new dynamic adaptive multi-layer hierarchical MW (AHMW) dealing with the scalability, volatility and heterogeneity issues. The construction and deployment of the hierarchy and the task management (deployment, decomposition of work, distribution of tasks, ...) are performed in a dynamic collaborative distributed way. The framework has been applied to the parallel Branch and Bound algorithm and experimented on the Flow-Shop scheduling problem. The implementation has been performed using the ProActive grid middleware and the large experiments have been conducted using about 2000 processors from the Grid'5000 French nation-wide grid infrastructure. The results demonstrate the high scalability of the proposed approach and its efficiency in terms of deployment cost, decomposition and distribution of work and exploration time. The results show that AHMW outperforms HMW and MW in scalability and efficiency in terms of deployment and exploration time. (C) 2011 Elsevier Inc. All rights reserved.", "paper_title": "An adaptive hierarchical master-worker (AHMW) framework for grids-Application to B&B algorithms", "paper_id": "WOS:000299139000003"}