{"auto_keywords": [{"score": 0.04571345706034808, "phrase": "penalty_coefficients"}, {"score": 0.02933362925417577, "phrase": "experimental_results"}, {"score": 0.02637226885302328, "phrase": "proposed_algorithms"}, {"score": 0.004539005582217305, "phrase": "constrained_optimization_problems"}, {"score": 0.004417012437860011, "phrase": "penalty_function_methods"}, {"score": 0.0041827333568982055, "phrase": "appropriate_penalty_coefficients"}, {"score": 0.0041074234667687875, "phrase": "right_balance"}, {"score": 0.003907212558276185, "phrase": "stochastic_ranking"}, {"score": 0.0038194503801108324, "phrase": "constraint-domination_principle"}, {"score": 0.0033630629374009576, "phrase": "first_time"}, {"score": 0.0033175095965171674, "phrase": "multiobjective_evolutionary_algorithm"}, {"score": 0.003015401937358271, "phrase": "new_algorithms"}, {"score": 0.002934237411711622, "phrase": "cf-series_test_instances"}, {"score": 0.0028422946420821075, "phrase": "igd-metric"}, {"score": 0.002694538341016249, "phrase": "idea"}, {"score": 0.0022231672375522316, "phrase": "cdp"}], "paper_keywords": ["Constrained multiobjective optimization", " Constraint-domination principle", " Decomposition", " MOEA/D", " Stochastic ranking"], "paper_abstract": "Penalty functions are frequently employed for handling constraints in constrained optimization problems (COPs). In penalty function methods, penalty coefficients balance objective and penalty functions. However, finding appropriate penalty coefficients to strike the right balance is often very hard. They are problems dependent. Stochastic ranking (SR) and constraint-domination principle (CDP) are two promising penalty functions based constraint handling techniques that avoid penalty coefficients. In this paper, the extended/modified versions of SR and CDP are implemented for the first time in the multiobjective evolutionary algorithm based on decomposition (MOEA/D) framework. This led to two new algorithms, CMOEA/D-DE-SR and CMOEA/D-DE-CDP. The performance of these new algorithms is tested on CTP-series and CF-series test instances in terms of the HV-metric, IGD-metric, and SC-metric. The experimental results are compared with NSGA-II, IDEA, and the three best performers of CEC 2009 MOEA competition, which showed better and competitive performance of the proposed algorithms on most test instances of the two test suits. The sensitivity of the performance of proposed algorithms to parameters is also investigated. The experimental results reveal that CDP works better than SR in the MOEA/D framework. (C) 2012 Elsevier B. V. All rights reserved.", "paper_title": "A study of two penalty-parameterless constraint handling techniques in the framework of MOEA/D", "paper_id": "WOS:000311506900010"}