{"auto_keywords": [{"score": 0.04683590293207774, "phrase": "mobile_devices"}, {"score": 0.0291536686641468, "phrase": "search_results_pages"}, {"score": 0.015719716506582538, "phrase": "user_behavior"}, {"score": 0.01003167523592064, "phrase": "search_performance"}, {"score": 0.004725886853744007, "phrase": "web_search"}, {"score": 0.004681971826924847, "phrase": "large_and_small_screens"}, {"score": 0.004304574865291508, "phrase": "relatively_small_screens"}, {"score": 0.0034398445347109396, "phrase": "web_searches"}, {"score": 0.003206916619690171, "phrase": "mobile_device"}, {"score": 0.0027100527874262446, "phrase": "smaller_screens"}, {"score": 0.0025741370320813968, "phrase": "infrequent_use"}, {"score": 0.002538263784314365, "phrase": "scroll_function"}, {"score": 0.0023662411481713682, "phrase": "significant_difference"}, {"score": 0.0021447748132703078, "phrase": "presentation_design"}, {"score": 0.0021049977753042253, "phrase": "small_devices"}], "paper_keywords": ["human computer interaction", " searching", " web pages"], "paper_abstract": "In recent years, searching the web on mobile devices has become enormously popular. Because mobile devices have relatively small screens and show fewer search results, search behavior with mobile devices may be different from that with desktops or laptops. Therefore, examining these differences may suggest better, more efficient designs for mobile search engines. In this experiment, we use eye tracking to explore user behavior and performance. We analyze web searches with 2 task types on 2 differently sized screens: one for a desktop and the other for a mobile device. In addition, we examine the relationships between search performance and several search behaviors to allow further investigation of the differences engendered by the screens. We found that users have more difficulty extracting information from search results pages on the smaller screens, although they exhibit less eye movement as a result of an infrequent use of the scroll function. However, in terms of search performance, our findings suggest that there is no significant difference between the 2 screens in time spent on search results pages and the accuracy of finding answers. This suggests several possible ideas for the presentation design of search results pages on small devices.", "paper_title": "Eye-Tracking Analysis of User Behavior and Performance in Web Search on Large and Small Screens", "paper_id": "WOS:000350100500008"}