{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "highly_predictive_comfa_and_comsia_models"}, {"score": 0.004403480614319231, "phrase": "three-dimensional_quantitative_structure-activity_relationship_models"}, {"score": 0.00409508755819924, "phrase": "comparative_molecular_similarity"}, {"score": 0.003166751241099304, "phrase": "hydrogen-bond_donor"}, {"score": 0.0031315358193567708, "phrase": "hydrogen-bond_acceptor"}, {"score": 0.0030794433253250476, "phrase": "hydrophobic_effects"}, {"score": 0.0028795712616923462, "phrase": "experimental_biological_activity"}, {"score": 0.0027690086059100495, "phrase": "training-series_subsets"}, {"score": 0.002707741309851526, "phrase": "wide_range"}, {"score": 0.0025604233506352375, "phrase": "inertial_alignment"}, {"score": 0.0024620842899061614, "phrase": "manual_adjustment"}, {"score": 0.0023807981747706376, "phrase": "active_site"}], "paper_keywords": [""], "paper_abstract": "Three-dimensional quantitative structure-activity relationship models have been derived using comparative molecular field analysis (CoMFA) and comparative molecular similarity indices analysis (CoMSIA) for two training sets of arylsulfonyl isoquinoline-based and thazine/thiazepine-based matrix metalloproteinase inhibitors (MMPIs). The crystal structure of stromelysin-1 (MMP-3) was used to pinpoint areas on the ligands and receptors where steric and electrostatic effects (for CoMFA) and steric, electrostatic, hydrogen-bond donor, hydrogen-bond acceptor, and hydrophobic effects (for CoMSIA) correlate with an increase or decrease in experimental biological activity. The most predictive CoMFA and CoMSIA models were obtained using training-series subsets that sampled a wide range of activities, together with docking and scoring, inertial alignment, investigation of various partial charge formalisms, and manual adjustment of each compound within the active site. The models developed in this study are in agreement with experimentally observed MMP-3 structure-activity relationship data and offer new insights into binding modes involving the partly solvent-exposed S1-S2' subpocket and certain zinc-chelating groups.", "paper_title": "Highly predictive CoMFA and CoMSIA models for two series of stromelysin-1 (MMP-3) inhibitors elucidate S1 ' and S1-S2 ' binding modes", "paper_id": "WOS:000239204400025"}