{"auto_keywords": [{"score": 0.04810827982024647, "phrase": "ngs"}, {"score": 0.015719635110201583, "phrase": "copy_number_variations"}, {"score": 0.015575160015863732, "phrase": "next-generation_sequencing"}, {"score": 0.010459598082711958, "phrase": "cnv_detection"}, {"score": 0.004447600571127578, "phrase": "relatively_new_and_challenging_field"}, {"score": 0.00436530211426514, "phrase": "accepted_standard_protocols"}, {"score": 0.004324723240308028, "phrase": "quality_control_measures"}, {"score": 0.0032219438233946312, "phrase": "potential_biases"}, {"score": 0.002422249273477746, "phrase": "real_data"}, {"score": 0.0022580713471027996, "phrase": "repeated_regions"}, {"score": 0.002195552442011313, "phrase": "current_gc-correction_algorithms"}, {"score": 0.0021447748132703078, "phrase": "doc_algorithm"}, {"score": 0.0021049977753042253, "phrase": "quality_control"}], "paper_keywords": [""], "paper_abstract": "Motivation: Analysing next-generation sequencing (NGS) data for copy number variations (CNVs) detection is a relatively new and challenging field, with no accepted standard protocols or quality control measures so far. There are by now several algorithms developed for each of the four broad methods for CNV detection using NGS, namely the depth of coverage (DOC), read-pair, split-read and assembly-based methods. However, because of the complexity of the genome and the short read lengths from NGS technology, there are still many challenges associated with the analysis of NGS data for CNVs, no matter which method or algorithm is used. Results: In this review, we describe and discuss areas of potential biases in CNV detection for each of the four methods. In particular, we focus on issues pertaining to (i) mappability, (ii) GC-content bias, (iii) quality control measures of reads and (iv) difficulty in identifying duplications. To gain insights to some of the issues discussed, we also download real data from the 1000 Genomes Project and analyse its DOC data. We show examples of how reads in repeated regions can affect CNV detection, demonstrate current GC-correction algorithms, investigate sensitivity of DOC algorithm before and after quality control of reads and discuss reasons for which duplications are harder to detect than deletions.", "paper_title": "Statistical challenges associated with detecting copy number variations with next-generation sequencing", "paper_id": "WOS:000310155300001"}