{"auto_keywords": [{"score": 0.04517876325336135, "phrase": "product_uncertainty"}, {"score": 0.011709838638603929, "phrase": "online_markets"}, {"score": 0.011016057524451998, "phrase": "used_cars"}, {"score": 0.007085480495500678, "phrase": "seller_uncertainty"}, {"score": 0.004802451987199256, "phrase": "ebay_motors"}, {"score": 0.004778088905211055, "phrase": "theory_and_evidence._online_markets"}, {"score": 0.00427410962921379, "phrase": "buyer's_difficulty"}, {"score": 0.0042250952759280225, "phrase": "product_characteristics"}, {"score": 0.0039474533359286045, "phrase": "price_premiums"}, {"score": 0.0034993519231560637, "phrase": "information_asymmetry_literature"}, {"score": 0.002703869368554536, "phrase": "diagnostic_product_descriptions"}, {"score": 0.002683125911877974, "phrase": "third-party_product_assurances"}, {"score": 0.0026117657828249137, "phrase": "structural_model"}, {"score": 0.0025619562094446884, "phrase": "unique_dataset"}, {"score": 0.002532526438148958, "phrase": "secondary_transaction_data"}, {"score": 0.002465161736207254, "phrase": "primary_data"}, {"score": 0.002256155453630723, "phrase": "stronger_effect"}, {"score": 0.0021294699637639564, "phrase": "study's_implications"}, {"score": 0.0021049977753042253, "phrase": "emerging_role"}], "paper_keywords": ["Product uncertainty", " information signals", " price premiums", " online auction markets", " eBay Motors"], "paper_abstract": "Online markets pose a difficulty for evaluating products, particularly experience goods, such as used cars, that cannot be easily described online. This exacerbates product uncertainty, the buyer's difficulty in evaluating product characteristics, and predicting how a product will perform in the future. However, the IS literature has focused on seller uncertainty and ignored product uncertainty. To address this void, this study conceptualizes product uncertainty and examines its effects and antecedents in online markets for used cars (eBay Motors). Extending the information asymmetry literature from the seller to the product, we first theorize the nature and dimensions (description and performance) of product uncertainty. Second, we propose product uncertainty to be distinct from,,yet shaped by, seller uncertainty. Third, we conjecture product uncertainty to negatively affect price premiums in online markets beyond seller uncertainty. Fourth, based on the information signaling literature, we describe how information signals (diagnostic product descriptions and third-party product assurances) reduce product uncertainty. The structural model is validated by a unique dataset comprised of secondary transaction data from used cars on eBay Motors matched with primary data from 331 buyers who bid on these used cars. The results distinguish between product and seller uncertainty, show that product uncertainty has a stronger effect on price premiums than seller uncertainty, and identify the most influential information signals that reduce product uncertainty. The study's implications for the emerging role of product uncertainty in online markets are discussed.", "paper_title": "ON PRODUCT UNCERTAINTY IN ONLINE MARKETS: THEORY AND EVIDENCE", "paper_id": "WOS:000304296400005"}