{"auto_keywords": [{"score": 0.043921956330764476, "phrase": "multicast_tree"}, {"score": 0.02443753885391286, "phrase": "proposed_algorithm"}, {"score": 0.010324950711809262, "phrase": "degree-dependent_node_costs"}, {"score": 0.00481495049065317, "phrase": "constructing_degree-dependent_node-weighted_multicast_trees"}, {"score": 0.004613175917207636, "phrase": "minimum-cost_multicast_tree"}, {"score": 0.004554353265299143, "phrase": "steiner"}, {"score": 0.003218823621926739, "phrase": "novel_technique"}, {"score": 0.003044313656896057, "phrase": "approximation_algorithm"}, {"score": 0.0030054007508185858, "phrase": "degree-dependent_node-weighted_steiner_tree_problem"}, {"score": 0.002842428606954139, "phrase": "proposed_approximation_algorithm"}, {"score": 0.0025099367332615794, "phrase": "minimum-cost_steiner_tree_t"}, {"score": 0.002264321283759897, "phrase": "distributed_implementation"}, {"score": 0.0021049977753042253, "phrase": "degree-dependent_node-weighted_constrained_forest_problem"}], "paper_keywords": ["Multicast tree", " Steiner tree", " degree-dependent node costs", " approximation algorithm", " constrained forest"], "paper_abstract": "This paper studies the problem of constructing a minimum-cost multicast tree (or Steiner tree) in which each node is associated with a cost that is dependent on its degree in the multicast tree. The cost of a node may depend on its degree in the multicast tree due to a number of reasons. For example, a node may need to perform various processing for sending messages to each of its neighbors in the multicast tree. Thus, the overhead for processing the messages increases as the number of neighbors increases. This paper devises a novel technique to deal with the degree-dependent node costs and applies the technique to develop an approximation algorithm for the degree-dependent node-weighted Steiner tree problem. The bound on the cost of the tree constructed by the proposed approximation algorithm is derived to be (2 ln k/2 + 1) (W-T* + B), where k is the size of the set of multicast members, W-T* is the cost of a minimum-cost Steiner tree T*, and B is related to the degree-dependent node costs. Simulations are carried out to study the performance of the proposed algorithm. A distributed implementation of the proposed algorithm is presented. In addition, the proposed algorithm is generalized to solve the degree-dependent node-weighted constrained forest problem.", "paper_title": "An Approximation Algorithm for Constructing Degree-Dependent Node-Weighted Multicast Trees", "paper_id": "WOS:000342178200005"}