{"auto_keywords": [{"score": 0.04959124618297068, "phrase": "image_processing"}, {"score": 0.00481495049065317, "phrase": "bimodal_co-sparse_analysis"}, {"score": 0.004527947981009528, "phrase": "different_image_modalities"}, {"score": 0.004405919996432158, "phrase": "corresponding_information"}, {"score": 0.004200197763119297, "phrase": "low_level"}, {"score": 0.004143196873246147, "phrase": "sparse_signal_models"}, {"score": 0.0039362209515303795, "phrase": "so-called_co-sparse_analysis_model"}, {"score": 0.003516417950483685, "phrase": "bimodal_co-sparse_analysis_model"}, {"score": 0.0032728171827367068, "phrase": "analysis_operators_exists"}, {"score": 0.0031845067058084583, "phrase": "corresponding_bimodal_image_structures"}, {"score": 0.003152006152091526, "phrase": "large_overlap"}, {"score": 0.002994396880146532, "phrase": "registered_and_noise-free_training_data"}, {"score": 0.002854392852477005, "phrase": "linear_inverse_problems"}, {"score": 0.002730240935688002, "phrase": "bimodal_image_registration_tasks"}, {"score": 0.0025409639091476363, "phrase": "learning_process"}, {"score": 0.002324657548285756, "phrase": "local_texture"}, {"score": 0.002285216591220303, "phrase": "image_modalities"}, {"score": 0.002170854875902186, "phrase": "novel_bimodal_image_registration_algorithm"}, {"score": 0.0021340178074057245, "phrase": "transformation_parameters"}, {"score": 0.0021194582289403925, "phrase": "unregistered_images"}, {"score": 0.0021049977753042253, "phrase": "different_modalities"}], "paper_keywords": ["Co-sparse analysis model", " Bimodal image reconstruction", " Bimodal image registration", " Gradient methods on manifolds", " Analysis operator learning"], "paper_abstract": "The success of many computer vision tasks lies in the ability to exploit the interdependency between different image modalities such as intensity and depth. Fusing corresponding information can be achieved on several levels, and one promising approach is the integration at a low level. Moreover, sparse signal models have successfully been used in many vision applications. Within this area of research, the so-called co-sparse analysis model has attracted considerably less attention than its well-known counterpart, the sparse synthesis model, although it has been proven to be very useful in various image processing applications. In this paper, we propose a bimodal co-sparse analysis model that is able to capture the interdependency of two image modalities. It is based on the assumption that a pair of analysis operators exists, so that the co-supports of the corresponding bimodal image structures have a large overlap. We propose an algorithm that is able to learn such a coupled pair of operators from registered and noise-free training data. Furthermore, we explain how this model can be applied to solve linear inverse problems in image processing and how it can be used as a prior in bimodal image registration tasks. This paper extends the work of some of the authors by two major contributions. Firstly, a modification of the learning process is proposed that a priori guarantees unit norm and zero-mean of the rows of the operator. This accounts for the intuition that local texture carries the most important information in image modalities independent of brightness and contrast. Secondly, the model is used in a novel bimodal image registration algorithm, which estimates the transformation parameters of unregistered images of different modalities.", "paper_title": "A Bimodal Co-sparse Analysis Model for Image Processing", "paper_id": "WOS:000360071900008"}