{"auto_keywords": [{"score": 0.048880968765446134, "phrase": "project_management"}, {"score": 0.00481495049065317, "phrase": "interpersonal_attitudes"}, {"score": 0.004647105813224402, "phrase": "recent_strategies"}, {"score": 0.004553822674247401, "phrase": "educational_styles"}, {"score": 0.004263336444795021, "phrase": "knowledge_construction"}, {"score": 0.004135562737140424, "phrase": "technology-enhanced_settings"}, {"score": 0.00395101799538683, "phrase": "person-centered_approach"}, {"score": 0.0038520615699124123, "phrase": "american_psychologist_carl_rogers"}, {"score": 0.0027414948679658816, "phrase": "soft_skills"}, {"score": 0.0026057256900479026, "phrase": "active_participation"}, {"score": 0.0025275050635202878, "phrase": "top_factors"}, {"score": 0.002214734873559146, "phrase": "social_relationships"}, {"score": 0.0021049977753042253, "phrase": "traditional_courses"}], "paper_keywords": [""], "paper_abstract": "Recent strategies in the European Union encourage educational styles which promote the development of attitudes and skills as a basis for knowledge construction. The question is whether technology-enhanced settings have the potential to support such educational styles. The Person-Centered Approach, developed by the American psychologist Carl Rogers and adapted in several innovative educational settings holds great promise in promoting experiential, whole person learning. In this paper we illustrate technology-enhanced, person-centered education by describing two course settings and scenarios in which we emphasize, respectively, constructive, interpersonal attitudes and soft skills in the context of project management. As a result of each of the two courses students stated that they had learned significantly on the level of attitudes and soft skills. They considered exchange and discussion with colleagues and active participation during the course as the top factors from which they benefited. Furthermore, the majority of students felt that it was easier for them to work in teams and to establish social relationships in the two courses presented in this article than in traditional courses.", "paper_title": "Two technology-enhanced courses aimed at developing interpersonal attitudes and soft skills in project management", "paper_id": "WOS:000241812400026"}