{"auto_keywords": [{"score": 0.041078685670043524, "phrase": "point_case"}, {"score": 0.00481495049065317, "phrase": "large_wireless_networks"}, {"score": 0.004718431349852634, "phrase": "point-to-point_wireless_channel"}, {"score": 0.004404445045826858, "phrase": "good_communication_schemes"}, {"score": 0.004246729915110547, "phrase": "new_scaling_law_formulation"}, {"score": 0.003853115465608543, "phrase": "fundamental_operating_regimes"}, {"score": 0.003822003373331997, "phrase": "wireless_networks"}, {"score": 0.003775803846431323, "phrase": "architectural_guidelines"}, {"score": 0.003700037700138249, "phrase": "optimal_schemes"}, {"score": 0.003567455727660992, "phrase": "arbitrary_size"}, {"score": 0.003096223264687927, "phrase": "snr"}, {"score": 0.002674681176379472, "phrase": "heterogeneous_nature"}, {"score": 0.0024761702541879213, "phrase": "network_capacity"}, {"score": 0.0022738201751000865, "phrase": "existing_formulation"}, {"score": 0.002255431275670053, "phrase": "existing_schemes"}, {"score": 0.0022190974300886467, "phrase": "hierarchical_cooperation"}, {"score": 0.0021049977753042253, "phrase": "new_hybrid_scheme"}], "paper_keywords": ["Ad hoc wireless networks", " distributed MIMO", " hierarchical cooperation", " multihopping", " operating regimes", " scaling laws"], "paper_abstract": "In analyzing the point-to-point wireless channel, insights about two qualitatively different operating regimes-bandwidth- and power-limited-have proven indispensable in the design of good communication schemes. In this paper, we propose a new scaling law formulation for wireless networks that allows us to develop a theory that is analogous to the point-to-point case. We identify fundamental operating regimes of wireless networks and derive architectural guidelines for the design of optimal schemes. Our analysis shows that in a given wireless network with arbitrary size, area, power, bandwidth, etc., there are three parameters of importance: the short-distance signal-to-noise ratio (SNR), the long-distance SNR, and the power path loss exponent of the environment. Depending on these parameters, we identify four qualitatively different regimes. One of these regimes is especially interesting since it is fundamentally a consequence of the heterogeneous nature of links in a network and does not occur in the point-to-point case; the network capacity is both power and bandwidth limited. This regime has thus far remained hidden due to the limitations of the existing formulation. Existing schemes, either multihop transmission or hierarchical cooperation, fail to achieve capacity in this regime; we propose a new hybrid scheme that achieves capacity.", "paper_title": "Information-Theoretic Operating Regimes of Large Wireless Networks", "paper_id": "WOS:000273134100030"}