{"auto_keywords": [{"score": 0.047225019827898035, "phrase": "timing_system"}, {"score": 0.03545812367706334, "phrase": "easytime"}, {"score": 0.00481495049065317, "phrase": "domain-specific_language_easytime"}, {"score": 0.0047026237903774895, "phrase": "mass_sporting_competitions"}, {"score": 0.004422632150619634, "phrase": "measuring_technology"}, {"score": 0.004360412703519539, "phrase": "computer_system"}, {"score": 0.0039114753002009485, "phrase": "rfid_technology"}, {"score": 0.0033943947596098583, "phrase": "domain-specific_language"}, {"score": 0.0030017207229983385, "phrase": "new_sporting_competitions"}, {"score": 0.002890266318361907, "phrase": "measuring_devices"}, {"score": 0.0027307746993761035, "phrase": "domain_specific_language"}, {"score": 0.002391938519840648, "phrase": "sports_clubs"}, {"score": 0.0023694065215394593, "phrase": "competition_organizers"}, {"score": 0.002292199117499287, "phrase": "smaller_sporting_competitions"}, {"score": 0.0022492129111567824, "phrase": "larger_sporting_competitions"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Domain-specific language", " Timing system", " RFID technology"], "paper_abstract": "Measuring time in mass sporting competitions is, typically, performed with a timing system that consists of a measuring technology and a computer system. The first is dedicated to tracking events that are triggered by competitors and registered by measuring devices (primarily based on RFID technology). The latter enables the processing of these events. In this paper, the processing of events is performed by an agent that is controlled by the domain-specific language, EasyTime. EasyTime improves the flexibility of the timing system because it supports the measuring of time in various sporting competitions, their quick adaptation to the demands of new sporting competitions and a reduction in the number of measuring devices. Essentially, we are focused on the development of a domain specific language. In practice, we made two case studies of using EasyTime by measuring time in two different sporting competitions. The use of EasyTime showed that it can be useful for sports clubs and competition organizers by aiding in the results of smaller sporting competitions, while in larger sporting competitions it could simplify the configuration of the timing system. (C) 2011 Elsevier Ltd. All rights reserved.", "paper_title": "Design and implementation of domain-specific language easytime", "paper_id": "WOS:000296222600001"}