{"auto_keywords": [{"score": 0.043265073684849525, "phrase": "semantic_relationships"}, {"score": 0.02322730111336099, "phrase": "semantic_information_model"}, {"score": 0.023023463813006788, "phrase": "collective_intelligence_approach"}, {"score": 0.00720271920244801, "phrase": "common_nouns"}, {"score": 0.0071598310201894735, "phrase": "abstract_nouns"}, {"score": 0.004589763483242731, "phrase": "semantic_network"}, {"score": 0.004562362497952548, "phrase": "intelligent_systems"}, {"score": 0.004414542249381157, "phrase": "semantic_knowledge"}, {"score": 0.004322967486451877, "phrase": "hierarchal_information"}, {"score": 0.004258717300328513, "phrase": "particular_domain"}, {"score": 0.004011086974442549, "phrase": "ontology_construction"}, {"score": 0.003987126862293129, "phrase": "collective_intelligence"}, {"score": 0.003939633463129123, "phrase": "good_alternative_approach"}, {"score": 0.0034633412134999425, "phrase": "collected_semantic_resources"}, {"score": 0.0034016119212097826, "phrase": "funwords"}, {"score": 0.0033510093127915768, "phrase": "korean_lexical-based_semantic_resource_collection_tool"}, {"score": 0.003044455555031339, "phrase": "structural_semantic_relationships"}, {"score": 0.002919287408226361, "phrase": "descriptive_and_characteristic_semantic_relationships"}, {"score": 0.0028330406939341348, "phrase": "adjectives"}, {"score": 0.00240213106042981, "phrase": "unnecessary_or_slightly_related_factors"}, {"score": 0.0023592715993204796, "phrase": "expressive_power"}, {"score": 0.0022964086745845998, "phrase": "weighted_characteristics"}, {"score": 0.002262209824105154, "phrase": "semantic_resources"}, {"score": 0.002228519136218028, "phrase": "gwap"}], "paper_keywords": ["Collective intelligence", " games with a purpose", " semantic information model"], "paper_abstract": "Knowledge is often represented as a set of rules or a semantic network in intelligent systems. Recently, ontology has been widely used to represent semantic knowledge, because it organizes thesaurus and hierarchal information between concepts in a particular domain. However, it is not easy to collect semantic relationships among concepts. Much time and expense are incurred in ontology construction. Collective intelligence can be a good alternative approach to solve these problems. In this paper, we propose a collective intelligence approach of Games With A Purpose (GWAP) to collect various semantic resources, such as words and word-senses. We detail how to construct the semantic information model or ontology from the collected semantic resources, constructing a system named FunWords. FunWords is a Korean lexical-based semantic resource collection tool. Experiments demonstrated the resources were grouped as common nouns, abstract nouns, adjective and neologism. Finally, we analyzed their characteristics, acquiring the semantic relationships noted above. Common nouns, with structural semantic relationships, such as hypernym and hyponym, are highlighted. Abstract nouns, with descriptive and characteristic semantic relationships, such as synonym and antonym are underlined. Adjectives, with such semantic relationships, as description and status, illustration - for example, color and sound are expressed more. Last, neologism, with the semantic relationships, such as description and characteristics, are emphasized. Weighting the semantic relationships with these characteristics can help reduce time and cost, because it need not consider unnecessary or slightly related factors. This can improve the expressive power, such as readability, concentrating on the weighted characteristics. Our proposal to collect semantic resources from the collective intelligence approach of GWAP ( our FunWords) and to weight their semantic relationship can help construct the semantic information model or ontology would be a more effective and expressive alternative.", "paper_title": "Constructing the Semantic Information Model using A Collective Intelligence Approach", "paper_id": "WOS:000296698900001"}