{"auto_keywords": [{"score": 0.007764601469055273, "phrase": "source_genes"}, {"score": 0.00481495049065317, "phrase": "signal_reachability"}, {"score": 0.004473027089024405, "phrase": "gene_regulation"}, {"score": 0.0043738432231020885, "phrase": "utmost_importance"}, {"score": 0.004168618849008299, "phrase": "transcription_factors"}, {"score": 0.0041287394089001405, "phrase": "transcription_regulatory_network"}, {"score": 0.003985738225654119, "phrase": "regulatory_interactions"}, {"score": 0.0036788184374592706, "phrase": "scalable_method"}, {"score": 0.0034392837410790293, "phrase": "target_genes"}, {"score": 0.003309452522760298, "phrase": "underlying_signaling_network"}, {"score": 0.003215295260684715, "phrase": "large_networks"}, {"score": 0.0031743093007496736, "phrase": "provably_accurate_result"}, {"score": 0.003123808471618783, "phrase": "divide-and-conquer_strategy"}, {"score": 0.003015508235745547, "phrase": "non-overlapping_subnetworks"}, {"score": 0.0028281000453392272, "phrase": "small_polynomial"}, {"score": 0.0027564303939865476, "phrase": "different_scenarios"}, {"score": 0.002601727192945944, "phrase": "polynomial_collapsing_operators"}, {"score": 0.0024011255612605776, "phrase": "human_regulatory_networks"}, {"score": 0.0023553236684739887, "phrase": "existing_methods"}, {"score": 0.0022302306304023602, "phrase": "key_reachability_characteristics"}, {"score": 0.002208853811052348, "phrase": "entire_transcriptions"}, {"score": 0.00220177373403577, "phrase": "regulatory_networks"}, {"score": 0.002166711569953301, "phrase": "eight_different_subtypes"}, {"score": 0.0021049977753042253, "phrase": "healthy_control_samples"}], "paper_keywords": [""], "paper_abstract": "Motivation: Major disorders, such as leukemia, have been shown to alter the transcription of genes. Understanding how gene regulation is affected by such aberrations is of utmost importance. One promising strategy toward this objective is to compute whether signals can reach to the transcription factors through the transcription regulatory network (TRN). Due to the uncertainty of the regulatory interactions, this is a #P-complete problem and thus solving it for very large TRNs remains to be a challenge. Results: We develop a novel and scalable method to compute the probability that a signal originating at any given set of source genes can arrive at any given set of target genes (i.e., transcription factors) when the topology of the underlying signaling network is uncertain. Our method tackles this problem for large networks while providing a provably accurate result. Our method follows a divide-and-conquer strategy. We break down the given network into a sequence of non-overlapping subnetworks such that reachability can be computed autonomously and sequentially on each subnetwork. We represent each interaction using a small polynomial. The product of these polynomials express different scenarios when a signal can or cannot reach to target genes from the source genes. We introduce polynomial collapsing operators for each subnetwork. These operators reduce the size of the resulting polynomial and thus the computational complexity dramatically. We show that our method scales to entire human regulatory networks in only seconds, while the existing methods fail beyond a few tens of genes and interactions. We demonstrate that our method can successfully characterize key reachability characteristics of the entire transcriptions regulatory networks of patients affected by eight different subtypes of leukemia, as well as those from healthy control samples.", "paper_title": "Large scale analysis of signal reachability", "paper_id": "WOS:000338109200012"}