{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "language_learning"}, {"score": 0.03810463830315169, "phrase": "query_learning"}, {"score": 0.015201892968430396, "phrase": "strong_relationships"}, {"score": 0.01320446215967042, "phrase": "recursive_languages"}, {"score": 0.01242984380404487, "phrase": "target_class"}, {"score": 0.004623224002010226, "phrase": "gold-style_models"}, {"score": 0.004454158739805578, "phrase": "quite_general_setting_gold-style_learners"}, {"score": 0.0040648241451154525, "phrase": "indexable_classes"}, {"score": 0.004010102190292041, "phrase": "former_studies"}, {"score": 0.003983016985197904, "phrase": "gold-style_learning"}, {"score": 0.0035979378467361762, "phrase": "non-indexable_classes"}, {"score": 0.0034195441640721995, "phrase": "recently_observed_relations"}, {"score": 0.0033167679667625667, "phrase": "common_structures"}, {"score": 0.003283198043537134, "phrase": "learning_processes"}, {"score": 0.0031522712014385845, "phrase": "target_classes"}, {"score": 0.0029455250501196286, "phrase": "arbitrary_classes"}, {"score": 0.0029256091368059446, "phrase": "recursively_enumerable_languages"}, {"score": 0.0027523011981394835, "phrase": "significant_changes"}, {"score": 0.002724428781940696, "phrase": "former_results"}, {"score": 0.0022914434133560852, "phrase": "former_'equality'_results"}, {"score": 0.00222249726328354, "phrase": "algorithmic_structure"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["inductive inference", " query learning", " formal languages", " recursion theory"], "paper_abstract": "In language learning, strong relationships between Gold-style models and query models have recently been observed: in some quite general setting Gold-style learners can be replaced by query learners and vice versa, without loss of learning capabilities. These 'equalities' hold in the context of learning indexable classes of recursive languages. Former studies on Gold-style learning of such indexable classes have shown that, in many settings, the enumerability of the target class and the recursiveness of its languages are crucial for learnability. Moreover, studying query learning, non-indexable classes have been mainly neglected up to now. So it is conceivable that the recently observed relations between Gold-style and query learning are not due to common structures in the learning processes in both models, but rather to the enumerability of the target classes or the recursiveness of their languages. In this paper, the analysis is lifted onto the context of learning arbitrary classes of recursively enumerable languages. Still, strong relationships between the approaches of Gold-style and query learning are proven, but there are significant changes to the former results. Though in many cases learners of one type can still be replaced by learners of the other type, in general this does not remain valid vice versa. All results hold even for learning classes of recursive languages, which indicates that the recursiveness of the languages is not crucial for the former 'equality' results. Thus we analyze how constraints on the algorithmic structure of the target class affect the relations between two approaches to language learning. (C) 2007 Elsevier B.V. All rights reserved.", "paper_title": "A general comparison of language learning from examples and from queries", "paper_id": "WOS:000250935400005"}