{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "collaborative_work"}, {"score": 0.03981719821100098, "phrase": "proposed_patterns"}, {"score": 0.010560008208769914, "phrase": "health_care_teams"}, {"score": 0.006741983297609575, "phrase": "service_assignment"}, {"score": 0.004569774347306657, "phrase": "common_goals"}, {"score": 0.004502044567396704, "phrase": "incomplete"}, {"score": 0.004479678062285735, "phrase": "ambiguous_specification"}, {"score": 0.004209369306023422, "phrase": "workers'_competences"}, {"score": 0.004034899227794577, "phrase": "important_problems"}, {"score": 0.003984968827278219, "phrase": "healthcare_teams"}, {"score": 0.0038966399268244556, "phrase": "goal-based_patterns"}, {"score": 0.0037631002998184076, "phrase": "generic_and_reusable_solutions"}, {"score": 0.00367967106192446, "phrase": "run_time"}, {"score": 0.003652272880077669, "phrase": "particular_context"}, {"score": 0.003527078169873639, "phrase": "abnormal_events"}, {"score": 0.0033892269069907177, "phrase": "appropriate_actor"}, {"score": 0.0033306180744375616, "phrase": "generic_solution"}, {"score": 0.0033058102560934595, "phrase": "problematic_issues"}, {"score": 0.0032486392192981944, "phrase": "health_workers"}, {"score": 0.0032004205378150354, "phrase": "standard_terms"}, {"score": 0.0031765793936411727, "phrase": "team_work"}, {"score": 0.002955050521440921, "phrase": "normal_scenarios"}, {"score": 0.0029403531729828574, "phrase": "abnormal_situations"}, {"score": 0.0028966970007550798, "phrase": "recovery_strategies"}, {"score": 0.0026546162268153827, "phrase": "formal_framework"}, {"score": 0.002634830238219976, "phrase": "design_patterns"}, {"score": 0.002569933140999018, "phrase": "owicki-gries_theory"}, {"score": 0.002349228457383314, "phrase": "executable_cogent_prototype"}, {"score": 0.0023028105026714533, "phrase": "tallis_tool"}, {"score": 0.0022799458141165587, "phrase": "language_specifications"}, {"score": 0.002268598551466928, "phrase": "medical_guidelines"}, {"score": 0.0021907299375981356, "phrase": "normal_and_abnormal_scenarios"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Design patterns", " Medical guidelines", " Exceptions", " Team work", " Tallis", " PROforma"], "paper_abstract": "Objective: The problem of designing and managing teams of workers that can collaborate working together towards common goals is a challenging one. Incomplete or ambiguous specification of responsibilities and accountabilities, lack of continuity in teams working in shifts, inefficient organization of teams due to lack of information about workers' competences and lack of clarity to determine if the work is delegated or assigned are examples of important problems related to collaborative work in healthcare teams. Here we address these problems by specifying goal-based patterns for abstracting the delegation and assignment of services. The proposed patterns should provide generic and reusable solutions and be flexible enough to be customizable at run time to the particular context of execution. Most importantly the patterns should support a mechanism for detecting abnormal events (exceptions) and for transferring responsibility and accountability for recovering from exceptions to the appropriate actor. Method: To provide a generic solution to the problematic issues arising from collaborative work in teams of health workers we start from definitions of standard terms relevant for team work: competence, responsibility, and accountability. We make explicit the properties satisfied by service assignment and delegation in terms of competences, responsibilities, and accountability in normal scenarios and abnormal situations that require the enactment of recovery strategies. Based on these definitions we specify (1) a basic terminology, (2) design patterns for service assignment and delegation (with and without supervision), and (3) an exception manager for detecting and recovering from exceptions. We use a formal framework to specify design patterns and exceptions. Results: We have proved using Owicki-Gries Theory that the proposed patterns satisfy the properties that characterize service assignment and delegation in terms of competence, responsibility and accountability in normal and abnormal (exceptional) scenarios. We show that although abstract, the proposed patterns can be instantiated in an executable COGENT prototype, and can be mapped into the Tallis tool that enacts PROforma language specifications of medical guidelines. Conclusions: The proposed patterns are generic and abstract enough to capture the normal and abnormal scenarios of assignment and delegation of tasks in collaborative work in health care teams. (C) 2011 Elsevier B.V. All rights reserved.", "paper_title": "Patterns for collaborative work in health care teams", "paper_id": "WOS:000296680600001"}