{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "three-dimensional_wireless_sensor_networks"}, {"score": 0.004778258911940497, "phrase": "continuum_percolation"}, {"score": 0.004563880494020726, "phrase": "wireless_sensor_networks"}, {"score": 0.004147523799581407, "phrase": "percolation_theory"}, {"score": 0.003901135641717704, "phrase": "long-distance_multihop_communication"}, {"score": 0.0035586268203884673, "phrase": "coverage_percolation"}, {"score": 0.0032585499655442404, "phrase": "entire_network"}, {"score": 0.003221316290858497, "phrase": "first_time"}, {"score": 0.003006654007926993, "phrase": "integrated_continuum_percolation_problem"}, {"score": 0.0029270797740550973, "phrase": "integratedconcentricsphere_model"}, {"score": 0.0028170314398963704, "phrase": "integrated_way"}, {"score": 0.002579326836642461, "phrase": "critical_density"}, {"score": 0.0021049977753042253, "phrase": "energy-efficient_topology_control_protocols"}], "paper_keywords": ["Three-dimensional wireless sensor networks", " coverage", " connectivity", " continuum percolation"], "paper_abstract": "Although most of the studies on coverage and connectivity in wireless sensor networks (WSNs) considered two-dimensional (2D) settings, such networks can in reality be accurately modeled in a three-dimensional (3D) space. The concepts of continuum percolation theory best fit the problem of connectivity in WSNs to find out whether the network provides long-distance multihop communication. In this paper, we focus on percolation in coverage and connectivity in 3D WSNs. We say that the network exhibits a coverage percolation (respectively, connectivity percolation) when a giant covered region (respectively, giant connected component) almost surely spans the entire network for the first time. Because of the dependency between coverage and connectivity, the problem is not only a continuum percolation problem but also an integrated continuum percolation problem. Thus, we propose an integratedconcentricsphere model to address coverage and connectivity in 3D WSNs in an integrated way. First, we compute the critical density lambda(cov)(c) above which coverage percolation in 3D WSNs will almost surely occur. Second, we compute the critical density lambda(con)(c) above which connectivity percolation in 3D WSNs will almost surely occur. Third, we compute the critical density lambda(cov-con)(c) above which both coverage and connectivity percolation in 3D WSNs will almost surely occur. For each of these three problems, we also compute their corresponding critical network degree. Our results can be helpful in the design of energy-efficient topology control protocols for 3D WSNs in terms of coverage and connectivity.", "paper_title": "Critical Density for Coverage and Connectivity in Three-Dimensional Wireless Sensor Networks Using Continuum Percolation", "paper_id": "WOS:000265412500010"}