{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "distributed_cognition"}, {"score": 0.014430592946159901, "phrase": "projected_cognition"}, {"score": 0.0047006879240764935, "phrase": "human_interaction"}, {"score": 0.004208881856146758, "phrase": "conceptual_framework"}, {"score": 0.004069631519385246, "phrase": "human_interactions"}, {"score": 0.0027564303939865476, "phrase": "greater_clarity"}, {"score": 0.002690886043654469, "phrase": "user_behaviour"}, {"score": 0.0025398521156505425, "phrase": "case_studies"}, {"score": 0.0024914105981393127, "phrase": "complex_configurations"}, {"score": 0.0023743009016047424, "phrase": "published_literature"}, {"score": 0.0022845800828325577, "phrase": "design_implications"}, {"score": 0.0022409963215568565, "phrase": "related_domains"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Distributed Cognition", " observational study", " multiple computers", " virtual desktops", " Projected Cognition", " computer supported cooperative working"], "paper_abstract": "In this paper, we introduce the notion of Projected Cognition as an extension to Distributed Cognition. Distributed Cognition is a conceptual framework which can be useful in studying human interactions with artefacts; the idea is that of cognition not bounded by the cranium but instead perfusing artefacts in ways that are recoverable. We argue that this analysis has not been fully understood in relation to the behaviour of humans with artefacts in that the intentionality in behaviour has been ignored. We argue that we need to view the human as sometimes projecting their intention in behaviour onto the artefacts they use, and suggest that this conception permits greater clarity in the study of user behaviour with artefacts such as computers. We illustrate the development with case studies of two users of complex configurations of computers as well as examples drawn from the published literature. We conclude with consideration of some design implications and discussion of related domains in HCI where Projected Cognition could be influential. (C) 2007 Elsevier B.V. All rights reserved.", "paper_title": "Projected Cognition - extending Distributed Cognition for the study of human interaction with computers", "paper_id": "WOS:000253104900008"}