{"auto_keywords": [{"score": 0.05007756412061746, "phrase": "zona_pellucida"}, {"score": 0.029617278108292247, "phrase": "zp"}, {"score": 0.004106612344123407, "phrase": "glycoprotein_layer"}, {"score": 0.0039010428828989826, "phrase": "acrosome_reaction"}, {"score": 0.003724810609448597, "phrase": "spermatozoon_head"}, {"score": 0.0033957904376127187, "phrase": "biomechanical_sperm-oocyte_interaction_model"}, {"score": 0.003275807170434343, "phrase": "finite_element_method"}, {"score": 0.0028516928446675016, "phrase": "ar"}, {"score": 0.0028221322455573624, "phrase": "sperm_head_shape"}, {"score": 0.002708399936381754, "phrase": "ar_site"}, {"score": 0.0023211517663846346, "phrase": "successful_sperm_penetration"}, {"score": 0.0022738775158524793, "phrase": "sharper'_heads"}, {"score": 0.0022390533383717715, "phrase": "biomechanical_advantage"}, {"score": 0.0021049977753042253, "phrase": "exciting_stage"}], "paper_keywords": ["cellular biomechanics", " fertilisation", " spermatozoon morphology"], "paper_abstract": "For fertilisation to occur, a spermatozoon needs to cross the zona pellucida (ZP), which is a glycoprotein layer surrounding the oocyte. Crossing the ZP requires an acrosome reaction (AR) where enzymes released from the spermatozoon head locally digest and soften the ZP so that the spermatozoon can penetrate deeper. Here, a biomechanical sperm-oocyte interaction model that considers the AR using the finite element method was formulated. This modelling is used to determine which of the following factors directly contribute to the crossing of the ZP: local ZP softening by AR, sperm head shape, ZP hardening elsewhere than in the AR site, ZP thickness and sperm hyperactivation (more flagellar beating). It has been found that an AR softening the ZP to over one-tenth of its basal stiffness is important for successful sperm penetration, and that sharper' heads have a biomechanical advantage in penetrating deeper. The approach is promising for understanding this exciting stage of reproduction.", "paper_title": "Sperm penetration to the zona pellucida of an oocyte: a computational model incorporating acrosome reaction", "paper_id": "WOS:000325844600008"}