{"auto_keywords": [{"score": 0.042956330244541055, "phrase": "diagonal_matrices"}, {"score": 0.029790074854292515, "phrase": "bcd_transformation_matrices"}, {"score": 0.00481495049065317, "phrase": "specific_structures"}, {"score": 0.004458722048888919, "phrase": "permutation_matrices"}, {"score": 0.004263168852219819, "phrase": "transformation_matrices"}, {"score": 0.00418199705290765, "phrase": "block_checker_matrices"}, {"score": 0.004050116768809519, "phrase": "similarity_transformations"}, {"score": 0.0037743802306714545, "phrase": "fast-lifting_technique"}, {"score": 0.0035399770257915466, "phrase": "sampled-data_systems"}, {"score": 0.003494866798828308, "phrase": "time-delay_systems"}, {"score": 0.0024088451312725924, "phrase": "e.g._full-vector_fast-lifting"}, {"score": 0.002378114613631841, "phrase": "subvector-wise_fast-lifting"}, {"score": 0.0021049977753042253, "phrase": "fast-lifting_treatment"}], "paper_keywords": ["block diagonal matrix", " block checker matrix", " permutation", " commutativity", " fast-lifting", " mu-analysis"], "paper_abstract": "This article introduces what we call block checker matrices with some specific structures characterised by a set of integers, and then introduces the permutation matrices called block checker/diagonal (BCD) transformation matrices that relate block checker matrices with block diagonal matrices through similarity transformations. The study is motivated by the importance of the fast-lifting technique in control theory, especially in the study of sampled-data systems and time-delay systems. More precisely, it is partly motivated by the desire for alleviating the bother of describing the class of the matrices commuting with block diagonal matrices, and for such a purpose the permutation with BCD transformation matrices is helpful. The study further extends to investigating the various useful properties among BCD transformation matrices, as well as their interplay relations with various variants of fast-lifting, e.g. full-vector fast-lifting and subvector-wise fast-lifting, or one-stage fast-lifting and two-stage fast-lifting. The usefulness of the results in the context of the fast-lifting treatment is also suggested.", "paper_title": "Block checker/diagonal transformation matrices, their properties, and the interplay with fast-lifting", "paper_id": "WOS:000292642900006"}