{"auto_keywords": [{"score": 0.04316091762075172, "phrase": "new_framework"}, {"score": 0.040297439457126535, "phrase": "mobile_information"}, {"score": 0.00481495049065317, "phrase": "purpose_-_the_purpose"}, {"score": 0.004656082803151484, "phrase": "emerging_geographic_features"}, {"score": 0.004617187934074393, "phrase": "current_concepts"}, {"score": 0.004317450843594688, "phrase": "mizzaro"}, {"score": 0.003619672388007568, "phrase": "first_dimension"}, {"score": 0.003574364535717202, "phrase": "spatio-temporal_nature"}, {"score": 0.003456287408801543, "phrase": "second_dimension"}, {"score": 0.003370287778450475, "phrase": "different_concepts"}, {"score": 0.00330025288273863, "phrase": "different_abstractions"}, {"score": 0.0027317585060414253, "phrase": "widely_adopted_facets"}, {"score": 0.002500987934534128, "phrase": "-_the_conceptual_discussion"}, {"score": 0.0024182831453515782, "phrase": "future_development"}, {"score": 0.002122775261369663, "phrase": "information_retrieval"}, {"score": 0.0021049977753042253, "phrase": "location-based_services"}], "paper_keywords": ["Information retrieval", " Relevance", " Dimensions of relevance", " Geographic relevance", " Location-based services"], "paper_abstract": "Purpose - The purpose of this paper is to discuss the emerging geographic features of current concepts of relevance, and to improve, modify, and extend the framework proposed by Mizzaro (1998). The objective is to define a new framework able to account, more completely and precisely, for the notions of relevance involved in mobile information seeking scenarios. Design/methodology/approach - The authors formalise two new dimensions of relevance. The first dimension emphasises the spatio-temporal nature of the information seeking process. The second dimension allows us to describe how different concepts of relevance rely on different abstractions of reality. Findings - The new framework allows: to conceptualise the point in space and time at which a given notion of relevance refers to; to conceptualise the level of abstraction taken into account by a given notion of relevance; and to include widely adopted facets (e.g. users mobility, preferences, and social context) in the classification of notions of relevance. Originality/value - The conceptual discussion presented in this paper contributes to the future development of relevance in the scope of mobile information seeking scenarios. The authors provide a more comprehensive framework for conceptualization, development, and classification of notions of relevance in the field of information retrieval and location-based services.", "paper_title": "Geographic dimensions of relevance", "paper_id": "WOS:000359056200003"}