{"auto_keywords": [{"score": 0.04356127827965969, "phrase": "distant_vertices"}, {"score": 0.03455018268948868, "phrase": "visibility_graph"}, {"score": 0.00481495049065317, "phrase": "simple_polygons"}, {"score": 0.004521179256835894, "phrase": "initially_unknown_polygon"}, {"score": 0.004415675459182871, "phrase": "simple_robot"}, {"score": 0.004295681900150244, "phrase": "straight_lines"}, {"score": 0.004129873531628877, "phrase": "counter-clockwise_order"}, {"score": 0.00314708280192844, "phrase": "multiple_identical_and_deterministic_robots"}, {"score": 0.003085681391556093, "phrase": "weak_rendezvous_problem"}, {"score": 0.002752390133272192, "phrase": "strong_rendezvous_problem"}, {"score": 0.00238816839721704, "phrase": "mobile_agents"}, {"score": 0.0022157533515146503, "phrase": "simple_polygon"}, {"score": 0.002146926767291475, "phrase": "known_result"}, {"score": 0.0021049977753042253, "phrase": "arbitrary_graphs"}], "paper_keywords": ["Polygon", " Mapping", " Visibility graph", " Rendezvous", " Robot"], "paper_abstract": "We consider the problem of mapping an initially unknown polygon of size n with a simple robot that moves inside the polygon along straight lines between the vertices. The robot sees distant vertices in counter-clockwise order and is able to recognize the vertex among them which it came from in its last move, i.e. the robot can look back. Other than that the robot has no means of distinguishing distant vertices. We assume that an upper bound on n is known to the robot beforehand and show that it can always uniquely reconstruct the visibility graph of the polygon. Additionally, we show that multiple identical and deterministic robots can always solve the weak rendezvous problem in which the robots need to position themselves such that all of them are mutually visible to each other. Our results are tight in the sense that the strong rendezvous problem, where robots need to gather at a vertex, cannot be solved in general, and, without knowing a bound beforehand, not even n can be determined. In terms of mobile agents exploring a graph, our result implies that they can reconstruct any graph that is the visibility graph of a simple polygon. This is in contrast to the known result that the reconstruction of arbitrary graphs is impossible in general, even if n is known.", "paper_title": "Mapping Simple Polygons: How Robots Benefit from Looking Back", "paper_id": "WOS:000313115700002"}