{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "handwritten_characters"}, {"score": 0.004218602458288531, "phrase": "archetypal_fonts"}, {"score": 0.003309877074892399, "phrase": "font_character_strokes"}, {"score": 0.0032198357970567595, "phrase": "linear_relationship"}, {"score": 0.0030470127429039497, "phrase": "nonlinear_techniques"}, {"score": 0.0027286224888843956, "phrase": "recurrent_output_layer"}, {"score": 0.0026252106881752067, "phrase": "nonlinear_models"}, {"score": 0.0023768935613577985, "phrase": "handwritten_and_archetypal_font_characters"}, {"score": 0.002224510044064184, "phrase": "natural_system"}, {"score": 0.0021879624017959493, "phrase": "corresponding_basic_system"}, {"score": 0.0021401625519713577, "phrase": "naturalness_learning"}, {"score": 0.0021049977753042253, "phrase": "promising_approach"}], "paper_keywords": ["Echo-state network (ESN)", " handwritten characters", " naturalness learning", " recurrent neural network (RNN)"], "paper_abstract": "In this paper, we define the naturalness of handwritten characters as being the difference between the strokes of the handwritten characters and the archetypal fonts on which they are based. With this definition, we mathematically analyze the relationship between the font and its naturalness using canonical correlation analysis (CCA), multiple linear regression analysis, feedforward neural networks (FFNNs) with sliding windows, and recurrent neural networks (RNNs). This analysis reveals that certain properties of font character strokes do not have a linear relationship with their naturalness. In turn, this suggests that nonlinear techniques should be used to model the naturalness, and in our investigations, we find that an RNN with a recurrent output layer performs the best among four linear and nonlinear models. These results indicate that it is possible to model naturalness, defined in our study as the difference between handwritten and archetypal font characters but more generally as the difference between the behavior of a natural system and a corresponding basic system, and that naturalness learning is a promising approach for generating handwritten characters.", "paper_title": "Analysis and Modeling of Naturalness in Handwritten Characters", "paper_id": "WOS:000270949900002"}