{"auto_keywords": [{"score": 0.0444167321614354, "phrase": "proc_mixed"}, {"score": 0.00481495049065317, "phrase": "unbalanced_factorial_designs"}, {"score": 0.004770461993586338, "phrase": "heteroscedastic_data"}, {"score": 0.004704495156558224, "phrase": "present_study"}, {"score": 0.0046394362688524475, "phrase": "operating_characteristics"}, {"score": 0.00432733352307636, "phrase": "comparison_purposes"}, {"score": 0.004092774981286263, "phrase": "sas_program"}, {"score": 0.0033051623473192814, "phrase": "nominal_value"}, {"score": 0.0032292292848296617, "phrase": "extreme_skewness"}, {"score": 0.003096905353118796, "phrase": "improved_rates"}, {"score": 0.0029699874949715367, "phrase": "box-cox_method"}, {"score": 0.0028615323526689582, "phrase": "proc_glm"}, {"score": 0.0025474193855847074, "phrase": "wj_and_proc_mixed_approaches"}, {"score": 0.0024658019116387845, "phrase": "box-type_approach"}, {"score": 0.0022052711621931144, "phrase": "population_variances"}], "paper_keywords": ["general linear model", " random heteroscedastic errors", " model comparisons", " Types I, II, and III sums of squares", " Box-Cox transformations", " Box-type", " Welch-James generalizations"], "paper_abstract": "The present study investigates the operating characteristics of several Box-type and Welch-James (WJ) modifications on factorial designs lacking homogeneity, normality, and orthogonality. For comparison purposes the behaviours of Proc Mixed and Proc GLM, available from the SAS program, were also examined. When the shape of the distribution was symmetric, the Box-type, WJ, and Proc Mixed approaches consistently controlled the rates of error; however, when the distribution was moderately skewed only the Box-type approach limited the number of errors to the nominal value. In distributions with extreme skewness, the procedure was predominantly conservative but showed improved rates of Type-I error control using the Box-Cox method of power transformation. The execution of Proc GLM was considerably influenced by the presence of heterogeneity and scarcely affected by the absence of normality. With regard to test sensitivity, the WJ and Proc Mixed approaches were substantially more powerful than the Box-type approach when variances and cells sizes were negatively paired. However, they were equally powerful when this relationship was positive. When the population variances were homogeneous, the differences in power slightly favoured the Proc GLM approach.", "paper_title": "Analysis of unbalanced factorial designs with heteroscedastic data", "paper_id": "WOS:000273913800006"}