{"auto_keywords": [{"score": 0.043226782433942644, "phrase": "test_compound"}, {"score": 0.00481495049065317, "phrase": "lazy_structure-activity_relationships"}, {"score": 0.004377077848734575, "phrase": "noncongeneric_compounds"}, {"score": 0.0043080553835735825, "phrase": "lazy_sars"}, {"score": 0.0035408501923902477, "phrase": "similar_structures"}, {"score": 0.0034482025128821548, "phrase": "well-balanced_and_representative_set"}, {"score": 0.0030684249587688826, "phrase": "redundant_fragments"}, {"score": 0.0029722900280316216, "phrase": "k-nearest_neighbor_classification"}, {"score": 0.0027889366191837504, "phrase": "resulting_predictions"}, {"score": 0.002328434471939886, "phrase": "relative_contribution"}, {"score": 0.00229164285862567, "phrase": "system's_performance"}, {"score": 0.002196342933346204, "phrase": "simple_and_lightweight_approach"}], "paper_keywords": [""], "paper_abstract": "We present three simple, yet effective data mining techniques for lazy structure-activity relationships (SARs) of noncongeneric compounds. In lazy SARs, classifications are particularly tailored for each test compound. Therefore, it is possible to make the most of the structure of a test compound. In our case, we derive its substructures and use them to determine similar structures. To obtain a well-balanced and representative set of structural descriptors, we enrich this set by strongly activating or deactivating fragments from the training set and subsequently remove redundant fragments. Finally, we perform k-Nearest Neighbor classification for several values of k and take a vote among the resulting predictions. These techniques (enrichment, removing redundancy, and voting) are integrated into the system iSAR (instance-based structure-activity relationships) and tested individually to show the relative contribution to the system's performance. Experiments on three data sets indicate that this simple and lightweight approach performs at least on the same level as other, more complex approaches.", "paper_title": "Three data mining techniques to improve lazy structure-activity relationships for noncongeneric compounds", "paper_id": "WOS:000251216500003"}