{"auto_keywords": [{"score": 0.04188522322034607, "phrase": "event_correlation"}, {"score": 0.02727264459199851, "phrase": "business_processes"}, {"score": 0.007892141675431272, "phrase": "web_services"}, {"score": 0.00557710348631819, "phrase": "process_space"}, {"score": 0.005423475797801853, "phrase": "process_events"}, {"score": 0.004819901443045221, "phrase": "correlated_event_sets"}, {"score": 0.00481495049065317, "phrase": "process_discovery"}, {"score": 0.0047851345246117455, "phrase": "web_service_interaction_logs"}, {"score": 0.004775200774256434, "phrase": "process_views"}, {"score": 0.004441359373498799, "phrase": "modern_enterprises"}, {"score": 0.004278807087784626, "phrase": "process_execution"}, {"score": 0.004186734905572505, "phrase": "modern_business_processes"}, {"score": 0.004083923108969583, "phrase": "data_sources"}, {"score": 0.0034742854447532678, "phrase": "process-related_events"}, {"score": 0.0032851239209372943, "phrase": "service_interaction_logs"}, {"score": 0.0032143649757754595, "phrase": "process_view"}, {"score": 0.0030204580407008188, "phrase": "possible_process"}, {"score": 0.0029462012558267863, "phrase": "challenging_problem"}, {"score": 0.002577171858769087, "phrase": "efficient_algorithms"}, {"score": 0.002498183546874872, "phrase": "interesting_process_views"}, {"score": 0.002414082940963702, "phrase": "event_correlation_discovery_process"}, {"score": 0.002289631204915149, "phrase": "discovered_process"}, {"score": 0.0022612912386120385, "phrase": "process_map"}], "paper_keywords": ["Business processes", " Event correlation", " Process views", " Process spaces"], "paper_abstract": "Understanding, analyzing, and ultimately improving business processes is a goal of enterprises today. These tasks are challenging as business processes in modern enterprises are implemented over several applications and Web services, and the information about process execution is scattered across several data sources. Understanding modern business processes entails identifying the correlation between events in data sources in the context of business processes (event correlation is the process of finding relationships between events that belong to the same process execution instance). In this paper, we investigate the problem of event correlation for business processes that are realized through the interactions of a set of Web services. We identify various ways in which process-related events could be correlated as well as investigate the problem of discovering event correlation (semi-) automatically from service interaction logs. We introduce the concept of process view to represent the process resulting from a certain way of event correlation and that of process space referring to the set of possible process views over process events. Event correlation is a challenging problem as there are various ways in which process events could be correlated, and in many cases, it is subjective. Exploring all the possibilities of correlations is computationally expensive, and only some of the correlated event sets result in process views that are interesting. We propose efficient algorithms and heuristics to identify correlated event sets that lead potentially to interesting process views. To account for its subjectivity, we have designed the event correlation discovery process to be interactive and enable users to guide it toward process views of their interest and organize the discovered process views into a process map that allows users to effectively navigate through the process space and identify the ones of interest. We report on experiments performed on both synthetic and real-world datasets that show the viability and efficiency of the approach.", "paper_title": "Event correlation for process discovery from web service interaction logs", "paper_id": "WOS:000290802400006"}