{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "inflow_transport_approximation"}, {"score": 0.00706804698783162, "phrase": "light_water_reactor_analysis"}, {"score": 0.003728529119516347, "phrase": "accurate_transport_cross_section"}, {"score": 0.0035551969986263553, "phrase": "conventional_methods"}, {"score": 0.003450966222451681, "phrase": "consistent-p-n_and_the_outflow_transport_approximations"}, {"score": 0.003251552926963083, "phrase": "lattice_physics_code"}, {"score": 0.0032323407618914525, "phrase": "stream"}, {"score": 0.002608583927848071, "phrase": "significant_error"}, {"score": 0.0025020469669826497, "phrase": "power_distribution"}, {"score": 0.0023018188296933923, "phrase": "significant_improvements"}, {"score": 0.002234252028553481, "phrase": "high_leakage_problem"}, {"score": 0.002181626277903721, "phrase": "practical_large_core_problem_analyses"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Nuclear engineering", " Reactor physics", " Neutron transport theory", " Transport approximation", " Anisotropic scattering", " Lattice physics code", " Light water reactor", " Neutron leakage"], "paper_abstract": "The impact of the inflow transport approximation on light water reactor analysis is investigated, and it is verified that the inflow transport approximation significantly improves the accuracy of the transport and transport/diffusion solutions. A methodology for an inflow transport approximation is implemented in order to generate an accurate transport cross section. The inflow transport approximation is compared to the conventional methods, which are the consistent-P-N and the outflow transport approximations. The three transport approximations are implemented in the lattice physics code STREAM, and verification is performed for various verification problems in order to investigate their effects and accuracy. From the verification, it is noted that the consistent-P-N and the outflow transport approximations cause significant error in calculating the eigenvalue and the power distribution. The inflow transport approximation shows very accurate and precise results for the verification problems. The inflow transport approximation shows significant improvements not only for the high leakage problem but also for practical large core problem analyses. (C) 2015 Elsevier Inc. All rights reserved.", "paper_title": "Impact of inflow transport approximation on light water reactor analysis", "paper_id": "WOS:000360087400021"}