{"auto_keywords": [{"score": 0.03905132661225196, "phrase": "local_shape_descriptors"}, {"score": 0.004772137871562584, "phrase": "interest_points"}, {"score": 0.004729704116022601, "phrase": "local_histogram_descriptors"}, {"score": 0.004502943680955863, "phrase": "original_solution"}, {"score": 0.004267896572751978, "phrase": "probe_scans"}, {"score": 0.004229927464182562, "phrase": "missing_parts"}, {"score": 0.004154995396099332, "phrase": "proposed_approach"}, {"score": 0.0034437574674180365, "phrase": "meshdog_algorithm"}, {"score": 0.003278447235176858, "phrase": "generic_objects"}, {"score": 0.003177392642813126, "phrase": "hog_descriptor"}, {"score": 0.0029447150254434842, "phrase": "geometric_histogram_descriptors"}, {"score": 0.002815864555488112, "phrase": "inlier_pairs"}, {"score": 0.0027535633837592597, "phrase": "probe_and_gallery_scans"}, {"score": 0.002716844480081738, "phrase": "face_recognition_accuracy"}, {"score": 0.00259793885118959, "phrase": "difficult_probes"}, {"score": 0.002364865100579589, "phrase": "comprehensive_comparative_evaluation"}, {"score": 0.002221192647477371, "phrase": "existing_solutions"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["3D face recognition", " 3D keypoints", " 3D local descriptors"], "paper_abstract": "In this work, we propose and experiment an original solution to 3D face recognition that supports face matching also in the case of probe scans with missing parts. In the proposed approach, distinguishing traits of the face are captured by first extracting 3D keypoints of the scan and then measuring how the face surface changes in the keypoints neighborhood using local shape descriptors. In particular: 3D keypoints detection relies on the adaptation to the case of 3D faces of the meshDOG algorithm that has been demonstrated to be effective for 3D keypoints extraction from generic objects; as 3D local descriptors we used the HOG descriptor and also proposed two alternative solutions that develop, respectively, on the histogram of orientations and the geometric histogram descriptors. Face similarity is evaluated by comparing local shape descriptors across inlier pairs of matching keypoints between probe and gallery scans. The face recognition accuracy of the approach has been first experimented on the difficult probes included in the new 2D/3D Florence face dataset that has been recently collected and released at the University of Firenze, and on the Binghamton University 3D facial expression dataset Then, a comprehensive comparative evaluation has been performed on the Bosphorus, Gavab and UND/FRGC v2.0 databases, where competitive results with respect to existing solutions for 3D face biometrics have been obtained. (C) 2013 Elsevier Ltd. All rights reserved.", "paper_title": "Matching 3D face scans using interest points and local histogram descriptors", "paper_id": "WOS:000321532100019"}