{"auto_keywords": [{"score": 0.03777503898678667, "phrase": "compression_efficiency"}, {"score": 0.03639006142004861, "phrase": "key_bit-stream"}, {"score": 0.015719716506582524, "phrase": "asymptotic_deterministic_randomness"}, {"score": 0.010719573218936759, "phrase": "improved_scheme"}, {"score": 0.004741167616693272, "phrase": "data_compression"}, {"score": 0.0032216622984027558, "phrase": "variable-interval_arithmetic_coding"}, {"score": 0.0027175263159330523, "phrase": "previous_attacks"}, {"score": 0.002675797331220082, "phrase": "chaotic_encryption"}, {"score": 0.002364172626241202, "phrase": "statistical_model"}, {"score": 0.0021544587602892466, "phrase": "new_scheme"}, {"score": 0.0021049977753042253, "phrase": "high_security"}], "paper_keywords": ["compression scheme", " encryption scheme", " variable-interval arithmetic coding", " asymptotic deterministic randomness"], "paper_abstract": "Different from the traditional way which compresses the data first and then encrypts the compressed bit-stream later, a novel compression and encryption scheme using variable model arithmetic coding and coupled chaotic system can encrypt and compress the input plaintext synchronously. However, there will be a compromise between the amount of compression achieved and the amount of security incorporated, because the compression efficiency is determined by the key bit-stream. In this paper, an improved scheme using variable-interval arithmetic coding and asymptotic deterministic randomness has been proposed. The improved scheme is secure because the key bit-stream generated by the asymptotic deterministic randomness can resist previous attacks against chaotic encryption. In addition, the compression efficiency will not change with the key bit-stream, because the statistical model will no longer be changed. The results show that the new scheme can achieve high security and compression efficiency.", "paper_title": "The variable-interval arithmetic coding using asymptotic deterministic randomness for data compression and encryption", "paper_id": "WOS:000308992400009"}