{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "large_number"}, {"score": 0.00467905143301368, "phrase": "important_role"}, {"score": 0.004640929126263433, "phrase": "phase_ii_metabolic_process"}, {"score": 0.004138575034269399, "phrase": "active-cap_region"}, {"score": 0.0040052617265655035, "phrase": "molecular_basis"}, {"score": 0.003972607172518598, "phrase": "substrate_selectivity"}, {"score": 0.003876226041373242, "phrase": "individual_and_cooperative_effects"}, {"score": 0.0036156119373414067, "phrase": "molecular_dynamics_simulations"}, {"score": 0.003513443975425428, "phrase": "free_enzyme"}, {"score": 0.0034847851398628546, "phrase": "binary_complexes"}, {"score": 0.0029100272315053253, "phrase": "active-site_cap_region"}, {"score": 0.002827740707723551, "phrase": "mutual_structural_impact"}, {"score": 0.0024903420152789135, "phrase": "lithocholic_acid"}, {"score": 0.0022385401780982204, "phrase": "observed_synergistic_effects"}, {"score": 0.0021049977753042253, "phrase": "understanding_enzymes"}], "paper_keywords": ["Cofactor and substrate", " Human cytosolic sulfotransferase 2A1", " Molecular dynamics simulation", " Structure and flexibility"], "paper_abstract": "Sulfotransferases catalyze transfer of the sulfuryl-group (-SO3) from 3'-phosphoadenosine 5'-phosphosulfate (PAPS) to a large number of substrates. They play an important role in phase II metabolic process. The impact of the cofactor (PAPS) on the structure and flexibility of the enzyme has been studied extensively, and the response of the active-cap region to cofactor binding was proposed as the molecular basis for substrate selectivity. In this study, individual and cooperative effects of the cofactor and substrate on the structure and flexibility of the enzyme were investigated. Molecular dynamics simulations were performed for four systems, including free enzyme, binary complexes (cofactor or substrate bound enzyme) and ternary complex (both cofactor and substrate bound enzyme). The influence of ligands (the cofactor and the substrate) on the structure and flexibility of the enzyme, especially that of the active-site cap region, was analyzed. Moreover, mutual structural impact of the ligands was examined as well. The results show that the impact of both the cofactor and the substrate was significant. Our study indicated that the substrate, such as lithocholic acid (LCA), participated in regulating the structure and flexibility of the enzyme actively rather than merely being selected passively. Additionally, the observed synergistic effects of the cofactor and the substrate demonstrated the importance of examining both ligands in understanding enzymes.", "paper_title": "The impact of ligands on the structure and flexibility of sulfotransferases: a molecular dynamics simulation study", "paper_id": "WOS:000359539700023"}