{"auto_keywords": [{"score": 0.050077691902073326, "phrase": "control-flow_decoupling"}, {"score": 0.024721687246530517, "phrase": "cfd"}, {"score": 0.004528488165249491, "phrase": "flagship_core_microarchitectures"}, {"score": 0.0042898529847155255, "phrase": "constant_supply_voltage"}, {"score": 0.004258995791471342, "phrase": "per-core_energy_consumption"}, {"score": 0.004078439401031372, "phrase": "future_microarchitecture_optimizations"}, {"score": 0.0039055075176836263, "phrase": "branch_mispredictions"}, {"score": 0.0036072171658966348, "phrase": "control-flow_landscape"}, {"score": 0.0032484270911235526, "phrase": "large_control-dependent_regions"}, {"score": 0.0029358111718032704, "phrase": "separable_branches"}, {"score": 0.0026151058979100596, "phrase": "branch_outcomes"}, {"score": 0.0025868936783877035, "phrase": "second_loop"}, {"score": 0.002558985036330194, "phrase": "architectural_queue"}, {"score": 0.0024770482478966896, "phrase": "fetch_unit"}, {"score": 0.002337791830793841, "phrase": "intel's_sandy_bridge_core"}, {"score": 0.0022547515816852266, "phrase": "energy_consumption"}, {"score": 0.0022143417457627006, "phrase": "cfd_regions"}, {"score": 0.0021202820950055193, "phrase": "necessary_catalyst"}, {"score": 0.0021049977753042253, "phrase": "future_complexity-effective_large-window_architectures"}], "paper_keywords": ["Microarchitecture", " software/hardware codesign", " branch prediction", " predication", " pre-execution", " separable branches", " isa extensions", " instruction level parallelism"], "paper_abstract": "Mobile and PC/server class processor companies continue to roll out flagship core microarchitectures that are faster than their predecessors. Meanwhile placing more cores on a chip coupled with constant supply voltage puts per-core energy consumption at a premium. Hence, the challenge is to find future microarchitecture optimizations that not only increase performance but also conserve energy. Eliminating branch mispredictions-which waste both time and energy-is valuable in this respect. In this paper, we explore the control-flow landscape by characterizing mispredictions in four benchmark suites. We find that a third of mispredictions-per-1K-instructions (MPKI) come from what we call separable branches: branches with large control-dependent regions (not suitable for if-conversion), whose backward slices do not depend on their control-dependent instructions or have only a short dependence. We propose control-flow decoupling (CFD) to eradicate mispredictions of separable branches. The idea is to separate the loop containing the branch into two loops: the first contains only the branch's predicate computation and the second contains the branch and its control-dependent instructions. The first loop communicates branch outcomes to the second loop through an architectural queue. Microarchitecturally, the queue resides in the fetch unit to drive timely, non-speculative branching. On a microarchitecture configured similar to Intel's Sandy Bridge core, CFD increases performance by up to 55 percent, and reduces energy consumption by up to 49 percent (for CFD regions). Moreover, for some applications, CFD is a necessary catalyst for future complexity-effective large-window architectures to tolerate memory latency.", "paper_title": "Control-Flow Decoupling: An Approach for Timely, Non-Speculative Branching", "paper_id": "WOS:000357929500007"}