{"auto_keywords": [{"score": 0.03820360112339956, "phrase": "medical_informatics"}, {"score": 0.010532353632887312, "phrase": "undergraduate_medical_education"}, {"score": 0.00481495049065317, "phrase": "learning_objectives_\"medical_informatics\""}, {"score": 0.004513151518938864, "phrase": "competency-based_learning_objectives"}, {"score": 0.004361077072629878, "phrase": "nklm"}, {"score": 0.004150377643719188, "phrase": "multi-level_annotation"}, {"score": 0.004041155193307942, "phrase": "learning_objective"}, {"score": 0.0037161794591176033, "phrase": "competence_context"}, {"score": 0.003404244237372396, "phrase": "competence_level"}, {"score": 0.002900426826591769, "phrase": "seven_areas"}, {"score": 0.0027079507175554857, "phrase": "health_telematics"}, {"score": 0.00266693888510356, "phrase": "data_protection"}, {"score": 0.00260657976055413, "phrase": "medical_knowledge"}, {"score": 0.002360381056508366, "phrase": "first_year_resident_physician"}, {"score": 0.0021049977753042253, "phrase": "next_step"}], "paper_keywords": ["Medical informatics", " learning objectives", " undergraduate medical education", " competency based education", " curriculum"], "paper_abstract": "Objectives: The aim of this project is to develop a catalogue of competency-based learning objectives \"Medical Informatics\" for undergraduate medical education (abbreviated NKLM-MI in German). Methods: The development followed a multi-level annotation and consensus process. For each learning objective a reason why a physician needs this competence was required. In addition, each objective was categorized according to the competence context (A = covered by medical informatics, B = core subject of medical informatics, C = optional subject of medical informatics), the competence level (1 = referenced knowledge, 2 = applied knowledge, 3 = routine knowledge) and a CanMEDS competence role (medical expert, communicator, collaborator, manager, health advocate, professional, scholar). Results: Overall 42 objectives in seven areas (medical documentation and information processing, medical classifications and terminologies, information systems in healthcare, health telematics and telemedicine, data protection and security, access to medical knowledge and medical signal-/image processing) were identified, defined and consented. Conclusion: With the NKLM-MI the competences in the field of medical informatics vital to a first year resident physician are identified, defined and operationalized. These competencies are consistent with the recommendations of the International Medical Informatics Association (IMIA). The NKLM-MI will be submitted to the National Competence-Based Learning Objectives for Undergraduate Medical Education. The next step is implementation of these objectives by the faculties.", "paper_title": "Development of National Competency-based Learning Objectives \"Medical Informatics\" for Undergraduate Medical Education", "paper_id": "WOS:000319711200002"}