{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "scientific_references"}, {"score": 0.010269345942724478, "phrase": "patent_documents"}, {"score": 0.0050298493137879135, "phrase": "scientific_knowledge"}, {"score": 0.004482206282876944, "phrase": "science-technology_interactions"}, {"score": 0.00433645229352341, "phrase": "direct_'knowledge_flow"}, {"score": 0.003948613642680196, "phrase": "belgian_firms"}, {"score": 0.0039053194919285725, "phrase": "knowledge-generating_institutes"}, {"score": 0.003757480190200645, "phrase": "life_sciences"}, {"score": 0.002947790697936243, "phrase": "patent_databases"}, {"score": 0.0028675712105299496, "phrase": "accurate_picture"}, {"score": 0.00240328454980006, "phrase": "unimportant_or_background_information"}, {"score": 0.002163930783583212, "phrase": "implied_inventions"}], "paper_keywords": ["Non-patent references", " Indicators", " Science-technology interaction", " Inventor interviews"], "paper_abstract": "Scientific references in patent documents can be used as indicators signaling science-technology interactions. Whether they reflect a direct 'knowledge flow' from science to technology is subject of debate. Based on 33 interviews with inventors at Belgian firms and knowledge-generating institutes active in nanotechnology, biotechnology and life sciences, we analyze the extent to which scientific references in patents reflect sources of inspiration. Our results indicate that scientific knowledge acts as a source of inspiration for about 50 % of the inventions. At the same time, the scientific references cited in patent documents and available in patent databases do not provide an accurate picture in this respect: 30 % of patents that were inspired by scientific knowledge do not contain any scientific references. Moreover, if scientific references are present, half of them are evaluated as unimportant or background information by the inventor. Overall, these observations provide evidence that scientific references in patent documents signal relatedness with the implied inventions without necessarily implying a direct, inspirational, knowledge flow between both activity realms.", "paper_title": "Sources of inspiration? Making sense of scientific references in patents", "paper_id": "WOS:000331559800004"}