{"auto_keywords": [{"score": 0.04909066394691195, "phrase": "medical_images"}, {"score": 0.04066778879438991, "phrase": "medical_ontologies"}, {"score": 0.015272020668295702, "phrase": "patient_reports"}, {"score": 0.00481495049065317, "phrase": "semantic_medical_image"}, {"score": 0.004618166136069052, "phrase": "significant_challenge"}, {"score": 0.0045607070754363245, "phrase": "clinical_setting"}, {"score": 0.0043560464825349275, "phrase": "sufficient_detail"}, {"score": 0.00421297029755273, "phrase": "inherent_wealth"}, {"score": 0.0040916230716372265, "phrase": "semantic_image_annotation"}, {"score": 0.003685972800046028, "phrase": "common_annotations"}, {"score": 0.0035648266669315943, "phrase": "related_sets"}, {"score": 0.0034476484413811987, "phrase": "semantic_descriptions"}, {"score": 0.002978508766388785, "phrase": "annotation_sources"}, {"score": 0.002953711377604328, "phrase": "manual_annotation"}, {"score": 0.0028446460307503343, "phrase": "clinical_environment"}, {"score": 0.002682917193736698, "phrase": "clinical_ontologies"}, {"score": 0.002530359917257626, "phrase": "smaller_fragments"}, {"score": 0.002498812056838983, "phrase": "large_anatomy_ontology"}, {"score": 0.0023079225317714815, "phrase": "ontology_modularization"}, {"score": 0.0022601535748259785, "phrase": "recent_and_active_field"}], "paper_keywords": ["Medical knowledge engineering", " Ontology modularization"], "paper_abstract": "Searching for medical images and patient reports is a significant challenge in a clinical setting. The contents of such documents are often not described in sufficient detail thus making it difficult to utilize the inherent wealth of information contained within them. Semantic image annotation addresses this problem by describing the contents of images and reports using medical ontologies. Medical images and patient reports are then linked to each other through common annotations. Subsequently, search algorithms can more effectively find related sets of documents on the basis of these semantic descriptions. A prerequisite to realizing such a semantic search engine is that the data contained within should have been previously annotated with concepts from medical ontologies. One major challenge in this regard is the size and complexity of medical ontologies as annotation sources. Manual annotation is particularly time consuming labor intensive in a clinical environment. In this article we propose an approach to reducing the size of clinical ontologies for more efficient manual image and text annotation. More precisely, our goal is to identify smaller fragments of a large anatomy ontology that are relevant for annotating medical images from patients suffering from lymphoma. Our work is in the area of ontology modularization, which is a recent and active field of research. We describe our approach, methods and data set in detail and we discuss our results. (C) 2010 Elsevier Inc. All rights reserved.", "paper_title": "Ontology modularization to improve semantic medical image annotation", "paper_id": "WOS:000288289900017"}