{"auto_keywords": [{"score": 0.027026365398107672, "phrase": "document_text"}, {"score": 0.00481495049065317, "phrase": "scientific_publications"}, {"score": 0.004777802032505079, "phrase": "search_results"}, {"score": 0.0047287140918239766, "phrase": "special-purpose_search_engines"}, {"score": 0.004444551533698643, "phrase": "liu_et_al"}, {"score": 0.004398872331144531, "phrase": "hearst"}, {"score": 0.004308911439983845, "phrase": "search_engines"}, {"score": 0.004275650416511604, "phrase": "thumbnail_view"}, {"score": 0.0039465735912396355, "phrase": "carefully_tailored_captions"}, {"score": 0.0035866734383189396, "phrase": "document-element-search-engine_result"}, {"score": 0.003362203104103, "phrase": "document-element_search_results"}, {"score": 0.003327610635164034, "phrase": "short_\"synopsis"}, {"score": 0.0030475381446620716, "phrase": "entire_document"}, {"score": 0.0029928611380840757, "phrase": "shorter_time"}, {"score": 0.0029467742734417255, "phrase": "document_element"}, {"score": 0.0027126684113045756, "phrase": "first_set"}, {"score": 0.002670884656785558, "phrase": "useful_information"}, {"score": 0.0025959411981464962, "phrase": "naive_bayes"}, {"score": 0.002582542204672381, "phrase": "support_vector_machine_classifiers"}, {"score": 0.0025625729433234623, "phrase": "relevant_sentences"}, {"score": 0.0023225701080913388, "phrase": "different_features"}, {"score": 0.0022573780300432565, "phrase": "optimum_synopsis-size"}, {"score": 0.0022168460543913787, "phrase": "information_content"}, {"score": 0.0021826828321952615, "phrase": "generated_synopses"}, {"score": 0.002165798731600657, "phrase": "user_study"}], "paper_keywords": ["Algorithms", " Experimentation", " Classification", " document-element", " summarization", " synopses"], "paper_abstract": "Increasingly, special-purpose search engines are being built to enable the retrieval of document-elements like tables, figures, and algorithms [Bhatia et al. 2010; Liu et al. 2007; Hearst et al. 2007]. These search engines present a thumbnail view of document-elements, some document metadata such as the title of the papers and their authors, and the caption of the document-element. While some authors in some disciplines write carefully tailored captions, generally, the author of a document assumes that the caption will be read in the context of the text in the document. When the caption is presented out of context as in a document-element-search-engine result, it may not contain enough information to help the end-user understand what the content of the document-element is. Consequently, end-users examining document-element search results would want a short \"synopsis\" of this information presented along with the document-element. Having access to the synopsis allows the end-user to quickly understand the content of the document-element without having to download and read the entire document as examining the synopsis takes a shorter time than finding information about a document element by downloading, opening and reading the file. Furthermore, it may allow the end-user to examine more results than they would otherwise. In this paper, we present the first set of methods to extract this useful information (synopsis) related to document-elements automatically. We use Naive Bayes and support vector machine classifiers to identify relevant sentences from the document text based on the similarity and the proximity of the sentences with the caption and the sentences in the document text that refer to the document-element. We compare the two classification methods and study the effects of different features used. We also investigate the problem of choosing the optimum synopsis-size that strikes a balance between the information content and the size of the generated synopses. A user study is also performed to measure how the synopses generated by our proposed method compare with other state-of-the-art approaches.", "paper_title": "Summarizing Figures, Tables, and Algorithms in Scientific Publications to Augment Search Results", "paper_id": "WOS:000300989800003"}