{"auto_keywords": [{"score": 0.032970825241389536, "phrase": "cmc"}, {"score": 0.00481495049065317, "phrase": "face-to-face_interaction"}, {"score": 0.0043875257506180865, "phrase": "empirical_research"}, {"score": 0.004342430078306461, "phrase": "e-mail_communication"}, {"score": 0.0041666157975446564, "phrase": "practical_information"}, {"score": 0.003151736708029235, "phrase": "computer-mediated_communication"}, {"score": 0.0029620573986902416, "phrase": "complex_interplay"}, {"score": 0.0027982016314450717, "phrase": "positive_and_negative_ways"}, {"score": 0.0025493457404304446, "phrase": "employee_awareness"}, {"score": 0.002420762293555924, "phrase": "negative_outcomes"}, {"score": 0.002358917661465133, "phrase": "relationship_breakdown"}, {"score": 0.002251542790734307, "phrase": "conceptual_framework"}, {"score": 0.0021714122348552747, "phrase": "e-mail_communications"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["CMC", " face-to-face", " e-mail", " technology", " communication", " media choice"], "paper_abstract": "In this article, we undertake empirical research into e-mail communication in the workplace to provide organizations with practical information about how employees can effectively manage their e-mail interactions. We employ an interpretative, qualitative methodology to examine their views of e-mail. Specifically, we consider the interaction between this and traditional face-to-face (F2F) contact. Theoretical ideas are subject to empirical scrutiny from a database of 29 in-depth interviews with users. The findings suggest that as computer-mediated communication (CMC) intensifies, communication is increasingly characterized by a complex interplay between CMC and F2F, with e-mail affecting communication in positive and negative ways, and also with intended and unintended outcomes. For organizations, the key is to raise employee awareness about their e-mail communications in order to maximize effectiveness and prevent negative outcomes such as back-covering and relationship breakdown. The results inform the development of a conceptual framework for the interpretation and investigation of e-mail communications. (C) 2006 Elsevier B.V. All rights reserved.", "paper_title": "Intentional and unintentional consequences of substituting face-to-face interaction with e-mail: An employee-based perspective", "paper_id": "WOS:000244217300003"}