{"auto_keywords": [{"score": 0.0477116990708457, "phrase": "n_points"}, {"score": 0.014001832636879711, "phrase": "perfect_crossing-free_matchings"}, {"score": 0.00481495049065317, "phrase": "crossing-free_matchings"}, {"score": 0.004384960761826366, "phrase": "crossing-free_straight-line_embedding"}, {"score": 0.004071846628708832, "phrase": "arbitrary_distribution"}, {"score": 0.0036648265911110164, "phrase": "red-blue_perfect_crossing-free_matchings"}, {"score": 0.0034029588672379926, "phrase": "red_point"}, {"score": 0.0033633514001658086, "phrase": "blue_point"}, {"score": 0.003196960816092101, "phrase": "left-right_perfect_crossing-free_matchings"}, {"score": 0.0030745737579268876, "phrase": "right_endpoints"}, {"score": 0.0030387767523076528, "phrase": "matching_edges"}, {"score": 0.00277778944472107, "phrase": "fixed_halving_line"}, {"score": 0.002206045784326466, "phrase": "convex_hulls"}, {"score": 0.0021803388613879896, "phrase": "individual_parts"}, {"score": 0.0021049977753042253, "phrase": "lower_bounds"}], "paper_keywords": ["crossing-free geometric graphs", " counting", " simple polygonizations", " crossing-free matchings", " crossing-free partitions"], "paper_abstract": "We show that a set of n points in the plane has at most O(10.05(n)) perfect matchings with crossing-free straight-line embedding. The expected number of perfect crossing-free matchings of a set of n points drawn independently and identically distributed from an arbitrary distribution in the plane is at most O(9.24(n)). Several related bounds are derived: ( a) The number of all ( not necessarily perfect) crossing-free matchings is at most O(10.43(n)). (b) The number of red-blue perfect crossing-free matchings ( where the points are colored red or blue and each edge of the matching must connect a red point with a blue point) is at most O(7.61(n)). ( c) The number of left-right perfect crossing-free matchings ( where the points are designated as left or right endpoints of the matching edges) is at most O(5.38(n)). (d) The number of perfect crossing-free matchings across a line ( where all the matching edges must cross a fixed halving line of the set) is at most 4(n). These bounds are employed to infer that a set of n points in the plane has at most O(86.81(n)) crossing-free spanning cycles ( simple polygonizations) and at most O(12.24(n)) crossing-free partitions ( these are partitions of the point set so that the convex hulls of the individual parts are pairwise disjoint). We also derive lower bounds for some of these quantities.", "paper_title": "On the number of crossing-free matchings, cycles, and partitions", "paper_id": "WOS:000243279700007"}