{"auto_keywords": [{"score": 0.04974208475172307, "phrase": "prior_near-ignorance"}, {"score": 0.044491232024779184, "phrase": "prior_ignorance"}, {"score": 0.00481495049065317, "phrase": "categorical_latent_variable"}, {"score": 0.004631527916092452, "phrase": "coherent_theory"}, {"score": 0.004566570803150147, "phrase": "walley"}, {"score": 0.004408106853358092, "phrase": "probability_distributions"}, {"score": 0.0042102651938187114, "phrase": "categorical_random_variable"}, {"score": 0.004078502325220629, "phrase": "known_result"}, {"score": 0.003195787852087248, "phrase": "new_and_substantial_evidence"}, {"score": 0.002998688867384969, "phrase": "statistical_inference"}, {"score": 0.002548331088496964, "phrase": "categorical_latent_variables"}, {"score": 0.0025214217930287003, "phrase": "general_manifest_variables"}, {"score": 0.002219790619936024, "phrase": "strong_form"}, {"score": 0.0021049977753042253, "phrase": "real_statistical_problems"}], "paper_keywords": ["Near-ignorance set of priors", " Latent variables", " Imprecise Dirichlet model"], "paper_abstract": "In this paper, we consider the coherent theory of (epistemic) uncertainty of Walley, in which beliefs are represented through sets of probability distributions, and we focus on the problem of modeling prior ignorance about a categorical random variable. In this setting, it is a known result that a state of prior ignorance is not compatible with learning. To overcome this problem, another state of beliefs, called near-ignorance, has been proposed. Near-ignorance resembles ignorance very closely, by satisfying some principles that can arguably be regarded as necessary in a state of ignorance, and allows learning to take place. What this paper does, is to provide new and substantial evidence that also near-ignorance cannot be really regarded as a way Out of the problem of starting statistical inference in conditions of very weak beliefs. The key to this result is focusing on a setting characterized by a variable of interest that is latent. We argue that such a setting is by far the most common case in practice, and we provide, for the case of categorical latent variables (and general manifest variables) a condition that, if satisfied, prevents learning to take place under prior near-ignorance. This condition is shown to be easily satisfied even in the most common statistical problems. We regard these results as a strong form of evidence against the possibility to adopt a condition of prior near-ignorance in real statistical problems. (C) 2008 Elsevier Inc. All rights reserved.", "paper_title": "Limits of learning about a categorical latent variable under prior near-ignorance", "paper_id": "WOS:000265541700003"}