{"auto_keywords": [{"score": 0.049419498054670184, "phrase": "complex_questions"}, {"score": 0.03700975242037837, "phrase": "k-means"}, {"score": 0.029751373639788962, "phrase": "document_sentences"}, {"score": 0.00481495049065317, "phrase": "unsupervised_learning_approaches"}, {"score": 0.004619295212985837, "phrase": "multiple_documents"}, {"score": 0.0043706785731816265, "phrase": "single_text"}, {"score": 0.004325568312096711, "phrase": "compressed_version"}, {"score": 0.004207527897084009, "phrase": "minimum_loss"}, {"score": 0.004178522455099832, "phrase": "relevant_information"}, {"score": 0.0038456073694665, "phrase": "computing_relative_importance"}, {"score": 0.0036259093827331725, "phrase": "empirical_approach"}, {"score": 0.0031352744329834676, "phrase": "user_query"}, {"score": 0.003102875178186416, "phrase": "different_kinds"}, {"score": 0.0027582072733520475, "phrase": "local_search_technique"}, {"score": 0.00258251424573557, "phrase": "tree_kernel_functions"}, {"score": 0.00254697318939512, "phrase": "semantic_information"}, {"score": 0.002460240519198386, "phrase": "query_sentences"}, {"score": 0.0023929806873862055, "phrase": "query-focused_summaries"}, {"score": 0.0021716944668428865, "phrase": "syntactic_and_shallow-semantic_features"}, {"score": 0.0021050545130931217, "phrase": "bow"}], "paper_keywords": [""], "paper_abstract": "Complex questions that require inferencing and synthesizing information from multiple documents can be seen as a kind of topic-oriented, informative multi-document summarization where the goal is to produce a single text as a compressed version of a set of documents with a minimum loss of relevant information. In this paper, we experiment with one empirical method and two unsupervised statistical machine learning techniques: K-means and Expectation Maximization (EM), for computing relative importance of the sentences. We compare the results of these approaches. Our experiments show that the empirical approach outperforms the other two techniques and EM performs better than K-means. However, the performance of these approaches depends entirely on the feature set used and the weighting of these features. In order to measure the importance and relevance to the user query we extract different kinds of features (i.e. lexical, lexical semantic, cosine similarity, basic element, tree kernel based syntactic and shallow-semantic) for each of the document sentences. We use a local search technique to learn the weights of the features. To the best of our knowledge, no study has used tree kernel functions to encode syntactic/ semantic information for more complex tasks such as computing the relatedness between the query sentences and the document sentences in order to generate query-focused summaries (or answers to complex questions). For each of our methods of generating summaries (i.e. empirical, K-means and EM) we show the effects of syntactic and shallow-semantic features over the bag-of-words (BOW) features.", "paper_title": "Complex Question Answering: Unsupervised Learning Approaches and Experiments", "paper_id": "WOS:000266308700001"}