{"auto_keywords": [{"score": 0.035252220524069185, "phrase": "exact_expression"}, {"score": 0.00481495049065317, "phrase": "document-duplication_effects"}, {"score": 0.004662427600500598, "phrase": "proxy_caching"}, {"score": 0.004490552331642995, "phrase": "effective_and_relatively_inexpensive_methods"}, {"score": 0.0038846843242954935, "phrase": "proxy-server_cache"}, {"score": 0.0035457302646174148, "phrase": "document_duplication"}, {"score": 0.0032888418378433037, "phrase": "accurate_approximation"}, {"score": 0.0031845067058084583, "phrase": "joint_browser-proxy_caching_policy"}, {"score": 0.0029221312451219203, "phrase": "benchmark_policy"}, {"score": 0.0025137856138000014, "phrase": "controlled_amount"}, {"score": 0.0023189818169615135, "phrase": "approximate_expression"}, {"score": 0.002209406458446019, "phrase": "simulation_study"}, {"score": 0.0021049977753042253, "phrase": "theoretical_results"}], "paper_keywords": ["cache management", " statistical analysis", " simulation", " estimation"], "paper_abstract": "Browser and proxy-server caching are effective and relatively inexpensive methods of improving Web performance. Most existing research considers caching to occur independently at the browser and the proxy server. When the browser and the proxy-server cache independently, documents may get duplicated across the two levels. This paper analyzes the impact of document duplication on the performance of several browser-proxy caching policies. We first derive an exact expression and an accurate approximation for the delay under a joint browser-proxy caching policy in which no duplication is permitted. This policy is compared to a base or benchmark policy in which caching occurs independently at the two levels, and hence, duplication of documents is freely permitted. We next propose a more general caching policy in which a controlled amount of duplication is permitted. This policy is analyzed and an exact expression and an approximate expression for performance are derived. Finally, a simulation study is performed to confirm the accuracy of the theoretical results and extend these results for situations that are difficult to analyze mathematically.", "paper_title": "Analyzing document-duplication effects on policies for browser and proxy caching", "paper_id": "WOS:000242675600010"}