{"auto_keywords": [{"score": 0.04933866662045337, "phrase": "computer-assisted_decision_processes"}, {"score": 0.014001832636879711, "phrase": "information_granularity"}, {"score": 0.013575876728268646, "phrase": "information_gathering"}, {"score": 0.00852934085330971, "phrase": "decision_process_reconstructions"}, {"score": 0.00481495049065317, "phrase": "documentation_and_reconstruction_requirements"}, {"score": 0.003931402465972151, "phrase": "reconstruction_value"}, {"score": 0.00331125524068286, "phrase": "evaluation_framework"}, {"score": 0.0031845067058084583, "phrase": "image_inspection"}, {"score": 0.0028996963188373144, "phrase": "computational_costs"}, {"score": 0.0026402908398883832, "phrase": "potential_value"}, {"score": 0.00234834406550549, "phrase": "future_archival_needs"}, {"score": 0.0021049977753042253, "phrase": "computational_and_storage_requirements"}], "paper_keywords": ["Preservation decisions", " Information granularity", " Evaluations"], "paper_abstract": "Challenges related to documenting and reconstructing computer-assisted decision processes include the selection of information granularity, design of information gathering and reconstruction mechanisms, evaluation of reconstruction value, and storage and computational costs. This article surveys these challenges and explicates an approach to designing and prototyping an evaluation framework for decisions based on image inspection. The framework explored here allows users to analyze storage and computational costs of information gathering as a function of information granularity and then assesses the potential value of decision process reconstructions. We illustrate how evaluations of decision process reconstructions could potentially improve our understanding of future archival needs by simultaneously documenting, preserving and reconstructing computer-assisted decision processes, and evaluating and forecasting computational and storage requirements of the documentation and reconstruction processes over time. (C) 2010 Elsevier B.V. All rights reserved.", "paper_title": "Understanding documentation and reconstruction requirements for computer-assisted decision processes", "paper_id": "WOS:000284654800027"}