{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "lovasz"}, {"score": 0.049592960866364215, "phrase": "schrijver"}, {"score": 0.037317478345311725, "phrase": "rank_lower_bounds"}, {"score": 0.029566461165174154, "phrase": "integrality_gaps"}, {"score": 0.02771385456362205, "phrase": "sa_hierarchy"}, {"score": 0.003926105480202798, "phrase": "rank_bounds"}, {"score": 0.0037307208089736835, "phrase": "derived_inequality"}, {"score": 0.003581412258960711, "phrase": "ls_hierarchy"}, {"score": 0.003438058620195309, "phrase": "symmetric_knapsack_polytope"}, {"score": 0.003403122817578447, "phrase": "grigoriev_et_al"}, {"score": 0.0032336801561165113, "phrase": "simple_upper_bounds"}, {"score": 0.003010496595090984, "phrase": "integer_solution"}, {"score": 0.002331641523873951, "phrase": "lower_bounds"}, {"score": 0.0021928902836049384, "phrase": "maximum_number"}, {"score": 0.0021049977753042253, "phrase": "initial_linear_program"}], "paper_keywords": ["Linear programming", " Integrality gaps", " Proof complexity"], "paper_abstract": "Lovasz and Schrijver introduced several lift and project methods for 0-1 integer programs, now collectively known as Lovasz-Schrijver (LS) hierarchies. Several lower bounds have since been proven for the rank of various linear programming relaxations in the LS and hierarchies. We investigate rank bounds in the more general hierarchy, which allows lifts by any derived inequality as opposed to just and in the LS hierarchy. Rank lower bounds for were obtained for the symmetric knapsack polytope by Grigoriev et al. We reinitiate further investigation into such general lifts. We prove simple upper bounds on rank which show that under such general lifts one can potentially converge to the integer solution much faster than or Sherali-Adams (SA) hierarchy. This motivates our investigation of rank lower bounds and integrality gaps for and the hierarchy, the latter is a generalization of the SA hierarchy in the same vein as . In particular, we show that the rank of is . We also extend the rank lower bounds and integrality gaps for SA hierarchy to the and hierarchies as long as the maximum number of variables in any constraint of the initial linear program is bounded by a constant.", "paper_title": "Rank bounds for a hierarchy of Lovasz and Schrijver", "paper_id": "WOS:000360388300018"}