{"auto_keywords": [{"score": 0.04581502828053674, "phrase": "user's_needs"}, {"score": 0.03482015026398799, "phrase": "u-service_composition"}, {"score": 0.00481495049065317, "phrase": "service_complementarity_index"}, {"score": 0.004685012337701536, "phrase": "ubiquitous_services"}, {"score": 0.003975515793563278, "phrase": "single_service"}, {"score": 0.0037636590459094762, "phrase": "occasionally_two_or_more_services"}, {"score": 0.0029573932605287947, "phrase": "user_satisfaction"}, {"score": 0.0027996401456881806, "phrase": "u-service_bundling_methodology"}, {"score": 0.0026942333853202556, "phrase": "service_effectiveness"}, {"score": 0.002564505790176378, "phrase": "complementarity_index"}, {"score": 0.002454432810862053, "phrase": "relevant_services"}, {"score": 0.0022359278646792153, "phrase": "prototype_system"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Ubiquitous service", " Service bundling", " Complementarity"], "paper_abstract": "The goal of ubiquitous services (u-service) is to unobtrusively, transparently satisfy user's needs at any-time, any place. Since user's needs are both diverse and ad hoc, any single service alone may be inadequate to address those needs: occasionally two or more services should be co-executed. Hence, a context-based, dynamic ubiquitous service composition or bundling would be an ideal match. To date, studies on u-service composition have focused primarily on the efficiency of the composition, while few studies have focused on effectiveness in terms of user satisfaction relating to the u-service composition. This paper proposes an u-service bundling methodology based on service complementarity to enhance service effectiveness. To do so, we develop a complementarity index between u-services to provide the users with relevant services. To demonstrate the feasibility of the ideas proposed in this paper, we create a prototype system and discuss results of its experiments. (C) 2010 Elsevier Ltd. All rights reserved.", "paper_title": "A complementary ubiquitous service bundling method using service complementarity index", "paper_id": "WOS:000287419900119"}