{"auto_keywords": [{"score": 0.03104244392514206, "phrase": "autonomous_fair_signature_exchange"}, {"score": 0.026664277389337257, "phrase": "new_protocol"}, {"score": 0.00481495049065317, "phrase": "ubiquitous_networks"}, {"score": 0.004769702911065878, "phrase": "fair_signature_exchange"}, {"score": 0.0047026237903774895, "phrase": "ubiquitous_commerce"}, {"score": 0.004549734943142138, "phrase": "new_security_challenges"}, {"score": 0.004023947242621452, "phrase": "security_attacks"}, {"score": 0.003678414118674967, "phrase": "autonomous_fair_exchange"}, {"score": 0.003475582268210954, "phrase": "novel_features"}, {"score": 0.0033465923623290034, "phrase": "low_efficiency"}, {"score": 0.0033150974333333244, "phrase": "high_complexity"}, {"score": 0.0030881143614111552, "phrase": "signature_exchange"}, {"score": 0.0030017207229983385, "phrase": "selected_devices"}, {"score": 0.0027437235598539904, "phrase": "novel_approach"}, {"score": 0.0027178867838199734, "phrase": "symmetric-key_based_verifiable_proxy_encryption"}, {"score": 0.0022175019341824603, "phrase": "related_work"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Ubiquitous computing", " Fair exchange", " Signature", " Verifiable encryption", " Communication protocol"], "paper_abstract": "Fair signature exchange in emerging ubiquitous commerce (u-commerce) poses new security challenges. In particular, its operations are highly distributed and autonomous, and typically run on much open, dynamic and resource-diversified ubiquitous networks. These characteristics make the exchange very vulnerable to security attacks. Some effort has been made to address the challenges. As a result, an approach to autonomous fair exchange has been proposed specifically for u-commerce. Despite a number of novel features offered by the approach, its weaknesses are low efficiency and high complexity. This paper is aimed at proposing a more efficient and simpler solution for allowing the task of signature exchange to be delegated securely to selected devices in order to facilitate autonomous fair signature exchange on ubiquitous networks. To accomplish this aim, we have produced a novel approach to symmetric-key based verifiable proxy encryption to simplify the signature exchange delegation. Based on this approach, we have developed a new protocol for autonomous fair signature exchange in u-commerce. An analysis of the new protocol has been carried out to confirm its security, fairness and performance. A comparison with related work has demonstrated its better efficiency and simplicity. (c) 2012 Elsevier Ltd. All rights reserved.", "paper_title": "Efficient autonomous signature exchange on ubiquitous networks", "paper_id": "WOS:000310670100012"}