{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "security_model"}, {"score": 0.004731638279336065, "phrase": "certificate-based_threshold_signature"}, {"score": 0.004569293780076254, "phrase": "general_model"}, {"score": 0.0042859292226559535, "phrase": "corresponding_participators"}, {"score": 0.003705323407433896, "phrase": "certificateless_threshold_signature_model"}, {"score": 0.0035366216368204182, "phrase": "secure_and_efficient_certificate-based_threshold_signature_scheme"}, {"score": 0.0034551632687788857, "phrase": "previous_id-based_threshold_signature"}, {"score": 0.0031845067058084583, "phrase": "trusted_dealer"}, {"score": 0.0025221759076833124, "phrase": "dishonest_participants"}, {"score": 0.0023654615987859402, "phrase": "existing_schemes"}, {"score": 0.002231441081806766, "phrase": "adaptive_chosen_message_attacks"}, {"score": 0.0021927323694667694, "phrase": "discrete_logarithm_assumption"}, {"score": 0.0021049977753042253, "phrase": "john_wiley"}], "paper_keywords": ["certificate-based signature", " threshold signature", " discrete logarithm assumption", " verifiable secret sharing", " simulatability"], "paper_abstract": "We propose the notion and define the security model of a certificate-based threshold signature. The model is a general model that allows both the master secret key and user secret keys to be determined and distributed to the corresponding participators. Furthermore, the model can be easily converted into an identity-based (ID-based) threshold signature model to solve the key escrow problem and can be converted into a certificateless threshold signature model. In addition, we propose a secure and efficient certificate-based threshold signature scheme. Compared with previous ID-based threshold signature and certificateless threshold signature, our scheme requires no computation of pairings and no trusted dealer. In addition, in our proposed scheme, unlike most schemes that require all members to jointly generate a certificate or a signature, it only requires t or more than t members to generate a certificate or a signature. Our proposed scheme can detect dishonest participants as well. Therefore, our scheme is more practical than existing schemes. We show that our scheme is existentially unforgeable against adaptive chosen message attacks under the discrete logarithm assumption. Copyright (c) 2013 John Wiley & Sons, Ltd.", "paper_title": "Simulatable and secure certificate-based threshold signature without pairings", "paper_id": "WOS:000344322100034"}