{"auto_keywords": [{"score": 0.049010515885303176, "phrase": "research_agendas"}, {"score": 0.03860658093109415, "phrase": "research_materials"}, {"score": 0.033860864106080635, "phrase": "co-word_analysis"}, {"score": 0.03184366154103541, "phrase": "first_two_groups"}, {"score": 0.025098904315951673, "phrase": "research_agenda"}, {"score": 0.00481495049065317, "phrase": "material_transfer_agreements"}, {"score": 0.0045610584172982305, "phrase": "belgium"}, {"score": 0.003400274964240732, "phrase": "in-house_materials"}, {"score": 0.0030505976034245234, "phrase": "underlying_scientific_structure"}, {"score": 0.002712131567923321, "phrase": "signed_agreements"}, {"score": 0.002627587221594597, "phrase": "synchronic_and_diachronic_common_terms"}, {"score": 0.002603918128553617, "phrase": "co-word_clusters"}, {"score": 0.002488724764295623, "phrase": "cognitive_linkage"}, {"score": 0.002162951519368368, "phrase": "first_group"}, {"score": 0.0021049977753042253, "phrase": "third_group"}], "paper_keywords": [""], "paper_abstract": "In this paper we examine whether and to what extent material transfer agreements influence research agenda setting in biotechnology. Research agendas are mapped through patents, articles, letters, reviews, and notes. Three groups are sampled: (1) documents published by government and industry which used research materials received through those agreements, (2) documents published by government and industry which used in-house materials, (3) documents published by academia. Methodologically, a co-word analysis is performed to detect if there is a difference in underlying scientific structure between the first two groups of documents. Secondly, interviews with practitioners of industry and government are intended to capture their opinion regarding the impact of the signed agreements on their own research agenda choices. The existence of synchronic and diachronic common terms between co-word clusters, stemming from the first two groups of publications, suggests cognitive linkage. Moreover, interviewees generally do not consider themselves constrained in research agenda setting when signing agreements for receiving research materials. Finally, after applying a co-word analysis to detect if the first group of documents overlaps with the third group we cannot conclude that agreements signed by industry and government affect research agenda setting in academia.", "paper_title": "Do material transfer agreements affect the choice of research agendas? The case of biotechnology in Belgium", "paper_id": "WOS:000245453300007"}