{"auto_keywords": [{"score": 0.04855239486253465, "phrase": "shared_understanding"}, {"score": 0.008713768692145006, "phrase": "design_communication"}, {"score": 0.008346723432064782, "phrase": "design_meetings"}, {"score": 0.004345363360869553, "phrase": "physical_and_social_environment"}, {"score": 0.004072573194988867, "phrase": "multidisciplinary_design_teams"}, {"score": 0.00394264312173188, "phrase": "creative_design_meeting"}, {"score": 0.003635600104609725, "phrase": "mixed_physical-digital_interactive_systems"}, {"score": 0.003334309053314909, "phrase": "cognitive_science"}, {"score": 0.003193129886123359, "phrase": "interactive_\"traces"}, {"score": 0.002881255933884771, "phrase": "design_approach"}, {"score": 0.0025031188149336257, "phrase": "natural_contexts"}, {"score": 0.0023970487263732737, "phrase": "ongoing_social_as_well_as_physical_interactions"}, {"score": 0.0021394674440767124, "phrase": "collaborative_tools"}, {"score": 0.0021049977753042253, "phrase": "design_communication_theory"}], "paper_keywords": ["Collaborative Design", " Creative Meeting", " Design Communication", " Embodied Cognition", " Interactive Systems", " Research Through Design", " Scaffolding", " Situated Cognition", " Traces"], "paper_abstract": "In this paper we explore the influence of the physical and social environment (the design space) son the formation of shared understanding in multidisciplinary design teams. We concentrate on the creative design meeting as a microenvironment for studying processes of design communication. Our applied research context entails the design of mixed physical-digital interactive systems supporting design meetings. Informed by theories of embodiment that have recently gained interest in cognitive science, we focus on the role of interactive \"traces,\" representational artifacts both created and used by participants as scaffolds for creating shared understanding. Our research through design approach resulted in two prototypes that form two concrete proposals of how the environment may scaffold shared understanding in design meetings. In several user studies we observed users working with our systems in natural contexts. Our analysis reveals how an ensemble of ongoing social as well as physical interactions, scaffolded by the interactive environment, grounds the formation of shared understanding in teams. We discuss implications for designing collaborative tools and for design communication theory in general.", "paper_title": "Scaffolds for design communication: Research through design of shared understanding in design meetings", "paper_id": "WOS:000317658700004"}