{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "galois_transformers"}, {"score": 0.010148094243968278, "phrase": "static_analyzers"}, {"score": 0.004775726266706856, "phrase": "modular_abstract_interpreters_reusable_metatheory"}, {"score": 0.004736820055728928, "phrase": "program_analysis"}, {"score": 0.0044005599565517875, "phrase": "analysis_feature"}, {"score": 0.0043114466990006334, "phrase": "tedious_and_error_prone_work"}, {"score": 0.0035278613436978933, "phrase": "galois_connection_properties"}, {"score": 0.0034422330919613294, "phrase": "monadic_interpreter"}, {"score": 0.0033449479263613848, "phrase": "monad_transformers"}, {"score": 0.003304097742490624, "phrase": "building_blocks"}, {"score": 0.003277140908834426, "phrase": "classic_analysis_parameters"}, {"score": 0.002921975748248106, "phrase": "galois_transformer"}, {"score": 0.0027141975147496264, "phrase": "new_analysis"}, {"score": 0.002605201547405916, "phrase": "soundness_proofs"}, {"score": 0.0024903420152789135, "phrase": "monad_transformer_stack"}, {"score": 0.002380534385718454, "phrase": "viable_foundation"}, {"score": 0.0023610946923597405, "phrase": "reusable_and_composable_metatheory"}, {"score": 0.002220257443705344, "phrase": "analysis_design"}, {"score": 0.0021049977753042253, "phrase": "sound_analyzers"}], "paper_keywords": ["abstract interpretation", " monads", " Galois connections", " program analysis"], "paper_abstract": "The design and implementation of static analyzers has become increasingly systematic. Yet for a given language or analysis feature, it often requires tedious and error prone work to implement an analyzer and prove it sound. In short, static analysis features and their proofs of soundness do not compose well, causing a dearth of reuse in both implementation and metatheory. We solve the problem of systematically constructing static analyzers by introducing Galois transformers: monad transformers that transport Galois connection properties. In concert with a monadic interpreter, we define a library of monad transformers that implement building blocks for classic analysis parameters like context, path, and heap (in)sensitivity. Moreover, these can be composed together independent of the language being analyzed. Significantly, a Galois transformer can be proved sound once and for all, making it a reusable analysis component. As new analysis features and abstractions are developed and mixed in, soundness proofs need not be reconstructed, as the composition of a monad transformer stack is sound by virtue of its constituents. Galois transformers provide a viable foundation for reusable and composable metatheory for program analysis. Finally, these Galois transformers shift the level of abstraction in analysis design and implementation to a level where non-specialists have the ability to synthesize sound analyzers over a number of parameters.", "paper_title": "Galois Transformers and Modular Abstract Interpreters Reusable Metatheory for Program Analysis", "paper_id": "WOS:000367256500032"}