{"auto_keywords": [{"score": 0.02839829974363596, "phrase": "java"}, {"score": 0.00481495049065317, "phrase": "multicomputer_network_performance_evaluation"}, {"score": 0.0047113960612140335, "phrase": "interconnection_network"}, {"score": 0.004350308086118336, "phrase": "great_impact"}, {"score": 0.004287680323820891, "phrase": "global_system_performance"}, {"score": 0.003987755561492638, "phrase": "network_performance"}, {"score": 0.0032783186166708985, "phrase": "different_situations"}, {"score": 0.0025611773887867255, "phrase": "gnu_open-source_license"}, {"score": 0.0023303871145705954, "phrase": "performance_impact_study"}, {"score": 0.0022967713922705, "phrase": "injection_channels"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Multicomputers", " Interconnection networks", " Flit-level simulators", " Packet latency", " Performance modelling", " Simulation"], "paper_abstract": "The interconnection network is one of the most important multicomputer components, since it has a great impact on global system performance. Many models and simulators have been proposed to evaluate network performance. This paper presents SimuRed, an event-driven flit-level, cycle-accurate simulator to evaluate different orthogonal network configurations. The core of the simulator has been designed to be expandable and portable to different situations. Some of the advantages of this simulator over other similar tools are its visual interface, its fast execution and its simplicity. Moreover, it is multiplatform and its source code versions (C++ and Java) are freely available under GNU open-source license. The performance of this simulator has been evaluated, including a performance impact study of injection channels and deterministic/adaptive routing for meshes and hypercubes. (C) 2009 Elsevier Ltd. All rights reserved.", "paper_title": "SimuRed: A flit-level event-driven simulator for multicomputer network performance evaluation", "paper_id": "WOS:000269927300017"}