{"auto_keywords": [{"score": 0.04949240338189186, "phrase": "steel_sheet"}, {"score": 0.04380528596779502, "phrase": "learned_models"}, {"score": 0.04346060492379688, "phrase": "neural_networks"}, {"score": 0.00481495049065317, "phrase": "meta-heuristic_improvements"}, {"score": 0.004640079189342692, "phrase": "previous_studies"}, {"score": 0.004583205112737672, "phrase": "wrapper_feature_selection_method"}, {"score": 0.004471530397729526, "phrase": "incremental_cold_shaping_process"}, {"score": 0.0041184843463633386, "phrase": "support_vector_machines"}, {"score": 0.00405127920820053, "phrase": "ssics"}, {"score": 0.0036104596826132965, "phrase": "real_world_decision_support_problems"}, {"score": 0.0031260524791486347, "phrase": "different_cross_validation_methods"}, {"score": 0.002938821840519756, "phrase": "chosen_features"}, {"score": 0.0027514186391258263, "phrase": "well-known_data_sets"}, {"score": 0.002651291854234327, "phrase": "in-depth_analysis"}, {"score": 0.002618730478351454, "phrase": "experiment_results"}, {"score": 0.002276439636865258, "phrase": "model_parameters"}, {"score": 0.0021845387990972543, "phrase": "different_enhancements"}, {"score": 0.0021311850321045767, "phrase": "real_world_problem"}], "paper_keywords": ["Genetic feature selection", " Cross validation methods", " Neural networks", " Support vector machines", " Real world applications"], "paper_abstract": "In previous studies, a wrapper feature selection method for decision support in steel sheet incremental cold shaping process (SSICS) was proposed. The problem included both regression and classification, while the learned models were neural networks and support vector machines, respectively. SSICS is the type of problem for which the number of features is similar to the number of instances in the data set, this represents many of real world decision support problems found in the industry. This study focuses on several questions and improvements that were left open, suggesting proposals for each of them. More specifically, this study evaluates the relevance of the different cross validation methods in the learned models, but also proposes several improvements such as allowing the number of chosen features as well as some of the parameters of the neural networks to evolve, accordingly. Well-known data sets have been use in this experimentation and an in-depth analysis of the experiment results is included. 5 x 2 CV has been found the more interesting cross validation method for this kind of problems. In addition, the adaptation of the number of features and, consequently, the model parameters really improves the performance of the approach. The different enhancements have been applied to the real world problem, an several conclusions have been drawn from the results obtained.", "paper_title": "Meta-heuristic improvements applied for steel sheet incremental cold shaping", "paper_id": "WOS:000209099300002"}