{"auto_keywords": [{"score": 0.03395053002397818, "phrase": "numerical_artifacts"}, {"score": 0.00481495049065317, "phrase": "navier-stokes_equations"}, {"score": 0.0047468516620285525, "phrase": "low_mach_number_limit"}, {"score": 0.004548253531664032, "phrase": "adjoint_low_mach_number_equations"}, {"score": 0.0043786774510943625, "phrase": "global_mode_solver"}, {"score": 0.0042354707960660706, "phrase": "low_mach_number_equations"}, {"score": 0.004000741805312148, "phrase": "variable_density"}, {"score": 0.0037789720824759503, "phrase": "acoustic_waves"}, {"score": 0.003307988966112615, "phrase": "exactly_the_same_eigenvalue"}, {"score": 0.003261133560558666, "phrase": "corresponding_direct_global_mode"}, {"score": 0.0029793675408245047, "phrase": "slightly_different_eigenvalue"}, {"score": 0.0027218799769229596, "phrase": "mode_shapes"}, {"score": 0.0022824314760583834, "phrase": "direct_and_adjoint_global_modes"}, {"score": 0.0021971473452127126, "phrase": "wavemaker_region"}, {"score": 0.0021659920594094407, "phrase": "low_density_jet"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Hydrodynamic stability", " Adjoint", " Low Mach number", " Non-normality", " Global modes"], "paper_abstract": "This paper describes a derivation of the adjoint low Mach number equations and their implementation and validation within a global mode solver. The advantage of using the low Mach number equations and their adjoints is that they are appropriate for flows with variable density, such as flames, but do not require resolution of acoustic waves. Two versions of the adjoint are implemented and assessed: a discrete-adjoint and a continuous-adjoint. The most unstable global mode calculated with the discrete-adjoint has exactly the same eigenvalue as the corresponding direct global mode but contains numerical artifacts near the inlet. The most unstable global mode calculated with the continuous-adjoint has no numerical artifacts but a slightly different eigenvalue. The eigenvalues converge, however, as the time-step reduces. Apart from the numerical artifacts, the mode shapes are very similar, which supports the expectation that they are otherwise equivalent. The continuous-adjoint requires less resolution and usually converges more quickly than the discrete-adjoint but is more challenging to implement. Finally, the direct and adjoint global modes are combined in order to calculate the wavemaker region of a low density jet. (C) 2011 Elsevier Inc. All rights reserved.", "paper_title": "Adjoint algorithms for the Navier-Stokes equations in the low Mach number limit", "paper_id": "WOS:000300462100042"}