{"auto_keywords": [{"score": 0.04658008825855551, "phrase": "generic_construction"}, {"score": 0.00481495049065317, "phrase": "universal_designated-verifier_signatures"}, {"score": 0.004749106104067268, "phrase": "identity-based_signatures"}, {"score": 0.004053362743156545, "phrase": "class_c."}, {"score": 0.003997891221012094, "phrase": "resulting_schemes"}, {"score": 0.003483120583663528, "phrase": "also_non-delegatable"}, {"score": 0.003296212583539166, "phrase": "designated_verifier"}, {"score": 0.00271735110571002, "phrase": "adaptive_chosen_message"}, {"score": 0.002571429085596686, "phrase": "possible_extensions"}, {"score": 0.0025014259919355453, "phrase": "identity-based_ring_signatures"}, {"score": 0.002467140591777737, "phrase": "identity-based_designated-verifier_signatures"}, {"score": 0.0021049977753042253, "phrase": "combined_functionalities"}], "paper_keywords": [""], "paper_abstract": "The authors give a generic construction for universal (mutli) designated-verifier signature schemes from a large class of signature schemes, referred to as Class C. The resulting schemes are efficient and have two important properties. Firstly, they are provably DV-unforgeable, non-transferable and also non-delegatable. Secondly, the signer and the designated verifier can independently choose their cryptographic settings. The authors also propose a generic construction for (hierarchical) identity-based signature schemes from any signature scheme in C and prove that the construction is secure against adaptive chosen message and identity attacks. The authors discuss possible extensions of our constructions to identity-based ring signatures and identity-based designated-verifier signatures from any signature in C. Finally, the authors show that it is possible to combine the above constructions to obtain signatures with combined functionalities.", "paper_title": "Generic constructions for universal designated-verifier signatures and identity-based signatures from standard signatures", "paper_id": "WOS:000272895500004"}