{"auto_keywords": [{"score": 0.04968114352851348, "phrase": "information_science"}, {"score": 0.04928674718599396, "phrase": "library_science"}, {"score": 0.0060045092625089875, "phrase": "library_science_researchers"}, {"score": 0.005276563241720225, "phrase": "lis"}, {"score": 0.00481495049065317, "phrase": "interdisciplinary_changes"}, {"score": 0.004579780586951551, "phrase": "direct_citation"}, {"score": 0.004466519142879166, "phrase": "interdisciplinary_characteristics"}, {"score": 0.004108742905942481, "phrase": "five_library_science_journals"}, {"score": 0.004074574278425223, "phrase": "five_information_science_journals"}, {"score": 0.0036697826637943063, "phrase": "rising_trend"}, {"score": 0.003279039724748895, "phrase": "larger_contributions"}, {"score": 0.002671722386856879, "phrase": "decreasing_trend"}, {"score": 0.002498812056838983, "phrase": "non-lis_disciplines"}, {"score": 0.0023964590500856887, "phrase": "education_sources"}, {"score": 0.0023566987138026285, "phrase": "library_science_articles"}, {"score": 0.0022507188208913394, "phrase": "computer_science_sources"}, {"score": 0.0022041312401435346, "phrase": "information_science_articles"}, {"score": 0.00212268510072928, "phrase": "interdisciplinary_indicator"}, {"score": 0.0021049977753042253, "phrase": "brillouin's_index"}], "paper_keywords": ["Interdisciplinary changes", " Library science", " Information science", " Direct citation"], "paper_abstract": "This study employs the method of direct citation to analyze and compare the interdisciplinary characteristics of the two disciplines of library science and information science during the period of 1978-2007. Based on the research generated by five library science journals and five information science journals, library science researchers tend to cite publications from library and information science (LIS), education, business/management, sociology, and psychology, while researchers of information science tend to cite more publications from LIS, general science, computer science, technology, and medicine. This means that the disciplines with larger contributions to library science are almost entirely different from those contributing to information science. In addition, researchers of library science frequently cite publications from LIS; the rate is as high as 65.61%, which is much higher than the rate for information science, 49.50%. However, a decreasing trend in the percentage of LIS in library science indicates that library science researchers tend to cite more publications from non-LIS disciplines. A rising trend in the proportion of references to education sources is reported for library science articles, while a rising trend in the proportion of references to computer science sources has been found for information science articles. In addition, this study applies an interdisciplinary indicator, Brillouin's Index, to measurement of the degree of interdisciplinarity. The results confirm that the trend toward interdisciplinarity in both information science and library science has risen over the years, although the degree of interdisciplinarity in information science is higher than that in library science.", "paper_title": "A comparative study of interdisciplinary changes between information science and library science", "paper_id": "WOS:000303533600009"}