{"auto_keywords": [{"score": 0.04933588390811373, "phrase": "utility_computing"}, {"score": 0.015574423535694304, "phrase": "commercial_computing_service"}, {"score": 0.014913680407873138, "phrase": "computing_services"}, {"score": 0.010599020161828301, "phrase": "utility_computing_model"}, {"score": 0.007859015732258468, "phrase": "evaluation_results"}, {"score": 0.00481495049065317, "phrase": "integrated_risk_analysis"}, {"score": 0.004710620078577185, "phrase": "recent_technological_advances"}, {"score": 0.0046819577231288125, "phrase": "grid"}, {"score": 0.004594137808658537, "phrase": "dynamic_delivery"}, {"score": 0.004182301599359094, "phrase": "real-world_utilities"}, {"score": 0.004130243047687995, "phrase": "electrical_power"}, {"score": 0.004015458740397976, "phrase": "new_outsourcing_service_model"}, {"score": 0.00389164348807591, "phrase": "service_level_agreements"}, {"score": 0.0036097844103129043, "phrase": "computing_infrastructures"}, {"score": 0.003531474887552889, "phrase": "specific_computing_service_providers"}, {"score": 0.0028625406368744995, "phrase": "wait_time"}, {"score": 0.0028446460307503343, "phrase": "sla_acceptance"}, {"score": 0.0027916287357898544, "phrase": "sla_requests"}, {"score": 0.002722468694023035, "phrase": "accepted_sla"}, {"score": 0.002439437869554093, "phrase": "resource_management_policies"}, {"score": 0.002327310963701377, "phrase": "separate_and_integrated_risk_analysis"}, {"score": 0.0021182494144182805, "phrase": "possible_risks"}, {"score": 0.0021049977753042253, "phrase": "future_utility_computing_situations"}], "paper_keywords": ["Utility computing", " Grid economy", " Risk", " Service", " Resource management", " Performance evaluation"], "paper_abstract": "Recent technological advances in Grid computing enable the virtualization and dynamic delivery of computing services on demand to realize utility computing. In utility computing, computing services will always be available to the users whenever the need arises, similar to the availability of real-world utilities, such as electrical power, gas, and water. With this new outsourcing service model, users are able to define their service needs through Service Level Agreements (SLAs) and only have to pay when they use the services. They do not have to invest on or maintain computing infrastructures themselves and are not constrained to specific computing service providers. Thus, a commercial computing service will face two new challenges: (i) what are the objectives or goals it needs to achieve in order to support the utility computing model, and (ii) how to evaluate whether these objectives are achieved or not. To address these two new challenges, this paper first identifies four essential objectives that are required to support the utility computing model: (i) manage wait time for SLA acceptance, (ii) meet SLA requests, (iii) ensure reliability of accepted SLA, and (iv) attain profitability. It then describes two evaluation methods that are simple and intuitive: (i) separate and (ii) integrated risk analysis to analyze the effectiveness of resource management policies in achieving the objectives. Evaluation results based on simulation successfully demonstrate the applicability of separate and integrated risk analysis to assess policies in terms of the objectives. These evaluation results which constitute an a posteriori risk analysis of policies can later be used to generate an a priori risk analysis of policies by identifying possible risks for future utility computing situations.", "paper_title": "Integrated Risk Analysis for a Commercial Computing Service in Utility Computing", "paper_id": "WOS:000272244100001"}