{"auto_keywords": [{"score": 0.04525702858275573, "phrase": "normalized_diversity_products"}, {"score": 0.00481495049065317, "phrase": "lattice-based_diagonal"}, {"score": 0.004266501496765747, "phrase": "product_distances"}, {"score": 0.0036676174658755683, "phrase": "tight_upper_bounds"}, {"score": 0.003576286811853861, "phrase": "maximal_normalized_diversity_products"}, {"score": 0.0030431561187109846, "phrase": "qam"}, {"score": 0.0027929100418926725, "phrase": "n_x_n-diagonal_space-time_code_design_method"}, {"score": 0.0026023381988430666, "phrase": "matrix_size"}, {"score": 0.0024742098091226203, "phrase": "better_normalized_diversity_products"}, {"score": 0.002437012847684331, "phrase": "optimal_diagonal_cyclotomic_codes"}, {"score": 0.0021049977753042253, "phrase": "golden_code"}], "paper_keywords": ["Algebraic extension", " complex lattice", " Golden code", " normalized diversity product", " space-time block code"], "paper_abstract": "In this paper, we first present two tight upper hounds for the normalized diversity products (or product distances) of 2 x 2 diagonal space-time block codes from quadratic extensions on Q(i) and Q(zeta(6)), where i = root-1 and zeta(6) = exp(i2 pi/6). Two such codes are shown to reach the tight upper bounds and therefore have the maximal normalized diversity products. We present two new diagonal space-time block codes from higher order algebraic extensions on Q(i) and Q(zeta(6)) for three and four transmit antennas. We also present a nontight upper bound for normalized diversity products of 2 x 2 diagonal space-time block codes with QAM information symbols, i.e., in Z[i], from general 2 x 2 complex-valued generating matrices. We then present an n x n-diagonal space-time code design method directly from 2n real integers based on extended complex lattices (of generating matrix size n x 2n) that are shown to have better normalized diversity products than the optimal diagonal cyclotomic codes do. We finally use the optimal 2 x 2 diagonal space-time codes from the optimal quadratic extensions to construct two 2 x 2 full-rate space-time block codes and find that both of them have better normalized diversity products than the Golden code does.", "paper_title": "Some Designs and Normalized Diversity Product Upper Bounds for Lattice-Based Diagonal and Full-Rate Space-Time Block Codes", "paper_id": "WOS:000263375500010"}