{"auto_keywords": [{"score": 0.004339609346924681, "phrase": "increased_concerns"}, {"score": 0.0037321585095070483, "phrase": "comprehensive_security_analysis"}, {"score": 0.0035063024767122684, "phrase": "best_practices"}, {"score": 0.0034700069041302003, "phrase": "system_design"}, {"score": 0.0031928040608991543, "phrase": "security_threats"}, {"score": 0.0030466955629231047, "phrase": "specific_security_aspects"}, {"score": 0.0029072537537959374, "phrase": "last_aspect"}, {"score": 0.002847339938387273, "phrase": "existing_analyses"}, {"score": 0.0028178463431115562, "phrase": "security_models"}, {"score": 0.0027741761880779535, "phrase": "related_literature"}, {"score": 0.002311933249234786, "phrase": "higher_complexity"}, {"score": 0.002206045784326466, "phrase": "general_perception"}, {"score": 0.0021049977753042253, "phrase": "commonplace_belief"}], "paper_keywords": ["P2P streaming", " IPTV", " Security", " Privacy"], "paper_abstract": "Streaming applications over Peer-To-Peer (P2P) systems have gained an enormous popularity. Success always implies increased concerns about security, protection, privacy and all the other 'side' properties that transform an experimental application into a service. Research on security for P2P streaming started to flourish, but no comprehensive security analysis over the current P2P solutions has yet been attempted. There are no best practices in system design, no (widely) accepted attack models, no measurement-based studies on security threats to P2P streaming, nor even general surveys investigating specific security aspects for these systems. This paper addresses this last aspect. Starting from existing analyses and security models in the related literature, we give an overview on security and privacy considerations for P2P streaming systems. Our analysis emphasizes two major facts: (i) the Byzantine-Altruistic-Rational (BAR) model offers stronger security guarantees compared to other approaches, at the cost of higher complexity and overhead; and (ii) the general perception (not necessarily the truth, but a commonplace belief) that it is necessary to sacrifice accuracy or performance in order to tolerate faults or misbehaviors, is not always true.", "paper_title": "Security and privacy issues in P2P streaming systems: A survey", "paper_id": "WOS:000289482200001"}