{"auto_keywords": [{"score": 0.04318562459045211, "phrase": "hysteresis_losses"}, {"score": 0.00481495049065317, "phrase": "vector_preisach_models"}, {"score": 0.004763895422211728, "phrase": "purpose_-_the_magnetic_modeling"}, {"score": 0.004304963945457799, "phrase": "energy_efficient_devices"}, {"score": 0.004081385289516914, "phrase": "magnetizing_processes"}, {"score": 0.0038487848937121204, "phrase": "pertinent_parameters"}, {"score": 0.0035527409334589317, "phrase": "vector_model"}, {"score": 0.0031255543155487234, "phrase": "different_losses"}, {"score": 0.0027643161113894018, "phrase": "isotropic_media"}, {"score": 0.0026486862281576086, "phrase": "anisotropic_media"}, {"score": 0.002256435842862802, "phrase": "average_dissipation"}, {"score": 0.0021049977753042253, "phrase": "dpc_model"}], "paper_keywords": ["Magnetism", " Energy", " Vectors"], "paper_abstract": "Purpose - The magnetic modeling of materials has been focused on computing magnetization and forces in devices. With increasing efforts to make energy efficient devices, attention must now be paid to hysteresis losses in magnetizing processes. The purpose of this paper is to discuss the pertinent parameters that determine these losses and a method of identifying them. Design/methodology/approach - A vector model was used that is designed to compute losses correctly, to focus on hysteresis losses in models that compute the same magnetization, but have different losses. Findings - The model computes the same cyclic losses as expected. Research limitations/implications - The analysis of this paper is limited to isotropic media, but it can be generalized to anisotropic media. The accuracy of the Della Torre, Pinzaglia and Cardelli (DPC) model is also limited. Practical implications - Once the model has been validated, the designer can minimize the instantaneous as well as the average dissipation. This will permit the design of more reliable devices. Originality/value - The DPC model used in this work has not been fully explored previously.", "paper_title": "Hysteresis loss in vector Preisach models", "paper_id": "WOS:000287222800008"}