{"auto_keywords": [{"score": 0.0490266361501644, "phrase": "inconsistency_measures"}, {"score": 0.00481495049065317, "phrase": "shapley_inconsistency_values"}, {"score": 0.004744123493964429, "phrase": "relatively_few_proposals"}, {"score": 0.004674333455266527, "phrase": "propositional_belief_bases"}, {"score": 0.00452101969521343, "phrase": "information_measures"}, {"score": 0.004487635647709636, "phrase": "artificial_intelligence"}, {"score": 0.0043889488321824785, "phrase": "computer_science"}, {"score": 0.00418247778205288, "phrase": "belief_revision"}, {"score": 0.0041515831652973794, "phrase": "belief_merging"}, {"score": 0.0038548668648948044, "phrase": "first_class"}, {"score": 0.003423445743298995, "phrase": "second_class"}, {"score": 0.002582032847722892, "phrase": "existing_inconsistency_measures"}, {"score": 0.0025064622665903645, "phrase": "coalitional_form"}, {"score": 0.0024421501497321027, "phrase": "shapley_value"}, {"score": 0.0024061422012437344, "phrase": "inconsistency_measure"}, {"score": 0.0023184226291364097, "phrase": "overall_inconsistency"}, {"score": 0.0022009497295481678, "phrase": "belief_base"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Inconsistency management", " Inconsistency tolerance", " Inconsistency measures", " Conflict resolution", " Paraconsistency", " Shapley values"], "paper_abstract": "There are relatively few proposals for inconsistency measures for propositional belief bases. However inconsistency measures are potentially as important as information measures for artificial intelligence, and more generally for computer science. In particular, they can be useful to define various operators for belief revision, belief merging, and negotiation. The measures that have been proposed so far can be split into two classes. The first class of measures takes into account the number of formulae required to produce an inconsistency: the more formulae required to produce an inconsistency, the less inconsistent the base. The second class takes into account the proportion of the language that is affected by the inconsistency: the more propositional variables affected, the more inconsistent the base. Both approaches are sensible, but there is no proposal for combining them. We address this need in this paper: our proposal takes into account both the number of variables affected by the inconsistency and the distribution of the inconsistency among the formulae of the base. Our idea is to use existing inconsistency measures in order to define a game in coalitional form, and then to use the Shapley value to obtain an inconsistency measure that indicates the responsibility/contribution of each formula to the overall inconsistency in the base. This allows us to provide a more reliable image of the belief base and of the inconsistency in it. (C) 2010 Elsevier B.V. All rights reserved.", "paper_title": "On the measure of conflicts: Shapley Inconsistency Values", "paper_id": "WOS:000281178700001"}