{"auto_keywords": [{"score": 0.048364759730099696, "phrase": "web_visibility"}, {"score": 0.00481495049065317, "phrase": "media_and_communication_journals"}, {"score": 0.004036968488559984, "phrase": "communication_journals"}, {"score": 0.003939980614608309, "phrase": "social_science_citation_index"}, {"score": 0.003384262486955773, "phrase": "highest_web_presence"}, {"score": 0.003089080923888397, "phrase": "national_and_linguistic_variables"}, {"score": 0.00303319936111073, "phrase": "individual_researchers"}, {"score": 0.0029965060407413898, "phrase": "web_data"}, {"score": 0.0028890603352364273, "phrase": "bing.com_advanced_search_tool"}, {"score": 0.0028195727965553367, "phrase": "api._web_presence"}, {"score": 0.002466139325703204, "phrase": "entire_communication_webosphere"}, {"score": 0.0022508572821818124, "phrase": "weak_but_statistically_significant_correlation"}, {"score": 0.0022236070278432575, "phrase": "researchers'_web_visibility"}], "paper_keywords": ["Web visibility", " Webometrics", " Scientometrics", " Media and communication science"], "paper_abstract": "This paper examines the Web visibility of researchers in the field of communication. First, we measured the Web visibility of authors who have recently published their research in communication journals contained in the Social Science Citation Index (SSCI) provided by the Web of Science. Second, we identified a subset of authors based on their publication outlets and summarize those researchers with the highest Web presence. Lastly, we determined the factors affecting their Web visibility by using a set of national and linguistic variables of the individual researchers. Web data were collected by using a Bing.com advanced search tool based on the API. Web presence is defined as the number of Web (co-) mentions of each researcher. We identified the most solely-visible scholars in the entire communication webosphere and scholars with the most networked visibility based on co-mentions. There is a weak but statistically significant correlation between researchers' Web visibility and their SSCI publication counts. Further, US-based and/or English-speaking scholars were more noticeable than others on cyberspace.", "paper_title": "Web visibility of scholars in media and communication journals", "paper_id": "WOS:000309357600015"}