{"auto_keywords": [{"score": 0.03765408593638563, "phrase": "technical_articles"}, {"score": 0.03288705176359931, "phrase": "implicit_structure"}, {"score": 0.00481495049065317, "phrase": "grammatical_inference_techniques"}, {"score": 0.004569293780076254, "phrase": "domain_instances"}, {"score": 0.004336115760817672, "phrase": "implicit_agreed-upon_structure"}, {"score": 0.004067152645111547, "phrase": "computer_programs"}, {"score": 0.003726967166630923, "phrase": "search_queries"}, {"score": 0.0033170847930578473, "phrase": "particular_part"}, {"score": 0.0031660031870090434, "phrase": "reference_section"}, {"score": 0.002752695791351096, "phrase": "semantic_web"}, {"score": 0.0025816953009851072, "phrase": "structure_information"}, {"score": 0.002507511169156787, "phrase": "grammar_inference_techniques"}, {"score": 0.002421291757425244, "phrase": "semi-automatic_approach"}, {"score": 0.0021799789348982516, "phrase": "grammatical_description"}, {"score": 0.0021049977753042253, "phrase": "supplied_examples"}], "paper_keywords": [""], "paper_abstract": "Information produced by people usually has an implicit agreed-upon structure. However, this structure is not usually available to computer programs, where it could be used, for example, to aid in answering search queries. For example, when considering technical articles, one could ask for the occurrence of a keyword in a particular part of the article, such as the reference section. This implicit structure could be used, in the form of an ontology, to further the efforts of improving search in the semantic web. We propose a method to build ontologies encoding this structure information by the application of grammar inference techniques. This results in a semi-automatic approach to the inference of such ontologies. Our approach has two main components: (1) the inference of a grammatical description of the implicit structure of the supplied examples, and (2) the transformation of that description into an ontology. We present the application of the method to the inference of an ontology describing the structure of technical articles.", "paper_title": "Using grammatical inference techniques to learn ontologies that describe the structure of domain instances", "paper_id": "WOS:000253657000007"}