{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "defeasible_logic_rule_bases"}, {"score": 0.04946824888397643, "phrase": "semantic_web"}, {"score": 0.027250289235800043, "phrase": "rdf_schema_ontologies"}, {"score": 0.004515467468684217, "phrase": "upcoming_efforts"}, {"score": 0.00440093312826378, "phrase": "semantic_web_vision"}, {"score": 0.003937126962709418, "phrase": "defeasible_reasoning"}, {"score": 0.0037719988989298983, "phrase": "incomplete_and_conflicting_information"}, {"score": 0.0037078961288626185, "phrase": "powerful_tool"}, {"score": 0.003316884515934182, "phrase": "additional_complex_semantic_relationships"}, {"score": 0.0030837288356760973, "phrase": "semantic_relationships"}, {"score": 0.002854645802851, "phrase": "vdr-device"}, {"score": 0.0027230880516264685, "phrase": "semantic_web_environment"}, {"score": 0.002665305036900055, "phrase": "integrated_development_environment"}, {"score": 0.0023233800372985686, "phrase": "flexible_framework"}, {"score": 0.002264321283759897, "phrase": "defeasible_reasoning_system"}, {"score": 0.00218789980093445, "phrase": "rdf_data"}, {"score": 0.0021049977753042253, "phrase": "user-friendly_rule_base"}], "paper_keywords": ["semantic web", " reasoning", " defeasible logic", " visual representation", " rule editor", " rule mark-up languages"], "paper_abstract": "Logic is currently the target of the majority of the upcoming efforts towards the realization of the Semantic Web vision, namely making the content of the Web accessible not only to humans, as it is today, but to machines as well. Defeasible reasoning, a rule-based approach to reasoning with incomplete and conflicting information, is a powerful tool in many Semantic Web applications. Despite its strong mathematical background, logic, in general, and defeasible logic, in particular, may overload the user with tons of additional complex semantic relationships among data and metadata of the Semantic Web. To this end, a comprehensible, visual representation of these semantic relationships (rules) would help users understand them and make more use of them. This paper presents VDR-DEVICE, a defeasible reasoning system, designed specifically for the Semantic Web environment. VDR-DEVICE is an integrated development environment for deploying and visualizing defeasible logic rule bases on top of RDF Schema ontologies. The system consists of a number of sub-components, which, though developed autonomously, are combined efficiently, forming a flexible framework. The system employs a defeasible reasoning system that supports direct importing and processing of RDF data and RDF Schema ontologies as well as a number of user-friendly rule base and ontology visualization modules. (C) 2008 Elsevier B.V. All rights reserved.", "paper_title": "Deploying defeasible logic rule bases for the semantic web", "paper_id": "WOS:000257253400008"}