{"auto_keywords": [{"score": 0.0283519704158407, "phrase": "broadcast_network"}, {"score": 0.00481495049065317, "phrase": "interworked_broadcast"}, {"score": 0.004782848614014638, "phrase": "mobile_networks"}, {"score": 0.004750959742844963, "phrase": "industry_reactions"}, {"score": 0.0047192824773697, "phrase": "major_shifts"}, {"score": 0.004672160300006692, "phrase": "mobile_broadcast_convergence"}, {"score": 0.0044286400018187354, "phrase": "broadcast_industries"}, {"score": 0.003978866233891427, "phrase": "contrasting_requirements"}, {"score": 0.003939107874750185, "phrase": "different_players"}, {"score": 0.0034684722988160637, "phrase": "internet_protocol"}, {"score": 0.003331828027460222, "phrase": "heterogeneous_networks"}, {"score": 0.003287482882222731, "phrase": "generic_interworking_platform"}, {"score": 0.003115908199991072, "phrase": "\"interworking_protocol"}, {"score": 0.0029631742332058087, "phrase": "underlying_transport_mechanisms"}, {"score": 0.002884792163423083, "phrase": "confirm_connectivity_architecture_definition"}, {"score": 0.002855934865505357, "phrase": "interworking_model"}, {"score": 0.002582731586309754, "phrase": "broadcast_interface"}, {"score": 0.0023990982005125763, "phrase": "user_intervention"}, {"score": 0.002367137788925062, "phrase": "dvb_interface"}, {"score": 0.0022434880661725493, "phrase": "total_number"}, {"score": 0.00222103160420506, "phrase": "connectivity_messages"}, {"score": 0.00216950156199795, "phrase": "multimode_terminals"}, {"score": 0.002140593237903078, "phrase": "simulation_results"}], "paper_keywords": [""], "paper_abstract": "Industry reactions to major shifts such as mobile broadcast convergence are typically a mixture,of opportunities and threats. Both the mobile and the broadcast industries acknowledge the role that convergence will play in their commercial futures, but both would prefer to achieve convergence \"on their own patch.\" For this reason, the most appealing solution to fulfill the contrasting requirements from the different players is represented by interworking between these networks rather than integration. This approach avoids integration, thereby minimizing the changes required in each network and ensuring each network remains an autonomous, independently managed entity. The Internet Protocol (IP) is chosen as the \"glue\" between these heterogeneous networks, providing the generic interworking platform. The main reason behind this choice. is that IP was designed as an \"interworking protocol\" to connect multiple, physically different networks in such a way as to remain independent of the underlying transport mechanisms used. This article concentrates on the confirm connectivity architecture definition of the interworking model between WLAN, 3G, and DVB. Broadcast networks are uni-directional in nature. When a user wants to receive a service over a broadcast network, there is no way to know whether the broadcast interface of the terminal is configured correctly. In this article we describe a method to automatically configure and test, without user intervention, that the DVB interface of the terminal can receive datagrams from the broadcast network. Furthermore, an optimization method to reduce the total number of confirm connectivity messages (CCMs) sent by the multimode terminals is introduced with simulation results to validate and prove its effectiveness.", "paper_title": "Confirming connectivity in interworked broadcast and mobile networks", "paper_id": "WOS:000245109800004"}