{"auto_keywords": [{"score": 0.041435594524021464, "phrase": "new_tumour_classes"}, {"score": 0.04072472046898861, "phrase": "estimation_approach"}, {"score": 0.00481495049065317, "phrase": "dna_microarray_data"}, {"score": 0.0047292449487169345, "phrase": "main_objective"}, {"score": 0.004546000131069232, "phrase": "cluster_validity_methods"}, {"score": 0.00441718685609235, "phrase": "cancer_tumor_datasets"}, {"score": 0.004369824355829779, "phrase": "weighed_voting_technique"}, {"score": 0.004110831924517065, "phrase": "different_data_mining_techniques"}, {"score": 0.003923144245133288, "phrase": "dna_microarray_datasets"}, {"score": 0.0038256426589560774, "phrase": "useful_tool"}, {"score": 0.0037845987749316632, "phrase": "biological_and_biomedical_knowledge_discovery"}, {"score": 0.0035473867669654174, "phrase": "universal_pattern_recognition"}, {"score": 0.0034716556902775037, "phrase": "molecular_profiles"}, {"score": 0.0034467717443162015, "phrase": "different_datasets"}, {"score": 0.0032893028281789287, "phrase": "validation_method"}, {"score": 0.0026220625042810706, "phrase": "effective_tool"}, {"score": 0.0025938977569302177, "phrase": "biomedical_knowledge_discovery"}, {"score": 0.0025752890978323873, "phrase": "healthcare_applications"}, {"score": 0.0022703709180757576, "phrase": "clustering_results"}, {"score": 0.0021049977753042253, "phrase": "gene_expression_profiles"}], "paper_keywords": ["gene expression", " data mining", " clustering", " cluster evaluation", " validity indices"], "paper_abstract": "Objectives. The main objective of the research is an application of the clustering and cluster validity methods to estimate the number of clusters in cancer tumor datasets. A weighed voting technique is going to be used to improve the prediction of the number of clusters based on different data mining techniques. These tools may be used for the identification of new tumour classes using DNA microarray datasets. This estimation approach may perform a useful tool to support biological and biomedical knowledge discovery. Methods:Three clustering and two validation algorithms were applied to two cancer tumor dotasets. Recent studies confirm that there is no universal pattern recognition and clustering model to predict molecular profiles across different datasets. Thus, it is useful not to rely on one single clustering or validation method, but to apply a variety of approaches. Therefore, combination of these methods may be successfully used for the estimation of the number of clusters. Results. The methods implemented in this research may contribute to the validation of clustering results and the estimation of the number of clusters. The results show that this estimation approach may represent an effective tool to support biomedical knowledge discovery and healthcare applications. Conclusion: The methods implemented in this research may be successfully used for the estimation of the number of clusters. The methods implemented in this research may contribute to the validation of clustering results and the estimation of the number of clusters. These tools may be used for the identification of new tumour classes using gene expression profiles.", "paper_title": "Estimating the number of clusters in DNA microarray data", "paper_id": "WOS:000236051700004"}