{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "increasing_number"}, {"score": 0.004769182299692333, "phrase": "architectural_techniques"}, {"score": 0.004678940805063634, "phrase": "hardware_counting_bloom_filters"}, {"score": 0.004172094622123562, "phrase": "membership_tests"}, {"score": 0.00409310463335204, "phrase": "imprecise_and_compact_representation"}, {"score": 0.004034841146538891, "phrase": "large_set"}, {"score": 0.0036494864560524735, "phrase": "full_custom_layouts"}, {"score": 0.003413183361838603, "phrase": "sram_array"}, {"score": 0.00305762327908599, "phrase": "circuit_simulations"}, {"score": 0.0025737890313763407, "phrase": "analytical_energy"}, {"score": 0.002549269480908849, "phrase": "delay_models"}, {"score": 0.0023954743066925714, "phrase": "architectural_level_explorations"}, {"score": 0.0023613185213421173, "phrase": "physical_level_implementation"}, {"score": 0.0022294857939412073, "phrase": "l-cbf_organizations"}, {"score": 0.002176747110119268, "phrase": "analytical_models"}, {"score": 0.0021049977753042253, "phrase": "spectre_simulation_results"}], "paper_keywords": ["computer architecture", " counting bloom filters", " implementation", " low power", " microprocessors"], "paper_abstract": "An increasing number of architectural techniques have relied on hardware counting bloom filters (CBFs) to improve upon the energy, delay, and complexity of various processor structures. CBFs improve the energy and speed of membership tests by maintaining an imprecise and compact representation of a large set to be searched. This paper studies the energy, delay, and area characteristics of two implementations for CM using full custom layouts in a commercial 0.13-mu m fabrication technology. One implementation, S-CBF, uses an SRAM array of counts and a shared up/down counter. Our proposed implementation, L-CBF, utilizes an array of up/down linear feedback shift registers and local zero detectors. Circuit simulations show that for a 1 K-entry CBF with a 15-bit count per entry, L-CBF compared to S-CBF is 3.7 x or 1.6 x faster and requires 2.3 x or 1.4 x less energy depending on the operation. Additionally, this paper presents analytical energy and delay models for L-CBF. These models can estimate energy and delay of various CBF organizations during architectural level explorations when a physical level implementation is not available. Our results demonstrate that for a variety of L-CBF organizations, the estimations by analytical models are within 5% and 10% of Spectre simulation results for delay and energy, respectively.", "paper_title": "L-CBF: A low-power, fast counting bloom filter architecture", "paper_id": "WOS:000256768000004"}