{"auto_keywords": [{"score": 0.04508646578033619, "phrase": "theses_database"}, {"score": 0.03718034097391595, "phrase": "proquest_scs"}, {"score": 0.00481495049065317, "phrase": "interdisciplinary_frames"}, {"score": 0.004456044928556639, "phrase": "social_sciences"}, {"score": 0.0043705604923728195, "phrase": "proquest_dissertations"}, {"score": 0.003163985877966426, "phrase": "doctoral_work"}, {"score": 0.0031233388358844188, "phrase": "doctoral_graduates'_current_work"}, {"score": 0.00247460024299964, "phrase": "sociology_proquest_scs"}, {"score": 0.002380381895973937, "phrase": "survey_question"}, {"score": 0.002319566486828135, "phrase": "traditional_disciplinary_labels"}, {"score": 0.002202547013259953, "phrase": "post-interdisciplinary_space"}, {"score": 0.0021049977753042253, "phrase": "disciplinary_boundaries"}], "paper_keywords": ["Disciplinarity", " ProQuest", " Permeability", " Disciplines", " Subject categories"], "paper_abstract": "The ProQuest Dissertations and Theses database contains records for approximately 2.3 million dissertations conferred at 1,490 research institutions across 66 countries. Despite the scope of the Dissertations and Theses database, no study has explicitly sought to validate the accuracy of the ProQuest SCs. This research examines the degree to which ProQuest SCs serve as proxies for disciplinarity, the relevance of doctoral work to doctoral graduates' current work, and the permeability of disciplines from the perspective of the mismatch between SCs and disciplinarity. To examine these issues we conducted a survey of 2009-2010 doctoral graduates, cluster-sampled from Economics, Political Science, and Sociology ProQuest SCs. The results from the survey question the utility of traditional disciplinary labels and suggest that scholars may occupy a post-interdisciplinary space in which they move freely across disciplinary boundaries and identify with topics instead of disciplines.", "paper_title": "Post-interdisciplinary frames of reference: exploring permeability and perceptions of disciplinarity in the social sciences", "paper_id": "WOS:000345136000007"}