{"auto_keywords": [{"score": 0.047409238560376495, "phrase": "human_metabolic_pathways"}, {"score": 0.014437736621833678, "phrase": "chemical_space"}, {"score": 0.011447270630167997, "phrase": "small_molecule"}, {"score": 0.00481495049065317, "phrase": "mapping_human_metabolic_pathways"}, {"score": 0.004355415885815204, "phrase": "small_molecules"}, {"score": 0.0036669760226536977, "phrase": "statistical_model"}, {"score": 0.003253791343615811, "phrase": "marketed_drugs"}, {"score": 0.0029569247903654477, "phrase": "visual_and_quantitative_approaches"}, {"score": 0.002887028262617443, "phrase": "selected_physicochemical_and_topological_descriptors"}, {"score": 0.0027259252868643926, "phrase": "metabolic_class"}, {"score": 0.0024417832296664698, "phrase": "strongly_overlapping_pathways"}, {"score": 0.002305468528385778, "phrase": "known_drugs"}, {"score": 0.0022725931637071852, "phrase": "human_metabolome"}, {"score": 0.0021560018573288666, "phrase": "likely_cross-interactions"}, {"score": 0.0021049977753042253, "phrase": "major_metabolic_pathways"}], "paper_keywords": [""], "paper_abstract": "The work presented here is a study of human metabolic pathways, as projected in the chemical space of the small molecules they comprise, and it is composed of three parts: a) a study of the extent of clustering and overlap of these pathways in chemical space, b) the development and assessment of a statistical model for estimating the proximity to a given pathway of any small molecule, and c) the use of the above model in estimating the proximity of marketed drugs to human metabolic pathways. The distribution, overlap, and relationships of human metabolic pathways in this space are revealed using both visual and quantitative approaches. A set of selected physicochemical and topological descriptors is used to build a classifier, whose aim is to predict metabolic class and pathway membership of any small molecule. The classifier performs well for tightly clustered, isolated pathways but is, naturally, much less accurate for strongly overlapping pathways. Finally, the extent of overlap of a set of known drugs with the human metabolome is examined, and the classifier is used to predict likely cross-interactions between drugs and the major metabolic pathways in humans.", "paper_title": "Mapping Human Metabolic Pathways in the Small Molecule Chemical Space", "paper_id": "WOS:000271011500012"}