{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "utilitarian_perspective"}, {"score": 0.004768104290288521, "phrase": "social_choice"}, {"score": 0.004302791070310513, "phrase": "social_choice_functions"}, {"score": 0.00413767314434795, "phrase": "ordinal_rankings"}, {"score": 0.004037694641919865, "phrase": "individual_agents"}, {"score": 0.0038074544783102226, "phrase": "social_choice_function"}, {"score": 0.003368948014436942, "phrase": "important_role"}, {"score": 0.003130396338031522, "phrase": "underlying_distribution"}, {"score": 0.003054681986032532, "phrase": "worst-case_distortion"}, {"score": 0.002966230968271199, "phrase": "selected_alternative"}, {"score": 0.0029086869572567072, "phrase": "social_welfare"}, {"score": 0.0027832502848247303, "phrase": "optimal_functions"}, {"score": 0.002573424607574822, "phrase": "optimal_social_choice_functions"}, {"score": 0.002379379676378223, "phrase": "latter_case"}, {"score": 0.00229914226836813, "phrase": "sample_complexity_results"}, {"score": 0.0022434880661725493, "phrase": "scoring_functions"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Computational social choice"], "paper_abstract": "We adopt a utilitarian perspective on social choice, assuming that agents have (possibly latent) utility functions over some space of alternatives. For many reasons one might consider mechanisms, or social choice functions, that only have access to the ordinal rankings of alternatives by the individual agents rather than their utility functions. In this context, one possible objective for a social choice function is the maximization of (expected) social welfare relative to the information contained in these rankings. We study such optimal social choice functions under three different models, and underscore the important role played by scoring functions. In our worst-case model, no assumptions are made about the underlying distribution and we analyze the worst-case distortion or degree to which the selected alternative does not maximize social welfare of optimal (randomized) social choice functions. In our average-case model, we derive optimal functions under neutral (or impartial culture) probabilistic models. Finally, a very general learning-theoretic model allows for the computation of optimal social choice functions (i.e., ones that maximize expected social welfare) under arbitrary, sampleable distributions. In the latter case, we provide both algorithms and sample complexity results for the class of scoring functions, and further validate the approach empirically. (C) 2015 Elsevier B.V. All rights reserved.", "paper_title": "Optimal social choice functions: A utilitarian view", "paper_id": "WOS:000359888400007"}