{"auto_keywords": [{"score": 0.04860000689752459, "phrase": "linear_and_kernel-based_predictors"}, {"score": 0.012978564516089149, "phrase": "auxiliary_information"}, {"score": 0.012778193972005868, "phrase": "noise_distribution"}, {"score": 0.00481495049065317, "phrase": "online_learning_of_noisy_data"}, {"score": 0.0047152877145889656, "phrase": "online_learning"}, {"score": 0.004475022550508119, "phrase": "random_noise"}, {"score": 0.0043367547691560175, "phrase": "noise_type"}, {"score": 0.003629882559085245, "phrase": "squared_loss"}, {"score": 0.0031513240597392843, "phrase": "general_setting"}, {"score": 0.003118486096035156, "phrase": "virtually_nothing"}, {"score": 0.0028828348726682965, "phrase": "general_losses"}, {"score": 0.0025555322596460036, "phrase": "multiple_copies"}, {"score": 0.0021049977753042253, "phrase": "independent_interest"}], "paper_keywords": [""], "paper_abstract": "We study online learning of linear and kernel-based predictors, when individual examples are corrupted by random noise, and both examples and noise type can be chosen adversarially and change over time. We begin with the setting where some auxiliary information on the noise distribution is provided, and we wish to learn predictors with respect to the squared loss. Depending on the auxiliary information, we show how one can learn linear and kernel-based predictors, using just 1 or 2 noisy copies of each example. We then turn to discuss a general setting where virtually nothing is known about the noise distribution, and one wishes to learn with respect to general losses and using linear and kernel-based predictors. We show how this can be achieved using a random, essentially constant number of noisy copies of each example. Allowing multiple copies cannot be avoided: Indeed, we show that the setting becomes impossible when only one noisy copy of each instance can be accessed. To obtain our results we introduce several novel techniques, some of which might be of independent interest.", "paper_title": "Online Learning of Noisy Data", "paper_id": "WOS:000297807300018"}