{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "intrinsically_motivated_learning"}, {"score": 0.049651030276363126, "phrase": "efficient_coding_hypothesis"}, {"score": 0.04838919478929022, "phrase": "sensory_signals"}, {"score": 0.04314074539597285, "phrase": "active_perception"}, {"score": 0.04215833196561754, "phrase": "sensory_model"}, {"score": 0.0047292449487169345, "phrase": "sensory_systems"}, {"score": 0.004388182727039715, "phrase": "response_properties"}, {"score": 0.0043619799095455415, "phrase": "visual_sensory_neurons"}, {"score": 0.004271490815763164, "phrase": "natural_images"}, {"score": 0.003987126862293129, "phrase": "efficient_code"}, {"score": 0.003916098498242888, "phrase": "reinforcement_learner"}, {"score": 0.003857871979942733, "phrase": "sense_organs"}, {"score": 0.003677280504320636, "phrase": "intrinsically_generated_reinforcement_signal"}, {"score": 0.003473737415587531, "phrase": "binocular_vison"}, {"score": 0.0034220655476652683, "phrase": "autonomous_development"}, {"score": 0.0034016119212097826, "phrase": "disparity_tuning"}, {"score": 0.0033812801309408514, "phrase": "vergence_control"}, {"score": 0.0032814236411444022, "phrase": "new_approach"}, {"score": 0.0032229262928681304, "phrase": "binocular_vision_system"}, {"score": 0.003167448052682065, "phrase": "robustness"}, {"score": 0.0031371236027587495, "phrase": "important_aspect"}, {"score": 0.0030353401945270755, "phrase": "unmodeled_disturbances"}, {"score": 0.002919287408226361, "phrase": "stereo_cameras"}, {"score": 0.0025202582748972122, "phrase": "system's_motor_degrees"}, {"score": 0.002255431275670053, "phrase": "behavior_policy"}, {"score": 0.0021049977753042253, "phrase": "self-calibrating_perceptual_system"}], "paper_keywords": ["active perception", " sparse coding", " reinforcement learning", " robotics", " stereo vision", " vergence", " robustness"], "paper_abstract": "The efficient coding hypothesis posits that sensory systems of animals strive to encode sensory signals efficiently by taking into account the redundancies in them. This principle has been very successful in explaining response properties of visual sensory neurons as adaptations to the statistics of natural images. Recently, we have begun to extend the efficient coding hypothesis to active perception through a form of intrinsically motivated learning: a sensory model learns an efficient code for the sensory signals while a reinforcement learner generates movements of the sense organs to improve the encoding of the signals. To this end, it receives an intrinsically generated reinforcement signal indicating how well the sensory model encodes the data. This approach has been tested in the context of binocular vison, leading to the autonomous development of disparity tuning and vergence control. Here we systematically investigate the robustness of the new approach in the context of a binocular vision system implemented on a robot. Robustness is an important aspect that reflects the ability of the system to deal with unmodeled disturbances or events, such as insults to the system that displace the stereo cameras. To demonstrate the robustness of our method and its ability to self-calibrate, we introduce various perturbations and test if and how the system recovers from them. We find that (1) the system can fully recover from a perturbation that can be compensated through the system's motor degrees of freedom, (2) performance degrades gracefully if the system cannot use its motor degrees of freedom to compensate for the perturbation, and (3) recovery from a perturbation is improved if both the sensory encoding and the behavior policy can adapt to the perturbation. Overall, this work demonstrates that our intrinsically motivated learning approach for efficient coding in active perception gives rise to a self-calibrating perceptual system of high robustness.", "paper_title": "Robust active binocular vision through intrinsically motivated learning", "paper_id": "WOS:000209236900010"}