{"auto_keywords": [{"score": 0.04112289743676207, "phrase": "ad_patients"}, {"score": 0.019876248858286226, "phrase": "artificial_neural_networks"}, {"score": 0.007502932669138962, "phrase": "alzheimer's_patients"}, {"score": 0.004523103062368843, "phrase": "alzheimer's_disease"}, {"score": 0.004383852039913171, "phrase": "decreased_quality"}, {"score": 0.004306205029641728, "phrase": "increased_morbidity"}, {"score": 0.004267896572751978, "phrase": "higher_levels"}, {"score": 0.004229927464182562, "phrase": "caregiver_distress"}, {"score": 0.003505908076430666, "phrase": "large_randomized_controlled_clinical_trial"}, {"score": 0.00303839203670705, "phrase": "cross_validation"}, {"score": 0.002905454531687249, "phrase": "best_structure"}, {"score": 0.0025863375961196005, "phrase": "first_and_second_hidden_layers"}, {"score": 0.0025518429503461736, "phrase": "highest_predictive_accuracy"}, {"score": 0.002291905937251069, "phrase": "anxiety_prediction"}, {"score": 0.002271476019266231, "phrase": "neural_networks"}, {"score": 0.0021049977753042253, "phrase": "early_intervention"}], "paper_keywords": ["Alzheimer's disease", " anxiety", " artificial neural networks", " prediction"], "paper_abstract": "Objective: The anxiety of Alzheimer's disease (AD) contributes significantly to decreased quality of life, increased morbidity, higher levels of caregiver distress, and the decision to institutionalize a patient. However, the incidence of anxiety in AD patients hasn't been discussed. In this study, artificial neural networks were used to predict the incidence of anxiety in AD patients. Methods: A large randomized controlled clinical trial was analyzed in this study, which involved AD patients and caregivers from 6 different sites in the United States. The incidence of anxiety in AD patients was predicted by backpropagation artificial neural networks with one and hidden layers. After cross validation, the Predictive Accuracy (PA) of the models was measured to select the best structure of artificial neural networks. Results: Among all models for predicting the incidence of anxiety in AD patients, the artificial neural network with respectively 6 and 3 neurons in the first and second hidden layers achieved the highest predictive accuracy of 85.56%. Conclusions: The incidence of anxiety in AD patients can be predicted by an accuracy of over 80%. When used for anxiety prediction, neural networks with two hidden layers perform better than those with one hidden layer. These findings will benefit the prevention and early intervention of anxiety in Alzheimer's patients.", "paper_title": "Artificial neural networks allow the prediction of anxiety in Alzheimer's patients", "paper_id": "WOS:000237517700004"}