{"auto_keywords": [{"score": 0.042426215462423846, "phrase": "buyers'_preferences"}, {"score": 0.00481495049065317, "phrase": "multihoming_users'_preferences"}, {"score": 0.004377806391261418, "phrase": "competing_platforms"}, {"score": 0.0038781372962808894, "phrase": "buyers'_perceived_returns"}, {"score": 0.0037299231609021783, "phrase": "impact_buyers'_preferences"}, {"score": 0.003665874747419775, "phrase": "unique_dataset"}, {"score": 0.003177615880037735, "phrase": "low_buying_levels"}, {"score": 0.0029519664912853938, "phrase": "observational_learning"}, {"score": 0.002913837945508097, "phrase": "individual_buyers"}, {"score": 0.0027781870000242004, "phrase": "level_increases"}, {"score": 0.002266051712795851, "phrase": "buyers'_homing_behavior"}, {"score": 0.0021604924928015283, "phrase": "competitive_dynamics"}, {"score": 0.0021049977753042253, "phrase": "suboptimal_strategies"}], "paper_keywords": ["Online platforms", " B2B exchanges", " multihoming", " network effects", " observational learning"], "paper_abstract": "Online business-to-business (B2B) exchanges are proliferating, giving firms numerous platforms from which to choose. Many firms are also multihoming, using competing platforms concurrently. In this study, we examine how selling and buying activities on B2B exchanges affect multihoming buyers' preferences for exchanges. We posit that these activities influence buyers' perceived returns and risks of using the exchanges, and impact buyers' preferences. Using a unique dataset of 118 buyers' participation in two B2B exchanges over seven months, we find that buyers prefer exchanges with more selling activities. However, buyers' preferences and buying levels on the exchanges are non-monotonically related. At low buying levels, an increase in buying by others positively affects buyers' preferences. This effect may result from observational learning, where individual buyers learn from other buyers' behaviors. On the other hand, as buying level increases further on the exchange, competition among buyers also increases. Consequently, buyers lower their preferences for the exchange. In addition, we find that the effects of selling and buying activities on buyers' preferences change over time. Our results highlight the need to correctly model buyers' homing behavior; failing to do so could bias the picture of competitive dynamics between platforms and lead to suboptimal strategies by exchanges.", "paper_title": "MULTIHOMING USERS' PREFERENCES FOR TWO-SIDED EXCHANGE NETWORKS", "paper_id": "WOS:000348600300003"}