{"auto_keywords": [{"score": 0.015719716506582538, "phrase": "wireless_sensor_networks"}, {"score": 0.008972897023062722, "phrase": "previous_schemes"}, {"score": 0.0042250123967577284, "phrase": "error_control_coding"}, {"score": 0.004050514095922329, "phrase": "broadcast_scenario"}, {"score": 0.003982741546775355, "phrase": "byzantine_attacks"}, {"score": 0.003722761107761564, "phrase": "legitimate_packets"}, {"score": 0.0036296886647898094, "phrase": "reliable_and_efficient_multihop_broadcasting"}, {"score": 0.0035091888798162176, "phrase": "energy_consumption"}, {"score": 0.003349984456443527, "phrase": "scarce_network_resources"}, {"score": 0.0033078284621762817, "phrase": "bogus_packets"}, {"score": 0.0030657684627749364, "phrase": "malicious_packets"}, {"score": 0.0029266219967426224, "phrase": "reliable_and_energy_efficient_broadcasting_protocol"}, {"score": 0.0029020077365708966, "phrase": "collaborative_rateless_broadcast"}, {"score": 0.0026445028886931837, "phrase": "byzantine_adversary"}, {"score": 0.0025458479274370832, "phrase": "protocol_exploits"}, {"score": 0.002450864311898833, "phrase": "previously_proposed_broadcast_authentication_schemes"}, {"score": 0.0023296961971785357, "phrase": "data_availability"}, {"score": 0.002280990744438186, "phrase": "crucial_improvement"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Broadcast authentication", " Security", " Reliability", " Sensor networks"], "paper_abstract": "Reliability and security of broadcasting is critical in Wireless Sensor Networks (WSNs). Since reliability and security compete for the same resources, we are interested in jointly solving for error control coding (to achieve reliability) and integrity for a broadcast scenario. We assume Byzantine attacks in which the adversary can compromise nodes and then drop (or modify) the legitimate packets or inject its own packets. For reliable and efficient multihop broadcasting, it is critical to reduce the energy consumption and latency. To prevent the adversary from consuming the scarce network resources by injecting bogus packets, each receiver node should make sure that packets it receives are authentic and it filters out malicious packets immediately. We build our authentication scheme, on top of a reliable and energy efficient broadcasting protocol called Collaborative Rateless Broadcast (CRBcast) to improve efficiency and reliability. On contrary to the previous schemes, our scheme is resilient with respect to Byzantine adversary as well as routing and flooding attacks and protocol exploits. Moreover, we compared our scheme with the previously proposed broadcast authentication schemes and showed that our scheme outperforms them in terms of efficiency and data availability. This is a crucial improvement over the previous schemes that ensure availability by flooding, introducing very large communication overhead and latency. (C) 2012 Elsevier B.V. All rights reserved.", "paper_title": "A secure broadcasting scheme to provide availability, reliability and authentication for wireless sensor networks", "paper_id": "WOS:000307209600009"}