{"auto_keywords": [{"score": 0.048186916426953524, "phrase": "cation-pi_interactions"}, {"score": 0.008829518573679028, "phrase": "protein-rna_interfaces"}, {"score": 0.00806829228484608, "phrase": "lys"}, {"score": 0.008014469284836923, "phrase": "arg"}, {"score": 0.006986136517248956, "phrase": "multiple_cation-pi_interactions"}, {"score": 0.00481495049065317, "phrase": "high_resolution_protein-rna_complex_crystal_structures"}, {"score": 0.00415333528095237, "phrase": "aromatic_chains"}, {"score": 0.00398916666053909, "phrase": "total_interactions"}, {"score": 0.0037297918570822876, "phrase": "single_interactions"}, {"score": 0.003558294449586273, "phrase": "average_distance"}, {"score": 0.003510754567808717, "phrase": "distinct_ranges"}, {"score": 0.003293442130869165, "phrase": "g-arg_pair"}, {"score": 0.003260377175139591, "phrase": "strongest_interaction_energy"}, {"score": 0.0030380052848799155, "phrase": "five-membered_rings"}, {"score": 0.002907992115184249, "phrase": "six-membered_rings"}, {"score": 0.002878785759716458, "phrase": "stabilizing_residues"}, {"score": 0.0028023242231187363, "phrase": "nucleic_bases"}, {"score": 0.0027463101082160915, "phrase": "structural_motifs"}, {"score": 0.0022668507535947976, "phrase": "solvent_exposed_surface"}, {"score": 0.0021844290159501313, "phrase": "structure-based_prediction"}, {"score": 0.0021479597698614355, "phrase": "future_protein-rna_complex_design"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Cation-pi interactions", " Proteins", " RNA", " Interfaces", " Stabilization centers"], "paper_abstract": "In this work, we have analyzed the influence of cation-pi interactions to the stability of 59 high resolution protein-RNA complex crystal structures. The total number of Lys and Arg are similar in the dataset as well as the number of their interactions. On the other hand, the aromatic chains of purines are exhibiting more cation-pi interactions than pyrimidines. 35% of the total interactions in the dataset are involved in the formation of multiple cation-pi interactions. The multiple cation-pi interactions have been conserved more than the single interactions. The analysis of the geometry of the cation-pi interactions has revealed that the average distance (d) value falls into distinct ranges corresponding to the multiple (4.28 angstrom) and single (5.50 angstrom) cation-pi interactions. The G-Arg pair has the strongest interaction energy of -3.68 kcal mol(-1) among all the possible pairs of amino acids and bases. Further, we found that the cation-pi interactions due to five-membered rings of A and G are stronger than that with the atoms in six-membered rings. 8.7% stabilizing residues are involved in building cation-pi interactions with the nucleic bases. There are three types of structural motifs significantly over-represented in protein-RNA interfaces: beta-turn-ir, niche-4r and st-staple. Tetraloops and kink-turns are the most abundant RNA motifs in protein-RNA interfaces. Amino acids deployed in the protein-RNA interfaces are deposited in helices, sheets and coils. Arg and Lys, involved in cation-pi interactions, prefer to be in the solvent exposed surface. The results from this study might be used for structure-based prediction and as scaffolds for future protein-RNA complex design. (C) 2013 Elsevier Ltd. All rights reserved.", "paper_title": "Cation-pi interactions in high resolution protein-RNA complex crystal structures", "paper_id": "WOS:000329270700015"}