{"auto_keywords": [{"score": 0.04811155058749382, "phrase": "small_turing_machines"}, {"score": 0.00481495049065317, "phrase": "time_complexity_slowdown"}, {"score": 0.004408976280483648, "phrase": "experimental_investigation"}, {"score": 0.00426344619171077, "phrase": "computational_complexity"}, {"score": 0.004157446556371582, "phrase": "exhaustive_exploration_and_systematic_study"}, {"score": 0.0038066979615349822, "phrase": "particular_attention"}, {"score": 0.003634901808509402, "phrase": "computed_functions"}, {"score": 0.0035296217979800463, "phrase": "larger_resources"}, {"score": 0.0033844715014920233, "phrase": "average_runtime"}, {"score": 0.0033561632967173856, "phrase": "turing_machines"}, {"score": 0.002885135695263876, "phrase": "time_complexity_classes"}, {"score": 0.0022514836269627186, "phrase": "halting-probability_distribution"}, {"score": 0.002177011650568437, "phrase": "small_initial_segments"}, {"score": 0.0021050052991235494, "phrase": "tm."}], "paper_keywords": ["small Turing machines", " Program-size complexity", " Kolmogorov-Chaitin complexity", " space/time complexity", " computational complexity", " algorithmic complexity"], "paper_abstract": "The aim of this paper is to undertake an experimental investigation of the trade-offs between program-size and time computational complexity. The investigation includes an exhaustive exploration and systematic study of the functions computed by the set of all 2-color Turing machines with 2 states -we will write (2,2)- and 3 states -we write (3,2)- with particular attention to the runtimes, space-usages and patterns corresponding to the computed functions when the machines have access to larger resources (more states). We report that the average runtime of Turing machines computing a function increases -with a probability close to one- with the number of states, indicating that machines not terminating (almost) immediately tend to occupy all the resources at hand. We calculated all time complexity classes to which the algorithms computing the functions found in both (2,2) and (3,2) belong to, and made comparison among these classes. For a selection of functions the comparison is extended to (4,2). Our study revealed various structures in the micro-cosmos of small Turing Machines. Most notably we observed \"phase-transitions\" in the halting-probability distribution. Moreover, it is observed that small initial segments fully define a function computed by a TM.", "paper_title": "Program-size versus Time Complexity Slowdown and Speed-up Phenomena in the Micro-cosmos of Small Turing Machines", "paper_id": "WOS:000299026600004"}