{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "area_method"}, {"score": 0.004620727987405077, "phrase": "different_values"}, {"score": 0.0042204565345581955, "phrase": "normal_distribution"}, {"score": 0.004185827243614116, "phrase": "probability_density"}, {"score": 0.004072426974786948, "phrase": "real_values"}, {"score": 0.003802135020791801, "phrase": "single_variable"}, {"score": 0.0037194747200740568, "phrase": "confidence_interval_c"}, {"score": 0.0034534918227136138, "phrase": "variable_x"}, {"score": 0.0029607341490869655, "phrase": "random_object"}, {"score": 0.002817748867229525, "phrase": "i.e._the_set"}, {"score": 0.0025241800390039828, "phrase": "mathematical_terms"}, {"score": 0.0024221363241985075, "phrase": "confidence_interval"}], "paper_keywords": ["confidence sets", " area method", " random functions"], "paper_abstract": "Due to uncertainty, in many problems, we only know the probability of different values. In such situations, we need to make decisions based on these probabilities: e.g. we must tell the user which values are possible and which are not. Often e.g. for a normal distribution - the probability density is everywhere positive, so, theoretically, all real values are possible. In practice, it is usually safe to assume that values whose probability is very small are not possible. For a single variable, this idea is described by a confidence interval C, the interval for which the probability to be outside is smaller than a given threshold p(0). In this way, if we know that a variable x is normally distributed with mean a and standard deviation sigma, we can conclude that x is within the interval C = [a - 2 k . sigma, a + k . sigma], where k depends on p(0) (usually, k = 2, 3, or 6). When a random object is a function f(x), we similarly want to find a confidence set C of functions, i.e. the set for which the probability to be outside is smaller than p(0). To find such a set, it is possible to use the following area method: they define the area I(f) under the graph of f (i.e. in mathematical terms, an integral I(0)(f) = integral f (x)dx), select a confidence interval for I(0)(f), and take, as C, the set of all the functions f(x) for which I(0)(f) is within this interval. At present, the area method is largely heuristic, with no justification explaining why exactly the integral functional I(f) corresponding to the area should be used. In our paper, we provide a justification for the area method.", "paper_title": "How to define a confidence set for functions: a new justification of the area method", "paper_id": "WOS:000294109200003"}