{"auto_keywords": [{"score": 0.04262684978582361, "phrase": "logical_sentences"}, {"score": 0.038142355861206, "phrase": "consistent_set"}, {"score": 0.03692204774997179, "phrase": "probabilistic_entailment_problem"}, {"score": 0.028964411436954378, "phrase": "probability_intervals"}, {"score": 0.00481495049065317, "phrase": "anytime_deduction_algorithm"}, {"score": 0.004746065479362881, "phrase": "probabilistic_logic"}, {"score": 0.004545240514015278, "phrase": "probabilistic_reasoning"}, {"score": 0.00429057323623293, "phrase": "first_one"}, {"score": 0.0033737457695128233, "phrase": "possible_values"}, {"score": 0.0032777653153451265, "phrase": "additional_sentences"}, {"score": 0.0030642636185693054, "phrase": "general_approach"}, {"score": 0.0030058503645435455, "phrase": "anytime_deduction_method"}, {"score": 0.0027965187255008647, "phrase": "probabilistic_logic_problem"}, {"score": 0.00247944491239733, "phrase": "increasingly_narrow_probability_intervals"}, {"score": 0.00236289633510808, "phrase": "tightest_entailed_probability_interval"}, {"score": 0.002251813863195168, "phrase": "proposed_anytime_deduction_method"}, {"score": 0.0021356322417874106, "phrase": "psatcol"}, {"score": 0.0021049977753042253, "phrase": "column_generation_techniques"}], "paper_keywords": [""], "paper_abstract": "We study two basic problems of probabilistic reasoning: the probabilistic logic and the probabilistic entailment problems. The first one can be defined as follows. Given a set of logical sentences and probabilities that these sentences are true, the aim is to determine whether these probabilities are consistent or not. Given a consistent set of logical sentences and probabilities, the probabilistic entailment problem consists in determining the range of the possible values of the probability associated with additional sentences while maintaining a consistent set of sentences and probabilities. This paper proposes a general approach based on an anytime deduction method that allows the follow-up of the reasoning when checking consistency for the probabilistic logic problem or when determining the probability intervals for the probabilistic entailment problem. Considering a series of subsets of sentences and probabilities, the approach proceeds by computing increasingly narrow probability intervals that either show a contradiction or that contain the tightest entailed probability interval. Computational experience have been conducted to compare the proposed anytime deduction method, called AD-PSAT with an exact one, PSATCOL, using column generation techniques, both with respect to the range of the probability intervals and the computing times. (c) 2008 Elsevier Inc. All rights reserved.", "paper_title": "An anytime deduction algorithm for the probabilistic logic and entailment problems", "paper_id": "WOS:000263805600009"}