{"auto_keywords": [{"score": 0.04367410472844428, "phrase": "chosen_path"}, {"score": 0.03980713684810354, "phrase": "decision_maker"}, {"score": 0.010612387000973441, "phrase": "partial_monitoring"}, {"score": 0.004770295517830214, "phrase": "on-line_shortest_path_problem"}, {"score": 0.004610058444728656, "phrase": "weighted_directed_acyclic_graph"}, {"score": 0.0038857823149452487, "phrase": "multi-armed_bandit_problem"}, {"score": 0.0034742854447532678, "phrase": "best_path"}, {"score": 0.003388909415044492, "phrase": "entire_sequence"}, {"score": 0.003357435261066107, "phrase": "edge_weights"}, {"score": 0.00281184118901173, "phrase": "so-called_label"}, {"score": 0.0024519545383399773, "phrase": "time-varying_path"}, {"score": 0.0023767948946074547, "phrase": "best_expert"}, {"score": 0.0023328069356960204, "phrase": "multi-armed_bandit"}, {"score": 0.00231111848128734, "phrase": "shortest_path"}, {"score": 0.0021987994275190314, "phrase": "individual_edges"}, {"score": 0.0021049977753042253, "phrase": "simulation_results"}], "paper_keywords": ["on-line learning", " shortest path problem", " multi-armed bandit problem"], "paper_abstract": "The on-line shortest path problem is considered under various models of partial monitoring. Given a weighted directed acyclic graph whose edge weights can change in an arbitrary (adversarial) way, a decision maker has to choose in each round of a game a path between two distinguished vertices such that the loss of the chosen path ( defined as the sum of the weights of its composing edges) be as small as possible. In a setting generalizing the multi-armed bandit problem, after choosing a path, the decision maker learns only the weights of those edges that belong to the chosen path. For this problem, an algorithm is given whose average cumulative loss in n rounds exceeds that of the best path, matched off-line to the entire sequence of the edge weights, by a quantity that is proportional to 1/root n and depends only polynomially on the number of edges of the graph. The algorithm can be implemented with complexity that is linear in the number of rounds n (i.e., the average complexity per round is constant) and in the number of edges. An extension to the so-called label efficient setting is also given, in which the decision maker is informed about the weights of the edges corresponding to the chosen path at a total of m << n time instances. Another extension is shown where the decision maker competes against a time-varying path, a generalization of the problem of tracking the best expert. A version of the multi-armed bandit setting for shortest path is also discussed where the decision maker learns only the total weight of the chosen path but not the weights of the individual edges on the path. Applications to routing in packet switched networks along with simulation results are also presented.", "paper_title": "The on-line shortest path problem under partial monitoring", "paper_id": "WOS:000252744800006"}