{"auto_keywords": [{"score": 0.03348059261442033, "phrase": "camelis"}, {"score": 0.00481495049065317, "phrase": "digital_cameras"}, {"score": 0.004520132822496416, "phrase": "overwhelming_flood"}, {"score": 0.004061584718427419, "phrase": "existing_systems"}, {"score": 0.003964007795174772, "phrase": "query_boxes"}, {"score": 0.0037942165191367366, "phrase": "rigid_navigation_structures"}, {"score": 0.003278878522165818, "phrase": "customised_criteria"}, {"score": 0.0028333356794133053, "phrase": "logical_information_systems"}, {"score": 0.002751751956416832, "phrase": "logical_concept_analysis"}, {"score": 0.0026466064623118105, "phrase": "expressive_language"}, {"score": 0.002436289099444074, "phrase": "automatic_annotations"}, {"score": 0.002125612498781805, "phrase": "real_collection"}], "paper_keywords": ["document collection", " annotation", " browsing", " information retrieval", " formal concept analysis", " logical information systems"], "paper_abstract": "Since the arrival of digital cameras, many people are faced with the challenge of organising and browsing the overwhelming flood of photos their life produces. The same is true for all sorts of documents, e.g. emails, audio files. Existing systems either let users fill query boxes without any assistance, or drive them through rigid navigation structures (e.g. hierarchies); or they do not let users put annotations on their documents, even when this would support the organisation and retrieval of any documents on customised criteria. We present a tool, Camelis, that offers users an organisation that is dynamically computed from documents and their annotations. Camelis is designed along the lines of logical information systems, which are founded on logical concept analysis. Hence, (1) an expressive language can be used to describe photos and query the collection, (2) manual and automatic annotations can be smoothly integrated, and (3) expressive querying and flexible navigation can be mixed in a same search and in any order. This presentation is illustrated on a real collection of more than 5000 photos.", "paper_title": "Camelis: a logical information system to organise and browse a collection of documents", "paper_id": "WOS:000265295900003"}