{"auto_keywords": [{"score": 0.04854498731652113, "phrase": "molecular_shape"}, {"score": 0.004493045859210086, "phrase": "molecular_shapes"}, {"score": 0.004384623928442369, "phrase": "biological_system"}, {"score": 0.003817655499320344, "phrase": "hard_sphere_model"}, {"score": 0.003695237613399466, "phrase": "van_der_waals_surface"}, {"score": 0.0035189057079817285, "phrase": "offset_surface"}, {"score": 0.003490343299449249, "phrase": "lee-richards"}, {"score": 0.003310236836421397, "phrase": "molecular_biology"}, {"score": 0.0032040376301815544, "phrase": "important_observations"}, {"score": 0.002581324549141829, "phrase": "worst_case"}, {"score": 0.002350152413458658, "phrase": "recently_announced_theory"}, {"score": 0.0021837406983565098, "phrase": "voronoi_diagram"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["van der Waals surface", " Molecular surface", " Solvent-accessible surface", " Solvent-excluded surface", " Voronoi diagram of spheres", " Quasi-triangulation", " beta-shape", " beta-complex", " Manifoldization"], "paper_abstract": "As the molecular shape determines the functions of a molecule, understanding molecular shapes is important for understanding the biological system of life and thus for designing drugs. To properly define a molecular shape, the definition and computation of the boundary or the surface of a molecule is the most fundamental information. Assuming the hard sphere model of atoms in a molecule, the van der Waals surface, the molecular surface (Connolly surface), and the offset surface (Lee-Richards surface) are the most common surfaces defined on a molecule in biochemistry and molecular biology. In this paper, we present important observations related to the topologies of the three types of surface on molecules and their relationships. We find that the topologies of all three surface types can be computed in O(m) time, and that the topology of one surface can be transformed to the topology of another in O(m) time, both in the worst case, where m represents the number of simplexes on the boundary of a beta-shape. The observations are made based on the recently announced theory of the beta-shape, which can be efficiently computed from the quasi-triangulation, the dual of the Voronoi diagram of a molecule. (C) 2010 Elsevier Ltd. All rights reserved.", "paper_title": "Topologies of surfaces on molecules and their computation in O(n) time", "paper_id": "WOS:000280508100005"}