{"auto_keywords": [{"score": 0.04466009285312219, "phrase": "quality_performance"}, {"score": 0.007259523584997544, "phrase": "competitive_advantage"}, {"score": 0.0071254155443087495, "phrase": "leadership_practice"}, {"score": 0.00481495049065317, "phrase": "purpose_-_the_purpose"}, {"score": 0.0046382670208947605, "phrase": "information_technology"}, {"score": 0.00430402915573404, "phrase": "firm_strategy"}, {"score": 0.004161553532799662, "phrase": "resource-based_view"}, {"score": 0.003964007795174772, "phrase": "moderating_effect"}, {"score": 0.0037336520904376687, "phrase": "survey_data"}, {"score": 0.003637112258469488, "phrase": "multiple_regression_analysis"}, {"score": 0.003583067515485422, "phrase": "spss_package"}, {"score": 0.003516635512391528, "phrase": "main_findings"}, {"score": 0.003362163770566293, "phrase": "partial_impact"}, {"score": 0.0028728747019026485, "phrase": "practical_implications"}, {"score": 0.00250103550267459, "phrase": "greater_depth"}, {"score": 0.00244543519230361, "phrase": "quality_management"}, {"score": 0.002364338228716365, "phrase": "first_papers"}], "paper_keywords": ["Spain", " Information technology", " Competences", " Communication technologies", " Leadership", " Quality performance", " IT business value"], "paper_abstract": "Purpose - The purpose of this paper is to analyze the impact of information technology (IT) competence composed of IT infrastructure, IT technical and managerial knowledge and the integration of IT strategy with firm strategy on quality performance. Since, according to the resource-based view, IT alone is not able to sustain a competitive advantage, the moderating effect of leadership practice on this relationship must be analyzed. Design/methodology/approach - A proposed research model is tested using survey data from a sample of 230 leading Spanish firms. Multiple regression analysis was performed with SPSS package. Findings - The main findings show that: the existence of an IT competence will have a partial impact on improvement in quality performance; IT technical knowledge in itself does not influence the determination of improvement in quality performance rather, one needs complementarity with leadership; and the impact of IT dimensions on quality performance will be greater in the presence of leadership practice. Practical implications - Managers must be aware that the impact of IT on competitive advantage need not be direct; it can have influence through complementarity with other organizational capabilities. Originality/value - The paper reinforces the need to explore in greater depth the relationship between IT and quality management. This appears to be one of the first papers to simultaneously explore relationships between IT, leadership and quality performance. The paper provides insights on the processes by which IT resources interact with other organizational resources, a topic that has received little attention to date.", "paper_title": "Information technology-enabled quality performance: an exploratory study", "paper_id": "WOS:000305369400008"}