{"auto_keywords": [{"score": 0.0478198994409236, "phrase": "related_experiments"}, {"score": 0.03581684513613855, "phrase": "distributed_program"}, {"score": 0.03563773041847503, "phrase": "test_data"}, {"score": 0.03164224156620579, "phrase": "inertial_confinement_fusion"}, {"score": 0.02988574329440844, "phrase": "radiation_transfer"}, {"score": 0.00481495049065317, "phrase": "two-dimensional_radiation_hydrodynamics"}, {"score": 0.004781846782962339, "phrase": "radiation_hydrodynamics"}, {"score": 0.004651681736083763, "phrase": "indirectly_driven_inertial_confinement_energy"}, {"score": 0.00457212573833658, "phrase": "intense_radiation_pulses"}, {"score": 0.004517243818906159, "phrase": "high-z_target_configurations"}, {"score": 0.004341493558027359, "phrase": "diffusion_description"}, {"score": 0.004281972676976225, "phrase": "new_numerical_code"}, {"score": 0.004158175057088786, "phrase": "radiation_transport"}, {"score": 0.0040449177694679515, "phrase": "non-structured_mesh"}, {"score": 0.004024026622121257, "phrase": "trilateral_and_quadrilateral_elements"}, {"score": 0.0038540611958825855, "phrase": "viewing_angles"}, {"score": 0.0037815602257483577, "phrase": "sharply_edged_beams"}, {"score": 0.0037685249623977007, "phrase": "ray_tracing"}, {"score": 0.0037168300253883403, "phrase": "lateral_diffusion"}, {"score": 0.0035988865684354805, "phrase": "program"}, {"score": 0.0035109517424630043, "phrase": "cpc_program_library"}, {"score": 0.003498846006548426, "phrase": "queen's_university"}, {"score": 0.0034867823836335888, "phrase": "belfast"}, {"score": 0.0034747591761174917, "phrase": "n._ireland"}, {"score": 0.003450837590535413, "phrase": "standard_cpc"}, {"score": 0.002959051985190709, "phrase": "particle_beams"}, {"score": 0.0029488435643382467, "phrase": "energy_transport"}, {"score": 0.0029386702576722377, "phrase": "thermal_radiation"}, {"score": 0.0028933217059035968, "phrase": "radiation_field"}, {"score": 0.002868430273439936, "phrase": "hydrodynamic_motion"}, {"score": 0.0028585335917139807, "phrase": "emission_and_absorption_processes"}, {"score": 0.00280470733784858, "phrase": "lagrangian_hydrodynamics"}, {"score": 0.002795029897243468, "phrase": "heat_diffusion"}, {"score": 0.0027329331012178734, "phrase": "two-dimensional_axial-symmetric_geometry"}, {"score": 0.002690750846752179, "phrase": "fractional_step_scheme"}, {"score": 0.0026629907077474276, "phrase": "angular_resolution"}, {"score": 0.0026538009488511444, "phrase": "matter_properties"}, {"score": 0.0025725035067724537, "phrase": "user_routines"}, {"score": 0.002502327039435597, "phrase": "typical_conditions"}, {"score": 0.0024006268160020653, "phrase": "design_range"}, {"score": 0.002392340281222092, "phrase": "special_care"}, {"score": 0.0023676514977237877, "phrase": "special_computer_language"}, {"score": 0.002335128072403681, "phrase": "top_levels"}, {"score": 0.00227141232872107, "phrase": "translation_program"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Inertial confinement", " Radiative transfer", " Lagrangian hydrodynamics", " Plasma physics"], "paper_abstract": "Simulation of radiation hydrodynamics in two spatial dimensions is developed, having in mind, in particular, target design for indirectly driven inertial confinement energy (IFE) and the interpretation of related experiments. Intense radiation pulses by laser or particle beams heat high-Z target configurations of different geometries and lead to a regime which is optically thick in some regions and optically thin in others. A diffusion description is inadequate in this situation. A new numerical code has been developed which describes hydrodynamics in two spatial dimensions (cylindrical R-Z geometry) and radiation transport along rays in three dimensions with the 4 pi solid angle discretized in direction. Matter moves on a non-structured mesh composed of trilateral and quadrilateral elements. Radiation flux of a given direction enters on two (one) sides of a triangle and leaves on the opposite side(s) in proportion to the viewing angles depending on the geometry. This scheme allows to propagate sharply edged beams without ray tracing, though at the price of some lateral diffusion. The algorithm treats correctly both the optically thin and optically thick regimes. A symmetric semi-implicit (SSI) method is used to guarantee numerical stability. Program summary Program title: MULTI2D Catalogue identifier: AECV_v1_0 Program summary URL: http://cpc.cs.qub.ac.uk/summaries/AECV_v1_0.html Program obtainable from: CPC Program Library. Queen's University, Belfast, N. Ireland Licensing provisions: Standard CPC licence, http://cpc.cs.qub.ac.uk/licence/licence.html No. of lines in distributed program, including test data, etc.: 151098 No. of bytes in distributed program, including test data, etc.: 889 622 Distribution format: tar.gz Programming language: C Computer: PC (32 bits architecture) Operating system: Linux/Unix RAM: 2 Mbytes Word size: 32 bits Classification: 19.7 External routines: X-window standard library (libX11.so) and corresponding heading files (X11/*.h) are required. Nature of problem: In inertial confinement fusion and related experiments with lasers and particle beams, energy transport by thermal radiation becomes important. Under these conditions, the radiation field strongly interacts with the hydrodynamic motion through emission and absorption processes. Solution method: The equations of radiation transfer coupled with Lagrangian hydrodynamics, heat diffusion and beam tracing (laser or ions) are solved, in two-dimensional axial-symmetric geometry (R-Z coordinates) using a fractional step scheme. Radiation transfer is solved with angular resolution. Matter properties are either interpolated from tables (equations-of-state and opacities) or Computed by user routines (conductivities and beans attenuation). Restrictions: The code has been designed for typical conditions prevailing in inertial confinement fusion (ns time scale, matter states close to local thermodynamical equilibrium, negligible radiation pressure. ...). Although a wider range of situations can be treated, extrapolations to regions beyond this design range need special care. Unusual features: A special computer language, called r94, is used at top levels of the code. These parts have to be converted to standard C by a translation program (supplied as part of the package). Due to the complexity of code (hydro-code, grid generation, user interface, graphic post-processor, translator program, installation scripts) extensive manuals are supplied as part of the package. Running time: 567 seconds for the example supplied. (C) 2008 Elsevier B.V. All rights reserved.", "paper_title": "MULTI2D-a computer code for two-dimensional radiation hydrodynamics", "paper_id": "WOS:000266660400018"}