{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "reader_performance"}, {"score": 0.01314811662953423, "phrase": "anatomical_priors"}, {"score": 0.005481147769606328, "phrase": "observer_performance"}, {"score": 0.005326080621805876, "phrase": "lesion_boundaries"}, {"score": 0.004741069733530936, "phrase": "spect_reconstruction"}, {"score": 0.00470975295439431, "phrase": "increasing_availability"}, {"score": 0.004688989566904871, "phrase": "multimodality_imaging_systems"}, {"score": 0.004556230694068238, "phrase": "emission_tomography_studies"}, {"score": 0.0044863018460183784, "phrase": "lesion_detection_task"}, {"score": 0.004359256515279245, "phrase": "prior_anatomical_knowledge"}, {"score": 0.0043208932141752384, "phrase": "spect"}, {"score": 0.004079581272142216, "phrase": "spect_projection_data"}, {"score": 0.003974000034438474, "phrase": "map"}, {"score": 0.0037925389501636975, "phrase": "prior_knowledge"}, {"score": 0.003685067218455088, "phrase": "organ_boundaries"}, {"score": 0.0034637853352986045, "phrase": "map_reconstructions"}, {"score": 0.00342568771304873, "phrase": "anatomical_regions"}, {"score": 0.0033805214040814233, "phrase": "provided_region_boundaries"}, {"score": 0.003358161300929604, "phrase": "reconstructed_images"}, {"score": 0.0033285769573812873, "phrase": "human_observers"}, {"score": 0.0032846867944492293, "phrase": "localization_receiver_operating_characteristic"}, {"score": 0.0032128146827881563, "phrase": "reconstruction_algorithms"}, {"score": 0.0031774686451753477, "phrase": "lroc_curve"}, {"score": 0.003046653161676849, "phrase": "different_prior_strengths"}, {"score": 0.0030198047915993777, "phrase": "optimal_trade-off"}, {"score": 0.002691509482993781, "phrase": "organ_and_lesion_boundaries"}, {"score": 0.0026036031415940563, "phrase": "statistically_significant_improvement"}, {"score": 0.002552239981400316, "phrase": "optimal_prior_strength"}, {"score": 0.0025185606244323587, "phrase": "anatomical_knowledge"}, {"score": 0.0024963543716522087, "phrase": "broad_plateau"}, {"score": 0.0023776656246300063, "phrase": "observer's_performance"}, {"score": 0.0022496114364599328, "phrase": "pseudo-lesion_boundaries"}, {"score": 0.0021331586055770447, "phrase": "prior_strength"}, {"score": 0.0021049977753042253, "phrase": "organ-only_case"}], "paper_keywords": ["Anatomical priors", " localization receiver operating characteristic (LROC)", " reader performance", " SPECT image reconstruction"], "paper_abstract": "With increasing availability of multimodality imaging systems, high-resolution anatomical images can be used to guide the reconstruction of emission tomography studies. By measuring reader performance on a lesion detection task, this study investigates the improvement in image-quality due to use of prior anatomical knowledge, for example organ or lesion boundaries, during SPECT reconstruction. Simulated (67)Ga-citrate source and attenuation distributions were created from the mathematical cardiac-torso (MCAT) anthropomorphic digital phantom. The SIMIND Monte Carlo software was then used to generate SPECT projection data. The data were reconstructed using the De Pierro maximum a posteriori (MAP) algorithm and the resealed-block-iterative (RBI) algorithm for comparison. We compared several degrees of prior knowledge about the anatomy: no knowledge about the anatomy; knowledge of organ boundaries; knowledge of organ and lesion boundaries; and knowledge of organ, lesion, and pseudo-lesion (non-emission uptake altering) boundaries. e MAP reconstructions used quadratic smoothing within anatomical regions, but not across any provided region boundaries. The reconstructed images were read by human observers searching for lesions in a localization receiver operating characteristic (LROC) study of the relative detection/localization accuracies of the reconstruction algorithms. Area under the LROC curve was computed for each algorithm as the comparison metric. We also had humans read images reconstructed using different prior strengths to determine the optimal trade-off between data consistency and the anatomical prior. Finally by mixing together images reconstructed with and without the prior, we tested to see if having an anatomical prior only some of the time changes the observer's detection/localization accuracy on lesions where no boundary prior is available. We found that anatomical priors including organ and lesion boundaries improve observer performance on the lesion detection/localization task. Use of just organ boundaries did not provide a statistically significant improvement in performance however. We also found that optimal prior strength depends on the level of anatomical knowledge, with a broad plateau in which observer performance is near optimal. We found no evidence that having anatomical priors use lesion boundaries only when available changes the observer's performance when they are not available. We conclude that use of anatomical priors with organ and lesion boundaries improves reader performance on a lesion-detection/localization task, and that pseudo-lesion boundaries do not hurt reader performance. However, we did not find evidence that a prior using only organ boundaries helps observer performance. Therefore we suggest prior strength should be tuned to the organ-only case, since a prior will likely not be available for all lesions.", "paper_title": "Impact on Reader Performance for Lesion-Detection/Localization Tasks of Anatomical Priors in SPECT Reconstruction", "paper_id": "WOS:000269525300011"}