{"auto_keywords": [{"score": 0.04780597585803098, "phrase": "driving_abilities"}, {"score": 0.045044510120429315, "phrase": "mental_workload"}, {"score": 0.04070629305155005, "phrase": "driving_school"}, {"score": 0.00481495049065317, "phrase": "fixed-base_simulator"}, {"score": 0.004357116231871565, "phrase": "new_indicators"}, {"score": 0.00427550604912774, "phrase": "psychological_feeling"}, {"score": 0.004007083686875716, "phrase": "real_vehicle"}, {"score": 0.00378602209193448, "phrase": "particular_sort"}, {"score": 0.0037656130751127182, "phrase": "real-world_driving"}, {"score": 0.003434961725919714, "phrase": "fourteen_expert_drivers"}, {"score": 0.0032629585038738856, "phrase": "questionnaire_of_psychological_feeling"}, {"score": 0.0031502454951157863, "phrase": "school_vehicle"}, {"score": 0.0030828215204304473, "phrase": "heart_rate"}, {"score": 0.0029763124376934787, "phrase": "driving_conditions"}, {"score": 0.0028043588777213533, "phrase": "real_car"}, {"score": 0.0024694784565650945, "phrase": "virtual_environments"}, {"score": 0.0024231382864800173, "phrase": "objective_value"}, {"score": 0.0023905702405714146, "phrase": "real_world"}, {"score": 0.002333044307949414, "phrase": "affective_feeling"}, {"score": 0.0022830706430588482, "phrase": "useful_tool"}, {"score": 0.002264607102799332, "phrase": "initial_resumption"}, {"score": 0.0021049977753042253, "phrase": "task_failure"}], "paper_keywords": [""], "paper_abstract": "The use of driving simulators to assess driving abilities is often controversial because of their artificiality. Our aim is thus to tackle this question by estimating and comparing new indicators such as the mental workload, the psychological feeling (e.g., stress, anxiety, pleasure, and mastery), and feeling of presence when driving a simulator and a real vehicle (either one's own or one that belongs to a driving school). We are most interested in a particular sort of real-world driving: the driving school. This situation has two advantages: It matches our own particular interest in the evaluation of driving abilities and, to some extent, it is as artificial as driving in a simulator. Fourteen expert drivers participated in this study. Each driver was invited to complete two questionnaires (i.e., the NASA-TLX and Questionnaire of Psychological Feeling) that relate to the various driving conditions (i.e., simulator, driving school vehicle, and personal vehicle). The heart rate of drivers was also recorded at rest and during some of the driving conditions. Our results indicate that the feeling of presence was, for some of its component parts, identical in both the simulator and in a real car. Moreover, in both the simulator and real car, none of the assessments of presence revealed values that were close to 100%; indeed, sometimes they were considerably lower. This result leads us to believe that presence may often be underestimated in virtual environments because of the lack of an objective value of reference in the real world. Moreover, results obtained for mental workload and affective feeling indicate that a simulator can be a useful tool for the initial resumption of driving after a period off the road. In particular, a simulator can help to avoid the sort of stress that can lead to task failure or a deterioration in performance.", "paper_title": "Driving for Real or on a Fixed-Base Simulator: Is It so Different? An Explorative Study", "paper_id": "WOS:000354485200005"}