{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "update_dynamics"}, {"score": 0.004114787982556699, "phrase": "previous_studies"}, {"score": 0.004043541331944951, "phrase": "prisoner's_dilemma_game"}, {"score": 0.0038820411362656803, "phrase": "asynchronous_version"}, {"score": 0.003516079377293321, "phrase": "snowdrift_game"}, {"score": 0.0031845067058084583, "phrase": "different_types"}, {"score": 0.003093054709625219, "phrase": "different_levels"}, {"score": 0.002952146666681891, "phrase": "next_strategy"}, {"score": 0.0026892447164623247, "phrase": "asynchronous_dynamics"}, {"score": 0.002435453488008121, "phrase": "small_changes"}, {"score": 0.0023932142697579506, "phrase": "synchrony_rate"}, {"score": 0.002231441081806766, "phrase": "better_understanding"}], "paper_keywords": ["evolution of cooperation", " spacial evolutionary games", " update dynamics", " asynchronism"], "paper_abstract": "We investigate the influence of the update dynamics on the evolution of cooperation. Three of the most studied games in this area are used: Prisoner's Dilemma, Snowdrift and the Stag Hunt. Previous studies with the Prisoner's Dilemma game reported that less cooperators survive with the asynchronous version of the game than with the synchronous one. On the other side, studies with the Snowdrift game are not conclusive about this subject. Based on simulations with these three games, played on different types of networks and using different levels of noise in the choice of the next strategy to be adopted by the agents, we conclude that, in general, an asynchronous dynamics favors the evolution of cooperation. Results concerning the monotonicity of these models and their sensitivity to small changes in the synchrony rate are also reported. This work is a contribution to a better understanding of the conditions under which cooperation can emerge and how different parameters may influence this emergence.", "paper_title": "THE INFLUENCE OF THE UPDATE DYNAMICS ON THE EVOLUTION OF COOPERATION", "paper_id": "WOS:000272257200002"}