{"auto_keywords": [{"score": 0.047844536713056586, "phrase": "users'_cognitive_styles"}, {"score": 0.02027108412275319, "phrase": "web_search_behavior"}, {"score": 0.010612387000973441, "phrase": "users'_web_search_behavior"}, {"score": 0.009334846576019577, "phrase": "cognitive_styles"}, {"score": 0.004678940805063634, "phrase": "previous_studies"}, {"score": 0.004525088883501587, "phrase": "important_role"}, {"score": 0.004482063543727601, "phrase": "web_searching"}, {"score": 0.0034625012596827334, "phrase": "qualitative_and_quantitative_analyses"}, {"score": 0.0032382660477699695, "phrase": "participants'_demographic_information"}, {"score": 0.003057630557886893, "phrase": "csa"}, {"score": 0.002661474607275484, "phrase": "user_model"}, {"score": 0.0025737890313763407, "phrase": "fundamental_relationships"}, {"score": 0.0024301229420875155, "phrase": "greater_understanding"}, {"score": 0.0023613185213421173, "phrase": "science_researchers"}, {"score": 0.0023388183537341213, "phrase": "information_systems_designers"}, {"score": 0.0022944576894161485, "phrase": "semantic_gap"}, {"score": 0.0021049977753042253, "phrase": "future_work"}], "paper_keywords": [""], "paper_abstract": "Previous studies have shown that users' cognitive styles play an important role during web searching. However, only a limited number of studies have showed the relationship between cognitive styles and web search behavior. Most importantly, it is not clear which components of web search behavior are influenced by cognitive styles. This article examines the relationships between users' cognitive styles and their web searching and develops a model that portrays the relationship. The study uses qualitative and quantitative analyses based on data gathered from 50 participants. A questionnaire was utilized to collect participants' demographic information, and Riding's (1991) Cognitive Styles Analysis (CSA) test to assess their cognitive styles. Results show that users' cognitive styles influenced their information-searching strategies, query reformulation behavior, web navigational styles, and information-processing approaches. The user model developed in this study depicts the fundamental relationships between users' web search behavior and their cognitive styles. Modeling web search behavior with a greater understanding of users' cognitive styles can help information science researchers and information systems designers to bridge the semantic gap between the user and the systems. Implications of the research for theory and practice, and future work, are discussed.", "paper_title": "Modeling Users' Web Search Behavior and Their Cognitive Styles", "paper_id": "WOS:000335583900002"}