{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "current_functions"}, {"score": 0.0046394362688524475, "phrase": "perennial_question"}, {"score": 0.004169519409162853, "phrase": "comparative_distribution"}, {"score": 0.003943481134959376, "phrase": "\"adaptive_value"}, {"score": 0.003543804852018315, "phrase": "different_lineages"}, {"score": 0.0031550351923674337, "phrase": "functional_value"}, {"score": 0.0031113369425402287, "phrase": "novel_functions"}, {"score": 0.0029288446848334576, "phrase": "utilitarian_purposes"}, {"score": 0.0024658019116387845, "phrase": "likely_diverse_distribution"}, {"score": 0.0023210846870653757, "phrase": "empirical_literature"}], "paper_keywords": ["Play behavior", " development", " evolution", " mathematical models", " origins", " functions"], "paper_abstract": "Why animals play has been a perennial question, but most of the thinking about this has been framed in terms of its fitness benefits. A review of our present knowledge about the comparative distribution of play suggests that such an approach that leads to claims that the \"adaptive value of play is'' are misplaced. Play is relatively rare in the Animal Kingdom, indicating that it arose multiple times and that different lineages that have evolved play have transformed it in both divergent and convergent ways. Moreover, some forms of play, especially in its earliest appearance, may have no functional value, with novel functions emerging later as play has been co-opted and transformed for utilitarian purposes. Thus, when it comes to modeling play, care must be taken to differentiate between attempts to explain the origins of play from its current functions, and when current functions are considered, then their variety and likely diverse distribution need be taken into account. Attention to these nuances in the empirical literature, and so developing more targeted models, will provide more focused theoretical developments that can, in turn, stimulate more precise empirical tests. Examples of such models are presented in this issue of the journal.", "paper_title": "Modeling play: distinguishing between origins and current functions", "paper_id": "WOS:000366508200002"}