{"auto_keywords": [{"score": 0.004165105357908494, "phrase": "large_orientation_maneuvers"}, {"score": 0.00393032656248792, "phrase": "unwinding_phenomena"}, {"score": 0.0037087324991876727, "phrase": "undesirable_features"}, {"score": 0.0036553070575015344, "phrase": "spacecraft_attitude_control"}, {"score": 0.0035507457285983268, "phrase": "simple_notion"}, {"score": 0.0029400959763737364, "phrase": "attitude_spacecraft_orientation"}, {"score": 0.0027341763737751467, "phrase": "new_attitude_control"}, {"score": 0.0025611773887867255, "phrase": "conventional_quaternion_based_method"}, {"score": 0.0023990982005125763, "phrase": "proposed_intermediate_variable"}, {"score": 0.0023303871145705954, "phrase": "bounded_angular_velocity"}, {"score": 0.0021049977753042253, "phrase": "attractive_features"}], "paper_keywords": ["Intermediate quaternion", " Attitude tracking", " Unwinding free"], "paper_abstract": "Euler-angle based and conventional quaternion based methods have been extensively employed for spacecraft attitude control. However, the first method suffers from singularity that prohibits large orientation maneuvers, while the second exhibits ambiguity and unwinding phenomena. This work attempts to circumvent these undesirable features in spacecraft attitude control by introducing a simple notion of an intermediate 4-element variable (quaternion) that possesses several beneficial features, among which is the fact that it can be determined uniquely and readily for any attitude spacecraft orientation. This attribute allows for the development of a new attitude control free of ambiguity and unwinding associated with the conventional quaternion based method. Furthermore, since the rate of the proposed intermediate variable is bounded with bounded angular velocity, singularity inherent in the Euler-angle based method is avoided here. These attractive features are theoretically authenticated and numerically verified.", "paper_title": "NEW INTERMEDIATE QUATERNION BASED CONTROL OF SPACECRAFT: PART I - ALMOST GLOBAL ATTITUDE TRACKING", "paper_id": "WOS:000310118400021"}