{"auto_keywords": [{"score": 0.04790995341030915, "phrase": "students'_reading_processes"}, {"score": 0.03707633276877944, "phrase": "multiple_strategies"}, {"score": 0.015600126366242346, "phrase": "college_remedial_reading_instruction"}, {"score": 0.004722898398399427, "phrase": "face-to-face_instruction"}, {"score": 0.00468656988857138, "phrase": "reciprocal_teaching"}, {"score": 0.004271729935895193, "phrase": "students'_learning_difficulties"}, {"score": 0.003954109842050071, "phrase": "online_reciprocal_teaching"}, {"score": 0.0036178264212372497, "phrase": "remedial_reading_program"}, {"score": 0.0032718761046588835, "phrase": "dialogue_box"}, {"score": 0.003246672441842787, "phrase": "chat_room"}, {"score": 0.0032216622984027558, "phrase": "discussion_forum"}, {"score": 0.0031845067058084583, "phrase": "annotation_tool"}, {"score": 0.0025643086619242814, "phrase": "students'_reading_progress"}, {"score": 0.0025347150832077175, "phrase": "remedial_instruction"}, {"score": 0.0025054621733192283, "phrase": "rt_system"}, {"score": 0.002205079358459154, "phrase": "comprehension_questions"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Reciprocal teaching (RT)", " Reading strategy", " Reading process", " Collaborative learning", " Remedial reading instruction"], "paper_abstract": "In face-to-face instruction of Reciprocal Teaching (RT), students' reading processes and dialogues with their peers are hardly observed. As a result, the teacher has few clues to identify students' learning difficulties and provide further scaffoldings. To record students' reading processes and enhance their comprehension, this study reports on the design of an online reciprocal teaching and learning system to support teachers and students in college remedial reading instruction. A sample of 129 under-prepared college students voluntarily signed up to participate in a remedial reading program. They were encouraged to use multiple strategies such as predicting, clarifying, questioning, and summarizing, which were supported by the functionalities of dialogue box, chat room, discussion forum, and annotation tool in the system. In this study, it was observed that students employed the multiple strategies to enhance their reading comprehension, as revealed by the students' reading processes recorded in the system. When encountering difficulties in using these multiple strategies, students expressed that they observed and learned from the teacher's or their peers' externalization of strategy usage. Students' reading progress in the remedial instruction incorporating the RT system was also identified by the pre- and post-tests. This study suggests that there may be benefits for teachers in encouraging students to interact with others in order to clarify and discuss comprehension questions and constantly monitor and regulate their own reading. (C) 2010 Elsevier Ltd. All rights reserved.", "paper_title": "Developing a reciprocal teaching/learning system for college remedial reading instruction", "paper_id": "WOS:000280985600026"}