{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "serbia"}, {"score": 0.007768012710343724, "phrase": "world_science"}, {"score": 0.00447115003744675, "phrase": "bibliometric_analysis"}, {"score": 0.004081385289516914, "phrase": "thomson_reuters_sci-expanded_database"}, {"score": 0.0037042817107563785, "phrase": "collaboration_patterns"}, {"score": 0.003559284776569813, "phrase": "analyzed_articles"}, {"score": 0.0032487508969192293, "phrase": "sci-expanded"}, {"score": 0.0031037644581516973, "phrase": "serbian_articles"}, {"score": 0.0028653893877383188, "phrase": "sci-expanded._researchers"}, {"score": 0.0026604207233593973, "phrase": "significant_impact"}, {"score": 0.002527150892127982, "phrase": "account_number"}, {"score": 0.0021049977753042253, "phrase": "first_and_corresponding_authors"}], "paper_keywords": ["Serbia", " Web of Science", " Research trends", " Collaborations", " Impact"], "paper_abstract": "This paper presents a bibliometric analysis of articles from the Republic of Serbia in the period 2006-2013 that are indexed in the Thomson Reuters SCI-EXPANDED database. Analysis included 27,157 articles with at least one author from Serbia. Number of publications and its characteristics, collaboration patterns, as well as impact of analyzed articles in world science will be discussed in the paper. The number of articles indexed by SCI-EXPANDED has seen an increase in terms of Serbian articles that is considerably greater than the increase in number of all articles in SCI-EXPANDED. Researchers from Serbia have been involved in researches presented in several articles which have significant impact in world science. Beside indicators which take into account number of publications of certain type and number of citations, the analysis presented in this paper also takes authorship into consideration. The most cited analyzed articles have more than ten authors, but there were no first and corresponding authors from Serbia in these articles.", "paper_title": "Publications from Serbia in the Science Citation Index Expanded: a bibliometric analysis", "paper_id": "WOS:000361992800010"}