{"auto_keywords": [{"score": 0.04794019415315168, "phrase": "healthcare_professionals"}, {"score": 0.010612387000973441, "phrase": "mobile_health"}, {"score": 0.005680821223811174, "phrase": "future_research"}, {"score": 0.004561950666122737, "phrase": "application_developers"}, {"score": 0.004524220016675624, "phrase": "network_service_providers"}, {"score": 0.004322186889256224, "phrase": "mobile_phone"}, {"score": 0.004198323646273642, "phrase": "wireless_networks"}, {"score": 0.004112020122418323, "phrase": "mobile_devices"}, {"score": 0.004061088450663783, "phrase": "numerous_healthcare_services"}, {"score": 0.003928321515373316, "phrase": "emergency_care"}, {"score": 0.003768426876815755, "phrase": "independent_living"}, {"score": 0.003630073540438812, "phrase": "major_advances"}, {"score": 0.0035113478590679133, "phrase": "decision_making"}, {"score": 0.003424850089214916, "phrase": "chronic_conditions"}, {"score": 0.003340475943517995, "phrase": "suitable_healthcare"}, {"score": 0.003177892611195514, "phrase": "major_research_challenges"}, {"score": 0.0026354246446771324, "phrase": "high-level_and_preliminary_solutions"}, {"score": 0.002259346051668556, "phrase": "future_mobile_health_services"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Mobile health", " Information technologies", " Decision making", " Emergencies", " Applications"], "paper_abstract": "Mobile health has been receiving a lot of attention from patients, healthcare professionals, application developers, network service providers and researchers. Mobile health is more than just some healthcare applications on a mobile phone and it can involve sensors and wireless networks in monitoring various conditions, mobile devices to access numerous healthcare services, healthcare professionals to make decisions and provide emergency care, and for the elderly to manage their daily activities in independent living. More specifically, m-health can result in major advances in (a) expanding healthcare coverage, (b) improving decision making, (c) managing chronic conditions and (d) providing suitable healthcare in emergencies. To help realize these advances, there are major research challenges that need to be addressed. We classify these challenges in four categories of (a) patients related, (b) healthcare professionals related, (c) IT related and (d) applications related challenges. Within each category, we identify several research problems, and we present some high-level and preliminary solutions along with an agenda for future research. The paper may provide a platform for future research and decision-making related to patients, healthcare professionals, applications, and infrastructure. These decisions will significantly impact how future mobile health services will be designed, developed, evaluated, and adopted globally. (C) 2014 Elsevier B.V. All rights reserved.", "paper_title": "Mobile health: Four emerging themes of research", "paper_id": "WOS:000344204800003"}