{"auto_keywords": [{"score": 0.04927872927155836, "phrase": "power_consumption"}, {"score": 0.009808216995596912, "phrase": "software_change"}, {"score": 0.005458788350624132, "phrase": "software_metrics"}, {"score": 0.004519908617935935, "phrase": "increased_popularity"}, {"score": 0.004278807087784626, "phrase": "customer's_battery-life"}, {"score": 0.004189523950071494, "phrase": "software_developer"}, {"score": 0.004033464035028803, "phrase": "next_change"}, {"score": 0.0038668462001710314, "phrase": "customer's_battery"}, {"score": 0.0037543106253910313, "phrase": "power_consumption_regressions"}, {"score": 0.0036914757355166966, "phrase": "power_usage"}, {"score": 0.003117986133774198, "phrase": "expensive_testing"}, {"score": 0.0030399874838260886, "phrase": "general_methodology"}, {"score": 0.0028654728453890426, "phrase": "software_changes"}, {"score": 0.002770273247998903, "phrase": "oo_software_metrics"}, {"score": 0.0025892330566358503, "phrase": "firefox_web-browser"}, {"score": 0.002482126086922683, "phrase": "potential_relationship"}, {"score": 0.0021049977753042253, "phrase": "initial_investigation"}], "paper_keywords": ["Power", " Power consumption", " Mining software repositories", " Dynamic analysis", " Energy consumption", " Sustainable-software", " Software metrics"], "paper_abstract": "Power consumption is becoming more and more important with the increased popularity of smart-phones, tablets and laptops. The threat of reducing a customer's battery-life now hangs over the software developer, who now asks, \"will this next change be the one that causes my software to drain a customer's battery?\" One solution is to detect power consumption regressions by measuring the power usage of tests, but this is time-consuming and often noisy. An alternative is to rely on software metrics that allow us to estimate the impact that a change might have on power consumption thus relieving the developer from expensive testing. This paper presents a general methodology for investigating the impact of software change on power consumption, we relate power consumption to software changes, and then investigate the impact of OO software metrics and churn metrics on power consumption. We demonstrated that software change can effect power consumption using the Firefox web-browser and the Azureus/Vuze BitTorrent client. We found evidence of a potential relationship between some software metrics and power consumption. We also investigate the effect of library versioning on the power consumption of rTorrent. In conclusion, we investigate the effect of software change on power consumption on two projects; and we provide an initial investigation on the impact of software metrics on power consumption.", "paper_title": "Green mining: a methodology of relating software change and configuration to power consumption", "paper_id": "WOS:000353824000004"}