{"auto_keywords": [{"score": 0.004581807162841004, "phrase": "information_technology_environments"}, {"score": 0.004449949342789427, "phrase": "business_objectives"}, {"score": 0.0042220541146047825, "phrase": "recent_surveys"}, {"score": 0.004052869371697375, "phrase": "top_challenge"}, {"score": 0.004029257743984891, "phrase": "management_priority"}, {"score": 0.003970826351364956, "phrase": "double_challenge"}, {"score": 0.0038228246616188156, "phrase": "top_management's_expectations"}, {"score": 0.0035327654197058345, "phrase": "function's_strategic_mission"}, {"score": 0.003332143532820153, "phrase": "central_and_growing_subject"}, {"score": 0.0032837882028183287, "phrase": "information_systems_field"}, {"score": 0.0032456080226031417, "phrase": "extant_literature"}, {"score": 0.002947043609853674, "phrase": "new_theory"}, {"score": 0.0027152983329730173, "phrase": "ideal_profiles"}, {"score": 0.0026915726427162705, "phrase": "field_study"}, {"score": 0.0025987195907507393, "phrase": "research_propositions"}, {"score": 0.0025385994743190796, "phrase": "five_distinct_\"ideal\"_it_management_profiles"}, {"score": 0.0024510106746176326, "phrase": "specific_sources"}, {"score": 0.00227809753597453, "phrase": "hybrid_profiles"}, {"score": 0.0022319010540230847, "phrase": "compelling_explanation"}, {"score": 0.002123563931605599, "phrase": "theoretical_and_practical_implications"}, {"score": 0.0021049977753042253, "phrase": "proposed_theory"}], "paper_keywords": ["IT function", " IT management profile", " IT contribution", " CIO", " theory building", " typological theory", " field study"], "paper_abstract": "Because changes in organizations and information technology environments are enduring, the alignment of the IT function with business objectives must not only be understood, but constantly renewed and adjusted. This is amply reflected in recent surveys of CIOs, which consistently suggest that the notion of alignment is a top challenge and management priority. Many CIOs face a double challenge when addressing the issue of alignment: they must first clarify, top management's expectations and assumptions about IT, which may be contradictory, and then understand their implications for how the IT department should be managed (i.e., translate the function's strategic mission into an IT management model that adds value to the organization). The characterization of the IT function has constituted a central and growing subject of research in the information systems field. Although the extant literature has much to teach us, knowledge in this area is nevertheless fragmented and has not been properly integrated. In response to these limitations, this study proposes and tests a new theory of the contribution of the IT/function. Specifically, our objective is to offer an explanation of the contribution of the IT function in organizations with a typology of ideal profiles. A field study was conducted in 24 large Canadian companies in order to validate a set of research propositions. Our results first suggest that there are five distinct \"ideal\" IT management profiles in organizations and each of these profiles tends to focus on specific sources of value. Next, we observed that IT functions that are close to the ideal of any given profile seem to be outperforming those with hybrid profiles. Finally, our findings provide a compelling explanation as to how ideal IT management profiles are adopted in organizations. The article concludes with a discussion of the theoretical and practical implications of the proposed theory.", "paper_title": "TOWARD A NEW THEORY OF THE CONTRIBUTION OF THE IT FUNCTION IN ORGANIZATIONS", "paper_id": "WOS:000304296400010"}