{"auto_keywords": [{"score": 0.02294075502652149, "phrase": "wikipedia"}, {"score": 0.00481495049065317, "phrase": "reuters_news"}, {"score": 0.004518442937844318, "phrase": "social_network"}, {"score": 0.004285289574869884, "phrase": "news_articles"}, {"score": 0.004173244935967375, "phrase": "reuters_newswire"}, {"score": 0.003559675269411366, "phrase": "power-law_degree_distribution"}, {"score": 0.0034118234596993836, "phrase": "component_size_distribution"}, {"score": 0.003375826910838081, "phrase": "power-law_characteristics"}, {"score": 0.003270092550315648, "phrase": "degree-reduced_network"}, {"score": 0.0031676593724896075, "phrase": "edge-reduced_network"}, {"score": 0.0030521898646210413, "phrase": "star_topology"}, {"score": 0.0027303606813078255, "phrase": "better_judgment"}, {"score": 0.0025348408238837655, "phrase": "ranking_algorithms"}, {"score": 0.0024947959375982614, "phrase": "citation_count"}], "paper_keywords": ["social networks", " importance of people", " ranking", " Wikipedia"], "paper_abstract": "Networks describe various complex natural systems including social systems. We investigate the social network of co-occurrence in Reuters-21578 corpus, which consists of news articles that appeared in the Reuters newswire in 1987. People are represented as vertices and two persons are connected if they co-occur in the same article. The network has small-world features with power-law degree distribution. The network is disconnected and the component size distribution has power-law characteristics. Community detection on a degree-reduced network provides meaningful communities. An edge-reduced network, which contains only the strong ties has a star topology. \"Importance\" of persons are investigated. The network is the situation in 1987. After 20 years, a better judgment on the importance of the people can be done. A number of ranking algorithms, including Citation count and PageRank, are used to assign ranks to vertices. The ranks given by the algorithms are compared against how well a person is represented in Wikipedia. We find up to medium level Spearman's rank correlations. A noteworthy finding is that PageRank consistently", "paper_title": "Co-occurrence network of reuters news", "paper_id": "WOS:000257761400002"}