{"auto_keywords": [{"score": 0.04881318091486501, "phrase": "mas"}, {"score": 0.00481495049065317, "phrase": "normative_multi-agent_systems"}, {"score": 0.00458412183693466, "phrase": "participating_agents"}, {"score": 0.004502943680955863, "phrase": "system-level_rules"}, {"score": 0.004287008195370748, "phrase": "interesting_challenge"}, {"score": 0.0037658881407605445, "phrase": "norm_architecture"}, {"score": 0.0036335821512795026, "phrase": "multiagent_system"}, {"score": 0.0032203158828810244, "phrase": "normative_multiagent_system"}, {"score": 0.003177392642813126, "phrase": "overlay_architecture"}, {"score": 0.0030520148188164084, "phrase": "normative_knowledge"}, {"score": 0.002971182100871581, "phrase": "explicit_representation"}, {"score": 0.002918483026678636, "phrase": "conditional_rules"}, {"score": 0.0026806139086152365, "phrase": "agent_action"}, {"score": 0.0025404470150468387, "phrase": "wide_generality"}, {"score": 0.002418393046947528, "phrase": "agent_roles"}], "paper_keywords": [""], "paper_abstract": "Open multiagent systems (MAS) typically require the participating agents to comply with system-level rules, or norms, and may punish non-compliance. An interesting challenge for designers of such systems is how to provide for dynamic, run-time allocation of norms. In this article, we present a novel, framework-independent approach enabling a norm architecture to be overlaid on any type of multiagent system. We achieve this by defining rights, responsibilities and sanctions in a manner which allows for their run-time assignment and re-assignment to agents in a normative multiagent system. The overlay architecture we propose requires the system to include a normative knowledge (KB) base containing explicit representation of norms as conditional rules, where the preconditions for instantiation of a norm are various run-time occurrences, such as the execution of some agent action, or the occurrence of some event. Our method has both wide generality and flexibility, allowing at one extreme few or no agent roles, each role having many conditional norms, or allowing, at the other extreme, many roles, each having only a small number of conditional norms, or allowing, indeed, any position between these two extremes.", "paper_title": "Dynamic assignment of roles, rights and responsibilities in normative multi-agent systems", "paper_id": "WOS:000316964800004"}