{"auto_keywords": [{"score": 0.04818691642695348, "phrase": "rheumatic_diseases"}, {"score": 0.004776297980616768, "phrase": "selected_inflammatory_rheumatic_diseases"}, {"score": 0.004477992162329249, "phrase": "prominent_place"}, {"score": 0.0041144374213500715, "phrase": "functional_clinical_database"}, {"score": 0.004032302251481604, "phrase": "essential_condition"}, {"score": 0.0039677715255034595, "phrase": "necessary_epidemiological_and_other_information"}, {"score": 0.0038263136898042285, "phrase": "institute_of_rheumatology"}, {"score": 0.003765067028482197, "phrase": "euromise"}, {"score": 0.0036898803847106023, "phrase": "selected_systemic_inflammatory_rheumatic_diseases"}, {"score": 0.003587125711973247, "phrase": "dna._aims"}, {"score": 0.003501322813520807, "phrase": "pilot_research"}, {"score": 0.003417565253539315, "phrase": "relevant_and_time_borders"}, {"score": 0.0032428780373184207, "phrase": "-economic_data"}, {"score": 0.0032038465090068646, "phrase": "representative_sample"}, {"score": 0.003152531962718477, "phrase": "systemic_lupus_erythematosus"}, {"score": 0.0031271827534050493, "phrase": "systemic_sclerosis"}, {"score": 0.002524688179363081, "phrase": "simple_common_data_structure"}, {"score": 0.0024742098091226203, "phrase": "monitored_diseases"}, {"score": 0.002395530243993313, "phrase": "preset_number"}, {"score": 0.002227508035618043, "phrase": "czech_republic"}, {"score": 0.0022006705963260433, "phrase": "first_acquired_information_inclusive_comparison"}, {"score": 0.0021829826698453827, "phrase": "german"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ireland_ltd."}], "paper_keywords": ["World Health Organisation", " rheumatic diseases", " register"], "paper_abstract": "According to the World Health Organisation, rheumatic diseases are likely to go on occupying a prominent place worldwide. As to US statistics, rheumatic diseases are currently the most frequent chronic disorders and leading cause of disability. The development of functional clinical database or rheumatic diseases represents an essential condition how to acquire necessary epidemiological and other information on disorders under study. In 1999-2003, Institute of Rheumatology in cooperation with EuroMISE have developed clinical database/national register of selected systemic inflammatory rheumatic diseases inclusive of bank of sera and DNA. Aims of this phase of the pilot research have been formulated into following relevant and time borders: to gather clinical, laboratory, genetic but also pharmaco-and socio-economic data in a representative sample of patients with systemic lupus erythematosus, systemic sclerosis, polymyositis/dermatomyositis, mixed connective tissue disease; rheumatoid arthritis, juvenile chronic arthritis, ankylosing spondylitis, psoriatic arthritis and reactive arthritis. The data about patients entering the register are differentiated according to the disease of the patient. However, many diseases have several data in common. Therefore, a simple common data structure for examination of all monitored diseases was chosen. In 2002, the preset number of over 2000 registered patients had been achieved with collaboration of 34 territorial and 20 institutional rheumatotogists in the whole covering the majority of the Czech Republic. Some first acquired information inclusive comparison with German database is demonstrated. (c) 2005 Elsevier Ireland Ltd. All rights reserved.", "paper_title": "Some principles of the development of a clinical database/national register of selected inflammatory rheumatic diseases in the Czech Republic", "paper_id": "WOS:000236360500006"}