{"auto_keywords": [{"score": 0.02322730111336098, "phrase": "mutual_information"}, {"score": 0.021495845176809088, "phrase": "cancer_subtypes"}, {"score": 0.010416110136274874, "phrase": "multi-class_cancer"}, {"score": 0.010109513022540501, "phrase": "microarray_data"}, {"score": 0.009105129990638682, "phrase": "selected_key_genes"}, {"score": 0.006403651452891, "phrase": "key_genes"}, {"score": 0.004620093797504386, "phrase": "mirocarray_technology"}, {"score": 0.004301834610818624, "phrase": "complicated_problem"}, {"score": 0.004269630481719451, "phrase": "accurate_diagnosis"}, {"score": 0.0040508247605225214, "phrase": "promising_approach"}, {"score": 0.003975416846030462, "phrase": "microarray_technology"}, {"score": 0.003886770770835211, "phrase": "non-redundant_but_relevant_genes"}, {"score": 0.0038144050983900286, "phrase": "selected_genes"}, {"score": 0.003673675864705682, "phrase": "regular_laboratories"}, {"score": 0.003578255090799811, "phrase": "cancer-specific_regulatory_pathways"}, {"score": 0.003511613254403125, "phrase": "traditional_gene_selection_methods"}, {"score": 0.003356675879109443, "phrase": "present_paper"}, {"score": 0.0033190180867511605, "phrase": "novel_gene_selection_algorithm"}, {"score": 0.0028661330049356186, "phrase": "class_distinction"}, {"score": 0.0028021527740710508, "phrase": "breast_cancer_data"}, {"score": 0.0027602925235474317, "phrase": "present_algorithm"}, {"score": 0.0025124343366192954, "phrase": "breast_cancer"}, {"score": 0.00223570488212345, "phrase": "high_quality"}, {"score": 0.0021775526153883355, "phrase": "present_work"}, {"score": 0.0021049977753042253, "phrase": "different_cancer_subtypes"}], "paper_keywords": [""], "paper_abstract": "With the development of mirocarray technology, microarray data are widely used in the diagnoses of cancer subtypes. However, people are still facing the complicated problem of accurate diagnosis of cancer subtypes. Building classifiers based on the selected key genes from microarray data is a promising approach for the development of microarray technology; yet the selection of non-redundant but relevant genes is complicated. The selected genes should be small enough to allow diagnosis even in regular laboratories and ideally identify genes involved in cancer-specific regulatory pathways. Instead of the traditional gene selection methods used for the classification of two categories of cancers, in the present paper, a novel gene selection algorithm based on mutual information is proposed for the classification of multi-class cancer using microarray data, and the selected key genes are fed into the classifier to classify the cancer subtypes. In our algorithm, mutual information is employed to select key genes related with class distinction. The application on the breast cancer data suggests that the present algorithm can identify the key genes to the BRCA1 mutations/BRCA2 mutations/the sporadic mutations class distinction since the result of our proposed algorithm is promising,. because our method can perform the classification of the three types of breast cancer effectively and efficiently. And two more microarray datasets, leukemia and ovarian cancer data, are also employed to validate the performance of our method. The performances of these applications demonstrate the high quality of our method. Based on the present work, our method can be widely used to discriminate different cancer subtypes, which will contribute to the development of technology for the recovery of the cancer.", "paper_title": "Gene selection based on mutual information for the classification of multi-class cancer", "paper_id": "WOS:000240085400049"}