{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "social_network_analysis"}, {"score": 0.04769632635828977, "phrase": "web_site_structure"}, {"score": 0.03206540298866141, "phrase": "institutional_web_sites"}, {"score": 0.0047823219739028325, "phrase": "purpose_-_web_sites"}, {"score": 0.004289215825521407, "phrase": "main_profiles"}, {"score": 0.004260134699483774, "phrase": "web_sites'_organizational_structure"}, {"score": 0.0038862297330905836, "phrase": "root_domain"}, {"score": 0.003743439610143464, "phrase": "domain_network"}, {"score": 0.0036553070575015344, "phrase": "page_network"}, {"score": 0.003438058620195309, "phrase": "factor_analysis"}, {"score": 0.003403122817578447, "phrase": "statistical_methodology"}, {"score": 0.003345680943026579, "phrase": "main_web_site_profiles"}, {"score": 0.0031899334050985175, "phrase": "web_site_design_styles"}, {"score": 0.003157510936118389, "phrase": "general_guidelines"}, {"score": 0.002949598537993663, "phrase": "practical_implications"}, {"score": 0.002850819170139645, "phrase": "effective_web_presence"}, {"score": 0.0026359661683151006, "phrase": "different_countries"}, {"score": 0.0024372660612788184, "phrase": "internal_web_sites_structure"}, {"score": 0.0023000698178350415, "phrase": "previous_research"}, {"score": 0.002222994077182071, "phrase": "internal_structure"}, {"score": 0.0021049977753042253, "phrase": "web_sites"}], "paper_keywords": ["Web sites", " Web site design", " Inter-computer links", " Social networking", " Factor analysis", " Spain"], "paper_abstract": "Purpose - Web sites are typically designed attending to a variety of criteria. However, web site structure determines browsing behavior and way-finding results. The aim of this study is to identify the main profiles of web sites' organizational structure by modeling them as graphs and considering several social network analysis features. Design/methodology/approach - A case study based on 80 institutional Spanish universities' web sites has been used for this purpose. For each root domain, two different networks have been considered: the first is the domain network, and the second is the page network. In both cases, several indicators related to social network analysis have been evaluated to characterize the web site structure. Factor analysis provides the statistical methodology to adequately extract the main web site profiles in terms of their internal structure. Findings - This paper allows the categorization of web site design styles and provides general guidelines to assist designers to better identify areas for creating and improving institutional web sites. The findings of this study offer practical implications to web site designers for creating and maintaining an effective web presence, and for improving usability. Research limitations/implications - The research is limited to 80 institutional Spanish universities' web sites. Other institutional university web sites from different countries can be analyzed, and the conclusions could be compared or enlarged. Originality/value - This paper highlights the importance of the internal web sites structure, and their implications on usability and way-finding results. As a difference to previous research, the paper is focused on the comparison of internal structure of institutional web sites, rather than analyzing the web as a whole or the interrelations among web sites.", "paper_title": "Web site structure mining using social network analysis", "paper_id": "WOS:000291632400001"}