{"auto_keywords": [{"score": 0.05007205726856348, "phrase": "epileptic_oscillations"}, {"score": 0.04858132305104682, "phrase": "ge"}, {"score": 0.0419912152934181, "phrase": "pathological_oscillations"}, {"score": 0.015339043303839475, "phrase": "grammatical_evolution"}, {"score": 0.013336839205226369, "phrase": "epileptic_seizures"}, {"score": 0.0047810714349158165, "phrase": "clinical_intracranial_electroencephalograms"}, {"score": 0.004439354841093929, "phrase": "clinical_intracranial_electroencephalogram"}, {"score": 0.004285289574869884, "phrase": "clinical_ieeg"}, {"score": 0.00422516469733364, "phrase": "preoperative_evaluations"}, {"score": 0.003603989174919527, "phrase": "surgical_treatment"}, {"score": 0.003503497128638099, "phrase": "critically_diseased_brain"}, {"score": 0.003162063361646493, "phrase": "epileptic_events"}, {"score": 0.0031397776924946526, "phrase": "average_activity"}, {"score": 0.0030847461428168614, "phrase": "visual_review"}, {"score": 0.0029150253706493852, "phrase": "automated_algorithm"}, {"score": 0.002548331088496964, "phrase": "epileptic_gamma"}, {"score": 0.0024772013657695896, "phrase": "normal_activity"}, {"score": 0.0024597305738431226, "phrase": "forward_sequential_feature-selection"}, {"score": 0.0024423826953133844, "phrase": "backward_sequential_feature-selection"}, {"score": 0.0023325586335885104, "phrase": "grammatically_evolved_feature"}, {"score": 0.0022434880661725493, "phrase": "previous_detector"}, {"score": 0.002219790619936024, "phrase": "genetically_programmed_feature"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Grammatical evolution", " Detector", " Epileptic oscillations", " Intracranial EEG"], "paper_abstract": "This paper presents grammatical evolution (GE) as an approach to select and combine features for detecting epileptic oscillations within clinical intracranial electroencephalogram (iEEG) recordings of patients with epilepsy. Clinical iEEG is used in preoperative evaluations of a patient who may have surgery to treat epileptic seizures. Literature suggests that pathological oscillations may indicate the region(s) of brain that cause epileptic seizures, which could be surgically removed for therapy. If this presumption is true, then the effectiveness of surgical treatment could depend on the effectiveness in pinpointing critically diseased brain, which in turn depends on the most accurate detection of pathological oscillations. Moreover, the accuracy of detecting pathological oscillations depends greatly on the selected feature(s) that must objectively distinguish epileptic events from average activity, a task that visual review is inevitably too subjective and insufficient to resolve. Consequently, this work suggests an automated algorithm that incorporates grammatical evolution (GE) to construct the most sufficient feature(s) to detect epileptic oscillations within the iEEG of a patient. We estimate the performance of GE relative to three alternative methods of selecting or combining features that distinguish an epileptic gamma (similar to 65-95 Hz) oscillation from normal activity: forward sequential feature-selection, backward sequential feature-selection, and genetic programming. We demonstrate that a detector with a grammatically evolved feature exhibits a sensitivity and selectivity that is comparable to a previous detector with a genetically programmed feature, making GE a useful alternative to designing detectors. (C) 2011 Elsevier Ltd. All rights reserved.", "paper_title": "Grammatical evolution for features of epileptic oscillations in clinical intracranial electroencephalograms", "paper_id": "WOS:000290237500106"}