{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "rfid"}, {"score": 0.00458940888106061, "phrase": "outbound_logistics"}, {"score": 0.004191690483929023, "phrase": "different_kinds"}, {"score": 0.003629392214109574, "phrase": "loading_bay"}, {"score": 0.003571751184289622, "phrase": "unbearably_long_time"}, {"score": 0.0031930184711888867, "phrase": "loading_schedules"}, {"score": 0.002994859407965545, "phrase": "radio-frequency_identification"}, {"score": 0.0028391271282216758, "phrase": "traditional_strategies"}, {"score": 0.0027643161113894018, "phrase": "case_study"}, {"score": 0.002720376476146181, "phrase": "giant_printing_and_paper_bag_manufacturer"}, {"score": 0.002317533977770783, "phrase": "tardy_performance_trucks"}, {"score": 0.002220551141101661, "phrase": "different_performances"}, {"score": 0.0021735890994119757, "phrase": "different_criteria"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Simulation", " RFID", " Loading strategies", " Outbound logistics"], "paper_abstract": "Loading of trucks in a plant can be a problem when different kinds of products are to be loaded on the same truck, but these goods are not ready. Therefore, the truck has to wait at the loading bay for an unbearably long time, blocking other trucks also in the process. In this paper we address this problem and present several alternative strategies for drawing loading schedules in such situations, using information on status of products obtained with radio-frequency identification (RFID) technology, and compare their performance with traditional strategies, without RFID. A case study on a giant printing and paper bag manufacturer is conducted. Simulation models under these strategies are built for comparisons with respect to three performance measures: average operating time in system, throughput of trucks and percentage of tardy performance trucks. Results demonstrate that these strategies have different performances with respect to different criteria. (C) 2011 Elsevier Ltd. All rights reserved.", "paper_title": "A simulation modeling and analysis for RFID-enabled mixed-product loading strategy for outbound logistics: A case study", "paper_id": "WOS:000291458300021"}