{"auto_keywords": [{"score": 0.0047468516620285525, "phrase": "faithful_representation"}, {"score": 0.004701985831087475, "phrase": "real-time_shadow"}, {"score": 0.00452670409375785, "phrase": "modern_video_games"}, {"score": 0.0042354707960660706, "phrase": "three-dimensional_scenes"}, {"score": 0.0038698476651328898, "phrase": "minor_role"}, {"score": 0.0037432199549135826, "phrase": "important_factor"}, {"score": 0.00369022262431101, "phrase": "human_perception"}, {"score": 0.0036553070575015344, "phrase": "three-dimensional_worlds"}, {"score": 0.003371508176308189, "phrase": "important_clues"}, {"score": 0.0031996871318754685, "phrase": "javascript-based_open-source_framework"}, {"score": 0.0027348611289528583, "phrase": "today's_requirements"}, {"score": 0.002570817338292482, "phrase": "existing_shadow_mapping_techniques"}, {"score": 0.002337403139264533, "phrase": "shadow_representation"}, {"score": 0.0021557052355026048, "phrase": "standard_part"}], "paper_keywords": ["Real time shadows", " Web browser", " Virtual reality", " X3DOM", " Generic architecture"], "paper_abstract": "The faithful representation of real-time shadow has become omnipresent in our everyday lives due to modern video games. In the World Wide Web, however, this is different: the representation of three-dimensional scenes in a browser is only a few years old and so far, shadows play at most a minor role. Still, shadows are an important factor in the human perception of three-dimensional worlds, since they increase in general not only the authenticity of a scene, but at the same time provide important clues about where an object is placed in space. The JavaScript-based open-source framework X3DOM plays an essential role in the 3D web development, because it provides an approach for the integration of declarative 3D in HTML5. However, it provides only rudimentary shadow techniques, which are insufficient to today's requirements. In this work, this problem is addressed by first examining existing shadow mapping techniques for their suitability for use in the web. Based on this we provide a concept to improve the shadow representation for X3DOM. We implemented and validated our concept showing the benefit. As a result is now standard part of X3DOM. (C) 2014 Elsevier Ltd. All rights reserved.", "paper_title": "Stable dynamic webshadows in the X3DOM framework", "paper_id": "WOS:000350182600026"}