{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "quantum_logic"}, {"score": 0.004681012408089219, "phrase": "automata_theory"}, {"score": 0.004283739213556286, "phrase": "logical_approach"}, {"score": 0.004249332848326785, "phrase": "quantum_computing"}, {"score": 0.0038885527668812807, "phrase": "basic_framework"}, {"score": 0.0038573081851680656, "phrase": "l-valued_pushdown_automata"}, {"score": 0.0035439655241057207, "phrase": "useful_property"}, {"score": 0.003515479934694842, "phrase": "l-valued_successor"}, {"score": 0.003308986613384597, "phrase": "quantum_finite_automata"}, {"score": 0.0029553380263320195, "phrase": "different_fashions"}, {"score": 0.0026932247685847246, "phrase": "truth-value_set"}, {"score": 0.0025761937402886954, "phrase": "essential_difference"}, {"score": 0.002545165985686468, "phrase": "classical_situation"}, {"score": 0.002357131515622894, "phrase": "empty_stack"}, {"score": 0.002282166507956957, "phrase": "final_state"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["quantum finite automata", " quantum logic", " orthomodular lattices", " finite automata", " pushdown automata", " quantum computation"], "paper_abstract": "Automata theory based on quantum logic, called l-valued finite automata (l-VFAs), may be viewed as a logical approach to quantum computing. This work is mainly divided into two parts: one part deals with reversibility of l-VFAs, and the other establishes a basic framework of l-valued pushdown automata (l-VPDAs). First we provide some preliminaries conceming quantum logic and l-VFAs, and we prove a useful property of l-valued successor and source operators. Then we clarify the relationships between various reversibilities closely related to quantum finite automata in the literature. In particular, we define a reversibility of l-VFAs which is termed as retrievability and we clarify the relationships between a number of different fashions regarding retrievability of l-VFAs. We prove that some of them are equivalent, but for the others to be equivalent the truth-value set is required to satisfy a certain condition. This is an essential difference from the classical situation. Afterwards, we introduce l-VPDAs and show that the class of the languages accepted by l-VPDAs by empty stack coincides with that accepted by l-VPDAs by final state. Finally, we provide some examples of l-VFAs and conclude with some remarks. (c) 2007 Elsevier B.V. All rights reserved.", "paper_title": "Automata theory based on quantum logic: Reversibilities and pushdown automata", "paper_id": "WOS:000250881500003"}