{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "skin_detection"}, {"score": 0.00763179673340603, "phrase": "perceptual_interfaces"}, {"score": 0.006020908402429097, "phrase": "hand_detection"}, {"score": 0.0053947235148249185, "phrase": "illuminance_component"}, {"score": 0.005043404993962527, "phrase": "sct_colorspace"}, {"score": 0.004614362802631256, "phrase": "first_step"}, {"score": 0.004501217435918426, "phrase": "gesture_recognition"}, {"score": 0.004437807397753662, "phrase": "human-computer_interaction"}, {"score": 0.0041780882724537, "phrase": "optimal_method"}, {"score": 0.004018158280364063, "phrase": "novel_method"}, {"score": 0.0038098540814166695, "phrase": "evaluation_framework"}, {"score": 0.003650984439966844, "phrase": "large_dataset"}, {"score": 0.0035236476185949565, "phrase": "parameter_set"}, {"score": 0.003412833120814178, "phrase": "five_colorspace_transformations"}, {"score": 0.003201516237269705, "phrase": "best_performance"}, {"score": 0.0030032443093632125, "phrase": "histogram_approach"}, {"score": 0.002877912855903293, "phrase": "best_colorspaces"}, {"score": 0.002767613012044169, "phrase": "yuv_colorspace"}, {"score": 0.0024789326485851666, "phrase": "ultimate_indicator"}, {"score": 0.002260112998123604, "phrase": "traditional_pixel-level_results"}, {"score": 0.0021503823972534096, "phrase": "evaluation_protocols"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["skin detection", " hand detection", " empirical evaluation"], "paper_abstract": "Skin detection is frequently used as the first step for the tasks of face and gesture recognition in perceptual interfaces for human-computer interaction and communication. Thus, it is important for the researchers using skin detection to choose the optimal method for their specific task. In this paper, we propose a novel method of measuring the performance of skin detection for a task. We have created an evaluation framework for the task of hand detection and executed this assessment using a large dataset containing 17 million pixels from 225 images taken under various conditions. The parameter set of the skin detection has been trained extensively. Five colorspace transformations with and without the illuminance component coupled with two color modeling approaches have been evaluated. The results indicate that the best performance is achieved by transforming to SCT colorspace, using the illuminance component, and modeling the distribution with the histogram approach. Some conclusions such as the SCT colorspace being one of the best colorspaces are consistent with our previous work, while findings such as the YUV colorspace performing well in this work when it was one of the worst in our previous work are different. This indicates that the performance measured at the pixel-level might not be the ultimate indicator for the performance at the task-level of hand detection. We believe that the users of skin detection will find our task-based results to be more relevant than the traditional pixel-level results. However, we acknowledge that an evaluation is limited by its specific dataset and evaluation protocols. (C) 2007 Elsevier Inc. All rights reserved.", "paper_title": "Task-based evaluation of skin detection for communication and perceptual interfaces", "paper_id": "WOS:000251803400003"}