{"auto_keywords": [{"score": 0.047510470298773616, "phrase": "assume-guarantee_reasoning"}, {"score": 0.009612105607093982, "phrase": "monolithic_verification"}, {"score": 0.00481495049065317, "phrase": "automated_assume-guarantee_reasoning"}, {"score": 0.004781915513030716, "phrase": "finite-state_verification_techniques"}, {"score": 0.004684157900507474, "phrase": "state-explosion_problem"}, {"score": 0.003889206369317587, "phrase": "whole_system"}, {"score": 0.0037704502704526996, "phrase": "overall_cost"}, {"score": 0.0032398798149196432, "phrase": "difficult_manual_task"}, {"score": 0.0031193028729331667, "phrase": "recent_advances"}, {"score": 0.002680114113899346, "phrase": "ltsa."}, {"score": 0.0026252106881752067, "phrase": "repeated_tasks"}, {"score": 0.002441734529530325, "phrase": "-guarantee_reasoning"}, {"score": 0.002408265305704217, "phrase": "larger_systems"}, {"score": 0.0021789194955896102, "phrase": "research_directions"}, {"score": 0.0021049977753042253, "phrase": "experimental_evaluation"}], "paper_keywords": ["verification", " experimentation", " assume-guarantee reasoning"], "paper_abstract": "Finite-state verification techniques are often hampered by the state-explosion problem. One proposed approach for addressing this problem is assume-guarantee reasoning, where a system under analysis is partitioned into subsystems and these subsystems are analyzed individually. By composing the results of these analyses, it can be determined whether or not the system satisfies a property. Because each subsystem is smaller than the whole system, analyzing each subsystem individually may reduce the overall cost of verification. Often the behavior of a subsystem is dependent on the subsystems with which it interacts, and thus it is usually necessary to provide assumptions about the environment in which a subsystem executes. Because developing assumptions has been a difficult manual task, the evaluation of assume-guarantee reasoning has been limited. Using recent advances for automatically generating assumptions, we undertook a study to determine if assume-guarantee reasoning provides an advantage over monolithic verification. In this study, we considered all two-way decompositions for a set of systems and properties, using two different verifiers, FLAVERS and LTSA. By increasing the number of repeated tasks in these systems, we evaluated the decompositions as they were scaled. We found that in only a few cases can assume-guarantee reasoning verify properties on larger systems than monolithic verification can, and in these cases the systems that can be analyzed are only a few sizes larger. Although these results are discouraging, they provide insight about research directions that should be pursued and highlight the importance of experimental evaluation in this area.", "paper_title": "Breaking up is hard to do: An evaluation of automated assume-guarantee reasoning", "paper_id": "WOS:000255787800003"}