{"auto_keywords": [{"score": 0.04226255901245674, "phrase": "nand"}, {"score": 0.007414023403533543, "phrase": "cnfet"}, {"score": 0.003802135020791801, "phrase": "preliminary_structure"}, {"score": 0.003424771860049617, "phrase": "new_design"}, {"score": 0.0027282915297520624, "phrase": "comprehensive_simulations"}, {"score": 0.0026307897899760383, "phrase": "operating_frequencies"}, {"score": 0.002548331088496964, "phrase": "synopsys_hspice_tool"}, {"score": 0.002525248554951453, "phrase": "simulation_results"}, {"score": 0.0024797072773840704, "phrase": "proposed_cell"}, {"score": 0.002391067964886602, "phrase": "last_the_robustness"}, {"score": 0.0023372808856170386, "phrase": "diameter_mismatches"}, {"score": 0.0021930134992197087, "phrase": "monte_carlo_transient_analysis"}, {"score": 0.0021049977753042253, "phrase": "manufacturing_process_variations"}], "paper_keywords": ["Carbon nanotube field-effect transistor (CNFET)", " full adder cell", " high-performance", " nanoelectronic", " process fluctuation"], "paper_abstract": "In this paper, three CNT-based full adder designs, called Design1, Design2 and Design3, are proposed. In these designs 12, 14 and 16 transistors are used, respectively. In all designs only 3-input NAND, Majority-not and NOR functions are used. First, a preliminary structure (Design1) is presented using 12 transistors. Then its weaknesses are tackled in two steps. In fact, in each step a new design is presented by adding two more transistors to its predecessor. Therefore two new structures called Design2 and Design3 are built in which Design3 is the most efficient one. To study the performance of Design3 versus other silicon-based and CNT-based 32-nm classical and state-of-the-art cells, comprehensive simulations with regard to various supplies, loads, operating frequencies, and temperatures are performed using Synopsys HSPICE tool. Simulation results confirm that the proposed cell is superior to the other cells. At last the robustness of Design3 against the diameter mismatches of CNTs which is one of the most important concerns of nanoelectronics is studied using Monte Carlo transient analysis. This simulation reveals that Design3 functions very well against manufacturing process variations.", "paper_title": "High-Speed, High-Frequency and Low-PDP, CNFET Full Adder Cells", "paper_id": "WOS:000360413600003"}