{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "higher-order_and_first-order_processes"}, {"score": 0.004318881178805575, "phrase": "critical_but_long_unanswered_questions"}, {"score": 0.004157561334726201, "phrase": "first-order_process_calculi"}, {"score": 0.004090274535243564, "phrase": "basic_and_pivotal_topic"}, {"score": 0.003980531478122155, "phrase": "process_theory"}, {"score": 0.0038527044625533574, "phrase": "mutual_encodability"}, {"score": 0.002855934865505357, "phrase": "basic_higher-order_pi-calculus"}, {"score": 0.0027491084541806823, "phrase": "elementary_operators"}, {"score": 0.0023730978395564116, "phrase": "relabelling_operator"}, {"score": 0.002128067018576581, "phrase": "well-defined_boundary"}, {"score": 0.0021049977753042253, "phrase": "thirdly_an_encoding"}], "paper_keywords": [""], "paper_abstract": "This is a paper on distinguishing and relating two important kinds of calculi through expressiveness, settling some critical but long unanswered questions. The delimitation of higher-order and first-order process calculi is a basic and pivotal topic in the study of process theory. Particularly, expressiveness studies mutual encodability, which helps decide whether process-passing or name-passing is more fundamental, and the way they ought to be used in both theory and practice. In this paper, we contribute to such demarcation with three major results. Firstly (first-order pi-calculus) can faithfully express (basic higher-order pi-calculus). The calculus has the elementary operators (input, output, composition and restriction). This actually is a corollary of a more general result, that can encode ( enriched with the relabelling operator). Secondly cannot interpret reasonably. This is of more significance since it separates and by drawing a well-defined boundary. Thirdly an encoding from to is revisited and discussed, which not only implies how to make more useful but also stresses the importance of name-passing in .", "paper_title": "Distinguishing and relating higher-order and first-order processes by expressiveness", "paper_id": "WOS:000310950300002"}