{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "gear_drives"}, {"score": 0.004672727518631859, "phrase": "finite_element_method"}, {"score": 0.004565007074039171, "phrase": "prevalent_technique"}, {"score": 0.00450456611645112, "phrase": "physical_phenomena"}, {"score": 0.004356926418550194, "phrase": "scientific_papers"}, {"score": 0.003955465362027017, "phrase": "bibliographical_review"}, {"score": 0.003890113384743467, "phrase": "fem"}, {"score": 0.0038642157757169315, "phrase": "mechanical_engineering"}, {"score": 0.003687960013746783, "phrase": "theoretical_as_well_as_practical_points"}, {"score": 0.0034963129868796033, "phrase": "computational_points"}, {"score": 0.002988868585379496, "phrase": "short_text"}, {"score": 0.0029689853349030007, "phrase": "relevant_keywords"}, {"score": 0.0029296136066184857, "phrase": "current_trends"}, {"score": 0.0028907624732186373, "phrase": "finite_element_techniques"}, {"score": 0.0028334469422586304, "phrase": "second_part"}, {"score": 0.002572001496778222, "phrase": "comprehensive_source"}, {"score": 0.00255488432062653, "phrase": "published_papers"}, {"score": 0.0023424328921363585, "phrase": "comprehensive_representation"}, {"score": 0.0023268399760599336, "phrase": "different_finite_element_applications"}, {"score": 0.0022057677637040396, "phrase": "described_subjects"}, {"score": 0.002154795052149279, "phrase": "large_databases"}, {"score": 0.0021049977753042253, "phrase": "uncertain_information_retrieval"}], "paper_keywords": ["finite element analysis", " mechanical engineering", " torque", " motion", " simulation"], "paper_abstract": "Purpose - The finite element method (FEM) has become the prevalent technique used for analyzing physical phenomena in the field of structural, solid and fluid mechanics. The output of scientific papers is fast growing and professionals are no longer able to be fully up-to-date with all the relevant information. The purpose of this paper is to provide a bibliographical review on the application of FEM in mechanical engineering, specifically for the analyses and simulations of gears and gear drives from the theoretical as well as practical points of view. Design/methodology/approach - The following topics on gears and gear drives are handled from the computational points of view: gears in general, spur gears, helical gears, spiral bevel and hypoid gears, worm gears and other gear types and gear drives. The paper is organized into two parts. In the first one each topic is handled in a short text, relevant keywords are presented and current trends in applications of finite element techniques are briefly mentioned. The second part lists references of papers published for the period 1997-2006. Findings - This bibliography is intended to serve the needs of engineers and researchers as a comprehensive source of published papers on design, analysis and simulation of gears and gear drives. Originality/value - The bibliography listed is by no means complete but it gives a comprehensive representation of different finite element applications on the subjects. It will save time for readers looking for information dealing with described subjects, not having an access to large databases or willingness to spend time with uncertain information retrieval.", "paper_title": "Finite element analyses and simulations of gears and gear drives - A bibliography 1997-2006", "paper_id": "WOS:000256902400001"}