{"auto_keywords": [{"score": 0.04489580559834048, "phrase": "wdme_algorithm"}, {"score": 0.011439057052466074, "phrase": "critical_region"}, {"score": 0.00481495049065317, "phrase": "asynchronous_networks"}, {"score": 0.00456020621016909, "phrase": "practical_asynchronous_network_systems"}, {"score": 0.004437910956996051, "phrase": "wait-free_distributed_mutual_exclusion_algorithm"}, {"score": 0.004389912080394437, "phrase": "wdme"}, {"score": 0.004090274535243564, "phrase": "asynchronous_network_systems"}, {"score": 0.002855934865505357, "phrase": "naive_transformation"}, {"score": 0.0028096544129939277, "phrase": "shared-memory_mutual_exclusion_algorithm"}, {"score": 0.002631892325004253, "phrase": "unbounded_message_explosion"}, {"score": 0.00251966141432339, "phrase": "real_network_systems"}, {"score": 0.0022718774783143203, "phrase": "current_distributed_systems"}, {"score": 0.002186849855560281, "phrase": "message_complexity"}, {"score": 0.0021049977753042253, "phrase": "critical_section"}], "paper_keywords": [""], "paper_abstract": "This paper is motivated by a need of practical asynchronous network systems, i.e., a wait-free distributed mutual exclusion algorithm (WDME). The WDME algorithm is very appealing when a process runs on asynchronous network systems and its timing constraint is so restricted that the process cannot perform a local-spin in a wait-queue, which forces it to abort whenever it cannot access the critical region immediately. The WDME algorithm proposed in this paper is devised to eliminate the need for processes to send messages to determine whether the critical region has been entered by another process, an unfavorable drawback of a naive transformation of the shared-memory mutual exclusion algorithm to an asynchronous network model. This drawback leads to an unbounded message explosion, and it is very critical in real network systems. Design of the WDME algorithm is simple, and the algorithm is practical enough to be used in current distributed systems. The algorithm has 0(l) message complexity which is suboptimal between two consecutive runs of critical section.", "paper_title": "A practical single-register wait-free mutual exclusion algorithm on asynchronous networks", "paper_id": "WOS:000241469500048"}