{"auto_keywords": [{"score": 0.03893536257455493, "phrase": "trusted_virtual_computing_environment"}, {"score": 0.00481495049065317, "phrase": "virtualization_technology"}, {"score": 0.004760394308239882, "phrase": "cloud_computing_mode"}, {"score": 0.0043208252177835815, "phrase": "runtime_integrity"}, {"score": 0.004271843728776305, "phrase": "data_security"}, {"score": 0.004223415145617665, "phrase": "cloud_computing_platform"}, {"score": 0.0037682108720193956, "phrase": "design_theory"}, {"score": 0.0030164423559955896, "phrase": "design_principle"}, {"score": 0.0026302120935562568, "phrase": "virtual_computing_platform"}, {"score": 0.002386910596226864, "phrase": "vm"}, {"score": 0.0023064582783867645, "phrase": "trainbow"}, {"score": 0.0022802596433757565, "phrase": "great_improvements"}, {"score": 0.0021908807203548345, "phrase": "service_performance"}], "paper_keywords": ["computing platform", " virtual machine", " capacity service computing", " trust chain", " isolation"], "paper_abstract": "Currently, with the evolution of virtualization technology, cloud computing mode has become more and more popular. However, people still concern the issues of the runtime integrity and data security of cloud computing platform, as well as the service efficiency on such computing platform. At the same time, according to our knowledge, the design theory of the trusted virtual computing environment and its core system software for such network-based computing platform is at the exploratory stage. In this paper, we believe that efficiency and isolation are the two key proprieties of the trusted virtual computing environment. To guarantee these two proprieties, based on the design principle of splitting, customizing, reconstructing, and isolation-based enhancing to the platform, we introduce TRainbow, a novel trusted virtual computing platform developing by our research group. With the two creative mechanisms, that is, capacity flowing amongst VMs and VM-based kernel reconstructing, TRainbow provides great improvements (up to 42%) in service performance and isolated reliable computing environment for Internet-oriented, large-scale, concurrent services.", "paper_title": "TRainbow: a new trusted virtual machine based platform", "paper_id": "WOS:000292503700004"}