{"auto_keywords": [{"score": 0.037043006768315144, "phrase": "latest_information"}, {"score": 0.00481495049065317, "phrase": "social_networks"}, {"score": 0.004760017604908536, "phrase": "social_media"}, {"score": 0.004705907666525105, "phrase": "facebook"}, {"score": 0.0043258453436258405, "phrase": "information_propagation"}, {"score": 0.004211504818267892, "phrase": "set_u_of_n"}, {"score": 0.004147523799581407, "phrase": "social_network"}, {"score": 0.003711723285313348, "phrase": "aeuro_parts"}, {"score": 0.003683407561208816, "phrase": "thousand_u"}, {"score": 0.003424916005912503, "phrase": "naive_solution"}, {"score": 0.0031121406603482112, "phrase": "reliable_timestamps"}, {"score": 0.0027529929913806066, "phrase": "efficient_method"}, {"score": 0.002680114113899346, "phrase": "user_information"}, {"score": 0.0024073421672242486, "phrase": "finite_set"}], "paper_keywords": ["Social networks", " Information propagation", " Timestamps"], "paper_abstract": "In social media such as Facebook, the most popular desire is to learn the news about other people. In this paper, we study the following problem related to information propagation: Suppose that there is a set U of N users in a social network. They meet online from time to time and share information they know about themselves and the other users in the network. Whenever a group g aS,aEuro parts per thousand U of users meet, they want to know who has the latest information about every user in U. A naive solution to this problem is to use timestamps. However, there are drawbacks to this scheme including the burden on the users to maintain reliable timestamps and the fact that the timestamps grow unbounded over time. It is natural to ask if it is possible to learn the latest information without using timestamps. We present an efficient method which removes the need to timestamp user information (news). Instead, only the meetings of the groups have to be indexed. Furthermore, we show that this indexing can be performed using a finite set of labels so that each user stores at most O(N (2) logN) bits of information. We also show that this bound can be improved in some cases if we have further information on the topology of the network.", "paper_title": "A model for learning the news in social networks", "paper_id": "WOS:000347691500005"}