{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "massive_spatiotemporal_samples"}, {"score": 0.040940350360074255, "phrase": "prediction_accuracy"}, {"score": 0.03149705820116901, "phrase": "accurate_prediction"}, {"score": 0.02554099715645429, "phrase": "proposed_prediction_framework"}, {"score": 0.004638462976078815, "phrase": "trajectory_prediction"}, {"score": 0.004552648949390462, "phrase": "mobile_computing"}, {"score": 0.004447600571127578, "phrase": "wireless_network_operation"}, {"score": 0.004406260054779782, "phrase": "location-based_services"}, {"score": 0.004304574865291508, "phrase": "pervasive_computing"}, {"score": 0.0040890178236849825, "phrase": "visited_base_transceiver_stations"}, {"score": 0.003472149546470424, "phrase": "precise_spatiotemporal_information"}, {"score": 0.0032674478600540477, "phrase": "massive_amount"}, {"score": 0.0031182092708983184, "phrase": "huge_impact"}, {"score": 0.0030891871245908665, "phrase": "network_bandwidth_usage"}, {"score": 0.0030178044717552605, "phrase": "fine_spatiotemporal_information"}, {"score": 0.0026974065918918275, "phrase": "novel_prediction_framework"}, {"score": 0.00237733844863506, "phrase": "high_bandwidth_consumption"}, {"score": 0.0023442013458139497, "phrase": "high_accuracy"}], "paper_keywords": ["Location-dependent and sensitive", " pervasive computing", " location-based services", " trajectory prediction"], "paper_abstract": "Trajectory prediction is widespread in mobile computing, and helps support wireless network operation, location-based services, and applications in pervasive computing. However, most prediction methods are based on very coarse geometric information such as visited base transceiver stations, which cover tens of kilometers. These approaches undermine the prediction accuracy, and thus restrict the variety of application. Recently, due to the advance and dissemination of mobile positioning technology, accurate location tracking has become prevalent. The prediction methods based on precise spatiotemporal information are then possible. Although the prediction accuracy can be raised, a massive amount of data gets involved, which is undoubtedly a huge impact on network bandwidth usage. Therefore, employing fine spatiotemporal information in an accurate prediction must be efficient. However, this problem is not addressed in many prediction methods. Consequently, this paper proposes a novel prediction framework that utilizes massive spatiotemporal samples efficiently. This is achieved by identifying and extracting the information that is beneficial to accurate prediction from the samples. The proposed prediction framework circumvents high bandwidth consumption while maintaining high accuracy and being feasible. The experiments in this study examine the performance of the proposed prediction framework. The results show that it outperforms other popular approaches.", "paper_title": "Utilizing Massive Spatiotemporal Samples for Efficient and Accurate Trajectory Prediction", "paper_id": "WOS:000329196200004"}