{"auto_keywords": [{"score": 0.044728827124546816, "phrase": "nachum_shacham"}, {"score": 0.04450903326587539, "phrase": "paul_mckenney"}, {"score": 0.036973247757168086, "phrase": "redundant_packets"}, {"score": 0.013191802238045251, "phrase": "improved_scheme"}, {"score": 0.00481495049065317, "phrase": "wireless_networks"}, {"score": 0.004753576127735001, "phrase": "external_sources"}, {"score": 0.004680953816385419, "phrase": "terrestrial_obstruction"}, {"score": 0.004539005582217309, "phrase": "bursty_errors"}, {"score": 0.004515767699256193, "phrase": "transmitted_packets"}, {"score": 0.004412654209742722, "phrase": "packet-level_xor-fec"}, {"score": 0.004300830853119242, "phrase": "fec_scheme"}, {"score": 0.00421340730888561, "phrase": "ieee_conference_paper"}, {"score": 0.004138364638024742, "phrase": "high-speed_networks"}, {"score": 0.004096082254543022, "phrase": "buffer_management"}, {"score": 0.0037343898236054636, "phrase": "low_complexity"}, {"score": 0.003602486089862719, "phrase": "simulation_experiment_results"}, {"score": 0.003343841875107018, "phrase": "xor-fec_scheme"}, {"score": 0.003233987934322811, "phrase": "redundant_rate"}, {"score": 0.002940626369102927, "phrase": "corrupted_packets"}, {"score": 0.0028659990472580154, "phrase": "column_parity_packets"}, {"score": 0.0027789349951704177, "phrase": "correct_errors"}, {"score": 0.0026193670580850125, "phrase": "checksum_field"}, {"score": 0.0025792654256039187, "phrase": "damaged_packets"}, {"score": 0.002443671484766342, "phrase": "multimedia_data_transport"}, {"score": 0.0024248903457116558, "phrase": "double-window_scheme"}, {"score": 0.0022680361841334105, "phrase": "sending_windows"}, {"score": 0.002250601866422547, "phrase": "almost_the_same_per_and_redundant_rate"}, {"score": 0.0021990971392741613, "phrase": "packet-level_software_fec_scheme"}, {"score": 0.002176585279759007, "phrase": "reed-solomon_code"}, {"score": 0.002121306567029367, "phrase": "improved_xor-fec"}, {"score": 0.0021049977753042253, "phrase": "packet_error_rate"}], "paper_keywords": [""], "paper_abstract": "Over wireless networks, interference caused by external sources, multipath fading due to terrestrial obstruction, and the mobility of transmitters or receivers will result in bursty errors of transmitted packets. To deal with the problem, a packet-level XOR-FEC (forward error control), which improves an FEC scheme what Nachum Shacham and Paul McKenney proposed in an IEEE conference paper in 1990 named Packet recovery in high-speed networks using coding and buffer management, is proposed. The improved scheme, under certain conditions, can recover packets of both corruption and erasure. Because its main operation only involves the use of exclusive-or (XOR), it is low complexity. The scheme has been simulated and can be implemented with software. Simulation experiment results show that the improved scheme could decrease the number of redundant packets, so that the amount of computing to encode and decode can be saved and under certain conditions the XOR-FEC scheme could decrease the PER (packet error rate) without increasing the redundant rate. From the scheme that Nachum Shacham and Paul McKenney proposed, it can be seen that: The scheme does not provide a method to check errors in a packet, so only lost packets can be recovered but corrupted packets can not be corrected. Using both row and column parity packets increases the number of redundant packets. While receivers gain packets and correct errors in every batch of packets, there is much delay among batches. To improve the scheme of Nachum Shacham and Paul McKenney: Using checksum field in every packet to distinguish damaged packets. Only add to each column of the array of data packets a parity packet. To recover packets in multimedia data transport, a double-window scheme is proposed to decrease the delay among batches of packets and to smooth the jitter among packets in receivers. Experiments show that by adjusting sending windows, under almost the same PER and redundant rate, improved scheme could recover more packets than a packet-level software FEC scheme based on the Reed-Solomon code. Besides, in an experiment, using the improved XOR-FEC, the packet error rate was reduced from about 5.7% to 0.7% and only around 33.3% of redundant packets were injected.", "paper_title": "Packet-Level FEC Research Over Wireless Networks", "paper_id": "WOS:000265103800092"}