{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "behavioral_specialization"}, {"score": 0.00452670409375785, "phrase": "autonomous_robots"}, {"score": 0.004441517985511521, "phrase": "studied_swarm"}, {"score": 0.004255639740735269, "phrase": "different_types"}, {"score": 0.003371508176308189, "phrase": "higher_probability_tasks"}, {"score": 0.003022186855664124, "phrase": "simple_task_allocation_strategy"}, {"score": 0.0028006988338192375, "phrase": "different_environmental_parameters"}, {"score": 0.0023485549678832628, "phrase": "multiple_experiments"}, {"score": 0.002326304140277375, "phrase": "different_swarm_sizes"}, {"score": 0.0022393843660697484, "phrase": "major_influence"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v._all_rights"}], "paper_keywords": ["Specialization", " Task allocation", " Swarm robotics", " Swarm intelligence", " Self-organization", " Division of labor"], "paper_abstract": "In this work, we study behavioral specialization in a swarm of autonomous robots. In the studied swarm, robots have to carry out tasks of different types that appear stochastically in time and space in a given environment. We consider a setting in which a robot working repeatedly on tasks of the same type improves its performance on them due to learning. Robots can exploit learning by adapting their task selection behavior, that is, by selecting with higher probability tasks of the type on which they have improved their performance. This adaptation of behavior is called behavioral specialization. We employ a simple task allocation strategy that allows a swarm of robots to behaviorally specialize. We study the influence of different environmental parameters on the performance of the swarm and show that the swarm can exploit learning successfully. However, there is a trade-off between the benefits and the costs of specialization. We study this trade-off in multiple experiments using different swarm sizes. Our experimental results indicate that spatiality has a major influence on the costs and benefits of specialization. (C) 2012 Elsevier B.V. All rights reserved.", "paper_title": "Costs and benefits of behavioral specialization", "paper_id": "WOS:000311654000007"}