{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "low-skew_rotary_resonant_clock_network_design"}, {"score": 0.004643839937761046, "phrase": "topology-based_solution"}, {"score": 0.004242085112539693, "phrase": "traveling_wave_oscillation"}, {"score": 0.0038284549148537373, "phrase": "counter_cw_direction"}, {"score": 0.0024932498388507084, "phrase": "ring_rotation_direction_combinations"}, {"score": 0.0023328599525181707, "phrase": "proposed_brick-based_roa_clock_generation_and_distribution_networks"}, {"score": 0.0021960024679620886, "phrase": "gigahertz_operation"}, {"score": 0.002156529381840657, "phrase": "low-skew_clock_generation"}, {"score": 0.0021049977753042253, "phrase": "hspice."}], "paper_keywords": ["Clock distribution network design", " resonant clock", " synthesis"], "paper_abstract": "This paper presents a topology-based solution for a low-skew rotary oscillator array (ROA) clock distribution network design. An ROA-brick structure is proposed that limits the traveling wave oscillation to only two uniform ring rotation directions in the ROA-brick: all the rings in clockwise (CW) direction or all the rings in counter CW direction. An ROA built from the ROA-bricks has the following advantages: 1) similar to the ROA-brick, only two uniform ring rotation directions are feasible in the ROA; 2) the same phase tapping points of all the rings in the ROA are identifiable; and 3) these same phase tapping points of the ROA are independent from the two possible rotation directions. It is mathematically proved that the ROA-brick is the only ROA structure, which can limit the ring rotation direction combinations so as to guarantee the generation of same phase clock signals. The proposed brick-based ROA clock generation and distribution networks are designed for ISPD 10 clock benchmarks demonstrating the gigahertz operation with the low-skew clock generation and distributions through HSPICE.", "paper_title": "ROA-Brick Topology for Low-Skew Rotary Resonant Clock Network Design", "paper_id": "WOS:000364209000015"}