{"auto_keywords": [{"score": 0.0383910240082461, "phrase": "error_detection"}, {"score": 0.00481495049065317, "phrase": "infallible_expert"}, {"score": 0.004723322467153553, "phrase": "human_error"}, {"score": 0.004257708925521277, "phrase": "zero_defects"}, {"score": 0.004208881856146758, "phrase": "impractical_goal"}, {"score": 0.003837817436476726, "phrase": "cognitive_framework"}, {"score": 0.003764713814123286, "phrase": "error_recovery"}, {"score": 0.0035810720634458933, "phrase": "critical_care_domain"}, {"score": 0.0029542282776915747, "phrase": "multiple_elements"}, {"score": 0.0027992118597278087, "phrase": "slower_error_recovery_pattern"}, {"score": 0.0027564303939865476, "phrase": "detected_errors"}, {"score": 0.002683125911877974, "phrase": "specific_patient_outcomes"}, {"score": 0.002493810638588771, "phrase": "everyday_tasks"}, {"score": 0.002381169982803105, "phrase": "human_decision-making"}, {"score": 0.002308910575113746, "phrase": "robust_decision-support_systems"}, {"score": 0.0021708894366462153, "phrase": "potential_error"}, {"score": 0.002145942273032774, "phrase": "integral_part"}, {"score": 0.0021294699637639564, "phrase": "cognitive_work"}], "paper_keywords": ["Error detection", " Error recovery", " Cognitive informatics", " Naturalistic", " Laboratory-based", " Patient safety", " Decision making", " Expertise"], "paper_abstract": "The notion that human error should not be tolerated is prevalent in both the public and personal perception of the performance of clinicians. However, researchers in other safety-critical domains have long since abandoned the quest for zero defects as an impractical goal, choosing to focus instead on the development of strategies to enhance the ability to recover from error. This paper presents a cognitive framework for the study of error recovery, and the results of our empirical research into error detection and recovery in the critical care domain, using both laboratory-based and naturalistic approaches. Both attending physicians and residents were prone to commit, detect and recover from errors, but the nature of these errors was different. Experts corrected the errors as soon as they detected them and were better able to detect errors requiring integration of multiple elements in the case. Residents were more cautious in making decisions showing a slower error recovery pattern, and the detected errors were more procedural in nature with specific patient outcomes. Error detection and correction are shown to be dependent on expertise, and on the nature of the everyday tasks of the clinicians concerned. Understanding the limits and failures of human decision-making is important if we are to build robust decision-support systems to manage the boundaries of risk of error in decision-making. Detection and correction of potential error is an integral part of cognitive work in the complex, critical care workplace. (C) 2010 Elsevier Inc. All rights reserved.", "paper_title": "Recovery at the edge of error: Debunking the myth of the infallible expert", "paper_id": "WOS:000291768200006"}