{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "threshold_gap"}, {"score": 0.004781498797706604, "phrase": "secret_sharing"}, {"score": 0.004633805690244912, "phrase": "secret_sharing_schemes"}, {"score": 0.004306610946695577, "phrase": "cardinality_q."}, {"score": 0.0038517317559294962, "phrase": "arbitrary_a_priori_distribution"}, {"score": 0.0029131986574478046, "phrase": "f-q-linear_schemes"}, {"score": 0.002387214876538434, "phrase": "f-q-linear_case"}, {"score": 0.0022653055209664284, "phrase": "dualization_argument"}, {"score": 0.00217987162651941, "phrase": "open_question"}, {"score": 0.0021421082915443887, "phrase": "arithmetic_secret_sharing_schemes"}, {"score": 0.0021049977753042253, "phrase": "asymptotic_optimal_corruption_tolerance_rate"}], "paper_keywords": ["Arithmetic secret sharing", " error correcting codes", " Griesmer bound", " Norse bounds", " secret sharing", " threshold gap"], "paper_abstract": "We consider the class of secret sharing schemes where there is no a priori bound on the number of players but where each of the share-spaces has fixed cardinality q. We show two fundamental lower bounds on the threshold gap of such schemes. The threshold gap is defined as, where is minimal and is maximal such that the following holds: for a secret with arbitrary a priori distribution, each r-subset of players can reconstruct this secret from their joint shares without error (r-reconstruction) and the information gain about the secret is nil for each t-subset of players jointly (t-privacy). Our first bound, which is completely general, implies that if 1 <= t < r <= n, then g >= n-t+1/q independently of the cardinality of the secret-space F-q(k)(k >= 2). Our second bound pertains to F-q-linear schemes with secret-space F-q(k) (k >= 2). It improves the first bound when is large enough. Concretely, it implies that g >= n-t+1/q + f(q, k, t, n), for some function that is strictly positive when is large enough. Moreover, also in the F-q-linear case, bounds on the threshold gap independent of or are obtained by additionally employing a dualization argument. As an application of our results, we answer an open question about the asymptotics of arithmetic secret sharing schemes and prove that the asymptotic optimal corruption tolerance rate is strictly smaller than 1.", "paper_title": "Bounds on the Threshold Gap in Secret Sharing and its Applications", "paper_id": "WOS:000323455800024"}