{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "new_measure"}, {"score": 0.04213184070509128, "phrase": "measured_shape"}, {"score": 0.004449772140968921, "phrase": "narrow_intrusions"}, {"score": 0.004158794879468156, "phrase": "measured_squareness"}, {"score": 0.0036052633308076933, "phrase": "shape_squareness"}, {"score": 0.0034722233102219466, "phrase": "relative_position"}, {"score": 0.0032694619052789768, "phrase": "squareness_measure"}, {"score": 0.003125175084962886, "phrase": "second_generalisation"}, {"score": 0.002719055901632759, "phrase": "new_measures"}, {"score": 0.0023834640793589435, "phrase": "new_method"}, {"score": 0.00223570488212345, "phrase": "standard_method"}], "paper_keywords": ["Shape", " Squareness measure", " Shape classification", " Orientation", " Early vision"], "paper_abstract": "In this paper we propose a measure which defines the degree to which a shape differs from a square. The new measure is easy to compute and being area based, is robust-e.g., with respect to noise or narrow intrusions. Also, it satisfies the following desirable properties: it ranges over (0,1] and gives the measured squareness equal to 1 if and only if the measured shape is a square; it is invariant with respect to translations, rotations and scaling. In addition, we propose a generalisation of the new measure so that shape squareness can be computed while controlling the impact of the relative position of points inside the shape. Such a generalisation enables a tuning of the behaviour of the squareness measure and makes it applicable to a range of applications. A second generalisation produces a measure, parameterised by delta, that ranges in the interval (0,1] and equals 1 if and only if the measured shape is a rhombus whose diagonals are in the proportion 1:delta. The new measures (the initial measure and the generalised ones) are naturally defined and theoretically well founded-consequently, their behaviour can be well understood. As a by-product of the approach we obtain a new method for the orienting of shapes, which is demonstrated to be superior with respect to the standard method in several situations. The usefulness of the methods described in the manuscript is illustrated on three large shape databases: diatoms (ADIAC), MPEG-7 CE-1, and trademarks.", "paper_title": "Measuring Squareness and Orientation of Shapes", "paper_id": "WOS:000285974800002"}