{"auto_keywords": [{"score": 0.004534136929881113, "phrase": "dominant_factor"}, {"score": 0.0044219992735047954, "phrase": "underling_hypothesis"}, {"score": 0.0036921366375716005, "phrase": "model_performance"}, {"score": 0.0036553070575015344, "phrase": "lower_latency"}, {"score": 0.003356675879109443, "phrase": "higher_throughput"}, {"score": 0.003021141590548526, "phrase": "computer_architects"}, {"score": 0.0027881294891497115, "phrase": "computer_design"}, {"score": 0.0027327327233891865, "phrase": "instruction_level"}, {"score": 0.0026919067120537055, "phrase": "multiapplication_level"}, {"score": 0.00242266141176955, "phrase": "sea_change"}, {"score": 0.0023745087648471613, "phrase": "performance_evaluation"}, {"score": 0.002315658491366464, "phrase": "computer_performance"}, {"score": 0.002246955931290095, "phrase": "end_user"}, {"score": 0.0021262403223013242, "phrase": "future_directions"}, {"score": 0.0021049977753042253, "phrase": "computer_evaluation"}], "paper_keywords": [""], "paper_abstract": "Since the dawn of computing, performance has been the dominant factor driving innovation. The underling hypothesis is that there is always more computation that can be done if the computer would be made faster in performing some application or set of applications. Latency and throughput are the two metrics commonly used to model performance. Lower latency for a given application means that the application will execute faster from beginning to end, while higher throughput for a set of applications means that the set will execute faster, again, from beginning to end. Computer architects and designers focus on techniques that reduce latency and increase throughput at all levels of computer design, from the instruction level to the multiapplication level. In this chapter we illustrate how the applications and architectures of emerging mobile, personal computer devices call this focus into question. A sea change is occurring in performance evaluation which requires re-evaluation of computer performance from the perspective of the end user. We develop a taxonomy and include examples to motivate future directions for computer evaluation and design.", "paper_title": "The Emerging Landscape of Computer Performance Evaluation", "paper_id": "WOS:000266063000004"}