{"auto_keywords": [{"score": 0.03692265089953331, "phrase": "snp"}, {"score": 0.025836481126000614, "phrase": "scan"}, {"score": 0.00481495049065317, "phrase": "genome-wide_association_studies"}, {"score": 0.004663074596384574, "phrase": "single_nucleotide_polymorphisms"}, {"score": 0.004580769304731227, "phrase": "complex_phenotypes"}, {"score": 0.004483909657713567, "phrase": "traditionally_overlooked_copy_number_variations"}, {"score": 0.0044047527104545525, "phrase": "complex_traits"}, {"score": 0.004131135118662576, "phrase": "follow-up_experimental_validations"}, {"score": 0.003986509098918949, "phrase": "sensible_prioritization"}, {"score": 0.0034690732089830045, "phrase": "scan_database"}, {"score": 0.003371508176308189, "phrase": "hapmap_snps"}, {"score": 0.0032766780632972393, "phrase": "affymetrix_exon_array"}, {"score": 0.0032302647179383915, "phrase": "full_set"}, {"score": 0.0032073043728420843, "phrase": "hapmap_ceu"}, {"score": 0.003139552674943321, "phrase": "usa"}, {"score": 0.003094921414356621, "phrase": "yoruba"}, {"score": 0.0030619775399180604, "phrase": "ibadan"}, {"score": 0.003040221924974925, "phrase": "nigeria"}, {"score": 0.002881793492919646, "phrase": "hapmap_snp"}, {"score": 0.0028006988338192375, "phrase": "strong_ld"}, {"score": 0.0026264601495742295, "phrase": "different_high-throughput_platforms"}, {"score": 0.0025343769150179764, "phrase": "physical_and_functional_annotations"}, {"score": 0.0021352776064254195, "phrase": "high-throughput_platform"}, {"score": 0.0021049977753042253, "phrase": "genomic_region"}], "paper_keywords": [""], "paper_abstract": "Motivation: Genome-wide association studies (GWAS) generate relationships between hundreds of thousands of single nucleotide polymorphisms (SNPs) and complex phenotypes. The contribution of the traditionally overlooked copy number variations (CNVs) to complex traits is also being actively studied. To facilitate the interpretation of the data and the designing of follow-up experimental validations, we have developed a database that enables the sensible prioritization of these variants by combining several approaches, involving not only publicly available physical and functional annotations but also multilocus linkage disequilibrium (LD) annotations as well as annotations of expression quantitative trait loci (eQTLs). Results: For each SNP, the SCAN database provides: (i) summary information from eQTL mapping of HapMap SNPs to gene expression (evaluated by the Affymetrix exon array) in the full set of HapMap CEU (Caucasians from UT, USA) and YRI (Yoruba people from Ibadan, Nigeria) samples; (ii) LD information, in the case of a HapMap SNP, including what genes have variation in strong LD (pairwise or multilocus LD) with the variant and how well the SNP is covered by different high-throughput platforms; (iii) summary information available from public databases (e. g. physical and functional annotations); and (iv) summary information from other GWAS. For each gene, SCAN provides annotations on: (i) eQTLs for the gene (both local and distant SNPs) and (ii) the coverage of all variants in the HapMap at that gene on each high-throughput platform. For each genomic region, SCAN provides annotations on: (i) physical and functional annotations of all SNPs, genes and known CNVs within the region and (ii) all genes regulated by the eQTLs within the region.", "paper_title": "SCAN: SNP and copy number annotation", "paper_id": "WOS:000273696900016"}