{"auto_keywords": [{"score": 0.04712665802421912, "phrase": "adult_learners"}, {"score": 0.03411394799533831, "phrase": "instructional_tool"}, {"score": 0.00481495049065317, "phrase": "elt_instructional_tool"}, {"score": 0.004240116703465252, "phrase": "popular_culture"}, {"score": 0.004191377834552202, "phrase": "second-language_students"}, {"score": 0.00344321906220063, "phrase": "teacher_reception"}, {"score": 0.0031937337757356526, "phrase": "language_teaching"}, {"score": 0.003066945490483524, "phrase": "mainland_chinese_teachers"}, {"score": 0.0024756080101497086, "phrase": "high_levels"}, {"score": 0.002418923027024191, "phrase": "quantitative_data"}, {"score": 0.0022305310659333864, "phrase": "secondary_language_learners"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Animation", " English language teaching", " Adult learning", " Appraisal analysis"], "paper_abstract": "This paper explores the attitudes of teachers, as adult learners, towards learning to do animation. A part of popular culture which second-language students enjoy, until recently, animation has been technically too demanding for non-specialists to learn. Adult learners can experience e-learning as transformative, but also as a barrier. Thus, teacher reception is crucial in exploring the feasibility of animation as an instructional tool in language teaching. In all, 44 Hong Kong and mainland Chinese teachers were taught animation over ten weeks. Subsequently, three surveys elicited both quantitative and qualitative data. Appraisal analysis indicated teachers positively realised animation as valuable, worthwhile and satisfactory, but also difficult and time-consuming, and entailed high levels of communication. Quantitative data indicated their view that animation would be well-received by both colleagues and secondary language learners, as an instructional tool. (C) 2011 Elsevier Ltd. All rights reserved.", "paper_title": "Trialing cartoons: Teachers' attitudes towards animation as an ELT instructional tool", "paper_id": "WOS:000305036400025"}