{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "gis"}, {"score": 0.004668957916795845, "phrase": "geo-virtual_reality_system"}, {"score": 0.004574085781766281, "phrase": "important_elements"}, {"score": 0.004504193207111593, "phrase": "modelling_process"}, {"score": 0.004256895619944631, "phrase": "ad_hoc_manner"}, {"score": 0.0041490029730869345, "phrase": "specific_application_domain"}, {"score": 0.0035201528214608914, "phrase": "real_geographic_object_instances"}, {"score": 0.003343841875107018, "phrase": "systematic_part"}, {"score": 0.003292685392413911, "phrase": "object_class_definition"}, {"score": 0.002895620643297197, "phrase": "gis_and_geovr_subsystems"}, {"score": 0.002546315584783112, "phrase": "modelling_constraints"}], "paper_keywords": ["object constraints", " object constraint language", " unified modelling language", " virtual reality", " GIS", " GeoVR", " 3D objects"], "paper_abstract": "Constraints are important elements of every modelling process, but until now they have been treated in an ad hoc manner, depending on the specific application domain and the capabilities of the tools used. In GIS and GeoVR applications, constraints are conditions which always have to be valid (true) within the model populated with real geographic object instances. This paper argues that constraints should form a systematic part of the object class definition, similar to other aspects of the definition, viz. attributes, methods and relationships. Also, the implementation of constraints in all GIS and GeoVR subsystems (at front-end, database and exchange (I/O) level) should be derived automatically from the constraints specified by the framework. The paper therefore puts forward a framework for modelling constraints comprising (1) a classification and clarification of constraints, (2) a formal description using the unified modelling language/object constraint language (UML/OCL) and (3) implementation characteristics. The components of the framework are illustrated and applied to SALIX-2, a geo-virtual reality (GeoVR) landscape modelling system.", "paper_title": "Specifying and implementing constraints in GIS-with examples from a geo-virtual reality system", "paper_id": "WOS:000243555500006"}