{"auto_keywords": [{"score": 0.037084226842329523, "phrase": "decision-making_problem"}, {"score": 0.00481495049065317, "phrase": "immediate_probabilities"}, {"score": 0.0046928556063004214, "phrase": "new_decision-making_model"}, {"score": 0.004496174406337201, "phrase": "immediate_probability"}, {"score": 0.004270960586542813, "phrase": "objective_probability"}, {"score": 0.0041984140090404985, "phrase": "attitudinal_character"}, {"score": 0.004144810537437608, "phrase": "decision_maker"}, {"score": 0.0037238193456845124, "phrase": "exact_numbers"}, {"score": 0.003582928547553209, "phrase": "real_situation"}, {"score": 0.003123652729688503, "phrase": "fuzzy_numbers"}, {"score": 0.002879237498994052, "phrase": "possible_scenarios"}, {"score": 0.0027821202902740846, "phrase": "intermediate_event"}, {"score": 0.0022257833099336858, "phrase": "new_approach"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Decision making", " Immediate probabilities", " OWA operator", " Fuzzy numbers", " Strategic selection"], "paper_abstract": "We developed developed a new decision-making model with probabilistic information and used the concept of the immediate probability to aggregate the information. This type of probability modifies the objective probability by introducing the attitudinal character of the decision maker. In doing so, we use the ordered weighting average (OWA) operator. When using this model, it is assumed that the information is given by exact numbers. However, this may not be the real situation found within the decision-making problem. Sometimes, the information is vague or imprecise and it is necessary to use another approach to assess the information, such as the use of fuzzy numbers. Then, the decision-making problem can be represented more completely because we now consider the best and worst possible scenarios, along with the possibility that some intermediate event (an internal value) will occur. We will use the fuzzy ordered weighted averaging (FOWA) operator to aggregate the information with the probabilities. As a result, we will get the Immediate Probability-FOWA (IP-FOWA) operator. We will study some of its main properties. We will apply the new approach in a decision-making problem about selection of strategies. (C) 2010 Elsevier Ltd. All rights reserved.", "paper_title": "Fuzzy decision making with immediate probabilities", "paper_id": "WOS:000277954700016"}