{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "fuzzy_clustering"}, {"score": 0.004718314112245913, "phrase": "partial_supervision"}, {"score": 0.00441738161338662, "phrase": "important_and_unique_role"}, {"score": 0.0043506951029334984, "phrase": "hidden_structure"}, {"score": 0.004019466308963466, "phrase": "study"}, {"score": 0.0036429626734678314, "phrase": "clustering_mechanisms"}, {"score": 0.003587924960158317, "phrase": "underlying_goal"}, {"score": 0.00351582806482809, "phrase": "clustering_algorithms"}, {"score": 0.003462704420080129, "phrase": "higher_level"}, {"score": 0.00309681702203087, "phrase": "comprehensive_assessment"}, {"score": 0.0028263192354046245, "phrase": "standard_euclidean_distance"}, {"score": 0.002618995204424126, "phrase": "full_adaptive_distance"}, {"score": 0.0025663181430010686, "phrase": "kernel-based_distance"}, {"score": 0.0025275050635202878, "phrase": "fuzzy_c-means"}, {"score": 0.002226017732566121, "phrase": "-supervised_clustering"}], "paper_keywords": ["semi-supervised clustering", " FCM", " distance functions", " quality of clustering", " kernel-based distance", " classification"], "paper_abstract": "Semi-supervised (or partial) fuzzy clustering plays an important and unique role in discovering hidden structure in data realized in presence of a certain quite limited fraction of labeled patterns. The objective of this Study is to investigate and quantify the effect of various distance functions (distances) on the performance Of the Clustering mechanisms. The underlying goal of endowing the clustering algorithms with a higher level of flexibility is done via the use of various distances. The enhancement of this character is evaluated by means of a comprehensive assessment of quality of clusters, their ensuing discrimination abilities and the accuracy of clusters themselves. In addition to the standard Euclidean distance being commonly exploited in fuzzy clustering, three more versatile and adaptive distance measures are considered such as its weighted version, a full adaptive distance, and a kernel-based distance. Using Fuzzy C-Means (FCM) coming in its generic formal. we show its semi-supervised enhancements. derive detailed formulas and analyze their effectiveness. The improvements of semi-supervised clustering are empirically evaluated and numerically quantified with the use of several Machine Learning data sets. (C) 2006 Elsevier B.V. All rights reserved.", "paper_title": "Enhancement of fuzzy clustering by mechanisms of partial supervision", "paper_id": "WOS:000238402100001"}