{"auto_keywords": [{"score": 0.031021468145497607, "phrase": "external_action"}, {"score": 0.014475654310267658, "phrase": "dm_alerts"}, {"score": 0.010221498665310687, "phrase": "electronic_patient_record"}, {"score": 0.0048216059804415574, "phrase": "nature"}, {"score": 0.004748556604045108, "phrase": "duplicate_medication_alerts"}, {"score": 0.004602483094756597, "phrase": "duplicate_medication"}, {"score": 0.004507594400447103, "phrase": "community_pharmacists"}, {"score": 0.0044608829094248985, "phrase": "potential_characteristics"}, {"score": 0.004047500054405469, "phrase": "structured_form"}, {"score": 0.003936560022538905, "phrase": "clinical_decision_support_systems"}, {"score": 0.0036595438031512217, "phrase": "concurrent_use"}, {"score": 0.0035100601949451028, "phrase": "dm_alert"}, {"score": 0.003449585750738867, "phrase": "intentional_combination"}, {"score": 0.0032971676471625646, "phrase": "unintentional_concurrent_use"}, {"score": 0.0024704333220467393, "phrase": "community_pharmacy"}, {"score": 0.0024533019565858073, "phrase": "prescription_modifications"}, {"score": 0.0022101055924375725, "phrase": "current_dm_alerts"}], "paper_keywords": ["clinical decision support systems", " duplicate medication", " medication errors", " medical order entry systems", " community pharmacy services"], "paper_abstract": "Objective: To investigate the nature of duplicate medication (DM) alerts, their management by community pharmacists, and potential characteristics of DM alerts that lead to interventions by pharmacists. Methods: Observational study in 53 community pharmacies. Each pharmacist registered the nature and management of 24 DM alerts on a structured form. Results: On average, the clinical decision support systems generated 20.4 DM alerts per 100 dispensed drugs. In half of the 1272 registered alerts, the pharmacists judged that there was no risk for concurrent use of both prescriptions. In 32% of the alerts, the DM alert was generated for an intentional combination. In 17% of the alerts, there was a risk for unintentional concurrent use. In 32% of the alerts the pharmacists decided that one or more actions were needed: the electronic patient record was updated in 15% of the alerts and in 19% of the alerts the pharmacists performed an external action-for example, informing the patient or modifying the prescription (including 5 therapeutic prescription modifications and 22 logistic prescription modifications). Alerts concerning first dispensing were more likely to be followed by an external action than alerts concerning refills (40% vs 14%, P<.001). Discussion and Conclusion: In community pharmacy, prescription modifications based on DM alerts are rare, but DM alerts lead with some regularity to other actions-for example, patient instruction and update of the electronic patient record. As the current DM alerts are diverse and nonspecific in detecting situations where external action is considered relevant, other ways of alerting should therefore be considered.", "paper_title": "Nature and management of duplicate medication alerts", "paper_id": "WOS:000361282200011"}