{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "event-driven_architecture"}, {"score": 0.04710816141049143, "phrase": "global_supply_chains"}, {"score": 0.027400749744357324, "phrase": "global_supply_chain"}, {"score": 0.004565007074039171, "phrase": "plastic_toys_supply_chain."}, {"score": 0.00439777299939725, "phrase": "public_and_private_organizations"}, {"score": 0.0042820680211904235, "phrase": "collective_goal"}, {"score": 0.0035908627899097407, "phrase": "service_delivery_delays"}, {"score": 0.0035338315037521657, "phrase": "relevant_information"}, {"score": 0.0033680968918579717, "phrase": "supply_chain"}, {"score": 0.0032969458013463807, "phrase": "service_provisioning"}, {"score": 0.0026205405415623525, "phrase": "service_delivery"}, {"score": 0.002405853977978678, "phrase": "plastic_toys"}, {"score": 0.0021049977753042253, "phrase": "barge_planning_service"}], "paper_keywords": ["Design science", " EDA", " global supply chain", " information exchange", " SOA"], "paper_abstract": "In global supply chains, a multitude of public and private organizations collaborate to reach the collective goal of transporting goods from the seller to the buyer. Given the dynamicity of global supply chains it is hard to predict which information is needed by whom at which point in time which often causes service delivery delays. Integrating relevant information, processes and services prevents disruptions in the supply chain and deterioration in service provisioning caused by missing information required for processes that need to be executed to supply services. In this paper, an ontology-based, event-driven architecture is designed for integrating information, processes and services that acts as a mechanism to coordinate service delivery in a global supply chain. The architecture is evaluated in the context of a global supply chain of plastic toys. This illustrates how the events facilitated by the architecture enable the availability of information in time which positively influences the delivery of a barge planning service.", "paper_title": "AN EVENT-DRIVEN ARCHITECTURE FOR INTEGRATING INFORMATION, PROCESSES AND SERVICES IN A PLASTIC TOYS SUPPLY CHAIN", "paper_id": "WOS:000316268200003"}