{"auto_keywords": [{"score": 0.04724572975778897, "phrase": "null_hypothesis"}, {"score": 0.00481495049065317, "phrase": "transcriptomic_background_differences"}, {"score": 0.004706206193274572, "phrase": "differentially_expressed_genes"}, {"score": 0.004617455679463816, "phrase": "microarray_experiments"}, {"score": 0.0041662189933067, "phrase": "strict_hypothesis"}, {"score": 0.003980032599437366, "phrase": "target_and_control_samples"}, {"score": 0.0039049226745413224, "phrase": "different_cell_cycle_stages"}, {"score": 0.0038752755502006442, "phrase": "different_biological_donors"}, {"score": 0.00378767277402891, "phrase": "increased_false_positives"}, {"score": 0.0035772012773052065, "phrase": "statistical_framework"}, {"score": 0.0035096666710980108, "phrase": "target_and_control_samples_from_expression_microarray_data"}, {"score": 0.003365529624506815, "phrase": "modified_null_hypothesis"}, {"score": 0.003327253821888569, "phrase": "gene_expression_background_difference"}, {"score": 0.0032272929113113203, "phrase": "iterative_procedure"}, {"score": 0.003190584226787897, "phrase": "robust_estimation"}, {"score": 0.002956272941199248, "phrase": "reverse_transcription-polymerase_chain_reaction"}, {"score": 0.0026771345950466208, "phrase": "rt-pcr"}, {"score": 0.002557322657104706, "phrase": "different_microarray_platforms"}, {"score": 0.0025185863209688016, "phrase": "better_reproducibility"}, {"score": 0.0024522007854499554, "phrase": "deg_identification_concordance"}, {"score": 0.0021049977753042253, "phrase": "power-cost_tradeoff_problem"}], "paper_keywords": [""], "paper_abstract": "Motivation: Tests of differentially expressed genes (DEGs) from microarray experiments are based on the null hypothesis that genes that are irrelevant to the phenotype/stimulus are expressed equally in the target and control samples. However, this strict hypothesis is not always true, as there can be several transcriptomic background differences between target and control samples, including different cell/tissue types, different cell cycle stages and different biological donors. These differences lead to increased false positives, which have little biological/medical significance. Result: In this article, we propose a statistical framework to identify DEGs between target and control samples from expression microarray data allowing transcriptomic background differences between these samples by introducing a modified null hypothesis that the gene expression background difference is normally distributed. We use an iterative procedure to perform robust estimation of the null hypothesis and identify DEGs as outliers. We evaluated our method using our own triplicate microarray experiment, followed by validations with reverse transcription-polymerase chain reaction (RT-PCR) and on the MicroArray Quality Control dataset. The evaluations suggest that our technique (i) results in less false positive and false negative results, as measured by the degree of agreement with RT-PCR of the same samples, (ii) can be applied to different microarray platforms and results in better reproducibility as measured by the degree of DEG identification concordance both intra-and inter-platforms and (iii) can be applied efficiently with only a few microarray replicates. Based on these evaluations, we propose that this method not only identifies more reliable and biologically/medically significant DEG, but also reduces the power-cost tradeoff problem in the microarray field.", "paper_title": "Novel statistical framework to identify differentially expressed genes allowing transcriptomic background differences", "paper_id": "WOS:000277985500007"}