{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "virtual_environment"}, {"score": 0.004769958800452922, "phrase": "real-world_application"}, {"score": 0.004725385523804256, "phrase": "situated_multi-agent_systems"}, {"score": 0.004508661664944657, "phrase": "situated_agent"}, {"score": 0.004438642216475526, "phrase": "long-term_planning"}, {"score": 0.004383406949799696, "phrase": "action_sequence"}, {"score": 0.004078829832634839, "phrase": "situated_agents"}, {"score": 0.003940706575253453, "phrase": "common_goal"}, {"score": 0.00389164348807591, "phrase": "recent_project"}, {"score": 0.0038431888954930083, "phrase": "situated_mass"}, {"score": 0.003771631577951067, "phrase": "automated_transportation_system"}, {"score": 0.0037363522297378777, "phrase": "automatic_guided_vehicles"}, {"score": 0.003576013525113198, "phrase": "traditional_approaches"}, {"score": 0.003487489029588045, "phrase": "central_server"}, {"score": 0.0033482708495261864, "phrase": "situated_mas"}, {"score": 0.003234806486611361, "phrase": "physical_environment"}, {"score": 0.0027395968397212053, "phrase": "suitable_abstraction"}, {"score": 0.0027139447110929586, "phrase": "low-level_physical_processing"}, {"score": 0.002688532527987548, "phrase": "agv"}, {"score": 0.0025892330566358503, "phrase": "wireless_network"}, {"score": 0.002305510336172049, "phrase": "mobile_and_ad-hoc_networks"}, {"score": 0.002172093645267283, "phrase": "mas_solution"}, {"score": 0.0021049977753042253, "phrase": "complex_real-world_application"}], "paper_keywords": [""], "paper_abstract": "In situated multi-agent systems (situated MASs), agents are explicitly placed in an environment. A situated agent does not not use long-term planning to decide what action sequence should be executed, but selects actions on the basis of its current position, the world it perceives and limited internal state. Situated agents exploit the environment to coordinate their behavior and to reach a common goal. In a recent project, we applied situated MASs to the control of an automated transportation system that uses automatic guided vehicles (AGVs) to transport loads in a warehouse. In contrast to traditional approaches where the AGVs are controlled by a central server, in this project we model the AGVs as agents in a situated MAS, aiming to improve flexibility and openness. Since the physical environment of AGVs is very restricted, it offers little opportunities for agents to use the environment. We introduce a virtual environment for agents to live in. This virtual environment (1) offers a medium that agents can use to exchange information and coordinate their behavior, and (2) serves as a suitable abstraction to shield low-level physical processing from the AGV agents. Since the only infrastructure available to the AGVs is a wireless network, the virtual environment is necessarily distributed over the AGVs. Synchronization of the state of the virtual environment is provided by ObjectPlaces, a middleware infrastructure that offers support to exchange and share information among nodes in mobile and ad-hoc networks. In this paper, we demonstrate how the environment is used creatively in the design of a MAS solution, helping to manage the complexity of engineering a complex real-world application.", "paper_title": "Exploiting a virtual environment in a real-world application", "paper_id": "WOS:000237040700013"}