{"auto_keywords": [{"score": 0.04376009469235903, "phrase": "naive_evaluation"}, {"score": 0.02308504754657235, "phrase": "incomplete_databases"}, {"score": 0.008533592002483019, "phrase": "conjunctive_queries"}, {"score": 0.00481495049065317, "phrase": "naive_evaluation_of_queries"}, {"score": 0.004740197030914445, "phrase": "term_naive_evaluation"}, {"score": 0.004579780586951551, "phrase": "usual_data_values"}, {"score": 0.004466519142879166, "phrase": "standard_database_query_evaluation_engine"}, {"score": 0.004002902686509964, "phrase": "new_specialized_algorithms"}, {"score": 0.003965468669507077, "phrase": "relational_databases"}, {"score": 0.003831169445079928, "phrase": "desirable_property"}, {"score": 0.0036553070575015344, "phrase": "relational_calculus"}, {"score": 0.003542557455905503, "phrase": "open-world_assumption"}, {"score": 0.003401148484767927, "phrase": "general_framework"}, {"score": 0.0029260602766930065, "phrase": "perfect_sense"}, {"score": 0.0028805474861014722, "phrase": "open_world"}, {"score": 0.0027139447110929586, "phrase": "semantics-induced_ordering"}, {"score": 0.002409020863483571, "phrase": "positive_first-order_formulae"}, {"score": 0.0023864566654035924, "phrase": "closed-world_semantics"}, {"score": 0.002327310963701377, "phrase": "general_relation-based_framework"}, {"score": 0.0021926354732269846, "phrase": "new_ones"}, {"score": 0.0021517438495635634, "phrase": "first-order_queries"}], "paper_keywords": ["Theory", " Languages", " Algorithms", " Incompleteness", " naive tables/evaluation", " certain answers", " orderings", " homomorphisms"], "paper_abstract": "The term naive evaluation refers to evaluating queries over incomplete databases as if nulls were usual data values, that is, to using the standard database query evaluation engine. Since the semantics of query answering over incomplete databases is that of certain answers, we would like to know when naive evaluation computes them, that is, when certain answers can be found without inventing new specialized algorithms. For relational databases it is well known that unions of conjunctive queries possess this desirable property, and results on preservation of formulae under homomorphisms tell us that, within relational calculus, this class cannot be extended under the open-world assumption. Our goal here is twofold. First, we develop a general framework that allows us to determine, for a given semantics of incompleteness, classes of queries for which naive evaluation computes certain answers. Second, we apply this approach to a variety of semantics, showing that for many classes of queries beyond unions of conjunctive queries, naive evaluation makes perfect sense under assumptions different from open world. Our key observations are: (1) naive evaluation is equivalent to monotonicity of queries with respect to a semantics-induced ordering, and (2) for most reasonable semantics of incompleteness, such monotonicity is captured by preservation under various types of homomorphisms. Using these results we find classes of queries for which naive evaluation works, for example, positive first-order formulae for the closed-world semantics. Even more, we introduce a general relation-based framework for defining semantics of incompleteness, show how it can be used to capture many known semantics and to introduce new ones, and describe classes of first-order queries for which naive evaluation works under such semantics.", "paper_title": "Naive Evaluation of Queries over Incomplete Databases", "paper_id": "WOS:000347799000006"}