{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "bribery-free_and_coercion-free_electronic_voting_scheme"}, {"score": 0.004442032546224076, "phrase": "outstanding_results"}, {"score": 0.004118587636081584, "phrase": "open_problem"}, {"score": 0.003975781274672803, "phrase": "suitable_manner"}, {"score": 0.0036676174658755683, "phrase": "effective_protection"}, {"score": 0.0033156708990372047, "phrase": "complicated_protection_method"}, {"score": 0.0028498718992429825, "phrase": "significant_issue"}, {"score": 0.0025503112711036994, "phrase": "prevention_e-voting_scheme"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Electronic election", " Bribery", " Coercion", " Invisible channel", " Biometrics receipts"], "paper_abstract": "Electronic voting has been in development for more than 20 years, during which it has produced outstanding results both in theory and in practice. However, bribery and coercion remain an open problem, as there is still no suitable manner to prevent or fight them. Publications emphasizing practicality has not been able to achieve effective protection, probably due to their overtly simple protection method, while publications emphasizing theories are difficult to put into practice due to the complicated protection method devised by them. Thus, how to design a scheme that can flawlessly prevent problems of bribery and coercion as well as put into practice easily becomes a significant issue. In this paper, we suggest that designers apply two indispensable design components, invisible channel and biometrics receipts, to design a prevention e-voting scheme, and also to introduce several feasible technology to help with its implementation. Followingly, a prevention electronic voting scheme that matches our ideal is proposed. We expect this study to arouse the interest of more researchers regarding the subject. (C) 2009 Elsevier Inc. All rights reserved.", "paper_title": "Approach to designing bribery-free and coercion-free electronic voting scheme", "paper_id": "WOS:000272061000013"}