{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "artificial_intelligence-based_modeling_techniques"}, {"score": 0.00460125407969429, "phrase": "high_speed_milling"}, {"score": 0.004051828608343507, "phrase": "surface_quality"}, {"score": 0.003907212558276185, "phrase": "tool_life"}, {"score": 0.003683097597914604, "phrase": "general_descriptive_reference_model"}, {"score": 0.0036332251283046997, "phrase": "milling_process"}, {"score": 0.003600351201298387, "phrase": "experimental_data"}, {"score": 0.0035677736570659813, "phrase": "thermomechanical_analysis"}, {"score": 0.003535489842686145, "phrase": "statistical_or_artificial_intelligence"}, {"score": 0.0030291453183733897, "phrase": "extensive_literature_survey"}, {"score": 0.002988101395789399, "phrase": "state-of-the-art_modeling_techniques"}, {"score": 0.0028293966058473476, "phrase": "recent_advances"}, {"score": 0.002778385486855157, "phrase": "ai-based_modeling_techniques"}, {"score": 0.0026913130726432645, "phrase": "available_methods"}, {"score": 0.0025716240685409535, "phrase": "corresponding_types"}, {"score": 0.0023694065215394593, "phrase": "open_research_challenges"}, {"score": 0.0022847009758393405, "phrase": "comprehensive_comparison"}, {"score": 0.0022640009579466924, "phrase": "recent_developments"}], "paper_keywords": ["Artificial intelligence (AI)", " high speed machining (HSM)", " milling process", " modeling techniques"], "paper_abstract": "The process of high speed milling is regarded as one of the most sophisticated and complicated manufacturing operations. In the past four decades, many investigations have been conducted on this process, aiming to better understand its nature and improve the surface quality of the products as well as extending tool life. To achieve these goals, it is necessary to form a general descriptive reference model of the milling process using experimental data, thermomechanical analysis, statistical or artificial intelligence (AI) models. Moreover, increasing demands for more efficient milling processes, qualified surface finishing, and modeling techniques have propelled the development of more effective modeling methods and approaches. In this paper, an extensive literature survey of the state-of-the-art modeling techniques of milling processes will be carried out, more specifically of recent advances and applications of AI-based modeling techniques. The comparative study of the available methods as well as the suitability of each method for corresponding types of experiments will be presented. In addition, the weaknesses of each method as well as open research challenges will be presented. Therefore, a comprehensive comparison of recent developments in the field will be a guideline for choosing the most suitable modeling technique for this process regarding its goals, conditions, and specifications.", "paper_title": "A Survey on Artificial Intelligence-Based Modeling Techniques for High Speed Milling Processes", "paper_id": "WOS:000356714100038"}