{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "personalized_t-learning"}, {"score": 0.0047797212183363835, "phrase": "interactive_digital_tv"}, {"score": 0.004744748477093856, "phrase": "new_learning_possibilities"}, {"score": 0.00471003041684707, "phrase": "new_forms"}, {"score": 0.004296809240805996, "phrase": "tv_learning"}, {"score": 0.0038909934410379775, "phrase": "learning_experience"}, {"score": 0.003668768542734106, "phrase": "personalized_experience"}, {"score": 0.0035233696341819437, "phrase": "new_approach"}, {"score": 0.003334309053314909, "phrase": "tv_programs"}, {"score": 0.003261547125192671, "phrase": "personalized_way"}, {"score": 0.0031669873302916, "phrase": "playful_nature"}, {"score": 0.0030414140732789186, "phrase": "tv_viewers"}, {"score": 0.0025678829712650437, "phrase": "adl_scorm_standard"}, {"score": 0.002511803988580901, "phrase": "adaptive_add-ons"}, {"score": 0.0023768935613577985, "phrase": "intelligent_tutoring_system"}, {"score": 0.0022909940601580675, "phrase": "t-learning_experiences"}, {"score": 0.002265833357217618, "phrase": "semantic_knowledge"}, {"score": 0.002128376306688074, "phrase": "adaptive_courses"}, {"score": 0.0021049977753042253, "phrase": "minimal_technical_background"}], "paper_keywords": ["T-learning", " Edutainment", " SCORM", " Personalization", " Adaptation"], "paper_abstract": "Interactive Digital TV opens new learning possibilities where new forms of education are needed. On the one hand, the combination of education and entertainment is essential to boost the participation of viewers in TV learning (t-learning), overcoming their typical passiveness. On the other hand, researchers broadly agree that in order to prevent the learner from abandoning the learning experience, it is necessary to take into account his/her particular needs and preferences by means of a personalized experience. Bearing this in mind, this paper introduces a new approach to the conception of personalized t-learning: edutainment and entercation experiences. These experiences combine TV programs and learning contents in a personalized way, with the aim of using the playful nature of TV to make learning more attractive and to engage TV viewers in learning. This paper brings together our work in constructing edutainment/entercation experiences by relating TV and learning contents. Taking personalization one step further, we propose the adaptation of learning contents by defining A-SCORM (Adaptive-SCORM), an extension of the ADL SCORM standard. Over and above the adaptive add-ons, this paper focuses on two fundamental entities for the proposal: (1) an Intelligent Tutoring System, called T-MAESTRO, which constructs the t-learning experiences by applying semantic knowledge about the t-learners; and (2) the authoring tool which allow teachers to create adaptive courses with a minimal technical background.", "paper_title": "T-MAESTRO and its authoring tool: using adaptation to integrate entertainment into personalized t-learning", "paper_id": "WOS:000260068700005"}