{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "research_fields"}, {"score": 0.022228769768857397, "phrase": "slovenia"}, {"score": 0.009065497979075821, "phrase": "major_research_fields"}, {"score": 0.004781925456434786, "phrase": "scopus"}, {"score": 0.004636027593561925, "phrase": "national_research_evaluation"}, {"score": 0.004342430078306461, "phrase": "user_interface"}, {"score": 0.004081385289516914, "phrase": "national_production"}, {"score": 0.0037965243835456214, "phrase": "standardized_classification"}, {"score": 0.003667925754747227, "phrase": "entire_country"}, {"score": 0.0031845067058084613, "phrase": "complex_algorithms"}, {"score": 0.003151736708029235, "phrase": "slovenian_cobiss_bibliographic_system"}, {"score": 0.003130077012135034, "phrase": "sicris_research_system"}, {"score": 0.003097865379563127, "phrase": "subject_areas"}, {"score": 0.0029416973901327925, "phrase": "major_differences"}, {"score": 0.002881450787481037, "phrase": "database-specific_subject_schemes"}, {"score": 0.00271735110571002, "phrase": "indexed_documents"}, {"score": 0.0025892330566358503, "phrase": "social_sciences"}, {"score": 0.0025014259919355453, "phrase": "least_citations"}, {"score": 0.002408265305704217, "phrase": "medical_and_natural_sciences"}, {"score": 0.002375253757224999, "phrase": "similar_counts"}, {"score": 0.0022015970225369975, "phrase": "established_differences"}, {"score": 0.0021490449563443025, "phrase": "slovenian_research_funding_agency"}], "paper_keywords": ["Bibliometrics", " Citation analysis", " Research performance", " Research evaluation", " Research fields", " Research information systems", " Slovenia"], "paper_abstract": "Web of Science (wos) and scopus have often been compared with regard to user interface, countries, institutions, author sets, etc., but rarely employing a more systematic assessment of major research fields and national production. The aim of this study was to appraise the differences among major research fields in scopus and wos based on a standardized classification of fields and assessed for the case of an entire country (Slovenia). We analyzed all documents and citations received by authors who were actively engaged in research in Slovenia between 1996 and 2011 (50,000 unique documents by 10,000 researchers). Documents were tracked and linked to scopus and wos using complex algorithms in the Slovenian cobiss bibliographic system and sicris research system where the subject areas or research fields of all documents are harmonized by the Frascati/oecd classification, thus offsetting some major differences between wos and scopus in database-specific subject schemes as well as limitations of deriving data directly from databases. scopus leads over wos in indexed documents as well as citations in all research fields. This is especially evident in social sciences, humanities, and engineering & technology. The least citations per document were received in humanities and most citations in medical and natural sciences, which exhibit similar counts. Engineering & technology reveals only half the citations per document compared to the previous two fields. Agriculture is found in the middle. The established differences between databases and research fields provide the Slovenian research funding agency with additional criteria for a more balanced evaluation of research.", "paper_title": "Assessment of research fields in Scopus and Web of Science in the view of national research evaluation in Slovenia", "paper_id": "WOS:000330622600044"}