{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "frequent_closed_partial_orders"}, {"score": 0.013770002986779006, "phrase": "partial_order"}, {"score": 0.006543824369871332, "phrase": "partial_orders"}, {"score": 0.004647442352794694, "phrase": "sequence_data"}, {"score": 0.004592905436175987, "phrase": "important_problem"}, {"score": 0.004450568197899267, "phrase": "web_mining"}, {"score": 0.004415675459182871, "phrase": "network_management"}, {"score": 0.004363846362238565, "phrase": "intrusion_detection"}, {"score": 0.003817137134650275, "phrase": "biological_sequences"}, {"score": 0.003432044343307207, "phrase": "total_order"}, {"score": 0.003247868216333148, "phrase": "string_database"}, {"score": 0.003073545175760353, "phrase": "novel_problem"}, {"score": 0.002931569771634119, "phrase": "nonredundant_and_interesting_ordering"}, {"score": 0.002897109710213723, "phrase": "string_databases"}, {"score": 0.002807178116892454, "phrase": "meaningful_knowledge"}, {"score": 0.0027307746993761035, "phrase": "previous_data_mining_techniques"}, {"score": 0.00238816839721704, "phrase": "complete_set"}, {"score": 0.0023507916951658455, "phrase": "large_string_databases"}, {"score": 0.002224510044064184, "phrase": "extensive_performance_study"}, {"score": 0.0021983430142660373, "phrase": "real_data_sets"}, {"score": 0.002181069180139225, "phrase": "synthetic_data_sets"}], "paper_keywords": ["frequent patterns", " closed patterns", " partial orders", " strings", " data mining"], "paper_abstract": "Mining knowledge about ordering from sequence data is an important problem with many applications, such as bioinformatics, Web mining, network management, and intrusion detection. For example, if many customers follow a partial order in their purchases of a series of products, the partial order can be used to predict other related customers' future purchases and develop marketing campaigns. Moreover, some biological sequences ( e. g., microarray data) can be clustered based on the partial orders shared by the sequences. Given a set of items, a total order of a subset of items can be represented as a string. A string database is a multiset of strings. In this paper, we identify a novel problem of mining frequent closed partial orders from strings. Frequent closed partial orders capture the nonredundant and interesting ordering information from string databases. Importantly, mining frequent closed partial orders can discover meaningful knowledge that cannot be disclosed by previous data mining techniques. However, the problem of mining frequent closed partial orders is challenging. To tackle the problem, we develop Frecpo ( for Frequent closed partial order), a practically efficient algorithm for mining the complete set of frequent closed partial orders from large string databases. Several interesting pruning techniques are devised to speed up the search. We report an extensive performance study on both real data sets and synthetic data sets to illustrate the effectiveness and the efficiency of our approach.", "paper_title": "Discovering frequent closed partial orders from strings", "paper_id": "WOS:000240544500003"}