{"auto_keywords": [{"score": 0.04482161025008408, "phrase": "document_navigation"}, {"score": 0.044390186309013854, "phrase": "touch-based_mobile_phones"}, {"score": 0.03515175253429096, "phrase": "shorter_movement_time"}, {"score": 0.004814951205791257, "phrase": "flick"}, {"score": 0.003916098498242888, "phrase": "specific_consideration"}, {"score": 0.0030278017562213265, "phrase": "sitting_posture"}, {"score": 0.0028070431733705735, "phrase": "large_target_distances"}, {"score": 0.002723301730223192, "phrase": "potential_interaction_advantage"}, {"score": 0.0025374674652885354, "phrase": "ring_document"}, {"score": 0.0024247382451294255, "phrase": "anderson_model"}, {"score": 0.002400395912095624, "phrase": "andersen"}, {"score": 0.0023170054862555896, "phrase": "future_scrolling_techniques"}, {"score": 0.0021049977753042253, "phrase": "flick_scrolling"}], "paper_keywords": [""], "paper_abstract": "This study examined the performance of two scrolling techniques (flick and ring) for document navigation in touch-based mobile phones using three input methods (index finger, pen, and thumb), with specific consideration given to two postures: sitting and walking. The findings are as follows: (a) in both sitting and walking postures, for the three input methods, flick resulted in shorter movement time and fewer crossings than ring, suggesting flick is superior to ring for document navigation; (b) for sitting posture, regarding pen and thumb input, ring led to shorter movement time than flick for large target distances, indicating ring has a potential interaction advantage; (c) regarding sitting and walking postures, both flick and ring document scrolling in touch-based mobile phones can be modeled by the Anderson model (Andersen, 2005). Designers of future scrolling techniques should consider these differences, as well as exploit the advantages and avoid the disadvantages of ring and flick scrolling.", "paper_title": "Evaluation of Flick and Ring Scrolling on Touch-Based Smartphones", "paper_id": "WOS:000337576600004"}