{"auto_keywords": [{"score": 0.047193003184155105, "phrase": "lateral_forces"}, {"score": 0.02322730111336097, "phrase": "conducting_pipe"}, {"score": 0.003348513474852869, "phrase": "computational_results"}, {"score": 0.0032850648549389025, "phrase": "experimental_results"}, {"score": 0.0032074366230426727, "phrase": "physical_model"}, {"score": 0.003131637033429892, "phrase": "main_force_coefficients"}, {"score": 0.0030285084113651035, "phrase": "decentration_phenomenon"}, {"score": 0.0029147869733574844, "phrase": "main_parameters"}, {"score": 0.0026742419973883134, "phrase": "key_parameter"}, {"score": 0.0025861368747446324, "phrase": "magnet_motion"}, {"score": 0.002316532084420729, "phrase": "fixed_direction"}, {"score": 0.002145703330831668, "phrase": "first_step"}, {"score": 0.0021049977753042253, "phrase": "complete_motion"}], "paper_keywords": ["Eddy currents", " Magnets", " Velocity", " Finite element methods", " Finite element analysis", " Magnetic devices"], "paper_abstract": "Purpose - The purpose of this paper is to investigate the lateral forces during the fall of a magnet in a conducting pipe, when the direction of magnetization of the magnet is fixed. If the direction of magnetization is not parallel to the axis of the pipe, lateral forces occur and a decentration of the magnet happens. Design/methodology/approach - The problem is studied numerically, with a T - h 3D FE formulation well-suited for the problem. Computational results are compared with experimental results. Findings - The physical model is given and the main force coefficients analyzed. The lateral forces and the decentration phenomenon are studied as a function of the main parameters (thickness and radius of the pipe). Originality/value - The direction of magnetization is a key parameter to analyze the dynamics of a magnet motion inside a conducting pipe, when the radii of the pipe and the magnet are not so close. This analysis with a fixed direction of magnetization allows one to quantify the lateral forces and the decentration, and is a first step to understand the complete motion which includes the rotation which can be linked to the decentration.", "paper_title": "Lateral forces on a magnet falling in a conducting pipe", "paper_id": "WOS:000313535700005"}