{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "university_students'_adaptation"}, {"score": 0.00474946741204285, "phrase": "digital_learner_course_portfolio"}, {"score": 0.004706305193222972, "phrase": "digital_learner_portfolios"}, {"score": 0.004642292792558686, "phrase": "growing_importance"}, {"score": 0.004600100053651545, "phrase": "higher_education"}, {"score": 0.004496280772084575, "phrase": "new_teaching-learning-assessment_methods"}, {"score": 0.004085115444878828, "phrase": "undergraduate_students'_perceptions"}, {"score": 0.003832031470970347, "phrase": "based_courses"}, {"score": 0.0035945701438887282, "phrase": "blended_learning_mode"}, {"score": 0.0032064196784562017, "phrase": "individual_overall_reflection"}, {"score": 0.0029396242707327986, "phrase": "mixed-method_analysis"}, {"score": 0.0027954035431845344, "phrase": "technological_innovation"}, {"score": 0.002634031703695684, "phrase": "positive_opinions"}, {"score": 0.002370955769074803, "phrase": "expected_impact"}, {"score": 0.002163600705898299, "phrase": "personal_developmental_learning_tool"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["ePortfolio", " Higher education", " Teaching/learning strategies", " Evaluation methodologies", " Web-based learning"], "paper_abstract": "Digital learner portfolios are of growing importance in higher education as the sector seeks new teaching-learning-assessment methods which promote students' autonomy as managers of their own virtual learning environment. The purpose of this study was to analyse descriptively the undergraduate students' perceptions, attitudes and behaviour when using an eportfolio to support their learning and assessment in practice based courses at two traditional Spanish universities. The participants were 88 students, who were studying through a blended learning mode. Data were collected through questionnaires: a computer experience survey, another which examined the psychological, pedagogical and technological dimensions of eportfolios use. Further, an individual overall reflection was obtained from each student to help gain an understanding of their experiences of using the eportfolio. A mixed-method analysis was applied in order to study the impact of this technological innovation on students and their satisfaction. The results showed that the students had positive opinions and self-efficiency through the eportfolio as a tool to manage their learning and assessment during a semester. especially from the second month of use. However, the expected impact on their learning was not so significant. Nevertheless, the students emphasised that the eportfolio was valuable as a personal developmental learning tool. (C) 2008 Elsevier Ltd. All rights reserved.", "paper_title": "Investigating university students' adaptation to a digital learner course portfolio", "paper_id": "WOS:000263921400010"}