{"auto_keywords": [{"score": 0.04926459981617614, "phrase": "healthcare_organizations"}, {"score": 0.008185610036202126, "phrase": "secure_protocol"}, {"score": 0.00771178646160513, "phrase": "sensitive_information"}, {"score": 0.006112568779660646, "phrase": "third_party"}, {"score": 0.005290114128539306, "phrase": "protection_model"}, {"score": 0.00481495049065317, "phrase": "k-unlinkable_patient_records"}, {"score": 0.004607084771741802, "phrase": "sensitive_records"}, {"score": 0.004562119304949758, "phrase": "dna_sequences"}, {"score": 0.004528682134292651, "phrase": "publicly_accessible_databanks"}, {"score": 0.004440704276209644, "phrase": "patient_identifiable_information"}, {"score": 0.004311917869277053, "phrase": "identified_patient_information"}, {"score": 0.0042074415316257, "phrase": "patients'organization-visit_patterns"}, {"score": 0.003908898549551755, "phrase": "patient's_record"}, {"score": 0.0036943889039677156, "phrase": "data_protection_certification"}, {"score": 0.003613679475395133, "phrase": "algorithmic_approach"}, {"score": 0.00352606130954801, "phrase": "secure_setting"}, {"score": 0.0034237095589461012, "phrase": "data_holders"}, {"score": 0.00327570726078604, "phrase": "encrypted_state"}, {"score": 0.0031727991081258408, "phrase": "formal_data_protection_model"}, {"score": 0.003095837423068241, "phrase": "extended_form"}, {"score": 0.0029692499675546017, "phrase": "non-secure_setting"}, {"score": 0.0027179630907534884, "phrase": "identified_information"}, {"score": 0.0026520048812910054, "phrase": "proposed_data_protection_model"}, {"score": 0.002574958995690757, "phrase": "organization's_prior_knowledge"}, {"score": 0.0025372773909061717, "phrase": "real_world_hospital_discharge_records"}, {"score": 0.0024817838176977368, "phrase": "additional_suppression"}, {"score": 0.0024696172716958897, "phrase": "patient_information"}, {"score": 0.0024394605757146704, "phrase": "existing_non-secure_approach"}, {"score": 0.002305403026906238, "phrase": "non-secure_protocol"}, {"score": 0.002282850612899642, "phrase": "dna_records"}, {"score": 0.002178696355804523, "phrase": "significant_quantities"}, {"score": 0.0021680124180079954, "phrase": "personal_biomedical_data"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Privacy", " Confidentiality", " Electronic medical records", " Distributed databases", " Anonymization algorithms"], "paper_abstract": "Objectives: Healthcare organizations must adopt measures to uphold their patients' right to anonymity when sharing sensitive records, such as DNA sequences, to publicly accessible databanks. This is often achieved by suppressing patient identifiable information; however, such a practice is insufficient because the same organizations may disclose identified patient information, devoid of the sensitive information, for other purposes and patients'organization-visit patterns, or trails, can re-identify records to the identities from which they were derived. There exist various algorithms that healthcare organizations can apply to ascertain when a patient's record is susceptible to trail re-identification, but they require organizations to exchange information regarding the identities of their patients prior to data protection certification. In this paper, we introduce an algorithmic approach to formally thwart trail re-identification in a secure setting. Methods and materials: We present a framework that allows data holders to securely collaborate through a third party. In doing so, healthcare organizations keep all sensitive information in an encrypted state until the third party certifies that the data to be disclosed satisfies a formal data protection model. The model adopted for this work is an extended form of k-unlinkability, a protection model that, until this work, was applied in a non-secure setting only. Given the framework and protection model, we develop an algorithm to generate data that satisfies the protection model. In doing so, we enable healthcare organizations to prevent trail re-identification without revealing identified information. Results: Theoretically, we prove that the proposed data protection model does not leak information, even in the context of an organization's prior knowledge. Empirically, we use real world hospital discharge records to demonstrate that, while the secure protocol induces additional Suppression of patient information in comparison to an existing non-secure approach, the quantity of data disclosed by the secure protocol remains substantial. For instance, in a population of over 7700 sickle cell anemia patients, the non-secure protocol discloses 99.48% of DNA records whereas the secure protocol permits the disclosure of 99.41%. Conclusions: Our results demonstrate healthcare organizations can collaborate to disclose significant quantities of personal biomedical data without violating their anonymity in the process. (C) 2009 Elsevier B.V. All rights reserved.", "paper_title": "Secure construction of k-unlinkable patient records from distributed providers", "paper_id": "WOS:000274527700003"}