{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "augmented_feedback"}, {"score": 0.010410425422657613, "phrase": "laparoscopic_grasp_control"}, {"score": 0.005151799634197169, "phrase": "two-handed_task"}, {"score": 0.004768649568826951, "phrase": "grasp_force"}, {"score": 0.004677349385487918, "phrase": "tactile_feedback"}, {"score": 0.004205570965859848, "phrase": "learning_curve"}, {"score": 0.004046020290832207, "phrase": "first_experiment"}, {"score": 0.003949377440799037, "phrase": "single-handed_laparoscopic_lifting_task"}, {"score": 0.0036730297909962142, "phrase": "feedback_modes"}, {"score": 0.0035852640843794252, "phrase": "excessive_pinch_force"}, {"score": 0.003516558537200823, "phrase": "second_experiment"}, {"score": 0.0033182152378613767, "phrase": "reduced_attention"}, {"score": 0.003270396852243212, "phrase": "grasp-force_control"}, {"score": 0.003070996252787868, "phrase": "grasp_forces"}, {"score": 0.002925899335792914, "phrase": "retention_test"}, {"score": 0.002630299922281955, "phrase": "required_limits"}, {"score": 0.0021049977753042253, "phrase": "augmented_tactile_feedback"}], "paper_keywords": ["Education", " human performance", " medical simulation", " tactile device"], "paper_abstract": "Little is known about the influence of augmented feedback, on laparoscopic grasp control. To gain more knowledge on the influence of this on the learning curve, two experiments were conducted. In the first experiment, four groups learned a single-handed laparoscopic lifting task. Three groups received augmented feedback (visual, haptic, or a combination of feedback modes) on slip and excessive pinch force. In the second experiment, a two-handed task had to be accomplished to investigate whether paying reduced attention would influence grasp-force control. The surgeons and novices either received tactile feedback or no augmented feedback on grasp forces. In both experiments, learning sessions and a retention test followed a pretest. In the two-handed task, novices who received tactile feedback could control their pinch force in order to remain within the required limits unlike participants who did not receive augmented feedback. Approximately, one-third of the participants who received augmented feedback became dependent on the signal. Regardless of their level of experience, participants benefited from augmented feedback. This research supports the claim that there is a need for augmented tactile feedback when learning laparoscopic grasp control. It enhances learning and goes beyond what could be achieved without.", "paper_title": "The Effect of Augmented Feedback on Grasp Force in Laparoscopic Grasp Control", "paper_id": "WOS:000289472100007"}