{"auto_keywords": [{"score": 0.04807235437558883, "phrase": "memory_hierarchy"}, {"score": 0.015566934506445654, "phrase": "scratch-pad_memory_hierarchy"}, {"score": 0.015216104000938818, "phrase": "decoupled_processors"}, {"score": 0.01487306067339452, "phrase": "scratch-pad_memories"}, {"score": 0.011758577099502874, "phrase": "access_processor"}, {"score": 0.009474557856426974, "phrase": "cache_memory_hierarchies"}, {"score": 0.00919925351884041, "phrase": "uniprocessor_architectures"}, {"score": 0.00481495049065317, "phrase": "decoupled_processors_architecture_for_accelerating_data_intensive"}, {"score": 0.00422082596936636, "phrase": "address_computation"}, {"score": 0.004179328666330398, "phrase": "data_processing"}, {"score": 0.00384894851099016, "phrase": "low_energy"}, {"score": 0.003748823861741978, "phrase": "system's_performance"}, {"score": 0.0037119497772861165, "phrase": "application_code"}, {"score": 0.003407141079879243, "phrase": "application_data"}, {"score": 0.0033514495661346524, "phrase": "execute_processor"}, {"score": 0.0032858160838749196, "phrase": "limited_address_space"}, {"score": 0.003086311260099341, "phrase": "execute_processor's_register_file"}, {"score": 0.0030059656149799122, "phrase": "dma_units"}, {"score": 0.002927705457700311, "phrase": "traditional_uniprocessors"}, {"score": 0.002908459938852865, "phrase": "existing_decoupled_processors"}, {"score": 0.0026959995147791188, "phrase": "existing_decoupled_architectures"}, {"score": 0.002450039362463466, "phrase": "memory_latency"}, {"score": 0.002433926157079375, "phrase": "memory_management_techniques"}, {"score": 0.002386218074955624, "phrase": "fixed_prefetching_methods"}, {"score": 0.0023705236064200893, "phrase": "experimental_results"}, {"score": 0.002161313898853851, "phrase": "proposed_architecture"}, {"score": 0.0021049977753042253, "phrase": "energy_delay_product_costs"}], "paper_keywords": ["Decoupled", " Scratch pad"], "paper_abstract": "We present an architecture of decoupled processors with a memory hierarchy consisting only of scratch-pad memories, and a main memory. This architecture exploits the more efficient pre-fetching of Decoupled processors, that make use of the parallelism between address computation and application data processing, which mainly exists in streaming applications. This benefit combined with the ability of scratch-pad memories to store data with no conflict misses and low energy per access contributes significantly for increasing the system's performance. The application code is split in two parallel programs the first runs on the Access processor and computes the addresses of the data in the memory hierarchy. The second processes the application data and runs on the Execute processor, a processor with a limited address space-just the register file addresses. Each transfer of any block in the memory hierarchy up to the Execute processor's register file is controlled by the Access processor and the DMA units. This strongly differentiates this architecture from traditional uniprocessors and existing decoupled processors with cache memory hierarchies. The architecture is compared in performance with uniprocessor architectures with (a) scratch-pad and (b) cache memory hierarchies and (c) the existing decoupled architectures, showing its higher normalized performance. The reason for this gain is the efficiency of data transferring that the scratch-pad memory hierarchy provides combined with the ability of the Decoupled processors to eliminate memory latency using memory management techniques for transferring data instead of fixed prefetching methods. Experimental results show that the performance is increased up to almost 2 times compared to uniprocessor architectures with scratch-pad and up to 3.7 times compared to the ones with cache. The proposed architecture achieves the above performance without having penalties in energy delay product costs.", "paper_title": "Decoupled Processors Architecture for Accelerating Data Intensive Applications using Scratch-Pad Memory Hierarchy", "paper_id": "WOS:000276185000005"}