{"auto_keywords": [{"score": 0.03763429310267491, "phrase": "inconsistent_quality"}, {"score": 0.022791303713768522, "phrase": "e-service_quality"}, {"score": 0.02161260887793083, "phrase": "customer_relationships"}, {"score": 0.009031295543040522, "phrase": "multichannel_services"}, {"score": 0.00481495049065317, "phrase": "channel_quality_inconsistency"}, {"score": 0.00456159659731398, "phrase": "prior_studies"}, {"score": 0.004031238480458909, "phrase": "online_and_offline_services"}, {"score": 0.0038934666267504596, "phrase": "perceived_quality"}, {"score": 0.003804234575698981, "phrase": "customer_distrust"}, {"score": 0.003760385494931853, "phrase": "service_provider"}, {"score": 0.003427246079774314, "phrase": "university_context"}, {"score": 0.0033228699494959172, "phrase": "web_survey"}, {"score": 0.003246672441842787, "phrase": "physical_and_e-service_experiences"}, {"score": 0.002981885091155911, "phrase": "hypothesized_associations"}, {"score": 0.0029361086955646625, "phrase": "regression_analysis"}, {"score": 0.002792119634261638, "phrase": "different_impacts"}, {"score": 0.002624533657819515, "phrase": "positive_disconfirmation_group"}, {"score": 0.0023099082804523044, "phrase": "different_cross-channel_quality_inconsistency_conditions"}, {"score": 0.002205079358459154, "phrase": "expectancy_disconfirmation_theory"}, {"score": 0.0021796224306652326, "phrase": "multichannel_service_context"}, {"score": 0.0021213575697367148, "phrase": "moderating_effect"}, {"score": 0.0021049977753042253, "phrase": "cross-channel_quality_inconsistency"}], "paper_keywords": ["E-service", " Quality inconsistency", " Quality management", " Supply chain management", " Channel management", " SERVQUAL", " Customer relationship", " Taiwan"], "paper_abstract": "Purpose - Based on prior studies, the performance of customer relationships depends highly on the characteristics of the e-service. However, the strength of this association can be impacted when businesses employ multichannel services (e.g. offering online and offline services). With multichannel services, any inconsistency in perceived quality across channels may result in customer distrust toward a service provider. The purpose of this study is to investigate the effect of inconsistent quality on the association between e-service quality and customer relationships in a university context. Design/methodology/approach - This study conducted a web survey and 318 respondents who have both physical and e-service experiences were collected. The inconsistent quality across channels was divided into three groups by k-means clustering approach. Next, the hypothesized associations were analyzed using regression analysis based on three groups. Findings - The results show that inconsistent quality has different impacts on the association between e-service quality and customer relationships across the three groups. Especially in the positive disconfirmation group, the investment in e-services will be in vain because certain e-service sub-constructs lose their impact on customer relationships. Practical implications - The findings of this study provide implications for improving customer relationships under different cross-channel quality inconsistency conditions for managers. Originality/value - This study extends the concept of expectancy disconfirmation theory to the multichannel service context and pioneers the exploration of the moderating effect of cross-channel quality inconsistency in customer relationships, contributing to the understanding of the literature about the impacts of inconsistent quality on customer relationships.", "paper_title": "The effect of channel quality inconsistency on the association between e-service quality and customer relationships", "paper_id": "WOS:000295751600004"}