{"auto_keywords": [{"score": 0.04896221231267544, "phrase": "near-gathering_problem"}, {"score": 0.008713768692145006, "phrase": "autonomous_mobile_robots"}, {"score": 0.00804882907011491, "phrase": "limited_visibility"}, {"score": 0.006304158178255729, "phrase": "unlimited_visibility"}, {"score": 0.004661176995136095, "phrase": "finite_set"}, {"score": 0.004394005938106429, "phrase": "euclidean_plane"}, {"score": 0.004368142221528535, "phrase": "look-compute-move_cycles"}, {"score": 0.0028885579903645043, "phrase": "finite_time"}, {"score": 0.002821044196775531, "phrase": "reasonable_conditions"}, {"score": 0.0027961342030212353, "phrase": "input_configuration"}, {"score": 0.002566364701535499, "phrase": "north\"_direction"}, {"score": 0.0024333239726872604, "phrase": "clockwise_direction"}, {"score": 0.0022070310530794097, "phrase": "generic_task"}, {"score": 0.0021490449563443025, "phrase": "termination_detection"}, {"score": 0.0021049977753042253, "phrase": "total_number"}], "paper_keywords": [""], "paper_abstract": "In this paper we study the Near-Gathering problem for a finite set of dimensionless, deterministic, asynchronous, anonymous, oblivious and autonomous mobile robots with limited visibility moving in the Euclidean plane in Look-Compute-Move cycles. In this problem, the robots have to get close enough to each other, so that every robot can see all the others, without touching (i.e., colliding with) any other robot. The importance of solving the Near-Gathering problem is that it makes it possible to overcome the restriction of having robots with limited visibility. Hence it allows to exploit all the studies (the majority, actually) done on this topic in the unlimited visibility setting. Indeed, after the robots get close enough to each other, they are able to see all the robots in the system, a scenario that is similar to the one where the robots have unlimited visibility. We present the first (deterministic) algorithm for the Near-Gathering problem, to the best of our knowledge, which allows a set of autonomous mobile robots to nearly gather within finite time without ever colliding. Our algorithm assumes some reasonable conditions on the input configuration (the Near-Gathering problem is easily seen to be unsolvable in general). Further, all the robots are assumed to have a compass (hence they agree on the \"North\" direction), but they do not necessarily have the same handedness (hence they may disagree on the clockwise direction). We also show how the robots can detect termination, i.e., detect when the Near-Gathering problem has been solved. This is crucial when the robots have to perform a generic task after having nearly gathered. We show that termination detection can be obtained even if the total number of robots is unknown to the robots themselves (i.e., it is not a parameter of the algorithm), and robots have no way to explicitly communicate.", "paper_title": "Getting close without touching: near-gathering for autonomous mobile robots", "paper_id": "WOS:000361993800004"}