{"auto_keywords": [{"score": 0.04057363325580822, "phrase": "compatibility_constraints"}, {"score": 0.03480136597681605, "phrase": "top-k_packages"}, {"score": 0.00481495049065317, "phrase": "package_recommendation_problems._recommendation_systems"}, {"score": 0.004224911726496726, "phrase": "recommendation_systems"}, {"score": 0.003920674807745575, "phrase": "item_selections"}, {"score": 0.0031919592786945126, "phrase": "top-k_items"}, {"score": 0.0031475032122226, "phrase": "special_case"}, {"score": 0.0029069972482610403, "phrase": "top-k_recommendation"}, {"score": 0.0027100527874262446, "phrase": "function_problems"}, {"score": 0.002550165781755603, "phrase": "user's_criteria"}, {"score": 0.002456486927713543, "phrase": "upper_and_lower_bounds"}, {"score": 0.0023551955270737215, "phrase": "combined_and_data_complexity"}, {"score": 0.0022686625017583387, "phrase": "variable_sizes"}, {"score": 0.0021347607855562102, "phrase": "query_languages"}, {"score": 0.0021049977753042253, "phrase": "selection_criteria"}], "paper_keywords": ["recommendation problems", " complexity"], "paper_abstract": "Recommendation systems aim to recommend items that are likely to be of interest to users. This paper investigates several issues fundamental to such systems: (1) We model recommendation systems for packages (sets) of items. We use queries to specify multicriteria for item selections and express compatibility constraints on items in a package, and use functions to compute the cost and usefulness of items to a user. (2) We study recommendations of points of interest to suggest top-k packages. We also investigate recommendations of top-k items as a special case. (3) We identify several problems to decide whether a set of packages makes a top-k recommendation and whether a rating bound is maximum for selecting top-k packages. We also study function problems for computing top-k packages, and counting problems to find how many packages meet the user's criteria. (4) We establish the upper and lower bounds of these problems, all matching, for combined and data complexity. These results reveal the impact of variable sizes of packages, the presence of compatibility constraints, and a variety of query languages for specifying selection criteria and compatibility constraints on the analyses of these problems.", "paper_title": "ON THE COMPLEXITY OF PACKAGE RECOMMENDATION PROBLEMS", "paper_id": "WOS:000328889100007"}