{"auto_keywords": [{"score": 0.0500784763732991, "phrase": "polarity_designs"}, {"score": 0.04986136992355376, "phrase": "jungnickel"}, {"score": 0.04964516607195234, "phrase": "tonchev"}, {"score": 0.015509844760882395, "phrase": "des"}, {"score": 0.015439132016255396, "phrase": "codes_cryptogr"}, {"score": 0.01449539884578761, "phrase": "classical_designs"}, {"score": 0.014076781852190733, "phrase": "prime_power_q"}, {"score": 0.004548610577281698, "phrase": "non-classical_designs"}, {"score": 0.00422899036681456, "phrase": "thousand_yen"}, {"score": 0.003985843791021747, "phrase": "new_invariants"}, {"score": 0.0039677274392044565, "phrase": "simple_incidence_structures"}, {"score": 0.0039049636662127993, "phrase": "geometric_description"}, {"score": 0.0038257184444461193, "phrase": "projective_geometries"}, {"score": 0.0035084137585876256, "phrase": "suitable_subspace"}, {"score": 0.0034607684429991898, "phrase": "new_invariant"}, {"score": 0.003336843238797791, "phrase": "smallest_value"}, {"score": 0.0032616462517547477, "phrase": "n-dimensional_projective_geometry"}, {"score": 0.0031162820880119226, "phrase": "smallest_possible_geometric_dimension"}, {"score": 0.002970596256310766, "phrase": "general_bounds"}, {"score": 0.002699284111178031, "phrase": "classical_parameters"}, {"score": 0.0024359621870898743, "phrase": "thousand_currency_sign"}, {"score": 0.0022592942418307787, "phrase": "polarity_design"}, {"score": 0.002114627097137586, "phrase": "special_case"}, {"score": 0.0021049977753042253, "phrase": "\"natural\"_embeddings"}], "paper_keywords": ["Design", " Projective space", " Polarity", " Linear code", " Embedding theorems"], "paper_abstract": "Jungnickel and Tonchev (Des. Codes Cryptogr. 51:131-140, [11]) used polarities of PG(2d - 1, q) to construct non-classical designs with a hyperplane and the same parameters and same intersection numbers as the classical designs PG (d) (2d, q), for every prime power q and every integer d a parts per thousand yen 2. Our main result shows that these properties already characterize their polarity designs. Recently, Jungnickel and Tonchev (Des. Codes Cryptogr. [14] introduced new invariants for simple incidence structures , which admit both a coding theoretic and a geometric description. Geometrically, one considers embeddings of into projective geometries I = PG(n, q), where an embedding means identifying the points of with a point set V in I in such a way that every block of is induced as the intersection of V with a suitable subspace of I . Then the new invariant-which we shall call the geometric dimension geomdim (q) of -is the smallest value of n for which may be embedded into the n-dimensional projective geometry PG(n, q). The classical designs PG (d) (n, q) always have the smallest possible geometric dimension among all designs with the same parameters, namely n, and are actually characterized by this property. We give general bounds for geomdim (q) whenever is one of the (exponentially many) \"distorted\" designs constructed in Jungnickel and Tonchev (Des. Codes Cryptogr. 51:131-140, [11]; Des. Codes Cryptogr. 55:131-140, [12]-a class of designs with classical parameters which includes the polarity designs as a very special case. We also show that this class contains designs with the same parameters as PG (d) (n, q) and geomdim (q) , for every prime power q and for all values of d and n with 2 a parts per thousand currency sign d a parts per thousand currency sign n-1. Regarding the polarity designs, we conjecture that their geometric dimension always satisfies our general upper bound with equality, that is, geomdim (q) for the polarity design with the parameters of PG (d) (2d, q), but we are only able to establish this result if we restrict ourselves to the special case of \"natural\" embeddings.", "paper_title": "Remarks on polarity designs", "paper_id": "WOS:000335983500002"}