{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "usability_functionalities"}, {"score": 0.04497733177139571, "phrase": "core_functionality"}, {"score": 0.00477190623242136, "phrase": "web_applications"}, {"score": 0.004729447238832091, "phrase": "usability"}, {"score": 0.0046659637258752535, "phrase": "software_system_quality_attribute"}, {"score": 0.004582897918101983, "phrase": "usability_issues"}, {"score": 0.004401342842183475, "phrase": "user_interface"}, {"score": 0.0038810583785936505, "phrase": "abort_operation"}, {"score": 0.00374399358035391, "phrase": "inductive_process"}, {"score": 0.003660788124282824, "phrase": "reusable_elements"}, {"score": 0.003595552309967789, "phrase": "selected_functionalities"}, {"score": 0.0035473867669654174, "phrase": "communication_purposes"}, {"score": 0.003437486158494063, "phrase": "design_and_programming_patterns"}, {"score": 0.003406738705126797, "phrase": "php"}, {"score": 0.003376216637892373, "phrase": "vb.net"}, {"score": 0.0030307927228223883, "phrase": "pattern_understanding"}, {"score": 0.0029767499830258754, "phrase": "pattern_use"}, {"score": 0.002897482096228207, "phrase": "final_result"}, {"score": 0.0027206133859493725, "phrase": "identified_solutions"}], "paper_keywords": ["Software engineering", " Design patterns", " Programming patterns"], "paper_abstract": "Usability is a software system quality attribute. There are usability issues that have an impact not only on the user interface but also on the core functionality of applications. In this paper, three web applications were developed to discover patterns for implementing two usability functionalities with an impact on core functionality: Abort Operation and Progress Feedback. We applied an inductive process in order to identify reusable elements to implement the selected functionalities. For communication purposes, these elements are specified as design and programming patterns (PHP, VB.NET and Java). Another two web applications were developed in order to evaluate the patterns. The evaluation explores several issues such as ease of pattern understanding and ease of pattern use, as well as the final result of the applications. We found that it is feasible to reuse the identified solutions specified as patterns. The results also show that usability functionalities have features, like the level of coupling with the application or the complexity of each component of the solution, that simplify or complicate their implementation. In this case, the Abort Operation functionality turned out to be more feasible to implement than the Progress Feedback functionality. (c) 2015 Elsevier Inc. All rights reserved.", "paper_title": "Design and programming patterns for implementing usability functionalities in web applications", "paper_id": "WOS:000355707300008"}