{"auto_keywords": [{"score": 0.004600100053651545, "phrase": "future_distributed_systems"}, {"score": 0.004435112270935294, "phrase": "computational_burden"}, {"score": 0.004276016541197123, "phrase": "peer_nodes"}, {"score": 0.004122604238556912, "phrase": "decentralized_systems"}, {"score": 0.003660879039645457, "phrase": "decentralized_applications"}, {"score": 0.0036275736378775757, "phrase": "data_replication_techniques"}, {"score": 0.0035294580355761506, "phrase": "data_replication"}, {"score": 0.0034027387694902287, "phrase": "multiple_peers"}, {"score": 0.0031627430133087616, "phrase": "safe_communication"}, {"score": 0.002926212333939311, "phrase": "actual_behaviour"}, {"score": 0.0026704265616705023, "phrase": "peer_trustworthiness"}, {"score": 0.002610043728801011, "phrase": "simulation_results"}, {"score": 0.002539379289856756, "phrase": "first_system"}, {"score": 0.0025162511343171, "phrase": "replication_factor"}, {"score": 0.0023818288346547692, "phrase": "replication_percentage"}, {"score": 0.0023173287402646577, "phrase": "peer_parameters"}, {"score": 0.0022857351723674004, "phrase": "second_system"}, {"score": 0.002105002791163301, "phrase": "elsevier"}], "paper_keywords": ["P2P", " Data replication", " Fuzzy system", " JXTA-Overlay", " Trustworthiness"], "paper_abstract": "P2P systems are very important for future distributed systems and applications. In such systems, the computational burden of the system can be distributed to peer nodes of the system. Therefore, in decentralized systems users become themselves actors by sharing, contributing and controlling the resources of the system. This characteristic makes P2P systems very interesting for the development of decentralized applications. Data replication techniques are commonplace in P2P systems. Data replication means storing copies of the same data at multiple peers thus improving availability and scalability. The trustworthiness of peers also is very important for safe communication in P2P system. The trustworthiness of a peer can be evaluated based on the reputation and actual behaviour of peers to provide services to other peers. In this paper, we propose two fuzzy-based systems for data replication and peer trustworthiness for JXTA-Overlay P2P platform. The simulation results have shown that in the first system, replication factor increases proportionally with increase of number of documents per peer, replication percentage and scale of replication per peer parameters and the second system can be used successfully to select the most reliable peer candidate to execute the tasks. (C) 2012 Elsevier B. V. All rights reserved.", "paper_title": "P2P data replication and trustworthiness for a JXTA-Overlay P2P system using fuzzy logic", "paper_id": "WOS:000311506900028"}