{"auto_keywords": [{"score": 0.04668643858033422, "phrase": "alignment_accuracy"}, {"score": 0.00481495049065317, "phrase": "bioinformatics_consistency-based_multiple_sequence_alignment_tools"}, {"score": 0.004777917315737992, "phrase": "multiple_sequence_alignment"}, {"score": 0.004741212686496145, "phrase": "msa"}, {"score": 0.004632597963417253, "phrase": "wide_range"}, {"score": 0.004561799879705589, "phrase": "bioinformatics"}, {"score": 0.004422827355213055, "phrase": "main_metric"}, {"score": 0.004304856672196293, "phrase": "msa_tools"}, {"score": 0.004173865018011237, "phrase": "sequencing_data"}, {"score": 0.00398478333092707, "phrase": "larger_datasets"}, {"score": 0.0038485929962942776, "phrase": "new_requirements"}, {"score": 0.0037170399498025215, "phrase": "high-performance_computing"}, {"score": 0.0034941337957136013, "phrase": "hpc_techniques"}, {"score": 0.0030401074516310184, "phrase": "different_alignments"}, {"score": 0.002879872305061576, "phrase": "resulting_tool"}, {"score": 0.0027386335451725762, "phrase": "also_the_number"}, {"score": 0.002382541887825168, "phrase": "presented_methods"}, {"score": 0.0022308329460335985, "phrase": "similar_algorithms"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Multiple Sequence Alignments", " Consistency", " T-Coffee", " High Performance Computing", " Scalability", " Accuracy"], "paper_abstract": "Multiple Sequence Alignment (MSA) is essential for a wide range of applications in Bioinformatics. Traditionally, the alignment accuracy was the main metric used to evaluate the goodness of MSA tools. However, with the growth of sequencing data, other features, such as performance and the capacity to align larger datasets, are gaining strength. To achieve these new requirements, without affecting accuracy, the use of high-performance computing (HPC) resources and techniques is crucial. In this paper, we apply HPC techniques in T-Coffee, one of the more accurate but less scalable MSA tools. We integrate three innovative solutions into T-Coffee: the Balanced Guide Tree to increase the parallelism/performance, the Optimized Library Method with the aim of enhancing the scalability and the Multiple Tree Alignment, which explores different alignments in parallel to improve the accuracy. The results obtained show that the resulting tool, MTA-TCoffee, is able to improve the scalability in both the execution time and also the number of sequences to be aligned. Furthermore, not only is the alignment accuracy not affected by these improvements, as would be expected, but it improves significantly. Finally, we emphasize that the presented methods are not just restricted to T-Coffee, but may be implemented in any other alignment tools that use similar algorithms (progressive alignment, consistency or guide trees). (C) 2014 Elsevier B.V. All rights reserved.", "paper_title": "High Performance computing improvements on bioinformatics consistency-based multiple sequence alignment tools", "paper_id": "WOS:000351561300003"}