{"auto_keywords": [{"score": 0.004361428012479218, "phrase": "pivotal_issue"}, {"score": 0.004020066537823032, "phrase": "small_subset"}, {"score": 0.003961283769828295, "phrase": "minerva"}, {"score": 0.0037487368769596814, "phrase": "keyword_query"}, {"score": 0.0036411406244705557, "phrase": "query_routing_work"}, {"score": 0.00357806560856829, "phrase": "disjoint_data_sets"}, {"score": 0.003435092524339692, "phrase": "peers'_data_collections"}, {"score": 0.0033170847930578473, "phrase": "popular_documents"}, {"score": 0.0029349892964423197, "phrase": "information_retrieval_engines"}, {"score": 0.002736694413701639, "phrase": "comprehensive_evaluation"}, {"score": 0.0027049694095434905, "phrase": "appropriate_overlap_estimators"}, {"score": 0.0024640253074497114, "phrase": "integrated_quality_novelty"}, {"score": 0.0022576249214220187, "phrase": "overlap_estimation"}, {"score": 0.0021297010898172534, "phrase": "performance_evaluation"}], "paper_keywords": [""], "paper_abstract": "We consider a collaboration of peers autonomously crawling the Web. A pivotal issue when designing a peer-to-peer (P2P) Web search engine in this environment is query routing: selecting a small subset of (a potentially very large number of relevant) peers to contact to satisfy a keyword query. Existing approaches for query routing work well on disjoint data sets. However, naturally, the peers' data collections often highly overlap, as popular documents are highly crawled. Techniques for estimating the cardinality of the overlap between sets, designed for and incorporated into information retrieval engines are very much lacking. In this paper we present a comprehensive evaluation of appropriate overlap estimators, showing how they can be incorporated into an efficient, iterative approach to query routing, coined Integrated Quality Novelty (IQN). We propose to further enhance our approach using histograms, combining overlap estimation with the available score/ranking information. Finally, we conduct a performance evaluation in MINERVA, our prototype P2P Web search engine.", "paper_title": "IQN routing: Integrating quality and novelty in P2P querying and ranking", "paper_id": "WOS:000237081600012"}