{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "wireless_fountain_coding"}, {"score": 0.03767407563899196, "phrase": "modified_b-ack_scheme"}, {"score": 0.026886425900939044, "phrase": "wireless_channel"}, {"score": 0.025979599489653175, "phrase": "hybrid_scheme"}, {"score": 0.004685375117376838, "phrase": "wireline-cum-wifi_networks"}, {"score": 0.0045415338200109345, "phrase": "performance_models"}, {"score": 0.004506265705673849, "phrase": "delay-sensitive_uplink_media"}, {"score": 0.004436545340717729, "phrase": "wireline-cum-wifi_network"}, {"score": 0.0038106195546165574, "phrase": "similar_manner"}, {"score": 0.003781005930058317, "phrase": "intrasession_random_network_coding"}, {"score": 0.0036505565334886227, "phrase": "fountain_coding"}, {"score": 0.0035108659422301985, "phrase": "wireless_link-layer_delay"}, {"score": 0.003234651283102673, "phrase": "arq"}, {"score": 0.003196960816092101, "phrase": "forward_error_correction"}, {"score": 0.00317212785594439, "phrase": "fec"}, {"score": 0.002810520668490478, "phrase": "video_streaming"}, {"score": 0.0026609940110902666, "phrase": "traditional_b-ack_scheme"}, {"score": 0.0023946630984825207, "phrase": "modified_and_traditional_b-ack_strategies"}], "paper_keywords": ["Integrated wireline and wireless systems", " media streaming", " fountain code", " IEEE 802.11e", " block acknowledgment (B-ACK)", " performance modeling and analysis"], "paper_abstract": "We develop performance models for delay-sensitive uplink media streaming over a wireline-cum-WiFi network. Since the wireless channel is normally a bottleneck for such streaming, we modify the traditional 802.11e block acknowledgment (B-ACK) scheme to work with wireless fountain coding (WFC)-a packet-level coding scheme which codes packets in a similar manner to intrasession random network coding but delivers them in a manner similar to fountain coding. By using this modified B-ACK scheme, protocol complexity and wireless link-layer delay are potentially reduced. We analytically quantify this delay and use it to derive end-to-end packet loss/late probabilities when automatic repeat request (ARQ) and forward error correction (FEC) are jointly employed at the application-layer. We develop an integrated ns-3/EvalVid simulator to validate our models and compare them with the case when the traditional 802.11e B-ACK scheme is employed. Through simulations of video streaming, we observe that the modified B-ACK scheme does not always perform better than the traditional B-ACK scheme in terms of end-to-end packet loss/late probability and video distortion under certain conditions of the wireless channel. This observation leads us to propose a hybrid scheme that switches between the modified and traditional B-ACK strategies according to the conditions of the wireless channel and the number of packets to transmit in a block. Via simulations, we show the benefits of the hybrid scheme when compared to the traditional IEEE 802.11e B-ACK scheme under different network settings.", "paper_title": "Wireless Fountain Coding with IEEE 802.11e Block ACK for Media Streaming in Wireline-cum-WiFi Networks: A Performance Study", "paper_id": "WOS:000293968000005"}