{"auto_keywords": [{"score": 0.04896221231267542, "phrase": "electronic_mail"}, {"score": 0.00481495049065317, "phrase": "new_medium"}, {"score": 0.004647442352794694, "phrase": "newspaper_newsroom"}, {"score": 0.004539005582217305, "phrase": "computer-supported_cooperative_work"}, {"score": 0.004450568197899267, "phrase": "continuously_growing_number"}, {"score": 0.004329630571352367, "phrase": "electronic_media"}, {"score": 0.00414616342377235, "phrase": "impressive_body"}, {"score": 0.003772306776343196, "phrase": "specific_professional_practices"}, {"score": 0.003728000957725218, "phrase": "present_study"}, {"score": 0.003338690782620756, "phrase": "social_and_communicative_processes"}, {"score": 0.0030254743224136273, "phrase": "particular_email_exchanges"}, {"score": 0.002943147037670826, "phrase": "repeated_observations"}, {"score": 0.00281826552772148, "phrase": "newsroom_environment"}, {"score": 0.002426137929553722, "phrase": "important_factors"}, {"score": 0.0023976048394496446, "phrase": "physical_localization"}, {"score": 0.0022509878391826867, "phrase": "time-critical_news_production_process"}, {"score": 0.002181069180139225, "phrase": "significantly_more_complex_picture"}, {"score": 0.0021049977753042253, "phrase": "new_communication_technology"}], "paper_keywords": ["electronic mail", " computer-mediated communication", " workplace studies", " newspaper", " newsroom environment", " ethnographic study"], "paper_abstract": "Within the field of computer-supported cooperative work, there are a continuously growing number of studies of the use of electronic media in groups and organisations. Despite the existence of this impressive body of research, there have been comparatively few in-depth studies of how the computer as a medium of communication is integrated in specific professional practices. The present study examines the role of electronic mail in a medium-sized Swedish newspaper office (newsroom) environment. Using an ethnographic perspective, the study attempts to combine two approaches: it is both focused on the social and communicative processes that are affected by the use of email and oriented toward the messages as such, looking at what kind of interaction is produced through particular email exchanges. Data have been collected during repeated observations, interviews and study of documents and artefacts in the newsroom environment over a period of almost 3 years. The picture that has emerged suggests that it is not the medium as such, but its interaction with other contextual preconditions that is decisive for the effects of the introduction of email. Important factors are the physical localization of co-workers in the near and remote editorial environment as well as their organisational roles in the time-critical news production process. Together, these relationships create a significantly more complex picture than previous studies of what happens when a new communication technology is introduced.", "paper_title": "Making Space for a New Medium: On the Use of Electronic Mail in a Newspaper Newsroom", "paper_id": "WOS:000276848900001"}