{"auto_keywords": [{"score": 0.04838919478929019, "phrase": "earth"}, {"score": 0.0232128645194469, "phrase": "outer_space"}, {"score": 0.00931631166818189, "phrase": "interior_environments"}, {"score": 0.0087581806514732, "phrase": "marc_garneau"}, {"score": 0.004783607451937166, "phrase": "human_experiences"}, {"score": 0.004554917803750564, "phrase": "human_aspects"}, {"score": 0.004062755992847139, "phrase": "astronaut's_perspective"}, {"score": 0.003919303817545274, "phrase": "canadian"}, {"score": 0.0038431888954930083, "phrase": "travis_baldwin"}, {"score": 0.0036833139525138067, "phrase": "usa."}, {"score": 0.0034388914613623857, "phrase": "interior_spatial_environment_characteristics"}, {"score": 0.003231722251475338, "phrase": "social_and_dynamic_human_relationships"}, {"score": 0.003007337114346301, "phrase": "highly_technological_environments"}, {"score": 0.0029682413050825677, "phrase": "human_relations"}, {"score": 0.0027261830963078706, "phrase": "theoretical_and_practical_perspectives"}, {"score": 0.0026907324647716395, "phrase": "garneau"}, {"score": 0.002673186959316847, "phrase": "baldwin"}, {"score": 0.0025534686449215772, "phrase": "complex_and_dynamic_interactions"}, {"score": 0.0022845366011378238, "phrase": "design_factors"}, {"score": 0.0022109570100232352, "phrase": "potential_design_ideas"}, {"score": 0.0021049977753042253, "phrase": "human_social_elements"}], "paper_keywords": [""], "paper_abstract": "In outer space, human experiences interject with technology in ways not experienced on Earth. We will examine the human aspects of living both on Earth and in the interior 0g environment, how technology interacts with astronauts, and how the design of the interior environments in outer space considers the interaction of technology and humanity from an astronaut's perspective. These issues are explored with Marc Garneau, the first Canadian astronaut in outer space, and Travis Baldwin, 0g environment designer, who has worked with astronauts in the USA. Both discuss the complexity of living in space and how the ways that we live on Earth in terms of interior spatial environment characteristics might be interesting to consider. Within interior environments on Earth, function is always affected and mediated by social and dynamic human relationships and people's experience and perceptions. When these experiences are transferred into the 0g environment, small, confined, and highly technological environments augment and intensify human relations. And yet these are rarely considered in the quest for secure, functional environments in space transport or on stations. These issues are discussed from both theoretical and practical perspectives in conversation with Garneau and Baldwin. In the interview with Marc Garneau, the author validates certain theoretical assumptions about the complex and dynamic interactions that occur in space, understanding the ways that astronauts cope in space and become creative in figuring out how to \"mold\" the environment to become their own, and what design factors are important to consider. Finally, examples of potential design ideas for integrating and humanizing the interior 0g space environment are explored and ideas about how to integrate human social elements are proposed.", "paper_title": "The interior spatial environment: dynamic 0g environments and human places", "paper_id": "WOS:000291060600013"}