{"auto_keywords": [{"score": 0.035656999937011956, "phrase": "building_project"}, {"score": 0.004791400910568939, "phrase": "digital_construction"}, {"score": 0.00468685506994605, "phrase": "aec"}, {"score": 0.00450652633216352, "phrase": "greater_efficiency"}, {"score": 0.004322526434936929, "phrase": "denmark"}, {"score": 0.004238516946277247, "phrase": "major_problem"}, {"score": 0.004176592996088243, "phrase": "aec_industry"}, {"score": 0.004125678490281056, "phrase": "digital_construction'"}, {"score": 0.004045497891774198, "phrase": "common_platform"}, {"score": 0.0040158319222538584, "phrase": "digital_information"}, {"score": 0.003986382625001263, "phrase": "digital_integration"}, {"score": 0.003957148430224827, "phrase": "danish_aec_industry"}, {"score": 0.0037861739051606273, "phrase": "'digital_construction'_program"}, {"score": 0.003622559723615179, "phrase": "design_process"}, {"score": 0.003595983996513896, "phrase": "large-scale_building_project"}, {"score": 0.003457493527619119, "phrase": "process_evaluation"}, {"score": 0.003406941144661418, "phrase": "qualitative_case_study"}, {"score": 0.003332490435836449, "phrase": "identified_factors"}, {"score": 0.0030281644993051023, "phrase": "initial_ambitions"}, {"score": 0.003005936203470646, "phrase": "project_actors"}, {"score": 0.0028338679316173374, "phrase": "real-life_project"}, {"score": 0.002711294312908323, "phrase": "different_levels"}, {"score": 0.0025876431604731306, "phrase": "expected_risk"}, {"score": 0.0024514789201503244, "phrase": "organizational_traditions"}, {"score": 0.002433473462558075, "phrase": "digital_tools"}, {"score": 0.0023167624518936713, "phrase": "real-life_practice"}, {"score": 0.0022940991707691713, "phrase": "balancing_acts"}, {"score": 0.002277246986615156, "phrase": "broad_understanding"}, {"score": 0.0022274279181917545, "phrase": "qualitative_and_holistic_studies"}, {"score": 0.0021049977753042253, "phrase": "architectural_and_engineering_practice"}], "paper_keywords": ["Building design process", " Integration of ICT", " Digital construction", " 3D working method", " Effects on practice", " R&D efforts", " Holistic", " Process evaluation"], "paper_abstract": "The Architecture-Engineering-Construction (AEC) industry has been slow in turning the potential of Information and Communication Technologies into greater efficiency and productivity. This is a phenomenon which can be observed in many countries, and in Denmark this issue has been recognized as a major problem for the further development of the AEC industry. The public-private and nationally funded R&D program 'Digital Construction' was initiated in 2003 to establish a common platform for exchanging digital information and stimulating digital integration in the Danish AEC industry. This paper reports on the lessons learned from developing strategies, demands and guidelines in the 'Digital Construction' program and from adapting one of its 'digital foundations', the '3D Working Method', to the design process of the large-scale building project 'The Icelandic National Concert and Conference Centre'. The explorations are based on a process evaluation of the R&D program and a qualitative case study of the building project. The paper reports on identified factors enabling or hindering the adaptation, as well as on the benefits and challenges experienced from using and exchanging 3D object models according to the '3D Working Method'. The paper concludes that the adaptation has been successful due to the initial ambitions of the project actors. Nevertheless, there are still many challenges to be overcome. The findings indicate that the introduction of the '3D Working Method' to the real-life project depended on the success of balancing an array of the factors identified across the R&D program and the different levels within the building project. Three especially crucial balancing acts are explored; first, the power of the 'implementer' versus the expected risk and benefits of implementation, second, the strategies and guidelines within the program versus the resources for learning and the organizational traditions for using digital tools, and third, the level of ambition versus the skills of the users and the potential of the technology to address real-life practice. Mastering these balancing acts requires a broad understanding of both the project and its context. The findings from qualitative and holistic studies as presented in this paper are valuable for building such understanding, and for further learning and improvement regarding strategies for integrating ICT in architectural and engineering practice. (C) 2008 Elsevier Ltd. All rights reserved.", "paper_title": "Wheat did you learn from practice today? Exploring experiences from a Danish R&D effort in digital construction", "paper_id": "WOS:000268427500001"}