{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "virtual_communities"}, {"score": 0.004648609688625397, "phrase": "discussion_boards"}, {"score": 0.0046079260641779755, "phrase": "massive_multiplayer"}, {"score": 0.0045877173513910055, "phrase": "online_role-playing_games"}, {"score": 0.004468304427278713, "phrase": "second_life"}, {"score": 0.00440976345264104, "phrase": "business_world"}, {"score": 0.004146510711518748, "phrase": "consumer_data"}, {"score": 0.003539252646181146, "phrase": "business_activities"}, {"score": 0.0034168317227203206, "phrase": "best_candidates"}, {"score": 0.0032410683344688625, "phrase": "social_contracts"}, {"score": 0.0025106241866273897, "phrase": "critical_mass"}, {"score": 0.0023604768913655463, "phrase": "disillusionment_stage"}, {"score": 0.0023294867572824147, "phrase": "hype_cycle"}, {"score": 0.0022787359717772976, "phrase": "business_use"}, {"score": 0.0022095328812245852, "phrase": "business_practices"}, {"score": 0.0021613897794439227, "phrase": "full_adoption"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Business value", " Information technology", " Online community", " Social contracts", " Trust theory", " Virtual community"], "paper_abstract": "Virtual communities include everything from discussion boards to massive multiplayer online role-playing games and virtual realities such as Second Life. The business world has assumed that virtual communities can be leveraged to provide access to consumers and consumer data. The benefits of this assumption have not always been realized. The purpose of this article is to understand why some business ventures into virtual communities fail and others succeed. Why do virtual communities support certain types of business activities and not others? Which firm activities are the best candidates to benefit from being positioned in virtual communities? The theories of social contracts and trust explain how firms can successfully participate in virtual communities. The theories have implications in the context of transaction-oriented, interest-oriented, relationship-oriented, and fantasy-oriented communities. The value chain provides an instructive background to understand which firm activities are candidates for being included in virtual communities. Success in virtual communities depends on an attitude of contribution, dedication of resources, building a critical mass, and matching community and business needs. Because many social technologies are in the disillusionment stage of the hype cycle, further research in the business use of virtual communities is needed to guide business practices as we move to full adoption. (C) 2009 Elsevier B.V. All rights reserved.", "paper_title": "How can virtual communities create value for business?", "paper_id": "WOS:000273673000008"}