{"auto_keywords": [{"score": 0.009651699171166756, "phrase": "textfacet"}, {"score": 0.004620093797504386, "phrase": "university_of_north_carolina_libraries"}, {"score": 0.0045443671106012405, "phrase": "traditional_library_catalog_interface"}, {"score": 0.004506968388996092, "phrase": "text-based_searching"}, {"score": 0.004360412703519539, "phrase": "facet-based_interface"}, {"score": 0.004253618550301311, "phrase": "users'_search_experiences"}, {"score": 0.0039649719120779066, "phrase": "search_experience"}, {"score": 0.003916098498242888, "phrase": "novice_user"}, {"score": 0.003531474887552889, "phrase": "search_tasks"}, {"score": 0.0030052718739167696, "phrase": "search_interfaces"}, {"score": 0.0028953973490895746, "phrase": "textonly_interface"}, {"score": 0.002643386043540555, "phrase": "search_times"}, {"score": 0.0025361866386341796, "phrase": "textfacet_search_interface"}, {"score": 0.002504880563070155, "phrase": "textonly_search_interface"}, {"score": 0.002393353846080347, "phrase": "search_time"}, {"score": 0.002363806685815014, "phrase": "partially_known_and_exploratory_task_types"}, {"score": 0.0022122603123901114, "phrase": "known_task_type"}, {"score": 0.0021049977753042253, "phrase": "improved_library_catalog_search_interfaces"}], "paper_keywords": [""], "paper_abstract": "In the summer of 2008 all University of North Carolina libraries switched from a traditional library catalog interface supporting text-based searching (TextOnly) to a text and facet-based interface (TextFacet) to improve users' search experiences. This study seeks to understand the differences between these two interfaces and how they affect the search experience of the novice user. In this study, 40 participants were asked to search for resources using both interfaces. Their search times and accuracy were measured across three types of search tasks (known, partially known, and exploratory). After completing the searches, they were asked a series of questions about their experiences. The data were analyzed in order to identify strengths and weaknesses in both search interfaces. Thirty-six out of 40 participants preferred the TextFacet interface to the TextOnly interface. Using three dependent variables-time, accuracy, and rating-the two interfaces were compared and interactions were tested with the three task types. Search times for the TextFacet were shorter and participants preferred the TextFacet search interface over the TextOnly search interface. Performances across the three task types were different in terms of search time. The partially known and exploratory task types showed similar distributions for rating and accuracy. These distributions were distinctly different from the known task type. The results of this study may assist libraries in developing improved library catalog search interfaces that utilize facets as well as text searching.", "paper_title": "A Tale of Two Interfaces: How Facets Affect the Library Catalog Search Experience", "paper_id": "WOS:000302156300006"}