{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "linguistic_truth-valued_lattice_implication_algebra"}, {"score": 0.004616859702338596, "phrase": "natural_language"}, {"score": 0.0042446888127531945, "phrase": "syllogistic_reasoning"}, {"score": 0.004098578483988551, "phrase": "main_topics"}, {"score": 0.004041546659145336, "phrase": "many-valued_logic_studies"}, {"score": 0.00379452936798156, "phrase": "important_non-classical_logic"}, {"score": 0.0034884152484429207, "phrase": "incomparable_elements"}, {"score": 0.00263505298504827, "phrase": "semantic_problem"}, {"score": 0.002195552442011313, "phrase": "consistency_theorem"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Linguistic truth-valued lattice implication algebra", " Valuation", " Valid formula", " (alpha,beta)-Valid", " (alpha,beta)-Theorem", " (alpha,beta)-Consistency"], "paper_abstract": "In the semantics of natural language, quantification may have received more attention than any other subject, and syllogistic reasoning is one of the main topics in many-valued logic studies on inference. Particularly, lattice-valued logic, a kind of important non-classical logic, can be applied to describe and treat incomparability by the incomparable elements in its truth-valued set. In this paper, we first focus on some properties of linguistic truth-valued lattice implication algebra. Secondly, we introduce some concepts of linguistic truth-valued lattice-valued propositional logic system lP(X), whose truth-valued domain is a linguistic truth-valued lattice implication algebra. Then we investigate the semantic problem of lP(X). Finally, we further probe into the syntax of linguistic truth-valued lattice-valued propositional logic system lP(X), and prove the soundness theorem, deduction theorem and consistency theorem. (C) 2010 Elsevier Inc. All rights reserved.", "paper_title": "Linguistic truth-valued lattice-valued propositional logic system lP(X) based on linguistic truth-valued lattice implication algebra", "paper_id": "WOS:000276708100017"}