{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "scalar_quantum"}, {"score": 0.04936106948081192, "phrase": "cayley_graphs"}, {"score": 0.007698375959713528, "phrase": "necessary_condition"}, {"score": 0.004671588539217021, "phrase": "quantum_walk"}, {"score": 0.004245051445971095, "phrase": "internal_space"}, {"score": 0.00418134346679498, "phrase": "moving_particle"}, {"score": 0.003332440548684892, "phrase": "scalar_quantum_walk"}, {"score": 0.0032494292163722065, "phrase": "general_method"}, {"score": 0.0031845067058084583, "phrase": "evolution_operator"}, {"score": 0.002922705896608178, "phrase": "subsequent_constructive_method"}, {"score": 0.0026688629249775925, "phrase": "restricted_framework"}, {"score": 0.0022365262201954643, "phrase": "interesting_special_cases"}], "paper_keywords": ["quantum walk"], "paper_abstract": "A quantum walk, i.e., the quantum evolution of a particle on a graph, is termed scalar if the internal space of the moving particle (often called the coin) has dimension one. Here. we study the existence of scalar quantum walks on Cayley graphs, which are built from the generators of a group. After deriving a necessary condition on these generators for the existence of a scalar quantum walk, we present a general method to express the evolution operator of the walk, assuming homogeneity of the evolution. We use this necessary condition and the subsequent constructive method to investigate the existence of scalar quantum walks on Cayley graphs of groups presented with two or three generators. In this restricted framework, we classify all groups - in terms of relations between their generators - that admit scalar quantum walks, and we also derive the form of the most general evolution operator. Finally, we point out some interesting special cases, and extend our study to a few examples of Cayley graphs built with more than three generators.", "paper_title": "Exploring scalar quantum walks on Cayley graphs", "paper_id": "WOS:000251978500005"}