{"auto_keywords": [{"score": 0.0447968916956003, "phrase": "multimedia_content"}, {"score": 0.04224645421279868, "phrase": "query_service"}, {"score": 0.03878324495288763, "phrase": "multimedia_web_service"}, {"score": 0.02868693469419413, "phrase": "soap_messages"}, {"score": 0.00481495049065317, "phrase": "current_web_services_standards"}, {"score": 0.004580550308652044, "phrase": "web_services_domain"}, {"score": 0.004430629452265786, "phrase": "novel_multimedia_streaming_web_services_framework"}, {"score": 0.0034134024569847264, "phrase": "content_descriptions"}, {"score": 0.002873524721802591, "phrase": "new_meps"}, {"score": 0.002794802975530612, "phrase": "mtom_packaging"}, {"score": 0.0027333769432036905, "phrase": "multimedia_packets"}, {"score": 0.0025570607111118793, "phrase": "packaging_method"}, {"score": 0.002275369652100353, "phrase": "binary_packet_data"}, {"score": 0.0022007302738063566, "phrase": "proposed_framework"}, {"score": 0.0021049977753042253, "phrase": "simple_http_multimedia_streaming_method"}], "paper_keywords": ["Binary XML", " multimedia streaming", " service-oriented architecture", " web services"], "paper_abstract": "The transfer of streaming data is not well supported by current web services standards. To include multimedia streaming support in the web services domain, this paper presents a novel multimedia streaming web services framework for the transfer of streaming multimedia content. First, the framework includes an implementation of a query service for publishing a description of the multimedia content that is input to or output from a multimedia web service. This query service is specified in an extension of WSDL. Using MPEG-7 metadata, content descriptions can be queried before the invocation of a multimedia web service. Second, two new MEPs and their SOAP HTTP bindings are created for the exchange of streaming data between two SOAP endpoints. The implementations of these new MEPs use the MIME multipart/related structure and MTOM packaging when transferring the multimedia packets as SOAP messages. To reduce the transfer overhead introduced by the packaging method, this paper investigated extensively the application of various compression schemes for the SOAP messages as well as for the packaging of the binary packet data. Experiments show that the proposed framework can achieve a performance comparable to a simple HTTP multimedia streaming method.", "paper_title": "A Web Service Framework Supporting Multimedia Streaming", "paper_id": "WOS:000330196200009"}