{"auto_keywords": [{"score": 0.04439445244220926, "phrase": "first_place_antitonicity"}, {"score": 0.010612387000973441, "phrase": "first_place"}, {"score": 0.0092119353284414, "phrase": "second_place_isotonicity"}, {"score": 0.009062617567333741, "phrase": "boundary_conditions"}, {"score": 0.004608730887154718, "phrase": "demanded_fuzzy_implication"}, {"score": 0.004558564684763264, "phrase": "fuzzy_systems"}, {"score": 0.004435514622798228, "phrase": "desired_properties"}, {"score": 0.0039322149318145845, "phrase": "fuzzy_implications"}, {"score": 0.00380511089035825, "phrase": "binary_logic"}, {"score": 0.003763697094583913, "phrase": "s-"}, {"score": 0.0026213749921120623, "phrase": "different_combinations"}, {"score": 0.0025786066704445304, "phrase": "t-conorm_s"}, {"score": 0.002454432810862053, "phrase": "strong_fuzzy_negation"}, {"score": 0.0021049977753042253, "phrase": "left-continuous_t-norms"}], "paper_keywords": ["Fuzzy Implication", " QL-implication", " Fuzzy modus Ponens", " Association rule", " Subsethood measure"], "paper_abstract": "To obtain a demanded fuzzy implication in fuzzy systems, a number of desired properties have been proposed, among which the first place antitonicity, the second place isotonicity and the boundary conditions are the most important ones. The three classes of fuzzy implications derived from the implication in binary logic, S-, R- and QL-implications all satisfy the second place isotonicity and the boundary conditions. However, not all the QL-implications satisfy the first place antitonicity as S- and R-implications do. In this paper we study the QL-implications satisfying the first place antitonicity. First we establish the relationship between the first place antitonicity and other required properties of QL-implications. Second we work on the conditions under which a QL-implication generated by different combinations of a t-conorm S, a t-norm T and a strong fuzzy negation N satisfy the first place antitonicity, especially in the cases that both S and T are continuous. We further investigate the interrelationships between S- and R-implications generated by left-continuous t-norms on one hand and QL-implications satisfying the first place antitonicity on the other. (C) 2008 Elsevier B.V. All rights reserved.", "paper_title": "On the first place antitonicity in QL-implications", "paper_id": "WOS:000260076600004"}