{"auto_keywords": [{"score": 0.044748859607699136, "phrase": "ws"}, {"score": 0.035894737093876104, "phrase": "proposed_algorithm"}, {"score": 0.013372886357243726, "phrase": "transaction_execution"}, {"score": 0.012864390564955783, "phrase": "rs"}, {"score": 0.00481495049065317, "phrase": "database_systems"}, {"score": 0.004783607451937166, "phrase": "concurrency_control"}, {"score": 0.0045997680394590365, "phrase": "concurrent_execution"}, {"score": 0.004023120753104693, "phrase": "real_operational_environments"}, {"score": 0.003768550679591666, "phrase": "optional_knowledge"}, {"score": 0.0035999631751991385, "phrase": "proposed_cc_algorithm"}, {"score": 0.003231722251475338, "phrase": "concurrency_control_algorithms"}, {"score": 0.0031897187361850103, "phrase": "specific_static_or_dynamic_equation"}, {"score": 0.003066945490483524, "phrase": "winner_transaction"}, {"score": 0.0029779674919563734, "phrase": "adaptive_resonance_theory"}, {"score": 0.002545125352770175, "phrase": "experimental_results"}, {"score": 0.0025120232221781825, "phrase": "proposed_neural-based_cc"}, {"score": 0.002495638753506374, "phrase": "ncc"}, {"score": 0.0022037303797015095, "phrase": "proposed_ncc_algorithm"}, {"score": 0.0021049977753042253, "phrase": "different_transaction_rates"}], "paper_keywords": ["Concurrency control", " Neural network", " Database systems"], "paper_abstract": "Concurrency control (CC) algorithms guarantee the correctness and consistency criteria for concurrent execution of a set of transactions in a database. A precondition that is seen in many CC algorithms is that the writeset (WS) and readset (RS) of transactions should be known before the transaction execution. However, in real operational environments, we know the WS and RS only for a fraction of transaction set before execution. However, optional knowledge about WS and RS of transactions is one of the advantages of the proposed CC algorithm in this paper. If the WS and RS are known before the transaction execution, the proposed algorithm will use them to improve the concurrency and performance. On the other hand, the concurrency control algorithms often use a specific static or dynamic equation in making decision about granting a lock or detection of the winner transaction. The proposed algorithm in this paper uses an adaptive resonance theory (ART)-based neural network for such a decision making. In this way, a parameter called health factor (HF) is defined for transactions that is used for comparing the transactions and detecting the winner one in accessing the database objects. HF is calculated using ART2 neural network. Experimental results show that the proposed neural-based CC (NCC) algorithm increases the level of concurrency by decreasing the number of aborts. The performance of proposed algorithm is compared with strict two-phase locking (S2PL) algorithm, which has been used in most commercial database systems. Simulation results show that the performance of proposed NCC algorithm, in terms of number of aborts, is better than S2PL algorithm in different transaction rates.", "paper_title": "A neural-based concurrency control algorithm for database systems", "paper_id": "WOS:000313062100018"}