{"auto_keywords": [{"score": 0.04956594643422059, "phrase": "road_network"}, {"score": 0.04501610610489927, "phrase": "real_world"}, {"score": 0.007719250786819047, "phrase": "route_planning_analysis"}, {"score": 0.00481495049065317, "phrase": "real_world_representation"}, {"score": 0.0047292449487169345, "phrase": "route_planning"}, {"score": 0.004481132747216135, "phrase": "geographic_information_system"}, {"score": 0.004401342842183475, "phrase": "network_analysis"}, {"score": 0.00374399358035391, "phrase": "exact_answer"}, {"score": 0.0036509280916606937, "phrase": "existing_methods"}, {"score": 0.003611751858608048, "phrase": "impedance_modeling"}, {"score": 0.0034343965063429447, "phrase": "time_variable"}, {"score": 0.003385336776758738, "phrase": "proper_results"}, {"score": 0.003161674440750158, "phrase": "route_planning_tools"}, {"score": 0.003071965703296204, "phrase": "additional_realistic_variables"}, {"score": 0.002963390095037466, "phrase": "sight-seeing_information"}, {"score": 0.0026315183701883437, "phrase": "sensitivity_analysis"}, {"score": 0.0024223970976460173, "phrase": "drivers'_paths"}, {"score": 0.002262209824105154, "phrase": "analytical_network_process"}, {"score": 0.0021509807762081145, "phrase": "aforementioned_problem"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Route planning", " Sensitivity analysis", " GIS", " AHP", " Road network", " Impedance model"], "paper_abstract": "This paper addresses a methodology to properly represent a road network in the geographic information system (GIS) for network analysis. Over the years, the real world has become too complex to model properly within a given information system, such as GIS. Ideally, when the real world is represented as accurately as possible, a GIS can answer a question in its virtual world that coincides with the exact answer in the real world. However, existing methods related to impedance modeling for each segment of a road network in a route planning analysis that includes only a distance or time variable do not give proper results. Hence, this study investigates how a road network can represent the real world in a GIS and offer route planning tools. To address this, first, additional realistic variables are taken into account. These include weather, sight-seeing information, road type, and so on. Second, to combine these variables, an impedance model (IM) using the analytical hierarchical process (AHP) method is proposed. Finally, all of the models are implemented and verified with a sensitivity analysis. The models were successfully implemented in this work. All of the paths of the route planning analysis were successfully matched with the drivers' paths that would normally be chosen in reality. It is anticipated that the use of other techniques such as analytical network process (ANP) in addition to AHP would be useful to overcome the aforementioned problem. (C) 2010 Elsevier Ltd. All rights reserved.", "paper_title": "Real world representation of a road network for route planning in GIS", "paper_id": "WOS:000292169500001"}