{"auto_keywords": [{"score": 0.04683922641836833, "phrase": "human_cancer"}, {"score": 0.035620716932052585, "phrase": "therapeutic_mirnas"}, {"score": 0.033002348931367075, "phrase": "condition-specific_metabolic_system"}, {"score": 0.025882264464755035, "phrase": "metabolic_functions"}, {"score": 0.00481495049065317, "phrase": "therapeutic_microrna"}, {"score": 0.004731492618963217, "phrase": "human_metabolic_network"}, {"score": 0.004260134699483774, "phrase": "research_community"}, {"score": 0.004167982855788402, "phrase": "alternative_therapeutic_targets"}, {"score": 0.00406001734835979, "phrase": "potential_targets"}, {"score": 0.003920384090110374, "phrase": "particular_type"}, {"score": 0.003769006950727621, "phrase": "limited_knowledge"}, {"score": 0.0035761913760242697, "phrase": "mirna-target_prediction"}, {"score": 0.0031775430407770026, "phrase": "novel_approach"}, {"score": 0.003041418598559319, "phrase": "hcc"}, {"score": 0.002860546817196148, "phrase": "cancer_cell_growth"}, {"score": 0.00266693888510356, "phrase": "liver_cancer"}, {"score": 0.0024007585788965655, "phrase": "cancer_growth"}, {"score": 0.002287783663138828, "phrase": "first_computational_approach"}, {"score": 0.0021801135036476136, "phrase": "cancer_metabolism"}, {"score": 0.0021049977753042253, "phrase": "mirna-identified_metabolic_genes"}], "paper_keywords": [""], "paper_abstract": "Motivation: MicroRNA (miRNA) expression has been found to be deregulated in human cancer, contributing, in part, to the interest of the research community in using miRNAs as alternative therapeutic targets. Although miRNAs could be potential targets, identifying which miRNAs to target for a particular type of cancer has been difficult due to the limited knowledge on their regulatory roles in cancer. We address this challenge by integrating miRNA-target prediction, metabolic modeling and context-specific gene expression data to predict therapeutic miRNAs that could reduce the growth of cancer. Results: We developed a novel approach to simulate a condition-specific metabolic system for human hepatocellular carcinoma (HCC) wherein overexpression of each miRNA was simulated to predict their ability to reduce cancer cell growth. Our approach achieved > 80% accuracy in predicting the miRNAs that could suppress metastasis and progression of liver cancer based on various experimental evidences in the literature. This condition-specific metabolic system provides a framework to explore the mechanisms by which miRNAs modulate metabolic functions to affect cancer growth. To the best of our knowledge, this is the first computational approach implemented to predict therapeutic miRNAs for human cancer based on their functional role in cancer metabolism. Analyzing the metabolic functions altered by the miRNA-identified metabolic genes essential for cell growth and proliferation that are targeted by the miRNAs.", "paper_title": "Prediction of therapeutic microRNA based on the human metabolic network", "paper_id": "WOS:000335001000015"}