{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "delayed_recognition"}, {"score": 0.03465035281375813, "phrase": "citation_curves"}, {"score": 0.00407474190126995, "phrase": "long_time"}, {"score": 0.0036503460615862574, "phrase": "sleeping_period"}, {"score": 0.003504595508262064, "phrase": "\"sleeping_beauty"}, {"score": 0.0033373303217961803, "phrase": "awaking_period"}, {"score": 0.003217124533918232, "phrase": "\"sleeping_beauties"}, {"score": 0.003051073364818384, "phrase": "\"delayed_recognition"}, {"score": 0.0027441711627551064, "phrase": "lasting_impact"}, {"score": 0.0023694065215394593, "phrase": "happy_endings"}, {"score": 0.002350152413458658, "phrase": "sleeping_beauties"}, {"score": 0.0022746843938682157, "phrase": "citation_curve"}, {"score": 0.0021049977753042253, "phrase": "happy_ending"}], "paper_keywords": ["All-elements-sleeping-beauty", " Sleeping beauty", " Flash in the pan", " Delayed recognition"], "paper_abstract": "Delayed recognition refers to the phenomenon where papers did not achieve recognition in terms of citations until some years after their original publication. A paper with delayed recognition was termed a \"sleeping beauty\": a princess sleeps (goes unnoticed) for a long time and then, almost suddenly, is awakened (receives a lot of citations) by a prince (another article). There are a sleeping period and an awakening period in the definition of a \"sleeping beauty\". Apart from and prior to the two periods, an awaking period was found in citation curves of some publications, \"sleeping beauties\" was hence expanded to \"all-elements-sleeping-beauties\". The opposite effect of \"delayed recognition\" was described as \"flash in the pan\": documents that were noticed immediately after publication but did not seem to have a lasting impact. In this work, we briefly discussed the citation curves of two remarkable \"all-elements-sleeping-beauties\". We found they appeared \"flash in the pan\" first and then \"delayed recognition\". We also found happy endings of sleeping beauties and princes, and hence suggest the citation curve of an \"all-elements-sleeping-beauty\" include an awaking period, a sleeping period, an awakening period and a happy ending.", "paper_title": "Citation curves of \"all-elements-sleeping-beauties\": \"flash in the pan\" first and then \"delayed recognition\"", "paper_id": "WOS:000339379600016"}