{"auto_keywords": [{"score": 0.04509655915119651, "phrase": "business_process_models"}, {"score": 0.00481495049065317, "phrase": "business_process_model_repositories"}, {"score": 0.004767261858417823, "phrase": "business_process_management_technology"}, {"score": 0.004167653403322565, "phrase": "effective_business_process_model_management"}, {"score": 0.004024863549087511, "phrase": "large_amount"}, {"score": 0.0037350832473790007, "phrase": "similar_or_related_model"}, {"score": 0.0035891316580885665, "phrase": "new_one"}, {"score": 0.0031845067058084583, "phrase": "existing_models"}, {"score": 0.0030906666356950887, "phrase": "large_amounts"}, {"score": 0.002969821115740559, "phrase": "company_amalgamation"}, {"score": 0.0028822890425197582, "phrase": "multiple_companies"}, {"score": 0.0024327171018928458, "phrase": "potential_solutions"}, {"score": 0.0021049977753042253, "phrase": "literature_work"}], "paper_keywords": ["Business process model", " Repository", " Query"], "paper_abstract": "Business process management technology is becoming increasingly popular, resulting in more and more business process models being created. Hence, there is a need for these business process models to be managed effectively. For effective business process model management, being able to efficiently query large amount of business process models is essential. For example, it is preferable to find a similar or related model to customize, rather than building a new one from scratch. This would not only save time, but would also be less error-prone and more coherent with the existing models of the enterprise. Querying large amounts of business process models efficiently is also vital during company amalgamation, in which business process models from multiple companies need to be examined and integrated. This paper provides: an overview of the field of querying business process models; a summary of its literature; and a list of challenges (and some potential solutions) that have yet to be addressed. In particular, we aim to compare the differences between querying business process models and general graph querying. We also discuss literature work from graph querying research that can be used when querying business process models.", "paper_title": "Querying business process model repositories", "paper_id": "WOS:000331971100006"}