{"auto_keywords": [{"score": 0.04829193307643823, "phrase": "fuzzy_arithmetic"}, {"score": 0.0479736639241839, "phrase": "heuristic_search_algorithms"}, {"score": 0.015719716506582538, "phrase": "nutri-educ"}, {"score": 0.011469329805476176, "phrase": "food_quantities"}, {"score": 0.004431554974667461, "phrase": "nutrition_software_application"}, {"score": 0.004340553321613485, "phrase": "rangueil_university_hospital"}, {"score": 0.0038456073694665, "phrase": "small_set"}, {"score": 0.0038190873308414333, "phrase": "acceptable_actions"}, {"score": 0.003663749926218976, "phrase": "user's_energetic_needs"}, {"score": 0.003551392586900308, "phrase": "inherent_imprecision"}, {"score": 0.0034784018545409193, "phrase": "nutrient_values"}, {"score": 0.0033717094055177995, "phrase": "gradual_boundaries"}, {"score": 0.0031461489526079236, "phrase": "fuzzy_pattern_matching"}, {"score": 0.0030496164547515565, "phrase": "nutrient_norms"}, {"score": 0.0030285690317007805, "phrase": "innovative_visual_gauges"}, {"score": 0.002720254890261961, "phrase": "nutritional_point"}, {"score": 0.0026459054525234706, "phrase": "initial_meat"}, {"score": 0.0025119200240696824, "phrase": "adequate_model"}, {"score": 0.002401286805515306, "phrase": "necessary_computation"}, {"score": 0.0023847032316716503, "phrase": "compatibility_assessments"}, {"score": 0.0023356349192255074, "phrase": "new_interface_techniques"}, {"score": 0.002279660253812632, "phrase": "nutri-educ_software_application"}], "paper_keywords": ["fuzzy arithmetic", " heuristic search", " nutrition", " Nutri-Educ"], "paper_abstract": "Objective, methods and results: Nutri-Educ is a nutrition software application developed in cooperation with the Diabetology Department of Toulouse's Rangueil University Hospital. It aims at helping any person to balance their meals. More specifically, its main goal is to enable a user to describe a meat and assess its content, and in most cases to find a small set of acceptable actions which make it well-balanced and in accordance to the user's energetic needs. Fuzzy numbers are used to represent the inherent imprecision and fuzziness of food quantities and nutrient values as well. as to model, the gradual boundaries of the daily recommended values associated with each nutrient. Fuzzy arithmetic is used to perform computations on such quantities and fuzzy pattern matching provides measures of the compatibility of data to nutrient norms. Innovative visual gauges have been designed to display this information in a simple, yet comprehensive way. Finally, heuristic search algorithms are used to find a set of actions, acceptable from a nutritional point of view, which will transform the initial meat into a well-balanced one. Conclusion: Fuzzy arithmetic proves to be an adequate model for naturally representing food quantities and values as well as for performing all necessary computation and compatibility assessments. By combining it with new interface techniques and heuristic search algorithms, it allows the Nutri-Educ software application to. balance and improve meals, a complex qualitative and quantitative problem which is solved in 87% of our benchmark database. (c) 2007 Elsevier B.V. All rights reserved.", "paper_title": "Nutri-Educ, a nutrition software application for balancing meals, using fuzzy arithmetic and heuristic search algorithms", "paper_id": "WOS:000254379400004"}