{"auto_keywords": [{"score": 0.030919375285442998, "phrase": "routine_tasks"}, {"score": 0.00481495049065317, "phrase": "predictive_scheduling_system"}, {"score": 0.004778258911940497, "phrase": "assisted_living_services"}, {"score": 0.004753953995606551, "phrase": "elders"}, {"score": 0.00468176946407502, "phrase": "older_adults"}, {"score": 0.00457553517865013, "phrase": "dedicated_care"}, {"score": 0.004552255360140208, "phrase": "geriatric_residences"}, {"score": 0.004314823905616251, "phrase": "long-term_field_study"}, {"score": 0.004227653047394939, "phrase": "work_conditions"}, {"score": 0.003946195919158241, "phrase": "relevant_requirements"}, {"score": 0.0038174155069599864, "phrase": "caregivers'_tasks"}, {"score": 0.0032836104153151973, "phrase": "predictive_schedule"}, {"score": 0.003208999546225013, "phrase": "participative_sessions"}, {"score": 0.0031042018721479385, "phrase": "real-time_alerts"}, {"score": 0.003018196463874475, "phrase": "-limits_areas"}, {"score": 0.002731971103291716, "phrase": "caring_tasks"}, {"score": 0.0027041907335656782, "phrase": "diaper_changes"}, {"score": 0.0026698611202305715, "phrase": "well-being_assessments"}, {"score": 0.0025694584194998356, "phrase": "caregiver's_shift_handover"}, {"score": 0.002530359917257626, "phrase": "new_caregivers"}, {"score": 0.002472822097373027, "phrase": "timely_information"}, {"score": 0.002361632539339945, "phrase": "medical_staff"}, {"score": 0.0022961534630650347, "phrase": "automatic_caring_system"}, {"score": 0.0022267859286766553, "phrase": "caregiver_assessments"}, {"score": 0.0021595094738887767, "phrase": "caregiver_tasks"}, {"score": 0.0021430096945811218, "phrase": "formative_evaluation"}, {"score": 0.0021157891421445846, "phrase": "preliminary_evidence"}], "paper_keywords": ["Design", " Human Factors", " Measurement", " Assistive living systems", " activities of daily living (ADL)", " elderly care"], "paper_abstract": "As the number of older adults increases, and with it the demand for dedicated care, geriatric residences face a shortage of caregivers, who themselves experience work overload, stress, and burden. We conducted a long-term field study in three geriatric residences to understand the work conditions of caregivers with the aim of developing technologies to assist them in their work and help them deal with their burdens. From this study, we obtained relevant requirements and insights to design, implement, and evaluate two prototypes for supporting caregivers' tasks (e.g., electronic recording and automatic notifications) in order to validate the feasibility of their implementation in situ and their technical requirements. The evaluation in situ of the prototypes was conducted for a period of 4 weeks. The results of the evaluation, together with the data collected from 6 months of use, motivated the design of a predictive schedule, which was iteratively improved and evaluated in participative sessions with caregivers. PRESENCE, the predictive schedule we propose, triggers real-time alerts of risky situations (e.g., falls, entering off-limits areas such as the infirmary or the kitchen) and informs caregivers of routine tasks that need to be performed (e.g., medication administration, diaper change, etc.). Moreover, PRESENCE helps caregivers to record caring tasks (such as diaper changes or medication) and well-being assessments (such as the mood) that are difficult to automate. This facilitates caregiver's shift handover and can help to train new caregivers by suggesting routine tasks and by sending reminders and timely information about residents. It can be seen as a tool to reduce the workload of caregivers and medical staff. Instead of trying to substitute the caregiver with an automatic caring system, as proposed by others, we propose our predictive schedule system that blends caregiver assessments and measurements from sensors. We show the feasibility of predicting caregiver tasks and a formative evaluation with caregivers that provides preliminary evidence of its utility.", "paper_title": "Design of a Predictive Scheduling System to Improve Assisted Living Services for Elders", "paper_id": "WOS:000360007500011"}