{"auto_keywords": [{"score": 0.037624066932813734, "phrase": "pole_leg"}, {"score": 0.00481495049065317, "phrase": "jumping_robot"}, {"score": 0.004769444094319619, "phrase": "jumping_locomotion"}, {"score": 0.004162328961227939, "phrase": "eccentric_cam"}, {"score": 0.004136044939878838, "phrase": "quick_return_characteristics"}, {"score": 0.004071055784602253, "phrase": "jumping_mechanism"}, {"score": 0.004032551494961167, "phrase": "torsion_springs"}, {"score": 0.003894446653225716, "phrase": "quick_release"}, {"score": 0.0036092644587974953, "phrase": "rotatable_pole_leg"}, {"score": 0.0032200696606295457, "phrase": "com"}, {"score": 0.0031493643207295406, "phrase": "additional_weight"}, {"score": 0.0030802351224657673, "phrase": "different_takeoff_angles"}, {"score": 0.0029464822620763687, "phrase": "fundamental_characteristics"}, {"score": 0.002881793492919646, "phrase": "experimental_results"}, {"score": 0.002845466319548362, "phrase": "constructed_robot"}, {"score": 0.002782989122345306, "phrase": "takeoff_angle"}, {"score": 0.0021797840569206697, "phrase": "outdoor_environments"}, {"score": 0.0021659920594094407, "phrase": "self-righting_and_steering"}, {"score": 0.0021049977753042253, "phrase": "simulation_results"}], "paper_keywords": ["Jumping robot", " Modeling", " Simulation", " Self-righting", " Steering", " Takeoff angle adjusting"], "paper_abstract": "This paper presents the design of a jumping robot inspired by jumping locomotion of locusts. The mechanisms of jumping, self-righting, steering, and takeoff angle adjusting are modeled and simulated firstly. Then the 3D model of the robot is designed and a prototype of the robot is fabricated. An eccentric cam with quick return characteristics is used by the jumping mechanism to compress torsion springs for energy storing and to trigger the springs for a quick release of energy. The self-righting, steering, and takeoff angle adjusting capabilities of the robot are achieved by adding a rotatable pole leg. The pole leg can prop up the body of the robot when it falls down. The pole leg can also steer the robot to turn step by step. By adjusting its center of mass (COM) using the pole leg with an additional weight, the robot can jump at different takeoff angles. A 9 cm x 7 cm x 12 cm, 154 g jumping robot prototype is implemented. The fundamental characteristics of the robot are tested. Experimental results show that the constructed robot can jump more than 88 cm high at a takeoff angle of 80.33 degrees. The robot rotates about 277 degrees in the air during jumping. The robot can self-right when it falls down to its left, right, and front sides in 9 s, 9 s, and 26 s respectively. The robot can steer 360 degrees in 42 s with 14 steps, about 25.7 degrees per step. Its takeoff angle ranges between 80.33 degrees and 86.92 degrees. The robot can continuously jump to overcome stairs and jump forward in outdoor environments with self-righting and steering. The experimental results are compared with the simulation results. The differences between them are explained. (C) 2013 Elsevier Ltd. All rights reserved.", "paper_title": "A bio-inspired jumping robot: Modeling, simulation, design, and experimental results", "paper_id": "WOS:000328659200024"}