{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "vivo_fitness_landscape"}, {"score": 0.02928440808154909, "phrase": "nelfinavir_treatment"}, {"score": 0.004701985831087475, "phrase": "drug_selective_pressure"}, {"score": 0.00459165923324494, "phrase": "drug_resistance_evolution"}, {"score": 0.004399525320473839, "phrase": "major_cause"}, {"score": 0.004357927940322685, "phrase": "antiviral_treatment_failure"}, {"score": 0.0037969755088553326, "phrase": "genetic_barrier"}, {"score": 0.003603549914861701, "phrase": "fitness_landscape"}, {"score": 0.003569451476205552, "phrase": "cross-sectional_clinical_genetic_sequence_data"}, {"score": 0.003419943984098415, "phrase": "required_selective_pressure"}, {"score": 0.00332375606483146, "phrase": "naive_patients"}, {"score": 0.003199687131875466, "phrase": "treated_patients"}, {"score": 0.0029511579080222137, "phrase": "selective_pressure"}, {"score": 0.002881793492919646, "phrase": "protease_inhibitor_nelfinavir"}, {"score": 0.002382329940096419, "phrase": "predicted_evolution"}, {"score": 0.002359759876402679, "phrase": "nelfinavir_selective_pressure"}, {"score": 0.0022933216359142736, "phrase": "vivo_evolution"}, {"score": 0.0021454671611847507, "phrase": "supplementary_data"}, {"score": 0.0021050918136607407, "phrase": "bioinformatics"}], "paper_keywords": [""], "paper_abstract": "Motivation: HIV-1 antiviral resistance is a major cause of antiviral treatment failure. The in vivo fitness landscape experienced by the virus in presence of treatment could in principle be used to determine both the susceptibility of the virus to the treatment and the genetic barrier to resistance. We propose a method to estimate this fitness landscape from cross-sectional clinical genetic sequence data of different subtypes, by reverse engineering the required selective pressure for HIV-1 sequences obtained from treatment naive patients, to evolve towards sequences obtained from treated patients. The method was evaluated for recovering 10 random fictive selective pressures in simulation experiments, and for modeling the selective pressure under treatment with the protease inhibitor nelfinavir. Results: The estimated fitness function under nelfinavir treatment considered fitness contributions of 114 mutations at 48 sites. Estimated fitness correlated significantly with the in vitro resistance phenotype in 519 matched genotype-phenotype pairs (R-2 = 0.47 (0.41 - 0.54)) and variation in predicted evolution under nelfinavir selective pressure correlated significantly with observed in vivo evolution during nelfinavir treatment for 39 mutations (with FDR = 0.05). Supplementary information: Supplementary data are available at Bioinformatics online.", "paper_title": "Estimation of an in vivo fitness landscape experienced by HIV-1 under drug selective pressure useful for prediction of drug resistance evolution during treatment", "paper_id": "WOS:000251865000005"}