{"auto_keywords": [{"score": 0.033696432194572815, "phrase": "self_training"}, {"score": 0.033467147044586955, "phrase": "self-other_training"}, {"score": 0.00481495049065317, "phrase": "virtual_characters"}, {"score": 0.004764435715755502, "phrase": "computer-supported_mathematics_learning_environment"}, {"score": 0.004664983066310498, "phrase": "social_basis"}, {"score": 0.004519665344659923, "phrase": "creative_computer_tools"}, {"score": 0.0033868916699805224, "phrase": "puzzle_math"}, {"score": 0.003316098012193133, "phrase": "training_environments"}, {"score": 0.003212663446866794, "phrase": "direct_comparison"}, {"score": 0.0031234247639701134, "phrase": "training_environment"}, {"score": 0.003079736435077217, "phrase": "projo"}, {"score": 0.002994178996584381, "phrase": "math_problems"}, {"score": 0.0027034263575471352, "phrase": "computer_character"}, {"score": 0.0026844452074327265, "phrase": "proio"}, {"score": 0.002537303919584199, "phrase": "calculation_time"}, {"score": 0.0024581013157048926, "phrase": "effective_way"}, {"score": 0.002415170557932468, "phrase": "metacognitive_skills"}, {"score": 0.002339771435910601, "phrase": "elementary_mathematics"}, {"score": 0.0023151639346874883, "phrase": "log_file"}, {"score": 0.0022908146376201194, "phrase": "students'_progress"}, {"score": 0.002234988641498543, "phrase": "self-other_training_students"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Metacognition", " Teaching/learning strategies", " Peer learning", " Computer-supported learning", " Elementary school mathematics"], "paper_abstract": "Two studies examined the social basis of self-assessment for learning through the application of creative computer tools that can help students assess and self-correct their own learning. Students are not usually inclined to check their own answers, but they find it relatively motivating to catch other people's mistakes. A total of 62 students, ranging in age from nine to 11, participated in two studies that tested the hypothesis that monitoring \"someone\" else (i.e., computer character) can help students learn to self-assess their own learning. Two computer-supported learning environments, i.e., \"Doodle Math\" and \"Puzzle Math,\" were developed as training environments for monitoring. The environments also allowed a direct comparison between self training and self-other training. In the training environment, a computer character, \"Projo,\" openly displayed its reasoning when solving math problems and allowed children to \"look for mistakes.\" The students in self training solved all the problems on their own, while the students in self-other training worked with the computer character, Proio, taking turns to solve problems and monitor for any mistakes. The measures on calculation time and accuracy showed that self-other training might be an effective way to help students develop metacognitive skills to self-correct and improve performance in elementary mathematics. The log file tracked the students' progress in various data forms and displayed evidence that self-other training students monitored and self-corrected more than students who experienced self training. (C) 2013 Elsevier Ltd. All rights reserved.", "paper_title": "Learning from the folly of others: Learning to self-correct by monitoring the reasoning of virtual characters in a computer-supported mathematics learning environment", "paper_id": "WOS:000328801300022"}