{"auto_keywords": [{"score": 0.049127918250319744, "phrase": "non-oa_publications"}, {"score": 0.04349398232170127, "phrase": "non-oa_articles"}, {"score": 0.03847999381716214, "phrase": "citation_impact"}, {"score": 0.012548416853033775, "phrase": "non-oa_agriculture_journals"}, {"score": 0.011820508619565897, "phrase": "random_sample"}, {"score": 0.01098779007740619, "phrase": "google"}, {"score": 0.010592747464257098, "phrase": "non-oa_journals"}, {"score": 0.00885022714657256, "phrase": "average_if"}, {"score": 0.00481495049065317, "phrase": "open_access_agricultural_research"}, {"score": 0.004641005983799053, "phrase": "main_purpose"}, {"score": 0.004518442937844318, "phrase": "citation_advantage"}, {"score": 0.004311660976562745, "phrase": "article_level"}, {"score": 0.0041837333868790134, "phrase": "self-archived_research"}, {"score": 0.0039259432210911925, "phrase": "paper_compared_impact_factors"}, {"score": 0.0035388751746059273, "phrase": "fao"}, {"score": 0.0034223147241452547, "phrase": "isi_and_scopus_databases"}, {"score": 0.0032764888213402737, "phrase": "self-archived_articles"}, {"score": 0.003115908199991072, "phrase": "obvious_citation_advantage"}, {"score": 0.0030950988205648605, "phrase": "self-archived_agriculture_articles"}, {"score": 0.002855934865505357, "phrase": "median_citation_count"}, {"score": 0.0027159094186967247, "phrase": "journal_level"}, {"score": 0.0026797398345997114, "phrase": "oa_agriculture_journals"}, {"score": 0.0024808951705681636, "phrase": "fao_publications"}, {"score": 0.0023434465472518943, "phrase": "mean_citation_count"}, {"score": 0.0021477840826122853, "phrase": "oa_agricultural_research"}, {"score": 0.0021262835396323623, "phrase": "better_understanding"}, {"score": 0.0021049977753042253, "phrase": "potential_effect"}], "paper_keywords": ["Open systems", " Electronic publishing", " Archiving", " Research", " Agricultural"], "paper_abstract": "Purpose - The main purpose of this study is to assess the citation advantage for self-archived Open Access (OA) agriculture research against its non-OA counterparts. Design/methodology/approach - At the article level, the paper compared the citation counts of self-archived research with non-OA articles based upon a sample of 400 research articles from ISI-indexed (ISI, Institute for Scientific Information) agriculture journals in 2005. At the journal level the paper compared impact factors (IFs) of OA against non-OA agriculture journals from 2005 to 2007 as reported by the ISI Journal Citation Reports. The paper also sought evidence of citation impact based on a random sample of 100 OA and 100 non-OA publications from the Food and Agriculture Organization (FAO) of the United Nations in 2005. It used both ISI and Scopus databases for citation counting and also Google and Google Scholar for locating the self-archived articles published in the non-OA journals. Findings - The results showed that there is an obvious citation advantage for self-archived agriculture articles as compared to non-OA articles. Out of a random sample of 400 articles published in non-OA agriculture journals, about 14 per cent were OA and had a median citation count of four whereas the median for non-OA articles was two. However, at the journal level the average IF for OA agriculture journals from 2005 to 2007 was 0.29, considerably lower than the average IF for non-OA journals (0.65). Finally it found that FAO publications which were freely accessible online tended to attract more citations than non-OA publications in the same year and had a mean citation count of 1.73 whereas the mean for non-OA publications was 0.28. Originality/value - Self-archived agriculture research articles tended to attract higher citations than their non-OA counterparts. This knowledge of the citation impact of OA agricultural research gives a better understanding about the potential effect of self-archiving on the citation impact.", "paper_title": "The citation impact of Open Access agricultural research A comparison between OA and non-OA publications", "paper_id": "WOS:000284746100006"}