{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "logical_topology"}, {"score": 0.010176155416596158, "phrase": "-wdm_networks"}, {"score": 0.0058529474961729, "phrase": "optical_fiber_amplifiers"}, {"score": 0.004757227624616643, "phrase": "effective_waveband_usage"}, {"score": 0.003969640975997097, "phrase": "constant_number"}, {"score": 0.0034135407979996673, "phrase": "effective_logical_topology"}, {"score": 0.003352256019007896, "phrase": "wdm_network"}, {"score": 0.003117890043128058, "phrase": "additional_wave-bands"}, {"score": 0.0027463775689957255, "phrase": "respective_fibers"}, {"score": 0.002448446849997207, "phrase": "heuristic_algorithm"}, {"score": 0.0021306081217770173, "phrase": "slight_increase"}, {"score": 0.0021049977753042253, "phrase": "average_packet_delays"}], "paper_keywords": ["IP-over-WDM", " logical topology", " RWA", " fiber amplifier", " wave-band"], "paper_abstract": "We deal with the problem of designing the logical topology in IP-over-WDM networks. Many conventional methods for designing the logical topology assume that a constant number of wavelengths will be available on each fiber. But it is not necessary to utilize all wavelengths on each fiber in building an effective logical topology on a WDM network. Instead, several wave-bands may be considered for introduction while deploying additional wave-bands and their corresponding optical amplifiers when additional wavelengths are actually required. In this case, the number of wavelengths available on the respective fibers depends on the number of optical fiber amplifiers deployed on each fiber. In this paper, we propose a heuristic algorithm for the design of a logical topology with as few optical fiber amplifiers as possible. Our results indicate that our algorithm reduces the number of optical fiber amplifiers with a slight increase of average packet delays.", "paper_title": "Design of logical topology with effective waveband usage in IP-over-WDM networks", "paper_id": "WOS:000235448500002"}