{"auto_keywords": [{"score": 0.04438654714845315, "phrase": "usability_problems"}, {"score": 0.00734651490114567, "phrase": "conceptual_models"}, {"score": 0.00481495049065317, "phrase": "early_usability_measurement"}, {"score": 0.004770211811866158, "phrase": "model-driven_development"}, {"score": 0.004725886853744007, "phrase": "definition_and_empirical_evaluation._usability"}, {"score": 0.004638462976078815, "phrase": "key_feature"}, {"score": 0.004573953147933065, "phrase": "quality_systems"}, {"score": 0.003884212965525665, "phrase": "first_step"}, {"score": 0.0038301525703886585, "phrase": "usable_systems"}, {"score": 0.0034398445347109396, "phrase": "system_usability"}, {"score": 0.0032827577713351336, "phrase": "final_system"}, {"score": 0.0032219438233946312, "phrase": "large_amount"}, {"score": 0.002550165781755603, "phrase": "implementation_phases"}, {"score": 0.002289993730291136, "phrase": "early_usability_evaluation"}, {"score": 0.0021049977753042253, "phrase": "conceptual_primitives"}], "paper_keywords": ["Usability", " conceptual modeling", " model-driven development"], "paper_abstract": "Usability is currently a key feature for developing quality systems. A system that satisfies all the functional requirements can be strongly rejected by end-users if it presents usability problems. End-users demand intuitive interfaces and an easy interaction in order to simplify their work. The first step in developing usable systems is to determine whether a system is or is not usable. To do this, there are several proposals for measuring the system usability. Most of these proposals are focused on the final system and require a large amount of resources to perform the evaluation (end-users, video cameras, questionnaires, etc.). Usability problems that are detected once the system has been developed involve a lot of reworking by the analyst since these changes can affect the analysis, design, and implementation phases. This paper proposes a method to minimize the resources needed for the evaluation and reworking of usability problems. We propose an early usability evaluation that is based on conceptual models. The analyst can measure the usability of attributes that depend on conceptual primitives. This evaluation can be automated taking as input the conceptual models that represent the system abstractly.", "paper_title": "EARLY USABILITY MEASUREMENT IN MODEL-DRIVEN DEVELOPMENT: DEFINITION AND EMPIRICAL EVALUATION", "paper_id": "WOS:000293094300003"}