{"auto_keywords": [{"score": 0.048522326887293465, "phrase": "vowel_length"}, {"score": 0.00481495049065317, "phrase": "japanese_vowel_length_accounting"}, {"score": 0.004714749768410393, "phrase": "perception_analysis"}, {"score": 0.004686504090684836, "phrase": "automatic_recognition"}, {"score": 0.004630550377464933, "phrase": "japanese"}, {"score": 0.004575195715264118, "phrase": "speech_processing"}, {"score": 0.004520532341696593, "phrase": "computer_assisted_language_learning"}, {"score": 0.004439753960631346, "phrase": "standard_automatic_speech_recognition"}, {"score": 0.004334280585565239, "phrase": "hidden_markov_models"}, {"score": 0.003972429785872538, "phrase": "prosodic_information"}, {"score": 0.003889693671417058, "phrase": "relative_feature"}, {"score": 0.003469613024006653, "phrase": "contextual_dependencies"}, {"score": 0.0032279194654906028, "phrase": "perceptual_experiments"}, {"score": 0.0031606404966938568, "phrase": "human_vowel_length_recognition"}, {"score": 0.003076189012372961, "phrase": "perceptual_boundary"}, {"score": 0.0025219085140220773, "phrase": "local_dependencies"}, {"score": 0.002353152728035836, "phrase": "superior_recognition_capabilities"}, {"score": 0.002311013816721592, "phrase": "rate_differences"}, {"score": 0.0022971354864013073, "phrase": "significant_improvements"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Vowel length", " Automatic recognition", " Perception", " Duration", " Resynthesis", " Stimulus continua"], "paper_abstract": "Automatic recognition of vowel length in Japanese has several applications in speech processing such as for computer assisted language learning (CALL) systems. Standard automatic speech recognition (ASR) systems make use of hidden Markov models (HMMs) to carry out the recognition. However, HMMs are not particularly well-suited for this problem since classification of vowel length is dependent on prosodic information, and since it is a relative feature affected by changes in the durations of surrounding sounds which vary in part due to changes in speaking rates. That being said, it is not obvious how to design an algorithm to account for these contextual dependencies, since there is still not enough known about how humans perceive the contrast. Therefore, in this paper, we conduct perceptual experiments to further understand the mechanism of human vowel length recognition. In our research, we found that the perceptual boundary is largely affected by the vowels two prior, one prior, and following the vowel for which the length is being recognized. Based on these results and the works of others, we propose an algorithm which does post-processing on alignments output by HMMs to automatically recognize vowel length. The method is primarily composed of two levels of processing dealing first with local dependencies and then long-term dependencies. We test several variations of this algorithm. The method we develop is shown to have superior recognition capabilities and be robust against speaking rate differences producing significant improvements. We test this method on three different databases: a speaking rate database, a native database, and a non-native database. (C) 2015 Elsevier B.V. All rights reserved.", "paper_title": "Automatic recognition of Japanese vowel length accounting for speaking rate and motivated by perception analysis", "paper_id": "WOS:000361576100004"}