{"auto_keywords": [{"score": 0.03992659287798476, "phrase": "workflow_framework"}, {"score": 0.01528875758766855, "phrase": "service_composition"}, {"score": 0.0120995832777597, "phrase": "qualified_services"}, {"score": 0.00481495049065317, "phrase": "intelligent_service_composition"}, {"score": 0.0045262653692203815, "phrase": "participant_web_services'_functional_and_non-functional_attributes"}, {"score": 0.004376131419366239, "phrase": "functional_property-based_service_location"}, {"score": 0.003932654396285872, "phrase": "scheduling_process"}, {"score": 0.0027123819773059127, "phrase": "services'_functional_attributes"}, {"score": 0.002607527117561699, "phrase": "referred_composite_plans"}, {"score": 0.0025494354909453847, "phrase": "general_patterns"}, {"score": 0.0025208755851561368, "phrase": "csp_solving_module"}, {"score": 0.0024097920845706795, "phrase": "composite_plans"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Workflow framework", " Service composition", " AI planning", " CSP"], "paper_abstract": "In practice, service composition and its evaluation are initiated by participant web services' functional and non-functional attributes. It often consists of functional property-based service location, non-functional property-based quality evaluation, and then a finial executive plan. This scheduling process is often unfolded in a workflow framework. Generally, selecting qualified services and composing them manually are time-consuming and error-prone. In view of this challenge, a workflow framework is presented in this paper for intelligently navigating service composition. This workflow framework consists of two primary processing modules, i.e., Planning Module and CSP (Constraint Satisfaction Problems) Solving Module. Taking advantage of services' functional attributes, Planning Module aims at producing referred composite plans that play as general patterns. CSP Solving Module focuses on selecting qualified services to implement the composite plans, based on their non-functional attributes' evaluation. Finally, a case study is presented to demonstrate the validity of framework. (C) 2010 Elsevier B.V. All rights reserved.", "paper_title": "A workflow framework for intelligent service composition", "paper_id": "WOS:000290086300022"}