{"auto_keywords": [{"score": 0.047232975924705344, "phrase": "statistical_queries"}, {"score": 0.04529523196627654, "phrase": "auditing_problem"}, {"score": 0.015719716506582538, "phrase": "finite_attributes"}, {"score": 0.013163244267581356, "phrase": "statistical_information"}, {"score": 0.004773040022691547, "phrase": "statistical_databases"}, {"score": 0.004669845451682529, "phrase": "computational_complexity"}, {"score": 0.0037361664435836845, "phrase": "statistical_sum_queries"}, {"score": 0.003623453648863547, "phrase": "kleinberg_et_al"}, {"score": 0.0035761913760242697, "phrase": "j._comput"}, {"score": 0.003545024951402821, "phrase": "system_sci"}, {"score": 0.002949598537993663, "phrase": "plausible_conjecture"}, {"score": 0.0028857130140890787, "phrase": "constraint_satisfaction_problems"}, {"score": 0.002690406375639144, "phrase": "exact_complexity"}, {"score": 0.0024864020775253767, "phrase": "constraint_satisfaction"}, {"score": 0.0021925901097425405, "phrase": "k"}, {"score": 0.0021049977753042253, "phrase": "polynomial-time_solvable_problems"}], "paper_keywords": ["database", " statistical query", " auditing", " constraint satisfaction problem", " computational complexity"], "paper_abstract": "We study the computational complexity of auditing finite attributes in databases allowing statistical queries. Given a database that supports statistical queries, the auditing problem is to check whether an attribute can be completely determined or not from a given set of statistical information. Some restricted cases of this problem have been investigated earlier, e.g. the complexity of statistical sum queries is known by the work of Kleinberg et al. (J. Comput. System Sci. 66 (2003) 244-253). We characterize all classes of statistical queries such that the auditing problem is polynomial-time solvable. We also prove that the problem is coNP-complete in all other cases under a plausible conjecture on the complexity of constraint satisfaction problems (CSP). The characterization is based on the complexity of certain CSP problems; the exact complexity for such problems is known in many cases. This result is obtained by exploiting connections between auditing and constraint satisfaction, and using certain algebraic techniques. We also study a generalization of the auditing problem where one asks if a set of statistical information imply that an attribute is restricted to K or less different values. We characterize all classes of polynomial-time solvable problems in this case, too. (c) 2008 Elsevier Inc. All rights reserved.", "paper_title": "Computational complexity of auditing finite attributes in statistical databases", "paper_id": "WOS:000256462000016"}