{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "multiparty_payment"}, {"score": 0.0047409388179452255, "phrase": "intermediary_entity"}, {"score": 0.004342430078306461, "phrase": "traditional_two-party_business_models"}, {"score": 0.0040186038781533946, "phrase": "new_secure_multiparty_payment_model"}, {"score": 0.003405948098114941, "phrase": "trusted_entity"}, {"score": 0.002977419551510206, "phrase": "simple_adaptation"}, {"score": 0.0027126684113045756, "phrase": "working_modes"}, {"score": 0.0026161698049580804, "phrase": "multiple_secure_payments"}, {"score": 0.0024971144603069006, "phrase": "slight_adaptation"}, {"score": 0.0024333239726872604, "phrase": "provider's_enrolment_process"}, {"score": 0.0023958326775913165, "phrase": "centralized_system"}, {"score": 0.0021049977753042253, "phrase": "global_networks"}], "paper_keywords": ["Electronic payment", " Secure multiparty protocol", " Intermediation", " Electronic commerce"], "paper_abstract": "During the last years, many secure electronic payment solutions have been proposed but most of them are focused on the traditional two-party business models with a customer and just one provider. In this paper we propose a new secure multiparty payment model with an intermediary, who helps the customer to make purchases and payments with many providers simultaneously. In our secure infrastructure it is assumed that the intermediary does not need to be a trusted entity (it does not need to be a TTP). One of the most important issues of this contribution is the Intermediary-3D: we propose a simple adaptation of the 3D Secure (TM) payment protocol in order to maintain the 3D Secure (TM) working modes but offering the possibility of making multiple secure payments through an intermediary. By means of this slight adaptation, our model avoids the provider's enrolment process in a centralized system (e.g. Visa Domain) and it makes more robust and secure the multipayment scenarios, as well as, it favors its deployment in global networks like Internet. (C) 2008 Elsevier Ltd. All rights reserved.", "paper_title": "Secure multiparty payment with an intermediary entity", "paper_id": "WOS:000266469200005"}