{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "test_cases"}, {"score": 0.010658160357652716, "phrase": "automatically_generated_test_cases"}, {"score": 0.004614643339546038, "phrase": "debugging_effectiveness"}, {"score": 0.004360412703519539, "phrase": "automatic_generation"}, {"score": 0.004100712177044264, "phrase": "fault-revealing_or_coverage_capability"}, {"score": 0.003967314311312148, "phrase": "manual_debugging_activity"}, {"score": 0.003678414118674967, "phrase": "manually_written_tests"}, {"score": 0.002931569771634119, "phrase": "first_two_experiments"}, {"score": 0.0029039692582303904, "phrase": "different_test_case_generation_tools"}, {"score": 0.0028766278519176355, "phrase": "randoop"}, {"score": 0.0027961342030212353, "phrase": "third_experiment"}, {"score": 0.0027307746993761035, "phrase": "code_identifiers"}, {"score": 0.0026543514413663893, "phrase": "original_identifiers"}, {"score": 0.0025922974876210194, "phrase": "major_difference"}, {"score": 0.0023030731312573246, "phrase": "manual_test_cases"}, {"score": 0.00218623706110975, "phrase": "automatic_tests"}], "paper_keywords": ["Experimentation", " Verification", " Empirical software engineering", " debugging", " automatic test case generation"], "paper_abstract": "Several techniques and tools have been proposed for the automatic generation of test cases. Usually, these tools are evaluated in terms of fault-revealing or coverage capability, but their impact on the manual debugging activity is not considered. The question is whether automatically generated test cases are equally effective in supporting debugging as manually written tests. We conducted a family of three experiments (five replications) with humans (in total, 55 subjects) to assess whether the features of automatically generated test cases, which make them less readable and understandable (e.g., unclear test scenarios, meaningless identifiers), have an impact on the effectiveness and efficiency of debugging. The first two experiments compare different test case generation tools (Randoop vs. EvoSuite). The third experiment investigates the role of code identifiers in test cases (obfuscated vs. original identifiers), since a major difference between manual and automatically generated test cases is that the latter contain meaningless (obfuscated) identifiers. We show that automatically generated test cases are as useful for debugging as manual test cases. Furthermore, we find that, for less experienced developers, automatic tests are more useful on average due to their lower static and dynamic complexity.", "paper_title": "Do Automatically Generated Test Cases Make Debugging Easier? An Experimental Assessment of Debugging Effectiveness and Efficiency", "paper_id": "WOS:000366823200005"}