{"auto_keywords": [{"score": 0.04930078151268859, "phrase": "model_transformations"}, {"score": 0.006858366367297796, "phrase": "mde_principles"}, {"score": 0.0056444537670208, "phrase": "inherent_complexity"}, {"score": 0.004814952349992151, "phrase": "mde"}, {"score": 0.00462919213721188, "phrase": "key_role"}, {"score": 0.004583878086896926, "phrase": "software_development_project"}, {"score": 0.004539005582217309, "phrase": "model-driven_engineering_principles"}, {"score": 0.003993958025223994, "phrase": "model_transformation_development"}, {"score": 0.00376488621224566, "phrase": "model_transformation"}, {"score": 0.003445591238183763, "phrase": "transformation_models"}, {"score": 0.0032266093099550955, "phrase": "mda-based_approach"}, {"score": 0.0031429517477457925, "phrase": "different_abstraction_levels"}, {"score": 0.0029238768315330305, "phrase": "case_studies"}, {"score": 0.0028952071490475997, "phrase": "systematic_research_methodology"}, {"score": 0.0027833043858224078, "phrase": "metagem"}, {"score": 0.00270221723573854, "phrase": "model-driven_development"}, {"score": 0.0026234862160314397, "phrase": "domain-specific_languages"}, {"score": 0.0026063035127641574, "phrase": "modeling_model_transformations"}, {"score": 0.002377206033025253, "phrase": "semi-automatic_development_process"}, {"score": 0.0021610874773389096, "phrase": "interoperability_issues"}, {"score": 0.002146926767291475, "phrase": "model_transformation_languages"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Model transformations", " Model-driven development", " Design tools and techniques"], "paper_abstract": "Context: Model transformations play a key role in any software development project based on Model-Driven Engineering principles. However, despite the inherent complexity of developing model transformations, little attention has been paid to the application of MDE principles to the development of model transformations. Objective: In order to: (a) address the inherent complexity of model transformation development and (b) alleviate the problem of the diversity of the languages that are available for model transformation, this paper proposes the application of MDE principles to the development of model transformations. In particular, we have adopted the idea of handling model transformations as transformation models in order to be able to model, transform and generate model transformations. Method: The proposal follows an MDA-based approach that entails the modeling of model transformations at different abstraction levels and the connection of these models by means of model transformations. It has been empirically validated by conducting a set of case studies following a systematic research methodology. Results: The proposal was supported by the introduction of MeTAGeM, a methodological and technical framework for the model-driven development of model transformations that bundles a set of Domain-Specific Languages for modeling model transformations with a set of model transformations in order to bridge these languages and (semi-)automate model transformations development. Conclusion: This paper serves to show that a semi-automatic development process for model transformations is not only desirable but feasible. This process, based on MDE principles, helps to ease the task of developing model transformations and to alleviate interoperability issues between model transformation languages. (C) 2012 Elsevier B.V. All rights reserved.", "paper_title": "Applying MDE to the (semi-)automatic development of model transformations", "paper_id": "WOS:000316527200005"}