{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "sex-equal_stable_marriage_problem"}, {"score": 0.04409655240764186, "phrase": "polynomial_time_algorithm"}, {"score": 0.010587261782850698, "phrase": "stable_matching"}, {"score": 0.008941385852245652, "phrase": "np"}, {"score": 0.004657653216262924, "phrase": "classical_matching_problem"}, {"score": 0.004600009899258357, "phrase": "gale"}, {"score": 0.004561977435768617, "phrase": "shapley"}, {"score": 0.003482276061796395, "phrase": "resulting_matching"}, {"score": 0.0033128156355769454, "phrase": "gusfield"}, {"score": 0.0032853858088102337, "phrase": "irving"}, {"score": 0.002960979624379786, "phrase": "men's_scores"}, {"score": 0.0024149139610228887, "phrase": "additional_criterion"}, {"score": 0.0023849523850778807, "phrase": "stable_matchings"}, {"score": 0.002259346051668556, "phrase": "minimum_egalitarian_stable_matching"}], "paper_keywords": ["Approximation algorithms", " the stable marriage problem", " the sex-equal stable marriage problem"], "paper_abstract": "The stable marriage problem is a classical matching problem introduced by Gale and Shapley. It is known that for any instance, there exists a solution, and there is a polynomial time algorithm to find one. However, the matching obtained by this algorithm is man-optimal, that is, the matching is favorable for men but unfavorable for women, (or, if we exchange the roles of men and women, the resulting matching is woman-optimal). The sex-equal stable marriage problem, posed by Gusfield and Irving, seeks a stable matching \"fair\" for both genders. Specifically it seeks a stable matching with the property that the sum of the men's scores is as close as possible to that of the women's. This problem is known to be strongly NP-hard. In this paper, we give a polynomial time algorithm for finding a near optimal solution for the sex-equal stable marriage problem. Furthermore, we consider the problem of optimizing an additional criterion: among stable matchings that are near optimal in terms of the sex-equality, find a minimum egalitarian stable matching. We show that this problem is strongly NP-hard, and give a polynomial time algorithm whose approximation ratio is less than two.", "paper_title": "Approximation Algorithms for the Sex-Equal Stable Marriage Problem", "paper_id": "WOS:000288825000002"}