{"auto_keywords": [{"score": 0.028694156040506694, "phrase": "np"}, {"score": 0.004208881856146758, "phrase": "distinct_values"}, {"score": 0.003934970057482768, "phrase": "soft_variants"}, {"score": 0.003878625406105021, "phrase": "well_known_alldifferent_and_allequal_constraints"}, {"score": 0.003750260412839128, "phrase": "six_soft_global_constraints"}, {"score": 0.0028100102841877835, "phrase": "common_value"}, {"score": 0.002730023736069673, "phrase": "arc_consistency"}, {"score": 0.0026395715432958665, "phrase": "bounds_consistency"}, {"score": 0.0025767987652419054, "phrase": "polynomial_time"}, {"score": 0.0025521085778978042, "phrase": "dynamic_programming"}, {"score": 0.0024556852466581527, "phrase": "maximum_number"}, {"score": 0.0024088451312725924, "phrase": "equal_variables"}, {"score": 0.0022845800828325555, "phrase": "linear_time_greedy_algorithm"}, {"score": 0.002208853811052348, "phrase": "fixed_parameter_tractable_algorithm"}], "paper_keywords": [""], "paper_abstract": "In many combinatorial problems one may need to model the diversity or similarity of sets of assignments. For example, one may wish to maximise or minimise the number of distinct values in a solution. To formulate problems of this type we can use soft variants of the well known ALLDIFFERENT and ALLEQUAL constraints. We present a taxonomy of six soft global constraints, generated by combining the two latter ones and the two standard cost functions, which are either maximised or minimised. We characterise the complexity of achieving arc and bounds consistency on these constraints, resolving those cases for which NP-hardness was neither proven nor disproven. In particular, we explore in depth the constraint ensuring that at least k pairs of variables have a common value. We show that achieving arc consistency is NP-hard, however bounds consistency can be achieved in polynomial time through dynamic programming. Moreover, we show that the maximum number of pairs of equal variables can be approximated by a factor of 1/2 with a linear time greedy algorithm. Finally, we provide a fixed parameter tractable algorithm with respect to the number of values appearing in more than two distinct domains. Interestingly, this taxonomy shows that enforcing equality is harder than enforcing difference.", "paper_title": "Soft Constraints of Difference and Equality", "paper_id": "WOS:000291054700001"}