{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "object_softness"}, {"score": 0.007616486970554295, "phrase": "haptic_device"}, {"score": 0.004605748839642513, "phrase": "virtual_reality"}, {"score": 0.00421410521089045, "phrase": "challenging_issue"}, {"score": 0.004176813329075736, "phrase": "surgical_planning"}, {"score": 0.003907403442285109, "phrase": "viewing_angle"}, {"score": 0.003527550673371394, "phrase": "virtual_reality_setups"}, {"score": 0.0034963129868796033, "phrase": "different_locations"}, {"score": 0.0029789104204803137, "phrase": "harder_object"}, {"score": 0.0029133627624098064, "phrase": "different_viewing_angles"}, {"score": 0.002427372728532664, "phrase": "significant_difference"}, {"score": 0.002405853977978678, "phrase": "perceived_object_softness"}, {"score": 0.00233202607446404, "phrase": "combined_weights"}, {"score": 0.0023113506171584157, "phrase": "visual_and_haptic_information"}, {"score": 0.002250415129116109, "phrase": "visual_information"}, {"score": 0.0022304616068189575, "phrase": "haptic_information"}], "paper_keywords": [""], "paper_abstract": "Enabling surgeons to interact intuitively and accurately with virtual reality (VR)-based environments using their senses of vision and touch (e.g., to distinguish the softness of tissues) is a challenging issue for surgical planning. This paper presents the results of two experiments that were conducted to determine how viewing angle affects the perception of object softness and to investigate the mechanisms for integrating the senses of vision and touch. The two experiments used virtual reality setups with different locations of a haptic device. In each experiment, 15 human subjects were tested in cases where both visual and touch (haptic) information was available and again when only visual or haptic information was available. In each trial, subjects were asked to select the harder object among two deformable balls placed at different viewing angles. The results of both experiments showed that viewing angle affects the perception of object softness: the larger the viewing angle, the harder the ball was perceived to be. When two viewing angles differed by at least 15 degrees, there was a significant difference in perceived object softness. By computing the individual and combined weights of visual and haptic information, it was determined that visual information and haptic information depend upon each other, contradicting the assumption of independence employed in other studies. Comparison of the two experiments revealed that the location of the haptic device also affects the perception of object softness.", "paper_title": "The role of viewing angle in integrating the senses of vision and touch for perception of object softness", "paper_id": "WOS:000253854900003"}