{"auto_keywords": [{"score": 0.04614766352910894, "phrase": "test_cases"}, {"score": 0.00481495049065317, "phrase": "test_first_programming"}, {"score": 0.004548253531664032, "phrase": "iterative_process"}, {"score": 0.003641433168173135, "phrase": "controlled_experiment"}, {"score": 0.003459191419478298, "phrase": "test_first"}, {"score": 0.0031573626285069157, "phrase": "experimental_results"}, {"score": 0.0030164423559955896, "phrase": "larger_percentage"}, {"score": 0.002898291237210567, "phrase": "achievable_minimum_external_quality"}, {"score": 0.0028653893877383188, "phrase": "delivered_software_applications"}, {"score": 0.0026604207233593973, "phrase": "testing_strategy"}, {"score": 0.0024560114164181765, "phrase": "linear_correlation"}, {"score": 0.0021049977753042253, "phrase": "test_first_teams"}], "paper_keywords": ["Agile methods", " Empirical software engineering", " Software testing", " Testing strategies", " Software engineering process", " Programming paradigms"], "paper_abstract": "The Test First (TF) programming, which is based on an iterative process of \"setting up test cases, implementing the functionality, and having all test cases passed\", has been put forward for decades, however knowledge of the evidence of the Test First programming's success is limited. This paper describes a controlled experiment that investigated the distinctions between the effectiveness of Test First and that of Test Last (TL) (the traditional approach). The experimental results showed that Test First teams spent a larger percentage of time on testing. The achievable minimum external quality of delivered software applications increased with the percentage of time spent on testing regardless of the testing strategy (TF or TL) applied, although there does not exist a linear correlation between them. With four years' data, it is also found that a strong linear correlation between the amount of effort spent on testing and coding in Test First teams, while this phenomenon was not observed in Test Last teams. (C) 2008 Elsevier B.V. All rights reserved.", "paper_title": "Empirical investigation towards the effectiveness of Test First programming", "paper_id": "WOS:000262077500017"}