{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "wayfinding_aids"}, {"score": 0.004760765880314089, "phrase": "virtual_environment"}, {"score": 0.004348580182733617, "phrase": "unfamiliar_environment"}, {"score": 0.004156012879026324, "phrase": "commonly_used_overview_maps"}, {"score": 0.004086010164600727, "phrase": "survey_knowledge"}, {"score": 0.0039050245929822354, "phrase": "spatial_knowledge"}, {"score": 0.0027170943110836425, "phrase": "view-in-view_map"}, {"score": 0.0024257447861185813, "phrase": "different_spatial_abilities"}, {"score": 0.002305014991156598, "phrase": "wayfinding_tools"}, {"score": 0.002279011030331704, "phrase": "virtual_environments"}, {"score": 0.002190280748985751, "phrase": "presentation_style"}, {"score": 0.0021655683497137234, "phrase": "spatial_information"}, {"score": 0.002129020447793464, "phrase": "wayfinding_tasks"}, {"score": 0.0021049977753042253, "phrase": "users'_spatial_ability"}], "paper_keywords": [""], "paper_abstract": "It is difficult for a navigator to find directions to a given target in an unfamiliar environment, especially a virtual environment. The commonly used overview maps can show survey knowledge only on one particular scale but cannot provide spatial knowledge at other scales. In this study, three wayfinding aids (a view-in-view map, animation guide, and human system collaboration) were compared experimentally in terms of effectiveness, efficiency, and users' satisfaction. Results show that although these three aids all can effectively help participants find targets quicker and easier, their usefulness is different, with the view-in-view map being the best and human system collaboration the worst. Their usefulness also appears to be different for people with different spatial abilities. The results indicate that the design of wayfinding tools in virtual environments should consider the type and the presentation style of spatial information based on wayfinding tasks and users' spatial ability.", "paper_title": "Evaluation of Wayfinding Aids in Virtual Environment", "paper_id": "WOS:000262473100001"}