{"auto_keywords": [{"score": 0.015719662819106354, "phrase": "dual_functional_inhibitors"}, {"score": 0.015545470835374107, "phrase": "wild_type"}, {"score": 0.013547257766873485, "phrase": "molecular_docking"}, {"score": 0.004568330027023409, "phrase": "qsar"}, {"score": 0.004449772140968921, "phrase": "useful_information"}, {"score": 0.0037153426267756452, "phrase": "-qsar_models"}, {"score": 0.003407549468745519, "phrase": "comsia"}, {"score": 0.0031606404966938568, "phrase": "different_molecular_skeletons"}, {"score": 0.003113441660343867, "phrase": "comfa_models"}, {"score": 0.0030097975788892896, "phrase": "binding_sites"}, {"score": 0.002920561105784389, "phrase": "reasonable_pharmacophore_model"}, {"score": 0.0027499252661633525, "phrase": "experimentally_determined_inhibitors"}, {"score": 0.0026483647033436674, "phrase": "compound_database_specs."}, {"score": 0.002550545394070177, "phrase": "new_clues"}, {"score": 0.002502995662011305, "phrase": "potent_dual_functional_drug"}, {"score": 0.0024014759148123736, "phrase": "positively_charged_aliphatic_group"}, {"score": 0.002295406551990453, "phrase": "electronic_density"}, {"score": 0.0021940118003312397, "phrase": "small_branched_aliphatic_group"}, {"score": 0.0021049977753042253, "phrase": "negatively_charged_bulky_substituents"}], "paper_keywords": ["HIV-1", " reverse transcriptase", " 3D-QSAR", " 4,1-benzoxazepinones", " K103N mutant"], "paper_abstract": "To find useful information for discovering dual functional inhibitors against both wild type (WT) and K103N mutant reverse transcriptases (RTs) of HIV-1, molecular docking and 3D-QSAR approaches were applied to a set of twenty-five 4,1-benzoxazepinone analogues of efavirenz (SUSTIVA (R)), some of them are active against the two RTs. 3D-QSAR models were constructed, based on their binding conformations determined by molecular docking, with r(cv)(2) values ranging from 0.656 to 0.834 for CoMFA and CoMSIA, respectively. The models were then validated to be highly predictive and extrapolative by inhibitors in two test sets with different molecular skeletons. Furthermore, CoMFA models were found to be well matched with the binding sites of both WT and K103N RTs. Finally, a reasonable pharmacophore model of 4,1-benzoxazepinones were established. The application of the model not only successfully differentiated the experimentally determined inhibitors from non-inhibitors, but also discovered two potent inhibitors from the compound database SPECS. On the basis of both the 3D-QSAR and pharmacophore models, new clues for discovering and designing potent dual functional drug leads against HIV-1 were proposed: (i) adopting positively charged aliphatic group at the cis-substituent of C3; (ii) reducing the electronic density at the position of O4; (iii) positioning a small branched aliphatic group at position of C5; (iv) using the negatively charged bulky substituents at position of C7.", "paper_title": "Towards discovering dual functional inhibitors against both wild type and K103N mutant HIV-1 reverse transcriptases: molecular docking and QSAR studies on 4,1-benzoxazepinone analogues", "paper_id": "WOS:000241554400002"}