{"auto_keywords": [{"score": 0.03990375567083471, "phrase": "arbitrary_networks"}, {"score": 0.02549118587033291, "phrase": "global_mean_infection_rate"}, {"score": 0.00481495049065317, "phrase": "computer_virus"}, {"score": 0.004619134710069517, "phrase": "important_problem"}, {"score": 0.004524220016675624, "phrase": "fair_amount"}, {"score": 0.004449688143230257, "phrase": "early_investigations"}, {"score": 0.004358240019060018, "phrase": "biological_epidemic_models"}, {"score": 0.004250969091124481, "phrase": "so-called_homogeneity_assumption"}, {"score": 0.004077995480957875, "phrase": "later_studies"}, {"score": 0.00402748353567517, "phrase": "often_unrealistic_homogeneity_assumption"}, {"score": 0.003831591603702392, "phrase": "epidemic_models"}, {"score": 0.003600022318864217, "phrase": "push-based_infection"}, {"score": 0.00352597432462803, "phrase": "infectious_node"}, {"score": 0.0033266163944946216, "phrase": "pull-based_infection"}, {"score": 0.0031125001790084936, "phrase": "present_article"}, {"score": 0.0029242629306714773, "phrase": "nonlinear_dynamical_systems_approach"}, {"score": 0.002624482632439123, "phrase": "epidemic_threshold"}, {"score": 0.002424984362388813, "phrase": "upper_and_lower_bounds"}, {"score": 0.0021049977753042253, "phrase": "small_constant_number"}], "paper_keywords": ["Security", " Epidemic dynamics", " epidemic models", " epidemic threshold", " network", " graph", " eigenvalue"], "paper_abstract": "Understanding the dynamics of computer virus (malware, worm) in cyberspace is an important problem that has attracted a fair amount of attention. Early investigations for this purpose adapted biological epidemic models, and thus inherited the so-called homogeneity assumption that each node is equally connected to others. Later studies relaxed this often unrealistic homogeneity assumption, but still focused on certain power-law networks. Recently, researchers investigated epidemic models in arbitrary networks (i.e., no restrictions on network topology). However, all these models only capture push-based infection, namely that an infectious node always actively attempts to infect its neighboring nodes. Very recently, the concept of pull-based infection was introduced but was not treated rigorously. Along this line of research, the present article investigates push- and pull-based epidemic spreading dynamics in arbitrary networks, using a nonlinear dynamical systems approach. The article advances the state-of-the-art as follows: (1) It presents a more general and powerful sufficient condition (also known as epidemic threshold in the literature) under which the spreading will become stable. (2) It gives both upper and lower bounds on the global mean infection rate, regardless of the stability of the spreading. (3) It offers insights into, among other things, the estimation of the global mean infection rate through localized monitoring of a small constant number of nodes, without knowing the values of the parameters.", "paper_title": "Push- and Pull-Based Epidemic Spreading in Networks: Thresholds and Deeper Insights", "paper_id": "WOS:000309426500003"}