{"auto_keywords": [{"score": 0.04704155758238807, "phrase": "second_method"}, {"score": 0.0424769430590298, "phrase": "flight_device"}, {"score": 0.00476272232146049, "phrase": "citrus_mechanical_harvesting_machineries"}, {"score": 0.004723921546336048, "phrase": "first_method"}, {"score": 0.004609396809058648, "phrase": "random_arrival_process"}, {"score": 0.004460985154171165, "phrase": "singulated_fruits"}, {"score": 0.004424631631964781, "phrase": "first_approach"}, {"score": 0.00428214338552216, "phrase": "flow_rate"}, {"score": 0.004212622018863036, "phrase": "granular_fertilizer_particles"}, {"score": 0.004178283966378166, "phrase": "similar_approach"}, {"score": 0.004076933247171219, "phrase": "large_time"}, {"score": 0.0038498693248710837, "phrase": "clump_lengths"}, {"score": 0.0035471762445354253, "phrase": "independent_arrival_process"}, {"score": 0.0031284745499175507, "phrase": "conveyor_belt"}, {"score": 0.0028902212010471127, "phrase": "flow_regime"}, {"score": 0.0027893762434234304, "phrase": "flow_separation_section"}, {"score": 0.0027141975147496264, "phrase": "five_channels"}, {"score": 0.002633832886254408, "phrase": "laser-based_photo-interruption_sensors"}, {"score": 0.0025628355581338563, "phrase": "poisson-based_approach"}, {"score": 0.002541910967437926, "phrase": "good_accuracy"}, {"score": 0.0025211567863488962, "phrase": "laboratory_tests"}, {"score": 0.0023418133729330303, "phrase": "unrefined_sensor"}, {"score": 0.0022416018710803122, "phrase": "full_size_canopy_shaker_fruit_harvester"}, {"score": 0.002157433262687853, "phrase": "potential_errors"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Time of flight", " Poisson process"], "paper_abstract": "Two fruit counting methods were developed for citrus mechanical harvesting machineries. The first method relied on the flow of fruits forming a random arrival process (Poisson process), whereas the second method relied on counting singulated fruits. The first approach was based on a method developed earlier targeted at measuring the flow rate and mean particle diameter of granular fertilizer particles. A similar approach was used in this research, where a large time of flight device was developed that measured the lengths of clumps of fruits falling through the time of flight device. The clump lengths were subsequently used to estimate the number of fruits passing the sensor per time unit. This method can only work accurately if the flow of fruits constitutes an independent arrival process (Poisson process). The advantage of this method is that it is non-intrusive, founded on theory and does not require calibration. However, during experiments it became evident that the flow of fruits directly after being transported from a conveyor belt was not Poisson driven, and therefore the method failed. As an alternative, a second method was developed which did not rely on any assumptions about the flow regime and is also virtually non-intrusive. This method uses a flow separation section which funnels and singulates the flow of fruits into five channels. The fruits in these channels were counted individually using laser-based photo-interruption sensors. This method, although more rudimentary than the Poisson-based approach, yielded good accuracy: during laboratory tests, where a total of 2000 fruits passed the sensor, 1996 were counted, yielding an error of 0.2%. This result was obtained with an unrefined sensor, and further increase in accuracy may be possible. Testing is planned on a full size canopy shaker fruit harvester under field conditions to assess the robustness and to develop methods to resolve potential errors introduced by debris. (c) 2008 Elsevier B.V. All rights reserved.", "paper_title": "Two fruit counting techniques for citrus mechanical harvesting machinery", "paper_id": "WOS:000263644600005"}