{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "coding_operations"}, {"score": 0.04976229174017987, "phrase": "network_coding"}, {"score": 0.010013733884551606, "phrase": "neighbourhood_search"}, {"score": 0.00922034243606934, "phrase": "feasible_individual"}, {"score": 0.004767261858417823, "phrase": "based_multicast"}, {"score": 0.004657808551825796, "phrase": "telecommunications_networks"}, {"score": 0.004581162468419365, "phrase": "valid_data_transmission"}, {"score": 0.00397175830521626, "phrase": "efficient_evolutionary_algorithm"}, {"score": 0.003778755692995768, "phrase": "genetic_algorithms"}, {"score": 0.003691913669486176, "phrase": "proposed_evolutionary_algorithm"}, {"score": 0.003667468902144262, "phrase": "namely_a_new_crossover_operator"}, {"score": 0.0036311037851931498, "phrase": "neighbourhood_search_operator"}, {"score": 0.0035594478687904743, "phrase": "highly_complex_problem"}, {"score": 0.003500812175550438, "phrase": "new_crossover"}, {"score": 0.003375179864844835, "phrase": "selected_parent_individuals"}, {"score": 0.0033306180744375616, "phrase": "resulting_offspring"}, {"score": 0.0030855348881460107, "phrase": "feasible_individuals"}, {"score": 0.002974760986688745, "phrase": "greedy_link_removal"}, {"score": 0.002877502286766111, "phrase": "specific_problem_feature"}, {"score": 0.002587081502365341, "phrase": "better_routing_subgraph"}, {"score": 0.0025024660249697408, "phrase": "solution_quality"}, {"score": 0.00234142781099973, "phrase": "benchmark_networks"}, {"score": 0.0021049977753042253, "phrase": "optimal_solutions"}], "paper_keywords": ["Evolutionary computation", " Multicast", " Network coding", " Telecommunications"], "paper_abstract": "In telecommunications networks, to enable a valid data transmission based on network coding, any intermediate node within a given network is allowed, if necessary, to perform coding operations. The more coding operations needed, the more coding resources consumed and thus the more computational overhead and transmission delay incurred. This paper investigates an efficient evolutionary algorithm to minimize the amount of coding operations required in network coding based multicast. Based on genetic algorithms, we adapt two extensions in the proposed evolutionary algorithm, namely a new crossover operator and a neighbourhood search operator, to effectively solve the highly complex problem being concerned. The new crossover is based on logic OR operations to each pair of selected parent individuals, and the resulting offspring are more likely to become feasible. The aim of this operator is to intensify the search in regions with plenty of feasible individuals. The neighbourhood search consists of two moves which are based on greedy link removal and path reconstruction, respectively. Due to the specific problem feature, it is possible that each feasible individual corresponds to a number of, rather than a single, valid network coding based routing subgraphs. The neighbourhood search is applied to each feasible individual to find a better routing subgraph that consumes less coding resource. This operator not only improves solution quality but also accelerates the convergence. Experiments have been carried out on a number of fixed and randomly generated benchmark networks. The results demonstrate that with the two extensions, our evolutionary algorithm is effective and outperforms a number of state-of-the-art algorithms in terms of the ability of finding optimal solutions.", "paper_title": "On minimizing coding operations in network coding based multicast: an evolutionary algorithm", "paper_id": "WOS:000342426700011"}