{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "clock_network_buffer_sizing_problem"}, {"score": 0.004536029676655286, "phrase": "significantly_improved_results"}, {"score": 0.004473982381245469, "phrase": "conflicting_power"}, {"score": 0.004234129588974058, "phrase": "geometric_programming_format"}, {"score": 0.0041001740903338834, "phrase": "maximum_reduction"}, {"score": 0.0037402558657576124, "phrase": "buffer_sizing_problem"}, {"score": 0.0036553070575015344, "phrase": "geometric_programming_problem"}, {"score": 0.0036052633308076933, "phrase": "globally_optimal_solutions"}, {"score": 0.0034433297275344877, "phrase": "geometric_programming_multiobjective_model"}, {"score": 0.0031553611552558986, "phrase": "presented_self-tuning_multiobjective_formulation"}, {"score": 0.0030554300179552415, "phrase": "buffer_sizes"}, {"score": 0.0029722900280316216, "phrase": "tuning_parameters"}, {"score": 0.0029181203386806683, "phrase": "overall_combined_reduction"}, {"score": 0.0024389277933858054, "phrase": "smart_heuristic"}, {"score": 0.0023834640793589414, "phrase": "continuous_geometric_programming_solution"}, {"score": 0.002163930783583212, "phrase": "proposed_models"}], "paper_keywords": ["Clock networks", " geometric programming", " robust optimization"], "paper_abstract": "In this paper, we present and analyze four efficient models that produce significantly improved results by optimizing conflicting power and skew objectives in the clock network buffer sizing problem. Each model is in geometric programming format and has certain advantages, such as maximum reduction in power, robustness to process variation, and striking a balance between skew and power optimization. The buffer sizing problem is formulated as a geometric programming problem to provide globally optimal solutions to the four models. We also show that a geometric programming multiobjective model can be used to optimize both power and skew without requiring any tuning from a designer. The presented self-tuning multiobjective formulation not only provides optimal solutions for buffer sizes, but also finds the tuning parameters that result in overall combined reduction in power and skew without loss of convexity. The effectiveness of the models are illustrated on several publicly available benchmarks. The models provide on average 40% to 60% improvement in power while reducing skew in several cases. We have also proposed a smart heuristic for discretization of the continuous geometric programming solution that preserves skew and power. Finally, we provide a guideline for designers to decide which one of the proposed models is the most appropriate for their needs.", "paper_title": "Variation-Aware Geometric Programming Models for the Clock Network Buffer Sizing Problem", "paper_id": "WOS:000338135300005"}