{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "overconfident_agents"}, {"score": 0.049390246951185, "phrase": "collective_learning"}, {"score": 0.04565647474624859, "phrase": "objective_reality"}, {"score": 0.004478308876320956, "phrase": "agents'_beliefs"}, {"score": 0.003334309053314909, "phrase": "joint_action"}, {"score": 0.00320770578058916, "phrase": "individual_beliefs"}, {"score": 0.002828418443899226, "phrase": "different_belief"}, {"score": 0.002630299922281955, "phrase": "learning_system"}, {"score": 0.0025059724686541263, "phrase": "heterogenous_confidence"}, {"score": 0.0023079225317714815, "phrase": "major_impact"}, {"score": 0.0021670777282518424, "phrase": "small_number"}, {"score": 0.0021049977753042253, "phrase": "whole_group"}], "paper_keywords": ["agent-based computational economics", " belief dissemination", " bounded-confidence", " simulation agents", " social influence"], "paper_abstract": "In this paper we present a model of influence where agents' beliefs are based on an objective reality, such as the properties of an environment. The perception of the objective reality is not direct: all that the agents know is that the more correct a belief, the more successful the actions that are deduced from this belief. A pair of agents can influence each other when they perform a joint action. They are not only defined by individual beliefs, but also idiosyncratic confidence about their belief: this means that they are not all willing to engage in an action with agents with a different belief and to be influenced by them. After exploring the dynamics of our influence and learning system with agents that have the same confidence, we study heterogenous confidence among agents. We show here that the distribution of confidence in the group has a major impact on the speed and quality of collective learning and in particular that a small number of overconfident agents can prevent the whole group from learning properly.", "paper_title": "When overconfident agents slow down collective learning", "paper_id": "WOS:000298745300005"}