{"auto_keywords": [{"score": 0.04423467024884345, "phrase": "cleaning_tools"}, {"score": 0.032213862412520645, "phrase": "qoco"}, {"score": 0.010063919084952444, "phrase": "user_query"}, {"score": 0.00481495049065317, "phrase": "key_decisions"}, {"score": 0.003670157084732341, "phrase": "existing_data"}, {"score": 0.003210446135114967, "phrase": "user_queries"}, {"score": 0.0030086877092638945, "phrase": "domain_experts"}, {"score": 0.002936331371903168, "phrase": "oracle_crowds"}, {"score": 0.0028890603352364273, "phrase": "potentially_wrong_or_missing_answers"}, {"score": 0.0027184540871935284, "phrase": "wrong_data"}, {"score": 0.002547535564922075, "phrase": "world_cup_games_database"}, {"score": 0.002311047934798247, "phrase": "qoco's_underlying_operations"}, {"score": 0.0022371907579775796, "phrase": "search_space"}, {"score": 0.0021049977753042253, "phrase": "cleaning_process"}], "paper_keywords": [""], "paper_abstract": "As key decisions are often made based on information contained in a database, it is important for the database to be as complete and correct as possible. For this reason, many data cleaning tools have been developed to automatically resolve inconsistencies in databases. However, data cleaning tools provide only best-effort results and usually cannot eradicate all errors that may exist in a database. Even more importantly, existing data cleaning tools do not typically address the problem of determining what information is missing from a database. To tackle these problems, we present QOCO, a novel query oriented cleaning system that leverages materialized views that are defined by user queries as a trigger for identifying the remaining incorrect/missing information. Given a user query, QOCO interacts with domain experts (which we model as oracle crowds) to identify potentially wrong or missing answers in the result of the user query, as well as determine and correct the wrong data that is the cause for the error(s). We will demonstrate QOCO over a World Cup Games database, and illustrate the interaction between QOCO and the oracles. Our demo audience will play the role of oracles, and we show how QOCO's underlying operations and optimization mechanisms can effectively prune the search space and minimize the number of questions that need to be posed to accelerate the cleaning process.", "paper_title": "QOCO: A Query Oriented Data Cleaning System with Oracles", "paper_id": "WOS:000386424800061"}