{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "minimum_cycle_basis"}, {"score": 0.01232290533130166, "phrase": "directed_graphs"}, {"score": 0.006387855933448897, "phrase": "vector_space"}, {"score": 0.006161734911975057, "phrase": "cycle_space"}, {"score": 0.005664584300053689, "phrase": "cycle_basis"}, {"score": 0.00455202992136173, "phrase": "directed_graph"}, {"score": 0.004461634909525319, "phrase": "n_vertices"}, {"score": 0.00441779829096465, "phrase": "undirected_graph"}, {"score": 0.004338076511024884, "phrase": "non-negative_weights"}, {"score": 0.0037999551521987426, "phrase": "g._a_set"}, {"score": 0.003108669771132255, "phrase": "first_polynomial-time_algorithm"}, {"score": 0.002299689297293321, "phrase": "lower_weight"}, {"score": 0.002244876254113051, "phrase": "underlying_undirected_graph"}, {"score": 0.0021049977753042253, "phrase": "black_boxes"}], "paper_keywords": [""], "paper_abstract": "We consider the problem of computing a minimum cycle basis in a directed graph G with m arcs and n vertices. The arcs of G have non-negative weights assigned to them. In this problem a {-1, 0, 1} incidence vector is associated with each cycle and the vector space over Q generated by these vectors is the cycle space of G. A set of cycles is called a cycle basis of G if it forms a basis for its cycle space. A cycle basis where the sum of weights of the cycles is minimum is called a minimum cycle basis of G. This paper presents an (O) over tilde (m(4)n) algorithm, which is the first polynomial-time algorithm for computing a minimum cycle basis in G. We then improve it to an (O) over tilde (m(4)) algorithm. The problem of computing a minimum cycle basis in an undirected graph has been well studied. In this problem a {0, 1} incidence vector is associated with each cycle and the vector space over GF(2) generated by these vectors is the cycle space of the graph. There are directed graphs in which the minimum cycle basis has lower weight than any cycle basis of the underlying undirected graph. Hence algorithms for computing a minimum cycle basis in an undirected graph cannot be used as black boxes to solve the problem in directed graphs.", "paper_title": "Algorithms to compute minimum cycle basis in directed graphs", "paper_id": "WOS:000245244400011"}