{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "geographic_correlated_failures"}, {"score": 0.010832346961911805, "phrase": "weighted_spectrum"}, {"score": 0.004759635663291431, "phrase": "wide_area_backbone_communication_networks"}, {"score": 0.004440780432053927, "phrase": "network_component_failures"}, {"score": 0.004314285113050873, "phrase": "power_failures"}, {"score": 0.004167218012926657, "phrase": "geographical_correlated_failures"}, {"score": 0.0032496585171039797, "phrase": "network_survivability"}, {"score": 0.0031026497891826726, "phrase": "comparative_analysis"}, {"score": 0.002877769867854964, "phrase": "optimization_problem"}, {"score": 0.0027634902834910184, "phrase": "largest_impact"}, {"score": 0.002548331088496964, "phrase": "numerical_results"}, {"score": 0.002418923027024191, "phrase": "geographic_cuts"}, {"score": 0.0022696277881969896, "phrase": "weighted_graph"}, {"score": 0.0022305310659333864, "phrase": "proposed_weighted_spectrum_measure"}], "paper_keywords": ["Network survivability", " Geographic correlated vulnerabilities", " Weighted spectrum"], "paper_abstract": "Wide area backbone communication networks are subject to a variety of hazards that can result in network component failures. Hazards such as power failures and storms can lead to geographical correlated failures. Recently there has been increasing interest in determining the ability of networks to survive geographic correlated failures and a number of measures to quantify the effects of failures have appeared in the literature. This paper proposes the use of weighted spectrum to evaluate network survivability regarding geographic correlated failures. Further we conduct a comparative analysis by finding the most vulnerable geographic cuts or nodes in the network though solving an optimization problem to determine the cut with the largest impact for a number of measures in the literature as well as weighted spectrum. Numerical results on several sample network topologies show that the worst-case geographic cuts depend on the measure used in an unweighted or a weighted graph. The proposed weighted spectrum measure is shown to be more versatile than other measures in both unweighted and weighted graphs. (C) 2014 Elsevier B.V. All rights reserved.", "paper_title": "Measuring the survivability of networks to geographic correlated failures", "paper_id": "WOS:000342862900004"}