{"auto_keywords": [{"score": 0.032146637220768326, "phrase": "lss-lrta"}, {"score": 0.015719714774698124, "phrase": "real-time_and_incremental_heuristic_search"}, {"score": 0.00467855218490191, "phrase": "real-time_situated_agents"}, {"score": 0.004578783486828809, "phrase": "real-time_computer_games"}, {"score": 0.0041703614123283165, "phrase": "action_executions"}, {"score": 0.004023120753104693, "phrase": "user-specified_coordinates"}, {"score": 0.003951453722517865, "phrase": "real-time_requirements"}, {"score": 0.0035729944980593324, "phrase": "fast_heuristic_search_methods"}, {"score": 0.0035346515636097533, "phrase": "navigation_tasks"}, {"score": 0.0034467717443162015, "phrase": "different_ways"}, {"score": 0.0030609320300175953, "phrase": "competitive_real-time_heuristic_search_method"}, {"score": 0.0029740732099993706, "phrase": "learning_real-time_a"}, {"score": 0.0026986685585382347, "phrase": "state-of-the-art_incremental_heuristic_search_method_d"}, {"score": 0.0025112011945912327, "phrase": "first_comparison"}, {"score": 0.00232832698253493, "phrase": "search_objective"}, {"score": 0.002174346780014853, "phrase": "right_conditions"}, {"score": 0.0021278653331014592, "phrase": "time_pressure"}, {"score": 0.0021049977753042253, "phrase": "user-supplied_h-values"}], "paper_keywords": ["Time constraints", " Agents", " Real-time search", " Incremental search"], "paper_abstract": "Real-time situated agents, such as characters in real-time computer games, often do not know the terrain in advance but automatically observe it within a certain range around themselves. They have to interleave searches with action executions to make the searches tractable when moving autonomously to user-specified coordinates. The searches face real-time requirements since it is important that the agents be responsive to the commands of the users and move smoothly. In this article, we compare two classes of fast heuristic search methods for these navigation tasks that speed up A* searches in different ways, namely real-time heuristic search and incremental heuristic search, to understand their advantages and disadvantages and make recommendations about when each one should be used. We first develop a competitive real-time heuristic search method. LSS-LRTA* is a version of Learning Real-Time A* that uses A* to determine its local search spaces and learns quickly. We analyze the properties of LSS-LRTA* and then compare it experimentally against the state-of-the-art incremental heuristic search method D* Lite on our navigation tasks, for which D* Lite was specifically developed, resulting in the first comparison of real-time and incremental heuristic search in the literature. We characterize when to choose each one of the two heuristic search methods, depending on the search objective and the kind of terrain. Our experimental results show that LSS-LRTA* can outperform D* Lite under the right conditions, namely when there is time pressure or the user-supplied h-values are generally not misleading.", "paper_title": "Comparing real-time and incremental heuristic search for real-time situated agents", "paper_id": "WOS:000263159400001"}