{"auto_keywords": [{"score": 0.048506844221552735, "phrase": "adjacency_matrix"}, {"score": 0.004598933498016774, "phrase": "graph_g"}, {"score": 0.004392565073466714, "phrase": "diagonal_matrix"}, {"score": 0.004248294537944227, "phrase": "corresponding_vertices"}, {"score": 0.004040688646993605, "phrase": "isospectral_graphs"}, {"score": 0.003924284136338428, "phrase": "adjacency_matrix_a"}, {"score": 0.003795335309109018, "phrase": "additional_graph_matrices"}, {"score": 0.0037480753312398754, "phrase": "-_v_matrix"}, {"score": 0.0036553070575015344, "phrase": "laplace_matrix"}, {"score": 0.0033482708495261864, "phrase": "main_diagonal"}, {"score": 0.003265365666305185, "phrase": "natural_distance_matrix"}, {"score": 0.0030541531847589807, "phrase": "n-dimensional_space"}, {"score": 0.002941389980674657, "phrase": "distance_matrix"}, {"score": 0.0025623050508233078, "phrase": "length_m"}, {"score": 0.0024883835349005863, "phrase": "isospectral_mates"}], "paper_keywords": [""], "paper_abstract": "Let A be the adjacency matrix of a graph G, let D be its distance matrix and let V be the diagonal matrix with elements that indicate the valence of corresponding vertices. We explore possibility of discriminating the degree of similarity between isospectral graphs (having the same eigenvalues of the adjacency matrix A) by examining their spectral properties with respect to additional graph matrices: A - V matrix, which is essentially the Laplace matrix multiplied by -1; AA(T) - V matrix, which is obtained from AA(T) where elements on the main diagonal are replaced by zeros; natural distance matrix (N)DD, constructed from distances between columns of the adjacency matrix viewed as vectors in N-dimensional space; terminal matrix, which is really the distance matrix between the vertices of degree 1, also called terminal vertices. We found that matrices of form A(m) - V, the elements of which count non-returning walk of length m in a graph, discriminate some isospectral mates, but not others. We refer to pair of graphs which agree in eigenvalues of several matrices as strongly-isospectral, or S-isospectral graphs, as opposed to those less strongly similar. Hence, in other words, some graphs are more S-isospectral than other.", "paper_title": "Some Graphs Are More Strongly-Isospectral than Others", "paper_id": "WOS:000277903500014"}