{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "software_testers"}, {"score": 0.006198638628664817, "phrase": "performance_appraisal"}, {"score": 0.0045599093158915326, "phrase": "suitable_performance_appraisal_approach"}, {"score": 0.00442651096522781, "phrase": "research_and_practice_purposes"}, {"score": 0.004296998284839309, "phrase": "relevant_literature"}, {"score": 0.0038919354605673104, "phrase": "industry_practice"}, {"score": 0.003649277504586372, "phrase": "project_managers"}, {"score": 0.0035954555250614197, "phrase": "proposed_performance_appraisal_form"}, {"score": 0.002862648127577722, "phrase": "specialized_performance_appraisal_method"}, {"score": 0.0027925723953701083, "phrase": "detailed_opinions"}, {"score": 0.002336071138145897, "phrase": "test_cases"}, {"score": 0.0022675820982741347, "phrase": "software_testers'_performance"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Performance appraisal", " Software testers", " Project management"], "paper_abstract": "Context: To determine the effectiveness of software testers a suitable performance appraisal approach is necessary, both for research and practice purposes. However, review of relevant literature reveals little information of how software testers are appraised in practice. Objective: (i) To enhance our knowledge of industry practice of performance appraisal of software testers and (ii) to collect feedback from project managers on a proposed performance appraisal form for software testers. Method: A web-based survey with questionnaire was used to collect responses. Participants were recruited using cluster and snowball sampling. 18 software development project managers participated. Results: We found two broad trends in performance appraisal of software testers - same employee appraisal process for all employees and a specialized performance appraisal method for software testers. Detailed opinions were collected and analyzed on how performance of software testers should be appraised. Our proposed appraisal approach was generally well-received. Conclusion: Factors such as number of bugs found after delivery and efficiency of executing test cases were considered important in appraising software testers' performance. Our proposed approach was refined based on the feedback received. (C) 2013 Elsevier B.V. All rights reserved.", "paper_title": "Performance appraisal of software testers", "paper_id": "WOS:000335545000004"}