{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "eye-tracking_study"}, {"score": 0.04830236777788386, "phrase": "source_code_summarization"}, {"score": 0.004512814529823301, "phrase": "emerging_technology"}, {"score": 0.00441635700580562, "phrase": "brief_descriptions"}, {"score": 0.004321952227344232, "phrase": "current_summarization_techniques"}, {"score": 0.003407214479510987, "phrase": "high-quality_selection"}, {"score": 0.0028968858148006823, "phrase": "source_code"}, {"score": 0.0026423134393535243, "phrase": "java_methods"}, {"score": 0.002599763359352916, "phrase": "english_summaries"}, {"score": 0.002436289099444074, "phrase": "novel_summarization_tool"}, {"score": 0.002246292543825748, "phrase": "programmers'_method_summaries"}, {"score": 0.0022101055924375725, "phrase": "specific_keyword_usage"}, {"score": 0.0021049977753042253, "phrase": "source_code_summarization_systems"}], "paper_keywords": ["Source code summaries", " program comprehension"], "paper_abstract": "Source Code Summarization is an emerging technology for automatically generating brief descriptions of code. Current summarization techniques work by selecting a subset of the statements and keywords from the code, and then including information from those statements and keywords in the summary. The quality of the summary depends heavily on the process of selecting the subset: a high-quality selection would contain the same statements and keywords that a programmer would choose. Unfortunately, little evidence exists about the statements and keywords that programmers view as important when they summarize source code. In this paper, we present an eye-tracking study of 10 professional Java programmers in which the programmers read Java methods and wrote English summaries of those methods. We apply the findings to build a novel summarization tool. Then, we evaluate this tool. Finally, we further analyze the programmers' method summaries to explore specific keyword usage and provide evidence to support the development of source code summarization systems.", "paper_title": "An Eye-Tracking Study of Java Programmers and Application to Source Code Summarization", "paper_id": "WOS:000365018200001"}