{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "function_models"}, {"score": 0.013722302520483766, "phrase": "additional_knowledge"}, {"score": 0.0047527118741586055, "phrase": "mechanical_design"}, {"score": 0.00445332728705756, "phrase": "topological_information"}, {"score": 0.004310752197635499, "phrase": "mechanical_engineering_design"}, {"score": 0.003986844722309844, "phrase": "information_content"}, {"score": 0.0032792555200980783, "phrase": "function_model"}, {"score": 0.0032157824854214313, "phrase": "first_approach"}, {"score": 0.003133052778244851, "phrase": "uniform_unconditional_probability"}, {"score": 0.0028973794653974327, "phrase": "second_approach"}, {"score": 0.0022763657774198184, "phrase": "new_graphical_representation"}, {"score": 0.002232261129770455, "phrase": "syntactic_grammar_rules"}, {"score": 0.0021049977753042253, "phrase": "example_function_model"}], "paper_keywords": [""], "paper_abstract": "In this paper, two approaches for computing the topological information content of function models in mechanical engineering design are developed and compared. Previously, a metric for computing information content of functions and flows within function models was proposed. Here, this metric is evolved to include the information contained in the connections between flows and functions in a function model. The first approach is based on uniform unconditional probability of a flow connecting any two functions within the model. The second approach is based on additional knowledge that the functions and flows in a model have limited compatibility, thereby, reducing the choices for origin and destination functions for each flow. This additional knowledge is represented using a new graphical representation supported by syntactic grammar rules. Both approaches are then applied to an example function model. Comparison between the approaches shows that the inclusion of this additional knowledge increases the expressiveness by reducing the uncertainty associated with function models. [DOI: 10.1115/1.3462918]", "paper_title": "Topological Information Content and Expressiveness of Function Models in Mechanical Design", "paper_id": "WOS:000283014600004"}