{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "selective_dpp-iv_inhibitors"}, {"score": 0.004707913053935566, "phrase": "virtual_screening"}, {"score": 0.004603244077348199, "phrase": "molecular_dynamics_simulations"}, {"score": 0.0045262653692203815, "phrase": "present_study"}, {"score": 0.00397714507836836, "phrase": "virtual_screening_workflow"}, {"score": 0.0038668462001710314, "phrase": "schrodinger_software"}, {"score": 0.0034944094552943, "phrase": "homology_modeled_structures"}, {"score": 0.002951444412262927, "phrase": "dpp-iv_protein"}, {"score": 0.002805597755796506, "phrase": "better_binding_affinity"}, {"score": 0.0026370661343466354, "phrase": "binding_poses"}, {"score": 0.002506715532901322, "phrase": "different_softwares"}, {"score": 0.0023962545023307937, "phrase": "proposed_binding_modes"}, {"score": 0.0021288561076024844, "phrase": "hydrazine_derivatives"}, {"score": 0.0021049977753042253, "phrase": "highly_selective_dpp-iv_inhibitors"}], "paper_keywords": ["Dipeptidyl peptidase-IV inhibitor", " Hydrazine derivative", " Virtual screening", " Molecular dynamics", " Sitagliptine"], "paper_abstract": "The present study demonstrates and validates the discovery of two novel hydrazine derivatives as selective dipeptidyl peptidase-IV (DPP-IV) inhibitors. Virtual screening (VS) of publicly available databases was performed using virtual screening workflow (VSW) of Schrodinger software against DPP-IV and the most promising hits were selected. Selectivity was further assessed by docking the hits against homology modeled structures of DPP8 and DPP9. Two novel hydrazine derivatives were selected for further studies based on their selectivity threshold. To assess their correct binding modes and stability of their complexes with enzyme, molecular dynamic (MD) simulation studies were performed against the DPP-IV protein and the results revealed that they had a better binding affinity towards DPP-IV as compared to DPP 8 and DPP 9. The binding poses were further validated by docking these ligands with different softwares (Glide and Gold). The proposed binding modes of hydrazines were found to be similar to sitagliptine and alogliptine. Thus, the study reveals the potential of hydrazine derivatives as highly selective DPP-IV inhibitors.", "paper_title": "Novel hydrazine derivatives as selective DPP-IV inhibitors: findings from virtual screening and validation through molecular dynamics simulations", "paper_id": "WOS:000334934900032"}