{"auto_keywords": [{"score": 0.03450625689256253, "phrase": "decision_systems"}, {"score": 0.015719716506582538, "phrase": "consistent_and_inconsistent_covering_decision_systems"}, {"score": 0.015119649415531204, "phrase": "traditional_rough_set_theory"}, {"score": 0.003980875186335867, "phrase": "covering_rough_set_theory"}, {"score": 0.00270221723573854, "phrase": "necessary_conditions"}, {"score": 0.002547043222086858, "phrase": "discernibility_matrix"}, {"score": 0.0022777800735119405, "phrase": "proposed_attribute_reductions"}, {"score": 0.0022041312401435346, "phrase": "better_classification_performance"}, {"score": 0.002146926767291475, "phrase": "traditional_rough_sets"}], "paper_keywords": ["rough sets", " covering rough sets", " attribute reduction", " discernibility matrix", " consistent covering decision systems", " inconsistent covering decision systems"], "paper_abstract": "Traditional rough set theory is mainly used to extract rules from and reduce attributes in databases in which attributes are characterized by partitions, while the covering rough set theory, a generalization of traditional rough set theory, does the same yet characterizes attributes by covers. In this paper, we propose a way to reduce the attributes of covering decision systems, which are databases characterized by covers. First, we define consistent and inconsistent covering decision systems and their attribute reductions. Then, we state the sufficient and the necessary conditions for reduction. Finally, we use a discernibility matrix to design algorithms that compute all the reducts of consistent and inconsistent covering decision systems. Numerical tests on four public data sets show that the proposed attribute reductions of covering decision systems accomplish better classification performance than those of traditional rough sets. (c) 2007 Elsevier Inc. All rights reserved.", "paper_title": "A new approach to attribute reduction of consistent and inconsistent covering decision systems with covering rough sets", "paper_id": "WOS:000248169700005"}