{"auto_keywords": [{"score": 0.03409675851573747, "phrase": "fuzzy_measure_method"}, {"score": 0.009827565833465545, "phrase": "medical_material"}, {"score": 0.00481495049065317, "phrase": "hospital_materials"}, {"score": 0.004748371393578422, "phrase": "traditional_programming_model"}, {"score": 0.004017437417375057, "phrase": "incomplete_independence_objectives"}, {"score": 0.003907013105134715, "phrase": "fuzzy_measure"}, {"score": 0.003817306032290766, "phrase": "vehicle_routing_problem"}, {"score": 0.003712362078915926, "phrase": "hospital_operation_scale"}, {"score": 0.0034785371344994197, "phrase": "artificial_and_partly_practical_experience"}, {"score": 0.003140401552000472, "phrase": "solving_model"}, {"score": 0.0030825404960282713, "phrase": "immediate_problem"}, {"score": 0.0027570267191549774, "phrase": "chang_gung_children's_hospital"}, {"score": 0.0027188259793109264, "phrase": "research_objective"}, {"score": 0.0025592969422491476, "phrase": "independence_problem"}, {"score": 0.0024091057723923857, "phrase": "decision-maker's_requirement"}, {"score": 0.002331909406363425, "phrase": "objective_programming"}, {"score": 0.002278284823857861, "phrase": "study_model"}], "paper_keywords": ["vehicle routing problem", " fuzzy measure", " hospital material"], "paper_abstract": "The traditional programming model is used to assume that each objective stands independently from one another; however, in reality, some interactions might exist between the criteria or attributes. In order to understand the problem of incomplete independence objectives, this study explores whether fuzzy measure is suitable for the vehicle routing problem or not. With the hospital operation scale expanding, the vehicle transmitting routing, which used to be planned by artificial and partly practical experience, has already insufficient. This study solves the vehicle routing problem by using the fuzzy measure method. It brings up a solving model to solve the immediate problem faced by the department of medical material transmitting in the hospital. Additionally, this study compares the fuzzy measure method with other programming methods, and takes Chang Gung Children's Hospital as the research objective. This study will demonstrate that it is unnecessary to consider the independence problem between objectives and the result of the programming is closer to the decision-maker's requirement when the fuzzy measure method is applied to objective programming. Besides, this study model can be regarded as a reference when the department of medical material transmitting in the hospital meditates its new transmitting routing in the future, or estimates present transmitting routing. (c) 2005 Elsevier Ltd. All rights reserved.", "paper_title": "Fuzzy measure on vehicle routing problem of hospital materials", "paper_id": "WOS:000234846400021"}