{"auto_keywords": [{"score": 0.047363369105007005, "phrase": "agricultural_products"}, {"score": 0.011147561936067456, "phrase": "multiple_appearance_characteristics"}, {"score": 0.010055814189009995, "phrase": "cluster_analysis"}, {"score": 0.009991207192903041, "phrase": "multidimensional_scaling"}, {"score": 0.009927011123945709, "phrase": "discriminant_analysis"}, {"score": 0.0048149508482222, "phrase": "strawberry"}, {"score": 0.004512814529823301, "phrase": "important_indices"}, {"score": 0.004354763128496983, "phrase": "different_varieties"}, {"score": 0.004175066536037121, "phrase": "visual_observations"}, {"score": 0.0038375280115736958, "phrase": "empirical_knowledge"}, {"score": 0.0037513920123532097, "phrase": "multiple_appearance_features"}, {"score": 0.0035965032173588753, "phrase": "correct_evaluation"}, {"score": 0.003459191419478298, "phrase": "new_image_analysis_system"}, {"score": 0.0031383410838018984, "phrase": "quality_evaluations"}, {"score": 0.003118037760163957, "phrase": "cultivar_identification"}, {"score": 0.002998938434207771, "phrase": "appearance_characteristics"}, {"score": 0.0027472888482450776, "phrase": "small_differences"}, {"score": 0.0026681761480139067, "phrase": "multiple_characteristics"}, {"score": 0.0026423134393535265, "phrase": "two-dimensional_surface"}, {"score": 0.0025331002386232014, "phrase": "qualitative_evaluations"}, {"score": 0.0023970487263732737, "phrase": "strawberry_cultivar_classification"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Cultivar identification", " Image analysis", " Quality evaluation", " Strawberry"], "paper_abstract": "The appearances of agricultural products are important indices for evaluating the quality of commodities and the characteristics of different varieties. In general, the appearances are evaluated by experts based on visual observations. However, the concern regarding this method is that it lacks objectivity, and it is not quantifiable because it depends greatly on an empirical knowledge. In addition, agricultural products have multiple appearance features; therefore, several of them need to be analyzed simultaneously for correct evaluation of the appearance. In this study, we developed a new image analysis system that can simultaneously evaluate multiple appearance characteristics such as the color, shape and size, of agricultural products in detail. To evaluate the effectiveness of this system, we conducted quality evaluations and cultivar identification on the basis of cluster analysis, multidimensional scaling and discriminant analysis of the appearance characteristics. The results of the cluster analysis revealed that strawberries could be classified on the basis of their appearance characteristics. Furthermore, we were able to visualize the small differences in the appearance of the fruit based on multiple characteristics on a two-dimensional surface by performing multidimensional scaling. The results demonstrate that our system is effective for qualitative evaluations of the appearance of strawberries. The results of the discriminant analysis revealed that the accuracy of strawberry cultivar classification using 14 cultivars was <42%, when only single feature was used. However, the rate increased to 68% after combining the three features. These results indicate that our system exploits the advantage of analyzing multiple appearance characteristics. (C) 2014 Elsevier B.V. All rights reserved.", "paper_title": "Strawberry cultivar identification and quality evaluation on the basis of multiple fruit appearance features", "paper_id": "WOS:000349881000024"}