{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "precision_agriculture"}, {"score": 0.004470071518923524, "phrase": "site-specific_weed_management_systems"}, {"score": 0.0041136473765874815, "phrase": "spectral_signatures"}, {"score": 0.003671338229632309, "phrase": "automatic_computer_vision_method"}, {"score": 0.003623453648863547, "phrase": "avena_sterilis"}, {"score": 0.0035141291835319682, "phrase": "cereal_crops"}, {"score": 0.0033489371483830153, "phrase": "proposed_method"}, {"score": 0.0032054891061528896, "phrase": "crop_fields"}, {"score": 0.0031498398446368056, "phrase": "decision-making_strategy"}, {"score": 0.0030414140732789186, "phrase": "main_focus"}, {"score": 0.0027985846558073457, "phrase": "image_segmentation_process"}, {"score": 0.00270221723573854, "phrase": "low-level_units"}, {"score": 0.0025192983141887285, "phrase": "structural_based_attributes"}, {"score": 0.0023384629381463054, "phrase": "fuzzy_context"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["precision agriculture", " machine vision", " weed detection", " image segmentation", " multicriteria decision-making"], "paper_abstract": "One of the objectives of precision agriculture is to minimize the volume of herbicides by using site-specific weed management systems. To reach this goal, two major factors need to be considered: (1) the similarity of spectral signatures, shapes, and textures between weeds and crops and (2) irregular distribution of weeds within the crop. This paper outlines an automatic computer vision method for detecting Avena sterilis, a noxious weed growing in cereal crops, and differential spraying to control the weed. The proposed method determines the quantity and distribution of weeds in the crop fields and applies a decision-making strategy for selective spraying, which forms the main focus of the paper. The method consists of two stages: image segmentation and decision-making. The image segmentation process extracts cells from the image as the low-level units. The quantity and distribution of weeds in the cell are mapped as area and structural based attributes, respectively. From these attributes, a multicriteria. decision-making approach under a fuzzy context allows us to decide whether any given cell needs to be sprayed. The method was compared with other existing strategies. (C) 2007 Elsevier B.V. All rights reserved.", "paper_title": "A new vision-based approach to differential spraying in precision agriculture", "paper_id": "WOS:000253333700004"}