{"auto_keywords": [{"score": 0.03976391276230272, "phrase": "inconsistent_prioritized_knowledge_base"}, {"score": 0.02170266079392863, "phrase": "knowledge_base"}, {"score": 0.015892638628255892, "phrase": "minimal_inconsistent_subsets"}, {"score": 0.006906788577414258, "phrase": "intuitive_postulates"}, {"score": 0.00481495049065317, "phrase": "inconsistent_prioritized_knowledge_bases"}, {"score": 0.004716475617022136, "phrase": "prioritized_knowledge_bases"}, {"score": 0.004319255461225845, "phrase": "rational_decisions"}, {"score": 0.00401736307274363, "phrase": "inconsistent_knowledge_base_focus"}, {"score": 0.003579809826486388, "phrase": "inconsistency-tolerant_reasoning"}, {"score": 0.0031067299689394065, "phrase": "general_criteria"}, {"score": 0.003076152130543236, "phrase": "rational_measurements"}, {"score": 0.0025072781579598157, "phrase": "simple_but_explanatory_example"}, {"score": 0.002386218074955624, "phrase": "related_works"}, {"score": 0.002308768837799101, "phrase": "special_characteristics"}, {"score": 0.0022560515732199062, "phrase": "priority_levels"}, {"score": 0.0021684583061292264, "phrase": "inconsistency_measures"}, {"score": 0.0021049977753042253, "phrase": "classical_knowledge_bases"}], "paper_keywords": ["Inconsistency measures", " prioritized knowledge base", " minimal inconsistent subsets", " blame of each formula in inconsistency"], "paper_abstract": "It is increasingly recognized that identifying the degree of blame or responsibility of each formula for inconsistency of a knowledge base (i.e. a set of formulas) is useful for making rational decisions to resolve inconsistency in that knowledge base. Most current techniques for measuring the blame of each formula with regard to an inconsistent knowledge base focus on classical knowledge bases only. Proposals for measuring the blames of formulas with regard to an inconsistent prioritized knowledge base have not yet been given much consideration. However, the notion of priority is important in inconsistency-tolerant reasoning. This article investigates this issue and presents a family of measurements for the degree of blame of each formula in an inconsistent prioritized knowledge base by using the minimal inconsistent subsets of that knowledge base. First of all, we present a set of intuitive postulates as general criteria to characterize rational measurements for the blames of formulas of an inconsistent prioritized knowledge base. Then we present a family of measurements for the blame of each formula in an inconsistent prioritized knowledge base under the guidance of the principle of proportionality, one of the intuitive postulates. We also demonstrate that each of these measurements possesses the properties that it ought to have. Finally, we use a simple but explanatory example in requirements engineering to illustrate the application of these measurements. Compared to the related works, the postulates presented in this article consider the special characteristics of minimal inconsistent subsets as well as the priority levels of formulas. This makes them more appropriate to characterizing the inconsistency measures defined from minimal inconsistent subsets for prioritized knowledge bases as well as classical knowledge bases. Correspondingly, the measures guided by these postulates can intuitively capture the inconsistency for prioritized knowledge bases.", "paper_title": "Measuring the blame of each formula for inconsistent prioritized knowledge bases", "paper_id": "WOS:000304832900006"}