{"auto_keywords": [{"score": 0.048070112256351674, "phrase": "safety_managers"}, {"score": 0.00481495049065317, "phrase": "generic_case-based_reasoning_platform"}, {"score": 0.004501453956464956, "phrase": "prevention_measures"}, {"score": 0.004081385289516914, "phrase": "similar_incident_retrieval"}, {"score": 0.004031699976413366, "phrase": "expertise-driven_advice"}, {"score": 0.003910106508089187, "phrase": "developed_software"}, {"score": 0.003022825806274343, "phrase": "extensive_amount"}, {"score": 0.002825681384008326, "phrase": "accident_cases"}, {"score": 0.002641360377825228, "phrase": "real_accident_database"}, {"score": 0.00259320616168125, "phrase": "marine_industry"}, {"score": 0.002499508839669243, "phrase": "high_potential"}, {"score": 0.002409188797323273, "phrase": "industrial_safety_managers"}, {"score": 0.002210903392596343, "phrase": "company_accident_database"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Accident database", " Case-based reasoning", " Accident software", " Safety management", " Prevention measures"], "paper_abstract": "We developed, made suitable and tested a generic case-based reasoning platform, called Nextcase/safety, for helping safety managers taking decisions on prevention measures more efficiently. Recommendations provided by the software are based on quick and effective past similar incident retrieval and expertise-driven advice. Hence, the developed software makes it easier and more objective for safety managers to draw conclusions and to give recommendations based on the expertise embedded in past incidents when an incident occurs in their company. Nextcase/safety provides its expert user with suggestions and information and does not require an extensive amount of time. The most time-consuming phase is datasheet generation and inputting accident cases into the database. The program was tested using a real accident database from the marine industry. The case-study indicates the high potential of the Nextcase/safety software for all industrial safety managers. Furthermore, the pros and cons of the Nextcase/safety program for building a company accident database were indicated. (C) 2009 Elsevier Ltd. All rights reserved.", "paper_title": "A case-based reasoning safety decision-support tool: Nextcase/safety", "paper_id": "WOS:000266851000020"}