{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "vehicular_networks"}, {"score": 0.0046970764288494764, "phrase": "interest_dissemination_strategy"}, {"score": 0.004342430078306461, "phrase": "user_signatures"}, {"score": 0.00418387341007444, "phrase": "vehicular_ad_hoc_networks"}, {"score": 0.0036653985479652854, "phrase": "future_use"}, {"score": 0.003560807940070886, "phrase": "point_of_interest"}, {"score": 0.0034306925765832633, "phrase": "stored_reviews"}, {"score": 0.0033465923623290034, "phrase": "points_of_interest"}, {"score": 0.002676418520290942, "phrase": "user's_web"}, {"score": 0.0024535580495414783, "phrase": "multi-agent_traffic_simulator"}, {"score": 0.00240328454980006, "phrase": "public_and_private_traffic"}, {"score": 0.0023540741240632343, "phrase": "switzerland"}, {"score": 0.0022773309395419427, "phrase": "trust_simulation"}, {"score": 0.002203117204010397, "phrase": "proposed_scheme"}, {"score": 0.0021579641460002523, "phrase": "realistic_scenario"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Security", " VANETs", " Chains", " Trust", " POI", " Reputation"], "paper_abstract": "This article describes a scheme which to the best of our knowledge is the first one to use user signatures to share information about Points of Interest in Vehicular Ad hoc Networks. In this scheme, users rate restaurants, hotels, etc. and sign those rates with their private key. Then, they broadcast that information and other vehicles store it for future use. When another user needs a Point of Interest recommendation he queries the system for the other users stored reviews and after he visits that Points of Interest for himself, he evaluates it and his level of trust in the reviewers with rates similar to his own increases. In the end, a user will be able to request to his vehicle information on a certain Point of Interest category and it will respond with the recommendations made by other users, prioritizing the ones in the user's Web of Trust. poi-Sim is the tool designed to simulate this scheme. It processes a 24 h mobility trace produced by a Multi-Agent Traffic Simulator, which realistically simulates public and private traffic over regional maps of Switzerland. The result is a Chains of Trust simulation with over 260,000 nodes, which shows that the proposed scheme performs satisfactorily in a realistic scenario. (C) 2012 Elsevier B.V. All rights reserved.", "paper_title": "Chains of Trust in vehicular networks: A secure Points of Interest dissemination strategy", "paper_id": "WOS:000304218500018"}