{"auto_keywords": [{"score": 0.02765728998727022, "phrase": "laplacian"}, {"score": 0.00481495049065317, "phrase": "reduced_basis_approximations"}, {"score": 0.004694549334241098, "phrase": "rapid_and_reliable_prediction"}, {"score": 0.004664920223650814, "phrase": "linear-functional_outputs"}, {"score": 0.004635477242873163, "phrase": "coercive_and_non-coercive_linear_elliptic_partial_differential_equations"}, {"score": 0.0043235627487378595, "phrase": "governing_partial_differential_equation"}, {"score": 0.004228768988306315, "phrase": "parameter_space"}, {"score": 0.004149166224411185, "phrase": "posteriori_error_estimation_relaxations"}, {"score": 0.004109926210263146, "phrase": "error-residual_equation"}, {"score": 0.004071055784602253, "phrase": "inexpensive_yet_sharp_bounds"}, {"score": 0.003725470458263889, "phrase": "approximation_process"}, {"score": 0.00369022262431101, "phrase": "operation_count"}, {"score": 0.0036553070575015344, "phrase": "online_stage"}, {"score": 0.0036123246318058044, "phrase": "helmholtz"}, {"score": 0.0035751121405295026, "phrase": "new_parameter_value"}, {"score": 0.003474575242120264, "phrase": "associated_error"}, {"score": 0.0031996871318754685, "phrase": "new_\"natural_norm\"_formulation"}, {"score": 0.002927853422094123, "phrase": "posteriori_error"}, {"score": 0.0027218799769229596, "phrase": "parameter_values"}, {"score": 0.002696101728474703, "phrase": "nearly_singular_solution_behavior"}, {"score": 0.002522344964242888, "phrase": "heat_transfer_coefficient"}, {"score": 0.0022287497627555895, "phrase": "reduced_basis_approximation"}, {"score": 0.0021797840569206697, "phrase": "near-singular_behavior"}], "paper_keywords": ["parametrized partial differential equations", " reduced basis methods", " Galerkin approximation", " inf-sup constant", " output bounds", " A posteriori error estimation", " adjoint methods", " deflation"], "paper_abstract": "We present a technique for the rapid and reliable prediction of linear-functional outputs of coercive and non-coercive linear elliptic partial differential equations with affine parameter dependence. The essential components are: (i) rapidly convergent global reduced basis approximations - (Galerkin) projection onto a space W(N) spanned by solutions of the governing partial differential equation at N judiciously selected points in parameter space; (ii) a posteriori error estimation relaxations of the error-residual equation that provide inexpensive yet sharp bounds for the error in the outputs of interest; and (iii) offline/online computational procedures - methods which decouple the generation and projection stages of the approximation process. The operation count for the online stage - in which, given a new parameter value, we calculate the output of interest and associated error bound - depends only on N (typically very small) and the parametric complexity of the problem. In this paper we propose a new \"natural norm\" formulation for our reduced basis error estimation framework that: (a) greatly simplifies and improves our inf-sup lower bound construction (offline) and evaluation (online) - a critical ingredient of our a posteriori error estimators; and (b) much better controls - significantly sharpens - our output error bounds, in particular (through deflation) for parameter values corresponding to nearly singular solution behavior. We apply the method to two illustrative problems: a coercive Laplacian heat conduction problem - which becomes singular as the heat transfer coefficient tends to zero; and a non-coercive Helmholtz acoustics problem - which becomes singular as we approach resonance. In both cases, we observe very economical and sharp construction of the requisite natural-norm inf-sup lower bound,- rapid convergence of the reduced basis approximation; reasonable effectivities (even for near-singular behavior) for our deflated output error estimators; and significant - several order of magnitude - (online) computational savings relative to standard finite element procedures. (c) 2006 Elsevier Inc. All rights reserved.", "paper_title": "Natural norm a posteriori error estimators for reduced basis approximations", "paper_id": "WOS:000239904500003"}