{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "capacity_allocation"}, {"score": 0.049734762741514144, "phrase": "flow_assignment"}, {"score": 0.04939323296666451, "phrase": "self-healing_atm_networks"}, {"score": 0.043765266224011015, "phrase": "gmpls"}, {"score": 0.004677965073019951, "phrase": "current_overlay_transport_networks"}, {"score": 0.004228359613476549, "phrase": "generalized_multi-protocol_label"}, {"score": 0.004093190049699647, "phrase": "new_unified_control_plane"}, {"score": 0.003976656675903324, "phrase": "already_installed_atm_core_resource_management_features"}, {"score": 0.003891430578662587, "phrase": "particular_implementation"}, {"score": 0.0032484270911235526, "phrase": "path-based_design_approach"}, {"score": 0.003190265467214105, "phrase": "almost_all_proposed_solutions"}, {"score": 0.0031218401638802053, "phrase": "optimal_spare_capacity"}, {"score": 0.003088178133049113, "phrase": "virtual_paths"}, {"score": 0.0027808699346360656, "phrase": "optimized_spare_capacity_allocation"}, {"score": 0.0025868936783877035, "phrase": "spare_capacity_requirements"}, {"score": 0.0024950272594582673, "phrase": "spare_optimization"}, {"score": 0.00232935232323113, "phrase": "link-based_design_approach"}, {"score": 0.002151183757599893, "phrase": "service_requirements"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["ATM network design", " flow assignment", " spare capacity allocation", " self-healing", " link-based approach", " path-based approach"], "paper_abstract": "In the current overlay transport networks, IP/ATM/SONET/DWDM, each layer manages its own control plane, each control plane acting independently of what happens in the other. In the course of recent years, the generalized multi-protocol label switching (GMPLS) has emerged as the new unified control plane for all the above transport layers. As such, the already installed ATM core resource management features must be reused as a particular implementation of GMPLS, either directly or with some adaptations. Among such transferable research work are studies related to the problem of capacity allocation and flow assignment in self-healing ATM networks. This problem has been investigated by many authors, using two main design approaches: the path-based and the link-based approaches. In the path-based design approach, the focus in almost all proposed solutions has been to determine the optimal spare capacity and backup virtual paths (BVPs) allocation for all traffic flows. To our knowledge, no study has been done to quantify the impact of the selection of BVPs on the optimized spare capacity allocation (SCA). In this paper, we address this issue by comparing four SCA design schemes quantitatively in terms of spare capacity requirements (SCRs). The comparison is based on spare optimization, a single link failure or node failure scenario, and 100% restoration. We also introduce a link-based design approach of the above problem and show that the solution obtained is adequate in terms of grade of service and quality of service requirements. (C) 2007 Elsevier B.V. All rights reserved.", "paper_title": "On the problem of capacity allocation and flow assignment in self-healing ATM networks", "paper_id": "WOS:000250910800017"}