{"auto_keywords": [{"score": 0.04202502634922989, "phrase": "communication_theories"}, {"score": 0.00481495049065317, "phrase": "communication_theory"}, {"score": 0.004244234872662471, "phrase": "communication_discipline_identity_research"}, {"score": 0.0038853212888610234, "phrase": "intellectual_communities"}, {"score": 0.0035120164504478437, "phrase": "specific_technologies"}, {"score": 0.003467940281748612, "phrase": "bridge_levels"}, {"score": 0.003338992028053874, "phrase": "widely-cited_theoretical_contentions"}, {"score": 0.0031148723927633955, "phrase": "network_analysis"}, {"score": 0.002905752244360772, "phrase": "identified_theories"}, {"score": 0.002676587673012276, "phrase": "eigenvector_centrality"}, {"score": 0.002544616720630384, "phrase": "theory_groups"}, {"score": 0.0024968185204913957, "phrase": "mass_communication_and_technology_theories"}, {"score": 0.0021726139494880653, "phrase": "framing_theory"}], "paper_keywords": ["Communication discipline", " Identity", " Theory network", " Network analysis"], "paper_abstract": "This research explores the structure and status of theories used in Communication as an alternative for Communication discipline identity research and characteristics evaluation. This research assumes that communication theories are not only ongoing practices of intellectual communities, but also discourse about how theory can address a range of channels, transcend specific technologies and bridge levels of analysis. It examines widely-cited theoretical contentions among academic articles and the connections among these theories. Network analysis suggests that framing theory is the most influential of the identified theories (ranking first in frequency and degree, closeness, betweenness and eigenvector centrality) and serves to link other communication theories and theory groups. While mass communication and technology theories exhibited the highest centrality, interpersonal, persuasion and organization communication theories were grouped together, integrating sub-theories of each group. Framing theory was the most popular and influential communication theory bridging not only mass communication theories, but also interpersonal, technology, information system, health, gender, inter-cultural and organizational communication theories.", "paper_title": "An analysis on communication theory and discipline", "paper_id": "WOS:000318807000011"}