{"auto_keywords": [{"score": 0.03503242712598693, "phrase": "butterfly_wings"}, {"score": 0.03398223530698608, "phrase": "sinogram_peak"}, {"score": 0.03279538488952693, "phrase": "neighborhood_area"}, {"score": 0.03181004379505287, "phrase": "image_space"}, {"score": 0.031010852730264517, "phrase": "separated_sinogram"}, {"score": 0.029621029897042055, "phrase": "line_segments"}, {"score": 0.00481495049065317, "phrase": "line_segment_detection"}, {"score": 0.004137288854115515, "phrase": "frequency_domain"}, {"score": 0.003946960862020283, "phrase": "radon_space"}, {"score": 0.0038651944848734133, "phrase": "union_phase"}, {"score": 0.003630116242304349, "phrase": "cartesian"}, {"score": 0.0034088473318056537, "phrase": "division_phase"}, {"score": 0.0023133055945761235, "phrase": "windowed_image"}, {"score": 0.002241679436497569, "phrase": "benchmark_images"}, {"score": 0.002160907646736523, "phrase": "und_method"}, {"score": 0.0021383680500215267, "phrase": "higher_accuracy"}, {"score": 0.0021049977753042253, "phrase": "lower_computational_cost"}], "paper_keywords": ["Fourier transform", " Hough transform", " line segment detection", " radon transform"], "paper_abstract": "In this paper, we extend our previously proposed line detection method to line segmentation using a so-called unite-and-divide (UND) approach. The methodology includes two phases, namely the union of spectra in the frequency domain, and the division of the sinogram in Radon space. In the union phase, given an image, its sinogram is obtained by parallel 2D multilayer Fourier transforms, Cartesian-to-polar mapping and 1D inverse Fourier transform. In the division phase, the edges of butterfly wings in the neighborhood of every sinogram peak are firstly specified, with each neighborhood area corresponding to a window in image space. By applying the separated sinogram of each such windowed image, we can extract the line segments. The division Phase identifies the edges of butterfly wings in the neighborhood of every sinogram peak such that each neighborhood area corresponds to a window in image space. Line segments are extracted by applying the separated sinogram of each windowed image. Our experiments are conducted on benchmark images and the results reveal that the UND method yields higher accuracy, has lower computational cost and is more robust to noise, compared to existing state-of-the-art methods.", "paper_title": "UND: Unite-and-Divide Method in Fourier and Radon Domains for Line Segment Detection", "paper_id": "WOS:000318477500033"}