{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "perceptual_attention"}, {"score": 0.03211641746000839, "phrase": "information_filter"}, {"score": 0.015596689970222035, "phrase": "sparse_coding"}, {"score": 0.011427186514581085, "phrase": "relevant_information"}, {"score": 0.011337367464399395, "phrase": "irrelevant_information"}, {"score": 0.009719071907018663, "phrase": "bayesian_context"}, {"score": 0.004664352260912174, "phrase": "useful_tool"}, {"score": 0.0045726187330434025, "phrase": "natural_data"}, {"score": 0.004447201233380302, "phrase": "signal-processing_literature"}, {"score": 0.004257000695796238, "phrase": "human_brain"}, {"score": 0.004091130285858113, "phrase": "sparse_coding_algorithm"}, {"score": 0.0037784540167266497, "phrase": "localized_perception-action_cycle"}, {"score": 0.003517458289610994, "phrase": "gradually_the_contrast"}, {"score": 0.0028715346879948254, "phrase": "fraser"}, {"score": 0.002705121052747945, "phrase": "algorithmic_implementation"}, {"score": 0.0025382066972107777, "phrase": "algorithmic_performance"}, {"score": 0.002468450551616404, "phrase": "performance_improvement"}, {"score": 0.002391067964886602, "phrase": "first_experiment"}, {"score": 0.0022434880661725493, "phrase": "real-life_radar_data"}, {"score": 0.002147333949483224, "phrase": "wirtinger_calculus"}, {"score": 0.0021049977753042253, "phrase": "new_algorithm"}], "paper_keywords": [""], "paper_abstract": "Sparse coding has established itself as a useful tool for the representation of natural data in the neuroscience as well as signal-processing literature. The aim of this letter, inspired by the human brain, is to improve on the performance of the sparse coding algorithm by trying to bridge the gap between neuroscience and engineering. To this end, we build on the localized perception-action cycle in cognitive neuroscience by categorizing it under the umbrella of perceptual attention, which lends itself to increase gradually the contrast between relevant information and irrelevant information. Stated in another way, irrelevant information is filtered away, while relevant information about the environment is enhanced from one cycle to the next. We may thus think in terms of the information filter, which, in a Bayesian context, was introduced in the literature by Fraser (1967). In a Bayesian context, the information filter provides a method for algorithmic implementation of perceptual attention. The information filter may therefore be viewed as the basis for improving the algorithmic performance of sparse coding. To support this performance improvement, the letter presents two computer experiments. The first experiment uses simulated (real-valued) data that are generated to purposely make the problem challenging. The second uses real-life radar data that are complex valued, hence the proposal to introduce Wirtinger calculus into derivation of the new algorithm.", "paper_title": "Improved Sparse Coding Under the Influence of Perceptual Attention", "paper_id": "WOS:000329290300005"}