{"auto_keywords": [{"score": 0.04334863831976787, "phrase": "qmom"}, {"score": 0.00481495049065317, "phrase": "quadrature_method"}, {"score": 0.004454691230204595, "phrase": "gas-particle_flows"}, {"score": 0.004305639197085793, "phrase": "non-equilibrium_effects"}, {"score": 0.003925633992809873, "phrase": "homogeneous_isotropic_boltzmann_equation"}, {"score": 0.0038127186374325582, "phrase": "realistic_description"}, {"score": 0.003775803846431323, "phrase": "particle_collisions"}, {"score": 0.0032629585038738856, "phrase": "grad's_moment_method"}, {"score": 0.0032313850418698303, "phrase": "gm"}, {"score": 0.002917331114260319, "phrase": "discrete_velocity_method"}, {"score": 0.0024963543716522087, "phrase": "gm_and_olbm_or_the_computational_costs"}, {"score": 0.0024721544802794038, "phrase": "dvm"}, {"score": 0.002264607102799332, "phrase": "static_and_dynamic_corrections"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["QMOM", " Homogeneous Isotropic Boltzmann", " Equation", " Grad's method", " Lattice Boltzmann", " Hard-sphere model"], "paper_abstract": "Recently the Quadrature Method of Moments (QMOM) has been extended to solve several kinetic equations, in particular for gas-particle flows and rarefied gases in which the non-equilibrium effects can be important. In this work QMOM is tested as a closure for the dynamics of the Homogeneous Isotropic Boltzmann Equation (HIBE) with a realistic description for particle collisions, namely the hard-sphere model. The behaviour of QMOM far away and approaching the equilibrium is studied. Results are compared to other techniques such as the Grad's moment method (GM) and the off-Lattice Boltzmann Method (oLBM). Comparison with a more accurate and computationally expensive approach, based on the Discrete Velocity Method (DVM), is also carried out. Our results show that QMOM describes very well the evolution when it is far away from equilibrium, without the drawbacks of the GM and oLBM or the computational costs of DVM, but it is not able to accurately reproduce equilibrium and the dynamics close to it. Static and dynamic corrections to cure this behaviour are here proposed and tested. (C) 2012 Elsevier Inc. All rights reserved.", "paper_title": "Quadrature-based moment closures for non-equilibrium flows: Hard-sphere collisions and approach to equilibrium", "paper_id": "WOS:000308067000022"}