{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "online_games"}, {"score": 0.004751889650408546, "phrase": "social_network_perspective"}, {"score": 0.004710306419574744, "phrase": "online_gaming"}, {"score": 0.004648609688625397, "phrase": "multi-billion_dollar_industry"}, {"score": 0.004201571673071299, "phrase": "cheating_span"}, {"score": 0.00416478405812793, "phrase": "industry-supported_expenditures"}, {"score": 0.004020813632357377, "phrase": "victims'_monetary_losses"}, {"score": 0.003968112038249246, "phrase": "cyber_crime"}, {"score": 0.0036660436272785476, "phrase": "world's_dominant_digital_game_delivery_platform"}, {"score": 0.0035082436540296406, "phrase": "global_social_network"}, {"score": 0.003298631258267805, "phrase": "timing_information"}, {"score": 0.003255364511414329, "phrase": "cheater_flags"}, {"score": 0.0031289290660162145, "phrase": "cheaters'_social_neighborhoods"}, {"score": 0.002981026404927824, "phrase": "social_and_interaction_networks"}, {"score": 0.0028652153774536967, "phrase": "fair_players"}, {"score": 0.002499590390751339, "phrase": "social_penalty"}, {"score": 0.002339771435910601, "phrase": "cheating_label"}, {"score": 0.0021805201234139475, "phrase": "social_mechanism"}, {"score": 0.0021330078238529443, "phrase": "cheater_friends"}, {"score": 0.0021049977753042253, "phrase": "fair_player"}], "paper_keywords": ["Measurement", " Experimentation", " Social networks", " cheating in online games", " diffusion", " contagion"], "paper_abstract": "Online gaming is a multi-billion dollar industry that entertains a large, global population. One unfortunate phenomenon, however, poisons the competition and spoils the fun: cheating. The costs of cheating span from industry-supported expenditures to detect and limit it, to victims' monetary losses due to cyber crime. This article studies cheaters in the Steam Community, an online social network built on top of the world's dominant digital game delivery platform. We collected information about more than 12 million gamers connected in a global social network, of which more than 700 thousand have their profiles flagged as cheaters. We also observed timing information of the cheater flags, as well as the dynamics of the cheaters' social neighborhoods. We discovered that cheaters are well embedded in the social and interaction networks: their network position is largely indistinguishable from that of fair players. Moreover, we noticed that the number of cheaters is not correlated with the geographical, real-world population density, or with the local popularity of the Steam Community. Also, we observed a social penalty involved with being labeled as a cheater: cheaters lose friends immediately after the cheating label is publicly applied. Most importantly, we observed that cheating behavior spreads through a social mechanism: the number of cheater friends of a fair player is correlated with the likelihood of her becoming a cheater in the future. This allows us to propose ideas for limiting cheating contagion.", "paper_title": "Cheating in Online Games: A Social Network Perspective", "paper_id": "WOS:000337021100003"}