{"auto_keywords": [{"score": 0.03537870345379016, "phrase": "new_pcb_product"}, {"score": 0.00481495049065317, "phrase": "pcb_principal_process_parameter_identification"}, {"score": 0.00465944657565638, "phrase": "lengthy_production_activities"}, {"score": 0.00441130431691048, "phrase": "process_parameters"}, {"score": 0.004339459955098738, "phrase": "numerous_process_parameters"}, {"score": 0.003826007045267751, "phrase": "pcb_product"}, {"score": 0.003702323283528699, "phrase": "principal_process_parameters"}, {"score": 0.003524227590204673, "phrase": "manufacturing_lead-time"}, {"score": 0.00294122712771669, "phrase": "case-base_stores_design_specifications"}, {"score": 0.0025786066704445304, "phrase": "similar_cases"}, {"score": 0.002454432810862053, "phrase": "correlation-based_parameter_setting_method"}, {"score": 0.0023749823753904204, "phrase": "principal_parameters"}, {"score": 0.0022359278646792153, "phrase": "practical_implementation_case"}, {"score": 0.0021049977753042253, "phrase": "proposed_system"}], "paper_keywords": ["case-based reasoning", " printed circuit board", " principal parameter identification", " nearest neighbor search", " feature selection"], "paper_abstract": "The Printed Circuit Board (PCB) manufacturing process usually consists of lengthy production activities. Each activity is controlled by a number of process parameters. Although numerous process parameters must be determined before fabrication, only a number of parameters called principal process parameters because they affect the quality of a PCB product. As long as the principal process parameters are identified efficiently and controlled well, the manufacturing lead-time can be shortened and the quality of the new PCB product can be assured. This research proposes a Case-Based Reasoning (CBR) system to infer the principal process parameters for a new PCB product. Each case in the case-base stores design specifications, process parameters, and the corresponding production quality specifications. A Significant Nearest Neighbor (SNN) search is developed to retrieve similar cases from a case-base. A Mutual Correlation Parameter Selection (MCPS) method and a correlation-based parameter setting method are developed to identify the principal parameters and infer their reasonable value range. A set of experiments and a practical implementation case are demonstrated to show the efficiency and accuracy of the proposed system. (C) 2006 Elsevier Ltd. All rights reserved.", "paper_title": "A case-based reasoning system for PCB principal process parameter identification", "paper_id": "WOS:000243797800022"}