{"auto_keywords": [{"score": 0.038097479208460135, "phrase": "rough_context"}, {"score": 0.0043790755286923794, "phrase": "third_approximation_space"}, {"score": 0.004159617445102161, "phrase": "finite_process"}, {"score": 0.004126840854872329, "phrase": "gradual_enhancement"}, {"score": 0.003738200814271716, "phrase": "first_introduction"}, {"score": 0.0033328427701162368, "phrase": "above-mentioned_overlaps"}, {"score": 0.0032934951320964276, "phrase": "systematic_manner"}, {"score": 0.0031782087629067686, "phrase": "approximation_space"}, {"score": 0.003128270147867462, "phrase": "nine_possible_inclusion_relations"}, {"score": 0.0028334016912935165, "phrase": "lower_and_upper_approximation_operators"}, {"score": 0.0027778413437997635, "phrase": "five_resulting_equivalence_classes"}, {"score": 0.0027450280220853137, "phrase": "quotient_set_forms"}, {"score": 0.002701877448139625, "phrase": "implication_ordering"}, {"score": 0.002627985415362773, "phrase": "nine_relations"}, {"score": 0.0025059724686541263, "phrase": "entailment_lattice"}, {"score": 0.002456816881853114, "phrase": "basic_lattice"}, {"score": 0.002324238863944163, "phrase": "final_pair"}, {"score": 0.0021049977753042253, "phrase": "rough_belief_revision"}], "paper_keywords": ["rough sets", " negotiation", " modal system S5", " belief change"], "paper_abstract": "A dialogue is an 'activity' by a pair of agents to arrive at some kind of understanding over a concept/belief/piece of information etc. represented by a subset (the extension) in some universe of discourse. The universe is partitioned into two different sets of granules (equivalence classes) representing the perceptions of the agents. So, there are two approximation spaces at the beginning. A third approximation space arises out of superimposition of the two partitions. A dialogue is a finite process of gradual enhancement of the two base subsets of the agents, in their 'common' approximation space. Through this process, various kinds of overlap may emerge between the two final subsets. A first introduction of the idea of a dialogue in rough context was made in [6]. This paper further develops the notion and focusses upon the study of the above-mentioned overlaps in a systematic manner. Given two sets A and B in an approximation space, there are nine possible inclusion relations among the sets lo(A), A, up(A), lo(B), B and up(B) where to and up denote the lower and upper approximation operators respectively. There are five resulting equivalence classes and the quotient set forms a lattice by implication ordering. That is, of the nine relations, only five are independent and they form an implication or entailment lattice. Starting with this basic lattice other implication lattices are formed. Relationship of these lattices with the various overlap conditions between the final pair of sets arrived at after a dialogue is studied. Finally, examples are given, one of which relates dialogues in rough context with rough belief revision [3] - in a line similar to the approach of [5].", "paper_title": "Rough dialogue and implication lattices", "paper_id": "WOS:000244426400008"}