{"auto_keywords": [{"score": 0.04933167036983738, "phrase": "array_generation"}, {"score": 0.008546387553239533, "phrase": "dpso"}, {"score": 0.00481495049065317, "phrase": "discrete_particle_swarm"}, {"score": 0.0047026237903774895, "phrase": "software_behavior"}, {"score": 0.004611013257082199, "phrase": "combinatorial_testing"}, {"score": 0.004503422625191897, "phrase": "small_sets"}, {"score": 0.004468117364177126, "phrase": "test_cases"}, {"score": 0.0042119653427658025, "phrase": "discrete_optimization_problem"}, {"score": 0.004065348865695599, "phrase": "ct._particle_swarm_optimization"}, {"score": 0.004012880123235882, "phrase": "parameter_settings"}, {"score": 0.0036553070575015344, "phrase": "current_pso_methods"}, {"score": 0.003555902292752528, "phrase": "particle's_position"}, {"score": 0.0034687500591034158, "phrase": "cpso"}, {"score": 0.003459191419478298, "phrase": "discrete_search_space"}, {"score": 0.00314708280192844, "phrase": "set-based_pso"}, {"score": 0.0031100973266506163, "phrase": "existing_discrete_pso"}, {"score": 0.00266693888510356, "phrase": "conventional_pso"}, {"score": 0.0025436978068459565, "phrase": "discrete_extensions"}, {"score": 0.0023048904639724438, "phrase": "better_results"}, {"score": 0.0021049977753042253, "phrase": "promising_improvement"}], "paper_keywords": ["Combinatorial testing (CT)", " covering array generation", " particle swarm optimization (PSO)"], "paper_abstract": "Software behavior depends on many factors. Combinatorial testing (CT) aims to generate small sets of test cases to uncover defects caused by those factors and their interactions. Covering array generation, a discrete optimization problem, is the most popular research area in the field of CT. Particle swarm optimization (PSO), an evolutionary search-based heuristic technique, has succeeded in generating covering arrays that are competitive in size. However, current PSO methods for covering array generation simply round the particle's position to an integer to handle the discrete search space. Moreover, no guidelines are available to effectively set PSOs parameters for this problem. In this paper, we extend the set-based PSO, an existing discrete PSO (DPSO) method, to covering array generation. Two auxiliary strategies (particle reinitialization and additional evaluation of gbest) are proposed to improve performance, and thus a novel DPSO for covering array generation is developed. Guidelines for parameter settings both for conventional PSO (CPSO) and for DPSO are developed systematically here. Discrete extensions of four existing PSO variants are developed, in order to further investigate the effectiveness of DPSO for covering array generation. Experiments show that CPSO can produce better results using the guidelines for parameter settings, and that DPSO can generate smaller covering arrays than CPSO and other existing evolutionary algorithms. DPSO is a promising improvement on PSO for covering array generation.", "paper_title": "A Discrete Particle Swarm Optimization for Covering Array Generation", "paper_id": "WOS:000358883500008"}