{"auto_keywords": [{"score": 0.04771533004845802, "phrase": "refactoring_operations"}, {"score": 0.009420794927799021, "phrase": "code_components"}, {"score": 0.00796434149787095, "phrase": "quality_metrics"}, {"score": 0.006141873849636541, "phrase": "refactoring_activities"}, {"score": 0.00481495049065317, "phrase": "innate_relationship"}, {"score": 0.004694700982410345, "phrase": "previous_studies"}, {"score": 0.004296889776409743, "phrase": "quality_metric_profiles"}, {"score": 0.004171891198117439, "phrase": "poor_design"}, {"score": 0.00413684709497912, "phrase": "implementation_choices"}, {"score": 0.003982741546775355, "phrase": "existing_literature"}, {"score": 0.0032800186243040663, "phrase": "evolution_history"}, {"score": 0.002689564715486338, "phrase": "clear_relationship"}, {"score": 0.0023296961971785357, "phrase": "code_entities"}, {"score": 0.0023003498123420237, "phrase": "code_smells"}, {"score": 0.002233301265743633, "phrase": "performed_operations"}, {"score": 0.0021590588269751816, "phrase": "affected_class"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Refactoring", " Code smells", " Empirical study"], "paper_abstract": "Previous studies have investigated the reasons behind refactoring operations performed by developers, and proposed methods and tools to recommend refactorings based on quality metric profiles, or on the presence of poor design and implementation choices, i.e., code smells. Nevertheless, the existing literature lacks observations about the relations between metrics/code smells and refactoring activities performed by developers. In other words, the characteristics of code components increasing/decreasing their chances of being object of refactoring operations are still unknown. This paper aims at bridging this gap. Specifically, we mined the evolution history of three Java open source projects to investigate whether refactoring activities occur on code components for which certain indicators such as quality metrics or the presence of smells as detected by tools suggest there might be need for refactoring operations. Results indicate that, more often than not, quality metrics do not show a clear relationship with refactoring. In other words, refactoring operations are generally focused on code components for which quality metrics do not suggest there might be need for refactoring operations. Finally, 42% of refactoring operations are performed on code entities affected by code smells. However, only 7% of the performed operations actually remove the code smells from the affected class. (C) 2015 Elsevier Inc. All rights reserved.", "paper_title": "An experimental investigation on the innate relationship between quality and refactoring", "paper_id": "WOS:000358699700001"}