{"auto_keywords": [{"score": 0.008581998458573522, "phrase": "customer_diversity"}, {"score": 0.00481495049065317, "phrase": "internet_service_providers"}, {"score": 0.004555371402128666, "phrase": "overall_traffic"}, {"score": 0.004266501496765747, "phrase": "simplified_two-level_hierarchical_model"}, {"score": 0.0038573081851680656, "phrase": "connectivity_service"}, {"score": 0.0036125439380579626, "phrase": "\"private_peering\"_links"}, {"score": 0.0033156708990372047, "phrase": "proper_traffic_routing"}, {"score": 0.003105168935158648, "phrase": "private_peering_link"}, {"score": 0.0028642924503126154, "phrase": "proper_resource_allocation"}, {"score": 0.0026959452932289797, "phrase": "single_peer"}, {"score": 0.0025374674652885354, "phrase": "distributed_framework"}, {"score": 0.0023523750536537102, "phrase": "traffic_routing"}, {"score": 0.002214048743052355, "phrase": "extensive_simulations"}, {"score": 0.0021049977753042253, "phrase": "proposed_distributed_framework"}], "paper_keywords": ["interaction", " utility maximization", " sensitivity and convergency"], "paper_abstract": "In this paper, we consider interactions of Internet Service Providers (ISPs) and how these interactions can affect the overall traffic and resource allocation between ISPs. In particular, we consider a simplified two-level hierarchical model wherein there are a single tier-1 ISP and N > 1 tier-2 ISPs. Each tier-2 ISP needs to pay the tier-1 ISP for the connectivity service. At the same time, a tier-2 ISP can also arrange to have \"private peering\" links with other tier-2 ISPs. Therefore, each tier-2 ISP can optimize its utility by deciding on the proper traffic routing of transmitting traffic, either via the tier-1 ISP link, or via the private peering link with other tier-2 ISPs. The tier-1 ISP, on the other hand, needs to decide on the proper resource allocation for all its tier-2 peers so as to avoid monopolization of its resource by a single peer (i.e., to achieve customer diversity). We investigate a distributed framework wherein a tier-1 ISP can achieve customer diversity while tier-2 peers can perform their utility maximization in terms of traffic routing. We also explore other important issues such as sensitivity and convergency. Extensive simulations are carried out to quantify the merits of the proposed distributed framework.", "paper_title": "Performance modeling on the interaction of ISPs", "paper_id": "WOS:000239426900003"}