{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "recommender_systems"}, {"score": 0.004637478829869904, "phrase": "information_technology"}, {"score": 0.004281678802569817, "phrase": "information_transfer"}, {"score": 0.004123781267600542, "phrase": "convenient_life"}, {"score": 0.003916098498242888, "phrase": "new_problem"}, {"score": 0.0038431888954930083, "phrase": "information_overload"}, {"score": 0.003095923814666088, "phrase": "traveler's_decision"}, {"score": 0.0028715299874549245, "phrase": "recommender_system_techniques"}, {"score": 0.002726740692380339, "phrase": "best_traveling_locations"}, {"score": 0.0023789822182914877, "phrase": "hybrid_recommender_system"}, {"score": 0.0023456351719724957, "phrase": "better_technique"}, {"score": 0.0022064376000055764, "phrase": "content-based_filtering"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Content-based filtering", " Collaborative filtering", " Hybrid filtering", " Taxonomy", " Recommender system", " Bayes' theorem"], "paper_abstract": "The improvement of information technology makes storage no longer a problem. In addition, the birth of the Internet makes information transfer faster than ever. It brings us convenient life. However, more and more information result in a new problem, which is information overload. Today, many more people are traveling abroad since they no longer have to work on weekends. Traveling abroad has become a kind of trend. There are more than a hundred countries in the world worth to travel, and there is so much information available that it makes a traveler's decision extremely difficult to make. In our research, we try to implement the most common three kinds of recommender system techniques in order to recommend to customers which countries are the best traveling locations for them. Thus, we can save travelers a lot of time when deciding where to go. From our experiment and evaluation, we find that a hybrid recommender system is a better technique in recommendation according to our abroad database, and it conquers the shortcomings of content-based filtering and collaborative filtering approaches. (C) 2011 Elsevier Ltd. All rights reserved.", "paper_title": "An implementation and evaluation of recommender systems for traveling abroad", "paper_id": "WOS:000295193400104"}