{"auto_keywords": [{"score": 0.009067785230960117, "phrase": "higher_level"}, {"score": 0.008973850553143037, "phrase": "brp_adoption"}, {"score": 0.007877981615647978, "phrase": "iem"}, {"score": 0.004202741104973709, "phrase": "large_organisations"}, {"score": 0.004115697805448384, "phrase": "relatively_little_research"}, {"score": 0.0038854765143440965, "phrase": "e-commerce_benefits"}, {"score": 0.0037653554368382814, "phrase": "survey_research"}, {"score": 0.003102195256794215, "phrase": "large_australian_organisations"}, {"score": 0.0027071661844502992, "phrase": "increased_level"}, {"score": 0.0023747363044864284, "phrase": "brp"}, {"score": 0.0021049977753042253, "phrase": "-commerce_benefits"}], "paper_keywords": ["IT maturity", " IT investment evaluation methodologies", " IT benefit realisation processes", " B2B e-commerce adoption readiness", " B2B e-commerce benefits"], "paper_abstract": "Actual realisation of business-to-business electronic commerce ( B2B e-commerce) benefits from IT investments has been a critical issue for large organisations. However, relatively little research has been undertaken to determine the drivers for realising B2B e-commerce benefits within these organisations. A survey research was conducted to examine the relationships between B2B e-commerce benefits, IT investment evaluation methodologies ( IEM), IT benefit realisation processes ( BRP), B2B e-commerce adoption readiness, and IT maturity in large Australian organisations. An IT investment management model was developed to test these relationships. The results had empirically validated the model and indicate that a higher level of BRP adoption and increased level of B2B e-commerce adoption readiness had a significant direct relationship with B2B e-commerce benefits. In addition, the level of B2B e-commerce adoption readiness, and the level of IEM and BRP adoption were significantly influenced by the level of IT maturity. However, the use of IEM alone had only an indirect positive influence on B2B e-commerce benefits through the higher level of BRP adoption and increased level of B2B e-commerce adoption readiness.", "paper_title": "Realising B2B e-commerce benefits: the link with IT maturity, evaluation practices, and B2BEC adoption readiness", "paper_id": "WOS:000251949600014"}