{"auto_keywords": [{"score": 0.04543168546916397, "phrase": "user_testing"}, {"score": 0.015442919463805223, "phrase": "e-commerce_websites"}, {"score": 0.014045774803192461, "phrase": "heuristic_evaluation_methods"}, {"score": 0.007885710551436399, "phrase": "major_problems"}, {"score": 0.007653850135006727, "phrase": "minor_problems"}, {"score": 0.00481495049065317, "phrase": "usability_evaluation_methods"}, {"score": 0.0038348235692738783, "phrase": "specific_problems"}, {"score": 0.0034220655476652683, "phrase": "usability_problems"}, {"score": 0.0029991500396912923, "phrase": "severity_level"}, {"score": 0.0027741761880779535, "phrase": "common_problems"}, {"score": 0.0022218413146898887, "phrase": "heuristic_evaluation"}, {"score": 0.0021561514733516676, "phrase": "eight_specific_areas"}], "paper_keywords": ["comparison", " usability", " evaluation methods", " user testing", " heuristic evaluation", " e-commerce websites"], "paper_abstract": "The importance of evaluating the usability of e-commerce websites is well recognised. User testing and heuristic evaluation methods are commonly used to evaluate the usability of such sites, but just how effective are these for identifying specific problems? This article describes an evaluation of these methods by comparing the number, severity and type of usability problems identified by each one. The cost of employing these methods is also considered. The findings highlight the number and severity level of 44 specific usability problem areas which were uniquely identified by either user testing or heuristic evaluation methods, common problems that were identified by both methods, and problems that were missed by each method. The results show that user testing uniquely identified major problems related to four specific areas and minor problems related to one area. Conversely, the heuristic evaluation uniquely identified minor problems in eight specific areas and major problems in three areas.", "paper_title": "A comparison of usability evaluation methods for evaluating e-commerce websites", "paper_id": "WOS:000306321400006"}