{"auto_keywords": [{"score": 0.039701168335308915, "phrase": "single_signal"}, {"score": 0.00481495049065317, "phrase": "accelerated_correlation"}, {"score": 0.004537525607322823, "phrase": "simultaneous_calculation"}, {"score": 0.00419861271409079, "phrase": "different_orders"}, {"score": 0.003956558420993431, "phrase": "additional_signals"}, {"score": 0.003545625043276134, "phrase": "extra_signals"}, {"score": 0.0032805541677236325, "phrase": "individual_results"}, {"score": 0.0031917943932454314, "phrase": "inverse_operation"}, {"score": 0.0030352396244492604, "phrase": "finite_length"}, {"score": 0.0028082176224611542, "phrase": "cross_correlation"}, {"score": 0.0026949679939994226, "phrase": "fast_fourier_transform"}, {"score": 0.0025981315738078793, "phrase": "actual_values"}, {"score": 0.0024147474002390763, "phrase": "special_hardware"}, {"score": 0.0023927516438886445, "phrase": "special_fft_algorithm"}, {"score": 0.0021735249249471614, "phrase": "ordinary_pc"}, {"score": 0.0021049977753042253, "phrase": "smaller_sized_templates"}], "paper_keywords": ["image correlation", " image filtering", " template matching", " accelerated", " correlation"], "paper_abstract": "In this paper, we present an algorithm that allows the simultaneous calculation of several cross correlations. The algorithm works by shifting the range of values of different images/signals to occupy different orders of magnitude and then combining them to form a single composite image/signal. Because additional signals are placed in the space usually occupied by a single signal, we call this the \"invaders algorithm,\" to imply that extra signals invade the space that normally belongs to a single signal. After correlation is performed, the individual results are recovered by performing the inverse operation. The limitations of the algorithm are imposed by the finite length of the mantissa of the hardware used, the precision of the algorithm that performs the cross correlation ( e. g., the precision of the fast Fourier transform (FFT)) and by the actual values of the images/signals that are to be combined. The algorithm does not require any special hardware or special FFT algorithm. For typical 256 x 256 images, an acceleration by a factor of at least two in the calculation of their cross correlations is guaranteed using an ordinary PC or a laptop. As for smaller sized templates, tenfold accelerations may be achieved.", "paper_title": "The \"invaders\" algorithm: Range of values modulation for accelerated correlation", "paper_id": "WOS:000240443400016"}