{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "static_aspects"}, {"score": 0.004700808396964564, "phrase": "survey"}, {"score": 0.004367581653370531, "phrase": "development_and_maintenance_processes"}, {"score": 0.004322967486451877, "phrase": "time-consuming_activities"}, {"score": 0.004256895619944631, "phrase": "software_complexity"}, {"score": 0.004127753467337283, "phrase": "graphical_visualization"}, {"score": 0.003921129887153952, "phrase": "better_and_faster_understanding"}, {"score": 0.00368673793612343, "phrase": "valuable_information"}, {"score": 0.0034663083890589235, "phrase": "easy_task"}, {"score": 0.0033957904376127187, "phrase": "huge_amount"}, {"score": 0.003209152260950748, "phrase": "information_content"}, {"score": 0.002955782731675529, "phrase": "human_perception"}, {"score": 0.002895620643297197, "phrase": "cognitive_factors"}, {"score": 0.0025992391074270097, "phrase": "visualization_techniques"}], "paper_keywords": ["Visualization of software", " software comprehension", " software maintenance", " human perception"], "paper_abstract": "Software is usually complex and always intangible. In practice, the development and maintenance processes are time-consuming activities mainly because software complexity is difficult to manage. Graphical visualization of software has the potential to result in a better and faster understanding of its design and functionality, thus saving time and providing valuable information to improve its quality. However, visualizing software is not an easy task because of the huge amount of information comprised in the software. Furthermore, the information content increases significantly once the time dimension to visualize the evolution of the software is taken into account. Human perception of information and cognitive factors must thus be taken into account to improve the understandability of the visualization. In this paper, we survey visualization techniques, both 2D- and 3D-based, representing the static aspects of the software and its evolution. We categorize these techniques according to the issues they focus on, in order to help compare them and identify the most relevant techniques and tools for a given problem.", "paper_title": "Visualization of the Static Aspects of Software: A Survey", "paper_id": "WOS:000290167100005"}