{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "flood_disaster_management"}, {"score": 0.03391542065670419, "phrase": "model_information"}, {"score": 0.004450568197899267, "phrase": "sophisticated_estimates"}, {"score": 0.004230956171850591, "phrase": "simulation_modeling"}, {"score": 0.003954837422946628, "phrase": "limited_use"}, {"score": 0.003104849179057156, "phrase": "flood_disaster_organizations"}, {"score": 0.002951444412262927, "phrase": "modeling_information"}, {"score": 0.0023428586429492713, "phrase": "model_use"}, {"score": 0.002264982416465872, "phrase": "fast_exchange"}, {"score": 0.0021773853011112882, "phrase": "flood_disaster_organization"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Flood disaster management", " Decision support systems", " Decision-making process", " Social Network Analysis"], "paper_abstract": "Flood simulation models can provide practitioners of Flood Disaster Management with sophisticated estimates of floods. Despite the advantages that flood simulation modeling may provide, experiences have proven that these models are of limited use. Until now, this problem has mainly been investigated by evaluations of which information is demanded by decision-makers versus what models can actually offer. However, the goal of this study is to investigate how model information is exchanged among participants in flood disaster organizations and how this exchange affects the use of modeling information. Our findings indicate that the extent to which a model is useful not only depends on the type and quality of its output, but also on how fast and flexible a model can be. In addition, methods of model use are required that support a fast exchange of model information between participants in the flood disaster organization. (C) 2013 Elsevier Ltd. All rights reserved.", "paper_title": "Why are decisions in flood disaster management so poorly supported by information from flood models?", "paper_id": "WOS:000331688500005"}