{"auto_keywords": [{"score": 0.047886244803711495, "phrase": "image_registration"}, {"score": 0.010612387000973441, "phrase": "simultaneous_image_registration"}, {"score": 0.009833416988319896, "phrase": "image_sr"}, {"score": 0.00873278857106368, "phrase": "lr_images"}, {"score": 0.006542492728345942, "phrase": "new_framework"}, {"score": 0.0061382500990079, "phrase": "hr_reconstruction"}, {"score": 0.005425795876741059, "phrase": "proposed_method"}, {"score": 0.004653667500876187, "phrase": "new_algorithm"}, {"score": 0.0045556080393342165, "phrase": "image_super-resolution"}, {"score": 0.004201381218977942, "phrase": "multiple_low-resolution"}, {"score": 0.0040779081518317415, "phrase": "critical_step"}, {"score": 0.004008981656795115, "phrase": "accurate_registration"}, {"score": 0.0038253590626087237, "phrase": "conventional_sr_algorithms"}, {"score": 0.0036037265181631324, "phrase": "motion_parameters"}, {"score": 0.0028992294924613327, "phrase": "hr_image_reconstruction"}, {"score": 0.002754516260621121, "phrase": "disjoint_processes"}, {"score": 0.0024863459251358217, "phrase": "translational_motion_model"}, {"score": 0.0023123057299992587, "phrase": "iterative_scheme"}, {"score": 0.002253826965566618, "phrase": "arising_nonlinear_least_squares_problem"}, {"score": 0.0021049977753042253, "phrase": "simulated_as_well_as_real-life_images"}], "paper_keywords": ["image super-resolution (SR)", " image registration", " nonlinear least squares methods"], "paper_abstract": "This paper proposes a new algorithm to integrate image registration into image super-resolution (SR). Image SR is a process to reconstruct a high-resolution (HR) image by fusing multiple low-resolution (LR) images. A critical step in image SR is accurate registration of the LR images or, in other words, effective estimation of motion parameters. Conventional SR algorithms assume either the estimated motion parameters by existing registration methods to be error-free or the motion parameters are known a priori. This assumption, however, is impractical in many applications, as most existing registration algorithms still experience various degrees of errors, and the motion parameters among the LR images are generally unknown a priori. In view of this, this paper presents a new framework that performs simultaneous image registration and HR image reconstruction. As opposed to other current methods that treat image registration and HR reconstruction as disjoint processes, the new framework enables image registration and HR reconstruction to be estimated simultaneously and improved progressively. Further, unlike most algorithms that focus on the translational motion model, the proposed method adopts a more generic motion model that includes both translation as well as rotation. An iterative scheme is developed to solve the arising nonlinear least squares problem. Experimental results show that the proposed method is effective in performing image registration and SR for simulated as well as real-life images.", "paper_title": "A nonlinear least square technique for simultaneous image registration and super-resolution", "paper_id": "WOS:000250241500019"}