{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "opportunistic_ofdma_networks"}, {"score": 0.004761132425263795, "phrase": "imperfect_csi"}, {"score": 0.0043029342321223825, "phrase": "orthogonal_frequency_division_multiple_access"}, {"score": 0.0036759314172445934, "phrase": "considered_network_area"}, {"score": 0.0035539019235553897, "phrase": "transmission_rate"}, {"score": 0.003175556211659149, "phrase": "efficient_and_rational_spectrum_utilization"}, {"score": 0.0023166075278110254, "phrase": "multiple_nodes"}, {"score": 0.0021896891011033105, "phrase": "power_economy"}, {"score": 0.0021049977753042253, "phrase": "john_wiley"}], "paper_keywords": ["dynamic spectrum access", " games", " OFDMA", " opportunistic radio", " utility"], "paper_abstract": "In this paper, we consider the Orthogonal Frequency Division Multiple Access (OFDMA)-based Opportunistic Radio (OR) networks, in which the nodes are able to adopt a subset of subcarriers (SCs) available in the considered network area, as well as the transmission rate and power associated with these SCs either for their uplink or downlink transmission. The idea of our top-down approach to the efficient and rational spectrum utilization is to allow each node to first optimize the resources acquisition at OSI-layer 2 (top), where the competition of nodes for available common resources is observed, and then to autonomously optimize the transmission parameters accounting for the radio channel conditions at the physical (down) layer. We assume that the nodes act independently based on their local channel quality information, which contains an error. In these optimization tasks, the efficiency and rationality mechanisms have been introduced in the objective (utility) functions, which reflect the throughput achieved, the network potential to serve multiple nodes, as well as pricing of resources and the power economy. Copyright (c) 2010 John Wiley & Sons, Ltd.", "paper_title": "Efficient and rational spectrum utilization in opportunistic OFDMA networks with imperfect CSI: a utility-based top-down approach", "paper_id": "WOS:000301124400005"}