{"auto_keywords": [{"score": 0.0045726187330434025, "phrase": "reference_attributed_grammars"}, {"score": 0.004209893377338457, "phrase": "direct_and_easy_specification"}, {"score": 0.0041666157975446564, "phrase": "nonlocally_dependent_information"}, {"score": 0.004081385289516914, "phrase": "iterative_fixed-point_computations"}, {"score": 0.003757480190200645, "phrase": "combined_formalism"}, {"score": 0.0037188360359702182, "phrase": "circular_reference_attributed_grammars"}, {"score": 0.003336225354214798, "phrase": "easy_way"}, {"score": 0.0030083825666563898, "phrase": "parser_construction"}, {"score": 0.0027837615811247963, "phrase": "iterative_algorithm"}, {"score": 0.0026986685585382347, "phrase": "general_demand-driven_evaluation_algorithm"}, {"score": 0.002251542790734307, "phrase": "classical_examples"}], "paper_keywords": ["attribute grammars", " circular attribute evaluation", " reference attributes", " fixed-point evaluation", " demand-driven evaluation", " grammar flow", " live analysis"], "paper_abstract": "This paper presents a combination of Reference Attributed Grammars (RAGs) and Circular Attribute Grammars (CAGs). While RAGs allow the direct and easy specification of nonlocally dependent information, CAGs allow iterative fixed-point computations to be expressed directly using recursive (circular) equations. We demonstrate how the combined formalism, Circular Reference Attributed Grammars (CRAGs), can take advantage of both these strengths, making it possible to express solutions to many problems in an easy way. We exemplify with the specification and computation of the nullable, first, and follow sets used in parser construction, a problem which is highly recursive and normally programmed by hand using an iterative algorithm. We also present a general demand-driven evaluation algorithm for CRAGs and some optimizations of it. The approach has been implemented and experimental results include computations on a series of grammars including that of Java 1.2. We also revisit some of the classical examples of CAGs and show how their solutions are facilitated by CRAGs. (c) 2007 Elsevier B.V. All rights reserved.", "paper_title": "Circular reference attributed grammars - their evaluation and applications", "paper_id": "WOS:000249185700003"}