{"auto_keywords": [{"score": 0.0289678922331913, "phrase": "proposed_heuristic_method"}, {"score": 0.00481495049065317, "phrase": "two-stage_hybrid_flow_shop"}, {"score": 0.004590820632326585, "phrase": "two-stage_hybrid_flow_shop_scheduling_problem"}, {"score": 0.004400329132129292, "phrase": "first_stage"}, {"score": 0.004330941610682453, "phrase": "single_common_critical_machine"}, {"score": 0.004240116703465252, "phrase": "second_stage"}, {"score": 0.003978866233891427, "phrase": "critical_machine"}, {"score": 0.003813669883040509, "phrase": "job_type"}, {"score": 0.0036167509502276294, "phrase": "dedicated_machine"}, {"score": 0.0032355864829403413, "phrase": "heuristic_method"}, {"score": 0.0029253546782349875, "phrase": "initial_upper_bounds"}, {"score": 0.0027015344365793016, "phrase": "extensive_computational_experiments"}, {"score": 0.002365815362517737, "phrase": "five_dedicated_machines"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Two-stage hybrid flow shop", " Dedicated machine", " Branch and bound", " Makespan", " Heuristic"], "paper_abstract": "This paper considers a two-stage hybrid flow shop scheduling problem with dedicated machines, in which the first stage contains a single common critical machine, and the second stage contains several dedicated machines. Each job must be first processed on the critical machine in stage one and depending on the job type, the job will be further processed on the dedicated machine of its type in stage two. The objective is to minimize the makespan. To solve the problem, a heuristic method based on branch and bound (B&B) algorithm is proposed. Several lower bounds are derived and four constructive heuristics are used to obtain initial upper bounds. Then, three dominance properties are employed to enhance the performance of the proposed heuristic method. Extensive computational experiments on two different problem categories each with various problem configurations are conducted. The results show that the proposed heuristic method can produce very close-to-optimal schedules for problems up to 100 jobs and five dedicated machines within 60 s. The comparisons with solutions of two other meta-heuristic methods also prove the better performance of the proposed heuristic method. (C) 2012 Elsevier Ltd. All rights reserved.", "paper_title": "A heuristic method for two-stage hybrid flow shop with dedicated machines", "paper_id": "WOS:000309623100040"}