{"auto_keywords": [{"score": 0.048646471286469505, "phrase": "complementary_on-line_services"}, {"score": 0.02098596796106451, "phrase": "consumer_intentions"}, {"score": 0.01764144993749063, "phrase": "mass_customization_options"}, {"score": 0.010612387000973441, "phrase": "mass_customization"}, {"score": 0.007938572251079922, "phrase": "on-line_mass_customization"}, {"score": 0.007075435265992107, "phrase": "product_outcome"}, {"score": 0.0065789949361210725, "phrase": "on-line_mass_customization_process"}, {"score": 0.004976437889502365, "phrase": "perceived_complexity"}, {"score": 0.0041112665381266315, "phrase": "joint_role"}, {"score": 0.0035100601949451028, "phrase": "post_research"}, {"score": 0.003089080923888397, "phrase": "strong_impact"}, {"score": 0.0021049977753042253, "phrase": "negative_effect"}], "paper_keywords": ["Mass customization", " on-line services", " perceived complexity", " perceived control", " perceived enjoyment", " on-line interaction", " on-line visualization"], "paper_abstract": "This study investigates the antecedents of consumer intentions to use mass customization on the Internet and the joint role of complementary on-line services (visualization, salesperson interaction, and post-purchase product adaptation) and the range of mass customization options in on-line mass customization. It extends post research by demonstrating that perceptions of control and enjoyment, in addition to perceptions of product outcome and complexity, have a strong impact on consumer intentions to use an on-line mass customization process. The study finds that both increasing the range of mass customization options and providing complementary on-line services enhance perceptions of product outcome, control, and enjoyment in using an on-line mass customization process. However, in contrast to the range of mass customization options, complementary on-line services can be increased without increasing the perceived complexity of the process. Finally, perceived control mediates the negative effect of perceived complexity on consumer intentions to use on-line mass customization.", "paper_title": "Increasing the Attractiveness of Mass Customization: The Role of Complementary On-line Services and Range of Options", "paper_id": "WOS:000264724000003"}