{"auto_keywords": [{"score": 0.041078685670043524, "phrase": "term_graphs"}, {"score": 0.027013148553425844, "phrase": "infinitary_term"}, {"score": 0.006611698528224177, "phrase": "partial_order"}, {"score": 0.00481495049065317, "phrase": "term_graph_rewriting._term_graph"}, {"score": 0.0047310525657970615, "phrase": "simple_mechanism"}, {"score": 0.004648609688625397, "phrase": "restricted_forms"}, {"score": 0.004429191773525288, "phrase": "term_graph"}, {"score": 0.004056334733843591, "phrase": "appropriate_counterpart"}, {"score": 0.003477505397536663, "phrase": "generalise_corresponding_modes"}, {"score": 0.003226834737003501, "phrase": "common_framework"}, {"score": 0.002682081928174866, "phrase": "conservative_extensions"}, {"score": 0.002646880721119838, "phrase": "corresponding_modes"}, {"score": 0.002288797099841088, "phrase": "intrinsic_completeness"}, {"score": 0.0021330078238529465, "phrase": "conservative_extension"}, {"score": 0.0021049977753042253, "phrase": "metric_convergence"}], "paper_keywords": ["term graphs", " partial order", " metric", " infinitary rewriting", " graph rewriting"], "paper_abstract": "Term graph rewriting provides a simple mechanism to finitely represent restricted forms of infinitary term rewriting. The correspondence between infinitary term rewriting and term graph rewriting has been studied to some extent. However, this endeavour is impaired by the lack of an appropriate counterpart of infinitary rewriting on the side of term graphs. We aim to fill this gap by devising two modes of convergence based on a partial order respectively a metric on term graphs. The thus obtained structures generalise corresponding modes of convergence that are usually studied in infinitary term rewriting. We argue that this yields a common framework in which both term rewriting and term graph rewriting can be studied. In order to substantiate our claim, we compare convergence on term graphs and on terms. In particular, we show that the modes of convergence on term graphs are conservative extensions of the corresponding modes of convergence on terms and are preserved under unravelling term graphs to terms. Moreover, we show that many of the properties known from infinitary term rewriting are preserved. This includes the intrinsic completeness of both modes of convergence and the fact that convergence via the partial order is a conservative extension of the metric convergence.", "paper_title": "MODES OF CONVERGENCE FOR TERM GRAPH REWRITING", "paper_id": "WOS:000307646300006"}