{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "development_practices"}, {"score": 0.004768104290288521, "phrase": "knowledge_management"}, {"score": 0.004721711709176679, "phrase": "software_engineering_and_software_process_improvement_activities"}, {"score": 0.00428179779071721, "phrase": "organization's_specific_needs"}, {"score": 0.004077394032903726, "phrase": "scalable_improvement_approaches"}, {"score": 0.0038261310307416475, "phrase": "tool_support"}, {"score": 0.003770373393393271, "phrase": "experience_factory_approach"}, {"score": 0.0034863899423238707, "phrase": "development_projects"}, {"score": 0.003368948014436942, "phrase": "iteratively_improved_decision_support"}, {"score": 0.0031612033120065747, "phrase": "initial_evaluation"}, {"score": 0.0030696773722514105, "phrase": "organizational_improvement"}, {"score": 0.002838319783373086, "phrase": "organizational_characteristics"}, {"score": 0.002414616656410503, "phrase": "different_practices"}, {"score": 0.0023677483882740317, "phrase": "different_parts"}, {"score": 0.0021678232353129472, "phrase": "context_information"}], "paper_keywords": ["Postmortem review", " Knowledge management", " Software process improvement", " Software", " Engineering"], "paper_abstract": "Knowledge management in software engineering and software process improvement activities pose challenges as initiatives are deployed. Most existing approaches are either too expensive to deploy or do not take an organization's specific needs into consideration. There is thus a need for scalable improvement approaches that leverage knowledge already residing in the organizations. This paper presents tool support for an Experience Factory approach for disseminating and improving practices used in an organization. Experiences from using practices in development projects are captured in postmortems and provide iteratively improved decision support for identifying what practices work well and what needs improvement. An initial evaluation of using the tool for organizational improvement has been performed utilizing both academia and industry. The results from the evaluation indicate that organizational characteristics influence how practices and experiences can be used. Experiences collected in postmortems are estimated to have little effect on improvements to practices used throughout the organization. However, in organizations where different practices are used in different parts of the organization, making practices available together with experiences from use, as well as having context information, can influence decisions on what practices to use in projects.", "paper_title": "Tool support for disseminating and improving development practices", "paper_id": "WOS:000298864600005"}