{"auto_keywords": [{"score": 0.04224478442118721, "phrase": "vcr_operations"}, {"score": 0.03373905846456357, "phrase": "proposed_scheme"}, {"score": 0.030130868625455328, "phrase": "frequent_vcr_operations"}, {"score": 0.029071185405892222, "phrase": "server_workload"}, {"score": 0.00481495049065317, "phrase": "interactive_operations"}, {"score": 0.0047273577269638725, "phrase": "scalable_vod_streaming_services"}, {"score": 0.00458488025289647, "phrase": "hot_issue"}, {"score": 0.004339108074589304, "phrase": "video_streaming_services"}, {"score": 0.0035887342563437935, "phrase": "service_scheme"}, {"score": 0.002985988377995789, "phrase": "node_lists"}, {"score": 0.002791239714439304, "phrase": "significant_overhead"}, {"score": 0.00259320616168125, "phrase": "real_traces"}, {"score": 0.0025459275963373496, "phrase": "content_distribution_network"}], "paper_keywords": ["streaming", " P2P", " VoD", " VCR operations"], "paper_abstract": "Providing scalable VoD streaming services has recently become a hot issue, and many approaches have been proposed. Because video streaming services through the Internet are widely used, the need to support VCR operations also increases. However, there are few approaches to supporting VCR operations on the Internet. We propose a service scheme based on chaining, in which clients as well as the server provide streaming services. In the proposed scheme, services are provided by unicast and managed locally using node lists. In addition, our scheme can support frequent VCR operations without incurring significant overhead in the server workload. We have evaluated our scheme through simulation with real traces from a content distribution network (CDN) company and with various parameters. The results show that the proposed scheme reduces server workload significantly. The results also verify that frequent VCR operations can be served smoothly without causing too much overhead.", "paper_title": "P-chaining: a practical VoD service scheme autonomically handling interactive operations", "paper_id": "WOS:000256622500005"}