{"auto_keywords": [{"score": 0.024149396723312254, "phrase": "case_firm"}, {"score": 0.004681971826924847, "phrase": "knowledge_management_performance_measurement"}, {"score": 0.004633052743252902, "phrase": "single_most_important_task"}, {"score": 0.0045208777171271254, "phrase": "performance_measurement"}, {"score": 0.004304574865291508, "phrase": "knowledge_measurement"}, {"score": 0.003768028741967194, "phrase": "firm's_knowledge_management_performance"}, {"score": 0.003663863368587395, "phrase": "anp"}, {"score": 0.0036002125374696237, "phrase": "clear_direction"}, {"score": 0.00347620887265168, "phrase": "competitive_advantage"}, {"score": 0.0034398445347109396, "phrase": "anp_approach"}, {"score": 0.0033919477901198716, "phrase": "present_study"}, {"score": 0.0033330104902937383, "phrase": "multiple_criteria"}, {"score": 0.0031845067058084583, "phrase": "tangible_and_intangible_information"}, {"score": 0.0030855783418239366, "phrase": "detailed_comparison"}, {"score": 0.0030532878377173885, "phrase": "firm's_km_performance"}, {"score": 0.0029172107428045964, "phrase": "effective_information"}, {"score": 0.002719576221177709, "phrase": "comprehensive_model"}, {"score": 0.002625824756118839, "phrase": "km_performance_measurements"}, {"score": 0.0025892330566358503, "phrase": "major_rivals"}, {"score": 0.002439308179084911, "phrase": "km_performance_measurement"}, {"score": 0.0024137645015872952, "phrase": "practical_point"}, {"score": 0.002289993730291136, "phrase": "firm_present_changes"}], "paper_keywords": ["competitiveness", " analytical network process (ANP)", " multi-criteria decision making (MCDM)", " knowledge management (KM)", " quantitative modeling"], "paper_abstract": "The single most important task of knowledge management (KM) performance measurement is comparing your company with its main rivals. Most of the metrics and methods of knowledge measurement that have been developed are concentrated on measuring the knowledge within the organization, which may be nice to know, but is not critical. In this paper, we propose a methodology for comparing a firm's knowledge management performance with its major rivals using the Analytical Network Process (ANP) to obtain a clear direction of the effort required to gain or maintain a competitive advantage. The ANP approach employed in the present study is a theory of multiple criteria decision making (MCDM), and is good at dealing with tangible and intangible information. Our methodology is designed to make a detailed comparison of a firm's KM performance with that of its main rivals, in order to be able to provide effective information for improving its KM and to increase its decision-making quality. This paper makes three important contributions: (1) it develops a comprehensive model, which incorporates a variety of issues for conducting KM performance measurements in comparison with major rivals; (2) case experience is provided to help us understand the advantages and disadvantages of the methodology for KM performance measurement from a practical point of view, and (3) the results obtained from exploring the case firm present changes that the case firm can make, implying that the case firm must reinforce its knowledge creation and internalization so as to improve its position in comparison with its most competitive rivals. The method proposed by this paper is generic in nature and is applicable to benefit any firm.", "paper_title": "Comparing with your main competitor: the single most important task of knowledge management performance measurement", "paper_id": "WOS:000249149900003"}