{"auto_keywords": [{"score": 0.0317638439001368, "phrase": "heuristic_algorithm"}, {"score": 0.031076433821815956, "phrase": "worst_voltage_drop"}, {"score": 0.004400804926266097, "phrase": "network_designs"}, {"score": 0.004278807087784626, "phrase": "feature_size"}, {"score": 0.003954837422946628, "phrase": "voltage_drop"}, {"score": 0.0033974527047473044, "phrase": "die_voltage_drop"}, {"score": 0.003140004304719746, "phrase": "early_design_stage"}, {"score": 0.003070086433952691, "phrase": "even_distribution_design_strategies"}, {"score": 0.002727700630869639, "phrase": "stacked_vias"}, {"score": 0.0026971491199975083, "phrase": "nonadjacent_layers"}, {"score": 0.0026222551419772867, "phrase": "\"hot\"_areas"}, {"score": 0.0025638362414466278, "phrase": "large_voltage_drop"}, {"score": 0.0022906498741695094, "phrase": "voltage_drop_distribution"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["P/G network", " Voltage drop", " Via distribution", " Stacked via"], "paper_abstract": "The usage of via stack was not carefully studied in previous multi-layered P/G (Power/Ground) network designs. However, with feature size scaling down, the resistance of via is increasing quickly and their influence on voltage drop of P/G networks has become obvious. In this paper, two optimization techniques for via placement are proposed, which are proved to be helpful in reducing on die voltage drop. Firstly, an efficient heuristic algorithm based on sensitivity analysis is presented to optimize via distribution in early design stage. Compared with even distribution design strategies, averagely the heuristic algorithm can reduce the worst voltage drop by 8.43% without adding more vias. Secondly, experiments demonstrated that using stacked vias in nonadjacent layers is powerful in eliminating \"hot\" areas which suffer from large voltage drop. Based on this observation, a heuristic algorithm is developed to further reduce the worst voltage drop. Experiments show that voltage drop distribution can be well optimized by combining these two strategies together. (C) 2009 Elsevier B.V. All rights reserved.", "paper_title": "Optimization of via distribution and stacked via in multi-layered P/G networks", "paper_id": "WOS:000278346600007"}