{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "dedicated_freight_double-track_railway_line"}, {"score": 0.00443308765153716, "phrase": "detailed_and_flexible_accelerated-time_microscopic_simulation"}, {"score": 0.004297795905522757, "phrase": "specialized_double-track_freight_line"}, {"score": 0.004102528738941734, "phrase": "fixed_section_rail_traffic_controller"}, {"score": 0.0040186038781533946, "phrase": "classic_semaphore-based_block-system"}, {"score": 0.003531474887552889, "phrase": "loops_convoys"}, {"score": 0.003336225354214798, "phrase": "slower_one"}, {"score": 0.0032176163279340206, "phrase": "first_station"}, {"score": 0.0030239842475439814, "phrase": "passing_loop"}, {"score": 0.002755104031926742, "phrase": "different_sets"}, {"score": 0.0023711591828229736, "phrase": "different_possible_configurations"}, {"score": 0.0023346234464901978, "phrase": "railway_line"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Simulation", " Railway line capacity", " Railway traffic planning"], "paper_abstract": "The goal of this project (endorsed by the Spanish Railway Foundation) is to develop a detailed and flexible accelerated-time microscopic simulation of train movements within a specialized double-track freight line. The virtual line is provided with a fixed section rail traffic controller (like a classic semaphore-based block-system or Level 1 ERTMS), that is automatically operated by the simulation and obeyed by the trains. It also sets apart at passing loops convoys closely followed by a faster one, so that the slower one can be overtaken (at the first station where this is possible, according to the length of the passing loop and the length of the train). Very low timings have been obtained when testing the software with different sets of data, as detailed in the article. We believe that we have developed a very useful simulation tool, as it can return the result of the simulations of different possible configurations of the railway line in a matter of seconds, consequently aiding experts in decision taking about station lengthening. (C) 2010 Elsevier Ltd. All rights reserved.", "paper_title": "An accelerated-time microscopic simulation of a dedicated freight double-track railway line", "paper_id": "WOS:000275746300016"}