{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "phrase_pattern_recognition"}, {"score": 0.004621148492564008, "phrase": "automatic_approaches"}, {"score": 0.004558289038745564, "phrase": "predefined_phrase_structures"}, {"score": 0.004276016541197123, "phrase": "excellent_performance"}, {"score": 0.0037971749182744334, "phrase": "online_applications"}, {"score": 0.003660879039645457, "phrase": "thousand_words"}, {"score": 0.003611034322786669, "phrase": "limited_time"}, {"score": 0.003433987036569199, "phrase": "five_typical_multiclass_svm_methods"}, {"score": 0.003148316319108045, "phrase": "phrase_types"}, {"score": 0.0030491497463386924, "phrase": "proposed_two_new_multiclass_svm_models"}, {"score": 0.002834199301007534, "phrase": "svm"}, {"score": 0.0027073229284666294, "phrase": "similar_tasks"}, {"score": 0.0026704265616705023, "phrase": "named_entity_recognition"}, {"score": 0.0026461080202599694, "phrase": "chinese_word_segmentation"}, {"score": 0.0025627881453780398, "phrase": "chinese"}, {"score": 0.002370955769074803, "phrase": "state-of-the-art_svm-based_phrase_chunking_method"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["machine learning", " multiclass classification", " natural language processing", " support vector machines"], "paper_abstract": "Phrase pattern recognition (phrase chunking) refers to automatic approaches for identifying predefined phrase structures in a stream of text. Support vector machines (SVMs)-based methods had shown excellent performance in many sequential text pattern recognition tasks such as protein name finding, and noun phrase (NP)-chunking. Even though they yield very accurate results, they are not efficient for online applications, which need to handle hundreds of thousand words in a limited time. In this paper, we firstly re-examine five typical multiclass SVM methods and the adaptation to phrase chunking. However, most of them were inefficient when the number of phrase types scales. We thus introduce the proposed two new multiclass SVM models that make the system substantially faster in terms of training and testing while keeps the SVM accurate. The two methods can also be applied to similar tasks such as named entity recognition and Chinese word segmentation. Experiments on CoNLL-2000 chunking and Chinese base-chunking tasks showed that our method can achieve very competitive accuracy and at least 100 times faster than the state-of-the-art SVM-based phrase chunking method. Besides, the computational time complexity and the time cost analysis of our methods were also given in this paper. (c) 2008 Elsevier Ltd. All rights reserved.", "paper_title": "Robust and efficient multiclass SVM models for phrase pattern recognition", "paper_id": "WOS:000257581000011"}