{"auto_keywords": [{"score": 0.02712582733582242, "phrase": "average_distortion"}, {"score": 0.026376907499763538, "phrase": "average_psnr"}, {"score": 0.00481495049065317, "phrase": "internet_users"}, {"score": 0.0045843245695654875, "phrase": "personal_and_professional_data"}, {"score": 0.004418601451254075, "phrase": "second_thought"}, {"score": 0.004329124434198367, "phrase": "sheer_speed"}, {"score": 0.0041725881174377345, "phrase": "computer_technology"}, {"score": 0.003751331782523201, "phrase": "working_knowledge"}, {"score": 0.0037207397635410327, "phrase": "network_operation_mechanisms"}, {"score": 0.0036156119373414067, "phrase": "packet_data"}, {"score": 0.003372460634140967, "phrase": "data_privacy"}, {"score": 0.0031975786158658158, "phrase": "information_hiding_methods"}, {"score": 0.0031715512855939494, "phrase": "steganography"}, {"score": 0.003069230909006614, "phrase": "secret_data"}, {"score": 0.0030317376771013672, "phrase": "cover_image"}, {"score": 0.0026920404458807444, "phrase": "data_hiding"}, {"score": 0.002266246304762945, "phrase": "lsb_substitution_method"}, {"score": 0.002148604369150115, "phrase": "ternary's_embedding_method"}], "paper_keywords": ["(5,3) linear code", " Distortion", " LSB substitution method"], "paper_abstract": "Nowadays, Internet users surf the net, send billions of e-mails, and transfer personal and professional data via the Internet daily, often without a second thought. It is the sheer speed and ease of using the Internet that pushes computer technology to constantly evolve. Yet these luxuries may come at a price. Data transferred on the Internet consists of many packets. Anyone with a working knowledge of network operation mechanisms and having the ability to capture packet data can decode it and intercept data. Suffice to say, there is a lack of data privacy on the Internet, and this issue has driven researchers to propose information hiding methods. Steganography, the information hiding method, embeds secret data into a cover image to evade detection and maintain privacy between the sender and receiver. This paper makes use of the property of (5,3) linear code to propose a method of data hiding. The scheme embeds 1 bit of a secret per pixel and the average distortion is about 0.375, with an average PSNR about 52.3904. Under the same embedding capacity (<= 512x512 binary bits), our average PSNR value is better than either using the LSB substitution method with an average distortion of 0.5 and an average PSNR of 51.1411 or applying Ternary's embedding method having about 0.4206 and 51.892 as the two respective values.", "paper_title": "A LOW DISTORTION INFORMATION HIDING METHOD BASED ON (5,3) CODE", "paper_id": "WOS:000292626800028"}