{"auto_keywords": [{"score": 0.03420914292086825, "phrase": "dp"}, {"score": 0.031979688609145136, "phrase": "exalin"}, {"score": 0.00481495049065317, "phrase": "information_theoretic_approach"}, {"score": 0.004720606036240263, "phrase": "mrna_sequences"}, {"score": 0.004651057147690674, "phrase": "sequence_tags"}, {"score": 0.00442651096522781, "phrase": "alternatively_spliced_products"}, {"score": 0.0043183186953102805, "phrase": "transcript_sequences"}, {"score": 0.004130165601475531, "phrase": "genomic_sequence_template"}, {"score": 0.004069280130346136, "phrase": "existing_programs"}, {"score": 0.0035954555250614197, "phrase": "sequence_similarity"}, {"score": 0.003507504253087326, "phrase": "pssm_splice_site_models"}, {"score": 0.0031453010852936334, "phrase": "optimal_solutions"}, {"score": 0.003053159610975692, "phrase": "resultant_program"}, {"score": 0.0028911669203979156, "phrase": "wide_range"}, {"score": 0.0027650234530228897, "phrase": "human-mouse_cross-species_comparisons"}, {"score": 0.002657511557782469, "phrase": "splice_site_prediction_accuracy"}, {"score": 0.002504011301105577, "phrase": "blastn._availability"}, {"score": 0.002278864007026037, "phrase": "caenorhabditis"}, {"score": 0.0021049977753042253, "phrase": "source_code"}], "paper_keywords": [""], "paper_abstract": "Motivation: mRNA sequences and expressed sequence tags represent some of the most abundant experimental data for identifying genes and alternatively spliced products in metazoans. These transcript sequences are frequently studied by aligning them to a genomic sequence template. For existing programs, error-prone, polymorphic and cross-species data, as well as non-canonical splice sites, still present significant barriers to producing accurate, complete alignments. Results: We took a novel approach to spliced alignment that meaningfully combined information from sequence similarity with that obtained from PSSM splice site models. Scoring systems were chosen to maximize their power of discrimination, and dynamic programming (DP) was employed to guarantee optimal solutions would be found. The resultant program, EXALIN, performed better than other popular tools tested under a wide range of conditions that included detection of micro-exons and human-mouse cross-species comparisons. For improved speed with only a marginal decrease in splice site prediction accuracy, EXALIN could perform limited DP guided by a result from BLASTN. Availability: The source code, binaries, scripts, scoring matrices and splice site models for human, mouse, rice and Caenorhabditis elegans utilized in this study are posted at http://blast.wustl.edu/exalin. The software (scripts, source code and binaries) is copyrighted but free for all to use.", "paper_title": "Improved spliced alignment from an information theoretic approach", "paper_id": "WOS:000234433500006"}