{"auto_keywords": [{"score": 0.04258655412884402, "phrase": "existing_map-matching_algorithms"}, {"score": 0.03340305748453232, "phrase": "existing_algorithms"}, {"score": 0.00481495049065317, "phrase": "real-time_map-matching_algorithms"}, {"score": 0.004413846562278824, "phrase": "optimal_routes"}, {"score": 0.004350308086118336, "phrase": "specified_locations"}, {"score": 0.004287680323820891, "phrase": "reliable_map-matching_algorithm"}, {"score": 0.004225950334493496, "phrase": "indispensable_and_integral_part"}, {"score": 0.0037087324991876727, "phrase": "future_studies"}, {"score": 0.0034325187732054093, "phrase": "map_qualities"}, {"score": 0.0032389001343643064, "phrase": "interesting_insights"}, {"score": 0.002997572637726648, "phrase": "example_findings"}, {"score": 0.0026049517737353365, "phrase": "unbalanced_trade-off"}, {"score": 0.0024107449502335583, "phrase": "algorithms_balance_simplicity"}, {"score": 0.0023644936731468252, "phrase": "advanced_map-matching_algorithms"}, {"score": 0.0022967713922705, "phrase": "low_performance"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Navigation", " Map-matching algorithm", " Road network", " Positioning system"], "paper_abstract": "Current navigation systems/services allow drivers to keep track of their precise whereabouts and provide optimal routes to reach specified locations. A reliable map-matching algorithm is an indispensable and integral part of any land-based navigation system/service. This paper reviews existing map-matching algorithms with the aim of highlighting their qualities as well as unfolding their unresolved issues as a means to provide directions for future studies in this field. Existing map-matching algorithms are compared and contrasted with respect to positioning sensors, map qualities, assumptions and accuracies. The results of these comparisons provide interesting insights into the workings of existing algorithms and the issues they must address for improving their performance. Example findings are: (a) not all map-matching algorithms pay sufficient attention to topology of networks, directionality of roads or turn-restrictions; (b) most map-matching algorithms make an unbalanced trade-off between performance and accuracy; and (c) weight-based map-matching algorithms balance simplicity and accuracy and advanced map-matching algorithms provide high accuracy but with low performance. Based on the findings, suggestions are made to improve existing algorithms. (C) 2014 Elsevier Ltd. All rights reserved.", "paper_title": "A critical review of real-time map-matching algorithms: Current issues and future directions", "paper_id": "WOS:000342864600013"}