{"auto_keywords": [{"score": 0.015482531745998587, "phrase": "federated_cloud"}, {"score": 0.015248870271623326, "phrase": "cloud_providers"}, {"score": 0.00481495049065317, "phrase": "cloud_provider"}, {"score": 0.004705206179790976, "phrase": "resource_provisioning"}, {"score": 0.004545240514015278, "phrase": "high_variability"}, {"score": 0.004050116768809519, "phrase": "peak_hours"}, {"score": 0.003957735532719663, "phrase": "valley_hours"}, {"score": 0.003328611206488653, "phrase": "underused_resources"}, {"score": 0.003034916887102753, "phrase": "clear_understanding"}, {"score": 0.0026934777251033776, "phrase": "environment_conditions"}, {"score": 0.0025817653186901175, "phrase": "free_resources"}, {"score": 0.002465161736207254, "phrase": "unused_nodes"}, {"score": 0.002308910575113746, "phrase": "federated_provider"}, {"score": 0.0021049977753042253, "phrase": "real_provider"}], "paper_keywords": ["Cloud provider", " Profit", " Outsourcing", " Federation"], "paper_abstract": "Resource provisioning in Cloud providers is a challenge because of the high variability of load over time. On the one hand, the providers can serve most of the requests owning only a restricted amount of resources, but this forces to reject customers during peak hours. On the other hand, valley hours incur in under-utilization of the resources, which forces the providers to increase their prices to be profitable. Federation overcomes these limitations and allows providers to dynamically outsource resources to others in response to demand variations. Furthermore, it allows providers with underused resources to rent them to other providers. Both techniques make the provider getting more profit when used adequately. Federation of Cloud providers requires having a clear understanding of the consequences of each decision. In this paper, we present a characterization of providers operating in a federated Cloud which helps to choose the most convenient decision depending on the environment conditions. These include when to outsource to other providers, rent free resources to other providers (i.e., insourcing), or turn off unused nodes to save power. We characterize these decisions as a function of several parameters and implement a federated provider that uses this characterization to exploit federation. Finally, we evaluate the profitability of using these techniques using the data from a real provider.", "paper_title": "Economic model of a Cloud provider operating in a federated Cloud", "paper_id": "WOS:000307276000002"}