{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "probabilistic_silhouette-based_dynamic_scene_reconstruction"}, {"score": 0.00447341965028879, "phrase": "object_shapes"}, {"score": 0.004275347843870176, "phrase": "multiple_geometrically_calibrated_video_camcorders"}, {"score": 0.0038392331564122387, "phrase": "distinctive_label"}, {"score": 0.0037109446302945903, "phrase": "voxel_location"}, {"score": 0.0035869274480340727, "phrase": "automatically-learned_view-specific_appearance_models"}, {"score": 0.003370190834214415, "phrase": "photometric_calibration"}, {"score": 0.0032760377953971248, "phrase": "generative_probabilistic_sensor_models"}, {"score": 0.0030955250132409964, "phrase": "sensor_observations"}, {"score": 0.0030606302942851027, "phrase": "object_labels"}, {"score": 0.003026127736667187, "phrase": "bayesian_reasoning"}, {"score": 0.0029249294679606656, "phrase": "robust_reconstruction"}, {"score": 0.0028919522313933525, "phrase": "real-world_environment_challenges"}, {"score": 0.0026262033625248445, "phrase": "visual_occlusion_process"}], "paper_keywords": ["Multi-view 3D reconstruction", " Bayesian inference", " Graphical model", " Shape-from-silhouette", " Occlusion"], "paper_abstract": "In this paper, we present an algorithm to probabilistically estimate object shapes in a 3D dynamic scene using their silhouette information derived from multiple geometrically calibrated video camcorders. The scene is represented by a 3D volume. Every object in the scene is associated with a distinctive label to represent its existence at every voxel location. The label links together automatically-learned view-specific appearance models of the respective object, so as to avoid the photometric calibration of the cameras. Generative probabilistic sensor models can be derived by analyzing the dependencies between the sensor observations and object labels. Bayesian reasoning is then applied to achieve robust reconstruction against real-world environment challenges, such as lighting variations, changing background etc. Our main contribution is to explicitly model the visual occlusion process and show: (1) static objects (such as trees or lamp posts), as parts of the pre-learned background model, can be automatically recovered as a byproduct of the inference; (2) ambiguities due to inter-occlusion between multiple dynamic objects can be alleviated, and the final reconstruction quality is drastically improved. Several indoor and outdoor real-world datasets are evaluated to verify our framework.", "paper_title": "Multi-view Occlusion Reasoning for Probabilistic Silhouette-Based Dynamic Scene Reconstruction", "paper_id": "WOS:000282782700002"}