{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "solar-powered_wireless_motion_sensor_surveillance_network"}, {"score": 0.004580769304731227, "phrase": "single_points"}, {"score": 0.004420472010542188, "phrase": "elaborate_power_system"}, {"score": 0.004131135118662576, "phrase": "remote_areas"}, {"score": 0.004087207102190335, "phrase": "main_power_supply"}, {"score": 0.0036207206487324506, "phrase": "wireless_motion_surveillance_network"}, {"score": 0.0032883848851259123, "phrase": "multiple_microchip_picdem_z_nodes"}, {"score": 0.0031393948330209255, "phrase": "infrared_motion_detector"}, {"score": 0.003072918736387408, "phrase": "solar_power_unit"}, {"score": 0.0030078460113945136, "phrase": "dsimd"}, {"score": 0.002780783274864117, "phrase": "solar_energy"}, {"score": 0.0027121844541913367, "phrase": "remote_applications"}, {"score": 0.0025525322651112365, "phrase": "low-cost_system"}, {"score": 0.0024281181691350085, "phrase": "unlimited_power_supply"}, {"score": 0.0023513512089705303, "phrase": "wider_range"}, {"score": 0.0022851491693940272, "phrase": "cmos_camera"}, {"score": 0.0021582723621960693, "phrase": "detected_object"}, {"score": 0.0021049977753042253, "phrase": "john_wiley"}], "paper_keywords": ["solar-powered wireless sensor networks", " ZigBee", " surveillance applications"], "paper_abstract": "This paper describes the design and implementation of a solar-powered wireless motion sensor surveillance network. Commercially available systems with similar functionality which exist today have several disadvantages including single points of failure and requires (semi) constant personnel attention as well as an elaborate power system. These systems require a lot of time to set up, they cannot be used in remote areas where a main power supply is unavailable, and are quite costly. Therefore, there is a need to develop a system which is portable, easy to set tip, and is energy efficient. The wireless motion surveillance network described in this paper is designed to be portable, economically inexpensive, and energy efficient. The network is created using the IEEE 802.15.4 ZigBee wireless standard by implementing multiple Microchip PICDEM Z nodes. Each node in the network is equipped with a Direction Sensing Infrared Motion Detector (DSIMD) and a solar power unit (SPU). The DSIMD allows for detection of humans and animals alike moving into or out of the network. The system is powered by solar energy that makes it quite adaptable for remote applications. The network is able to cover an area of radius 30 m. By developing a low-cost system, which is portable, easy to set up, and has an unlimited power supply, this technology is made accessible to a wider range of applications. The implementation of a CMOS camera is discussed at the end which can be used to take a snapshot of the detected object. Copyright (C) 2007 John Wiley & Sons, Ltd.", "paper_title": "Solar-powered ZigBee-based wireless motion surveillance: a prototype development and experimental results", "paper_id": "WOS:000261900500003"}