{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "integrated_three-dimensional_customization"}, {"score": 0.004256243266481051, "phrase": "product_design_environments"}, {"score": 0.003808845109556467, "phrase": "product_design"}, {"score": 0.0034935290662899488, "phrase": "custom_order_information"}, {"score": 0.0030497740719977835, "phrase": "custom_product"}, {"score": 0.0025972447844047515, "phrase": "product_data_processing"}, {"score": 0.002471973283582411, "phrase": "three-dimensional_product_data"}, {"score": 0.0023382335380460304, "phrase": "commercial_e-commerce_system"}, {"score": 0.0021845387990972543, "phrase": "mobile_phones"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v._all_rights"}], "paper_keywords": ["three dimensions", " interactive customization", " integrated e-Commerce system"], "paper_abstract": "This paper presents an, interactive, three-dimensional, Web-based and integrated e-Commerce system. This system enforces businesses to implement mass customization, through integration with product design environments on PDM/PLM systems. Through this system, consumers, partners or distributors, can take part in product design and get through their ideas, online and visually, to suppliers. With custom order information, suppliers produce or assembly to meet their customers' demands as precisely and efficiently. We also developed a toolkit to configure the custom product and construct such an interactive website automatically through back PDM/PLM system. Several concerns on this system have been addressed, including its applicable business models, applied techniques, and implementation issues in product data processing, traffic-reduced transportation mechanism of three-dimensional product data, and three-dimensional interaction. A commercial e-Commerce system has been functional and ready for apparel, automobile and mobile phones. (C) 2006 Elsevier B.V. All rights reserved.", "paper_title": "An interactive web system for integrated three-dimensional customization", "paper_id": "WOS:000242519900016"}