{"auto_keywords": [{"score": 0.04305913660451477, "phrase": "abc"}, {"score": 0.03698212852445214, "phrase": "eabc"}, {"score": 0.00481495049065317, "phrase": "artificial_bee_colony_algorithm"}, {"score": 0.00456020621016909, "phrase": "relatively_new_optimization_technique"}, {"score": 0.0035701213515857227, "phrase": "novel_abc_method"}, {"score": 0.0033994761198547934, "phrase": "abc."}, {"score": 0.0030654278282822027, "phrase": "candidate_solutions"}, {"score": 0.0030157628075954588, "phrase": "employed_bee_phase"}, {"score": 0.002966900048034132, "phrase": "onlookers_phase"}, {"score": 0.002704554429386671, "phrase": "alternative_solutions"}, {"score": 0.0022967713922705, "phrase": "faster_global_convergence"}, {"score": 0.0022718774783143203, "phrase": "higher_solution_quality"}, {"score": 0.002235040467016128, "phrase": "stronger_robustness"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Artificial bee colony algorithm", " Evolutionary algorithms", " Search equation", " Differential evolution"], "paper_abstract": "Artificial bee colony (ABC) algorithm is a relatively new optimization technique which has been shown to be competitive to other population-based algorithms. However, there is still an insufficiency in ABC regarding its solution search equation, which is good at exploration but poor at exploitation. To address this concerning issue, in this paper, we propose a novel ABC method called as EABC to improve the performance of ABC. In our method, in order to balance the exploration and the exploitation, two new search equations are presented to generate candidate solutions in the employed bee phase and the onlookers phase, respectively. Additionally, we use a more robust calculation to determine and compare the quality of alternative solutions. Experiments are conducted on a set of 48 benchmark functions and also two engineering optimization problems. The results show that EABC significantly improves the performance of ABC, offering faster global convergence, higher solution quality, and stronger robustness when compared with the other algorithms. (c) 2014 Elsevier Inc. All rights reserved.", "paper_title": "Enhancing artificial bee colony algorithm using more information-based search equations", "paper_id": "WOS:000335635600006"}