{"auto_keywords": [{"score": 0.03505259408176851, "phrase": "fuzzy_partition"}, {"score": 0.016336193718780215, "phrase": "icfa_algorithm"}, {"score": 0.010425575077788777, "phrase": "function_approximation"}, {"score": 0.010287604915917152, "phrase": "function_approximation_problem"}, {"score": 0.00689306850131134, "phrase": "noise_conditions"}, {"score": 0.00481495049065317, "phrase": "clustering_algorithm"}, {"score": 0.004772137871562584, "phrase": "rbfnn_design"}, {"score": 0.0044430006374681285, "phrase": "radial_basis_function_neural_networks"}, {"score": 0.004248869786808024, "phrase": "neural_networks"}, {"score": 0.0037827612491843983, "phrase": "rbfnn"}, {"score": 0.003666217992454448, "phrase": "improved_clustering"}, {"score": 0.003278447235176858, "phrase": "input_data"}, {"score": 0.0030932495918679285, "phrase": "possibilistic_and_mixed_approaches"}, {"score": 0.0030520148188164084, "phrase": "fuzzy_and_possibilistic_partitions"}, {"score": 0.00259793885118959, "phrase": "fuzzy-possibilistic_partitions"}, {"score": 0.0025291018422967083, "phrase": "comparative_analysis"}, {"score": 0.002364865100579589, "phrase": "possibilistic_approach"}, {"score": 0.0021049977753042253, "phrase": "combining_fuzzy_and_possibilistic_approach"}], "paper_keywords": [""], "paper_abstract": "The function approximation problem has been tackled many times in the literature by using radial basis function neural networks (RBFNNs). In the design of these neural networks there are several stages where, the most critical stage is the initialization of the centers of each RBF since the rest of the steps to design the RBFNN strongly depend on it. The improved clustering for function approximation (ICFA) algorithm was recently introduced and proved successful for the function approximation problem. In the ICFA algorithm, a fuzzy partition of the input data is performed but, a fuzzy partition can behave inadequately in noise conditions. Possibilistic and mixed approaches, combining fuzzy and possibilistic partitions, were developed in order to improve the performance of a fuzzy partition. In this paper, a study of the influence of replacing the fuzzy partition used in the ICFA algorithm with the possibilistic and the fuzzy-possibilistic partitions will be done. A comparative analysis of each kind of partition will be performed in order to see if the possibilistic approach can improve the performance of the ICFA algorithm both in normal and in noise conditions. The results will show how the employment of a mixed approach combining fuzzy and possibilistic approach can lead to improve the results when designing RBFNNs.", "paper_title": "Studying possibility in a clustering algorithm for RBFNN design for function approximation", "paper_id": "WOS:000251098200009"}