{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "capps"}, {"score": 0.0047013405841819025, "phrase": "power-performance_tradeoffs"}, {"score": 0.004525088883501587, "phrase": "-chip_communication"}, {"score": 0.004439445472040688, "phrase": "on-chip_communication_architectures"}, {"score": 0.004293434614435972, "phrase": "power_consumption"}, {"score": 0.0038834787946979863, "phrase": "large_design_space"}, {"score": 0.003702206069379459, "phrase": "relevant_communication_architecture_configurations"}, {"score": 0.0036669760226536977, "phrase": "diverse_power_and_performance_characteristics"}, {"score": 0.0035125292519354724, "phrase": "automated_framework"}, {"score": 0.0034790978593553794, "phrase": "fast_system-level"}, {"score": 0.003146652729098066, "phrase": "energy_models"}, {"score": 0.00311669276800628, "phrase": "system-level_exploration"}, {"score": 0.003087017178815267, "phrase": "bus_matrix_communication_architectures"}, {"score": 0.002942811795757911, "phrase": "bus_matrix_synthesis_flow"}, {"score": 0.00283229915062791, "phrase": "power-performance_design_space"}, {"score": 0.0028053237950173508, "phrase": "different_bus_matrix_configurations"}, {"score": 0.0024185182010749273, "phrase": "detailed_gate-level_power_estimation"}], "paper_keywords": ["Communication architecture performance", " communication architecture power estimation", " digital systems", " high-level synthesis"], "paper_abstract": "On-chip communication architectures have a significant impact on the power consumption and performance of emerging chip multiprocessor (CMP) applications. However, customization of such architectures for an application requires the exploration of a large design space. Designers need tools to rapidly explore and evaluate relevant communication architecture configurations exhibiting diverse power and performance characteristics. In this paper, we present an automated framework for fast system-level, application-specific, power-performance tradeoffs in a bus matrix communication architecture synthesis (CAPPS). Our study makes two specific contributions. First, we develop energy models for system-level exploration of bus matrix communication architectures. Second, we incorporate these models into a bus matrix synthesis flow that enables designers to efficiently explore the power-performance design space of different bus matrix configurations. Experimental results show that our energy macromodels incur less than 5% average cycle energy error across 180-65 nm technology libraries. Our early system-level power estimation approach also shows a significant speedup ranging from 1000 to 2000 when compared with detailed gate-level power estimation. Furthermore, on applying our synthesis framework to three industrial networking CMP applications, a tradeoff space that exhibits up to 20% variation in power and up to 40% variation in performance is generated, demonstrating the usefulness of our approach.", "paper_title": "CAPPS: A Framework for Power-Performance Tradeoffs in Bus-Matrix-Based On-Chip Communication Architecture Synthesis", "paper_id": "WOS:000273774700005"}