{"auto_keywords": [{"score": 0.03742160548515537, "phrase": "indirect_terminology"}, {"score": 0.02322730111336099, "phrase": "drug_indications"}, {"score": 0.01785118463310436, "phrase": "direct_approach"}, {"score": 0.00639588366517425, "phrase": "mean_number"}, {"score": 0.005973896176586519, "phrase": "based_approach"}, {"score": 0.004550606513996916, "phrase": "korea"}, {"score": 0.004470141828110505, "phrase": "private_institution"}, {"score": 0.004404188306112211, "phrase": "different_mapping_approach"}, {"score": 0.004275173711009189, "phrase": "good_opportunity"}, {"score": 0.0040163635646888645, "phrase": "direct_mapping_approach_and_an_indirect_terminology_based_mapping_approach"}, {"score": 0.0037619540348087493, "phrase": "listed_cardiovascular_drugs"}, {"score": 0.003630019267740951, "phrase": "free_text_indications"}, {"score": 0.0034304883989739804, "phrase": "korean_standard_terminology"}, {"score": 0.0031939996970411027, "phrase": "gold_standard"}, {"score": 0.003165605014237376, "phrase": "kappa_statistic"}, {"score": 0.0030819219279832224, "phrase": "mapping_approaches"}, {"score": 0.0030273620861817055, "phrase": "fl_score"}, {"score": 0.003000444353938951, "phrase": "mapping_approach"}, {"score": 0.002938560664857691, "phrase": "paired_t-test"}, {"score": 0.002852356597632014, "phrase": "study_drugs"}, {"score": 0.002639845784408318, "phrase": "mapping_results"}, {"score": 0.0025169965861573185, "phrase": "higher_recall"}, {"score": 0.0022745508619577927, "phrase": "fl_scores"}, {"score": 0.002188136252410142, "phrase": "icd-b"}, {"score": 0.0021049977753042253, "phrase": "better_results"}], "paper_keywords": ["Drug indication database", " semantic mapping", " International Classification of Diseases (ICD)"], "paper_abstract": "Background: Mapping of drug indications to ICD-10 was undertaken in Korea by a public and a private institution for their own purposes. A different mapping approach was used by each institution, which presented a good opportunity to compare the validity of the two approaches. Objectives: This study was undertaken to compare the validity of a direct mapping approach and an indirect terminology based mapping approach of drug indications against the gold standard drawn from the results of the two mapping processes. Methods: Three hundred and seventy-five cardiovascular reference drugs were selected from all listed cardiovascular drugs for the study. In the direct approach, two experienced nurse coders mapped the free text indications directly to ICD-10. In the indirect terminology based approach, the indications were extracted and coded in the Korean Standard Terminology of Medicine. These terminology coded indications were then manually mapped to ICD-10. The results of the two approaches were compared to the gold standard. A kappa statistic was calculated to see the compatibility of both mapping approaches. Recall, precision and Fl score of each mapping approach were calculated and analyzed using a paired t-test. Results: The mean number of indications for the study drugs was 5.42. The mean number of ICD-10 codes that matched in direct approach was 46.32 and that of indirect terminology based approach was 56.94. The agreement of the mapping results between the two approaches were poor (kappa = 0.19). The indirect terminology based approach showed higher recall (86.78%) than direct approach (p <0.001). However, there was no difference in precision and Fl score between the two approaches. Conclusions: Considering no differences in the Fl scores, both approaches may be used in practice for mapping drug indications to ICD-b. However, in terms of consistency, time and manpower, better results are expected from the indirect terminology based approach.", "paper_title": "Comparison of Validity of Mapping between Drug Indications and ICD-10 Direct and Indirect Terminology Based Approaches", "paper_id": "WOS:000336353400007"}