{"auto_keywords": [{"score": 0.03829774481898932, "phrase": "collaboration_technology"}, {"score": 0.00481495049065317, "phrase": "sustained_collaboration_support"}, {"score": 0.0044967055264893184, "phrase": "collaboration_technologies"}, {"score": 0.004420472010542188, "phrase": "group_support_systems"}, {"score": 0.004271843728776305, "phrase": "substantial_improvements"}, {"score": 0.004058210065351046, "phrase": "gss"}, {"score": 0.0038551626276406175, "phrase": "self-sustaining_communities"}, {"score": 0.0031754329320561317, "phrase": "work_process"}, {"score": 0.0022802596433757565, "phrase": "associated_roles"}, {"score": 0.0021413855297794946, "phrase": "task_allocation_patterns"}, {"score": 0.0021049977753042253, "phrase": "sustained_use"}], "paper_keywords": ["collaboration engineering", " collaboration support", " facilitation", " group support systems", " group work"], "paper_abstract": "Research shows that under certain conditions, groups using collaboration technologies such as group support systems (GSS) can gain substantial improvements in the effectiveness and efficiency of their work processes. GSS, however, have been slow to develop self-sustaining communities of users in the workplace. Organizations that use collaboration technology may require two kinds of support: process support and technology support. Both types of support involve (1) design tasks (e.g., designing a work process and designing the technology to support the process), (2) application tasks (to apply the process and to use the technology), and (3) management tasks (to monitor and control the process and to oversee the maintenance of the technology). This paper explores how these tasks and associated roles can be anchored in organizations, and the relationship of task allocation patterns to the sustained use of collaboration technology in organizations.", "paper_title": "Facilitation Roles and Responsibilities for Sustained Collaboration Support in Organizations", "paper_id": "WOS:000303603900007"}