{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "chinese_remainder_theorem"}, {"score": 0.004699598551350839, "phrase": "ss"}, {"score": 0.003775803846431323, "phrase": "verifiable_secret_sharing_scheme"}, {"score": 0.00303319936111073, "phrase": "chinese_remainder_theorem-based_vss_scheme"}, {"score": 0.0028890603352364273, "phrase": "simple_extension"}, {"score": 0.002861062731782219, "phrase": "azimuth-bloom"}, {"score": 0.002672524204918525, "phrase": "vss"}, {"score": 0.002570385604065795, "phrase": "linear_combination"}, {"score": 0.0025085435314540837, "phrase": "verification_secret"}, {"score": 0.0021780349459687622, "phrase": "secret_reconstruction"}, {"score": 0.0021049977753042253, "phrase": "john_wiley"}], "paper_keywords": ["Chinese remainder theorem", " secret sharing scheme", " verifiable secret sharing", " t-threshold consistency"], "paper_abstract": "A (t,n) secret sharing scheme (SS) enables a dealer to divide a secret into n shares in such a way that (i) the secret can be recovered successfully with t or more than t shares, and (ii) the secret cannot be recovered with fewer than t shares. A verifiable secret sharing scheme (VSS) has been proposed to allow shareholders to verify that their shares are generated by the dealer consistently without compromising the secrecy of both shares and the secret. So far, there is only one secure Chinese remainder theorem-based VSS using the RSA assumption. We propose a Chinese remainder theorem-based VSS scheme without making any computational assumptions, which is a simple extension of Azimuth-Bloom (t,n) SS. Just like the most well-known Shamir's SS, the proposed VSS is unconditionally secure. We use a linear combination of both the secret and the verification secret to protect the secrecy of both the secret and shares in the verification. In addition, we show that no information is leaked when there are fewer than t shares in the secret reconstruction. Copyright (c) 2013 John Wiley & Sons, Ltd.", "paper_title": "Verifiable secret sharing based on the Chinese remainder theorem", "paper_id": "WOS:000337516100002"}