{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "\"_adaptive_e-learning"}, {"score": 0.003678414118674967, "phrase": "quite_a_rich_and_detailed_user_profile"}, {"score": 0.003541923233726252, "phrase": "learning_activities"}, {"score": 0.0032223742018434856, "phrase": "user_exigencies"}, {"score": 0.00297346171320082, "phrase": "learning_objects"}, {"score": 0.002555761854502478, "phrase": "large_variety"}, {"score": 0.0025316905609748135, "phrase": "learning_contexts"}, {"score": 0.002358220053411644, "phrase": "xml_technology"}, {"score": 0.0022706045233150795, "phrase": "e-learning_activities"}], "paper_keywords": ["e-learning", " multi-agent system", " XML", " user profile", " device adaptivity"], "paper_abstract": "In this paper we present X-Learn, an XML-based, multi-agent system for supporting \"user-device\" adaptive e-learning, i.e. e-learning activities which take into account the profile, past behaviour, preferences and needs of users, as well as the characteristics of the devices they use for these activities. X-Learn is characterized by the following features: (i) it is highly subjective, since it handles quite a rich and detailed user profile that plays a key role during the learning activities; (ii) it is dynamic and flexible, i.e. it is capable of reacting to variations in user exigencies and objectives; (iii) it is device-adaptive, since it decides the learning objects to present to the user on the basis of the device he is currently using; (iv) it is generic, i.e. it is capable of operating in a large variety of learning contexts; (v) it is XML based, since it exploits many facilities of XML technology for handling and exchanging information related to e-learning activities. The paper also reports various experimental results, as well as a comparison between X-Learn and other related e-learning management systems already presented in the literature. (C) 2006 Elsevier Inc. All rights reserved.", "paper_title": "Personalizing learning programs with X-Learn, an XML-based, \"user-device\" adaptive multi-agent system", "paper_id": "WOS:000244809000001"}