{"auto_keywords": [{"score": 0.008713768692145013, "phrase": "institutional_repositories"}, {"score": 0.008543887849624834, "phrase": "webometric_indicators"}, {"score": 0.00805370058404277, "phrase": "improvement_effect"}, {"score": 0.007712057039266759, "phrase": "web_presence"}, {"score": 0.007355950878348032, "phrase": "cas"}, {"score": 0.005238573333496313, "phrase": "google"}, {"score": 0.0045557020703954005, "phrase": "webometrics"}, {"score": 0.004014135205423942, "phrase": "study_samples"}, {"score": 0.003694237462769815, "phrase": "pdf"}, {"score": 0.003372658906684677, "phrase": "oa_group"}, {"score": 0.0033328427701162337, "phrase": "non-oa_group"}, {"score": 0.003140680985599885, "phrase": "browse_counts"}, {"score": 0.003115908199991072, "phrase": "download_counts"}, {"score": 0.003042752533935891, "phrase": "study_show"}, {"score": 0.0029362173680378624, "phrase": "relatively_significant_positive_improvement"}, {"score": 0.002844650264042128, "phrase": "scholar"}, {"score": 0.0025059724686541263, "phrase": "url_mention_counts"}, {"score": 0.002447101794397243, "phrase": "link_counts"}, {"score": 0.0023334673218688437, "phrase": "google_pdf_counts"}, {"score": 0.00212175050242788, "phrase": "oa_irs"}], "paper_keywords": ["Webometrics", " Institutional repositories", " Open access", " Web presence", " Web visibility", " Web indicators", " China"], "paper_abstract": "Starting from the perspective of Webometrics, this paper explores the improvement effect of institutional repositories (IRs) on their home institutions with respect to web presence and visibility. Taking 19 IRs from institutions affiliated to the Chinese Academy of Sciences (CAS) as study samples, we calculate the contribution of IRs to the webometric indicators of their home institutions in terms of four indicators: page counts, PDF counts, URL mention counts, and link counts. According to their open-access (OA) status, the IRs of CAS were divided into an OA group and a non-OA group, which were compared with respect to differences in the above indicators as well as browse counts and download counts. The results of the study show that: (1) IRs showed a relatively significant positive improvement with respect to Google page counts, Scholar page counts, and Google PDF counts, although the improvement effect with respect to Scholar PDF counts was almost nonexistent; (2) repositories presented a certain improvement effect with respect to URL mention counts, but the contribution of link counts was limited; and (3) OA repositories manifested noticeable advantages in terms of Google PDF counts, URL mention counts, and download counts. We conclude that IRs can improve the web presence and visibility of their home institutions, while OA IRs offer more benefits to their home institutions.", "paper_title": "Contribution of the institutional repositories of the Chinese Academy of Sciences to the webometric indicators of their home institutions", "paper_id": "WOS:000365130100028"}