{"auto_keywords": [{"score": 0.04243918585673839, "phrase": "supply_voltage"}, {"score": 0.013126547608260531, "phrase": "clock_frequency"}, {"score": 0.00481495049065317, "phrase": "excessively_high_temperature"}, {"score": 0.004681971826924847, "phrase": "circuit_malfunction"}, {"score": 0.004426882270402403, "phrase": "system_reliability"}, {"score": 0.003976011023179683, "phrase": "system"}, {"score": 0.003672427620845944, "phrase": "oscillation_frequency"}, {"score": 0.0036213041338584756, "phrase": "ring_oscillator"}, {"score": 0.0034238045290210534, "phrase": "good_on-chip_temperature"}, {"score": 0.003329117824699891, "phrase": "dynamic_voltage-to-frequency"}, {"score": 0.0031036643805367487, "phrase": "oscillation_frequencies"}, {"score": 0.0030604342671868836, "phrase": "ring_oscillators"}, {"score": 0.0030180562635018704, "phrase": "soc"}, {"score": 0.0029757667083164627, "phrase": "thermal_sensing"}, {"score": 0.002684819249720834, "phrase": "thermal_sensors"}, {"score": 0.0026598200370569433, "phrase": "experimental_results"}, {"score": 0.00263505298504827, "phrase": "soc_benchmark_circuits"}, {"score": 0.002185301851004467, "phrase": "chip_temperature"}, {"score": 0.0021049977753042253, "phrase": "reduced_power_consumption"}], "paper_keywords": ["DVFS", " measurement and simulation of multiple-processor (multicores, MPSoC) systems", " real-time distributed systems", " reliability", " thermal effect control scheme"], "paper_abstract": "The excessively high temperature in a chip may cause circuit malfunction and performance degradation, and thus should be avoided to improve system reliability. In this paper, a novel oscillation-based on-chip thermal sensing architecture for dynamically adjusting supply voltage and clock frequency in System-on-a-Chip (SoC) is proposed. It is shown that the oscillation frequency of a ring oscillator reduces linearly as the temperature rises, and thus provides a good on-chip temperature sensing mechanism. An efficient Dynamic Voltage-to-Frequency Scaling (DF2VS) algorithm is proposed to dynamically adjust supply voltage according to the oscillation frequencies of the ring oscillators distributed in SoC so that thermal sensing can be carried at all potential hot spots. An on-chip Dynamic Voltage Scaling or Dynamic Voltage and Frequency Scaling (DVS or DVFS) monitor selects the supply voltage level and clock frequency according to the outputs of all thermal sensors. Experimental results on SoC benchmark circuits show the effectiveness of the algorithm that a 10% reduction in supply voltage alone can achieve about 20% power reduction (DVS scheme), and nearly 50% reduction in power is achievable if the clock frequency is also scaled down (DVFS scheme). The chip temperature will be significant lower due to the reduced power consumption.", "paper_title": "An Oscillation-Based On-Chip Temperature-Aware Dynamic Voltage and Frequency Scaling Scheme in System-on-a-Chip", "paper_id": "WOS:000342784600014"}