{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "parity_problem"}, {"score": 0.013913355059912952, "phrase": "initial_configuration"}, {"score": 0.009062149944404286, "phrase": "prime-sized_lattices"}, {"score": 0.004775531918452571, "phrase": "one-dimensional_cellular_automata"}, {"score": 0.004640079189342692, "phrase": "well-known_benchmark_task"}, {"score": 0.004545675105321216, "phrase": "computer_science"}, {"score": 0.004204054047427536, "phrase": "odd_number"}, {"score": 0.0037312893857519803, "phrase": "even-sized_lattices"}, {"score": 0.0034083145672246067, "phrase": "odd-sized_lattices"}, {"score": 0.003284361433827464, "phrase": "minimal_neighbourhood_size"}, {"score": 0.0031518989079229714, "phrase": "arbitrary_initial_configuration"}, {"score": 0.0027856252557826467, "phrase": "simpler_case"}, {"score": 0.0024017007954518065, "phrase": "open_problem"}, {"score": 0.0023430556582539805, "phrase": "recent_data"}, {"score": 0.0022484715639779153, "phrase": "strong_empirical_evidence"}, {"score": 0.0021049977753042253, "phrase": "recent_conjecture"}], "paper_keywords": ["Elementary cellular automata", " Emergent computation", " Parity problem", " Density classification", " De Bruijn graphs"], "paper_abstract": "The parity problem is a well-known benchmark task in various areas of computer science. Here we consider its version for one-dimensional, binary cellular automata, with periodic boundary conditions: if the initial configuration contains an odd number of 1s, the lattice should converge to all 1s; otherwise, it should converge to all 0s. Since the problem is ill-defined for even-sized lattices (which, by definition, would never be able to converge to 1), it suffices to account for odd-sized lattices only. We are interested in determining the minimal neighbourhood size that allows the problem to be solvable for any arbitrary initial configuration. On the one hand, we show that radius 2 is not sufficient, proving that there exists no radius 2 rule that can solve the parity problem, even in the simpler case of prime-sized lattices. On the other hand, we design a radius 4 rule that converges correctly for any initial configuration and formally prove its correctness. Whether or not there exists a radius 3 rule that solves the parity problem remains an open problem; however, we review recent data against a solution in radius 3, thus providing strong empirical evidence that there may not exist a radius 3 solution even for prime-sized lattices only, contrary to a recent conjecture in the literature.", "paper_title": "Solving the parity problem in one-dimensional cellular automata", "paper_id": "WOS:000323331400003"}