{"auto_keywords": [{"score": 0.024134772656611854, "phrase": "operational_scenarios"}, {"score": 0.00481495049065317, "phrase": "effective_techniques"}, {"score": 0.004768378525561471, "phrase": "requirements_definition"}, {"score": 0.004326624385772596, "phrase": "declarative_goals"}, {"score": 0.00386876598761639, "phrase": "operational_examples"}, {"score": 0.003831310632470526, "phrase": "system_usage"}, {"score": 0.002917331114260319, "phrase": "effective_graphical_animations"}, {"score": 0.0025829353063908256, "phrase": "operational_description_change"}, {"score": 0.0025207920578878894, "phrase": "basic_propositions"}, {"score": 0.002436289099444074, "phrase": "graphical_animations"}, {"score": 0.0023091721866305426, "phrase": "behaviour_model"}, {"score": 0.0022101055924375725, "phrase": "goal_model"}, {"score": 0.0021049977753042253, "phrase": "goal_violation_traces"}], "paper_keywords": [""], "paper_abstract": "Scenarios and goals are effective techniques for requirements definition. Goals are objectives that a system has to meet. They are elaborated into a structure that decomposes declarative goals into goals that can be formulated in terms of events and can be controlled or monitored by the system. Scenarios are operational examples of system usage. Validation of goals and scenarios is essential in order to ensure that they represent what stakeholders actually want. Rather than validating scenarios and goals separately, possibly driving the elaboration of one through the validation of another, this paper exploits the relationship between goals and scenarios. The aim is to provide effective graphical animations as a means of supporting such a validation. The relation between scenarios and goals is established by means of fluents that describe how events of the operational description change the state of the basic propositions from which goals are expressed. Graphical animations are specified in terms of fluents and driven by a behaviour model synthesised from the operational scenarios. In addition, goal model checking over operational scenarios is provided to guide animations through goal violation traces.", "paper_title": "Goal and scenario validation: a fluent combination", "paper_id": "WOS:000235201700003"}