{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "hamiltonian_cycle_problem"}, {"score": 0.023030903362352636, "phrase": "circular-arc_graphs"}, {"score": 0.010386624692130744, "phrase": "certifying_algorithm"}, {"score": 0.00889562848240534, "phrase": "hamiltonian_cycle"}, {"score": 0.007047873470114445, "phrase": "input_graph"}, {"score": 0.003928834302530914, "phrase": "simple_cycle"}, {"score": 0.0034953361767153285, "phrase": "best_result"}, {"score": 0.0023463495729780246, "phrase": "delta"}, {"score": 0.002315719347244451, "phrase": "maximum_degree"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Certifying algorithms", " Hamiltonian cycle", " Path cover", " Interval graphs", " Circular-arc graphs"], "paper_abstract": "A certifying algorithm for a problem is an algorithm that provides a certificate with each answer that it produces. The certificate is an evidence that can be used to authenticate the correctness of the answer. A Hamiltonian cycle in a graph is a simple cycle in which each vertex of the graph appears exactly once. The Hamiltonian cycle problem is to determine whether or not a graph contains a Hamiltonian cycle. The best result for the Hamiltonian cycle problem on circular-arc graphs is an O(n(2) log n)-time algorithm, where n is the number of vertices of the input graph. In fact, the O(n(2) log n)-time algorithm can be modified as a certifying algorithm although it was published before the term certifying algorithms appeared in the literature. However, whether there exists an algorithm whose time complexity is better than O(n(2) log n) for solving the Hamiltonian cycle problem on circular-arc graphs has been opened for two decades. In this paper, we present an O(Delta n)-time certifying algorithm to solve this problem, where Delta represents the maximum degree of the input graph. The certificates provided by our algorithm can be authenticated in O(n) time. (C) 2011 Elsevier B.V. All rights reserved.", "paper_title": "An efficient certifying algorithm for the Hamiltonian cycle problem on circular-arc graphs", "paper_id": "WOS:000294592500021"}