{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "diagrams_research"}, {"score": 0.00457696724030363, "phrase": "interdisciplinary_endeavour"}, {"score": 0.004328689762198895, "phrase": "artificial_intelligence"}, {"score": 0.004198965651975536, "phrase": "relatively_new_research_area"}, {"score": 0.004114641015648682, "phrase": "first_meeting"}, {"score": 0.004073113268289532, "phrase": "like-minded_researchers"}, {"score": 0.0025793874956029795, "phrase": "under-represented_areas"}, {"score": 0.0023183698048498797, "phrase": "particular_conference"}, {"score": 0.002226017732566121, "phrase": "on-going_discussion"}, {"score": 0.0021923400552366777, "phrase": "changing_nature"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Diagrams research", " Diagrams classifications", " Interdisciplinary research", " Literature survey"], "paper_abstract": "Research into the use of diagrams is an interdisciplinary endeavour, encompassing disciplines as diverse as psychology, architecture and artificial intelligence. It is also a relatively new research area, with the first meeting of like-minded researchers interested in studying diagrams taking place in 1997. Now that diagrams research is more established, it is timely to review its scope, nature and progress. This paper reviews diagrams research over the past twelve years, as represented in the proceedings of the International Conference on the Theory and Application of Diagrams. In summarising the contents of these proceedings, a taxonomy describing the scope of diagrams research is proposed, the several research issues covered are identified, and the extent to which layout and aesthetics form part of this body of research is discussed. In concluding, trends and under-represented areas are noted and discussed. The aim of the paper is not only to summarise the research covered in this particular conference, but to provide a basis for on-going discussion on the changing nature of diagrams research. (C) 2013 Elsevier Ltd. All rights reserved.", "paper_title": "Twelve years of diagrams research", "paper_id": "WOS:000334568900002"}