{"auto_keywords": [{"score": 0.03780999217534513, "phrase": "beacon_transmissions"}, {"score": 0.00481495049065317, "phrase": "arrival_based_joint_time_synchronization"}, {"score": 0.004745056850725867, "phrase": "mobile_underwater_systems"}, {"score": 0.004710489616113198, "phrase": "time_synchronization"}, {"score": 0.004642105253191792, "phrase": "key_requirements"}, {"score": 0.004608284537368354, "phrase": "distributed_underwater_systems"}, {"score": 0.004558012799538011, "phrase": "numerous_low-cost_submersibles"}, {"score": 0.0043147264956783565, "phrase": "acoustic_communication_capability"}, {"score": 0.00406945841245389, "phrase": "acoustic_signals"}, {"score": 0.004039792863335641, "phrase": "traditional_long_base_line"}, {"score": 0.00385214804128572, "phrase": "gps-like_infrastructure"}, {"score": 0.003754731210715724, "phrase": "known_locations"}, {"score": 0.0036731870109004993, "phrase": "unknown_positions"}, {"score": 0.0032671775301001483, "phrase": "small_lbl"}, {"score": 0.002992313172550772, "phrase": "multiple_beacons"}, {"score": 0.0028220038404484196, "phrase": "signal_arrivals"}, {"score": 0.0027911639820564897, "phrase": "key_factor"}, {"score": 0.002730493787008122, "phrase": "tdoa"}, {"score": 0.0024915167458844914, "phrase": "time_of_arrival"}, {"score": 0.002473325513637559, "phrase": "tracked_synchronization"}, {"score": 0.002265095354846931, "phrase": "two-way_communication"}, {"score": 0.0021518035978153878, "phrase": "experimentally_obtained_data"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Underwater networks", " Real-time tracking", " Acoustic networks"], "paper_abstract": "Time synchronization and localization are key requirements for distributed underwater systems consisting of numerous low-cost submersibles. In these systems, submersibles are highly resource constrained and typically have limited acoustic communication capability. We investigate the problem of tracking submersibles that only have the capability of receiving acoustic signals. Traditional Long Base Line (LBL) systems track the location of submersibles by providing a GPS-like infrastructure that consists of a few reference beacons at known locations. In these systems the unknown positions of submersibles are estimated from beacon transmissions using time-difference-of-arrival (TDoA) based localization. As such TDoA makes the key assumption that beacon transmissions occur nearly concurrently in time. While this assumption is ensured in small LBL deployments it does not hold as the size of the system scales up. In this paper we identify scenarios where signals from multiple beacons are significantly lagged in time. We further identify the motion of the submersible between signal arrivals as a key factor that deteriorates the performance of TDoA, when transmissions are not concurrent. To address this problem we propose to track the submersible while performing time-synchronization. Our proposed technique, called Time of Arrival based Tracked Synchronization (ToA-TS) essentially extends GPS like localization for scenarios where beacon transmissions are not concurrent and submersibles are not capable of two-way communication. We show the benefit of our proposed scheme by comparing its performance to other localization techniques using experimentally obtained data. (C) 2014 Elsevier B.V. All rights reserved.", "paper_title": "ToA-TS: Time of arrival based joint time synchronization and tracking for mobile underwater systems", "paper_id": "WOS:000366774800017"}