{"auto_keywords": [{"score": 0.049233068058238634, "phrase": "organizational_performance"}, {"score": 0.008164249304662408, "phrase": "organizational_knowledge_sharing"}, {"score": 0.007039897852020605, "phrase": "knowledge_sharing"}, {"score": 0.006178485695844692, "phrase": "organizational_knowledge_sharing_practices"}, {"score": 0.005552255224705661, "phrase": "positive_relationship"}, {"score": 0.00481495049065317, "phrase": "facilitating_factor"}, {"score": 0.0046739596755881185, "phrase": "human_capital"}, {"score": 0.004224627834741731, "phrase": "competitive_advantage"}, {"score": 0.003728529119516347, "phrase": "important_research_question"}, {"score": 0.0030273620861817055, "phrase": "organizational_human_capital"}, {"score": 0.0023018240563444027, "phrase": "taiwan"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["knowledge sharing", " performance", " human capital", " innovation strategy", " top management knowledge values"], "paper_abstract": "Organizational knowledge sharing, argued to be able to improve organizational performance and achieve competitive advantage, is often not induced successfully. How organizations should encourage and facilitate knowledge sharing to improve organizational performance is still an important research question. This study proposes and examines a model of organizational knowledge sharing that improves organizational performance. Organizational knowledge sharing practices are argued to be able to encourage and facilitate knowledge sharing, and are hypothesized to have a positive relationship with organizational human capital (employee competencies), which is hypothesized to have a positive relationship with organizational performance. Two organizational antecedents (innovation strategy and top management knowledge values) are hypothesized to lead to the implementation of organizational knowledge sharing practices. The hypotheses were examined with data collected from 256 companies in Taiwan. All the hypotheses are supported. This study has both theoretical and practical implications. (C) 2007 Elsevier Ltd. All rights reserved.", "paper_title": "Knowledge sharing practices as a facilitating factor for improving organizational performance through human capital: A preliminary test", "paper_id": "WOS:000257993700072"}