{"auto_keywords": [{"score": 0.0467946801397885, "phrase": "different_cofactors"}, {"score": 0.031653507648654204, "phrase": "dynamic_areas"}, {"score": 0.029903004183579943, "phrase": "static_areas"}, {"score": 0.00481495049065317, "phrase": "part-based_gait_identification"}, {"score": 0.004774937143916685, "phrase": "frequency-domain_gait_entropy_features"}, {"score": 0.0038271712887391015, "phrase": "robust_technique"}, {"score": 0.0034476484413811987, "phrase": "effective_body_parts"}, {"score": 0.003404703106153948, "phrase": "whole_body"}, {"score": 0.0033482708495261864, "phrase": "small_segments"}, {"score": 0.003265365666305185, "phrase": "single_row"}, {"score": 0.0031712256091350316, "phrase": "positive_and_negative_effect"}, {"score": 0.0027167830773160203, "phrase": "appearance_based_gait_representation"}, {"score": 0.002509284173541882, "phrase": "endft_representation"}, {"score": 0.002279144000872877, "phrase": "treadmill"}, {"score": 0.0022413233627905696, "phrase": "clothing_variations"}, {"score": 0.0022226496830385304, "phrase": "casia_gait_database"}, {"score": 0.00212268510072928, "phrase": "proposed_method"}, {"score": 0.0021049977753042253, "phrase": "better_results"}], "paper_keywords": ["Gait", " Identification", " Effective part", " EnDFT"], "paper_abstract": "Gait identification task becomes more difficult due to the change of appearance by different cofactors (e.g., shoe, surface, carrying, view, and clothing). The cofactors may affect some parts of gait while other parts remain unchanged and can be used for recognition. We propose a robust technique to define which parts are more effective and which parts are less effective for cofactors like clothing, carrying objects etc. To find out the effective body parts, the whole body is divided into small segments where each segment is a single row in this paper. Based on positive and negative effect of each segment, three most effective parts and two less effective parts are defined. Usually, the dynamic areas (e.g., legs, arms swing) are comparatively less affected than static areas (e.g., torso) for different cofactors in appearance based gait representation. To give more emphasis on dynamic areas and less on static areas, frequency-domain gait entropy termed as EnDFT representation is computed and used as gait features. Experiments are conducted on two comprehensive benchmarking databases: The OU-ISIR Gait Database, the Treadmill dataset B with clothing variations and CASIA Gait Database, Dataset B with clothing and carrying conditions. The proposed method shows better results in comparison with other existing gait recognition approaches.", "paper_title": "Effective part-based gait identification using frequency-domain gait entropy features", "paper_id": "WOS:000352742800012"}