{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "fuzzy_artmap"}, {"score": 0.004511485198940203, "phrase": "fuzzy_artmap_neural_networks"}, {"score": 0.004377921202912336, "phrase": "good_classifiers"}, {"score": 0.004269630481719451, "phrase": "classification_problems"}, {"score": 0.003407549468745519, "phrase": "coarse_grain_parallelization_technique"}, {"score": 0.0033231814056233103, "phrase": "pipeline_approach"}, {"score": 0.0032085525502105836, "phrase": "training_process"}, {"score": 0.003036333273800443, "phrase": "match-tracking_mechanism"}, {"score": 0.002902304851882577, "phrase": "associated_proofs"}, {"score": 0.0026384167183586015, "phrase": "beowulf_cluster"}, {"score": 0.0025859868507329634, "phrase": "linear_speedup"}, {"score": 0.002327310963701377, "phrase": "forrest_covertype_database"}, {"score": 0.0021049977753042253, "phrase": "different_amounts"}], "paper_keywords": ["Fuzzy ARTMAP", " data mining", " BEOWULF cluster", " pipelining", " network partitioning"], "paper_abstract": "Fuzzy ARTMAP neural networks have been proven to be good classifiers on a variety of classification problems. However, the time that Fuzzy ARTMAP takes to converge to a solution increases rapidly as the number of patterns used for training is increased. In this paper we examine the time Fuzzy ARTMAP takes to converge to a solution and we propose a coarse grain parallelization technique, based on a pipeline approach, to speed-up the training process. In particular, we have parallelized Fuzzy ARTMAP without the match-tracking mechanism. We provide a series of theorems and associated proofs that show the characteristics of Fuzzy ARTMAP's, without matchtracking, parallel implementation. Results run on a BEOWULF cluster with three large databases show linear speedup as a function of the number of processors used in the pipeline. The databases used for our experiments are the Forrest CoverType database from the UCI Machine Learning repository and two artificial databases, where the data generated were 16-dimensional Gaussian distributed data belonging to two distinct classes, with different amounts of overlap (5% and 15%). (c) 2006 Elsevier Ltd. All rights reserved.", "paper_title": "Pipelining of Fuzzy ARTMAP without matchtracking: Correctness, performance bound, and Beowulf evaluation", "paper_id": "WOS:000243841900009"}