{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "network_partitions"}, {"score": 0.01053161194671422, "phrase": "structured_overlay_networks"}, {"score": 0.004687159050154687, "phrase": "major_class"}, {"score": 0.004651271219032404, "phrase": "peer-to-peer_systems"}, {"score": 0.004323690117778359, "phrase": "long-lived_internet-scale"}, {"score": 0.003942544019605881, "phrase": "large-scale_systems"}, {"score": 0.0037792227071149985, "phrase": "structured_peer-to-peer_systems"}, {"score": 0.0035263833746562788, "phrase": "side_effect"}, {"score": 0.0033672608231654897, "phrase": "massive_node_failures"}, {"score": 0.0033030907500120397, "phrase": "crucial_aspect"}, {"score": 0.0032777653153451265, "phrase": "network_mergers"}, {"score": 0.0031178024467857215, "phrase": "ring-based_structured_overlay_networks"}, {"score": 0.0030232568024943455, "phrase": "structured_overlays"}, {"score": 0.002788454815865172, "phrase": "multiple_similar_ring-based_overlays"}, {"score": 0.002662541169311738, "phrase": "dynamic_conditions"}, {"score": 0.002121281184742656, "phrase": "message_complexity"}, {"score": 0.0021049977753042253, "phrase": "time_complexity"}], "paper_keywords": ["DHTs", " Network partitions", " Network mergers", " Structured overlay networks", " Loopy rings", " Distributed hash tables"], "paper_abstract": "Structured overlay networks form a major class of peer-to-peer systems, which are touted for their abilities to scale, tolerate failures, and self-manage. Any long-lived Internet-scale distributed system is destined to face network partitions. Although the problem of network partitions and mergers is highly related to fault-tolerance and self-management in large-scale systems, it has hardly been studied in the context of structured peer-to-peer systems. These systems have mainly been studied under churn (frequent joins/failures), which as a side effect solves the problem of network partitions, as it is similar to massive node failures. Yet, the crucial aspect of network mergers has been ignored. In fact, it has been claimed that ring-based structured overlay networks, which constitute the majority of the structured overlays, are intrinsically ill-suited for merging rings. In this paper, we present an algorithm for merging multiple similar ring-based overlays when the underlying network merges. We examine the solution in dynamic conditions, showing how our solution is resilient to churn during the merger, something widely believed to be difficult or impossible. We evaluate the algorithm for various scenarios and show that even when falsely detecting a merger, the algorithm quickly terminates and does not clutter the network with many messages. The algorithm is flexible as the tradeoff between message complexity and time complexity can be adjusted by a parameter.", "paper_title": "Dealing with network partitions in structured overlay networks", "paper_id": "WOS:000284092500005"}