{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "sensor_networks"}, {"score": 0.004598933498016774, "phrase": "catastrophic_events"}, {"score": 0.004522796947899013, "phrase": "large_number"}, {"score": 0.004429388453288922, "phrase": "geographic_area"}, {"score": 0.004160531596936783, "phrase": "bridged_fragments"}, {"score": 0.00390792986752692, "phrase": "bridge_nodes"}, {"score": 0.0036400696415545813, "phrase": "bridge_protection_algorithm"}, {"score": 0.003418958653159371, "phrase": "catastrophic_event"}, {"score": 0.003292770855568091, "phrase": "topologically_important_nodes"}, {"score": 0.0028091907694771613, "phrase": "additional_bridge_nodes"}, {"score": 0.0025730425700096365, "phrase": "critical_areas"}, {"score": 0.002498812056838983, "phrase": "bpa_algorithm"}, {"score": 0.002436888552432559, "phrase": "geographic_information"}, {"score": 0.0023566987138026285, "phrase": "shortest_path"}, {"score": 0.00231759652007697, "phrase": "routing_model"}, {"score": 0.0022507188208913394, "phrase": "relational_neighborhood_graph"}, {"score": 0.0021857667493036786, "phrase": "expected_connected_lifetime"}, {"score": 0.0021050078070343043, "phrase": "elsevier"}], "paper_keywords": ["Sensor network", " Fault tolerance", " Bridge protection"], "paper_abstract": "Sensor networks operating in the field might be subject to catastrophic events which destroy a large number of nodes in the geographic area. Often, the aftermath of such an event is the creation of a network of bridged fragments where connectivity is maintained by one or several bridge nodes. These networks are vulnerable, because the bridge nodes will soon exhaust their energy resources leading to the fragmentation of the network. This paper describes a bridge protection algorithm (BPA), a combination of techniques which, in response to a catastrophic event, change the behavior of a set of topologically important nodes in the network. These techniques protect the bridge node by letting some nodes take over some of the responsibilities of the sink. At the same time, they relieve some other overwhelmed nodes and prevent the apparition of additional bridge nodes. To achieve this, the algorithm sacrifices the length of some routes in order to distribute routes away from critical areas. In a variation on the BPA algorithm, we show that if geographic information about the nodes is available, replacing shortest path routing with a routing model which follows the edges of the relational neighborhood graph will lead to further improvements in the expected connected lifetime of the network. (C) 2014 Elsevier BM. All rights reserved.", "paper_title": "Bridge protection algorithms - A technique for fault-tolerance in sensor networks", "paper_id": "WOS:000347581200014"}