{"auto_keywords": [{"score": 0.03972278524435738, "phrase": "green's_function"}, {"score": 0.022567683950850684, "phrase": "imaginary_component"}, {"score": 0.014208627805702064, "phrase": "field_fluctuations"}, {"score": 0.008713768692145013, "phrase": "backscattered_waves"}, {"score": 0.004748371393578422, "phrase": "generalized_energy_theorem"}, {"score": 0.0044495843279816075, "phrase": "wave_propagation"}, {"score": 0.004169519409162853, "phrase": "energy_flow"}, {"score": 0.0030398432591176357, "phrase": "backscattered_fields"}, {"score": 0.002956209594959227, "phrase": "general_linear_systems"}, {"score": 0.002607362103727335, "phrase": "generalized_energy"}, {"score": 0.0023210846870653757, "phrase": "scalar_waves"}, {"score": 0.0022571810910697013, "phrase": "generalized_optical_theorem"}, {"score": 0.0021246816854197732, "phrase": "acoustic_waves"}, {"score": 0.0021049977753042253, "phrase": "quantum_mechanics"}], "paper_keywords": ["Green's function extraction", " interferometry", " scattering", " diffusion", " imaging", " optical theorem"], "paper_abstract": "We show the connection between four aspects of wave propagation: the autocorrelation of field fluctuations, imaging with backscattered waves, a theorem for energy flow, and the generalized optical theorem. The autocorrelation of field fluctuations can be used to extract the imaginary component of the Green's function at the source. The Green's function usually is singular at the source, but the imaginary component is not. The imaginary component of the Green's function at the source can thus be retrieved from the autocorrelation of field fluctuations, and can be used to image the medium using backscattered fields. We also show for general linear systems, which may be open or closed and may be dissipative, that the imaginary component of the Green's function at the source accounts for the loss of generalized energy by dissipation and/or propagation of the fields away from the source. Finally we show that the expressions for the extraction of the Green's function for scalar waves has the same mathematical structure as the generalized optical theorem. The theory presented here is shown to be applicable to damped acoustic waves, quantum mechanics, and diffusion.", "paper_title": "Field Fluctuations, Imaging with Backscattered Waves, a Generalized Energy Theorem, and the Optical Theorem", "paper_id": "WOS:000278101100017"}