{"auto_keywords": [{"score": 0.048839643896770986, "phrase": "spatio-temporal_information"}, {"score": 0.038115196221187, "phrase": "line_simplification"}, {"score": 0.036229190503611196, "phrase": "distance_function"}, {"score": 0.035620716932052585, "phrase": "trajectory_approximation"}, {"score": 0.00481495049065317, "phrase": "deterministic_error_bounds"}, {"score": 0.004752221133109136, "phrase": "common_way"}, {"score": 0.00433531459712787, "phrase": "cellular_phones"}, {"score": 0.004297560964892607, "phrase": "personal_digital_assistants"}, {"score": 0.004042295865725559, "phrase": "efficient_processing"}, {"score": 0.0038692638652494697, "phrase": "computer_graphics"}, {"score": 0.0037198532511087566, "phrase": "approximation_technique"}, {"score": 0.0031775430407770026, "phrase": "namely_the_error"}, {"score": 0.003108735847242537, "phrase": "spatio-temporal_queries"}, {"score": 0.0026552818091968543, "phrase": "common_spatio-temporal_query_types"}, {"score": 0.0025414699652861667, "phrase": "aging_mechanism"}, {"score": 0.0023487324083283205, "phrase": "existing_linguistic_constructs"}, {"score": 0.0021049977753042253, "phrase": "trajectories_database"}], "paper_keywords": ["data reduction", " line simplification", " uncertainty", " moving objects database"], "paper_abstract": "A common way of storing spatio-temporal information about mobile devices is in the form of a 3D (2D geography + time) trajectory. We argue that when cellular phones and Personal Digital Assistants become location-aware, the size of the spatio-temporal information generated may prohibit efficient processing. We propose to adopt a technique studied in computer graphics, namely line-simplification, as an approximation technique to solve this problem. Line simplification will reduce the size of the trajectories. Line simplification uses a distance function in producing the trajectory approximation. We postulate the desiderata for such a distance-function: it should be sound, namely the error of the answers to spatio-temporal queries must be bounded. We analyze several distance functions, and prove that some are sound in this sense for some types of queries, while others are not. A distance function that is sound for all common spatio-temporal query types is introduced and analyzed. Then we propose an aging mechanism which gradually shrinks the size of the trajectories as time progresses. We also propose to adopt existing linguistic constructs to manage the uncertainty introduced by the trajectory approximation. Finally, we analyze experimentally the effectiveness of line-simplification in reducing the size of a trajectories database.", "paper_title": "Spatio-temporal data reduction with deterministic error bounds", "paper_id": "WOS:000238525500002"}