{"auto_keywords": [{"score": 0.04274518365190484, "phrase": "dynamic_reconfiguration"}, {"score": 0.012421384716028864, "phrase": "wireless_computing_systems"}, {"score": 0.0047563776685277314, "phrase": "wireless_computing_system"}, {"score": 0.00461302961851157, "phrase": "changeable_requirements"}, {"score": 0.004392565073466714, "phrase": "coming_wireless_computing"}, {"score": 0.003982617095636925, "phrase": "necessary_technique"}, {"score": 0.003769006950727621, "phrase": "system_components"}, {"score": 0.0036553070575015344, "phrase": "based_wireless_computing_system"}, {"score": 0.0030789331635764122, "phrase": "new_environment"}, {"score": 0.002690406375639144, "phrase": "crucial_problems"}, {"score": 0.0025148871904409095, "phrase": "efficient_management"}, {"score": 0.0023507916951658455, "phrase": "efficient_method"}, {"score": 0.0023079225317714815, "phrase": "dynamic_component_reconfiguration"}, {"score": 0.002265833357217618, "phrase": "dependency_relations"}, {"score": 0.002183938718432764, "phrase": "performance_analysis"}, {"score": 0.0021049977753042253, "phrase": "execution_time"}], "paper_keywords": [""], "paper_abstract": "Wireless computing system has to satisfy the changeable requirements of various users and environments. Therefore the coming wireless computing requires systems to be more available, flexible and adaptable. Dynamic reconfiguration certainly became the necessary technique because it provides adaptability and flexibility by reconstructing system components. Dynamic reconfiguration of component based wireless computing system consists of modifying the configuration of components of a system during runtime. As system can execute dynamic reconfiguration, system can have ability to easily adapt to new environment and to be more easily extensible. Therefore, the development of dynamic reconfiguration is essential for wireless computing systems. But dynamic reconfiguration has crucial problems, performance, QoS and fault tolerance. We need efficient management for dynamic reconfiguration to solve these problems. We propose an efficient method to manage dynamic component reconfiguration using the dependency relations between components for wireless computing systems. Performance analysis shows that our scheme can reduce execution time and down-time by considering dependency between components.", "paper_title": "Dependency-based dynamic component reconfiguration for wireless computing systems", "paper_id": "WOS:000240084000037"}