{"auto_keywords": [{"score": 0.04658008825855549, "phrase": "robotic_aids"}, {"score": 0.015719716506582524, "phrase": "home_environments"}, {"score": 0.004765482708043842, "phrase": "portable_assistive_robot"}, {"score": 0.004716520738331953, "phrase": "disabled_and_elderly_people"}, {"score": 0.004342430078306461, "phrase": "permanent_nurse"}, {"score": 0.004312622975366676, "phrase": "family_assistant_supervision"}, {"score": 0.004152288616186981, "phrase": "daily_life_activities"}, {"score": 0.0037704502704526996, "phrase": "common_tasks"}, {"score": 0.003667925754747227, "phrase": "partial_or_complete_autonomy"}, {"score": 0.0035681790580031998, "phrase": "system's_usability"}, {"score": 0.0035072146967082083, "phrase": "developed_portable_assistive_robot_asibot"}, {"score": 0.0034000828197314264, "phrase": "common_living_environments"}, {"score": 0.0033767221949228834, "phrase": "minimum_adaptations"}, {"score": 0.00307657476125683, "phrase": "best_place"}, {"score": 0.0027551040319267446, "phrase": "asibot"}, {"score": 0.002707993764473537, "phrase": "rehabilitation_robotics"}, {"score": 0.0026616868981501006, "phrase": "brief_description"}, {"score": 0.0026342827320931937, "phrase": "asibot_system"}, {"score": 0.00227890329511847, "phrase": "test_bed"}, {"score": 0.0021416404045850224, "phrase": "kitchen_environment"}, {"score": 0.0021049977753042253, "phrase": "relevant_conclusions"}], "paper_keywords": ["Climbing robots", " clinical trials", " homecare", " inclusive technologies", " portable robots", " rehabilitation robotics"], "paper_abstract": "Increasingly disabled and elderly people with mobility problems want to live autonomously in their home environment. They are motivated to use robotic aids to perform tasks by themselves, avoiding permanent nurse or family assistant supervision. They must find means to rehabilitate their abilities to perform daily life activities (DLAs), such as eating, shaving, or drinking. These means may be provided by robotic aids that incorporate possibilities and methods to accomplish common tasks, aiding the user in recovery of partial or complete autonomy. Results are highly conditioned by the system's usability and potential. The developed portable assistive robot ASIBOT helps users perform most of these tasks in common living environments. Minimum adaptations are needed to provide the robot with mobility throughout the environment. The robot can autonomously climb from one surface to another, fixing itself to the best place to perform each task. When the robot is attached to its wheelchair, it can move along with it as a bundle. This paper presents the work performed with the ASIBOT in the area of rehabilitation robotics. First, a brief description of the ASIBOT system is given. A description of tests that have been performed with the robot and several impaired users is given. Insight into how these experiences have influenced our research efforts, especially, in home environments, is also included. A description of the test bed that has been developed to continue research on performing DLAs by the use of robotic aids, a kitchen environment, is given. Relevant conclusions are also included.", "paper_title": "Personal Autonomy Rehabilitation in Home Environments by a Portable Assistive Robot", "paper_id": "WOS:000305584800010"}