{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "agent_organizations"}, {"score": 0.008106697304425672, "phrase": "adaptation_deliberation"}, {"score": 0.004768649568826951, "phrase": "multiagent_technologies"}, {"score": 0.004413846562278824, "phrase": "dynamic_and_distributed_environments"}, {"score": 0.0041051328120736575, "phrase": "necessary_condition"}, {"score": 0.004046020290832207, "phrase": "adaptation_ability"}, {"score": 0.003911367220315185, "phrase": "significant_changes"}, {"score": 0.0036026484429137998, "phrase": "adaptation_requirements"}, {"score": 0.0035507457285983268, "phrase": "run_time"}, {"score": 0.003399466007862412, "phrase": "adaptation_framework"}, {"score": 0.003270396852243212, "phrase": "event-tracing-based_monitoring_mechanism"}, {"score": 0.0030121159909273897, "phrase": "adaptation_process"}, {"score": 0.0026687841359431105, "phrase": "dynamic_specification"}, {"score": 0.0023990982005125763, "phrase": "useless_information"}, {"score": 0.002177600561610171, "phrase": "agent_organization"}, {"score": 0.0021049977753042253, "phrase": "market_scenario"}], "paper_keywords": ["Monitoring", " Organization", " Adaptation", " Events"], "paper_abstract": "Multiagent technologies are usually considered to be suitable for constructing agent organizations that are capable of running in dynamic and distributed environments and that are able to adapt to changes as the system runs. The necessary condition for this adaptation ability is to make agents aware of significant changes in both the environment and the organization. This paper presents mechanism, which helps agents detecting adaptation requirements dynamically at run time, and an Trace&Trigger, which is an adaptation framework for agent organizations. It consists of an event-tracing-based monitoring mechanism that provides organizational agents with information related to the costs and benefits of carrying out an adaptation process at each moment of the execution. This framework intends to overcome some of the problems that are present in other approaches by allowing the dynamic specification of the information that has to be retrieved by each agent at each moment for adaptation deliberation, avoiding the transference of useless information for adaptation deliberation. This framework has been integrated in the Magentix2 multiagent platform. In order to test its performance benefits for any agent organization, an example based on a market scenario is also presented.", "paper_title": "An adaptive framework for monitoring agent organizations", "paper_id": "WOS:000335231700006"}