{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "geovisual_analytics_environment"}, {"score": 0.04820189656526341, "phrase": "movement_data"}, {"score": 0.004356926418550194, "phrase": "empirical_usability_experiment"}, {"score": 0.004186105377259855, "phrase": "space-time_cube"}, {"score": 0.0037624955853577786, "phrase": "human_geographers"}, {"score": 0.003687960013746783, "phrase": "interactive_environment"}, {"score": 0.003614895644619489, "phrase": "multiple_coordinated_views"}, {"score": 0.0027131212233443137, "phrase": "usability_metrics"}, {"score": 0.002572001496778222, "phrase": "user_satisfaction"}, {"score": 0.002537880772794665, "phrase": "developed_application"}, {"score": 0.002389839896897424, "phrase": "domain_experts"}, {"score": 0.0022959641308689612, "phrase": "visual_analytical_environment"}, {"score": 0.0021049977753042253, "phrase": "user_feedback"}], "paper_keywords": ["space-time cube", " usability evaluation", " GeoVisual analytics"], "paper_abstract": "This paper reports the results of an empirical usability experiment on the performance of the space-time cube in a GeoVisual analytics environment. It was developed to explore movement data based on the requirements of human geographers. The interactive environment consists of multiple coordinated views incorporating three graphical representations. For the experiment, two groups of the user, domain experts and non-domain experts, had to execute several map-use tasks to answers specific question. The data collected during the experiment were analysis resulting in a set of usability metrics related to the effectiveness, efficiency and user satisfaction of developed application. The comparison of both groups showed that domain experts were able to operate the visual analytical environment more effectively and efficiently due to their interest to explore their data. The user feedback derived from the analysis of both experiments was further processed for the improvement of the application.", "paper_title": "The space-time cube as part of a GeoVisual analytics environment to support the understanding of movement data", "paper_id": "WOS:000361527500006"}