{"auto_keywords": [{"score": 0.0041840994704406866, "phrase": "isabelle_proof_assistant"}, {"score": 0.003900257249255497, "phrase": "higher-order_logic"}, {"score": 0.003675120438902734, "phrase": "instantiation_process"}, {"score": 0.003407214479510987, "phrase": "new_definitions"}, {"score": 0.0030414140732789186, "phrase": "proof_obligations"}, {"score": 0.0026423134393535265, "phrase": "ac_variations"}, {"score": 0.0025031188149336257, "phrase": "automated_tool"}, {"score": 0.0024628046987344846, "phrase": "isascheme"}, {"score": 0.002410058288617039, "phrase": "knuth-bendix_completion"}, {"score": 0.0023841092222805253, "phrase": "recent_automatic_inductive_proof_tools"}, {"score": 0.002258485755625332, "phrase": "natural_numbers"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Theory-exploration", " Theorem proving", " Isabelle/HOL", " Completion"], "paper_abstract": "We describe an approach to automatically invent/explore new mathematical theories, with the goal of producing results comparable to those produced by humans, as represented, for example, in the libraries of the Isabelle proof assistant. Our approach is based on 'schemes', which are formulae in higher-order logic. We show that it is possible to automate the instantiation process of schemes to generate conjectures and definitions. We also show how the new definitions and the lemmata discovered during the exploration of a theory can be used, not only to help with the proof obligations during the exploration, but also to reduce redundancies inherent in most theory-formation systems. We exploit associative-commutative (AC) operators using ordered rewriting to avoid AC variations of the same instantiation. We implemented our ideas in an automated tool, called IsaScheme, which employs Knuth-Bendix completion and recent automatic inductive proof tools. We have evaluated our system in a theory of natural numbers and a theory of lists. (C) 2011 Published by Elsevier Ltd.", "paper_title": "Scheme-based theorem discovery and concept invention", "paper_id": "WOS:000298027300005"}