{"auto_keywords": [{"score": 0.03216186726539171, "phrase": "kactus"}, {"score": 0.004814964078188278, "phrase": "k-anonymity"}, {"score": 0.004747997855358171, "phrase": "data_mining_techniques"}, {"score": 0.004721476966382158, "phrase": "mining_data"}, {"score": 0.004681971826924847, "phrase": "private_and_sensitive_information"}, {"score": 0.004578225880995197, "phrase": "effective_data"}, {"score": 0.004414497439126385, "phrase": "private_information"}, {"score": 0.004328764169068557, "phrase": "data_mining"}, {"score": 0.004024591741595257, "phrase": "data_set"}, {"score": 0.003557564469096285, "phrase": "data_mining_results"}, {"score": 0.0034495044604576385, "phrase": "major_drawback"}, {"score": 0.0034014736691766957, "phrase": "manually_generated_domain_hierarchy_taxonomy"}, {"score": 0.0031889761655961345, "phrase": "new_method"}, {"score": 0.0031094742030008346, "phrase": "classification_trees"}, {"score": 0.0030234540584856352, "phrase": "efficient_multidimensional_suppression"}, {"score": 0.002858466611898155, "phrase": "manually_produced_domain_hierarchy_trees"}, {"score": 0.002717668868154777, "phrase": "data_records"}, {"score": 0.0026129593626748326, "phrase": "kactus_method"}, {"score": 0.002512274063686441, "phrase": "suppression-based_methods"}, {"score": 0.002470316776362351, "phrase": "kactus'_predictive_performance"}, {"score": 0.002429058507933755, "phrase": "existing_k-anonymity_algorithms"}, {"score": 0.0023618385136098537, "phrase": "tds"}, {"score": 0.0023486009035825492, "phrase": "tdr"}, {"score": 0.002328895457218392, "phrase": "kadet"}, {"score": 0.0022141245558628263, "phrase": "manually_defined_domain_trees"}, {"score": 0.002195552442011313, "phrase": "accuracy_gap"}, {"score": 0.0021049977753042253, "phrase": "domain_trees"}], "paper_keywords": ["Privacy-preserving data mining", " k-anonymity", " deindentified data", " decision trees"], "paper_abstract": "Many applications that employ data mining techniques involve mining data that include private and sensitive information about the subjects. One way to enable effective data mining while preserving privacy is to anonymize the data set that includes private information about subjects before being released for data mining. One way to anonymize data set is to manipulate its content so that the records adhere to k-anonymity. Two common manipulation techniques used to achieve k-anonymity of a data set are generalization and suppression. Generalization refers to replacing a value with a less specific but semantically consistent value, while suppression refers to not releasing a value at all. Generalization is more commonly applied in this domain since suppression may dramatically reduce the quality of the data mining results if not properly used. However, generalization presents a major drawback as it requires a manually generated domain hierarchy taxonomy for every quasi-identifier in the data set on which k-anonymity has to be performed. In this paper, we propose a new method for achieving k-anonymity named K-anonymity of Classification Trees Using Suppression (kACTUS). In kACTUS, efficient multidimensional suppression is performed, i.e., values are suppressed only on certain records depending on other attribute values, without the need for manually produced domain hierarchy trees. Thus, in kACTUS, we identify attributes that have less influence on the classification of the data records and suppress them if needed in order to comply with k-anonymity. The kACTUS method was evaluated on 10 separate data sets to evaluate its accuracy as compared to other k-anonymity generalization-and suppression-based methods. Encouraging results suggest that kACTUS' predictive performance is better than that of existing k-anonymity algorithms. Specifically, on average, the accuracies of TDS, TDR, and kADET are lower than kACTUS in 3.5, 3.3, and 1.9 percent, respectively, despite their usage of manually defined domain trees. The accuracy gap is increased to 5.3, 4.3, and 3.1 percent, respectively, when no domain trees are used.", "paper_title": "Efficient Multidimensional Suppression for K-Anonymity", "paper_id": "WOS:000273707000003"}