{"auto_keywords": [{"score": 0.04524706831400301, "phrase": "hermeneutic_phenomenology"}, {"score": 0.031108802777446216, "phrase": "kc"}, {"score": 0.00481495049065317, "phrase": "phenomenological_approach"}, {"score": 0.004591466267316524, "phrase": "experiential_nature"}, {"score": 0.004298974960001275, "phrase": "hans-georg_gadamer's_concept"}, {"score": 0.0041445748748895365, "phrase": "literature-based_conceptual_analysis"}, {"score": 0.004039792863335641, "phrase": "gadamerian_conception"}, {"score": 0.003838078705946304, "phrase": "knowledge_management"}, {"score": 0.003541182515693916, "phrase": "theoretical_analysis"}, {"score": 0.0032671775301001483, "phrase": "different_modes"}, {"score": 0.0031267359296488118, "phrase": "knowledge_creation"}, {"score": 0.0030143100083252516, "phrase": "human_factors"}, {"score": 0.00291657701018444, "phrase": "organizational_circumstances"}, {"score": 0.002832359116458113, "phrase": "gadamer's_concept"}, {"score": 0.002622647280008795, "phrase": "theoretical_study"}, {"score": 0.0022817585639886883, "phrase": "human_being"}, {"score": 0.0022239665922395104, "phrase": "new_view"}, {"score": 0.0021049977753042253, "phrase": "interactive_knowledge_processes"}], "paper_keywords": ["Interaction", " Knowledge creation", " Knowledge management", " Knowledge processes", " Play", " Phenomenology"], "paper_abstract": "Purpose - The purpose of this paper is to examine the experiential nature of knowledge creating interaction and to introduce a framework to explore it theoretically coherently with hermeneutic phenomenology and Hans-Georg Gadamer's concept of play. Design/methodology/approach - This paper presents a literature-based conceptual analysis of the concept of play. Gadamerian conception is related with the descriptions of knowledge creating interaction in the research of knowledge management and with the uses of the concept of play in the field of Library and Information Science (LIS). Theoretical analysis is applied in this study to structure the argumentation. Findings - This study illustrates how the preconceptions of experiences and different modes of being in interaction are implicitly present in the research of knowledge creation (KC) in the descriptions of interaction and human factors enhancing KC. A framework for examining KC in organizational circumstances is developed based on the hermeneutic phenomenology and Gadamer's concept of play, which provide a basis for understanding KC as being together in interaction. Research limitations/implications - This theoretical study develops a framework for examining the process of KC also empirically. In this study the examination of hermeneutic phenomenology is limited to the conceptions of play, authenticity and everydayness; phenomenology offers means for further explication of human being and experience. Originality/value - This study provides a new view on KC based on hermeneutic phenomenology and play, and contributes to the examination of interactive knowledge processes in the field of LIS.", "paper_title": "Knowledge creation and play - a phenomenological approach", "paper_id": "WOS:000355922100006"}