{"auto_keywords": [{"score": 0.04025918977200474, "phrase": "substituent_effect"}, {"score": 0.00481495049065317, "phrase": "substituent_effects"}, {"score": 0.003480108299476168, "phrase": "first_time"}, {"score": 0.003126365132352301, "phrase": "direct_comparison"}, {"score": 0.0030847461428168614, "phrase": "linear_regressions"}, {"score": 0.0027618067917046583, "phrase": "resonance_effects"}, {"score": 0.002697765379095398, "phrase": "bco"}, {"score": 0.0025740882809779913, "phrase": "estimated_standard_deviations"}, {"score": 0.00227378279992074, "phrase": "similar_magnitude"}, {"score": 0.002213596068643924, "phrase": "natural_population_analysis"}, {"score": 0.002198801719545609, "phrase": "npa"}, {"score": 0.002140593237903078, "phrase": "studied_systems"}, {"score": 0.0021049977753042253, "phrase": "through-space_interactions"}], "paper_keywords": ["Substituent effect", " SESE", " HOMA", " pEDA"], "paper_abstract": "Interactions between the NO2 group and 13 different substituents (BF2, BH2, CF3, CH3, CHO, CN, F, NH2, NMe2, NO2, NO, OH, OMe) were investigated computationally for bicyclo[2.2.2]octane (BCO) and benzene substituted at 1,4 and 1,3 positions in the ring. Three methods were employed to estimate the character and strength of the substituent effect: substituent effect stabilization energy (SESE), sigma/pi electron donor acceptor index (sEDA/pEDA) and substituent active region (cSAR) parameter. For the first time the sEDA/pEDA parameters were calculated not for the ring but for the NO2 group. All calculations were performed at the B3LYP/6-31G(d,p) level of theory. For 1,4 derivatives, a direct comparison of slopes of linear regressions between BCO and benzene reveals a much better transmission of the substituent effect in the latter. The ratio of slopes (benzene over BCO) is always larger than 4. It follows that the resonance effects, which are absent in the BCO, dominate in this case. For 1,3 derivatives, because of much lower correlation coefficients, estimated standard deviations (ESD) were used to calculate the ratio instead of the slopes. For these systems the ratio is much closer to the unity, which indicates that only the sigma/through space effects are present and they are of similar magnitude in benzene and BCO. It follows from natural population analysis (NPA) charges that the substituent effect in the studied systems is due mainly to through-space interactions.", "paper_title": "Substituent effects in 1-nitro-4-substituted bicyclo[2.2.2]octane derivatives: inductive or field effects?", "paper_id": "WOS:000340869400026"}