{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "commute_time"}, {"score": 0.005655746394275875, "phrase": "random_walk"}, {"score": 0.004601508848655033, "phrase": "classical_factorization_method"}, {"score": 0.004509694461067052, "phrase": "real-world_multi-body_motion_tracking_problems"}, {"score": 0.004223708778943785, "phrase": "shape_interaction_matrix"}, {"score": 0.0036491673002304326, "phrase": "graph-spectral_embedding"}, {"score": 0.003594369823549604, "phrase": "k-means_algorithm"}, {"score": 0.0031845067058084583, "phrase": "expected_time"}, {"score": 0.002922705896608178, "phrase": "laplacian_spectrum"}, {"score": 0.002878785759716458, "phrase": "discrete_green's_function"}, {"score": 0.0028070431733705735, "phrase": "important_property"}, {"score": 0.0025374674652885354, "phrase": "raw_proximity_matrix"}, {"score": 0.0023883488373022325, "phrase": "pca"}, {"score": 0.0023525307992289563, "phrase": "laplacian"}, {"score": 0.0021917966722180132, "phrase": "synthetic_image_sequences"}, {"score": 0.0021697677572213086, "phrase": "real_world_video_sequences"}], "paper_keywords": [""], "paper_abstract": "The presence of noise renders the classical factorization method almost impractical for real-world multi-body motion tracking problems. The main problem stems from the effect of noise on the shape interaction matrix, which looses its block-diagonal structure and as a result the assignment of elements to objects becomes difficult. The aim in this paper is to overcome this problem using graph-spectral embedding and the k-means algorithm. To this end we develop a representation based on the commute time between nodes on a graph. The commute time (i.e. the expected time taken for a random walk to travel between two nodes and return) can be computed from the Laplacian spectrum using the discrete Green's function, and is an important property of the random walk on a graph. The commute time is a more robust measure of the proximity of data than the raw proximity matrix. Our embedding procedure preserves commute time, and is closely akin to kernel PCA, the Laplacian eigenmap and the diffusion map. We illustrate the results both on the synthetic image sequences and real world video sequences, and compare our results with several alternative methods.", "paper_title": "Robust multi-body motion tracking using commute time clustering", "paper_id": "WOS:000237552900013"}