{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "technology_sectors"}, {"score": 0.0047707093928203, "phrase": "patent_co"}, {"score": 0.004748740786945996, "phrase": "-classification_analysis"}, {"score": 0.003929689573550262, "phrase": "patent_citations"}, {"score": 0.0037696519417841287, "phrase": "patent_data"}, {"score": 0.0035010071030752883, "phrase": "e.g._korean_patents"}, {"score": 0.0032215231177304513, "phrase": "patent_co-classification_based_method"}, {"score": 0.0030617935728586006, "phrase": "analytic_network_process"}, {"score": 0.002950608985750058, "phrase": "ipc_co"}, {"score": 0.002883172383460653, "phrase": "technological_knowledge"}, {"score": 0.0026651772919894534, "phrase": "long-term_importance"}, {"score": 0.0026284507395498897, "phrase": "intermediating_potential"}, {"score": 0.0025922289692173997, "phrase": "technology_sector"}, {"score": 0.0025212722607043546, "phrase": "patent-based_analyses"}, {"score": 0.0021049977753042253, "phrase": "rapidly_evolving_technological_environment"}], "paper_keywords": ["Patent analysis", " Analytic network process (ANP)", " Social network analysis (SNA)", " National R&D investment"], "paper_abstract": "Rapid technological advancements and increasing research and development (R&D) costs are making it necessary for national R&D plans to identify the coreness and intermediarity of technologies in selecting projects and allocating budgets. Studies on the coreness or intermediarity of technology sectors have used patent citations, but there are limitations to dealing with patent data. The limitations arise from the most current patents and patents that do not require citations, e.g. Korean patents. Further, few or no studies have simultaneously considered both coreness and intermediarity. Therefore, we propose a patent co-classification based method to measure coreness and intermediarity of technology sectors by incorporating the analytic network process and the social network analysis. Using IPC co-classifications of patents as technological knowledge flows, this method constructs a network of directed knowledge flows among technology sectors and measures the long-term importance and the intermediating potential of each technology sector, despite the limitations of patent-based analyses. Considering both coreness and intermediarity, this method can provide more detailed and essential knowledge for decision making in planning national R&D. We demonstrated this method using Korean national R&D patents from 2008 to 2011. We expect that this method will help in planning national R&D in a rapidly evolving technological environment.", "paper_title": "Assessing coreness and intermediarity of technology sectors using patent co-classification analysis: the case of Korean national R&D", "paper_id": "WOS:000330622600006"}