{"auto_keywords": [{"score": 0.04645652226343975, "phrase": "vm"}, {"score": 0.04186152866664536, "phrase": "vm_relocation_time"}, {"score": 0.04096684521636721, "phrase": "proposed_scheme"}, {"score": 0.04009119827850682, "phrase": "vms"}, {"score": 0.010300386674329932, "phrase": "total_migration_time"}, {"score": 0.009705400395691134, "phrase": "breakup_vms"}, {"score": 0.00481495049065317, "phrase": "fast_virtual_machine_relocation"}, {"score": 0.004761253507368234, "phrase": "cloud_cluster"}, {"score": 0.00448477700778838, "phrase": "virtual_machine"}, {"score": 0.00436890075128947, "phrase": "vm_relocation"}, {"score": 0.004146015717402716, "phrase": "limited_resource"}, {"score": 0.0040997480534580065, "phrase": "physical_machines"}, {"score": 0.003719705944877787, "phrase": "vm_migrations"}, {"score": 0.0032507647824680684, "phrase": "first_vm"}, {"score": 0.0027363334666886912, "phrase": "vms'_chained_migrations"}, {"score": 0.002391067964886602, "phrase": "pm_utilization"}, {"score": 0.002260367486652148, "phrase": "different_average_cpu"}, {"score": 0.002193600680263771, "phrase": "simulation_results"}], "paper_keywords": ["Virtual machine", " Breakup VM", " Migration", " VM relocation", " Migration chain", " Cloud cluster"], "paper_abstract": "The paper proposes a method for parallelizing migrations to reduce the time required for virtual machine (VM) relocation. During VM relocation, VMs need to wait for their migrations in a chain due to the limited resource of the physical machines (PMs), lengthening the VM relocation time. The essence of the proposed scheme is to break off the VMs' chained migration wait and enables VM migrations to be performed in parallel. The VMs' chained migration wait can be broken off by allowing some VMs, called breakup VMs, to migrate without waiting. A breakup VM is the first VM in a chain of migrations with which the total migration time is reduced when the chain is split at that VM and performed in parallel. Breakup VMs are selected recursively from all the split migration chains until the total migration time can no longer be reduced. After all breakup VMs are selected, VMs' chained migrations are parallelized by temporarily migrating the breakup VMs to spare PMs regardless of their initial migration order. The performance of the proposed scheme is evaluated through simulation. The VM relocation time is affected by the number of VMs and PM utilization in a cluster. Therefore, we simulate relocations of 100-800 VMs in clusters with different average CPU and memory utilizations of PMs. The simulation results show that the proposed scheme reduces VM relocation time by 21.9-62.0 % while using 1.6-5.8 % spare PMs to parallelize the chained migrations.", "paper_title": "A parallel migration scheme for fast virtual machine relocation on a cloud cluster", "paper_id": "WOS:000365185400014"}