{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "plain_public-key_model"}, {"score": 0.00464811139983244, "phrase": "standard_digital_signatures"}, {"score": 0.004309725894724034, "phrase": "multisignature_schemes"}, {"score": 0.004056769841308405, "phrase": "cryptographic_assumptions"}, {"score": 0.0036491673002304326, "phrase": "communication_rounds"}, {"score": 0.0026959452932289797, "phrase": "novel_multisignature_scheme"}, {"score": 0.0026554236621262515, "phrase": "desired_properties"}, {"score": 0.0024617483174454134, "phrase": "random_oracles"}, {"score": 0.0023287359930308864, "phrase": "practical_schemes"}, {"score": 0.0021049977753042253, "phrase": "efficient_verification"}], "paper_keywords": ["Cryptography", " Multisignature", " Computational Diffie-Hellman (CDH) with bilinear maps (co-CDH)", " Discrete Logarithm (DL)", " Decisional Diffie-Hellman (DDH)", " Plain public-key model", " Random oracle model"], "paper_abstract": "Multisignatures extend standard digital signatures to allow an ad hoc set of users to jointly sign a message. Multisignature schemes are often evaluated from the following perspectives: (1) the cryptographic assumptions underlying the schemes; (2) the operational assumptions about the bootstrapping of the schemes in practice; (3) the number of communication rounds for signing a message; (4) the time complexity for signing a message; (5) the amount of communication for signing a message; (6) the time complexity for verifying a multisignature; (7) the length of the resulting multisignatures. Existing multisignature schemes achieve various trade-offs among these measures, but none of them can achieve simultaneously the desired properties with respect to all (or even most) of these measures. In this paper, we present a novel multisignature scheme that offers desired properties with respect to the above (1)-(7) simultaneously, except that it uses random oracles (which however are often required in order to design practical schemes). In particular, our scheme is featured by its weak operational (i.e., plain public-key) model, non-interactive signing, and efficient verification. (C) 2010 Elsevier B.V. All rights reserved.", "paper_title": "Non-interactive multisignatures in the plain public-key model with efficient verification", "paper_id": "WOS:000286288100006"}