{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "process_harmonization"}, {"score": 0.009197201570013795, "phrase": "measurement_model"}, {"score": 0.004715109042114676, "phrase": "application_portfolio"}, {"score": 0.004672953146379813, "phrase": "different_applications"}, {"score": 0.004631172395820296, "phrase": "similar_tasks"}, {"score": 0.004494570360108983, "phrase": "operating_costs"}, {"score": 0.0033409791799749403, "phrase": "literature_study"}, {"score": 0.0031940685896742356, "phrase": "factor_analysis"}, {"score": 0.0031559919178954644, "phrase": "known_related_constructs"}, {"score": 0.003071965703296204, "phrase": "valid_and_reliable_measurement_model"}, {"score": 0.002936849401568391, "phrase": "technical_design"}, {"score": 0.002910545717767559, "phrase": "business_process"}, {"score": 0.0027992509096654754, "phrase": "information_systems"}, {"score": 0.002708399936381754, "phrase": "strong_correlations"}, {"score": 0.002628362641980801, "phrase": "process_complexity"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Harmonization", " Business process", " Hierarchical measurement model", " Partial least squares"], "paper_abstract": "Context: Many large organizations juggle an application portfolio that contains different applications that fulfill similar tasks in the organization. In an effort to reduce operating costs, they are attempting to consolidate such applications. Before consolidating applications, the work that is done with these applications must be harmonized. This is also known as process harmonization. Objective: The increased interest in process harmonization calls for measures to quantify the extent to which processes have been harmonized. These measures should also uncover the factors that are of interest when harmonizing processes. Currently, such measures do not exist. Therefore, this study develops and validates a measurement model to quantify the level of process harmonization in an organization. Method: The measurement model was developed by means of a literature study and structured interviews. Subsequently, it was validated through a survey, using factor analysis and correlations with known related constructs. Results: As a result, a valid and reliable measurement model was developed. The factors that are found to constitute process harmonization are: the technical design of the business process and its data, the resources that execute the process, and the information systems that are used in the process. In addition, strong correlations were found between process harmonization and process standardization and between process complexity and process harmonization. Conclusion: The measurement model can be used by practitioners, because it shows them the factors that must be taken into account when harmonizing processes, and because it provides them with a means to quantify the extent to which they succeeded in harmonizing their processes. At the same time, it can be used by researchers to conduct further empirical research in the area of process harmonization. (C) 2015 Elsevier B.V. All rights reserved.", "paper_title": "Measures of process harmonization", "paper_id": "WOS:000354149000003"}