{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "lean_production"}, {"score": 0.008635323708067676, "phrase": "information_technology"}, {"score": 0.0077118900332603, "phrase": "lean_principles"}, {"score": 0.004437115547184535, "phrase": "service_sectors"}, {"score": 0.0041637779492720295, "phrase": "toyota_production_system"}, {"score": 0.003960831041259951, "phrase": "customer_service"}, {"score": 0.003925004567341077, "phrase": "similar_benefits"}, {"score": 0.0029209233709517634, "phrase": "production_logistics"}, {"score": 0.0026548344763838213, "phrase": "different_ways"}, {"score": 0.002559951153813876, "phrase": "subsequent_developments"}, {"score": 0.002326669201839705, "phrase": "hybrid_production_systems"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v._all_rights"}], "paper_keywords": ["Lean Production", " Information technology", " Production control", " Kanban", " Maintenance"], "paper_abstract": "The principles of Lean Production have enabled organisations in the manufacturing and service sectors to significantly improve their competitiveness. The application of Lean principles, derived from the Toyota Production System has enabled many organisations to Simultaneously improve productivity, quality and customer service. Similar benefits have been achieved through the application of information technology (IT). The application of IT and Lean principles are claimed to be interdependent and complimentary by some; whilst others have seen as the approaches as being mutually exclusive. This article presents reviews the role of IT in achieving the principles of Lean Production. Three important topics are reviewed: the use of IT in production logistics; computer-aided production management systems; and advanced plant maintenance. It is shown that the roots of different ways of working were similar, but that subsequent developments followed in opposite directions. Later, when the acceptance of Lean Production became more pervasive, the practices typically converged into hybrid production systems, applying elements of several systems in a way that is consistent with the principles with Lean Production. (C) 2009 Elsevier B.V. All rights reserved.", "paper_title": "Lean Production and information technology: Connection or contradiction?", "paper_id": "WOS:000265992500002"}