{"auto_keywords": [{"score": 0.029918210649248395, "phrase": "proposed_similarity"}, {"score": 0.00481495049065317, "phrase": "similarity_and_inclusion_measures"}, {"score": 0.004231699728933577, "phrase": "axiomatic_definitions"}, {"score": 0.004123781267600542, "phrase": "fuzzy_similarity_and_inclusion_measures"}, {"score": 0.0029467742734417255, "phrase": "existing_measures"}, {"score": 0.0027741761880779535, "phrase": "inclusion_measures"}, {"score": 0.0024586427394152196, "phrase": "highly_uncertain_nature"}, {"score": 0.0023548511815224098, "phrase": "theoretical_proof"}, {"score": 0.002197801146305747, "phrase": "proposed_measures"}, {"score": 0.0021601997088758957, "phrase": "natural_extensions"}], "paper_keywords": ["General type-2 fuzzy sets", " Similarity measure", " Inclusion measure", " alpha-Plane theory"], "paper_abstract": "Interval type-2 fuzzy similarity and inclusion measures have been widely studied. In this paper, the axiomatic definitions of general type-2 fuzzy similarity and inclusion measures are given on the basis of interval type-2 fuzzy similarity and inclusion measures. To improve the shortcomings of the existing general type-2 fuzzy similarity and inclusion measures, we define two new general type-2 fuzzy similarity measures and two new general type-2 fuzzy inclusion measures based on -plane representation theory, respectively, and discuss their related properties. Unlike some existing measures, one of the proposed similarity and inclusion measures are expressed as type-1 fuzzy sets, and therefore these definitions are consistent with the highly uncertain nature of general type-2 fuzzy sets. The theoretical proof is also given to illustrate that the proposed measures are natural extensions of the most popular type-1 fuzzy measures. In the end, the performances of the proposed similarity and inclusion measures are examined.", "paper_title": "A new approach to similarity and inclusion measures between general type-2 fuzzy sets", "paper_id": "WOS:000333030800016"}