{"auto_keywords": [{"score": 0.03881123425516098, "phrase": "time-varying_gene_regulatory_networks"}, {"score": 0.03050364876588857, "phrase": "dynamic_vector_autoregressive_model"}, {"score": 0.004860218511356106, "phrase": "time"}, {"score": 0.004712988631183401, "phrase": "gene_expression_regulatory_networks"}, {"score": 0.004652845998457721, "phrase": "wavelet_dynamic_vector_autoregressive_method"}, {"score": 0.004515467468684217, "phrase": "biological_cellular_processes"}, {"score": 0.004382127278148236, "phrase": "extracellular_regulators"}, {"score": 0.003988055287053139, "phrase": "detailed_molecular_description"}, {"score": 0.003937126962709418, "phrase": "protein_and_gene_networks"}, {"score": 0.0038207994186834015, "phrase": "molecular_networks"}, {"score": 0.0037398106866046972, "phrase": "statistical_method"}, {"score": 0.00350696416714684, "phrase": "gene_regulatory_networks"}, {"score": 0.0032050528424273994, "phrase": "priori_biological_knowledge"}, {"score": 0.003031287195944274, "phrase": "time_period"}, {"score": 0.002586457551025025, "phrase": "microarray_experiments"}, {"score": 0.0024884913795612707, "phrase": "gene_expression_profiles_data"}, {"score": 0.0024461474613359994, "phrase": "prior_biological_knowledge"}, {"score": 0.002244969789802093, "phrase": "hela_cells"}, {"score": 0.0021049977753042253, "phrase": "information_flow"}], "paper_keywords": [""], "paper_abstract": "Motivation: A variety of biological cellular processes are achieved through a variety of extracellular regulators, signal transduction, protein-protein interactions and differential gene expression. Understanding of the mechanisms underlying these processes requires detailed molecular description of the protein and gene networks involved. To better understand these molecular networks, we propose a statistical method to estimate time-varying gene regulatory networks from time series microarray data. One well known problem when inferring connectivity in gene regulatory networks is the fact that the relationships found constitute correlations that do not allow inferring causation, for which, a priori biological knowledge is required. Moreover, it is also necessary to know the time period at which this causation occurs. Here, we present the Dynamic Vector Autoregressive model as a solution to these problems. Results: We have applied the Dynamic Vector Autoregressive model to estimate time-varying gene regulatory networks based on gene expression profiles obtained from microarray experiments. The network is determined entirely based on gene expression profiles data, without any prior biological knowledge. Through construction of three gene regulatory networks (of p53, NF-kappa B and c-myc) for HeLa cells, we were able to predict the connectivity, Granger-causality and dynamics of the information flow in these networks.", "paper_title": "Time-varying modeling of gene expression regulatory networks using the wavelet dynamic vector autoregressive method", "paper_id": "WOS:000248620400007"}