{"auto_keywords": [{"score": 0.0496213341565463, "phrase": "natural_numbers"}, {"score": 0.030926517488363503, "phrase": "probability_assignments"}, {"score": 0.004618614357974438, "phrase": "basic_axioms"}, {"score": 0.004516252479285941, "phrase": "peano"}, {"score": 0.004037158739422644, "phrase": "recent_epistemology"}, {"score": 0.0038353580177342118, "phrase": "vantage_point"}, {"score": 0.003810850017764603, "phrase": "traditional_philosophy"}, {"score": 0.0036788184374592706, "phrase": "preliminary_defense"}, {"score": 0.0034392837410790293, "phrase": "classical_literature"}, {"score": 0.00339545228483945, "phrase": "frege's_concern"}, {"score": 0.003204999581724485, "phrase": "baker's_concern"}, {"score": 0.003154012038613403, "phrase": "small_samplings"}, {"score": 0.0025439310656198795, "phrase": "non-trivial_results"}, {"score": 0.0024243586247372087, "phrase": "forcing_argument"}, {"score": 0.002378114613631841, "phrase": "continuous_probability_assignments"}, {"score": 0.0022663183381878044, "phrase": "concluding_section"}, {"score": 0.0022374020089160084, "phrase": "future_work"}, {"score": 0.002180669078658133, "phrase": "arithmetical_confirmation"}, {"score": 0.002145942273032774, "phrase": "probabilistic_liar"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Philosophy of mathematics", " Inductive logic", " Peano arithmetic"], "paper_abstract": "The topic of this paper is our knowledge of the natural numbers, and in particular, our knowledge of the basic axioms for the natural numbers, namely the Peano axioms. The thesis defended in this paper is that knowledge of these axioms may be gained by recourse to judgments of probability. While considerations of probability have come to the forefront in recent epistemology, it seems safe to say that the thesis defended here is heterodox from the vantage point of traditional philosophy of mathematics. So this paper focuses on providing a preliminary defense of this thesis, in that it focuses on responding to several objections. Some of these objections are from the classical literature, such as Frege's concern about indiscernibility and circularity (Section 2.1), while other are more recent, such as Baker's concern about the unreliability of small samplings in the setting of arithmetic (Section 2.2). Another family of objections suggests that we simply do not have access to probability assignments in the setting of arithmetic, either due to issues related to the omega-rule (Section 3.1) or to the non-computability and non-continuity of probability assignments (Section 3.2). Articulating these objections and the responses to them involves developing some non-trivial results on probability assignments (Appendix A-Appendix C), such as a forcing argument to establish the existence of continuous probability assignments that may be computably approximated (Theorem 4 Appendix B). In the concluding section, two problems for future work are discussed: developing the source of arithmetical confirmation and responding to the probabilistic liar. (C) 2014 Elsevier B.V. All rights reserved.", "paper_title": "Empiricism, probability, and knowledge of arithmetic: A preliminary defense", "paper_id": "WOS:000340306600007"}