{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "feature_discretization"}, {"score": 0.004764542405129454, "phrase": "discrete_data_representations"}, {"score": 0.004265953661191515, "phrase": "relevant_subsets"}, {"score": 0.0038597866217852353, "phrase": "learning_task"}, {"score": 0.0035853745478488254, "phrase": "first_method"}, {"score": 0.0035106041824568618, "phrase": "filter_family"}, {"score": 0.0031098631445657158, "phrase": "discretized_features"}, {"score": 0.0027547408718334603, "phrase": "pre-processing_or_post-processing_stages"}, {"score": 0.002613239644974825, "phrase": "binary_and_multi-class_problems"}, {"score": 0.0024789887640568093, "phrase": "existing_methods"}, {"score": 0.0024144659350277954, "phrase": "well-known_fs_methods"}, {"score": 0.0023025177990160487, "phrase": "better_accuracy"}, {"score": 0.002172701452347454, "phrase": "original_features"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Feature discretization", " Static discretization", " Incremental discretization", " Filter", " Wrapper", " Feature selection"], "paper_abstract": "Discrete data representations are necessary, or at least convenient, in many machine learning problems. While feature selection (FS) techniques aim at finding relevant subsets of features, the goal of feature discretization (FD) is to find concise (quantized) data representations, adequate for the learning task at hand. In this paper, we propose two incremental methods for FD. The first method belongs to the filter family, in which the quality of the discretization is assessed by a (supervised or unsupervised) relevance criterion. The second method is a wrapper, where discretized features are assessed using a classifier. Both methods can be coupled with any static (unsupervised or supervised) discretization procedure and can be used to perform FS as pre-processing or post-processing stages. The proposed methods attain efficient representations suitable for binary and multi-class problems with different types of data, being competitive with existing methods. Moreover, using well-known FS methods with the features discretized by our techniques leads to better accuracy than with the features discretized by other methods or with the original features. (C) 2013 Elsevier B.V. All rights reserved.", "paper_title": "Incremental filter and wrapper approaches for feature discretization", "paper_id": "WOS:000326909600008"}