{"auto_keywords": [{"score": 0.03754149614401332, "phrase": "firing_rates"}, {"score": 0.00481495049065317, "phrase": "stimulus-driven_responses"}, {"score": 0.004186105377259855, "phrase": "neural_populations"}, {"score": 0.003968675046544738, "phrase": "stimulus-dependent_changes"}, {"score": 0.003427032390942116, "phrase": "fisher_information"}, {"score": 0.0032058286587989234, "phrase": "stimulus-dependent_correlations"}, {"score": 0.0030189426536422577, "phrase": "overall_information"}, {"score": 0.002824005136794786, "phrase": "stimulus_dependence"}, {"score": 0.0026950674053179404, "phrase": "stimulus-induced_firing_rates"}, {"score": 0.002220551141101661, "phrase": "additional_strong_spatial_decay"}, {"score": 0.0021049977753042253, "phrase": "negative_impact"}], "paper_keywords": [""], "paper_abstract": "The magnitude of correlations between stimulus-driven responses of pairs of neurons can itself be stimulus dependent. We examine how this dependence affects the information carried by neural populations about the stimuli that drive them. Stimulus-dependent changes in correlations can both carry information directly and modulate the information separately carried by the firing rates and variances. We use Fisher information to quantify these effects and show that, although stimulus-dependent correlations often carry little information directly, their modulatory effects on the overall information can be large. In particular, if the stimulus dependence is such that correlations increase with stimulus-induced firing rates, this can significantly enhance the information of the population when the structure of correlations is determined solely by the stimulus. However, in the presence of additional strong spatial decay of correlations, such stimulus dependence may have a negative impact. Opposite relationships hold when correlations decrease with firing rates.", "paper_title": "Stimulus-Dependent Correlations and Population Codes", "paper_id": "WOS:000269833200003"}