{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "special_properties"}, {"score": 0.04476152971906731, "phrase": "location_s"}, {"score": 0.03947447987613366, "phrase": "vector_b"}, {"score": 0.004259293347851015, "phrase": "location_e"}, {"score": 0.004070515037356991, "phrase": "location_e."}, {"score": 0.003921324779989663, "phrase": "mutual_properties"}, {"score": 0.003678133730034786, "phrase": "vector_a"}, {"score": 0.00335016692413066, "phrase": "'_or_'there-exists'_notations"}, {"score": 0.0032793933580835574, "phrase": "sequential_programs"}, {"score": 0.0031930184711888867, "phrase": "bit-parallel_process"}, {"score": 0.002908181499274949, "phrase": "logical_formula"}, {"score": 0.002861961643289598, "phrase": "systematical_method"}, {"score": 0.0026914710445743693, "phrase": "five_logical_prototype_problems"}, {"score": 0.0023424328921363585, "phrase": "corresponding_logical_formula"}, {"score": 0.0023051837161137674, "phrase": "bit-parallel_operations"}, {"score": 0.0022444104439449737, "phrase": "word_size"}, {"score": 0.002179404723362044, "phrase": "five_problems"}, {"score": 0.0021049977753042253, "phrase": "five_prototype_problems"}], "paper_keywords": ["bit-parallel", " logical operation", " for-all operation", " there-exists operation"], "paper_abstract": "Suppose that we are given a vector consisting of only 1's and 0's and we are interested in finding some special properties of this vector. For instance, we like to determine whether all of the bits from location s to location e in the vector are all 1's or whether there exists a 1 from location s to location e. In more complicated cases, we are given two bit-vectors and we like to investigate the mutual properties between the two vectors. For instance, we want to find all locations i in vector B such that there exists a k in vector A, k <= i, such that A(k) = 1 and in vector B, locations from k to i all assume value 1. These problems all involve 'for-all' or 'there-exists' notations and can of course be solved by sequential programs. In this paper, we are interested in bit-parallel process to solve these problems. That is, we are interested in solving the problem efficiently by using 'bitwise-and', 'bitwise-or' and other bitwise logical operations. A sequence of logical operations can be expressed as a logical formula. This paper proposes a systematical method to find such logical formulas to solve problems involving bit-vectors with 'for-all' and 'there-exists' notations. Five logical prototype problems, named 'single-for-all' (1's), 'single-there-exists', 'multiple-for-all', 'multiple-there-exists' and 'multiple-there-exists-and-for-all', are defined in this paper. For each problem, we show that there exists a corresponding logical formula that can be computed using bit-parallel operations in O(n/w) time, where w is the word size of the machine. We also propose four variants for these five problems, and show that their logical formulas can be obtained using those of the five prototype problems.", "paper_title": "A Systematical and Parallel Approach to Solve Problems Involving Special Properties of Bit-Vectors", "paper_id": "WOS:000359139000006"}