{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "business_process_models"}, {"score": 0.004631099806015235, "phrase": "enterprise_modelling"}, {"score": 0.0045124316982387315, "phrase": "business_process_modelling"}, {"score": 0.004302680891412643, "phrase": "different_purposes"}, {"score": 0.004247180402119585, "phrase": "interesting_results"}, {"score": 0.0038613835226952117, "phrase": "full_potential"}, {"score": 0.0034953361767153285, "phrase": "modelling_level"}, {"score": 0.003465189575252443, "phrase": "quite_a_lot"}, {"score": 0.0032896745636186824, "phrase": "enterprise_interoperability"}, {"score": 0.0029392020223716966, "phrase": "corresponding_methodology"}, {"score": 0.002766171878646582, "phrase": "different_enterprise_modelling_tools"}, {"score": 0.0025036862991477437, "phrase": "process_dimension"}, {"score": 0.0023257824499250653, "phrase": "different_business_process_models"}, {"score": 0.0022562464662197867, "phrase": "collaborative_enterprises"}, {"score": 0.0021049977753042253, "phrase": "valuable_aid"}], "paper_keywords": [""], "paper_abstract": "Enterprise Modelling, in general, and Business Process Modelling, in particular, have been used for decades for different purposes and with interesting results. However, a variety of problems can be identified in this context and many enterprises find it difficult to leverage the full potential and benefits of these technologies. One of the most important problems in this sense is the lack of interoperability among enterprises at the modelling level. Quite a lot of efforts has been carried out in this domain to improve enterprise interoperability at this level. The development of the POP* meta-model is one of these initiatives, which aim to establish a meta-model and a corresponding methodology that enable enterprises to exchange their enterprise models, despite the fact that they use different Enterprise Modelling Tools. In this paper, we present a 'proof of concept' of the POP* meta-model focused on the process dimension, which is expected to further our understanding of how this meta-model can be used to exchange different business process models among the partners in networks of collaborative enterprises. Moreover, the work performed in this 'proof of concept' has been a valuable aid to validate and improve the development of the POP* meta-model.", "paper_title": "Exchange of Business Process Models using the POP* meta-model", "paper_id": "WOS:000236884100017"}