{"auto_keywords": [{"score": 0.05007852962010534, "phrase": "wireless_industrial_sensor_networks"}, {"score": 0.015074435841361757, "phrase": "industrial_applications"}, {"score": 0.012960284276144603, "phrase": "earq"}, {"score": 0.008567904577970697, "phrase": "wireless_sensor_networks"}, {"score": 0.0064010868322413135, "phrase": "energy_cost"}, {"score": 0.006135943178893471, "phrase": "sink_node"}, {"score": 0.00416882434439484, "phrase": "reliable_delivery"}, {"score": 0.0038789122930433305, "phrase": "novel_routing_protocol"}, {"score": 0.003670843919846253, "phrase": "energy_awareness"}, {"score": 0.003287482882222731, "phrase": "neighboring_nodes"}, {"score": 0.0030457198309616694, "phrase": "packet_forwarding"}, {"score": 0.002944039482467119, "phrase": "next_node"}, {"score": 0.0028822153400215973, "phrase": "lower_energy_cost"}, {"score": 0.0026252106881752067, "phrase": "real-time_delivery"}, {"score": 0.002391067964886602, "phrase": "redundant_packet"}, {"score": 0.0023607968604629393, "phrase": "alternate_path"}, {"score": 0.0022339789476489877, "phrase": "experimental_results"}], "paper_keywords": ["Energy aware routing", " industrial control", " real-time and reliable communication", " wireless industrial sensor networks"], "paper_abstract": "Wireless industrial sensor networks are wireless sensor networks which have been adapted to industrial applications. Most techniques for wireless sensor networks can be applied to wireless industrial sensor networks. However, for industrial applications of wireless industrial sensor networks, new requirements such as real-time, reliable delivery need to be considered. In this paper, we propose EARQ, which is a novel routing protocol for wireless industrial sensor networks. It provides real-time, reliable delivery of a packet, while considering energy awareness. In EARQ, a node estimates the energy cost, delay and reliability of a path to the sink node, based only on information from neighboring nodes. Then, it calculates the probability of selecting a path, using the estimates. When packet forwarding is required, it randomly selects the next node. A path with lower energy cost is likely to be selected, because the probability is inversely proportional to the energy cost to the sink node. To achieve real-time delivery, only paths that may deliver a packet in time are selected. To achieve reliability, it may send a redundant packet via an alternate path, but only if it is a source of a packet. Experimental results show that EARQ is suitable for industrial applications, due to its capability for energy efficient, real-time, reliable communications.", "paper_title": "EARQ: Energy Aware Routing for Real-Time and Reliable Communication in Wireless Industrial Sensor Networks", "paper_id": "WOS:000264247700002"}