{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "virtual_age"}, {"score": 0.011954420566516648, "phrase": "gaming_performance"}, {"score": 0.00456159659731398, "phrase": "game_behaviors"}, {"score": 0.00445712058827745, "phrase": "in-game_characters"}, {"score": 0.00415777266387528, "phrase": "easy_task"}, {"score": 0.0037170399498025215, "phrase": "student_understanding"}, {"score": 0.0036884198249734863, "phrase": "biological_evolution"}, {"score": 0.003075583447856341, "phrase": "significant_findings"}, {"score": 0.0028687545730861665, "phrase": "in-game_behaviors"}, {"score": 0.0027599042621376624, "phrase": "relevant_information"}, {"score": 0.00257424957319189, "phrase": "learning_outcomes"}, {"score": 0.0025054621733192283, "phrase": "cluster_analysis"}, {"score": 0.002391779843744166, "phrase": "high_gaming_performance"}, {"score": 0.0023188652648490874, "phrase": "effective_game"}, {"score": 0.002171202123281881, "phrase": "future_work"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Secondary education", " Applications in subject areas", " Interactive learning environments", " Teaching/learning strategies", " Virtual reality"], "paper_abstract": "Video games possess many unique features that facilitate learning. Meanwhile, teaching about evolution is never an easy task due to the existence of some barriers to its learning. Virtual Age, therefore, has been developed in an attempt to harness the power of gaming to increase student understanding of biological evolution. The aim of this study was to examine whether Virtual Age is effective for learning about evolution and to further explore the interplay of student concept learning, gaming performance, and in-game behaviors. A total of 62 7th graders took part in the study, and significant findings were revealed. The students did learn by playing Virtual Age, and their long-term knowledge retention was promising. The in-game behaviors, such as times and duration of viewing the relevant information embedded in Virtual Age, were significantly related to gaming performance (game score), which subsequently influenced learning outcomes. Moreover, the results of cluster analysis indicated that three clusters of low learning outcomes/low gaming performance, high learning outcomes, and high gaming performance emerged. Overall, Virtual Age is an effective game for learning about evolution based on its sound and sophisticated design. Implications derived from the study and suggestions for future work are proposed. (C) 2015 Elsevier Ltd. All rights reserved.", "paper_title": "Learning through playing Virtual Age: Exploring the interactions among student concept learning, gaming performance, in-game behaviors, and the use of in-game characters", "paper_id": "WOS:000363068500002"}