{"auto_keywords": [{"score": 0.04896221231267544, "phrase": "textual_search_queries"}, {"score": 0.04194370758481077, "phrase": "mocap_data_samples"}, {"score": 0.014713079877291162, "phrase": "mocap_data_retrieval"}, {"score": 0.00481495049065317, "phrase": "mocap_data_segments"}, {"score": 0.00443308765153716, "phrase": "short_motion"}, {"score": 0.004261998281333649, "phrase": "content-based_retrieval"}, {"score": 0.003832198214757852, "phrase": "simple_retrieval_methods"}, {"score": 0.003472845095323694, "phrase": "mocap_data_relevance"}, {"score": 0.0033651019362620866, "phrase": "search_results"}, {"score": 0.003134705849154561, "phrase": "search_query"}, {"score": 0.0030135741897058844, "phrase": "novel_method"}, {"score": 0.0028630535573013686, "phrase": "text_document_retrieval"}, {"score": 0.0026045914281028473, "phrase": "text_documents"}, {"score": 0.002533692361445195, "phrase": "idf"}, {"score": 0.0025038930574283174, "phrase": "infrequent_segments"}, {"score": 0.0023787690061742566, "phrase": "frequent_segments"}, {"score": 0.0021049977753042253, "phrase": "developed_text_retrieval_methods"}], "paper_keywords": ["Motion capture", " Mocap", " Retrieval"], "paper_abstract": "Many techniques have been proposed to address the problem of mocap data retrieval by using a short motion as input, and they are commonly categorized as content-based retrieval. However, it is difficult for users who do not have equipments to create mocap data samples to take advantage of them. On the contrary, simple retrieval methods which only require text as input can be used by everyone. Nevertheless, not only that it is not clear how to measure mocap data relevance in regard to textual search queries, but the search results will also be limited to the mocap data samples, the annotations of which contain the words in the search query. In this paper, the authors propose a novel method that builds on the TF (term frequency) and IDF (inverse document frequency) weights, commonly used in text document retrieval, to measure mocap data relevance in regard to textual search queries. We extract segments from mocap data samples and regard these segments as words in text documents. However, instead of using IDF which prioritizes infrequent segments, we opt to use DF (document frequency) to prioritize frequent segments. Since motions are not required as input, everybody will be able to take advantage of our approach, and we believe that our work also opens up possibilities for applying developed text retrieval methods in mocap data retrieval.", "paper_title": "TF-DF indexing for mocap data segments in measuring relevance based on textual search queries", "paper_id": "WOS:000278135800068"}