{"auto_keywords": [{"score": 0.038509162157966376, "phrase": "gps'_practice_patterns"}, {"score": 0.015543532808173026, "phrase": "health_expenditures"}, {"score": 0.00481495049065317, "phrase": "kdd_approach"}, {"score": 0.004522406417999492, "phrase": "political_agenda"}, {"score": 0.003559284776569813, "phrase": "inappropriate_or_unusual_behavior"}, {"score": 0.0033427754823819157, "phrase": "knowledge_discovery"}, {"score": 0.0032673476252654825, "phrase": "kdd"}, {"score": 0.002898291237210567, "phrase": "health_expenditure_information"}, {"score": 0.002849078393246526, "phrase": "decision_makers"}, {"score": 0.002690975370565776, "phrase": "complete_picture"}, {"score": 0.0026302120935562568, "phrase": "health_expenditures_characteristics"}, {"score": 0.0025416235470290286, "phrase": "attributes_space"}, {"score": 0.0024984517279573906, "phrase": "smaller_number"}, {"score": 0.002442025065383455, "phrase": "effective_segmentation"}, {"score": 0.0023064582783867645, "phrase": "health_fraud"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["health insurance", " clustering", " self-organizing maps (SOM)", " knowledge discovery in database (KDD)"], "paper_abstract": "Health expenditures have rapidly risen to the top of the political agenda in many countries. Physicians and their actions account for most health care spending. However, very few studies have attempted more comprehensive exploration of general practitioners' (GPs') practice patterns segmentation. This paper seeks to bridge this gap. It facilitates the payer or stakeholder to use these GPs' practice patterns and features to detect inappropriate or unusual behavior to overcome the growth in health expenditures. This study uses knowledge discovery in database (KDD) to segment the general practitioners' (GPs') profiles by carrying out clustering techniques based on the features of expenditures, and then builds health expenditure information to support decision makers in the management of various GP's practice patterns. It draws a complete picture relating to the health expenditures characteristics of GPs' practice patterns by reducing the attributes space to a smaller number of dimensions. Effective segmentation of GPs' practice patterns makes it easier to detect and investigate health fraud by recognizing and quantifying the features of claims and providers. (c) 2007 Elsevier Ltd. All rights reserved.", "paper_title": "Intelligent physician segmentation and management based on KDD approach", "paper_id": "WOS:000253183700039"}