{"auto_keywords": [{"score": 0.03419569965162811, "phrase": "patent_h-index"}, {"score": 0.00481495049065317, "phrase": "patent_level"}, {"score": 0.004722791767189843, "phrase": "acceptable_proxy"}, {"score": 0.004677372885331908, "phrase": "innovative_activity"}, {"score": 0.004413846562278824, "phrase": "patent_citations"}, {"score": 0.004267004541988167, "phrase": "technology_indicators"}, {"score": 0.0034325187732054093, "phrase": "derwent_innovations_index"}, {"score": 0.0033830587647810132, "phrase": "semiconductor_area"}, {"score": 0.003070996252787868, "phrase": "mean_family_size"}, {"score": 0.002869793011316547, "phrase": "effective_indicator"}, {"score": 0.002814759530655965, "phrase": "technological_importance"}, {"score": 0.0026175952455594277, "phrase": "mfs_indicator"}, {"score": 0.002446024708601971, "phrase": "\"social_value"}, {"score": 0.0022527169079147374, "phrase": "mfs"}], "paper_keywords": [""], "paper_abstract": "As an acceptable proxy for innovative activity, patents have become increasingly important in recent years. Patents and patent citations have been used for construction of technology indicators. This article presents an alternative to other citation-based indicators, i.e., the patent h-index, which is borrowed from bibliometrics. We conduct the analysis on a sample of the world's top 20 firms ranked by total patents granted in the period 1996-2005 from the Derwent Innovations Index in the semiconductor area. We also investigate the relationships between the patent h-index and other three indicators, i.e., patent counts, citation counts, and the mean family size (MFS). The findings show that the patent h-index is indeed an effective indicator for evaluating the technological importance and quality, or impact, for an assignee. In addition, the MFS indicator correlates negatively and not significantly with the patent h-index, which indicates that the \"social value\" of a patent is in disagreement with its \"private value.\" The two indicators, patent h-index and MFS, both provide an overview of the value of patents, but from two different angles.", "paper_title": "Exploring the h-Index at Patent Level", "paper_id": "WOS:000262424900005"}