{"auto_keywords": [{"score": 0.04636785862116073, "phrase": "web_services"}, {"score": 0.0074582868657793525, "phrase": "proposed_approach"}, {"score": 0.006676168062094717, "phrase": "soa"}, {"score": 0.005612906600674221, "phrase": "test_oracle_problem"}, {"score": 0.00481495049065317, "phrase": "testing_web_services"}, {"score": 0.004734038956773703, "phrase": "service_oriented_architecture"}, {"score": 0.00459568664065473, "phrase": "major_application_development_paradigm"}, {"score": 0.004518442937844318, "phrase": "basic_unit"}, {"score": 0.004480307124735185, "phrase": "soa_applications"}, {"score": 0.0038953958723049287, "phrase": "source_code"}, {"score": 0.0038461532860146535, "phrase": "restricted_control"}, {"score": 0.0036553070575015344, "phrase": "oracle_problem"}, {"score": 0.00327356326590461, "phrase": "important_issue"}, {"score": 0.002994449398035894, "phrase": "metamorphic_relation-based_approach"}, {"score": 0.002857849698346116, "phrase": "so-called_metamorphic_relations"}, {"score": 0.0027741761880779535, "phrase": "test_results"}, {"score": 0.0025591748412278174, "phrase": "unique_features"}, {"score": 0.0021049977753042253, "phrase": "effective_and_efficient_test_technique"}], "paper_keywords": ["Metamorphic Testing", " Service Oriented Architecture (SOA)", " Software Testing", " Test Oracle", " Web Services"], "paper_abstract": "Service Oriented Architecture (SOA) has become a major application development paradigm. As a basic unit of SOA applications, Web services significantly affect the quality of the applications constructed from them. In the context of SOA, the specification and implementation of Web services are completely separated. The lack of source code and the restricted control of Web services limit the testability of Web services, and make the oracle problem prominent. In this context, can one alleviate the test oracle problem, or effectively and efficiently test such Web services even without oracles? It is an important issue which has not been yet adequately addressed. To address the challenge of testing Web services, the authors propose a metamorphic relation-based approach to testing Web services without oracles. The proposed approach leverages so-called metamorphic relations to generate test cases and evaluate test results. To make the proposed approach practical and effective, the authors proposed a framework taking into account the unique features of SOA, and developed a prototype which partially automates the framework. Three case studies are conducted to validate the feasibility and effectiveness of the proposed approach. The work presented in the paper not only alleviates the test oracle problem of testing Web services, but also delivers an effective and efficient test technique without oracles.", "paper_title": "A Metamorphic Relation-Based Approach to Testing Web Services Without Oracles", "paper_id": "WOS:000309046600003"}