{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "mean_shifts"}, {"score": 0.04963913874714364, "phrase": "multivariate_manufacturing_processes"}, {"score": 0.027291721859148146, "phrase": "proposed_mspc_model"}, {"score": 0.008906234909603706, "phrase": "detected_out-of-control_signals"}, {"score": 0.0047268728636719725, "phrase": "two-level_selective_ensemble"}, {"score": 0.004661868629458321, "phrase": "vector_quantization_neural_networks"}, {"score": 0.0045765783794477505, "phrase": "modern_computers"}, {"score": 0.004349955692802962, "phrase": "continuous_high-speed_acquisition"}, {"score": 0.004192190072470619, "phrase": "multivariate_control_charts"}, {"score": 0.0040215052006051235, "phrase": "real-world_manufacturing_scenarios"}, {"score": 0.0034210342328868017, "phrase": "out-of-control_signal"}, {"score": 0.0033274664434575136, "phrase": "effective_mspc_model"}, {"score": 0.003281643474564305, "phrase": "two-level_discrete_particle_swarm_optimization-based_selective_ensemble"}, {"score": 0.002896535621940078, "phrase": "out-of-control_signals"}, {"score": 0.002652878591019016, "phrase": "specific_mean_shift_types"}, {"score": 0.0026163210719740847, "phrase": "experimental_result"}, {"score": 0.0024865237976623286, "phrase": "process_state"}, {"score": 0.002225196379204285, "phrase": "case_study"}, {"score": 0.0021049977753042253, "phrase": "effective_tool"}], "paper_keywords": ["Statistical process control", " Multivariate manufacturing process", " Neural network", " Selective ensemble", " Particle swarm optimization"], "paper_abstract": "Nowadays, modern computers in general and the PC in particular have made the continuous high-speed acquisition and inspection accessible and during the last decade, multivariate control charts were given more attention and became so popular in real-world manufacturing scenarios. However, most conventional multivariate control charts share the same problem: they can only detect an out-of-control circumstance but cannot directly point out which variable or group of variables has caused the out-of-control signal. This study proposes an effective MSPC model enabled by two-level discrete particle swarm optimization-based selective ensemble of learning vector quantization networks (DPSOSENLVQ) for monitoring and diagnosing of mean shifts in multivariate manufacturing processes. In this model, one DPSOSENLVQ is developed for detecting out-of-control signals in process mean, while the other DPSOSENLVQ is developed for further classifying the detected out-of-control signals as one of the specific mean shift types. The experimental result indicates that the proposed MSPC model can not only efficiently monitor the process state but also accurately diagnose the detected out-of-control signals. Empirical comparisons also showed that the proposed MSPC model outperformed other existing approaches in literature. In addition, a case study is conducted to demonstrate how the proposed MSPC model can function as an effective tool for monitoring and diagnosing of mean shifts in multivariate manufacturing processes.", "paper_title": "Monitoring and diagnosing of mean shifts in multivariate manufacturing processes using two-level selective ensemble of learning vector quantization neural networks", "paper_id": "WOS:000358252800011"}