{"auto_keywords": [{"score": 0.05007788003200011, "phrase": "value-added_applications"}, {"score": 0.049668773491620556, "phrase": "vanets"}, {"score": 0.004692227830462433, "phrase": "mobile_networking"}, {"score": 0.004652016085325825, "phrase": "information_processing_technologies"}, {"score": 0.004592340708764929, "phrase": "vehicular_ad_hoc_networks"}, {"score": 0.004494570360108983, "phrase": "traffic_safety"}, {"score": 0.004268293864953256, "phrase": "security_concerns"}, {"score": 0.0038492126993451337, "phrase": "secure_and_privacy-preserving_scheme"}, {"score": 0.00348613030325317, "phrase": "lbs"}, {"score": 0.0034118234596993836, "phrase": "lbs_transaction"}, {"score": 0.00306334226516593, "phrase": "anonymous_way"}, {"score": 0.0028346293790895024, "phrase": "tracing_procedure"}, {"score": 0.0027503564589458837, "phrase": "malicious_vehicle"}, {"score": 0.0024906610581090223, "phrase": "available_infrastructure"}, {"score": 0.0022749744354271816, "phrase": "public-key_cryptosystems"}, {"score": 0.002197801146305747, "phrase": "complicated_certificate_management"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Information security", " Vehicular ad hoc networks", " Conditional privacy"], "paper_abstract": "Advances in mobile networking and information processing technologies have triggered vehicular ad hoc networks (VANETs) for traffic safety and value-added applications. Most efforts have been made to address the security concerns while little work has been done to investigate security and privacy for value-added applications in VANETs. To fill this gap, we propose a secure and privacy-preserving scheme for value-added applications in VANETs; specifically, a vehicular secure and privacy-preserving location-based service (LBS). For each LBS transaction, the scheme provides authentication, integrity and non-repudiation for both the service provider and the vehicle. A vehicle can obtain the service in an anonymous way and hence vehicle privacy is well protected. However, if a vehicle maliciously uses the service, a tracing procedure can be invoked to find the malicious vehicle, thereby efficiently preventing vehicles from abusing the anonymity provided by the system. These features are achieved by efficiently exploiting the available infrastructure of VANETs and without requiring cooperation from other vehicles, which might be reluctant to cooperate or otherwise unavailable. Although public-key cryptosystems are employed as building blocks, no complicated certificate management is required by our system. (C) 2015 Elsevier B.V. All rights reserved.", "paper_title": "Practical secure and privacy-preserving scheme for value-added applications in VANETs", "paper_id": "WOS:000367110400004"}