{"auto_keywords": [{"score": 0.046944515555628855, "phrase": "energy_sink-hole_problem"}, {"score": 0.00481495049065317, "phrase": "energy-aware_voronoi_diagram"}, {"score": 0.004637478829869904, "phrase": "wireless_sensor_networks"}, {"score": 0.004399905285945236, "phrase": "central_gathering_node"}, {"score": 0.004269630481719451, "phrase": "significant_depletion"}, {"score": 0.0039308449157320815, "phrase": "uniform_energy_depletion"}, {"score": 0.0032085525502105836, "phrase": "severe_restriction"}, {"score": 0.003136952589428254, "phrase": "sensor_field"}, {"score": 0.003021141590548526, "phrase": "sensor_deployment_strategy"}, {"score": 0.002987236799291296, "phrase": "energy_heterogeneity"}, {"score": 0.0028553693643045795, "phrase": "simulation_results"}, {"score": 0.0025030316170683575, "phrase": "voronoi"}, {"score": 0.0024014759148123736, "phrase": "similar_greedy_geographical_data"}, {"score": 0.002286781334850213, "phrase": "existing_data_collection_protocol"}, {"score": 0.002252602622785975, "phrase": "joint_mobility"}, {"score": 0.00223570488212345, "phrase": "routing_strategy"}, {"score": 0.0021049977753042253, "phrase": "network_lifetime"}], "paper_keywords": ["wireless sensor networks", " energy sink-hole problem", " energy heterogeneity", " sink mobility", " energy-aware Voronoi diagram"], "paper_abstract": "Static always-on wireless sensor networks (WSNs) are affected by the energy sink-hole problem, where sensors nearer a central gathering node, called the sink, suffer from significant depletion of their battery power ( or energy). It has been shown through analysis and simulation that it is impossible to guarantee uniform energy depletion of all the sensors in static uniformly distributed always-on WSNs with constant data reporting to the sink when the sensors use their nominal communication range to transmit data to the sink. We prove that the energy sink-hole problem can be solved provided that the sensors adjust their communication ranges. This solution, however, imposes a severe restriction on the size of a sensor field. To overcome this limitation, we propose a sensor deployment strategy based on energy heterogeneity with a goal that all the sensors deplete their energy at the same time. Simulation results show that such a deployment strategy helps achieve this goal. To solve the energy sink-hole problem for homogeneous WSNs, we propose a localized energy-aware-Voronoi-diagram-based data forwarding ( EVEN) protocol. EVEN combines sink mobility with a new concept, called energy-aware Voronoi diagram. Through simulations, we show that EVEN outperforms similar greedy geographical data forwarding protocols and has performance that is comparable to that of an existing data collection protocol that uses a joint mobility and routing strategy. Precisely, we find that EVEN yields an improvement of more than 430 percent in terms of network lifetime.", "paper_title": "Promoting heterogeneity, mobility, and energy-aware Voronoi diagram in wireless sensor networks", "paper_id": "WOS:000256088100011"}