{"auto_keywords": [{"score": 0.04944794689879003, "phrase": "directional_transmission"}, {"score": 0.044810297548179744, "phrase": "secondary_network"}, {"score": 0.013163931693706265, "phrase": "secondary_networks"}, {"score": 0.007561379753576375, "phrase": "single_su"}, {"score": 0.007267002943931066, "phrase": "single_secondary_path"}, {"score": 0.004783105609960904, "phrase": "connectivity_of_cognitive_radio_networks"}, {"score": 0.004720043307726269, "phrase": "throughput_scaling_laws"}, {"score": 0.004550856732700044, "phrase": "n_secondary_users"}, {"score": 0.004431616517786392, "phrase": "unit_area"}, {"score": 0.004344232223147987, "phrase": "early_work"}, {"score": 0.003829290275367182, "phrase": "directional_spectrum_opportunities"}, {"score": 0.003375179864844835, "phrase": "omni_reception"}, {"score": 0.003297817336216121, "phrase": "theta"}, {"score": 0.0032004205378150354, "phrase": "throughputwithout_directional_transmission"}, {"score": 0.003054922297665861, "phrase": "throughput_gain"}, {"score": 0.002994602527726632, "phrase": "dtor"}, {"score": 0.00293547027122617, "phrase": "directional_antennas"}, {"score": 0.0027649684074145028, "phrase": "critical_metric"}, {"score": 0.002710358243468008, "phrase": "random_ad_hoc_networks"}, {"score": 0.002587081502365341, "phrase": "pus_m"}, {"score": 0.002461199256106623, "phrase": "hdp-vdp_routing_scheme"}, {"score": 0.002349228457383314, "phrase": "ad_hoc_networks"}, {"score": 0.0021049977753042253, "phrase": "cognitive_radio_ad_hoc_network"}], "paper_keywords": ["Cognitive radio networks", " connectivity", " directional transmission", " spectrum holes", " throughput scaling laws"], "paper_abstract": "Throughput scaling laws for two coexisting ad hoc networks with m primary users (PUs) and n secondary users (SUs) randomly distributed in an unit area have been widely studied. Early work showed that the secondary network performs as well as stand-alone networks, namely, the per-node throughput of the secondary networks is Theta (1/root n log n). In this paper, we show that by exploiting directional spectrum opportunities in secondary network, the throughput of secondary network can be improved. If the beamwidth of secondary transmitter (TX)'s main lobe is delta = o(1/log n), SUs can achieve a per-node throughput of Theta(1/root n log n) for directional transmission and omni reception (DTOR), which is Theta (log n) times higher than the throughputwithout directional transmission. On the contrary, if delta = w(1/log n), the throughput gain of SUs is 2 pi/delta for DTOR compared with the throughput without directional antennas. Similarly, we have derived the throughput for other cases of directional transmission. The connectivity is another critical metric to evaluate the performance of random ad hoc networks. The relation between the number of SUs n and the number of PUs m is assumed to be n = m(beta). We show that with the HDP-VDP routing scheme, which is widely employed in the analysis of throughput scaling laws of ad hoc networks, the connectivity of a single SU can be guaranteed when beta>1, and the connectivity of a single secondary path can be guaranteed when beta>2. While circumventing routing can improve the connectivity of cognitive radio ad hoc network, we verify that the connectivity of a single SU as well as a single secondary path can be guaranteed when beta > 1. Thus, to achieve the connectivity of secondary networks, the density of SUs should be (asymptotically) bigger than that of PUs.", "paper_title": "The Asymptotic Throughput and Connectivity of Cognitive Radio Networks with Directional Transmission", "paper_id": "WOS:000337726100015"}