{"auto_keywords": [{"score": 0.04854250213020111, "phrase": "assessment_grades"}, {"score": 0.021439524986359922, "phrase": "interval_difference"}, {"score": 0.01631249151530947, "phrase": "potentially_optimal_alternatives"}, {"score": 0.010612387000973441, "phrase": "based_evidential_reasoning_approach"}, {"score": 0.01049831138592189, "phrase": "unknown_attribute_weights"}, {"score": 0.006770684786671606, "phrase": "optimized_intervals"}, {"score": 0.004112582094962078, "phrase": "multiple_attribute_decision"}, {"score": 0.003236941658990869, "phrase": "potentially_optimal_alternative"}, {"score": 0.003167217223469026, "phrase": "optimization_problems"}, {"score": 0.003032228032253871, "phrase": "attribute_weights"}, {"score": 0.0024386325347607674, "phrase": "complete_rank-order"}, {"score": 0.0022967713922705, "phrase": "six_executive_cars"}, {"score": 0.002235040467016128, "phrase": "proposed_approach"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Decision analysis", " Multiple attribute decision making", " Evidential reasoning", " Unknown attribute weights and utilities of assessment grades", " Interval difference"], "paper_abstract": "In this paper, the concept of interval difference is firstly defined. Then, an interval difference based evidential reasoning approach is proposed to analyze multiple attribute decision making problems in three situations, including (1) unknown attribute weights and utilities of assessment grades, (2) unknown attribute weights, and (3) unknown utilities of assessment grades. Three optimization models are constructed to identify potentially optimal alternatives in the three situations. For each potentially optimal alternative, three pairs of optimization problems are constructed to generate the optimized intervals of attribute weights and utilities of assessment grades or one of them. By using the optimized intervals, the interval difference of potentially optimal alternatives is calculated and used to generate their rank-order. This process is repeated until all alternatives are identified as potentially optimal alternatives. A complete rank-order of all alternatives is then generated. The performance of six executive cars is assessed using the proposed approach to demonstrate its applicability and validity. (C) 2015 Elsevier Ltd. All rights reserved.", "paper_title": "An interval difference based evidential reasoning approach with unknown attribute weights and utilities of assessment grades", "paper_id": "WOS:000350778100010"}