{"auto_keywords": [{"score": 0.04260087512471619, "phrase": "consensus_framework"}, {"score": 0.010501691786971683, "phrase": "evidential_reasoning_context"}, {"score": 0.0073736514769076845, "phrase": "missing_attributes"}, {"score": 0.006995776275457646, "phrase": "feedback_mechanism"}, {"score": 0.00481495049065317, "phrase": "multiple_attribute_group_decision_analysis"}, {"score": 0.004714448392640623, "phrase": "group_decision_analysis"}, {"score": 0.004242411872706126, "phrase": "unauthentic_change"}, {"score": 0.004183137595671171, "phrase": "experts'_assessments"}, {"score": 0.0037773674108196376, "phrase": "missing_assessments"}, {"score": 0.0037508743235608872, "phrase": "specific_attributes"}, {"score": 0.0033631279928072345, "phrase": "maximal_consensus"}, {"score": 0.003316098012193133, "phrase": "group_discussion_help_experts"}, {"score": 0.0032812562034088646, "phrase": "effective_assessments"}, {"score": 0.0030153435879168634, "phrase": "identification_rules"}, {"score": 0.0028601736602156033, "phrase": "suggestion_rule"}, {"score": 0.0027514668612638074, "phrase": "specific_experts"}, {"score": 0.002628295539850913, "phrase": "appropriate_recommendations"}, {"score": 0.00247548600804924, "phrase": "recommendation_generating"}, {"score": 0.0024236964502593254, "phrase": "optimization_algorithms"}, {"score": 0.0023480317852018133, "phrase": "subjective_weights"}, {"score": 0.0022507989506447413, "phrase": "engineering_project_management_software_selection_problem"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Multiple attribute group decision analysis", " Evidential reasoning approach", " Consensus framework", " Missing assessment", " Feedback mechanism", " Optimization algorithm"], "paper_abstract": "In group decision analysis, consensus has usually been reached by one of two strategies, modifying assessments of experts and adjusting weights of experts. Due to lack of attention paid to the unauthentic change and neglect of experts' assessments, respectively, this paper develops a consensus framework to combine them. The consensus framework is implemented in an evidential reasoning context. It can deal effectively with the situation of missing assessments on specific attributes (the attributes are called missing attributes), which may be caused by lack or limitation of knowledge, experience, and available data about the problem domain. The recommendations generated based on the idea of reaching the maximal consensus on missing attributes and group discussion help experts to give effective assessments on missing attributes. Furthermore, the consensus framework contains a feedback mechanism to provide guidance for experts in order to accelerate convergence to consensus. Identification rules at three levels, including the attribute, alternative and global levels, and a suggestion rule are involved in the feedback mechanism. The former indicates that specific experts are recommended to renew their identified assessments damaging consensus, and the latter generates appropriate recommendations for the experts to renew their assessments. If consensus is still not reached after two consecutive rounds of recommendation generating and assessment renewing, then optimization algorithms still constructed at three levels are used to adjust subjective weights of experts so as to facilitate convergence to consensus. An engineering project management software selection problem is solved by the consensus framework to demonstrate its detailed implementation process, validity, and applicability. (C) 2011 Elsevier B.V. All rights reserved.", "paper_title": "A consensus framework for multiple attribute group decision analysis in an evidential reasoning context", "paper_id": "WOS:000328527200005"}