{"auto_keywords": [{"score": 0.048140506081445586, "phrase": "genomic_data"}, {"score": 0.008146243875485999, "phrase": "breast_cancer"}, {"score": 0.005414148706357249, "phrase": "clinical_data"}, {"score": 0.00481495049065317, "phrase": "genomic_information"}, {"score": 0.004778923541463994, "phrase": "personalized_cancer_therapy"}, {"score": 0.004466519142879166, "phrase": "methods_female_patients"}, {"score": 0.003916098498242888, "phrase": "significant_concerns"}, {"score": 0.003771631577951067, "phrase": "insurance_discrimination"}, {"score": 0.003743381699791, "phrase": "employment_discrimination"}, {"score": 0.003459191419478298, "phrase": "government_agencies"}, {"score": 0.0034332736827447654, "phrase": "drug_companies"}, {"score": 0.003136952589428254, "phrase": "personal_identity"}, {"score": 0.003066945490483524, "phrase": "billing_and_insurance_information"}, {"score": 0.002719055901632759, "phrase": "direct_benefit"}, {"score": 0.0025892330566358503, "phrase": "identified_data"}, {"score": 0.002392453087295389, "phrase": "dna_banking"}, {"score": 0.0023214774334744713, "phrase": "indiscriminate_release"}, {"score": 0.002161216637621284, "phrase": "specific_predictors"}, {"score": 0.0021450029487459403, "phrase": "privacy_concerns"}, {"score": 0.002128910637262527, "phrase": "conclusions_patients"}, {"score": 0.0021049977753042253, "phrase": "low_levels"}], "paper_keywords": [""], "paper_abstract": "Objective To evaluate attitudes regarding privacy of genomic data in a sample of patients with breast cancer. Methods Female patients with breast cancer (n=100) completed a questionnaire assessing attitudes regarding concerns about privacy of genomic data. Results Most patients (83%) indicated that genomic data should be protected. However, only 13% had significant concerns regarding privacy of such data. Patients expressed more concern about insurance discrimination than employment discrimination (43% vs 28%, p<0.001). They expressed less concern about research institutions protecting the security of their molecular data than government agencies or drug companies (20% vs 38% vs 44%; p<0.001). Most did not express concern regarding the association of their genomic data with their name and personal identity (49% concerned), billing and insurance information (44% concerned), or clinical data (27% concerned). Significantly fewer patients were concerned about the association with clinical data than other data types (p<0.001). In the absence of direct benefit, patients were more willing to consent to sharing of deidentified than identified data with researchers not involved in their care (76% vs 60%; p<0.001). Most (85%) patients were willing to consent to DNA banking. Discussion While patients are opposed to indiscriminate release of genomic data, privacy does not appear to be their primary concern. Furthermore, we did not find any specific predictors of privacy concerns. Conclusions Patients generally expressed low levels of concern regarding privacy of genomic data, and many expressed willingness to consent to sharing their genomic data with researchers.", "paper_title": "Attitudes regarding privacy of genomic information in personalized cancer therapy", "paper_id": "WOS:000341858100020"}