{"auto_keywords": [{"score": 0.009866836825131734, "phrase": "current_sample"}, {"score": 0.007854113660179808, "phrase": "approximation_accuracy"}, {"score": 0.004654928974748418, "phrase": "novel_scheme"}, {"score": 0.004449772140968921, "phrase": "segmented_training_volumetric_images"}, {"score": 0.004318027255281003, "phrase": "deformable_model_algorithm"}, {"score": 0.003659890662429693, "phrase": "single_template"}, {"score": 0.0036052633308076933, "phrase": "accurate_approximations"}, {"score": 0.0035248419365839856, "phrase": "proposed_solution"}, {"score": 0.003446208270665051, "phrase": "template_sample"}, {"score": 0.003125175084962886, "phrase": "\"bridge\"_sample"}, {"score": 0.002708857011668258, "phrase": "pdm"}, {"score": 0.002628506002255396, "phrase": "template's_approximations"}, {"score": 0.0024196235355517827, "phrase": "considerable_improvement"}, {"score": 0.0023214774334744713, "phrase": "arbitrary_templates"}, {"score": 0.002218933616777076, "phrase": "major_concern"}, {"score": 0.0021940118003312397, "phrase": "deformable_model-based_approaches"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Point Distribution Model Construction", " automatic landmarking", " Active Shape Model"], "paper_abstract": "This paper describes a novel scheme to build a 3D Point Distribution Model (PDM) from a set of segmented training volumetric images. This approach is based on a deformable model algorithm to find correspondences across a set of surfaces/samples. It selects one sample as the template, and then deforms the template to approximate all other samples. These approximations carry the correspondences from the template to all other samples. The challenge is that a single template cannot guarantee accurate approximations to all other samples. The proposed solution is first to select the template sample, which brings the most accurate approximations to others among all samples. For each sample, which is not approximated accurately by the template, a \"bridge\" sample is chosen so that the bridge approximates accurately the current sample and the template approximates accurately to the bridge. The correspondences are then carried over from the template to the current sample via the \"bridge\". A PDM is then constructed from the set of template's approximations to all samples. This method is applied to construct four PDMs from 3D human brain Magnetic Resonance Images (MRIs). The four 3D PDMs constructed show considerable improvement on the approximation accuracy as compared to that constructed by adapting arbitrary templates. This improvement is important, as the approximation accuracy is the major concern of the deformable model-based approaches for the construction of PDMs. (c) 2007 Elsevier B.V. All rights reserved.", "paper_title": "A new scheme for automated 3D PDM construction using deformable models", "paper_id": "WOS:000251849500011"}