{"auto_keywords": [{"score": 0.047842730173647, "phrase": "bioassay"}, {"score": 0.004717325943509345, "phrase": "molecular_dynamics-augmented_modeling"}, {"score": 0.00422899036681456, "phrase": "potential_therapeutic_target"}, {"score": 0.0040591367766929344, "phrase": "present_study"}, {"score": 0.0038431888954930083, "phrase": "molecular_docking"}, {"score": 0.0037910145286595386, "phrase": "molecular_dynamics"}, {"score": 0.003613899384402803, "phrase": "free_energy_calculations"}, {"score": 0.003540539868937462, "phrase": "finally_validation"}, {"score": 0.003239418275717787, "phrase": "specs_database"}, {"score": 0.0026384167183586015, "phrase": "md_simulations"}, {"score": 0.002567180189640976, "phrase": "intermolecular_interactions"}, {"score": 0.0023973704289918726, "phrase": "hit_rate"}, {"score": 0.002300912218086077, "phrase": "effective_and_efficient_integrated_procedures"}], "paper_keywords": [""], "paper_abstract": "Phosphodiesterase-4D (PDE4D) has been proved to be a potential therapeutic target against strokes. In the present study, a procedure of integrating pharmacophore, molecular docking, molecular dynamics (MD) simulations, binding free energy calculations, and finally validation with bioassay was developed and described to search for novel PDE4D inhibitors from the SPECS database. Among the 29 compounds selected by our MD augmented strategy, 15 hits were found with IC50 between 1.9 and 50 mu M (a hit rate of 52%) and 6 potent hits showed IC50 less than 10 mu M, which suggested that MD simulations can explore the intermolecular interactions of PDE4D-inhibitor complexes more precisely and thus significantly enhanced the hit rate of this screening. The effective and efficient integrated procedures described in this study could be readily applied to screening studies toward other drug targets.", "paper_title": "Identification of Novel Phosphodiesterase-4D Inhibitors Prescreened by Molecular Dynamics-Augmented Modeling and Validated by Bioassay", "paper_id": "WOS:000318060200022"}