{"auto_keywords": [{"score": 0.031713691038454055, "phrase": "interface_zone"}, {"score": 0.029565660398204362, "phrase": "fuel_treatment"}, {"score": 0.00481495049065317, "phrase": "wildfire_risk"}, {"score": 0.004778594263962987, "phrase": "urban_developments"}, {"score": 0.004724571550328985, "phrase": "cost-effective_fuel_treatment_solutions"}, {"score": 0.004653663304685966, "phrase": "australia"}, {"score": 0.004548848077202625, "phrase": "significant_economic_and_social_losses"}, {"score": 0.004396267325338022, "phrase": "fuel_loads"}, {"score": 0.004330099613414957, "phrase": "future_fire_risk"}, {"score": 0.004232702713825967, "phrase": "fuel_treatments"}, {"score": 0.004013843843250455, "phrase": "prescribed_burns"}, {"score": 0.003908678575537341, "phrase": "house_loss"}, {"score": 0.0035415392642831616, "phrase": "bayesian_network"}, {"score": 0.0034881908940439213, "phrase": "relative_reduction"}, {"score": 0.0031604223680801774, "phrase": "management_treatments"}, {"score": 0.002951673109860487, "phrase": "greatest_reduction"}, {"score": 0.0027151161550531206, "phrase": "direct_transfer"}, {"score": 0.0021617392821644005, "phrase": "crown_copyright"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Bayesian Network", " Prescribed fire", " Interface", " Fire management"], "paper_abstract": "Wildfires can result in significant economic and social losses. Prescribed fire is commonly applied to reduce fuel loads and thereby decrease future fire risk to life and property. Fuel treatments can occur in the landscape or adjacent to houses. Location of the prescribed burns can significantly alter the risk of house loss. Furthermore the cost of treating fuels in the landscape is far cheaper than treating fuels adjacent to the houses. Here we develop a Bayesian Network to examine the relative reduction in risk that can be achieved by prescribed burning in the landscape compared with a 500 m interface zone adjacent to houses. We then compare costs of management treatments to determine the most cost-effective method of reducing risk to houses. Burning in the interface zone resulted in the greatest reduction in risk of fires reaching the houses and the intensity of these fires. Fuel treatment in the interface zone allows for a direct transfer of benefits from the fuel treatment. Costs of treating fuels in the interface were significantly higher on a per hectare basis, but the extent of area requiring treatment was considerably lower. Results of this study demonstrate that treatment of fuels at the interface is not only the best means of reducing risk, it is also the most cost-effective. Crown Copyright (C) 2013 Published by Elsevier Ltd. All rights reserved.", "paper_title": "Reducing wildfire risk to urban developments: Simulation of cost-effective fuel treatment solutions in south eastern Australia", "paper_id": "WOS:000346751700014"}