{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "social_features"}, {"score": 0.004987411827299388, "phrase": "profile_information"}, {"score": 0.004777034835192062, "phrase": "information_portals"}, {"score": 0.004702092660370367, "phrase": "new_member_engagement"}, {"score": 0.00468175746320433, "phrase": "significant_effect"}, {"score": 0.004644885750004937, "phrase": "social_emphasis"}, {"score": 0.00450198136261303, "phrase": "overall_user_experience"}, {"score": 0.0037087324991876727, "phrase": "users'_response"}, {"score": 0.0034537189001268113, "phrase": "portal's_social_features"}, {"score": 0.0032546105164772995, "phrase": "receivers'_responsiveness"}, {"score": 0.003153140905312787, "phrase": "social_benefits"}, {"score": 0.002971309306027602, "phrase": "initial_welcome_page"}, {"score": 0.0025159206854716274, "phrase": "social_manner"}, {"score": 0.0022517100995552443, "phrase": "online_contexts"}, {"score": 0.0022339335462778437, "phrase": "social_activity"}, {"score": 0.002207530926563892, "phrase": "increasingly_common_feature"}, {"score": 0.0021049977753042253, "phrase": "optimal_presentation_strategy"}], "paper_keywords": [""], "paper_abstract": "Many information portals are adding social features with hopes of enhancing the overall user experience. Invitations to join and welcome pages that highlight these social features are expected to encourage use and participation. While this approach is widespread and seems plausible, the effect of providing and highlighting social features remains to be tested. We studied the effects of emphasizing social features on users' response to invitations, their decisions to join, their willingness to provide profile information, and their engagement with the portal's social features. The results of a quasi-experiment found no significant effect of social emphasis in invitations on receivers' responsiveness. However, users receiving invitations highlighting social benefits were less likely to join the portal and provide profile information. Social emphasis in the initial welcome page for the site also was found to have a significant effect on whether individuals joined the portal, how much profile information they provided and shared, and how much they engaged with social features on the site. Unexpectedly, users who were welcomed in a social manner were less likely to join and provided less profile information; they also were less likely to engage with social features of the portal. This suggests that even in online contexts where social activity is an increasingly common feature, highlighting the presence of social features may not always be the optimal presentation strategy.", "paper_title": "Emphasizing Social Features in Information Portals: Effects on New Member Engagement", "paper_id": "WOS:000296453900003"}