{"auto_keywords": [{"score": 0.037628673760913146, "phrase": "cco"}, {"score": 0.007959366010651902, "phrase": "cell_cycle"}, {"score": 0.00481495049065317, "phrase": "cell_cycle_ontology"}, {"score": 0.0045820747375409435, "phrase": "'one_stop_shop"}, {"score": 0.003948613642680196, "phrase": "cell_division"}, {"score": 0.003516898780234098, "phrase": "large_amount"}, {"score": 0.003459191419478298, "phrase": "diverse_sources"}, {"score": 0.003132236287543072, "phrase": "continued_expansion"}, {"score": 0.0031064226956732497, "phrase": "biological_knowledge"}, {"score": 0.0028127163745564777, "phrase": "input_data"}, {"score": 0.0026107601878587816, "phrase": "new_knowledge"}, {"score": 0.00255727386763536, "phrase": "design_patterns"}, {"score": 0.0025257084375034764, "phrase": "cco."}, {"score": 0.002504880563070155, "phrase": "automatic_process"}, {"score": 0.0022773309395419427, "phrase": "existing_toolsets"}], "paper_keywords": ["Bio-ontology", " knowledge management", " cell cycle", " utility", " flexibility", " OWL", " OBO", " standardisation"], "paper_abstract": "The Cell Cycle Ontology (CCO) has the aim to provide a 'one stop shop' for scientists interested in the biology of the cell cycle that would like to ask questions from a molecular and/or systems perspective: what are the genes, proteins, and so on involved in the regulation of cell division? How do they interact to produce the effects observed in the regulation of the cell cycle? To answer these questions, the CCO must integrate a large amount of knowledge from diverse sources; the irregularity and incompleteness of this information suggests an ontology can act as the means of this integration. The volatility and continued expansion of biological knowledge means the content and modelling of the CCO will have to be frequently changed and updated. The CCO is generated from the input data automatically once every two months. This makes it easy to change the representation to enable certain queries; incorporate new knowledge; and consistently apply design patterns across the CCO. The automatic process also allows the CCO to be delivered in a variety of representations that suit the needs of various CCO customers and the abilities of existing toolsets. In this paper we present the CCO and its characteristics of utility and flexibility, that, from our perspective, make it a beautiful ontology.", "paper_title": "Flexibility and utility of the cell cycle ontology", "paper_id": "WOS:000298743500004"}