{"auto_keywords": [{"score": 0.039074328805703634, "phrase": "tzw"}, {"score": 0.010497811543865455, "phrase": "label_frequency"}, {"score": 0.00712262902317904, "phrase": "tie_zone"}, {"score": 0.00481495049065317, "phrase": "tie-zone_watershed"}, {"score": 0.004223521213460728, "phrase": "multiple_solutions"}, {"score": 0.0039268117782861696, "phrase": "image_foresting_transform"}, {"score": 0.003786337629480068, "phrase": "minimum_path-costs"}, {"score": 0.003745179888113379, "phrase": "recently_introduced_tie-zone_watershed"}, {"score": 0.0035980453088879393, "phrase": "arbitrary_implementation_choices"}, {"score": 0.0034315678891900184, "phrase": "possible_solutions"}, {"score": 0.0033942533792009687, "phrase": "watershed_transform"}, {"score": 0.003308751289007707, "phrase": "catchment_basins"}, {"score": 0.0029985954225814895, "phrase": "possible_large_tie_zones"}, {"score": 0.0029444248503861167, "phrase": "segmentation_applications"}, {"score": 0.0028807066376546502, "phrase": "special_thinning"}, {"score": 0.0027978827655799495, "phrase": "unique_solution"}, {"score": 0.0024625698287060586, "phrase": "segmented_region_connectivity"}, {"score": 0.0023485057246680854, "phrase": "immersion-like_recursive_formula"}, {"score": 0.0023229408675543147, "phrase": "proposed_fragmented_drop_paradigm"}, {"score": 0.0022397131088479514, "phrase": "ift_framework"}, {"score": 0.0021204172495922513, "phrase": "explicit_calculation"}], "paper_keywords": ["watershed", " image segmentation", " mathematical morphology", " graph"], "paper_abstract": "There are many watershed transform algorithms in literature but most of them do not exactly correspond to their respective definition. The solution given by such algorithms depends on their implementation. Others fit with their definition which allows multiple solutions. The solution chosen by such algorithms depends on their implementation too. It is the case of the watershed by image foresting transform that consists in building a forest of trees with minimum path-costs. The recently introduced tie-zone watershed (TZW) has the advantage of not depending on arbitrary implementation choices: it provides a unique and, thereby, unbiased solution. Indeed, the TZW considers all possible solutions of the watershed transform and keeps only the common parts of them as catchment basins whereas parts that differ form a tie zone disputed by many solutions. Although the TZW insures the uniqueness of the solution, it does not prevent from possible large tie zones, sometimes unwanted in segmentation applications. This paper presents a special thinning of the tie zone that leads to a unique solution. Observing all the possible solutions of the watershed by image foresting transform, one can deduce the frequency of the labels associated with each pixel. The thinning consists in assigning the most frequent label while preserving the segmented region connectivity. We demonstrate that the label frequency can be computed both from an immersion-like recursive formula and the proposed fragmented drop paradigm. Finally, we propose an algorithm under the IFT framework that computes the TZW, the label frequency and the thinning simultaneously and without explicit calculation of all the watershed solutions.", "paper_title": "Uniquely-determined thinning of the tie-zone watershed based on label frequency", "paper_id": "WOS:000246554900005"}