{"auto_keywords": [{"score": 0.043960221020330516, "phrase": "traffic_engineer"}, {"score": 0.042347347931893105, "phrase": "content_distribution_systems"}, {"score": 0.00481495049065317, "phrase": "traffic_engineering_with_semiautonomous"}, {"score": 0.004411588377842043, "phrase": "traffic_engineering"}, {"score": 0.0040027552011993005, "phrase": "overlay_networks"}, {"score": 0.003527181559366122, "phrase": "application_level"}, {"score": 0.0032471155306148156, "phrase": "traffic_engineer's_decisions"}, {"score": 0.0031383410838018984, "phrase": "intended_traffic"}, {"score": 0.0030628762739398855, "phrase": "game-theoretic_framework"}, {"score": 0.003018468582368033, "phrase": "infinitesimal_users"}, {"score": 0.002297949552105756, "phrase": "efficiency_loss"}, {"score": 0.002125612498781805, "phrase": "general_overlay_networks"}, {"score": 0.0021049977753042253, "phrase": "multiple_autonomous_systems"}], "paper_keywords": ["Content distribution networks (CDNs)", " game theory", " traffic engineering"], "paper_abstract": "In this paper, we explore the interaction between traffic engineering and the users of a network. Because a traffic engineer may be unaware of the structure of content distribution systems or overlay networks, his management of the network does not fully anticipate how traffic might change as a result of his actions. Content distribution systems that assign servers at the application level can respond very rapidly to changes in the routing of the network. Consequently, the traffic engineer's decisions may not be applied to the intended traffic. We use a game-theoretic framework in which infinitesimal users of a network select the source of content, and the traffic engineer decides how the traffic will route through the network. We formulate a game and prove the existence of equilibria. Additionally, we present a setting in which equilibria are socially optimal, essentially unique, and stable. Conditions under which efficiency loss may be bounded are presented, and the results are extended to the cases of general overlay networks and multiple autonomous systems.", "paper_title": "Traffic Engineering With Semiautonomous Users: A Game-Theoretic Perspective", "paper_id": "WOS:000313661000020"}