{"auto_keywords": [{"score": 0.04833876993829395, "phrase": "molecular_mechanics"}, {"score": 0.04814996942162455, "phrase": "poisson-boltzmann"}, {"score": 0.03621253559018871, "phrase": "specific_fullerene_derivatives"}, {"score": 0.00481495049065317, "phrase": "novel_fullerene_inhibitors"}, {"score": 0.004678384952779725, "phrase": "molecular_dynamics"}, {"score": 0.00430907756010007, "phrase": "novel_fullerene-based_inhibitors"}, {"score": 0.003746673633703251, "phrase": "observed_exceptionally_high_binding_free_energies"}, {"score": 0.0035515148917169173, "phrase": "hydrogen_bonding"}, {"score": 0.003230723298995081, "phrase": "significant_role"}, {"score": 0.0029876282026237207, "phrase": "binding_free_energy"}, {"score": 0.0027514186391258263, "phrase": "docking_technique"}, {"score": 0.00245168871716047, "phrase": "experimental_results"}, {"score": 0.0023819914954155905, "phrase": "drug_candidates"}, {"score": 0.002193559776999383, "phrase": "important_protein-ligand_interaction_patterns"}], "paper_keywords": ["HIV-1 PR", " QSAR", " Molecular dynamics", " MM-PBSA", " Fullerenes"], "paper_abstract": "The objectives of this study include the design of a series of novel fullerene-based inhibitors for HIV-1 protease (HIV-1 PR), by employing two strategies that can also be applied to the design of inhibitors for any other target. Additionally, the interactions which contribute to the observed exceptionally high binding free energies were analyzed. In particular, we investigated: (1) hydrogen bonding (H-bond) interactions between specific fullerene derivatives and the protease, (2) the regions of HIV-1 PR that play a significant role in binding, (3) protease changes upon binding and (4) various contributions to the binding free energy, in order to identify the most significant of them. This study has been performed by employing a docking technique, two 3D-QSAR models, molecular dynamics (MD) simulations and the molecular mechanics Poisson-Boltzmann surface area (MM-PBSA) method. Our computed binding free energies are in satisfactory agreement with the experimental results. The suitability of specific fullerene derivatives as drug candidates was further enhanced, after ADMET (absorption, distribution, metabolism, excretion and toxicity) properties have been estimated to be promising. The outcomes of this study revealed important protein-ligand interaction patterns that may lead towards the development of novel, potent HIV-1 PR inhibitors.", "paper_title": "Binding of novel fullerene inhibitors to HIV-1 protease: insight through molecular dynamics and molecular mechanics Poisson-Boltzmann surface area calculations", "paper_id": "WOS:000297132500005"}