{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "relative_contribution_ratios"}, {"score": 0.006935077348909948, "phrase": "proprioceptive_sensations"}, {"score": 0.0046491050101721545, "phrase": "perception_of_force_applied"}, {"score": 0.003980400251874277, "phrase": "decoupled_forces"}, {"score": 0.0038819041309353024, "phrase": "finger_pad"}, {"score": 0.0038431888954930083, "phrase": "proximal_interphalangeal_joint"}, {"score": 0.003785836059995376, "phrase": "index_finger"}, {"score": 0.003511613254403125, "phrase": "subjective_equality"}, {"score": 0.003407549468745519, "phrase": "proprioceptive_perceptions"}, {"score": 0.003306559295382181, "phrase": "discrimination_limens"}, {"score": 0.0030823667846259836, "phrase": "good_agreement"}, {"score": 0.0021049977753042253, "phrase": "efficient_haptic_interfaces"}], "paper_keywords": ["Skin stretch", " sensory integration", " force perception"], "paper_abstract": "Humans perceive a force applied to their fingertips by integrating skin and proprioceptive sensations. In this study, we investigated the relative contribution ratios of these sensations using two approaches. Decoupled forces were applied to the finger pad and proximal interphalangeal joint of the index finger of the participants. First, we calculated the ratios from the point of subjective equality between the skin and the proprioceptive perceptions. Second, we obtained discrimination limens of the two perceptions to compute their contribution ratios. The results of these two approaches showed good agreement. Additionally, we investigated how the magnitudes of forces, which were 1.0 and 0.3 N, applied to a fingertip affect the relative contribution ratios of the two sensory channels. When humans perceived the force of 1.0 N, the relative contribution ratios of skin and proprioceptive sensations were 16-28 and 72-84 percent, respectively. In contrast, when humans perceived the force of 0.3 N, the relative contribution ratios were 37-55 and 45-63 percent, respectively. These relative contribution ratios can be utilized for the design of efficient haptic interfaces.", "paper_title": "Relative Contribution Ratios of Skin and Proprioceptive Sensations in Perception of Force Applied to Fingertip", "paper_id": "WOS:000336913100009"}