{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "fixed_lifetime_products"}, {"score": 0.04426252329364738, "phrase": "decentralized_model"}, {"score": 0.03144912834280803, "phrase": "proposed_delay"}, {"score": 0.004054169947971483, "phrase": "supply_chain"}, {"score": 0.003348513474852869, "phrase": "unlimited_lifetime"}, {"score": 0.003161740194257218, "phrase": "fixed_and_limited_lifetime"}, {"score": 0.002887028262617443, "phrase": "centralized_decision-making_problem"}, {"score": 0.002778604641920052, "phrase": "common_decision-maker"}, {"score": 0.002661474607275484, "phrase": "analytically_tractable_solutions"}, {"score": 0.002623536040408411, "phrase": "proposed_models"}, {"score": 0.0024417832296664698, "phrase": "centralized_model"}, {"score": 0.002372649454733249, "phrase": "buyer's_costs"}, {"score": 0.0022944576894161485, "phrase": "detailed_numerical_example"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Supply chain management", " Delay in payments", " Fixed lifetime products", " Coordination"], "paper_abstract": "In this paper, a single-vendor, single-buyer supply chain system for fixed lifetime products is considered in the settings of both decentralized and centralized models. In the decentralized model, the vendor is the decision-maker of the supply chain. In particular, we study the coordination between the vendor and the buyer that allows the buyer to delay his payment in compensation for altering his order size. This policy has been studied in the literature for the products with unlimited lifetime. In this paper, we focus on the products with fixed and limited lifetime which is common in practice. To evaluate the efficiency of the proposed delay in payments policy, a centralized decision-making problem is modeled, where there is a common decision-maker for both the vendor and the buyer. We derive analytically tractable solutions to the proposed models. Furthermore, we prove that the decentralized model can achieve the same minimal cost as the centralized model when the vendor and the buyer's costs of capital are equal. A detailed numerical example is presented to illustrate the benefit of the proposed delay in payments policy. (C) 2012 Elsevier Ltd. All rights reserved.", "paper_title": "Two level supply chain coordination with delay in payments for fixed lifetime products", "paper_id": "WOS:000305869900012"}