{"auto_keywords": [{"score": 0.045246503441499546, "phrase": "india"}, {"score": 0.00481495049065317, "phrase": "information_usage"}, {"score": 0.004688989566904871, "phrase": "exploratory_study"}, {"score": 0.004627244470096107, "phrase": "design_engineers"}, {"score": 0.004586531354697466, "phrase": "technical_professionals"}, {"score": 0.004407690586271672, "phrase": "innovative_high-tech_firms"}, {"score": 0.0040347380310668994, "phrase": "naturalistic_observation"}, {"score": 0.003929107176349023, "phrase": "daylong_workplace_observations"}, {"score": 0.0038431888954930083, "phrase": "product_design"}, {"score": 0.0034714553759044664, "phrase": "information_event"}, {"score": 0.003306559295382181, "phrase": "previous_research"}, {"score": 0.0031774686451753477, "phrase": "significant_change"}, {"score": 0.003135564707433078, "phrase": "information_environment"}, {"score": 0.003107935254560724, "phrase": "corporate_expectations"}, {"score": 0.0029733865110222785, "phrase": "original_study"}, {"score": 0.0029471818883482688, "phrase": "searching_technology"}, {"score": 0.002721464488351771, "phrase": "primary_source"}, {"score": 0.0024579623598183355, "phrase": "engineering_workplace"}, {"score": 0.0021712920081029194, "phrase": "better_job_performance"}, {"score": 0.0021049977753042253, "phrase": "economic_growth"}], "paper_keywords": [""], "paper_abstract": "This exploratory study examines how design engineers and technical professionals (hereafter referred to as engineers) in innovative high-tech firms in the United States and India use information in their daily work activities including research, development, and management. The researchers used naturalistic observation to conduct a series of daylong workplace observations with 103 engineers engaged in product design and testing in four U.S.- and two India-based firms. A key finding is that engineers spend about one fourth of their day engaged in some type of information event, which was somewhat lower than the percentage identified in previous research. The explanation may be rooted in the significant change in the information environment and corporate expectations in the last 15 years, which is the time of the original study. Searching technology has improved, making searching less time consuming, and engineers are choosing the Internet as a primary source even though information may not be as focused, as timely, or as authoritative. The study extends our understanding of the engineering workplace, and the information environment in the workplace, and provides information useful for improving methods for accessing and using information, which could ultimately lead to better job performance, facilitate innovation, and encourage economic growth.", "paper_title": "Design Engineers and Technical Professionals at Work: Observing Information Usage in the Workplace", "paper_id": "WOS:000263935100003"}