{"auto_keywords": [{"score": 0.049390246951185, "phrase": "shell_structure"}, {"score": 0.010612387000973441, "phrase": "shape_design_optimization"}, {"score": 0.010236831761311795, "phrase": "general_platform"}, {"score": 0.007186888701127447, "phrase": "parametric_solid_modeling"}, {"score": 0.003681945316517491, "phrase": "api"}, {"score": 0.0031845067058084583, "phrase": "cad_system"}, {"score": 0.002897710777957041, "phrase": "shape_modification"}, {"score": 0.0027741761880779535, "phrase": "design_variables"}, {"score": 0.002655894070657161, "phrase": "seamless_integration"}, {"score": 0.0025611773887867255, "phrase": "finite-element_modeling"}, {"score": 0.0023817332409567403, "phrase": "integrated_procedures"}, {"score": 0.002347378595930709, "phrase": "finite-element_analysis"}, {"score": 0.0022148335975074904, "phrase": "parameterized_shape"}, {"score": 0.0021049977753042253, "phrase": "numerical_examples"}], "paper_keywords": ["CAD", " CAE integration", " shape optimization", " shell structure", " parameterized surface modeling"], "paper_abstract": "A general platform built on a computer-aided design (CAD) system is developed for parameterized shape design optimization of shell structure. Within the platform, parameterized surface modeling and computer-aided engineering (CAE) applications are embedded and seamlessly integrated with the CAD system through its application programming interface (API). Firstly, instead of the CAD system inherent surface modeling, a parameterized surface modeling for shell structure is fulfilled through integrating with parametric solid modeling of the CAD system. Thus, any dimensions for parametric solid modeling can be used to control shape modification of shell structure and serve as design variables for shape design optimization. Secondly, seamless integration of geometry modeling and finite-element modeling for shell structure is implemented. Finally, with integrated procedures of finite-element analysis and optimization algorithms, a general platform for parameterized shape optimization of shell structure is realized. Numerical examples are presented, and the results validate the effectiveness and efficiency of the platform.", "paper_title": "An open platform of shape design optimization for shell structure", "paper_id": "WOS:000255415000011"}