{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "feature_selection"}, {"score": 0.004692980391580608, "phrase": "qsar._feature_selection"}, {"score": 0.004621279527317074, "phrase": "important_part"}, {"score": 0.004574085781766281, "phrase": "contemporary_qsar_analysis"}, {"score": 0.004481132747216135, "phrase": "recently_published_paper"}, {"score": 0.004322967486451877, "phrase": "different_feature_selection_methods"}, {"score": 0.004256895619944631, "phrase": "large_number"}, {"score": 0.004191829338769843, "phrase": "silico_experiments"}, {"score": 0.004127753467337283, "phrase": "real_qsar_datasets"}, {"score": 0.004023120753104693, "phrase": "interesting_question"}, {"score": 0.0036303546926971966, "phrase": "high_prediction_accuracy"}, {"score": 0.0034485432592912917, "phrase": "previous_investigation"}, {"score": 0.003143849342926373, "phrase": "eight_learners"}, {"score": 0.0027646829399573434, "phrase": "empirical_investigation"}, {"score": 0.0023694065215394593, "phrase": "prediction_accuracy"}], "paper_keywords": [""], "paper_abstract": "Feature selection is an important part of contemporary QSAR analysis. In a recently published paper, we investigated the performance of different feature selection methods in a large number of in silico experiments conducted using real QSAR datasets. However, an interesting question that we did not address is whether certain feature selection methods are better than others in combination with certain learning methods, in terms of producing models with high prediction accuracy. In this report we extend our work from the previous investigation by using four different feature selection methods (wrapper, ReliefF, MARS, and elastic nets), together with eight learners (MARS, elastic net, random forest, SVM, neural networks, multiple linear regression, PLS, kNN) in an empirical investigation to address this question. The results indicate that state-of-the-art learners (random forest, SVM, and neural networks) do not gain prediction accuracy from feature selection, and we found no evidence that a certain feature selection is particularly well-suited for use in combination with a certain learner.", "paper_title": "Choosing Feature Selection and Learning Algorithms in QSAR", "paper_id": "WOS:000333478800015"}