{"auto_keywords": [{"score": 0.044695720268017505, "phrase": "session_types"}, {"score": 0.011159544902781085, "phrase": "moose"}, {"score": 0.004561826854638056, "phrase": "local_computations"}, {"score": 0.0037352112608513106, "phrase": "corba"}, {"score": 0.0034442607586033657, "phrase": "object-oriented_languages"}, {"score": 0.002944284514509205, "phrase": "object-oriented_programming_style"}, {"score": 0.0025717770066591076, "phrase": "operational_semantics"}, {"score": 0.002530359917257626, "phrase": "type_system"}, {"score": 0.0024628046987344846, "phrase": "type_inference_system"}, {"score": 0.002410058288617039, "phrase": "subject_reduction"}, {"score": 0.002345707314211983, "phrase": "progress_property"}, {"score": 0.002234165013865669, "phrase": "well-typed_programs"}, {"score": 0.0021745003291048356, "phrase": "communication_points"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": [""], "paper_abstract": "A session takes place between two parties; after establishing a connection, each party interleaves local computations and communications (sending or receiving) with the other. Session types characterise such sessions in terms of the types of values communicated and the shape of protocols, and have been developed for the pi-calculus, CORBA interfaces, and functional languages. We study-the incorporation of session types into object-oriented languages through MOOSE, a multi-threaded language with session types, thread spawning, iterative, and higher-order sessions. Our design aims to consistently integrate the object-oriented programming style and sessions, and to be able to treat various case studies from the literature. We describe the design of MOOSE, its syntax, operational semantics, and type system, and develop a type inference system. After proving subject reduction, we establish the progress property: once a communication has been established, well-typed programs will never starve at communication points. (C) 2009 Elsevier Inc. All rights reserved.", "paper_title": "Objects and session types", "paper_id": "WOS:000265648800005"}