{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "affine_spaces"}, {"score": 0.048223267193393836, "phrase": "euclidean_space"}, {"score": 0.00467855218490191, "phrase": "n_points"}, {"score": 0.004449045430179066, "phrase": "classical_result"}, {"score": 0.004417414571539519, "phrase": "johnson"}, {"score": 0.004385586035581982, "phrase": "lindenstrauss"}, {"score": 0.003951453722517865, "phrase": "natural_extension"}, {"score": 0.0038671299350540554, "phrase": "stronger_preservation"}, {"score": 0.003798231095121328, "phrase": "finite_spaces"}, {"score": 0.00374399358035391, "phrase": "k-fold_increase"}, {"score": 0.002889672003089062, "phrase": "affine_hulls"}, {"score": 0.002370625627299064, "phrase": "high-dimensional_nature"}, {"score": 0.0023451553255837317, "phrase": "projective_clustering"}, {"score": 0.0023199580436336163, "phrase": "nearest_affine_neighbour_search"}, {"score": 0.0022540779997940897, "phrase": "first_polylogarithmic_query_time_approximation_algorithm"}, {"score": 0.0021821915946356168, "phrase": "structural_application"}], "paper_keywords": [""], "paper_abstract": "Let X be a subset of n points of the Euclidean space, and let 0 < epsilon < 1. A classical result of Johnson and Lindenstrauss [JL] states that there is a projection of X onto a subspace of dimension O(epsilon(-2) log n) with distortion <= 1 + epsilon. We show a natural extension of the above result to a stronger preservation of the geometry of finite spaces. By a k-fold increase of the number of dimensions used compared with [JL], a good preservation of volumes and of distances between points and affine spaces is achieved. Specifically, we show how to embed a subset of size n of the Euclidean space into a O(epsilon(-2) k log n)- dimensional Euclidean space, so that no set of size s <= k changes its volume by more than (1 + epsilon)(s-1). Moreover, distances of points from affine hulls of sets of at most k -1 points in the space do not change by more than a factor of 1 + epsilon. A consequence of the above with k = 3 is that angles can be preserved using asymptotically the same number of dimensions as the one used in [JL]. Our method can be applied to many problems with high-dimensional nature such as Projective Clustering and Approximated Nearest Affine Neighbour Search. In particular, it shows a first polylogarithmic query time approximation algorithm to the latter. We also show a structural application that for volume respecting embedding in the sense introduced by Feige [F], the host space need not generally be of dimensionality greater than polylogarithmic in the size of the graph.", "paper_title": "Dimensionality reductions in l(2) that preserve volumes and distance to affine spaces", "paper_id": "WOS:000247033600009"}