{"auto_keywords": [{"score": 0.03641334548481919, "phrase": "local_optima"}, {"score": 0.028260025337165845, "phrase": "psokhm_algorithm"}, {"score": 0.015719716506582538, "phrase": "k-harmonic_means"}, {"score": 0.004566308708871429, "phrase": "data_objects"}, {"score": 0.0044863018460183784, "phrase": "disjoint_classes"}, {"score": 0.0032485526269852606, "phrase": "built-in_boosting_function"}, {"score": 0.003107935254560724, "phrase": "particle_swarm_optimization"}, {"score": 0.003013129637451091, "phrase": "stochastic_global_optimization_technique"}, {"score": 0.0029733865110222785, "phrase": "hybrid_data_clustering_algorithm"}, {"score": 0.0027700855441353165, "phrase": "full_use"}, {"score": 0.002603604110487731, "phrase": "khm"}, {"score": 0.0024688710065898646, "phrase": "slow_convergence_speed"}, {"score": 0.002436289099444074, "phrase": "pso_algorithm"}, {"score": 0.002300006009251888, "phrase": "pso"}, {"score": 0.0022396694076443446, "phrase": "seven_data_sets"}, {"score": 0.002219916677664081, "phrase": "experimental_results"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Data clustering", " K-means", " K-harmonic means", " Particle Swarm Optimization"], "paper_abstract": "Clustering is the process of grouping data objects into set of disjoint classes called Clusters so that objects within a class are highly similar with one another and dissimilar with the objects in other classes. K-means (KM) algorithm is one of the most popular clustering techniques because it is easy to implement and works fast in most situations. However, it is sensitive to initialization and is easily trapped in local optima. K-harmonic means (KHM) clustering solves the problem of initialization using a built-in boosting function, but it also easily runs into local optima. Particle Swarm Optimization (PSO) algorithm is a stochastic global optimization technique. A hybrid data clustering algorithm based on PSO and KHM (PSOKHM) is proposed in this research, which makes full use of the merits of both algorithms. The PSOKHM algorithm not only helps the KHM clustering escape from local optima but also overcomes the shortcoming of the slow convergence speed of the PSO algorithm. The performance of the PSOKHM algorithm is compared with those of the PSO and the KHM Clustering on seven data sets. Experimental results indicate the superiority of the PSOKHM algorithm. (C) 2009 Elsevier Ltd. All rights reserved.", "paper_title": "An efficient hybrid data clustering method based on K-harmonic means and Particle Swarm Optimization", "paper_id": "WOS:000266086600031"}