{"auto_keywords": [{"score": 0.04916535378026218, "phrase": "fam"}, {"score": 0.04086471740870507, "phrase": "tam"}, {"score": 0.007920636410137993, "phrase": "sequential_approach"}, {"score": 0.005378328786505014, "phrase": "important_feature"}, {"score": 0.00481495049065317, "phrase": "combined_through-fleet-assignment_model"}, {"score": 0.004655285779819366, "phrase": "fleet_types"}, {"score": 0.004599549048984302, "phrase": "flight_legs"}, {"score": 0.004320250794908314, "phrase": "arrival_flight"}, {"score": 0.004289130754253059, "phrase": "departure_flight"}, {"score": 0.003913739044050189, "phrase": "through-assignment_model"}, {"score": 0.0038389795739979713, "phrase": "profitable_throughs"}, {"score": 0.0038205130524543458, "phrase": "arrival_and_departure_flights"}, {"score": 0.0036144037590252667, "phrase": "fam."}, {"score": 0.0033138182199431735, "phrase": "fleet-assignment_model"}, {"score": 0.0031806677046452643, "phrase": "maximum_combined_benefit"}, {"score": 0.0031577303835881964, "phrase": "integrated_model"}, {"score": 0.0031198673593930866, "phrase": "mixed_integer-programming"}, {"score": 0.002980070016523903, "phrase": "allowable_time"}, {"score": 0.0029301552712430725, "phrase": "major_u.s._airline"}, {"score": 0.0028880352341187376, "phrase": "neighborhood_search_algorithms"}, {"score": 0.002785357686216604, "phrase": "previous_sequential_approach"}, {"score": 0.0026285925237455807, "phrase": "swap-based_neighborhood_search_approach"}, {"score": 0.0026159329991888875, "phrase": "talluri"}, {"score": 0.0025412427439735663, "phrase": "fleet_assignment"}, {"score": 0.0023466329503712374, "phrase": "suggested_algorithm"}, {"score": 0.0022306064001239353, "phrase": "integer_programming"}, {"score": 0.0022145052062614514, "phrase": "improved_neighbors"}, {"score": 0.0021932171973232687, "phrase": "computational_results"}, {"score": 0.002166894107626879, "phrase": "neighborhood_search_approach"}, {"score": 0.0021460627991428745, "phrase": "substantial_savings"}, {"score": 0.0021049978798023013, "phrase": "tam."}], "paper_keywords": ["transportation", " air", " heuristics", " integer programming", " neighborhood search", " networks"], "paper_abstract": "The fleet-assignment model (FAM) for an airline assigns fleet types to the set of flight legs that satisfies a variety of constraints and minimizes the cost of the assignment. A through connection at a station is a connection between an arrival flight and a departure flight at the station, both of which have the same fleet type assigned to them, which ensures that the same plane flies both legs. Typically, passengers are willing to pay a premium for through connections. The through-assignment model (TAM) identifies a set of profitable throughs between arrival and departure flights flown by the same fleet type at each station to maximize the through benefits. TAM is usually solved after obtaining the solution from FAM. In this sequential approach, TAM cannot change the fleeting to get a better through assignment, and FAM does not take into account the through benefits. The goal of the combined through-fleet-assignment model (ctFAM) is to come up with a fleeting and through assignment that achieves the maximum combined benefit of the integrated model. We give a mixed integer-programming (MIP) formulation of ctFAM that is too large to be solved to even near optimality within allowable time for the data obtained by a major U.S. airline. We thus focus on neighborhood search algorithms for solving ctFAM, in which we start with the solution obtained by the previous sequential approach (that is, solving FAM first, followed by TAM) and improve it successively. Our approach is based on generalizing the swap-based neighborhood search approach of Talluri (1996) for FAM, which proceeds by swapping the fleet assignment of two flight paths flown by two different plane types that originate and terminate at the same stations and the same times. An important feature of our approach is that the size of our neighborhood is very large; hence the suggested algorithm is in the category of very large-scale neighborhood (VLSN) search algorithms. Another important feature of our approach is that we use integer programming to identify improved neighbors. We provide computational results that indicate that the neighborhood search approach for ctFAM provides substantial savings over the sequential approach of solving FAM and TAM.", "paper_title": "A very large-scale Neighborhood search algorithm for the combined through-fleet-assignment model", "paper_id": "WOS:000248990800010"}