{"auto_keywords": [{"score": 0.036324900452882995, "phrase": "model_predictive_control"}, {"score": 0.00481495049065317, "phrase": "constrained_continuous_time_systems"}, {"score": 0.0046018264570209765, "phrase": "nonlinear_dynamical_system"}, {"score": 0.004524348699657099, "phrase": "optimal_way"}, {"score": 0.004039995317682942, "phrase": "optimal_control"}, {"score": 0.0036691380448651443, "phrase": "closed_solution"}, {"score": 0.0036073064072936626, "phrase": "corresponding_hamilton-jacobi-bellman_equation"}, {"score": 0.0032946562900625187, "phrase": "hamilton-jacobi-bellman_equation"}, {"score": 0.0031665087019813244, "phrase": "open-loop_optimal_control_problem"}, {"score": 0.003009022147559257, "phrase": "considerably_simpler_task"}, {"score": 0.0029249294679606656, "phrase": "resulting_control"}, {"score": 0.002859345731792013, "phrase": "short_time"}, {"score": 0.0025673005153462707, "phrase": "predictive_control"}, {"score": 0.0025383451160985488, "phrase": "continuous_time_systems"}], "paper_keywords": ["model predictive control", " constrained systems", " sampled-data"], "paper_abstract": "Often one desires to control a nonlinear dynamical system in an optimal way taking constraints on the states and inputs directly into account. Classically this problem falls into the field of optimal control. Often, however, it is difficult, if not impossible, to find a closed solution of the corresponding Hamilton-Jacobi-Bellman equation. One possible control strategy that overcomes this problem is model predictive control. In model predictive control the solution of the Hamilton-Jacobi-Bellman equation is avoided by repeatedly solving an open-loop optimal control problem for the current state, which is a considerably simpler task, and applying the resulting control open-loop for a short time. The purpose of this paper is to provide an introduction and overview to the field of model predictive control for continuous time systems. Specifically we consider the so called sampled-data nonlinear model predictive control approach. After a short review of the main principles of model predictive control some of the theoretical, computational and implementation aspects of this control strategy are discussed and underlined considering two example systems.", "paper_title": "Sampled-data nonlinear model predictive control for constrained continuous time systems", "paper_id": "WOS:000241666400007"}