{"auto_keywords": [{"score": 0.047677014623858455, "phrase": "flux-density_distribution"}, {"score": 0.03637200440324039, "phrase": "operating_point"}, {"score": 0.01085249717644965, "phrase": "magnetic_energy"}, {"score": 0.010382188857062727, "phrase": "numerical_stable_approach"}, {"score": 0.010000029454870149, "phrase": "magnetic_flux_linkage"}, {"score": 0.009932057363127397, "phrase": "state_variable"}, {"score": 0.009830955936438318, "phrase": "coupled_field_problem"}, {"score": 0.00481495049065317, "phrase": "flux_distribution"}, {"score": 0.0044804647007342865, "phrase": "significant_local_variations"}, {"score": 0.0040562607160379936, "phrase": "design_stage"}, {"score": 0.0037484651075873968, "phrase": "linear_and_non-linear_material_properties"}, {"score": 0.003634458561248524, "phrase": "linearised_lumped_parameter_model"}, {"score": 0.003536023290715607, "phrase": "non-linear_material_properties"}, {"score": 0.0029376169407844314, "phrase": "proposed_approach"}, {"score": 0.002907504959509132, "phrase": "fixed_time-step"}, {"score": 0.0028678338651577056, "phrase": "lumped_parameters"}, {"score": 0.0028190067312663446, "phrase": "fem."}, {"score": 0.0027805362553564336, "phrase": "long_simulation_times"}, {"score": 0.002686643644493607, "phrase": "adaptive_time-step_method"}, {"score": 0.002333620799300123, "phrase": "three-phase_transformer"}, {"score": 0.0022163699144426155, "phrase": "calculated_operating_point"}, {"score": 0.0021195184368629017, "phrase": "e.g._determination"}, {"score": 0.0021049977753042253, "phrase": "core_losses"}], "paper_keywords": ["Field circuit coupling", " Flux-density distribution", " Load dependent stray fluxes", " Transformer core saturation", " Phase shifting transformer", " Transformers", " Flux density", " Fluxes"], "paper_abstract": "Purpose - Depending on the load the flux-density distribution inside power transformers core shows significant local variations due to stray fluxes which enter the transformer core. As saturation of the core has to be avoided the flux-density distribution has to be determined early in the design stage of the transformer. This paper seeks to address these issues. Design/methodology/approach - To determine the load dependent flux-density distribution the operating point of the transformer is calculated considering linear and non-linear material properties. The operating point is determined using a linearised lumped parameter model of the transformer under various load conditions. Considering non-linear material properties the inductance matrix depends on the operating point and will be extracted by means of the FEM whenever the magnetic energy within the transformer changes notably. Findings - This paper presents a numerical stable approach to calculate the operating point of a transformer by using the magnetic flux linkage as state variable for the coupled field problem. Research limitations/implications - The proposed approach uses a fixed time-step to update the lumped parameters by means of the FEM. This results in long simulation times. In further research it is planned to implement an adaptive time-step method based on the change of the magnetic energy. Originality/value - A numerical stable approach to calculate the operating point of a transformer by using the magnetic flux linkage as state variable for the coupled field problem is proposed. The methodology is applied to a 2D model of a three-phase transformer. However, it also can be applied to 3D FE models. Based on the calculated operating point, the flux-density distribution can be determined and several post-processing methods can be executed (e.g. determination of core losses, ... ).", "paper_title": "Calculation of the flux distribution of three phase five limb power transformers considering nonlinear material properties", "paper_id": "WOS:000322608900007"}