{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "online_learner_participation"}, {"score": 0.040479390128548495, "phrase": "online_participation"}, {"score": 0.004504969093304219, "phrase": "key_challenge"}, {"score": 0.004357511171877593, "phrase": "learner_participation"}, {"score": 0.004168349927332055, "phrase": "increased_attention"}, {"score": 0.00392153537973826, "phrase": "sound_theoretical_understanding"}, {"score": 0.0033570147767493716, "phrase": "e-learning_settings"}, {"score": 0.0033015555065209865, "phrase": "classification_scheme"}, {"score": 0.002921815042028607, "phrase": "low-level_conceptions"}, {"score": 0.002794802975530612, "phrase": "frequency_counts"}, {"score": 0.002262756631083292, "phrase": "perceived_and_actual_measures"}], "paper_keywords": ["Computer-mediated communication", " Cooperative/collaborative learning", " Interactive learning environments", " Learning communities", " Media in education"], "paper_abstract": "It is commonly argued that a key challenge for e-learning is to encourage learner participation. Even though this challenge has received increased attention by researchers, little effort has been put into developing a sound theoretical understanding of what online participation actually is and how it may be studied empirically. This paper examines the conceptions and research approaches that underlie research on online participation in e-learning settings. A classification scheme was iteratively developed and used when publications on the topic were reviewed. It was found that research is dominated by low-level conceptions of online participation, which relies on frequency counts as measures of participation. However, some researchers aim to study more complex dimensions of participation, such as whether participants feel they are taking part and are engaged in dialogues, reflected by using a combination of perceived and actual measures of participation. In conclusion, a definition of online learner participation that acknowledges its more complex dimensions, such as doing, communicating, thinking, feeling, and belonging, is proposed. (C) 2008 Elsevier Ltd. All rights reserved.", "paper_title": "What is online learner participation? A literature review", "paper_id": "WOS:000259945200026"}