{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "social_behaviour"}, {"score": 0.008065620607628407, "phrase": "process_measures"}, {"score": 0.004070276454809864, "phrase": "social_interaction"}, {"score": 0.0035194572615570977, "phrase": "possible_ways"}, {"score": 0.00330246222643051, "phrase": "video_analysis"}, {"score": 0.003141364320497748, "phrase": "naive_judges"}, {"score": 0.0028293966058473476, "phrase": "unfolding_experience"}, {"score": 0.0027282915297520624, "phrase": "thin_slice_enjoyment_scale"}, {"score": 0.0022847009758393405, "phrase": "user_experience"}, {"score": 0.0022537212268979507, "phrase": "group_context"}, {"score": 0.002153450937601075, "phrase": "broader_relevance"}, {"score": 0.0021049977753042253, "phrase": "quantitative_analyses"}], "paper_keywords": ["unfolding experience", " empathic experience", " process measure", " quantitative", " video analysis", " thin slice"], "paper_abstract": "This paper explores and evaluates two techniques that measure aspects of social behaviour as an indicator of experience. The rationale driving the work is the idea that experience is entwined with social interaction and so, while experience itself is difficult to quantify, we might tap into it by measuring aspects of conversation that are related to it. Two techniques are considered as possible ways of doing this: (i) process measures of social behaviour derived from video analysis and (ii) thin-slice ratings ascribed by naive judges. Regarding (i), process measures of conversational equality, freedom and number of turns are shown to be reliable, sensitive and linked to unfolding experience. Regarding (ii), a Thin Slice Enjoyment Scale is developed and shown to be a reliable and less time-consuming, but also less sensitive, alternative to the process measures. Both methods are of interest to researchers and practitioners who would wish to assess user experience in a group context. Additionally, analysis of the process measures is of broader relevance to researchers who conduct quantitative analyses of talk.", "paper_title": "Measuring social behaviour as an indicator of experience", "paper_id": "WOS:000326230600002"}