{"auto_keywords": [{"score": 0.04983074823337649, "phrase": "cache_side_channels"}, {"score": 0.004430784015995566, "phrase": "cacheaudit"}, {"score": 0.004014035333627087, "phrase": "side-channel_adversaries"}, {"score": 0.003850464100878052, "phrase": "cache_states"}, {"score": 0.003580032420161922, "phrase": "novel_abstractions"}, {"score": 0.0035063024767122684, "phrase": "precise_overapproximations"}, {"score": 0.0034519997658752598, "phrase": "possible_side-channel_observations"}, {"score": 0.0032599633778910516, "phrase": "upper_bounds"}, {"score": 0.003078577062864183, "phrase": "case_studies"}, {"score": 0.002983916676307492, "phrase": "binary_executables"}, {"score": 0.0028325548627901004, "phrase": "aes_implementation"}, {"score": 0.0027886573969044042, "phrase": "polarssl_library"}, {"score": 0.002633425544817301, "phrase": "estream_stream_cipher_competition"}, {"score": 0.002499798127196099, "phrase": "cache_size"}, {"score": 0.0022291501521610737, "phrase": "first_formal_proofs"}, {"score": 0.0021049977753042253, "phrase": "data-independent_memory"}], "paper_keywords": ["Security", " Verification", " Side-channel attacks", " caches"], "paper_abstract": "We present CacheAudit, a versatile framework for the automatic, static analysis of cache side channels. CacheAudit takes as input a program binary and a cache configuration and derives formal, quantitative security guarantees for a comprehensive set of side-channel adversaries, namely, those based on observing cache states, traces of hits and misses, and execution times. Our technical contributions include novel abstractions to efficiently compute precise overapproximations of the possible side-channel observations for each of these adversaries. These approximations then yield upper bounds on the amount of information that is revealed. In case studies, we apply CacheAudit to binary executables of algorithms for sorting and encryption, including the AES implementation from the PolarSSL library, and the reference implementations of the finalists of the eSTREAM stream cipher competition. The results we obtain exhibit the influence of cache size, line size, associativity, replacement policy, and coding style on the security of the executables and include the first formal proofs of security for implementations with countermeasures such as preloading and data-independent memory access patterns.", "paper_title": "CacheAudit: A Tool for the Static Analysis of Cache Side Channels", "paper_id": "WOS:000356380200004"}