{"auto_keywords": [{"score": 0.03491360340429088, "phrase": "execution_time"}, {"score": 0.004774115617883476, "phrase": "structured_light_scanning"}, {"score": 0.004733625412289433, "phrase": "optical_three-dimensional_shape_measurement"}, {"score": 0.0041657281535389615, "phrase": "parallelization_study"}, {"score": 0.003776750773624222, "phrase": "computational_evaluation"}, {"score": 0.003512702405367876, "phrase": "reconstruction_method"}, {"score": 0.003468053168607071, "phrase": "openmp_api_specification"}, {"score": 0.0034386016613475335, "phrase": "shared-memory_parallel_programming"}, {"score": 0.003104038398386081, "phrase": "hard_disk"}, {"score": 0.002433843373780471, "phrase": "inherent_parallelism"}, {"score": 0.0021968238865548812, "phrase": "proposed_parallelization"}, {"score": 0.0021688641066186817, "phrase": "valuable_implementation"}, {"score": 0.0021504218042734677, "phrase": "data_centers"}, {"score": 0.002123051344001408, "phrase": "web_services"}], "paper_keywords": ["3D Object reconstruction", " Structured light scanning", " Parallel computing", " OpenMP"], "paper_abstract": "Optical three-dimensional shape measurement based on structured light has been widely used for 3D measurement in many different applications. Although many different methods for 3D object reconstruction have been proposed last years, surprisingly none of the proposals includes a parallelization study of the tasks executed on computers, preventing these methods from reaching their maximum performance. In this paper, we propose first the computational evaluation of a previously proposed 3D object reconstruction method. Based on that evaluation, we also propose the parallelization of the reconstruction method using the OpenMP API specification for shared-memory parallel programming. The results show that most of the execution time is consumed by the tasks depending on the I/O hardware (camera, projector, hard disk, etc.), in such a way that the tasks performed by the computer should be overlapped as much as possible with the tasks performed by the I/O hardware, for those scenarios where the acquisition of the images should be performed on-line. For those scenarios where all the images are already available, then the inherent parallelism of the application increases, allowing a reduction of the execution time that can reach up to a 82 %. These results validate the proposed parallelization as a valuable implementation for data centers that provide web services for 3D object reconstruction purposes.", "paper_title": "Parallelization of a method for dense 3D object reconstruction in structured light scanning", "paper_id": "WOS:000353786700017"}