{"auto_keywords": [{"score": 0.033057242091515615, "phrase": "cell_phenotypes"}, {"score": 0.00481495049065317, "phrase": "cell-level_protein_network_analysis"}, {"score": 0.004597622380240611, "phrase": "new_bioimaging_techniques"}, {"score": 0.004278807087784626, "phrase": "individual_cells"}, {"score": 0.0041490029730869345, "phrase": "neighbouring_cells"}, {"score": 0.0039010428828989826, "phrase": "complex_biological_systems"}, {"score": 0.0038217146888983576, "phrase": "protein_interactions"}, {"score": 0.0035932440062595252, "phrase": "new_algorithmic_approaches"}, {"score": 0.0035201528214608914, "phrase": "large_amounts"}, {"score": 0.0034841647157189985, "phrase": "multi-tag_bioimage_data"}, {"score": 0.0034485432592912917, "phrase": "cancerous_and_normal_tissue_specimens"}, {"score": 0.003361069456060196, "phrase": "protein_networks"}, {"score": 0.003292685392413911, "phrase": "cellular_heterogeneity"}, {"score": 0.0032423089921154503, "phrase": "molecular_level"}, {"score": 0.003160049822855747, "phrase": "proposed_approach"}, {"score": 0.002971016979295967, "phrase": "robotically_controlled_toponome_imaging_system_microscope"}, {"score": 0.002494466951433885, "phrase": "overall_co-expression"}, {"score": 0.0024062532032402533, "phrase": "novel_quantities"}, {"score": 0.0022275639370573264, "phrase": "protein_pairs"}, {"score": 0.0021049977753042253, "phrase": "normal_colon_tissue"}], "paper_keywords": [""], "paper_abstract": "Motivation: New bioimaging techniques have recently been proposed to visualize the colocation or interaction of several proteins within individual cells, displaying the heterogeneity of neighbouring cells within the same tissue specimen. Such techniques could hold the key to understanding complex biological systems such as the protein interactions involved in cancer. However, there is a need for new algorithmic approaches that analyze the large amounts of multi-tag bioimage data from cancerous and normal tissue specimens to begin to infer protein networks and unravel the cellular heterogeneity at a molecular level. Results: The proposed approach analyzes cell phenotypes in normal and cancerous colon tissue imaged using the robotically controlled Toponome Imaging System microscope. It involves segmenting the 4',6-diamidino-2-phenylindole-labelled image into cells and determining the cell phenotypes according to their protein-protein dependence profile. These were analyzed using two new measures, Difference in Sums of Weighted cO-dependence/Anti-co-dependence profiles (DiSWOP and DiSWAP) for overall co-expression and anti-co-expression, respectively. These novel quantities were extracted using 11 Toponome Imaging System image stacks from either cancerous or normal human colorectal specimens. This approach enables one to easily identify protein pairs that have significantly higher/lower co-expression levels in cancerous tissue samples when compared with normal colon tissue.", "paper_title": "DiSWOP: a novel measure for cell-level protein network analysis in localized proteomics image data", "paper_id": "WOS:000331271100017"}