{"auto_keywords": [{"score": 0.03052443994077074, "phrase": "ss"}, {"score": 0.005991628885957561, "phrase": "vr"}, {"score": 0.00481495049065317, "phrase": "vection_change"}, {"score": 0.00476323161560059, "phrase": "simulator_sickness"}, {"score": 0.004712065638657606, "phrase": "virtual_environments"}, {"score": 0.004636340567075841, "phrase": "optic_flow_patterns"}, {"score": 0.003900257249255497, "phrase": "motion_sickness"}, {"score": 0.0035386420095120706, "phrase": "perceived_heading"}, {"score": 0.0034629341517018438, "phrase": "visually_simulated_self-motion"}, {"score": 0.003107935254560724, "phrase": "optic_flow_pattern"}, {"score": 0.0026710653215026685, "phrase": "second_experiment"}, {"score": 0.002599763359352916, "phrase": "vection_onset"}, {"score": 0.0025031188149336257, "phrase": "computer-inter-faced_slide_indicator"}, {"score": 0.002333044307949414, "phrase": "contracting_pattern"}, {"score": 0.0021627595586364724, "phrase": "disorientation_symptoms"}], "paper_keywords": [""], "paper_abstract": "The optic flow patterns generated by virtual reality (VR) systems typically produce visually induced experiences of self-motion (vection). While this vection can enhance presence in VR, it is often accompanied by a variant of motion sickness called simulator sickness (SS). However, not all vection experiences are the same. In terms of perceived heading and/or speed, visually simulated self-motion can be either steady or changing. It was hypothesized that changing vection would lead to more SS. Participants viewed an optic flow pattern that either steadily expanded or alternately expanded and contracted. In one experiment, SS was measured pretreatment and after 5 min of viewing using the Simulator Sickness Questionnaire. in a second experiment employing the same stimuli, vection onset and magnitude were measured using a computer-inter-faced slide indicator. The steadily expanding flow pattern, compared to the expanding and contracting pattern, led to: 1) significantly less SS, 2) lower subscores for nausea, oculonnotor, and disorientation symptoms, 3) more overall vection magnitude, and 4) less changing vection. Collectively, these results suggest that changing vection exacerbates SS.", "paper_title": "Vection change exacerbates simulator sickness in virtual environments", "paper_id": "WOS:000255789800006"}