{"auto_keywords": [{"score": 0.032330902710763554, "phrase": "proposed_algorithm"}, {"score": 0.01561850266612495, "phrase": "color_grads"}, {"score": 0.015517930232476867, "phrase": "boolean_rules"}, {"score": 0.01159609573198781, "phrase": "solder_joint_types"}, {"score": 0.00923841681431481, "phrase": "proposed_method"}, {"score": 0.007501690355211225, "phrase": "manufacturing_process"}, {"score": 0.00481495049065317, "phrase": "solder_joints"}, {"score": 0.004645057834614705, "phrase": "comprehensive_performance"}, {"score": 0.004614815588012906, "phrase": "solder_joints_inspection"}, {"score": 0.004554917803750564, "phrase": "i.e._high_recognition_rate"}, {"score": 0.004481132747216135, "phrase": "defect_types"}, {"score": 0.004280804599325052, "phrase": "chip_solder_joints"}, {"score": 0.004049501224016734, "phrase": "color_grads'_features"}, {"score": 0.003945001936004421, "phrase": "special_solder_joint_image"}, {"score": 0.0038557709801774176, "phrase": "particular_image_acquisition_system"}, {"score": 0.0034841647157189985, "phrase": "extracted_features"}, {"score": 0.003461454328850212, "phrase": "statistical_characteristics"}, {"score": 0.002948883844627217, "phrase": "inspection_speed"}, {"score": 0.002910545717767559, "phrase": "parallel_computing_method"}, {"score": 0.002717277008333612, "phrase": "commercial_aoi_system"}, {"score": 0.0026126405272417783, "phrase": "result_analysis"}, {"score": 0.002471248834609486, "phrase": "properly_all_the_eight_common_types"}, {"score": 0.002407378648209689, "phrase": "high_correct_rate"}, {"score": 0.002307083221755957, "phrase": "quality_control"}, {"score": 0.002153799620707991, "phrase": "crown_copyright"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Solder joint inspection", " Chip", " Printed circuit boards", " Surface mounted technology", " AOI"], "paper_abstract": "In order to improve the comprehensive performance of solder joints inspection in three aspects, i.e. high recognition rate, detailed classification of defect types and fast inspection speed, a new detection and classification algorithm of the chip solder joints based on color grads and Boolean rules is developed in this paper. Firstly, the region features, evaluation features and color grads' features are defined and extracted based on the special solder joint image, which is acquired by a particular image acquisition system composed of a 3-CCD color digital camera and a 3-color (red, green, and blue) hemispherical LED array illumination. Secondly, the models of solder joint types are built based on extracted features and statistical characteristics of solder joint types. Thirdly, the detection and classification method is designed and presented using Boolean rules, then eight common solder joint types, including the acceptable solder joint, pseudo, no solder, lacked solder, excess solder, shifted, tombstone, and miss component, can be classified and detected by the proposed algorithm. Fourthly, the proposed algorithm is optimized to improve the inspection speed based on a parallel computing method. Finally, to evaluate the performance of the proposed method, 79 pieces of PCBs with defects were inspected by the commercial AOI system developed by the authors which integrates the proposed algorithm. Experiment and result analysis illustrates that the proposed method is better than other methods in three aspects, it can detect and classify properly all the eight common types of solder joints, its detailed classification, and high correct rate, which is up to 97.7%, are more useful to the quality control in the manufacturing process, and its inspection speed is faster, thus helping us to improve the efficiency of the manufacturing process. Crown Copyright (C) 2014 Published by Elsevier Ltd. All rights reserved.", "paper_title": "An inspection and classification method for chip solder joints using color grads and Boolean rules", "paper_id": "WOS:000337854300012"}