{"auto_keywords": [{"score": 0.04945294158676432, "phrase": "terminal_residues"}, {"score": 0.004138237651024009, "phrase": "good_explanation"}, {"score": 0.004004151534026732, "phrase": "common_explanation"}, {"score": 0.0036273094722181795, "phrase": "large_number"}, {"score": 0.003384754649268796, "phrase": "lattice_model"}, {"score": 0.003076152130543236, "phrase": "average_solvent_accessibility"}, {"score": 0.0030559337757849634, "phrase": "termini_residues"}, {"score": 0.0029862071871499295, "phrase": "charged_residues"}, {"score": 0.0028514769721161063, "phrase": "maximal_possible_exposure"}, {"score": 0.002758968636750223, "phrase": "c-terminal_residues"}, {"score": 0.002474408907166139, "phrase": "large_population"}, {"score": 0.002458135825220717, "phrase": "model_proteins"}, {"score": 0.002386218074955624, "phrase": "compact_structures"}, {"score": 0.002324055400492893, "phrase": "pronounced_energy_gap"}, {"score": 0.002308768837799101, "phrase": "kinetic_selection"}, {"score": 0.002293582591899972, "phrase": "fast_folding_proteins"}, {"score": 0.002278496007505835, "phrase": "monte-carlo_simulations"}, {"score": 0.002140021296668778, "phrase": "similar_proportions"}, {"score": 0.0021049977753042253, "phrase": "real_proteins"}], "paper_keywords": [""], "paper_abstract": "Motivation: It is widely known that terminal residues of proteins (i.e. the N- and C-termini) are predominantly located on the surface of proteins and exposed to the solvent. However, there is no good explanation as to the forces driving this phenomenon. The common explanation that terminal residues are charged, and charged residues prefer to be on the surface, cannot explain the magnitude of the phenomenon. Here, we survey a large number of proteins from the PDB in order to explore, quantitatively, this phenomenon, and then we use a lattice model to study the mechanisms involved. Results: The location of the termini was examined for 425 small monomeric proteins (50-200 amino acids) and it was found that the average solvent accessibility of termini residues is 87.1% compared with 49.2% of charged residues and 35.9% of all residues. Using a cutoff of 50% of the maximal possible exposure, 80.3% of the N-terminal and 86.1% of the C-terminal residues are exposed compared to 32% for all residues. In addition, terminal residues are much more distant from the center of mass of their proteins than other residues. Using a 2D lattice, a large population of model proteins was studied on three levels: structural selection of compact structures, thermodynamic selection of conformations with a pronounced energy gap and kinetic selection of fast folding proteins using Monte-Carlo simulations. Progressively, each selection raises the proportion of proteins with termini on the surface, resulting in similar proportions to those observed for real proteins.", "paper_title": "A tale of two tails: why are terminal residues of proteins exposed?", "paper_id": "WOS:000243992400035"}