{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "life_cycle_concepts"}, {"score": 0.04676951218946988, "phrase": "information-processing_needs"}, {"score": 0.046062928238948773, "phrase": "interorganizational_relationships"}, {"score": 0.004720269202737973, "phrase": "interorganizational_alignment"}, {"score": 0.004273951631010383, "phrase": "business_relationships_life_cycle_concepts"}, {"score": 0.003994714109598034, "phrase": "previous_empirical_study"}, {"score": 0.003931697356115479, "phrase": "automotive_sector"}, {"score": 0.0038696708318671446, "phrase": "electronic_collaboration"}, {"score": 0.003823791479971016, "phrase": "supply_chain"}, {"score": 0.0037784540167266497, "phrase": "large_european_automotive_supplier"}, {"score": 0.0036167509502276294, "phrase": "previous_study"}, {"score": 0.003313741359811683, "phrase": "supply_chain_collaboration_classification"}, {"score": 0.0030481444896915504, "phrase": "different_information-processing_needs"}, {"score": 0.002917604283241353, "phrase": "business_relationships_life_cycles"}, {"score": 0.0027815466400771768, "phrase": "illustrative_cases"}, {"score": 0.0027159094186967247, "phrase": "chosen_sector_limit"}, {"score": 0.002488183412451029, "phrase": "product_and_business_relationships_life_cycles"}, {"score": 0.0024101837218440834, "phrase": "inappropriate_information"}, {"score": 0.002391067964886602, "phrase": "communication_technology"}, {"score": 0.0023626775529531486, "phrase": "business_decisions"}, {"score": 0.002138799283553239, "phrase": "alignment_help"}, {"score": 0.0021049977753042253, "phrase": "key_aspects"}], "paper_keywords": ["strategic alignment", " business cycles", " channel relationships", " communication technologies"], "paper_abstract": "Purpose - This paper aims to investigate the alignment between the information-processing needs and capabilities during interorganizational relationships through the lenses of both the product and the business relationships life cycle concepts, and the types of information exchanged. Design/methodology/approach - This paper follows up on a previous empirical study conducted in the automotive sector, investigating the electronic collaboration within the supply chain of a large European Automotive Supplier (EAS). Out of the 61 respondents from this previous study, four illustrative cases are selected to further investigate their information alignment, where each case involves one specific relationship between EAS and its business partners based on the supply chain collaboration classification provided by the German Association of the Automotive Industry (VDA). Findings - The conclusion is that the phenomenon is bimodal and requires that the different information-processing needs and capabilities associated with each stage of both the product and the business relationships life cycles should be considered. Research limitations/implications - The small number of illustrative cases and the specificity of the chosen sector limit the generalizability of the results. Without considering the various types of information-processing needs and capabilities as well as the stage of both product and business relationships life cycles, a biased conclusion could lead to inappropriate information and communication technology investments and business decisions. Originality/value - The richness of the cases and the genuine integration of the life cycle concepts and the type of information with the notion of alignment help to identify some key aspects of interorganizational relationships.", "paper_title": "The role of life cycle concepts in the assessment of interorganizational alignment", "paper_id": "WOS:000254568700009"}