{"auto_keywords": [{"score": 0.04888338488077779, "phrase": "hesitant_interval-valued_fuzzy_information"}, {"score": 0.015719716506582538, "phrase": "multiple_attribute_decision"}, {"score": 0.01052876774378678, "phrase": "einstein"}, {"score": 0.0038343546245999285, "phrase": "new_einstein_aggregation_operators"}, {"score": 0.0027123819773059127, "phrase": "hesitant_interval-valued_fuzzy_einstein"}, {"score": 0.002450864311898833, "phrase": "hesitant_interval-valued_fuzzy_environments"}, {"score": 0.002349467661235188, "phrase": "illustrative_example"}, {"score": 0.0022906498741695094, "phrase": "software_quality"}, {"score": 0.0021773853011112882, "phrase": "developed_approach"}], "paper_keywords": ["Multiple attribute decision making (MADM)", " hesitant interval-valued fuzzy values", " Einstein aggregation operators", " induced hesitant interval-valued fuzzy Einstein correlated averaging (I-HIVFECA) operator", " induced hesitant interval-valued fuzzy Einstein correlated geometric (I-HIVFECG) operator"], "paper_abstract": "In this paper, we investigate the multiple attribute decision making (MADM) problems with hesitant interval-valued fuzzy information. Then, we further develop some new Einstein aggregation operators with hesitant interval-valued fuzzy information, such as the induced hesitant interval-valued fuzzy Einstein correlated averaging (I-HIVFECA) operator and induced hesitant interval-valued fuzzy Einstein correlated geometric (I-HIVFECG) operator. Then, we apply the induced hesitant interval-valued fuzzy Einstein correlated averaging (I-HIVFECA) operator and induced hesitant interval-valued fuzzy Einstein correlated geometric (I-HIVFECG) operator to deal with multiple attribute decision making under the hesitant interval-valued fuzzy environments. Finally, an illustrative example for evaluating software quality is given to verify the developed approach and to demonstrate its practicality and effectiveness.", "paper_title": "Approaches to multiple attribute decision making with hesitant interval-valued fuzzy information under correlative environment", "paper_id": "WOS:000341191800045"}