{"auto_keywords": [{"score": 0.011922070558689105, "phrase": "original_hairstyle"}, {"score": 0.010549563458390436, "phrase": "input_photo"}, {"score": 0.00481495049065317, "phrase": "skin_texture_synthesis"}, {"score": 0.004775596914840399, "phrase": "modern_trend"}, {"score": 0.004508942069742167, "phrase": "noticeable_evidences"}, {"score": 0.004472078324288593, "phrase": "wide_variety"}, {"score": 0.004315771670213371, "phrase": "hairstyle_customization"}, {"score": 0.003942995906058182, "phrase": "nearly_all_existing_approaches"}, {"score": 0.0039000478602699267, "phrase": "realistic_hairstyle_synthesis_results"}, {"score": 0.0037226570791514184, "phrase": "synthesis_result"}, {"score": 0.0035435867326548665, "phrase": "newly_re-synthesized_hairstyle"}, {"score": 0.0035049738376240567, "phrase": "serious_artifact"}, {"score": 0.003485824905231454, "phrase": "human_perception"}, {"score": 0.0034009367367442175, "phrase": "active_shape_model"}, {"score": 0.0033454923523807668, "phrase": "entire_facial_contour"}, {"score": 0.00319324425647735, "phrase": "hair_removal"}, {"score": 0.0031671030360367843, "phrase": "facial_skin"}, {"score": 0.0031411751440831165, "phrase": "revealed_forehead"}, {"score": 0.0030730639262332698, "phrase": "skin_texture"}, {"score": 0.0029736479837154843, "phrase": "traditional_texture_synthesis"}, {"score": 0.0029573932605287947, "phrase": "image_inpainting"}, {"score": 0.0028150302583265655, "phrase": "base_skin_patch"}, {"score": 0.0027691111795848183, "phrase": "non-stationary_texture_synthesis"}, {"score": 0.002672166323548487, "phrase": "user_assistance"}, {"score": 0.0025856860837060224, "phrase": "new_and_friendly_facial_contour_and_hairstyle_adjusting_mechanism"}, {"score": 0.002508867228980776, "phrase": "desired_hairstyle"}, {"score": 0.0021049977753042253, "phrase": "user_studies"}], "paper_keywords": ["Active shape model", " Skin texture synthesis", " Hairstyle extraction"], "paper_abstract": "The modern trend of diversification and personalization has encouraged people to boldly express their differentiation and uniqueness in many aspects, and one of the noticeable evidences is the wide variety of hairstyles that we could observe today. Given the needs for hairstyle customization, approaches or systems, ranging from 2D to 3D, or from automatic to manual, have been proposed or developed to digitally facilitate the choice of hairstyles. However, nearly all existing approaches suffer from providing realistic hairstyle synthesis results. By assuming the inputs to be 2D photos, the vividness of a hairstyle re-synthesis result relies heavily on the removal of the original hairstyle, because the co-existence of the original hairstyle and the newly re-synthesized hairstyle may lead to serious artifact on human perception. We resolve this issue by extending the active shape model to more precisely extract the entire facial contour, which can then be used to trim away the hair from the input photo. After hair removal, the facial skin of the revealed forehead needs to be recovered. Since the skin texture is non-stationary and there is little information left, the traditional texture synthesis and image inpainting approaches do not fit to solve this problem. Our proposed method yields a more desired facial skin patch by first interpolating a base skin patch, and followed by a non-stationary texture synthesis. In this paper, we also would like to reduce the user assistance during such a process as much as possible. We have devised a new and friendly facial contour and hairstyle adjusting mechanism that make it extremely easy to manipulate and fit a desired hairstyle onto a face. In addition, our system is also equipped with the functionality of extracting the hairstyle from a given photo, which makes our work more complete. Moreover, by extracting the face from the input photo, our system allows users to exchange faces as well. In the end of this paper, our re-synthesized results are shown, comparisons are made, and user studies are conducted as well to further demonstrate the usefulness of our system.", "paper_title": "Simulation of face/hairstyle swapping in photographs with skin texture synthesis", "paper_id": "WOS:000316483000007"}