{"auto_keywords": [{"score": 0.014981767887395641, "phrase": "electronic_commerce"}, {"score": 0.012356359959687804, "phrase": "off-line_e-cash_scheme"}, {"score": 0.01090794520611405, "phrase": "ttp"}, {"score": 0.009099312787110053, "phrase": "illegal_transactions"}, {"score": 0.00481495049065317, "phrase": "fast_anonymity"}, {"score": 0.004718431349852634, "phrase": "rapid_progress"}, {"score": 0.0046238380150870435, "phrase": "cloud_computing_technologies"}, {"score": 0.004212453011596424, "phrase": "credit_cards"}, {"score": 0.0041784516085055035, "phrase": "electronic_tickets"}, {"score": 0.004144723510171449, "phrase": "electronic_cash"}, {"score": 0.003685067218455088, "phrase": "double-spending_checking"}, {"score": 0.0035965032173588753, "phrase": "fast_anonymity_revocation"}, {"score": 0.003398015125667192, "phrase": "financial_cloud_server"}, {"score": 0.003356923403930231, "phrase": "third_party"}, {"score": 0.002416589459425828, "phrase": "specific_user"}, {"score": 0.002255431275670053, "phrase": "proposed_features"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Electronic cash", " Double spending", " Unlinkability", " Anonymity", " Chameleon hash functions"], "paper_abstract": "Due to rapid progress in the internet and cloud computing technologies, electronic commerce is becoming more and more popular. Many people and businesses deal with their payment transactions via the Internet. The technologies of credit cards, electronic tickets, electronic cash (e-cash), and other advanced payment services have realized the vision of electronic commerce. In this paper, we proposed an off-line e-cash scheme with anonymity, unlinkability, double-spending checking, anonymity control, and fast anonymity revocation on double-spending. In an off-line e-cash scheme, the bank which could be a financial cloud server or the third party (TTP) must be able to revoke the anonymity of a user who doubly spent her/his e-cash(s). In our proposed scheme, the bank can quickly derive the identity of the user who doubly spent her/his e-cash(s) without the participation of TTP. Besides, if some illegal transactions are reported, TTP can also directly revoke the anonymity of the user who spent her/his e-cash(s) in the illegal transactions. Furthermore, we also provide traceability for the police to trace a specific user, and maybe a crime, in some situations. Finally, the security of the proposed features, unlinkability and unforgeability, are formally proved in this paper. (C) 2012 Elsevier Ltd. All rights reserved.", "paper_title": "User efficient recoverable off-line e-cash scheme with fast anonymity revoking", "paper_id": "WOS:000320601000023"}