{"auto_keywords": [{"score": 0.024077606980706906, "phrase": "surf"}, {"score": 0.004930470779686408, "phrase": "marin"}, {"score": 0.00481495049065317, "phrase": "ship_hydrodynamics"}, {"score": 0.004721602309430702, "phrase": "viscous_free-surface_water_flow"}, {"score": 0.004469700997700534, "phrase": "industrial_applications"}, {"score": 0.004264463695140275, "phrase": "almost_all_methods"}, {"score": 0.0041653916552844535, "phrase": "navier-stokes_equations"}, {"score": 0.0041167185402778425, "phrase": "discretisation_methods"}, {"score": 0.004068611852912931, "phrase": "water_surface"}, {"score": 0.003958529104387973, "phrase": "highly_different_methods"}, {"score": 0.0035750047462243836, "phrase": "industrial_practice"}, {"score": 0.0030440661915657175, "phrase": "best_field"}, {"score": 0.002847691227421257, "phrase": "parnas-sos"}, {"score": 0.002727409429089543, "phrase": "efficient_steady-state_solution_method"}, {"score": 0.0025715131759585052, "phrase": "isis-cfd"}, {"score": 0.0024340403320192807, "phrase": "compressive_flux_discretisation_schemes"}, {"score": 0.002405549400304955, "phrase": "volume_fraction"}, {"score": 0.002315592888759258, "phrase": "nmri"}, {"score": 0.0021721582450016, "phrase": "modified_formulation"}, {"score": 0.0021049977753042253, "phrase": "ship_flow_computation"}], "paper_keywords": [""], "paper_abstract": "The simulation of viscous free-surface water flow is a subject that has reached a certain maturity and is nowadays used in industrial applications, like the simulation of the flow around ships. While almost all methods used are based on the Navier-Stokes equations, the discretisation methods for the water surface differ widely. Many of these highly different methods are being used with success. We review three of these methods, by describing in detail their implementation in one particular code that is being used in industrial practice. The descriptions concern the principle of the method, numerical details, and the method's strengths and limitations. For each code, examples are given of its use. Finally, the methods are compared to determine the best field of application for each. The following surface descretisation methods are reviewed. First, surface fitting/mesh deformation in PARNAS-SOS, developed by MARIN; the description focuses on the efficient steady-state solution method of this code. Then surface capturing with Volume-of-Fluid in ISIS-CFD, developed by CNRS/Ecole Centrale de Nantes; the main topic of this review are the compressive flux discretisation schemes for the volume fraction that are used in this code. And finally, the Level Set method in SURF, developed by NMRI; this description contains a modified formulation of the Level Set method that is optimised for ship flow computation.", "paper_title": "Free-Surface Viscous Flow Solution Methods for Ship Hydrodynamics", "paper_id": "WOS:000289682500001"}