{"auto_keywords": [{"score": 0.0387515965540892, "phrase": "agile_deployment"}, {"score": 0.012683970255023673, "phrase": "software_companies"}, {"score": 0.00481495049065317, "phrase": "successful_agile_deployment-insights"}, {"score": 0.004695190325411791, "phrase": "finland"}, {"score": 0.004578382275810468, "phrase": "success_stories"}, {"score": 0.0044870272550540415, "phrase": "agile_software_development"}, {"score": 0.004245051445971095, "phrase": "research_communities"}, {"score": 0.003955787027818301, "phrase": "'successful_agile_deployment"}, {"score": 0.003540392285585644, "phrase": "project_managers"}, {"score": 0.003469676666252421, "phrase": "quality_managers"}, {"score": 0.0033832583769880576, "phrase": "product_managers"}, {"score": 0.003073988343893906, "phrase": "necessary_goals"}, {"score": 0.003012560489169148, "phrase": "agile_development"}, {"score": 0.0028642924503126154, "phrase": "tailored_process_model"}, {"score": 0.0026554236621262515, "phrase": "identified_barriers"}, {"score": 0.002202894673025544, "phrase": "highly_relevant_but_relatively_under-researched_phenomenon"}, {"score": 0.0021049977753042253, "phrase": "software_process_improvement"}], "paper_keywords": ["Agile deployment", " Improving agile development", " Success factors for agile deployment", " Software process improvement (SPI)"], "paper_abstract": "The number of success stories being reported concerning agile software development has led to an increase in interest among industries and research communities. The purpose of this paper is to identify strengths and barriers for 'successful agile deployment' in the software companies. This knowledge can benefit software companies planning their current strategy for agile deployment. Analysis of 57 developers, architects, project managers, customers, quality managers, and line and product managers in three case companies identifies 71 strengths and 169 barriers of agile deployment. The analysis revealed the importance of management providing the necessary goals and support for agile development. It also indicated the significance of defining a tailored process model and giving developers the freedom to improve their own agile development process continuously during agile deployment. The identified barriers, strengths and recommendations can be used as a checklist for planning and/or monitoring the effectiveness of agile deployment in software companies. By identifying the barriers and strengths of agile deployment, the paper deepens understanding of this highly relevant but relatively under-researched phenomenon and contributes to the literature on agile deployment and software process improvement.", "paper_title": "Strengths and barriers behind the successful agile deployment-insights from the three software intensive companies in Finland", "paper_id": "WOS:000307962100003"}