{"auto_keywords": [{"score": 0.03441856679421127, "phrase": "longest_such_substring"}, {"score": 0.00481495049065317, "phrase": "sequence_under_density"}, {"score": 0.004355267258397068, "phrase": "target_density_range"}, {"score": 0.004178935413340453, "phrase": "gc-rich_regions"}, {"score": 0.004081385289516914, "phrase": "cpg_islands"}, {"score": 0.0034388111429203222, "phrase": "upper_bounds"}, {"score": 0.003338690782620756, "phrase": "algorithmic_problem"}, {"score": 0.0030554300179552415, "phrase": "shortest_substring"}, {"score": 0.0030017207229983385, "phrase": "maximal_set"}, {"score": 0.002966438503447793, "phrase": "disjoint_substrings"}, {"score": 0.002426137929553724, "phrase": "related_problems"}, {"score": 0.0021682027434117095, "phrase": "practical_testing"}, {"score": 0.0021049977753042253, "phrase": "significantly_smaller_time"}], "paper_keywords": ["algorithms", " string processing", " substring density", " bioinformatics"], "paper_abstract": "Several biological problems require the identification of regions in a sequence where some feature occurs within a target density range: examples including the location of GC-rich regions, identification of CpG islands, and sequence matching. Mathematically, this corresponds to searching a string of 0' s and 1's for a substring whose relative proportion of 1's lies between given lower and upper bounds. We consider the algorithmic problem of locating the longest such substring, as well as other related problems (such as finding the shortest substring or a maximal set of disjoint substrings). For locating the longest such substring, we develop an algorithm that runs in O(n) time, improving upon the previous best-known O(n log n) result. For the related problems we develop O(n log log n) algorithms, again improving upon the best-known O(n log n) results. Practical testing verifies that our new algorithms enjoy significantly smaller time and memory footprints, and can process sequences that are orders of magnitude longer as a result.", "paper_title": "LOCATING REGIONS IN A SEQUENCE UNDER DENSITY CONSTRAINTS", "paper_id": "WOS:000323888700017"}