{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "internet_use"}, {"score": 0.0488533702507179, "phrase": "personal_health"}, {"score": 0.0229752756593532, "phrase": "preferred_source"}, {"score": 0.004372712391262538, "phrase": "personal_health_information"}, {"score": 0.004292422863834094, "phrase": "cross-sectional_survey"}, {"score": 0.004136221184894985, "phrase": "firmly_established_website"}, {"score": 0.00403026082093352, "phrase": "multiple_regression_analysis"}, {"score": 0.003912469968653304, "phrase": "site_use"}, {"score": 0.003840598580753804, "phrase": "analysis_template"}, {"score": 0.003385555209074879, "phrase": "psychometric_qualities"}, {"score": 0.003323330859027428, "phrase": "compelling_evidence"}, {"score": 0.00328654473734697, "phrase": "construct's_validity"}, {"score": 0.0032261342460565457, "phrase": "confirmatory_factor_analysis"}, {"score": 0.0031086137705026483, "phrase": "theoretical_model"}, {"score": 0.0030514638431036714, "phrase": "regression_analysis"}, {"score": 0.0028969560940141233, "phrase": "five_factors"}, {"score": 0.0028121943702224326, "phrase": "written_media"}, {"score": 0.002770745509774383, "phrase": "health_information"}, {"score": 0.0022338938462817867, "phrase": "potentially_influential_role"}, {"score": 0.0021684903968454267, "phrase": "personal_knowledge"}, {"score": 0.002152440300818582, "phrase": "health_issues"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ireland_ltd."}], "paper_keywords": ["Internet use", " Health information seeking", " Personal health", " Health consumer", " Trust", " Motivation"], "paper_abstract": "Objective: To understand the personal, social and cultural factors likely to explain recourse to the Internet as a preferred source of personal health information. Design: A cross-sectional survey was conducted among a population of 2923 Internet users visiting a firmly established website that offers information on personal health. Multiple regression analysis was performed to identify the determinants of site use. Measurement: The analysis template comprised four classes of determinants likely to explain Internet use: beliefs, intentions, user satisfaction and socio-demographic characteristics. Seven-point Likert scales were used. An analysis of the psychometric qualities of the variables provided compelling evidence of the construct's validity and reliability. A confirmatory factor analysis confirmed the correspondence with the factors predicted by the theoretical model. Findings: The regression analysis explained 35% of the variance in Internet use. Use was directly associated with five factors: perceived usefulness, importance given to written media in searches for health information, concern for personal health, importance given to the opinions of physicians and other health professionals, and the trust placed in the information available on the site itself. Conclusion: This study confirms the importance of the credibility of information on the frequency of Internet use as a preferred source of information on personal health. It also shows the potentially influential role of the Internet in the development of personal knowledge of health issues. (C) 2008 Elsevier Ireland Ltd. All rights reserved.", "paper_title": "Determinants of Internet use as a preferred source of information on personal health", "paper_id": "WOS:000260238000002"}