{"auto_keywords": [{"score": 0.04523169088523293, "phrase": "proposed_method"}, {"score": 0.008713768692145006, "phrase": "random_decision_particle_swarm_optimization"}, {"score": 0.008171089473270256, "phrase": "pls"}, {"score": 0.00800566857978559, "phrase": "nir"}, {"score": 0.006187808604225469, "phrase": "wavelength_selection_method"}, {"score": 0.005888510149535773, "phrase": "quantitative_analysis"}, {"score": 0.004747141873785, "phrase": "near-infrared_spectral_quantitative_analysis"}, {"score": 0.004133852714087407, "phrase": "prediction_model"}, {"score": 0.0037163618245226755, "phrase": "particle_state"}, {"score": 0.003650984439966844, "phrase": "random_decision"}, {"score": 0.0036123093557208492, "phrase": "new_velocity"}, {"score": 0.003571470057490144, "phrase": "nir_data"}, {"score": 0.0035487559182107112, "phrase": "root-mean-square_error"}, {"score": 0.003496197936815105, "phrase": "meat_content_determination"}, {"score": 0.003437154518139677, "phrase": "fitness_function"}, {"score": 0.003434680272470304, "phrase": "combustion_procedure"}, {"score": 0.003338488030237325, "phrase": "higher_predictive_ability"}, {"score": 0.0033148624773111164, "phrase": "nir_spectral_data"}, {"score": 0.003256525090242806, "phrase": "selected_wavelengths"}, {"score": 0.0031765680020138733, "phrase": "faster_convergence_speed"}, {"score": 0.0031206568024609357, "phrase": "premature_convergence_problem"}, {"score": 0.002837305633114947, "phrase": "quantitative_analysis_models"}, {"score": 0.0028172167834968477, "phrase": "nir_spectral_datasets"}, {"score": 0.002260112998123604, "phrase": "prediction_precision"}, {"score": 0.002228203424338522, "phrase": "model_complexity"}, {"score": 0.0021049977753042253, "phrase": "john_wiley"}], "paper_keywords": ["near-infrared spectrum", " wavelength selection", " partial least squares", " random decision particle swarm optimization with attractor"], "paper_abstract": "In this paper, we proposed a wavelength selection method based on random decision particle swarm optimization with attractor for near-infrared (NIR) spectra quantitative analysis. The proposed method was incorporated with partial least square (PLS) to construct a prediction model. The proposed method chooses the current own optimal or the current global optimal to calculate the attractor. Then the particle updates its flight velocity by the attractor, and the particle state is updated by the random decision with the new velocity. Moreover, the root-mean-square error of cross-validation is adopted as the fitness function for the proposed method. In order to demonstrate the usefulness of the proposed method, PLS with all wavelengths, uninformative variable elimination by PLS, elastic net, genetic algorithm combined with PLS, the discrete particle swarm optimization combined with PLS, the modified particle swarm optimization combined with PLS, the neighboring particle swarm optimization combined with PLS, and the proposed method are used for building the components quantitative analysis models of NIR spectral datasets, and the effectiveness of these models is compared. Two application studies are presented, which involve NIR data obtained from an experiment of meat content determination using NIR and a combustion procedure. Results verify that the proposed method has higher predictive ability for NIR spectral data and the number of selected wavelengths is less. The proposed method has faster convergence speed and could overcome the premature convergence problem. Furthermore, although improving the prediction precision may sacrifice the model complexity under a certain extent, the proposed method is overfitted slightly. Copyright (c) 2015 John Wiley & Sons, Ltd. The paper proposed a wavelength selection method based on random decision particle swarm optimization with attractor for near-infrared (NIR) spectra quantitative analysis. Two application studies are presented, which involve NIR data obtained from an experiment of meat content determination and a combustion procedure. Results verify that the proposed method has higher predictive ability for NIR spectral data and the number of selected wavelengths is less. Furthermore, the proposed method has faster convergence speed and could overcome the premature convergence problem.", "paper_title": "A wavelength selection method based on random decision particle swarm optimization with attractor for near-infrared spectral quantitative analysis", "paper_id": "WOS:000355229400003"}