{"auto_keywords": [{"score": 0.040012451990183516, "phrase": "additional_condition"}, {"score": 0.004715908063787721, "phrase": "computational_problems"}, {"score": 0.004317109072311102, "phrase": "integer_k"}, {"score": 0.004250302819248558, "phrase": "biclique_cover_problem"}, {"score": 0.003931402465972151, "phrase": "biclique_partition_problem"}, {"score": 0.003542976343910816, "phrase": "biclique_vertex-cover_problem"}, {"score": 0.0032769720645483102, "phrase": "biclique_vertex-partition_problem"}, {"score": 0.0030466955629231047, "phrase": "mutually_vertex-disjoint"}, {"score": 0.0029388782830111005, "phrase": "np"}, {"score": 0.002633425544817301, "phrase": "parameterized_complexity"}, {"score": 0.002299921909935613, "phrase": "first_two_problems"}, {"score": 0.0021945833590668973, "phrase": "latter_two_problems"}], "paper_keywords": ["Bicliques", " Parameterized complexity", " Covering and partitioning problems"], "paper_abstract": "We consider computational problems on covering graphs with bicliques (complete bipartite subgraphs). Given a graph and an integer k, the biclique cover problem asks whether the edge-set of the graph can be covered with at most k bicliques; the biclique partition problem is defined similarly with the additional condition that the bicliques are required to be mutually edge-disjoint. The biclique vertex-cover problem asks whether the vertex-set of the given graph can be covered with at most k bicliques, the biclique vertex-partition problem is defined similarly with the additional condition that the bicliques are required to be mutually vertex-disjoint. All these four problems are known to be NP-complete even if the given graph is bipartite. In this paper, we investigate them in the framework of parameterized complexity: do the problems become easier if k is assumed to be small? We show that, considering k as the parameter, the first two problems are fixed-parameter tractable, while the latter two problems are not fixed-parameter tractable unless P = NP. (C) 2008 Elsevier B.V. All rights reserved.", "paper_title": "Covering graphs with few complete bipartite subgraphs", "paper_id": "WOS:000266178200010"}