{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "secret_keys"}, {"score": 0.004217925382695912, "phrase": "start-up_values"}, {"score": 0.0041842092128678105, "phrase": "standard_static_random_access_memories"}, {"score": 0.004003511299646736, "phrase": "memory_cells"}, {"score": 0.0038614646772981848, "phrase": "registration_phase"}, {"score": 0.0035635256137029592, "phrase": "complex_laboratory_setup"}, {"score": 0.003437036036889996, "phrase": "standard_low-power_sram_modules"}, {"score": 0.00321019328631004, "phrase": "simple_registration"}, {"score": 0.0030468495296763617, "phrase": "worst_case_bit_error_probability"}, {"score": 0.002868646843975439, "phrase": "secret_key"}, {"score": 0.0027556576784848207, "phrase": "worst_case"}, {"score": 0.0027446057983474994, "phrase": "minimum_entropy_value"}, {"score": 0.0025633455664747606, "phrase": "full_entropy"}, {"score": 0.0024623517958288228, "phrase": "standard_digital_designs"}, {"score": 0.0024230746206056536, "phrase": "external_power_supply"}, {"score": 0.002394034222105701, "phrase": "sram"}, {"score": 0.0023369711258107244, "phrase": "simple_circuitry"}, {"score": 0.0022721178679337025, "phrase": "latter_case"}, {"score": 0.0021219954544970878, "phrase": "active_area"}], "paper_keywords": ["SRAMs", " PUFs", " random numbers", " hardware security"], "paper_abstract": "This paper presents a method to simultaneously improve the quality of the identifiers, secret keys, and random numbers that can be generated from the start-up values of standard static random access memories (SRAMs). The method is based on classifying memory cells after evaluating their start-up values at multiple measurements in a registration phase. The registration can be done without unplugging the device from its application context, and with no need for a complex laboratory setup. The method has been validated experimentally with standard low-power SRAM modules in two different application specific integrated circuits (ASICs) fabricated with the 90-nm TSMC technology. The results show that with a simple registration the length of the identifiers can be reduced by 45%, the worst case bit error probability (which defines the complexity of the error correcting code needed to recover a secret key) can be reduced by 64%, and the worst case minimum entropy value is improved, thus reducing the number of bits that have to be processed to obtain full entropy by 81%. The method can be applied to standard digital designs by controlling the external power supply to the SRAM using software or by incorporating simple circuitry in the design. In the latter case, a module for implementing the method in an ASIC designed in the 90-nm TSMC technology occupies an active area of 42,025 mu m(2).", "paper_title": "Improved Generation of Identifiers, Secret Keys, and Random Numbers From SRAMs", "paper_id": "WOS:000370000800014"}