{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "structurally_complex_data"}, {"score": 0.012993992355244507, "phrase": "reference_models"}, {"score": 0.00842664442383238, "phrase": "reference_model_generation_method"}, {"score": 0.004399905285945236, "phrase": "structurally_complex_individual"}, {"score": 0.004193316635088688, "phrase": "time_series"}, {"score": 0.0040569185796103845, "phrase": "domain-dependent_hierarchies"}, {"score": 0.003948613642680196, "phrase": "population_groups"}, {"score": 0.0038780151896468194, "phrase": "population_archetype"}, {"score": 0.0037069717781636194, "phrase": "patient_evolution"}, {"score": 0.003673675864705682, "phrase": "control_groups"}, {"score": 0.0035648266669315943, "phrase": "conceptual_model"}, {"score": 0.003397313647699294, "phrase": "similarity_tree_concept"}, {"score": 0.0032966258317691354, "phrase": "outlier_detection"}, {"score": 0.003066945490483524, "phrase": "structurally_complex_individuals"}, {"score": 0.0030393807371663934, "phrase": "key_idea"}, {"score": 0.002976019715894587, "phrase": "event-based_analysis"}, {"score": 0.002958159666874001, "phrase": "modeling_time_series"}, {"score": 0.0029139757013408926, "phrase": "proposed_framework"}, {"score": 0.002861822702206142, "phrase": "medical_field"}, {"score": 0.0028021527740710508, "phrase": "outlier_detection_method"}, {"score": 0.002702733794508487, "phrase": "outlier_ratings"}, {"score": 0.0025371413754846474, "phrase": "k-fold_cross_validation"}, {"score": 0.0022971354864013073, "phrase": "control_group"}, {"score": 0.0022492129111567824, "phrase": "correct_result"}], "paper_keywords": ["Data mining", " time series", " reference models", " structurally complex data", " outlier detection"], "paper_abstract": "Objectives: We present a framework specially designed to deal with structurally complex data, where all individuals have the same structure, as is the case in many medical domains. A structurally complex individual may be composed of any type of single-valued or multivalued attributes, including time series, for example. These attributes are structured according to domain-dependent hierarchies. Our aim is to generate reference models of population groups. These models represent the population archetype and are very useful for supporting such important tasks as diagnosis, detecting fraud, analyzing patient evolution, identifying control groups, etc. Methods: We have developed a conceptual model to represent structurally complex data hierarchically. Additionally, we have devised a method that uses the similarity tree concept to measure how similar two structurally complex individuals are, plus an outlier detection and filtering method. These methods provide the groundwork for the method that we have designed for generating reference models of a set of structurally complex individuals. A key idea of this method is to use event-based analysis for modeling time series. Results: The proposed framework has been applied to the medical field of stabilometry. To validate the outlier detection method we used 142 individuals, and there was a match between the outlier ratings by the experts and by the system for 139 individuals (97.8%). To validate the reference model generation method, we applied k-fold cross validation (k = 5) with 60 athletes (basketball players and ice-skaters), and the system correctly classified 55 (91.7%). We then added 30 non-athletes as a control group, and the method output the correct result in a very high percentage of cases (96.6%). Conclusions: We have achieved very satisfactory results for the tests on data from such a complex domain as stabilometry and for the comparison of the reference model generation method with other methods. This supports the validity of this framework.", "paper_title": "Generating Reference Models for Structurally Complex Data", "paper_id": "WOS:000326480900009"}