{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "program_analyses"}, {"score": 0.00462919213721188, "phrase": "new_release"}, {"score": 0.004378182273895574, "phrase": "modern_development_environments"}, {"score": 0.004321448425586127, "phrase": "eclipse"}, {"score": 0.0040467190009206445, "phrase": "relevant_properties"}, {"score": 0.0038271712887391015, "phrase": "refactoring_tools"}, {"score": 0.00376488621224566, "phrase": "poor_results"}, {"score": 0.003728000957725218, "phrase": "underlying_analyses"}, {"score": 0.0036793800647811365, "phrase": "tool's_usefulness"}, {"score": 0.003607630811220324, "phrase": "bug_finding_tool"}, {"score": 0.003537275726870251, "phrase": "underlying_analysis"}, {"score": 0.002962543869356265, "phrase": "false_positives"}, {"score": 0.0025638362414466278, "phrase": "analysis's_results"}, {"score": 0.002497319603143104, "phrase": "simple_language"}, {"score": 0.0023850311572318496, "phrase": "necessary_and_sufficient_reasons"}, {"score": 0.0021049977753042253, "phrase": "interactive_use"}], "paper_keywords": ["measurement", " reliability", " documentation"], "paper_abstract": "With programs getting larger and often more complex with each new release, programmers need all the help they can get in understanding and transforming programs. Fortunately, modern development environments, such as Eclipse, incorporate tools for understanding, navigating, and transforming programs. These tools typically use program analyses to extract relevant properties of programs. These tools are often invaluable to developers; for example, many programmers use refactoring tools regularly. However, poor results by the underlying analyses can compromise a tool's usefulness. For example, a bug finding tool may produce too many false positives if the underlying analysis is overly conservative, and thus overwhelm the user with too many possible errors in the program. In such cases it would be invaluable for the tool to explain to the user why it believes that each bug exists. Armed with this knowledge, the user can decide which bugs are worth pursing and which are false positives. The contributions of this paper are as follows: (i) We describe requirements on the structure of an analysis so that we can produce reasons when the analysis fails; the user of the analysis determines whether or not an analysis's results constitute failure. We also describe a simple language that enforces these requirements; (ii) We describe how to produce necessary and sufficient reasons for analysis failure; (iii) We evaluate our system with respect to a number of analyses and programs and find that most reasons are small ( and thus usable) and that our system is fast enough for interactive use.", "paper_title": "Explaining failures of program analyses", "paper_id": "WOS:000257820400024"}