{"auto_keywords": [{"score": 0.03941864421624202, "phrase": "rtl_ips"}, {"score": 0.02937361584816291, "phrase": "control_structure"}, {"score": 0.00481495049065317, "phrase": "ip_block-based_design"}, {"score": 0.004768131202045408, "phrase": "vlsi"}, {"score": 0.0047448515702010734, "phrase": "dedicated_digital_signal_processing_systems"}, {"score": 0.004198839649063847, "phrase": "also_design"}, {"score": 0.00413767314434795, "phrase": "high_level"}, {"score": 0.003940122359770492, "phrase": "synthesizable_register_transfer_level"}, {"score": 0.0037888687452790953, "phrase": "automatic_assembly"}, {"score": 0.0035902958977673313, "phrase": "implementation_constraints"}, {"score": 0.0030696773722514105, "phrase": "extra_interface_circuitry"}, {"score": 0.0029807934480637855, "phrase": "control_structures"}, {"score": 0.0024383967028975616, "phrase": "formal_theory"}, {"score": 0.002414616656410503, "phrase": "adcm"}, {"score": 0.0023104373174118458, "phrase": "optimal_solutions"}, {"score": 0.0022107428653358715, "phrase": "synthetic_example"}], "paper_keywords": ["delay correction method", " digital signal processing (DSP) VLSI systems", " finite state machine (FSM) modification and register insertion", " generic functional and register transfer level (RTL) IPs", " hardware synthesis", " Intellectual Property (IP)-based design"], "paper_abstract": "The Intellectual Property (IP)-based design for high-throughput dedicated digital signal processing (DSP) systems is obviously an important issue for improving not only design productivity, but also design from the high level of abstraction. However, in some cases, synthesizable register transfer level (RTL) model obtained by an automatic assembly of RTL IPs can be wrong due to delays induced by implementation constraints. In this paper, we present the formalization of the problem and propose an approach called automatic delay correction method (ADCM) to solve the problem without inserting an extra interface circuitry. The approach automatically inserts control structures to manage delays induced by the use of RTL IPs. It also inserts a control structure to coordinate the execution of parallel clocked IPs. The delays may be managed by registers or by counters included in the control structure. A formal theory of ADCM is developed to guide the implementation and guarantee optimal solutions in latency and area. Through experiments with synthetic example and three real world high-throughput DSP circuits, we also show the effectiveness of our approach.", "paper_title": "Automatic delay correction method for IP block-based design of VLSI dedicated digital signal processing systems: Theoretical foundations and implementation", "paper_id": "WOS:000237932600004"}