{"auto_keywords": [{"score": 0.04488170016920937, "phrase": "multimedia_content"}, {"score": 0.015719716506582538, "phrase": "multimedia_contents"}, {"score": 0.0046269981365987915, "phrase": "som-like_algorithm"}, {"score": 0.004188459638572375, "phrase": "one-dimensional_map"}, {"score": 0.0039651694106206245, "phrase": "density_distribution"}, {"score": 0.003716520760680603, "phrase": "\"viewing_behavior_of_crowds\"_information"}, {"score": 0.003380791705551809, "phrase": "new_users"}, {"score": 0.0031061129850110994, "phrase": "time-efficient_viewing"}, {"score": 0.0027148677103585985, "phrase": "internet_environment"}], "paper_keywords": ["wisdom of crowds", " collective intelligence", " multimedia contents", " summarization", " self-organizing map (SOM)"], "paper_abstract": "We propose in this paper a SOM-like algorithm that accepts online, as inputs, starts and ends of viewing of a multimedia content by many users; a one-dimensional map is then self-organized, providing an approximation of density distribution showing how many users see a part of a multimedia content. In this way \"viewing behavior of crowds\" information is accumulated as experience accumulates, summarized into one SOM-like network as knowledge is extracted, and is presented to new users as the knowledge is transmitted. Accumulation of multimedia contents on the Internet increases the need for time-efficient viewing of the contents and the possibility of compiling information on many users' viewing experiences. In the circumstances, a system has been proposed that presents, in the Internet environment, a kind of summary of viewing records of many viewers of a multimedia content. The summary is expected to show that some part is seen by many users but some part is rarely seen. The function is similar to websites utilizing \"wisdom of crowds\" and is facilitated by our proposed algorithm.", "paper_title": "Utilizing \"wisdom of crowds\" for handling multimedia contents", "paper_id": "WOS:000250094800021"}