{"auto_keywords": [{"score": 0.04954397446159371, "phrase": "association_studies"}, {"score": 0.02322730111336097, "phrase": "prior_information"}, {"score": 0.004707913053935566, "phrase": "recent_technological_developments"}, {"score": 0.00462919213721188, "phrase": "genetic_variation"}, {"score": 0.004450568197899267, "phrase": "genome-wide_association_studies"}, {"score": 0.004278807087784626, "phrase": "human_disease"}, {"score": 0.004090577229368418, "phrase": "genetic_information"}, {"score": 0.003266201217790818, "phrase": "novel_method"}, {"score": 0.00319348234663792, "phrase": "association_statistic"}, {"score": 0.0028373742057129126, "phrase": "traditional_methods"}, {"score": 0.0026820015810254004, "phrase": "hapmap_data"}, {"score": 0.002450864311898833, "phrase": "standard_methods"}, {"score": 0.0021049977753042253, "phrase": "statistical_power"}], "paper_keywords": [""], "paper_abstract": "Recent technological developments in measuring genetic variation have ushered in an era of genome-wide association studies which have discovered many genes involved in human disease. Current methods to perform association studies collect genetic information and compare the frequency of variants in individuals with and without the disease. Standard approaches do not take into account any information on whether or not a given variant is likely to have an effect on the disease. We propose a novel method for computing an association statistic which takes into account prior information. Our method improves both power and resolution by 8% and 27%, respectively, over traditional methods for performing association studies when applied to simulations using the HapMap data. Advantages of our method are that it is as simple to apply to association studies as standard methods, the results of the method are interpretable as the method reports p-values, and the method is optimal in its use of prior information in regards to statistical power.", "paper_title": "Incorporating prior information into association studies", "paper_id": "WOS:000305419800019"}