{"auto_keywords": [{"score": 0.050070056218378914, "phrase": "michael_jackson"}, {"score": 0.03915514201946942, "phrase": "twitter"}, {"score": 0.004778258911940497, "phrase": "purpose_-_grieving"}, {"score": 0.004652016085325825, "phrase": "loved_one"}, {"score": 0.0045464538515249085, "phrase": "painful_process"}, {"score": 0.004359078118356132, "phrase": "difficult_period"}, {"score": 0.004195418010131832, "phrase": "role_microblogs_play"}, {"score": 0.004007083686875716, "phrase": "public_figure"}, {"score": 0.0038271712887391015, "phrase": "-_content_analysis"}, {"score": 0.0036553070575015344, "phrase": "michael_jackson's_death"}, {"score": 0.003613556291453534, "phrase": "coding_instrument"}, {"score": 0.0034777887763821425, "phrase": "jackson's_death"}, {"score": 0.003347105144425849, "phrase": "entire_dataset"}, {"score": 0.0029722900280316216, "phrase": "single_largest_category"}, {"score": 0.0025596276616952516, "phrase": "high_proportion"}, {"score": 0.0022296340517805125, "phrase": "present_research"}, {"score": 0.0021049977753042253, "phrase": "grieving_process"}], "paper_keywords": ["Microblogs", " Grieving", " Content analysis", " Death", " Loss"], "paper_abstract": "Purpose - Grieving resulting from the death of a loved one or someone familiar is a painful process and individuals invariably seek support to help them through this difficult period. In this study, the paper investigates the role microblogs play by exploring the types of messages following the death of a public figure, Michael Jackson, \"the King of Pop\". Design/methodology/approach - Content analysis was conducted using 50,000 tweets harvested from Twitter from the first 12 days after Michael Jackson's death. A coding instrument characterizing a set of categories that users posted about Jackson's death was inductively constructed, and then applied to the entire dataset of tweets. Findings - About 50 per cent of tweets fell into categories commonly associated with expressions of emotions or thoughts due to death. However, as the single largest category, Twitter was used primarily as a platform for sharing news and other information. Surprisingly, categories not normally associated with grieving, such as spreading of rumours, expressions of hatred and spam, also occupied a high proportion of tweets. Originality/value - There has been little work done in examining microblogs as platforms for giving and receiving support in general and, more specifically, for the expression of grief. Therefore, the present research is timely, as it seeks to understand the role microblogs play in the grieving process.", "paper_title": "An analysis of tweets in response to the death of Michael Jackson", "paper_id": "WOS:000297959100001"}