{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "nasogastric_tube_insertion"}, {"score": 0.004561019117546361, "phrase": "nursing_faculty_shortage"}, {"score": 0.004262273304740847, "phrase": "nursing_students"}, {"score": 0.004204904449336037, "phrase": "simulation_technology"}, {"score": 0.0034780071331554003, "phrase": "pc-based_software_simulator"}, {"score": 0.0033393377529146893, "phrase": "nursing_skill_acquisition"}, {"score": 0.0032279990773657215, "phrase": "software_simulator"}, {"score": 0.0027616550517346066, "phrase": "standard_training"}, {"score": 0.002669525619637691, "phrase": "static_mannequins"}, {"score": 0.002598034157587518, "phrase": "nursing_instructors"}, {"score": 0.002427549902743566, "phrase": "nursing_class"}], "paper_keywords": ["Clinical skill", " Educational technology", " Nursing education", " Patient simulation"], "paper_abstract": "The nursing faculty shortage has created the need for more innovative and effective ways to better stimulate nursing students. Simulation technology is one way to increase the effectiveness of teaching faculty. In this article, a collaborative. project between the College of Nursing and College of Engineering at the University of South Florida to develop and evaluate a PC-based software simulator based on videogame technologies for nursing skill acquisition is discussed. A software simulator for teaching and assessing mastery of the procedure for nasogastric tube insertion is described. The purpose of the simulator is to complement the standard training of nasogastric tube insertion that uses static mannequins and instruction/assessment by nursing instructors. The simulator was used in a fundamentals of nursing class at the University of South Florida, with 75 students enrolled. Evaluation showed that the simulator significantly increased the confidence of the students in their ability to perform nasogastric tube insertion.", "paper_title": "Development of a Nasogastric Tube Insertion Simulator A Collaborative Interdisciplinary Effort", "paper_id": "WOS:000263997900005"}