{"auto_keywords": [{"score": 0.03577773358930474, "phrase": "self-regulating_questions"}, {"score": 0.02322730111336098, "phrase": "spatial_thinking"}, {"score": 0.02306687153905472, "phrase": "virtual_spaces"}, {"score": 0.006765350478401553, "phrase": "virtual_reality"}, {"score": 0.00469740813902244, "phrase": "software_environment"}, {"score": 0.004566567411073082, "phrase": "theoretical_views"}, {"score": 0.004518442937844318, "phrase": "learning_process"}, {"score": 0.003923023699005215, "phrase": "user's_abilities"}, {"score": 0.00388165472334023, "phrase": "spatial_images"}, {"score": 0.0029253546782349875, "phrase": "virtual_realty"}, {"score": 0.0021501863832966966, "phrase": "high_order_skills"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Virtual reality", " Interactive learning environments", " Applications in subject areas", " Improving classroom teaching", " Evaluation of CAL systems"], "paper_abstract": "Developing a software environment to enhance 3D geometric proficiency demands the consideration of theoretical views of the learning process. Simultaneously. this effort requires taking into account the range of tools that technology offers, as well as their limitations. In this paper, we report on the design of Virtual Spaces 1.0 software, a program that exercises the user's abilities to build spatial images and to manipulate them. This paper also reports on a study that aimed to assess whether those abilities affected achievements in the spatial thinking of 10th graders who worked with the software. Additionally, we investigated whether self-regulating questions can improve the effect of exercising with Virtual Spaces 1.0. The sample was 192 students, who were randomly assigned to four groups, two of which used Virtual Spaces 1.0 (Group I with virtual reality and self-regulating questions N = 52, Group 2 with virtual realty only N = 52) and the other two the non-Virtual Spaces 1.0 (Group 3 self-regulating questions only N = 45, Group 4 non-treatment group N = 45). The results suggest that spatial thinking was enhanced by exercising with Virtual Spaces 1.0 and asking self-regulating questions. in addition, it was found that the self-regulating questions make the use of virtual reality more efficient, and that the influence of self-regulating questions is especially manifested in tasks that make use of high order skills. (C) 2009 Elsevier Ltd. All rights reserved.", "paper_title": "Enhancement of spatial thinking with Virtual Spaces 1.0", "paper_id": "WOS:000272310100012"}