{"auto_keywords": [{"score": 0.034895414887102565, "phrase": "cbr_system"}, {"score": 0.01346483528343231, "phrase": "creative_ability"}, {"score": 0.01123495206206376, "phrase": "creative_cognition_theory"}, {"score": 0.00481495049065317, "phrase": "creative_problem"}, {"score": 0.004765016982888318, "phrase": "case-based_reasoning_system"}, {"score": 0.004570384351035464, "phrase": "ever-increasing_computer_capabilities"}, {"score": 0.004511200093569568, "phrase": "creativity_support_systems"}, {"score": 0.004326889832663823, "phrase": "organizational_creativity"}, {"score": 0.004293175778663009, "phrase": "prior_research"}, {"score": 0.004226530361866316, "phrase": "main_effects"}, {"score": 0.004150078386577378, "phrase": "interaction_effects"}, {"score": 0.003959752657656169, "phrase": "case-based_reasoning"}, {"score": 0.003939177872422153, "phrase": "cbr"}, {"score": 0.0038277259893677576, "phrase": "analogical_reasoning"}, {"score": 0.0037584605950099275, "phrase": "business_problems"}, {"score": 0.0036712368673314177, "phrase": "cbr_technology"}, {"score": 0.0036426128090286353, "phrase": "individual_creativity"}, {"score": 0.003272993685529221, "phrase": "diverse_set"}, {"score": 0.003172061898951532, "phrase": "lower_creative_ability"}, {"score": 0.0030343641388997124, "phrase": "remote_problem_domains"}, {"score": 0.002910215315245169, "phrase": "problem_domain"}, {"score": 0.0028724674034965115, "phrase": "remote_cases"}, {"score": 0.0027984299898350697, "phrase": "larger_set"}, {"score": 0.0027838524522031034, "phrase": "diverse_cases"}, {"score": 0.002380041835651809, "phrase": "sufficiently_large_and_diverse_set"}, {"score": 0.002223735193987195, "phrase": "practical_note"}, {"score": 0.002127116019185069, "phrase": "cbr_approach"}], "paper_keywords": ["case-based reasoning", " creative problem solving", " creativity support systems", " creative cognition theory", " domain knowledge", " marketing campaigns"], "paper_abstract": "Attention for the division of work between computers and humans is growing due to ever-increasing computer capabilities. Over the past decades, creativity support systems (CSSs) have gained ground as a means to enhance individual, group, and organizational creativity. Whereas prior research has focused primarily on the main effects of CSSs, we explore the interaction effects with the creative ability of the individual. In this paper, we investigate the use of the case-based reasoning (CBR) technology, which is based on the principle of analogical reasoning, to aid individuals in solving business problems creatively. The expectations as to why the CBR technology should enhance individual creativity, and under what conditions (i.e., the type and number of cases that are made available), are derived from creative cognition theory, and are tested empirically. In a series of studies, a CBR system loaded with a diverse set of cases was found to enhance the performance of individuals with lower creative ability, but it did not help the most creative individuals. Although the literature suggests that cases from remote problem domains should lead to more novel solutions, loading the CBR system only with cases closely related to the problem domain proved more effective than remote cases only. Finally, loading the CBR system with a larger set of diverse cases was found to positively influence the creativity of the solutions. These findings have the following implications for CSSs and creative cognition theory: (1) when considering the effectiveness of CSSs it is important to take into account the creative ability of the individual (i.e., \"one size does not fit all\"), (2) making a sufficiently large and diverse set of cases available is better for stimulating creativity, and (3) providing cases that are too remote may be counterproductive. On a practical note, organizations seeking to redesign their division of labor between individuals and machines can easily follow the CBR approach presented here using their own set of cases.", "paper_title": "Supporting Creative Problem Solving with a Case-Based Reasoning System", "paper_id": "WOS:000345922700013"}