{"auto_keywords": [{"score": 0.03483809260190114, "phrase": "proposed_method"}, {"score": 0.011901967451775526, "phrase": "true_matches"}, {"score": 0.00481495049065317, "phrase": "concurrent_image_retrieval"}, {"score": 0.004776484866276242, "phrase": "roi_segmentation"}, {"score": 0.004662913362513954, "phrase": "probabilistic_generative_model"}, {"score": 0.004533806239310673, "phrase": "image_retrieval"}, {"score": 0.00426900754050533, "phrase": "proposed_model"}, {"score": 0.004150761431291174, "phrase": "matching_process"}, {"score": 0.004084662575167727, "phrase": "different_images"}, {"score": 0.003971502222405927, "phrase": "geometric_transformation"}, {"score": 0.003939748053452577, "phrase": "typical_spatial_location"}, {"score": 0.0038152404172111815, "phrase": "visual_similarity"}, {"score": 0.0033958933279327076, "phrase": "roi"}, {"score": 0.0032231139180761183, "phrase": "suitable_roi_segmentation"}, {"score": 0.003022465992278672, "phrase": "query_image"}, {"score": 0.002857143106182505, "phrase": "geometrically_constrained_matching"}, {"score": 0.0026471070725516467, "phrase": "proposed_technique"}, {"score": 0.002584035742991537, "phrase": "roi."}, {"score": 0.002327594516681507, "phrase": "image_segmentation"}, {"score": 0.002308953751676031, "phrase": "object_detection"}, {"score": 0.0022904619303011097, "phrase": "multi-object_image_retrieval_tasks"}], "paper_keywords": ["Image retrieval", " Object segmentation", " Object recognition", " Image Databases", " Computer Vision"], "paper_abstract": "This paper proposes a probabilistic generative model that concurrently tackles the problems of image retrieval and region-of-interest (ROI) segmentation. Specifically, the proposed model takes into account several properties of the matching process between two objects in different images, namely: objects undergoing a geometric transformation, typical spatial location of the region of interest, and visual similarity. In this manner, our approach improves the reliability of detected true matches between any pair of images. Furthermore, by taking advantage of the links to the ROI provided by the true matches, the proposed method is able to perform a suitable ROI segmentation. Finally, the proposed method is able to work when there is more than one ROI in the query image. Our experiments on two challenging image retrieval datasets proved that our approach clearly outperforms the most prevalent approach for geometrically constrained matching and compares favorably to most of the state-of-the-art methods. Furthermore, the proposed technique concurrently provided very good segmentations of the ROI. Furthermore, the capability of the proposed method to take into account several objects-of-interest was also tested on three experiments: two of them concerning image segmentation and object detection in multi-object image retrieval tasks, and another concerning multiview image retrieval. These experiments proved the ability of our approach to handle scenarios in which more than one object of interest is present in the query.", "paper_title": "A Generative Model for Concurrent Image Retrieval and ROI Segmentation", "paper_id": "WOS:000328948100015"}