{"auto_keywords": [{"score": 0.03529624542703246, "phrase": "technology_divergence"}, {"score": 0.009003564184418136, "phrase": "solar_energy_technology"}, {"score": 0.00481495049065317, "phrase": "solar_energy_industry"}, {"score": 0.004563182153397349, "phrase": "far-reaching_theoretical_significance"}, {"score": 0.0044514440242754815, "phrase": "chain_mode"}, {"score": 0.004414806639101985, "phrase": "technology_development"}, {"score": 0.004218602458288531, "phrase": "technology_evolution"}, {"score": 0.004115267130977749, "phrase": "patentometric_analysis"}, {"score": 0.003916098498242888, "phrase": "technology_co-classification_analysis"}, {"score": 0.003473529187092258, "phrase": "direct_manner"}, {"score": 0.003444912629614206, "phrase": "continuously_advancing_character"}, {"score": 0.003171358146412577, "phrase": "chain_reaction"}, {"score": 0.0030935955379958395, "phrase": "technology_convergence"}, {"score": 0.0026324658253309673, "phrase": "chain_progress"}, {"score": 0.0024535580495414783, "phrase": "regular_phenomenon"}, {"score": 0.00240328454980006, "phrase": "specific_technology_area"}, {"score": 0.002344311033783139, "phrase": "sustainable_development"}, {"score": 0.0022214412809055013, "phrase": "general_principles"}, {"score": 0.00213131678182067, "phrase": "empirical_studies"}, {"score": 0.0021049977753042253, "phrase": "patent_analysis"}], "paper_keywords": ["Technology divergence and convergence", " Technology-relatedness", " Solar energy industry", " Patent analysis", " Co-classification analysis", " Jaccard index"], "paper_abstract": "Exploring and measuring technology-relatedness and its collateral technology divergence and convergence, would have far-reaching theoretical significance and academic value on the chain mode of technology development, and also on the mastery of the laws for technology evolution and progress. Taking the patentometric analysis of solar energy technology worldwide as a case, employing the methodology of technology co-classification analysis, choosing two indicators, namely, mean technology co-classification partners (MTCP) and mean technology co-classification index (MTCI), we have analyzed and measured the evolving process of technology-relatedness. The results not only demonstrate in a direct manner the continuously advancing character of solar energy technology in the tensions of technology divergence and convergence, but also reveal quantitatively that, due to the chain reaction of technology-relatedness, technology divergence and technology convergence would tend to evolve in parallel. Through these, it is indicated that technology divergence and technology convergence are two trends which would develop separately, react mutually, and serve as causation for each other, thus making chain progress and continuously pushing forward the innovation, creation and upgrading of technologies. This is a regular phenomenon on condition that the specific technology area is in a status of sustainable development. It still awaits further research on how to verify and reveal the general principles on the interaction between technology divergence and convergence by conducting empirical studies and combining patent analysis.", "paper_title": "Divergence and convergence: technology-relatedness evolution in solar energy industry", "paper_id": "WOS:000325475300018"}