{"auto_keywords": [{"score": 0.047479561842280756, "phrase": "orthostatic_hypotension"}, {"score": 0.04224766813152223, "phrase": "passive_diffusion"}, {"score": 0.04143119734779176, "phrase": "logp"}, {"score": 0.00481495049065317, "phrase": "antitarget"}, {"score": 0.004769813339372972, "phrase": "target"}, {"score": 0.00351582806482809, "phrase": "side_effect_variability"}, {"score": 0.003410380718649286, "phrase": "cns_permeability"}, {"score": 0.003258090521354736, "phrase": "significant_differences"}, {"score": 0.002840708910768261, "phrase": "target_potency"}, {"score": 0.002713788077665689, "phrase": "anticancer_agents"}, {"score": 0.002618995204424126, "phrase": "drug_target"}, {"score": 0.002592523232809191, "phrase": "nonsedating_antihistamines"}, {"score": 0.0025533148412439166, "phrase": "empirical_set"}, {"score": 0.0024023079401125492, "phrase": "target_affinity"}, {"score": 0.0023183698048498797, "phrase": "efflux_effects"}], "paper_keywords": ["ABCB1", " LogP", " Data mining", " MRTD", " CNS permeability", " Antihistamines", " Antidepressants", " Antipsychotics"], "paper_abstract": "We examined the relationship between sedation and orthostatic hypotension, two central side effects and ABCB1 transporter-mediated efflux for a set of 64 launched drugs that are documented as histamine H1 receptor antagonists. This relationship was placed in the context of passive diffusion (estimated using LogP, the octanol/water partition coefficient), receptor affinity, and the adjusted therapeutic daily dose, in order to account for side effect variability. Within this set, CNS permeability was not dependent on passive diffusion, as no significant differences were found for LogP and its pH-corrected equivalent, LogD(74). Sedation and orthostatic hypotension can be explained within the framework of ABCB1-mediated efflux and adjusted dose, while target potency has less influence. ABCB1, an antitarget for anticancer agents, acts in fact as a drug target for nonsedating antihistamines. An empirical set of rules, based on the incidence of these two side effects, target affinity and dose was used to predict efflux effects for a number of drugs. Among them, azelastine and mizolastine are predicted to be effluxed via ABCB1-mediated transport, whereas aripiprazole, clozapine, cyproheptadine, iloperidone, olanzapine, and ziprasidone are likely to be noneffluxed.", "paper_title": "Transporter-Mediated Efflux Influences CNS Side Effects: ABCB1, from Antitarget to Target", "paper_id": "WOS:000275879300003"}