{"auto_keywords": [{"score": 0.04197548893255256, "phrase": "hmoea"}, {"score": 0.009612105607093982, "phrase": "external_archive"}, {"score": 0.008713768692145006, "phrase": "multiobjective_optimization_problems"}, {"score": 0.004658426838467567, "phrase": "evolutionary_algorithms"}, {"score": 0.004278807087784626, "phrase": "considerable_attentions"}, {"score": 0.004218602458288531, "phrase": "academic_and_industrial_communities"}, {"score": 0.004043003243656031, "phrase": "novel_hybrid_multiobjective_evolutionary_algorithm"}, {"score": 0.003948613642680196, "phrase": "real-valued_mops"}, {"score": 0.0037309384824565695, "phrase": "particle_swarm_optimization"}, {"score": 0.0036958398682001015, "phrase": "multiple_crossover_operators"}, {"score": 0.003378385493203297, "phrase": "nondominated_archive"}, {"score": 0.0028360962841331634, "phrase": "selfadaptive_selection_mechanism"}, {"score": 0.0027567336518542858, "phrase": "appropriate_crossover_operator"}, {"score": 0.0025922974876210194, "phrase": "different_instances"}, {"score": 0.002281376328251423, "phrase": "propagating_mechanism"}, {"score": 0.002259883463607508, "phrase": "computational_study"}, {"score": 0.0022070310530794097, "phrase": "three-objective_benchmark_problems"}, {"score": 0.0021049977753042253, "phrase": "previous_multiobjective_algorithms"}], "paper_keywords": ["Evolutionary algorithm", " multiobjective optimization", " multiple crossover operators with selfadaptive selection strategy"], "paper_abstract": "Recently, the hybridization between evolutionary algorithms and other metaheuristics has shown very good performances in many kinds of multiobjective optimization problems (MOPs), and thus has attracted considerable attentions from both academic and industrial communities. In this paper, we propose a novel hybrid multiobjective evolutionary algorithm (HMOEA) for real-valued MOPs by incorporating the concepts of personal best and global best in particle swarm optimization and multiple crossover operators to update the population. One major feature of the HMOEA is that each solution in the population maintains a nondominated archive of personal best and the update of each solution is in fact the exploration of the region between a selected personal best and a selected global best from the external archive. Before the exploration, a selfadaptive selection mechanism is developed to determine an appropriate crossover operator from several candidates so as to improve the robustness of the HMOEA for different instances of MOPs. Besides the selection of global best from the external archive, the quality of the external archive is also considered in the HMOEA through a propagating mechanism. Computational study on the biobjective and three-objective benchmark problems shows that the HMOEA is competitive or superior to previous multiobjective algorithms in the literature.", "paper_title": "A Hybrid Multiobjective Evolutionary Algorithm for Multiobjective Optimization Problems", "paper_id": "WOS:000314269200002"}