{"auto_keywords": [{"score": 0.039374904545240993, "phrase": "fault_detection"}, {"score": 0.02554469468056681, "phrase": "test_cube"}, {"score": 0.00481495049065317, "phrase": "lfsr-based_diagnostic_test_generation"}, {"score": 0.004620957579769604, "phrase": "linear-feedback_shift"}, {"score": 0.0046037124365759215, "phrase": "register-based_diagnostic_test_generation"}, {"score": 0.00448477700778838, "phrase": "test_cubes"}, {"score": 0.004271953920234395, "phrase": "linear_equations"}, {"score": 0.003387431241133385, "phrase": "first_mode"}, {"score": 0.0033370841436001597, "phrase": "diagnostic_test_cubes"}, {"score": 0.0028301536956600137, "phrase": "test_elimination"}, {"score": 0.00276725708403607, "phrase": "diagnostic_test_generation"}, {"score": 0.0027363334666886912, "phrase": "second_mode"}, {"score": 0.002685558057339722, "phrase": "diagnostic_test_cube"}, {"score": 0.002655544981260646, "phrase": "fault_pair"}, {"score": 0.0021049977753042253, "phrase": "experimental_results"}], "paper_keywords": ["Defect diagnosis", " diagnostic test generation", " linear-feedback shift register (LFSR)-based test generation"], "paper_abstract": "This paper describes a procedure that computes seeds for linear-feedback shift register-based diagnostic test generation. A conventional process first computes test cubes, and then computes seeds that produce them by solving sets of linear equations. With this process, a seed may not exists for a given test cube. To address this issue, the procedure described in this paper produces seeds directly. Staring from a seed for fault detection, it modifies the seed such that the test it produces will distinguish a pair of faults. The procedure is applied in two modes. The first mode does not require diagnostic test cubes. In this mode, the procedure attempts to modify a seed for fault detection so as to lose the detection of one of the faults on one of the outputs where the faults are detected. The procedure thus uses the concept of test elimination that was used earlier for diagnostic test generation. The second mode is guided by a diagnostic test cube for a fault pair that needs to be distinguished. The procedure modifies a seed so as to reduce the distance between the test that the seed produces and the test cube. Without the requirement to match all the specified values of the test cube, the procedure can produce a seed for distinguishing the pair of faults even when a seed for the given test cube does not exist. Experimental results are presented to demonstrate the effectiveness of the procedure.", "paper_title": "Computation of Seeds for LFSR-Based Diagnostic Test Generation", "paper_id": "WOS:000365222400010"}