{"auto_keywords": [{"score": 0.04957891638694609, "phrase": "imix"}, {"score": 0.049248469394552366, "phrase": "ritel"}, {"score": 0.00481495049065317, "phrase": "question_handling"}, {"score": 0.004568617813032014, "phrase": "basic_topics"}, {"score": 0.004319677360634253, "phrase": "qa_system"}, {"score": 0.004141877689172017, "phrase": "imix_and_ritel_systems"}, {"score": 0.004041546659145336, "phrase": "follow-up_question_handling_scheme"}, {"score": 0.0038346288310750804, "phrase": "other's_opposites"}, {"score": 0.002787181295054319, "phrase": "open_issues"}, {"score": 0.002738723329538677, "phrase": "existing_systems"}, {"score": 0.00263505298504827, "phrase": "common_architecture"}, {"score": 0.0025892330566358503, "phrase": "common_subtasks"}, {"score": 0.002405309378904663, "phrase": "typical_techniques"}, {"score": 0.002281971169774711, "phrase": "special_type"}, {"score": 0.0022660100755784057, "phrase": "follow-up_question"}, {"score": 0.002242277042923036, "phrase": "discourse_question"}, {"score": 0.0021049977753042253, "phrase": "basic_methods"}], "paper_keywords": [""], "paper_abstract": "One of the basic topics of question answering (QA) dialogue systems is how follow-up questions should be interpreted by a QA system. In this paper, we shall discuss our experience with the IMIX and Ritel systems, for both of which a follow-up question handling scheme has been developed, and corpora have been collected. These two systems are each other's opposites in many respects: IMIX is multimodal, non-factoid, black-box QA, while Ritel is speech, factoid, keyword-based QA. Nevertheless, we will show that they are quite comparable, and that it is fruitful to examine the similarities and differences. We shall look at how the systems are composed, and how real, non-expert, users interact with the systems. We shall also provide comparisons with systems from the literature where possible, and indicate where open issues lie and in what areas existing systems may be improved. We conclude that most systems have a common architecture with a set of common subtasks, in particular detecting follow-up questions and finding referents for them. We characterise these tasks using the typical techniques used for performing them, and data from our corpora. We also identify a special type of follow-up question, the discourse question, which is asked when the user is trying to understand an answer, and propose some basic methods for handling it.", "paper_title": "Follow-up question handling in the IMIX and Ritel systems: A comparative study", "paper_id": "WOS:000278274100006"}