{"auto_keywords": [{"score": 0.03982569637126584, "phrase": "nis"}, {"score": 0.00481495049065317, "phrase": "informatics_needs"}, {"score": 0.004673419478088128, "phrase": "health_information_technology_implementations"}, {"score": 0.004588389551682397, "phrase": "technical_system"}, {"score": 0.004273196830970426, "phrase": "nursing_information_systems"}, {"score": 0.0041666157975446564, "phrase": "human_factors_approach"}, {"score": 0.004044064541716598, "phrase": "nursing_information_system"}, {"score": 0.003997891221012094, "phrase": "human_factors"}, {"score": 0.003925103636905688, "phrase": "theoretical_and_methodological_underpinning"}, {"score": 0.003889206369317587, "phrase": "socio-technical_issues"}, {"score": 0.0037402558657576124, "phrase": "electronic_health_record"}, {"score": 0.0036721416244816455, "phrase": "hospital_system"}, {"score": 0.003531474887552889, "phrase": "three-hospital_health_system"}, {"score": 0.0034512514926836667, "phrase": "health_system"}, {"score": 0.0034118234596993836, "phrase": "scenario-based_evaluation_technique"}, {"score": 0.0032585499655442404, "phrase": "healthcare_delivery_system"}, {"score": 0.0031626225189867354, "phrase": "major_components"}, {"score": 0.003140888248194296, "phrase": "nis."}, {"score": 0.003126481516783286, "phrase": "research_team"}, {"score": 0.0031049948416547704, "phrase": "standardized_scenarios"}, {"score": 0.00307657476125683, "phrase": "major_functions"}, {"score": 0.003027462227648001, "phrase": "twelve_nurses"}, {"score": 0.0028191914473630394, "phrase": "nis_interface"}, {"score": 0.002793380001054064, "phrase": "usability_heuristics"}, {"score": 0.0025537472239953807, "phrase": "scenario-based_usability_testing"}, {"score": 0.002530359917257626, "phrase": "\"think-aloud\"_protocol_technique"}, {"score": 0.002472822097373027, "phrase": "patient_care"}, {"score": 0.002444544487772349, "phrase": "usability_evaluation"}, {"score": 0.002318566141177149, "phrase": "key_insights"}, {"score": 0.0022502481160673257, "phrase": "redesign_opportunities"}, {"score": 0.0021342613107011624, "phrase": "nurse_decision_makers"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ireland_ltd."}], "paper_keywords": ["User-computer interface", " Health information technology", " Nursing informatics", " Workflow", " Electronic health records", " Information systems"], "paper_abstract": "Purpose: The success of health information technology implementations is often tied to the impact the technical system will have on the work of the clinicians using them. Considering the role of nurses in healthcare, it is shocking that there is a lack of evaluations of nursing information systems in the literature. Here we report on how a human factors approach can be used to address barriers and facilitators to use of the nursing information system (NIS). Human factors engineering (HFE) approaches provide the theoretical and methodological underpinning to address these socio-technical issues. Methods: This study investigated the use of an NIS, a module of the electronic health record (EHR) previously implemented throughout the hospital system. The study took place in two hospitals (760 beds and 300 beds) within a three-hospital health system. Earlier in the year, the NIS was implemented throughout the health system. We applied a scenario-based evaluation technique in order to understand the barriers and facilitators to nurse use of the NIS as part of improving the healthcare delivery system. The scenarios were designed to have the nurses interact with the major components of the NIS. The research team developed the standardized scenarios to cover the major functions of the system. Results: Twelve nurses completed the study and results show that documentation within the NIS was hindered by several aspects of the interface. This paper discusses the themes associated with the usability of the NIS interface analyzing them using usability heuristics. The team also identified facilitators to use and proposed avenues to support or enhance these facilitators. Conclusions: This study examined the use of an NIS to standardize care and documentation in nursing. It used scenario-based usability testing, applying the \"think-aloud\" protocol technique to assess the use of the NIS in documenting patient care. This method of usability evaluation exposed an understanding of how nurses use the NIS and their perspective on the system. We hypothesize that this method will offer key insights into how the usability of the NIS not only impacts use but also informs redesign opportunities. In addition, this is one of the few rigorous studies of NIS and provides direction and recommendations for informaticians, developers and nurse decision makers. (C) 2013 Elsevier Ireland Ltd. All rights reserved.", "paper_title": "Use of a human factors approach to uncover informatics needs of nurses in documentation of care", "paper_id": "WOS:000326372800012"}