{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "interactive_decision_aids"}, {"score": 0.048670301158495306, "phrase": "temporal_distance"}, {"score": 0.03530305721681322, "phrase": "ida_communication_design"}, {"score": 0.0046269981365987915, "phrase": "concrete_versus_abstract_communications"}, {"score": 0.004188459638572375, "phrase": "abstract_consumer_needs"}, {"score": 0.004065156038847781, "phrase": "promising_alternative"}, {"score": 0.003945467978172845, "phrase": "temporal_distance_moderates"}, {"score": 0.003753738096719609, "phrase": "consumers'_mental_representation"}, {"score": 0.0036980501827538455, "phrase": "product_decision_problem"}, {"score": 0.0034660938095219846, "phrase": "consumption_timing"}, {"score": 0.003121636289442593, "phrase": "ida's_advice"}, {"score": 0.0028822890425197582, "phrase": "delayed_delivery"}, {"score": 0.0025571463140118805, "phrase": "perceived_transparency"}, {"score": 0.0025191653363555214, "phrase": "ida_process"}, {"score": 0.0021049977753042253, "phrase": "consumers'_mental_representations"}], "paper_keywords": ["construal level theory", " consumer behavior", " e-commerce", " interactive decision aids", " recommenders"], "paper_abstract": "Interactive decision aids (IDAs) typically use concrete, feature based approaches to interact with consumers. Recently, however, interaction designs that focus on communicating abstract consumer needs have been suggested as a promising alternative. This paper investigates how temporal distance moderates the effectiveness of these two competing IDA communication designs by its effect on consumers' mental representation of the product decision problem. Temporal distance is inherently connected to IDAs in two ways. Congruency between consumption timing (immediate versus distant) and IDA communication design (concrete versus abstract, respectively) increases the likelihood to accept the IDA's advice. This effect is also achieved by congruency between IDA process timing (immediate versus delayed delivery of recommendations) and IDA communication design (concrete versus abstract, respectively). We further show that this process is mediated by the perceived transparency of the IDA process. Managers and researchers need to take into account the importance of congruency between the user and the interface through which companies interact with their users and can further optimize IDAs so that they better match consumers' mental representations.", "paper_title": "Consumer Acceptance of Recommendations by Interactive Decision Aids: The Joint Role of Temporal Distance and Concrete Versus Abstract Communications", "paper_id": "WOS:000290549800009"}