{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "permissive_controller_synthesis"}, {"score": 0.00476697427418509, "phrase": "probabilistic_systems."}, {"score": 0.004695900553353526, "phrase": "novel_controller_synthesis_techniques"}, {"score": 0.004556901872357751, "phrase": "stochastic_two-player_games"}, {"score": 0.0038239757564863057, "phrase": "robust_controllers"}, {"score": 0.003729335910488339, "phrase": "unexpected_system_changes"}, {"score": 0.0035292625231068517, "phrase": "additional_constraints"}, {"score": 0.0033735490732324713, "phrase": "permissive_controller_synthesis_framework"}, {"score": 0.0031606404966938568, "phrase": "control_actions"}, {"score": 0.002816246391862638, "phrase": "possible_control_action"}, {"score": 0.002496722870659199, "phrase": "specified_system_property"}, {"score": 0.0021912600076114033, "phrase": "mixed_integer_linear_programming"}, {"score": 0.0021049977753042253, "phrase": "case_studies"}], "paper_keywords": ["probabilistic verification", " controller synthesis", " stochastic games"], "paper_abstract": "We propose novel controller synthesis techniques for probabilistic systems modelled using stochastic two-player games: one player acts as a controller, the second represents its environment, and probability is used to capture uncertainty arising due to, for example, unreliable sensors or faulty system components. Our aim is to generate robust controllers that are resilient to unexpected system changes at runtime, and flexible enough to be adapted if additional constraints need to be imposed. We develop a permissive controller synthesis framework, which generates multi-strategies for the controller, offering a choice of control actions to take at each time step. We formalise the notion of permissivity using penalties, which are incurred each time a possible control action is disallowed by a multi-strategy. Permissive controller synthesis aims to generate a multi-strategy that minimises these penalties, whilst guaranteeing the satisfaction of a specified system property. We establish several key results about the optimality of multi-strategies and the complexity of synthesising them. Then, we develop methods to perform permissive controller synthesis using mixed integer linear programming and illustrate their effectiveness on a selection of case studies.", "paper_title": "PERMISSIVE CONTROLLER SYNTHESIS FOR PROBABILISTIC SYSTEMS", "paper_id": "WOS:000359470700016"}