{"auto_keywords": [{"score": 0.03665676105959259, "phrase": "review_graph"}, {"score": 0.02434633116474743, "phrase": "existing_approaches"}, {"score": 0.00481495049065317, "phrase": "identify_online_store_review"}, {"score": 0.004775726266706856, "phrase": "social_review_graph"}, {"score": 0.004749753615993934, "phrase": "online_shopping_reviews"}, {"score": 0.004723921546336048, "phrase": "valuable_information"}, {"score": 0.004497636013713182, "phrase": "future_purchases"}, {"score": 0.004317331276979733, "phrase": "fake_or_unfair_reviews"}, {"score": 0.0042472410653913335, "phrase": "previous_attempts"}, {"score": 0.004212622018863036, "phrase": "reviewers'_behaviors"}, {"score": 0.004178283966378171, "phrase": "text_similarity"}, {"score": 0.0041555469216463855, "phrase": "rating_patterns"}, {"score": 0.003685363077165945, "phrase": "normal_reviewers"}, {"score": 0.0035861227263414537, "phrase": "available_techniques"}, {"score": 0.0034990853199511982, "phrase": "novel_concept"}, {"score": 0.003304097742490624, "phrase": "heterogeneous_graph"}, {"score": 0.0031284745499175507, "phrase": "iterative_computation_model"}, {"score": 0.003102946096034017, "phrase": "suspicious_reviewers"}, {"score": 0.0025628355581338563, "phrase": "trustworthy_reviewers"}, {"score": 0.0024531892728646004, "phrase": "first_time"}, {"score": 0.002413289337651544, "phrase": "spam_detection"}, {"score": 0.002380534385718454, "phrase": "graph_model"}, {"score": 0.0023418133729330303, "phrase": "effective_computation_method"}, {"score": 0.002316349088361527, "phrase": "proposed_graph_model"}, {"score": 0.0022416018710803122, "phrase": "review_text_information"}, {"score": 0.0021281435708628846, "phrase": "human_judges"}], "paper_keywords": ["Algorithms", " Spammer detection", " review graph"], "paper_abstract": "Online shopping reviews provide valuable information for customers to compare the quality of products, store services, and many other aspects of future purchases. However, spammers are joining this community trying to mislead consumers by writing fake or unfair reviews to confuse the consumers. Previous attempts have used reviewers' behaviors such as text similarity and rating patterns, to detect spammers. These studies are able to identify certain types of spammers, for instance, those who post many similar reviews about one target. However, in reality, there are other kinds of spammers who can manipulate their behaviors to act just like normal reviewers, and thus cannot be detected by the available techniques. In this article, we propose a novel concept of review graph to capture the relationships among all reviewers, reviews and stores that the reviewers have reviewed as a heterogeneous graph. We explore how interactions between nodes in this graph could reveal the cause of spam and propose an iterative computation model to identify suspicious reviewers. In the review graph, we have three kinds of nodes, namely, reviewer, review, and store. We capture their relationships by introducing three fundamental concepts, the trustiness of reviewers, the honesty of reviews, and the reliability of stores, and identifying their interrelationships: a reviewer is more trustworthy if the person has written more honesty reviews; a store is more reliable if it has more positive reviews from trustworthy reviewers; and a review is more honest if many other honest reviews support it. This is the first time such intricate relationships have been identified for spam detection and captured in a graph model. We further develop an effective computation method based on the proposed graph model. Different from any existing approaches, we do not use an review text information. Our model is thus complementary to existing approaches and able to find more difficult and subtle spamming activities, which are agreed upon by human judges after they evaluate our results.", "paper_title": "Identify Online Store Review Spammers via Social Review Graph", "paper_id": "WOS:000313763500004"}