{"auto_keywords": [{"score": 0.04765243024404618, "phrase": "google_scholar"}, {"score": 0.01572041380253572, "phrase": "google"}, {"score": 0.011481472158331271, "phrase": "journal_level"}, {"score": 0.004667149874736771, "phrase": "index_false_papers"}, {"score": 0.004618893461411858, "phrase": "manipulate_bibliometric_indicators"}, {"score": 0.004407813106104401, "phrase": "research_community"}, {"score": 0.004055998173160551, "phrase": "social_sciences"}, {"score": 0.0038304902197108643, "phrase": "quick_expansion"}, {"score": 0.0037908515763223107, "phrase": "google_scholar_citations"}, {"score": 0.0036174746598098863, "phrase": "citation_data"}, {"score": 0.0035614563596982306, "phrase": "individual_level"}, {"score": 0.003226209534553224, "phrase": "google_scholar's_capacity"}, {"score": 0.0031762308449055305, "phrase": "citation-counting_manipulation"}, {"score": 0.003015143226706584, "phrase": "institutional_web_domain"}, {"score": 0.0029224275921964724, "phrase": "fictitious_researcher"}, {"score": 0.0024868131939261716, "phrase": "google_scholar_citations_profiles"}, {"score": 0.0022760856906838814, "phrase": "future_development"}], "paper_keywords": [""], "paper_abstract": "Google Scholar has been well received by the research community. Its promises of free, universal, and easy access to scientific literature coupled with the perception that it covers the social sciences and the humanities better than other traditional multidisciplinary databases have contributed to the quick expansion of Google Scholar Citations and Google Scholar Metrics: 2 new bibliometric products that offer citation data at the individual level and at journal level. In this article, we show the results of an experiment undertaken to analyze Google Scholar's capacity to detect citation-counting manipulation. For this, we uploaded 6 documents to an institutional web domain that were authored by a fictitious researcher and referenced all the publications of the members of the EC3 research group at the University of Granada. The detection by Google Scholar of these papers caused an outburst in the number of citations included in the Google Scholar Citations profiles of the authors. We discuss the effects of such an outburst and how it could affect the future development of such products, at both the individual level and the journal level, especially if Google Scholar persists with its lack of transparency.", "paper_title": "The Google Scholar Experiment: How to Index False Papers and Manipulate Bibliometric Indicators", "paper_id": "WOS:000335582300002"}