{"auto_keywords": [{"score": 0.04951738916270167, "phrase": "fuzzy_central_clustering_algorithms"}, {"score": 0.03771465750530587, "phrase": "relational_duals"}, {"score": 0.02450721758045108, "phrase": "central_clustering_algorithms"}, {"score": 0.00481495049065317, "phrase": "non-metric_dissimilarities"}, {"score": 0.00438105507792004, "phrase": "similarity_measure"}, {"score": 0.004278807087784626, "phrase": "relational_clustering_methods"}, {"score": 0.004129873531628877, "phrase": "feature-based_representation"}, {"score": 0.003260690513595527, "phrase": "non-metric_pairwise_dissimilarities"}, {"score": 0.0032223742018434856, "phrase": "symmetrization_and_shift_operations"}, {"score": 0.0026986685585382347, "phrase": "main_contributions"}, {"score": 0.002246553137021003, "phrase": "kernel-induced_spaces"}, {"score": 0.002181069180139225, "phrase": "presented_algorithms"}, {"score": 0.0021049977753042253, "phrase": "non-metric_relational_clustering"}], "paper_keywords": ["Fuzzy clustering", " Relational clustering", " Kernel clustering methods"], "paper_abstract": "Clustering is the problem of grouping objects on the basis of a similarity measure among them. Relational clustering methods can be employed when a feature-based representation of the objects is not available, and their description is given in terms of pairwise (dis)similarities. This paper focuses on the relational duals of fuzzy central clustering algorithms, and their application in situations when patterns are represented by means of non-metric pairwise dissimilarities. Symmetrization and shift operations have been proposed to transform the dissimilarities among patterns from non-metric to metric. In this paper, we analyze how four popular fuzzy central clustering algorithms are affected by such transformations. The main contributions include the lack of invariance to shift operations, as well as the invariance to symmetrization. Moreover, we highlight the connections between relational duals of central clustering algorithms and central clustering algorithms in kernel-induced spaces. One among the presented algorithms has never been proposed for non-metric relational clustering, and turns out to be very robust to shift operations. (C) 2008 Elsevier Inc. All rights reserved.", "paper_title": "Dealing with non-metric dissimilarities in fuzzy central clustering algorithms", "paper_id": "WOS:000264359500015"}