{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "graph_products"}, {"score": 0.007703261806051385, "phrase": "topolayout_framework"}, {"score": 0.0047113960612140335, "phrase": "versatile_structure"}, {"score": 0.004630150894006861, "phrase": "binary_relationships"}, {"score": 0.004010960493946656, "phrase": "acyclic_graphs"}, {"score": 0.003958937342925219, "phrase": "visualization_algorithms"}, {"score": 0.003724911315685105, "phrase": "\"general\"_graphs"}, {"score": 0.003535320700255283, "phrase": "archambault"}, {"score": 0.003399466007862412, "phrase": "arbitrary_graph"}, {"score": 0.002880927789104712, "phrase": "graph_theory"}, {"score": 0.002806595775343074, "phrase": "visualization_algorithm"}, {"score": 0.0025723630851105304, "phrase": "aesthetic_criterion_graph_product's_drawings"}, {"score": 0.002473420909291381, "phrase": "popular_high-dimensional_embedder_approach"}, {"score": 0.0023886641270884973, "phrase": "aestetic_criterion"}, {"score": 0.002237477619351199, "phrase": "new_component"}, {"score": 0.0021049977753042253, "phrase": "biological_context"}], "paper_keywords": ["Graph drawing", " graph products", " TopoLayout"], "paper_abstract": "Graphs are a versatile structure and abstraction for binary relationships between objects. To gain insight into such relationships, their corresponding graph can be visualized. In the past, many classes of graphs have been defined, e.g. trees, planar graphs, directed acyclic graphs, and visualization algorithms were proposed for these classes. Although many graphs may only be classified as \"general\" graphs, they can contain substructures that belong to a certain class. Archambault proposed the TopoLayout framework: rather than draw any arbitrary graph using one method, split the graph into components that are homogeneous with respect to one graph class and then draw each component with an algorithm best suited for this class. Graph products constitute a class that arises frequently in graph theory, but for which no visualization algorithm has been proposed until now. In this paper, we present an algorithm for drawing graph products and the aesthetic criterion graph product's drawings are subject to. We show that the popular High-Dimensional Embedder approach applied to cartesian products already respects this aestetic criterion, but has disadvantages. We also present how our method is integrated as a new component into the TopoLayout framework. Our implementation is used for further research of graph products in a biological context.", "paper_title": "Visualization of Graph Products", "paper_id": "WOS:000283758600026"}