{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "dillenbourg"}, {"score": 0.004551647527068771, "phrase": "useful_metaphor"}, {"score": 0.004435006247087171, "phrase": "technology-enhanced_learning"}, {"score": 0.004302680891412643, "phrase": "current_positions"}, {"score": 0.004174287115855492, "phrase": "technologically-orientated_viewpoint"}, {"score": 0.004084920064588169, "phrase": "technological_under-usage"}, {"score": 0.0038613835226952117, "phrase": "circular_reasoning"}, {"score": 0.003665874747419775, "phrase": "paper's_main_contention"}, {"score": 0.003332704619499476, "phrase": "english_language"}, {"score": 0.00327545462323687, "phrase": "political_work"}, {"score": 0.00319141242685261, "phrase": "welcome_addition"}, {"score": 0.0029776614744264724, "phrase": "complex_interplay"}, {"score": 0.0026603411931700556, "phrase": "'political'_nature"}, {"score": 0.0024288443150616056, "phrase": "idealised_understanding"}, {"score": 0.0023767561522363367, "phrase": "neutral_practice"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Orchestration", " Power", " Teaching", " Sociology", " TEL"], "paper_abstract": "This response is about the role of \"orchestration\" as a useful metaphor to assist the investigation of technology-enhanced learning (TEL) settings. The paper argues that current positions on orchestration are based on a technologically-orientated viewpoint on the issue of technological under-usage in schools. The paper suggests that this is a form of circular reasoning, and a distraction from the actual, socially shaped dynamics at play. The paper's main contention is that orchestration is an opportunity to incorporate a more 'sociological' angle in TEL scholarship. Orchestration - as often used in the English language to signify 'political work' - is indeed a welcome addition to the field. Insofar as the metaphor allows teachers and researchers to recognise the complex interplay of influences, pressures, and expectations that surround the use of technologies. In other words, insofar as orchestration allows us to appreciate the 'political' nature of educational technology and the impacts of implementation. As such, orchestration can help us move away from an idealised understanding of teaching as a neutral practice, that is, the idea that teachers act always rationally, positively planning and executing their work to maximise learning for students. (C) 2013 Elsevier Ltd. All rights reserved.", "paper_title": "Orchestration, power, and educational technology: A response to Dillenbourg", "paper_id": "WOS:000325600400051"}