{"auto_keywords": [{"score": 0.04007839710766615, "phrase": "virtual_world"}, {"score": 0.00481495049065317, "phrase": "virtual_space"}, {"score": 0.004758457292840376, "phrase": "creativity_bento_box"}, {"score": 0.0047026237903774895, "phrase": "physical_resource_pack"}, {"score": 0.004611013257082199, "phrase": "casual_social_interaction"}, {"score": 0.0042452552248398445, "phrase": "research_proposals"}, {"score": 0.004081385289516914, "phrase": "facilitated_phases"}, {"score": 0.003986103192038901, "phrase": "multiple_days"}, {"score": 0.003954837422946628, "phrase": "computer-mediated_work"}, {"score": 0.003757480190200645, "phrase": "iterative_development_process"}, {"score": 0.00361237042013781, "phrase": "intense_focus"}, {"score": 0.003584025547693836, "phrase": "virtual_resources"}, {"score": 0.003378385493203297, "phrase": "negative_issues"}, {"score": 0.0030614565460256897, "phrase": "physical_resources"}, {"score": 0.0027741761880779535, "phrase": "physical_space"}, {"score": 0.0026459927476753585, "phrase": "otherwise_intense_focus"}, {"score": 0.002445347925313158, "phrase": "physical_and_virtual_contexts"}, {"score": 0.0023976048394496446, "phrase": "earlier_phases"}, {"score": 0.0023600807990911145, "phrase": "group_development"}, {"score": 0.0021983430142660373, "phrase": "underexplored_potential"}, {"score": 0.0021049977753042253, "phrase": "distanced_social_interactions"}], "paper_keywords": [""], "paper_abstract": "The Creativity Bento Box is a physical resource pack, designed to support casual social interaction and break taking in an intensive, computer-mediated social activity. It was developed within the Creativity Greenhouse project, which piloted a mechanism to create research proposals and distribute funding at a distance. This involved facilitated phases of collaboration and competition over multiple days of computer-mediated work, where participants communicate and interact through a virtual world. During the iterative development process, the lack of time for socializing, the intense focus on virtual resources, and a lack of time spent away from the screen were reported as negative issues in feedback from participants. This article reports on the development of the Creativity Bento Box and how it helped to address these issues. By providing physical resources that contrasted with the properties of the virtual world, it supported people to socialize and take breaks from their primary activity, allowed them to include physical space and artifacts in their interactions, and provoked moves away from the otherwise intense focus on the computer. The article reflects on the roles of the Bento Box as a gift, in bridging between physical and virtual contexts, its higher suitability during the earlier phases of ideation and group development, and its perception by participants as something \"framed.\" Through this, we highlight the underexplored potential of using physical, offline resources as a means to solve difficulties in distanced social interactions.", "paper_title": "Creativity Bento Box: A Physical Resource Pack to Support Interaction in Virtual Space", "paper_id": "WOS:000366280200006"}