{"auto_keywords": [{"score": 0.030336914577021784, "phrase": "similar_shapes"}, {"score": 0.00481495049065317, "phrase": "textual_image_queries"}, {"score": 0.004721162131188487, "phrase": "distillation_algorithm"}, {"score": 0.004503422625191897, "phrase": "online_object_query"}, {"score": 0.004363846362238565, "phrase": "distilled_set"}, {"score": 0.003832198214757852, "phrase": "novel_clustering_scheme"}, {"score": 0.003728000957725218, "phrase": "object_segmentation_problems"}, {"score": 0.003459191419478298, "phrase": "loosely_cutout_foreground_\"shapes"}, {"score": 0.0033255627814855163, "phrase": "queried_object"}, {"score": 0.0031970796597571367, "phrase": "outlier_shapes"}, {"score": 0.0030614565460256897, "phrase": "inlier_shapes"}, {"score": 0.002829396605847345, "phrase": "similar_views"}, {"score": 0.002752390133272192, "phrase": "candidate_foreground_segments"}, {"score": 0.002573965014439041, "phrase": "non-trivial_shapes"}, {"score": 0.002407078478216306, "phrase": "true_inliers"}, {"score": 0.0022688141624966967, "phrase": "precision_rate"}, {"score": 0.0021049977753042253, "phrase": "interesting_graphics_applications"}], "paper_keywords": [""], "paper_abstract": "We present a distillation algorithm which operates on a large, unstructured, and noisy collection of internet images returned from an online object query. We introduce the notion of a distilled set, which is a clean, coherent, and structured subset of inlier images. In addition, the object of interest is properly segmented out throughout the distilled set. Our approach is unsupervised, built on a novel clustering scheme, and solves the distillation and object segmentation problems simultaneously. In essence, instead of distilling the collection of images, we distill a collection of loosely cutout foreground \"shapes\", which may or may not contain the queried object. Our key observation, which motivated our clustering scheme, is that outlier shapes are expected to be random in nature, whereas, inlier shapes, which do tightly enclose the object of interest, tend to be well supported by similar shapes captured in similar views. We analyze the commonalities among candidate foreground segments, without aiming to analyze their semantics, but simply by clustering similar shapes and considering only the most significant clusters representing non-trivial shapes. We show that when tuned conservatively, our distillation algorithm is able to extract a near perfect subset of true inliers. Furthermore, we show that our technique scales well in the sense that the precision rate remains high, as the collection grows. We demonstrate the utility of our distillation results with a number of interesting graphics applications.", "paper_title": "Distilled Collections from Textual Image Queries", "paper_id": "WOS:000358326600016"}