{"auto_keywords": [{"score": 0.034296462589383216, "phrase": "light-tailed_settings"}, {"score": 0.03104244392514206, "phrase": "exponential_twisting_based_methods"}, {"score": 0.030025708036724715, "phrase": "heavy-tailed_settings"}, {"score": 0.027932316175272868, "phrase": "asymptotic_hazard_rate_twisting"}, {"score": 0.00481495049065317, "phrase": "tail_probabilities"}, {"score": 0.004548253531664032, "phrase": "tail_asymptotics"}, {"score": 0.004199406257273994, "phrase": "increasing_threshold"}, {"score": 0.004104722208522451, "phrase": "random_variables"}, {"score": 0.003725470458263889, "phrase": "pert_networks"}, {"score": 0.0035189057079817285, "phrase": "large_project_delays"}, {"score": 0.003419943984098415, "phrase": "provably_asymptotically_optimal_importance_sampling_techniques"}, {"score": 0.0031573626285069157, "phrase": "appropriate_mixture"}, {"score": 0.0031215289677725693, "phrase": "exponentially_twisted_distributions"}, {"score": 0.0023463203637929466, "phrase": "implementation_advantages"}, {"score": 0.0021049977753042253, "phrase": "based_methods"}], "paper_keywords": ["PERT networks", " importance sampling", " rare event simulation", " tail asymptotics"], "paper_abstract": "We derive tail asymptotics for the probability that the maximum of sums of a few random variables exceeds an increasing threshold, when the random variables may be light as well as heavy tailed. These probabilities arise in many applications including in PERT networks where our interest may be in measuring the probability of large project delays. We also develop provably asymptotically optimal importance sampling techniques to efficiently estimate these probabilities. In the light-tailed settings we show that an appropriate mixture of exponentially twisted distributions efficiently estimates these probabilities. As is well known, exponential twisting based methods are not applicable in the heavy-tailed settings. To remedy this; we develop techniques that rely on \"asymptotic hazard rate twisting\" and prove their effectiveness in both light and heavy-tailed settings. We show that in many cases the latter may have implementation advantages over exponential twisting based methods in the light-tailed settings. However, our experiments suggest that when easily implementable, the exponential twisting based methods significantly outperform asymptotic hazard rate twisting based methods.", "paper_title": "Asymptotics and fast simulation for tail probabilities of maximum of sums of few random variables", "paper_id": "WOS:000246069500003"}