{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "multiple_stem-loops"}, {"score": 0.017702012446382632, "phrase": "multiple_loops"}, {"score": 0.014817756701468395, "phrase": "main_branch"}, {"score": 0.004675565200598801, "phrase": "experimental_identification"}, {"score": 0.004590496414177077, "phrase": "computational_prediction_method"}, {"score": 0.004506968388996092, "phrase": "hot_research_spot"}, {"score": 0.004432632434928537, "phrase": "real_pre-mirna"}, {"score": 0.0041418132064539185, "phrase": "quite_a_number"}, {"score": 0.004111488691642256, "phrase": "mirna_precursor"}, {"score": 0.0037505809981715024, "phrase": "imperative_problem"}, {"score": 0.0036553070575015344, "phrase": "pruning_algorithm"}, {"score": 0.003484721713676736, "phrase": "stack_algorithm"}, {"score": 0.003408688677676014, "phrase": "secondary_structure"}, {"score": 0.003309877074892399, "phrase": "recursive_algorithm"}, {"score": 0.003109280367693954, "phrase": "statistic_results"}, {"score": 0.0029641011108505785, "phrase": "whole_sequence"}, {"score": 0.002846549461929597, "phrase": "pre-mirna_intrinsic_features"}, {"score": 0.0026155681847364483, "phrase": "svm_classifier"}, {"score": 0.002421040737931745, "phrase": "obtained_results"}, {"score": 0.0023249757987087055, "phrase": "intrinsic_features"}, {"score": 0.0022492129111567824, "phrase": "proposed_method"}, {"score": 0.002200077887697072, "phrase": "powerful_predicting_method"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["MicroRNA precursor", " Multiple stem-loops", " Pruning algorithm"], "paper_abstract": "In addition to experimental identification of pre-miRNAs, the computational prediction method is also becoming a hot research spot. Most existing prediction methods are usually excluding those pre-miRNAs with multiple loops. But as more and more miRNA have been identified, quite a number of miRNA precursor with multiple loops have been found. Therefore, determining how to effectively identify pre-miRNAs with multiple loops from the control dataset with multiple loops is an imperative problem. In this work, a pruning algorithm is presented to identify the main branch from the multiple stem-loops of pre-miRNA. A stack algorithm is employed to describe the secondary structure of pre-miRNA in four different patterns, and a recursive algorithm is employed to split the multiple stem-loops of pre-miRNA into several small branches, and to identify its main branch. Statistic results indicate that the information of the main branch can be represented as the whole sequence of pre-miRNA. Some features of main branch are extracted to describe pre-miRNA intrinsic features, and SVM classifier is implemented to recognize real pre-miRNA with multiple stem-loops. Based on training and testing on dataset from miRBase12.0, SVM classifier achieves sensitivity of 75.76% on RM-POS and specificity of 98.12% on RM-CDS, and specificity of 91.28% on RM-NCR. The obtained results indicated that the information of main branch after pruning can represent intrinsic features of pre-miRNA with multiple stem-loops. The proposed method in this work provides a powerful predicting method to recognize the real pre-miRNA with multiple stem-loops. (C) 2013 Elsevier Ltd. All rights reserved.", "paper_title": "Prediction of pre-miRNA with multiple stem-loops using pruning algorithm", "paper_id": "WOS:000318320700002"}