{"auto_keywords": [{"score": 0.04866188206860211, "phrase": "technology-organization-environment_framework"}, {"score": 0.02985439381484377, "phrase": "institutional_pressure"}, {"score": 0.00481495049065317, "phrase": "perception-based_model"}, {"score": 0.004743164872278112, "phrase": "emr_technology_adoption_decision"}, {"score": 0.004556901872357751, "phrase": "information_systems_field"}, {"score": 0.004466519142879166, "phrase": "individual-level_decision"}, {"score": 0.004399905285945236, "phrase": "information_technology"}, {"score": 0.004269630481719451, "phrase": "primary_goal"}, {"score": 0.0035827424231607784, "phrase": "previous_work"}, {"score": 0.0032085525502105836, "phrase": "broader_context"}, {"score": 0.0027741761880779535, "phrase": "adoption_decision"}, {"score": 0.002362620540317279, "phrase": "physician's_decision"}, {"score": 0.0022810491620483737, "phrase": "electronic_medical_record"}, {"score": 0.0021693692831601745, "phrase": "multiple_state_study"}], "paper_keywords": ["Adoption", " Electronic Medical Record (EMR)", " Information Technology (IT)", " Non-Adoption", " Technology Organization Environment Model"], "paper_abstract": "For several decades the information systems field has studied the individual-level decision to adopt Information Technology (IT) with the primary goal of making it easier for organizations to derive value out of IT by increasing their effective and efficient use of the deployed IT. While the topic of non-adoption has been discussed within the literature, the focus in previous work has been upon the perceptions of the individual towards the innovation (or a micro-level of analysis), neglecting the broader context within which the adoption/non-adoption decision takes place (or a macro-level of analysis). However, what about situations in which there is institutional pressure influencing an adoption decision? This paper posits that institutional pressure external to an organization may alter the directionality and outcome of the decision. This study adopts the Technology-Organization-Environment framework to examine the context of a physician's decision about whether or not to adopt Electronic Medical Record (or EMR) technology. It reports on a multiple state study within the United States that examines the technology, organization, and environmental factors that discriminate between adopters and non-adopters.", "paper_title": "To Adopt or Not to Adopt: A Perception-Based Model of the EMR Technology Adoption Decision Utilizing the Technology-Organization-Environment Framework", "paper_id": "WOS:000348521300004"}