{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "focused_retrieval"}, {"score": 0.047634079453401236, "phrase": "result_aggregation"}, {"score": 0.02838132555174034, "phrase": "special_issue"}, {"score": 0.004211731831120046, "phrase": "whole_documents"}, {"score": 0.0034753508746887957, "phrase": "best_way"}, {"score": 0.0033952989364738353, "phrase": "user's_need"}, {"score": 0.0029349892964423197, "phrase": "single_result"}, {"score": 0.002642615537454746, "phrase": "seven_papers"}, {"score": 0.0025221759076833124, "phrase": "current_state"}, {"score": 0.002421291757425244, "phrase": "information_retrieval"}, {"score": 0.0023380300046435187, "phrase": "live_result_aggregation_systems"}, {"score": 0.0022974765563692776, "phrase": "experimental_focussed_retrieval_systems"}, {"score": 0.002231441081806766, "phrase": "question_answering"}, {"score": 0.0021927323694667694, "phrase": "entity_ranking"}, {"score": 0.0021049977753042253, "phrase": "passage_retrieval"}], "paper_keywords": ["Focused retrieval", " Result aggregation", " Metrics", " Users"], "paper_abstract": "Both focused retrieval and result aggregation provide the user with answers to their information needs, rather than just pointers to whole documents. Focused retrieval identifies not only relevant documents but also which parts of those documents are relevant, thus reducing the time it takes the user to navigate in a document. Result aggregation is used when the best way to fulfil the user's need is to draw from many different information sources (different collections, documents, or parts of the same document), and to aggregate these into a single result, thus reducing the time it takes the user to fulfil their information need. This special issue includes seven papers showing the breadth and depth of the current state of research in these two branches of information retrieval. They include descriptions of live result aggregation systems, and experimental focussed retrieval systems including sentence retrieval, question answering, and entity ranking; as well as metrics for passage retrieval. To introduce this special issue, we provide an overview of the work presented in these papers.", "paper_title": "Current research in focused retrieval and result aggregation", "paper_id": "WOS:000282214100001"}