{"auto_keywords": [{"score": 0.041678362254871516, "phrase": "medical_apps"}, {"score": 0.015719716506582538, "phrase": "smartphone_medical_apps"}, {"score": 0.004608730887154718, "phrase": "researchers'_efforts"}, {"score": 0.00454610829874136, "phrase": "new_and_disruptive_technology"}, {"score": 0.004472078324288593, "phrase": "research_landscape"}, {"score": 0.004399248545002236, "phrase": "coherent_taxonomy"}, {"score": 0.004339459955098738, "phrase": "basic_characteristics"}, {"score": 0.004303975853361081, "phrase": "emerging_field"}, {"score": 0.004222299135545249, "phrase": "smartphone_apps"}, {"score": 0.004153520149706423, "phrase": "open_challenges"}, {"score": 0.003868142906199082, "phrase": "focused_search"}, {"score": 0.0036121834501411324, "phrase": "medline"}, {"score": 0.003592449435568323, "phrase": "web_of_science"}, {"score": 0.0035435867326548665, "phrase": "ieee_xplore"}, {"score": 0.0034384074513828613, "phrase": "medical_and_technical_literature"}, {"score": 0.0033916328188225843, "phrase": "final_set"}, {"score": 0.0032550798703544145, "phrase": "actual_apps"}, {"score": 0.003175792987190496, "phrase": "specific_specialty"}, {"score": 0.0030814966489115334, "phrase": "general_overview"}, {"score": 0.0029171429862165327, "phrase": "desired_features"}, {"score": 0.0028382737496363995, "phrase": "actual_attempts"}, {"score": 0.002388043660169452, "phrase": "full_utility"}, {"score": 0.002193410120879393, "phrase": "available_options_and_gaps"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ireland_ltd."}], "paper_keywords": ["Smartphone apps", " Medical and health apps", " Mobile health", " Survey", " Taxonomy"], "paper_abstract": "Objective: To survey researchers' efforts in response to the new and disruptive technology of smartphone medical apps, mapping the research landscape form the literature into a coherent taxonomy, and finding out basic characteristics of this emerging field represented on: motivation of using smartphone apps in medicine and healthcare, open challenges that hinder the utility, and the recommendations to improve the acceptance and use of medical apps in the literature. Methods: We performed a focused search for every article on (1) smartphone (2) medical or health-related (3) app, in four major databases: MEDLINE, Web of Science, ScienceDirect, and IEEE Xplore. Those databases are deemed broad enough to cover both medical and technical literature. Results: The final set included 133 articles. Most articles (68/133) are reviews and surveys that refer to actual apps or the literature to describe medical apps for a specific specialty, disease, or purpose; or to provide a general overview of the technology. Another group (43/133) carried various studies, from evaluation of apps to exploration of desired features when developing them. Few researchers (17/133) presented actual attempts to develop medical apps, or shared their experiences in doing so. The smallest portion (5/133) proposed general frameworks addressing the production or operation of apps. Discussion: Since 2010, researchers followed the trend of medical apps in several ways, though leaving areas or aspect for further attention. Regardless of their category, articles focus on the challenges that hinder the full utility of medical apps and do recommend mitigations to them. Conclusions: Research on smartphone medical apps is active and various. We hope that this survey contribute to the understanding of the available options and gaps for other researchers to join this line of research. (C) 2015 Elsevier Ireland Ltd. All rights reserved.", "paper_title": "The landscape of research on smartphone medical apps: Coherent taxonomy, motivations, open challenges and recommendations", "paper_id": "WOS:000364991800010"}