{"auto_keywords": [{"score": 0.03186645405081804, "phrase": "inspirational_stimulus"}, {"score": 0.00481495049065317, "phrase": "study_on_emotion"}, {"score": 0.0045119929871912405, "phrase": "perceived_behavior_controls"}, {"score": 0.0044495843279816075, "phrase": "social_norms"}, {"score": 0.00357689487273538, "phrase": "situational_motivation"}, {"score": 0.003543804852018315, "phrase": "end_users"}, {"score": 0.0034947408949397127, "phrase": "new_technology"}, {"score": 0.003446353878654566, "phrase": "present_paper"}, {"score": 0.0031550351923674337, "phrase": "decreased_time"}, {"score": 0.003096905353118796, "phrase": "test_script"}, {"score": 0.0027570267191549774, "phrase": "decreased_number"}, {"score": 0.00269365253474335, "phrase": "completed_script"}, {"score": 0.0023103100997344072, "phrase": "proposed_study_hypotheses"}, {"score": 0.002267708463966758, "phrase": "structural_equation_modeling"}, {"score": 0.0021049977753042253, "phrase": "comprehensive_conceptual_model"}], "paper_keywords": ["Motivation", " inspiration", " adoption", " training", " memory"], "paper_abstract": "We argue that not only do attitude, perceived behavior controls, and social norms influence intention to adopt technology, but inspiration, memory, and their interaction (inspirational memory) do as well. The current study aimed to determine whether inspiration can be manipulated and, if so, how increased inspiration affects both memory and the situational motivation of end users to accept new technology. The present paper hypothesizes that inspiration positively influences intention to use technology. We also postulate that memory, as measured by decreased time to complete a test script after being exposed to an inspirational stimulus, positively influences intention to use technology. Further, we contend that memory, as measured by decreased number of errors in the completed script after being exposed to an inspirational stimulus, positively influences intention to use technology. Finally we show that the interaction of memory and inspiration positively influences intention to use technology. The proposed study hypotheses were examined via structural equation modeling (SEM) analyses of data collected from 338 users. The rest of the paper will present a comprehensive conceptual model and then build it piece by piece, presenting hypotheses along the way.", "paper_title": "A STUDY ON EMOTION AND MEMORY IN TECHNOLOGY ADOPTION", "paper_id": "WOS:000339143000004"}