{"auto_keywords": [{"score": 0.011420747608110491, "phrase": "asymptotic_analysis"}, {"score": 0.00481495049065317, "phrase": "adaptative_solution"}, {"score": 0.004518442937844318, "phrase": "anisotropic_mesh_adaptation"}, {"score": 0.004457309741979921, "phrase": "inviscid_compressible_flows"}, {"score": 0.004337502738649814, "phrase": "coupling_strategy"}, {"score": 0.004278807087784626, "phrase": "anisotropic_remesher"}, {"score": 0.0041637779492720295, "phrase": "mesh_adaptation"}, {"score": 0.004070276454809864, "phrase": "single-parameter_tolerance"}, {"score": 0.003767738552860633, "phrase": "minimal_element_size"}, {"score": 0.0036663981146086103, "phrase": "solution_discontinuities"}, {"score": 0.0033175095965171674, "phrase": "supersonic_flow"}, {"score": 0.0023372808856170386, "phrase": "priori_error_estimators"}, {"score": 0.0022434880661725493, "phrase": "standard_desktop_computer"}, {"score": 0.0021731423856364003, "phrase": "adaptative_methods"}, {"score": 0.0021049977753042253, "phrase": "john_wiley"}], "paper_keywords": ["compressible flows", " anisotropic mesh adaptation", " error estimators"], "paper_abstract": "This paper describes the use of an a posteriori error estimator to control anisotropic mesh adaptation for computing inviscid compressible flows. The a posteriori error estimator and the coupling strategy with an anisotropic remesher are first introduced. The mesh adaptation is controlled by a single-parameter tolerance (TOE) in regions where the solution is regular, whereas a condition on the minimal element size h(min) is enforced across Solution discontinuities. This h(min) condition is justified on the basis of an asymptotic analysis. The efficiency of the approach is tested with a supersonic flow over an aircraft. The evolution of a mesh adaptation/flow solution loop is shown, together with the influence of the parameters TOL and h(min). We verify numerically that the effect of varying h(min) is concordant with the conclusions of the asymptotic analysis, giving hints on the selection of h(min) with respect to TOL. Finally, we check that the results obtained with the a posteriori error estimator are at least as accurate as those obtained with anisotropic a priori error estimators. All the results presented can be obtained using a standard desktop computer, showing the efficiency of these adaptative methods. Copyright (C) 2008 John Wiley & Sons, Ltd.", "paper_title": "On the use of anisotropic a posteriori error estimators for the adaptative solution of 3D inviscid compressible flows", "paper_id": "WOS:000261810400003"}