{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "ndvi"}, {"score": 0.01522659194042142, "phrase": "california"}, {"score": 0.0045876189888390895, "phrase": "normalized_difference_vegetation_index"}, {"score": 0.004496080495247288, "phrase": "digital_terrain_analysis"}, {"score": 0.004283739213556286, "phrase": "warmest_slope_azimuth"}, {"score": 0.00421520166010848, "phrase": "plant_growth"}, {"score": 0.003810909603178837, "phrase": "maximum_ndvi_contrast"}, {"score": 0.0036454883790271843, "phrase": "southness"}, {"score": 0.0033492947290751996, "phrase": "multi-seasonal_ndvi_images"}, {"score": 0.003269162006886173, "phrase": "thermal_south"}, {"score": 0.0031909403420958752, "phrase": "spatial_scales"}, {"score": 0.0029434299787644445, "phrase": "deviation_angle"}, {"score": 0.0028155572612699976, "phrase": "topographic_proxy"}, {"score": 0.0027929100418926725, "phrase": "local_thermal_conditions"}, {"score": 0.0023762535034673017, "phrase": "comparable_thermal_south"}, {"score": 0.0023287359930308864, "phrase": "resultant_findings"}, {"score": 0.00224558083320154, "phrase": "mountain_landscapes"}, {"score": 0.002218526133566788, "phrase": "direct_meteorological_observations"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["DEM", " Aspect", " Thermal deviation", " Vegetation greenness"], "paper_abstract": "We combined normalized difference vegetation index (NDVI) and digital terrain analysis to detect thermal south (defined in this paper as the warmest slope azimuth, especially for plant growth) in three mountainous landscapes of California. Two methods, respectively, defined topography-controlled thermal south as corresponding to (1) the maximum NDVI contrast between opposite topographic aspects or (2) the maximum covariance between NDVI and deviated southness. Southness was obtained from aspect (slope azimuth in degrees) by taking its negative cosine value. A multi-scale approach using multi-seasonal NDVI images of the three study areas defined that thermal south would vary with seasons, spatial scales, and study areas, but it deviated from 00 to 1800 azimuth line towards southwest in all cases. A deviation angle should thereby be applied when aspect is used as a topographic proxy indicating local thermal conditions. However, the angle must be defined in a way specific to the landscape, scale, and season that are under investigation, hence requiring rapid, easy-to-use tools. The two methods, suggested in this paper, reported comparable thermal south and, together with resultant findings, they may contribute to the study of mountain landscapes, since direct meteorological observations are usually sparse or non-existent in mountains. Published by Elsevier Ltd.", "paper_title": "Using NDVI to define thermal south in several mountainous landscapes of California", "paper_id": "WOS:000263398200015"}