{"auto_keywords": [{"score": 0.04187264861941438, "phrase": "u.s."}, {"score": 0.022353230207407065, "phrase": "eu"}, {"score": 0.007740453252003349, "phrase": "scientific_performance"}, {"score": 0.006627847823600952, "phrase": "eu_share"}, {"score": 0.0044469055125323466, "phrase": "journal_articles"}, {"score": 0.004092695445765521, "phrase": "total_publications"}, {"score": 0.0036384794303356413, "phrase": "total_citations"}, {"score": 0.0034784018545409193, "phrase": "mean_citation_rate"}, {"score": 0.003234509549830177, "phrase": "standard_indicators"}, {"score": 0.0031680109156103334, "phrase": "citation_ratios"}, {"score": 0.0030708096989903945, "phrase": "different_parts"}, {"score": 0.0030390745780621503, "phrase": "citation_distribution"}, {"score": 0.002976581914095474, "phrase": "publication_shares"}, {"score": 0.0028554143163813947, "phrase": "world_citation_distribution"}, {"score": 0.0027582072733520475, "phrase": "seven_fields"}, {"score": 0.002739165532192527, "phrase": "initial_gap"}, {"score": 0.002538164420139397, "phrase": "agricultural_sciences-the"}, {"score": 0.0024179854244287795, "phrase": "upper_tail"}, {"score": 0.002401286805515306, "phrase": "citation_distributions"}, {"score": 0.0023114798074455453, "phrase": "u.s._publication_share"}], "paper_keywords": ["Research performance", " Citation analysis", " Scientific ranking", " European paradox"], "paper_abstract": "In this paper, scientific performance is identified with the impact that journal articles have through the citations they receive. In 15 disciplines, as well as in all sciences as a whole, the EU share of total publications is greater than that of the U.S. However, as soon as the citations received by these publications are taken into account the picture is completely reversed. Firstly, the EU share of total citations is still greater than the U.S. in only seven fields. Secondly, the mean citation rate in the U.S. is greater than in the EU in every one of the 22 fields studied. Thirdly, since standard indicators-such as normalized mean citation ratios-are silent about what takes place in different parts of the citation distribution, this paper compares the publication shares of the U.S. and the EU at every percentile of the world citation distribution in each field. It is found that in seven fields the initial gap between the U.S. and the EU widens as we advance towards the more cited articles, while in the remaining 15 fields-except for Agricultural Sciences-the U.S. always surpasses the EU when it counts, namely, at the upper tail of citation distributions. Finally, for all sciences as a whole the U.S. publication share becomes greater than that of the EU for the top 50% of the most highly cited articles. The data used refers to 3.6 million articles published in 1998-2002, and the more than 47 million citations they received in 1998-2007.", "paper_title": "A comparison of the scientific performance of the US and the European union at the turn of the 21st century", "paper_id": "WOS:000280947400024"}