{"auto_keywords": [{"score": 0.031151190237917438, "phrase": "n-node_graphs"}, {"score": 0.00481495049065317, "phrase": "graph_exploration_space_lower_bounds"}, {"score": 0.004645057834614705, "phrase": "anonymous_nodes"}, {"score": 0.004562362497952548, "phrase": "non-cooperative_robots"}, {"score": 0.004497262692458022, "phrase": "finite_automata"}, {"score": 0.003637822529522622, "phrase": "so-called_reduced_automata_technique"}, {"score": 0.003385336776758738, "phrase": "reduced_automata_technique"}, {"score": 0.0032893028281789287, "phrase": "simpler_form"}, {"score": 0.0030499378654797143, "phrase": "-cooperative_robots"}, {"score": 0.002984794722633428, "phrase": "memory_bits"}, {"score": 0.0028279422436488116, "phrase": "q_k-state_robots"}, {"score": 0.0025568135952982345, "phrase": "rollik"}, {"score": 0.00245753647863636, "phrase": "latter_result"}, {"score": 0.0024223970976460173, "phrase": "graph_exploration"}], "paper_keywords": [""], "paper_abstract": "We consider the task of exploring graphs with anonymous nodes by a team of non-cooperative robots, modeled as finite automata. For exploration to be completed, each edge of the graph has to be traversed by at least one robot. In this paper, the robots have no a priori knowledge of the topology of the graph, nor of its size, and we are interested in the amount of memory the robots need to accomplish exploration, We introduce the so-called reduced automata technique, and we show how to use this technique for deriving several space lower bounds for exploration. Informally speaking, the reduced automata technique consists in reducing a robot to a simpler form that preserves its \"core\" behavior on some graphs. Using this technique, we first show that any set of q >= 1 non-cooperative robots, requires Omega(log(n/q)) memory bits to explore all n-node graphs. The proof implies that, for any set of q K-state robots, there exists a graph of size O(qK) that no robot of this set can explore, which improves the O(K(O(q))) bound by Rollik (1980). Our main result is an application of this latter result, concerning terminating graph exploration with one robot, i.e., in which the robot is requested to stop after completing exploration. For this task, the robot is provided with a pebble, that it can use to mark nodes (without such a marker, even terminating exploration of cycles cannot be achieved). We prove that terminating exploration requires Omega(log n) bits of memory for a robot achieving this task in all n-node graphs.", "paper_title": "The reduced automata technique for graph exploration space lower bounds", "paper_id": "WOS:000237082200001"}