{"auto_keywords": [{"score": 0.032942613077135, "phrase": "new_method"}, {"score": 0.00481495049065317, "phrase": "site-enriched_protein_triangles"}, {"score": 0.00454027551702508, "phrase": "important_clue"}, {"score": 0.004264463695140275, "phrase": "docking_computations"}, {"score": 0.00423118169200579, "phrase": "virtual_drug_design"}, {"score": 0.003989675045520656, "phrase": "protein_triangles"}, {"score": 0.0038665369393234713, "phrase": "ligand-binding_sites"}, {"score": 0.0036172962914449826, "phrase": "new_ligand-binding_site_prediction_method"}, {"score": 0.0035332058983966424, "phrase": "binding_site-enriched_protein_triangles"}, {"score": 0.003279559293934528, "phrase": "excellent_results"}, {"score": 0.0031534367609709233, "phrase": "success_rates"}, {"score": 0.0030800962618484844, "phrase": "first_predicted_site"}, {"score": 0.002847691227421257, "phrase": "unsuccessful_predictions"}, {"score": 0.0027814417101979317, "phrase": "ligand-binding_site"}, {"score": 0.002462867872567125, "phrase": "incorrect_biological_unit"}, {"score": 0.00238674051726235, "phrase": "correct_biological_units"}, {"score": 0.002331189621118592, "phrase": "prediction_success_rates"}, {"score": 0.0022414566728770745, "phrase": "valuable_new_addition"}, {"score": 0.002197891020396052, "phrase": "existing_structure-based_bioinformatics_tools"}, {"score": 0.0021383149182448544, "phrase": "related_functions"}, {"score": 0.0021049977753042253, "phrase": "post-genomics_research"}], "paper_keywords": [""], "paper_abstract": "Motivation: Knowledge about the site at which a ligand binds provides an important clue for predicting the function of a protein and is also often a prerequisite for performing docking computations in virtual drug design and screening. We have previously shown that certain ligand-interacting triangles of protein atoms, called protein triangles, tend to occur more frequently at ligand-binding sites than at other parts of the protein. Results: In this work, we describe a new ligand-binding site prediction method that was developed based on binding site-enriched protein triangles. The new method was tested on 2 benchmark datasets and on 19 targets from two recent community-based studies of such predictions, and excellent results were obtained. Where comparisons were made, the success rates for the new method for the first predicted site were significantly better than methods that are not a meta-predictor. Further examination showed that, for most of the unsuccessful predictions, the pocket of the ligand-binding site was identified, but not the site itself, whereas for some others, the failure was not due to the method itself but due to the use of an incorrect biological unit in the structure examined, although using correct biological units would not necessarily improve the prediction success rates. These results suggest that the new method is a valuable new addition to a suite of existing structure-based bioinformatics tools for studies of molecular recognition and related functions of proteins in post-genomics research.", "paper_title": "Ligand-binding site prediction using ligand-interacting and binding site-enriched protein triangles", "paper_id": "WOS:000305419800040"}