{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "editable_objects"}, {"score": 0.004753194996637899, "phrase": "single_photo"}, {"score": 0.004652016085325825, "phrase": "interactive_technique"}, {"score": 0.004456044928556639, "phrase": "single_photograph"}, {"score": 0.004123781267600542, "phrase": "simple_cognitive_tasks"}, {"score": 0.004001335931796133, "phrase": "automatic_algorithms"}, {"score": 0.0038825121288253435, "phrase": "cognitive_abilities"}, {"score": 0.003799796252156605, "phrase": "computational_accuracy"}, {"score": 0.0031032109441552287, "phrase": "shape's_outline"}, {"score": 0.002566997205079849, "phrase": "intelligent_interactive_modeling_tool"}, {"score": 0.00253400005142168, "phrase": "daunting_task"}, {"score": 0.0025122373359090454, "phrase": "object_extraction"}, {"score": 0.0022457226013538343, "phrase": "object-driven_photo_editing_tasks"}, {"score": 0.0021049977753042253, "phrase": "user_study"}], "paper_keywords": ["Interactive modeling", " Photo manipulation"], "paper_abstract": "We introduce an interactive technique for manipulating simple 3D shapes based on extracting them from a single photograph. Such extraction requires understanding of the components of the shape, their projections, and relations. These simple cognitive tasks for humans are particularly difficult for automatic algorithms. Thus, our approach combines the cognitive abilities of humans with the computational accuracy of the machine to solve this problem. Our technique provides the user the means to quickly create editable 3D parts-human assistance implicitly segments a complex object into its components, and positions them in space. In our interface, three strokes are used to generate a 3D component that snaps to the shape's outline in the photograph, where each stroke defines one dimension of the component. The computer reshapes the component to fit the image of the object in the photograph as well as to satisfy various inferred geometric constraints imposed by its global 3D structure. We show that with this intelligent interactive modeling tool, the daunting task of object extraction is made simple. Once the 3D object has been extracted, it can be quickly edited and placed back into photos or 3D scenes, permitting object-driven photo editing tasks which are impossible to perform in image-space. We show several examples and present a user study illustrating the usefulness of our technique.", "paper_title": "3-Sweep: Extracting Editable Objects from a Single Photo", "paper_id": "WOS:000326923200039"}