{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "cognitive_fit"}, {"score": 0.026020444019070284, "phrase": "modification_task"}, {"score": 0.022893348986787777, "phrase": "software_comprehension"}, {"score": 0.009661131931801526, "phrase": "higher_levels"}, {"score": 0.0066840618502446575, "phrase": "software_maintenance"}, {"score": 0.004633747992595526, "phrase": "long_tradition"}, {"score": 0.004606479650820579, "phrase": "empirical_studies"}, {"score": 0.004579371037534175, "phrase": "software_developers"}, {"score": 0.00447251540886613, "phrase": "prior_work"}, {"score": 0.004253618550301311, "phrase": "modification_tasks"}, {"score": 0.003724332291866564, "phrase": "software_maintainer's_dominant_mental_representation"}, {"score": 0.003489987735217367, "phrase": "greater_improvements"}, {"score": 0.003270340336894077, "phrase": "software_maintainer's_mental_representations"}, {"score": 0.002966438503447793, "phrase": "lower_performance"}, {"score": 0.0028885579903645043, "phrase": "comprehension_and_modification_tasks"}, {"score": 0.0027961342030212353, "phrase": "dual-task_interference"}, {"score": 0.002659064774118166, "phrase": "mental_representation"}, {"score": 0.0025212306068464452, "phrase": "matched_and_mismatched_conditions"}, {"score": 0.002498961351132696, "phrase": "single_experiment"}, {"score": 0.0022935555629405003, "phrase": "modifcation_performance"}, {"score": 0.002259883463607508, "phrase": "cognitive_fit_exists"}, {"score": 0.0021363670305843403, "phrase": "numerous_types"}, {"score": 0.0021049977753042253, "phrase": "software_development"}], "paper_keywords": ["theory of cognitive fit", " software modification", " software comprehension", " dual-task interference"], "paper_abstract": "Although there is a long tradition of empirical studies of software developers, few studies have focused on software maintenance. Prior work is predicated on the belief that higher levels of software comprehension are associated with higher levels of performance on modification tasks. This study provides a more complete understanding of the relationship between software comprehension and modification. We conceptualize software maintenance as inter-linking comprehension and modification, and argue that the relationship between the two is moderated by cognitive fit. Specifically, cognitive fit exists when the software maintainer's dominant mental representation of the software and their mental representation of the modification task emphasize the same type of knowledge. We hypothesize that when cognitive fit exists, greater improvements in comprehension are associated with higher levels of performance on a modification task. When cognitive fit does not exist, however, the software maintainer's mental representations of the software and of the modification task do not emphasize the same type of knowledge, which may mean that attention is devoted to comprehension at the expense of modification, resulting in lower performance on the modification task. In these circumstances, comprehension and modification tasks may interfere with each other, an effect known as dual-task interference. We therefore hypothesize that performance on a modification task is moderated by the fit between the mental representation of the software and that of the modification task. We tested our theory by varying cognitive fit to create matched and mismatched conditions in a single experiment that used IT professionals as subjects. Our finding, support our theory: cognitive fit moderates the relationship between comprehension and modification. Specifically, changes in software comprehension and modifcation performance are positively related when cognitive fit exists and negatively related when cognitive fit does not exist. Our findings demonstrate the need to examine more complex relationships among the numerous types of tasks involved in software development rather than examining software comprehension alone.", "paper_title": "The role of cognitive fit in the relationship between software comprehension and modification", "paper_id": "WOS:000235602600003"}