{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "goal_models"}, {"score": 0.04964156968469261, "phrase": "goal-oriented_requirement_language"}, {"score": 0.03275097241605011, "phrase": "intentional_elements"}, {"score": 0.00461302961851157, "phrase": "rigorous_analysis_procedures"}, {"score": 0.004487697242654525, "phrase": "initial_act"}, {"score": 0.004247112325475329, "phrase": "high-level_design_alternatives"}, {"score": 0.004157058883925715, "phrase": "high-level_requirements"}, {"score": 0.00346980631146264, "phrase": "user_requirements_notation"}, {"score": 0.0034171042868668304, "phrase": "urn"}, {"score": 0.0033139366449568565, "phrase": "first_standard_goal-oriented_language"}, {"score": 0.0032836113922088844, "phrase": "grl"}, {"score": 0.003145705182811006, "phrase": "qualitative_or_quantitative_satisfaction_levels"}, {"score": 0.002985988377995789, "phrase": "initial_satisfaction_levels"}, {"score": 0.00268216942002329, "phrase": "relative_effectiveness"}, {"score": 0.002665770884424872, "phrase": "design_alternatives"}, {"score": 0.002641360377825228, "phrase": "requirements_level"}, {"score": 0.0026091594819333654, "phrase": "specific_propagation_algorithm"}, {"score": 0.0025694584194998335, "phrase": "urn_standard"}, {"score": 0.002538131851615231, "phrase": "evaluation_mechanisms"}, {"score": 0.002286781334850213, "phrase": "open-source_jucmnav_tool"}, {"score": 0.0022313446699940534, "phrase": "urn_models"}, {"score": 0.0021441057555396013, "phrase": "telecommunication_system_example"}, {"score": 0.0021049977753042253, "phrase": "wiley_periodicals"}], "paper_keywords": [""], "paper_abstract": "In this article, we introduce the application of rigorous analysis procedures to goal models to provide several benefits beyond the initial act of modeling. Such analysis can allow modelers to assess the satisfaction of goals, facilitate evaluation of high-level design alternatives, help analysts decide on the high-level requirements and design of the system, test the sanity of a model, and support communication and learning. The analysis of goal models can be done in very different ways depending on the nature of the model and the purpose of the analysis. In our work, we use the Goal-oriented Requirement Language (GRL), which is part of the User Requirements Notation (URN). URN, a new Recommendation of the International Telecommunications Union, provides the first standard goal-oriented language. Using GRL, we develop an approach to analysis that can be done by evaluating qualitative or quantitative satisfaction levels of the actors and intentional elements (e.g., goals and tasks) composing the model. Initial satisfaction levels for some of the intentional elements are provided in a strategy and then propagated to the other intentional elements of the model through the various links that connect them. The results allow for an assessment of the relative effectiveness of design alternatives at the requirements level. Although no specific propagation algorithm is imposed in the URN standard, different criteria for defining evaluation mechanisms are described. We provide three algorithms (quantitative, qualitative, and hybrid) as examples, which satisfy the constraints imposed by the standard. These algorithms have been implemented in the open-source jUCMNav tool, an Eclipse-based editor for URN models. The algorithms are presented and compared with the help of a telecommunication system example. (c) 2010 Wiley Periodicals, Inc.", "paper_title": "Evaluating Goal Models within the Goal-Oriented Requirement Language", "paper_id": "WOS:000279740100007"}