{"auto_keywords": [{"score": 0.04982272288520127, "phrase": "power_allocation"}, {"score": 0.042921985594396084, "phrase": "cooperative_game"}, {"score": 0.03078406879787557, "phrase": "jbpag"}, {"score": 0.02672590261963155, "phrase": "simulation_results"}, {"score": 0.025829464524140186, "phrase": "nbs_result"}, {"score": 0.00481495049065317, "phrase": "suboptimal_joint_bandwidth"}, {"score": 0.004763565662615503, "phrase": "cooperative_relay_networks"}, {"score": 0.004649936560866145, "phrase": "commercial_networks"}, {"score": 0.004625054319525326, "phrase": "user_nodes"}, {"score": 0.004244495734923587, "phrase": "noise_ratios"}, {"score": 0.004087963788286157, "phrase": "theoretical_framework"}, {"score": 0.003969018740062018, "phrase": "selfish_cooperative_relay_networks"}, {"score": 0.003916098498242888, "phrase": "fair_and_efficient_resource_sharing"}, {"score": 0.003731339232636914, "phrase": "potential_relay"}, {"score": 0.003342280102112269, "phrase": "power_resource"}, {"score": 0.003306559295382181, "phrase": "cooperative_strategy"}, {"score": 0.002969628818856786, "phrase": "nash_bargaining_solution"}, {"score": 0.002953723244504695, "phrase": "nbs"}, {"score": 0.0029221312451219203, "phrase": "jbpa_game"}, {"score": 0.002717594582706144, "phrase": "power_allocation_game"}, {"score": 0.002631333840588461, "phrase": "unique_nbs."}, {"score": 0.0024868972942701604, "phrase": "proposed_cooperative_game_scheme"}, {"score": 0.002447101794397243, "phrase": "performance_loss"}, {"score": 0.0023950275815082297, "phrase": "maximal_overall_data-rate_scheme"}, {"score": 0.002363044095528996, "phrase": "maximal-rate_scheme"}, {"score": 0.0022453451864218477, "phrase": "better_performance"}], "paper_keywords": ["cooperative relay", " resource allocation", " cooperative game theory", " Nash bargaining solution", " Pareto optimal"], "paper_abstract": "In commercial networks, user nodes operating on batteries are assumed to be selfish to consume their resources (i.e., bandwidth and power) solely maximizing their own benefits (e. g., the received signal-to-noise ratios (SNRs) and datarates). In this paper, a cooperative game theoretical framework is proposed to jointly perform the bandwidth and power allocation for selfish cooperative relay networks. To ensure a fair and efficient resource sharing between two selfish user nodes, we assume that either node can act as a source as well as a potential relay for each other and either node is willing to seek cooperative relaying only if the datarate achieved through cooperation is not lower than that achieved through noncooperation (i.e., direct transmission) by consuming the same amount of bandwidth and power resource. Define the cooperative strategy of a node as the number of bandwidth and power that it is willing to contribute for relaying purpose. The two node joint bandwidth and power allocation (JBPA) problem can then be formulated as a cooperative game. Since the Nash bargaining solution (NBS) to the JBPA game (JBPAG) is computationally difficult to obtain, we divide it into two subgames, i.e., the bandwidth allocation game (BAG) and the power allocation game (PAG). We prove that both the subgames have unique NBS. And then the suboptimal NBS to the JBPAG can be achieved by solving the BAG and PAG sequentially. Simulation results show that the proposed cooperative game scheme is efficient in that the performance loss of the NBS result to that of the maximal overall data-rate scheme is small while the maximal-rate scheme is unfair. The simulation results also show that the NBS result is fair in that both nodes could experience better performance than they work independently and the degree of cooperation of a node only depends on how much contribution its partner can make to improve its own performance.", "paper_title": "A suboptimal joint bandwidth and power allocation for cooperative relay networks: a cooperative game theoretic approach", "paper_id": "WOS:000323202000005"}