{"auto_keywords": [{"score": 0.04972395969484311, "phrase": "peak_power_constraints"}, {"score": 0.023246600485112925, "phrase": "capacity_region"}, {"score": 0.013920248153934965, "phrase": "finite_number"}, {"score": 0.01381796488206093, "phrase": "mass_points"}, {"score": 0.010474094002392931, "phrase": "sum-rate-optimal_points"}, {"score": 0.008607263428055033, "phrase": "ocd"}, {"score": 0.008396946396289962, "phrase": "mac"}, {"score": 0.00779630309289551, "phrase": "discrete_distributions"}, {"score": 0.00481495049065317, "phrase": "gaussian_multiple_access_channel"}, {"score": 0.004673709383305897, "phrase": "two-user_gaussian_multiple_access_channel"}, {"score": 0.004179824713643488, "phrase": "largest_weighted_sum-rate"}, {"score": 0.0039088121438737924, "phrase": "two-user_mac"}, {"score": 0.0036553070575015344, "phrase": "capacity-achieving_distributions"}, {"score": 0.003220315882881027, "phrase": "infinite_number"}, {"score": 0.0030565692640988585, "phrase": "gaussian_mac"}, {"score": 0.0030338645940033875, "phrase": "average_power_constraints"}, {"score": 0.002977835845437357, "phrase": "time_division"}, {"score": 0.002763850622950247, "phrase": "so-called_i-mmse_identity"}, {"score": 0.0026826140171754675, "phrase": "largest_achievable_sum-rate"}, {"score": 0.002536660322474346, "phrase": "walsh-hadamard"}, {"score": 0.0024346858809238766, "phrase": "symmetric_case"}, {"score": 0.0022261705957258506, "phrase": "highest_sum-rate"}, {"score": 0.0021049977753042253, "phrase": "maximum_peak_power"}], "paper_keywords": ["Code division", " capacity achieving distributions", " Gaussian MAC", " I-MMSE identity", " peak power constraint"], "paper_abstract": "This paper addresses a two-user Gaussian multiple access channel (MAC) under peak power constraints at the transmitters. It is shown that generating the code-books of both users according to discrete distributions with a finite number of mass points achieves the largest weighted sum-rate in the network. This verifies that any point on the boundary of the capacity region of a two-user MAC under peak power constraints at both transmitters is achieved by discrete distributions with a finite number of mass points. Although the capacity-achieving distributions are not necessarily unique, it is verified that only discrete distributions with a finite number of mass points can achieve a point on the boundary of the capacity region. It is shown that there exist an infinite number of sum-rate-optimal points on the boundary of the capacity region. In contrast to the Gaussian MAC with average power constraints, we verify that time division (TD) cannot achieve any of the sum-rate-optimal points in the Gaussian MAC with peak power constraints. Using the so-called I-MMSE identity of Guo et al., the largest achievable sum-rate by orthogonal code division (OCD) is characterized where it is shown that Walsh-Hadamard spreading codes of length 2 are optimal. In the symmetric case where the peak power constraints at both transmitters are identical, we verify that OCD can achieve a sum-rate that is strictly larger than the highest sum-rate achieved by TD. Finally, it is demonstrated that there are values for the maximum peak power at the transmitters such that OCD can not achieve any of the sum-rate-optimal points on the boundary of the capacity region.", "paper_title": "Capacity-Achieving Distributions in Gaussian Multiple Access Channel With Peak Power Constraints", "paper_id": "WOS:000342416900020"}