{"auto_keywords": [{"score": 0.0044800522651664695, "phrase": "multi-layer_perceptrons"}, {"score": 0.004099542199088835, "phrase": "main_goal"}, {"score": 0.003319939715683536, "phrase": "multi-objective_optimization_algorithm"}, {"score": 0.003175676186323053, "phrase": "components'_diversity"}, {"score": 0.0030208364972341096, "phrase": "opt-ainet_algorithm"}, {"score": 0.002857605453835429, "phrase": "single-objective_optimization_problems"}, {"score": 0.0027333769432036905, "phrase": "output_error"}, {"score": 0.002614534850703364, "phrase": "implicit_diversity_maintenance_mechanism"}, {"score": 0.00251478366610296, "phrase": "different_weights"}, {"score": 0.0024323098907299027, "phrase": "diverse_classifiers"}, {"score": 0.0022007302738063566, "phrase": "second-order_gradient-based_algorithm"}, {"score": 0.002164331818029166, "phrase": "mscg."}], "paper_keywords": ["Ensembles of classifiers", " Diversity of components", " Artificial immune systems", " Multi-layer perceptrons", " Multi-objective optimization"], "paper_abstract": "This work applies two immune-inspired algorithms, namely opt-aiNet and omni-aiNet, to train multi-layer perceptrons (MLPs) to be used in the construction of ensembles of classifiers. The main goal is to investigate the influence of the diversity of the set of solutions generated by each of these algorithms, and if these solutions lead to improvements in performance when combined in ensembles. omni-aiNet is a multi-objective optimization algorithm and, thus, explicitly maximizes the components' diversity at the same time it minimizes their output errors. The opt-aiNet algorithm, by contrast, was originally designed to solve single-objective optimization problems, focusing on the minimization of the output error of the classifiers. However, an implicit diversity maintenance mechanism stimulates the generation of MLPs with different weights, which may result in diverse classifiers. The performances of opt-aiNet and omni-aiNet are compared with each other and with that of a second-order gradient-based algorithm, named MSCG. The results obtained show how the different diversity maintenance mechanisms presented by each algorithm influence the gain in performance obtained with the use of ensembles.", "paper_title": "Neural network ensembles: immune-inspired approaches to the diversity of components", "paper_id": "WOS:000280942700006"}