{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "cloud-based_services"}, {"score": 0.008172674160425185, "phrase": "client_code"}, {"score": 0.004476399615305783, "phrase": "software_application"}, {"score": 0.004041879818641576, "phrase": "required_re-engineering_effort"}, {"score": 0.0038127186374325582, "phrase": "remote_cloud-based_services"}, {"score": 0.002725081358527507, "phrase": "fault_tolerance_functionality"}, {"score": 0.0026337482179592422, "phrase": "cloud_services"}, {"score": 0.0025578967205807843, "phrase": "modern_ide."}, {"score": 0.0021886732310288128, "phrase": "general_electric"}, {"score": 0.0021569129153653777, "phrase": "cloud-based_resources"}, {"score": 0.0021049977753042253, "phrase": "ge_business_requirements"}], "paper_keywords": ["Cloud computing", " Services", " Refactoring", " Service extraction", " Fault-tolerance", " Program transformation"], "paper_abstract": "Using cloud-based services can improve the performance, reliability, and scalability of a software application. However, transitioning an application to use cloud-based services is difficult, costly, and error-prone. The required re-engineering effort includes migrating to the cloud the functionality to be accessed as remote cloud-based services and re-targeting the client code accordingly. In addition, the client must be able to detect and handle the faults raised in the process of invoking the services. As a means of streamlining this transitioning, we developed a set of refactoring techniques-automated, IDE-assisted program transformations that eliminate the need to change programs by hand. In particular, we show how a programmer can extract services, add fault tolerance functionality, and adapt client code to invoke cloud services via refactorings integrated with a modern IDE. As a validation, we have applied our approach to automatically transform two third-party Java applications to use cloud-based services. We have also applied our approach to re-engineer a suite of services operated by General Electric to use cloud-based resources to better satisfy the GE business requirements.", "paper_title": "Cloud refactoring: automated transitioning to cloud-based services", "paper_id": "WOS:000337081800003"}