{"auto_keywords": [{"score": 0.04326084560820555, "phrase": "partition_problem"}, {"score": 0.015148553437425482, "phrase": "active_users"}, {"score": 0.013894124234193098, "phrase": "n_users"}, {"score": 0.007427751768968588, "phrase": "group_testing"}, {"score": 0.00481495049065317, "phrase": "asymptotic_error_free_partitioning_over_noisy_boolean_multiaccess_channels"}, {"score": 0.004384960761826366, "phrase": "multi-access_channel"}, {"score": 0.004344123393283444, "phrase": "k_active_users"}, {"score": 0.004210714223341684, "phrase": "channel_access"}, {"score": 0.004018212085786494, "phrase": "k_groups"}, {"score": 0.003568875230828415, "phrase": "random_coding"}, {"score": 0.0035356111195810483, "phrase": "suboptimal_decoding_scheme"}, {"score": 0.0032906426750021153, "phrase": "positive_constants"}, {"score": 0.0029963684169267406, "phrase": "large_n."}, {"score": 0.0026279461299595756, "phrase": "large_n"}], "paper_keywords": ["Partition information", " conflict resolution", " strong coloring", " noisy Boolean channel"], "paper_abstract": "In this paper, we consider the problem of partitioning active users in a manner that facilitates multi-access without collision. The setting is of a noisy, synchronous, Boolean, and multi-access channel, where K active users (out of a total of N users) seek channel access. A solution to the partition problem places each of the N users in one of K groups (or blocks), such that no two active nodes are in the same block. We consider a simple, but non-trivial and illustrative, case of K = 2 active users and study the number of steps T used to solve the partition problem. By random coding and a suboptimal decoding scheme, we show that for any T >= (C-1 + xi(1)) log N, where C-1 and xi(1) are positive constants (independent of N), and where xi(1) can be arbitrary small, the partition problem can be solved with error probability P-e((N)) -> 0, for large N. Under the same scheme, we also bound T from the other direction, establishing that, for any T <= (C-2 - epsilon(2)) log N, the error probability P-e((N)) -> 1 for large N; again, C-2 and epsilon(2) are constants, and epsilon(2) can be arbitrarily small. These bounds on the number of steps are lower than the tight achievable lower bound in terms of T >= (C-g + xi) log N for group testing (in which all active users are identified, rather than just partitioned). Thus, partitioning may prove to be a more efficient approach for multi-access than group testing.", "paper_title": "Asymptotic Error Free Partitioning Over Noisy Boolean Multiaccess Channels", "paper_id": "WOS:000363256500027"}