{"auto_keywords": [{"score": 0.04286314458219275, "phrase": "learning_problem"}, {"score": 0.00481495049065317, "phrase": "partially_observable_environments"}, {"score": 0.0047464608267006395, "phrase": "generative_model"}, {"score": 0.004460703838987562, "phrase": "high-dimensional_environment"}, {"score": 0.004397230847865867, "phrase": "common_approach"}, {"score": 0.004034841146538891, "phrase": "partial_models"}, {"score": 0.003580355398511932, "phrase": "standard_model-learning_methods"}, {"score": 0.003413183361838603, "phrase": "probability_distribution"}, {"score": 0.0033645655483989746, "phrase": "possible_futures"}, {"score": 0.002739001004969201, "phrase": "partially_observable_systems"}, {"score": 0.0025737890313763407, "phrase": "generative_models"}, {"score": 0.0024301229420875155, "phrase": "prediction_profile_model"}, {"score": 0.0023613185213421173, "phrase": "original_model-learning_problem"}, {"score": 0.0022617389804167943, "phrase": "prediction_profile_models"}, {"score": 0.0022188370388602813, "phrase": "small_set"}, {"score": 0.0021976915360493628, "phrase": "important_predictions"}, {"score": 0.0021049977753042253, "phrase": "standard_generative_models"}], "paper_keywords": [""], "paper_abstract": "When faced with the problem of learning a model of a high-dimensional environment, a common approach is to limit the model to make only a restricted set of predictions, thereby simplifying the learning problem. These partial models may be directly useful for making decisions or may be combined together to form a more complete, structured model. However, in partially observable (non-Markov) environments, standard model-learning methods learn generative models, i.e. models that provide a probability distribution over all possible futures (such as POMDPs). It is not straightforward to restrict such models to make only certain predictions, and doing so does not always simplify the learning problem. In this paper we present prediction profile models: non-generative partial models for partially observable systems that make only a given set of predictions, and are therefore far simpler than generative models in some cases. We formalize the problem of learning a prediction profile model as a transformation of the original model-learning problem, and show empirically that one can learn prediction profile models that make a small set of important predictions even in systems that are too complex for standard generative models.", "paper_title": "Learning to Make Predictions In Partially Observable Environments Without a Generative Model", "paper_id": "WOS:000296958400001"}