{"auto_keywords": [{"score": 0.049390246951185, "phrase": "intermittently_connected_networks"}, {"score": 0.02322730111336099, "phrase": "multiple_destinations"}, {"score": 0.015682126308637592, "phrase": "delay_distribution"}, {"score": 0.009524742486402499, "phrase": "message_forwarding"}, {"score": 0.008364448313498602, "phrase": "single_destination"}, {"score": 0.004677372885331908, "phrase": "erasure_coding-based_paradigm"}, {"score": 0.004478308876320956, "phrase": "message_forwarding_paradigms"}, {"score": 0.004046020290832207, "phrase": "previous_erasure_coding-based_schemes"}, {"score": 0.0033021988455635403, "phrase": "straightforward_expression"}, {"score": 0.0024519545383399773, "phrase": "performance_sensitivity_results"}, {"score": 0.0022472527731744974, "phrase": "erasure_coding-based_forwarding_scheme"}, {"score": 0.0021049977753042253, "phrase": "erasure_coding-based_forwarding_mechanisms"}], "paper_keywords": ["erasure coding", " message forwarding", " delay/disruption-tolerant networks", " intermittently connected networks", " ad hoc networks", " ubiquitous computing"], "paper_abstract": "Erasure coding-based paradigm is a typical sort of message forwarding paradigms to improve robustness of message forwarding against dynamics and unreliability in intermittently connected networks. Since previous erasure coding-based schemes were mainly dedicated to delivering messages to any single destination, this paper considers the other situation of delivering messages to multiple destinations in intermittently connected networks. This paper obtains a straightforward expression for the delay distribution of multiple destinations if the delay distribution of a single destination is given. Afterwards, this paper analyses the delay distribution for message forwarding to not only a single destination but also multiple destinations. Upon delivery ratio and delay time, the examination of performance sensitivity results in many new inherent observations, properties and insights into the virtue of the erasure coding-based forwarding scheme, providing significant information for the design of erasure coding-based forwarding mechanisms in support of multiple destinations in intermittently connected networks.", "paper_title": "Erasure coding-based message forwarding to multiple destinations in intermittently connected networks", "paper_id": "WOS:000354888100008"}