{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "human_resource_practices"}, {"score": 0.04959024199151092, "phrase": "organizational_performance"}, {"score": 0.004235095881928715, "phrase": "practical_case_study"}, {"score": 0.0037632749713937637, "phrase": "study_results"}, {"score": 0.0035932440062595252, "phrase": "different_perspective"}, {"score": 0.003413284742632989, "phrase": "cross-evaluation_mechanism"}, {"score": 0.00332670230152448, "phrase": "proposed_model"}, {"score": 0.003160049822855747, "phrase": "human_resource_practice_variables"}, {"score": 0.0031277316566463978, "phrase": "organizational_performance_variables"}, {"score": 0.002955782731675529, "phrase": "useful_information"}, {"score": 0.0029255474957478474, "phrase": "firm_efficiency"}, {"score": 0.0026126405272417783, "phrase": "good_results"}, {"score": 0.0024311346712789553, "phrase": "decision-making_units"}, {"score": 0.0021049977753042253, "phrase": "non-efficiency_information"}], "paper_keywords": ["AHP", " DEA", " Efficiency", " Human resource practices", " Organizational performance"], "paper_abstract": "This study proposes an analytical hierarchical process/data envelopment analysis (AHP/DEA) model for investigating the associated importance of input/output (human resource practices/organizational performance) variables. A practical case study involving 36 electronics firms was thus used to demonstrate the application of the proposed AHP/DEA ranking model and examine the impact of human resource practices on organizational performance. The study results are presented in two parts. First, a different perspective on the AHP/DEA ranking model is introduced with respect to the cross-evaluation mechanism. Second, the proposed model is demonstrated to provide more information regarding the influence of human resource practice variables on organizational performance variables. The model should not only enable decision-makers to obtain useful information regarding firm efficiency, but it should also allow them to identify which variable(s) are more important to a firm looking to achieve good results. The AHP/DEA model has been extensively adopted to statistically investigate the efficiency of decision-making units (DMUs). Information used to differentiate input/output variables from others may be also valuable in decision-making, providing an alternative to simply relying on efficiency and non-efficiency information.", "paper_title": "EXAMINING THE IMPACT OF HUMAN RESOURCE PRACTICES ON ORGANIZATIONAL PERFORMANCE BY USING THE AHP/DEA MODEL", "paper_id": "WOS:000281072400006"}