{"auto_keywords": [{"score": 0.04776685683152904, "phrase": "data_similarity"}, {"score": 0.023095037500158098, "phrase": "star_glyphs"}, {"score": 0.009958009292631053, "phrase": "star_glyph"}, {"score": 0.009289643251337965, "phrase": "data_points"}, {"score": 0.0058059605080497, "phrase": "reference_structures"}, {"score": 0.00481495049065317, "phrase": "similarity_perception"}, {"score": 0.004556018017257075, "phrase": "star_glyph_variations"}, {"score": 0.004361428012479218, "phrase": "multi-dimensional_data_point"}, {"score": 0.0042610532651691305, "phrase": "small-multiple_settings"}, {"score": 0.004055329874540865, "phrase": "data_graphics"}, {"score": 0.003973523379376352, "phrase": "important_task"}, {"score": 0.003938968581984988, "phrase": "visual_comparison"}, {"score": 0.003705323407433896, "phrase": "data_comparisons"}, {"score": 0.0036730923460000717, "phrase": "overall_shape"}, {"score": 0.0035885019925285394, "phrase": "contour_lines"}, {"score": 0.003505852877805438, "phrase": "accurate_similarity_judgments"}, {"score": 0.0032786537599187125, "phrase": "visualization_experts"}, {"score": 0.0032596049901888724, "phrase": "trained_novices"}, {"score": 0.003221837753001224, "phrase": "similar_data_values"}, {"score": 0.003021781956684419, "phrase": "second_study"}, {"score": 0.002995478860085004, "phrase": "intuitive_notions"}, {"score": 0.0028423856809047326, "phrase": "third_experiment"}, {"score": 0.00278497898719426, "phrase": "star_glyph_reference_structures"}, {"score": 0.0025816953009851072, "phrase": "similarity_judgments"}, {"score": 0.002507511169156787, "phrase": "standard_star_glyph"}, {"score": 0.002414241727802253, "phrase": "simple_star_glyph"}, {"score": 0.0021049977753042253, "phrase": "design_considerations"}], "paper_keywords": ["Glyphs", " star glyphs", " contours", " perception", " quantitative evaluation", " similarity detection", " visual comparison"], "paper_abstract": "We conducted three experiments to investigate the effects of contours on the detection of data similarity with star glyph variations. A star glyph is a small, compact, data graphic that represents a multi-dimensional data point. Star glyphs are often used in small-multiple settings, to represent data points in tables, on maps, or as overlays on other types of data graphics. In these settings, an important task is the visual comparison of the data points encoded in the star glyph, for example to find other similar data points or outliers. We hypothesized that for data comparisons, the overall shape of a star glyph-enhanced through contour lines-would aid the viewer in making accurate similarity judgments. To test this hypothesis, we conducted three experiments. In our first experiment, we explored how the use of contours influenced how visualization experts and trained novices chose glyphs with similar data values. Our results showed that glyphs without contours make the detection of data similarity easier. Given these results, we conducted a second study to understand intuitive notions of similarity. Star glyphs without contours most intuitively supported the detection of data similarity. In a third experiment, we tested the effect of star glyph reference structures (i.e., tickmarks and gridlines) on the detection of similarity. Surprisingly, our results show that adding reference structures does improve the correctness of similarity judgments for star glyphs with contours, but not for the standard star glyph. As a result of these experiments, we conclude that the simple star glyph without contours performs best under several criteria, reinforcing its practice and popularity in the literature. Contours seem to enhance the detection of other types of similarity, e.g., shape similarity and are distracting when data similarity has to be judged. Based on these findings we provide design considerations regarding the use of contours and reference structures on star glyphs.", "paper_title": "The Influence of Contour on Similarity Perception of Star Glyphs", "paper_id": "WOS:000344991700070"}