{"auto_keywords": [{"score": 0.04293000217853898, "phrase": "vector_field"}, {"score": 0.00481495049065317, "phrase": "planar_vector_fields"}, {"score": 0.004779085953614184, "phrase": "topological_methods"}, {"score": 0.004708152527097594, "phrase": "vector_field_visualization"}, {"score": 0.004620957579769604, "phrase": "sparse_representation"}, {"score": 0.004434745755769201, "phrase": "streamline_visualization"}, {"score": 0.004240116703465252, "phrase": "streamline_methods"}, {"score": 0.004146015717402716, "phrase": "salient_features"}, {"score": 0.0036235254023315798, "phrase": "mere_noise"}, {"score": 0.003516635512391528, "phrase": "feature_importance"}, {"score": 0.003107935254560724, "phrase": "so-called_hodge_decomposition"}, {"score": 0.0030502854924662837, "phrase": "original_vector_field"}, {"score": 0.0027776422068966867, "phrase": "scalar_field"}, {"score": 0.0025388011374541546, "phrase": "simple_and_novel_algorithm"}, {"score": 0.002463830258460528, "phrase": "topological_importance"}, {"score": 0.0024090550572099688, "phrase": "input_vector_field"}, {"score": 0.0022101055924375725, "phrase": "underlying_vector_field"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Vector field visualization", " Hodge decomposition"], "paper_abstract": "Methods for vector field visualization strive to have a sparse representation of the field, while encoding all of its important features. Streamline visualization is one of the most popular such methods. Traditionally, a set of streamline methods have focused on capturing the salient features of the vector field such as sources, sinks, and vortices. However, not all features are created equal, and some features of the vector field are more important than others, which could simply be mere noise. It is this problem of characterizing feature importance through streamline visualization that we try to address in this paper. Specifically, a given 2D vector field can be decomposed into a rotation-free (gradient) component, divergence-free (curl) component and a harmonic component by the so-called Hodge decomposition. Features in the original vector field, in some sense, correspond to features in the first two components. Furthermore, the gradient and curl components are each induced by a scalar field. By analyzing these two corresponding scalar fields using topological methods (in particular the contour tree and the persistent homology), we develop a simple and novel algorithm whose streamline density tends to reflect the topological importance of the features in the input vector field. Such a feature-aware streamline sketch is more informative, yet still simple both visually and in terms of its generation. It enhances our understanding of the underlying vector field, which is demonstrated here by several experimental results. (c) 2012 Elsevier Ltd. All rights reserved.", "paper_title": "Feature-aware streamline generation of planar vector fields via topological methods", "paper_id": "WOS:000308622600018"}