{"auto_keywords": [{"score": 0.049757144405741305, "phrase": "dynamic_binding"}, {"score": 0.015719716506582538, "phrase": "service_oriented_architectures"}, {"score": 0.015459727487894455, "phrase": "mapping_study"}, {"score": 0.0045160988337296605, "phrase": "new_paradigm"}, {"score": 0.0044706300051082035, "phrase": "interoperable_and_highly_dynamic_applications"}, {"score": 0.003999578057088828, "phrase": "manual_and_automatic_search"}, {"score": 0.003700833742881285, "phrase": "relevant_information"}, {"score": 0.0036635429301869527, "phrase": "previously_defined_set"}, {"score": 0.0036388906120614012, "phrase": "research_questions"}, {"score": 0.0033669963955215427, "phrase": "main_objectives"}, {"score": 0.0029614320534324104, "phrase": "specific_points"}, {"score": 0.0029118285733827406, "phrase": "life_cycle"}, {"score": 0.0027867024825194834, "phrase": "relevant_group"}, {"score": 0.0023935561037315375, "phrase": "specific_nature"}, {"score": 0.0023694065215394593, "phrase": "reviewed_topic"}, {"score": 0.002229529362571334, "phrase": "current_gaps"}, {"score": 0.0021627252935396564, "phrase": "soa"}, {"score": 0.002148136905808445, "phrase": "testing_approaches"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Software testing", " Service Oriented Architectures", " SOA", " Dynamic binding", " Mapping study", " Systematic literature review"], "paper_abstract": "Context: Service Oriented Architectures (SOA) have emerged as a new paradigm to develop interoperable and highly dynamic applications. Objective: This paper aims to identify the state of the art in the research on testing in Service Oriented Architectures with dynamic binding. Method: A mapping study has been performed employing both manual and automatic search in journals, conference/workshop proceedings and electronic databases. Results: A total of 33 studies have been reviewed in order to extract relevant information regarding a previously defined set of research questions. The detection of faults and the decision making based on the information gathered from the tests have been identified as the main objectives of these studies. To achieve these goals, monitoring and test case generation are the most proposed techniques testing both functional and non-functional properties. Furthermore, different stakeholders have been identified as participants in the tests, which are performed in specific points in time during the life cycle of the services. Finally, it has been observed that a relevant group of studies have not validated their approach yet. Conclusions: Although we have only found 33 studies that address the testing of SOA where the discovery and binding of the services are performed at runtime, this number can be considered significant due to the specific nature of the reviewed topic. The results of this study have contributed to provide a body of knowledge that allows identifying current gaps in improving the quality of the dynamic binding in SOA using testing approaches. (C) 2010 Elsevier B.V. All rights reserved.", "paper_title": "Testing in Service Oriented Architectures with dynamic binding: A mapping study", "paper_id": "WOS:000288348500001"}