{"auto_keywords": [{"score": 0.04601284855430019, "phrase": "circuit_parameter_variations"}, {"score": 0.004721162131188487, "phrase": "next-generation_sram_design"}, {"score": 0.004236908273106904, "phrase": "high_performance_and_energy_efficient_systems"}, {"score": 0.004073359218158693, "phrase": "lower_costs"}, {"score": 0.003728000957725218, "phrase": "robust_and_resilient_six-transistor-cell_static_random_access_memory"}, {"score": 0.0028857130140890787, "phrase": "wid"}, {"score": 0.0028293966058473476, "phrase": "operation_variations"}, {"score": 0.0024891269874339553, "phrase": "modified_versions"}, {"score": 0.0023346234464901978, "phrase": "negative_bias_temperature_instability"}, {"score": 0.002233301265743633, "phrase": "existing_and_next-generation_technology_nodes"}, {"score": 0.0021682027434117095, "phrase": "modeling_techniques"}, {"score": 0.0021049977753042253, "phrase": "major_types"}], "paper_keywords": ["6T-SRAM", " 16-nm", " access-time", " aging", " optimum architecture", " reliability", " type of variations", " variability", " yield"], "paper_abstract": "Effectively confronting device and circuit parameter variations to maintain or improve the design of high performance and energy efficient systems while satisfying historical standards for reliability and lower costs is increasingly challenging with the scaling of technology. In this paper, we develop methods for robust and resilient six-transistor-cell static random access memory (6T-SRAM) designs that mitigate the effects of device and circuit parameter variations. Our interdisciplinary effort involves: 1) using our own recently developed VAR-TX model [1] to illustrate the impact of interdie (also known as die-to-die, D2D) and intradie (also know as within-die, WID) process and operation variations namely threshold voltage (Vth), gate length (L), and supply voltage (Vdd) on future different 16-nm architectures and 2) using modified versions of other well-received models to illustrate the impact of variability due to temperature, negative bias temperature instability, aging, and so forth, on existing and next-generation technology nodes. Our goal in combining modeling techniques is to help minimize all major types of variability and to consequently predict and optimize speed and yield for the next generation 6T-SRAMs.", "paper_title": "Confronting the Variability Issues Affecting the Performance of Next-Generation SRAM Design to Optimize and Predict the Speed and Yield", "paper_id": "WOS:000209653800042"}