{"auto_keywords": [{"score": 0.04119507495012034, "phrase": "agency_theory"}, {"score": 0.00481495049065317, "phrase": "enterprise_resource_planning_systems"}, {"score": 0.004611959213131437, "phrase": "decision_support_systems"}, {"score": 0.004281202319048493, "phrase": "implementation_consultants"}, {"score": 0.0041981583430961734, "phrase": "client_firm"}, {"score": 0.004149103940568346, "phrase": "current_study"}, {"score": 0.0038665369393234713, "phrase": "consultant-client_relationship"}, {"score": 0.0037915057447460133, "phrase": "erp_implementation_project_success"}, {"score": 0.0036172962914449826, "phrase": "erp_implementation_process"}, {"score": 0.003561017335579207, "phrase": "data_analysis"}, {"score": 0.0035332058983966424, "phrase": "structural_equation_modeling"}, {"score": 0.0033183674218329904, "phrase": "greater_erp_project_success"}, {"score": 0.002825435048559866, "phrase": "greater_erp_success"}, {"score": 0.002792375587031108, "phrase": "greater_incentive_alignment"}, {"score": 0.0027705505273051007, "phrase": "greater_moral_hazard"}, {"score": 0.002551409948440577, "phrase": "outsourced_information_systems_project_implementation"}, {"score": 0.0023038997972591193, "phrase": "future_researchers"}, {"score": 0.0022414566728770745, "phrase": "incentive_alignment"}, {"score": 0.0021892798077661956, "phrase": "information_systems_project_managers"}], "paper_keywords": ["Agency theory", " information systems", " project management", " project success", " enterprise resource planning"], "paper_abstract": "Enterprise resource planning (ERP) systems are rapidly becoming the foundations to the decision support systems of many organizations, but have all too often failed to deliver their expected benefits. Most ERP implementation projects are carried out using implementation consultants hired from outside the client firm. The current study treated the consultants as agents and the clients as principals, and applied agency theory to test the consultant-client relationship as a predictor of ERP implementation project success. A survey collected responses from 192 client project managers who worked on the ERP implementation process in their organizations. Data analysis via structural equation modeling showed that more consultant monitoring predicts less moral hazard (i.e., consultant shirking), that less moral hazard predicts greater ERP project success, and that more monitoring directly predicts such success. However, the analysis failed to support expectations that more pre-qualification efforts (i.e., screening of the consultant) would lead to less adverse selection (i.e., the consultant's misrepresentation of skills) or that less adverse selection would lead to greater ERP success. Surprisingly greater incentive alignment predicted greater moral hazard, thus suggesting the potential of incentives to de-motivate rather than motivate. This study contributed by extending agency theory to outsourced information systems project implementation. It provided new, validated measures of prequalification efforts, monitoring, incentive alignment, moral hazard, and adverse selection constructs. The findings suggest that future researchers may want to learn more about incentive alignment and its impact, and that information systems project managers may want to monitor more to improve ERP and other large-scale system implementation success.", "paper_title": "Agency Theory and Consultant Management in Enterprise Resource Planning Systems Implementation", "paper_id": "WOS:000296070800002"}