{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "signature_forgery"}, {"score": 0.004727995968069753, "phrase": "forger"}, {"score": 0.00453113241842654, "phrase": "handwritten_signature_production"}, {"score": 0.004263972370406983, "phrase": "personal_authentication"}, {"score": 0.004086350434865782, "phrase": "individual_signatures"}, {"score": 0.0037075456471849892, "phrase": "verification_time"}, {"score": 0.0034887749053459584, "phrase": "signature_usage"}, {"score": 0.0034465894339710864, "phrase": "verification_purposes"}, {"score": 0.0033029038236817372, "phrase": "particular_third-party_signature"}, {"score": 0.0029422942175866057, "phrase": "individual's_experience"}, {"score": 0.002636956926079255, "phrase": "perceived_signature_complexity"}, {"score": 0.0025892330566358503, "phrase": "perceived_effectiveness"}, {"score": 0.0023346234464901978, "phrase": "overall_signature_complexity"}], "paper_keywords": ["signature", " biometrics", " forgeability", " user acceptance signature", " biometrics", " user acceptance"], "paper_abstract": "Signatures are widely used as a form of personal authentication. Despite ubiquity in deployment, individual signatures are relatively easy to forge, especially when only the static 'pictorial' outcome of the signature is considered at verification time. In this study, we explore opinions on signature usage for verification purposes, and how individuals rate a particular third-party signature in terms of ease of forgeability and their own ability to forge. We examine responses with respect to an individual's experience of the forgeability/complexity of their own signature. Our study shows that past experience does not generally have an effect on perceived signature complexity nor the perceived effectiveness of an individual to themselves forge a signature. In assessing forgeability, most subjects cite the overall signature complexity and distinguishing features in reaching this decision. Furthermore, our research indicates that individuals typically vary their signature according to the scenario but generally little effort into the production of the signature.", "paper_title": "Signature Forgery and the Forger - An Assessment of Influence on Handwritten Signature Production", "paper_id": "WOS:000365355200004"}