{"auto_keywords": [{"score": 0.03524369468825586, "phrase": "competitive_ratio"}, {"score": 0.03314935372077038, "phrase": "randomized_algorithms"}, {"score": 0.00481495049065317, "phrase": "online_pricing_problem"}, {"score": 0.004582829542018412, "phrase": "single_seller"}, {"score": 0.004326065324764224, "phrase": "different_times"}, {"score": 0.004106121975261152, "phrase": "non-increasing_acceptable_price_function"}, {"score": 0.0033970080655122965, "phrase": "deterministic_algorithm"}, {"score": 0.0032419214933891638, "phrase": "highest_unit_price"}, {"score": 0.0030099856703241046, "phrase": "randomized_algorithm"}, {"score": 0.0029283470183723427, "phrase": "first_competitive_randomized_algorithm"}, {"score": 0.0029203055813347874, "phrase": "rp-multi"}, {"score": 0.002842217634621891, "phrase": "delta"}, {"score": 0.0027945966402685278, "phrase": "maximum_and_minimum_copies"}, {"score": 0.0024088451312725924, "phrase": "competitive_deterministic_algorithms"}, {"score": 0.0023499294490179788, "phrase": "dp-multi"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Online pricing", " Competitive analysis", " Lower bounds", " Randomized algorithms"], "paper_abstract": "This paper studies the online pricing problem in which there is a sequence of users who want to buy items from one seller. The single seller has k types of items and each type has limited copies. These users are arriving one by one at different times and are single-minded. When arriving, each user would announce her interested bundle of items and a non-increasing acceptable price function, which specifies how much she is willing to pay for a certain number of bundles. Upon the arrival of a user, the seller needs to determine immediately the number of bundles to be sold to the user and the price he would charge her. His goal is to maximize the sum of money received from users. When items are indivisible, we show that no deterministic algorithm for the problem could have competitive ratio better than O (hk) where h is the highest unit price that at least some user is willing to pay. Thus we focus on randomized algorithms. We derive a lower bound Omega(logh + root k) on the competitive ratio of any randomized algorithm for solving this problem. Then we give the first competitive randomized algorithm Rp-MULTI which is O (psi(h)root k Delta/delta)-competitive, where Delta and delta are respectively the maximum and minimum copies a type of items can have and psi(h) is a function growing slightly faster than logh. When h is known ahead of time, the ratio is decreased to O ((logh)root k Delta/delta). When items are divisible and can be sold fractionally, we concentrate on designing competitive deterministic algorithms. We give the first competitive deterministic algorithm Dp-MULTI which is O (psi(h)root k Delta/delta)-competitive. When h is known, the ratio can be decreased to O ((logh)root k Delta/delta). We also study randomized algorithms for the problem. (C) 2015 Elsevier B.V. All rights reserved.", "paper_title": "Online pricing for multi-type of items", "paper_id": "WOS:000350939800005"}