{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "social_tagging"}, {"score": 0.014547554463569574, "phrase": "ddc"}, {"score": 0.006655965871386514, "phrase": "uncontrolled_social_tags"}, {"score": 0.006350981268939192, "phrase": "controlled_vocabulary"}, {"score": 0.004777392826700429, "phrase": "automated_keywords"}, {"score": 0.004703149944841539, "phrase": "purpose_-_the_purpose"}, {"score": 0.004487241576747549, "phrase": "dewey_decimal_classification"}, {"score": 0.004383016741930174, "phrase": "established_knowledge_organization_system"}, {"score": 0.004214637810698362, "phrase": "ultimate_purpose"}, {"score": 0.0041653916552844535, "phrase": "subject_indexing"}, {"score": 0.0041328796505374155, "phrase": "information_retrieval"}, {"score": 0.0034107088717109857, "phrase": "also_mappings"}, {"score": 0.0032539388572032563, "phrase": "controlled_vocabulary_suggestions"}, {"score": 0.002825435048559866, "phrase": "access_points"}, {"score": 0.0025614418906438744, "phrase": "conceptual_relevance"}, {"score": 0.0022414566728770767, "phrase": "user_trial"}, {"score": 0.0021049977753042253, "phrase": "final_reflection"}], "paper_keywords": ["Information retrieval", " User studies", " Indexing", " Classification schemes", " Semantics", " Controlled languages"], "paper_abstract": "Purpose - The purpose of this paper is to explore the potential of applying the Dewey Decimal Classification (DDC) as an established knowledge organization system (KOS) for enhancing social tagging, with the ultimate purpose of improving subject indexing and information retrieval. Design/methodology/approach - Over 11,000 Intute metadata records in politics were used. Totally, 28 politics students were each given four tasks, in which a total of 60 resources were tagged in two different configurations, one with uncontrolled social tags only and another with uncontrolled social tags as well as suggestions from a controlled vocabulary. The controlled vocabulary was DDC comprising also mappings from the Library of Congress Subject Headings. Findings - The results demonstrate the importance of controlled vocabulary suggestions for indexing and retrieval: to help produce ideas of which tags to use, to make it easier to find focus for the tagging, to ensure consistency and to increase the number of access points in retrieval. The value and usefulness of the suggestions proved to be dependent on the quality of the suggestions, both as to conceptual relevance to the user and as to appropriateness of the terminology. Originality/value - No research has investigated the enhancement of social tagging with suggestions from the DDC, an established KOS, in a user trial, comparing social tagging only and social tagging enhanced with the suggestions. This paper is a final reflection on all aspects of the study.", "paper_title": "Enhancing social tagging with automated keywords from the Dewey Decimal Classification", "paper_id": "WOS:000341925900005"}