{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "identity_management"}, {"score": 0.007843078644151031, "phrase": "im"}, {"score": 0.004517387079319428, "phrase": "personal_information"}, {"score": 0.0044089082776901135, "phrase": "social_networks"}, {"score": 0.004123781267600542, "phrase": "predominant_explanations"}, {"score": 0.004036968488559984, "phrase": "different_types"}, {"score": 0.004012500850311087, "phrase": "individual_acts"}, {"score": 0.003810400966372849, "phrase": "narrative_approaches"}, {"score": 0.003618443379266972, "phrase": "empirical_research"}, {"score": 0.0035965032173588753, "phrase": "public_responses"}, {"score": 0.003574695610710444, "phrase": "new_forms"}, {"score": 0.0034152842718313888, "phrase": "television_series"}, {"score": 0.0033637374697995616, "phrase": "group_data"}, {"score": 0.0033433365160336842, "phrase": "people's_feelings"}, {"score": 0.0031555744873774686, "phrase": "public_engagements"}, {"score": 0.003136432373013026, "phrase": "im."}, {"score": 0.0029965060407413898, "phrase": "state_and_commercial_contexts"}, {"score": 0.0028541057064952876, "phrase": "varying_degrees"}, {"score": 0.002661146838358236, "phrase": "modern_im"}, {"score": 0.0025578967205807843, "phrase": "human_sense"}, {"score": 0.002414138203828421, "phrase": "distinct_attributes"}, {"score": 0.0021700901058417602, "phrase": "fundamental_human_desire"}, {"score": 0.0021049977753042253, "phrase": "im_systems"}], "paper_keywords": ["Cross-cultural studies", " Identity", " Privacy", " Agency", " Citizenship", " Technology acceptance", " Authentication", " Authority", " Biometrics", " Narratives", " Identity management technologies"], "paper_abstract": "Purpose - The purpose of this paper is to address the paradox in identity management that sees people happily sharing personal information in some circumstances, such as via social networks, yet defending their right to privacy in others, such as in interactions with the state. The authors examine the predominant explanations and elaborate how these ignore the different types of individual acts and agency involved in identity management. The authors conclude with a proposal to consider alternative, narrative approaches to identity management (IM). Design/methodology/approach - This paper has been developed out of the empirical research examining public responses to new forms of IM, based on, among other things, Delphi interviews with experts, films and television series and survey and focus group data about people's feelings and attitudes. The authors have combined these data into an approach that theorises rather than reports about public engagements with IM. Findings - Finding any explanation for the paradox that rests on the distinction between state and commercial contexts to be less and less satisfactory, the paper reframes the problem as one of varying degrees of agency, from submission to transaction and expression. The latter, the authors argue, has been written out of modern IM, which is at odds with the centrality of narrative to the human sense of self. Originality/value - The field of IM has yet to consider \"identity\" in terms beyond distinct attributes and bits of information. In this paper the authors set out to demonstrate the value of a notion of IM that is sensitive to degrees of agency and the authors ask how the fundamental human desire to narrate the self might become a part of IM systems.", "paper_title": "Exercising identity: agency and narrative in identity management", "paper_id": "WOS:000341937900008"}