{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "self-assembly_process"}, {"score": 0.015509681111979347, "phrase": "biological_development"}, {"score": 0.014996602639186327, "phrase": "self-assembling_systems"}, {"score": 0.011033837801360285, "phrase": "morphological_information"}, {"score": 0.0077864021369302245, "phrase": "body_plan"}, {"score": 0.004782394065087311, "phrase": "inspiration"}, {"score": 0.004669845451682529, "phrase": "practical_challenges"}, {"score": 0.004483120978156604, "phrase": "limited_set"}, {"score": 0.004452731043379068, "phrase": "fixed_components"}, {"score": 0.003769006950727621, "phrase": "target_structure"}, {"score": 0.0037307208089736835, "phrase": "staging_algorithm"}, {"score": 0.003581412258960711, "phrase": "previous_staging_strategies"}, {"score": 0.0034970809586393416, "phrase": "component_physical_features"}, {"score": 0.0031790892089501345, "phrase": "time_interval"}, {"score": 0.002812237329893584, "phrase": "component_movement"}, {"score": 0.002690406375639144, "phrase": "assembly_errors"}, {"score": 0.0026630475331025955, "phrase": "bonding_mechanisms"}, {"score": 0.0026449626324264275, "phrase": "rotational_properties"}, {"score": 0.0025914395870574787, "phrase": "doglike_target_structure"}, {"score": 0.0025217522723800204, "phrase": "component_information"}, {"score": 0.002487612781045517, "phrase": "earlier_time_interval"}, {"score": 0.0024372660612788184, "phrase": "later_time_interval"}, {"score": 0.0023079225317714815, "phrase": "staged_body_plan"}], "paper_keywords": ["Self-assembly", " staging", " 3D printing", " tile assembly model", " embodied computing", " biological development"], "paper_abstract": "One of the practical challenges facing the creation of self-assembling systems is being able to exploit a limited set of fixed components and their bonding mechanisms. The method of staging divides the self-assembly process into time intervals, during which components can be added to, or removed from, an environment at each interval. Staging addresses the challenge of using components that lack plasticity by encoding the construction of a target structure in the staging algorithm itself and not exclusively in the design of the components. Previous staging strategies do not consider the interplay between component physical features (morphological information). In this work we use morphological information to stage the self-assembly process, during which components can only be added to their environment at each time interval, to demonstrate our concept. Four experiments are presented, which use heterogeneous, passive, mechanical components that are fabricated using 3D printing. Two orbital shaking environments are used to provide energy to the components and to investigate the role of morphological information with component movement in either two or three spatial dimensions. The benefit of our staging strategy is shown by reducing assembly errors and exploiting bonding mechanisms with rotational properties. As well, a doglike target structure is used to demonstrate in theory how component information used at an earlier time interval can be reused at a later time interval, inspired by the use of a body plan in biological development. We propose that a staged body plan is one method toward scaling self-assembling systems with many interacting components. The experiments and body plan example demonstrate, as proof of concept, that staging enables the self-assembly of more complex morphologies not otherwise possible.", "paper_title": "Staging the Self-Assembly Process: Inspiration from Biological Development", "paper_id": "WOS:000327943100003"}