{"auto_keywords": [{"score": 0.046544603599526696, "phrase": "knave-ii"}, {"score": 0.03508295490893253, "phrase": "user_satisfaction"}, {"score": 0.031461310706329, "phrase": "ess"}, {"score": 0.015561694667489525, "phrase": "time-oriented_clinical_data"}, {"score": 0.010096852658826976, "phrase": "paper_charts"}, {"score": 0.009500409834999803, "phrase": "second_evaluation"}, {"score": 0.00481495049065317, "phrase": "intelligent_query"}, {"score": 0.004529093447865156, "phrase": "longitudinal_clinical_data"}, {"score": 0.004506048850130758, "phrase": "clinical_concepts"}, {"score": 0.004336894811284795, "phrase": "knowledge-based_problem-solving_method"}, {"score": 0.004238452771031322, "phrase": "clinical_queries"}, {"score": 0.003946195919158241, "phrase": "variable_complexity"}, {"score": 0.0038862297330905836, "phrase": "oncology_protocols"}, {"score": 0.0038271712887391015, "phrase": "standard_methods"}, {"score": 0.003636692152882991, "phrase": "phase_ii."}, {"score": 0.00346449481422526, "phrase": "complexity_category"}, {"score": 0.003377153342020835, "phrase": "predetermined_gold_standard"}, {"score": 0.0033428343518768543, "phrase": "domain_expert"}, {"score": 0.0032585499655442404, "phrase": "\"usability_of_toot_comparison\"_comparative_questionnaire"}, {"score": 0.0031440987202675332, "phrase": "higher-complexity_queries"}, {"score": 0.0029571431113892504, "phrase": "hard_queries"}, {"score": 0.0028026735035370206, "phrase": "first_phase"}, {"score": 0.0027459678326877744, "phrase": "second_phase"}, {"score": 0.00254983442025512, "phrase": "correct_answers"}, {"score": 0.002313838056132966, "phrase": "clinicians"}, {"score": 0.002137537770621167, "phrase": "physician_time"}, {"score": 0.0021049977753042253, "phrase": "clinical_assessment"}], "paper_keywords": ["medical informatics", " clinical decision-support systems", " human-computer interface", " information-visualization", " knowledge-based systems", " temporal reasoning", " intelligent user interfaces"], "paper_abstract": "Objective: Evaluate KNAVE-II, a knowledge-based framework for visualization, interpretation, and exploration of longitudinal clinical data, clinical concepts and patterns. KNAVE-II mediates queries to a distributed temporal-abstraction architecture(IDAN), which uses a knowledge-based problem-solving method specializing in on-the-fly computation of clinical queries. Methods: A two-phase, balanced cross-over study to compare efficiency and satisfaction of a group of clinicians when answering queries of variable complexity about time-oriented clinical data, typical for oncology protocols, using KNAVE-II, versus standard methods: both paper charts and a popular electronic spreadsheet (ESS) in Phase 1; an ESS in Phase II. The measurements included the time required to answer and the correctness of answer for each query and each complexity category, and for all queries, assessed versus a predetermined gold standard set by a domain expert. User satisfaction was assessed by the Standard Usability Score (SUS) tool-specific questionnaire and by a \"Usability of Toot Comparison\" comparative questionnaire developed for this study. Results: In both evaluations, subjects answered higher-complexity queries significantly faster using KNAVE-II than when using paper charts or an ESS up to a mean of 255 s difference per query versus the ESS for hard queries (p = 0.0003) in the second evaluation. Average correctness scores when using KNAVE-II versus paper charts, in the first phase, and the ESS, in the second phase, were significantly higher over all queries. In the second evaluation, 91.6% (110/120) of all of the questions asked within queries of all levels produced correct answers using KNAVE-II, opposed to only 57.5% (69/120) using the ESS (p < 0.0001). User satisfaction with KNAVE-II was significantly superior compared to using either a paper chart or the ESS (p = 0.006). Clinicians ranked KNAVE-II superior to both paper and the ESS. Conclusions: An evaluation of the functionality and usability of KNAVE-II and its supporting knowledge-based temporal-mediation architecture has produced highly encouraging results regarding saving of physician time, enhancement of accuracy of clinical assessment, and user satisfaction. (c) 2008 Elsevier B.V. All rights reserved.", "paper_title": "Evaluation of an architecture for intelligent query and exploration of time-oriented clinical data", "paper_id": "WOS:000256327300002"}