{"auto_keywords": [{"score": 0.04600486517741043, "phrase": "optimization_phase"}, {"score": 0.020610001707482083, "phrase": "stochastic_information"}, {"score": 0.01641712254837444, "phrase": "expected_value"}, {"score": 0.00481495049065317, "phrase": "stochastic_packing_problems"}, {"score": 0.004742290714667451, "phrase": "stochastic_variants"}, {"score": 0.004706371093110664, "phrase": "wide_class"}, {"score": 0.004682575242681044, "phrase": "np-hard_packing"}, {"score": 0.004519324087553789, "phrase": "first_stage"}, {"score": 0.004485085675709643, "phrase": "probing_phase"}, {"score": 0.004156590395333602, "phrase": "probed_value"}, {"score": 0.004001441644488586, "phrase": "exact_value"}, {"score": 0.0039310261964323545, "phrase": "probed_item"}, {"score": 0.003784264852923677, "phrase": "different_outcomes"}, {"score": 0.0033333689389109817, "phrase": "resulting_solution"}, {"score": 0.003299700193091772, "phrase": "packing_constraints"}, {"score": 0.0032498315583945163, "phrase": "output_solution"}, {"score": 0.0032251796659158696, "phrase": "last_feasible_solution"}, {"score": 0.003088965605775215, "phrase": "non-adaptive_policies"}, {"score": 0.0030500051941781034, "phrase": "priori_a_fixed_permutation"}, {"score": 0.002988685006809336, "phrase": "adaptive_policies"}, {"score": 0.002950985667286563, "phrase": "dynamic_decisions"}, {"score": 0.0028990018343924683, "phrase": "instantiated_values"}, {"score": 0.002632332114727894, "phrase": "optimal_adaptive_policy"}, {"score": 0.0025859470452054916, "phrase": "optimal_non-adaptive_policy"}, {"score": 0.002348006402273998, "phrase": "upper_bound"}, {"score": 0.0023301793939902015, "phrase": "adaptivity_gap"}, {"score": 0.002300767290603968, "phrase": "corresponding_class"}, {"score": 0.0022544764263018637, "phrase": "different_problems"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Benefit of adaptivity", " Stochastic optimization", " Packing integer programs"], "paper_abstract": "We consider stochastic variants of a wide class of NP-hard packing integer problems. In these variants the problem consists of two stages, the first stage is the probing phase, and the second is the optimization phase. The problem has items, each of which is associated with stochastic information which we can probe. We assume that every probed value corresponds to a distribution, that is, the probing does not fix the exact value of the stochastic information associated with the probed item, but fixes another distribution for that information, that is perhaps different for different outcomes of the probing. All these distributions are known to the optimizer a priori. In the optimization phase, the solution is constructed sequentially, and the act of choosing an item instantiates its stochastic information. The goal is to compute a policy that maximizes the expected value of the given objective function of the resulting solution such that the packing constraints are satisfied, where the output solution is the last feasible solution in the series of solutions which the optimizer creates during the optimization phase: We consider both non-adaptive policies (that designate a priori a fixed permutation of variables in the solution) and adaptive policies (that can make dynamic decisions based on the history of the instantiated values of the stochastic information). Our work characterizes the benefit of adaptivity. For this purpose we use a measure called the adaptivity gap: the supremum over instances of the ratio between the expected value obtained by an optimal adaptive policy and the expected value obtained by an optimal non-adaptive policy. In such problems the benefit of adaptivity is due to two phases: probing and optimization. Assuming that for the optimization phase (without the probing) the benefit of adaptivity is at most rho, we show an upper bound on the adaptivity gap of 2 rho for the corresponding class with probing. We demonstrate our results for different problems and for each of these classes we provide examples that show that there is indeed a benefit of adaptivity in probing. (C) 2014 Elsevier B.V. All rights reserved.", "paper_title": "The benefit of adaptivity in stochastic packing problems with probing", "paper_id": "WOS:000347602000035"}