{"auto_keywords": [{"score": 0.007946041557805126, "phrase": "optimal_cooperation_strategy"}, {"score": 0.00481495049065317, "phrase": "coalition-based_resource_allocation"}, {"score": 0.004611669085594069, "phrase": "wireless_access"}, {"score": 0.004550856732700044, "phrase": "potentially_multihop_routes"}, {"score": 0.0041469500929423595, "phrase": "others'_customers"}, {"score": 0.004078675940346967, "phrase": "individual_shares"}, {"score": 0.003998223112665124, "phrase": "opportunistic_utilization"}, {"score": 0.0034317185678527672, "phrase": "rational_basis"}, {"score": 0.003386412845243943, "phrase": "aggregate_payoffs"}, {"score": 0.0032004205378150354, "phrase": "transferable_payoff"}, {"score": 0.0031898025329389376, "phrase": "coalitional_games"}, {"score": 0.0031268278911838953, "phrase": "optimum_cooperation_strategy"}, {"score": 0.002974760986688745, "phrase": "base_stations"}, {"score": 0.0028113140998735366, "phrase": "integer_optimization"}, {"score": 0.002746644177161797, "phrase": "grand_coalition"}, {"score": 0.002595698433525986, "phrase": "operating_point"}, {"score": 0.002561401523136952, "phrase": "providers'_aggregate_payoff"}, {"score": 0.00239657981537094, "phrase": "stabilizing_payoff_shares"}, {"score": 0.002357055030818803, "phrase": "polynomial_time"}, {"score": 0.002249811525923913, "phrase": "distributed_computations"}, {"score": 0.002234893735225432, "phrase": "limited_exchange"}, {"score": 0.0022200746395981876, "phrase": "confidential_information"}, {"score": 0.002183454435945014, "phrase": "numerical_evaluations"}, {"score": 0.0021403049512708494, "phrase": "individual_providers'_payoffs"}], "paper_keywords": ["Coalition games", " cooperation", " core", " nucleolus", " optimization", " profit sharing", " Shapley value", " wireless networks"], "paper_abstract": "We consider a network in which several service providers offer wireless access to their respective subscribed customers through potentially multihop routes. If providers cooperate by jointly deploying and pooling their resources, such as spectrum and infrastructure (e.g., base stations) and agree to serve each others' customers, their aggregate payoffs, and individual shares, may substantially increase through opportunistic utilization of resources. The potential of such cooperation can, however, be realized only if each provider intelligently determines with whom it would cooperate, when it would cooperate, and how it would deploy and share its resources during such cooperation. Also, developing a rational basis for sharing the aggregate payoffs is imperative for the stability of the coalitions. We model such cooperation using the theory of transferable payoff coalitional games. We show that the optimum cooperation strategy, which involves the acquisition, deployment, and allocation of the channels and base stations (to customers), can be computed as the solution of a concave or an integer optimization. We next show that the grand coalition is stable in many different settings, i.e., if all providers cooperate, there is always an operating point that maximizes the providers' aggregate payoff, while offering each a share that removes any incentive to split from the coalition. The optimal cooperation strategy and the stabilizing payoff shares can be obtained in polynomial time by respectively solving the primals and the duals of the above optimizations, using distributed computations and limited exchange of confidential information among the providers. Numerical evaluations reveal that cooperation substantially enhances individual providers' payoffs under the optimal cooperation strategy and several different payoff sharing rules.", "paper_title": "Cooperative Profit Sharing in Coalition-Based Resource Allocation in Wireless Networks", "paper_id": "WOS:000300425000006"}