{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "educational_mmorpgs"}, {"score": 0.0061624906306848625, "phrase": "relative_weights"}, {"score": 0.00606486449210511, "phrase": "sociability_factors"}, {"score": 0.004713381833244835, "phrase": "ahp"}, {"score": 0.004638602678192715, "phrase": "purpose_-_sociability"}, {"score": 0.0037474693720823643, "phrase": "fuzzy-ahp_approach"}, {"score": 0.0032969458013463807, "phrase": "pair-wise_comparison_data_input_format"}, {"score": 0.0029789104204803137, "phrase": "five_most_important_factors"}, {"score": 0.002947266048104005, "phrase": "sociability_-_cooperation"}, {"score": 0.0029159568444629053, "phrase": "team-based_reward"}, {"score": 0.0027791193706247267, "phrase": "social_navigation"}, {"score": 0.0027058852678238632, "phrase": "prior_studies"}, {"score": 0.0023051837161137674, "phrase": "educational_mmorpg_developers"}, {"score": 0.002220551141101661, "phrase": "specific_guidelines"}, {"score": 0.0021049977753042253, "phrase": "best_design_strategy"}], "paper_keywords": ["Sociability", " Analytical hierarchy process", " Fuzzy theory", " Educational MMORPGs", " Multi-criteria decision making", " Computer games"], "paper_abstract": "Purpose - Sociability is considered to be important to the success of educational MMORPGs. The purpose of this study was to access the relative weights of these sociability factors which the authors garnered from the literature on educational MMORPGs. Design/methodology/approach - The authors used fuzzy-AHP approach to access the relative weights of these sociability factors they garnered from the literature on educational MMORPGs. To do this, a questionnaire using a pair-wise comparison data input format was administered to 242 school teachers to gather assessments for the factors. Findings - The authors found five most important factors affecting sociability - cooperation, team-based reward, discussion of strategy, reputation, and social navigation. Originality/value - Although prior studies have identified various factors that facilitate sociability in educational MMORPGs, the relative importance of these factors has not been determined. The results can not only be used to help educational MMORPG developers focus on the most important sociability factors and propose specific guidelines for designing educational MMORPGs, but can also identify the best design strategy for promoting sociability of educational MMORPGs.", "paper_title": "Factors influencing sociability in educational MMORPGs - a fuzzy AHP approach", "paper_id": "WOS:000319893700002"}