{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "marker_genes"}, {"score": 0.004764435715755502, "phrase": "user_microarray"}, {"score": 0.004681413843223496, "phrase": "public-microarrays_marker_genes"}, {"score": 0.004583686207645165, "phrase": "scientific_teams"}, {"score": 0.0045037997020733415, "phrase": "microarray_data"}, {"score": 0.00395417485449239, "phrase": "high-throughput_gene_expression_data"}, {"score": 0.0039264465913491356, "phrase": "gene_expression_omnibus"}, {"score": 0.003898936544655016, "phrase": "geo"}, {"score": 0.0037508743235608872, "phrase": "different_microarrays"}, {"score": 0.0034713900276078786, "phrase": "microarray_marker_genes"}, {"score": 0.00329282940819675, "phrase": "geo_microarray_datasets"}, {"score": 0.0032013710938940424, "phrase": "new_microarrays"}, {"score": 0.0031789052605903437, "phrase": "geo."}, {"score": 0.0028702659563021047, "phrase": "public_microarrays"}, {"score": 0.0027417911324611917, "phrase": "researcher's_microarray"}, {"score": 0.0026655969705316708, "phrase": "different_subsets"}, {"score": 0.0025642664420937327, "phrase": "microarray_experiments"}, {"score": 0.0024066745849759706, "phrase": "studied_phenotypes"}, {"score": 0.0023729878025466836, "phrase": "undesirable_side_effects"}, {"score": 0.0022507989506447413, "phrase": "relevant_information"}, {"score": 0.0021959459702913654, "phrase": "previous_analyses"}, {"score": 0.0021049977753042253, "phrase": "public_repositories"}], "paper_keywords": [""], "paper_abstract": "The microarrays performed by scientific teams grow exponentially. These microarray data could be useful for researchers around the world, but unfortunately they are underused. To fully exploit these data, it is necessary (i) to extract these data from a repository of the high-throughput gene expression data like Gene Expression Omnibus (GEO) and (ii) to make the data from different microarrays comparable with tools easy to use for scientists. We have developed these two solutions in our server, implementing a database of microarray marker genes (Marker Genes Data Base). This database contains the marker genes of all GEO microarray datasets and it is updated monthly with the new microarrays from GEO. Thus, researchers can see whether the marker genes of their microarray are marker genes in other microarrays in the database, expanding the analysis of their microarray to the rest of the public microarrays. This solution helps not only to corroborate the conclusions regarding a researcher's microarray but also to identify the phenotype of different subsets of individuals under investigation, to frame the results with microarray experiments from other species, pathologies or tissues, to search for drugs that promote the transition between the studied phenotypes, to detect undesirable side effects of the treatment applied, etc. Thus, the researcher can quickly add relevant information to his/her studies from all of the previous analyses performed in other studies as long as they have been deposited in public repositories.", "paper_title": "MGDB: crossing the marker genes of a user microarray with a database of public-microarrays marker genes", "paper_id": "WOS:000338109200062"}