{"auto_keywords": [{"score": 0.004620093797504386, "phrase": "broadcast_rate"}, {"score": 0.004007083686875716, "phrase": "high-quality_video"}, {"score": 0.0036218682585355895, "phrase": "first_distributed_solution"}, {"score": 0.0035722806911457545, "phrase": "near-optimal_broadcast_rate"}, {"score": 0.0035395987202335223, "phrase": "arbitrary_node_degree_bounds"}, {"score": 0.0034911335714333507, "phrase": "arbitrary_overlay_graph"}, {"score": 0.0034118234596993836, "phrase": "individual_nodes"}, {"score": 0.0031699005399973496, "phrase": "peer_churn"}, {"score": 0.003140888248194296, "phrase": "network_dynamics"}, {"score": 0.002945081009084692, "phrase": "independent_interests"}, {"score": 0.00290473242917264, "phrase": "network-coding-based_broadcasting_algorithm"}, {"score": 0.0025892330566358503, "phrase": "optimal_broadcast_rate"}, {"score": 0.0025071862539276283, "phrase": "distributed_algorithms"}, {"score": 0.002286781334850213, "phrase": "optimal_equilibrium"}, {"score": 0.00226583335721762, "phrase": "noisy_measurements"}, {"score": 0.0022347698358650514, "phrase": "time-scale_separation_assumptions"}, {"score": 0.002124461969404541, "phrase": "uplink_bandwidth_statistics"}, {"score": 0.0021049977753042253, "phrase": "internet_hosts"}], "paper_keywords": ["Back-pressure", " Markov approximation", " network coding", " optimal and distributed algorithms", " peer-to-peer (P2P) broadcasting"], "paper_abstract": "We study the problem of maximizing the broadcast rate in peer-to-peer (P2P) systems under node degree bounds, i.e., the number of neighbors a node can simultaneously connect to is upper-bounded. The problem is critical for supporting high-quality video streaming in P2P systems and is challenging due to its combinatorial nature. In this paper, we address this problem by providing the first distributed solution that achieves near-optimal broadcast rate under arbitrary node degree bounds and over arbitrary overlay graph. It runs on individual nodes and utilizes only the measurement from their one-hop neighbors, making the solution easy to implement and adaptable to peer churn and network dynamics. Our solution consists of two distributed algorithms proposed in this paper that can be of independent interests: a network-coding-based broadcasting algorithm that optimizes the broadcast rate given a topology, and a Markov-chain guided topology hopping algorithm that optimizes the topology. Our distributed broadcasting algorithm achieves the optimal broadcast rate over arbitrary P2P topology, while previously proposed distributed algorithms obtain optimality only for P2P complete graphs. We prove the optimality of our solution and its convergence to a neighborhood around the optimal equilibrium under noisy measurements or without time-scale separation assumptions. We demonstrate the effectiveness of our solution in simulations using uplink bandwidth statistics of Internet hosts.", "paper_title": "Optimal Distributed P2P Streaming Under Node Degree Bounds", "paper_id": "WOS:000338124100003"}