{"auto_keywords": [{"score": 0.04949240338189186, "phrase": "trust_domains"}, {"score": 0.00481495049065317, "phrase": "trust_relations"}, {"score": 0.004583205112737672, "phrase": "generic_declarative_definitions"}, {"score": 0.004527024978801684, "phrase": "individual_and_collective_trust_relations"}, {"score": 0.00438955582974973, "phrase": "agent_collections"}, {"score": 0.004256243266481051, "phrase": "trust-related_agents"}, {"score": 0.003832423454781517, "phrase": "datalog-implementability_result"}, {"score": 0.0036703791815812328, "phrase": "potential_and_actual_trust_relationships"}, {"score": 0.003145417398038261, "phrase": "strong_trust_domains"}, {"score": 0.002797121441432477, "phrase": "five_major_cryptographic_applications"}, {"score": 0.0022117133940361025, "phrase": "weak_and_strong_trust"}], "paper_keywords": ["Access Control", " accountability", " applied modal logic", " CADM", " computational trust", " cryptographic-key management", " dependable multi-agent distributed systems", " PKI", " TTP", " Web of Trust"], "paper_abstract": "We propose generic declarative definitions of individual and collective trust relations between interacting agents and agent collections, and trust domains of trust-related agents in distributed systems. Our definitions yield (1) (in)compatibility, implicational and transitivity results for trust relationships, including a Datalog-implementability result for their logical structure; (2) computational complexity results for deciding potential and actual trust relationships and membership in trust domains; (3) a positive (negative) compositionality result for strong (weak) trust domains; (4) a computational design pattern for building up strong trust domains; and (5) a negative scalability result for trust domains in general. We instantiate our generic trust concepts in five major cryptographic applications of trust, namely: Access Control, Trusted Third Parties, the Web of Trust, Public-Key Infrastructures and Identity-Based Cryptography. We also show that accountability induces trust. Our defining principle for weak and strong trust (domains) is (common) belief in and (common) knowledge of agent correctness, respectively.", "paper_title": "Computer-aided decision-making with trust relations and trust domains (cryptographic applications)*", "paper_id": "WOS:000330447200002"}