{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "image_phylogeny_forests_reconstruction"}, {"score": 0.004724980378009193, "phrase": "simple_search"}, {"score": 0.004532892812505505, "phrase": "related_images"}, {"score": 0.004448169552315403, "phrase": "exact_copies"}, {"score": 0.003546513036085932, "phrase": "modified_version"}, {"score": 0.003415047118340286, "phrase": "near-duplicate_images"}, {"score": 0.003239114833599948, "phrase": "common_representation"}, {"score": 0.0032026066791743866, "phrase": "parent-child_relationship"}, {"score": 0.0030606302942851027, "phrase": "phylogeny_tree"}, {"score": 0.0026611838252683507, "phrase": "n_independent_subsets"}, {"score": 0.0025049752758014602, "phrase": "phylogeny_forest"}, {"score": 0.002402921062033032, "phrase": "state-of-the-art_image_phylogeny_algorithms"}, {"score": 0.0023137485947956732, "phrase": "phylogeny_forests"}, {"score": 0.002279011030331704, "phrase": "different_combinations"}], "paper_keywords": ["Image forensics", " multimedia phylogeny", " optimal branching"], "paper_abstract": "Today, a simple search for an image on the Web can return thousands of related images. Some results are exact copies, some are variants (or near-duplicates) of the same digital image, and others are unrelated. Although we can recognize some of these images as being semantically similar, it is not as straightforward to find which image is the original. It is not easy either to find the chain of transformations used to create each modified version. There are several approaches in the literature to identify near-duplicate images, as well as to reconstruct their relational structure. For the latter, a common representation uses the parent-child relationship, allowing us to visualize the evolution of modifications as a phylogeny tree. However, most of the approaches are restricted to the case of finding the tree of evolution of the near-duplicates, with few works dealing with sets of trees. Since one set of near-duplicates can contain n independent subsets, it is necessary to reconstruct not only one phylogeny tree, but several trees that will compose a phylogeny forest. In this paper, through the analysis of the state-of-the-art image phylogeny algorithms, we introduce a novel approach to deal with phylogeny forests, based on different combinations of these algorithms, aiming at improving their reconstruction accuracy. We analyze the effectiveness of each combination and evaluate our method with more than 40000 testing cases, using quantitative metrics.", "paper_title": "Image Phylogeny Forests Reconstruction", "paper_id": "WOS:000348129200001"}