{"auto_keywords": [{"score": 0.0403276584543565, "phrase": "smt"}, {"score": 0.00481495049065317, "phrase": "optimization_modulo_theories"}, {"score": 0.004776297980616768, "phrase": "linear_rational_costs"}, {"score": 0.0046621835537196754, "phrase": "automated_reasoning"}, {"score": 0.00445997627516653, "phrase": "important_decision_problems"}, {"score": 0.004370973501074594, "phrase": "satisfiability_modulo_theories"}, {"score": 0.004232232993872917, "phrase": "efficient_smt_solvers"}, {"score": 0.0041144374213500715, "phrase": "practical_interest"}, {"score": 0.004016072233242585, "phrase": "bit_vectors"}, {"score": 0.003780286517897356, "phrase": "optimization_problems"}, {"score": 0.003616189733352126, "phrase": "previous_work"}, {"score": 0.003473178781851477, "phrase": "cost_functions"}, {"score": 0.0034452601929727752, "phrase": "arithmetical_variables"}, {"score": 0.0029197572138773237, "phrase": "linear_rational_cost_functions"}, {"score": 0.002861402531078998, "phrase": "standard_minimization_techniques"}, {"score": 0.002395530243993313, "phrase": "linear_generalized_disjunctive_programming"}, {"score": 0.0021566565951738658, "phrase": "latter_tools"}], "paper_keywords": ["Theory", " Algorithms", " Performance", " Satisfiability modulo theories", " automated reasoning", " optimization"], "paper_abstract": "In the contexts of automated reasoning (AR) and formal verification (FV), important decision problems are effectively encoded into Satisfiability Modulo Theories (SMT). In the last decade, efficient SMT solvers have been developed for several theories of practical interest (e.g., linear arithmetic, arrays, and bit vectors). Surprisingly, little work has been done to extend SMT to deal with optimization problems; in particular, we are not aware of any previous work on SMT solvers able to produce solutions that minimize cost functions over arithmetical variables. This is unfortunate, since some problems of interest require this functionality. In the work described in this article we start filling this gap. We present and discuss two general procedures for leveraging SMT to handle the minimization of linear rational cost functions, combining SMT with standard minimization techniques. We have implemented the procedures within the MathSAT SMT solver. Due to the absence of competitors in the AR, FV, and SMT domains, we have experimentally evaluated our implementation against state-of-the-art tools for the domain of Linear Generalized Disjunctive Programming (LGDP), which is closest in spirit to our domain, on sets of problems that have been previously proposed as benchmarks for the latter tools. The results show that our tool is very competitive with, and often outperforms, these tools on these problems, clearly demonstrating the potential of the approach.", "paper_title": "Optimization Modulo Theories with Linear Rational Costs", "paper_id": "WOS:000353644400003"}