{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "grey_relational_analysis_technique"}, {"score": 0.03722739012087964, "phrase": "normal_objects"}, {"score": 0.03685259410949237, "phrase": "abnormal_objects"}, {"score": 0.03432887984079058, "phrase": "reference_point"}, {"score": 0.0047152877145889656, "phrase": "diagnosis_problems"}, {"score": 0.004451676867747938, "phrase": "different_fields"}, {"score": 0.0042692243768616455, "phrase": "sonic_limitations"}, {"score": 0.003946960862020283, "phrase": "practical_expert_diagnosis_model"}, {"score": 0.0032012284065895537, "phrase": "multi-dimension_space"}, {"score": 0.002897977113538355, "phrase": "mapped_abnormal_object"}, {"score": 0.0027936239349923464, "phrase": "threshold_value"}, {"score": 0.0026649432435828842, "phrase": "famous_iris_data"}, {"score": 0.00256895975568914, "phrase": "practical_case"}, {"score": 0.002412371116984224, "phrase": "proposed_model"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Diagnosis model", " Discriminate", " Grey relational analysis technique"], "paper_abstract": "Although the diagnosis problems have been widely discussed in various studies and comprehensively utilized in different fields, literatures show that there still are sonic limitations in practice. To extend the limitation of application, this study proposes a practical expert diagnosis model which mainly adopts the grey relational analysis technique, a data analytic method based oil the generalized distance function. to discriminate the normal objects and abnormal objects. The concept of how the normal objects will be always mapped around a reference point in the multi-dimension space is proposed and explained. Thus the abnormal objects can be identified by the judgement of their distances between the mapped abnormal object and the reference point being exceeded a threshold value. Two verification examples. one is the famous iris data set and the other a slope data set from practical case, are adopted to illustrate the feasibility and applicability of the proposed model in which not only the abnormal objects can be easily distinguished, but also the level of severity of abnormalities can be evaluated. (c) 2007 Elsevier Ltd. All rights reserved.", "paper_title": "Practical expert diagnosis model based on the grey relational analysis technique", "paper_id": "WOS:000262178000057"}