{"auto_keywords": [{"score": 0.04764437968835533, "phrase": "patient_care"}, {"score": 0.022507023294071823, "phrase": "primary_healthcare"}, {"score": 0.010612387000973441, "phrase": "medical_records"}, {"score": 0.00654384297961505, "phrase": "discharge_information"}, {"score": 0.00437302709192313, "phrase": "comprehensive_medical_record"}, {"score": 0.004251912075877877, "phrase": "high_quality_handovers"}, {"score": 0.004052007312730483, "phrase": "patient_handovers"}, {"score": 0.00401961206251868, "phrase": "primary_and_secondary_care"}, {"score": 0.0038152404172111815, "phrase": "care_settings"}, {"score": 0.0034926916198124484, "phrase": "chronic_diseases"}, {"score": 0.0033283624928018146, "phrase": "handover_records"}, {"score": 0.003034633345146293, "phrase": "patients'_medical_and_care_needs"}, {"score": 0.002880196765572443, "phrase": "primary_care_providers"}, {"score": 0.0028229071631385634, "phrase": "hospital_provider's_request"}, {"score": 0.002668470532683947, "phrase": "patient-centered_documentation"}, {"score": 0.0026364893960490396, "phrase": "poor_patient_centeredness"}, {"score": 0.0025840347813610815, "phrase": "low_priority"}, {"score": 0.0024623517958288228, "phrase": "small_study"}, {"score": 0.0022812715029149216, "phrase": "healthcare_providers"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ireland_ltd."}], "paper_keywords": ["Care transitions", " Continuity of care", " Medical record system", " Patient-centered care"], "paper_abstract": "Background: Handovers between hospital and primary healthcare possess a risk for patient care. It has been suggested that the exchange of a comprehensive medical record containing both medical and patient-centered aspects of information can support high quality handovers. Objective: The objective of this study was to explore patient handovers between primary and secondary care by assessing the levels of patient-centeredness of medical records used for communication between care settings and by assessing continuity of patient care. Methods: Quantitative content analysis was used to analyze the 76 medical records of 22 Swedish patients with chronic diseases and/or polypharmacy. Results: The levels of patient-centeredness documented in handover records were assessed as poor, especially in regards to informing patients and achieving a shared understanding/agreement about their treatment plans. The follow up of patients' medical and care needs were remotely related to the discharge information sent from the hospital to the primary care providers, or to the hospital provider's request for patient follow-up in primary healthcare. Conclusion: The lack of patient-centered documentation either indicates poor patient centeredness in the encounters or low priority given by the providers on documenting such information. Based on this small study, discharge information sent to primary healthcare cannot be considered as a means of securing continuity of patient care. Healthcare providers need to be aware that neither their discharge notes nor their referrals will guarantee continuity of patient care. (C) 2015 Elsevier Ireland Ltd. All rights reserved.", "paper_title": "Patient-centered handovers between hospital andprimary health care: An assessment of medical records", "paper_id": "WOS:000350968500008"}