{"auto_keywords": [{"score": 0.03614670161093819, "phrase": "key_performance_characteristic"}, {"score": 0.00481495049065317, "phrase": "key_performance_characteristics"}, {"score": 0.004764220976404241, "phrase": "scientific_and_engineering_applications"}, {"score": 0.004714023408114857, "phrase": "computational_science_and_engineering_application_programs"}, {"score": 0.004353948887538618, "phrase": "distribution_limitations"}, {"score": 0.004195418010131832, "phrase": "tractable_rapid_explorations"}, {"score": 0.004151188559520802, "phrase": "scientific_and_engineering_application_programs"}, {"score": 0.003597625122515975, "phrase": "full_scale_applications"}, {"score": 0.0032527939106509977, "phrase": "runtime_performance"}, {"score": 0.0032014433546265694, "phrase": "application_program"}, {"score": 0.0028944757265206332, "phrase": "these.performance_issues"}, {"score": 0.002391067964886602, "phrase": "initial_steps"}, {"score": 0.0021501863832966966, "phrase": "full_app"}], "paper_keywords": ["High performance computing", " Validation", " Scientific computing"], "paper_abstract": "Computational science and engineering application programs are typically large, complex, and dynamic, and are often constrained by distribution limitations. As a means of making tractable rapid explorations of scientific and engineering application programs in the context of new, emerging, and future computing architectures, a suite of \"miniapps\" has been created to serve as proxies for full scale applications. Each miniapp is designed to represent a key performance characteristic that does or is expected to significantly impact the runtime performance of an application program. In this paper we introduce a methodology for assessing the ability of these miniapps to effectively represent these.performance issues. We applied this methodology to three miniapps, examining the linkage between them and an application they are intended to represent. Herein we evaluate the fidelity of that linkage. This work represents the initial steps required to begin to answer the question, \"Under what conditions does a miniapp represent a key performance characteristic in a full app?\" (C) 2014 Elsevier Inc. All rights reserved.", "paper_title": "Assessing the role of mini-applications in predicting key performance characteristics of scientific and engineering applications", "paper_id": "WOS:000346552500010"}