{"auto_keywords": [{"score": 0.021559969068071682, "phrase": "pure_states"}, {"score": 0.009346215040359223, "phrase": "evolution_equation"}, {"score": 0.0072458624147549115, "phrase": "uniform_channel"}, {"score": 0.00481495049065317, "phrase": "two-qubit_system"}, {"score": 0.004776669953449352, "phrase": "local_depolarizing_channels"}, {"score": 0.004517055580214742, "phrase": "one-sided_channel"}, {"score": 0.004153739859461064, "phrase": "konrad_et_al"}, {"score": 0.004104309441696454, "phrase": "nat"}, {"score": 0.003714195746979591, "phrase": "ansatz_states"}, {"score": 0.0034702685641070283, "phrase": "two-sided_channel"}, {"score": 0.003334309053314909, "phrase": "fixed_concurrence"}, {"score": 0.0032036590920314725, "phrase": "minimal_negativity"}, {"score": 0.00288736193515505, "phrase": "maximal_concurrence"}, {"score": 0.002644179117033107, "phrase": "general_nonuniform_channels"}, {"score": 0.002382987346529592, "phrase": "numerical_calculations"}, {"score": 0.0022803854904010347, "phrase": "major_factors"}, {"score": 0.0021049977753042253, "phrase": "nonuniform_channels"}], "paper_keywords": ["Entanglement sudden death", " Evolution equation of entanglement", " Most robust state", " Most fragile state"], "paper_abstract": "For a two-qubit system under local depolarizing channels, the most robust and most fragile states are derived for a given concurrence or negativity. For the one-sided channel, the pure states are proved to be the most robust ones, with the aid of the evolution equation for entanglement given by Konrad et al. [Nat. Phys. 4, 99 (2008)]. Based on a generalization of the evolution equation for entanglement, we classify the ansatz states in our investigation by the amount of robustness, and consequently derive the most fragile states. For the two-sided channel, the pure states are the most robust for a fixed concurrence. Under the uniform channel, the most fragile states have the minimal negativity when the concurrence is given in the region [1/2, 1]. For a given negativity, the most robust states are the ones with the maximal concurrence, and the most fragile ones are the pure states with minimum of concurrence. When the entanglement approaches zero, the most fragile states under general nonuniform channels tend to the ones in the uniform channel. Influences on robustness by entanglement, degree of mixture, and asymmetry between the two qubits are discussed through numerical calculations. It turns out that the concurrence and negativity are major factors for the robustness. When they are fixed, the impact of the mixedness becomes obvious. In the nonuniform channels, the most fragile states are closely correlated with the asymmetry, while the most robust ones with the degree of mixture.", "paper_title": "MOST ROBUST AND FRAGILE TWO-QUBIT ENTANGLED STATES UNDER DEPOLARIZING CHANNELS", "paper_id": "WOS:000324004300006"}