{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "railway_interlocking_system"}, {"score": 0.03849807189804269, "phrase": "new_model"}, {"score": 0.004769037884875737, "phrase": "maple"}, {"score": 0.0047006879240764935, "phrase": "interlocking_systems"}, {"score": 0.004589124394375718, "phrase": "conflicting_movements"}, {"score": 0.003934970057482768, "phrase": "clear_signals"}, {"score": 0.0035914198812657897, "phrase": "boolean_logic"}, {"score": 0.0026395715432958665, "phrase": "main_procedure"}, {"score": 0.0025644240336018045, "phrase": "proposed_situation"}, {"score": 0.0022302306304023602, "phrase": "corresponding_maple_implementation"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Railway interlocking systems", " Logic", " Decision theory", " Graph theory"], "paper_abstract": "Railway interlocking systems are apparatuses that prevent conflicting movements of trains through an arrangement of tracks. A railway interlocking system takes into consideration the position of the switches (of the turnouts) and does not allow trains to he given clear signals unless the routes to be used by the trains do not intersect. A new model, based on Boolean Logic, and independent from the topology of the station is presented in this paper. According to this new model, any given proposed situation is safe if and only if a certain set of formulae (translating the position of trains and the movements allowed - the latter depend on the position of the switches and the colour of the semaphores) is consistent. The main procedure analyses the safety of a proposed situation and returns, if they exist, the sections where a collision could take place. The fact that trains could occupy more than one section is considered. The code of the corresponding Maple implementation is surprisingly brief. (C) 2010 IMACS. Published by Elsevier B.V. All rights reserved.", "paper_title": "A logic approach to decision taking in a railway interlocking system using Maple", "paper_id": "WOS:000297091800003"}