{"auto_keywords": [{"score": 0.043022517605113594, "phrase": "kc"}, {"score": 0.015719659355464943, "phrase": "human_being"}, {"score": 0.004458722048888919, "phrase": "knowledge_creation"}, {"score": 0.004069631519385246, "phrase": "hermeneutic_phenomenology"}, {"score": 0.0038973170902076707, "phrase": "recent_kc_research_and_key_texts"}, {"score": 0.003714368305523811, "phrase": "recent_kc_research"}, {"score": 0.0035060903664150115, "phrase": "human_mind"}, {"score": 0.0033575566897536906, "phrase": "interpersonal_relationships"}, {"score": 0.003325410433297401, "phrase": "working_communities"}, {"score": 0.0030642636185693054, "phrase": "successful_interaction"}, {"score": 0.0027697290872182477, "phrase": "general_ideas"}, {"score": 0.002730023736069673, "phrase": "hermeneutic_tradition"}, {"score": 0.0026523079380037706, "phrase": "historical_roots"}, {"score": 0.00242047093248845, "phrase": "hermeneutic_circle"}, {"score": 0.0023972750359328235, "phrase": "phenomenological_conceptualization"}, {"score": 0.0023178219772486868, "phrase": "better_defined_and_more_coherent_structure"}], "paper_keywords": [""], "paper_abstract": "This study explores the effect of interaction in research on knowledge creation (KC) and its dependence on the conceptualization of a human being. A framework for understanding KC with hermeneutic phenomenology is developed, based on an analysis of recent KC research and key texts on hermeneutic phenomenology. The results obtained indicate that recent KC research still emphasizes the concept of knowledge as an asset inside the human mind, although the interest is in knowing and interpersonal relationships in working communities. Exploration of the use of the effect of interaction in research on KC shows that successful interaction is connected to the ideas of openness, critical thinking, and awareness of past experiences. These elements reflect the general ideas of the hermeneutic tradition without taking into account the historical roots of hermeneutics or questioning the concept of a human being behind them. It is concluded that the hermeneutic circle and phenomenological conceptualization of a human being provide a better defined and more coherent structure for understanding the event of KC as a future-oriented, conscious act of interaction. The framework developed offers three fundamental areas for exploration: structure of the interactive event, construction of the human experience in interaction, and modes of being in interaction.", "paper_title": "Knowledge Creation and the Concept of a Human Being: A Phenomenological Approach", "paper_id": "WOS:000335583800013"}