{"auto_keywords": [{"score": 0.03340305748453232, "phrase": "new_index"}, {"score": 0.00481495049065317, "phrase": "hirsch_core"}, {"score": 0.004768649568826951, "phrase": "bibliometric_studies"}, {"score": 0.004700027722284931, "phrase": "micro_level"}, {"score": 0.004587835274176236, "phrase": "science_managers"}, {"score": 0.004543708337879809, "phrase": "policy_makers"}, {"score": 0.004478308876320956, "phrase": "research_decisions"}, {"score": 0.004435230698216773, "phrase": "different_measures"}, {"score": 0.003070996252787868, "phrase": "researcher's_productive_core"}, {"score": 0.002469830206270585, "phrase": "geometric_mean"}, {"score": 0.0024107449502335583, "phrase": "median_number"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["h-Index", " m-Index", " Bibliometric measures", " Aggregation", " Geometric mean"], "paper_abstract": "Bibliometric studies at the micro level are increasingly requested by science managers and policy makers to support research decisions. Different measures and indices have been developed at this level of analysis. One type of indices, such as the h-index and g-index, describe the most productive core of the output of a researcher and inform about the number of papers in the core. Other indices, such as the a-index and m-index, depict the impact of the papers in the core. In this paper, we present a new index which relates two different dimensions in a researcher's productive core: a quantitative one (number of papers) and a qualitative one (impact of papers). In such a way, we could obtain a more balanced and global view of the scientific production of researchers. This new index, called q(2)-index, is based on the geometric mean of h-index and the median number of citations received by papers in the h-core, i.e., the m-index, which allows us to combine the advantages of both kind of indices. (C) 2009 Elsevier Ltd. All rights reserved.", "paper_title": "q(2)-Index: Quantitative and qualitative evaluation based on the number and impact of papers in the Hirsch core", "paper_id": "WOS:000272631100003"}