{"auto_keywords": [{"score": 0.03873720071314454, "phrase": "relaxed_search"}, {"score": 0.008085493670801058, "phrase": "optimal_cost_function"}, {"score": 0.006361824395497223, "phrase": "relaxed_search_method"}, {"score": 0.00481495049065317, "phrase": "relaxed_search_-_an_analysis"}, {"score": 0.004426431307429982, "phrase": "regression_search_space"}, {"score": 0.004373537527118041, "phrase": "parameter_m"}, {"score": 0.004269630481719451, "phrase": "computational_cost"}, {"score": 0.003996389000267842, "phrase": "small_values"}, {"score": 0.003958176650420278, "phrase": "small_states"}, {"score": 0.003740568332108757, "phrase": "search_space"}, {"score": 0.003543445557071389, "phrase": "relaxed_space"}, {"score": 0.0033365390352128065, "phrase": "higher_values"}, {"score": 0.0032085525502105836, "phrase": "partial_hm_heuristics"}, {"score": 0.002262802370005939, "phrase": "original_and_relaxed_search_spaces"}, {"score": 0.0021433882705962034, "phrase": "large_states"}, {"score": 0.0021049977753042253, "phrase": "small_successor_states"}], "paper_keywords": [""], "paper_abstract": "The h(m) admissible heuristics for (sequential and temporal) regression planning are defined by a parameterized relaxation of the optimal cost function in the regression search space, where the parameter m offers a trade-off between the accuracy and computational cost of the heuristic. Existing methods for computing the h(m) heuristic require time exponential in m, limiting them to small values (m <= 2). The h(m) heuristic can also be viewed as the optimal cost function in a relaxation of the search space: this paper presents relaxed search, a method for computing this function partially by searching in the relaxed space. The relaxed search method, because it compute h(m) only partially, is computationally cheaper and therefore usable for higher values of m. The (complete) h(2) heuristic is combined with partial hm heuristics , for m = 3, ... computed by relaxed search, resulting in a more accurate heuristic. This use of the relaxed search method to improve on the h(2) heuristic is evaluated by comparing two optimal temporal planners: TP4, which does not use it, and HSP*(a), which uses it but is otherwise identical to TP4. The comparison is made on the domains used in the 2004 International Planning Competition, in which both planners participated. Relaxed search is found to be cost effective in some of these domains, but not all. Analysis reveals a characterization of the domains in which relaxed search can be expected to be cost effective, in terms of two measures on the original and relaxed search spaces. In the domains where relaxed search is cost effective, expanding small states is computationally cheaper than expanding large states and small states tend to have small successor states.", "paper_title": "Improving heuristics through relaxed search - An analysis of TP4 and HSPa* in the 2004 planning competition", "paper_id": "WOS:000235528800002"}