{"auto_keywords": [{"score": 0.04556815853514561, "phrase": "compromised_nodes"}, {"score": 0.00481495049065317, "phrase": "compromised_sensor_nodes"}, {"score": 0.0047559432344272, "phrase": "wireless_sensor_networks"}, {"score": 0.00466877910546307, "phrase": "promising_computing_model"}, {"score": 0.004513087388483271, "phrase": "varying_forms"}, {"score": 0.004256243266481051, "phrase": "legitimate_reports"}, {"score": 0.004217041305117441, "phrase": "false_reports"}, {"score": 0.004076352180903171, "phrase": "right_decision"}, {"score": 0.004026359831748917, "phrase": "precious_energy"}, {"score": 0.004001593118269276, "phrase": "relay_nodes"}, {"score": 0.003940338160665297, "phrase": "current_designs"}, {"score": 0.0039040344230094164, "phrase": "en-network_detection_approach"}, {"score": 0.0037045182324752404, "phrase": "en-route_relay_nodes"}, {"score": 0.003569831390151506, "phrase": "collaborative_attacks"}, {"score": 0.003397842468812072, "phrase": "cool"}, {"score": 0.0031260524791486347, "phrase": "well-behaved_sensor_node"}, {"score": 0.003078158564144202, "phrase": "outgoing_messages"}, {"score": 0.002893788139084487, "phrase": "message_sets"}, {"score": 0.0028759679188458532, "phrase": "different_nodes"}, {"score": 0.0027457584014804574, "phrase": "proven_collision-resilient_hashing_scheme"}, {"score": 0.0025732834751685803, "phrase": "trusted_comparisons"}, {"score": 0.0025027144548626975, "phrase": "hash_values"}, {"score": 0.0023967582707115354, "phrase": "existing_en-route_false_report"}, {"score": 0.0023527296826339225, "phrase": "early_false_report"}, {"score": 0.00224615642504509, "phrase": "cool_protocol"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Sensor network", " Security", " Authentication", " Incremental hashing", " Selective report forwarding", " False report injection"], "paper_abstract": "Wireless sensor networks have recently emerged as a promising computing model for many civilian and military applications. Sensor nodes in such a network are subject to varying forms of attacks since they are left unattended after deployment. Compromised nodes can, for example, tamper with legitimate reports or inject false reports in order to either distract the user from reaching the right decision or deplete the precious energy of relay nodes. Most of the current designs take the en-network detection approach: misbehaved nodes are detected by their neighboring watchdog nodes: false reports are detected and dropped by trusted en-route relay nodes, etc. However en-network designs are insufficient to defend collaborative attacks when many compromised nodes collude with each other in the network. In this paper we propose COOL, a COmpromised nOde Locator for detecting and locating compromised nodes once they misbehave in the network. It is based on the observation that for a well-behaved sensor node, the set of outgoing messages should be equal to the set of incoming and locally generated or dropped messages. However, comparing the message sets for different nodes is not enough to identify attacks as their sanity is unknown. We exploit a proven collision-resilient hashing scheme, termed incremental hashing, to sign the incoming, outgoing and locally generated/dropped message sets. The hash Values are then sent to the sink for trusted comparisons. We discuss how to securely collect these hash values and then confidently locate compromised nodes. The scheme can also be combined with existing en-route false report filtering schemes to achieve both early false report dropping and accurate compromised nodes isolation. Through identifying and excluding compromised nodes, the COOL protocol prevents further damages from these nodes and forms a reliable and energy-conserving sensor network. (C) 2009 Elsevier Ltd. All rights reserved.", "paper_title": "An authentication scheme for locating compromised sensor nodes in WSNs", "paper_id": "WOS:000271532500007"}