{"auto_keywords": [{"score": 0.04440305142854002, "phrase": "bca"}, {"score": 0.019922770167384, "phrase": "saa"}, {"score": 0.019333810174778615, "phrase": "ysa"}, {"score": 0.010295807799254557, "phrase": "distributed_agent_system"}, {"score": 0.010026488851630284, "phrase": "proposed_system"}, {"score": 0.00481495049065317, "phrase": "port_planning"}, {"score": 0.00463507149599759, "phrase": "dynamic_port_planning"}, {"score": 0.0037446140218109895, "phrase": "berth_allocation"}, {"score": 0.0036183781935237446, "phrase": "ppm"}, {"score": 0.0035096666710980108, "phrase": "communication_locale"}, {"score": 0.003276893480994257, "phrase": "container_yard"}, {"score": 0.003094716540812336, "phrase": "ga-enhanced_dynamic_scheduler"}, {"score": 0.0030017207229983385, "phrase": "berth_allocation_schedule"}, {"score": 0.00293380698353469, "phrase": "ship_arrival_information"}, {"score": 0.0028893854782000693, "phrase": "ppm."}, {"score": 0.002499438189264537, "phrase": "yard_storage_allocation_schedule"}, {"score": 0.0023966900120342364, "phrase": "case_study"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Software agents", " Port planning", " Port scheduling", " Berth allocation", " Shuttle allocation", " Yard storage allocation"], "paper_abstract": "This paper describes a distributed agent system for dynamic port planning and scheduling. The proposed system comprises four agents, namely a port planning manager (PPM), a berth control agent (BCA), a shuttle allocation agent (SAA) and a yard storage agent (YSA). These agents communicate and cooperate with one another to work out the schedule for berth allocation and requirements for shuttles. Basically, the PPM maintains all the necessary information and provides a negotiation and communication locale for the BCA, SAA and YSA, which represent the berths, the shuttles and the container yard, respectively, to resolve their conflicts under its supervision. With the help of a GA-enhanced dynamic scheduler, the BCA attempts to optimise the berth allocation schedule using the data such as ship arrival information retrieved from the PPM. As soon as the SAA receives the schedule from the BCA, it proceeds to check for the availability of shuttles and work out the requirement for shuttles. On the other hand, the YSA generates the yard storage allocation schedule and the truck/train schedule for the transportation of containers. A case study is conducted to illustrate the capability of the distributed agent system. It has been shown that the proposed system is able to successfully generate the schedules for both the BCA and the SAA. (C) 2010 Elsevier Ltd. All rights reserved.", "paper_title": "A distributed agent system for port planning and scheduling", "paper_id": "WOS:000293678200002"}