{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "steady-state_probability_distribution"}, {"score": 0.012889262822425786, "phrase": "transition_probability_matrix"}, {"score": 0.00991603635101578, "phrase": "approximation_method"}, {"score": 0.006347162751714628, "phrase": "genetic_network"}, {"score": 0.004744931371058616, "phrase": "boolean"}, {"score": 0.004630270043271386, "phrase": "probabilistic_boolean"}, {"score": 0.004409304640026443, "phrase": "genetic_regulatory_interactions"}, {"score": 0.004240116703465252, "phrase": "important_information"}, {"score": 0.004178351419209898, "phrase": "captured_genetic_network"}, {"score": 0.0034187896011435245, "phrase": "computational_costs"}, {"score": 0.003192312493850036, "phrase": "fast_approximation_method"}, {"score": 0.002852256089630964, "phrase": "boolean_networks"}, {"score": 0.002663208600887875, "phrase": "error_analysis"}, {"score": 0.002573424607574822, "phrase": "theoretical_result"}, {"score": 0.0022434880661725493, "phrase": "numerical_experiments"}, {"score": 0.0021049977753042253, "phrase": "proposed_method"}], "paper_keywords": [""], "paper_abstract": "Motivation: Probabilistic Boolean networks (PBNs) have been proposed to model genetic regulatory interactions. The steady-state probability distribution of a PBN gives important information about the captured genetic network. The computation of the steady-state probability distribution usually includes construction of the transition probability matrix and computation of the steady-state probability distribution. The size of the transition probability matrix is 2(n)-by-2(n) where n is the number of genes in the genetic network. Therefore, the computational costs of these two steps are very expensive and it is essential to develop a fast approximation method. Results: In this article, we propose an approximation method for computing the steady-state probability distribution of a PBN based on neglecting some Boolean networks (BNs) with very small probabilities during the construction of the transition probability matrix. An error analysis of this approximation method is given and theoretical result on the distribution of BNs in a PBN with at most two Boolean functions for one gene is also presented. These give a foundation and support for the approximation method. Numerical experiments based on a genetic network are given to demonstrate the efficiency of the proposed method.", "paper_title": "An approximation method for solving the steady-state probability distribution of probabilistic Boolean networks", "paper_id": "WOS:000248271700010"}