{"auto_keywords": [{"score": 0.03881915877269684, "phrase": "yao"}, {"score": 0.005022186650069913, "phrase": "vickrey"}, {"score": 0.00481495049065317, "phrase": "online_sensitive_data"}, {"score": 0.004289215825521407, "phrase": "sensitive_data"}, {"score": 0.004260134699483774, "phrase": "realistic_networked_environments"}, {"score": 0.0042025601346464365, "phrase": "communication-complexity-based_definitions"}, {"score": 0.004117647922204903, "phrase": "average_case"}, {"score": 0.0040619911719900976, "phrase": "problem's_privacy-approximation_ratio"}, {"score": 0.003899476621346112, "phrase": "approximate_privacy"}, {"score": 0.003278024877215369, "phrase": "perfect_privacy"}, {"score": 0.002850819170139645, "phrase": "simple_and_natural_communication_protocols"}, {"score": 0.002831462722290752, "phrase": "privacy-approximation_ratios"}, {"score": 0.002690406375639144, "phrase": "input_space"}, {"score": 0.002556359086441866, "phrase": "auction_protocols"}, {"score": 0.0025046245057922557, "phrase": "privacy-approximation_ratio"}, {"score": 0.0024289743270061157, "phrase": "intersection_problems"}, {"score": 0.0021484955960643167, "phrase": "relative_effects"}, {"score": 0.0021049977753042253, "phrase": "different_players"}], "paper_keywords": ["Approximate privacy", " bisection auction"], "paper_abstract": "The proliferation of online sensitive data about individuals and organizations makes concern about the privacy of these data a top priority. There have been many formulations of privacy and, unfortunately, many negative results about the feasibility of maintaining privacy of sensitive data in realistic networked environments. We formulate communication-complexity-based definitions, both worst case and average case, of a problem's privacy-approximation ratio. We use our definitions to investigate the extent to which approximate privacy is achievable in a number of standard-problems: the 2nd-price Vickrey auction, Yao's millionaires problem, the public-good problem, and the set-theoretic disjointness and intersection problems. For both the 2nd-price Vickrey auction and the millionaires problem, we show that not only is perfect privacy impossible or infeasibly costly to achieve, but even close approximations of perfect privacy suffer from the same lower bounds. By contrast, if the inputs are drawn uniformly at random from (0,..., 2(k) - 1), then, for both problems, simple and natural communication protocols have privacy-approximation ratios that are linear in k (i.e., logarithmic in the size of the input space). We also demonstrate tradeoffs between privacy and communication in a family of auction protocols. We show that the privacy-approximation ratio provided by any protocol for the disjointness and intersection problems is necessarily exponential (in k). We also use these ratios to argue that one protocol for each of these problems is significantly fairer than the others we consider (in the sense of relative effects on the privacy of the different players).", "paper_title": "Approximate Privacy: Foundations and Quantification", "paper_id": "WOS:000339708400002"}