{"auto_keywords": [{"score": 0.04840115289905245, "phrase": "gene_selection"}, {"score": 0.00481495049065317, "phrase": "microarray_samples"}, {"score": 0.004591345494188032, "phrase": "microarray_data"}, {"score": 0.004174677062711731, "phrase": "statistical_significance"}, {"score": 0.003619235073669304, "phrase": "machine_learning_methods"}, {"score": 0.003576416581189716, "phrase": "existing_works"}, {"score": 0.0032709661258673232, "phrase": "hypothesis_testing"}, {"score": 0.0030819219279832224, "phrase": "proposed_r-test_methods"}, {"score": 0.0029737652463012318, "phrase": "position_p-values"}, {"score": 0.002639845784408318, "phrase": "support_vector_machines"}, {"score": 0.0022077827041801193, "phrase": "selection_results"}, {"score": 0.002181626277903721, "phrase": "sophisticated_multivariate_methods"}, {"score": 0.0021049977753042253, "phrase": "simple_hypothesis_testing_methods"}], "paper_keywords": ["significance of gene ranking", " gene selection", " classification", " microarray data analysis"], "paper_abstract": "Many methods for classification and gene selection with microarray data have been developed. These methods usually give a ranking of genes. Evaluating the statistical significance of the gene ranking is important for understanding the results and for further biological investigations, but this question has not been well addressed for machine learning methods in existing works. Here, we address this problem by formulating it in the framework of hypothesis testing and propose a solution based on resampling. The proposed r-test methods convert gene ranking results into position p-values to evaluate the significance of genes. The methods are tested on three real microarray data sets and three simulation data sets with support vector machines as the method of classification and gene selection. The obtained position p-values help to determine the number of genes to be selected and enable scientists to analyze selection results by sophisticated multivariate methods under the same statistical inference paradigm as for simple hypothesis testing methods.", "paper_title": "Significance of gene ranking for classification of microarray samples", "paper_id": "WOS:000239378400011"}