{"auto_keywords": [{"score": 0.0321891176470026, "phrase": "team"}, {"score": 0.015718951210716228, "phrase": "vehicular_ad_hoc_networks"}, {"score": 0.011476214850464872, "phrase": "authentication_procedure"}, {"score": 0.004509694461067052, "phrase": "significant_amount"}, {"score": 0.0043533862892678864, "phrase": "wireless_mobile_networking"}, {"score": 0.004223708778943785, "phrase": "malicious_attacks"}, {"score": 0.004118587636081584, "phrase": "secure_authentication_schemes"}, {"score": 0.004056769841308405, "phrase": "asymmetric_cryptography"}, {"score": 0.0037423521744765075, "phrase": "highly_dynamic_environments"}, {"score": 0.003686177286460416, "phrase": "vanets"}, {"score": 0.0033492947290751996, "phrase": "efficient_authentication_scheme"}, {"score": 0.0031684791285366315, "phrase": "decentralized_lightweight_authentication_scheme"}, {"score": 0.0029973957125353306, "phrase": "vehicle-to-vehicle_communication_networks"}, {"score": 0.0028933521924166287, "phrase": "transitive_trust_relationships"}, {"score": 0.0021049977753042253, "phrase": "-middle_attack_resistance"}], "paper_keywords": ["Authentication", " decentralized", " lightweight", " trust-extended", " vehicular ad hoc networks (VANETs)"], "paper_abstract": "The security of vehicular ad hoc networks (VANETs) has been receiving a significant amount of attention in the field of wireless mobile networking because VANETs are vulnerable to malicious attacks. A number of secure authentication schemes based on asymmetric cryptography have been proposed to prevent such attacks. However, these schemes are not suitable for highly dynamic environments such as VANETs, because they cannot efficiently cope with the authentication procedure. Hence, this still calls for an efficient authentication scheme for VANETs. In this paper, we propose a decentralized lightweight authentication scheme called trust-extended authentication mechanism (TEAM) for vehicle-to-vehicle communication networks. TEAM adopts the concept of transitive trust relationships to improve the performance of the authentication procedure and only needs a few storage spaces. Moreover, TEAM satisfies the following security requirements: anonymity, location privacy, mutual authentication, forgery attack resistance, modification attack resistance, replay attack resistance, no clock synchronization problem, no verification table, fast error detection, perfect forward secrecy, man-in-the-middle attack resistance, and session key agreement.", "paper_title": "TEAM: Trust-Extended Authentication Mechanism for Vehicular Ad Hoc Networks", "paper_id": "WOS:000341567800008"}