{"auto_keywords": [{"score": 0.04455442320959089, "phrase": "erp_system"}, {"score": 0.0075912740207151105, "phrase": "fuzzy_linguistic_results"}, {"score": 0.0074994077858681904, "phrase": "erp_examination"}, {"score": 0.00481495049065317, "phrase": "performance_evaluation"}, {"score": 0.004775918707955445, "phrase": "erp_systems"}, {"score": 0.004737201825299411, "phrase": "fuzzy_mathematics"}, {"score": 0.004384623928442369, "phrase": "stochastic-flow_network_model"}, {"score": 0.0038645966233348933, "phrase": "business_tasks"}, {"score": 0.003695237613399466, "phrase": "process_precedence_relationships"}, {"score": 0.0031012349116334606, "phrase": "document_flow"}, {"score": 0.00278930116312699, "phrase": "acceptable_level_d."}, {"score": 0.002623783458189614, "phrase": "fuzzy_linguistic_performance_index"}, {"score": 0.0025499307228648883, "phrase": "maximal_flow"}, {"score": 0.0023310544011985253, "phrase": "performance_index"}, {"score": 0.00224701149477484, "phrase": "system_performance"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Enterprise resource planning", " Stochastic-flow network", " Fuzzy mathematics", " System reliability", " Minimal path"], "paper_abstract": "An enterprise resource planning (ERP) system is a complex network composed of various business processes. This paper proposes a method based on stochastic-flow network model to evaluate the performance of an ERP system depending upon the fuzzy linguistic results of the ERP examination of the users involved. The nodes in the network denote the persons responsible for the business tasks during the processes. The arcs between nodes denote the process precedence relationships in the ERP system. When the process starts, the documents are initiated from the source node to its succeeding nodes. Finally, the documents are released in the destination node. Thus, the performance of an ERP system is related to the document flow under the network. The failure of an ERP system is therefore described as in the condition that the flow of the system is under the acceptable level d. By using the fuzzy linguistic results of the ERP examination of the users, we propose a fuzzy linguistic performance index, defuzzified from the probability of maximal flow not less than d, to evaluate the performance of an ERP system. An algorithm is subsequently proposed to generate the performance index, which can be used to assess the system performance either before or after the system going live. (C) 2008 Published by Elsevier Ltd.", "paper_title": "On performance evaluation of ERP systems with fuzzy mathematics", "paper_id": "WOS:000263817100075"}