{"auto_keywords": [{"score": 0.0046937237797352515, "phrase": "computer-assisted_class_laboratory"}, {"score": 0.004260134699483774, "phrase": "advanced_level"}, {"score": 0.004216880725292, "phrase": "remedial_level"}, {"score": 0.003636692152882991, "phrase": "pedagogic_objectives"}, {"score": 0.003509006038574667, "phrase": "real_world-inspired_problems"}, {"score": 0.00342054627009158, "phrase": "mobinet"}, {"score": 0.0033173234105492895, "phrase": "programmable_mobiles"}, {"score": 0.003088384809415812, "phrase": "pre-programmed_interactive_simulations"}, {"score": 0.0028459677232555176, "phrase": "autonomous_way"}, {"score": 0.0028026735035370206, "phrase": "class_laboratory"}, {"score": 0.0026630475331025955, "phrase": "ordinary_math_lab"}, {"score": 0.0023079225317714815, "phrase": "network_ability"}], "paper_keywords": [""], "paper_abstract": "This paper presents our design and experiment of a computer-assisted class laboratory on vectors in high-school. Our main goal is to improve the acquisition of notions by all pupils, from advanced level to remedial level. Our secondary goal is to improve the motivation of pupils toward maths and sciences. Our approach consists in making the pupils practice the notions included in a given set of pedagogic objectives, and to do it through real world-inspired problems. We draw on MobiNet, a platform that simulate programmable mobiles on screen and through the network. Our class laboratory consists of a set of pre-programmed interactive simulations, allowing the pupils to react on their errors and to validate each exercise in an autonomous way. This class laboratory was conducted in the same conditions and constraints than an ordinary math lab: same duration, and no preparation of the pupils (but the ordinary math course). Still, the autonomy of the exercises and the network ability would also allow the use with no teacher on place. In this paper, we describe our vector class laboratory experiment: objectives, design, conduction, and evaluation(1).", "paper_title": "Computer-assisted teaching in class situation: A high-school math lab on vectors", "paper_id": "WOS:000238089300033"}