{"auto_keywords": [{"score": 0.00471003041684707, "phrase": "recent_debate"}, {"score": 0.004344424495876066, "phrase": "field-normalized_citation_rates"}, {"score": 0.0042031320273645065, "phrase": "different_results"}, {"score": 0.0039341294012600085, "phrase": "individual_researchers"}, {"score": 0.003261547125192671, "phrase": "strong_relationship"}, {"score": 0.003132236287543072, "phrase": "pairwise_comparison"}, {"score": 0.003109283143263682, "phrase": "aor"}, {"score": 0.003086502730994631, "phrase": "roa"}, {"score": 0.0024389277933858054, "phrase": "low_roa_scores"}, {"score": 0.0023768935613578007, "phrase": "roa_relative_impact_indicators"}, {"score": 0.002216336059488137, "phrase": "reference_dataset"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Citations", " Research evaluation", " Normalization"], "paper_abstract": "In the recent debate on the use of averages of ratios (AoR) and ratios of averages (RoA) for the compilation of field-normalized citation rates, little evidence has been provided on the different results obtained by the two methods at various levels of aggregation. This paper provides such an empirical analysis at the level of individual researchers, departments, institutions and countries. Two datasets are used: 147,547 papers published between 2000 and 2008 and assigned to 14,379 Canadian university professors affiliated to 508 departments, and all papers indexed in the Web of Science for the same period (N = 8,221,926) assigned to all countries and institutions. Although there is a strong relationship between the two measures at each of these levels, a pairwise comparison of AoR and RoA shows that the differences between all the distributions are statistically significant and, thus, that the two methods are not equivalent and do not give the same results. Moreover, the difference between both measures is strongly influenced by the number of papers published as well as by their impact scores: the difference between AoR and RoA is greater for departments, institutions and countries with low RoA scores. Finally, our results show that RoA relative impact indicators do not add up to unity (as they should by definition) at the level of the reference dataset, whereas the AoR does have that property. (C) 2011 Elsevier Ltd. All rights reserved.", "paper_title": "Averages of ratios vs. ratios of averages: An empirical analysis of four levels of aggregation", "paper_id": "WOS:000291032500007"}