{"auto_keywords": [{"score": 0.03337015757271618, "phrase": "firewall_query"}, {"score": 0.01270681057829799, "phrase": "private_network"}, {"score": 0.009612105607093973, "phrase": "firewall_queries"}, {"score": 0.007718080513231989, "phrase": "firewall_query_results"}, {"score": 0.00481495049065317, "phrase": "firewall_policy_queries"}, {"score": 0.004762202897268383, "phrase": "crucial_elements"}, {"score": 0.004736045157669388, "phrase": "network_security"}, {"score": 0.0045694710501318235, "phrase": "private_networks"}, {"score": 0.00443308765153716, "phrase": "incoming_and_outgoing_packet"}, {"score": 0.004160879027087841, "phrase": "firewall_policies"}, {"score": 0.004047781270412204, "phrase": "policy_errors"}, {"score": 0.004014452814186653, "phrase": "firewall_policy_error"}, {"score": 0.0039813976794342, "phrase": "security_holes"}, {"score": 0.003937745492689668, "phrase": "malicious_traffic"}, {"score": 0.0038518661517315533, "phrase": "legitimate_traffic"}, {"score": 0.003820144626025562, "phrase": "normal_business_processes"}, {"score": 0.0035953368057880593, "phrase": "large_number"}, {"score": 0.0033465923623290034, "phrase": "effective_way"}, {"score": 0.0033190180867511605, "phrase": "firewall_administrators"}, {"score": 0.0030554300179552415, "phrase": "known_malicious_host"}, {"score": 0.0027437235598539904, "phrase": "simple_and_effective_sql-like_query_language"}, {"score": 0.002497976173193543, "phrase": "firewall_query_processing_algorithms"}, {"score": 0.0024501740852758505, "phrase": "efficient_firewall_query_processing_algorithm"}, {"score": 0.0024232694434408093, "phrase": "decision_diagrams"}], "paper_keywords": ["Network security", " firewall queries", " firewall testing", " firewall correctness"], "paper_abstract": "Firewalls are crucial elements in network security, and have been widely deployed in most businesses and institutions for securing private networks. The function of a firewall is to examine each incoming and outgoing packet and decide whether to accept or to discard the packet based on its policy. Due to the lack of tools for analyzing firewall policies, most firewalls on the Internet have been plagued with policy errors. A firewall policy error either creates security holes that will allow malicious traffic to sneak into a private network or blocks legitimate traffic and disrupts normal business processes, which in turn could lead to irreparable, if not tragic, consequences. Because a firewall may have a large number of rules and the rules often conflict, understanding and analyzing the function of a firewall has been known to be notoriously difficult. An effective way to assist firewall administrators to understand and analyze the function of their firewalls is by issuing queries. An example of a firewall query is \"Which computers in the private network can receive packets from a known malicious host in the outside Internet?\" Two problems need to be solved in order to make firewall queries practically useful: how to describe a firewall query and how to process a firewall query. In this paper, we first introduce a simple and effective SQL-like query language, called the Structured Firewall Query Language (SFQL), for describing firewall queries. Second, we give a theorem, called the Firewall Query Theorem, as the foundation for developing firewall query processing algorithms. Third, we present an efficient firewall query processing algorithm, which uses decision diagrams as its core data structure. Fourth, we propose methods for optimizing firewall query results. Finally, we present methods for performing the union, intersect, and minus operations on firewall query results. Our experimental results show that our firewall query processing algorithm is very efficient: it takes less than 10 milliseconds to process a query over a firewall that has up to 10,000 rules.", "paper_title": "Firewall Policy Queries", "paper_id": "WOS:000265412500002"}