{"auto_keywords": [{"score": 0.04667305691029921, "phrase": "sandpile_mutation"}, {"score": 0.041652837252711225, "phrase": "mutation_rates"}, {"score": 0.00481495049065317, "phrase": "genetic_algorithm"}, {"score": 0.004723322467153553, "phrase": "working_mechanisms"}, {"score": 0.0046781613377273774, "phrase": "diversity-oriented_and_self-organized_mutation_operator"}, {"score": 0.004359853990466236, "phrase": "binary_genetic_algorithms"}, {"score": 0.004332265147512113, "phrase": "ga"}, {"score": 0.004249886211289802, "phrase": "soc"}, {"score": 0.004089239912167375, "phrase": "soc_system"}, {"score": 0.0038600230206554792, "phrase": "parameter_control"}, {"score": 0.003810850017764603, "phrase": "low_values"}, {"score": 0.0036203204049740575, "phrase": "efficient_and_yet_simple_and_context-independent_approach"}, {"score": 0.0035627492415494216, "phrase": "non-stationary_fitness_functions"}, {"score": 0.003494866798828308, "phrase": "mutation_scheme"}, {"score": 0.0034172979799535386, "phrase": "new_strategy"}, {"score": 0.003256808693019209, "phrase": "fitness_distribution"}, {"score": 0.003154012038613403, "phrase": "extensive_experimental_setup"}, {"score": 0.002967526288858809, "phrase": "hypermutation_ga"}, {"score": 0.0029391032882625473, "phrase": "classical_approach"}, {"score": 0.0029203055813347874, "phrase": "dynamic_problems"}, {"score": 0.002738797804069541, "phrase": "proposed_method"}, {"score": 0.0026693851900137953, "phrase": "traditional_gas"}, {"score": 0.002118558580538763, "phrase": "alternative_topology"}, {"score": 0.0021049977753042253, "phrase": "minor_effects"}], "paper_keywords": ["Genetic Algorithms", " Non-stationary functions", " Self-Organized Criticality", " Parameter control"], "paper_abstract": "This paper reports the investigation on the sandpile mutation, an unconventional mutation control scheme for binary Genetic Algorithms (GA) inspired by the Self-Organized Criticality (SOC) theory. The operator, which is based on a SOC system known as sandpile, is able to generate mutation rates that, unlike those given by other methods of parameter control, oscillate between low values and very intense mutations events. The distribution of the mutation rates suggests that the algorithm can be an efficient and yet simple and context-independent approach for the optimization of non-stationary fitness functions. This paper studies the mutation scheme of the algorithm and proposes a new strategy that optimizes is performance. The results also demonstrate the advantages of using the fitness distribution of the population for controlling the mutation. An extensive experimental setup compares the sandpile mutation GA (GGA(SM)) with two state-of-the-art evolutionary approaches to non-stationary optimization and with the Hypermutation GA, a classical approach to dynamic problems. The results demonstrate that GGA(SM) is able to improve the other algorithms in several dynamic environments. Furthermore, the proposed method does not increase the parameter set of traditional GAs. A study of the distribution of the mutation rates shows that the distribution depends on the type of problem and dynamics, meaning that the algorithm is able to self-regulate the mutation. The effects of the operator on the diversity of the population during the run are also investigated. Finally, a study on the effects of the topology of the sandpile mutation on its performance demonstrates that an alternative topology has minor effects on the performance.", "paper_title": "The sandpile mutation Genetic Algorithm: an investigation on the working mechanisms of a diversity-oriented and self-organized mutation operator for non-stationary functions", "paper_id": "WOS:000323278500005"}