{"auto_keywords": [{"score": 0.04860000689752459, "phrase": "online_auctions"}, {"score": 0.01395537659444825, "phrase": "reputation_systems"}, {"score": 0.00481495049065317, "phrase": "online_auction_social_networks"}, {"score": 0.004498490110526062, "phrase": "leading_branches"}, {"score": 0.00386519448487341, "phrase": "malevolent_contractors"}, {"score": 0.0037066895459425824, "phrase": "new_method"}, {"score": 0.0032012284065895537, "phrase": "positive_and_negative_reputation"}, {"score": 0.0029905104479072482, "phrase": "social_linkage"}, {"score": 0.0028527866590859967, "phrase": "explicit_and_implicit_feedbacks"}, {"score": 0.002808298910480358, "phrase": "auction_participants"}, {"score": 0.0025288869172313674, "phrase": "online_auction_participants"}, {"score": 0.0023499703712897293, "phrase": "social_information"}, {"score": 0.002218299213266519, "phrase": "experimental_evaluation"}, {"score": 0.0021049977753042253, "phrase": "presented_approach"}], "paper_keywords": ["online auctions", " reputation", " recommendations"], "paper_abstract": "Online auctions are quickly becoming one of the leading branches of e-commerce. Unfortunately, online auctions attract many fraudulent activities. Reputation systems are crucial for guaranteeing fairness of trade and reliability of service. Currently used reputation systems offer little protection from malevolent contractors. In this paper we present a new method for mining the reputation of sellers in online auctions. We devise two independent measures that assess reliability and questionability of sellers in parallel, leading to the concept of positive and negative reputation. To compute these measures we construct an S-graph which reflects the social linkage between sellers and buyers. We use both explicit and implicit feedbacks provided by auction participants, carefully identifying missing feedbacks that have been purposefully left out. Based on reputation estimates the community of online auction participants can detect misbehaving contractors and counteract fraud. Thus, the application of social information about reputation of contractors can be perceived as recommendations. Experimental evaluation of our proposal proves the feasibility and usefulness of the presented approach.", "paper_title": "Mining online auction social networks for reputation and recommendation", "paper_id": "WOS:000268920700006"}