{"auto_keywords": [{"score": 0.049837552331847064, "phrase": "algorithmic_self-assembly"}, {"score": 0.04085427544088492, "phrase": "boolean_functions"}, {"score": 0.010194292137181588, "phrase": "winfree"}, {"score": 0.009312219807537762, "phrase": "nanotechnol"}, {"score": 0.008899965268561951, "phrase": "compact_error-resilient_schemes"}, {"score": 0.008211256794043446, "phrase": "arbitrary_boolean_functions"}, {"score": 0.006349913124091818, "phrase": "error_correction_scheme"}, {"score": 0.00481495049065317, "phrase": "compact_error_resilience_methods"}, {"score": 0.004766536335036112, "phrase": "winfree's_pioneering_work"}, {"score": 0.004600870784042767, "phrase": "bekbolatov"}, {"score": 0.004200833117850362, "phrase": "sci"}, {"score": 0.003993597374640983, "phrase": "original_size"}, {"score": 0.0037870548200948004, "phrase": "critical_challenge"}, {"score": 0.003748937184382714, "phrase": "compact_error_resilient_schemes"}, {"score": 0.0036460731590599645, "phrase": "prior_results"}, {"score": 0.003600251125340193, "phrase": "different_degrees"}, {"score": 0.003483781511768904, "phrase": "considerably_more_complete_theory"}, {"score": 0.00326198730644204, "phrase": "neighboring_sides"}, {"score": 0.0030542703032534766, "phrase": "probabilistic_model"}, {"score": 0.0030311679447397725, "phrase": "independent_error_model"}, {"score": 0.002947939927280631, "phrase": "kinetic_equilibrium"}, {"score": 0.0029108660519407926, "phrase": "two-dimensional_algorithmic_self-assembly"}, {"score": 0.0025260919226344305, "phrase": "ultimate_limits"}, {"score": 0.002500634329341185, "phrase": "compact_error"}, {"score": 0.0024943100191530897, "phrase": "resilient_schemes"}, {"score": 0.002305974875400655, "phrase": "first_provable_compact_error_resilience_schemes"}, {"score": 0.002225637256299616, "phrase": "two-dimensional_self-assembly"}, {"score": 0.0021210562503816287, "phrase": "self-healing_tile"}, {"score": 0.0021049977753042253, "phrase": "three-dimensional_self-assembly"}], "paper_keywords": [""], "paper_abstract": "Winfree's pioneering work led the foundations in the area of error-reduction in algorithmic self-assembly (Winfree and Bekbolatov in DNA Based Computers 9, LNCS, vol. 2943, pp. 126-144, [2004]), but the construction resulted in increase of the size of assembly. Reif et al. (Nanotechnol. Sci. Comput. 79-103, [2006]) contributed further in this area with compact error-resilient schemes that maintained the original size of the assemblies, but required certain restrictions on the Boolean functions to be used in the algorithmic self-assembly. It is a critical challenge to improve these compact error resilient schemes to incorporate arbitrary Boolean functions, and to determine how far these prior results can be extended under different degrees of restrictions on the Boolean functions. In this work we present a considerably more complete theory of compact error-resilient schemes for algorithmic self-assembly in two and three dimensions. In our error model, epsilon is defined to be the probability that there is a mismatch between the neighboring sides of two juxtaposed tiles and they still stay together in the equilibrium. This probability is independent of any other match or mismatch and hence we term this probabilistic model as the independent error model. In our model all the error analysis is performed under the assumption of kinetic equilibrium. First we consider two-dimensional algorithmic self-assembly. We present an error correction scheme for reduction of errors from epsilon to epsilon (2) for arbitrary Boolean functions in two dimensional algorithmic self-assembly. Then we characterize the class of Boolean functions for which the error can be reduced from epsilon to epsilon (3), and present an error correction scheme that achieves this reduction. Then we prove ultimate limits on certain classes of compact error resilient schemes: in particular we show that they can not provide reduction of errors from epsilon to epsilon (4) is for any Boolean functions. Further, we develop the first provable compact error resilience schemes for three dimensional tiling self-assemblies. We also extend the work of Winfree on self-healing in two-dimensional self-assembly (Winfree in Nanotechnol. Sci. Comput. 55-78, [2006]) to obtain a self-healing tile set for three-dimensional self-assembly.", "paper_title": "Capabilities and Limits of Compact Error Resilience Methods for Algorithmic Self-Assembly", "paper_id": "WOS:000273587100006"}