{"auto_keywords": [{"score": 0.04346602708671803, "phrase": "neural_network"}, {"score": 0.021325244769652484, "phrase": "characteristic_parameters"}, {"score": 0.010163314305337004, "phrase": "hydro_turbine_governors"}, {"score": 0.009649195600362176, "phrase": "dynamic_trend"}, {"score": 0.006704895773068683, "phrase": "new_methodology"}, {"score": 0.006560962541662672, "phrase": "bgd"}, {"score": 0.004815005551074787, "phrase": "integrated"}, {"score": 0.0047732596509542135, "phrase": "bond_graph"}, {"score": 0.004650330504968421, "phrase": "fault_diagnosis_system"}, {"score": 0.00457013354092966, "phrase": "purpose_-_the_purpose"}, {"score": 0.003924629168434799, "phrase": "important_tool"}, {"score": 0.0038737214010638745, "phrase": "science_research"}, {"score": 0.003757480190200645, "phrase": "different_degree_defaults"}, {"score": 0.0037087324991876727, "phrase": "traditional_modeling_method"}, {"score": 0.003660614912817745, "phrase": "distributed_bond_graph"}, {"score": 0.003311799410921826, "phrase": "diagnosis_methods"}, {"score": 0.0021049977753042253, "phrase": "operational_researches"}], "paper_keywords": ["Neural nets", " Modelling", " Systems and control theory", " Turbines", " Cybernetics", " Simulation"], "paper_abstract": "Purpose - The purpose of this paper is to obtain the characteristic parameters of dynamic trend for hydro turbine governors, and take these as the inputs of the neural network to realize the diagnosis of the system. Design/methodology/approach - Computer simulation technique has become an important tool in the science research and development. Because of the different degree defaults of the traditional modeling method, a distributed bond graph modeling (BGD) method is presented in this paper. Fault diagnosis and identification have been widely developed in recent years, while many kinds of diagnosis methods have been used in this area. Since it is difficult to get the characteristic parameters of dynamic trend, a new methodology is proposed which integrates BGD and neural network. It gets the characteristic parameters by simulation to the system, and takes these as the inputs of the neural network to realize the diagnosis of the system. Findings - The paper presents the need for application of two models - conventional procedure and bond graph model approaches. Practical implications - The paper is a very useful diagnosis tool for operators. Originality/value - A new methodology is proposed which integrates BGD and neural network. The paper is aimed at operational researches and engineers, the results from simulations are reported and commented in the paper.", "paper_title": "Integrated distributed bond graph modeling and neural network for fault diagnosis system of hydro turbine governors", "paper_id": "WOS:000280732800010"}