{"auto_keywords": [{"score": 0.042151584995031445, "phrase": "system_pfd"}, {"score": 0.0047057084749407485, "phrase": "\"possibly_perfect"}, {"score": 0.004634254474150777, "phrase": "earlier_work"}, {"score": 0.004068907083697369, "phrase": "aleatory_level"}, {"score": 0.0037402558657576124, "phrase": "channel_a"}, {"score": 0.003438058620195309, "phrase": "well-known_difficulty"}, {"score": 0.0031002400518251936, "phrase": "channel_pfds"}, {"score": 0.003018196463874475, "phrase": "new_approach"}, {"score": 0.002949598537993663, "phrase": "failure_dependence"}, {"score": 0.0028278480051602355, "phrase": "complete_analysis"}, {"score": 0.002690406375639144, "phrase": "numeric_values"}, {"score": 0.00254983442025512, "phrase": "different_difficult_problem"}, {"score": 0.0024633601573822114, "phrase": "assessor's_beliefs"}], "paper_keywords": ["Software reliability", " fault tolerance", " software perfection", " probability of failure", " epistemic uncertainty", " software diversity", " multiversion software"], "paper_abstract": "In earlier work, [11] (henceforth LR), an analysis was presented of a 1-out-of-2 software-based system in which one channel was \"possibly perfect\". It was shown that, at the aleatory level, the system pfd (probability of failure on demand) could be bounded above by the product of the pfd of channel A and the pnp (probability of nonperfection) of channel B. This result was presented as a way of avoiding the well-known difficulty that for two certainly-fallible channels, failures of the two will be dependent, i.e., the system pfd cannot be expressed simply as a product of the channel pfds. A price paid in this new approach for avoiding the issue of failure dependence is that the result is conservative. Furthermore, a complete analysis requires that account be taken of epistemic uncertainty-here concerning the numeric values of the two parameters pfd(A) and pnp(B). Unfortunately this introduces a different difficult problem of dependence: estimating the dependence between an assessor's beliefs about the parameters. The work reported here avoids this problem by obtaining results that require only an assessor's marginal beliefs about the individual channels, i.e., they do not require knowledge of the dependence between these beliefs. The price paid is further conservatism in the results.", "paper_title": "Conservative Reasoning about the Probability of Failure on Demand of a 1-out-of-2 Software-Based System in Which One Channel Is \"Possibly Perfect\"", "paper_id": "WOS:000326501200004"}