{"auto_keywords": [{"score": 0.03829272468054182, "phrase": "trust_model"}, {"score": 0.02998999927405984, "phrase": "proposed_environment_model"}, {"score": 0.00481495049065317, "phrase": "reputation_and_trust_framework._artificial_societies"}, {"score": 0.004721162131188487, "phrase": "autonomous_agents"}, {"score": 0.004592905436175987, "phrase": "open_distributed_environments"}, {"score": 0.004129873531628877, "phrase": "real_environments"}, {"score": 0.003939296259436904, "phrase": "reputation_model"}, {"score": 0.003817137134650275, "phrase": "new_evaluation_criteria"}, {"score": 0.003787191644093659, "phrase": "trust_and_reputation_models"}, {"score": 0.00314708280192844, "phrase": "heterogeneous_agents"}, {"score": 0.0031223774204093713, "phrase": "different_trust_models"}, {"score": 0.002763261749602258, "phrase": "open_distributed_systems"}, {"score": 0.00266693888510356, "phrase": "different_types"}, {"score": 0.0026148807877309417, "phrase": "environment_model"}, {"score": 0.0025537472239953807, "phrase": "introduction_interactions"}, {"score": 0.0023694065215394593, "phrase": "decentralized_reporting_mechanism"}, {"score": 0.0023507916951658455, "phrase": "distributed_environments"}, {"score": 0.0022509878391826867, "phrase": "implemented_trust"}, {"score": 0.002233301265743633, "phrase": "reputation_models"}, {"score": 0.002130056082139311, "phrase": "well-known_trust_models"}, {"score": 0.0021049977753042253, "phrase": "individual_and_group_attacks"}], "paper_keywords": ["multiagent systems", " trust", " reputation"], "paper_abstract": "Artificial societies-distributed systems of autonomous agents-are becoming increasingly important in open distributed environments, especially in e-commerce. Agents require trust and reputation concepts to identify communities of agents with which to interact reliably. We have noted in real environments that adversaries tend to focus on exploitation of the trust and reputation model. These vulnerabilities reinforce the need for new evaluation criteria for trust and reputation models called exploitation resistance which reflects the ability of a trust model to be unaffected by agents who try to manipulate the trust model. To examine whether a given trust and reputation model is exploitation-resistant, the researchers require a flexible, easy-to-use, and general framework. This framework should provide the facility to specify heterogeneous agents with different trust models and behaviors. This paper introduces a Distributed Analysis of Reputation and Trust (DART) framework. The environment of DART is decentralized and game-theoretic. Not only is the proposed environment model compatible with the characteristics of open distributed systems, but it also allows agents to have different types of interactions in this environment model. Besides direct, witness, and introduction interactions, agents in our environment model can have a type of interaction called a reporting interaction, which represents a decentralized reporting mechanism in distributed environments. The proposed environment model provides various metrics at both micro and macro levels for analyzing the implemented trust and reputation models. Using DART, researchers have empirically demonstrated the vulnerability of well-known trust models against both individual and group attacks.", "paper_title": "DART: A DISTRIBUTED ANALYSIS OF REPUTATION AND TRUST FRAMEWORK", "paper_id": "WOS:000310485700008"}