{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "formal_concept_analysis"}, {"score": 0.004621447740470602, "phrase": "standard_relational_view"}, {"score": 0.004336345867895402, "phrase": "possibility_theory"}, {"score": 0.004183137595671171, "phrase": "dual_sufficiency"}, {"score": 0.00408617426304956, "phrase": "possibility_operators"}, {"score": 0.0038761135052054765, "phrase": "first_operator"}, {"score": 0.0037201996003549246, "phrase": "qualitative_data_analysis"}, {"score": 0.0035705347414368726, "phrase": "rough_set_theory"}, {"score": 0.0035082436540296406, "phrase": "possibility-theoretic_reading"}, {"score": 0.00304737045343781, "phrase": "nine_situations"}, {"score": 0.0025854347094662247, "phrase": "new_notions"}, {"score": 0.0024667783849055634, "phrase": "latter_framework"}, {"score": 0.002353554841514325, "phrase": "meaningful_properties"}, {"score": 0.0022854384756395116, "phrase": "graded_setting"}, {"score": 0.0021049977753042253, "phrase": "incomplete_or_uncertain_information"}], "paper_keywords": [""], "paper_abstract": "The paper starts from the standard relational view linking objects and properties in formal concept analysis, here augmented with four modal-style operators (known as sufficiency, dual sufficiency, necessity and possibility operators). Formal concept analysis is mainly based on the first operator, while the others come from qualitative data analysis and can be also related to rough set theory. A possibility-theoretic reading of formal concept analysis with these four operators is proposed. First, it is shown that four and only four operators are indeed needed in order to describe the nine situations that can occur when comparing a statement (or its negation) with a state of information. The parallel between possibility theory and formal concept analysis suggests the introduction of new notions such as normalization and conditioning in the latter framework, also leading to point out some meaningful properties. Moreover, the graded setting of possibility theory allows us to suggest the extension of formal concept analysis to situations with incomplete or uncertain information.", "paper_title": "A possibility-theoretic view of formal concept analysis", "paper_id": "WOS:000244426400012"}