{"auto_keywords": [{"score": 0.04037799303311693, "phrase": "icnp"}, {"score": 0.010469866142123483, "phrase": "representational_model"}, {"score": 0.010277850604784798, "phrase": "exact_matches"}, {"score": 0.00902187109915492, "phrase": "semantic_relations"}, {"score": 0.006438278113190312, "phrase": "nursing_assessment_documentation"}, {"score": 0.00481495049065317, "phrase": "icnp_version"}, {"score": 0.004717723626157272, "phrase": "electronic_nursing_assessment_documentation"}, {"score": 0.004216880725292, "phrase": "representational_requirements"}, {"score": 0.004188287972391714, "phrase": "nursing_assessments"}, {"score": 0.004117647922204903, "phrase": "key_concepts"}, {"score": 0.003939487754302632, "phrase": "icnp._next"}, {"score": 0.003718045060236861, "phrase": "expanded_icnp_semantic_relations"}, {"score": 0.003593623872399777, "phrase": "additional_set"}, {"score": 0.00356924199356768, "phrase": "admission_assessment_records"}, {"score": 0.003438058620195309, "phrase": "concept_coverage"}, {"score": 0.003255777265493076, "phrase": "icnp_concepts"}, {"score": 0.003222687723450745, "phrase": "umls_methathesaurus"}, {"score": 0.00309364906014212, "phrase": "ana"}, {"score": 0.0027741761880779535, "phrase": "eight_hundred_and_five_unique_assessment_concepts"}, {"score": 0.0027088011534576856, "phrase": "forty-three_percent"}, {"score": 0.002681255756642227, "phrase": "unique_assessment_concepts"}, {"score": 0.002323708293955822, "phrase": "broad_concept_coverage"}, {"score": 0.0023000698178350415, "phrase": "logic-based_structure"}, {"score": 0.002126635713519053, "phrase": "atomic_level_data"}, {"score": 0.0021049977753042253, "phrase": "evidence-based_practice"}], "paper_keywords": [""], "paper_abstract": "Objectives: The purpose of this study was to evaluate the adequacy of the International Classification of Nursing Practice (ICPN) Version 1.0 as a representational model for nursing assessment documentation. Design and Measurements: To identify representational requirements of nursing assessments, the authors mapped key concepts and semantic relations extracted from standardized and local nursing admission assessment documentation forms/templates and inpatient admission assessment records to the ICNP. Next, they expanded the list of ICNP semantic relations with those obtained from the admission assessment forms/templates. The expanded ICNP semantic relations were then validated against the semantic relations identified from an additional set of admission assessment records and a set of 300 randomly selected North American Nursing Diagnosis Association defining characteristic phrases. The concept coverage of the ICNP was evaluated by mapping the concepts extracted from these sources to the ICNP concepts. The UMLS Methathesaurus was then used to map concepts without exact matches to other American Nursing Association (ANA) recognized terminologies. Results: The authors found that along with the 30 existing ICNP semantic relations, an additional 17 are required for the ICNP to function as a representational model for nursing assessment documentation. Eight hundred and five unique assessment concepts were extracted from all sources. Forty-three percent of these unique assessment concepts had exact matches in the ICNP. An additional 20% had matches in the ICNP classified as narrower, broader, or \"other,\" Of the concepts without exact matches in the ICNP, 81% had exact matches found in other ANA recognized terminologies. Conclusions: The broad concept coverage and the logic-based structure of the ICNP make it a flexible and robust standard. The ICNP provides a framework from which to capture and reuse atomic level data to facilitate evidence-based practice.", "paper_title": "The Adequacy of ICNP Version 1.0 as a Representational Model for Electronic Nursing Assessment Documentation", "paper_id": "WOS:000264499500013"}