{"auto_keywords": [{"score": 0.03741188355038357, "phrase": "neutral_point"}, {"score": 0.00481495049065317, "phrase": "multicriteria_decision_analysis"}, {"score": 0.004638462976078815, "phrase": "decision_analysis_studies"}, {"score": 0.0037242701420971062, "phrase": "former_case"}, {"score": 0.003504756881063581, "phrase": "positive_feeling"}, {"score": 0.003329117824699891, "phrase": "negative_feeling"}, {"score": 0.003003726508522467, "phrase": "contradictory_feelings"}, {"score": 0.002787181295054319, "phrase": "multicriteria_evaluations"}, {"score": 0.002538263784314365, "phrase": "descriptive_view"}, {"score": 0.002456486927713543, "phrase": "descriptive_approach"}, {"score": 0.0023223663501882917, "phrase": "constructive_approach"}, {"score": 0.002289993730291136, "phrase": "building_preferences"}, {"score": 0.0022475295254231714, "phrase": "decision_maker"}, {"score": 0.0021049977753042253, "phrase": "wiley_periodicals"}], "paper_keywords": [""], "paper_abstract": "Multicriteria decision analysis studies decision problems in which the alternatives are evaluated on several dimensions or viewpoints. In the problems we consider in this article. the scales Used for assessing, the alternatives with respect to a viewpoint are bipolar and univariate or unipolar and bivariate. In the former case, the scale is divided in two zones by a neutral point; a positive feeling is associated to the zone above the neutral point and a negative feeling to the zone below this Point. Oil Unipolar bivariate scales. an alternative can receive both a Positive evaluation and it negative evaluation, reflecting contradictory feelings or stimuli. The article discusses procedures and models that have been proposed to aggregate multicriteria evaluations when the scale of each criterion is of one of these two types. We present both a constructive view and a descriptive view, on this question: the descriptive approach is concerned with characterizations of models of preference, whereas the constructive approach aims at building preferences by questioning the decision maker. We show that these views are complementary. (C) 2008 Wiley Periodicals, Inc.", "paper_title": "Bipolar and bivariate models in multicriteria decision analysis: Descriptive and constructive approaches", "paper_id": "WOS:000258803400002"}