{"auto_keywords": [{"score": 0.02982675206352329, "phrase": "different_methodologies"}, {"score": 0.028707905192628114, "phrase": "kemanager"}, {"score": 0.00481495049065317, "phrase": "meta-tool"}, {"score": 0.004728624975677976, "phrase": "knowledge_engineering_methodologies"}, {"score": 0.004700193486903964, "phrase": "projects._knowledge-based_systems"}, {"score": 0.004319566932528865, "phrase": "inference_rules"}, {"score": 0.004280651472525981, "phrase": "knowledge_engineering"}, {"score": 0.004140924670517666, "phrase": "real_world"}, {"score": 0.004017846065981189, "phrase": "knowledge_acquisition_process"}, {"score": 0.003714629047818465, "phrase": "mark_times"}, {"score": 0.0036700484729006136, "phrase": "project_phase"}, {"score": 0.0031941384895530426, "phrase": "ke_methodologies"}, {"score": 0.003117890043128058, "phrase": "particular_phases"}, {"score": 0.0029262611715147454, "phrase": "ke_tools"}, {"score": 0.0028736995088566083, "phrase": "joint_use"}, {"score": 0.0027630232270330402, "phrase": "particular_problem"}, {"score": 0.0026088674879389826, "phrase": "combined_application"}, {"score": 0.0023971911437246393, "phrase": "commonkads"}, {"score": 0.0023833734481115173, "phrase": "ideal"}, {"score": 0.0022840180582947302, "phrase": "ad_hoc_creation"}, {"score": 0.0022633993976138387, "phrase": "new_methodology"}, {"score": 0.0022497569011987587, "phrase": "pre-existing_methodologies"}, {"score": 0.0021960024679620886, "phrase": "ke_process"}, {"score": 0.002163058716517137, "phrase": "domain-specific_characteristics"}, {"score": 0.0021049977753042253, "phrase": "carlos_iii_university_of_madrid"}], "paper_keywords": ["Knowledge engineering", " knowledge-based systems", " expert systems", " software tools", " IDEAL", " CommonKADS"], "paper_abstract": "Knowledge-based systems (KBSs) or expert systems (ESs) are able to solve problems generally through the application of knowledge representing a domain and a set of inference rules. In knowledge engineering (KE), the use of KBSs in the real world, three principal disadvantages have been encountered. First, the knowledge acquisition process has a very high cost in terms of money and time. Second, processing information provided by experts is often difficult and tedious. Third, the establishment of mark times associated with each project phase is difficult due to the complexity described in the previous two points. In response to these obstacles, many methodologies have been developed, most of which include a tool to support the application of the given methodology. Nevertheless, there are advantages and disadvantages inherent in KE methodologies, as well. For instance, particular phases or components of certain methodologies seem to be better equipped than others to respond to a given problem. However, since KE tools currently available support just one methodology the joint use of these phases or components from different methodologies for the solution of a particular problem is hindered. This paper presents KEManager, a generic meta-tool that facilitates the definition and combined application of phases or components from different methodologies. Although other methodologies could be defined and combined in the KEManager, this paper focuses on the combination of two well-known KE methodologies, CommonKADS and IDEAL, together with the most commonly-applied knowledge acquisition methods. The result is an example of the ad hoc creation of a new methodology from pre-existing methodologies, allowing for the adaptation of the KE process to an organization or domain-specific characteristics. The tool was evaluated by students at Carlos III University of Madrid (Spain).", "paper_title": "A META-TOOL TO SUPPORT THE DEVELOPMENT OF KNOWLEDGE ENGINEERING METHODOLOGIES AND PROJECTS", "paper_id": "WOS:000317142000004"}