{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "streaming_data"}, {"score": 0.03712323512311856, "phrase": "data_sources"}, {"score": 0.004724020632103649, "phrase": "timely_information"}, {"score": 0.004694092086199672, "phrase": "modem_database_applications"}, {"score": 0.004634799977448855, "phrase": "sensor_networks"}, {"score": 0.004605434064238641, "phrase": "web_services"}, {"score": 0.004576253356889219, "phrase": "isoline-based_visualization"}, {"score": 0.00443308765153716, "phrase": "great_use"}, {"score": 0.004094383764612506, "phrase": "real_time"}, {"score": 0.00378145978325955, "phrase": "isoline_extraction"}, {"score": 0.0037336520904376687, "phrase": "data_terrains"}, {"score": 0.003204841443605308, "phrase": "dynamic_data_network"}, {"score": 0.003026391655379905, "phrase": "current_isoline_map"}, {"score": 0.0029409171055888804, "phrase": "large_networks"}, {"score": 0.0028944757265206332, "phrase": "complete_recomputation"}, {"score": 0.0028487656293168795, "phrase": "isoline_map"}, {"score": 0.002597491690813945, "phrase": "real-time_performance"}, {"score": 0.002556459595882617, "phrase": "time_complexity"}, {"score": 0.002508073621696602, "phrase": "efficient_dynamic_data_structures"}, {"score": 0.0023986960505076784, "phrase": "doubly-balanced_interval_tree"}, {"score": 0.0023234950796782376, "phrase": "edge_sets"}, {"score": 0.0021870332034407817, "phrase": "data_terrain_visualization"}, {"score": 0.0021184539346572953, "phrase": "experimental_results"}], "paper_keywords": [""], "paper_abstract": "Queries over streaming data offer the potential to provide timely information for modem database applications, such as sensor networks and web services. Isoline-based visualization of streaming data has the potential to be of great use in such applications. Dynamic (real-time) isoline extraction from the streaming data is needed in order to fully harvest that potential, allowing the users to see in real time the patterns and trends - both spatial and temporal - inherent in such data. This is the goal of this paper. Our approach to isoline extraction is based on data terrains, triangulated irregular networks (TINs) where the coordinates of the vertices corresponds to locations of data sources, and the height corresponds to their readings. We dynamically maintain such a data terrain for the streaming data. Furthermore, we dynamically maintain an isoline (contour) map over this dynamic data network. The user has the option of continuously viewing either the current shaded triangulation of the data terrain, or the current isoline map, or an overlay of both. For large networks, we assume that complete recomputation of either the data terrain or the isoline map at every epoch is impractical. If n is the number of data sources in the network, time complexity per epoch should be O(log n) to achieve real-time performance. To achieve this time complexity, our algorithms are based on efficient dynamic data structures that are continuously updated rather than recomputed. Specifically, we use a doubly-balanced interval tree, a new data structure where both the tree and the edge sets of each node are balanced. As far as we know, no one has applied TINs for data terrain visualization before this work. Our dynamic isoline computation algorithm is also new. Experimental results confirm both the efficiency and the scalability of our approach.", "paper_title": "Dynamic isoline extraction for visualization of streaming data", "paper_id": "WOS:000238109200042"}