{"auto_keywords": [{"score": 0.04827337430415872, "phrase": "set_s"}, {"score": 0.03210487895708245, "phrase": "topological_events"}, {"score": 0.00481495049065317, "phrase": "near-quadratic_topological_changes"}, {"score": 0.0043181530164057135, "phrase": "convex_hull"}, {"score": 0.003947601392882997, "phrase": "n_points"}, {"score": 0.0030741085942960814, "phrase": "small_number"}, {"score": 0.0027564303939865476, "phrase": "kinetic_data_structure"}, {"score": 0.0025195550121331367, "phrase": "input_points"}, {"score": 0.0024874156497091994, "phrase": "algebraic_curves"}, {"score": 0.0024556852466581527, "phrase": "fixed_degree"}, {"score": 0.0024088451312725924, "phrase": "topological_event"}, {"score": 0.0022159566043745724, "phrase": "first_known_kds"}, {"score": 0.0021049977753042253, "phrase": "near-quadratic_number"}], "paper_keywords": [""], "paper_abstract": "A triangulation of a set S of points in the plane is a subdivision of the convex hull of S into triangles whose vertices are points of S. Given a set S of n points in R-2, each moving independently, we wish to maintain a triangulation of S. The triangulation needs to be updated periodically as the points in S move, so the goal is to maintain a triangulation with a small number of topological events, each being the insertion or deletion of an edge. We propose a kinetic data structure (KDS) that processes n(2)2(O(root log n.log log n)) topological events with high probability if the trajectories of input points are algebraic curves of fixed degree. Each topological event can be processed in O(log n) time. This is the first known KDS for maintaining a triangulation that processes a near-quadratic number of topological events, and almost matches the Omega(n(2)) lower bound [1]. The number of topological events can be reduced to nk . 2(O(root log k.log log n)) if only k of the points are moving.", "paper_title": "A two-dimensional kinetic triangulation with near-quadratic topological changes", "paper_id": "WOS:000241540600006"}