{"auto_keywords": [{"score": 0.03353119463701558, "phrase": "uncertainty_measures"}, {"score": 0.0047517225918491226, "phrase": "five_uncertainty_measures"}, {"score": 0.003922580121023413, "phrase": "recently_developed_alpha-plane_representation"}, {"score": 0.003413705707789296, "phrase": "unified_strategy"}, {"score": 0.0032376465741070274, "phrase": "low_complexity"}, {"score": 0.003091036449708673, "phrase": "different_shaped_footprints"}, {"score": 0.003010250522930773, "phrase": "different_kinds"}, {"score": 0.0029706504420983896, "phrase": "secondary_membership_functions"}, {"score": 0.0025509294021449254, "phrase": "summary_interval_uncertainty_measure"}, {"score": 0.0023716501597131024, "phrase": "comparative_studies"}], "paper_keywords": ["alpha-Plane representation", " Cardinality", " Centroid", " Fuzziness", " Skewness", " Type-2 fuzzy sets", " Uncertainty measures", " Variance"], "paper_abstract": "Five uncertainty measures have previously been defined for interval Type-2 fuzzy sets (IT2 FSs), namely centroid, cardinality, fuzziness, variance and skewness. Based on a recently developed alpha-plane representation for a general T2 FS, this paper generalizes these definitions to such T2 FSs and, more importantly, derives a unified strategy for computing all different uncertainty measures with low complexity. The uncertainty measures of T2 FSs with different shaped Footprints of Uncertainty and different kinds of secondary membership functions (MFs) are computed and are given as examples. Observations and summaries are made for these examples, and a Summary Interval Uncertainty Measure for a general T2 FS is proposed to simplify the interpretations. Comparative studies of uncertainty measures for Quasi-Type-2 (QT2), IT2 and T2 FSs are also performed to examine the feasibility of approximating T2 FSs using QT2 or even IT2 FSs. (C) 2010 Elsevier Inc. All rights reserved.", "paper_title": "Uncertainty measures for general Type-2 fuzzy sets", "paper_id": "WOS:000285123000008"}