{"auto_keywords": [{"score": 0.03685259410949237, "phrase": "groel-interacting_proteins"}, {"score": 0.009906579002102176, "phrase": "chaperonin_system"}, {"score": 0.00481495049065317, "phrase": "low_folding_propensity"}, {"score": 0.004764859786310636, "phrase": "high_translation_efficiency"}, {"score": 0.004690694501758065, "phrase": "vivo_substrates"}, {"score": 0.004641891112611842, "phrase": "groel"}, {"score": 0.004498490110526062, "phrase": "theoretical_considerations"}, {"score": 0.0043367547691560175, "phrase": "chaperonin_groel"}, {"score": 0.004291617358806677, "phrase": "escherichia_coli_cells"}, {"score": 0.004137288854115515, "phrase": "newly_synthesized_proteins"}, {"score": 0.0040942189695983185, "phrase": "normal_physiological_conditions"}, {"score": 0.003946960862020283, "phrase": "e.coli_proteins"}, {"score": 0.0038249462699142733, "phrase": "groel-dependent_manner"}, {"score": 0.0032861588691414667, "phrase": "sequence-based_features"}, {"score": 0.002808298910480358, "phrase": "high_translation_efficiencies"}, {"score": 0.0022653055209664284, "phrase": "e.coli_groel-interacting_proteins"}, {"score": 0.002241679770302632, "phrase": "ureaplasma"}], "paper_keywords": [""], "paper_abstract": "Motivation: Theoretical considerations have indicated that the amount of chaperonin GroEL in Escherichia coli cells is sufficient to fold only 25 of newly synthesized proteins under normal physiological conditions, thereby suggesting that only a subset of E.coli proteins fold in vivo in a GroEL-dependent manner. Recently, members of this subset were identified in two independent studies that resulted in two partially overlapping lists of GroEL-interacting proteins. The objective of the work described here was to identify sequence-based features of GroEL-interacting proteins that distinguish them from other E.coli proteins and that may account for their dependence on the chaperonin system. Results: Our analysis shows that GroEL-interacting proteins have, on average, low folding propensities and high translation efficiencies. These two properties in combination can increase the risk of aggregation of these proteins and, thus, cause their folding to be chaperonin-dependent. Strikingly, we find that these properties are absent in proteins homologous to the E.coli GroEL-interacting proteins in Ureaplasma urealyticum, an organism that lacks a chaperonin system, thereby confirming our conclusions.", "paper_title": "Low folding propensity and high translation efficiency distinguish in vivo substrates of GroEL from other Escherichia coli proteins", "paper_id": "WOS:000251505700002"}