{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "melodic_similarity"}, {"score": 0.005270113330811349, "phrase": "mozart"}, {"score": 0.004374772264092067, "phrase": "different_means"}, {"score": 0.0040479661688863884, "phrase": "monte_carlo"}, {"score": 0.003814563533445401, "phrase": "ground_truth"}, {"score": 0.00325069754015951, "phrase": "important_differences"}, {"score": 0.0028995712226514746, "phrase": "multiple_possible_reductions_forms"}, {"score": 0.0026704265616705023, "phrase": "wide_variations"}, {"score": 0.0026461080202599694, "phrase": "subjects'_judgements"}, {"score": 0.002551022760887132, "phrase": "perceived_similarity"}, {"score": 0.0024258208033731154, "phrase": "third_melody"}, {"score": 0.002244277924422011, "phrase": "different_interpretations"}, {"score": 0.0021049977753042253, "phrase": "distinct_and_definite_function"}], "paper_keywords": [""], "paper_abstract": "The nature of melodic similarity is interrogated through a survey of the different means by which the phenomenon has been studied, examination of methods for measuring melodic similarity, a Monte Carlo analysis of data from the experiment which formed the basis for the ground truth used in the MIREX 2005 contest on melodic similarity, and examples of interest in the music of Mozart. Melodic similarity has been studied by a number of means, sometimes quite contrasting, which lead to important differences in the light of the finding that similarity is dependent on context. Models of melodic similarity based on reduction show that the existence of multiple possible reductions forms a natural basis for similarity to depend on interpretation. Examination of the MIREX 2005 data shows wide variations in subjects' judgements of melodic similarity and some evidence that the perceived similarity between two melodies can be influenced by the presence of a third melody. Examples from Mozart suggest that he deliberately exploited the possibilities inherent in recognizing similarity through different interpretations. It is therefore proposed that similarity be thought of not as a distinct and definite function of two melodies but as something created in the minds of those who hear the melodies.", "paper_title": "Interrogating Melodic Similarity: A Definitive Phenomenon or the Product of Interpretation?", "paper_id": "WOS:000312443400004"}