{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "certificate_chains"}, {"score": 0.044855676667966436, "phrase": "public_key"}, {"score": 0.01374318710250377, "phrase": "certificate_chain"}, {"score": 0.009252048689279287, "phrase": "total_number"}, {"score": 0.007967313854856571, "phrase": "np"}, {"score": 0.0074211560730594196, "phrase": "chain_sets"}, {"score": 0.004620093797504386, "phrase": "public_keys"}, {"score": 0.0045122922461952805, "phrase": "issued_certificates"}, {"score": 0.004342430078306461, "phrase": "user_u"}, {"score": 0.0031100973266506163, "phrase": "shared_key"}, {"score": 0.0028885579903645043, "phrase": "destination_users"}, {"score": 0.0025587867729949037, "phrase": "strictly_lower_cost"}, {"score": 0.0024622810950164415, "phrase": "optimal_dispersal"}, {"score": 0.002233301265743633, "phrase": "practical_interests"}], "paper_keywords": ["security and privacy protection", " authentication", " security and protection", " authentication", " certificate graph", " certificate dispersal", " public-key management"], "paper_abstract": "We consider a network where users can issue certificates that identify the public keys of other users in the network. The issued certificates in a network constitute a set of certificate chains between users. A user u can obtain the public key of another user v from a certificate chain from u to v in the network. For the certificate chain from u to v, u is called the source of the chain and v is called the destination of the chain. Certificates in each chain are dispersed between the source and destination of the chain such that the following condition holds. If any user u needs to securely send messages to any other user v in the network, then u can use the certificates stored in u and v to obtain the public key of v (then u can use the public key of v to set up a shared key with v to securely send messages to v). The cost of dispersing certificates in a set of chains among the source and destination users in a network is measured by the total number of certificates that need to be stored in all users. A dispersal of a set of certificate chains in a network is optimal if no other dispersal of the same chain set has a strictly lower cost. In this paper, we show that the problem of computing optimal dispersal of a given chain set is NP-complete. Thus, minimizing the total number of certificates stored in all users is NP-complete. We identify three special classes of chain sets that are of practical interests and devise three polynomial-time algorithms that compute optimal dispersals for each class. We also present two polynomial-time extensions of these algorithms for more general classes of chain sets.", "paper_title": "Optimal dispersal of certificate chains", "paper_id": "WOS:000244465900004"}