{"auto_keywords": [{"score": 0.04858938791901053, "phrase": "knowledge_sharing"}, {"score": 0.03793872113955126, "phrase": "members'_satisfaction"}, {"score": 0.004623224002010226, "phrase": "academic_virtual_communities"}, {"score": 0.004439097815805505, "phrase": "social_capital_theory"}, {"score": 0.00439918275666155, "phrase": "technology_acceptance_model"}, {"score": 0.004281568920264999, "phrase": "theoretical_socio-technical_model"}, {"score": 0.004204904449336037, "phrase": "partial_least_squares_method"}, {"score": 0.004092463367307375, "phrase": "proposed_model"}, {"score": 0.00391167729353583, "phrase": "well-known_academic_community"}, {"score": 0.003876545382701945, "phrase": "china"}, {"score": 0.0034780071331554003, "phrase": "social_interaction_ties"}, {"score": 0.00338493754743055, "phrase": "shared_vision"}, {"score": 0.0032794890195334513, "phrase": "perceived_usefulness"}, {"score": 0.0029025435402480326, "phrase": "avcs'_administrators"}, {"score": 0.0028764048059439205, "phrase": "effective_strategies"}, {"score": 0.002824829396721492, "phrase": "continued_knowledge"}, {"score": 0.002687702958515561, "phrase": "socio-technical_framework"}, {"score": 0.002603918128553617, "phrase": "initial_adoption"}, {"score": 0.002488724764295623, "phrase": "socio-technical_model"}, {"score": 0.002389403849342894, "phrase": "exact_roles"}, {"score": 0.0021049977753042253, "phrase": "continuance_intention"}], "paper_keywords": ["Knowledge sharing", " Satisfaction", " Continuance intention", " Academic virtual communities", " Socio-technical perspective"], "paper_abstract": "Purpose - The purpose of this paper is to explain how sociability and usability enhanced members' satisfaction, and how such satisfaction in turn, influenced their continuance intention of knowledge sharing in academic virtual communities (AVCs). Design/methodology/approach - Drawing on social capital theory and technology acceptance model, this study proposed a theoretical socio-technical model, and the partial least squares method is used to examine the proposed model, based on data collected from 431 subjects in a well-known academic community in China (i.e. ScienceNet). Findings - Both sociability and usability were important to improve members' satisfaction with knowledge sharing in AVCs. Specifically, social interaction ties, trust, reciprocity, shared vision, perceived ease of use and perceived usefulness are antecedents of members' satisfaction, which in turn positively affects their continuance intention of knowledge sharing in AVCs. Practical implications - This study provided insights that can help AVCs' administrators develop effective strategies that could encourage continued knowledge sharing behavior through promoting members' satisfaction. Originality/value - While the socio-technical framework has mainly been used to study initial adoption and participation of knowledge sharing. This study proposed a socio-technical model to move a step forward by explaining the exact roles of sociability and usability in terms of promoting members' satisfaction and identifying its critical effect on their continuance intention to share knowledge in AVCs, leading to a more comprehensive picture of members' satisfaction and continuance intention of knowledge sharing in AVCs.", "paper_title": "Members' satisfaction and continuance intention: a socio-technical perspective", "paper_id": "WOS:000359055200008"}