{"auto_keywords": [{"score": 0.04970198387475844, "phrase": "channel_assignment"}, {"score": 0.03795219082630395, "phrase": "channel_assignment_algorithms"}, {"score": 0.00481495049065317, "phrase": "wireless_mesh_networks"}, {"score": 0.0046650615456476155, "phrase": "multiradio_wireless_mesh_networks"}, {"score": 0.00443133501650381, "phrase": "computational_complexity"}, {"score": 0.0043790755286923794, "phrase": "resulting_problems"}, {"score": 0.004327429667024575, "phrase": "channel_assignment_problem"}, {"score": 0.004159617445102161, "phrase": "routing_problem"}, {"score": 0.003982500388997765, "phrase": "traffic_flow"}, {"score": 0.0034537189001268113, "phrase": "completely_different_configuration"}, {"score": 0.0033460624879847667, "phrase": "network_operation"}, {"score": 0.00316565009987584, "phrase": "new_channels"}, {"score": 0.002901538668877986, "phrase": "routing_protocols"}, {"score": 0.002867268370615848, "phrase": "wireless_ad_hoc"}, {"score": 0.0025359354516609795, "phrase": "channel_reassignment_algorithm"}, {"score": 0.0024960634897058394, "phrase": "current_channel_assignment"}, {"score": 0.002408623172021922, "phrase": "new_traffic_pattern"}, {"score": 0.0023801608396295396, "phrase": "best_manner"}, {"score": 0.0023058910418682676, "phrase": "limited_number"}, {"score": 0.0021049977753042253, "phrase": "real_hardware"}], "paper_keywords": ["Wireless mesh networks", " channel reassignment", " algorithm design and analysis"], "paper_abstract": "Channel assignment is among the most challenging issues for multiradio wireless mesh networks, given the variety of objectives that can be pursued and the computational complexity of the resulting problems. The channel assignment problem has been also shown to be interdependent with the routing problem, i.e., the problem to determine the amount of traffic flow to be routed on every link. Such a relationship raises the need to recompute the channel assignment every time the traffic pattern changes. However, channel assignment algorithms designed to assign channels from scratch will likely return a completely different configuration of radios, which would disrupt the network operation for the time required to switch to using the links established on the new channels. As shown by the experiments that we conducted, such a time may not be negligible, due to the resistance of routing protocols designed for wireless ad hoc and mesh networks to rapidly flagging a link as established/lost. Such a consideration, along with the observation that channel assignment algorithms may be suboptimal, led us to the design of a channel reassignment algorithm that takes the current channel assignment into account and attempts to cope with the new traffic pattern in the best manner possible while modifying the channel on a limited number of radios. In this paper, we illustrate such a channel reassignment algorithm and evaluate its performance by means of both simulations and experiments with real hardware.", "paper_title": "A Traffic-Aware Channel and Rate Reassignment Algorithm for Wireless Mesh Networks", "paper_id": "WOS:000319411600007"}