{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "model-based_rich_internet_applications_crawling"}, {"score": 0.004710944813540894, "phrase": "\"probability\"_models._strategies"}, {"score": 0.004625983640628956, "phrase": "web_sites"}, {"score": 0.004396120480895021, "phrase": "web_applications"}, {"score": 0.003955523458325766, "phrase": "richer_and_more_advanced_technologies"}, {"score": 0.003912539113197356, "phrase": "ajax"}, {"score": 0.0038841330270679097, "phrase": "\"rich_internet_applications"}, {"score": 0.0034946693480479712, "phrase": "building_models"}, {"score": 0.003381905288924267, "phrase": "indexing_content"}, {"score": 0.003308751289007707, "phrase": "automated_testing"}, {"score": 0.003284718806701356, "phrase": "automated_security_assessments"}, {"score": 0.003201967054773186, "phrase": "software_engineering_tools"}, {"score": 0.00293370839211022, "phrase": "\"model-based_crawling"}, {"score": 0.0029017952452477344, "phrase": "mbc"}, {"score": 0.0024715695446993107, "phrase": "previous_models"}, {"score": 0.0024536035333055637, "phrase": "mbc."}, {"score": 0.0024004805502253427, "phrase": "probability_model"}, {"score": 0.002128169201317242, "phrase": "client_states"}], "paper_keywords": ["Crawling", " RIAs", " AJAX", " Modelling"], "paper_abstract": "Strategies for \"crawling\" Web sites efficiently have been described more than a decade ago. Since then, Web applications have come a long way both in terms of adoption to provide information and services and in terms of technologies to develop them. With the emergence of richer and more advanced technologies such as AJAX, \"Rich Internet Applications\" (RIAs) have become more interactive, more responsive and generally more user friendly. Unfortunately, we have also lost our ability to crawl them. Building models of applications automatically is important not only for indexing content, but also to do automated testing, automated security assessments, automated accessibility assessment and in general to use software engineering tools. We must regain our ability to efficiently construct models for these RIAs. In this paper, we present two methods, based on \"Model-Based Crawling\" (MBC) first introduced in [1]: the \"menu\" model and the \"probability\" model. These two methods are shown to be more effective at extracting models than previously published methods, and are much simpler to implement than previous models for MBC. A distributed implementation of the probability model is also discussed. We compare these methods and others against a set of experimental and \"real\" RIAs, showing that in our experiments, these methods find the set of client states faster than other approaches, and often finish the crawl faster as well..", "paper_title": "MODEL-BASED RICH INTERNET APPLICATIONS CRAWLING: \"MENU\" AND \"PROBABILITY\" MODELS", "paper_id": "WOS:000342116700005"}