{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "gestalt_rules"}, {"score": 0.04905613790748982, "phrase": "architectural_drawings"}, {"score": 0.030847202748534683, "phrase": "line_drawings"}, {"score": 0.004537254814246843, "phrase": "structural_summarization"}, {"score": 0.004440277230269978, "phrase": "complex_spatial_arrangements"}, {"score": 0.0041840994704406866, "phrase": "well-known_gestalt_rules"}, {"score": 0.0037554497046697432, "phrase": "geometric_information"}, {"score": 0.0036553070575015344, "phrase": "computational_model"}, {"score": 0.0031759067385562553, "phrase": "computational_framework"}, {"score": 0.0031417377608722, "phrase": "models_gestalt_rules"}, {"score": 0.0027295084882654917, "phrase": "gestalt_principles"}, {"score": 0.0025578967205807843, "phrase": "structural_semantics"}, {"score": 0.0023841092222805253, "phrase": "simpler_shapes"}, {"score": 0.002246292543825748, "phrase": "architectural_models"}], "paper_keywords": ["simplification", " abstraction", " Gestalt"], "paper_abstract": "We present a method for structural summarization and abstraction of complex spatial arrangements found in architectural drawings. The method is based on the well-known Gestalt rules, which summarize how forms, patterns, and semantics are perceived by humans from bits and pieces of geometric information. Although defining a computational model for each rule alone has been extensively studied, modeling a conjoint of Gestalt rules remains a challenge. In this work, we develop a computational framework which models Gestalt rules and more importantly, their complex interactions. We apply conjoining rules to line drawings, to detect groups of objects and repetitions that conform to Gestalt principles. We summarize and abstract such groups in ways that maintain structural semantics by displaying only a reduced number of repeated elements, or by replacing them with simpler shapes. We show an application of our method to line drawings of architectural models of various styles, and the potential of extending the technique to other computer-generated illustrations, and three-dimensional models.", "paper_title": "Conjoining Gestalt Rules for Abstraction of Architectural Drawings", "paper_id": "WOS:000297681100063"}