{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "quality-measurable_medical_alerts"}, {"score": 0.004709193603747991, "phrase": "fuzzy_linguistic_variables"}, {"score": 0.004626255242038005, "phrase": "alert_systems"}, {"score": 0.004524624065803229, "phrase": "medical_field"}, {"score": 0.00436661740263741, "phrase": "monitoring_devices"}, {"score": 0.004251728624599691, "phrase": "abnormal_values"}, {"score": 0.003907403442285109, "phrase": "electronic_medical_records"}, {"score": 0.003754140294151593, "phrase": "meteorological_databases"}, {"score": 0.0031562971707460802, "phrase": "domain-independent_fuzzy_linguistic_variables"}, {"score": 0.0029133627624098064, "phrase": "weighted_oriented_graph"}, {"score": 0.0024600113832396187, "phrase": "missing_variable"}, {"score": 0.002395166073437286, "phrase": "detection_algorithm"}, {"score": 0.002250415129116109, "phrase": "main_qualities"}, {"score": 0.0021910825909008946, "phrase": "simplicity_linguistic_variables"}, {"score": 0.0021049977753042253, "phrase": "informational_quality"}], "paper_keywords": ["Fuzzy logic", " incomplete data", " linguistic variables", " medical alerts"], "paper_abstract": "Alert systems are frequent in the medical field, where they are typically connected to monitoring devices that are able to detect abnormal values. Our system is different in its goals and tools. First of all, it processes data extracted from electronic medical records, which are widely used nowadays, and meteorological databases. Variables that are not continually measured by devices (like the age of patients) can then be taken into account. Next, the alerts it handles are not predefined, but created by users through domain-independent fuzzy linguistic variables whose relationships (the height of an individual is conditioned by its age) are modeled by a weighted oriented graph. Finally, the alerts it triggers are associated with two indicators used for filtering and assessing their relevance to the patients, and their reliability according to the amount of information available. Then, if there is a missing variable in a record, the detection algorithm treats it transparently by automatically decreasing the reliability of the alert. The main qualities of this system are the simplicity linguistic variables are intuitive and the ability to measure the informational quality of alerts (applicability and reliability).", "paper_title": "Defining Quality-Measurable Medical Alerts From Incomplete Data Through Fuzzy Linguistic Variables and Modifiers", "paper_id": "WOS:000280480700004"}