{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "coexpression_detection"}, {"score": 0.030364287442202893, "phrase": "proposed_algorithm"}, {"score": 0.00476323161560059, "phrase": "time-varying_microarray_data_sets"}, {"score": 0.004586531354697466, "phrase": "microarray_experiments"}, {"score": 0.004464326432401002, "phrase": "unsupervised_categorization_tools"}, {"score": 0.004298666679374568, "phrase": "time_point"}, {"score": 0.004229556887896042, "phrase": "independent_dimension"}, {"score": 0.004139128578531134, "phrase": "euclidean_distance"}, {"score": 0.0034442607586033657, "phrase": "new_data_set"}, {"score": 0.003298441494378465, "phrase": "novel_scheme"}, {"score": 0.0032318171574719054, "phrase": "variation"}, {"score": 0.002295463032589125, "phrase": "new_measurement_criterion"}, {"score": 0.0021627595586364724, "phrase": "adjacent_time_points"}], "paper_keywords": ["pattern analysis", " time series analysis", " bioinformatics", " data mining", " clustering", " gene expression"], "paper_abstract": "When analyzing the results of microarray experiments, biologists generally use unsupervised categorization tools. However, such tools regard each time point as an independent dimension and utilize the euclidean distance to compute the similarities between expressions. Furthermore, some of these methods require the number of clusters to be determined in advance, which is clearly impossible in the case of a new data set. Therefore, this study proposes a novel scheme, designated the Variation-based Coexpression Detection (VCD) algorithm, to analyze the trends of expressions based on their variation over time. The proposed algorithm has two advantages. First, it is unnecessary to determine the number of clusters in advance since the algorithm automatically detects those genes whose profiles are grouped together and creates patterns for these groups. Second, the algorithm features a new measurement criterion for calculating the degree of change of the expressions between adjacent time points and evaluating their trend similarities. Three real-world microarray data sets are employed to evaluate the performance of the proposed algorithm.", "paper_title": "Novel algorithm for coexpression detection in time-varying microarray data sets", "paper_id": "WOS:000253417100011"}