{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "algorithmic_complexity"}, {"score": 0.010802297306624912, "phrase": "turing_machines"}, {"score": 0.009840742621531994, "phrase": "inductive_turing_machines"}, {"score": 0.006806525621094489, "phrase": "halting_problem"}, {"score": 0.006424963696073163, "phrase": "turing_machine"}, {"score": 0.00470341117804131, "phrase": "different_algorithmic_problems"}, {"score": 0.0039218440805789965, "phrase": "superrecursive_algorithms"}, {"score": 0.0037013897043518614, "phrase": "n_inputs"}, {"score": 0.0032697235411641695, "phrase": "algorithmic_problems"}, {"score": 0.002646880721119838, "phrase": "first_order"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Kolmogorov complexity", " recursive algorithmic complexity", " inductive turing machine", " algorithmic problem", " inductive algorithmic complexity", " decidability", " super-recursive algorithm"], "paper_abstract": "There is a dependency between computability of algorithmic complexity and decidability of different algorithmic problems. It is known that computability of the algorithmic complexity C(x) is equivalent to decidability of the halting problem for Turing machines. Here we extend this result to the realm of superrecursive algorithms, considering algorithmic complexity for inductive Turing machines. We study two types of algorithmic complexity: recursive (classical) and inductive algorithmic complexities. Relations between these types of algorithmic complexity and decidability of algorithmic problems for Turing machines and inductive Turing machines are considered. In particular, it is demonsrated that computability of algorithmic complexity is equivalent not only to decidability of the halting problem, but also to decidability by inductive Turing machines of the first order of many other problems for Turing machines, such as: if a Turing machine computes a recursive (total) function; if a Turing machine gives no result only for n inputs; if a Turing machine gives results only for n inputs. (c) 2007 Elsevier B.V. All rights reserved.", "paper_title": "Algorithmic complexity as a criterion of unsolvability", "paper_id": "WOS:000249704200008"}