{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "network_lifetime"}, {"score": 0.015579956801677888, "phrase": "directional_sensor_networks"}, {"score": 0.00881742340430668, "phrase": "proposed_algorithms"}, {"score": 0.004728780808284175, "phrase": "adjustable_sensing_ranges"}, {"score": 0.00447937340641839, "phrase": "target_coverage_problem"}, {"score": 0.004167086373747367, "phrase": "single_power_level"}, {"score": 0.003983016985197904, "phrase": "real_applications"}, {"score": 0.00389404213807752, "phrase": "multiple_power_levels"}, {"score": 0.003841610436545169, "phrase": "different_sensing_ranges"}, {"score": 0.0038070472635126276, "phrase": "power_consumptions"}, {"score": 0.003249966782844541, "phrase": "maximum_network_lifetime"}, {"score": 0.003220709449062307, "phrase": "adjustable_ranges"}, {"score": 0.0026634937939104177, "phrase": "extensive_experiments"}, {"score": 0.002603918128553617, "phrase": "obtained_results"}, {"score": 0.0021727640931660038, "phrase": "crown_copyright"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Directional sensor networks", " Cover set formation", " Scheduling algorithms"], "paper_abstract": "During recent years, several efficient algorithms have been designed for solving the target coverage problem in directional sensor networks (DSNs). Conventionally, it is assumed that sensors have a single power level. Though, it is clear that, in real applications, sensors may have multiple power levels that determine different sensing ranges and power consumptions. One of the most significant challenges associated with the DSNs is monitoring all the targets in a given area and, at the same time, maximizing the network lifetime. In this paper, this issue is known as Maximum Network Lifetime with Adjustable Ranges (MNLAR) which has not been already studied in the DSNs. In this paper, we propose two heuristic algorithms (Algorithms 1 and 2) to solve the problem. In order to evaluate the performance of the proposed algorithms, extensive experiments were conducted. The obtained results were compared to a theoretical upper bound in order to measure the quality of the solutions provided by the proposed algorithms. The results demonstrated that Algorithm 2 was more successful than Algorithm 1 in terms of extending the network lifetime. Crown Copyright (C) 2014 Published by Elsevier Ltd. All rights reserved.", "paper_title": "Heuristic methods to maximize network lifetime in directional sensor networks with adjustable sensing ranges", "paper_id": "WOS:000347769900002"}