{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "robust_solutions"}, {"score": 0.04966229511350135, "phrase": "constraint_satisfaction_problems"}, {"score": 0.04924934083174297, "phrase": "discrete_and_ordered_domains"}, {"score": 0.048433181540646186, "phrase": "constraint_programming"}, {"score": 0.028677079830357485, "phrase": "valid_tuple"}, {"score": 0.004278807087784626, "phrase": "uncertain_and_dynamic_environments"}, {"score": 0.004204602964512469, "phrase": "initial_constraints"}, {"score": 0.0036553070575015344, "phrase": "important_issue"}, {"score": 0.003408091901859624, "phrase": "uncertain_and_dynamic_environment"}, {"score": 0.00266693888510356, "phrase": "problem_constraints"}, {"score": 0.002443206010337041, "phrase": "valid_tuples"}, {"score": 0.002328238264850759, "phrase": "new_concept"}, {"score": 0.002218668420806254, "phrase": "best_solution"}, {"score": 0.0021896891011033105, "phrase": "modeled_wcsp"}, {"score": 0.0021049977753042253, "phrase": "original_csp"}], "paper_keywords": ["Robustness", " Uncertainty", " Dynamism", " Dynamic constraint satisfaction problems (DynCSPs)"], "paper_abstract": "Constraint programming is a paradigm wherein relations between variables are stated in the form of constraints. Many real life problems come from uncertain and dynamic environments, where the initial constraints and domains may change during its execution. Thus, the solution found for the problem may become invalid. The search for robust solutions for constraint satisfaction problems (CSPs) has become an important issue in the field of constraint programming. In some cases, there exists knowledge about the uncertain and dynamic environment. In other cases, this information is unknown or hard to obtain. In this paper, we consider CSPs with discrete and ordered domains where changes only involve restrictions or expansions of domains or constraints. To this end, we model CSPs as weighted CSPs (WCSPs) by assigning weights to each valid tuple of the problem constraints and domains. The weight of each valid tuple is based on its distance from the borders of the space of valid tuples in the corresponding constraint/domain. This distance is estimated by a new concept introduced in this paper: coverings. Thus, the best solution for the modeled WCSP can be considered as a most robust solution for the original CSP according to these assumptions.", "paper_title": "Finding robust solutions for constraint satisfaction problems with discrete and ordered domains by coverings", "paper_id": "WOS:000358249300001"}