{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "mobile_robot"}, {"score": 0.015473042084887215, "phrase": "single_curvature_trajectory"}, {"score": 0.009544707504871405, "phrase": "moving_object"}, {"score": 0.004663396040465122, "phrase": "fixed_rotation_radius"}, {"score": 0.004540734419151103, "phrase": "optimal_trajectory_plan"}, {"score": 0.0038900709793274484, "phrase": "mobile_robot_increases"}, {"score": 0.0038283058265876713, "phrase": "travel_distance"}, {"score": 0.0037474693720823643, "phrase": "tracking_errors"}, {"score": 0.0035150223642728437, "phrase": "small_rotation_radius"}, {"score": 0.0032793933580835574, "phrase": "constant_and_large_rotation_radius"}, {"score": 0.0031760175583084274, "phrase": "optimal_trajectory"}, {"score": 0.0030595112110658675, "phrase": "tracking_error"}, {"score": 0.0025514745448798385, "phrase": "pre-determined_initial_states"}, {"score": 0.002393034183276193, "phrase": "final_states"}, {"score": 0.0022087165619569006, "phrase": "real_experiments"}, {"score": 0.0021049977753042253, "phrase": "proposed_algorithm"}], "paper_keywords": ["Differential driving mobile robot", " Single curvature", " Path planning", " Tracking error"], "paper_abstract": "A single curvature trajectory with a fixed rotation radius is proposed for an optimal trajectory plan for a differential driving mobile robot to capture a moving object. Generally, when the differential driving mobile robot moves along a path whose rotation radius is not constant, the tracking error of the mobile robot increases with the travel distance. Also, tracking errors increase greatly when the mobile robot follows a trajectory, with a small rotation radius. Based on these two observations, a single curvature trajectory, which has a constant and large rotation radius, is proposed as an optimal trajectory, in order to minimize the tracking error of the differential driving mobile robot. This paper first reviews the characteristics of a single curvature trajectory. Next, an algorithm to capture a moving object precisely is proposed using the single curvature trajectory. With the pre-determined initial states (i.e., position and orientation of the mobile robot and the final states), the mobile robot is made to capture a moving object. Through simulations and real experiments using a two DOF wheel-based mobile robot, the effectiveness of the proposed algorithm is verified. (C) 2008 Elsevier Ltd. All rights reserved.", "paper_title": "A precise curved motion planning for a differential driving mobile robot", "paper_id": "WOS:000260888200004"}