{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "software_evolution"}, {"score": 0.0046240999614456605, "phrase": "systematic_literature_review"}, {"score": 0.004289419884432487, "phrase": "mature_field"}, {"score": 0.003978866233891427, "phrase": "controversial_studies"}, {"score": 0.0036694287631595995, "phrase": "first_part"}, {"score": 0.0033257460346754687, "phrase": "software_industry_environments"}, {"score": 0.0031937337757356526, "phrase": "new_paradigms"}, {"score": 0.0028944757265206332, "phrase": "last_time"}, {"score": 0.00273167822885383, "phrase": "latter_period"}, {"score": 0.00265373679629359, "phrase": "systematic_and_comprehensive_literature_review"}, {"score": 0.002418923027024191, "phrase": "software_evolution_field"}, {"score": 0.002309408211203032, "phrase": "current_state"}, {"score": 0.0021049977753042253, "phrase": "research_community"}], "paper_keywords": ["Management", " Laws of software evolution", " software evolution"], "paper_abstract": "After more than 40 years of life, software evolution should be considered as a mature field. However, despite such a long history, many research questions still remain open, and controversial studies about the validity of the laws of software evolution are common. During the first part of these 40 years, the laws themselves evolved to adapt to changes in both the research and the software industry environments. This process of adaption to new paradigms, standards, and practices stopped about 15 years ago, when the laws were revised for the last time. However, most controversial studies have been raised during this latter period. Based on a systematic and comprehensive literature review, in this article, we describe how and when the laws, and the software evolution field, evolved. We also address the current state of affairs about the validity of the laws, how they are perceived by the research community, and the developments and challenges that are likely to occur in the coming years.", "paper_title": "The Evolution of the Laws of Software Evolution: A Discussion Based on a Systematic Literature Review", "paper_id": "WOS:000330778700014"}