{"auto_keywords": [{"score": 0.03619896230029729, "phrase": "individual_time_series"}, {"score": 0.00481495049065317, "phrase": "challenging_task"}, {"score": 0.004777744121315302, "phrase": "time-course_microarray_data_analysis"}, {"score": 0.004578165674080246, "phrase": "multiple_replicates"}, {"score": 0.004421063493736839, "phrase": "novel_cluster"}, {"score": 0.004252793268613575, "phrase": "highly_correlated_genes"}, {"score": 0.0042035670399069485, "phrase": "main_idea"}, {"score": 0.004154908228936342, "phrase": "proposed_method"}, {"score": 0.003965818535880531, "phrase": "individual_temporal_series"}, {"score": 0.0035024506353894644, "phrase": "gene_groups"}, {"score": 0.0032786537599187125, "phrase": "real-world_time_series"}, {"score": 0.003178326919668771, "phrase": "co-expressed_genes"}, {"score": 0.003033546013625887, "phrase": "shape-based_clustering_methods"}, {"score": 0.002917931350071647, "phrase": "similar_gene_expression_patterns"}, {"score": 0.0027102313244646934, "phrase": "proposed_cluster_merging_method"}, {"score": 0.0026580683046325253, "phrase": "meaningful_gene_groups"}, {"score": 0.0023746766301040974, "phrase": "information_correlation_coefficient"}, {"score": 0.002356282242320051, "phrase": "new_problem-specific_relevant_measures"}, {"score": 0.0022841153001549193, "phrase": "cluster_merging_method"}, {"score": 0.00224013518726087, "phrase": "biological_perspective"}, {"score": 0.0021463304704817873, "phrase": "mean_value"}, {"score": 0.0021297010898172534, "phrase": "time_series"}], "paper_keywords": ["Microarray analysis", " clustering time series", " merging methods"], "paper_abstract": "A challenging task in time-course microarray data analysis is to cluster genes meaningfully combining the information provided by multiple replicates covering the same key time points. This paper proposes a novel cluster merging method to accomplish this goal obtaining groups with highly correlated genes. The main idea behind the proposed method is to generate a clustering starting from groups created based on individual temporal series (representing different biological replicates measured in the same time points) and merging them by taking into account the frequency by which two genes are assembled together in each clustering. The gene groups at the level of individual time series are generated using several shape-based clustering methods. This study is focused on a real-world time series microarray task with the aim to find co-expressed genes related to the production and growth of a certain bacteria. The shape-based clustering methods used at the level of individual time series rely on identifying similar gene expression patterns over time which, in some models, are further matched to the pattern of production/growth. The proposed cluster merging method is able to produce meaningful gene groups which can be naturally ranked by the level of agreement on the clustering among individual time series. The list of clusters and genes is further sorted based on the information correlation coefficient and new problem-specific relevant measures. Computational experiments and results of the cluster merging method are analyzed from a biological perspective and further compared with the clustering generated based on the mean value of time series and the same shape-based algorithm.", "paper_title": "A CLUSTER MERGING METHOD FOR TIME SERIES MICROARRAY WITH PRODUCTION VALUES", "paper_id": "WOS:000340463300002"}