{"auto_keywords": [{"score": 0.047510470298773616, "phrase": "error_strategy"}, {"score": 0.040680876326988025, "phrase": "control_knowledge"}, {"score": 0.015325074276747772, "phrase": "generalisation_process"}, {"score": 0.00481495049065317, "phrase": "automatic_revision"}, {"score": 0.004441236717408874, "phrase": "major_issue"}, {"score": 0.004408729661992651, "phrase": "national_mapping_agencies"}, {"score": 0.0035233696341819437, "phrase": "fastidious_task"}, {"score": 0.0034464962568390265, "phrase": "automatic_knowledge_revision"}, {"score": 0.0031669873302916, "phrase": "new_elements"}, {"score": 0.0030638704739988595, "phrase": "offline_knowledge_revision_approach"}, {"score": 0.002888747754856871, "phrase": "outcoming_logs"}, {"score": 0.00275383721396097, "phrase": "production_rules"}, {"score": 0.0026446021865907197, "phrase": "automated_generalisation"}, {"score": 0.00257735013358606, "phrase": "generalisation_model"}, {"score": 0.002530359917257626, "phrase": "initial_data"}, {"score": 0.00241214634516517, "phrase": "target_map's_scale"}], "paper_keywords": ["automated generalisation", " rule revision", " trial and error strategy"], "paper_abstract": "Automating the generalisation process, a major issue for national mapping agencies, is extremely complex. Several works have proposed to deal with this complexity using a trial and error strategy. The performance of systems based on such a strategy is directly dependent on the quality of the control knowledge (i.e. heuristics) used to guide the trials. Unfortunately, most of the time, the definition and updation of knowledge is a fastidious task. In this context, automatic knowledge revision can not only improve the performance of the generalisation, but also allow it to automatically adapt to various usages and evolve when new elements are introduced. In this article, an offline knowledge revision approach is proposed, based on a logging of the system and on the analysis of outcoming logs. This approach is dedicated to the revision of control knowledge expressed by production rules. We have implemented and tested this approach for the automated generalisation of groups of buildings within a generalisation model called AGENT, from initial data that reference a scale of approximately 1: 15,000 compared with the target map's scale of 1: 50,000. The results show that our approach improves the quality of the control knowledge and thus the performance of the system. Moreover, the approach proposed is generic and can be applied to other systems based on a trial and error strategy, dedicated to generalisation or not.", "paper_title": "Automatic revision of rules used to guide the generalisation process in systems based on a trial and error strategy", "paper_id": "WOS:000298360200004"}