{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "fuzzy_clustering"}, {"score": 0.004529696178827392, "phrase": "perfect_knowledge"}, {"score": 0.004401342842183475, "phrase": "uncertain_information"}, {"score": 0.004354149483556514, "phrase": "imperfect_expressions"}, {"score": 0.004322967486451877, "phrase": "pattern_sets"}, {"score": 0.00397996666534913, "phrase": "fuzzy_sets"}, {"score": 0.003951453722517865, "phrase": "fuzzy_membership_values"}, {"score": 0.003923144245133288, "phrase": "assignment_availability"}, {"score": 0.0037710151976096985, "phrase": "fuzzy_memberships"}, {"score": 0.003637822529522622, "phrase": "involves_uncertainty"}, {"score": 0.003509317669345521, "phrase": "fuzzy_membership_assignment"}, {"score": 0.0034220655476652683, "phrase": "fuzzy_membership_design"}, {"score": 0.0030830390264125923, "phrase": "fuzzifer_parameter_m"}, {"score": 0.002984794722633428, "phrase": "final_c-partition"}, {"score": 0.002952745241052452, "phrase": "fuzzy_c-means"}, {"score": 0.0028279422436488116, "phrase": "fuzzifier_m"}, {"score": 0.0025568135952982345, "phrase": "fuzzifier_m."}, {"score": 0.002457555137617557, "phrase": "fcm"}], "paper_keywords": ["fuzzy C-means (FCM)", " fuzzy clustering", " interval type-2 fuzzy sets", " type-2 fuzzy sets"], "paper_abstract": "In many pattern recognition applications, it may be impossible in most cases to obtain perfect knowledge or information for a given pattern set. Uncertain information can create imperfect expressions for pattern sets in various pattern recognition algorithms. Therefore, various types of uncertainty may be taken into account when performing several pattern recognition methods. When one performs clustering with fuzzy sets, fuzzy membership values express assignment availability of patterns for clusters. However, when one assigns fuzzy memberships to a pattern set, imperfect information for a pattern set involves uncertainty which exist in the various parameters that are used in fuzzy membership assignment. When one encounters fuzzy clustering, fuzzy membership design includes various uncertainties (e.g., distance measure, fuzzifier, prototypes, etc.). In this paper, we focus on the uncertainty associated with the fuzzifer parameter m that controls the amount of fuzziness of the final C-partition in the fuzzy C-means (FCM) algorithm. To design and manage uncertainty for fuzzifier m, we extend a pattern set to interval type-2 fuzzy sets using two fuzzifiers m(1) and m(2) which creates a footprint of uncertainty (FOU) for the fuzzifier m. Then, we incorporate this interval type-2 fuzzy set into FCM to observe the effect of managing uncertainty from the two fuzzifiers. We also provide some solutions to type-reduction and defuzzification (i.e., cluster center updating and hard-partitioning) in FCM. Several experimental results are given to show the validity of our method.", "paper_title": "Uncertain fuzzy clustering: Interval type-2 fuzzy approach to C-means", "paper_id": "WOS:000244803400009"}