{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "manipulation_actions"}, {"score": 0.004724020632103649, "phrase": "hand-object_relations"}, {"score": 0.004489810932879285, "phrase": "different_actions"}, {"score": 0.003953639783762917, "phrase": "manipulation_types"}, {"score": 0.003829877278269543, "phrase": "underlying_principles"}, {"score": 0.00337224813954299, "phrase": "temporal_anchor"}, {"score": 0.002733260122876447, "phrase": "relatively_small_tree-like_manipulation_ontology"}, {"score": 0.0024063484128685367, "phrase": "additional_important_information"}, {"score": 0.0023013968622710847, "phrase": "trajectory_shapes"}, {"score": 0.0022722584151582616, "phrase": "relative_poses"}, {"score": 0.0021593396036472777, "phrase": "highly_condensed_representation"}, {"score": 0.0021049977753042253, "phrase": "different_manipulations"}], "paper_keywords": ["Manipulation action", " manipulation ontology", " scene graph", " semantic event chain"], "paper_abstract": "Humans can perform a multitude of different actions with their hands (manipulations). In spite of this, so far there have been only a few attempts to represent manipulation types trying to understand the underlying principles. Here we first discuss how manipulation actions are structured in space and time. For this we use as temporal anchor points those moments where two objects (or hand and object) touch or un-touch each other during a manipulation. We show that by this one can define a relatively small tree-like manipulation ontology. We find less than 30 fundamental manipulations. The temporal anchors also provide us with information about when to pay attention to additional important information, for example when to consider trajectory shapes and relative poses between objects. As a consequence a highly condensed representation emerges by which different manipulations can be recognized and encoded. Examples of manipulations recognition and execution by a robot based on this representation are given at the end of this study.", "paper_title": "A Simple Ontology of Manipulation Actions Based on Hand-Object Relations", "paper_id": "WOS:000320580500002"}