{"auto_keywords": [{"score": 0.016622500652519523, "phrase": "dsif"}, {"score": 0.010612375857833744, "phrase": "distributed_service_invocation_function"}, {"score": 0.005484515633749791, "phrase": "filter_criteria"}, {"score": 0.0047735489327932114, "phrase": "ip_multimedia_subsystem"}, {"score": 0.004718897469501381, "phrase": "standard_ims_framework"}, {"score": 0.004678317945062391, "phrase": "value-added_service"}, {"score": 0.0046114557978424245, "phrase": "application_server"}, {"score": 0.0045324756541157574, "phrase": "expected_event"}, {"score": 0.00429114801805935, "phrase": "sip_signaling_path"}, {"score": 0.004217630522974106, "phrase": "call_progress"}, {"score": 0.004133443893051179, "phrase": "sip_messages"}, {"score": 0.0034571978126010073, "phrase": "unnecessary_relay"}, {"score": 0.0033300397189425304, "phrase": "current_ims_infrastructure"}, {"score": 0.003216804708106142, "phrase": "existing_ims_core"}, {"score": 0.0031253798902093457, "phrase": "sip_dialogs"}, {"score": 0.003071774206474099, "phrase": "as."}, {"score": 0.0030029445423298967, "phrase": "core"}, {"score": 0.002553992825810561, "phrase": "c-sif"}, {"score": 0.002288761966815233, "phrase": "service_invocation"}, {"score": 0.0022300809511147305, "phrase": "shorter_service_invocation_time"}, {"score": 0.0022108561281356863, "phrase": "lower_message_transmission_cost"}, {"score": 0.0021417691855960715, "phrase": "open_ims_core_platform"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["IP multimedia subsystem (IMS)", " Session initial protocol (SIP)", " Call and session control function (CSCF)", " Service control"], "paper_abstract": "Within the standard IMS framework, the value-added service is executed in the Application Server (AS) when the expected event happens. In order to be aware of the event, the AS should be inserted into the SIP signaling path at the beginning of the call to monitor the call progress. As a result, all SIP messages related to the session have to be relayed to the AS to determine whether the service is to be executed or not. However, some services are rarely executed: that is, the procedure of relaying messages to the AS seems unnecessary for most cases of these services. This paper proposes a distributed service invocation function (DSIF) to eliminate the unnecessary relay. The DSIF works as an overlay on the top of the current IMS infrastructure that enables operators to deploy it without any change in the existing IMS core; thus, it can be applied transparently to SIP dialogs between the S-CSCF and the AS. The DSIF consists of two functional entities: the Core network-SIF (C-SIF) and the Application side-SIF (A-SIF), and one database node: DB-DSIF. The C-SIF is responsible for allowing the messages to be relayed to the AS only when the service really needs to be executed. The operation of C-SIF is based on two new defined types of filter criteria: trigger Filter Criteria (tFC) and execution Filter Criteria (eFC), which are stored in the DB-DSIF. The A-SIF is in charge of interacting with the AS for service invocation. Our study indicates that the DSIF achieves a shorter service invocation time with a lower message transmission cost. We also demonstrate its feasibility by implementing a prototype on Open IMS Core platform. (C) 2010 Elsevier B.V. All rights reserved.", "paper_title": "Design and implementation of a distributed service invocation function for the IP multimedia subsystem", "paper_id": "WOS:000291417200007"}