{"auto_keywords": [{"score": 0.03973761244758953, "phrase": "full-duplex_performance"}, {"score": 0.03886698645129167, "phrase": "direct_link"}, {"score": 0.03586196713634813, "phrase": "optimal_tradeoff"}, {"score": 0.00481495049065317, "phrase": "strategies_necessary"}, {"score": 0.004678785623021003, "phrase": "simple_question"}, {"score": 0.0046253989970108985, "phrase": "dynamic_relaying_strategies"}, {"score": 0.004559517609828423, "phrase": "diversity-multiplexing_tradeoff"}, {"score": 0.004494570360108983, "phrase": "half-duplex_wireless_relay_networks"}, {"score": 0.004417848254181138, "phrase": "apparently_two_contrasting_results"}, {"score": 0.00436742595270452, "phrase": "simple_three-node_network"}, {"score": 0.0043299856054821355, "phrase": "single_half-duplex_relay"}, {"score": 0.003461179243777302, "phrase": "static_schedule"}, {"score": 0.0032585499655442404, "phrase": "general_case"}, {"score": 0.0030854280671143556, "phrase": "dynamic_schedules"}, {"score": 0.003032686676675628, "phrase": "static_schedules"}, {"score": 0.0029552551661591988, "phrase": "single-relay_channel"}, {"score": 0.002664749302333897, "phrase": "best_achievable_tradeoff"}, {"score": 0.0026494723416072316, "phrase": "channel_state_information"}, {"score": 0.0025892330566358503, "phrase": "natural_next_question"}, {"score": 0.002294686545883412, "phrase": "received_channel_state_information"}, {"score": 0.002166421738415464, "phrase": "optimal_dmt"}, {"score": 0.002147809092768899, "phrase": "parallel_channel"}, {"score": 0.0021049977753042253, "phrase": "static_qmf_strategies"}], "paper_keywords": ["Diversity-multiplexing tradeoff", " half-duplex", " relay networks", " relay scheduling", " dynamic-decode-forward", " quantize-map-forward"], "paper_abstract": "In this paper, we study a simple question: when are dynamic relaying strategies essential in optimizing the diversity-multiplexing tradeoff (DMT) in half-duplex wireless relay networks? This is motivated by apparently two contrasting results even for a simple three-node network with a single half-duplex relay. When all channels in the system are assumed to be independent and identically fading, a static schedule where the relay listens half the time and transmits half the time combined with quantize-map-and-forward (QMF) relaying is known to achieve the full-duplex performance. However, when there is no direct link between the source and the destination, a dynamic decode-and-forward (DDF) strategy is needed to achieve the optimal tradeoff. In this case, a static schedule is strictly suboptimal and the optimal tradeoff is significantly worse than the full-duplex performance. In this paper, we study the general case when the direct link is neither as strong as the other links nor fully nonexistent, and identify regimes where dynamic schedules are necessary and those where static schedules are enough. We identify four qualitatively different regimes for the single-relay channel, where the tradeoff between diversity and multiplexing is significantly different. We show that in all these regimes one of the above two strategies is sufficient to achieve the optimal tradeoff by developing a new upper bound on the best achievable tradeoff under channel state information available only at the receivers. A natural next question is whether these two strategies are sufficient to achieve the DMT of more general half-duplex wireless networks with a larger number of relays. We propose a generalization of the two existing schemes through a dynamic QMF (DQMF) strategy, where the relay listens for a fraction of time depending on received channel state information but not long enough to be able to decode. We show that such a DQMF strategy is needed to achieve the optimal DMT in a parallel channel with two relays, outperforming both DDF and static QMF strategies.", "paper_title": "When Are Dynamic Relaying Strategies Necessary in Half-Duplex Wireless Networks?", "paper_id": "WOS:000351470800014"}