{"auto_keywords": [{"score": 0.04858132305104682, "phrase": "pervasive_computing"}, {"score": 0.00481495049065317, "phrase": "problems_people"}, {"score": 0.004720269202737973, "phrase": "kitchen_tasks"}, {"score": 0.004342430078306461, "phrase": "multi-step_tasks"}, {"score": 0.004074901471704325, "phrase": "daily_tasks"}, {"score": 0.0037935066882208235, "phrase": "six_people"}, {"score": 0.0037336520904376687, "phrase": "moderate_dementia"}, {"score": 0.0037040785566765954, "phrase": "video_recorded_performing_activities"}, {"score": 0.0036311617742547167, "phrase": "familiar_context"}, {"score": 0.0031592690527974285, "phrase": "video_recordings"}, {"score": 0.003097043800165555, "phrase": "adapted_version"}, {"score": 0.0030602966787192745, "phrase": "action_coding_system"}, {"score": 0.002882980094838904, "phrase": "data-driven_analysis"}, {"score": 0.00252812242767189, "phrase": "detailed_examples"}, {"score": 0.0022977342663599042, "phrase": "pervasive_computing_solutions"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Assistive technology", " Dementia", " Pervasive computing"], "paper_abstract": "Technologies from pervasive computing can be used to ameliorate the difficulties that people with dementia have with multi-step tasks. This paper is intended to inform the design of technologies that help people perform daily tasks, by prompting them when they have difficulties, thus fostering independence and quality of life. Six people with mild to moderate dementia were video recorded performing activities of their own choosing in the familiar context of their own kitchens. In total there were 22 video recordings. Activities included making a cup of tea or coffee, a bowl of soup, beans on toast, or coffee with toast. The video recordings were transcribed using an adapted version of the Action Coding System. Incidents, where prompting was judged to be needed were categorised using a data-driven analysis as problems in: Sequencing (intrusion, omission and repetition), Finding things (locating and identifying), Operation of appliances, and Incoherence (toying and inactivity). Detailed examples of each type of incident, and the contexts in which it occurred, are provided as a resource for the design of pervasive computing solutions. What needs to be detected and what form prompts might take is specified for each category. (C) 2010 Elsevier B.V. All rights reserved.", "paper_title": "Problems people with dementia have with kitchen tasks: The challenge for pervasive computing", "paper_id": "WOS:000279078900003"}