{"auto_keywords": [{"score": 0.03601073868515248, "phrase": "series-parallel_networks"}, {"score": 0.027545792035977536, "phrase": "identical_users"}, {"score": 0.00481495049065317, "phrase": "network_congestion_games"}, {"score": 0.004551781491498328, "phrase": "computational_and_coordination_efficiency_issues"}, {"score": 0.0045010842036947146, "phrase": "nash"}, {"score": 0.004425616928975799, "phrase": "symmetric_network_congestion_games"}, {"score": 0.004278807087784626, "phrase": "simple_and_natural_greedy_method"}, {"score": 0.004183638135671596, "phrase": "pure_nash_equilibrium"}, {"score": 0.004090577229368418, "phrase": "traffic_congestion"}, {"score": 0.0036144035798673967, "phrase": "shortest_path_computation"}, {"score": 0.0032296377835432533, "phrase": "varying_demands"}, {"score": 0.003104849179057156, "phrase": "initial_network_traffic"}, {"score": 0.0023827927890399357, "phrase": "greedy_approach"}, {"score": 0.0022145052062614514, "phrase": "maximum_latency"}], "paper_keywords": [""], "paper_abstract": "We study computational and coordination efficiency issues of Nash equilibria in symmetric network congestion games. We first propose a simple and natural greedy method that computes a pure Nash equilibrium with respect to traffic congestion in a network. In this algorithm each user plays only once and allocates her traffic to a path selected via a shortest path computation. We then show that this algorithm works for series-parallel networks when users are identical or when users are of varying demands but have the same best response strategy for any initial network traffic. We also give constructions where the algorithm fails if either the above condition is violated (even for series-parallel networks) or the network is not series-parallel (even for identical users). Thus, we essentially indicate the limits of the applicability of this greedy approach. We also study the price of anarchy for the objective of maximum latency. We prove that for any network of m uniformly related links and for identical users, the price of anarchy is circle minus((logm)/(loglogm)).", "paper_title": "Symmetry in network congestion games: Pure equilibria and anarchy cost", "paper_id": "WOS:000236483500013"}