{"auto_keywords": [{"score": 0.05007852962010534, "phrase": "attacker_capabilities"}, {"score": 0.004775726266706856, "phrase": "risk_estimation"}, {"score": 0.00467905143301368, "phrase": "risk_exposure"}, {"score": 0.004565609517511076, "phrase": "information_system"}, {"score": 0.004276306563103443, "phrase": "existing_methods"}, {"score": 0.004224130367280183, "phrase": "threat_likelihood"}, {"score": 0.003988901168289797, "phrase": "existing_vulnerabilities"}, {"score": 0.003892126266260425, "phrase": "required_opportunities"}, {"score": 0.003400198866111204, "phrase": "related_threat"}, {"score": 0.003277140908834426, "phrase": "related_resources"}, {"score": 0.003056682083784002, "phrase": "risk_estimation_method"}, {"score": 0.002770389097966904, "phrase": "proposed_risk_estimation_method"}, {"score": 0.00219311232069446, "phrase": "threat_likelihoods"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Risk estimation", " Attack potential", " Attacker capabilities", " Risk mitigation", " Threat", " Uncertainty", " Empirical research"], "paper_abstract": "The risk exposure of a given threat to an information system is a function of the likelihood of the threat and the severity of its impacts. Existing methods for estimating threat likelihood assume that the attacker is able to cause a given threat, that exploits existing vulnerabilities, if s/he has the required opportunities (e.g., sufficient attack time) and means (e.g., tools and skills), which is not true; often, s/he can perform an attack and cause the related threat only if s/he has the ability to access related resources (objects) of the system that allow to do so. This paper proposes a risk estimation method that incorporates attacker capabilities in estimating the likelihood of threats as conditions for using the means and opportunities, demonstrates the use of the proposed risk estimation method through two examples: video conferencing systems and connected vehicles, shows that changing attacker capabilities changes the risks of the threats, and compares the uncertainty of experts in evaluating the likelihood of threats considering and not considering attacker capabilities for two experiments. The results of the experiments suggest that experts are less uncertain about their estimations of threat likelihoods when they consider attacker capabilities. (C) 2015 Elsevier Ltd. All rights reserved.", "paper_title": "Incorporating attacker capabilities in risk estimation and mitigation", "paper_id": "WOS:000354343600004"}