{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "model_elements"}, {"score": 0.004734448316824488, "phrase": "model-driven_engineering"}, {"score": 0.004500891637057374, "phrase": "model-driven_architecture"}, {"score": 0.0043699845927285905, "phrase": "full_artifacts"}, {"score": 0.004278807087784626, "phrase": "so-called_structured_\"model_space"}, {"score": 0.00413684709497912, "phrase": "submodel_relationship"}, {"score": 0.004016485454498076, "phrase": "structuring_effort"}, {"score": 0.003949280009382125, "phrase": "mde_practices"}, {"score": 0.0036450381529042133, "phrase": "typical_situation"}, {"score": 0.0036144035798673967, "phrase": "model_management"}, {"score": 0.0033078284621762817, "phrase": "dependency_constraints"}, {"score": 0.0029764767329116875, "phrase": "submodel_transitivity"}, {"score": 0.0029020077365708966, "phrase": "submodel_invariance"}, {"score": 0.0023794391656001466, "phrase": "last_part"}, {"score": 0.002280990744438186, "phrase": "related_works"}], "paper_keywords": ["Submodel", " Set-theoretic formalization", " Model extraction", " Model composition"], "paper_abstract": "Model-driven engineering (MDE) generalized the status of models from documentation or model-driven architecture (MDA) modeling steps to full artifacts, members of a so-called structured \"model space\". We concentrate here on the submodel relationship which contributes a lot to this structuring effort. Many works and MDE practices resort to this notion and call for its precise characterization, which is the intent of this paper. A typical situation is model management through repositories. We start from the definition of a model as a set of model elements plus a set of dependency constraints that it asserts over these elements. This allows to isolate the notions of closed, covariant and invariant submodels. As a major result, we show that submodel transitivity can be guaranteed thanks to submodel invariance. This formalization offers keys to analyze operations which manipulate submodels. For example, we deeply study the operator which consists in extracting a model from another one, when selecting some subset of its elements. The same can be applied to many other model operations and the last part of the paper is dedicated to a synthesis on related works which could profit from this characterization. More practically, we show how the results were exploited in our Eclipse modeling environment.", "paper_title": "From subsets of model elements to submodels", "paper_id": "WOS:000354094400021"}