{"auto_keywords": [{"score": 0.048473682866815936, "phrase": "tree_patterns"}, {"score": 0.015719716506582538, "phrase": "patterns_property"}, {"score": 0.013770002986779006, "phrase": "tree_pattern"}, {"score": 0.0047647015968697425, "phrase": "tree_pattern_query_rewriting"}, {"score": 0.0037822235317605713, "phrase": "single_pattern"}, {"score": 0.003432044343307207, "phrase": "polynomial_time_algorithm"}, {"score": 0.0034141042072642577, "phrase": "xu"}, {"score": 0.0032649758151918158, "phrase": "contained_rewritings"}, {"score": 0.0032308499661512155, "phrase": "exponential_time"}, {"score": 0.0032054891061528896, "phrase": "worst_case"}, {"score": 0.0031553611552558986, "phrase": "q._second"}, {"score": 0.0031223774204093713, "phrase": "set_s"}, {"score": 0.002931569771634119, "phrase": "query_q"}, {"score": 0.0027596331277401766, "phrase": "thousand_s"}, {"score": 0.002645992747675361, "phrase": "minimum_number"}, {"score": 0.002570584329885122, "phrase": "virtual_schema"}, {"score": 0.0025503930258942062, "phrase": "mediated_data_integration_system"}, {"score": 0.0025237171554924128, "phrase": "repeated_calculation"}, {"score": 0.00251048377083841, "phrase": "query_optimization"}, {"score": 0.0024842242921857705, "phrase": "first_problem"}, {"score": 0.002375644084384217, "phrase": "single_tree_pattern"}, {"score": 0.0023507916951658455, "phrase": "second_problem"}, {"score": 0.0021272571908168333, "phrase": "multiple_views"}, {"score": 0.0021049977753042253, "phrase": "schema_graph"}], "paper_keywords": ["XPath", " tree pattern", " views", " containment", " rewriting"], "paper_abstract": "We show that several classes of tree patterns observe the independence of containing patterns property, that is, if a pattern is contained in the union of several patterns, then it is contained in one of them. We apply this property to two related problems on tree pattern rewriting using views. First, given view V and query Q, is it possible for Q to have an equivalent rewriting using V which is the union of two or more tree patterns, but not an equivalent rewriting which is a single pattern? This problem is of both theoretical and practical importance because, if the answer is no, then, to find an equivalent rewriting of a tree pattern using a view, we should use more efficient methods, such as the polynomial time algorithm of Xu and A-zsoyoglu (2005), rather than try to find the union of all contained rewritings (which takes exponential time in the worst case) and test its equivalence to Q. Second, given a set S of views, we want to know under what conditions a subset S' of S is redundant in the sense that for any query Q, the contained rewritings of Q using the views in S' are contained in those using the views in S -aEuro parts per thousand S'. Solving this problem can help us to, for example, choose the minimum number of views to be cached, or better design the virtual schema in a mediated data integration system, or avoid repeated calculation in query optimization. For the first problem, we identify several classes of tree patterns for which the equivalent rewriting can be expressed as a single tree pattern. For the second problem, we present necessary and sufficient conditions for S' to be redundant with respect to some classes of tree patterns. For both problems we consider extension to cases where there are rewritings using the intersection of multiple views and/or where a schema graph is present.", "paper_title": "Independence of Containing Patterns Property and Its Application in Tree Pattern Query Rewriting Using Views", "paper_id": "WOS:000263077700006"}