{"auto_keywords": [{"score": 0.046133894713162954, "phrase": "free_surface"}, {"score": 0.0061492216826273104, "phrase": "flow_transition"}, {"score": 0.00481495049065317, "phrase": "rotating_flow"}, {"score": 0.004771672073078768, "phrase": "large-deformed_free_surface"}, {"score": 0.004320421465896323, "phrase": "\"switching_phenomenon\"_process"}, {"score": 0.004167086373747367, "phrase": "rotating_disk"}, {"score": 0.004110993414942228, "phrase": "cylindrical_open_vessel"}, {"score": 0.0034467039994594065, "phrase": "anisotropic_flakes"}, {"score": 0.0033393377529146893, "phrase": "parabolic_shape"}, {"score": 0.00298238929037041, "phrase": "switching_phenomenon"}, {"score": 0.0028634235895823594, "phrase": "visualized_flow"}, {"score": 0.002675571068567923, "phrase": "free_surface_changes"}, {"score": 0.0021049977753042253, "phrase": "laminar_flow"}], "paper_keywords": ["rotating flow", " free surface", " flow transition", " visualization", " anisotropic flakes"], "paper_abstract": "This study aims to clarify the relationship between the deformation of a free surface and flow transition in a \"switching phenomenon\" process. In a flow driven by a rotating disk in a cylindrical open vessel, the free surface irregularly changes its shape from axisymmetric to nonaxisymmetric and vice versa with repeating up-and-down motion (so-called \"switching phenomenon\"). The flow under the free surface was visualized by anisotropic flakes. When the free surface assumes a parabolic shape, the flow is distinguished by three regions; local circulation region, rigid vortex region and meridional circulation region. The flow transition in the switching phenomenon was shown by snapshots and movies of the visualized flow; the flow near the free surface is laminar even if the shape of the free surface changes to nonaxisymmetric during the time at which the free surface attaches to the bottom of the vessel. After the free surface detaches from the disk, the flow near the free surface becomes turbulent. When the free surface changes to axisymmetric while descending to the bottom, the flow changes from turbulent to laminar flow and the local circulation region reemerges at the center of the vessel.", "paper_title": "Visualization of a rotating flow under large-deformed free surface using anisotropic flakes", "paper_id": "WOS:000254171100011"}