{"auto_keywords": [{"score": 0.04199668928862169, "phrase": "action_nominals"}, {"score": 0.013510002421607176, "phrase": "base_verb"}, {"score": 0.00481495049065317, "phrase": "lexical_account"}, {"score": 0.004766090327062509, "phrase": "event_nouns"}, {"score": 0.004646088032529303, "phrase": "deverbal_nominalisations"}, {"score": 0.003509006038574667, "phrase": "different_languages"}, {"score": 0.003438058620195309, "phrase": "romance_language"}, {"score": 0.0032336801561165113, "phrase": "verb_semantics"}, {"score": 0.0031845067058084613, "phrase": "selected_aspects"}, {"score": 0.002949598537993663, "phrase": "internal_structure"}, {"score": 0.0028170314398963704, "phrase": "morphological_suffix"}, {"score": 0.002731971103291716, "phrase": "partially_lexicalist_approach_view"}, {"score": 0.0025433263646920364, "phrase": "montagovian_generative_lexicon"}, {"score": 0.002416589459425828, "phrase": "retore"}, {"score": 0.0022961534630650347, "phrase": "montague_semantics"}, {"score": 0.002261204313587616, "phrase": "richer_type_system"}, {"score": 0.0022267859286766553, "phrase": "lexical_phenomena"}], "paper_keywords": ["Lexical semantics", " Compositional semantics", " Type theory"], "paper_abstract": "We propose a lexical account of event nouns, in particular of deverbal nominalisations, whose meaning is related to the event expressed by their base verb. The literature on nominalisations often assumes that the semantics of the base verb completely defines the structure of action nominals. We argue that the information in the base verb is not sufficient to completely determine the semantics of action nominals. We exhibit some data from different languages, especially from Romance language, which show that nominalisations focus on some aspects of the verb semantics. The selected aspects, however, seem to be idiosyncratic and do not automatically result from the internal structure of the verb nor from its interaction with the morphological suffix. We therefore propose a partially lexicalist approach view of deverbal nouns. It is made precise and computable by using the Montagovian generative lexicon, a type theoretical framework introduced by Bassac, Mery and Retore in this journal in 2010. This extension of Montague semantics with a richer type system easily incorporates lexical phenomena like the semantics of action nominals in particular deverbals, including their polysemy and (in) felicitous copredications.", "paper_title": "Deverbal Semantics and the Montagovian Generative Lexicon Lambda Ty(n)", "paper_id": "WOS:000209641100007"}