{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "packaged_software_selection"}, {"score": 0.008612497584444108, "phrase": "functionalist_literature"}, {"score": 0.00450933377534525, "phrase": "packaged_software_products"}, {"score": 0.003954837422946628, "phrase": "packaged_software_selection_process"}, {"score": 0.0037361664435836845, "phrase": "generic_recommendations"}, {"score": 0.0036393456309815166, "phrase": "rational_assumptions"}, {"score": 0.003408091901859624, "phrase": "\"best_technology_solution"}, {"score": 0.0031223774204093713, "phrase": "small_organisation"}, {"score": 0.002962543869356265, "phrase": "social_construction"}, {"score": 0.002898378776839434, "phrase": "theoretical_framework"}, {"score": 0.0022777800735119405, "phrase": "wider_environment"}, {"score": 0.002123531043641047, "phrase": "social_constructivism"}, {"score": 0.0021049977753042253, "phrase": "theoretical_support"}], "paper_keywords": ["Packaged Software", " Software Procurement", " Packaged Software Selection", " Social Shaping of Technology", " Social Construction of Technology", " Vendors"], "paper_abstract": "As organisations increasingly engage in the selection, purchase, and adoption of packaged software products, how these activities are carried out in practice becomes increasingly relevant for researchers and practitioners. Our focus in this paper is to propose a framework for understanding the packaged software selection process. The functionalist literature on this area of study suggests a number of generic recommendations, which are based on rational assumptions about the process and view the decision making that takes place as producing the \"best technology solution.'\" To explore this, we conducted a longitudinal, in-depth study of packaged software selection in a small organisation. For interpretation of the case, we draw upon the Social Construction of Technology, a theoretical framework arguing that technology is socially constituted and regarding the process of development as contradictory and uncertain. We offer a number of contributions. First, we further our understanding of packaged software selection with the critique that we offer of the functionalist literature, drawing insights from the emerging critical/constructivist literature and expanding our domain of interest to encompass the wider environment. Second, we weave this together with our experiences in the field, drawing on social constructivism for theoretical support, to develop a framework of packaged software selection that shows how various actors shape the process.", "paper_title": "The Social Shaping of Packaged Software Selection", "paper_id": "WOS:000277034300001"}