{"auto_keywords": [{"score": 0.03803384992967455, "phrase": "perfect_observation"}, {"score": 0.0148330533321302, "phrase": "probability_distribution"}, {"score": 0.012002552856869913, "phrase": "partial_observation"}, {"score": 0.009797957095652893, "phrase": "one-sided_games"}, {"score": 0.009134821057366386, "phrase": "almost-sure_and_positive_winning_strategies"}, {"score": 0.00481495049065317, "phrase": "belief_fails"}, {"score": 0.004781167345415497, "phrase": "two-player_finite-state_stochastic_games"}, {"score": 0.004508661664944657, "phrase": "successor_states"}, {"score": 0.004435169801977131, "phrase": "infinitely_many_rounds"}, {"score": 0.004362870617347183, "phrase": "infinite_path"}, {"score": 0.00429174492521036, "phrase": "reachability_objectives"}, {"score": 0.004261617028111862, "phrase": "first_player"}, {"score": 0.004211871140493766, "phrase": "target_state"}, {"score": 0.003229741076887151, "phrase": "actual_random_choice"}, {"score": 0.003081400693055518, "phrase": "full_randomization"}, {"score": 0.0030525578912808647, "phrase": "pure_strategies"}, {"score": 0.0028986672783671147, "phrase": "full_randomized_strategies"}, {"score": 0.002613709503583786, "phrase": "symbolic_algorithms"}, {"score": 0.0025892330566358503, "phrase": "explicit_exponential_construction"}, {"score": 0.0024994652850649428, "phrase": "nonelementary_memory"}, {"score": 0.002362249991637011, "phrase": "positive_and_almost-sure_winning"}, {"score": 0.002280333649167796, "phrase": "almost-sure_winning_problems"}, {"score": 0.002248366278757655, "phrase": "randomized_strategies"}, {"score": 0.002211635717713414, "phrase": "serious_flaws"}, {"score": 0.002201251672739811, "phrase": "previous_results"}, {"score": 0.0021049977753042253, "phrase": "exponential_upper"}], "paper_keywords": ["Verification", " Theory", " Algorithms", " Partial-observation games", " stochastic games", " reachability and Buchi objectives", " positive and almost-sure winning", " strategy complexity", " memory bounds"], "paper_abstract": "In two-player finite-state stochastic games of partial observation on graphs in every state of the graph the players simultaneously choose an action and their joint actions determine a probability distribution over the successor states. The game is played for infinitely many rounds and thus the players construct an infinite path in the graph. We consider reachability objectives where the first player tries to ensure a target state to be visited almost-surely (i.e., with probability 1) or positively (i.e., with positive probability) no matter the strategy of the second player. We classify such games according to the information and to the power of randomization available to the players. On the basis of information the game can be one-sided with either (a) player 1 or (b) player 2 having partial observation (and the other player has perfect observation) or two-sided with (c) both players having partial observation. On the basis of randomization (a) the players may not be allowed to use randomization (pure strategies) or (b) they may choose a probability distribution over actions but the actual random choice is external and not visible to the player (actions invisible) or (c) they may use full randomization. Our main results for pure strategies are as follows: (1) For one-sided games with player 2 having perfect observation we show that (in contrast to full randomized strategies) belief-based (subset-construction based) strategies are not sufficient and we present an exponential upper bound on memory both for almost-sure and positive winning strategies we show that the problem of deciding the existence of almost-sure and positive winning strategies for player 1 is EXPTIME-complete and present symbolic algorithms that avoid the explicit exponential construction. (2) For one-sided games with player 1 having perfect observation we show that nonelementary memory is both necessary and sufficient for both almost-sure and positive winning strategies. (3) We show that for the general (two-sided) case finite-memory strategies are sufficient for both positive and almost-sure winning and at least nonelementary memory is required. We establish the equivalence of the almost-sure winning problems for pure strategies and for randomized strategies with actions invisible. Our equivalence result exhibit serious flaws in previous results of the literature: we show a nonelementary memory lower bound for almost-sure winning whereas an exponential upper bound was previously claimed.", "paper_title": "Partial-Observation Stochastic Games: How to Win when Belief Fails", "paper_id": "WOS:000336005000006"}