{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "specified_interactions"}, {"score": 0.04714352860016274, "phrase": "specified_two-factor_interactions"}, {"score": 0.028235654210745895, "phrase": "general_procedure"}, {"score": 0.00443308765153716, "phrase": "main_effects"}, {"score": 0.004390192910013225, "phrase": "industrial_experiments"}, {"score": 0.004305639197085793, "phrase": "high_resolution"}, {"score": 0.004263972370406983, "phrase": "low_aberration"}, {"score": 0.004121275290411653, "phrase": "two-factor_interaction_effects"}, {"score": 0.0037392451233558234, "phrase": "graphical_methods"}, {"score": 0.0034760655218366, "phrase": "interaction_graphs"}, {"score": 0.003310951184365485, "phrase": "appropriate_linear_graphs"}, {"score": 0.0031536550157613974, "phrase": "interaction_graph"}, {"score": 0.003092842645798083, "phrase": "experimental_size"}, {"score": 0.002297949552105756, "phrase": "different_type"}, {"score": 0.002135995282374723, "phrase": "corresponding_rule"}], "paper_keywords": ["fractional factorial", " interactions", " orthogonal array"], "paper_abstract": "Engineers sometimes desire to investigate the significance of some specified two-factor interactions, other than main effects in industrial experiments. Designs of high resolution or low aberration could allow the estimation of some two-factor interaction effects. Unfortunately, it might not be easy to find designs that allow all the specified two-factor interactions to be estimated. Some graphical methods have been proposed for designing such experiments, however, all these graphical methods need linear graphs or interaction graphs available for assignments and all have their limitations. Finding appropriate linear graphs is sometimes time-consuming and there is no interaction graph available when the experimental size is greater than 16. In this article, we propose methods that do not require graphs for planning experiments with requirements of the estimation of some specified interactions. A general procedure is given first. Then using this general procedure, we develop several rules for the design of such experiments that requires the estimation of specified two-factor interactions in various structures. For each different type of structure, we use an example to illustrate how to proceed with the corresponding rule. (c) 2007 Elsevier B.V. All rights reserved.", "paper_title": "Planning experiments when some specified interactions are investigated", "paper_id": "WOS:000246606000004"}