{"auto_keywords": [{"score": 0.04886253174130505, "phrase": "review_articles"}, {"score": 0.015015735488192329, "phrase": "brazil"}, {"score": 0.00481495049065317, "phrase": "brazil's_growing_production"}, {"score": 0.004752062705886638, "phrase": "average_number"}, {"score": 0.004620688471484568, "phrase": "scientific_fields"}, {"score": 0.004538171020165214, "phrase": "new_knowledge"}, {"score": 0.004434229146194447, "phrase": "scientific_production"}, {"score": 0.004388796975264762, "phrase": "programa"}, {"score": 0.004115161146323366, "phrase": "international_databases"}, {"score": 0.004031238480458909, "phrase": "brazilian_participation"}, {"score": 0.003878451139312637, "phrase": "predominant_fields"}, {"score": 0.0037314328720368453, "phrase": "greatest_number"}, {"score": 0.0036931745534238562, "phrase": "brazilian_authors"}, {"score": 0.0031640496006559095, "phrase": "brazilian_production"}, {"score": 0.003083522879625884, "phrase": "rio_grande"}, {"score": 0.0030518883568430434, "phrase": "puc"}, {"score": 0.0029973014669174344, "phrase": "international_scenario"}, {"score": 0.0029059810369677693, "phrase": "total_scientific_production"}, {"score": 0.0026827075165830193, "phrase": "large_number"}, {"score": 0.0024957862318504753, "phrase": "significant_production"}, {"score": 0.0023398998792474993, "phrase": "third_group"}, {"score": 0.0022803002194634286, "phrase": "lower_level"}, {"score": 0.002176812047296225, "phrase": "first_group"}, {"score": 0.0021049977753042253, "phrase": "second_group"}], "paper_keywords": ["Brazilian science", " Brazilian review articles", " Scientific production", " S&T qualitative data", " Brazilian postgraduate programs", " Growth of scientific production"], "paper_abstract": "This article identifies scientific fields in Brazil that have been generating new knowledge, their evolution, tendencies and the relationship between scientific production and the National Postgraduate Program (Programa Nacional de Ps-Gradua double dagger o-PNPG). It works with review articles and assesses: (a) articles published as reviews by international databases; (b) the growth of Brazilian participation in that context; (c) institutional participation; (d) the predominant fields of knowledge; (e) the most productive authors, and (f) periodicals that published the greatest number of review articles by Brazilian authors. The 5,348 review articles published between 2000 and 2009 were made available in 1,309 scientific publications, and the fields that published the most reviews were Pharmacology, Chemistry, Neurosciences, Biochemistry and Molecular Biology, Psychiatry, Neurology, Endocrinology and Internal Medicine. The reviews were produced by 27,096 authors under the auspices of 20 institutions which, together, answer for 95 % of the Brazilian production, and are public, excepting for the Pontificia Universidade Catlica do Rio Grande do Sul (PUC-RS). In the international scenario, we find that 31 countries are responsible for 90.11 % of the total scientific production and 94.08 % of the review articles. To establish a comparison between Brazil and its closest competitors, these countries can be classified arbitrarily in three groups: (1) countries with a large number of review articles (> 3100), an average number of citations above 18, and an h-index greater than 95; (2) countries with a significant production of articles (between 2,000 and 3,000), average number of citations between 12 and 17, and an h-index below 95. Brazil is in the third group, (3) formed by countries with a lower level of production and the two qualitative indicators at opposite poles: the average of citations on a par with the first group (> 18) and h-indexes like those of the second group (< 95).", "paper_title": "Brazil's growing production of scientific articles-how are we doing with review articles and other qualitative indicators?", "paper_id": "WOS:000325475300009"}