{"auto_keywords": [{"score": 0.015719716506582538, "phrase": "enterprise_it_services"}, {"score": 0.00894751628048148, "phrase": "best_fit"}, {"score": 0.008636864442880518, "phrase": "log-normal_distribution"}, {"score": 0.004177724522109952, "phrase": "service_availability"}, {"score": 0.004073113268289532, "phrase": "previous_systematic_empirical_study"}, {"score": 0.0038913443732432468, "phrase": "existing_literature"}, {"score": 0.0036801209922064817, "phrase": "related_areas"}, {"score": 0.0036245239349157236, "phrase": "software_engineering"}, {"score": 0.003462704420080129, "phrase": "statistical_distribution"}, {"score": 0.0031284221314354095, "phrase": "large_nordic_bank"}, {"score": 0.002988685006809336, "phrase": "five_possible_distributions"}, {"score": 0.0025533148412439166, "phrase": "tested_service_channels"}, {"score": 0.002248755794042486, "phrase": "simulation_and_decision-support_tools"}, {"score": 0.0021923400552366756, "phrase": "better_predictions"}, {"score": 0.0021049977753042253, "phrase": "practitioner_community"}], "paper_keywords": ["Enterprise IT services", " incident logs", " log-normal distribution"], "paper_abstract": "The context of this article is the availability of enterprise IT services, a key concern for many enterprises. While there is a plethora of literature concerned with service availability, there is no previous systematic empirical study on IT service time to recovery following outages. The existing literature typically assumes a distribution, or builds on analogies to related areas such as software engineering. Therefore, our objective is to find the statistical distribution of IT service time to recovery. Method-wise, this investigation is based on logs of more than 1 800 incidents in a large Nordic bank, corresponding to more than 11 000 hours of recorded downtime. Five possible distributions of time to recovery from the literature were investigated using the Akaike Information Criterion to find the distribution offering the best fit. The results show that the log-normal distribution outperformed the others for all tested service channels (collections of IT services). It is concluded that the log-normal distribution offers the best fit of IT service time to recovery. Using this distribution in simulation and decision-support tools offers the prospect of better predictions of downtime and downtime costs to the practitioner community.", "paper_title": "The Distribution of Time to Recovery of Enterprise IT Services", "paper_id": "WOS:000345904000004"}