{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "input-output_mappings"}, {"score": 0.00476323161560059, "phrase": "fuzzy_logic_systems"}, {"score": 0.004345363360869553, "phrase": "universal_approximator"}, {"score": 0.004116823963855969, "phrase": "continuous_input-output_mapping"}, {"score": 0.0037150687722055727, "phrase": "six_type-reduction_and_defuzzification_methods"}, {"score": 0.0031417377608722, "phrase": "begian"}, {"score": 0.002928399649340438, "phrase": "continuous_and_discontinuous_input-output_mappings"}, {"score": 0.0023712394008737958, "phrase": "membership_functions"}, {"score": 0.002320449502337321, "phrase": "desired_continuity"}, {"score": 0.0021049977753042253, "phrase": "switched_systems"}], "paper_keywords": ["Continuity", " discontinuity", " fuzzy logic modeling and control", " hybrid and switched systems", " interval type-2 fuzzy logic systems (FLSs)", " monotonicity", " smoothness"], "paper_abstract": "This paper studies the continuity of the input-output mappings of fuzzy logic systems (FLSs), including both type-1 (T1) and interval type-2 (IT2) FLSs. We show that a T1 FLS being an universal approximator is equivalent to saying that a T1 FLS has a continuous input-output mapping. We also derive the condition under which a T1 FLS is discontinuous. For IT2 FLSs, we consider six type-reduction and defuzzification methods (the Karnik-Mendel method, the uncertainty bound method, the WuTan method, the Nie-Tan method, the Du-Ying method, and the Begian-Melek-Mendel method) and derive the conditions under which continuous and discontinuous input-output mappings can be obtained. Guidelines for designing continuous IT2 FLSs are also given. This paper is to date the most comprehensive study on the continuity of FLSs. Our results will be very useful in the selection of the parameters of the membership functions to achieve a desired continuity (e.g., for most traditional modeling and control applications) or discontinuity (e.g., for hybrid and switched systems modeling and control).", "paper_title": "On the Continuity of Type-1 and Interval Type-2 Fuzzy Logic Systems", "paper_id": "WOS:000286932000014"}