{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "technology_leadership_strategies"}, {"score": 0.049352273134126434, "phrase": "school_administration"}, {"score": 0.008773352921752147, "phrase": "administrators'_technology_leadership_strategies"}, {"score": 0.008607811068662008, "phrase": "elementary_school_administration"}, {"score": 0.004443276312972159, "phrase": "school_technology_leadership"}, {"score": 0.004359078118356132, "phrase": "elementary_schools"}, {"score": 0.0034512514926836667, "phrase": "counseling_divisions"}, {"score": 0.003359960339222556, "phrase": "taiwan"}, {"score": 0.003308862957060602, "phrase": "semi-structured_interviews"}, {"score": 0.0032836104153151973, "phrase": "expert_validity_surveys"}, {"score": 0.0031240868074933078, "phrase": "quantitative_data"}, {"score": 0.0029951555610569225, "phrase": "descriptive_statistics"}, {"score": 0.002972305654415578, "phrase": "pearson"}, {"score": 0.002784828661426853, "phrase": "elementary_school_administrators"}, {"score": 0.002629238854352447, "phrase": "high_level"}, {"score": 0.0024918548761791435, "phrase": "significantly_positive_impact"}, {"score": 0.002246799280512825, "phrase": "essential_part"}, {"score": 0.0022296340517805125, "phrase": "school_administrators'_training_programs"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Architectures for educational technology system", " Computer-mediated communication", " Country-specific developments", " Elementary education"], "paper_abstract": "This research has four main themes: (1) the level of school technology leadership used by administrators in elementary schools; (2) the degree to which administrators are aware of the effectiveness of school administration; (3) the relationship between administrators' technology leadership strategies and the effectiveness of elementary school administration; and (4) whether administrators' technology leadership strategies can predict the effectiveness of elementary school administration. The participants were 323 administrators (comprising principals and directors of academic-affairs, student-affairs, general-affairs, and counseling divisions) from 82 elementary schools located all over Taiwan and its three offshore islands. Semi-structured interviews, expert validity surveys and a pilot-study were implemented to develop a \"Technology Leadership Strategies and School Administrative Effectiveness Scale\". The quantitative data gathered from the instrument was analyzed through the use of descriptive statistics, Pearson's product-moment correlation coefficient, and simple linear regression. The findings indicated that elementary school administrators were highly conscious of using technology leadership strategies, and that these administrators generally possessed a high level of effectiveness regarding school administration. The results also indicated that technology leadership strategies had a significantly positive impact on the effectiveness of school administration, and thus the former could significantly predict the latter. The findings revealed that technology leadership strategies should be seen as an essential part of school administrators' training programs, in order to improve the effectiveness of such administration. (C) 2014 Elsevier Ltd. All rights reserved.", "paper_title": "The relationship between technology leadership strategies and effectiveness of school administration: An empirical study", "paper_id": "WOS:000336820700008"}