{"auto_keywords": [{"score": 0.04308460043022523, "phrase": "hrrs_system"}, {"score": 0.031681431036630577, "phrase": "system_use"}, {"score": 0.031451773897963865, "phrase": "user_satisfaction"}, {"score": 0.02945610769566691, "phrase": "mobile_healthcare_anxiety"}, {"score": 0.012634444681210921, "phrase": "seven_variables"}, {"score": 0.00481495049065317, "phrase": "mobile_patient_safety_information_system_success"}, {"score": 0.004655640997424794, "phrase": "health_risk_reminders"}, {"score": 0.00453537012358554, "phrase": "critical_abnormal_test_results"}, {"score": 0.004501578643090429, "phrase": "severely_ill_patients"}, {"score": 0.004256005669252138, "phrase": "cell_phone_text_messages"}, {"score": 0.00399378014373321, "phrase": "augmented_version"}, {"score": 0.003890540531028228, "phrase": "success_model"}, {"score": 0.0030963190575539574, "phrase": "information_quality"}, {"score": 0.0023466842270226888, "phrase": "expanded_understanding"}, {"score": 0.0022859244876449396, "phrase": "mobile_patient_safety_information_system"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ireland_ltd."}], "paper_keywords": ["healthcare", " mobile healthcare anxiety", " patient safety service"], "paper_abstract": "Objective: The Health Risk Reminders and Surveillance (HRRS) system was designed to deliver critical abnormal test results of severely ill patients from Laboratory, Radiology, and Pathology departments to physicians within 5 min using cell phone text messages. This paper explores the success of the HRRS system. Method: This study employed an augmented version of the DeLone and McLean IS success model. Seven variables (system quality, information quality, system use, user satisfaction, mobile healthcare anxiety, impact on the individual and impact on the organization) were used to evaluate the success of the HRRS system. The interrelationships between the seven variables were hypothesized and the hypotheses were empirically tested. Results: The results indicate that the information quality of the HRRS system is positively associated with both system use and user satisfaction. In addition, system use is positively associated with user satisfaction, which is also positively associated with mobile healthcare anxiety. Moreover, results indicate that impact on the individual is positively associated with both user satisfaction and mobile healthcare anxiety. Finally, the impact of the organization is positively associated with impact on the individual. Conclusion: The results of the study provide an expanded understanding of the factors that contribute to mobile patient safety information system (IS) success. Implications of the relationship between system use and physician mobile healthcare anxiety are discussed. (c) 2008 Elsevier Ireland Ltd. All rights reserved.", "paper_title": "Measuring mobile patient safety information system success: An empirical study", "paper_id": "WOS:000259357000006"}