{"auto_keywords": [{"score": 0.0414011779133521, "phrase": "partition_p"}, {"score": 0.012460885012726224, "phrase": "minimum_cost_set"}, {"score": 0.00481495049065317, "phrase": "partition_vertex_cover_problem"}, {"score": 0.004728874038094706, "phrase": "natural_generalization"}, {"score": 0.004677965073019951, "phrase": "partial_vertex_cover_problem"}, {"score": 0.0032484270911235526, "phrase": "novel_lp_relaxation"}, {"score": 0.003178758306417406, "phrase": "lp_relaxation"}, {"score": 0.0031218401638802053, "phrase": "knapsack_cover"}, {"score": 0.003077038060542514, "phrase": "natural_lp_relaxation"}, {"score": 0.0029571101238632783, "phrase": "integrality_gap"}, {"score": 0.002423882939663573, "phrase": "total_profit"}, {"score": 0.0021904435447196884, "phrase": "approximation_algorithm"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Approximation algorithm", " Vertex cover", " Knapsack cover inequality", " LP rounding"], "paper_abstract": "We consider a natural generalization of the Partial vertex cover problem. Here an instance consists of a graph G = (V, E), a cost function c: V -> Z(+), a partition P-1, ..., P-r of the edge set E, and a parameter k(i) for each partition P-i. The objective is to find a minimum cost set of vertices which cover at least k(i) edges from the partition P-i. We call this the Partition-VC problem. In this paper, we give matching upper and lower bound on the approximability of this problem. Our algorithm is based on a novel LP relaxation for this problem. This LP relaxation is obtained by adding knapsack cover inequalities to a natural LP relaxation of the problem. We show that this LP has integrality gap of O (logr), where r is the number of sets in the partition of the edge set. We also extend our result to more general settings. For example we consider a problem where additionally edges have profits, and we would like to pick a minimum cost set of vertices which cover edges of total profit at least Pi(i) for each partition P-i. We call this the Knapsack Partition Vertex Cover problem. We give an O (logr) approximation algorithm for this problem as well. (C) 2014 Elsevier B.V. All rights reserved.", "paper_title": "Approximation algorithms for the partition vertex cover problem", "paper_id": "WOS:000343627600002"}