{"auto_keywords": [{"score": 0.049460287006492736, "phrase": "social_signal_processing"}, {"score": 0.00481495049065317, "phrase": "conceptual_framework"}, {"score": 0.004630626571109149, "phrase": "emerging_research_area"}, {"score": 0.004467840466181518, "phrase": "effective_ways"}, {"score": 0.003999846737966902, "phrase": "ssp."}, {"score": 0.003960972732123083, "phrase": "seven_core_constructs"}, {"score": 0.003615845091983304, "phrase": "perceptual_issues"}, {"score": 0.0029836109362668586, "phrase": "ssp_system"}, {"score": 0.0029449743792479433, "phrase": "natural_subtlety"}, {"score": 0.002906836691319759, "phrase": "human_communication"}, {"score": 0.0026360722474571214, "phrase": "simple_models"}, {"score": 0.002543224008253855, "phrase": "seven_constructs"}, {"score": 0.0024376912001213362, "phrase": "relevant_issues"}, {"score": 0.0022838006190016263, "phrase": "alternative_frameworks"}, {"score": 0.0021049977753042253, "phrase": "comparable_range"}], "paper_keywords": ["Social signal processing", " Psychology"], "paper_abstract": "Social Signal Processing (SSP) as an emerging research area can draw on material from many disciplines, but it needs effective ways to organise the material. We propose a framework that integrates concepts, drawn primarily from psychology, but with input from other disciplines, in a way that indicates how they relate to SSP. We identify seven core constructs: state; indicators that convey info about it; process by which indicators are generated; types of inference involved in identifying states from indicators; perceptual issues, including recovery of indicators from flux of activity and accuracy of impressions about the state; the role of macro-context; and the different levels at which analysis may be couched (the individual, the dyad, the group, the organisation). These may or may not be reflected in the structure of an SSP system, but the natural subtlety and context-sensitivity of human communication makes it important that people designing systems should consider how they relate to its task, and decide how best to take account of them. The analysis works from simple models which consider only states and indicators to models which embrace all seven constructs. At each stage it points to the literatures which discuss the relevant issues. It is fully acknowledged that attempting such a synthesis raises many problems (not least of terminology), and that alternative frameworks deal at least as well with subsets of the issues. It remains to be seen whether they could be extended to cover a comparable range.", "paper_title": "Towards a conceptual framework of research on social signal processing", "paper_id": "WOS:000309999600002"}