{"auto_keywords": [{"score": 0.027978842547789984, "phrase": "amazon"}, {"score": 0.00481495049065317, "phrase": "content_suggestions"}, {"score": 0.004722898398399427, "phrase": "product_reviews"}, {"score": 0.004355026964936104, "phrase": "web_sites"}, {"score": 0.003674192201248236, "phrase": "subsequent_users"}, {"score": 0.0036178264212372497, "phrase": "purchase_and_consumption_decisions"}, {"score": 0.003284550970221379, "phrase": "subsequent_reviews"}, {"score": 0.00317221667574882, "phrase": "case-based_reasoning_approach"}, {"score": 0.0029589086332593674, "phrase": "new_review"}, {"score": 0.002902236818129282, "phrase": "general_case-based_reasoning_approach"}, {"score": 0.0028138046006772567, "phrase": "amazon's_information_servers"}, {"score": 0.002675797331220082, "phrase": "wide_range"}, {"score": 0.0025151755329660837, "phrase": "user_trial"}, {"score": 0.0022394839933089074, "phrase": "different_ways"}, {"score": 0.002205079358459154, "phrase": "case_base"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Case-Based Reasoning", " Product reviews", " Web 2.0", " Crowdsourcing", " Knowlege-based system"], "paper_abstract": "It is not uncommon now for people to write reviews of products and services and to publish them on Web sites. They express their opinions on books they have read, movies they have seen, hotels they have stayed in, retailers with whom they have had dealings, and so on. These reviews are a source of experience that can inform subsequent users when they make purchase and consumption decisions. But in this paper we show that we can also use these reviews as a source of experience to support the authors of subsequent reviews. We describe GhostWriter-2.0, which takes a Case-Based Reasoning approach to reusing existing reviews to dynamically suggest topics that could be covered by the author of a new review. GhostWriter-2.0 takes a general Case-Based Reasoning approach but is currently configured to operate with Amazon's information servers, and can therefore assist users who are writing reviews of the wide range of products that Amazon sells on-line. We present the results of a user trial, which shows that the suggestions that GhostWriter-2.0 makes do get used and do seem to have value. We also present the results of an experiment that compares different ways of populating the case base from which the suggestions are drawn. (C) 2011 Elsevier B.V. All rights reserved.", "paper_title": "The GhostWriter-2.0 Case-Based Reasoning system for making content suggestions to the authors of product reviews", "paper_id": "WOS:000302820800011"}