{"auto_keywords": [{"score": 0.04590268631137089, "phrase": "prior_work"}, {"score": 0.009465881602430838, "phrase": "relational_and_nonrelational_sources"}, {"score": 0.00481495049065317, "phrase": "relational_and_nonrelational_information_sources"}, {"score": 0.004633052743252902, "phrase": "important_organizational_resource"}, {"score": 0.0042446888127531945, "phrase": "organizational_setting"}, {"score": 0.004141877689172017, "phrase": "open_portfolio"}, {"score": 0.003929843413153981, "phrase": "wide_array"}, {"score": 0.003754847652236926, "phrase": "different_types"}, {"score": 0.0035006643351909246, "phrase": "direct_interpersonal_contact"}, {"score": 0.003107294250160403, "phrase": "graduate_business_studies"}, {"score": 0.002826562521633885, "phrase": "source_accessibility"}, {"score": 0.002544207840990836, "phrase": "relational_sources"}, {"score": 0.0024137645015872952, "phrase": "perceived_accessibility"}, {"score": 0.002380120876826732, "phrase": "alternative_types"}, {"score": 0.0021049977753042253, "phrase": "knowledge_assets"}], "paper_keywords": ["information accessibility", " information quality", " information seeking", " information sources", " knowledge management"], "paper_abstract": "Although it has been argued that knowledge is an important organizational resource, little research has investigated where individuals go to search for information or knowledge. Prior work has investigated sources in isolation, but in an organizational setting, sources are encountered as an open portfolio instead of in isolation. it is important to understand how individuals perceive the wide array of sources available to them and how those perceptions affect their use of different types of sources. Building on prior work, this research looks at factors underlying the selection of sources that require direct interpersonal contact (relational sources) and those that do not (nonrelational sources) and explores factors that differentially affect the use of these types of sources. A sample of 204 working professionals recruited from graduate business studies was used to test hypotheses regarding the effects of accessibility and quality, as well as comparisons and trade-offs between relational and nonrelational sources. Consistent with prior work, source accessibility and quality significantly affect usage of a source. This relationship, however, is moderated by the type of source with accessibility having less effect on the use of relational sources. Furthermore, use of each type of source was also affected by the perceived accessibility and quality of alternative types of sources. Together these results highlight the importance of simultaneously considering the relational and nonrelational sources available to individuals. These results also have implications for the design and implementation of systems for managing information and knowledge assets.", "paper_title": "Determinants of the use of relational and nonrelational information sources", "paper_id": "WOS:000252906300011"}