{"auto_keywords": [{"score": 0.04417596194338469, "phrase": "rra"}, {"score": 0.031205237713936303, "phrase": "rra_methodology"}, {"score": 0.015719711310935372, "phrase": "retroductive_recognition"}, {"score": 0.00454772672262359, "phrase": "information_science_employ_induction"}, {"score": 0.004456980650437417, "phrase": "third_fundamental_mode"}, {"score": 0.004043158538239064, "phrase": "charles_sanders_peirce"}, {"score": 0.0038964032225585117, "phrase": "iterative_performance"}, {"score": 0.0036064757492752703, "phrase": "nine_steps"}, {"score": 0.0034638476252104706, "phrase": "fundamental_and_primary_retroduction"}, {"score": 0.0033492947290751996, "phrase": "intuitive_prejudices"}, {"score": 0.002977294336234334, "phrase": "inductive_or_deductive_methods"}, {"score": 0.0028498718992429825, "phrase": "previously_undefined_concept"}, {"score": 0.00279291004189267, "phrase": "spradley"}, {"score": 0.0027741761880779535, "phrase": "mccurdy's_classification"}, {"score": 0.0026914126067254444, "phrase": "compelled_nonuse_of_information"}, {"score": 0.0026733595273078156, "phrase": "cni"}, {"score": 0.0025503112711036994, "phrase": "initial_\"hunch"}, {"score": 0.00251620434048784, "phrase": "testable_hypothesis"}, {"score": 0.0023523750536537102, "phrase": "theoretical_basis"}, {"score": 0.0021263705039915198, "phrase": "retroductive_philosophical_inquiry"}, {"score": 0.002104999029280643, "phrase": "peirce"}], "paper_keywords": ["Research methods", " Classification"], "paper_abstract": "Purpose - Current research methodologies in the field of information science employ induction or deduction, ignoring the third fundamental mode of cognition, retroduction. This paper seeks to introduce the Retroductive Recognition of Absence (RRA) methodology that expands inquiry from its current inductive and deductive bases to include the intuition-based retroduction/abduction of Charles Sanders Peirce. Design/methodology/approach - In brief, RRA consists of an iterative performance, of its nine-step heuristic, with each iteration narrowing the scope of the research, while increasing the depth of examination. The nine steps are: perceive a phenomenon leading to surprise, perform the fundamental and primary retroduction; synthesize the phenomenon into a hypothesis; bracket intuitive prejudices; immerse in the data; conceptualize; hypothesize; select the hypothesis most efficient to test; and test the hypothesis. The iterations continue until the researcher reaches a hypothesis testable by inductive or deductive methods. This RRA methodology incorporates a \"definition heuristic\" that defines any previously undefined concept, a heuristic based on Spradley and McCurdy's classification of definitions. Findings - A study of Compelled Nonuse of Information (CNI) demonstrated the usefulness of RRA in the study of phenomena from an initial \"hunch\" to a testable hypothesis. As such, the RRA methodology decreases subjectivity and imparts rigor to the study of absent or newly emergent phenomena that have no theoretical basis, no data, and no pre-existing, coherent body of literature. Originality/value - This paper presents the philosophy and practice of the RRA methodology and the retroductive philosophical inquiry postulated by Peirce.", "paper_title": "The Retroductive Recognition of Absence (RRA) methodology", "paper_id": "WOS:000291373700002"}