{"auto_keywords": [{"score": 0.04613130232163521, "phrase": "user_intent"}, {"score": 0.004466519142879166, "phrase": "comprehensive_classification"}, {"score": 0.004371660146981191, "phrase": "web_searching"}, {"score": 0.003926626018798576, "phrase": "software_application"}, {"score": 0.003781772207256374, "phrase": "web_search_engine_log"}, {"score": 0.0035457302646174148, "phrase": "web_queries"}, {"score": 0.002969628818856786, "phrase": "manual_classification"}, {"score": 0.002859977408815691, "phrase": "automated_method"}, {"score": 0.0027543636132088332, "phrase": "automatic_classification"}, {"score": 0.0023694065215394593, "phrase": "probabilistic_classification"}, {"score": 0.002306543826130521, "phrase": "search_engines"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["user intent", " Web queries", " Web searching", " search engines"], "paper_abstract": "In this paper, we define and present a comprehensive classification of user intent for Web searching. The classification consists of three hierarchical levels of informational, navigational, and transactional intent. After deriving attributes of each, we then developed a software application that automatically classified queries using a Web search engine log of over a million and a half queries submitted by several hundred thousand users. Our findings show that more than 80% of Web queries are informational in nature, with about 10% each being navigational and transactional. In order to validate the accuracy of our algorithm, we manually coded 400 queries and compared the results from this manual classification to the results determined by the automated method. This comparison showed that the automatic classification has an accuracy of 74%. Of the remaining 25% of the queries, the user intent is vague or multi-faceted, pointing to the need for probabilistic classification. We discuss how search engines can use knowledge of user intent to provide more targeted and relevant results in Web searching. (C) 2007 Elsevier Ltd. All rights reserved.", "paper_title": "Determining the informational, navigational, and transactional intent of Web queries", "paper_id": "WOS:000255267600016"}