{"auto_keywords": [{"score": 0.0443587048584781, "phrase": "syntactic_and_semantic_content_features"}, {"score": 0.015720875503662288, "phrase": "mac"}, {"score": 0.010042859792205011, "phrase": "content_model"}, {"score": 0.008334662229817033, "phrase": "content_descriptions"}, {"score": 0.00379914165379475, "phrase": "redundant_data"}, {"score": 0.003615217162972726, "phrase": "syntactic_features"}, {"score": 0.0033837135367113004, "phrase": "spatial_and_temporal_relationships"}, {"score": 0.0022741894748181243, "phrase": "wide-ranging_interoperability"}, {"score": 0.0022368274529152342, "phrase": "granular_multi-content-type_searches"}, {"score": 0.0021049977753042253, "phrase": "semantic_gap"}], "paper_keywords": ["MPEG-7", " video content feature extraction", " content modelling"], "paper_abstract": "This paper discusses MAC-REALM, a framework for extraction of syntactic and semantic content features and content modelling with either little or no user interaction. The framework integrates a four filter-plane strategy: a pre-processing plane that filters redundant data, a syntactic feature extraction plane that filters syntactic features, a semantic relationships analysis and linkage plane that filters the spatial and temporal relationships of content features, and finally a content modelling plane where the syntactic and semantic content features are integrated into a content model. Each of the four planes is split into three layers: the content layer, where the content to be processed is stored; the application layer, where the content is converted into content descriptions; and the MPEG-7 layer, where content descriptions are serialized. Using MPEG-7 standards to produce the content model will provide wide-ranging interoperability while facilitating granular multi-content-type searches. MAC-REALM aims at 'bridging' the semantic gap, by integrating the syntactic and semantic content features from extraction through to modelling.", "paper_title": "MAC-REALM: A Video Content Feature Extraction and Modelling Framework", "paper_id": "WOS:000361469800019"}