{"auto_keywords": [{"score": 0.03764218679820011, "phrase": "np"}, {"score": 0.00481495049065317, "phrase": "stable_marriage_problem"}, {"score": 0.004682708592184678, "phrase": "classical_stable_marriage_problem"}, {"score": 0.004532988904965752, "phrase": "strictly_ordered_preference_list"}, {"score": 0.003644001325962353, "phrase": "maximum_cardinality"}, {"score": 0.003068242064611088, "phrase": "approximation_algorithm"}, {"score": 0.002874870266177579, "phrase": "approximation_ratio"}, {"score": 0.002744234034162797, "phrase": "restricted_instances"}, {"score": 0.002488851299416018, "phrase": "known_approximation_algorithm"}, {"score": 0.0024091057723923857, "phrase": "general_inputs"}, {"score": 0.0023103100997344072, "phrase": "first_nontrivial_result"}, {"score": 0.0022155569675462333, "phrase": "general_instances"}, {"score": 0.0021049977753042253, "phrase": "arbitrarily_positive_constant"}], "paper_keywords": ["stable marriage problem", " incomplete lists", " ties", " approximation algorithms", " local search"], "paper_abstract": "An instance of the classical stable marriage problem requires all participants to submit a strictly ordered preference list containing all members of the opposite sex. However, considering applications in real-world, we can think of two natural relaxations, namely, incomplete preference lists and ties in the lists. Either variation leaves the problem polynomially solvable, but it is known that finding a maximum cardinality stable matching is NP-hard when both variations are allowed. It is easy to see that the size of any two stable matchings differ by at most a factor of two, and so, an approximation algorithm with a factor two is trivial. A few approximation algorithms have been proposed with approximation ratio better than two, but they are only for restricted instances, such as restricting occurrence of ties and/or lengths of ties. Up to the present, there is no known approximation algorithm with ratio better than two for general inputs. In this paper, we give the first nontrivial result for approximation of factor less than two for general instances. Our algorithm achieves the ratio 2-c log N/N for an arbitrarily positive constant. c, where N denotes the number of men in an input.", "paper_title": "A (2-c logN/N)-approximation algorithm for the stable marriage problem", "paper_id": "WOS:000239578100008"}