{"auto_keywords": [{"score": 0.049128680392438076, "phrase": "groves_mechanisms"}, {"score": 0.030873197574561393, "phrase": "non-deficit_groves_mechanism"}, {"score": 0.009332337493602549, "phrase": "type_profile"}, {"score": 0.008650422522680883, "phrase": "strict_inequality"}, {"score": 0.00481495049065317, "phrase": "undominated_groves_mechanisms"}, {"score": 0.0046256566852302256, "phrase": "well-known_vcg_mechanism"}, {"score": 0.004515655183335171, "phrase": "clarke_mechanism"}, {"score": 0.004390607370861926, "phrase": "efficient_and_strategy-proof_mechanisms"}, {"score": 0.0038152404172111815, "phrase": "reduced_utilities"}, {"score": 0.003437036036889996, "phrase": "highest_utilities"}, {"score": 0.0032231139180761183, "phrase": "prior-free_approach"}, {"score": 0.003108669771132255, "phrase": "prior-free_settings"}, {"score": 0.002998282359784429, "phrase": "groves"}, {"score": 0.0028115863316685937, "phrase": "agents_utility"}, {"score": 0.002147749117443578, "phrase": "non-deficit_groves_mechanisms"}, {"score": 0.0021049977753042253, "phrase": "maximal_elements"}], "paper_keywords": [""], "paper_abstract": "The family of Groves mechanisms, which includes the well-known VCG mechanism (also known as the Clarke mechanism), is a family of efficient and strategy-proof mechanisms. Unfortunately, the Groves mechanisms are generally not budget balanced. That is, under such mechanisms, payments may flow into or out of the system of the agents, resulting in deficits or reduced utilities for the agents. We consider the following problem: within the family of Groves mechanisms, we want to identify mechanisms that give the agents the highest utilities, under the constraint that these mechanisms must never incur deficits. We adopt a prior-free approach. We introduce two general measures for comparing mechanisms in prior-free settings. We say that a non-deficit Groves mechanism M in- dividually dominates another non-deficit Groves mechanism M' if for every type profile, every agents utility under M is no less than that under M', and this holds with strict inequality for at least one type profile and one agent. We say that a non-deficit Groves mechanism M collectively dominates another non-deficit Groves mechanism M' if for every type profile, the agents total utility under M is no less than that under M', and this holds with strict inequality for at least one type profile. The above definitions induce two partial orders on non-deficit Groves mechanisms. We study the maximal elements corresponding to these two partial orders, which we call the individually undominated mechanisms and the collectively undominated mechanisms, respectively.", "paper_title": "Undominated Groves Mechanisms", "paper_id": "WOS:000314864900001"}