{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "user_adoption"}, {"score": 0.010519569757466537, "phrase": "health_information_systems"}, {"score": 0.0046683172874085015, "phrase": "thirty_years"}, {"score": 0.004198510172614725, "phrase": "reflective_pause"}, {"score": 0.003946519058822334, "phrase": "electronic_medical_record"}, {"score": 0.0037925389501636975, "phrase": "comprehensive_taxonomy"}, {"score": 0.003660706478610114, "phrase": "emr"}, {"score": 0.0035648266669315943, "phrase": "meaningful_categories"}, {"score": 0.0034868462688262864, "phrase": "selected_keywords"}, {"score": 0.0033955105098235345, "phrase": "initial_set"}, {"score": 0.003013129637451091, "phrase": "adoption_theories"}, {"score": 0.0029212075318449616, "phrase": "empirical_results"}, {"score": 0.0028699415886017468, "phrase": "emr_research"}, {"score": 0.0026267609106294817, "phrase": "emr_adoption"}, {"score": 0.0025241429061867633, "phrase": "eight_categories"}, {"score": 0.0021049977753042253, "phrase": "information_technology"}], "paper_keywords": [""], "paper_abstract": "In the past three decades, several studies have extracted antecedents to the user adoption of health information systems (HIS). This study proposes a reflective pause on the HIS adoption literature to broaden our understanding of factors contributing to the user adoption of electronic medical record (EMR). This paper provides a comprehensive taxonomy of the factors influencing the user adoption of EMR and classifies these factors into meaningful categories. We searched the selected keywords on several academic databases and found an initial set of 9,684 studies. We excluded papers on the basis of their title, abstract, and full text (89 remaining papers). The effectiveness of adoption theories has been explored based on the empirical results identified in the EMR research. Furthermore, according to the conceptualization of the factors in the literature, a list of 78 factors affecting EMR adoption was identified. These factors were classified to eight categories: individual factors, psychological factors, behavioural factors, environmental factors, organizational factors, financial factors, legal factors, and technical factors. The results have implications for researchers and practitioners, including policymakers, marketers, information technology (IT) professionals, health information management (HIM) practitioners, health practice managers, and EMR system developers.", "paper_title": "A Taxonomy of Antecedents to User Adoption of Health Information Systems: A Synthesis of Thirty Years of Research", "paper_id": "WOS:000350100500011"}