{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "stbc_transmissions"}, {"score": 0.004731928080086235, "phrase": "indoor_channels"}, {"score": 0.00428146713705618, "phrase": "different_space-time_block"}, {"score": 0.003993544228876303, "phrase": "alamouti_orthogonal_scheme"}, {"score": 0.003924629168434799, "phrase": "channel_state_information"}, {"score": 0.003581797255879607, "phrase": "second-order_statistics"}, {"score": 0.0035508270426644556, "phrase": "sos"}, {"score": 0.0034894451015047875, "phrase": "comparison_purposes"}, {"score": 0.003170667618004276, "phrase": "csi_estimation"}, {"score": 0.0030223381739019894, "phrase": "hardware_mimo_platform"}, {"score": 0.0029701328654852246, "phrase": "high-performance_signal_acquisition"}, {"score": 0.002770150086489194, "phrase": "extremely_large_data_frames"}, {"score": 0.00272261625425422, "phrase": "rf"}, {"score": 0.0025611773887867255, "phrase": "commercial_components"}, {"score": 0.002452251958405469, "phrase": "mimo"}, {"score": 0.0022768346311104735, "phrase": "described_methods"}, {"score": 0.0021049977753042253, "phrase": "john_wiley"}], "paper_keywords": ["Multiple-Input Multiple-Output (MIMO)", " space-time block codes", " Blind Channel Estimation", " principal component analysis (PCA)", " MIMO testbeds"], "paper_abstract": "In this paper we employ a 2 x 2 Multiple-Input Multiple-Output (MIMO) hardware platform to evaluate, in realistic indoor scenarios, the performance of different space-time block coded (STBC) transmissions at 2.4 GHz. In particular, we focus on the Alamouti orthogonal scheme considering two types of channel state information (CSI) estimation: a conventional pilot-aided supervised technique and a recently proposed blind method based on second-order statistics (SOS). For comparison purposes, we also evaluate the performance of a Differential (non-coherent) space-time block coding (DSTBC). DSTBC schemes have the advantage of not requiring CSI estimation but they incur in a 3 dB loss in performance. The hardware MIMO platform is based on high-performance signal acquisition and generation boards, each one equipped with a 1 GB memory module that allows the transmission of extremely large data frames. Upconversion to RF is performed by two RF vector signal generators whereas downconversion is carried out with two custom circuits designed from commercial components. All the baseband signal processing is implemented off-line in MATLAB (R) making the MIMO testbed very flexible and easily reconfigurable. Using this platform we compare the performance of the described methods in line-of-sight (LOS) and non-line-of-sight (NLOS) indoor scenarios. Copyright (C) 2007 John Wiley & Sons, Ltd.", "paper_title": "A comparative study of STBC transmissions at 2.4 GHz over indoor channels using a 2 x 2 MIMO testbed", "paper_id": "WOS:000260973600005"}