{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "low_density"}, {"score": 0.014810095984314785, "phrase": "dominant_interaction"}, {"score": 0.013833897658256725, "phrase": "high_density"}, {"score": 0.012540827733349764, "phrase": "high_production"}, {"score": 0.011762581084171081, "phrase": "lotka-volterra_competitive_model"}, {"score": 0.011367229334453588, "phrase": "specific_system"}, {"score": 0.00945695339715553, "phrase": "net_mutualism"}, {"score": 0.004753194996637899, "phrase": "macroscopic_model"}, {"score": 0.0039841418890102925, "phrase": "niche_differentiation"}, {"score": 0.003899269293218826, "phrase": "low_population_density"}, {"score": 0.0037834649508375544, "phrase": "specific_model"}, {"score": 0.0037348894128879082, "phrase": "novel_combination"}, {"score": 0.003686935223424015, "phrase": "lotka-volterra_cooperative"}, {"score": 0.003212074324593725, "phrase": "competitive_coexistence"}, {"score": 0.002810292047426252, "phrase": "higher_competitive_ability"}, {"score": 0.002622947550220266, "phrase": "inferior_species"}, {"score": 0.0024586427394152196, "phrase": "species_approach_densities"}, {"score": 0.0022749744354271834, "phrase": "lotka-volterra_mutualism_model"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Lotka-Volterra", " Population dynamics", " Mutualism", " Competition", " Coexistence"], "paper_abstract": "A macroscopic model of two species is considered, in which mutualism is the dominant interaction when the species are at low density and competition is the dominant interaction when they are at high density. Our aim is to show that species using the same or similar resources can coexist without niche differentiation and that mutualism at low population density can lead to high production. The specific model is a novel combination of the Lotka-Volterra cooperative (mutualism) model and Lotka-Volterra competitive model. By comparing the dynamics of the specific system with those of the Lotka-Volterra competitive model, we demonstrate the mechanism by which the mutualism at low density promotes competitive coexistence by creating regions of mutualism that maintain coexistence. We also show situations in which high production occurs by (i) displaying regions of net mutualism in which the species with higher competitive ability (the superior) approaches a density larger than its carrying capacity when in isolation from the inferior species, and (ii) displaying regions of net mutualism in which both of the species approach densities larger than their carrying capacities, respectively. By comparing the dynamics of the specific system with those of the Lotka-Volterra mutualism model, we show that competition at high density promotes stability of the system. (C) 2010 Elsevier Ltd. All rights reserved.", "paper_title": "A mutualism-competition model characterizing competitors with mutualism at low density", "paper_id": "WOS:000287729700007"}