{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "pattern_search_algorithms"}, {"score": 0.013106311200460269, "phrase": "final_mesh_size"}, {"score": 0.013014855256672328, "phrase": "expansion_factor"}, {"score": 0.01287885093880505, "phrase": "contraction_factor"}, {"score": 0.011798718820745513, "phrase": "genetic_algorithms"}, {"score": 0.0047810714349158165, "phrase": "high-frequency_surface_wave_analysis"}, {"score": 0.004714023408114857, "phrase": "high-frequency_surface_wave_dispersion_curves"}, {"score": 0.004165879874212301, "phrase": "surface_wave_analysis"}, {"score": 0.004064117897000019, "phrase": "different_inversion_strategies"}, {"score": 0.004035500442527029, "phrase": "initial_mesh_size"}, {"score": 0.003813669883040509, "phrase": "surface_wave_data"}, {"score": 0.003629557750546267, "phrase": "comparative_analysis"}, {"score": 0.003478813491904962, "phrase": "proposed_inverse_procedure"}, {"score": 0.003310813458610484, "phrase": "real-world_example"}, {"score": 0.003287482882222731, "phrase": "henan"}, {"score": 0.0032644159445111135, "phrase": "china"}, {"score": 0.0030521898646210413, "phrase": "gps_algorithm"}, {"score": 0.0030199761431186434, "phrase": "minimal_positive_basis"}, {"score": 0.00290473242917264, "phrase": "suitable_initial_mesh_size"}, {"score": 0.002814175761093278, "phrase": "lambda"}, {"score": 0.0022434880661725493, "phrase": "computation_effort"}, {"score": 0.0021501863832966966, "phrase": "wave_inversion"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Pattern search algorithms", " Generalized pattern search", " Rayleigh waves", " Dispersion curves"], "paper_abstract": "Inversion of high-frequency surface wave dispersion curves is challenging for most local-search methods due to its high nonlinearity and to its multimodality. In this paper, we implemented an investigation to fully exploit and utilize the potentiality of pattern search algorithms and to further enhance their performance for surface wave analysis. We first investigate effects of different inversion strategies, initial mesh size and final mesh size, expansion factor, and contraction factor, as well as inclusion of noise in surface wave data on the performance of the approaches, by three synthetic earth models. Then, a comparative analysis with genetic algorithms is made to further highlight the advantages of the proposed inverse procedure. Finally, the insights issued from this analysis are verified by a real-world example from Henan, China. Results from both synthetic and field data demonstrate: (a) generalized pattern search (GPS) algorithm with the maximal positive basis set 2N vectors works better than GPS algorithm with the minimal positive basis set N+1 vectors; (b) if one gets a suitable initial mesh size by taking some experimentation, then setting expansion factor Lambda = 1 (i.e., not allow expansions) and contraction factor theta = 1/2 can greatly enhance the performance of pattern search algorithms. This is particularly true as the algorithm converges and final mesh size should go to zero; and (c) pattern search algorithms possess stronger immunity with respect to noise and should be considered good not only in terms of accuracy but also in terms of computation effort, especially when compared to the application of genetic algorithms to Rayleigh wave inversion. (C) 2009 Elsevier Ltd. All rights reserved.", "paper_title": "Insights into performance of pattern search algorithms for high-frequency surface wave analysis", "paper_id": "WOS:000269025500006"}