{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "sequential_rules"}, {"score": 0.007173097590088379, "phrase": "cmrules"}, {"score": 0.006874052124916372, "phrase": "association_rules"}, {"score": 0.004742113322179817, "phrase": "sequential_rule_mining"}, {"score": 0.004698938469311569, "phrase": "important_data_mining_task"}, {"score": 0.004641980000471692, "phrase": "wide_range"}, {"score": 0.004557828309570373, "phrase": "current_algorithms"}, {"score": 0.004301238254323321, "phrase": "similar_rules"}, {"score": 0.0030746180465357374, "phrase": "search_space"}, {"score": 0.002910159235873015, "phrase": "minimum_confidence_and_support_thresholds"}, {"score": 0.0028748209350107743, "phrase": "sequential_ordering"}, {"score": 0.002631098941504841, "phrase": "execution_time"}, {"score": 0.00261507100872001, "phrase": "memory_usage"}, {"score": 0.002258305302735867, "phrase": "better_scalability"}, {"score": 0.002244543215797895, "phrase": "low_support_thresholds"}, {"score": 0.00218364206035443, "phrase": "successful_application"}, {"score": 0.00214396012113301, "phrase": "tutoring_agent"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Sequential rule mining", " Sequential pattern mining", " Association rule mining", " Sequence database", " Educational data mining"], "paper_abstract": "Sequential rule mining is an important data mining task used in a wide range of applications. However, current algorithms for discovering sequential rules common to several sequences use very restrictive definitions of sequential rules, which make them unable to recognize that similar rules can describe a same phenomenon. This can have many undesirable effects such as (1) similar rules that are rated differently, (2) rules that are not found because they are considered uninteresting when taken individually, (3) and rules that are too specific, which makes them less likely to be used for making predictions. In this paper, we address these problems by proposing a more general form of sequential rules such that items in the antecedent and in the consequent of each rule are unordered. We propose an algorithm named CMRules for mining this form of rules. The algorithm proceeds by first finding association rules to prune the search space for items that occur jointly in many sequences. Then it eliminates association rules that do not meet the minimum confidence and support thresholds according to the sequential ordering. We evaluate the performance of CMRules in three different ways. First, we provide an analysis of its time complexity. Second, we compare its performance (in terms of execution time, memory usage and scalability) with an adaptation of an algorithm from the literature that we name CMDeo. For this comparison, we use three real-life public datasets, which have different characteristics and represent three kinds of data. In many cases, results show that CMRules is faster and has a better scalability for low support thresholds than CMDeo. Lastly, we report a successful application of the algorithm in a tutoring agent. (C) 2011 Elsevier B.V. All rights reserved.", "paper_title": "CMRules: Mining sequential rules common to several sequences", "paper_id": "WOS:000296931500008"}