{"auto_keywords": [{"score": 0.033073494988142736, "phrase": "redundant_view_answers"}, {"score": 0.00481495049065317, "phrase": "answering_tree_pattern_queries"}, {"score": 0.004542780650208743, "phrase": "tree_pattern_queries"}, {"score": 0.0033170847930578473, "phrase": "new_approach"}, {"score": 0.0032406665327678616, "phrase": "simple_conditions"}, {"score": 0.0031845067058084583, "phrase": "corresponding_algorithm"}, {"score": 0.0030572112793962004, "phrase": "view_answers"}, {"score": 0.0026892447164623247, "phrase": "multiple_views"}, {"score": 0.0026119782818898193, "phrase": "redundant_views"}, {"score": 0.0024072121760839427, "phrase": "redundant_rewritings"}, {"score": 0.002324433454350402, "phrase": "aforesaid_results"}, {"score": 0.002154693685426657, "phrase": "arbitrary_queries"}], "paper_keywords": ["Theory", " Algorithms", " XML database", " query processing", " XPath", " tree pattern", " view", " rewriting"], "paper_abstract": "We revisit the problem of answering tree pattern queries using views. We first show that, for queries and views that do not have nodes labeled with the wildcard *, there is an approach which does not require us to find any rewritings explicitly, yet which produces the same answers as the maximal contained rewriting. Then, using the new approach, we give simple conditions and a corresponding algorithm for identifying redundant view answers, which are view answers that can be ignored when evaluating the maximal contained rewriting. We also consider redundant view answers in the case where there are multiple views, the relationship between redundant views and redundant view answers, and discuss how to combine the removal of redundant view answers and redundant rewritings. We show that the aforesaid results can be extended to a number of other special cases. Finally, for arbitrary queries and views in P-{/,P-//,P-*,P-[]}, we provide a method to find the maximal contained rewriting and show how to answer the query using views without explicitly finding the rewritings.", "paper_title": "Revisiting Answering Tree Pattern Queries Using Views", "paper_id": "WOS:000308658900003"}