{"auto_keywords": [{"score": 0.048727646052725185, "phrase": "ligand-binding_residues"}, {"score": 0.00481495049065317, "phrase": "probability_density_estimation"}, {"score": 0.004640929126263433, "phrase": "catalytically_active_residues"}, {"score": 0.0045284072672385975, "phrase": "important_hints"}, {"score": 0.004418601451254075, "phrase": "existing_sequence-based_prediction_methods"}, {"score": 0.0043114466990006334, "phrase": "evolutionary_conservation"}, {"score": 0.004241451614311598, "phrase": "multiple_sequence_alignment"}, {"score": 0.004021689117050817, "phrase": "low_per-residue_precision"}, {"score": 0.003813269577615793, "phrase": "catalytic_residues"}, {"score": 0.003056682083784002, "phrase": "predicted_ss"}, {"score": 0.0029100272315053253, "phrase": "neighboring_residues"}, {"score": 0.0028744731986533076, "phrase": "weighted_linear_score"}, {"score": 0.0028161764476743257, "phrase": "signal-to-noise_ratio"}, {"score": 0.0027030963394733916, "phrase": "conditional_probability_density_estimation"}, {"score": 0.002541910967437926, "phrase": "observed_amino_acid_distribution"}, {"score": 0.0023514343164101332, "phrase": "catalytic_site_atlas"}, {"score": 0.002294294558114909, "phrase": "site_records"}, {"score": 0.002229380111189829, "phrase": "functional_residues"}, {"score": 0.002202123699556382, "phrase": "new_method"}, {"score": 0.0021751997984619585, "phrase": "ligand-binding_and_catalytic_residues"}, {"score": 0.002131054594847684, "phrase": "alternative_methods"}, {"score": 0.0021049977753042253, "phrase": "entire_sensitivity_range"}], "paper_keywords": [""], "paper_abstract": "Motivation: The prediction of ligand-binding residues or catalytically active residues of a protein may give important hints that can guide further genetic or biochemical studies. Existing sequence-based prediction methods mostly rank residue positions by evolutionary conservation calculated from a multiple sequence alignment of homologs. A problem hampering more wide-spread application of these methods is the low per-residue precision, which at 20 sensitivity is around 35 for ligand-binding residues and 20 for catalytic residues. Results: We combine information from the conservation at each site, its amino acid distribution, as well as its predicted secondary structure (ss) and relative solvent accessibility (rsa). First, we measure conservation by how much the amino acid distribution at each site differs from the distribution expected for the predicted ss and rsa states. Second, we include the conservation of neighboring residues in a weighted linear score by analytically optimizing the signal-to-noise ratio of the total score. Third, we use conditional probability density estimation to calculate the probability of each site to be functional given its conservation, the observed amino acid distribution, and the predicted ss and rsa states. We have constructed two large data sets, one based on the Catalytic Site Atlas and the other on PDB SITE records, to benchmark methods for predicting functional residues. The new method FRcons predicts ligand-binding and catalytic residues with higher precision than alternative methods over the entire sensitivity range, reaching 50 and 40 precision at 20 sensitivity, respectively.", "paper_title": "Prediction of protein functional residues from sequence by probability density estimation", "paper_id": "WOS:000253746400003"}