{"auto_keywords": [{"score": 0.041743876102144424, "phrase": "pt"}, {"score": 0.01571727655651546, "phrase": "arm_movement_performance"}, {"score": 0.012439844115407602, "phrase": "desired_movement"}, {"score": 0.004645057834614705, "phrase": "motor_performance"}, {"score": 0.004574085781766281, "phrase": "important_component"}, {"score": 0.004412654209742722, "phrase": "sensory-motor_disability"}, {"score": 0.003861175855298779, "phrase": "stochastic_characteristics"}, {"score": 0.0034308688638878286, "phrase": "point-to-point_movement"}, {"score": 0.002955782731675529, "phrase": "single_\"goodness-of-fit\"_value"}, {"score": 0.002494466951433885, "phrase": "velocity_profile"}, {"score": 0.0022856052476424344, "phrase": "automatic_method"}, {"score": 0.0022047613106966723, "phrase": "healthy_subjects"}, {"score": 0.0021049977753042253, "phrase": "healthy_and_post-stroke_hemiplegic_subjects"}], "paper_keywords": ["Assessment", " Movement representation", " Movement primitives", " Point-to-point movements", " Probability tube", " Rehabilitation"], "paper_abstract": "Quantification of motor performance is an important component of the rehabilitation of humans with sensory-motor disability. We developed a method for assessing arm movement performance of trainees (patients) termed \"probability tube\" (PT). PT captures the stochastic characteristics of a desired movement when repeated by an expert (therapist). The PT is being generated automatically from data recorded during point-to-point movement executed not more than 15 repetitions by the clinician and/or other non-expert programmer in just a few minutes. We introduce the index, termed probability tube score (PTS), as a single \"goodness-of-fit\" value allowing quantified analysis of the recovery and effects of the therapy. This index in fact scores the difference between the movement (velocity profile) executed by the trainee and the velocity profile of the desired movement (executed by the expert). We document the goodness of the automatic method with results from studies which included healthy subjects and show the use of the PTS in healthy and post-stroke hemiplegic subjects.", "paper_title": "A method for assessing the arm movement performance: probability tube", "paper_id": "WOS:000326706400004"}