{"auto_keywords": [{"score": 0.04940587850605657, "phrase": "transfer_functions"}, {"score": 0.0050685784858982945, "phrase": "quantifier_elimination"}, {"score": 0.00481495049065317, "phrase": "quantifier_elimination."}, {"score": 0.0043194180167921165, "phrase": "transfer_function"}, {"score": 0.004198722289738563, "phrase": "single_instruction"}, {"score": 0.0040049806975968145, "phrase": "abstract_output_state"}, {"score": 0.003948613642680196, "phrase": "net_effect"}, {"score": 0.0035755653799043, "phrase": "constituent_instructions"}, {"score": 0.0033943947596098583, "phrase": "single_transfer_function"}, {"score": 0.002705059527911504, "phrase": "computational_bottleneck"}, {"score": 0.002580061425699194, "phrase": "small_blocks"}, {"score": 0.002155412043665635, "phrase": "input_and_output_states"}, {"score": 0.0021049977753042253, "phrase": "linear_template_constraints"}], "paper_keywords": ["Abstract interpretation", " static analysis", " automatic abstraction", " transfer functions", " linear constraints"], "paper_abstract": "Traditionally, transfer functions have been designed manually for each operation in a program, instruction by instruction. In such a setting, a transfer function describes the semantics of a single instruction, detailing how a given abstract input state is mapped to an abstract output state. The net effect of a sequence of instructions, a basic block, can then be calculated by composing the transfer functions of the constituent instructions. However, precision can be improved by applying a single transfer function that captures the semantics of the block as a whole. Since blocks are program-dependent, this approach necessitates automation. There has thus been growing interest in computing transfer functions automatically, most notably using techniques based on quantifier elimination. Although conceptually elegant, quantifier elimination inevitably induces a computational bottleneck, which limits the applicability of these methods to small blocks. This paper contributes a method for calculating transfer functions that finesses quantifier elimination altogether, and can thus be seen as a response to this problem. The practicality of the method is demonstrated by generating transfer functions for input and output states that are described by linear template constraints, which include intervals and octagons.", "paper_title": "TRANSFER FUNCTION SYNTHESIS WITHOUT QUANTIFIER ELIMINATION", "paper_id": "WOS:000309447200017"}