{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "search_interface"}, {"score": 0.04811643643051332, "phrase": "visually_impaired_users"}, {"score": 0.03935512626074735, "phrase": "speech-based_screen_readers"}, {"score": 0.015557955264077659, "phrase": "visually_impaired_searchers"}, {"score": 0.015239332329390252, "phrase": "information-seeking_behavior"}, {"score": 0.014697130009140085, "phrase": "search_interfaces"}, {"score": 0.011049420337816545, "phrase": "complex_information"}, {"score": 0.004291617358806677, "phrase": "previous_article"}, {"score": 0.004072851768196397, "phrase": "complex_search_tasks"}, {"score": 0.003234934827553253, "phrase": "trailnote"}, {"score": 0.003069867656852932, "phrase": "search_process"}, {"score": 0.0029593432468318745, "phrase": "spelling-support_mechanism"}, {"score": 0.002867771524071872, "phrase": "previously_observed_difficulties"}, {"score": 0.002721388234661538, "phrase": "user_experience"}, {"score": 0.002651015392318126, "phrase": "interface_features"}, {"score": 0.0024377918036784336, "phrase": "proposed_interface"}, {"score": 0.0023133055945761235, "phrase": "interface_components"}, {"score": 0.0021049977753042253, "phrase": "proposed_interface_features"}], "paper_keywords": ["human computer interaction", " information seeking", " interfaces"], "paper_abstract": "Understanding the information-seeking behavior of visually impaired users is essential to designing search interfaces that support them during their search tasks. In a previous article, we reported the information-seeking behavior of visually impaired users when performing complex search tasks on the web, and we examined the difficulties encountered when interacting with search interfaces via speech-based screen readers. In this article, we use our previous findings to inform the design of a search interface to support visually impaired users for complex information seeking. We particularly focus on implementing TrailNote, a tool to support visually impaired searchers in managing the search process, and we also redesign the spelling-support mechanism using nonspeech sounds to address previously observed difficulties in interacting with this feature. To enhance the user experience, we have designed interface features to be technically accessible as well as usable with speech-based screen readers. We have evaluated the proposed interface with 12 visually impaired users and studied how they interacted with the interface components. Our findings show that the search interface was effective in supporting participants for complex information seeking and that the proposed interface features were accessible and usable with speech-based screen readers.", "paper_title": "Evaluating a search interface for visually impaired searchers", "paper_id": "WOS:000363213000006"}