{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "xml_documents"}, {"score": 0.004695900553353526, "phrase": "extensible_markup_language"}, {"score": 0.0035827424231607784, "phrase": "machine_learning"}, {"score": 0.0032085525502105836, "phrase": "sentence_extraction"}, {"score": 0.0031606404966938568, "phrase": "ordering_task"}, {"score": 0.003051601113971322, "phrase": "inex_and_summac_datasets"}, {"score": 0.002873331232538783, "phrase": "logical_structure"}, {"score": 0.0026919067120537055, "phrase": "learnable_system"}, {"score": 0.002315658491366464, "phrase": "entire_documents"}, {"score": 0.0022582634725291225, "phrase": "varying_granularity"}, {"score": 0.002224510044064184, "phrase": "xml_tree"}, {"score": 0.0021049977753042253, "phrase": "intelligent_summarisation"}], "paper_keywords": ["text summarisation", " XML documents", " machine learning", " ranking functions"], "paper_abstract": "Documents formatted in eXtensible Markup Language (XML) are available in collections of various document types. In this paper, we present an approach for the summarisation of XML documents. The novelty of this approach lies in that it is based on features not only from the content of documents, but also from their logical structure. We follow a machine learning, sentence extraction-based summarisation technique. To find which features are more effective for producing summaries, this approach views sentence extraction as an ordering task. We evaluated our summarisation model using the INEX and SUMMAC datasets. The results demonstrate that the inclusion of features from the logical structure of documents increases the effectiveness of the summariser, and that the learnable system is also effective and well-suited to the task of summarisation in the context of XML documents. Our approach is generic, and is therefore applicable, apart from entire documents, to elements of varying granularity within the XML tree. We view these results as a step towards the intelligent summarisation of XML documents.", "paper_title": "Learning-based summarisation of XML documents", "paper_id": "WOS:000247204400002"}