{"auto_keywords": [{"score": 0.004748556604045108, "phrase": "track_initiation"}, {"score": 0.004491970050862321, "phrase": "organized_insect_communities"}, {"score": 0.004338661611644755, "phrase": "novel_ant_system"}, {"score": 0.004249188865832993, "phrase": "\"subtractive\"_color_mixing_model"}, {"score": 0.00367228341822469, "phrase": "multi-sensor_multi-target_system"}, {"score": 0.003378385493203297, "phrase": "colored_pheromones"}, {"score": 0.0028590732866152118, "phrase": "three-dimensional_parameter_space"}, {"score": 0.002761340122199076, "phrase": "best_solutions"}, {"score": 0.002241087008892355, "phrase": "favorable_performance"}, {"score": 0.0021947755130109696, "phrase": "clutter-free_and_cluttered_environment"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Track initiation", " Bearings-only", " Ant colony optimization", " Three primary colors"], "paper_abstract": "Inspired from various colors of ants in organized insect communities, we propose a novel ant system with a \"subtractive\" color mixing model of three primary colors for jointly estimating the number of tracks to be initiated and their individual tracks in the multi-sensor multi-target system. Firstly, each ant is assumed to deposit only one type of colored pheromones all the time, namely, cyan, magenta, or yellow, and ant's decision depends on the colored pheromone similarity comparison with candidates to be visited. Then a mixture optimization function on a three-dimensional parameter space is proposed to exploit best solutions by the following ants, which results in a group of nearly cyan, magenta, or yellow tracks of interest. Finally, a new track initiation evaluation metric, i.e., Optimal Sub-Pattern Assignment (OSPA) distance, is introduced for the unknown number of tracks. Simulation results indicate favorable performance both in clutter-free and cluttered environment. (C) 2011 Elsevier Ltd. All rights reserved.", "paper_title": "Ants with three primary colors for track initiation", "paper_id": "WOS:000290237500086"}