{"auto_keywords": [{"score": 0.04714571490878041, "phrase": "stress_response"}, {"score": 0.040351615512645, "phrase": "tsst"}, {"score": 0.009334256898787708, "phrase": "arithmetic_task"}, {"score": 0.009207602147525829, "phrase": "evaluating_committee"}, {"score": 0.0074183663098289785, "phrase": "virtual_humans"}, {"score": 0.0065402755076259, "phrase": "immersive_vr_system"}, {"score": 0.00481495049065317, "phrase": "virtual_reality_version"}, {"score": 0.004495598802612427, "phrase": "healthy_and_clinical_populations"}, {"score": 0.004458722048888919, "phrase": "trier_social_stress_test"}, {"score": 0.003739970412586941, "phrase": "experimental_conditions"}, {"score": 0.0034345606706788273, "phrase": "professional_actors"}, {"score": 0.0034063576796640603, "phrase": "computerized_version"}, {"score": 0.003145352865188648, "phrase": "original_tsst."}, {"score": 0.003102411189152985, "phrase": "present_pilot_study"}, {"score": 0.0030265836903931604, "phrase": "virtual_reality"}, {"score": 0.002944496186461491, "phrase": "vr-tsst"}, {"score": 0.002703869368554536, "phrase": "vr_equipment"}, {"score": 0.002681652319714448, "phrase": "cave"}, {"score": 0.0026450225118952713, "phrase": "head_tracking"}, {"score": 0.0025034338848015166, "phrase": "semi-structured_interview"}, {"score": 0.002442210408593024, "phrase": "subjective_and_physiological_data"}, {"score": 0.002395626697083963, "phrase": "vr_version"}, {"score": 0.0023370335547240727, "phrase": "seven_participants"}, {"score": 0.0022987679645976354, "phrase": "peak_increase"}, {"score": 0.0022861521898625194, "phrase": "heart_rate"}, {"score": 0.002224101991430931, "phrase": "traditional_tsst"}, {"score": 0.0022118950795192503, "phrase": "real_actors"}, {"score": 0.0021049977753042253, "phrase": "laboratory_conditions"}], "paper_keywords": [""], "paper_abstract": "One of the most common methods of inducing stress in the laboratory in order to examine the stress response in healthy and clinical populations is the Trier Social Stress Test (TSST). Briefly, the participant is asked to deliver a speech and to perform an arithmetic task in front of an evaluating committee. The committee, consisting of three trained actors, does not respond emotionally during the test, which makes the situation very stressful for the participant. One disadvantage of the TSST is that it can be difficult to hold the experimental conditions constant. In particular, it may be difficult for actors to hold their acting constant across all sessions. Furthermore, there are several practical problems and costs associated with hiring professional actors. A computerized version of the TSST using virtual humans could be a way to avoid these problems provided that it is able to induce a stress response similar to the one of the original TSST. The purpose of the present pilot study was therefore to investigate the stress response to a virtual reality (VR) version of the TSST visualized using an immersive VR system (VR-TSST). Seven healthy males with an average age of 24 years (range: 23-26 years) performed the VR-TSST. This included delivering a speech and performing an arithmetic task in front of an evaluating committee consisting of three virtual humans. The VR equipment was a CAVE equipped with stereoscopy and head tracking. ECG and respiration were recorded as well as the participant's behavior and comments. Afterward, a semi-structured interview was carried out. In general, the subjective and physiological data from the experiment indicated that the VR version of the TSST induced a stress response in the seven participants. In particular, the peak increase in heart rate was close to rates observed in studies using the traditional TSST with real actors. These results suggest that virtual humans visualized with an immersive VR system can be used to induce stress under laboratory conditions.", "paper_title": "A Virtual Reality Version of the Trier Social Stress Test: A Pilot Study", "paper_id": "WOS:000296789400003"}