{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "non-commutative_ring_homomorphism"}, {"score": 0.010392601872679565, "phrase": "signing_order"}, {"score": 0.004568108391981922, "phrase": "multisignature_schemes"}, {"score": 0.004496542293425754, "phrase": "multisignature_scheme"}, {"score": 0.003819339842998955, "phrase": "algebraic_structure"}, {"score": 0.0037793152987497286, "phrase": "underlying_algebraic_operation"}, {"score": 0.0037005154613244363, "phrase": "chida"}, {"score": 0.0036617315529835497, "phrase": "shizuya"}, {"score": 0.0036233530071736178, "phrase": "nishizeki"}, {"score": 0.0035477930970463432, "phrase": "structured_multisignature_scheme"}, {"score": 0.0030935140058168885, "phrase": "improved_structured_multisignature_scheme"}, {"score": 0.002798662730881037, "phrase": "signer_structure_forgery"}, {"score": 0.002769304577201566, "phrase": "rogue_key_attack"}, {"score": 0.002697245874076643, "phrase": "discrete_logarithm_assumption"}, {"score": 0.0021049977753042253, "phrase": "ring_homomorphism"}], "paper_keywords": ["multisignature scheme", " structured multisignature scheme", " homomorphic scheme", " non-commutative ring homomorphism", " random oracle model"], "paper_abstract": "Verifying the signing order is sometimes very important in multisignature schemes. A multisignature scheme in which the signing order can be verified is called structured multisignature scheme and many such schemes have been proposed so far. However, there are not many structured multisignature schemes utilizing an algebraic structure of underlying algebraic operation. Ohmori, Chida, Shizuya and Nishizeki have proposed a structured multisignature scheme by utilizing a non-commutative ring homomorphism. Since their scheme does not fully reflect the structure of signers and its rigorous security analysis is not provided, we construct an improved structured multisignature scheme overcoming these problems by utilizing the non-commutative ring homomorphism in a different way and discuss its rigorous security against various attacks, including signer structure forgery, rogue key attack and attack-0 under the discrete logarithm assumption. As far as we know, the scheme in [30], which does not use non-commutative ring homomorphism, guarantees the most rigorous security but the number of signers is restricted in order to prevent attack-0. In contrast, our scheme overcomes attack-0 by virtue of a ring homomorphism and no restriction is imposed on the number of signers.", "paper_title": "A Secure Structured Multisignature Scheme Based on a Non-commutative Ring Homomorphism", "paper_id": "WOS:000292480700016"}