{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "common_structure"}, {"score": 0.004316722156877335, "phrase": "weight_matrices"}, {"score": 0.004116440453049531, "phrase": "hilbert-schmidt_product"}, {"score": 0.0038698476651328898, "phrase": "hilbert-schmidt_matrix_s"}, {"score": 0.0037432199549135826, "phrase": "geometrical_representation"}, {"score": 0.003355515315708125, "phrase": "first_axis"}, {"score": 0.003307988966112615, "phrase": "matrix_s"}, {"score": 0.0031096747349602344, "phrase": "error_matrix"}, {"score": 0.0030949200330108156, "phrase": "e._therefore"}, {"score": 0.003007846011394511, "phrase": "vector_root"}, {"score": 0.0028140548269469934, "phrase": "former_models"}, {"score": 0.0025103699913760057, "phrase": "new_symmetric_model"}, {"score": 0.0022076314894741394, "phrase": "human_immunodeficiency_virus"}, {"score": 0.0021049977753042253, "phrase": "proposed_model"}], "paper_keywords": ["AIDS", " F tests", " Hilbert-Schmidt product", " HIV", " STATIS method"], "paper_abstract": "Consider the situation where the Structuration des Tableaux A Trois Indices de la Statistique (STATIS) methodology is applied to a series of studies, each study being represented by data and weight matrices. Relations between studies may be captured by the Hilbert-Schmidt product of these matrices. Specifically, the eigenvalues and eigenvectors of the Hilbert-Schmidt matrix S may be used to obtain a geometrical representation of the studies. The studies in a series may further be considered to have a common structure whenever their corresponding points lie along the first axis. The matrix S can be expressed as the sum of a rank 1 matrix lambda uu(T) with an error matrix E. Therefore, the components of the vector root lambda u are sufficient to locate the points associated to the studies. Former models for S where vec(E) are mathematically tractable and yet do not take into account the symmetry of the matrix S. Thus a new symmetric model is proposed as well as the corresponding tests for a common structure. It is further shown how to assess the goodness of fit of such models. An application to the human immunodeficiency virus (HIV) infection is used for assessing the proposed model. (C) 2006 Elsevier B.V. All rights reserved.", "paper_title": "Modelling series of studies with a common structure", "paper_id": "WOS:000249316000034"}