{"auto_keywords": [{"score": 0.045529220460039106, "phrase": "reconfigurable_hardware"}, {"score": 0.02613764765316624, "phrase": "overhead_costs"}, {"score": 0.004650086856905758, "phrase": "runtime_environment"}, {"score": 0.004604023526673226, "phrase": "mapping_image_processing_applications"}, {"score": 0.004188459638572375, "phrase": "image_analyst"}, {"score": 0.0038869467872381957, "phrase": "processing_pipeline"}, {"score": 0.003661382948704217, "phrase": "hardware_and_software_component_implementations"}, {"score": 0.0035183010916001664, "phrase": "source_code"}, {"score": 0.003380791705551809, "phrase": "input_data"}, {"score": 0.003044785536429499, "phrase": "image_processing_pipelines"}, {"score": 0.002984665318717504, "phrase": "image_processing"}, {"score": 0.0024941578231560055, "phrase": "experimental_results"}, {"score": 0.0023028105026714533, "phrase": "correct_implementation"}, {"score": 0.0022463152084201184, "phrase": "dynamo"}], "paper_keywords": [""], "paper_abstract": "The Dynamo system provides a runtime environment for mapping image processing applications to hardware/software platforms that contain a mix of processors and reconfigurable hardware. Dynamo can be used by an image analyst with no knowledge of HW/SW design. The analyst specifies the algorithms implemented in a processing pipeline and the input data. Dynamo dynamically selects the most efficient combination of hardware and software component implementations to minimize pipeline runtime, generates the source code that implements the pipeline, processes the input data using the implementation, and returns the results. We present the design and implementation of Dynamo. Our target domain is image processing pipelines. We chose image processing (IP) because many IP algorithms benefit from acceleration using reconfigurable hardware and many IP applications are structured as a pipeline, where each component can be implemented in software or hardware. Our performance modeling incorporates profiles based on experimental results and on overhead costs. Our results show that modeling of overhead costs is essential to choosing the correct implementation. We illustrate how Dynamo chooses a mix of hardware and software implementations to minimize runtime for several different image processing applications.", "paper_title": "Dynamo: a runtime partitioning system for FPGA-based HW/SW image processing systems", "paper_id": "WOS:000208119000002"}