{"auto_keywords": [{"score": 0.042412816998429005, "phrase": "remote_patient_monitoring_platforms"}, {"score": 0.031198882608858298, "phrase": "local_time"}, {"score": 0.030864586550531828, "phrase": "underlying_continuous_reference_timeline"}, {"score": 0.00481495049065317, "phrase": "reliable_timestamps"}, {"score": 0.004779564521350969, "phrase": "remote_patient_monitoring"}, {"score": 0.0045726187330434025, "phrase": "remote_patient"}, {"score": 0.004489046493029801, "phrase": "patient_data"}, {"score": 0.004263046902817659, "phrase": "hospital_systems"}, {"score": 0.004078374881132062, "phrase": "ihe"}, {"score": 0.003844478919573134, "phrase": "reliable_time_sources"}, {"score": 0.0036373553416391823, "phrase": "significant_periods"}, {"score": 0.003557653536102669, "phrase": "existing_guidelines"}, {"score": 0.0034160263294684785, "phrase": "operating_scenarios"}, {"score": 0.002860938351029155, "phrase": "timestamp_formats"}, {"score": 0.0027982016314450717, "phrase": "different_conditions"}, {"score": 0.002716681656135794, "phrase": "existing_definition"}, {"score": 0.002570162055835289, "phrase": "universal_coordinated_time"}, {"score": 0.002551231163230566, "phrase": "network_time_protocol_time"}, {"score": 0.0025230952890994236, "phrase": "geographic_time_zone"}, {"score": 0.0021049977753042253, "phrase": "subsequent_receiver"}], "paper_keywords": ["Remote patient monitoring", " telehealth", " timestamps", " time standards"], "paper_abstract": "Having timestamps that are robust and reliable is essential for remote patient monitoring in order for patient data to have context and to be correlated with other data. However, unlike hospital systems for which guidelines on timestamps are currently provided by HL7 and IHE, remote patient monitoring platforms are: operated in environments where it can be difficult to synchronize with reliable time sources; include devices with simple or no clock; and may store data spanning significant periods before able to upload. Existing guidelines prove inadequate. This paper analyzes the requirements and the operating scenarios of remote patient monitoring platforms and defines a framework to convey information on the conditions under which observations were made by the device and forwarded by the gateway in order for data to be managed appropriately and to include both reference to local time and an underlying continuous reference timeline. We define the timestamp formats of HL7 to denote the different conditions of operation and describe extensions to the existing definition of the HL7 timestamp to differentiate between time local to GMT (+0000) and universal coordinated time or network time protocol time where no geographic time zone is implied (-0000). We further describe how timestamps from devices having only simple or no clocks might be managed reliably by a gateway to provide timestamps that are referenced to local time and an underlying continuous reference timeline. We extend the HL7 message to include information to permit a subsequent receiver of the data to understand the quality of the timestamp and how it has been translated. We present evaluation from deploying a platform for 12 months.", "paper_title": "Designing Robust and Reliable Timestamps for Remote Patient Monitoring", "paper_id": "WOS:000360791200021"}