{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "class_cohesion_measurements"}, {"score": 0.04966447721457641, "phrase": "software_metrics"}, {"score": 0.004690952711665194, "phrase": "component_certification"}, {"score": 0.00457013354092966, "phrase": "high_quality_software"}, {"score": 0.004244375827831527, "phrase": "wide_range"}, {"score": 0.003535320700255283, "phrase": "case_study"}, {"score": 0.003504670673093149, "phrase": "class_cohesion"}, {"score": 0.003459191419478298, "phrase": "quality_attribute"}, {"score": 0.00326881479036966, "phrase": "prominent_object-oriented_class_cohesion_metrics"}, {"score": 0.002818850283787242, "phrase": "probability_distribution"}, {"score": 0.0023782753249846794, "phrase": "error_probability_distribution"}, {"score": 0.002237477619351199, "phrase": "large_set"}, {"score": 0.0021797112385590913, "phrase": "single_metric"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Class cohesion metrics", " Metrics validity", " Connection types", " Metrics classification criteria", " Uncertainty"], "paper_abstract": "Software metrics are essential for component certification and for the development of high quality software in general. Accordingly, research in the area of software metrics has been active and a wide range of metrics has been proposed. However, the variety of metrics proposed for measuring the same quality attribute suggests that there may be some sort of inconsistencies among the measurements computed using these metrics. in this paper, we report a case study considering class cohesion as a quality attribute of concern. We present the results of our empirical investigation to confirm that prominent object-oriented class cohesion metrics provide inconsistent measurements. We also present an analysis of the uncertainty that should be considered in these class cohesion measurements due to their inter-inconsistencies. Considering such uncertainty, we provide a framework for associating a probability distribution of error to the measurements computed by each metric; thus enabling the assessment of the degree of reliability of measurements of each metric when used to rank a set of classes with regard to their cohesion quality. The error probability distribution would be useful in practice where it is seldom feasible to use a large set of metrics and rather a single metric is used. (C) 2010 Elsevier B.V. All rights reserved.", "paper_title": "A study on the uncertainty inherent in class cohesion measurements", "paper_id": "WOS:000290741600013"}