{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "uncertain_parameters"}, {"score": 0.03363896917055258, "phrase": "robust_approach"}, {"score": 0.014945421901783886, "phrase": "npv"}, {"score": 0.012840900469763014, "phrase": "historical_data"}, {"score": 0.010150376510041676, "phrase": "robust_npv"}, {"score": 0.008796067390516171, "phrase": "traditional_approach"}, {"score": 0.004682708592184678, "phrase": "new_approach"}, {"score": 0.004617949594931096, "phrase": "net_present_value"}, {"score": 0.004491093879657087, "phrase": "financial_processes"}, {"score": 0.004267468074128779, "phrase": "closed_and_convex_region"}, {"score": 0.004036141321779216, "phrase": "uncertainty_region"}, {"score": 0.003712362078915926, "phrase": "cash_flows"}, {"score": 0.0036609730219354796, "phrase": "high_significance"}, {"score": 0.0035603120865046432, "phrase": "npv."}, {"score": 0.003140401552000472, "phrase": "mathematical_formulation"}, {"score": 0.002997735656669146, "phrase": "presented_robust_npv"}, {"score": 0.0028350413546400703, "phrase": "numerical_examples"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Net present value", " Robust approach", " Future cash flows"], "paper_abstract": "Considering the variance and correlation of uncertain parameters, this study presents a new approach to computing net present value (NPV) of the financial processes. The changes of the uncertain parameters are postulated in a closed and convex region called the uncertainty region. The size and shape of the uncertainty region is selected based on the historical data and risk-taking or risk-aversion of the investor. The variance of cash flows is of high significance in analyzing the sensitivity of NPV. The model proposed in this study is highly reliable because of entering the covariance of historical data. In this study, using the robust approach, the mathematical formulation computing the robust NPV is presented. Programming of the presented robust NPV was done in C++ programming environment. The robust NPV is analyzed through presenting numerical examples. Simulating 10,000 random scenarios of uncertain parameters demonstrates that in circumstances where the traditional approach to computing NPV is doomed to a percentage of failure to make decisions, the robust approach never faces failure. The more positive the skewness in the scenarios produced, the higher is the probability of encountering failure in the traditional approach; whereas the robust approach still does not fail. (C) 2011 Elsevier Ltd. All rights reserved.", "paper_title": "Robust net present value", "paper_id": "WOS:000290014600024"}