{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "web_users'_online_information_behavior"}, {"score": 0.004187917910692495, "phrase": "behavioral_dimensions"}, {"score": 0.004143196873246147, "phrase": "web_users'_online_activities"}, {"score": 0.003306559295382181, "phrase": "related_behavioral_aspects"}, {"score": 0.0032712190037495975, "phrase": "online_panel_data"}, {"score": 0.0032189132350239013, "phrase": "month-long_clickstreams"}, {"score": 0.003100113931797863, "phrase": "taiwan"}, {"score": 0.0030017207229983385, "phrase": "empirical_validation"}, {"score": 0.002859977408815691, "phrase": "web_user's_width"}, {"score": 0.0027841357057119295, "phrase": "web_sites"}, {"score": 0.0024209250169088575, "phrase": "online_information_behavior"}, {"score": 0.0022818671653408278, "phrase": "behavioral_\"cube"}, {"score": 0.0021049977753042253, "phrase": "web_users'_explicit_online_information_search_propensity"}], "paper_keywords": [""], "paper_abstract": "Although the body of literature pertaining to the study of micro, context-specific behavior on the Web is growing, there lacks a global, macro analysis as to the behavioral dimensions of Web users' online activities. In an attempt to fill in the gap, this study proposes a three-dimensional, cubic typology for the characterization of Web users' online information behavior. We discuss a set of hypotheses concerning the relationships among these dimensions as well as those between these dimensions and related behavioral aspects. Online panel data consisting of month-long clickstreams of 2,022 Web users obtained from lnsightXplore, Taiwan are made available for the empirical validation of the hypotheses. We found that a Web user's width (i.e., number of categories of Web sites explored), length (i.e., number of sites visited per category), and depth (i.e., number of pages downloaded per site) of online information behavior are highly correlated. Furthermore, these three dimensions of the behavioral \"cube\" are positively associated with speed of navigation, but negatively associated with the Web users' explicit online information search propensity and the degree of relatedness among the sites they visited.", "paper_title": "Characterizing web users' online information behavior", "paper_id": "WOS:000250741100006"}