{"auto_keywords": [{"score": 0.04969278858326932, "phrase": "sos"}, {"score": 0.02397221403139985, "phrase": "negative_premises"}, {"score": 0.012359983354555081, "phrase": "sos_rules"}, {"score": 0.00481495049065317, "phrase": "ordered_sos._structured_operational_semantics"}, {"score": 0.0046993598473345395, "phrase": "popular_method"}, {"score": 0.004567990533989851, "phrase": "transition_rules"}, {"score": 0.004512814529823301, "phrase": "important_feature"}, {"score": 0.004246729915110547, "phrase": "priority_mechanisms"}, {"score": 0.003947973513495612, "phrase": "preferred_meaning"}, {"score": 0.003916098498242888, "phrase": "sos_specifications"}, {"score": 0.003791149592276883, "phrase": "phillips"}, {"score": 0.003760527969356061, "phrase": "ulidowski"}, {"score": 0.0035386420095120706, "phrase": "positive_gsos_rules"}, {"score": 0.0031845067058084583, "phrase": "general_sos_rules"}, {"score": 0.0026209522797963447, "phrase": "existing_congruence_meta-results"}, {"score": 0.0023680327896318915, "phrase": "rule_formats"}, {"score": 0.0021049977753042253, "phrase": "presented_definitions"}], "paper_keywords": [""], "paper_abstract": "Structured Operational Semantics (SOS) is a popular method for defining semantics by means of transition rules. An important feature of SOS rules is negative premises, which are crucial in the definitions of such phenomena as priority mechanisms and time-outs. However, the inclusion of negative premises in SOS rules also introduces doubts as to the preferred meaning of SOS specifications. Orderings on SOS rules were proposed by Phillips and Ulidowski as an alternative to negative premises. Apart from the definition of the semantics of positive GSOS rules with orderings, the meaning of more general types of SOS rules with orderings has not been studied hitherto. This paper presents several candidates for the meaning of general SOS rules with orderings and discusses their conformance to our intuition for such rules. We take two general frameworks (rule formats) for SOS with negative premises and SOS with orderings, and present semantics-preserving translations between them with respect to our preferred notion of semantics. Thanks to our semantics-preserving translation, we take existing congruence meta-results for strong bisimilarity from the setting of SOS with negative premises into the setting of SOS with orderings. We further compare the expressiveness of rule formats for SOS with orderings and SOS with negative premises. The paper contains also many examples that illustrate the benefits of SOS with orderings; and the properties of the presented definitions of meaning. (c) 2008 Elsevier Inc. All rights reserved.", "paper_title": "Semantics and expressiveness of ordered SOS", "paper_id": "WOS:000264109400002"}