{"auto_keywords": [{"score": 0.04962656673317322, "phrase": "embedded_wireless_networks"}, {"score": 0.040611423146622846, "phrase": "wireless_link_quality_variation"}, {"score": 0.029420333683948755, "phrase": "high-quality_links"}, {"score": 0.00481495049065317, "phrase": "link_quality_variation"}, {"score": 0.004255639740735269, "phrase": "reaction_time"}, {"score": 0.003925414526537783, "phrase": "experiential_evidence"}, {"score": 0.0035864603175592854, "phrase": "reliable_networks"}, {"score": 0.0035525230119401153, "phrase": "unreliable_links"}, {"score": 0.00332375606483146, "phrase": "software-centric_approach"}, {"score": 0.0031244995579170465, "phrase": "focus_oil_wireless_sensor_networks"}, {"score": 0.003051073364818384, "phrase": "alternative_radio_stack_implementation"}, {"score": 0.0030221882046953, "phrase": "tinyos"}, {"score": 0.0028274743316389437, "phrase": "packet_loss"}, {"score": 0.0026705669656375197, "phrase": "low-quality_links"}, {"score": 0.0025586128304269616, "phrase": "link_quality_spectrum"}], "paper_keywords": ["Embedded wireless networks", " wireless sensor networks", " wireless networks", " link quality", " radio stack", " TinyOS"], "paper_abstract": "Embedded wireless networks are the catalyst for transforming the way we interact with Our environment, observe our planet, and protect Our communities. But the reaction time has been slow; the systems that realize this transformation are notoriously difficult to implement. Experiential evidence indicates that wireless link quality variation ill both the spatial and temporal dimensions is partially to blame. In short, it is difficult to realize reliable networks using unreliable links that fluctuate in quality over space and time. Here we present a software-centric approach to reducing the impact of wireless link quality variation in embedded networks, with a focus oil wireless sensor networks, We present an alternative radio stack implementation for TinyOS, the emerging operating system standard. The implementation is adaptive, masking packet loss over medium- to high-quality links, while identifying and avoiding transmissions over low-quality links. The impact is a simplification of the link quality spectrum: designers contend only with high-quality links; irreparable links are marked as (lead. We evaluate the performance of the alternative relative to its TinyOS Counterpart oil a network of 80 wireless nodes. Three representative evaluation contexts are considered: (i) neighbor-to-neighbor, (ii) distributed convergecast, and (iii) distributed divergecast.", "paper_title": "Reducing the Impact of Link Quality Variation in Embedded Wireless Networks", "paper_id": "WOS:000263985500001"}