{"auto_keywords": [{"score": 0.04618870497358489, "phrase": "secret_key"}, {"score": 0.02322730111336098, "phrase": "average_information_rate"}, {"score": 0.01053161194671422, "phrase": "secret-sharing_schemes"}, {"score": 0.0047415081747150065, "phrase": "graph-based_weighted_threshold_access_structures"}, {"score": 0.004340343873304156, "phrase": "n_participants"}, {"score": 0.0040190868373730015, "phrase": "unqualified_subsets"}, {"score": 0.003837817436476726, "phrase": "qualified_subsets"}, {"score": 0.0035536228914319354, "phrase": "secret-sharing_scheme"}, {"score": 0.0033932753847910366, "phrase": "maximum_size"}, {"score": 0.003227693600591227, "phrase": "weighted_threshold_scheme"}, {"score": 0.002735284807307981, "phrase": "weighted_threshold_access_structure"}, {"score": 0.0025521085778978042, "phrase": "access_structures"}, {"score": 0.0024842242921857705, "phrase": "information_rate"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Secret-sharing scheme", " Access structure", " Optimal information rate", " Optimal average information rate", " Weighted threshold access structure", " Complete multipartite covering"], "paper_abstract": "A secret-sharing scheme is a protocol by which a dealer distributes shares of a secret key among a set of n participants in such a way that only qualified subsets of participants can reconstruct the secret key from the shares they received, while unqualified subsets have no information about the secret key. The collection of all qualified subsets is called the access structure of this scheme. The information rate (resp. average information rate) of a secret-sharing scheme is the ratio between the size of the secret key and the maximum size (resp. average size) of the shares. In a weighted threshold scheme, each participant has his or her own weight. A subset is qualified if and only if the sum of the weights of participants in the subset is not less than the given threshold. Morillo et al. [19] considered the schemes for weighted threshold access structure that can be represented by graphs called k-weighted graphs. They characterized this kind of access structures and derived a result on the information rate. In this paper, we deal with the average information rate of the secret-sharing schemes for these structures. Two sophisticated constructions are presented, each of which has its own advantages and both of them perform very well when n/k is large. (C) 2013 Elsevier Inc. All rights reserved.", "paper_title": "New bounds on the average information rate of secret-sharing schemes for graph-based weighted threshold access structures", "paper_id": "WOS:000320684900006"}