{"auto_keywords": [{"score": 0.03719615111360805, "phrase": "de-identification_tool"}, {"score": 0.031362790555984975, "phrase": "real_records"}, {"score": 0.029894724664374293, "phrase": "resynthesized_records"}, {"score": 0.00481495049065317, "phrase": "personal_identifier"}, {"score": 0.004764435715755502, "phrase": "clinical_text_de-identification"}, {"score": 0.0047310525657970615, "phrase": "objective_de-identified"}, {"score": 0.00463229351153731, "phrase": "biomedical_research"}, {"score": 0.004472234553892357, "phrase": "\"resynthesis\"_components"}, {"score": 0.004425299304063172, "phrase": "real_identifiers"}, {"score": 0.004394281902031765, "phrase": "synthetic_identifiers"}, {"score": 0.004183137595671171, "phrase": "possible_bias"}, {"score": 0.0041102032028337366, "phrase": "de-identification_software"}, {"score": 0.0040102184336632376, "phrase": "mitre"}, {"score": 0.0038989120088094185, "phrase": "resynthesis_capability"}, {"score": 0.0038579703525471985, "phrase": "clinical_text"}, {"score": 0.0038309141193444015, "phrase": "vanderbilt_university_medical_center_patient_records"}, {"score": 0.003672500644750565, "phrase": "medication_orders"}, {"score": 0.0036467403626789666, "phrase": "discharge_summaries"}, {"score": 0.003621160116056119, "phrase": "clinical_notes"}, {"score": 0.0035082436540296406, "phrase": "real_and_resynthesized_records"}, {"score": 0.0032467792804296036, "phrase": "protected_health_identifiers"}, {"score": 0.0030581212589623737, "phrase": "real_and_resynthesized_vanderbilt_records"}, {"score": 0.0024066745849759706, "phrase": "training_and_test_sets"}, {"score": 0.002298902547676131, "phrase": "resynthesis_component"}, {"score": 0.002134888329742086, "phrase": "resynthesized_data"}, {"score": 0.0021049977753042253, "phrase": "real_data"}], "paper_keywords": [""], "paper_abstract": "Objective De-identified medical records are critical to biomedical research. Text de-identification software exists, including \"resynthesis\" components that replace real identifiers with synthetic identifiers. The goal of this research is to evaluate the effectiveness and examine possible bias introduced by resynthesis on de-identification software. Design We evaluated the open-source MITRE Identification Scrubber Toolkit, which includes a resynthesis capability, with clinical text from Vanderbilt University Medical Center patient records. We investigated four record classes from over 500 patients' files, including laboratory reports, medication orders, discharge summaries and clinical notes. We trained and tested the de-identification tool on real and resynthesized records. Measurements We measured performance in terms of precision, recall, F-measure and accuracy for the detection of protected health identifiers as designated by the HIPAA Safe Harbor Rule. Results The de-identification tool was trained and tested on a collection of real and resynthesized Vanderbilt records. Results for training and testing on the real records were 0.990 accuracy and 0.960 F-measure. The results improved when trained and tested on resynthesized records with 0.998 accuracy and 0.980 F-measure but deteriorated moderately when trained on real records and tested on resynthesized records with 0.989 accuracy 0.862 F-measure. Moreover, the results declined significantly when trained on resynthesized records and tested on real records with 0.942 accuracy and 0.728 F-measure. Conclusion The de-identification tool achieves high accuracy when training and test sets are homogeneous lie, both real or resynthesized records). The resynthesis component regularizes the data to make them less \"realistic,\" resulting in loss of performance particularly when training on resynthesized data and testing on real data.", "paper_title": "Effects of personal identifier resynthesis on clinical text de-identification", "paper_id": "WOS:000275488100007"}