{"auto_keywords": [{"score": 0.0474863952677414, "phrase": "paper-based_tutorial"}, {"score": 0.04060963584645688, "phrase": "software_training"}, {"score": 0.027507999683207576, "phrase": "paper-based_condition"}, {"score": 0.00481495049065317, "phrase": "paper-based_and_video_tutorials"}, {"score": 0.004682917599491709, "phrase": "software_usage"}, {"score": 0.004257000695796238, "phrase": "recorded_demonstrations"}, {"score": 0.004123781267600542, "phrase": "instructional_medium"}, {"score": 0.0039005612858880115, "phrase": "video_tutorial"}, {"score": 0.0029292375702719468, "phrase": "word's_formatting_options"}, {"score": 0.0028715299874549245, "phrase": "significant_and_substantial_improvements"}, {"score": 0.002705121052747945, "phrase": "mixed_a"}, {"score": 0.0026412824985309323, "phrase": "video_conditions"}, {"score": 0.0025687008721685454, "phrase": "significant_and_substantial_learning_gains"}, {"score": 0.0023439376937579204, "phrase": "video_tutorials"}, {"score": 0.002279508335630797, "phrase": "design_guidelines"}, {"score": 0.0021992603252793995, "phrase": "video's_strong_qualities"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Computer-mediated communication", " Teaching/learning strategies", " Tutorials", " Video"], "paper_abstract": "Instruction on software usage has long been dominated by the paper-based tutorial. This dominance is now being challenged with the rise of facilities for producing and publishing recorded demonstrations (video). Typically, each instructional medium has its own qualities. The present study aimed to optimize the design of a video tutorial for software training by attending to both its strengths and its weaknesses vis-a-vis a paper-based tutorial. Based on a distinction between two functionally different components in software tutorials, four tutorial configurations were compared: Paper-based, Mixed A (paper-based preview and video procedure), Mixed B (video preview and paper-based procedure), and Video. The 111 fifth and sixth grade participants (mean age 11.8) received instructions about Word's formatting options. The findings indicated significant and substantial improvements from pre-test to training in all conditions. In addition, participants in the Mixed A, Mixed B, and Video conditions outperformed those in the Paper-based condition. Significant and substantial learning gains were found from pre-test to post-test. Both the Mixed B and Video conditions outperformed the Paper-based condition. The success of the Mixed A, Mixed B, and Video tutorials is ascribed to the use of design guidelines for software training that direct the designer to optimize video's strong qualities and moderate or reduce its relative weaknesses. (C) 2014 Elsevier Ltd. All rights reserved.", "paper_title": "A comparison of paper-based and video tutorials for software learning", "paper_id": "WOS:000341675100015"}