{"auto_keywords": [{"score": 0.04330320170884125, "phrase": "translation_errors"}, {"score": 0.02322730111336099, "phrase": "machine_translation"}, {"score": 0.021116892721056383, "phrase": "multilingual_communication"}, {"score": 0.0104359727000789, "phrase": "agent_metaphor"}, {"score": 0.008045230435793903, "phrase": "transparent-channel_metaphor"}, {"score": 0.007585569210519578, "phrase": "machine_translator"}, {"score": 0.0071519812042449525, "phrase": "dialog_participants"}, {"score": 0.004674952036988355, "phrase": "novel_interactive_system"}, {"score": 0.004016485454498076, "phrase": "quality_limitation"}, {"score": 0.003982741546775355, "phrase": "current_machine_translators"}, {"score": 0.003599182629885611, "phrase": "human-interpreter_metaphor"}, {"score": 0.002914288956035066, "phrase": "translation_issues"}, {"score": 0.0024302416436559867, "phrase": "interaction_process"}, {"score": 0.0023996317685956213, "phrase": "decision_support"}, {"score": 0.0023794391656001466, "phrase": "autonomous_behavior"}, {"score": 0.0023003498123420237, "phrase": "repair_strategy"}, {"score": 0.0022522565004588113, "phrase": "english-chinese_communication_task_experiment"}, {"score": 0.0021049977753042253, "phrase": "human_communication_effort"}], "paper_keywords": ["Multilingual Communication", " Machine Translation Mediated Communication", " Interactivity", " Translation Repair Strategy", " Language Service"], "paper_abstract": "We present agent metaphor as a novel interactive system to promote the efficiency in machine translation mediated communication. Machine translation is increasingly used to support multilingual communication. In the traditional, transparent-channel way of using machine translation for the multilingual communication, translation errors are ignorable, due to the quality limitation of current machine translators. Those translation errors will break the communication and lead to miscommunication. We propose to shift the paradigm from the transparent-channel metaphor to the human-interpreter metaphor, which motives the interactions between the users and the machine translator. Following this paradigm shifting, the interpreter (agent) encourages the dialog participants to collaborate, as their interactivity will be helpful in reducing the number of translation errors, the noise of the channel. We examine the translation issues raised by multilingual communication, and analyze the impact of interactivity on the elimination of translation errors. We propose an implementation of the agent metaphor, which promotes interactivity between dialog participants and the machine translator. We design the architecture of our agent, analyze the interaction process, describe decision support and autonomous behavior, and provide an example of preparing repair strategy. We conduct an English-Chinese communication task experiment on tangram arrangement. The experiment shows that compared to the transparent-channel metaphor, our agent metaphor reduces human communication effort by 21.6%.", "paper_title": "Translation Agent: A New Metaphor for Machine Translation", "paper_id": "WOS:000335658100004"}