{"auto_keywords": [{"score": 0.03956450799762414, "phrase": "group_leaders"}, {"score": 0.020021558698458716, "phrase": "scientific_group_leaders"}, {"score": 0.00735450083595587, "phrase": "egypt"}, {"score": 0.00481495049065317, "phrase": "scientific_groups"}, {"score": 0.0047026237903774895, "phrase": "research_paper"}, {"score": 0.004401794742140806, "phrase": "corresponding_author"}, {"score": 0.004178935413340453, "phrase": "authorship_preferences"}, {"score": 0.00406214911915987, "phrase": "seven_research_fields"}, {"score": 0.0038564191670589884, "phrase": "research_fields"}, {"score": 0.003820144626025562, "phrase": "geographic_locations"}, {"score": 0.0036610707733929376, "phrase": "\"mathematics"}, {"score": 0.003299465669630328, "phrase": "shanghai"}, {"score": 0.0028360962841331634, "phrase": "first_authors"}, {"score": 0.002641823250595624, "phrase": "corresponding_authors"}, {"score": 0.0022070310530794097, "phrase": "research_group_leaders"}, {"score": 0.0021049977753042253, "phrase": "paper_production"}], "paper_keywords": ["Group leader", " Corresponding author", " Author position", " Author contribution"], "paper_abstract": "Leaders are important for scientific groups. Authors of a research paper whose names are listed in the byline first, last, or as the corresponding author are often considered particularly important to that paper. The authorship preferences of scientific group leaders are examined for seven research fields and 11 geographic locations. There are some similarities and differences among research fields and geographic locations in listing group leaders. In the fields of \"Mathematics\" and \"Physics, Particles & Fields\", although the custom is for papers to list authors alphabetically, scientific group leaders from Egypt and Shanghai typically list their names first or last in the byline, the same as group leaders in other research fields. Opposite to the group leaders from other locations, leaders from Egypt often appear as the first authors. Scientific group leaders who are listed first in the byline typically also serve as the corresponding authors. For group leaders who are listed last in the byline, the proportion also serving as corresponding authors changes significantly. Accordingly, the proportion of papers in which group leaders are corresponding authors varies considerably among different research fields and geographic locations. The meaning of authorship for research group leaders is discussed in the end from the perspective of their roles in paper production.", "paper_title": "Scientific group leaders' authorship preferences: an empirical investigation", "paper_id": "WOS:000330622600008"}