{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "modal_logic"}, {"score": 0.00897662674694816, "phrase": "universal_modality"}, {"score": 0.004717485406306594, "phrase": "crucial_role"}, {"score": 0.004509919457793852, "phrase": "computational_social_choice"}, {"score": 0.00447316895126645, "phrase": "artificial_intelligence"}, {"score": 0.004418601451254075, "phrase": "formal_models"}, {"score": 0.004276306563103443, "phrase": "primitive_objects"}, {"score": 0.0039402177950179345, "phrase": "recent_work"}, {"score": 0.003908091457759849, "phrase": "rational_choice_theory"}, {"score": 0.00347054319869429, "phrase": "individual_agents"}, {"score": 0.0030193416820392554, "phrase": "motivationally_salient_properties"}, {"score": 0.0029824560656987855, "phrase": "main_result"}, {"score": 0.0027817658627604653, "phrase": "standard_modal_logic"}, {"score": 0.0027591435147816053, "phrase": "kt"}, {"score": 0.0026700637696697414, "phrase": "reasoning_systems"}, {"score": 0.002500571634075998, "phrase": "reason-based_preferences"}, {"score": 0.002370794661629904, "phrase": "multi-agent_case"}, {"score": 0.002220257443705344, "phrase": "different_factors"}], "paper_keywords": ["Reason-based preferences", " Modal logic", " Agreement technologies", " Typology of disagreement"], "paper_abstract": "Preferences play a crucial role in the theory of rationality, and therefore also to computational social choice and artificial intelligence. In formal models it is usually assumed that preferences are primitive objects, and little concern is devoted to the question of how they are formed or where they come from. Recent work in rational choice theory challenges this assumption, however, and aims to give more internal structure to the notion of a preference. The focus so far has been on modeling faculties of individual agents, such as their mood, mindset, and motivating reasons. In this paper we contribute to this development by developing a modal logic for reasoning about preferences that depend on a set of motivationally salient properties. The main result is a translation showing how reasoning in this logic can be captured by reasoning in a standard modal logic (KT with universal modality). It follows that reasoning systems and algorithms developed for modal logic (with universal modality) can be employed for reasoning about reason-based preferences. We then discuss how the approach can be generalised to the multi-agent case, and allows us to reason about agents who disagree because they are motivated by different factors, and who might be able to reach consensus simply by changing their perspective.", "paper_title": "Reasoning about reasons behind preferences using modal logic", "paper_id": "WOS:000358664600002"}