{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "semantic_signatures"}, {"score": 0.004362326712297089, "phrase": "attribute_terms"}, {"score": 0.0041445748748895365, "phrase": "known_object_classes"}, {"score": 0.004054598617367474, "phrase": "attribute_signature"}, {"score": 0.0035671997165370403, "phrase": "human_descriptions"}, {"score": 0.0032196786163178107, "phrase": "comparable_retrieval_accuracy"}, {"score": 0.003161271802988128, "phrase": "proposed_semantic_signatures"}, {"score": 0.003115307756631991, "phrase": "computation_cost"}, {"score": 0.003036468052876648, "phrase": "high-level_signatures"}, {"score": 0.0030032915123993837, "phrase": "good_complement"}, {"score": 0.0029813748433158032, "phrase": "low-level_shape_features"}, {"score": 0.0026613618933208467, "phrase": "best_results"}, {"score": 0.00253758084385033, "phrase": "user-friendly_interface"}, {"score": 0.002419542935774618, "phrase": "attribute_bars"}, {"score": 0.002298544073884724, "phrase": "great_significance"}], "paper_keywords": ["3D object retrieval", " semantic signature", " attribute", " reference set", " user-friendly interface"], "paper_abstract": "In this paper, we propose two kinds of semantic signatures for 3D object retrieval (3DOR). Humans are capable of describing an object using attribute terms like \"symmetric\" and \"flyable\", or using its similarities to some known object classes. We convert such qualitative descriptions into attribute signature (AS) and reference set signature (RSS), respectively, and use them for 3DOR. We also show that AS and RSS can be understood as two different quantization methods of the same semantic space of human descriptions of objects. The advantages of the semantic signatures are threefold. First, they are much more compact than low-level shape features yet working with comparable retrieval accuracy. Therefore, the proposed semantic signatures require less storage space and computation cost in retrieval. Second, the high-level signatures are a good complement to low-level shape features. As a result, by incorporating the signatures we can improve the performance of state-of-the-art 3DOR methods by a large margin. To the best of our knowledge, we obtain the best results on two popular benchmarks. Third, the AS enables us to build a user-friendly interface, with which the user can trigger a search by simply clicking attribute bars instead of finding a 3D object as the query. This interface is of great significance in 3DOR considering the fact that while searching, the user usually does not have a 3D query at hand that is similar to his/her targeted objects in the database.", "paper_title": "Learning Semantic Signatures for 3D Object Retrieval", "paper_id": "WOS:000313875500012"}