{"auto_keywords": [{"score": 0.040375697685509034, "phrase": "user's_intention"}, {"score": 0.0047464608267006395, "phrase": "minimal_feedback"}, {"score": 0.004678940805063634, "phrase": "traditional_research"}, {"score": 0.004634459424542272, "phrase": "text_clustering"}, {"score": 0.004073590964805314, "phrase": "author's_mood"}, {"score": 0.003791763445590174, "phrase": "clustering_algorithm"}, {"score": 0.0033166379485150507, "phrase": "user-desired_dimension"}, {"score": 0.0029996699429582835, "phrase": "human_construct"}, {"score": 0.0029711052657054463, "phrase": "feature_space"}, {"score": 0.002928765962664163, "phrase": "interactive_manner"}, {"score": 0.002887028262617443, "phrase": "clustering_process"}, {"score": 0.00276534038425712, "phrase": "human_knowledge"}, {"score": 0.002687070469080394, "phrase": "similarity_function"}, {"score": 0.00263612191603326, "phrase": "relevant_features"}, {"score": 0.0021049977753042253, "phrase": "commonly-used_sentiment_datasets"}], "paper_keywords": [""], "paper_abstract": "While traditional research on text clustering has largely focused on grouping documents by topic, it is conceivable that a user may want to cluster documents along other dimensions, such as the author's mood, gender, age, or sentiment. Without knowing the user's intention, a clustering algorithm will only group documents along the most prominent dimension, which may not be the one the user desires. To address the problem of clustering documents along the user-desired dimension, previous work has focused on learning a similarity metric from data manually annotated with the user's intention or having a human construct a feature space in an interactive manner during the clustering process. With the goal of reducing reliance on human knowledge for fine-tuning the similarity function or selecting the relevant features required by these approaches, we propose a novel active clustering algorithm, which allows a user to easily select the dimension along which she wants to cluster the documents by inspecting only a small number of words. We demonstrate the viability of our algorithm on a variety of commonly-used sentiment datasets.", "paper_title": "Which Clustering Do You Want? Inducing Your Ideal Clustering with Minimal Feedback", "paper_id": "WOS:000284372800001"}