{"auto_keywords": [{"score": 0.039337857374097424, "phrase": "hfe"}, {"score": 0.00481495049065317, "phrase": "hesitant_fuzzy_sets"}, {"score": 0.0047292449487169345, "phrase": "multiple_criteria"}, {"score": 0.004562362497952548, "phrase": "hesitant_fuzzy_elements"}, {"score": 0.0037778009042360758, "phrase": "main_characteristic"}, {"score": 0.003628024127607343, "phrase": "hesitant_situations"}, {"score": 0.002833035775182696, "phrase": "hesitance_degree"}, {"score": 0.0028076592725295646, "phrase": "hesitant_fuzzy_element"}, {"score": 0.0027575842698911173, "phrase": "decision_maker's_hesitance"}, {"score": 0.0023451553255837317, "phrase": "distance_measures"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Hesitant fuzzy sets", " Hesitant fuzzy element", " Hesitance degree", " Distance measure", " Similarity measure"], "paper_abstract": "The distance measures of hesitant fuzzy elements (HFEs) h(1)(x) and h(2)(x) introduced in the literature only cover the divergence of the values, but fail to consider the difference between the numbers of value of h(1)(x) and h(2)(x). However, the main characteristic of HFE is that it can describe the hesitant situations flexibly. Such a hesitation is depicted by the number of values of HFE being greater than one. Hence, it is very necessary to take into account both the difference of the values and that of the numbers when we study the difference between the HFEs. In this paper, we introduce the concept of hesitance degree of hesitant fuzzy element which describes the decision maker's hesitance in decision making process. Several novel distance and similarity measures between hesitant fuzzy sets (HFSs) are developed, in which both the values and the numbers of values of HFE are taken into account. The properties of the distance measures are discussed. Finally, we apply our proposed distance measures in multiple criteria decision making to illustrate their validity and applicability. (C) 2014 Elsevier Ltd. All rights reserved.", "paper_title": "New distance and similarity measures on hesitant fuzzy sets and their applications in multiple criteria decision making", "paper_id": "WOS:000352045600002"}