{"auto_keywords": [{"score": 0.04828702148089275, "phrase": "virtual_worlds"}, {"score": 0.006805886987341225, "phrase": "real_life-like_spaces"}, {"score": 0.004815272775407989, "phrase": "decision"}, {"score": 0.004391013899148212, "phrase": "social_interaction"}, {"score": 0.004280750808007532, "phrase": "important_role"}, {"score": 0.004253618550301311, "phrase": "cognitive_processes"}, {"score": 0.003525861581971337, "phrase": "research_study"}, {"score": 0.0029786045405384926, "phrase": "rich_many-to-many_interactions"}, {"score": 0.002912963877144772, "phrase": "situated_cognition"}, {"score": 0.0028944757265206332, "phrase": "social_cognition"}, {"score": 0.0026475981474045414, "phrase": "second_life"}, {"score": 0.0026308089765334163, "phrase": "sl"}, {"score": 0.0025240999184904366, "phrase": "situated_theories"}, {"score": 0.0024606011870678493, "phrase": "virtual_world_environment"}, {"score": 0.002360796860462937, "phrase": "organizational_learning"}, {"score": 0.0021524710523453464, "phrase": "activity-related_cues"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Situated cognition", " Social cognition", " Social facilitation", " Context facilitation", " Focused immersion", " Decision-making", " Virtual worlds"], "paper_abstract": "Past research suggests that \"situatedness\", i.e. the context, as well as the social interaction that occurs within it, play an important role in cognitive processes such as learning and decision-making. Thus far, IT tools have been limited in the level and type of situatedness they facilitate. The advent of virtual worlds has changed this. Virtual worlds provide open, three-dimensional platforms for creating and designing real life-like spaces; they also allow for interaction between users in the form of \"avatars\" in that space. This research study focuses on virtual worlds as platforms for learning and decision-making. We propose a model that explains how individuals in a group learn and make decisions through a process that is influenced by the two unique characteristics of virtual worlds that enable situatedness: the facilitation for designing real life-like spaces, and the facilitation of rich many-to-many interactions. We draw on theories of situated cognition, social cognition, and flow to explicate the influence of these characteristics on the process of leaming and decision-making. Data was collected by means of a quasi-experiment in Second Life (SL). Results from this study extend and validate the predictions of situated theories of decision-making within the context of a virtual world environment and suggest guidelines for practitioners who wish to use such environments to support organizational learning and decision-making. Perhaps the most compelling of these is to focus on maximizing the immersion of the individual in the activity by stimulating his or her perceptions of others and activity-related cues in the environment. Published by Elsevier B.V.", "paper_title": "Decision-making in-socio and in-situ: Facilitation in virtual worlds", "paper_id": "WOS:000300210800005"}