{"auto_keywords": [{"score": 0.04972711494665694, "phrase": "staircase_approximation"}, {"score": 0.048004834084269796, "phrase": "shear_stress_measurements"}, {"score": 0.047667240890459914, "phrase": "lattice_boltzmann_simulations"}, {"score": 0.00481495049065317, "phrase": "lattice_boltzmann_method"}, {"score": 0.00447251540886613, "phrase": "voxel_representation"}, {"score": 0.0040783736687590635, "phrase": "simple_and_highly_efficient_data_structures"}, {"score": 0.0033411580268394732, "phrase": "overall_accuracy"}, {"score": 0.0030576885787607796, "phrase": "staircase_shape"}, {"score": 0.0029906503184034634, "phrase": "high_expectations"}, {"score": 0.002860938351029155, "phrase": "novel_method"}, {"score": 0.0026472970609754095, "phrase": "shear_stress"}, {"score": 0.0025324393547676623, "phrase": "local_data"}, {"score": 0.0024495702960480076, "phrase": "fluid_flow_simulation"}, {"score": 0.0023781827711414107, "phrase": "flow_dynamics"}, {"score": 0.002233301265743633, "phrase": "wall_orientation"}, {"score": 0.0021522261505574035, "phrase": "high_quality"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Lattice Boltzmann", " CFD", " Wall shear stress", " Voxel geometry"], "paper_abstract": "We analyze the accuracy of wall shear stress measurements in lattice Boltzmann simulations that are based on a voxel representation of the geometry and staircase approximation of boundaries. Such approximations are commonly used in the context of lattice Boltzmann simulations, because they favor the use of simple and highly efficient data structures. We show on several two- and three-dimensional simulations that this low-order approximation of the boundary affects the accuracy of wall shear stress measurements in areas directly adjacent to the wall. A few lattice nodes apart from the wall, the accuracy is however largely improved, and can be considered to be compatible with the overall accuracy of a simulation at a given coarseness level of the grid. This result is interpreted as a justification for the use of walls with staircase shape, even in simulations with high expectations regarding the level of accuracy. Furthermore, we propose a novel method for establishing the direction of the wall normal, a quantity which is required for the computation of the wall shear stress. With this method, the wall normal is computed from local data that is extracted from the results of the fluid flow simulation. Owing to the nature of the flow dynamics, which tends to smooth out the asperities of the wall, the information on the wall orientation obtained in this way is observed to be of high quality. (C) 2010 Elsevier Ltd. All rights reserved.", "paper_title": "Measurements of wall shear stress with the lattice Boltzmann method and staircase approximation of boundaries", "paper_id": "WOS:000284747100018"}