{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "computer_supported_collaborative_testing_system"}, {"score": 0.004757643419056999, "phrase": "siette_web-based_assessment_environment"}, {"score": 0.004388182727039715, "phrase": "initial_response"}, {"score": 0.00407161650109722, "phrase": "distance_collaboration"}, {"score": 0.004023120753104693, "phrase": "second_individual_answer"}, {"score": 0.003951453722517865, "phrase": "way_assessment"}, {"score": 0.003927848423072668, "phrase": "collaboration_activities"}, {"score": 0.003823350854607601, "phrase": "collaborative_testing_session"}, {"score": 0.003371159698962328, "phrase": "users'_feelings"}, {"score": 0.0032036590920314725, "phrase": "test_results"}, {"score": 0.003174973355583627, "phrase": "individual_and_group_performance"}, {"score": 0.0029991500396912923, "phrase": "individual_short-term_learning"}, {"score": 0.00295451673215765, "phrase": "collaborative_testing_activity"}, {"score": 0.002841545331522694, "phrase": "actual_learning"}, {"score": 0.002708399936381754, "phrase": "previous_results"}, {"score": 0.0026362590493392785, "phrase": "performance_increase"}, {"score": 0.0024901940672239784, "phrase": "common_answer"}, {"score": 0.002380605108907738, "phrase": "correct_response"}, {"score": 0.002255431275670053, "phrase": "collaborative_testing"}, {"score": 0.0022419349154472806, "phrase": "high-performing_students"}, {"score": 0.0021561514733516654, "phrase": "low-performing_students"}, {"score": 0.0021049977753042253, "phrase": "higher-performing_students"}], "paper_keywords": ["Collaborative learning", " Learning environments", " Collaborative testing", " Computerized testing", " Improving classroom teaching"], "paper_abstract": "This paper presents a computer supported collaborative testing system built upon the Siette web-based assessment environment. The application poses the same set of questions to a group of students. Each student in the group should answer the same question twice. An initial response is given individually, without knowing the answers of others. Then the system provides some tools to show the other partners' responses, to support distance collaboration. Finally a second individual answer is requested. In this way assessment and collaboration activities are interlaced. At the end of a collaborative testing session, each student will have two scores: the initial score and the final score. Three sets of experiments have been carried out: (1) a set of experiments designed to evaluate and fine tune the application, improve usability, and to collect users' feelings and opinions about the system; (2) a second set of experiments to analyze the impact of collaboration in test results, comparing individual and group performance, and analyzing the factors that correlate to those results; and (3) a set of experiments designed to measure individual short-term learning directly related to the collaborative testing activity. We study whether the use of the system is associated with actual learning, and whether this learning is directly related to collaboration between students. Our studies confirm previous results and provide the following evidence (1) the performance increase is directly related to the access to other partners' answers; (2) a student tends to reach a common answer in most cases; and (3) the consensus is highly correlated with the correct response. Moreover, we have found evidence indicating that most of the students really do learn from collaborative testing. High-performing students improve by self-reflection, regardless the composition of the group, but low-performing students need to be in a group with higher-performing students in order to improve. (C) 2013 Elsevier Ltd. All rights reserved.", "paper_title": "A web based collaborative testing environment", "paper_id": "WOS:000324080800041"}