{"auto_keywords": [{"score": 0.041712156789843864, "phrase": "bbsc"}, {"score": 0.00964254681548919, "phrase": "control_ball_points"}, {"score": 0.004764220976404241, "phrase": "ball_b-spline_curves"}, {"score": 0.004615202066192795, "phrase": "useful_function"}, {"score": 0.004400329132129292, "phrase": "ball_b-spline_curve"}, {"score": 0.004195418010131832, "phrase": "tubular_objects"}, {"score": 0.004042635935882651, "phrase": "extension_algorithm"}, {"score": 0.0037935066882208235, "phrase": "extending_method"}, {"score": 0.003503497128638102, "phrase": "minimal_strain_energy_method"}, {"score": 0.003375826910838081, "phrase": "initial_value"}, {"score": 0.0031676593724896075, "phrase": "approximate_energy_function"}, {"score": 0.003036040409062437, "phrase": "time_complexity"}, {"score": 0.002988101395789399, "phrase": "corresponding_radius_function"}, {"score": 0.0027594936602962075, "phrase": "scalar_function"}, {"score": 0.0023038418282549274, "phrase": "strain_energy"}, {"score": 0.0022674379203603224, "phrase": "affected_area"}], "paper_keywords": ["ball B-spline", " curve extension", " G(2)-continuity", " minimal energy"], "paper_abstract": "Curve extension is a useful function in shape modeling for cyberworlds, while a Ball B-spline Curve (BBSC) has its advantages in representing freeform tubular objects. In this paper, an extension algorithm for the BBSC with G(2)-continuity is investigated. We apply the extending method of B-Spline curves to the skeleton of the BBSC through generalizing a minimal strain energy method from 2D to 3D. And the initial value of the G(2)-continuity parameter for the skeleton is selected by minimizing the approximate energy function which is a problem with O(1) time complexity. The corresponding radius function of the control ball points is determined through applying the G(2)-continuity conditions for the skeleton to the scalar function. In order to ensure the radii of the control ball points are positive, we make a decision about the range of the G(2)-continuity parameter for the radius and then determine it by minimizing the strain energy in the affected area. Some experiments comparing our method with other methods are given. And at the same time, we present the advantage of our method in modeling flexibility from the aspects of the skeleton and radius. The results illustrate our method for extending the BBSC is effective.", "paper_title": "G(2)-Continuity Extension Algorithm of Ball B-Spline Curves", "paper_id": "WOS:000342784500010"}