{"auto_keywords": [{"score": 0.04418803868976235, "phrase": "local_probabilistic_correlations"}, {"score": 0.015719716506582538, "phrase": "stochastic_cellular_automata"}, {"score": 0.013248615069041526, "phrase": "usual_definitions"}, {"score": 0.004689670588738549, "phrase": "simulations"}, {"score": 0.004552648949390462, "phrase": "simple_formalism"}, {"score": 0.003884212965525665, "phrase": "strictly_more_behaviors"}, {"score": 0.0031182092708983184, "phrase": "intrinsic_simulation"}, {"score": 0.0030891871245908665, "phrase": "deterministic_cellular_automata"}, {"score": 0.0030319482153908037, "phrase": "non-deterministic_and_stochastic_settings"}, {"score": 0.00297576670831646, "phrase": "intrinsic_simulation_relation"}, {"score": 0.002787181295054319, "phrase": "explicit_tools"}, {"score": 0.002514625755809045, "phrase": "stochastic_global_maps"}, {"score": 0.002388487669097511, "phrase": "stochastic_coupling"}, {"score": 0.0023551955270737215, "phrase": "random_sources"}, {"score": 0.002237036807966899, "phrase": "universal_stochastic_cellular_automaton"}, {"score": 0.0021649437083408425, "phrase": "optimal_partial_universality"}, {"score": 0.0021049977753042253, "phrase": "universal_non-deterministic_cellular_automaton"}], "paper_keywords": [""], "paper_abstract": "This paper introduces a simple formalism for dealing with deterministic, non-deterministic and stochastic cellular automata in an unified and composable manner. This formalism allows for local probabilistic correlations, a feature which is not present in usual definitions. We show that this feature allows for strictly more behaviors (for instance, number conserving stochastic cellular automata require these local probabilistic correlations). We also show that several problems which are deceptively simple in the usual definitions, become undecidable when we allow for local probabilistic correlations, even in dimension one. Armed with this formalism, we extend the notion of intrinsic simulation between deterministic cellular automata, to the non-deterministic and stochastic settings. Although the intrinsic simulation relation is shown to become undecidable in dimension two and higher, we provide explicit tools to prove or disprove the existence of such a simulation between any two given stochastic cellular automata. Those tools rely upon a characterization of equality of stochastic global maps, shown to be equivalent to the existence of a stochastic coupling between the random sources. We apply them to prove that there is no universal stochastic cellular automaton. Yet we provide stochastic cellular automata achieving optimal partial universality, as well as a universal non-deterministic cellular automaton.", "paper_title": "Stochastic Cellular Automata: Correlations, Decidability and Simulations", "paper_id": "WOS:000324968900002"}