{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "knowledge_management"}, {"score": 0.004771435352180973, "phrase": "topology_optimization"}, {"score": 0.0047283116134926645, "phrase": "topological_optimization"}, {"score": 0.004015182362035361, "phrase": "mechanical_properties"}, {"score": 0.003925004567341077, "phrase": "global_optimization"}, {"score": 0.0034717929086014636, "phrase": "sizeable_organizational_effort"}, {"score": 0.003170060683860338, "phrase": "product_development_process"}, {"score": 0.0030429511467945525, "phrase": "innovative_methodology"}, {"score": 0.0029076695661972114, "phrase": "design_choices"}, {"score": 0.0028682668647074397, "phrase": "project_activities"}, {"score": 0.0027407417663740936, "phrase": "pdp"}, {"score": 0.002491015208328868, "phrase": "software_tools"}, {"score": 0.002391067964886602, "phrase": "custom_computer-aided_design_automation_tools"}, {"score": 0.002203016940021265, "phrase": "original_procedure"}, {"score": 0.0021050313179919802, "phrase": "doi"}], "paper_keywords": ["topology optimization", " knowledge management", " CAD automation"], "paper_abstract": "Topological optimization (TO) tools are today widely employed in several engineering fields (e. g., construction, aeronautics, aerospace, and automotive). The diffusion of these tools is due to their capacity to improve mechanical properties of products through a global optimization of the product in terms of weight, stiffness, strength, and cost. On the other hand, the adoption of TO tools still requires a sizeable organizational effort because, at present, these tools are mostly stand-alone and are not well integrated into the product development process (PDP). This paper presents an innovative methodology that supports designers and analysts in formalizing and transmitting design choices taken during project activities and in making the integration of TO tools in the PDP more efficient. The methodology clearly defines the roles, the activities, the data to exchange, and the software tools to be used in the process. Some custom computer-aided design automation tools have been implemented to improve the efficiency of the methodology. Moreover, this paper defines an original procedure to support the interpretation of the TO results. [DOI: 10.1115/1.3518386]", "paper_title": "Methodology and Tools to Support Knowledge Management in Topology Optimization", "paper_id": "WOS:000285480300009"}