{"auto_keywords": [{"score": 0.04247245612782641, "phrase": "unknown_object"}, {"score": 0.041353891869186754, "phrase": "double_support_phase"}, {"score": 0.015719716506582538, "phrase": "humanoid_robot"}, {"score": 0.01529446453358126, "phrase": "real-time_gait"}, {"score": 0.013042409601748002, "phrase": "single_support_phase"}, {"score": 0.010522061907453485, "phrase": "reaction_force"}, {"score": 0.004530023871441992, "phrase": "humanoid_robots"}, {"score": 0.0035684266744407485, "phrase": "zero_moment_point"}, {"score": 0.0033757067564871494, "phrase": "zmp_modification"}, {"score": 0.00317567642254436, "phrase": "zmp."}, {"score": 0.0031405975280029913, "phrase": "cycle_time_modification"}, {"score": 0.002643753276264565, "phrase": "trajectory_planning"}, {"score": 0.0021049977753042253, "phrase": "proposed_method"}], "paper_keywords": ["biped robot", " humanoid robot", " pushing motion", " reaction force", " real-time gait planning", " unknown object", " walking robot", " zero moment point (ZMP)"], "paper_abstract": "This paper describes real-time gait planning for pushing motion of humanoid robots. This method deals with an object whose mass is not known. In order that a humanoid robot pushes an unknown object in both single support phase and double support phase, real-time gait planning for pushing the unknown object is proposed. Real-time gait planning consists of zero moment point (ZMP) modification and cycle time modification. ZMP modification is the method that modifies the influence of reaction force to ZMP. By cycle time modification, the period in double support phase is modified to avoid a robot tipping over. These modifications are calculated from reaction force on arms in every cycle. With these methods, trajectory planning for pushing an unknown object in both single support phase and double support phase is calculated. Even if parameters of an object and friction coefficient on the floor vary, the robot keeps on walking while pushing an object. The effectiveness of the proposed method is confirmed by a simulation and an experiment.", "paper_title": "Real-time gait planning for pushing motion of humanoid robot", "paper_id": "WOS:000246821800008"}