{"auto_keywords": [{"score": 0.015719716506582538, "phrase": "information_content"}, {"score": 0.015521816488218496, "phrase": "cap_analysis_gene_expression"}, {"score": 0.014203564925504099, "phrase": "tissue-specific_functions"}, {"score": 0.01312019099949406, "phrase": "expression_value"}, {"score": 0.011335877881468656, "phrase": "cage"}, {"score": 0.0047842129415024475, "phrase": "gene_ontology"}, {"score": 0.004723575319038013, "phrase": "gene"}, {"score": 0.004648292940755605, "phrase": "tissue_types"}, {"score": 0.004618614357974438, "phrase": "developmental_stages"}, {"score": 0.004401955895933783, "phrase": "gene_expression_patterns"}, {"score": 0.004195418010131832, "phrase": "dna_microarray"}, {"score": 0.0041023644174418205, "phrase": "gene_expressions"}, {"score": 0.0038476708316022823, "phrase": "gene_expression_value"}, {"score": 0.0036553070575015344, "phrase": "control_condition"}, {"score": 0.0034282732966589478, "phrase": "high-throughput_analysis"}, {"score": 0.003309452522760298, "phrase": "expressed_genes"}, {"score": 0.002977061391551631, "phrase": "cage."}, {"score": 0.002901627749562029, "phrase": "simplest_ways"}, {"score": 0.002610090005760493, "phrase": "housekeeping_genes"}, {"score": 0.0024399717841513354, "phrase": "tissue_specificity"}, {"score": 0.0023857603808363527, "phrase": "gene_ontology_terms"}, {"score": 0.002273605493468005, "phrase": "liver_and_prostate_gland"}, {"score": 0.002251813863195168, "phrase": "well-known_functions"}, {"score": 0.0021528432044086044, "phrase": "prostate_gland"}, {"score": 0.0021390634151482566, "phrase": "immune_function"}, {"score": 0.0021049977753042253, "phrase": "high_rank"}], "paper_keywords": ["CAGE", " gene ontology", " information content", " tissue-specific functions"], "paper_abstract": "Gene expressions differ depending on tissue types and developmental stages. Analyzing how each gene is expressed is thus important. One way of analyzing gene expression patterns is to identify tissue-specific functions. This is useful for understanding how vital activities are performed. DNA microarray has been widely used to observe gene expressions exhaustively. However, comparing the expression value of a gene to that of other genes is impossible, as the gene expression value of a condition is measured as a proportion of that for the same gene under a control condition. We therefore could not determine whether one gene is more expressed than other genes. Cap analysis gene expression (CAGE) allows high-throughput analysis of gene expressions by counting the number of cDNAs of expressed genes. CAGE enables comparison of the expression value of the gene to that of other genes in the same tissue. In this study, we propose a method for exploring tissue-specific functions using data from CAGE. To identify tissue-specificity, one of the simplest ways is to assume that the function of the most expressed gene is regarded as the most tissue-specific. However, the most expressed gene in a tissue might highly express in all tissues, as seen with housekeeping genes. Functions of such genes cannot be tissue-specific. To remove these from consideration, we propose measuring tissue specificity of functions based on information content of gene ontology terms. We applied our method to data from 16 human tissues and 22 mouse tissues. The results from liver and prostate gland indicated that well-known functions of these tissues, such as functions related to signaling and muscle in prostate gland and immune function in liver, displayed high rank.", "paper_title": "Tissue-specific functions based on information content of gene ontology using cap analysis gene expression", "paper_id": "WOS:000251097800005"}