{"auto_keywords": [{"score": 0.007992743138402866, "phrase": "sugeno"}, {"score": 0.004644014990871423, "phrase": "similarity_measures"}, {"score": 0.004456044928556639, "phrase": "similarity_degree"}, {"score": 0.004364919932563366, "phrase": "inclusion_measures"}, {"score": 0.003608049802828859, "phrase": "proposed_measures"}, {"score": 0.002684740763324991, "phrase": "numerical_results"}, {"score": 0.0025625729433234623, "phrase": "existing_measures"}, {"score": 0.002286781334850213, "phrase": "proposed_similarity_measure"}, {"score": 0.002251542790734307, "phrase": "robust_clustering_method"}, {"score": 0.0021714122348552747, "phrase": "fuzzy_sets"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Fuzzy sets", " Type-2 fuzzy sets", " Similarity measure", " Inclusion measure", " Entropy", " Clustering"], "paper_abstract": "Similarity measures of type-2 fuzzy sets are used to indicate the similarity degree between type-2 fuzzy sets. Inclusion measures for type-2 fuzzy sets are the degrees to which a type-2 fuzzy set is a subset of another type-2 fuzzy set. The entropy of type-2 fuzzy sets is the measure of fuzziness between type-2 fuzzy sets. Although several similarity, inclusion and entropy measures for type-2 fuzzy sets have been proposed in the literatures, no one has considered the use of the Sugeno integral to define those for type-2 fuzzy sets. In this paper, new similarity, inclusion and entropy measure formulas between type-2 fuzzy sets based on the Sugeno integral are proposed. Several examples are used to present the calculation and to compare these proposed measures with several existing methods for type-2 fuzzy sets. Numerical results show that the proposed measures are more reasonable than existing measures. On the other hand, measuring the similarity between type-2 fuzzy sets is important in clustering for type-2 fuzzy data. We finally use the proposed similarity measure with a robust clustering method for clustering the patterns of type-2 fuzzy sets. (C) 2011 Elsevier Ltd. All rights reserved.", "paper_title": "Similarity, inclusion and entropy measures between type-2 fuzzy sets based on the Sugeno integral", "paper_id": "WOS:000287729700021"}