{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "website_performance"}, {"score": 0.010386916681958252, "phrase": "website_design"}, {"score": 0.004586531354697466, "phrase": "corporate_website"}, {"score": 0.004464326432401002, "phrase": "primary_vehicle"}, {"score": 0.00441635700580562, "phrase": "inter-organizational_and_intraorganizational_information_exchange"}, {"score": 0.004229556887896042, "phrase": "promotion_activities"}, {"score": 0.003334309053314909, "phrase": "development_efforts"}, {"score": 0.003298441494378465, "phrase": "specific_design_parameters"}, {"score": 0.003245359940011418, "phrase": "relevant_performance-influencing_features"}, {"score": 0.0030911702059432224, "phrase": "different_characteristics"}, {"score": 0.002992456421856034, "phrase": "systematic_and_comprehensive_identification"}, {"score": 0.0027741761880779535, "phrase": "empirical_study"}, {"score": 0.0026423134393535265, "phrase": "seven_factors"}, {"score": 0.0024761702541879213, "phrase": "information_content"}, {"score": 0.002320449502337321, "phrase": "significant_predictors"}, {"score": 0.0021049988202839053, "phrase": "loyalty"}], "paper_keywords": ["website reach", " website loyalty", " website design", " website characteristics"], "paper_abstract": "For many organizations the corporate website has emerged as the primary vehicle for inter-organizational and intraorganizational information exchange, as well as for sales and promotion activities. The performance of websites in terms of the extent to which they can attract and retain traffic, strongly influences the volume of business transacted on them. Identification of factors that influence website performance is therefore necessary, for appropriately focusing website development efforts toward specific design parameters and including relevant performance-influencing features within the website. Although studies have described different characteristics related to websites, a systematic and comprehensive identification of antecedents to website performance is missing. This paper is based on an empirical study of the performance of 190 websites. It identifies seven factors that influence two different measures of website performance, the Reach and Loyalty. Information content, usability, ease-of-navigation and security are significant predictors of Reach. Ease-of-navigation, customization, security and availability are determinants of Loyalty. The paper explains these results and uses them to suggest guidelines for website design.", "paper_title": "Determinants of Reach and Loyalty - A study of website performance and implications for website design", "paper_id": "WOS:000252820800002"}