{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "shortest_path"}, {"score": 0.022796620942108492, "phrase": "bounded_domain"}, {"score": 0.011865461812743429, "phrase": "shortest_paths"}, {"score": 0.007492935967856046, "phrase": "boundary_approximation"}, {"score": 0.004664352260912174, "phrase": "free_form"}, {"score": 0.004576253356889219, "phrase": "domain_partitioning"}, {"score": 0.004489810932879285, "phrase": "shortest_path_computation"}, {"score": 0.004377077848734575, "phrase": "industrial_automation"}, {"score": 0.004267163206961948, "phrase": "robot_and_autonomous_vehicle_navigation"}, {"score": 0.003757480190200645, "phrase": "common_approach"}, {"score": 0.0036167509502276294, "phrase": "free_form_boundary"}, {"score": 0.0033084729942065142, "phrase": "conventional_computing_algorithms"}, {"score": 0.0028037753646260937, "phrase": "free_form_boundary_domain"}, {"score": 0.0021049977753042253, "phrase": "straight_lines"}], "paper_keywords": ["shortest path", " free form boundary domain", " partition"], "paper_abstract": "The shortest path computation is important in industrial automation, especially for robot and autonomous vehicle navigation. However, most of the computations concentrate on computing the shortest path between two points within a polygon. The common approach for handling a bounded domain with free form boundary is to convert the domain into a polygon by boundary approximation so that the conventional computing algorithms can be used. Such an approximation affects the accuracy of the path. This article presents an approach to compute the shortest path between two given points in a free form boundary domain without any boundary approximation. This is addressed geometrically by imaginably placing a source at one of the points which radiates the shortest paths to various points of the domain. Some shortest paths are deflected by the geometry of the boundary so that they are no longer straight lines. Based on the deflections of the shortest paths, the bounded domain is partitioned into a set of subdomains. A tree is then constructed to show the relationships among these subdomains. The shortest path between two points is obtained from this tree.", "paper_title": "Computation of the Shortest Path in a Bounded Domain With Free Form Boundary by Domain Partitioning", "paper_id": "WOS:000335951700004"}