{"auto_keywords": [{"score": 0.049297705937689125, "phrase": "subcompact_cars"}, {"score": 0.03166181073351054, "phrase": "conjoint_analysis"}, {"score": 0.006273132629713042, "phrase": "key_attributes"}, {"score": 0.0049341967508757766, "phrase": "fuel_efficiency"}, {"score": 0.0047676399834833275, "phrase": "consumer_preferences"}, {"score": 0.0045679168155893304, "phrase": "important_attributes"}, {"score": 0.0044933373574179624, "phrase": "customer_choice"}, {"score": 0.004405440436639404, "phrase": "analytical_tool"}, {"score": 0.004305055407631358, "phrase": "biggest_segment"}, {"score": 0.004262733542795058, "phrase": "car_industry"}, {"score": 0.003429675062587355, "phrase": "hidden_motivations"}, {"score": 0.002976377823815918, "phrase": "thailand"}, {"score": 0.0028893405654376826, "phrase": "eight_subcompact_car_models"}, {"score": 0.002832731124016696, "phrase": "six_attributes"}, {"score": 0.0027680831622262027, "phrase": "subcompact_car's_appearance"}, {"score": 0.0027408292745619233, "phrase": "greatest_influence"}, {"score": 0.002713842991944533, "phrase": "respondents'_buying_intentions"}, {"score": 0.0025913692304671675, "phrase": "similar_effects"}, {"score": 0.002450039362463466, "phrase": "current_findings"}, {"score": 0.002378357925871225, "phrase": "appropriate_tool"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Conjoint analysis", " Subcompact car", " Consumer choice", " Buying intention", " Part-worth"], "paper_abstract": "The purpose of this study is to find the important attributes of subcompact cars that effect customer choice, using conjoint analysis as an analytical tool. Subcompact cars currently make up the biggest segment of the car industry, but before such products are launched, firms should know customer needs in order to determine the most suitable product specifications. However, consumers tend to evaluate the key attributes of a product as a whole, rather than independently, and thus conjoint analysis can be very useful in this context as a result of decomposing such overall evaluations into their individual components. This study thus adopts conjoint analysis to uncover the hidden motivations that may not even be apparent to the respondents themselves when considering the appeal of subcompact cars. As a result, the following six attributes of subcompact cars were identified: power, appearance, safety, fuel efficiency, price and gadgets. Using subjects from Thailand, 201 respondents were asked to rank their preferences for eight subcompact car models with different combinations of these six attributes. The results indicate that a subcompact car's appearance has the greatest influence on the respondents' buying intentions, followed by fuel efficiency, price, and safety, which all had similar effects. Power and gadgets are the two least important attributes with regard to purchase intention. Based on the current findings, it is concluded that conjoint analysis is an appropriate tool to identify the key attributes of subcompact cars. Using the results presented in this work, manufacturers can better tailor their subcompact cars to meet the needs of customers, and thus increase sales. (C) 2013 Elsevier Ltd. All rights reserved.", "paper_title": "Applying conjoint analysis to evaluate consumer preferences toward subcompact cars", "paper_id": "WOS:000331018000016"}