{"auto_keywords": [{"score": 0.04588707074015111, "phrase": "remote_user"}, {"score": 0.009294851407661703, "phrase": "spherical_display"}, {"score": 0.00481495049065317, "phrase": "surround_video_capture"}, {"score": 0.004652754203582873, "phrase": "teleconferencing_applications"}, {"score": 0.004565007074039171, "phrase": "new_video_conferencing_system"}, {"score": 0.0041662189933067, "phrase": "telepresence_system"}, {"score": 0.003995226376780718, "phrase": "near-correct_image"}, {"score": 0.00394981748347167, "phrase": "potential_observer_viewing_direction"}, {"score": 0.0037446140218109895, "phrase": "view-dependent_graphical_representation"}, {"score": 0.003456554957885269, "phrase": "flat_displays"}, {"score": 0.002867425368894356, "phrase": "first_experiment"}, {"score": 0.0028025415122856973, "phrase": "camera_array"}, {"score": 0.0027812405653371503, "phrase": "spherical_display_system"}, {"score": 0.0026976391682197133, "phrase": "multiple_observing_positions"}, {"score": 0.002567099236341096, "phrase": "second_experiment"}, {"score": 0.002499438189264537, "phrase": "planar_display"}, {"score": 0.002470987929071079, "phrase": "detailed_reasons"}, {"score": 0.002246124435189668, "phrase": "observer's_viewing_angles"}, {"score": 0.002229043128610864, "phrase": "video_conferencing_systems"}, {"score": 0.0021049977753042253, "phrase": "future_display_configurations"}], "paper_keywords": [""], "paper_abstract": "We propose a new video conferencing system that uses an array of cameras to capture a remote user and then show the video of that person on a spherical display. This telepresence system has two key advantages: (i) it can capture a near-correct image for any potential observer viewing direction because the cameras surround the user horizontally; and (ii) with view-dependent graphical representation on the spherical display, it is possible to tell where the remote user is looking from any viewpoint, whereas flat displays are visible only from the front. As a result, the display can more faithfully represent the gaze of the remote user. We evaluate this system by measuring the ability of observers to accurately judge which targets the actor is gazing at in two experiments. Results from the first experiment demonstrate the effectiveness of the camera array and spherical display system, in that it allows observers at multiple observing positions to accurately tell at which targets the remote user is looking. The second experiment further compared a spherical display with a planar display and provided detailed reasons for the improvement of our system in conveying gaze. We found two linear models for predicting the distortion introduced by misalignment of capturing cameras and the observer's viewing angles in video conferencing systems. Those models might be able to enable a correction for this distortion in future display configurations.", "paper_title": "A Surround Video Capture and Presentation System for Preservation of Eye-Gaze in Teleconferencing Applications", "paper_id": "WOS:000354485200001"}