{"auto_keywords": [{"score": 0.03374707801267494, "phrase": "gaussian"}, {"score": 0.00481495049065317, "phrase": "mimo_interference_channel_with_confidential_messages"}, {"score": 0.00462773520532301, "phrase": "precoder_design"}, {"score": 0.004477270137801732, "phrase": "achievable_rate_regions"}, {"score": 0.004027751272984522, "phrase": "linear_precoding"}, {"score": 0.003482160257566501, "phrase": "secrecy_rate"}, {"score": 0.0026194209399161184, "phrase": "overall_secrecy_performance"}, {"score": 0.0025173564697303836, "phrase": "game-theoretic_formulation"}, {"score": 0.0023096222276192194, "phrase": "operating_point"}, {"score": 0.0022641658133181115, "phrase": "network_performance"}], "paper_keywords": ["Game theory", " interference channel", " multiple-input multiple-output (MIMO)", " secrecy capacity", " wiretap channel"], "paper_abstract": "We study the achievable rate regions of the multiple-input multiple-output (MIMO) interference channel with confidential messages sent to two receivers, assuming the transmitters use linear precoding. Each receiver is assumed to be an eavesdropper for the other link, and the transmitters employ various techniques to increase the secrecy rate of their own link or that of the network. We describe both cooperative and noncooperative transmission schemes for Gaussian interference channels, and derive their achievable secrecy rate regions. Cooperation is made possible if the transmitters share a portion of their channel state information, allowing them to appropriately adjust their precoders and improve the overall secrecy performance of the network. A game-theoretic formulation of the problem is adopted to allow the transmitters to find an operating point that balances network performance and fairness. The benefit of cooperation is demonstrated via several numerical examples.", "paper_title": "MIMO Interference Channel With Confidential Messages: Achievable Secrecy Rates and Precoder Design", "paper_id": "WOS:000293924000013"}