{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "mobile_robotics"}, {"score": 0.004510184935928004, "phrase": "human-machine_interactive_task_planning"}, {"score": 0.003619235073669304, "phrase": "symbolic_model"}, {"score": 0.0034101316738399203, "phrase": "natural_form"}, {"score": 0.0033497809969621267, "phrase": "human-inspired_mechanism"}, {"score": 0.003251552926963083, "phrase": "multiple_hierarchies"}, {"score": 0.0031561961485589633, "phrase": "hierarchical_model"}, {"score": 0.0029561107046138136, "phrase": "hierarchical_information"}, {"score": 0.0025623821393275146, "phrase": "human_user"}, {"score": 0.0024431289979171505, "phrase": "human-machine_communication"}, {"score": 0.002385595105638277, "phrase": "task-planning_performance"}, {"score": 0.0023018188296933923, "phrase": "general_interactive_task-planning_process"}, {"score": 0.002168664249034289, "phrase": "mobile_robotic_application"}], "paper_keywords": ["hierarchical task planning", " interactive task planning", " mobile robots", " world modeling"], "paper_abstract": "To date, no solution has been proposed to human-machine interactive task planning that deals simultaneously with two important issues: 1) the capability of processing large amounts of information in planning (as it is needed in any real application) and 2) being efficient in human-machine communication (a proper set of symbols for human-machine interaction may not be suitable for efficient automatic planning and vice versa). In this paper, we formalize a symbolic model of the environment to solve these issues in a natural form through a human-inspired mechanism that structures knowledge in multiple hierarchies. Planning with a hierarchical model may be efficient even in cases where the lack of hierarchical information would make it intractable. However, in addition, our multihierarchical model is able to use the symbols that are most familiar to each human user for interaction, thus achieving efficiency in human-machine communication without compromising the task-planning performance. We formalize here a general interactive task-planning process which is then particularized to be applied to a mobile robotic application. The suitability of our approach has been demonstrated with examples and experiments.", "paper_title": "Multihierarchical interactive task planning: Application to mobile robotics", "paper_id": "WOS:000258763600017"}