{"auto_keywords": [{"score": 0.03387648860751041, "phrase": "qualified_patterns"}, {"score": 0.02336514401100789, "phrase": "dofra"}, {"score": 0.00481495049065317, "phrase": "frequent_pattern_mining"}, {"score": 0.004762893197005439, "phrase": "important_data_mining_problem"}, {"score": 0.004643594260262632, "phrase": "field_use_support"}, {"score": 0.004241299366498948, "phrase": "data_set"}, {"score": 0.0041051328120736575, "phrase": "new_interesting_measure"}, {"score": 0.0037903327482565097, "phrase": "real-world_pattern_recommendation_applications"}, {"score": 0.0035766032751309677, "phrase": "large_portion"}, {"score": 0.003314203895848455, "phrase": "user-specified_threshold"}, {"score": 0.003037736332283186, "phrase": "mining_top-k_qualified_patterns"}, {"score": 0.0029722900280316216, "phrase": "k_qualified_patterns"}, {"score": 0.00295078850927459, "phrase": "maximum_values"}, {"score": 0.002918826667294298, "phrase": "user-defined_function"}, {"score": 0.002487835869510301, "phrase": "general_algorithm"}, {"score": 0.0023219374444738723, "phrase": "upper_bound_properties"}, {"score": 0.002263639474937039, "phrase": "search_process"}], "paper_keywords": ["Methods", " Algorithms", " Occupancy", " dominant pattern", " bound estimation"], "paper_abstract": "Frequent pattern mining is an important data mining problem with many broad applications. Most studies in this field use support (frequency) to measure the popularity of a pattern, namely the fraction of transactions or sequences that include the pattern in a data set. In this study, we introduce a new interesting measure, namely occupancy, to measure the completeness of a pattern in its supporting transactions or sequences. This is motivated by some real-world pattern recommendation applications in which an interesting pattern should not only be frequent, but also occupies a large portion of its supporting transactions or sequences. With the definition of occupancy we call a pattern dominant if its occupancy value is above a user-specified threshold. Then, our task is to identify the qualified patterns which are both dominant and frequent. Also, we formulate the problem of mining top-k qualified patterns, that is, finding k qualified patterns with maximum values on a user-defined function of support and occupancy, for example, weighted sum of support and occupancy. The challenge to these tasks is that the value of occupancy does not change monotonically when more items are appended to a given pattern. Therefore, we propose a general algorithm called DOFRA (DOminant and FRequent pattern mining Algorithm) for mining these qualified patterns, which explores the upper bound properties on occupancy to drastically reduce the search process. Finally, we show the effectiveness of DOFRA in two real-world applications and also demonstrate the efficiency of DOFRA on several real and large synthetic datasets.", "paper_title": "Occupancy-Based Frequent Pattern Mining", "paper_id": "WOS:000363675500004"}