{"auto_keywords": [{"score": 0.04143216510902462, "phrase": "critical_points"}, {"score": 0.020672068054997213, "phrase": "distance_function"}, {"score": 0.019575824000184372, "phrase": "discrete_sample"}, {"score": 0.00481495049065317, "phrase": "surface_and_flow-complex-based_surface_reconstruction"}, {"score": 0.004610058444728656, "phrase": "key_role"}, {"score": 0.0045198174374297285, "phrase": "medial_axis_approximations"}, {"score": 0.004484215355348556, "phrase": "surface_reconstructions"}, {"score": 0.004448892453489832, "phrase": "offset_computations"}, {"score": 0.004413846562278824, "phrase": "feature_extractions"}, {"score": 0.003904495523681369, "phrase": "distance_functions"}, {"score": 0.0036217089991592275, "phrase": "earlier_theoretical_result"}, {"score": 0.003536720212056521, "phrase": "topological_properties"}, {"score": 0.0034949740315415043, "phrase": "geometric_object"}, {"score": 0.0027341763737751467, "phrase": "sampling_density"}, {"score": 0.0026384167183586015, "phrase": "medial_axis"}, {"score": 0.002576442680766742, "phrase": "topological_information"}, {"score": 0.002546002312015341, "phrase": "sampled_surface"}, {"score": 0.002456816881853114, "phrase": "new_flow-complex-based_surface_reconstruction_algorithm"}, {"score": 0.0021049977753042253, "phrase": "curve_reconstruction"}], "paper_keywords": ["flow complex", " epsilon-sampling", " surface reconstruction"], "paper_abstract": "The distance function to surfaces in three dimensions plays a key role in many geometric modeling applications such as medial axis approximations, surface reconstructions, offset computations and feature extractions among others. In many cases, the distance function induced by the surface can be approximated by the distance function induced by a discrete sample of the surface. The critical points of the distance functions are known to be closely related to the topology of the sets inducing them. However, no earlier theoretical result has found a link between topological properties of a geometric object and critical points of the distance to a discrete sample of it. We provide this link by showing that the critical points of the distance function induced by a discrete sample of a surface fall into two disjoint classes: those that lie very close to the surface and those that are near its medial axis. This closeness is precisely quantified and is shown to depend on the sampling density. It turns out that critical points near the medial axis can be used to extract topological information about the sampled surface. Based on this, we provide a new flow-complex-based surface reconstruction algorithm that, given a tight epsilon-sample of a surface, approximates the surface geometrically, both in distance and normals, and captures its topology. Furthermore, we show that the same algorithm can be used for curve reconstruction.", "paper_title": "Critical points of distance to an epsilon-sampling of a surface and flow-complex-based surface reconstruction", "paper_id": "WOS:000253909100003"}