{"auto_keywords": [{"score": 0.011802855826346133, "phrase": "simplification_operation"}, {"score": 0.00481495049065317, "phrase": "feature-based_three-dimensional_computer-aided_design_models"}, {"score": 0.004512301631550235, "phrase": "lod"}, {"score": 0.00387011040370557, "phrase": "low-complexity_one"}, {"score": 0.003562912424153324, "phrase": "evaluation_metrics"}, {"score": 0.003500313767208306, "phrase": "geometric_elements"}, {"score": 0.0030735451757603555, "phrase": "selected_elements"}, {"score": 0.0028127163745564777, "phrase": "graph-based_simplification"}, {"score": 0.0025892330566358503, "phrase": "discrimination_priority"}, {"score": 0.002455009746748708, "phrase": "graph-based_refined_simplification_operation"}, {"score": 0.0021940118003312397, "phrase": "proposed_method"}, {"score": 0.002142696637011647, "phrase": "prototype_system"}, {"score": 0.0021049977753042253, "phrase": "simplification_experiments"}], "paper_keywords": ["feature-based 3D CAD model", " connectivity-preserving simplification", " simplification operation", " evaluation metrics", " level of detail"], "paper_abstract": "The required level of detail (LOD) of a three-dimensional computer-aided design (3D CAD) model differs according to its purpose. It is therefore important that users are able to simplify a highly complex 3D CAD model and create a low-complexity one. The simplification of a 3D CAD model requires the application of a simplification operation and evaluation metrics for the geometric elements of the 3D CAD model. The evaluation metrics are used to select those elements that should be removed. The simplification operation removes selected elements in order to simplify the 3D CAD model. In this paper, we propose the graph-based simplification of feature-based 3D CAD models using a method that preserves connectivity. First, new evaluation metrics that consider the discrimination priority among several simplification criteria are proposed. Second, a graph-based refined simplification operation that prevents the separation of a feature-based 3D CAD model into multiple volumes is proposed. Finally, we verify the proposed method by implementing a prototype system and performing simplification experiments using feature-based 3D CAD models.", "paper_title": "Graph-Based Simplification of Feature-Based Three-Dimensional Computer-Aided Design Models for Preserving Connectivity", "paper_id": "WOS:000358446100010"}