{"auto_keywords": [{"score": 0.04931358686155011, "phrase": "visual_search_performance"}, {"score": 0.012125953627693286, "phrase": "user_preference"}, {"score": 0.00481495049065317, "phrase": "smartphone_icon_background_shapes"}, {"score": 0.004699916946246509, "phrase": "user_preferences"}, {"score": 0.004442032546224076, "phrase": "different_designed_icons"}, {"score": 0.0043358695338488445, "phrase": "important_competent"}, {"score": 0.004301046274139699, "phrase": "user_interface"}, {"score": 0.004032302251481604, "phrase": "desktop_computers"}, {"score": 0.0039677715255034595, "phrase": "smartphone_icon"}, {"score": 0.003810909603178837, "phrase": "icon_background_shape"}, {"score": 0.003675023529026644, "phrase": "icon_figures"}, {"score": 0.00363080961099728, "phrase": "six_different_geometric_background_shapes"}, {"score": 0.0029672941061574375, "phrase": "unified_background"}, {"score": 0.0025761937402886954, "phrase": "better_search_time_performance"}, {"score": 0.0024642355970277497, "phrase": "visual_preference"}, {"score": 0.0023762535034673017, "phrase": "smartphone_icon_design"}, {"score": 0.00224558083320154, "phrase": "relatively_optimized_search_performance"}], "paper_keywords": ["icon design", " background shape", " figure/background area ratio", " visual search performance", " user preference"], "paper_abstract": "Smartphones are becoming increasingly popular, users are provided with various interface styles with different designed icons. Icon, as an important competent of user interface, is regarded to be more efficient and more pleasurable. However, compared with desktop computers, fewer design principles on smartphone icon were proposed. This paper investigated the effects of icon background shape and the figure/background area ratio on visual search performance and user preference. Icon figures combined with six different geometric background shapes and five different figure/background area ratios were studied on three different screens in experiments with 40 subjects. The results of an analysis of variance (ANOVA) showed that these two independent variables (background shape and figure/background area ratio) significantly affected the visual search performance and user preference. On 3.5-in (11 in=0.025 4 m) and 4.0-in displays, unified background would be optimal, shapes such as square, circle and transitions between them (e.g., rounded square, squircle, etc.) are recommended because backgrounds in these shapes yield a better search time performance and subjective satisfaction for ease of use, search and visual preference. A 60% figure/background area ratio is the most appropriate for smartphone icon design on the 3.5-in screen, while a 50% area ratio could be a suggestion for both relatively optimized search performance and user preference on 4.0-in. In terms of the 4.7-in, icon figure is used directly for its better performance and preference compared with icons with background.", "paper_title": "Effects of smartphone icon background shapes and figure/background area ratios on visual search performance and user preferences", "paper_id": "WOS:000361611300009"}