{"auto_keywords": [{"score": 0.04903313334357267, "phrase": "human_information_sources"}, {"score": 0.00801459792083451, "phrase": "information_managers"}, {"score": 0.00481495049065317, "phrase": "source_selection_process"}, {"score": 0.004506237371093533, "phrase": "organizations"}, {"score": 0.0038431888954930083, "phrase": "research_body"}, {"score": 0.003742554019950264, "phrase": "contradictory_results"}, {"score": 0.0032774280543222843, "phrase": "methodological_development"}, {"score": 0.0032342101452939977, "phrase": "emerging_new_line"}, {"score": 0.0031079352545607267, "phrase": "think_aloud_approach"}, {"score": 0.0027578496677536373, "phrase": "fifty-six_employees"}, {"score": 0.002490833392316362, "phrase": "similar_approach"}, {"score": 0.0024688710065898646, "phrase": "source_quality"}, {"score": 0.002341094670523097, "phrase": "aloud_approach"}, {"score": 0.002279702500235741, "phrase": "available_research_methods"}, {"score": 0.0021809311689473493, "phrase": "human_source_selection"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["source selection", " source accessibility", " source quality", " human information sources"], "paper_abstract": "co-workers are all important soul-cc of information in Organizations. Consequently, information managers seek to facilitate the use of such human information sources. Although various studies about what influences the use of human information sources in Organizations exist, it is difficult for information managers to utilize insights from this research body. The studies have provided contradictory results regarding the role of accessibility and quality and suffer from various weaknesses. To address these weaknesses, several studies are employing other research methods. This study aims to contribute to the methodological development of this emerging new line of research by exploring the value of a think aloud approach to such studies. In addition, it aims to provide more insight into the role of accessibility and quality in the selection of human information sources in organizations. Fifty-six employees from four governmental organizations were asked to think aloud while selecting human information sources. The findings Of this Study corroborate those of studies taking a similar approach: source quality is the most dominant factor ill the selection of human information sources. The think aloud approach seems a valuable contribution to available research methods to assess the role of accessibility and quality in human source selection in organizations. (C) 2007 Elsevier Ltd. All rights reserved.", "paper_title": "Inside the source selection process: Selection criteria for human information sources", "paper_id": "WOS:000255267600017"}