{"auto_keywords": [{"score": 0.035429505054348005, "phrase": "team_performance"}, {"score": 0.020328396829483352, "phrase": "knowledge_sharing"}, {"score": 0.020199136813572504, "phrase": "knowledge_application"}, {"score": 0.015719716506582538, "phrase": "information_technology"}, {"score": 0.009612105607093982, "phrase": "positive_impact"}, {"score": 0.007732586111119002, "phrase": "knowledge_management_practices"}, {"score": 0.006287446375762942, "phrase": "tms"}, {"score": 0.004681511906771149, "phrase": "application"}, {"score": 0.0046526752598360895, "phrase": "direct_impact"}, {"score": 0.004527462929045081, "phrase": "contemporary_knowledge-based_organizations"}, {"score": 0.004440277230269978, "phrase": "essential_role"}, {"score": 0.004397313229350093, "phrase": "knowledge_resources"}, {"score": 0.004340671055146398, "phrase": "significant_investments"}, {"score": 0.004161553532799662, "phrase": "recent_studies"}, {"score": 0.004107935669507044, "phrase": "transactive_memory_system"}, {"score": 0.0040027552011993005, "phrase": "cognitive_labor"}, {"score": 0.00397688190820577, "phrase": "team_members"}, {"score": 0.003788069044402032, "phrase": "important_factor"}, {"score": 0.0037392451233558234, "phrase": "team's_performance"}, {"score": 0.003493021648360933, "phrase": "precise_role"}, {"score": 0.0031383410838018953, "phrase": "field_study"}, {"score": 0.0030778231027679434, "phrase": "going_teams"}, {"score": 0.003018468582368033, "phrase": "south_korea"}, {"score": 0.002297949552105756, "phrase": "team_members'_meta-knowledge"}, {"score": 0.002246292543825748, "phrase": "careful_investment"}, {"score": 0.0021049977753042253, "phrase": "shared_knowledge"}], "paper_keywords": ["Transactive memory system", " knowledge management", " team performance", " field study"], "paper_abstract": "In contemporary knowledge-based organizations, teams often play an essential role in leveraging knowledge resources. Organizations make significant investments in information technology to support knowledge management practices in teams. At the same time, recent studies show that the transactive memory system (TMS) the specialized division of cognitive labor among team members that relates to the encoding, storage, and retrieval of knowledge is an important factor that affects a team's performance. Yet little is known of how IT support for knowledge management practices in organizations affects the development of TMS. Furthermore, the precise role of TMS on knowledge sharing and knowledge application, which in turn influences team performance, has not been fully explored. In order to close this gap in the literature, we conducted a field study that involved 139 on-going teams of 743 individuals from two major firms in South Korea. Our results show that IT support in organizations has a positive impact on the development of TMS in teams, and that both TMS and IT support have a positive impact on knowledge sharing and knowledge application. Furthermore, we found that knowledge sharing has a positive impact on knowledge application, which in turn has a direct impact on team performance. However, contrary to our expectation, knowledge sharing does not have a direct impact on team performance and its impact on team performance was fully mediated by knowledge application. Our research shows that organizations can improve team members' meta-knowledge of who knows what through the careful investment in information technology. Finally, our results show that sharing knowledge alone is not enough. Organizations must ensure that shared knowledge is in fact applied in order to improve team performance.", "paper_title": "THE IMPACT OF INFORMATION TECHNOLOGY AND TRANSACTIVE MEMORY SYSTEMS ON KNOWLEDGE SHARING, APPLICATION, AND TEAM PERFORMANCE: A FIELD STUDY", "paper_id": "WOS:000284086900011"}