{"auto_keywords": [{"score": 0.035874878891473845, "phrase": "lci_model"}, {"score": 0.01158168520728551, "phrase": "link_prediction"}, {"score": 0.010547036441057145, "phrase": "topics_similarities"}, {"score": 0.008713768692145006, "phrase": "evolving_patterns"}, {"score": 0.008676694059153379, "phrase": "patent_assignees'_collaboration_networks"}, {"score": 0.008603013247217583, "phrase": "collaboration_potential"}, {"score": 0.004583644452597808, "phrase": "latent_collaboration_index"}, {"score": 0.004564062445696677, "phrase": "lci"}, {"score": 0.004505810658087428, "phrase": "collaboration_probability"}, {"score": 0.00445783412174435, "phrase": "demonstration_process"}, {"score": 0.00439152018106025, "phrase": "industrial_biotechnology"}, {"score": 0.004216465653135235, "phrase": "ib"}, {"score": 0.003971006689166329, "phrase": "average_degree"}, {"score": 0.003895181909029215, "phrase": "collaboration_networks"}, {"score": 0.00385368199735867, "phrase": "especially_the_diameter_analysis"}, {"score": 0.0038207994186834015, "phrase": "ib_field"}, {"score": 0.003780088982983617, "phrase": "mature_mode"}, {"score": 0.003747831993943604, "phrase": "topological_transition"}, {"score": 0.0036841384065524124, "phrase": "degree_k"}, {"score": 0.0036605323485683983, "phrase": "power_law_distribution"}, {"score": 0.0036215233428918015, "phrase": "preferential_linking_feature"}, {"score": 0.003359816816853762, "phrase": "network_distance"}, {"score": 0.003232653376857698, "phrase": "geographical_distances"}, {"score": 0.0031573159476256645, "phrase": "different_types"}, {"score": 0.0031303566273437433, "phrase": "also_different_probabilities"}, {"score": 0.0027702126237754625, "phrase": "different_subjects"}, {"score": 0.0026031552074693284, "phrase": "poor_inference"}, {"score": 0.0023839754995935184, "phrase": "popular_behaviours"}, {"score": 0.0023484391331502113, "phrase": "patent_application"}, {"score": 0.002264321283759897, "phrase": "promising_pairs"}, {"score": 0.0022020301282096194, "phrase": "regression_analysis"}, {"score": 0.0021692000054033956, "phrase": "usable_coefficients"}, {"score": 0.0021049977753042253, "phrase": "qualitative_analysis"}], "paper_keywords": ["Patent", " Network Analysis", " Collaboration", " Evolving", " Industrial Biotechnology"], "paper_abstract": "The purpose of this article is to map the evolving patterns of patent assignees' collaboration networks and build a latent collaboration index (LCI) model for evaluating the collaboration probability among assignees. The demonstration process was carried on the field of industrial biotechnology (IB) from 2000 to 2010. The results show that the number of assignees in the field of IB grew steadily, while the number of patents decreased slowly year by year after it reached peak in 2002 and 2003. Densification and growth analysis, average degree, density and components analysis showed that the collaboration networks tended to density. Especially the diameter analysis indicated that the IB field had come into a mature mode after finishing the topological transition occurred in about 2002 or 2003. The nodes had degree k followed a power law distribution, which implied a preferential linking feature of the network evolving and thus provided a foundation for link prediction from the aspect of network evolving. Basing on this, two network-related factors had been brought into the LCI model, which were degree and network distance. Their values were positive and negative for link prediction respectively. In addition, types of assignees, geographical distances and topics similarities had also been added into the LCI model. Different types of assignees had also different probabilities to be linked, such as corporations had been collaborated more frequently, while universities ranked lowest based on collaborations. Assignees from the same countries seemed to be likely to collaborate to each other. It have to been noted that the LCI model is flexible that can be adjusted of the factors or their weights according to different subjects, time or data. For instance, the topics similarities between assignees would be removed from the LCI model for link prediction in the field of IB because of the poor inference from topics similarities to collaborations. Actually, many promising pairs of assignees that seemed to have the potential to collaborate to each other according to one or more of these factors have never collaborated. One possible reason might be that collaboration is not popular behaviours among assignees during the process of patent application or maintain. Another reason could be the competitions between assignees. Many a time the promising pairs are competing pairs. Therefore, it was hard to carry out regression analysis basing on those four factors to get usable coefficients set of the four factors. The LCI model could only be used to make qualitative analysis on collaboration potential when it was revised.", "paper_title": "Mapping the evolving patterns of patent assignees' collaboration networks and identifying the collaboration potential", "paper_id": "WOS:000343609900019"}