{"auto_keywords": [{"score": 0.02827799607698675, "phrase": "csit"}, {"score": 0.00481495049065317, "phrase": "mimo_broadcast"}, {"score": 0.004777057265449592, "phrase": "interference"}, {"score": 0.0047113960612140335, "phrase": "cognitive_radio_channels"}, {"score": 0.00417115038996633, "phrase": "cognitive_radio_channel"}, {"score": 0.004010960493946656, "phrase": "channel_state_information"}, {"score": 0.0036926236934657864, "phrase": "k-user_mimo_bc"}, {"score": 0.003644714340300824, "phrase": "exact_dof_region"}, {"score": 0.003535320700255283, "phrase": "time_division"}, {"score": 0.0032404677650217407, "phrase": "relative_numbers"}, {"score": 0.002855934865505357, "phrase": "additive_noises"}, {"score": 0.0024202121068188616, "phrase": "dof"}, {"score": 0.0023371689326096476, "phrase": "robust_no-csit_schemes"}, {"score": 0.0022084059770026416, "phrase": "csi_feedback"}, {"score": 0.0021049977753042253, "phrase": "even_the_dof"}], "paper_keywords": ["Broadcast channel (BC)", " cognitive radio channel (CRC)", " degree-of-freedom (DoF) region", " interference channel", " multihop interference network", " multiple-input multiple-output (MIMO) systems", " X network"], "paper_abstract": "The degree-of-freedom (DoF) regions are characterized for the multiple-input multiple-output (MIMO) broadcast channel (BC), interference channels (ICs), including X and multihop ICs, and the cognitive radio channel (CRC), when there is no channel state information at the transmitter(s) (CSIT) and for fading distributions in which transmit directions are statistically indistinguishable. For the K-user MIMO BC, the exact DoF region is obtained, which shows that time division is DoF-region optimal. For the two-user MIMO IC and CRC, inner and outer bounds are obtained that coincide for a vast majority of the relative numbers of antennas at the four terminals. Finally, the DoF of the K-user MIMO IC, the CRC, and X networks are obtained for certain classes of these networks. The results herein are derived for fading distributions and additive noises that are more general than those considered in other simultaneous related works. The DoF with and without CSIT are compared and conditions under which a lack of CSIT does, or does not, result in the loss of DoF are identified, thereby 1) providing robust no-CSIT schemes that have the same DoF as their previously found CSIT counterparts and 2) identifying situations where CSI feedback to transmitters would provide gains that are significant enough that even the DoF could be improved.", "paper_title": "The Degree-of-Freedom Regions of MIMO Broadcast, Interference, and Cognitive Radio Channels With No CSIT", "paper_id": "WOS:000306518600022"}