{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "dense_crowds"}, {"score": 0.015482531745998587, "phrase": "neighborhood_motion_concurrence"}, {"score": 0.006766849828920556, "phrase": "crowd_flow"}, {"score": 0.004562743714811391, "phrase": "prior_knowledge"}, {"score": 0.004493130934067195, "phrase": "difficult_problem"}, {"score": 0.004081385289516914, "phrase": "visual_and_contextual_information"}, {"score": 0.003942544019605881, "phrase": "novel_tracking_method"}, {"score": 0.003837817436476726, "phrase": "alternative_and_complementary_approach"}, {"score": 0.0035399770257915466, "phrase": "dynamic_crowd_flows"}, {"score": 0.003445906915464945, "phrase": "previous_frames"}, {"score": 0.0033672608231654897, "phrase": "automatic_identification"}, {"score": 0.00334144503360907, "phrase": "prominent_individuals"}, {"score": 0.0030583717270715556, "phrase": "dense_crowd"}, {"score": 0.002703869368554536, "phrase": "five-frame_instantaneous_flow"}, {"score": 0.0023178219772486868, "phrase": "proposed_solution"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Crowd analysis", " Dense crowds", " Tracking", " Prominence", " Neighborhood motion concurrence", " Hierarchical tracking"], "paper_abstract": "Methods designed for tracking in dense crowds typically employ prior knowledge to make this difficult problem tractable. In this paper, we show that it is possible to handle this problem, without any priors, by utilizing the visual and contextual information already available in such scenes. We propose a novel tracking method tailored to dense crowds which provides an alternative and complementary approach to methods that require modeling of crowd flow and, simultaneously, is less likely to fail in the case of dynamic crowd flows and anomalies by minimally relying on previous frames. Our method begins with the automatic identification of prominent individuals from the crowd that are easy to track. Then, we use Neighborhood Motion Concurrence to model the behavior of individuals in a dense crowd, this predicts the position of an individual based on the motion of its neighbors. When the individual moves with the crowd flow, we use Neighborhood Motion Concurrence to predict motion while leveraging five-frame instantaneous flow in case of dynamically changing flow and anomalies. All these aspects are then embedded in a framework which imposes hierarchy on the order in which positions of individuals are updated. Experiments on a number of sequences show that the proposed solution can track individuals in dense crowds without requiring any pre-processing, making it a suitable online tracking algorithm for dense crowds. (C) 2013 Elsevier B.V. All rights reserved.", "paper_title": "Tracking in dense crowds using prominence and neighborhood motion concurrence", "paper_id": "WOS:000331500700002"}