{"auto_keywords": [{"score": 0.0379174999603017, "phrase": "dm"}, {"score": 0.00481495049065317, "phrase": "subjective_evaluation"}, {"score": 0.004747429622531595, "phrase": "exchange_reliability"}, {"score": 0.004615202066192795, "phrase": "decision_maker"}, {"score": 0.004392565073466714, "phrase": "different_information_senders"}, {"score": 0.004240116703465252, "phrase": "finitely_many_characteristics"}, {"score": 0.004035500442527029, "phrase": "available_alternatives"}, {"score": 0.0036424097335610492, "phrase": "subjective_components"}, {"score": 0.0035408501923902477, "phrase": "exact_alternative"}, {"score": 0.0034299649219748513, "phrase": "complete_description"}, {"score": 0.003334309053314909, "phrase": "subjective_biases"}, {"score": 0.0030847461428168614, "phrase": "normative_setting"}, {"score": 0.0028842551358494823, "phrase": "evaluation_criterion"}, {"score": 0.0025573643582417573, "phrase": "existing_differences"}, {"score": 0.002530359917257626, "phrase": "preference_order"}, {"score": 0.00241658945942583, "phrase": "novel_approach"}, {"score": 0.0023079225317714815, "phrase": "expected_utility_literature"}, {"score": 0.002157811371348755, "phrase": "ranking_criterion"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Decision analysis", " Multi-attribute alternative", " Subjective perception", " Subjective description", " Ordinal ranking", " Expected utility"], "paper_abstract": "We consider the problem of a decision maker (DM) who must choose among a set of alternatives offered by different information senders (ISs). Each alternative is characterized by finitely many characteristics. We assume that the DM and the ISs have their own perception of the available alternatives. These perceptions are reflected by the evaluations provided for the characteristics of the alternatives and the order of importance assigned to the characteristics. Due to these subjective components, the DM may not envision the exact alternative that an IS describes, even when a complete description of the alternative is provided. These subjective biases are common in the literature analyzing the effect of framing on the behavior of the DMs. This paper provides a normative setting illustrating how the DMs should consider these differences in perception when interacting with other DMs. We design an evaluation criterion that allows the DM to generate a reliability ranking on the set of ISs and, hence, to quantify the likelihood of choosing any alternative. This ranking is based on the existing differences between the preference order of the DM and those of the ISs. Our results constitute a novel approach to choice and search under uncertainty that enhances the findings of the expected utility literature. We provide several examples to demonstrate the applicability of the method proposed and exhibit the efficacy of the ranking criterion designed. (C) 2015 Elsevier Inc. All rights reserved.", "paper_title": "An ordinal ranking criterion for the subjective evaluation of alternatives and exchange reliability", "paper_id": "WOS:000358093400018"}