{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "historical_period"}, {"score": 0.049581014501477026, "phrase": "ethnic_origin"}, {"score": 0.04860000689752459, "phrase": "stylistic_feature_sets"}, {"score": 0.04811643643051334, "phrase": "text_classification"}, {"score": 0.004545793387330536, "phrase": "important_and_challenging_research_domain"}, {"score": 0.004137288854115515, "phrase": "application_domain"}, {"score": 0.0040942189695983185, "phrase": "jewish_law_articles"}, {"score": 0.003905864553426306, "phrase": "stylistic_classification"}, {"score": 0.0036298852579236627, "phrase": "hebrew"}, {"score": 0.0035920758080335655, "phrase": "aramaic"}, {"score": 0.0035178838150480914, "phrase": "english"}, {"score": 0.003355717283753749, "phrase": "six_different_sets"}, {"score": 0.003320756562046789, "phrase": "stylistic_features"}, {"score": 0.002823227604203869, "phrase": "svm"}, {"score": 0.0027356847952125433, "phrase": "applied_machine_learning_method"}, {"score": 0.0025824576209656676, "phrase": "quantitative_set"}, {"score": 0.002218299213266519, "phrase": "feature_sets"}], "paper_keywords": [""], "paper_abstract": "Text classification is an important and challenging research domain. In this paper, identifying historical period and ethnic origin of documents using stylistic feature sets is investigated. The application domain is Jewish Law articles written in Hebrew-Aramaic. Such documents present various interesting problems for stylistic classification. Firstly, these documents include words from both languages. Secondly, Hebrew and Aramaic are richer than English in their morphology forms. The classification is done using six different sets of stylistic features: quantitative features, orthographic features, topographic features, lexical features and vocabulary richness. Each set of features includes various baseline features, some of them formalized by us. SVM has been chosen as the applied machine learning method since it has been very successful in text classification. The quantitative set was found as very successful and superior to all other sets. Its features are domain-independent and language-independent. It will be interesting to apply these feature sets in general and the quantitative set in particular into other domains as well as into other.", "paper_title": "Identifying historical period and ethnic origin of documents using stylistic feature sets", "paper_id": "WOS:000241631200013"}