{"auto_keywords": [{"score": 0.04909558158843681, "phrase": "user_performance"}, {"score": 0.022547531763273346, "phrase": "motor_disabilities"}, {"score": 0.015719716506582538, "phrase": "luminosity_contrast"}, {"score": 0.007728570563421407, "phrase": "severe_motor_disabilities"}, {"score": 0.00711434042264111, "phrase": "bci_applications"}, {"score": 0.004580933283492972, "phrase": "brain-computer_interfaces"}, {"score": 0.004543058161597828, "phrase": "bci"}, {"score": 0.004412881870378388, "phrase": "new_channel"}, {"score": 0.0034678302347682694, "phrase": "ten_participants"}, {"score": 0.003439117493141663, "phrase": "neuromuscular_disabilities"}, {"score": 0.0030995835539697893, "phrase": "overall_accuracy"}, {"score": 0.0030357976028714557, "phrase": "able-bodied_participants"}, {"score": 0.00286407451582299, "phrase": "stimulus_duration"}, {"score": 0.00284034646798833, "phrase": "significant_effects"}, {"score": 0.002735972929840289, "phrase": "high_luminosity_contrast"}, {"score": 0.0027133032795773697, "phrase": "middle_or_short_stimulus_duration"}, {"score": 0.002404885278896803, "phrase": "bci_control"}, {"score": 0.0023849523850778807, "phrase": "bci_illiteracy"}, {"score": 0.002249961956629804, "phrase": "future_research"}, {"score": 0.0022220423638260015, "phrase": "bci_systems"}, {"score": 0.0021049977753042253, "phrase": "nonmuscular_communication"}], "paper_keywords": [""], "paper_abstract": "Brain-computer interfaces (BCI) have potential to provide a new channel of communication and control for people with severe motor disabilities. Although many empirical studies exist, few have specifically evaluated the impact of contributing factors on user performance and perception in BCI applications, especially for users with motor disabilities. This article reports the effects of luminosity contrast and stimulus duration on user performance and usage preference in a P300-based BCI application, P300 Speller. Ten participants with neuromuscular disabilities (amyotrophic lateral sclerosis and cerebral palsy) and 10 able-bodied participants were asked to spell six 10-character phrases in the P300 Speller. The overall accuracy was 76.5% for the able-bodied participants and 26.8% for participants with motor disabilities. The results showed that luminosity contrast and stimulus duration have significant effects on user performance. In addition, participants preferred high luminosity contrast with middle or short stimulus duration. However, these effects on user performance and preference varied for participants with and without motor disabilities. The results also indicated that although most participants with motor disabilities can establish BCI control, BCI illiteracy does exist. These results of the study should provide insights into the future research of the BCI systems, especially the real-world applicability of the BCI applications as a nonmuscular communication and control system for people with severe motor disabilities.", "paper_title": "Effects of Luminosity Contrast and Stimulus Duration on User Performance and Preference in a P300-Based Brain-Computer Interface", "paper_id": "WOS:000328929800005"}