{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "grid_management_system"}, {"score": 0.00462919213721188, "phrase": "semantic_grid_middleware"}, {"score": 0.004521179256835894, "phrase": "organized_and_easy_usable_grid_management_system"}, {"score": 0.0042119653427658025, "phrase": "grid_computing_environment"}, {"score": 0.0035699363258657212, "phrase": "grid_middleware_system_area"}, {"score": 0.003378385493203297, "phrase": "information_system"}, {"score": 0.003248122129141679, "phrase": "grid"}, {"score": 0.00290855128461017, "phrase": "grid_services"}, {"score": 0.0027741761880779535, "phrase": "data_mining_process"}, {"score": 0.002242127152093798, "phrase": "semantic_grid_middleware_system"}, {"score": 0.0021049977753042253, "phrase": "semantic_information_system"}], "paper_keywords": ["Grid", " middleware", " semantic", " data mining", " resource allocation"], "paper_abstract": "Well organized and easy usable Grid management system is very important for executing various Grid applications and managing Grid computing environment. Moreover, information system which can support Grid management system by providing various Grid environment related information is also one of the most interesting issue in the Grid middleware system area. Effective cooperation between Grid management system and information system can make a novel Grid middleware system. Especially, service oriented architecture based Grid management system is flexible and extensible for providing various type of Grid services. Also, information system based on data mining process which comprises various different kinds of domains such as users, resources and applications can make Grid management system more precise and efficient. In this paper, we propose semantic Grid middleware system which is a combination of Grid management system and semantic information system.", "paper_title": "Grid Management System and Information System for Semantic Grid Middleware", "paper_id": "WOS:000285646500006"}