{"auto_keywords": [{"score": 0.04654897011197719, "phrase": "collaboration_quality"}, {"score": 0.004728122501822142, "phrase": "success_model"}, {"score": 0.004592427776766215, "phrase": "ultimately_customer_loyalty"}, {"score": 0.004493207015584002, "phrase": "process_quality"}, {"score": 0.003800156761779008, "phrase": "research_hypotheses"}, {"score": 0.0037725685596495355, "phrase": "findings_-_results"}, {"score": 0.003611179715045633, "phrase": "way_system"}, {"score": 0.003533083861130305, "phrase": "quality_influences_usefulness"}, {"score": 0.003213660268958121, "phrase": "significant_effects"}, {"score": 0.0029230308228548807, "phrase": "business_processes"}, {"score": 0.00289123004877327, "phrase": "collaboration_activities"}, {"score": 0.0027876981671591202, "phrase": "customer_service"}, {"score": 0.002747328139245956, "phrase": "system_functionalities"}, {"score": 0.002535492891830764, "phrase": "taiwanese_supply_chain"}, {"score": 0.0024625698287060586, "phrase": "different_contexts"}, {"score": 0.002339953069296797, "phrase": "cross-border_business_operations"}, {"score": 0.0021752783872387173, "phrase": "behavioural_considerations"}, {"score": 0.0021359494324422997, "phrase": "functional_issues"}, {"score": 0.0021049977753042253, "phrase": "information_systems"}], "paper_keywords": ["IS success model", " B2B e-commerce", " E-commerce quality", " Process quality", " Collaboration quality", " Electronic commerce", " Customer satisfaction"], "paper_abstract": "Purpose - The purpose of this study is to propose two additions to the existing IS success model to influence usefulness and satisfaction, and ultimately customer loyalty. This study posits that process quality and collaboration quality will significantly influence perceptions on satisfaction, since both considerations are expected to improve interactions between the organization and its customers. Design/methodology/approach - The developed research model was tested in the context of B2B e-commerce users, employing structural equation modelling-partial least square to analyze and test the research hypotheses. Findings - Results show that adding process and collaboration quality to the model affects the way system, information, and service quality influences usefulness and satisfaction, suggesting a shift in perspectives and priorities when it comes to B2B e-commerce transactions. Furthermore, results show that process and collaboration quality have significant effects on usefulness and satisfaction, reinforcing the objective of using B2B e-corrunerce systems across supply chain members. Practical implications - This highlights the importance of improving business processes and enhancing collaboration activities, implying that managers should focus their efforts into enhancing customer service on top of system functionalities and features via B2B to better work with their supply chain partners. However, this study is limited in the context of a Taiwanese supply chain, suggesting that further research consider its applicability in different contexts, culturally and geographically, especially given the fact that B2B e-commerce enables cross-border business operations. Originality/value - This study also extends the IS success model, especially in the context of B2B e-commerce, by emphasizing behavioural considerations on top of the functional issues present in any information systems.", "paper_title": "Process quality and collaboration quality on B2B e-commerce", "paper_id": "WOS:000320902800008"}