{"auto_keywords": [{"score": 0.02767016440577914, "phrase": "linear_behaviour"}, {"score": 0.00481495049065317, "phrase": "scientific_articles"}, {"score": 0.004607139608615063, "phrase": "citation_counts"}, {"score": 0.004425979295788883, "phrase": "scientific_community"}, {"score": 0.004101088357088207, "phrase": "bibliometric_indicators"}, {"score": 0.004052007312730483, "phrase": "research_policy"}, {"score": 0.003923965929636472, "phrase": "counting_citations"}, {"score": 0.0036212219870826725, "phrase": "scientific_area"}, {"score": 0.0035208552733545463, "phrase": "citation_count"}, {"score": 0.003010347277067459, "phrase": "double_exponential-poisson_law"}, {"score": 0.002915125480162171, "phrase": "mean_citation_rate"}, {"score": 0.0025326211341475903, "phrase": "mean_impact"}, {"score": 0.002308953751676031, "phrase": "mean_citation"}, {"score": 0.0022721178679337025, "phrase": "impact_factor"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Citations analyses", " Field", " Impact"], "paper_abstract": "The citation counts are increasingly used to assess the impact on the scientific community of publications produced by a researcher, an institution or a country. There are many institutions that use bibliometric indicators to steer research policy and for hiring or promotion decisions. Given the importance that counting citations has today, the aim of the work presented here is to show how citations are distributed within a scientific area and determine the dependence of the citation count on the article features. All articles referenced in the Web of Science in 2004 for Biology & Biochemistry, Chemistry, Mathematics and Physics were considered. We show that the distribution of citations is well represented by a double exponential-Poisson law. There is a dependence of the mean citation rate on the number of co-authors, the number of addresses and the number of references, although this dependence is a little far from the linear behaviour. For the relation between the mean impact and the number of pages the dependence obtained was very low. For Biology & Biochemistry and Chemistry we found a linear behaviour between the mean citation per article and impact factor and for Mathematics and Physics the results obtained are near to the linear behaviour. (C) 2009 Elsevier Ltd. All rights reserved.", "paper_title": "Citations to scientific articles: Its distribution and dependence on the article features", "paper_id": "WOS:000272631100001"}