{"auto_keywords": [{"score": 0.027532906467297294, "phrase": "spambands"}, {"score": 0.00481495049065317, "phrase": "continuous_efforts"}, {"score": 0.004471035765089235, "phrase": "spam_traffic_analysis"}, {"score": 0.004421601997620278, "phrase": "important_tool"}, {"score": 0.004324361008753555, "phrase": "network_administrators"}, {"score": 0.0035528259557800683, "phrase": "autonomous_system"}, {"score": 0.003474624627033273, "phrase": "interesting_neighborhood"}, {"score": 0.0031434146012468307, "phrase": "spammer_machines"}, {"score": 0.0030288982511487835, "phrase": "short_time"}, {"score": 0.002379484250348599, "phrase": "multiple_ases"}], "paper_keywords": ["Spam traffic", " Autonomous system", " Network bad neighborhoods"], "paper_abstract": "Despite the continuous efforts to mitigate spam, the volume of such messages continues to grow and identifying spammers is still a challenge. Spam traffic analysis is an important tool in this context, allowing network administrators to understand the behavior of spammers, both as they obfuscate messages and try to hide inside the network. This work adds to that body of information by analyzing the sources of spam to understand to what extent they explain the traffic observed. Our results show that, in many cases, an Autonomous System (AS) represents an interesting neighborhood to observe, with most ASes falling into four basic types: heavy and light senders, which tend to have many or very few spammer machines respectively, frequent small offenders, where spammer machines appear every now and then but disappear in a short time, and conniving ASes, where most machines do not send spam, but a few are heavy, continuous senders. Not only that, but also by grouping machines based on the campaigns that they send together, we define the notion of SpamBands. Those bands identify groups of machines that are probably controlled by the same spammer, and our findings show that they often span multiple ASes. The identification of AS neighborhood types and SpamBands may simplify the combat against spam, focusing efforts at the sources as a whole, possibly improving blacklists by grouping machines found in a same AS or SpamBands.", "paper_title": "Neighborhoods and bands: an analysis of the origins of spam", "paper_id": "WOS:000366761100001"}