{"auto_keywords": [{"score": 0.027586301726896356, "phrase": "privacy_management_models"}, {"score": 0.0265095251874421, "phrase": "user_privacy_sentiment"}, {"score": 0.00481495049065317, "phrase": "enhanced_privacy_management_models"}, {"score": 0.004622783000449884, "phrase": "new_social_network_privacy_management_models"}, {"score": 0.0042859292226559535, "phrase": "proven_clustering_techniques"}, {"score": 0.003859500298805362, "phrase": "measurable_agreement"}, {"score": 0.003770633265791941, "phrase": "user-defined_relationship_groups"}, {"score": 0.003619993477999133, "phrase": "new_privacy_management_model"}, {"score": 0.003557283483525861, "phrase": "users'_memory"}, {"score": 0.0031660031870090434, "phrase": "different_techniques"}, {"score": 0.0030572112793962004, "phrase": "example_friends"}, {"score": 0.0024640253074497114, "phrase": "mass_customization"}, {"score": 0.0021049977753042253, "phrase": "privacy_sentiment"}], "paper_keywords": ["Policy", " human factors", " privacy", " access control", " social network"], "paper_abstract": "We enhance existing and introduce new social network privacy management models and we measure their human effects. First, we introduce a mechanism using proven clustering techniques that assists users in grouping their friends for traditional group-based policy management approaches. We found measurable agreement between clusters and user-defined relationship groups. Second, we introduce a new privacy management model that leverages users' memory and opinion of their friends (called example friends) to set policies for other similar friends. Finally, we explore different techniques that aid users in selecting example friends. We found that by associating policy temples with example friends (versus group labels), users author policies more efficiently and have improved perceptions over traditional group-based policy management approaches. In addition, our results show that privacy management models can be further enhanced by utilizing user privacy sentiment for mass customization. By detecting user privacy sentiment (i.e., an unconcerned user, a pragmatist or a fundamentalist), privacy management models can be automatically tailored specific to the privacy sentiment and needs of the user.", "paper_title": "Human Effects of Enhanced Privacy Management Models", "paper_id": "WOS:000334668500005"}