{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "general_case"}, {"score": 0.004686963264680882, "phrase": "\"three_squares_lemma"}, {"score": 0.0035794251590584563, "phrase": "\"new_periodicity_lemma"}, {"score": 0.003099723664407622, "phrase": "similar_restrictions"}, {"score": 0.0030036501770192865, "phrase": "alternative_strategy"}, {"score": 0.0028715299874549245, "phrase": "neighbouring_positions"}, {"score": 0.0026600905156986317, "phrase": "straightforward_way"}, {"score": 0.0026009105281485888, "phrase": "complicated_details"}, {"score": 0.0024641814990854463, "phrase": "new_insights"}, {"score": 0.002387758958649797, "phrase": "final_two_remaining_unproved_subcases"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["String", " Word", " Overlapping squares", " Repetition", " Run", " Maximal periodicity"], "paper_abstract": "The \"Three Squares Lemma\" [9] famously explored the consequences of supposing that three squares occur at the same position in a string; essentially it showed that this phenomenon could not occur unless the longest of the three squares was at least the sum of the lengths of the other two. More recently, several papers [10,30,21,13] have greatly extended this result to a \"New Periodicity Lemma\" (NPL) by supposing that only two of the squares occur at the same position, with a third occurring in a neighbourhood to the right in these cases also, similar restrictions apply. In this paper an alternative strategy is proposed: the consequences of having only two squares at neighbouring positions are carefully analyzed, and then the observation is made that the analysis applies in a straightforward way (though perhaps with complicated details) to the three neighbouring squares problem in its full generality. We then apply these new insights, first to proofs of the final two remaining unproved subcases (out of a total of 14) of the NPL [10], then to an instance of the more general problem. (C) 2015 Elsevier B.V. All rights reserved.", "paper_title": "Three overlapping squares: The general case characterized & applications", "paper_id": "WOS:000358972800003"}