{"auto_keywords": [{"score": 0.030583894174739484, "phrase": "negroponte"}, {"score": 0.00481495049065317, "phrase": "digital_information"}, {"score": 0.004334657104697421, "phrase": "mere_collection"}, {"score": 0.0038465304237380125, "phrase": "magnetic_field"}, {"score": 0.0036669760226536977, "phrase": "purported_immateriality"}, {"score": 0.003597514862052876, "phrase": "considerable_advantages"}, {"score": 0.003413183361838603, "phrase": "analog_media"}, {"score": 0.003131637033429892, "phrase": "material_carriers"}, {"score": 0.0030285084113651035, "phrase": "worldwide_shift"}, {"score": 0.0026235360404084137, "phrase": "material_forms"}, {"score": 0.0024771000236931836, "phrase": "material_objects"}, {"score": 0.002327648608736437, "phrase": "material_constraints"}, {"score": 0.0022944576894161485, "phrase": "physical_devices"}, {"score": 0.0021560018573288666, "phrase": "surprising_picture"}, {"score": 0.0021049977753042253, "phrase": "material_process"}], "paper_keywords": [""], "paper_abstract": "In both the popular press and scholarly research, digital information is persistently discussed in terms that imply its immateriality. In this characterization, the digital derives its power from its nature as a mere collection of 0s and 1s wholly independent from the particular media on which it is stored-hard drive, network wires, optical disk, etc.-and the particular signal carrier which encodes bits-variations of magnetic field, voltages, or pulses of light. This purported immateriality endows bits with considerable advantages: they are immune from the economics and logistics of analog media, and from the corruption, degradation, and decay that necessarily result from the handling of material carriers of information, resulting in a worldwide shift \"from atom to bits\" as captured by Negroponte. This is problematic: however immaterial it might appear, information cannot exist outside of given instantiations in material forms. But what might it mean to talk of bits as material objects? In this paper I argue that bits cannot escape the material constraints of the physical devices that manipulate, store, and exchange them. Such an analysis reveals a surprising picture of computing as a material process through and through.", "paper_title": "A Material History of Bits", "paper_id": "WOS:000291122800004"}