{"auto_keywords": [{"score": 0.03668992666715297, "phrase": "tui"}, {"score": 0.004759635663291431, "phrase": "video_games"}, {"score": 0.004597457370802855, "phrase": "physical_activity"}, {"score": 0.004289419884432487, "phrase": "tangible_user_interfaces"}, {"score": 0.0035855066449812273, "phrase": "hardware_design"}, {"score": 0.0034233569308012982, "phrase": "exercise-based_games"}, {"score": 0.003287482882222731, "phrase": "proposed_tui"}, {"score": 0.003138768436081888, "phrase": "elemental_building_blocks"}, {"score": 0.0030492472433481764, "phrase": "numerous_shapes"}, {"score": 0.0027795345823932406, "phrase": "computer_screen"}, {"score": 0.0022048406330100697, "phrase": "educational_value"}, {"score": 0.002141898874982106, "phrase": "multimedia_output_modalities"}, {"score": 0.0021049977753042253, "phrase": "children's_playing_experience"}], "paper_keywords": ["Tangible user interface", " Dynamic TUIs", " Exergaming"], "paper_abstract": "One common concern with video games today is the lack of physical activity they demand from the user. The design of games and tangible user interfaces (TUIs) that stimulate players and engage them into fun exercising activities is starting to attract the attention of many researchers and companies. This paper presents the software and hardware design and development of a TUI intended for exercise-based games targeted mostly towards children. The proposed TUI, SmartPads, can be constructed using elemental building blocks (pads) into numerous shapes. The pads-which are individually controlled by microcontrollers-are mapped onto a computer screen in real-time. A user interacts with the TUI by stepping on the pads. To evaluate the functionality and efficiency of the TUI, we developed three games in the field of exergaming. The games also have an educational value and are integrated with multimedia output modalities to enrich children's playing experience.", "paper_title": "SmartPads: a plug-N-play configurable tangible user interface", "paper_id": "WOS:000339891300022"}