{"auto_keywords": [{"score": 0.04938541482229792, "phrase": "keyword_search"}, {"score": 0.02000709313509408, "phrase": "open_problem"}, {"score": 0.010612387000973441, "phrase": "anonymous_conditional_proxy"}, {"score": 0.01039894484281271, "phrase": "weng_et_al"}, {"score": 0.008993101179685587, "phrase": "cca-secure_c-pre_schemes"}, {"score": 0.004635632812446176, "phrase": "conditional_proxy"}, {"score": 0.0037563823007675766, "phrase": "random_oracle"}, {"score": 0.003669578754009765, "phrase": "'s_scheme"}, {"score": 0.003574311504164068, "phrase": "weaker_variant"}, {"score": 0.0035224543064259553, "phrase": "harmless_mauling"}, {"score": 0.003491700554796557, "phrase": "challenge_ciphertext"}, {"score": 0.0033127168183223876, "phrase": "full_cca-security"}, {"score": 0.003255111384162138, "phrase": "shao_et_al"}, {"score": 0.0030168074061369303, "phrase": "public_key_encryption"}, {"score": 0.002870480311200678, "phrase": "efficient_unidirectional_pres_scheme"}, {"score": 0.00261397020353106, "phrase": "c-pre"}, {"score": 0.0025987195907507393, "phrase": "peks."}, {"score": 0.0024944216175108126, "phrase": "secure_scheme"}, {"score": 0.002366436764378271, "phrase": "chosen_ciphertext_attacks"}, {"score": 0.002352626922459313, "phrase": "c-pres_schemes"}, {"score": 0.002338897481852333, "phrase": "keyword_anonymity"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Public key encryption", " Conditional proxy re-encryption", " Keyword search", " Anonymity", " Chosen-ciphertext security"], "paper_abstract": "Weng et al. introduced the notion of conditional proxy re-encryption (or C-PRE, for short), whereby only the ciphertext satisfying one condition set by the delegator can be transformed by the proxy and then decrypted by delegatee. Nonetheless, they left an open problem on how to construct CCA-secure C-PRE schemes with anonymity. Fang et al. answered this question by presenting a construction of anonymous conditional proxy re-encryption (C-PRE) scheme without requiring random oracle. Nevertheless, Fang et al.'s scheme only satisfies the RCCA-security (which is a weaker variant of CCA-security assuming a harmless mauling of the challenge ciphertext is tolerated). Hence, it remains an open problem whether CCA-secure C-PRE schemes that satisfy both anonymity and full CCA-security can really be realized. Shao et al. introduced a new cryptographic primitive, called proxy re-encryption with keyword search (PRES), which is a combination of PRE and public key encryption with keyword search (PEKS), and they left an open problem on how to design an efficient unidirectional PRES scheme. In this paper, we answer the above open problems by proposing a new cryptographic primitive called conditional proxy re-encryption with keyword search (C-PRES), which combines C-PRE and PEKS. We note that there are subtleties in combining these two notions to achieve a secure scheme, and hence, the combination is not trivial. We propose a definition of security against chosen ciphertext attacks for C-PRES schemes with keyword anonymity, and thereafter present a scheme that satisfies the definition. The performance of our scheme outperforms Weng et al.'s construction, which has been regarded as the most efficient C-PRE scheme to date. (C) 2012 Elsevier B.V. All rights reserved.", "paper_title": "Chosen-ciphertext secure anonymous conditional proxy re-encryption with keyword search", "paper_id": "WOS:000311474400004"}