{"auto_keywords": [{"score": 0.029957714093783155, "phrase": "serving_tunnel"}, {"score": 0.027280196708650777, "phrase": "second_solution"}, {"score": 0.009015596865106912, "phrase": "first_solution"}, {"score": 0.007220490761407367, "phrase": "tor"}, {"score": 0.00481495049065317, "phrase": "anonymous_publishing"}, {"score": 0.0047852458513833315, "phrase": "anonymous_communication"}, {"score": 0.004086443472472481, "phrase": "sharing_systems"}, {"score": 0.004061214835223812, "phrase": "partial_anonymity"}, {"score": 0.0035879931522580745, "phrase": "file_sharing_systems"}, {"score": 0.0034356922031028533, "phrase": "proposed_solutions"}, {"score": 0.003372408902017458, "phrase": "global_hash_functions"}, {"score": 0.003320561182494713, "phrase": "index_server"}, {"score": 0.003120995227740011, "phrase": "anonymity_tunnel"}, {"score": 0.003035135667860725, "phrase": "different_user"}, {"score": 0.0028615323526689582, "phrase": "sender_anonymity_tunnels"}, {"score": 0.0026978319081381145, "phrase": "rendezvous_tunnel"}, {"score": 0.0026399046763432906, "phrase": "random_walk"}, {"score": 0.0024658019116387845, "phrase": "tor's_hidden_services"}, {"score": 0.002383094469215288, "phrase": "semi-honest_adversary"}, {"score": 0.0023537101705489957, "phrase": "limited_number"}, {"score": 0.002267708463966758, "phrase": "tor_primitives"}, {"score": 0.0021049977753042253, "phrase": "server_anonymity"}], "paper_keywords": ["Anonymity", " Publisher anonymity", " Anonymity in peer-to-peer file sharing"], "paper_abstract": "Anonymous communication, and anonymous Peer-to-Peer (P2P) file sharing systems in particular, have received considerable attention in recent years. In a P2P file sharing system there are three types of participants: publishers, who insert content into the system, servers, which store content, and readers, who retrieve the content from the servers. Existing anonymity P2P file sharing systems confer partial anonymity; they provide anonymity to participant pairs, such as servers and readers or publishers and readers, but do not consider the anonymity of all three types of participants together. In this work we propose two solutions for anonymous P2P file sharing systems, both of which provide anonymity to all three types of participants. The proposed solutions are based on indexing by global hash functions (rather than an index server), dispersal of information, and three anonymity tunnels - publishing tunnel, reading tunnel, and serving tunnel. Each anonymity tunnel is designed to protect the anonymity of a different user (publisher, reader or server respectively). In both solutions the publishing and reading tunnels are sender anonymity tunnels, where the serving tunnel is different in each solution. In the first solution, the serving tunnel is a rendezvous tunnel, constructed by means of a random walk and terminating at the server. In the second solution, which is based on Tor, the serving tunnel is built using Tor's hidden services. The first solution preserves anonymity in the presence of a semi-honest adversary that controls a limited number of nodes in the system. The second solution is based on Tor primitives and copes with the same adversary as that assumed in Tor. The second solution also enhances Tor, ensuring publisher, reader, and server anonymity.", "paper_title": "Rendezvous tunnel for anonymous publishing", "paper_id": "WOS:000356581300002"}