{"auto_keywords": [{"score": 0.03919769031169631, "phrase": "tunable_survivability"}, {"score": 0.005255990546180378, "phrase": "full_survivability"}, {"score": 0.00481495049065317, "phrase": "efficient_design"}, {"score": 0.004756805752518494, "phrase": "survivable_networks"}, {"score": 0.0046993598473345395, "phrase": "current_survivability_schemes"}, {"score": 0.004342430078306461, "phrase": "single_failure"}, {"score": 0.004136333933790974, "phrase": "full_protection"}, {"score": 0.004061584718427419, "phrase": "rigid_design_constraints"}, {"score": 0.0038923605771735838, "phrase": "disjoint_paths"}, {"score": 0.002751751956416832, "phrase": "novel_hybridprotection_architecture"}, {"score": 0.002685558057339722, "phrase": "improved_performance"}, {"score": 0.0025423706961391034, "phrase": "related_qos_extensions"}, {"score": 0.0021049977753042253, "phrase": "major_improvements"}], "paper_keywords": ["survivability", " path restoration/protection", " routing"], "paper_abstract": "Current survivability schemes typically offer two degrees of protection, namely full protection (from a single failure) or no protection at all. Full protection translates into rigid design constraints, i.e., the employment of disjoint paths. We introduce the concept of tunable survivability that bridges the gap between full and no protection. First, we establish several fundamental properties of connections with tunable survivability. With that at hand, we devise efficient polynomial (optimal) connection establishment schemes for both 1 : 1 and 1 + 1 protection architectures. Then, we show that the concept of tunable survivability gives rise to a novel hybridprotection architecture, which offers improved performance over the standard 1 : 1 and 1 + 1 architectures. Next, we investigate some related QoS extensions. Finally, we demonstrate the advantage of tunable survivability over full survivability. In particular, we show that, by just slightly alleviating the requirement of full survivability, we obtain major improvements in terms of the \"feasibility\" as well as the \"quality\" of the solution.", "paper_title": "The power of tuning: A novel approach for the efficient design of survivable networks", "paper_id": "WOS:000247788700001"}