{"auto_keywords": [{"score": 0.03321035414613822, "phrase": "svm"}, {"score": 0.007260827310756039, "phrase": "good_definitions"}, {"score": 0.004602095199913686, "phrase": "svm_models"}, {"score": 0.004381527499253281, "phrase": "traditional_methods"}, {"score": 0.004316131658991366, "phrase": "experimental_results"}, {"score": 0.004299621153829837, "phrase": "single_combined_definition"}, {"score": 0.0042351951710402425, "phrase": "retrieved_definitions"}, {"score": 0.003325921766364862, "phrase": "ordinal_regression"}, {"score": 0.0031784960695034645, "phrase": "classification_model"}, {"score": 0.0031072444973406586, "phrase": "ordinal_regression_model"}, {"score": 0.003026127736667187, "phrase": "definition_candidates"}, {"score": 0.002543148295176345, "phrase": "baseline_methods"}, {"score": 0.002514464610980629, "phrase": "heuristic_rules"}, {"score": 0.002120982646893519, "phrase": "generic_models"}, {"score": 0.0021049977753042253, "phrase": "definition_ranking"}], "paper_keywords": ["definition search", " text mining", " web mining", " web search"], "paper_abstract": "This paper addresses the issue of search of definitions. Specifically, for a given term, we are to find out its definition candidates and rank the candidates according to their likelihood of being good definitions. This is in contrast to the traditional methods of either generating a single combined definition or outputting all retrieved definitions. Definition ranking is essential for tasks. A specification for judging the goodness of a definition is given. In the specification, a definition is categorized into one of the three levels: good definition, indifferent definition, or bad definition. Methods of performing definition ranking are also proposed in this paper, which formalize the problem as either classification or ordinal regression. We employ SVM (Support Vector Machines) as the classification model and Ranking SVM as the ordinal regression model respectively, and thus they rank definition candidates according to their likelihood of being good definitions. Features for constructing the SVM and Ranking SVM models are defined, which represent the characteristics of terms, definition candidate, and their relationship. Experimental results indicate that the use of SVM and Ranking SVM can significantly outperform the baseline methods such as heuristic rules, the conventional information retrieval-Okapi, or SVM regression. This is true when both the answers are paragraphs and they are sentences. Experimental results also show that SVM or Ranking SVM models trained in one domain can be adapted to another domain, indicating that generic models for definition ranking can be constructed.", "paper_title": "A supervised learning approach to search of definitions", "paper_id": "WOS:000238079200019"}