{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "controllable_item_sizes"}, {"score": 0.00474075475474847, "phrase": "natural_resource_allocation_problem"}, {"score": 0.004318881178805575, "phrase": "allowed_size"}, {"score": 0.004212838053019701, "phrase": "nonnegative_penalty"}, {"score": 0.003849711329589429, "phrase": "unit_bins"}, {"score": 0.0036288825833675127, "phrase": "operating_systems"}, {"score": 0.003452742572806342, "phrase": "offline_version"}, {"score": 0.003378385493203297, "phrase": "augmented_asymptotic_ptas."}, {"score": 0.0031549249117721946, "phrase": "online_bounded_space_variant"}, {"score": 0.0029097582786754444, "phrase": "best_possible_asymptotic_competitive_ratio"}, {"score": 0.0024672686023811574, "phrase": "covered_bins"}, {"score": 0.002414082940963702, "phrase": "best_possible_competitive_ratio"}, {"score": 0.002340081450249521, "phrase": "online_algorithms"}, {"score": 0.002325554982412043, "phrase": "unit_sized_bins"}, {"score": 0.002289631204915149, "phrase": "variable_sized_bins"}, {"score": 0.0021580985506699105, "phrase": "competitive_ratios"}], "paper_keywords": ["bin packing", " online algorithms", " approximation schemes", " discrete time-cost tradeoff"], "paper_abstract": "We consider a natural resource allocation problem in which we are given a set of items, where each item has a list of pairs associated with it. Each pair is a configuration of an allowed size for this item, together with a nonnegative penalty, and an item can be packed using any configuration in its list. The goal is to select a configuration for each item so that the number of unit bins needed to pack the sizes plus the sum of penalties is minimized. This problem has applications in operating systems, bandwidth allocation, and discrete time-cost tradeoff planning problems. For the offline version of the problem we design an augmented asymptotic PTAS. That is, an asymptotic approximation scheme that uses bins of size slightly larger than 1. We further consider the online bounded space variant, where only a constant number of bins can be open simultaneously. We design a sequence of algorithms, where the sequence of their competitive ratios tends to the best possible asymptotic competitive ratio. Finally, we study the bin covering problem, in which a bin is covered if the sum of sizes allocated to it is at least 1. In this setting, penalties are interpreted as profits and the goal is to maximize the sum of profits plus the number of covered bins. We design an algorithm of best possible competitive ratio, which is 2. We generalize our results for online algorithms and unit sized bins to the case of variable sized bins, where there may be several distinct sizes of bins available for packing or covering, and get that the competitive ratios are again the same as for the more standard online problems. (C) 2008 Elsevier Inc. All rights reserved.", "paper_title": "Bin packing with controllable item sizes", "paper_id": "WOS:000258642800004"}