{"auto_keywords": [{"score": 0.028350876909869448, "phrase": "single_node"}, {"score": 0.014882793560442406, "phrase": "adaptive_filtering"}, {"score": 0.012749522420034715, "phrase": "distributed_processing"}, {"score": 0.009909013949824253, "phrase": "qr_decomposition"}, {"score": 0.00481495049065317, "phrase": "wireless_sensor_networks"}, {"score": 0.00466085208934021, "phrase": "next_generation"}, {"score": 0.004526365546684684, "phrase": "signal_processing"}, {"score": 0.004438861041839598, "phrase": "current_generation"}, {"score": 0.004410068751933955, "phrase": "microcontroller_applications"}, {"score": 0.004213662826578328, "phrase": "energy_resources"}, {"score": 0.004172722575842674, "phrase": "single_computational_sensor_node"}, {"score": 0.004052263422466088, "phrase": "computational_resources"}, {"score": 0.0036513416285175763, "phrase": "new_distributed_qr_decomposition_algorithm"}, {"score": 0.0034999880739789257, "phrase": "prominent_applications"}, {"score": 0.003376813851525222, "phrase": "target_tracking"}, {"score": 0.0031638248208086263, "phrase": "new_scalable_tile-based_distributed_qr_decomposition_algorithm"}, {"score": 0.0030924870122337905, "phrase": "least-squares_problem"}, {"score": 0.0030524448705134283, "phrase": "proposed_distribution"}, {"score": 0.0029642298956837764, "phrase": "resource-aware_task_allocation"}, {"score": 0.002878556952876824, "phrase": "simple_decentralized_transmission_scheduling_scheme"}, {"score": 0.002723409977992608, "phrase": "larger_computations"}, {"score": 0.00242184774931214, "phrase": "test_bed"}, {"score": 0.0024061070225431525, "phrase": "telosb_sensor_nodes"}, {"score": 0.002336527289457915, "phrase": "higher_computational_capabilities"}, {"score": 0.0021049977753042253, "phrase": "energy-feasible_real-time"}], "paper_keywords": ["distributed QR decomposition", " wireless sensor networks", " distributed processing"], "paper_abstract": "Wireless sensor networks (WSNs) are starting to mature into the next generation where they can be used for adaptive filtering and signal processing, breaking away from the current generation of microcontroller applications. The tasks involved, however, are computationally intensive and strain the energy resources of any single computational sensor node. Moreover, most sensor nodes do not have the computational resources to complete many of these tasks repeatedly. Hence, exploring distributed processing on WSNs becomes a necessity to enable such computational load to be processed in real-time. In this work, a new distributed QR decomposition algorithm, on WSNs, is developed and implemented. QR decomposition has prominent applications in adaptive filtering which is essential for many WSN applications, such as target tracking and beamforming. The contributions of this work can be summarized as follows: (i) developing a new scalable tile-based distributed QR decomposition algorithm, (ii) distributing the least-squares problem based on the proposed distribution of the QR decomposition, (iii) developing resource-aware task allocation and mapping and (iv) developing a simple decentralized transmission scheduling scheme to guarantee efficient operation. This work demonstrates that distributed processing on WSNs paves the way for larger computations beyond the capabilities of a single node. This is accomplished while decreasing the energy per node and increasing the speed of the computation versus the implementation on a single node. The experiments, on a test bed of Telosb sensor nodes, prove that the proposed distributed algorithm enables higher computational capabilities while reducing the energy per node by up to 91.93% and speeding up the computation by up to 79.29% compared with running the QR decomposition on a single node, thus laying the foundation for energy-feasible real-time in-network processing.", "paper_title": "Energy-Aware Distributed QR Decomposition on Wireless Sensor Nodes", "paper_id": "WOS:000287757100007"}