{"auto_keywords": [{"score": 0.02246846748295755, "phrase": "peru"}, {"score": 0.00481495049065317, "phrase": "robust_humanitarian_facility_location"}, {"score": 0.004401794742140806, "phrase": "relief_items"}, {"score": 0.003802135020791801, "phrase": "industrial_and_humanitarian_environments"}, {"score": 0.0037309384824565695, "phrase": "humanitarian_supply_chains"}, {"score": 0.0030446120560494155, "phrase": "expected_performance"}, {"score": 0.0030017207229983385, "phrase": "relief_response"}, {"score": 0.0029039692582303904, "phrase": "problem_statement"}, {"score": 0.0028093921138602606, "phrase": "decision-making_support_model"}, {"score": 0.0027178867838199734, "phrase": "humanitarian_world"}, {"score": 0.002641823250595624, "phrase": "coherent_network"}, {"score": 0.00240328454980006, "phrase": "potential_resources"}, {"score": 0.0023139986108451967, "phrase": "stochastic_multi-scenarios_program"}, {"score": 0.002196609505859369, "phrase": "real-life_application_case"}, {"score": 0.002125020720324262, "phrase": "humanitarian_supply_chain"}], "paper_keywords": ["Humanitarian supply chain", " Stochastic Multi-Scenarios Program", " Facility location", " Pre-positioning", " Efficiency", " Resilience"], "paper_abstract": "Each year, more than 400 natural disasters hit the world. To be more responsive, humanitarians organize stocks of relief items. It is an issue to know the quantity of items to be stored and where they should be positioned. Many authors have tried to address this issue both in industrial and humanitarian environments. However, humanitarian supply chains today do not perform correctly, particularly as regards resilience and efficiency. This is mainly due to the fact that when a disaster occurs, some hazards can strongly impact the network by destroying some resources or collapsing infrastructure. The expected performance of the relief response is consequently strongly decreased. The problem statement of our research work consists in proposing a decision-making support model in artificial intelligence dedicated to the humanitarian world and capable of designing a coherent network that is still able to adequately manage the response to a disaster despite failures or inadequacies of infrastructure and potential resources. This contribution is defined through a Stochastic Multi-Scenarios Program as a core and a set of extensions. A real-life application case based on the design of a humanitarian supply chain in Peru is developed in order to highlight the benefits and limits of the proposition. (C) 2015 Elsevier Ltd. All rights reserved.", "paper_title": "A decision support system for robust humanitarian facility location", "paper_id": "WOS:000365369300005"}