{"auto_keywords": [{"score": 0.04952718217288557, "phrase": "social_networks"}, {"score": 0.006376906863022974, "phrase": "algorithmic_results"}, {"score": 0.00492787591154414, "phrase": "egp"}, {"score": 0.004899955188757842, "phrase": "pp"}, {"score": 0.00481495049065317, "phrase": "structural_search"}, {"score": 0.004788154222254347, "phrase": "optimization"}, {"score": 0.004718230196581402, "phrase": "explosive_growth"}, {"score": 0.004504355451608786, "phrase": "useful_structures"}, {"score": 0.004413846562278824, "phrase": "telephone_network"}, {"score": 0.004325148424301224, "phrase": "large_social_networks"}, {"score": 0.004275262915031191, "phrase": "important_role"}, {"score": 0.0038513073787989054, "phrase": "skill_requirement"}, {"score": 0.0037411604449359794, "phrase": "underlying_social_property"}, {"score": 0.0035714167992018666, "phrase": "specific_examples"}, {"score": 0.0034894451015047875, "phrase": "fundamental_set-based_notions"}, {"score": 0.003264073180191501, "phrase": "influential_set"}, {"score": 0.00323576714040102, "phrase": "central_set"}, {"score": 0.0026100018366802613, "phrase": "simple_networks"}, {"score": 0.002462664392109308, "phrase": "optimal_solution"}, {"score": 0.0023101592330916822, "phrase": "general_graph"}, {"score": 0.002230984431056064, "phrase": "practical_considerations"}, {"score": 0.0021733853238695296, "phrase": "size-constrained_variant"}, {"score": 0.0021049977753042253, "phrase": "balanced_and_full_d-trees"}], "paper_keywords": ["social networks", " structural search", " analysis of algorithms", " computational complexity"], "paper_abstract": "The explosive growth in the variety and size of social networks has focused attention on searching these networks for useful structures. Like the Internet or the telephone network, the ability to efficiently search large social networks will play an important role in the extent of their use by individuals and organizations alike. However, unlike these domains, search on social networks is likely to involve measures that require a set of individuals to collectively satisfy some skill requirement or be tightly related to each other via some underlying social property of interest. The aim of this paper is to highlight-and demonstrate via specific examples-the need for algorithmic results for some fundamental set-based notions on which search in social networks is expected to be prevalent. To this end, we argue that the concepts of an influential set and a central set that highlight, respectively, the specific role and the specific location of a set are likely to be useful in practice. We formulate two specific search problems: the elite group problem (EGP) and the portal problem (PP), that represent these two concepts and provide a variety of algorithmic results. We first demonstrate the relevance of EGP and PP across a variety of social networks reported in the literature. For simple networks (e. g., structured trees and bipartite graphs, cycles, paths), we show that an optimal solution to both EGP and PP is easy to obtain. Next, we show that EGP is polynomially solvable on a general graph, whereas PP is strongly NP-hard. Motivated by practical considerations, we also discuss (i) a size-constrained variant of EGP together with its penalty-based relaxation and (ii) the solution of PP on balanced and full d-trees and general trees.", "paper_title": "Structural Search and Optimization in Social Networks", "paper_id": "WOS:000310834700008"}