{"auto_keywords": [{"score": 0.0448052783265043, "phrase": "previous_methods"}, {"score": 0.032901069821731355, "phrase": "total_cost"}, {"score": 0.00481495049065317, "phrase": "wireless_networks"}, {"score": 0.004394592555435104, "phrase": "wireless_ad_hoc"}, {"score": 0.003863568356785813, "phrase": "small_cost"}, {"score": 0.0038157022294338454, "phrase": "wireless_node"}, {"score": 0.00345344412693677, "phrase": "backbone_size"}, {"score": 0.003368367923339975, "phrase": "large_cost"}, {"score": 0.0032990689963715157, "phrase": "efficient_distributed_method"}, {"score": 0.0032446544415922615, "phrase": "weighted_backbone"}, {"score": 0.0032177835714470027, "phrase": "low_cost"}, {"score": 0.0030739103951333696, "phrase": "constructed_backbone"}, {"score": 0.0030231983220281836, "phrase": "small_constant_factor"}, {"score": 0.002960979624379786, "phrase": "homogeneous_networks"}, {"score": 0.0027818804382539444, "phrase": "network_maximum_node_degree"}, {"score": 0.002657445352746803, "phrase": "small_modification"}, {"score": 0.0024759682272230735, "phrase": "least_cost"}], "paper_keywords": ["connected dominating set", " clustering", " distributed algorithm", " wireless ad hoc networks"], "paper_abstract": "Backbone has been used extensively in various aspects (e.g., routing, route maintenance, broadcast, scheduling) for wireless ad hoc or sensor networks recently. Previous methods are mostly designed to minimize the size of the backbone. However, in many applications, it is desirable to construct a backbone with small cost when each wireless node has a cost of being in the backbone. In this paper, we first show that previous methods specifically designed to minimize the backbone size may produce a backbone with large cost. Then, an efficient distributed method to construct a weighted backbone with low cost is proposed. We prove that the total cost of the constructed backbone is within a small constant factor of the optimum for homogeneous networks when either the nodes' costs are smooth (i.e., the maximum ratio of costs of adjacent nodes is bounded) or the network maximum node degree is bounded. We also show that, with a small modification, the backbone is efficient for unicast: The total cost (or hop) of the least cost (or hop) path connecting any two nodes using backbone is no more than three (or four) times the least cost (or hop) path in the original communication graph. Our theoretical results are corroborated by our simulation studies. Finally, we discuss several possible ad hoc network applications of our proposed backbone formation algorithms.", "paper_title": "Efficient distributed low-cost backbone formation for wireless networks", "paper_id": "WOS:000237786100008"}