{"auto_keywords": [{"score": 0.03934488867229197, "phrase": "rfid"}, {"score": 0.029583010346827004, "phrase": "reference_nodes"}, {"score": 0.00481551957118689, "phrase": "ga"}, {"score": 0.004402973626416765, "phrase": "identification_capability"}, {"score": 0.004060566667226606, "phrase": "future_demand"}, {"score": 0.00402610372759447, "phrase": "rfid_wireless_communication"}, {"score": 0.003825365887208017, "phrase": "rssi"}, {"score": 0.0036813725040313002, "phrase": "common_indoor_localization_algorithms"}, {"score": 0.003634587156159668, "phrase": "range-based_algorithms"}, {"score": 0.0036037265181631324, "phrase": "range-free_algorithms"}, {"score": 0.003468053168607071, "phrase": "indoor_environment"}, {"score": 0.003394891095032025, "phrase": "localization_inaccuracy"}, {"score": 0.0033232673019931206, "phrase": "rf-mapping_technique"}, {"score": 0.002924074850256874, "phrase": "environmental_factors"}, {"score": 0.0028139168128067343, "phrase": "designed_scenarios"}, {"score": 0.002550842302473891, "phrase": "rfid_nodes"}, {"score": 0.002253826965566618, "phrase": "new_environment"}, {"score": 0.0021968238865548812, "phrase": "training_time"}], "paper_keywords": ["IOT", " RF-mapping", " Indoor localization", " Genetic algorithms"], "paper_abstract": "In the current (Internet of Things) trend, the identification capability of RFID is integrated for the identification and applications of all objects, and this trend reveals the future demand for RFID wireless communication and localization. Therefore, this paper investigates the influences of RSSI and the distance to RFID and analyzes the common indoor localization algorithms, including range-based algorithms and range-free algorithms. However, there are too many interference factors in the indoor environment that easily lead to localization inaccuracy. To improve the RF-mapping technique in RFID that requires much time for initiation and lots of calculations, this paper proposes a GA-based (Genetic Algorithms, GA) localization algorithm to estimate the locations of unknown nodes and avoid the influence of environmental factors by pre-establishing the pattern. The designed scenarios and reference nodes in this paper are used to train our proposed algorithm and obtain the patents of the scenarios, which are adopted for RFID nodes to further compare and decrease errors. Therefore, as long as the algorithm is trained in advance with the scenarios and then include the patents in the new environment, the errors and the training time can be greatly reduced. Moreover, our proposed algorithm needs only little information about reference nodes to pre-establish the pattern.", "paper_title": "A GA-based mobile RFID localization scheme for internet of things", "paper_id": "WOS:000300664900004"}