{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "large-scale_multi-agent_systems"}, {"score": 0.004728780808284175, "phrase": "fault-tolerant_multi-agent_platform"}, {"score": 0.00439918275666155, "phrase": "fundamental_issues"}, {"score": 0.004359625030298944, "phrase": "distributed_systems"}, {"score": 0.004262273304740847, "phrase": "partial_failures"}, {"score": 0.004110993414942228, "phrase": "inevitable_issue"}, {"score": 0.003755782496223915, "phrase": "multi-agent_systems"}, {"score": 0.0037052054802048707, "phrase": "starting_idea"}, {"score": 0.0036224139706218916, "phrase": "replication_strategies"}, {"score": 0.0026157259734105, "phrase": "application-level_semantic_information"}, {"score": 0.0025456716198597627, "phrase": "also_system-level_statistical_information"}], "paper_keywords": [""], "paper_abstract": "In order to construct and deploy large-scale multi-agent systems, we must address one of the fundamental issues of distributed systems, the possibility of partial failures. This means that fault-tolerance is an inevitable issue for large-scale multi-agent systems. In this paper, we discuss the issues and propose an approach for supporting fault-tolerance of multi-agent systems. The starting idea is the application of replication strategies to agents, the most critical agents being replicated to prevent failures. As criticality of agents may evolve during the course of computation and problem solving, and as resources are bounded, we need to dynamically and automatically adapt the number of replicas of agents, in order to maximize their reliability and availability. We will describe our approach and related mechanisms for evaluating the criticality of a given agent (based on application-level semantic information, e.g. interdependences, and also system-level statistical information, e.g., communication load) and for deciding what strategy to apply (e.g., active or passive replication) and how to parameterize it (e.g., number of replicas). We also will report on experiments conducted with our prototype architecture (named DimaX).", "paper_title": "Adaptive replication of large-scale multi-agent systems - Towards a fault-tolerant multi-agent platform", "paper_id": "WOS:000238283600015"}