{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "reader-to-reader_communication"}, {"score": 0.04777760737094776, "phrase": "library_books"}, {"score": 0.04682254053814278, "phrase": "library_users"}, {"score": 0.04217073760076532, "phrase": "user_survey"}, {"score": 0.004616034337089482, "phrase": "readers'_annotations"}, {"score": 0.004139223748460922, "phrase": "public_library"}, {"score": 0.0041102032028337366, "phrase": "university_library_collections"}, {"score": 0.003940286428597882, "phrase": "empirical_results"}, {"score": 0.00371148138781691, "phrase": "socio-physical_realm"}, {"score": 0.0035705347414368696, "phrase": "specific_conditions"}, {"score": 0.003495915995048885, "phrase": "communicative_act"}, {"score": 0.0031901183059524804, "phrase": "overall_picture"}, {"score": 0.0031677308747058187, "phrase": "ambiguous_attitudes"}, {"score": 0.002900756392266265, "phrase": "physical_medium"}, {"score": 0.002646880721119838, "phrase": "often_unwanted_communication"}, {"score": 0.0025733173062050018, "phrase": "additional_layer"}, {"score": 0.0025462598594116373, "phrase": "main_message"}, {"score": 0.0025194861926779223, "phrase": "primary_text"}, {"score": 0.002298902547676131, "phrase": "referential_frame"}, {"score": 0.002282755117032059, "phrase": "future_studies"}, {"score": 0.0022036996784968793, "phrase": "factual_and_communicative_aspects"}, {"score": 0.002157583854640276, "phrase": "previous_research"}], "paper_keywords": ["User studies", " Libraries", " Library users", " Affordances", " Marginalia", " User-to-user communication"], "paper_abstract": "Purpose - The purpose of this paper is to investigate readers' annotations in library books and attitudes towards marginalia among library users. In particular, the study discusses how marginalia function as reader-to-reader communication. Design/methodology/approach - The study used data collected from both public library and university library collections, as well as a user survey conducted among library users. The empirical results are discussed in relation to theories of affordances, in order to understand what characterizes the socio-physical realm within which marginalia exist (RQ1), and what specific conditions make marginalia possible as a communicative act between readers (RQ2). Findings - The study suggests that marginalia in library books are mainly by-products of reading/studying processes. The user survey depicts an overall picture of ambiguous attitudes towards marginalia. It is argued that marginalia seen as communication rely heavily on the proximity of the context and the permanence of the physical medium. Three distinctive categories are proposed for classifying marginalia according to their relationship with the text: embedded; evaluative; extratextual. In spite of being an often unwanted communication, marginalia thus still function as an additional layer to the main message of the primary text. Research limitations/implications - The findings are indicative pointing to follow-up studies that may further validate them. The study contributes to a referential frame for future studies on the subject. Originality/value - The study addresses factual and communicative aspects of marginalia less covered in previous research, thus providing a basis for further research also in relation to designing affordances for annotations in e-books.", "paper_title": "Marginalia as message: affordances for reader-to-reader communication", "paper_id": "WOS:000341925900009"}