{"auto_keywords": [{"score": 0.05007799006502165, "phrase": "tree_networks"}, {"score": 0.04970849458989696, "phrase": "multiple_servers"}, {"score": 0.02748194702660211, "phrase": "milp"}, {"score": 0.023429331181286924, "phrase": "optimal_solution"}, {"score": 0.004578165674080246, "phrase": "well-studied_problem"}, {"score": 0.004269329235934791, "phrase": "client_requests"}, {"score": 0.004154908228936342, "phrase": "total_power"}, {"score": 0.00354349559754076, "phrase": "multi-modal_servers"}, {"score": 0.003435092524339692, "phrase": "discrete_speeds"}, {"score": 0.0033821367649595254, "phrase": "dynamic_voltage"}, {"score": 0.003253279945540651, "phrase": "optimization_problem"}, {"score": 0.0031906984691667246, "phrase": "optimal_location"}, {"score": 0.002940697344380201, "phrase": "major_result"}, {"score": 0.0026997176829763746, "phrase": "polynomial_complexity"}, {"score": 0.002668420182908979, "phrase": "important_contribution"}, {"score": 0.0026069066266394118, "phrase": "mixed_integer_linear_program"}, {"score": 0.002356282242320051, "phrase": "midsize_instances"}, {"score": 0.0021049977753042253, "phrase": "satisfactory_results"}], "paper_keywords": ["Replica placement", " Tree network", " Multiple servers", " Power-aware algorithm", " Complexity", " Discrete speeds"], "paper_abstract": "In this paper, we revisit the well-studied problem of replica placement in tree networks. Rather than minimizing the number of servers needed to serve all client requests, we aim at minimizing the total power consumed by these servers. In addition, we use the most general (and powerful) server assignment policy, where the requests of a client can be served by multiple servers located in the (unique) path from this client to the root of the tree. We consider multi-modal servers that can operate at a set of discrete speeds, using the dynamic voltage and frequency scaling (DVFS) technique. The optimization problem is to determine an optimal location of the servers in the tree, as well as the speed at which each server is operated. A major result is the NP-completeness of this problem, to be contrasted with the minimization of the number of servers, which has polynomial complexity. Another important contribution is the formulation of a Mixed Integer Linear Program (MILP) for the problem, together with the design of several polynomial-time heuristics. We assess the efficiency of these heuristics by simulation. For midsize instances (up to 30 nodes in the tree), we evaluate their absolute performance by comparison with the optimal solution (obtained via the MILP). The most efficient heuristics provide satisfactory results, within 20% of the optimal solution. (C) 2014 Elsevier Inc. All rights reserved.", "paper_title": "Power-aware replica placement in tree networks with multiple servers per client", "paper_id": "WOS:000368600800004"}