{"auto_keywords": [{"score": 0.0457701092857861, "phrase": "employee_satisfaction"}, {"score": 0.00481495049065317, "phrase": "purpose_-_organizational_performance"}, {"score": 0.004640311812502743, "phrase": "existing_organizations"}, {"score": 0.00454772672262359, "phrase": "employee-related_antecedents"}, {"score": 0.003935892934907777, "phrase": "model's_underlying_hypotheses"}, {"score": 0.0037423521744765075, "phrase": "structured_questionnaire"}, {"score": 0.003655309503392675, "phrase": "slovenia"}, {"score": 0.0036186222999811802, "phrase": "model's_hypotheses"}, {"score": 0.003558294449586273, "phrase": "structural_equation"}, {"score": 0.003452218803245602, "phrase": "hypothesized_relationships"}, {"score": 0.0033156708990372047, "phrase": "control_variables"}, {"score": 0.003227643104496149, "phrase": "firm_age"}, {"score": 0.0030688220103201836, "phrase": "intrapreneurship_and_intrapreneurship_employee-related_antecedents"}, {"score": 0.00300749708357049, "phrase": "intrapreneurship_research"}, {"score": 0.0028402984404136754, "phrase": "firm_growth"}, {"score": 0.002821247621250663, "phrase": "practical_implications"}, {"score": 0.002755567647101251, "phrase": "detailed_and_systematic_approach"}, {"score": 0.002646501671714952, "phrase": "social_implications_-_activities"}, {"score": 0.0025503112711036994, "phrase": "also_social_implications"}, {"score": 0.002474209809122618, "phrase": "new_wealth"}, {"score": 0.0023053339328456234, "phrase": "employee_satisfaction_elements"}, {"score": 0.002251637552201872, "phrase": "employee_relationships"}, {"score": 0.002206606452557159, "phrase": "organizational_culture"}, {"score": 0.0021917966722180132, "phrase": "employee_loyalty"}, {"score": 0.0021624739899833868, "phrase": "crucial_antecedent"}, {"score": 0.0021049977753042253, "phrase": "employee_satisfaction-driven_intrapreneurship_and_firm_growth"}], "paper_keywords": ["Employees", " Employee behaviour", " Job satisfaction", " Entreprenurialism", " Business development", " Slovenia"], "paper_abstract": "Purpose - Organizational performance, growth and development may depend considerably on entrepreneurship in existing organizations (intrapreneurship) and intrapreneurship employee-related antecedents. The purpose of this study is to focus on employee satisfaction (composed of four dimensions: general satisfaction with work; employee relationships; remuneration, benefits and organizational culture; and employee loyalty), intrapreneurship and firm growth. The model's underlying hypotheses were conceptually developed and empirically tested. Design/methodology/approach - Using data collected via a structured questionnaire sent by e-mail to 149 firms from Slovenia, the model's hypotheses were tested by applying structural equation modeling. Findings - The findings support the hypothesized relationships between employee satisfaction, intrapreneurship and growth. The influence of the control variables was also assessed in the model and firm age was found to be influential. Research limitations/implications - Firm growth can depend strongly on intrapreneurship and intrapreneurship employee-related antecedents. The study contributes to intrapreneurship research by empirically examining the relationship between employee satisfaction and intrapreneurship and testing the impact of employee satisfaction on firm growth. Practical implications - Firms need to take a detailed and systematic approach to employee satisfaction in order to improve intrapreneurship and growth. Social implications - Activities related to the stimulation of employee satisfaction and intrapreneurship can have also social implications, since they can increase creation of the new wealth in the society. Originality/value - This study can be differentiated from past studies, since it considers an ensemble of employee satisfaction elements (general satisfaction with work, employee relationships, remuneration, benefits and organizational culture and employee loyalty) as a crucial antecedent of intrapreneurship and builds a model of employee satisfaction-driven intrapreneurship and firm growth, which has not been examined before.", "paper_title": "Employee satisfaction, intrapreneurship and firm growth: a model", "paper_id": "WOS:000291136900014"}