{"auto_keywords": [{"score": 0.03581216971673249, "phrase": "bam"}, {"score": 0.00481495049065317, "phrase": "discrete-time_bam_neural_networks"}, {"score": 0.004427366754240748, "phrase": "robust_delay-dependent_state_estimation_problem"}, {"score": 0.0036710872046569532, "phrase": "state_estimator"}, {"score": 0.003577414339646767, "phrase": "error_state_system"}, {"score": 0.002985130390111069, "phrase": "matlab_lmi_toolbox"}, {"score": 0.0027622407190589326, "phrase": "upper_and_lower_bounds"}, {"score": 0.0026060359255636444, "phrase": "desired_estimator_unknown_gain_matrix"}, {"score": 0.002380381895973937, "phrase": "numerical_examples"}, {"score": 0.0023497779149212737, "phrase": "simulation_results"}, {"score": 0.0021883400011393564, "phrase": "obtained_results"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Discrete-time", " BAM neural networks", " State estimation", " Linear matrix inequality", " Lyapunov-Krasovskii functional"], "paper_abstract": "This paper is concerned with the robust delay-dependent state estimation problem for a class of discrete-time Bidirectional Associative Memory (BAM) neural networks with time-varying delays. By using the Lyapunov-Krasovskii functional together with linear matrix inequality (LMI) approach, a new set of sufficient conditions are derived for the existence of state estimator such that the error state system is asymptotically stable. More precisely, an LMI-based state estimator and delay-dependent stability criterion for delayed BAM neural networks are developed. The conditions are established in terms of LMIs which can be solved by the MATLAB LMI toolbox. It should be mentioned that all the sufficient conditions are dependent on the upper and lower bounds' of the delays. Also, the desired estimator unknown gain matrix is determined in terms of the solution to these LMIs. Finally, numerical examples with simulation results are given to illustrate the effectiveness and applicability of the obtained results. (C) 2013 Elsevier B.V. All rights reserved.", "paper_title": "Robust state estimation for discrete-time BAM neural networks with time-varying delay", "paper_id": "WOS:000332805700019"}