{"auto_keywords": [{"score": 0.04060552250529573, "phrase": "pensieve"}, {"score": 0.03577190629093131, "phrase": "social_media"}, {"score": 0.00481495049065317, "phrase": "designing_tools"}, {"score": 0.004649474569983707, "phrase": "valuable_activity"}, {"score": 0.0041136473765874815, "phrase": "one's_experiences"}, {"score": 0.0033636292024305406, "phrase": "generic_questions"}, {"score": 0.0031223774204093713, "phrase": "design_activities"}, {"score": 0.002936709606809639, "phrase": "potential_value"}, {"score": 0.0029110999689379497, "phrase": "social_media_content"}, {"score": 0.0028731024405707277, "phrase": "facebook_wall_posts"}, {"score": 0.00270221723573854, "phrase": "spontaneous_reminiscing"}, {"score": 0.002464709648714996, "phrase": "people's_current_practices"}, {"score": 0.0023079225317714815, "phrase": "design_goals"}, {"score": 0.002218668420806254, "phrase": "future_work"}, {"score": 0.0021049977753042253, "phrase": "personal_experience"}], "paper_keywords": [""], "paper_abstract": "Reminiscing is a valuable activity throughout the lifespan, helping people establish and maintain their identities and their relationships. Much of this happens in an every day way, with reminiscing arising naturally out of one's experiences, thoughts, and conversations. In this article we describe work around Pensieve, a tool to support everyday, spontaneous, individual reminiscing through memory triggers-e-mailed reminders that contain snippets from content one has previously created in social media or generic questions that encourage people to reflect on their past. Through a combination of interviews, questionnaires, design activities, and a long-term deployment of Pensieve, we demonstrate the potential value of social media content such as Facebook wall posts and status updates for supporting reminiscence, the utility of systems that support spontaneous reminiscing and writing about the past, the importance of reminders to both reminiscing and lifelogging systems, and insights into people's current practices in reminiscing in social media. Through this work, we generate a number of design goals, issues to consider, and directions for future work around designing systems to support reminiscence and other types of reflection on personal experience.", "paper_title": "Experiences With Designing Tools for Everyday Reminiscing", "paper_id": "WOS:000304010300008"}