{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "image_segmentation"}, {"score": 0.004767826806287385, "phrase": "graph-cut_measures"}, {"score": 0.004652016085325825, "phrase": "graph_cuts"}, {"score": 0.004299910946753963, "phrase": "hard_constraints"}, {"score": 0.003820896867623235, "phrase": "ordered_region"}, {"score": 0.003584025547693836, "phrase": "propagation_order"}, {"score": 0.0033950634506367235, "phrase": "optimum_path"}, {"score": 0.0033452741392850523, "phrase": "image_graph"}, {"score": 0.003016544840824688, "phrase": "lower_propagation_order"}, {"score": 0.0028857130140890787, "phrase": "possible_cut_boundary"}, {"score": 0.0027469703311742647, "phrase": "corresponding_pixel"}, {"score": 0.002551231163230566, "phrase": "minimum-cut_measure"}, {"score": 0.0024405312482831646, "phrase": "graph-cut_segmentation"}, {"score": 0.0023811153883132536, "phrase": "desired_cut"}, {"score": 0.002346160830406661, "phrase": "global_minimum"}, {"score": 0.0022113879114507577, "phrase": "reduced_search_space"}], "paper_keywords": [""], "paper_abstract": "Image segmentation using graph cuts have become very popular in the last years. These methods axe computationally expensive, even with hard constraints (seed pixels). We present a solution that runs in time proportional to the number of pixels. Our method computes an ordered region growing from a set of seeds inside the object, where the propagation order of each pixel is proportional to the cost of an optimum path in the image graph from the seed set to that pixel. Each pixel defines a region which includes it and all pixels with lower propagation order. The boundary of each region is a possible cut boundary, whose cut measure is also computed and assigned to the corresponding pixel on-the-fly. The object is obtained by selecting the pixel with minimum-cut measure and all pixels within its respective cut boundary. Approaches for graph-cut segmentation usually assume that the desired cut is a global minimum. We show that this can be only verified within a reduced search space under certain hard constraints. We present and evaluate our method with three cut measures: normalized cut, mean cut and an energy function.", "paper_title": "A linear-time approach for image segmentation using graph-cut measures", "paper_id": "WOS:000241489100013"}