{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "mobile_phones"}, {"score": 0.004718897469501381, "phrase": "truly_personal_devices"}, {"score": 0.00464811139983244, "phrase": "personal_data"}, {"score": 0.003780286517897356, "phrase": "games_consoles"}, {"score": 0.0037235274565193665, "phrase": "existing_phones"}, {"score": 0.0036676174658755683, "phrase": "single_user"}, {"score": 0.003576286811853861, "phrase": "private_data"}, {"score": 0.0032006150973842846, "phrase": "complete_access"}, {"score": 0.002922705896608178, "phrase": "xshare"}, {"score": 0.0028933521924166287, "phrase": "phone_owners"}, {"score": 0.002682370021834353, "phrase": "restricted_mode"}, {"score": 0.002437012847684331, "phrase": "design_requirements"}, {"score": 0.002282166507956957, "phrase": "file-level_access_control"}, {"score": 0.0021807544600219216, "phrase": "windows_mobile"}, {"score": 0.002137137933768807, "phrase": "comprehensive_evaluation"}, {"score": 0.0021049977753042253, "phrase": "performance_measurements"}], "paper_keywords": ["Mobile phone", " sharing", " privacy", " virtualization"], "paper_abstract": "Mobile phones are truly personal devices loaded with personal data such as photos, contacts, and call history. Yet it is often necessary or desirable to share our phones with others. This is especially true as mobile phones are integrating features conventionally provided by other dedicated devices, from MP3 players to games consoles. Yet existing phones assume a single user and provide little protection for private data and applications when a phone is shared. That is, when we lend our phones to others, we give away complete access. In this work, we present xShare, a protection solution to address this problem. xShare allows phone owners to rapidly specify what they want to share and place the phone into a restricted mode where only the data and applications intended for sharing can be accessed. We first present two formative user studies and derive the design requirements of xShare. We then offer the design of xShare based on file-level access control. We describe the implementation of xShare on Windows Mobile and report a comprehensive evaluation, including performance measurements, usability, and a one-month field trial.", "paper_title": "Design, Realization, and Evaluation of xShare for Impromptu Sharing of Mobile Phones", "paper_id": "WOS:000282982200003"}