{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "genomic_islands"}, {"score": 0.049707293588616405, "phrase": "bacterial_genomes"}, {"score": 0.039712716961339774, "phrase": "binary_classification"}, {"score": 0.004471270242168067, "phrase": "bacterial_genome_segments"}, {"score": 0.004217286731331736, "phrase": "important_task"}, {"score": 0.004040211152784802, "phrase": "bacterial_evolution"}, {"score": 0.0037079710789139305, "phrase": "n-gram_frequency_distribution"}, {"score": 0.0034296217420566304, "phrase": "complete_genome"}, {"score": 0.0034029588672379926, "phrase": "backbone_sequence"}, {"score": 0.0032727116186194584, "phrase": "maximal_order_markov_model"}, {"score": 0.00300339527261653, "phrase": "zipf-like_analysis"}, {"score": 0.002619748321217153, "phrase": "-specific_regions"}, {"score": 0.002490053106007765, "phrase": "different_n-gram_characteristics"}, {"score": 0.002366763442497185, "phrase": "c_content"}, {"score": 0.002188874450946842, "phrase": "adequate_drugs"}, {"score": 0.002171836484200008, "phrase": "virulence_genes"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ireland_ltd."}], "paper_keywords": ["n-Grams", " Statistical analysis", " Zipf-like analysis", " Genomic islands", " Horizontal gene transfer", " Backbone sequence", " Escherichia coli O157:H7 EDL933"], "paper_abstract": "The paper presents a novel, n-gram-based method for analysis of bacterial genome segments known as genomic islands (GIs). Identification of GIs in bacterial genomes is an important task since many of them represent inserts that may contribute to bacterial evolution and pathogenesis. In order to characterize and distinguish GIs from rest of the genome, binary classification of islands based on n-gram frequency distribution have been performed. It consists of testing the agreement of islands n-gram frequency distributions with the complete genome and backbone sequence. in addition, a statistic based on the maximal order Markov model is used to identify significantly overrepresented and underrepresented n-grams in islands. The results may be used as a basis for Zipf-like analysis suggesting that some of the n-grams are overrepresented in a subset of islands and underrepresented in the backbone, or vice versa, thus complementing the binary classification. The method is applied to strain-specific regions in the Escherichia coli O157:H7 EDL933 genome (O-islands), resulting in two groups of O-islands with different n-gram characteristics. It refines a characterization based on other compositional features such as G + C content and codon usage, and may help in identification of GIs, and also in research and development of adequate drugs targeting virulence genes in them. (C) 2008 Elsevier Ireland Ltd. All rights reserved.", "paper_title": "n-Gram characterization of genomic islands in bacterial genomes", "paper_id": "WOS:000263938100003"}