{"auto_keywords": [{"score": 0.04399383761203485, "phrase": "case_study"}, {"score": 0.00481495049065317, "phrase": "spanish_case_study"}, {"score": 0.004768649568826951, "phrase": "purpose_-_this_paper"}, {"score": 0.00456571874088313, "phrase": "current_status"}, {"score": 0.004350308086118336, "phrase": "basic_principles"}, {"score": 0.00393032656248792, "phrase": "short_review"}, {"score": 0.0038737214010638745, "phrase": "e-government_literature"}, {"score": 0.0033996247552287645, "phrase": "spain"}, {"score": 0.003146212656743413, "phrase": "careful_reengineering"}, {"score": 0.0027876387169652717, "phrase": "tax_administration_body"}, {"score": 0.002469830206270585, "phrase": "vast_majority"}, {"score": 0.0023644936731468252, "phrase": "large_amount"}, {"score": 0.002285674008055581, "phrase": "key_area"}, {"score": 0.0021461840368981475, "phrase": "spanish_public_organisation"}, {"score": 0.0021049977753042253, "phrase": "tax_administration"}], "paper_keywords": ["government", " Spain", " taxation"], "paper_abstract": "Purpose - This paper has as its aim to analyse the evolution and current status of e-government, trying to deduce a series of basic principles for its success. Design/methodology/approach - A case study has served to achieve that aim, but prior to its presentation, a short review of the e-government literature along with some facts and figures have made it possible to assess the situation of e-government in various countries around the world, and more precisely in Spain. Findings - E-government lays emphasis on technology; however, the internal processes through which public administrations (PP.AA) offer their services to citizens need careful reengineering. Research limitations/implications - Although a case study like this one, in which the analysis of e-government is restricted to the functioning of a tax administration body, may have limitations when it comes to generalising the conclusions drawn, the principles inferred from it can be easily extrapolated to the vast majority of PP.AA. Originality/value - Since, tax administration requires using a large amount of data, it is a key area in the application and study of e-government. That is why a Spanish public Organisation in charge of tax administration has been examined in this paper.", "paper_title": "E-government success: some principles from a Spanish case study", "paper_id": "WOS:000248068600014"}