{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "denoising_filters"}, {"score": 0.009181481476660081, "phrase": "contrast_enhancement_capability"}, {"score": 0.008919122961778301, "phrase": "wide_applications"}, {"score": 0.00768680140328987, "phrase": "visual_inspection"}, {"score": 0.005563196045610172, "phrase": "textual_and_structural_information"}, {"score": 0.0040135756033094225, "phrase": "related_fields"}, {"score": 0.003898307690037192, "phrase": "traditional_criteria"}, {"score": 0.0037863954178823066, "phrase": "mse"}, {"score": 0.003745179888113379, "phrase": "signal-to-noise_ratio"}, {"score": 0.003533083861130305, "phrase": "effective_metrics"}, {"score": 0.0030426463790590445, "phrase": "image_quality_assessment"}, {"score": 0.0028183634079717136, "phrase": "new_criteria"}, {"score": 0.002717433692385074, "phrase": "novel_objective"}, {"score": 0.0026976845075643314, "phrase": "effective_assessment_criterion"}, {"score": 0.002678078466226442, "phrase": "homogeneity_mean_difference"}, {"score": 0.002339953069296797, "phrase": "proposed_metric"}, {"score": 0.002314481096847367, "phrase": "existing_ones"}, {"score": 0.0022643648781090738, "phrase": "hmd"}, {"score": 0.0022397131088479514, "phrase": "effective_and_useful_metric"}, {"score": 0.0021515951441422082, "phrase": "image_processing_and_computer_vision"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Objective criterion", " Denoising performance", " Homogeneity mean difference (HMD)", " Contrast enhancement", " Image quality assessment (QA)"], "paper_abstract": "Denoising filters are useful for reducing noise; however, they often blur and smear the edges and boundaries, which are necessary for segmenting or locating the objects. In order to overcome above problem, many filters with contrast enhancement capability have been developed, and they have wide applications in related fields. Recently, researchers found that the traditional criteria, such as mean squared error (MSE), signal-to-noise ratio (SNR), are not suitable for evaluating such filters. Due to lack of effective metrics for such tasks, visual inspection by human and some newly proposed image quality assessment (QA) criteria, such as structural similarity (SSIM) index are utilized. However, visual inspection depends on the subjectivity of observers heavily. This paper has proved that evaluating denoising filters is different from image quality assessment, i.e., existing image quality assessment criteria cannot effectively evaluate the performance of denoising filters, especially, of the filters having contrast enhancement capability; and new criteria should be established. Further, it proposes a novel objective and effective assessment criterion, homogeneity mean difference (HMD), to evaluate the performance of the filters since it can describe the textual and structural information and/or the changes in textual and structural information well. We have employed 503 images from three databases to demonstrate the superiority of the proposed metric over the existing ones, and to prove that HMD is an effective and useful metric for assessing denoising filters with/without contrast enhancement, which may find wide applications in image processing and computer vision. (C) 2012 Elsevier Ltd. All rights reserved.", "paper_title": "An effective and objective criterion for evaluating the performance of denoising filters", "paper_id": "WOS:000302451000024"}