{"auto_keywords": [{"score": 0.04662399652943295, "phrase": "smart_phones"}, {"score": 0.007577071559731372, "phrase": "web_browser"}, {"score": 0.005534177141248205, "phrase": "smart_phone_browsers"}, {"score": 0.0050556422370512475, "phrase": "frequent_tasks"}, {"score": 0.00481495049065317, "phrase": "mixed_method_study"}, {"score": 0.004777214679969785, "phrase": "usability_evaluation_of_smartphone_web_browsers"}, {"score": 0.004684157900507474, "phrase": "communication_technology"}, {"score": 0.0045748683993128425, "phrase": "mobile_phone"}, {"score": 0.004539005582217305, "phrase": "mobile_phones"}, {"score": 0.0042452552248398445, "phrase": "almost_all_information"}, {"score": 0.004195418010131832, "phrase": "communication_tasks"}, {"score": 0.003787191644093659, "phrase": "family_dinners"}, {"score": 0.0037133478610481994, "phrase": "key_components"}, {"score": 0.003472845095323694, "phrase": "'web_browser"}, {"score": 0.0033518704336033874, "phrase": "information_access"}, {"score": 0.003286486670483032, "phrase": "smart_device"}, {"score": 0.0031719874436868796, "phrase": "tablet"}, {"score": 0.0030614565460256897, "phrase": "user_experience"}, {"score": 0.002897109710213723, "phrase": "increased_use"}, {"score": 0.0028743610212291727, "phrase": "smart_phone_web_browsers"}, {"score": 0.002163930783583212, "phrase": "browser's_usability"}], "paper_keywords": ["Usability evaluation", " Android", " Web browser"], "paper_abstract": "The advancement in communication technology has reshaped the idea of mobile phone. Mobile phones are transformed into smart phones and their capabilities are enhanced far beyond the level of a phone. Almost all information seeking and communication tasks can be efficiently done by using smart phones. People remain connected and access information to perform their tasks even while travelling, meeting friends and having family dinners. One of the key components that make it possible; which is installed on billions of devices around the world is 'web browser'. Web browser provides a gateway to the information access. Now, every smart device whether it is a TV, Phone or Tablet, is equipped with a web browser. The user experience or usability is one of the important quality characteristic in smart phones. The increased use of smart phone web browsers and distinguished characteristics of smart phones (screen size, input method and display resolution etc.) compels to investigate their usability. In this research a model is developed to evaluate the usability of smart phone browsers. The research presented here will help to understand that how users interact with the smart phone browsers. A model is proposed and frequent tasks are identified to develop a scenario (consist of frequent tasks) to assess browser's usability. The model is applied on four android based web browsers. The results of this study will be helpful for the practitioners and industry to evaluate and improve the usability of browsers.", "paper_title": "A Mixed Method Study on Usability Evaluation of Smartphone Web Browsers", "paper_id": "WOS:000342605500009"}