{"auto_keywords": [{"score": 0.02811223834300324, "phrase": "spatial_filter"}, {"score": 0.00481495049065317, "phrase": "spatial_filters"}, {"score": 0.004774324145784758, "phrase": "brain-computer_interfaces"}, {"score": 0.00467424463996457, "phrase": "evolutionary_multi-objective_approach"}, {"score": 0.004615202066192795, "phrase": "high_accuracy_classification"}, {"score": 0.004576253356889219, "phrase": "brain_computer_interfaces"}, {"score": 0.004204320052179726, "phrase": "generally_a_laborious_and_time_consuming_process"}, {"score": 0.003829877278269543, "phrase": "required_accuracy"}, {"score": 0.0037178503842258087, "phrase": "multi-objective_formulation"}, {"score": 0.0033437537557378157, "phrase": "classification_accuracy"}, {"score": 0.0031912706211861324, "phrase": "previous_research"}, {"score": 0.0030586736004285216, "phrase": "proper_tuning"}, {"score": 0.0028457440091791252, "phrase": "non-dominated_sorting_genetic_algorithm_ii"}, {"score": 0.0027274643070540733, "phrase": "classification_error"}, {"score": 0.002360796860462937, "phrase": "simple_threshold"}, {"score": 0.0023111922860677672, "phrase": "long_binary_mask"}, {"score": 0.0022626276288355432, "phrase": "empirical_results"}, {"score": 0.002205692205167157, "phrase": "simultaneous_optimization"}, {"score": 0.0021593396036472777, "phrase": "selected_electrodes"}, {"score": 0.0021049977753042253, "phrase": "low_classification_error"}], "paper_keywords": ["Brain-Computer Interfaces", " Multi-objective optimization", " Electrode selection", " Spatial filters"], "paper_abstract": "Obtaining high accuracy classification from Brain Computer Interfaces require to attach many electrodes on the scalp of subjects. On the other hand, their placement on the scalp involves generally a laborious and time consuming process. Therefore, it is important for the practitioner to estimate how many electrodes, and which ones, are needed to obtain the required accuracy. With this purpose, a multi-objective formulation is proposed in order to obtain a set of solutions (Pareto front) that represent all the optimal tradeoffs between the number of channels and the classification accuracy, from where the practitioner can choose. Additionally, previous research has shown that classification accuracy highly depends on the proper tuning of the filter used to preprocess the electroencephalogram. Therefore, in this work, the Non-dominated Sorting Genetic Algorithm II is used for optimizing both the number of electrodes and the classification error, through the optimization of a spatial filter encoded in the solution. The fact that the filter is part of the solution allows to determine which electrodes are to be selected by using a simple threshold, instead of a long binary mask as in other approaches. Empirical results show that indeed, the simultaneous optimization of the spatial filter and selected electrodes is crucial to obtain a low classification error, compared to other approaches that reduce the number of electrodes but do not modify the filter. (C) 2015 Elsevier Ltd. All rights reserved.", "paper_title": "Optimizing the number of electrodes and spatial filters for Brain-Computer Interfaces by means of an evolutionary multi-objective approach", "paper_id": "WOS:000355063700019"}