{"auto_keywords": [{"score": 0.05007492366178475, "phrase": "recommender_systems"}, {"score": 0.04021703229343695, "phrase": "ranked_lists"}, {"score": 0.02951995800637943, "phrase": "existing_algorithms"}, {"score": 0.028916437980353413, "phrase": "pareto"}, {"score": 0.004651501132938394, "phrase": "social_media_channels"}, {"score": 0.004614573278897633, "phrase": "content_providers"}, {"score": 0.0045175194725454604, "phrase": "enabling_mechanism"}, {"score": 0.004457895500110735, "phrase": "information_overload_problem"}, {"score": 0.004399054990463841, "phrase": "consumption_experience"}, {"score": 0.004364122496690351, "phrase": "typical_task"}, {"score": 0.004283683675835369, "phrase": "ranked_list"}, {"score": 0.00404036314645143, "phrase": "interestingness_measures"}, {"score": 0.003923915284959959, "phrase": "suggested_items"}, {"score": 0.003760478950217445, "phrase": "suggesting_items"}, {"score": 0.003584706490979843, "phrase": "conflicting-objective_problem"}, {"score": 0.003371972121469904, "phrase": "new_approaches"}, {"score": 0.003354079159339476, "phrase": "multiobjective_recommender_systems"}, {"score": 0.003300966061142746, "phrase": "pareto_efficiency"}, {"score": 0.002999439235243178, "phrase": "existing_multiobjective_recommendation_algorithms"}, {"score": 0.0028820579879223233, "phrase": "pareto-efficiency_concept"}, {"score": 0.00276189608309668, "phrase": "single_one"}, {"score": 0.002482901744545283, "phrase": "implicit_feedback"}, {"score": 0.0024048209203996595, "phrase": "explicit_feedback"}, {"score": 0.002379354938171881, "phrase": "movielens"}, {"score": 0.0023354007130196885, "phrase": "proposed_pareto-efficient_approaches"}, {"score": 0.0021791613158909694, "phrase": "high_levels"}, {"score": 0.0021049977753042253, "phrase": "multiobjective_baselines"}], "paper_keywords": ["Algorithms", " Multiobjective recommender systems", " Pareto efficiency"], "paper_abstract": "Recommender systems are quickly becoming ubiquitous in applications such as e-commerce, social media channels, and content providers, among others, acting as an enabling mechanism designed to overcome the information overload problem by improving browsing and consumption experience. A typical task in many recommender systems is to output a ranked list of items, so that items placed higher in the rank are more likely to be interesting to the users. Interestingness measures include how accurate, novel, and diverse are the suggested items, and the objective is usually to produce ranked lists optimizing one of these measures. Suggesting items that are simultaneously accurate, novel, and diverse is much more challenging, since this may lead to a conflicting-objective problem, in which the attempt to improve a measure further may result in worsening other measures. In this article, we propose new approaches for multiobjective recommender systems based on the concept of Pareto efficiency-a state achieved when the system is devised in the most efficient manner in the sense that there is no way to improve one of the objectives without making any other objective worse off. Given that existing multiobjective recommendation algorithms differ in their level of accuracy, diversity, and novelty, we exploit the Pareto-efficiency concept in two distinct manners: (i) the aggregation of ranked lists produced by existing algorithms into a single one, which we call Pareto-efficient ranking, and (ii) the weighted combination of existing algorithms resulting in a hybrid one, which we call Pareto-efficient hybridization. Our evaluation involves two real application scenarios: music recommendation with implicit feedback (i.e., Last. fm) and movie recommendation with explicit feedback (i.e., MovieLens). We show that the proposed Pareto-efficient approaches are effective in suggesting items that are likely to be simultaneously accurate, diverse, and novel. We discuss scenarios where the system achieves high levels of diversity and novelty without compromising its accuracy. Further, comparison against multiobjective baselines reveals improvements in terms of accuracy (from 10.4% to 10.9%), novelty (from 5.7% to 7.5%), and diversity (from 1.6% to 4.2%).", "paper_title": "Multiobjective Pareto-Efficient Approaches for Recommender Systems", "paper_id": "WOS:000351446900002"}