{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "ongoing_research_project"}, {"score": 0.004456044928556639, "phrase": "interactive_object-oriented_environment"}, {"score": 0.004275650416511604, "phrase": "object-oriented_programming"}, {"score": 0.004123781267600542, "phrase": "virtual_machine"}, {"score": 0.0036427316134070007, "phrase": "prototype-based_object_orientation"}, {"score": 0.003513264130359459, "phrase": "object_orientation"}, {"score": 0.0034236045013591437, "phrase": "class-based_model"}, {"score": 0.0032848684681050745, "phrase": "object_persistence"}, {"score": 0.0030554300179552415, "phrase": "new_visual_programming_environment"}, {"score": 0.0030083825666563898, "phrase": "invaluable_help"}, {"score": 0.002643386043540555, "phrase": "object-oriented_teaching"}, {"score": 0.0026026666736474404, "phrase": "whole_system"}, {"score": 0.0024842242921857705, "phrase": "different_courses"}, {"score": 0.0022283519468680475, "phrase": "high_degree"}, {"score": 0.0021714122348552747, "phrase": "object-oriented_programming_paradigm"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["visual programming", " object-oriented paradigm"], "paper_abstract": "In this article, an ongoing research project held in the Computer Science department of the University of Vigo is described. Its main objective is to develop an interactive object-oriented environment, serving as a vehicle for learning object-oriented programming. It currently consists of a virtual machine, an assembler, compilers for two high-level programming languages, and an educational visual programming environment. Its main characteristics are (a) the support of prototype-based object orientation, which is a model of object orientation that actually wraps the class-based model; (b) the support for object persistence, which simplifies all input/output issues to the minimum, and (c) the availability of a new visual programming environment is an invaluable help. We the authors think that the combination of all of these possibilities, will lead to an interesting, useful tool that would be recommended for object-oriented teaching. The whole system has been successfully employed in a number of different courses, allowing students to concentrate on objects and their relationships from the very beginning, and thus helping them to achieve a high degree of knowledge about the object-oriented programming paradigm. (C) 2007 Elsevier Ltd. All rights reserved.", "paper_title": "Visual Zero: A persistent and interactive object-oriented programming environment", "paper_id": "WOS:000256070600004"}