{"auto_keywords": [{"score": 0.04850161465082996, "phrase": "schema_mappings"}, {"score": 0.009442733780347814, "phrase": "semantic_paths"}, {"score": 0.0046046429665581555, "phrase": "agents'_actions"}, {"score": 0.004553510708976456, "phrase": "xml_data_integration_task"}, {"score": 0.004354572391793908, "phrase": "highly-dynamic_environment"}, {"score": 0.004211069233133584, "phrase": "peer-to-peer_cooperating_partners"}, {"score": 0.0030451958332949735, "phrase": "nal_result"}, {"score": 0.002475898613632249, "phrase": "xquery_expressions"}, {"score": 0.0023675132064088803, "phrase": "logical_formulas"}, {"score": 0.0022893422054387214, "phrase": "declarative_specification"}, {"score": 0.002263861731320045, "phrase": "semantic-driven_communication"}, {"score": 0.002128694000627911, "phrase": "peer-oriented_extension"}, {"score": 0.0021050184648978994, "phrase": "prolog"}], "paper_keywords": ["agent system", " data integration", " Prolog-like computations"], "paper_abstract": "We propose specification of schema mappings and agents' actions in XML data integration task. We discuss the problem in a highly-dynamic environment consisting of a community of peer-to-peer cooperating partners (agents). Peers decide how to describe their local data, when to join and when to leave the system, how to communicate and share their information with partners. An agent responds to the query by asking its partners (friends), which are able to partly answer the query. All the answers are merged and. nal result is constructed. A peer propagates a query along semantic paths existing in the system. Semantic paths are determined by schema mappings defined between partners. We propose a method for specifying schema mappings and to translate them to XQuery expressions. Mappings are represented by means of logical formulas. We also propose a declarative specification of semantic-driven communication in the system. The specification is made in a peer-oriented extension of Prolog.", "paper_title": "Schema mappings and agents' actions in P2P data integration system", "paper_id": "WOS:000257026400004"}