{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "second-order_multi-agent_systems"}, {"score": 0.04166987106365019, "phrase": "containment_control"}, {"score": 0.011293724804312276, "phrase": "communication_time-delays"}, {"score": 0.006164053104552182, "phrase": "communication_time-delay"}, {"score": 0.00441799414082878, "phrase": "control_protocols"}, {"score": 0.004315249628884236, "phrase": "distributed_containment_control"}, {"score": 0.004298592133126788, "phrase": "communication_topology_structure"}, {"score": 0.004103817210338686, "phrase": "basic_theoretical_analysis"}, {"score": 0.0037798652680135106, "phrase": "sufficient_condition"}, {"score": 0.003545625043276134, "phrase": "frequency-domain_analysis_method"}, {"score": 0.003177235604998673, "phrase": "simulation_results"}, {"score": 0.0030491497463386924, "phrase": "theoretical_results"}, {"score": 0.002275299774554847, "phrase": "sufficient_conditions"}, {"score": 0.0021049977753042253, "phrase": "interesting_researchers"}], "paper_keywords": ["Time-delay", " Containment control", " Directed topology", " Second-order multi-agent systems"], "paper_abstract": "Purpose - The purpose of this paper is to discuss the impacts of the communication time-delays to the distributed containment control of the second-order multi-agent systems with directed topology. Design/methodology/approach - A basic theoretical analysis is first carried out for the containment control of the second-order multi-agent systems under directed topology without communication time-delay and a sufficient condition is proposed for the achievement of containment control. Based on the above result and frequency-domain analysis method, a sufficient condition is also derived for the achievement of containment control of the second-order multi-agent systems under directed topology with communication time-delays. Finally, simulation results are presented to support the effectiveness of the theoretical results. Findings - For the achievement of containment control of the second-order multi-agent systems under directed topology with communication time-delay, the control gain in the control protocols is completely dependent on the communication topology structure and the maximum of time-delay in the control protocols is dependent on the given control gain and communication topology structure. Originality/value - The paper investigates the containment control of the second-order multi-agent systems under directed topology with communication time-delays and presents a sufficient conditions for the achievement of containment control. The results and approach proposed in the paper may benefit interesting researchers.", "paper_title": "Containment control of second-order multi-agent systems with directed topology and time-delays", "paper_id": "WOS:000343399700011"}