{"auto_keywords": [{"score": 0.04920822493417556, "phrase": "wiki_pages"}, {"score": 0.0155493741655448, "phrase": "collaborative_value"}, {"score": 0.01364175556245015, "phrase": "corporate_wikis"}, {"score": 0.00481495049065317, "phrase": "tag-based_recommendation"}, {"score": 0.004692766317526887, "phrase": "knowledge_sharing"}, {"score": 0.004641351004344458, "phrase": "exploratory_study"}, {"score": 0.004473982381245469, "phrase": "social_and_community_intelligence"}, {"score": 0.004296809240805996, "phrase": "wiki_technology"}, {"score": 0.004111488691642256, "phrase": "hypertext_systems"}, {"score": 0.004066416005586085, "phrase": "team-oriented_collaborative_work"}, {"score": 0.0039341294012600085, "phrase": "internal_knowledge"}, {"score": 0.0038483286199081, "phrase": "research_study"}, {"score": 0.003601951458683923, "phrase": "research_challenge"}, {"score": 0.002733646947011804, "phrase": "overall_organisation's_problem"}, {"score": 0.00238565827614317, "phrase": "significant_quality_support"}, {"score": 0.0022825763382627443, "phrase": "collaborative_spaces"}, {"score": 0.002200077887697072, "phrase": "software_companies"}, {"score": 0.0021205548157547495, "phrase": "recommendation_model"}], "paper_keywords": ["Wiki", " Collaborative work", " Tag-based recommendation", " Social and community intelligence"], "paper_abstract": "This exploratory study investigates how organisations can support knowledge transferring by exploiting social and community intelligence. In particular, this work analysis the potential of wiki technology as a tool for knowledge sharing in corporate wikis. Wikis are hypertext systems that support team-oriented collaborative work. Corporate wikis are especially turned to enhance internal knowledge sharing in enterprises. This research study sought to empirically determine the value of wiki pages that emerged from such collaboration in corporate wikis. As a research challenge, we evaluate how tag-based recommendations benefit from this value in a problem solving context. The recommendations are evaluated on their capability of transferring knowledge and help users to solve tasks. In this sense, we create a problem solving scenario where users need to use the recommendations to get their tasks solved. Meanwhile, we attempt to support users individually to find their own solutions, our recommendations are intended to enhance the overall organisation's problem solving capacity. Results from an experiment with 63 participants show that more successful recommendations can be obtained if the collaborative value of pages is considered. In essence, this work demonstrates how the value of wiki pages can produce significant quality support in assisting individuals to get their problems solved and sharing knowledge in collaborative spaces. In addition to this evaluation, professionals from software companies were interviewed about the usefulness and adoption of the recommendation model in their corporate wikis.", "paper_title": "Improving tag-based recommendation with the collaborative value of wiki pages for knowledge sharing", "paper_id": "WOS:000351238800003"}