{"auto_keywords": [{"score": 0.03799635259867219, "phrase": "video_popularity"}, {"score": 0.007375718466248885, "phrase": "scheme_transition"}, {"score": 0.00481495049065317, "phrase": "dynamic_scheme_transition_adaptable"}, {"score": 0.004746263721902201, "phrase": "variable_video_popularity"}, {"score": 0.003909065355459264, "phrase": "dynamic_scheme_transition"}, {"score": 0.0031959843979467704, "phrase": "service_scheme"}, {"score": 0.003105305189036267, "phrase": "request_rate"}, {"score": 0.002952745241052452, "phrase": "heuristically_broadcasting_video_segments"}, {"score": 0.0027675275077806744, "phrase": "periodic_broadcast"}, {"score": 0.0025202582748972122, "phrase": "client_request_rates"}, {"score": 0.0024311346712789553, "phrase": "service_channels"}, {"score": 0.0021049977753042253, "phrase": "streaming_services"}], "paper_keywords": ["Periodic broadcast", " video-on-demand", " video popularity", " video streaming"], "paper_abstract": "To provide on-demand video streaming services through the network, video objects with both high and low client request rates must be served efficiently. In this paper, we propose a dynamic scheme transition to provide on-demand streaming services efficiently regardless of video popularity. This approach can maintain quality-of-service (QoS) by transitioning the service scheme according to the request rate. The server provides services by heuristically broadcasting video segments when the video popularity is low and by a Periodic Broadcast when the video popularity is high. The server identifies the variations in client request rates from the number of service channels and determines transitions to more efficient service schemes autonomously. We evaluated this scheme transition for various parameters and traces from a company providing streaming services. The results show that the performance of scheme transition is very efficient.", "paper_title": "Dynamic Scheme Transition Adaptable to Variable Video Popularity in a Digital Broadcast Network", "paper_id": "WOS:000264632300014"}