{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "ergodicity_and_perturbation_bounds"}, {"score": 0.0047051051659828275, "phrase": "death_processes"}, {"score": 0.004661868629458321, "phrase": "additional_transitions"}, {"score": 0.004555499634179394, "phrase": "origin._service_life"}, {"score": 0.003947884118204803, "phrase": "possible_maintenance"}, {"score": 0.003911578552479064, "phrase": "likely_new_initial_conditions"}, {"score": 0.003734979290204709, "phrase": "birth_and_death_processes"}, {"score": 0.0035498822293046884, "phrase": "performance_characteristics"}, {"score": 0.0033428820402140683, "phrase": "time-dependent_analysis"}, {"score": 0.002702415623060517, "phrase": "ordinary_transitions"}, {"score": 0.0026775328564629577, "phrase": "neighbouring_states"}, {"score": 0.0025447065763362984, "phrase": "possible_transition_intensities"}, {"score": 0.0024865237976623286, "phrase": "non-random_functions"}, {"score": 0.0023091093387071593, "phrase": "process_state"}, {"score": 0.002225196379204285, "phrase": "first_ergodicity"}, {"score": 0.0021049977753042253, "phrase": "extensive_numerical_results"}], "paper_keywords": ["inhomogeneous birth and death processes", " ergodicity bounds", " perturbation bounds"], "paper_abstract": "Service life of many real-life systems cannot be considered infinite, and thus the systems will be eventually stopped or will break down. Some of them may be re-launched after possible maintenance under likely new initial conditions. In such systems, which are often modelled by birth and death processes, the assumption of stationarity may be too strong and performance characteristics obtained under this assumption may not make much sense. In such circumstances, time-dependent analysis is more meaningful. In this paper, transient analysis of one class of Markov processes defined on non-negative integers, specifically, inhomogeneous birth and death processes allowing special transitions from and to the origin, is carried out. Whenever the process is at the origin, transition can occur to any state, not necessarily a neighbouring one. Being in any other state, besides ordinary transitions to neighbouring states, a transition to the origin can occur. All possible transition intensities are assumed to be non-random functions of time and may depend (except for transition to the origin) on the process state. To the best of our knowledge, first ergodicity and perturbation bounds for this class of processes are obtained. Extensive numerical results are also provided.", "paper_title": "ERGODICITY AND PERTURBATION BOUNDS FOR INHOMOGENEOUS BIRTH AND DEATH PROCESSES WITH ADDITIONAL TRANSITIONS FROM AND TO THE ORIGIN", "paper_id": "WOS:000367468200006"}