{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "computer_networks"}, {"score": 0.005916272475278275, "phrase": "uncertain_variables"}, {"score": 0.005782921179206432, "phrase": "possible_values"}, {"score": 0.0054252265243394954, "phrase": "admission_control_problem"}, {"score": 0.004771196027464407, "phrase": "uncertain_parameters"}, {"score": 0.004727837281331949, "phrase": "purpose_-_the_purpose"}, {"score": 0.004496280772084575, "phrase": "admission_control"}, {"score": 0.0037626342268042997, "phrase": "service_requirements"}, {"score": 0.003545625043276134, "phrase": "unknown_parameters"}, {"score": 0.003310684108128973, "phrase": "unknown_values"}, {"score": 0.0032064196784562017, "phrase": "network_utility_maximization_concept"}, {"score": 0.0028995712226514746, "phrase": "uncertain_network_parameters"}, {"score": 0.0028210902750714075, "phrase": "certainty_distribution"}, {"score": 0.0025627194819793347, "phrase": "certainty_distributions"}, {"score": 0.0024481198073210567, "phrase": "expert's_knowledge"}, {"score": 0.0024258208033731154, "phrase": "practical_implications"}, {"score": 0.0023927516438886445, "phrase": "admission_control_algorithms"}, {"score": 0.0021049977753042253, "phrase": "uncertain_variable"}], "paper_keywords": ["Cybernetics", " Control systems", " Computer networks", " Uncertainty management"], "paper_abstract": "Purpose - The purpose of this paper is to deal with a problem of admission control in computer networks when some of their parameters are uncertain. The case is considered when the most common probabilistic description of the uncertainty cannot be used and another approach should be applied. Design/methodology/approach - The uncertain versions of admission control problem with quality of service requirements are considered. The uncertain variables are used to describe possible values of the unknown parameters in computer networks. Findings - Given are formulations for the admission control problem in computer networks with unknown values of the capacities based on the network utility maximization concept. Solution algorithms for all these problems are proposed. Research limitations/implications - It is assumed that an expert can describe possible values of uncertain network parameters in the form of a certainty distribution. Then the formalism of uncertain variables is applied and the knowledge of an expert is modelled with the use of certainty distributions. Decisions strongly depends on the quality of an expert's knowledge. Practical implications - Obtained admission control algorithms can be useful for planning and designing of computer networks. Originality/value - A new approach to the admission control problem in computer networks in the presence of uncertainty, in the case when the uncertain variable can be applied, is proposed and discussed.", "paper_title": "Admission control in computer networks with uncertain parameters", "paper_id": "WOS:000270378700017"}