{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "antisense_transcription"}, {"score": 0.027430887350323643, "phrase": "nucleosome_occupancy"}, {"score": 0.015074435841361757, "phrase": "sense_promoters"}, {"score": 0.004752689967648084, "phrase": "sense_promoter_regions"}, {"score": 0.004486640769041646, "phrase": "genome-wide_pervasive_transcription"}, {"score": 0.004240116703465252, "phrase": "extensive_array"}, {"score": 0.004035500442527029, "phrase": "previously_unknown_non-coding_rnas"}, {"score": 0.0034057975804778293, "phrase": "systematic_analysis"}, {"score": 0.0033579708256295847, "phrase": "sense-antisense_transcription"}, {"score": 0.0029357204796552653, "phrase": "rna_polymerase_ii_inactivation_data"}, {"score": 0.0028137115734915624, "phrase": "antisense_transcription_inactivation_data"}, {"score": 0.0026967596578196325, "phrase": "antisense_transcripts"}, {"score": 0.00232431758517087, "phrase": "previously_unappreciated_roles"}, {"score": 0.0021049977753042253, "phrase": "understanding_regulatory_functions"}], "paper_keywords": [""], "paper_abstract": "Motivation: Genome-wide pervasive transcription is widespread in eukaryotes, revealing an extensive array of antisense transcription that involves hundreds of previously unknown non-coding RNAs. Individual cases have shown that antisense transcription influences sense transcription, however, genome-wide mechanisms of how antisense transcription regulates sense transcription remain to be Results: Here, we performed a systematic analysis of sense-antisense transcription and nucleosome occupancy in yeast. We found that antisense transcription is associated with nucleosome occupancy in sense promoters. Using RNA polymerase II inactivation data as a reasonable approximation to antisense transcription inactivation data, we further showed that antisense transcripts increase nucleosome occupancy in sense promoter regions they overlap, and reduce nucleosome occupancy in sense promoter regions around their transcription termination sites. These results reveal the previously unappreciated roles of antisense transcription in directing nucleosome occupancy in sense promoters. Our findings will have implications in understanding regulatory functions of antisense transcription.", "paper_title": "Antisense transcription is coupled to nucleosome occupancy in sense promoters", "paper_id": "WOS:000310155300002"}