{"auto_keywords": [{"score": 0.03084505914787528, "phrase": "perceived_loneliness"}, {"score": 0.00481495049065317, "phrase": "contemporary_society"}, {"score": 0.00467677555573346, "phrase": "extended_periods"}, {"score": 0.0038140261371648744, "phrase": "prior_research"}, {"score": 0.0037725685596495355, "phrase": "mixed_results"}, {"score": 0.003704467870496114, "phrase": "loneliness-reporting_both_positive_and_negative_effects"}, {"score": 0.0035849585026689573, "phrase": "clearer_perspective"}, {"score": 0.0034946693480479712, "phrase": "closer_look"}, {"score": 0.003357343256340741, "phrase": "theoretical_works"}, {"score": 0.003201967054773186, "phrase": "relationship_characteristics"}, {"score": 0.002747328139245956, "phrase": "individuals'_relationship_orientation"}, {"score": 0.0025821622412496967, "phrase": "osn."}, {"score": 0.0024004805502253427, "phrase": "practical_implications"}, {"score": 0.0023229408675543147, "phrase": "mobile_workers"}, {"score": 0.0022397131088479514, "phrase": "education_providers"}, {"score": 0.0021049977753042253, "phrase": "social_bridge"}], "paper_keywords": ["social media", " online social networks", " loneliness", " relationship management", " communal orientation", " social exchange theory", " self-disclosure", " networking ability"], "paper_abstract": "In contemporary society, many people move away from their personal networks for extended periods to reach professional and/or educational goals. This separation can often lead to feelings of loneliness, which can be stressful and sometimes debilitating for the individual. We seek to understand how a person's use of online social networks (OSNs)-technology-enabled tools that assist users with creating and maintaining their relationships-might affect their perceptions of loneliness. Prior research has offered mixed results about how OSNs affect loneliness-reporting both positive and negative effects. We argue in this study that a clearer perspective can be gained by taking a closer look at how individuals approach their relationship management in OSNs. Building on theoretical works on loneliness, we develop a model to explain the effects of relationship characteristics (i.e., relationship orientation, self-disclosure, and networking ability) and OSN features (i.e., active or passive) on perceived loneliness. Our findings show that OSN can be linked to both more and less perceived loneliness, that is, individuals' relationship orientation significantly affects their feelings of loneliness, which are further moderated by their degree of self-disclosure within the OSN. Furthermore, how users engage in the OSN (either actively or passively) influences their perceptions of loneliness. Practical implications regarding perceived loneliness include recommendations for firms to encourage mobile workers to utilize OSNs when separated from others, for education providers to connect with their new students before they arrive, and for users to utilize OSNs as a social bridge to others they feel close with.", "paper_title": "Are You Feeling Lonely? The Impact of Relationship Characteristics and Online Social Network Features on Loneliness", "paper_id": "WOS:000353145800011"}