{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "cognitive_systems"}, {"score": 0.0035932440062595252, "phrase": "ai_systems"}, {"score": 0.0035565113234273926, "phrase": "cognitive_models"}, {"score": 0.0034485432592912917, "phrase": "psychological_findings"}, {"score": 0.003343841875107018, "phrase": "cognitive_systems_research"}, {"score": 0.0030798711656591948, "phrase": "rather_simple_cognitive_processes"}, {"score": 0.0027646829399573434, "phrase": "cognitive_science_methods"}, {"score": 0.002559444836360178, "phrase": "complex_cognition"}, {"score": 0.002468938912850425, "phrase": "complex_cognition_-_complex_problem"}, {"score": 0.0021709933368474223, "phrase": "future_research"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": [""], "paper_abstract": "Complex cognition addresses research on ( a) high-level cognitive processes - mainly problem solving, reasoning, and decision making - and their interaction with more basic processes such as perception, learning, motivation and emotion and (b) cognitive processes which take place in a complex, typically dynamic, environment. Our focus is on AI systems and cognitive models dealing with complexity and on psychological findings which can inspire or challenge cognitive systems research. In this overview we first motivate why we have to go beyond models for rather simple cognitive processes and reductionist experiments. Afterwards, we give a characterization of complexity from our perspective. We introduce the triad of cognitive science methods - analytical, empirical, and engineering methods - which in our opinion have all to be utilized to tackle complex cognition. Afterwards we highlight three aspects of complex cognition - complex problem solving, dynamic decision making, and learning of concepts, skills and strategies. We conclude with some reflections about and challenges for future research. (C) 2010 Elsevier B.V. All rights reserved.", "paper_title": "The challenge of complexity for cognitive systems", "paper_id": "WOS:000289061400001"}