{"auto_keywords": [{"score": 0.04195722874922, "phrase": "method_name"}, {"score": 0.015182398927516366, "phrase": "program_readability"}, {"score": 0.014791316575894014, "phrase": "method_names"}, {"score": 0.01025458675277218, "phrase": "candidate_verbs"}, {"score": 0.00481495049065317, "phrase": "existing_projects"}, {"score": 0.004567596860086148, "phrase": "maintenance_tasks"}, {"score": 0.004487989502479992, "phrase": "important_identifiers"}, {"score": 0.003372019835750424, "phrase": "different_notion"}, {"score": 0.0033277936960179892, "phrase": "suitable_lexicon"}, {"score": 0.0027782510491938315, "phrase": "association_rules"}, {"score": 0.0027417911324611917, "phrase": "existing_methods"}, {"score": 0.002577925852423608, "phrase": "java"}, {"score": 0.0024667783849055634, "phrase": "extracted_rules"}, {"score": 0.0023192471808039746, "phrase": "considered_methods"}, {"score": 0.002258745901862197, "phrase": "existing_verb"}, {"score": 0.0021613897794439227, "phrase": "actual_renamed_methods"}, {"score": 0.002142426911242168, "phrase": "six_projects"}, {"score": 0.0021049977753042253, "phrase": "correct_verb"}], "paper_keywords": ["software readability", " recommendation", " method name", " association rule"], "paper_abstract": "It is well-known that program readability is important for maintenance tasks. Method names are important identifiers for program readability because they are used for understanding the behavior of methods without reading a part of the program. Although developers can create a method name by arbitrarily choosing a verb and objects, the names are expected to represent the behavior consistently. However, it is not easy for developers to choose verbs and objects consistently since each developer may have a different notion of a suitable lexicon for method names. In this paper, we propose a technique to recommend candidate verbs for a method name so that developers can use various verbs consistently. We recommend candidate verbs likely to be used as a part of a method name, using association rules extracted from existing methods. To evaluate our technique, we have extracted rules from 445 open source projects written in Java and confirmed the accuracy of our approach by applying the extracted rules to several open source applications. As a result, we found that 84.9% of the considered methods in four projects are recommended the existing verb. Moreover, we found that 73.2% of the actual renamed methods in six projects are recommended the correct verb.", "paper_title": "Method Verb Recommendation Using Association Rule Mining in a Set of Existing Projects", "paper_id": "WOS:000356589400019"}