{"auto_keywords": [{"score": 0.04975698916567594, "phrase": "creative_research_institution"}, {"score": 0.049437560083496264, "phrase": "hokkaido_university"}, {"score": 0.040978700692412794, "phrase": "cris"}, {"score": 0.00481495049065317, "phrase": "cross-disciplinary_research"}, {"score": 0.004410713064804144, "phrase": "preliminary_bibliometric_analysis"}, {"score": 0.0041649392718268305, "phrase": "cast"}, {"score": 0.0038668462001710314, "phrase": "primary_mission"}, {"score": 0.003626626504149897, "phrase": "-disciplinary_research"}, {"score": 0.0033784754343067023, "phrase": "hu"}, {"score": 0.003355645563101351, "phrase": "external_grants"}, {"score": 0.0033106223384515546, "phrase": "mext_super-coe"}, {"score": 0.003299460925313939, "phrase": "hu_research"}, {"score": 0.003115354317501177, "phrase": "regional_businesses"}, {"score": 0.003042555825368091, "phrase": "meiji_dairies"}, {"score": 0.0029414903557512663, "phrase": "overlay_map"}, {"score": 0.0027773024878187656, "phrase": "published_items"}, {"score": 0.0024674880645446312, "phrase": "externally_funded_or_endowed_projects"}, {"score": 0.002275214783528274, "phrase": "apparently_low_visibility"}, {"score": 0.0021921581733031514, "phrase": "almost_complete_absence"}, {"score": 0.002126458181856629, "phrase": "social_sciences"}, {"score": 0.0021049977753042253, "phrase": "wos_database"}], "paper_keywords": ["Bibliometrics", " Web of Science", " Co-word analysis", " Bibliographic coupling", " Cross-disciplinary research", " Science map", " Japan"], "paper_abstract": "This study describes the results of a preliminary bibliometric analysis of 611 research items, published between 1996 and 2011 by researchers affiliated with Creative Research Institution (CRIS) and the Center for Advanced Science and Technology (CAST), Hokkaido University (HU), retrieved from the Web of Science (WoS) database. CRIS has a primary mission to promote cutting-edge, world-class, trans-departmental research within HU, and it conducts fundamental, commercialization-related, cross-disciplinary research and nurtures young in-house/recruited researchers through targeted, innovative tenure-track programs in multiple disciplines. Its research output derives from 3- to 7-year-long time-bound projects funded strategically by HU, external grants [e.g., MEXT Super-COE HU Research and Business Park Project (FY2003-7)], industry-university collaboration with regional businesses, and endowments (e.g., Meiji Dairies). Analyses using co-words, bibliographic coupling, overlay map aided with visualization, etc., lead to the following inferences: (i) The published items comprise a dozen well-defined (inter-)disciplinary clusters, dominated by 3 macro-disciplines (biomedical science, 33%; chemistry, 21%; agricultural science, ca. 10%) that constitute 18 clusters used for mapping; (ii) research conducted by externally funded or endowed projects in the biomedical, physical and environmental science and technology fields (3 broad areas of aggregation derived from the Science Overlay Map) is interdisciplinary; and (iii) there is an apparently low visibility of publications from projects jointly executed with industries to an almost complete absence of output from CRIS in the fields of social sciences in the WoS database.", "paper_title": "Reflection of cross-disciplinary research at Creative Research Institution (Hokkaido University) in the Web of Science database: appraisal and visualization using bibliometry", "paper_id": "WOS:000309357600008"}