{"auto_keywords": [{"score": 0.04492133981062049, "phrase": "dft"}, {"score": 0.004434824354230475, "phrase": "second-order_moller-plesset"}, {"score": 0.004331811712726697, "phrase": "density-functional_theory"}, {"score": 0.00423118169200579, "phrase": "semiempirical_self-consistent_charge_density"}, {"score": 0.004068611852912931, "phrase": "zero-point_energy"}, {"score": 0.0038665369393234713, "phrase": "fragmentation_energies"}, {"score": 0.003761900996118551, "phrase": "fullerene_cations"}, {"score": 0.0034510635632071978, "phrase": "experimental_data"}, {"score": 0.003092200512475624, "phrase": "sufficient_amounts"}, {"score": 0.0030680392468327147, "phrase": "experimental_samples"}, {"score": 0.0029849474387154827, "phrase": "larger_basis_sets"}, {"score": 0.002792375587031108, "phrase": "semiempirical_approaches"}, {"score": 0.00275970269387345, "phrase": "scc-dftb"}, {"score": 0.0026431267487109543, "phrase": "satisfactory_fragmentation_energies"}, {"score": 0.002622465142275264, "phrase": "higher_fullerenes"}, {"score": 0.002531463482341473, "phrase": "routine_calculations"}, {"score": 0.0024920359789965783, "phrase": "carbon_nanotubes"}, {"score": 0.002312960805824996, "phrase": "semiempirical_self-consistent-charge_density"}, {"score": 0.0021049977753042253, "phrase": "resulting_fragmentation_energies"}], "paper_keywords": ["Ab initio and density-functional theory calculations", " binding energy", " fragmentation energy", " fullerenes", " tight-binding models"], "paper_abstract": "The C-2 fragmentation energies of the most stable isolated-pentagon-rule (IPR) isomers of the C-80 and C-82 fullerenes were evaluated with second-order Moller-Plesset (MP2) theory, density-functional theory (DFT) and the semiempirical self-consistent charge density-functional tight-binding (SCC-DFTB) method. Zero-point energy, ionization energy and empirical C2 corrections were included in the calculation of fragmentation energies for comparison with experimental C2 fragmentation energies of the fullerene cations. In the case of the most probable Stone-Wales pathway of C2 fragmentation of C-80, the calculated D-0(C-80(+)) agree well with experimental data, whereas in the case of C-82 fragmentation, the calculated D0(C-82(+)) exceed by up to 1.2 eV the experimental ones, which suggests that other IPR isomers may be present in sufficient amounts in experimental samples. Computer-intensive MP2 calculations and DFT calculations with larger basis sets do not yield much improved C2 fragmentation energies, compared to those reported earlier with B3LYP/3-21G. On the other hand, semiempirical approaches such as SCC-DFTB, which are orders of magnitude less intensive, yield satisfactory fragmentation energies for higher fullerenes and may become a method of choice for routine calculations of fullerenes and carbon nanotubes. Figure: C2 fragmentation energies of C-80 and C-82 fullerenes have been calculated with B3LYP/6-31G* model chemistry, with semiempirical self-consistent-charge density-functional tight-binding (SCC-DFTB) method and with the more rigorous MP2 method. The influence of basis set extension and level of theory on the resulting fragmentation energies is discussed.", "paper_title": "Calculations of the C-2 fragmentation energies of higher fullerenes C-80 and C-82", "paper_id": "WOS:000248302100004"}