{"auto_keywords": [{"score": 0.03810903968195701, "phrase": "\"time_motion_studies"}, {"score": 0.01194609404135813, "phrase": "common_understanding"}, {"score": 0.011383246153016181, "phrase": "methodological_variability"}, {"score": 0.004837531808291194, "phrase": "time"}, {"score": 0.004620093797504386, "phrase": "industrial_engineering"}, {"score": 0.004564291332315995, "phrase": "quantitative_data_collection_method"}, {"score": 0.00453113241842654, "phrase": "external_observer"}, {"score": 0.004509159807793217, "phrase": "detailed_data"}, {"score": 0.004400877699296756, "phrase": "specific_task"}, {"score": 0.004192019250600385, "phrase": "biomedical_researchers"}, {"score": 0.004081385289516914, "phrase": "current_interest"}, {"score": 0.004061584718427419, "phrase": "clinical_workflow_related_factors"}, {"score": 0.0038876302202924644, "phrase": "significant_variability"}, {"score": 0.0034507850041574015, "phrase": "domain_literature"}, {"score": 0.003294875957676514, "phrase": "dissimilar_sub-techniques"}, {"score": 0.0032709088591705983, "phrase": "crucial_milestone"}, {"score": 0.003215659239270654, "phrase": "time_motion_studies"}, {"score": 0.0031459887611258765, "phrase": "proper_recognition"}, {"score": 0.0031231012822640672, "phrase": "distinct_techniques"}, {"score": 0.0029031614127920232, "phrase": "detailed_description"}, {"score": 0.002882035427110233, "phrase": "distinct_methods"}, {"score": 0.002725081358527507, "phrase": "original_technique"}, {"score": 0.002679026646630546, "phrase": "broad_spectrum"}, {"score": 0.002551674994215226, "phrase": "existing_broad_scope"}, {"score": 0.0025024415486497933, "phrase": "disambiguation_approach"}, {"score": 0.0024781813184845606, "phrase": "expanded_conception"}, {"score": 0.002430362445895986, "phrase": "specific_qualifier"}, {"score": 0.002348883765159185, "phrase": "original_method"}, {"score": 0.0023148039927921825, "phrase": "external_observer_recording_data"}, {"score": 0.0022263171743559986, "phrase": "continuous_observation_time_motion_studies"}, {"score": 0.0021621741833909303, "phrase": "future_results_aggregation"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Time and Motion Studies", " Methods", " Standardization"], "paper_abstract": "Time motion studies were first described in the early 20th century in industrial engineering, referring to a quantitative data collection method where an external observer captured detailed data on the duration and movements required to accomplish a specific task, coupled with an analysis focused on improving efficiency. Since then, they have been broadly adopted by biomedical researchers and have become a focus of attention due to the current interest in clinical workflow related factors. However, attempts to aggregate results from these studies have been difficult, resulting from a significant variability in the implementation and reporting of methods. While efforts have been made to standardize the reporting of such data and findings, a lack of common understanding on what \"time motion studies\" are remains, which not only hinders reviews, but could also partially explain the methodological variability in the domain literature (duration of the observations, number of tasks, multitasking, training rigor and reliability assessments) caused by an attempt to cluster dissimilar sub-techniques. A crucial milestone towards the standardization and validation of time motion studies corresponds to a common understanding, accompanied by a proper recognition of the distinct techniques it encompasses. Towards this goal, we conducted a review of the literature aiming at identifying what is being referred to as \"time motion studies\". We provide a detailed description of the distinct methods used in articles referenced or classified as \"time motion studies\", and conclude that currently it is used not only to define the original technique, but also to describe a broad spectrum of studies whose only common factor is the capture and/or analysis of the duration of one or more events. To maintain alignment with the existing broad scope of the term, we propose a disambiguation approach by preserving the expanded conception, while recommending the use of a specific qualifier \"continuous observation time motion studies\" to refer to variations of the original method (the use of an external observer recording data continuously). In addition, we present a more granular naming for sub-techniques within continuous observation time motion studies, expecting to reduce the methodological variability within each sub-technique and facilitate future results aggregation. (C) 2014 The Authors. Published by Elsevier Inc.", "paper_title": "Time motion studies in healthcare: What are we talking about?", "paper_id": "WOS:000337772200029"}