{"auto_keywords": [{"score": 0.04330320170884125, "phrase": "proposed_method"}, {"score": 0.018878109984145984, "phrase": "pso-based_algorithms"}, {"score": 0.007977910740266714, "phrase": "computation_time"}, {"score": 0.006198744586083183, "phrase": "clustering_result"}, {"score": 0.00481495049065317, "phrase": "high-performance_method"}, {"score": 0.004655285779819366, "phrase": "time_complexity"}, {"score": 0.004577440795549049, "phrase": "particle_swarm_optimization"}, {"score": 0.004500917715253006, "phrase": "pso"}, {"score": 0.004242868712089958, "phrase": "partitional_clustering_problem"}, {"score": 0.003802135020791801, "phrase": "pattern_reduction_operator"}, {"score": 0.0034359094594153304, "phrase": "iteration_patterns"}, {"score": 0.003027178161479457, "phrase": "multistart_operator"}, {"score": 0.0024302416436559867, "phrase": "local_optima"}], "paper_keywords": ["Clustering", " Particle swarm optimization", " Pattern reduction"], "paper_abstract": "This paper presents a high-performance method to reduce the time complexity of particle swarm optimization (PSO) and its variants in solving the partitional clustering problem. The proposed method works by adding two additional operators to the PSO-based algorithms. The pattern reduction operator is aimed to reduce the computation time, by compressing at each iteration patterns that are unlikely to change the clusters to which they belong thereafter while the multistart operator is aimed to improve the quality of the clustering result, by enforcing the diversity of the population to prevent the proposed method from getting stuck in local optima. To evaluate the performance of the proposed method, we compare it with several state-of-the-art PSO-based methods in solving data clustering, image clustering, and codebook generation problems. Our simulation results indicate that not only can the proposed method significantly reduce the computation time of PSO-based algorithms, but it can also provide a clustering result that matches or outperforms the result PSO-based algorithms by themselves can provide.", "paper_title": "A fast particle swarm optimization for clustering", "paper_id": "WOS:000347836800006"}