{"auto_keywords": [{"score": 0.007745989076910988, "phrase": "rapid_protocol_development"}, {"score": 0.00481495049065317, "phrase": "wireless_sensor_networks"}, {"score": 0.004787595063253874, "phrase": "sensornet_deployments"}, {"score": 0.004548253531664032, "phrase": "real_time_streams"}, {"score": 0.004509537745811511, "phrase": "critical_support"}, {"score": 0.004483909657713567, "phrase": "network_reprogramming"}, {"score": 0.004284037022875158, "phrase": "network_layer_functionalities"}, {"score": 0.004247560712327667, "phrase": "severe_resource_constraints"}, {"score": 0.004175533280178052, "phrase": "multiple_routing_protocols"}, {"score": 0.004093037185145671, "phrase": "vertically_integrated_designs"}, {"score": 0.004069766428492073, "phrase": "present_protocols"}, {"score": 0.0038332390893263844, "phrase": "different_types"}, {"score": 0.0037682108720193956, "phrase": "conflicting_communication_requirements"}, {"score": 0.003736110068915636, "phrase": "flow's_requirements"}, {"score": 0.0036207206487324506, "phrase": "packet_header"}, {"score": 0.0035898717643894303, "phrase": "core_architecture"}, {"score": 0.0035390378585554547, "phrase": "highly_composable_modules"}, {"score": 0.0032766780632972363, "phrase": "application_specific_network_layer"}, {"score": 0.0032027318619522916, "phrase": "flow's_needs"}, {"score": 0.003094920033010818, "phrase": "time_sharing"}, {"score": 0.002898291237210567, "phrase": "flexible_scheduling_policies"}, {"score": 0.0026528362797828306, "phrase": "virtually_any_communication_pattern"}, {"score": 0.0024350617135432406, "phrase": "fairly_complete_and_realistic_traffic_workload"}, {"score": 0.002178400923036365, "phrase": "code_size"}, {"score": 0.0021659920594094407, "phrase": "memory_footprints"}, {"score": 0.002153653728048424, "phrase": "forwarding_costs"}, {"score": 0.0021413855297794946, "phrase": "micaz_motes"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Wireless sensor networks", " Multi-hop routing", " Dynamic routing"], "paper_abstract": "Sensornet deployments of the future are expected to deliver a multitude of services, ranging from reliable sensing, real time streams, mission critical support, network reprogramming and so on. Naturally, no one routing protocol can sufficiently cater to the network layer functionalities expected. Severe resource constraints further limit the possibility of multiple routing protocols to be implemented. Further, vertically integrated designs of present protocols hinder synergy and code-reuse among implementations. In this paper, we present an architecture that allows applications to send different types of flows, often with conflicting communication requirements. A flow's requirements are made visible to our framework by using just 3 bits in the packet header. The core architecture is a collection of highly composable modules that allows rapid protocol development and deployment. We show that our framework can provide: (i) flow based network functionality that ensures each flow gets an application specific network layer which is dynamically knit as per the flow's needs, (ii) modular organization that promotes code-reuse, run time sharing, synergy and rapid protocol development and (iii) pull processing that allows flows to dictate their traffic rate in the network, and implement flexible scheduling policies. This creates a framework for developing, testing, integrating, and validating protocols that are highly portable from one deployment to another. Using our framework, we show that virtually any communication pattern can be described to the framework. We validate this by gathering requirements for one real world application scenario: predictive maintenance (PdM). The requirements are used to generate a fairly complete and realistic traffic workload to drive our evaluation. Using simulations and 40 node MicaZ testbed experiments, we show that our framework can meet the deployments demands at granularities not seen before in sensornets. We measure the costs of using this framework in terms of code size, memory footprints and forwarding costs on MicaZ motes. (C) 2011 Elsevier B.V. All rights reserved.", "paper_title": "A dynamic reconfigurable routing framework for wireless sensor networks", "paper_id": "WOS:000292622200013"}