{"auto_keywords": [{"score": 0.04820929802388966, "phrase": "knowledge_propagation"}, {"score": 0.03009408526993377, "phrase": "full_pom"}, {"score": 0.00481495049065317, "phrase": "unsupervised_learning_of_probabilistic_object_models"}, {"score": 0.0047357308775561255, "phrase": "object_classification"}, {"score": 0.004505771917193233, "phrase": "probabilistic_object_models"}, {"score": 0.004431616517786392, "phrase": "minimal_supervision"}, {"score": 0.0043731680194078046, "phrase": "different_visual_cues"}, {"score": 0.0041195049121633956, "phrase": "structure_induction"}, {"score": 0.00397175830521626, "phrase": "elementary_poms"}, {"score": 0.003906357144047631, "phrase": "complementary_image_cues"}, {"score": 0.0038420287603415566, "phrase": "novel_structure_induction_procedure"}, {"score": 0.003308557560574077, "phrase": "interest_points"}, {"score": 0.003286642683771891, "phrase": "weak_supervision"}, {"score": 0.003095806891672679, "phrase": "regional_features"}, {"score": 0.0030447855364295015, "phrase": "combined_pom"}, {"score": 0.002984665318717504, "phrase": "combined_model"}, {"score": 0.002820675782452964, "phrase": "improved_performance"}, {"score": 0.0027649684074145028, "phrase": "detailed_experimental_analysis"}, {"score": 0.002746644177161797, "phrase": "large_data_sets"}, {"score": 0.0026580578180830173, "phrase": "inference"}, {"score": 0.0023727863021828547, "phrase": "hybrid_objects_classes"}, {"score": 0.002126111716875144, "phrase": "different_objects"}], "paper_keywords": ["Unsupervised learning", " object classification", " segmentation", " recognition"], "paper_abstract": "We present a method to learn probabilistic object models (POMs) with minimal supervision, which exploit different visual cues and perform tasks such as classification, segmentation, and recognition. We formulate this as a structure induction and learning task and our strategy is to learn and combine elementary POMs that make use of complementary image cues. We describe a novel structure induction procedure, which uses knowledge propagation to enable POMs to provide information to other POMs and \"teach them\" (which greatly reduces the amount of supervision required for training and speeds up the inference). In particular, we learn a POM-IP defined on Interest Points using weak supervision [1], [ 2] and use this to train a POM-mask, defined on regional features, which yields a combined POM that performs segmentation/localization. This combined model can be used to train POM-edgelets, defined on edgelets, which gives a full POM with improved performance on classification. We give detailed experimental analysis on large data sets for classification and segmentation with comparison to other methods. Inference takes five seconds while learning takes approximately four hours. In addition, we show that the full POM is invariant to scale and rotation of the object (for learning and inference) and can learn hybrid objects classes (i.e., when there are several objects and the identity of the object in each image is unknown). Finally, we show that POMs can be used to match between different objects of the same category, and hence, enable objects recognition.", "paper_title": "Unsupervised Learning of Probabilistic Object Models (POMs) for Object Classification, Segmentation, and Recognition Using Knowledge Propagation", "paper_id": "WOS:000268996500003"}