{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "perceived_credibility"}, {"score": 0.004681971826924847, "phrase": "medical_information"}, {"score": 0.004395984840790689, "phrase": "six_blogs"}, {"score": 0.004259582098193949, "phrase": "conventional_treatment"}, {"score": 0.004170996594527844, "phrase": "alternative_treatment"}, {"score": 0.0034038593017883295, "phrase": "growing_use"}, {"score": 0.0033213460816510685, "phrase": "medical_topics"}, {"score": 0.002767696345005216, "phrase": "real_need"}, {"score": 0.002738723329538677, "phrase": "health_information"}, {"score": 0.0027005626126039204, "phrase": "blog_posts"}, {"score": 0.002625824756118839, "phrase": "artificial_blog"}, {"score": 0.0024999636244840647, "phrase": "longer-term_interaction"}, {"score": 0.002396883802324751, "phrase": "health_community"}, {"score": 0.0022187920251626257, "phrase": "previous_studies"}], "paper_keywords": ["Blogs", " Conventional medicine", " Alternative medicine", " Credibility", " Medicine"], "paper_abstract": "Purpose - The purpose of this paper is to describe a study that examined the perceived credibility of blogs on the internet and the medical information published in them as perceived by the readers of these blogs. Design/methodology/approach - A total of six blogs each with two posts were constructed, one on conventional treatment and the other on an alternative treatment of diabetes. In total, 361 participants viewed one blog each and filled in a questionnaire of the perceived credibility of the blog, the author of the blog and its message. Findings - The results of the study indicate an attitude of scepticism and/or criticism of many aspects of the information in the blogs, together with the growing use of blogs to find information on medical topics. It seems that users apply scepticism as a way to deal with the lack of certainty as to the credibility of the information in spite of their desire and readiness to use this information. Research limitations/implications - The users who took part in the experiment did not actually have a real need for the health information provided in the blog posts. They only saw two blog posts in an artificial blog, and in order to fully assess credibility there is need for a longer-term interaction. Practical implications - Findings from this study may help the health community to design messages that are perceived as credible by the public. Originality/value - The users in this study, unlike previous studies, were more critical of the information presented to them. One possible reason could be their older age.", "paper_title": "Perceived credibility of blogs on the internet - the influence of age on the extent of criticism", "paper_id": "WOS:000315014400001"}