{"auto_keywords": [{"score": 0.0413490378763615, "phrase": "weakly_self-dual_code"}, {"score": 0.02291887028094085, "phrase": "factor_graphs"}, {"score": 0.010612387000973441, "phrase": "css_codes"}, {"score": 0.008352509679723433, "phrase": "generator_matrix"}, {"score": 0.004126123386192962, "phrase": "ccs_codes"}, {"score": 0.0037506567448470163, "phrase": "parity-check_matrix"}, {"score": 0.0029610472910087176, "phrase": "weakly_self-dual_one"}, {"score": 0.00292092568909375, "phrase": "tanner"}, {"score": 0.0028813415821988156, "phrase": "convolutional_factor"}, {"score": 0.0025833500717948343, "phrase": "matrix_of"}, {"score": 0.002491015208328868, "phrase": "conventional_algebra_methods"}, {"score": 0.002423931101340771, "phrase": "matrix_computation"}, {"score": 0.0022743274702883456, "phrase": "quantum_css_code"}, {"score": 0.0021050011192089496, "phrase": "elsevier"}], "paper_keywords": ["quantum error-correcting code", " CSS code", " factor graph", " duality"], "paper_abstract": "A novel, practical and convenient approach to constructing Calderbank-Shor Steane (CSS) codes based on factor graphs is presented in this paper. Our proposed method is applied to solve two problems associated with constructing CCS codes. One is judging whether a code is a weakly self-dual code or not, the other is finding the generator matrix and parity-check matrix of a weakly self-dual code. The novelty, practicality and convenience of the approach are shown as follows. First, the approach is a hitherto unexplored one to constructing CSS codes. Second, the judgment of a weakly self-dual code is entirely based on factor graphs. Namely, we consider a code a weakly self-dual one when the Tanner graph or convolutional factor graph of its dual code can be obtained by that of its own via our proposed transform TR-->L. Finally, we can obtain the generator matrix and parity-check Matrix of a weakly self-dual code via factor graphs other than conventional algebra methods, which allow us avoid matrix Computation to get them. An example is given to show how to construct quantum CSS code based on factor graphs. The method can be extended to other CSS codes. (C) 2007 Elsevier Inc. All rights reserved.", "paper_title": "A new approach to constructing CSS codes based on factor graphs", "paper_id": "WOS:000254225000007"}