{"auto_keywords": [{"score": 0.043400370094307784, "phrase": "packet_loss"}, {"score": 0.006760533830028925, "phrase": "buffering_function"}, {"score": 0.005597954930788037, "phrase": "packet_forwarding_rate"}, {"score": 0.004567596860086148, "phrase": "network-based_mobility_management_protocol"}, {"score": 0.004429191773525288, "phrase": "handover_latency"}, {"score": 0.004238682850598745, "phrase": "host-based_mobility_management_protocols"}, {"score": 0.004020813632357377, "phrase": "mobile_node"}, {"score": 0.0036179751816682454, "phrase": "network_entities"}, {"score": 0.0034319005131102495, "phrase": "performance_improvement"}, {"score": 0.003198554193075258, "phrase": "buffering_functions"}, {"score": 0.0028151944356239952, "phrase": "open_source_resources"}, {"score": 0.002753891109273246, "phrase": "functional_and_performance_enhancements"}, {"score": 0.0025665261770229757, "phrase": "improved_buffering_function"}, {"score": 0.0024130437638400404, "phrase": "testbed_show"}, {"score": 0.0022687196456437375, "phrase": "mn."}], "paper_keywords": ["PMIPv6", " Proxy mobile IPv6", " Buffering", " Implementation", " OAI PMIPv6"], "paper_abstract": "Proxy mobile IPv6 (PMIPv6) is a network-based mobility management protocol that improves performance in terms of handover latency, signaling cost, and packet loss compared to host-based mobility management protocols. However, still packet loss occurs during the handover of the mobile node (MN). Several attempts have been made to improve the reliability of PMIPv6 service by proposing schemes in which packets are buffered in network entities during the handover of the MN to prevent packet loss, and performance improvement has been demonstrated via simulations. So far, there have been no implementations of buffering functions in the literature. This paper addresses design of buffering function and its implementation to prevent packet loss, and demonstrates the results. We have implemented a PMIPv6 testbed based on open source resources. We discuss the functional and performance enhancements, comparing PMIPv6 with the buffering implemented and standard PMIPv6. We also propose an improved buffering function where the packet forwarding rate of the buffer is adjusted. The results through the testbed show that the buffering function in PMIPv6 effectively prevents packet loss during the handover of the MN. We have found out that we can manage the amount of packets in the buffer without further increment by adjusting the packet forwarding rate of the buffer as well.", "paper_title": "Buffering in proxy mobile IPv6: implementation and analysis", "paper_id": "WOS:000337800400024"}