{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "wikipedia"}, {"score": 0.0339336452889164, "phrase": "value_function"}, {"score": 0.004478782833067256, "phrase": "new_concept-based_method"}, {"score": 0.004319566932528865, "phrase": "conceptual_knowledge"}, {"score": 0.003922011960904278, "phrase": "abundant_semantic_relatedness_information"}, {"score": 0.0037825134619339537, "phrase": "efficient_value_function-based_query_learning_algorithm"}, {"score": 0.003539479990299223, "phrase": "simple_linear_programming_problem"}, {"score": 0.0034550163444256386, "phrase": "training_documents"}, {"score": 0.003332072426367186, "phrase": "step-wise_iterative_process"}, {"score": 0.003155784719225786, "phrase": "appropriate_set"}, {"score": 0.0025388705701873075, "phrase": "particular_document"}, {"score": 0.002304824112812496, "phrase": "reuters_newswire_documents"}, {"score": 0.0021306081217770173, "phrase": "extensive_comparison"}], "paper_keywords": [""], "paper_abstract": "In this article, we propose a new concept-based method for document classification. The conceptual knowledge associated with the words is drawn from Wikipedia. The purpose is to utilize the abundant semantic relatedness information available in Wikipedia in an efficient value function-based query learning algorithm. The procedure learns the value function by solving a simple linear programming problem formulated using the training documents. The learning involves a step-wise iterative process that helps in generating a value function with an appropriate set of concepts (dimensions) chosen from a collection of concepts. Once the value function is formulated, it is utilized to make a decision between relevance and irrelevance. The value assigned to a particular document from the value function can be further used to rank the documents according to their relevance. Reuters newswire documents have been used to evaluate the efficacy of the procedure. An extensive comparison with other frameworks has been performed. The results are promising.", "paper_title": "Concept-Based Document Classification Using Wikipedia and Value Function", "paper_id": "WOS:000297303100017"}