{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "sustainable_information_practice"}, {"score": 0.049027569260597106, "phrase": "information_science"}, {"score": 0.03698114486737466, "phrase": "community_members"}, {"score": 0.004425215632459868, "phrase": "intentional_communities"}, {"score": 0.004251728624599691, "phrase": "core_values"}, {"score": 0.004158290806404304, "phrase": "ethnographic_methods"}, {"score": 0.003977505904363489, "phrase": "participant_observation"}, {"score": 0.003770869401884267, "phrase": "community_images"}, {"score": 0.003449972561293443, "phrase": "community_values"}, {"score": 0.002952516738708181, "phrase": "community_concepts"}, {"score": 0.002836601200672692, "phrase": "methodological_challenges"}, {"score": 0.002811464848641341, "phrase": "information_practice_inquiry"}, {"score": 0.002438203996977464, "phrase": "investigation_call"}, {"score": 0.002405853977978678, "phrase": "previous_claims"}, {"score": 0.0023424328921363585, "phrase": "strong_value_commitments"}, {"score": 0.002290858045013009, "phrase": "information_tools"}, {"score": 0.0021620042653528846, "phrase": "information_practices"}], "paper_keywords": ["technology impact", " ethnography", " communities"], "paper_abstract": "This project develops the concept of sustainable information practice within the field of information science. The inquiry is grounded by data from a study of 2 ecovillages, intentional communities striving to ground their daily activities in a set of core values related to sustainability. Ethnographic methods employed for over 2 years resulted in data from hundreds of hours of participant observation, semistructured interviews with 22 community members, and a diverse collection of community images and texts. Analysis of the data highlights the tensions that arose and remained as community members experienced breakdowns between community values related to sustainability and their daily information practices. Contributions to the field of information science include the development of the concept of sustainable information practice, an analysis of why community members felt unable to adapt their information practices to better match community concepts of sustainability, and an assessment of the methodological challenges of information practice inquiry within a communal, nonwork environment. Most broadly, this work contributes to our larger understanding of the challenges faced by those attempting to identify and develop more sustainable information practices. In addition, findings from this investigation call into question previous claims that groups of individuals with strong value commitments can adapt their use of information tools to better support their values. In contrast, this work suggests that information practices can be particularly resilient to local, value-based adaptation.", "paper_title": "Sustainable information practice: An ethnographic investigation", "paper_id": "WOS:000310550000011"}