{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "fuzzy_preference_relations"}, {"score": 0.00619621414001627, "phrase": "individual_interval"}, {"score": 0.006065404303340227, "phrase": "collective_interval"}, {"score": 0.006022413872569292, "phrase": "fuzzy_preference_relation"}, {"score": 0.003544088803300751, "phrase": "quadratic_programming_model"}, {"score": 0.0032073043728420817, "phrase": "exact_solution"}, {"score": 0.003051073364818384, "phrase": "importance_weights"}, {"score": 0.0027807832748641195, "phrase": "multiplicative_consistent_interval_fuzzy_preference_relations"}, {"score": 0.002326304140277375, "phrase": "practical_application"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Group decision making", " Interval fuzzy preference relation", " Quadratic programming model", " Numerical analysis"], "paper_abstract": "Interval fuzzy preference relations are an extension of fuzzy preference relations, which are usually used by experts to express their uncertain preference information over objects in group decision making. In this paper, we focus our attention on the investigation of consistency of interval fuzzy preference relations. We first establish a quadratic programming model by minimizing all the deviations of individual interval fuzzy preference relations and collective interval fuzzy preference relation, from which an exact solution can be found to derive the importance weights of experts. Then, we give two approaches to constructing additive and multiplicative consistent interval fuzzy preference relations, respectively, and show the relationship between the consistency of individual interval fuzzy preference relations and the consistency of collective interval fuzzy preference relation. At last, a practical application is given to our models and approaches. (C) 2011 Published by Elsevier B.V.", "paper_title": "Consistency of interval fuzzy preference relations in group decision making", "paper_id": "WOS:000290381300003"}