{"auto_keywords": [{"score": 0.04488089729057956, "phrase": "compressed_data"}, {"score": 0.007775437598021928, "phrase": "data_gathering"}, {"score": 0.00481495049065317, "phrase": "energy-efficient_wireless_sensor_networks"}, {"score": 0.004726382602809228, "phrase": "joint_application"}, {"score": 0.004625100791402994, "phrase": "network_coding"}, {"score": 0.0045119929871912405, "phrase": "energy-efficient_data_gathering"}, {"score": 0.004334036641115555, "phrase": "forwarding_trees"}, {"score": 0.004214947028602297, "phrase": "compressed_dataset"}, {"score": 0.004163069673268028, "phrase": "weighted_aggregation"}, {"score": 0.004086443472472481, "phrase": "sensed_measurements"}, {"score": 0.004061214835223812, "phrase": "network_sensors"}, {"score": 0.0038410253293837786, "phrase": "original_measurements"}, {"score": 0.0038055011575934936, "phrase": "aggregation_technique"}, {"score": 0.0035219144770122315, "phrase": "multiple_forwarding_trees"}, {"score": 0.003414467360488913, "phrase": "sensor_networks"}, {"score": 0.003035135667860725, "phrase": "better_network-wide_energy_efficiency"}, {"score": 0.002960795132939529, "phrase": "nc-aware_construction"}, {"score": 0.0028882701690741467, "phrase": "mathematical_model"}, {"score": 0.002817516691031648, "phrase": "nc_operations"}, {"score": 0.0027146141712666673, "phrase": "algorithmic_methods"}, {"score": 0.002450554073692113, "phrase": "studied_scenarios"}, {"score": 0.002331909406363425, "phrase": "performance_gains"}, {"score": 0.002191630834885141, "phrase": "proposed_methods"}, {"score": 0.0021379062257004698, "phrase": "network_nodes"}, {"score": 0.0021049977753042253, "phrase": "extended_network_life_times"}], "paper_keywords": ["Wireless sensor networks", " compressive data gathering", " network coding"], "paper_abstract": "This article investigates the joint application of compressive sensing (CS) and network coding (NC) to the problem of energy-efficient data gathering in wireless sensor networks. We consider the problem of optimally constructing forwarding trees to carry compressed data to projection nodes. Each compressed dataset refers to a weighted aggregation (or sum) of sensed measurements from network sensors collected at one projection node. Projection nodes then forward their received compressed data to the sink, which subsequently recovers the original measurements. This aggregation technique, based on CS, is shown to reduce significantly the number of transmissions in the network. We observe that the presence of multiple forwarding trees gives rise to many-to-many communication patterns in sensor networks that, in turn, can be exploited to perform NC on the compressed data being forwarded on these trees. Such a technique will further reduce the number of transmissions required to gather the measurements, resulting in a better network-wide energy efficiency. This article addresses the problem of NC-aware construction of forwarding/aggregation trees. We present a mathematical model to optimally construct such forwarding trees, which encourage NC operations on the compressed data. Owing to its complexity, we further develop algorithmic methods (both centralized and distributed) for solving the problem and analyze their complexities. We show that our algorithmic methods are scalable and accurate, with worst-case optimality gap not exceeding 3.96% in the studied scenarios. We also show that, when bothNC and compressive data gathering are considered jointly, performance gains (reduction in number of transmissions) of up to 30% may be attained. Finally, we show that the proposed methods distribute the workload of data gathering throughout the network nodes uniformly, resulting in extended network life times.", "paper_title": "Network Coding-Aware Compressive Data Gathering for Energy-Efficient Wireless Sensor Networks", "paper_id": "WOS:000368188500009"}