{"auto_keywords": [{"score": 0.044835251181568475, "phrase": "volumetric_objects"}, {"score": 0.015719716506582538, "phrase": "light_scattering_effects"}, {"score": 0.015276871526900927, "phrase": "real-time_applications"}, {"score": 0.010465424918605066, "phrase": "rendered_images"}, {"score": 0.008756914725856105, "phrase": "proposed_method"}, {"score": 0.003955926499405168, "phrase": "slice-based_methods"}, {"score": 0.003910441483033426, "phrase": "well-known_techniques"}, {"score": 0.0038431888954930083, "phrase": "fast_rendering"}, {"score": 0.003463196032143783, "phrase": "slice_planes"}, {"score": 0.003031650815900696, "phrase": "real-time_rendering_method"}, {"score": 0.0027159094186967247, "phrase": "volumetric_and_polygonal_objects"}, {"score": 0.0022696277881969896, "phrase": "volumetric_object"}, {"score": 0.0022048406330100697, "phrase": "polygonal_objects"}, {"score": 0.0021543421286324945, "phrase": "occlusion_rates"}], "paper_keywords": ["volumetric object", " real-time rendering", " anti-aliasing", " GPU"], "paper_abstract": "Recently, for real-time applications such as games, the rendering of scenes with light scattering effects in the presence of volumetric objects such as smoke, mist, etc., has gained much attention. Slice-based methods are well-known techniques for achieving fast rendering of these effects. However, for real-time applications, it is necessary to reduce the number of slice planes that are used. As a result, aliasing (striped patterns) can appear in the rendered images. In this paper, we propose a real-time rendering method for scenes containing volumetric objects that does not generate aliasing in the rendered images. When a scene consists of volumetric and polygonal objects, the proposed method also does not generate aliasing at the boundaries between the polygonal and the volumetric objects. Moreover, we are able to reduce aliasing at shadows inside a volumetric object that are cast by polygonal objects by interpolating the occlusion rates of light at several locations. The proposed method can be efficiently implemented on a GPU.", "paper_title": "Anti-aliased and real-time rendering of scenes with light scattering effects", "paper_id": "WOS:000249207600034"}