{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "digital_traces"}, {"score": 0.004953145727064234, "phrase": "semantic_augmentation"}, {"score": 0.004390192910013225, "phrase": "rich_digital-traces"}, {"score": 0.0043477114072437316, "phrase": "individuals'_experiences"}, {"score": 0.004141365648080381, "phrase": "human_behavior"}, {"score": 0.0040222701316738295, "phrase": "ontological_approaches"}, {"score": 0.003757480190200645, "phrase": "ontology_models"}, {"score": 0.003721098220825489, "phrase": "well-defined_domains"}, {"score": 0.0035616743422949766, "phrase": "ill-defined_domains"}, {"score": 0.0034760655218366, "phrase": "interdisciplinary_efforts"}, {"score": 0.003409057326528229, "phrase": "main_aspects"}, {"score": 0.003310951184365485, "phrase": "computer_processable_form"}, {"score": 0.0032629585038738856, "phrase": "primary_contribution"}, {"score": 0.0031690434364310435, "phrase": "theory-driven_approach"}, {"score": 0.0028333356794133053, "phrase": "ill-defined_activities"}, {"score": 0.0023431692392929353, "phrase": "case_study"}, {"score": 0.002320449502337321, "phrase": "interpersonal_communication"}, {"score": 0.002220900173110114, "phrase": "proposed_multidisciplinary_approach"}, {"score": 0.0021049977753042253, "phrase": "example_application"}], "paper_keywords": ["design"], "paper_abstract": "Social web content such as blogs, videos, and other user-generated content present a vast source of rich digital-traces of individuals' experiences. The use of digital traces to provide insight into human behavior remains underdeveloped. Recently, ontological approaches have been exploited for tagging and linking digital traces, with progress made in ontology models for well-defined domains. However, the process of conceptualization for ill-defined domains remains challenging, requiring interdisciplinary efforts to understand the main aspects and capture them in a computer processable form. The primary contribution of this article is a theory-driven approach to ontology development that supports semantic augmentation of digital traces. Specifically, we argue that (a) activity theory can be used to develop more insightful conceptual models of ill-defined activities, which (b) can be used to inform the development of an ontology, and (c) that this ontology can be used to guide the semantic augmentation of digital traces for making sense of phenomena. A case study of interpersonal communication is chosen to illustrate the applicability of the proposed multidisciplinary approach. The benefits of the approach are illustrated through an example application, demonstrating how it may be used to assemble and make sense of digital traces.", "paper_title": "Making Sense of Digital Traces: An Activity Theory Driven Ontological Approach", "paper_id": "WOS:000330129200004"}