{"auto_keywords": [{"score": 0.045912844607109565, "phrase": "base_beta"}, {"score": 0.00729811149376515, "phrase": "decimal_numbers"}, {"score": 0.007232317865560045, "phrase": "rational_numbers"}, {"score": 0.004964265981665498, "phrase": "finite_fractional_parts"}, {"score": 0.004814982954830603, "phrase": "renyi"}, {"score": 0.00477143960436485, "phrase": "parry"}, {"score": 0.004437115547184535, "phrase": "real_numbers"}, {"score": 0.004126123386192962, "phrase": "main_differences"}, {"score": 0.003996983218174335, "phrase": "integral_base"}, {"score": 0.0036122910149597363, "phrase": "parry_number"}, {"score": 0.003503497128638099, "phrase": "fractional_part"}, {"score": 0.003257727050827128, "phrase": "pisot_number"}, {"score": 0.0027159094186967247, "phrase": "perron_number_beta"}, {"score": 0.0026548344763838213, "phrase": "finite_or_ultimately_periodic_fractional_parts"}, {"score": 0.0021049977753042253, "phrase": "perron_number"}], "paper_keywords": ["beta-numeration", " beta-integers", " arithmetic automaton", " quasicrystals"], "paper_abstract": "The beta-numeration, born with the works of Renyi and Parry, provides a generalization of the notions of integers, decimal numbers and rational numbers by expanding real numbers in base beta, where beta > 1 is not an integer. One of the main differences with the case of numeration in integral base is that the sets which play the role of integers, decimal numbers and rational numbers in base beta are not stable under addition or multiplication. In particular, a fractional part may appear when one adds or multiplies two integers in base beta. When beta is a Pisot number, which corresponds to the most studied case, the lengths of the finite fractional parts that may appear when one adds or multiplies two integers in base beta are bounded by constants which only depend on beta. We prove that, for any Perron number beta, the set of finite or ultimately periodic fractional parts of the sum, or the product, of two integers in base beta is finite. Additionally, we prove that it is possible to compute this set for the case of addition when beta is a Parry number. As a consequence, we deduce that, when beta is a Perron number, there exist bounds, which only depend on beta, for the lengths of the finite fractional parts that may appear when one adds or multiplies two integers in base beta. Moreover, when beta is a Parry number, the bound associated with the case of addition can be explicitly computed.", "paper_title": "Arithmetics in beta-numeration", "paper_id": "WOS:000253283600006"}