{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "fuzzy_relations"}, {"score": 0.015588521975528449, "phrase": "fuzzy_operators"}, {"score": 0.004714023408114857, "phrase": "essential_tool"}, {"score": 0.004349337717774093, "phrase": "commutative_operation"}, {"score": 0.00337224813954299, "phrase": "fuzzy_consequence_operators"}, {"score": 0.0033295966773779174, "phrase": "dual_case"}, {"score": 0.003301461490509176, "phrase": "fuzzy_interior_operators"}, {"score": 0.0030586736004285216, "phrase": "operator_type"}, {"score": 0.0029817668105720924, "phrase": "particular_case"}, {"score": 0.0028944757265206332, "phrase": "zadeh's_compositional_rule"}, {"score": 0.0025919830205975215, "phrase": "induced_operators"}, {"score": 0.002570064617803693, "phrase": "special_attention"}, {"score": 0.0024632148715152393, "phrase": "fuzzy_preorders"}, {"score": 0.0022916428586256723, "phrase": "transitive_closure"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Permutability", " Fuzzy consequence operator", " Fuzzy closure operator", " Fuzzy interior operator", " Fuzzy preorder", " Indistinguishability relation"], "paper_abstract": "Fuzzy operators are an essential tool in many fields and the operation of composition is often needed. In general, composition is not a commutative operation. However, it is very useful to have operators for which the order of composition does not affect the result. In this paper, we analyze when permutability appears. That is, when the order of application of the operators does not change the outcome. We characterize permutability in the case of the composition of fuzzy consequence operators and the dual case of fuzzy interior operators. We prove that for these cases, permutability is completely connected to the preservation of the operator type. We also study the particular case of fuzzy operators induced by fuzzy relations through Zadeh's compositional rule and the inf--> composition. For this cases, we connect permutability of the fuzzy relations (using the sup-* composition) with permutability of the induced operators. Special attention is paid to the cases of operators induced by fuzzy preorders and similarities. Finally, we use these results to relate the operator induced by the transitive closure of the composition of two reflexive fuzzy relations with the closure of the operator this composition induces. (C) 2015 Elsevier Inc. All rights reserved.", "paper_title": "Permutable fuzzy consequence and interior operators and their connection with fuzzy relations", "paper_id": "WOS:000354341100003"}