{"auto_keywords": [{"score": 0.05007852962010534, "phrase": "common_intervals"}, {"score": 0.04115970230529493, "phrase": "minimum_scenario"}, {"score": 0.015404932087209616, "phrase": "gene_order_data"}, {"score": 0.004756233569671719, "phrase": "comparative_genomics"}, {"score": 0.004621984064678252, "phrase": "signed_permutations"}, {"score": 0.004565609517511076, "phrase": "classical_problem"}, {"score": 0.0045284072672385975, "phrase": "genome_comparison"}, {"score": 0.004054745478848129, "phrase": "second_largely_studied_problem"}, {"score": 0.0040052617265655035, "phrase": "gene_order"}, {"score": 0.003828912548622257, "phrase": "signed_permutation"}, {"score": 0.0034847851398628546, "phrase": "parsimonious_scenarios"}, {"score": 0.003304097742490624, "phrase": "common_interval"}, {"score": 0.003171488536369592, "phrase": "berard"}, {"score": 0.0030069962181403487, "phrase": "perfect_scenario"}, {"score": 0.002898127432512101, "phrase": "polynomial_time"}, {"score": 0.002839352319679885, "phrase": "open_question"}, {"score": 0.0023514343164101332, "phrase": "aforementioned_studies"}], "paper_keywords": ["computational biology", " genome rearrangements", " signed permutations", " sorting by reversals", " common intervals", " perfect sorting"], "paper_abstract": "In comparative genomics, gene order data is often modeled as signed permutations. A classical problem for genome comparison is to detect common intervals in permutations, that is, genes that are colocalized in several species, indicating that they remained grouped during evolution. A second largely studied problem related to gene order is to compute a minimum scenario of reversals that transforms a signed permutation into another. Several studies began to mix the two problems and it was observed that their results are not always compatible: Often, parsimonious scenarios of reversals break common intervals. If a scenario does not break any common interval, it is called perfect. In two recent studies, Berard et al. defined a class of permutations for which building a perfect scenario of reversals sorting a permutation was achieved in polynomial time and stated as an open question whether it is possible to decide, given a permutation, if there exists a minimum scenario of reversals that is perfect. In this paper, we give a solution to this problem and prove that this widens the class of permutations addressed by the aforementioned studies. We implemented and tested this algorithm on gene order data of chromosomes from several mammal species and we compared it to other methods. The algorithm helps to choose among several possible scenarios of reversals and indicates that the minimum scenario of reversals is not always the most plausible.", "paper_title": "Evolution under reversals: Parsimony and conservation of common intervals", "paper_id": "WOS:000246071500013"}