{"auto_keywords": [{"score": 0.04423980606677637, "phrase": "ikk_model"}, {"score": 0.013660662923381434, "phrase": "ligament_properties"}, {"score": 0.00481495049065317, "phrase": "post-operative_knee_-_ligament_parameters"}, {"score": 0.00430907756010007, "phrase": "passive_knee_motion"}, {"score": 0.004101579688745222, "phrase": "insertion_locations"}, {"score": 0.0036703791815812328, "phrase": "unscented_kalman_filter"}, {"score": 0.003558830226733501, "phrase": "simulation_results"}, {"score": 0.0034720284451902083, "phrase": "semi-constrained_tkr_design"}, {"score": 0.002831894638104635, "phrase": "tibial_component"}, {"score": 0.0027457584014804574, "phrase": "forward_kinematics"}, {"score": 0.002518227743688769, "phrase": "kinematically_equivalent_set"}, {"score": 0.0022811346113905295, "phrase": "patient-specific_ct"}, {"score": 0.0021311850321045767, "phrase": "potential_applications"}, {"score": 0.0021049977753042253, "phrase": "kinematic-based_total_knee_replacement"}], "paper_keywords": [""], "paper_abstract": "A motion-based Inverse Kinematics Knee (IKK) model was developed for Total Knee Replacement (TKR) joints. By tracking a sequence of passive knee motion, the IKK model estimated ligament properties such as insertion locations. The formulation of the IKK model embedded a Forward Kinematics Knee (FKK) [1] model in a numerical optimization algorithm known as the Unscented Kalman Filter [2]. Simulation results performed on a semi-constrained TKR design suggested that ligament insertions could be accurately estimated in the medial-lateral (ML) and the proximal-distal (PD) directions, but less reliably in the anterior-posterior (AP) direction for the tibial component. However, the forward kinematics produced by both the true and estimated ligament properties were nearly identical, suggesting that the IKK model recovered a kinematically equivalent set of ligament properties. These results imply that it may not be necessary to use a patient-specific CT or MRI scan to locate ligaments, which considerably widens potential applications of kinematic-based total knee replacement.", "paper_title": "An inverse kinematics model for post-operative knee - Ligament parameters estimation from knee motion", "paper_id": "WOS:000241556300039"}