{"auto_keywords": [{"score": 0.031653507648654204, "phrase": "low_utility-earning_tasks"}, {"score": 0.00481495049065317, "phrase": "oversubscribed_heterogeneous_computing_environment"}, {"score": 0.004000396172153709, "phrase": "oak_ridge_national_laboratory"}, {"score": 0.00396050388346298, "phrase": "utility_functions"}, {"score": 0.003785836059995376, "phrase": "system_owner"}, {"score": 0.00354700018079049, "phrase": "resource_allocation_heuristics"}, {"score": 0.003441891354624516, "phrase": "time-varying_utility"}, {"score": 0.003113441660343867, "phrase": "multiple_heuristics"}, {"score": 0.0029169007179202164, "phrase": "total_utility"}, {"score": 0.002719055901632759, "phrase": "simulation_experiments"}, {"score": 0.0025473475682739784, "phrase": "fast_heuristics"}, {"score": 0.0023390219342052623, "phrase": "allocation_decisions"}, {"score": 0.0023040642263522505, "phrase": "oversubscribed_environment"}, {"score": 0.002158505888557746, "phrase": "high_oversubscription"}, {"score": 0.0021049977753042253, "phrase": "significant_utility"}], "paper_keywords": ["Utility function", " resource management heuristics", " heterogeneous computing"], "paper_abstract": "We model an oversubscribed heterogeneous computing system where tasks arrive dynamically and a scheduler maps the tasks to machines for execution. The environment and workloads are based on those being investigated by the Extreme Scale Systems Center at Oak Ridge National Laboratory. Utility functions that are designed based on specifications from the system owner and users are used to create a metric for the performance of resource allocation heuristics. Each task has a time-varying utility (importance) that the enterprise will earn based on when the task successfully completes execution. We design multiple heuristics, which include a technique to drop low utility-earning tasks, to maximize the total utility that can be earned by completing tasks. The heuristics are evaluated using simulation experiments with two levels of oversubscription. The results show the benefit of having fast heuristics that account for the importance of a task and the heterogeneity of the environment when making allocation decisions in an oversubscribed environment. The ability to drop low utility-earning tasks allow the heuristics to tolerate the high oversubscription as well as earn significant utility.", "paper_title": "Utility Functions and Resource Management in an Oversubscribed Heterogeneous Computing Environment", "paper_id": "WOS:000357929500022"}