{"auto_keywords": [{"score": 0.04882787382338285, "phrase": "deep-drawing_tool"}, {"score": 0.00481495049065317, "phrase": "manufacturing_engineering"}, {"score": 0.004542441734438654, "phrase": "computer-aided_system"}, {"score": 0.003957833102043277, "phrase": "input_data"}, {"score": 0.003597625122515975, "phrase": "best_solution"}, {"score": 0.0035408501923902477, "phrase": "technological_perspective"}, {"score": 0.0034299649219748513, "phrase": "material_waste"}, {"score": 0.0031845067058084583, "phrase": "process_cost"}, {"score": 0.002687235334499192, "phrase": "industrial_case"}, {"score": 0.002603012037901889, "phrase": "proposed_computer-aided_system"}, {"score": 0.0025214217930287003, "phrase": "brass_alloy"}, {"score": 0.002468450551616404, "phrase": "system's_capability"}, {"score": 0.002391067964886602, "phrase": "significant_improvements"}, {"score": 0.0021049977753042253, "phrase": "manufacturing_environment"}], "paper_keywords": ["Engineering education", " Intelligent manufacturing", " Manufacturing planning", " Deep-drawing"], "paper_abstract": "This paper presents a Computer-aided System known as the deep-drawing tool applied to the resolution of a combined deep-drawing and ironing process. The system allows the user for selecting input data for getting the formability of material to deep-drawing, selecting the process that provides the best solution from a technological perspective, optimizing the process for material waste, knowing the influence of the punch in the results and considering the process cost. In this manner, the tool allows developing competencies to students that apply scientific, technological, mathematical, economical and sustainable knowledge, with a global vision of the manufacturing processes and conciliating research and teaching. An industrial case has been considered and the proposed Computer-aided System has been tested with a brass alloy to demonstrate the system's capability. The results obtained show significant improvements in the two variables analyzed, namely, total process time and total manufacturing cost. These aspects provide competencies to students in the manufacturing environment.", "paper_title": "The development of competencies in manufacturing engineering by means of a deep-drawing tool", "paper_id": "WOS:000319363100005"}