{"auto_keywords": [{"score": 0.03733329838869367, "phrase": "technology_performance"}, {"score": 0.01700106720032135, "phrase": "task_performance"}, {"score": 0.008376868237364525, "phrase": "user_attitude"}, {"score": 0.00481495049065317, "phrase": "task-individual-technology_fit"}, {"score": 0.004524348699657099, "phrase": "decision_support_research"}, {"score": 0.004086010164600727, "phrase": "task-technology-individual_fit_model"}, {"score": 0.0033893426032054366, "phrase": "controlled_laboratory_experiment"}, {"score": 0.0032946562900625187, "phrase": "purpose_built_decision_support_system"}, {"score": 0.002215274527909304, "phrase": "necessary_but_not_sufficient_precursor"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Task-individual-technology fit", " Decisional guidance", " Task complexity", " Decision support", " User attitude", " Performance"], "paper_abstract": "Decision support research explores interactions between individuals, tasks, and technology. In this paper, I deconstruct the task-technology-individual fit model into three two-way interactions and ascertain how these interactions affect user attitude and performance. Performance is conceptualized as consisting of two dimensions, technology performance and task performance. The paper reports a controlled laboratory experiment involving 94 subjects using a purpose built decision support system. The results demonstrate several important principles. User attitude is affected by the fit between individual and technology whereas technology performance is affected by the fit between task and technology, and task and individual. Users of technology fitted to them as an individual can perceive it as more useful than it actually is, in terms of improving task performance. Finally, technology performance translates into task performance. Technology performance is a necessary but not sufficient precursor to task performance. (C) 2012 Elsevier B.V. All rights reserved.", "paper_title": "The effect of task-individual-technology fit on user attitude and performance: An experimental investigation", "paper_id": "WOS:000317448900018"}