{"auto_keywords": [{"score": 0.04685354984858258, "phrase": "digital_evidence"}, {"score": 0.021075056988311452, "phrase": "deps"}, {"score": 0.008514639396009485, "phrase": "high_survivability"}, {"score": 0.00481495049065317, "phrase": "tamper_resistance"}, {"score": 0.004367707617503722, "phrase": "secure_way"}, {"score": 0.003961842092184655, "phrase": "generic_storage_systems"}, {"score": 0.003747020072136732, "phrase": "critical_requirements"}, {"score": 0.003712362078915926, "phrase": "digital_evidence_preservation"}, {"score": 0.003610292749660581, "phrase": "secure_distributed_digital_evidence_preservation_system"}, {"score": 0.0034303736977646135, "phrase": "critical_servers"}, {"score": 0.003011706511096639, "phrase": "digital_evidence_file"}, {"score": 0.0029838294169759663, "phrase": "n_shares"}, {"score": 0.0028087949095629955, "phrase": "sequence_number"}, {"score": 0.002488851299416018, "phrase": "original_block"}, {"score": 0.0023103100997344072, "phrase": "intelligent_replication"}, {"score": 0.002164602220179823, "phrase": "distributed_repositories"}, {"score": 0.0021049977753042253, "phrase": "security_and_performance_analyses"}], "paper_keywords": ["digital evidence preservation", " secret recovery scheme", " integrity", " confidentiality", " survivability"], "paper_abstract": "To reduce the chance of being compromised, digital evidence must be preserved in a secure way when it is generated. The preservation must assure confidentiality, integrity, and survivability of the digital evidence. Some generic storage systems have been proposed. However, they cannot meet the critical requirements for digital evidence preservation. This paper introduces a secure distributed digital evidence preservation system (DEPS) which can preserve digital evidence generated by mission critical servers. With the novel and lightweight (n, n, n-1) secret recovery scheme we proposed, DEPS can efficiently divide each block of a digital evidence file into n shares, compress the first n-1 shares, and then construct a share-message with a sequence number and a fingerprint for each share. Only all the n shares combined together suffice for recovering the block. An adversary can neither obtain any information about the original block from a share-message, nor can he modify digital evidence without being discovered. By using intelligent replication, DEPS can dynamically duplicate and distribute each share-message to a set of distributed repositories to achieve high survivability. The security and performance analyses showed that DEPS is adequate for preserving digital evidence.", "paper_title": "Proactive Distributed Digital Evidence Preservation with Tamper Resistance, Perfect Secrecy and High Survivability", "paper_id": "WOS:000345497200010"}