{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "name_disambiguation_problem"}, {"score": 0.005434461930280856, "phrase": "multi-level_graph_partitioning"}, {"score": 0.004747620102130588, "phrase": "non-unique_values"}, {"score": 0.003807242767474929, "phrase": "erroneous_entities"}, {"score": 0.0034494494982242187, "phrase": "masao_obama"}, {"score": 0.003401148484767927, "phrase": "\"norio_obama"}, {"score": 0.0031845067058084583, "phrase": "scalability_issue"}, {"score": 0.002939853413763817, "phrase": "un-distinguishable_due_to_homonyms"}, {"score": 0.0023678143146455017, "phrase": "large-scale_name_disambiguation_problem"}, {"score": 0.0022064376000055764, "phrase": "magnitude_improvement"}, {"score": 0.0021349310877334378, "phrase": "equivalent_or_reasonable_accuracy"}, {"score": 0.0021049977753042253, "phrase": "competing_solutions"}], "paper_keywords": ["Name disambiguation", " Clustering methods", " Mixed entity resolution", " Graph partitioning", " Scalability"], "paper_abstract": "When non-unique values are used as the identifier of entities, due to their homonym, confusion can occur. In particular, when (part of) \"names\" of entities are used as their identifier, the problem is often referred to as a name disambiguation problem, where goal is to sort out the erroneous entities due to name homonyms (e.g., If only last name is used as the identifier, one cannot distinguish \"Masao Obama\" from \"Norio Obama\"). In this paper, in particular, we study the scalability issue of the name disambiguation problem-when (1) a small number of entities with large contents or (2) a large number of entities get un-distinguishable due to homonyms. First, we carefully examine two of the state-of-the-art solutions to the name disambiguation problem and point out their limitations with respect to scalability. Then, we propose two scalable graph partitioning algorithms known as multi-level graph partitioning and multi-level graph partitioning and merging to solve the large-scale name disambiguation problem. Our claim is empirically validated via experimentation-our proposal shows orders of magnitude improvement in terms of performance while maintaining equivalent or reasonable accuracy compared to competing solutions.", "paper_title": "Scalable clustering methods for the name disambiguation problem", "paper_id": "WOS:000303129500006"}