{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "public_displays"}, {"score": 0.004041238873048836, "phrase": "analytical_lens"}, {"score": 0.004005083535629333, "phrase": "understanding_experiences"}, {"score": 0.003951453722517865, "phrase": "public_display"}, {"score": 0.0038119123317396954, "phrase": "social_interaction"}, {"score": 0.002820319063320601, "phrase": "rhythims"}, {"score": 0.002708399936381754, "phrase": "instant_messaging"}, {"score": 0.0026841368358805433, "phrase": "physical_presence"}, {"score": 0.0025089420019955232, "phrase": "different_types"}, {"score": 0.0024093494406195386, "phrase": "performance_perspective"}, {"score": 0.0022019274077124795, "phrase": "participants'_interpretations"}, {"score": 0.0021049977753042253, "phrase": "traditional_notion"}], "paper_keywords": ["Public displays", " Performance", " Groups", " Audiences"], "paper_abstract": "Interacting with public displays involves more than what happens between individuals and the system; it also concerns how people experience others around and through those displays. In this paper, we use \"performance\" as an analytical lens for understanding experiences with a public display called rhythIMs and explore how displays shift social interaction through their mediation. By performance, we refer to a situation in which people are on display and orient themselves toward an audience that may be co-located, imagined, or virtual. To understand interaction with public displays, we use two related notions of collectives-audiences and groups-to highlight the ways in which people orient to each other through public displays. Drawing examples from rhythIMs, a public display that shows patterns of instant messaging and physical presence, we demonstrate that there can be multiple, heterogeneous audiences and show how people experience these different types of collectives in various ways. By taking a performance perspective, we are able to understand how audiences that were not physically co-present with participants still influenced participants' interpretations and interactions with rhythIMs. This extension of the traditional notion of audience illuminates the roles audiences can play in a performance.", "paper_title": "From interaction to performance with public displays", "paper_id": "WOS:000342454500006"}