{"auto_keywords": [{"score": 0.048630131577990954, "phrase": "new_users"}, {"score": 0.014204309601281702, "phrase": "in-world_information_services"}, {"score": 0.00481495049065317, "phrase": "new_users'_experiences"}, {"score": 0.00478218760286811, "phrase": "purpose_-_this_paper"}, {"score": 0.004637478829869904, "phrase": "second_life"}, {"score": 0.004558977045730675, "phrase": "potential_barriers"}, {"score": 0.0042725481832853315, "phrase": "multi-faceted_methodological_approach"}, {"score": 0.0034686643139273934, "phrase": "social_interaction"}, {"score": 0.003386645324034521, "phrase": "control_interface"}, {"score": 0.003352088714126572, "phrase": "negative_responses"}, {"score": 0.00332924643541238, "phrase": "avatar_creation"}, {"score": 0.003239418275717787, "phrase": "graphical_presentation"}, {"score": 0.0032173412933955117, "phrase": "positive_responses"}, {"score": 0.003014948673771347, "phrase": "sample_size"}, {"score": 0.002786858120570499, "phrase": "online_library"}, {"score": 0.002767856819656175, "phrase": "information_services"}, {"score": 0.0026931741608291404, "phrase": "sl"}, {"score": 0.0025409639091476363, "phrase": "virtual_library_services"}, {"score": 0.0023486473525617794, "phrase": "-_previous_studies"}, {"score": 0.0021782980803068505, "phrase": "user's_interaction"}, {"score": 0.0021634370496463793, "phrase": "virtual_worlds"}, {"score": 0.0021049977753042253, "phrase": "current_users"}], "paper_keywords": ["Second Life", " Libraries", " Virtual worlds", " Information services", " Avatars"], "paper_abstract": "Purpose - This paper aims to examine the experiences of new users of Second Life in order to identify potential barriers and attractors to the expansion of the userbase and therefore the market for in-world information services. Design/methodology/approach - A multi-faceted methodological approach was taken utilising two questionnaires (pre- and post-immersion), non-participant overt observation, structured interviews, and online diary keeping. Data was then analysed to identify barriers and attractors. Findings - More negative experiences were recorded than positive, with the costs, time commitment, stigma of using, the lack of structure, social interaction, and the complexity of the control interface all provoking negative responses. Avatar creation, and the creativity and quality of graphical presentation produced positive responses. Research limitations/implications - Due to the investment in time required to participate in the research, the sample size is smaller than ideal thus limiting the conclusions that can be generalised. The research also did not directly include interaction with online library or information services. Practical implications - For librarians using SL the research demonstrates that the response from new users is less than enthusiastic and that when designing virtual library services care should be taken to avoid the barriers identified here and to focus on the features found attractive by participants. Originality/value - Previous studies have examined the implementation of in-world information services without examining the experience of new users. Those studies that have looked directly at the user's interaction with virtual worlds are more focused on MMORPGs and on current users.", "paper_title": "Second Life in the library: an empirical study of new users' experiences", "paper_id": "WOS:000304629800005"}