{"auto_keywords": [{"score": 0.047363369105007026, "phrase": "different_types"}, {"score": 0.00481495049065317, "phrase": "mobile_context-aware_recommendation_systems"}, {"score": 0.004586531354697466, "phrase": "specific_items"}, {"score": 0.004041879818641576, "phrase": "considerable_research_attention"}, {"score": 0.0037392451233558234, "phrase": "concept_of_context-aware_recommendation_system"}, {"score": 0.0030628762739398855, "phrase": "different_context_variables"}, {"score": 0.003003809128328864, "phrase": "relevant_role"}, {"score": 0.0028890603352364273, "phrase": "context-aware_recommendation_systems"}, {"score": 0.0028333356794133053, "phrase": "recommendation_approaches"}, {"score": 0.0025578967205807843, "phrase": "recommendation_systems"}, {"score": 0.0024601402359002056, "phrase": "double_perspective"}, {"score": 0.002366110899738696, "phrase": "existing_techniques"}, {"score": 0.002320449502337321, "phrase": "context_factors"}, {"score": 0.0021049977753042253, "phrase": "different_recommendation_use_cases"}], "paper_keywords": [""], "paper_abstract": "Recommendation systems are specialized in offering suggestions about specific items of different types (e.g., books, movies, restaurants, and hotels) that could be interesting for the user. They have attracted considerable research attention due to their benefits and also their commercial interest. Particularly, in recent years, the concept of context-aware recommendation system has appeared to emphasize the importance of considering the context of the situations in which the user is involved in order to provide more accurate recommendations. The detection of the context requires the use of sensors of different types, which measure different context variables. Despite the relevant role played by sensors in the development of context-aware recommendation systems, sensors and recommendation approaches are two fields usually studied independently. In this paper, we provide a survey on the use of sensors for recommendation systems. Our contribution can be seen from a double perspective. On the one hand, we overview existing techniques used to detect context factors that could be relevant for recommendation. On the other hand, we illustrate the interest of sensors by considering different recommendation use cases and scenarios.", "paper_title": "A Review of the Role of Sensors in Mobile Context-Aware Recommendation Systems", "paper_id": "WOS:000365545400001"}