{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "non-built_environment"}, {"score": 0.03941280956909656, "phrase": "human_settlement"}, {"score": 0.004768378525561471, "phrase": "rapidly_urbanizing_region"}, {"score": 0.004586531354697466, "phrase": "subpixel_classification_technique"}, {"score": 0.004527462929045081, "phrase": "image_data"}, {"score": 0.00436890075128947, "phrase": "greater_toronto_area"}, {"score": 0.004229556887896042, "phrase": "north_american_region"}, {"score": 0.00418862323286423, "phrase": "rapid_urban_development"}, {"score": 0.004121275290411653, "phrase": "large_net_population_increases"}, {"score": 0.003951175193382119, "phrase": "growing_concern"}, {"score": 0.003912925129722523, "phrase": "environmental_consequences"}, {"score": 0.003294875957676514, "phrase": "quantitative_measures"}, {"score": 0.0031485421129798996, "phrase": "built_area"}, {"score": 0.0031180382240585873, "phrase": "gta"}, {"score": 0.0030878280304339587, "phrase": "highly_dispersed_or_\"sprawling\"_pattern"}, {"score": 0.0028750275511802157, "phrase": "york_municipality"}, {"score": 0.0027831968213396056, "phrase": "virtually_all_the_area's_constituent_municipalities"}, {"score": 0.002711842889248926, "phrase": "built_environment"}, {"score": 0.0024842242921857705, "phrase": "built_land"}, {"score": 0.0024283900925346257, "phrase": "substantial_increase"}, {"score": 0.0023970487263732737, "phrase": "large_consumption"}, {"score": 0.0023815296953640383, "phrase": "non-built_land"}, {"score": 0.0023431692392929353, "phrase": "urban_intensification"}, {"score": 0.002246292543825748, "phrase": "urban_and_environmental_specialists"}, {"score": 0.002224510044064184, "phrase": "sprawling_pattern"}, {"score": 0.0022029383047842627, "phrase": "gta's_development"}, {"score": 0.0021049977753042253, "phrase": "recent_government_\"smart_growth\"_initiatives"}], "paper_keywords": ["Remote sensing", " Greater Toronto Area", " Urban sprawl", " Subpixel classifier", " Spectral unmixing"], "paper_abstract": "This paper applies a subpixel classification technique to remotely sensed image data to calculate changes in the built vs. non-built environment for the Greater Toronto Area (GTA) between 1986 and 2001. This North American region has experienced rapid urban development over the past two decades due to large net population increases and its emergence as an important global and regional business/financial services center. Despite its rapid expansion and growing concern about the environmental consequences of such growth, very little quantitative information exists on how much land has been converted to human settlement. The study found that during this period, 56,081 ha were lost to built development of one form or another. Of this, 45,856 ha were classified as suitable for agriculture. In addition, the study provides quantitative measures of the pattern of this growth. Results indicate that in both years the built area of the GTA had a highly dispersed or \"sprawling\" pattern. This pattern of dispersion remained largely unchanged for the region as a whole and for its individual constituent municipalities with one exception, York municipality, which became slightly less dispersed. Moreover, virtually all the area's constituent municipalities experienced a decrease in their population per built environment between the two periods; that is land was used less efficiently for human settlement. However, the fact that the level of dispersion and population per built land did not increase appreciably despite a substantial increase in population and large consumption of non-built land, suggests that some urban intensification may have occurred during the period. Nonetheless, concerns raised by urban and environmental specialists about the sprawling pattern of the GTA's development are justified. The study concludes with a discussion of the feasibility of recent government \"smart growth\" initiatives to encourage more sustainable growth. (c) 2008 Elsevier Ltd. All rights reserved.", "paper_title": "Changes in the built vs. non-built environment in a rapidly urbanizing region: A case study of the Greater Toronto Area", "paper_id": "WOS:000261017400004"}