{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "timed_automata"}, {"score": 0.025596905311607188, "phrase": "real-time_discrete_event_systems"}, {"score": 0.015601773566707966, "phrase": "finite_state_automata"}, {"score": 0.015081719337874985, "phrase": "timing_constraints"}, {"score": 0.009438866245416717, "phrase": "setexp"}, {"score": 0.008485478100002055, "phrase": "discrete_event_systems"}, {"score": 0.003831224748279043, "phrase": "non-real_time_discrete_event_systems"}, {"score": 0.003276893480994257, "phrase": "finite_state_automata_model"}, {"score": 0.0032027739752274, "phrase": "non_real-time"}, {"score": 0.0030017207229983385, "phrase": "special_finite_state_automata"}, {"score": 0.0027918707809612, "phrase": "real_events"}, {"score": 0.0026265643273193934, "phrase": "exp"}, {"score": 0.0024522007854499554, "phrase": "events_order_constraints"}, {"score": 0.002405853977978678, "phrase": "state_space_explosion_problem"}, {"score": 0.0021211305348270413, "phrase": "supervisory_control"}, {"score": 0.0021049977753042253, "phrase": "conformance_testing"}], "paper_keywords": ["Modeling", " Discrete event systems", " Real-time system", " Timed automata", " Finite state automata"], "paper_abstract": "Real-time discrete event systems are discrete event systems with timing constraints, and can be modeled by timed automata. The latter are convenient for modeling real-time discrete event systems. However, due to their infinite state space, timed automata are not suitable for studying real-time discrete event systems. On the other hand, finite state automata, as the name suggests, are convenient for modeling and studying non-real time discrete event systems. To take into account the advantages of finite state automata, an approach for studying real-time discrete event systems is to transform, by abstraction, the timed automata modeling them into finite state automata which describe the same behaviors. Then, studies are performed on the finite state automata model by adapting methods designed for non real-time discrete event systems. In this paper, we present a method for transforming timed automata into special finite state automata called Set-Exp automata. The method, called SetExp, models the passing of time as real events in two types: Set events which correspond to resets with programming of clocks, and Exp events which correspond to the expiration of clocks. These events allow to express the timing constraints as events order constraints. SetExp limits the state space explosion problem in comparison to other transformation methods of timed automata, notably when the magnitude of the constants used to express the timing constraints are high. Moreover, SetExp is suitable, for example, in supervisory control and conformance testing of real-time discrete event systems.", "paper_title": "SetExp: a method of transformation of timed automata into finite state automata", "paper_id": "WOS:000281902000003"}