{"auto_keywords": [{"score": 0.049347793578485864, "phrase": "relation_adaptation"}, {"score": 0.0303672641948502, "phrase": "proposed_mechanism"}, {"score": 0.004621279527317074, "phrase": "distributed_agent_network"}, {"score": 0.004504193207111593, "phrase": "suitable_paradigm"}, {"score": 0.004435363840720883, "phrase": "self-managed_complex_distributed_systems"}, {"score": 0.004278807087784626, "phrase": "sensor_networks"}, {"score": 0.004127753467337283, "phrase": "integrative_self-organisation_mechanism"}, {"score": 0.004023120753104693, "phrase": "current_related_studies"}, {"score": 0.0036678472439508484, "phrase": "resource_exchange"}, {"score": 0.003413284742632989, "phrase": "new_agents"}, {"score": 0.0030640804704319255, "phrase": "better_agent_network_structure"}, {"score": 0.002910545717767559, "phrase": "dynamic_environments"}, {"score": 0.0023211517663846346, "phrase": "individual_agents"}, {"score": 0.0022856052476424344, "phrase": "entire_agent_network"}, {"score": 0.0021049977753042253, "phrase": "simulation_run"}], "paper_keywords": ["Distributed multi-agent system", " self-organisation", " reinforcement learning"], "paper_abstract": "Self-organisation provides a suitable paradigm for developing self-managed complex distributed systems, such as grid computing and sensor networks. In this paper, an integrative self-organisation mechanism is proposed. Unlike current related studies, which propose only a single principle of self-organisation, this mechanism synthesises the three principles of self-organisation: cloning/spawning, resource exchange and relation adaptation. Based on this mechanism, an agent can autonomously generate new agents when it is overloaded, exchange resources with other agents if necessary, and modify relations with other agents to achieve a better agent network structure. In this way, agents can adapt to dynamic environments. The proposed mechanism is evaluated through a comparison with three other approaches, each of which represents state-of-the-art research in each of the three self-organisation principles. Experimental results demonstrate that the proposed mechanism outperforms the three approaches in terms of the profit of individual agents and the entire agent network, the load-balancing among agents, and the time consumption to finish a simulation run.", "paper_title": "Cloning, Resource Exchange, and Relation Adaptation: An Integrative Self-Organisation Mechanism in a Distributed Agent Network", "paper_id": "WOS:000334672900006"}