{"auto_keywords": [{"score": 0.04214132212860405, "phrase": "refs"}, {"score": 0.0418804697419132, "phrase": "eefs"}, {"score": 0.012031223409707224, "phrase": "target_coverage_problem"}, {"score": 0.00769099674619852, "phrase": "wireless_heterogeneous_sensor_networks"}, {"score": 0.007641850271257148, "phrase": "multiple_sensing_units"}, {"score": 0.00481495049065317, "phrase": "target_coverage"}, {"score": 0.004372207937638619, "phrase": "set_cover_problem"}, {"score": 0.004288648163837944, "phrase": "integer_programming"}, {"score": 0.004139563711762907, "phrase": "ip_problem"}, {"score": 0.004099807729119934, "phrase": "np-complete_problem"}, {"score": 0.0038676948070704444, "phrase": "network_lifetime"}, {"score": 0.0036749658368075027, "phrase": "neighbors'_decisions"}, {"score": 0.003603343777147985, "phrase": "ip_solution"}, {"score": 0.0035017626442279386, "phrase": "sensing_attributes"}, {"score": 0.0031793840887737687, "phrase": "best_use"}, {"score": 0.0031488204239389305, "phrase": "sensing_units"}, {"score": 0.002831350132465098, "phrase": "remaining_energy"}, {"score": 0.0027416032255956585, "phrase": "better_decision"}, {"score": 0.002629160426591144, "phrase": "required_attributes"}, {"score": 0.002554021496818708, "phrase": "first_paper"}, {"score": 0.0024730434312323296, "phrase": "simulation_results"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Multiple sensing units", " Sensor", " Target coverage", " Wireless sensor network (WSN)", " Wireless heterogeneous sensor network (WHSN)"], "paper_abstract": "The paper considers the target coverage problem in wireless heterogeneous sensor networks (WHSNs) with multiple sensing units. This kind of target coverage problem can be reduced to a set cover problem and be further formulated as integer programming (IP) constraints. However, to solve the IP problem is an NP-complete problem. Therefore, two heuristic but distributed schemes, REFS and EEFS, are proposed in the paper to solve the target coverage problem. In REFS (remaining energy first scheme), each sensor considers its remaining energy and neighbors' decisions to enable its sensing units as well as to ensure every target being covered by the sensing attributes which are required to be covered at each target. The advantages of REFS are its simplicity and less communication overhead incurred. However, in order to make the best use of the sensing units on each sensor, another scheme, called EEFS (energy efficient first scheme), is proposed as well. Different from REFS, a sensor in EEFS considers its sensing capabilities and remaining energy as well as those of its neighbors to make a better decision to turn on its sensing units and to ensure each target being covered by required attributes. To our best knowledge, this paper is the first paper to solve the problem for WHSNs with multiple sensing units. Simulation results show that REFS and EEFS can prolong the network lifetime effectively. Furthermore, EEFS outperforms REFS in network lifetime. On the other hand, compared with the performance obtained from the IP solution, the difference between EEFS and the IP solution can be confined within 10%. (C) 2009 Elsevier Ltd. All rights reserved.", "paper_title": "On target coverage in wireless heterogeneous sensor networks with multiple sensing units", "paper_id": "WOS:000266359600008"}