{"auto_keywords": [{"score": 0.03992659287798474, "phrase": "pca"}, {"score": 0.00481495049065317, "phrase": "principal_component_analysis_for_bar_charts"}, {"score": 0.004623503587186056, "phrase": "symbolic_data"}, {"score": 0.004200582085706493, "phrase": "challenging_task"}, {"score": 0.004139028737420222, "phrase": "complex_and_massive_amounts"}, {"score": 0.004003798249233137, "phrase": "traditional_techniques"}, {"score": 0.003830312347175889, "phrase": "standard_principal_component_analysis"}, {"score": 0.0033288399506044763, "phrase": "different_bar_charts"}, {"score": 0.003267925215811654, "phrase": "standard_pca"}, {"score": 0.0030017207229983385, "phrase": "'copular_pca"}, {"score": 0.0028398718024224166, "phrase": "theoretical_results"}, {"score": 0.0026966744704447275, "phrase": "correlation_sphere"}, {"score": 0.0025137856138000014, "phrase": "x_metabins_or_individuals_x_variables"}, {"score": 0.0021522261505574035, "phrase": "simple_examples"}, {"score": 0.0021049977753042253, "phrase": "wiley_periodicals"}], "paper_keywords": ["principal component analysis", " symbolic data analysis", " copulas", " compositional data", " metabins"], "paper_abstract": "In recent years, the analysis of symbolic data where the units are categories, classes, or concepts described by intervals, distributions, sets of categories, and the like becomes a challenging task since many application fields generate complex and massive amounts of data that are difficult to analyze with traditional techniques. In this article, we propose a strategy for extending standard principal component analysis (PCA) to such data in the case where the variables values are 'bar charts' (i.e., a set of categories called bins with their relative frequencies). First, we introduce 'metabins' which mix together bins of the different bar charts and enhance interpretability. Standard PCA applied on the bins of such data tables can lose the bar chart constraints and suppose independencies between the bins. Therefore, we introduce a 'Copular PCA' as copulas take care of the probabilities and the underlying dependencies. Some theoretical results lead to the representation of the bar chart variables inside a hypercube covering the correlation sphere of a PCA applied on the bins. We give several ways for representing individuals and pathways of individuals x metabins or individuals x variables. Several tools of interpretation of such representations based on 'coherency' of metabins (or variables) among a trajectory (i.e., oriented pathway) of individuals and 'diversity' of individuals among a trajectory of metabins (or variables) are illustrated by some simple examples. (C) 2013 Wiley Periodicals, Inc.", "paper_title": "Principal Component Analysis for Bar Charts and Metabins Tables", "paper_id": "WOS:000209525500002"}