{"auto_keywords": [{"score": 0.0456315961504987, "phrase": "complex_data_types"}, {"score": 0.00481495049065317, "phrase": "non-timestamped_set_subsequence_queries"}, {"score": 0.004586531354697466, "phrase": "database_management_systems_data"}, {"score": 0.004104132253183181, "phrase": "efficient_querying"}, {"score": 0.003909301559145041, "phrase": "commercially_available_database_management_systems"}, {"score": 0.003401954670986958, "phrase": "non-timestamped_sequences"}, {"score": 0.003308649946463136, "phrase": "categorical_data"}, {"score": 0.0031955979242589494, "phrase": "set_subsequence_queries"}, {"score": 0.002761340122199076, "phrase": "logical_structure"}, {"score": 0.0025937408242280757, "phrase": "set_subsequence_query_execution"}, {"score": 0.002505054869094183, "phrase": "index_structure"}, {"score": 0.0021049977753042253, "phrase": "shelf\"_database_management_systems"}], "paper_keywords": [""], "paper_abstract": "In many recent applications of database management systems data may be stored in user defined complex data types (such as sequences). However, efficient querying of such data is not supported by commercially available database management systems and therefore efficient indexing schemes for complex data types need to be developed. In this paper we focus primarily on the indexing of non-timestamped sequences of sets of categorical data, specifically indexing for set subsequence queries. We address both: logical structure and implementation issues of such indexes. Our main contributions are threefold. First, we specify the logical structure of the index and we propose algorithms for set subsequence query execution, which utilize the index structure. Second, we provide the proposition for the implementation of such index, which uses means available in all of the \"of the shelf\" database management systems. Finally, we experimentally evaluate the performance of the index.", "paper_title": "AISS: An index for non-timestamped set subsequence queries", "paper_id": "WOS:000241158200048"}