{"auto_keywords": [{"score": 0.04533113884840749, "phrase": "shared_secret"}, {"score": 0.027551748183906013, "phrase": "proxy_signature"}, {"score": 0.00481495049065317, "phrase": "previously_proposed_threshold_proxy_signature_schemes"}, {"score": 0.0042550030421781605, "phrase": "proxy_group"}, {"score": 0.004012885020428863, "phrase": "proxy_signers"}, {"score": 0.003569050665799723, "phrase": "existing_threshold_proxy_signature_schemes"}, {"score": 0.0033006894756949776, "phrase": "proxy_signatures"}, {"score": 0.003133062566725785, "phrase": "schnorr"}, {"score": 0.0023982749733789882, "phrase": "group_signers"}, {"score": 0.0022468671200629024, "phrase": "fair_distribution"}, {"score": 0.0021890091360065897, "phrase": "document's_signers"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["proxy signature", " threshold proxy signature scheme", " discrete logarithm", " Lagrange interpolation"], "paper_abstract": "All previously proposed threshold proxy signature schemes have been based oil discrete logarithms required for a protocol to generate and verify a shared secret among the proxy group. Therefore, it is necessary for the proxy signers to perform many expensive modular exponential computations and communications to obtain and verify a shared secret. Moreover, most of the existing threshold proxy signature schemes reveal that the receiver cannot find Out who signed the proxy signatures. We propose an efficient (t,n) threshold proxy signature scheme based on Schnorr's scheme. Compared With existing (t,n) threshold proxy signature schemes, Our scheme can reduce the amount of computations and communications. In our method, not only the original signer can know who generated the proxy signature, but also the receiver can certify the actuality of the group signers who made the proxy signature. We offer convenience and fair distribution of auditing a document's signers. (c) 2005 Elsevier Inc. All rights reserved.", "paper_title": "A novel efficient (t, n) threshold proxy signature scheme", "paper_id": "WOS:000236435000003"}