{"auto_keywords": [{"score": 0.029282631444614408, "phrase": "clapte"}, {"score": 0.02125765754563985, "phrase": "common_ancestry"}, {"score": 0.006747469342650242, "phrase": "case_studies"}, {"score": 0.006555865919781945, "phrase": "dnaj"}, {"score": 0.004594326191526569, "phrase": "drug_resistance"}, {"score": 0.004336556638639097, "phrase": "apparent_associations"}, {"score": 0.004305364955542171, "phrase": "biologically_unrelated_features"}, {"score": 0.004258995791471342, "phrase": "novel_method"}, {"score": 0.003808024029417427, "phrase": "phylogenetic_trees"}, {"score": 0.0036333693364337953, "phrase": "phylogenetic_tree"}, {"score": 0.0035683401689358993, "phrase": "associated_character-pair"}, {"score": 0.0033196177202591843, "phrase": "character-pair_associations"}, {"score": 0.0032134045046357876, "phrase": "gene_trees"}, {"score": 0.003178758306417406, "phrase": "hiv_env"}, {"score": 0.0031558679589831287, "phrase": "hiv_promoter"}, {"score": 0.0030328769643087066, "phrase": "oseltamavir_resistance"}, {"score": 0.0030110445431514275, "phrase": "influenza"}, {"score": 0.0029464414592923196, "phrase": "guab._simulated"}, {"score": 0.002558985036330194, "phrase": "new_permissive_mutations"}, {"score": 0.002423882939663573, "phrase": "guab_case_study"}, {"score": 0.0022876085523721324, "phrase": "different_families"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Phylogenetics", " Correlated evolution", " Genotype-phenotype association", " Genetic simulation", " Drug resistance", " Influenza evolution", " HIV evolution", " Protein evolution"], "paper_abstract": "Background: Associations between genotype and phenotype provide insight into the evolution of pathogenesis, drug resistance, and the spread of pathogens between hosts. However, common ancestry can lead to apparent associations between biologically unrelated features. The novel method Cladograms with Path to Event (ClaPTE) detects associations between character-pairs (either a pair of mutations or a mutation paired with a phenotype) while adjusting for common ancestry, using phylogenetic trees. Methods: ClaPTE tests for character-pairs changing close together on the phylogenetic tree, consistent with an associated character-pair. ClaPTE is compared to three existing methods (independent contrasts, mixed model, and likelihood ratio) to detect character-pair associations adjusted for common ancestry. Comparisons utilize simulations on gene trees for: HIV Env, HIV promoter, and bacterial DnaJ and GuaB; and case studies for Oseltamavir resistance in Influenza, and for Dnaj and GuaB. Simulated data include both true-positive/associated character-pairs,and true-negative/not-associated character-pairs, used to assess type I (frequency of p-values in true-negatives) and type II (sensitivity to true-positives) error control. Results and conclusions: ClaPTE has competitive sensitivity and better type I error control than existing methods. In the Influenza/Oseltamavir case study, ClaPTE reports no new permissive mutations but detects associations between adjacent (in primary sequence) amino acid positions which other methods miss. In the Dnaj and GuaB case study, ClaPTE, reports more frequent associations between positions both from the same protein family than between positions from different families, in contrast to other methods. In both case studies, the results from ClaPTE are biologically plausible. (C) 2015 Elsevier Ltd. All rights reserved.", "paper_title": "Cladograms with Path to Event (ClaPTE): A novel algorithm to detect associations between genotypes or phenotypes using phylogenies", "paper_id": "WOS:000350941300001"}