{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "boundary_surfaces"}, {"score": 0.011119438929128986, "phrase": "boundary_surface"}, {"score": 0.006651068110975078, "phrase": "zero-value_isosurface"}, {"score": 0.005685230497508747, "phrase": "discrete_samplings"}, {"score": 0.004647105813224402, "phrase": "new_method"}, {"score": 0.0039310261964323545, "phrase": "novel_computational_framework"}, {"score": 0.0030811340338342454, "phrase": "zerovalue_isosurface"}, {"score": 0.0029285940369182277, "phrase": "complex_problem"}, {"score": 0.002632332114727894, "phrase": "proposed_technique"}, {"score": 0.0025275050635202878, "phrase": "complex_boundary_surfaces"}, {"score": 0.002426842369975213, "phrase": "vital_limitations"}, {"score": 0.0023780209525032688, "phrase": "isosurface-extracting_method"}, {"score": 0.00217017119491777, "phrase": "proposed_computational_framework"}], "paper_keywords": ["adaptive approximation", " boundary surfaces", " isosurface", " medical visualization", " three-dimensional edge detection", " 3-D image analysis"], "paper_abstract": "We propose a new method for detecting and approximating the boundary surfaces in three-dimensional (3-D) biomedical images. Using this method, each boundary surface in the original 3-D image is normalized as a zero-value isosurface of a new 3-D image transformed from the original 3-D image. A novel computational framework is proposed to perform such an image transformation. According to this framework, we first detect boundary surfaces from the original 3-D image and compute discrete samplings of the boundary surfaces. Based on these discrete samplings, a new 3-D image is constructed for each boundary surface such that the boundary surface can be well approximated by a zerovalue isosurface in the new 3-D image. In this way, the complex problem of reconstructing boundary surfaces in the original 3-D image is converted into a task to extract a zero-value isosurface from the new 3-D image. The proposed technique is not only capable of adequately reconstructing complex boundary surfaces in 3-D biomedical images, but it also overcomes vital limitations encountered by the isosurface-extracting method when the method is used to reconstruct boundary surfaces from 3-D images. The performances and advantages of the proposed computational framework are illustrated by many examples from different 3-D biomedical images.", "paper_title": "A computational framework for approximating boundary surfaces in 3-D biomedical images", "paper_id": "WOS:000250929100008"}