{"auto_keywords": [{"score": 0.03564427236668897, "phrase": "dss-mde"}, {"score": 0.023010562283732723, "phrase": "constrained_optimization"}, {"score": 0.019800038888548428, "phrase": "comparison_probability"}, {"score": 0.010612387000973441, "phrase": "dynamic_stochastic_selection"}, {"score": 0.009650643740091253, "phrase": "stochastic_ranking"}, {"score": 0.005527641740611935, "phrase": "experimental_results"}, {"score": 0.00459039896577789, "phrase": "promising_infeasible_solutions"}, {"score": 0.004525088883501587, "phrase": "evolution_process"}, {"score": 0.004252602474733162, "phrase": "effective_technique"}, {"score": 0.003977403701783668, "phrase": "feasible_solution"}, {"score": 0.003809932244103758, "phrase": "final_solutions"}, {"score": 0.0036495094280143744, "phrase": "dss"}, {"score": 0.00349577373145384, "phrase": "multimember_differential_evolution"}, {"score": 0.003413183361838603, "phrase": "simple_version"}, {"score": 0.0027259252868643926, "phrase": "current_available_results"}, {"score": 0.002350041573006264, "phrase": "square_root_adjusted_comparison_probability"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["constrained optimization", " differential evolution", " dynamic stochastic selection", " stochastic ranking"], "paper_abstract": "How much attention should be paid to the promising infeasible solutions during the evolution process is investigated in this paper. Stochastic ranking has been demonstrated as an effective technique for constrained optimization. In stochastic ranking, the comparison probability will affect the position of feasible solution after ranking, and the quality of the final solutions. In this paper, the dynamic stochastic selection (DSS) is put forward within the framework of multimember differential evolution. Firstly, a simple version named DSS-MDE is given, where the comparison probability decreases linearly. The algorithm DSS-MDE has been compared with two state-of-the-art evolution strategies and three competitive differential evolution algorithms for constrained optimization on 13 common benchmark functions. DSS-MDE is also evaluated on four well-studied engineering design examples, and the experimental results are significantly better than current available results. Secondly, other dynamic settings of the comparison probability for DSS-MDE are also designed and tested. From the experimental results, DSS-MDE is effective for constrained optimization. Finally, DSS-MDE with a square root adjusted comparison probability is evaluated on the 22 benchmark functions in CEC'06, and the experimental results on most functions are competitive. (c) 2008 Published by Elsevier Inc.", "paper_title": "Differential evolution with dynamic stochastic selection for constrained optimization", "paper_id": "WOS:000257404100005"}