{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "kerberos"}, {"score": 0.007353059034512075, "phrase": "user_privacy"}, {"score": 0.004187614134377688, "phrase": "reliable_and_scalable_solution"}, {"score": 0.004072275820209647, "phrase": "secure_service_acquisition"}, {"score": 0.0038725824361608243, "phrase": "security_and_privacy_issues"}, {"score": 0.003149094460617212, "phrase": "user_anonymity"}, {"score": 0.0031140747752837826, "phrase": "service_access_untraceability"}, {"score": 0.002895721231882758, "phrase": "single-realm_and_cross-realm_scenarios"}, {"score": 0.002707741309851526, "phrase": "privakerb"}, {"score": 0.0025604233506352375, "phrase": "future_implementations"}, {"score": 0.0023941575109692336, "phrase": "service_time"}, {"score": 0.0023675132064088803, "phrase": "resource_utilization"}, {"score": 0.002251227801482381, "phrase": "lightweight_solution"}, {"score": 0.0022261705957258506, "phrase": "negligible_overhead"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Identity", " Kerberos", " Network Federation", " Privacy", " Security"], "paper_abstract": "Kerberos is one of the most well-respected and widely used authentication protocols in open and insecure networks. It is envisaged that its impact will increase as it comprises a reliable and scalable solution to support authentication and secure service acquisition in the Next Generation Networks (NGN) era. This means however that security and privacy issues related to the protocol itself must be carefully considered. This paper proposes a novel two-level privacy framework, namely PrivaKERB, to address user privacy in Kerberos. Our solution offers two privacy levels to cope with user anonymity and service access untraceability. We detail how these modes operate in preserving user privacy in both single-realm and cross-realm scenarios. By using the extensibility mechanisms already available in Kerberos, PrivaKERB does not change the semantics of messages and enables future implementations to maintain interoperability. We also evaluate our solution in terms of service time and resource utilization. The results show that PrivaKERB is a lightweight solution imposing negligible overhead in both the participating entities and network. (C) 2011 Elsevier Ltd. All rights reserved.", "paper_title": "PrivaKERB: A user privacy framework for Kerberos", "paper_id": "WOS:000295072900007"}