{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "subsuming_rules"}, {"score": 0.00467207889925365, "phrase": "intelligent_agents"}, {"score": 0.004552981066668676, "phrase": "nonmonotonic_reasoning"}, {"score": 0.004379977556546879, "phrase": "general_rules"}, {"score": 0.004141575435071002, "phrase": "knowledge_base_f"}, {"score": 0.004088421020408183, "phrase": "general_rule"}, {"score": 0.003865826699096508, "phrase": "evolving_knowledge"}, {"score": 0.003531474887552889, "phrase": "belief_revision"}, {"score": 0.0033971539563683174, "phrase": "extra_information"}, {"score": 0.0032820385246266773, "phrase": "extra_knowledge"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Dynamics of knowledge", " Logic", " Default reasoning", " lmplicants", " Nonmonotonic reasoning"], "paper_abstract": "This paper is concerned with intelligent agents that are able to perform nonmonotonic reasoning, not only with, but also about general rules with exceptions. More precisely, the focus is on enriching a knowledge base F with a general rule that is subsumed by other rules already there. Such a problem is important because evolving knowledge needs not follow logic as it is well-known from e.g., the belief revision paradigm. However, belief revision is mainly concerned with the case that the extra information logically conflicts with F. Otherwise, the extra knowledge is simply doomed to extend Gamma with no change altogether. The problem here is different and may require a change in Gamma even though no inconsistency arises. The idea is that when a rule is to be added, it might need to override any rule that subsumes it: preemption must take place. A formalism dedicated to reasoning with and about rules with exceptions is introduced. An approach to dealing with preemption over such rules is then developed. Interestingly, it leads us to introduce several implicants concepts for rules that are possibly defeasible. (C) 2012 Elsevier Inc. All rights reserved.", "paper_title": "Overriding subsuming rules", "paper_id": "WOS:000317379500003"}