{"auto_keywords": [{"score": 0.03771465750530587, "phrase": "growth_factor-beta"}, {"score": 0.004814959072276036, "phrase": "tgf"}, {"score": 0.00466684417181804, "phrase": "chain_a_structures"}, {"score": 0.004219774794569897, "phrase": "homology_modeling"}, {"score": 0.004190563478825626, "phrase": "molecular_dynamics"}, {"score": 0.0040899006497687115, "phrase": "structural_rationality"}, {"score": 0.003991646181215783, "phrase": "procheck"}, {"score": 0.003855347387268162, "phrase": "nvap"}, {"score": 0.0037889466472096284, "phrase": "modeled_structure"}, {"score": 0.0037366473207825234, "phrase": "stable_conformation"}, {"score": 0.003621588555525458, "phrase": "extracellular_domains"}, {"score": 0.003086396772496527, "phrase": "active_center"}, {"score": 0.002849146732780381, "phrase": "\"pre-helix_extension"}, {"score": 0.002770961604021066, "phrase": "key_domain"}, {"score": 0.0023611760395203106, "phrase": "tethering_t_beta_ri-ed"}], "paper_keywords": ["Docking", " Hepatic fibrosis", " Molecular dynamics", " Natural velvet antler polypeptide", " Transforming growth factor-beta 1"], "paper_abstract": "Based on the chain A structures of hemoglobin (PDB code: 1HDS, 1IBE, 1FAW, 3AT5), the three dimensional (3D) structure of natural velvet antler polypeptide (nVAP) was constructed by homology modeling and molecular dynamics (MD) method. The structural rationality was further checked by Profile-3D and Procheck, both of which confirmed that the 3D structure of nVAP was reasonable. The modeled structure indicates that the stable conformation of nVAP is composed of two alpha-helixes. The extracellular domains of transforming growth factor-beta 1 receptor I (T beta RI-ED) and II (T beta RII-ED) were docked with nVAP, respectively. The results show that both of T beta R-EDs have high affinity with nVAP which locates near the active center of T beta RII-ED integrating with transforming growth factor-beta 1 (TGF-beta 1). Otherwise, nVAP can also insert near the \"pre-helix extension\" of T beta RI-ED, which is the key domain to interact on TGF-beta 1 and T beta RII-ED. With the perturbation of nVAP, T beta RI-ED can not be recruited by TGF-beta 1:T beta RII-ED complex rigorously. The intracellular domain of T beta RI (T beta RI-ID) is not phosphorylated and activated by T beta RII. This study shows that nVAP prefers tethering T beta RI-ED which is more crucial in TGF-beta 1:T beta RII-ED:T beta RI-ED complex. Thus nVAP can disturb the TGF-beta 1 binding pattern by interacting on T beta Rs (T beta RI and T beta RII), further intercepting TGF-beta 1 pathway downstream.", "paper_title": "Natural velvet antler polypeptide conformation prediction and molecular docking study with TGF-beta 1 complex", "paper_id": "WOS:000323283100022"}