{"auto_keywords": [{"score": 0.03106546540489402, "phrase": "majority_color"}, {"score": 0.008782960627163584, "phrase": "minimum_number"}, {"score": 0.00481495049065317, "phrase": "triple_queries"}, {"score": 0.004724158990345732, "phrase": "well-known_problem"}, {"score": 0.004670504053818028, "phrase": "efficient_diagnostic_techniques"}, {"score": 0.004582423717777699, "phrase": "fault-tolerant_computer_systems"}, {"score": 0.004478907336898875, "phrase": "computing_majority"}, {"score": 0.004444921827311577, "phrase": "restricted_tests"}, {"score": 0.003604576287781528, "phrase": "computation_model"}, {"score": 0.003264422557779248, "phrase": "individual_balls"}, {"score": 0.0023335099338323974, "phrase": "upper_and_lower_bounds"}, {"score": 0.0022120914337992034, "phrase": "surprising_difference"}, {"score": 0.002129243122440408, "phrase": "double_versus_triple_queries"}], "paper_keywords": ["Search", " Balls", " Colors", " Computation models", " Queries", " Pairing model", " General model"], "paper_abstract": "Motivated from the well-known problem of establishing efficient diagnostic techniques for detecting faults in fault-tolerant computer systems we study a problem for computing majority with restricted tests in a set of items of two types (e.g., faulty and non-faulty). Stated in a more abstract form, consider a bin containing n balls colored with two colors. In a k-query, k balls are selected by a questioner and an oracle gives an answer which (depending on the computation model being considered) is related to the distribution of colors of the balls in this k-tuple. The oracle never reveals the colors of the individual balls. Following a number of queries and answers the questioner is said to determine majority if either (1) it can output a ball of the majority color provided that such a color exists, or (2) otherwise can determine that there is no majority color. We investigate the minimum number of queries required to determine majority in two computation models. We give algorithms to compute the minimum number of 3-queries which are needed so that the questioner can determine the majority color and provide tight and almost tight upper and lower bounds on the number of queries needed in each case. Our results indicate a surprising difference between the number of queries to determine majority with double versus triple queries. (c) 2012 Elsevier B.V. All rights reserved.", "paper_title": "Computing majority with triple queries", "paper_id": "WOS:000311018600003"}