{"auto_keywords": [{"score": 0.04850161465082996, "phrase": "peer_assessment"}, {"score": 0.035255523859299615, "phrase": "anonymous_peer_assessment"}, {"score": 0.0180404758044083, "phrase": "crt"}, {"score": 0.004553510708976456, "phrase": "promising_assessment_form"}, {"score": 0.004370814742381778, "phrase": "undesirable_social_effects"}, {"score": 0.004211069233133584, "phrase": "peer_pressure"}, {"score": 0.004102719715406821, "phrase": "previous_research"}, {"score": 0.0039822874870125095, "phrase": "important_factor"}, {"score": 0.003923398381490749, "phrase": "higher_education"}, {"score": 0.003865376734263166, "phrase": "current_research"}, {"score": 0.003779943062894615, "phrase": "secondary_education"}, {"score": 0.0037518852820756323, "phrase": "classroom_response_technology"}, {"score": 0.0035744997458371335, "phrase": "face-to-face_settings"}, {"score": 0.00353476609156032, "phrase": "quasi-experimental_study"}, {"score": 0.0034309482755326016, "phrase": "traditional_non-anonymous_peer_assessment"}, {"score": 0.0028795712616923462, "phrase": "teachers'_experiences"}, {"score": 0.002847540262784593, "phrase": "peer_assessment_interventions"}, {"score": 0.0024620842899061614, "phrase": "crt._teachers"}, {"score": 0.002398627220761343, "phrase": "objective_way"}, {"score": 0.0021687806803474367, "phrase": "future_research"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Peer assessment", " Anonymity", " Computer-assisted learning", " Secondary education"], "paper_abstract": "Peer assessment has proven to be a promising assessment form, but there is only limited research about how to decrease the undesirable social effects that are inherent to the process, such as peer pressure and fear of disapproval. In previous research, anonymity has proven to be an important factor in peer assessment in higher education. In the current research, peer assessment was studied in secondary education and classroom response technology (CRT) was introduced as a tool that enables anonymity within face-to-face settings. A quasi-experimental study was set up in four classes to compare traditional non-anonymous peer assessment (raising score cards) with anonymous peer assessment (giving scores using CRT). It was questioned whether students felt more positive towards anonymous peer assessment, and reported to feel less negative social effects. Subsequently, the hypothesis that anonymous peer assessment would be a more valid methodology is verified. Finally, teachers' experiences with both peer assessment interventions were studied. Although some concerns were raised about the validity of anonymous peer assessment, it has been found that pupils felt more positive towards peer assessment and experienced less peer pressure and fear of disapproval when scores were given anonymously using CRT. Teachers reported that using CRT was an objective way of assessing but raised some concerns with regard to the control of the teacher, and the classroom characteristics. In this regard, implications for future research are discussed. (C) 2014 Elsevier Ltd. All rights reserved.", "paper_title": "What if pupils can assess their peers anonymously? A quasi-experimental study", "paper_id": "WOS:000347606300012"}