{"auto_keywords": [{"score": 0.030930835564620236, "phrase": "proposed_scheme"}, {"score": 0.013414193606595973, "phrase": "la"}, {"score": 0.00481495049065317, "phrase": "secure_decentralized_public_key_infrastructure"}, {"score": 0.004611554879923759, "phrase": "efficient_decentralized_public_key_infrastructure"}, {"score": 0.0045550345816439694, "phrase": "pki"}, {"score": 0.00438955582974973, "phrase": "bayesian_coalition_game"}, {"score": 0.004335808329438901, "phrase": "bcg"}, {"score": 0.0037159680715717056, "phrase": "information_sharing"}, {"score": 0.0032240802202623316, "phrase": "symmetric_key_encryption"}, {"score": 0.0031845067058084583, "phrase": "hash-based_message_authentication"}, {"score": 0.002831894638104635, "phrase": "misbehaving_vehicles"}, {"score": 0.0023819914954155905, "phrase": "reinforcement_signal"}], "paper_keywords": ["Vehicular Ad Hoc networks", " Learning Automata", " Security", " Bayesian Coalition Game"], "paper_abstract": "This paper proposed an efficient decentralized public key infrastructure (PKI) using the concepts of Bayesian Coalition Game (BCG) and Learning Automata (LA). LA are assumed as the players in the game, which coordinate among one another for information sharing. To preserve the confidentiality and integrity of the messages, dynamic coalition among the players of the game is formulated using symmetric key encryption and hash-based message authentication. Also, privacy preservation and certificate. revocation are included in the proposed scheme to defend against the misbehaving vehicles. For each action taken by an automaton, its action may be rewarded/penalized by the environment in which it operates. LA update their actions probability matrices by getting the reinforcement signal from the environment. The performance of the proposed scheme is evaluated with respect to various metrics in comparison to the other state-of-the-art existing schemes. The results obtained prove the superiority of the proposed scheme. (C) 2014 Elsevier Inc. All rights reserved.", "paper_title": "An intelligent approach for building a secure decentralized public key infrastructure in VANET", "paper_id": "WOS:000353668500009"}