{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "dedicated_e-book_readers"}, {"score": 0.015210110197274992, "phrase": "media_richness"}, {"score": 0.005284188491211669, "phrase": "users'_attitudes"}, {"score": 0.004549821572786755, "phrase": "rapid_pace"}, {"score": 0.004459758783346486, "phrase": "information_technology"}, {"score": 0.004415395176043526, "phrase": "dedicated_electronic_book"}, {"score": 0.004270665568018583, "phrase": "new_trend"}, {"score": 0.003995226376780718, "phrase": "new_device"}, {"score": 0.003687960013746783, "phrase": "causal_model"}, {"score": 0.0032597581672236453, "phrase": "dedicated_e-book_reader_acceptance"}, {"score": 0.003173898798475791, "phrase": "previous_theories"}, {"score": 0.003131818247415968, "phrase": "innovation_diffusion_theory"}, {"score": 0.0028715299874549245, "phrase": "current_and_future_research"}, {"score": 0.0027587851842693725, "phrase": "dominant_factors"}, {"score": 0.002438203996977464, "phrase": "product_development"}, {"score": 0.002183776628088228, "phrase": "e-book_hardware"}, {"score": 0.0021049977753042253, "phrase": "related_theories"}], "paper_keywords": ["Compatibility", " Convenience", " Intention to use", " Media richness", " Electronic books", " Portable computers"], "paper_abstract": "Purpose - Due to the rapid pace of development and innovation in information technology, the dedicated electronic book (e-book) reader has become a new trend in reading. However, at present there is only a limited understanding of what factors drive user attitudes/willingness to use this new device for reading. Hence, this paper aims to explore what factors drive users to use dedicated e-book readers for reading. Design/methodology/approach - The study proposes a causal model that explores how convenience, compatibility, and media richness affect users' attitudes towards the dedicated e-book readers for reading. Findings - The results of this study suggest that convenience, compatibility, and media richness all significantly contribute to dedicated e-book reader acceptance. Research limitations/implications - The study extends previous theories: the Technology Acceptance Model, Innovation Diffusion Theory, media richness theory and convenience. This helps one to better understand what factors affect usage of the dedicated e-book readers, an important topic for current and future research. Practical implications - The findings outline and describe how the dominant factors affect users' attitudes towards adoption of the dedicated e-book readers for reading. By considering factors such as ease-of-use, usefulness, convenience, compatibility, media richness, etc., in the stage of product development, practitioners can provide dedicated e-book readers that customers will readily accept. Originality/value - These findings will enable development of a more robust understanding of attitudes toward dedicated e-book readers and will be helpful to developers researching e-book hardware and software as well as to researchers interested in testing related theories.", "paper_title": "User attitudes toward dedicated e-book readers for reading The effects of convenience, compatibility and media richness", "paper_id": "WOS:000295711800003"}