{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "problem's_skew"}, {"score": 0.004141238989360548, "phrase": "contradicting_cases_results"}, {"score": 0.0039519004610213595, "phrase": "algorithm's_performance"}, {"score": 0.0038304902197108643, "phrase": "precision-recall_curve"}, {"score": 0.003712796038920873, "phrase": "common_summary_measurement"}, {"score": 0.003580032420161922, "phrase": "machine_learning_algorithms"}, {"score": 0.0030151432267065815, "phrase": "relative_ranking"}, {"score": 0.0028921584725218642, "phrase": "aucpr"}, {"score": 0.002499798127196099, "phrase": "different_skews"}, {"score": 0.002372935208038141, "phrase": "temporal_skew_characteristics"}, {"score": 0.0022291501521610737, "phrase": "formal_proofs"}, {"score": 0.0021493248730171132, "phrase": "desirable_properties"}], "paper_keywords": ["Precision", " Recall", " Skew", " AUCPR", " Evaluation", " Performance", " ROC"], "paper_abstract": "While a problem's skew is often assumed to be constant, this paper discusses three settings where this assumption does not hold. Consequently, incorrectly assuming skew to be constant in these contradicting cases results in an over or under estimation of an algorithm's performance. The area under a precision-recall curve (AUCPR) is a common summary measurement used to report the performance of machine learning algorithms. It is well known that precision is dependent upon class skew, which often varies between datasets. In addition to this, it is demonstrated herein that under certain circumstances the relative ranking of an algorithm (as measured by AUCPR) is not constant and is instead also dependent upon skew. The skew at which the performance of two algorithms inverts and the relationship between precision measured at different skews are defined. This is extended to account for temporal skew characteristics and situations in which skew cannot be precisely defined. Formal proofs for these findings are presented, desirable properties are proved and their application demonstrated.", "paper_title": "The bane of skew Uncertain ranks and unrepresentative precision", "paper_id": "WOS:000341431300002"}