{"auto_keywords": [{"score": 0.03533087357702082, "phrase": "illegal_distribution"}, {"score": 0.034757988642760404, "phrase": "decrypted_medical_images"}, {"score": 0.004694700982410341, "phrase": "medical_records"}, {"score": 0.004577440795549049, "phrase": "healthcare_process"}, {"score": 0.004278807087784626, "phrase": "serious_security_and_privacy_problems"}, {"score": 0.004102096151528319, "phrase": "major_concern"}, {"score": 0.003965975628742746, "phrase": "accountability_act"}, {"score": 0.00305285084207725, "phrase": "hipaa."}, {"score": 0.002805597755796506, "phrase": "authorized_staff_member"}, {"score": 0.0023694065215394593, "phrase": "malicious_staff_member"}, {"score": 0.0022522565004588113, "phrase": "watermarked_clue"}, {"score": 0.0021049977753042253, "phrase": "key_management_scheme"}], "paper_keywords": ["Cryptography", " digital imaging and communication in medicine (DICOM)", " digital watermarking", " encryption", " Health Insurance Portability and Accountability Act (HIPAA)", " patient's privacy"], "paper_abstract": "Digitizing medical records facilitates the healthcare process. However, it can also cause serious security and privacy problems, which are the major concern in the Health Insurance Portability and Accountability Act (HIPAA). While various conventional encryption mechanisms can solve some aspects of these problems, they cannot address the illegal distribution of decrypted medical images, which violates the regulations defined in the HIPAA. To protect decrypted medical images from being illegally distributed by an authorized staff member, the model proposed in this paper provides a way to integrate several cryptographic mechanisms. In this model, the malicious staff member can be tracked by a watermarked clue. By combining several well-designed cryptographic mechanisms and developing a key management scheme to facilitate the interoperation among these mechanisms, the risk of illegal distribution can be reduced.", "paper_title": "A Novel Key Management Solution for Reinforcing Compliance With HIPAA Privacy/Security Regulations", "paper_id": "WOS:000293660300007"}