{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "weighted_impact_factors"}, {"score": 0.03063606080391541, "phrase": "new_weighted_impact_factor"}, {"score": 0.0046797114400479135, "phrase": "citing_journals"}, {"score": 0.004629977311316031, "phrase": "abstract_construction"}, {"score": 0.0045971138571344345, "phrase": "general_weighted_impact_factors"}, {"score": 0.004467965784278827, "phrase": "classical_weighted_impact_factors"}, {"score": 0.0042354707960660706, "phrase": "new_impact_measuring_tools"}, {"score": 0.004029359223675788, "phrase": "mathematical_support"}, {"score": 0.003986509098918949, "phrase": "new_family"}, {"score": 0.0038606630003037864, "phrase": "main_mathematical_properties"}, {"score": 0.0037924666577694222, "phrase": "impact_measuring_tools"}, {"score": 0.003383552654319383, "phrase": "well-known_setting"}, {"score": 0.002923214590192792, "phrase": "numerical_value"}, {"score": 0.0026452734009203764, "phrase": "journal_increases"}, {"score": 0.002419466507425567, "phrase": "quantitative_bound"}, {"score": 0.0022447206386952126, "phrase": "citing_journal"}, {"score": 0.0021049977753042253, "phrase": "\"increasing_behavior"}], "paper_keywords": ["Impact factor", " Weighted", " Stability", " Ordering", " Mathematics", " Altmetrics"], "paper_abstract": "An abstract construction for general weighted impact factors is introduced. We show that the classical weighted impact factors are particular cases of our model, but it can also be used for defining new impact measuring tools for other sources of information-as repositories of datasets-providing the mathematical support for a new family of altmetrics. Our aim is to show the main mathematical properties of this class of impact measuring tools, that hold as consequences of their mathematical structure and does not depend on the definition of any given index nowadays in use. In order to show the power of our approach in a well-known setting, we apply our construction to analyze the stability of the ordering induced in a list of journals by the 2-year impact factor (). We study the change of this ordering when the criterium to define it is given by the numerical value of a new weighted impact factor, in which is used for defining the weights. We prove that, if we assume that the weight associated to a citing journal increases with its , then the ordering given in the list by the new weighted impact factor coincides with the order defined by the . We give a quantitative bound for the errors committed. We also show two examples of weighted impact factors defined by weights associated to the prestige of the citing journal for the fields of MATHEMATICS and MEDICINE, GENERAL AND INTERNAL, checking if they satisfy the \"increasing behavior\" mentioned above.", "paper_title": "Mathematical properties of weighted impact factors based on measures of prestige of the citing journals", "paper_id": "WOS:000365130100039"}