{"auto_keywords": [{"score": 0.041947888026124834, "phrase": "voltage_drop_constraint"}, {"score": 0.03311041342897042, "phrase": "proposed_algorithm"}, {"score": 0.03010368972447254, "phrase": "voltage_drop"}, {"score": 0.00762385015265237, "phrase": "conventional_algorithm"}, {"score": 0.00481495049065317, "phrase": "greedy_optimization_algorithm"}, {"score": 0.0045108906244892165, "phrase": "process_technological_progress"}, {"score": 0.004413846562278824, "phrase": "low_voltage_power_supplies"}, {"score": 0.004180234323211199, "phrase": "voltage_margin"}, {"score": 0.003032228032253871, "phrase": "network_algorithm"}, {"score": 0.0024653491388223546, "phrase": "greatest_influence"}, {"score": 0.002386062690026682, "phrase": "experimental_results"}, {"score": 0.0022472527731744974, "phrase": "total_wiring_area"}, {"score": 0.0021049977753042253, "phrase": "experimental_data"}], "paper_keywords": ["power supply noise", " power distribution networks", " signal integrity", " circuit simulation"], "paper_abstract": "With the process technological progress in recent years, low voltage power supplies have become quite predominant. With this, the voltage margin has decreased and therefore the power/ground design that satisfies the voltage drop constraint becomes more important. In addition, the reduction of the power/ground total wiring area and the number of layers will reduce manufacturing and designing costs. So, we propose an algorithm that satisfies the voltage drop constraint and at the same time, minimizes the power/ground total wiring area. The proposed algorithm uses the idea of a network algorithm [I] where the edge which has the most influence on voltage drop is found. Voltage drop is improved by changing the resistance of the edge. The proposed algorithm is efficient and effectively updates the edge with the greatest influence on the voltage drop. From experimental results, compared with the conventional algorithm, we confirmed that the total wiring area of the power/ground was reducible by about 1/3. Also, the experimental data shows that the proposed algorithm satisfies the voltage drop constraint in the data whereas the conventional algorithm cannot.", "paper_title": "Greedy Optimization Algorithm for the Power/Ground Network Design to Satisfy the Voltage Drop Constraint", "paper_id": "WOS:000289922100004"}