{"auto_keywords": [{"score": 0.049666636555871356, "phrase": "private_information"}, {"score": 0.006437047625528708, "phrase": "compensation_model"}, {"score": 0.00481495049065317, "phrase": "electronic_markets"}, {"score": 0.0047323590206695305, "phrase": "technological_advances"}, {"score": 0.004340081802944066, "phrase": "profitable_use"}, {"score": 0.0036500346000495317, "phrase": "partial_solution"}, {"score": 0.00319141242685261, "phrase": "security_feature"}, {"score": 0.0031365819432206004, "phrase": "data_owners"}, {"score": 0.002990592465417758, "phrase": "unauthorized_access"}, {"score": 0.0026603411931700556, "phrase": "information-security_mechanism"}, {"score": 0.0024928553725344933, "phrase": "compensation_models"}, {"score": 0.0023767561522363367, "phrase": "self-regulating_market"}, {"score": 0.0022957232752482196, "phrase": "compensation_component"}, {"score": 0.002266051712795851, "phrase": "intermediated_market"}], "paper_keywords": ["information intermediary", " information pricing", " information security", " privacy", " trust"], "paper_abstract": "Technological advances in the collection, storage, and analysis of data have increased the ease with which businesses can make profitable use of information about individuals. Some of this information is private, and individuals are simultaneously becoming more aware of the value of the information and how the loss of control over this information impacts their personal privacy. As a partial solution to these concerns, this paper presents a mechanism that serves two purposes. The first enables the use (of private, numerical data in the answering of queries while simultaneously providing a security feature that protects the data owners from a loss of privacy that could result from an unauthorized access. The second develops a compensation model for the use of the data that allows individuals to dynamically redefine their security requirements. The compensation model is built on the information-security mechanism to create the foundation of a market for private information. This paper illustrates how compensation models like the one presented here could be used in a self-regulating market for private information. Additionally, the compensation component of an intermediated market for private information is developed and extensively analyzed. Finally, this paper provides insights and draws several important conclusions on markets for private information.", "paper_title": "Secure electronic markets for private information", "paper_id": "WOS:000237457600006"}