{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "information_systems_research"}, {"score": 0.004718606673885043, "phrase": "dominant_way"}, {"score": 0.0046593686062545185, "phrase": "information_systems"}, {"score": 0.004577676867295466, "phrase": "high-level_reference_theory"}, {"score": 0.004520200017456565, "phrase": "mid-level_abstractions"}, {"score": 0.004497410940849537, "phrase": "generic_and_atheoretical_information_technology"}, {"score": 0.004352044603955875, "phrase": "middle_range"}, {"score": 0.004319168469158858, "phrase": "abstract_reference_theory_concepts"}, {"score": 0.004085514898073417, "phrase": "independent_variable"}, {"score": 0.003739467648777849, "phrase": "mis_quarterly"}, {"score": 0.0036553070575015344, "phrase": "published_theory"}, {"score": 0.0033967510986397946, "phrase": "original_and_bold_theorizing"}, {"score": 0.0032702516771609957, "phrase": "incommensurate_mid-range_models"}, {"score": 0.0030931649626014497, "phrase": "negative_impacts"}, {"score": 0.00306976931257846, "phrase": "field's_dominant_epistemic_scripts"}, {"score": 0.0029779376998814084, "phrase": "alternative_forms"}, {"score": 0.0029629009627331355, "phrase": "knowledge_production"}, {"score": 0.002816635287470419, "phrase": "innovative_and_extensive_data_sets"}, {"score": 0.0027048247303526583, "phrase": "germane_conceptual_relationships"}, {"score": 0.002519703390732195, "phrase": "institutionalized_forms"}, {"score": 0.00245669781073535, "phrase": "individual_scholars"}, {"score": 0.0024013376958528366, "phrase": "richer_theorizing"}, {"score": 0.0023591417077156555, "phrase": "field's_knowledge_ecology"}, {"score": 0.0021426578670025514, "phrase": "organizational_inquiry"}, {"score": 0.002115689888299333, "phrase": "central_forces"}, {"score": 0.0021049977753042253, "phrase": "human_enterprise"}], "paper_keywords": ["Information systems discipline", " research inquiry", " epistemic scripts", " IS theory", " IT artifact", " middle-range theory", " theory borrowing", " institutional analysis"], "paper_abstract": "The dominant way of producing knowledge in information systems (IS) seeks to domesticate high-level reference theory in the form of mid-level abstractions involving generic and atheoretical information technology (IT) components. Enacting such epistemic scripts squeezes IS theory to the middle range, where abstract reference theory concepts are directly instantiated or slightly modified to the IS context, whereas IT remains exogenous to theory by being treated as an independent variable, mediator, or moderator. In this design, IT is often operationalized using proxies that detect the presence of IT or its variation in use or cost. Our analysis of 143 articles published in MIS Quarterly and Information Systems Research over the past 15 years demonstrates that over 70 percent of published theory conforms to this mode of producing IS knowledge. This state of play has resulted in two negative consequences: the field (1) agonizes over the dearth of original and bold theorizing over IT and (2) satisfices when integrating theory with empirics by creating incommensurate mid-range models that are difficult to consolidate. We propose that one way to overcome these challenges is to critically examine and debate the negative impacts of the field's dominant epistemic scripts and relax them by permitting IS scholarship that more fluidly accommodates alternative forms of knowledge production. This will push IS inquiry to the \"edges\" and emphasize, on the one hand, inductive, rich inquiries using innovative and extensive data sets and, on the other hand, novel, genuine, high-level theorizing around germane conceptual relationships between IT, information and its (semiotic) representations, and social behaviors. We offer several exemplars of such inquiries and their results. To promote this push, we invite alternative institutionalized forms of publishing and reviewing. We conclude by inviting individual scholars to be more open to practices that permit richer theorizing. These recommendations will broaden the field's knowledge ecology and permit the creation of good IS knowledge over just getting \"hits.\" We surmise that, if such changes are carried out, the field can look confidently toward its future as one of the epicenters of organizational inquiry that deal with the central forces shaping human enterprise in the 21st century.", "paper_title": "NEW STATE OF PLAY IN INFORMATION SYSTEMS RESEARCH: THE PUSH TO THE EDGES", "paper_id": "WOS:000361601700002"}