{"auto_keywords": [{"score": 0.025093859497887876, "phrase": "mined_models"}, {"score": 0.014135854376310274, "phrase": "non-trivial_constructs"}, {"score": 0.01237572299650145, "phrase": "process_models"}, {"score": 0.01106583584242049, "phrase": "genetic_algorithm"}, {"score": 0.008986602823557677, "phrase": "fitness_measure"}, {"score": 0.007533165080810013, "phrase": "extra_behavior"}, {"score": 0.006914983752271393, "phrase": "future_research"}, {"score": 0.00481495049065317, "phrase": "process_mining"}, {"score": 0.0046875099587735825, "phrase": "process_model"}, {"score": 0.004514714250357749, "phrase": "current_techniques"}, {"score": 0.0038431888954930083, "phrase": "genetic_algorithms"}, {"score": 0.003603327452846714, "phrase": "internal_representation"}, {"score": 0.0034890505116128606, "phrase": "noise_problem"}, {"score": 0.0030834712590249863, "phrase": "good_fitness_measure"}, {"score": 0.002985631781749091, "phrase": "genetic_approach"}, {"score": 0.002890887778279196, "phrase": "current_status"}], "paper_keywords": ["process mining", " genetic mining", " genetic algorithms", " Petri nets", " workflow Petri nets"], "paper_abstract": "One of the aims of process mining is to retrieve a process model from a given event log. However, current techniques have problems when mining processes that contain non-trivial constructs and/or when dealing with the presence of noise in the logs. To overcome these problems, we try to use genetic algorithms to mine process models. The non-trivial constructs are tackled by choosing an internal representation that supports them. The noise problem is naturally tackled by the genetic algorithm because, per definition, these algorithms are robust to noise. The definition of a good fitness measure is the most critical challenge in a genetic approach. This paper presents the current status of our research and the pros and cons of the fitness measure that we used so far. Experiments show that the fitness measure leads to the mining of process models that can reproduce all the behavior in the log, but these mined models may also allow for extra behavior. In short, the current version of the genetic algorithm can already be used to mine process models, but future research is necessary to always ensure that the mined models do not allow for extra behavior. Thus, this paper also discusses some ideas for future research that could ensure that the mined models will always only reflect the behavior in the log.", "paper_title": "Genetic process mining: A basic approach and its challenges", "paper_id": "WOS:000236884100015"}