{"auto_keywords": [{"score": 0.0421318407050913, "phrase": "line_segments"}, {"score": 0.013019827484251326, "phrase": "minimum_number"}, {"score": 0.011050116263806765, "phrase": "sensing_radius"}, {"score": 0.00481495049065317, "phrase": "line_segment_coverage"}, {"score": 0.00476697427418509, "phrase": "wireless_sensor_networks"}, {"score": 0.004625881588444304, "phrase": "wireless_sensor_networks_deals"}, {"score": 0.0038819041309353024, "phrase": "line_segment"}, {"score": 0.0036370297611938796, "phrase": "sensing_region"}, {"score": 0.00347657813672945, "phrase": "bounded_rectangular_region"}, {"score": 0.0025989960809479104, "phrase": "axis-parallel_line_segments"}, {"score": 0.0025093153632032407, "phrase": "ptas"}, {"score": 0.002422661411769552, "phrase": "arbitrarily_oriented_line_segments"}, {"score": 0.0022696277881969896, "phrase": "constant_factor"}, {"score": 0.0021262403223013242, "phrase": "constant_factor_approximation_algorithm"}, {"score": 0.0021049977753042253, "phrase": "k-covering_axis-parallel_line_segments"}], "paper_keywords": ["Sensor", " Coverage", " Approximation algorithm"], "paper_abstract": "The coverage problem in wireless sensor networks deals with the problem of covering a region or parts of it with sensors. In this paper, we address the problem of covering a set of line segments with minimum number of sensors. A line segment a\"\" is said to be 1-covered if it intersects the sensing region of at least one among the sensors distributed in a bounded rectangular region R. We assume that the sensing radius of each sensor is uniform. The problem of finding the minimum number of sensors needed to 1-cover each member in a given set of line segments in R is NP-hard. We propose two constant factor approximation algorithms and a PTAS (polynomial time approximation scheme) for the problem for 1-covering a set of axis-parallel line segments. We also show that a PTAS exists for 1-covering a set of arbitrarily oriented line segments in R where the lengths of the line segments are bounded within a constant factor of the sensing radius of each sensor. Finally, we propose a constant factor approximation algorithm for k-covering axis-parallel line segments such that sensors maintain a minimum separation among them.", "paper_title": "Approximation algorithms for deployment of sensors for line segment coverage in wireless sensor networks", "paper_id": "WOS:000320891600021"}