{"auto_keywords": [{"score": 0.04846675549219539, "phrase": "asynchronous_methods"}, {"score": 0.010041069597667169, "phrase": "linear_equations"}, {"score": 0.00481495049065317, "phrase": "asynchronous_linear_solvers"}, {"score": 0.004216434794603139, "phrase": "processor_idle_time"}, {"score": 0.00350696416714684, "phrase": "diagonally_dominant_matrices"}, {"score": 0.003232653376857698, "phrase": "asynchronous_convergence_rate"}, {"score": 0.002854645802851, "phrase": "randomized_shared-memory_asynchronous_method"}, {"score": 0.0028302635493019867, "phrase": "general_symmetric_positive_definite_matrices"}, {"score": 0.0027583557819362034, "phrase": "convergence_rate"}, {"score": 0.002597577409911978, "phrase": "method's_synchronous_counterpart"}, {"score": 0.002564360070426064, "phrase": "processor_count"}, {"score": 0.002353483216544667, "phrase": "unsymmetric_systems"}, {"score": 0.002274059352027924, "phrase": "significant_improvement"}, {"score": 0.0022257833099336858, "phrase": "asynchronous_linear"}, {"score": 0.0021049977753042253, "phrase": "key_paradigm"}], "paper_keywords": ["Asynchronous", " shared-memory parallel", " randomized", " Gauss-Seidel"], "paper_abstract": "Asynchronous methods for solving systems of linear equations have been researched since Chazan and Miranker's [1969] pioneering paper on chaotic relaxation. The underlying idea of asynchronous methods is to avoid processor idle time by allowing the processors to continue to make progress even if not all progress made by other processors has been communicated to them. Historically, the applicability of asynchronous methods for solving linear equations has been limited to certain restricted classes of matrices, such as diagonally dominant matrices. Furthermore, analysis of these methods focused on proving convergence in the limit. Comparison of the asynchronous convergence rate with its synchronous counterpart and its scaling with the number of processors have seldom been studied and are still not well understood. In this article, we propose a randomized shared-memory asynchronous method for general symmetric positive definite matrices. We rigorously analyze the convergence rate and prove that it is linear and is close to that of the method's synchronous counterpart if the processor count is not excessive relative to the size and sparsity of the matrix. We also present an algorithm for unsymmetric systems and overdetermined least-squares. Our work presents a significant improvement in the applicability of asynchronous linear solvers as well as in their convergence analysis, and suggests randomization as a key paradigm to serve as a foundation for asynchronous methods.", "paper_title": "Revisiting Asynchronous Linear Solvers: Provable Convergence Rate through Randomization", "paper_id": "WOS:000366430000008"}