{"auto_keywords": [{"score": 0.049250789168149046, "phrase": "user_feedback"}, {"score": 0.012421384716028864, "phrase": "scientific_cooperation_network"}, {"score": 0.007519186742798511, "phrase": "name_disambiguation"}, {"score": 0.004490212943845175, "phrase": "ambiguous_author_names"}, {"score": 0.0042859292226559535, "phrase": "multiple_authors"}, {"score": 0.002817639725689939, "phrase": "different_weights"}, {"score": 0.0025816953009851072, "phrase": "standard_public_collections"}, {"score": 0.0024496978447849835, "phrase": "baseline_methods"}, {"score": 0.0023654615987859402, "phrase": "proposed_algorithm"}, {"score": 0.002324433454350402, "phrase": "previous_methods"}, {"score": 0.0022841153001549193, "phrase": "user_interactions"}, {"score": 0.0021799789348982516, "phrase": "different_types"}, {"score": 0.0021049977753042253, "phrase": "disambiguation_results"}], "paper_keywords": ["Name disambiguation", " User feedback", " Scientific cooperation network"], "paper_abstract": "Name disambiguation is a very critical problem in scientific cooperation network. Ambiguous author names may occur due to the existence of multiple authors with the same name. Despite much research work has been conducted, the problem is still not resolved and becomes even more serious. In this paper, we focus ourselves on such problem. A method of exploiting user feedback for name disambiguation in scientific cooperation network is proposed, which can make use of user feedback to enhance the performance. Furthermore, to make the user feedback more effective, we divide user feedback into three types and assign different weights to them. To evaluate the effectiveness of our proposed method, experiments are conducted with standard public collections. We compare the performance of our proposal with baseline methods. Results show that the proposed algorithm outperforms the previous methods without introducing user interactions. Besides, we investigate into how different types of user feedback can affect the disambiguation results.", "paper_title": "Name disambiguation in scientific cooperation network by exploiting user feedback", "paper_id": "WOS:000333057700004"}