{"auto_keywords": [{"score": 0.04951471866031507, "phrase": "actuator_saturation"}, {"score": 0.04749848892978978, "phrase": "linear_time"}, {"score": 0.014536730214085554, "phrase": "decentralized_control"}, {"score": 0.014310879490390964, "phrase": "invariant_dynamic_controllers"}, {"score": 0.010663426827182467, "phrase": "linearized_model"}, {"score": 0.008713768692145006, "phrase": "linear_time_invariant_systems"}, {"score": 0.006824706690178125, "phrase": "open_left_half_complex_plane"}, {"score": 0.00453772385360173, "phrase": "invariant_system"}, {"score": 0.004078157608867258, "phrase": "global_stabilization"}, {"score": 0.00397198077312151, "phrase": "imaginary_axis"}, {"score": 0.0038737214010638745, "phrase": "so-called_decentralized_fixed_modes"}, {"score": 0.003508834578859094, "phrase": "semi-global_stabilization"}, {"score": 0.00344007531836105, "phrase": "centralized_control"}, {"score": 0.003399466007862412, "phrase": "linear_time_invariant_dynamic"}, {"score": 0.0032934951320964276, "phrase": "open-loop_poles"}, {"score": 0.00316565009987584, "phrase": "closed_left_half_complex_plane"}, {"score": 0.0030791137853734152, "phrase": "necessary_conditions"}, {"score": 0.0025259082947443343, "phrase": "half_complex_plane"}, {"score": 0.0021049977753042253, "phrase": "open_problem"}], "paper_keywords": [""], "paper_abstract": "We are concerned here with the stabilization of a linear time invariant system subject to actuator saturation via decentralized control while using linear time invariant dynamic controllers. When there exists no actuator saturation, i.e. when we consider just linear time invariant systems, it is known that global stabilization can be done via decentralized control while using linear time invariant dynamic controllers only if the so-called decentralized fixed modes of it are all in the open left half complex plane. On the other hand, it is known that for linear time invariant systems subject to actuator saturation, semi-global stabilization can be done via centralized control while using linear time invariant dynamic. controllers if and only if the open-loop poles of the linearized model of the given system are in the closed left half complex plane. This chapter establishes that the necessary conditions for semi-global stabilization of linear time invariant systems subject to actuator saturation via decentralized control while using linear time invariant dynamic controllers, are indeed the above two conditions, namely (a) the decentralized fixed modes of the linearized model of the given system are in the open left half complex plane, and (b) the open-loop poles of the linearized model of the given system are in the closed left half complex plane. We conjecture that these two conditions are also sufficient in general. We prove the sufficiency for the case when the linearized model of the given system is open-loop conditionally stable with eigenvalues on the imaginary axis being distinct. Proving the sufficiency is still an open problem for the case when the linearized model of the given system has repeated eigenvalues on the imaginary axis.", "paper_title": "Decentralized stabilization of linear time invariant systems subject to actuator saturation", "paper_id": "WOS:000241666400014"}