{"auto_keywords": [{"score": 0.03222840731293158, "phrase": "solution_space"}, {"score": 0.00481495049065317, "phrase": "solution_quality"}, {"score": 0.004584769330512473, "phrase": "widely_studied_problem"}, {"score": 0.00411620854480626, "phrase": "simple_linear_functions"}, {"score": 0.004049501224016734, "phrase": "np-hard_problem"}, {"score": 0.003970872207239332, "phrase": "knapsack_instances"}, {"score": 0.0035999631751991385, "phrase": "generalized_results"}, {"score": 0.0034164751616551437, "phrase": "obtained_solution-fronts"}, {"score": 0.003350096243772218, "phrase": "good_diversity"}, {"score": 0.0029392523663327253, "phrase": "entire_coverage"}, {"score": 0.002735118294625477, "phrase": "specific_knowledge"}, {"score": 0.002708399936381754, "phrase": "initial_population"}, {"score": 0.002681941877978841, "phrase": "good_quality_solutions"}, {"score": 0.0026126405272417783, "phrase": "obtained_solution_fronts"}, {"score": 0.002570237158808816, "phrase": "main_point"}, {"score": 0.0024874787612079252, "phrase": "real_world_applications"}, {"score": 0.002471248834609486, "phrase": "unknown_nature"}, {"score": 0.002225481283887324, "phrase": "desired_set"}, {"score": 0.002196528953486178, "phrase": "moeas"}, {"score": 0.0021050078070343043, "phrase": "elsevier"}], "paper_keywords": ["Multiobjective problem", " Combinatorial optimization", " Evolutionary algorithm", " Heuristics", " Pareto-front", " 0-1 knapsack"], "paper_abstract": "Multiobjective 0-1 knapsack problem involving multiple knapsacks is a widely studied problem. In this paper, we consider a formulation of the biobjective 0-1 knapsack problem which involves a single knapsack; this formulation is more realistic and has many industrial applications. Though it is formulated using simple linear functions, it is an NP-hard problem. We consider three different types of knapsack instances, where the weight and profit of an item is (i) uncorrelated, (ii) weakly correlated, and (iii) strongly correlated, to obtain generalized results. First, we solve this problem using three well-known multiobjective evolutionary algorithms (MOEAs) and quantify the obtained solution-fronts to observe that they show good diversity and ( local) convergence. Then, we consider two heuristics and observe that the quality of solutions obtained by MOEAs is much inferior in terms of the extent of the solution space. Interestingly, none of the MOEAs could yield the entire coverage of the Pareto-front. Therefore, based on the knowledge of the Pareto-front obtained from the heuristics, we incorporate problem specific knowledge in the initial population and obtain good quality solutions using MOEAs too. We quantify the obtained solution fronts for comparison. The main point we stress with this work is that, for real world applications of unknown nature, it is indeed difficult to realize how good/bad is the quality of the solutions obtained. Conversely, if we know the solution space, it is trivial to obtain the desired set of solutions using MOEAs, which is a paradox in itself. (C) 2009 Elsevier B. V. All rights reserved.", "paper_title": "Assessing solution quality of biobjective 0-1 knapsack problem using evolutionary and heuristic algorithms", "paper_id": "WOS:000275377500006"}