{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "multi-label_classification"}, {"score": 0.007499105829525222, "phrase": "dalian_university_of_technology_sentiment_dictionary"}, {"score": 0.004712726613162057, "phrase": "sentiment_classification"}, {"score": 0.004539005582217309, "phrase": "sentiment_analysis"}, {"score": 0.0038638811223100184, "phrase": "proposed_prototype"}, {"score": 0.0035457302646174148, "phrase": "raw_segmented_words"}, {"score": 0.0035078427258024613, "phrase": "sentiment_features"}, {"score": 0.0033602844686125375, "phrase": "national_taiwan_university_sentiment_dictionary"}, {"score": 0.0033243718810317254, "phrase": "hownet_dictionary"}, {"score": 0.0031167895790050405, "phrase": "feature_representation"}, {"score": 0.003066945490483524, "phrase": "detailed_empirical_study"}, {"score": 0.003034158379493625, "phrase": "different_multi-label_classification_methods"}, {"score": 0.0022818671653408278, "phrase": "performed_empirical_comparisons"}, {"score": 0.002209406458446019, "phrase": "best_performance"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Sentiment analysis", " Multi-label classification", " Microblogs"], "paper_abstract": "A multi-label classification based approach for sentiment analysis is proposed in this paper. To the best of our knowledge, this work is the first to propose to use multi-label classification for sentiment classification of microblogs. The proposed prototype has three main components, text segmentation, feature extraction, and multi-label classification. Raw segmented words and sentiment features based on the three different sentiment dictionaries, Dalian University of Technology Sentiment Dictionary, National Taiwan University Sentiment Dictionary and HowNet Dictionary, are the features and the bag of words is the feature representation. A detailed empirical study of different multi-label classification methods on sentiment classification is conducted to compare their classification performances. Specifically, total 11 state of the art multi-label classification methods are compared on two microblog datasets and 8 evaluation metrics are used. The effects of the three sentiment dictionaries for multi-label classification are empirically studied and compared, which, to the best of our knowledge, have not been performed. The performed empirical comparisons show that Dalian University of Technology Sentiment Dictionary has the best performance among the three different sentiment dictionaries. (C) 2014 Elsevier Ltd. All rights reserved.", "paper_title": "A multi-label classification based approach for sentiment classification", "paper_id": "WOS:000345734700011"}