{"auto_keywords": [{"score": 0.037045008134528865, "phrase": "task-performance_evaluation"}, {"score": 0.00481495049065317, "phrase": "situated_collaborative_task_dialogues"}, {"score": 0.004216566615939546, "phrase": "widely_used_method"}, {"score": 0.0037825134619339537, "phrase": "previously_collected_corpora"}, {"score": 0.0033929894721242367, "phrase": "referring_expression"}, {"score": 0.0031367803372203498, "phrase": "collaborative_situated_dialogues"}, {"score": 0.0029707940194245216, "phrase": "japanese_speakers"}, {"score": 0.00291743479583421, "phrase": "tangram_puzzles"}, {"score": 0.002600995957987461, "phrase": "demonstrative_pronouns"}, {"score": 0.0025388705701873075, "phrase": "machine_learning-based_algorithm"}, {"score": 0.0023470051993423483, "phrase": "previously_conducted_corpus-matching_evaluation"}, {"score": 0.0022497569011987587, "phrase": "lang_resour_eval"}, {"score": 0.0021049977753042253, "phrase": "corpus-matching_evaluation"}], "paper_keywords": ["Task-performance evaluation", " Referring expressions", " Demonstrative pronouns", " Situated dialogue", " Japanese"], "paper_abstract": "Appropriate evaluation of referring expressions is critical for the design of systems that can effectively collaborate with humans. A widely used method is to simply evaluate the degree to which an algorithm can reproduce the same expressions as those in previously collected corpora. Several researchers, however, have noted the need of a task-performance evaluation measuring the effectiveness of a referring expression in the achievement of a given task goal. This is particularly important in collaborative situated dialogues. Using referring expressions used by six pairs of Japanese speakers collaboratively solving Tangram puzzles, we conducted a task-performance evaluation of referring expressions with 36 human evaluators. Particularly we focused on the evaluation of demonstrative pronouns generated by a machine learning-based algorithm. Comparing the results of this task-performance evaluation with the results of a previously conducted corpus-matching evaluation (Spanger et al. in Lang Resour Eval, 2010b), we confirmed the limitation of a corpus-matching evaluation and discuss the need for a task-performance evaluation.", "paper_title": "A task-performance evaluation of referring expressions in situated collaborative task dialogues", "paper_id": "WOS:000328213000015"}