{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "cycle_time"}, {"score": 0.00848143119944318, "phrase": "cycle_times"}, {"score": 0.004798146197363649, "phrase": "factory_conditions"}, {"score": 0.0047314049780079765, "phrase": "dynamic_random_access_memory_manufacturing"}, {"score": 0.004633073445318448, "phrase": "fbpn_approach"}, {"score": 0.004616859702338596, "phrase": "essential_task"}, {"score": 0.004568617813032014, "phrase": "dynamic_random_access_memory"}, {"score": 0.004127394241838696, "phrase": "incorrect_assessment"}, {"score": 0.0036767202303156854, "phrase": "fuzzy_value"}, {"score": 0.0036382660173943393, "phrase": "fuzzy_back-propagation_network"}, {"score": 0.0036128527616772848, "phrase": "fbpn"}, {"score": 0.0033800778203837757, "phrase": "lower_and_upper_bounds"}, {"score": 0.003096417317829492, "phrase": "cycle_time_reduction_action"}, {"score": 0.002937745193225725, "phrase": "control_action"}, {"score": 0.002787181295054319, "phrase": "control_mechanism"}, {"score": 0.002767696345005216, "phrase": "multiple_consecutive_jobs"}, {"score": 0.0026722904884984348, "phrase": "proposed_methodology"}, {"score": 0.0026443135597866924, "phrase": "dram_factory_simulator"}, {"score": 0.0025531499687505483, "phrase": "experimental_results"}], "paper_keywords": ["Competitiveness", " Sustainability", " Cycle time reduction", " Dynamic random access memory (DRAM)", " Fuzzy", " Back-propagation network (BPN)"], "paper_abstract": "Reducing cycle time is an essential task that enables dynamic random access memory (DRAM) manufactures to maintain sustainability and gain competitiveness. However, the uncertainty of cycle times makes this a challenging task. Overestimating or underestimating cycle times leads to an incorrect assessment of the effects of an action performed to reduce the cycle time. To address this problem, in this study, the uncertainty of the cycle time was considered and modeled using a fuzzy value. A fuzzy back-propagation network (FBPN) approach is proposed to estimate the cycle time of a job based on its attributes and factory conditions. The lower and upper bounds of the cycle time established using the FBPN approach are tight. In addition, an FBPN can be applied to assess the effects of a cycle time reduction action that shortens the cycle time of a job by improving control over factory conditions. The control action is flexible because the attitude of the managers is considered. Furthermore, a control mechanism for multiple consecutive jobs is established. To illustrate the applicability of the proposed methodology, a DRAM factory simulator was used to generate data. According to the experimental results, the ranges of cycle times, including the +/- 3 sigma range, determined using the FBPN approach were narrower than those determined using four existing methods. In addition, the relationship between the cycle time and attributes of a job was determined to be different when the upper (or lower) bound of the cycle time rather than the most likely value was considered.", "paper_title": "A fuzzy back-propagation network approach for planning actions to shorten the cycle time of a job in dynamic random access memory manufacturing", "paper_id": "WOS:000361397500003"}