{"auto_keywords": [{"score": 0.04481169655839516, "phrase": "design_solutions"}, {"score": 0.03874050686675407, "phrase": "ldshake"}, {"score": 0.00481495049065317, "phrase": "learning_design_solutions"}, {"score": 0.004586531354697466, "phrase": "collaborative_authoring"}, {"score": 0.004512814529823301, "phrase": "didactical_units"}, {"score": 0.004488505301335364, "phrase": "learning_materials"}, {"score": 0.00385832528624328, "phrase": "educational_resources"}, {"score": 0.003586794630260979, "phrase": "combined_support"}, {"score": 0.00355782527287734, "phrase": "social_sharing"}, {"score": 0.003361464584233189, "phrase": "different_access_rights"}, {"score": 0.0032017763417531973, "phrase": "design_solution"}, {"score": 0.002881255933884771, "phrase": "pedagogical_approach"}, {"score": 0.002796782643988021, "phrase": "pre-formatted_designs"}, {"score": 0.0027592065435732955, "phrase": "specific_didactic_method"}, {"score": 0.0027295084882654917, "phrase": "problem-based_learning"}, {"score": 0.002685558057339722, "phrase": "particularized_ldshake_instance"}, {"score": 0.0026280534600940137, "phrase": "human_biology"}, {"score": 0.002523522043697174, "phrase": "pbl_solutions"}, {"score": 0.0025031188149336257, "phrase": "controlled_user_study"}, {"score": 0.0024495111090152857, "phrase": "generic_ldshake"}, {"score": 0.002429704817277847, "phrase": "moodie_system"}, {"score": 0.0023079225317714815, "phrase": "combined_results"}, {"score": 0.0022768995018977996, "phrase": "controlled_studies"}, {"score": 0.0022523809174081837, "phrase": "social_structure"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Authoring tools and methods", " Computer-mediated communication", " Human-computer interface", " Media in education"], "paper_abstract": "Two important challenges that teachers are currently facing are the sharing and the collaborative authoring of their learning design solutions, such as didactical units and learning materials. On the one hand, there are tools that can be used for the creation of design solutions and only some of them facilitate the co-edition. However, they do not incorporate mechanisms that support the sharing of the designs between teachers. On the other hand, there are tools that serve as repositories of educational resources but they do not enable the authoring of the designs. In this paper we present LdShake, a web tool whose novelty is focused on the combined support for the social sharing and co-edition of learning design solutions within communities of teachers. Teachers can create and share learning designs with other teachers using different access rights so that they can read, comment or co-edit the designs. Therefore, each design solution is associated to a group of teachers able to work on its definition, and another group that can only see the design. The tool is generic in that it allows the creation of designs based on any pedagogical approach. However, it can be particularized in instances providing pre-formatted designs structured according to a specific didactic method (such as Problem-Based Learning, PBL). A particularized LdShake instance has been used in the context of Human Biology studies where teams of teachers are required to work together in the design of PBL solutions. A controlled user study, that compares the use of a generic LdShake and a Moodie system, configured to enable the creation and sharing of designs, has been also carried out. The combined results of the real and controlled studies show that the social structure, and the commenting, co-edition and publishing features of LdShake provide a useful, effective and usable approach for facilitating teachers' teamwork. (C) 2011 Elsevier Ltd. All rights reserved.", "paper_title": "LdShake: Learning design solutions sharing and co-edition", "paper_id": "WOS:000295860100006"}