{"auto_keywords": [{"score": 0.0447494297628201, "phrase": "handwritten_text"}, {"score": 0.004815005554770855, "phrase": "arabic"}, {"score": 0.004703075081891693, "phrase": "comprehensive_arabic_handwritten_text_database"}, {"score": 0.0046092435167207095, "phrase": "arabic_handwritten_text_recognition_research"}, {"score": 0.004412285905508977, "phrase": "arabic_handwritten_text"}, {"score": 0.004237925318473508, "phrase": "khatt"}, {"score": 0.004111672925576111, "phrase": "different_countries"}, {"score": 0.003704797078215222, "phrase": "arabic_characters"}, {"score": 0.0036186222999811802, "phrase": "open_subjects"}, {"score": 0.003510754567808717, "phrase": "database_forms"}, {"score": 0.003131393466870228, "phrase": "formal_verification_procedure"}, {"score": 0.002917793073455365, "phrase": "written_text"}, {"score": 0.002811770047652563, "phrase": "text_and_xml_formats"}, {"score": 0.0027278879752324157, "phrase": "segment_paragraphs"}, {"score": 0.0022898630573629144, "phrase": "writer_identification"}, {"score": 0.002259231376607264, "phrase": "forms_analysis"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Arabic handwritten text database", " Arabic OCR", " Document analysis", " Form processing"], "paper_abstract": "A comprehensive Arabic handwritten text database is an essential resource for Arabic handwritten text recognition research. This is especially true due to the lack of such database for Arabic handwritten text. In this paper, we report our comprehensive Arabic offline Handwritten Text database (KHATT) consisting of 1000 handwritten forms written by 1000 distinct writers from different countries. The forms were scanned at 200, 300, and 600 dpi resolutions. The database contains 2000 randomly selected paragraphs from 46 sources, 2000 minimal text paragraph covering all the shapes of Arabic characters, and optionally written paragraphs on open subjects. The 2000 random text paragraphs consist of 9327 lines. The database forms were randomly divided into 70%, 15%, and 15% sets for training, testing, and verification, respectively. This enables researchers to use the database and compare their results. A formal verification procedure is implemented to align the handwritten text with its ground truth at the form, paragraph and line levels. The verified ground truth database contains meta-data describing the written text at the page, paragraph, and line levels in text and XML formats. Tools to extract paragraphs from pages and segment paragraphs into lines are developed. In addition we are presenting our experimental results on the database using two classifiers, viz. Hidden Markov Models (HMM) and our novel syntactic classifier. The database is made freely available to researchers world-wide for research in various handwritten-related problems such as text recognition, writer identification and verification, forms analysis, preprocessing, segmentation. Several international research groups/researchers acquired the database for use in their research so far. (C) 2013 Elsevier Ltd. All rights reserved.", "paper_title": "KHATT: An open Arabic offline handwritten text database", "paper_id": "WOS:000329888800018"}