{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "euclidean_distance"}, {"score": 0.01049200954582652, "phrase": "high-dimensional_space"}, {"score": 0.009631235791787075, "phrase": "multimedia_information_retrieval"}, {"score": 0.004243862930012258, "phrase": "effective_method"}, {"score": 0.003353521531649663, "phrase": "large_approximation_errors"}, {"score": 0.0032585499655442404, "phrase": "additional_vector"}, {"score": 0.0028880836335117297, "phrase": "estimated_angle"}, {"score": 0.002806256131739047, "phrase": "approximation_errors"}, {"score": 0.002711109302199029, "phrase": "previous_method"}, {"score": 0.002444544487772349, "phrase": "actual_euclidean_distance"}, {"score": 0.0023079225317714815, "phrase": "false_dismissal"}, {"score": 0.0021539955106204354, "phrase": "proposed_method"}, {"score": 0.002129356014992349, "phrase": "performance_evaluation"}, {"score": 0.0021049977753042253, "phrase": "extensive_experiments"}], "paper_keywords": [""], "paper_abstract": "It is crucial to compute the Euclidean distance between two vectors efficiently in high-dimensional space for multimedia information retrieval. We propose an effective method for approximating the Euclidean distance between two high-dimensional vectors. For this approximation, a previous method, which simply employs norms of two vectors, has been proposed. This method, however, ignores the angle between two vectors in approximation, and thus suffers from large approximation errors. Our method introduces an additional vector called a reference vector for estimating the angle between the two vectors, and approximates the Euclidean distance accurately by using the estimated angle. This makes the approximation errors reduced significantly compared with the previous method. Also, we formally prove that the value approximated by our method is always smaller than the actual Euclidean distance. This implies that our method does not incur any false dismissal in multimedia information retrieval. Finally, we verify the superiority of the proposed method via performance evaluation with extensive experiments.", "paper_title": "An effective method for approximating the Euclidean distance in high-dimensional space", "paper_id": "WOS:000241155300084"}