{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "pyrimidine_ring"}, {"score": 0.034503478591515375, "phrase": "noncovalent_interactions"}, {"score": 0.004030663219411772, "phrase": "br"}, {"score": 0.003804985221672552, "phrase": "pyr"}, {"score": 0.0036489343475053187, "phrase": "boron_bonds"}, {"score": 0.0033910448175165004, "phrase": "non-cooperative_effects"}, {"score": 0.002974886152979993, "phrase": "energetic_and_geometric_features"}, {"score": 0.0026649432435828842, "phrase": "title_complexes"}, {"score": 0.002542174767860791, "phrase": "binding_energies"}, {"score": 0.002289180040240783, "phrase": "geometric_features"}, {"score": 0.0021496083700137305, "phrase": "mutual_effects"}, {"score": 0.0021049977753042253, "phrase": "aromatic_systems"}], "paper_keywords": ["Mutual interplay", " Non-cooperative effects", " Atoms in molecules", " Natural bond orbital"], "paper_abstract": "We investigated the mutual interplay between beryllium and boron bonds in the BeF2 X-Pyr BF3 complexes (X = CN, F, Cl, Br, H, CH3, OH and NH2, where Pyr and uuu denote pyrimidine ring and beryllium and boron bonds, respectively) at the M06-2X/aug-cc-pVDZ level of theory. The results indicate that non-cooperative effects are observed when the two kinds of noncovalent interactions beryllium and boron bonds coexist in the complexes. These effects were studied in terms of the energetic and geometric features of the complexes. Atoms in molecules (AIM) and natural bond orbital (NBO) analyses were also performed to unveil the mechanism of these interactions in the title complexes. The electron-withdrawing/donating substituents decrease/increase the magnitude of the binding energies compared to the unsubstituted BeF2X-PyrBF(3) (X = H) complex. The Esynvalues are in agreement with the geometric features of the complexes. The results stress the importance of the mutual effects between noncovalent interactions involving aromatic systems.", "paper_title": "Simultaneous interactions of pyrimidine ring with BeF2 and BF3 in BeF2 center dot center dot center dot X-Pyr center dot center dot center dot BF3 complexes: non-cooperativity", "paper_id": "WOS:000362411800004"}