{"auto_keywords": [{"score": 0.04614198807049024, "phrase": "online_health_information"}, {"score": 0.01397166934330098, "phrase": "cross-sectional_survey"}, {"score": 0.010788724699118107, "phrase": "negative_interaction"}, {"score": 0.00481495049065317, "phrase": "health_information"}, {"score": 0.004726184966910756, "phrase": "physical_disabilities"}, {"score": 0.004673709383305897, "phrase": "neurological_conditions"}, {"score": 0.004536592536813498, "phrase": "neurologically_disabled_people's_intention"}, {"score": 0.00445293569103488, "phrase": "actual_use"}, {"score": 0.004118026552723285, "phrase": "neurological_disabilities"}, {"score": 0.004042056914551798, "phrase": "online_questionnaire"}, {"score": 0.0037940502405699765, "phrase": "regression_analyses"}, {"score": 0.0037101871762082153, "phrase": "person's_intention"}, {"score": 0.003367611042980526, "phrase": "ohis_intention"}, {"score": 0.0032083351151314405, "phrase": "positive_interaction"}, {"score": 0.0031845069426845235, "phrase": "peou"}, {"score": 0.0029889584492584073, "phrase": "person's_use"}, {"score": 0.0028581775908203683, "phrase": "perceived_risk"}, {"score": 0.0026232532659260033, "phrase": "causal_relationships"}, {"score": 0.0025556529150386168, "phrase": "disabled_people's_online_health_information"}, {"score": 0.0024529174827030787, "phrase": "heightened_disability_level"}, {"score": 0.0024256208351516027, "phrase": "individual's_online_health_information"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ireland_ltd."}], "paper_keywords": ["Neurological disability", " Online health information", " Information seeking", " Usefulness", " Ease of use", " Risk"], "paper_abstract": "Objective: This study investigates how neurologically disabled people's intention to continue seeking and actual use of online health information are related to various factors. Design: A cross-sectional survey was conducted to collect data from people who have neurological disabilities. Measurements: An online questionnaire was used to measure demographic, physical, cognitive, and behavioral factors based on subjects' self-reported data. Results: Regression analyses on 330 data show that a person's intention to continue online health information seeking (OHIS) increases as perceived usefulness (PU) and ease of use (PEOU) and disability level increase. The OHIS intention is also predicted by a negative interaction between PU and disability, a positive interaction between PEOU and disability, and a negative interaction between PU and PEOU. It is also find that a person's use of online health information is positively related to PU and negatively related to perceived risk and the interaction between PU and risk. Limitations: The sample was not randomly selected and the cross-sectional survey cannot suggest causal relationships between variables. Conclusion: Neurologically disabled people's online health information seeking and use can be predicted by their cognitive perceptions. A heightened disability level increases an individual's online health information seeking, but is not related to the use of such information. Moreover, seeking more online health information does not make an individual use more such information, suggesting that these two behaviors should be carefully differentiated. (C) 2011 Elsevier Ireland Ltd. All rights reserved.", "paper_title": "Online health information seeking by people with physical disabilities due to neurological conditions", "paper_id": "WOS:000296493000001"}