{"auto_keywords": [{"score": 0.033573213277740176, "phrase": "multiple_routes"}, {"score": 0.015719716506582538, "phrase": "flexible_manufacturing_cells"}, {"score": 0.009728445148021556, "phrase": "proposed_approach"}, {"score": 0.009650731555679951, "phrase": "optimal_deadlock-free_schedules"}, {"score": 0.004776297980616768, "phrase": "automata_theory"}, {"score": 0.0046621835537196754, "phrase": "novel_method"}, {"score": 0.004318422955036175, "phrase": "time_labels"}, {"score": 0.004147756103284082, "phrase": "transportation_devices"}, {"score": 0.004081385289516914, "phrase": "precedence_constraints"}, {"score": 0.003999907278478564, "phrase": "ramadge-wonham's_supervisory-control_theory"}, {"score": 0.0038885527668812807, "phrase": "deadlock-free_controller"}, {"score": 0.0034452601929727752, "phrase": "proposed_heuristic_function"}, {"score": 0.003269162006886173, "phrase": "unique_route"}, {"score": 0.003003452468800793, "phrase": "different_devices"}, {"score": 0.0027929100418926725, "phrase": "effective_solutions"}, {"score": 0.00266079124891013, "phrase": "computational_time_efficiency"}, {"score": 0.0024444073418288703, "phrase": "petri-net-based_scheduling_paper"}, {"score": 0.0023762535034673017, "phrase": "mathematical-programming-based_scheduling_paper"}, {"score": 0.0021049977753042253, "phrase": "proposed_automata-based_scheduling_methodology"}], "paper_keywords": ["automata", " deadlock-free scheduling", " heuristic search", " supervisory control"], "paper_abstract": "This paper presents a novel method for the scheduling and control of flexible manufacturing cells (FMCs). The approach employs automata, augmented by time labels proposed herein, for the modeling of machines, transportation devices, buffers, precedence constraints, and part routes. Ramadge-Wonham's supervisory-control theory is then used to synthesize a deadlock-free controller that is also capable of keeping track of time. For a given set of parts to be processed by the cell, A* search algorithm is subsequently employed using a proposed heuristic function. Three different production configurations are considered: Case 1) each part has a unique route; Case 2) parts may have multiple routes, but same devices in each route; and Case 3) parts may have multiple routes with different devices. The proposed approach yields optimal deadlock-free schedules for the first two cases. For Case 3, our simulations have yielded effective solutions but in practice, optimal deadlock-free schedules may not be obtainable without sacrificing computational time efficiency. One such nontime-efficient method is included in this paper. The proposed approach is illustrated through three typical manufacturing-cell simulation examples; the first adopted from a Petri-net-based scheduling paper, the second adopted from a mathematical-programming-based scheduling paper, and the third, a new example that deals with a more complex FMC scenario where parts have multiple routes for their production. These and other simulations clearly demonstrate the effectiveness of the proposed automata-based scheduling methodology.. Index Terms-Automata, deadlock-free scheduling, heuristic search, supervisory control.", "paper_title": "Deadlock-free scheduling and control of flexible manufacturing cells using automata theory", "paper_id": "WOS:000235557900007"}