{"auto_keywords": [{"score": 0.04712665802421912, "phrase": "user_preferences"}, {"score": 0.00481495049065317, "phrase": "diverse_plans"}, {"score": 0.0047448515702010734, "phrase": "unknown_and_partially_known_user_preferences"}, {"score": 0.00428179779071721, "phrase": "single_solution_plan"}, {"score": 0.0037888687452790953, "phrase": "desired_plan"}, {"score": 0.0036256123915754303, "phrase": "single_plan"}, {"score": 0.0030101325901285537, "phrase": "different_measures"}, {"score": 0.0028662606272282926, "phrase": "domain-independent_distance_measures"}, {"score": 0.002689430273401131, "phrase": "causal_links"}, {"score": 0.002232519579957707, "phrase": "present_empirical_results"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Planning", " Partial preferences", " Diverse plans", " Heuristics", " Search"], "paper_abstract": "Current work in planning with preferences assumes that user preferences are completely specified, and aims to search for a single solution plan to satisfy these. In many real world planning scenarios, however, the user may provide no knowledge or at best partial knowledge of her preferences with respect to a desired plan. In such situations, rather than presenting a single plan as the solution, the planner must instead provide a set of plans containing one or more plans that are similar to the one that the user really prefers. In this paper, we first propose the usage of different measures to capture the quality of such plan sets. These are domain-independent distance measures based on plan elements (such as actions, states, or causal links) if no knowledge of the user preferences is given, or the Integrated Convex Preference (ICP) measure in case incomplete knowledge of such preferences is provided. We then investigate various heuristic approaches to generate sets of plans in accordance with these measures, and present empirical results that demonstrate the promise of our methods. (c) 2012 Elsevier B.V. All rights reserved.", "paper_title": "Generating diverse plans to handle unknown and partially known user preferences", "paper_id": "WOS:000308517100001"}