{"auto_keywords": [{"score": 0.030340727394862314, "phrase": "newly_arrived_products"}, {"score": 0.029680504926650964, "phrase": "binary_search-based_due_date_assignment_method"}, {"score": 0.00481495049065317, "phrase": "date_assignment"}, {"score": 0.004771672073078768, "phrase": "dynamic_scheduling"}, {"score": 0.004728780808284175, "phrase": "one-of-a-kind_assembly_production"}, {"score": 0.004359625030298944, "phrase": "assembly_production"}, {"score": 0.004262273304740847, "phrase": "processing_time"}, {"score": 0.004129607015893271, "phrase": "new_product"}, {"score": 0.004055652445791872, "phrase": "exponentially_distributed_inter-arrival_times"}, {"score": 0.0030644247579222333, "phrase": "critical_path"}, {"score": 0.002712131567923321, "phrase": "relative_early_due_date"}, {"score": 0.0025572160146590623, "phrase": "due_date"}, {"score": 0.0025113494092413604, "phrase": "numerical_experiments"}, {"score": 0.002400241288973103, "phrase": "itcp"}, {"score": 0.00233594452829104, "phrase": "first-come-first-service_rule"}], "paper_keywords": ["one-of-a-kind production", " dynamic scheduling", " due date assignment"], "paper_abstract": "In this paper, dynamic scheduling and due date assignment of one-of-a-kind assembly production is studied when the processing time is uncertain and normally distributed. New product arrives randomly with exponentially distributed inter-arrival times. Each product has its unique tree-like process route. To solve this problem, first, a method is proposed to calculate the probability that a product can be completed before its due date. Based on this method, start times of cross-points are optimised to obtain the largest in-time completion probability (ITCP). Second, two new combined dispatch rules are constructed by considering critical path (CP), the latest start time of operation and the impact from newly arrived products. Lastly, a binary search-based due date assignment method is proposed, which assigns a relative early due date to every product and meanwhile guarantee its probability of being completed before the due date. Results of numerical experiments indicate that two proposed rules are more effective in increasing the ITCP than other dispatch rules such as the first-come-first-service rule and the shortest processing time rule, and also indicate that the binary search-based due date assignment method can assign relatively early due date to newly arrived products than other due date assignment methods.", "paper_title": "Due date assignment and dynamic scheduling of one-of-a-kind assembly production with uncertain processing time", "paper_id": "WOS:000352345300006"}