{"auto_keywords": [{"score": 0.04918357102136355, "phrase": "crowd_modeling"}, {"score": 0.00481495049065317, "phrase": "service_methodology"}, {"score": 0.004043003243656031, "phrase": "pedestrian_movement"}, {"score": 0.003967314311312148, "phrase": "design_alternatives"}, {"score": 0.0037486121194392564, "phrase": "new_technologies"}, {"score": 0.0031174595932694036, "phrase": "distributed_architecture"}, {"score": 0.0028630535573013686, "phrase": "model-driven_engineering_approach"}, {"score": 0.002769805263310232, "phrase": "cell-devs_theory"}, {"score": 0.00247249708860822, "phrase": "case_study"}, {"score": 0.002449208093757498, "phrase": "crowd_evacuation"}, {"score": 0.0023694065215394593, "phrase": "proposed_architecture"}, {"score": 0.0022706045233150795, "phrase": "distributed_deployment"}, {"score": 0.0021049977753042253, "phrase": "crowd_behavior_study"}], "paper_keywords": ["Crowd modeling and simulation", " simulation as a service", " cloud computing", " model-driven engineering", " building information modeling", " workflow"], "paper_abstract": "Crowd modeling and simulation (M&S) has been used to support the analysis of the behavior of crowds, in order to predict the impact of pedestrian movement and to test design alternatives. In recent years, crowd M&S has become more complex, and new technologies such as CAD (computer-aided design) and BIM (building information modeling) authoring tools are being used to support the process. There are challenges in adopting these technologies due to the lack of automation and integration of these tools for crowd M&S. We propose a method based on a distributed architecture with simulation in the cloud, and composition using workflows. In particular, we adopt a model-driven engineering approach to extract data from CAD/BIM authoring tools, Cell-DEVS theory for crowd modeling, simulation as a service to execute simulation remotely, and three-dimensional visualization. Finally, we present a case study for crowd evacuation, discussing the advantages of the proposed architecture. We show the advantages obtained when using distributed deployment, simulation-based design and collaborative development and we discuss how this facilitates the crowd behavior study and improves reusability in crowd M&S.", "paper_title": "A simulation as a service methodology with application for crowd modeling, simulation and visualization", "paper_id": "WOS:000348114400005"}