{"auto_keywords": [{"score": 0.028387849147691928, "phrase": "single_processor"}, {"score": 0.00481495049065317, "phrase": "tomographic_inversion"}, {"score": 0.004723847090183984, "phrase": "tomographic_image_reconstruction"}, {"score": 0.004656647251517823, "phrase": "wide_variety"}, {"score": 0.004546755482549647, "phrase": "engineering_applications"}, {"score": 0.004503525064934708, "phrase": "medical_applications"}, {"score": 0.004460703838987562, "phrase": "algebraic_reconstruction_methods"}, {"score": 0.004293434614435972, "phrase": "tomographic_image_reconstruction_problems"}, {"score": 0.004112711391952791, "phrase": "performance_bottleneck"}, {"score": 0.003958439439112026, "phrase": "present_work"}, {"score": 0.00311669276800628, "phrase": "multi-processor_based_algorithm"}, {"score": 0.002611010097359509, "phrase": "proposed_multi-processor_multi-gpu_based_algorithm"}, {"score": 0.002176747110119268, "phrase": "multi-processor_multi-gpu_based_algorithm"}, {"score": 0.0021049977753042253, "phrase": "online_laminographic_applications"}], "paper_keywords": ["Multi-processor architecture", " multi-GPU", " parallel algorithms", " computed tomography", " 3D reconstruction"], "paper_abstract": "Tomographic image reconstruction has a wide variety of applications ranging from engineering applications to medical applications. Algebraic reconstruction methods, used to obtain the solutions of tomographic image reconstruction problems, are very slow in nature. This performance bottleneck has been discussed in detail in the present work. This paper encompasses a parallel (multi-processor based and multi-processor multi-GPU based) single-view coded multiplicative algebraic reconstruction technique. It has been found that parallel implementation of this algorithm helps in removing the performance bottleneck without compromising with quality of reconstruction. It has been also found that if one uses four processors to reconstruct an image of 512 x 512 x 512 volume size, then the multi-processor based algorithm takes 1997 s to perform one swap of 200 projections taken over a span of 360 degrees. The use of four processors leads to an increase in speed of 2.39 in comparison with a single processor. Further, the proposed multi-processor multi-GPU based algorithm takes 186 s to perform the same reconstruction by using four GPUs, resulting in an increase in speed of 25.7 in comparison with a single processor. We are able to process 42 projections per minute by using the multi-processor multi-GPU based algorithm. The algorithm is applicable to online laminographic applications.", "paper_title": "Fast multi-processor multi-GPU based algorithm of tomographic inversion for 3D image reconstruction", "paper_id": "WOS:000349452000006"}