{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "web_development"}, {"score": 0.004565007074039171, "phrase": "brazilian_scenario"}, {"score": 0.004524790759860321, "phrase": "accessibility"}, {"score": 0.004444921827311577, "phrase": "serious_issue"}, {"score": 0.003687960013746783, "phrase": "large_survey"}, {"score": 0.003359119985242403, "phrase": "data_analysis"}, {"score": 0.0032561349010603734, "phrase": "statistical_tests"}, {"score": 0.0032129675521135616, "phrase": "main_different_issues"}, {"score": 0.002861961643289598, "phrase": "accessibility_law"}, {"score": 0.0027741761880779535, "phrase": "government_sector"}, {"score": 0.0025950024597986366, "phrase": "accessibility_training"}, {"score": 0.0025266078302900036, "phrase": "proper_techniques"}, {"score": 0.0024930878032164757, "phrase": "accessible_contents"}, {"score": 0.002352886041381761, "phrase": "stronger_investments"}, {"score": 0.002123831297790248, "phrase": "web_accessibility"}, {"score": 0.002105046364335692, "phrase": "brazil"}], "paper_keywords": ["Web development", " Accessibility awareness", " Survey"], "paper_abstract": "Accessibility has become a serious issue to be considered by various sectors of the society. However, what are the differences between the perception of accessibility by academy, government and industry? In this paper, we present an analysis of this issue based on a large survey carried out with 613 participants involved with Web development, from all of the 27 Brazilian states. The paper presents results from the data analysis for each sector, along with statistical tests regarding the main different issues related to each of the sectors, such as: government and law, industry and techniques, academy and education. The concern about accessibility law is poor even amongst people from government sector. The analyses have also pointed out that the academy has not been addressing accessibility training accordingly. The knowledge about proper techniques to produce accessible contents is better than other sectors', but still limited in industry. Stronger investments in training and in the promotion of consciousness about the law may be pointed as the most important tools to help a more effective policy on Web accessibility in Brazil.", "paper_title": "The perception of accessibility in Web development by academy, industry and government: a survey of the Brazilian scenario", "paper_id": "WOS:000207587900002"}