{"auto_keywords": [{"score": 0.015719716506582538, "phrase": "user_experience"}, {"score": 0.010907244032187506, "phrase": "user-system_interaction"}, {"score": 0.01017491582737688, "phrase": "product_demonstration"}, {"score": 0.004590820632326585, "phrase": "virtual_reality"}, {"score": 0.004226657532307611, "phrase": "alternative_looks"}, {"score": 0.004146791234307539, "phrase": "innovative_way"}, {"score": 0.004055511503825102, "phrase": "product_design"}, {"score": 0.003928572641266562, "phrase": "substantial_adoption"}, {"score": 0.003817715315140651, "phrase": "technology_benefits_target_users"}, {"score": 0.0036167509502276294, "phrase": "previous_research"}, {"score": 0.003525861581971337, "phrase": "unique_human-computer_interaction"}, {"score": 0.0031845067058084583, "phrase": "new_knowledge"}, {"score": 0.0027948626965516947, "phrase": "interdisciplinary_view"}, {"score": 0.0027771220289115675, "phrase": "technology_acceptance"}, {"score": 0.002715909620811657, "phrase": "hci."}, {"score": 0.00267301171407926, "phrase": "system_usability"}, {"score": 0.0025892330566358503, "phrase": "furniture-style_preference_survey"}, {"score": 0.0025160740422447837, "phrase": "clear_advantage"}, {"score": 0.0024527767211457046, "phrase": "perceived_usefulness"}, {"score": 0.0023683286031958538, "phrase": "technology_treatment"}, {"score": 0.0023458049872325214, "phrase": "usability_outcomes"}, {"score": 0.0022650315005334916, "phrase": "empirical_data"}, {"score": 0.0021049977753042253, "phrase": "user's_interaction"}], "paper_keywords": [""], "paper_abstract": "As Web-based interactive 3D graphics (Web 3D), popularly referred to as Virtual Reality, continue to become more affordable, research and development groups in various fields have been adopting Web 3D technology. In addition to simulation of 3D content, the ability to instantly display alternative looks has been recognized as an innovative way to improve communication in such fields as product design, architecture, and e-commerce. Despite substantial adoption of Web 3D, how and how much the technology benefits target users as well as the providers who choose to adapt the Web 3D technology are not well understood. Previous research has established that interactive 3D graphics provide users with unique human-computer interaction (HCI). However, little is known about how users experience the Web 3D graphics technology and how user-system interaction contributes to system usability. The purpose of this study is to build new knowledge of the user experience with interactive-3D graphics systems used for product demonstration. By testing the impact of the technology on the user-system interaction and usability and comparing this impact with that of conventional two-dimensional (2D) graphics, this study tries to better understand the Web 3D technology from an interdisciplinary view of technology acceptance, sense of presence, and HCI. The study investigated how system usability is affected by HCI in the context of a furniture-style preference survey. The results of the study display the clear advantage for Web 3D for usability and show that perceived usefulness and sense of presence both mediate the effect of the technology treatment on the usability outcomes. The contribution of this study is that it includes empirical data to show how Web 3D benefits users when adopted in the context of a product demonstration and how the advantage is obtained through the user's interaction with the Web 3D technology.", "paper_title": "Understanding usability and user experience of web-based 3D graphics technology", "paper_id": "WOS:000254796600003"}