{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "requirements_models"}, {"score": 0.02304456014354032, "phrase": "use_case"}, {"score": 0.01797980155476138, "phrase": "tropos"}, {"score": 0.009563630305419471, "phrase": "requirements_model_comprehensibility"}, {"score": 0.009286848723589342, "phrase": "different_modeling_approaches"}, {"score": 0.006701873280613521, "phrase": "controlled_experiments"}, {"score": 0.004454550609699176, "phrase": "different_conceptual_approaches"}, {"score": 0.00441883624011048, "phrase": "scenario-based_and_goal-oriented_ones"}, {"score": 0.004044305784514287, "phrase": "different_but_comparable_modeling_approaches"}, {"score": 0.004001112159558637, "phrase": "analysts'_perspective"}, {"score": 0.0036717033873979125, "phrase": "goal-oriented_modeling"}, {"score": 0.0035648266669315943, "phrase": "different_models"}, {"score": 0.0032800186243040663, "phrase": "textual_description"}, {"score": 0.0032536902910768957, "phrase": "model_elements"}, {"score": 0.003167441161387607, "phrase": "original_textual_description"}, {"score": 0.003100085797251317, "phrase": "experimental_evaluation"}, {"score": 0.0028676739670326426, "phrase": "first_experiment"}, {"score": 0.0027766627317272427, "phrase": "information_systems_students"}, {"score": 0.002610198789888055, "phrase": "experimental_results"}, {"score": 0.0025892330566358503, "phrase": "tropos_models"}, {"score": 0.002447101794397243, "phrase": "use_case_models"}, {"score": 0.002306543826130521, "phrase": "case_models"}, {"score": 0.002156571716615371, "phrase": "similar_productivity"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Empirical studies", " Controlled experiment", " Requirements models", " Model comprehension", " UML use case", " Tropos"], "paper_abstract": "Context: Over the years, several modeling languages for requirements have been proposed. These languages employ different conceptual approaches, including scenario-based and goal-oriented ones. Empirical studies providing evidence about requirements model comprehensibility are rare, especially when addressing languages that belong to different modeling approaches. Objective: This work aims to compare the comprehensibility of requirements models expressed in different but comparable modeling approaches from a requirements analysts' perspective. In particular, in this paper we compare the comprehensibility of requirements models expressed in two visual modeling languages: Use Case, which is scenario-based, and Tropos, which exploits goal-oriented modeling. We further compare the effort required for comprehending the different models, and the derived productivity in each case. Method: Requirements model comprehensibility is measured here in the context of three types of tasks that analysts usually perform, namely mapping between textual description and the model elements, reading and understanding the model irrespectively of the original textual description, and modifying the model. This experimental evaluation has been conducted within a family of controlled experiments aiming at comparing the comprehensibility of Use Case and Tropos requirements models. Three runs of the experiment were performed, including a first experiment and two replications, involving 79 subjects overall (all of which were information systems students). The data for each experiment was separately analyzed, followed by a meta-analysis of the three experiments. Results: The experimental results show that Tropos models seem to be more comprehensible with respect to the three types of requirements analysis tasks, although more time consuming than Use Case models. Conclusions: Measuring model comprehensibility by means of controlled experiments is feasible and provides a basis for comparing Tropos and Use Case models, although these languages belong to different modeling approaches. Specifically, Tropos outperformed Use Case in terms of comprehensibility, but required more effort leading to a similar productivity of the two languages. (C) 2013 Elsevier B.V. All rights reserved.", "paper_title": "Comparing the comprehensibility of requirements models expressed in Use Case and Tropos: Results from a family of experiments", "paper_id": "WOS:000323298000011"}