{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "rfid"}, {"score": 0.010007480079200617, "phrase": "warehouse_operations"}, {"score": 0.004736666296080189, "phrase": "retrieval_and_storage_warehouse_operations"}, {"score": 0.004674952036988355, "phrase": "essential_components"}, {"score": 0.004614038128321949, "phrase": "supply_chains"}, {"score": 0.004435996321956133, "phrase": "whole_chain"}, {"score": 0.004363846362238565, "phrase": "radio_frequency_identification"}, {"score": 0.004278807087784626, "phrase": "emerging_technology"}, {"score": 0.004223032986655664, "phrase": "real-time_information"}, {"score": 0.003814632693659797, "phrase": "different_offline"}, {"score": 0.003789678137602989, "phrase": "online_policies"}, {"score": 0.0036194914688460656, "phrase": "decision_maker"}, {"score": 0.003312486229143855, "phrase": "particular_type"}, {"score": 0.0031845067058084613, "phrase": "stylised_model"}, {"score": 0.0031223774204093713, "phrase": "main_characteristics"}, {"score": 0.0026234862160314397, "phrase": "multiple_vehicles"}, {"score": 0.0025220591847502356, "phrase": "heuristic_routing"}, {"score": 0.0025055391159787134, "phrase": "sequencing_procedures"}, {"score": 0.0024086610445773096, "phrase": "real_time_information"}, {"score": 0.002225972846167256, "phrase": "due_data_fulfilment"}, {"score": 0.0022113879114507577, "phrase": "tardiness_minimisation"}, {"score": 0.0021896891011033105, "phrase": "rfid_technology"}, {"score": 0.0021610874773389096, "phrase": "offline_and_online_management_policies"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Warehouse operations management", " RFID technology", " Order management policies", " Simulation"], "paper_abstract": "Warehouses are essential components of logistics and supply chains. The performance of warehouse operations significantly affects the efficiency of the whole chain it belongs to. Radio frequency identification (RFID) is an emerging technology capable of providing real-time information about the location and properties of tagged object(s), such as people, equipment or products. The objective of this article is threefold, to propose and compare different offline and online policies for the scheduling of warehouse operations, to design a tool that allows the decision maker to compare policies and environments without putting them into practice, and to study the benefits that can be obtained if RFID is used in a particular type of warehouse. To this end, we have developed a stylised model that captures and generalises the main characteristics of the structure, routing and sequencing operations of a given real warehouse. The model incorporates several realistic features never or rarely discussed in the literature in the presence of RFID, for example, due dates in the orders that have to be performed and congestion in the warehouse due to the presence of multiple vehicles performing the orders. We have also developed a set of heuristic routing and sequencing procedures that take and, alternatively, do not take into account real time information, and compare their performance via simulation on a set of randomly generated, although realistic, warehouse scenarios. Computational results show the effect in terms of due data fulfilment and tardiness minimisation if the RFID technology is installed and offline and online management policies are considered. (C) 2013 Elsevier Ltd. All rights reserved.", "paper_title": "Static and dynamic policies with RFID for the scheduling of retrieval and storage warehouse operations", "paper_id": "WOS:000328234000008"}