{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "knowledge-based_approaches"}, {"score": 0.005366358973274672, "phrase": "software_architecture"}, {"score": 0.0053540564650592344, "phrase": "architecting_activities"}, {"score": 0.004589763483242731, "phrase": "software_engineering_activities"}, {"score": 0.004454377387615279, "phrase": "software_architecting_activities"}, {"score": 0.004284302478991387, "phrase": "comprehensive_understanding"}, {"score": 0.00384633057714983, "phrase": "thematic_analysis"}, {"score": 0.0036993855514735746, "phrase": "existing_application"}, {"score": 0.0036225919379274875, "phrase": "promising_research_directions"}, {"score": 0.0035687137873965684, "phrase": "systematic_mapping_study"}, {"score": 0.003371159698962328, "phrase": "major_databases"}, {"score": 0.0032326031622964477, "phrase": "fifty-five_studies"}, {"score": 0.002963390095037466, "phrase": "architectural_elements"}, {"score": 0.002867227226349298, "phrase": "knowledge_recovery"}, {"score": 0.002816092821027267, "phrase": "architectural_design_decisions"}, {"score": 0.0027825094419000637, "phrase": "ignored_approach"}, {"score": 0.0026760974046034854, "phrase": "architectural_evaluation"}, {"score": 0.0026362590493392785, "phrase": "least_attention"}, {"score": 0.00262048982464897, "phrase": "architecture_impact_analysis"}, {"score": 0.002604814679863312, "phrase": "architectural_implementation"}, {"score": 0.0025660347613972573, "phrase": "study_results"}, {"score": 0.002543043781904587, "phrase": "increased_interest"}, {"score": 0.0024093494406195386, "phrase": "knowledge_capture"}, {"score": 0.0022151834590200953, "phrase": "wide_range"}, {"score": 0.0022019274077124795, "phrase": "application_domains"}, {"score": 0.00217565229221241, "phrase": "\"embedded_software"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Software architecture", " Architecting activity", " Knowledge-based approach", " Systematic mapping study"], "paper_abstract": "Context: Knowledge management technologies have been employed across software engineering activities for more than two decades. Knowledge-based approaches can be used to facilitate software architecting activities (e.g., architectural evaluation). However, there is no comprehensive understanding on how various knowledge-based approaches (e.g., knowledge reuse) are employed in software architecture. Objective: This work aims to collect studies on the application of knowledge-based approaches in software architecture and make a classification and thematic analysis on these studies, in order to identify the gaps in the existing application of knowledge-based approaches to various architecting activities, and promising research directions. Method: A systematic mapping study is conducted for identifying and analyzing the application of knowledge-based approaches in software architecture, covering the papers from major databases, journals, conferences, and workshops, published between January 2000 and March 2011. Results: Fifty-five studies were selected and classified according to the architecting activities they contribute to and the knowledge-based approaches employed. Knowledge capture and representation (e.g., using an ontology to describe architectural elements and their relationships) is the most popular approach employed in architecting activities. Knowledge recovery (e.g., documenting past architectural design decisions) is an ignored approach that is seldom used in software architecture. Knowledge-based approaches are mostly used in architectural evaluation, while receive the least attention in architecture impact analysis and architectural implementation. Conclusions: The study results show an increased interest in the application of knowledge-based approaches in software architecture in recent years. A number of knowledge-based approaches, including knowledge capture and representation, reuse, sharing, recovery, and reasoning, have been employed in a spectrum of architecting activities. Knowledge-based approaches have been applied to a wide range of application domains, among which \"Embedded software\" has received the most attention. (C) 2012 Elsevier B.V. All rights reserved.", "paper_title": "Application of knowledge-based approaches in software architecture: A systematic mapping study", "paper_id": "WOS:000317327000001"}