{"auto_keywords": [{"score": 0.049427070804729106, "phrase": "neutral_modeling_commands"}, {"score": 0.035240068277609664, "phrase": "nmc"}, {"score": 0.00481495049065317, "phrase": "heterogeneous_cad_systems"}, {"score": 0.004621148492564008, "phrase": "integration-based_solution"}, {"score": 0.004537525607322823, "phrase": "real-time_collaborative_design"}, {"score": 0.004160435626849478, "phrase": "product_models"}, {"score": 0.003920573616298175, "phrase": "proposed_collaborative_design_platform"}, {"score": 0.0036944890904337833, "phrase": "system_modeling_operations"}, {"score": 0.003091262582401731, "phrase": "corresponding_smos"}, {"score": 0.002926212333939311, "phrase": "product_data"}, {"score": 0.0028600623410146796, "phrase": "data_size"}, {"score": 0.0027322025124213566, "phrase": "real-time_synchronization"}, {"score": 0.0026582395558737855, "phrase": "standard_network_bandwidth"}, {"score": 0.0024706232839499546, "phrase": "different_sites"}, {"score": 0.002254571365634257, "phrase": "homogeneous_co-design_systems"}, {"score": 0.0021049977753042253, "phrase": "real-time_collaborative_design_platform"}], "paper_keywords": ["command-based", " real-time synchronization", " collaborative design", " CAD systems", " heterogeneous structure", " feature-based modeling", " interoperability"], "paper_abstract": "This paper presents an integration-based solution for developing a real-time collaborative design (co-design) platform on heterogeneous computer-aided design (CAD) systems. Different front the visualization-based approaches, the product models are allowed to be constructed and modified from various sites together in the proposed collaborative design platform. Our approach is based on a mechanism for the translation between system modeling operations (SMOs) and neutral modeling commands (NMCs). Every operation given by a user on one site is translated into a NMC and transmitted to all the other sites through the network, and then the received NMC is converted into corresponding SMOs on every other site, instantaneously. Since only the commands but not the product data are transferred, the data size under transmission is greatly reduced, so that a real-time synchronization can be achieved with a standard network bandwidth. In addition, by developing system-dependent SMO <-> NMC translators on different client CAD systems, users on different sites could join the collaboration by using their familiar CAD systems; this is the benefit that cannot be offered by the homogeneous co-design systems. The prototype implementation proves that our approach works well for integrating various current popular commercial CAD systems into a real-time collaborative design platform.", "paper_title": "Real-time collaborative design with heterogeneous CAD systems based on neutral modeling commands", "paper_id": "WOS:000247557100001"}