{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "distinctive_characteristics"}, {"score": 0.004552360432689039, "phrase": "zdzislaw_pawlak"}, {"score": 0.004271953920234395, "phrase": "special_theory"}, {"score": 0.003964007795174772, "phrase": "link_relation"}, {"score": 0.003556345965454902, "phrase": "new_forms"}, {"score": 0.003324614337607016, "phrase": "rough_set_methods"}, {"score": 0.003287482882222731, "phrase": "proposed_approach"}, {"score": 0.0032024424195797674, "phrase": "straightforward_extension"}, {"score": 0.0031666711243198992, "phrase": "rough_set_approach"}, {"score": 0.0031430451507177388, "phrase": "approximating_objects"}, {"score": 0.0030162086479223506, "phrase": "information_granules"}, {"score": 0.002916238693326477, "phrase": "usual_rough_set_approach"}, {"score": 0.002567498166608835, "phrase": "proposed_approximation_method"}, {"score": 0.002193600680263771, "phrase": "vague_concept"}, {"score": 0.0021049977753042253, "phrase": "domain_knowledge"}], "paper_keywords": ["approximation", " feature", " link relation", " near set", " part", " pattern recognition", " rough sets", " structured objects", " vagueness"], "paper_abstract": "The problem considered in this paper is how to approximate sets of objects that are qualitatively but not necessarily spatially near each other. The term qualitatively near is used here to mean closeness of descriptions or distinctive characteristics of objects. The solution to this problem is inspired by the work of Zdzislaw Pawlak during the early 1980s on the classification of objects by means of their attributes. This article introduces a special theory of the nearness of objects that are either static (do not change) or dynamic (change over time). The basic approach is to consider a link relation, which is defined relative to measurements associated with features shared by objects independent of their spatial relations. One of the outcomes of this work is the introduction of new forms of approximations of objects and sets of objects. The nearness of objects can be approximated using rough set methods. The proposed approach to approximation of objects is a straightforward extension of the rough set approach to approximating objects, where approximation can be considered in the context of information granules (neighborhoods). In addition, the usual rough set approach to concept approximation has been enriched by an increase in the number of granules (neighborhoods) associated with the classification of a concept as near to its approximation. A byproduct of the proposed approximation method is what we call a near set. It should also be observed that what is presented in this paper is considered a special (not a general) theory about nearness of objects. The contribution of this article is an approach to nearness as a vague concept which can be approximated from the state of objects and domain knowledge.", "paper_title": "Near sets. Special theory about nearness of objects", "paper_id": "WOS:000244426400024"}