{"auto_keywords": [{"score": 0.03335281015043783, "phrase": "citation_indicators"}, {"score": 0.03044596548228994, "phrase": "mendeley"}, {"score": 0.00481495049065317, "phrase": "alternative_metrics"}, {"score": 0.0047310525657970615, "phrase": "scientific_publications"}, {"score": 0.004282391936827106, "phrase": "performance_analysis"}, {"score": 0.00408617426304956, "phrase": "based_tool_impact_story"}, {"score": 0.003447035529485425, "phrase": "document_types"}, {"score": 0.0033868916699805224, "phrase": "publication_years"}, {"score": 0.003101503914610488, "phrase": "main_result"}, {"score": 0.0029766550209309127, "phrase": "altmetrics_source"}, {"score": 0.0026313840069327713, "phrase": "marginal_information"}, {"score": 0.0021049977753042253, "phrase": "research_lines"}], "paper_keywords": ["Altmetrics", " Impact Story", " Citation indicators", " Research evaluation"], "paper_abstract": "In this paper an analysis of the presence and possibilities of altmetrics for bibliometric and performance analysis is carried out. Using the web based tool Impact Story, we collected metrics for 20,000 random publications from the Web of Science. We studied both the presence and distribution of altmetrics in the set of publications, across fields, document types and over publication years, as well as the extent to which altmetrics correlate with citation indicators. The main result of the study is that the altmetrics source that provides the most metrics is Mendeley, with metrics on readerships for 62.6% of all the publications studied, other sources only provide marginal information. In terms of relation with citations, a moderate spearman correlation (r = 0.49) has been found between Mendeley readership counts and citation indicators. Other possibilities and limitations of these indicators are discussed and future research lines are outlined.", "paper_title": "How well developed are altmetrics? A cross-disciplinary analysis of the presence of 'alternative metrics' in scientific publications", "paper_id": "WOS:000343609900036"}