{"auto_keywords": [{"score": 0.049571431541439746, "phrase": "e-learning_models"}, {"score": 0.04318562459045211, "phrase": "learning_designs"}, {"score": 0.00481495049065317, "phrase": "automatic_compilation"}, {"score": 0.004565007074039171, "phrase": "general_approach"}, {"score": 0.004038076978795421, "phrase": "existing_domain-independent_planners"}, {"score": 0.003422462630994095, "phrase": "full_spectrum"}, {"score": 0.0033861224940737846, "phrase": "planning_paradigms"}, {"score": 0.003244567402785763, "phrase": "current_planners"}, {"score": 0.002994859407965545, "phrase": "conditional_effects"}, {"score": 0.002900426826591769, "phrase": "pddl_durative_actions"}, {"score": 0.002592693161475495, "phrase": "management_platforms"}, {"score": 0.0025109095718850376, "phrase": "extensive_analysis"}, {"score": 0.002470987929071079, "phrase": "e-learning_metadata_specification"}, {"score": 0.002317533977770783, "phrase": "knowledge_engineering_procedures"}, {"score": 0.0021620042653528846, "phrase": "qualitative_and_quantitative_experimentation"}], "paper_keywords": [""], "paper_abstract": "This paper presents a general approach to automatically compile e-learning models to planning, allowing us to easily generate plans, in the form of learning designs, by using existing domain-independent planners. The idea is to compile, first, a course defined in a standard e-learning language into a planning domain, and, second, a file containing students learning information into a planning problem. We provide a common compilation and extend it to three particular approaches that cover a full spectrum of planning paradigms, which increases the possibilities of using current planners: (i) hierarchical, (ii) including PDDL (Planning Domain Definition Language) actions with conditional effects and (iii) including PDDL durative actions. The learning designs are automatically generated from the plans and can be uploaded, and subsequently executed, by learning management platforms. We also provide an extensive analysis of the e-learning metadata specification required for planning, and the pros and cons on the knowledge engineering procedures used in each of the three compilations. Finally, we include some qualitative and quantitative experimentation of the compilations in several domain-independent planners to measure its scalability and applicability.", "paper_title": "On the automatic compilation of e-learning models to planning", "paper_id": "WOS:000318629400002"}