{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "ttl-based_consistency"}, {"score": 0.006690968582999833, "phrase": "content_sharing"}, {"score": 0.005112819777786225, "phrase": "search_performance"}, {"score": 0.004663533386096864, "phrase": "peer_networks"}, {"score": 0.004621148492564008, "phrase": "consistency_maintenance"}, {"score": 0.004475798524102238, "phrase": "dynamic_contents"}, {"score": 0.004066498558415824, "phrase": "ttl-based_consistency_maintenance"}, {"score": 0.0037971749182744334, "phrase": "expiration_time"}, {"score": 0.0036776458116294986, "phrase": "new_requests"}, {"score": 0.0032358709481309913, "phrase": "analytical_model"}, {"score": 0.0029802289354540507, "phrase": "random_nature"}, {"score": 0.002953097497434808, "phrase": "request_routing"}, {"score": 0.002769950045729965, "phrase": "valid_replica"}, {"score": 0.002349357968054711, "phrase": "search_cost"}, {"score": 0.0023067494372458427, "phrase": "decreasing_freshness"}], "paper_keywords": ["Unstructured P2P network", " TTL-based consistency", " replication", " consistency maintenance", " content distribution"], "paper_abstract": "Consistency maintenance is important to the sharing of dynamic contents in peer-to-peer (P2P) networks. The TTL-based mechanism is a natural choice for maintaining freshness in P2P content sharing. This paper investigates TTL-based consistency maintenance in unstructured P2P networks. In this approach, each replica is assigned an expiration time beyond which the replica stops serving new requests unless it is validated. While TTL-based consistency is widely explored in many client-server applications, there has been no study on TTL-based consistency in P2P networks. Our main contribution is an analytical model that studies the search performance and the freshness of P2P content sharing under TTL-based consistency. Due to the random nature of request routing, P2P networks are fundamentally different from most existing TTL-based systems in that every node with a valid replica has the potential to serve any other node. We identify and discuss the factors that affect the performance of P2P content sharing under TTL-based consistency. Our results indicate a tradeoff between search performance and freshness: the search cost decreases sublinearly with decreasing freshness of P2P content sharing. We also compare two types of unstructured P2P networks and find that clustered P2P networks improve the freshness of content sharing over flat P2P networks under TTL-based consistency.", "paper_title": "Analysis of TTL-Based Consistency in Unstructured Peer-to-Peer Networks", "paper_id": "WOS:000260309000007"}