{"auto_keywords": [{"score": 0.042151584995031445, "phrase": "tfd"}, {"score": 0.00481495049065317, "phrase": "eeg_signals"}, {"score": 0.004669845451682529, "phrase": "novel_recognition_algorithm"}, {"score": 0.004392565073466714, "phrase": "benchmark_dataset"}, {"score": 0.004053362743156545, "phrase": "bilinear_time-frequency_distributions"}, {"score": 0.003961330917648707, "phrase": "eeg_signal"}, {"score": 0.003769006950727621, "phrase": "multi-class_problem"}, {"score": 0.003669330508576073, "phrase": "support_vector_machine"}, {"score": 0.0035586268203884673, "phrase": "binary_subproblem-dependent_feature_libraries"}, {"score": 0.0034911335714333507, "phrase": "biologically_inspired_features"}, {"score": 0.0034512514926836667, "phrase": "conditional_moments"}, {"score": 0.0034118234596993836, "phrase": "eeg_tfd."}, {"score": 0.003208999546225013, "phrase": "prior_work"}, {"score": 0.0029722900280316216, "phrase": "classification_accuracy"}, {"score": 0.0027424619603260837, "phrase": "classification_accuracies"}, {"score": 0.0025014259919355453, "phrase": "statistical_sense"}, {"score": 0.0024633601573822114, "phrase": "significant_departure"}, {"score": 0.0022815262950738814, "phrase": "newly_introduced_algorithm"}, {"score": 0.0022296340517805125, "phrase": "best_reported_accuracy"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Electroencephalogram (EEG) signals", " Bilinear time-frequency distributions (TFD)", " Support vector machine (SVM)"], "paper_abstract": "In this paper we propose a novel recognition algorithm for the discrimination of epilepsy based on electroencephalogram (EEG) signals. We validate the algorithm on a benchmark dataset in order to compare the algorithm with other algorithms in the literature. More specifically, features were extracted from the bilinear time-frequency distributions (TFD) of the EEG signal. A one-against-one decomposition is used to break the multi-class problem into binary subproblems solvable with a support vector machine (SVM). The decomposition permitted binary subproblem-dependent feature libraries to be constructed from biologically inspired features derived from conditional moments calculated from EEG TFD. This results in a flexible, class-dependent feature selection based on a forward selection wrapper representing a departure from prior work which tends to utilize the same set of features to delineate all classes. We investigated the sensitivity of the classification accuracy to changes in the proportion of data used to train the algorithm. It was found that the distribution of classification accuracies was statistically similar over a range of proportions of data used to train the algorithm. This served to validate our algorithm in a statistical sense and represents a significant departure from literature, which tends to report only the best result for a given classification algorithm. To the best of our knowledge, the newly introduced algorithm is able to outperform the best reported accuracy in literature for the problem considered in this paper. (c) 2012 Elsevier Ltd. All rights reserved.", "paper_title": "Time-frequency distributions in the classification of epilepsy from EEG signals", "paper_id": "WOS:000305204600009"}