{"auto_keywords": [{"score": 0.044222651518052894, "phrase": "spam_fingerprinting"}, {"score": 0.014584264160772522, "phrase": "nilsimsa"}, {"score": 0.012371983344700398, "phrase": "per-packet_basis"}, {"score": 0.009800255391605405, "phrase": "packet_level"}, {"score": 0.00481495049065317, "phrase": "spam_detection"}, {"score": 0.004677965073019951, "phrase": "stateless_open-digest_spam_fingerprinting"}, {"score": 0.004479726755921316, "phrase": "open-digest_fingerprinting_algorithm"}, {"score": 0.004320932773749168, "phrase": "gateway_level"}, {"score": 0.0038356264368681107, "phrase": "fast_email_class_estimation"}, {"score": 0.0035554741718298085, "phrase": "spam_detection_status"}, {"score": 0.0034918342672996066, "phrase": "last_packet"}, {"score": 0.0029041492019217033, "phrase": "byte_streams"}, {"score": 0.0028418430688995247, "phrase": "packet_reordering"}, {"score": 0.0027708353425467927, "phrase": "different_packet_sizes"}, {"score": 0.002721201438773336, "phrase": "random_addition_attacks"}, {"score": 0.0026628098176168682, "phrase": "proposed_packet-level_fingerprinting"}, {"score": 0.0025868936783877035, "phrase": "similarity_threshold"}, {"score": 0.002363293825140551, "phrase": "full_email_abstraction"}, {"score": 0.002198380879018061, "phrase": "high_confidence"}, {"score": 0.0021746545596056125, "phrase": "viable_spam_control_implementation"}, {"score": 0.0021049977753042253, "phrase": "john_wiley"}], "paper_keywords": [""], "paper_abstract": "This paper proposes a stateless open-digest spam fingerprinting at the packet level (layer 3) based on an open-digest fingerprinting algorithm Nilsimsa. Spam emails show several characteristics when viewed at gateway level, which are suitable for spam fingerprinting: (a) content invariance and (b) recipient address dispersion. In this paper, Nilsimsa is adapted to support both fingerprinting and fast email class estimation, on a per-packet basis. Email packets are incrementally fingerprinted on a per-packet basis, without the need for reassembly. Spam detection status is tagged to the last packet of each email. This in turn allows fast email class estimation (spam detection) at receiving email servers to support more effective spam handling on both inbound and outbound (relayed) emails. The work presented in this paper focuses on evaluating the accuracy of spam fingerprinting at the packet level with consideration on the constraints of processing byte streams over the network, including packet reordering, fragmentation, overlapped bytes, different packet sizes, and possibilities of random addition attacks. Results show that the proposed packet-level fingerprinting can detect spam with 100% random addition when the similarity threshold is set to between 36 and 59. This method gives 0% false positive and 100% true negative, which equals the performance attained for spam fingerprinting at full email abstraction (layer 7). This shows that classifying emails at the packet level can differentiate non-spam from spam with high confidence for a viable spam control implementation on middleboxes. Copyright (C) 2011 John Wiley & Sons, Ltd.", "paper_title": "Packet-level open-digest fingerprinting for spam detection on middleboxes", "paper_id": "WOS:000299097700002"}