{"auto_keywords": [{"score": 0.03255191289960549, "phrase": "android-based_multimedia_device"}, {"score": 0.00481495049065317, "phrase": "recommender_system"}, {"score": 0.004772668787820885, "phrase": "consumer_electronic_device"}, {"score": 0.0046480280613451, "phrase": "android_devices"}, {"score": 0.004395497096725058, "phrase": "android"}, {"score": 0.004205715668397308, "phrase": "consumer_electronics"}, {"score": 0.004047900367753568, "phrase": "recommendation_systems"}, {"score": 0.0039421123723827655, "phrase": "overwhelming_majority"}, {"score": 0.0037941508352767462, "phrase": "powerful_servers"}, {"score": 0.003705861051897777, "phrase": "different_types"}, {"score": 0.0034939895980892646, "phrase": "different_parameters"}, {"score": 0.0034227226677308337, "phrase": "previous_consumed_items"}, {"score": 0.0033529044784726477, "phrase": "similar_taste"}, {"score": 0.003236502732219314, "phrase": "new_challenge"}, {"score": 0.003133343395515431, "phrase": "recommendation_system"}, {"score": 0.0029023566651314604, "phrase": "previous_ratings"}, {"score": 0.0028768215428376185, "phrase": "main_challenges"}, {"score": 0.002720221357742017, "phrase": "limited_processing_capabilities"}, {"score": 0.002594961351159294, "phrase": "final_system"}, {"score": 0.0023132192903270233, "phrase": "first_recommender_systems"}, {"score": 0.002279379132030189, "phrase": "multimedia_device"}, {"score": 0.0022394223018992496, "phrase": "dedicated_server"}, {"score": 0.002200164358389725, "phrase": "recommendation_algorithms"}], "paper_keywords": ["Recommender system", " Movies", " Android", " Commercial device", " Consumer electronics"], "paper_abstract": "Nowadays we can witness the proliferation of Android devices, mostly smartphones and tablets. We are particularly interested in one of these types of devices (Android-based multimedia devices) that are also finding their place in the world of consumer electronics. Part of our previous work is related to the design and development of recommendation systems always under the same conditions (shared by the overwhelming majority of these systems): the process of recommendation is executed by powerful servers that try to recommend to the users different types of items (movies, tv series, music, etc.) that will suit them according to different parameters, like their profile, their ratings of previous consumed items, the ratings of people with similar taste, etc. In this paper, we will face a new challenge: we will use our previous background to design and implement a recommendation system that will run in an Android-based multimedia device. In particular, this system will recommend movies to the users that fit in well with their profile and previous ratings. The main challenges that will face the design of this system are the restrictions of this kind of devices, like limited processing capabilities, sharing the CPU with more important processes, restricted connection to Internet, etc. The final system must be able to recommend contents to the user, both available locally or online. The significance of this paper lies in the fact that, to the best of our knowledge, our development is one of the first recommender systems running completely in a multimedia device without the support of a dedicated server for the execution of the recommendation algorithms. Our development is expected to be included soon in an Android-based multimedia device sold by the Spanish company Blu:Sens. (C) 2015 Elsevier Ltd. All rights reserved,", "paper_title": "Developing a recommender system in a consumer electronic device", "paper_id": "WOS:000352748900005"}