{"auto_keywords": [{"score": 0.0046621835537196754, "phrase": "arbitrary_points"}, {"score": 0.0040978781692373005, "phrase": "other's_range"}, {"score": 0.0039677715255034595, "phrase": "initial_positions"}, {"score": 0.003749908582313067, "phrase": "different_positive_integer_label"}, {"score": 0.003704797078215222, "phrase": "possibly_different_speed"}, {"score": 0.003487222504700868, "phrase": "cardinal_directions"}, {"score": 0.0031020367403802773, "phrase": "initial_position"}, {"score": 0.002931569771634119, "phrase": "global_system"}, {"score": 0.0027929100418926725, "phrase": "deterministic_algorithm"}, {"score": 0.002639385610609024, "phrase": "unknown_initial_distance"}, {"score": 0.002534906456854208, "phrase": "smaller_label"}, {"score": 0.0024642355970277497, "phrase": "larger_speed"}, {"score": 0.002165388556451298, "phrase": "network_problem"}, {"score": 0.0021049977753042253, "phrase": "infinite_grid"}], "paper_keywords": ["Mobile agent", " Rendezvous", " Plane", " Infinite grid", " Deterministic algorithm", " Polynomial time"], "paper_abstract": "Two mobile agents with range of vision 1 start at arbitrary points in the plane and have to accomplish the task of approach, which consists in getting at distance at most one from each other, i.e., in getting within each other's range of vision. An adversary chooses the initial positions of the agents, their possibly different starting times, and assigns a different positive integer label and a possibly different speed to each of them. Each agent is equipped with a compass showing the cardinal directions, with a measure of length and a clock. Each agent knows its label and speed but not those of the other agent and it does not know the initial position of the other agent relative to its own. Agents do not have any global system of coordinates and they cannot communicate. Our main result is a deterministic algorithm to accomplish the task of approach, working in time polynomial in the unknown initial distance between the agents, in the length of the smaller label and in the inverse of the larger speed. The distance travelled by each agent until approach is polynomial in the first two parameters and does not depend on the third. The problem of approach in the plane reduces to a network problem: that of rendezvous in an infinite grid.", "paper_title": "Deterministic polynomial approach in the plane", "paper_id": "WOS:000352082600003"}