{"auto_keywords": [{"score": 0.047733319135018146, "phrase": "map_solution"}, {"score": 0.00481495049065317, "phrase": "efficient_energy_minimization_for_enforcing_label_statistics"}, {"score": 0.004777917315737992, "phrase": "energy_minimization_algorithms"}, {"score": 0.004704699244406775, "phrase": "graph_cuts"}, {"score": 0.004491678520807451, "phrase": "markov_random_fields"}, {"score": 0.0042388570312522, "phrase": "ground_truth_solution"}, {"score": 0.004031238480458909, "phrase": "ground_truth"}, {"score": 0.00393886140366453, "phrase": "image_segmentation"}, {"score": 0.0038634933357842302, "phrase": "boundary_length"}, {"score": 0.00337603133805026, "phrase": "np"}, {"score": 0.0032341432727280707, "phrase": "linear_programming_formulations"}, {"score": 0.00317221667574882, "phrase": "integrality_constraints"}, {"score": 0.0030994630902300133, "phrase": "novel_method"}, {"score": 0.0030401074516310184, "phrase": "discrete_approximate_solution"}, {"score": 0.002961008712919444, "phrase": "lagrangian"}, {"score": 0.002846647336160784, "phrase": "constrained_energy_minimization_problem"}, {"score": 0.002792119634261638, "phrase": "polynomial_time"}, {"score": 0.0025942468561537682, "phrase": "second_order_constraints"}, {"score": 0.00257424957319189, "phrase": "both-side_inequalities"}, {"score": 0.0025445415633818472, "phrase": "weak_restriction"}, {"score": 0.0021965609224818853, "phrase": "impressive_segmentation_results"}, {"score": 0.0021049977753042253, "phrase": "state-of-the-art_lp_relaxation"}], "paper_keywords": ["Computer vision", " image segmentation", " energy minimization", " Markov random fields"], "paper_abstract": "Energy minimization algorithms, such as graph cuts, enable the computation of the MAP solution under certain probabilistic models such as Markov random fields. However, for many computer vision problems, the MAP solution under the model is not the ground truth solution. In many problem scenarios, the system has access to certain statistics of the ground truth. For instance, in image segmentation, the area and boundary length of the object may be known. In these cases, we want to estimate the most probable solution that is consistent with such statistics, i.e., satisfies certain equality or inequality constraints. The above constrained energy minimization problem is NP-hard in general, and is usually solved using Linear Programming formulations, which relax the integrality constraints. This paper proposes a novel method that directly finds the discrete approximate solution of such problems by maximizing the corresponding Lagrangian dual. This method can be applied to any constrained energy minimization problem whose unconstrained version is polynomial time solvable, and can handle multiple, equality or inequality, and linear or non-linear constraints. One important advantage of our method is the ability to handle second order constraints with both-side inequalities with a weak restriction, not trivial in the relaxation based methods, and show that the restriction does not affect the accuracy in our cases. We demonstrate the efficacy of our method on the foreground/background image segmentation problem, and show that it produces impressive segmentation results with less error, and runs more than 20 times faster than the state-of-the-art LP relaxation based approaches.", "paper_title": "Efficient Energy Minimization for Enforcing Label Statistics", "paper_id": "WOS:000340210100015"}