{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "total_weighted_resource_tardiness_penalty_costs"}, {"score": 0.03620993924304285, "phrase": "resource_type"}, {"score": 0.02773295111355378, "phrase": "search_tree"}, {"score": 0.004761732436126133, "phrase": "resource-constrained_project"}, {"score": 0.004639822587124109, "phrase": "optimal_solution_procedure"}, {"score": 0.004537804310268603, "phrase": "resource-constrained_project_scheduling_problem"}, {"score": 0.0043889488321824785, "phrase": "constrained_renewable_resources"}, {"score": 0.0038548668648948044, "phrase": "dictated_ready_date"}, {"score": 0.003784049616066444, "phrase": "due_date"}, {"score": 0.0034875380341306468, "phrase": "penalty_cost"}, {"score": 0.003074197032561992, "phrase": "minimal_total_weighted_resource_tardiness_penalty_costs"}, {"score": 0.0029732094730218488, "phrase": "branch-and-bound_algorithm"}, {"score": 0.00265987582861194, "phrase": "resource_constraints"}, {"score": 0.0024786956187352327, "phrase": "undirected_arc"}, {"score": 0.0024421501497321027, "phrase": "selection_sequence"}, {"score": 0.0024240794798626674, "phrase": "undirected_arcs"}, {"score": 0.0022927343007881846, "phrase": "different_rules"}, {"score": 0.0021604504765314497, "phrase": "randomly_generated_benchmark_problem"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Resource-constrained project scheduling", " Weighted tardiness", " Branch-and-bound"], "paper_abstract": "We present an optimal solution procedure for minimizing total weighted resource tardiness penalty costs in the resource-constrained project scheduling problem. In this problem, we assume the constrained renewable resources are limited to very expensive equipments and machines that are used in other projects and are not available in all periods of time of a project. In other words, for each resource, there is a dictated ready date as well as a due date such that no resource can be available before its ready date but the resources are permitted to be used after their due dates by paying penalty cost depending on the resource type. We also assume that only one unit of each resource type is available and no activity needs more than it for execution. The objective is to determine a schedule with minimal total weighted resource tardiness penalty costs. For this purpose, we present a branch-and-bound algorithm in which the branching scheme starts from a graph representing a set of conjunctions (the classical finish-start precedence constraints) and disjunctions (introduced by the resource constraints). In the search tree, each node is branched to two child nodes based on the two opposite directions of each undirected arc of disjunctions. Selection sequence of undirected arcs in the search tree affects the performance of the algorithm. Hence, we developed different rules for this issue and compare the performance of the algorithm under these rules using a randomly generated benchmark problem set. (C) 2011 Elsevier Ltd. All rights reserved.", "paper_title": "An optimal procedure for minimizing total weighted resource tardiness penalty costs in the resource-constrained project scheduling problem", "paper_id": "WOS:000300808000024"}