{"auto_keywords": [{"score": 0.03984155151800544, "phrase": "sigma"}, {"score": 0.010225344877638503, "phrase": "property_matching"}, {"score": 0.010038260146181558, "phrase": "weighted_matching_problems"}, {"score": 0.007444218243906784, "phrase": "pattern_p"}, {"score": 0.00481495049065317, "phrase": "pattern_matching"}, {"score": 0.0044289730051264116, "phrase": "text_part"}, {"score": 0.003393373193137233, "phrase": "sought_pattern"}, {"score": 0.0031795757989482734, "phrase": "property_pi"}, {"score": 0.003140401552000472, "phrase": "practical_use"}, {"score": 0.003007042361814046, "phrase": "weighted_sequences"}, {"score": 0.0028087949095629955, "phrase": "weighted_sequence"}, {"score": 0.0027827907725673845, "phrase": "\"statistical_image"}, {"score": 0.002664577164029313, "phrase": "symbol's_occurrence"}, {"score": 0.0026399046763432906, "phrase": "text_location"}, {"score": 0.0024965820893532286, "phrase": "weighted_matching_to_property_matching"}, {"score": 0.0024278584953697597, "phrase": "numerous_weighted_matching_problems"}, {"score": 0.002375714262344562, "phrase": "parameterized_matching"}, {"score": 0.002361022183015472, "phrase": "approximate_matching"}, {"score": 0.002253682813700968, "phrase": "probability_epsilon"}, {"score": 0.002239743716564573, "phrase": "weighted_text_t"}, {"score": 0.0021246816854197732, "phrase": "text_t"}], "paper_keywords": [""], "paper_abstract": "Pattern Matching with Properties (Property Matching, for short), involves a string matching between the pattern and the text, and the requirement that the text part satisfies some property. It is straightforward to do sequential matching in a text with properties. However, indexing in a text with properties becomes difficult if we desire the time to be output dependent. We present an algorithm for indexing a text with properties in O(n log vertical bar Sigma vertical bar + n log log n) time for preprocessing and O(vertical bar P vertical bar log vertical bar Sigma vertical bar + tocc(pi)) per query, where n is the length of the text, P is the sought pattern, Sigma is the alphabet, and tocc(pi) is the number of occurrences of the pattern that satisfy some property pi. As a practical use of Property Matching we show how to solve Weighted Matching problems using techniques from Property Matching. Weighted sequences have been introduced as a tool to handle a set of sequences that are not identical but have many local similarities. The weighted sequence is a \"statistical image\" of this set, where we are given the probability of every symbol's occurrence at every text location. Weighted matching problems are pattern matching problems where the given text is weighted. We present a reduction from Weighted Matching to Property Matching that allows off-the-shelf solutions to numerous weighted matching problems including indexing, swapped matching, parameterized matching, approximate matching, and many more. Assuming that one seeks the occurrence of pattern P with probability epsilon in weighted text T of length n, we reduce the problem to a property matching problem of pattern P in text T' of length O(n((epsilon)/(1))(2)log(epsilon)(/)1).", "paper_title": "Property matching and weighted matching", "paper_id": "WOS:000239421700018"}