{"auto_keywords": [{"score": 0.03512483296211503, "phrase": "iterative_error"}, {"score": 0.0125981931747526, "phrase": "discretization_error"}, {"score": 0.010612387000973441, "phrase": "numerical_error"}, {"score": 0.010442835926377668, "phrase": "grid_refinement_studies"}, {"score": 0.010193522700775916, "phrase": "manufactured_solutions"}, {"score": 0.008434014992987687, "phrase": "iterative_and_discretization_errors"}, {"score": 0.004404445045826858, "phrase": "numerical_uncertainty"}, {"score": 0.004161553532799662, "phrase": "exact_solution"}, {"score": 0.004061584718427419, "phrase": "numerical_solution"}, {"score": 0.004028796143006953, "phrase": "machine_accuracy"}, {"score": 0.003932003833923186, "phrase": "exact_error"}, {"score": 0.00386876598761639, "phrase": "distinct_contributions"}, {"score": 0.0035100601949451028, "phrase": "safety_factor"}, {"score": 0.0029008064765926414, "phrase": "reliable_iterative_error_estimator"}, {"score": 0.0028541057064952876, "phrase": "geometric-progression_extrapolation"}, {"score": 0.0028195727965553367, "phrase": "l-infinity_norm"}, {"score": 0.002685558057339722, "phrase": "negligible_influence"}, {"score": 0.002246292543825748, "phrase": "reliable_estimate"}, {"score": 0.002183428991165874, "phrase": "rms"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": [""], "paper_abstract": "This article presents a study on the estimation of the numerical uncertainty based on grid refinement studies with the method of manufactured solutions. The availability of an exact solution and the convergence of the numerical solution to machine accuracy allow the determination of the exact error and of the distinct contributions of the iterative and discretization errors. The study focuses on three different problems of error/uncertainty evaluation (the uncertainty is in this case the error multiplied by a safety factor): the estimation of the iterative error/uncertainty; the influence of the iterative error on the estimation of the discretization error/uncertainty, and the overall numerical error/uncertainty as a combination of the iterative and discretization errors. The results obtained in this study show that it is possible to obtain a reliable iterative error estimator based on a geometric-progression extrapolation of the L-infinity norm of the differences between iterations. In order to obtain a negligible influence of the iterative error on the estimation of the discretization error, the iterative error Must be two to three orders of magnitude smaller than the discretization error. If the iterative error is non-negligible it should be added, simply arithmetically, to the discretization error to obtain a reliable estimate of the numerical error: combining by RMS is not conservative. (C) 2009 Elsevier Ltd. All rights reserved.", "paper_title": "Evaluation of numerical error estimation based on grid refinement studies with the method of the manufactured solutions", "paper_id": "WOS:000267201100008"}