{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "application_market"}, {"score": 0.004585219872557599, "phrase": "iam"}, {"score": 0.004430920292612374, "phrase": "effective_approach"}, {"score": 0.004387793971765289, "phrase": "service_distribution"}, {"score": 0.004097389262726735, "phrase": "systematic_mechanism"}, {"score": 0.0036612804491481985, "phrase": "itm"}, {"score": 0.0034863899423238707, "phrase": "end_users"}, {"score": 0.003385480888810982, "phrase": "application_trustworthiness"}, {"score": 0.003192312493850036, "phrase": "application's_behavior"}, {"score": 0.002966230968271199, "phrase": "evaluation_vector"}, {"score": 0.002937318465594425, "phrase": "feedback_vector_feature"}, {"score": 0.0027832502848247303, "phrase": "end_devices"}, {"score": 0.0027159094186967247, "phrase": "mathematical_form"}, {"score": 0.002498873893632726, "phrase": "users'_device"}, {"score": 0.002474505516708906, "phrase": "strong_evidence"}], "paper_keywords": ["Evaluation vector", " feedback vector", " interactive trust model (ITM)", " Internet of Things (IoT)", " IoT application market (IAM)"], "paper_abstract": "The Internet of Things (IoT) application market (IAM) is supposed to be an effective approach for service distribution in the era of IoT. To protect the privacy and security of users, a systematic mechanism to determine the trustworthiness of the applications in the IAM is demanded. In this paper, an interactive trust model (ITM) is proposed based on interaction between application market and end users. In this model, application trustworthiness (AT) is quantitatively evaluated by the similarity between the application's behavior and the behavior expected by the user. In particular, by using the evaluation vector and feedback vector feature of application in the marketplace and behavior of applications on end devices can be exchanged in mathematical form to establish the connection between market and users. Behavior-based detecting agent on a users' device gives strong evidence about what applications have done to your privacy and security issues. Indicators derived by this model are presented in the market along with the application, and it helps users to more efficiently select the most appropriate application from the market.", "paper_title": "An Interactive Trust Model for Application Market of the Internet of Things", "paper_id": "WOS:000336669800066"}