{"auto_keywords": [{"score": 0.0491926057107896, "phrase": "tubulin_polymerization"}, {"score": 0.015318022041347912, "phrase": "small_molecules"}, {"score": 0.00481495049065317, "phrase": "classification_model_batteries"}, {"score": 0.004008749730113699, "phrase": "subsequent_prediction"}, {"score": 0.0034001358540125303, "phrase": "training_sets"}, {"score": 0.0033748469653250633, "phrase": "tr"}, {"score": 0.0033370841436001597, "phrase": "test_sets"}, {"score": 0.003312245656286393, "phrase": "ts"}, {"score": 0.003226513431715486, "phrase": "different_tr_sets"}, {"score": 0.003107935254560724, "phrase": "binary_classification"}, {"score": 0.003073216350080926, "phrase": "relevant_ts_sets"}, {"score": 0.0030162086479223506, "phrase": "model_performance"}, {"score": 0.0028301536956600137, "phrase": "rigorously_validated_models"}, {"score": 0.0027057544777834086, "phrase": "individual_models"}, {"score": 0.00264561514767961, "phrase": "best_predictive_capability"}, {"score": 0.002548331088496964, "phrase": "entire_battery"}, {"score": 0.0024546155360991567, "phrase": "predictive_power"}, {"score": 0.002382124723569496, "phrase": "applicability_domain"}, {"score": 0.0023291617361832157, "phrase": "cm_batteries"}, {"score": 0.0022434880661725493, "phrase": "new_chemical_entity"}, {"score": 0.002152874480615438, "phrase": "anticancer_drug_discovery_program"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Anticancer agents", " Decision tree", " Classification model", " Tubulin polymerization"], "paper_abstract": "The development of two classification model (CM) batteries capable of discerning the ability of small molecules to inhibit tubulin polymerization is described. Approximately 550 compounds collected from the literature were utilized to calculate approximately 1000 molecular descriptors. After randomly culling 50 compounds to serve as a subsequent prediction set (PS) for validation, the remainder was used to set up two datasets, one where molecules were considered active or not with an IC(50) threshold of 10 mu M and the other with an IC(50) threshold of 1 mu M. Each dataset was rationally split into training sets (TR) and test sets (TS). Several hundred CMs were obtained using different TR sets, many different \"decision tree\" algorithms and different end-point thresholds for binary classification. The relevant TS sets were used to assess model performance and to reduce the number of models to 15 for each of the two IC(50)-threshold datasets. The rigorously validated models were further tested for their predictive capability on the prediction set. Although individual models that proved to have the best predictive capability would be useful, we found that using the entire battery of 15 models for each of the datasets strengthens the predictive power significantly approaching 100% certainty for molecules within the applicability domain of the models. These CM batteries should be quite valuable to assess the potential any new chemical entity proposed for synthesis as an inhibitor of tubulin polymerization in an anticancer drug discovery program. (C) 2011 Elsevier B.V. All rights reserved.", "paper_title": "Development of classification model batteries for predicting inhibition of tubulin polymerization by small molecules", "paper_id": "WOS:000291714700024"}