{"auto_keywords": [{"score": 0.0268129337045441, "phrase": "nses"}, {"score": 0.00481495049065317, "phrase": "intermediary-based_science_standards"}, {"score": 0.004569293780076254, "phrase": "standard_alignment_tool"}, {"score": 0.004310949776826717, "phrase": "intermediary-based_crosswalking"}, {"score": 0.004114787982556699, "phrase": "increasing_availability"}, {"score": 0.003705323407433896, "phrase": "educational_standards"}, {"score": 0.0036411406244705557, "phrase": "significant_and_continuous_challenge"}, {"score": 0.0029694040368299624, "phrase": "machine-based_standard_alignment_tool"}, {"score": 0.002736694413701639, "phrase": "different_standard-authoring_bodies"}, {"score": 0.0026119782818898193, "phrase": "intermediary-based_alignments"}, {"score": 0.002435453488008121, "phrase": "strong_variation"}, {"score": 0.0024072121760839427, "phrase": "authoring_bodies"}, {"score": 0.0022974765563692776, "phrase": "best_results"}, {"score": 0.0021049977753042253, "phrase": "strong_inverse_relationship"}], "paper_keywords": ["computerized cataloging", " automatic classification", " data mining"], "paper_abstract": "We explore the feasibility of intermediary-based crosswalking and alignment of K-12 science education standards. With the increasing availability of K-12 science, technology, engineering, and mathematics (STEM) digital library content, alignment of that content with educational standards is a significant and continuous challenge. Whereas direct, one-to-one alignment of standards is preferable but currently unsustainable in its resource demands, less resource-intensive intermediary-based alignment offers an interesting alternative. But will it work? We present the results from an experiment in which the machine-based Standard Alignment Tool (SAT)incorporated in the National Science Digital Library (NSDL)was used to collect over half a million direct alignments between standards from different standard-authoring bodies. These were then used to compute intermediary-based alignments derived from the well-known AAAS Project 2061 Benchmarks and NSES standards. The results show strong variation among authoring bodies in their success at crosswalking, with the best results for those who modeled their standards on the intermediaries. The results furthermore show a strong inverse relationship between recall and precision when both intermediates were involved in the crosswalking.", "paper_title": "Can intermediary-based science standards crosswalking work? Some evidence from mining the standard alignment tool (SAT)", "paper_id": "WOS:000307730000011"}