{"auto_keywords": [{"score": 0.030501511023150654, "phrase": "newton-raphson_method"}, {"score": 0.02275720620844804, "phrase": "modified_fixed-point_method"}, {"score": 0.009436821997089331, "phrase": "fixed-point_method"}, {"score": 0.00481495049065317, "phrase": "nonlinear_magnetic_field_analysis"}, {"score": 0.00465067040500426, "phrase": "purpose_-_the"}, {"score": 0.0028195727965553367, "phrase": "convergence_characteristic"}, {"score": 0.002761340122199076, "phrase": "newly_proposed_fixed-point_method"}, {"score": 0.002320449502337321, "phrase": "similar_convergence_property"}, {"score": 0.0022255425106527727, "phrase": "isotropic_nonlinear_problem"}, {"score": 0.0021049977753042253, "phrase": "formulation_and_convergence_characteristic"}], "paper_keywords": ["Finite element methods", " Fixed-point method", " Newton-Raphson method", " Non-linear analysis", " Finite element analysis", " Magnetic fields"], "paper_abstract": "Purpose - The purpose of this paper is to propose the speed-up of the fixed-point method by updating the reluctivity at each iteration (this is called a modified fixed-point method). Design/methodology/approach - A modified fixed-point method, which updates the derivative of reluctivity at each iteration, is proposed. It is shown that the formulation of the fixed-point method using the derivative of reluctivity is almost the same as that of the Newton-Raphson method. The convergence characteristic of the newly proposed fixed-point method is compared with those of the Newton-Raphson method. Findings - The modified fixed-point method has an advantage that the programming is easy and it has a similar convergence property to the Newton-Raphson method for an isotropic nonlinear problem. Originality/value - This paper presents the formulation and convergence characteristic of the modified fixed-point method are almost the same as those of the Newton-Raphson method.", "paper_title": "Speed-up of nonlinear magnetic field analysis using a modified fixed-point method", "paper_id": "WOS:000324445800023"}