{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "older_people"}, {"score": 0.004742290714667451, "phrase": "assisted_living_technologies"}, {"score": 0.00469445816161498, "phrase": "care_services"}, {"score": 0.00457696724030363, "phrase": "successful_'ageing"}, {"score": 0.00349803055484394, "phrase": "care_recipients"}, {"score": 0.003462704420080129, "phrase": "family_members"}, {"score": 0.003393115177189967, "phrase": "living_technologies"}, {"score": 0.0033588449972778004, "phrase": "individual_needs"}, {"score": 0.0032088487124106936, "phrase": "better_design"}, {"score": 0.0031125795874844438, "phrase": "assisted_living_technologies_'work"}, {"score": 0.0029285940369182277, "phrase": "formal_and_informal_carers"}, {"score": 0.0028697077879305064, "phrase": "mutual_awareness"}, {"score": 0.0028263192354046245, "phrase": "older_person's_circumstances"}, {"score": 0.0026592094867526803, "phrase": "concerted_and_coordinated_way"}, {"score": 0.00248927752933113, "phrase": "ways_care_services"}, {"score": 0.0021373366163721518, "phrase": "effortful_alignments"}], "paper_keywords": ["bricolage", " co-production", " assisted living", " ageing in place", " telecare", " telehealth"], "paper_abstract": "We report findings from a study that set out to explore the experience of older people living with assisted living technologies and care services. We find that successful 'ageing in place' is socially and collaboratively accomplished - 'co-produced' - day-to-day by the efforts of older people, and their formal and informal networks of carers (e.g. family, friends, neighbours). First, we reveal how 'bricolage' allows care recipients and family members to customise assisted living technologies to individual needs. We argue that making customisation easier through better design must be part of making assisted living technologies 'work'. Second, we draw attention to the importance of formal and informal carers establishing and maintaining mutual awareness of the older person's circumstances day-to-day so they can act in a concerted and coordinated way when problems arise. Unfortunately, neither the design of most current assisted living technologies, nor the ways care services are typically configured, acknowledges these realities of ageing in place. We conclude that rather than more 'advanced' technologies, the success of ageing in place programmes will depend on effortful alignments in the technical, organisational and social configuration of support.", "paper_title": "The Day-to-Day Co-Production of Ageing in Place", "paper_id": "WOS:000336385600001"}