{"auto_keywords": [{"score": 0.033995854396084664, "phrase": "kim"}, {"score": 0.004486432283770142, "phrase": "individual's_contribution"}, {"score": 0.004366106816225457, "phrase": "joint_work"}, {"score": 0.004225950334493496, "phrase": "prior_network_analyses"}, {"score": 0.004180234323211199, "phrase": "coauthorship_networks"}, {"score": 0.003272375502853897, "phrase": "coauthorship_credit_allocation_model"}, {"score": 0.003205999220870319, "phrase": "diesner"}, {"score": 0.002855934865505357, "phrase": "adopted_framework"}, {"score": 0.0027943943921568456, "phrase": "sample_data"}, {"score": 0.0026786874885590217, "phrase": "psychometrika"}, {"score": 0.0025611773887867255, "phrase": "novel_sociometric_approach"}, {"score": 0.00251966141432339, "phrase": "traditional_measures"}, {"score": 0.0024788167298469455, "phrase": "undirected_networks"}, {"score": 0.002412204754253618, "phrase": "coauthoring_patterns"}, {"score": 0.002128067018576581, "phrase": "prominent_scholars"}], "paper_keywords": ["network analysis", " information science", " scientometrics"], "paper_abstract": "In many scientific fields, the order of coauthors on a paper conveys information about each individual's contribution to a piece of joint work. We argue that in prior network analyses of coauthorship networks, the information on ordering has been insufficiently considered because ties between authors are typically symmetrized. This is basically the same as assuming that each coauthor has contributed equally to a paper. We introduce a solution to this problem by adopting a coauthorship credit allocation model proposed by Kim and Diesner (2014), which in its core conceptualizes coauthoring as a directed, weighted, and self-looped network. We test and validate our application of the adopted framework based on a sample data of 861 authors who have published in the journal Psychometrika. The results suggest that this novel sociometric approach can complement traditional measures based on undirected networks and expand insights into coauthoring patterns such as the hierarchy of collaboration among scholars. As another form of validation, we also show how our approach accurately detects prominent scholars in the Psychometric Society affiliated with the journal.", "paper_title": "Coauthorship networks: A directed network approach considering the order and number of coauthors", "paper_id": "WOS:000368338400021"}