{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "potato_tubers"}, {"score": 0.04527847590011604, "phrase": "potato_harvester"}, {"score": 0.03610310423475187, "phrase": "contact_point"}, {"score": 0.003900257249255497, "phrase": "original_point"}, {"score": 0.0037656130751127182, "phrase": "periphery_pixels"}, {"score": 0.0037150687722055727, "phrase": "new_width"}, {"score": 0.003635600104609725, "phrase": "previous_width"}, {"score": 0.00355782527287734, "phrase": "sudden_shrink"}, {"score": 0.003398015125667192, "phrase": "left-to-right_scanning"}, {"score": 0.003307372169859112, "phrase": "right_end"}, {"score": 0.002992456421856031, "phrase": "contact_points"}, {"score": 0.002751751956416832, "phrase": "oval_shape"}, {"score": 0.002613870237087035, "phrase": "adjacent_objects"}, {"score": 0.0025031188149336257, "phrase": "adjacent_tubers"}, {"score": 0.00235843888868088, "phrase": "in-line_potato_tubers"}, {"score": 0.002326738402957945, "phrase": "machine_vision-based_size_grading"}, {"score": 0.002216096102395494, "phrase": "touching_tubers"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Image processing", " Potato harvester", " Machine vision", " Singulation", " Clod"], "paper_abstract": "An algorithm which helps detecting in-line potato tubers without singulation when they are mixed with clods was developed. It is particularly useful for sorting and grading purposes whether at the packhouses or the potato harvester. The algorithm scans images which include clusters of tubers and clods from left to right until it encounters a Cluster. Once encountered. a scan around the periphery of the cluster starts until returning to the original point where the scanning around the periphery started. At the end of the periphery scanning. the periphery pixels are erased and the new width of the cluster is compared with the previous width. Contouring the periphery continues until a sudden shrink in the width of the cluster occurs which indicates the detection of a contact point. The left-to-right scanning resumes from the contact point until it reaches the right end of the image repeating the periphery scanning every time a cluster is encountered. The algorithm was tested by detecting 380 contact points between tubers and 112 contact points between tubers and clods. Results showed that approximately 99% of the contact points were detected successfully. It was found that the only reason of error was the lack of cusp between a tuber and a clod when the clod did not have an oval shape. It could be concluded that the algorithm is able to detect any contact point between any oval shaped adjacent objects as long as they form a cusp between them, which is guaranteed between any adjacent tubers. Therefore, the algorithm can be applied at the packhouses to replace the long, bulky and expensive conveyors needed to create spaces between the in-line potato tubers so as to aid machine vision-based size grading. Moreover, the algorithm can be used at the potato harvester to help in discriminating between the touching tubers and clods so as to automate the removal of the clods during harvesting. (C) 2009 Elsevier B.V. All rights reserved.", "paper_title": "An image processing algorithm for detecting in-line potato tubers without singulation", "paper_id": "WOS:000273933600027"}