{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "ambient_loo_-_caught"}, {"score": 0.004684157900507474, "phrase": "numerous_occasions"}, {"score": 0.004457579615095599, "phrase": "important_mobile_phone_call"}, {"score": 0.00433645229352341, "phrase": "sleek_and_polished_nature"}, {"score": 0.0038838500580958744, "phrase": "owner's_hands"}, {"score": 0.0032916702592724217, "phrase": "health_and_safety_hazard"}, {"score": 0.002947790697936243, "phrase": "first_attempt"}, {"score": 0.0028993944292191433, "phrase": "cell_phone_recovery_system"}, {"score": 0.002851790448644913, "phrase": "modern_functionalities"}, {"score": 0.002363806685815014, "phrase": "secure_backup"}, {"score": 0.0023249757987087055, "phrase": "user_data"}, {"score": 0.0022994427535192514, "phrase": "embedded_sensor"}, {"score": 0.0022741894748181243, "phrase": "wi-fi_network_connectivity"}], "paper_keywords": ["Human Factors"], "paper_abstract": "On numerous occasions, trips to the facilities coincide with an important mobile phone call. Due to the sleek and polished nature of modern phones, attempting to promptly deal with such calls can occasionally lead to the phone sliding through the owner's hands, surrendering to the force of gravity and flying down the hole. This is a disaster, and often an expensive incident. It can also be a health and safety hazard, with the owner desperately attempting to retrieve their phone and re-using it. This paper provides a first attempt at a cell phone recovery system using the modern functionalities of Toto Japanese toilets.(1) In our approach, the phone is calmly recovered, sanitized and retrieved by the user. This can all happen without the call even being dropped, with possibility of secure backup of the user data by embedded sensor and Wi-Fi network connectivity in the toilet. We envision that such an approach will increase the collaboration between Japanese, European and American mobile operators, network researchers and hardware manufacturers.", "paper_title": "The Ambient Loo - Caught Short when Nature Calls?", "paper_id": "WOS:000277061000012"}