{"auto_keywords": [{"score": 0.04006584189375526, "phrase": "complexity_measures"}, {"score": 0.03563317711334517, "phrase": "de-identification_models"}, {"score": 0.010112759167272705, "phrase": "average_f-measure"}, {"score": 0.00935458066549474, "phrase": "training_subset"}, {"score": 0.00481495049065317, "phrase": "clinical_narratives"}, {"score": 0.0047906825490581775, "phrase": "writing_complexity_measures"}, {"score": 0.004742511243894382, "phrase": "electronic_health_records"}, {"score": 0.004706699397060569, "phrase": "substantial_quantity"}, {"score": 0.004682974486879951, "phrase": "clinical_narrative"}, {"score": 0.004600870784042767, "phrase": "research_purposes"}, {"score": 0.004520200017456565, "phrase": "large_scale"}, {"score": 0.00440739273109494, "phrase": "patient_identifiers"}, {"score": 0.004385169879303577, "phrase": "de-identification_tools"}, {"score": 0.004352044603955875, "phrase": "machine_learning"}, {"score": 0.004275717966220406, "phrase": "model_training"}, {"score": 0.004034192540284084, "phrase": "writing_complexity"}, {"score": 0.003993597374640983, "phrase": "document_subsets"}, {"score": 0.003963418236312306, "phrase": "de-identification_performance"}, {"score": 0.0038938807148174975, "phrase": "unsupervised_clustering_method"}, {"score": 0.003748937184382714, "phrase": "varying_document_types"}, {"score": 0.0032785369171110857, "phrase": "vumc"}, {"score": 0.0032128364206445406, "phrase": "vanderbilt_dataset"}, {"score": 0.0029930505194626605, "phrase": "random_documents"}, {"score": 0.002823774538201994, "phrase": "specific_cluster"}, {"score": 0.002802410738076873, "phrase": "improved_results"}, {"score": 0.0026640466056415298, "phrase": "training_size"}, {"score": 0.0023711216505362394, "phrase": "randomly_selected_clusters"}, {"score": 0.002242613989995648, "phrase": "clinical_documentation"}, {"score": 0.002169968849836984, "phrase": "random_groups"}, {"score": 0.002137236968970666, "phrase": "document_types"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ireland_ltd."}], "paper_keywords": ["Electronic medical records", " Privacy", " Natural language processing"], "paper_abstract": "Purpose: Electronic health records contain a substantial quantity of clinical narrative, which is increasingly reused for research purposes. To share data on a large scale and respect privacy, it is critical to remove patient identifiers. De-identification tools based on machine learning have been proposed; however, model training is usually based on either a random group of documents or a pre-existing document type designation (e.g., discharge summary). This work investigates if inherent features, such as the writing complexity, can identify document subsets to enhance de-identification performance. Methods: We applied an unsupervised clustering method to group two corpora based on writing complexity measures: a collection of over 4500 documents of varying document types (e.g., discharge summaries, history and physical reports, and radiology reports) from Vanderbilt University Medical Center (VUMC) and the publicly available i2b2 corpus of 889 discharge summaries. We compare the performance (via recall, precision, and F-measure) of de-identification models trained on such clusters with models trained on documents grouped randomly or VUMC document type. Results: For the Vanderbilt dataset, it was observed that training and testing de-identification models on the same stylometric cluster (with the average F-measure of 0.917) tended to outperform models based on clusters of random documents (with an average F-measure of 0.881). It was further observed that increasing the size of a training subset sampled from a specific cluster could yield improved results (e.g., for subsets from a certain stylometric cluster, the F-measure raised from 0.743 to 0.841 when training size increased from 10 to 50 documents, and the F-measure reached 0.901 when the size of the training subset reached 200 documents). For the i2b2 dataset, training and testing on the same clusters based on complexity measures (average F-score 0.966) did not significantly surpass randomly selected clusters (average F-score 0.965). Conclusions: Our findings illustrate that, in environments consisting of a variety of clinical documentation, de-identification models trained on writing complexity measures are better than models trained on random groups and, in many instances, document types. (C) 2014 Elsevier Ireland Ltd. All rights reserved.", "paper_title": "De-identification of clinical narratives through writing complexity measures", "paper_id": "WOS:000341186200005"}