{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "type_reduction"}, {"score": 0.04869496857615713, "phrase": "fuzzy_sets"}, {"score": 0.03292778369104026, "phrase": "close-form_expressions"}, {"score": 0.004452641437293878, "phrase": "resolution_forms"}, {"score": 0.0042818111527640704, "phrase": "km"}, {"score": 0.004240119223962308, "phrase": "ekm"}, {"score": 0.004178351419209898, "phrase": "centroid_flow"}, {"score": 0.003715425273229361, "phrase": "iterative_switching_point"}, {"score": 0.003503497128638099, "phrase": "heuristic_algorithm"}, {"score": 0.0033524956061690868, "phrase": "minimum_and_maximum_switching_points"}, {"score": 0.0030696773722514105, "phrase": "switching_points"}, {"score": 0.0028944757265206332, "phrase": "lr_fuzzy_sets"}, {"score": 0.002535876002754739, "phrase": "lr_parameters"}, {"score": 0.0023104373174118458, "phrase": "proposed_type_reduction_method"}, {"score": 0.0022107428653358715, "phrase": "desired_switching_points"}], "paper_keywords": ["Interval type-2 (IT-2) fuzzy sets", " LR fuzzy set", " type-2 fuzzy sets", " type reduction"], "paper_abstract": "Type reduction of interval type-2 (IT2) fuzzy sets is essential in conducting the type-2 fuzzy sets expressed with the resolution forms of IT2 fuzzy sets. Several type reduction methods, such as KM, EKM, and centroid flow, have been proposed. These methods are relatively easy to implement but still computation-intensive because they need to invoke an iterative switching point finding procedure. This study derives a theorem and proposes a heuristic algorithm, which can fast and accurately identify the minimum and maximum switching points of a piecewise smooth IT2 fuzzy set. It also demonstrates that it is easy to derive the close-form expressions of the switching points of a piecewise smooth IT2 fuzzy set if both of its upper and lower membership functions can be parameterized as LR fuzzy sets, which are defined in this paper. Then, the type reduction of piecewise smooth IT2 fuzzy sets can be simplified to solve the close-form expressions of their switching points in terms of LR parameters. Experiments on IT2 fuzzy sets with various piecewise smooth membership functions, including linear, Gaussian, and hybrid-shaped ones were made. The results showed that the proposed type reduction method can obtain solutions which accurately approximate to the desired switching points with much lower computational overhead than the Karnik-Mondel (KM) and enhanced KM (EKM) methods.", "paper_title": "The Reduction of Interval Type-2 LR Fuzzy Sets", "paper_id": "WOS:000344661600011"}