{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "spatial_databases"}, {"score": 0.004639822587124109, "phrase": "decision_support"}, {"score": 0.004605565335682916, "phrase": "profile-based_marketing"}, {"score": 0.004487635647709636, "phrase": "previous_work"}, {"score": 0.004454497011118188, "phrase": "rnn_search"}, {"score": 0.004292422863834094, "phrase": "real_world"}, {"score": 0.0038548668648948044, "phrase": "novel_variant"}, {"score": 0.0038263829059336564, "phrase": "rnn_queries"}, {"score": 0.0035265659032655845, "phrase": "data_set_p"}, {"score": 0.0033110234463504125, "phrase": "vrnn_query"}, {"score": 0.0031317713853981064, "phrase": "efficient_algorithm"}, {"score": 0.0031086137705026483, "phrase": "vrnn_query_processing"}, {"score": 0.0028862231180242053, "phrase": "half-plane_property"}, {"score": 0.0028121943702224326, "phrase": "search_space"}, {"score": 0.0026996706283276407, "phrase": "vrnn_queries"}, {"score": 0.002620666087191234, "phrase": "k-nearest_neighbor"}, {"score": 0.002361876178411006, "phrase": "maximum_visible_distance_delta_constraint"}, {"score": 0.002267329954548889, "phrase": "vrknn_query"}, {"score": 0.002250549946875429, "phrase": "region_constraint"}, {"score": 0.0022338938462817867, "phrase": "extensive_experiments"}, {"score": 0.0022091400304857043, "phrase": "real_and_synthetic_data_sets"}], "paper_keywords": ["Reverse nearest neighbor", " visible reverse nearest neighbor", " spatial database", " query processing", " algorithm"], "paper_abstract": "Reverse nearest neighbor (RNN) queries have a broad application base such as decision support, profile-based marketing, resource allocation, etc. Previous work on RNN search does not take obstacles into consideration. In the real world, however, there are many physical obstacles (e. g., buildings) and their presence may affect the visibility between objects. In this paper, we introduce a novel variant of RNN queries, namely, visible reverse nearest neighbor (VRNN) search, which considers the impact of obstacles on the visibility of objects. Given a data set P, an obstacle set O, and a query point q in a 2D space, a VRNN query retrieves the points in P that have q as their visible nearest neighbor. We propose an efficient algorithm for VRNN query processing, assuming that P and O are indexed by R-trees. Our techniques do not require any preprocessing and employ half-plane property and visibility check to prune the search space. In addition, we extend our solution to several variations of VRNN queries, including: 1) visible reverse k-nearest neighbor (VRkNN) search, which finds the points in P that have q as one of their k visible nearest neighbors; 2) delta-VRkNN search, which handles VRkNN retrieval with the maximum visible distance delta constraint; and 3) constrained VRkNN (CVRkNN) search, which tackles the VRkNN query with region constraint. Extensive experiments on both real and synthetic data sets have been conducted to demonstrate the efficiency and effectiveness of our proposed algorithms under various experimental settings.", "paper_title": "Visible Reverse k-Nearest Neighbor Query Processing in Spatial Databases", "paper_id": "WOS:000268062400006"}