{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "supervised_learning"}, {"score": 0.004601417929493065, "phrase": "spike_shifting"}, {"score": 0.004469151810727749, "phrase": "fundamental_property"}, {"score": 0.0043830840694466, "phrase": "new_knowledge"}, {"score": 0.004340671055146398, "phrase": "novel_skills"}, {"score": 0.004312622975366676, "phrase": "behavioral_patterns"}, {"score": 0.004041879818641576, "phrase": "instruction-based_learning"}, {"score": 0.003938383970047866, "phrase": "exact_neural_mechanisms"}, {"score": 0.0038127186374325582, "phrase": "central_questions"}, {"score": 0.0036671822784770463, "phrase": "template_signals"}, {"score": 0.0035965032173588753, "phrase": "precisely_timed_sequences"}, {"score": 0.003459191419478298, "phrase": "biologically_plausible_neurons"}, {"score": 0.003200045185608395, "phrase": "arbitrary_template_spike_patterns"}, {"score": 0.003018468582368033, "phrase": "learning_rule"}, {"score": 0.0029602552900111407, "phrase": "decision-making_tasks"}, {"score": 0.002865710140187219, "phrase": "input_signals"}, {"score": 0.0027472888482450776, "phrase": "precisely_timed_spike_trains"}, {"score": 0.0027030528947088075, "phrase": "trained_neurons"}, {"score": 0.0026681761480139067, "phrase": "classification_task"}, {"score": 0.0026167007609466724, "phrase": "corresponding_decision_times"}, {"score": 0.002566215899764421, "phrase": "relevant_information"}, {"score": 0.0025085435314540837, "phrase": "ongoing_neural_activity"}, {"score": 0.002366110899738696, "phrase": "controllable_time_shift"}, {"score": 0.0023054252458274823, "phrase": "reproduced_signal"}, {"score": 0.002231747358665628, "phrase": "surprising_result"}, {"score": 0.0022029383047842627, "phrase": "spiking_neurons"}], "paper_keywords": [""], "paper_abstract": "Learning from instructions or demonstrations is a fundamental property of our brain necessary to acquire new knowledge and develop novel skills or behavioral patterns. This type of learning is thought to be involved in most of our daily routines. Although the concept of instruction-based learning has been studied for several decades, the exact neural mechanisms implementing this process remain unrevealed. One of the central questions in this regard is, How do neurons learn to reproduce template signals (instructions) encoded in precisely timed sequences of spikes? Here we present a model of supervised learning for biologically plausible neurons that addresses this question. In a set of experiments, we demonstrate that our approach enables us to train spiking neurons to reproduce arbitrary template spike patterns in response to given synaptic stimuli even in the presence of various sources of noise. We show that the learning rule can also be used for decision-making tasks. Neurons can be trained to classify categories of input signals based on only a temporal configuration of spikes. The decision is communicated by emitting precisely timed spike trains associated with given input categories. Trained neurons can perform the classification task correctly even if stimuli and corresponding decision times are temporally separated and the relevant information is consequently highly overlapped by the ongoing neural activity. Finally, we demonstrate that neurons can be trained to reproduce sequences of spikes with a controllable time shift with respect to target templates. A reproduced signal can follow or even precede the targets. This surprising result points out that spiking neurons can potentially be applied to forecast the behavior (firing times) of other reference neurons or networks.", "paper_title": "Supervised Learning in Spiking Neural Networks with ReSuMe: Sequence Learning, Classification, and Spike Shifting", "paper_id": "WOS:000273897500006"}