{"auto_keywords": [{"score": 0.04823975708050968, "phrase": "dimension_information"}, {"score": 0.015719716506582538, "phrase": "dimension_errors"}, {"score": 0.014323630831693543, "phrase": "spreadsheet_formulas"}, {"score": 0.00468476935399643, "phrase": "reasoning_system"}, {"score": 0.004052701031142039, "phrase": "spatial_structure"}, {"score": 0.0039122637074546895, "phrase": "labeling_relationship"}, {"score": 0.0036457672198249333, "phrase": "potential_dimensions"}, {"score": 0.003491894048789576, "phrase": "important_aspect"}, {"score": 0.0034510635632071978, "phrase": "rule_system"}, {"score": 0.003424107910734022, "phrase": "dimension_inference"}, {"score": 0.0031907572162427978, "phrase": "referenced_arguments"}, {"score": 0.0031534367609709264, "phrase": "current_cell"}, {"score": 0.0030440661915657175, "phrase": "reverse_direction"}, {"score": 0.002825435048559866, "phrase": "initial_dimension_information"}, {"score": 0.0026535183547537655, "phrase": "prototype_system"}, {"score": 0.0025816299143774143, "phrase": "excel"}, {"score": 0.002405549400304955, "phrase": "investigated_spreadsheets"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Spreadsheet", " Dimension", " Unit of measurement", " Static analysis", " Inference rule", " Error detection"], "paper_abstract": "We present a reasoning system for inferring dimension information in spreadsheets. This system can be used to check the consistency of spreadsheet formulas and thus is able to detect errors in spreadsheets. Our approach is based on three static analysis components. First, the spatial structure of the spreadsheet is analyzed to infer a labeling relationship among cells. Second, cells that are used as labels are lexically analyzed and mapped to potential dimensions. Finally, dimension information is propagated through spreadsheet formulas. An important aspect of the rule system defining dimension inference is that it works bi-directionally, that is, not only \"downstream\" from referenced arguments to the current cell, but also \"upstream\" in the reverse direction. This flexibility makes the system robust and turns out to be particularly useful in cases when the initial dimension information that can be inferred from headers is incomplete or ambiguous. We have implemented a prototype system as an add-in to Excel. In an evaluation of this implementation we were able to detect dimension errors in almost 50% of the investigated spreadsheets, which shows (i) that the system works reliably in practice and (ii) that dimension information can be well exploited to uncover errors in spreadsheets. (C) 2009 Elsevier Ltd. All rights reserved.", "paper_title": "Automatic detection of dimension errors in spreadsheets", "paper_id": "WOS:000268468800005"}