{"auto_keywords": [{"score": 0.03977329961495616, "phrase": "collaborative_semiconductor_yield_forecasting_system"}, {"score": 0.00481495049065317, "phrase": "yield_forecasting"}, {"score": 0.00465634671242413, "phrase": "semiconductor_manufacturing_factory"}, {"score": 0.004553510708976456, "phrase": "typical_group-decision-making_environment"}, {"score": 0.004027031316965272, "phrase": "collaborative_semiconductor_yield_forecasting"}, {"score": 0.003960101604693806, "phrase": "online_expert_system"}, {"score": 0.003724034990158436, "phrase": "client-server_architecture"}, {"score": 0.003311604528903634, "phrase": "multiple-factory_case"}, {"score": 0.002475898613632249, "phrase": "convenient_platform"}, {"score": 0.0024346858809238766, "phrase": "product_engineers"}, {"score": 0.0024075916292945715, "phrase": "quality_control_staff"}, {"score": 0.0023807981747706376, "phrase": "different_factories"}, {"score": 0.0023021895404322767, "phrase": "yield_improvement_process"}, {"score": 0.002176887956041267, "phrase": "multiple_factories"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Semiconductor", " Yield forecasting", " Expert system", " Collaborative", " Fuzzy neural"], "paper_abstract": "Yield forecasting is a very important task to a semiconductor manufacturing factory which is a typical group-decision-making environment. Namely, many experts will gather to predict the yields of products collaboratively. To enhance both the precision and accuracy of collaborative semiconductor yield forecasting, an online expert system is constructed in this study. The collaborative semiconductor yield forecasting system adopts the client-server architecture, and therefore the necessity for all experts to gather at the same place is relaxed, which is especially meaningful for a multiple-factory case. To demonstrate the applicability of the collaborative semiconductor yield forecasting system, an experimental system has been constructed and applied to two random-access-memory products in a real semiconductor manufacturing factory. Both the precision and accuracy of forecasting the yields of the two products were significantly improved. Besides, the collaborative semiconductor yield forecasting system was also considered as a convenient platform for the product engineers or quality control staff from different factories to share their opinions about the yield improvement process of a product being manufacturing with the same technology in multiple factories. (C) 2008 Elsevier Ltd. All rights reserved.", "paper_title": "An online collaborative semiconductor yield forecasting system", "paper_id": "WOS:000263817100012"}