{"auto_keywords": [{"score": 0.04942172741005563, "phrase": "multimedia_social_networks"}, {"score": 0.02866940232418273, "phrase": "attacker's_utility"}, {"score": 0.00481495049065317, "phrase": "multimedia_fingerprinting_colluder_social_networks"}, {"score": 0.004540126719762935, "phrase": "complex_user_dynamics"}, {"score": 0.004340553321613485, "phrase": "multimedia_fingerprinting"}, {"score": 0.00425141240073214, "phrase": "user_dynamics"}, {"score": 0.004222105714769577, "phrase": "colluder_social_networks"}, {"score": 0.004064478393319772, "phrase": "multimedia_fingerprinting_system"}, {"score": 0.0036764506727132253, "phrase": "game-theoretic_framework"}, {"score": 0.0036259093827331725, "phrase": "complex_dynamics"}, {"score": 0.003325343504284345, "phrase": "multiuser_collusion"}, {"score": 0.003234509549830177, "phrase": "fingerprinted_copies"}, {"score": 0.003113637673848439, "phrase": "different_resolutions"}, {"score": 0.0030814613175385703, "phrase": "proposed_framework"}, {"score": 0.002956037056206635, "phrase": "digital_rights_enforcer"}, {"score": 0.002895246938820814, "phrase": "illegal_usage"}, {"score": 0.002538164420139397, "phrase": "necessary_conditions"}, {"score": 0.002426378123762607, "phrase": "collusion_parameters"}, {"score": 0.0022404996930993413, "phrase": "optimum_strategy"}, {"score": 0.002179234170770192, "phrase": "fellow_attackers"}], "paper_keywords": ["Coalition formation", " game theory", " multiuser collusion", " multimedia fingerprinting"], "paper_abstract": "Users in multimedia social networks actively interact with each other. It is crucial to study the complex user dynamics and analyze its impact on the performance of multimedia social networks. This paper uses multimedia fingerprinting as an example and studies user dynamics in colluder social networks. During collusion, a group of attackers collectively attack multimedia fingerprinting system and use multimedia content illegally. This paper analyzes the incentives of cooperation among attackers and investigates how colluders form their coalitions to maximize their payoffs. We present a game-theoretic framework to model the complex dynamics among colluders, analyze when attackers cooperate with each other, and investigate how a colluder selects his/her fellow attackers to maximize his/her own payoff. We analyze multiuser collusion in two scenarios: when all attackers receive fingerprinted copies of the same resolution, and when they have copies of different resolutions. The proposed framework considers both the colluders' risk of being detected by the digital rights enforcer and the reward received from illegal usage of multimedia content. Our analysis shows that in both scenarios, colluding with more attackers does not always increase an attacker's utility, and attackers may not always want to cooperate with each other. We first examine the necessary conditions for attackers to collude together, and study how they select the collusion parameters such that cooperation benefits all colluders. We then study how the number of colluders affects each attacker's utility, and investigate the optimum strategy that an attacker should use to select fellow attackers and to form a coalition in order to maximize his or her own payoff.", "paper_title": "Cooperation and Coalition in Multimedia Fingerprinting Colluder Social Networks", "paper_id": "WOS:000304166700006"}