{"auto_keywords": [{"score": 0.036588740387536144, "phrase": "null_model"}, {"score": 0.003866443402315402, "phrase": "null_models"}, {"score": 0.003807684498435389, "phrase": "structural_features"}, {"score": 0.003563172322934695, "phrase": "artificial_datasets"}, {"score": 0.0033685408148574876, "phrase": "original_dataset"}, {"score": 0.0032172054825137866, "phrase": "null_hypothesis"}, {"score": 0.0031682817605340028, "phrase": "homogeneous_population"}, {"score": 0.003120099687922751, "phrase": "clustering_alternative"}, {"score": 0.002964706925144123, "phrase": "validation_index"}, {"score": 0.0027741761880779535, "phrase": "expected_distribution"}, {"score": 0.002416589459425828, "phrase": "hierarchical_methods"}, {"score": 0.002381584225849167, "phrase": "gaussian"}, {"score": 0.002204183096956446, "phrase": "bic"}, {"score": 0.002126635713519053, "phrase": "mixed-type_data"}, {"score": 0.0021049977753042253, "phrase": "temporal_and_spatial_autocorrelation"}], "paper_keywords": ["Cluster validation", " Mixture model", " Distance-based clustering", " Markov chain", " Mixed-type data", " Spatial autocorrelation", " Presence-absence data"], "paper_abstract": "There are two notoriously hard problems in cluster analysis, estimating the number of clusters, and checking whether the population to be clustered is not actually homogeneous. Given a dataset, a clustering method and a cluster validation index, this paper proposes to set up null models that capture structural features of the data that cannot be interpreted as indicating clustering. Artificial datasets are sampled from the null model with parameters estimated from the original dataset. This can be used for testing the null hypothesis of a homogeneous population against a clustering alternative. It can also be used to calibrate the validation index for estimating the number of clusters, by taking into account the expected distribution of the index under the null model for any given number of clusters. The approach is illustrated by three examples, involving various different clustering techniques (partitioning around medoids, hierarchical methods, a Gaussian mixture model), validation indexes (average silhouette width, prediction strength and BIC), and issues such as mixed-type data, temporal and spatial autocorrelation.", "paper_title": "Flexible parametric bootstrap for testing homogeneity against clustering and assessing the number of clusters", "paper_id": "WOS:000356828600011"}