{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "publication_profiles"}, {"score": 0.004683292152590589, "phrase": "european_research_institutes"}, {"score": 0.004580550308652044, "phrase": "present_study"}, {"score": 0.004406121974246201, "phrase": "common_problem"}, {"score": 0.004285594361623147, "phrase": "institutional_level"}, {"score": 0.004168349927332055, "phrase": "bibliometric_indicators"}, {"score": 0.0033570147767493746, "phrase": "different_focus"}, {"score": 0.0025570607111118793, "phrase": "first_application"}, {"score": 0.002445865715873089, "phrase": "national_level"}, {"score": 0.0024054226746197706, "phrase": "national_research_profiles"}, {"score": 0.0023394947463129642, "phrase": "deeper_insight"}, {"score": 0.00230080652063411, "phrase": "national_research_landscape"}, {"score": 0.0022502133699402018, "phrase": "second_application"}], "paper_keywords": [""], "paper_abstract": "In the present study we propose a solution for a common problem in benchmarking tasks at institutional level. The usage of bibliometric indicators, even after standardisation, cannot disguise that comparing institutes remains often like comparing apples with pears. We developed a model to assign institutes to one of 8 different groups based on their research profile. Each group has a different focus: 1. Biology, 2. Agricultural Sciences, 3. Multidisciplinary, 4. Geo & Space Sciences, 5. Technical and natural Sciences, 6. Chemistry, 7. General and Research Medicine, 8. Specialised Medicine. Two applications of this methodology are described. In the first application we compare the composition of clusters at national level with the national research profiles. This gives a deeper insight in the national research landscape. In a second application we look at the dynamics of institutes by comparing their subject clustering at two different points in time.", "paper_title": "A structural analysis of publication profiles for the classification of European research institutes", "paper_id": "WOS:000252808500004"}