{"auto_keywords": [{"score": 0.04973625252864221, "phrase": "heterogeneous_wireless_networks"}, {"score": 0.015719716506582538, "phrase": "throughput_capacity"}, {"score": 0.012562728774133322, "phrase": "n_normal_nodes"}, {"score": 0.0047292449487169345, "phrase": "substantial_body"}, {"score": 0.004578783486828809, "phrase": "wireless_networks"}, {"score": 0.003965684670332574, "phrase": "general_network_settings"}, {"score": 0.0038671299350540554, "phrase": "extended_network"}, {"score": 0.0035729944980593324, "phrase": "rectangular_area"}, {"score": 0.002942138511829811, "phrase": "normal_nodes"}, {"score": 0.0025752890978323873, "phrase": "regular_heterogeneous_wireless_networks"}, {"score": 0.0024664004864629703, "phrase": "network_capacity"}, {"score": 0.002396371892825691, "phrase": "network_area"}, {"score": 0.0023536149458842992, "phrase": "destination_nodes"}, {"score": 0.002143247921132179, "phrase": "order_sense"}, {"score": 0.0021278653331014592, "phrase": "traditional_homogeneous_wireless_networks"}], "paper_keywords": ["Heterogeneous wireless networks", " extended networks", " achievable throughput"], "paper_abstract": "A substantial body of the literature exists addressing the capacity of wireless networks. However, it is commonly assumed that all nodes in the network are identical. The issue of heterogeneity has not been embraced into the discussions. In this paper, we investigate the throughput capacity of heterogeneous wireless networks with general network settings. Specifically, we consider an extended network with n normal nodes and m = n(b) (0 <= b <= 1) more powerful helping nodes in a rectangular area with width s(n) and length n/s(n), where s(n) = n(w) and 0 <= w <= 1/2. We assume that there are n flows in the network. All the n normal nodes are sources while only randomly chosen n(d) (0 <= d <= 1) normal nodes are destinations. We further assume that the n normal nodes are uniformly and independently distributed, while the m helping nodes are either regularly placed or uniformly and independently distributed, resulting in two different kinds of networks called Regular Heterogeneous Wireless Networks and Random Heterogeneous Wireless Networks, respectively. We show that network capacity is determined by the shape of the network area, the number of destination nodes, the number of helping nodes, and the bandwidth of helping nodes. We also find that heterogeneous wireless networks can provide throughput higher in the order sense than traditional homogeneous wireless networks only under certain conditions.", "paper_title": "On the Throughput Capacity of Heterogeneous Wireless Networks", "paper_id": "WOS:000310390400010"}