{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "restricted_additive_schwarz_preconditioner"}, {"score": 0.004740476936977635, "phrase": "nonlinear_cfd_problems"}, {"score": 0.004430784015995566, "phrase": "unsteady_nonlinear_problems"}, {"score": 0.004339609346924681, "phrase": "newton-krylov_method"}, {"score": 0.004014035333627087, "phrase": "successive_linear_systems"}, {"score": 0.0033633514001658086, "phrase": "krylov_method"}, {"score": 0.003143341238802547, "phrase": "domain_decomposition"}, {"score": 0.0027886573969044042, "phrase": "efficient_parallel_implementation"}, {"score": 0.0026471739851621143, "phrase": "asynchronous_update"}, {"score": 0.00253916011199984, "phrase": "numerical_results"}, {"score": 0.002473895542219933, "phrase": "reaction-diffusion_problem"}, {"score": 0.002422890839801611, "phrase": "model_problem"}, {"score": 0.002372935208038141, "phrase": "lid-driven_cavity"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Restricted Additive Schwarz", " Newton-Krylov", " Preconditioners", " Asynchronous computations"], "paper_abstract": "This paper presents a method that speeds up the solution of unsteady nonlinear problems. When a Newton-Krylov method is used, the most time-consuming part of the numerical simulation is the solution of the successive linear systems. Generally, there are only slight changes between two consecutive Jacobian matrices. Thus, in order to save computations, it is possible to use the same preconditioning matrix for a few successive linear systems, but the convergence of the Krylov method is slowed down. In the case of a preconditioner based on domain decomposition, one can update only the parts of the preconditioner associated to certain subdomains, keeping the other ones constant. In order to achieve an efficient parallel implementation, we propose to add processes dedicated to the asynchronous update of some parts of the preconditioner. Numerical results are provided for a reaction-diffusion problem and for a model problem based on the lid-driven cavity. They show that this addition of processes can speed up the computation and improve the robustness. (C) 2014 Elsevier Ltd. All rights reserved.", "paper_title": "Asynchronous partial update of the Restricted Additive Schwarz preconditioner to solve nonlinear CFD problems", "paper_id": "WOS:000350535100022"}