{"auto_keywords": [{"score": 0.016070462021029183, "phrase": "active_site"}, {"score": 0.008092575220397944, "phrase": "pyrene_moiety"}, {"score": 0.0047817315951081555, "phrase": "y-family_dna_polymerase"}, {"score": 0.004672640547702694, "phrase": "single_major_adduct"}, {"score": 0.004420823917028035, "phrase": "translesion_synthesis"}, {"score": 0.004400494459904301, "phrase": "tls"}, {"score": 0.0043399244218920675, "phrase": "dna_polymerases"}, {"score": 0.004201881312320611, "phrase": "dna_damage"}, {"score": 0.0040215052006051235, "phrase": "best_studied_y-family"}, {"score": 0.004012228901294144, "phrase": "dnap"}, {"score": 0.00398452530840582, "phrase": "structural_point"}, {"score": 0.003692084942658862, "phrase": "nmr_studies"}, {"score": 0.003616108223034427, "phrase": "minor_groove"}, {"score": 0.0033973992952939726, "phrase": "published_x-ray_structures"}, {"score": 0.002446587261446581, "phrase": "significant_distortions"}, {"score": 0.002251090390368709, "phrase": "asi"}, {"score": 0.0021492935956059283, "phrase": "y-family_dnaps"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["cancer", " genotoxins", " mutations", " adducts", " lesion", " DNA polymerases", " Dpo4"], "paper_abstract": "The potent, ubiquitous environmental mutagen/carcinogen benzo[a]pyrene (B[a]P) induces a single major adduct [+ta]-B[a]P-N-2-dG, whose bypass in most cases results in either no mutation (dCTP insertion) or a G -> T mutation (dATP insertion). Translesion synthesis (TLS) of [+ta]B[a]P-N-2-dG generally requires DNA polymerases (DNAPs) in the Y-family, which exist in cells to bypass DNA damage caused by chemicals and radiation. A molecular dynamics (MD) study is described with dCTP opposite [+ta]-B[a]P-N-2 -dG in Dpo4, which is the best studied Y-family DNAP from a structural point of view. Two orientations of B[a]P-N-2-dG (BPmi5 and BPmi3) are considered, along with two orientations of the dCTP (AS1 and AS2), as outlined next. Based on NMR studies, the pyrene moiety of B[a]P-N-2 -dG is in the minor groove, when paired with dC, and can point toward either the base on the 5'-side (BPmi5) or the 3'-side (BPmi3). Based on published X-ray structures, Dpo4 appears to have two partially overlapping active sites. The architecture of active site I (AS I) is similar to all other families of DNAPs (e.g., the shape of the dNTP). Active site 2 (AS2), however, is non-canonical (e.g., the beta- and gamma-phosphates in AS2 are approximately where the alpha- and P-phosphates are in AS1). In the Dpo4 models generated herein, using the BPmi3 orientation the pyrene moiety of [+ta]-B[a]P-N-2-dG points toward the duplex region of the DNA, and is accommodated without distortions in AS1, but with distortions in AS2. Considering the BPmi5 orientation, the pyrene moiety points toward the ss-region of DNA in Dpo4, and sits in a hole defined by the fingers and little fingers domain (\"chimney\"); BPmi5 is accommodated in AS2 without significant distortions, but poorly in AS1. In summary, when dCTP is paired with [+ta]-B[a]P-N-2 -dG in the two overlapping active sites in Dpo4, the pyrene in the BPmi3 orientation is accommodated better in active site 1 (ASI), while the pyrene in the BPmi5 orientation is accommodated better in AS2. Finally, we discuss why Y-family DNAPs might have two catalytic active sites. (c) 2006 Elsevier Inc. All rights reserved.", "paper_title": "Molecular modeling benzo[a]pyrene N-2-dG adducts in the two overlapping active sites of the Y-family DNA polymerase Dpo4", "paper_id": "WOS:000245665600007"}