{"auto_keywords": [{"score": 0.04548812433856781, "phrase": "mobile_agents"}, {"score": 0.00481495049065317, "phrase": "service-oriented_computing"}, {"score": 0.004187614134377688, "phrase": "service-oriented_and_mobile_agent"}, {"score": 0.00400459716272594, "phrase": "large_class"}, {"score": 0.003960101604693806, "phrase": "distributed_applications"}, {"score": 0.0036214184763804034, "phrase": "service_interfaces"}, {"score": 0.0033864888703414903, "phrase": "static_type-checking"}, {"score": 0.0031315358193567708, "phrase": "redundant_service_providers"}, {"score": 0.0023021912544042315, "phrase": "mob"}, {"score": 0.002238664219600659, "phrase": "application_programmer"}, {"score": 0.002189105604712615, "phrase": "systems_developer's_view"}, {"score": 0.0021049977753042253, "phrase": "john_wiley"}], "paper_keywords": ["mobile agents", " service-oriented computing", " programming languages", " run-time systems", " process-calculi"], "paper_abstract": "We present MOB, a service-oriented scripting language, for programming mobile agents. We argue that combining the service-oriented and mobile agent paradigms provides a very natural model for programming a large class of distributed applications. In MOB, mobile agents in a network simultaneously provide and use services. The service interfaces constitute contracts that bind agents among themselves. The language features static type-checking to guarantee that contracts are respected at run-time. Other language features, such as redundant service providers, allow a certain degree of fault-tolerance by allowing applications to switch servers dynamically in case a failure is detected (e.g. a server crash). For these reasons, the target applications we envision more interesting to develop using MOB are services for networks with highly dynamic, volatile resources or simply highly adaptive, reconfigurable applications for more classical networks. The paper presents MOB and its implementation from an application programmer's and a systems developer's view. Copyright (C) 2007 John Wiley & Sons, Ltd.", "paper_title": "A programming language for service-oriented computing with mobile agents", "paper_id": "WOS:000255817600002"}