{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "healthcare_providers"}, {"score": 0.004748667236545639, "phrase": "healthcare_information_system"}, {"score": 0.004696295109780416, "phrase": "information_technologies"}, {"score": 0.004593269324009218, "phrase": "everyday_workflow"}, {"score": 0.004309434349688514, "phrase": "information_systems"}, {"score": 0.0040431728868912525, "phrase": "italy"}, {"score": 0.0037931018103829427, "phrase": "full_access"}, {"score": 0.0037721073763702486, "phrase": "clinical_and_health-related_documents"}, {"score": 0.003519242552610694, "phrase": "twofold_approach"}, {"score": 0.003366347836830716, "phrase": "single_hospitals"}, {"score": 0.0033015555065209865, "phrase": "technological_infrastructure"}, {"score": 0.003283272764794988, "phrase": "data_sharing"}, {"score": 0.003256037687517789, "phrase": "interoperability_specifications"}, {"score": 0.0032200742200248584, "phrase": "regional_level"}, {"score": 0.00314933081335483, "phrase": "central_domain"}, {"score": 0.003063076422586359, "phrase": "heterogeneous_systems"}, {"score": 0.0030376623293574905, "phrase": "different_hospitals"}, {"score": 0.0030208366470597923, "phrase": "lombardy"}, {"score": 0.002970914475538276, "phrase": "integration_profiles"}, {"score": 0.0028895324165046166, "phrase": "message_exchange"}, {"score": 0.0028417741269408194, "phrase": "integration_scenarios"}, {"score": 0.0027562523218174996, "phrase": "patient_management"}, {"score": 0.0027257939691194117, "phrase": "scheduled_workflow"}, {"score": 0.0026732978842378186, "phrase": "ltw"}, {"score": 0.0025713100093065645, "phrase": "order_management"}, {"score": 0.0024594969044952108, "phrase": "laboratory_exams"}, {"score": 0.002262756631083292, "phrase": "healthcare_system"}, {"score": 0.0022439677792133917, "phrase": "fully_interoperable_social_healthcare_system"}, {"score": 0.0022068557886223673, "phrase": "healthcare_organizations"}, {"score": 0.0021885300925245516, "phrase": "healthcare_professionals"}, {"score": 0.0021703562417144558, "phrase": "large_and_heterogeneous_territory"}, {"score": 0.002140400526572388, "phrase": "international_health_standards"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Interoperability", " Health standards", " HL7", " Integrating the Healthcare Enterprise", " Health information systems", " Life-long personal health record"], "paper_abstract": "Information technologies (ITS) have now entered the everyday workflow in a variety of healthcare providers with a certain degree of independence. This independence may be the cause of difficulty in interoperability between information systems and it can be overcome through the implementation and adoption of standards. Here we present the case of the Lombardy Region, in Italy, that has been able, in the last 10 years, to set up the Regional Social and Healthcare Information System, connecting all the healthcare providers within the region, and providing full access to clinical and health-related documents independently from the healthcare organization that generated the document itself. This goal, in a region with almost 10 millions citizens, was achieved through a twofold approach: first, the political and operative push towards the adoption of the Health Level 7 (HL7) standard within single hospitals and, second, providing a technological infrastructure for data sharing based on interoperability specifications recognized at the regional level for messages transmitted from healthcare providers to the central domain. The adoption of such regional interoperability specifications enabled the communication among heterogeneous systems placed in different hospitals in Lombardy. Integrating the Healthcare Enterprise (IHE) integration profiles which refer to HL7 standards are adopted within hospitals for message exchange and for the definition of integration scenarios. The IHE patient administration management (PAM) profile with its different workflows is adopted for patient management, whereas the Scheduled Workflow (SWF), the Laboratory Testing Workflow (LTW), and the Ambulatory Testing Workflow (ATW) are adopted for order management. At present, the system manages 4,700,000 pharmacological e-prescriptions, and 1,700,000 e-prescriptions for laboratory exams per month. It produces, monthly, 490,000 laboratory medical reports, 180,000 radiology medical reports, 180,000 first aid medical reports, and 58,000 discharge summaries. Hence, despite there being still work in progress, the Lombardy Region healthcare system is a fully interoperable social healthcare system connecting patients, healthcare providers, healthcare organizations, and healthcare professionals in a large and heterogeneous territory through the implementation of international health standards. (C) 2012 Elsevier Inc. All rights reserved.", "paper_title": "Implementing standards for the interoperability among healthcare providers in the public regionalized Healthcare Information System of the Lombardy Region", "paper_id": "WOS:000308258200017"}