{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "multidimensional_contextual_outliers"}, {"score": 0.03566317662898919, "phrase": "contextual_outlier_detection"}, {"score": 0.026374708875538982, "phrase": "reference_group"}, {"score": 0.004773692073488661, "phrase": "categorical_relational_data"}, {"score": 0.004712463245074863, "phrase": "wide_range"}, {"score": 0.004552981066668676, "phrase": "different_types"}, {"score": 0.003949974260471287, "phrase": "critical_issue"}, {"score": 0.003310447652300423, "phrase": "contextual_outlier"}, {"score": 0.003267925215811654, "phrase": "small_group"}, {"score": 0.0031982609080278643, "phrase": "strong_similarity"}, {"score": 0.003157174936641705, "phrase": "significantly_larger_reference_group"}, {"score": 0.002566997205079849, "phrase": "unusual_behavior"}, {"score": 0.0022651818270925704, "phrase": "population_ratio"}, {"score": 0.0022073031056287903, "phrase": "outlier_group"}, {"score": 0.002132420504803564, "phrase": "extensive_experiments"}], "paper_keywords": ["Outlier detection", " context", " categorical data", " relational data"], "paper_abstract": "A wide range of methods have been proposed for detecting different types of outliers in both the full attribute space and its subspaces. However, the interpretability of outliers, that is, explaining in what ways and to what extent an object is an outlier, remains a critical issue. In this paper, we focus on improving the interpretability of outliers. Particularly, we develop a notion of multidimensional contextual outliers to model the context of an outlier, and propose a framework for contextual outlier detection. Intuitively, a contextual outlier is a small group of objects that share strong similarity with a significantly larger reference group of objects on some attributes, but deviate dramatically on some other attributes. In contextual outlier detection, we identify not only the outliers, but also their associated contextual information including (1) comparing to what reference group of objects the detected object(s) is/are an outlier; (2) the attributes defining the unusual behavior of the outlier(s) compared against the reference group; (3) the population of similar outliers sharing the same context; and (4) the outlier degree, which measures the population ratio between the reference group and the outlier group. We present an algorithm and conduct extensive experiments to evaluate our approach.", "paper_title": "Mining multidimensional contextual outliers from categorical relational data", "paper_id": "WOS:000361555000013"}