{"auto_keywords": [{"score": 0.015719716506582538, "phrase": "application_strategies"}, {"score": 0.004679134285953932, "phrase": "major_research_paradigm"}, {"score": 0.00462919213721188, "phrase": "information_systems"}, {"score": 0.004466519142879166, "phrase": "innovative_and_useful_it_artifacts"}, {"score": 0.004403054828362479, "phrase": "conceptual_models"}, {"score": 0.004371660146981191, "phrase": "software_systems"}, {"score": 0.0043095378396174125, "phrase": "increasing_attention"}, {"score": 0.004248294537944227, "phrase": "cognitive_and_emotional_mechanisms"}, {"score": 0.00406971620207041, "phrase": "neurobiological_determinants"}, {"score": 0.0038986150699604504, "phrase": "primary_argument"}, {"score": 0.003829455440282146, "phrase": "neurobiological_approaches"}, {"score": 0.0036292245355184576, "phrase": "neuroscience_theories"}, {"score": 0.003378385493203297, "phrase": "users'_perceptual_and_information_processing_mechanisms"}, {"score": 0.0029484244900690485, "phrase": "specific_set"}, {"score": 0.002744510304340939, "phrase": "research_project"}, {"score": 0.00266693888510356, "phrase": "design_science_scholar"}, {"score": 0.0025638362414466278, "phrase": "possible_working_areas"}, {"score": 0.0025455220351023465, "phrase": "corresponding_requirements"}, {"score": 0.002473560912156024, "phrase": "example_studies"}, {"score": 0.00235247790591897, "phrase": "related_disciplines"}, {"score": 0.0023189818169615135, "phrase": "affective_computing"}, {"score": 0.0021049977753042253, "phrase": "major_reference_discipline"}], "paper_keywords": ["Design science research", " Neuroscience", " fMRI", " EEG", " Affective computing", " Neuroergonomics"], "paper_abstract": "Design science has evolved as a major research paradigm in the information systems (IS) discipline, which aims to design innovative and useful IT artifacts, such as conceptual models and software systems. Despite the increasing attention paid to the cognitive and emotional mechanisms that underlie the perception of such artifacts, research that explores the neurobiological determinants of these mechanisms has only recently begun to emerge. The primary argument for the use of neurobiological approaches in IS design science research is that IT artifact design - and, ultimately, human-computer interaction in general - may significantly benefit from neuroscience theories, concepts, methods, and data. In particular, the consideration of neuroscience may improve IT artifacts' alignment with users' perceptual and information processing mechanisms, particularly the brain. Against this background, this article presents a taxonomy of application strategies for neuroscience in IS design science research. It describes three major areas of application and explains that conducting research in an area comes with a specific set of requirements (e.g., applicability, costs, accessibility, and knowledge relevant to planning and conducting a research project). Therefore, if an IS design science scholar decides to draw upon neuroscience, the taxonomy transparently explains possible working areas and corresponding requirements. The taxonomy is described based on example studies published in the IS literature and on contributions that appeared in outlets pertaining to related disciplines, such as affective computing and neuroergonomics. The article concludes that, if neuroscience is considered a valuable complement to the more traditional approaches, it has the potential to become a major reference discipline for IS design science research.", "paper_title": "APPLICATION STRATEGIES FOR NEUROSCIENCE IN INFORMATION SYSTEMS DESIGN SCIENCE RESEARCH", "paper_id": "WOS:000332130800001"}