{"auto_keywords": [{"score": 0.04845849110410781, "phrase": "timing_conditions"}, {"score": 0.0120238791225876, "phrase": "sequential_consistency"}, {"score": 0.01112004072678889, "phrase": "counting_networks"}, {"score": 0.00481495049065317, "phrase": "linearizable_counting_networks"}, {"score": 0.004583878086896926, "phrase": "sequentially_consistent_and_linearizable_counters"}, {"score": 0.004406994912939125, "phrase": "distributed_systems"}, {"score": 0.004278807087784626, "phrase": "application_domains"}, {"score": 0.003107034833468438, "phrase": "stronger_semantics"}, {"score": 0.0028857130140890787, "phrase": "local_timing_conditions"}, {"score": 0.002404706573379854, "phrase": "even_sequential_consistency"}, {"score": 0.002157538586313944, "phrase": "specific_applications"}], "paper_keywords": ["counting networks", " balancing networks", " sequential consistency", " linearizability", " inconsistency fractions"], "paper_abstract": "We compare the impact of timing conditions on implementing sequentially consistent and linearizable counters using (uniform) counting networks in distributed systems. For counting problems in application domains which do not require linearizability but will run correctly if only sequential consistency is provided, the results of our investigation, and their potential payoffs, are threefold: First, we show that sequential consistency and linearizability cannot be distinguished by the timing conditions previously considered in the context of counting networks; thus, in contexts where these constraints apply, it is possible to rely on the stronger semantics of linearizability, which simplifies proofs and enhances compositionality. Second, we identify local timing conditions that support sequential consistency but not linearizability; thus, we suggest weaker, easily implementable timing conditions that are likely to be sufficient in many applications. Third, we show that any kind of synchronization that is too weak to support even sequential consistency may violate it significantly for some counting networks; hence, we identify timing conditions that are to be totally ruled out for specific applications that rely critically on either sequential consistency or linearizability.", "paper_title": "Sequentially consistent versus linearizable counting networks", "paper_id": "WOS:000259068200002"}