{"auto_keywords": [{"score": 0.03225744122190013, "phrase": "h-smert_problem"}, {"score": 0.013334802472147007, "phrase": "np"}, {"score": 0.008713768692145006, "phrase": "strong_minimum_energy_-hop"}, {"score": 0.008169483970324862, "phrase": "transmit_power"}, {"score": 0.007922286951982173, "phrase": "transmit_powers"}, {"score": 0.007682511828212305, "phrase": "resulting_topology"}, {"score": 0.007490577632744448, "phrase": "-int-h-smert_problem"}, {"score": 0.0047559432344272, "phrase": "hierarchical_wireless_sensor_networks"}, {"score": 0.004625795150473604, "phrase": "strong_minimum_energy_topology"}, {"score": 0.004597358586317861, "phrase": "smet"}, {"score": 0.004322387850491499, "phrase": "minimum_subject"}, {"score": 0.004214044013675466, "phrase": "-approximation_algorithm"}, {"score": 0.003964727263291033, "phrase": "wireless_sensor_networks"}, {"score": 0.003880017219275826, "phrase": "shorter_path_lengths"}, {"score": 0.003693103542455806, "phrase": "specified_sensor"}, {"score": 0.0027372898106427274, "phrase": "np_subset"}, {"score": 0.002621428624654101, "phrase": "positive_side"}, {"score": 0.0023023818355050237, "phrase": "-rest-h-smert_problem"}, {"score": 0.0021049977753042253, "phrase": "optimal_algorithm"}], "paper_keywords": ["Wireless sensor network", " Topology control problem", " Transmission power assignment", " Graph algorithm", " NP-hard", " APX-hard", " Approximation algorithm"], "paper_abstract": "Given a set of sensors, the strong minimum energy topology (SMET) problem is to assign transmit power to each sensor such that the sum of the transmit powers of all the sensors is minimum subject to the constraint that the resulting topology containing only bidirectional links is strongly connected. This problem is known to be NP-hard. However, most of the wireless sensor networks are hierarchical in nature, where shorter path lengths are preferred for communication between any two nodes. Given a set of sensors and a specified sensor, say , the strong minimum energy -hop rooted topology problem (h-SMERT) is to assign transmit power to each sensor such that the sum of the transmit powers of all the sensors is minimum subject to the constraints that the resulting topology containing only bidirectional links is strongly connected and the length of the path from to any other node is at most . We prove that the h-SMERT problem is NP-hard. We also prove that h-SMERT problem is APX-hard. We then show that h-SMERT problem is not approximable within a factor of 1/2 (1 - epsilon) unless NP subset of D T I M E (n(log log n)) On the positive side, we propose a -2(1 + ln n)-approximation algorithm for the h-SMERT problem. We also study two special cases of the h-SMERT problem, namely, the -rest-h-SMERT problem and the -int-h-SMERT problem. We propose a -approximation algorithm for the -rest-h-SMERT problem. The -int-h-SMERT problem is NP-hard for arbitrary . However, for fixed constant , we propose a -approximation algorithm for the -int-h-SMERT problem and obtain a polynomial time optimal algorithm for the -int-h-SMERT problem for k = 2.", "paper_title": "Strong minimum energy -hop rooted topology for hierarchical wireless sensor networks", "paper_id": "WOS:000363033600017"}