{"auto_keywords": [{"score": 0.04015336950003917, "phrase": "nursing_responses"}, {"score": 0.029657115372882882, "phrase": "immediate_response"}, {"score": 0.00481495049065317, "phrase": "in-hospital_patient_monitor_alarms"}, {"score": 0.004775531918452571, "phrase": "nurses_a_qualitative_analysis"}, {"score": 0.004583205112737672, "phrase": "vital_signs"}, {"score": 0.004416713079266374, "phrase": "patient_safety"}, {"score": 0.004273782634394231, "phrase": "false_alarms"}, {"score": 0.004221379262804442, "phrase": "nursing_workflow_interruptions"}, {"score": 0.00405127920820053, "phrase": "lived_experiences"}, {"score": 0.0037159680715717056, "phrase": "monitor_development"}, {"score": 0.0036402965997795536, "phrase": "study's_purposes"}, {"score": 0.0034506596895901003, "phrase": "patient_monitors"}, {"score": 0.0033251716926666437, "phrase": "nurses'_explanations"}, {"score": 0.0030123335878664064, "phrase": "canadian_medical_center"}, {"score": 0.0025027144548626975, "phrase": "alarm_frequency"}, {"score": 0.002431570196486513, "phrase": "alarm_data"}, {"score": 0.0024017007954518065, "phrase": "workaround_strategies"}, {"score": 0.0022300169122921906, "phrase": "patient_information"}, {"score": 0.0021845387990972543, "phrase": "interpretive_work"}, {"score": 0.0021049977753042253, "phrase": "potential_harms"}], "paper_keywords": ["Interruptions", " Monitor", " Nursing", " Qualitative study", " Workflow"], "paper_abstract": "Patient monitors generate alarms to signal changes in vital signs. Some research suggests these alarms can improve patient safety. Other reports caution that these systems generate false alarms and create nursing workflow interruptions. These findings require contextualization by qualitatively investigating the lived experiences of nurses working with these monitors. Research into the dynamics involved in nursing responses to alarms can provide insights for monitor development and implementation. This study's purposes were (1) to describe the frequency of alarms generated by patient monitors and nursing responses and (2) to report nurses' explanations of the impact of alarms on workflow and strategies for responding to alarms. Forty-nine hours of observations and 14 interviews were conducted at a Canadian medical center. Four hundred forty-six monitor alarms (1 every 6.59 minutes) were observed. Of these, 70% had no immediate response from nurses. Furthermore, 34 red alarms (potential life-threatening) were observed, with 41% having no immediate response. Nurses reported feeling overloaded by alarm frequency. They described learning to interpret alarm data and developing workaround strategies (eg, ignoring alarms). Paradoxically, alarms prompted nurses to regularly consider and interpret patient information. We suggest the interpretive work associated with work-arounds may hold benefits mitigating the potential harms of ignoring alarms.", "paper_title": "The Helpful or Hindering Effects of In-Hospital Patient Monitor Alarms on Nurses A Qualitative Analysis", "paper_id": "WOS:000303807400005"}