{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "constraint_programming"}, {"score": 0.014485609560573565, "phrase": "uncertain_and_dynamic_environments"}, {"score": 0.013904858211766518, "phrase": "original_problem"}, {"score": 0.003680587852807675, "phrase": "important_issue"}, {"score": 0.003441352119167824, "phrase": "extant_knowledge"}, {"score": 0.0033883824438527316, "phrase": "uncertain_and_dynamic_environment"}, {"score": 0.002977419551510206, "phrase": "constraint_satisfaction_problems"}, {"score": 0.0029013950320185573, "phrase": "ordered_domains"}, {"score": 0.002755104031926742, "phrase": "possible_changes"}, {"score": 0.002684740763324991, "phrase": "search_algorithm"}, {"score": 0.0023834640793589435, "phrase": "desirable_objective"}, {"score": 0.00226322835801988, "phrase": "compelling_evidence"}, {"score": 0.0021601997088758957, "phrase": "random_instances"}, {"score": 0.0021049977753042253, "phrase": "real_life_problems"}], "paper_keywords": [""], "paper_abstract": "Many real life problems that can be solved by constraint programming, come from uncertain and dynamic environments. Because of the dynamism, the original problem may change over time, and thus the solution found for the original problem may become invalid. For this reason, dealing with such problems has become an important issue in the fields of constraint programming. In some cases, there is extant knowledge about the uncertain and dynamic environment. In other cases, this information is fragmentary or unknown. In this paper, we extend the concept of robustness and stability for Constraint Satisfaction Problems (CSPs) with ordered domains, where only limited assumptions need to be made as to possible changes. We present a search algorithm that searches for both robust and stable solutions for CSPs of this nature. It is well-known that meeting both criteria simultaneously is a desirable objective for constraint solving in uncertain and dynamic environments. We also present compelling evidence that our search algorithm outperforms other general-purpose algorithms for dynamic CSPs using random instances and benchmarks derived from real life problems.", "paper_title": "Robustness and Stability in Constraint Programming under Dynamism and Uncertainty", "paper_id": "WOS:000330698200001"}