{"auto_keywords": [{"score": 0.04518073439008111, "phrase": "mechanical_assemblies"}, {"score": 0.00481495049065317, "phrase": "automatic_tolerancing_of_mechanical_assemblies"}, {"score": 0.004721711709176679, "phrase": "geometric_and_dimensional_tolerances"}, {"score": 0.004540591176992658, "phrase": "proper_achievement"}, {"score": 0.004496402246090618, "phrase": "design_function"}, {"score": 0.004037694641919865, "phrase": "tolerance_assignment"}, {"score": 0.003715425273229361, "phrase": "preprocessing_steps"}, {"score": 0.003192312493850036, "phrase": "first-order_tolerance_schema_development"}, {"score": 0.003115105266246263, "phrase": "assemblability_conditions"}, {"score": 0.0026115277372906805, "phrase": "geometric_analysis"}, {"score": 0.002344655708000408, "phrase": "satisfactory_results"}, {"score": 0.00229914226836813, "phrase": "desired_acceptance_rates"}, {"score": 0.002157223877108711, "phrase": "second-order_schema_development"}, {"score": 0.0021049977753042253, "phrase": "intended_design_function"}], "paper_keywords": [""], "paper_abstract": "Geometric and dimensional tolerances must be determined not only to ensure proper achievement of design function but also for manufacturability and assemblability of mechanical assemblies. We are investigating the degree to which it is possible to automate tolerance assignment on mechanical assemblies received only as STEP AP 203 (nominal) geometry files. In a previous paper, we reported on the preprocessing steps required: assembly feature recognition, pattern recognition, and extraction of both constraints and directions of control (DoC) for assembly. In this paper, we discuss first-order tolerance schema development, based purely on assemblability conditions. This includes selecting features to be toleranced, tolerance types, datums, and datum reference frames (DRFs), and tolerance value allocation. The approach described here is a combination of geometric analysis and heuristics. The assumption is that this initial geometric dimensioning and tolerancing (GD&T) specification will be sent to a stack analysis module and iterated upon until satisfactory results, such as desired acceptance rates, are reached. The paper also touches upon issues related to second-order schema development, one that takes intended design function into account.", "paper_title": "Toward Automatic Tolerancing of Mechanical Assemblies: First-Order GD&T Schema Development and Tolerance Allocation", "paper_id": "WOS:000365270500003"}