{"auto_keywords": [{"score": 0.035635752434219584, "phrase": "non-original_articles"}, {"score": 0.027202368274892332, "phrase": "last_author"}, {"score": 0.00481495049065317, "phrase": "'gender_gap"}, {"score": 0.004727678014364335, "phrase": "main_brazilian_psychiatric_journals"}, {"score": 0.004461568861657379, "phrase": "\"gender_gap"}, {"score": 0.00434087486151091, "phrase": "brazil"}, {"score": 0.0039611630554706205, "phrase": "total_number"}, {"score": 0.003830416706816913, "phrase": "non-original_studies"}, {"score": 0.003592630978298206, "phrase": "female_overall_participation"}, {"score": 0.0034952803157219043, "phrase": "incremental_rate"}, {"score": 0.0033388363997245286, "phrase": "average_annual_increment"}, {"score": 0.0033185114695278226, "phrase": "original_articles"}, {"score": 0.003055896595255606, "phrase": "first_author"}, {"score": 0.002991262005863753, "phrase": "original_papers"}, {"score": 0.0029549417860846284, "phrase": "non-original_ones"}, {"score": 0.0029012842615708215, "phrase": "study_period"}, {"score": 0.0027798314737488314, "phrase": "different_pattern"}, {"score": 0.0027210199396428465, "phrase": "last_authorship"}, {"score": 0.002437603221807513, "phrase": "female_last_authorship"}, {"score": 0.0023212839504822536, "phrase": "revista_brasileira_de_psiquiatria"}, {"score": 0.002176977873507044, "phrase": "gender_gap"}], "paper_keywords": ["Authorship", " Gender gap", " Scientometrics", " Bibliometrics", " Psychiatry"], "paper_abstract": "The aim of this study was to investigate the existence of a \"gender gap\" in the authorship of the four most important peer-reviewed psychiatric journals in Brazil and to quantify its magnitude. In addition, we examined the patterns of change in this gap during the period extending from 2001 to 2008 and variations according to the total number of authors, the type of article (original vs. non-original studies), and the journals themselves. A total of 1,036 articles were analyzed. We found that the proportion of female overall participation has increased from 2001 to 2008. Nevertheless, the incremental rate was accounted mostly by the growth of the participation in non-original articles. While the average annual increment for original articles was virtually null (.01%), for the non-original articles the corresponding figure was 3.7%. We also found that the chance of a woman being first author was about three times greater in original papers as compared to non-original ones at the beginning of the study period; this differential declined by 11% per year during this period. A different pattern emerged from the analysis of female last authorship. Year of publication and type of study were still associated with the chance of a woman being the last author but without interaction. Further, the journals themselves were found to be related with female last authorship: the chance of a woman being the last author in an article published in the Revista Brasileira de Psiquiatria was significantly smaller than in the other three journals. Our findings indicate clearly that some progress in being achieved in eliminating the gender gap also in field of Psychiatry and highlight the need for further research in this area.", "paper_title": "Is there a 'gender gap' in authorship of the main Brazilian psychiatric journals at the beginning of the 21st century?", "paper_id": "WOS:000284888600003"}