{"auto_keywords": [{"score": 0.03999220964688797, "phrase": "peer_review"}, {"score": 0.00481495049065317, "phrase": "online_self-correction"}, {"score": 0.004694318418023971, "phrase": "others'_perspectives"}, {"score": 0.0045726187330434025, "phrase": "mental_process"}, {"score": 0.004518442937844318, "phrase": "individual's_internal_problem-solving_activity"}, {"score": 0.004429566229017728, "phrase": "face-to-face_instruction"}, {"score": 0.00405873677211836, "phrase": "students'_reflection"}, {"score": 0.003573859492987647, "phrase": "online_system"}, {"score": 0.0034208822062692127, "phrase": "reflective_journal"}, {"score": 0.0033402088717816416, "phrase": "content_analysis"}, {"score": 0.0028601252251285025, "phrase": "text_improvement"}, {"score": 0.002726740692380339, "phrase": "grammatical_errors"}, {"score": 0.002478297391121455, "phrase": "text_development"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Reflection", " Self-correction", " Peer review", " Text revision", " Writing"], "paper_abstract": "Reflection is considered as a mental process of an individual's internal problem-solving activity and rarely observed in face-to-face instruction. As a consequence, students have few opportunities to observe and learn from each other. This study aimed to arouse students' reflection on both self-correction (one's own problem-solving process in writing) and peer review (peers' problem-solving process in writing) to improve their texts in an online system. A sample of 95 undergraduate students was recruited to write a reflective journal, which was analyzed by content analysis to compare their reflection on self-correction with peer review in writing. Results of this study revealed that reflecting on the differences between self-correction and peer review enabled students to monitor, evaluate, and adjust their writing processes in the pursuit of text improvement. In their reflective journals, students claimed that self-correction helped them detect grammatical errors (local revision) while peer review allowed them to view their own texts from others' perspectives. Based on others' perspectives, they could make further revisions on text development, organization, or style (global revision). Through reflection on self-correction and peer review, students were willing to provide further support to peers and learn from each other in the process of writing. (C) 2010 Elsevier Ltd. All rights reserved.", "paper_title": "Students' reflection on online self-correction and peer review to improve writing", "paper_id": "WOS:000280985600027"}