{"auto_keywords": [{"score": 0.034506990994752455, "phrase": "visual_communications_design"}, {"score": 0.004657911938553288, "phrase": "dual_process"}, {"score": 0.00454348803376906, "phrase": "epistemological_weaknesses"}, {"score": 0.0044687642978081185, "phrase": "visual_communications_designers"}, {"score": 0.003591824245643109, "phrase": "knowledge_exterior"}, {"score": 0.0033517821033712623, "phrase": "literature_analysis"}, {"score": 0.003206615786563051, "phrase": "overlapping_interest"}, {"score": 0.0031625495798313615, "phrase": "cyclic_nature"}, {"score": 0.00273856268065539, "phrase": "visual_communication_practices"}, {"score": 0.0027009111615317687, "phrase": "circular_fashion"}, {"score": 0.0026198851984058735, "phrase": "new_areas"}, {"score": 0.0025624842400376346, "phrase": "second-order_cybernetics"}, {"score": 0.0023129000791151898, "phrase": "external_investigation"}, {"score": 0.0023001222556899327, "phrase": "visual_communications_artefacts"}, {"score": 0.0022684849853157802, "phrase": "potential_test-bed"}, {"score": 0.0021943157210982957, "phrase": "global_scale"}, {"score": 0.002134359860048694, "phrase": "constructive_guidance"}], "paper_keywords": ["cybernetics", " design", " knowledge creation"], "paper_abstract": "Purpose - The paper seeks to serve a dual process, first, to raise awareness of the epistemological weaknesses inherent in the ways that visual communications designers address their own practice, and, second, to suggest that cybernetics has some of the answers to these weaknesses. Design/methodology/approach - These objectives of this paper have been addressed through an examination of the cybernetics, critical theory and visual design theory. A comparison of the points of convergence (often of aims) and those points of divergence (often in its ontological reading of the world) is illuminating, especially when post-structuralist semiotics - as a system of knowledge exterior to both design and cybernetics, yet capable of commenting on both - is used as a point of triangulation. Findings - The literature analysis carried for this paper indicates that in both visual communications design and cybernetics there are areas of overlapping interest (concerns with the cyclic nature of coding and decoding information) and areas that might at first seem divergent but are in fact often complementary (the role of the observer as controller and participant in a system). The paper proposes that cybernetics uncovers principles at the heart of communication that in turn inform visual communication practices, which in a circular fashion informs cybernetics. Practical implications - The paper suggests that new areas for cyberneticians to use in their study of second-order cybernetics may be found in the product of visual communications design. It also suggests areas where designers may begin to search for tools that may be useful in evaluating their working practices. Originality/value - The paper notes that an external investigation of visual communications artefacts presents cybernetics with a potential test-bed on which to test its theories, in practice, on a global scale. Cybernetics has the potential to define and offer constructive guidance to visual communications design in examining its own practice.", "paper_title": "It's all about communication: graphics and cybernetics", "paper_id": "WOS:000251883500010"}