{"auto_keywords": [{"score": 0.03816494122726076, "phrase": "sensing_capability"}, {"score": 0.004580550308652044, "phrase": "cellular_network"}, {"score": 0.004076858589744185, "phrase": "optimal_sensing_time"}, {"score": 0.004031865694174726, "phrase": "power_allocation"}, {"score": 0.0037721073763702486, "phrase": "multi-subband_systems"}, {"score": 0.003158088307044493, "phrase": "resource_allocation_problem"}, {"score": 0.003123203316511694, "phrase": "simulation_results"}, {"score": 0.002779318608820933, "phrase": "cellular_link"}, {"score": 0.0027333769432036905, "phrase": "single-subband_single-subcarrier_case"}, {"score": 0.0026732973536990373, "phrase": "single-subband_multi-subcarrier_case"}, {"score": 0.002445865715873089, "phrase": "multi-subband_case"}, {"score": 0.0021763973978248005, "phrase": "greedy_algorithm"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Sensing based spectrum sharing D2D", " Power allocation", " Partially observable Markov decision process", " Spectrum sensing"], "paper_abstract": "To improve the spectral efficiency of a cellular network, sensing based spectrum sharing device-to-device (sensing-based D2D) technique is introduced in this paper. To be specific, efficient algorithms are introduced to find the optimal sensing time and power allocation for single-subband sensing-based D2D systems under cellular link's rate loss constraint. For multi-subband systems, D2D users may have limited sensing capability where only a part of the subbands can be sensed. Accordingly, a partially observable Markov decision process (POMDP) model is introduced and an efficient algorithm is introduced to address the resource allocation problem. Simulation results suggest that sensing-based D2D outperforms overlay D2D when the transmitter of D2D link is far away from the receiver of cellular link in the single-subband single-subcarrier case. In the single-subband multi-subcarrier case, sensing-based D2D can achieve 15.2% increase in spectral-efficiency over overlay D2D. In the multi-subband case, when D2D users have limited sensing capability, our proposed Separate Principle method can further improve D2D link's spectral-efficiency by 5% similar to 15% compared to the Greedy algorithm. (C) 2015 Elsevier Ltd. All rights reserved.", "paper_title": "Optimal resource allocation for sensing-based spectrum sharing D2D networks", "paper_id": "WOS:000357901800011"}