{"auto_keywords": [{"score": 0.0497377294589231, "phrase": "relational_graphs"}, {"score": 0.04741299117588779, "phrase": "important_patterns"}, {"score": 0.00481495049065317, "phrase": "important_subgraph_discovery"}, {"score": 0.00472961267657106, "phrase": "significant_number"}, {"score": 0.004662427600500598, "phrase": "effective_and_efficient_manipulation"}, {"score": 0.004514714250357749, "phrase": "someexample_applications"}, {"score": 0.00441883624011048, "phrase": "microarray_data"}, {"score": 0.004084307764140389, "phrase": "existing_methods"}, {"score": 0.0040262522882015175, "phrase": "mining_techniques"}, {"score": 0.003997533498401968, "phrase": "graph_data"}, {"score": 0.0036815763368083197, "phrase": "mined_patterns"}, {"score": 0.0034890505116128606, "phrase": "frequent_subgraph_mining"}, {"score": 0.0033663073782936952, "phrase": "connected_subgraphs"}, {"score": 0.003111211706454155, "phrase": "data_characteristics"}, {"score": 0.0030779528295407925, "phrase": "frequency_threshold"}, {"score": 0.0029484244900690485, "phrase": "\"_goodness\"_criteria"}, {"score": 0.002676514445417281, "phrase": "discovered_patterns"}, {"score": 0.0025364139244227458, "phrase": "subgraph_discovery"}, {"score": 0.00249135867469492, "phrase": "important_connected_subgraphs"}, {"score": 0.002174041708084857, "phrase": "proposed_technique"}, {"score": 0.0021354096283081317, "phrase": "real-_life"}, {"score": 0.0021049977753042253, "phrase": "synthetically_generated_data_sets"}], "paper_keywords": ["graph mining", " skyline processing", " edge connectivity"], "paper_abstract": "A significant number of applications require effective and efficient manipulation of relational graphs, towards discovering important patterns. Someexample applications are: ( i) analysis of microarray data in bioinformatics, ( ii) pattern discovery in a large graph representing a social network, ( iii) analysis of transportation networks, ( iv) community discovery in Web data. The basic approach followed by existing methods is to apply mining techniques on graph data to discover important patterns, such as subgraphs that are likely to be useful. However, in some cases the number of mined patterns is large, posing difficulties in selecting the most important ones. For example, applying frequent subgraph mining on a set of graphs the system returns all connected subgraphs whose frequency is above a specified ( usually user- defined) threshold. The number of discovered patterns may be large, and this number depends on the data characteristics and the frequency threshold specified. It would be more convenient for the user if \" goodness\" criteria could be set to evaluate the usefulness of these patterns, and if the user could provide preferences to the system regarding the characteristics of the discovered patterns. In this paper, we propose a methodology to support such preferences by applying subgraph discovery in relational graphs towards retrieving important connected subgraphs. The importance of a subgraph is determined by: ( i) the order of the subgraph ( the number of vertices) and ( ii) the subgraph edge connectivity. The performance of the proposed technique is evaluated by using real- life as well as synthetically generated data sets.", "paper_title": "SkyGraph: an algorithm for important subgraph discovery in relational graphs", "paper_id": "WOS:000258290700005"}