{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "generalized_gossiping"}, {"score": 0.004527804152066942, "phrase": "basic_gossip_problem"}, {"score": 0.004390689303780405, "phrase": "n_individuals"}, {"score": 0.003512841739654183, "phrase": "chosen_matching"}, {"score": 0.0033030907500120397, "phrase": "single_item"}, {"score": 0.0031178024467857215, "phrase": "broadcasting_problem"}, {"score": 0.0028100102841877835, "phrase": "basic_extensions"}, {"score": 0.002683125911877974, "phrase": "specified_subset"}, {"score": 0.0025619562094446884, "phrase": "single_individual"}, {"score": 0.002308910575113746, "phrase": "storage_devices"}, {"score": 0.002256155453630723, "phrase": "parallel_disks"}, {"score": 0.0022302306304023602, "phrase": "initial_data_distribution"}, {"score": 0.0021792693001152896, "phrase": "initial_data_layout"}, {"score": 0.0021049977753042253, "phrase": "single_server"}], "paper_keywords": [""], "paper_abstract": "The problems of gossiping and broadcasting have been widely studied. The basic gossip problem is defined as follows: there are n individuals, with each individual having an item of gossip. The goal is to communicate each item of gossip to every other individual. Communication typically proceeds in rounds, with the objective of minimizing the number of rounds. One popular model. called the telephone call model, allows for communication to take place on any chosen matching between the individuals in each round. Each individual may send (receive) a single item of gossip in a round to (from) another individual. In the broadcasting problem, one individual wishes to broadcast an item of gossip to everyone else. In this paper, we study generalizations of gossiping and broadcasting. The basic extensions are: (a) each item of gossip needs to be broadcast to a specified subset of individuals and (b) several items of gossip may be known to a single individual. We study several problems in this framework that generalize gossiping and broadcasting. Our study of these generalizations was motivated by the problem of managing data on storage devices, typically a set of parallel disks. For initial data distribution, or for creating an initial data layout we may need to distribute data from a single server or from a collection of sources. (c) 2005 Elsevier Inc. All rights reserved.", "paper_title": "On generalized gossiping and broadcasting", "paper_id": "WOS:000237705100001"}