{"auto_keywords": [{"score": 0.049783551527037576, "phrase": "fake_followers"}, {"score": 0.015719716506582538, "phrase": "fake_twitter_followers"}, {"score": 0.012645624701603934, "phrase": "academia"}, {"score": 0.012076094106811085, "phrase": "baseline_dataset"}, {"score": 0.004741030507509777, "phrase": "twitter_accounts"}, {"score": 0.004582358363660175, "phrase": "target_account"}, {"score": 0.004484148947356818, "phrase": "social_platform"}, {"score": 0.00428070047395936, "phrase": "twittersphere"}, {"score": 0.0040486587472870076, "phrase": "different_dimensions"}, {"score": 0.003666647736663085, "phrase": "verified_human_and_fake_follower_accounts"}, {"score": 0.0035548008271253607, "phrase": "scientific_community"}, {"score": 0.003414467360488913, "phrase": "machine-learning_classifiers"}, {"score": 0.003372408902017458, "phrase": "reviewed_rules"}, {"score": 0.0032192371383026543, "phrase": "unsatisfactory_performance"}, {"score": 0.0030825404960282713, "phrase": "spam_detection"}, {"score": 0.0030634906292640947, "phrase": "good_results"}, {"score": 0.0027827907725673845, "phrase": "final_result"}, {"score": 0.0027570267191549774, "phrase": "novel_class_a_classifier"}, {"score": 0.0025434724309942986, "phrase": "original_training"}, {"score": 0.002488851299416018, "phrase": "information_fusion-based_sensitivity_analysis"}, {"score": 0.002450554073692113, "phrase": "global_sensitivity"}, {"score": 0.0022747539135765204, "phrase": "thorough_experimental_methodology"}, {"score": 0.002171328030402927, "phrase": "novel_issue"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Twitter", " Fake followers", " Anomalous account detection", " Baseline dataset", " Machine learning"], "paper_abstract": "Fake followers are those Twitter accounts specifically created to inflate the number of followers of a target account. Fake followers are dangerous for the social platform and beyond, since they may alter concepts like popularity and influence in the Twittersphere hence impacting on economy, politics, and society. In this paper, we contribute along different dimensions. First, we review some of the most relevant existing features and rules (proposed by Academia and Media) for anomalous Twitter accounts detection. Second, we create a baseline dataset of verified human and fake follower accounts. Such baseline dataset is publicly available to the scientific community. Then, we exploit the baseline dataset to train a set of machine-learning classifiers built over the reviewed rules and features. Our results show that most of the rules proposed by Media provide unsatisfactory performance in revealing fake followers, while features proposed in the past by Academia for spam detection provide good results. Building on the most promising features, we revise the classifiers both in terms of reduction of overfitting and cost for gathering the data needed to compute the features. The final result is a novel Class A classifier, general enough to thwart overfitting, lightweight thanks to the usage of the less costly features, and still able to correctly classify more than 95% of the accounts of the original training set. We ultimately perform an information fusion-based sensitivity analysis, to assess the global sensitivity of each of the features employed by the classifier. The findings reported in this paper, other than being supported by a thorough experimental methodology and interesting on their own, also pave the way for further investigation on the novel issue of fake Twitter followers. (C) 2015 Published by Elsevier B.V.", "paper_title": "Fame for sale: Efficient detection of fake Twitter followers", "paper_id": "WOS:000367026200005"}