{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "multiresolution_subdivision_surfaces"}, {"score": 0.010864103630870734, "phrase": "topological_cracks"}, {"score": 0.004537254814246843, "phrase": "data_structures"}, {"score": 0.004252469672259375, "phrase": "classically_used_data_structures"}, {"score": 0.004028796143006953, "phrase": "nested_hierarchy"}, {"score": 0.003900257249255497, "phrase": "subdivision_schemes"}, {"score": 0.0034442607586033657, "phrase": "time_complexity"}, {"score": 0.003407214479510987, "phrase": "neighborhood_queries"}, {"score": 0.0031759067385562553, "phrase": "adaptive_subdivision_case"}, {"score": 0.0030414140732789186, "phrase": "new_topological_model"}, {"score": 0.0028502479839354637, "phrase": "well-known_half-edge_data_structure"}, {"score": 0.0027001292153471202, "phrase": "resolution_level"}, {"score": 0.002530359917257626, "phrase": "primal_and_dual_schemes"}, {"score": 0.002222102813520549, "phrase": "combinatorial_maps_framework"}], "paper_keywords": ["Geometric modeling", " Topological model", " Combinatorial maps", " Multiresolution meshes", " Subdivision surfaces"], "paper_abstract": "We address in this paper the problem of the data structures used for the representation and the manipulation of multiresolution subdivision surfaces. The classically used data structures are based on quadtrees, straightforwardly derived from the nested hierarchy of faces generated by the subdivision schemes. Nevertheless, these structures have some drawbacks: specificity to the kind of mesh (triangle or quad); the time complexity of neighborhood queries is not optimal; topological cracks are created in the mesh in the adaptive subdivision case. We present in this paper a new topological model for encoding multiresolution subdivision surfaces. This model is an extension to the well-known half-edge data structure. It allows instant and efficient navigation at any resolution level of the mesh. Its generality allows the support of many subdivision schemes including primal and dual schemes. Moreover, subdividing the mesh adaptively does not create topological cracks in the mesh. The extension proposed here is formalized in the combinatorial maps framework. This allows us to give a very general formulation of our extension.", "paper_title": "Extension of half-edges for the representation of multiresolution subdivision surfaces", "paper_id": "WOS:000262485700005"}