{"auto_keywords": [{"score": 0.04901380668219845, "phrase": "gaussian_n-relay_diamond_network"}, {"score": 0.012862540844668644, "phrase": "k_relays"}, {"score": 0.0101881871841165, "phrase": "n-relay_diamond_network"}, {"score": 0.00481495049065317, "phrase": "wireless_network_simplification"}, {"score": 0.004486147558765763, "phrase": "n-relay_nodes"}, {"score": 0.004193169496350484, "phrase": "available_relays"}, {"score": 0.0040866404150657005, "phrase": "channel_configurations"}, {"score": 0.0036868116297599255, "phrase": "information_theoretic_cutset"}, {"score": 0.0035931003474699583, "phrase": "whole_network"}, {"score": 0.0035130521069092493, "phrase": "channel_coefficients"}, {"score": 0.0034797809452940874, "phrase": "snr"}, {"score": 0.003010017873923648, "phrase": "single_relay"}, {"score": 0.002697799358876857, "phrase": "total_capacity"}, {"score": 0.0026718527964253312, "phrase": "high-capacity_k-relay_subnetworks"}, {"score": 0.002554021496818708, "phrase": "constant_gap_approximation"}, {"score": 0.002417887626368368, "phrase": "high-capacity_k-relay_subnetwork"}, {"score": 0.002326174890933973, "phrase": "new_approximation"}, {"score": 0.002153031476985805, "phrase": "intermediate_snr_regime"}, {"score": 0.0021323131137170478, "phrase": "hybrid_approximation"}, {"score": 0.0021049977753042253, "phrase": "existing_purely_additive_or_purely_multiplicative_approximations"}], "paper_keywords": ["Gaussian relay networks", " diamond network", " capacity approximations", " network simplification", " relay selection"], "paper_abstract": "We consider the Gaussian N-relay diamond network, where a source wants to communicate to destination node through a layer of N-relay nodes. We investigate the following question: what fraction of the capacity can we maintain using only k out of the N available relays? We show that independent of the channel configurations and operating SNR, we can always find a subset of k relays, which alone provide a rate k/(k + 1)(C) over bar - G, where (C) over bar is the information theoretic cutset upper bound on the capacity of the whole network and G is independent of the channel coefficients and the SNR and depends only on N and k (logarithmic in N and linear in k). In particular, for k = 1, this means that half of the capacity of any N-relay diamond network can be approximately achieved by routing information over a single relay. We also show that this fraction is tight: there are configurations of the N-relay diamond network, where every subset of k relays alone can at most provide approximately a fraction k/(k + 1) of the total capacity. These high-capacity k-relay subnetworks can be also discovered efficiently. We propose an algorithm that computes a constant gap approximation to the capacity of the Gaussian N-relay diamond network in O(N log N) running time and discovers a high-capacity k-relay subnetwork in O(kN) running time. This result also provides a new approximation to the capacity of the Gaussian N-relay diamond network, which is hybrid in nature: it has both multiplicative and additive gaps. In the intermediate SNR regime, this hybrid approximation is tighter than existing purely additive or purely multiplicative approximations to the capacity of this network.", "paper_title": "Wireless Network Simplification: The Gaussian N-Relay Diamond Network", "paper_id": "WOS:000342416900031"}