{"auto_keywords": [{"score": 0.0478232770770294, "phrase": "transient_faults"}, {"score": 0.04752996363942487, "phrase": "sensor_readings"}, {"score": 0.03863803926884115, "phrase": "estimation_methods"}, {"score": 0.037108139517462106, "phrase": "time-series-analysis-based_methods"}, {"score": 0.0048159226002964465, "phrase": "sensor"}, {"score": 0.004692699265201631, "phrase": "real-world_datasets"}, {"score": 0.004400419843791404, "phrase": "simple_question"}, {"score": 0.004288648163837944, "phrase": "real_deployments"}, {"score": 0.004139563711762907, "phrase": "faulty_sensor_readings"}, {"score": 0.0038941106036522216, "phrase": "fault_detection_methods"}, {"score": 0.0037586895199831095, "phrase": "heuristic_rules"}, {"score": 0.0036513878928387047, "phrase": "\"normal\"_sensor_behavior"}, {"score": 0.0035700457562655246, "phrase": "anomalous_sensor_readings"}, {"score": 0.0034017706220810223, "phrase": "sensor_measurement"}, {"score": 0.0033259706583441857, "phrase": "time_series_forecasting"}, {"score": 0.0032309820601312787, "phrase": "-based_methods"}, {"score": 0.0031691634837160572, "phrase": "\"normal\"_sensor_readings"}, {"score": 0.002933458667525067, "phrase": "different_points"}, {"score": 0.002886598310196588, "phrase": "rule-based_methods"}, {"score": 0.0027416032255956585, "phrase": "learning_methods"}, {"score": 0.0024810246251233195, "phrase": "short_duration_faults"}, {"score": 0.0024650878485505032, "phrase": "long_duration_ones"}, {"score": 0.0021880094145128935, "phrase": "sensor_faults"}, {"score": 0.0021186115162176457, "phrase": "first_step"}, {"score": 0.0021049977753042253, "phrase": "automated_online_fault_detection"}], "paper_keywords": ["Algorithms", " Measurement", " Fault detection", " data integrity", " statistical techniques", " fault prevalence", " sensor networks"], "paper_abstract": "Various sensor network measurement studies have reported instances of transient faults in sensor readings. In this work, we seek to answer a simple question: How often are such faults observed in real deployments? We focus on three types of transient faults, caused by faulty sensor readings that appear abnormal. To understand the prevalence of such faults, we first explore and characterize four qualitatively different classes of fault detection methods. Rule-based methods leverage domain knowledge to develop heuristic rules for detecting and identifying faults. Estimation methods predict \"normal\" sensor behavior by leveraging sensor correlations, flagging anomalous sensor readings as faults. Time-series-analysis-based methods start with an a priori model for sensor readings. A sensor measurement is compared against its predicted value computed using time series forecasting to determine if it is faulty. Learning-based methods infer a model for the \"normal\" sensor readings using training data, and then statistically detect and identify classes of faults. We find that these four classes of methods sit at different points on the accuracy/robustness spectrum. Rule-based methods can be highly accurate, but their accuracy depends critically on the choice of parameters. Learning methods can be cumbersome to train, but can accurately detect and classify faults. Estimation methods are accurate, but cannot classify faults. Time-series-analysis-based methods are more effective for detecting short duration faults than long duration ones, and incur more false positives than the other methods. We apply these techniques to four real-world sensor datasets and find that the prevalence of faults as well as their type varies with datasets. All four methods are qualitatively consistent in identifying sensor faults, lending credence to our observations. Our work is a first step towards automated online fault detection and classification.", "paper_title": "Sensor Faults: Detection Methods and Prevalence in Real-World Datasets", "paper_id": "WOS:000279366900005"}