{"auto_keywords": [{"score": 0.023483065895283227, "phrase": "customer_strategic_behavior"}, {"score": 0.015719716506582538, "phrase": "transaction_failure"}, {"score": 0.014674547994707068, "phrase": "strategic_customers"}, {"score": 0.01104657851575632, "phrase": "customer_transaction"}, {"score": 0.008207022327350095, "phrase": "customer_valuations"}, {"score": 0.004659951478263083, "phrase": "pricing_and_web_system_upgrading_problems"}, {"score": 0.004206879557938045, "phrase": "customer_online_purchasing"}, {"score": 0.004054745478848129, "phrase": "purchasing_decisions"}, {"score": 0.003972607172518598, "phrase": "transaction_success_probability"}, {"score": 0.003813269577615793, "phrase": "threshold_policy"}, {"score": 0.003782174375003052, "phrase": "customer_purchasing"}, {"score": 0.003400198866111204, "phrase": "tsp_decreases"}, {"score": 0.0031714880645482496, "phrase": "optimal_price"}, {"score": 0.0030818310926031024, "phrase": "optimal_policy"}, {"score": 0.003056682083784002, "phrase": "web_system"}, {"score": 0.002898127432512101, "phrase": "online_retailers"}, {"score": 0.0027477745788313163, "phrase": "highest_available_tsp"}, {"score": 0.0027030963394733916, "phrase": "current_tsp"}, {"score": 0.002275557501858879, "phrase": "online_retailer"}, {"score": 0.0021049977753042253, "phrase": "profit-loss_rate"}], "paper_keywords": ["Online retailing", " strategic customers", " technology adoption", " transaction failure"], "paper_abstract": "This paper considers pricing and web system upgrading problems for an online retailer facing a group of strategic customers. Due to various website issues, there is a possibility of transaction failure in the process of customer online purchasing. Strategic customers will anticipate this possibility and make purchasing decisions based on their belief on transaction success probability (TSP). First, we prescribe a threshold policy for customer purchasing: The customer will buy the product if his valuation for this product is above a threshold and will not otherwise. The threshold increases as TSP decreases, customer transaction cost increases, or customers become more risk averse. Second, we derive the optimal price of each period and identify the optimal policy for web system upgrading: There exists a threshold for each period such that the online retailers should upgrade their web system to the state of art (i.e., achieve highest available TSP) only if current TSP is below the threshold and should not upgrade otherwise. The threshold (total discounted profit) increases as customer transaction cost decreases, customer valuations for the product become higher, or customers become more (less) risk averse. Third, we find that the online retailer tends to price higher if it ignores customer strategic behavior. The cost of ignoring customer strategic behavior is substantial. The profit-loss rate of ignoring customer strategic behavior increases as customer transaction cost increases, customer valuations for the product become lower, or customers become more risk averse.", "paper_title": "Web System Upgrading with Transaction Failure and Strategic Customers", "paper_id": "WOS:000330131800007"}