{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "target_cliffs"}, {"score": 0.004532892812505505, "phrase": "target_specificity"}, {"score": 0.004464987136420614, "phrase": "small_molecules"}, {"score": 0.004414723336530117, "phrase": "important_task"}, {"score": 0.004381527499253281, "phrase": "drug_design"}, {"score": 0.004315879542755464, "phrase": "ideal_situation"}, {"score": 0.004171730509424374, "phrase": "individual_target"}, {"score": 0.0039124037252916055, "phrase": "increasing_evidence"}, {"score": 0.0036969566358089644, "phrase": "potency_differences"}, {"score": 0.0033765627434550432, "phrase": "simple_case"}, {"score": 0.0029360049890445944, "phrase": "multi-target_activities"}, {"score": 0.0028058141911641225, "phrase": "consistent_manner"}, {"score": 0.0026411384812121503, "phrase": "complex_selectivity_patterns"}, {"score": 0.0026113524778702624, "phrase": "target_cliff"}, {"score": 0.002486103638234488, "phrase": "large_difference"}, {"score": 0.0023848164282879885, "phrase": "activity_cliffs"}, {"score": 0.002340147988348115, "phrase": "target_pairs"}], "paper_keywords": [""], "paper_abstract": "The study of target specificity or selectivity of small molecules is an important task in drug design. In an ideal situation, a compound would exclusively interact with an individual target and hence be target specific. However, such exclusive binding events are likely to be rare, as increasing evidence suggests. Because many compounds are active against more than one target, apparent selectivity often results from potency differences, i.e., a compound that is highly potent against a given target and weakly potent against one or more others displays target selectivity. In a simple case, a compound might have known activity against a pair of targets and be selective for one over the other. Then, selectivity is straightforward to rationalize. However, there are many more complex selectivity relationships associated with multi-target activities of compounds that are difficult to analyze and compare in a consistent manner. For this purpose, we introduce herein target cliffs as a concept to describe complex selectivity patterns. A target cliff is defined as a pair of targets against which at least one compound displays a large difference in potency. As such, target cliffs are distinct from activity cliffs. However, qualifying target pairs (target cliffs) and compound pairs (activity cliffs) can be systematically extracted from the same data structure termed target-compound matrices. Furthermore, these two types of cliffs can be compared to identify and prioritize compounds that are selective and reveal structure-activity relationship (SAR) information.", "paper_title": "Introduction of Target Cliffs as a Concept To Identify and Describe Complex Molecular Selectivity Patterns", "paper_id": "WOS:000316774000004"}