{"auto_keywords": [{"score": 0.04959024199151092, "phrase": "collaborative_networks"}, {"score": 0.00481495049065317, "phrase": "authors'_names"}, {"score": 0.004621279527317074, "phrase": "complex_networks"}, {"score": 0.004367581653370531, "phrase": "complex_systems"}, {"score": 0.003861175855298779, "phrase": "collaboration_networks"}, {"score": 0.0034485432592912917, "phrase": "hybrid_approach"}, {"score": 0.0033957904376127187, "phrase": "authors'_collaboration_patterns"}, {"score": 0.0030327408069772293, "phrase": "traditional_approach"}, {"score": 0.002986329509791943, "phrase": "topological_features"}, {"score": 0.0028807718824400697, "phrase": "main_factor"}, {"score": 0.0027505037762786087, "phrase": "homonymous_authors"}, {"score": 0.002708399936381754, "phrase": "average_shortest_path_length"}, {"score": 0.002443671484766342, "phrase": "hybrid_system"}, {"score": 0.0023451553255837317, "phrase": "traditional_analysis"}, {"score": 0.0023211517663846346, "phrase": "collaboration_patterns"}, {"score": 0.0021049977753042253, "phrase": "complex_interactions"}], "paper_keywords": ["Collaborative networks", " Disambiguation", " Collaboration patterns", " Hybrid classification"], "paper_abstract": "Concepts and methods of complex networks have been employed to uncover patterns in a myriad of complex systems. Unfortunately, the relevance and significance of these patterns strongly depends on the reliability of the datasets. In the study of collaboration networks, for instance, unavoidable noise pervading collaborative networks arises when authors share the same name. To address this problem, we derive a hybrid approach based on authors' collaboration patterns and topological features of collaborative networks. Our results show that the combination of strategies, in most cases, performs better than the traditional approach which disregards topological features. We also show that the main factor accounting for the improvement in the discriminability of homonymous authors is the average shortest path length. Finally, we show that it is possible to predict the weighting associated to each strategy compounding the hybrid system by examining the discrimination obtained from the traditional analysis of collaboration patterns. Because the methodology devised here is generic, our approach is potentially useful to classify many other networked systems governed by complex interactions.", "paper_title": "Topological-collaborative approach for disambiguating authors' names in collaborative networks", "paper_id": "WOS:000347297400025"}