{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "mobile_phones"}, {"score": 0.015442919463805223, "phrase": "transportation_modes"}, {"score": 0.0035901685646972585, "phrase": "new_use"}, {"score": 0.0034841647157189985, "phrase": "contextual_information"}, {"score": 0.0028758391869611374, "phrase": "mobile_phone"}, {"score": 0.0028245516301681713, "phrase": "built-in_gps_receiver"}, {"score": 0.0024604876113911173, "phrase": "motorized_transport"}, {"score": 0.002416589459425828, "phrase": "overall_classification_system"}, {"score": 0.0023592715993204796, "phrase": "decision_tree"}, {"score": 0.0023033100935570755, "phrase": "first-order_discrete_hidden_markov_model"}, {"score": 0.0021049977753042253, "phrase": "sixteen_individuals"}], "paper_keywords": ["Algorithm", " Design", " Experimentation", " Activity classification", " mobile phones", " transportation mode inference"], "paper_abstract": "As mobile phones advance in functionality and capability, they are being used for more than just communication. Increasingly, these devices are being employed as instruments for introspection into habits and situations of individuals and communities. Many of the applications enabled by this new use of mobile phones rely on contextual information. The focus of this work is on one dimension of context, the transportation mode of an individual when outside. We create a convenient (no specific position and orientation setting) classification system that uses a mobile phone with a built-in GPS receiver and an accelerometer. The transportation modes identified include whether an individual is stationary, walking, running, biking, or in motorized transport. The overall classification system consists of a decision tree followed by a first-order discrete Hidden Markov Model and achieves an accuracy level of 93.6% when tested on a dataset obtained from sixteen individuals.", "paper_title": "Using Mobile Phones to Determine Transportation Modes", "paper_id": "WOS:000275163100004"}