{"auto_keywords": [{"score": 0.04694105858829315, "phrase": "oo_metrics"}, {"score": 0.005686050899599958, "phrase": "random-effect_model"}, {"score": 0.00526951384684591, "phrase": "data_selection_bias"}, {"score": 0.004980669049059975, "phrase": "change-prone_and_not_change-prone_classes"}, {"score": 0.00481495049065317, "phrase": "object-oriented_metrics"}, {"score": 0.004019667124208171, "phrase": "small_number"}, {"score": 0.00368292623004839, "phrase": "relatively_few_systems"}, {"score": 0.003317612543400555, "phrase": "statistical_meta-analysis_techniques"}, {"score": 0.003126579632610959, "phrase": "next_version"}, {"score": 0.0029799963905662447, "phrase": "investigated_oo_metrics"}, {"score": 0.0028004259937533167, "phrase": "relative_operating_characteristic"}, {"score": 0.0027455847214706572, "phrase": "predictive_effectiveness"}, {"score": 0.002699431192257011, "phrase": "oo_metric"}, {"score": 0.0026390945749753926, "phrase": "corresponding_variances"}, {"score": 0.0026242217741112256, "phrase": "individual_systems"}, {"score": 0.0025439032008217725, "phrase": "average_auc"}, {"score": 0.002473016235563624, "phrase": "sensitivity_analysis"}, {"score": 0.0024383151463193793, "phrase": "auc_result"}, {"score": 0.002337099394527396, "phrase": "random-effect_models"}, {"score": 0.0021776365628787065, "phrase": "lower_predictive_ability"}, {"score": 0.0021592456879408937, "phrase": "size_metrics"}, {"score": 0.0021229275892217583, "phrase": "inheritance_metrics"}, {"score": 0.0021049977753042253, "phrase": "poor_ability"}], "paper_keywords": ["Object-oriented", " Metrics", " Change-proneness", " Meta-analysis", " Random-effect model", " Sensitivity analysis"], "paper_abstract": "Many studies have investigated the relationships between object-oriented (OO) metrics and change-proneness and conclude that OO metrics are able to predict the extent of change of a class across the versions of a system. However, there is a need to re-examine this subject for two reasons. First, most studies only analyze a small number of OO metrics and, therefore, it is not clear whether this conclusion is applicable to most, if not all, OO metrics. Second, most studies only uses relatively few systems to investigate the relationships between OO metrics and change-proneness and, therefore, it is not clear whether this conclusion can be generalized to other systems. In this paper, based on 102 Java systems, we employ statistical meta-analysis techniques to investigate the ability of 62 OO metrics to predict change-proneness. In our context, a class which is changed in the next version of a system is called change-prone and not change-prone otherwise. The investigated OO metrics cover four metric dimensions, including 7 size metrics, 18 cohesion metrics, 20 coupling metrics, and 17 inheritance metrics. We use AUC (the area under a relative operating characteristic, ROC) to evaluate the predictive effectiveness of OO metrics. For each OO metric, we first compute AUCs and the corresponding variances for individual systems. Then, we employ a random-effect model to compute the average AUC over all systems. Finally, we perform a sensitivity analysis to investigate whether the AUC result from the random-effect model is robust to the data selection bias in this study. Our results from random-effect models reveal that: (1) size metrics exhibit moderate or almost moderate ability in discriminating between change-prone and not change-prone classes; (2) coupling and cohesion metrics generally have a lower predictive ability compared to size metrics; and (3) inheritance metrics have a poor ability to discriminate between change-prone and not change-prone classes. Our results from sensitivity analyses show that these conclusions reached are not substantially influenced by the data selection bias.", "paper_title": "The ability of object-oriented metrics to predict change-proneness: a meta-analysis", "paper_id": "WOS:000300343800003"}