{"auto_keywords": [{"score": 0.049404922364310655, "phrase": "recipient's_name"}, {"score": 0.005299977843927479, "phrase": "personal_relevance"}, {"score": 0.00481495049065317, "phrase": "smoking_cessation_message"}, {"score": 0.004696909870731282, "phrase": "persuasive_message"}, {"score": 0.0046649648208163365, "phrase": "health_value"}, {"score": 0.00428314621261913, "phrase": "defensive_reactions"}, {"score": 0.004222795179790998, "phrase": "subsequent_decrease"}, {"score": 0.0038780652371817447, "phrase": "smoking_cessation"}, {"score": 0.00376950244909, "phrase": "standard_text"}, {"score": 0.0030788521585190802, "phrase": "self-affirmation_procedure"}, {"score": 0.0029925953740661754, "phrase": "dependent_variable"}, {"score": 0.0027873491386063913, "phrase": "defensive_reaction"}, {"score": 0.002317055705600351, "phrase": "individual_differences"}, {"score": 0.0021049977753042253, "phrase": "defensive_processes"}], "paper_keywords": ["Personalization", " Name mentioning", " Health communication", " Persuasion", " Self-affirmation", " Defensive processing", " Personal relevance", " Smoking tobacco"], "paper_abstract": "Mentioning the recipient's name in a persuasive message is one way to personalize messages in an attempt to increase persuasion. However, this type of personalization may lead to a self-threat that activates defensive reactions and to a subsequent decrease in persuasion. A self-affirmation procedure that induces open-mindedness may prevent this drawback. Smokers were exposed to a message advocating smoking cessation in one of three experimental conditions presenting: A standard text, a text with the recipient's name incorporated four times, or a text with the recipient's name incorporated twelve times. The extent to which smokers indicated at pretest to value their health was used as a measure of personal relevance of the message, and tested as a moderator. Half of the smokers was exposed to a self-affirmation procedure before they read the text. The dependent variable was the intention to quit smoking. When health value was moderate, mentioning the recipient's name twelve times induced a defensive reaction, significantly lowering persuasion. This was supported by the observation that self-affirmation prevented this effect. When health value was high, mentioning the recipient's name twelve times significantly increased persuasion. However, when self-affirmation was applied, persuasion was significantly lowered. The effects of mentioning the recipient's name depend on individual differences in personal relevance of the message (health value) before exposure to the message: Name mentioning can increase, but also decrease persuasion, through defensive processes.", "paper_title": "The persuasive effects of personalization through: name mentioning in a smoking cessation message", "paper_id": "WOS:000344183500003"}