{"auto_keywords": [{"score": 0.03419789600186253, "phrase": "natural_language"}, {"score": 0.030132099441765706, "phrase": "formal_language"}, {"score": 0.00481495049065317, "phrase": "generalized_zipf-mandelbrot_law_parameters."}, {"score": 0.004524348699657099, "phrase": "generalized_zipf-mandelbrot_law"}, {"score": 0.0040171817997972335, "phrase": "law_models"}, {"score": 0.0038392331564122387, "phrase": "school_textbooks"}, {"score": 0.0037532257703888315, "phrase": "pearson_system"}, {"score": 0.0033893426032054366, "phrase": "statistical_law"}, {"score": 0.0030955250132409964, "phrase": "ecological_models"}, {"score": 0.002975099633631871, "phrase": "particular_case"}, {"score": 0.0029415584202462444, "phrase": "mathematical_models"}, {"score": 0.0025673005153462707, "phrase": "generalized_law"}], "paper_keywords": ["Modelling", " Pearson system", " Statistical law", " Texts"], "paper_abstract": "This article provides an interpretation of the parameters of the generalized Zipf-Mandelbrot law, which the authors have called the generalized range-frequency law which has been developed in 2009. Said law models the distribution of frequencies of words in school textbooks obtained using a Pearson system. The significance of the parameters gathered was obtained by analyzing certain variables. The fact that the statistical law can be applied to texts written using natural language means that it may be applicable to ecological models, these being considered as a particular case of mathematical models written as texts in a formal language, as developed in 1999. After establishing certain hypotheses regarding the significance of the parameters of the generalized law obtained for natural language, this study was designed to analyze whether this law is applicable to models considered as texts written in formal language. If this were so, the law would be a very useful tool for comparing models.", "paper_title": "INTERPRETATION OF THE GENERALIZED ZIPF-MANDELBROT LAW PARAMETERS", "paper_id": "WOS:000265581400004"}