{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "femtocell_networks"}, {"score": 0.03592598392684348, "phrase": "recalibration_procedures"}, {"score": 0.004583205112737672, "phrase": "indoor_environments"}, {"score": 0.004230068512904886, "phrase": "associated_challenges"}, {"score": 0.0038561471948364723, "phrase": "indoor_positioning_systems"}, {"score": 0.0036703791815812328, "phrase": "accurate_and_reliable_location_services"}, {"score": 0.0036030386046805598, "phrase": "received-_power_and_fingerprint_location_techniques"}, {"score": 0.0033664873319204027, "phrase": "extremely_time-consuming_tasks"}, {"score": 0.0031649018957020337, "phrase": "novel_scenario-dependent_procedure"}, {"score": 0.002629539710839523, "phrase": "previously_recorded_fingerprints"}, {"score": 0.002518227743688769, "phrase": "measurement_phase"}, {"score": 0.002456744238900652, "phrase": "important_improvements"}, {"score": 0.00210499793205176, "phrase": "alcatel-lucent"}], "paper_keywords": [""], "paper_abstract": "The volume of traffic generated in indoor environments is increasing exponentially, and emerging femtocell networks are being deployed to meet associated challenges. These specific in-building deployments provide an opportunity for improving the performance of indoor positioning systems. Femtocell networks can be used to support accurate and reliable location services based on received- power and fingerprint location techniques. In fingerprint positioning methods, calibration and recalibration procedures are extremely time-consuming tasks. To address this problem, we developed a novel scenario-dependent procedure that reduced calibration points. We also analyzed several indoor propagation models, evaluating their suitability to reduce the effort required for calibration as well as their applicability for the recalibration procedures necessary to update previously recorded fingerprints. Our procedure includes both a simulation and a measurement phase, and obtains important improvements in accuracy, precision, and reliability while reducing the time and effort associated with both calibration and recalibration procedures. (c) 2013 Alcatel-Lucent.", "paper_title": "Enhanced In-Building Fingerprint Positioning Using Femtocell Networks", "paper_id": "WOS:000323661400013"}