{"auto_keywords": [{"score": 0.0402525648889651, "phrase": "multiple_operation_cycles"}, {"score": 0.015719716506582538, "phrase": "location_assignment"}, {"score": 0.01275792048257149, "phrase": "single_operation_cycle"}, {"score": 0.01173389657937066, "phrase": "integer_programming_model"}, {"score": 0.010523245753624275, "phrase": "two-phase_tabu_search_algorithm"}, {"score": 0.008823493618993906, "phrase": "construction_heuristic"}, {"score": 0.0034944094552943, "phrase": "dynamic_programming_model"}, {"score": 0.002758597251689795, "phrase": "search_results"}, {"score": 0.0023694065215394593, "phrase": "computational_results"}, {"score": 0.0021049977753042253, "phrase": "large-sized_problems"}], "paper_keywords": ["Location assignment", " Storage/retrieval scheduling", " Multi-shuttle", " Automated storage and retrieval system", " Two-phase tabu search", " Construction heuristic"], "paper_abstract": "This paper deals with the location assignment and storage/retrieval scheduling problem simultaneously in multi-shuttle automated storage/retrieval systems. Both the situations of performing a single operation cycle and multiple operation cycles are considered. Two related models, including an integer programming model and a dynamic programming model, are developed to formulate the problem. A two-phase tabu search algorithm is proposed to solve the integer programming model for the situation of performing a single operation cycle. Based on the search results, a construction heuristic is developed to improve the solution for the situation of performing multiple operation cycles. The computational results show that the two-phase tabu search algorithm can find better solutions than GA + MNN methods especially for the large-sized problems. In addition, it reveals that the construction heuristic can also significantly improve the quality of the solution for the situation of performing multiple operation cycles.", "paper_title": "An integrated optimization of location assignment and storage/retrieval scheduling in multi-shuttle automated storage/retrieval systems", "paper_id": "WOS:000365013800008"}