{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "fall_risk"}, {"score": 0.049581014501477026, "phrase": "tug_test"}, {"score": 0.030696647772077076, "phrase": "time_parameters"}, {"score": 0.004522080178250592, "phrase": "wearable_inertial_sensor"}, {"score": 0.0037066895459425824, "phrase": "subject's_waist"}, {"score": 0.0026096659285441384, "phrase": "rms_value"}, {"score": 0.0025824576209656676, "phrase": "angular_velocity_parameters"}, {"score": 0.0025555322596460036, "phrase": "sit-stand_phase"}, {"score": 0.00252916956537518, "phrase": "rms"}, {"score": 0.0023997601127552256, "phrase": "angular_velocity_signal"}, {"score": 0.002253461585851626, "phrase": "improved_method"}, {"score": 0.0021049977753042253, "phrase": "elderly_quality"}], "paper_keywords": ["Timed Up and Go", " wearable inertial sensor", " gait", " falls"], "paper_abstract": "We examined falling risk among elderly using a wearable inertial sensor, which combines accelerometer and gyrosensors devices, applied during the Timed Up and Go (TUG) test. Subjects were categorised into two groups as low fall risk and high fall risk with 13.5s duration taken to complete the TUG test as the threshold between them. One sensor was attached at the subject's waist dorsally, while acceleration and gyrosensor signals in three directions were extracted during the test. The analysis was carried out in phases: sit-bend, bend-stand, walking, turning, stand-bend and bend-sit. Comparisons between the two groups showed that time parameters along with root mean square (RMS) value, amplitude and other parameters could reveal the activities in each phase. Classification using RMS value of angular velocity parameters for sit-stand phase, RMS value of acceleration for walking phase and amplitude of angular velocity signal for turning phase along with time parameters suggests that this is an improved method in evaluating fall risk, which promises benefits in terms of improvement of elderly quality of life.", "paper_title": "Quantitative analysis of fall risk using TUG test", "paper_id": "WOS:000343708500009"}