{"auto_keywords": [{"score": 0.038026867966685585, "phrase": "oddad"}, {"score": 0.02819827616624647, "phrase": "autonomous_robots"}, {"score": 0.004212157020917929, "phrase": "varied_sorts"}, {"score": 0.004073590964805314, "phrase": "contextual_faults"}, {"score": 0.0038465304237380125, "phrase": "anomaly_detection"}, {"score": 0.0036494864560524735, "phrase": "online_data-driven_anomaly_detection_approach"}, {"score": 0.003429544382524185, "phrase": "dynamic_nature"}, {"score": 0.0026742419973883134, "phrase": "calculated_threshold"}, {"score": 0.002524982927936405, "phrase": "different_domains"}, {"score": 0.0023954743066925714, "phrase": "vacuum-cleaning_robot"}, {"score": 0.0023613185213421173, "phrase": "high-fidelity_flight_simulator"}, {"score": 0.002327648608736437, "phrase": "electrical_power_system"}], "paper_keywords": ["Anomaly detection", " Robotics", " UAV", " UGV", " Unmanned vehicles", " Autonomous agents", " Unsupervised", " Model free", " Online", " Data driven", " ODDAD", " AI", " Fault detection"], "paper_abstract": "The use of autonomous robots is appealing for tasks, which are dangerous to humans. Autonomous robots might fail to perform their tasks since they are susceptible to varied sorts of faults such as point and contextual faults. Not all faults can be known in advance, and hence, anomaly detection is required. In this paper, we present an online data-driven anomaly detection approach (ODDAD) for autonomous robots. ODDAD is suitable for the dynamic nature of autonomous robots since it declares a fault based only on data collected online. In addition, it is unsupervised, model free and domain independent. ODDAD proceeds in three steps: data filtering, attributes grouping based on dependency between attributes and outliers detection for each group. Above a calculated threshold, an anomaly is declared. We empirically evaluate ODDAD in different domains: commercial unmanned aerial vehicles (UAVs), a vacuum-cleaning robot, a high-fidelity flight simulator and an electrical power system of a spacecraft. We show the significance and impact of each component of ODDAD . By comparing ODDAD to other state-of-the-art competing anomaly detection algorithms, we show its advantages.", "paper_title": "Online data-driven anomaly detection in autonomous robots", "paper_id": "WOS:000354197500007"}