{"auto_keywords": [{"score": 0.04979001683121731, "phrase": "link_networks"}, {"score": 0.04122867178568476, "phrase": "greener_living"}, {"score": 0.00481495049065317, "phrase": "online_issue"}, {"score": 0.004757017456572827, "phrase": "personal_green_living_blogs"}, {"score": 0.0044237033788643715, "phrase": "personal_greener_living_blogs"}, {"score": 0.004227297479492541, "phrase": "green_living_blogs"}, {"score": 0.004039576329942698, "phrase": "thematic_areas"}, {"score": 0.003802135020791801, "phrase": "co-link_analysis"}, {"score": 0.0037223583464229097, "phrase": "issuecrawler_tool"}, {"score": 0.003644249428737351, "phrase": "qualitative_textual_analysis"}, {"score": 0.0036222340564869625, "phrase": "central_personal_green_living_blogs"}, {"score": 0.003578600071301459, "phrase": "resulting_networks"}, {"score": 0.003524793389371463, "phrase": "resulting_network"}, {"score": 0.003492897128445075, "phrase": "issue_space"}, {"score": 0.003388639163205525, "phrase": "green_living"}, {"score": 0.0030291453183733897, "phrase": "mainly_personal_blogs_functions"}, {"score": 0.002983575324622826, "phrase": "different_notions"}, {"score": 0.0029032649701963014, "phrase": "problem_focus"}, {"score": 0.0028509258879069006, "phrase": "outwards_orientation"}, {"score": 0.0027995277077618604, "phrase": "empirical_material"}, {"score": 0.0027490536097875685, "phrase": "swedish_language_blogs"}, {"score": 0.002405618568415162, "phrase": "environmentally_friendly_living"}, {"score": 0.002229915931723092, "phrase": "environmental_information"}, {"score": 0.002196342933346204, "phrase": "important_and_topical_yet_under-researched_area"}, {"score": 0.0021567204376536503, "phrase": "issuecrawler"}, {"score": 0.002117811223107415, "phrase": "concrete_empirical_study"}, {"score": 0.0021049977753042253, "phrase": "information_studies"}], "paper_keywords": ["Blogs", " Mixed methods", " Environmental information", " IssueCrawler"], "paper_abstract": "Purpose - This paper aims to explore the construction and configuration of environmentally friendly living through making visible the link networks that surround personal greener living blogs. The following questions guide the exploration: which types of organisations/actors structure the issue network of green living blogs as it emerges through links? How do these links contribute to carving out thematic areas as particularly influential for the construction of what greener living is seen to mean? Design/methodology/approach - Mixed method, a link and co-link analysis of 46 personal blogs carried out with the IssueCrawler tool, is backed up by a qualitative textual analysis of central personal green living blogs to contextualise the resulting networks. Findings - The resulting network shows an issue space that is divided in two halves: one half where green living is largely an issue of relating outwards (e.g. by broaching consumption) and another half which is inwards oriented (e.g. beauty products, personal well-being). A large integrative centre of mainly personal blogs functions as a hub for different notions of greener living, structured around pleasure vs a problem focus, and along inwards vs outwards orientation. Research limitations/implications - The empirical material consists of a sample of Swedish language blogs, which has implications for the outcome of the study. Practical implications - The study intends to contribute to laying the ground for developing adequately targeted and multi-faceted (online) information campaigns to inform about environmentally friendly living. Originality/value - The results can contribute to expand understanding of environmentally friendly living as it is represented online and thereby add value to comprehend and target parts of society. This paper contributes to the area of environmental information, which is an important and topical yet under-researched area in information studies. The IssueCrawler tool is used in a concrete empirical study in information studies.", "paper_title": "Taking the environment online Issue and link networks surrounding personal green living blogs", "paper_id": "WOS:000333794700005"}