{"auto_keywords": [{"score": 0.004815014135915316, "phrase": "reliable"}, {"score": 0.004357245559948974, "phrase": "wide_area_networks"}, {"score": 0.0037848978618663684, "phrase": "unpredictable_behavior"}, {"score": 0.0033175095965171674, "phrase": "business_intelligence"}, {"score": 0.003287482882222731, "phrase": "critical_infrastructures"}, {"score": 0.0032429499567088113, "phrase": "financial_services"}, {"score": 0.0032135959043774085, "phrase": "delivery_guarantees"}, {"score": 0.0031845067058084583, "phrase": "strict_temporal_deadlines"}, {"score": 0.002778385486855157, "phrase": "missing_packets"}, {"score": 0.0027282915297520624, "phrase": "incomplete_information"}, {"score": 0.002468450551616404, "phrase": "analytical_model"}, {"score": 0.002423931101340771, "phrase": "information_recovery_capabilities"}, {"score": 0.0023694065215394593, "phrase": "simulation-based_study"}, {"score": 0.002305589818994465, "phrase": "real_workload"}, {"score": 0.002213065910356615, "phrase": "proposed_solution"}, {"score": 0.0021632743048552536, "phrase": "reliable_event_notification"}, {"score": 0.0021049977753042253, "phrase": "reasonable_bounded_time_window"}], "paper_keywords": ["Gossip", " network coding", " publish/subscribe", " reliability", " timeliness"], "paper_abstract": "The publish/subscribe paradigm is gaining attention for the development of several applications in wide area networks (WANs) due to its intrinsic time, space, and synchronization decoupling properties that meet the scalability and asynchrony requirements of those applications. However, while the communication in a WAN may be affected by the unpredictable behavior of the network, with messages that can be dropped or delayed, existing publish/subscribe solutions pay just a little attention to addressing these issues. On the contrary, applications such as business intelligence, critical infrastructures, and financial services require delivery guarantees with strict temporal deadlines. In this paper, we propose a framework that enforces both reliability and timeliness for publish/subscribe services over WAN. Specifically, we combine two different approaches: gossiping, to retrieve missing packets in case of incomplete information, and network coding, to reduce the number of retransmissions and, consequently, the latency. We provide an analytical model that describes the information recovery capabilities of our algorithm and a simulation-based study, taking into account a real workload from the Air Traffic Control domain, which evidences how the proposed solution is able to ensure reliable event notification over a WAN within a reasonable bounded time window.", "paper_title": "Reliable and Timely Event Notification for Publish/Subscribe Services Over the Internet", "paper_id": "WOS:000331966900018"}