{"auto_keywords": [{"score": 0.04942981937458461, "phrase": "wireless_networks"}, {"score": 0.00481495049065317, "phrase": "huge_popularity"}, {"score": 0.004685224205630963, "phrase": "future_designs"}, {"score": 0.004497129150551236, "phrase": "provided_capacity"}, {"score": 0.003663645143713398, "phrase": "optimal_wireless_networks"}, {"score": 0.0035892794633115227, "phrase": "contradicting_demands"}, {"score": 0.003173636240475185, "phrase": "genetic_algorithm"}, {"score": 0.0031091858573262265, "phrase": "quasi-particle_swarm"}, {"score": 0.0029436264166293317, "phrase": "novel_hybrid_algorithm"}, {"score": 0.0028446460307503343, "phrase": "indoor_wireless_network_planning_solutions"}, {"score": 0.002532284627202572, "phrase": "heuristic_network_planner"}, {"score": 0.002497862210672172, "phrase": "composite_differential_evolution_algorithm"}, {"score": 0.0021049977753042253, "phrase": "user-defined_capacity"}], "paper_keywords": ["Indoor wireless network planning", " Optimization algorithm", " WiFi (IEEE 802.11n)", " Coverage", " Power consumption", " Exposure"], "paper_abstract": "Due to the huge popularity of wireless networks, future designs will not only consider the provided capacity, but also the induced exposure, the corresponding power consumption, and the economic cost. As these requirements are contradictory, it is not straightforward to design optimal wireless networks. Those contradicting demands have to satisfy certain requirements in practice. In this paper, a combination of two algorithms, a genetic algorithm and a quasi-particle swarm optimization, is developed, yielding a novel hybrid algorithm that generates further optimizations of indoor wireless network planning solutions, which is named hybrid indoor genetic optimization algorithm. The algorithm is compared with a heuristic network planner and composite differential evolution algorithm for three scenarios and two different environments. Results show that our hybrid-algorithm is effective for optimization of wireless networks which satisfy four demands: maximum coverage for a user-defined capacity, minimum power consumption, minimal cost, and minimal human exposure.", "paper_title": "Multi-objective network planning optimization algorithm: human exposure, power consumption, cost, and capacity", "paper_id": "WOS:000351670000010"}