{"auto_keywords": [{"score": 0.029684859955805155, "phrase": "randomization_method"}, {"score": 0.00481495049065317, "phrase": "service-level-approximation_methods"}, {"score": 0.004641351004344458, "phrase": "exhaustive_discipline"}, {"score": 0.004494570360108983, "phrase": "seven_methods"}, {"score": 0.00327356326590461, "phrase": "exhaustive_service_discipline"}, {"score": 0.002711109302199029, "phrase": "exact_method"}, {"score": 0.0026011706232569316, "phrase": "closure_approximation"}, {"score": 0.002224510044064184, "phrase": "computation_times"}], "paper_keywords": ["queues, nonstationary", " queues, algorithms", " queues, approximations"], "paper_abstract": "We compare the performance of seven methods in computing or approximating service levels for nonstationary M(t)/M/s(t) queueing systems: an exact method (a Runge-Kutta ordinary-differential-equation solver), the randomization method, a closure (or surrogate-distribution) approximation, a direct infinite-server approximation, a modified-offered-load infinite-server approximation, an effective-arrival-rate approximation, and a lagged stationary approximation. We assume an exhaustive service discipline, where service in progress when a server is scheduled to leave is completed before the server leaves. We used all of the methods to solve the same set of 640 test problems. The randomization method was almost as accurate as the exact method and used about half the computational time. The closure approximation was less accurate, and usually slower, than the randomization method. The two infinite-server-based approximations, the effective-arrival-rate approximation, and the lagged stationary approximation were less accurate but had computation times that were far shorter and less problem-dependent than the other three methods.", "paper_title": "A survey and experimental comparison of service-level-approximation methods for nonstationary M(t)/M/s(t) queueing systems with exhaustive discipline", "paper_id": "WOS:000248670900006"}