{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "gene_prioritization_tools"}, {"score": 0.004454377387615279, "phrase": "large_pool"}, {"score": 0.0041703614123283165, "phrase": "biological_relevance"}, {"score": 0.0035687137873965684, "phrase": "freely_available_web_tools"}, {"score": 0.0033409791799749434, "phrase": "predictive_performance"}, {"score": 0.0033011569787033297, "phrase": "eight_publicly_available_prioritization_tools"}, {"score": 0.0028758391869611374, "phrase": "underlying_databases"}, {"score": 0.002741091312632307, "phrase": "retrospective_data"}, {"score": 0.002708399936381754, "phrase": "performance_estimate"}, {"score": 0.0025660347613972573, "phrase": "data_sources"}, {"score": 0.00247529638625566, "phrase": "disease-gene_association"}, {"score": 0.002387758958649797, "phrase": "novel_discovery"}], "paper_keywords": [""], "paper_abstract": "Motivation: Gene prioritization aims at identifying the most promising candidate genes among a large pool of candidates-so as to maximize the yield and biological relevance of further downstream validation experiments and functional studies. During the past few years, several gene prioritization tools have been defined, and some of them have been implemented and made available through freely available web tools. In this study, we aim at comparing the predictive performance of eight publicly available prioritization tools on novel data. We have performed an analysis in which 42 recently reported disease-gene associations from literature are used to benchmark these tools before the underlying databases are updated. Results: Cross-validation on retrospective data provides performance estimate likely to be overoptimistic because some of the data sources are contaminated with knowledge from disease-gene association. Our approach mimics a novel discovery more closely and thus provides more realistic performance estimates. There are, however, marked differences, and tools that rely on more advanced data integration schemes appear more powerful.", "paper_title": "An unbiased evaluation of gene prioritization tools", "paper_id": "WOS:000311902700010"}