{"auto_keywords": [{"score": 0.04937491786272553, "phrase": "social_innovation"}, {"score": 0.00481495049065317, "phrase": "designing_technologies"}, {"score": 0.0046570462031865385, "phrase": "technological_revolutions"}, {"score": 0.004622662375029505, "phrase": "cultural_transformations"}, {"score": 0.004260719592945006, "phrase": "manuel_castells"}, {"score": 0.004045230861702083, "phrase": "social_problems"}, {"score": 0.0036870776660851007, "phrase": "digital_components"}, {"score": 0.003461758868675955, "phrase": "computer_screen"}, {"score": 0.003410768840300913, "phrase": "physical_objects"}, {"score": 0.0031786037839399055, "phrase": "technological_innovation"}, {"score": 0.0026109540617641593, "phrase": "interaction_design"}, {"score": 0.002553431170229379, "phrase": "social_practices"}, {"score": 0.002469508424323385, "phrase": "new_possibilities"}, {"score": 0.0024330980793680337, "phrase": "new_activities"}, {"score": 0.0022009497295481678, "phrase": "meaningful_context"}, {"score": 0.0021365087453258263, "phrase": "socio-cultural_issues"}, {"score": 0.0021049977753042253, "phrase": "interactive_installations"}], "paper_keywords": ["co-learning", " learning by building", " reflective practice", " social innovation", " craftmanship", " design"], "paper_abstract": "There are no technological revolutions without cultural transformations. This is a quote from the book \"The Internet Galaxy: Reflections on the Internet, Business, and Society\" by Manuel Castells (2003), in which the author explores the complexity of the social problems generated by the spread of the Internet. Nowadays the Internet is no longer simply a means for connecting people through computers. The digital components of the network have materialized in things. Information has ceased to travel exclusively on the computer screen and moved onto physical objects, now able to talk to each other and with the environment. The challenge is that this technological innovation will become a social innovation, and that individuals, society, institutions and companies will appropriate it, modifying it, transforming it, and experimenting with it. This paper is a reflection on the role of technology in supporting social innovation. We will approach this topic from the perspective of interaction design, a discipline that studies social practices connected with use of technologies, and imagines new possibilities as well as new activities enabled by them. The reflection will develop by presenting the outcomes of Light through Culture, an international educational project that aims to create a meaningful context for learning in which students reflect on socio-cultural issues together by building interactive installations.", "paper_title": "Pervasive, disruptive, seductive, enabling: Designing technologies for learning and social innovation", "paper_id": "WOS:000374584800002"}