{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "unknown_environments"}, {"score": 0.047492774447183556, "phrase": "psychological_constructs"}, {"score": 0.034458976662058216, "phrase": "classical_strategy"}, {"score": 0.034070716898264214, "phrase": "surprise-curiosity-based_one"}, {"score": 0.03032705460032273, "phrase": "different_entities"}, {"score": 0.0047313464483758364, "phrase": "surprise-curiosity-based_agent"}, {"score": 0.004662781189062896, "phrase": "belief-desire-intention-like_architecture"}, {"score": 0.004462963308428707, "phrase": "important_role"}, {"score": 0.004209739667710983, "phrase": "previous_studies"}, {"score": 0.00413660047956989, "phrase": "exploratory_behaviour"}, {"score": 0.004017503356693001, "phrase": "basic_desires"}, {"score": 0.003994096941698692, "phrase": "maximal_information_gain"}, {"score": 0.003913238988370179, "phrase": "maximal_surprise"}, {"score": 0.00384523125280454, "phrase": "berlyne's_theory"}, {"score": 0.0036803189470937235, "phrase": "known_drives"}, {"score": 0.00361634440637273, "phrase": "basic_desire"}, {"score": 0.0035952667506642033, "phrase": "minimal_hunger"}, {"score": 0.00356387956365613, "phrase": "representative_example"}, {"score": 0.0035327654197058345, "phrase": "additional_basic_desires"}, {"score": 0.0034612143745796705, "phrase": "surprise-curiosity-based_exploration_strategy"}, {"score": 0.0034109924073788215, "phrase": "\"cold\"_classical_exploration_strategy"}, {"score": 0.003179854375044433, "phrase": "exploration_performance_measures"}, {"score": 0.0026293100787580116, "phrase": "valuable_result"}, {"score": 0.0024083533974377, "phrase": "agents'_behaviour"}, {"score": 0.002380327476198495, "phrase": "traversing_paths"}, {"score": 0.00227809753597453, "phrase": "surprise-curiosity-based_approach"}, {"score": 0.0021994769642365714, "phrase": "different_complexity"}, {"score": 0.0021802485562376047, "phrase": "different_amplitudes"}, {"score": 0.00216118788395907, "phrase": "visual_field"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b._v."}], "paper_keywords": ["Exploration of unknown environments", " Surprise", " Curiosity", " Motivational agents", " Belief-Desire-Intention agents"], "paper_abstract": "We describe a Belief-Desire-Intention-like architecture for an explorer agent in which the psychological constructs of surprise and curiosity play an important role in decision-making, particularly in the selection of view-points during the process of exploring unknown environments. Taking into account previous studies about the psychological constructs involved in exploratory behaviour, the agent is equipped in advance with the basic desires for maximal information gain (reduce curiosity), and maximal surprise. However, to reflect Berlyne's theory that says that the tendency to explore the environment occurs in the absence of known drives, we considered also the basic desire for minimal hunger as a representative example of those additional basic desires that can restrain exploration. This surprise-curiosity-based exploration strategy was confronted with a \"cold\" classical exploration strategy in environments populated with entities. The results of this experiment indicate that the classical strategy outperforms slightly the surprise-curiosity-based one with respect to the exploration performance measures of the time/energy required to explore all the environment completely, and the time/energy required to explore all the entities. However, the classical strategy was outperformed by the surprise-curiosity-based one with respect to the time/energy required to explore all different entities, and consequently, with more evidence, with respect to the number of steps (trips between two entities) required to explore all different entities. This is a valuable result for resource-bounded, active learning agents that benefit from choosing the more informative data from which they learn while ignoring time-consuming/expensive, redundant data. This important result is confirmed by the results of the analysis of the agents' behaviour exhibited along the traversing paths in the environment. The experiment also provided results concerning the robustness of the surprise-curiosity-based approach by assessing the influence of surprise and curiosity in several environments of different complexity and with different amplitudes for the visual field of the agent. (C) 2012 Elsevier B. V. All rights reserved.", "paper_title": "The exploration of unknown environments populated with entities by a surprise-curiosity-based agent", "paper_id": "WOS:000305336500004"}