{"auto_keywords": [{"score": 0.046325457002697176, "phrase": "data_collection"}, {"score": 0.00481495049065317, "phrase": "asynchronous_infrastructure"}, {"score": 0.0043109516986405095, "phrase": "adolescence"}, {"score": 0.003792657064634775, "phrase": "collected_data"}, {"score": 0.003726967166630923, "phrase": "revision_control_system"}, {"score": 0.0034956560177000656, "phrase": "longitudinal_database"}, {"score": 0.0033170847930578473, "phrase": "script-controlled_web_browser"}, {"score": 0.0029867619862229853, "phrase": "particular_benefit"}, {"score": 0.002867348342846275, "phrase": "consortium_sites"}, {"score": 0.0027687904688616983, "phrase": "receiving_database_infrastructure"}, {"score": 0.002507511169156787, "phrase": "collected_instruments"}, {"score": 0.0024784363584530976, "phrase": "final_instruments"}, {"score": 0.002351705899181029, "phrase": "instrument_selection"}, {"score": 0.002142161017595363, "phrase": "n-canda's_data_collection_system"}, {"score": 0.0021049977753042253, "phrase": "project_start-up_time"}], "paper_keywords": [""], "paper_abstract": "The infrastructure for data collection implemented by the National Consortium on Alcohol and NeuroDevelopment in Adolescence (N-CANDA) for data collection comprises several innovative features: (a) secure, asynchronous transfer and persistent storage of collected data via a revision control system; (b) two-stage import into a longitudinal database; and (c) use of a script-controlled web browser for data retrieval from a third-party, web-based neuropsychological test battery. The asynchronous operation of data transmission and import is of particular benefit, as it has allowed the consortium sites to begin data collection before the receiving database infrastructure had been deployed. Records were collected within 86 days of funding, 35 days after finalizing the collected instruments. Final instruments were added to the database import 225 days after instrument selection, with up to 173 records already collected at that time. Thus, the concepts implemented in N-CANDA's data collection system helped reduce project start-up time by several months.", "paper_title": "N-CANDA data integration: anatomy of an asynchronous infrastructure for multi-site, multi-instrument longitudinal data capture", "paper_id": "WOS:000337660600034"}