{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "attribute_space"}, {"score": 0.004785466029391189, "phrase": "transfer_function_exploration"}, {"score": 0.004698086429418318, "phrase": "user_centered_transfer_function_design"}, {"score": 0.003765575242370161, "phrase": "multivariate_data"}, {"score": 0.0036291762280629115, "phrase": "attribute_space_visualization"}, {"score": 0.0033709718729037943, "phrase": "information_metric"}, {"score": 0.00328903890761552, "phrase": "multivariate_volumetric_data"}, {"score": 0.003121462741365354, "phrase": "attribute_magnitude"}, {"score": 0.0028726347068397887, "phrase": "traditional_histogram_widget"}, {"score": 0.002846238033172098, "phrase": "abstract_attribute_space_representation"}, {"score": 0.0028027799842681826, "phrase": "common_one_and_two-dimensional_histogram_widgets"}, {"score": 0.0027515028939691186, "phrase": "abstract_attribute_space"}, {"score": 0.002709487386923251, "phrase": "attribute_relationship"}, {"score": 0.0026517384677659027, "phrase": "standard_deviation"}, {"score": 0.0024934179092125277, "phrase": "underlying_data"}, {"score": 0.002287485527155396, "phrase": "automatic_extraction_schemes"}, {"score": 0.0022387107945750044, "phrase": "distinct_attributes"}, {"score": 0.0021508655858525683, "phrase": "knowledge_discovery"}, {"score": 0.0021049977753042253, "phrase": "volumetric_data"}], "paper_keywords": ["Transfer function design", " volume rendering", " information theory"], "paper_abstract": "Currently, user centered transfer function design begins with the user interacting with a one or two-dimensional histogram of the volumetric attribute space. The attribute space is visualized as a function of the number of voxels, allowing the user to explore the data in terms of the attribute size/magnitude. However, such visualizations provide the user with no information on the relationship between various attribute spaces (e.g., density, temperature, pressure, x, y, z) within the multivariate data. In this work, we propose a modification to the attribute space visualization in which the user is no longer presented with the magnitude of the attribute; instead, the user is presented with an information metric detailing the relationship between attributes of the multivariate volumetric data. In this way, the user can guide their exploration based on the relationship between the attribute magnitude and user selected attribute information as opposed to being constrained by only visualizing the magnitude of the attribute. We refer to this modification to the traditional histogram widget as an abstract attribute space representation. Our system utilizes common one and two-dimensional histogram widgets where the bins of the abstract attribute space now correspond to an attribute relationship in terms of the mean, standard deviation, entropy, or skewness. In this manner, we exploit the relationships and correlations present in the underlying data with respect to the dimension(s) under examination. These relationships are often times key to insight and allow us to guide attribute discovery as opposed to automatic extraction schemes which try to calculate and extract distinct attributes a priori. In this way, our system aids in the knowledge discovery of the interaction of properties within volumetric data.", "paper_title": "Abstracting Attribute Space for Transfer Function Exploration and Design", "paper_id": "WOS:000311124600009"}