{"auto_keywords": [{"score": 0.03801964087844912, "phrase": "dppc"}, {"score": 0.008578138293635783, "phrase": "cpu_cores"}, {"score": 0.00481495049065317, "phrase": "dynamic_power_partitioning_and_control"}, {"score": 0.004768378525561471, "phrase": "improved_chip_multiprocessor_performance"}, {"score": 0.0046993598473345395, "phrase": "key_challenge"}, {"score": 0.004653900688892822, "phrase": "chip_multiprocessor"}, {"score": 0.004390192910013225, "phrase": "power_budget"}, {"score": 0.003925633992809873, "phrase": "power_consumption"}, {"score": 0.003310951184365485, "phrase": "chip-level_power_budget"}, {"score": 0.003200045185608395, "phrase": "shared_last-level_cache"}, {"score": 0.003092842645798083, "phrase": "workload_characteristics"}, {"score": 0.002989220655735981, "phrase": "novel_performance-power_model"}, {"score": 0.0029458777184930896, "phrase": "online_model_estimator"}, {"score": 0.002545468362709126, "phrase": "optimized_cmp_performance"}, {"score": 0.0025085435314540837, "phrase": "partitioned_local_power_budgets"}, {"score": 0.002389276641014013, "phrase": "power_control_algorithms"}, {"score": 0.002331781764406665, "phrase": "feedback_control_theory"}, {"score": 0.0022536005664642294, "phrase": "better_cmp_performance"}, {"score": 0.0021464351721229287, "phrase": "spec"}], "paper_keywords": [""], "paper_abstract": "A key challenge in chip multiprocessor (CMP) design is to optimize the performance within a power budget limited by the CMP's cooling, packaging, and power supply capacities. Most existing solutions rely solely on dynamic voltage and frequency scaling (DVFS) to adapt the power consumption of CPU cores, without coordinating with the last-level on-chip (e.g., L2) cache. This paper proposes DPPC, a chip-level power partitioning and control strategy that can dynamically and explicitly partition the chip-level power budget among different CPU cores and the shared last-level cache in a CMP based on the workload characteristics measured online. DPPC features a novel performance-power model and an online model estimator to quantitatively estimate the performance contributed by each core and the cache with their respective local power budgets. DPPC then re-partitions the chip-level power budget among them for optimized CMP performance. The partitioned local power budgets for the CPU cores and cache are precisely enforced by power control algorithms designed rigorously based on feedback control theory. Our extensive experimental results demonstrate that DPPC achieves better CMP performance, within a given power budget, than several state-of-the-art power control solutions for both SPEC CPU2006 benchmarks and multi-threaded SPLASH-2 workloads.", "paper_title": "DPPC: Dynamic Power Partitioning and Control for Improved Chip Multiprocessor Performance", "paper_id": "WOS:000338511000011"}