{"auto_keywords": [{"score": 0.04799266576255415, "phrase": "dilemmas"}, {"score": 0.005051126725438662, "phrase": "brigade"}, {"score": 0.004537401559396022, "phrase": "defective_decision_making"}, {"score": 0.004492717291734985, "phrase": "interface_problems"}, {"score": 0.004382913938427474, "phrase": "critical_factor"}, {"score": 0.0043183186953102805, "phrase": "suboptimal_performance"}, {"score": 0.004254671386496732, "phrase": "large-scale_digital_command_and_control_system"}, {"score": 0.004029187256595917, "phrase": "battlegroup_headquarters"}, {"score": 0.0035954555250614197, "phrase": "interface_problem"}, {"score": 0.002993231973906559, "phrase": "highly_simplistic_comms"}, {"score": 0.002737745536992088, "phrase": "significant_value"}, {"score": 0.002516457934208144, "phrase": "current_analysis"}, {"score": 0.00240662380079115, "phrase": "considerable_amount"}, {"score": 0.002301572462091142, "phrase": "take-away_message"}, {"score": 0.0021902063413831545, "phrase": "raw_data"}, {"score": 0.0021049977753042253, "phrase": "successful_naturalistic_decision_making"}], "paper_keywords": [""], "paper_abstract": "Interface problems have been cited as critical factor in the suboptimal performance of a large-scale digital command and control system. A live field study involving fully functioning Brigade and Battlegroup headquarters was observed. More than 3,000 communications events were extracted and analyzed in terms of their quantity, direction, and content. The effect of the interface problem was pronounced. Voice mediated communications (conducted by radio and avoiding the interface entirely) were superior at converting odatao into oinformation.o In cases where the interface was relied upon, users seized on a highly simplistic comms. facility and put it to use in ways that were not anticipated. The findings added significant value in terms of the phased, real-world delivery of this system. Very little human factors analysis had been performed previously. The current analysis, therefore, was able to provide a considerable amount of insight and justification for further design iterations. The take-away message: Neither networked technology nor the large quantities of raw data carried by it are sufficient to guarantee successful naturalistic decision making.", "paper_title": "From the 6 Ps of Planning to the 4 Ds of Digitization: Difficulties, Dilemmas, and Defective Decision Making", "paper_id": "WOS:000275222600006"}