{"auto_keywords": [{"score": 0.00860160068836442, "phrase": "sender-phase_algorithm"}, {"score": 0.007884542572603303, "phrase": "forwarding_nodes"}, {"score": 0.006528051077460211, "phrase": "liu_et_al"}, {"score": 0.006457283904243687, "phrase": "khabbazian_et_al"}, {"score": 0.005287010558754543, "phrase": "broadcasting_nodes"}, {"score": 0.004780030485538593, "phrase": "mobile_ad_hoc_networks"}, {"score": 0.00454254773622547, "phrase": "different_sender-based_and_receiver-based_flooding_algorithms"}, {"score": 0.004316812490871324, "phrase": "sender-based_and_receiver-based_flooding_algorithms"}, {"score": 0.003704467870496114, "phrase": "flooding_message"}, {"score": 0.0036375920152538783, "phrase": "convex-hull_concept"}, {"score": 0.003533083861130305, "phrase": "highest_contribution"}, {"score": 0.0034946693480479712, "phrase": "message_dissemination"}, {"score": 0.0034066464009965425, "phrase": "receiver-phase_algorithm"}, {"score": 0.003296713221268488, "phrase": "full_delivery"}, {"score": 0.0028493650087584774, "phrase": "local_optimal_problem"}, {"score": 0.0028183634079717136, "phrase": "sender-based_flooding_algorithms"}, {"score": 0.0027674397462322435, "phrase": "full_delivery_requirement"}, {"score": 0.0024625698287060586, "phrase": "simulation_results"}, {"score": 0.0024092539025697014, "phrase": "lower_ratio"}, {"score": 0.0023657047082774286, "phrase": "higher_message_delivery_ratio"}, {"score": 0.002280948283235427, "phrase": "lower_ratios"}, {"score": 0.0021752783872387173, "phrase": "message_disseminations"}, {"score": 0.0021359494324422997, "phrase": "smaller_effect"}, {"score": 0.0021049977753042253, "phrase": "different_message_types"}], "paper_keywords": ["Broadcasting", " Convex hull", " Flooding", " Mobile ad hoc networks", " Wireless networks"], "paper_abstract": "Flooding is one of the most essential and commonly used operations in mobile ad hoc networks. Different sender-based and receiver-based flooding algorithms have been presented separately in the literature. To integrate the advantages of sender-based and receiver-based flooding algorithms, this paper proposes a novel joint 1-hop neighbor information-based flooding scheme that consists of two sub-algorithms: the sender-phase algorithm and the receiver-phase algorithm. The sender-phase algorithm of our flooding scheme helps a node select a subset of its 1-hop neighbors to forward the flooding message. Based on the convex-hull concept, this algorithm selects forwarding nodes with the highest contribution to flooding message dissemination. On the other hand, the receiver-phase algorithm complements the sender-phase algorithm, allowing our flooding scheme to guarantee full delivery. We prove that our flooding scheme requires lower time complexity O(n log h), where h is the number of forwarding nodes, than the best known 1-hop neighbor information-based flooding algorithms proposed by Liu et al. and Khabbazian et al. Additionally, to alleviate the local optimal problem caused by sender-based flooding algorithms, we relax the full delivery requirement and modify our flooding scheme to discard more redundant rebroadcasting operations. Simulation experiments are conducted to compare the performance of our flooding schemes with those of Liu et al.'s and Khabbazian et al.'s flooding algorithms. The simulation results show that our flooding schemes accomplish a lower ratio of broadcasting nodes and a higher message delivery ratio simultaneously under various network conditions. Moreover, since our flooding schemes have lower ratios of broadcasting nodes, they incur fewer packet collisions on the network. Consequently, message disseminations applying our flooding schemes have a smaller effect on other transmissions of different message types.", "paper_title": "A novel convex hull-based flooding scheme using 1-hop neighbor information for mobile ad hoc networks", "paper_id": "WOS:000295684000010"}