{"auto_keywords": [{"score": 0.04796789568919047, "phrase": "relevant_prior_knowledge"}, {"score": 0.014507172195254103, "phrase": "learning_materials"}, {"score": 0.012352026742292983, "phrase": "students'_prior_knowledge"}, {"score": 0.010204190181420186, "phrase": "prior_knowledge"}, {"score": 0.010143392881893329, "phrase": "new_instruction"}, {"score": 0.00958341135555318, "phrase": "interdisciplinary_course"}, {"score": 0.00481495049065317, "phrase": "diagnostic_system"}, {"score": 0.004771750408749566, "phrase": "testing-based_approach"}, {"score": 0.0047289360793096044, "phrase": "student_prior_knowledge"}, {"score": 0.004672444473700524, "phrase": "new_instructions"}, {"score": 0.004334280585565239, "phrase": "good_prior_knowledge"}, {"score": 0.004256816146106783, "phrase": "better_learning_motivation"}, {"score": 0.003729335910488339, "phrase": "conventional_testing_approaches"}, {"score": 0.0034178160236983226, "phrase": "test_results"}, {"score": 0.003286722111554471, "phrase": "time-consuming_process"}, {"score": 0.0032085525502105836, "phrase": "testing-based_diagnosis_system"}, {"score": 0.0029492697575981422, "phrase": "proposed_approach"}, {"score": 0.002719055901632759, "phrase": "experimental_results"}, {"score": 0.002686509402739493, "phrase": "developed_system"}, {"score": 0.0023460767171603054, "phrase": "proposed_system"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Improving classroom teaching", " Interdisciplinary projects"], "paper_abstract": "Students learn new instructions well by building on relevant prior knowledge, as it affects how instructors and students interact with the learning materials. Moreover, studies have found that good prior knowledge can enable students to attain better learning motivation, comprehension, and performance. This suggests it is important to assist students in obtaining the relevant prior knowledge, as this can enable them to engage meaningfully with the learning materials. Tests are often used to help instructors assess students' prior knowledge. Nevertheless, conventional testing approaches usually assign only a score to each student, and this may mean that students are unable to realize their own individual weaknesses. To address this problem, instructors can diagnose the test results to provide more detailed information to each student, but this is obviously a time-consuming process. Therefore, this study proposes a testing-based diagnosis system to assist instructors and students in diagnosing and strengthening prior knowledge before new instruction is undertaken. Furthermore, an experiment was conducted to evaluate the effectiveness of the proposed approach in an interdisciplinary course, since several studies have indicated that students learn more and better in such courses when applying relevant prior knowledge to what they are learning. The experimental results show that the developed system is able to effectively diagnose students' prior knowledge and enhance their learning motivation and performance on an interdisciplinary course. In addition, two diagnostic evaluations were also conducted to assess whether the diagnoses given by the system were consistent with the decisions of experts. The results demonstrate that the proposed system can effectively assist instructors and students in diagnosing and strengthening prior knowledge before new instruction is undertaken, since the diagnoses produced by the system were broadly consistent with those of experts. (C) 2011 Elsevier Ltd. All rights reserved.", "paper_title": "Development of a diagnostic system using a testing-based approach for strengthening student prior knowledge", "paper_id": "WOS:000292437400010"}