{"auto_keywords": [{"score": 0.03796095151175545, "phrase": "terrorist_activities"}, {"score": 0.00481495049065317, "phrase": "dark_web"}, {"score": 0.004381749459671914, "phrase": "worldwide_platform"}, {"score": 0.0037721073763702486, "phrase": "information_overload"}, {"score": 0.0036485497734171294, "phrase": "comprehensive_picture"}, {"score": 0.0035684266744407485, "phrase": "effective_and_efficient_analysis"}, {"score": 0.0032290277960438855, "phrase": "novel_methodology"}, {"score": 0.0031405975280029913, "phrase": "dark_web_information"}, {"score": 0.0030545815929619306, "phrase": "information_collection"}, {"score": 0.002970914475538276, "phrase": "visualization_techniques"}, {"score": 0.0025287979714720423, "phrase": "expert_evaluation"}, {"score": 0.0023525345110929326, "phrase": "high_potential"}, {"score": 0.0021049977753042253, "phrase": "intelligence_research"}], "paper_keywords": [""], "paper_abstract": "While the Web has become a worldwide platform for communication, terrorists share their ideology and communicate with members on the \"Dark Web\"-the reverse side of the Web used by terrorists. Currently, the problems of information overload and difficulty to obtain a comprehensive picture of terrorist activities hinder effective and efficient analysis of terrorist information on the Web. To improve understanding of terrorist activities, we have developed a novel methodology for collecting and analyzing Dark Web information. The methodology incorporates information collection, analysis, and visualization techniques, and exploits various Web information sources. We applied it to collecting and analyzing information of 39 Jihad Web sites and developed visualization of their site contents, relationships, and activity levels. An expert evaluation showed that the methodology is very useful and promising, having a high potential to assist in investigation and understanding of terrorist activities by producing results that could potentially help guide both policymaking and intelligence research.", "paper_title": "Uncovering the Dark Web: A case study of Jihad on the web", "paper_id": "WOS:000256179200015"}