{"auto_keywords": [{"score": 0.04819193630515393, "phrase": "complex_lighting_effects"}, {"score": 0.04183650826006184, "phrase": "surficial_and_volumetric_properties"}, {"score": 0.03200127480021282, "phrase": "transparent_objects"}, {"score": 0.00481495049065317, "phrase": "new_voxelization_algorithm"}, {"score": 0.004750873844061641, "phrase": "newly_available_gpu_functionalities"}, {"score": 0.004563691742821759, "phrase": "voxelization_result"}, {"score": 0.004502943680955863, "phrase": "voxelization_algorithm"}, {"score": 0.004403480614319231, "phrase": "highly_complex_scene"}, {"score": 0.004344855841195913, "phrase": "surface-boundary_representation"}, {"score": 0.004154995396099332, "phrase": "geometry_shader"}, {"score": 0.003601235776892337, "phrase": "strenuous_efforts"}, {"score": 0.0035216195857272403, "phrase": "encoding_and_decoding_scheme"}, {"score": 0.003459191419478298, "phrase": "voxel_resolution"}, {"score": 0.0031210475158175432, "phrase": "complex_occlusion"}, {"score": 0.002905454531687249, "phrase": "absorption_coefficient"}, {"score": 0.0025632898741546556, "phrase": "complex_objects"}, {"score": 0.002364865100579589, "phrase": "transmittance_lighting_effects"}, {"score": 0.0022013916728990564, "phrase": "dynamic_scene"}, {"score": 0.0021049977753042253, "phrase": "real_time"}], "paper_keywords": ["Voxelization", " Hardware voxelization", " Transparent shadow", " Volume ray-tracing"], "paper_abstract": "This work proposes a new voxelization algorithm based on newly available GPU functionalities and designs several real-time applications to render complex lighting effects with the voxelization result. The voxelization algorithm can efficiently transform a highly complex scene in a surface-boundary representation into a set of voxels in one GPU pass using the geometry shader. Newly available 3D textures are used to directly record the surficial and volumetric properties of objects such as opaqueness, refraction, and transmittance. In the first, the usage of 3D textures can remove those strenuous efforts required to modify the encoding and decoding scheme when adjusting the voxel resolution. Second, surficial and volumetric properties recorded in 3D textures can be used to interactively compute and render more realistic lighting effects including the shadow of objects with complex occlusion and the refraction and transmittance of transparent objects. The shadow can be rendered with an absorption coefficient which is computed according to the number of surfaces drawing in each voxel during voxelization and used to compute the amount of light passing through partially occluded complex objects. The surface normal, transmittance coefficient and refraction index recorded in each voxel can be used to simulate the refraction and transmittance lighting effects of transparent objects using our multiple-surfaced refraction algorithm. Finally, the results demonstrate that our algorithm can transform a dynamic scene into a set of voxels and render complex lighting effects in real time without any pre-processing.", "paper_title": "Geometry-shader-based real-time voxelization and applications", "paper_id": "WOS:000331693100007"}