{"auto_keywords": [{"score": 0.04981057254655336, "phrase": "minimum_general_randic_index"}, {"score": 0.0197333124108965, "phrase": "unique_minimum_unicyclic_graph"}, {"score": 0.010612387000973441, "phrase": "unicyclic_graphs"}, {"score": 0.007417399352947768, "phrase": "unique_unicyclic_graph"}, {"score": 0.007052426957442108, "phrase": "unicyclic_graph"}, {"score": 0.004747771713778112, "phrase": "general_randic_index"}, {"score": 0.0044630962990919775, "phrase": "vertex_u"}, {"score": 0.004266794077108026, "phrase": "arbitrary_real_number"}, {"score": 0.004242937430881755, "phrase": "wu"}, {"score": 0.004219194369332441, "phrase": "zhang"}, {"score": 0.003738502710504415, "phrase": "minimum_problem"}, {"score": 0.0036042491702884052, "phrase": "possible_minimum_unicyclic_graphs"}, {"score": 0.0027200305495826797, "phrase": "leaf_vertices"}, {"score": 0.002535115422089855, "phrase": "minimum_value"}], "paper_keywords": [""], "paper_abstract": "The general Randic index of a (molecular) graph G is defined by R-alpha (G) = Sigma(uv)(d(u)d(v))(alpha), where d(u) denotes the degree of a vertex u in G, uv runs over the edge set of G and alpha is an arbitrary real number. Wu and Zhang studied unicyclic graphs with minimum general Randic index. For alpha >= -1 they got the unique minimum unicyclic graph by distinguishing alpha into intervals alpha > 0 and -1 <= alpha < 0. But, unfortunately; for alpha < -1 they could not completely solve this minimum problem. At the end they figured out two classes g and R of possible minimum unicyclic graphs. In this paper, we completely solve. this problem by showing that for alpha < -1 and n >= 5, the unique unicyclic graph with minimum general Randic index is either S-n(+) or t*([n-3/2], [n-3/2]),where S-n(+) denotes the unicyclic graph obtained from the star S-n on n vertices by joining its two vertices of degree 1, whereas, t*([n-3/2], [n-3/2]) denotes the unicyclic graph that has a triangle as its unique cycle and the vertices not on the cycle are leaves that are adjacent to two vertices of the triangle Such that the numbers of leaf vertices on the two branches are almost equal. Furthermore, we observe that as a approaches to -1, if t*([n-3/2],[n-3/2]) has the minimum value then n must be considerably large, that is to sky, when a is near -1, it is almost sure that S-n(+) is the unique minimum unicyclic graph, whereas when a is at a distance from -1, it is almost sure that t*([n-3/2], [n-3/2]) is the unique minimum unicyclic graph. In particular, for alpha <= -2, for 5 <= n <= 41 and t*([n-3/2], [n-3/2]) for n >= 42, respectively, is the unique unicyclic graph with minimum general Randic index.", "paper_title": "Complete solution for unicyclic graphs with minimum general Randic index", "paper_id": "WOS:000239524700012"}