{"auto_keywords": [{"score": 0.04296486508114672, "phrase": "latent_function"}, {"score": 0.010612387000973441, "phrase": "em-ep_algorithm"}, {"score": 0.004763895422211728, "phrase": "gaussian_process_classifiers"}, {"score": 0.004638602678192715, "phrase": "bayesian_probabilistic_kernel_classifiers"}, {"score": 0.004304963945457799, "phrase": "input_location"}, {"score": 0.003931798194574009, "phrase": "gaussian_process"}, {"score": 0.003314591878914152, "phrase": "expectation_propagation"}, {"score": 0.0029159568444629053, "phrase": "approximate_em_algorithm"}, {"score": 0.002537880772794665, "phrase": "efficient_bayesian_framework"}, {"score": 0.002418742283474052, "phrase": "multiclass_extension"}, {"score": 0.0022685255265595624, "phrase": "experimental_results"}, {"score": 0.0022324489895237504, "phrase": "em-ep_algorithms"}, {"score": 0.0021049977753042253, "phrase": "support_vector_machines"}], "paper_keywords": ["Gaussian process classification", " Bayesian methods", " kernel methods", " expectation propagation", " EM-EP algorithm"], "paper_abstract": "Gaussian process classifiers (GPCs) are Bayesian probabilistic kernel classifiers. In GPCs, the probability of belonging to a certain class at an input location is monotonically related to the value of some latent function at that location. Starting from a Gaussian process prior over this latent function, data are used to infer both the posterior over the latent function and the values of hyperparameters to determine various aspects of the function. Recently, the expectation propagation (EP) approach has been proposed to infer the posterior over the latent function. Based on this work, we present an approximate EM algorithm, the EM-EP algorithm, to learn both the latent function and the hyperparameters. This algorithm is found to converge in practice and provides an efficient Bayesian framework for learning hyperparameters of the kernel. A multiclass extension of the EM-EP algorithm for GPCs is also derived. In the experimental results, the EM-EP algorithms are as good or better than other methods for GPCs or Support Vector Machines (SVMs) with cross-validation.", "paper_title": "Bayesian Gaussian process classification with the EM-EP algorithm", "paper_id": "WOS:000241195700005"}