{"auto_keywords": [{"score": 0.049613254104042076, "phrase": "land_use_allocation"}, {"score": 0.00481495049065317, "phrase": "uncertainty_awareness"}, {"score": 0.004652963867892925, "phrase": "future_agricultural_land_use_change_scenarios"}, {"score": 0.004302791070310513, "phrase": "long_term"}, {"score": 0.004178351419209898, "phrase": "land_managers"}, {"score": 0.0036079110889031874, "phrase": "lua_approach"}, {"score": 0.0034693659976716197, "phrase": "multi-criteria_decision"}, {"score": 0.003319830633865628, "phrase": "spatial_mcdm_modeling_approach"}, {"score": 0.0030847461428168614, "phrase": "decision_space"}, {"score": 0.002951739421935396, "phrase": "key_variables"}, {"score": 0.0027969169552386, "phrase": "lua_model_key_factors"}, {"score": 0.002511147699138714, "phrase": "potential_lua_outcomes"}, {"score": 0.0023677483882740317, "phrase": "increased_confidence"}, {"score": 0.0023104373174118458, "phrase": "key_factors"}, {"score": 0.002276717177453959, "phrase": "underlying_models"}, {"score": 0.002232519579957707, "phrase": "greater_awareness"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Spatial model steering", " Land use allocation", " Spatial decision support system", " Service oriented architecture", " Uncertainty awareness"], "paper_abstract": "One evidenced based approach for exploring future agricultural land use change scenarios is Land Use Allocation (LUA). This approach can be used to support medium to long term strategic planning. Specifically, land managers can consider a number of diverse environmental social, economic and physical factors, and explore land use allocation scenarios before choosing to produce one or more commodities in a given region. One of the most successful ways to implement a LUA approach is through the integration of geoprocessing with Multi-Criteria Decision Making methods (MCDM). Leveraging this spatial MCDM modeling approach with the Service Oriented Architecture (SOA) paradigm, we have developed a Spatial Model Steering (SMS) framework that enables users to explore the decision space and thus increase their awareness of the influence of key variables. In this framework a user can visually steer the LUA model key factors, explore and compare \"what if\" future land use scenarios by changing these factors and visualizing a range of potential LUA outcomes. In doing so, we believe that users can develop increased confidence in their understanding of the key factors governing the underlying models and ultimately obtain greater awareness of the uncertainty in the outcomes. (C) 2012 Elsevier Ltd. All rights reserved.", "paper_title": "Spatial model steering, an exploratory approach to uncertainty awareness in land use allocation", "paper_id": "WOS:000312517200006"}