{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "discriminative_co-clusters"}, {"score": 0.043290286050755494, "phrase": "discriminative_patterns"}, {"score": 0.0073848023927245935, "phrase": "proposed_algorithms"}, {"score": 0.004766388573192505, "phrase": "gene_expression_data"}, {"score": 0.004718314112245913, "phrase": "discriminative_models"}, {"score": 0.0044398358177815305, "phrase": "class-specific_patterns"}, {"score": 0.004328689762198895, "phrase": "existing_discriminative_models"}, {"score": 0.004220314322073171, "phrase": "entire_feature_space"}, {"score": 0.003569763795153386, "phrase": "labeled_datasets"}, {"score": 0.003462704420080129, "phrase": "gene_expression_analysis"}, {"score": 0.0031603487697867538, "phrase": "feature_space"}, {"score": 0.0028697077879305064, "phrase": "arbitrarily_positioned_co-clusters"}, {"score": 0.002727606388863445, "phrase": "co-clustering_algorithm"}, {"score": 0.002632332114727894, "phrase": "class_information"}, {"score": 0.002592523232809191, "phrase": "co-cluster_search_process"}, {"score": 0.0023066199295447686, "phrase": "discriminative_subspace_pattern-mining_algorithm"}], "paper_keywords": ["Co-clustering", " Biclustering", " Discriminative pattern mining", " Gene expression data", " Negative correlation"], "paper_abstract": "Discriminative models are used to analyze the differences between two classes and to identify class-specific patterns. Most of the existing discriminative models depend on using the entire feature space to compute the discriminative patterns for each class. Co-clustering has been proposed to capture the patterns that are correlated in a subset of features, but it cannot handle discriminative patterns in labeled datasets. In certain biological applications such as gene expression analysis, it is critical to consider the discriminative patterns that are correlated only in a subset of the feature space. The objective of this paper is twofold: first, it presents an algorithm to efficiently find arbitrarily positioned co-clusters from complex data. Second, it extends this co-clustering algorithm to discover discriminative co-clusters by incorporating the class information into the co-cluster search process. In addition, we also characterize the discriminative co-clusters and propose three novel measures that can be used to evaluate the performance of any discriminative subspace pattern-mining algorithm. We evaluated the proposed algorithms on several synthetic and real gene expression datasets, and our experimental results showed that the proposed algorithms outperformed several existing algorithms available in the literature.", "paper_title": "Efficient mining of discriminative co-clusters from gene expression data", "paper_id": "WOS:000344743100005"}