{"auto_keywords": [{"score": 0.04175792409456062, "phrase": "personas"}, {"score": 0.005781113934486836, "phrase": "requirements_stage"}, {"score": 0.005562990526742669, "phrase": "personas_technique"}, {"score": 0.00481495049065317, "phrase": "usable_software"}, {"score": 0.004578547645288202, "phrase": "hci_technique"}, {"score": 0.004340822341073993, "phrase": "fictitious_persons"}, {"score": 0.004115389073674224, "phrase": "se_developments"}, {"score": 0.00386708010197837, "phrase": "regular_se_developments"}, {"score": 0.003776462258204936, "phrase": "cooper's_version"}, {"score": 0.003123700735336375, "phrase": "se_version"}, {"score": 0.0030777156987044385, "phrase": "improved_personas"}, {"score": 0.0030144682722892833, "phrase": "average_software_developer"}, {"score": 0.0029877604856619806, "phrase": "hci_techniques"}, {"score": 0.00296128862361938, "phrase": "original_personas"}, {"score": 0.0027577621502315594, "phrase": "se_tradition"}, {"score": 0.0027090988689455735, "phrase": "new_version"}, {"score": 0.0025988558501741327, "phrase": "application_example"}, {"score": 0.002522861292947622, "phrase": "se_requirements_stage"}, {"score": 0.002463664816791839, "phrase": "software_product"}, {"score": 0.0023704114738284667, "phrase": "hci_personas_technique"}, {"score": 0.0023010830561290643, "phrase": "se."}, {"score": 0.00226717904319347, "phrase": "se_requirements_process"}, {"score": 0.0022470772167953123, "phrase": "personas_activities"}, {"score": 0.0022337748928022887, "phrase": "requirements_activities"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Personas technique", " Human-computer interaction", " Requirements", " Analysis activity", " Software process"], "paper_abstract": "Context: To develop usable software we need to understand the users that will interact with the system. Personas is a HCI technique that gathers information about users in order to comprehend their characteristics. This information is used to define fictitious persons on which development should focus. Personas provides an understanding of the user, often overlooked in SE developments. Objective: The goal of our research is to modify Personas to readily build the technique into the requirements stage of regular SE developments. Method: We tried to apply Cooper's version of the Personas technique and we found shortcomings in both the definition of the procedure to be enacted and the formalization of the product resulting from the execution of each step of the Personas technique. For each of these limitations (up to a total of 11), we devised an improvement to be built into Personas. We have incorporated these improvements into a SE version of Personas. The improved Personas avoid the weaknesses encountered by an average software developer unfamiliar with HCI techniques applying the original Personas. Results: We aim to improve requirements elicitation through the use of Personas. We have systematized and formalized Personas in the SE tradition in order to build this new version of the technique into the requirements stage. We have applied our proposal in an application example. Conclusion: The integration of Personas into the SE requirements stage might improves the understanding of what the software product should do and how it should behave. We have modified the HCI Personas technique to comply with the levels of systematization required by SE. We have enriched the SE requirements process by incorporating Personas activities into requirements activities. Requirements elicitation and requirements analysis are the RE activities most affected by incorporating Personas. (C) 2012 Elsevier B.V. All rights reserved.", "paper_title": "A HCI technique for improving requirements elicitation", "paper_id": "WOS:000309436200005"}