{"auto_keywords": [{"score": 0.03987639275883983, "phrase": "common_vision"}, {"score": 0.0046848707075530256, "phrase": "agent-based_framework"}, {"score": 0.004516856326107826, "phrase": "autonomous_agents"}, {"score": 0.0043947942344037105, "phrase": "individual_components"}, {"score": 0.003920573616298175, "phrase": "first_two_levels"}, {"score": 0.003867206750827, "phrase": "strategic_level"}, {"score": 0.0037626342268042997, "phrase": "independent_businesses"}, {"score": 0.0035945701438887282, "phrase": "application_level"}, {"score": 0.0031339552246625463, "phrase": "formal_model"}, {"score": 0.003091262582401731, "phrase": "computational_argumentation_theory"}, {"score": 0.0030491497463386924, "phrase": "persuasion_protocol"}, {"score": 0.0028470123663391126, "phrase": "partial_information"}, {"score": 0.0028210902750714075, "phrase": "partial_arguments"}, {"score": 0.0025981315738078793, "phrase": "new_solution"}, {"score": 0.0022962183207691188, "phrase": "distributed_and_centralized_coordination_strategies"}, {"score": 0.002163600705898299, "phrase": "online-purchasing_example"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["B2B", " Argumentation theory", " Agent communication", " Conflict", " Persuasion"], "paper_abstract": "This paper presents an agent-based framework for modeling and deploying Business-to-Business (B2B) applications, where autonomous agents act on behalf of the individual components that form these applications. This framework consists of three levels identified by strategic, application, and resource, with focus in this paper on the first two levels. The strategic level is about the common vision that independent businesses define as part of their decision of partnership. The application level is about the business processes that get virtually combined as result of this common vision. As conflicts are bound to arise among the independent applications/agents, the framework uses a formal model based on computational argumentation theory through a persuasion protocol to detect and resolve these conflicts. In this protocol, agents reason about partial information using partial arguments, partial attack, and partial acceptability. Agents can then jointly find arguments that support a new solution for their conflicts, which is not known by any of them individually. Termination, soundness, and completeness properties of this protocol are provided. Distributed and centralized coordination strategies are also supported in this framework, which is illustrated with an online-purchasing example. (C) 2010 Elsevier B.V. All rights reserved.", "paper_title": "Using argumentation to model and deploy agent-based B2B applications", "paper_id": "WOS:000281492600004"}