{"auto_keywords": [{"score": 0.036646086987164705, "phrase": "learners'_behaviors"}, {"score": 0.015719716506582538, "phrase": "trace_analysis"}, {"score": 0.004760394308239882, "phrase": "identifying_learners'_behaviors"}, {"score": 0.004548253531664032, "phrase": "web-based_learning_environment"}, {"score": 0.004058180509184539, "phrase": "online_course_designers"}, {"score": 0.003966667994579941, "phrase": "learning_material"}, {"score": 0.0038332390893263844, "phrase": "individualized_learning"}, {"score": 0.003683213029483699, "phrase": "meta-cognitive_knowledge"}, {"score": 0.0033619033669956317, "phrase": "training_sessions"}, {"score": 0.0027374647587075935, "phrase": "'navigation_type'_indicator"}, {"score": 0.002414290278501595, "phrase": "decision_tree"}, {"score": 0.002373276186210053, "phrase": "semantic_assumptions"}, {"score": 0.0022287497627555895, "phrase": "proposed_calculation_method"}], "paper_keywords": ["Navigation type", " Indicator", " Trace", " Web behavior analysis", " Educational Hypermedia System"], "paper_abstract": "Identifying learners' behaviors and learning preferences or styles in a Web-based learning environment is crucial for organizing the tracking and specifying how and when assistance is needed. Moreover, it helps online course designers to adapt the learning material in a way that guarantees individualized learning, and helps learners to acquire meta-cognitive knowledge. The goal of this research is to identify learners' behaviors and learning styles automatically during training sessions, based on trace analysis. In this paper, we focus on the identification of learners' behaviors through our system: Indicators for the Deduction of Learning Styles. We shall first present our trace analysis approach. Then, we shall propose a 'navigation type' indicator to analyze learners' behaviors and we shall define a method for calculating it. To this end, we shall build a decision tree based on semantic assumptions and tests. To validate our approach, and improve the proposed calculation method, we shall present and discuss the results of two experiments that we conducted.", "paper_title": "Learners' navigation behavior identification based on trace analysis", "paper_id": "WOS:000285361600002"}