{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "index_coding_problem"}, {"score": 0.012166841910079822, "phrase": "network_coding"}, {"score": 0.004503959683578956, "phrase": "significant_attention"}, {"score": 0.004447915226010682, "phrase": "research_community"}, {"score": 0.004319830179921363, "phrase": "wireless_ad_hoc_networks"}, {"score": 0.004056501832957831, "phrase": "matroid_representation_problems"}, {"score": 0.003670608022642996, "phrase": "message_x"}, {"score": 0.0035499650812710806, "phrase": "prior_side_information"}, {"score": 0.003549007108931211, "phrase": "vector_linear_codes"}, {"score": 0.0034911335714333507, "phrase": "subset_h"}, {"score": 0.0033905067962602515, "phrase": "noiseless_communication_channel"}, {"score": 0.0031448288291084, "phrase": "encoding_scheme"}, {"score": 0.0027054473441439422, "phrase": "linear_representation"}, {"score": 0.0021857667493036786, "phrase": "scalar_linear_index_codes"}, {"score": 0.0021049977753042253, "phrase": "optimum_number"}], "paper_keywords": ["Index coding", " matroid theory", " network coding", " nonlinear codes", " side information"], "paper_abstract": "The index coding problem has recently attracted a significant attention from the research community due to its theoretical significance and applications in wireless ad hoc networks. An instance of the index coding problem includes a sender that holds a set of information messages X = {x(1),...,x(k)} and a set of receivers R. Each receiver rho = (x,H) in R needs to obtain a message x is an element of X and has prior side information consisting of a subset H of X. The sender uses a noiseless communication channel to broadcast encoding of messages in X to all clients. The objective is to find an encoding scheme that minimizes the number of transmissions required to satisfy the demands of all the receivers. In this paper, we analyze the relation between the index coding problem, the more general network coding problem, and the problem of finding a linear representation of a matroid. In particular, we show that any instance of the network coding and matroid representation problems can be efficiently reduced to an instance of the index coding problem. Our reduction implies that many important properties of the network coding and matroid representation problems carry over to the index coding problem. Specifically, we show that vector linear codes outperform scalar linear index codes and that vector linear codes are insufficient for achieving the optimum number of transmissions.", "paper_title": "On the Index Coding Problem and Its Relation to Network Coding and Matroid Theory", "paper_id": "WOS:000278812000012"}