{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "urban_road_network"}, {"score": 0.03385905439996528, "phrase": "cascading_failures"}, {"score": 0.022998725409271743, "phrase": "modular_topologies"}, {"score": 0.009472940783326673, "phrase": "critical_components"}, {"score": 0.004640311812502743, "phrase": "cascade_failures"}, {"score": 0.004125513927068713, "phrase": "small-world_random_network"}, {"score": 0.004029592719134717, "phrase": "initial_barabasi-albert_scale-free_network"}, {"score": 0.0039624406239057944, "phrase": "user-equilibrium_assignment"}, {"score": 0.0038833278847237858, "phrase": "remote_nodes"}, {"score": 0.0038573081851680656, "phrase": "low_betweeness"}, {"score": 0.0035702793079311896, "phrase": "inserted_modules"}, {"score": 0.0034638476252104706, "phrase": "lower_intensity"}, {"score": 0.00344062888674746, "phrase": "shorter_path"}, {"score": 0.0033268412940032103, "phrase": "higher_betweeness"}, {"score": 0.0033045378860812403, "phrase": "traffic_flow"}, {"score": 0.002907992115184249, "phrase": "average_degree"}, {"score": 0.002878785759716458, "phrase": "inserted_modular"}, {"score": 0.0028023242231187363, "phrase": "better_effect"}, {"score": 0.0026111116934081284, "phrase": "rewired_probability"}, {"score": 0.0024909230668523825, "phrase": "importance-based_attachment_mechanism"}, {"score": 0.0023842666006371267, "phrase": "step_time"}, {"score": 0.0023603078194781965, "phrase": "larger_reduction"}, {"score": 0.0021770860717929192, "phrase": "practical_guidance"}], "paper_keywords": ["Complex networks", " Cascade failures", " Modular topologies", " Urban road network"], "paper_abstract": "Purpose - By aiming at defending cascade failures effectively, the purpose of this paper is to present a strategy of inserting modular topologies into urban road network through reducing the burdens of critical components with too much traffic flow. Design/methodology/approach - Each module is considered as a small-world random network, which is inserted into the initial Barabasi-Albert scale-free network. Based on the user-equilibrium assignment, the strategy searches for remote nodes with low betweeness and flow in the network, and sets these nodes to be connected with the modular topologies. In this sense, the inserted modules are supposed to attach to the nodes with lower intensity of shorter path, and avoid bringing more impact to the nodes with higher betweeness and traffic flow. By using efficiency as the measurement of cascading failures, the performance of the networks generated through the strategy is tested. Findings - The results show that the performance of the strategy is sensitive to the average degree of the inserted modular, and the modular size with a better effect on reducing the size of cascading failures or delaying the time of breakdown, while the other factors (e. g. the rewired probability) present few differences among various values. Meanwhile, it is found that the importance-based attachment mechanism has a better effect on preventing the cascading failures, especially delaying the step time of the larger reduction. Practical implications - The strategy aims at alleviating the burdens in critical components to prevent the cascading failures of the network, and provides practical guidance on the decision of the urban road network evolving process. Originality/value - An effective strategy for cascade defense in urban road network is proposed in this paper.", "paper_title": "Cascade defense in urban road network by inserting modular topologies", "paper_id": "WOS:000341937600007"}