{"auto_keywords": [{"score": 0.030444799116391686, "phrase": "concept_map"}, {"score": 0.011555278414338075, "phrase": "story_grammars"}, {"score": 0.00481495049065317, "phrase": "children's_storytelling_ability"}, {"score": 0.004683292152590589, "phrase": "imperative_and_innovative_pathway"}, {"score": 0.003987367359722647, "phrase": "students'_storytelling_ability"}, {"score": 0.0038998328617557013, "phrase": "important_issue"}, {"score": 0.00370981613076245, "phrase": "complex_cognitive_processes"}, {"score": 0.003588291565092195, "phrase": "enhanced_concept_map_approach"}, {"score": 0.003123203316511694, "phrase": "concept_map_approach"}, {"score": 0.002718231974492536, "phrase": "clearer_subjects"}, {"score": 0.002643753276264565, "phrase": "abundant_contents"}, {"score": 0.0023394947463129642, "phrase": "effective_approach"}, {"score": 0.00230080652063411, "phrase": "learner-centered_storytelling_tools"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Human-computer interface", " Multimedia/hypermedia systems", " Interactive learning environments", " Evaluation of CAL systems"], "paper_abstract": "Storytelling is an imperative and innovative pathway to enhance learning due to the fact that such activity prompts learners to reflect to construct meaning based on their observations and knowledge. Therefore, to develop and enhance students' storytelling ability has become an important issue for both educators and researchers. Since storytelling involves complex cognitive processes, this study proposed an enhanced concept map approach featured with story grammars to help children develop stories. By gathering the stories developed by 114 third-graders, this study aimed to investigate whether the concept map approach can enhance their storytelling ability. It is found that the children, who used the concept map with story grammars, can develop stories with more complex structure, clearer subjects, more creative ideas, and abundant contents than those only using the concept map without the grammars. Such findings support that the concept map and story grammars can be an effective approach for developing learner-centered storytelling tools which help students develop and apply the knowledge about storytelling. (C) 2010 Elsevier Ltd. All rights reserved.", "paper_title": "An enhanced concept map approach to improving children's storytelling ability", "paper_id": "WOS:000286682700032"}