{"auto_keywords": [{"score": 0.04288125939796196, "phrase": "schizophrenic_patients"}, {"score": 0.03811261983009534, "phrase": "intrinsic_logic"}, {"score": 0.03738892026317543, "phrase": "commonsense_logic"}, {"score": 0.004828914602826593, "phrase": "quantum"}, {"score": 0.0046738485441681485, "phrase": "different_disciplines"}, {"score": 0.004492094831481931, "phrase": "vector_processing_devices"}, {"score": 0.00428892403807229, "phrase": "new_perspective"}, {"score": 0.004163172790791119, "phrase": "known_anomalies"}, {"score": 0.003961694867182568, "phrase": "normal_controls"}, {"score": 0.0037699306119313154, "phrase": "\"commonsense\"_logic"}, {"score": 0.0032483801419536675, "phrase": "human_brains"}, {"score": 0.0031845067058084583, "phrase": "intrinsic_logical_operations"}, {"score": 0.003040300546633403, "phrase": "aristotelian"}, {"score": 0.0028549396580672417, "phrase": "different_constraints"}, {"score": 0.0023559890904375526, "phrase": "von_domarus_type"}, {"score": 0.00234043119560776, "phrase": "namely_the_inference_that_shared_attributes"}, {"score": 0.002256677005409071, "phrase": "human_thinking"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Logic", " Quantum logic", " Linear logic", " Schizophrenia"], "paper_abstract": "Many researchers in different disciplines have independently concluded that brains are, possibly among other things, vector processing devices. In this paper we offer support for this hypothesis coming from a new perspective. Namely, we test it against some known anomalies in the processing by schizophrenic patients of certain logical tasks: they perform better at them than normal controls, despite the observation that they do not generally employ \"normal\" or \"commonsense\" logic. On the assumption that they are compelled to use the intrinsic logic of the brain instead of commonsense logic, and that this logic is linear or quantum-like, we are able to resolve these and other anomalies. Our conclusions support the idea that human brains (at least) perform intrinsic logical operations according to the dictates of a linear (or Grassmannian, or quantum-like) logic rather than \"classical\" or Aristotelian logic (which seems not to be intrinsic to brains, these having evolved under the pressure of different constraints). If this is the case, then commonsense logic must be acquired through experience and the construction of contexts, an ability schizophrenic patients seem to lack, and who are consequently compelled to rely on the intrinsic logic, which is quantum-like and more efficient at certain tasks. Moreover, the proclivity toward errors of von Domarus type (namely the inference that shared attributes imply identity), which seems to be endemic to human thinking and has been discussed in connection with schizophrenia, is also explained on this basis. (C) 2011 Elsevier B.V. All rights reserved.", "paper_title": "Quantum-like logics and schizophrenia", "paper_id": "WOS:000300802700008"}