{"auto_keywords": [{"score": 0.039629568495239624, "phrase": "\"sweet_spot"}, {"score": 0.03445950997890862, "phrase": "textual_complexity"}, {"score": 0.00481495049065317, "phrase": "positive_experience"}, {"score": 0.00439918275666155, "phrase": "open_question"}, {"score": 0.004320421465896323, "phrase": "starting_point"}, {"score": 0.0038590090616766434, "phrase": "appraisal_theory"}, {"score": 0.003294350220187021, "phrase": "computational_model"}, {"score": 0.003220709449062307, "phrase": "psycholinguistic_theory"}, {"score": 0.0031917146566068245, "phrase": "processing_difficulty"}, {"score": 0.0030094882299407256, "phrase": "classification_performance"}, {"score": 0.0027491902732542013, "phrase": "user's_ix."}, {"score": 0.002568812627436125, "phrase": "structural_equation_model"}, {"score": 0.002534179209111416, "phrase": "positive_influence"}, {"score": 0.0024440836179156593, "phrase": "negative_influence"}, {"score": 0.00237861522566195, "phrase": "seemingly_paradoxical_relationship"}, {"score": 0.002202469129781332, "phrase": "information_systems"}, {"score": 0.0021049977753042253, "phrase": "interesting_ix."}], "paper_keywords": [""], "paper_abstract": "How to provide users a positive experience during interaction with information (i.e., the \"Information eXperience\" (IX)) is still an open question. As a starting point, this work investigates how the emotion of interest can be influenced by modifying the complexity of the information presented to users. The appraisal theory of interest suggests a \"sweet spot\" where interest will be at its peak: information that is novel and complex yet still comprehensible. This \"sweet spot\" is approximated using two studies. Study One develops a computational model of textual complexity founded on psycholinguistic theory on processing difficulty. The model was trained and tested on 12,420 articles, achieving a classification performance of 90.87% on two classes of complexity. Study Two puts the model to its ultimate test: Its application to change the user's IX. Using 18 news articles the influence of complexity on interest and its appraisals is unveiled. A structural equation model shows a positive influence of complexity on interest, yet a negative influence of comprehensibility, confirming a seemingly paradoxical relationship between complexity and interest. By showing when complexity becomes interesting, this paper shows how information systems can use the model of textual complexity to construct an interesting IX.", "paper_title": "When Complexity Becomes Interesting", "paper_id": "WOS:000337030700012"}