{"auto_keywords": [{"score": 0.03852759913182569, "phrase": "pca"}, {"score": 0.00441718685609235, "phrase": "possible_relationships"}, {"score": 0.004385555408850022, "phrase": "electronic_structural_properties"}, {"score": 0.004354149483556514, "phrase": "binding_affinity"}, {"score": 0.0038119123317396954, "phrase": "energy_values"}, {"score": 0.0037845987749316632, "phrase": "exploratory_data_analysis"}, {"score": 0.003778994363298527, "phrase": "hca"}, {"score": 0.003757480190200645, "phrase": "hierarchical_cluster"}, {"score": 0.003690527690610707, "phrase": "principal_component_analysis"}, {"score": 0.0031959843979467704, "phrase": "electrostatic_potential"}, {"score": 0.003161674440750158, "phrase": "nitrogen_atom"}, {"score": 0.0030941521409613417, "phrase": "fermo"}, {"score": 0.002910545717767559, "phrase": "electronic_descriptors"}, {"score": 0.00245753647863636, "phrase": "pls_regression_equation"}, {"score": 0.0024050158199950024, "phrase": "selected_electronic_descriptors"}, {"score": 0.0023536149458842992, "phrase": "high_values"}, {"score": 0.0023367260405565814, "phrase": "fermo_energies"}, {"score": 0.0022703709180757576, "phrase": "low_values"}, {"score": 0.0022298571016688335, "phrase": "negative_charges"}, {"score": 0.002190064650401852, "phrase": "desirable_properties"}, {"score": 0.0021509807762081145, "phrase": "new_molecules"}, {"score": 0.0021202154023229123, "phrase": "high_binding_affinity"}], "paper_keywords": ["Molecular orbitals", " QSAR", " Antihistamine", " H-3 receptor", " Non-imidazole compounds"], "paper_abstract": "Molecular orbital calculations were carried out on a set of 28 non-imidazole H-3 antihistamine compounds using the Hartree-Fock method in order to investigate the possible relationships between electronic structural properties and binding affinity for H3 receptors (pK(i)). It was observed that the frontier effective-for-reaction molecular orbital (FERMO) energies were better correlated with pK(i) values than highest occupied molecular orbital (HOMO) and lowest unoccupied molecular orbital (LUMO) energy values. Exploratory data analysis through hierarchical cluster (HCA) and principal component analysis (PCA) showed a separation of the compounds in two sets, one grouping the molecules with high pK(i) values, the other gathering low pK(i) value compounds. This separation was obtained with the use of the following descriptors: FERMO energies (epsilon(FERMO)), charges derived from the electrostatic potential on the nitrogen atom (N-1), electronic density indexes for FERMO on the N-1 atom (Sigma((FERMO))c(i)(2)). and electrophilicity (omega'). These electronic descriptors were used to construct a quantitative structure-activity relationship (QSAR) model through the partial least-squares (PLS) method with three principal components. This model generated Q(2) = 0.88 and R-2 = 0.927 values obtained from a training set and external validation of 23 and 5 molecules, respectively. After the analysis of the PLS regression equation and the values for the selected electronic descriptors, it is suggested that high values of FERMO energies and of Sigma((FERMO))c(i)(2), together with low values of electrophilicity and pronounced negative charges on N-1 appear as desirable properties for the conception of new molecules which might have high binding affinity. 2010 Elsevier Inc. All rights reserved.", "paper_title": "A quantum chemical study on a set of non-imidazole H-3 antihistamine molecules", "paper_id": "WOS:000276287200008"}