{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "cooperative_behaviors"}, {"score": 0.04972867160744286, "phrase": "mobile_robots"}, {"score": 0.026897811453592893, "phrase": "p-robot_method"}, {"score": 0.004744748477093856, "phrase": "new_methodologies"}, {"score": 0.004066416005586085, "phrase": "environmental_contact_points"}, {"score": 0.004007083686875716, "phrase": "linked_mobile_robots"}, {"score": 0.00396315099839886, "phrase": "multiple_degree-of-freedom_object"}, {"score": 0.0039053194919285725, "phrase": "articulated_open_kinematic_chain"}, {"score": 0.003668768542734106, "phrase": "physical_cooperation"}, {"score": 0.0035887342563437935, "phrase": "environmental_contacts"}, {"score": 0.0034212450542713607, "phrase": "system_dynamics"}, {"score": 0.0033589207694997413, "phrase": "open_chain"}, {"score": 0.003132236287543072, "phrase": "constraint_conditions"}, {"score": 0.0030414140732789186, "phrase": "multiple_robots"}, {"score": 0.002825681384008326, "phrase": "force_constraints"}, {"score": 0.0027437235598539904, "phrase": "'tipping_cone"}, {"score": 0.0026838147966444783, "phrase": "standard_friction_cone"}, {"score": 0.0025868521085189843, "phrase": "undesired_tipping"}, {"score": 0.002502576987281976, "phrase": "static_as_well_as_dynamic_analysis"}, {"score": 0.0022909940601580675, "phrase": "redundant_actuation"}, {"score": 0.00224094835951312, "phrase": "third_robot"}, {"score": 0.002175913488493802, "phrase": "contact_constraints"}], "paper_keywords": ["Physical cooperation", " Mobile robots", " Dynamics", " Design"], "paper_abstract": "New methodologies are needed for modeling of physically cooperating mobile robots to be able to systematically design and analyze such systems. In this context, we present a method called the 'P-robot Method' under which we introduce entities called the p-robots at the environmental contact points and treat the linked mobile robots as a multiple degree-of-freedom object, comprising an articulated open kinematic chain, which is manipulated by the p-robots. The method is suitable to address three critical aspects of physical cooperation: a) analysis of environmental contacts, b) utilization of redundancy, and c) exploitation of system dynamics. Dynamics of the open chain are computed independent of the constraints, thus allowing the same set of equations to be used as the constraint conditions change, and simplifying the addition of multiple robots to the chain. The decoupling achieved through constraining the p-robots facilitates the analysis of kinematic as well as force constraints. We introduce the idea of a 'tipping cone', similar to a standard friction cone, to test whether forces on the robots cause undesired tipping. We have employed the P-robot Method for the static as well as dynamic analysis for a cooperative behavior involving two robots. The method is generalizable to analyze cooperative behaviors with any number of robots. We demonstrate that redundant actuation achieved by an adding a third robot to cooperation can help in satisfying the contact constraints. The P-robot Method can be useful to analyze other interesting multi-body robotic systems as well.", "paper_title": "A methodology for design and analysis of cooperative behaviors with mobile robots", "paper_id": "WOS:000270643400008"}