{"auto_keywords": [{"score": 0.049198528177459636, "phrase": "computational_complexity"}, {"score": 0.015719716506582538, "phrase": "positive_region"}, {"score": 0.01529257908581442, "phrase": "discernibility_matrix_method"}, {"score": 0.012319587546963308, "phrase": "discernibility_matrix"}, {"score": 0.009383967247965565, "phrase": "attribute_reduction"}, {"score": 0.004639460045311648, "phrase": "rough"}, {"score": 0.004532988904965752, "phrase": "valid_method"}, {"score": 0.00432733352307636, "phrase": "np-hard_problem"}, {"score": 0.0035110198699787013, "phrase": "new_algorithm"}, {"score": 0.0032593915869553714, "phrase": "largest_measure"}, {"score": 0.003054009753601139, "phrase": "c._secondly"}, {"score": 0.002956209594959227, "phrase": "non-positive_region"}, {"score": 0.0021646022201798247, "phrase": "reduced_attribute_sets"}, {"score": 0.0021049977753042253, "phrase": "standard_discernibility_matrix_method"}], "paper_keywords": [""], "paper_abstract": "Rough set discernibility matrix method is a valid method to attribute reduction. However, it is a NP-hard problem. Up until now, though some methods have been proposed to improve this problem, the case is not improved well. We find that the idea of discernibility matrix can be used to not only the whole data but also partial data. So we present a new algorithm to reduce the computational complexity. Firstly, select a condition attribute C that holds the largest measure of gamma(C, D) in which the decision attribute D depends on C. Secondly, with the examples in the non-positive region, build a discernibility matrix to create attribute reduction. Thirdly, combine the attributes generated in the above two steps into the attribute reduction set. Additionally, we give a proof of the rationality of our method. The larger the positive region is; the more the complexity is reduced. Four Experimental results indicate that the computational complexity is reduced by 67%, 83%, 41%, and 30% respectively and the reduced attribute sets are the same as the standard discernibility matrix method.", "paper_title": "Using positive region to reduce the computational complexity of discernibility matrix method", "paper_id": "WOS:000239623800136"}