{"auto_keywords": [{"score": 0.03329471463625431, "phrase": "dm's_attitudinal_character"}, {"score": 0.02811223834300324, "phrase": "proposed_approach"}, {"score": 0.01526523201371504, "phrase": "intuitionistic_fuzzy_environment"}, {"score": 0.011965321767357219, "phrase": "decision-making_process"}, {"score": 0.00481495049065317, "phrase": "decision_maker's_attitudinal_character"}, {"score": 0.004734038956773703, "phrase": "decision-making_problems"}, {"score": 0.004634799977448855, "phrase": "decision_makers"}, {"score": 0.0038953958723049287, "phrase": "intuitionistic_fuzzy_sets"}, {"score": 0.0036090884921108086, "phrase": "dm's_indeterminacy"}, {"score": 0.0034738975998176323, "phrase": "decision_model"}, {"score": 0.002809732883291955, "phrase": "criterion's_weight"}, {"score": 0.0027390682208834013, "phrase": "ordered_weighted_averaging_operator"}, {"score": 0.002548331088496964, "phrase": "real_cases"}, {"score": 0.0023708445073819277, "phrase": "interval-valued_intuitionistic_fuzzy_environment"}, {"score": 0.0022434880661725493, "phrase": "existing_approaches"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Multi-criteria decision-making", " Intuitionistic fuzzy sets (IFSs)", " Interval-valued intuitionistic fuzzy sets (IVIFSs)", " Maximum entropy ordered weighted averaging (MEOWA) operator", " Intuitionistic fuzzy multi-criteria decision-making (IF-MCDM)"], "paper_abstract": "Decision makers (DMs) are usually faced with selecting the most suitable alternative from a group of candidates based on a set of criteria. A number of approaches have been proposed to solve such multi-criteria decision-making (MCDM) problems. Intuitionistic fuzzy sets (IFSs) are useful for dealing with the vagueness and uncertainty in a decision-making process because the DM's indeterminacy in the evaluations can be expressed in the decision model. This paper proposes two score functions for evaluating the suitability of an alternative across all criteria in an intuitionistic fuzzy environment, in which the DM's attitudinal character is considered to determine the portion of indeterminacy that will be included in the assessments of alternatives. The DM's attitudinal character is also applied to determine each criterion's weight for the aggregation using the ordered weighted averaging operator. By considering the DM's attitudinal character, the proposed approach is flexible in the decision-making process and applicable to real cases. In addition, the proposed approach can be easily extended to deal with problems in an interval-valued intuitionistic fuzzy environment. Numerical examples are used to illustrate applicability, and comparisons with existing approaches are conducted to demonstrate the feasibility of the proposed approach. (C) 2012 Elsevier B.V. All rights reserved.", "paper_title": "Considering the decision maker's attitudinal character to solve multi-criteria decision-making problems in an intuitionistic fuzzy environment", "paper_id": "WOS:000311775200012"}