{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "security_protocols"}, {"score": 0.04211704685011181, "phrase": "unbounded_number"}, {"score": 0.004782848614014638, "phrase": "pushdown_automata"}, {"score": 0.004750959742844963, "phrase": "formal_methods"}, {"score": 0.004610058444728656, "phrase": "reachability_properties"}, {"score": 0.004399102320426124, "phrase": "equivalence-based_properties"}, {"score": 0.004268591456106124, "phrase": "privacy-like_properties"}, {"score": 0.004197758831410097, "phrase": "vote_secrecy"}, {"score": 0.003822191555851545, "phrase": "simple_case"}, {"score": 0.0037087324991876727, "phrase": "limited_fragment"}, {"score": 0.003562656752692045, "phrase": "protocol's_rules"}, {"score": 0.003503497128638099, "phrase": "secrecy_preservation_problem"}, {"score": 0.0032328778271536454, "phrase": "deterministic_protocols"}, {"score": 0.00317917686846757, "phrase": "first_decidability_result"}, {"score": 0.0031579462920888132, "phrase": "checking_equivalence"}, {"score": 0.0025654738267173274, "phrase": "deterministic_pushdown_automata"}, {"score": 0.00242335068996852, "phrase": "first_tool"}, {"score": 0.0021767893059191795, "phrase": "simplified_version"}, {"score": 0.0021549990311897347, "phrase": "basic_access_control"}, {"score": 0.0021049977753042253, "phrase": "biometric_passports"}], "paper_keywords": ["Formal proofs", " security protocols", " verification", " trace equivalence"], "paper_abstract": "Formal methods have been very successful in analyzing security protocols for reachability properties such as secrecy or authentication. In contrast, there are very few results for equivalence-based properties, crucial for studying, for example, privacy-like properties such as anonymity or vote secrecy. We study the problem of checking equivalence of security protocols for an unbounded number of sessions. Since replication leads very quickly to undecidability (even in the simple case of secrecy), we focus on a limited fragment of protocols (standard primitives but pairs, one variable per protocol's rules) for which the secrecy preservation problem is known to be decidable. Surprisingly, this fragment turns out to be undecidable for equivalence. Then, restricting our attention to deterministic protocols, we propose the first decidability result for checking equivalence of protocols for an unbounded number of sessions. This result is obtained through a characterization of equivalence of protocols in terms of equality of languages of (generalized, real-time) deterministic pushdown automata. We further show that checking for equivalence of protocols is actually equivalent to checking for equivalence of generalized, real-time deterministic pushdown automata. Very recently, the algorithm for checking for equivalence of deterministic pushdown automata has been implemented. We have implemented our translation from protocols to pushdown automata, yielding the first tool that decides equivalence of (some class of) protocols, for an unbounded number of sessions. As an application, we have analyzed some protocols of the literature including a simplified version of the basic access control (BAC) protocol used in biometric passports.", "paper_title": "From Security Protocols to Pushdown Automata", "paper_id": "WOS:000367919000003"}