{"auto_keywords": [{"score": 0.030336914577021794, "phrase": "rodfa"}, {"score": 0.015573597099571257, "phrase": "large-scale_probabilistic_wireless_sensor_networks"}, {"score": 0.013409687401168293, "phrase": "aggregation_results"}, {"score": 0.011170141046166206, "phrase": "data_fusaggregation"}, {"score": 0.00481495049065317, "phrase": "reliability-oriented_data_fusaggregation_algorithm"}, {"score": 0.004464602028530629, "phrase": "data_aggregation"}, {"score": 0.004422632150619634, "phrase": "data_fusion"}, {"score": 0.004238576355081601, "phrase": "sensed_data"}, {"score": 0.0038930368103015467, "phrase": "actual_networks"}, {"score": 0.003802135020791801, "phrase": "lossy_links"}, {"score": 0.0036958398682001015, "phrase": "ideal_network_models"}, {"score": 0.0030590445140753187, "phrase": "monitoring_information"}, {"score": 0.003015950477134494, "phrase": "monitored_geographic_environment"}, {"score": 0.002822712709335093, "phrase": "network_administrator"}, {"score": 0.0027178867838199734, "phrase": "large-scale_probabilistic_wsns"}, {"score": 0.0025316905609748135, "phrase": "aggregation_result"}, {"score": 0.00240328454980006, "phrase": "important_part"}, {"score": 0.002125020720324262, "phrase": "network_sizes"}, {"score": 0.0021049977753042253, "phrase": "network_performances"}], "paper_keywords": [""], "paper_abstract": "A lot of facts show that many researches just place emphasis on data aggregation or data fusion, which is not beneficial to analyze the sensed data thoroughly and will lead to the aggregation results' not being used fully; worse yet, the actual networks are always existed with lossy links; many now available aggregation algorithms are based on ideal network models and not any further analysis and fusion about aggregation results are done. Thus, we propose the concept of data fusaggregation so as to support processing sensed data while transmitting in large-scale probabilistic wireless sensor networks and propose a reliability-oriented data fusaggregation algorithm(RODFA) to assist users to get the monitoring information from the monitored geographic environment and measure the reliability of the information they get. RODFA also facilitates network administrator to improve the system sensing performance for large-scale probabilistic WSNs. In RODFA, the parameter.., which could reflect the reliability of aggregation result intuitively, is defined and calculated and it plays an important part in helping users to process aggregation result further. In our experiment, the validity of RODFA is verified by our simulation results, and the influence of network sizes and network performances on data fusaggregation is analyzed.", "paper_title": "Research on Reliability-Oriented Data Fusaggregation Algorithm in Large-Scale Probabilistic Wireless Sensor Networks", "paper_id": "WOS:000336541500001"}