{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "multiple_classifiers"}, {"score": 0.04949240338189186, "phrase": "dempster's_rule"}, {"score": 0.004697655699119423, "phrase": "text_categorization"}, {"score": 0.004101579688745222, "phrase": "support_vector_machine"}, {"score": 0.003603038872576132, "phrase": "rocchio"}, {"score": 0.0034720284451902083, "phrase": "general_representation"}, {"score": 0.0033664873319204027, "phrase": "different_classifiers"}, {"score": 0.0030686679245324837, "phrase": "novel_evidence_structure"}, {"score": 0.002867098884583832, "phrase": "effective_method"}, {"score": 0.002426566352219338, "phrase": "comparative_analysis"}, {"score": 0.0022811346113905295, "phrase": "previous_result"}, {"score": 0.002198084195030656, "phrase": "best_combined_classifier"}, {"score": 0.0021049977753042253, "phrase": "individual_classifiers"}], "paper_keywords": [""], "paper_abstract": "In this paper we investigate the combination of four machine learning methods for text categorization using Dempster's rule of combination. These methods include Support Vector Machine (SVM), kNN (Nearest Neighbor), kNN model-based approach (kNNM), and Rocchio. We first present a general representation of the outputs of different classifiers, in particular, modeling it as a piece of evidence by using a novel evidence structure called focal element triplet. Furthermore, we investigate an effective method for combining pieces of evidence derived from classifiers generated by a 10-fold cross-validation. Finally, we evaluate our methods on the 20-newsgroup and Reuters-21578 benchmark data sets and perform the comparative analysis with majority voting in combining multiple classifiers along with the previous result. Our experimental results show that the best combined classifier can improve the performance of the individual classifiers and Dempster's rule of combination outperforms majority voting in combining multiple classifiers.", "paper_title": "Combining multiple classifiers using Dempster's rule for text categorization", "paper_id": "WOS:000244842800003"}