{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "hidden_social_dynamics"}, {"score": 0.04972867160744286, "phrase": "collaborative_ontology_engineering_projects"}, {"score": 0.00471003041684707, "phrase": "evaluation_methods"}, {"score": 0.004624337472244542, "phrase": "semantic_technologies"}, {"score": 0.00454019648854141, "phrase": "end_result"}, {"score": 0.004506968388996092, "phrase": "ontology_engineering_efforts"}, {"score": 0.004172360444377281, "phrase": "whole_arsenal"}, {"score": 0.0041418132064539185, "phrase": "ontology-evaluation_techniques"}, {"score": 0.0037921662574137535, "phrase": "ontology_engineering_construction"}, {"score": 0.0034464962568390265, "phrase": "social_processes"}, {"score": 0.003030247482854539, "phrase": "collaborative_ontology_engineering_processes"}, {"score": 0.002942373803701752, "phrase": "historical_change-log_data"}, {"score": 0.0028993944292191433, "phrase": "qualitative_differences"}, {"score": 0.0028570410572695106, "phrase": "different_collaborative_ontology_engineering_projects"}, {"score": 0.002673957615079041, "phrase": "social_factors"}, {"score": 0.0025678829712650437, "phrase": "new_line"}, {"score": 0.0025490525773769063, "phrase": "evaluation_techniques"}, {"score": 0.0024842242921857705, "phrase": "static_result"}, {"score": 0.00244792069601419, "phrase": "domain_experts"}, {"score": 0.002183938718432764, "phrase": "existing_arsenal"}, {"score": 0.0021679176844660074, "phrase": "ontology_evaluation_techniques"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Collaborative ontology engineering", " Evaluation", " Change logs"], "paper_abstract": "Traditionally, evaluation methods in the field of semantic technologies have focused on the end result of ontology engineering efforts, mainly, on evaluating ontologies and their corresponding qualities and characteristics. This focus has led to the development of a whole arsenal of ontology-evaluation techniques that investigate the quality of ontologies as a product. In this paper, we aim to shed light on the process of ontology engineering construction by introducing and applying a set of measures to analyze hidden social dynamics. We argue that especially for ontologies which are constructed collaboratively, understanding the social processes that have led to their construction is critical not only in understanding but consequently also in evaluating the ontologies. With the work presented in this paper, we aim to expose the texture of collaborative ontology engineering processes that is otherwise left invisible. Using historical change-log data, we unveil qualitative differences and commonalities between different collaborative ontology engineering projects. Explaining and understanding these differences will help us to better comprehend the role and importance of social factors in collaborative ontology engineering projects. We hope that our analysis will spur a new line of evaluation techniques that view ontologies not as the static result of deliberations among domain experts, but as a dynamic, collaborative and iterative process that needs to be understood, evaluated and managed in itself. We believe that advances in this direction would help our community to expand the existing arsenal of ontology evaluation techniques towards more holistic approaches. (C) 2013 Elsevier B.V. All rights reserved.", "paper_title": "How ontologies are made: Studying the hidden social dynamics behind collaborative ontology engineering projects", "paper_id": "WOS:000324302000002"}