{"auto_keywords": [{"score": 0.04500759592957068, "phrase": "quantum_gates"}, {"score": 0.0075807334680490415, "phrase": "superdense_coding"}, {"score": 0.00481495049065317, "phrase": "ancilla-assisted_discrimination"}, {"score": 0.004781498797706604, "phrase": "quantum_gates."}, {"score": 0.00474827840031692, "phrase": "intrinsic_idea"}, {"score": 0.004367108655796158, "phrase": "basic_scheme"}, {"score": 0.004237732785793817, "phrase": "r-dimensional_ancilla"}, {"score": 0.004072851768196397, "phrase": "dimensional_system"}, {"score": 0.00396075511616602, "phrase": "r-dimensional_ancilla_system"}, {"score": 0.0038651944848734133, "phrase": "present_paper"}, {"score": 0.0031348622158167195, "phrase": "minimal_ancilla"}, {"score": 0.0030062165552187086, "phrase": "constant_positive_number_c"}, {"score": 0.002892920908794289, "phrase": "d-assisted_discriminable"}, {"score": 0.002832928222306059, "phrase": "r-assisted_discriminable"}, {"score": 0.0024894376091589244, "phrase": "r-dimensional_system"}, {"score": 0.0022105600003496225, "phrase": "preliminary_step"}, {"score": 0.00217987162651941, "phrase": "role_ancilla_system"}, {"score": 0.0021049977753042253, "phrase": "power_kind_limit"}], "paper_keywords": ["superdense coding", " discrimination", " quantum gates", " ancilla system", " algebraic geometry"], "paper_abstract": "The intrinsic idea of superdense coding is to find as many gates as possible such that they can be perfectly discriminated. In this paper, we consider a basic scheme of discrimination of quantum gates, called ancilla-assisted discrimination, in which a set of quantum gates on a dimensional system are perfectly discriminated with assistance from an r-dimensional ancilla system. The main contribution of the present paper is two-fold: (1) The number of quantum gates that can be discriminated in this scheme is evaluated. We prove that any rd + 1 quantum gates cannot be perfectly discriminated with assistance from the ancilla, and there exist rd quantum gates which can be perfectly discriminated with assistance from the ancilla. (2) The dimensionality of the minimal ancilla, system is estimated. We prove that there exists a constant positive number c such that, for any k <= cr quantum gates, if they are d-assisted discriminable, then they are also r-assisted discriminable, and there are c'r (c' > c) different quantum gates which can be discriminated with a r-dimensional ancilla, but, they cannot be discriminated if the ancilla is reduced to an r-dimensional system. Thus, the order O(r) of the number of quantum gates that, can be discriminated with assistance from an r-dimensional ancilla is optimal. The results reported in this paper represent a preliminary step toward understanding the role ancilla system plays in discrimination of quantum gates as well as the power kind limit of superdense coding.", "paper_title": "ANCILLA-ASSISTED DISCRIMINATION OF QUANTUM GATES", "paper_id": "WOS:000273154700012"}