{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "k-partite_k-uniform"}, {"score": 0.004722038375317162, "phrase": "social_tagging_systems"}, {"score": 0.004630940727877092, "phrase": "flickr"}, {"score": 0.004402088928254543, "phrase": "social_tagging_system"}, {"score": 0.0034971932704828197, "phrase": "related_users"}, {"score": 0.003324203391715804, "phrase": "community_detection"}, {"score": 0.002956858061485755, "phrase": "k_different_types"}, {"score": 0.0028325548627901004, "phrase": "different_types"}, {"score": 0.0026609940110902666, "phrase": "efficient_compression"}, {"score": 0.002579140290642792, "phrase": "quality_function"}, {"score": 0.0024040357029838774, "phrase": "fast_community_detection_method"}, {"score": 0.00228499525153, "phrase": "art_techniques"}, {"score": 0.0021215125099937663, "phrase": "existing_methods"}], "paper_keywords": ["community detection", " bipartite graph", " tripartite hypergraph", " clustering", " social tagging"], "paper_abstract": "In social tagging systems such as Delicious and Flickr, users collaboratively manage tags to annotate resources. Naturally, a social tagging system can be modeled as a (user, tag, resource) hypernetwork, where there are three different types of nodes, namely users, resources and tags, and each hyperedge has three end nodes, connecting a user, a resource and a tag that the user employs to annotate the resource. Then how can we automatically cluster related users, resources and tags, respectively? This is a problem of community detection in a 3-partite, 3-uniform hypernetwork. More generally, given a K-partite K-uniform (hyper)network, where each (hyper)edge is a K-tuple composed of nodes of K different types, how can we automatically detect communities for nodes of different types? In this paper, by turning this problem into a problem of finding an efficient compression of the (hyper)network's structure, we propose a quality function for measuring the goodness of partitions of a K-partite K-uniform (hyper)network into communities, and develop a fast community detection method based on optimization. Our method overcomes the limitations of state of the art techniques and has several desired properties such as comprehensive, parameter-free, and scalable. We compare our method with existing methods in both synthetic and real-world datasets.", "paper_title": "Detecting Communities in K-Partite K-Uniform (Hyper)Networks", "paper_id": "WOS:000297212300004"}