{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "grid_service"}, {"score": 0.004751216062917875, "phrase": "scalable_decision_tree_construction"}, {"score": 0.004415395176043526, "phrase": "predictive_learning_function"}, {"score": 0.004299228562179176, "phrase": "data_object"}, {"score": 0.004048860957751714, "phrase": "novel_decision-tree-based_classification_service"}, {"score": 0.00378767277402891, "phrase": "building_block"}, {"score": 0.003543273649210823, "phrase": "data_repositories"}, {"score": 0.003451051320485506, "phrase": "grid"}, {"score": 0.0029988599391845517, "phrase": "well-studied_problem"}, {"score": 0.002900426826591769, "phrase": "classification_methods"}, {"score": 0.0024875444192203485, "phrase": "grid_resources"}, {"score": 0.002250415129116109, "phrase": "gridminer_framework"}, {"score": 0.0021049977753042253, "phrase": "prototype_implementation"}], "paper_keywords": [""], "paper_abstract": "Classification deals with discovery of a predictive learning function that classifies a data object into one of several predefined classes. We present a novel decision-tree-based classification service which can be used either autonomously or as a building block to construct distributed and scalable classifiers that operate on data repositories integrated into the Grid that typically involve large, complex, heterogeneous, and geographically distributed datasets. Although classification is considered as a well-studied problem - a lot of classification methods were proposed for sequential, parallel and distributed environments, so far, to our best knowledge, no effort was devoted to building classifiers based on federation of Grid resources. The Grid service described in this paper was fully implemented and integrated into the GridMiner framework (www.gridminer.org). Scalability and performance of the prototype implementation have been examined and the results are presented.", "paper_title": "Development of a grid service for scalable decision tree construction from grid databases", "paper_id": "WOS:000238107100074"}