{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "computational_effects"}, {"score": 0.004677372885331908, "phrase": "subtle_generalisation"}, {"score": 0.00450000390667755, "phrase": "finite_products"}, {"score": 0.0043713857434347254, "phrase": "modelling_environments"}, {"score": 0.004329331617724, "phrase": "call-by-value_programming_languages"}, {"score": 0.004225950334493496, "phrase": "computational_lambda-calculus"}, {"score": 0.0038179283509963695, "phrase": "countable_lawvere_theory"}, {"score": 0.0036730297909962142, "phrase": "countable_arity_subject"}, {"score": 0.003399466007862412, "phrase": "closed_freyd-categories"}, {"score": 0.0033182152378613767, "phrase": "free_cocompletions"}, {"score": 0.003070996252787868, "phrase": "kleisli_category"}, {"score": 0.0021670777282518424, "phrase": "probabilistic_nondeterminism"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Freyd-category", " enriched Yoneda embedding", " conical colimit completion", " canonical model"], "paper_abstract": "A Freyd-category is a subtle generalisation of the notion of a category with finite products. It is suitable for modelling environments in call-by-value programming languages, such as the computational lambda-calculus, with computational effects. We develop the theory of Freyd-categories with that in mind. We first show that any countable Lawvere theory, hence any signature of operations with countable arity subject to equations, directly generates a Freyd-category. We then give canonical, universal embeddings of Freyd-categories into closed Freyd-categories, characterised by being free cocompletions. The combination of the two constructions sends a signature of operations and equations to the Kleisli category for the monad on the category Set generated by it, thus refining the analysis of computational effects given by monads. That in turn allows a more structural analysis of the lambda(c)-calculus. Our leading examples of signatures arise from side-effects, interactive input/output and exceptions. We extend our analysis to an enriched setting in order to account for recursion and for computational effects and signatures that inherently involve it, such as partiality, nondeterminism and probabilistic nondeterminism. (C) 2006 Elsevier B.V. All rights reserved.", "paper_title": "Generic models for computational effects", "paper_id": "WOS:000241871700007"}