{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "joint_word-image_embeddings"}, {"score": 0.004312622975366672, "phrase": "possible_annotations"}, {"score": 0.0041825926310470616, "phrase": "strongly_performing_method"}, {"score": 0.0038154673253945003, "phrase": "ranked_list"}, {"score": 0.0036107898615445797, "phrase": "low-dimensional_joint_embedding_space"}, {"score": 0.002985988377995789, "phrase": "interpretable_model"}, {"score": 0.0028958411976400646, "phrase": "alternate_spellings"}, {"score": 0.002860546817196148, "phrase": "even_languages"}, {"score": 0.0027741761880779535, "phrase": "embedding_space"}, {"score": 0.0025148871904409095, "phrase": "human_labeler"}, {"score": 0.0024389277933858054, "phrase": "similar_annotations"}, {"score": 0.0021049977753042253, "phrase": "excellent_results"}], "paper_keywords": ["Large scale", " Image annotation", " Learning to rank", " Embedding"], "paper_abstract": "Image annotation datasets are becoming larger and larger, with tens of millions of images and tens of thousands of possible annotations. We propose a strongly performing method that scales to such datasets by simultaneously learning to optimize precision at k of the ranked list of annotations for a given image and learning a low-dimensional joint embedding space for both images and annotations. Our method both outperforms several baseline methods and, in comparison to them, is faster and consumes less memory. We also demonstrate how our method learns an interpretable model, where annotations with alternate spellings or even languages are close in the embedding space. Hence, even when our model does not predict the exact annotation given by a human labeler, it often predicts similar annotations, a fact that we try to quantify by measuring the newly introduced \"sibling\" precision metric, where our method also obtains excellent results.", "paper_title": "Large scale image annotation: learning to rank with joint word-image embeddings", "paper_id": "WOS:000280845700003"}