{"auto_keywords": [{"score": 0.034366055928555655, "phrase": "frameself"}, {"score": 0.00481495049065317, "phrase": "machine-to-machine_systems"}, {"score": 0.004408729661992651, "phrase": "heterogeneous_machines"}, {"score": 0.00379914165379475, "phrase": "increasing_complexity"}, {"score": 0.0035953368057880593, "phrase": "autonomic_computing_paradigm"}, {"score": 0.003459191419478298, "phrase": "promising_solution"}, {"score": 0.0029641011108505785, "phrase": "communication_modules"}, {"score": 0.002915437843874821, "phrase": "service-oriented_and_event-driven_communication_patterns"}, {"score": 0.0027437235598539904, "phrase": "generic_and_extensible_control_loop_components_diagram"}, {"score": 0.0025257081555100556, "phrase": "ontology_models"}, {"score": 0.0023900527169254744, "phrase": "smart_metering_use_case"}, {"score": 0.002312174113289583, "phrase": "proposed_approach"}, {"score": 0.0021049977753042253, "phrase": "john_wiley"}], "paper_keywords": ["autonomic computing", " self-management", " self-configuration", " machine-to-machine", " semantic", " ontology", " graph"], "paper_abstract": "Machine-to-machine (M2M) systems need to connect thousands of heterogeneous machines that are widely distributed and frequently evolve according to their environment changes. Keeping such systems alive is costly in terms of time and money. The increasing complexity of M2M communications places M2M development and research under strain. Autonomic computing paradigm is widely believed to be a promising solution to self-manage this complexity. This paper proposes FRAMESELF, an ontology-based framework designed for the self-configuration of M2M communications. A variety of communication modules based on service-oriented and event-driven communication patterns is dynamically selected and configured in deployment plans. A generic and extensible control loop components diagram detailing the monitoring, analyzing, planning, and executing processes are provided. Ontology models describing the M2M architecture and M2M communication patterns are proposed. A smart metering use case is experimented to validate the proposed approach and to calculate the overload generated by FRAMESELF facing scalability. Copyright (c) 2013 John Wiley & Sons, Ltd.", "paper_title": "FRAMESELF: an ontology-based framework for the self-management of machine-to-machine systems", "paper_id": "WOS:000351683600004"}