{"auto_keywords": [{"score": 0.037435605839501174, "phrase": "new_broker"}, {"score": 0.011876027617547183, "phrase": "broker-placement_algorithm"}, {"score": 0.00481495049065317, "phrase": "latency-aware_peer-to-peer_networks"}, {"score": 0.004311809215875557, "phrase": "shared_resources"}, {"score": 0.004167795561137289, "phrase": "internode_latency"}, {"score": 0.003721470218011247, "phrase": "broker's_location"}, {"score": 0.0035869274480340727, "phrase": "suitable_location"}, {"score": 0.0032760377953971248, "phrase": "overlay_network"}, {"score": 0.0032208091960514128, "phrase": "euclidean_space_r-d"}, {"score": 0.003148612096891635, "phrase": "optimization_problem"}, {"score": 0.0031131208154718867, "phrase": "suitable_region"}, {"score": 0.003026127736667187, "phrase": "equivalent_broker_locations"}, {"score": 0.002975099633631871, "phrase": "suitable_regions"}, {"score": 0.0028837660125643127, "phrase": "worst-case_complexity"}, {"score": 0.002671263324230699, "phrase": "linear_factor"}, {"score": 0.00261876742054173, "phrase": "simple_optimization"}, {"score": 0.0025383451160985488, "phrase": "linear_function"}, {"score": 0.0024673738215365104, "phrase": "linear_complexity"}, {"score": 0.0023780623297398576, "phrase": "real_dataset"}, {"score": 0.0022725559033018572, "phrase": "naive_approach"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["peer-to-peer", " resource brokerage", " broker-placement", " content delivery network"], "paper_abstract": "In large peer-to-peer (P2P) overlay networks, nodes usually share resources to support all kinds of applications. In such networks, a subset of the nodes may assume the role of broker in order to act as intermediaries for finding the shared resources. When some notion of distance between nodes such as the internode latency is defined, a brokers may be responsible for maintaining information about resources shared by a group of nodes that are close to each other, with the set of nodes assigned to a broker being determined by the broker's location. In this paper, we present a broker-placement algorithm that finds a suitable location for a new broker when some broker is overloaded in such a way that some of the nodes are reassigned from the overloaded to the new broker. With latency as a metric, an overlay network can be embedded in an Euclidean space R-d, and our algorithm amounts to an optimization problem of selecting a suitable region in R-d for broker-placement, where a region represents equivalent broker locations. Our algorithm guarantees that if suitable regions exist, one of them will be found. The worst-case complexity of the algorithm is O(n(d)+1) with n the number of nodes that may be assigned to the new broker, which is optimal up to a linear factor in n. We further show a simple optimization that brings down the complexity of the algorithm to a linear function of n in most of the cases. The linear complexity of the broker-placement algorithm is confirmed in a series of experiments on a real dataset. In addition, the performance of our broker-placement algorithm is compared to the performance of a naive approach, and it turns out that in a system with one million servers and one hundred brokers, our broker-placement algorithm is roughly 150 times more efficient. (C) 2008 Elsevier B.V. All rights reserved.", "paper_title": "Broker-placement in latency-aware peer-to-peer networks", "paper_id": "WOS:000256133200006"}