{"auto_keywords": [{"score": 0.04825951763801121, "phrase": "distributed_systems"}, {"score": 0.011513928076735921, "phrase": "aosd"}, {"score": 0.008713768692145006, "phrase": "dynamic_separation"}, {"score": 0.005795617916478875, "phrase": "security_measures"}, {"score": 0.004732785510739708, "phrase": "distributed_systems_security"}, {"score": 0.00467207889925365, "phrase": "case_study"}, {"score": 0.004106063237069123, "phrase": "complex_issue"}, {"score": 0.003546722347907148, "phrase": "dynamic_aspect-oriented_software_development"}, {"score": 0.0034562118159899772, "phrase": "security_mechanisms"}, {"score": 0.0030239842475439814, "phrase": "global_security"}, {"score": 0.0029089095588612007, "phrase": "distributed_system"}, {"score": 0.002726740692380339, "phrase": "dynamic_and_static_aspect"}, {"score": 0.0023447155524245655, "phrase": "proposed_approach"}, {"score": 0.0022848092812445533, "phrase": "real_client-server_ftp_scenario"}, {"score": 0.0021049977753042253, "phrase": "dynamic_aosd"}], "paper_keywords": [""], "paper_abstract": "Distributed systems are commonly required to be flexible and scalable, as the number and arrangement of their (potentially mobile) devices may easily change. Security in distributed systems is a complex issue which can produce several problems such as eavesdropping, phishing or denial of service. To overcome these problems, there are various security measures that can be applied. This study proposes the use of dynamic aspect-oriented software development (AOSD) to implement security mechanisms in distributed systems. By applying dynamic separation of concerns using AOSD, it becomes possible to adapt the security measures of distributed systems, even when their sizes and arrangements change, without compromising global security. These changes can be applied when a distributed system is running, without requiring its execution to be stopped or interrupted. Using the dynamic and static aspect weaving AOSD platform, the authors have implemented solutions for two common security problems in distributed systems: (i) access control and data flow and (ii) encryption of transmissions. Moreover, the proposed approach has been tested in a real client-server FTP scenario. Qualitative and quantitative evaluations of both implementations are presented to estimate the pros and cons of using dynamic AOSD in the development of security measures of distributed systems.", "paper_title": "Applying dynamic separation of aspects to distributed systems security: a case study", "paper_id": "WOS:000305999700008"}