{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "sample_size"}, {"score": 0.01978685124257846, "phrase": "control_charts"}, {"score": 0.0073112129610428, "phrase": "multistage_processes"}, {"score": 0.0068744099785468474, "phrase": "pca"}, {"score": 0.00655216836690347, "phrase": "statistical_control"}, {"score": 0.006020968181228017, "phrase": "kaya"}, {"score": 0.004578510081616263, "phrase": "today's_production_systems"}, {"score": 0.004423963064490547, "phrase": "customer's_and_engineering's_specifications"}, {"score": 0.004294230219430314, "phrase": "process_capability_analysis"}, {"score": 0.004225950334493496, "phrase": "summary_statistic"}, {"score": 0.004187419762708219, "phrase": "process_performance"}, {"score": 0.003979216115454048, "phrase": "proposed_model"}, {"score": 0.003954406098510762, "phrase": "process_control"}, {"score": 0.003725764777417227, "phrase": "engin"}, {"score": 0.003575237685870024, "phrase": "attributes_control_chart"}, {"score": 0.003518349658067059, "phrase": "engine_piston_manufacturing_process"}, {"score": 0.0034862481266528427, "phrase": "materials_processing_technology"}, {"score": 0.003407265514532704, "phrase": "minimum_cost"}, {"score": 0.0033916842941333174, "phrase": "maximum_acceptance_probability"}, {"score": 0.003345365412288976, "phrase": "attribute_control_charts"}, {"score": 0.003239725108882075, "phrase": "genetic_algorithms"}, {"score": 0.0032028078062360243, "phrase": "linear_real-valued_representation"}, {"score": 0.0031808590136627505, "phrase": "new_chromosome_structure"}, {"score": 0.0030452901752704865, "phrase": "crossover_operators"}, {"score": 0.0029830992938695033, "phrase": "five_different_mutation"}, {"score": 0.002862490912619878, "phrase": "computer_program"}, {"score": 0.0028363564238441086, "phrase": "ms_visual_basic"}, {"score": 0.0027784204938480985, "phrase": "suitable_operators"}, {"score": 0.0025117317319076895, "phrase": "pca."}, {"score": 0.0024435322199851876, "phrase": "motor_engine_factory"}, {"score": 0.002415665703348571, "phrase": "quality_characteristics"}, {"score": 0.002377184392392445, "phrase": "numerical_form"}, {"score": 0.0023073342853439935, "phrase": "numerical_scales"}], "paper_keywords": ["Process control", " Genetic algorithms", " u-Control chart", " x - R control charts", " Process capability"], "paper_abstract": "Generally today's production systems consist of multistage processes. Control of these processes is a very important to meet customer's and engineering's specifications. Generally control charts which are used to monitor the process and process capability analysis (PCA) which is a summary statistic to show the process performance are used to determine whether or not the process is in statistical control and meet specifications. Although control charts have been applied in very large area of process control, determining the sample size for control charts is generally a problem. In the literature many techniques to solve this problem have been executed. Kaya and Engin [Kaya, i. & Engin, O. 2007. A new approach to define sample size at attributes control chart in multistage processes: An application in engine piston manufacturing process. Journal of Materials Processing Technology, 183,38-48] also proposed a model based on minimum cost and maximum acceptance probability to determine the sample size in Attribute Control Charts (ACCs). In this paper, this model is solved by Genetic Algorithms (GAs) with linear real-valued representation and a new chromosome structure is suggested to increase the efficiency of GAs. The performance of GAs is affected by mutation and crossover operators and their ratios. To determine the most appropriate operators, five different mutation and crossover operators are used and they are compared with each other, For this purpose a computer program is coded by MS Visual Basic and it has been run to determine the suitable operators and ratios, respectively. One of the results of the model is sample size, n, and it is suggested to set up ACCs and Variable Control Charts (VCCs). Also the sample size, n, is used to PCA. To show the usage of the proposed model an application from a motor engine factory is illustrated. For quality characteristics cannot be easily represented in numerical form, \"u-control charts\" and for characteristics measurable on numerical scales, \"(x) over bar - R control charts\" are constructed for every stage by taking into account the sample size, n, determined by GAs from the proposed model. These control charts are used to determine whether or not the every stage is in statistical control. Then PCA has been executed for every stage and capability ratios are determined. (c) 2008 Elsevier Ltd. All rights reserved.", "paper_title": "A genetic algorithm approach to determine the sample size for control charts with variables and attributes (Retracted article. See vol. 39, pg. 4633, 2012)", "paper_id": "WOS:000264782800002"}