{"auto_keywords": [{"score": 0.04660802533264657, "phrase": "input_table"}, {"score": 0.005444816969085806, "phrase": "sensitive_attribute"}, {"score": 0.00481495049065317, "phrase": "personal_data"}, {"score": 0.0047049532961375, "phrase": "increasingly_important_problem"}, {"score": 0.004677847043645765, "phrase": "different_fields"}, {"score": 0.00461075951152053, "phrase": "different_interesting_approaches"}, {"score": 0.004544629724830453, "phrase": "i.e._k-anonymity"}, {"score": 0.00435185229819578, "phrase": "computed_partition"}, {"score": 0.0038210283935447473, "phrase": "i-diversity_problem"}, {"score": 0.003701401653850141, "phrase": "sensitive_attributes"}, {"score": 0.003680055701720573, "phrase": "quasi-identifier_attributes"}, {"score": 0.003513645211548667, "phrase": "set_c"}, {"score": 0.003066945490483524, "phrase": "factor_c"}, {"score": 0.0027555028011388033, "phrase": "exactly_three_columns"}, {"score": 0.0027080590887226517, "phrase": "approximation_algorithm"}, {"score": 0.0026924262536607915, "phrase": "factor_m"}, {"score": 0.0025117070259621376, "phrase": "constant_size"}, {"score": 0.0024827861706195765, "phrase": "parameterized_complexity"}, {"score": 0.002237000206023246, "phrase": "fixed-parameter_algorithm"}, {"score": 0.0022048406330100697, "phrase": "different_values"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["l-Diversity", " k-Anonymity", " Approximation complexity", " Parameterized complexity"], "paper_abstract": "Publishing personal data without giving up privacy is becoming an increasingly important problem in different fields. In the last years, different interesting approaches have been proposed, i.e. k-Anonymity and l-Diversity. Given an input table, these approaches partition its rows so that the computed partition satisfies some constraint, in order to prevent the inference of the individuals the data belong to. Then, the rows in a same set of the partition are related to the same rows by suppressing some of their entries. Here we focus on the I-Diversity problem, where the attributes of the input table are distinguished in sensitive attributes and quasi-identifier attributes. The goal is to partition the rows of the input table, so that each set C of the partition contains at most 1/l vertical bar C vertical bar rows having a specific value in the sensitive attribute, and the number of suppressions is minimized. In this paper we investigate the approximation and parameterized complexity of I-Diversity. First, we prove that the problem is not approximable within factor c in!, for some constant c > 0, even if the input table consists of only two columns, and that the problem is APX-hard, even if I = 4 and the input table contains exactly three columns. Then we give an approximation algorithm of factor m (where m + 1 is the number of columns in the input table), when the sensitive attribute ranges over an alphabet of constant size. Concerning the parameterized complexity, we prove that the problem is W[1]-hard when parameterized by the cost-bound, by l, and by the size of the alphabet. Then we prove that the problem admits a fixed-parameter algorithm when both the maximum number of different values in a column and the number of columns are parameters. (C) 2012 Elsevier B.V. All rights reserved.", "paper_title": "The l-Diversity problem: Tractability and approximability", "paper_id": "WOS:000327827100015"}