{"auto_keywords": [{"score": 0.029188827492907903, "phrase": "session_initiation_protocol"}, {"score": 0.004718431349852634, "phrase": "mobile_signatures"}, {"score": 0.004567990533989851, "phrase": "mobile_services"}, {"score": 0.004512814529823301, "phrase": "electronic_signatures"}, {"score": 0.004440277230269978, "phrase": "mobile_payments"}, {"score": 0.004404445045826858, "phrase": "mobile_business_transactions"}, {"score": 0.0043512358455892, "phrase": "mobile_government_services"}, {"score": 0.004298666679374568, "phrase": "mobile_signature_service"}, {"score": 0.004012500850311087, "phrase": "electronic_signature"}, {"score": 0.00386876598761639, "phrase": "handwritten_signature"}, {"score": 0.003107935254560724, "phrase": "mobile_network_operators"}, {"score": 0.0030086877092638945, "phrase": "efficient_communications"}, {"score": 0.0029008064765926414, "phrase": "new_mss"}, {"score": 0.002877361619893651, "phrase": "sipmsign"}, {"score": 0.0026423134393535243, "phrase": "secure_and_more_efficient_way"}, {"score": 0.0024461989110005447, "phrase": "new_generation"}, {"score": 0.0024264193359373977, "phrase": "mobile_communications"}, {"score": 0.0021049977753042253, "phrase": "john_wiley"}], "paper_keywords": ["nonrepudiation", " mobile signature service", " presence awareness", " e-commerce", " mobile signature", " SIP", " instant messaging"], "paper_abstract": "The development of mobile signatures could increase the spread and adoption of mobile services based on electronic signatures, such as mobile payments, mobile business transactions, and mobile government services. A Mobile Signature Service (MSS) means that a user in any of the scenarios mentioned can attach an electronic signature, anywhere, anytime, as with a handwritten signature with a device that is almost always on him or her. Several solutions have appeared, such as using the European Telecommunications Standard Institute MSS, the Mobile Signature Application Unit, and the Mobile Network Operator-independent MSS. These solutions present two kinds of drawbacks. On the one hand, some of them require the service to be developed by all mobile network operators, whereas others are not based on efficient communications. In this paper, we present a new MSS named SIPmsign that solves these problems. Our proposal is based on the Session Initiation Protocol and defines how to exchange the information in a secure and more efficient way than previously. Thanks to Session Initiation Protocol, we provide the adoption of our proposal as a MSS for the new generation of mobile communications. In this paper, we also present the prototype we have developed as a proof of its feasibility as well as an evaluation of the performance of our solution. Copyright (c) 2012 John Wiley & Sons, Ltd.", "paper_title": "SIPmsign: a lightweight mobile signature service based on the Session Initiation Protocol", "paper_id": "WOS:000333915400002"}