{"auto_keywords": [{"score": 0.029702396872572714, "phrase": "elderly_participants"}, {"score": 0.01691641366760666, "phrase": "young_participants"}, {"score": 0.009864030362701465, "phrase": "adult_participants"}, {"score": 0.004814973016326262, "phrase": "mouse"}, {"score": 0.00467577317322117, "phrase": "young"}, {"score": 0.0046365994233941495, "phrase": "adult"}, {"score": 0.004210114198411514, "phrase": "still_larger_parts"}, {"score": 0.003790751492305239, "phrase": "participants'_performance"}, {"score": 0.003574364535717202, "phrase": "integrated_analysis"}, {"score": 0.003138030910104256, "phrase": "submovement_structure"}, {"score": 0.0031117775337824853, "phrase": "cursor_trajectories"}, {"score": 0.003072807453368781, "phrase": "performance_differences"}, {"score": 0.0029463874016490976, "phrase": "young_and_elderly_participants"}, {"score": 0.0028370498057725796, "phrase": "complete_trials"}, {"score": 0.0026414426081951734, "phrase": "young_and_adult_participants"}, {"score": 0.0021953959824690316, "phrase": "intermediate_position"}, {"score": 0.0021049977753042253, "phrase": "submovement_measures"}], "paper_keywords": [""], "paper_abstract": "Effects of age on pointing performance have become increasingly important as computers have become extensively used by still larger parts of the population. This study empirically investigates young (12-14 years), adult (25-33 years), and elderly (61-69 years) participants' performance when pointing with mouse and touchpad. The goal is to provide an integrated analysis of (a) how these three age groups differ in pointing performance, (b) how these differences are affected by the two pointing devices, and (c) how the submovement structure of cursor trajectories may explain performance differences. Results show that adult participants perform better than both young and elderly participants in that adult participants make fewer errors than young participants and complete trials quicker than elderly participants. Moreover, young participants are quicker than elderly participants, who make neither more nor less errors than young and adult participants. All three age groups were slower and made more errors with the touchpad than the mouse, but the touchpad slowed down elderly participants more than young participants, who in turn were slowed down more than adult participants. Adult participants made more efficient submovements than elderly participants; young participants had an intermediate position in that they were similar to adult participants for some submovement measures and similar to elderly participants for others.", "paper_title": "How Age Affects Pointing With Mouse and Touchpad: A Comparison of Young, Adult, and Elderly Users", "paper_id": "WOS:000279219300003"}