{"auto_keywords": [{"score": 0.047232975924705364, "phrase": "question_types"}, {"score": 0.0293347651057261, "phrase": "answer_quality"}, {"score": 0.005751577025791601, "phrase": "speed_vary"}, {"score": 0.0051565447224824175, "phrase": "best_quality_answers"}, {"score": 0.005089387821233909, "phrase": "fastest_answers"}, {"score": 0.004936053263828571, "phrase": "answer_speed"}, {"score": 0.00481495049065317, "phrase": "analysis_of_answer_quality_and_answer_speed_in_community_question-answering_sites"}, {"score": 0.0044896599221451216, "phrase": "community_question-answering_sites"}, {"score": 0.004373398434399966, "phrase": "research_questions"}, {"score": 0.0031636612155559267, "phrase": "six_cqas"}, {"score": 0.0030148941188459987, "phrase": "significant_difference"}, {"score": 0.002835599469639296, "phrase": "significant_relationships"}, {"score": 0.002725994306480105, "phrase": "better_overall_answer_quality"}, {"score": 0.002287783663138828, "phrase": "subtle_nuances"}, {"score": 0.0021049977753042253, "phrase": "cqa_research"}], "paper_keywords": ["information resources management"], "paper_abstract": "The authors investigate the interplay between answer quality and answer speed across question types in community question-answering sites (CQAs). The research questions addressed are the following: (a) How do answer quality and answer speed vary across question types? (b) How do the relationships between answer quality and answer speed vary across question types? (c) How do the best quality answers and the fastest answers differ in terms of answer quality and answer speed across question types? (d) How do trends in answer quality vary over time across question types? From the posting of 3,000 questions in six CQAs, 5,356 answers were harvested and analyzed. There was a significant difference in answer quality and answer speed across question types, and there were generally no significant relationships between answer quality and answer speed. The best quality answers had better overall answer quality than the fastest answers but generally took longer to arrive. In addition, although the trend in answer quality had been mostly random across all question types, the quality of answers appeared to improve gradually when given time. By highlighting the subtle nuances in answer quality and answer speed across question types, this study is an attempt to explore a territory of CQA research that has hitherto been relatively uncharted.", "paper_title": "So fast so good: An analysis of answer quality and answer speed in community Question-answering sites", "paper_id": "WOS:000324100000007"}