{"auto_keywords": [{"score": 0.0456315961504987, "phrase": "relative_motion"}, {"score": 0.00481495049065317, "phrase": "consistent_hybrid_overset_mesh_methods"}, {"score": 0.0047568099917715, "phrase": "cfd."}, {"score": 0.004718431349852634, "phrase": "overset_mesh_method_chimera"}, {"score": 0.0046238380150870435, "phrase": "rotorcraft_research_community"}, {"score": 0.004458341083622865, "phrase": "cfd"}, {"score": 0.004195418010131832, "phrase": "helicopter_blades"}, {"score": 0.003916098498242888, "phrase": "overset_grids"}, {"score": 0.003884479830773329, "phrase": "cfd_codes"}, {"score": 0.003070340620983981, "phrase": "overset_mesh_localisation"}, {"score": 0.0029965060407413898, "phrase": "tree_search"}, {"score": 0.002936331371903168, "phrase": "high_efficiency"}, {"score": 0.0028425481299483254, "phrase": "overlapping_cells"}, {"score": 0.002578745296475411, "phrase": "parallel_execution"}, {"score": 0.002456148932305311, "phrase": "simple_aerofoils"}, {"score": 0.002436289099444074, "phrase": "rotor-body_interaction"}, {"score": 0.0022923586577645143, "phrase": "low_cpu_overhead"}, {"score": 0.0021049977753042253, "phrase": "john_wiley"}], "paper_keywords": ["overset mesh", " chimera method", " rotor flow", " rotor", " fuselage"], "paper_abstract": "The overset mesh method chimera is popular within the rotorcraft research community, because the use of multiple, non-matching grids make the CFD simulations of bodies in relative motion much simpler. Consequently, the relative motion between the helicopter blades and fuselage can be accurately accounted for. In this paper, the method for treating overset grids within CFD codes is presented. It is compatible with multi-block, structured-grid solvers. The proposed method is based on hierarchy of overset, non-matching grids, whose cells are automatically identified as computational or non-computational and localised with respect to all grids they overlap with. The efficiency of the method relies on the hierarchical, multi-step approach, for the overset mesh localisation and the use of a tree search. Because of the high efficiency of the algorithm, the search for overlapping cells can be carried out on-the-fly, during time-marching of the unsteady, implicit CFD solver. In addition, the algorithm is suitable for parallel execution. The method has been demonstrated for several flows, ranging from simple aerofoils to rotor-body interaction. The paper presents and demonstrates the method and shows that it has a low CPU overhead. It also highlights the limitations of the method and suggests remedies for improvement. Copyright (c) 2013 John Wiley & Sons, Ltd.", "paper_title": "Towards consistent hybrid overset mesh methods for rotorcraft CFD", "paper_id": "WOS:000330656200001"}