{"auto_keywords": [{"score": 0.0475676066387456, "phrase": "clustered_points"}, {"score": 0.03359504673769545, "phrase": "density-connected_clusters"}, {"score": 0.02702392128984988, "phrase": "case_study"}, {"score": 0.00481495049065317, "phrase": "nearest-neighbour_method"}, {"score": 0.004776235281195212, "phrase": "cluster_features"}, {"score": 0.004750597411562959, "phrase": "overlaid_spatial_point_processes"}, {"score": 0.004612018044139003, "phrase": "higher_rate"}, {"score": 0.004477462979914181, "phrase": "lower_rate"}, {"score": 0.004197301239681007, "phrase": "point_clusters"}, {"score": 0.004096801696267917, "phrase": "spatial_point_process"}, {"score": 0.003830035994772447, "phrase": "spatial_clusters"}, {"score": 0.003648747692496864, "phrase": "automated_way"}, {"score": 0.003302511130068653, "phrase": "nn_method"}, {"score": 0.0027052262694643348, "phrase": "longest_lifetime"}, {"score": 0.0026618065353009, "phrase": "final_number"}, {"score": 0.0026120278905601693, "phrase": "seismic_example"}, {"score": 0.002590979439059358, "phrase": "west_part"}, {"score": 0.0025771988513059283, "phrase": "china"}, {"score": 0.0024748609903955656, "phrase": "seismic_case_study"}, {"score": 0.002396034649574465, "phrase": "songpan_quake"}, {"score": 0.0022701845076460244, "phrase": "daguan_quake"}, {"score": 0.0021049977753042253, "phrase": "feature_clusters"}], "paper_keywords": ["nearest-neighbour", " feature", " noise", " cluster", " spatial point process", " poisson process", " spatial data mining"], "paper_abstract": "When two spatial point processes are overlaid, the one with the higher rate is shown as clustered points, and the other one with the lower rate is often perceived to be background. Usually, we consider the clustered points as feature and the background as noise. Revealing these point clusters allows us to further examine and understand the spatial point process. Two important aspects in discerning spatial cluster features from a set of points are the removal of noise and the determination of the number of spatial clusters. Until now, few methods were able to deal with these two aspects at the same time in an automated way. In this study, we combine the nearest-neighbour (NN) method and the concept of density-connected to address these two aspects. First, the removal of noise can be achieved using the NN method; then, the number of clusters can be determined by finding the density-connected clusters. The complexity for finding density-connected clusters is reduced in our algorithm. Since the number of clusters depends on the value of k (the kth nearest neighbour), we introduce the concept of lifetime for the number of clusters in order to measure how stable the segmentation results (or number of clusters) are. The number of clusters with the longest lifetime is considered to be the final number of clusters. Finally, a seismic example of the west part of China is used as a case study to examine the validity of our method. In this seismic case study, we discovered three seismic clusters: one as the foreshocks of the Songpan quake (M=7.2), and the other two as aftershocks related to the Kangding-Jiulong (M=6.2) quake and Daguan quake (M=7.1), respectively. Through this case study, we conclude that the approach we proposed is effective in removing noise and determining the number of feature clusters.", "paper_title": "A new approach to the nearest-neighbour method to discover cluster features in overlaid spatial point processes", "paper_id": "WOS:000234709900003"}