{"auto_keywords": [{"score": 0.04166379544500555, "phrase": "calibration_measurements"}, {"score": 0.0146607552075669, "phrase": "electric_fields"}, {"score": 0.011084302866845608, "phrase": "pem's_response"}, {"score": 0.009522679550213057, "phrase": "pem"}, {"score": 0.008705956121803056, "phrase": "interquartile_distance"}, {"score": 0.007958755944648588, "phrase": "numerical_simulations"}, {"score": 0.00481495049065317, "phrase": "personal_exposimeters"}, {"score": 0.004777392826700429, "phrase": "exposure_assessment"}, {"score": 0.00468476935399643, "phrase": "purpose_-_the_purpose"}, {"score": 0.004417487764326481, "phrase": "personal_exposimeter"}, {"score": 0.004298006360831255, "phrase": "global_system"}, {"score": 0.004264463695140275, "phrase": "mobile_communications"}, {"score": 0.0038969619124903884, "phrase": "real_human_subjects"}, {"score": 0.0038213431461094224, "phrase": "vfm"}, {"score": 0.0033183674218329904, "phrase": "vfm."}, {"score": 0.003241203549050267, "phrase": "anechoic_chamber"}, {"score": 0.0031658283119347396, "phrase": "real_pem"}, {"score": 0.0028365413717574544, "phrase": "incident_electric_fields"}, {"score": 0.00268493828558848, "phrase": "confidence_interval"}, {"score": 0.0024436119167523156, "phrase": "realistic_environment"}, {"score": 0.0023680783509308525, "phrase": "interquartile_distances"}, {"score": 0.002285883886723896, "phrase": "excellent_agreement"}], "paper_keywords": ["Uncertainty estimation", " Electromagnetics", " Finite difference time-domain analysis"], "paper_abstract": "Purpose - The purpose of this paper is to numerically determine the distribution of electric fields registered by a personal exposimeter (PEM) used for the Global System for Mobile Communications (GSM) around 900 MHz (GSM900) downlink (DL) band and compare these with calibration measurements of PEMs worn by real human subjects. Design/methodology/approach - Numerical simulations using the Virtual Family Male (VFM) are carried out at 950 MHz in order to determine the electric fields surrounding the phantom in realistic, far-field environments. These electric fields can be used to determine the distribution of a PEM's response when worn by the VFM. Simultaneously, calibration measurements in an anechoic chamber are carried out using a real PEM worn by two different subjects, in order to determine the PEM's response experimentally. Findings - Both the numerical simulations and the measurements show that a PEM will on average underestimate the incident electric fields in the GSM900 DL band and that the variation (expressed in terms of the 95 percent confidence interval and the interquartile distance) on its response is relatively large: a 95 percent confidence interval of 22 dB and an interquartile distance of 7.3 dB are found in a realistic environment using numerical simulations, while the calibration measurements show interquartile distances up to 12 dB. In terms of variation there is an excellent agreement between simulations and measurements. Originality/value - This paper proves that numerical simulations may be used as a replacement for the more time-and work-consuming calibration measurements if the variation of a PEM's response is studied.", "paper_title": "Response of personal exposimeters for exposure assessment in the GSM900 downlink band", "paper_id": "WOS:000359046300008"}