{"auto_keywords": [{"score": 0.04274518365190482, "phrase": "target_object"}, {"score": 0.013829634346892125, "phrase": "tag_recommendation_problem"}, {"score": 0.012068231255109177, "phrase": "personalized_tag_recommendation"}, {"score": 0.004814957641979566, "phrase": "personalized"}, {"score": 0.004599442248720121, "phrase": "better_organization"}, {"score": 0.004553878304024706, "phrase": "shared_content"}, {"score": 0.0045357787854931894, "phrase": "tag_recommendation_methods"}, {"score": 0.004419864931421362, "phrase": "available_information"}, {"score": 0.004298330938529755, "phrase": "content_recommendation"}, {"score": 0.004188459638572375, "phrase": "first_perspective"}, {"score": 0.004105850229681625, "phrase": "relevant_tags"}, {"score": 0.003929777057504885, "phrase": "multiple_textual_features"}, {"score": 0.0037988893085286403, "phrase": "tag_relevance"}, {"score": 0.003776246476928788, "phrase": "second_perspective"}, {"score": 0.003550000818015216, "phrase": "user_interests"}, {"score": 0.003500812175550438, "phrase": "new_heuristic_methods"}, {"score": 0.0034180637905376504, "phrase": "new_metrics"}, {"score": 0.003377423486227778, "phrase": "candidate_tag"}, {"score": 0.0032844591693053766, "phrase": "genetic_programming"}, {"score": 0.0032714745346157093, "phrase": "gp"}, {"score": 0.003251879424383452, "phrase": "random_forest"}, {"score": 0.00320680824403285, "phrase": "ranking_functions"}, {"score": 0.003187683149449344, "phrase": "multiple_metrics"}, {"score": 0.0030999252319430953, "phrase": "object-user_pair"}, {"score": 0.003069170309749213, "phrase": "proposed_methods"}, {"score": 0.0030205954878759693, "phrase": "bibsonomy"}, {"score": 0.003008570955580107, "phrase": "lastfm"}, {"score": 0.0029966182237617907, "phrase": "youtube"}, {"score": 0.002984665318717504, "phrase": "yahoovideo"}, {"score": 0.002960949949380656, "phrase": "object-centered_tag_recommendation"}, {"score": 0.0028169273848433064, "phrase": "single_dataset"}, {"score": 0.0027834145465170292, "phrase": "personalized_tag"}, {"score": 0.0027668075221608276, "phrase": "average_gains"}, {"score": 0.002717576981229933, "phrase": "similar_performance_gains"}, {"score": 0.0022845005591058914, "phrase": "better_descriptions"}, {"score": 0.002252806984976934, "phrase": "object-centered_recommendation"}, {"score": 0.0022127018991294047, "phrase": "suggested_tags"}, {"score": 0.002164650765821444, "phrase": "best_object-centered_strategy"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Tag recommendation", " Relevance metrics", " Personalization"], "paper_abstract": "Several Web 2.0 applications allow users to assign keywords (or tags) to provide better organization and description of the shared content. Tag recommendation methods may assist users in this task, improving the quality of the available information and, thus, the effectiveness of various tag-based information retrieval services, such as searching, content recommendation and classification. This work addresses the tag recommendation problem from two perspectives. The first perspective, centered at the object, aims at suggesting relevant tags to a target object, jointly exploiting the following three dimensions: (i) tag cooccurrences, (ii) terms extracted from multiple textual features (e.g., title, description), and (iii) various metrics to estimate tag relevance. The second perspective, centered at both object and user, aims at performing personalized tag recommendation to a target objectuser pair, exploiting, in addition to the three aforementioned dimensions, a metric that captures user interests. In particular, we propose new heuristic methods that extend state-of-the-art strategies by including new metrics that estimate how accurately a candidate tag describes the target object. We also exploit three learning-to-rank (L2R) based techniques, namely, RankSVM, Genetic Programming (GP) and Random Forest (RF), for generating ranking functions that exploit multiple metrics as attributes to estimate the relevance of a tag to a given object or object-user pair. We evaluate the proposed methods using data from four popular Web 2.0 applications, namely, Bibsonomy, LastFM, YouTube and YahooVideo. Our new heuristics for object-centered tag recommendation provide improvements in precision over the best state-of-the-art alternative of 12% on average (up to 20% in any single dataset), while our new heuristics for personalized tag recommendation produce average gains in precision of 121% over the baseline. Similar performance gains are also achieved in terms of other metrics, notably recall, Normalized Discounted Cumulative Gain (NDCG) and Mean-Reciprocal Rank (MRR). Further improvements, for both object-centered (up to 23% in precision) and personalized tag recommendation (up to 13% in precision), can also be achieved with our new L2R-based strategies, which are flexible and can be easily extended to exploit other aspects of the tag recommendation problem. Finally, we also quantify the benefits of personalized tag recommendation to provide better descriptions of the target object when compared to object-centered recommendation by focusing only on the relevance of the suggested tags to the object. We find that our best personalized method outperforms the best object-centered strategy, with average gains in precision of 10%. (C) 2014 Elsevier Ltd. All rights reserved.", "paper_title": "Personalized and object-centered tag recommendation methods for Web 2.0 applications", "paper_id": "WOS:000338822100003"}