{"auto_keywords": [{"score": 0.04948948915272368, "phrase": "mobile_apps"}, {"score": 0.007152368807539886, "phrase": "young_children"}, {"score": 0.004081385289516914, "phrase": "research_purpose"}, {"score": 0.003726533059542558, "phrase": "children's_engagement"}, {"score": 0.003560807940070886, "phrase": "qualitative_approach"}, {"score": 0.003516898780234098, "phrase": "young_children's_interactions"}, {"score": 0.0032780806856932423, "phrase": "observation_sessions"}, {"score": 0.0031582637043009562, "phrase": "participants'_interactions"}, {"score": 0.003030247482854539, "phrase": "thematic_approach"}, {"score": 0.0029928611380840757, "phrase": "children's_emergent_behaviours"}, {"score": 0.002755104031926742, "phrase": "children's_learning_engagement"}, {"score": 0.0022773309395419427, "phrase": "general_guidelines"}, {"score": 0.0022492129111567824, "phrase": "quality_mobile_apps"}, {"score": 0.0021579641460002523, "phrase": "library_use"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Interactive learning environments", " Multimedia/hypermedia systems", " Pedagogical issues", " Elementary education"], "paper_abstract": "This paper reports on situations in which children engage with mobile apps to better understand how they learn through such interaction. The following two research questions were postulated to address the research purpose: i) What are the conditions that engage children with mobile apps? ii) How does learning take place during children's engagement with mobile apps? The study was carried out using a qualitative approach by observing young children's interactions when using mobile apps. A total of 18 pre-schoolers aged 4 6 years participated in the study. The observation sessions were video-recorded to unobtrusively observe the participants' interactions with 20 selected mobile apps. The data were analysed using a thematic approach to examining children's emergent behaviours when engaging with mobile apps to identify, generate code, and produce themes. The findings demonstrated three prominent conditions of children's learning engagement: collective sensory skill, emotional expression, and verbal expression. It is evident from the study that learning in this environment takes place through cognitive, psychomotor-based, and affective means. This study provides significant insight on how young children engage with mobile apps to articulate their design implications as well as general guidelines for selecting quality mobile apps to encourage engagement in home, classroom, and library use. (C) 2015 Elsevier Ltd. All rights reserved.", "paper_title": "How do young children engage with mobile apps? Cognitive, psychomotor, and affective perspective", "paper_id": "WOS:000364253600031"}