{"auto_keywords": [{"score": 0.03566317662898919, "phrase": "non-dominated_paths"}, {"score": 0.029174417169021777, "phrase": "ce_algorithm"}, {"score": 0.025393678743129703, "phrase": "cpu_time"}, {"score": 0.011367229334453588, "phrase": "complete_enumeration_algorithm"}, {"score": 0.00481495049065317, "phrase": "bi-criteria_network_flow_problems"}, {"score": 0.004773692073488661, "phrase": "discrete-time_dynamic_networks"}, {"score": 0.004494570360108983, "phrase": "maximum_flow"}, {"score": 0.004417848254181138, "phrase": "shortest_path"}, {"score": 0.004361163586439822, "phrase": "dynamic_network"}, {"score": 0.003949974260471287, "phrase": "bi-criteria_network_problems"}, {"score": 0.003899269293218826, "phrase": "two-phased_exact_algorithm"}, {"score": 0.003592859432554987, "phrase": "time_functions"}, {"score": 0.0031166151196841308, "phrase": "computational_results"}, {"score": 0.0027861630854233693, "phrase": "solution_time"}, {"score": 0.0021416404045850224, "phrase": "greater_size_problems"}, {"score": 0.0021049977753042253, "phrase": "exponential_growth"}], "paper_keywords": ["bi-criteria network flow", " cross-entropy", " discrete-time"], "paper_abstract": "The present study tries to focus on the problem of finding the maximum flow along with the shortest path in a dynamic network. Networks basically state problems where the transfer is not instantaneous and time is required to traverse the arcs. For solving bi-criteria network problems, a two-phased exact algorithm and a cross-entropy (CE) algorithm based on bi-criteria are proposed, where the costs change as time functions. First, the two-phased complete enumeration algorithm was proposed to generate the non-dominated paths. Then, the efficiency and validation of the solutions generated by both the algorithms are compared. The computational results for 53 random instances showed that in problems with sizes of 50-300 nodes, the non-dominated paths obtained from the two algorithms are identical. The only difference is that the solution time of the CE algorithm is significantly less; however, for problems with more than 300 nodes, the non-dominated paths generated in the CE algorithm have sometimes a few path(s) less than the other one. In addition, the mean of the CPU time for the CE algorithm is about 0.073s, whereas the mean of the CPU time of the other algorithm is far more, about 200s. For greater size problems, CPU time has exponential growth compared with that of the complete enumeration algorithm.", "paper_title": "The cross-entropy method for solving bi-criteria network flow problems in discrete-time dynamic networks", "paper_id": "WOS:000356936400001"}