{"auto_keywords": [{"score": 0.031539476490019626, "phrase": "ladon"}, {"score": 0.00481495049065317, "phrase": "time-_and_energy-efficient_security_protocol"}, {"score": 0.0043258453436258405, "phrase": "ip_world"}, {"score": 0.004260134699483774, "phrase": "tiny_information_providers"}, {"score": 0.00411064950774695, "phrase": "internet-connected_party"}, {"score": 0.0038862297330905836, "phrase": "potential_attacker"}, {"score": 0.0036928221419965253, "phrase": "trustworthy_real-time_information"}, {"score": 0.0031521392193570846, "phrase": "low_capacity_devices"}, {"score": 0.0028170314398963704, "phrase": "targeted_environments"}, {"score": 0.0025433263646920364, "phrase": "obtained_results"}, {"score": 0.002367676766637248, "phrase": "high_packet_loss_rates"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": [""], "paper_abstract": "With the development of the 6LoWPAN standard, sensors can be natively integrated into the IP world, becoming tiny information providers that are directly addressable by any Internet-connected party. To protect the information gathered by sensors from any potential attacker on the Internet, it is essential to have trustworthy real-time information about the legitimacy of every attempt to interact with a sensor. Our approach to address this issue is Ladon, a new security protocol specifically tailored to the characteristics of low capacity devices. In this paper, we study the performance of Ladon, showing that it successfully meets the requirements of the targeted environments. To that end, we evaluate the delay and energy consumption of the execution of Ladon. The obtained results show that the cost of Ladon is bounded, even in situations of high packet loss rates (20-80%) and comparable to that of other protocols that implement fewer security features. (C) 2013 The Authors. Published by Elsevier Ltd. All rights reserved.", "paper_title": "Analytical evaluation of a time- and energy-efficient security protocol for IP-enabled sensors", "paper_id": "WOS:000334978500022"}