{"auto_keywords": [{"score": 0.04962913836247387, "phrase": "large_group_emergency_decision_making"}, {"score": 0.04596082065579115, "phrase": "exit_delegation_mechanism"}, {"score": 0.00481495049065317, "phrase": "exit-delegation_mechanism"}, {"score": 0.004658426838467567, "phrase": "lower_consensus"}, {"score": 0.004485735417293941, "phrase": "dynamical_consensus_method"}, {"score": 0.004100712177044264, "phrase": "large_group"}, {"score": 0.00406214911915987, "phrase": "small_groups"}, {"score": 0.0040049806975968145, "phrase": "preference_clustering_method"}, {"score": 0.0034920505103165403, "phrase": "emergency_decision_making"}, {"score": 0.003207173639414978, "phrase": "proximity_index"}, {"score": 0.0028766278519176355, "phrase": "decision-making_process"}, {"score": 0.0028360962841331634, "phrase": "delegation_mechanism"}, {"score": 0.0027307746993761035, "phrase": "trust_weights"}, {"score": 0.002641823250595624, "phrase": "feedback_mechanism"}, {"score": 0.0023470862747075228, "phrase": "consensus_criteria"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Decision making", " Consensus", " Exit-delegation mechanism", " Large group"], "paper_abstract": "Aiming at the lower consensus and the urgency of large group emergency decision making, a dynamical consensus method based on an exit delegation mechanism is proposed and investigated. Firstly, the method is initiated by transferring a large group into small groups via the preference clustering method. Then, the consistency and consensus measures are calculated and two different criteria are used to guide the consensus reaching process. In addition, considering the urgency of emergency decision making, an exit delegation mechanism is introduced to deal with clusters. When the consistency/consensus level is low, the proximity index of each cluster is computed. For the cluster whose proximity degree is lower than the threshold, it is advised to exit the decision-making process and a delegation mechanism is employed to reserve his influence by giving trust weights to other clusters. Meantime, a feedback mechanism is developed to give advice to clusters whose preferences should be subject to change, and to obtain a solution which satisfies the consistency and consensus criteria simultaneously. Finally, a case is taken to verify the rationality and feasibility of the method. (C) 2015 Elsevier B.V. All rights reserved.", "paper_title": "A dynamical consensus method based on exit-delegation mechanism for large group emergency decision making", "paper_id": "WOS:000359887400019"}