{"auto_keywords": [{"score": 0.023760874227797622, "phrase": "virology"}, {"score": 0.004574247691703376, "phrase": "researchers'_productivity"}, {"score": 0.004199406257273994, "phrase": "collaboration_patterns"}, {"score": 0.004128192012388041, "phrase": "collaborators'_characters"}, {"score": 0.003989351600022163, "phrase": "different_career_stages"}, {"score": 0.0038114397487574838, "phrase": "establishment_career_stages"}, {"score": 0.0034789831290103967, "phrase": "productivity_varies"}, {"score": 0.0024281181691350085, "phrase": "individual_scientists"}, {"score": 0.0023064582783867645, "phrase": "experimental_disciplines"}, {"score": 0.002254357921422124, "phrase": "organic_chemistry"}, {"score": 0.0021784009230363627, "phrase": "stronger_correlation"}, {"score": 0.0021413855297794946, "phrase": "theoretical_ones"}, {"score": 0.0021049977753042253, "phrase": "mathematics_and_computer_science"}], "paper_keywords": ["Collaboration", " Productivity", " Academic career age"], "paper_abstract": "Collaboration is believed to be influential on researchers' productivity. However, the impact of collaboration relies on factors such as disciplines, collaboration patterns, and collaborators' characters. In addition, at different career stages, such as the growth or the establishment career stages of scientists, collaboration is different in scale and scope, and its effect on productivity varies. In this paper, we study the relationships between collaboration and productivity in four disciplines, Organic Chemistry, Virology, Mathematics and Computer Science. Our studyfound that the productivity is correlated with collaboration in general, but the correlation could be positive or negative on the basis of which aspect of collaboration to measure, i.e., the scale or scope of the collaboration. The correlation becomes stronger as individual scientists progress through various stages of their career. Furthermore, experimental disciplines, such as Organic Chemistry and Virology, have shown stronger correlation coefficients than theoretical ones such as Mathematics and Computer Science.", "paper_title": "How are collaboration and productivity correlated at various career stages of scientists?", "paper_id": "WOS:000343609900039"}