{"auto_keywords": [{"score": 0.04451613018545648, "phrase": "np"}, {"score": 0.011586621975855313, "phrase": "single_agent"}, {"score": 0.010958021695017488, "phrase": "stv"}, {"score": 0.004776484866276242, "phrase": "simple_mechanism"}, {"score": 0.0046879169243805785, "phrase": "multiple_agents"}, {"score": 0.004396483086226026, "phrase": "computational_complexity"}, {"score": 0.004134137523409649, "phrase": "different_voting_rules"}, {"score": 0.004112075406940072, "phrase": "how-ever_np-hardness"}, {"score": 0.004068302313449334, "phrase": "worst-case_complexity"}, {"score": 0.0040465901036133975, "phrase": "recent_theoretical_results"}, {"score": 0.0038563012220659827, "phrase": "empirical_studies"}, {"score": 0.0036749275625321855, "phrase": "complexity_results"}, {"score": 0.0035682984566721915, "phrase": "unweighted_votes"}, {"score": 0.0034926916198124484, "phrase": "weighted_votes"}, {"score": 0.00340954056723008, "phrase": "first_case"}, {"score": 0.0033732206350186086, "phrase": "single_transferable"}, {"score": 0.003292904448034129, "phrase": "second_case"}, {"score": 0.0029425839831784765, "phrase": "harder_voting_rules"}, {"score": 0.0028956688212141207, "phrase": "multiple_rounds"}, {"score": 0.0028494995146217754, "phrase": "veto_voting"}, {"score": 0.0028115863316685937, "phrase": "simplest_representatives"}, {"score": 0.0027965622831515463, "phrase": "voting_rules"}, {"score": 0.0027008385562908425, "phrase": "weighted_agents"}, {"score": 0.0021679951725168565, "phrase": "computational_difficulty"}, {"score": 0.002156402793481102, "phrase": "computing_manipulations"}, {"score": 0.0021049977753042253, "phrase": "even_a_single_uncorrelated_voter"}], "paper_keywords": [""], "paper_abstract": "Voting is a simple mechanism to combine together the preferences of multiple agents. Unfortunately, agents may try to manipulate the result by mis-reporting their preferences. One barrier that might exist to such manipulation is computational complexity. In particular, it has been shown that it is NP-hard to compute how to manipulate a number of different voting rules. How-ever NP-hardness only bounds the worst-case complexity. Recent theoretical results suggest that manipulation may often be easy in practice. In this paper, we show that empirical studies are useful in improving our understanding of this issue. We consider two settings which represent the two types of complexity results that have been identified in this area: manipulation with unweighted votes by a single agent, and manipulation with weighted votes by a coalition of agents. In the first case, we consider Single Transferable Voting (STV), and in the second case, we consider veto voting. STV is one of the few voting rules used in practice where it is NP-hard to compute how a single agent can manipulate the result when votes are unweighted. It also appears one of the harder voting rules to manipulate since it involves multiple rounds. On the other hand, veto voting is one of the simplest representatives of voting rules where it is NP-hard to compute how a coalition of weighted agents can manipulate the result. In our experiments, we sample a number of distributions of votes including uniform, correlated and real world elections. In many of the elections in our experiments, it was easy to compute how to manipulate the result or to prove that manipulation was impossible. Even when we were able to identify a situation in which manipulation was hard to compute (e.g. when votes are highly correlated and the election is \"hung\"), we found that the computational difficulty of computing manipulations was somewhat precarious (e.g. with such \"hung\" elections, even a single uncorrelated voter was enough to make manipulation easy to compute).", "paper_title": "Where Are the Hard Manipulation Problems?", "paper_id": "WOS:000295381200001"}