{"auto_keywords": [{"score": 0.049205016512960324, "phrase": "design_process_chains"}, {"score": 0.007740489563401459, "phrase": "integrated_design"}, {"score": 0.007280565843863289, "phrase": "design_objectives"}, {"score": 0.006381583573325438, "phrase": "systems_based_approach"}, {"score": 0.00555875739438817, "phrase": "multiscale_systems"}, {"score": 0.004683678340162048, "phrase": "concurrent_design"}, {"score": 0.004391065788354779, "phrase": "improved_flexibility"}, {"score": 0.00431085649482107, "phrase": "increased_complexity"}, {"score": 0.004308089245690873, "phrase": "design_process_decisions"}, {"score": 0.0042321061143641625, "phrase": "materials_simulation_models"}, {"score": 0.004167576249058047, "phrase": "design_chains"}, {"score": 0.004041441391385147, "phrase": "increased_uncertainty"}, {"score": 0.0038239045109853633, "phrase": "simulation_models"}, {"score": 0.0038004655673708016, "phrase": "concurrent_material"}, {"score": 0.003777169749975466, "phrase": "product_design"}, {"score": 0.0036291762280629115, "phrase": "resulting_uncertainty"}, {"score": 0.003562834168369313, "phrase": "overall_system_performance"}, {"score": 0.0034762541706024755, "phrase": "accurate_models"}, {"score": 0.0033297542331358057, "phrase": "design_decisions"}, {"score": 0.003189408489240117, "phrase": "hierarchical_modeling"}, {"score": 0.0029351800932860823, "phrase": "complex_systems"}, {"score": 0.002743048133491456, "phrase": "model_design_process_chains"}, {"score": 0.002659912539676968, "phrase": "value-of-information_based_metrics"}, {"score": 0.0024857542101349808, "phrase": "shock-induced_detonation"}, {"score": 0.002417829700753522, "phrase": "strength_properties"}, {"score": 0.0023735786148488818, "phrase": "mesm"}, {"score": 0.0023301353812204607, "phrase": "sufficient_strength"}, {"score": 0.002315831335278694, "phrase": "energy_release"}, {"score": 0.002231828204535298, "phrase": "different_length"}, {"score": 0.0021909737736168122, "phrase": "different_aspects"}, {"score": 0.0021049977753042253, "phrase": "mesm_design_problem"}], "paper_keywords": ["multiscale materials design", " design processes", " improvement potential energetic", " structural materials"], "paper_abstract": "The concurrent design of materials and products provides designers with flexibility to achieve design objectives that were not previously accessible. However, the improved flexibility comes at a cost of increased complexity of the design process chains and the materials simulation models used for executing the design chains. Efforts to reduce the complexity generally result in increased uncertainty. We contend that a systems based approach is essential for managing both the complexity and the uncertainty in design process chains and simulation models in concurrent material and product design. Our approach is based on simplifying the design process chains systematically such that the resulting uncertainty does not significantly affect the overall system performance. Similarly, instead of striving for accurate models for multiscale systems (that are inherently complex), we rely on making design decisions that are robust to uncertainties in the models. Accordingly, we pursue hierarchical modeling in the context of design of multiscale systems. In this paper our focus is on design process chains. We present a systems based approach, premised on the assumption that complex systems can be designed efficiently by managing the complexity of design process chains. The approach relies on (a) the use of reusable interaction patterns to model design process chains, and (b) consideration of design process decisions using value-of-information based metrics. The approach is illustrated using a Multifunctional Energetic Structural Material (MESM) design example. Energetic materials store considerable energy which can be released through shock-induced detonation; conventionally, they are not engineered for strength properties. The design objectives for the MESM in this paper include both sufficient strength and energy release characteristics. The design is carried out by using models at different length and time scales that simulate different aspects of the system. Finally, by applying the method to the MESM design problem, we show that the integrated design of materials and products can be carried out more efficiently by explicitly accounting for design process decisions with the hierarchy of models.", "paper_title": "A systems-based approach for integrated design of materials, products and design process chains", "paper_id": "WOS:000254987500029"}