{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "forbidden_difference_patterns"}, {"score": 0.0396600464562225, "phrase": "forbidden_patterns"}, {"score": 0.00436890075128947, "phrase": "maximal_number"}, {"score": 0.0036671822784770463, "phrase": "new_inequalities"}, {"score": 0.003409057326528229, "phrase": "arbitrary_high_accuracy"}, {"score": 0.003359647377874098, "phrase": "computational_cost"}, {"score": 0.0031690434364310435, "phrase": "desired_accuracy"}, {"score": 0.0030628762739398855, "phrase": "polynomial_time_algorithm"}, {"score": 0.002779816090078335, "phrase": "np"}, {"score": 0.0026209522797963447, "phrase": "extended_set"}, {"score": 0.0025085435314540837, "phrase": "extremal_norms"}, {"score": 0.0023776656246300063, "phrase": "capacity_computation"}, {"score": 0.002286781334850213, "phrase": "second_capacity"}, {"score": 0.002125612498781805, "phrase": "exactly_the_capacity"}, {"score": 0.0021049977753042253, "phrase": "particular_codes"}], "paper_keywords": ["approximation algorithm", " capacity of codes", " coding theory", " complexity of capacity", " joint spectral radius", " NP-hardness"], "paper_abstract": "Some questions related to the computation of the capacity of codes that avoid forbidden difference patterns are analysed. The maximal number of it-bit sequences whose pairwise differences do not contain some given forbidden difference patterns is known to increase exponentially with n; the coefficient of the exponent is the capacity of the forbidden patterns. In this paper, new inequalities for the capacity are given that allow for the approximation of the capacity with arbitrary high accuracy. The computational cost of the algorithm derived from these inequalities is fixed once the desired accuracy is given. Subsequently, a polynomial time algorithm is given for determining if the capacity of a set is positive while the same problem is shown to be NP-hard when the sets of forbidden patterns are defined over an extended set of symbols. Finally, the existence of extremal norms is proved for any set of matrices arising in the capacity computation. Based on this result, a second capacity approximating algorithm is proposed. The usefulness of this algorithm is illustrated by computing exactly the capacity of particular codes that were only known approximately.", "paper_title": "On the complexity of computing the capacity of codes that avoid forbidden difference patterns", "paper_id": "WOS:000241805700028"}