{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "book_reviews"}, {"score": 0.010020468546490467, "phrase": "research_area"}, {"score": 0.004598933498016774, "phrase": "book_citation_indexes"}, {"score": 0.004460309246062286, "phrase": "academic_work"}, {"score": 0.004089725258435817, "phrase": "research_community"}, {"score": 0.0038862297330905836, "phrase": "knowledge_journals"}, {"score": 0.0038467574225322086, "phrase": "citation_analysis"}, {"score": 0.0035997452281985465, "phrase": "book_citation_index"}, {"score": 0.0034733518170738517, "phrase": "inconsistent_methods"}, {"score": 0.003104201872147936, "phrase": "corresponding_book_reviews"}, {"score": 0.002676692093594358, "phrase": "remarkable_mean_number"}, {"score": 0.002331641523873951, "phrase": "easy_detection"}, {"score": 0.0023079225317714815, "phrase": "corresponding_books"}, {"score": 0.0022041312401435346, "phrase": "research_areas"}, {"score": 0.0021049977753042253, "phrase": "social_sciences"}], "paper_keywords": ["Book reviews", " Monographs", " Book citation index", " Books", " Citation analysis"], "paper_abstract": "Both citations to an academic work and post-publication reviews of it are indicators that the work has had some impact on the research community. The Thomson Reuters evaluation and selection process for web of knowledge journals includes citation analysis but this is not systematically practised for evaluation of books for the book citation index (BKCI) due to the inconsistent methods of citing books, the volume of books and the variants of the titles, especially in non-English language. Despite the fact that correlations between citations to a book and the number of corresponding book reviews differ from research area to research area and are overall weak or non-existent, this study confirms that books with book reviews do not remain uncited and accrue a remarkable mean number of citations. Therefore, book reviews can be considered a suitable selection criterion for BKCIs. The approach suggested in this study is feasible and allows easy detection of corresponding books via its book reviews, which is particularly true for research areas where books play a more important role such as the social sciences, the arts and humanities.", "paper_title": "The power of book reviews: a simple and transparent enhancement approach for book citation indexes", "paper_id": "WOS:000330622600005"}