{"auto_keywords": [{"score": 0.03850635462055537, "phrase": "implementation_success"}, {"score": 0.031308113935327654, "phrase": "organizational_influence"}, {"score": 0.00481495049065317, "phrase": "organizational_influence_processes"}, {"score": 0.004608730887154718, "phrase": "longitudinal_case_study"}, {"score": 0.004558564684763264, "phrase": "spi_implementation"}, {"score": 0.004484332781147261, "phrase": "fundamental_tenet"}, {"score": 0.00441130431691048, "phrase": "information_systems"}, {"score": 0.0035435867326548665, "phrase": "organization_influence"}, {"score": 0.002989991779830814, "phrase": "coordinated_strategy"}, {"score": 0.0027691111795848183, "phrase": "technology_implementation"}, {"score": 0.002679501909303057, "phrase": "organizational_influence_process"}, {"score": 0.0024410093024417527, "phrase": "important_insights"}], "paper_keywords": ["IS implementation", " longitudinal case study", " organizational influence processes", " software process improvement", " barriers"], "paper_abstract": "A fundamental tenet of the information systems (IS) discipline holds that: (a) a lack of formal power and influence over the organization targeted for change, (b) weak support from top management, and (c) organizational memories of prior failures are barriers to implementation success. Our research, informed by organization influence, compellingly illustrates that such conditions do not necessarily doom a project to failure. In this paper, we present an analysis of how an IS implementation team designed and enacted a coordinated strategy of organizational influence to achieve implementation success despite these barriers. Our empirical analysis also found that technology implementation and change is largely an organizational influence process (OIP), and thus technical-rational approaches alone are inadequate for achieving success. Our findings offer managers important insights into how they can design and enact OIPs to effectively manage IS implementation. Further, we show how the theory of organizational influence can enhance understanding of IS implementation dynamics and advance the development of a theory of effective IS change agentry.", "paper_title": "Using organizational influence processes to overcome IS implementation barriers: lessons from a longitudinal case study of SPI implementation", "paper_id": "WOS:000332633200006"}