{"auto_keywords": [{"score": 0.03236361550426133, "phrase": "math_word_problems"}, {"score": 0.00481495049065317, "phrase": "abstract_conditional_knowledge"}, {"score": 0.0047563776685277314, "phrase": "appropriate_choice"}, {"score": 0.004641351004344458, "phrase": "math_word_problem"}, {"score": 0.004157058883925715, "phrase": "appropriate_diagrams"}, {"score": 0.0038862297330905836, "phrase": "teaching_sessions"}, {"score": 0.0038154673253945003, "phrase": "active_comparison"}, {"score": 0.0033139366449568565, "phrase": "traditional_math_classes"}, {"score": 0.002931569771634119, "phrase": "experimental_group"}, {"score": 0.0023507916951658455, "phrase": "experimental_condition"}, {"score": 0.002183938718432764, "phrase": "conditional_knowledge"}], "paper_keywords": [""], "paper_abstract": "This study sought to address the problem of novices not being able to select the appropriate diagrams to suit given tasks. It investigated the usefulness of providing teaching sessions that involved active comparison of diagrams and review of lessons learnt following problem solving. Fifty-eight 8th grade participants were assigned to one of two instruction conditions. In both, traditional math classes were provided in which diagrams were used to explain how to solve math word problems. However, participants in the experimental group were additionally provided with sessions that required them to actively compare diagrams used, and consider and articulate the lessons they learnt from the problem solving exercises. The results showed that participants in the experimental condition subsequently constructed more appropriate diagrams in solving math word problems. In an assessment of conditional knowledge, these participants also provided more abstract and detailed descriptions about the uses of diagrams in problem solving.", "paper_title": "Active comparison as a means of promoting the development of abstract conditional knowledge and appropriate choice of diagrams in math word problem solving", "paper_id": "WOS:000239625600024"}