{"auto_keywords": [{"score": 0.042712690847577596, "phrase": "load_balancing"}, {"score": 0.00481495049065317, "phrase": "distributed_load_balancing_algorithms"}, {"score": 0.004777034835192062, "phrase": "heterogeneous_players"}, {"score": 0.004739416327250269, "phrase": "asynchronous_networks"}, {"score": 0.004683540676363745, "phrase": "highly_scalable_networks"}, {"score": 0.004573748810476845, "phrase": "cloud_computing_environments"}, {"score": 0.004413846562278824, "phrase": "centralized_policies"}, {"score": 0.003919973783578995, "phrase": "heterogeneous_nodes"}, {"score": 0.003812896124654341, "phrase": "different_processing_power"}, {"score": 0.003664963414801933, "phrase": "centralized_clock"}, {"score": 0.002867268370615848, "phrase": "centralized_implementation"}, {"score": 0.0028110458014332187, "phrase": "game-theoretic_nature"}, {"score": 0.0025663657776001676, "phrase": "nash"}, {"score": 0.002324238863944163, "phrase": "nash_equilibrium"}, {"score": 0.0021049977753042253, "phrase": "network's_nash_equilibrium"}], "paper_keywords": ["load balancing", " Nash equilibrium", " game theory"], "paper_abstract": "In highly scalable networks, such as grid and cloud computing environments and the Internet itself, the implementation of centralized policies is not feasible. Thus, nodes in such networks act according to their interests. One problem with these networks is load balancing. This paper considers load balancing in networks with heterogeneous nodes, that is, nodes with different processing power, and asynchronous actions, where there is no centralized clock and thus one or more nodes can perform their actions simultaneously. We show that if the nodes want to balance the load without complying with certain rules, then load balancing is never achieved. Thus, it is necessary to implement some rules that need to be distributed (i.e., so that they run locally on each node) due to the unfeasibility of centralized implementation. Due to the game-theoretic nature of the nodes, the concept of solution is when all nodes are satisfied with the load assigned to them, a Nash equilibrium state. Moreover, we discuss how the rules can be created and present three sets of rules for the nodes to reach a Nash equilibrium. For each set of rules, we prove its correctness and, through simulations, evaluate the number of steps needed to reach the network's Nash equilibrium.", "paper_title": "Distributed Load Balancing Algorithms for Heterogeneous Players in Asynchronous Networks", "paper_id": "WOS:000315673200003"}