{"auto_keywords": [{"score": 0.03793723623757479, "phrase": "supplier_involvement"}, {"score": 0.010612387000973441, "phrase": "top_management_support"}, {"score": 0.008258673722511418, "phrase": "customer_involvement"}, {"score": 0.00781369515834415, "phrase": "tms"}, {"score": 0.007045691504580176, "phrase": "chinese-controlled_firms"}, {"score": 0.00673995630483103, "phrase": "foreign-controlled_firms"}, {"score": 0.004744123493964429, "phrase": "organizational_relationships"}, {"score": 0.0047090997998449095, "phrase": "external_involvement"}, {"score": 0.004674333455266527, "phrase": "purpose_-_the_purpose"}, {"score": 0.004244955499652296, "phrase": "different_ownerships"}, {"score": 0.004136221184894985, "phrase": "research_hypotheses"}, {"score": 0.004105666842002734, "phrase": "structural_equation_modeling"}, {"score": 0.003985680946956402, "phrase": "findings_-_tms"}, {"score": 0.002770745509774383, "phrase": "perceptual_data"}, {"score": 0.002740059168271987, "phrase": "single_respondent"}, {"score": 0.002497172413754263, "phrase": "practical_implications"}, {"score": 0.0024695304815140874, "phrase": "chinese"}, {"score": 0.002361876178411006, "phrase": "top_management"}, {"score": 0.002335707508067455, "phrase": "close_relationship"}, {"score": 0.002267329954548889, "phrase": "originality_value_-_this_study"}, {"score": 0.0021684903968454267, "phrase": "prior_history"}, {"score": 0.0021049979843008482, "phrase": "ei."}], "paper_keywords": ["Supplier involvement", " Customer involvement", " Relationship with customers", " Relationship with suppliers", " Top management support"], "paper_abstract": "Purpose - The purpose of this paper is to examine the effects of top management support (TMS) and inter-organizational relationships (IORs) on external involvement (EI), and their differences across different ownerships. Design/methodology/approach - To test the research hypotheses, structural equation modeling was conducted using data from 176 Chinese manufacturing firms. Findings - TMS enhances relationship with customers and relationship with suppliers. Relationship with customers increases the degree of customer involvement, while relationship with suppliers increases the degree of supplier involvement. In addition, TMS improves customer involvement while does not improve supplier involvement directly. A further analysis reveals that the relationship between TMS and supplier involvement is partially mediated by relationship with suppliers in Chinese-controlled firms, whereas it is completely mediated by relationship with suppliers in foreign-controlled firms. Moreover, the effect of relationship with suppliers on supplier involvement is stronger in foreign-controlled firms than in Chinese-controlled firms. Research limitations/implications - This study employed perceptual data from a single respondent in each firm. In addition, the data used in this study were collected from one side of the dyad: the manufacturers. Practical implications - Both Chinese-controlled and foreign-controlled firms should get support from top management and develop close relationship with customers and suppliers to improve EI. Originality value - This study extends our knowledge in the field by examining how TMS and prior history of IORs can improve the degree of EI.", "paper_title": "Top management support, inter-organizational relationships and external involvement", "paper_id": "WOS:000341781200002"}