{"auto_keywords": [{"score": 0.04564158107788786, "phrase": "trust_model"}, {"score": 0.0135852349594384, "phrase": "qualitative_and_ordinal_values"}, {"score": 0.00906428653964314, "phrase": "qtm"}, {"score": 0.00481495049065317, "phrase": "configurable_method"}, {"score": 0.00475924837336259, "phrase": "ordinal_data"}, {"score": 0.0047224703862074665, "phrase": "trust_models"}, {"score": 0.004490212943845175, "phrase": "trusted_central_authority"}, {"score": 0.003844545552246988, "phrase": "third-party_agents"}, {"score": 0.003756021561809324, "phrase": "qualitative_trust_model"}, {"score": 0.0031660031870090434, "phrase": "aggregation_method"}, {"score": 0.002839625463110821, "phrase": "median_and_similar_methods"}, {"score": 0.00278497898719426, "phrase": "lying_agents"}, {"score": 0.002720785798036066, "phrase": "opinion_providers"}, {"score": 0.0026892447164623247, "phrase": "modified_version"}, {"score": 0.002658068304632523, "phrase": "weighted_majority_algorithm"}, {"score": 0.0025867180355950816, "phrase": "social_links"}, {"score": 0.0023289568500915207, "phrase": "well-known_trust_models"}, {"score": 0.0021049977753042253, "phrase": "direct_experiences"}], "paper_keywords": ["Trust", " Multi-agent system", " Qualitative", " Ordinal", " Data aggregation"], "paper_abstract": "Trust models are mechanisms that allow agents to build trust without relying on a trusted central authority. Our goal was to develop a trust model that would operate with values that humans easily understand and manipulate: qualitative and ordinal values. The result is a trust model that computes trust from experiences created in interactions and from opinions obtained from third-party agents. The trust model, termed qualitative trust model (QTM), uses qualitative and ordinal values for assessing experiences, expressing opinions and estimating trust. We treat such values appropriately; we never convert them to numbers, but merely use their relative order. To aggregate a collection of such values, we propose an aggregation method that is based on comparing distributions and show some of its properties; the method can be used in other domains and can be seen as an alternative to median and similar methods. To cope with lying agents, QTM estimates trustworthiness in opinion providers with a modified version of the weighted majority algorithm, and additionally combines trustworthiness with social links between agents; such links are obtained implicitly by observing how agents provide opinions about each other. Finally, we compare QTM against a set of well-known trust models and demonstrate that it consistently performs well and on par with other quantitative models, and in many cases even outperforms them, particularly when the number of direct experiences is low.", "paper_title": "Qualitative trust model with a configurable method to aggregate ordinal data", "paper_id": "WOS:000336440400004"}