{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "neighborhood_formation"}, {"score": 0.039487762794934544, "phrase": "sparsity_problem"}, {"score": 0.004781498797706604, "phrase": "collaborative_recommender_systems"}, {"score": 0.00474827840031692, "phrase": "automatic_recommenders"}, {"score": 0.004666228956744244, "phrase": "e-commerce_websites"}, {"score": 0.0043976740574978085, "phrase": "sales_revenue"}, {"score": 0.004246947739596565, "phrase": "collaborative_filtering_technique"}, {"score": 0.004072851768196397, "phrase": "recommendation_items"}, {"score": 0.003974597387549594, "phrase": "similar_preferences"}, {"score": 0.0035299344877334385, "phrase": "product_catalogue"}, {"score": 0.0033969686698961743, "phrase": "new_problem"}, {"score": 0.0029438813080245544, "phrase": "fake_neighbors"}, {"score": 0.0025333084852052147, "phrase": "new_strategy"}, {"score": 0.0024894376091589244, "phrase": "semantic_reasoning"}, {"score": 0.002387214876538434, "phrase": "aforementioned_fake_neighborhood_problem"}, {"score": 0.002281194103324554, "phrase": "semantic_similarities"}, {"score": 0.0022653055209664284, "phrase": "different_products"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Collaborative filtering", " Semantic reasoning", " Semantic similarity metric", " Fake neighborhood", " Sparsity problem"], "paper_abstract": "Automatic recommenders are now omnipresent in e-commerce websites, as selecting and offering to users products they may be interested in can considerably increase sales revenue. The most popular recommendation strategy is currently considered to be the collaborative filtering technique, based on offering to the user who will receive the recommendation items that were appealing to other individuals with similar preferences (the so-called neighbors). On the other hand, its principal obstacle is the sparsity problem, related to the difficulty to find overlappings in ratings when there are many items. As the product catalogue of these sites gets more and more diverse, a new problem has arisen that happens when users share likings for lots of products (for which they are reckoned to be neighbors) but they differ in products similar to the one that is being considered for recommendation. They are fake neighbors. Narrowing the range of products on which similarities between users are sought can help to avoid this, but it usually causes a worsening of the sparsity problem because the chances of finding overlappings gets lower. In this paper, a new strategy is proposed based on semantic reasoning that aims to improve the neighborhood formation in order to overcome the aforementioned fake neighborhood problem. Our approach is aimed at making more flexible the search for semantic similarities between different products, and thus not require users to rate the same products in order to be compared. (C) 2014 Elsevier Ltd. All rights reserved.", "paper_title": "A semantic approach to improve neighborhood formation in collaborative recommender systems", "paper_id": "WOS:000341462600010"}