{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "respiratory_motion"}, {"score": 0.004466519142879166, "phrase": "intraoperative_recovery"}, {"score": 0.003953068310598579, "phrase": "additional_several_sequences"}, {"score": 0.003825173769489887, "phrase": "respiration_cycles"}, {"score": 0.003369322866499541, "phrase": "lus_probe"}, {"score": 0.0032602525602322832, "phrase": "hepatic_surface"}, {"score": 0.003229741076887151, "phrase": "respiratory_phases"}, {"score": 0.0028446460307503343, "phrase": "image_planes"}, {"score": 0.0025290375256888883, "phrase": "vivo_experiments"}, {"score": 0.002493592357827492, "phrase": "pig_liver"}, {"score": 0.002447101794397243, "phrase": "proposed_method"}, {"score": 0.0024128022009415476, "phrase": "accurate_estimation"}, {"score": 0.0023902026696615473, "phrase": "respiratory_cycle"}, {"score": 0.0022378101636842296, "phrase": "sagittal_plane_interval"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["respiratory motion compensation", " laparoscopic Surgery", " non-rigid registration", " intraoperative image analysis", " 4D deformation field"], "paper_abstract": "The present paper describes a method for intraoperative recovery of respiratory motion and deformation of the liver by using a laparoscopic freehand 3D ultrasound (US) system. The proposed method can extend 3D US data of the liver to 4D by acquiring additional several sequences of time-varying 2D US images during a couple of respiration cycles. 2D US images are acquired on several sagittal image planes and their tirne-varying 3D positions and orientations are measured using a miniature magnetic 3D position sensor attached to a laparoscopic US (LUS) probe. During the acquisition, the LUS probe is assumed to move together with hepatic surface. Respiratory phases and in-plane 2D deformation fields are estimated from time-varying 2D US images, and then time-varying 3D deformation fields on sagittal image planes are obtained by combining 3D positions and orientations of the image planes. Time-varying 3D deformation field of the volume, that is, 4D deformation field, is obtained by interpolating the 3D deformation fields estimated on several planes. In vivo experiments using a pig liver showed that the proposed method could perform accurate estimation of respiratory cycle and in-plane 2D deformation fields. Furthermore, evaluation for the effects of sagittal plane interval indicated that 4D deformation fields could be stably recovered. (C) 2007 Elsevier B.V. All rights reserved.", "paper_title": "Recovery of respiratory motion and deformation of the liver using laparoscopic freehand 3D ultrasound system", "paper_id": "WOS:000250398800003"}