{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "bloat_control_operators"}, {"score": 0.004388450908826472, "phrase": "recent_proposal"}, {"score": 0.003818210967854446, "phrase": "preliminary_study"}, {"score": 0.0037070855410818986, "phrase": "promising_results"}, {"score": 0.0036144035798673967, "phrase": "thorough_study"}, {"score": 0.0035389348527719404, "phrase": "benchmark_problems"}, {"score": 0.003421437601439154, "phrase": "new_approach"}, {"score": 0.0032250961348210473, "phrase": "final_solutions"}, {"score": 0.003117986133774198, "phrase": "substantial_reduction"}, {"score": 0.0030787405733989615, "phrase": "mean_tree_size"}, {"score": 0.002889778121878728, "phrase": "problem_domains"}, {"score": 0.0026222551419772867, "phrase": "experimental_part"}, {"score": 0.002471661547432869, "phrase": "genotypic_diversity"}, {"score": 0.0024405312482831646, "phrase": "comparison_study"}, {"score": 0.0023694065215394593, "phrase": "relevant_clues"}, {"score": 0.00231987280116332, "phrase": "control_method"}, {"score": 0.002261794227418188, "phrase": "particular_problem"}, {"score": 0.0021049977753042253, "phrase": "genetic_pool_diversity"}], "paper_keywords": ["Bloat control", " genetic programming", " diversity"], "paper_abstract": "This paper reports a comparison of several bloat control methods and also evaluates a recent proposal for limiting the size of the individuals: a genetic operator called prune and plant. The aim of this work is to test the adequacy of this method. Since a preliminary study of the method has already shown promising results, we have performed a thorough study in a set of benchmark problems aiming at demonstrating the utility of the new approach. Prune and plant has obtained results that maintain the quality of the final solutions in terms of fitness while achieving a substantial reduction of the mean tree size in all four problem domains considered. In addition, in one of these problem domains, prune and plant has demonstrated to be better in terms of fitness, size reduction, and time consumption than any of the other bloat control techniques under comparison. The experimental part of the study presents a comparison of performance in terms of phenotypic and genotypic diversity. This comparison study can provide the practitioner with some relevant clues as to which bloat control method is better suited to a particular problem and whether the advantage of a method does or does not derive from its influence on the genetic pool diversity.", "paper_title": "Bloat Control Operators and Diversity in Genetic Programming: A Comparative Study", "paper_id": "WOS:000277101800006"}