{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "environmental_observatory_information_system"}, {"score": 0.004598933498016774, "phrase": "hydrologic_science_and_environmental_engineering_communities"}, {"score": 0.004053362743156545, "phrase": "broad_research_questions"}, {"score": 0.003961330917648707, "phrase": "successful_implementation"}, {"score": 0.0037188360359702182, "phrase": "architecture_and_functional_requirements"}, {"score": 0.003372844338742438, "phrase": "hydrologic_observations"}, {"score": 0.0032585499655442404, "phrase": "unique_system"}, {"score": 0.0029552551661591988, "phrase": "utah_environmental_observatory_test_bed"}, {"score": 0.00283870598459543, "phrase": "nation-wide_network"}, {"score": 0.0026955672787561742, "phrase": "observatory_information_system"}, {"score": 0.0025449518236394103, "phrase": "environmental_observations_data"}, {"score": 0.0025014259919355453, "phrase": "single_observatory"}], "paper_keywords": ["Cyberinfrastructure", " Hydrology", " Water resources", " Sensor", " Data model", " Web service"], "paper_abstract": "Recently, an initiative within the hydrologic science and environmental engineering communities has emerged for the establishment of cooperative, large-scale environmental observatories. Scientists' ability to access and use data collected within observatories to address broad research questions depends on the successful implementation of cyberinfrastructure. In this paper, we describe the architecture and functional requirements for an environmental observatory information system that supports collection, organization, storage, analysis, and publication of hydrologic observations. We then describe a unique system that has been developed to meet these requirements and that has been implemented within the Little Bear River, Utah environmental observatory test bed, as well as across a nation-wide network of 11 similar observatory test bed sites. The components demonstrated comprise an observatory information system that enables not only the management, analysis, and synthesis of environmental observations data for a single observatory, but also publication of the data on the Internet in simple to use formats that are easily accessible, discoverable by others, and interoperable with data from other observatories. (C) 2010 Elsevier Ltd. All rights reserved.", "paper_title": "Components of an environmental observatory information system", "paper_id": "WOS:000287290200010"}