{"auto_keywords": [{"score": 0.02688592123124467, "phrase": "differential_gossip_trust"}, {"score": 0.00481495049065317, "phrase": "peer_network"}, {"score": 0.004775918707955445, "phrase": "differential_gossip_algorithm"}, {"score": 0.004141663280057689, "phrase": "reputation_aggregation"}, {"score": 0.00407474190126995, "phrase": "peer_networks"}, {"score": 0.003504595508262064, "phrase": "reputation_aggregation_algorithm"}, {"score": 0.003419943984098415, "phrase": "gossip_algorithm"}, {"score": 0.0029531640201737384, "phrase": "immediate_neighbours"}, {"score": 0.0029053904956617043, "phrase": "neighbours'_direct_interaction"}, {"score": 0.0028351712509358997, "phrase": "differential_gossip"}, {"score": 0.0027666443986705453, "phrase": "lesser_amount"}, {"score": 0.00266693888510356, "phrase": "independent_reputation_value"}, {"score": 0.0024680632991561074, "phrase": "power_law_network"}, {"score": 0.002438043578514396, "phrase": "preferential_attachment"}, {"score": 0.002321563536990284, "phrase": "good_amount"}, {"score": 0.0021659920594094407, "phrase": "power_law_networks"}], "paper_keywords": ["Trust", " reputation", " differential gossip", " free riding", " collusion"], "paper_abstract": "In a peer-to-peer system, a node should estimate reputation of other peers not only on the basis of its own interaction, but also on the basis of expression of other nodes. Reputation aggregation mechanism implements strategy for achieving this. Reputation aggregation in peer to peer networks is generally a very time and resource consuming process. Moreover, most of the methods consider that a node will have the same reputation after aggregation with all the nodes in the network, which is not true. This paper proposes a reputation aggregation algorithm that uses a variant of gossip algorithm called differential gossip. In this paper, estimate of reputation is considered to be having two parts, one common component which is same with every node, and the other one is the information received from immediate neighbours based on the neighbours' direct interaction with the node. The differential gossip is fast and requires a lesser amount of resources. This mechanism allows computation of independent reputation value by every node, of every other node in the network. The differential gossip trust has been investigated for a power law network formed using preferential attachment (PA) Model. The reputation computed using differential gossip trust shows good amount of immunity to the collusion. We have verified the performance of the algorithm on the power law networks with sizes ranging from 100 nodes to 50,000 nodes.", "paper_title": "Reputation Aggregation in Peer-to-Peer Network Using Differential Gossip Algorithm", "paper_id": "WOS:000361245300017"}