{"auto_keywords": [{"score": 0.04936106948081192, "phrase": "rigid-flexible_manipulator"}, {"score": 0.02322730111336097, "phrase": "dynamic_coupling"}, {"score": 0.006296226690016711, "phrase": "proposed_index"}, {"score": 0.004419703921314433, "phrase": "feed_support_system"}, {"score": 0.0043533862892678864, "phrase": "five-hundred-meter_aperture_spherical_radio_telescope"}, {"score": 0.004118587636081584, "phrase": "flexible_cable-driven_parallel_manipulator"}, {"score": 0.004036378551867845, "phrase": "stewart"}, {"score": 0.003916098498242888, "phrase": "stewart_platform"}, {"score": 0.0037993970934472243, "phrase": "cable-driven_parallel_manipulator"}, {"score": 0.003417565253539315, "phrase": "\"virtual_stewart_platform"}, {"score": 0.0032989853590079153, "phrase": "homogenous_matrix"}, {"score": 0.0026155094974689595, "phrase": "performance_index"}, {"score": 0.0024247382451294255, "phrase": "feedback_control"}, {"score": 0.0023170054862555896, "phrase": "simulation_results"}, {"score": 0.0022706700510423954, "phrase": "dynamic_performance"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Rigid-flexible manipulator", " Dynamic coupling", " Feedback control", " FAST"], "paper_abstract": "Because of its large dimension, a rigid-flexible manipulator was designed to serve as the feed support system in a Five-hundred-meter Aperture Spherical radio Telescope (FAST). The rigid-flexible manipulator is composed of a flexible cable-driven parallel manipulator and a rigid Stewart platform. Motion of the Stewart platform may induce vibration of the cable-driven parallel manipulator due to reaction forces. The goal of this study is to investigate the dynamic coupling of the rigid-flexible manipulator. The \"Virtual Stewart platform\" was introduced to obtain a homogenous matrix to describe how much base motion is produced by a given Stewart platform motion. On this basis, an index was proposed to characterize the dynamic coupling of the rigid-flexible manipulator. Based on the proposed index, the factors influencing the dynamic coupling are investigated. The proposed index can be considered as a performance index in design and control of the system. Influence of the dynamic coupling on the feedback control of the rigid-flexible manipulator was also discussed. The simulation results showed that the dynamic performance of the rigid-flexible manipulator is strongly determined by the proposed index. (C) 2014 Elsevier Ltd. All rights reserved.", "paper_title": "Research on the dynamic coupling of the rigid-flexible manipulator", "paper_id": "WOS:000346455600007"}