{"auto_keywords": [{"score": 0.04898689815940366, "phrase": "metadata_surrogates"}, {"score": 0.01467886410743076, "phrase": "user_study"}, {"score": 0.00481495049065317, "phrase": "relevance_judgment_behaviour"}, {"score": 0.004211594861013822, "phrase": "university_students'_interaction"}, {"score": 0.004096493540086106, "phrase": "object_repositories"}, {"score": 0.00398452530840582, "phrase": "relevance_judgement_process"}, {"score": 0.003929689573550262, "phrase": "literature_review"}, {"score": 0.003683565150278339, "phrase": "users'_needs"}, {"score": 0.0035828427627676075, "phrase": "relevance_judgement"}, {"score": 0.0034368818187904744, "phrase": "different_versions"}, {"score": 0.003389557201018519, "phrase": "prototype_system"}, {"score": 0.0031045562469735307, "phrase": "relevant_information"}, {"score": 0.0026899455459275575, "phrase": "satisfaction_questionnaires"}, {"score": 0.0021049977753042253, "phrase": "search_result_interfaces"}], "paper_keywords": ["digital surrogates", " information seeking and retrieval", " interface design", " learning object metadata", " relevance judgement", " user studies"], "paper_abstract": "This paper reports on the findings of a user study which investigated the effects of structure, highlighting and quantity of information on university students' interaction with metadata surrogates of learning object repositories (LORs) during the relevance judgement process. The literature review revealed a lack of studies investigating how metadata surrogates should be designed to meet users' needs and improve the effectiveness of relevance judgement. In order to address this issue, different versions of a prototype system, called META-LOR 2, were developed and evaluated in terms of the time needed for users to find relevant information, the accuracy of their relevance judgements and their satisfaction. To evaluate the prototype, a user study was conducted where participants were asked to complete a set of tasks and fill in satisfaction questionnaires. The findings showed that participants performed better and were more satisfied with those versions of the prototype which highlighted metadata elements that included the query terms, used clusters or categories to organize metadata elements in the surrogates and included metadata elements which were relevant to the query or task at hand. The paper concludes with some recommendations for improving the design of metadata surrogates in search result interfaces.", "paper_title": "Design factors affecting relevance judgment behaviour in the context of metadata surrogates", "paper_id": "WOS:000285087200008"}