{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "nutrient_competition"}, {"score": 0.015264311274047034, "phrase": "microalgal_biomass"}, {"score": 0.00806809500692918, "phrase": "nutrient_availability"}, {"score": 0.007381866466499159, "phrase": "modeling_procedure"}, {"score": 0.005857056145701841, "phrase": "biomass'_species_composition"}, {"score": 0.003818326867123525, "phrase": "microalgae_cells"}, {"score": 0.0031003255054939524, "phrase": "experimental_data"}, {"score": 0.003063627258654102, "phrase": "empirical_assessments"}, {"score": 0.0027522340188241446, "phrase": "chemometric_methodology"}, {"score": 0.0025776913268808124, "phrase": "john_wiley"}, {"score": 0.0021049977753042253, "phrase": "culture's_growth_dynamics"}], "paper_keywords": ["modeling nutrient competition", " microalgal biomass production", " differential equation system", " simulated annealing"], "paper_abstract": "Growth of microalgal biomass is driven by nutrient availability but also by species competition for these nutrients. In this study, a modeling procedure has been developed by means of which impacts of nutrient competition on microalgae cells can be investigated on a cell-level. The goal of this modeling is to enhance the understanding of nutrient competition in a given biological environment and to enable predicting the biomass' species composition. These models are compared with experimental data and empirical assessments published earlier in this journal. Because these simulations have been built on very generic assumptions, transferring this chemometric methodology to other cell types is straightforward. Copyright (c) 2014 John Wiley & Sons, Ltd. Growth of microalgal biomass is driven by nutrient availability and also by species competition for these nutrients. A modeling procedure has been developed for investigating the impacts of nutrient competition on the culture's growth dynamics. The goals of this modeling are to enhance the understanding of nutrient competition in a given biological environment and to enable predicting the biomass' species composition. Because these simulations have been built on very generic assumptions, transferring this methodology to other cell types is straightforward.", "paper_title": "Cell-level modeling of nutrient competition on the growth of microalgal biomass", "paper_id": "WOS:000350144700007"}