{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "cumulative_probability_distribution_functions"}, {"score": 0.032839958078635254, "phrase": "proposed_algorithm"}, {"score": 0.0047602693158272655, "phrase": "kolmogorov-smirnov_two-sample_test"}, {"score": 0.004652754203582873, "phrase": "adaptive_algorithm"}, {"score": 0.004478907336898875, "phrase": "continuous_random_variable"}, {"score": 0.0044111930537670705, "phrase": "different_populations"}, {"score": 0.00434449804021954, "phrase": "minimum_homogeneous_clusters"}, {"score": 0.004278807087784626, "phrase": "parametric_assumptions"}, {"score": 0.003934795713147731, "phrase": "kolmogorov-smirnov_two_sample_statistic"}, {"score": 0.0034963129868796033, "phrase": "recorded_data"}, {"score": 0.003456554957885269, "phrase": "homogeneity_criterion"}, {"score": 0.003404244237372396, "phrase": "whole_distribution"}, {"score": 0.0026976391682197133, "phrase": "common_c.p.d.f"}, {"score": 0.0026567830878420347, "phrase": "observed_data"}, {"score": 0.0023424328921363585, "phrase": "large_data_set"}, {"score": 0.002324620886282579, "phrase": "solar_global_irradiation_spectra_distributions"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Adaptive clustering", " Cumulative probability distribution functions", " Kolmogorov-Smirnov two-sample test"], "paper_abstract": "This paper proposes an adaptive algorithm for clustering cumulative probability distribution functions (c.p.d.f.) of a continuous random variable, observed in different populations, into the minimum homogeneous clusters, making no parametric assumptions about the c.p.d.f.'s. The distance function for clustering c.p.d.f.'s that is proposed is based on the Kolmogorov-Smirnov two sample statistic. This test is able to detect differences in position, dispersion or shape of the c.p.d.f.'s. In our context, this statistic allows us to cluster the recorded data with a homogeneity criterion based on the whole distribution of each data set, and to decide whether it is necessary to add more clusters or not. In this sense, the proposed algorithm is adaptive as it automatically increases the number of clusters only as necessary: therefore, there is no need to fix in advance the number of clusters. The output of the algorithm are the common c.p.d.f. of all observed data in the cluster (the centroid) and, for each cluster, the Kolmogorov-Smirnov statistic between the centroid and the most distant c.p.d.f. The proposed algorithm has been used for a large data set of solar global irradiation spectra distributions. The results obtained enable to reduce all the information of more than 270,000 c.p.d.f.'s in only 6 different clusters that correspond to 6 different c.p.d.f.'s. (C) 2014 Elsevier Ltd. All rights reserved.", "paper_title": "An adaptive algorithm for clustering cumulative probability distribution functions using the Kolmogorov-Smirnov two-sample test", "paper_id": "WOS:000356904100018"}