{"auto_keywords": [{"score": 0.045748880881297346, "phrase": "continental_united_states"}, {"score": 0.00481495049065317, "phrase": "man-made_reservoirs"}, {"score": 0.004747997855358171, "phrase": "varying_complexity"}, {"score": 0.0047148789176849415, "phrase": "gis."}, {"score": 0.004568617813032014, "phrase": "world's_most_comprehensive_databases"}, {"score": 0.004350040802144489, "phrase": "sediment_surveys"}, {"score": 0.004304574865291508, "phrase": "database_date"}, {"score": 0.004055731291068803, "phrase": "resis"}, {"score": 0.0038887521594153608, "phrase": "large-scale_studies"}, {"score": 0.0037812559272269613, "phrase": "precise_coordinates"}, {"score": 0.003651039356522665, "phrase": "relatively_small_structures"}, {"score": 0.0035750641312373202, "phrase": "current_usgs_topographic_maps"}, {"score": 0.00329813918116714, "phrase": "esri's_arc_macro_language"}, {"score": 0.003195692081987805, "phrase": "digital_elevation_models"}, {"score": 0.00314015410819199, "phrase": "resis."}, {"score": 0.0028364942193465194, "phrase": "correct_outlet"}, {"score": 0.0027100527874262446, "phrase": "watershed_outlet"}, {"score": 0.002607464886544904, "phrase": "spatial_data"}, {"score": 0.0025264171945423254, "phrase": "land_use"}, {"score": 0.002456486927713543, "phrase": "reservoir's_watershed"}, {"score": 0.002422249273477746, "phrase": "local_landscape_similarity"}, {"score": 0.0023387234705715154, "phrase": "incorrect_watershed"}, {"score": 0.002281971169774711, "phrase": "watershed_characteristics"}, {"score": 0.0021573582896732657, "phrase": "geolocation_success_rate"}, {"score": 0.0021049977753042253, "phrase": "nearby_watersheds"}], "paper_keywords": ["reservoir sedimentation", " GIS", " DEM", " terrain complexity"], "paper_abstract": "The Reservoir Sedimentation Survey Information System (RESIS) is one of the world's most comprehensive databases of reservoir sedimentation rates, comprising nearly 6000 surveys for 1819 reservoirs across the continental United States. Sediment surveys in the database date from 1904 to 1999, though more than 95% of surveys were entered prior to 1980, making RESIS largely a historical database. The use of this database for large-scale studies has been limited by the lack of precise coordinates for the reservoirs. Many of the reservoirs are relatively small structures and do not appear on current USGS topographic maps. Others have been renamed or have only approximate (i.e. township and range) coordinates. This paper presents a method scripted in ESRI's ARC Macro Language (AML) to locate the reservoirs on digital elevation models using information available in RESIS. The script also delineates the contributing watersheds and compiles several hydrologically important parameters for each reservoir. Evaluation of the method indicates that, for watersheds larger than 5 km(2), the correct outlet is identified over 80% of the time. The importance of identifying the watershed outlet correctly depends on the application. Our intent is to collect spatial data for watersheds across the continental United States and describe the land use, soils, and topography for each reservoir's watershed. Because of local landscape similarity in these properties, we show that choosing the incorrect watershed does not necessarily mean that the watershed characteristics will be misrepresented. We present a measure termed terrain complexity and examine its relationship to geolocation success rate and its influence on the similarity of nearby watersheds. (C) 2008 Elsevier Ltd. All rights reserved.", "paper_title": "Geolocation of man-made reservoirs across terrains of varying complexity using GIS", "paper_id": "WOS:000259269800003"}