{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "community_detection"}, {"score": 0.027943800309361746, "phrase": "complex_networks"}, {"score": 0.00996464960413273, "phrase": "cdhc_algorithm"}, {"score": 0.008514639396009485, "phrase": "hierarchical_clustering"}, {"score": 0.0082829135426701, "phrase": "extensive_modularity"}, {"score": 0.007655231691429191, "phrase": "community_structure"}, {"score": 0.005433130638165847, "phrase": "initial_communities"}, {"score": 0.004036141321779216, "phrase": "useful_information"}, {"score": 0.00357689487273538, "phrase": "detection_accuracy"}, {"score": 0.003414467360488913, "phrase": "assessment_criteria"}, {"score": 0.003320561182494713, "phrase": "real_communities"}, {"score": 0.0029699874949715367, "phrase": "global_central_nodes"}, {"score": 0.0028087949095629955, "phrase": "link_strength"}, {"score": 0.0027062100658653485, "phrase": "last_merges"}, {"score": 0.0026317312518257803, "phrase": "large_communities"}, {"score": 0.0021049977753042253, "phrase": "frequently_used_datasets"}], "paper_keywords": [""], "paper_abstract": "Due to the development and popularization of Internet, there is more and more research focusing on complex networks. Research shows that there exists community structure in complex networks. Finding out community structure helps to extract useful information in complex networks, so the research on community detection is becoming a hotspot in recent years. There are two remarkable problems in detecting communities. Firstly, the detection accuracy is normally not very high; Secondly, the assessment criteria are not very effective when real communities are unknown. This paper proposes an algorithm for community detection based on hierarchical clustering (CDHC Algorithm). CDHC Algorithm firstly creates initial communities from global central nodes, then expands the initial communities layer by layer according to the link strength between nodes and communities, and at last merges some very small communities into large communities. This paper also proposes the concept of extensive modularity, overcoming some weakness of modularity. The extensive modularity can better evaluate the effectiveness of algorithms for community detection. This paper verifies the advantage of extensive modularity through experiments and compares CDHC Algorithm and some other representative algorithms for community detection on some frequently used datasets, so as to verify the effectiveness and advantages of CDHC Algorithm.", "paper_title": "A Method for Community Detection of Complex Networks Based on Hierarchical Clustering", "paper_id": "WOS:000358211300001"}