{"auto_keywords": [{"score": 0.04103499152779522, "phrase": "direct_connections"}, {"score": 0.03882324877010707, "phrase": "intrinsic_graph_structure"}, {"score": 0.03849329539884774, "phrase": "observed_data"}, {"score": 0.03215624681133198, "phrase": "observed_matrix"}, {"score": 0.00481495049065317, "phrase": "intrinsic_graph_structure_estimation_using_graph_laplacian"}, {"score": 0.004688989566904871, "phrase": "mathematical_representation"}, {"score": 0.0043496334756644535, "phrase": "common_examples"}, {"score": 0.004161553532799662, "phrase": "neural_networks"}, {"score": 0.0027700855441353165, "phrase": "spurious_correlations"}, {"score": 0.0027094427948305515, "phrase": "direct_connection"}, {"score": 0.0026036031415940563, "phrase": "digraph_laplacian"}, {"score": 0.0025018875576502606, "phrase": "generative_model"}, {"score": 0.002404136142279618, "phrase": "parameter_estimation_algorithm"}, {"score": 0.0023101951336207955, "phrase": "notable_advantage"}, {"score": 0.002279702500235741, "phrase": "proposed_method"}, {"score": 0.002219916677664081, "phrase": "directed_graphs"}, {"score": 0.0021906130276146325, "phrase": "conventional_graph_structure_estimation_methods"}, {"score": 0.0021049977753042253, "phrase": "undirected_graphs"}], "paper_keywords": [""], "paper_abstract": "A graph is a mathematical representation of a set of variables where some pairs of the variables are connected by edges. Common examples of graphs are railroads, the Internet, and neural networks. It is both theoretically and practically important to estimate the intensity of direct connections between variables. In this study, a problem of estimating the intrinsic graph structure from observed data is considered. The observed data in this study are a matrix with elements representing dependency between nodes in the graph. The dependency represents more than direct connections because it includes influences of various paths. For example, each element of the observed matrix represents a co-occurrence of events at two nodes or a correlation of variables corresponding to two nodes. In this setting, spurious correlations make the estimation of direct connection difficult. To alleviate this difficulty, a digraph Laplacian is used for characterizing a graph. A generative model of this observed matrix is proposed, and a parameter estimation algorithm for the model is also introduced. The notable advantage of the proposed method is its ability to deal with directed graphs, while conventional graph structure estimation methods such as covariance selections are applicable only to undirected graphs. The algorithm is experimentally shown to be able to identify the intrinsic graph structure.", "paper_title": "Intrinsic Graph Structure Estimation Using Graph Laplacian", "paper_id": "WOS:000336876200009"}