{"auto_keywords": [{"score": 0.007740489563401459, "phrase": "energy_efficiency"}, {"score": 0.005880416112582061, "phrase": "energy_problem"}, {"score": 0.004605191817189167, "phrase": "epidemics"}, {"score": 0.004061584718427419, "phrase": "large_number"}, {"score": 0.003964007795174772, "phrase": "desktop_and_mobile_environments"}, {"score": 0.00386876598761639, "phrase": "remarkable_portion"}, {"score": 0.003822003373331997, "phrase": "overall_internet_traffic"}, {"score": 0.003370565320453525, "phrase": "significant_energy_waste"}, {"score": 0.003236596168242036, "phrase": "mobile_context"}, {"score": 0.0031845067058084613, "phrase": "battery_lifetime"}, {"score": 0.003158776195052182, "phrase": "mobile_devices"}, {"score": 0.003020918749760067, "phrase": "highly_debated_topic"}, {"score": 0.002599763359352916, "phrase": "general_taxonomy"}, {"score": 0.0023776656246300063, "phrase": "themain_solutions"}, {"score": 0.0021307975800397816, "phrase": "open_issues"}, {"score": 0.0021049977753042253, "phrase": "future_research_guidelines"}], "paper_keywords": ["Design", " Algorithms", " Performance", " Peer-to-peer", " P2P", " energy efficiency", " file distribution", " content streaming", " epidemics"], "paper_abstract": "Several Peer-to-Peer (P2P) protocols and applications have been developed to allow file distribution/sharing, video and music streaming, and data and information dissemination. These P2P systems are regularly used by a large number of users, both in desktop and mobile environments, and they generate a remarkable portion of the overall Internet traffic. However, many common P2P protocols and applications were designed neglecting the energy problem. In fact, they often require always-on devices in order to work properly, thus producing significant energy waste. The problem is even more relevant in the mobile context, since the battery lifetime of mobile devices is limited. Therefore, energy efficiency in P2P systems is a highly debated topic in the literature. New P2P approaches-more energy efficient than traditional client/server solutions-have been proposed. In addition, several improvements to existing P2P protocols have been introduced to reduce their energy consumption. In this article, we present a general taxonomy to classify state-of-the-art approaches to the energy problem in P2P systems and applications. Then, we survey themain solutions available in the literature, focusing on three relevant classes of P2P systems and applications: file sharing/distribution, content streaming, and epidemics. Furthermore, we outline open issues and provide future research guidelines for each class of P2P systems.", "paper_title": "A Survey on Energy Efficiency in P2P Systems: File Distribution, Content Streaming, and Epidemics", "paper_id": "WOS:000373852800004"}