{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "linear_learning_itinerary"}, {"score": 0.040029450721471016, "phrase": "historical_ages"}, {"score": 0.03775114821059378, "phrase": "personalized_learning"}, {"score": 0.004747997855358171, "phrase": "latest_video_game"}, {"score": 0.004703878334423852, "phrase": "entertainment_technology"}, {"score": 0.00453144352814823, "phrase": "new_and_powerful_e-learning_systems"}, {"score": 0.004344965512058521, "phrase": "computer-based_game"}, {"score": 0.003741712498615481, "phrase": "natural_human-computer_interaction"}, {"score": 0.003689628075766217, "phrase": "video_game_technology"}, {"score": 0.0034884152484429207, "phrase": "flexible_learning_itinerary"}, {"score": 0.002989714021608139, "phrase": "determined_learning_flow"}, {"score": 0.0028265625216338875, "phrase": "twenty_nine_children"}, {"score": 0.00237733844863506, "phrase": "statistically_significant_differences"}, {"score": 0.0022475295254231714, "phrase": "computer-based_learning_games"}, {"score": 0.002185301851004467, "phrase": "learning_process"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Computer-based learning", " Flexible learning itinerary", " Natural user interfaces", " Frontal projection", " Kinect"], "paper_abstract": "The latest video game and entertainment technology and other technologies are facilitating the development of new and powerful e-Learning systems. In this paper, we present a computer-based game for learning about five historical ages. The objective of the game is to reinforce the events that mark the transition from one historical age to another and the order of the historical ages. Our game incorporates natural human-computer interaction based on video game technology, Frontal Projection, and personalized learning. For personalized learning, a Flexible Learning Itinerary has been included, where the children can decide how to direct the flow of their own learning process. For comparison, a Linear Learning Itinerary has also been included, where the children follow a determined learning flow. A study to compare the two different learning itineraries was carried out. Twenty nine children from 8 to 9 years old participated in the study. The analysis of the pre-tests and the post-tests determined that children learned the contents of a game about historical ages. The results show that there were no statistically significant differences between the two learning itineraries. Therefore, our study reveals the potential of computer-based learning games as a tool in the learning process for both flexible and linear itineraries. (C) 2014 Elsevier B.V. All rights reserved.", "paper_title": "Flexible learning itinerary vs. linear learning itinerary", "paper_id": "WOS:000336476900002"}