{"auto_keywords": [{"score": 0.02872014257083242, "phrase": "model_runs"}, {"score": 0.00481495049065317, "phrase": "simulation_models"}, {"score": 0.004600389726895716, "phrase": "land_change"}, {"score": 0.003683213029483699, "phrase": "modeling_options"}, {"score": 0.0035390378585554547, "phrase": "simulated_transitions"}, {"score": 0.003419943984098415, "phrase": "output_maps"}, {"score": 0.0032302647179383915, "phrase": "reference_map"}, {"score": 0.0031393948330209255, "phrase": "validation_interval"}, {"score": 0.0030337085953063125, "phrase": "first_step"}, {"score": 0.0026604207233593973, "phrase": "second_step"}, {"score": 0.002216054733102974, "phrase": "helpful_approach"}, {"score": 0.0021049977753042253, "phrase": "pattern_validation"}], "paper_keywords": ["Quantity and allocation", " Assessment", " Validation", " Land Change Model", " Land use and cover change (LUCC)"], "paper_abstract": "Our article illustrates how to compare the outputs from models that simulate transitions among categories through time. We illustrate the concepts by comparing two land change models: Land Change Modeler and Cellular Automata Markov. We show how the modeling options influence the quantity and allocation of simulated transitions, and how to compare output maps from pairs of model runs with respect to a reference map of transitions during the validation interval. We recommend that the first step is to assess the quantity of each transition and to determine the cause of the variation in quantity among model runs. The second step is to assess the allocation of transitions and to determine the cause of the variation in allocation among model runs. The separation of quantity and allocation of the transitions is a helpful approach to communicate how models work and to describe pattern validation. (C) 2015 Elsevier Ltd. All rights reserved.", "paper_title": "Comparison of simulation models in terms of quantity and allocation of land change", "paper_id": "WOS:000356548800018"}