{"auto_keywords": [{"score": 0.028177938188362218, "phrase": "tcdd"}, {"score": 0.013630835056952912, "phrase": "ahr"}, {"score": 0.011083709415733655, "phrase": "tcdd-mediated_toxicity"}, {"score": 0.009284266852024792, "phrase": "mathematical_model"}, {"score": 0.00481495049065317, "phrase": "cellular_toxic_response_mechanism"}, {"score": 0.004760518730536645, "phrase": "ahr_signal_transduction_pathway"}, {"score": 0.004653485665080485, "phrase": "cellular_system"}, {"score": 0.004566123591480369, "phrase": "interacting_parts"}, {"score": 0.004497410940849537, "phrase": "new_insights"}, {"score": 0.00444655284354007, "phrase": "complex_cellular_behavior"}, {"score": 0.004297388539539564, "phrase": "aryl_hydrocarbon_receptor"}, {"score": 0.004232702713825967, "phrase": "signal_transduction_pathway"}, {"score": 0.0040290957541568775, "phrase": "endocrine_disruptors"}, {"score": 0.003908678575537341, "phrase": "transcriptional_regulation"}, {"score": 0.003879138659123195, "phrase": "target_genes"}, {"score": 0.0034881908940439213, "phrase": "toxic_effects"}, {"score": 0.0033582976109650608, "phrase": "quantitative_system-level_understanding"}, {"score": 0.0031484483754909026, "phrase": "manually_curated_tcdd-mediated_ahr_signaling_pathway"}, {"score": 0.0030311679447397725, "phrase": "oxygen_deficiency"}, {"score": 0.002951673109860487, "phrase": "dna_damage_response"}, {"score": 0.002896167001212006, "phrase": "integrated_pathway"}, {"score": 0.0027776899345132193, "phrase": "quantitative_experiments"}, {"score": 0.0022284577808744316, "phrase": "system-level_understanding"}], "paper_keywords": [""], "paper_abstract": "Motivation: Viewing a cellular system as a collection of interacting parts can lead to new insights into the complex cellular behavior. In this study, we have investigated aryl hydrocarbon receptor (AhR) signal transduction pathway from such a system-level perspective. AhR detects various xenobiotics, such as drugs or endocrine disruptors (e.g. dioxin), and mediates transcriptional regulation of target genes such as those in the cytochrome P450 (CYP450) family. On binding with 2,3,7,8-tetrachlorodibenzo-p-dioxin (TCDD), however, AhR becomes abnormally activated and conveys toxic effects on cells. Despite many related studies on the TCDD-mediated toxicity, quantitative system-level understanding of how TCDD-mediated toxicity generates various toxic responses is still lacking. Results: Here, we present a manually curated TCDD-mediated AhR signaling pathway including crosstalks with the hypoxia pathway that copes with oxygen deficiency and the p53 pathway that induces a DNA damage response. Based on the integrated pathway, we have constructed a mathematical model and validated it through quantitative experiments. Using the mathematical model, we have investigated: (i) TCDD dose-dependent effects on AhR target genes; (ii) the crosstalk effect between AhR and hypoxia signals; and (iii) p53 inhibition effect of TCDD-liganded AhR. Our results show that cellular intake of TCDD induces AhR signaling pathway to be abnormally up-regulated and thereby interrupts other signaling pathways. Interruption of hypoxia and p53 pathways, in turn, can incur various hazardous effects on cells. Taken together, our study provides a system-level understanding of how AhR signal mediates various TCDD-induced toxicities under the presence of hypoxia and/or DNA damage in cells.", "paper_title": "A system-level investigation into the cellular toxic response mechanism mediated by AhR signal transduction pathway", "paper_id": "WOS:000281738900014"}