{"auto_keywords": [{"score": 0.03678718091825034, "phrase": "capacity_region"}, {"score": 0.03632066591054605, "phrase": "original_network"}, {"score": 0.00481495049065317, "phrase": "network_equivalence_-_part_ii"}, {"score": 0.004527619017250708, "phrase": "independent_channels"}, {"score": 0.004238682850598745, "phrase": "multiterminal_channels"}, {"score": 0.004074212307838049, "phrase": "new_tool"}, {"score": 0.003682207422331339, "phrase": "network_yields"}, {"score": 0.0036499505265403377, "phrase": "new_network"}, {"score": 0.003372019835750424, "phrase": "bounding_models"}, {"score": 0.003342471131048328, "phrase": "noiseless_links"}, {"score": 0.003298631258267805, "phrase": "lower_bounding_models"}, {"score": 0.003212663446866794, "phrase": "channel's_capacity_region"}, {"score": 0.0031845067058084583, "phrase": "upper_bounding_models"}, {"score": 0.003101503914610488, "phrase": "new_channel_characterization"}, {"score": 0.0024130437638400404, "phrase": "channel's_upper_and_lower_bounding_models"}, {"score": 0.0022192891418394514, "phrase": "upper_and_lower_bounding_models_bounds"}, {"score": 0.0021049977753042253, "phrase": "source-network_coding"}], "paper_keywords": ["Capacity", " network coding", " equivalence", " bounding channel models"], "paper_abstract": "A technique for bounding the capacities of networks of independent channels is introduced. Parts I and II treat point-to-point and multiterminal channels, respectively. Bounds are derived using a new tool called a bounding model. Channel 1 is an upper (lower) bounding model for channel 2 if replacing channel 2 by channel 1 in any network yields a new network whose capacity region is a superset (subset) of the capacity region of the original network. This paper derives bounding models from noiseless links, with lower bounding models corresponding to points in the channel's capacity region and upper bounding models corresponding to points in a new channel characterization called an emulation region. Replacing all channels in a network by their noiseless upper (lower) bounding models yields a network of lossless links whose capacity region is a superset (subset) of the capacity region for the original network. This converts a general (often stochastic) network into a network coding instance, enabling the application of tools and results derived in that domain. A channel's upper and lower bounding models differ when the channel can carry more information in some networks than in others. Bounding the difference between upper and lower bounding models bounds both the accuracy of the technique and the price of separating source-network coding from channel coding.", "paper_title": "A Theory of Network Equivalence - Part II: Multiterminal Channels", "paper_id": "WOS:000341982200001"}