{"auto_keywords": [{"score": 0.036385960404698464, "phrase": "dhl"}, {"score": 0.00481495049065317, "phrase": "high_speed_input-queued_switches"}, {"score": 0.004322186889256224, "phrase": "proper_scheduling_algorithm"}, {"score": 0.004010785080336424, "phrase": "line_rates"}, {"score": 0.00396110232316167, "phrase": "crucial_factor"}, {"score": 0.003799878496075633, "phrase": "novel_scheduler"}, {"score": 0.003482276061796395, "phrase": "ip_traffics"}, {"score": 0.003285380677401785, "phrase": "bursty_traffics"}, {"score": 0.0032044314332538154, "phrase": "optimal_version"}, {"score": 0.0030739103951333696, "phrase": "dhl's_area"}, {"score": 0.002657445352746803, "phrase": "input_ports"}, {"score": 0.0024759682272230735, "phrase": "low_complexity"}, {"score": 0.002424984362388813, "phrase": "different_service_policies"}, {"score": 0.002345579707333727, "phrase": "deadline_first"}, {"score": 0.002268769196700254, "phrase": "average_delay"}, {"score": 0.002158233639156017, "phrase": "switch_sizes"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Virtual Output Queuing (VOQ)", " packet switch", " iSLIP", " scheduling"], "paper_abstract": "Throughput of input queued switches using FIFOs is limited due to the Head of Line blocking (HoL) problem. Using VOQs at inputs and a proper scheduling algorithm, near 100%, throughput can be achieved. Scaling in terms of number of ports and line rates is a crucial factor for switches deployed in very high speed networks. We propose a novel scheduler called DHL, Decomposed Hierarchical Logaithmic, which is faster than schedulers like iSLIP while performing better for bursty and IP traffics. DHL supports priority in a manner better than other input queue switches especially for bursty traffics. We also propose an optimal version of DHL which is fairer while having half of DHL's area. By pipelining, it is also possible to increase its speed 2 times. DHL scales well in terms of performance, area, and delay. Its area scales linearly with the number of input ports and its delay grows logarithmically while its performance remains almost constant. Our scheduler can be implemented with a low complexity, while working with different service policies like Round Robin, RR, and Earliest Deadline First, EDF. We report our simulation results regarding the average delay, throughput, burst reduction, fairness and priority with respect to the switch sizes. (C) 2007 Elsevier B.V. All rights reserved.", "paper_title": "A logarithmic scheduling algorithm for high speed input-queued switches", "paper_id": "WOS:000253139300002"}