{"auto_keywords": [{"score": 0.03567507407574083, "phrase": "de-synchronization_attack"}, {"score": 0.00915291506242808, "phrase": "authentication_session"}, {"score": 0.00481495049065317, "phrase": "rfid_authentication_schemes_against_de-synchronization_attack."}, {"score": 0.0046328364646343375, "phrase": "rfid_tag"}, {"score": 0.0045820747375409435, "phrase": "malicious_tag_tracing_activities"}, {"score": 0.00428892403807229, "phrase": "tag_end"}, {"score": 0.004241914481080374, "phrase": "database_end"}, {"score": 0.003778253716938922, "phrase": "necessary_key_update_message"}, {"score": 0.0036553070575015344, "phrase": "key_re-synchronization"}, {"score": 0.00327356326590461, "phrase": "security_threat"}, {"score": 0.0032376465741070274, "phrase": "recent_rfid_authentication_schemes"}, {"score": 0.0030808211830129304, "phrase": "de-synchronized_secret"}, {"score": 0.00282048824450047, "phrase": "existing_authentication_protocols"}, {"score": 0.0026986685585382347, "phrase": "security_evaluation"}, {"score": 0.0024569466759289055, "phrase": "synchronization_mechanisms"}, {"score": 0.0023768935613577985, "phrase": "ii_schemes"}], "paper_keywords": ["De-synchronization attack", " RFID authentication", " Tag identification", " Security"], "paper_abstract": "In order to protect privacy of RFID tag against malicious tag tracing activities, most RFID authentication protocols support forward/backward security properties by updating the same secret values held at both tag end and database end asynchronously during each authentication session. However, in real network environments an adversary may easily interrupt or interfere transmission of necessary key update message in each authentication session such that key re-synchronization between tag and database cannot be completed, which is named as de-synchronization attack. To defend against this security threat, recent RFID authentication schemes have applied redundant secret/key design to allow a tag with de-synchronized secret to successfully communicate with server/database in its next authentication session. In this paper, we first categorize existing authentication protocols into three types based on their key update mechanisms. Then security evaluation on de-synchronization attack is conducted for type I and II protocols. Two attack models and theorems show that synchronization mechanisms used in type I and II schemes cannot defend against de-synchronization attack. Finally, three remarks are further presented to support our important finding: most existing RFID authentication schemes cannot simultaneously provide forward/backward security and resistance for de-synchronization attack in practical setting.", "paper_title": "NEW FINDINGS ON RFID AUTHENTICATION SCHEMES AGAINST DE-SYNCHRONIZATION ATTACK", "paper_id": "WOS:000306679500001"}