{"auto_keywords": [{"score": 0.030127688334548403, "phrase": "explicit_knowledge"}, {"score": 0.00481495049065317, "phrase": "experience_feedback_processes"}, {"score": 0.004625164125506718, "phrase": "current_trend"}, {"score": 0.004524801966077539, "phrase": "industrial_systems"}, {"score": 0.004099340908974491, "phrase": "continuous_improvement_methodologies"}, {"score": 0.00406945841245389, "phrase": "powerful_tools"}, {"score": 0.0035802796531956413, "phrase": "concerned_system"}, {"score": 0.003528244907944199, "phrase": "knowledge_management"}, {"score": 0.0035025217621688937, "phrase": "km"}, {"score": 0.0034516024325468653, "phrase": "increasingly_important_source"}, {"score": 0.0034264254358037653, "phrase": "competitive_advantage"}, {"score": 0.0032552377213294604, "phrase": "experience_feedback"}, {"score": 0.0031845067058084583, "phrase": "essential_role"}, {"score": 0.0031497178007011666, "phrase": "continuous_improvement"}, {"score": 0.0031267359296488118, "phrase": "industrial_activities"}, {"score": 0.0030143100083252516, "phrase": "semantic_interoperability"}, {"score": 0.0027405092973494293, "phrase": "significant_impact"}, {"score": 0.0025939803934423486, "phrase": "knowledge_objects"}, {"score": 0.0024915167458844914, "phrase": "experience_feedback_process_model"}, {"score": 0.0021597049163247476, "phrase": "crown_copyright"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["interoperability", " continuous improvement", " knowledge management", " experience feedback", " conceptual graphs"], "paper_abstract": "Because of the current trend of integration and interoperability of industrial systems, their size and complexity continue to grow making it more difficult to analyze, to understand and to solve the problems that happen in their organizations. Continuous improvement methodologies are powerful tools in order to understand and to solve problems, to control the effects of changes and finally to capitalize knowledge about changes and improvements. These tools involve suitably represent knowledge relating to the concerned system. Consequently, knowledge management (KM) is an increasingly important source of competitive advantage for organizations. Particularly, the capitalization and sharing of knowledge resulting from experience feedback are elements which play an essential role in the continuous improvement of industrial activities. In this paper, the contribution deals with semantic interoperability and relates to the structuring and the formalization of an experience feedback (EF) process aiming at transforming information or understanding gained by experience into explicit knowledge. The reuse of such knowledge has proved to have significant impact on achieving the missions of companies. However, the means of describing the knowledge objects of an experience generally remain informal. Based on an experience feedback process model and conceptual graphs, this paper takes domain ontology as a framework for the clarification of explicit knowledge and know-how, the aim of which is to get lessons learned descriptions that are significant, correct and applicable. Crown Copyright (C) 2008 Published by Elsevier B.V. All rights reserved.", "paper_title": "Knowledge formalization in experience feedback processes: An ontology-based approach", "paper_id": "WOS:000258367700007"}