{"auto_keywords": [{"score": 0.04969089536874819, "phrase": "health_information"}, {"score": 0.02322730111336099, "phrase": "granular_privacy_control"}, {"score": 0.004737201825299411, "phrase": "electronic_medical_records"}, {"score": 0.004641770842098217, "phrase": "patients'_desire"}, {"score": 0.004604136423327813, "phrase": "granular_level_privacy_control"}, {"score": 0.004091370602573054, "phrase": "card_task"}, {"score": 0.003802135020791801, "phrase": "electronic_medical_record_system"}, {"score": 0.003740679163860117, "phrase": "sensitive_health_information"}, {"score": 0.003490343299449249, "phrase": "electronic_medical_record"}, {"score": 0.0034060348526709634, "phrase": "potential_recipients"}, {"score": 0.002941147710077221, "phrase": "sensitive_records"}, {"score": 0.002870066750788841, "phrase": "less-sensitive_information"}, {"score": 0.0028121429464519733, "phrase": "sharing_preferences"}, {"score": 0.0025499307228648883, "phrase": "less-sensitive_emr_data"}, {"score": 0.0024182330686905256, "phrase": "privacy-preserving_emr_systems"}, {"score": 0.002350152413458658, "phrase": "privacy_and_sharing_preferences"}, {"score": 0.00224701149477484, "phrase": "medical_records"}, {"score": 0.0021926693625590006, "phrase": "patients'_preferences"}], "paper_keywords": [""], "paper_abstract": "Objective To assess patients' desire for granular level privacy control over which personal health information should be shared, with whom, and for what purpose; and whether these preferences vary based on sensitivity of health information. Materials and methods A card task for matching health information with providers, questionnaire, and interview with 30 patients whose health information is stored in an electronic medical record system. Most patients' records contained sensitive health information. Results No patients reported that they would prefer to share all information stored in an electronic medical record (EMR) with all potential recipients. Sharing preferences varied by type of information (EMR data element) and recipient (eg, primary care provider), and overall sharing preferences varied by participant. Patients with and without sensitive records preferred less sharing of sensitive versus less-sensitive information. Discussion Patients expressed sharing preferences consistent with a desire for granular privacy control over which health information should be shared with whom and expressed differences in sharing preferences for sensitive versus less-sensitive EMR data. The pattern of results may be used by designers to generate privacy-preserving EMR systems including interfaces for patients to express privacy and sharing preferences. Conclusions To maintain the level of privacy afforded by medical records and to achieve alignment with patients' preferences, patients should have granular privacy control over information contained in their EMR.", "paper_title": "Patients want granular privacy control over health information in electronic medical records", "paper_id": "WOS:000313512900003"}