{"auto_keywords": [{"score": 0.03431529454958107, "phrase": "novel_variant"}, {"score": 0.0045143706249204905, "phrase": "integration_process"}, {"score": 0.004014923642015515, "phrase": "integration_problem"}, {"score": 0.0039449104968131655, "phrase": "efficient_iterative_process"}, {"score": 0.003676811616723809, "phrase": "coupling_criteria"}, {"score": 0.002941913249957503, "phrase": "large_number"}, {"score": 0.0029075757820516634, "phrase": "conceptual_schemes"}, {"score": 0.0028069426877159642, "phrase": "upper_and_lower_bounds"}, {"score": 0.002381365139274329, "phrase": "np_hard_combinatorial_problem"}, {"score": 0.002339771435910601, "phrase": "experimental_activity"}, {"score": 0.002298902547676131, "phrase": "appreciable_increment"}, {"score": 0.0022192891418394514, "phrase": "schema_integration_process"}, {"score": 0.0021049977753042253, "phrase": "proposed_algorithm_w.r.t"}], "paper_keywords": ["conceptual schema", " schema integration", " clustering"], "paper_abstract": "When tens and even hundreds of schemas are involved in the integration process, criteria are needed for choosing clusters of schemas to be integrated, so as to deal with the integration problem through an efficient iterative process. Schemas in clusters should be chosen according to cohesion and coupling criteria that are based on similarities and dissimilarities among schemas. In this paper, we propose an algorithm for a novel variant of the correlation clustering approach that addresses the problem of assisting a designer in integrating a large number of conceptual schemes. The novel variant, introduces upper and lower bounds to the number of schemas in each cluster, in order to avoid too complex and too simple integration contexts respectively. We give a heuristic for solving the problem, being an NP hard combinatorial problem. An experimental activity demonstrates an appreciable increment in the effectiveness of the schema integration process when clusters are computed by means of the proposed algorithm w.r.t. the ones manually defined by an expert.", "paper_title": "A Clustering Algorithm for Planning the Integration Process of a Large Number of Conceptual Schemas", "paper_id": "WOS:000349577600016"}