{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "market_orientation"}, {"score": 0.004751216062917875, "phrase": "purpose_-_firms"}, {"score": 0.003907403442285109, "phrase": "-_structural_equation_modeling"}, {"score": 0.0036229421570951807, "phrase": "hospitality_industry"}, {"score": 0.003543273649210823, "phrase": "theoretical_approach"}, {"score": 0.0031845067058084583, "phrase": "positive_relationship"}, {"score": 0.0026534064006291853, "phrase": "longitudinal_study"}, {"score": 0.00260657976055413, "phrase": "practical_implications"}, {"score": 0.0024930878032164757, "phrase": "market_orientation_behaviors"}, {"score": 0.002152397315548125, "phrase": "positive_impacts"}, {"score": 0.0021049977753042253, "phrase": "different_aspects"}], "paper_keywords": ["Web 2.0", " Communications technologies"], "paper_abstract": "Purpose - Firms are adopting Web 2.0 technologies to improve collaboration, participation and communication; however there are few empirical studies testing the impact of this adoption. The purpose of this article is to analyze if there is a linkage amongst market orientation, Web 2.0 adoption and innovativeness. Design/methodology/approach - Structural equation modeling was used to test the relationships amongst the variables. A sample of 244 firms of the hospitality industry was used. The theoretical approach is based on the market orientation and innovativeness, concepts, which have been studied by various authors in the literature. Findings - A positive relationship was found between market orientation and Web 2.0 adoption and between Web 2.0 adoption and irmovativeness. Research limitations/implications - The study was developed in one industry, so in order to generalize the findings, additional testing in other industries should be developed. In addition a longitudinal study is encouraged. Practical implications - Managers are advised to adopt Web 2.0 technologies to strengthen market orientation behaviors and innovativeness. Originality/value - This article empirically tested the relationship between market orientation and Web 2.0 adoption and the impact of Web 2.0 adoption on innovativeness. Although some managers and researchers have reported some positive impacts of Web 2.0 on different aspects of the organization, there are still few empirical studies, and the authors contributed to fill this void.", "paper_title": "What are the relationships among Web 2.0, market orientation and innovativeness?", "paper_id": "WOS:000324449300010"}