{"auto_keywords": [{"score": 0.04541485776191827, "phrase": "residual_voltage"}, {"score": 0.015110158099439034, "phrase": "metal_oxide_surge_arresters"}, {"score": 0.00481495049065317, "phrase": "surge_arresters'_circuit_models"}, {"score": 0.004524624065803229, "phrase": "medium_and_high_voltage_systems"}, {"score": 0.004444921827311577, "phrase": "lightning_and_switching_overvoltages"}, {"score": 0.004289686492089576, "phrase": "metal_oxide_surge"}, {"score": 0.004232875294230749, "phrase": "dynamic_characteristics"}, {"score": 0.00408501512749186, "phrase": "current_front_time"}, {"score": 0.003389136094439662, "phrase": "surge_pulse"}, {"score": 0.0032129675521135616, "phrase": "dynamic_frequency-dependent_behavior"}, {"score": 0.003005539334280134, "phrase": "pscad."}, {"score": 0.0027252240573281163, "phrase": "manufacturers'_datasheet"}, {"score": 0.00260657976055413, "phrase": "lightning_performance"}, {"score": 0.002290858045013009, "phrase": "satisfactory_accuracy"}, {"score": 0.0021620042653528846, "phrase": "parameters'_estimation"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Surge arresters", " Simulation", " Transmission lines", " Failure probability", " Models"], "paper_abstract": "Metal oxide surge arresters are used to protect medium and high voltage systems and equipment against lightning and switching overvoltages. Measurements of the residual voltage of the metal oxide surge arresters indicate dynamic characteristics with the residual voltage to increase as the current front time descends and the residual voltage to reach its maximum, before the arrester current reaches its peak. Thus, the metal oxide surge arresters cannot be modeled by only a non-linear resistance, since its response depends on the magnitude and the rate of rise of the surge pulse. Several frequent dependent models have been proposed, in order to simulate this dynamic frequency-dependent behavior. This study constitutes a review of the most important models, which are tested using PSCAD. The residual voltage of each model, implying 5 kA, 10 kA and 20 kA 8/20 is impulse current, is compared with the manufacturers' datasheet. The models are also used to study the lightning performance of a Hellenic 150 kV transmission line with the arresters implemented on every one, two or three towers, calculating their failure probability. The results show that all models function with a satisfactory accuracy and the differences among the models arise in the difficulties of the parameters' estimation. (C) 2010 Elsevier B.V. All rights reserved.", "paper_title": "Surge arresters' circuit models review and their application to a Hellenic 150 kV transmission line", "paper_id": "WOS:000277638700010"}