{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "blog_adoption"}, {"score": 0.004064653055162238, "phrase": "individual_reading_and_writing_habits"}, {"score": 0.0037057255600764475, "phrase": "individual's_reading"}, {"score": 0.0030957429853133147, "phrase": "multiple_regression_analysis"}, {"score": 0.0030640804704319255, "phrase": "logistic_regression_analysis"}, {"score": 0.002971016979295967, "phrase": "reading_and_writing_habits"}, {"score": 0.0029255474957478474, "phrase": "significant_predictor"}, {"score": 0.0028076592725295646, "phrase": "rogers'_diffusion"}, {"score": 0.0027789349951704177, "phrase": "innovation_theory"}, {"score": 0.0026806884201358515, "phrase": "people's_habitual_characteristics"}, {"score": 0.002357249810661667, "phrase": "subsequent_analysis"}, {"score": 0.0022856052476424344, "phrase": "heavier_reading_habit_group"}, {"score": 0.0022161333611134806, "phrase": "earlier_stage"}, {"score": 0.0021049977753042253, "phrase": "heavier_writing_habits_groups"}], "paper_keywords": ["reading habits", " writing habits", " blog adoption", " diffusion of innovation"], "paper_abstract": "Blogs are one of the most widely used Internet applications; however, there is a lack of attention paid to understanding blog adoption with respect to individual reading/writing habits. This paper, therefore, investigates how individual reading and writing habits contribute to blog adoption. A survey was conducted in order to understand the relationship between an individual's reading and writing habits, in terms of reading/writing attitude and reading/writing behavioural patterns, and the adoption of blogs. A total of 210 blog users participated in the study. Hypotheses were tested and data were analysed using multiple regression analysis and logistic regression analysis. The results revealed that reading and writing habits are a significant predictor of blog adoption. Furthermore, based on Rogers' diffusion of innovation theory, this study also investigated whether people's habitual characteristics (i.e. heavy and light) have some sort of relationship with the stage of blog adoption (i.e. earlier and later). A subsequent analysis showed that people with a heavier reading habit group tended to adopt at an earlier stage, while this consequence was absent in those with heavier writing habits groups.", "paper_title": "The effects of reading and writing habits on blog adoption", "paper_id": "WOS:000359737100005"}