{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "public_participation"}, {"score": 0.03498048027388705, "phrase": "end_users"}, {"score": 0.015615632001564043, "phrase": "urban_planning_processes"}, {"score": 0.015055177929495324, "phrase": "urban_planning_project"}, {"score": 0.004442032546224076, "phrase": "everyday_life"}, {"score": 0.00432423070113186, "phrase": "general_public"}, {"score": 0.004280861452668641, "phrase": "urban_planning_professionals"}, {"score": 0.00407042677958844, "phrase": "emerging_technology"}, {"score": 0.003922685601503529, "phrase": "urban_planning_projects"}, {"score": 0.0037297918570822876, "phrase": "multimedia_information_channels"}, {"score": 0.0036553070575015344, "phrase": "technical_issues"}, {"score": 0.003510754567808717, "phrase": "web_services"}, {"score": 0.0033946556965877873, "phrase": "visual_planning_model_sharing"}, {"score": 0.003206002589892253, "phrase": "global_scale"}, {"score": 0.0031419449938286663, "phrase": "street_scale"}, {"score": 0.003110396267535251, "phrase": "swift_zooming_tools"}, {"score": 0.0030895394261534776, "phrase": "google_earth"}, {"score": 0.0030278017562213265, "phrase": "available_urban_planning_solution"}, {"score": 0.002878785759716458, "phrase": "urban_planning_information"}, {"score": 0.0027278879752324157, "phrase": "end_user's_own_computer"}, {"score": 0.0026914126067254444, "phrase": "architecture's_capability"}, {"score": 0.002664375650349975, "phrase": "distributed_resources"}, {"score": 0.002465895175961543, "phrase": "auxiliary_spatial_analysis_tools"}, {"score": 0.0024084679931209514, "phrase": "\"professional\"_tasks"}, {"score": 0.0023842666006371267, "phrase": "sunlight_analysis"}, {"score": 0.0023287359930308864, "phrase": "highly_distributed_system"}, {"score": 0.002251637552201872, "phrase": "personal_computer"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Virtual Globe", " Service Oriented Architecture (SOA)", " Visualization", " Interaction", " Public participation", " Urban planning"], "paper_abstract": "Public participation is very important for the success of an urban planning project, since any urban planning project will ultimately become part of the everyday life of the public. Most members of the general public are not urban planning professionals; therefore, well-designed visualization and interactive tools can help expand their participation in urban planning processes. The emerging technology of virtual globe-based 3D visualization is a unique opportunity to facilitate public participation in urban planning projects by promoting intuitive 3D interaction, instant interoperability and seamless integration of 3D visualization with other traditional text and multimedia information channels. This paper discusses the technical issues of developing a virtual globe-based 3D visualization framework for publicizing urban planning information, using Web Services and Service Oriented Architecture (SOA) to support visual planning model sharing and interoperability. With 3D photorealistic visualization, end users can conveniently obtain both the macro-vision of a project on the global scale and the micro-details on the street scale, using swift zooming tools like Google Earth. End users can select any available urban planning solution for visual investigation and comparison in a virtual globe-based 3D visualization environment. The service oriented architecture allows urban planning information to be deployed as a service in one server or several geographically distributed servers, or even from the end user's own computer. With the architecture's capability for integrating distributed resources, other traditional interactive functions such as labeling, BBS, forum, and email, can also be conveniently integrated into the system. Auxiliary spatial analysis tools are integrated to help end users perform \"professional\" tasks such as sunlight analysis and 3D distance measurement. This highly distributed system is designed for the Internet; therefore, any personal computer connected to the Internet can easily access the system and participate in the interaction. (C) 2009 Elsevier Ltd. All rights reserved.", "paper_title": "A virtual globe-based 3D visualization and interactive framework for public participation in urban planning processes", "paper_id": "WOS:000279466200004"}