{"auto_keywords": [{"score": 0.04898689815940368, "phrase": "cloud_computing"}, {"score": 0.033865838751225646, "phrase": "heterogeneous_clouds"}, {"score": 0.00481495049065317, "phrase": "auto_scalable_virtual_cluster_system"}, {"score": 0.004640398886726948, "phrase": "emerging_technology"}, {"score": 0.004492841495994535, "phrase": "resource_utilization"}, {"score": 0.004349955692802962, "phrase": "main_advantages"}, {"score": 0.004211594861013822, "phrase": "resource_allocations"}, {"score": 0.003752275718257509, "phrase": "new_business"}, {"score": 0.003358368814209542, "phrase": "virtual_cluster_system"}, {"score": 0.0032364494905485677, "phrase": "computing_resources"}, {"score": 0.0031479142819948007, "phrase": "uniform_view"}, {"score": 0.0031045562469735307, "phrase": "resource_management"}, {"score": 0.0028172726995962173, "phrase": "system_pool"}, {"score": 0.0027784560880013886, "phrase": "main_design_philosophy"}, {"score": 0.002702415623060517, "phrase": "batch_system"}, {"score": 0.0024636239664210433, "phrase": "pilot_system_development"}, {"score": 0.002418453525649304, "phrase": "fermicloud"}, {"score": 0.0023091093387071593, "phrase": "public_cloud_system"}, {"score": 0.0021049977753042253, "phrase": "virtual_cluster_systems"}], "paper_keywords": ["vcluster", " Virtual cluster", " Cloud resource management", " Heterogeneous clouds"], "paper_abstract": "Cloud computing is an emerging technology and is being widely considered for resource utilization in various research areas. One of the main advantages of cloud computing is its flexibility in computing resource allocations. Many computing cycles can be ready in very short time and can be smoothly reallocated between tasks. Because of this, there are many private companies entering the new business of reselling their idle computing cycles. Research institutes have also started building their own cloud systems for their various research purposes. In this paper, we introduce a framework for virtual cluster system called vcluster which is capable of utilizing computing resources from heterogeneous clouds and provides a uniform view in computing resource management. vcluster is an IaaS (Infrastructure as a Service) based cloud resource management system. It distributes batch jobs to multiple clouds depending on the status of queue and system pool. The main design philosophy behind vcluster is cloud and batch system agnostic and it is achieved through plugins. This feature mitigates the complexity of integrating heterogeneous clouds. In the pilot system development, we use FermiCloud and Amazon EC2, which are a private and a public cloud system, respectively. In this paper, we also discuss the features and functionalities that must be considered in virtual cluster systems.", "paper_title": "vcluster: a framework for auto scalable virtual cluster system in heterogeneous clouds", "paper_id": "WOS:000341081900012"}