{"auto_keywords": [{"score": 0.004734448316824488, "phrase": "active_contours"}, {"score": 0.004694700982410345, "phrase": "anatomical_and_functional_significant_structures"}, {"score": 0.00462919213721188, "phrase": "important_tasks"}, {"score": 0.004564593196155079, "phrase": "medical_image_analysis"}, {"score": 0.0043150485532080065, "phrase": "algorithmic_development"}, {"score": 0.0038668462001710314, "phrase": "entire_community"}, {"score": 0.00378080526397273, "phrase": "present_work"}, {"score": 0.003686287033216415, "phrase": "new_robust_statistics"}, {"score": 0.0036245864938417964, "phrase": "conformal_area"}, {"score": 0.0036042491702884052, "phrase": "multiple_active_contour_framework"}, {"score": 0.0035539019235553897, "phrase": "multiple_targets"}, {"score": 0.0035339597999254064, "phrase": "mr_and_ct_medical_imagery"}, {"score": 0.003349984456443527, "phrase": "end_users"}, {"score": 0.0033311827561285194, "phrase": "multiple_platforms"}, {"score": 0.0032570218602237773, "phrase": "segmentation_task"}, {"score": 0.0031845067058084583, "phrase": "user_drawn_strokes"}, {"score": 0.003131178497790961, "phrase": "target_region"}, {"score": 0.0030614565460256897, "phrase": "local_robust_statistics"}, {"score": 0.0029020077365708966, "phrase": "non-parametric_estimation_scheme"}, {"score": 0.0027200305495826797, "phrase": "mutual_exclusiveness"}, {"score": 0.002607527117561699, "phrase": "multiple_objects"}, {"score": 0.0025855896351972586, "phrase": "entire_image_domain"}, {"score": 0.002416589459425828, "phrase": "desired_positions"}, {"score": 0.0023962545023307937, "phrase": "desired_multiple_objects"}, {"score": 0.002195866991284673, "phrase": "reader_reproducible_experiments"}, {"score": 0.0021529842700733974, "phrase": "proposed_segmentation_tool"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Interactive segmentation", " Open science", " Multiple object segmentation", " Active contours", " Robust statistics"], "paper_abstract": "Extracting anatomical and functional significant structures renders one of the important tasks for both the theoretical study of the medical image analysis, and the clinical and practical community. In the past, much work has been dedicated only to the algorithmic development. Nevertheless, for clinical end users, a well designed algorithm with an interactive software is necessary for an algorithm to be utilized in their daily work. Furthermore, the software would better be open sourced in order to be used and validated by not only the authors but also the entire community. Therefore, the contribution of the present work is twofolds: first, we propose a new robust statistics based conformal metric and the conformal area driven multiple active contour framework, to simultaneously extract multiple targets from MR and CT medical imagery in 3D. Second, an open source graphically interactive 3D segmentation tool based on the aforementioned contour evolution is implemented and is publicly available for end users on multiple platforms. In using this software for the segmentation task, the process is initiated by the user drawn strokes (seeds) in the target region in the image. Then, the local robust statistics are used to describe the object features, and such features are learned adaptively from the seeds under a non-parametric estimation scheme. Subsequently, several active contours evolve simultaneously with their interactions being motivated by the principles of action and reaction-this not only guarantees mutual exclusiveness among the contours, but also no longer relies upon the assumption that the multiple objects fill the entire image domain, which was tacitly or explicitly assumed in many previous works. In doing so, the contours interact and converge to equilibrium at the desired positions of the desired multiple objects. Furthermore, with the aim of not only validating the algorithm and the software, but also demonstrating how the tool is to be used, we provide the reader reproducible experiments that demonstrate the capability of the proposed segmentation tool on several public available data sets. (c) 2012 Elsevier B.V. All rights reserved.", "paper_title": "A 3D interactive multi-object segmentation tool using local robust statistics driven active contours", "paper_id": "WOS:000309694100012"}