{"auto_keywords": [{"score": 0.04625444975187318, "phrase": "induced_path"}, {"score": 0.015584374765208468, "phrase": "claw-free_graphs"}, {"score": 0.014354522408900176, "phrase": "even_length"}, {"score": 0.004278807087784626, "phrase": "related_problems"}, {"score": 0.004260134699483774, "phrase": "odd_induced_path"}, {"score": 0.003753315287090587, "phrase": "np"}, {"score": 0.0032764307492734145, "phrase": "even_pair"}, {"score": 0.002898378776839434, "phrase": "claw-free_graph_form"}, {"score": 0.002328238264850759, "phrase": "claw-free_graph"}, {"score": 0.002297831085501592, "phrase": "induced_cycle"}, {"score": 0.0022480304016499605, "phrase": "specified_vertex"}, {"score": 0.0021705796895687864, "phrase": "shortest_induced_path"}, {"score": 0.0021049977753042253, "phrase": "claw-free_perfect_graph"}], "paper_keywords": ["Induced path", " Parity path", " Claw-free graph", " Polynomial-time algorithm"], "paper_abstract": "The Parity Path problem is to decide if a given graph contains both an induced path of odd length and an induced path of even length between two specified vertices. In the related problems Odd Induced Path and Even Induced Path, the goal is to determine whether an induced path of odd, respectively even, length between two specified vertices exists. Although all three problems are NP-complete in general, we show that they can be solved in O(n(5)) time for the class of claw-free graphs. Two vertices s and t form an even pair in G if every induced path from s to t in G has even length. Our results imply that the problem of deciding if two specified vertices of a claw-free graph form an even pair, as well as the problem of deciding if a given claw-free graph has an even pair, can be solved in O(n(5)) time and O(n(7)) time, respectively. We also show that we can decide in O(n(7)) time whether a claw-free graph has an induced cycle of given parity through a specified vertex. Finally, we show that a shortest induced path of given parity between two specified vertices of a claw-free perfect graph can be found in O(n(7)) time.", "paper_title": "Finding Induced Paths of Given Parity in Claw-Free Graphs", "paper_id": "WOS:000298388200024"}