{"auto_keywords": [{"score": 0.03999449666921275, "phrase": "static_analysis"}, {"score": 0.03952148495928651, "phrase": "router_configurations"}, {"score": 0.00481495049065317, "phrase": "routing_configurations"}, {"score": 0.004555028829645471, "phrase": "internet_routing_configuration"}, {"score": 0.004362564831572539, "phrase": "primary_method"}, {"score": 0.0034506596895901003, "phrase": "broader_approaches"}, {"score": 0.003204232566468624, "phrase": "human_intervention"}, {"score": 0.0029753513692467315, "phrase": "multi-layer_analysis_framework"}, {"score": 0.002487296495786493, "phrase": "event_monitoring"}, {"score": 0.0024416087858984644, "phrase": "active_analysis"}, {"score": 0.0023819914954155905, "phrase": "external_information"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Routing policy", " Management of routing configurations", " BGP", " RPSL", " RPSLng", " Route Server"], "paper_abstract": "Several research works have shown that the process of Internet routing configuration is error-prone. The primary method used by operators to determine whether their routing configurations are correct is to try them out in operation. A more advanced method is the static analysis of router configurations before they are deployed. We believe that there is a need of broader approaches to verify router configurations automatically and continuously, that is, without human intervention before and after they are deployed. This paper describes a multi-layer analysis framework for configuration checking, which includes three analysis tasks: static analysis before the configuration is deployed; runtime analysis after the configuration is deployed. which is based on routing event monitoring: and active analysis based on checking external information provided by third-parties. We also present the most relevant details of the implementation of our framework. (C) 2009 Elsevier Ltd. All rights reserved.", "paper_title": "Multi-layer framework for analysing and managing routing configurations", "paper_id": "WOS:000269927300003"}