{"auto_keywords": [{"score": 0.05007852962010534, "phrase": "ideal_color_scheme"}, {"score": 0.004724365740062236, "phrase": "four-dimensional_models"}, {"score": 0.004569905085027681, "phrase": "added_dimension"}, {"score": 0.0045052562941109734, "phrase": "schedule_information"}, {"score": 0.004399525320473839, "phrase": "important_tool"}, {"score": 0.004337276328199398, "phrase": "construction_processes"}, {"score": 0.004116440453049531, "phrase": "different_construction_states"}, {"score": 0.0037432199549135826, "phrase": "potential_problems"}, {"score": 0.0028006988338192375, "phrase": "example_case"}, {"score": 0.0027610089418453614, "phrase": "proposed_procedure"}, {"score": 0.0026705669656375197, "phrase": "six_construction_states"}, {"score": 0.0026077803487003, "phrase": "plant_construction"}, {"score": 0.002570817338292482, "phrase": "total_ten_color_schemes"}, {"score": 0.002371018116266096, "phrase": "seut_procedure"}, {"score": 0.002337403139264533, "phrase": "effective_method"}, {"score": 0.002304263635960015, "phrase": "color_schemes"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": [""], "paper_abstract": "Four-dimensional models, which are 3D models with an added dimension to represent schedule information, have become an important tool in representing construction processes. These models usually rely on colors to represent the different construction states, such that when an ideal color scheme is used, engineers are able to understand the model and identify the potential problems more easily. However, up to this point, little research has been conducted in this area. This paper presents the selection, examination, and user test (SEUT) procedure, a systematic procedure to determine the ideal color scheme for a 4D model. This procedure can be performed iteratively to obtain the ideal color scheme, which would fit a 4D model according to its construction purposes. After conducting an example case following the proposed procedure, we determined an ideal color scheme for six construction states of a 4D model for plant construction. In total ten color schemes were examined and testing was conducted by 58 users over two iterations. The results show that the SEUT procedure is an effective method for determining color schemes to present 4D models and an ideal color scheme was validated and recommended in this research. (C) 2009 Elsevier Ltd. All rights reserved.", "paper_title": "Systematic procedure of determining an ideal color scheme on 4D models", "paper_id": "WOS:000271343900011"}