{"auto_keywords": [{"score": 0.03659494279253418, "phrase": "firm_performance"}, {"score": 0.021215940711217074, "phrase": "environmental_volatility"}, {"score": 0.00481495049065317, "phrase": "competing_perspectives"}, {"score": 0.004730338746443662, "phrase": "strategic_information_technology_alignment_and_organizational_agility"}, {"score": 0.004647206916983993, "phrase": "mediation_model._strategic_information_technology_alignment"}, {"score": 0.004422094335127632, "phrase": "recent_rise"}, {"score": 0.004163290958633733, "phrase": "market-based_threats"}, {"score": 0.003989742144066683, "phrase": "unresolved_issue"}, {"score": 0.00376950244909, "phrase": "positive_or_negative_relationship"}, {"score": 0.003449379912099073, "phrase": "varying_conditions"}, {"score": 0.003329051037399227, "phrase": "matched_survey"}, {"score": 0.0032820992275066274, "phrase": "business_executives"}, {"score": 0.003201516237269705, "phrase": "positive_and_significant_link"}, {"score": 0.002748016244165687, "phrase": "greater_impact"}, {"score": 0.0025504217985882725, "phrase": "volatile_environment"}, {"score": 0.0024789326485851666, "phrase": "positive_and_significant_main_effect"}, {"score": 0.0022124176057373365, "phrase": "strategic_it_alignment"}, {"score": 0.0021967433763351884, "phrase": "organizational_agility"}, {"score": 0.0021049977753042253, "phrase": "critical_and_concurrent_organizational_goals"}], "paper_keywords": ["Agility", " strategic IT alignment", " environmental change", " volatility", " IT infrastructure flexibility", " IT rigidity traps", " industry clockspeed"], "paper_abstract": "Strategic information technology alignment remains a top priority for business and IT executives. Yet with a recent rise in environmental volatility, firms are asking how to be more agile in identifying and responding to market-based threats and opportunities. Whether alignment helps or hurts agility is an unresolved issue. This paper presents a variety of arguments from the literature that alternately predict a positive or negative relationship between alignment and agility. This relationship is then tested using a model in which agility mediates the link between alignment and firm performance under varying conditions of IT infrastructure flexibility and environmental volatility. Using data from a matched survey of IT and business executives in 241 firms, we uncover a positive and significant link between alignment and agility and between agility and firm performance. We also show that the effect of alignment on performance is fully mediated by agility, that environmental volatility positively moderates the link between agility and firm performance, and that agility has a greater impact on firm performance in more volatile markets. While IT infrastructure flexibility does not moderate the link between alignment and agility, except in a volatile environment, we reveal that IT infrastructure flexibility has a positive and significant main effect on agility. In fact, the effect of IT infrastructure flexibility on agility is as strong as the effect of alignment on agility. This research extends and integrates the literature on strategic IT alignment and organizational agility at a time when both alignment and agility are recognized as critical and concurrent organizational goals.", "paper_title": "COMPETING PERSPECTIVES ON THE LINK BETWEEN STRATEGIC INFORMATION TECHNOLOGY ALIGNMENT AND ORGANIZATIONAL AGILITY: INSIGHTS FROM A MEDIATION MODEL", "paper_id": "WOS:000290842900011"}