{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "nearest_neighbor_search"}, {"score": 0.049604883316905664, "phrase": "uncertain_spatial_databases"}, {"score": 0.0046269981365987915, "phrase": "new_problem"}, {"score": 0.004272724011826495, "phrase": "multidimensional_probability_density_function"}, {"score": 0.004188459638572375, "phrase": "query_point"}, {"score": 0.0040449598280454645, "phrase": "nearest_neighbor"}, {"score": 0.0038676325043529524, "phrase": "nonzero_probability"}, {"score": 0.0032004205378150354, "phrase": "superseding_nearest_neighbor"}, {"score": 0.002481747081849503, "phrase": "best_objects"}, {"score": 0.002158179521369965, "phrase": "conventional_multidimensional_index"}, {"score": 0.0021049977753042253, "phrase": "extensive_experiments"}], "paper_keywords": ["Nearest neighbor", " uncertain", " spatial database"], "paper_abstract": "This paper proposes a new problem, called superseding nearest neighbor search, on uncertain spatial databases, where each object is described by a multidimensional probability density function. Given a query point q, an object is a nearest neighbor (NN) candidate if it has a nonzero probability to be the NN of q. Given two NN-candidates o(1) and o(2), o(1) supersedes o(2) if o(1) is more likely to be closer to q. An object is a superseding nearest neighbor (SNN) of q, if it supersedes all the other NN-candidates. Sometimes no object is able to supersede every other NN-candidate. In this case, we return the SNN-core-the minimum set of NN-candidates each of which supersedes all the NN-candidates outside the SNN-core. Intuitively, the SNN-core contains the best objects, because any object outside the SNN-core is worse than all the objects in the SNN-core. We show that the SNN-core can be efficiently computed by utilizing a conventional multidimensional index, as confirmed by extensive experiments.", "paper_title": "Superseding Nearest Neighbor Search on Uncertain Spatial Databases", "paper_id": "WOS:000277717500010"}