{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "collective_knowledge"}, {"score": 0.04832084631284738, "phrase": "learning_spaces"}, {"score": 0.043110099611702445, "phrase": "information_spaces"}, {"score": 0.004467900288375827, "phrase": "novel_technological_approach"}, {"score": 0.003912768486550741, "phrase": "ontology_development_life-cycle"}, {"score": 0.0037947482487057076, "phrase": "educational_benefits"}, {"score": 0.003438058620195309, "phrase": "collaborative_and_human-centered_ontology_engineering_methodology"}, {"score": 0.0032892054393958052, "phrase": "hcome"}, {"score": 0.0032008144731234265, "phrase": "key_technologies"}, {"score": 0.0031682817605340028, "phrase": "semantic_wiki"}, {"score": 0.0031147914181909775, "phrase": "ontology_engineering_methodologies"}, {"score": 0.0030310732341527168, "phrase": "learning_spaces_construction"}, {"score": 0.003010496595090984, "phrase": "different_domain-specific_information_spaces"}, {"score": 0.002929573369977573, "phrase": "innovative_conceptualizations"}, {"score": 0.002812237329893584, "phrase": "intertwined_ontological_meta-models"}, {"score": 0.002755338691613447, "phrase": "future_reference"}, {"score": 0.0027366287564324966, "phrase": "tutoring_support"}, {"score": 0.002681255756642227, "phrase": "ontology_engineering_courses"}, {"score": 0.002222994077182071, "phrase": "ontology_engineering"}, {"score": 0.0021928902836049363, "phrase": "integrated_set"}, {"score": 0.0021049977753042253, "phrase": "collaborative_engineering"}], "paper_keywords": ["collaborative knowledge building", " argumentation models", " semantic wiki technology", " ontologies"], "paper_abstract": "The aim of this paper is to present a novel technological approach for enhancing the collective knowledge of communities of learners on the engineering of ontologies within a collaborative, open and socially constructed environment. The proposed technology aims at shaping information spaces into ontologies in a collaborative, communicative and learner-centered way during the ontology development life-cycle. The paper conjectures that such a collaborative environment can yield educational benefits, thus there is need to follow principles that apply in the Computer Supported Collaborative Learning (CSCL) paradigm. This work is mainly based on a collaborative and human-centered ontology engineering methodology and on a meta-ontology framework for developing ontologies, namely HCOME and HCOME-3O respectively. The integration of key technologies such as Semantic Wiki and Argumentation models with Ontology Engineering methodologies and tools serve as an enabler of learning spaces construction for different domain-specific information spaces in open settings. Inside these learning spaces innovative conceptualizations (both domain and development) are conceived, described by intertwined ontological meta-models following the HCOME-3O specifications for future reference and tutoring support. Such learning spaces support two types of ontology engineering courses: a) courses related to the know-how of shaping information spaces into ontologies (namely, the development knowledge) and b) courses related to the analysis of the domain itself (namely, the domain knowledge). The paper reports on the evaluation of the approach within a CSCL setting in Ontology Engineering, using the integrated set of tools and the framework that have been developed for the collaborative engineering of ontologies.", "paper_title": "Enhancing the Collective Knowledge for the Engineering of Ontologies in Open and Socially Constructed Learning Spaces", "paper_id": "WOS:000298051000006"}