{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "extremal_graphs"}, {"score": 0.04878455414226704, "phrase": "graph_invariants"}, {"score": 0.004630055463858585, "phrase": "graph_invariant"}, {"score": 0.00452252857066346, "phrase": "graph_g"}, {"score": 0.004383016741930174, "phrase": "g's_vertices"}, {"score": 0.004298006360831255, "phrase": "algebraic_expression"}, {"score": 0.0041653916552844535, "phrase": "graph_theory"}, {"score": 0.0037471850931318942, "phrase": "maximum_or_minimum_value"}, {"score": 0.003491894048789576, "phrase": "air_automated_way"}, {"score": 0.0034107088717109857, "phrase": "carefully_distinguished_cases"}, {"score": 0.003357633232360232, "phrase": "assisted_way"}, {"score": 0.0032667240408191015, "phrase": "systematic_comparison"}, {"score": 0.002973261772253616, "phrase": "best_possible_lower_and_upper_bounding_functions"}, {"score": 0.002727409429089543, "phrase": "automatically_algebraic_kind_corresponding_structural_conjectures"}, {"score": 0.002501835053002899, "phrase": "algebraic_conjectures"}, {"score": 0.002331189621118592, "phrase": "assisted_proofs"}], "paper_keywords": [""], "paper_abstract": "A graph invariant is a function of a graph G which does not depend on labeling of G's vertices or edges. An algebraic expression of one or several graph invariants is itself an invariant. Graph theory is replete with theorems about graph invariants, which are either algebraic, i.e., equalities or inequalities involving such invariants, or structural, i.e., characterizations of which families of graphs are extremal for a given invariant, that is give it maximum or minimum value. Both types of results can be conjectured by the system AutoGiaphiX 2 (AGX 2) in air automated way, or, in some carefully distinguished cases, in an assisted way. We report here on a systematic comparison of 20 graph invariants: for each pair of them, AGX 2 considers the four operations +, -, x, / and derives best possible lower and upper bounding functions of the number of vertices, as well as extremal graphs. Out of 1620 cases, AGX 2 recognizes 37 known results, derives automatically algebraic kind corresponding structural conjectures in 1260 cases (841 of which are proved automatically), and structural conjectures only in 168 more cases, from which algebraic conjectures could be derived by hand in 86 cases. No results were obtained in 55 cases. Manual or assisted proofs have been obtained in 394 cases, 22 conjectures were refuted and 171 conjectures remain open. Many examples are given. AGX 2 is also compared to the three operational systems GRAPH, GRAFFITI and HR.", "paper_title": "Variable Neighborhood search for extremal graphs. 20. Automated comparison of graph invariants", "paper_id": "WOS:000249283700007"}