{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "automated_vessel_segmentation"}, {"score": 0.004769182299692333, "phrase": "computed_tomography_scans"}, {"score": 0.004272969980602508, "phrase": "different_algorithms"}, {"score": 0.004172094622123562, "phrase": "thoracic_computed_tomography"}, {"score": 0.004054169947971483, "phrase": "vessel_segmentation"}, {"score": 0.003977403701783668, "phrase": "computer_aided_processing"}, {"score": 0.003828187766572941, "phrase": "manual_vessel_segmentation"}, {"score": 0.003702206069379459, "phrase": "real_world_application"}, {"score": 0.003332537728389913, "phrase": "standardized_evaluation"}, {"score": 0.003253791343615811, "phrase": "annotated_reference_dataset"}, {"score": 0.003176899769744057, "phrase": "nine_categories"}, {"score": 0.00311669276800628, "phrase": "comprehensive_evaluation"}, {"score": 0.003087017178815267, "phrase": "vessel_segmentation_algorithms"}, {"score": 0.002873247913129334, "phrase": "international_symposium"}, {"score": 0.002549269480908849, "phrase": "new_participants"}, {"score": 0.002350041573006264, "phrase": "new_algorithms"}], "paper_keywords": ["Thoracic computed tomography", " Lung vessels", " Algorithm comparison", " Segmentation", " Challenge"], "paper_abstract": "The VESSEL12 (VESsel SEgmentation in the Lung) challenge objectively compares the performance of different algorithms to identify vessels in thoracic computed tomography (CT) scans. Vessel segmentation is fundamental in computer aided processing of data generated by 3D imaging modalities. As manual vessel segmentation is prohibitively time consuming, any real world application requires some form of automation. Several approaches exist for automated vessel segmentation, but judging their relative merits is difficult due to a lack of standardized evaluation. We present an annotated reference dataset containing 20 CT scans and propose nine categories to perform a comprehensive evaluation of vessel segmentation algorithms from both academia and industry. Twenty algorithms participated in the VESSEL12 challenge, held at International Symposium on Biomedical Imaging (ISBI) 2012. All results have been published at the VESSEL12 website http://vessel12.grand-challenge.org. The challenge remains ongoing and open to new participants. Our three contributions are: (1) an annotated reference dataset available online for evaluation of new algorithms; (2) a quantitative scoring system for objective comparison of algorithms; and (3) performance analysis of the strengths and weaknesses of the various vessel segmentation methods in the presence of various lung diseases. (C) 2014 Elsevier B.V. All rights reserved.", "paper_title": "Comparing algorithms for automated vessel segmentation in computed tomography scans of the lung: the VESSEL12 study", "paper_id": "WOS:000342256200021"}