{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "historical_events"}, {"score": 0.03979231715020777, "phrase": "geospatial_named_entities"}, {"score": 0.004562847483469705, "phrase": "temporal_and_geospatial_entities"}, {"score": 0.004452641437293878, "phrase": "first_task"}, {"score": 0.004178351419209898, "phrase": "important_events"}, {"score": 0.004057495982111461, "phrase": "second_task"}, {"score": 0.003998380230709541, "phrase": "named_entities"}, {"score": 0.0034693659976716197, "phrase": "place_name"}, {"score": 0.0032554492909625653, "phrase": "article_context"}, {"score": 0.003099888654615187, "phrase": "key_events"}, {"score": 0.002729246328390722, "phrase": "wikipedia_articles"}, {"score": 0.002498873893632724, "phrase": "major_events"}, {"score": 0.002276717177453959, "phrase": "news_articles"}, {"score": 0.0021999341184897217, "phrase": "evita"}, {"score": 0.002178572521340921, "phrase": "google"}, {"score": 0.0021049977753042253, "phrase": "support_vector_machines"}], "paper_keywords": ["information extraction", " temporal extraction", " geospatial entity extraction", " natural language processing"], "paper_abstract": "This paper discusses a system that extracts and displays temporal and geospatial entities in text. The first task involves identification of all events in a document followed by identification of important events using a classifier. The second task involves identifying named entities associated with the document. In particular, we extract geospatial named entities. We disambiguate the set of geospatial named entities and geocode them to determine the correct coordinates for each place name, often called grounding. We resolve ambiguity based on sentence and article context. Finally, we present a user with the key events and their associated people, places and organizations within a document in terms of a timeline and a map. For purposes of testing, we use Wikipedia articles about historical events, such as those describing wars, battles and invasions. We focus on extracting major events from the articles, although our ideas and tools can be easily used with articles from other sources such as news articles. We use several existing tools such as Evita, Google Maps, publicly available implementations of Support Vector Machines, Hidden Markov Model and Conditional Random Field, and the MIT SIMILE Timeline.", "paper_title": "Extracting and Displaying Temporal and Geospatial Entities from Articles on Historical Events", "paper_id": "WOS:000332331700005"}