{"auto_keywords": [{"score": 0.038040599030405575, "phrase": "dmc"}, {"score": 0.006578279554129321, "phrase": "physical_channel"}, {"score": 0.00510483053530331, "phrase": "dmc_networks"}, {"score": 0.00481495049065317, "phrase": "networking_challenges"}, {"score": 0.0047268728636719725, "phrase": "diffusion-based_molecular_communication._nanotechnology"}, {"score": 0.004555499634179394, "phrase": "simple_tasks"}, {"score": 0.004431041346291019, "phrase": "data_storage"}, {"score": 0.00432991746993101, "phrase": "nanonetworks"}, {"score": 0.004134508282135594, "phrase": "information_sharing"}, {"score": 0.0037177622939493084, "phrase": "diffusion-based_molecular_communication"}, {"score": 0.0032514447965530354, "phrase": "existing_literature"}, {"score": 0.0030196181347744372, "phrase": "key_differences"}, {"score": 0.00288317238346065, "phrase": "wireless_electromagnetic_channel"}, {"score": 0.002677533520678076, "phrase": "dmc."}, {"score": 0.0023851187337905412, "phrase": "traditional_wireless_networks"}, {"score": 0.002204697943520258, "phrase": "novel_network_architecture"}, {"score": 0.002154272413276506, "phrase": "fundamental_aspects"}, {"score": 0.0021049977753042253, "phrase": "medium_access_control"}], "paper_keywords": [""], "paper_abstract": "Nanotechnology has allowed building nanomachines capable of performing simple tasks, such as sensing, data storage, and actuation. Nanonetworks, networks of nanomachines, will allow cooperation and information sharing among them, thereby greatly expanding the applications of nanotechnology in the biomedical, environmental, and industrial fields. One of the most promising paradigms to implement nanonetworks is diffusion-based molecular communication (DMC). In DMC, nanomachines transmit information by the emission of molecules that diffuse throughout the medium until they reach their destination. Most of the existing literature in DMC has focused on the analysis of its physical channel. In this work, the key differences of the physical channel of DMC with respect to the wireless electromagnetic channel are reviewed with the purpose of learning how they impact the design of networks using DMC. In particular, we find that the uniqueness of the physical channel of DMC will require revisiting most of the protocols and techniques developed for traditional wireless networks in order to adapt them to DMC networks. Furthermore, guidelines for the design of a novel network architecture for DMC networks, including fundamental aspects such as coding, medium access control, addressing, routing and synchronization, are provided.", "paper_title": "NETWORKING CHALLENGES AND PRINCIPLES IN DIFFUSION-BASED MOLECULAR COMMUNICATION", "paper_id": "WOS:000310987600007"}