{"auto_keywords": [{"score": 0.0482845555434659, "phrase": "post-adoption_phenomena"}, {"score": 0.02291286277212416, "phrase": "iftu"}, {"score": 0.010539391314675699, "phrase": "technology_use"}, {"score": 0.007802396862689577, "phrase": "extended_iftu_paradigm"}, {"score": 0.007510915190138265, "phrase": "distal_effects"}, {"score": 0.006251145816311257, "phrase": "memory_perspective"}, {"score": 0.00481495049065317, "phrase": "integrative_framework"}, {"score": 0.004278807087784626, "phrase": "unified_model"}, {"score": 0.004047500054405469, "phrase": "coherent_theoretical_explanation"}, {"score": 0.004005537264228818, "phrase": "underlying_force"}, {"score": 0.003685067218455088, "phrase": "process_model"}, {"score": 0.0036341965226247028, "phrase": "cognitive_psychology"}, {"score": 0.0034978813769575233, "phrase": "three-wave_panel_model"}, {"score": 0.0030971473486283664, "phrase": "proposed_model"}, {"score": 0.0030437652050982617, "phrase": "data_analysis"}, {"score": 0.002939737235379635, "phrase": "proximal_effects"}, {"score": 0.0029193609786176632, "phrase": "subsequent_evaluations"}, {"score": 0.0028000270988465486, "phrase": "sequential_updating"}, {"score": 0.0024447807655923947, "phrase": "deeper_insights"}, {"score": 0.0023776656246300063, "phrase": "three-or-more-wave_panel_study"}, {"score": 0.00221781065048839, "phrase": "coherent_theoretical_framework"}, {"score": 0.0021795515361987144, "phrase": "prior_experiences"}, {"score": 0.0021049977753042253, "phrase": "later_experiences"}], "paper_keywords": ["Longitudinal study", " panel model", " technology use", " continued use", " theory of planned behavior (TPB)", " process model of memory", " path analysis"], "paper_abstract": "The integrative framework of technology use (IFTU) posits that to fully explain post-adoption phenomena, four mechanisms-namely, reason-oriented action, sequential updating, feedback and habit-should be taken into account simultaneously in a unified model. Although IFTU sheds light on the four mechanisms underlying technology use, it lacks a coherent theoretical explanation for the underlying force that leads to the four mechanisms. To offer a more generalized and richer description of the four mechanisms, this study extends IFTU by drawing on the process model of memory in cognitive psychology. In addition, based on the extended IFTU paradigm, a three-wave panel model is developed that incorporates not only proximal effects but also distal effects of the four mechanisms on post-adoption phenomena. Three different sets of data (n = 195, 160, and 342, respectively) are used to test the proposed model. The results of data analysis show that, as expected, the four mechanisms have proximal effects on subsequent evaluations and behavior. Furthermore, consistent with the memory perspective, the sequential updating and habit mechanisms are found to have distal effects on post-adoption phenomena even after controlling for their proximal effects. Overall, the findings of this study indicate that the memory perspective offers not only a seamless explanation of the four mechanisms underlying technology use but also yields deeper insights that can be validated only through a three-or-more-wave panel study. This research contributes to the literature by demonstrating that the extended IFTU paradigm has the potential to serve as a coherent theoretical framework on post-adoption phenomena in which prior experiences are internalized into memories, which in turn regulate later experiences.", "paper_title": "THE INTEGRATIVE FRAMEWORK OF TECHNOLOGY USE: AN EXTENSION AND TEST", "paper_id": "WOS:000269406300006"}