{"auto_keywords": [{"score": 0.036050693039587356, "phrase": "dream"}, {"score": 0.00481495049065317, "phrase": "software-defined_measurement"}, {"score": 0.004766090327062509, "phrase": "software-defined_networks"}, {"score": 0.004529093447865156, "phrase": "fine-grain_visibility"}, {"score": 0.004238452771031322, "phrase": "tcam_counters"}, {"score": 0.004195418010131832, "phrase": "hardware_switches"}, {"score": 0.004027586827290042, "phrase": "tcam_memory"}, {"score": 0.003807684498435389, "phrase": "measurement_tasks"}, {"score": 0.0034733518170738517, "phrase": "adaptive_measurement_framework"}, {"score": 0.003250238918180901, "phrase": "measurement_task"}, {"score": 0.0031682817605340028, "phrase": "user-specified_level"}, {"score": 0.0030414140732789186, "phrase": "resource_usage"}, {"score": 0.002831462722290752, "phrase": "traffic_characteristics"}, {"score": 0.0025826247025542213, "phrase": "resource_allocation"}, {"score": 0.0024918548761791435, "phrase": "desired_level"}, {"score": 0.0024289743270061157, "phrase": "prototype_implementation"}, {"score": 0.002126635713519053, "phrase": "higher_accuracy"}], "paper_keywords": ["Software-defined Measurement", " Resource Allocation"], "paper_abstract": "Software-defined networks can enable a variety of concurrent, dynamically instantiated, measurement tasks, that provide fine-grain visibility into network traffic. Recently, there have been many proposals to configure TCAM counters in hardware switches to monitor traffic. However, the TCAM memory at switches is fundamentally limited and the accuracy of the measurement tasks is a function of the resources devoted to them on each switch. This paper describes an adaptive measurement framework, called DREAM, that dynamically adjusts the resources devoted to each measurement task, while ensuring a user-specified level of accuracy. Since the trade-off between resource usage and accuracy can depend upon the type of tasks, their parameters, and traffic characteristics, DREAM does not assume an a priori characterization of this trade-off, but instead dynamically searches for a resource allocation that is sufficient to achieve a desired level of accuracy. A prototype implementation and simulations with three network-wide measurement tasks (heavy hitter, hierarchical heavy hitter and change detection) and diverse traffic show that DREAM can support more concurrent tasks with higher accuracy than several other alternatives.", "paper_title": "DREAM: Dynamic Resource Allocation for Software-defined Measurement", "paper_id": "WOS:000350564600075"}