{"auto_keywords": [{"score": 0.0479944128286434, "phrase": "comfa"}, {"score": 0.00481495049065317, "phrase": "partial_charge_calculation_method"}, {"score": 0.00475413908468027, "phrase": "comfa_qsar_prediction_accuracy"}, {"score": 0.00443308765153716, "phrase": "atomic_partial_charges"}, {"score": 0.004213240903095234, "phrase": "molecular_electrostatic_fields"}, {"score": 0.003928572641266562, "phrase": "different_common_partial_charge_calculation_methods"}, {"score": 0.0033937776228549557, "phrase": "popular_gasteiger"}, {"score": 0.003184508127063861, "phrase": "mndo"}, {"score": 0.0028944757265206332, "phrase": "statistically_significantly_more_predictive_comfa_models"}, {"score": 0.002839710775624807, "phrase": "gasteiger"}, {"score": 0.0026475981474045414, "phrase": "semiempirical_charges"}, {"score": 0.002391067964886602, "phrase": "semiempirical_partial_charge_calculation_methods"}, {"score": 0.0021870332034407817, "phrase": "semiempirical_methods"}, {"score": 0.0021049977753042253, "phrase": "calculation_speed"}], "paper_keywords": [""], "paper_abstract": "The 3D-QSAR method comparative molecular field analysis (CoMFA) involves the estimation of atomic partial charges as part of the process of calculating molecular electrostatic fields. Using 30 data sets from the literature the effect of using different common partial charge calculation methods on the predictivity (cross-validated R(2)) of CoMFA was studied. The partial charge methods ranged from the popular Gasteiger and the newer MMFF94 electronegativity equalization methods, to the more complex and computationally expensive semiempirical charges AM1, MNDO, and PM3. The MMFF94 and semiempirical MNDO, AM1, and PM3 methods for computing charges were found to result in statistically significantly more predictive CoMFA models than the Gasteiger charges. Although there. was a trend toward the semiempirical charges performing better than the MMFF94 charges, the difference was not statistically significant. Thus, semiempirical partial charge calculation methods are suggested for the most predictive CoMFA models, but the MMFF94 charge calculation method is a very good alternative if semiempirical methods are not available or faster calculation speed is important.", "paper_title": "Partial Charge Calculation Method Affects CoMFA QSAR Prediction Accuracy", "paper_id": "WOS:000264533400018"}