{"auto_keywords": [{"score": 0.03980713684810354, "phrase": "akkar"}, {"score": 0.012073408968812979, "phrase": "transformed_masking_method"}, {"score": 0.008573377758193041, "phrase": "differential_power_analysis"}, {"score": 0.006092712882360999, "phrase": "goubin"}, {"score": 0.005994295723765451, "phrase": "superposition_attack"}, {"score": 0.005833766560683652, "phrase": "high-order_differential_power_analysis_attack"}, {"score": 0.005708426289925104, "phrase": "giraud's_des_implementation"}, {"score": 0.005436115481041002, "phrase": "des_implementation"}, {"score": 0.004342430078306461, "phrase": "cryptographic_algorithms"}, {"score": 0.004112582094962078, "phrase": "simple_power_analysis"}, {"score": 0.003980531478122155, "phrase": "kocher_et_al"}, {"score": 0.003831801113154043, "phrase": "differential_power_analysis_attacks"}, {"score": 0.003749313143937311, "phrase": "giraud"}, {"score": 0.0029029754274913803, "phrase": "order_differential_power_analysis_attacks"}, {"score": 0.002631892325004253, "phrase": "new_artifice"}, {"score": 0.002575167114383286, "phrase": "electric_consumption_curves"}, {"score": 0.0024788168221042445, "phrase": "bevan"}, {"score": 0.002386062690026682, "phrase": "unique_masking_method"}], "paper_keywords": ["data encryption standard (DES)", " Smart cards", " power analysis", " Boolean masking"], "paper_abstract": "Masking is one of the efficient and easily implemented countermeasures to protect cryptographic algorithms in such resource limited environments as smart-cards from differential power analysis as well as simple power analysis that were first introduced by Kocher et al. in 1999. To defend differential power analysis attacks, Akkar and Giraud presented a Transformed Masking Method and applied it to DES implementation in 2001. Unfortunately, in 2003, Akkar and Goubin showed a superposition attack that actually is a high-order differential power analysis attack on Akkar and Giraud's DES implementation using Transformed Masking Method, and finally they presented a DES implementation using their proposed Unique Masking Method to defend any order differential power analysis attacks, which was later improved by Akkar, Bevan and Goubin in 2004. In this paper, by exploiting a new artifice to classify the electric consumption curves, we show that Akkar, Bevan and Goubin's improved DES implementation using Unique Masking Method is still vulnerable to a high-order differential power analysis attack. Besides, we find it is also vulnerable to a superposition attack. We also present four new differential power analysis attacks on Akkar and Giraud's DES implementation using Transformed Masking Method. (c) 2006 Elsevier Inc. All rights reserved.", "paper_title": "On two DES implementations secure against differential power analysis in smart-cards", "paper_id": "WOS:000238782700007"}