{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "participating_user"}, {"score": 0.004744018246633455, "phrase": "trust_relationships"}, {"score": 0.004254671386496732, "phrase": "good_trust_relationship"}, {"score": 0.00419195822011581, "phrase": "traditional_mechanism"}, {"score": 0.004150661689086371, "phrase": "recommendation_based_trust_model"}, {"score": 0.0034731015746070166, "phrase": "trust"}, {"score": 0.003023047748772801, "phrase": "peer_trust_values"}, {"score": 0.002993231973906559, "phrase": "direct_interactions"}, {"score": 0.0029637093924781825, "phrase": "peers_referrals"}, {"score": 0.0027513507830537165, "phrase": "aggregated_trust_value"}, {"score": 0.0024916260764216752, "phrase": "simple_malicious_attacks"}, {"score": 0.002467038647952607, "phrase": "collusive_attacks"}, {"score": 0.0024306105794630246, "phrase": "strategic_attacks"}, {"score": 0.0023245146355917626, "phrase": "existing_trust_models"}, {"score": 0.0022010965931147735, "phrase": "major_concern"}, {"score": 0.002105007807034302, "phrase": "elsevier"}], "paper_keywords": ["Peer-to-Peer", " Trust", " Reputation", " Credibility"], "paper_abstract": "Peer-to-peer (P2P) networking is widely used to exchange, contribute, or obtain files from any participating user. Building trust relationships between peers in a large-scale distributed P2P file-sharing system is a fundamental and challenging research topic. However, it is difficult to build a good trust relationship with the traditional mechanism. Recommendation based trust model from social relationship can be adopted to resolve the problem. But it faces the challenges of subjectivity, and experiential referral weighting. This paper presents R(2)Trust a robust Reputation and Risk evaluation based Trust management model. Our novel framework uses both reputation and risk to evaluate the trustworthiness of a peer and it is applicable for unstructured P2P networks. The model will evaluate peer trust values from direct interactions and peers referrals. R(2)Trust also distinguishes the credibility of peers. As a result, the aggregated trust value will filter out the noises and reflect more accurate trust values. The proposed R(2)Trust can also defense against several malicious attacks, such as simple malicious attacks, collusive attacks, and strategic attacks. Our experimental results show that, compared to the existing trust models, our model is cleanly a winner when security is the major concern of a system. (C) 2011 Elsevier By. All rights reserved.", "paper_title": "R(2)Trust, a reputation and risk based trust management framework for large-scale, fully decentralized overlay networks", "paper_id": "WOS:000294521200014"}