{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "typing_errors"}, {"score": 0.004764859786310636, "phrase": "interactive_digital_television_applications"}, {"score": 0.0047152877145889656, "phrase": "remote_controls"}, {"score": 0.0041589926969138585, "phrase": "effective_entry_methods"}, {"score": 0.004115697805448384, "phrase": "idtv_applications"}, {"score": 0.004051595625804513, "phrase": "empirical_investigation"}, {"score": 0.003444732262403694, "phrase": "idtv_contexts"}, {"score": 0.0030220049006970317, "phrase": "particular_characteristics"}, {"score": 0.0027936239349923464, "phrase": "proximity_mistakes"}, {"score": 0.0025555322596460036, "phrase": "input_method"}, {"score": 0.002450602177683068, "phrase": "major_aspects"}, {"score": 0.0021951623041245897, "phrase": "conventional_remote_controls"}, {"score": 0.002127186380459509, "phrase": "advanced_techniques"}, {"score": 0.0021049977753042253, "phrase": "error_recognition"}], "paper_keywords": [""], "paper_abstract": "Remote controls are especially problematic for writing text, something necessary in many interactive digital TV applications (IDTV). In the context of research aimed at finding effective entry methods for IDTV applications, an empirical investigation was carried out and is presented in this article. The study analyzed the errors committed by 82 users in an experiment in which they wrote 7,395 sentences. Several typing methods suitable for IDTV contexts were used for experimentation. There were 3,562 of the sentences that registered at least one error. These errors were classified and their main causes analyzed, the particular characteristics of the users taken into account. The results show that the most frequent errors are proximity mistakes in all the evaluated methods. They appear in between 13.75% and 32.31% of the sentences, depending on the input method. Also, age and background are major aspects affecting the number and type of mistakes. The results could be the basis of changes in the design of conventional remote controls or in the design of advanced techniques for error recognition and correction.", "paper_title": "An Empirical Investigation Into Typing Errors in Interactive Digital Television Applications", "paper_id": "WOS:000352319800004"}