{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "big_data"}, {"score": 0.004554082077300675, "phrase": "important_changes"}, {"score": 0.004228016636379321, "phrase": "miscellaneous_records"}, {"score": 0.00413096972023037, "phrase": "large_and_shifting_online_crowds"}, {"score": 0.0038708810091769856, "phrase": "generic_purposes"}, {"score": 0.00372965096877929, "phrase": "big_data_crunching"}, {"score": 0.0036271080216837286, "phrase": "varying_formats"}, {"score": 0.003367188029221534, "phrase": "severe_problems"}, {"score": 0.003336031521101184, "phrase": "semiotic_translation"}, {"score": 0.0030398432591176357, "phrase": "time_span"}, {"score": 0.002656327554326748, "phrase": "structured_information"}, {"score": 0.0026317312518257803, "phrase": "lasting_value"}, {"score": 0.0024091057723923857, "phrase": "important_implications"}, {"score": 0.0021049977753042253, "phrase": "wider_social_and_institutional_context"}], "paper_keywords": ["big data", " business environment", " data practices", " management", " social data", " strategy making"], "paper_abstract": "Big data and the mechanisms by which it is produced and disseminated introduce important changes in the ways information is generated and made relevant for organizations. Big data often represents miscellaneous records of the whereabouts of large and shifting online crowds. It is frequently agnostic, in the sense of being produced for generic purposes or purposes different from those sought by big data crunching. It is based on varying formats and modes of communication (e.g., texts, image and sound), raising severe problems of semiotic translation and meaning compatibility. Crucially, the usefulness of big data rests on their steady updatability, a condition that reduces the time span within which this data is useful or relevant. Jointly, these attributes challenge established rules of strategy making as these are manifested in the canons of procuring structured information of lasting value that addresses specific and long-term organizational objectives. The developments underlying big data thus seem to carry important implications for strategy making, and the data and information practices with which strategy has been associated. We conclude by placing the understanding of these changes within the wider social and institutional context of longstanding data practices and the significance they carry for management and organizations.", "paper_title": "New games, new rules: big data and the changing context of strategy", "paper_id": "WOS:000352826400004"}