{"auto_keywords": [{"score": 0.028650757392591975, "phrase": "total_patents"}, {"score": 0.00481495049065317, "phrase": "patent_search_method"}, {"score": 0.004744123493964429, "phrase": "academic_and_industrial_work"}, {"score": 0.0041515831652973794, "phrase": "highly_relevant_patent_sets"}, {"score": 0.004120915812750583, "phrase": "specified_technological_fields"}, {"score": 0.0038548668648948044, "phrase": "underlying_knowledge"}, {"score": 0.0038122196479548425, "phrase": "technological_field"}, {"score": 0.0037560869590718966, "phrase": "two-component_definition"}, {"score": 0.0036734281414482735, "phrase": "useful_definition"}, {"score": 0.003410768840300913, "phrase": "earlier_technique"}, {"score": 0.0032622464094096463, "phrase": "patent_sets"}, {"score": 0.0028121943702224326, "phrase": "relatively_low_numbers"}, {"score": 0.0025916375737852506, "phrase": "great_majority"}, {"score": 0.002572463625403536, "phrase": "patent_class_pairs"}, {"score": 0.002553431170229379, "phrase": "zero_overlap"}, {"score": 0.0024421501497321027, "phrase": "doubly_listed_patents"}, {"score": 0.0021846599115561832, "phrase": "distinct_units"}, {"score": 0.002128587147609537, "phrase": "relatively_tightly_contained_units"}, {"score": 0.0021049977753042253, "phrase": "widely_spread_additional_knowledge"}], "paper_keywords": ["Patent searching", " Technology decomposition", " Technological relatedness"], "paper_abstract": "Many areas of academic and industrial work make use of the notion of a 'technology'. This paper attempts to reduce the ambiguity around the definition of what constitutes a 'technology' by extension of a method described previously that finds highly relevant patent sets for specified technological fields. The method relies on a less ambiguous definition that includes both a functional component and a component consisting of the underlying knowledge in a technological field to form a two-component definition. These two components form a useful definition of a technology that allows for objective, repeatable and thus comparable analysis of specific technologies. 28 technological domains are investigated: the extension of an earlier technique is shown to be capable of finding highly relevant and complete patent sets for each of the technologies. Overall, about 500,000 patents from 1976 to 2012 are classified into these 28 domains. The patents in each of these sets are not only highly relevant to the domain of interest but there are relatively low numbers of patents classified into any two of these domains (total patents classified in two domains are 2.9 % of the total patents and the great majority of patent class pairs have zero overlap with a few of the 378 patent class pairs containing the bulk of the doubly listed patents). On the other hand, the patents within a given domain cite patents in other domains about 90 % of the time. These results suggest that technology can be usefully decomposed to distinct units but that the inventions in these relatively tightly contained units depend upon widely spread additional knowledge.", "paper_title": "Technology structural implications from the extension of a patent search method", "paper_id": "WOS:000350337000006"}