{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "patient_access"}, {"score": 0.041210035444321655, "phrase": "hie_data"}, {"score": 0.004772593750252861, "phrase": "health_information_exchange_data"}, {"score": 0.004179991181159956, "phrase": "multiple_healthcare_providers"}, {"score": 0.0038431888954930083, "phrase": "healthcare_organizations"}, {"score": 0.003709595902020469, "phrase": "new_consumer_portal_technologies"}, {"score": 0.0033212215487678854, "phrase": "early_implementation"}, {"score": 0.0032057142600527, "phrase": "sociotechnical_framework"}, {"score": 0.0028699415886017468, "phrase": "technical_barriers"}, {"score": 0.002807118943000936, "phrase": "data_standardization"}, {"score": 0.0027700855441353165, "phrase": "cultural_and_legal_issues"}, {"score": 0.0027094427948305515, "phrase": "organizational_changes"}, {"score": 0.002661883310629088, "phrase": "important_role"}, {"score": 0.0026267609106294817, "phrase": "project_plans"}, {"score": 0.002512990657100351, "phrase": "initial_plans"}, {"score": 0.0024688710065898646, "phrase": "prospective_study"}, {"score": 0.002436289099444074, "phrase": "sociotechnical_factors"}, {"score": 0.0023724065150232897, "phrase": "health_information_technology_success"}, {"score": 0.0022101055924375725, "phrase": "seamless_access"}], "paper_keywords": [""], "paper_abstract": "Background Providing patients with access to their medical data is widely expected to help educate and empower them to manage their own health. Health information exchange (HIE) infrastructures could potentially help patients access records across multiple healthcare providers. We studied three HIE organizations as they developed portals to give consumers access to HIE data previously exchanged only among healthcare organizations. Objective To follow the development of new consumer portal technologies, and to identify barriers and facilitators to patient access to HIE data. Methods Semistructured interviews of 15 key informants over a 2-year period spanning the development and early implementation of three new projects, coded according to a sociotechnical framework. Results As the organizations tried to develop functionality that fully served the needs of both providers and patients, plans were altered by technical barriers (primarily related to data standardization) and cultural and legal issues surrounding data access. Organizational changes also played an important role in altering project plans. In all three cases, patient access to data was significantly scaled back from initial plans. Conclusions This prospective study revealed how sociotechnical factors previously identified as important in health information technology success and failure helped to shape the evolution of three novel consumer informatics projects. Barriers to providing patients with seamless access to their HIE data were multifactorial. Remedies will have to address technical, organizational, cultural, and other factors.", "paper_title": "Sociotechnical challenges to developing technologies for patient access to health information exchange data", "paper_id": "WOS:000337660600019"}