{"auto_keywords": [{"score": 0.004613940521007727, "phrase": "desirable_characteristic"}, {"score": 0.003910879154656061, "phrase": "selective_compounds"}, {"score": 0.0038283058265876713, "phrase": "present_study"}, {"score": 0.003687960013746783, "phrase": "protein-structure_modeling"}, {"score": 0.0031255543155487234, "phrase": "high_resolution_x-ray_structure"}, {"score": 0.0029953278111158545, "phrase": "grid"}, {"score": 0.0029632087618953005, "phrase": "pca"}, {"score": 0.0024578219177450876, "phrase": "selective_inhibitors"}, {"score": 0.0023802825369325354, "phrase": "activity_data"}, {"score": 0.0021276181317652163, "phrase": "clear_guidelines"}, {"score": 0.0021049977753042253, "phrase": "selective_drug_design"}], "paper_keywords": ["selectivity", " homology modeling", " GRID", " PCA", " PI3K gamma", " PI3K delta"], "paper_abstract": "A desirable characteristic of PI3K inhibitors is their selectivity. Up to now, there has been no report that describes the 3 D-structure differences between two PI3Ks (delta and gamma) and applies them to designing selective compounds. In the present study, we used an approach combining protein-structure modeling, GRID/PCA (Principal Component Analysis) and docking methods to investigate the detail interactions of the two PI3Ks with various chemical groups. At first, we constructed a 3 D-model of the PI3K delta catalytic subunit with the program Modeller7.0 based on the high resolution X-ray structure of the PI3K gamma catalytic subunit, and then employed GRID and PCA to reveal the most relevant structural and physicochemical differences between the two PI3Ks related to their selectivity. As a result, the analysis unveiled the most important regions on the two PI3Ks that should be taken into account for the design of selective inhibitors. Finally, based on activity data of 10 PI3K delta-selective compounds, a docking study validated the results of the GRID/PCA method, which suggested that the approach could provide clear guidelines for selective drug design.", "paper_title": "Study on improving the selectivity of compounds that inhibit two PI3Ks (gamma and delta)", "paper_id": "WOS:000235749700010"}