{"auto_keywords": [{"score": 0.0350240838949097, "phrase": "opinion_leaders"}, {"score": 0.00481495049065317, "phrase": "social_networks"}, {"score": 0.0038782499819752423, "phrase": "basic_information_sharing"}, {"score": 0.0026881926384093088, "phrase": "persuasiveness_analyses"}, {"score": 0.0024323098907299027, "phrase": "negative_opinions"}, {"score": 0.0023656467839555458, "phrase": "positive_opinions"}, {"score": 0.0023265270905455334, "phrase": "positive_opinion_leaders"}, {"score": 0.0022502133699402018, "phrase": "positive_messages"}, {"score": 0.0022253345930383257, "phrase": "negative_opinion_leaders"}, {"score": 0.0021763973978248005, "phrase": "negative_messages"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Social networks", " Micro-blog", " Opinion leader", " Persuasiveness analysis"], "paper_abstract": "Social networks have become increasingly popular in recent years. Among the many social networking tools, micro-blogging is one of the most unique and convenient because it is short, responsive, spontaneous and mobile. These properties allow micro-blogs to move beyond basic information sharing and make them a popular media for sharing opinions. In this study, we examine the persuasiveness of micro-blogs by developing a framework that first identifies opinion leaders and then analyzes their persuasiveness. To develop the framework, we download micro-blogs, blogger information and the relationships among them into a database, identify spammers, decompose communities into sub-nets, identify opinion leaders and conduct persuasiveness analyses. The results show the framework can identify opinion leaders and their opinions effectively. It was found that negative opinions are less persuasive than positive opinions, and positive opinion leaders are more aggressive in distributing positive messages than negative opinion leaders are in distributing negative messages. (C) 2014 Elsevier B.V. All rights reserved.", "paper_title": "Listen to me - Evaluating the influence of micro-blogs", "paper_id": "WOS:000336825900011"}