{"auto_keywords": [{"score": 0.04652122652620526, "phrase": "chain_graphs"}, {"score": 0.041290995717616845, "phrase": "different_chain_graph_interpretations"}, {"score": 0.00481495049065317, "phrase": "chain_graph_interpretations"}, {"score": 0.004574467182781443, "phrase": "bayesian"}, {"score": 0.004363401436068803, "phrase": "mainly_three_different_interpretations"}, {"score": 0.0041094632357748006, "phrase": "andersson"}, {"score": 0.003988055287053139, "phrase": "multivariate_regression_interpretations"}, {"score": 0.0038044630943383497, "phrase": "different_theoretical_concepts"}, {"score": 0.0037238193456845124, "phrase": "bayesian_networks"}, {"score": 0.0026767629720554397, "phrase": "independence_models"}, {"score": 0.0025315664299815537, "phrase": "independence_model"}, {"score": 0.0024356742694508662, "phrase": "chain_graph_interpretation"}, {"score": 0.002373767863833987, "phrase": "meek's_conjecture"}, {"score": 0.002283839204519042, "phrase": "coherent_overview"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Chain graphs", " Lauritzen-Wermuth-Frydenberg interpretation", " Andersson-Madigan-Perlman interpretation", " Multivariate regression interpretation"], "paper_abstract": "In this paper we study how different theoretical concepts of Bayesian networks have been extended to chain graphs. Today there exist mainly three different interpretations of chain graphs in the literature. These are the Lauritzen-Wermuth-Frydenberg, the Andersson-Madigan-Perlman and the multivariate regression interpretations. The different chain graph interpretations have been studied independently and over time different theoretical concepts have been extended from Bayesian networks to also work for the different chain graph interpretations. This has however led to confusion regarding what concepts exist for what interpretation. In this article we do therefore study some of these concepts and how they have been extended to chain graphs as well as what results have been achieved so far. More importantly we do also identify when the concepts have not been extended and contribute within these areas. Specifically we study the following theoretical concepts: Unique representations of independence models, the split and merging operators, the conditions for when an independence model representable by one chain graph interpretation can be represented by another chain graph interpretation and finally the extension of Meek's conjecture to chain graphs. With our new results we give a coherent overview of how each of these concepts is extended for each of the different chain graph interpretations. (C) 2014 Elsevier Inc. All rights reserved.", "paper_title": "Chain graph interpretations and their relations revisited", "paper_id": "WOS:000350516100004"}