{"auto_keywords": [{"score": 0.04519174354308181, "phrase": "quasispecies_model"}, {"score": 0.00481495049065317, "phrase": "molecular_evolution"}, {"score": 0.004579780586951551, "phrase": "haploid_organisms"}, {"score": 0.004466519142879166, "phrase": "seminal_piece"}, {"score": 0.00440307216475388, "phrase": "eigen"}, {"score": 0.004143196873246147, "phrase": "antiviral_treatment_and_vaccine_design_strategies"}, {"score": 0.0038431888954930083, "phrase": "infinite_population_size"}, {"score": 0.003802135020791801, "phrase": "realistic_population_sizes"}, {"score": 0.0036422425344358037, "phrase": "population_genetics-based_model"}, {"score": 0.003526735797659508, "phrase": "finite_population_sizes"}, {"score": 0.00347657813672945, "phrase": "rigorous_study"}, {"score": 0.0034394269654205094, "phrase": "convergence_and_computational_issues"}, {"score": 0.0031902155632863236, "phrase": "population_size"}, {"score": 0.002937879003671346, "phrase": "continued_use"}, {"score": 0.0028142286985235977, "phrase": "stationary_state"}, {"score": 0.002676514445417281, "phrase": "state_space"}, {"score": 0.0026384167183586015, "phrase": "exact_computations"}, {"score": 0.0023440589015485077, "phrase": "widely_used_fitness_landscapes"}, {"score": 0.0023106824101273554, "phrase": "fast_deterministic_algorithm"}, {"score": 0.0022777800735119405, "phrase": "stationary_distribution"}, {"score": 0.002237308726827077, "phrase": "computational_tools"}, {"score": 0.0021049977753042253, "phrase": "mutagenic_drugs"}], "paper_keywords": ["molecular evolution", " quasispecies theory"], "paper_abstract": "This article is concerned with the evolution of haploid organisms that reproduce asexually. In a seminal piece of work, Eigen and coauthors proposed the quasispecies model in an attempt to understand such an evolutionary process. Their work has impacted antiviral treatment and vaccine design strategies. Yet, predictions of the quasispecies model are at best viewed as a guideline, primarily because it assumes an infinite population size, whereas realistic population sizes can be quite small. In this paper we consider a population genetics-based model aimed at understanding the evolution of such organisms with finite population sizes and present a rigorous study of the convergence and computational issues that arise therein. Our first result is structural and shows that, at any time during the evolution, as the population size tends to infinity, the distribution of genomes predicted by our model converges to that predicted by the quasispecies model. This justifies the continued use of the quasispecies model to derive guidelines for intervention. While the stationary state in the quasispecies model is readily obtained, due to the explosion of the state space in our model, exact computations are prohibitive. Our second set of results are computational in nature and address this issue. We derive conditions on the parameters of evolution under which our stochastic model mixes rapidly. Further, for a class of widely used fitness landscapes we give a fast deterministic algorithm which computes the stationary distribution of our model. These computational tools are expected to serve as a framework for the modeling of strategies for the deployment of mutagenic drugs.", "paper_title": "A Finite Population Model of Molecular Evolution: Theory and Computation", "paper_id": "WOS:000309958100007"}