{"auto_keywords": [{"score": 0.04955111375780366, "phrase": "color_homogeneity_properties"}, {"score": 0.04179789452876998, "phrase": "color_points"}, {"score": 0.041133586303589785, "phrase": "color_space"}, {"score": 0.00481495049065317, "phrase": "subset_connectedness"}, {"score": 0.004530023871441992, "phrase": "new_color_image_segmentation_scheme"}, {"score": 0.003668859054928118, "phrase": "different_regions"}, {"score": 0.003509487090932835, "phrase": "single_cluster"}, {"score": 0.0033945024593626675, "phrase": "proposed_scheme"}, {"score": 0.0027031706928674092, "phrase": "actual_regions"}, {"score": 0.0026000466400112974, "phrase": "efficient_color-domains"}, {"score": 0.0025287979714720423, "phrase": "new_concept"}, {"score": 0.0021049977753042253, "phrase": "ail_actual_region"}], "paper_keywords": ["color image", " segmentation", " pixel classification", " connectedness", " color homogeneity"], "paper_abstract": "In this paper, we present a new color image segmentation scheme based oil unsupervised pixel classification that works even when there is not a one-to-one correspondence between the clusters of color points in the color space and the regions in the image. When the color points of different regions in the image give rise to a single cluster in the color space. the proposed scheme splits this cluster into sub-populations of color-points defined by color-domains. For this purpose, the connectedness and the color homogeneity properties of color-subsets of pixels defined by these color-domains are analyzed in order to construct the classes which correspond to the actual regions in the image. For selecting efficient color-domains, we propose a new concept, the spatial-color compactness degree, which evaluates the confidence that can be placed in the event '' the color-subset defined by the color-domain being examined corresponds to ail actual region in the image ''. (c) 2005 Elsevier Inc. All rights reserved.", "paper_title": "Color image segmentation by analysis of subset connectedness and color homogeneity properties", "paper_id": "WOS:000236655600009"}