{"auto_keywords": [{"score": 0.04584339870071061, "phrase": "imputation_model"}, {"score": 0.005668136472904796, "phrase": "propensity_scores"}, {"score": 0.00481495049065317, "phrase": "complete-data_and_nonresponse_models"}, {"score": 0.004692981437240319, "phrase": "mar."}, {"score": 0.004645057834614705, "phrase": "multiple_imputation"}, {"score": 0.00459767342878523, "phrase": "mi"}, {"score": 0.004504193207111593, "phrase": "resulting_estimates"}, {"score": 0.0038810583785936505, "phrase": "incomplete_variable"}, {"score": 0.003724810609448597, "phrase": "missingness_mechanism"}, {"score": 0.002708399936381754, "phrase": "simulation_study"}, {"score": 0.00263965046277432, "phrase": "random_mechanisms"}, {"score": 0.0026126405272417783, "phrase": "different_types"}, {"score": 0.002250601866422547, "phrase": "relevant_variables"}], "paper_keywords": ["dual modelling", " missingness mechanism", " misspecification", " multiple imputation", " propensity score", " F1", " 1", " F4", " 3"], "paper_abstract": "In multiple imputation (MI), the resulting estimates are consistent if the imputation model is correct. To specify the imputation model, it is recommended to combine two sets of variables: those that are related to the incomplete variable and those that are related to the missingness mechanism. Several possibilities exist, but it is not clear how they perform in practice. The method that simply groups all variables together into the imputation model and four other methods that are based on the propensity scores are presented. Two of them are new and have not been used in the context of MI. The performance of the methods is investigated by a simulation study under different missing at random mechanisms for different types of variables. We conclude that all methods, except for one method based on the propensity scores, perform well. It turns out that as long as the relevant variables are taken into the imputation model, the form of the imputation model has only a minor effect in the quality of the imputations.", "paper_title": "Combining the complete-data and nonresponse models for drawing imputations under MAR", "paper_id": "WOS:000318071900006"}