{"auto_keywords": [{"score": 0.048269616190995124, "phrase": "discrete_compatibility-constraint_pressure-correction_algorithm"}, {"score": 0.04590268631137089, "phrase": "velocity_field"}, {"score": 0.00481495049065317, "phrase": "time-accurate_simulations"}, {"score": 0.004781357546476652, "phrase": "variable_density_flows"}, {"score": 0.004489327204473076, "phrase": "low-mach_numbers"}, {"score": 0.004274527415193801, "phrase": "discrete_equations"}, {"score": 0.003916098498242888, "phrase": "mass_and_scalar_conservation"}, {"score": 0.003741712498615481, "phrase": "time_step"}, {"score": 0.003702581068329137, "phrase": "comparison_reasons"}, {"score": 0.003651039356522665, "phrase": "well-known_pressure-correction_algorithms"}, {"score": 0.0035750641312373202, "phrase": "first_class"}, {"score": 0.003525291235622844, "phrase": "continuity-constraint_pressure-correction"}, {"score": 0.0033330104902937413, "phrase": "continuity_equation"}, {"score": 0.00329813918116714, "phrase": "second_class"}, {"score": 0.0032522091171602557, "phrase": "analytical_compatibility-constraint_pressure-correction"}, {"score": 0.0031733603553977877, "phrase": "analytical_combination"}, {"score": 0.00314015410819199, "phrase": "material_derivative"}, {"score": 0.0030319482153908037, "phrase": "scalar_equations"}, {"score": 0.0025352969524471496, "phrase": "continuity-constraint_pressure-correction_algorithm"}, {"score": 0.002439308179084911, "phrase": "analytical_compatibility-constraint_pressure-correction_algorithm"}, {"score": 0.002380120876826732, "phrase": "predicted_states"}, {"score": 0.0022187920251626257, "phrase": "simulation_results"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Low-Mach", " Pressure-correction", " Variable density flow", " Mass conservation", " Stability", " Equation of state"], "paper_abstract": "In this paper, we develop the discrete compatibility-constraint pressure-correction algorithm for transient simulations of variable density flows at low-Mach numbers. The constraint for the velocity field is constructed from a combination of the discrete equations of continuity and scalar (e.g. energy) transport, imposing that the newly predicted state must be compatible, in agreement with the equation of state. This way, mass and scalar conservation are guaranteed and the equation of state is exactly fulfilled at every time step. For comparison reasons, two other types of well-known pressure-correction algorithms are also used. The first class, denoted as continuity-constraint pressure-correction, is based on a constraint for the velocity field that is derived solely from the continuity equation. The second class, denoted as analytical compatibility-constraint pressure-correction, constructs the constraint from an analytical combination of the material derivative of the equation of state and the continuity and scalar equations. The algorithms are tested for three example fluid configurations: a single-fluid ideal gas, a two-fluid inert mixture and a two-fluid reacting mixture. The latter is special in the sense that the equation of state is non-linear and not everywhere differentiable. The continuity-constraint pressure-correction algorithm yields unstable solutions if density ratios are high. The analytical compatibility-constraint pressure-correction algorithm yields stable results, but the predicted states do not correspond to the equation of state. The discrete compatibility-constraint pressure-correction algorithm performs well on all test cases: the simulation results are stable and exactly match the equation of state. (c) 2009 Elsevier Inc. All rights reserved.", "paper_title": "A conservative discrete compatibility-constraint low-Mach pressure-correction algorithm for time-accurate simulations of variable density flows", "paper_id": "WOS:000267133900004"}