{"auto_keywords": [{"score": 0.048942952634754504, "phrase": "customer_requirements"}, {"score": 0.027804204415771114, "phrase": "design_specifications"}, {"score": 0.00481495049065317, "phrase": "simplified_systematic_method"}, {"score": 0.004480196733208298, "phrase": "successful_designs"}, {"score": 0.004416079619543104, "phrase": "natural_lingual"}, {"score": 0.004089239912167375, "phrase": "general_design_process"}, {"score": 0.0033737457695128233, "phrase": "suitable_limit_range"}, {"score": 0.003123808471618783, "phrase": "concept_design_process"}, {"score": 0.0030203487665054806, "phrase": "simplified_systematic_approach"}, {"score": 0.002703869368554536, "phrase": "quality_matrix"}, {"score": 0.002467536552997677, "phrase": "inference_mapping_rules"}, {"score": 0.0023857603808363527, "phrase": "minimal_condition_inference"}, {"score": 0.002329009499335603, "phrase": "design_specification"}, {"score": 0.002273605493468005, "phrase": "rough_set_theory"}, {"score": 0.002198242191529977, "phrase": "suitable_value_range"}, {"score": 0.0021049977753042253, "phrase": "fuzzy_rule_matrix"}], "paper_keywords": ["customer profiles", " fuzzy set theory", " matrix algebra", " pattern clustering", " rough set theory"], "paper_abstract": "Faithfully obtaining design specifications from customer requirements is essential for successful designs. The natural lingual, inexact, incomplete, and vague attributes of customer requirements make it very difficult to map customer requirements to design specifications. In general design process, the design specifications are determined by designers based on their experience and intuition, and often a certain target value is set for a specification. However, it is on one hand very difficult, on the other hand unreasonable, so a suitable limit range rather than a certain value is preferred at the beginning of design, especially at the concept design process. In this paper, a simplified systematic approach of transforming customer requirements to design specifications is proposed. First, a two-stepped clustering approach for grouping customer requirements and design specifications based on the house of quality matrix is presented, by which the mapping is limited to within each group. To further simplify the inference mapping rules of customer requirements and design specifications, the minimal condition inference mapping rules for each design specification are extracted based on rough set theory. In the end, a suitable value range is determined for a specification by applying the fuzzy rule matrix.", "paper_title": "A Simplified Systematic Method of Acquiring Design Specifications From Customer Requirements", "paper_id": "WOS:000269548600004"}