{"auto_keywords": [{"score": 0.041761989658688665, "phrase": "solution_space"}, {"score": 0.03305161483818914, "phrase": "greater_flexibility"}, {"score": 0.00481495049065317, "phrase": "flexible_user-defined_constraints"}, {"score": 0.004606148097788071, "phrase": "growing_computational_power"}, {"score": 0.0045691640746165045, "phrase": "regionalization_algorithms"}, {"score": 0.004496080495247288, "phrase": "heuristic_approaches"}, {"score": 0.004283739213556286, "phrase": "evaluation_criteria"}, {"score": 0.003920049436883885, "phrase": "best_solution"}, {"score": 0.00363080961099728, "phrase": "recently_introduced_max-p_algorithm"}, {"score": 0.0031780859997873803, "phrase": "max-p_algorithm"}, {"score": 0.0030278017562213265, "phrase": "feasible_region"}, {"score": 0.002931569771634119, "phrase": "multidimensional_characteristics"}, {"score": 0.002838387600282891, "phrase": "technical_aspects"}, {"score": 0.0026715589067557526, "phrase": "synthetic_spatial_and_attribute_data"}, {"score": 0.0025866199378466754, "phrase": "algorithm's_broad_ability"}, {"score": 0.0025145109881926143, "phrase": "varying_complexity"}, {"score": 0.0024543014947630876, "phrase": "large-scale_computational_experiment"}, {"score": 0.0023666732429695908, "phrase": "greatest_solution_accuracy"}], "paper_keywords": ["regionalization", " max-p", " regions", " functional regions", " tabu search"], "paper_abstract": "The identification of regions is both a computational and conceptual challenge. Even with growing computational power, regionalization algorithms must rely on heuristic approaches in order to find solutions. Therefore, the constraints and evaluation criteria that define a region must be translated into an algorithm that can efficiently and effectively navigate the solution space to find the best solution. One limitation of many existing regionalization algorithms is a requirement that the number of regions be selected a priori. The recently introduced max-p algorithm does not have this requirement, and thus the number of regions is an output of, not an input to, the algorithm. In this paper, we extend the max-p algorithm to allow for greater flexibility in the constraints available to define a feasible region, placing the focus squarely on the multidimensional characteristics of the region. We also modify technical aspects of the algorithm to provide greater flexibility in its ability to search the solution space. Using synthetic spatial and attribute data, we are able to show the algorithm's broad ability to identify regions in maps of varying complexity. We also conduct a large-scale computational experiment to identify parameter settings that result in the greatest solution accuracy under various scenarios. The rules of thumb identified from the experiment produce maps that correctly assign areas to their true' region with 94% average accuracy, with nearly 50% of the simulations reaching 100% accuracy.", "paper_title": "Identifying regions based on flexible user-defined constraints", "paper_id": "WOS:000326615500009"}