{"auto_keywords": [{"score": 0.0042665836253939346, "phrase": "mimo"}, {"score": 0.003990385737207714, "phrase": "multi-objective_robust_pid_controller_design_problem"}, {"score": 0.003843199751358433, "phrase": "ise"}, {"score": 0.003795335309109018, "phrase": "balanced_robust_performance_criteria"}, {"score": 0.0036400696415545813, "phrase": "small_regions"}, {"score": 0.0035947360742084253, "phrase": "parameter_space"}, {"score": 0.003505749731180509, "phrase": "best_existing_fronts"}, {"score": 0.003376369479008885, "phrase": "top_fronts"}, {"score": 0.003306559295382181, "phrase": "external_archive"}, {"score": 0.003279039724748895, "phrase": "reasonably_large_size"}, {"score": 0.0031448288291084, "phrase": "good_fitness"}, {"score": 0.0029291198314113608, "phrase": "robust_performance_criteria"}, {"score": 0.0026384167183586015, "phrase": "pid_controllers"}, {"score": 0.0024883835349005863, "phrase": "hypervolume-based_comparisons"}, {"score": 0.00241658945942583, "phrase": "superior_performance"}, {"score": 0.0023079225317714815, "phrase": "better_robustness"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": [""], "paper_abstract": "In this paper, two lbests multi-objective particle swarm optimization (2LB-MOPSO) is applied to design multi-objective robust Proportional-integral-derivative (PID) controllers for two MIMO systems, namely, distillation column plant and longitudinal control system of the super maneuverable F18/HARV fighter aircraft. Multi-objective robust PID controller design problem is formulated by minimizing integral squared error (ISE) and balanced robust performance criteria. During the search, 2LB-MOPSO can focus on small regions in the parameter space in the vicinity of the best existing fronts. As the lbests are chosen from the top fronts in a non-domination sorted external archive of reasonably large size, the offspring obtained can be more diverse with good fitness. The performance of various optimal PID controllers is compared in terms of the sum of ISE and balanced robust performance criteria. For the purpose of comparison, 2LB-MOPSO, NSGA-II as well as earlier reported Riccati, IGA and USA methods are considered. The performance of PID controllers obtained using 2LB-MOPSO is better than that of others. In addition, Hypervolume-based comparisons are carried out to show the superior performance of 2LB-MOPSO over NSGA-II. The results reveal that 2LB-MOPSO yields better robustness and consistency in terms of the sum of ISE and balanced robust performance criteria than various optimal PID controllers. (C) 2011 Elsevier Inc. All rights reserved.", "paper_title": "Multi-objective robust PID controller tuning using two lbests multi-objective particle swarm optimization", "paper_id": "WOS:000291771400004"}