{"auto_keywords": [{"score": 0.04341549186836161, "phrase": "multiple_thread_interactions"}, {"score": 0.04201582210404548, "phrase": "empirical_studies"}, {"score": 0.03744933760730154, "phrase": "comprehension_tasks"}, {"score": 0.00481495049065317, "phrase": "uml_sequence_diagrams"}, {"score": 0.00475382761232911, "phrase": "multithreaded_interactions"}, {"score": 0.004310173770196077, "phrase": "concurrency_concepts"}, {"score": 0.003958049372486465, "phrase": "first_phase"}, {"score": 0.0038090874465452214, "phrase": "comparative_study"}, {"score": 0.0036501160751879784, "phrase": "existing_variants"}, {"score": 0.0036037265181631324, "phrase": "uml_sequence_diagram_notation"}, {"score": 0.003423969509052361, "phrase": "deliberately_designed_variant"}, {"score": 0.0033374705499418377, "phrase": "better_support"}, {"score": 0.0032810180076973806, "phrase": "concurrent_behavior"}, {"score": 0.002924074850256874, "phrase": "practical_difficulties"}, {"score": 0.002639440558428147, "phrase": "desirable_properties"}, {"score": 0.0026058621464926826, "phrase": "new_notation"}, {"score": 0.0025076891684071055, "phrase": "uml"}, {"score": 0.002159623311924437, "phrase": "novices'_understanding"}, {"score": 0.002123051344001408, "phrase": "different_levels"}, {"score": 0.0021049977753042253, "phrase": "synchronization_complexity"}], "paper_keywords": ["UML", " empirical evaluation", " concurrency and synchronization"], "paper_abstract": "Learning about concurrency and synchronization is difficult for novices. Our research seeks to support and improve the teaching and learning of concurrency concepts and to improve comprehension of the intricacies of multiple thread interactions. This paper describes a series of empirical studies in the first phase of our research. We began by conducting a comparative study to empirically evaluate the usability by novices of the existing variants of the UML sequence diagram notation in solving comprehension tasks involving multiple thread interactions. The results implied that a deliberately designed variant of this notation may provide better support for reasoning about concurrent behavior. We then investigated the factors that complicate learning, with the idea that the same complexities would also complicate comprehension tasks. In order to understand the practical difficulties novices encounter in learning about concurrency, we conducted an instructor interviewand an observational study. These investigations guided us in determining the desirable properties of a new notation. We then designed synchronization-adorned UML (saUML) sequence diagrams, which extend UML sequence diagrams with those properties. Finally, we performed four empirical studies to evaluate the usability and efficacy of saUML. Through these empirical studies, we were able to validate the benefits of saUML in enhancing novices' understanding of programs with different levels of synchronization complexity. Information Visualization (2009) 8, 120-136. doi: 10.1057/ivs.2009.6", "paper_title": "Design and evaluation of extensions to UML sequence diagrams for modeling multithreaded interactions", "paper_id": "WOS:000270093200004"}