{"auto_keywords": [{"score": 0.04503589588175795, "phrase": "gvf"}, {"score": 0.032481392805401424, "phrase": "texture_memory"}, {"score": 0.004683292152590589, "phrase": "feature-preserving_spatial_diffusion"}, {"score": 0.004406121974246201, "phrase": "skeletonization_algorithms"}, {"score": 0.003588291565092195, "phrase": "graphic_processing_units"}, {"score": 0.0033570147767493746, "phrase": "highly_optimized_parallel_gpu_implementation"}, {"score": 0.0032651001624416165, "phrase": "opencl."}, {"score": 0.0031933617014256676, "phrase": "memory_access_optimization"}, {"score": 0.0027031706928674092, "phrase": "compressed_storage_format"}, {"score": 0.0026584843838039166, "phrase": "gpu._shared_memory"}, {"score": 0.0024054226746197706, "phrase": "increased_kernel_complexity"}, {"score": 0.0022502133699402018, "phrase": "large_sizes"}], "paper_keywords": ["Gradient Vector Flow", " GPU", " OpenCL"], "paper_abstract": "The Gradient Vector Flow (GVF) is a feature-preserving spatial diffusion of gradients. It is used extensively in several image segmentation and skeletonization algorithms. Calculating the GVF is slow as many iterations are needed to reach convergence. However, each pixel or voxel can be processed in parallel for each iteration. This makes GVF ideal for execution on Graphic Processing Units (GPUs). In this paper, we present a highly optimized parallel GPU implementation of GVF written in OpenCL. We have investigated memory access optimization for GPUs, such as using texture memory, shared memory and a compressed storage format. Our results show that this algorithm really benefits from using the texture memory and the compressed storage format on the GPU. Shared memory, on the other hand, makes the calculations slower with or without the other optimizations because of an increased kernel complexity and synchronization. With these optimizations our implementation can process 2D images of large sizes (512(2)) in real-time and 3D images (256(3)) using only a few seconds on modern GPUs.", "paper_title": "Real-time gradient vector flow on GPUs using OpenCL", "paper_id": "WOS:000350563300006"}