{"auto_keywords": [{"score": 0.034182875683624124, "phrase": "speech_enhancement"}, {"score": 0.00481495049065317, "phrase": "cross-channel_condition"}, {"score": 0.0047472380621488616, "phrase": "gaussian_mixture_model"}, {"score": 0.004592905436175987, "phrase": "speaker_recognition"}, {"score": 0.004506968388996092, "phrase": "channel_variability"}, {"score": 0.003856422033676762, "phrase": "lfa"}, {"score": 0.003678414118674967, "phrase": "novel_dynamic_gaussian_selection_algorithm"}, {"score": 0.0035755653799043, "phrase": "feature_compensation_time"}, {"score": 0.0034920505103165403, "phrase": "performance_loss"}, {"score": 0.003410479630045025, "phrase": "different_techniques"}, {"score": 0.003378385493203297, "phrase": "varying_channel"}, {"score": 0.0031174595932694036, "phrase": "telephone_speech"}, {"score": 0.0030446120560494155, "phrase": "cross-channel_tasks"}, {"score": 0.002987557906013826, "phrase": "channel_compensation_techniques"}, {"score": 0.0029454679553901613, "phrase": "telephone_channel_speech"}, {"score": 0.002460825108719896, "phrase": "promising_performance_gain"}, {"score": 0.0023806459272452353, "phrase": "developed_system"}, {"score": 0.0022070310530794097, "phrase": "comparable_or_even_better_performance"}, {"score": 0.0021049977753042253, "phrase": "practical_use"}], "paper_keywords": ["Cross-channel", " Echo cancellation", " Latent factor analysis", " Noise reduction", " Score normalization", " Speaker verification"], "paper_abstract": "One of the most difficult challenges for speaker recognition is dealing with channel variability. In this paper, several new cross-channel compensation techniques are introduced for a Gaussian mixture model-universal background model (GMM-UBM) speaker verification system. These new techniques include wideband noise reduction, echo cancellation, a simplified feature-domain latent factor analysis (LFA) and data-driven score normalization. A novel dynamic Gaussian selection algorithm is developed to reduce the feature compensation time by more than 60% without any performance loss. The performance of different techniques across varying channel train/test conditions are presented and discussed, finding that speech enhancement, which used to be neglected for telephone speech, is essential for cross-channel tasks, and the channel compensation techniques developed for telephone channel speech also perform effectively. The per microphone performance analysis further shows that speech enhancement can boost the effects of other techniques greatly, especially on channels with larger signal-to-noise ratio (SNR) variance. All results are presented on NIST SRE 2006 and 2008 data, showing a promising performance gain compared to the baseline. The developed system is also compared with other state-of-the-art speaker verification systems. The result shows that the developed system can obtain comparable or even better performance but consumes much less CPU time, making it more suitable for practical use.", "paper_title": "Robust speaker recognition in cross-channel condition based on Gaussian mixture model", "paper_id": "WOS:000286990500013"}