{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "conservation_laws"}, {"score": 0.004752221133109136, "phrase": "cellular_automaton"}, {"score": 0.004669845451682529, "phrase": "cellular_automata"}, {"score": 0.004629606956014378, "phrase": "ca"}, {"score": 0.004278807087784626, "phrase": "usual_real-valued_conservation_laws"}, {"score": 0.004024651422626329, "phrase": "ca_form"}, {"score": 0.003703611021999795, "phrase": "smaller_interaction_ranges"}, {"score": 0.0036553070575015344, "phrase": "homomorphic_images"}, {"score": 0.0034835017385881385, "phrase": "specific_range"}, {"score": 0.0032764307492734145, "phrase": "one-dimensional_ca"}, {"score": 0.0031636612155559267, "phrase": "semigroup-valued_case"}, {"score": 0.0030281251520610604, "phrase": "higher-dimensional_ca"}, {"score": 0.0029238768315330305, "phrase": "group-valued_case"}, {"score": 0.00266693888510356, "phrase": "one-dimensional_case"}, {"score": 0.0022480304016499605, "phrase": "dynamical_properties"}, {"score": 0.0022186711739980215, "phrase": "ca."}, {"score": 0.0021422271362195734, "phrase": "expansive_ca"}, {"score": 0.0021049977753042253, "phrase": "non-trivial_real-valued_conservation_laws"}], "paper_keywords": ["Cellular automata", " Conservation laws", " Energy", " Reversibility", " Undecidability", " Dynamical systems", " Chaos"], "paper_abstract": "Conservation laws in cellular automata (CA) are studied as an abstraction of the conservation laws observed in nature. In addition to the usual real-valued conservation laws we also consider more general group-valued and semigroup-valued conservation laws. The (algebraic) conservation laws in a CA form a hierarchy, based on the range of the interactions they take into account. The conservation laws with smaller interaction ranges are the homomorphic images of those with larger interaction ranges, and for each specific range there is a most general law that incorporates all those with that range. For one-dimensional CA, such a most general conservation law has-even in the semigroup-valued case-an effectively constructible finite presentation, while for higher-dimensional CA such effective construction exists only in the group-valued case. It is even undecidable whether a given two-dimensional CA conserves a given semigroup-valued energy assignment. Although the local properties of this hierarchy are tractable in the one-dimensional case, its global properties turn out to be undecidable. In particular, we prove that it is undecidable whether this hierarchy is trivial or unbounded. We point out some interconnections between the structure of this hierarchy and the dynamical properties of the CA. In particular, we show that positively expansive CA do not have non-trivial real-valued conservation laws.", "paper_title": "On the hierarchy of conservation laws in a cellular automaton", "paper_id": "WOS:000297243700005"}