{"auto_keywords": [{"score": 0.04043900361562532, "phrase": "feasible_solution"}, {"score": 0.004816768843137296, "phrase": "sampling"}, {"score": 0.004511297689862029, "phrase": "constraint_satisfaction_problems"}, {"score": 0.004374192072307276, "phrase": "complete_assignment"}, {"score": 0.004098221047046135, "phrase": "first_search_attempts"}, {"score": 0.003761350406092476, "phrase": "partial_assignment"}, {"score": 0.0036469533983843755, "phrase": "-possibly_infeasible-_complete_assignment"}, {"score": 0.0031249312057114237, "phrase": "statistical_information"}, {"score": 0.0031035439594553635, "phrase": "search_space_structure"}, {"score": 0.0029176004007658404, "phrase": "csp"}, {"score": 0.002907504959509132, "phrase": "solving_process"}, {"score": 0.002705165729333657, "phrase": "precise_indications"}, {"score": 0.00265909739882579, "phrase": "individual_variable-value_assignments"}, {"score": 0.002551700779294785, "phrase": "precise_evaluation"}, {"score": 0.002508239347479441, "phrase": "single_variable-value_assignments"}, {"score": 0.002448631085132444, "phrase": "huge_sample_sizes"}, {"score": 0.0022938652373998337, "phrase": "assignment_evaluation_purposes"}, {"score": 0.002254785420533933, "phrase": "thorough_experimental_analysis"}, {"score": 0.0022163699144426155, "phrase": "partial_latin_square_and_car_sequencing_instances"}, {"score": 0.0021341390503944336, "phrase": "dive_features"}], "paper_keywords": ["Constraint Satisfaction Problem", " Sampling", " Diving", " Solution Counting", " Heuristics Evaluation"], "paper_abstract": "We investigate the impact of information extracted from sampling and diving on the solution of Constraint Satisfaction Problems (CSP). A sample is a complete assignment of variables to values taken from their domain according to a given distribution. Diving consists in repeatedly performing depth first search attempts with random variable and value selection, constraint propagation enabled and backtracking disabled; each attempt is called a dive and, unless a feasible solution is found, it is a partial assignment of variables (whereas a sample is a -possibly infeasible- complete assignment). While the probability of finding a feasible solution via sampling or diving is negligible if the problem is difficult enough, samples and dives are very fast to generate and, intuitively, even when they are infeasible, they can provide some statistical information on search space structure. The aim of this paper is to understand to what extent it is possible to support the CSP solving process with information derived from sampling and diving. In particular, we are interested in extracting from samples and dives precise indications on the quality of individual variable-value assignments with respect to feasibility. We formally prove that even uniform sampling could provide precise evaluation of the quality of single variable-value assignments; as expected, this requires huge sample sizes and is therefore not useful in practice. On the contrary, diving is much better suited for assignment evaluation purposes. We undertake a thorough experimental analysis on a collection of Partial Latin Square and Car Sequencing instances to assess the quality of information provided by dives. Dive features are identified and their impact on search is evaluated. Results show that diving provides information that can be fruitfully exploited.", "paper_title": "Deriving Information from Sampling and Diving", "paper_id": "WOS:000294729500008"}