{"auto_keywords": [{"score": 0.03843856552198327, "phrase": "decision_problems"}, {"score": 0.03022084635258387, "phrase": "multigranular_linguistic_scales"}, {"score": 0.00443308765153716, "phrase": "different_knowledge"}, {"score": 0.004372442291178139, "phrase": "educational_backgrounds"}, {"score": 0.0037834649508375544, "phrase": "present_article"}, {"score": 0.0035804980565263024, "phrase": "uncertain_contexts"}, {"score": 0.0033883824438527316, "phrase": "linguistic_information"}, {"score": 0.003296212583539166, "phrase": "decision_makers"}, {"score": 0.0032287289440915187, "phrase": "different_linguistic_scales"}, {"score": 0.00271735110571002, "phrase": "good_results"}, {"score": 0.0025361866386341796, "phrase": "new_approach"}, {"score": 0.0021940118003312397, "phrase": "medm_case_study"}, {"score": 0.0021049977753042253, "phrase": "proposed_method"}], "paper_keywords": ["extended hierarchical linguistic", " decision-making problems"], "paper_abstract": "In multi-expert decision making (MEDM) problems the experts provide their preferences about the alternatives according to their knowledge. Because they can have different knowledge, educational backgrounds, or experiences, it seems logical that they might use different evaluation scales to express their opinions. In the present article, we focus on decision problems defined in uncertain contexts where such uncertainty is modeled by means of linguistic information, therefore the decision makers would use different linguistic scales to express their evaluations on the alternatives, i.e., multigranular linguistic scales. Several computational approaches have been presented to manage multigranular linguistic scales in decision problems. Although they provide good results in some cases, still present limitations. A new approach, so-called extended linguistic hierarchies, is presented here for managing multigranular linguistic scales to overcome those limitations, an MEDM case study is given to illustrate the proposed method.", "paper_title": "AN EXTENDED HIERARCHICAL LINGUISTIC MODEL FOR DECISION-MAKING PROBLEMS", "paper_id": "WOS:000295014200007"}