{"auto_keywords": [{"score": 0.026010656447810827, "phrase": "data_sets"}, {"score": 0.00481495049065317, "phrase": "new_technique"}, {"score": 0.004604023526673226, "phrase": "high-dimensional_data"}, {"score": 0.0039651694106206245, "phrase": "significantly_better_visualizations"}, {"score": 0.0035891316580885665, "phrase": "existing_techniques"}, {"score": 0.0035183010916001664, "phrase": "single_map"}, {"score": 0.002925728709297618, "phrase": "random_walks"}, {"score": 0.0028966970007550798, "phrase": "neighborhood_graphs"}, {"score": 0.0028394925080958205, "phrase": "implicit_structure"}, {"score": 0.0024693979425773993, "phrase": "wide_variety"}, {"score": 0.002349228457383314, "phrase": "sammon"}, {"score": 0.0023143322830981392, "phrase": "isomap"}, {"score": 0.002268598551466928, "phrase": "linear_embedding"}], "paper_keywords": ["visualization", " dimensionality reduction", " manifold learning", " embedding algorithms", " multidimensional scaling"], "paper_abstract": "We present a new technique called \"t-SNE\" that visualizes high-dimensional data by giving each datapoint a location in a two or three-dimensional map. The technique is a variation of Stochastic Neighbor Embedding (Hinton and Roweis, 2002) that is much easier to optimize, and produces significantly better visualizations by reducing the tendency to crowd points together in the center of the map. t-SNE is better than existing techniques at creating a single map that reveals structure at many different scales. This is particularly important for high-dimensional data that lie on several different, but related, low-dimensional manifolds, such as images of objects from multiple classes seen from multiple viewpoints. For visualizing the structure of very large data sets, we show how t-SNE can use random walks on neighborhood graphs to allow the implicit structure of all of the data to influence the way in which a subset of the data is displayed. We illustrate the performance of t-SNE on a wide variety of data sets and compare it with many other non-parametric visualization techniques, including Sammon mapping, Isomap, and Locally Linear Embedding. The visualizations produced by t-SNE are significantly better than those produced by the other techniques on almost all of the data sets.", "paper_title": "Visualizing Data using t-SNE", "paper_id": "WOS:000262637600007"}