{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "passive_rfid_tags"}, {"score": 0.041898495699347345, "phrase": "supply_chain_management"}, {"score": 0.004762550320451225, "phrase": "radio_frequency_identification"}, {"score": 0.004710772988908915, "phrase": "rfid"}, {"score": 0.004508942069742167, "phrase": "unique_identification_information"}, {"score": 0.004435514622798228, "phrase": "simple_computation"}, {"score": 0.004363277689798392, "phrase": "better_inventory"}, {"score": 0.003702323283528699, "phrase": "longer_range"}, {"score": 0.0034478392374444177, "phrase": "unauthorized_scanning"}, {"score": 0.0034102660898135155, "phrase": "malicious_readers"}, {"score": 0.0032107911131811057, "phrase": "security_protocol"}, {"score": 0.003175792987190496, "phrase": "rfid_tags"}, {"score": 0.002709045632654716, "phrase": "lightweight_privacy"}, {"score": 0.0024276590297034064, "phrase": "lightweight_and_secure_nature"}, {"score": 0.0021049977753042253, "phrase": "john_wiley"}], "paper_keywords": ["RFID", " Authentication", " Privacy"], "paper_abstract": "Radio frequency identification (RFID) tags are cheap, simple devices that can store unique identification information and perform simple computation to keep better inventory of packages. Because of this, they are intended to replace the barcodes for supply chain management in the near future. However, unlike barcodes, these tags have a longer range in which they are allowed to be scanned, subjecting them to unauthorized scanning by malicious readers and to various attacks, including cloning. Therefore, a security protocol for RFID tags is needed to ensure privacy and authentication between each tag and their reader. In order to accomplish this, in this paper, we propose RFIDGuard, a lightweight privacy and authentication protocol for passive RFID tags. This protocol requires little computation and achieves both privacy and authentication simultaneously. The lightweight and secure nature of our RFIDGuard protocol make it particularly suitable for supply chain management. Adaptation of our protocol can be used for other applications as well. Copyright (C) 2009 John Wiley & Sons, Ltd.", "paper_title": "RFIDGuard: a lightweight privacy and authentication protocol for passive RFID tags", "paper_id": "WOS:000283390900004"}