{"auto_keywords": [{"score": 0.023603638559917633, "phrase": "alpha-ft-crc_problem"}, {"score": 0.00481495049065317, "phrase": "capacitated_k-center"}, {"score": 0.004642292792558686, "phrase": "k_service_centers"}, {"score": 0.004179480763003705, "phrase": "service_center"}, {"score": 0.004122604238556912, "phrase": "limited_service_capacity"}, {"score": 0.003867206750827, "phrase": "maximum_distance"}, {"score": 0.0036776458116294986, "phrase": "fault-tolerant_version"}, {"score": 0.003021392767766593, "phrase": "alternate_centers"}, {"score": 0.0028470123663391104, "phrase": "alpha-fault-tolerant_conservative"}, {"score": 0.0026220103561723066, "phrase": "a-ft-ckc_problem"}, {"score": 0.002275299774554847, "phrase": "polynomial_time_algorithms"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["K-center", " Approximation algorithms", " Fault-tolerance"], "paper_abstract": "The capacitated K-center (CKC) problem calls for locating K service centers in the vertices of a given weighted graph, and assigning each vertex as a client to one of the centers, where each service center has a limited service capacity and thus may be assigned at most L clients, so as to minimize the maximum distance from a vertex to its assigned service center. This paper studies the fault-tolerant version of this problem, where one or more service centers might fail simultaneously. We consider two variants of the problem. The first is the alpha-fault-tolerant capacitated K -center (alpha-FT-CKC) problem. In this version, after the failure of some centers, all nodes are allowed to be reassigned to alternate centers. The more conservative version of this problem, hereafter referred to as the alpha-fault-tolerant conservative capacitated K-center (alpha-FT-CKC) problem, is similar to the a-FT-CKC problem, except that after the failure of some centers, only the nodes that were assigned to those centers before the failure are allowed to be reassigned to other centers. We present polynomial time algorithms that yield 9-approximation for the alpha-FT-CRC problem and 17-approximation for the alpha-FT-CRC problem. (C) 2014 Elsevier B.V. All rights reserved.", "paper_title": "The fault-tolerant capacitated K-center problem", "paper_id": "WOS:000349198000002"}