{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "sampling_theorem"}, {"score": 0.014747159526008628, "phrase": "bandlimited_functions"}, {"score": 0.00603198197422057, "phrase": "boolean_domain"}, {"score": 0.005583789162602055, "phrase": "maximum_frequency"}, {"score": 0.004663716126870148, "phrase": "digital_signal_processing"}, {"score": 0.004549366134876482, "phrase": "real_valued_function"}, {"score": 0.004012378756143084, "phrase": "linear_code"}, {"score": 0.003933508945770709, "phrase": "finite_domain"}, {"score": 0.003486316700608598, "phrase": "bounded_set"}, {"score": 0.003424972304865554, "phrase": "bandlimited_function"}, {"score": 0.0029294877178473017, "phrase": "prime_power"}, {"score": 0.0028963456829418583, "phrase": "parity_check_matrix"}, {"score": 0.002877912855903293, "phrase": "galois_field"}, {"score": 0.00285753732066807, "phrase": "order_q."}, {"score": 0.002835261961911763, "phrase": "distinct_error_vectors"}, {"score": 0.0028072256092845417, "phrase": "experimental_designs"}, {"score": 0.0027092368768921542, "phrase": "linear_combination"}, {"score": 0.0026805109390121706, "phrase": "fourier_basis_functions"}, {"score": 0.0022843440226146005, "phrase": "sampling_points"}], "paper_keywords": ["coding theory", " linear codes", " discrete Fourier transform", " experimental designs"], "paper_abstract": "In digital signal processing, the sampling theorem states that any real valued function f can be reconstructed from a sequence of values of f that are discretely sampled with a frequency at least twice as high as the maximum frequency of the spectrum of f. This theorem can also be applied to functions over finite domain. Then, the range of frequencies of f can be expressed in more detail by using a bounded set instead of the maximum frequency. A function whose range of frequencies is confined to a bounded set is referred to as bandlimited function. And a sampling theorem for bandlimited functions over Boolean domain has been obtained. Here, it is important to obtain a sampling theorem for bandlimited functions not only over Boolean domain (GF(2)(n) domain) but also over GF(q)(n) domain, where q is a prime power and GF(q) is Galois field of order q. For example, in experimental designs, although the model can be expressed as a linear combination of the Fourier basis functions and the levels of each factor can be represented by GF(q), the number of levels often take a value greater than two. However, the sampling theorem for bandlimited functions over GF(q)(n) domain has not been obtained. On the other hand, the sampling points are closely related to the codewords of a linear code. However, the relation between the parity check matrix of a linear code and any distinct error vectors has not been obtained, although it is necessary for understanding the meaning of the sampling theorem for bandlimited functions. En this paper, we generalize the sampling theorem for bandlimited functions over Boolean domain to a sampling theorem for bandlimited functions over GF(q)(n) domain. We also present a theorem for the relation between the parity check matrix of a linear code and any distinct error vectors. Lastly, we clarify the relation between the sampling theorem for functions over GF(q)(n) domain and linear codes.", "paper_title": "A Note on a Sampling Theorem for Functions over GF(q)(n) Domain", "paper_id": "WOS:000279250100005"}