{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "rough_sets"}, {"score": 0.00973283469156045, "phrase": "complementary_neighborhood"}, {"score": 0.004672953146379813, "phrase": "natural_extensions"}, {"score": 0.004589763483242731, "phrase": "classical_rough_sets"}, {"score": 0.004096082254543022, "phrase": "different_types"}, {"score": 0.0038119123317396954, "phrase": "new_notion"}, {"score": 0.0032618078775887077, "phrase": "basic_properties"}, {"score": 0.0025354258731826148, "phrase": "binary_relation"}, {"score": 0.0025051811853674215, "phrase": "inclusion_subset"}, {"score": 0.0023171750718791713, "phrase": "topological_importance"}, {"score": 0.0022218413146898887, "phrase": "topological_properties"}, {"score": 0.0021821915946356168, "phrase": "lower_and_upper_approximation_operators"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Covering rough set", " Neighborhood", " Complementary neighborhood", " Topology"], "paper_abstract": "Covering rough sets are natural extensions of the classical rough sets by relaxing the partitions to coverings. Recently, the concept of neighborhood has been applied to define different types of covering rough sets. In this paper, by introducing a new notion of complementary neighborhood, we consider some types of neighborhood-related covering rough sets, two of which are firstly defined. We first show some basic properties of the complementary neighborhood. We then explore the relationships between the considered covering rough sets and investigate the properties of them. It is interesting that the set of all the lower and upper approximations belonging to the considered types of covering rough sets, equipped with the binary relation of inclusion subset of, constructs a lattice. Finally, we also discuss the topological importance of the complementary neighborhood and investigate the topological properties of the lower and upper approximation operators. (c) 2012 Elsevier Inc. All rights reserved.", "paper_title": "On some types of neighborhood-related covering rough sets", "paper_id": "WOS:000306384100004"}