{"auto_keywords": [{"score": 0.04804050199975018, "phrase": "extended_enterprise"}, {"score": 0.019569087758174248, "phrase": "networked_manufacturing"}, {"score": 0.01500679872941592, "phrase": "manufacturing_processes"}, {"score": 0.00481495049065317, "phrase": "extended_enterprises"}, {"score": 0.004646654984830476, "phrase": "new_manufacturing_mode"}, {"score": 0.0045198174374297285, "phrase": "new_organizational_mode"}, {"score": 0.004344577216137524, "phrase": "key_point"}, {"score": 0.0042426974826585695, "phrase": "global_markets"}, {"score": 0.004143196873246147, "phrase": "major_contributions"}, {"score": 0.003966776222128288, "phrase": "industrial_areas"}, {"score": 0.003153140905312787, "phrase": "e-service-driven_networked_manufacturing_model"}, {"score": 0.0030068193773923387, "phrase": "key_enabling_techniques"}, {"score": 0.002867268370615848, "phrase": "bottom_manufacturing_resources"}, {"score": 0.0027559226203857316, "phrase": "extended_enterprise_tree"}, {"score": 0.0027126012542151015, "phrase": "core_enterprise"}, {"score": 0.002566255769251419, "phrase": "networked_manufacturing_executive_system"}, {"score": 0.0024277864377045995, "phrase": "bottom-up_strategy"}, {"score": 0.0022428042503686053, "phrase": "test_bed"}, {"score": 0.0021901023885734, "phrase": "java_web_solution"}, {"score": 0.002164216680934624, "phrase": "running_example"}], "paper_keywords": ["networked manufacturing", " extended enterprise", " E-service", " collaboration", " MES", " manufacturing information system"], "paper_abstract": "Currently, networked manufacturing is regarded as a new manufacturing mode. Extended enterprise is a type of new organizational mode of enterprises for networked manufacturing, which has become the key point for enterprises winning competitions in global markets. Nowadays, many researches and major contributions have been found on networked manufacturing and extended enterprise from academic to industrial areas. However, they mainly focus on partial conceptual/theoretical and practical application fields. How to build the models for networked manufacturing and extended enterprise, satisfactorily control the manufacturing processes at the level of extended enterprise, etc. is becoming a bottleneck. In order to overcome these limitations, on the basis of the philosophy of services driving manufactures, a kind of e-service-driven networked manufacturing model is put forward. In order to implement this model some key enabling techniques are discussed in detail. These include: e-formalizing bottom manufacturing resources; up-streaming manufacturing data; generating an extended enterprise tree that consists of core enterprise and co-enterprises based on products to be manufactured; configuring a networked manufacturing executive system at the level of extended enterprise; scheduling the manufacturing processes by means of the bottom-up strategy; tracking the manufacturing processes in the range of extended enterprise; and collaborating in the manufacturing processes. Furthermore, a test bed called e(2)-MES is developed with Java web solution. The running example from the industry indicates that the above ideas are feasible and practical.", "paper_title": "E-2-MES: an e-service-driven networked manufacturing platform for extended enterprises", "paper_id": "WOS:000246068100003"}