{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "asynchronous_oblivious_agents"}, {"score": 0.04945294158676432, "phrase": "regular_bipartite_graphs"}, {"score": 0.028797230445453095, "phrase": "gathering_problem"}, {"score": 0.004783358523770212, "phrase": "local_vision"}, {"score": 0.0045679168155893304, "phrase": "mobile_agents"}, {"score": 0.0044933373574179624, "phrase": "anonymous_graph"}, {"score": 0.0044199701363984495, "phrase": "different_nodes"}, {"score": 0.004305055407631358, "phrase": "look-compute-move_cycles"}, {"score": 0.0037242008128962104, "phrase": "latter_case"}, {"score": 0.003687568028560351, "phrase": "instantaneous_move"}, {"score": 0.003407141079879243, "phrase": "existing_literature"}, {"score": 0.0031897603004360908, "phrase": "initial_configuration"}, {"score": 0.0028608962312791264, "phrase": "asynchronous_adversary"}, {"score": 0.0027498840401059418, "phrase": "specific_configuration"}, {"score": 0.0025913692304671675, "phrase": "gatherable_configurations"}, {"score": 0.0025489778320184255, "phrase": "complete_solution"}, {"score": 0.00242590924077914, "phrase": "gatherable_initial_configurations"}, {"score": 0.0022118223311537954, "phrase": "positive_side"}, {"score": 0.0021470954708827125, "phrase": "gatherable_configuration"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Asynchronous", " Mobile agent", " Gathering", " Regular graph", " Bipartite graph"], "paper_abstract": "We consider the problem of gathering identical, memoryless, mobile agents in one node of an anonymous graph. Agents start from different nodes of the graph. They operate in Look-Compute-Move cycles and have to end up in the same node. In one cycle, an agent takes a snapshot of its immediate neighborhood (Look), makes a decision to stay idle or to move to one of its adjacent nodes (Compute), and in the latter case makes an instantaneous move to this neighbor (Move). Cycles are performed asynchronously for each agent. The novelty of our model with respect to the existing literature on gathering asynchronous oblivious agents in graphs is that the agents have very restricted perception capabilities: they can only see their immediate neighborhood. An initial configuration of agents is called gatherable if there exists an algorithm that gathers all the agents of the configuration in one node and keeps them idle from then on, regardless of the actions of the asynchronous adversary. (The algorithm can be even tailored to gather this specific configuration.) The gathering problem is to determine which configurations are gatherable and find a (universal) algorithm which gathers all gatherable configurations. We give a complete solution of the gathering problem for regular bipartite graphs. Our main contribution is the proof that the class of gatherable initial configurations is very small: it consists only of \"stars\" (an agent A with all other agents adjacent to it) of size at least 3. On the positive side we give an algorithm accomplishing gathering for every gatherable configuration. (C) 2012 Elsevier B.V. All rights reserved.", "paper_title": "Gathering asynchronous oblivious agents with local vision in regular bipartite graphs", "paper_id": "WOS:000327806300007"}