{"auto_keywords": [{"score": 0.0463806532474753, "phrase": "portal_quality_models"}, {"score": 0.00481495049065317, "phrase": "different_quality_models"}, {"score": 0.004533806239310673, "phrase": "brief_overview"}, {"score": 0.004338076511024884, "phrase": "comparative_study"}, {"score": 0.003987474771008829, "phrase": "different_portal_quality_models"}, {"score": 0.003301733505307784, "phrase": "intrinsic_data_quality"}, {"score": 0.003108669771132255, "phrase": "special_attention"}, {"score": 0.003083793024782014, "phrase": "visual_aspects"}, {"score": 0.002868646843975439, "phrase": "web_portal"}, {"score": 0.0024922258873137093, "phrase": "web_portal_quality"}, {"score": 0.002374855916752648, "phrase": "portal_quality_model"}, {"score": 0.002308953751676031, "phrase": "portal_quality_levels"}, {"score": 0.0022001958412800745, "phrase": "low_quality_level"}, {"score": 0.0021738146596180404, "phrase": "particular_dimension"}, {"score": 0.0021049977753042253, "phrase": "weaker_aspects"}], "paper_keywords": ["portals", " worldwide web", " quality"], "paper_abstract": "Purpose - The purpose of this research is to present a brief overview of some proposals for portal quality models. In addition, a comparative study is carried out to determine the similarities and differences of these models. Design/methodology/approach - In order to compare the different portal quality models, their main characteristics were analysed as well as the different dimensions proposed in each model. Findings - As a result, several similarities and differences have been established among the portal quality models. For example, the dimensions present in all the models are navigation, representation, personalization and intrinsic data quality. This means that, as expected, it was found that researchers pay special attention to visual aspects. Practical implications - The comparison attempts to determine which aspects are important for the quality of a web portal, and also to clarify which proposal is the most broadly relevant. The paper also identifies, where necessary, what features must be added in order to ensure that all aspects related to web portal quality are considered. Originality/value - This work tries to identify a portal quality model that can be used to gauge portal quality levels. The model could also be used where there is a low quality level for a particular dimension, giving some guidelines for improving the weaker aspects.", "paper_title": "Comparing different quality models for portals", "paper_id": "WOS:000242100100006"}