{"auto_keywords": [{"score": 0.04088540268464634, "phrase": "web_pages"}, {"score": 0.004703149944841539, "phrase": "indispensible_source"}, {"score": 0.004504850679320975, "phrase": "enormous_speed"}, {"score": 0.003674461410107989, "phrase": "different_url"}, {"score": 0.003397362086358944, "phrase": "communication_failures"}, {"score": 0.0033314049082500794, "phrase": "better_understanding"}, {"score": 0.003128798520531889, "phrase": "long_periods"}, {"score": 0.0029500270981001058, "phrase": "publicly_available_resources"}, {"score": 0.0028033523242224833, "phrase": "new_pages"}, {"score": 0.0026954938318408464, "phrase": "existing_pages"}, {"score": 0.0026431267487109543, "phrase": "previously_existing_pages"}, {"score": 0.002511672561475743, "phrase": "specified_topic"}, {"score": 0.0022948742034852917, "phrase": "data-collection_method"}, {"score": 0.002232675154416128, "phrase": "dynamic_changes"}, {"score": 0.0022152149658434916, "phrase": "search_engine_coverage"}, {"score": 0.0021721582450016, "phrase": "google-the_search_engine"}, {"score": 0.0021383149182448522, "phrase": "longest_period"}, {"score": 0.0021049977753042253, "phrase": "data_collection"}], "paper_keywords": [""], "paper_abstract": "The universe of information has been enriched by the creation of the World Wide Web, which has become an indispensible source for research. Since this source Is growing at an enormous speed, an in-depth look of its performance to create a method for its evaluation has become necessary; however, growth is not the only process that influences the evolution of the Web. During their lifetime, Web pages may change their content and links to/from other Web pages, be duplicated or moved to a different URL, be removed from the Web either temporarily or permanently, and be temporarily inaccessible due to server and/or communication failures. To obtain a better understanding of these processes, we developed a method for tracking topics on the Web for long periods of time, without the need to employ a crawler and relying only on publicly available resources. The multiple data-collection methods used allow us to discover new pages related to the topic, to identify changes to existing pages, and to detect previously existing pages that have been removed or whose content is not relevant anymore to the specified topic. The method is demonstrated through monitoring Web pages that contain the term \"informetrics\" for a period of 8 years. The data-collection method also allowed us to analyze the dynamic changes in search engine coverage, illustrated here on Google-the search engine used for the longest period of time for data collection in this project.", "paper_title": "A Method for Measuring the Evolution of a Topic on the Web: The Case of \"Informetrics\"", "paper_id": "WOS:000269090000002"}