{"auto_keywords": [{"score": 0.026897811453592883, "phrase": "ss-spst-efc"}, {"score": 0.004815054180270433, "phrase": "manets"}, {"score": 0.004783483480147339, "phrase": "end-to-end_reliability_constraints"}, {"score": 0.004539005582217309, "phrase": "self-healing_routing_protocols"}, {"score": 0.004435996321956133, "phrase": "node_mobility"}, {"score": 0.004363846362238565, "phrase": "time-critical_manet_applications"}, {"score": 0.004127164752958245, "phrase": "reliable_data_streaming"}, {"score": 0.004073359218158693, "phrase": "energy_efficiency"}, {"score": 0.003980875186335867, "phrase": "energy-efficient_routing_protocols"}, {"score": 0.003802135020791801, "phrase": "deployment_phase"}, {"score": 0.0031019373572233706, "phrase": "wecm"}, {"score": 0.0029722953353136963, "phrase": "amo"}, {"score": 0.0027469703311742647, "phrase": "numerical_evaluations"}, {"score": 0.0027200305495826797, "phrase": "ss-spst-e"}, {"score": 0.00268452026617243, "phrase": "energy_consumption"}, {"score": 0.0026494723416072316, "phrase": "non-adaptive_energy-efficient_protocols"}, {"score": 0.002623487778069759, "phrase": "ewma"}, {"score": 0.0025554259726979786, "phrase": "simulation_results"}, {"score": 0.0025055391159787134, "phrase": "maximum_balance"}, {"score": 0.002480961181275199, "phrase": "energy-reliability_trade-off"}, {"score": 0.0024405312482831646, "phrase": "end-to-end_packet_delivery_requirement"}, {"score": 0.0023850311572318496, "phrase": "energy-reliability_balance"}, {"score": 0.002330790244117364, "phrase": "packet_delivery_ratio"}, {"score": 0.002125859121671525, "phrase": "maodv_and_odmrp_protocols"}], "paper_keywords": ["Self-management", " Energy efficiency", " Mobile Ad hoc NETwork", " Self-stabilization", " Multicasting"], "paper_abstract": "Dynamic networks, e.g. Mobile Ad hoc NETworks (MANETs), call for self-healing routing protocols to tolerate topological changes imposed by node mobility. Moreover, emerging time-critical MANET applications such as disaster response and rescue, and battlefield operations, require support for real-time, reliable data streaming, while maintaining energy efficiency. However, most of the energy-efficient routing protocols rely on configuration parameters which need to be estimated and specified before the deployment phase. This paper proposes a self-managing, energy-efficient multicast routing suite based on the self-stabilization paradigm. This suite uses (i) WECM, a Waste Energy Cost Metric designed for energy-efficient route selection, (ii) SS-SPST-E, a Self-Stabilizing, Shortest Path Spanning Tree protocol for Energy efficiency based on WECM to maintain an energy-efficient, self-healing routing structure, (iii) SS-SPST-Efc, an enhanced SS-SPST-E with fault containment to decrease stabilization latency, (iv) AMO, an Analytical Model for Optimization framework to reduce the energy overhead of the route maintenance mechanism, and (v) self-configuration mechanisms that observe, estimate and disseminate the optimization parameters. The WECM's innovation is that it considers the overhearing energy wasted. The AMO framework considers the link state change rate, application data traffic intensity, application packet delivery requirements, and the stabilization latency. Numerical evaluations show that SS-SPST-E slightly increases the energy consumption when compared with non-adaptive energy-efficient protocols such as EWMA because of its mechanism to handle mobility. Simulation results show that SS-SPST-Efc achieves the maximum balance between the energy-reliability trade-off while conforming to the end-to-end packet delivery requirement with an accuracy between 80% and 100%. The energy-reliability balance, measured in terms of the packet delivery ratio (PDR) per millijoules of energy expended, is at least 24% and 27% higher in SS-SPST-E and SS-SPST-Efc, respectively, when compared to the MAODV and ODMRP protocols. (C) 2008 Elsevier B.V. All rights reserved.", "paper_title": "Self-managing energy-efficient multicast support in MANETs under end-to-end reliability constraints", "paper_id": "WOS:000267338400004"}