{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "faraday_rotation"}, {"score": 0.021193279942170684, "phrase": "path_delay"}, {"score": 0.004626255242038005, "phrase": "electromagnetic_wave"}, {"score": 0.004299228562179176, "phrase": "depolarizing_effect"}, {"score": 0.004021954624114115, "phrase": "global_position"}, {"score": 0.003712640297460159, "phrase": "range_resolution"}, {"score": 0.003614895644619489, "phrase": "polarimetric_measurements"}, {"score": 0.0034730657554172405, "phrase": "ground_communications"}, {"score": 0.0032058286587989234, "phrase": "signal_reception"}, {"score": 0.003039159447717346, "phrase": "simple_vectorized_model"}, {"score": 0.0029199029702159126, "phrase": "faraday"}, {"score": 0.00260657976055413, "phrase": "current_models"}, {"score": 0.002421975107313603, "phrase": "presented_work"}], "paper_keywords": ["Faraday rotation", " ionosphere", " path delay", " remote sensing", " satellite communications"], "paper_abstract": "An electromagnetic wave propagating through the ionosphere is subject to path delay and the depolarizing effect of Faraday rotation, both of which are dependent on global position and geometry. These effects introduce error and consequently reduce the range resolution of remote sensing polarimetric measurements. Satellite-to-ground communications may be adversely altered by these effects so as to inhibit signal reception. The work presented here introduces a simple vectorized model for a large-field-of-view, low-Earth-orbit, satellite system that yields Faraday rotation and path delay according to global position and geometric parameters. Comparison is made with current models, through the simulation of Faraday rotation and path delay. The presented work may extend the range over which Faraday rotation and path delay estimation are reliable. The work presented forms part of a large-field-of-view, low-Earth-orbit satellite model exploiting multiple-input multiple-output polarimetry in three dimensions.", "paper_title": "3-D Low Earth Orbit Vector Estimation of Faraday Rotation and Path Delay", "paper_id": "WOS:000371388200131"}