{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "models"}, {"score": 0.0035410467987580484, "phrase": "hybrid_censoring_schemes"}, {"score": 0.003465189575252443, "phrase": "competing_risks"}, {"score": 0.0033762956164519286, "phrase": "step-stress_modeling"}, {"score": 0.0029264925857346497, "phrase": "censoring_schemes"}, {"score": 0.002888692115811987, "phrase": "inferential_methods"}, {"score": 0.002718627370925435, "phrase": "optimal_hybrid_censoring_scheme"}, {"score": 0.0026835045963349647, "phrase": "important_design_problem"}, {"score": 0.0023056996845692355, "phrase": "open_problems"}, {"score": 0.002266051712795851, "phrase": "possible_future_work"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Type-I and Type-II hybrid censoring schemes", " Progressive censoring scheme", " Adaptive progressive censoring", " Competing risks", " Fisher information", " Maximum likelihood estimators", " Optimal sampling plans", " Step-stress testing"], "paper_abstract": "A hybrid censoring scheme is a mixture of Type-I and Type-II censoring schemes. In this review, we first discuss Type-I and Type-II hybrid censoring schemes and associated inferential issues. Next, we present details on developments regarding generalized hybrid censoring and unified hybrid censoring schemes that have been introduced in the literature. Hybrid censoring schemes have been adopted in competing risks set-up and in step-stress modeling and these results are outlined next. Recently, two new censoring schemes, viz., progressive hybrid censoring and adaptive progressive censoring schemes have been introduced in the literature. We discuss these censoring schemes and describe inferential methods based on them, and point out their advantages and disadvantages. Determining an optimal hybrid censoring scheme is an important design problem, and we shed some light on this issue as well. Finally, we present some examples to illustrate some of the results described here. Throughout the article, we mention some open problems and suggest some possible future work for the benefit of readers interested in this area of research. (C) 2012 Elsevier B.V. All rights reserved.", "paper_title": "Hybrid censoring: Models, inferential results and applications", "paper_id": "WOS:000310403700014"}