{"auto_keywords": [{"score": 0.043035202886745394, "phrase": "texcomon"}, {"score": 0.007249451045251977, "phrase": "concept_maps"}, {"score": 0.00517074664305946, "phrase": "comparative_evaluations"}, {"score": 0.00481495049065317, "phrase": "domain_ontologies"}, {"score": 0.004448705308279165, "phrase": "plain_text_documents"}, {"score": 0.00431388720289049, "phrase": "domain_model"}, {"score": 0.00427612041204006, "phrase": "computer-based_education"}, {"score": 0.00416478405812793, "phrase": "generation_procedure"}, {"score": 0.00376409764683147, "phrase": "domain_ontology"}, {"score": 0.0037311260623089436, "phrase": "data_sources"}, {"score": 0.0033572130837348623, "phrase": "generated_domain_ontology"}, {"score": 0.003255364511414329, "phrase": "three-dimensional_evaluation"}, {"score": 0.00303398491761013, "phrase": "structural_evaluations"}, {"score": 0.0029548937818509656, "phrase": "semantic_evaluations"}, {"score": 0.0029161225023394363, "phrase": "human_expert_judgment"}, {"score": 0.002623669616798891, "phrase": "new_tools"}, {"score": 0.002434396049547248, "phrase": "new_techniques"}, {"score": 0.0022192891418394535, "phrase": "ontology_generation"}, {"score": 0.0021049977753042253, "phrase": "superior_performance"}], "paper_keywords": ["Concept learning", " domain engineering", " knowledge acquisition", " ontology design"], "paper_abstract": "One of the goals of the Knowledge Puzzle Project is to automatically generate a domain ontology from plain text documents and use this ontology as the domain model in computer-based education. This paper describes the generation procedure followed by TEXCOMON, the Knowledge Puzzle Ontology Learning Tool, to extract concept maps from texts. It also explains how these concept maps are exported into a domain ontology. Data sources and techniques deployed by TEXCOMON for ontology learning from texts are briefly described herein. Then, the paper focuses on evaluating the generated domain ontology and advocates the use of a three-dimensional evaluation: structural, semantic, and comparative. Based on a set of metrics, structural evaluations consider ontologies as graphs. Semantic evaluations rely on human expert judgment, and finally, comparative evaluations are based on comparisons between the outputs of state-of-the-art tools and those of new tools such as TEXCOMON, using the very same set of documents in order to highlight the improvements of new techniques. Comparative evaluations performed in this study use the same corpus to contrast results from TEXCOMON with those of one of the most advanced tools for ontology generation from text. Results generated by such experiments show that TEXCOMON yields superior performance, especially regarding conceptual relation learning.", "paper_title": "Evaluating the Generation of Domain Ontologies in the Knowledge Puzzle Project", "paper_id": "WOS:000269851800005"}