{"auto_keywords": [{"score": 0.03260064589781526, "phrase": "vector_potential"}, {"score": 0.00481495049065317, "phrase": "fluid_flows"}, {"score": 0.004753194996637899, "phrase": "vector_potentials"}, {"score": 0.004662036750452837, "phrase": "based_fluid_simulations"}, {"score": 0.0045726187330434025, "phrase": "expensive_computation_cost"}, {"score": 0.004484908028307205, "phrase": "realistic_animations"}, {"score": 0.0040708542958968605, "phrase": "input_fluid_animation_sequence"}, {"score": 0.003647442345566347, "phrase": "flow_field"}, {"score": 0.0035087260813209593, "phrase": "overall_fluid_behavior"}, {"score": 0.0033752674784204412, "phrase": "plausible_physical_behavior"}, {"score": 0.0031845067058084583, "phrase": "mass_conservation"}, {"score": 0.00247460024299964, "phrase": "deformed_velocity_field"}, {"score": 0.002411383506019635, "phrase": "curl_operator"}], "paper_keywords": ["Flow deformation", " Incompressibility", " Vector potential"], "paper_abstract": "Physically based fluid simulations usually require expensive computation cost for creating realistic animations. We present a technique that allows the user to create various fluid animations from an input fluid animation sequence, without the need for repeatedly performing simulations. Our system allows the user to deform the flow field in order to edit the overall fluid behavior. In order to maintain plausible physical behavior, we ensure the incompressibility to guarantee the mass conservation. We use a vector potential for representing the flowfields to realize such incompressibility-preserving deformations. Our method first computes (time-varying) vector potentials from the input velocity field sequence. Then, the user deforms the vector potential, and the system computes the deformed velocity field by taking the curl operator on the vector potential. The incompressibility is thus obtained by construction. We show various examples to demonstrate the usefulness of our method.", "paper_title": "Incompressibility-preserving deformation for fluid flows using vector potentials", "paper_id": "WOS:000357487500021"}