{"auto_keywords": [{"score": 0.015640137215810663, "phrase": "partial_transition_systems"}, {"score": 0.00986569206488336, "phrase": "model_checking"}, {"score": 0.00481495049065317, "phrase": "partial_modeling_formalisms"}, {"score": 0.004765788394931875, "phrase": "abstract_model_checking"}, {"score": 0.004741395005218184, "phrase": "complex_temporal_properties"}, {"score": 0.004668957916795845, "phrase": "under-approximating_abstractions"}, {"score": 0.004633153497593343, "phrase": "single_model"}, {"score": 0.004322967486451877, "phrase": "necessary_and_possible_behaviours"}, {"score": 0.00374399358035391, "phrase": "concrete_systems"}, {"score": 0.0035565113234273926, "phrase": "temporal_properties"}, {"score": 0.0034396947486115812, "phrase": "consistent_interpretation"}, {"score": 0.003413284742632989, "phrase": "temporal_logic_formulas"}, {"score": 0.003343841875107018, "phrase": "semantic_and_logical_consistency"}, {"score": 0.0031037094461453395, "phrase": "analysis_power"}, {"score": 0.0028586409810976367, "phrase": "necessary_and_sufficient_structural_condition"}, {"score": 0.002552871791828221, "phrase": "direct_use"}, {"score": 0.0024062532032402533, "phrase": "new_semantics"}, {"score": 0.002393907896783117, "phrase": "temporal_logic"}, {"score": 0.002357249810661667, "phrase": "mixts_family"}, {"score": 0.002309242063033298, "phrase": "gkmts_family"}, {"score": 0.0022738775158524793, "phrase": "symbolic_model_checking_algorithm"}, {"score": 0.002250601866422547, "phrase": "efficient_encoding"}, {"score": 0.0022390533383717715, "phrase": "mixtss"}, {"score": 0.0021654157292186967, "phrase": "new_algorithm"}, {"score": 0.0021487685525986094, "phrase": "good_match"}, {"score": 0.0021377414429251647, "phrase": "predicate-abstraction-based_model_checkers"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Partial transition systems", " Modal transition systems", " 3-Valued analysis", " Abstraction", " Model-checking"], "paper_abstract": "Partial transition systems support abstract model checking of complex temporal properties by combining both over- and under-approximating abstractions into a single model. Over the years, three families of such modeling formalisms have emerged, represented by (1) Kripke Modal Transition Systems (KMTSs), with restrictions on necessary and possible behaviours; (2) Mixed Transition Systems (MixTSs), with relaxation on these restrictions; and (3) Generalized Kripke MTSs (GKMTSs), with hyper-transitions, respectively. In this paper, we investigate these formalisms based on two fundamental ways of using partial transition systems (FTSs) - as objects for abstracting concrete systems (and thus, a PTS is semantically consistent if it abstracts at least one concrete system) and as models for checking temporal properties (and thus, a PTS is logically consistent if it gives consistent interpretation to all temporal logic formulas). We study the connection between semantic and logical consistency of PTSs, compare the three families w.r.t. their expressive power (i.e., what can be modeled, what abstractions can be captured using them), and discuss the analysis power of these formalisms, i.e., the cost and precision of model checking. Specifically, we identify a class of PTSs for which semantic and logical consistency coincide and define a necessary and sufficient structural condition to guarantee consistency. We also show that all three families of PTSs have the same expressive power (but do differ in succinctness). However, GKMTSs are more precise (i.e., can establish more properties) for model checking than the other two families. The direct use of GKMTSs in practice has been hampered by the difficulty of encoding them symbolically. We address this problem by developing a new semantics for temporal logic of FTSs that makes the MixTS family as precise for model checking as the GKMTS family. The outcome is a symbolic model checking algorithm that combines the efficient encoding of MixTSs with the model checking precision of GKMTSs. Our preliminary experiments indicate that the new algorithm is a good match for predicate-abstraction-based model checkers. (C) 2010 Elsevier Inc. All rights reserved.", "paper_title": "On the consistency, expressiveness, and precision of partial modeling formalisms", "paper_id": "WOS:000285405100002"}