{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "natural_gas_supply"}, {"score": 0.014251141099622302, "phrase": "china"}, {"score": 0.006356374717990083, "phrase": "natural_gas_resources"}, {"score": 0.006121126172000216, "phrase": "energy_structure"}, {"score": 0.0043194180167921165, "phrase": "different_circumstances"}, {"score": 0.004139639802595566, "phrase": "related_factors"}, {"score": 0.003426640459083931, "phrase": "gas_industry"}, {"score": 0.0032376465741070274, "phrase": "scenario_analysis"}, {"score": 0.00297346171320082, "phrase": "investment_level"}, {"score": 0.0028495431343111897, "phrase": "natural_gas"}, {"score": 0.0028093921138602606, "phrase": "growing_impacts"}, {"score": 0.0023694065215394593, "phrase": "new_prediction_model"}, {"score": 0.0023030731312573246, "phrase": "system_dynamics"}, {"score": 0.002196609505859369, "phrase": "decision_makers"}, {"score": 0.002175913488493802, "phrase": "energy_industries"}, {"score": 0.0021049977753042253, "phrase": "energy_prices"}], "paper_keywords": ["Natural gas", " Supply and demand", " Simulation", " China", " Cybernetics"], "paper_abstract": "Purpose - The purpose of this paper is to model the trend of natural gas supply and demand in China in different circumstances from 1990 to 2050. Design/methodology/approach - The related factors were selected from references and classified into three categories such as endogenous, exogenous, and excluded factors. The three sub-models of supply, demand and their interconnection were built and integrated. The impacts of natural gas resources, the investment of gas industry and the energy structure over natural gas supply and demand were analyzed based on scenario analysis. Findings - The impact of energy structure in China is more evident compared to natural gas resources and the investment level. Research limitations/implications - Import and transportation of natural gas will have growing impacts on the supply and demand in China when the model is applied. Practical implications - A very useful method to analyze the equilibrium of natural gas supply and demand. Originality/value - The paper presents a new prediction model of natural gas supply and demand in system dynamics. The paper is aimed at the researchers and decision makers in energy industries, especially in the fields of energy prices.", "paper_title": "The simulated system dynamics analysis of the natural gas supply and demand", "paper_id": "WOS:000281928100006"}