{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "organization's_website"}, {"score": 0.045027842429353294, "phrase": "perceived_ease"}, {"score": 0.0396600464562225, "phrase": "information_quality"}, {"score": 0.025745821244938332, "phrase": "tangible_products"}, {"score": 0.00466684417181804, "phrase": "product_tangibility."}, {"score": 0.004476399615305783, "phrase": "users'_experiences"}, {"score": 0.004445419749485783, "phrase": "behavioral_intentions"}, {"score": 0.00436890075128947, "phrase": "site-related_factors"}, {"score": 0.0041184131734368825, "phrase": "relative_importance"}, {"score": 0.0035468507553681034, "phrase": "relative_tangibility"}, {"score": 0.0035100601949451028, "phrase": "offered_products"}, {"score": 0.003366662001961897, "phrase": "large-scale_study"}, {"score": 0.0032067276476968032, "phrase": "study's_hypotheses"}, {"score": 0.0030756833977949273, "phrase": "second_study"}, {"score": 0.00303319936111073, "phrase": "french-speaking_sample"}, {"score": 0.00301217724562369, "phrase": "site_information_quality"}, {"score": 0.002980916123365584, "phrase": "strongest_predictor"}, {"score": 0.0028890603352364273, "phrase": "site_interactivity"}, {"score": 0.0027806165169981622, "phrase": "moderating_role"}, {"score": 0.002761340122199076, "phrase": "product_tangibility"}], "paper_keywords": ["ease of use", " electronic commerce", " information quality", " interactivity", " IT artefact", " personalization", " product tangibility", " service design", " site usability", " website design"], "paper_abstract": "The ease of use of an organization's website is central to determining users' experiences and behavioral intentions. Understanding how the site-related factors contribute to shaping perceived ease of use is thus critical. Nonetheless, we contend that the relative importance of these factors in shaping ease of use may vary according to the product offered by the organization. This research hypothesizes that the information quality of a website and its interactivity and aesthetics are antecedents to perceived ease of use and that the relative tangibility of the offered products moderates these relationships. The hypotheses are examined by performing a large-scale study in which each participant performs a task on one of 59 organizational websites. The study's hypotheses were supported, and the results were then replicated using a second study conducted on a French-speaking sample. Site information quality is the strongest predictor of perceived ease of use, followed by the site interactivity and aesthetics. The results, however, underscore the moderating role of product tangibility. While the effects of interactivity and aesthetics are greater for sites offering services (e.g., communication, travel, insurance, and financial services), the effect of information quality is stronger for sites offering tangible products (e.g., electronics, books, and home improvement goods). The findings suggest that organizations offering tangible products should focus on providing their sites' visitors with quality information, whereas organizations offering services should primarily focus on their sites' aesthetics, interactive, and personalization features.", "paper_title": "DETERMINANTS OF AN ORGANIZATION'S WEBSITE EASE OF USE: THE MODERATING ROLE OF PRODUCT TANGIBILITY", "paper_id": "WOS:000363301700001"}