{"auto_keywords": [{"score": 0.04966447721457641, "phrase": "spatio-temporal_reasoning"}, {"score": 0.030392044875317006, "phrase": "spatio-temporal_information"}, {"score": 0.00481495049065317, "phrase": "interactions_among_objects"}, {"score": 0.004590052784169268, "phrase": "automated_reasoning_system"}, {"score": 0.004530552828603269, "phrase": "object_behaviors"}, {"score": 0.004394688617163029, "phrase": "event_sequences"}, {"score": 0.004300133642951283, "phrase": "existing_system"}, {"score": 0.0034441863065051235, "phrase": "tim"}, {"score": 0.003384695931421288, "phrase": "main_testbed"}, {"score": 0.0027461155463816772, "phrase": "knowledge_base"}, {"score": 0.002462664392109308, "phrase": "spatial_and_temporal_information"}, {"score": 0.0023782753249846794, "phrase": "knowledge-based_approach"}, {"score": 0.002266931093770838, "phrase": "prior_knowledge"}, {"score": 0.0021797112385590913, "phrase": "spatio-temporal_reasoning_method"}, {"score": 0.002151388538895855, "phrase": "computer_game_domain"}], "paper_keywords": ["Automated learning", " automated planning", " knowledge representation", " logical reasoning", " spatio-temporal reasoning"], "paper_abstract": "In this paper, we introduce an automated reasoning system for learning object behaviors and interactions through the observation of event sequences. We use an existing system to learn the models of objects and further extend it to model more complex behaviors. Furthermore, we propose a spatio-temporal reasoning based learning method for reasoning about interactions among objects. Experience gained through learning is to be used for achieving goals by these objects. We take The Incredible Machine game (TIM) as the main testbed to analyze our system. Tutorials of the game are used to train the system. We analyze the results of our reasoning system on four different input types: a knowledge base of relations; spatial information; temporal information; and spatio-temporal information from the environment. Our analysis reveals that if a knowledge base about relations is provided, most of the interactions can be learned. We have also demonstrated that our learning method which incorporates both spatial and temporal information gives close results to that of the knowledge-based approach. This is promising as gathering spatio-temporal information does not require prior knowledge about relations. Our second analysis of the spatio-temporal reasoning method in the Electric Box computer game domain verifies the success of our approach.", "paper_title": "Learning Behaviors of and Interactions Among Objects Through Spatio-Temporal Reasoning", "paper_id": "WOS:000351542300008"}