{"auto_keywords": [{"score": 0.037882059877054196, "phrase": "educational_programme"}, {"score": 0.00481495049065317, "phrase": "teacher's_learning_community_context"}, {"score": 0.0046192222897398685, "phrase": "course_programmes"}, {"score": 0.0045158206186680224, "phrase": "community_context"}, {"score": 0.004381527499253281, "phrase": "concrete_and_appropriate_course_model"}, {"score": 0.0040323765107766335, "phrase": "model_implementation"}, {"score": 0.004002044115117644, "phrase": "technology-_based_courses"}, {"score": 0.003853757393357659, "phrase": "adult_collaborative_learning_principles"}, {"score": 0.0037674258625824113, "phrase": "learning_community_context"}, {"score": 0.0035331426502479687, "phrase": "in-_service"}, {"score": 0.0035198224928307854, "phrase": "primary_and_secondary_education_teachers"}, {"score": 0.003440945901489461, "phrase": "school-teacher's"}, {"score": 0.0034279721355412285, "phrase": "learning_community"}, {"score": 0.0033385105985286154, "phrase": "broad_e-learning_community_students"}, {"score": 0.0031665087019813244, "phrase": "information_and_communication_technologies"}, {"score": 0.0030375852871252934, "phrase": "previously_specified_course_model"}, {"score": 0.002902903244616154, "phrase": "substantial_independence"}, {"score": 0.0028164399450837465, "phrase": "course_model"}, {"score": 0.0027119634978446895, "phrase": "case_study"}, {"score": 0.002402921062033032, "phrase": "research_question"}, {"score": 0.0023490143960001675, "phrase": "successful_results"}, {"score": 0.0022963142779850562, "phrase": "specified_course_model"}, {"score": 0.0022618378709785172, "phrase": "course_assessment_issues"}, {"score": 0.002202742267484358, "phrase": "positive_results"}], "paper_keywords": [""], "paper_abstract": "How could we design course programmes in a teachers' learning community context? Is it possible to conceive a concrete and appropriate course model? And if so, how could we assess the effectiveness of such a course model in such a complex learning situation? In this paper, a model implementation of technology- based courses is presented. The model was specified according to adult collaborative learning principles and was implemented in a learning community context. This model was put into practice during a distance learning educational programme, concerning further education of in- service primary and secondary education teachers. The programme was named School-Teacher's Learning Community and hosted many different web-based supported courses. Within this broad e-Learning Community students were educated, via the Internet, on aspects mainly concerning uses of information and communication technologies (ICT) in their teaching practices. The application of the previously specified course model was pursued, yet instructors responsible for each course were given substantial independence and the degree of harmonization with the course model was up to them. Some aspects of the case study, which was conducted within the context of this educational programme, are also presented. Emphasis was given to correlations that are derived from the analysis of data related to the research question concerning 'the extent of successful results that the application of the specified course model produced'. Course assessment issues were dealt with and evaluation of positive results was accomplished through the measurement of the degree of satisfaction of certain criteria that were considered decisive. Finally, conclusions, benefits and perspectives of issues presented in the paper are also presented.", "paper_title": "A course model implemented in a teacher's learning community context: issues of course assessment", "paper_id": "WOS:000250361500011"}