{"auto_keywords": [{"score": 0.04875227329545032, "phrase": "refined_models"}, {"score": 0.01049445267209216, "phrase": "urban_areas"}, {"score": 0.009979596437885143, "phrase": "nonlinear_time-history_analysis"}, {"score": 0.00481495049065317, "phrase": "seismic_damage_simulations"}, {"score": 0.0043029342321223825, "phrase": "urban_regional_seismic_damage_simulation"}, {"score": 0.0038668462001710314, "phrase": "traditional_central_processing_unit"}, {"score": 0.0033405704229694656, "phrase": "coarse-grained_parallel_approach"}, {"score": 0.0026222551419772867, "phrase": "performance-to-price_ratio"}, {"score": 0.0024234059612683032, "phrase": "traditional_cpu_approach"}, {"score": 0.0023560952790080943, "phrase": "seismic_damage_simulation"}, {"score": 0.0023166075278110254, "phrase": "medium-sized_urban_area"}, {"score": 0.0021773853011112882, "phrase": "proposed_method"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Urban regional seismic damage simulation", " Graphics processing unit", " Refined model", " Parallel computing", " Multi-story concentrated-mass shear model", " Hybrid computing"], "paper_abstract": "Refined models and nonlinear time-history analysis have been important developments in the field of urban regional seismic damage simulation. However, the application of refined models has been limited because of their high computational cost if they are implemented on traditional central processing unit (CPU) platforms. In recent years, graphics processing unit (CPU) technology has been developed and applied rapidly because of its powerful parallel computing capability and low cost. Hence, a coarse-grained parallel approach for seismic damage simulations of urban areas based on refined models and GPU/CPU cooperative computing is proposed. The buildings are modeled using a multi-story concentrated-mass shear (MCS) model, and their seismic responses are simulated using nonlinear time-history analysis. The benchmark cases demonstrate the performance-to-price ratio of the proposed approach can be 39 times as great as that of a traditional CPU approach. Finally, a seismic damage simulation of a medium-sized urban area is implemented to demonstrate the capacity and advantages of the proposed method. (C) 2014 Elsevier Ltd. All rights reserved.", "paper_title": "A coarse-grained parallel approach for seismic damage simulations of urban areas based on refined models and GPU/CPU cooperative computing", "paper_id": "WOS:000333796100008"}