{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "elite_journals"}, {"score": 0.0047761092701293474, "phrase": "previous_research"}, {"score": 0.004642604455537883, "phrase": "highest-quality_work"}, {"score": 0.00453113241842654, "phrase": "increasingly_diverse_and_larger_group"}, {"score": 0.003996271202811961, "phrase": "citation_patterns"}, {"score": 0.003932003833923186, "phrase": "seven_long-standing_traditionally_elite_journals"}, {"score": 0.003524322230452833, "phrase": "twice_as_many_citations"}, {"score": 0.0033029038236817372, "phrase": "decreasing_proportion"}, {"score": 0.0032629585038738856, "phrase": "top-cited_papers"}, {"score": 0.0030828215204304473, "phrase": "top_venues"}, {"score": 0.003020918749760067, "phrase": "bibliometric_indicators"}, {"score": 0.0028195727965553367, "phrase": "increasing_proportion"}, {"score": 0.0027854565462509095, "phrase": "most-cited_papers"}, {"score": 0.0027295084882654917, "phrase": "new_challenges"}, {"score": 0.002537216271965659, "phrase": "journal_hierarchy"}, {"score": 0.0021569129153653777, "phrase": "\"elite\"_journals"}, {"score": 0.0021049977753042253, "phrase": "constant_flux"}], "paper_keywords": [""], "paper_abstract": "Previous research indicates that during the past 20 years, the highest-quality work has been published in an increasingly diverse and larger group of journals. In this article, we examine whether this diversification has also affected the handful of elite journals that are traditionally considered to be the best. We examine citation patterns during the past 40 years of seven long-standing traditionally elite journals and six journals that have been increasing in importance during the past 20 years. To be among the top 5% or 1% cited papers, papers now need about twice as many citations as they did 40 years ago. Since the late 1980s and early 1990s, elite journals have been publishing a decreasing proportion of these top-cited papers. This also applies to the two journals that are typically considered as the top venues and often used as bibliometric indicators of \"excellence\": Science and Nature. On the other hand, several new and established journals are publishing an increasing proportion of the most-cited papers. These changes bring new challenges and opportunities for all parties. Journals can enact policies to increase or maintain their relative position in the journal hierarchy. Researchers now have the option to publish in more diverse venues knowing that their work can still reach the same audiences. Finally, evaluators and administrators need to know that although there will always be a certain prestige associated with publishing in \"elite\" journals, journal hierarchies are in constant flux.", "paper_title": "Are Elite Journals Declining?", "paper_id": "WOS:000335583300001"}