{"auto_keywords": [{"score": 0.044248716487613034, "phrase": "uncertain_linguistic_variables"}, {"score": 0.014581885077664758, "phrase": "attribute_weights"}, {"score": 0.009074380056072437, "phrase": "deviation_degree"}, {"score": 0.008725735873631669, "phrase": "ideal_point"}, {"score": 0.008067795309504043, "phrase": "possibility_degree"}, {"score": 0.007252930524462166, "phrase": "optimization_model"}, {"score": 0.00481495049065317, "phrase": "multiple_attribute_decision"}, {"score": 0.004734448316824488, "phrase": "incomplete_weight_information"}, {"score": 0.004681525814235883, "phrase": "uncertain_linguistic_environment"}, {"score": 0.004603244077348199, "phrase": "multi-attribute_decision_making_problems"}, {"score": 0.004351595642056769, "phrase": "attribute_values"}, {"score": 0.003104849179057156, "phrase": "simple_and_exact_formula"}, {"score": 0.0022145052062614514, "phrase": "illustrative_example"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Multiple attribute decision making under linguistic setting", " Uncertain linguistic variable", " Deviation degree", " Possibility degree", " Ideal point"], "paper_abstract": "The multi-attribute decision making problems are studied, in which the information about the attribute values take the form of uncertain linguistic variables. The concept of deviation degree between uncertain linguistic variables is defined, and ideal point of uncertain linguistic decision making matrix is also defined. A formula of possibility degree for the comparison between uncertain linguistic variables is proposed. Based on the deviation degree and ideal point Of uncertain linguistic variables, an optimization model is established, by solving the model, a simple and exact formula is derived to determine the attribute weights where the information about the attribute weights is completely unknown. For the information about the attribute weights is partly known, another optimization model is established to determine the weights, and then to aggregate the given uncertain linguistic decision information, respectively. A method based on possibility degree is given to rank the alternatives. Finally, an illustrative example is also given. (C) 2008 Elsevier B.V. All rights reserved.", "paper_title": "A method for multiple attribute decision making with incomplete weight information under uncertain linguistic environment", "paper_id": "WOS:000261736300011"}