{"auto_keywords": [{"score": 0.03999449666921275, "phrase": "speech_signal"}, {"score": 0.01552915658292207, "phrase": "fundamental_frequency"}, {"score": 0.009557218360466385, "phrase": "dissonant_intervals"}, {"score": 0.008713768692145006, "phrase": "acute_hypoxia"}, {"score": 0.008028481318978003, "phrase": "sea_level"}, {"score": 0.006984040400339628, "phrase": "acute_hypoxia_effects"}, {"score": 0.004564401713056939, "phrase": "small_altitudes"}, {"score": 0.0033388871136347704, "phrase": "test_group"}, {"score": 0.003257432325797907, "phrase": "different_altitudes"}, {"score": 0.0031910685060552485, "phrase": "speech_signal_database"}, {"score": 0.0030623570435946977, "phrase": "original_algorithm"}, {"score": 0.0028086649378423357, "phrase": "acute_hypoxia_effect"}, {"score": 0.0027741761880779535, "phrase": "energy_distribution"}, {"score": 0.002607965563121546, "phrase": "comparative_analysis"}, {"score": 0.0021049977753042253, "phrase": "catastrophic_consequences"}], "paper_keywords": ["speech analysis", " speech processing", " fundamental frequency", " dissonant frequency", " acute hypoxia"], "paper_abstract": "When people that live at the small altitudes (up to 400 m above the sea level) climb on the mountain, they are exposed to the effects of an acute hypoxia. As a consequence, theirs oxygen concentration decreases in the tissue. This paper presents the analysis of the acute hypoxia effects to the speech signal at the altitudes up to 2600 m above the sea level. For the experiment, the articulation of vowels (A, E, I, O, U) from the test group of persons was recorded at different altitudes, which creates the speech signal database. The speech signal from database is processed by the original algorithm. As the results, the fundamental frequency and the energy of dissonant intervals of speech signal are obtained. Furthermore, the acute hypoxia effect to the energy distribution in the dissonant intervals of the speech signal is analyzed. At the end, the comparative analysis of the acute hypoxia effects shows that the level of the hypoxia can be determined by the change of the fundamental frequency and the energy of the dissonant intervals of speech signal. Hence, it is possible to bring conclusions about the degree of hypoxia, which in many situations can be of importance for avoiding catastrophic consequences.", "paper_title": "The Effects of the Acute Hypoxia to the Fundamental Frequency of the Speech Signal", "paper_id": "WOS:000305608000010"}