{"auto_keywords": [{"score": 0.03700385809508468, "phrase": "interval-valued_decision_system"}, {"score": 0.012604727810295204, "phrase": "possible_rules"}, {"score": 0.010233267899119278, "phrase": "interval-valued_granular_rules"}, {"score": 0.00481495049065317, "phrase": "interval-valued_decision_systems"}, {"score": 0.004548939310612501, "phrase": "decision_systems"}, {"score": 0.004354315061804687, "phrase": "real-world_decision_system"}, {"score": 0.003818807671883534, "phrase": "high_confidence"}, {"score": 0.0033489371483830153, "phrase": "pre-specified_threshold"}, {"score": 0.0032336801561165113, "phrase": "binary_relation"}, {"score": 0.003191485583025302, "phrase": "interval-valued_information_system"}, {"score": 0.0028731024405707277, "phrase": "interval-valued_granular_rule"}, {"score": 0.0026091594819333654, "phrase": "implication_relationship"}, {"score": 0.0025750928944698673, "phrase": "confidence-preserved_attribute_reduction_approach"}, {"score": 0.0025192983141887285, "phrase": "compact_decision_rules"}, {"score": 0.0024864020775253767, "phrase": "combinatorial_optimization-based_algorithm"}, {"score": 0.0023487324083283205, "phrase": "numerical_experiments"}, {"score": 0.0022579036318895753, "phrase": "reduction_approach"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Interval-valued decision system", " Rule acquisition", " Attribute reduction", " Combinatorial optimization", " Optimal rule"], "paper_abstract": "Rule acquisition is one of the most important objectives in the analysis of decision systems. Because of the interference of errors, a real-world decision system is generally inconsistent, which can lead to the consequence that some rules extracted from the system are not certain but possible rules. In practice, however, the possible rules with high confidence are also useful in making decision. With this consideration, we study how to extract from an interval-valued decision system the compact decision rules whose confidences are not less than a pre-specified threshold. Specifically, by properly defining a binary relation on an interval-valued information system, the concept of interval-valued granular rules is presented for the interval-valued decision system. Then, an index is introduced to measure the confidence of an interval-valued granular rule and an implication relationship is defined between the interval-valued granular rules whose confidences are not less than the threshold. Based on the implication relationship, a confidence-preserved attribute reduction approach is proposed to extract compact decision rules and a combinatorial optimization-based algorithm is developed to compute all the reducts of an interval-valued decision system. Finally, some numerical experiments are conducted to evaluate the performance of the reduction approach and the gain of using the possible rules in making decision. (C) 2014 Elsevier Inc. All rights reserved.", "paper_title": "Multi-confidence rule acquisition and confidence-preserved attribute reduction in interval-valued decision systems", "paper_id": "WOS:000340992800009"}