{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "support_vector_machines"}, {"score": 0.015396482543331239, "phrase": "new_hybrid_algorithms"}, {"score": 0.014872239374032726, "phrase": "selected_contexts"}, {"score": 0.013827900489219959, "phrase": "classification_problems"}, {"score": 0.011868679013930355, "phrase": "standard_svms"}, {"score": 0.010326999481311163, "phrase": "proposed_algorithms"}, {"score": 0.010255346368944273, "phrase": "better_performance"}, {"score": 0.0045208777171271254, "phrase": "binary_classification_problems"}, {"score": 0.004200319352919505, "phrase": "boosting_algorithms"}, {"score": 0.004112961231504503, "phrase": "different_weak_hypotheses"}, {"score": 0.0040133278382101885, "phrase": "single_strong_hypothesis"}, {"score": 0.0038212380982497653, "phrase": "adaboost"}, {"score": 0.003768028741967194, "phrase": "sequential_minimal_optimization"}, {"score": 0.0035006643351909246, "phrase": "different_degrees"}, {"score": 0.0033800778203837726, "phrase": "simple_black-box_integration"}, {"score": 0.0029688173975648173, "phrase": "specific_properties"}, {"score": 0.002729133029776093, "phrase": "new_strategies"}, {"score": 0.0024999636244840647, "phrase": "practical_implications"}, {"score": 0.002473786357109046, "phrase": "hybrid_algorithms"}, {"score": 0.002281971169774711, "phrase": "better_results"}, {"score": 0.0021049977753042253, "phrase": "hybrid_solutions"}], "paper_keywords": ["Optimization techniques", " Cybernetics", " Programming and algorithm theory"], "paper_abstract": "Purpose - To create new hybrid algorithms that combine boosting and support vector machines to outperform other known algorithms in selected contexts of binary classification problems. Design/methodology/approach - Support vector machines (SVM) are known in the literature to be one of the most efficient teaming models for tackling classification problems. Boosting algorithms rely on other classification algorithms to produce different weak hypotheses which are later combined into a single strong hypothesis. In this work the authors combine boosting with support vector machines, namely the AdaBoost.M1 and sequential minimal optimization (SMO) algorithms, to create new hybrid algorithms that outperform standard SVMs in selected contexts. This is achieved by integration with different degrees of coupling, where the four algorithms proposed range from simple black-box integration to modifications and mergers between AdaBoost.M1 and SMO components. Findings - The results show that the proposed algorithms exhibited better performance for most problems experimented. It is possible to identify trends of behavior bound to specific properties of the problems solved, where one may hence apply the proposed algorithms in situations where it is known to succeed. Research limitations/implications - New strategies for combining boosting and SVMs may be further developed using the principles introduced in this paper, possibly resulting in other algorithms with yet superior performance. Practical implications - The hybrid algorithms proposed in this paper may be used in classification problems with properties that they are known to handle well, thus possibly offering better results than other known algorithms in the literature. Originality/value - This paper introduces the concept of merging boosting and SVM training algorithms to obtain hybrid solutions with better performance than standard SVMs.", "paper_title": "Hybrid classification algorithms based on boosting and support vector machines", "paper_id": "WOS:000261315700036"}