{"auto_keywords": [{"score": 0.043238128269621076, "phrase": "crowdsourcing_contest"}, {"score": 0.02081934849338004, "phrase": "participation_effort"}, {"score": 0.012481903583081827, "phrase": "task_granularity"}, {"score": 0.008567159006990791, "phrase": "self-determination_theory"}, {"score": 0.006309904833718378, "phrase": "perceived_motivational_affordances"}, {"score": 0.005828326985097614, "phrase": "different_roles"}, {"score": 0.00481495049065317, "phrase": "intrinsic_motivation"}, {"score": 0.004760580729109124, "phrase": "crowdsourcing_contest_a_perspective"}, {"score": 0.004706821999798591, "phrase": "purpose_-_the_rapid_development"}, {"score": 0.004640472497133447, "phrase": "social_media"}, {"score": 0.004497762477097628, "phrase": "typical_case"}, {"score": 0.0043718214024256056, "phrase": "business_solution"}, {"score": 0.004285757761346838, "phrase": "participant's_perspective"}, {"score": 0.0039244530915794025, "phrase": "synthesises_various_motivation_factors"}, {"score": 0.0038362452557685134, "phrase": "motivational_affordances"}, {"score": 0.003750012556296276, "phrase": "moderate_constructs"}, {"score": 0.0036657110980445416, "phrase": "conceptual_model"}, {"score": 0.00343371736655812, "phrase": "empirical_study"}, {"score": 0.0033756423456002766, "phrase": "research_model"}, {"score": 0.0033374705499418377, "phrase": "chinese_participants"}, {"score": 0.0030471860613367732, "phrase": "external_motivation"}, {"score": 0.0029449414017272656, "phrase": "participant's_perceived_motivational_affordances"}, {"score": 0.002886885861509621, "phrase": "individual's_motivation"}, {"score": 0.0028623555849897632, "phrase": "internal_focus"}, {"score": 0.0026810674110409596, "phrase": "conceptual_and_theoretical_implications"}, {"score": 0.0025984583297259008, "phrase": "previous_studies"}, {"score": 0.002583713580625699, "phrase": "crowdsourcing_projects"}, {"score": 0.002532761069408219, "phrase": "motivation_spectrum"}, {"score": 0.0024062957362867453, "phrase": "motivation_literatures"}, {"score": 0.002221978799937664, "phrase": "crowdsourcing_participation_research"}, {"score": 0.0021049977753042253, "phrase": "practical_implications"}], "paper_keywords": ["Self-determination theory", " Crowdsourcing contest", " Moderating effects", " Motivation theory", " Motivational affordances", " Task granularity"], "paper_abstract": "Purpose - The rapid development of Web 2.0 and social media enables the rise of crowdsourcing. Crowdsourcing contest is a typical case of crowdsourcing and has been adopted by many organisations for business solution and decision making. From a participant's perspective, it is interesting to explore what motivates people to participate in crowdsourcing contest. The purpose of this paper is to investigate the category of motivation based on self-determination theory and synthesises various motivation factors in crowdsourcing contest. Meanwhile, perceived motivational affordances and task granularity are also examined as the moderate constructs. Design/methodology/approach - The paper builds a conceptual model to illustrate the relationships between various motivations (extrinsic and intrinsic) and participation effort under the moderating of perceived motivational affordances and task granularity. An empirical study is conducted to test the research model by surveying the Chinese participants of crowdsourcing contest. Findings - The results show that various motivations might play different roles in relating to participation effort expended in the crowdsourcing contest. Moreover, task granularity may positively moderate the relationship between external motivation and participation effort. The results also show that supporting of a participant's perceived motivational affordances might strengthen the relationship between the individual's motivation with an internal focus (intrinsic, integrated, identified and introjected motivation) and participation effort. Originality/value - Overall, the research has some conceptual and theoretical implications to the literature. This study synthesises various motivation factors identified by previous studies in crowdsourcing projects or communities as a form of motivation spectrum, namely external, introjected, identified, integrated and intrinsic motivation, which contributes to the motivation literatures. Meanwhile, the findings indicate that various motivations might play different roles in relating to participation effort expended in the crowdsourcing contest. Also, the study theoretically extends the crowdsourcing participation research to incorporate the effects of perceived motivational affordances in crowdsourcing contest. In addition, the study may yield some practical implications for sponsors, managers and designers in crowdsourcing contest.", "paper_title": "Effects of extrinsic and intrinsic motivation on participation in crowdsourcing contest A perspective of self-determination theory", "paper_id": "WOS:000348443200004"}