{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "imprecise-probabilistic_setting"}, {"score": 0.004673709383305897, "phrase": "conditioning_event"}, {"score": 0.0046390482426405324, "phrase": "lower_probability"}, {"score": 0.0039674831861175935, "phrase": "imprecise_belief_model"}, {"score": 0.003696390664266446, "phrase": "often_little_argumentation"}, {"score": 0.0034309482755326016, "phrase": "firm_foundational_justification"}, {"score": 0.003367611042980526, "phrase": "natural_and_regular_extension"}, {"score": 0.002933756577145939, "phrase": "unnecessary_strong_assumptions"}, {"score": 0.002784540221128404, "phrase": "lower_and_upper_probabilities"}, {"score": 0.0027331033178323145, "phrase": "'true'_probability_mass_function"}, {"score": 0.0026428931714865115, "phrase": "bayes's_rule"}, {"score": 0.002603758927691463, "phrase": "subject's_lower_probability"}, {"score": 0.002508433454626386, "phrase": "supremum_betting_rate"}, {"score": 0.0023719332915829268, "phrase": "infimum_betting_rate"}, {"score": 0.0022013916728990564, "phrase": "fair_betting_rate"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Conditioning", " Updating", " Probability zero", " Regular extension", " Natural extension", " Sets of desirable gambles"], "paper_abstract": "We discuss the issue of conditioning on events with probability zero within an imprecise-probabilistic setting, where it may happen that the conditioning event has lower probability zero, but positive upper probability. In this situation, two different conditioning rules are commonly used: regular extension and natural extension. We explain the difference between them and discuss various technical and computational aspects. Both conditioning rules are often used to update an imprecise belief model after receiving the information that some event 0 has occurred, simply by conditioning on 0, but often little argumentation is given as to why such an approach would make sense. We help to address this problem by providing a firm foundational justification for the use of natural and regular extension as updating rules. Our results are presented in three different, closely related frameworks: sets of desirable gambles, lower previsions, and sets of probabilities. What makes our justification especially powerful is that it avoids making some of the unnecessary strong assumptions that are traditionally adopted. For example, we do not assume that lower and upper probabilities provide bounds on some 'true' probability mass function, on which we can then simply apply Bayes's rule. Instead a subject's lower probability for an event 0 is taken to be the supremum betting rate at which he is willing to bet on 0, and his upper probability is the infimum betting rate at which he is willing to take bets on 0; we do not assume the existence of a fair betting rate that lies in between these bounds. (C) 2015 Elsevier Inc. All rights reserved.", "paper_title": "Conditioning, updating and lower probability zero", "paper_id": "WOS:000364725300001"}