{"auto_keywords": [{"score": 0.049304844788052804, "phrase": "nato_problem-approach_space"}, {"score": 0.00481495049065317, "phrase": "command_team_structures"}, {"score": 0.004318881178805575, "phrase": "optimal_performance"}, {"score": 0.004272164161788242, "phrase": "different_team_structures"}, {"score": 0.004112582094962078, "phrase": "five_team_communication_structures"}, {"score": 0.00295078850927459, "phrase": "all-connected_team_structure"}, {"score": 0.002719325177422626, "phrase": "highest_levels"}, {"score": 0.002412204754253618, "phrase": "simplified_form"}, {"score": 0.002386062690026682, "phrase": "typical_military_command_structures"}, {"score": 0.0023219374444738723, "phrase": "subordinate_units"}, {"score": 0.0021049977753042253, "phrase": "classic_command"}], "paper_keywords": ["NATO Problem Space", " team structures"], "paper_abstract": "The purpose of this study was to investigate whether the NATO Problem-Approach Space could be mapped to optimal performance of different team structures. The results show that the five team communication structures (chain, Y, circle, wheel, and all-connected) did not generally perform as predicted based on findings in the literature. The team structures all performed most optimally in the same Problem Space conditions: static rate of change, strong information position, and familiarity with the task. Moreover, contrary to predictions, the all-connected team structure did not perform particularly well at all. Instead, the Y team structure produced the highest levels of performance and was, therefore, judged to be the most successful team structure overall. The Y team structure can be seen as a simplified form of typical military command structures including staff officers and subordinate units. Therefore, the findings of the study serve as a reinforcement of the effectiveness of the classic command and control structure.", "paper_title": "Investigating Performance of Command Team Structures in the NATO Problem-Approach Space", "paper_id": "WOS:000366893700005"}