{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "big_data"}, {"score": 0.004769958800452922, "phrase": "bigger_dilemmas"}, {"score": 0.0046593017130868, "phrase": "recent_interest"}, {"score": 0.004529881123652277, "phrase": "broad_range"}, {"score": 0.004085221464783815, "phrase": "common_set"}, {"score": 0.003771631577951067, "phrase": "particular_disciplinary_perspective"}, {"score": 0.003649585593445665, "phrase": "domain-specific_issue"}, {"score": 0.003598492288058048, "phrase": "close_examination"}, {"score": 0.0034657012607680173, "phrase": "common_problematics"}, {"score": 0.003353521531649663, "phrase": "different_places"}, {"score": 0.0032145922365231093, "phrase": "critical_synthesis"}, {"score": 0.0031695693589575916, "phrase": "conceptual_and_practical_dilemmas"}, {"score": 0.0029260602766930065, "phrase": "relevant_writings"}, {"score": 0.0027916287357898544, "phrase": "trade_literature"}, {"score": 0.002726740692380339, "phrase": "diverse_literatures"}, {"score": 0.0026014425686078993, "phrase": "common_underlying_issues"}, {"score": 0.0024014759148123736, "phrase": "larger_socioeconomic_developments"}, {"score": 0.0023127544795063263, "phrase": "broader_understanding"}], "paper_keywords": [""], "paper_abstract": "The recent interest in Big Data has generated a broad range of new academic, corporate, and policy practices along with an evolving debate among its proponents, detractors, and skeptics. While the practices draw on a common set of tools, techniques, and technologies, most contributions to the debate come either from a particular disciplinary perspective or with a focus on a domain-specific issue. A close examination of these contributions reveals a set of common problematics that arise in various guises and in different places. It also demonstrates the need for a critical synthesis of the conceptual and practical dilemmas surrounding Big Data. The purpose of this article is to provide such a synthesis by drawing on relevant writings in the sciences, humanities, policy, and trade literature. In bringing these diverse literatures together, we aim to shed light on the common underlying issues that concern and affect all of these areas. By contextualizing the phenomenon of Big Data within larger socioeconomic developments, we also seek to provide a broader understanding of its drivers, barriers, and challenges. This approach allows us to identify attributes of Big Data that require more attention-autonomy, opacity, generativity, disparity, and futurity-leading to questions and ideas for moving beyond dilemmas.", "paper_title": "Big Data, Bigger Dilemmas: A Critical Review", "paper_id": "WOS:000357817600001"}