{"auto_keywords": [{"score": 0.03978801929617648, "phrase": "cellular_automata"}, {"score": 0.015719716506582538, "phrase": "local_social_migrations"}, {"score": 0.01073402780399372, "phrase": "new_configuration"}, {"score": 0.004549242970806199, "phrase": "better_local_social_environment"}, {"score": 0.0044922081848067135, "phrase": "social_migrations_processes"}, {"score": 0.004298134888203576, "phrase": "social_agents"}, {"score": 0.0036476222647061243, "phrase": "natural_approach"}, {"score": 0.00355665081072721, "phrase": "social_migrations"}, {"score": 0.0028692628457408025, "phrase": "cellular_automata_rules"}, {"score": 0.002780025943393764, "phrase": "initial_empirical_distribution"}, {"score": 0.0021589195238286233, "phrase": "sufficient_condition"}, {"score": 0.0021049977753042253, "phrase": "invariance_property"}], "paper_keywords": ["social migrations", " cellular automata"], "paper_abstract": "In local social migrations, agents move from their initial location looking for a better local social environment. Social migrations processes do not change the number of social agents of a given type (i.e., the empirical distribution of the population) but their spatial location. Although cellular automata seems to appear as a natural approach to model of social migrations, the evolution of the configuration through a cellular automata might induce a new configuration wherein the number of agents of each type might be actually modified. This article provides a characterization of these cellular automata rules such that for any initial empirical distribution, the evolution of the configuration through a cellular automata of such class induces a new configuration with the same empirical distribution as the initial one, as required to model local social migrations. A class of sequences is defined in order to establish a sufficient condition to maintain this invariance property.", "paper_title": "Modeling Local Social Migrations: A Cellular Automata Approach", "paper_id": "WOS:000352350900009"}