{"auto_keywords": [{"score": 0.04677598271843611, "phrase": "mas"}, {"score": 0.006409559949698292, "phrase": "situated_mass"}, {"score": 0.005924162208018354, "phrase": "three-layer_model"}, {"score": 0.00481495049065317, "phrase": "situated_multi-agent_systems"}, {"score": 0.004747396635982458, "phrase": "physical_infrastructure"}, {"score": 0.004517137548648729, "phrase": "multi-agent_system"}, {"score": 0.004269630481719451, "phrase": "logical_entity"}, {"score": 0.003886770770835211, "phrase": "software_infrastructure"}, {"score": 0.003673675864705682, "phrase": "underlying_hardware_infrastructure"}, {"score": 0.0034203874753429113, "phrase": "explicit_position"}, {"score": 0.003113441660343867, "phrase": "first-order_abstractions"}, {"score": 0.0027916287357898544, "phrase": "top_layer"}, {"score": 0.002719055901632759, "phrase": "mas_application_logic"}, {"score": 0.002688532127821979, "phrase": "middle_layer"}, {"score": 0.0026583500966092044, "phrase": "software_execution_platform"}, {"score": 0.002569816610348772, "phrase": "bottom_layer"}, {"score": 0.0023924536215777933, "phrase": "mas."}, {"score": 0.0023566987138026285, "phrase": "different_classes"}, {"score": 0.0023127544795063263, "phrase": "research_community"}], "paper_keywords": [""], "paper_abstract": "There is a lot of confusion on what the environment of a multi-agent system (MAS) comprises. Sometimes, researchers refer to the environment as the logical entity of a MAS in which the agents and other resources are embedded. Sometimes, the notion of environment is used to refer to the software infrastructure on which the MAS is executed. Sometimes, environment even refers to the underlying hardware infrastructure on which the MAS runs. Our research focuses on situated MASs, i.e. MASs in which agents have an explicit position in the environment. In this paper, we propose a three-layer model for situated MASs that considers agents as well as the environment as first-order abstractions. The aim of this model is to clarify the confusion between the concept of the environment and the infrastructure on which the MAS is deployed. The top layer of the model consists of the MAS application logic, the middle layer contains the software execution platform, and the physical infrastructure is located in the bottom layer. Starting from this model, we propose a classification of situated MASs based on the physical infrastructure of the MAS. We illustrate the different classes with examples from the research community and our own practice. We apply the three-layer model to each example. The models show that agents and the environment are abstractions that crosscut the three layers of the model.", "paper_title": "Environments for situated multi-agent systems: Beyond infrastructure", "paper_id": "WOS:000237040700001"}