{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "normal_and_extreme_value_distributions"}, {"score": 0.020993778677050608, "phrase": "significant_factors"}, {"score": 0.008365112066833241, "phrase": "practical_applications"}, {"score": 0.006279543948370655, "phrase": "screening_experiment"}, {"score": 0.00539862804426962, "phrase": "numerical_results"}, {"score": 0.00462919213721188, "phrase": "useful_techniques"}, {"score": 0.004437115547184535, "phrase": "main_work"}, {"score": 0.004291781840734823, "phrase": "product_reliability"}, {"score": 0.004064117897000019, "phrase": "reliability_improvement"}, {"score": 0.00400304045240329, "phrase": "basic_assumptions"}, {"score": 0.0038252396052150354, "phrase": "normal_distribution"}, {"score": 0.0035141291835319682, "phrase": "significant_difference"}, {"score": 0.0034195866335851935, "phrase": "moderate_departures"}, {"score": 0.0033376791052242907, "phrase": "fixed_effects_analysis"}, {"score": 0.003287495922362749, "phrase": "montgomery"}, {"score": 0.0031223774204093713, "phrase": "new_york"}, {"score": 0.0030661003993462665, "phrase": "main_purpose"}, {"score": 0.00303834224800506, "phrase": "present_paper"}, {"score": 0.0027490536097875685, "phrase": "correct_and_incorrect_selections"}, {"score": 0.0024797072773840704, "phrase": "proposed_method"}, {"score": 0.0023622296334998324, "phrase": "selection_precision"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Mis-specification", " Normal distribution", " Extreme value distribution", " Screening experiment"], "paper_abstract": "Design of experiments (DOEs) are useful techniques for improving the reliability (or quality) of a product. The main work of a DOE is to select significant factors that affect the product reliability (or quality). Then the significant factors can be set at the levels which lead to reliability improvement. One of the basic assumptions of DOEs is that the (logged) observations at each run follow a normal distribution. In practical applications, normal and extreme value distributions are much alike. They may fit the data at hand well in practical applications. However, their predictions may lead to a significant difference. A well-known assertion: \"moderate departures from normality are of little concern in the fixed effects analysis of variance\" [Montgomery. D. C. (1997). Design & analysis of expremients (4th ed.). New York: Wiley]. The main purpose of the present paper is to evaluate the assertion by investigating the impact of mis-specification between normal and extreme value distributions on the precision of selecting significant factors for a screening experiment. For each of these two distributions, the probabilities of correct and incorrect selections under correct specification and mis-specification are computed. The results indicate that for both of normal and extreme value distributions, the selection precision is significantly influenced by mis-specification. An example is used to illustrate the proposed method. Finally, some numerical results are provided to evaluate the impacts of mis-specification on the selection precision for the screening experiment. Th numerical results indicate that for both of normal and extreme value distributions, the smaller the main effect and the sample size, the more the impact of mis-specification is. Surprisingly, this seems to violate the assertion stated above. (C) 2008 Elsevier Ltd. All rights reserved.", "paper_title": "Mis-specification analysis between normal and extreme value distributions for a screening experiment", "paper_id": "WOS:000266754900053"}