{"auto_keywords": [{"score": 0.03483220185213116, "phrase": "multi-view_learning"}, {"score": 0.00481495049065317, "phrase": "significant_challenge"}, {"score": 0.004750527930368202, "phrase": "learning_techniques"}, {"score": 0.0046659637258752535, "phrase": "general_purpose_use"}, {"score": 0.004023120753104693, "phrase": "complex_learning_problems"}, {"score": 0.0033914308417007316, "phrase": "namely_semi-supervised_dimension_reduction"}, {"score": 0.003141830113006653, "phrase": "dimension_reduction"}, {"score": 0.003071965703296204, "phrase": "semi-supervised_setting"}, {"score": 0.0030307927228223883, "phrase": "proposed_framework"}, {"score": 0.00295008998986066, "phrase": "multi-label_and_multi-view_learning_settings"}, {"score": 0.002624423288947767, "phrase": "data_structure"}, {"score": 0.00249767641333441, "phrase": "fundamental_questions"}, {"score": 0.002366361492754389, "phrase": "general_measure"}, {"score": 0.0023033100935570755, "phrase": "simultaneous_learning"}, {"score": 0.002282667669149476, "phrase": "multiple_labels"}], "paper_keywords": ["Semi-supervised learning", " multi-label learning", " multi-view learning", " dimension reduction", " reconstruction error"], "paper_abstract": "A significant challenge to make learning techniques more suitable for general purpose use is to move beyond i) complete supervision, ii) low dimensional data, iii) a single label and single view per instance. Solving these challenges allows working with complex learning problems that are typically high dimensional with multiple (but possibly incomplete) labelings and views. While other work has addressed each of these problems separately, in this paper we show how to address them together, namely semi-supervised dimension reduction for multi-label and multi-view learning (SSDR-MML), which performs optimization for dimension reduction and label inference in semi-supervised setting. The proposed framework is designed to handle both multi-label and multi-view learning settings, and can be easily extended to many useful applications. Our formulation has a number of advantages. We explicitly model the information combining mechanism as a data structure (a weight/nearest-neighbor matrix) which allows investigating fundamental questions in multi-label and multi-view learning. We address one such question by presenting a general measure to quantify the success of simultaneous learning of multiple labels or views. We empirically demonstrate the usefulness of our SSDR-MML approach, and show that it can outperform many state-of-the-art baseline methods.", "paper_title": "A Reconstruction Error Based Framework for Multi-Label and Multi-View Learning", "paper_id": "WOS:000349621800001"}