{"auto_keywords": [{"score": 0.04042594686885475, "phrase": "volume_data"}, {"score": 0.0045052562941109734, "phrase": "virtual_reality_environment"}, {"score": 0.004077508669922702, "phrase": "immersive_visualization"}, {"score": 0.0037432199549135826, "phrase": "interactive_querying_and_data_exploration"}, {"score": 0.0035525230119401153, "phrase": "wim_metaphor"}, {"score": 0.0034690732089830045, "phrase": "large-scale_detailed_data_visualization"}, {"score": 0.003307988966112615, "phrase": "horizontal_slices"}, {"score": 0.0031393948330209224, "phrase": "table_surface"}, {"score": 0.0029511579080222137, "phrase": "data_context"}, {"score": 0.0027741761880779535, "phrase": "effective_navigation"}, {"score": 0.0027479040199262393, "phrase": "complex_geometries"}, {"score": 0.002683304054823427, "phrase": "core_slice_wim_technique_support"}, {"score": 0.0026077803487003, "phrase": "multiple_slices"}, {"score": 0.0022824314760583834, "phrase": "interactive_slices"}, {"score": 0.0021557052355026048, "phrase": "design_decisions"}, {"score": 0.0021049977753042253, "phrase": "user_feedback"}], "paper_keywords": ["World in miniature", " virtual reality", " multitouch", " overview plus detail", " volume visualization", " 3D user interface"], "paper_abstract": "We present Interactive Slice World-in-Miniature (WIM), a framework for navigating and interrogating volumetric data sets using an interface enabled by a virtual reality environment made of two display surfaces: an interactive multitouch table, and a stereoscopic display wall. The framework addresses two current challenges in immersive visualization: 1) providing an appropriate overview+detail style of visualization while navigating through volume data, and 2) supporting interactive querying and data exploration, i.e., interrogating volume data. The approach extends the WIM metaphor, simultaneously displaying a large-scale detailed data visualization and an interactive miniature. Leveraging the table+wall hardware, horizontal slices are projected (like a shadow) down onto the table surface, providing a useful 2D data overview to complement the 3D views as well as a data context for interpreting 2D multitouch gestures made on the table. In addition to enabling effective navigation through complex geometries, extensions to the core Slice WIM technique support interacting with a set of multiple slices that persist on the table even as the user navigates around a scene and annotating and measuring data via points, paths, and volumes specified using interactive slices. Applications of the interface to two volume data sets are presented, and design decisions, limitations, and user feedback are discussed.", "paper_title": "Interactive Slice WIM: Navigating and Interrogating Volume Data Sets Using a Multisurface, Multitouch VR Interface", "paper_id": "WOS:000307298800004"}