{"auto_keywords": [{"score": 0.04486119963572042, "phrase": "interval_grey_linguistic_variables"}, {"score": 0.00481495049065317, "phrase": "induced_correlated_interval_grey_linguistic_variables"}, {"score": 0.004645057834614705, "phrase": "multiple_attribute_decision_making"}, {"score": 0.004354149483556514, "phrase": "multiple_attribute_decision_making_problems"}, {"score": 0.003798231095121328, "phrase": "new_induced_aggregation_operators"}, {"score": 0.0036905361960663375, "phrase": "choquet"}, {"score": 0.0034841647157189985, "phrase": "induced_interval_grey_linguistic_correlated_averaging"}, {"score": 0.00326572165784246, "phrase": "induced_interval"}, {"score": 0.0025021765811679446, "phrase": "multiple_attribute_decision"}, {"score": 0.0023451553255837317, "phrase": "illustrative_example"}, {"score": 0.002245975340642921, "phrase": "highway_roadbeds"}, {"score": 0.0021049977753042253, "phrase": "developed_approach"}], "paper_keywords": ["Multiple attribute decision making", " interval grey linguistic variables", " induced interval grey linguistic correlated averaging (I-IGLCA) operator", " the induced interval grey linguistic correlated geometric (I-IGLCG) operator", " stability of highway roadbeds"], "paper_abstract": "In this paper, we investigate the multiple attribute decision making problems with interval grey linguistic variables. We first introduce some operations on the interval grey linguistic variables. Then, we further develop some new induced aggregation operators based on the Choquet integral with interval grey linguistic variables, such as the induced interval grey linguistic correlated averaging (I-IGLCA) operator and the induced interval grey linguistic correlated geometric (I-IGLCG) operator. Then, we apply the induced interval grey linguistic correlated averaging (I-IGLCA) operator and the induced interval grey linguistic correlated geometric (I-IGLCG) operator to deal with multiple attribute decision making with the interval grey linguistic variables. Finally, an illustrative example for evaluating the stability of highway roadbeds with the interval grey linguistic variables is given to verify the developed approach.", "paper_title": "Method for aggregating induced correlated interval grey linguistic variables and their application to multiple attribute decision making", "paper_id": "WOS:000341926700010"}