{"auto_keywords": [{"score": 0.030726481819540286, "phrase": "private_view"}, {"score": 0.030019925790468825, "phrase": "public_view"}, {"score": 0.00481495049065317, "phrase": "interorganizational_processes"}, {"score": 0.0047013405841819025, "phrase": "interorganizational_process"}, {"score": 0.004656647251517823, "phrase": "different_enterprizes"}, {"score": 0.004132411680987228, "phrase": "overall_intended_process"}, {"score": 0.003702206069379459, "phrase": "public_views"}, {"score": 0.0036494864560524735, "phrase": "participating_parties"}, {"score": 0.00305762327908599, "phrase": "formal_notion"}, {"score": 0.0024652715040303416, "phrase": "overall_implemented_process"}, {"score": 0.0021354538918029286, "phrase": "case_study"}], "paper_keywords": ["Petri nets", " service contracts", " operating guidelines"], "paper_abstract": "To implement an interorganizational process between different enterprizes, one needs to agree on the 'rules of engagement'. These can be specified in terms of a contract that describes the overall intended process and the duties of all parties involved. We propose to use such a process-oriented contract which can be seen as the composition of the public views of all participating parties. Based on this contract, each party may locally implement its part of the contract such that the implementation (the private view) agrees on the contract. In this paper, we propose a formal notion for such process-oriented contracts and give a criterion for accordance between a private view and its public view. The public view of a party can be substituted by a private view if and only if the private view accords with the public view. Using the notion of accordance, the overall implemented process is guaranteed to be deadlock-free and it is always possible to terminate properly. In addition, we present a technique for automatically checking our accordance criterion. A case study illustrates how our proposed approach can be used in practice.", "paper_title": "Multiparty Contracts: Agreeing and Implementing Interorganizational Processes", "paper_id": "WOS:000272926900007"}