{"auto_keywords": [{"score": 0.04969652007027205, "phrase": "broadband_access_networks"}, {"score": 0.00481495049065317, "phrase": "correlated_latency_anomalies"}, {"score": 0.004719359108879602, "phrase": "growing_prevalence"}, {"score": 0.004681653551412616, "phrase": "broadband_internet_access"}, {"score": 0.00432070565627091, "phrase": "performance_anomalies"}, {"score": 0.004101088357088207, "phrase": "home_broadband_access_networks"}, {"score": 0.003845994935767022, "phrase": "performance_pathologies"}, {"score": 0.003635790924434452, "phrase": "multiple_destinations"}, {"score": 0.0035067452724203124, "phrase": "preliminary_glimpse"}, {"score": 0.0034647524666821614, "phrase": "sudden_latency_increases"}, {"score": 0.003301733505307784, "phrase": "root_cause"}, {"score": 0.0031337465656628132, "phrase": "latency_increases"}, {"score": 0.0030962064913500164, "phrase": "important_clues"}, {"score": 0.0028229071631385634, "phrase": "network_locations"}, {"score": 0.0026900059414552823, "phrase": "latency_data"}, {"score": 0.0025840347813610815, "phrase": "network_latency_issues"}, {"score": 0.0023463854193479274, "phrase": "single_destination"}, {"score": 0.0023182554418193927, "phrase": "relatively_small_percentage"}, {"score": 0.002244876254113051, "phrase": "last_mile"}, {"score": 0.0021049977753042253, "phrase": "access_link_problems"}], "paper_keywords": ["Measurement", " Performance", " Measurement", " Active probing", " Performance"], "paper_abstract": "The growing prevalence of broadband Internet access around the world has made understanding the performance and reliability of broadband access networks extremely important. To better understand the performance anomalies that arise in broadband access networks, we have deployed hundreds of routers in home broadband access networks around the world and are studying the performance of these networks. One of the performance pathologies that we have observed is correlated, sudden latency increases simultaneously and to multiple destinations. In this work, we provide an preliminary glimpse into these sudden latency increases and attempt to understand their causes. Although we do not isolate root cause in this study, observing the sets of destinations that experience correlated latency increases can provide important clues as to the locations in the network that may be inducing these pathologies. We present an algorithm to better identify the network locations that are likely responsible for these pathologies. We then analyze latency data from one month across our home router deployment to determine where in the network latency issues are arising, and how those pathologies differ across regions, ISPs, and countries. Our preliminary analysis suggests that most latency pathologies are to a single destination and a relatively small percentage of these pathologies are likely in the last mile, suggesting that peering within the network may be a more likely culprit for these pathologies than access link problems.", "paper_title": "Characterizing Correlated Latency Anomalies in Broadband Access Networks", "paper_id": "WOS:000327465900079"}