{"auto_keywords": [{"score": 0.0044688500725247726, "phrase": "theoretical_study"}, {"score": 0.004342430078306461, "phrase": "dissociation_pathways"}, {"score": 0.0038492126993451337, "phrase": "activation_energies"}, {"score": 0.0038052556098065694, "phrase": "reaction_enthalpies"}, {"score": 0.0037402558657576124, "phrase": "gibbs_free_energy"}, {"score": 0.00307657476125683, "phrase": "grotthuss_mechanism"}, {"score": 0.002938317647182056, "phrase": "five_potential_pathways"}, {"score": 0.00290473242917264, "phrase": "o-h_bond_breaking"}, {"score": 0.002680114113899346, "phrase": "hydrogen_atom"}, {"score": 0.0026342827320931937, "phrase": "al_cluster"}, {"score": 0.0025892330566358503, "phrase": "eley-rideal_mechanism"}, {"score": 0.002544951823639408, "phrase": "lower_activation_barrier"}, {"score": 0.0021049977753042253, "phrase": "varying_degrees"}], "paper_keywords": ["Al-13 cluster", " Water dissociation", " Reaction mechanism", " H-2 release", " DFT"], "paper_abstract": "A theoretical study of the chemisorption and dissociation pathways of water on the Al-13 cluster was performed using the hybrid density functional B3LYP method with the 6-311+G(d, p) basis set. The activation energies, reaction enthalpies, and Gibbs free energy of activation for the reaction were determined. Calculations revealed that the H2O molecule is easily adsorbed onto the Al-13 surface, forming adlayers. The dissociation of the first H2O molecule from the bimolecular H2O structure via the Grotthuss mechanism is the most kinetically favorable among the five potential pathways for O-H bond breaking. The elimination of H-2 in the reaction of an H2O molecule with a hydrogen atom on the Al cluster via the Eley-Rideal mechanism has a lower activation barrier than the elimination of H-2 in the reaction of two adsorbed H atoms or the reaction of OH and H. Following the adsorption and dissociation of H2O, the structure of Al-13 is distorted to varying degrees.", "paper_title": "DFT studies of the adsorption and dissociation of H2O on the Al-13 cluster: origins of this reactivity and the mechanism for H-2 release", "paper_id": "WOS:000316677600030"}