{"auto_keywords": [{"score": 0.041864354852283986, "phrase": "proposed_measure"}, {"score": 0.00481495049065317, "phrase": "text_classification"}, {"score": 0.004769210541098667, "phrase": "clustering"}, {"score": 0.004561386908745206, "phrase": "important_operation"}, {"score": 0.004494570360108983, "phrase": "text_processing_field"}, {"score": 0.004342430078306461, "phrase": "new_similarity_measure"}, {"score": 0.003312486229143855, "phrase": "first_case"}, {"score": 0.002914288956035066, "phrase": "second_case"}, {"score": 0.0028715299874549245, "phrase": "fixed_value"}, {"score": 0.0027469703311742647, "phrase": "last_case"}, {"score": 0.0023003498123420237, "phrase": "clustering_problems"}], "paper_keywords": ["Document classification", " document clustering", " entropy", " accuracy", " classifiers", " clustering algorithms"], "paper_abstract": "Measuring the similarity between documents is an important operation in the text processing field. In this paper, a new similarity measure is proposed. To compute the similarity between two documents with respect to a feature, the proposed measure takes the following three cases into account: a) The feature appears in both documents, b) the feature appears in only one document, and c) the feature appears in none of the documents. For the first case, the similarity increases as the difference between the two involved feature values decreases. Furthermore, the contribution of the difference is normally scaled. For the second case, a fixed value is contributed to the similarity. For the last case, the feature has no contribution to the similarity. The proposed measure is extended to gauge the similarity between two sets of documents. The effectiveness of our measure is evaluated on several real-world data sets for text classification and clustering problems. The results show that the performance obtained by the proposed measure is better than that achieved by other measures.", "paper_title": "A Similarity Measure for Text Classification and Clustering", "paper_id": "WOS:000340205700003"}