{"auto_keywords": [{"score": 0.04312582763977989, "phrase": "server's_upload_bandwidth"}, {"score": 0.04239667047686577, "phrase": "upload_and_download_amounts"}, {"score": 0.0258210249767265, "phrase": "pecan"}, {"score": 0.00481495049065317, "phrase": "-peer_video-on-demand_streaming"}, {"score": 0.0043908341845978575, "phrase": "video_segment"}, {"score": 0.004298367681427065, "phrase": "video_server"}, {"score": 0.0035613768414594262, "phrase": "server's_upload_bandwidth_constraint"}, {"score": 0.0033886832371468954, "phrase": "new_cache_replacement_algorithm"}, {"score": 0.0031118336364156516, "phrase": "cache_capacity"}, {"score": 0.0028072256092845417, "phrase": "peer's_cache_capacity"}, {"score": 0.0026900523406547827, "phrase": "proposed_design_objective"}, {"score": 0.00266152927283908, "phrase": "selfish_peers"}, {"score": 0.0025144238077014114, "phrase": "simple_distributed_reputation"}, {"score": 0.002496615320278004, "phrase": "monitoring_system"}, {"score": 0.00240089402509933, "phrase": "server_upload_bandwidth_constraint"}, {"score": 0.002268161377269513, "phrase": "control_overhead"}, {"score": 0.0021811799507898792, "phrase": "monitoring_systems"}, {"score": 0.002120018771276572, "phrase": "important_factor"}, {"score": 0.0021049977753042253, "phrase": "real_deployment"}], "paper_keywords": ["Cache capacity", " peer-to-peer (P2P) networks", " selfish users", " video-on-demand (VoD)"], "paper_abstract": "To meet the increased demand of video-on-demand (VoD) services, peer-to-peer (P2P) mesh-based multiple video approaches have been recently proposed, where each peer is able to find a video segment interested without resort to the video server. However, they have not considered the constraint of the server's upload bandwidth and the fairness between upload and download amounts at each peer. In this paper, we propose a novel P2P VoD streaming system, named peer cache adaptation (PECAN) where each peer adjusts its cache capacity adaptively to meet the server's upload bandwidth constraint and achieve the fairness. For doing so, we first propose a new cache replacement algorithm that designs the number of caches for a segment to be proportional to its popularity. Second, we mathematically prove that if the cache capacity of a peer is proportional to its segment request rate, the fairness between upload and download amounts at each peer can be achieved. Third, we propose a method that determines each peer's cache capacity adaptively according to the constraint of the server's upload bandwidth. Against the proposed design objective, some selfish peers may not follow our protocol to increase their payoff. To detect such peers, we design a simple distributed reputation and monitoring system. Through simulations, we show that PECAN meets the server upload bandwidth constraint, and achieves the fairness well at each peer. We finally verify that the control overhead in PECAN caused by the search, reputation, and monitoring systems is very small, which is an important factor for real deployment.", "paper_title": "PECAN: Peer Cache Adaptation for Peer-to-Peer Video-on-Demand Streaming", "paper_id": "WOS:000306391900010"}