{"auto_keywords": [{"score": 0.04021006324458645, "phrase": "non-unique_probe_selection_problem"}, {"score": 0.00481495049065317, "phrase": "non-unique_oligonucleotide_probe_selection_problem"}, {"score": 0.004573953147933065, "phrase": "gene_expression_levels"}, {"score": 0.00453144352814823, "phrase": "microarray_experiments"}, {"score": 0.004108161406159407, "phrase": "unique_probes"}, {"score": 0.003994624397219346, "phrase": "closely_related_genes"}, {"score": 0.003920674807745575, "phrase": "known_strains"}, {"score": 0.003884212965525665, "phrase": "hiv_genes"}, {"score": 0.0035542408902458677, "phrase": "biological_sample"}, {"score": 0.003472149546470424, "phrase": "minimal_number"}, {"score": 0.0033603864623013733, "phrase": "np-hard_problem"}, {"score": 0.00329813918116714, "phrase": "original_deterministic_greedy_heuristics"}, {"score": 0.0032370412139943808, "phrase": "minimal_non-unique_probe_sets"}, {"score": 0.0031328221096543823, "phrase": "selection_functions"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Microarray", " Probe", " Selection", " Separation", " Coverage", " Heuristic"], "paper_abstract": "In order to accurately measure the gene expression levels in microarray experiments, it is crucial to design unique, highly specific and highly sensitive oligonucleotide probes for the identification of biological agents such as genes in a sample. Unique probes are difficult to obtain for closely related genes such as the known strains of HIV genes. The non-unique probe selection problem is to select a probe set that is able to uniquely identify targets in a biological sample, while containing a minimal number of probes. This is an NP-hard problem. We introduce original deterministic greedy heuristics for finding near minimal non-unique probe sets. The heuristics, guided by selection functions defined over a probe set, decide at each moment which probes are the best to be included in, or excluded from, a candidate solution. Our methods substantially outperform the only two known greedy heuristics in the literature for the non-unique probe selection problem. We also obtained results that are very close to, and sometimes better than, those of the current state-of-the-art methods for the non-unique probe selection problem, namely integer linear programming and optimal cutting-plane approaches. (C) 2010 Elsevier B.V. All rights reserved.", "paper_title": "Selection based heuristics for the non-unique oligonucleotide probe selection problem in microarray design", "paper_id": "WOS:000282384500006"}