{"auto_keywords": [{"score": 0.0330572420915156, "phrase": "mas_layer"}, {"score": 0.015279188017418217, "phrase": "vod"}, {"score": 0.012925996949248826, "phrase": "video_segments"}, {"score": 0.00481495049065317, "phrase": "conscientious_peers"}, {"score": 0.0047804843375940835, "phrase": "combining_agents"}, {"score": 0.00471228691115201, "phrase": "efficient_and_scalable_video_segment_retrieval"}, {"score": 0.00451348697859568, "phrase": "youtube"}, {"score": 0.004322967486451877, "phrase": "multiagent_systems"}, {"score": 0.004292166297590315, "phrase": "mas"}, {"score": 0.0038256426589560774, "phrase": "best_path"}, {"score": 0.0037171648669537287, "phrase": "key_challenge"}, {"score": 0.0034467717443162015, "phrase": "streaming_service"}, {"score": 0.0033490008882413103, "phrase": "innovative_architecture"}, {"score": 0.0032893028281789287, "phrase": "multimedia_information_retrieval"}, {"score": 0.003253994336864267, "phrase": "vod_environment"}, {"score": 0.0023033100935570755, "phrase": "sharing_performance"}, {"score": 0.0022703709180757576, "phrase": "experimental_results"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Multiagent system", " Peer-to-peer", " Video-on-demand"], "paper_abstract": "In the last years, Video-on-Demand (VoD) systems, such as Youtube, have become a very popular way to watch videos. Researches in Multiagent Systems (MAS) and Peer-to-Peer (P2P) for VoD have focused on using agents to assist peers to share video segments efficiently, by replicating them or creating the best path between peers to transfer such segments. A key challenge faced by these systems is to efficiently search and to retrieve which peers own certain segments in order to provide the streaming service. In this paper we propose an innovative architecture that combines MAS and P2P network for multimedia information retrieval in the VoD environment. This architecture, composed of a P2P and a MAS layer, supports streaming and random seeking while providing scalability and efficiency. The P2P layer is responsible for discovering the peers that own the video segments and share these segments among them. Nevertheless, if such search is time consuming, it is forwarded to the MAS layer. The MAS layer is responsible for monitoring groups of peers as well as for discovering agents that manage a group of peers sharing certain video segments that could not be found efficiently by peers. This is made for improving the sharing performance of its monitored peers. Experimental results, using several metrics, showed the viability of adopting our approach if compared with the most used approaches. (C) 2015 Elsevier Ltd. All rights reserved.", "paper_title": "Towards conscientious peers: Combining agents and peers for efficient and scalable video segment retrieval for VoD services", "paper_id": "WOS:000362130500014"}