{"auto_keywords": [{"score": 0.027346758619168035, "phrase": "dmpd"}, {"score": 0.00481495049065317, "phrase": "privacy-preserving_data_mining"}, {"score": 0.004681653551412616, "phrase": "data_mining_goals"}, {"score": 0.004425979295788883, "phrase": "subject-specific_sensitive_data"}, {"score": 0.00426900754050533, "phrase": "data_mining"}, {"score": 0.004134137523409649, "phrase": "released_table"}, {"score": 0.003694652993546994, "phrase": "different_approach"}, {"score": 0.003592258384936271, "phrase": "original_dataset"}, {"score": 0.003022465992278672, "phrase": "unlabelled_instance"}, {"score": 0.002868646843975439, "phrase": "classification_accuracy"}, {"score": 0.0028003107731426322, "phrase": "proposed_data_mining_privacy"}, {"score": 0.0027008385562908425, "phrase": "genetic_algorithm"}, {"score": 0.0026577673946415583, "phrase": "optimal_feature"}, {"score": 0.002615381301695394, "phrase": "ten_separate_datasets"}, {"score": 0.0024036710362692042, "phrase": "existing_k-anonymity-based_algorithms"}, {"score": 0.002327594516681507, "phrase": "domain_dependent_knowledge"}, {"score": 0.002299689297293321, "phrase": "multiobjective_optimization_methods"}, {"score": 0.0022001978071259196, "phrase": "ppdm"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Data mining", " Privacy", " Genetic algorithms", " k-Anonymity", " Feature set partitioning"], "paper_abstract": "In privacy-preserving data mining (PPDM), a widely used method for achieving data mining goals while preserving privacy is based on k-anonymity. This method, which protects subject-specific sensitive data by anonymizing it before it is released for data mining, demands that every tuple in the released table should be indistinguishable from no fewer than k subjects. The most common approach for achieving compliance with k-anonymity is to replace certain values with less specific but semantically consistent values. In this paper we propose a different approach for achieving k-anonymity by partitioning the original dataset into several projections such that each one of them adheres to k-anonymity. Moreover, any attempt to rejoin the projections, results in a table that still complies with k-anonymity. A classifier is trained on each projection and subsequently, an unlabelled instance is classified by combining the classifications of all classifiers. Guided by classification accuracy and k-anonymity constraints, the proposed data mining privacy by decomposition (DMPD) algorithm uses a genetic algorithm to search for optimal feature set partitioning. Ten separate datasets were evaluated with DMPD in order to compare its classification performance with other k-anonymity-based methods. The results suggest that DMPD performs better than existing k-anonymity-based algorithms and there is no necessity for applying domain dependent knowledge. Using multiobjective optimization methods, we also examine the tradeoff between the two conflicting objectives in PPDM: privacy and predictive performance. (C) 2010 Elsevier Inc. All rights reserved.", "paper_title": "Privacy-preserving data mining: A feature set partitioning approach", "paper_id": "WOS:000278629600006"}