{"auto_keywords": [{"score": 0.03528278775652248, "phrase": "technological_complexity"}, {"score": 0.015719716506582538, "phrase": "measurement_invariance"}, {"score": 0.015567537886639652, "phrase": "latent_mean_differences"}, {"score": 0.012260952619390761, "phrase": "seven_variables"}, {"score": 0.003531474887552889, "phrase": "computer_use"}, {"score": 0.0033950634506367235, "phrase": "computer_self-efficacy"}, {"score": 0.0031223774204093713, "phrase": "technology_acceptance"}, {"score": 0.0030314419455512013, "phrase": "service_groups"}, {"score": 0.002928682556953258, "phrase": "scalar_invariance"}, {"score": 0.002680114113899346, "phrase": "significant_differences"}, {"score": 0.0025638362414466278, "phrase": "remaining_five_variables"}, {"score": 0.0022890371899188466, "phrase": "significantly_different_intensities"}, {"score": 0.0021789194955896124, "phrase": "research_possibilities"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Human-computer interface", " Pedagogical issues", " Country-specific developments"], "paper_abstract": "This study examines the factors that explain pre-service and in-service teachers' technology acceptance. A sample of 817 participants (387 pre-service, 430 in-service teachers) gave their responses to a 23-item, self-reported, 7-point scale designed to measure seven variables: perceived usefulness; perceived ease of use; attitude towards computer use; subjective norm; facilitating conditions; computer self-efficacy; and technological complexity. Results of this study showed the seven variables were valid in explaining the technology acceptance of the teachers from both service groups. Tests for measurement invariance revealed that scalar invariance in the data was not supported for facilitating conditions and technological complexity and those for latent mean differences found no significant differences between pre-service and in-service teachers for the remaining five variables. The findings suggest that pre-service and in-service teachers had reacted to the items for measuring facilitating conditions and technological complexity with significantly different intensities. Implications of this study are discussed and future research possibilities proposed. (C) 2014 Elsevier Ltd. All rights reserved.", "paper_title": "Comparing pre-service and in-service teachers' acceptance of technology: Assessment of measurement invariance and latent mean differences", "paper_id": "WOS:000350186400003"}