{"auto_keywords": [{"score": 0.049858375553176175, "phrase": "turkey"}, {"score": 0.008077022425250777, "phrase": "se_practices"}, {"score": 0.007434962526703479, "phrase": "turkish_software_industry"}, {"score": 0.00481495049065317, "phrase": "software_engineering_practices"}, {"score": 0.0047268728636719725, "phrase": "software_engineering"}, {"score": 0.004555499634179394, "phrase": "wide_spectrum"}, {"score": 0.004380188224329844, "phrase": "vibrant_software_industry"}, {"score": 0.004172874316207784, "phrase": "high-level_view"}, {"score": 0.004002972723329302, "phrase": "online_survey"}, {"score": 0.003929689573550262, "phrase": "canadian_and_turkish_contexts"}, {"score": 0.003839962121679795, "phrase": "software_engineers"}, {"score": 0.003726360885768275, "phrase": "important_and_interesting_findings"}, {"score": 0.003541689414992537, "phrase": "improved_training"}, {"score": 0.003358368814209542, "phrase": "capital_ankara_region"}, {"score": 0.0032215231177304513, "phrase": "software_size_measurement_methods"}, {"score": 0.0030336118627011786, "phrase": "development_phase"}, {"score": 0.0029849147334986424, "phrase": "overall_project_effort"}, {"score": 0.002876513834642423, "phrase": "similar_average_values"}, {"score": 0.00274017282519193, "phrase": "requirements_phase"}, {"score": 0.002702415623060517, "phrase": "rather_old_but_still_widely_used_lifecycle_model"}, {"score": 0.0026042472337367015, "phrase": "next_most_preferred_lifecycle_models"}, {"score": 0.002503837900969975, "phrase": "waterfall_and_agile_methodologies"}, {"score": 0.0024865237976623286, "phrase": "negative_correlations"}, {"score": 0.0023198180380964305, "phrase": "se_professionals"}, {"score": 0.0022303506319305394, "phrase": "latest_trends"}, {"score": 0.0022200540112508925, "phrase": "se_industry"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Software engineering", " Industry practices", " Turkey"], "paper_abstract": "Understanding the types of software engineering (SE) practices and techniques used in industry is important. There is a wide spectrum in terms of the types and maturity of SE practices conducted in industry. Turkey has a vibrant software industry and it is important to characterize and understand the state of its SE practices. Our objective is to characterize and grasp a high-level view on type of SE practices in the Turkish software industry. To achieve this objective, we systematically designed an online survey with 46 questions based on our past experience in the Canadian and Turkish contexts and using the Software Engineering Body of Knowledge (SWEBOK). Two hundred and two practicing software engineers from the Turkish software industry participated in the survey. The survey results reveal important and interesting findings about SE practices in Turkey and beyond. They also help track the profession of SE, and suggest areas for improved training, education and research. Among the findings are the followings: (1) The military and defense software sectors are quite prominent in Turkey, especially in the capital Ankara region, and many SE practitioners work for those companies. (2) 54% of the participants reported not using any software size measurement methods, while 33% mentioned that they have measured lines of code (LOC). (3) In terms of effort, after the development phase (on average, 31% of overall project effort), software testing, requirements, design and maintenance phases come next and have similar average values (14%, 12%, 12% and 11% respectively). (4) Respondents experience the most challenge in the requirements phase. (5) Waterfall, as a rather old but still widely used lifecycle model, is the model that more than half of the respondents (53%) use. The next most preferred lifecycle models are incremental and Agile/lean development models with usage rates of 38% and 34%, respectively. (6) The Waterfall and Agile methodologies have slight negative correlations, denoting that if one is used in a company, the other will less likely to be used. The results of our survey will be of interest to SE professionals both in Turkey and world-wide. It will also benefit researchers in observing the latest trends in SE industry identifying the areas of strength and weakness, which would then hopefully encourage further industry-academia collaborations in those areas. (C) 2015 Elsevier Inc. All rights reserved.", "paper_title": "A survey of software engineering practices in Turkey", "paper_id": "WOS:000358969300008"}