{"auto_keywords": [{"score": 0.05007844442530217, "phrase": "cell_phone_ownership"}, {"score": 0.047170124188342995, "phrase": "americans"}, {"score": 0.04336697691622148, "phrase": "mental_illness"}, {"score": 0.033638910952737085, "phrase": "mental_health_patients"}, {"score": 0.02734021554631305, "phrase": "treatment_aid"}, {"score": 0.004735254735115024, "phrase": "mental_health_outpatients"}, {"score": 0.004676345706416371, "phrase": "usa._cell_phone_technology"}, {"score": 0.004466519142879166, "phrase": "early_research"}, {"score": 0.0039571974661570695, "phrase": "human-centered_perspective"}, {"score": 0.003418958653159371, "phrase": "community-based_outpatient_clinics"}, {"score": 0.003092690568543981, "phrase": "nationally_representative_sample"}, {"score": 0.0027974705482714884, "phrase": "downloading_apps"}, {"score": 0.002594652434287807, "phrase": "feasible_form"}, {"score": 0.0024573577356299765, "phrase": "supplementary_treatment"}, {"score": 0.00241658945942583, "phrase": "low_income"}, {"score": 0.002298288831092204, "phrase": "privacy_measures"}, {"score": 0.0022696277881969896, "phrase": "mobile_technology"}, {"score": 0.0021049977753042253, "phrase": "mhealth_treatment_aids"}], "paper_keywords": ["Cell phones", " Mental illness", " Mobile technology", " Health technology", " mHealth"], "paper_abstract": "Cell phone technology is in the hands of millions of Americans, and early research indicates that this technology can be useful to help Americans who are suffering from some form of mental illness. Like with the design of any technology from a human-centered perspective, we aim to determine how to best utilize technology so that it is both easy to use and works for its intended purpose. To accomplish this, we surveyed 325 patients currently receiving treatment at community-based outpatient clinics for mental illness to determine their cell phone ownership and usage patterns. Our results showed that cell phone ownership among these mental health patients was comparable with ownership among a nationally representative sample, with the exception that more patients than non-patients shared their mobile phones. Among mental health patients, we found that texting was the most popular feature used and downloading apps was the least popular. Based on these results, we concluded that texting may be a feasible form of treatment aid for those with mental illness and may be useful as a supplementary treatment for those with low income or little to no access to treatment. Further research should investigate privacy measures for using mobile technology as a treatment aid, especially for those who share a phone, and explore the types of mHealth treatment aids that could be the most effective.", "paper_title": "Cell phone ownership and use among mental health outpatients in the USA", "paper_id": "WOS:000348445900009"}