{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "autonomous_vehicles"}, {"score": 0.04182833290656605, "phrase": "anthropomorphic_cues"}, {"score": 0.04132712815039597, "phrase": "artificial_driving_agent"}, {"score": 0.031397496323593246, "phrase": "human-like_appearance"}, {"score": 0.026897811453592893, "phrase": "social_presence"}, {"score": 0.004579780586951551, "phrase": "unmanned_driving_systems"}, {"score": 0.004374267836149339, "phrase": "human_intervention"}, {"score": 0.004283913685201902, "phrase": "significant_safety"}, {"score": 0.004248294537944227, "phrase": "trust-related_concerns"}, {"score": 0.004108742905942481, "phrase": "psychological_perspective"}, {"score": 0.0037795163893761027, "phrase": "positive_evaluations"}, {"score": 0.003701401653850141, "phrase": "unmanned_driving_system"}, {"score": 0.0036400696415545813, "phrase": "between-subjects_factorial_experiment"}, {"score": 0.003404703106153948, "phrase": "different_levels"}, {"score": 0.002856563331151566, "phrase": "positive_perceptions"}, {"score": 0.0027510752634224726, "phrase": "mediation_analysis"}, {"score": 0.0027054473441439422, "phrase": "greater_level"}, {"score": 0.002447101794397243, "phrase": "perceived_intelligence"}, {"score": 0.0022696277881969896, "phrase": "driving_agent"}], "paper_keywords": [""], "paper_abstract": "Although autonomous vehicles are increasingly becoming a reality, eliminating human intervention from driving may imply significant safety and trust-related concerns. To address this issue from a psychological perspective, this study applies layers of anthropomorphic cues to an artificial driving agent and explicates the process in which these cues promote positive evaluations and perceptions of an unmanned driving system. In a between-subjects factorial experiment (N = 89) consisting of three unmanned driving scenarios, participants interacted with an artificial driving agent with different levels of anthropomorphic cues induced by the variations in appearance (human-like vs. gadget-like) and autonomy (high vs. low) of the agent. The results indicated that human-like appearance and high autonomy were more effective in eliciting positive perceptions of the agent. In addition, a mediation analysis revealed that the greater level of anthropomorphism induced by human-like appearance and high autonomy in the agent evoked the feelings of social presence, which in turn positively affected the perceived intelligence and safety of and trust in the agent, suggesting that the extent to which users perceive the driving agent as intelligent, safe, and trustworthy is largely determined by the feelings of social presence experienced during their interaction.", "paper_title": "Can Autonomous Vehicles Be Safe and Trustworthy? Effects of Appearance and Autonomy of Unmanned Driving Systems", "paper_id": "WOS:000362821900004"}