{"auto_keywords": [{"score": 0.05007851542092211, "phrase": "penn_discourse_treebank"}, {"score": 0.04961324002989209, "phrase": "comparable_corpora"}, {"score": 0.03355922214339964, "phrase": "pdtb"}, {"score": 0.00428179779071721, "phrase": "largest_manually_annotated_corpus"}, {"score": 0.004097389262726735, "phrase": "discourse_relations"}, {"score": 0.003959447096055027, "phrase": "explicit_discourse_connectives"}, {"score": 0.0038827100184187805, "phrase": "sentential_adjacency"}, {"score": 0.0037519679864796906, "phrase": "language_technology"}, {"score": 0.0032237268289353983, "phrase": "comprehensive_introduction"}, {"score": 0.0027969169552385974, "phrase": "previous_results"}, {"score": 0.002729246328390722, "phrase": "decision_procedures"}, {"score": 0.002511147699138714, "phrase": "comparable_resources"}, {"score": 0.002379379676378223, "phrase": "future_comparable_resources"}, {"score": 0.002146676231930343, "phrase": "pdtb_annotation"}, {"score": 0.002125735077004312, "phrase": "complementary_annotation"}], "paper_keywords": [""], "paper_abstract": "The Penn Discourse Treebank (PDTB) was released to the public in 2008. It remains the largest manually annotated corpus of discourse relations to date. Its focus on discourse relations that are either lexically grounded in explicit discourse connectives or associated with sentential adjacency has not only facilitated its use in language technology and psycholinguistics but also has spawned the annotation of comparable corpora in other languages and genres. Given this situation, this paper has four aims: (1) to provide a comprehensive introduction to the PDTB for those who are unfamiliar with it; (2) to correct some wrong (or perhaps inadvertent) assumptions about the PDTB and its annotation that may have weakened previous results or the performance of decision procedures induced from the data; (3) to explain variations seen in the annotation of comparable resources in other languages and genres, which should allow developers of future comparable resources to recognize whether the variations are relevant to them; and (4) to enumerate and explain relationships between PDTB annotation and complementary annotation of other linguistic phenomena. The paper draws on work done by ourselves and others since the corpus was released.", "paper_title": "Reflections on the Penn Discourse TreeBank, Comparable Corpora, and Complementary Annotation", "paper_id": "WOS:000345150100007"}