{"auto_keywords": [{"score": 0.04073552646161375, "phrase": "large_group"}, {"score": 0.00481495049065317, "phrase": "self-organizing_potential_field-based_control"}, {"score": 0.004694549334241098, "phrase": "cluttered_environment"}, {"score": 0.004548253531664032, "phrase": "spatial_multiagency"}, {"score": 0.0044910139920501515, "phrase": "growing_attention"}, {"score": 0.004215397034321004, "phrase": "theoretical_background"}, {"score": 0.004007083686875716, "phrase": "traffic_management_system"}, {"score": 0.003857606273328462, "phrase": "mobile_robots"}, {"score": 0.0034526191487098093, "phrase": "decentralized_traffic_controller"}, {"score": 0.003344895435289136, "phrase": "stationary_forbidden_regions"}, {"score": 0.003313236365209158, "phrase": "suggested_multiagent_motion_controller"}, {"score": 0.0032508114149214407, "phrase": "lenient_condition"}, {"score": 0.0031195501386327047, "phrase": "low_computational_effort"}, {"score": 0.0028274743316389437, "phrase": "incomplete_information"}, {"score": 0.0028095957871860653, "phrase": "unexpected_situations"}, {"score": 0.0027046673104220422, "phrase": "open_structure"}, {"score": 0.0025954008219792337, "phrase": "remaining_agents"}, {"score": 0.0023079225317714815, "phrase": "artificial-life_mode"}, {"score": 0.0022076314894741394, "phrase": "multiagent_controller"}, {"score": 0.0021522871388240444, "phrase": "potential_field_approach"}, {"score": 0.0021386687477715494, "phrase": "theoretical_developments"}, {"score": 0.0021049977753042253, "phrase": "simulation_results"}], "paper_keywords": ["artificial life (AL)", " decentralized", " motion planning", " multiagent", " nonlinear motion control", " potential fields", " self-organization"], "paper_abstract": "Spatial multiagency has been receiving growing attention from researchers exploring many of the aspects and modalities of this phenomenon. The aim is to develop the theoretical background needed for a multitude of applications involving the sharing of resources by more than one agent. A traffic management system is one of these applications. Here, a large group of mobile robots that are operating in communication-limited, and sensory-limited modes are required to cope with each others presence as well as the contents of their environment while preserving their ability to reach their preset independent goals. This paper explores the construction of a decentralized traffic controller for a large group of agents sharing a workspace with stationary forbidden regions. The suggested multiagent motion controller is complete provided that a lenient condition on the geometry of the workspace is upheld. It has a low computational effort that linearly increases with the number of agents. The controller is also self-organizing; therefore, it is able to deal, on its own, with incomplete information and unexpected situations. In addition to the above, the controller has an open structure to enable any agent to join or leave the group without the remaining agents having to adjust the manner in which they function. To meet these requirements, a definition of decentralization is suggested. This definition equates decentralization to self-organization in a group of agents operating in an artificial-life mode. The definition is used to provide guidelines for the construction of the multiagent controller. The controller is realized using the potential field approach. Theoretical developments, as well as simulation results, are provided.", "paper_title": "Decentralized self-organizing potential field-based control for individually motivated mobile agents in a cluttered environment: A vector-harmonic potential field approach", "paper_id": "WOS:000246034500009"}