{"auto_keywords": [{"score": 0.03285425557766291, "phrase": "splicing_systems"}, {"score": 0.02065788274949051, "phrase": "permitting_word"}, {"score": 0.010473462775356804, "phrase": "mitrana_et_al"}, {"score": 0.009719555349555712, "phrase": "input_word"}, {"score": 0.009179524738434383, "phrase": "forbidding_word"}, {"score": 0.0070481987804532405, "phrase": "computational_power"}, {"score": 0.006955604477066596, "phrase": "new_variants"}, {"score": 0.00481495049065317, "phrase": "accepting_splicing_systems"}, {"score": 0.003877329308854808, "phrase": "new_variant"}, {"score": 0.003826231150275071, "phrase": "splicing_system"}, {"score": 0.003533472957376828, "phrase": "theor"}, {"score": 0.0029602552900111433, "phrase": "new_condition"}, {"score": 0.002807118943000936, "phrase": "regular_languages"}, {"score": 0.002404136142279618, "phrase": "additional_restrictions"}, {"score": 0.0023307492812556204, "phrase": "smallest_class"}, {"score": 0.0021521410307795657, "phrase": "context-free_languages"}], "paper_keywords": [""], "paper_abstract": "In this paper we propose a generalization of the accepting splicing systems introduced in Mitrana et al. (Theor Comput Sci 411:2414-2422, 2010). More precisely, the input word is accepted as soon as a permitting word is obtained provided that no forbidding word has been obtained so far, otherwise it is rejected. Note that in the new variant of accepting splicing system the input word is rejected if either no permitting word is ever generated (like in Mitrana et al. in Theor Comput Sci 411:2414-2422, 2010) or a forbidding word has been generated and no permitting word had been generated before. We investigate the computational power of the new variants of accepting splicing systems and the interrelationships among them. We show that the new condition strictly increases the computational power of accepting splicing systems. Although there are regular languages that cannot be accepted by any of the splicing systems considered here, the new variants can accept non-regular and even non-context-free languages, a situation that is not very common in the case of (extended) finite splicing systems without additional restrictions. We also show that the smallest class of languages out of the four classes defined by accepting splicing systems is strictly included in the class of context-free languages. Solutions to a few decidability problems are immediately derived from the proof of this result.", "paper_title": "Accepting splicing systems with permitting and forbidding words", "paper_id": "WOS:000314531100001"}