{"auto_keywords": [{"score": 0.022901061798552447, "phrase": "prader-willi_syndrome"}, {"score": 0.006768122921890066, "phrase": "galvanic_skin_response_sensor"}, {"score": 0.004416079619543104, "phrase": "experience_difficulties"}, {"score": 0.004030695216899165, "phrase": "disrupted_bonding_process"}, {"score": 0.0034725269588525534, "phrase": "lesser_extent"}, {"score": 0.0033737457695128233, "phrase": "intelligent_biofeedback_system"}, {"score": 0.0030058503645435455, "phrase": "child's_arousal_response"}, {"score": 0.002690886043654469, "phrase": "thirteen_tests"}, {"score": 0.0026268961477241026, "phrase": "prader-willi_patients"}, {"score": 0.002527654365712841, "phrase": "meaningful_output_signal"}, {"score": 0.0023857603808363527, "phrase": "galvanic_skin_response"}, {"score": 0.0023515464194592195, "phrase": "valuable_biofeedback_source"}, {"score": 0.0022845800828325577, "phrase": "child's_emotions"}, {"score": 0.002145942273032774, "phrase": "intelligent_system"}, {"score": 0.002106227086870327, "phrase": "sense"}], "paper_keywords": ["Prader-Willi syndrome", " biofeedback system", " smart environment", " stimulating interaction", " bonding"], "paper_abstract": "Parents of children with the Prader-Willi syndrome have shown to experience difficulties in interpreting their child's signals and experience a lack of interest from their child, which causes a risk for a disrupted bonding process between the child and his or her parents. Evidence suggests that this is mainly due to the fact that these children are excessively sleepy, hardly cry and express movement to a lesser extent. In this paper an intelligent biofeedback system is proposed to support parents in their interaction with their child. The proposed system - called Sense - uses a galvanic skin response sensor to monitor the child's arousal response and visually communicates this to the parents. A prototype of the system is created and evaluated with users. Furthermore, thirteen tests are carried out with Prader-Willi patients to validate whether the galvanic skin response sensor provides a meaningful output signal for the system. The results from the tests show that galvanic skin response is a valuable biofeedback source to provide more information about the child's emotions and reaction to the environment. As a result of evaluating the intelligent system, parents expect Sense will improve the interaction and bonding between parents and their child with the Prader-Willi syndrome.", "paper_title": "Sense - a biofeedback system to support the interaction between parents and their child with the Prader-Willi syndrome: A pilot study", "paper_id": "WOS:000357989200005"}