{"auto_keywords": [{"score": 0.027536484624714582, "phrase": "occlusion_model"}, {"score": 0.004480307124735185, "phrase": "static_occlusions"}, {"score": 0.0039620308501590795, "phrase": "computer_system"}, {"score": 0.0034886660821793576, "phrase": "application_area"}, {"score": 0.003097865379563127, "phrase": "learning_phase"}, {"score": 0.0028822153400215973, "phrase": "iterative_framework"}, {"score": 0.002762423953243486, "phrase": "visual_hull"}, {"score": 0.0027274643070540733, "phrase": "foreground_object"}, {"score": 0.0026363807171515255, "phrase": "markov_random_field"}, {"score": 0.002421726275597666, "phrase": "iterative_process"}, {"score": 0.0023013968622710847, "phrase": "few-camera_constraint"}, {"score": 0.0021593396036472777, "phrase": "visual_hull_reconstruction"}, {"score": 0.0021049977753042253, "phrase": "occluding_structures"}], "paper_keywords": ["Occlusion Recovery", " Tracking", " Visual hull", " Markov random field"], "paper_abstract": "In this work we propose algorithms to learn the locations of static occlusions and reason about both static and dynamic occlusion scenarios in multi-camera scenes for 3D surveillance (e. g., reconstruction, tracking). We will show that this leads to a computer system which is able to more effectively track (follow) objects in video when they are obstructed from some of the views. Because of the nature of the application area, our algorithm will be under the constraints of using few cameras (no more than 3) that are configured wide-baseline. Our algorithm consists of a learning phase, where a 3D probabilistic model of occlusions is estimated per-voxel, per-view over time via an iterative framework. In this framework, at each frame the visual hull of each foreground object (person) is computed via a Markov Random Field that integrates the occlusion model. The model is then updated at each frame using this solution, providing an iterative process that can accurately estimate the occlusion model over time and overcome the few-camera constraint. We demonstrate the application of such a model to a number of areas, including visual hull reconstruction, the reconstruction of the occluding structures themselves, and 3D tracking.", "paper_title": "Recovery and Reasoning About Occlusions in 3D Using Few Cameras with Applications to 3D Tracking", "paper_id": "WOS:000301842800002"}