{"auto_keywords": [{"score": 0.0474863952677414, "phrase": "geometrical_data"}, {"score": 0.00481495049065317, "phrase": "interactive_sonification"}, {"score": 0.0044826811976193485, "phrase": "virtual_object"}, {"score": 0.004290969772225093, "phrase": "multimodal_interface"}, {"score": 0.004257000695796238, "phrase": "product_design"}, {"score": 0.0036601552758254757, "phrase": "haptic_interaction"}, {"score": 0.0032744315183287024, "phrase": "sonification_strategies"}, {"score": 0.003097043800165555, "phrase": "fundamental_frequency"}, {"score": 0.0030000149283621255, "phrase": "curve_shape"}, {"score": 0.0028037753646260937, "phrase": "varied_background"}, {"score": 0.002737615043512257, "phrase": "intended_users"}, {"score": 0.0026518169452004465, "phrase": "industrial_design"}, {"score": 0.002558495760339272, "phrase": "sonification_method"}, {"score": 0.0023626775529531486, "phrase": "first_experiment_participants"}, {"score": 0.0023346234464901978, "phrase": "success_rate"}, {"score": 0.0022886031992739126, "phrase": "multiple_choice_task"}, {"score": 0.0022524395393089544, "phrase": "second_experiment"}, {"score": 0.0021049977753042253, "phrase": "test_curve"}], "paper_keywords": ["Human Factors", " Experimentation", " Performance", " Sonification", " sound synthesis", " modal synthesis", " haptics"], "paper_abstract": "In this article we present an approach that uses sound to communicate geometrical data related to a virtual object. This has been developed in the framework of a multimodal interface for product design. The interface allows a designer to evaluate the quality of a 3-D shape using touch, vision, and sound. Two important considerations addressed in this article are the nature of the data that is sonified and the haptic interaction between the user and the interface, which in fact triggers the sound and influences its characteristics. Based on these considerations, we present a number of sonification strategies that are designed to map the geometrical data of interest into sound. The fundamental frequency of various sounds was used to convey the curve shape or the curvature to the listeners. Two evaluation experiments are described, one involves partipants with a varied background, the other involved the intended users, i.e. participants with a background in industrial design. The results show that independent of the sonification method used and independent of whether the curve shape or the curvature were sonified, the sonification was quite successful. In the first experiment participants had a success rate of about 80% in a multiple choice task, in the second experiment it took the participants on average less than 20 seconds to find the maximum, minimum or inflection points of the curvature of a test curve.", "paper_title": "Curve Shape and Curvature Perception Through Interactive Sonification", "paper_id": "WOS:000310164900002"}