{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "computer_usage_policies"}, {"score": 0.03721946204790023, "phrase": "individual_intention"}, {"score": 0.02888450156882792, "phrase": "computer_security"}, {"score": 0.0047732596509542135, "phrase": "purpose_-_this_paper"}, {"score": 0.004650330504968421, "phrase": "individuals'_awareness"}, {"score": 0.00428146713705618, "phrase": "-_mba_students"}, {"score": 0.00417115038996633, "phrase": "online_survey"}, {"score": 0.00367658459781873, "phrase": "resulting_data"}, {"score": 0.003613119346373748, "phrase": "smart_pls._findings_-_results"}, {"score": 0.003340768341189764, "phrase": "social_trust"}, {"score": 0.002918826667294298, "phrase": "mba_students"}, {"score": 0.002880927789104712, "phrase": "single_university"}, {"score": 0.0028065957753430713, "phrase": "written_policy_statements"}, {"score": 0.00226693109377084, "phrase": "information_systems"}, {"score": 0.002237477619351199, "phrase": "computer_crime"}, {"score": 0.002132711053003407, "phrase": "critical_first_step"}, {"score": 0.0021049977753042253, "phrase": "user_knowledge"}], "paper_keywords": ["information systems", " crimes", " computers", " individual behaviour", " business policy"], "paper_abstract": "Purpose - This paper aims to improve understanding of individuals' awareness and perceptions of computer usage policies (CUPs) and why individuals elect not to read these policies. Design/methodology/approach - MBA students were asked to complete an online survey evaluating their behavioral intention to read CUPs, as well as their performance of this behavior. Factors contributing to the intention to read policies were also examined. The resulting data were analyzed with Smart PLS. Findings - Results suggest that three factors influence individual intention to read CUPs. These factors include attitude, apathy, and social trust. The model explained about 70 percent of individual intention to read CUPs and about 44 percent of the variability in actually reading these policies. Research limitations/implications - The sample is limited to MBA students from a single university. Practical implications - Although written policy statements are often considered the cornerstone of computer security, many individuals elect not to read these policies. Thus, other methods of communication must be used. Originality/value - This paper examines the reasons individuals elect not to read CUPs. Given the importance of these policies as deterrents to information systems misuse and computer crime, understanding why individuals fail to read policies is a critical first step in enhancing user knowledge of computer security.", "paper_title": "Why users (fail to) read computer usage policies", "paper_id": "WOS:000258447100009"}