{"auto_keywords": [{"score": 0.03465288598351081, "phrase": "touch_screen"}, {"score": 0.02288107085661792, "phrase": "web_map"}, {"score": 0.01054801664096406, "phrase": "navigation_modes"}, {"score": 0.00481495049065317, "phrase": "mouse_input"}, {"score": 0.004556901872357751, "phrase": "widely-used_wayfinding_tool"}, {"score": 0.004419538941706716, "phrase": "different_input_device"}, {"score": 0.003417054482155433, "phrase": "experimental_interfaces"}, {"score": 0.003375429082739004, "phrase": "simulated_tests"}, {"score": 0.0032436052954996097, "phrase": "performance_results"}, {"score": 0.0031073749619793087, "phrase": "user_interface_actions"}, {"score": 0.0030414140732789186, "phrase": "arrow_keys"}, {"score": 0.002985988377995789, "phrase": "two-way_analysis"}, {"score": 0.00290473242917264, "phrase": "six_types"}, {"score": 0.002886977102894829, "phrase": "operational_performance"}, {"score": 0.002673957615079041, "phrase": "task_completion_time"}, {"score": 0.0025226117209113737, "phrase": "cccd_mode"}, {"score": 0.0023507916951658455, "phrase": "stepping_stone"}, {"score": 0.0023079225317714815, "phrase": "navigation_mode"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Web map", " Input device", " Navigation mode"], "paper_abstract": "Nowadays the web map (E-map) is becoming a widely-used wayfinding tool. However, when it is operated with a different input device, its performance will be affected. To investigate its functional performances in various navigation modes, two input devices were employed, i.e., the mouse and the touch screen. Meanwhile, the map websites over the Internet were searched and examined, and three dominant navigation modes in current use were identified: (1) continuous control and continuous display (CCCD), (2) discrete control and continuous display (DCCD), and (3) discrete control and discrete display (DCDD). Then, the experimental interfaces were designed and simulated tests were separately conducted with the mouse and the touch screen to evaluate the performance results. In this research, 36 volunteers participated in the experiment, whose task completion times and user interface actions (total number of clicks on arrow keys) were analyzed through a two-way analysis of variance (ANOVA) to determine the six types of operational performance. It was finally discovered that, in all of the navigation modes, the mouse performed remarkably better than the touch screen in terms of task completion time (F(2,70) = 3.28, p < .001). Moreover, the participants did much better in the CCCD mode than in the other modes whether they used the mouse or the touch screen. The findings will be utilized by our research team as the stepping stone to the development of a navigation mode compatible with both the mouse and the touch screen; besides, they will serve as a reference when the web map is further studied and practically designed. (C) 2011 Elsevier B.V. All rights reserved.", "paper_title": "Direct-touch vs. mouse input for navigation modes of the web map", "paper_id": "WOS:000297960500006"}