{"auto_keywords": [{"score": 0.029741733512226632, "phrase": "participating_agents"}, {"score": 0.00481495049065317, "phrase": "distributed_digital_manufacturing"}, {"score": 0.004678940805063634, "phrase": "web-based_multi-agent_system"}, {"score": 0.004503525064934708, "phrase": "collaborative_product_development"}, {"score": 0.004418287966422041, "phrase": "geographically_distributed_functional_agents"}, {"score": 0.0041522059428827345, "phrase": "distributed_manufacturing_scenario"}, {"score": 0.004054169947971483, "phrase": "close_collaboration"}, {"score": 0.003791763445590174, "phrase": "functional_agents"}, {"score": 0.00311669276800628, "phrase": "physical_parts"}, {"score": 0.003072285184441679, "phrase": "specific_agents"}, {"score": 0.003043031131345537, "phrase": "unique_functionalities"}, {"score": 0.0029996699429582835, "phrase": "manufacturing_managing_agent"}, {"score": 0.00276534038425712, "phrase": "seamless_work_flow"}, {"score": 0.0026235360404084137, "phrase": "product_design"}, {"score": 0.002598543802992702, "phrase": "final_manufacturing"}, {"score": 0.0024301229420875155, "phrase": "knowledge_query_manipulation_language"}, {"score": 0.002145703330831668, "phrase": "case_study"}, {"score": 0.0021049977753042253, "phrase": "developed_prototype_webmas_system"}], "paper_keywords": ["multi-agent system", " distributed manufacturing", " framework", " coordination", " prototype system", " case study"], "paper_abstract": "A framework for a web-based multi-agent system (WebMAS) is proposed to facilitate collaborative product development and production among geographically distributed functional agents using digitalized information. Considering the complexity of products created in a distributed manufacturing scenario, this often requires close collaboration among a number of facilities. In this research, a prototype system where different distributed functional agents, namely, a manufacturability evaluation agent, manufacturing resource agent, process-planning agent, manufacturing scheduling agent, shop-floor agent, fault diagnosis agent, etc., interact coherently to realize the development of physical parts. With specific agents having unique functionalities, a manufacturing managing agent acts as the centre of the system thus coordinating the activities of the participating agents while ensuring seamless work flow and collaboration. This facilitates optimization of the part production cycle from product design to final manufacturing because all the production procedures are correlated and considered logically. The agents communicate through the knowledge query manipulation language, which includes many pre-defined performatives to aid the participating agents in carrying out their tasks intelligently by interpreting commands from one another. In this paper, a case study based on the developed prototype WebMAS system is discussed to illustrate the system.", "paper_title": "A web-based multi-agent system for distributed digital manufacturing", "paper_id": "WOS:000244031000002"}