{"auto_keywords": [{"score": 0.04427417173634225, "phrase": "utchem"}, {"score": 0.008297999424650057, "phrase": "utchem-iphreeqc"}, {"score": 0.00481495049065317, "phrase": "reactive_flow"}, {"score": 0.004499647408293102, "phrase": "step_algorithm"}, {"score": 0.0037219983211350047, "phrase": "austin"}, {"score": 0.00357362651129581, "phrase": "iphreeqc"}, {"score": 0.0035016702571862165, "phrase": "open-source_modules"}, {"score": 0.0034311578789991363, "phrase": "usgs_state-of-the-art_geochemical_package"}, {"score": 0.002724428781940696, "phrase": "computer_memory"}, {"score": 0.0025630077791393125, "phrase": "geochemistry_module"}, {"score": 0.0024440836179156593, "phrase": "field_scale_reservoir_simulations"}, {"score": 0.0023148964315569866, "phrase": "existing_reservoir_simulator"}, {"score": 0.0022836785412390544, "phrase": "comprehensive_reactive-transport_modeling"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Modeling", " Reactive-transport", " Coupling IPhreeqc", " Reservoir simulator (i.e., UTCHEM)"], "paper_abstract": "A detailed step-by-step algorithm is presented through which we integrate IPhreeqc of the United Stated Geological Survey (USGS) state-of-the-art geochemical package with UTCHEM for comprehensive reactive-transport modeling. UTCHEM is 3D multi-phase flow and transport research simulator developed in The University of Texas at Austin. On the other hand, IPhreeqc is the open-source modules of the USGS state-of-the-art geochemical package, PHREEQC. Through this coupling, we are able to simulate homogeneous and heterogeneous, irreversible, and ion-exchange and surface reactions under non-isothermal, non-isobaric and both local-equilibrium and kinetic conditions. All the data communications between UTCHEM and IPhreeqc is performed through the computer memory without writing/reading files. We further parallelize the geochemistry module of UTCHEM-IPhreeqc in order to conduct field scale reservoir simulations. Our proposed coupling procedure can be implemented in any existing reservoir simulator for comprehensive reactive-transport modeling. One realistic case study is presented using UTCHEM-IPhreeqc. (C) 2015 Elsevier Ltd. All rights reserved.", "paper_title": "Coupling IPhreeqc with UTCHEM to model reactive flow and transport", "paper_id": "WOS:000358971500017"}