{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "sar_information"}, {"score": 0.04963913874714362, "phrase": "compound_data_sets"}, {"score": 0.03054417985406599, "phrase": "sar_rules"}, {"score": 0.0047268728636719725, "phrase": "derive_sar_rules"}, {"score": 0.004661868629458321, "phrase": "intuitive_and_generally_applicable_analysis_method"}, {"score": 0.0041154571996523505, "phrase": "nearest-neighbor_similarity_relationships"}, {"score": 0.003822263046602146, "phrase": "overlapping_compound_neighborhoods"}, {"score": 0.0036496814103475174, "phrase": "local_analysis_scheme"}, {"score": 0.0035010071030752883, "phrase": "high_sar_information_content"}, {"score": 0.0032066653632708965, "phrase": "data_sets"}, {"score": 0.0027913353347879507, "phrase": "consistent_manner"}, {"score": 0.0026899455459275575, "phrase": "data_structure"}, {"score": 0.0026042472337367015, "phrase": "characteristic_features"}, {"score": 0.0024865237976623286, "phrase": "high-throughput_screening"}, {"score": 0.0024522530645471065, "phrase": "optimization_data_sets"}, {"score": 0.0023851187337905412, "phrase": "standard_clustering_techniques"}, {"score": 0.002266765479420981, "phrase": "practical_guidance"}, {"score": 0.002174303033371869, "phrase": "spt_program"}, {"score": 0.0021049977753042253, "phrase": "scientific_community"}], "paper_keywords": [""], "paper_abstract": "An intuitive and generally applicable analysis method, termed similarity-potency tree (SPT), is introduced to mine structure-activity relationship (SAR) information in compound data sets of any source. Only compound potency values and nearest-neighbor similarity relationships are considered. Rather than analyzing a data set as a whole, in part overlapping compound neighborhoods are systematically generated and represented as SPTs. This local analysis scheme simplifies the evaluation of SAR information and SPTs of high SAR information content are easily identified. By inspecting only a limited number of compound neighborhoods, it is also straightforward to determine whether data sets contain only little or no interpretable SAR information. Interactive analysis of SPTs is facilitated by reading the trees in two directions, which makes it possible to extract SAR rules, if available, in a consistent manner. The simplicity and interpretability of the data structure and the ease of calculation are characteristic features of this approach. We apply the methodology to high-throughput screening and lead optimization data sets, compare the approach to standard clustering techniques, illustrate how SAR rules are derived, and provide some practical guidance how to best utilize the methodology. The SPT program is made freely available to the scientific community.", "paper_title": "Similarity-Potency Trees: A Method to Search for SAR Information in Compound Data Sets and Derive SAR Rules", "paper_id": "WOS:000281022300009"}