{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "paper-based_web_pages"}, {"score": 0.0038756055612167942, "phrase": "good_user_interfaces"}, {"score": 0.0035828427627676075, "phrase": "simplified_heuristic_evaluation"}, {"score": 0.0034368818187904744, "phrase": "screen_shots"}, {"score": 0.0034052594710793664, "phrase": "web_pages"}, {"score": 0.00309023627455429, "phrase": "aforementioned_screen_shots"}, {"score": 0.0028042741141125712, "phrase": "technological_solutions"}, {"score": 0.0023198180380964305, "phrase": "heuristic_evaluation"}, {"score": 0.00229844995872581, "phrase": "paper-based_screen_shots"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["clinical information systems", " heuristic evaluation", " information needs", " internet", " medical errors", " usability assessment", " Web page design"], "paper_abstract": "Online medical information, when presented to clinicians, must be well-organized and intuitive to use, so that the clinicians can conduct their daily work efficiently and without error. It is essential to actively seek to produce good user interfaces that are acceptable to the user. This paper describes the methodology used to develop a simplified heuristic evaluation (HE) suitable for the evaluation of screen shots of Web pages, the development of an HE instrument used to conduct the evaluation, and the results of the evaluation of the aforementioned screen shots. In addition, this paper presents examples of the process of categorizing problems identified by the HE and the technological solutions identified to resolve these problems. Four usability experts reviewed 18 paper-based screen shots and made a total of 108 comments. Each expert completed the task in about an hour. We were able to implement solutions to approximately 70% of the violations. Our study found that a heuristic evaluation using paper-based screen shots of a user interface was expeditious, inexpensive, and straightforward to implement. (c) 2006 Elsevier Inc. All rights reserved.", "paper_title": "Heuristic evaluation of paper-based Web pages: A simplified inspection usability methodology", "paper_id": "WOS:000239879300004"}