{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "optical_channel"}, {"score": 0.004769616966550469, "phrase": "ghost-pulse_constraint"}, {"score": 0.004665483918844599, "phrase": "constrained_coding_techniques"}, {"score": 0.004549242970806199, "phrase": "nonlinear_effect"}, {"score": 0.004506399797123487, "phrase": "optical_fiber_channel"}, {"score": 0.0044219147356791225, "phrase": "spurious_pulses"}, {"score": 0.0036591555008359884, "phrase": "ghost-pulse_effect"}, {"score": 0.00291494666099687, "phrase": "bgp_constraint"}, {"score": 0.002896586744793007, "phrase": "zero_capacity"}, {"score": 0.002702081704660048, "phrase": "ternary_sequences"}, {"score": 0.0024654516678953658, "phrase": "transmitted_sequence"}, {"score": 0.0023512871357696022, "phrase": "nonzero_capacities"}, {"score": 0.0021050115688732263, "phrase": "bgp"}], "paper_keywords": ["binary ghost-pulse (BGP) constraint", " capacity of constrained systems", " constrained encoding and decoding", " optical communication", " ternary ghost-pulse (TGP) constraint"], "paper_abstract": "We consider a number of constrained coding techniques that can be used to mitigate a nonlinear effect in the optical fiber channel that causes the formation of spurious pulses, called \"ghost pulses.\" Specifically, if b(1)b(2)...b(n) is a sequence of bits sent across an optical channel, such that b(k) = b(l) = b(m) = 1 for some k, l, m (not necessarily all distinct) but b(k+l-m) = 0, then the ghost-pulse effect causes b(k+l-m) to change to 1, thereby creating an error. Such errors do not occur if the sequence of bits satisfies the following constraint: for all integers k,1, m such that b(k) = b(l) = b(m) = 1, we have b(k+l-m) = 1. We call this the binary ghost-pulse (BGP) constraint. We will show, however, that the BGP constraint has zero capacity, implying that sequences satisfying this constraint cannot carry much information. Consequently, we consider a more sophisticated coding scheme, which uses ternary sequences satisfying a certain ternary ghost-pulse (TGP) constraint. We further relax these constraints by ignoring interactions between symbols that are more than a certain distance t apart in the transmitted sequence. Analysis of the resulting BGP(t) and TGP(t) constraints shows that these have nonzero capacities, and furthermore, the TGP(t)-constrained codes can achieve rates that are significantly higher than those for the corresponding BGP(t) codes. We also discuss the design of encoders and decoders for coding into the BGP, BGP(t), and TGP(t) constraints.", "paper_title": "Coding for the optical channel: The ghost-pulse constraint", "paper_id": "WOS:000234412500005"}