{"auto_keywords": [{"score": 0.05007850122175858, "phrase": "ehealth_applications"}, {"score": 0.04872394107421461, "phrase": "interoperability_testing"}, {"score": 0.04514147930668658, "phrase": "ihe"}, {"score": 0.00470862827326028, "phrase": "common_conformance"}, {"score": 0.0045317702763072445, "phrase": "prominent_ehealth_messaging_standard"}, {"score": 0.004170940184489072, "phrase": "testing_requirements"}, {"score": 0.0039380388343479384, "phrase": "interoperability_testing_requirements"}, {"score": 0.003912974119795913, "phrase": "ihe_profiles"}, {"score": 0.003826492478418294, "phrase": "ihe_xds"}, {"score": 0.0037419150096899127, "phrase": "ihe_pix"}, {"score": 0.003601235776892337, "phrase": "dynamic_and_configurable_test_framework"}, {"score": 0.0035216195857272403, "phrase": "interoperability_stack"}, {"score": 0.0034880375790382586, "phrase": "single_test_scenario"}, {"score": 0.0033568708392230544, "phrase": "correct_information_exchange"}, {"score": 0.003293142761521425, "phrase": "exchanged_data"}, {"score": 0.003240958183116486, "phrase": "healthcare_domain"}, {"score": 0.002992143937008144, "phrase": "continua_health_alliance"}, {"score": 0.0029635959701543313, "phrase": "integration_profiles"}, {"score": 0.002935319576795509, "phrase": "specific_clinical_need"}, {"score": 0.002907312188714594, "phrase": "use_case"}, {"score": 0.002824878732625655, "phrase": "existing_standards"}, {"score": 0.0025583777916403437, "phrase": "integrated_testing_environment"}, {"score": 0.0024620842899061614, "phrase": "individual_testing_tools"}, {"score": 0.0023999058090187985, "phrase": "generic_and_modular_test_framework"}, {"score": 0.002354302193867031, "phrase": "testing_processes"}, {"score": 0.002244040022860764, "phrase": "testbatn_framework"}, {"score": 0.0021595521075096808, "phrase": "common_interfaces"}, {"score": 0.0021049977753042253, "phrase": "different_testing_components"}], "paper_keywords": ["Medical informatics applications", " standards", " software validation", " systems integration"], "paper_abstract": "Objective: To explain the common conformance and interoperability testing requirements of eHealth applications through two case studies; one using a prominent eHealth messaging standard, namely HL7 v3 [1], and the other using Integrating the Healthcare Enterprise (IHE) [2] Profiles and to describe how these testing requirements can be addressed through an automated, modular and scenario-based testing framework, namely TestBATN. Methods: Summarizing the conformance testing requirements of HL7 v3 messages. Illustrating the interoperability testing requirements of IHE Profiles through a scenario based on the IHE XDS, IHE XDS-MS and IHE PIX profiles. Explaining how these requirements can be handled through a dynamic and configurable test framework addressing all the layers in the interoperability stack within a single test scenario. Results: Conformance and interoperability testing are necessary to maintain correct information exchange as the correctness of the exchanged data is essential in the healthcare domain. There are many standards used in eHealth that the applications need to conform. Additionally, there are profiling initiatives such as IHE and Continua Health Alliance which publish integration profiles addressing a specific clinical need or a use case and describe how to combine or use the existing standards to provide interoperability. However, as the results of our case studies demonstrate, there are many commonalities in the conformance and interoperability testing requirements of these standards and profiles and therefore an integrated testing environment is needed. Conclusion: Our main conclusion is that rather than having individual testing tools for each standard or initiative, a generic and modular test framework exploiting the commonalities in the testing processes and fostering reusability of modular, pluggable testing components will improve the efficiency of testing. Through the TestBATN framework, we describe how this modularity can be achieved by providing common interfaces facilitating the development of adaptors which allows different testing components to be plugged into the system.", "paper_title": "Testing Conformance and Interoperability of eHealth Applications", "paper_id": "WOS:000278818400009"}