{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "spatial_knee_joint_positions"}, {"score": 0.031440446672256005, "phrase": "single_fluoroscopic_images"}, {"score": 0.030454570211478012, "phrase": "joint_positions"}, {"score": 0.004775726266706856, "phrase": "single_or_dual_fluoroscopic_images"}, {"score": 0.004418601451254075, "phrase": "vivo_human_knee_joint_kinematics"}, {"score": 0.004224130367280183, "phrase": "single_and_dual_fluoroscopic_images"}, {"score": 0.004104838067758352, "phrase": "size_limitation"}, {"score": 0.004054745478848129, "phrase": "image_intensifiers"}, {"score": 0.003908091457759849, "phrase": "knee_joint"}, {"score": 0.003782174375003052, "phrase": "dynamic_knee_joint_motion"}, {"score": 0.0036453427552753533, "phrase": "systematic_evaluation"}, {"score": 0.0030317376771013703, "phrase": "dual_fluoroscopic_images"}, {"score": 0.002898127432512101, "phrase": "satisfactory_accuracy"}, {"score": 0.002839352319679885, "phrase": "imaging_plane"}, {"score": 0.0026159017392986595, "phrase": "out-plane_direction"}, {"score": 0.0024099937116733227, "phrase": "actual_knee_positions"}, {"score": 0.002275557501858879, "phrase": "dual_fluoroscopic_image_technique"}, {"score": 0.0021049977753042253, "phrase": "high_precisions"}], "paper_keywords": ["fluoroscopic image", " in vivo knee kinematics", " in vivo knee biomechanics", " knee", " computational biomechanics"], "paper_abstract": "Fluoroscopic image technique, using either a single image or dual images, has been widely applied to measure in vivo human knee joint kinematics. However, few studies have compared the advantages of using single and dual fluoroscopic images. Furthermore, due to the size limitation of the image intensifiers, it is possible that only a portion of the knee joint could be captured by the fluoroscopy during dynamic knee joint motion. In this paper, we presented a systematic evaluation of an automatic 2D-3D image matching method in reproducing spatial knee joint positions using either single or dual fluoroscopic image techniques. The data indicated that for the femur and tibia, their spatial positions could be determined with an accuracy and precision less than 0.2 mm in translation and less than 0.4 degrees in orientation when dual fluoroscopic images were used. Using single fluoroscopic images, the method could produce satisfactory accuracy in joint positions in the imaging plane (in average up to 0.5 mm in translation and 1.3 degrees in rotation), but large variations along the out-plane direction (in average up to 4.0 mm in translation and 2.2 degrees in rotation). The precision of using single fluoroscopic images to determine the actual knee positions was worse than its accuracy obtained. The data also indicated that when using dual fluoroscopic image technique, if the knee joint outlines in one image were incomplete by 80%, the algorithm could still reproduce the joint positions with high precisions.", "paper_title": "An automatic 2D-3D image matching method for reproducing spatial knee joint positions using single or dual fluoroscopic images", "paper_id": "WOS:000310736300011"}