{"auto_keywords": [{"score": 0.049226991195811136, "phrase": "unifying_framework"}, {"score": 0.048223267193393836, "phrase": "process_algebras"}, {"score": 0.03483220185213116, "phrase": "continuation_function"}, {"score": 0.00481495049065317, "phrase": "stochastic_process_calculi"}, {"score": 0.004513450434595191, "phrase": "quantitative_aspects"}, {"score": 0.004215571179806372, "phrase": "general_and_clear_support"}, {"score": 0.004032042462321313, "phrase": "state"}, {"score": 0.00397996666534913, "phrase": "function_labeled_transition_systems"}, {"score": 0.0038671299350540554, "phrase": "state_transition_structures"}, {"score": 0.0035729944980593324, "phrase": "second_components"}, {"score": 0.0035346515636097533, "phrase": "source_state"}, {"score": 0.00333697550984782, "phrase": "third_component"}, {"score": 0.0031959843979467704, "phrase": "suitable_type"}, {"score": 0.003038983069081333, "phrase": "stochastic_process"}, {"score": 0.0028792911886505526, "phrase": "negative_exponential_distribution"}, {"score": 0.0026600905156986317, "phrase": "simple_formalism"}, {"score": 0.0026220625042810706, "phrase": "continuous-time_markov_chains"}, {"score": 0.0025202582748972122, "phrase": "parallel_composition"}, {"score": 0.002143247921132179, "phrase": "formal_correspondence"}, {"score": 0.0021202154023229123, "phrase": "futss_semantics"}], "paper_keywords": ["Languages", " Performance", " Theory", " Verification", " Continuous-time Markov chains", " stochastic process calculi", " structured operational semantics"], "paper_abstract": "We introduce a unifying framework to provide the semantics of process algebras, including their quantitative variants useful for modeling quantitative aspects of behaviors. The unifying framework is then used to describe some of the most representative stochastic process algebras. This provides a general and clear support for an understanding of their similarities and differences. The framework is based on State to Function Labeled Transition Systems, FUTSs for short, that are state transition structures where each transition is a triple of the form (s, alpha, P). The first and the second components are the source state, s, and the label, a, of the transition, while the third component is the continuation function, P, associating a value of a suitable type to each state s'. For example, in the case of stochastic process algebras the value of the continuation function on s' represents the rate of the negative exponential distribution characterizing the duration/delay of the action performed to reach state s' from s. We first provide the semantics of a simple formalism used to describe continuous-time Markov chains, then we model a number of process algebras that permit parallel composition of models according to the two main interaction paradigms (multiparty and one-to-one synchronization). Finally, we deal with formalisms where actions and rates are kept separate and address the issues related to the coexistence of stochastic, probabilistic, and nondeterministic behaviors. For each formalism, we establish the formal correspondence between the FUTSs semantics and its original semantics.", "paper_title": "A Uniform Definition of Stochastic Process Calculi", "paper_id": "WOS:000327453300005"}