{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "scientometric_predictors"}, {"score": 0.004768104290288521, "phrase": "research_performance"}, {"score": 0.004518442937844318, "phrase": "high_correlation"}, {"score": 0.004452641437293878, "phrase": "external_criterion"}, {"score": 0.00413767314434795, "phrase": "growing_movement"}, {"score": 0.004017989546119125, "phrase": "research_articles"}, {"score": 0.003920891569777891, "phrase": "web_-_offer"}, {"score": 0.003715425273229361, "phrase": "old_and_new_scientometric_predictors"}, {"score": 0.003661275004971829, "phrase": "multiple_regression_analysis"}, {"score": 0.002535876002754739, "phrase": "forthcoming_parallel_panel-based_and_metric_rae"}, {"score": 0.002356173823922118, "phrase": "joint_correlation"}, {"score": 0.002299142268368128, "phrase": "open_access_scientometrics"}, {"score": 0.002265586601922693, "phrase": "powerful_new_means"}, {"score": 0.002157223877108711, "phrase": "growing_open_access_database"}, {"score": 0.0021049977753042253, "phrase": "powerful_incentives"}], "paper_keywords": [""], "paper_abstract": "Scientometric predictors of research performance need to be validated by showing that they have a high correlation with the external criterion they are trying to predict. The UK Research Assessment Exercise (RAE) - together with the growing movement toward making the full-texts of research articles freely available on the web - offer a unique opportunity to test and validate a wealth of old and new scientometric predictors, through multiple regression analysis: Publications, journal impact factors, citations, co-citations, citation chronometrics (age, growth, latency to peak, decay rate), hub/authority scores, h-index, prior funding, student counts, co-authorship scores, endogamy/exogamy, textual proximity, download/co-downloads and their chronometrics, etc. can all be tested and validated jointly, discipline by discipline, against their RAE panel rankings in the forthcoming parallel panel-based and metric RAE in 2008. The weights of each predictor can be calibrated to maximize the joint correlation with the rankings. Open Access Scientometrics will provide powerful new means of navigating, evaluating, predicting and analyzing the growing Open Access database, as well as powerful incentives for making it grow faster.", "paper_title": "Open access scientometrics and the UK Research Assessment Exercise", "paper_id": "WOS:000264487900009"}