{"auto_keywords": [{"score": 0.04572946919208604, "phrase": "impersonal_it-enabled_exchanges"}, {"score": 0.004657542074154025, "phrase": "functional_neuroimaging_study."}, {"score": 0.004420472010542188, "phrase": "major_decision"}, {"score": 0.004296264970612285, "phrase": "potential_role"}, {"score": 0.004155742403177802, "phrase": "impersonal_exchanges"}, {"score": 0.0040969285074699, "phrase": "information_systems_literature"}, {"score": 0.003925414526537783, "phrase": "relatively_little_attention"}, {"score": 0.003261133560558666, "phrase": "economic_outcomes"}, {"score": 0.003094920033010818, "phrase": "online_marketplaces"}, {"score": 0.003022186855664124, "phrase": "functional_neuroimaging"}, {"score": 0.002923214590192792, "phrase": "psychometric_measures"}, {"score": 0.0027218799769229596, "phrase": "brain_activity"}, {"score": 0.0025954008219792337, "phrase": "neural_correlates"}, {"score": 0.0022608057001451414, "phrase": "different_brain_areas"}, {"score": 0.0022287497627555895, "phrase": "different_effects"}, {"score": 0.0021352776064254195, "phrase": "distinct_constructs"}, {"score": 0.0021049977753042253, "phrase": "different_neurological_processes"}], "paper_keywords": ["Trust", " distrust", " neuroIS", " price premiums", " functional neuroimaging", " fMRI", " cognitive neuroscience"], "paper_abstract": "Determining whom to trust and whom to distrust is a major decision in impersonal IT-enabled exchanges. Despite the potential role of both trust and distrust in impersonal exchanges, the information systems literature has primarily focused on trust, alas paying relatively little attention to distrust. Given the importance of studying both trust and distrust, this study alms to shed light on the nature, dimensionality, distinction, and relationship, and relative effects of trust and distrust on economic outcomes in the context of impersonal IT-enabled exchanges between buyers and sellers in online marketplaces. This study uses functional neuroimaging (fMRI) tools to complement psychometric measures of trust and distrust by observing the location, timing, and level of brain activity that underlies trust and distrust and their underlying dimensions. The neural correlates of trust and distrust are identified when subjects interact with four experimentally manipulated seller profiles that differ on their level of trust and distrust. The results show that trust and distrust activate different brain areas and have different effects, helping explain why trust and distrust are distinct constructs associated with different neurological processes. Implications for the nature, distinction and relationship, dimensionality, and effects of trust and distrust are discussed.", "paper_title": "WHAT DOES THE BRAIN TELL US ABOUT TRUST AND DISTRUST? EVIDENCE FROM A FUNCTIONAL NEUROIMAGING STUDY", "paper_id": "WOS:000278200600010"}