{"auto_keywords": [{"score": 0.049636680610423214, "phrase": "tor"}, {"score": 0.01581766484231735, "phrase": "target_traffic"}, {"score": 0.006745521462712901, "phrase": "embedded_signal"}, {"score": 0.006500093854043413, "phrase": "malicious_entry_onion_router"}, {"score": 0.004741030507509777, "phrase": "anonymizer"}, {"score": 0.004653815971302021, "phrase": "anonymity_service"}, {"score": 0.0039009678436644183, "phrase": "ip_packets"}, {"score": 0.0038648914374241447, "phrase": "tor_network"}, {"score": 0.003747020072136732, "phrase": "application_concept"}, {"score": 0.003712362078915926, "phrase": "ip_layer"}, {"score": 0.0035658307992470243, "phrase": "new_cell-counting-based_attack"}, {"score": 0.0034570485248558006, "phrase": "anonymous_communication_relationship"}, {"score": 0.0032292292848296617, "phrase": "malicious_exit_onion_router"}, {"score": 0.0031599281621383776, "phrase": "secret_signal"}, {"score": 0.003111336942540226, "phrase": "cell_counter"}, {"score": 0.0027741761880779535, "phrase": "received_cells"}, {"score": 0.002739982973943104, "phrase": "communication_relationship"}, {"score": 0.002331909406363425, "phrase": "detection_rate"}, {"score": 0.0021512129013162846, "phrase": "honest_participants"}, {"score": 0.0021246816854197732, "phrase": "e._g."}], "paper_keywords": ["Anonymity", " cell counting", " mix networks", " signal", " Tor"], "paper_abstract": "Various low-latency anonymous communication systems such as Tor and Anonymizer have been designed to provide anonymity service for users. In order to hide the communication of users, most of the anonymity systems pack the application data into equal-sized cells (e. g., 512 B for Tor, a known real-world, circuit-based, low-latency anonymous communication network). Via extensive experiments on Tor, we found that the size of IP packets in the Tor network can be very dynamic because a cell is an application concept and the IP layer may repack cells. Based on this finding, we investigate a new cell-counting-based attack against Tor, which allows the attacker to confirm anonymous communication relationship among users very quickly. In this attack, by marginally varying the number of cells in the target traffic at the malicious exit onion router, the attacker can embed a secret signal into the variation of cell counter of the target traffic. The embedded signal will be carried along with the target traffic and arrive at the malicious entry onion router. Then, an accomplice of the attacker at the malicious entry onion router will detect the embedded signal based on the received cells and confirm the communication relationship among users. We have implemented this attack against Tor, and our experimental data validate its feasibility and effectiveness. There are several unique features of this attack. First, this attack is highly efficient and can confirm very short communication sessions with only tens of cells. Second, this attack is effective, and its detection rate approaches 100% with a very low false positive rate. Third, it is possible to implement the attack in a way that appears to be very difficult for honest participants to detect (e. g., using our hopping-based signal embedding).", "paper_title": "A New Cell-Counting-Based Attack Against Tor", "paper_id": "WOS:000307895100020"}