{"auto_keywords": [{"score": 0.011894105969697144, "phrase": "individual_and_organization_levels"}, {"score": 0.00481495049065317, "phrase": "sociotechnical_framework"}, {"score": 0.004728874038094706, "phrase": "health_it_implementation"}, {"score": 0.004644329185633612, "phrase": "barcode_medication_administration"}, {"score": 0.004610934029355486, "phrase": "bcma"}, {"score": 0.004367973309172735, "phrase": "everyday_work"}, {"score": 0.004258995791471342, "phrase": "medication_safety"}, {"score": 0.004019964326034457, "phrase": "nurses'_orientation"}, {"score": 0.0034293295415901807, "phrase": "inpatient_settings"}, {"score": 0.003380129564214184, "phrase": "ethnographic_fieldwork"}, {"score": 0.0033196177202591843, "phrase": "email_communications"}, {"score": 0.0032601856292942136, "phrase": "healthcare_professionals"}, {"score": 0.002760836859397696, "phrase": "everyday_patient_care"}, {"score": 0.0027310567737368033, "phrase": "medication_administration"}, {"score": 0.0026151058979100596, "phrase": "new_technology_result"}, {"score": 0.002549749054599413, "phrase": "organization_level"}, {"score": 0.0023125643872311994, "phrase": "clinical_workers"}, {"score": 0.0022958971655679832, "phrase": "new_technology"}, {"score": 0.002198380879018061, "phrase": "organizational_structure"}, {"score": 0.002151183757599893, "phrase": "unproductive_or_unsafe_adaptations"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ireland_ltd."}], "paper_keywords": ["Barcode medication administration", " Adaptations", " Workarounds", " Unintended consequences", " Orienting frames"], "paper_abstract": "Purpose: When barcode medication administration (BCMA) is implemented nurses are required to integrate not only a new set of procedures or artifacts into everyday work, but also an orientation to medication safety itself that is sometimes at odds with their own. This paper describes how the nurses' orientation (the Practice Frame) can collide with the orientation that is represented by the technology and its implementation (the System Frame), resulting in adaptations at the individual and organization levels. Methods: The paper draws on two qualitative research studies that examined the implementation of BCMA in inpatient settings using observation and ethnographic fieldwork, content analysis of email communications, and interviews with healthcare professionals. Results: Two frames of reference are described: the System Frame and the Practice Frame. We found collisions of these frames that prompted adaptations at the individual and organization levels. The System Frame was less integrated and flexible than the Practice Frame, less able to account for all of the dimensions of everyday patient care to which medication administration is tied. Conclusion: Collisions in frames during implementation of new technology result in adaptations at the individual and organization level that can have a variety of effects. We found adaptations to be a means of evolving both the work routines and the technology. Understanding the frames of clinical workers when new technology is being designed and implemented can inform changes to technology or organizational structure and policy that can preclude unproductive or unsafe adaptations. (C) 2013 Elsevier Ireland Ltd. All rights reserved.", "paper_title": "Using a sociotechnical framework to understand adaptations in health IT implementation", "paper_id": "WOS:000327531000002"}