{"auto_keywords": [{"score": 0.04212483992856429, "phrase": "cadd"}, {"score": 0.015719715351994536, "phrase": "dann"}, {"score": 0.010888253891176616, "phrase": "non-linear_relationships"}, {"score": 0.004569905085027681, "phrase": "genetic_variants"}, {"score": 0.004155742403177802, "phrase": "pathogenic_variants"}, {"score": 0.004058180509184539, "phrase": "combined_annotation-dependent_depletion"}, {"score": 0.003815064377019477, "phrase": "non-coding_variants"}, {"score": 0.0035864603175592854, "phrase": "linear_kernel_support_vector_machine"}, {"score": 0.003051073364818384, "phrase": "dann._dann"}, {"score": 0.002965229277927781, "phrase": "training_data"}, {"score": 0.002881793492919646, "phrase": "deep_neural_network"}, {"score": 0.0026077803487003, "phrase": "large_number"}, {"score": 0.0025103699913760057, "phrase": "compute_unified_device_architecture-compatible_graphics_processing_units"}, {"score": 0.0024051153560799335, "phrase": "momentum_training"}, {"score": 0.002359759876402679, "phrase": "dnn_training"}, {"score": 0.0022608057001451414, "phrase": "error_rate"}, {"score": 0.0021049977753042253, "phrase": "cadd's_svm_methodology"}], "paper_keywords": [""], "paper_abstract": "The Summary: Annotating genetic variants, especially non-coding variants, for the purpose of identifying pathogenic variants remains a challenge. Combined annotation-dependent depletion (CADD) is an algorithm designed to annotate both coding and non-coding variants, and has been shown to outperform other annotation algorithms. CADD trains a linear kernel support vector machine (SVM) to differentiate evolutionarily derived, likely benign, alleles from simulated, likely deleterious, variants. However, SVMs cannot capture non-linear relationships among the features, which can limit performance. To address this issue, we have developed DANN. DANN uses the same feature set and training data as CADD to train a deep neural network (DNN). DNNs can capture non-linear relationships among features and are better suited than SVMs for problems with a large number of samples and features. We exploit Compute Unified Device Architecture-compatible graphics processing units and deep learning techniques such as dropout and momentum training to accelerate the DNN training. DANN achieves about a 19% relative reduction in the error rate and about a 14% relative increase in the area under the curve (AUC) metric over CADD's SVM methodology.", "paper_title": "DANN: a deep learning approach for annotating the pathogenicity of genetic variants", "paper_id": "WOS:000352268500019"}