{"auto_keywords": [{"score": 0.04591009828177041, "phrase": "bmi"}, {"score": 0.013852115284045589, "phrase": "personalized_avatars"}, {"score": 0.0049579917567885235, "phrase": "checkerboard_texture"}, {"score": 0.004523380792307973, "phrase": "women's_sensitivity"}, {"score": 0.004421770937919324, "phrase": "body_mass_index"}, {"score": 0.004347057700479576, "phrase": "participants'_personalized_avatars"}, {"score": 0.004297948502679085, "phrase": "large-screen_immersive_display"}, {"score": 0.004153910878671754, "phrase": "participants'_body_geometry"}, {"score": 0.003803678911024785, "phrase": "body_geometry"}, {"score": 0.003782121164797319, "phrase": "anthropometric_measurements"}, {"score": 0.003739370148902094, "phrase": "statistical_body_shape_model"}, {"score": 0.0036866077729419784, "phrase": "body_scans"}, {"score": 0.003593497768069278, "phrase": "relative_importance"}, {"score": 0.0035731269727067496, "phrase": "visual_cues"}, {"score": 0.003502731108174352, "phrase": "average_female_body_shape"}, {"score": 0.002928236333640633, "phrase": "body_weight"}, {"score": 0.0027741761880779535, "phrase": "photo-realistic_texture"}, {"score": 0.0026507289852980512, "phrase": "participants'_current_weight"}, {"score": 0.002332133125576037, "phrase": "reported_similarity"}, {"score": 0.0023123057299992587, "phrase": "body_parts"}, {"score": 0.0022926465161639633, "phrase": "whole_avatar"}, {"score": 0.0022731540640627307, "phrase": "participant's_body"}, {"score": 0.0022283123058680658, "phrase": "new_measures"}, {"score": 0.00220308584949015, "phrase": "body_image_disorders"}, {"score": 0.002123051344001408, "phrase": "training_applications"}, {"score": 0.0021049977753042253, "phrase": "virtual_reality"}], "paper_keywords": ["Three-Dimensional Graphics and Realism", " Vision and Scene Understanding", " Body perception", " virtual environments", " human perception and performance", " visual psychophysics", " texture", " 3D shape", " BMI", " avatar"], "paper_abstract": "The goal of this research was to investigate women's sensitivity to changes in their perceived weight by altering the body mass index (BMI) of the participants' personalized avatars displayed on a large-screen immersive display. We created the personalized avatars with a full-body 3D scanner that records the participants' body geometry and texture. We altered the weight of the personalized avatars to produce changes in BMI while keeping height, arm length, and inseam fixed and exploited the correlation between body geometry and anthropometric measurements encapsulated in a statistical body shape model created from thousands of body scans. In a 2 x 2 psychophysical experiment, we investigated the relative importance of visual cues, namely shape (own shape vs. an average female body shape with equivalent height and BMI to the participant) and texture (own photorealistic texture or checkerboard pattern texture) on the ability to accurately perceive own current body weight (by asking the participant, \"Is it the same weight as you?\"). Our results indicate that shape (where height and BMI are fixed) had little effect on the perception of body weight. Interestingly, the participants perceived their body weight veridically when they saw their own photo-realistic texture. As compared to avatars with photo-realistic texture, the avatars with checkerboard texture needed to be significantly thinner in order to represent the participants' current weight. This suggests that in general the avatars with checkerboard texture appeared bigger. The range that the participants accepted as their own current weight was approximately a 0.83% to -6.05% BMI change tolerance range around their perceived weight. Both the shape and the texture had an effect on the reported similarity of the body parts and the whole avatar to the participant's body. This work has implications for new measures for patients with body image disorders, as well as researchers interested in creating personalized avatars for games, training applications, or virtual reality.", "paper_title": "Can I Recognize My Body's Weight? The Influence of Shape and Texture on the Perception of Self", "paper_id": "WOS:000345311700004"}