{"auto_keywords": [{"score": 0.03234880593169703, "phrase": "jl-uct"}, {"score": 0.011376203047241247, "phrase": "move_quality"}, {"score": 0.009411575405199511, "phrase": "heuristic_metrics"}, {"score": 0.0044424917428102445, "phrase": "jl_proof-number_search"}, {"score": 0.003995772867224968, "phrase": "opening_game"}, {"score": 0.003813669883040509, "phrase": "unsolved_positions"}, {"score": 0.0037178503842258087, "phrase": "book_construction"}, {"score": 0.0036090884921108086, "phrase": "current_article"}, {"score": 0.0035183910023550246, "phrase": "jl-pns"}, {"score": 0.00337224813954299, "phrase": "jl_upper_confidence_tree"}, {"score": 0.0031242709509664837, "phrase": "best_way"}, {"score": 0.0029565620771207003, "phrase": "candidate_move's_subtree"}, {"score": 0.002750721367040336, "phrase": "measurement_methods"}, {"score": 0.0026363807171515255, "phrase": "best_moves"}, {"score": 0.0025810006125483835, "phrase": "benchmark_positions"}, {"score": 0.0025591748412278174, "phrase": "experimental_results"}, {"score": 0.0025160740422447837, "phrase": "node_count_heuristic_metric"}, {"score": 0.0022434880661725493, "phrase": "competitive_play"}, {"score": 0.002196342933346204, "phrase": "node_count"}, {"score": 0.0021049977753042253, "phrase": "currently_proposed_heuristic_metrics"}], "paper_keywords": [""], "paper_abstract": "This article investigates the use of job-level (JL) algorithms for Connect6 opening book construction. In the past, JL proof-number search (JL-PNS) was successfully used to solve Connect6 positions. Using JL-PNS, many opening plays that lead to losses can be eliminated from consideration during the opening game. However, it is unclear how the information of unsolved positions can be exploited for opening book construction. For this issue, the current article first proposes four heuristic metrics when using JL-PNS to estimate move quality. The article then proposes a JL upper confidence tree (JL-UCT) algorithm and three heuristic metrics that work with JL-UCT. Of the three, the best way to estimate move quality for JL-UCT is the number of nodes in each candidate move's subtree. In order to compare the heuristic metrics among the two algorithms objectively, we proposed two kinds of measurement methods to analyze the suitability of these metrics when choosing best moves for a set of benchmark positions. Experimental results show that the node count heuristic metric for JL-UCT outperforms all other heuristic metrics, including the four for JL-PNS. We then verify the results by constructing three separate opening books using the top three performing heuristic metrics. Competitive play also shows that the node count heuristic metric for JL-UCT is most suitable among the currently proposed heuristic metrics for Connect6 opening book construction.", "paper_title": "JOB-LEVEL ALGORITHMS FOR CONNECT6 OPENING BOOK CONSTRUCTION", "paper_id": "WOS:000374428400004"}