{"auto_keywords": [{"score": 0.03448658350285726, "phrase": "application_domain"}, {"score": 0.00481495049065317, "phrase": "information_systems_development_methodologies"}, {"score": 0.004548253531664032, "phrase": "experimental_study"}, {"score": 0.004345525254560329, "phrase": "methodology_type"}, {"score": 0.004199406257273994, "phrase": "business_application"}, {"score": 0.003789763907758991, "phrase": "hypermedia_systems_development_methodologies"}, {"score": 0.0037042817107563785, "phrase": "conventional_software_engineering_methodologies"}, {"score": 0.003641433168173135, "phrase": "knowledge_work_processes"}, {"score": 0.0035390378585554547, "phrase": "hypermedia-intensive_business_applications"}, {"score": 0.003051073364818384, "phrase": "strong-typed_methodologies"}, {"score": 0.0030164423559955896, "phrase": "systems_design_projects"}, {"score": 0.0026452734009203764, "phrase": "resultant_information_system"}, {"score": 0.0024984517279573906, "phrase": "cognitive_elements"}, {"score": 0.0024281181691350085, "phrase": "systems_development"}, {"score": 0.0023329572140896237, "phrase": "cognitive_and_knowledge_aspects"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["knowledge management", " knowledge work", " software engineering", " systems design", " hypermedia"], "paper_abstract": "An experimental study was conducted to determine whether appropriately matching methodology type to the characteristics of the business application being developed resulted in more effective knowledge-work processes among team members. Specifically, the experiment compared the use of hypermedia systems development methodologies to that of conventional software engineering methodologies in enabling knowledge work processes during the development of hypermedia-intensive business applications. Results obtained indicate that there is value in effectively matching methodologies to application domain. Based on this finding, there is justification in employing strong-typed methodologies for systems design projects particularly in the cases where the application domain is quite specialized. Our results also suggest that Information Technology (IT) studies that assess methodology influences on the resultant Information System (IS) artifact need to include knowledge and/or cognitive elements and their related theories. Since systems development is knowledge intensive, inclusion of cognitive and knowledge aspects provide a more complete model of how methodologies influence the various aspects of the IS artifact. (c) 2004 Elsevier Inc. All rights reserved.", "paper_title": "The knowledge management efficacy of matching information systems development methodologies with application characteristics - an experimental study", "paper_id": "WOS:000235246300002"}