{"auto_keywords": [{"score": 0.049608640556431896, "phrase": "boundary_critique"}, {"score": 0.00481495049065317, "phrase": "organisational_agendas"}, {"score": 0.004674402456361649, "phrase": "societal_concerns"}, {"score": 0.0046437283535486545, "phrase": "information_systems_planning"}, {"score": 0.004537938301016805, "phrase": "information_society"}, {"score": 0.004290901837174206, "phrase": "information_and_communication_technologies"}, {"score": 0.004207223823498356, "phrase": "digital"}, {"score": 0.0037119497772861165, "phrase": "organisational_purposes"}, {"score": 0.003675437054650504, "phrase": "traditional_information_systems"}, {"score": 0.0034866619130264048, "phrase": "formal_organisations"}, {"score": 0.0033625148111740984, "phrase": "systems_approach"}, {"score": 0.003296665348248805, "phrase": "first_sight"}, {"score": 0.0032321012594688854, "phrase": "good_idea"}, {"score": 0.003086311260099341, "phrase": "organisational_concerns"}, {"score": 0.0028608962312791264, "phrase": "organisational_boundaries"}, {"score": 0.002777227714581881, "phrase": "critical_review"}, {"score": 0.002565850749422255, "phrase": "systems_theory"}, {"score": 0.002450039362463466, "phrase": "different_possible_boundaries"}, {"score": 0.002362715032126801, "phrase": "existing_systems_approaches"}, {"score": 0.0021049977753042253, "phrase": "colombian_university"}], "paper_keywords": ["boundary critique", " critical systems thinking", " digital divide", " information systems planning", " information society", " systems methodology", " soft systems methodology (SSM)", " TOP"], "paper_abstract": "As the development of the information society takes place worldwide, individuals, groups and organisations face the challenge of taking advantage of information and communication technologies (ICTs). 'Digital divides' are emerging: some sections of society are gaining access to information, knowledge and technologies while others are being excluded. There also seems to be an over-concentration on the use of ICTs for organisational purposes, with traditional information systems (IS) planning approaches largely ignoring the needs and concerns that people express outside formal organisations. One answer to this problem might be to adopt a systems approach to IS planning. At first sight this appears to be a good idea because of the aspiration of systems approaches to comprehensiveness, presumably looking beyond organisational concerns. However, a review of two popular systems methodologies employed in IS planning suggests that there is potential for their scope to be equally limited by organisational boundaries. There is a need to enhance the critical review of the boundaries of IS planning processes, enabling people to consider family, community and other concerns. In this paper, we use the systems theory of boundary critique to derive a set of questions to help practitioners reflect on different possible boundaries for IS planning exercises. These should be seen as complementary to existing systems approaches rather than as a replacement for them, enabling the latter to be practised more critically. We end by presenting our reflections on using these questions in the context of an IS planning project in a Colombian University.", "paper_title": "Beyond organisational agendas: using boundary critique to facilitate the inclusion of societal concerns in information systems planning", "paper_id": "WOS:000255261200004"}