{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "trust_negotiations"}, {"score": 0.04435131645219547, "phrase": "trust_negotiation_systems"}, {"score": 0.030983515430765943, "phrase": "trust_negotiation_requirements"}, {"score": 0.03059341740032241, "phrase": "disclosure_policies"}, {"score": 0.004768196060187511, "phrase": "ontology-based_approach"}, {"score": 0.004721893473387288, "phrase": "increasing_use"}, {"score": 0.004615587054831451, "phrase": "distributed_multiparty_interactions"}, {"score": 0.0045559136361908795, "phrase": "strong_real-time_requirements"}, {"score": 0.004395742407834023, "phrase": "attribute-based_digital_interactions"}, {"score": 0.004268872663579808, "phrase": "automated_trust_negotiation_systems"}, {"score": 0.004186325123152709, "phrase": "different_security_domains"}, {"score": 0.004132178452877669, "phrase": "protected_resources"}, {"score": 0.003772189804219758, "phrase": "sensitive_personal_information"}, {"score": 0.0031127040190005216, "phrase": "disclosure_sets"}, {"score": 0.002723409977992608, "phrase": "property-based_policies"}, {"score": 0.0025349467677077803, "phrase": "reference_ontology"}, {"score": 0.002477753633057247, "phrase": "trust_requirement"}, {"score": 0.0023826870912207303, "phrase": "trust_requirements"}, {"score": 0.0023441581629788347, "phrase": "semantics_relationships"}, {"score": 0.0021049977753042253, "phrase": "trust_negotiation"}], "paper_keywords": ["privacy", " trust negotiations", " ontology"], "paper_abstract": "The increasing use of Internet in a variety of distributed multiparty interactions and transactions with strong real-time requirements has pushed the search for solutions to the problem of attribute-based digital interactions. A promising solution today is represented by automated trust negotiation systems. Trust negotiation systems allow subjects in different security domains to securely exchange protected resources and services. These trust negotiation systems, however, by their nature, may represent a threat to privacy in that credentials, exchanged during negotiations, often contain sensitive personal information that may need to be selectively released. In this paper, we address the problem of preserving privacy in trust negotiations. We introduce the notion of privacy preserving disclosure, that is, a set that does not include attributes or credentials, or combinations of these, that may compromise privacy. To obtain privacy preserving disclosure sets, we propose two techniques based on the notions of substitution and generalization. We argue that formulating the trust negotiation requirements in terms of disclosure policies is often restrictive. To solve this problem, we show how trust negotiation requirements can be expressed as property-based policies that list the properties needed to obtain a given resource. To better address this issue, we introduce the notion of reference ontology, and formalize the notion of trust requirement. Additionally, we develop an approach to derive disclosure policies from trust requirements and formally state some semantics relationships (i.e., equivalence, stronger than) that may hold between policies. These relationships can be used by a credential requestor to reason about which disclosure policies he/she should use in a trust negotiation.", "paper_title": "Achieving privacy in trust negotiations with an ontology-based approach", "paper_id": "WOS:000235515200003"}