{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "disjointness_axioms"}, {"score": 0.030891471083329434, "phrase": "chemical_entities"}, {"score": 0.030591655132464837, "phrase": "biological_interest"}, {"score": 0.03000045515252848, "phrase": "semantic_similarity"}, {"score": 0.026810160293314064, "phrase": "shared_information_content"}, {"score": 0.02616157384532826, "phrase": "base_measure"}, {"score": 0.004743164872278112, "phrase": "semantic_similarity_measures"}, {"score": 0.004625881588444304, "phrase": "domain_knowledge"}, {"score": 0.0044219992735047954, "phrase": "simple_hierarchies"}, {"score": 0.004334280585565239, "phrase": "textual_annotations"}, {"score": 0.004248294537944227, "phrase": "expressive_ontology_languages"}, {"score": 0.004164007198843467, "phrase": "web_ontology_language"}, {"score": 0.00392100783796804, "phrase": "logical_relationships"}, {"score": 0.0035292625231068517, "phrase": "biological_ontologies"}, {"score": 0.003459191419478298, "phrase": "current_semantic_tools"}, {"score": 0.0030363332738004454, "phrase": "real-world_ontologies"}, {"score": 0.0029611289031152856, "phrase": "gene_ontology"}, {"score": 0.0023864566654035924, "phrase": "disjointness_information"}], "paper_keywords": [""], "paper_abstract": "Motivation: Representing domain knowledge in biology has traditionally been accomplished by creating simple hierarchies of classes with textual annotations. Recently, expressive ontology languages, such as Web Ontology Language, have become more widely adopted, supporting axioms that express logical relationships other than class-subclass, e. g. disjointness. This is improving the coverage and validity of the knowledge contained in biological ontologies. However, current semantic tools still need to adapt to this more expressive information. In this article, we propose a method to integrate disjointness axioms, which are being incorporated in real-world ontologies, such as the Gene Ontology and the chemical entities of biological interest ontology, into semantic similarity, the measure that estimates the closeness in meaning between classes. Results: We present a modification of the measure of shared information content, which extends the base measure to allow the incorporation of disjointness information. To evaluate our approach, we applied it to several randomly selected datasets extracted from the chemical entities of biological interest ontology. In 93.8% of these datasets, our measure performed better than the base measure of shared information content. This supports the idea that semantic similarity is more accurate if it extends beyond the hierarchy of classes of the ontology.", "paper_title": "Exploiting disjointness axioms to improve semantic similarity measures", "paper_id": "WOS:000325997500016"}