{"auto_keywords": [{"score": 0.04783182929351233, "phrase": "thin-client_computing"}, {"score": 0.00481495049065317, "phrase": "wide-area_thin-client_computing"}, {"score": 0.004523455475492876, "phrase": "computational_services"}, {"score": 0.004168618849008299, "phrase": "wide-area_network"}, {"score": 0.003934970057482768, "phrase": "future_commodity_high-bandwidth_internet_access"}, {"score": 0.0035399770257915466, "phrase": "computational_services_cross-country"}, {"score": 0.0033575566897536906, "phrase": "wide-area_network_environment"}, {"score": 0.0029203055813347874, "phrase": "thin-client_platforms"}, {"score": 0.0026395715432958665, "phrase": "network_latency"}, {"score": 0.0025892330566358503, "phrase": "key_factor"}, {"score": 0.0025521085778978042, "phrase": "wide-area_thin-client_performance"}, {"score": 0.0024088451312725924, "phrase": "bandwidth_efficiency"}, {"score": 0.00236289633510808, "phrase": "worse_overall_performance"}, {"score": 0.002340250894008014, "phrase": "wide-area_networks"}, {"score": 0.0022626835039082746, "phrase": "different_design_choices"}, {"score": 0.0021049977753042253, "phrase": "wide-area_computing_services"}], "paper_keywords": ["performance", " measurement", " experimentation", " algorithms", " thin-client", " wide-area networks", " Internet2", " slow-motion benchmarking"], "paper_abstract": "While many application service providers have proposed using thin-client computing to deliver computational services over the Internet, little work has been done to evaluate the effectiveness of thin-client computing in a wide-area network. To assess the potential of thin-client computing in the context of future commodity high-bandwidth Internet access, we have used a novel, noninvasive slow-motion benchmarking technique to evaluate the performance of several popular thin-client computing platforms in delivering computational services cross-country over Internet2. Our results show that using thin-client computing in a wide-area network environment can deliver acceptable performance over Internet2, even when client and server are located thousands of miles apart on opposite ends of the country. However, performance varies widely among thin-client platforms and not all platforms are suitable for this environment. While many thin-client systems are touted as being bandwidth efficient, we show that network latency is often the key factor in limiting wide-area thin-client performance. Furthermore, we show that the same techniques used to improve bandwidth efficiency often result in worse overall performance in wide-area networks. We characterize and analyze the different design choices in the various thin-client platforms and explain which of these choices should be selected for supporting wide-area computing services.", "paper_title": "On the performance of wide-area thin-client computing", "paper_id": "WOS:000237623400003"}