{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "order-k_alpha-hulls"}, {"score": 0.02325512380096147, "phrase": "order-k_voronoi_diagram"}, {"score": 0.00476697427418509, "phrase": "alpha-shapes_-_generalizations"}, {"score": 0.004312622975366672, "phrase": "k-depth_contour"}, {"score": 0.004060986196931943, "phrase": "shape_reconstruction"}, {"score": 0.004020492138367616, "phrase": "statistical_depth"}, {"score": 0.0036007478932719417, "phrase": "k_outliers"}, {"score": 0.0033905067962602515, "phrase": "\"inner\"_shape"}, {"score": 0.0028877818105020434, "phrase": "\"deep\"_points"}, {"score": 0.002816246391862638, "phrase": "multimodal_distribution"}, {"score": 0.0025219085140220773, "phrase": "order-k_voronoi_diagrams"}, {"score": 0.002362620540317279, "phrase": "voronoi_diagrams"}, {"score": 0.0021049977753042253, "phrase": "different_order-k_alpha-shapes"}], "paper_keywords": ["Computational geometry", " Statistical depth", " Shape reconstruction"], "paper_abstract": "We introduce order-k alpha-hulls and alpha-shapes - generalizations of alpha-hulls and alpha-shapes. Being also a generalization of k-hull (known in statistics as \"k-depth contour\"), order-k alpha-hull provides a link between shape reconstruction and statistical depth. As a generalization of alpha-hull, order-k alpha-hull gives a robust shape estimation by ignoring locally up to k outliers in a point set. Order-k alpha-shape produces an \"inner\" shape of the set, with the amount of \"digging\" into the points controlled by k. As a generalization of k-hull, order-k alpha-hull is capable of determining \"deep\" points amidst samples from a multimodal distribution: it correctly identifies points which lie outside clusters of samples. The order-k alpha-hulls and alpha-shapes are related to order-k Voronoi diagrams in the same way in which alpha-hulls and alpha-shapes are related to Voronoi diagrams. This implies that order-k alpha-hull and alpha-shape can be readily built from order-k Voronoi diagram, and that the number of different order-k alpha-shapes for all possible values of a is proportional to the complexity of order-k Voronoi diagram. (C) 2013 Elsevier BM. All rights reserved.", "paper_title": "Order-k alpha-hulls and alpha-shapes", "paper_id": "WOS:000328311800016"}