{"auto_keywords": [{"score": 0.04954276574546314, "phrase": "incomplete_fuzzy_preference_relations"}, {"score": 0.03779298833614491, "phrase": "consensus_model"}, {"score": 0.015719716506582538, "phrase": "group_decision"}, {"score": 0.014485609560573565, "phrase": "consensus_reaching_process"}, {"score": 0.013547304137037789, "phrase": "selection_process"}, {"score": 0.004620093797504386, "phrase": "group_decision_making_problems"}, {"score": 0.004334280585565239, "phrase": "final_solution"}, {"score": 0.004005410765048467, "phrase": "previous_paper"}, {"score": 0.003757480190200645, "phrase": "consistency_measures"}, {"score": 0.0035514484574435574, "phrase": "main_novelty"}, {"score": 0.003066945490483524, "phrase": "feedback_mechanism"}, {"score": 0.002833962854197749, "phrase": "high_consensus"}, {"score": 0.0025989960809479104, "phrase": "missing_values"}, {"score": 0.0024563302149829, "phrase": "weighted_averaging_operator"}, {"score": 0.0024196235355517827, "phrase": "experts'_preferences"}, {"score": 0.0023390219342052623, "phrase": "consensus_models"}, {"score": 0.002295406551990453, "phrase": "selection_processes"}, {"score": 0.0022696277881969896, "phrase": "main_improvements"}, {"score": 0.0021775526153883355, "phrase": "incomplete_information"}, {"score": 0.002128910637262527, "phrase": "consistent_solutions"}, {"score": 0.0021049977753042253, "phrase": "great_level"}], "paper_keywords": ["aggregation", " consensus", " fuzzy preference relations", " group decision making (GDM)"], "paper_abstract": "Two processes are necessary to solve group decision making problems: A consensus process and a selection process. The consensus reaching process is necessary to obtain a final solution with a certain level of agreement between the experts; and the selection process is necessary to obtain such a final solution. In a previous paper, we present a selection process to deal with group decision making problems with incomplete fuzzy preference relations, which uses consistency measures to estimate the incomplete fuzzy preference relations. In this paper we present a consensus model. The main novelty of this consensus model is that of being guided by both consensus and consistency measures. Also, the consensus reaching process is guided automatically, without moderator, through both consensus and consistency criteria. To do that, a feedback mechanism is developed to generate advice on how experts should change or complete their preferences in order to reach a solution with high consensus and consistency degrees. In each consensus round, experts are given information on how to change their preferences, and to estimate missing values if their corresponding preference relation is incomplete. Additionally, a consensus and consistency based induced ordered weighted averaging operator to aggregate the experts' preferences is introduced, which can be used in consensus models as well as in selection processes. The main improvements of this consensus model is that it supports the management of incomplete information and it allows to achieve consistent solutions with a great level of agreement.", "paper_title": "A consensus model for group decision making with incomplete fuzzy preference relations", "paper_id": "WOS:000250372100009"}