{"auto_keywords": [{"score": 0.04261955549208519, "phrase": "target_character"}, {"score": 0.014796647138419671, "phrase": "rc"}, {"score": 0.011259759917258121, "phrase": "rc_pattern"}, {"score": 0.00481495049065317, "phrase": "event-related_potential_eeg-based_brain-computer_interface"}, {"score": 0.004669869730078038, "phrase": "bci"}, {"score": 0.0042928648367867835, "phrase": "new_paradigmatic_approaches"}, {"score": 0.004260134699483774, "phrase": "flashing_characters"}, {"score": 0.004007083686875716, "phrase": "rc_presentation"}, {"score": 0.003221316290858497, "phrase": "selected_characters"}, {"score": 0.002949598537993663, "phrase": "rc_paradigm"}, {"score": 0.0028936226331006563, "phrase": "quasi-random_groups"}, {"score": 0.0025206783724309252, "phrase": "practical_bit_rate"}, {"score": 0.0025014259919355453, "phrase": "classification_accuracy"}, {"score": 0.002325689073229477, "phrase": "online_experiment"}, {"score": 0.0022990901047984197, "phrase": "offline_simulations"}, {"score": 0.0021049977753042253, "phrase": "best_presentation_paradigm"}], "paper_keywords": ["Brain-computer interface", " P300 event-related potential", " Flash pattern", " EEG"], "paper_abstract": "P300 brain-computer interface (BCI) systems typically use a row/column (RC) approach. This article presents a P300 BCI based on a 12 x 7 matrix and new paradigmatic approaches to flashing characters designed to decrease the number of flashes needed to identify a target character. Using an RC presentation, a 12 x 7 matrix requires 19 flashes to present all items twice (12 columns and seven rows) per trial. A 12 x 7 matrix contains 84 elements (characters). To identify a target character in 12 x 7 matrix using the RC pattern, 19 flashes (sub-trials) are necessary. In each flash, the selected characters (one column or one row in the RC pattern) are flashing. We present four new paradigms and compare the performance to the RC paradigm. These paradigms present quasi-random groups of characters using 9, 12, 14 and 16 flashes per trial to identify a target character. The 12-, 14- and 16-flash patterns were optimized so that the same character never flashed twice in succession. We assessed the practical bit rate and classification accuracy of the 9-, 12-, 14-, 16- and RC (19-flash) pattern conditions in an online experiment and with offline simulations. The results indicate that 16-flash pattern is better than other patterns and performance of an online P300 BCI can be significantly improved by selecting the best presentation paradigm for each subject.", "paper_title": "Optimized stimulus presentation patterns for an event-related potential EEG-based brain-computer interface", "paper_id": "WOS:000286835100006"}