{"auto_keywords": [{"score": 0.029385391876730057, "phrase": "dc_pairs"}, {"score": 0.020117326116875306, "phrase": "local_database"}, {"score": 0.010159425366694097, "phrase": "transaction_database"}, {"score": 0.009655109124028135, "phrase": "global_database"}, {"score": 0.009042977780582767, "phrase": "global_one"}, {"score": 0.007989784899661134, "phrase": "even_noncharacteristic_paired_itemsets"}, {"score": 0.00481495049065317, "phrase": "hidden_correlations"}, {"score": 0.004762435022350756, "phrase": "local_transaction_database"}, {"score": 0.004558012799538011, "phrase": "global_set"}, {"score": 0.004010342699414496, "phrase": "paired_itemsets"}, {"score": 0.003981106369547929, "phrase": "high_correlation"}, {"score": 0.003741016338085083, "phrase": "highly_correlated_itemsets"}, {"score": 0.002500662348528587, "phrase": "time_stamp_data"}, {"score": 0.0024284249875593253, "phrase": "large_databases"}, {"score": 0.0022239665922395104, "phrase": "pruning_rules"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["data mining", " correlation mining", " itemset pairs", " contrast sets", " time series"], "paper_abstract": "Given a transaction database as a global set of transactions and its local database obtained by some conditioning of the global database, we consider pairs of itemsets whose degrees of correlation are higher in the local database than in the global one. A problem of finding paired itemsets with high correlation in one database is already known as discovery of correlation, and has been studied as the highly correlated itemsets are characteristic in the database. However, even noncharacteristic paired itemsets are also meaningful provided the degree of correlation increases significantly in the local database compared with the global one. They can be implicit and hidden evidences showing that something particular to the local database occurs, even though they were not previously realized to be characteristic. From this viewpoint, we have proposed measurement of the significance of paired itemsets by the difference of two correlations before and after the conditioning of the global database, and have defined a notion of DC pairs, whose degrees of difference of correlation are high. In this paper, we develop an algorithm for mining DC pairs and apply it to a transaction database with time stamp data. The problem of finding DC pairs for large databases is computationally hard in general, as the algorithm has to check even noncharacteristic paired itemsets. However, we show that our algorithm equipped with some pruning rules works successfully to find DC pairs that may be significant. (C) 2006 Elsevier Ltd. All rights reserved.", "paper_title": "Discovery of hidden correlations in a local transaction database based on differences of correlations", "paper_id": "WOS:000237589100008"}