{"auto_keywords": [{"score": 0.034388262628228236, "phrase": "proposed_method"}, {"score": 0.02322730111336097, "phrase": "biometric_authentication"}, {"score": 0.007096672327740879, "phrase": "sequential_estimator"}, {"score": 0.005893379946664254, "phrase": "experimental_results"}, {"score": 0.004749824776508639, "phrase": "principal_challenge"}, {"score": 0.004397000006837371, "phrase": "biometric_template_generation"}, {"score": 0.0038194503801108324, "phrase": "underlying_assumptions"}, {"score": 0.0028944757265206332, "phrase": "subspace_technique"}, {"score": 0.0028422946420821075, "phrase": "computational_complexity"}, {"score": 0.002753224894944965, "phrase": "theoretical_foundation"}, {"score": 0.002548331088496964, "phrase": "experimental_evaluation"}, {"score": 0.002468450551616404, "phrase": "facial_images"}, {"score": 0.0023266779778306746, "phrase": "indian"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Biometric authentication", " Image subspace", " Kalman filter", " PCA", " Sequential estimator"], "paper_abstract": "The principal challenge in biometric authentication is to mitigate the effects of any interference while extracting the biometric features for biometric template generation. Most biometric systems are developed under the assumption that extracted biometrics and the nature of their associated interferences are linear, stationary, and homogeneous. The performance of biometric authentication deteriorates when the underlying assumptions are violated due to nonlinear, nonstationary, and heterogeneous noise. Therefore, a more sophisticated filtering method needs to be developed to deal with these challenges. In this paper, a new Sequential Subspace Estimator (SSE) algorithm for biometric authentication is proposed. In the proposed method, a sequential estimator is being designed in the image subspace which addresses the challenges due to nonlinear, nonstationary, and heterogeneous noise. Furthermore, the proposed method includes a subspace technique that overcomes the computational complexity associated with the sequential estimator. The theoretical foundation of the proposed method along with the experimental results is also presented in this paper. For the experimental evaluation of the proposed method, we use facial images from two public databases: the \"Put Face Database\" and the \"Indian Face Database\". The experimental results demonstrate the superiority of the proposed method in comparison with its counterparts. (C) 2014 Elsevier B.V. All rights reserved.", "paper_title": "Sequential Subspace Estimator for biometric authentication", "paper_id": "WOS:000343840000038"}