{"auto_keywords": [{"score": 0.007465567085823671, "phrase": "intermediate_state"}, {"score": 0.005819562266464303, "phrase": "low_ph."}, {"score": 0.00481495049065317, "phrase": "structural_changes"}, {"score": 0.0047026237903774895, "phrase": "molecular_dynamics_study"}, {"score": 0.0045160988337296605, "phrase": "alzheimer's_disease"}, {"score": 0.004351595642056769, "phrase": "acid-induced_denaturation"}, {"score": 0.004235717186207754, "phrase": "fluorescence_emission"}, {"score": 0.004207230913063179, "phrase": "synchronous_fluorescence"}, {"score": 0.003999578057088828, "phrase": "molecular_dynamics_simulations"}, {"score": 0.003959288961559545, "phrase": "wild_type"}, {"score": 0.003763827319426842, "phrase": "conformation_changes"}, {"score": 0.0031577303835881964, "phrase": "last_result"}, {"score": 0.003063180586734181, "phrase": "square_distance"}, {"score": 0.002921682548018944, "phrase": "solvent_accessible_surface_area_values"}, {"score": 0.0028246207858247732, "phrase": "tryptophan_residues"}, {"score": 0.0027492917990724467, "phrase": "acidic_states"}, {"score": 0.0025870463897472943, "phrase": "active_sites"}, {"score": 0.0023296961971785357, "phrase": "conformation_change"}, {"score": 0.002275214783528274, "phrase": "important_role"}, {"score": 0.002259883463607508, "phrase": "decreased_ph"}, {"score": 0.0021773853011112882, "phrase": "therapeutic_approach"}, {"score": 0.0021049977753042253, "phrase": "intracellular_ph_gradients"}], "paper_keywords": ["Acidic pH", " Molecular dynamics simulation", " Mutation", " Pin1"], "paper_abstract": "Pin1 protein is closely associated with the pathogenesis of cancers and Alzheimer's disease (AD). Previously, we have shown the acid-induced denaturation of Pin1 was determined by means of fluorescence emission, synchronous fluorescence etc., indicating an intermediate state around chromophores in Pin1 at about 4.0. Molecular dynamics simulations for the wild type Pin1 and its mutants were performed to explore the role of pH in the conformation changes of Pin1 protein. Our present study shows that one protein domain (PPIase domain) is more sensitive than the other one (WW domain) in Pin1 protein, and also our study shows that the integrality of the two conserve tryptophan in one domain (WW) is important in response to low pH. We arrive at the last result with the analysis of the protein root mean square distance and the analysis of the radius of gyration. The analysis of protein solvent accessible surface area values have proven our previous experiment result that there is an intermediate state around tryptophan residues at about pH 4.0. Moreover, acidic states of the protein can break the alpha-helixes in Pin1, especially the alpha-helix alpha 3 close to active sites; as a result, Pin1 loses most of its activity at low pH. The results help us to understand the role of pH in Pin1, provide us insights into the conformation change at the atomic-level and emphasize the important role of decreased pH in the pathogenesis of some Pin1-related diseases, and support the therapeutic approach for the related Pin1 diseases by targeting acidosis and modifying the intracellular pH gradients.", "paper_title": "Role of pH in structural changes for Pin1 protein: an insight from molecular dynamics study", "paper_id": "WOS:000340869400041"}