{"auto_keywords": [{"score": 0.04977091681870775, "phrase": "principal_covariates_regression"}, {"score": 0.04431003965673532, "phrase": "pca"}, {"score": 0.00481495049065317, "phrase": "weighting_parameter_value"}, {"score": 0.004755279364266046, "phrase": "ordinary_linear_regression"}, {"score": 0.004290262018446916, "phrase": "main_ideas"}, {"score": 0.004263581204982932, "phrase": "principal_component_analysis"}, {"score": 0.004132635240234246, "phrase": "pcovr"}, {"score": 0.003625009798162227, "phrase": "weighted_sum"}, {"score": 0.0035912243639260846, "phrase": "reduction_error"}, {"score": 0.003557752688779838, "phrase": "prediction_error"}, {"score": 0.0034700069041302003, "phrase": "parameter_alpha"}, {"score": 0.0032906426750021153, "phrase": "scattered_findings"}, {"score": 0.0031894825360137694, "phrase": "alpha_value"}, {"score": 0.0031696255948160923, "phrase": "optimal_in_which_respect"}, {"score": 0.0030340353187232947, "phrase": "obtained_results"}, {"score": 0.0028325548627901004, "phrase": "extensive_simulation_study"}, {"score": 0.0027283383611597495, "phrase": "underlying_parameters"}, {"score": 0.00260342914245402, "phrase": "specific_dataset"}, {"score": 0.002212951892867028, "phrase": "predictor_variables"}, {"score": 0.002158301441463052, "phrase": "moderate_to_high_amount"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Principal Covariates Regression", " Regression models", " Dimension reduction", " Weighting"], "paper_abstract": "Ordinary linear regression falls short when many predictors are available, especially when some of these are highly correlated with (a linear combination of) other predictors. One possible solution for this problem is Principal Covariates Regression (PCovR) which combines the main ideas behind Principal Component Analysis (PCA) and regression. Like PCA, PCovR reduces the predictors to a few components and, like regression, it predicts the criterion, but using the components as predictors. The reduction of the predictors and the prediction of the criterion are conducted simultaneously, by minimizing the weighted sum of the reduction error and the prediction error. How the value of the weighting parameter alpha can be optimally tuned, is not so obvious however. In this paper we integrate scattered findings on this topic and derive some hypotheses on which alpha value is optimal in which respect and on the importance of tuning the value (how robust are the obtained results for the value that is chosen for alpha?). We put these hypotheses to the test by performing an extensive simulation study. As predicted, the a value that optimizes recovery of the underlying parameters and true criterion scores depends among others on the number of predictors in a specific dataset and on the ratio of the amount of error on the predictors and the amount of error on the criterion. Moreover, we show that alpha is mostly of influence when the components strongly differ in strength and relevance, when the number of observations almost equals the number of predictor variables, or when the criterion contains a moderate to high amount of error. (C) 2013 Elsevier B.V. All rights reserved.", "paper_title": "On the selection of the weighting parameter value in Principal Covariates Regression", "paper_id": "WOS:000317451000005"}