{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "computer_graphics"}, {"score": 0.004768378525561471, "phrase": "visualization_software"}, {"score": 0.004653900688892822, "phrase": "new_computer_graphics_or_visualization_software_project"}, {"score": 0.004222707054751191, "phrase": "third-party_software"}, {"score": 0.004121275290411653, "phrase": "visualization_applications"}, {"score": 0.003925633992809873, "phrase": "existing_software_libraries"}, {"score": 0.003278878522165815, "phrase": "side-by-side_comparison"}, {"score": 0.0029747068066512915, "phrase": "hoops"}, {"score": 0.0026986685585382347, "phrase": "benchmark_application"}, {"score": 0.0026337482179592422, "phrase": "technical_support"}, {"score": 0.0023091735619578217, "phrase": "vtk"}, {"score": 0.0021049977753042253, "phrase": "john_wiley"}], "paper_keywords": ["computer graphics software", " visualization software", " graphics API", " visualization API"], "paper_abstract": "When starting a new computer graphics or visualization software project, students, researchers, and businesses alike must decide whether or not to start from scratch or with third-party software. Since computer graphics and visualization applications are typically quite large, developers often build upon existing software libraries in order to take advantage of the tens of thousands of hours worth of development and testing already invested. Thus, developers and managers must face the decision of which library to build on. We present a side-by-side comparison and evaluation of four popular, state-of-the-art visualization and computer graphics libraries, namely the Visualization Toolkit (VTK), Open Inventor, Coin3D, and Hoops 31). The evaluation is based on the feature set, ease of installation, development of a benchmark application, documentation, and technical support for each package. The results of our comparison and evaluation are described and recommendations are given as for whom the libraries are best suited. The VTK prevails on top in many of the aspects we compared and evaluated. Copyright (C) 2007 John Wiley & Sons, Ltd.", "paper_title": "Comparing and evaluating computer graphics and visualization software", "paper_id": "WOS:000255817600003"}