{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "compositional_data_analysis"}, {"score": 0.01249520370363589, "phrase": "case_studies"}, {"score": 0.004655924035639928, "phrase": "numerous_contributions"}, {"score": 0.004563028873351776, "phrase": "theoretical_and_practical_aspects"}, {"score": 0.004382737590042589, "phrase": "last_thirty_years"}, {"score": 0.004280861452668641, "phrase": "scientific_papers"}, {"score": 0.0042521895049768875, "phrase": "international_journals"}, {"score": 0.003975781274672803, "phrase": "incorrect_choice"}, {"score": 0.003935892934907777, "phrase": "sample_space"}, {"score": 0.003558294449586273, "phrase": "geochemical_processes"}, {"score": 0.003487222504700868, "phrase": "gaseous_samples"}, {"score": 0.00300749708357049, "phrase": "expected_differences"}, {"score": 0.002821247621250663, "phrase": "constrained_space"}, {"score": 0.0025761937402886954, "phrase": "unconscious_choice"}, {"score": 0.0025503112711036994, "phrase": "classical_approach"}, {"score": 0.0023287359930308864, "phrase": "proposed_question"}, {"score": 0.0022215160785078797, "phrase": "simple_tools"}, {"score": 0.0021844290159501313, "phrase": "different_degrees"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Compositional data analysis", " Geochemistry", " Worldwide lithology", " River chemistry", " Volcanic gases", " Isometric log-ratio transformation"], "paper_abstract": "Notwithstanding the numerous contributions that have been published on theoretical and practical aspects of the management of compositional (constrained) data during the last thirty years, in geochemistry most of the scientific papers in international journals continue to ignore their peculiar features. In order to understand the reasons of the undervaluation of the effects of an incorrect choice of the sample space and, consequently, an incorrect application of the distance concept, case studies of comparison between methodologies will be presented and discussed. The aim is to evaluate the differences in interpretation of geochemical processes affecting rocks, water and gaseous samples, when the two different approaches, classical and compositional, are adopted. If we compare the results of case studies following the two paths it is possible to evaluate which type of error (and consequences) will affect our evaluations in geochemistry. The presence of expected differences between the two approaches indicates that compositional data analysis can be a way to see beyond the illusion due to the constrained space. However, the possibility that the difference is tenuous in some situations, not revealed a priori, may be at the origin of the unconscious choice of the classical approach. Is this condition which some researchers call \"common sense\" frequently encountered in geochemistry? The paper is aimed to try to answer the proposed question, and to understand the difficulty of diffusion of compositional data analysis even if now simple tools of investigation, for different degrees of knowledge, are available. (C) 2012 Elsevier Ltd. All rights reserved.", "paper_title": "Is compositional data analysis a way to see beyond the illusion?", "paper_id": "WOS:000313611100018"}