{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "web-based_learning"}, {"score": 0.017477403822638498, "phrase": "students'_conceptions"}, {"score": 0.004687645903373103, "phrase": "college_students"}, {"score": 0.0038338299812503, "phrase": "web-based_learning_experiences"}, {"score": 0.0034283921404628975, "phrase": "phenomenographic_method"}, {"score": 0.003382704886584695, "phrase": "student_interview_transcripts"}, {"score": 0.0031490944606172152, "phrase": "interview_results"}, {"score": 0.0028411768240129585, "phrase": "web-based_context"}, {"score": 0.0028032928749970026, "phrase": "real_understanding"}, {"score": 0.002741269087816162, "phrase": "new_way"}, {"score": 0.002574788013427524, "phrase": "web-based_instruction"}, {"score": 0.0025291018422967083, "phrase": "potential_avenue"}, {"score": 0.0024292428060702803, "phrase": "questionnaire_responses"}, {"score": 0.002221192647477371, "phrase": "better_searching_strategies"}, {"score": 0.002181766829493483, "phrase": "higher_self-efficacy"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Post-secondary education", " Distance education and telelearning"], "paper_abstract": "Past research has shown the variations of students' conceptions of learning, but little has been especially undertaken to address students' conceptions of web-based learning and to make comparisons between students' conceptions of learning in general and their conceptions of web-based learning in particular. By interviewing 83 Taiwanese college students with some web-based learning experiences, this study attempted to investigate the students' conceptions of learning, conceptions of web-based learning, and the differences between these conceptions. Using the phenomenographic method of analyzing student interview transcripts, several categories of conceptions of learning and of web-based learning were revealed. The analyses of interview results suggested that the conceptions of web-based learning were often more sophisticated than those of learning. For example, much more students conceptualized learning in web-based context as pursuing real understanding and seeing in a new way than those for learning in general. This implies that the implementation of web-based instruction may be a potential avenue for promoting students' conceptions of learning. By gathering questionnaire responses from the students, this study further found that the sophistication of the conceptions toward web-based learning was associated with better searching strategies as well as higher self-efficacy for web-based learning. (C) 2009 Elsevier Ltd. All rights reserved.", "paper_title": "Conceptions of learning versus conceptions of web-based learning: The differences revealed by college students", "paper_id": "WOS:000271297200009"}