{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "preferential_attachment"}, {"score": 0.009084295187278525, "phrase": "random_action"}, {"score": 0.004696608876994947, "phrase": "scientific_collaboration_networks"}, {"score": 0.0044685410845412745, "phrase": "network_evolution"}, {"score": 0.004126349202545883, "phrase": "scholarly_collaboration_network"}, {"score": 0.0040048667115255, "phrase": "new_scholar"}, {"score": 0.0038102613924627647, "phrase": "first_collaborator"}, {"score": 0.003716520760680603, "phrase": "available_scholars"}, {"score": 0.0036250779580069455, "phrase": "new_scholars"}, {"score": 0.003281186608301359, "phrase": "similar_specialty_interests"}, {"score": 0.002984665318717504, "phrase": "constrained_acceptance"}, {"score": 0.002955050521440921, "phrase": "active_choice"}, {"score": 0.0024941578231560055, "phrase": "collaboration_networks"}, {"score": 0.002223770196464436, "phrase": "dominant_force"}, {"score": 0.0021049977753042253, "phrase": "evolution_process"}], "paper_keywords": ["Constrained acceptance", " active choice", " random action", " institutional homophily", " specialty homophily"], "paper_abstract": "Homophily and preferential attachment are among the most recognized mechanisms of network evolution. Instead of examining the two mechanisms separately, this study considers them jointly in a scholarly collaboration network. Specifically, when a new scholar enters a field, how does he/she choose the first collaborator from the pool of available scholars? We find that new scholars tend to collaborate with someone who works in the same institution (which is called constrained acceptance), shares similar specialty interests (active choice), or has already worked with many collaborators (random action). We view constrained acceptance and active choice as supporting evidence for homophily (because similarity is attractive) and random action as supporting evidence for preferential attachment (because popularity is attractive). As such, both homophily and preferential attachment affect the evolution of collaboration networks. Furthermore, the influences vary over time with random action, constrained acceptance, and active choice taking turns to act the dominant force at the beginning, middle and later phases of the evolution process, respectively.", "paper_title": "Homophily versus preferential attachment: Evolutionary mechanisms of scientific collaboration networks", "paper_id": "WOS:000332860600014"}