{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "nmr_metabolomic_data_sets"}, {"score": 0.004518442937844318, "phrase": "graphical_and_statistical_tools"}, {"score": 0.004415189385015778, "phrase": "r_free_software_environment"}, {"score": 0.004339293854115301, "phrase": "metabolomic_data_sets"}, {"score": 0.00402514392911723, "phrase": "latest_releases"}, {"score": 0.0037989951856280423, "phrase": "interactive_facilities"}, {"score": 0.0036063061558261546, "phrase": "excel_data_files"}, {"score": 0.003523822585025555, "phrase": "graphical_and_numerical_outputs"}, {"score": 0.002877769867854964, "phrase": "murine_model"}, {"score": 0.0028446460307503343, "phrase": "alzheimer's_disease"}, {"score": 0.002518989593177879, "phrase": "simple_correlation_study"}, {"score": 0.0023228223366301226, "phrase": "ad_hoc_graphical_representations"}], "paper_keywords": ["Metabolomic", " NMR", " Graphical and statistical tools"], "paper_abstract": "We describe herein the implementation of graphical and statistical tools developed in the R free software environment to explore metabolomic data sets. This toolbox, available upon request from the authors for the latest releases, includes univariate, bivariate and multivariate existing approaches accompanied with various graphical displays and interactive facilities. Concretely, very basic knowledge in R is required: from Excel data files as input to graphical and numerical outputs the user is led through a set of questions he only has to answer. We illustrate the potential of the toolbox on a data set coming from a H-1 NMR metabolomic study of cerebellums from a murine model of Alzheimer's disease. We show the complementarity of various graphical techniques in order to provide information easier to interpret. In particular, a simple correlation study can be highly meaningful, and competitive with a more sophisticated multivariate analysis, when using ad hoc graphical representations depending on the level of interest: global, multiple or single metabolite focus. (C) 2013 Elsevier B.V. All rights reserved.", "paper_title": "A toolbox to explore NMR metabolomic data sets using the R environment", "paper_id": "WOS:000321680700007"}