{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "conformal_prediction"}, {"score": 0.005434109389315137, "phrase": "successive_examples"}, {"score": 0.004681653551412616, "phrase": "precise_levels"}, {"score": 0.004607139608615063, "phrase": "new_predictions"}, {"score": 0.004533806239310673, "phrase": "error_probability_e"}, {"score": 0.004234884779773412, "phrase": "label_y"}, {"score": 0.0033417571465258, "phrase": "on-line_setting"}, {"score": 0.002880196765572443, "phrase": "successive_predictions"}, {"score": 0.002711714675297321, "phrase": "accumulating_data_set"}, {"score": 0.002668470532683947, "phrase": "independent_data_sets"}, {"score": 0.002442634456448208, "phrase": "widely_used_gaussian_linear_model"}, {"score": 0.0023463854193479274, "phrase": "self-contained_account"}, {"score": 0.0021738146596180404, "phrase": "algorithmic_learning_in_a_random_world"}, {"score": 0.002147749117443578, "phrase": "vladimir_vovk"}, {"score": 0.002130545585846588, "phrase": "alex_gammerman"}, {"score": 0.0021049977753042253, "phrase": "glenn_shafer"}], "paper_keywords": ["confidence", " on-line compression modeling", " on-line learning", " prediction regions"], "paper_abstract": "Conformal prediction uses past experience to determine precise levels of confidence in new predictions. Given an error probability e, together with a method that makes a prediction (y) over bar of a label y, it produces a set of labels, typically containing (y) over bar, that also contains y with probability 1-epsilon. Conformal prediction can be applied to any method for producing (y) over bar: a nearest-neighbor method, a support-vector machine, ridge regression, etc. Conformal prediction is designed for an on-line setting in which labels are predicted successively, each one being revealed before the next is predicted. The most novel and valuable feature of conformal prediction is that if the successive examples are sampled independently from the same distribution, then the successive predictions will be right 1 - epsilon of the time, even though they are based on an accumulating data set rather than on independent data sets. In addition to the model under which successive examples are sampled independently, other on-line compression models can also use conformal prediction. The widely used Gaussian linear model is one of these. This tutorial presents a self-contained account of the theory of conformal prediction and works through several numerical examples. A more comprehensive treatment of the topic is provided in Algorithmic Learning in a Random World, by Vladimir Vovk, Alex Gammerman, and Glenn Shafer (Springer, 2005).", "paper_title": "A tutorial on conformal prediction", "paper_id": "WOS:000256642000002"}