{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "ngs_reads"}, {"score": 0.004411406624893529, "phrase": "environmental_dna_sequencing"}, {"score": 0.004304574865291508, "phrase": "different_unknown_species"}, {"score": 0.004055730085399621, "phrase": "crucial_step"}, {"score": 0.003971367134498762, "phrase": "binning_problem"}, {"score": 0.00379452936798156, "phrase": "reference_genomes"}, {"score": 0.0036128527616772848, "phrase": "short_ngs"}, {"score": 0.0033213460816510685, "phrase": "existing_binning_tools"}, {"score": 0.0031182092708983184, "phrase": "reasonable_performance"}, {"score": 0.00268168157806506, "phrase": "varying_abundance_ratios"}, {"score": 0.002422249273477746, "phrase": "probabilistic_approach"}, {"score": 0.002195552442011313, "phrase": "large_number"}, {"score": 0.0021422669204408263, "phrase": "meta_cluster"}], "paper_keywords": ["binning", " environmental genomics", " metagenomics"], "paper_abstract": "Next-generation sequencing (NGS) technologies allow the sequencing of microbial communities directly from the environment without prior culturing. The output of environmental DNA sequencing consists of many reads from genomes of different unknown species, making the clustering together reads from the same (or similar) species (also known as binning) a crucial step. The difficulties of the binning problem are due to the following four factors: (1) the lack of reference genomes; (2) uneven abundance ratio of species; (3) short NGS reads; and (4) a large number of species (can be more than a hundred). None of the existing binning tools can handle all four factors. No tools, including both AbundanceBin and MetaCluster 3.0, have demonstrated reasonable performance on a sample with more than 20 species. In this article, we introduce MetaCluster 4.0, an unsupervised binning algorithm that can accurately (with about 80% precision and sensitivity in all cases and at least 90% in some cases) and efficiently bin short reads with varying abundance ratios and is able to handle datasets with 100 species. The novelty of MetaCluster 4.0 stems from solving a few important problems: how to divide reads into groups by a probabilistic approach, how to estimate the 4-mer distribution of each group, how to estimate the number of species, and how to modify MetaCluster 3.0 to handle a large number of species. We show that Meta Cluster 4.0 is effective for both simulated and real datasets. Supplementary Material is available at www.liebertonline.com/cmb.", "paper_title": "MetaCluster 4.0: A Novel Binning Algorithm for NGS Reads and Huge Number of Species", "paper_id": "WOS:000300041600012"}