{"auto_keywords": [{"score": 0.04954211220392359, "phrase": "aggregating_methods"}, {"score": 0.04866123955228176, "phrase": "triangular_intuitionistic"}, {"score": 0.04831370608356702, "phrase": "choquet"}, {"score": 0.015430346986648358, "phrase": "multiple_attribute_group_decision"}, {"score": 0.01184686607475309, "phrase": "tifns"}, {"score": 0.010954239351869696, "phrase": "tifcg"}, {"score": 0.00888628618660619, "phrase": "magdm"}, {"score": 0.008689090090968955, "phrase": "propose_method"}, {"score": 0.00481495049065317, "phrase": "attitudinal_ranking"}, {"score": 0.0045855181084455444, "phrase": "purpose_-_the_purpose"}, {"score": 0.004466519142879166, "phrase": "novel_attitudinal_prioritization"}, {"score": 0.0035381202759091784, "phrase": "expert's_attitudinal_character"}, {"score": 0.003485304124598714, "phrase": "ranking_order"}, {"score": 0.003113441660343867, "phrase": "tifcg_operator"}, {"score": 0.003043957650600757, "phrase": "correlative_attribute_value"}, {"score": 0.002976019715894587, "phrase": "i-tifcg_operator"}, {"score": 0.0027602925235474317, "phrase": "tifcg_and_i-tifcg_operators-based_approach"}, {"score": 0.0025989960809479104, "phrase": "investment_projects"}, {"score": 0.0022781884538102264, "phrase": "correlated_attribute"}, {"score": 0.0021940118003312397, "phrase": "attitudinal_expected_score_functions"}, {"score": 0.002128910637262527, "phrase": "decision_maker's_risk_attitude"}, {"score": 0.0021049977753042253, "phrase": "final_decision_result"}], "paper_keywords": ["Decision making", " Operational research"], "paper_abstract": "Purpose - The purpose of this paper is to propose novel attitudinal prioritization and correlated aggregating methods for multiple attribute group decision making (MAGDM) with triangular intuitionistic fuzzy Choquet integral. Design/methodology/approach - Based on the continuous ordered weighted average (COWA) operator, the triangular fuzzy COWA (TF-COWA) operator is defined, and then a novel attitudinal expected score function for triangular intuitionistic fuzzy numbers (TIFNs) is investigated. The novelty of this function is that it allows the prioritization of TIFNs by taking account of the expert's attitudinal character. When the ranking order of TIFNs is determined, the triangular intuitionistic fuzzy correlated geometric (TIFCG) operator and the induced TIFCG (I-TIFCG) operator are developed. Findings - Their use is twofold: first, the TIFCG operator is used to aggregate the correlative attribute value; and second, the I-TIFCG operator is designed to aggregate the preferences of experts with some degree of inter-dependent. Then, a TIFCG and I-TIFCG operators-based approach is presented for correlative MAGDM problems. Finally, the propose method is applied to select investment projects. Originality/value - Based on the TIFCG and I-TIFCG operators, this paper proposes a novel correlated aggregating methods for MAGDM with triangular intuitionistic fuzzy Choquet integral. This method helps to solve the correlated attribute (criteria) relationship. Furthermore, by the attitudinal expected score functions of TIFNs, the propose method can reflect decision maker's risk attitude in the final decision result.", "paper_title": "Attitudinal ranking and correlated aggregating methods for multiple attribute group decision making with triangular intuitionistic fuzzy Choquet integral", "paper_id": "WOS:000366638800002"}