{"auto_keywords": [{"score": 0.034824712532310655, "phrase": "non-internet_shoppers"}, {"score": 0.02322730111336098, "phrase": "internet_shopping"}, {"score": 0.022996235787019963, "phrase": "korea"}, {"score": 0.009935265766070723, "phrase": "internet_users"}, {"score": 0.008445366163706548, "phrase": "internet_shopping_markets"}, {"score": 0.007362169183014305, "phrase": "internet_shoppers"}, {"score": 0.004669845451682529, "phrase": "consumer_lifestyle_approach"}, {"score": 0.004552255360140208, "phrase": "rapid_increase"}, {"score": 0.004460309246062286, "phrase": "internet_shopping_malls"}, {"score": 0.004216880725292, "phrase": "structural_vulnerability"}, {"score": 0.004007083686875716, "phrase": "korea_use_internet_shopping_malls"}, {"score": 0.0028459677232555176, "phrase": "relatively_high_incomes"}, {"score": 0.002284444272376043, "phrase": "credit_cards"}, {"score": 0.002126635713519053, "phrase": "detail_strategies"}, {"score": 0.0021049977753042253, "phrase": "internet_shopping_mall_businesses"}], "paper_keywords": ["internet shopper", " consumer lifestyle", " customer value", " chi-square automatic interaction detection (CHAID)", " segmentation"], "paper_abstract": "Due to the rapid increase of internet users, internet shopping malls in Korea are growing at a very rapid rate, though a structural vulnerability is also being revealed. About 55.8% of internet users in Korea use internet shopping malls. Therefore, to enlarge the sizes of internet shopping markets, it is paramount to attract shoppers who do not currently shop on the internet. In this regard, this study analysed the characteristics of internet shoppers and non-internet shoppers from diverse aspects based on surveys conducted on 4298 subjects residing across Korea, using 28 consumer lifestyle measurement items. The results of the analysis indicated that non-internet shoppers are married, earning relatively high incomes, and have little experience in accessing the internet. A Chi-square Automatic Interaction Detection (CHAID) analysis was conducted, and the result indicated that internet shoppers pursued the product/service information from internet shopping, but non-internet shoppers did not want to use credit cards during internet shopping. Based on the above mentioned study results, it was attempted to present detail strategies for internet shopping mall businesses to attract non-internet shoppers to internet shopping markets.", "paper_title": "Why don't consumers go internet shopping in Korea? Segmentation of consumer lifestyle approach", "paper_id": "WOS:000318279400005"}