{"auto_keywords": [{"score": 0.048068785010855715, "phrase": "cad_models"}, {"score": 0.00481495049065317, "phrase": "automatic_comparison"}, {"score": 0.004722038375317162, "phrase": "cad_model_modification"}, {"score": 0.0045415338200109345, "phrase": "product_development_processes"}, {"score": 0.004402088928254543, "phrase": "manufacturing_cycle"}, {"score": 0.0043509032299218955, "phrase": "new_product"}, {"score": 0.004087756756529841, "phrase": "existing_designs"}, {"score": 0.004024485331377682, "phrase": "engineering_data"}, {"score": 0.0036791522245326514, "phrase": "existing_cad_models"}, {"score": 0.0035660913513115267, "phrase": "shape_descriptors"}, {"score": 0.0035108659422301985, "phrase": "specific_focus"}, {"score": 0.0034564928013639125, "phrase": "affine_transformations"}, {"score": 0.0030269369940823902, "phrase": "great_practical_interest"}, {"score": 0.0028325548627901004, "phrase": "new_shape_descriptors"}, {"score": 0.0027134630181926854, "phrase": "vector-based_representations"}, {"score": 0.002589251170919722, "phrase": "cad"}, {"score": 0.002470676601347937, "phrase": "specific_context"}, {"score": 0.0024514505056251316, "phrase": "automatic_remeshing"}, {"score": 0.0024040357029838774, "phrase": "initial_purpose"}, {"score": 0.00228499525153, "phrase": "vector-based_representation"}, {"score": 0.002154930852763048, "phrase": "powerful_and_efficient_cad_model_comparison_tools"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["BREP", " Shape matching", " Shape assessment", " Vector-based representation", " Remeshing"], "paper_abstract": "Automatically detecting modifications between CAD models has many potential applications in product development processes. Tracing modifications throughout the design and manufacturing cycle of a new product, based on CAD/CAM/CAE tools, is one of these applications. Easily retrieving and reusing existing designs, along with engineering data associated, is another very interesting perspective. In this direction, several methods have been proposed, aimed at the quantification of similarity between existing CAD models. These methods are based on using shape descriptors, with a specific focus on invariance to affine transformations. However, these methods are dedicated to discriminating, clustering and retrieving CAD models, and not to accurately identifying and locating differences between models. Such an automatic identification of differences between CAD models is of great practical interest for many applications but making it invariant to affine transformations is very complex. This paper proposes new shape descriptors that are focused on this invariance. These descriptors use vector-based representations of geometry, which can be successfully applied for accurate, local and automatic comparisons between CAD models. The potential of these descriptors is illustrated in the specific context of automatic remeshing, which is the initial purpose for which they have been designed. The result demonstrates that this vector-based representation of geometry can contribute, possibly in conjunction with other shape descriptors, to setting up powerful and efficient CAD model comparison tools. (C) 2011 Elsevier Ltd. All rights reserved.", "paper_title": "Automatic comparison and remeshing applied to CAD model modification", "paper_id": "WOS:000299134900002"}