{"auto_keywords": [{"score": 0.041785145698431454, "phrase": "personal_data"}, {"score": 0.00481495049065317, "phrase": "autonomous_agents"}, {"score": 0.004459334186889869, "phrase": "agent_interactions"}, {"score": 0.004154332348800334, "phrase": "self-disclosure_decision-making"}, {"score": 0.0037797419108291227, "phrase": "current_self-disclosure_decision-making_mechanisms"}, {"score": 0.003626626504149897, "phrase": "privacy_loss"}, {"score": 0.003338690782620756, "phrase": "direct_benefit"}, {"score": 0.0030554300179552415, "phrase": "human_relationships"}, {"score": 0.0028800314406625996, "phrase": "crucial_role"}, {"score": 0.0027146742941153443, "phrase": "self-disclosure_decision-making_mechanisms"}, {"score": 0.002573965014439041, "phrase": "personal_information"}, {"score": 0.0023139986108451967, "phrase": "decision-making_mechanisms"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Multi-agent systems", " Privacy", " Intimacy", " Information theory"], "paper_abstract": "Autonomous agents may encapsulate their principals' personal data attributes. These attributes may be disclosed to other agents during agent interactions, producing a loss of privacy. Thus, agents need self-disclosure decision-making mechanisms to autonomously decide whether disclosing personal data attributes to other agents is acceptable or not. Current self-disclosure decision-making mechanisms consider the direct benefit and the privacy loss of disclosing an attribute. However, there are many situations in which the direct benefit of disclosing an attribute is a priori unknown. This is the case in human relationships, where the disclosure of personal data attributes plays a crucial role in their development. In this paper, we present self-disclosure decision-making mechanisms based on psychological findings regarding how humans disclose personal information in the building of their relationships. We experimentally demonstrate that, in most situations, agents following these decision-making mechanisms lose less privacy than agents that do not use them. (C) 2012 Elsevier Inc. All rights reserved.", "paper_title": "Self-disclosure decision making based on intimacy and privacy", "paper_id": "WOS:000307326900007"}