{"auto_keywords": [{"score": 0.0492360740810728, "phrase": "spectrum-based_fault_localization"}, {"score": 0.046589999590279395, "phrase": "risk_evaluation_formulas"}, {"score": 0.04541485776191827, "phrase": "empirical_approach"}, {"score": 0.04187714396259637, "phrase": "sbfl."}, {"score": 0.03746094921310433, "phrase": "theoretical_investigation"}, {"score": 0.029293159066092627, "phrase": "risk_values"}, {"score": 0.02878977184865156, "phrase": "risk_value"}, {"score": 0.028417750036081966, "phrase": "faulty_statement"}, {"score": 0.00481495049065317, "phrase": "theoretical_analysis"}, {"score": 0.004667541072056214, "phrase": "important_research_area"}, {"score": 0.004103212598803194, "phrase": "huge_number"}, {"score": 0.0036715973701254823, "phrase": "completely_satisfactory_solution"}, {"score": 0.0031006232333900055, "phrase": "innovative_framework"}, {"score": 0.0026182085765020548, "phrase": "program_statements"}, {"score": 0.0023633857274905977, "phrase": "different_formulas"}, {"score": 0.002152397315548125, "phrase": "maximal_formulas"}], "paper_keywords": ["Verification", " Debugging", " risk evaluation formulas", " spectrum-based fault localization", " testing"], "paper_abstract": "An important research area of Spectrum-Based Fault Localization (SBFL) is the effectiveness of risk evaluation formulas. Most previous studies have adopted an empirical approach, which can hardly be considered as sufficiently comprehensive because of the huge number of combinations of various factors in SBFL. Though some studies aimed at overcoming the limitations of the empirical approach, none of them has provided a completely satisfactory solution. Therefore, we provide a theoretical investigation on the effectiveness of risk evaluation formulas. We define two types of relations between formulas, namely, equivalent and better. To identify the relations between formulas, we develop an innovative framework for the theoretical investigation. Our framework is based on the concept that the determinant for the effectiveness of a formula is the number of statements with risk values higher than the risk value of the faulty statement. We group all program statements into three disjoint sets with risk values higher than, equal to, and lower than the risk value of the faulty statement, respectively. For different formulas, the sizes of their sets are compared using the notion of subset. We use this framework to identify the maximal formulas which should be the only formulas to be used in SBFL.", "paper_title": "A Theoretical Analysis of the Risk Evaluation Formulas for Spectrum-Based Fault Localization", "paper_id": "WOS:000326024500004"}