{"auto_keywords": [{"score": 0.048231156244864744, "phrase": "ipn"}, {"score": 0.01571963337841224, "phrase": "interplanetary_internet"}, {"score": 0.01545964571298995, "phrase": "differential_game_model"}, {"score": 0.013081916392720725, "phrase": "available_energy"}, {"score": 0.00413684709497912, "phrase": "high_symbol_error"}, {"score": 0.004090577229368418, "phrase": "limited_storage_space"}, {"score": 0.0032115093493071366, "phrase": "symbol_error_rate"}, {"score": 0.0031577303835881964, "phrase": "storage_space"}, {"score": 0.002951444412262927, "phrase": "green_relays"}, {"score": 0.0024926348205500715, "phrase": "bellman_theorem"}, {"score": 0.0023428586429492713, "phrase": "optimal_transmitting_rate"}, {"score": 0.0022906498741695094, "phrase": "extensive_simulation_results"}], "paper_keywords": ["IPN", " differential game", " symbol error", " limited storage space", " energy efficiency"], "paper_abstract": "InterPlaNetary Internet (IPN) plays a very important role in the exploitation of space. However, the relays in IPN are suffered from high symbol error, limited storage space, and limited available energy. To analyze the performance of the relay in IPN, in this article, we build a differential game model, where the controller is transmitting rate, and the goal is to maximize the payoff according to the symbol error rate, the storage space and the available energy in the system. By such a design, the green relays can be achieved for IPNs, which could prolong the live of the relays. Since the model is not easy to discuss, we analyze it using the Bellman theorem and then get some formulas on the trace of the optimal transmitting rate. Finally, extensive simulation results are presented to demonstrate the performance of our proposed model, which shows that by using our derived optimal transmitting rate trace, the relay's payoff can be maximized.", "paper_title": "Towards green for relay in InterPlaNetary Internet based on differential game model", "paper_id": "WOS:000333614700007"}