{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "anonymity_through_social_media._information_systems"}, {"score": 0.004684157900507474, "phrase": "increasing_interest"}, {"score": 0.0038624981944755813, "phrase": "relational_and_performative_ontology"}, {"score": 0.00373682045166829, "phrase": "agential_realism"}, {"score": 0.0035953368057880593, "phrase": "key_ideas"}, {"score": 0.0034024277222012597, "phrase": "travel_sector"}, {"score": 0.0031845067058084583, "phrase": "online_social_media_website"}, {"score": 0.0028993944292191433, "phrase": "hotel_evaluation"}, {"score": 0.002610760187858779, "phrase": "predominantly_social_treatments"}, {"score": 0.00240328454980006, "phrase": "specific_performances"}, {"score": 0.0022368274529152342, "phrase": "particular_agential_realist_concept"}, {"score": 0.002175913488493802, "phrase": "understanding_anonymity"}, {"score": 0.0021049977753042253, "phrase": "research_practice"}], "paper_keywords": ["Anonymity", " entanglement", " agential realism", " social media", " materiality", " sociomateriality"], "paper_abstract": "Information systems researchers have shown an increasing interest in the notion of sociomateriality. In this paper, we continue this exploration by focusing specifically on entanglement: the inseparability of meaning and matter. Our particular approach is differentiated by its grounding in a relational and performative ontology, and its use of agential realism. We explore some of the key ideas of entanglement through a comparison of two phenomena in the travel sector: an institutionalized accreditation scheme offered by the AA and an online social media website hosted by TripAdvisor. Our analysis centers on the production of anonymity in these two practices of hotel evaluation. By examining how anonymity is constituted through an entanglement of matter and meaning, we challenge the predominantly social treatments of anonymity to date and draw attention to the uncertainties and outcomes generated by specific performances of anonymity in practice. In closing, we consider what the particular agential realist concept of entanglement entails for understanding anonymity, and discuss its implications for research practice.", "paper_title": "ENTANGLEMENTS IN PRACTICE: PERFORMING ANONYMITY THROUGH SOCIAL MEDIA", "paper_id": "WOS:000344971100013"}