{"auto_keywords": [{"score": 0.046106503701524776, "phrase": "dow_jones"}, {"score": 0.00481495049065317, "phrase": "environmental_finance"}, {"score": 0.004512814529823301, "phrase": "well-known_financial_index_providers"}, {"score": 0.004298666679374568, "phrase": "independent_agencies"}, {"score": 0.004229556887896042, "phrase": "environmentally_and_socially_responsible_investing"}, {"score": 0.004050625770007516, "phrase": "sustainability_indexes"}, {"score": 0.0037352048741373816, "phrase": "candidate_companies"}, {"score": 0.0034817084307034955, "phrase": "multivariate_effects"}, {"score": 0.0034442607586033657, "phrase": "conditional_volatility"}, {"score": 0.003107954674916875, "phrase": "esi"}, {"score": 0.0028195727965553367, "phrase": "risk_spillovers"}, {"score": 0.0026280534600940137, "phrase": "different_screening_criteria"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["environmental risk", " socially responsible investment", " financial risk", " shocks", " spillovers"], "paper_abstract": "There exist several important benchmark indexes in environmental finance, some computed by well-known financial index providers such as the Dow Jones group and others by independent agencies specializing in environmentally and socially responsible investing in finance. The construction of these sustainability indexes relies on two distinct screening methods, positive and negative, which aim to include or exclude candidate companies according to sustainable economic, environmental, social and ethical criteria. We investigate the presence and the importance of multivariate effects in conditional volatility in two major financial time-series indexes, namely the Dow Jones Sustainability Index (DJSI) World and the Ethibel Sustainability Index (ESI) Global, as a way to analyse their relative inherent risk. We further investigate empirically the existence of risk spillovers across these four indexes as a mean to assess the impact of the different screening criteria. Finally, the trends and volatility of two prominent financial indexes, the DJIA and S&P500, are analysed in the same manner to provide a comparison of the performance of the two types of indexes. (C) 2008 IMACS. Published by Elsevier B.V. All rights reserved.", "paper_title": "Multivariate volatility in environmental finance", "paper_id": "WOS:000256542000007"}