{"auto_keywords": [{"score": 0.03972939261258577, "phrase": "application_delivery"}, {"score": 0.032404306538410976, "phrase": "mcsa"}, {"score": 0.030672364597048113, "phrase": "application_creation"}, {"score": 0.004458189822972851, "phrase": "technical_threshold"}, {"score": 0.0043452175611323335, "phrase": "mobile_crowd_sensing_applications"}, {"score": 0.003961613484271729, "phrase": "general_support"}, {"score": 0.0038810583785936505, "phrase": "relatively_professional_software_development_skills"}, {"score": 0.003378385493203297, "phrase": "participant-side_factors"}, {"score": 0.003192700856094016, "phrase": "prototype_toolkit"}, {"score": 0.0031116963435584982, "phrase": "software_development_skills"}, {"score": 0.0030171910207671205, "phrase": "rather_quick_and_simple_way"}, {"score": 0.0027223626424366207, "phrase": "simple_settings"}, {"score": 0.0026126405272417783, "phrase": "programming_skills"}, {"score": 0.002357249810661667, "phrase": "created_applications"}, {"score": 0.0021049977753042253, "phrase": "willingness-based_participant_selection_algorithm"}], "paper_keywords": [""], "paper_abstract": "In order to lower the technical threshold for creating and delivering Mobile Crowd Sensing Applications (MCSAs), several frameworks or toolkits have been developed, but they either fail to provide general support or still require relatively professional software development skills. Besides, the application delivery to the participants is not precise enough, because they only consider the constraints predefined by the organizers without taking the participant-side factors into account. In this paper, we propose a prototype toolkit for the organizers without software development skills to build MCSA in a rather quick and simple way. First, in terms of the application creation, it enables organizers to build MCSA by just doing some simple settings, which totally eliminates the requirement of programming skills. Second, in terms of the application delivery, it selects participants who are more likely to accept the created applications by mining their participation history. Finally, we demonstrate the expressiveness and usability for the application creation and evaluate the effectiveness of the willingness-based participant selection algorithm for the application delivery.", "paper_title": "Lowering the Technical Threshold for Organizers to Create and Deliver Mobile Crowd Sensing Applications", "paper_id": "WOS:000364943100001"}