{"auto_keywords": [{"score": 0.038778095822290526, "phrase": "self-regulated_learning_strategies"}, {"score": 0.009455162814413144, "phrase": "computer_software"}, {"score": 0.004717325943509345, "phrase": "growing_trend"}, {"score": 0.004466519142879166, "phrase": "learning_processes"}, {"score": 0.00417160036938041, "phrase": "web-based_training_environment"}, {"score": 0.003949693102823493, "phrase": "different_ways"}, {"score": 0.0038960785110831162, "phrase": "software_training"}, {"score": 0.003284026247389735, "phrase": "self-guided_training_gains_popularity"}, {"score": 0.002602555367635598, "phrase": "erp_system"}, {"score": 0.0023486473525617816, "phrase": "user_processes"}, {"score": 0.0021049977753042253, "phrase": "training_employees"}], "paper_keywords": ["training", " self-assessment", " self-regulated learning", " IT domains"], "paper_abstract": "We investigated one aspect of the growing trend towards self-management within organizations by examining the learning processes that individuals use when learning computer software alone in a web-based training environment, and found that individuals learn in different ways. Software training in any context requires individuals to apply self-regulated learning strategies to achieve their learning objectives. Self-regulated learning strategies are the processes that they use to manage their own learning. As self-guided training gains popularity, self-regulated learning strategies become increasingly important, because the learner typically has more control of their training. We found that self-regulated learning strategies led to better outcomes in our study of managers and professionals learning to use an ERP system. We also gained insights into the most popular learning strategies. This work enhanced our understanding of user processes when learning computer software. It should assist organizations in maximizing the return from their investment in training employees and managing knowledge. (c) 2008 Elsevier B.V. All rights reserved.", "paper_title": "Self-regulated learning strategies and software training", "paper_id": "WOS:000257613800004"}