{"auto_keywords": [{"score": 0.043612899193540264, "phrase": "expert_opinion"}, {"score": 0.03722512137998704, "phrase": "empirical_evidence"}, {"score": 0.03581756621697852, "phrase": "project_failure"}, {"score": 0.00481495049065317, "phrase": "large-scale_software_engineering_questions"}, {"score": 0.004468692445596954, "phrase": "uk"}, {"score": 0.003643185395780667, "phrase": "academic_policy"}, {"score": 0.003500812175550438, "phrase": "current_evidence"}, {"score": 0.0030600032877646263, "phrase": "relevant_evidence"}, {"score": 0.002925728709297618, "phrase": "convenience_samples"}, {"score": 0.0028536871476905847, "phrase": "empirical_research"}, {"score": 0.0028113140998735366, "phrase": "computing_disciplines"}, {"score": 0.002701361707441567, "phrase": "restricted_range"}, {"score": 0.0025066304722422463, "phrase": "large-scale_it_questions"}, {"score": 0.0022573076362326135, "phrase": "quasi-experimental_designs"}, {"score": 0.0021907299375981356, "phrase": "social_sciences"}, {"score": 0.0021049977753042253, "phrase": "large-scale_empirical_studies"}], "paper_keywords": [""], "paper_abstract": "A recent report on the state of the UK information technology (IT) industry based most of its findings and recommendations on expert opinion. It is surprising that the report was unable to incorporate more empirical evidence. This paper aims to assess whether it is necessary to base IT industry and academic policy on expert opinion rather than on empirical evidence. Current evidence related to the rate of project failure is identified and the methods used to accumulate that evidence discussed. This shows that the report failed to identify relevant evidence and most evidence related to project failure is based on convenience samples. The status of empirical research in the computing disciplines is reviewed showing that empirical evidence covers a restricted range of subjects and seldom addresses the 'Society' level of analysis. Other more robust designs that would address large-scale IT questions are discussed. We recommend adopting a more systematic approach to accumulating and reporting evidence. In addition, we propose using quasi-experimental designs developed and used in the social sciences to improve the methodology used for undertaking large-scale empirical studies in software engineering.", "paper_title": "Large-scale software engineering questions - expert opinion or empirical evidence?", "paper_id": "WOS:000251677100001"}