{"auto_keywords": [{"score": 0.04005808804923863, "phrase": "product_variants"}, {"score": 0.01987624885828621, "phrase": "product_line_design"}, {"score": 0.009683770909073151, "phrase": "product_line"}, {"score": 0.006851646437221956, "phrase": "previous_studies"}, {"score": 0.00472955160788118, "phrase": "higher_product_variety"}, {"score": 0.004692937759870667, "phrase": "proposed_methodology"}, {"score": 0.004563250218021092, "phrase": "development_time"}, {"score": 0.004160092647083038, "phrase": "supplier_selection"}, {"score": 0.003977952748523497, "phrase": "single_objective_function"}, {"score": 0.003919022096381048, "phrase": "optimization_models"}, {"score": 0.003884081948117292, "phrase": "integrated_problem"}, {"score": 0.0037250869218569244, "phrase": "competitive_markets"}, {"score": 0.003604725094696445, "phrase": "marketing_strategies"}, {"score": 0.0034778368609967754, "phrase": "integrated_product_line_design"}, {"score": 0.0033453930912354796, "phrase": "multi-objective_optimization_model"}, {"score": 0.003058626737273869, "phrase": "joint-spacing_mapping"}, {"score": 0.0030042843107651847, "phrase": "market_share"}, {"score": 0.00288982217955743, "phrase": "decision_makers"}, {"score": 0.0028640315078411784, "phrase": "better_tradeoff"}, {"score": 0.0027963729616768784, "phrase": "market_positions"}, {"score": 0.00266580039440334, "phrase": "product_lines"}, {"score": 0.002649912326113783, "phrase": "higher_profits"}, {"score": 0.0026341187000055396, "phrase": "better_product_quality"}, {"score": 0.002618418957665835, "phrase": "larger_market_share"}, {"score": 0.0025718774980145786, "phrase": "case_study"}, {"score": 0.002533723901680123, "phrase": "notebook_computers"}, {"score": 0.0024153856447655143, "phrase": "pareto_optimal_product_line_designs"}, {"score": 0.002268394245801392, "phrase": "minimum_sourcing_cost"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Product line design", " Supplier selection", " Multi-objective optimization", " NSGA II"], "paper_abstract": "Product line design is commonly used to provide higher product variety for satisfying diversified customer needs. To reduce the cost and development time and improve quality of products, companies quite often consider sourcing. Conventionally, product line design and supplier selection are dealt with separately. Some previous studies have been attempted to consider product line design and supplier selection simultaneously but two shortcomings were noted. First, the previous studies considered several objectives as a single objective function in the formulation of optimization models for the integrated problem. Second, positions of product variants to be offered in a product line in competitive markets are not clearly defined that would affect the formulation of marketing strategies for the product line. In this paper, a methodology for integrated product line design and supplier selection is proposed to address the shortcomings in which a multi-objective optimization model is formulated to determine their specifications and select suppliers for maximizing the profit, quality and performance as well as minimizing the cost of the product line. In addition, joint-spacing mapping is introduced to help estimate market share of products and indicate positions of product variants. The proposed methodology can provide decision makers with a better tradeoff among various objectives of product line design, and define market positions of product variants explicitly. The results generated based on the methodology could help companies develop product lines with higher profits, better product quality and larger market share to be obtained. A case study of a product line design of notebook computers was performed to illustrate the effectiveness of the proposed methodology. The results have shown that Pareto optimal product line designs and the specifications of product variants can be determined. Suppliers of components and modules can be selected with considerations of minimum sourcing cost, and maximum performance and quality of product variants. Prices and positions of the product variants can also be determined. (C) 2014 Elsevier Ltd. All rights reserved.", "paper_title": "Integrated product line design and supplier selection: A multi-objective optimization paradigm", "paper_id": "WOS:000335542900014"}