{"auto_keywords": [{"score": 0.03321986365158592, "phrase": "decision_support"}, {"score": 0.007216173990442818, "phrase": "clinical_decision_support"}, {"score": 0.00481495049065317, "phrase": "diagnostic_imaging"}, {"score": 0.004722613498487908, "phrase": "primary_care"}, {"score": 0.004632039024076267, "phrase": "methods_clinical_guideline_adherence"}, {"score": 0.004484981981902746, "phrase": "di"}, {"score": 0.004342430078306461, "phrase": "electronic_decision_support"}, {"score": 0.0042591158963728665, "phrase": "rural_community_family_practice_clinic"}, {"score": 0.002985130390111069, "phrase": "initially_inappropriate_orders"}, {"score": 0.0027444334639134217, "phrase": "significant_variations"}, {"score": 0.002709161672473817, "phrase": "use_rate"}, {"score": 0.0023346234464901978, "phrase": "conclusions_physicians"}, {"score": 0.0021742244283295986, "phrase": "clinical_habits"}, {"score": 0.0021049977753042253, "phrase": "routine_work_flow"}], "paper_keywords": [""], "paper_abstract": "Methods Clinical guideline adherence for diagnostic imaging (DI) and acceptance of electronic decision support in a rural community family practice clinic was assessed over 36 weeks. Physicians wrote 904 DI orders, 58% of which were addressed by the Canadian Association of Radiologists guidelines. Results Of those orders with guidelines, 76% were ordered correctly; 24% were inappropriate or unnecessary resulting in a prompt from clinical decision support. Physicians followed suggestions from decision support to improve their DI order on 25% of the initially inappropriate orders. The use of decision support was not mandatory, and there were significant variations in use rate. Initially, 40% reported decision support disruptive in their work flow, which dropped to 16% as physicians gained experience with the software. Conclusions Physicians supported the concept of clinical decision support but were reluctant to change clinical habits to incorporate decision support into routine work flow.", "paper_title": "Electronic decision support for diagnostic imaging in a primary care setting", "paper_id": "WOS:000289960600009"}