{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "permutation-scanning_worms"}, {"score": 0.004468415400599571, "phrase": "internet_worms"}, {"score": 0.004069963083642548, "phrase": "propagation_pattern"}, {"score": 0.004032118497047498, "phrase": "internet-scale_behavior"}, {"score": 0.003976007772514762, "phrase": "accurate_analytical_propagation_model"}, {"score": 0.0031328221096543823, "phrase": "relatively_simple_random-scanning_worms"}, {"score": 0.002735522834514124, "phrase": "mathematical_model"}, {"score": 0.0026722904884984348, "phrase": "propagation_patterns"}, {"score": 0.00263505298504827, "phrase": "general_permutation-scanning_worms"}, {"score": 0.002514625755809045, "phrase": "infected_hosts"}, {"score": 0.002456486927713543, "phrase": "interdependent_differential_equations"}, {"score": 0.00237733844863506, "phrase": "closed-form_solutions"}, {"score": 0.0023223663501882917, "phrase": "overall_worm_behavior"}, {"score": 0.002185301851004467, "phrase": "worm_propagation"}, {"score": 0.0021049977753042253, "phrase": "dynamic_network_conditions"}], "paper_keywords": ["Network security", " worm modeling"], "paper_abstract": "In recent years, both sophistication and damage potential of Internet worms have increased tremendously. To understand their threat, we need to look into their payload for signatures as well as propagation pattern for Internet-scale behavior. An accurate analytical propagation model allows us to comprehensively study how a worm propagates under various conditions, which is often computationally too intensive for simulations. More importantly, it gives us an insight into the impact of each worm/network parameter on the propagation of the worm. Traditionally, most modeling work in this area concentrates on the relatively simple random-scanning worms. However, modeling the permutation-scanning worms, a class of worms that are fast yet stealthy, has been a challenge to date. This paper proposes a mathematical model that precisely characterizes the propagation patterns of the general permutation-scanning worms. The analytical framework captures the interactions among all infected hosts by a series of interdependent differential equations, which are then integrated into closed-form solutions that together present the overall worm behavior. We use the model to study how each worm/network parameter affects the worm propagation. We also investigate the impact of dynamic network conditions on the correctness of the model.", "paper_title": "Inside the Permutation-Scanning Worms: Propagation Modeling and Analysis", "paper_id": "WOS:000278813900014"}