{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "topological_relationships"}, {"score": 0.008654707367380362, "phrase": "spatiotemporal_objects"}, {"score": 0.0049325337430244755, "phrase": "time_slice_model"}, {"score": 0.004653339900995785, "phrase": "topological_information"}, {"score": 0.004621671570727774, "phrase": "normal_spatial_databases"}, {"score": 0.0039362209515303795, "phrase": "spatiotemporal_version"}, {"score": 0.0038960785110831162, "phrase": "sliced_representation"}, {"score": 0.0038563438670516127, "phrase": "efficient_retrieval"}, {"score": 0.003626272370749206, "phrase": "earlier_representation"}, {"score": 0.003317883538640966, "phrase": "changing_spatial_partition"}, {"score": 0.0026114748685439116, "phrase": "basic_time_slice_model"}, {"score": 0.002549672862868133, "phrase": "new_model"}, {"score": 0.002472352057126189, "phrase": "adjacency_graph"}, {"score": 0.002389180450772203, "phrase": "short_analysis"}, {"score": 0.0023486473525617816, "phrase": "current_time"}, {"score": 0.0022774088820755366, "phrase": "historical_data"}], "paper_keywords": ["Topology", " Spatiotemporal databases", " Moving objects"], "paper_abstract": "Several representations have been created to store topological information in normal spatial databases. Some work has also been done to represent topology for 3D objects, and such representations could be used to store topology for spatiotemporal objects. However, using 3D models has some disadvantages with regards to retrieving snapshots of the database. This paper aims at creating a spatiotemporal version of the sliced representation that supports efficient retrieval of snapshots of the past and that supports enforcing topological relationships. This paper aims to extend an earlier representation of moving objects so that it can also store and enforce some of the topological relationships between the objects. One use of such a representation is storing a changing spatial partition. As part of the effort to construct the model, an analysis of the topological relationships has been carried out to see which need to be stored explicitly and which can be computed from geometry. Both a basic time slice model and a 3D model are examined to determine how suitable they are for storing topological relationships. An extension of the time slice model is then proposed that solves some of the problems of the basic time slice model. Some algorithms for constructing the new model from snapshots of the objects along with an adjacency graph have been created. The paper also contains a short analysis on how to handle current time, as the time slice model is best at handling historical data, and on ways to speed up searches in a database in which objects of many types are connected to one another and many files therefore potentially need to be accessed.", "paper_title": "Representing topological relationships for spatiotemporal objects", "paper_id": "WOS:000295128200002"}