{"auto_keywords": [{"score": 0.04223675952890243, "phrase": "cio_cfo_reporting_structure"}, {"score": 0.03932808108453109, "phrase": "cio_reporting_structure"}, {"score": 0.03661205466805488, "phrase": "firm's_strategic_positioning"}, {"score": 0.015400692342775378, "phrase": "cio"}, {"score": 0.015043969204630778, "phrase": "cfo"}, {"score": 0.01008792302304756, "phrase": "cost_leaders"}, {"score": 0.00481495049065317, "phrase": "cio_position"}, {"score": 0.004772367030970874, "phrase": "ideal_cio_reporting_structure"}, {"score": 0.004471332715426312, "phrase": "intuitive_assumption"}, {"score": 0.004176813329075736, "phrase": "cio's_clout"}, {"score": 0.0036553070575015344, "phrase": "strategic_role"}, {"score": 0.003538024913537244, "phrase": "strategy_structure_paradigm"}, {"score": 0.003374094774912924, "phrase": "primary_determinant"}, {"score": 0.003132979607342419, "phrase": "firm's_differentiation_strategy"}, {"score": 0.002935050614509531, "phrase": "firm's_cost_leadership_strategy"}, {"score": 0.0028832679581901176, "phrase": "alignment_fit_view"}, {"score": 0.0027414449627521367, "phrase": "cio_ceo"}, {"score": 0.0027090988689455735, "phrase": "cost_leadership"}, {"score": 0.0026534064006291853, "phrase": "superior_future_performance"}, {"score": 0.002637705034367748, "phrase": "longitudinal_data"}, {"score": 0.0025605773834404253, "phrase": "proposed_hypotheses"}, {"score": 0.002470987929071079, "phrase": "also_the_positive_impact"}, {"score": 0.002434588227798036, "phrase": "firm_performance"}, {"score": 0.0023916139749419188, "phrase": "ad_hoc_prescriptions"}, {"score": 0.002335489878370869, "phrase": "cio_ceo_reporting_structure"}, {"score": 0.0021049977753042253, "phrase": "key_strategic_role"}], "paper_keywords": ["Chief information officer (CIO)", " CIO reporting structure", " strategic positioning", " Porter's generic strategies", " product/service differentiation", " cost leadership", " firm performance", " abnormal stock returns", " cash flows from operations", " chief executive officer (CEO)", " chief financial officer (CFO)"], "paper_abstract": "Almost 30 years after the introduction of the CIO position, the ideal CIO reporting structure (whether the CIO should report to the CEO or the CFO) is yet to be identified There is an intuitive assumption among some proponents of IT that the CIO should always report to the CEO to promote the importance of IT and the CIO's clout in the firm, while some adversaries of IT call for a CIO CFO reporting structure to keep a tab on IT spending. However, we challenge these two ad hoc prescriptions by arguing that neither CIO reporting structure is necessarily optimal, and that the CIO reporting structure should not be used to gauge the strategic role of IT in the firm. First, extending the strategy structure paradigm, we propose that a firm's strategic positioning (differentiation or cost leadership) should be a primary determinant of its CIO reporting structure. We hypothesize that differentiators are more likely to have their CIO report to the CEO in order to pursue IT initiatives that help the firm's differentiation strategy. We also hypothesize that cost leaders are more likely to have their CIO report to the CFO to lead IT initiatives to facilitate the firm's cost leadership strategy. Second, extending the alignment fit view, we propose that firms that align their CIO reporting structure with their strategic positioning (specifically, differentiation with a CIO CEO reporting structure and cost leadership with a CIO CFO reporting structure) will have superior future performance. Longitudinal data from two periods (1990-1993 and 2006) support the proposed hypotheses, validating the relationship between a firm's strategic positioning and its CIO reporting structure, and also the positive impact of their alignment on firm performance. These results challenge the ad hoc prescriptions about the CIO reporting structure, demonstrating that a CIO CEO reporting structure is only superior for differentiators and a CIO CFO reporting structure is superior only for cost leaders. The CIO reporting structure must, therefore, be designed to align with the firm's strategic positioning, independent of whether IT plays a key strategic role in the firm.", "paper_title": "CIO REPORTING STRUCTURE, STRATEGIC POSITIONING, AND FIRM PERFORMANCE", "paper_id": "WOS:000290842900012"}