{"auto_keywords": [{"score": 0.03530867228130293, "phrase": "perceived_value"}, {"score": 0.010721833713800961, "phrase": "functional_quality"}, {"score": 0.00481495049065317, "phrase": "functional_and_hedonic_quality"}, {"score": 0.004771435352180973, "phrase": "purpose_-_the_purpose"}, {"score": 0.004559661374976129, "phrase": "e-quality_model"}, {"score": 0.0038368442918503072, "phrase": "travel_leisure_products"}, {"score": 0.003683097597914604, "phrase": "structural_equation_modeling_analysis"}, {"score": 0.003535489842686145, "phrase": "quality_dimensions"}, {"score": 0.0034717929086014636, "phrase": "e-quality_second_order_dimension"}, {"score": 0.0031129269142224194, "phrase": "security_programs"}, {"score": 0.003015401937358271, "phrase": "e-quality_perceived_value_loyalty_service_chain"}, {"score": 0.0028944757265206332, "phrase": "partial_mediating_effect"}, {"score": 0.002753224894944965, "phrase": "practical_implications"}, {"score": 0.0025951294037626174, "phrase": "hedonic_quality"}, {"score": 0.002305589818994465, "phrase": "customer_loyalty"}, {"score": 0.0022537212268979507, "phrase": "mediator_effect"}, {"score": 0.0021049977753042253, "phrase": "future_scales"}], "paper_keywords": ["Loyalty", " Functional quality", " Perceived value", " e-Purchase", " e-Quality", " Hedonic quality"], "paper_abstract": "Purpose - The purpose of this paper is to propose and test an e-quality model for leisure products purchased online. Two dimensions are considered in order to configure the scale: functional quality and hedonic quality. Design/methodology/approach - Based on a survey conducted on a sample of 1,109 online customers who had bought travel leisure products, the model and hypotheses were validated using structural equation modeling analysis. Findings - The results reveal that both quality dimensions, through an e-quality second order dimension, are critical to obtaining loyalty through perceived value. In terms of functional quality, however, privacy is not significant for consumers because security programs have improved. Moreover, the e-quality perceived value loyalty service chain has been confirmed. In addition, a partial mediating effect of perceived value between e-quality and loyalty has been detected. Practical implications - e-Service managers must be aware of the importance of hedonic quality in seeking to attract and retain customers on their web sites. On the other hand, it has to be considered not only direct effects for evaluating customer loyalty, but also the mediator effect of perceived value is needed. Originality/value - From now on, the paper forecasts that \"hedonics\" will be present in future scales designed to assess e-quality, although what is really valued as important is still functional quality.", "paper_title": "Building loyalty through functional and hedonic quality", "paper_id": "WOS:000334143500003"}