{"auto_keywords": [{"score": 0.04534083835414357, "phrase": "contextual_information"}, {"score": 0.043726272486193665, "phrase": "digital_libraries"}, {"score": 0.04178514569843149, "phrase": "relevant_contextual_information"}, {"score": 0.00481495049065317, "phrase": "scholar_context-aware_recommender_systems"}, {"score": 0.004680473391946691, "phrase": "recommender_systems"}, {"score": 0.004614643339546038, "phrase": "effective_approach"}, {"score": 0.0038746849003761024, "phrase": "kitchenham_systematic_review_methodology"}, {"score": 0.0033150974333333214, "phrase": "classical_approaches"}, {"score": 0.00326840809777013, "phrase": "collaborative_filtering"}, {"score": 0.0024842242921857705, "phrase": "user_viewpoint"}, {"score": 0.002460825108719896, "phrase": "scholarly_domains"}, {"score": 0.0023694065215394593, "phrase": "context-aware_recommender_system"}, {"score": 0.0022070310530794097, "phrase": "future_investigations"}, {"score": 0.00218623706110975, "phrase": "scholarly_recommender_systems"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Context-aware recommender system", " Context-awareness", " Contextual information", " Academic digital library"], "paper_abstract": "Incorporating contextual information in recommender systems is an effective approach to create more accurate and relevant recommendations. This review has been conducted to identify the contextual information and methods used for making recommendations in digital libraries as well as the way researchers understood and used relevant contextual information from the years 2001 to 2013 based on the Kitchenham systematic review methodology. The results indicated that contextual information incorporated into recommendations can be categorised into three contexts, namely users' context, document's context, and environment context. In addition, the classical approaches such as collaborative filtering were employed more than the other approaches. Researchers have understood and exploited relevant contextual information through four ways, including citation of past studies, citation of past definitions, self-definitions, and field-query researches; however, citation of the past studies has been the most popular method. This review highlights the need for more investigations on the concept of context from user viewpoint in scholarly domains. It also discusses the way a context-aware recommender system can be effectively designed and implemented in digital libraries. Additionally, a few recommendations for future investigations on scholarly recommender systems are proposed. (C) 2014 Elsevier Ltd. All rights reserved.", "paper_title": "A systematic review of scholar context-aware recommender systems", "paper_id": "WOS:000345734700060"}