{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "argumentation_techniques"}, {"score": 0.008661201965424277, "phrase": "multi-agent_systems_research"}, {"score": 0.006777065950130829, "phrase": "multi-agent_systems"}, {"score": 0.006614684648164059, "phrase": "systematic_review"}, {"score": 0.0046004861111734185, "phrase": "intelligent_interactions"}, {"score": 0.0045726187330434025, "phrase": "human_beings"}, {"score": 0.004342430078306461, "phrase": "artificial_intelligence"}, {"score": 0.004263972370406983, "phrase": "agents_paradigm"}, {"score": 0.003951976017359017, "phrase": "future_actions"}, {"score": 0.0037075456471849892, "phrase": "interesting_research_field"}, {"score": 0.003531474887552889, "phrase": "authors'_knowledge"}, {"score": 0.0030424424705823455, "phrase": "existing_approaches"}, {"score": 0.0029422942175866057, "phrase": "research_method"}, {"score": 0.0028890603352364273, "phrase": "relevant_studies"}, {"score": 0.0028541057064952876, "phrase": "predefined_search_strategy"}, {"score": 0.0027019561451518746, "phrase": "included_studies"}, {"score": 0.0025656978348098125, "phrase": "multi-agent"}, {"score": 0.002526938673434697, "phrase": "comprehensive_analysis"}, {"score": 0.0025039656549083497, "phrase": "extracted_data"}, {"score": 0.002399482671479507, "phrase": "research_questions"}, {"score": 0.0022715134070706174, "phrase": "argumentation_technology"}, {"score": 0.0022236070278432575, "phrase": "internal_enhancement"}, {"score": 0.0021767087933168717, "phrase": "research_interest"}], "paper_keywords": ["Systematic review", " Multi-agent system", " Argumentation"], "paper_abstract": "The ability to build arguments that express thoughts is crucial for intelligent interactions among human beings. Thus, argumentation techniques have been applied for years in fields, such as rhetoric or artificial intelligence. More specifically, the agents paradigm fits into the use of these types of techniques because agents shape a society in which they interact to make arrangements or to decide future actions. Those interactions can be modelled using argumentation techniques. Therefore, the application of those techniques in multi-agent systems is an interesting research field. However, no systematic review has been conducted previously, to the best of the authors' knowledge, to provide an overview of argumentation techniques for multi-agent systems. This paper presents a systematic review of argumentation techniques for multi-agent systems research. The period of time that is included in this review is from 1998 to 2014. The objective of this review is to obtain an overview of the existing approaches and to study their impact on research and practice. The research method has been defined to identify relevant studies based on a predefined search strategy, and it is clearly defined to facilitate the reading of this paper. All of the included studies in this review have been analysed from two different points of view: the Application view and the Multi-Agent System view. A comprehensive analysis of the extracted data is provided in the paper, which is based on a set of research questions that are defined. The results of this review reveal suggestions for further research and practice. The argumentation technology is actually in a phase of internal enhancement and exploration. Moreover, the research interest in this topic has increased in the last years. Furthermore, several interesting findings are presented in the paper.", "paper_title": "A systematic review of argumentation techniques for multi-agent systems research", "paper_id": "WOS:000363953700003"}