{"auto_keywords": [{"score": 0.04567531268022501, "phrase": "bibliographic_universe"}, {"score": 0.009483066671522647, "phrase": "frbr"}, {"score": 0.00481495049065317, "phrase": "frbr_conceptual_model"}, {"score": 0.004498812433096501, "phrase": "previous_study"}, {"score": 0.004448169552315403, "phrase": "mental_models"}, {"score": 0.004227209809791869, "phrase": "functional_requirements"}, {"score": 0.003817548980308163, "phrase": "bibliographic_entities"}, {"score": 0.0037745459666402915, "phrase": "six_graphs"}, {"score": 0.003239114833599948, "phrase": "frbr_model"}, {"score": 0.002843180211561427, "phrase": "appropriate_model"}, {"score": 0.002763709443278514, "phrase": "users'_standpoint"}, {"score": 0.0025965853546625352, "phrase": "textual_part"}, {"score": 0.002215274527909304, "phrase": "frbr-based_catalogues"}, {"score": 0.0021049977753042253, "phrase": "user_studies"}], "paper_keywords": ["Functional Requirements for Bibliographic Records", " User studies", " Mental models", " Bibliographies", " Bibliographic systems"], "paper_abstract": "Purpose - This paper aims to build on of a previous study of mental models of the bibliographic universe, which found that the Functional Requirements for Bibliographic Records (FRBR) conceptual model is intuitive. Design/methodology/approach - A total of 120 participants were presented with a list of bibliographic entities and six graphs each. They were asked to choose the graph they thought best represented the relationships between entities described. Findings - The graph based on the FRBR model was chosen by more than half of the participants and none of the alternatives stood out. This gives further indication that FRBR is an appropriate model of the bibliographic universe from users' standpoint. Research limitations/implications - The study only looked at the textual part of the bibliographic universe. Further research is needed for other types of materials. Practical implications - This research suggests that there should be a more positive attitude towards implementation of FRBR-based catalogues. Originality/value - This is one of only a handful of user studies relating to FRBR, which looks to be the backbone of catalogues for years to come. As such, the results should be of interest to everybody involved with catalogues, from cataloguers to the end-users.", "paper_title": "User verification of the FRBR conceptual model", "paper_id": "WOS:000308836300009"}