{"auto_keywords": [{"score": 0.03906597166738946, "phrase": "corporate_reputation"}, {"score": 0.012880027518075349, "phrase": "different_monitors"}, {"score": 0.004578783486828809, "phrase": "corporate_management"}, {"score": 0.004401342842183475, "phrase": "market_place"}, {"score": 0.0040086845241492424, "phrase": "new_technologies"}, {"score": 0.0037845987749316632, "phrase": "aforementioned_intangibles"}, {"score": 0.0034220655476652683, "phrase": "new_trends"}, {"score": 0.003253994336864267, "phrase": "forthcoming_years"}, {"score": 0.0030941521409613417, "phrase": "first_place"}, {"score": 0.002984794722633428, "phrase": "main_management_monitors"}, {"score": 0.002910545717767559, "phrase": "second_place"}, {"score": 0.0028279422436488116, "phrase": "multinational_companies"}, {"score": 0.00278752137116301, "phrase": "best_reputation"}, {"score": 0.0025568135952982345, "phrase": "future_requirements"}, {"score": 0.0025021765811679446, "phrase": "proactive_management"}, {"score": 0.002448704249007665, "phrase": "intelligent_tools"}, {"score": 0.0022138542785562444, "phrase": "different_stakeholders"}, {"score": 0.0021587414711262904, "phrase": "social_and_economic_sphere"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Intangible management", " Intangible monitors/tools", " Relational capital", " Corporate reputation intelligent system", " Expert systems"], "paper_abstract": "During the last decade it has been observed that companies have dedicated more effort and resources to developing policies for the management of intangibles in their models of corporate management, which would allow them to improve their position in the market place with respect to their public, and thereby guarantee sustainability through time. This tendency has noticeably increased over the last years owing to the growth in new technologies, the appearance of different monitors and tools that deal with weighing the impact of the aforementioned intangibles, particularly that of corporate reputation. The objective of this paper is to analyse the different monitors and tools used by companies to manage corporate reputation, and define new trends which will be generated in the management of intangibles within multinationals during the forthcoming years and in what direction to develop their management skills. To this end, in the first place, an analysis and comparison is made of the main management monitors and tools of corporate reputation. In second place, a study is carried out of multinational companies that have the best reputation in order to identify which monitors and tools they more frequently use for their intangible management. Finally, it is discussed how to cover the future requirements of these multinationals towards the proactive management of their relational capital by means of intelligent tools that contribute to guarantee their sustainability with their publics; and consider within their design, the new global framework where information, communication, the prescriptions closest to the different stakeholders, share and impact in the social and economic sphere worldwide. (C) 2013 Elsevier Ltd. All rights reserved.", "paper_title": "Intangible management monitors and tools: Reviews", "paper_id": "WOS:000330158700051"}