{"auto_keywords": [{"score": 0.045029455174843455, "phrase": "pattern_recognition"}, {"score": 0.022825701291235057, "phrase": "foundational_issues"}, {"score": 0.00958699208305587, "phrase": "scientific_approach"}, {"score": 0.00481495049065317, "phrase": "neural_networks"}, {"score": 0.004565007074039171, "phrase": "underlying_pattern_recognition"}, {"score": 0.004405596416783185, "phrase": "recent_times"}, {"score": 0.004251728624599691, "phrase": "new_tools"}, {"score": 0.0035118972210075633, "phrase": "mathematical_analysis"}, {"score": 0.003465350958971198, "phrase": "classification_behavior"}, {"score": 0.003434662174045939, "phrase": "feedforward_networks"}, {"score": 0.003299880298525127, "phrase": "rationalist_debate"}, {"score": 0.002641621667026613, "phrase": "underlying_forms"}, {"score": 0.002482013330276732, "phrase": "specific_relation"}, {"score": 0.002200861826643147, "phrase": "new_avenues"}, {"score": 0.0021716540012278744, "phrase": "philosophical_and_foundational_debate"}, {"score": 0.0021333110194180997, "phrase": "previous_times"}], "paper_keywords": ["Classification", " Classical cognitive science vs. dynamical systems", " Computation", " Dissipative systems", " Induction", " Neural networks"], "paper_abstract": "Foundational issues related to learning, processing and reptesentation underlying pattern recognition have been discussed in history and in recent times. The scientific approach to pattern recognition could provide new tools to investigate these foundational issues, which in turn could inform the scientific approach to pattern recognition as well. One such tool could be the analysis of learning, processing and representation in connectionist (or neural) networks, which have been extensively used for pattern recognition. Based on a mathematical analysis of the classification behavior of feedforward networks an analysis is given of the empiricist vs. rationalist debate on the possibility or impossibility of induction. The analysis aims to show that forms of induction are possible but not without certain given forms of structure and representation. The analysis is then extended to cover the role of representation in pattern recognition, and the nature of the underlying forms of processing, aiming to show that models of cognition derive from a specific relation between dynamics and computation. These examples illustrate that an interaction between modeling and the discussion on foundational issues could be beneficial for both and could open new avenues in the philosophical and foundational debate not available in previous times. (C) 2015 Elsevier B.V. All rights reserved.", "paper_title": "Computation and dissipative dynamical systems in neural networks for classification", "paper_id": "WOS:000361260800007"}