{"auto_keywords": [{"score": 0.04613998105509961, "phrase": "sectional_curvature"}, {"score": 0.004814952636065877, "phrase": "cometric"}, {"score": 0.004671588539217021, "phrase": "riemannian_manifolds"}, {"score": 0.004309725894724034, "phrase": "n_landmarks"}, {"score": 0.004245051445971095, "phrase": "feature_points"}, {"score": 0.004077272409331917, "phrase": "riemannian_metric"}, {"score": 0.003995876175614403, "phrase": "group_action"}, {"score": 0.0038379074449947067, "phrase": "metric_tensor"}, {"score": 0.003315927315022803, "phrase": "nd"}, {"score": 0.0031845067058084583, "phrase": "partial_derivatives"}, {"score": 0.002982307044758515, "phrase": "highly_nontrivial_problem"}, {"score": 0.0027095919044205783, "phrase": "mario"}, {"score": 0.0023170054862555896, "phrase": "sectional_curvatures"}, {"score": 0.0021917966722180132, "phrase": "latter_example"}, {"score": 0.0021049977753042253, "phrase": "full_manifolds"}], "paper_keywords": ["shape spaces", " landmark points", " cometric", " sectional curvature"], "paper_abstract": "This paper deals with the computation of sectional curvature for the manifolds of N landmarks (or feature points) in D dimensions, endowed with the Riemannian metric induced by the group action of diffeomorphisms. The inverse of the metric tensor for these manifolds (i.e., the cometric), when written in coordinates, is such that each of its elements depends on at most 2D of the ND coordinates. This makes the matrices of partial derivatives of the cometric very sparse in nature, thus suggesting solving the highly nontrivial problem of developing a formula that expresses sectional curvature in terms of the cometric and its first and second partial derivatives (we call this Mario's formula). We apply such a formula to the manifolds of landmarks, and in particular we fully explore the case of geodesics on which only two points have nonzero momenta and compute the sectional curvatures of 2-planes spanned by the tangents to such geodesics. The latter example gives insight into the geometry of the full manifolds of landmarks.", "paper_title": "Sectional Curvature in Terms of the Cometric, with Applications to the Riemannian Manifolds of Landmarks", "paper_id": "WOS:000302220800013"}