{"auto_keywords": [{"score": 0.034182875683624124, "phrase": "shadow_trajectories"}, {"score": 0.00481495049065317, "phrase": "camera_calibration"}, {"score": 0.004775335634705251, "phrase": "solar_shadows"}, {"score": 0.004563182153397349, "phrase": "camera_parameter_estimation"}, {"score": 0.004149429072483132, "phrase": "stationary_objects"}, {"score": 0.0036958398682001015, "phrase": "horizon_line"}, {"score": 0.0036502716977381004, "phrase": "ground_plane"}, {"score": 0.003516898780234098, "phrase": "extracted_vertical_vanishing_point"}, {"score": 0.003459191419478298, "phrase": "stationary_camera"}, {"score": 0.0032780806856932423, "phrase": "six_or_more_points"}, {"score": 0.0031582637043009562, "phrase": "camera_intrinsic_parameters"}, {"score": 0.0030680994147125364, "phrase": "novel_application"}, {"score": 0.0028953973490895746, "phrase": "longitude_ambiguity"}, {"score": 0.0027211030647461324, "phrase": "possible_cases"}, {"score": 0.002621590601574503, "phrase": "additional_information"}, {"score": 0.002175913488493802, "phrase": "geo-temporal_localization"}, {"score": 0.0021579641460002523, "phrase": "synthetic_and_real_data"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Camera calibration", " Camera geo-location", " Computer vision"], "paper_abstract": "In this paper, we discuss the issue of camera parameter estimation (intrinsic and extrinsic parameters), along with estimation of the geo-location of the camera by using only the shadow trajectories. By observing stationary objects over a period of time, it is shown that only six points on the trajectories formed by tracking the shadows of the objects are sufficient to estimate the horizon line of the ground plane. This line is used along with the extracted vertical vanishing point to calibrate the stationary camera. The method requires as few as two shadow casting objects in the scene and a set of six or more points on the shadow trajectories of these objects. Once camera intrinsic parameters are recovered, we present a novel application where one can accurately determine the geo-location of the camera up to a longitude ambiguity using only three points from these shadow trajectories without using any GPS or other special instruments. We consider possible cases where this ambiguity can also be removed if additional information is available. Our method does not require any knowledge of the date or the time when the images are taken, and recovers the date of acquisition directly from the images. We demonstrate the accuracy of our technique for both steps of calibration and geo-temporal localization using synthetic and real data. (c) 2010 Elsevier Inc. All rights reserved.", "paper_title": "GPS coordinates estimation and camera calibration from solar shadows", "paper_id": "WOS:000281542200001"}