{"auto_keywords": [{"score": 0.04579719782409401, "phrase": "computer_use"}, {"score": 0.015272243466023572, "phrase": "secondary_school"}, {"score": 0.007045948647992357, "phrase": "ict_competences"}, {"score": 0.00481495049065317, "phrase": "university_freshmen"}, {"score": 0.00455512808829153, "phrase": "different_expectations"}, {"score": 0.004411133688356589, "phrase": "la_competences"}, {"score": 0.004100523428283358, "phrase": "ict"}, {"score": 0.0037344915013985762, "phrase": "panel_research"}, {"score": 0.0036803189470937235, "phrase": "large_university"}, {"score": 0.0029127672735266836, "phrase": "basic_components"}, {"score": 0.00289577845874603, "phrase": "unified_theory_of_acceptance"}, {"score": 0.0028788884457126643, "phrase": "use_of_technology"}, {"score": 0.0028620995381201625, "phrase": "venkatesh"}, {"score": 0.002845411223457603, "phrase": "morris"}, {"score": 0.0028288230955928967, "phrase": "davis"}, {"score": 0.0027472573325469144, "phrase": "questions_students"}, {"score": 0.0026837101137439207, "phrase": "useful_instrument"}, {"score": 0.0025911275961924486, "phrase": "internet_competence"}, {"score": 0.0024154111611296215, "phrase": "web_site"}, {"score": 0.002380327476198495, "phrase": "basic_ict_skills"}, {"score": 0.002332062766342444, "phrase": "internet_usage"}, {"score": 0.002258183361711707, "phrase": "different_frequencies"}, {"score": 0.00216118788395907, "phrase": "ict_skills"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd"}], "paper_keywords": ["Pedagogical issues", " Post-secondary education", " Media in education", " Country-specific developments"], "paper_abstract": "The passage from secondary school to university puts students in an environment with different expectations. Not only the expectations towards learning might change, but also towards la competences and computer use. The purpose of this article is to find out whether freshmen, after 6 months at the university, changed their self-perception of ICT competences and computer use in comparison with their behaviour at secondary school, and what factors can explain the self-perception of ICT competences and computer use in secondary school, in the university and their possible change Based on a panel research among 714 freshmen of a large university, this article answers the following questions. (1) What is the self-perception of ICT competences among freshmen and is there a change in this self-perception 6 months after entering the university? (2) How often and for what purpose do freshmen use a computer and is there a change in the frequency of the use of a computer? (3) What factors might influence this attitude. behaviour, and possible change? In function of the basic components of Unified Theory of Acceptance and Use of Technology (Venkatesh, Morris, Davis, & Davis, 2003) hypotheses was developed and tested to answer these questions Students who consider the computer to be a useful instrument, have control over the computer, possess a certain level of Internet competence, and are at ease with computers are more likely to have the skills needed to maintain a computer, to develop a web site, and to use basic ICT skills. The predictors have little influence on Internet usage. The same predictors contribute modestly to the explanation of the different frequencies of computer use, and a few of the predictors explain parts of change in ICT skills and frequency of computer use (C) 2009 Elsevier Ltd All rights reserved.", "paper_title": "Information and communication technologies in the life of university freshmen: An analysis of change", "paper_id": "WOS:000277110400006"}