{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "pose_estimation"}, {"score": 0.004757227624616643, "phrase": "single_ultrasound_image"}, {"score": 0.004671932143798307, "phrase": "fast_registration"}, {"score": 0.0036700484729006136, "phrase": "novel_registration_method"}, {"score": 0.003496994062890991, "phrase": "fine_ip_representation"}, {"score": 0.003352256019007896, "phrase": "high-speed_and_reliable_registration"}, {"score": 0.0030251262102203385, "phrase": "high_degree"}, {"score": 0.0029887957779347394, "phrase": "ip_model"}, {"score": 0.00291743479583421, "phrase": "previous_ip-to-point_based_methods"}, {"score": 0.0026970382454914437, "phrase": "pair-wised_correspondences"}, {"score": 0.002419025278429845, "phrase": "experimental_result"}, {"score": 0.0023755529073496394, "phrase": "good_performance"}, {"score": 0.0022361964497681934, "phrase": "unconstrained_freehand_ultrasound_data"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Ultrasound (US) image", " Pose estimation", " 3D image registration", " Implicit polynomial"], "paper_abstract": "A fast registration making use of implicit polynomial (IP) models is helpful for the real-time pose estimation from single clinical free-hand Ultrasound (US) image, because it is superior in the areas such as robustness against image noise, fast registration without enquiring correspondences, and fast IP coefficient transformation. However it might lead to the lack of accuracy or failure registration. In this paper, we present a novel registration method based on a coarse-to-fine IP representation. The approach starts from a high-speed and reliable registration with a coarse (of low degree) IP model and stops when the desired accuracy is achieved by a fine (of high degree) IP model. Over the previous IP-to-point based methods our contributions are: (i) keeping the efficiency without requiring pair-wised correspondences, (ii) enhancing the robustness, and (iii) improving the accuracy. The experimental result demonstrates the good performance of our registration method and its capabilities of overcoming the limitations of unconstrained freehand ultrasound data, resulting in fast, robust and accurate registration. (C) 2013 Elsevier Inc. All rights reserved.", "paper_title": "A coarse-to-fine IP-driven registration for pose estimation from single ultrasound image", "paper_id": "WOS:000326136600002"}