{"auto_keywords": [{"score": 0.0451899121189974, "phrase": "decision_makers"}, {"score": 0.00481495049065317, "phrase": "precise_consistency_consensus_matrix"}, {"score": 0.004768196060187511, "phrase": "precise_consensus_consistency_matrix"}, {"score": 0.004615587054831451, "phrase": "aguaron"}, {"score": 0.00445332728705756, "phrase": "local_context"}, {"score": 0.004213662826578328, "phrase": "row_geometric_mean"}, {"score": 0.004172722575842674, "phrase": "prioritisation_procedure"}, {"score": 0.004065474891313382, "phrase": "different_decision_makers"}, {"score": 0.003663250792230243, "phrase": "pccm"}, {"score": 0.0035228596881051763, "phrase": "different_weights"}, {"score": 0.0032157824854214313, "phrase": "decisional_tool"}, {"score": 0.0031127040190005216, "phrase": "complete_matrix"}, {"score": 0.0029836109362668586, "phrase": "complete_common_consensus_judgement_matrix"}, {"score": 0.0028879529188983524, "phrase": "minimum_number"}, {"score": 0.002543224008253855, "phrase": "ahp-gdm."}, {"score": 0.002374931094109485, "phrase": "group_pairwise_matrices"}, {"score": 0.002313783044225099, "phrase": "group_positions"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Group Decision Making (GDM)", " Consensus", " Analytic Hierarchy Process (AHP)", " Consistency", " Compatibility"], "paper_abstract": "The Precise Consensus Consistency Matrix (PCCM) is an AHP-Group Decision Making (AHP-GDM) tool, defined by Aguaron et al. [2] and developed in a local context (a single criterion) in which the decision makers are assigned the same weights. Using the Row Geometric Mean as the prioritisation procedure, consensus is-sought between the different decision makers when the modifications of their initial positions or judgements are guaranteed to be within the range of values accepted for a given inconsistency level. This paper upgrades the algorithm initially proposed for obtaining the PCCM in two ways: (i) it considers the case of different weights for the decision makers; and (ii) it strengthens the idea of consistency in the design of the algorithm. One of the drawbacks of this decisional tool is that it is sometimes impossible to achieve a complete matrix. To address this, we propose a procedure for attaining a complete common consensus judgement matrix or, at least, a matrix with the minimum number of entries that are required to derive the priorities. Finally, we compare the results obtained when applying the extensions of the PCCM with those obtained using the two traditional procedures (AIJ and AIP) usually employed in AHP-GDM. In order to do this, we use a set of indicators that measure the violations in consistency of the group pairwise matrices and the compatibility between the individuals and group positions in four cases associated with two scenarios (weighted and non-weighted decision makers) and two situations (complete and incomplete PCCMs). (C) 2015 Elsevier B.V. All rights reserved.", "paper_title": "Some extensions of the precise consistency consensus matrix", "paper_id": "WOS:000355882700006"}