{"auto_keywords": [{"score": 0.03291333527533215, "phrase": "data_sets"}, {"score": 0.03150716787411208, "phrase": "data_set"}, {"score": 0.02762894797470631, "phrase": "matthew's_correlation_coefficient"}, {"score": 0.004342430078306461, "phrase": "jun_n-terminal"}, {"score": 0.004284302478991387, "phrase": "previously_unpublished_activities"}, {"score": 0.004226949670141375, "phrase": "diverse_set"}, {"score": 0.004096082254543022, "phrase": "important_pharmaceutical_target"}, {"score": 0.0038119123317396954, "phrase": "increasing_interest"}, {"score": 0.003071965703296204, "phrase": "agglomerative_clustering"}, {"score": 0.003044455555031339, "phrase": "feature_trees"}, {"score": 0.0027575842698911173, "phrase": "learning_algorithms"}, {"score": 0.0027206133859493725, "phrase": "convincing_performance"}, {"score": 0.0026362590493392785, "phrase": "random_decision_forest_classifier"}, {"score": 0.002398529964696261, "phrase": "support_vector_machine"}, {"score": 0.0021821915946356168, "phrase": "reasonable_basis"}, {"score": 0.0021529183360603434, "phrase": "qsar_models"}], "paper_keywords": [""], "paper_abstract": "The goal of this paper is to present and describe a novel 2D-. and 3D-QSAR (quantitative structure activity relationship) binary classification data set for the inhibition of c-Jun N-terminal kinase-3 with previously unpublished activities for a diverse set of compounds. JNK3 is an important pharmaceutical target because it is involved in many neurological disorders. Accordingly, the development of JNK3 inhibitors has gained increasing interest. 2D and 3D versions of the data set were used, consisting of 313 (70 actives) and 249 (60 actives) compounds, respectively. All compounds, for which activity was only determined for the racemate, were removed from the 3D data set. We investigated the diversity of the data sets by an agglomerative clustering with feature trees and show that the data set contains several different scaffolds. Furthermore, we show that the benchmarks can be tackled with standard supervised learning algorithms with a convincing performance. For the 2D problem, a random decision forest classifier achieves a Matthew's correlation coefficient of 0.744, the 3D problem could be modeled with a Matthew's correlation coefficient of 0.524 with 3D pharmacophores and a support vector machine. The performance of both data sets was evaluated within a nested 10-fold cross-validation. We therefore suggest that the data set is a reasonable basis for generating QSAR models for JNK3 because of its diverse composition and the performance of the classifiers presented in this study.", "paper_title": "Modeling and Benchmark Data Set for the inhibition of c-Jun N-terminal Kinase-3", "paper_id": "WOS:000288738000014"}