{"auto_keywords": [{"score": 0.028048543728099447, "phrase": "imposed-deep_misalignments"}, {"score": 0.026484264908182478, "phrase": "organisational_adaptation"}, {"score": 0.00481495049065317, "phrase": "package-organisation_misalignment"}, {"score": 0.004636594774238505, "phrase": "today's_'best_practice"}, {"score": 0.004559451202070545, "phrase": "commercial_packages"}, {"score": 0.004483585361583022, "phrase": "significant_alignment_challenges"}, {"score": 0.004335603324413586, "phrase": "conceptual_framework"}, {"score": 0.00426344619171077, "phrase": "institutional_theory"}, {"score": 0.00422781730455246, "phrase": "systems_ontology"}, {"score": 0.004105435059094976, "phrase": "package_functionality"}, {"score": 0.004071121244999291, "phrase": "organisational_requirements"}, {"score": 0.0035001037990786727, "phrase": "organisational_reality"}, {"score": 0.0034130176595901104, "phrase": "deep_or_surface_structure"}, {"score": 0.00330025288273863, "phrase": "institutional-ontological_dimensions"}, {"score": 0.0031778255332904487, "phrase": "varying_degrees"}, {"score": 0.002789763110395331, "phrase": "package_implementations"}, {"score": 0.0025974077149412, "phrase": "package_customisation"}, {"score": 0.0025541050375256992, "phrase": "voluntary-deep_misalignments"}, {"score": 0.0023481578019624843, "phrase": "project_success"}, {"score": 0.0021049977753042253, "phrase": "package_vendors"}], "paper_keywords": ["enterprise systems", " institutional theory", " ontology", " misalignments", " package software"], "paper_abstract": "Even with today's 'best practice' software, commercial packages continue to pose significant alignment challenges for many organisations. This paper proposes a conceptual framework, based on institutional theory and systems ontology, to assess the misalignments between package functionality and organisational requirements. We suggest that these misalignments can arise from incompatibility in the externally imposed or voluntarily adopted structures embedded in the organisation and package, as well as differences in the way the meaning of organisational reality is ontologically represented in the deep or surface structure of packages. The synthesis of the institutional-ontological dimensions leads us to identify four types of misalignments with varying degrees of severity - imposed-deep, imposed-surface, voluntary-deep, and voluntary-surface - and to predict their likely resolution. We test the predictions using over 400 misalignments from package implementations at three different sites. The findings support the predictions: the majority of imposed-deep misalignments were resolved via package customisation. Imposed-surface and voluntary-deep misalignments were more often resolved via organisational adaptation and voluntary-surface misalignments were almost always resolved via organisational adaptation. The extent of project success also appeared to be influenced by the number of misalignments and the proportion of imposed-deep misalignments. We conclude by suggesting strategies that implementing organisations and package vendors may pursue.", "paper_title": "An assessment of package-organisation misalignment: institutional and ontological structures", "paper_id": "WOS:000250548900006"}