{"auto_keywords": [{"score": 0.04299413967561597, "phrase": "user_interface"}, {"score": 0.012206796093460492, "phrase": "goms_method"}, {"score": 0.00481495049065317, "phrase": "electronic_health_record"}, {"score": 0.004749323365717064, "phrase": "cognitive_task_analysis"}, {"score": 0.004557735965224235, "phrase": "user-friendly_interfaces"}, {"score": 0.004483272938890684, "phrase": "systematic_consideration"}, {"score": 0.004458722048888919, "phrase": "human-centered_computing_issues"}, {"score": 0.004197338787696244, "phrase": "ehr_system"}, {"score": 0.003994872377856364, "phrase": "armed_forces_health_longitudinal_technology_application"}, {"score": 0.00379170322821611, "phrase": "associated_technique"}, {"score": 0.0036687237385177713, "phrase": "ahlta_user_interface"}, {"score": 0.0034725269588525534, "phrase": "inter-rater_reliability"}, {"score": 0.003332281171280241, "phrase": "klm"}, {"score": 0.0032958350763039866, "phrase": "execution_time"}, {"score": 0.0030684790391897836, "phrase": "ahlta_users"}, {"score": 0.0028100102841877835, "phrase": "system_response_time"}, {"score": 0.0027869214641194646, "phrase": "data_entry"}, {"score": 0.0025874530719850156, "phrase": "good_reliability"}, {"score": 0.002442210408593024, "phrase": "ahlta"}, {"score": 0.0023890446405639082, "phrase": "average_total_steps"}, {"score": 0.0023694065215394593, "phrase": "common_tasks"}, {"score": 0.0022673579319079833, "phrase": "mental_operators"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ireland_ltd."}], "paper_keywords": ["Electronic Health Records", " Cognitive Task Analysis", " Distributed cognition", " UFuRT", " GOMS", " KLM"], "paper_abstract": "Background: Many Electronic Health Record (EHR) systems fail to provide user-friendly interfaces due to the lack of systematic consideration of human-centered computing issues. Such interfaces can be improved to provide easy to use, easy to learn, and error-resistant EHR systems to the users. Objective: To evaluate the usability of an EHR system and suggest areas of improvement in the user interface. Methods: The user interface of the AHLTA (Armed Forces Health Longitudinal Technology Application) was analyzed using the Cognitive Task Analysis (CTA) method called GOMS (Goals, Operators, Methods, and Selection rules) and an associated technique called KLM (Keystroke Level Model). The GOMS method was used to evaluate the AHLTA user interface by classifying each step of a given task into Mental (Internal) or Physical (External) operators. This analysis was performed by two analysts independently and the inter-rater reliability was computed to verify the reliability of the GOMS method. Further evaluation was performed using KLM to estimate the execution time required to perform the given task through application of its standard set of operators. Results: The results are based on the analysis of 14 prototypical tasks performed by AHLTA users. The results show that on average a user needs to go through 106 steps to complete a task. To perform all 14 tasks, they would spend about 22 min (independent of system response time) for data entry, of which 11 min are spent on more effortful mental operators. The inter-rater reliability analysis performed for all 14 taskswas 0.8 (kappa), indicating good reliability of the method. Conclusion: This paper empirically reveals and identifies the following finding related to the performance of AHLTA: (1) large number of average total steps to complete common tasks, (2) high average execution time and (3) large percentage of mental operators. The user interface can be improved by reducing (a) the total number of steps and (b) the percentage of mental effort, required for the tasks. (C) 2010 Elsevier Ireland Ltd. All rights reserved.", "paper_title": "Assessing performance of an Electronic Health Record (EHR) using Cognitive Task Analysis", "paper_id": "WOS:000278193500004"}