{"auto_keywords": [{"score": 0.04107868567004354, "phrase": "gaussian_mac"}, {"score": 0.03491463327749827, "phrase": "cut-set_bound"}, {"score": 0.02198464728695054, "phrase": "mac"}, {"score": 0.017170212805406097, "phrase": "channel_model"}, {"score": 0.01591667226231168, "phrase": "nonzero_values"}, {"score": 0.012451522758623481, "phrase": "cooperation_noise_variances"}, {"score": 0.007525229195811362, "phrase": "feedback_noise_variances"}, {"score": 0.006689325540853234, "phrase": "capacity_region"}, {"score": 0.0058414999611605236, "phrase": "cooperation_noises"}, {"score": 0.00481495049065317, "phrase": "gaussian_networks"}, {"score": 0.004759409166243553, "phrase": "feedback"}, {"score": 0.0047026237903774895, "phrase": "new_outer_bounds"}, {"score": 0.004661176995136095, "phrase": "capacity_regions"}, {"score": 0.004620093797504386, "phrase": "two-user_multiple_access_channel"}, {"score": 0.004394005938106429, "phrase": "generalized_feedback"}, {"score": 0.0042914569949699015, "phrase": "outer_bounds"}, {"score": 0.00420368356873615, "phrase": "dependence_balance"}, {"score": 0.00414208537223403, "phrase": "hekstra"}, {"score": 0.004117700605554647, "phrase": "willems"}, {"score": 0.0038930368103015467, "phrase": "noisy_feedback"}, {"score": 0.003802135020791801, "phrase": "transmitter_k"}, {"score": 0.003626626504149897, "phrase": "channel_output"}, {"score": 0.002804413067224272, "phrase": "additive_white_gaussian_noise"}, {"score": 0.002763261749602258, "phrase": "channel_input"}, {"score": 0.0022665781920241245, "phrase": "gaussian_ic"}, {"score": 0.0021049977753042253, "phrase": "mac-uc_channel_model"}], "paper_keywords": ["Dependence balance", " generalized feedback", " user cooperation", " noisy feedback"], "paper_abstract": "We obtain new outer bounds on the capacity regions of the two-user multiple access channel with generalized feedback (MAC-GF) and the two-user interference channel with generalized feedback (IC-GF). These outer bounds are based on the idea of dependence balance which was proposed by Hekstra and Willems. To illustrate the usefulness of our outer bounds, we investigate three different channel models. We first consider a Gaussian MAC with noisy feedback (MAC-NF), where transmitter k, k = 1, 2, receives a feedback Y(Fk), which is the channel output corrupted with additive white Gaussian noise Z(k). For this channel model, the cut-set outer bound is not sensitive to the feedback noise variances. We demonstrate that our outer bound improves upon the cut-set bound for all nonzero values of the feedback noise variances. Moreover, in the limit as sigma(2)(Zk) -> infinity, k = 1, 2, our outer bound collapses to the capacity region of the Gaussian MAC without feedback. Secondly, we investigate a Gaussian MAC with user-cooperation (MAC-UC), where each transmitter receives an additive white Gaussian noise corrupted version of the channel input of the other transmitter. For this channel model, the cut-set bound is sensitive to the cooperation noises, but not sensitive enough. For all nonzero values of cooperation noise variances, our outer bound strictly improves upon the cut-set outer bound. Moreover, as the cooperation noises become large, our outer bound collapses to the capacity region of the Gaussian MAC without cooperation. Thirdly, we investigate a Gaussian IC with user-cooperation (IC-UC). For this channel model, the cut-set bound is again sensitive to cooperation noise variances as in the case of MAC-UC channel model, but not sensitive enough. We demonstrate that our outer bound strictly improves upon the cut-set bound for all nonzero values of cooperation noise variances.", "paper_title": "Dependence Balance Based Outer Bounds for Gaussian Networks With Cooperation and Feedback", "paper_id": "WOS:000291922500005"}