{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "population_genetic_data_simulation"}, {"score": 0.004670896353428476, "phrase": "population_genetics"}, {"score": 0.004586531354697466, "phrase": "important_role"}, {"score": 0.004212453011596424, "phrase": "sequence_patterns"}, {"score": 0.003916098498242888, "phrase": "analytical_methods"}, {"score": 0.0037988336463795963, "phrase": "disease-associated_genetic_factors"}, {"score": 0.003384262486955773, "phrase": "complex_genomic_data"}, {"score": 0.0032039415997394817, "phrase": "efficient_simulation_software_packages"}, {"score": 0.00316518932828897, "phrase": "large-scale_genomic_data"}, {"score": 0.003070340620983981, "phrase": "new_simulation_programs"}, {"score": 0.0026209522797963447, "phrase": "existing_simulators"}, {"score": 0.0022101055924375725, "phrase": "current_simulation_algorithms"}, {"score": 0.0021700901058417602, "phrase": "future_challenges"}], "paper_keywords": ["backward simulators", " disease association study", " forward simulators", " genome simulation", " resampling"], "paper_abstract": "Simulation studies in population genetics play an important role in helping to better understand the impact of various evolutionary and demographic scenarios on sequence variation and sequence patterns, and they also permit investigators to better assess and design analytical methods in the study of disease-associated genetic factors. To facilitate these studies, it is imperative to develop simulators with the capability to accurately generate complex genomic data under various genetic models. Currently, a number of efficient simulation software packages for large-scale genomic data are available, and new simulation programs with more sophisticated capabilities and features continue to emerge. In this article, we review the three basic simulation frameworks-coalescent, forward, and resampling- and some of the existing simulators that fall under these frameworks, comparing them with respect to their evolutionary and demographic scenarios, their computational complexity, and their specific applications. Additionally, we address some limitations in current simulation algorithms and discuss future challenges in the development of more powerful simulation tools.", "paper_title": "An Overview of Population Genetic Data Simulation", "paper_id": "WOS:000298969900004"}